#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ОбрабатываемыйФормат;
Перем ВалютаРеглУчета;
Перем ПеременнаяЭкспорта;
Перем Задание;   
Перем Файл;
Перем ВсеОбъектыВОдномФайле;
Перем ОбъектыВФайл;
Перем ВидОбмена;
Перем СхемаДанныхДляФайлаПередачи;
Перем СоответствиеОбработанныхФорматов Экспорт;
Перем ОдинДокументСписокФайлов;

Перем РазрешенныеОбщиеМодули;
Перем ЗаменяемыеСлова;
Перем ЗаменяющиеСлова;
Перем ОписаниеОшибки;
Перем ДействиеНадФайлом;

Перем ПорядковыйНомерФайлаЗаСессию;

Перем СообщилиОбИмпорте;

Перем ИдентификаторСообщения Экспорт; //Идентификатор сообщения для сообщений СМЭВ 3.0 (ГИС ГМП 2.0)
Перем мОрганизация Экспорт; //Организация для передачи в параметры СКД при выгрузке

//если возможна выгрузка списка документов в один файл, можно ограничить количество документов в файле
//0 - без ограничений, по умолчанию - 0
Перем КоличествоДокументовВОдномФайле Экспорт; 
Перем ОбменСЭмулятором Экспорт;//Признак тестового сообщения при о обмене со СМЭВ 3.0 (ГИС ГМП 2.0), булево

Перем МассивИдентификаторовСообщений Экспорт; //Массив идентификаторов сообщений при обменен с ЕИС
Перем ТестовыйОбмен Экспорт; //Признак тестового обмена при обмене с ЕИС, булево

Перем ДополнительныеПараметрыЭкспорта Экспорт; //можно передать структуру параметров, которые будут использоваться в форматах экспорта

//параметры для формирования таблиц в форматах экспорта для обмена с ГИС ГМП
Перем МассивОтбораПоУчастникам Экспорт;
Перем МассивОтбораПоКБК Экспорт;
Перем МассивОтбораПоИдентификаторам Экспорт;

Перем СоотвествиеФорматовРабочимСтруктурам; 

#КонецОбласти

#Область ПрограммныйИнтерфейс

//Формирование файлов без задания на экспорт
//
Функция ПолучитьСтруктуруДляФормированияФайла(ВидОбмена = Неопределено, Организация = Неопределено, Дата = Неопределено, 
	Знач МассивСсылок=Неопределено, Формат=Неопределено, Знач НастройкаОбмена = Неопределено) Экспорт
	
	ТекНастройкаОбмена = НастройкаОбмена;
	Если НастройкаОбмена = Неопределено Тогда
		ТекНастройкаОбмена = Справочники.НастройкиОбменаБанкиКС.ПустаяСсылка();
	КонецЕсли;
	Если МассивСсылок = Неопределено Тогда
		МассивСсылок = Новый Массив;
	КонецЕсли;
	
	СтруктураДляФормирования = Новый Структура("Организация,Дата,ВидОбмена,НастройкаОбмена,КассовыйОрган",Организация,Дата,ВидОбмена,ТекНастройкаОбмена,Неопределено);
	СтруктураДляФормирования.Вставить("Ссылка",Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяСсылка());
	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ТаблицаОбъектов.Колонки.Добавить("Объект");
	ТаблицаОбъектов.Колонки.Добавить("Формат");
	ТаблицаОбъектов.Колонки.Добавить("РезультатФормирования");
	ТаблицаОбъектов.Колонки.Добавить("ИмяФайлаВыгрузки");
	ТаблицаОбъектов.Колонки.Добавить("ОписаниеОшибки");
	Для Каждого ЭлМас Из МассивСсылок Цикл
		НовСтр = ТаблицаОбъектов.Добавить();
		НовСтр.Объект = ЭлМас;
		НовСтр.Формат = Формат;
	КонецЦикла;
	СтруктураДляФормирования.Вставить("ОбъектыОбмена",ТаблицаОбъектов);
	
	Возврат СтруктураДляФормирования;
КонецФункции

Процедура ЗагрузитьОбъекты(Задание, Отказ = Ложь, ДанныеНовыхКонтрагентов = "") Экспорт
	
	//Перем ПараметрыГруппировок; // соответствие. содержит параметры группировок, по каждой группе заголовков файла
	Перем РеквизитыСтруктурыВРасшифровке; // соответствие. содержит имена параметров макета и соответствующи им имена полей
	Перем СоответствиеРеквизитовШапки;
	Перем ПроцедурыОбработкиСтрок;
	Перем СостояниеПлатежноРасчетныхДокументов;
	//Перем СоответствиеРеквизитовГруппировок;
	
	Организация             = Задание.Организация;
	КассовыйОрган 	        = Задание.КассовыйОрган;
	ВидОбмена       	    = Задание.ВидОбмена;
	
	ДанныеНовыхКонтрагентов = Новый ТаблицаЗначений;
	ДанныеНовыхКонтрагентов.Колонки.Добавить("Наименование");
	ДанныеНовыхКонтрагентов.Колонки.Добавить("ИНН");
    ДанныеНовыхКонтрагентов.Колонки.Добавить("КПП");
    ДанныеНовыхКонтрагентов.Колонки.Добавить("КодПоРПБС");
    ДанныеНовыхКонтрагентов.Колонки.Добавить("ЭтоФизическоеЛицо");
	ДанныеНовыхКонтрагентов.Колонки.Добавить("ДокументСсылка");
	ДанныеНовыхКонтрагентов.Колонки.Добавить("ИмяРеквизита");	
	ДанныеНовыхКонтрагентов.Колонки.Добавить("ИмяТабличнойЧасти");
	ДанныеНовыхКонтрагентов.Колонки.Добавить("НомерСтроки");
	
	Если ТипЗнч(Задание) = Тип("ДокументСсылка.ЗаданиеНаИмпортДанныхБанкиКС") Тогда
		 Задание = Задание.ПолучитьОбъект();
	КонецЕсли;
	
	// сохраним организацию во временное хранилище, чтобы потом использовать ее при вызове функций при вычислении полей СКД
	ПоместитьВоВременноеХранилище(Организация, БиблиотекаФункцийОбменаПовтИсп.ПолучитьОбъектВоВременномХранилище());
	
	Для каждого ФайлОбъекта из Задание.ФайлыОбмена цикл
		ФайлОбъекта.Описание = "";
		ФайлОбъекта.ОписаниеОшибки = "";
	КонецЦикла;	
	
	Задание.ОбъектыОбмена.Очистить();
	
	Запрос = Новый Запрос(?(ВидОбмена.ПредставлениеВНомереВерсии  = "TXL", ТекстЗапросаЗадание_TXL(), ТекстЗапросаЗадание()));  
	
	Запрос.УстановитьПараметр("Ссылка",Задание.Ссылка);
	Запрос.УстановитьПараметр("Организация",Задание.Организация);  
	Запрос.УстановитьПараметр("Дата", Задание.Дата); 
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
		
	ОписаниеОбъектаОшибки = Новый ТаблицаЗначений;
	ОписаниеОбъектаОшибки.Колонки.Добавить("ПолеФайла", , "Поле файла передачи");
	ОписаниеОбъектаОшибки.Колонки.Добавить("Ошибка",    , "Ошибка заполнения поля файла передачи");

	
	Если ВидОбмена.ПредставлениеВНомереВерсии <> "TXL" Тогда
			
		ФайлыОбмена = МассивРезультатов[1].Выгрузить();			   
		
		// создадим таблицу для поиска соответствий между файлом и его расшифровкой
		СоответствияФайлов = Новый ТаблицаЗначений;
		СоответствияФайлов.Колонки.Добавить("ОсновнойФайл", 				Новый ОписаниеТипов("Строка"));
		СоответствияФайлов.Колонки.Добавить("ТекстОсновногоФайла", 			Новый ОписаниеТипов("Строка"));
		СоответствияФайлов.Колонки.Добавить("НомерСтрокиОсновногоФайла", 	Новый ОписаниеТипов("Число"));
		СоответствияФайлов.Колонки.Добавить("ФорматОсновногоФайла", 		Новый ОписаниеТипов("СправочникСсылка.ФорматыОбменаБанкиКС"));
		СоответствияФайлов.Колонки.Добавить("ИмяОсновногоФайла", 			Новый ОписаниеТипов("Строка"));
		СоответствияФайлов.Колонки.Добавить("ФайлСтруктура", 				Новый ОписаниеТипов("Строка"));
		СоответствияФайлов.Колонки.Добавить("ТекстФайлаСтруктура", 			Новый ОписаниеТипов("Строка"));
		СоответствияФайлов.Колонки.Добавить("НомерСтрокиФайлаСтруктура",	Новый ОписаниеТипов("Число"));
		СоответствияФайлов.Колонки.Добавить("ФорматФайлаСтруктура", 		Новый ОписаниеТипов("СправочникСсылка.ФорматыОбменаБанкиКС"));
		СоответствияФайлов.Колонки.Добавить("ФайлСтруктура_ВО", 			Новый ОписаниеТипов("Строка"));
		СоответствияФайлов.Колонки.Добавить("ТекстФайлаСтруктура_ВО",		Новый ОписаниеТипов("Строка"));
		СоответствияФайлов.Колонки.Добавить("НомерСтрокиФайлаСтруктура_ВО",	Новый ОписаниеТипов("Число"));
		СоответствияФайлов.Колонки.Добавить("ФорматФайлаСтруктура_ВО", 		Новый ОписаниеТипов("СправочникСсылка.ФорматыОбменаБанкиКС"));
		
		//ФК-БС
		СоответствияФайлов.Колонки.Добавить("ФайлСтруктура_ВС", 			Новый ОписаниеТипов("Строка"));
		СоответствияФайлов.Колонки.Добавить("ТекстФайлаСтруктура_ВС",		Новый ОписаниеТипов("Строка"));
		СоответствияФайлов.Колонки.Добавить("НомерСтрокиФайлаСтруктура_ВС",	Новый ОписаниеТипов("Число"));
		СоответствияФайлов.Колонки.Добавить("ФорматФайлаСтруктура_ВС", 		Новый ОписаниеТипов("СправочникСсылка.ФорматыОбменаБанкиКС"));
		
		ФайлыРасшифровки = Новый ТаблицаЗначений;
		ФайлыРасшифровки.Колонки.Добавить("ИмяФайла", 				        Новый ОписаниеТипов("Строка"));
		ФайлыРасшифровки.Колонки.Добавить("ТекстФайла", 				    Новый ОписаниеТипов("Строка"));
		ФайлыРасшифровки.Колонки.Добавить("НомерСтроки",                 	Новый ОписаниеТипов("Число"));
		ФайлыРасшифровки.Колонки.Добавить("ФорматФайла", 		            Новый ОписаниеТипов("СправочникСсылка.ФорматыОбменаБанкиКС"));
		
		//НачатьТранзакцию();
		//Попытка
			
		Для Каждого СтрокаДокумента Из ФайлыОбмена Цикл
			
			ОписаниеОбъектаОшибки.Очистить();
			
			Если ЗначениеЗаполнено(СтрокаДокумента.ИмяФайла) 
				И НЕ(ВидОбмена.ПредставлениеВНомереВерсии = "KB")
				И НЕ(ВидОбмена.ПредставлениеВНомереВерсии = "RFI")
				И НЕ(ВидОбмена.ПредставлениеВНомереВерсии = "UNIFO")
				И НЕ(ВидОбмена.ПредставлениеВНомереВерсии = "GY") 
				И ((ВидОбмена.ПредставлениеВНомереВерсии  = "TX") И (Год(СтрокаДокумента.Регистратор.Дата) = Год(Задание.Дата)))Тогда
				// для обмена с ОФК уникальность имени файла поддерживается в пределах года
				
				СтрокаОписания = ОписаниеОбъектаОшибки.Добавить();
				СтрокаОписания.ПолеФайла = НСтр("ru='Файл был загружен ранее'"); //СтрокаВСхеме.ПолеФайла;
				СтрокаОписания.Ошибка    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
																		НСтр("ru='Объекты, описанные в этом файле были загружены ранее документом: [Документ]'"),
																		Новый Структура("Документ", Строка(СтрокаДокумента.Регистратор)));;
				ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), СтрокаДокумента.НомерСтроки);
				
				Продолжить;
				
			КонецЕсли;
			
			ИмяФайлаБезРасширения = "";
			ТекстФайла  = СодержимоеФайла(Задание.Ссылка, СтрокаДокумента.ИмяФайлаЗагрузки, ВидОбмена, ИмяФайлаБезРасширения);
			Если НРег(Прав(СтрокаДокумента.ИмяФайлаЗагрузки, 3)) = "xml" Тогда
				//Оставляем имя как есть
			Иначе
				//ИмяФайлаБезРасширения = ИмяФайлаБезРасширения+".**"+Прав(СтрокаДокумента.ИмяФайлаЗагрузки, 1);
				ИмяФайлаБезРасширения = Сред(ИмяФайлаБезРасширения,1,СтрДлина(ИмяФайлаБезРасширения)-2);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекстФайла) Тогда
				СтрокаДокумента.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(	НСтр("ru='Не удалось прочитать файл [ИмяФайлаЗагрузки]'"),
																										Новый Структура("ИмяФайлаЗагрузки", СтрокаДокумента.ИмяФайлаЗагрузки));
				Продолжить;
			КонецЕсли;
			
			СтрокаФайла = СоответствияФайлов.Найти(ИмяФайлаБезРасширения, "ИмяОсновногоФайла");
			Если СтрокаФайла = Неопределено Тогда
				СтрокаФайла = СоответствияФайлов.Добавить();
				СтрокаФайла.ИмяОсновногоФайла = ИмяФайлаБезРасширения;
			КонецЕсли;
			
			Если СтрокаДокумента.ТипОбъекта = "Структура" Тогда
				
				НовыйФайлРасшифровки             = ФайлыРасшифровки.Добавить();
				НовыйФайлРасшифровки.ИмяФайла    = СтрокаДокумента.ИмяФайлаЗагрузки;
				НовыйФайлРасшифровки.ТекстФайла  = ТекстФайла;
				НовыйФайлРасшифровки.НомерСтроки = СтрокаДокумента.НомерСтроки;
				НовыйФайлРасшифровки.ФорматФайла = СтрокаДокумента.Формат;

				Для Каждого СтрокаТЧ Из СоответствияФайлов Цикл
					
					Если ИмяФайлаБезРасширения <> СтрокаТЧ.ИмяОсновногоФайла Тогда
						 Продолжить;
					КонецЕсли;	
					//ФК-БС
					Постфикс = "";
					Если СтрНайти(СтрокаДокумента.Формат, "BH") > 0 Тогда
						Постфикс = "_ВО";
					ИначеЕсли СтрНайти(СтрокаДокумента.Формат, "SP") > 0 Тогда	
		                Постфикс = "_ВС";
					КонецЕсли;	
					
					//Постфикс = ?(Найти(СтрокаДокумента.Формат, "BH") > 0, "_ВО", "");
					
					Если НЕ ЗначениеЗаполнено(СтрокаТЧ["ФайлСтруктура" + Постфикс]) Тогда
						
						СтрокаТЧ["ФайлСтруктура"            + Постфикс] = СтрокаДокумента.ИмяФайлаЗагрузки;
						СтрокаТЧ["ТекстФайлаСтруктура"      + Постфикс] = ТекстФайла;
						СтрокаТЧ["НомерСтрокиФайлаСтруктура"+ Постфикс]	= СтрокаДокумента.НомерСтроки;
						СтрокаТЧ["ФорматФайлаСтруктура"     + Постфикс] = СтрокаДокумента.Формат;	
						
					КонецЕсли;
					
				КонецЦикла;
			Иначе
				Если НЕ ЗначениеЗаполнено(СтрокаФайла.ОсновнойФайл) Тогда
					СтрокаФайла.ОсновнойФайл 				= СтрокаДокумента.ИмяФайлаЗагрузки;
					СтрокаФайла.ТекстОсновногоФайла 		= ТекстФайла;
					СтрокаФайла.НомерСтрокиОсновногоФайла 	= СтрокаДокумента.НомерСтроки;
					СтрокаФайла.ФорматОсновногоФайла 		= СтрокаДокумента.Формат;
				Иначе
					НовСтрокаФайла = СоответствияФайлов.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрокаФайла,СтрокаФайла);
					НовСтрокаФайла.ОсновнойФайл 			= СтрокаДокумента.ИмяФайлаЗагрузки;
					НовСтрокаФайла.ТекстОсновногоФайла 		= ТекстФайла;
					НовСтрокаФайла.НомерСтрокиОсновногоФайла= СтрокаДокумента.НомерСтроки;
					НовСтрокаФайла.ФорматОсновногоФайла 	= СтрокаДокумента.Формат;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;    
		
	Иначе
		
		СоответствияФайлов = МассивРезультатов[1].Выгрузить();	
		
		СоответствияФайлов.Колонки.Добавить("ТекстОсновногоФайла", Новый ОписаниеТипов("Строка"));  
		СоответствияФайлов.Колонки.Добавить("ТекстФайлаСтруктура", Новый ОписаниеТипов("Строка"));  
				
		Для каждого СтрокаСФайлом Из СоответствияФайлов Цикл   
			
			ОписаниеОбъектаОшибки.Очистить();
			
			Если ЗначениеЗаполнено(СтрокаСФайлом.ИмяФайла) Тогда
								
				СтрокаОписания = ОписаниеОбъектаОшибки.Добавить();
				СтрокаОписания.ПолеФайла = НСтр("ru='Файл был загружен ранее'"); 
				СтрокаОписания.Ошибка    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
																		НСтр("ru='Объекты, описанные в этом файле были загружены ранее документом: [Документ]'"),
																		Новый Структура("Документ", Строка(СтрокаДокумента.Регистратор)));;
				ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), СтрокаДокумента.НомерСтроки);
				
				Продолжить;
				
			КонецЕсли;
			
			Если СтрокаСФайлом.ТипОбъекта = "Структура" Тогда
				 СтрокаСФайлом.ТекстФайлаСтруктура = СодержимоеФайла(Задание.Ссылка, СтрокаСФайлом.ФайлСтруктура, ВидОбмена, ИмяФайлаБезРасширения);
			Иначе
				 СтрокаСФайлом.ТекстОсновногоФайла = СодержимоеФайла(Задание.Ссылка, СтрокаСФайлом.ОсновнойФайл,  ВидОбмена, ИмяФайлаБезРасширения);
			КонецЕсли;	
			 
		КонецЦикла;	 
		
		СоотвествиеФорматовРабочимСтруктурам = Новый Соответствие;
			
	КонецЕсли;	
		
	РасшифровкаXML = Новый ТаблицаЗначений;
	РасшифровкаXML.Колонки.Добавить("НомерЛС"); 
	РасшифровкаXML.Колонки.Добавить("ДатаВыписки"); 
	РасшифровкаXML.Колонки.Добавить("СписокПП"); 
	РасшифровкаXML.Колонки.Добавить("GUIDВыписки");
	
	СписокПП = Новый ТаблицаЗначений; 
	СписокПП.Колонки.Добавить("НомерПП"); 
	СписокПП.Колонки.Добавить("ДатаПП"); 
	СписокПП.Колонки.Добавить("GUID"); 
	СписокПП.Колонки.Добавить("РасчСчПл"); 
	СписокПП.Колонки.Добавить("СписокСтрокПП"); 
	СписокПП.Колонки.Добавить("GUIDДок"); 
	СписокПП.Колонки.Добавить("НомерДок"); 
	СписокПП.Колонки.Добавить("ДатаДок"); 
	СписокПП.Колонки.Добавить("ИмяДок");
	СписокПП.Колонки.Добавить("ПечатныйОбраз"); 
	
    ЕдинаяСтрока          = РасшифровкаXML.Добавить();
	ЕдинаяСтрока.СписокПП = СписокПП;
	
	//Если ВидОбмена.ПредставлениеВНомереВерсии  = "TXL" Тогда
	////для импорта Выписок в форматах xml необходимо сначала загрузить все файлы расшифровок
	//	СоответствияФайлов.Сортировать("ОсновнойФайл");
	//	Для Каждого ПараФайлов Из СоответствияФайлов Цикл
	//		Если ЗначениеЗаполнено(ПараФайлов.ОсновнойФайл) Тогда
	//			ПараФайлов.ФайлСтруктура = "";
	//		КонецЕсли;
	//    КонецЦикла;
	//КонецЕсли;
	
	Для Каждого ПараФайлов Из СоответствияФайлов Цикл
		
		Если ВидОбмена.ПредставлениеВНомереВерсии = "TX" Тогда
			МаркерОсновногоФайла = Сред(ПараФайлов.ОсновнойФайл, Найти(ПараФайлов.ОсновнойФайл, ".") + 1, 2); 
		    GUIDФайлаРасшифровки = Сред(ПараФайлов.ТекстОсновногоФайла, Найти(ПараФайлов.ТекстОсновногоФайла, МаркерОсновногоФайла + "|") + 3, 36);
			
			Для каждого ВспомогательныйФайл Из ФайлыРасшифровки Цикл
				
				//ФК-БС
				Постфикс = "";
				Если СтрНайти(ВспомогательныйФайл.ФорматФайла, "BH") > 0 Тогда
					Постфикс = "_ВО";
				ИначеЕсли СтрНайти(ВспомогательныйФайл.ФорматФайла, "SP") > 0 Тогда	
	                Постфикс = "_ВС";
				КонецЕсли;	

				//Постфикс = ?(Найти(ВспомогательныйФайл.ФорматФайла, "BH") > 0, "_ВО", "");
				
				Если ЗначениеЗаполнено(GUIDФайлаРасшифровки) И (Найти(ВспомогательныйФайл.ТекстФайла, GUIDФайлаРасшифровки) > 0) Тогда
					
					 ПараФайлов["ФайлСтруктура"            + Постфикс]    = ВспомогательныйФайл.ИмяФайла;
					 ПараФайлов["ТекстФайлаСтруктура"      + Постфикс]    = ВспомогательныйФайл.ТекстФайла;
					 ПараФайлов["НомерСтрокиФайлаСтруктура"+ Постфикс]    = ВспомогательныйФайл.НомерСтроки;
	                 ПараФайлов["ФорматФайлаСтруктура"     + Постфикс]    = ВспомогательныйФайл.ФорматФайла;
					 
					 //Прервать;
					 
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;	

		
		Если НЕ ЗначениеЗаполнено(ПараФайлов.ОсновнойФайл) Тогда
			Если ПараФайлов.ФорматФайлаСтруктура.Владелец.ТипФайлаПередачи = Перечисления.ТипыФайловПередачиДляОбмена.XML Тогда
				// считаем что это формат УНИФО
				ТекстОшибкиУНИФО = "";
				ЗагрузитьИзФайлаXML(ПараФайлов.ТекстФайлаСтруктура, ПараФайлов.ФорматФайлаСтруктура, Задание,ПараФайлов.НомерСтрокиФайлаСтруктура,ПараФайлов.ФайлСтруктура,,,,,ОписаниеОбъектаОшибки, ТекстОшибкиУНИФО, ДанныеНовыхКонтрагентов, РасшифровкаXML);
				Если Не ПустаяСтрока(ТекстОшибкиУНИФО) Тогда
					СтрокаОписания = ОписаниеОбъектаОшибки.Добавить();
					СтрокаОписания.ПолеФайла = ТекстОшибкиУНИФО; 
					СтрокаОписания.Ошибка    = ТекстОшибкиУНИФО;
					ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), ПараФайлов.НомерСтрокиФайлаСтруктура);
				КонецЕсли;					
                Продолжить;
			Иначе
				СтрокаОписания = ОписаниеОбъектаОшибки.Добавить();
				СтрокаОписания.ПолеФайла = НСтр("ru='Для файла структуры не найден основной файл'"); 
				СтрокаОписания.Ошибка    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(	НСтр("ru='Для файла структуры [ИмяФайла] не найден основной файл'"),
																									Новый Структура("ИмяФайла", ПараФайлов["ФайлСтруктура"+ Постфикс]));
				ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), ПараФайлов["НомерСтрокиФайлаСтруктура"+ Постфикс]);
				Продолжить;
			КонецЕсли;
		ИначеЕсли НЕ ЗначениеЗаполнено(ПараФайлов.ФайлСтруктура) Тогда
			Если ПараФайлов.ФорматОсновногоФайла.Владелец.ТипФайлаПередачи=Перечисления.ТипыФайловПередачиДляОбмена.XML Тогда
				// считаем что это формат УНИФО
				
				ТекстОшибкиУНИФО = "";
				ЗагрузитьИзФайлаXML(ПараФайлов.ТекстОсновногоФайла, ПараФайлов.ФорматОсновногоФайла, Задание,ПараФайлов.НомерСтрокиОсновногоФайла,ПараФайлов.ОсновнойФайл,,,,,ОписаниеОбъектаОшибки, ТекстОшибкиУНИФО, ДанныеНовыхКонтрагентов, РасшифровкаXML);
				Если Не ПустаяСтрока(ТекстОшибкиУНИФО) Тогда
					СтрокаОписания = ОписаниеОбъектаОшибки.Добавить();
					СтрокаОписания.ПолеФайла = ТекстОшибкиУНИФО; 
					СтрокаОписания.Ошибка    = ТекстОшибкиУНИФО;
					ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), ПараФайлов.НомерСтрокиОсновногоФайла);
				КонецЕсли;					
                Продолжить;
			Иначе
				Если Лев(ПараФайлов.ТекстОсновногоФайла, 20) = "1CClientBankExchange" Тогда
					ЗагрузитьИзТекстовогоФайла(ПараФайлов.ТекстОсновногоФайла, ПараФайлов.ФорматОсновногоФайла, Задание,ПараФайлов.ОсновнойФайл, ДанныеНовыхКонтрагентов);
					Продолжить;
				КонецЕсли;
			//Иначе
			//	СтрокаОписания = ОписаниеОбъектаОшибки.Добавить();
			//	СтрокаОписания.ПолеФайла = НСтр("ru='Для основного файла не найден файл структуры'"); 
			//	СтрокаОписания.Ошибка    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(	НСтр("ru='Для основного файла [ИмяФайла] не найден файл структуры'"),
			//																						Новый Структура("ИмяФайла", ПараФайлов.ОсновнойФайл));
			//	ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), ПараФайлов.НомерСтрокиОсновногоФайла);
			//	Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ИдентификаторДокумента = Сред(ПараФайлов.ФорматОсновногоФайла.Наименование, 3, 2);
		
		ДанныеДляИсточника = Новый Структура;
		ДанныеДляИсточника.Вставить("ФорматОсновногоФайла", 	ПараФайлов.ФорматОсновногоФайла);
		ДанныеДляИсточника.Вставить("ФорматФайлаСтруктура", 	ПараФайлов.ФорматФайлаСтруктура);
		ДанныеДляИсточника.Вставить("ФорматФайлаСтруктура_ВО", 	ПараФайлов.ФорматФайлаСтруктура_ВО);
		ДанныеДляИсточника.Вставить("ФорматФайлаСтруктура_ВС", 	ПараФайлов.ФорматФайлаСтруктура_ВС);
		ДанныеДляИсточника.Вставить("ТекстОсновногоФайла", 		ПараФайлов.ТекстОсновногоФайла);
		ДанныеДляИсточника.Вставить("ТекстФайлаСтруктура", 		ПараФайлов.ТекстФайлаСтруктура);
		ДанныеДляИсточника.Вставить("ТекстФайлаСтруктура_ВО", 	ПараФайлов.ТекстФайлаСтруктура_ВО);
		ДанныеДляИсточника.Вставить("ТекстФайлаСтруктура_ВС", 	ПараФайлов.ТекстФайлаСтруктура_ВС);
		
		ИсточникиДанных = СоздатьИсточникиДанныхИзТекстов(	ИдентификаторДокумента,
															ПараФайлов.НомерСтрокиОсновногоФайла - 1,
															ДанныеДляИсточника);		
			
		СоответствиеРеквизитовГруппировок = Неопределено;
		ПроцедурыОбработкиСтрок           = Новый Соответствие;
		СписокУсловий                     = Новый СписокЗначений;
		ПараметрыГруппировок              = Новый Соответствие;
		
		СхемаКомпоновки = СоздатьСКДПоПравиламОбмена(		ДанныеДляИсточника,
															ИсточникиДанных, 
															ПараметрыГруппировок, 
															СоответствиеРеквизитовШапки, 
															РеквизитыСтруктурыВРасшифровке,
															СоответствиеРеквизитовГруппировок,
															ПроцедурыОбработкиСтрок,
															СписокУсловий,
															ПараФайлов.НомерСтрокиОсновногоФайла);
															
		
		
		
		// зададим параметры схемы компоновки
		// считаем что кассовый орган есть во всех схемах
		Для каждого ПараметрКомпоновки Из СхемаКомпоновки.Параметры Цикл
		
			Если Лев(ВРЕГ(ПараметрКомпоновки.Имя), 13) = "КАССОВЫЙОРГАН" Тогда
				
				СоставПараметра = СтрРазделить(ПараметрКомпоновки.Заголовок, ".");
				Если СоставПараметра.Количество() = 1 Тогда
					// кассовый орган
					ПараметрКомпоновки.Значение = Задание.КассовыйОрган;
				Иначе
					
					СтрокаРеквизитов = "";
					Для Счетчик=1 По СоставПараметра.ВГраница() Цикл
					
						СтрокаРеквизитов = "." + СоставПараметра[Счетчик];	
					
					КонецЦикла; 
					СтрокаРеквизитов = Сред(СтрокаРеквизитов, 2);
					ПараметрКомпоновки.Значение = БухгалтерскиеОперацииСервер.ЗначениеРеквизита(Задание.КассовыйОрган, СтрокаРеквизитов);
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла; 
		
		ПараметрКассовыйОрган = СхемаКомпоновки.Параметры.Найти("КассовыйОрган");
		Если ПараметрКассовыйОрган <> Неопределено Тогда
			ПараметрКассовыйОрган.Значение = Задание.КассовыйОрган;
		КонецЕсли;
		ИспользуемыеНастройки = СхемаКомпоновки.НастройкиПоУмолчанию;
															
		// удалим из структуры схема компоновки те группировки, по которым нет данных в источниках данных
		//УдаляемыеГруппировки=Новый Массив;
		Для Каждого ИсточникДанных Из ИсточникиДанных Цикл
			
			// секция "ИдентификаторДокумента" должна быть в любом случае, ее нельзя удалять
			// секции расшифровки удалять не нужно, т.к. они удаляются вместе с их родительскими группировками
			Если ИсточникДанных.Ключ = ИдентификаторДокумента ИЛИ ИсточникДанных.Ключ = "BD" Тогда
				Продолжить;
			КонецЕсли;
			
			Если ИсточникДанных.Значение.Количество()=0 Тогда // в таблице значений 0 строк
				
				ИндексГруппировки = -1;
				Для каждого ТекГруппировка Из ИспользуемыеНастройки.Структура[0].Структура Цикл
				
					Если ТекГруппировка.Имя	= ИсточникДанных.Ключ Тогда
						ИндексГруппировки = ИспользуемыеНастройки.Структура[0].Структура.Индекс(ТекГруппировка);
						Прервать;
					КонецЕсли;
				
				КонецЦикла; 
				Если ИндексГруппировки <> -1 Тогда
					ИспользуемыеНастройки.Структура[0].Структура.Удалить(ИндексГруппировки);
					Если СоответствиеРеквизитовГруппировок.Получить(ИсточникДанных.Ключ) <> Неопределено Тогда
						СоответствиеРеквизитовГруппировок.Удалить(ИсточникДанных.Ключ);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;    
		
		КомпоновщикМакета      = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки        = КомпоновщикМакета.Выполнить(СхемаКомпоновки, ИспользуемыеНастройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновки    = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ИсточникиДанных,,Истина);
		ПроцессорВывода        = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(Новый ДеревоЗначений);
		РезультатВывода        = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		Для Каждого СтрокаВывода Из РезультатВывода.Строки Цикл
		       			
			Если Метаданные.Документы[Парафайлов.ФорматОсновногоФайла.ИдентификаторОбъекта.Имя].Реквизиты.Найти("ЛицевойСчет") = Неопределено Тогда
				
			ИначеЕсли РезультатВывода.Колонки.Найти("ЛицевойСчет") = Неопределено и РезультатВывода.Колонки.Найти("ОбъектЛицевойСчет") = Неопределено Тогда
				СтрокаОписания           = ОписаниеОбъектаОшибки.Добавить();
				СтрокаОписания.ПолеФайла = НСтр("ru='В файле не задана настройка лицевого счета'"); 
				СтрокаОписания.Ошибка    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(	НСтр("ru='В формате [ИмяФормата] не задана настройка заполнения лицевого счета документа'"),
																									Новый Структура("ИмяФормата", ПараФайлов.ФорматОсновногоФайла.Наименование));
				ОбщегоНазначения.СообщитьПользователю(СтрокаОписания.Ошибка,ПараФайлов.ФорматОсновногоФайла);																								
				ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), ПараФайлов.НомерСтрокиОсновногоФайла);
				Продолжить;
			ИначеЕсли РезультатВывода.Колонки.Найти("ЛицевойСчет") <> Неопределено И НЕ ЗначениеЗаполнено(СтрокаВывода["ЛицевойСчет"]) Тогда
				СтрокаОписания = ОписаниеОбъектаОшибки.Добавить();
				СтрокаОписания.ПолеФайла = НСтр("ru='Не найден лицевой счет'"); 
				СтрокаОписания.Ошибка    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(	НСтр("ru='Не найден лицевой счет №[ЛицевойСчет], указанный в файле [ИмяФайла]'"),
																									Новый Структура("ЛицевойСчет, ИмяФайла", 
																													СтрокаВывода["НомерЛицевогоСчетаФайла"],
																													ПараФайлов.ОсновнойФайл));
				ОбщегоНазначения.СообщитьПользователю(СтрокаОписания.Ошибка,,"ФайлыОбмена["+ПараФайлов.НомерСтрокиОсновногоФайла+"].ИмяФайлаЗагрузки");
				ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), ПараФайлов.НомерСтрокиОсновногоФайла);
				Продолжить;
			ИначеЕсли РезультатВывода.Колонки.Найти("ОбъектЛицевойСчет") <> Неопределено И НЕ ЗначениеЗаполнено(СтрокаВывода["ОбъектЛицевойСчет"]) Тогда
				СтрокаОписания = ОписаниеОбъектаОшибки.Добавить();
				СтрокаОписания.ПолеФайла = НСтр("ru='Не найден лицевой счет'"); 
				СтрокаОписания.Ошибка    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(	НСтр("ru='Не найден лицевой счет №[ЛицевойСчет], указанный в файле [ИмяФайла]'"),
																									Новый Структура("ЛицевойСчет, ИмяФайла", 
																													СтрокаВывода["НомерЛицевогоСчетаФайла"],
																													ПараФайлов.ОсновнойФайл));
				ОбщегоНазначения.СообщитьПользователю(СтрокаОписания.Ошибка,,"ФайлыОбмена["+ПараФайлов.НомерСтрокиОсновногоФайла+"].ИмяФайлаЗагрузки");
				ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), ПараФайлов.НомерСтрокиОсновногоФайла);
				Продолжить;
			КонецЕсли;
		
			Для каждого ТекУсловие Из СписокУсловий Цикл
			
				Если ЗначениеЗаполнено(СтрокаВывода[ТекУсловие.Значение]) Тогда
					СтрокаОписания = ОписаниеОбъектаОшибки.Добавить();
					СтрокаОписания.ПолеФайла = СтрокаВывода[ТекУсловие.Значение]; 
					СтрокаОписания.Ошибка    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(	НСтр("ru='Ошибка в файле [ИмяФайла]. Загрузка прекращена по причине: [ОписаниеОшибки]'"),
																										Новый Структура("ОписаниеОшибки, ИмяФайла",
																														СтрокаВывода[ТекУсловие.Значение],
																														ПараФайлов.ОсновнойФайл));
					ОбщегоНазначения.СообщитьПользователю(СтрокаОписания.Ошибка,,,,Отказ);																								
					ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), ПараФайлов.НомерСтрокиОсновногоФайла);
					Продолжить;
				КонецЕсли;
				
			КонецЦикла; 
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
		
			РеквизитыШапкиОбъекта = Новый Структура;
			СтрокаРеквизитовШапки = "";
			Для Каждого ТекРеквизитШапки Из СоответствиеРеквизитовШапки Цикл
				Если ТипЗнч(ТекРеквизитШапки.Значение) = Тип("Структура")
					ИЛИ ТипЗнч(ТекРеквизитШапки.Значение) = Тип("Соответствие") Тогда
					РеквизитыШапкиОбъекта.Вставить(ТекРеквизитШапки.Ключ, Новый Структура);
					Для каждого ТекЗначениеСтруктуры Из ТекРеквизитШапки.Значение Цикл

						РеквизитыШапкиОбъекта[ТекРеквизитШапки.Ключ].Вставить(ТекЗначениеСтруктуры.Ключ, СтрокаВывода[ТекРеквизитШапки.Ключ+ТекЗначениеСтруктуры.Ключ]);

					КонецЦикла; 
					
				ИначеЕсли ТипЗнч(ТекРеквизитШапки.Значение) <> Тип("Соответствие") Тогда
					РеквизитыШапкиОбъекта.Вставить(ТекРеквизитШапки.Ключ, СтрокаВывода[ТекРеквизитШапки.Ключ]);
					СтрокаРеквизитовШапки = СтрокаРеквизитовШапки + "," + ТекРеквизитШапки.Значение;
				КонецЕсли;
			КонецЦикла;
			СтрокаРеквизитовШапки = Сред(СтрокаРеквизитовШапки, 2);
			
			
			Если ПараФайлов.ФорматОсновногоФайла.ИдентификаторОбъекта.Имя = "БюджетныеДанные" Тогда
				
				НомерПервичногоДокумента = Неопределено;
				ДатаПервичногоДокумента  = Неопределено;
				Организация              = Неопределено;
				РеквизитыШапкиОбъекта.Свойство("НомерПервичногоДокумента", НомерПервичногоДокумента);
				РеквизитыШапкиОбъекта.Свойство("ДатаПервичногоДокумента",  ДатаПервичногоДокумента);
				РеквизитыШапкиОбъекта.Свойство("Организация",              Организация);
				ОбъектСсылка = ПолучитьСсылкуНаОбъект("Документ.БюджетныеДанные", Новый Структура(	"НомерПервичногоДокумента, ДатаПервичногоДокумента, Организация",
																									НомерПервичногоДокумента,
																									ДатаПервичногоДокумента,
																									Организация));
																									
			ИначеЕсли ПараФайлов.ФорматОсновногоФайла.ИдентификаторОбъекта.Имя = "ЗаявлениеНаВыдачуКазначейскогоАккредитива" Тогда
																									
				НомерБО01  = Неопределено;
				КПС01Код   = Неопределено;
				КодФАИП01  = Неопределено;

				РеквизитыШапкиОбъекта.Свойство("НомерБО01",  НомерБО01);
				РеквизитыШапкиОбъекта.ПроизвольныеПараметры.Свойство("КПС01Код",  КПС01Код);
				РеквизитыШапкиОбъекта.Свойство("КодФАИП01", КодФАИП01);
				
				ОбъектСсылка = ПолучитьСсылкуНаОбъект("Документ.ЗаявлениеНаВыдачуКазначейскогоАккредитива", Новый Структура("НомерБО01, КПС01pointКод, КодФАИП01",
																									              НомерБО01,
																									              КПС01Код,
																									              КодФАИП01));
																					
																																																																				
			ИначеЕсли РеквизитыШапкиОбъекта.Свойство("СостояниеПлатежноРасчетныхДокументов")
				И РеквизитыШапкиОбъекта.СостояниеПлатежноРасчетныхДокументов.Свойство("GUIDКО") Тогда
				ОбъектСсылка = БиблиотекаФункцийОбмена.НайтиДокументПоGUID(ПараФайлов.ФорматОсновногоФайла.ИдентификаторОбъекта.Имя,РеквизитыШапкиОбъекта.СостояниеПлатежноРасчетныхДокументов.GUIDКО);
				
			Иначе
				ОбъектСсылка = Неопределено;
			КонецЕсли;
			Если ЗначениеЗаполнено(ОбъектСсылка) тогда
				Объект             = ОбъектСсылка.ПолучитьОбъект();
				ОчиститьТабличныеЧасти(Объект);
				
				Объект.Организация = Задание.Организация;
				Объект.Дата        = ТекущаяДатаСеанса();
			Иначе	
				Объект             = Документы[ПараФайлов.ФорматОсновногоФайла.ИдентификаторОбъекта.Имя].СоздатьДокумент();
				Объект.Организация = Задание.Организация;
				Объект.Дата        = ТекущаяДатаСеанса();
			КонецЕсли;
						
			Если НЕ РеквизитыШапкиОбъекта.Свойство("СостояниеПлатежноРасчетныхДокументов", СостояниеПлатежноРасчетныхДокументов) Тогда
				СостояниеПлатежноРасчетныхДокументов = Новый Структура;
			КонецЕсли;
			
			Если НЕ (ПараФайлов.ФорматОсновногоФайла.ИдентификаторОбъекта.Имя = "ЗаявлениеНаВыдачуКазначейскогоАккредитива" И Не Объект.ЭтоНовый()) Тогда
				ЗаполнитьЗначенияСвойств(Объект, РеквизитыШапкиОбъекта, СтрокаРеквизитовШапки);
			КонецЕсли;
			
			Если ПараФайлов.ФорматОсновногоФайла.ИдентификаторОбъекта.Имя = "БюджетныеДанные" Тогда
								
				СтруктураКонтрагент = Новый Структура("КодПоРПБС, Наименование", "", "");
				
				Если РезультатВывода.Колонки.Найти("СтруктураКонтрагентКодПоРПБС") <> Неопределено Тогда
					СтруктураКонтрагент.КодПоРПБС = СтрокаВывода[РезультатВывода.Колонки.Найти("СтруктураКонтрагентКодПоРПБС").Имя];
				КонецЕсли;
				
				Если РезультатВывода.Колонки.Найти("СтруктураКонтрагентНаименование") <> Неопределено Тогда
					СтруктураКонтрагент.Наименование = СтрокаВывода[РезультатВывода.Колонки.Найти("СтруктураКонтрагентНаименование").Имя];
				КонецЕсли;
				
				Объект.ОтКого = БиблиотекаФункцийОбмена.КонтрагентПоРеквизиту("КодПоРПБС", СтруктураКонтрагент.КодПоРПБС);
				
				Если НЕ ЗначениеЗаполнено(Объект.ОтКого) И ЗначениеЗаполнено(СтруктураКонтрагент.Наименование) Тогда
					
					ДлинаНаименования           = Метаданные.Справочники.Контрагенты.ДлинаНаименования;
					НаименованиеДляПоиска       = ?(СтрДлина(СтруктураКонтрагент.Наименование) <= ДлинаНаименования, СтруктураКонтрагент.Наименование, Лев(СтруктураКонтрагент.Наименование, ДлинаНаименования));
					ПредполагаемыйКонтрагент    = Справочники.Контрагенты.НайтиПоНаименованию(НаименованиеДляПоиска);
					
					Если ЗначениеЗаполнено(ПредполагаемыйКонтрагент) Тогда						
						Объект.ОтКого = ПредполагаемыйКонтрагент;
                    Иначе
					    Объект.ОтКого = БиблиотекаФункцийОбмена.СоздатьКонтрагентаПоОписанию(СтруктураКонтрагент);
					КонецЕсли;
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Объект.ОтКого) Тогда
					СтруктураНовыйППП = Новый Структура("Наименование, НаименованиеКлассификатора, Код, Дата");
					Если РезультатВывода.Колонки.Найти("СтруктураНовыйПППНаименование")<>Неопределено Тогда
						СтруктураНовыйППП.НаименованиеКлассификатора = СтрокаВывода[РезультатВывода.Колонки.Найти("СтруктураНовыйПППНаименование").Имя];
					КонецЕсли;
					Если РезультатВывода.Колонки.Найти("СтруктураНовыйПППНаименованиеКлассификатора")<>Неопределено Тогда
						СтруктураНовыйППП.НаименованиеКлассификатора = СтрокаВывода[РезультатВывода.Колонки.Найти("СтруктураНовыйПППНаименованиеКлассификатора").Имя];
					КонецЕсли;
					Если РезультатВывода.Колонки.Найти("СтруктураНовыйПППКод")<>Неопределено Тогда
						СтруктураНовыйППП.Код = СтрокаВывода[РезультатВывода.Колонки.Найти("СтруктураНовыйПППКод").Имя];
					КонецЕсли;
					Если РезультатВывода.Колонки.Найти("СтруктураНовыйПППДата")<>Неопределено Тогда
						СтруктураНовыйППП.Дата = СтрокаВывода[РезультатВывода.Колонки.Найти("СтруктураНовыйПППДата").Имя];
					КонецЕсли;
					
					Объект.ОтКого = БиблиотекаФункцийОбмена.ЗначениеКлассификатораПоКоду(СтруктураНовыйППП.Код, "ГлавыПоБюджетнойКлассификации");
					
					Если НЕ ЗначениеЗаполнено(Объект.ОтКого) Тогда
						Объект.ОтКого = БиблиотекаФункцийОбмена.СоздатьНовоеЗначениеКлассификатора(СтруктураНовыйППП);
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ПараФайлов.ФорматОсновногоФайла.ИдентификаторОбъекта.Имя = "ЗаявлениеНаВыдачуКазначейскогоАккредитива" Тогда	
				
				Если НЕ Объект.ЭтоНовый() Тогда
					
					ЗаполнитьЗначенияСвойств(Объект, РеквизитыШапкиОбъекта, "НомерАккредитива, ДатаАккредитива, СуммаАккредитива, СрокДействияАккредитива");
					
				Иначе //новый обыект
					
					Объект.Контрагент      = БиблиотекаФункцийОбмена.ОпределитьКонтрагента(Объект.ПолучательИНН, Объект.ПолучательКПП, Объект.ПолучательНаименование, "", Объект.ПлательщикКодРПБС, , ВидОбмена, ДанныеНовыхКонтрагентов);
					
					Если НЕ ЗначениеЗаполнено(Объект.Контрагент) И ТипЗнч(ДанныеНовыхКонтрагентов) = Тип("ТаблицаЗначений") Тогда
						Если ДанныеНовыхКонтрагентов.Количество() > 0 И НЕ ЗначениеЗаполнено(ДанныеНовыхКонтрагентов[ДанныеНовыхКонтрагентов.Количество() - 1].ДокументСсылка) Тогда
							
							 ДанныеНовыхКонтрагентов[ДанныеНовыхКонтрагентов.Количество()-1].ДокументСсылка     = Объект.Ссылка;
							 ДанныеНовыхКонтрагентов[ДанныеНовыхКонтрагентов.Количество()-1].ИмяРеквизита       = "Контрагент";
							 
						КонецЕсли;
					КонецЕсли;
			
				    Объект.СчетКонтрагента = БиблиотекаФункцийОбмена.ОпределитьСчетКонтрагента(Объект.Контрагент, Объект.ПолучательНомерЛС, Объект.ПолучательБИКБанка, "", "", Истина);
					Объект.Договор01       = БиблиотекаФункцийОбмена.ОпределитьДоговор(Объект.Организация, Объект.Контрагент, Объект.СчетКонтрагента, Объект.Номер01, Объект.Дата01);
					
				КонецЕсли;
				
			КонецЕсли;
		
			Если Объект.ЭтоНовый() Тогда
				Объект.Записать();
				СостояниеПлатежноРасчетныхДокументов.Вставить("ПлатежноРасчетныйДокумент",Объект.Ссылка);
				Если Не СостояниеПлатежноРасчетныхДокументов.Свойство("ПервичныйОбразИРеквизиты") Тогда
					СостояниеПлатежноРасчетныхДокументов.Вставить("ПервичныйОбразИРеквизиты");
				КонецЕсли;
				
				ПлатежноРасчетныеДокументы.ЗарегестрироватьИсполнениеЗаявки(СостояниеПлатежноРасчетныхДокументов);
				//СостояниеПлатежноРасчетныхДокументов = Неопределено;
			КонецЕсли;
			
			Если РезультатВывода.Колонки.Найти("ИтераторИмяСекции") <> Неопределено Тогда
				// Получим строки остатков
				Для каждого ТекСтрокаОстатков Из СтрокаВывода.Строки[0].Строки Цикл
					Если ЗначениеЗаполнено(ТекСтрокаОстатков["ИтераторИмяСекции"]) Тогда				
						ЗаполнитьЗначенияСвойств(Объект.Остатки.Добавить(), ТекСтрокаОстатков);
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли;
				
			Если //НЕ ЗначениеЗаполнено(ПараФайлов.ФорматФайлаСтруктура) И 
				ТипЗнч(Объект) <> Тип("ДокументОбъект.ВыпискаИзЛицевогоСчета") Тогда
				
				Для каждого ТекСтрока Из СтрокаВывода.Строки Цикл
					
					ИмяСекции = "";
					ИмяТабличнойЧасти = "";
					Для каждого ГруппировкаСтрок Из ПараметрыГруппировок Цикл
						
						Если ГруппировкаСтрок.Ключ = ИдентификаторДокумента Тогда
							// значит будет 1 строка табличной части
							ИмяСекции = "";
							ИмяТабличнойЧасти = ГруппировкаСтрок.Значение;
							Прервать;
						ИначеЕсли РезультатВывода.Колонки.Найти(ГруппировкаСтрок.Ключ+"ИмяСекции")<> Неопределено Тогда
							Если ЗначениеЗаполнено(ТекСтрока[ГруппировкаСтрок.Ключ+"ИмяСекции"]) Тогда
								ИмяСекции = ГруппировкаСтрок.Ключ;
								ИмяТабличнойЧасти = ГруппировкаСтрок.Значение;
							    Прервать;
							КонецЕсли;
						КонецЕсли;
					
					КонецЦикла; 
					
					Если ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
						
						РеквизитыТЧ = Новый Структура;
						Для каждого ТекРеквизит Из Объект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты Цикл
							
							Если РезультатВывода.Колонки.Найти(ИмяСекции+ТекРеквизит.Имя)<>Неопределено Тогда
								РеквизитыТЧ.Вставить(ТекРеквизит.Имя, ТекСтрока[ИмяСекции+ТекРеквизит.Имя]);
							Иначе
								//ОбщегоНазначения.СообщитьПользователю("В табличной части "+ИмяТабличнойЧасти+" не найден реквизит "+ТекРеквизит.Имя);
							КонецЕсли;
							
						КонецЦикла;  
						НоваяСтрокаДокумента = Объект[ИмяТабличнойЧасти].Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаДокумента, РеквизитыТЧ);
						
						Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗапросНаВыяснениеПринадлежностиПлатежа") Тогда
							
							СтруктураОФК = Новый Структура;
							Для каждого Колонка Из РезультатВывода.Колонки Цикл
								
								ИмяКолонки = Колонка.Имя;
								Если ((Лев(ИмяКолонки, 17) = "ZF_PPСтруктураОФК") И ЗначениеЗаполнено(ТекСтрока["ZF_PPИмяСекции"])) ИЛИ 
									 ((Лев(ИмяКолонки, 17) = "ZF_PLСтруктураОФК") И ЗначениеЗаполнено(ТекСтрока["ZF_PLИмяСекции"])) Тогда
									СтруктураОФК.Вставить(Сред(ИмяКолонки, 18), ТекСтрока[ИмяКолонки]); 
								КонецЕсли;
							
							КонецЦикла; 
							НоваяСтрокаДокумента.ПервичныйОбразИРеквизитыОФК = Новый ХранилищеЗначения(СтруктураОФК);
							
							//Если СостояниеПлатежноРасчетныхДокументов = Неопределено Тогда
							//СостояниеПлатежноРасчетныхДокументов = Новый Структура("ПлатежноРасчетныйДокумент, ПервичныйОбразИРеквизиты", Объект.Ссылка, СтруктураОФК);
							//СостояниеПлатежноРасчетныхДокументов.Вставить("GUIDКО", СтруктураОФК["ОФКGUID"]); 
							//СостояниеПлатежноРасчетныхДокументов.Вставить("ПлатежноРасчетныйДокумент",Объект.Ссылка);
							СостояниеПлатежноРасчетныхДокументов.Вставить("ПлатежноРасчетныйДокумент",Объект.Ссылка);
							Если Не СостояниеПлатежноРасчетныхДокументов.Свойство("ПервичныйОбразИРеквизиты") Тогда
								СостояниеПлатежноРасчетныхДокументов.Вставить("ПервичныйОбразИРеквизиты", СтруктураОФК);
							КонецЕсли;
							
							Если СтруктураОФК.Свойство("НомерСчетаПлательщика") Тогда
								Объект.НомерБанковскогоСчетаПлательщика = СтруктураОФК["НомерСчетаПлательщика"];
							КонецЕсли;
							ПлатежноРасчетныеДокументы.ЗарегестрироватьИсполнениеЗаявки(СостояниеПлатежноРасчетныхДокументов);
							
						КонецЕсли;
						
					КонецЕсли;
				
				КонецЦикла; 
				
			Иначе
				
				// Заполняем ТЧ движения документов
				
				// Структура - таблица значений для передачи параметров в процедуры создания документов.
				// В колонке СписокПП хранится таблица значений, созданная из файла расшифровки
				// пустая таблица значений СписокПП получается из фунции СтруктураФайлаРасшифровкиВыписки()
				
				Структура = Новый ТаблицаЗначений;
				Структура.Колонки.Добавить("НомерЛС"); 
				Структура.Колонки.Добавить("ДатаВыписки"); 
				Структура.Колонки.Добавить("СписокПП"); 
				Структура.Колонки.Добавить("GUIDВыписки");
				
				СписокПП = Новый ТаблицаЗначений; 
				СписокПП.Колонки.Добавить("НомерПП"); 
				СписокПП.Колонки.Добавить("ДатаПП"); 
				СписокПП.Колонки.Добавить("GUID"); 
				СписокПП.Колонки.Добавить("РасчСчПл"); 
				СписокПП.Колонки.Добавить("СписокСтрокПП"); 
				СписокПП.Колонки.Добавить("GUIDДок"); 
				СписокПП.Колонки.Добавить("НомерДок"); 
				СписокПП.Колонки.Добавить("ДатаДок"); 
				СписокПП.Колонки.Добавить("ИмяДок");
				СписокПП.Колонки.Добавить("ПечатныйОбраз"); 		
				
				СписокСтрокПП = Новый ТаблицаЗначений; 
				СписокСтрокПП.Колонки.Добавить("КБК"); 
				СписокСтрокПП.Колонки.Добавить("ТипКБК"); 
				СписокСтрокПП.Колонки.Добавить("КодЦели"); 
				СписокСтрокПП.Колонки.Добавить("НомерБО"); 
				СписокСтрокПП.Колонки.Добавить("ОКАТО"); 
				СписокСтрокПП.Колонки.Добавить("Сумма"); 
				СписокСтрокПП.Колонки.Добавить("ЭтоСписание");
				СписокСтрокПП.Колонки.Добавить("Операция");
				СписокСтрокПП.Колонки.Добавить("Дебет");
                СписокСтрокПП.Колонки.Добавить("Кредит");
				
				Если ЗначениеЗаполнено(РеквизитыСтруктурыВРасшифровке["BD"].Получить("GUIDВыписки")) Тогда								
					GUIDВыписки = РеквизитыСтруктурыВРасшифровке["BD"].Получить("GUIDВыписки");								
				ИначеЕсли ЗначениеЗаполнено(РеквизитыСтруктурыВРасшифровке["BH"].Получить("GUIDВыписки")) Тогда								
					GUIDВыписки = РеквизитыСтруктурыВРасшифровке["BH"].Получить("GUIDВыписки");	
				ИначеЕсли ЗначениеЗаполнено(РеквизитыСтруктурыВРасшифровке["SP"].Получить("GUIDВыписки")) Тогда
					GUIDВыписки = РеквизитыСтруктурыВРасшифровке["SP"].Получить("GUIDВыписки");	
				КонецЕсли;
				
				Для Счетчик = 0 По СтрокаВывода.Строки.Количество()-1 Цикл             //!!!
					
					Если Счетчик = 0 И НЕ ЗначениеЗаполнено(GUIDВыписки) Тогда
						Продолжить;
					КонецЕсли;
					
					ТекСтрокаДвижений = СтрокаВывода.Строки[Счетчик];
					Для Каждого ТекИмяСекции Из СоответствиеРеквизитовГруппировок Цикл
						Если ТекСтрокаДвижений.Строки.Найти(ТекИмяСекции.Ключ+"ИмяСекции") <> Неопределено Тогда    //*-*  
							Если ПустаяСтрока(ТекСтрокаДвижений[ТекИмяСекции.Ключ+"ИмяСекции"]) Тогда
								Продолжить;
							КонецЕсли;	
						Прервать;
						КонецЕсли; //*-*
						
							
						СоответствиеРеквизитовТекущейСекции = ТекИмяСекции.Значение;
						
						ПроизвольныеПараметры = Новый Соответствие;
						Если СоответствиеРеквизитовТекущейСекции[ТекИмяСекции.Ключ+"ПроизвольныеПараметры"] = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						Для каждого ТекПараметр Из СоответствиеРеквизитовТекущейСекции[ТекИмяСекции.Ключ+"ПроизвольныеПараметры"] Цикл
						
							ПроизвольныеПараметры.Вставить(ТекПараметр.Ключ, ТекСтрокаДвижений[СтрЗаменить(ТекПараметр.Значение, ".", "")]);
						
						КонецЦикла; 
						
						
						Если ПроцедурыОбработкиСтрок.Получить(ТекИмяСекции.Ключ) = Неопределено Тогда//Если СоответствиеРеквизитовТекущейСекции.Получить("ВыполняемоеДействие") = Неопределено Тогда
							// если не задано действие, то нет смысла читать расшифровку и обрабатывать дальше
							Продолжить;
						КонецЕсли;
						
						// Прочитаем вложенные группировки. Там находится расшифровка
						
						Для каждого УровеньГруппировки1 Из ТекСтрокаДвижений.Строки Цикл
														
							ЕстьРасшифровка = Истина;
							GUIDBD          = "";
							GUIDBH          = "";
							GUIDSP          = "";
							
							// проверяем есть ли расшифровка для этой секции
							Попытка
								 GUIDBD = УровеньГруппировки1[ТекИмяСекции.Ключ+"_"+СтрЗаменить(GUIDВыписки,".","")];
							Исключение								 
							КонецПопытки;
							
							Попытка
								 GUIDBH = УровеньГруппировки1[ТекИмяСекции.Ключ+"1_"+СтрЗаменить(GUIDВыписки,".","")];
							Исключение								 
							КонецПопытки;
							
							Попытка
								 GUIDSP = УровеньГруппировки1[ТекИмяСекции.Ключ+"2_"+СтрЗаменить(GUIDВыписки,".","")];
							Исключение								 
							КонецПопытки;

							
							Если ЗначениеЗаполнено(GUIDBD) Тогда    //расшифровка по BD
								
								ТекущиеКолонки  = РеквизитыСтруктурыВРасшифровке["BD"];
								ПрефиксПоля     = ТекИмяСекции.Ключ + "_";
								
								ИмяГруппировки2 = "BDPD";
								ИмяГруппировки3 = "BDPDST";
								
							ИначеЕсли ЗначениеЗаполнено(GUIDBH) Тогда  //расшифровка по BH
								
								ТекущиеКолонки  = РеквизитыСтруктурыВРасшифровке["BH"];
								ПрефиксПоля     = ТекИмяСекции.Ключ + "1_";
								
								ИмяГруппировки2 = "ZR";
								ИмяГруппировки3 = "ZRST";
								
								
							ИначеЕсли ЗначениеЗаполнено(GUIDSP) Тогда  //расшифровка по SP
								
								ТекущиеКолонки  = РеквизитыСтруктурыВРасшифровке["SP"];
								ПрефиксПоля     = ТекИмяСекции.Ключ + "2_";
								
								ИмяГруппировки2 = "SPD";
								ИмяГруппировки3 = "SPRR";	
								
							Иначе
								ЕстьРасшифровка = Ложь;
							КонецЕсли;
							
							Если ЕстьРасшифровка Тогда
								СтруктураВыписки = Структура.Добавить();
								Если ТекущиеКолонки.Получить("НомерЛС") <> Неопределено Тогда
									СтруктураВыписки.НомерЛС = УровеньГруппировки1[ПрефиксПоля + СтрЗаменить(ТекущиеКолонки.Получить("НомерЛС"),".","")];
								КонецЕсли;
								Если ТекущиеКолонки.Получить("ДатаВыписки") <> Неопределено Тогда
									СтруктураВыписки.ДатаВыписки = УровеньГруппировки1[ПрефиксПоля + СтрЗаменить(ТекущиеКолонки.Получить("ДатаВыписки"),".","")];
								КонецЕсли;
								Если ТекущиеКолонки.Получить("GUIDВыписки") <> Неопределено Тогда
									СтруктураВыписки.GUIDВыписки = УровеньГруппировки1[ПрефиксПоля + СтрЗаменить(ТекущиеКолонки.Получить("GUIDВыписки"),".","")];
								КонецЕсли;
								
								Для каждого УровеньГруппировки2 Из УровеньГруппировки1.Строки Цикл
									
									ТекущиеКолонки = РеквизитыСтруктурыВРасшифровке[ИмяГруппировки2];       // ["BDPD"]
									СтрокаСпискаПП = СписокПП.Добавить();
									
									Для каждого ТекКолонка Из ТекущиеКолонки Цикл
										Если НЕ ЗначениеЗаполнено(ТекКолонка.Значение) Тогда
											Продолжить;
										КонецЕсли;
										Если ТипЗнч(ТекКолонка.Значение) = Тип("Структура") Тогда
											ВременнаяСтруктура = Новый Структура;
											Для Каждого ТекКолонкаЗначение Из ТекКолонка.Значение Цикл
												ВременнаяСтруктура.Вставить(ТекКолонкаЗначение.Ключ, УровеньГруппировки2[ПрефиксПоля + СтрЗаменить(ТекКолонкаЗначение.Значение, ".", "")]); 										
											КонецЦикла;
											СтрокаСпискаПП[ТекКолонка.Ключ] = ВременнаяСтруктура;
										Иначе
											СтрокаСпискаПП[ТекКолонка.Ключ] = УровеньГруппировки2[ПрефиксПоля + СтрЗаменить(ТекКолонка.Значение, ".", "")];
										КонецЕсли;
									КонецЦикла; 
																	
									Для каждого УровеньГруппировки3 Из УровеньГруппировки2.Строки Цикл
										ТекущиеКолонки = РеквизитыСтруктурыВРасшифровке[ИмяГруппировки3];    //["BDPDST"]
										
										СтрокаПП = СписокСтрокПП.Добавить();
										Для каждого ТекКолонка Из ТекущиеКолонки Цикл
											Если НЕ ЗначениеЗаполнено(ТекКолонка.Значение) Тогда
												Продолжить;
											КонецЕсли;
											Если ТипЗнч(ТекКолонка.Значение) = Тип("Структура") Тогда
												ВременнаяСтруктура = Новый Структура;
												Для Каждого ТекКолонкаЗначение Из ТекКолонка.Значение Цикл
													ВременнаяСтруктура.Вставить(ТекКолонкаЗначение.Ключ, УровеньГруппировки3[ПрефиксПоля + СтрЗаменить(ТекКолонкаЗначение.Значение, ".", "")]); 										
												КонецЦикла;
												Если  ИмяГруппировки3 = "ZRST" И ТекКолонка.Ключ = "ПечатныйОбраз" Тогда
													Если НЕ СтрокаСпискаПП[ТекКолонка.Ключ].Свойство("РасшифровкаПлатежа") Тогда
														СтрокаСпискаПП[ТекКолонка.Ключ].Вставить("РасшифровкаПлатежа", Новый Массив);		
												    КонецЕсли;
													СтрокаСпискаПП[ТекКолонка.Ключ]["РасшифровкаПлатежа"].Добавить(ВременнаяСтруктура);
                                                Иначе
													СтрокаПП[ТекКолонка.Ключ] = ВременнаяСтруктура;
												КонецЕсли;
												Если  ИмяГруппировки2 = "ZR" И ТекКолонка.Ключ = "ПечатныйОбраз" Тогда
													 Если УровеньГруппировки2[ПрефиксПоля + "ПечатныйОбразВидОперации"] = "ZR" Тогда
														  Если РеквизитыСтруктурыВРасшифровке["ZROSN"] <> Неопределено Тогда
															  КолонкиДокОснования = РеквизитыСтруктурыВРасшифровке["ZROSN"];
															  Для Каждого ТекКолонкаЗначение Из КолонкиДокОснования Цикл
																  СтрокаСпискаПП[ТекКолонка.Ключ].Вставить(ТекКолонкаЗначение.Ключ, УровеньГруппировки3[ПрефиксПоля + СтрЗаменить(ТекКолонкаЗначение.Значение, ".", "")]); 										
															  КонецЦикла;
														  КонецЕсли;
													  ИначеЕсли УровеньГруппировки2[ПрефиксПоля + "ПечатныйОбразВидОперации"] = "ZV" Тогда
														  Если РеквизитыСтруктурыВРасшифровке["ZVDOCOSN"] <> Неопределено Тогда
															  КолонкиДокОснования = РеквизитыСтруктурыВРасшифровке["ZVDOCOSN"];
															  Для Каждого ТекКолонкаЗначение Из КолонкиДокОснования Цикл
																  СтрокаСпискаПП[ТекКолонка.Ключ].Вставить(ТекКолонкаЗначение.Ключ, УровеньГруппировки3[ПрефиксПоля + СтрЗаменить(ТекКолонкаЗначение.Значение, ".", "")]); 										
															  КонецЦикла;
														  КонецЕсли;
														  Если РеквизитыСтруктурыВРасшифровке["ZVDOCPOL"] <> Неопределено Тогда
															  КолонкиДокОснования = РеквизитыСтруктурыВРасшифровке["ZVDOCPOL"];
															  Для Каждого ТекКолонкаЗначение Из КолонкиДокОснования Цикл
																  Если ТипЗнч(ТекКолонкаЗначение.Значение) <> Тип("Строка") Тогда
																	  Продолжить;
																  КонецЕсли;
																  СтрокаСпискаПП[ТекКолонка.Ключ].Вставить(ТекКолонкаЗначение.Ключ, УровеньГруппировки3[ПрефиксПоля + СтрЗаменить(ТекКолонкаЗначение.Значение, ".", "")]); 										
															  КонецЦикла;
														  КонецЕсли;
													  КонецЕсли;
												КонецЕсли;
											Иначе
												СтрокаПП[ТекКолонка.Ключ] = УровеньГруппировки3[ПрефиксПоля + СтрЗаменить(ТекКолонка.Значение, ".", "")];
											КонецЕсли;
										КонецЦикла; 
									КонецЦикла; 
									
									СтрокаСпискаПП.СписокСтрокПП = СписокСтрокПП.Скопировать();
									СписокСтрокПП.Очистить();
								КонецЦикла; 
								
								СтруктураВыписки.СписокПП = СписокПП;
							КонецЕсли;
							
							ПараметрНомерДок 			= ?(ЗначениеЗаполнено(ПроизвольныеПараметры.Получить("НомерДок")), ПроизвольныеПараметры.Получить("НомерДок"), ПроизвольныеПараметры.Получить("НомерПодтверждающегоДокумента"));
							ПараметрДатаДок 			= ?(ЗначениеЗаполнено(ПроизвольныеПараметры.Получить("ДатаДок")),  ПроизвольныеПараметры.Получить("ДатаДок"),  ПроизвольныеПараметры.Получить("ДатаПодтверждающегоДокумента"));
							ПараметрИмяДок              = ПроизвольныеПараметры.Получить("ИмяДок");
							ПараметрГУИД 				= ПроизвольныеПараметры.Получить("GUIDПП");
							ПараметрСуммаПоступления	= ПроизвольныеПараметры.Получить("СуммаПоступления");
							ПараметрСуммаСписания 		= ПроизвольныеПараметры.Получить("СуммаСписания");
							ПараметрКВД					= ПроизвольныеПараметры.Получить("КВД");
							ПараметрИсточникиСтредств	= ПроизвольныеПараметры.Получить("ИсточникиСредств");
							ПараметрНомерКОО        	= ПроизвольныеПараметры.Получить("НомерКОО");
							ПараметрНомерПодтверДок     = ПроизвольныеПараметры.Получить("НомерПодтверждающегоДокумента");
						    ПараметрДатаПодтверДок      = ПроизвольныеПараметры.Получить("ДатаПодтверждающегоДокумента");
							
							Если ПараметрСуммаПоступления<>Неопределено Тогда
								ПараметрСуммаПоступления = Число(ПараметрСуммаПоступления);
							Иначе
								ПараметрСуммаПоступления = 0;
							КонецЕсли;
							Если ПараметрСуммаСписания<>Неопределено Тогда
								ПараметрСуммаСписания = Число(ПараметрСуммаСписания);
							Иначе
								ПараметрСуммаСписания = 0;
							КонецЕсли;
							
							РазложениеИсполняемыхДействий = СтрРазделить(ПроцедурыОбработкиСтрок.Получить(ТекИмяСекции.Ключ), ";");
							ИсполняющийДокумент           = Неопределено;	
							Справка                       = Неопределено;
							
							Для каждого ВыполняемоеДействие Из РазложениеИсполняемыхДействий Цикл
								// выполняем действие для данной строки
								Если ВРЕГ(ВыполняемоеДействие) = ВРЕГ("ДокументЗадающийБюджетныеДанные") Тогда
									ИсполняющийДокумент = БиблиотекаФункцийОбмена.ОпределитьДокументЗадающийБюджетныеДанные(Объект.ЛицевойСчет.Код,
																															ПараметрНомерДок,
																															ПараметрДатаДок,
																															ПараметрГУИД);																			
								ИначеЕсли ВРЕГ(ВыполняемоеДействие) = ВРЕГ("НовоеКассовоеПоступление") Тогда
									Если ПараметрСуммаПоступления>0 Тогда
										
										//Если ЗначениеЗаполнено(GUIDSP) Тогда
											
											 ИсполняющийДокумент = БиблиотекаФункцийОбмена.ОпределитьРасшифровку(	Структура,
										                                                                            Объект.Ссылка, 
																													ПараметрГУИД, 
																													ПараметрСуммаПоступления,
																													ПараметрДатаДок,
																													ПараметрНомерДок);
									    //КонецЕсли;
										
										Если НЕ ЗначениеЗаполнено(ИсполняющийДокумент) Тогда
											 ИсполняющийДокумент = БиблиотекаФункцийОбмена.СоздатьКассовоеПоступление(Структура,
																													  Объект.Ссылка, 
																													  ПараметрГУИД, 
																													  ПараметрКВД, 
																													  ПараметрИсточникиСтредств,
																													  ПараметрСуммаПоступления,
										      																	      ПроизвольныеПараметры,
																													  ВидОбмена,
																													  ДанныеНовыхКонтрагентов);
										КонецЕсли;																			  																													  
									КонецЕсли;	
								ИначеЕсли ВРЕГ(ВыполняемоеДействие) = ВРЕГ("ПолучитьЗаявлениеИнВал") Тогда	
									    Справка = БиблиотекаФункцийОбмена.ОпределитьЗаялениеИнВал( Объект.Организация,
																										       Объект.ЛицевойСчет.Код,
																										       ПараметрНомерПодтверДок, 
																										       ПараметрДатаПодтверДок); 
								ИначеЕсли ВРЕГ(ВыполняемоеДействие) = ВРЕГ("ПолучитьЗаявку") Тогда
									Если ПараметрСуммаСписания>0 Тогда
										ИсполняющийДокумент = БиблиотекаФункцийОбмена.ОпределитьЗаявку(	Объект.Организация,
																										Объект.ЛицевойСчет.Код,
																										ПараметрНомерДок, 
																										ПараметрДатаДок,
																										ПараметрСуммаСписания);
																									
									КонецЕсли;																										
									Если НЕ ЗначениеЗаполнено(ИсполняющийДокумент) Тогда   
																										
										Если ПараметрСуммаСписания > 0 И НЕ ЗначениеЗаполнено(GUIDSP) Тогда 
									  		ИсполняющийДокумент =  БиблиотекаФункцийОбмена.СоздатьКассовоеВыбытие(	Структура, 
																													Объект.Ссылка, 
																													ПараметрГУИД,
											 																		ПараметрКВД, 
																													ПараметрИсточникиСтредств, 
																													ПараметрСуммаСписания,
																													ПроизвольныеПараметры,
																													ВидОбмена,
																												    ДанныеНовыхКонтрагентов);   
										КонецЕсли;
 
                                        Если НЕ ЗначениеЗаполнено(ИсполняющийДокумент) И (ПараметрСуммаСписания > 0) И (ЗначениеЗаполнено(ПараметрНомерКОО)) Тогда 
                                        	ИсполняющийДокумент = БиблиотекаФункцийОбмена.СоздатьКассовоеВыбытиеНаОснованииЗаявленияНаАккредитив(ПараметрНомерКОО, ПараметрСуммаСписания, Объект.ДатаВыписки);
										КонецЕсли;

									Иначе   
										Если ТипЗнч(ИсполняющийДокумент) = Тип("ДокументСсылка.ВнешнееРСКП") Тогда
											 ИсполняющийДокумент = БиблиотекаФункцийОбмена.СоздатьКассовоеВыбытиеНаОснованииРСКП(ИсполняющийДокумент, Объект.Ссылка, Структура, ПараметрГУИД, ПроизвольныеПараметры)
										Иначе
											
											 БиблиотекаФункцийОбмена.ЗаписатьОбразПервичногоДокументаЗаявки(	ИсполняющийДокумент, 
											 																	Структура, 
																												Объект.Ссылка, 
																												Объект.ДатаВыписки,
																												ПараметрГУИД,
											 																	ПроизвольныеПараметры);   
												
										КонецЕсли; 								
									КонецЕсли;
								КонецЕсли;
							КонецЦикла; 
							
							Если ЗначениеЗаполнено(ИсполняющийДокумент) Тогда
								Объект.ДокументыДвижений.Добавить().ИсполняющийДокумент = ИсполняющийДокумент;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(Справка) Тогда
								Объект.ДокументыДвижений.Добавить().ИсполняющийДокумент = Справка;
							КонецЕсли;
							
							Структура.Очистить();
							СписокСтрокПП.Очистить();
							СписокПП.Очистить();
							
						КонецЦикла; 
						// для отработки поиска заявок, которые не вошли в файл BD
						Если ЗначениеЗаполнено(ПараФайлов.ФорматФайлаСтруктура) И ТекСтрокаДвижений.Строки.Количество() = 0 Тогда
							
							ПараметрНомерДок 			= ПроизвольныеПараметры.Получить("НомерДок");
							ПараметрДатаДок 			= ПроизвольныеПараметры.Получить("ДатаДок");
							ПараметрИмяДок              = ПроизвольныеПараметры.Получить("ИмяДок");
							ПараметрГУИД 				= ПроизвольныеПараметры.Получить("GUIDПП");
							ПараметрСуммаПоступления	= ПроизвольныеПараметры.Получить("СуммаПоступления");
							ПараметрСуммаСписания 		= ПроизвольныеПараметры.Получить("СуммаСписания");
							ПараметрКВД					= ПроизвольныеПараметры.Получить("КВД");
							ПараметрИсточникиСтредств	= ПроизвольныеПараметры.Получить("ИсточникиСредств");
							ПараметрНомерКОО        	= ПроизвольныеПараметры.Получить("НомерКОО");
							ПараметрКурс 				= ПроизвольныеПараметры.Получить("Курс");
							
							Если ПараметрСуммаПоступления<>Неопределено Тогда
								ПараметрСуммаПоступления = Число(ПараметрСуммаПоступления);
							Иначе
								ПараметрСуммаПоступления = 0;
							КонецЕсли;
							Если ПараметрСуммаСписания<>Неопределено Тогда
								ПараметрСуммаСписания = Число(ПараметрСуммаСписания);
							Иначе
								ПараметрСуммаСписания = 0;
							КонецЕсли;
							Если ПараметрКурс<>Неопределено Тогда
								ПараметрКурс = Число(ПараметрКурс);
							КонецЕсли;
							
							РазложениеИсполняемыхДействий = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПроцедурыОбработкиСтрок.Получить(ТекИмяСекции.Ключ), ";");
							ИсполняющийДокумент = Неопределено;	
							Для каждого ВыполняемоеДействие Из РазложениеИсполняемыхДействий Цикл
								
								Если ВРЕГ(ВыполняемоеДействие) = ВРЕГ("ПолучитьЗаявку") Тогда
									Если ПараметрСуммаСписания>0 Тогда
										ИсполняющийДокумент = БиблиотекаФункцийОбмена.ОпределитьЗаявку(	Объект.Организация,
																										Объект.ЛицевойСчет.Код,
																										ПараметрНомерДок, 
																										ПараметрДатаДок,
																										ПараметрСуммаСписания);
																										
										Если ЗначениеЗаполнено(ИсполняющийДокумент) И ТипЗнч(ИсполняющийДокумент) = Тип("ДокументСсылка.ВнешнееРСКП") Тогда
											 ИсполняющийДокумент = БиблиотекаФункцийОбмена.СоздатьКассовоеВыбытиеНаОснованииРСКП(ИсполняющийДокумент, Объект.Ссылка)
										КонецЕсли;						
																										
                                        Если НЕ ЗначениеЗаполнено(ИсполняющийДокумент) И (ЗначениеЗаполнено(ПараметрНомерКОО)) Тогда 
                                             ИсполняющийДокумент = БиблиотекаФункцийОбмена.СоздатьКассовоеВыбытиеНаОснованииЗаявленияНаАккредитив(ПараметрНомерКОО, ПараметрСуммаСписания, Объект.ДатаВыписки);
								        КонецЕсли;
																																											
						            КонецЕсли;	
								КонецЕсли;	
																
								Если ЗначениеЗаполнено(ИсполняющийДокумент) Тогда
									СтрокаДокументыДвижений = Объект.ДокументыДвижений.Добавить();
									СтрокаДокументыДвижений.ИсполняющийДокумент = ИсполняющийДокумент;
									СтрокаДокументыДвижений.Курс = ПараметрКурс;
								КонецЕсли;
																
                            КонецЦикла;
							
						КонецЕсли;
						
						Если ТекИмяСекции.Ключ = "VPPOB" Тогда
							// в этой секции обрабатываем получение данных БО и ЗКР
							РазложениеИсполняемыхДействий = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПроцедурыОбработкиСтрок.Получить(ТекИмяСекции.Ключ), ";");
							Для каждого ВыполняемоеДействие Из РазложениеИсполняемыхДействий Цикл
								Если ВРЕГ(ВыполняемоеДействие) = ВРЕГ("ЗаписатьНомерБО") Тогда
									Если ПроизвольныеПараметры.Получить("НомерСсылкаБО") = Неопределено Тогда
										ПроизвольныеПараметры.Вставить("НомерСсылкаБО", "");
									КонецЕсли;
									Если ПроизвольныеПараметры.Получить("ДатаБО") = Неопределено Тогда
										ПроизвольныеПараметры.Вставить("ДатаБО", '00010101');
									КонецЕсли;
									Если ПроизвольныеПараметры.Получить("ИДОФКБО") = Неопределено Тогда
										ПроизвольныеПараметры.Вставить("ИДОФКБО", "");
									КонецЕсли;
									Если ПроизвольныеПараметры.Получить("НомерОФКБО") = Неопределено Тогда
										ПроизвольныеПараметры.Вставить("НомерОФКБО", "");
									КонецЕсли;
									Если ПроизвольныеПараметры.Получить("СуммаБО") = Неопределено Тогда
										ПроизвольныеПараметры.Вставить("СуммаБО", 0);
									КонецЕсли;
									Если ПроизвольныеПараметры.Получить("Сумма1БО") = Неопределено Тогда
										ПроизвольныеПараметры.Вставить("Сумма1БО", 0);
									КонецЕсли;
									Если ПроизвольныеПараметры.Получить("Сумма2БО") = Неопределено Тогда
										ПроизвольныеПараметры.Вставить("Сумма2БО", 0);
									КонецЕсли;
									
									ТипБО = ПроизвольныеПараметры.Получить("ТипБО");
									
									//Если ТипБО = Неопределено Тогда
									//	Если СтрДлина(ПроизвольныеПараметры.Получить("НомерСсылкаБО")) = 15 тогда
									//		ТипБО = "1";
									//	КонецЕсли;
									//КонецЕсли;
										
									Если (ТипБО <> "2") Тогда  
										//это не заявки - это сведение о БО
										Если СтрДлина(ПроизвольныеПараметры.Получить("НомерСсылкаБО")) > 9 Тогда
											ПроизвольныеПараметры.Вставить("НомерСсылкаБО", Лев(ПроизвольныеПараметры.Получить("НомерСсылкаБО"),2) + Прав(ПроизвольныеПараметры.Получить("НомерСсылкаБО"),9));
										Иначе
											ПроизвольныеПараметры.Вставить("НомерСсылкаБО", ПроизвольныеПараметры.Получить("НомерСсылкаБО"));
										КонецЕсли;
									Иначе   
										ПроизвольныеПараметры.Вставить("НомерСсылкаБО",БиблиотекаФункцийОбмена.ОпределитьЗаявку(Объект.Организация, Объект.ЛицевойСчет.Код, ПроизвольныеПараметры.Получить("НомерСсылкаБО"), ПроизвольныеПараметры.Получить("ДатаБО"), ПроизвольныеПараметры.Получить("СуммаБО"))); 
									КонецЕсли;	
									
									БиблиотекаФункцийОбмена.ЗаписатьНомерБюджетногоОбязательства(ПроизвольныеПараметры);
										
			//						Иначе
			//							Если ПроизвольныеПараметры.Получить("ТипБО") = "1" тогда  
			//								ПроизвольныеПараметры.Вставить("НомерСсылкаБО",Лев(ПроизвольныеПараметры.Получить("НомерСсылкаБО"),2)+Прав(ПроизвольныеПараметры.Получить("НомерСсылкаБО"),9));
			//							Иначе   
			//								ПроизвольныеПараметры.Вставить("НомерСсылкаБО",БиблиотекаФункцийОбмена.ОпределитьЗаявку(Объект.ЛицевойСчет.Код, ПроизвольныеПараметры.Получить("НомерСсылкаБО"), ПроизвольныеПараметры.Получить("ДатаБО"), ПроизвольныеПараметры.Получить("СуммаБО"))); 
			//							КонецЕсли;
			//							
			////							Если не БиблиотекаФункцийОбмена.ЗаписатьНомерБюджетногоОбязательства(ПринятоеБО, ОписаниеПричины) тогда
			//							Если не БиблиотекаФункцийОбмена.ЗаписатьНомерБюджетногоОбязательства(ПроизвольныеПараметры) тогда
			//								ПрекратитьПроцесс = Истина; 
			//  								ЗаписанОбъект = Ложь;
			//							КонецЕсли;							
			//						КонецЕсли;
								КонецЕсли;
				
								
							КонецЦикла;
						КонецЕсли;
												
						Если ТекИмяСекции.Ключ = "VPPOD" Тогда 
							
						РазложениеИсполняемыхДействий = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПроцедурыОбработкиСтрок.Получить(ТекИмяСекции.Ключ), ";");
							Для каждого ВыполняемоеДействие Из РазложениеИсполняемыхДействий Цикл
								Если ВРЕГ(ВыполняемоеДействие) = ВРЕГ("ЗаписатьНомерДО") Тогда
									Если ПроизвольныеПараметры.Получить("НомерДокДО") = Неопределено Тогда
										ПроизвольныеПараметры.Вставить("НомерДокДО", "");
									КонецЕсли;
									Если ПроизвольныеПараметры.Получить("ДатаДокДО") = Неопределено Тогда
										ПроизвольныеПараметры.Вставить("ДатаДокДО", '00010101');
									КонецЕсли;
									Если ПроизвольныеПараметры.Получить("УчНомерДО") = Неопределено Тогда
										ПроизвольныеПараметры.Вставить("УчНомерДО", "");
									КонецЕсли;
								КонецЕсли;	
								
								БиблиотекаФункцийОбмена.ЗаписатьНомерДенежногоОбязательства(ПроизвольныеПараметры, Задание.Организация, Задание.КассовыйОрган)
								
							КонецЦикла;							
						КонецЕсли;	
					
					Конеццикла; // 
				КонецЦикла;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ПараФайлов.ФорматФайлаСтруктура) Тогда
				Для Каждого ТекСтрокаДвижений Из СтрокаВывода.Строки Цикл
					//ТекСтрокаДвижений = СтрокаВывода.Строки[0];
					Если РезультатВывода.Колонки.Найти("ИтераторИмяСекции") <> Неопределено Тогда
						// Получим строки остатков
						Если ЗначениеЗаполнено(ТекСтрокаДвижений["ИтераторИмяСекции"]) Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					
					Для Каждого ТекИмяСекции Из СоответствиеРеквизитовГруппировок Цикл
						Если РезультатВывода.Колонки.Найти(ТекИмяСекции.Ключ+"ИмяСекции") = Неопределено 
							ИЛИ ПустаяСтрока(ТекСтрокаДвижений[ТекИмяСекции.Ключ+"ИмяСекции"]) Тогда
							Продолжить;
						КонецЕсли;
						Прервать;
					Конеццикла;
					
					СоответствиеРеквизитовТекущейСекции = ТекИмяСекции.Значение;
					
					ПроизвольныеПараметры = Новый Соответствие;
					Если СоответствиеРеквизитовТекущейСекции[ТекИмяСекции.Ключ+"ПроизвольныеПараметры"] = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					Для каждого ТекПараметр Из СоответствиеРеквизитовТекущейСекции[ТекИмяСекции.Ключ+"ПроизвольныеПараметры"] Цикл
					
						ПроизвольныеПараметры.Вставить(ТекПараметр.Ключ, ТекСтрокаДвижений[СтрЗаменить(ТекПараметр.Значение, ".", "")]);
					
					КонецЦикла; 
					
					
					Если ПроцедурыОбработкиСтрок.Получить(ТекИмяСекции.Ключ) = Неопределено Тогда//Если СоответствиеРеквизитовТекущейСекции.Получить("ВыполняемоеДействие") = Неопределено Тогда
						// если не задано действие, то нет смысла читать расшифровку и обрабатывать дальше
						Продолжить;
					КонецЕсли;
				
						ПараметрНомерДок 			= ?(ЗначениеЗаполнено(ПроизвольныеПараметры.Получить("НомерДок")), ПроизвольныеПараметры.Получить("НомерДок"), ПроизвольныеПараметры.Получить("НомерПодтверждающегоДокумента"));
						ПараметрДатаДок 			= ?(ЗначениеЗаполнено(ПроизвольныеПараметры.Получить("ДатаДок")),  ПроизвольныеПараметры.Получить("ДатаДок"),  ПроизвольныеПараметры.Получить("ДатаПодтверждающегоДокумента"));
						ПараметрИмяДок              = ПроизвольныеПараметры.Получить("ИмяДок");
						ПараметрГУИД 				= ПроизвольныеПараметры.Получить("GUIDПП");
						ПараметрСуммаПоступления	= ПроизвольныеПараметры.Получить("СуммаПоступления");
						ПараметрСуммаСписания 		= ПроизвольныеПараметры.Получить("СуммаСписания");
						ПараметрКВД					= ПроизвольныеПараметры.Получить("КВД");
						ПараметрИсточникиСтредств	= ПроизвольныеПараметры.Получить("ИсточникиСредств");
						ПараметрНомерКОО        	= ПроизвольныеПараметры.Получить("НомерКОО");
						ПараметрНомерПодтверДок     = ПроизвольныеПараметры.Получить("НомерПодтверждающегоДокумента");
						ПараметрДатаПодтверДок      = ПроизвольныеПараметры.Получить("ДатаПодтверждающегоДокумента");
						ПараметрКурс 				= ПроизвольныеПараметры.Получить("Курс");
						
						Если ПараметрСуммаПоступления <> Неопределено Тогда
							ПараметрСуммаПоступления = Число(ПараметрСуммаПоступления);
						КонецЕсли;
						Если ПараметрСуммаСписания <> Неопределено Тогда
							ПараметрСуммаСписания = Число(ПараметрСуммаСписания);
						КонецЕсли;
						Если ПараметрКурс<>Неопределено Тогда
							ПараметрКурс = Число(ПараметрКурс);
						КонецЕсли;
						
						РазложениеИсполняемыхДействий = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПроцедурыОбработкиСтрок.Получить(ТекИмяСекции.Ключ), ";");
						
						ИсполняющийДокумент           = Неопределено;	
						Справка                       = Неопределено;
						
						Для каждого ВыполняемоеДействие Из РазложениеИсполняемыхДействий Цикл
							// выполняем действие для данной строки
							Если ВРЕГ(ВыполняемоеДействие) = ВРЕГ("ДокументЗадающийБюджетныеДанные") Тогда
								ИсполняющийДокумент = БиблиотекаФункцийОбмена.ОпределитьДокументЗадающийБюджетныеДанные(Объект.ЛицевойСчет.Код,
																														ПараметрНомерДок,
																														ПараметрДатаДок,
																														ПараметрГУИД);
							ИначеЕсли ВРЕГ(ВыполняемоеДействие) = ВРЕГ("НовоеКассовоеПоступление") Тогда
								Если ПараметрСуммаПоступления > 0 Тогда
									ИсполняющийДокумент = БиблиотекаФункцийОбмена.СоздатьКассовоеПоступление(	Структура,
																												Объект.Ссылка, 
																												ПараметрГУИД, 
																												ПараметрКВД, 
																												ПараметрИсточникиСтредств,
																												ПараметрСуммаПоступления,
																												,
																												ВидОбмена,
																												ДанныеНовыхКонтрагентов);
								КонецЕсли;	
                            ИначеЕсли ВРЕГ(ВыполняемоеДействие) = ВРЕГ("ПолучитьЗаявлениеИнВал") Тогда	
									    Справка = БиблиотекаФункцийОбмена.ОпределитьЗаялениеИнВал( Объект.Организация,
																								   Объект.ЛицевойСчет.Код,
																								   ПараметрНомерПодтверДок, 
																								   ПараметрДатаПодтверДок);
							ИначеЕсли ВРЕГ(ВыполняемоеДействие) = ВРЕГ("ПолучитьЗаявку") Тогда
								Если ПараметрСуммаСписания > 0 Тогда
									ИсполняющийДокумент = БиблиотекаФункцийОбмена.ОпределитьЗаявку(	Объект.Организация,
									                                                                Объект.ЛицевойСчет.Код,
																									ПараметрНомерДок, 
																									ПараметрДатаДок,
																									ПараметрСуммаСписания);
																								
								КонецЕсли;																										
								Если НЕ ЗначениеЗаполнено(ИсполняющийДокумент) Тогда   
																									
									Если ПараметрСуммаСписания > 0  Тогда 
								  		ИсполняющийДокумент =  БиблиотекаФункцийОбмена.СоздатьКассовоеВыбытие(	Структура, 
																												Объект.Ссылка, 
																												ПараметрГУИД,
										 																		ПараметрКВД, 
																												ПараметрИсточникиСтредств, 
																												ПараметрСуммаСписания,
																												ПроизвольныеПараметры,
																												ВидОбмена,
																												ДанныеНовыхКонтрагентов);   
									КонецЕсли 
								Иначе 
									 Если ТипЗнч(ИсполняющийДокумент) = Тип("ДокументСсылка.ВнешнееРСКП") Тогда
											 ИсполняющийДокумент = БиблиотекаФункцийОбмена.СоздатьКассовоеВыбытиеНаОснованииРСКП(ИсполняющийДокумент, Объект.Ссылка, Структура, ПараметрГУИД, ПроизвольныеПараметры)
										Иначе

									 		 БиблиотекаФункцийОбмена.ЗаписатьОбразПервичногоДокументаЗаявки(ИсполняющийДокумент, 
										 																	Структура, 
																											Объект.Ссылка, 
																											Объект.ДатаВыписки,
									 																		ПараметрГУИД); 
									 КонецЕсли; 																		
								КонецЕсли; 					
							КонецЕсли;
							
						КонецЦикла; 
						
						Если ЗначениеЗаполнено(ИсполняющийДокумент) Тогда
							СтрокаДокументыДвижений = Объект.ДокументыДвижений.Добавить();
							СтрокаДокументыДвижений.ИсполняющийДокумент = ИсполняющийДокумент;
							СтрокаДокументыДвижений.Курс = ПараметрКурс;
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Справка) Тогда
							Объект.ДокументыДвижений.Добавить().ИсполняющийДокумент = Справка;
						КонецЕсли;
						
					КонецЦикла;
			КонецЕсли;
			
			ЗаписатьНовыйОбъектИмпорта(Задание, Объект, Неопределено, ПараФайлов.ОсновнойФайл, ОписаниеОбъектаОшибки, ПараФайлов.ФорматОсновногоФайла);
		КонецЦикла;
		
	КонецЦикла;
		
	//Если НЕ Отказ Тогда
		
		Если Задание.Модифицированность() Тогда
			Задание.Записать();
		КонецЕсли;
			
	//КонецЕсли;																
															
КонецПроцедуры

Процедура ПреобразоватьПравилаОбмена(ПравилаОбмена)  
	
	Для Каждого Правило Из ПравилаОбмена Цикл  
		
		Правило.ПолеФайлаПередачи = СтрЗаменить(Правило.ПолеФайлаПередачи, "[last()]", ""); 
		ОкончаниеПрефикса         = Найти(Правило.ПолеФайлаПередачи, ":");
		
		Если ОкончаниеПрефикса > 0 Тогда
			 НачалоПрефикса            = СтрНайти(Лев(Правило.ПолеФайлаПередачи, ОкончаниеПрефикса), "/", НаправлениеПоиска.СКонца);
			 Префикс                   = Сред(Правило.ПолеФайлаПередачи, НачалоПрефикса + 1, ОкончаниеПрефикса - НачалоПрефикса);
			 Правило.ПолеФайлаПередачи = СтрЗаменить(Правило.ПолеФайлаПередачи, Префикс, "");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

Функция ОткрытьДокументФайла(Формат, ИмяФайлаИмпорта, СсылкаНаЗадание, ТабДокумент, ОписаниеОшибки)     Экспорт

	ВидОбмена              = Формат.Владелец;
	Поддержка              = Истина;
	МассивДокументов       = Новый Массив;
	МассивБлоков           = Новый Массив;
	
	//--------------------------------------------------------------------------------
	ТекстФайла             = СодержимоеФайла(СсылкаНаЗадание, ИмяФайлаИмпорта,ВидОбмена);
	
	Если НЕ ЗначениеЗаполнено(ТекстФайла) Тогда
		ОписаниеОшибки     = НСтр("ru='Не удалось прочитать файл '" + ИмяФайлаИмпорта);
		Возврат Ложь;
	КонецЕсли;
	
	СоответствиеПеременных = Новый Соответствие;
	
	ПравилаОбмена          = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(Формат); 
	
	Если Формат.НаправлениеОбмена = Перечисления.НаправлениеОбменаБанкиКС.Экспорт Тогда
	    ПреобразоватьПравилаОбмена(ПравилаОбмена);
	КонецЕсли;
	
	НомерСтрокиНачало      = ТабДокумент.ВысотаТаблицы + 1;
	ОбъектыПечати          = Новый СписокЗначений;
	ОбъектыПечати.Добавить(СсылкаНаЗадание, Формат.Наименование);
	
	Если ВидОбмена.ТипФайлаПередачи = Перечисления.ТипыФайловПередачиДляОбмена.TXT Тогда
		Если ВидОбмена.ПредставлениеВНомереВерсии = "TX" Тогда
			// чтение из файла 
			Пока СтрДлина(ТекстФайла) > 0 Цикл
				
				ТекущаяСтрока         = "";
				
				ПозНовойСтроки        = Найти(ТекстФайла, Символы.ПС);
				
				Если ПозНовойСтроки > 0 Тогда
					ТекущаяСтрока     = Лев(ТекстФайла, ПозНовойСтроки - 1);
					ТекстФайла        = Сред(ТекстФайла, ПозНовойСтроки + 1);
				Иначе
					Если СокрЛП(ТекстФайла) = "" Тогда
						Продолжить;
					Иначе
						ТекущаяСтрока = ТекстФайла;
						ТекстФайла    = "";
					КонецЕсли;
				КонецЕсли;
				
				ПозРазделителя          = Найти(ТекущаяСтрока, "|");
				МаркерСтроки            = Лев(ТекущаяСтрока,ПозРазделителя -1);
				ТекущаяСтрока           = Сред(ТекущаяСтрока, ПозРазделителя + 1);
				
				НомерСекцииПравил       = -1;
				
				Для к = 0 По ПравилаОбмена.Количество()-1 Цикл
					
					Если Найти(ПравилаОбмена[к].ПолеФайлаПередачи, МаркерСтроки + ".") > 0 Тогда
						НомерСекцииПравил = к;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				Если НомерСекцииПравил = -1 Тогда
					ОписаниеОшибки = НСтр("ru='Структура файла импорта отличается от структуры, описанной в формате ' " + Строка(Формат));
					Возврат Ложь;
				КонецЕсли;
				
				Пока СтрДлина(ТекущаяСтрока) > 0 Цикл
					
					Если НомерСекцииПравил > ПравилаОбмена.Количество()-1 Тогда
						ОписаниеОшибки = НСтр("ru='Структура файла импорта отличается от структуры, описанной в формате '" + Строка(Формат));
						Возврат Ложь;
					КонецЕсли;
					
					ПозРазделителя     = Найти(ТекущаяСтрока, "|");
					ПолеСтроки         = Лев(ТекущаяСтрока,  ПозРазделителя -1);
					ТекущаяСтрока      = Сред(ТекущаяСтрока, ПозРазделителя + 1);
					
					Правило            = ПравилаОбмена[НомерСекцииПравил];
					ЗначениеПеременной = СокрЛП(ПолеСтроки);
					
					Если ЗначениеЗаполнено(Правило) И Правило.Условие = "*НовыйОбъект" Тогда
													 
						СоответствиеПеременных = Новый Соответствие;
						МассивДокументов.Добавить(СоответствиеПеременных);
						СоответствиеПеременных = МассивДокументов[МассивДокументов.Количество() - 1];
											
					КонецЕсли;
					
					
					НомерСекцииПравил  = НомерСекцииПравил + 1;
					
					НайтиСоответствиеПоПравилу(Правило, СоответствиеПеременных, МаркерСтроки + ".", ЗначениеПеременной);
					
				КонецЦикла;
				
			КонецЦикла;
			
		Иначе
			Поддержка = Ложь;
		КонецЕсли;
	ИначеЕсли ВидОбмена.ТипФайлаПередачи = Перечисления.ТипыФайловПередачиДляОбмена.XML Тогда
		
		ЧтениеXML 			= Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ТекстФайла);
		
		ПутьПравилаОбработки = "";
		
		Пока ЧтениеXML.Прочитать() Цикл
			// Обработка узла XML
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
				ПутьПравилаОбработки = ПутьПравилаОбработки + "/" + ЧтениеXML.ЛокальноеИмя;
				
				Если ЧтениеXML.КоличествоАтрибутов() > 0 Тогда
					Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
						
						ПолеСтроки	 = ЧтениеXML.Значение;
						
						Правило		 = ПравилаОбмена.Найти(ПутьПравилаОбработки + "/@" + ЧтениеXML.ЛокальноеИмя, "ПолеФайлаПередачи");
						
						Если ЗначениеЗаполнено(Правило) Тогда							
							НайтиСоответствиеПоПравилу(Правило, СоответствиеПеременных, ПутьПравилаОбработки + "/@" + ЧтениеXML.ЛокальноеИмя, ПолеСтроки);
						КонецЕсли;
						
					КонецЦикла
				КонецЕсли;
				
				Правило	= ПравилаОбмена.Найти(ПутьПравилаОбработки, "ПолеФайлаПередачи");
				
				Если ЗначениеЗаполнено(Правило) И Правило.Условие = "*НовыйБлок" Тогда
					
					 СоответствиеКорень = СоответствиеПеременных;					
					 СоответствиеПеременных = Новый Соответствие; 					 
					
				КонецЕсли; 

				
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
				
				ПолеСтроки	 = ЧтениеXML.Значение;
				
				Правило		 = ПравилаОбмена.Найти(ПутьПравилаОбработки, "ПолеФайлаПередачи");
								
				Если ЗначениеЗаполнено(Правило) Тогда
					НайтиСоответствиеПоПравилу(Правило, СоответствиеПеременных, ПутьПравилаОбработки, ПолеСтроки);
				КонецЕсли;
				
			ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				
				Правило	= ПравилаОбмена.Найти(ПутьПравилаОбработки, "ПолеФайлаПередачи");
				
				Если ЗначениеЗаполнено(Правило) И (Правило.Условие = "*НовыйОбъект" ИЛИ Правило.Условие ="*НачалоОбъекта") Тогда
													 
					 МассивДокументов.Добавить(СоответствиеПеременных);
					 СоответствиеПеременных = Новый Соответствие;
					
				КонецЕсли;
				 
				Если ЗначениеЗаполнено(Правило) И Правило.Условие = "*НовыйБлок" Тогда
													 
					 МассивБлоков.Добавить(СоответствиеПеременных);
					 СоответствиеПеременных = СоответствиеКорень;
					 					
				КонецЕсли; 
			
				позУзла = Найти(ПутьПравилаОбработки+"/", "/"+ ЧтениеXML.ЛокальноеИмя+"/");
				Если позУзла >= 1 Тогда
					ПутьПравилаОбработки = Лев(ПутьПравилаОбработки, позУзла - 1);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		Поддержка = Ложь;
	КонецЕсли;
	
	Если Поддержка Тогда
		Макет = Неопределено;
		Попытка
			Макет   = ПолучитьМакет(Формат.МакетПечатнойФормы);
		Исключение
			Если Метаданные.ОбщиеМакеты.Найти(Формат.МакетПечатнойФормы) <> неопределено тогда
				Макет   = ПолучитьОбщийМакет(Формат.МакетПечатнойФормы);
			КонецЕсли;	
		КонецПопытки;
		 
		Если Макет = Неопределено тогда
			ОписаниеОшибки = НСтр("ru='Макет для данного формата не найден'");
			Возврат Ложь; 
		КонецЕсли;
		// выводим на печать
		
		Для каждого СоответствиеПеременных Из МассивДокументов Цикл
		
			Для каждого ПравилоПечати Из Формат.ПравилаПечати Цикл
				
				Если ПравилоПечати.Вложенная И МассивБлоков.Количество() > 0 Тогда
				//отрабатываем вложенный блок	
				
				    Если Формат.ПравилаПечати[Формат.ПравилаПечати.Индекс(ПравилоПечати) - 1].Вложенная Тогда
					// блок обрабатывался ранее
					   Продолжить;
				    КонецЕсли;
				
					Для каждого СоответствиеПеременныхБлок Из МассивБлоков Цикл
						
		                н                  = Формат.ПравилаПечати.Индекс(ПравилоПечати);
						ПравилоПечатиБлока = Формат.ПравилаПечати[н];
						
						Пока ПравилоПечатиБлока.Вложенная И (н <= Формат.ПравилаПечати.Количество()-1) Цикл
											
							Область 				= Макет.ПолучитьОбласть(ПравилоПечатиБлока.ИмяСекции);
					        МассивПовторенийСекции 	= СоответствиеПеременныхБлок.Получить(ПравилоПечатиБлока.ИмяСекции);
							
							Если НЕ МассивПовторенийСекции = Неопределено Тогда
								Для к = 0 По МассивПовторенийСекции.Количество()-1 Цикл
									Область.Параметры.Заполнить(МассивПовторенийСекции[к]);									
									ТабДокумент.Вывести(Область);
								КонецЦикла;
							Иначе
								ТабДокумент.Вывести(Область);
							КонецЕсли;
							
						    н                       = н + 1;
							ПравилоПечатиБлока      = Формат.ПравилаПечати[н];
							
						КонецЦикла;
						
					КонецЦикла;	
					
				Иначе	
				//не относится к блоку, не вложенная
					Область 				= Макет.ПолучитьОбласть(ПравилоПечати.ИмяСекции);
					МассивПовторенийСекции 	= СоответствиеПеременных.Получить(ПравилоПечати.ИмяСекции);
					
					Если НЕ МассивПовторенийСекции = Неопределено Тогда
						Для к = 0 По МассивПовторенийСекции.Количество()-1 Цикл
							Область.Параметры.Заполнить(МассивПовторенийСекции[к]);
							//--------------------------------------------------------- доп. параметры, отсутсвующие в выгрузке
							Если ВидОбмена.ТипФайлаПередачи = Перечисления.ТипыФайловПередачиДляОбмена.XML Тогда    
								
								Если Найти(Формат.МакетПечатнойФормы, "0402108") > 0 Тогда    
									
									Если СокрЛП(ПравилоПечати.ИмяСекции) = "Шапка" Тогда 
										
										Область.Параметры.СуммаЧисломПрописью     = ПлатежноРасчетныеДокументы.ФорматироватьСуммуПлатежногоДокумента(Число(МассивПовторенийСекции[к].СуммаДокумента)/100) + " " + 
										                                            ПлатежноРасчетныеДокументы.ФорматироватьСуммуПрописьюПлатежногоДокумента(Число(МассивПовторенийСекции[к].СуммаДокумента)/100);
										Область.Параметры.ГодДаты                 = Лев(МассивПовторенийСекции[к].ДатаДок, 4);	
										Область.Параметры.ЧислоДаты               = Прав(МассивПовторенийСекции[к].ДатаДок, 2); 
										Область.Параметры.МесяцДаты               = Сред(МассивПовторенийСекции[к].ДатаДок, 6, 2);
																					
                                        Если МассивПовторенийСекции[к].ТипОперации = "1" Тогда
											Область.Параметры.НаименованиеЗаявки = "Заявка на сдачу наличных денег";
											Область.Параметры.ИмяСообщения       = "Сообщаем о сдаче";  
											Область.Параметры.НазваниеСчета      = "Для списания со счета №";
										ИначеЕсли МассивПовторенийСекции[к].ТипОперации = "2" Тогда	
											Область.Параметры.НаименованиеЗаявки = "Заявка на получение наличных денег";
											Область.Параметры.ИмяСообщения       = "Сообщаем о получении";  
											Область.Параметры.НазваниеСчета      = "Для зачисления на счет №";
										КонецЕсли;	
										
									ИначеЕсли СокрЛП(ПравилоПечати.ИмяСекции) = "Банкноты" Тогда 
										Область.Параметры.Номинал  = Число(МассивПовторенийСекции[к].Номинал)/100; 
										Область.Параметры.Сумма    = Число(МассивПовторенийСекции[к].Сумма)/100;   
									ИначеЕсли  СокрЛП(ПравилоПечати.ИмяСекции) = "Источники" Тогда
										Область.Параметры.Сумма    = Число(МассивПовторенийСекции[к].Сумма)/100;    	
									ИначеЕсли  СокрЛП(ПравилоПечати.ИмяСекции) = "Подвал" Тогда  
										
										Область.Параметры.НазваниеРаботника = "Вноситель (получатель)";	

									КонецЕсли; 
								ИначеЕсли (Формат.МакетПечатнойФормы = "Выписка_УФЭБС") ИЛИ (Формат.МакетПечатнойФормы = "Извещение_УФЭБС") Тогда
									
									Если ПравилоПечати.ИмяСекции = "Строка" Тогда    
										Если МассивПовторенийСекции[к].Свойство("Признак") И МассивПовторенийСекции[к].Свойство("Сумма") Тогда   
											Если  МассивПовторенийСекции[к].Признак = "1" Тогда
												Область.Параметры.Дебет  = МассивПовторенийСекции[к].Сумма;
												Область.Параметры.Кредит = "";
											Иначе
												Область.Параметры.Кредит = МассивПовторенийСекции[к].Сумма;
												Область.Параметры.Дебет  = "";
	                                        КонецЕсли;
										КонецЕсли;	
									КонецЕсли;	
									
									Если СокрЛП(ПравилоПечати.ИмяСекции) = "Шапка" Тогда 	
										Область.Параметры.НаименованиеОрганизации = СсылкаНаЗадание.Организация.НаименованиеПолное;
										Область.Параметры.БИКБанка                = СсылкаНаЗадание.КассовыйОрган.Код;
										Область.Параметры.НаименованиеБанка       = СсылкаНаЗадание.КассовыйОрган.Наименование;    
									КонецЕсли;	
									
								Иначе	
						           Если СокрЛП(ПравилоПечати.ИмяСекции) = "Шапка" Тогда 	
										Область.Параметры.НаименованиеОрганизации = СсылкаНаЗадание.Организация.НаименованиеПолное;
										Область.Параметры.БИКБанка                = СсылкаНаЗадание.КассовыйОрган.Код;
										Область.Параметры.НаименованиеБанка       = СсылкаНаЗадание.КассовыйОрган.Наименование;    
									КонецЕсли;	
								КонецЕсли;
							КонецЕсли;
							///////////////////////////////////////////////////////////  
							
						    //--------------------------------------------------------- доп.преобразования для вывода на печать перед подписанием
							Если Найти(Формат.МакетПечатнойФормы, "ПлатежноеПоручение") > 0 Тогда
								Область.Параметры.НаименованиеНомер            = "ПЛАТЕЖНОЕ ПОРУЧЕНИЕ №" + МассивПовторенийСекции[к].НаименованиеНомер;
								Область.Параметры.СуммаЧислом                  = ПлатежноРасчетныеДокументы.ФорматироватьСуммуПлатежногоДокумента(Число(МассивПовторенийСекции[к].СуммаЧислом)/100);
								Область.Параметры.СуммаПрописью                = ПлатежноРасчетныеДокументы.ФорматироватьСуммуПрописьюПлатежногоДокумента(Число(МассивПовторенийСекции[к].СуммаЧислом)/100);
							КонецЕсли;
							
							///////////////////////////////////////////////////////////
							
							ТабДокумент.Вывести(Область);
						КонецЦикла;
					Иначе
						ТабДокумент.Вывести(Область);
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		
		ОписаниеОшибки = НСтр("ru='Данный вид файлов не поддерживается механизмом вывода печатных форм'");
		Возврат Ложь
	КонецЕсли;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, СсылкаНаЗадание);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗагрузитьИзФайлаXML3(ТекстФайла, Формат, ЗаданиеСсылка) Экспорт
	Перем НомераОбходовТаблиц;		
	ПравилаОбменаТекФормата = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(Формат);	
	ПравилаОбменаТекФормата.Колонки.Добавить("Отключить");
	ПравилаОбменаТекФормата.ЗаполнитьЗначения(Истина, "Отключить"); 
	ПравилаОбменаТекФормата.Индексы.Добавить("ПолеФайлаПередачи");
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("СлужебноеПоле_ТабличнаяЧасть");
	ТаблицаДанных.Колонки.Добавить("СлужебноеПоле_ИдентификаторСтроки");
	ТаблицаДанных.Индексы.Добавить("СлужебноеПоле_ТабличнаяЧасть, СлужебноеПоле_ИдентификаторСтроки");
	КолонкиТаблицы = Новый Массив;

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстФайла);
	
	ПутьПравилаОбработки = "";
	
	СоответствиеКолонок = Новый ТаблицаЗначений;
	СоответствиеКолонок.Колонки.Добавить("ПутьПравила");
	СоответствиеКолонок.Колонки.Добавить("ИмяКолонки");
	СоответствиеКолонок.Колонки.Добавить("ИмяПоля");
	
	ПараметрыЧтения = Новый Структура;
	ПараметрыЧтения.Вставить("ПравилаОбмена"		, ПравилаОбменаТекФормата);
	ПараметрыЧтения.Вставить("ТаблицаДанных"		, ТаблицаДанных);
	ПараметрыЧтения.Вставить("СоответствиеКолонок"	, СоответствиеКолонок);
	ПараметрыЧтения.Вставить("НомераОбходовТаблиц"	, НомераОбходовТаблиц);
	ПараметрыЧтения.Вставить("ЧтениеXML"			, ЧтениеXML);
	ПараметрыЧтения.Вставить("КолонкиТаблицы"		, КолонкиТаблицы);
	ПараметрыЧтения.Вставить("ТабЧасти"				, Новый Соответствие);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда							
			ПутьПравилаОбработки = ПутьПравилаОбработки + "/" + ЧтениеXML.Имя;			
		КонецЕсли;
		
		ПрочитатьЗначениеПутиПравила(ПараметрыЧтения, ПутьПравилаОбработки);
										
		ПутьПравилаОбработки_БезПространстваИмен = ПолучитьПутьПравилаОбработкиБезПространстваИмен(ПутьПравилаОбработки);					
		Если ПутьПравилаОбработки_БезПространстваИмен <> ПутьПравилаОбработки Тогда
			ПрочитатьЗначениеПутиПравила(ПараметрыЧтения, ПутьПравилаОбработки_БезПространстваИмен);
		КонецЕсли;
	
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда				
			// Чтение Атрибутов
			Если ЧтениеXML.КоличествоАтрибутов() > 0 Тогда
				Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
					
					ПутьПравилаОбработки = ПутьПравилаОбработки + "/@" + ЧтениеXML.Имя;	
					ПрочитатьЗначениеПутиПравила(ПараметрыЧтения, ПутьПравилаОбработки);
										
					ПутьПравилаОбработки_БезПространстваИмен = ПолучитьПутьПравилаОбработкиБезПространстваИмен(ПутьПравилаОбработки);					
					Если ПутьПравилаОбработки_БезПространстваИмен <> ПутьПравилаОбработки Тогда
						ПрочитатьЗначениеПутиПравила(ПараметрыЧтения, ПутьПравилаОбработки_БезПространстваИмен);
					КонецЕсли;
				
					позУзла = Найти(ПутьПравилаОбработки+"/", "/@"+ ЧтениеXML.Имя+"/");
					Если позУзла >= 1 Тогда
						ПутьПравилаОбработки = Лев(ПутьПравилаОбработки, позУзла - 1);
					КонецЕсли;			
									
				КонецЦикла;
			КонецЕсли;			
		КонецЕсли;		
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда			
			позУзла = Найти(ПутьПравилаОбработки+"/", "/"+ ЧтениеXML.Имя+"/");
			Если позУзла >= 1 Тогда
				ПутьПравилаОбработки = Лев(ПутьПравилаОбработки, позУзла - 1);
			КонецЕсли;			
		КонецЕсли;
			
	КонецЦикла;
		
	РезультатВыполнения = ПолучитьДанныеИмпортаПоСхемеФормата(ПравилаОбменаТекФормата, ТаблицаДанных, СоответствиеКолонок, КолонкиТаблицы, ЗаданиеСсылка);	
	
	Возврат РезультатВыполнения;
		
КонецФункции

// создает из входящих файлов структуру, содержащую таблицы для передачи в СКД и заполняет эти таблицы
//
//Функция СоздатьИсточникиДанныхИзТекстов(ФорматДанных, ФорматРасшифровки, ФорматРасшифровки_ВО, Знач ТекстФайлаДанных, Знач ТекстФайлаРасшифровки, 
//	Знач ТекстФайлаРасшифровки_ВО, ИдентификаторДокумента, знач СчетчикДокументов = 0) Экспорт 
Функция СоздатьИсточникиДанныхИзТекстов(ИдентификаторДокумента, знач СчетчикДокументов = 0, Знач ДанныеДляИсточника)
	
	Перем ТекущаяТаблица;
	Перем ФорматДанных;
	Перем ФорматРасшифровки;
	Перем ФорматРасшифровки_ВО;
	Перем ФорматРасшифровки_ВС;
	Перем ТекстФайлаДанных;
	Перем ТекстФайлаРасшифровки;
	Перем ТекстФайлаРасшифровки_ВО;
	Перем ТекстФайлаРасшифровки_ВС;
	
	ДанныеДляИсточника.Свойство("ФорматОсновногоФайла", 	ФорматДанных);
	ДанныеДляИсточника.Свойство("ФорматФайлаСтруктура", 	ФорматРасшифровки);
	ДанныеДляИсточника.Свойство("ФорматФайлаСтруктура_ВО", 	ФорматРасшифровки_ВО);
	ДанныеДляИсточника.Свойство("ФорматФайлаСтруктура_ВС", 	ФорматРасшифровки_ВС);
	ДанныеДляИсточника.Свойство("ТекстОсновногоФайла", 		ТекстФайлаДанных);
	ДанныеДляИсточника.Свойство("ТекстФайлаСтруктура", 		ТекстФайлаРасшифровки);
	ДанныеДляИсточника.Свойство("ТекстФайлаСтруктура_ВО", 	ТекстФайлаРасшифровки_ВО);
	ДанныеДляИсточника.Свойство("ТекстФайлаСтруктура_ВС", 	ТекстФайлаРасшифровки_ВС);
	
	Если ТипЗнч(ТекстФайлаДанных) <> Тип("ТекстовыйДокумент") Тогда
		ВрТекст = ТекстФайлаДанных;
		ТекстФайлаДанных = Новый ТекстовыйДокумент;
		ТекстФайлаДанных.УстановитьТекст(ВрТекст);
	КонецЕсли;
	
	ИсточникиДанных = Новый Структура;
	
	// создадим и заполним таблицу по файлу расшифровки. Она будет всегда
	ТаблицаРезультат = СоздатьИсточник_Расшифровка(ФорматРасшифровки, "BD");
	ЗагрузитьИсточник_Расшифровка(ТекстФайлаРасшифровки, ТаблицаРезультат, ИдентификаторДокумента);
	ИсточникиДанных.Вставить("BD", ТаблицаРезультат);
	
	// создадим и заполним таблицу по файлу расшифровки_внебанковские операции
	ТаблицаРезультат = СоздатьИсточник_Расшифровка(ФорматРасшифровки_ВО, "BH");
	ЗагрузитьИсточник_Расшифровка_ВО(ТекстФайлаРасшифровки_ВО, ТаблицаРезультат, ИдентификаторДокумента);
	ИсточникиДанных.Вставить("BH", ТаблицаРезультат);
	
	// создадим и заполним таблицу по файлу расшифровки_бухгалтерская справка
	ТаблицаРезультат = СоздатьИсточник_Расшифровка(ФорматРасшифровки_ВС, "SP");
	ЗагрузитьИсточник_Расшифровка_ВС(ТекстФайлаРасшифровки_ВС, ТаблицаРезультат, ИдентификаторДокумента);
	ИсточникиДанных.Вставить("SP", ТаблицаРезультат);
	
	// создадим таблицы из формата данных
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПолеОбъекта
	               |ИЗ
	               |	Справочник.ФорматыОбменаБанкиКС.ПравилаОбмена КАК ФорматыОбменаБанкиКСПравилаОбмена
	               |ГДЕ
	               |	ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = &Ссылка
	               |	И ФорматыОбменаБанкиКСПравилаОбмена.Отключить = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки";
				   
	Запрос.УстановитьПараметр("Ссылка", ФорматДанных);
	Выборка = Запрос.Выполнить().Выбрать();
	СекцииШапки = Новый Массив;
	Пока Выборка.Следующий() Цикл
	
		СоставПоля = СтрРазделить(Выборка.ПолеФайлаПередачи, ".");
		ИмяИсточника = СоставПоля[0];
		Если СекцииШапки.Найти(ИмяИсточника)=Неопределено Тогда
			СоставПоляОбъекта = СтрРазделить(Выборка.ПолеОбъекта, ";");
			Для каждого ТекПолеОбъекта Из СоставПоляОбъекта Цикл
				СоставТекущегоПоля = СтрРазделить(ТекПолеОбъекта, ".");
				Если СоставТекущегоПоля.Количество()=2 И ВРЕГ(СоставТекущегоПоля[0])="ОБЪЕКТ" Тогда
					СекцииШапки.Добавить(ИмяИсточника);
					Прервать;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	
	КонецЦикла; 
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		
		СоставПоля = СтрРазделить(Выборка.ПолеФайлаПередачи, ".");
		ИмяИсточника = СоставПоля[0];
		// заголовок файла в источниках данных нам не требуется
		Если ИмяИсточника="FK" ИЛИ ИмяИсточника="FROM" ИЛИ ИмяИсточника="TO" 
			ИЛИ Сред(ИмяИсточника, 5, 5) = "CONTR" Тогда
			Продолжить;
		КонецЕсли;
		
		Если СекцииШапки.Найти(ИмяИсточника)<>Неопределено Тогда
			ИмяИсточника = ИдентификаторДокумента;
		КонецЕсли;
		
		Если ИсточникиДанных.Свойство(ИмяИсточника, ТекущаяТаблица) Тогда
			ТекущаяТаблица.Колонки.Добавить(СоставПоля[0]+"_"+СоставПоля[1]);
		Иначе
			ТекущаяТаблица = Новый ТаблицаЗначений;
			Если ИмяИсточника = ИдентификаторДокумента Тогда
				ТекущаяТаблица.Колонки.Добавить(СоставПоля[0]+"_ID");
				ТекущаяТаблица.Колонки.Добавить(СоставПоля[0]+"_ИмяСекции"); // колонка содержит имя текущей секции
			Иначе
				ТекущаяТаблица.Колонки.Добавить(СоставПоля[0]+"_ID"); // колонка для связи с источником данных из первой строки
				ТекущаяТаблица.Колонки.Добавить(СоставПоля[0]+"_ИмяСекции"); // колонка содержит имя текущей секции

				// Для каждой таблицы необходимо добавить свою таблицу расшифровки. Для дальнейшего связывания
				//ИсточникиДанных.Вставить(ИмяИсточника+"_BD", ТаблицаРезультат.Скопировать());
			КонецЕсли;
			ТекущаяТаблица.Колонки.Добавить(СоставПоля[0]+"_"+СоставПоля[1]);
			ИсточникиДанных.Вставить(ИмяИсточника, ТекущаяТаблица);
			
		КонецЕсли;
		
	КонецЦикла;
				   
	// заполним источники данных
	КорректорШапка = 0;
	Корректор      = 0;
	
	Для СчетчикСтрок = 1 По ТекстФайлаДанных.КоличествоСтрок() Цикл
	
		РазборСтроки = СтрРазделить(ТекстФайлаДанных.ПолучитьСтроку(СчетчикСтрок), "|");  
		
		Если РазборСтроки.Количество() = 0 Тогда 
		//если в файле ошибочно содержатся пустые строки	
			Продолжить; 
		КонецЕсли;	
		
		ИмяИсточника = РазборСтроки[0];
		Если ИмяИсточника="FK" ИЛИ ИмяИсточника="FROM" ИЛИ ИмяИсточника="TO"
			ИЛИ Сред(ИмяИсточника, 5, 5) = "CONTR" Тогда
			Продолжить;
		КонецЕсли;
		
		НеДобавлятьСтроку = Ложь;
		
		Если СекцииШапки.Найти(ИмяИсточника) <> Неопределено И ИмяИсточника <> ИдентификаторДокумента Тогда
			
			ИмяИсточника      = ИдентификаторДокумента;
			НеДобавлятьСтроку = Истина;
			
		КонецЕсли;
		
		ИсточникиДанных.Свойство(ИмяИсточника, ТекущаяТаблица);
		Если ТекущаяТаблица=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		РазборСтроки.Удалить(0);
		РазборСтроки.Удалить(РазборСтроки.ВГраница());
		
		Если НеДобавлятьСтроку Тогда
			НоваяСтрока       = ТекущаяТаблица[ТекущаяТаблица.Количество()-1];
			Корректор         = КорректорШапка;
		Иначе
			НоваяСтрока       = ТекущаяТаблица.Добавить();
			//Корректор         = 0;
		
			// ОТСЮДА МОДИФИЦИРОВАТЬ !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
			
			Если ИмяИсточника = ИдентификаторДокумента Тогда 
				СчетчикДокументов = СчетчикДокументов + 1;
			КонецЕсли;
			
			НоваяСтрока[ТекущаяТаблица.Колонки.Получить(0).Имя] = ИдентификаторДокумента + "_" + Строка(СчетчикДокументов);
			Корректор = 1;
			
			Если ТекущаяТаблица.Колонки.Получить(0).Имя = "VTSUM_ID" Тогда       //*-* 
				НоваяСтрока[ТекущаяТаблица.Колонки.Получить(0).Имя] =  "VTSUM" + "_" + Строка(СчетчикДокументов);
			КонецЕсли;
			
			Если ТекущаяТаблица.Колонки.Получить(0).Имя = "VNOST_ID" Тогда       //*-* 
				НоваяСтрока[ТекущаяТаблица.Колонки.Получить(0).Имя] =  "VNOST" + "_" + Строка(СчетчикДокументов);
			КонецЕсли;

			Если ТекущаяТаблица.Колонки.Получить(0).Имя = "VAOA_ID" Тогда       //*-* 
				НоваяСтрока[ТекущаяТаблица.Колонки.Получить(0).Имя] =  "VAOA" + "_" + Строка(СчетчикДокументов);
			КонецЕсли;
			
			Если ТекущаяТаблица.Колонки.Получить(0).Имя = "BI_ID" Тогда       //*-* 
				НоваяСтрока[ТекущаяТаблица.Колонки.Получить(0).Имя] =  "BI" + "_" + Строка(СчетчикДокументов);
			КонецЕсли;
			
			Если ТекущаяТаблица.Колонки.Получить(0).Имя = "VBR_ID" Тогда       //*-* 
				НоваяСтрока[ТекущаяТаблица.Колонки.Получить(0).Имя] =  "VBR" + "_" + Строка(СчетчикДокументов);
			КонецЕсли;
						
			НоваяСтрока[ТекущаяТаблица.Колонки.Получить(1).Имя] = ИмяИсточника;
			Корректор = 2;
		
			// ДОСЮДА МОДИФИЦИРОВАТЬ !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
		КонецЕсли;
		
		Для СчетчикКолонок = 0 По РазборСтроки.ВГраница() Цикл
		
			НоваяСтрока[ТекущаяТаблица.Колонки.Получить(СчетчикКолонок+Корректор).Имя] = РазборСтроки[СчетчикКолонок];	
		
		КонецЦикла;
		
		Корректор = СчетчикКолонок + Корректор;
		
		Если СекцииШапки.Найти(ИмяИсточника) <> Неопределено Тогда
			//если секции шапки разрываются в файле, нужно сохранить счетчик колонок
			КорректорШапка    =  Корректор;

		КонецЕсли;
			
	КонецЦикла; 
	
	Возврат ИсточникиДанных;
	
КонецФункции

Функция ФормированиеТаблицыОснованийДляСокращеннойЗКР(Объект,ИмяТЧ="") Экспорт
	
	ИмяТЧ = НРег(ИмяТЧ);
	
	ТЗ = Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("Основание");
	ТЗ.Колонки.Добавить("Вид");
	ТЗ.Колонки.Добавить("Номер");
	ТЗ.Колонки.Добавить("Дата");
	ТЗ.Колонки.Добавить("ИмяТабЧасти");
	ТЗ.Колонки.Добавить("НомерСтроки");
	ТЗ.Колонки.Добавить("ССЫЛКАДОКУМЕНТА");
	
	Если ЗначениеЗаполнено(Объект.ОснованиеПлатежаВид) ИЛИ ЗначениеЗаполнено(Объект.ОснованиеПлатежаНомер) ИЛИ ЗначениеЗаполнено(Объект.ОснованиеПлатежаДата) Тогда
		
		СтрокаТЗ      		 = ТЗ.Добавить();
		СтрокаТЗ.Основание	 = "1";
		СтрокаТЗ.Вид   		 = Объект.ОснованиеПлатежаВид;
		СтрокаТЗ.Номер		 = Объект.ОснованиеПлатежаНомер;
		СтрокаТЗ.Дата 		 = Объект.ОснованиеПлатежаДата;
		СтрокаТЗ.ИмяТабЧасти = ИмяТЧ;
		СтрокаТЗ.НомерСтроки = ТЗ.Количество();
		СтрокаТЗ.ССЫЛКАДОКУМЕНТА = Объект;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДокументОснованиеВид) ИЛИ ЗначениеЗаполнено(Объект.ДокументОснованиеНомер) ИЛИ ЗначениеЗаполнено(Объект.ДокументОснованиеДата) Тогда
		
		СтрокаТЗ	         = ТЗ.Добавить();
		СтрокаТЗ.Основание	 = "2";
		СтрокаТЗ.Вид  		 = Объект.ДокументОснованиеВид;
		СтрокаТЗ.Номер		 = Объект.ДокументОснованиеНомер;
		СтрокаТЗ.Дата 		 = Объект.ДокументОснованиеДата;
		СтрокаТЗ.ИмяТабЧасти = ИмяТЧ;
		СтрокаТЗ.НомерСтроки = ТЗ.Количество();
		СтрокаТЗ.ССЫЛКАДОКУМЕНТА = Объект;
		
	КонецЕсли;	
	
	Возврат ТЗ;
	
КонецФункции

// Процедура преобразует таблицу значений в формат файла передачи,
// записывает файл передачи в справочник ХранилищеДополнительнойИнформации
Процедура ПодготовитьФайлВыгрузки(Формат = "", Постфикс = "", ДокументСсылка = Неопределено, КодКлиента = "") Экспорт 
	
	ДатаВыгрузки                     = Задание.Дата;
	ИмяФайлаПередачи                 = ПолучитьИмяФайлаПередачи(Формат, Постфикс, ДокументСсылка, КодКлиента);
	Если ТипЗнч(Задание) = Тип("ДокументОбъект.ЗаданиеНаЭкспортДанныхВБанкиКС") Тогда
		Если НЕ ЗначениеЗаполнено(ИмяФайлаПередачи) Тогда
			
			Если НЕ ВсеОбъектыВОдномФайле Тогда
				Если НЕ ЗначениеЗаполнено(Формат) Тогда
					Для Каждого СтрокаОбъект Из ОбъектыВФайл Цикл
						
						СтрокаТЧ                  = Задание.ОбъектыОбмена.Найти(СтрокаОбъект.Объект, "Объект");
						СтрокаТЧ.ИмяФайлаВыгрузки = "!Объект не выгружен! Имя файла не сформировано.";
						
					КонецЦикла;
				Иначе
					Для Каждого СтрокаОбъект Из ОбъектыВФайл Цикл
						
						МассивСтрок 			  = Задание.ОбъектыОбмена.НайтиСтроки(Новый Структура("Объект,Формат",СтрокаОбъект.Объект,СтрокаОбъект.Формат));
						СтрокаТЧ                  = МассивСтрок[0];
						СтрокаТЧ.ИмяФайлаВыгрузки = "!Объект не выгружен! Имя файла не сформировано.";
						
					КонецЦикла;
				КонецЕсли;
			Иначе
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Файлы не сформированы - не удалось определить имя файла передачи!'")); 
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
	Иначе
	КонецЕсли;
	ЕстьФайлДляЗаписи		= Ложь;
	ИмяТемпФайла 			= ПолучитьИмяВременногоФайла();
	
	Попытка
		КодировкаТекстаФайла	= КодировкаТекста[ВидОбмена.КодировкаТекстаФайла]
	Исключение
		КодировкаТекстаФайла    = ВидОбмена.КодировкаТекстаФайла;
	КонецПопытки;
	
	НуженКонечныйРазделитель = Ложь;
	СтрокаТЧ = ВидОбмена.Параметры.Найти("НуженКонечныйРазделитель","Имя");
	Если СтрокаТЧ <> Неопределено Тогда
		Если ВРег(СтрокаТЧ.Значение) = "ИСТИНА" Тогда
			НуженКонечныйРазделитель = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОбмена.ТипФайлаПередачи = Перечисления.ТипыФайловПередачиДляОбмена.TXT Тогда
		
		ТекстФайлаПередачи	= "";
		Текст				= Новый ЗаписьТекста(ИмяТемпФайла, КодировкаТекстаФайла);
		
		Попытка
			
			ТекущийМаркер     = "";
			к                 = 0;
			СтрокаВТекст      = "";
			ЕстьФайлДляЗаписи = Истина;
			
			Если ВидОбмена.ПредставлениеВНомереВерсии = "TX" Тогда
												
				Для каждого Строка Из СхемаДанныхДляФайлаПередачи Цикл
					
					к = к + 1;
										
					ПозМ = Найти(Строка.ПолеФайла, ".");
					
					Если ПозМ > 1 Тогда
						Маркер = Лев(Строка.ПолеФайла, ПозМ - 1);
					КонецЕсли;
					
					Если (ТекущийМаркер <> Маркер) ИЛИ (Строка.НачНовСтр) Тогда
						
						Если к <> 1 Тогда
							Текст.ЗаписатьСтроку(СтрокаВТекст);
						КонецЕсли;
												
						ТекущийМаркер = Маркер;
						СтрокаВТекст  = Маркер + "|";
						
					КонецЕсли;
					
					СтрокаВТекст  = СтрокаВТекст + Строка.Значение+ "|";
					
					Если к = СхемаДанныхДляФайлаПередачи.Количество() Тогда
						
						Текст.ЗаписатьСтроку(СтрокаВТекст);
						
					КонецЕсли;
					
				КонецЦикла;
				
								
			ИначеЕсли ВидОбмена.ПредставлениеВНомереВерсии = "MS" Тогда
				
				СтрокаПробелов = "                                                                                                   ";
				СтрокаПробелов = СтрокаПробелов + СтрокаПробелов + СтрокаПробелов + СтрокаПробелов + СтрокаПробелов;
				
				Для каждого Строка Из СхемаДанныхДляФайлаПередачи Цикл
					
					к = к + 1;
					
					ПозМ = Найти(Строка.ПолеФайла, ".");
					
					Если ПозМ > 1 Тогда
						Маркер = Лев(Строка.ПолеФайла, ПозМ - 1);
					КонецЕсли;
					
					Если (ТекущийМаркер <> Маркер) ИЛИ (Строка.НачНовСтр) Тогда
						
						Если к <>1 Тогда
							Текст.ЗаписатьСтроку(СтрокаВТекст);
						КонецЕсли;
						
						ТекущийМаркер = Маркер;
						СтрокаВТекст  = Маркер;
						
					КонецЕсли;
					
					ДопПробелы    = Лев(СтрокаПробелов, Строка.ДлинаПоля - СтрДлина(Строка.Значение));
					СтрокаВТекст  = СтрокаВТекст + Строка.Значение + ДопПробелы;
					
					Если к = СхемаДанныхДляФайлаПередачи.Количество() Тогда
						
						Текст.ЗаписатьСтроку(СтрокаВТекст);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ВидОбмена.ПредставлениеВНомереВерсии = "KB" Тогда
				
				Текст.ЗаписатьСтроку("1CClientBankExchange");
				
				Для каждого Строка Из СхемаДанныхДляФайлаПередачи Цикл
					
					Если Строка.ПолеФайла = "КонецДокумента" Тогда
						Текст.ЗаписатьСтроку(Строка.ПолеФайла);
					Иначе
						Текст.ЗаписатьСтроку(Строка.ПолеФайла + "=" + Строка(Строка.Значение));
					КонецЕсли;
					
				КонецЦикла;
				
				Текст.ЗаписатьСтроку("КонецФайла");
				
			ИначеЕсли ВидОбмена.ПредставлениеВНомереВерсии = "QR" Тогда
				
				Разделитель = "|";
				
				МассивСтрокКЗаписи = Новый Массив;
				
				Для каждого Строка Из СхемаДанныхДляФайлаПередачи Цикл
					
					МассивСтрокКЗаписи.Добавить(Строка.ПолеФайла + Строка(Строка.Значение));
										
				КонецЦикла;
				
				Текст.Записать(СтрСоединить(МассивСтрокКЗаписи,Разделитель)); //ЗаписатьСтроку добавляет после записи перенос строки
				
			Иначе
				
				Разделитель = ВидОбмена.Разделитель;
				
				МассивСтрокКЗаписи = Новый Массив;
				ЭтоВыгрузкаСтрокиТЧ = Ложь;
				//для новой строки, достаточно в поле Условие указать "*НоваяСтрока"
				Для каждого Строка Из СхемаДанныхДляФайлаПередачи Цикл
									
					Если (Строка.СпецПометка = "НС"
						ИЛИ Строка.НачНовСтр = Истина)	
						И МассивСтрокКЗаписи.Количество() Тогда
						
						Текст.ЗаписатьСтроку(СтрСоединить(МассивСтрокКЗаписи,Разделитель) 
							+ ?(ЭтоВыгрузкаСтрокиТЧ И НуженКонечныйРазделитель,Разделитель,""));
						МассивСтрокКЗаписи = Новый Массив;
						
					КонецЕсли;
					
					Если Строка.НачНовСтр = Истина Тогда
						ЭтоВыгрузкаСтрокиТЧ = Истина;
					ИначеЕсли Строка.СпецПометка = "НС" Тогда
						ЭтоВыгрузкаСтрокиТЧ = Ложь;
					КонецЕсли;
					
					МассивСтрокКЗаписи.Добавить(Строка.ПолеФайла + Строка(Строка.Значение));
										
				КонецЦикла;
				
				Если МассивСтрокКЗаписи.Количество() Тогда
					Текст.ЗаписатьСтроку(СтрСоединить(МассивСтрокКЗаписи,Разделитель));
				КонецЕсли;
				
			КонецЕсли;
			
			Текст.Закрыть();
			
		Исключение
			
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Данный текстовый формат не поддерживается внутренними механизмами системы!'"));
			Возврат;
			
		КонецПопытки;
		
		
	ИначеЕсли ВидОбмена.ТипФайлаПередачи = Перечисления.ТипыФайловПередачиДляОбмена.XML Тогда
		
		
		//URIПространстваИмен   = "";
		//ИмяПространстваИмен   = "";
		//АтрибутПространстваИмен = "";
		//ПервоеПоле            = СхемаДанныхДляФайлаПередачи[0].ПолеФайла;
		//ПервоеПоле            = Сред(ПервоеПоле, Найти(ПервоеПоле, "/") + 1);
		//НазваниеКорневогоУзла = Лев(ПервоеПоле, Найти(ПервоеПоле, "/") - 1);
		//
		//СоответствиеПространствИмен = Новый Соответствие;
		//Если Найти(НазваниеКорневогоУзла,":")>0 Тогда
		//	ИмяПространстваИмен = Лев(НазваниеКорневогоУзла,Найти(НазваниеКорневогоУзла,":")-1);
		//	ПолеФайла = СхемаДанныхДляФайлаПередачи[0].ПолеФайла;
		//	АтрибутПространстваИмен  =  ИмяПоследнегоВПути(ПолеФайла);
		//	Если Лев(АтрибутПространстваИмен, 1) = "@" И Найти(АтрибутПространстваИмен,":"+ИмяПространстваИмен) Тогда
		//		URIПространстваИмен = СхемаДанныхДляФайлаПередачи[0].Значение;
		//		
		//	КонецЕсли;	
		//КонецЕсли;
		//Документ              = Новый ДокументDOM(URIПространстваИмен, НазваниеКорневогоУзла);
		//КорневойЭлемент       = Документ.ПервыйДочерний;
		
		ДокументСоздан = Ложь;
		
		ОбщийФайл = Новый ЗаписьТекста(ИмяТемпФайла, ?(Формат.ФорматСлужебногоКонверта, "windows-1251", ПреобразованиеПредставлениеКодировки(ВидОбмена.КодировкаТекстаФайла)));
		МассивВыгружаемыхДокументов = Новый Массив;
		
		ПредыдущийПуть = "";
		ПредыдущийРодитель = Неопределено;
				
		Для каждого Строка Из СхемаДанныхДляФайлаПередачи Цикл
			
			Если МассивВыгружаемыхДокументов.Найти(Строка.ВыгружаемыйДокумент) = Неопределено Тогда
				МассивВыгружаемыхДокументов.Добавить(Строка.ВыгружаемыйДокумент);
			КонецЕсли;
			
			Если Найти(Строка.ПолеФайла,"/")>0 И НЕ ДокументСоздан Тогда
			    URIПространстваИмен   = "";
				ИмяПространстваИмен   = "";
				АтрибутПространстваИмен = "";
				ПервоеПоле            = Строка.ПолеФайла;
				ПервоеПоле            = Сред(ПервоеПоле, Найти(ПервоеПоле, "/") + 1);
				НазваниеКорневогоУзла = Лев(ПервоеПоле, Найти(ПервоеПоле, "/") - 1);
				
				СоответствиеПространствИмен = Новый Соответствие;
				Если Найти(НазваниеКорневогоУзла,":")>0 Тогда
					ИмяПространстваИмен = Лев(НазваниеКорневогоУзла,Найти(НазваниеКорневогоУзла,":")-1);
					ПолеФайла = Строка.ПолеФайла;
					АтрибутПространстваИмен  =  ИмяПоследнегоВПути(ПолеФайла);
					Если Лев(АтрибутПространстваИмен, 1) = "@" И Найти(АтрибутПространстваИмен,":"+ИмяПространстваИмен) Тогда
						URIПространстваИмен = Строка.Значение;
						
					КонецЕсли;	
				КонецЕсли;
				Документ              = Новый ДокументDOM(URIПространстваИмен, НазваниеКорневогоУзла);
				КорневойЭлемент       = Документ.ПервыйДочерний;
				
				ДокументСоздан = Истина;
				Родитель = КорневойЭлемент;
				
				КонтекстВыполнения = Неопределено;
				
				ТаблицаВыполненияКонтекста = Новый ТаблицаЗначений;
				ТаблицаВыполненияКонтекста.Колонки.Добавить("Путь");
				ТаблицаВыполненияКонтекста.Колонки.Добавить("ПредыдущийКонтекст");
				ТаблицаВыполненияКонтекста.Колонки.Добавить("НовыйКонтекст");
			КонецЕсли;
			
			Если Найти(Строка.ПолеФайла,"/")>0 Тогда
			    //Это блок xml
				
				ПутьРодителя = Строка.ПолеФайла;
				ВидКонтекста = "НЕТ";
				Если Прав(ВРег(ПутьРодителя),17)="[КОНТЕКСТ_НАЧАЛО]" Тогда
					ПутьРодителя = Сред(ПутьРодителя,1,СтрДлина(ПутьРодителя)-17);
					ВидКонтекста = "НОВЫЙ";
				ИначеЕсли Прав(ВРег(ПутьРодителя),16)="[КОНТЕКСТ_КОНЕЦ]" Тогда
					ПутьРодителя = Сред(ПутьРодителя,1,СтрДлина(ПутьРодителя)-16);
					ВидКонтекста = "СБРОСИТЬ";
				ИначеЕсли Найти(ПутьРодителя,".")=0 Тогда
					//это абсолютный путь, а значит все контексты закончились
					ВидКонтекста = "СБРОСИТЬ_ВСЕ";
				КонецЕсли;
				
				Если ВидКонтекста = "НОВЫЙ" Тогда
					
					Если ТаблицаВыполненияКонтекста.Найти(ПутьРодителя,"Путь") = Неопределено Тогда
						//такой путь встречается впервые, запишем данные о предыдущем контексте в таблицу
						СтрокаТаблицыКонтекста = ТаблицаВыполненияКонтекста.Добавить();
						СтрокаТаблицыКонтекста.Путь = ПутьРодителя;
						СтрокаТаблицыКонтекста.ПредыдущийКонтекст = КонтекстВыполнения;
					Иначе
						//Значит это выгрузка таблицы и нужно найти контекст выполнения, 
						//использующийся при выгрузке первой строки таблицы.
						//
						КоличествоСтрок = ТаблицаВыполненияКонтекста.Количество();	
						Для Инд = -КоличествоСтрок+1 по 0 Цикл
							Если ТаблицаВыполненияКонтекста[-Инд].Путь <> ПутьРодителя Тогда
								//Удалим все контексты, которые были добавлены после нужного нам контекста
								ТаблицаВыполненияКонтекста.Удалить(ТаблицаВыполненияКонтекста[-Инд]);
							Иначе
								//Это строка нужного нам контекста, именно с ним должно выполняться вычисление xpath
								СтрокаТаблицыКонтекста = ТаблицаВыполненияКонтекста[-Инд];
								КонтекстВыполнения = СтрокаТаблицыКонтекста.ПредыдущийКонтекст;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				
				ИмяНовогоЭлемента = ИмяПоследнегоВПути(ПутьРодителя);
				
				Значение          = Строка.Значение;
				
				Если Лев(ИмяНовогоЭлемента, 1) = "@" Тогда
					Если ЗначениеЗаполнено(Значение) Тогда
						ЭтоПространствоИмен = НРег(Сред(ИмяНовогоЭлемента, 2, 5)) = "xmlns";
						Если ЭтоПространствоИмен Тогда
							Префикс = ?(НРег(Сред(ИмяНовогоЭлемента, 2)) = "xmlns","xlmns",Сред(ИмяНовогоЭлемента, 8));
							СоответствиеПространствИмен.Вставить(Префикс,Значение);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Родитель          = ПолучитьЭлементРодитель(Документ, ПутьРодителя, СоответствиеПространствИмен,Родитель,КонтекстВыполнения);			
				
				Если Лев(ИмяНовогоЭлемента, 1) = "@" Тогда
					
					Если ИмяНовогоЭлемента = АтрибутПространстваИмен 
						И URIПространстваИмен = Значение Тогда
						Продолжить;
					КонецЕсли;
					Если ЗначениеЗаполнено(Значение) Тогда
						ЭтоПространствоИмен = НРег(Сред(ИмяНовогоЭлемента, 2, 5)) = "xmlns";
						
						Если ЭтоПространствоИмен Тогда
							
							Родитель.УстановитьАтрибут("http://www.w3.org/2000/xmlns/",Сред(ИмяНовогоЭлемента, 2), Значение);
						Иначе
							
							Если Найти(ИмяНовогоЭлемента,":")>0 Тогда
								
								ИмяБезСлужебногоСимвола = Сред( ИмяНовогоЭлемента,2);
								ПозРазделитель          = Найти(ИмяБезСлужебногоСимвола,":");
								Префикс                 = Лев(  ИмяБезСлужебногоСимвола, ПозРазделитель - 1);
								
								URIПоПрефиксу           = СоответствиеПространствИмен.Получить(Префикс);
								URIПоПрефиксу           = ?(ЗначениеЗаполнено(URIПоПрефиксу),URIПоПрефиксу,"");
								
								Если НЕ Родитель.ЕстьАтрибут(  URIПоПрефиксу, Сред(ИмяБезСлужебногоСимвола, ПозРазделитель + 1)) Тогда
									Родитель.УстановитьАтрибут(URIПоПрефиксу, ИмяБезСлужебногоСимвола,      Значение);
								КонецЕсли;	
								
		                    Иначе
								Родитель.УстановитьАтрибут(Сред(ИмяНовогоЭлемента, 2), Значение);
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
					
					Если ВидКонтекста = "НОВЫЙ" Тогда
						СтрокаТаблицыКонтекста.НовыйКонтекст = Родитель;
					КонецЕсли;
				Иначе
										
					Если (Формат.ФорматСлужебногоКонверта) И Найти(Строка.ПолеФайла, "Body") > 0 Тогда    						
						
						ЧтениеXML         = Новый ЧтениеXML; 
						ПостроительDOM    = Новый ПостроительDOM;   
						
						ЧтениеXML.УстановитьСтроку(Значение);
						
						ДокументDOM       = ПостроительDOM.Прочитать(ЧтениеXML); 
						ТекстУзла         = Документ.ИмпортироватьУзел(ДокументDOM.ПервыйДочерний, Истина);
						
					Иначе
						
						ТекстУзла = Документ.СоздатьТекстовыйУзел(Значение);
						
					КонецЕсли;	
														
					Если ПредыдущийРодитель <> Неопределено
						И ПутьРодителя + "/" + ИмяНовогоЭлемента = ПредыдущийПуть Тогда
						//если добавляется новый элемент с пространством имен, 
						//и предыдущая строка была с атрибутом пространства имен для данного элемента,
						//то элемент будет создан в функции ПолучитьЭлементРодитель, когда будет попытка получить родителя,
						//для атрибута с пространством имен
						ПредыдущийРодитель.ДобавитьДочерний(ТекстУзла);
						Родитель = ПредыдущийРодитель;
						
					Иначе
						
						Если Найти(ИмяНовогоЭлемента,":")>0 Тогда
						
							Префикс       = Лев(ИмяНовогоЭлемента,Найти(ИмяНовогоЭлемента,":")-1);
							URIПоПрефиксу = СоответствиеПространствИмен.Получить(Префикс);
							URIПоПрефиксу = ?(ЗначениеЗаполнено(URIПоПрефиксу),URIПоПрефиксу,"");
							
							Узел      = Документ.СоздатьЭлемент(URIПоПрефиксу,ИмяНовогоЭлемента);
							
						Иначе	
							Узел      = Документ.СоздатьЭлемент(ИмяНовогоЭлемента);
						КонецЕсли;
					
						Узел.ДобавитьДочерний(ТекстУзла);
						Родитель.ДобавитьДочерний(Узел);
						Родитель = Узел;
						
					КонецЕсли;
					
					
					Если ВидКонтекста = "НОВЫЙ" Тогда
						СтрокаТаблицыКонтекста.НовыйКонтекст = Узел;
					КонецЕсли;
				КонецЕсли;
				Если ВидКонтекста = "НОВЫЙ" Тогда
					КонтекстВыполнения = СтрокаТаблицыКонтекста.НовыйКонтекст;
				ИначеЕсли ВидКонтекста = "СБРОСИТЬ" Тогда
					КоличествоКонтекстов = ТаблицаВыполненияКонтекста.Количество();
					Если КоличествоКонтекстов >0 Тогда
						КонтекстВыполнения = ТаблицаВыполненияКонтекста[КоличествоКонтекстов-1].ПредыдущийКонтекст;
						ТаблицаВыполненияКонтекста.Удалить(ТаблицаВыполненияКонтекста[КоличествоКонтекстов-1]);
					Иначе
						КонтекстВыполнения = Неопределено;
					КонецЕсли;
				ИначеЕсли ВидКонтекста = "СБРОСИТЬ_ВСЕ" Тогда
					ТаблицаВыполненияКонтекста.Очистить();
					КонтекстВыполнения = Неопределено;
				КонецЕсли;
				
				ПредыдущийПуть = ПутьРодителя;
				ПредыдущийРодитель = Родитель;
			Иначе
				ПредыдущийПуть = "";
				ПредыдущийРодитель = Неопределено;
				
				// это обычный текст, либо что-то еще
				Если ДокументСоздан Тогда
					//запишем и перенесем в общий файл
					ЗаписьХМЛ = Новый ЗаписьXML;
		            ИмяТекФайла = ПолучитьИмяВременногоФайла();
					ЗаписьХМЛ.ОткрытьФайл(ИмяТекФайла, ПреобразованиеПредставлениеКодировки(ВидОбмена.КодировкаТекстаФайла));
					
					ЗаписьDOM = Новый ЗаписьDOM();
					ЗаписьDOM.Записать(Документ, ЗаписьХМЛ);
					
					ЗаписьХМЛ.Закрыть();
					
					Чтение = Новый ЧтениеТекста(ИмяТекФайла, ПреобразованиеПредставлениеКодировки(ВидОбмена.КодировкаТекстаФайла));
					Текст = Чтение.Прочитать();
					Чтение.Закрыть();
					УдалитьФайлы(ИмяТекФайла);
					
					Если ВидОбмена.ПредставлениеВНомереВерсии = "GY" Тогда
			            ГосУслуги.ВыполнитьДействияПослеФормированияФайла(Задание,МассивВыгружаемыхДокументов,Текст);
					КонецЕсли;
					МассивВыгружаемыхДокументов.Очистить();
					
					ОбщийФайл.Записать(Текст);
					//ОбщийФайл.Записать(Символы.ВК+Символы.ПС);
					ДокументСоздан = Ложь;
				КонецЕсли;
				Если ВРег(Строка.ПолеФайла) = ВРег("\Текст") Тогда
					ОбщийФайл.ЗаписатьСтроку(Строка.Значение);
				ИначеЕсли ВРег(Строка.ПолеФайла) = ВРег("\ПрисоединитьФайл") Тогда
					//Тут установить метку для выгрузки
					ОбщийФайл.Закрыть();
					
					ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(Строка.Значение);
					ФайлВBase64 = Base64Строка(ДвоичныеДанныеФайла);
					
					ДвДанные = ЭлектронныйДокументооборотСКонтролирующимиОрганами.СоздатьОбъектДляРаботыСДвоичнымиДанными();
					
					ДвДанные.Прочитать(ИмяТемпФайла);
				    ДвДанные.ТекущаяПозиция = ДвДанные.Размер; 
					ДвДанные.ДобавитьИзСтрокиBase64(ФайлВBase64, Истина);
					ДвДанные.Записать(ИмяТемпФайла);
					
					//Тут вызвать компоненту присоединения 
					ОбщийФайл.Открыть(ИмяТемпФайла,ПреобразованиеПредставлениеКодировки(ВидОбмена.КодировкаТекстаФайла),Символы.ПС,Истина);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		//КорневойЭлемент.УстановитьСоответствиеПространстваИмен("urn:cbr-ru:ed:v2.0");
		Если ДокументСоздан Тогда
			//запишем и перенесем в общий файл
			ЗаписьХМЛ = Новый ЗаписьXML;
            ИмяТекФайла = ПолучитьИмяВременногоФайла();
			ЗаписьХМЛ.ОткрытьФайл(ИмяТекФайла, ?(Формат.ФорматСлужебногоКонверта, "windows-1251", ПреобразованиеПредставлениеКодировки(ВидОбмена.КодировкаТекстаФайла)));
			
			ЗаписьDOM = Новый ЗаписьDOM();
			ЗаписьDOM.Записать(Документ, ЗаписьХМЛ);
			
			ЗаписьХМЛ.Закрыть();
			
			Чтение = Новый ЧтениеТекста(ИмяТекФайла, ПреобразованиеПредставлениеКодировки(ВидОбмена.КодировкаТекстаФайла));
			Текст = Чтение.Прочитать();
			Чтение.Закрыть();
			УдалитьФайлы(ИмяТекФайла);
			
			Если ВидОбмена.ПредставлениеВНомереВерсии = "GY" Тогда
	            ГосУслуги.ВыполнитьДействияПослеФормированияФайла(Задание,МассивВыгружаемыхДокументов,Текст);
			КонецЕсли;
			МассивВыгружаемыхДокументов.Очистить();
			
			ОбщийФайл.Записать(Текст);
		КонецЕсли;
		
		ОбщийФайл.Закрыть();
					
		//ЗаписьХМЛ = Новый ЗаписьXML;
		//
		//ЗаписьХМЛ.ОткрытьФайл(ИмяТемпФайла, ПреобразованиеПредставлениеКодировки(ВидОбмена.КодировкаТекстаФайла));
		//
		//ЗаписьDOM = Новый ЗаписьDOM();
		//ЗаписьDOM.Записать(Документ, ЗаписьХМЛ);
		//
		//ЗаписьХМЛ.Закрыть();
		ЕстьФайлДляЗаписи = Истина;
		
	КонецЕсли;
	
	Если ЕстьФайлДляЗаписи Тогда
		Если ТипЗнч(Задание) = Тип("ДокументОбъект.ЗаданиеНаЭкспортДанныхВБанкиКС") Тогда
			// помещаем созданный файл передачи в хранилище файлов
			
			ДвоичныеДанные 					= Новый ДвоичныеДанные(ИмяТемпФайла);
			АдресФайлаВоВременномХранилище 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			
			РаботаСФайлами.ДобавитьФайл(
			Новый Структура("ВладелецФайлов, ИмяБезРасширения, РасширениеБезТочки, Автор, ВремяИзмененияУниверсальное",  
			Задание.Ссылка, 
			Лев(ИмяФайлаПередачи, Найти(ИмяФайлаПередачи, ".") - 1),
			Сред(ИмяФайлаПередачи, Найти(ИмяФайлаПередачи, ".") + 1), 
			ПользователиКлиентСервер.ТекущийПользователь(),
			УниверсальноеВремя(ТекущаяДатаСеанса())),     
			АдресФайлаВоВременномХранилище);	

			//----------------------------------------------------
			
			Если НЕ ВсеОбъектыВОдномФайле Тогда
				Если ЗначениеЗаполнено(Постфикс) Тогда
					ПозицияТочки = СтрНайти(ИмяФайлаПередачи, ".", НаправлениеПоиска.СКонца);
					Если ПозицияТочки>0 Тогда
						ИмяФайлаПередачи = Сред(ИмяФайлаПередачи,1,ПозицияТочки-1-СтрДлина(Постфикс))+Сред(ИмяФайлаПередачи,ПозицияТочки);
					Иначе
						ИмяФайлаПередачи = Сред(ИмяФайлаПередачи,1,СтрДлина(ИмяФайлаПередачи)-СтрДлина(Постфикс));
					КонецЕсли;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(Формат) Тогда
					Для Каждого СтрокаОбъект Из ОбъектыВФайл Цикл
						
						СтрокаТЧ                  = Задание.ОбъектыОбмена.Найти(СтрокаОбъект.Объект, "Объект");
						СтрокаТЧ.ИмяФайлаВыгрузки = ИмяФайлаПередачи;
						
					КонецЦикла;
				Иначе
					Для Каждого СтрокаОбъект Из ОбъектыВФайл Цикл
						
						Если ЗначениеЗаполнено(СтрокаОбъект.Файл) Тогда
							МассивСтрок = Задание.ОбъектыОбмена.НайтиСтроки(Новый Структура("Файл,   Формат", СтрокаОбъект.Файл,  СтрокаОбъект.Формат ));
						Иначе
							МассивСтрок = Задание.ОбъектыОбмена.НайтиСтроки(Новый Структура("Объект, Формат", СтрокаОбъект.Объект, СтрокаОбъект.Формат )); 
						КонецЕсли;
						
						СтрокаТЧ                  = МассивСтрок[0];
						СтрокаТЧ.ИмяФайлаВыгрузки = ИмяФайлаПередачи;
						
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Задание) = Тип("Структура") Тогда
			
			Попытка
				Кодировка = КодировкаТекста[Задание.ВидОбмена.КодировкаТекстаФайла];
			Исключение
				Кодировка = Задание.ВидОбмена.КодировкаТекстаФайла;
			КонецПопытки;   
			
			ЧтениеТекста     = Новый ЧтениеТекста(ИмяТемпФайла,Кодировка);
			СодержаниеТекста = ЧтениеТекста.Прочитать();
			
			Если Задание.Свойство("РезультатФормирования") Тогда   
				
				Задание.РезультатФормирования.Вставить(ИмяФайлаПередачи,СодержаниеТекста);   
				
				Для Каждого СтрокаОбъект Из ОбъектыВФайл Цикл 
					
					Отбор    = Новый Структура("Объект, Формат", СтрокаОбъект.Объект, СтрокаОбъект.Формат); 						
					СтрокиТЧ = Задание.ОбъектыОбмена.НайтиСтроки(Отбор);  
					
					Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
						СтрокаТЧ.ИмяФайлаВыгрузки = ИмяФайлаПередачи;
					КонецЦикла;	
					
				КонецЦикла;
				
				//Задание.РезультатФормирования = СодержаниеТекста;
			Иначе
				Для Каждого СтрокаОбъект Из ОбъектыВФайл Цикл     
					
					Отбор    = Новый Структура("Объект, Формат", СтрокаОбъект.Объект, СтрокаОбъект.Формат); 	
					СтрокиТЧ = Задание.ОбъектыОбмена.НайтиСтроки(Отбор); 
					
					Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
						СтрокаТЧ.РезультатФормирования = СодержаниеТекста;
					КонецЦикла;	    
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьКоллекциюПравилОбменаПоСхеме(Формат, ВыбранныйДокумент, СписокПравилТекФормата, ЗаданиеСсылка = Неопределено, ДопПараметры, Отказ) Экспорт
	//ФормироватьПоОдномуДокументу = Формат.ИспользоватьСтарыйМеханизм;
	
	//Если НЕ ФормироватьПоОдномуДокументу Тогда
		Если СоответствиеОбработанныхФорматов = Неопределено Тогда
			СоответствиеОбработанныхФорматов = Новый Соответствие;
		КонецЕсли;
		РезультатВыполнения = СоответствиеОбработанныхФорматов.Получить(Формат);
		Если РезультатВыполнения <> Неопределено Тогда
			Возврат РезультатВыполнения;
		КонецЕсли;
	//КонецЕсли;
		
	ЗначениеДокументаДляЗапроса     = ВыбранныйДокумент;	
	
	КоллекцияЗначенийФорматирования = Новый ТаблицаЗначений;
	СхемаКомпоновки                 = Формат.СхемаФорматирования.Получить();
	
	Параметр                        = СхемаКомпоновки.Параметры.Найти("ссылка");
	НужнаПустаяСсылка               = Ложь;
	
	Если Параметр <> Неопределено Тогда
		//Если ФормироватьПоОдномуДокументу Тогда
		//	Параметр.Значение = ВыбранныйДокумент;
		//Иначе
		МассивЗначения = Новый Массив;
		
		МассивСтрок = Задание.ОбъектыОбмена.НайтиСтроки(Новый Структура("Формат", Формат));
		Для Каждого ЭлементМассива Из МассивСтрок Цикл
			Если ЗначениеЗаполнено(ЭлементМассива.Объект) Тогда	
				МассивЗначения.Добавить(ЭлементМассива.Объект);
			Иначе
				НужнаПустаяСсылка = Истина;
			КонецЕсли;
		КонецЦикла;
				
		Параметр.Значение           = МассивЗначения;
		ЗначениеДокументаДляЗапроса = МассивЗначения;
		
	КонецЕсли;
	
	Параметр = СхемаКомпоновки.Параметры.Найти("НужнаПустаяСсылка");
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = НужнаПустаяСсылка;
		//ПустаяСсылкаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Формат,"ИдентификаторОбъекта.ЗначениеПустойСсылки");
		//Если ТипЗнч(ЗначениеДокументаДляЗапроса) = Тип("Массив") Тогда
		//	Если ЗначениеДокументаДляЗапроса.Найти(ПустаяСсылкаДокумента)<>Неопределено Тогда
		//		Параметр.Значение = Истина;
		//	КонецЕсли;
		//ИначеЕсли ЗначениеДокументаДляЗапроса = ПустаяСсылкаДокумента Тогда
		//	Параметр.Значение = Истина;
		//КонецЕсли;
	КонецЕсли;
	
	Параметр = СхемаКомпоновки.Параметры.Найти("НастройкаОбмена");
	Если Параметр <> Неопределено И ЗначениеЗаполнено(ЗаданиеСсылка) Тогда
		Параметр.Значение = Задание.НастройкаОбмена;
	КонецЕсли;
	
	Параметр = СхемаКомпоновки.Параметры.Найти("ИдентификаторСообщения");
	Если Параметр <> Неопределено Тогда
		Если ЭтотОбъект.ИдентификаторСообщения = Неопределено Тогда
			ЭтотОбъект.ИдентификаторСообщения = БиблиотекаФункцийОбмена.ПолучитьUUIDТекущегоВремени();
		КонецЕсли;
		Параметр.Значение = ЭтотОбъект.ИдентификаторСообщения;
	КонецЕсли;
	
	Параметр = СхемаКомпоновки.Параметры.Найти("Организация");
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = ЭтотОбъект.мОрганизация;
	КонецЕсли;
	
	Параметр = СхемаКомпоновки.Параметры.Найти("ОбменСЭмулятором");
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = ЭтотОбъект.ОбменСЭмулятором;
	КонецЕсли;
	
	Параметр = СхемаКомпоновки.Параметры.Найти("ТестовыйОбмен");
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = ЭтотОбъект.ТестовыйОбмен;
	КонецЕсли;
	
	Параметр = СхемаКомпоновки.Параметры.Найти("Задание");
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = ЗаданиеСсылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДопПараметры) Тогда
		Для Каждого ДопПараметр Из ДопПараметры Цикл
			Параметр = СхемаКомпоновки.Параметры.Найти(СокрЛП(ДопПараметр.Имя));
			Если Параметр <> Неопределено Тогда
				Параметр.Значение = ДопПараметр.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметрыЭкспорта) = Тип("Структура") Тогда
		Для Каждого ДопПараметр Из ДополнительныеПараметрыЭкспорта Цикл
			Параметр = СхемаКомпоновки.Параметры.Найти(СокрЛП(ДопПараметр.Ключ));
			Если Параметр <> Неопределено Тогда
				Параметр.Значение = ДопПараметр.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Параметр = СхемаКомпоновки.Параметры.Найти("ТаблицаОбъектовОбмена");
	Если Параметр <> Неопределено И ЗначениеЗаполнено(ЗаданиеСсылка) Тогда
		Если ТипЗнч(Задание.ОбъектыОбмена) = Тип("ТаблицаЗначений") Тогда
			Параметр.Значение = Задание.ОбъектыОбмена;
		Иначе
			Попытка
				Параметр.Значение = Задание.ОбъектыОбмена.Выгрузить();
			Исключение
				Параметр.Значение = Новый ТаблицаЗначений;
			КонецПопытки;
		КонецЕсли;
	Иначе
		Параметр.Значение = Новый ТаблицаЗначений;
	КонецЕсли;
	
	Параметр 				= СхемаКомпоновки.Параметры.Найти("ОбрабатываемыйФормат");
	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение	= ОбрабатываемыйФормат;
	КонецЕсли;     
	
	Параметр 				= СхемаКомпоновки.Параметры.Найти("Файл");
	
	Если Параметр <> Неопределено Тогда
		Параметр.Значение	= Файл;
	КонецЕсли;
	
	Параметр 				= СхемаКомпоновки.Параметры.Найти("валютареглучета");
	
	Если Параметр<>Неопределено Тогда
		Параметр.Значение 	= ВалютаРеглУчета;
	КонецЕсли;
	
	Параметр = СхемаКомпоновки.Параметры.Найти("ПарольНастройкиОбмена");
	Если Параметр <> Неопределено И ЗначениеЗаполнено(ЗаданиеСсылка) Тогда
		Если Задание.НастройкаОбмена.СпособОбмена = Перечисления.СпособыВыгрузкиФайловПередачи.FTP
			Или Задание.НастройкаОбмена.СпособОбмена = Перечисления.СпособыВыгрузкиФайловПередачи.WebСервис Тогда
			УстановитьПривилегированныйРежим(Истина);
			Параметр.Значение = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Задание.НастройкаОбмена);
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ВнешниеНаборыДанных 	= Новый Структура;
	ПроцедураФормирования 	= "";
	МассивОбработанныхТЧ 	= Новый Массив;
	
	Если ТипЗнч(ЗначениеДокументаДляЗапроса) = Тип("Массив") Тогда   // сквозная нумерация для БО
		
		НомерПП151н         = Новый ТаблицаЗначений;
		НомерПП151н.Колонки.Добавить("Документ");
		НомерПП151н.Колонки.Добавить("НомерПП");
		
		Для Каждого Документ Из ЗначениеДокументаДляЗапроса Цикл
			СтрокаНомера          = НомерПП151н.Добавить();
			СтрокаНомера.Документ = Документ;
			СтрокаНомера.НомерПП  = 0;
		КонецЦикла;
		
	Иначе	
		НомерПП151н         = 0;
	КонецЕсли;
	
	Для Каждого СтрокаСписка Из СписокПравилТекФормата Цикл
		
		Условие = СокрЛП(СтрокаСписка.Условие);
		Длина 	= СтрДлина(Условие);
		
		Если НЕ ЗначениеЗаполнено(СтрокаСписка.ТабличнаяЧасть) 
			ИЛИ Лев(НРег(Условие), 12) = "*тчдокумента"
			ИЛИ Лев(Условие,5) = "/*?*/"
			ИЛИ Лев(Условие,6) = "/*??*/"
			ИЛИ Длина = 0
			ИЛИ МассивОбработанныхТЧ.Найти(СтрокаСписка.ТабличнаяЧасть) <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ТекстФункции = СтрЗаменить(НРег(Условие),"объект", "ВыбранныйДокумент");
		
		//Попытка
			
			БлокТекстаДоСкобки = НРег(Лев(ТекстФункции,Найти(ТекстФункции,"(")-1));
			
			Если БлокТекстаДоСкобки = НРег("ФормированиеТаблицыОснованийДляСокращеннойЗКР") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ФормированиеТаблицыОснованийДляСокращеннойЗКР(ЗначениеДокументаДляЗапроса,СтрокаСписка.ТабличнаяЧасть);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаИсполненияЗавершенногоДоговора") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаИсполненияЗавершенногоДоговора(ЗначениеДокументаДляЗапроса);		
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаРасшифровкиОбязательства") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиОбязательства(ЗначениеДокументаДляЗапроса,СтрокаСписка.ТабличнаяЧасть,Истина);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаРасшифровкиОбязательстваБезФАИП") Тогда
	            ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиОбязательства151н(ЗначениеДокументаДляЗапроса, НомерПП151н, Ложь, "");
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаРасшифровкиОбязательстваПоФАИП") Тогда
	            ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиОбязательства151н(ЗначениеДокументаДляЗапроса, НомерПП151н, Истина, "");	
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаРасшифровкиОбязательстваБезФАИП2016") Тогда
	            ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиОбязательства151н(ЗначениеДокументаДляЗапроса, НомерПП151н, Ложь, "0506101");
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаРасшифровкиОбязательстваПоФАИП2016") Тогда
	            ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиОбязательства151н(ЗначениеДокументаДляЗапроса, НомерПП151н, Истина, "0506101");		
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаРасшифровкиОбязательстваПоФАИП2016Детально") Тогда
	            ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиОбязательства151н(ЗначениеДокументаДляЗапроса, НомерПП151н, Истина, "0506101", Истина);		
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаРасшифровкиПодтвержденияДО") Тогда
	            ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиПодтвержденияДО(ЗначениеДокументаДляЗапроса);	
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаКодовЗаявленияРасходы") Тогда
	            ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаКодовЗаявления(ЗначениеДокументаДляЗапроса, Перечисления.ВидыКБК.КРБ, "РАСХОДЫ");
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаКодовЗаявленияДоходы") Тогда
	            ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаКодовЗаявления(ЗначениеДокументаДляЗапроса, Перечисления.ВидыКБК.КДБ, "ДОХОДЫ");
	        ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаКодовЗаявленияИсточники") Тогда
	            ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаКодовЗаявления(ЗначениеДокументаДляЗапроса, Перечисления.ВидыКБК.КИФ, "ИСТОЧНИКИ");
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаРасшифровкиПлатежаЗаявкиДляОбеспеченияНД") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиПлатежаЗаявкиДляОбеспеченияНД(ЗначениеДокументаДляЗапроса);	
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаДанныхКонтрактаБюджет") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта("Бюджет", ЗначениеДокументаДляЗапроса);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаДанныхКонтрактаБюджет_2025") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта_2025("Бюджет", ЗначениеДокументаДляЗапроса);	
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаДанныхКонтрактаБюджет_1Г_2025") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта_1Г_2025(ЗначениеДокументаДляЗапроса);		
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаДанныхКонтрактаБюджет_07_2025") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта_07_2025("Бюджет", ЗначениеДокументаДляЗапроса);		
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаДанныхКонтрактаВнебюджет") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта("Внебюджет", ЗначениеДокументаДляЗапроса);
            ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаДанныхКонтрактаВнебюджет_2025") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта_2025("Внебюджет", ЗначениеДокументаДляЗапроса); 
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаДанныхКонтрактаВнебюджет_2026") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта_2026("Внебюджет", ЗначениеДокументаДляЗапроса);	
            ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаДанныхКонтрактаПоПредметам") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтрактаПоПредметам(ЗначениеДокументаДляЗапроса); 
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаДанныхКонтрактаПоПредметам_2026") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтрактаПоПредметам_2026(ЗначениеДокументаДляЗапроса);	
            ИначеЕсли БлокТекстаДоСкобки = НРег("ТоварыИсполненияГК") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТоварыИсполненияГК(ЗначениеДокументаДляЗапроса);  
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТоварыИсполненияГК_2026") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТоварыИсполненияГК_2026(ЗначениеДокументаДляЗапроса);	
            ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаДанныхКонтрактаПоКонтрагентам") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтрактаПоКонтрагентам(ЗначениеДокументаДляЗапроса);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаДанныхКонтрактаПоКонтрагентам_2025") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтрактаПоКонтрагентам_2025(ЗначениеДокументаДляЗапроса);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаКонтрагентовОбязательства") Тогда
	            ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаКонтрагентовОбязательства(ЗначениеДокументаДляЗапроса, "");
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаКонтрагентовОбязательства2016") Тогда
	            ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаКонтрагентовОбязательства(ЗначениеДокументаДляЗапроса, "0506101");
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаКонтрагентовСоглашения") Тогда
	            ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаКонтрагентовСоглашения(ЗначениеДокументаДляЗапроса);	
			ИначеЕсли БлокТекстаДоСкобки = НРег("ПолучитьПереченьГосУслугДляЭкспорта") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ПолучитьПереченьГосУслугДляЭкспорта(ЗначениеДокументаДляЗапроса, Задание.Ссылка);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ПолучитьПереченьГосУслугДляЭкспортаКаталога") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ПолучитьПереченьГосУслугДляЭкспортаКаталога(ЗначениеДокументаДляЗапроса);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ПолучитьТаблицуПараметровПодписок") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ПолучитьТаблицуПараметровПодписок(ЗначениеДокументаДляЗапроса);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ПолучитьТаблицуДополнительныхДанных") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ПолучитьТаблицуДополнительныхДанных(ЗначениеДокументаДляЗапроса);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ПолучитьТаблицуПакетаНачислений") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ПолучитьТаблицуПакетаНачислений(ЗначениеДокументаДляЗапроса);
			ИначеЕсли БлокТекстаДоСкобки = НРег("УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица(ЗначениеДокументаДляЗапроса);
			ИначеЕсли БлокТекстаДоСкобки = НРег("УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица140н") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица140н(ЗначениеДокументаДляЗапроса);	
			ИначеЕсли БлокТекстаДоСкобки = НРег("УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица226н") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица226н(ЗначениеДокументаДляЗапроса);
			ИначеЕсли БлокТекстаДоСкобки = НРег("УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица226нИтоги") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица226нИтоги(ЗначениеДокументаДляЗапроса);
			ИначеЕсли БлокТекстаДоСкобки = НРег("УниверсальныйРегламентированныйОтчетТаблица0501015") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.УниверсальныйРегламентированныйОтчетТаблица0501015(ЗначениеДокументаДляЗапроса);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаСредствБюджетаДляГК") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаСредствБюджетаДляГК(ЗначениеДокументаДляЗапроса, СтрокаСписка.ТабличнаяЧасть,Истина);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаСредствВнебюджетаДляГК") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаСредствВнебюджетаДляГК(ЗначениеДокументаДляЗапроса, СтрокаСписка.ТабличнаяЧасть,Истина);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаСредствПредметКонтракта") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаСредствПредметКонтракта(ЗначениеДокументаДляЗапроса,СтрокаСписка.ТабличнаяЧасть,Истина);
			ИначеЕсли Лев(БлокТекстаДоСкобки, 33) = НРег("ТаблицаРасшифровкиРаспоряженияМИР") Тогда
				ИспользоватьКЭК              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кэк")              > 0, Истина, Ложь);
				ИспользоватьДопКл            = ?(Найти(Нрег(БлокТекстаДоСкобки), "допкл")            > 0, Истина, Ложь);
				ИспользоватьКодМероприятия   = ?(Найти(Нрег(БлокТекстаДоСкобки), "кодмероприятия")   > 0, Истина, Ложь);
				ИспользоватьКФО              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кфо")              > 0, Истина, Ложь);
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиРаспоряженияМИР(ЗначениеДокументаДляЗапроса, ИспользоватьДопКл, 
				                                                                     ИспользоватьКодМероприятия, ИспользоватьКЭК, ИспользоватьКФО);
			ИначеЕсли Лев(БлокТекстаДоСкобки, 41) = НРег("ТаблицаИтоговРаспоряженияМИРСдетализацией") Тогда 
				ИспользоватьДопКл            = ?(Найти(Нрег(БлокТекстаДоСкобки), "допкл")            > 0, Истина, Ложь);
				ИспользоватьКодМероприятия   = ?(Найти(Нрег(БлокТекстаДоСкобки), "кодмероприятия")   > 0, Истина, Ложь);
				ИспользоватьКФО              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кфо")              > 0, Истина, Ложь);
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаИтоговРаспоряженияМИРСдетализацией(ЗначениеДокументаДляЗапроса, ИспользоватьДопКл, 
				                                                                             ИспользоватьКодМероприятия, ИспользоватьКФО);
			ИначеЕсли Лев(БлокТекстаДоСкобки, 28) = НРег("ТаблицаИтоговРаспоряженияМИР") Тогда
				ИспользоватьКЭК              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кэк")              > 0, Истина, Ложь);
				ИспользоватьДопКл            = ?(Найти(Нрег(БлокТекстаДоСкобки), "допкл")            > 0, Истина, Ложь);
				ИспользоватьКодМероприятия   = ?(Найти(Нрег(БлокТекстаДоСкобки), "кодмероприятия")   > 0, Истина, Ложь);
				ИспользоватьКФО              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кфо")              > 0, Истина, Ложь);
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаИтоговРаспоряженияМИР(ЗначениеДокументаДляЗапроса, ИспользоватьДопКл, 
				                                                                     ИспользоватьКодМероприятия, ИспользоватьКЭК, ИспользоватьКФО);	
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаИсточниковСредствВР") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаИсточниковСредствВР(ЗначениеДокументаДляЗапроса);	
			ИначеЕсли Лев(БлокТекстаДоСкобки, 28) = НРег("ТаблицаТЧПлатежногоДокумента") Тогда
				ИспользоватьКЭК              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кэк")              > 0, Истина, Ложь);
				ИспользоватьДопКл            = ?(Найти(Нрег(БлокТекстаДоСкобки), "допкл")            > 0, Истина, Ложь);
				ИспользоватьКодМероприятия   = ?(Найти(Нрег(БлокТекстаДоСкобки), "кодмероприятия")   > 0, Истина, Ложь);
				ИспользоватьАналитическийКод = ?(Найти(Нрег(БлокТекстаДоСкобки), "аналитическийкод") > 0, Истина, Ложь);
				ИспользоватьКФО              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кфо")              > 0, Истина, Ложь);
				ИспользоватьКОСГУПолучателя  = ?(Найти(Нрег(БлокТекстаДоСкобки), "косгуполучателя")  > 0, Истина, Ложь);
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаТЧПлатежногоДокумента(ЗначениеДокументаДляЗапроса, СтрокаСписка.ТабличнаяЧасть, ИспользоватьДопКл, 
				                                                 ИспользоватьКодМероприятия, ИспользоватьКЭК, ИспользоватьАналитическийКод, ИспользоватьКФО, ИспользоватьКОСГУПолучателя);			
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаСведенийОбИмуществе") Тогда
				ТабЧасть = РеестрИмуществаСервер.ТаблицаСведенийОбИмуществе(ЗначениеДокументаДляЗапроса, СтрокаСписка.ТабличнаяЧасть, СтрокаСписка.Условие);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаФайловИмущества") Тогда
				ТабЧасть = РеестрИмуществаСервер.ТаблицаФайлов(ЗначениеДокументаДляЗапроса, СтрокаСписка.ТабличнаяЧасть, СтрокаСписка.Условие);				
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаРеквизитовПодтверждающихДокументов") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРеквизитовПодтверждающихДокументов(ЗначениеДокументаДляЗапроса);	
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаДокументовОснований") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДокументовОснований(ЗначениеДокументаДляЗапроса);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаИдентификаторовПолученныхСообщений") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаИдентификаторовПолученныхСообщений(МассивИдентификаторовСообщений);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаОтбораПоУчастникам") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаОтбораПоУчастникам(МассивОтбораПоУчастникам);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаОтбораПоКБК") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаОтбораПоКБК(МассивОтбораПоКБК);
			ИначеЕсли БлокТекстаДоСкобки = НРег("ТаблицаОтбораПоИдентификаторам") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаОтбораПоИдентификаторам(МассивОтбораПоИдентификаторам);	
			ИначеЕсли НРег(БлокТекстаДоСкобки) = НРег("ТаблицаБухПроводокИсходящегоИзвещенияГИИСЭБ") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаБухПроводокИсходящегоИзвещенияГИИСЭБ(ЗначениеДокументаДляЗапроса);
			ИначеЕсли НРег(БлокТекстаДоСкобки) = НРег("ТаблицаБухОборотовИсходящегоИзвещенияГИИСЭБ") Тогда
				ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаБухОборотовИсходящегоИзвещенияГИИСЭБ(ЗначениеДокументаДляЗапроса);	
			Иначе
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку("Незарегистрированная функция [БлокТекстаДоСкобки]", 
																						Новый Структура("БлокТекстаДоСкобки", БлокТекстаДоСкобки));	
			КонецЕсли; 

		//Исключение
		//	
		//	ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось сформировать табличную часть по установленной внешней функции.'"));
		//	Отказ = Истина;
		//	Возврат КоллекцияЗначенийФорматирования;
		//	
		//КонецПопытки;

		МассивОбработанныхТЧ.Добавить(СтрокаСписка.ТабличнаяЧасть);
		ВнешниеНаборыДанных.Вставить(ВРег(СтрокаСписка.ТабличнаяЧасть), ТабЧасть);
		
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;     //ОбщегоНазначения.ЗначениеВСтрокуXML(СхемаКомпоновки);
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
												  СхемаКомпоновки.НастройкиПоУмолчанию,
												  ,
												  ,
												  Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"),
												  Ложь); 
	ПроцессорКомпоновкиДанных       = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных ,,Истина); 
	ПроцессорВывода                 = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	КоллекцияЗначенийФорматирования = Новый ДеревоЗначений;
	ПроцессорВывода.УстановитьОбъект(КоллекцияЗначенийФорматирования);
	КоллекцияЗначенийФорматирования = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
	
	//Если НЕ ФормироватьПоОдномуДокументу Тогда
		СоответствиеОбработанныхФорматов.Вставить(Формат, КоллекцияЗначенийФорматирования);
	//КонецЕсли;
	
	Возврат КоллекцияЗначенийФорматирования;

КонецФункции // ПолучитьКоллекциюПравилОбменаПоСхеме()

Процедура ПроверитьНаОшибки(Значение, Правило, ОписаниеОбъекта)
	
	Ошибка                        = "";
 
    Если ЗначениеЗаполнено(Значение) Тогда
        
        Описание                  = "";
        ЕстьНовыеОшибки           = Справочники.ТипыДанныхОбменаБанкиКС.СоответствуетТипуДанных(Правило.ТипПоляФайлаПередачи, Значение, Правило.ОграничениеРазмерности, Описание);
                
        Если ЗначениеЗаполнено(Описание) Тогда
            Ошибка   = ?(ЕстьНовыеОшибки, "!!! ", "") + "Поле <<" + Правило.ПолеФайлаПередачи + ">> :" + Описание;
        КонецЕсли;
        
    Иначе
        
        Если (Правило.ОбязательностьЗаполнения) Тогда
            Ошибка                = "!!! Обязательное поле <<" + Правило.ПолеФайлаПередачи + ">> не заполнено";
        КонецЕсли;
        
    КонецЕсли;
                
    Если ЗначениеЗаполнено(Ошибка) Тогда
        
        СтрокаОписания             = ОписаниеОбъекта.Добавить();
        
        СтрокаОписания.ПолеФайла   = Правило.ОписаниеПоляФайлаПередачи; 
        СтрокаОписания.Ошибка      = Ошибка;  
        
	КонецЕсли;
	
КонецПроцедуры

//Функция ОчиститьЗаданиеВФормате(Формат)
//	
//	Отказ       = Ложь;
//	НомераСтрок = Новый Массив;
//	
//	Для каждого Строка Из Формат.ПравилаОбмена Цикл
//		
//		Если СтрНайти(Нрег(Строка.ПолеОбъекта), "задание") > 0 ИЛИ
//			 СтрНайти(Нрег(Строка.ПорядокЗаполнения), "задание") > 0  Тогда
//			 НомераСтрок.Добавить(Строка.НомерСтроки);
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Если НомераСтрок.Количество() = 0 Тогда  //в формате не задействовано Задание
//		Возврат Формат;
//	КонецЕсли;
//	
//	ФорматОбъект = Формат.ПолучитьОбъект();	
//	
//	Для каждого Номер Из НомераСтрок Цикл
//		
//		ФорматОбъект.ПравилаОбмена[Номер - 1].ПолеОбъекта                 = "";
//		ФорматОбъект.ПравилаОбмена[Номер - 1].ПорядокЗаполнения           = "Значение";
//		ФорматОбъект.ПравилаОбмена[Номер - 1].ОбязательностьЗаполнения    = Ложь;
//		
//	КонецЦикла;
//	
//	Справочники.ФорматыОбменаБанкиКС.СформироватьСхемуФормированияОбмена_Новый(ФорматОбъект, Отказ);
//	
//	Возврат  ФорматОбъект;
//	
//КонецФункции

Процедура ПроверитьОбъект(ДокументОбъект, Формат, Ошибки = "") Экспорт
	
	Отказ                          = Ложь;
	
	Объект                         = ДокументОбъект;
    ОбрабатываемыйФормат           = Формат;
    ВидОбмена                      = Формат.Владелец;
	
	ОписаниеОбъекта                = Новый ТаблицаЗначений;
    ОписаниеОбъекта.Колонки.Добавить("ПолеФайла", ,  "Поле файла передачи");
    ОписаниеОбъекта.Колонки.Добавить("Ошибка",    ,  "Ошибка заполнения поля файла передачи"); 
	
	РазрешенныеМодули              = ПолучитьРазрешенныеМодули();
	МассивВызововОбщихМодулей      = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьВызовыОбщихМодулей(Истина);
    ДеревоЗначений                 = Неопределено;
	ПереченьМодулей                = "";
	
	Если НЕ ПроверитьСхему(Формат, РазрешенныеМодули, МассивВызововОбщихМодулей, ПереченьМодулей) Тогда
		
		СтрокаОписания             = ОписаниеОбъекта.Добавить();
        
        СтрокаОписания.ПолеФайла   = Формат.КраткоеНаименование; 
        СтрокаОписания.Ошибка      = "НЕДОПУСТИМЫЙ ФОРМАТ";  
		
		Возврат;
	КонецЕсли;
	
	МассивФорматов                 = Новый Массив;
    МассивФорматов.Добавить(Формат);
	
	ТаблицаПравилОбменаФорматов    = ПолучитьПравилаОбменаФорматов(МассивФорматов, Истина);
	
	СтруктураДляФормирования       = Новый Структура("КассовыйОрган");
	СтруктураДляФормирования.Вставить("Дата", ТекущаяДатаСеанса());
	СтруктураДляФормирования.Вставить("ВидОбмена", Формат.Владелец);
	СтруктураДляФормирования.Вставить("НастройкаОбмена");
	СтруктураДляФормирования.Вставить("Организация");
	СтруктураДляФормирования.Вставить("Ссылка",Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяСсылка());
	
	ТекОбъектыОбмена               = Новый ТаблицаЗначений;
	ТекОбъектыОбмена.Колонки.Добавить("Объект");
	ТекОбъектыОбмена.Колонки.Добавить("Формат");
	
	НовСтр                         = ТекОбъектыОбмена.Добавить();
	НовСтр.Объект                  = ДокументОбъект;
	НовСтр.Формат                  = Формат;
		
	СтруктураДляФормирования.Вставить("ОбъектыОбмена", ТекОбъектыОбмена);
	
	Задание                        = СтруктураДляФормирования;
		
    СписокПравилТекФормата         = ТаблицаПравилОбменаФорматов.НайтиСтроки(Новый Структура("Формат", Формат));
    ДеревоЗначений                 = ПолучитьКоллекциюПравилОбменаПоСхеме(Формат, ДокументОбъект, СписокПравилТекФормата, Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяСсылка(), , Отказ);
        
    СтрокаДанныхДокумента          = ДеревоЗначений.Строки.Найти(ДокументОбъект, "ССЫЛКАДОКУМЕНТА");
    КоллекцияЗначений              = СтрокаДанныхДокумента.Строки;
		
	Попытка
        СтрокаДанныхШапки = КоллекцияЗначений[0];
    Исключение
        СтрокаДанныхШапки = Неопределено;
	КонецПопытки;
	
	НеобрабатываемаяСекция = "";
	
	Для Каждого Колонка Из ДеревоЗначений.Колонки Цикл
		
		Если СтрНайти(Колонка.Имя, "СлужебноеПоле") = 0 Тогда
			Продолжить;
		КонецЕсли;    
		
		Если СтрНайти(Колонка.Имя, "Условие") <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерПравила                  = Число(Сред(Колонка.Имя, СтрНайти(Колонка.Имя, "_", НаправлениеПоиска.СКонца) + 1)); 
		Правило                       = СписокПравилТекФормата[НомерПравила - 1];
		Значение                      = СтрокаДанныхШапки[Колонка.Имя];   
		
		Если Формат.Владелец.ПредставлениеВНомереВерсии = "TX" Тогда
			Если ЗначениеЗаполнено(Правило.Условие) Тогда  //условие каждый раз определяет порядок обработки 
				 НеобрабатываемаяСекция = "";
			КонецЕсли;  
			
			Если Найти(Правило.ПолеФайлаПередачи, ".") > 0 Тогда
				Если Лев(Правило.ПолеФайлаПередачи, Найти(Правило.ПолеФайлаПередачи, ".")-1) = НеобрабатываемаяСекция Тогда
					 Продолжить;
				КонецЕсли;
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(Правило.Условие) Тогда  
				 ИмяКолонкиУсловия = Лев(Колонка.Имя, Найти(Колонка.Имя, "_")) + "Условие_" + Прав(Колонка.Имя, СтрДлина(Колонка.Имя) - Найти(Колонка.Имя, "_"));
				 Если  ДеревоЗначений.Колонки.Найти(ИмяКолонкиУсловия) <> Неопределено Тогда
					 Если НЕ(СтрокаДанныхШапки[ИмяКолонкиУсловия]) Тогда
						  НеобрабатываемаяСекция = Лев(Правило.ПолеФайлаПередачи, Найти(Правило.ПолеФайлаПередачи, ".")-1);   
						  Продолжить;
					 КонецЕсли;	 
				 КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		 
		Если СтрНайти(Нрег(Правило.ПолеОбъекта), "задание") > 0 ИЛИ 
				СтрНайти(Нрег(Правило.ПолеОбъекта), "обрабатываемыйформат")  > 0 ИЛИ
				   СтрНайти(Колонка.Имя, "СообщениеПриОшибкеВалидности") > 0 Тогда
				Продолжить;
		КонецЕсли;
								 
		Если ЗначениеЗаполнено(Правило.ТабличнаяЧасть) Тогда
			 ИмяТЧ            = Правило.ТабличнаяЧасть;
	         ОтборТабЧасть    = Новый Структура("ИмяТабЧасти", ВРег(ИмяТЧ));
	         ТаблицаТаблЧасти = КоллекцияЗначений.НайтиСтроки(ОтборТабЧасть);
			 
			 Для н = 0 По ТаблицаТаблЧасти.Количество() - 1 Цикл
				 
				 Значение     = ТаблицаТаблЧасти[н]["СлужебноеПоле_" + Правило.НомерСтроки];
				 
				 Если (СтрНайти(Колонка.Имя, "ПроверкаВалидности") > 0) И ЗначениеЗаполнено(СокрЛП(Правило.ПроверкаВалидностиДанных)) Тогда
					 
					 ЗначениеВалидно = ТаблицаТаблЧасти[н]["СлужебноеПоле_ПроверкаВалидности_"+Правило.НомерСтроки];
					 
					 Если НЕ ЗначениеВалидно Тогда
						 
						 ТекстОшибкиПВ = "";

						 Если ЗначениеЗаполнено(СокрЛП(Правило.СообщениеПриОшибкеВалидности)) Тогда
							 
							  ТекстОшибкиПВ = ТаблицаТаблЧасти[н]["СлужебноеПоле_СообщениеПриОшибкеВалидности_" + Правило.НомерСтроки]; 

						  КонецЕсли;	 
						  
						  Если Не ЗначениеЗаполнено(ТекстОшибкиПВ) Тогда
							   ТекстОшибкиПВ = "Значение """ + Значение + """ выгружаемое в поле <<" + Правило.ПолеФайлаПередачи + ">> не корректно.";
						  КонецЕсли;
						
						  СтрокаОписания             = ОписаниеОбъекта.Добавить();       
			              СтрокаОписания.ПолеФайла   = Правило.ОписаниеПоляФайлаПередачи; 
			              СтрокаОписания.Ошибка      = ТекстОшибкиПВ;  
					 
					 КонецЕсли;
				 Иначе	 
				     ПроверитьНаОшибки(Значение, Правило, ОписаниеОбъекта);
				 КонецЕсли;
			 КонецЦикла;
			 	 
		Иначе
			Если (СтрНайти(Колонка.Имя, "ПроверкаВалидности") > 0) И ЗначениеЗаполнено(СокрЛП(Правило.ПроверкаВалидностиДанных)) Тогда
				
				ЗначениеВалидно = СтрокаДанныхШапки["СлужебноеПоле_ПроверкаВалидности_"+ Правило.НомерСтроки];
				
				Если НЕ ЗначениеВалидно Тогда
			
					ТекстОшибкиПВ = "";
						
					Если ЗначениеЗаполнено(СокрЛП(Правило.СообщениеПриОшибкеВалидности)) Тогда	
						ТекстОшибкиПВ = СтрокаДанныхШапки["СлужебноеПоле_СообщениеПриОшибкеВалидности_" + Правило.НомерСтроки];
                    КонецЕсли;
					
					Если Не ЗначениеЗаполнено(ТекстОшибкиПВ) Тогда
					   ТекстОшибкиПВ = "Значение """ + СтрокаДанныхШапки["СлужебноеПоле_" + Правило.НомерСтроки] + """ выгружаемое в поле <<" + Правило.ПолеФайлаПередачи + ">> не корректно.";
				  КонецЕсли;
				
				  СтрокаОписания             = ОписаниеОбъекта.Добавить();       
	              СтрокаОписания.ПолеФайла   = Правило.ОписаниеПоляФайлаПередачи; 
	              СтрокаОписания.Ошибка      = ТекстОшибкиПВ;  
					
			    КонецЕсли;			
				
			Иначе	
			 	ПроверитьНаОшибки(Значение, Правило, ОписаниеОбъекта);
			КонецЕсли;
		КонецЕсли;
			 		
	КонецЦикла;	
	
	Ошибки = ЗначениеВСтрокуВнутр(ОписаниеОбъекта);
		
КонецПроцедуры

// Процедура формирует файлы выгрузки и записывает их 
// в справочник "ХранилищеДополнительнойИнформации"
Процедура СформироватьФайлы(ДокументОбъект)   Экспорт
		
	Задание                         = ДокументОбъект;
	
    ПорядковыйНомерФайлаЗаСессию    = 0;
    ПорядокФорматированияОбщейСуммы = "";
    
    Если Задание.ВидОбмена.ВсеТипыОбъектовВОдномФайле Тогда
        ВОдномФайле = Истина
    Иначе
        ВОдномФайле = Ложь;
    КонецЕсли;
	
    СхемаДанныхДляФайлаПередачи   = Новый ТаблицаЗначений;
    
    Массив         = Новый Массив;
    Массив.Добавить(Тип("Булево"));
    ОписаниеТиповБ = Новый ОписаниеТипов(Массив);
    
    СхемаДанныхДляФайлаПередачи.Колонки.Добавить("ПолеФайла", , "Поле файла передачи");
    СхемаДанныхДляФайлаПередачи.Колонки.Добавить("Значение",  , "Значение поля в файле передачи");
    СхемаДанныхДляФайлаПередачи.Колонки.Добавить("Ошибка",    , "Ошибка заполнения поля файла передачи");
    СхемаДанныхДляФайлаПередачи.Колонки.Добавить("Замечание", , "Замечание по заполнению поля файла передачи");
    СхемаДанныхДляФайлаПередачи.Колонки.Добавить("НачНовСтр", ОписаниеТиповБ, "Флаг начала новой строки");
    СхемаДанныхДляФайлаПередачи.Колонки.Добавить("ДлинаПоля", , "Длина поля файла передачи");
    СхемаДанныхДляФайлаПередачи.Колонки.Добавить("СпецПометка");
	СхемаДанныхДляФайлаПередачи.Колонки.Добавить("ВыгружаемыйДокумент");
    
    ОписаниеОбъекта = Новый ТаблицаЗначений;
    ОписаниеОбъекта.Колонки.Добавить("ПолеФайла", ,  "Поле файла передачи");
    ОписаниеОбъекта.Колонки.Добавить("Ошибка",    ,  "Ошибка заполнения поля файла передачи");    
    //*-*!!!
    //ПараметрыОтбора = Новый Структура;
    //ПараметрыОтбора.Вставить("ИмяПараметра", "ОФК");
    //ПареметрыОФК    = Задание.НастройкаОбмена.Параметры.НайтиСтроки(ПараметрыОтбора);    
	Если ТипЗнч(Задание)      = Тип("ДокументОбъект.ЗаданиеНаЭкспортДанныхВБанкиКС") Тогда  
		
        ТаблицаВыгрузки       = Задание.ОбъектыОбмена.Выгрузить();
        ТаблицаВыгрузки.ЗаполнитьЗначения("", "ОписаниеОшибки, ИмяФайлаВыгрузки");
        Задание.ОбъектыОбмена.Загрузить(ТаблицаВыгрузки); 
		
	Иначе   
		
        Задание.ОбъектыОбмена.ЗаполнитьЗначения("", "ОписаниеОшибки, ИмяФайлаВыгрузки");
        ТаблицаВыгрузки       = Задание.ОбъектыОбмена.Скопировать();    
		
		Если ТаблицаВыгрузки.Колонки.Найти("Файл") = Неопределено Тогда
			ТаблицаВыгрузки.Колонки.Добавить("Файл");
		КонецЕсли;  
		
    КонецЕсли;    
    //-----------------------------
	
    ТаблицаВыгрузки.Колонки.Добавить("КодКлиента");	
	
	Для каждого СтрокаТаблВыгрузки Из ТаблицаВыгрузки Цикл		
		СтрокаТаблВыгрузки.КодКлиента = БиблиотекаФункцийОбмена.ОпределитьКодКлиентаИзНастройкиОбмена(Задание.Ссылка, СтрокаТаблВыгрузки.Объект.Ссылка)		
	КонецЦикла;
    
    ТаблицаВыгрузки.Сортировать("Формат, КодКлиента, Объект");
    
    ОбъектыВФайл          = Новый ТаблицаЗначений;//Новый СписокЗначений;
	ОбъектыВФайл.Колонки.Добавить("Объект");//ссылка на выгружаемый документ
	ОбъектыВФайл.Колонки.Добавить("Формат");//ссылка на выгружаемый Формат  
	ОбъектыВФайл.Колонки.Добавить("Файл");  //ссылка на выгружаемый Файл 
	
    ВсеОбъектыВОдномФайле = ВОдномФайле;
    НачалоЗаписиФайла     = Истина;
    НачалоЗаписиОбъекта   = 0;
    ИндексВТаблВыгрузки   = 0;
    НомПП                 = 0;
    
    ДопПараметры          = Задание.НастройкаОбмена.Параметры.Выгрузить();
    ВалютаРеглУчета       = Константы.ВалютаРегламентированногоУчета.Получить();
    Организация           = Задание.Организация;
    КассовыйОрган         = Задание.КассовыйОрган; //не используется нигде кассовый орган
    ВидОбмена             = Задание.ВидОбмена;
    
    ДатаВыгрузки          = Задание.Дата;
    
    //Начало блока вложенных ТЧ
    // Данные вложенных ТЧ
    // Правила составления имен вложенных ТЧ - ОПИСАНИЕ УСТАРЕЛО, МЕХАНИЗМ ИЗМЕНЕН. 
    // [ИмяОсновной].[ИмяВложенной_уровень1].[ИмяВложенной_уровень2]
    // где ИмяВложенной_уровень1 - имя реквизита основной ТЧ, тип значения реквизита - ТаблицаЗначений,
    // ИмяВложенной_уровень2 - имя реквизита вложенной табличной части предыдущего уровня, тип значения реквизита - ТаблицаЗначений.
    // Причем для вложенной табличной части, основной таблицей считается та ТЧ, реквизитом которой является данная вложенная ТЧ,
    // то есть для вложенной ТЧ [ИмяВложенной_уровень2] основной ТЧ считается [ИмяВложенной_уровень1]. 
    ДанныеВложенныхТЧ = Новый ТаблицаЗначений;
    ДанныеВложенныхТЧ.Колонки.Добавить("УровеньВложенности"); //Число - показывает уровень вложенности 
    ДанныеВложенныхТЧ.Колонки.Добавить("ИмяВложеннойТЧ");//Строка - имя вложенной ТЧ
    ДанныеВложенныхТЧ.Колонки.Добавить("ИмяОсновнойТЧ"); //Строка - имя ТЧ, из которой была вызвана вложенная ТЧ
    ДанныеВложенныхТЧ.Колонки.Добавить("ПолноеИмяТЧ");//Строка - Полное имя ТЧ, например, [ИмяОсновной].[ИмяВложенной_уровень1].[ИмяВложенной_уровень2]
    ДанныеВложенныхТЧ.Колонки.Добавить("ПолноеИмяОсновнойТЧ");//Строка - Полное имя ТЧ, например, [ИмяОсновной].[ИмяВложенной_уровень1].[ИмяВложенной_уровень2]
    ДанныеВложенныхТЧ.Колонки.Добавить("НомерОбходаВложеннойТЧ");//Число - номер строки вложенной ТЧ, из которой подбираются значения
    ДанныеВложенныхТЧ.Колонки.Добавить("НомерОбходаОсновнойТЧ"); //Число - номер строки основной ТЧ, из которой подбираются значения //Для всех строк вложенной - должно быть одно
    ДанныеВложенныхТЧ.Колонки.Добавить("ПозицияВходаВложеннойТЧ");//Число - номер строки правил обмена, с которой начинается обход вложенной ТЧ
    ДанныеВложенныхТЧ.Колонки.Добавить("ПозицияВходаОсновнойТЧ"); //Число - номер строки правил обмена, с которой начинается обход основной ТЧ
    ДанныеВложенныхТЧ.Колонки.Добавить("ТаблицаТаблЧастиВложеннойТЧ");//Таблица значений - таблица данных основной тч
    ДанныеВложенныхТЧ.Колонки.Добавить("ТаблицаТаблЧастиОсновнойТЧ"); //Таблица значений - таблица данных вложенной тч
    //Конец блока вложенных ТЧ

    ТипФайла                                 = БиблиотекаФункцийОбмена.ЗначениеРеквизитаОбъекта(Задание.ВидОбмена,"ТипФайлаПередачи");
	
    ТаблицаПравилОбменаФорматов              = ПолучитьПравилаОбменаФорматов(ТаблицаВыгрузки.ВыгрузитьКолонку("Формат"));
    Отказ                                    = Ложь;
    МассивРазрешенныхФорматов                = Новый Массив;
    МассивЗапрещенныхФорматов                = Новый Массив;
    
    РазрешенныеМодули                        = ПолучитьРазрешенныеМодули();
    
    СоответствиеФорматовМодулей              = Новый Соответствие;
    
    МассивВызововОбщихМодулей                = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьВызовыОбщихМодулей(Истина);
    ДеревоЗначений                           = Неопределено;	
		
	ВыгружалсяПодвал                         = Ложь;
	
	ЭтоПродолжениеВыгрузкиПредыдущегоФормата = Ложь;
	
	СоответствиеНачалаФайлаДляФорматов       = Новый Соответствие;
	
    Для каждого Строка Из ТаблицаВыгрузки Цикл
        
        Объект               = Строка.Объект;
        ОбрабатываемыйФормат = Строка.Формат;
		КодКлиента           = Строка.КодКлиента; 
		Файл                 = Строка.Файл;
		
		МассивСтрок 	     = Задание.ОбъектыОбмена.НайтиСтроки(Новый Структура("Объект, Формат", Объект, ОбрабатываемыйФормат));
		СтрокаТЧ             = МассивСтрок[0];   // строка Задания на экспорт
				
        Если МассивЗапрещенныхФорматов.Найти(ОбрабатываемыйФормат)<>Неопределено Тогда
            ВставитьОшибкуВОписание(ОписаниеОбъекта, СоответствиеФорматовМодулей.Получить(ОбрабатываемыйФормат));  
			//СтрокаТЧ                    = Задание.ОбъектыОбмена.Найти(Объект, "Объект");
            СтрокаТЧ.ОписаниеОшибки      = ЗначениеВСтрокуВнутр(ОписаниеОбъекта);
            ОписаниеОбъекта.Очистить();
            Продолжить;
        ИначеЕсли МассивРазрешенныхФорматов.Найти(ОбрабатываемыйФормат) = Неопределено Тогда
            //Первый раз встречаем формат
            ПереченьМодулей = "";
            Результат                     = ПроверитьСхему(ОбрабатываемыйФормат, РазрешенныеМодули, МассивВызововОбщихМодулей, ПереченьМодулей);
            Если Результат = Истина Тогда
                МассивРазрешенныхФорматов.Добавить(ОбрабатываемыйФормат);
            ИначеЕсли Результат           = Неопределено Тогда
                МассивЗапрещенныхФорматов.Добавить(ОбрабатываемыйФормат);            
                СтрокаОписания            = ОписаниеОбъекта.Добавить();                
                СтрокаОписания.ПолеФайла  = "";
                СтрокаОписания.Ошибка     = НСтр("ru='У формата не сформирована схема компоновки данных. Использование формата невозможно.'");
                
                СтрокаТЧ.ОписаниеОшибки   = ЗначениеВСтрокуВнутр(ОписаниеОбъекта);
                ОписаниеОбъекта.Очистить();
                Продолжить;
            Иначе
                СоответствиеФорматовМодулей.Вставить(ОбрабатываемыйФормат,ПереченьМодулей);
                МассивЗапрещенныхФорматов.Добавить(ОбрабатываемыйФормат);
                ВставитьОшибкуВОписание(ОписаниеОбъекта,ПереченьМодулей);
                
                СтрокаТЧ.ОписаниеОшибки   = ЗначениеВСтрокуВнутр(ОписаниеОбъекта);
                ОписаниеОбъекта.Очистить();
                Продолжить;
            КонецЕсли;
        КонецЕсли;
		
		ОдинДокументСписокФайлов = Ложь;
		Если ОбрабатываемыйФормат.ОбъектВОдномФайле = 2 Тогда
			ОдинДокументСписокФайлов = Истина;
		КонецЕсли;
		
		НовСтрОбъекта = ОбъектыВФайл.Добавить();
		НовСтрОбъекта.Объект = Объект;
		НовСтрОбъекта.Формат = ОбрабатываемыйФормат;  
		НовСтрОбъекта.Файл   = Файл;
		
        ОтборФормат               = Новый Структура("Формат", ОбрабатываемыйФормат);
        СписокПравилТекФормата    = ТаблицаПравилОбменаФорматов.НайтиСтроки(ОтборФормат);
        ДеревоЗначений            = ПолучитьКоллекциюПравилОбменаПоСхеме(ОбрабатываемыйФормат, Объект, СписокПравилТекФормата, Задание.Ссылка, ДопПараметры, Отказ);
        
        СтрокаДанныхДокумента = ДеревоЗначений.Строки.Найти(Объект,"ССЫЛКАДОКУМЕНТА");
        КоллекцияЗначений     = СтрокаДанныхДокумента.Строки;
            
        Если Отказ Тогда
            Прервать;
        КонецЕсли;
        КоличествоПравилОбменаВФормате = СписокПравилТекФормата.Количество();
		
        Если ИндексВТаблВыгрузки <> ТаблицаВыгрузки.Количество()-1 Тогда
            СледФормат       = ТаблицаВыгрузки[ИндексВТаблВыгрузки + 1].Формат;
			СледКодКлиента   = ТаблицаВыгрузки[ИндексВТаблВыгрузки + 1].КодКлиента;
        Иначе
            СледФормат       = Справочники.ФорматыОбменаБанкиКС.ПустаяСсылка();
			СледКодКлиента   = "Х";
        КонецЕсли;    
                
        Если НЕ ЗначениеЗаполнено(ОбрабатываемыйФормат) Тогда
            ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В строке '") + Строка.НомерСтроки + НСтр("ru = ' не заполнено значение <<Формат>> данная строка исключена из выгрузки!'"));
            Продолжить;
        КонецЕсли;
		
        Если НачалоЗаписиФайла Тогда
            к = 0;
		Иначе
			НачалоЗаписиОбъекта = СоответствиеНачалаФайлаДляФорматов[ОбрабатываемыйФормат];
			Если ЭтоПродолжениеВыгрузкиПредыдущегоФормата 
				И НачалоЗаписиОбъекта = Неопределено Тогда
								
				врК = 0;
				Пока врК <= КоличествоПравилОбменаВФормате Цикл
					
					врПравило = СписокПравилТекФормата[врК];
					Если НРег(СокрЛП(врПравило.Условие))   = "*началообъекта" Тогда
						СоответствиеНачалаФайлаДляФорматов.Вставить(ОбрабатываемыйФормат,врК);
						НачалоЗаписиОбъекта  = врК;
		            	Прервать;
		            КонецЕсли;
					
					врК = врК + 1;
					
				КонецЦикла;
								
			КонецЕсли;
			
			Если НачалоЗаписиОбъекта = Неопределено Тогда
				НачалоЗаписиОбъекта = 0;
			КонецЕсли;
			
           	к = НачалоЗаписиОбъекта;
			
        КонецЕсли;    
        
        НомерОбхода                        = 0;
        ПозицияВхода                       = 1;
        ТаблЧасть                          = "";
        НачалоНовойСтроки                  = Ложь;
		НачатьСледующееУсловиеСНовойСтроки = Ложь;
        ЕстьОшибки                         = Ложь;
        ТаблицаТаблЧасти                   = Новый ТаблицаЗначений;
        
        ОписаниеОбъекта.Очистить();
        СхемаДо           = СхемаДанныхДляФайлаПередачи.Скопировать();
        
        Попытка
            СтрокаДанныхШапки = КоллекцияЗначений[0];
        Исключение
            СтрокаДанныхШапки = Неопределено;
        КонецПопытки;
        НомерФайла = 1;
        Пока к <= КоличествоПравилОбменаВФормате Цикл
            
            // необходимо закончить старую табличную часть
            ПризнакОкончанияСтроки               = Ложь;
            ПризнакНачалаВложеннойТЧ             = Ложь;
            
            Если ЗначениеЗаполнено(ТаблЧасть) Тогда
                
                Если (к = СписокПравилТекФормата.Количество()) Тогда
                    
                    ПризнакОкончанияСтроки       = Истина
                    
                ИначеЕсли (ВРег(ТаблЧасть) <> ВРег(СписокПравилТекФормата[к].ТабличнаяЧасть)) Тогда
                    
                    //Если начинается вложенная табличная часть, то не заканчиваем строку
                    Если Найти(ВРег(СписокПравилТекФормата[к].ТабличнаяЧасть),ВРег(ТаблЧасть+"."))>0 Тогда
                        ПризнакОкончанияСтроки   = Ложь;
                        ПризнакНачалаВложеннойТЧ = Истина;
                    Иначе
                        ПризнакОкончанияСтроки   = Истина;
                    КонецЕсли;
                    
                КонецЕсли;
                
            КонецЕсли;
            
            Если ПризнакОкончанияСтроки Тогда
                
                КолСтрокТЧ                 = ТаблицаТаблЧасти.Количество() - 1; 
				
                Если НомерОбхода < КолСтрокТЧ Тогда
                    
                    к                      = ПозицияВхода;
                    НомерОбхода            = НомерОбхода + 1;
                    НачалоНовойСтроки      = Истина;
                    НомПП                  = НомПП + 1;
                    Продолжить;
                    
                КонецЕсли;
                
                //Блок проверки вложенной ТЧ
                Если ДанныеВложенныхТЧ.Количество()>0 Тогда
                    
                    ТекСтрока               = ДанныеВложенныхТЧ[ДанныеВложенныхТЧ.Количество()-1];
                    ТаблЧасть               = ТекСтрока.ПолноеИмяОсновнойТЧ;
                    ТаблицаТаблЧасти        = ТекСтрока.ТаблицаТаблЧастиОсновнойТЧ;
                    НомерОбхода             = ТекСтрока.НомерОбходаОсновнойТЧ;
                    НомПП                   = НомерОбхода;
                    ПозицияВхода            = ТекСтрока.ПозицияВходаОсновнойТЧ;
                    ДанныеВложенныхТЧ.Удалить(ТекСтрока);
                    
                    Продолжить;
                    
                КонецЕсли;            
                //Конец блока проверки вложенной ТЧ

            КонецЕсли;
            //-----------------------------------------------
            
            Если к = КоличествоПравилОбменаВФормате Тогда
                Прервать;
            КонецЕсли;
            
            Правило                              = СписокПравилТекФормата[к];
            СтрокаВСхеме                         = СхемаДанныхДляФайлаПередачи.Добавить();
            СтрокаВСхеме.НачНовСтр               = НачалоНовойСтроки;
            СтрокаВСхеме.ДлинаПоля               = Правило.ОграничениеРазмерности;
			СтрокаВСхеме.ВыгружаемыйДокумент     = Объект; // указываем для каждой строки какой документ выгружаем - это нужно для обмена с ГИС ГМП
			
            ВнутреннийФормат                     = Правило.ТипПоляФайлаПередачи;
            
			Если НРег(СокрЛП(Правило.Условие))   = "*началообъекта" Тогда
				СоответствиеНачалаФайлаДляФорматов.Вставить(ОбрабатываемыйФормат,к);
                //НачалоЗаписиОбъекта = к;
            КонецЕсли;
			
			Если НРег(СокрЛП(Правило.Условие))   = "*конецобъекта" Тогда
				Если НачалоЗаписиФайла = Ложь Тогда
					//Если в файл уже выгрузился один документ, то не выгружаем строки после *конецобъекта
					СхемаДанныхДляФайлаПередачи.Удалить(СтрокаВСхеме);
					Прервать;	
				КонецЕсли;
			КонецЕсли;
			
            Если (НРег(СокрЛП(Правило.Условие))  = "*общееколичество") Тогда
                СтрокаВСхеме.СпецПометка = "ОК";
			КонецЕсли;
			
			Если СтрНайти(НРег(СокрЛП(Правило.Условие)),"*новаястрока")>0 Тогда
                СтрокаВСхеме.СпецПометка = "НС";
            КонецЕсли;
            
            Если (НРег(СокрЛП(Правило.Условие))     = "*общаясумма") Тогда
                СтрокаВСхеме.СпецПометка         = "ОС";
                ПорядокФорматированияОбщейСуммы     = Правило.ПравилоФорматирования;
            КонецЕсли;
            
            // суммирование, если заданно по условию
            Если НРег(СокрЛП(Правило.Условие)) = "*сумма" Тогда
                СтрокаВСхеме.СпецПометка         = "СУ";                
            КонецЕсли;
            
            Если НачалоНовойСтроки Тогда
                НачалоНовойСтроки = Ложь;
            КонецЕсли;
                    
            // началась новая табличная часть
            Если ЗначениеЗаполнено(Правило.ТабличнаяЧасть) И (ВРЕГ(ТаблЧасть) <> ВРЕГ(Правило.ТабличнаяЧасть)) И НЕ ПризнакНачалаВложеннойТЧ Тогда //Добавлена проверка на вложенную тч.
                
                НомПП            = 1;   // номер по порядку в строке
                
                ИмяТЧ            = Правило.ТабличнаяЧасть;
                ОтборТабЧасть      = Новый Структура("ИмяТабЧасти", ВРег(ИмяТЧ));
                ТаблицаТаблЧасти = КоллекцияЗначений.НайтиСтроки(ОтборТабЧасть);
                
                КолСтрокТЧ       = ТаблицаТаблЧасти.Количество() - 1; //Вычислить("Объект." + Правило.ТабличнаяЧасть + ".Количество()-1");
                // данная ТЧ не включается из-за отсутствия данных
                Если КолСтрокТЧ = -1 Тогда
                    
					Пока (к < КоличествоПравилОбменаВФормате) И (ВРег(ИмяТЧ) = ВРег(СписокПравилТекФормата[к].ТабличнаяЧасть)
						ИЛИ ВРег(ИмяТЧ+".") = Сред(ВРег(СписокПравилТекФормата[к].ТабличнаяЧасть),1,СтрДлина(ИмяТЧ+"."))) Цикл        
                        к = к + 1;                    
                    КонецЦикла;
                    
                    СхемаДанныхДляФайлаПередачи.Удалить(СхемаДанныхДляФайлаПередачи.Количество() - 1);
                    
                    Продолжить;

                ИначеЕсли КолСтрокТЧ <= 0 И НЕ ЗначениеЗаполнено(ТаблицаТаблЧасти[0][ИмяТЧ + "НомерСтроки"]) Тогда
                    
                    Пока (к < КоличествоПравилОбменаВФормате) И (ВРег(ИмяТЧ) = ВРег(СписокПравилТекФормата[к].ТабличнаяЧасть)) Цикл    
                        к = к + 1;    
                    КонецЦикла;
                    
                    СхемаДанныхДляФайлаПередачи.Удалить(СхемаДанныхДляФайлаПередачи.Количество() - 1);
                    
                    Продолжить;
                    
                КонецЕсли;
                //-------------------------------------------------
                
                НомерОбхода            = 0;
                ПозицияВхода           = к;
                СтрокаВСхеме.НачНовСтр = Истина;
                
            КонецЕсли;
            // Начало блока вложенных ТЧ
            // началась новая табличная часть - вложенная
            Если ЗначениеЗаполнено(Правило.ТабличнаяЧасть) И (ВРег(ТаблЧасть) <> ВРег(Правило.ТабличнаяЧасть)) И ПризнакНачалаВложеннойТЧ Тогда //Добавлена проверка на вложенную тч.
                
                СтрокаДанных = ДанныеВложенныхТЧ.Найти(Правило.ТабличнаяЧасть,"ПолноеИмяТЧ");
                Уровень      = 0;
                ТекТЧ        = "";
                ОсновнаяТЧ   = "";
                ОпределитьВложеннуюТЧПоИмениТЧ(Правило.ТабличнаяЧасть, Уровень, ТекТЧ, ОсновнаяТЧ);
                
                Если СтрокаДанных = Неопределено Тогда
                    
                    НоваяСтрокаДанныхВЛТЧ                         = ДанныеВложенныхТЧ.Добавить();
                    НоваяСтрокаДанныхВЛТЧ.УровеньВложенности      = Уровень;
                    НоваяСтрокаДанныхВЛТЧ.ИмяВложеннойТЧ          = ТекТЧ;
                    НоваяСтрокаДанныхВЛТЧ.ИмяОсновнойТЧ           = ОсновнаяТЧ;
                    НоваяСтрокаДанныхВЛТЧ.ПолноеИмяТЧ             = Правило.ТабличнаяЧасть;
                    НоваяСтрокаДанныхВЛТЧ.НомерОбходаВложеннойТЧ  = 0;                
                    НоваяСтрокаДанныхВЛТЧ.ПозицияВходаВложеннойТЧ = к;
                    
                    ТекИндекс = ДанныеВложенныхТЧ.Индекс(НоваяСтрокаДанныхВЛТЧ);
                    
                    Если ТекИндекс = 0 Тогда
                        
                        НоваяСтрокаДанныхВЛТЧ.НомерОбходаОсновнойТЧ      = НомерОбхода;
                        НоваяСтрокаДанныхВЛТЧ.ПозицияВходаОсновнойТЧ     = ПозицияВхода;
                        НоваяСтрокаДанныхВЛТЧ.ТаблицаТаблЧастиОсновнойТЧ = ТаблицаТаблЧасти;
                        НоваяСтрокаДанныхВЛТЧ.ПолноеИмяОсновнойТЧ        = ОсновнаяТЧ;
                        
                    Иначе
                        
                        НоваяСтрокаДанныхВЛТЧ.ТаблицаТаблЧастиОсновнойТЧ = ДанныеВложенныхТЧ[ТекИндекс-1].ТаблицаТаблЧастиВложеннойТЧ;
                        НоваяСтрокаДанныхВЛТЧ.НомерОбходаОсновнойТЧ      = НомерОбхода;
                        НоваяСтрокаДанныхВЛТЧ.ПозицияВходаОсновнойТЧ     = ДанныеВложенныхТЧ[ТекИндекс-1].ПозицияВходаВложеннойТЧ;
                        НоваяСтрокаДанныхВЛТЧ.ПолноеИмяОсновнойТЧ        = ДанныеВложенныхТЧ[ТекИндекс-1].ПолноеИмяТЧ;
                        
                    КонецЕсли;
                    
                    ИмяТПолное       = ВРег(СтрЗаменить(Правило.ТабличнаяЧасть,".","__"));
                    ИмяТ             = Сред(ИмяТПолное,Найти(ИмяТПолное,"__")+2);
                    КопияИмяТПолное  = ВРег(СтрЗаменить(Правило.ТабличнаяЧасть,".","__"));
                    
                    ИмяТПерфикс      = Сред(ИмяТПолное,1,Найти(ИмяТПолное,"__")-1);
                    ИмяТДляПоиска    = Сред(ИмяТПолное,Найти(ИмяТПолное,"__")+2);
                    
                    Пока Найти(ИмяТДляПоиска,"__")>0 Цикл
                        
                        ИмяТДляПоиска = Сред(ИмяТДляПоиска,Найти(ИмяТДляПоиска,"__")+2);    
                                            
                    КонецЦикла;
                                        
                    Если Найти(ИмяТ,"__")>0 Тогда
                        ИмяТ_ГЛ = Сред(ИмяТ,1,СтрДлина(ИмяТ)-СтрДлина(ИмяТДляПоиска)-2);
                    Иначе
                        ИмяТ_ГЛ = Сред(ИмяТПолное,1,Найти(ИмяТПолное,"__")-1);
					КонецЕсли;
					Попытка
						Если НоваяСтрокаДанныхВЛТЧ.ТаблицаТаблЧастиОсновнойТЧ.Количество()-1 >= НоваяСтрокаДанныхВЛТЧ.НомерОбходаОсновнойТЧ Тогда
							ТекНомерСтрокиГЛ = Строка(НоваяСтрокаДанныхВЛТЧ.ТаблицаТаблЧастиОсновнойТЧ[НоваяСтрокаДанныхВЛТЧ.НомерОбходаОсновнойТЧ][ИмяТПерфикс+"НомерСтроки_ГЛ"])+"__"+Строка(НоваяСтрокаДанныхВЛТЧ.НомерОбходаОсновнойТЧ+1);                    
						Иначе
							ТекНомерСтрокиГЛ = "!@!";
						КонецЕсли;
					Исключение
						ТекНомерСтрокиГЛ = "!@!";
					КонецПопытки;
					ОтборДляТекТЧ                                          = Новый Структура(ИмяТПерфикс+"НомерСтроки_ГЛ, ИмяТабЧасти, ИмяТабЧасти_ГЛ", ТекНомерСтрокиГЛ, ИмяТ, ИмяТ_ГЛ);
                    НоваяСтрокаДанныхВЛТЧ.ТаблицаТаблЧастиВложеннойТЧ      = КоллекцияЗначений.НайтиСтроки(ОтборДляТекТЧ);
                    
                    Если НоваяСтрокаДанныхВЛТЧ.ТаблицаТаблЧастиВложеннойТЧ = Неопределено Тогда
                        
                        //СтрокаТЧ                  = Задание.ОбъектыОбмена.Найти(Объект, "Объект");
                        СтрокаТЧ.ОписаниеОшибки   = ЗначениеВСтрокуВнутр(ОписаниеОбъекта);
                        ОписаниеОбъекта.Очистить();
                        СоответствиеФорматовМодулей.Вставить(ОбрабатываемыйФормат, ПереченьМодулей);
                        ЕстьОшибки                = Истина;
                        
                        Прервать;
						
                    КонецЕсли;

                    СтрокаДанных = НоваяСтрокаДанныхВЛТЧ;
                Иначе
                    // Если уже есть строка совпадающая с ПолноеИмяТЧ, то удаляем все следующие. 
                    // По алгоритму такого быть не должно, после отработки, вложенные тч удаляются в начале цикла.
                    ИндексСтрокиДанных  = ДанныеВложенныхТЧ.Индекс(СтрокаДанных);
                    
                    Если ИндексСтрокиДанных < ДанныеВложенныхТЧ.Количество()-1 Тогда
                        
                        МассивУдаляемых = Новый Массив;
                        
                        Для Инд = ИндексСтрокиДанных+1 По ДанныеВложенныхТЧ.Количество()-1 Цикл
                            МассивУдаляемых.Добавить(ДанныеВложенныхТЧ[Инд]);    
                        КонецЦикла;
                        
                        Для Каждого ЭлементМассива Из МассивУдаляемых Цикл
                            ДанныеВложенныхТЧ.Удалить(ЭлементМассива);    
                        КонецЦикла;
                        
                    КонецЕсли;
                    
                КонецЕсли;

                НомПП            = 1;   // номер по порядку в строке
                
                ИмяТЧ            = Правило.ТабличнаяЧасть;
                
                ТаблицаТаблЧасти = СтрокаДанных.ТаблицаТаблЧастиВложеннойТЧ;
                                                
                КолСтрок         = ТаблицаТаблЧасти.Количество() - 1;
                
                // данная ТЧ не включается из-за отсутствия данных
                Если КолСтрок = -1 Тогда
                    
					Пока (к < КоличествоПравилОбменаВФормате) И (ВРег(ИмяТЧ) = ВРег(СписокПравилТекФормата[к].ТабличнаяЧасть)
						ИЛИ ВРег(ИмяТЧ+".") = Сред(ВРег(СписокПравилТекФормата[к].ТабличнаяЧасть),1,СтрДлина(ИмяТЧ+"."))) Цикл
                        
                        к = к + 1;
                        
                    КонецЦикла;
                    
                    СхемаДанныхДляФайлаПередачи.Удалить(СхемаДанныхДляФайлаПередачи.Количество() - 1);
					
					//Если данных нет, то из списка вложенных удаляем эту строку
                    //ТаблЧасть               = ТекСтрока.ПолноеИмяОсновнойТЧ;
                    ТаблицаТаблЧасти        = НоваяСтрокаДанныхВЛТЧ.ТаблицаТаблЧастиОсновнойТЧ;
                    НомерОбхода             = НоваяСтрокаДанныхВЛТЧ.НомерОбходаОсновнойТЧ;
                    НомПП                   = НомерОбхода;
                    ПозицияВхода            = НоваяСтрокаДанныхВЛТЧ.ПозицияВходаОсновнойТЧ;
                    ДанныеВложенныхТЧ.Удалить(НоваяСтрокаДанныхВЛТЧ);
					
                    Продолжить;
                    
                КонецЕсли;
                //-------------------------------------------------
                
                НомерОбхода            = 0;
                ПозицияВхода           = к;
                СтрокаВСхеме.НачНовСтр = Истина;
                
            КонецЕсли;
            //Конец блока вложенных ТЧ

            ТаблЧасть                  = ВРЕГ(Правило.ТабличнаяЧасть);
            Значение                   = "";
			
			ТекПолеФайлаПередачи = Правило.ПолеФайлаПередачи;
			Если Найти(ТекПолеФайлаПередачи,"%")>0 Тогда
				Попытка
					Если ЗначениеЗаполнено(ТаблЧасть) Тогда
						ТекПолеФайлаПередачи = ТаблицаТаблЧасти[НомерОбхода]["СлужебноеПоле_ПолеФайлаПередачи_" + Правило.НомерСтроки];
					Иначе
						ТекПолеФайлаПередачи = СтрокаДанныхШапки["СлужебноеПоле_ПолеФайлаПередачи_" + Правило.НомерСтроки];
					КонецЕсли;
				Исключение
					ТекПолеФайлаПередачи = Правило.ПолеФайлаПередачи;
				КонецПопытки;
			КонецЕсли;
			
            СтрокаВСхеме.ПолеФайла      = ТекПолеФайлаПередачи;
			
            Если ЗначениеЗаполнено(ТаблЧасть) Тогда
                Значение                = ТаблицаТаблЧасти[НомерОбхода]["СлужебноеПоле_" + Правило.НомерСтроки]; 
            Иначе
                Значение                = СтрокаДанныхШапки["СлужебноеПоле_" + Правило.НомерСтроки];
            КонецЕсли;                
            
            //----------------------------------------------------------------------------            
            // проверка на условие включения секции
            Если СтрНайти(Правило.Условие,"/*?*/")>0 Тогда
                
                Если ЗначениеЗаполнено(ТаблЧасть) Тогда
                    ЗначениеУсловия               = ТаблицаТаблЧасти[НомерОбхода]["СлужебноеПоле_Условие_"+Правило.НомерСтроки]; 
                Иначе
                    ЗначениеУсловия               = СтрокаДанныхШапки["СлужебноеПоле_Условие_"+Правило.НомерСтроки];
                КонецЕсли;

                Если НЕ ЗначениеУсловия Тогда 
                    //исключаем весь блок, как несоответствующую заданному условию
					
					Если ТипФайла <> Перечисления.ТипыФайловПередачиДляОбмена.XML Тогда
						ПозТ     = Найти(СписокПравилТекФормата[к].ПолеФайлаПередачи, ".") - 1;
                    	ПозТ     = ?(ПозТ = -1, СтрДлина(СписокПравилТекФормата[к].ПолеФайлаПередачи), ПозТ+1); //Изменено - если в имени блока есть точка, то берется включая точку
                    	ИмяБлока = Лев(СписокПравилТекФормата[к].ПолеФайлаПередачи, ПозТ);
						
						Пока (к < СписокПравилТекФормата.Количество()) 
							И (Найти(СокрЛП(СписокПравилТекФормата[к].ПолеФайлаПередачи), ИмяБлока) = 1) Цикл
	                        
	                        к = к + 1;
	                        
						КонецЦикла;
					Иначе
						
						ИмяБлока = СписокПравилТекФормата[к].ПолеФайлаПередачи;
						Первый = Истина;
						ПозицияСледСимвола = СтрДлина(ИмяБлока)+1;
						
						//В файле может быть несколько разделов с одинаковым именем, 
						//то есть выгрузка нескольких видов данных в один и тот же раздел.
						//При пропуске блока данных, будет выполняться пропуск только первого раздела,
						//например:
						//ИмяБлока                - тут сработало условие, что блок ИмяБлока надо пропустить, пропускаем
						//ИмяБлока/чтотоеще1      - пропускаем
						//ИмяБлока/чтотоещеN      - пропускаем
						//ИмяБлока                - данный блок будет включен в файл, если для него не будет задано свое условие
						
						Пока (к < СписокПравилТекФормата.Количество()) 
							И (Найти(СокрЛП(СписокПравилТекФормата[к].ПолеФайлаПередачи), ИмяБлока) = 1) Цикл
							
	                        ПроверяемаяСтрока = СокрЛП(СписокПравилТекФормата[к].ПолеФайлаПередачи);
							
							СледСимвол = Сред(ПроверяемаяСтрока,ПозицияСледСимвола,1);
							
							Если СледСимвол = "/" 
								ИЛИ (Первый И СледСимвол = "")  
								ИЛИ СледСимвол = "[" Тогда
	                        	к = к + 1;
								Первый = Ложь;
							Иначе
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
                    
                    СхемаДанныхДляФайлаПередачи.Удалить(СхемаДанныхДляФайлаПередачи.Количество() - 1);
                    
                    Продолжить;
					
				 Иначе
				
					 Если НачатьСледующееУсловиеСНовойСтроки Тогда

						СтрокаВСхеме                       = СхемаДанныхДляФайлаПередачи.Добавить();
				        СтрокаВСхеме.НачНовСтр             = Истина;
						НачатьСледующееУсловиеСНовойСтроки = Ложь;
						
					 КонецЕсли;
                    
                 КонецЕсли;
                
            КонецЕсли;
            
            //--------------------------------------------------------------------------
			
			 // проверка на условие включения части секции до следующего условия
            Если СтрНайти(Правило.Условие, "/*??*/")>0 Тогда
                
                Если ЗначениеЗаполнено(ТаблЧасть) Тогда
                    ЗначениеУсловия               = ТаблицаТаблЧасти[НомерОбхода]["СлужебноеПоле_Условие_"+Правило.НомерСтроки]; 
                Иначе
                    ЗначениеУсловия               = СтрокаДанныхШапки["СлужебноеПоле_Условие_"+Правило.НомерСтроки];
                КонецЕсли;

                Если НЕ ЗначениеУсловия Тогда 
                    //исключаем весь блок, как несоответствующую заданному условию
					
					Если ТипФайла <> Перечисления.ТипыФайловПередачиДляОбмена.XML Тогда
						ПозТ     = Найти(СписокПравилТекФормата[к].ПолеФайлаПередачи, ".") - 1;
                    	ПозТ     = ?(ПозТ = -1, СтрДлина(СписокПравилТекФормата[к].ПолеФайлаПередачи), ПозТ+1); //Изменено - если в имени блока есть точка, то берется включая точку
                    	ИмяБлока = Лев(СписокПравилТекФормата[к].ПолеФайлаПередачи, ПозТ);
												
						Пока (к < СписокПравилТекФормата.Количество()) 
							И (Найти(СокрЛП(СписокПравилТекФормата[к].ПолеФайлаПередачи), ИмяБлока) = 1) 
							И (Лев(СокрЛП(СписокПравилТекФормата[к].Условие), 5) <> "/*?*/") Цикл
	                        
	                        к = к + 1;
	                        
						КонецЦикла;
					Иначе
						
						ИмяБлока = СписокПравилТекФормата[к].ПолеФайлаПередачи;
						
						Пока (к < СписокПравилТекФормата.Количество()) 
							И (Найти(СокрЛП(СписокПравилТекФормата[к].ПолеФайлаПередачи), ИмяБлока) = 1) 
							И (Лев(СокрЛП(СписокПравилТекФормата[к].Условие), 5) <> "/*?*/") Цикл
							 
	                        ПроверяемаяСтрока = СокрЛП(СписокПравилТекФормата[к].ПолеФайлаПередачи);
							
							СледСимвол = Сред(ПроверяемаяСтрока,СтрДлина(ИмяБлока)+1,1);
							
							Если СледСимвол = "/" ИЛИ СледСимвол = ""  Или СледСимвол = "[" Тогда
	                        	к = к + 1;
							Иначе
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
                    
                    СхемаДанныхДляФайлаПередачи.Удалить(СхемаДанныхДляФайлаПередачи.Количество() - 1);
                    
                    Продолжить;
				Иначе
					НачатьСледующееУсловиеСНовойСтроки = Истина;                  
                КонецЕсли;
                
            КонецЕсли;
            
            //--------------------------------------------------------------------------

            
            // Блок проверки
            Если ЗначениеЗаполнено(Значение) Тогда
                
                Описание                  = "";
                ЕстьНовыеОшибки           = Справочники.ТипыДанныхОбменаБанкиКС.СоответствуетТипуДанных(Правило.ТипПоляФайлаПередачи, Значение, Правило.ОграничениеРазмерности, Описание);
                ЕстьОшибки                = ЕстьОшибки ИЛИ ЕстьНовыеОшибки;
                
                Если ЗначениеЗаполнено(Описание) Тогда
                    СтрокаВСхеме.Ошибка   = ?(ЕстьНовыеОшибки, "!!! ", "") + "Поле <<" + Правило.ПолеФайлаПередачи + ">> :" + Описание;
                КонецЕсли;
                
            Иначе
                
                Если (Правило.ОбязательностьЗаполнения) Тогда
                    ЕстьОшибки            = Истина;
                    СтрокаВСхеме.Ошибка   = "!!! Обязательное поле <<" + Правило.ПолеФайлаПередачи + ">> не заполнено";
                КонецЕсли;
                
            КонецЕсли;
            
            СтрокаВСхеме.Значение = Значение;
            
            Если ЗначениеЗаполнено(СтрокаВСхеме.Ошибка) Тогда
                
                СтрокаОписания = ОписаниеОбъекта.Добавить();
                
                СтрокаОписания.ПолеФайла   = Правило.ОписаниеПоляФайлаПередачи; //СтрокаВСхеме.ПолеФайла;
                СтрокаОписания.Ошибка      = СтрокаВСхеме.Ошибка;  
                
			КонецЕсли;
			
			// Блок проверки по полю ПроверкаВалидности
			Если ЗначениеЗаполнено(СокрЛП(Правило.ПроверкаВалидностиДанных)) Тогда
				Если ЗначениеЗаполнено(ТаблЧасть) Тогда
                    ЗначениеВалидно = ТаблицаТаблЧасти[НомерОбхода]["СлужебноеПоле_ПроверкаВалидности_"+Правило.НомерСтроки]; 
                Иначе
                    ЗначениеВалидно = СтрокаДанныхШапки["СлужебноеПоле_ПроверкаВалидности_"+Правило.НомерСтроки];
                КонецЕсли;

				Если НЕ ЗначениеВалидно Тогда
					ЕстьОшибки = Истина;
					Если ЗначениеЗаполнено(СтрокаВСхеме.Ошибка) Тогда
						СтрокаВСхеме.Ошибка = СтрокаВСхеме.Ошибка + Символы.ПС;
					Иначе
						СтрокаВСхеме.Ошибка = "";
					КонецЕсли;
					
					ТекстОшибкиПВ = "";
					
					Если ЗначениеЗаполнено(СокрЛП(Правило.СообщениеПриОшибкеВалидности)) Тогда
						Если ЗначениеЗаполнено(ТаблЧасть) Тогда
		                    ТекстОшибкиПВ = ТаблицаТаблЧасти[НомерОбхода]["СлужебноеПоле_СообщениеПриОшибкеВалидности_"+Правило.НомерСтроки]; 
		                Иначе
		                    ТекстОшибкиПВ = СтрокаДанныхШапки["СлужебноеПоле_СообщениеПриОшибкеВалидности_"+Правило.НомерСтроки];
		                КонецЕсли; 				
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(ТекстОшибкиПВ) Тогда
						ТекстОшибкиПВ = "Значение """+СтрокаВСхеме.Значение+""" выгружаемое в поле <<" + Правило.ПолеФайлаПередачи + ">> не корректно.";
					КонецЕсли;
					
					СтрокаВСхеме.Ошибка = СтрокаВСхеме.Ошибка + ТекстОшибкиПВ;	
					
					СтрокаОписания = ОписаниеОбъекта.Добавить();
                
                	СтрокаОписания.ПолеФайла   = Правило.ОписаниеПоляФайлаПередачи; //СтрокаВСхеме.ПолеФайла;
               		СтрокаОписания.Ошибка      = ТекстОшибкиПВ;
				КонецЕсли;
			КонецЕсли;
			                  
            //--------------------------------------------------------------------------
            
            к = к + 1;
			Если к = СписокПравилТекФормата.Количество() Тогда 
				
				Если ОдинДокументСписокФайлов Тогда
					
					ПодготовитьФайлВыгрузки(ОбрабатываемыйФормат, "_"+Строка(НомерФайла), , КодКлиента);
					СхемаДанныхДляФайлаПередачи.Очистить();
	                НачалоЗаписиФайла     = Истина;
					//ПодвалЗаписан = Ложь;
					НомерФайла = НомерФайла + 1;
					
				КонецЕсли;
				
			КонецЕсли;
        КонецЦикла;
        
        Если  ОписаниеОбъекта.Количество() > 0 Тогда
            //СтрокаТЧ                  = Задание.ОбъектыОбмена.Найти(Объект, "Объект");
            СтрокаТЧ.ОписаниеОшибки   = ЗначениеВСтрокуВнутр(ОписаниеОбъекта);
        КонецЕсли;
        
       Если ЕстьОшибки Тогда
            
            //СтрокаТЧ                       = Задание.ОбъектыОбмена.Найти(Объект, "Объект");
            СтрокаТЧ.ИмяФайлаВыгрузки      = "!Объект не выгружен! Есть ошибки заполнения.";
			
			//Если не удалось выгрузить объект, но в этом объекте есть 
			
            СхемаДанныхДляФайлаПередачи    = СхемаДо.Скопировать();
					
            ОбъектыВФайл.Удалить(ОбъектыВФайл.Количество()-1);
			Если ОбъектыВФайл.Количество() = 0 Тогда
				ИндексВТаблВыгрузки = ИндексВТаблВыгрузки + 1;
                Продолжить;
            КонецЕсли;
			
			// за ним есть еще файлы на обработку
            Если (ОбрабатываемыйФормат = СледФормат) И (ИндексВТаблВыгрузки < (ТаблицаВыгрузки.Количество()-1)) Тогда
				ИндексВТаблВыгрузки = ИндексВТаблВыгрузки + 1;
				Продолжить;
            КонецЕсли;
            
        КонецЕсли;    
        
        НачалоЗаписиФайла = Ложь;
		//ПодвалЗаписан = Истина; 
		//Если дошли до данной строки, значит документ выгрузился в файл,
		//и строки от *КонецОбъекта до конца ТЧ выгрузились
		
        Если НЕ ВсеОбъектыВОдномФайле Тогда
            
            Если (ОбрабатываемыйФормат.ФорматВОтдельномФайле) Тогда
                //ОбрабатываемыйФормат.ОдинОбъектВОдномФайле
                Если ОбрабатываемыйФормат.ОбъектВОдномФайле = 0 Тогда
                    
                    ПодготовитьФайлВыгрузки(ОбрабатываемыйФормат, , Строка.Объект, КодКлиента);
                    
                    СхемаДанныхДляФайлаПередачи.Очистить();
                    НачалоЗаписиФайла     = Истина;
                    ОбъектыВФайл.Очистить();
					
					ЭтоПродолжениеВыгрузкиПредыдущегоФормата = Ложь;
					
                ИначеЕсли ОбрабатываемыйФормат.ОбъектВОдномФайле = 1 Тогда
					
					ФормируемФайл = Ложь;
					Если ИндексВТаблВыгрузки = ТаблицаВыгрузки.Количество()-1 Тогда
						//это последний документ из таблицы выгружаемых документов, нужно формировать файл
						ФормируемФайл = Истина;
					КонецЕсли;
					
					Если КодКлиента <> СледКодКлиента Тогда
						//КодКлиента - Код УБП (РПБС) организации - для форматов ОФК
						//по каждому коду клиента нужно формировать свой файл
						ФормируемФайл = Истина;
					КонецЕсли;
					
					Если КоличествоДокументовВОдномФайле > 0 И ОбъектыВФайл.Количество() >= КоличествоДокументовВОдномФайле Тогда
						//В обработке задано ограничение на количество документов в файле, нужно формировать файл.
						ФормируемФайл = Истина;
					КонецЕсли;
					
					Если ОбрабатываемыйФормат <> СледФормат
						И ФормируемФайл = Ложь Тогда
						МассивФорматов = Новый Массив;
						МассивФорматов.Добавить(ОбрабатываемыйФормат);
						МассивФорматов.Добавить(СледФормат);
						РеквизитыФ = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивФорматов,"КодГруппировкиФорматов,ФорматВОтдельномФайле,ОбъектВОдномФайле");
						
						Если ЗначениеЗаполнено(РеквизитыФ[ОбрабатываемыйФормат].КодГруппировкиФорматов)
							И ЗначениеЗаполнено(РеквизитыФ[СледФормат].КодГруппировкиФорматов)
							И РеквизитыФ[ОбрабатываемыйФормат].КодГруппировкиФорматов = РеквизитыФ[СледФормат].КодГруппировкиФорматов
							И РеквизитыФ[СледФормат].ФорматВОтдельномФайле
							И РеквизитыФ[СледФормат].ОбъектВОдномФайле = 1 Тогда
							//если у следующего формата такие же настройки выгрузки - несколько объектов в один файл и формат в отдельном файле,
							//и задан КодГруппировкиФорматов, совпадающий с КодГруппировкиФорматов текущего формата,
							//то следующий формат надо выгружать в этот же файл.
							//Используется для форматов обмена с ГИС ГМП, когда необходимо несколько видов документов выгрузить в один файл.
							ФормируемФайл = Ложь;
							ЭтоПродолжениеВыгрузкиПредыдущегоФормата = Истина; 
						Иначе
							ФормируемФайл = Истина;
						КонецЕсли;
					КонецЕсли;
					
					Если ФормируемФайл Тогда
						ЭтоПродолжениеВыгрузкиПредыдущегоФормата = Ложь;
						
						//Если СоответствиеФорматовВыгрузиПодвалов[ОбрабатываемыйФормат]<>Неопределено Тогда
						//	СоответствиеФорматовВыгрузиПодвалов.Удалить(ОбрабатываемыйФормат);
						//КонецЕсли;
						
                        //--------------------------------------
                        СтрокаКоличество = СхемаДанныхДляФайлаПередачи.Найти("ОК", "СпецПометка");
                        Если ЗначениеЗаполнено(СтрокаКоличество) Тогда
                            СтрокаКоличество.Значение = Строка(ОбъектыВФайл.Количество());
                        КонецЕсли;
                        
                        СтрокаСумма = СхемаДанныхДляФайлаПередачи.Найти("ОС", "СпецПометка");
                        Если ЗначениеЗаполнено(СтрокаСумма) Тогда
                            
                            ОбщаяСумма = 0;
                            
                            Отбор = Новый Структура();
                            Отбор.Вставить("СпецПометка", "СУ");
                            
                            СтрокиСуммы = СхемаДанныхДляФайлаПередачи.НайтиСтроки(Отбор);
                            
                            Для Каждого Сумма Из СтрокиСуммы Цикл
                                ОбщаяСумма = ОбщаяСумма + Число(Сумма.Значение);
                            КонецЦикла;
                            
                            Значение        = ОбщаяСумма;
                            ФорматнаяСтрока = "ЧЦ=18; ЧГ=";
                            ПозицияФормат = Найти(ВРег(ПорядокФорматированияОбщейСуммы), ВРег("Формат("));
                            Если ПозицияФормат>0 Тогда
                                БлокДляПоискаНачало = Сред(ПорядокФорматированияОбщейСуммы,ПозицияФормат);
                                ПозицияКавычкиНачало = Найти(БлокДляПоискаНачало,"""");
                                БлокДляПоискаКонец = Сред(БлокДляПоискаНачало,ПозицияКавычкиНачало+1);
                                ПозицияКвычкиКонец = Найти(БлокДляПоискаКонец,"""");
                                Если ПозицияКавычкиНачало>0 И ПозицияКвычкиКонец>0 Тогда
                                    ФорматнаяСтрока = Сред(БлокДляПоискаКонец,1,ПозицияКвычкиКонец-1);
                                КонецЕсли;
                            КонецЕсли;
                            Если ЗначениеЗаполнено(ФорматнаяСтрока) Тогда
                                Попытка
                                    СтрокаСумма.Значение = Формат(Значение,ФорматнаяСтрока);
                                Исключение
                                    СтрокаСумма.Значение = ОбщаяСумма;
                                КонецПопытки;
                            Иначе
                                СтрокаСумма.Значение = ОбщаяСумма;
                            КонецЕсли;
                            
                            //СтрокаСумма.Значение = Вычислить(ПорядокФорматированияОбщейСуммы);
                            
                        КонецЕсли;
                        //--------------------------------------
                        
                        ПодготовитьФайлВыгрузки(ОбрабатываемыйФормат, , , КодКлиента);
                        
                        СхемаДанныхДляФайлаПередачи.Очистить();
                        НачалоЗаписиФайла = Истина;
						//ПодвалЗаписан = Ложь;
                        ОбъектыВФайл.Очистить();
                        
                    КонецЕсли;    
				Иначе				
					ОбъектыВФайл.Очистить();
					НачалоЗаписиФайла = Истина;
					//ПодвалЗаписан = Ложь;
					СхемаДанныхДляФайлаПередачи.Очистить();
					
					ЭтоПродолжениеВыгрузкиПредыдущегоФормата = Ложь;
                КонецЕсли;    	
				
			КонецЕсли;
			
        КонецЕсли;    
        
        ИндексВТаблВыгрузки = ИндексВТаблВыгрузки + 1;
        
    КонецЦикла;
    
    Если ВсеОбъектыВОдномФайле И (ОбъектыВФайл.Количество() > 0) Тогда
        ПодготовитьФайлВыгрузки(ОбрабатываемыйФормат, , , КодКлиента);
    КонецЕсли;
    
КонецПроцедуры

Функция ПолучитьПравилаОбменаФорматов(МассивФорматов, ПолныйСписок = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользовательскиеВыраженияПолейФорматовОбмена.ФорматОбмена КАК ФорматОбмена,
		|	ПользовательскиеВыраженияПолейФорматовОбмена.ОбрабатываемоеПоле КАК ОбрабатываемоеПоле,
		|	ПользовательскиеВыраженияПолейФорматовОбмена.ПолеФайла КАК ПолеФайла,
		|	ПользовательскиеВыраженияПолейФорматовОбмена.НомерСтрокиПравил КАК НомерСтрокиПравил,
		|	ПользовательскиеВыраженияПолейФорматовОбмена.ПользовательскоеВыражение КАК ПользовательскоеВыражение
		|ПОМЕСТИТЬ ПереопределяемыеПоля
		|ИЗ
		|	РегистрСведений.ПользовательскиеВыраженияПолейФорматовОбмена КАК ПользовательскиеВыраженияПолейФорматовОбмена
		|ГДЕ
		|	ПользовательскиеВыраженияПолейФорматовОбмена.Использовать
		|	И ПользовательскиеВыраженияПолейФорматовОбмена.ФорматОбмена В(&МассивФорматов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФорматыОбменаБанкиКСПравилаОбмена.Ссылка КАК Формат,
		|	ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки КАК НомерСтроки,
		|	ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК ПолеФайлаПередачи,
		|	ФорматыОбменаБанкиКСПравилаОбмена.ТипПоляФайлаПередачи КАК ТипПоляФайлаПередачи,
		|	ФорматыОбменаБанкиКСПравилаОбмена.ОписаниеПоляФайлаПередачи КАК ОписаниеПоляФайлаПередачи,
		|	ФорматыОбменаБанкиКСПравилаОбмена.ОбязательностьЗаполнения КАК ОбязательностьЗаполнения,
		|	ФорматыОбменаБанкиКСПравилаОбмена.ТабличнаяЧасть КАК ТабличнаяЧасть,
		|	ФорматыОбменаБанкиКСПравилаОбмена.СекцияПечати КАК СекцияПечати,
		|	ФорматыОбменаБанкиКСПравилаОбмена.ПеременнаяПечати КАК ПеременнаяПечати,
		|	ЕСТЬNULL(ФорматыОбменаБанкиКСПравилаОбмена.ТипПоляФайлаПередачи.ПравилоФорматирования, """") КАК ПравилоФорматирования,
		|	ЕСТЬNULL(ФорматыОбменаБанкиКСПравилаОбмена.ТипПоляФайлаПередачи.СтрогоРавноМаксимальномуРазмеру, ЛОЖЬ) КАК СтрогоРавноМаксимальномуРазмеру,
		|	ВЫБОР
		|		КОГДА НЕ ПереопределяемыеПоля_ОграничениеРазмерности_Номер.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_ОграничениеРазмерности_Номер.ПользовательскоеВыражение
		|		КОГДА НЕ ПереопределяемыеПоля_ОграничениеРазмерности_Ноль.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_ОграничениеРазмерности_Ноль.ПользовательскоеВыражение
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ОграничениеРазмерностиПВ,
		|	ФорматыОбменаБанкиКСПравилаОбмена.ОграничениеРазмерности КАК ОграничениеРазмерности,
		|	ВЫБОР
		|		КОГДА НЕ ПереопределяемыеПоля_ПолеОбъекта_Номер.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_ПолеОбъекта_Номер.ПользовательскоеВыражение
		|		КОГДА НЕ ПереопределяемыеПоля_ПолеОбъекта_Ноль.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_ПолеОбъекта_Ноль.ПользовательскоеВыражение
		|		ИНАЧЕ ФорматыОбменаБанкиКСПравилаОбмена.ПолеОбъекта
		|	КОНЕЦ КАК ПолеОбъекта,
		|	ВЫБОР
		|		КОГДА НЕ ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ПользовательскоеВыражение
		|		КОГДА НЕ ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ПользовательскоеВыражение
		|		ИНАЧЕ ФорматыОбменаБанкиКСПравилаОбмена.ПорядокЗаполнения
		|	КОНЕЦ КАК ПорядокЗаполнения,
		|	ВЫБОР
		|		КОГДА НЕ ПереопределяемыеПоля_Условие_Номер.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_Условие_Номер.ПользовательскоеВыражение
		|		КОГДА НЕ ПереопределяемыеПоля_Условие_Ноль.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_Условие_Ноль.ПользовательскоеВыражение
		|		ИНАЧЕ ФорматыОбменаБанкиКСПравилаОбмена.Условие
		|	КОНЕЦ КАК Условие,
		|	ВЫБОР
		|		КОГДА НЕ ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер.ПользовательскоеВыражение
		|		КОГДА НЕ ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль.ПользовательскоеВыражение
		|		ИНАЧЕ ФорматыОбменаБанкиКСПравилаОбмена.ПроверкаВалидностиДанных
		|	КОНЕЦ КАК ПроверкаВалидностиДанных,
		|	ВЫБОР
		|		КОГДА НЕ ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер.ПользовательскоеВыражение
		|		КОГДА НЕ ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль.ПользовательскоеВыражение
		|		ИНАЧЕ ФорматыОбменаБанкиКСПравилаОбмена.СообщениеПриОшибкеВалидности
		|	КОНЕЦ КАК СообщениеПриОшибкеВалидности,
		|	ВЫБОР
		|		КОГДА НЕ ПереопределяемыеПоля_ДопДействия_Номер.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_ДопДействия_Номер.ПользовательскоеВыражение
		|		КОГДА НЕ ПереопределяемыеПоля_ДопДействия_Ноль.ПользовательскоеВыражение ЕСТЬ NULL
		|			ТОГДА ПереопределяемыеПоля_ДопДействия_Ноль.ПользовательскоеВыражение
		|		ИНАЧЕ ФорматыОбменаБанкиКСПравилаОбмена.ДопДействия
		|	КОНЕЦ КАК ДопДействия
		|ИЗ
		|	Справочник.ФорматыОбменаБанкиКС.ПравилаОбмена КАК ФорматыОбменаБанкиКСПравилаОбмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПолеОбъекта_Номер
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_ПолеОбъекта_Номер.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПолеОбъекта_Номер.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_ПолеОбъекта_Номер.ОбрабатываемоеПоле = ""ПолеОбъекта"")
		|			И ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки = ПереопределяемыеПоля_ПолеОбъекта_Номер.НомерСтрокиПравил
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПолеОбъекта_Ноль
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_ПолеОбъекта_Ноль.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПолеОбъекта_Ноль.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_ПолеОбъекта_Ноль.ОбрабатываемоеПоле = ""ПолеОбъекта"")
		|			И (ПереопределяемыеПоля_ПолеОбъекта_Ноль.НомерСтрокиПравил = 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПорядокЗаполнения_Номер
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ОбрабатываемоеПоле = ""ПорядокЗаполнения"")
		|			И ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки = ПереопределяемыеПоля_ПорядокЗаполнения_Номер.НомерСтрокиПравил
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПорядокЗаполнения_Ноль
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ОбрабатываемоеПоле = ""ПорядокЗаполнения"")
		|			И (ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.НомерСтрокиПравил = 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ОграничениеРазмерности_Номер
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_ОграничениеРазмерности_Номер.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ОграничениеРазмерности_Номер.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_ОграничениеРазмерности_Номер.ОбрабатываемоеПоле = ""ОграничениеРазмерности"")
		|			И ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки = ПереопределяемыеПоля_ОграничениеРазмерности_Номер.НомерСтрокиПравил
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ОграничениеРазмерности_Ноль
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_ОграничениеРазмерности_Ноль.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ОграничениеРазмерности_Ноль.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_ОграничениеРазмерности_Ноль.ОбрабатываемоеПоле = ""ОграничениеРазмерности"")
		|			И (ПереопределяемыеПоля_ОграничениеРазмерности_Ноль.НомерСтрокиПравил = 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_Условие_Номер
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_Условие_Номер.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_Условие_Номер.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_Условие_Номер.ОбрабатываемоеПоле = ""Условие"")
		|			И ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки = ПереопределяемыеПоля_Условие_Номер.НомерСтрокиПравил
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_Условие_Ноль
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_Условие_Ноль.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_Условие_Ноль.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_Условие_Ноль.ОбрабатываемоеПоле = ""Условие"")
		|			И (ПереопределяемыеПоля_Условие_Ноль.НомерСтрокиПравил = 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ДопДействия_Номер
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_ДопДействия_Номер.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ДопДействия_Номер.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_ДопДействия_Номер.ОбрабатываемоеПоле = ""ДопДействия"")
		|			И ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки = ПереопределяемыеПоля_ДопДействия_Номер.НомерСтрокиПравил
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ДопДействия_Ноль
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_ДопДействия_Ноль.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ДопДействия_Ноль.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_ДопДействия_Ноль.ОбрабатываемоеПоле = ""ДопДействия"")
		|			И (ПереопределяемыеПоля_ДопДействия_Ноль.НомерСтрокиПравил = 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер.ОбрабатываемоеПоле = ""ПроверкаВалидностиДанных"")
		|			И ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки = ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер.НомерСтрокиПравил
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль.ОбрабатываемоеПоле = ""ПроверкаВалидностиДанных"")
		|			И (ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль.НомерСтрокиПравил = 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер.ОбрабатываемоеПоле = ""СообщениеПриОшибкеВалидности"")
		|			И ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки = ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер.НомерСтрокиПравил
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль
		|		ПО ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль.ФорматОбмена
		|			И ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль.ПолеФайла КАК СТРОКА(1000))))
		|			И (ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль.ОбрабатываемоеПоле = ""СообщениеПриОшибкеВалидности"")
		|			И (ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль.НомерСтрокиПравил = 0)
		|ГДЕ
		|	ФорматыОбменаБанкиКСПравилаОбмена.Ссылка В(&МассивФорматов)";
	
	Если НЕ ПолныйСписок Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И ФорматыОбменаБанкиКСПравилаОбмена.Отключить = ЛОЖЬ";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	Формат,
		|	НомерСтроки";
		//|ИТОГИ ПО
		//|	Формат";

	Запрос.УстановитьПараметр("МассивФорматов", МассивФорматов);

	Результат                   = Запрос.Выполнить();

	ТаблицаПравилОбменаФорматов = Результат.Выгрузить();
	
	Для каждого Правило Из ТаблицаПравилОбменаФорматов Цикл 
		Если ЗначениеЗаполнено(Правило.ОграничениеРазмерностиПВ) Тогда
			Попытка
				Правило.ОграничениеРазмерности = Число(Правило.ОграничениеРазмерностиПВ);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПравилОбменаФорматов.Колонки.Удалить("ОграничениеРазмерностиПВ");

	Возврат ТаблицаПравилОбменаФорматов;

КонецФункции // ДобавитьПроводку()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСсылкуНаОбъект(ВидОбъекта, Условия)

	Запрос = Новый Запрос;
	
	ТекстЗапроса = "Выбрать Первые 1
					|Т1.Ссылка
					|ИЗ
					|"+ВидОбъекта+" как Т1
					|ГДЕ
					|";
	Счетчик = 0;
	
	Для каждого Условие Из Условия Цикл
	
		ТекстЗапроса = ТекстЗапроса + "
						|"+?(Счетчик>0, "И ", "")+"Т1."+СтрЗаменить(Условие.Ключ, "point", ".")+" = &П" + Счетчик;
		Запрос.УстановитьПараметр("П"+ Счетчик, Условие.Значение);
		
		Если  Условие.Значение = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	
	КонецЦикла; 						
	
	Запрос.Текст = ТекстЗапроса;
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаЗапроса.Следующий();
		Возврат ВыборкаЗапроса.Ссылка;	
	КонецЕсли;	

КонецФункции // ПолучитьСсылкуНаОбъект()
 
Процедура ВставитьОшибкуВДокумент(Объект, Ошибка, НомерСтроки)
	
	Объект.ФайлыОбмена[НомерСтроки - 1].Описание 	   = "Подробно...";
	Объект.ФайлыОбмена[НомерСтроки - 1].ОписаниеОшибки = Ошибка;
	
КонецПроцедуры	

Функция ТекстЗапросаЗадание()
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Задание.Номер,
	               |	Задание.Дата,
	               |	Задание.ДатаКон,
	               |	Задание.ДатаНач,
	               |	Задание.Организация,
	               |	Задание.Комментарий,
	               |	Задание.КассовыйОрган,
	               |	Задание.ВидОбмена,
	               |	Задание.НастройкаОбмена,
	               |	Задание.НастройкаФорматов
	               |ИЗ
	               |	Документ.ЗаданиеНаИмпортДанныхБанкиКС КАК Задание
	               |ГДЕ
	               |	Задание.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ФайлыОбмена.ИмяФайлаЗагрузки,
	               |	ФайлыОбмена.Формат,
	               |	ФайлыОбмена.ТипОбъекта                КАК ТипОбъекта," + 
				   ?(ВидОбмена.ПредставлениеВНомереВерсии = "KB", "ФайлыОбмена.ИмяФайлаЗагрузки          КАК ИмяФайла," , "
	               |	ВложенныйЗапрос.ИмяФайла, ") + "
	               |	ФайлыОбмена.НомерСтроки               КАК НомерСтроки,
	               |	ФайлыОбмена.ОписаниеОшибки,
	               |	ФайлыОбмена.Описание," + 
				   ?(ВидОбмена.ПредставлениеВНомереВерсии = "KB", "&Ссылка КАК Регистратор", "
	               |	ВложенныйЗапрос.Регистратор")  + "
	               |ИЗ
	               |	Документ.ЗаданиеНаИмпортДанныхБанкиКС.ФайлыОбмена КАК ФайлыОбмена " + 
				   ?(ВидОбмена.ПредставлениеВНомереВерсии = "KB", "", "
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ИсторияОбменаБанкиКС.ИмяФайла КАК ИмяФайла,
	               |			ИсторияОбменаБанкиКС.Регистратор КАК Регистратор
	               |		ИЗ
	               |			РегистрСведений.ИсторияОбменаБанкиКС КАК ИсторияОбменаБанкиКС
	               |		ГДЕ
	               |			(ИсторияОбменаБанкиКС.Организация = &Организация)
				   |            И (ГОД(ИсторияОбменаБанкиКС.Дата) = ГОД(&Дата))) КАК ВложенныйЗапрос
	               |		ПО ФайлыОбмена.ИмяФайлаЗагрузки = ВложенныйЗапрос.ИмяФайла ")  + "
	               |ГДЕ
	               |	ФайлыОбмена.Ссылка = &Ссылка
	               |	И ФайлыОбмена.Загрузить = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки,
	               |	ТипОбъекта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОбъектыОбмена.ИмяФайлаЗагрузки,
	               |	ОбъектыОбмена.Формат,
	               |	ОбъектыОбмена.Объект,
	               |	ОбъектыОбмена.ОписаниеОшибки,
	               |	ОбъектыОбмена.Описание
	               |ИЗ
	               |	Документ.ЗаданиеНаИмпортДанныхБанкиКС.ОбъектыОбмена КАК ОбъектыОбмена
	               |ГДЕ
	               |	ОбъектыОбмена.Ссылка = &Ссылка";

	Возврат ТекстЗапроса;	
	
КонецФункции	

Функция ТекстЗапросаЗадание_TXL()
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Задание.Номер,
	               |	Задание.Дата,
	               |	Задание.ДатаКон,
	               |	Задание.ДатаНач,
	               |	Задание.Организация,
	               |	Задание.Комментарий,
	               |	Задание.КассовыйОрган,
	               |	Задание.ВидОбмена,
	               |	Задание.НастройкаОбмена,
	               |	Задание.НастройкаФорматов
	               |ИЗ
	               |	Документ.ЗаданиеНаИмпортДанныхБанкиКС КАК Задание
	               |ГДЕ
	               |	Задание.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВЫБОР 
				   |         КОГДА ФайлыОбмена.ТипОбъекта = ""Структура""
				   |                ТОГДА ФайлыОбмена.ИмяФайлаЗагрузки 
				   |                ИНАЧЕ """"
				   |    КОНЕЦ КАК ФайлСтруктура, 
				   |	ВЫБОР 
				   |         КОГДА ФайлыОбмена.ТипОбъекта = ""Структура""
				   |                ТОГДА """" 
				   |                ИНАЧЕ ФайлыОбмена.ИмяФайлаЗагрузки
				   |    КОНЕЦ КАК ОсновнойФайл, 
	               |	ВЫБОР 
				   |         КОГДА ФайлыОбмена.ТипОбъекта = ""Структура""
				   |                ТОГДА ФайлыОбмена.Формат
				   |                ИНАЧЕ """"
				   |    КОНЕЦ КАК ФорматФайлаСтруктура,    
		   	       |	ВЫБОР 
				   |         КОГДА ФайлыОбмена.ТипОбъекта = ""Структура""
				   |                ТОГДА """"
				   |                ИНАЧЕ ФайлыОбмена.Формат
				   |    КОНЕЦ КАК ФорматОсновногоФайла,
	               |	ФайлыОбмена.ТипОбъекта                КАК ТипОбъекта,
		   	       |	ВЫБОР 
				   |         КОГДА ФайлыОбмена.ТипОбъекта = ""Структура""
				   |                ТОГДА """" 
				   |                ИНАЧЕ ФайлыОбмена.НомерСтроки
				   |    КОНЕЦ КАК НомерСтрокиОсновногоФайла, 
                   |	ВЫБОР 
				   |         КОГДА ФайлыОбмена.ТипОбъекта = ""Структура""
				   |                ТОГДА ФайлыОбмена.НомерСтроки 
				   |                ИНАЧЕ """"
				   |    КОНЕЦ КАК НомерСтрокиФайлаСтруктура, 
	               |	ФайлыОбмена.ОписаниеОшибки,
	               |	ФайлыОбмена.Описание, 
				   |	ВложенныйЗапрос.ИмяФайла,
	               |	ВложенныйЗапрос.Регистратор КАК Регистратор
	               |ИЗ
	               |	Документ.ЗаданиеНаИмпортДанныхБанкиКС.ФайлыОбмена КАК ФайлыОбмена
				   |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ИсторияОбменаБанкиКС.ИмяФайла КАК ИмяФайла,
	               |			ИсторияОбменаБанкиКС.Регистратор КАК Регистратор
	               |		ИЗ
	               |			РегистрСведений.ИсторияОбменаБанкиКС КАК ИсторияОбменаБанкиКС
	               |		ГДЕ
	               |			(ИсторияОбменаБанкиКС.Организация = &Организация)
				   |            И (ГОД(ИсторияОбменаБанкиКС.Дата) = ГОД(&Дата))) КАК ВложенныйЗапрос
	               |		ПО ФайлыОбмена.ИмяФайлаЗагрузки = ВложенныйЗапрос.ИмяФайла 
	               |ГДЕ
	               |	ФайлыОбмена.Ссылка = &Ссылка
	               |	И ФайлыОбмена.Загрузить = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО 
	               |	ТипОбъекта УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОбъектыОбмена.ИмяФайлаЗагрузки,
	               |	ОбъектыОбмена.Формат,
	               |	ОбъектыОбмена.Объект,
	               |	ОбъектыОбмена.ОписаниеОшибки,
	               |	ОбъектыОбмена.Описание
	               |ИЗ
	               |	Документ.ЗаданиеНаИмпортДанныхБанкиКС.ОбъектыОбмена КАК ОбъектыОбмена
	               |ГДЕ
	               |	ОбъектыОбмена.Ссылка = &Ссылка";

	Возврат ТекстЗапроса;	
	
КонецФункции	


// Возвращает соответствие для заполнения имен полей расшифровки
//
Функция ЧистаяСтруктураРасшифровки()
	
	СтруктураСекцииБД = Новый Соответствие;
	СтруктураСекцииБД.Вставить("НомерЛС", 		"");
	СтруктураСекцииБД.Вставить("ДатаВыписки", 	"");
	СтруктураСекцииБД.Вставить("СписокПП", 		"");
	СтруктураСекцииБД.Вставить("GUIDВыписки",	"");
	
	СтруктураСекцииБДПД = Новый Соответствие;
	СтруктураСекцииБДПД.Вставить("НомерПП",			""); 
	СтруктураСекцииБДПД.Вставить("ДатаПП",			""); 
	СтруктураСекцииБДПД.Вставить("GUID",			""); 
	СтруктураСекцииБДПД.Вставить("РасчСчПл",		""); 
	СтруктураСекцииБДПД.Вставить("ПечатныйОбраз",	""); 				
	
	СтруктураСекцииБДПДСТ = Новый Соответствие;
	СтруктураСекцииБДПДСТ.Вставить("КБК",			""); 
	СтруктураСекцииБДПДСТ.Вставить("ТипКБК",		""); 
	СтруктураСекцииБДПДСТ.Вставить("КодЦели",		""); 
	СтруктураСекцииБДПДСТ.Вставить("НомерБО",		""); 
	СтруктураСекцииБДПДСТ.Вставить("ОКАТО",			""); 
	СтруктураСекцииБДПДСТ.Вставить("Сумма",			""); 
	СтруктураСекцииБДПДСТ.Вставить("ЭтоСписание",	""); 
	
	СтруктураСекцииБДПЛ = Новый Соответствие;
	СтруктураСекцииБДПЛ.Вставить("НомерПП",			""); 
	СтруктураСекцииБДПЛ.Вставить("ДатаПП",			""); 
	СтруктураСекцииБДПЛ.Вставить("GUID",			""); 
	СтруктураСекцииБДПЛ.Вставить("РасчСчПл",		""); 
	СтруктураСекцииБДПЛ.Вставить("ПечатныйОбраз",	""); 				
	
	СтруктураСекцииБДПЛСТ = Новый Соответствие;
	СтруктураСекцииБДПЛСТ.Вставить("КБК",			""); 
	СтруктураСекцииБДПЛСТ.Вставить("ТипКБК",		""); 
	СтруктураСекцииБДПЛСТ.Вставить("КодЦели",		""); 
	СтруктураСекцииБДПЛСТ.Вставить("НомерБО",		""); 
	СтруктураСекцииБДПЛСТ.Вставить("ОКАТО",			""); 
	СтруктураСекцииБДПЛСТ.Вставить("Сумма",			""); 
	СтруктураСекцииБДПЛСТ.Вставить("ЭтоСписание",	""); 
	
	СтруктураСекцииBH = Новый Соответствие;
	СтруктураСекцииBH.Вставить("НомерЛС", 		"");
	СтруктураСекцииBH.Вставить("ДатаВыписки", 	"");
	СтруктураСекцииBH.Вставить("СписокПП", 		"");
	СтруктураСекцииBH.Вставить("GUIDВыписки",	"");
	
	СтруктураСекцииЗКР = Новый Соответствие;
	СтруктураСекцииЗКР.Вставить("НомерПП",		""); 
	СтруктураСекцииЗКР.Вставить("ДатаПП",		""); 
	СтруктураСекцииЗКР.Вставить("GUID",			""); 
	СтруктураСекцииЗКР.Вставить("РасчСчПл",		""); 
	СтруктураСекцииЗКР.Вставить("ПечатныйОбраз",""); 		 		
	
	СтруктураСекцииЗКРстр = Новый Соответствие;
	СтруктураСекцииЗКРстр.Вставить("КБК",			""); 
	СтруктураСекцииЗКРстр.Вставить("ТипКБК",		""); 
	СтруктураСекцииЗКРстр.Вставить("КодЦели",		""); 
	СтруктураСекцииЗКРстр.Вставить("НомерБО",		""); 
	СтруктураСекцииЗКРстр.Вставить("ОКАТО",			""); 
	СтруктураСекцииЗКРстр.Вставить("Сумма",			""); 
	СтруктураСекцииЗКРстр.Вставить("ЭтоСписание",	""); 
	
	СтруктураСекцииЗКРосн = Новый Соответствие;
	СтруктураСекцииЗКРосн.Вставить("ДокументОснованиеВид",	    ""); 
	СтруктураСекцииЗКРосн.Вставить("ДокументОснованиеНомер",    ""); 
	СтруктураСекцииЗКРосн.Вставить("ДокументОснованиеДата",	    ""); 
	СтруктураСекцииЗКРосн.Вставить("ДокументОснованиеПредмет",	""); 
		
	СтруктураСекцииЗВ = Новый Соответствие;
	СтруктураСекцииЗВ.Вставить("НомерПП",		""); 
	СтруктураСекцииЗВ.Вставить("ДатаПП",		""); 
	СтруктураСекцииЗВ.Вставить("GUID",			""); 
	СтруктураСекцииЗВ.Вставить("РасчСчПл",		""); 
	СтруктураСекцииЗВ.Вставить("ПечатныйОбраз",""); 	
	
	СтруктураСекцииЗВосн = Новый Соответствие;
	СтруктураСекцииЗВосн.Вставить("ДокументОснованиеВид",	    ""); 
	СтруктураСекцииЗВосн.Вставить("ДокументОснованиеНомер",     ""); 
	СтруктураСекцииЗВосн.Вставить("ДокументОснованиеДата",	    ""); 
	
	СтруктураСекцииЗВконтр = Новый Соответствие;
	СтруктураСекцииЗВконтр.Вставить("КонтрагентНаименование",	    ""); 
	СтруктураСекцииЗВконтр.Вставить("КонтрагентИНН",                ""); 
	СтруктураСекцииЗВконтр.Вставить("КонтрагентКПП",	            ""); 
	
	СтруктураСекцииЗВстр = Новый Соответствие;
	СтруктураСекцииЗВстр.Вставить("КБК",			""); 
	СтруктураСекцииЗВстр.Вставить("ТипКБК",		    ""); 
	СтруктураСекцииЗВстр.Вставить("КодЦели",		""); 
	СтруктураСекцииЗВстр.Вставить("НомерБО",		""); 
	СтруктураСекцииЗВстр.Вставить("ОКАТО",			""); 
	СтруктураСекцииЗВстр.Вставить("Сумма",			""); 
	СтруктураСекцииЗВстр.Вставить("ЭтоСписание",	""); 
	
	СтруктураСекцииПП = Новый Соответствие;
	СтруктураСекцииПП.Вставить("НомерПП",		    ""); 
	СтруктураСекцииПП.Вставить("ДатаПП",		    ""); 
	СтруктураСекцииПП.Вставить("GUID",			    ""); 
	СтруктураСекцииПП.Вставить("РасчСчПл",		    ""); 
	СтруктураСекцииПП.Вставить("ПечатныйОбраз",     ""); 		 		
	
	СтруктураСекцииППстр = Новый Соответствие;
	СтруктураСекцииППстр.Вставить("КБК",			""); 
	СтруктураСекцииППстр.Вставить("ТипКБК",		    ""); 
	СтруктураСекцииППстр.Вставить("КодЦели",		""); 
	СтруктураСекцииППстр.Вставить("НомерБО",		""); 
	СтруктураСекцииППстр.Вставить("ОКАТО",			""); 
	СтруктураСекцииППстр.Вставить("Сумма",			""); 
	СтруктураСекцииППстр.Вставить("ЭтоСписание",	""); 
	
	СтруктураСекцииSP = Новый Соответствие;
	СтруктураСекцииSP.Вставить("НомерЛС", 		"");
	СтруктураСекцииSP.Вставить("ДатаВыписки", 	"");
	СтруктураСекцииSP.Вставить("СписокПП", 		"");
	СтруктураСекцииSP.Вставить("GUIDВыписки",	"");
	
	СтруктураСекцииSPD = Новый Соответствие;
	СтруктураСекцииSPD.Вставить("GUID",			""); 
	СтруктураСекцииSPD.Вставить("ДатаПП",		""); 
	СтруктураСекцииSPD.Вставить("НомерПП",		""); 
	СтруктураСекцииSPD.Вставить("GUIDДок",		""); 
	СтруктураСекцииSPD.Вставить("НомерДок",		""); 
	СтруктураСекцииSPD.Вставить("ДатаДок",		""); 
	СтруктураСекцииSPD.Вставить("ИмяДок",		""); 
	//СтруктураСекцииSPD.Вставить("ПечатныйОбраз",""); 				
	
	СтруктураСекцииSPRR = Новый Соответствие;
	СтруктураСекцииSPRR.Вставить("Операция",	""); 
	СтруктураСекцииSPRR.Вставить("Дебет",		""); 
	СтруктураСекцииSPRR.Вставить("Кредит",		""); 
	СтруктураСекцииSPRR.Вставить("Сумма",		""); 
	
	РеквизитыСтруктурыВРасшифровке = Новый Соответствие;
	РеквизитыСтруктурыВРасшифровке.Вставить("BD", 		СтруктураСекцииБД);
	РеквизитыСтруктурыВРасшифровке.Вставить("BDPD", 	СтруктураСекцииБДПД);
	РеквизитыСтруктурыВРасшифровке.Вставить("BDPDST",	СтруктураСекцииБДПДСТ);
	РеквизитыСтруктурыВРасшифровке.Вставить("BDPL", 	СтруктураСекцииБДПЛ);
	РеквизитыСтруктурыВРасшифровке.Вставить("BDPLST",	СтруктураСекцииБДПЛСТ);
	РеквизитыСтруктурыВРасшифровке.Вставить("BH", 		СтруктураСекцииBH);
	РеквизитыСтруктурыВРасшифровке.Вставить("ZR", 	    СтруктураСекцииЗКР);
	РеквизитыСтруктурыВРасшифровке.Вставить("ZRST",	    СтруктураСекцииЗКРстр);
	РеквизитыСтруктурыВРасшифровке.Вставить("ZROSN",	СтруктураСекцииЗКРосн);
	РеквизитыСтруктурыВРасшифровке.Вставить("ZV", 	    СтруктураСекцииЗВ);
	РеквизитыСтруктурыВРасшифровке.Вставить("ZVDOCOSN",	СтруктураСекцииЗВосн);
	РеквизитыСтруктурыВРасшифровке.Вставить("ZVDOCPOL",	СтруктураСекцииЗВконтр);
	РеквизитыСтруктурыВРасшифровке.Вставить("ZVDOC",	СтруктураСекцииЗВстр);
	РеквизитыСтруктурыВРасшифровке.Вставить("PPT", 	    СтруктураСекцииПП);
	РеквизитыСтруктурыВРасшифровке.Вставить("PPST",	    СтруктураСекцииППстр);
	РеквизитыСтруктурыВРасшифровке.Вставить("SP",		СтруктураСекцииSP);
	РеквизитыСтруктурыВРасшифровке.Вставить("SPD",		СтруктураСекцииSPD);
	РеквизитыСтруктурыВРасшифровке.Вставить("SPRR",		СтруктураСекцииSPRR);
	
	Возврат РеквизитыСтруктурыВРасшифровке;

КонецФункции 

// создает таблицу значений для хранения данных из файла расшифровки
//
Функция СоздатьИсточник_Расшифровка(ЭлементБД, Идендификатор)
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	ПравилаОбмена = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(ЭлементБД);
	
	Для каждого ТекСтрока Из ПравилаОбмена Цикл
		
		Если Лев(ТекСтрока.ПолеФайлаПередачи, 3)    = "FK."
			ИЛИ Лев(ТекСтрока.ПолеФайлаПередачи, 5) = "FROM."
			ИЛИ Лев(ТекСтрока.ПолеФайлаПередачи, 7) = "SECURE."
			ИЛИ Лев(ТекСтрока.ПолеФайлаПередачи, 3) = "TO."    
			ИЛИ Сред(ТекСтрока.ПолеФайлаПередачи, 5, 5) = "CONTR" Тогда
			Продолжить;
		КонецЕсли;
	
		ТаблицаРезультат.Колонки.Добавить(СтрЗаменить(ТекСтрока.ПолеФайлаПередачи, ".", "_"));
	
	КонецЦикла;
	
	ТаблицаРезультат.Колонки.Добавить(Идендификатор + "_ID");
	
	Возврат ТаблицаРезультат;
	
Конецфункции

// заполняет таблицу для хранения входящих данных из файла "структура" 
//
Процедура ЗагрузитьИсточник_Расшифровка(Знач Текст, ТаблицаРезультат, ИдентификаторДокумента)
	
	Если ТипЗнч(Текст) <> Тип("ТекстовыйДокумент") Тогда
		ВрТекст = Текст;
		Текст = Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(ВрТекст);
	КонецЕсли;
	
	МассивКолонок = Новый Массив;
	НачалоБДПЛ    = 0;
	
	Для каждого ТекКолонка Из ТаблицаРезультат.Колонки Цикл
		МассивКолонок.Добавить(ТекКолонка.Имя);
		Если Лев(ТекКолонка.Имя, 4) = "BDPL" и НачалоБДПЛ = 0 Тогда
			 НачалоБДПЛ     = МассивКолонок.ВГраница();
		КонецЕсли;
	КонецЦикла; 
	
	ТаблицаРезультат.Колонки.Добавить("BD_GUID_ONE");
	
	МассивБД   = Новый Массив; 	// для хранения данных строки BD
	МассивБДПД = Новый Массив;	// для хранения данных строки BDPD
	МассивБДПЛ = Новый Массив;  // для хранения данных строки BDPL
	
	КоличествоСтрок = Текст.КоличествоСтрок();
	Для СчетчикСтрок=1 По КоличествоСтрок Цикл
		
		ТекущаяСтрока = Текст.ПолучитьСтроку(СчетчикСтрок);
		
		Если Лев(ТекущаяСтрока, 3) = "FK|"
			ИЛИ Лев(ТекущаяСтрока, 5) = "FROM|"
			ИЛИ Лев(ТекущаяСтрока, 7) = "SECURE|"
			ИЛИ Лев(ТекущаяСтрока, 3) = "TO|"
			ИЛИ Сред(ТекущаяСтрока, 5, 5) = "CONTR" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Лев(ТекущаяСтрока, 3) = "BD|" Тогда
			МассивБД = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивБД.Удалить(МассивБД.ВГраница());
		ИначеЕсли СокрЛП(ТекущаяСтрока) = "" Тогда   //если это пустая строка
			Продолжить;
		ИначеЕсли Лев(ТекущаяСтрока, 5) = "BDPD|" Тогда
			МассивБДПД = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивБДПД.Удалить(МассивБДПД.ВГраница());
		ИначеЕсли Лев(ТекущаяСтрока, 7) = "BDPDST|" Тогда
			МассивБДПДСТ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивБДПДСТ.Удалить(МассивБДПДСТ.ВГраница());
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.BD_ID = ИдентификаторДокумента;
			СчетчикКолонок = 0;
			Для СчетчикМассива = 1 По МассивБД.ВГраница() Цикл
				Если СчетчикКолонок > МассивКолонок.ВГраница() Тогда
					ВызватьИсключение НСтр("ru = 'Структура файла BD не соостветствует структуре формата'");
				КонецЕсли;
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивБД[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			Для СчетчикМассива = 1 По МассивБДПД.ВГраница() Цикл
				Если СчетчикКолонок > МассивКолонок.ВГраница() Тогда
					ВызватьИсключение НСтр("ru = 'Структура файла BD не соостветствует структуре формата'");
				КонецЕсли;
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивБДПД[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			Для СчетчикМассива = 1 По МассивБДПДСТ.ВГраница() Цикл
				Если СчетчикКолонок > МассивКолонок.ВГраница() Тогда
					ВызватьИсключение НСтр("ru = 'Структура файла BD не соостветствует структуре формата'");
				КонецЕсли;
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивБДПДСТ[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			
			НоваяСтрока["BD_GUID_ONE"] =  НоваяСтрока["BDPD_GUID"];
			
		ИначеЕсли Лев(ТекущаяСтрока, 5) = "BDPL|" Тогда
			МассивБДПЛ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивБДПЛ.Удалить(МассивБДПЛ.ВГраница());
		ИначеЕсли Лев(ТекущаяСтрока, 7) = "BDPLST|" Тогда
			МассивБДПЛСТ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивБДПЛСТ.Удалить(МассивБДПЛСТ.ВГраница());
			
			НоваяСтрока        = ТаблицаРезультат.Добавить();
			НоваяСтрока.BD_ID  = ИдентификаторДокумента;
			СчетчикКолонок     = 0;
			
			Для СчетчикМассива = 1 По МассивБД.ВГраница() Цикл
				Если СчетчикКолонок > МассивКолонок.ВГраница() Тогда
					ВызватьИсключение НСтр("ru = 'Структура файла BD не соостветствует структуре формата'");
				КонецЕсли;
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивБД[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			
			СчетчикКолонок     = НачалоБДПЛ;
			
			Для СчетчикМассива = 1 По МассивБДПЛ.ВГраница() Цикл
				Если СчетчикКолонок > МассивКолонок.ВГраница() Тогда
					ВызватьИсключение НСтр("ru = 'Структура файла BD не соостветствует структуре формата'");
				КонецЕсли;
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивБДПЛ[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			Для СчетчикМассива = 1 По МассивБДПЛСТ.ВГраница() Цикл
				Если СчетчикКолонок > МассивКолонок.ВГраница() Тогда
					ВызватьИсключение НСтр("ru = 'Структура файла BD не соостветствует структуре формата'");
				КонецЕсли;
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивБДПЛСТ[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;	
			
			НоваяСтрока["BD_GUID_ONE"] =  НоваяСтрока["BDPL_GUID"];
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьИсточник_Расшифровка_ВО(Знач Текст, ТаблицаРезультат, ИдентификаторДокумента)
	
	Если ТипЗнч(Текст) <> Тип("ТекстовыйДокумент") Тогда
		ВрТекст = Текст;
		Текст = Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(ВрТекст);
	КонецЕсли;
	
	МассивКолонок = Новый Массив;
	
	НачалоЗКР     = 0;
	НачалоЗВ      = 0;
	НачалоПП      = 0;
	НачалоЗВосн   = 0;
	НачалоЗВконтр = 0;
	
	Для каждого ТекКолонка Из ТаблицаРезультат.Колонки Цикл
		
		МассивКолонок.Добавить(ТекКолонка.Имя);
		
		Если Лев(ТекКолонка.Имя, 2) = "ZR" и НачалоЗКР = 0 Тогда
			 НачалоЗКР     = МассивКолонок.ВГраница();
		ИначеЕсли Лев(ТекКолонка.Имя, 2) = "ZV" и НачалоЗВ = 0 Тогда
			 НачалоЗВ      = МассивКолонок.ВГраница();
	    ИначеЕсли Лев(ТекКолонка.Имя, 8) = "ZVDOCOSN" и НачалоЗВосн = 0 Тогда
			 НачалоЗВосн   = МассивКолонок.ВГраница();
		ИначеЕсли Лев(ТекКолонка.Имя, 8) = "ZVDOCPOL" и НачалоЗВконтр = 0 Тогда
			 НачалоЗВконтр = МассивКолонок.ВГраница();
		ИначеЕсли Лев(ТекКолонка.Имя, 2) = "PP" и НачалоПП = 0 Тогда
			 НачалоПП      = МассивКолонок.ВГраница();	 
		КонецЕсли;
		
	КонецЦикла; 
	
	ТаблицаРезультат.Колонки.Добавить("BH_GUID_ONE");
	
	МассивГрупп    = Новый Массив; 	
	МассивЗКР      = Новый Массив;	
	МассивЗКРосн   = Новый Массив;
	МассивЗВ       = Новый Массив;
    МассивЗВдок    = Новый Массив;	
	МассивЗВ1      = Новый Массив;
	МассивЗВ2      = Новый Массив;
	МассивПП       = Новый Массив;
	МассивППст     = Новый Массив;
	
	КоличествоСтрок = Текст.КоличествоСтрок();   
	
	Для СчетчикСтрок=1 По КоличествоСтрок Цикл
		
		ТекущаяСтрока = Текст.ПолучитьСтроку(СчетчикСтрок);
		
		Если Лев(ТекущаяСтрока, 3) = "FK|"
			ИЛИ Лев(ТекущаяСтрока, 5) = "FROM|"
			ИЛИ Лев(ТекущаяСтрока, 3) = "TO|" Тогда
			Продолжить;
		КонецЕсли;
		Если Лев(ТекущаяСтрока, 3) = "BH|" Тогда
			МассивГрупп = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивГрупп.Удалить(МассивГрупп.ВГраница());
		ИначеЕсли Лев(ТекущаяСтрока, 3) = "ZR|" Тогда
			МассивЗКР = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивЗКР.Удалить(МассивЗКР.ВГраница());
		ИначеЕсли Лев(ТекущаяСтрока, 6) = "ZROSN|" Тогда
			МассивЗКРосн = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивЗКРосн.Удалить(МассивЗКРосн.ВГраница());
		ИначеЕсли Лев(ТекущаяСтрока, 5) = "ZRST|" Тогда
			МассивЗКРСтр = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивЗКРСтр.Удалить(МассивЗКРСтр.ВГраница());
			
			НоваяСтрока       = ТаблицаРезультат.Добавить();
			НоваяСтрока.BH_ID = ИдентификаторДокумента;
			СчетчикКолонок    = 0;
			
			Для СчетчикМассива = 1 По МассивГрупп.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивГрупп[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			Для СчетчикМассива = 1 По МассивЗКР.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивЗКР[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			Для СчетчикМассива = 1 По МассивЗКРосн.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивЗКРосн[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			Для СчетчикМассива = 1 По МассивЗКРСтр.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивЗКРСтр[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			
			НоваяСтрока["BH_GUID_ONE"] =  НоваяСтрока["ZR_GUID_FK"];
			
		ИначеЕсли Лев(ТекущаяСтрока, 3) = "ZV|" Тогда
			МассивЗВ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивЗВ.Удалить(МассивЗВ.ВГраница());
		ИначеЕсли Лев(ТекущаяСтрока, 6) = "ZVDOC|" Тогда
			МассивЗВдок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивЗВдок.Удалить(МассивЗВдок.ВГраница());
			
			НоваяСтрока       = ТаблицаРезультат.Добавить();
			НоваяСтрока.BH_ID = ИдентификаторДокумента;
			СчетчикКолонок    = 0;
			
			Для СчетчикМассива = 1 По МассивГрупп.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивГрупп[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;

			СчетчикКолонок = НачалоЗВ;
			
			Для СчетчикМассива = 1 По МассивЗВ.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивЗВ[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
            Для СчетчикМассива = 1 По МассивЗВдок.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивЗВдок[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			
			НоваяСтрока["BH_GUID_ONE"] =  НоваяСтрока["ZV_GUID_FK"];
			
        ИначеЕсли Лев(ТекущаяСтрока, 9) = "ZVDOCOSN|" Тогда
			МассивЗВ1 = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивЗВ1.Удалить(МассивЗВ1.ВГраница());
			
			СчетчикКолонок = НачалоЗВосн;
			
			Для СчетчикМассива = 1 По МассивЗВ1.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивЗВ1[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			
	    ИначеЕсли Лев(ТекущаяСтрока, 9) = "ZVDOCPOL|" Тогда
			МассивЗВ2 = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивЗВ2.Удалить(МассивЗВ2.ВГраница());
			
			СчетчикКолонок = НачалоЗВконтр;
			
			Для СчетчикМассива = 1 По МассивЗВ2.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивЗВ2[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			
		ИначеЕсли Лев(ТекущаяСтрока, 4) = "PPT|" Тогда
			МассивПП = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивПП.Удалить(МассивПП.ВГраница());
        ИначеЕсли Лев(ТекущаяСтрока, 5) = "PPST|" Тогда
			МассивППст = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, "|");
			МассивППст.Удалить(МассивППст.ВГраница());
			
			НоваяСтрока       = ТаблицаРезультат.Добавить();
			НоваяСтрока.BH_ID = ИдентификаторДокумента;
			СчетчикКолонок    = 0;
			
			Для СчетчикМассива = 1 По МассивГрупп.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивГрупп[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;

			СчетчикКолонок = НачалоПП;
		
			Для СчетчикМассива = 1 По МассивПП.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивПП[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
            Для СчетчикМассива = 1 По МассивППст.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивППст[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;  
			
			НоваяСтрока["BH_GUID_ONE"] =  НоваяСтрока["PPT_GUID_FK"];
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


// возвращает схему компоновки данных на основании правил загрузки документов
//
//Функция СоздатьСКДПоПравиламОбмена(ПравилаВыписки, ПравилаРасшифровки, ПравилаРасшифровки_ВО, ИсточникиДанных, ПараметрыГруппировок, 
//	СоответствиеРеквизитовШапки, РеквизитыСтруктурыВРасшифровке, СоответствиеРеквизитовГруппировок = Неопределено, 
//	ПроцедурыОбработкиСтрок, СписокУсловий = Неопределено, НомерДокумента = 0)
	
Функция СоздатьСКДПоПравиламОбмена(ДанныеДляИсточника, ИсточникиДанных, ПараметрыГруппировок, 
	СоответствиеРеквизитовШапки, РеквизитыСтруктурыВРасшифровке, СоответствиеРеквизитовГруппировок = Неопределено, 
	ПроцедурыОбработкиСтрок, СписокУсловий = Неопределено, НомерДокумента = 0)
	
	Перем Отказ; 
	Перем ОписаниеОшибки;
	Перем ПравилаВыписки;
	Перем ПравилаРасшифровки;
	Перем ПравилаРасшифровки_ВО;
	Перем ПравилаРасшифровки_ВС;
	
	ДанныеДляИсточника.Свойство("ФорматОсновногоФайла", 	ПравилаВыписки);
	ДанныеДляИсточника.Свойство("ФорматФайлаСтруктура", 	ПравилаРасшифровки);
	ДанныеДляИсточника.Свойство("ФорматФайлаСтруктура_ВО", 	ПравилаРасшифровки_ВО);
	ДанныеДляИсточника.Свойство("ФорматФайлаСтруктура_ВС", 	ПравилаРасшифровки_ВС);
	
	Отказ = Ложь;
	
	Если СписокУсловий = Неопределено Тогда    // условия, которые заданы ключом  УСЛОВИЕФОРМИРОВАНИЯ.<ИмяУсловия>
		СписокУсловий = Новый СписокЗначений;
	КонецЕсли;
	
	// зададим параметры для обработки выражений вычисляемых полей СКД
	РазрешенныеОбщиеМодули = Новый Массив;
	РазрешенныеОбщиеМодули.Добавить(ВРЕГ("БиблиотекаФункцийОбмена")); 
	
	ЗаменяемыеСлова = Новый Массив;
	ЗаменяемыеСлова.Добавить(ВРЕГ("Значение"));
	
	ЗаменяющиеСлова = Новый Массив;
	ЗаменяющиеСлова.Добавить("<ЗНАЧЕНИЕ>");
	//
	
	СоответствиеРеквизитовГруппировок = Новый Соответствие;
	ПараметрыГруппировок = Новый Соответствие;
	СоответствиеРеквизитовШапки	= Новый Соответствие;
	
	// заполняем структуру 
	РеквизитыСтруктурыВРасшифровке    = ЧистаяСтруктураРасшифровки();
			
	ПравилаОбмена = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(ПравилаВыписки);
	ОписаниеТипаСтроки = ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(150);
	ПравилаОбмена.Колонки.Добавить("ИмяПоляОбъекта", ОписаниеТипаСтроки);
	ПравилаОбмена.Колонки.Добавить("ЗаголовокПоляОбъекта", ОписаниеТипаСтроки);
	
	ИсточникиШапки = Новый Массив; // в массив добавим имена секций, где задаются реквизиты объекта. потом объединим все эти имена в одно имя
	ВызывалиРеквизитыШапки = Новый Массив; // содержит имена секций, из полей которых были вызываны поля шапки. необходимо для связи
	ОбработанныеПравилаОбмена = ПравилаОбмена.СкопироватьКолонки();
	ОбработанныеПравилаОбмена.Колонки.Добавить("ИсточникДанных");   // имя создаваемого источника данных
	ОбработанныеПравилаОбмена.Колонки.Добавить("ВычисляемоеВыражение");   // выражение вычисляемого поля компоновки данных
	ОбработанныеПравилаОбмена.Колонки.Добавить("Параметры");	// массив структур, содержащих параметры
	ОбработанныеПравилаОбмена.Колонки.Добавить("ИспользованныеРеквизиты");	// массив, содержащий имена использованных реквизитов
	
	Для каждого ТекущееПравило Из ПравилаОбмена Цикл
		// Запомним заголовок секции
		ЗаголовокПоляОбъекта = Лев(ТекущееПравило.ПолеФайлаПередачи, Найти(ТекущееПравило.ПолеФайлаПередачи, ".")-1);
		
		ЭтоПолеОбъекта 	= Ложь;
		ПутьКДанным		= "";
		
		Если Найти(ТекущееПравило.ПолеОбъекта, ";") > 0 Тогда
			// в поле объекта описано несколько загружаемых полей и/или структур
			ПоляТекущегоПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущееПравило.ПолеОбъекта, ";");
		Иначе
			// в поле описано одно загружаемое поле
			ПоляТекущегоПоля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущееПравило.ПолеОбъекта);
		КонецЕсли;
		Если ПоляТекущегоПоля.Количество() = 1 Тогда
			ПутьКДанным = ПоляТекущегоПоля[0];	
		КонецЕсли;  
		
		// каждое загружаемое поле разобьем на составные части
		Для каждого ЗагружаемоеПолеТекущегоПоля Из ПоляТекущегоПоля Цикл
			Если Найти(ЗагружаемоеПолеТекущегоПоля, ".")>0 Тогда
				СоставЗагружаемогоПоляТекущегоПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЗагружаемоеПолеТекущегоПоля, ".");
			Иначе
				СоставЗагружаемогоПоляТекущегоПоля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗагружаемоеПолеТекущегоПоля);
			КонецЕсли;
			Если СоставЗагружаемогоПоляТекущегоПоля.Количество() = 2 Тогда
				Если ВРЕГ(СокрЛП(СоставЗагружаемогоПоляТекущегоПоля[0])) = "ОБЪЕКТ" Тогда
					ЭтоПолеОбъекта = Истина;
					Если ИсточникиШапки.Найти(ЗаголовокПоляОбъекта) = Неопределено Тогда
						ИсточникиШапки.Добавить(ЗаголовокПоляОбъекта);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ИспользованныеРеквизиты		= Новый Массив;
			ИспользуемыеПараметры = Новый Массив;
			ВычисляемоеВыражение = "";
			Если ПустаяСтрока(ТекущееПравило.ПорядокЗаполнения) Тогда
				ВычисляемоеВыражение 	= ТекущееПравило.ПолеФайлаПередачи;
			Иначе
				//Если Найти(ВРег(ТекущееПравило.ПорядокЗаполнения), "СОСТОЯНИЕПЛАТЕЖНОРАСЧЕТНЫХДОКУМЕНТОВ")>0 Тогда
				//	ЧастиРавенства = РазобратьРавенство(ОбрабатываемаяСтрока.ПорядокЗаполнения);
				//	
				//	ВычисляемоеПолеПутьКДанным 	= ЧастиРавенства[0];	
				//	ВычисляемоеПолеВыражение	= ОбщийМодульСКД.ПреобразоватьВыражениеСКД(ЧастиРавенства[1], РазрешенныеОбщиеМодули, ЗаменяемыеСлова, ЗаменяющиеСлова,, Отказ, ОписаниеОшибки);
				//	ВычисляемоеПолеВыражение	= СтрЗаменить(ВычисляемоеПолеВыражение, "<ЗНАЧЕНИЕ>", ОбрабатываемаяСтрока.ПолеФайлаПередачи);	
				//Иначе
				ВычисляемоеВыражение	= ОбщийМодульСКД.ПреобразоватьВыражениеСКД(ТекущееПравило.ПорядокЗаполнения, РазрешенныеОбщиеМодули, ЗаменяемыеСлова, ЗаменяющиеСлова, ИспользованныеРеквизиты, Отказ, ОписаниеОшибки);
				ВычисляемоеВыражение 	= СтрЗаменить(ВычисляемоеВыражение, "<ЗНАЧЕНИЕ>", ТекущееПравило.ПолеФайлаПередачи);
				//КонецЕсли;
				Если ПустаяСтрока(ВычисляемоеВыражение) Тогда
					ВычисляемоеВыражение = ТекущееПравило.ПолеФайлаПередачи;
				КонецЕсли;
			КонецЕсли;
			Если СоставЗагружаемогоПоляТекущегоПоля.Количество() = 2 И ВРЕГ(СоставЗагружаемогоПоляТекущегоПоля[0]) = "УСЛОВИЕФОРМИРОВАНИЯ" Тогда
				СписокУсловий.Добавить(""+СоставЗагружаемогоПоляТекущегоПоля[0]+СоставЗагружаемогоПоляТекущегоПоля[1]);
			КонецЕсли;
			
			НовСтрока = ОбработанныеПравилаОбмена.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекущееПравило);
			НовСтрока.ПолеОбъекта			= ЗагружаемоеПолеТекущегоПоля;
			НовСтрока.ЗаголовокПоляОбъекта	= ЗаголовокПоляОбъекта;
			НовСтрока.ИсточникДанных		= ЗаголовокПоляОбъекта;
			НовСтрока.ВычисляемоеВыражение	= ВычисляемоеВыражение;
			НовСтрока.Параметры				= ИспользуемыеПараметры;
			НовСтрока.ИспользованныеРеквизиты	= ИспользованныеРеквизиты;
			
			Если ВРЕГ(ТекущееПравило.ПолеОбъекта) = "ОБЪЕКТ.ЛИЦЕВОЙСЧЕТ" Тогда
				НовСтрока = ОбработанныеПравилаОбмена.Добавить();
				НовСтрока.ПолеОбъекта = "НомерЛицевогоСчетаФайла";
				НовСтрока.ПолеФайлаПередачи = ТекущееПравило.ПолеФайлаПередачи;
				НовСтрока.ВычисляемоеВыражение	= ТекущееПравило.ПолеФайлаПередачи;
				НовСтрока.ИспользованныеРеквизиты	= Новый Массив;
				НовСтрока.ИсточникДанных		= ЗаголовокПоляОбъекта;

			КонецЕсли;
		КонецЦикла; 
		
		Если Найти(ВРЕГ(ТекущееПравило.Условие), "НОВАЯСТРОКА")>0 Тогда
			
			Если ПараметрыГруппировок.Получить(ЗаголовокПоляОбъекта) = Неопределено Тогда
				ПараметрыГруппировок.Вставить(ЗаголовокПоляОбъекта, ТекущееПравило.ТабличнаяЧасть);
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекущееПравило.ДопДействия) Тогда
			
			ДопДействия = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущееПравило.ДопДействия, ";");
			Для каждого ТекДопДействие Из ДопДействия Цикл
				Если ПустаяСтрока(ТекДопДействие) Тогда
					Продолжить;
				КонецЕсли;					
					
				// разложим равенство
				ЧастиРавенства = РазобратьРавенство(ТекДопДействие);
				Если ЧастиРавенства.Количество() = 2 Тогда
					// левая часть равенства - имя вычисляемого поля, правая часть - выражение
					ДопСтрока = ОбработанныеПравилаОбмена.Добавить();
					ЗаполнитьЗначенияСвойств(ДопСтрока, НовСтрока);
					ДопСтрока.ПолеОбъекта			= СокрЛП(ЧастиРавенства[0]);
					ИспользованныеРеквизиты		= Новый Массив;
					ВычисляемоеВыражение	= ОбщийМодульСКД.ПреобразоватьВыражениеСКД(СокрЛП(ЧастиРавенства[1]), РазрешенныеОбщиеМодули, ЗаменяемыеСлова, ЗаменяющиеСлова, ИспользованныеРеквизиты, Отказ, ОписаниеОшибки);
					ВычисляемоеВыражение 	= СтрЗаменить(ВычисляемоеВыражение, "<ЗНАЧЕНИЕ>", ТекущееПравило.ПолеФайлаПередачи);
					Для Каждого ИспользованныйРеквизит Из ИспользованныеРеквизиты Цикл
						НайденаСтрока = ОбработанныеПравилаОбмена.Найти(ИспользованныйРеквизит, "ПолеОбъекта"); 
						Если НайденаСтрока <> Неопределено Тогда
							Если НайденаСтрока.ВычисляемоеВыражение<>НайденаСтрока.ПолеФайлаПередачи Тогда
								ВычисляемоеВыражение = СтрЗаменить(ВычисляемоеВыражение, ИспользованныйРеквизит, НайденаСтрока.ВычисляемоеВыражение);
								Если ВызывалиРеквизитыШапки.Найти(ЗаголовокПоляОбъекта) = Неопределено Тогда
									ВызывалиРеквизитыШапки.Добавить(ЗаголовокПоляОбъекта);
								КонецЕсли;
							Иначе
								// поля, у которых выражение = имя поля файла не добавляются в вычисляемые поля и поэтому не будут доступны по 
								// имени поля
								// Поэтому просто не меняем выражение
								
								Если ВызывалиРеквизитыШапки.Найти(ЗаголовокПоляОбъекта) = Неопределено Тогда
									ВызывалиРеквизитыШапки.Добавить(ЗаголовокПоляОбъекта);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					ДопСтрока.ВычисляемоеВыражение 	= ВычисляемоеВыражение;
				КонецЕсли;
			
			КонецЦикла; 			
			
		КонецЕсли;
	
	КонецЦикла;
	
	// теперь необходимо использованные в формулах реквизиты заменить на формулы вычисления соответствующих реквизитов или на параметры
	Для каждого ОбработанноеПравило Из ОбработанныеПравилаОбмена Цикл
		
		ИспользованныеРеквизиты = ОбработанноеПравило.ИспользованныеРеквизиты;
		Если ИспользованныеРеквизиты.Количество()>0 Тогда
			ВычисляемоеВыражение = ОбработанноеПравило.ВычисляемоеВыражение;
			Для Каждого ИспользованныйРеквизит Из ИспользованныеРеквизиты Цикл
				//Если Лев(СокрЛП(ВРЕГ(ИспользованныйРеквизит)), 7) = "ОБЪЕКТ." Тогда
				НайденаСтрока = ОбработанныеПравилаОбмена.Найти(ИспользованныйРеквизит, "ПолеОбъекта"); 
				Если НайденаСтрока <> Неопределено Тогда
					ВычисляемоеВыражение = СтрЗаменить(ВычисляемоеВыражение, ИспользованныйРеквизит, НайденаСтрока.ВычисляемоеВыражение);
					Если ВызывалиРеквизитыШапки.Найти(ЗаголовокПоляОбъекта) = Неопределено Тогда
						ВызывалиРеквизитыШапки.Добавить(ЗаголовокПоляОбъекта);
					КонецЕсли;
				//	КонецЕсли;
				//ИначеЕсли ВРЕГ(СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИспользованныйРеквизит, ".")[0]) = "КАССОВЫЙОРГАН" Тогда
				//	СоставПараметра = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИспользованныйРеквизит, ".");
				//	ИмяПараметра = "";
				//	Для каждого ЭлементСоставаПараметра Из СоставПараметра Цикл
				//		ИмяПараметра = "."+ЭлементСоставаПараметра;
				//	КонецЦикла; 
				//	ИмяПараметра = Сред(ИмяПараметра, 2);
					
			    Иначе
					ИмяПараметра = СтрЗаменить(ИспользованныйРеквизит, ".", "_"); 
					ИспользуемыеПараметры.Добавить(Новый Структура("ИмяПараметра, РеквизитПараметра", ИмяПараметра, ИспользованныйРеквизит));
					ВычисляемоеВыражение = СтрЗаменить(ВычисляемоеВыражение, ИспользованныйРеквизит, "&"+ИмяПараметра);
				КонецЕсли;						
			КонецЦикла;
			ОбработанноеПравило.ВычисляемоеВыражение = ВычисляемоеВыражение;
		КонецЕсли;
		
	
	КонецЦикла; 
	
	ОбработанныеПравилаОбмена.Колонки.Добавить("Количество",	Новый ОписаниеТипов("Число"));
	ОбработанныеПравилаОбмена.Колонки.Добавить("Дубль",			Новый ОписаниеТипов("Булево"));
	ОбработанныеПравилаОбмена.ЗаполнитьЗначения(1, 		"Количество");
	ОбработанныеПравилаОбмена.ЗаполнитьЗначения(Ложь,	"Дубль");
		
	КопияОбработанныеПравила = ОбработанныеПравилаОбмена.Скопировать(, "ПолеФайлаПередачи, Количество");
	//КопияОбработанныеПравила.Колонки.Добавить("Количество");
	//КопияОбработанныеПравила.ЗаполнитьЗначения(1, "Количество");
	
	КопияОбработанныеПравила.Свернуть("ПолеФайлаПередачи", "Количество");
	
	ИдентификаторСтрокФормата = Сред(ПравилаВыписки.Наименование, 3,2);
	
	/////////////////////////////////////////////////
	// формируем схему
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновки.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя 					= "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных	= "Local";
	
	
	НастройкиПоУмолчанию = СхемаКомпоновки.НастройкиПоУмолчанию;
	//ТекущийУровеньГруппировки = НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	//ТекущийУровеньГруппировки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	ТипыКассовыхОрганов = Новый Массив;
	ТипыКассовыхОрганов.Добавить(Тип("СправочникСсылка.Казначейства"));
	ТипыКассовыхОрганов.Добавить(Тип("СправочникСсылка.Банки"));
	ПараметрКассовыйОрган = СхемаКомпоновки.Параметры.Добавить();
	ПараметрКассовыйОрган.Имя 						= "КассовыйОрган";
	ПараметрКассовыйОрган.ТипЗначения 				= Новый ОписаниеТипов(ТипыКассовыхОрганов);
	ПараметрКассовыйОрган.ОграничениеИспользования	= Истина;
	Для каждого ИспользуемыйПараметр Из ИспользуемыеПараметры Цикл
		Если СхемаКомпоновки.Параметры.Найти(ИспользуемыйПараметр) = Неопределено Тогда
			НовыйПараметр = СхемаКомпоновки.Параметры.Добавить();
			НовыйПараметр.Имя = ИспользуемыйПараметр.ИмяПараметра;
			НовыйПараметр.Заголовок = ИспользуемыйПараметр.РеквизитПараметра; 
			НовыйПараметр.ОграничениеИспользования = Истина;
		КонецЕсли;
	КонецЦикла; 
	
	НаборДанныхШапка = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанныхШапка.Имя 			= ИдентификаторСтрокФормата;
	НаборДанныхШапка.ИсточникДанных	= "ИсточникДанных1";
	НаборДанныхШапка.ИмяОбъекта 	= ИдентификаторСтрокФормата;
	
	ДобавитьПолеНабораДанных(НаборДанныхШапка, ИдентификаторСтрокФормата+"_ID", ИдентификаторСтрокФормата+".ID");
	
	ГруппировкаШапка = НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаШапка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	ИдентификаторСтрокФорматаШапки  = ИдентификаторСтрокФормата;
	//----------------------------------------------------------------------------------
	СтрокиОстатковПример            = ОбработанныеПравилаОбмена.НайтиСтроки(Новый Структура("ТабличнаяЧасть", "Остатки"));
	
	НаборДанныхОстатки              = НаборДанныхШапка;
	
	Если СтрокиОстатковПример.Количество() > 0 Тогда
		 СтрокаОстатковПример = СтрокиОстатковПример[0];
		 // для остатков выделена отдельная секция
		 
		 Если СтрокаОстатковПример.ЗаголовокПоляОбъекта <> ИдентификаторСтрокФормата Тогда
			 ИдентификаторСтрокФормата = СтрокаОстатковПример.ЗаголовокПоляОбъекта;
			 
			 НаборДанныхОстатки                  = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
			 НаборДанныхОстатки.Имя 			 = ИдентификаторСтрокФормата;
			 НаборДанныхОстатки.ИсточникДанных   = "ИсточникДанных1";
			 НаборДанныхОстатки.ИмяОбъекта 	     = ИдентификаторСтрокФормата;
			
			 ДобавитьПолеНабораДанных(НаборДанныхОстатки, ИдентификаторСтрокФормата+"_ID", ИдентификаторСтрокФормата+".ID");
		 КонецЕсли;
	КонецЕсли;
	//----------------------------------------------------------------------------------

	
	// проверим наличие табличной части ОСТАТКИ
	
	// табличная часть Остатки формируется в цикле из одной строки исходной таблицы
	ТаблицаОстатки = Новый ТаблицаЗначений;
	ТаблицаОстатки.Колонки.Добавить("ИсточникСредств");
	ТаблицаОстатки.Колонки.Добавить("Показатель");
	ТаблицаОстатки.Колонки.Добавить("ОстатокНаНачалоДня");
	ТаблицаОстатки.Колонки.Добавить("ОстатокНаКонецДня");
	
	ДобавляемыеПоляИсточника = Новый Массив;
	ИсходныеНастройкиОстатки = ОбработанныеПравилаОбмена.НайтиСтроки(Новый Структура("ТабличнаяЧасть", "Остатки"));
	ДобавитьСтроку           = Истина;
	МассивПолейОстатков      = Новый Массив;
	Для Каждого Остаток Из  ИсходныеНастройкиОстатки Цикл
		МассивПолейОстатков.Добавить(ВРег(Остаток.ПолеОбъекта))
	КонецЦикла;
	ИскомаяПозиция           = "ОСТАТОКНАНАЧАЛОДНЯ";
	Пока МассивПолейОстатков.Найти("ОСТАТОКНАКОНЕЦДНЯ") <> Неопределено Цикл
		ПозицияОстатка       = МассивПолейОстатков.Найти(ИскомаяПозиция);
		ОбрабатываемаяСтрока = ИсходныеНастройкиОстатки[ПозицияОстатка];
		Если ДобавитьСтроку Тогда
			НоваяНастройка   = ТаблицаОстатки.Добавить();
			ДобавитьСтроку   = Ложь;
		КонецЕсли;
		Если ПустаяСтрока(ОбрабатываемаяСтрока.Условие) Тогда
			ДобавитьСтроку   = Истина;
		КонецЕсли;
		//Для ТекНомерСтроки=ИсходнаяНастройка.НомерСтрокиНачало По ИсходнаяНастройка.НомерСтрокиКонец Цикл
			//ОбрабатываемаяСтрока = ПравилаОбмена.Найти(ТекНомерСтроки, "НомерСтроки");
			Если ВРег(ОбрабатываемаяСтрока.ПолеОбъекта) = "ОСТАТОКНАНАЧАЛОДНЯ" Тогда
				Если ПустаяСтрока(ОбрабатываемаяСтрока.ПорядокЗаполнения) Тогда
					НоваяНастройка.ОстатокНаНачалоДня = ОбрабатываемаяСтрока.ПолеФайлаПередачи;
				Иначе
					НоваяНастройка.ОстатокНаНачалоДня = ПреобразоватьПодСКД(СтрЗаменить(ОбрабатываемаяСтрока.ПорядокЗаполнения, "Значение", ОбрабатываемаяСтрока.ПолеФайлаПередачи));
				КонецЕсли;
				Если ДобавляемыеПоляИсточника.Найти(ОбрабатываемаяСтрока.ПолеФайлаПередачи) = Неопределено Тогда
					ДобавляемыеПоляИсточника.Добавить(ОбрабатываемаяСтрока.ПолеФайлаПередачи);
				КонецЕсли;
				МассивПолейОстатков[ПозицияОстатка] = "ОСТАТОК&НАНАЧАЛОДНЯ";
				ИскомаяПозиция           = "ОСТАТОКНАКОНЕЦДНЯ";
			ИначеЕсли ВРег(ОбрабатываемаяСтрока.ПолеОбъекта) = "ОСТАТОКНАКОНЕЦДНЯ" Тогда
				Если ПустаяСтрока(ОбрабатываемаяСтрока.ПорядокЗаполнения) Тогда
					НоваяНастройка.ОстатокНаКонецДня = ОбрабатываемаяСтрока.ПолеФайлаПередачи;
				Иначе
					НоваяНастройка.ОстатокНаКонецДня = ПреобразоватьПодСКД(СтрЗаменить(ОбрабатываемаяСтрока.ПорядокЗаполнения, "Значение", ОбрабатываемаяСтрока.ПолеФайлаПередачи));
				КонецЕсли;
				Если ДобавляемыеПоляИсточника.Найти(ОбрабатываемаяСтрока.ПолеФайлаПередачи) = Неопределено Тогда
					ДобавляемыеПоляИсточника.Добавить(ОбрабатываемаяСтрока.ПолеФайлаПередачи);
				КонецЕсли;
				МассивПолейОстатков[ПозицияОстатка] = "ОСТАТОК&НАКОНЕЦДНЯ";
				ИскомаяПозиция           = "ОСТАТОКНАНАЧАЛОДНЯ";
			ИначеЕсли ВРег(ОбрабатываемаяСтрока.ПолеОбъекта) = "ПОКАЗАТЕЛЬ" Тогда
					
			ИначеЕсли ВРег(ОбрабатываемаяСтрока.ПолеОбъекта) = "ИСТОЧНИКСРЕДСТВ" Тогда
				
			КонецЕсли;
			Если Не ПустаяСтрока(ОбрабатываемаяСтрока.ДопДействия) Тогда
				ФункцияВычисленияПараметра(ОбрабатываемаяСтрока.ДопДействия, "Строка.Показатель",		НоваяНастройка.Показатель);		
				ФункцияВычисленияПараметра(ОбрабатываемаяСтрока.ДопДействия, "Строка.ИсточникСредств", 	НоваяНастройка.ИсточникСредств);		
			КонецЕсли;
		//КонецЦикла;
	КонецЦикла; 
	
	// теперь из полученной таблицы сформируем источник данных "запрос", с которым соединимся в цикле
	// в разных итерациях цикла подставим разные колонки исходного файла или разные предопределенные значения
	Если ТаблицаОстатки.Количество() > 0 Тогда
	
		ТекстЗапросаЦикла = "";
		ТекущийСчетчикЦикла = 0;
		ВыражениеИсточникСредств = "Выбор"+Символы.ПС;
		ВыражениеПоказатель = "Выбор"+Символы.ПС;
		ВыражениеОстатокНаНачалоДня = "Выбор"+Символы.ПС;
		ВыражениеОстатокНаКонецДня = "Выбор"+Символы.ПС;
		Для каждого ТекНастройкаОстатков Из ТаблицаОстатки Цикл
			Если ТекущийСчетчикЦикла = 0 Тогда
				ТекстЗапросаЦикла = "ВЫБРАТЬ
				                    |	"""+ИдентификаторСтрокФормата+ "_" + НомерДокумента + """ КАК ID,
									|	""Остатки"" КАК ИмяСекции,
				                    |	0 КАК СчетчикЦикла
									|{ВЫБРАТЬ
									|ID,
									|ИмяСекции,
									|СчетчикЦикла}";
				ВыражениеИсточникСредств 	= ВыражениеИсточникСредств 		+ "Когда Итератор.СчетчикЦикла = 0 Тогда " + ТекНастройкаОстатков.ИсточникСредств		+ Символы.ПС;								
				ВыражениеПоказатель 		= ВыражениеПоказатель 			+ "Когда Итератор.СчетчикЦикла = 0 Тогда " + ТекНастройкаОстатков.Показатель			+ Символы.ПС;								
				ВыражениеОстатокНаНачалоДня	= ВыражениеОстатокНаНачалоДня	+ "Когда Итератор.СчетчикЦикла = 0 Тогда " + ТекНастройкаОстатков.ОстатокНаНачалоДня	+ Символы.ПС;								
				ВыражениеОстатокНаКонецДня 	= ВыражениеОстатокНаКонецДня 	+ "Когда Итератор.СчетчикЦикла = 0 Тогда " + ТекНастройкаОстатков.ОстатокНаКонецДня		+ Символы.ПС;
			Иначе
				ТекстЗапросаЦикла = ТекстЗапросаЦикла + "
									|Объединить Все
									|ВЫБРАТЬ
				                    |	"""+ИдентификаторСтрокФормата+ "_" + НомерДокумента +""",
				                    |	""Остатки"",
				                    |	" + ТекущийСчетчикЦикла;
				ВыражениеИсточникСредств 	= ВыражениеИсточникСредств 		+ "Когда Итератор.СчетчикЦикла = " + ТекущийСчетчикЦикла + " Тогда " + ТекНастройкаОстатков.ИсточникСредств		+ Символы.ПС;								
				ВыражениеПоказатель 		= ВыражениеПоказатель 			+ "Когда Итератор.СчетчикЦикла = " + ТекущийСчетчикЦикла + " Тогда " + ТекНастройкаОстатков.Показатель			+ Символы.ПС;								
				ВыражениеОстатокНаНачалоДня	= ВыражениеОстатокНаНачалоДня	+ "Когда Итератор.СчетчикЦикла = " + ТекущийСчетчикЦикла + " Тогда " + ТекНастройкаОстатков.ОстатокНаНачалоДня	+ Символы.ПС;								
				ВыражениеОстатокНаКонецДня 	= ВыражениеОстатокНаКонецДня 	+ "Когда Итератор.СчетчикЦикла = " + ТекущийСчетчикЦикла + " Тогда " + ТекНастройкаОстатков.ОстатокНаКонецДня	+ Символы.ПС;
			КонецЕсли;			
			ТекущийСчетчикЦикла = ТекущийСчетчикЦикла+1;
		КонецЦикла; 
		ВыражениеИсточникСредств 	= ВыражениеИсточникСредств 		+ "Конец";								
		ВыражениеПоказатель 		= ВыражениеПоказатель 			+ "Конец";
		ВыражениеОстатокНаНачалоДня	= ВыражениеОстатокНаНачалоДня	+ "Конец";
		ВыражениеОстатокНаКонецДня 	= ВыражениеОстатокНаКонецДня 	+ "Конец";
	
		// необходимо добавить используемые поля в источник данных
		// добавить источник данных запрос и сделать соединение таблиц
		// добавить вычисляемые поля
		// добавленные вычисляеме поля поместить в новую группировку, по "СчетчикЦикла"
		Для каждого ТекДобавляемоеПоле Из ДобавляемыеПоляИсточника Цикл
			ДобавитьПолеВНаборДанных(НаборДанныхОстатки, ТекДобавляемоеПоле);		
		КонецЦикла;
	
		НаборДанныхЗапрос = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		НаборДанныхЗапрос.Имя 							= "ИтераторОстатки";
		НаборДанныхЗапрос.ИсточникДанных 				= "ИсточникДанных1";
		НаборДанныхЗапрос.АвтоЗаполнениеДоступныхПолей	= Ложь;
		НаборДанныхЗапрос.Запрос 						= ТекстЗапросаЦикла;
		НовоеПоле = НаборДанныхЗапрос.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПоле.Поле 			= "ID";
		НовоеПоле.ПутьКДанным	= "Итератор.ID";
		НовоеПоле = НаборДанныхЗапрос.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПоле.Поле 			= "СчетчикЦикла";
		НовоеПоле.ПутьКДанным	= "Итератор.СчетчикЦикла";
		НовоеПоле.Заголовок		= "Остатки.Итератор.СчетчикЦикла";
		НовоеПоле = НаборДанныхЗапрос.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПоле.Поле 			= "ИмяСекции";
		НовоеПоле.ПутьКДанным	= "Итератор.ИмяСекции";
		НовоеПоле.Заголовок		= "Остатки.Итератор.ИмяСекции";
	
		СвязьОстатков = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
		СвязьОстатков.НаборДанныхИсточник	= НаборДанныхОстатки.Имя;
		СвязьОстатков.НаборДанныхПриемник	= НаборДанныхЗапрос.Имя;
		СвязьОстатков.ВыражениеИсточник		= ИдентификаторСтрокФормата +".ID";
		СвязьОстатков.ВыражениеПриемник		= "Итератор.ID";

		ВыражениеИсточникСредств	= ОбщийМодульСКД.ПреобразоватьВыражениеСКД(ВыражениеИсточникСредств, 	РазрешенныеОбщиеМодули, ЗаменяемыеСлова, ЗаменяющиеСлова,, Отказ, ОписаниеОшибки);
		ВыражениеПоказатель			= ОбщийМодульСКД.ПреобразоватьВыражениеСКД(ВыражениеПоказатель, 		РазрешенныеОбщиеМодули, ЗаменяемыеСлова, ЗаменяющиеСлова,, Отказ, ОписаниеОшибки);
		ВыражениеОстатокНаНачалоДня	= ОбщийМодульСКД.ПреобразоватьВыражениеСКД(ВыражениеОстатокНаНачалоДня,	РазрешенныеОбщиеМодули, ЗаменяемыеСлова, ЗаменяющиеСлова,, Отказ, ОписаниеОшибки);
		ВыражениеОстатокНаКонецДня	= ОбщийМодульСКД.ПреобразоватьВыражениеСКД(ВыражениеОстатокНаКонецДня, 	РазрешенныеОбщиеМодули, ЗаменяемыеСлова, ЗаменяющиеСлова,, Отказ, ОписаниеОшибки);
	
		ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновки, "ИсточникСредств", 		ВыражениеИсточникСредств,		"Остатки.ИсточникСредств");
		ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновки, "Показатель", 			ВыражениеПоказатель,			"Остатки.Показатель");
		ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновки, "ОстатокНаНачалоДня",	ВыражениеОстатокНаНачалоДня,	"Остатки.ОстатокНаНачалоДня");
		ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновки, "ОстатокНаКонецДня",	ВыражениеОстатокНаКонецДня,		"Остатки.ОстатокНаКонецДня");
	
		// добавляем группировку верхнего уровня "Остатки" и в нее группировку по остаткам
		УровеньГруппировкиОстаткиВерх = ГруппировкаШапка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		УровеньГруппировкиОстаткиВерх.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировкиОстаткиВерх,	"Итератор.ИмяСекции");

		УровеньГруппировкиОстатки = УровеньГруппировкиОстаткиВерх.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		УровеньГруппировкиОстатки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировкиОстатки,	"Итератор.СчетчикЦикла");
		ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировкиОстатки,	"ИсточникСредств");
		ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировкиОстатки,	"Показатель");
		ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировкиОстатки,	"ОстатокНаНачалоДня");
		ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировкиОстатки,	"ОстатокНаКонецДня");
		
	КонецЕсли; // ТаблицаОстатки.Количество() > 0
	
	Если ЗначениеЗаполнено(ПравилаРасшифровки) Тогда
		// создадим описание источника для файла расшифровки		
		ПравилаОбменаРасш = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(ПравилаРасшифровки);
		ОписаниеТипаСтроки = ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(150);
		ПравилаОбменаРасш.Колонки.Добавить("ИмяПоляОбъекта", ОписаниеТипаСтроки);
		ПравилаОбменаРасш.Колонки.Добавить("ЗаголовокПоляОбъекта", ОписаниеТипаСтроки);
		
		ПоляРасшифровки = Новый Массив; // поля расшифровки добавляем в виде структуры содержащей ключи для добавления вычисляемого поля СКД
		Для каждого ТекСтрока Из ПравилаОбменаРасш Цикл
			// заголовок файла при формировании не понадобится
			Если Лев(ТекСтрока.ПолеФайлаПередачи, 3)        = "FK."
				ИЛИ Лев(ТекСтрока.ПолеФайлаПередачи, 5)     = "FROM."
				ИЛИ Лев(ТекСтрока.ПолеФайлаПередачи, 3)     = "TO." 
				ИЛИ Сред(ТекСтрока.ПолеФайлаПередачи, 5, 5) = "CONTR" Тогда
				Продолжить;
			КонецЕсли;
		
			Если НЕ ПустаяСтрока(ТекСтрока.ПолеОбъекта) Тогда
				Если Найти(ТекСтрока.ПолеОбъекта, ";")>0 Тогда
					МассивПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекСтрока.ПолеОбъекта, ";");
					Для каждого ТекПоле Из МассивПолей Цикл
						ПутьКДаннымРасшифровки = СокрЛП(ТекПоле);
						Если ПустаяСтрока(ТекСтрока.ПорядокЗаполнения) Тогда
							ВыражениеПоляРасшифровки = "";//ТекСтрока.ПолеФайлаПередачи;
						Иначе
							ВыражениеПоляРасшифровки = СтрЗаменить(ВРЕГ(ПреобразоватьПодСКД(ТекСтрока.ПорядокЗаполнения)), "ЗНАЧЕНИЕ", ТекСтрока.ПолеФайлаПередачи);
						КонецЕсли;
						ЗаголовокПоляРасшифровки = СокрЛП(ТекСтрока.ПолеФайлаПередачи);
						
						СтруктураТекущегоПоля = Новый Структура("Поле, ПутьКДанным, Выражение", СокрЛП(ТекСтрока.ПолеФайлаПередачи), ПутьКДаннымРасшифровки, ВыражениеПоляРасшифровки);
						ПоляРасшифровки.Добавить(СтруктураТекущегоПоля);
						УстановитьСоответствующееПолеРасшифровки(СтруктураТекущегоПоля, РеквизитыСтруктурыВРасшифровке);
					КонецЦикла;
				Иначе
					ПутьКДаннымРасшифровки = СокрЛП(ТекСтрока.ПолеОбъекта);	
					Если ПустаяСтрока(ТекСтрока.ПорядокЗаполнения) Тогда
						ВыражениеПоляРасшифровки = "";//ТекСтрока.ПолеФайлаПередачи;
					Иначе
						ВыражениеПоляРасшифровки = СтрЗаменить(ВРЕГ(ПреобразоватьПодСКД(ТекСтрока.ПорядокЗаполнения)), "ЗНАЧЕНИЕ", ТекСтрока.ПолеФайлаПередачи);
					КонецЕсли;
					ЗаголовокПоляРасшифровки = СокрЛП(ТекСтрока.ПолеФайлаПередачи);
					
					СтруктураТекущегоПоля = Новый Структура("Поле, ПутьКДанным, Выражение", СокрЛП(ТекСтрока.ПолеФайлаПередачи), ПутьКДаннымРасшифровки, ВыражениеПоляРасшифровки);
					ПоляРасшифровки.Добавить(СтруктураТекущегоПоля);
					УстановитьСоответствующееПолеРасшифровки(СтруктураТекущегоПоля, РеквизитыСтруктурыВРасшифровке);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
		
		ПоляРасшифровки.Добавить(Новый Структура("Поле, ПутьКДанным, Выражение", "BD.ID", "", "")); // для соединения с шапкой. будет всегда содержать "ИдентификаторСтрокФормата"
		ПоляРасшифровки.Добавить(Новый Структура("Поле, ПутьКДанным, Выражение", "BD.GUID_ONE", "", ""));
	КонецЕсли; // ЗначениеЗаполнено(ПравилаРасшифровки)
	
	Если ЗначениеЗаполнено(ПравилаРасшифровки_ВО) Тогда
		// создадим описание источника для файла расшифровки		
		ПравилаОбменаРасш = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(ПравилаРасшифровки_ВО);
		ОписаниеТипаСтроки = ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(150);
		ПравилаОбменаРасш.Колонки.Добавить("ИмяПоляОбъекта", ОписаниеТипаСтроки);
		ПравилаОбменаРасш.Колонки.Добавить("ЗаголовокПоляОбъекта", ОписаниеТипаСтроки);
		
		ПоляРасшифровки_ВО = Новый Массив; // поля расшифровки добавляем в виде структуры содержащей ключи для добавления вычисляемого поля СКД
		Для каждого ТекСтрока Из ПравилаОбменаРасш Цикл
			// заголовок файла при формировании не понадобится
			Если Лев(ТекСтрока.ПолеФайлаПередачи, 3) = "FK."
				ИЛИ Лев(ТекСтрока.ПолеФайлаПередачи, 5) = "FROM."
				ИЛИ Лев(ТекСтрока.ПолеФайлаПередачи, 3) = "TO." Тогда
				Продолжить;
			КонецЕсли;
		
			Если НЕ ПустаяСтрока(ТекСтрока.ПолеОбъекта) Тогда
				Если Найти(ТекСтрока.ПолеОбъекта, ";")>0 Тогда
					МассивПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекСтрока.ПолеОбъекта, ";");
					Для каждого ТекПоле Из МассивПолей Цикл
						ПутьКДаннымРасшифровки = СокрЛП(ТекПоле);
						Если ПустаяСтрока(ТекСтрока.ПорядокЗаполнения) Тогда
							ВыражениеПоляРасшифровки = "";//ТекСтрока.ПолеФайлаПередачи;
						Иначе
							ВыражениеПоляРасшифровки = СтрЗаменить(ВРЕГ(ПреобразоватьПодСКД(ТекСтрока.ПорядокЗаполнения)), "ЗНАЧЕНИЕ", ТекСтрока.ПолеФайлаПередачи);
						КонецЕсли;
						ЗаголовокПоляРасшифровки = СокрЛП(ТекСтрока.ПолеФайлаПередачи);
						
						СтруктураТекущегоПоля = Новый Структура("Поле, ПутьКДанным, Выражение", СокрЛП(ТекСтрока.ПолеФайлаПередачи), ПутьКДаннымРасшифровки, ВыражениеПоляРасшифровки);
						ПоляРасшифровки_ВО.Добавить(СтруктураТекущегоПоля);
						УстановитьСоответствующееПолеРасшифровки(СтруктураТекущегоПоля, РеквизитыСтруктурыВРасшифровке);
					КонецЦикла;
				Иначе
					ПутьКДаннымРасшифровки = СокрЛП(ТекСтрока.ПолеОбъекта);	
					Если ПустаяСтрока(ТекСтрока.ПорядокЗаполнения) Тогда
						ВыражениеПоляРасшифровки = "";//ТекСтрока.ПолеФайлаПередачи;
					Иначе
						ВыражениеПоляРасшифровки = СтрЗаменить(ВРЕГ(ПреобразоватьПодСКД(ТекСтрока.ПорядокЗаполнения)), "ЗНАЧЕНИЕ", ТекСтрока.ПолеФайлаПередачи);
					КонецЕсли;
					ЗаголовокПоляРасшифровки = СокрЛП(ТекСтрока.ПолеФайлаПередачи);
					
					СтруктураТекущегоПоля = Новый Структура("Поле, ПутьКДанным, Выражение", СокрЛП(ТекСтрока.ПолеФайлаПередачи), ПутьКДаннымРасшифровки, ВыражениеПоляРасшифровки);
					ПоляРасшифровки_ВО.Добавить(СтруктураТекущегоПоля);
					УстановитьСоответствующееПолеРасшифровки(СтруктураТекущегоПоля, РеквизитыСтруктурыВРасшифровке);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
		
		ПоляРасшифровки_ВО.Добавить(Новый Структура("Поле, ПутьКДанным, Выражение", "BH.ID",       "", "")); // для соединения с шапкой. будет всегда содержать "ИдентификаторСтрокФормата"
		ПоляРасшифровки_ВО.Добавить(Новый Структура("Поле, ПутьКДанным, Выражение", "BH.GUID_ONE", "", "")); 
	КонецЕсли; // ЗначениеЗаполнено(ПравилаРасшифровки_ВО)
	
	Если ЗначениеЗаполнено(ПравилаРасшифровки_ВС) Тогда
		// создадим описание источника для файла бухсправки		
		ПравилаОбменаРасш = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(ПравилаРасшифровки_ВС);
		ОписаниеТипаСтроки = ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(150);
		ПравилаОбменаРасш.Колонки.Добавить("ИмяПоляОбъекта", ОписаниеТипаСтроки);
		ПравилаОбменаРасш.Колонки.Добавить("ЗаголовокПоляОбъекта", ОписаниеТипаСтроки);
		
		ПоляРасшифровки_ВC = Новый Массив; // поля расшифровки добавляем в виде структуры содержащей ключи для добавления вычисляемого поля СКД
		Для каждого ТекСтрока Из ПравилаОбменаРасш Цикл
			// заголовок файла при формировании не понадобится
			Если Лев(ТекСтрока.ПолеФайлаПередачи, 3) = "FK."
				ИЛИ Лев(ТекСтрока.ПолеФайлаПередачи, 5) = "FROM."
				ИЛИ Лев(ТекСтрока.ПолеФайлаПередачи, 3) = "TO." Тогда
				Продолжить;
			КонецЕсли;
		
			Если НЕ ПустаяСтрока(ТекСтрока.ПолеОбъекта) Тогда
				Если Найти(ТекСтрока.ПолеОбъекта, ";")>0 Тогда
					МассивПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекСтрока.ПолеОбъекта, ";");
					Для каждого ТекПоле Из МассивПолей Цикл
						ПутьКДаннымРасшифровки = СокрЛП(ТекПоле);
						Если ПустаяСтрока(ТекСтрока.ПорядокЗаполнения) Тогда
							ВыражениеПоляРасшифровки = "";//ТекСтрока.ПолеФайлаПередачи;
						Иначе
							ВыражениеПоляРасшифровки = СтрЗаменить(ВРЕГ(ПреобразоватьПодСКД(ТекСтрока.ПорядокЗаполнения)), "ЗНАЧЕНИЕ", ТекСтрока.ПолеФайлаПередачи);
						КонецЕсли;
						ЗаголовокПоляРасшифровки = СокрЛП(ТекСтрока.ПолеФайлаПередачи);
						
						СтруктураТекущегоПоля = Новый Структура("Поле, ПутьКДанным, Выражение", СокрЛП(ТекСтрока.ПолеФайлаПередачи), ПутьКДаннымРасшифровки, ВыражениеПоляРасшифровки);
						ПоляРасшифровки_ВC.Добавить(СтруктураТекущегоПоля);
						УстановитьСоответствующееПолеРасшифровки(СтруктураТекущегоПоля, РеквизитыСтруктурыВРасшифровке);
					КонецЦикла;
				Иначе
					ПутьКДаннымРасшифровки = СокрЛП(ТекСтрока.ПолеОбъекта);	
					Если ПустаяСтрока(ТекСтрока.ПорядокЗаполнения) Тогда
						ВыражениеПоляРасшифровки = "";//ТекСтрока.ПолеФайлаПередачи;
					Иначе
						ВыражениеПоляРасшифровки = СтрЗаменить(ВРЕГ(ПреобразоватьПодСКД(ТекСтрока.ПорядокЗаполнения)), "ЗНАЧЕНИЕ", ТекСтрока.ПолеФайлаПередачи);
					КонецЕсли;
					ЗаголовокПоляРасшифровки = СокрЛП(ТекСтрока.ПолеФайлаПередачи);
					
					СтруктураТекущегоПоля = Новый Структура("Поле, ПутьКДанным, Выражение", СокрЛП(ТекСтрока.ПолеФайлаПередачи), ПутьКДаннымРасшифровки, ВыражениеПоляРасшифровки);
					ПоляРасшифровки_ВC.Добавить(СтруктураТекущегоПоля);
					УстановитьСоответствующееПолеРасшифровки(СтруктураТекущегоПоля, РеквизитыСтруктурыВРасшифровке);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
		
		ПоляРасшифровки_ВC.Добавить(Новый Структура("Поле, ПутьКДанным, Выражение", "SP.ID", "", "")); // для соединения с шапкой. будет всегда содержать "ИдентификаторСтрокФормата"
		ПоляРасшифровки_ВC.Добавить(Новый Структура("Поле, ПутьКДанным, Выражение", "SPD.GUID_FK", "", "")); 
		
	КонецЕсли; // ЗначениеЗаполнено(ПравилаРасшифровки_ВС)
	

	ТекущаяГруппировка        = Неопределено;
	ТекущийЗаголовок          = "";
	// СоответствиеРеквизитовГруппировок
	
	НовыеСвязиНаборовДанных   = Новый Массив;
	ТекущийНаборДанных        = НаборДанныхШапка;
	ИдентификаторСтрокФормата = ИдентификаторСтрокФорматаШапки;
	
	Для каждого ТекущееПравило Из ОбработанныеПравилаОбмена Цикл
		
		Если ИсходныеНастройкиОстатки.Найти(ТекущееПравило)<>Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Лев(ТекущееПравило.ПолеФайлаПередачи, 3) = "FK." 
			Или Лев(ТекущееПравило.ПолеФайлаПередачи, 5) = "FROM." 
			Или Лев(ТекущееПравило.ПолеФайлаПередачи, 3) = "TO." 
			ИЛИ Сред(ТекущееПравило.ПолеФайлаПередачи, 5, 5) = "CONTR" Тогда
			
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(ТекущееПравило.ПолеОбъекта) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ (ТекущееПравило.ИсточникДанных = ИдентификаторСтрокФормата
			ИЛИ ВРЕГ(ТекущееПравило.ТабличнаяЧасть) = "ОСТАТКИ")
			И ТекущийЗаголовок <> ТекущееПравило.ИсточникДанных Тогда
			СоответствиеРеквизитовГруппировок.Вставить(ТекущееПравило.ИсточникДанных, Новый Соответствие);
			ТекущийЗаголовок = ТекущееПравило.ИсточникДанных;
		КонецЕсли;
		
		Если ТекущееПравило.ВычисляемоеВыражение = ТекущееПравило.ПолеФайлаПередачи
	    	И КопияОбработанныеПравила.Скопировать(Новый Структура("ПолеФайлаПередачи", ТекущееПравило.ПолеФайлаПередачи)).Итог("Количество") = 1 Тогда
			Если ТекущийНаборДанных.Имя <> ТекущееПравило.ИсточникДанных И ИсточникиШапки.Найти(ТекущееПравило.ИсточникДанных) = Неопределено Тогда
				ТекущийНаборДанных = СхемаКомпоновки.НаборыДанных.Найти(ТекущееПравило.ИсточникДанных);
				Если ТекущийНаборДанных = Неопределено Тогда
					ТекущийНаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
					ТекущийНаборДанных.Имя 				= ТекущееПравило.ИсточникДанных;
					ТекущийНаборДанных.ИсточникДанных	= "ИсточникДанных1";
					ТекущийНаборДанных.ИмяОбъекта 		= ТекущееПравило.ИсточникДанных;
					ДобавитьПолеНабораДанных(ТекущийНаборДанных, ""+ТекущееПравило.ИсточникДанных+"_ID", ""+ТекущееПравило.ИсточникДанных+".ID");
					ДобавитьПолеНабораДанных(ТекущийНаборДанных, ""+ТекущееПравило.ИсточникДанных+"_ИмяСекции", ""+ТекущееПравило.ИсточникДанных+".ИмяСекции");
					
					Связь = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
					Связь.НаборДанныхИсточник = ИдентификаторСтрокФормата;
					Связь.НаборДанныхПриемник = ТекущееПравило.ИсточникДанных;
					Связь.ВыражениеИсточник = ИдентификаторСтрокФормата+".ID";
					Связь.ВыражениеПриемник = ""+ТекущееПравило.ИсточникДанных+".ID";
					
				КонецЕсли;
			КонецЕсли;
			
			
			Если ТекущееПравило.ИсточникДанных = ИдентификаторСтрокФормата ИЛИ ИсточникиШапки.Найти(ТекущееПравило.ИсточникДанных)<>Неопределено Тогда
				ПутьНовогоПоля = ТекущееПравило.ПолеОбъекта;
			Иначе
				ПутьНовогоПоля = ТекущееПравило.ИсточникДанных+ТекущееПравило.ПолеОбъекта;
			КонецЕсли;
			РазложениеПоляОбъекта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПутьНовогоПоля, ".");
			Если ВРЕГ(РазложениеПоляОбъекта[0]) = "ОБЪЕКТ" Тогда
				ПутьНовогоПоля = РазложениеПоляОбъекта[1];
			КонецЕсли;
			Если ТекущееПравило.Дубль Тогда
				ДобавитьПолеНабораДанных(ТекущийНаборДанных, СтрЗаменить(ТекущееПравило.ПолеФайлаПередачи, ".", "_"), ТекущееПравило.ПолеФайлаПередачи);
				Продолжить;
			Иначе
				ДобавитьПолеНабораДанных(ТекущийНаборДанных, СтрЗаменить(ТекущееПравило.ПолеФайлаПередачи, ".", "_"), ПутьНовогоПоля);
			КонецЕсли;
			Если РазложениеПоляОбъекта.Количество()>0 Тогда
				Если ВРЕГ(РазложениеПоляОбъекта[0]) = "ОБЪЕКТ" Тогда
					СоответствиеРеквизитовШапки.Вставить(РазложениеПоляОбъекта[1], РазложениеПоляОбъекта[1]);
				ИначеЕсли РазложениеПоляОбъекта.Количество()=2 Тогда
					Если ТекущийЗаголовок<> "" И Лев(РазложениеПоляОбъекта[0], СтрДлина(ТекущийЗаголовок)) = ТекущийЗаголовок Тогда
						// реквизит таблицы
						Если СоответствиеРеквизитовГруппировок[ТекущийЗаголовок][РазложениеПоляОбъекта[0]]=Неопределено Тогда
							СоответствиеРеквизитовГруппировок[ТекущийЗаголовок].Вставить(РазложениеПоляОбъекта[0], Новый Соответствие);
						КонецЕсли;
						СоответствиеРеквизитовГруппировок[ТекущийЗаголовок][РазложениеПоляОбъекта[0]].Вставить(РазложениеПоляОбъекта[1], РазложениеПоляОбъекта[0]+"."+РазложениеПоляОбъекта[1]);
					Иначе
						Если СоответствиеРеквизитовШапки.Получить(РазложениеПоляОбъекта[0]) = Неопределено Тогда
							СоответствиеРеквизитовШапки.Вставить(РазложениеПоляОбъекта[0], Новый Соответствие);
						КонецЕсли;
						СоответствиеРеквизитовШапки[РазложениеПоляОбъекта[0]].Вставить(РазложениеПоляОбъекта[1], РазложениеПоляОбъекта[1]);
						//СоответствиеРеквизитовШапки[РазложениеПоляОбъекта[0]].Вставить(РазложениеПоляОбъекта[1], ТекущееПравило.ПолеФайлаПередачи);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			Если ТекущийНаборДанных.Имя <> ТекущееПравило.ИсточникДанных И ИсточникиШапки.Найти(ТекущееПравило.ИсточникДанных)=Неопределено Тогда
				ТекущийНаборДанных = СхемаКомпоновки.НаборыДанных.Найти(ТекущееПравило.ИсточникДанных);
				Если ТекущийНаборДанных = Неопределено Тогда
					ТекущийНаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
					ТекущийНаборДанных.Имя 				= ТекущееПравило.ИсточникДанных;
					ТекущийНаборДанных.ИсточникДанных	= "ИсточникДанных1";
					ТекущийНаборДанных.ИмяОбъекта 		= ТекущееПравило.ИсточникДанных;
					ДобавитьПолеНабораДанных(ТекущийНаборДанных, ""+ТекущееПравило.ИсточникДанных+"_ID", ""+ТекущееПравило.ИсточникДанных+".ID");
					ДобавитьПолеНабораДанных(ТекущийНаборДанных, ""+ТекущееПравило.ИсточникДанных+"_ИмяСекции", ""+ТекущееПравило.ИсточникДанных+".ИмяСекции");
					
					Связь = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
					Связь.НаборДанныхИсточник = ИдентификаторСтрокФормата;
					Связь.НаборДанныхПриемник = ТекущееПравило.ИсточникДанных;
					Связь.ВыражениеИсточник = ИдентификаторСтрокФормата+".ID";
					Связь.ВыражениеПриемник = ""+ТекущееПравило.ИсточникДанных+".ID";
					
				КонецЕсли;
			КонецЕсли;
			Если ТекущийНаборДанных.Поля.Найти(ТекущееПравило.ПолеФайлаПередачи) = Неопределено Тогда
				//Если ТекущееПравило.ИсточникДанных = ИдентификаторСтрокФормата Тогда
					ДобавитьПолеНабораДанных(ТекущийНаборДанных, СтрЗаменить(ТекущееПравило.ПолеФайлаПередачи, ".", "_"), ТекущееПравило.ПолеФайлаПередачи);
				//КонецЕсли;
			КонецЕсли;
			
			Если ТекущееПравило.Дубль Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекущееПравило.ИсточникДанных = ИдентификаторСтрокФормата ИЛИ ИсточникиШапки.Найти(ТекущееПравило.ИсточникДанных)<>Неопределено Тогда
				ПутьНовогоПоля = ТекущееПравило.ПолеОбъекта;
			Иначе
				ПутьНовогоПоля = ТекущееПравило.ИсточникДанных+ТекущееПравило.ПолеОбъекта;
			КонецЕсли;
			РазложениеПоляОбъекта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПутьНовогоПоля, ".");
			Если ВРЕГ(РазложениеПоляОбъекта[0]) = "ОБЪЕКТ" Тогда
				ПутьНовогоПоля = РазложениеПоляОбъекта[1];
			КонецЕсли;
			ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновки, ПутьНовогоПоля, ТекущееПравило.ВычисляемоеВыражение);
			Если РазложениеПоляОбъекта.Количество()>0 Тогда
				Если ВРЕГ(РазложениеПоляОбъекта[0]) = "ОБЪЕКТ" Тогда
					СоответствиеРеквизитовШапки.Вставить(РазложениеПоляОбъекта[1], ПутьНовогоПоля);
				ИначеЕсли РазложениеПоляОбъекта.Количество()=2 Тогда
					Если ТекущийЗаголовок <> "" И Лев(РазложениеПоляОбъекта[0], СтрДлина(ТекущийЗаголовок)) = ТекущийЗаголовок Тогда
						// реквизит таблицы
						Если СоответствиеРеквизитовГруппировок[ТекущийЗаголовок][РазложениеПоляОбъекта[0]]=Неопределено Тогда
							СоответствиеРеквизитовГруппировок[ТекущийЗаголовок].Вставить(РазложениеПоляОбъекта[0], Новый Соответствие);
						КонецЕсли;
						СоответствиеРеквизитовГруппировок[ТекущийЗаголовок][РазложениеПоляОбъекта[0]].Вставить(РазложениеПоляОбъекта[1], РазложениеПоляОбъекта[0]+"."+РазложениеПоляОбъекта[1]);
					Иначе
						Если СоответствиеРеквизитовШапки.Получить(РазложениеПоляОбъекта[0]) = Неопределено Тогда
							СоответствиеРеквизитовШапки.Вставить(РазложениеПоляОбъекта[0], Новый Соответствие);
						КонецЕсли;
						СоответствиеРеквизитовШапки[РазложениеПоляОбъекта[0]].Вставить(РазложениеПоляОбъекта[1], РазложениеПоляОбъекта[1]);
						//СоответствиеРеквизитовШапки[РазложениеПоляОбъекта[0]].Вставить(РазложениеПоляОбъекта[1], ТекущееПравило.ПолеФайлаПередачи);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекущееПравило.ИсточникДанных = ИдентификаторСтрокФормата Тогда // группировка шапка
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(ГруппировкаШапка, ПутьНовогоПоля);
		ИначеЕсли ИсточникиШапки.Найти(ТекущееПравило.ИсточникДанных)<>Неопределено Тогда // группировки, относящиеся к шапке
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(ГруппировкаШапка, ПутьНовогоПоля);
		Иначе
			Если ТекущаяГруппировка = Неопределено
				ИЛИ ТекущаяГруппировка.Имя <> ТекущееПравило.ИсточникДанных Тогда
				
				ТекущаяГруппировка = ГруппировкаШапка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				ТекущаяГруппировка.Имя = ТекущееПравило.ИсточникДанных ;
				ТекущаяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
				ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(ТекущаяГруппировка, ТекущееПравило.ИсточникДанных+".ИмяСекции");
			КонецЕсли;
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(ТекущаяГруппировка, ПутьНовогоПоля);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущееПравило.Условие) Тогда
			Если ПроцедурыОбработкиСтрок[ТекущийЗаголовок] = Неопределено Тогда
				ПроцедурыОбработкиСтрок.Вставить(ТекущийЗаголовок, ТекущееПравило.Условие);
			КонецЕсли;
		КонецЕсли;
		
		Если ИсточникиШапки.Найти(ТекущееПравило.ИсточникДанных) = Неопределено И СхемаКомпоновки.НаборыДанных.Найти(ТекущееПравило.ИсточникДанных+"_"+ИдентификаторСтрокФормата) = Неопределено
			И (ЗначениеЗаполнено(ПравилаРасшифровки) ИЛИ ЗначениеЗаполнено(ПравилаРасшифровки_ВО) ИЛИ ЗначениеЗаполнено(ПравилаРасшифровки_ВС)) 
		   	И (СтрНайти(Нрег(ТекущееПравило.Условие), "получитьзаявку") > 0 ИЛИ СтрНайти(Нрег(ТекущееПравило.Условие), "новоекассовоепоступление") > 0) Тогда					
			
			Если ЗначениеЗаполнено(ПравилаРасшифровки) Тогда
							
				// создаем источник данных расшифровки для текущего заголовка
				// источник данных полностью повторяет расшифровку. меняется только ПутьКДанным
				ДопНаборДанныхРасшифровка                   = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
				ДопНаборДанныхРасшифровка.ИсточникДанных	= "ИсточникДанных1";
				ДопНаборДанныхРасшифровка.Имя 				= ТекущееПравило.ИсточникДанных+"_BD";
				ДопНаборДанныхРасшифровка.ИмяОбъекта 		= "BD";
				
				Для каждого ТекСтрока Из ПоляРасшифровки Цикл
					
					ПолеФайла = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекСтрока.Поле, ".");
					ИмяПоля = ПолеФайла[0]+"_"+ПолеФайла[1];
					ПутьКДанным	= ТекущееПравило.ИсточникДанных+"_"+ПолеФайла[0]+"."+ПолеФайла[1];
					
					Если ДопНаборДанныхРасшифровка.Поля.Найти(ПутьКДанным) = Неопределено Тогда
						
						НовПоле                           = ДопНаборДанныхРасшифровка.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
						НовПоле.Поле		              = ИмяПоля;
						НовПоле.ПутьКДанным	              = ТекущееПравило.ИсточникДанных + "_"+ПолеФайла[0] + "." + ПолеФайла[1];
						НовПоле.Роль.Обязательное         = Истина;
												
					КонецЕсли;
						
					Если НЕ ПустаяСтрока(ТекСтрока.ПутьКДанным) Тогда
						ПутьКДаннымРасшифровки 		= ТекущееПравило.ИсточникДанных+"_"+ТекСтрока.ПутьКДанным;
						Если ПустаяСтрока(ТекСтрока.Выражение) Тогда
							ВыражениеПоляРасшифровки = ТекущееПравило.ИсточникДанных+"_"+ТекСтрока.Поле;
						Иначе
							ВыражениеПоляРасшифровки 	= СтрЗаменить(ВРЕГ(ТекСтрока.Выражение), ТекСтрока.Поле, ТекущееПравило.ИсточникДанных+"_"+ТекСтрока.Поле);
							ВыражениеПоляРасшифровки	= ОбщийМодульСКД.ПреобразоватьВыражениеСКД(ВыражениеПоляРасшифровки, РазрешенныеОбщиеМодули, ЗаменяемыеСлова, ЗаменяющиеСлова,, Отказ, ОписаниеОшибки);
						КонецЕсли;
						ЗаголовокПоляРасшифровки	= ТекущееПравило.ИсточникДанных+"."+ТекСтрока.Поле;
						ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновки, ПутьКДаннымРасшифровки, ВыражениеПоляРасшифровки, ЗаголовокПоляРасшифровки);
					КонецЕсли;
					//КонецЕсли;
				КонецЦикла; 
				
				// зададим связь источников данных
				НовыеСвязиНаборовДанных.Добавить(Новый Структура("НаборДанныхИсточник, НаборДанныхПриемник, ВыражениеИсточник, ВыражениеПриемник",
																 ТекущееПравило.ИсточникДанных,
																 ТекущееПравило.ИсточникДанных	+"_BD",
															     ТекущееПравило.ИсточникДанных + ".GUID",
															     ТекущееПравило.ИсточникДанных	+"_BD.GUID_ONE"));	//_BDPD.GUID											 

							
				// создадим источник данных для соединения текущего источника с таблицей строки
				НовыйНаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
				НовыйНаборДанных.ИсточникДанных	= "ИсточникДанных1";
				НовыйНаборДанных.Имя 			= ТекущееПравило.ИсточникДанных+"_"+ИдентификаторСтрокФормата;
				НовыйНаборДанных.ИмяОбъекта 	= ИдентификаторСтрокФормата;
				
				Для Каждого ТекПолеШапки Из НаборДанныхШапка.Поля Цикл
					НовПоле = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
					НовПоле.Поле		= ТекПолеШапки.Поле;
					НовПоле.ПутьКДанным = ТекущееПравило.ИсточникДанных + "_" + ТекПолеШапки.ПутьКДанным;
					НовПоле.Роль.Обязательное = Истина;
				Конеццикла;
				
				// Обратную связь с шапкой делаем с предыдущим источником
				ОбратнаяСвязь = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
			    ОбратнаяСвязь.НаборДанныхИсточник	= ТекущееПравило.ИсточникДанных+"_BD";
			    ОбратнаяСвязь.НаборДанныхПриемник	= НовыйНаборДанных.Имя;
			    ОбратнаяСвязь.ВыражениеИсточник		= ТекущееПравило.ИсточникДанных + "_BD.ID";   // связь считаем по гуиду
			    ОбратнаяСвязь.ВыражениеПриемник		= ТекущееПравило.ИсточникДанных + "_" + ИдентификаторСтрокФормата+".ID";
				
				// создадим подчиненную группировку для файла структуры
				ГруппировкаБД = ТекущаяГруппировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				ГруппировкаБД.Имя = "BD."+ТекущееПравило.ИсточникДанных;
				ГруппировкаБД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
							
				// дополним группировку полями расшифровки
				ДополнитьПоляГруппировкиПолямиРасшифровки(ГруппировкаБД, ПоляРасшифровки, ТекущееПравило.ИсточникДанных + "_", Новый Соответствие, 0);
				
			КонецЕсли;
			
				
			Если ЗначениеЗаполнено(ПравилаРасшифровки_ВО)  Тогда
				// создаем источник данных расшифровки для текущего заголовка
				// источник данных полностью повторяет расшифровку. меняется только ПутьКДанным
				ДопНаборДанныхРасшифровка                   = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
				ДопНаборДанныхРасшифровка.ИсточникДанных	= "ИсточникДанных1";
				ДопНаборДанныхРасшифровка.Имя 				= ТекущееПравило.ИсточникДанных+"1_BH";
				ДопНаборДанныхРасшифровка.ИмяОбъекта 		= "BH";
				
				Для каждого ТекСтрока Из ПоляРасшифровки_ВО Цикл
					
					ПолеФайла = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекСтрока.Поле, ".");
					ИмяПоля = ПолеФайла[0]+"_"+ПолеФайла[1];
					ПутьКДанным	= ТекущееПравило.ИсточникДанных+"1_"+ПолеФайла[0]+"."+ПолеФайла[1];
					
					Если ДопНаборДанныхРасшифровка.Поля.Найти(ПутьКДанным) = Неопределено Тогда
						
						НовПоле = ДопНаборДанныхРасшифровка.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
						НовПоле.Поле		= ИмяПоля;
						НовПоле.ПутьКДанным	= ТекущееПравило.ИсточникДанных+"1_"+ПолеФайла[0]+"."+ПолеФайла[1];
						НовПоле.Роль.Обязательное = Истина;
												
					КонецЕсли;
						
					Если НЕ ПустаяСтрока(ТекСтрока.ПутьКДанным) Тогда
						ПутьКДаннымРасшифровки 		= ТекущееПравило.ИсточникДанных+"1_"+ТекСтрока.ПутьКДанным;
						Если ПустаяСтрока(ТекСтрока.Выражение) Тогда
							ВыражениеПоляРасшифровки = ТекущееПравило.ИсточникДанных+"1_"+ТекСтрока.Поле;
						Иначе
							ВыражениеПоляРасшифровки 	= СтрЗаменить(ВРЕГ(ТекСтрока.Выражение), ТекСтрока.Поле, ТекущееПравило.ИсточникДанных+"1_"+ТекСтрока.Поле);
							ВыражениеПоляРасшифровки	= ОбщийМодульСКД.ПреобразоватьВыражениеСКД(ВыражениеПоляРасшифровки, РазрешенныеОбщиеМодули, ЗаменяемыеСлова, ЗаменяющиеСлова,, Отказ, ОписаниеОшибки);
						КонецЕсли;
						ЗаголовокПоляРасшифровки	= ТекущееПравило.ИсточникДанных+"1."+ТекСтрока.Поле;
						ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновки, ПутьКДаннымРасшифровки, ВыражениеПоляРасшифровки, ЗаголовокПоляРасшифровки);
					КонецЕсли;
					
				КонецЦикла; 
				
				// зададим связь источников данных
				НовыеСвязиНаборовДанных.Добавить(Новый Структура("НаборДанныхИсточник, НаборДанныхПриемник, ВыражениеИсточник, ВыражениеПриемник",
																 ТекущееПравило.ИсточникДанных,
																 ТекущееПравило.ИсточникДанных + "1_BH",
																 ТекущееПравило.ИсточникДанных  + ".GUID",
																 ТекущееПравило.ИсточникДанных + "1_BH.GUID_ONE"));
				
						
				// создадим источник данных для соединения текущего источника с таблицей строки
				
				Если СхемаКомпоновки.НаборыДанных.Найти(ТекущееПравило.ИсточникДанных+"_"+ИдентификаторСтрокФормата) = Неопределено Тогда
					
					НовыйНаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
					НовыйНаборДанных.ИсточникДанных	= "ИсточникДанных1";
					НовыйНаборДанных.Имя 			= ТекущееПравило.ИсточникДанных+"_"+ИдентификаторСтрокФормата;
					НовыйНаборДанных.ИмяОбъекта 	= ИдентификаторСтрокФормата;
					
					Для Каждого ТекПолеШапки Из НаборДанныхШапка.Поля Цикл
						НовПоле = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
						НовПоле.Поле		= ТекПолеШапки.Поле;
						НовПоле.ПутьКДанным = ТекущееПравило.ИсточникДанных + "_" + ТекПолеШапки.ПутьКДанным;
						НовПоле.Роль.Обязательное = Истина;
					Конеццикла;
					
				КонецЕсли;
				
				// Обратную связь с шапкой делаем с предыдущим источником
				ОбратнаяСвязь = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
				ОбратнаяСвязь.НаборДанныхИсточник	= ТекущееПравило.ИсточникДанных + "1_BH";
				ОбратнаяСвязь.НаборДанныхПриемник	= ТекущееПравило.ИсточникДанных + "_" + ИдентификаторСтрокФормата;
		 		ОбратнаяСвязь.ВыражениеИсточник		= ТекущееПравило.ИсточникДанных + "1_BH.ID";   // связь считаем по гуиду
				ОбратнаяСвязь.ВыражениеПриемник		= ТекущееПравило.ИсточникДанных + "_" + ИдентификаторСтрокФормата+".ID";
								
				// создадим подчиненную группировку для файла структуры
				ГруппировкаБД = ТекущаяГруппировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				ГруппировкаБД.Имя = "BH."+ТекущееПравило.ИсточникДанных;
				ГруппировкаБД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
							
				// дополним группировку полями расшифровки
				ДополнитьПоляГруппировкиПолямиРасшифровки_ВО(ГруппировкаБД, ПоляРасшифровки_ВО, ТекущееПравило.ИсточникДанных+"1_", Новый Соответствие, 0);
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(ПравилаРасшифровки_ВС)  Тогда
				// создаем источник данных расшифровки для текущего заголовка
				// источник данных полностью повторяет расшифровку. меняется только ПутьКДанным
				ДопНаборДанныхРасшифровка                   = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
				ДопНаборДанныхРасшифровка.ИсточникДанных	= "ИсточникДанных1";
				ДопНаборДанныхРасшифровка.Имя 				= ТекущееПравило.ИсточникДанных+"2_SP";
				ДопНаборДанныхРасшифровка.ИмяОбъекта 		= "SP";
				
				Для каждого ТекСтрока Из ПоляРасшифровки_ВC Цикл
					
					ПолеФайла = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекСтрока.Поле, ".");
					ИмяПоля = ПолеФайла[0]+"_"+ПолеФайла[1];
					ПутьКДанным	= ТекущееПравило.ИсточникДанных+"2_"+ПолеФайла[0]+"."+ПолеФайла[1];
					
					Если ДопНаборДанныхРасшифровка.Поля.Найти(ПутьКДанным) = Неопределено Тогда
						
						НовПоле = ДопНаборДанныхРасшифровка.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
						НовПоле.Поле		= ИмяПоля;
						НовПоле.ПутьКДанным	= ТекущееПравило.ИсточникДанных+"2_"+ПолеФайла[0]+"."+ПолеФайла[1];
						НовПоле.Роль.Обязательное = Истина;
												
					КонецЕсли;
						
					Если НЕ ПустаяСтрока(ТекСтрока.ПутьКДанным) Тогда
						ПутьКДаннымРасшифровки 		= ТекущееПравило.ИсточникДанных+"2_"+ТекСтрока.ПутьКДанным;
						Если ПустаяСтрока(ТекСтрока.Выражение) Тогда
							ВыражениеПоляРасшифровки = ТекущееПравило.ИсточникДанных+"2_"+ТекСтрока.Поле;
						Иначе
							ВыражениеПоляРасшифровки 	= СтрЗаменить(ВРЕГ(ТекСтрока.Выражение), ТекСтрока.Поле, ТекущееПравило.ИсточникДанных+"2_"+ТекСтрока.Поле);
							ВыражениеПоляРасшифровки	= ОбщийМодульСКД.ПреобразоватьВыражениеСКД(ВыражениеПоляРасшифровки, РазрешенныеОбщиеМодули, ЗаменяемыеСлова, ЗаменяющиеСлова,, Отказ, ОписаниеОшибки);
						КонецЕсли;
						ЗаголовокПоляРасшифровки	= ТекущееПравило.ИсточникДанных+"2."+ТекСтрока.Поле;
						ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновки, ПутьКДаннымРасшифровки, ВыражениеПоляРасшифровки, ЗаголовокПоляРасшифровки);
					КонецЕсли;
					
				КонецЦикла; 
				
				// зададим связь источников данных
				НовыеСвязиНаборовДанных.Добавить(Новый Структура("НаборДанныхИсточник, НаборДанныхПриемник, ВыражениеИсточник, ВыражениеПриемник",
																 ТекущееПравило.ИсточникДанных,
																 ТекущееПравило.ИсточникДанных + "2_SP",
																 ТекущееПравило.ИсточникДанных  + ".GUID",
																 ТекущееПравило.ИсточникДанных + "2_SPD.GUID_FK"));
				
						
				// создадим источник данных для соединения текущего источника с таблицей строки
				
				Если СхемаКомпоновки.НаборыДанных.Найти(ТекущееПравило.ИсточникДанных+"_"+ИдентификаторСтрокФормата) = Неопределено Тогда
					
					НовыйНаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
					НовыйНаборДанных.ИсточникДанных	= "ИсточникДанных1";
					НовыйНаборДанных.Имя 			= ТекущееПравило.ИсточникДанных+"_"+ИдентификаторСтрокФормата;
					НовыйНаборДанных.ИмяОбъекта 	= ИдентификаторСтрокФормата;
					
					Для Каждого ТекПолеШапки Из НаборДанныхШапка.Поля Цикл
						НовПоле = НовыйНаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
						НовПоле.Поле		= ТекПолеШапки.Поле;
						НовПоле.ПутьКДанным = ТекущееПравило.ИсточникДанных + "_" + ТекПолеШапки.ПутьКДанным;
						НовПоле.Роль.Обязательное = Истина;
					Конеццикла;
					
				КонецЕсли;
				
				// Обратную связь с шапкой делаем с предыдущим источником
				ОбратнаяСвязь = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
				ОбратнаяСвязь.НаборДанныхИсточник	= ТекущееПравило.ИсточникДанных + "2_SP";
				ОбратнаяСвязь.НаборДанныхПриемник	= ТекущееПравило.ИсточникДанных + "_" + ИдентификаторСтрокФормата;
		 		ОбратнаяСвязь.ВыражениеИсточник		= ТекущееПравило.ИсточникДанных + "2_SP.ID";   // связь считаем по гуиду
				ОбратнаяСвязь.ВыражениеПриемник		= ТекущееПравило.ИсточникДанных + "_" + ИдентификаторСтрокФормата+".ID";
								
				// создадим подчиненную группировку для файла структуры
				ГруппировкаБД = ТекущаяГруппировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				ГруппировкаБД.Имя = "SP."+ТекущееПравило.ИсточникДанных;
				ГруппировкаБД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
							
				// дополним группировку полями расшифровки
				ДополнитьПоляГруппировкиПолямиРасшифровки_ВС(ГруппировкаБД, ПоляРасшифровки_ВC, ТекущееПравило.ИсточникДанных+"2_", Новый Соответствие, 0);
			КонецЕсли;	

		КонецЕсли;
		
	КонецЦикла; 
	
	Для каждого ТекНоваяСвязь Из НовыеСвязиНаборовДанных Цикл
	
		ВыражениеИсточник = Неопределено;
		
		Для Каждого ПолеНабора Из СхемаКомпоновки.НаборыДанных.Найти(ТекНоваяСвязь.НаборДанныхИсточник).Поля Цикл
			Если ПолеНабора.Поле = СтрЗаменить(ТекНоваяСвязь.ВыражениеИсточник, ".", "_") Тогда
				ВыражениеИсточник = ПолеНабора.ПутьКДанным;
			КонецЕсли;
		КонецЦикла;
		ПолеПриемник = СхемаКомпоновки.НаборыДанных.Найти(ТекНоваяСвязь.НаборДанныхПриемник).Поля.Найти(ТекНоваяСвязь.ВыражениеПриемник);
		Если ПолеПриемник = Неопределено Тогда
			Для Каждого ПолеНабора Из СхемаКомпоновки.НаборыДанных.Найти(ТекНоваяСвязь.НаборДанныхПриемник).Поля Цикл
				Если ПолеНабора.Поле = СтрЗаменить(ТекНоваяСвязь.ВыражениеПриемник, ".", "_") Тогда
					ВыражениеПриемник = ПолеНабора.ПутьКДанным;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ВыражениеПриемник = ПолеПриемник.ПутьКДанным;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыражениеИсточник) И ЗначениеЗаполнено(ВыражениеПриемник) Тогда		
			СвязьОстатков                       = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
			СвязьОстатков.НаборДанныхИсточник	= ТекНоваяСвязь.НаборДанныхИсточник;
			СвязьОстатков.НаборДанныхПриемник	= ТекНоваяСвязь.НаборДанныхПриемник;
			СвязьОстатков.ВыражениеИсточник		= ВыражениеИсточник;   // связь считаем по гуиду
			СвязьОстатков.ВыражениеПриемник		= ВыражениеПриемник;
		КонецЕсли;	
	КонецЦикла; 
	
	Возврат СхемаКомпоновки;	
	
КонецФункции

Функция СодержимоеФайла(СсылкаДокумент, ИмяФайла, ВидОбмена, ИмяФайлаБезРасширения = "")
	
	Попытка
		КодировкаТекстаФайла	= КодировкаТекста[ВидОбмена.КодировкаТекстаФайла]
	Исключение
		КодировкаТекстаФайла    = ВидОбмена.КодировкаТекстаФайла;
	КонецПопытки;
	
	СодержимоеФайла = "";
	
	ВладелецФайла 	= СсылкаДокумент;
	
	МассивФайлов 	= Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ВладелецФайла,МассивФайлов);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого ПрисоединенныйФайл Из МассивФайлов Цикл
		Если (ПрисоединенныйФайл.Наименование + "." + ПрисоединенныйФайл.Расширение) = ИмяФайла тогда
			ИнформацияОФайле = РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл);
			ИмяФайлаБезРасширения = ИнформацияОФайле.Наименование;
			
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ИнформацияОФайле.СсылкаНаДвоичныеДанныеФайла);
			
			Если ЭтоАдресВременногоХранилища(ИнформацияОФайле.СсылкаНаДвоичныеДанныеФайла) Тогда
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
				ПолучитьИзВременногоХранилища(ИнформацияОФайле.СсылкаНаДвоичныеДанныеФайла).Записать(ИмяВременногоФайла);
				
				ТекстовыйФайл = Новый ЧтениеТекста(ИмяВременногоФайла, КодировкаТекстаФайла);
				СодержимоеФайла = ТекстовыйФайл.Прочитать();
				ТекстовыйФайл.Закрыть();
				УдалитьФайлы(ИмяВременногоФайла);
				Прервать;
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;   
	
	Если ВидОбмена.ПредставлениеВНомереВерсии  = "TX" Тогда
		СодержимоеФайла = ПреобразоватьТекстФайла(СодержимоеФайла);	
	КонецЕсли;  
	
	Если ВидОбмена.ПредставлениеВНомереВерсии = "UFBS" Тогда  
		
		ПостроительDOM = Новый ПостроительDOM;
	
		ЧтениеXML      = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(СодержимоеФайла); 
		
		ДокументDOM             = ПостроительDOM.Прочитать(ЧтениеXML);  
		ЗакодированноеСообщение = ДокументDOM.ПолучитьЭлементыПоИмени("Object");
		
		Если ЗакодированноеСообщение.Количество() > 0 Тогда  
			
			СодержимоеСообщения = Base64Значение(ЗакодированноеСообщение[0].ТекстовоеСодержимое); 
			
			ВременныйФайл       = ПолучитьИмяВременногоФайла();
	        СодержимоеСообщения.Записать(ВременныйФайл);      
								
			Чтение              = Новый ЧтениеТекста(ВременныйФайл, КодировкаТекстаФайла);
	        СодержимоеФайла     = Чтение.Прочитать();  
			
			Чтение.Закрыть();
			УдалитьФайлы(ВременныйФайл);
						
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СодержимоеФайла;
	
КонецФункции

Процедура ДобавитьПоляВСтруктуру(КоллекцияСтрок, КоллекцияСтруктуры)

	Если КоллекцияСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрокаСтруктуры = КоллекцияСтруктуры.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	
	Для каждого ТекСтрокаКоллекции Из КоллекцияСтрок Цикл
	
		Если Не ПустаяСтрока(ТекСтрокаКоллекции.ПоляГруппировки) Тогда
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(КоллекцияСтруктуры, ТекСтрокаКоллекции.ПоляГруппировки);
		Иначе
			ДобавитьПоляВСтруктуру(ТекСтрокаКоллекции.Строки, КоллекцияСтруктуры.Структура);
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры  

Функция СодержитТолькоЛатинскиеСимволы(Строка)
	
	ДопустимыеСимволы = "ABCDEFGHIJKLMNOPQRSTUVWXYZ_0123456789";
	
	Для поз = 0 по СтрДлина(Строка) - 1 Цикл
		Символ = Сред(Строка, поз, 1);
		Если СтрНайти(ДопустимыеСимволы, Символ) = 0 Тогда
			Возврат Ложь;
	    КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;   
	
КонецФункции	

Функция ПреобразоватьТекстФайла(ТекстФайла)
	
	ТекстФайлаДанных   = Новый ТекстовыйДокумент;
	ТекстФайлаДанных.УстановитьТекст(ТекстФайла);
	
	ИтоговыйТекстФайла = Новый ТекстовыйДокумент;      
	
	Для СчетчикСтрок = 1 По ТекстФайлаДанных.КоличествоСтрок() Цикл   
		
		РазбираемаяСтрока = ТекстФайлаДанных.ПолучитьСтроку(СчетчикСтрок);
		
		РазборСтроки = СтрРазделить(РазбираемаяСтрока, "|", Ложь); 
		
		Если РазборСтроки.Количество() = 0 Тогда 
		//если в файле ошибочно содержатся пустые строки	
			Продолжить; 
		КонецЕсли;	
		
		ИмяИсточника = РазборСтроки[0];
		
		Если НЕ СодержитТолькоЛатинскиеСимволы(ИмяИсточника) Тогда
		//это перенос строки	
		     НомерПоследнейИтоговойСтроки = ИтоговыйТекстФайла.КоличествоСтрок();
		     ИтоговыйТекстФайла.ЗаменитьСтроку(НомерПоследнейИтоговойСтроки, 
			 ИтоговыйТекстФайла.ПолучитьСтроку(НомерПоследнейИтоговойСтроки) + РазбираемаяСтрока);  
		Иначе	 
			 ИтоговыйТекстФайла.ДобавитьСтроку(РазбираемаяСтрока)
		КонецЕсли;	 
	КонецЦикла;	
	
	Возврат ИтоговыйТекстФайла.ПолучитьТекст(); 
	
КонецФункции

Процедура ЗагрузитьИзТекстовогоФайла(ТекстФайла, Формат, Задание, ИмяФайла, ДанныеНовыхКонтрагентов) 
	
	ТекстФайла = СтрЗаменить(ТекстФайла,"=-","=");  
		
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.Ссылка,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки КАК НомерСтроки,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.ТипПоляФайлаПередачи,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.ОграничениеРазмерности,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.ОписаниеПоляФайлаПередачи,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.ПолеОбъекта,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.ПорядокЗаполнения,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.ОбязательностьЗаполнения,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.ТабличнаяЧасть,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.Условие,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.ДопДействия,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.СекцияПечати,
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.ПеременнаяПечати
	//					  |ИЗ
	//					  |	Справочник.ФорматыОбменаБанкиКС.ПравилаОбмена КАК ФорматыОбменаБанкиКСПравилаОбмена
	//					  |ГДЕ
	//					  |	ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = &Ссылка
	//					  |
	//					  |УПОРЯДОЧИТЬ ПО
	//					  |	НомерСтроки");
	//					  
	//					  
	//Запрос.УстановитьПараметр("Ссылка", Формат);
	//ПравилаЗагрузки = Запрос.Выполнить().Выгрузить();
	
	ПравилаЗагрузки = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(Формат);
	
	ДеревоСтруктуры = Новый ДеревоЗначений;
	ДеревоСтруктуры.Колонки.Добавить("ИмяПоля",				Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПолноеИмяПоля",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ИмяПоляТаблицы",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПорядокЗаполнения", 	Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПолеОбъекта",			Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ТабличнаяЧасть",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ДопДействия",			Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("Условие",				Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("КонечныйЭлемент", 	Новый ОписаниеТипов("Булево"));
	ДеревоСтруктуры.Колонки.Добавить("Группировка",			Новый ОписаниеТипов("Строка"));
	
	СоответствиеВетвей = Новый Соответствие;
	Для каждого ТекПравило Из ПравилаЗагрузки Цикл
		Если Найти(ТекПравило.ПолеОбъекта, ".") = 0 и ПустаяСтрока(ТекПравило.ТабличнаяЧасть) Тогда
			КоллекцияСтрокДерева = СоответствиеВетвей.Получить("Объект");	
			Если КоллекцияСтрокДерева = Неопределено Тогда
				КоллекцияСтрокДерева = ДеревоСтруктуры.Строки.Добавить();
				КоллекцияСтрокДерева.Группировка = "Объект";
				СоответствиеВетвей.Вставить("Объект", КоллекцияСтрокДерева);
			КонецЕсли;
		    ТекСтрокаДерева = КоллекцияСтрокДерева.Строки.Добавить();
			ТекСтрокаДерева.ИмяПоля = "";
            ТекСтрокаДерева.Группировка = "Объект";
			ТекСтрокаДерева.ПолноеИмяПоля 		= ТекПравило.ПолеФайлаПередачи;
			ТекСтрокаДерева.ПолеОбъекта 		= ТекПравило.ПолеОбъекта;
			ТекСтрокаДерева.ПорядокЗаполнения	= ТекПравило.ПорядокЗаполнения;
			ТекСтрокаДерева.ТабличнаяЧасть 		= ТекПравило.ТабличнаяЧасть;
			ТекСтрокаДерева.ДопДействия 		= ТекПравило.ДопДействия;
			ТекСтрокаДерева.Условие		 		= ТекПравило.Условие;
		ИначеЕсли ЗначениеЗаполнено(ТекПравило.ТабличнаяЧасть) Тогда
			КоллекцияСтрокДерева = СоответствиеВетвей.Получить(ТекПравило.ТабличнаяЧасть);
			Если КоллекцияСтрокДерева = Неопределено Тогда
				СтрокаРодитель = СоответствиеВетвей.Получить("Объект");
				Если СтрокаРодитель = Неопределено Тогда
					СтрокаРодитель = ДеревоСтруктуры;
				КонецЕсли;
				КоллекцияСтрокДерева = СтрокаРодитель.Строки.Добавить();
				КоллекцияСтрокДерева.Группировка = ТекПравило.ТабличнаяЧасть;
				СоответствиеВетвей.Вставить(ТекПравило.ТабличнаяЧасть, КоллекцияСтрокДерева);
			КонецЕсли;
		    ТекСтрокаДерева = КоллекцияСтрокДерева.Строки.Добавить();
			ТекСтрокаДерева.ИмяПоля = "";
            ТекСтрокаДерева.Группировка 		= ТекПравило.ТабличнаяЧасть;
			ТекСтрокаДерева.ПолноеИмяПоля 		= ТекПравило.ПолеФайлаПередачи;
			ТекСтрокаДерева.ПолеОбъекта 		= ТекПравило.ПолеОбъекта;
			ТекСтрокаДерева.ПорядокЗаполнения	= ТекПравило.ПорядокЗаполнения;
			ТекСтрокаДерева.ТабличнаяЧасть 		= ТекПравило.ТабличнаяЧасть;
			ТекСтрокаДерева.ДопДействия 		= ТекПравило.ДопДействия;
			ТекСтрокаДерева.Условие		 		= ТекПравило.Условие;
		ИначеЕсли ВРЕГ(Лев(ТекПравило.ПолеОбъекта, 22)) = "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ." Тогда
			КоллекцияСтрокДерева = СоответствиеВетвей.Получить("ПроизвольныеПараметры");
			Если КоллекцияСтрокДерева = Неопределено Тогда
				СтрокаРодитель = СоответствиеВетвей.Получить("Объект");
				Если СтрокаРодитель = Неопределено Тогда
					СтрокаРодитель = ДеревоСтруктуры;
				КонецЕсли;
				КоллекцияСтрокДерева = СтрокаРодитель.Строки.Добавить();
				КоллекцияСтрокДерева.Группировка = "ПроизвольныеПараметры";
				СоответствиеВетвей.Вставить("ПроизвольныеПараметры", КоллекцияСтрокДерева);
			КонецЕсли;
		    ТекСтрокаДерева = КоллекцияСтрокДерева.Строки.Добавить();
			ТекСтрокаДерева.ИмяПоля = "";
            ТекСтрокаДерева.Группировка 		= "ПроизвольныеПараметры";
			ТекСтрокаДерева.ПолноеИмяПоля 		= ТекПравило.ПолеФайлаПередачи;
			ТекСтрокаДерева.ПолеОбъекта 		= ТекПравило.ПолеОбъекта;
			ТекСтрокаДерева.ПорядокЗаполнения	= ТекПравило.ПорядокЗаполнения;
			ТекСтрокаДерева.ТабличнаяЧасть 		= ТекПравило.ТабличнаяЧасть;
			ТекСтрокаДерева.ДопДействия 		= ТекПравило.ДопДействия;
			ТекСтрокаДерева.Условие		 		= ТекПравило.Условие;
		КонецЕсли;
	КонецЦикла;
	
	// произвольные параметры используются для группировки ДокументыДвижений. Перенесем их в эту ветвь ....
	СкопироватьВетвьДерева(СоответствиеВетвей["ПроизвольныеПараметры"], СоответствиеВетвей["ДокументыДвижений"], Новый Структура("Группировка", "ДокументыДвижений"));
	// ... и удалим ненужную более ветвь ПроизвольныеПараметры
	СоответствиеВетвей["Объект"].Строки.Удалить(СоответствиеВетвей["ПроизвольныеПараметры"]);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("КонечныйЭлемент", Новый ОписаниеТипов("Булево"));
	СчетчикКолонок = 1;
	ЗаполнитьИменаПолейДереваСтруктуры(ДеревоСтруктуры, ТаблицаДанных, СчетчикКолонок);
	СтрокаТаблицы = Неопределено;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстФайла);
	ЭтоСекцияРасчСчет = Ложь;
	
	ТаблицаОстатковПоЛС = Новый ТаблицаЗначений;
	ТаблицаОстатковПоЛС.Колонки.Добавить("ЛицевойСчет");
	ТаблицаОстатковПоЛС.Колонки.Добавить("ЛицевойСчетСтрока");
	ТаблицаОстатковПоЛС.Колонки.Добавить("НачальныйОстаток");
	ТаблицаОстатковПоЛС.Колонки.Добавить("КонечныйОстаток");
	ТаблицаОстатковПоЛС.Колонки.Добавить("Отработано",Новый ОписаниеТипов("Булево"));
	
	МассивСчетов         = Новый Массив;
	ТекущийРасчетныйСчет = "";
	
	ТаблицаДанныхКопия   = "";
	
	НовСтрДанных = Ложь;
	ПерваяСекция = Истина;
	Для Счетчик=1 По ТекстовыйДокумент.КоличествоСтрок() Цикл
		ТекСтр = ТекстовыйДокумент.ПолучитьСтроку(Счетчик);
		Поз = Найти(ТекСтр, "=");
		Если Поз = 0 Тогда
			// обрабатываем служебные поля
			ИмяПоля = СокрЛП(ТекСтр);
			Если ИмяПоля = "СекцияРасчСчет" Тогда
				
		//		Если МассивСчетов.Найти(ТекущийРасчетныйСчет) =  Неопределено Тогда    //исправление ошибки: дублирование документов движений
				ЭтоСекцияРасчСчет  = Истина;
				НовСтрДанных       = Истина;
		//		КонецЕсли;
				
				ТаблицаДанныхКопия = ТаблицаДанных.Скопировать();
				
			ИначеЕсли ИмяПоля = "КонецРасчСчет" Тогда
				
				ЭтоСекцияРасчСчет                    = Ложь;	
				
				Если ЗначениеЗаполнено(ТекущийРасчетныйСчет) Тогда
					//если этот расчетный счет не повторялся в файле передачи ранее, 
					//чтобы не приводить к дублированию документов движений
					Если МассивСчетов.Найти(ТекущийРасчетныйСчет) = Неопределено Тогда
						МассивСчетов.Добавить(ТекущийРасчетныйСчет);
						СтрокаТаблицы                 = ТаблицаДанных.Добавить();
						СтрокаТаблицы.КонечныйЭлемент = Истина;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			Если ИмяПоля = "КонецДокумента" Тогда				
				СтрокаТаблицы = ТаблицаДанных.Добавить();
				СтрокаТаблицы.КонечныйЭлемент = Истина;
			КонецЕсли;
			//Если ТекСтр = "1CClientBankExchange" Тогда       
			//	СтрокаТаблицы = ТаблицаДанных.Добавить();
			//КонецЕсли;
		Иначе
			ИмяПоля = Лев(ТекСтр, Поз-1);
			Значение = Сред(ТекСтр, Поз+1);    
			
			Если ИмяПоля = "КонецДокумента" Тогда				
				СтрокаТаблицы = ТаблицаДанных.Добавить();
				СтрокаТаблицы.КонечныйЭлемент = Истина;
			КонецЕсли;  
			
			Если ИмяПоля = "СекцияДокумент" Тогда				
				СтрокаТаблицы.КонечныйЭлемент = Истина;
			КонецЕсли; 
			
			Если ЭтоСекцияРасчСчет Тогда   
				
				Если НовСтрДанных Тогда
			    	НовСтр = ТаблицаОстатковПоЛС.Добавить();
				КонецЕсли;
				Если ИмяПоля = "РасчСчет" Тогда
					ТекущийРасчетныйСчет     = Значение;
					Если МассивСчетов.Найти(ТекущийРасчетныйСчет) <> Неопределено Тогда
						 НовСтрДанных        = Ложь;
					//	 ТаблицаДанных       = ТаблицаДанныхКопия.Скопировать();                             //исправление ошибки: в ходе импорта данных не загружался первый
					КонецЕсли;                                                                               //документ движения выписки
					ТекЛС                    = БиблиотекаФункцийОбмена.НайтиЛицевойСчетПоНомеру(Значение);    
					Если НЕ ЗначениеЗаполнено(ТекЛС) Тогда
						БиблиотекаФункцийОбмена.ПрерватьЗагрузкуФайла("Не найден лицевой счет %1", Значение);		
					КонецЕсли;
					НовСтр.ЛицевойСчетСтрока = Значение;
					НовСтр.ЛицевойСчет       = ТекЛС;
				ИначеЕсли ИмяПоля = "НачальныйОстаток" ИЛИ ИмяПоля = "КонечныйОстаток" Тогда
					НовСтр[ИмяПоля] = БиблиотекаФункцийОбмена.СтрокаВЧисло(Значение);
				КонецЕсли;
				
			КонецЕсли;
			
			СтрокаСтруктуры = ДеревоСтруктуры.Строки.Найти(ИмяПоля ,"ПолноеИмяПоля", Истина);
			
			Если СтрокаСтруктуры = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаТаблицы = Неопределено Тогда
				НовСтрДанных = Ложь;
				Если СтрокаСтруктуры.Группировка = "Объект" Тогда
					СтрокаТаблицы = ТаблицаДанных.Добавить();
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если НовСтрДанных Тогда
				СтрокаТаблицы = ТаблицаДанных.Добавить();
			КонецЕсли;
			
			СтрокаТаблицы[СтрокаСтруктуры.ИмяПоляТаблицы] = Значение;
			
			Если Найти(СтрокаСтруктуры.ПолеОбъекта, "ДатаДвижения") > 0 И Значение = "" Тогда
				 СтрокаТаблицы[СтрокаСтруктуры.ИмяПоляТаблицы] = "Х"
			КонецЕсли;
			//КонецЕсли;	
						
		КонецЕсли;
		
	КонецЦикла;
	
	// Разделим таблицу на таблицу выписок и таблицу документов движений
	// Массив имен колонок, по которым будем разделять таблицу. Т.к. поля не обязательны, используем массив.
	МассивИмен = Новый Массив;
	МассивИмен.Добавить("КонецРасчСчет");
	МассивИмен.Добавить("КонечныйОстаток");
	МассивИмен.Добавить("ВсегоСписано");
    МассивИмен.Добавить("ВсегоПоступило");
	МассивИмен.Добавить("НачальныйОстаток");
	ИмяПоля = "";    // Имя колонки, по которой будем делить
	Для Каждого ЭлементМассива Из МассивИмен Цикл
		СтрокаДерева = ДеревоСтруктуры.Строки.Найти(ЭлементМассива,"ПолноеИмяПоля",Истина);
		Если СтрокаДерева <> Неопределено Тогда
			ИмяПоля = СтрокаДерева.ИмяПоляТаблицы;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ПерваяТаблица = Истина;
	ИменаКолонокВып = "КонечныйЭлемент";
	ИменаКолонокДвиж = "КонечныйЭлемент";
	КоличествоКолонок = ТаблицаДанных.Колонки.Количество()-1;
	//ИменаКолонок	= Новый Массив(КоличествоКолонок);
	Для i=1 По КоличествоКолонок Цикл
		ИмяКолонки = ТаблицаДанных.Колонки[i].Имя;
		Если ПерваяТаблица Тогда
			Если ИмяКолонки = ИмяПоля Тогда
				ПерваяТаблица = Ложь;
			КонецЕсли;
			ИменаКолонокВып = ИменаКолонокВып + ", "+ ИмяКолонки;
		Иначе			
			ИменаКолонокДвиж = ИменаКолонокДвиж + ", "+ ИмяКолонки;
		КонецЕсли;
	КонецЦикла;
	//ИменаКолонокВып = Сред(ИменаКолонокВып,3);
	//ИменаКолонокДвиж = Сред(ИменаКолонокДвиж,3);
	ТаблицаВыписок = ТаблицаДанных.Скопировать(,ИменаКолонокВып);
	ТаблицаДокДвиж = ТаблицаДанных.Скопировать(,ИменаКолонокДвиж);
	
	МассивИменСтрок = Новый Массив;
	МассивИменСтрок.Добавить("ВерсияФормата");
	МассивИменПолейТД = Новый Массив;
	Для Каждого ЭлМас Из МассивИменСтрок Цикл
		ТекСтрока = ДеревоСтруктуры.Строки.Найти(ЭлМас, "ПолноеИмяПоля",Истина);
		Если ТекСтрока <> Неопределено Тогда
			МассивИменПолейТД.Добавить(ТекСтрока.ИмяПоляТаблицы);	
		КонецЕсли;
	КонецЦикла;
	
	СвернутьТаблицуЗначений(ТаблицаВыписок,МассивИменПолейТД);
	
	МассивИменСтрок = Новый Массив;
	МассивИменСтрок.Добавить("СекцияДокумент");
	МассивИменПолейТД = Новый Массив;
	Для Каждого ЭлМас Из МассивИменСтрок Цикл
		ТекСтрока = ДеревоСтруктуры.Строки.Найти(ЭлМас, "ПолноеИмяПоля", Истина);
		Если ТекСтрока <> Неопределено Тогда
			МассивИменПолейТД.Добавить(ТекСтрока.ИмяПоляТаблицы);	
		КонецЕсли;
	КонецЦикла;
	
	СвернутьТаблицуЗначений(ТаблицаДокДвиж, МассивИменПолейТД);
	
	Для каждого Строка Из ТаблицаДокДвиж Цикл
		Для каждого Колонка Из ТаблицаДокДвиж.Колонки Цикл
			Если Строка[Колонка.Имя] = "Х" Тогда
				 Строка[Колонка.Имя] = ""
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаВыписок.Свернуть(ИменаКолонокВып);
	
	МассивСтрокКУдалению = Новый Массив;
	ИмяПоля = "ПлательщикСчет";
	СтрДер =  ДеревоСтруктуры.Строки.Найти(ИмяПоля,"ПолноеИмяПоля",Истина);
	
	Для Каждого СтрТЧ Из ТаблицаДокДвиж Цикл
		Если Не ЗначениеЗаполнено(СтрТЧ[СтрДер.ИмяПоляТаблицы]) Тогда
			МассивСтрокКУдалению.Добавить(СтрТЧ);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлМас Из МассивСтрокКУдалению Цикл
		ТаблицаДокДвиж.Удалить(ЭлМас);
	КонецЦикла;
		
    ИмяПоляПлательщикСчет 			= ДеревоСтруктуры.Строки.Найти("ПлательщикСчет", "ПолноеИмяПоля",Истина).ИмяПоляТаблицы;
	ИмяПоляПолучательСчет 			= ДеревоСтруктуры.Строки.Найти("ПолучательСчет", "ПолноеИмяПоля",Истина).ИмяПоляТаблицы;
	ИмяПоляРасчСчет 				= ДеревоСтруктуры.Строки.Найти("РасчСчет",       "ПолноеИмяПоля",Истина).ИмяПоляТаблицы;
	ИмяПоляДатаПоступило 			= ДеревоСтруктуры.Строки.Найти("ДатаПоступило",  "ПолноеИмяПоля",Истина).ИмяПоляТаблицы;
	ИмяПоляДатаСписано 				= ДеревоСтруктуры.Строки.Найти("ДатаСписано",    "ПолноеИмяПоля",Истина).ИмяПоляТаблицы;
	
	Запрос 							= Новый Запрос;
	Запрос.УстановитьПараметр("ТабВып",ТаблицаВыписок);
	Запрос.УстановитьПараметр("ТабДвиж",ТаблицаДокДвиж);
	
	СтрКолонкиВып 					= "";
	Для Каждого КолонкаТЧ Из ТаблицаВыписок.Колонки Цикл
		Если КолонкаТЧ.Имя = "КонечныйЭлемент" Тогда
			Продолжить;
		КонецЕсли;
		СтрКолонкиВып = СтрКолонкиВып +?(СтрКолонкиВып="","",", ") + КолонкаТЧ.Имя+" КАК  "+ КолонкаТЧ.Имя;// "ВЫРАЗИТЬ("+КолонкаТЧ.Имя+" КАК СТРОКА(1000))"
	КонецЦикла;
	
	СтрКолонкиДвиж = "";
	Для Каждого КолонкаТЧ Из ТаблицаДокДвиж.Колонки Цикл
		Если КолонкаТЧ.Имя = "КонечныйЭлемент" Тогда
			Продолжить;
		КонецЕсли;
		СтрКолонкиДвиж = СтрКолонкиДвиж +?(СтрКолонкиДвиж = "","",", ") + КолонкаТЧ.Имя+" КАК  "+ КолонкаТЧ.Имя;//"ВЫРАЗИТЬ("+КолонкаТЧ.Имя+" КАК СТРОКА(1000))"
	КонецЦикла;
	
	Запрос.Текст = 
			"ВЫБРАТЬ
			| "+СтрКолонкиВып+"
			|ПОМЕСТИТЬ ТабВыписок
			|ИЗ
			|	&ТабВып КАК ТабВып
			|;
            |
			|////////////////////////////////////////////////////////////////////////////////
            |
			|ВЫБРАТЬ
			|	"+СтрКолонкиДвиж+"
			|ПОМЕСТИТЬ ТабДокументов
			|ИЗ
			|	&ТабДвиж КАК ТабДвиж
			|;
            |
			|////////////////////////////////////////////////////////////////////////////////
            |
			|Выбрать
			|*
			|Из 
			|ТабВыписок
			|Левое Соединение ТабДокументов По
			|ТабВыписок."+ИмяПоляРасчСчет+" = ТабДокументов."+ИмяПоляПлательщикСчет+" И ТабДокументов."+ИмяПоляДатаСписано+"<>"""" ИЛИ ТабВыписок."+ИмяПоляРасчСчет+" = ТабДокументов."+ИмяПоляПолучательСчет+" И ТабДокументов."+ИмяПоляДатаПоступило+"<>""""";
			
	Результат = Запрос.Выполнить();

	ОбщаяТаблица = Результат.Выгрузить();

	//СвернутьТаблицуЗначений(ТаблицаДанных);
	
	// создание схемы компоновки данных
	СхемаКомпоновкиРезультата = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиРезультата.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновкиРезультата.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя 			= "НаборДанных1";
	НаборДанных.ИмяОбъекта 		= "ВходящиеДанные";
	НаборДанных.ИсточникДанных 	= "ИсточникДанных1";
	
	РазрешенныеМодули = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("БИБЛИОТЕКАФУНКЦИЙОБМЕНА");
	СоответствиеГруппировок = Новый Соответствие;
	СоздатьСтруктуруСхемыКомпоновкиИзДерева(ДеревоСтруктуры, СхемаКомпоновкиРезультата.НастройкиПоУмолчанию, СхемаКомпоновкиРезультата, НаборДанных, РазрешенныеМодули, СоответствиеГруппировок);	
	
	ВнешниеНаборы = Новый Структура("ВходящиеДанные", ОбщаяТаблица);
	ФорматЗагрузки = Формат;
	
	Параметр = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя = "КассовыйОрган";
	Параметр.Значение = Задание.КассовыйОрган;
	Параметр.ВключатьВДоступныеПоля = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	//Параметр = СхемаКомпоновкиРезультата.Параметры.Добавить();
	//Параметр.Имя = "Задание";
	//Параметр.Значение = Задание.Ссылка;
	//Параметр.ВключатьВДоступныеПоля = Ложь;
	//Параметр.ОграничениеИспользования = Истина;
	
	НастройкиКомпоновки = СхемаКомпоновкиРезультата.НастройкиПоУмолчанию;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиРезультата, НастройкиКомпоновки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы,,Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ДеревоЗначений);
	
	РезультатВыполнения = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	СокращенноеДеревоСтруктуры = Новый ДеревоЗначений;
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Группировка", Новый ОписаниеТипов("Строка"));
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Поля", Новый ОписаниеТипов("Массив"));
	СократитьДерево(ДеревоСтруктуры, СокращенноеДеревоСтруктуры, СоответствиеГруппировок); 
	ЭтоПервый = Истина;

	
	Для каждого СтрокаРезультата Из РезультатВыполнения.Строки Цикл
		
		СтрокаГруппировки = СокращенноеДеревоСтруктуры.Строки[0];
		Попытка
			СтрокаРезультата.Строки.Сортировать("ПроизвольныеПараметрыДатаДвижения Возр");
		Исключение
			
		КонецПопытки;
		
		СтрокаРеквизитов = "";
		Для каждого ТекПоле Из СтрокаГруппировки.Поля Цикл
			СтрокаРеквизитов = СтрокаРеквизитов + "," +ТекПоле;
		КонецЦикла;
		СтрокаРеквизитов = Сред(СтрокаРеквизитов, 2);
		//ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаРезультата, СтрокаРеквизитов);
		//ЗаполнитьЗначенияСвойств(ДокументОбъект, Задание, "Организация");
		//Если ДокументОбъект.Ссылка.Пустая() Тогда
		//	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		//КонецЕсли;
		ДокументОбъект = Неопределено;
		Для каждого ВложеннаяГруппировка Из СтрокаГруппировки.Строки Цикл
			//Если ЭтоПервый И КоличествоСтрок>0 Тогда
			//	ДатаДокумента = СтрокаРезультата.Строки[1].ПроизвольныеПараметрыДатаДок;
			//ДокументОбъект = ПолучитьВыпискуИзЛицевогоСчета(ДокументОбъект, Задание.Организация, СтрокаРезультата.ЛицевойСчет, ДатаДокумента, СтрокаРеквизитов, СтрокаРезультата);
			
			СтрокаРеквизитов = "";
			Для каждого ТекПоле Из ВложеннаяГруппировка.Поля Цикл
				Если Лев(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка)+1) = ВложеннаяГруппировка.Группировка+"." Тогда
					СтрокаРеквизитов = СтрокаРеквизитов + "," +Сред(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка)+2);	
				Иначе
					СтрокаРеквизитов = СтрокаРеквизитов + "," +ТекПоле;
				КонецЕсли;
			КонецЦикла;
			СтрокаРеквизитов = Сред(СтрокаРеквизитов, 2);
			Если Найти(СтрокаРеквизитов, ".") = 0 Тогда
				
				Попытка
					Если СтрокаРезультата.Строки[1].ПроизвольныеПараметрыВидДокумента = Null Тогда
						//Нет документов движений
						ДатаВыписки = СтрокаРезультата.Дата;
					Иначе
						ДатаВыписки = СтрокаРезультата.Строки[1].ПроизвольныеПараметрыДатаДвижения;
						Если Не ЗначениеЗаполнено(ДатаВыписки) Тогда
							ДатаВыписки = СтрокаРезультата.Дата;
						КонецЕсли;
					КонецЕсли;
				Исключение
					ДатаВыписки = СтрокаРезультата.Дата;
				КонецПопытки;
				
				ЛицевойСчет = СтрокаРезультата.ЛицевойСчет;

				ДокументОбъект = ПолучитьВыпискуИзЛицевогоСчета(ДокументОбъект, Задание, ЛицевойСчет, ДатаВыписки, СтрокаРеквизитов, СтрокаРезультата, Формат, ИмяФайла);
			
				// в СтрокаРеквизитов только имена табличной части
				СтруктураПроверки = Новый Структура(СтрокаРеквизитов);
				Для каждого ВложеннаяСтрока Из СтрокаРезультата.Строки Цикл
					ЕстьЗаполненные = Ложь;
					Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
						СтруктураПроверки[ЗначениеПроверки.Ключ] = ВложеннаяСтрока[ВложеннаяГруппировка.Группировка+ЗначениеПроверки.Ключ];	
						ЕстьЗаполненные = Макс(ЕстьЗаполненные, ЗначениеЗаполнено(СтруктураПроверки[ЗначениеПроверки.Ключ]));
					КонецЦикла;
					Если ЕстьЗаполненные Тогда
						ЗаполнитьЗначенияСвойств(ДокументОбъект[ВложеннаяГруппировка.Группировка].Добавить(), СтруктураПроверки);
					КонецЕсли;
				КонецЦикла; 
			Иначе
				// в СтрокаРеквизитов есть дополнительные параметры. Требуется выделение параметров и вызов процедуры
				СтруктураПроверки = Новый Структура(СтрЗаменить(СтрокаРеквизитов, ".", ""));	
				Для каждого ВложеннаяСтрока Из СтрокаРезультата.Строки Цикл
					ЕстьЗаполненные = Ложь;
					ЗаполнитьЗначенияСвойств(СтруктураПроверки, ВложеннаяСтрока);
					Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
						ЕстьЗаполненные = Макс(ЕстьЗаполненные, ЗначениеЗаполнено(СтруктураПроверки[ЗначениеПроверки.Ключ]));
						Если ЕстьЗаполненные Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если ЕстьЗаполненные Тогда
						Попытка
							ДатаДокумента = ВложеннаяСтрока.ПроизвольныеПараметрыДатаДвижения;
						Исключение
							ДатаДокумента = ВложеннаяСтрока.Дата;
						КонецПопытки;
						
						ЛицевойСчет = ВложеннаяСтрока.ЛицевойСчет;
						
						ДокументОбъект = ПолучитьВыпискуИзЛицевогоСчета(ДокументОбъект, Задание, ЛицевойСчет, ДатаДокумента, СтрокаРеквизитов, ВложеннаяСтрока, Формат, ИмяФайла);

						ФункцияЗаполнения = ВложеннаяСтрока["ДокументыДвиженийИсполняющийДокумент"];
						ДеревоВыполнения = СоздатьДеревоВыполнения(ФункцияЗаполнения);
						ПараметрыВызоваФункции = Новый Структура;
						Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
							Если ВРЕГ(Лев(ЗначениеПроверки.Ключ, 21)) = "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ" Тогда
								ПараметрыВызоваФункции.Вставить(Сред(ЗначениеПроверки.Ключ, 22), ЗначениеПроверки.Значение);
							КонецЕсли;
						КонецЦикла; 
						
						ИсполняющийДокумент = Неопределено;
						ОбработатьДеревоВариантов(ДеревоВыполнения, ПараметрыВызоваФункции, ИсполняющийДокумент, ДокументОбъект, Задание, ДанныеНовыхКонтрагентов);	
											
						Если ЗначениеЗаполнено(ИсполняющийДокумент) Тогда
							ДокументОбъект.ДокументыДвижений.Добавить().ИсполняющийДокумент = ИсполняющийДокумент;
						КонецЕсли;
						
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли;
		КонецЦикла; 
		
		Если Задание.ОбъектыОбмена.Найти(ДокументОбъект.Ссылка) = Неопределено Тогда
			
			ПересчитатьСуммуОстатковВыпискиИзЛС(Задание, ДокументОбъект);
			
			НовСтрокаЗадания = Задание.ОбъектыОбмена.Добавить();
			НовСтрокаЗадания.ИмяФайлаЗагрузки	    = ИмяФайла;
			НовСтрокаЗадания.Формат				    = Формат;
			НовСтрокаЗадания.Объект				    = ДокументОбъект.Ссылка;
			
		КонецЕсли;
				
	КонецЦикла; 
КонецПроцедуры

Функция ПолучитьВыпискуИзЛицевогоСчета(Знач ИсхДокументОбъект, Задание, ЛицевойСчет, ДатаВыписки, СтрокаРеквизитов, СтрокаРезультата, Формат, ИмяФайла)
	
	Если ТипЗнч(ИсхДокументОбъект) = Тип("ДокументОбъект.ВыпискаИзЛицевогоСчета") Тогда
		Если ИсхДокументОбъект.ДатаВыписки = ДатаВыписки И ИсхДокументОбъект.ЛицевойСчет = ЛицевойСчет Тогда
			Возврат ИсхДокументОбъект;
		Иначе
			Если Задание.ОбъектыОбмена.Найти(ИсхДокументОбъект.Ссылка) = Неопределено Тогда

				ПересчитатьСуммуОстатковВыпискиИзЛС(Задание,ИсхДокументОбъект);
				
				НовСтрокаЗадания = Задание.ОбъектыОбмена.Добавить();
				НовСтрокаЗадания.ИмяФайлаЗагрузки	= ИмяФайла;
				НовСтрокаЗадания.Формат				= Формат;
				НовСтрокаЗадания.Объект				= ИсхДокументОбъект.Ссылка;
				
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ВыпискаИзЛицевогоСчета.Ссылка
	                      |ИЗ
	                      |	Документ.ВыпискаИзЛицевогоСчета КАК ВыпискаИзЛицевогоСчета
	                      |ГДЕ
	                      |	ВыпискаИзЛицевогоСчета.ДатаВыписки = &ДатаВыписки
	                      |	И ВыпискаИзЛицевогоСчета.ЛицевойСчет = &ЛицевойСчет
	                      |	И ВыпискаИзЛицевогоСчета.Организация = &Организация
	                      |	И НЕ ВыпискаИзЛицевогоСчета.ПометкаУдаления");
	Запрос.УстановитьПараметр("Организация", Задание.Организация);							  
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);							  
	Запрос.УстановитьПараметр("ДатаВыписки", ДатаВыписки);
	СохраненныйДокумент = Запрос.Выполнить().Выгрузить();
	Если СохраненныйДокумент.Количество() = 0 Тогда
		ДокументОбъект = Документы.ВыпискаИзЛицевогоСчета.СоздатьДокумент();
	Иначе
		ДокументОбъект = СохраненныйДокумент[0].Ссылка.ПолучитьОбъект();
		Попытка
			ЗаблокироватьДанныеДляРедактирования(ДокументОбъект.Ссылка);
		Исключение
			ВызватьИсключение НСтр("ru='Невозможно заблокировать для редактирования документ '")+СохраненныйДокумент;
		КонецПопытки;
		ДокументОбъект.Остатки.Очистить();
		ДокументОбъект.ДокументыДвижений.Очистить();
	КонецЕсли;
	//Если НЕ ЭтоОстатки Тогда
	//	ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаРезультата, СтрокаРеквизитов);
	//КонецЕсли;
	ДокументОбъект.Дата = ДатаВыписки;
	ДокументОбъект.ДатаВыписки = ДатаВыписки;
	ДокументОбъект.Организация = Задание.Организация;
	ДокументОбъект.ЛицевойСчет = ЛицевойСчет;
	ДокументОбъект.КассовыйОрган = Задание.КассовыйОрган;

	Если ДокументОбъект.Ссылка.Пустая() Тогда
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Возврат ДокументОбъект;

КонецФункции // ()

Процедура СвернутьТаблицуЗначений(ТаблицаДанных, МассивИменПолей) Экспорт
	ИмяПоля = "";
	ЕстьПроверка = Ложь;
	Если МассивИменПолей.Количество()> 0 Тогда
		ЕстьПроверка = Истина;
	КонецЕсли;
	// заполним колонки конечных элементов значениями из вышестоящих неконечных элементов
	КоличествоКолонок = ТаблицаДанных.Колонки.Количество()-1;
	ИменаКолонок	= Новый Массив(КоличествоКолонок);
	Для i=1 По КоличествоКолонок Цикл
		ИменаКолонок[i-1] = ТаблицаДанных.Колонки[i].Имя;
	КонецЦикла;
		
	ДанныеЗаполнения = Новый Массив(КоличествоКолонок);
	Для каждого ТекСтрока Из ТаблицаДанных Цикл
		Если ТекСтрока.КонечныйЭлемент Тогда
			Для i=0 По КоличествоКолонок-1 Цикл
				Если Не ЗначениеЗаполнено(ТекСтрока[ИменаКолонок[i]]) И ЗначениеЗаполнено(ДанныеЗаполнения[i]) Тогда
					ТекСтрока[ИменаКолонок[i]] = ДанныеЗаполнения[i];
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если ЕстьПроверка Тогда
				Для Каждого ИмяПоля Из МассивИменПолей Цикл
					Если ТаблицаДанных.Колонки.Найти(ИмяПоля)= Неопределено Тогда
						Продолжить;
					КонецЕсли;
					Если ТекСтрока[ИмяПоля] <> "" Тогда
						ДанныеЗаполнения = Новый Массив(КоличествоКолонок);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Для i=0 По КоличествоКолонок-1 Цикл			
				Если ЗначениеЗаполнено(ТекСтрока[ИменаКолонок[i]]) Тогда
					ДанныеЗаполнения[i] = ТекСтрока[ИменаКолонок[i]];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла; 
	// удалим все неконечные элементы из таблицы данных
	НеконечныеЭлементы = ТаблицаДанных.НайтиСтроки(Новый Структура("КонечныйЭлемент", Ложь));
	Для каждого ТекЭлемент Из НеконечныеЭлементы Цикл
		Если ТаблицаДанных.Количество() > 1 Тогда
		//оставить хотя бы один элемент, если все неконечные
			ТаблицаДанных.Удалить(ТекЭлемент);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ПолучитьСуммыПоступленияСписанияИзВыписки(ВыпискаСсылка,СуммаПоступило,СуммаСписано)

	СуммаПоступило = 0;
	СуммаСписано = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыпискаИзЛицевогоСчетаДокументыДвижений.ИсполняющийДокумент,
		|	ВЫБОР
		|		КОГДА ВыпискаИзЛицевогоСчетаДокументыДвижений.ИсполняющийДокумент ССЫЛКА Документ.КассовоеПоступление
		|			ТОГДА ВыпискаИзЛицевогоСчетаДокументыДвижений.ИсполняющийДокумент.СуммаДокумента
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПоступило,
		|	ВЫБОР
		|		КОГДА ВыпискаИзЛицевогоСчетаДокументыДвижений.ИсполняющийДокумент ССЫЛКА Документ.КассовоеПоступление
		|			ТОГДА 0
		|		ИНАЧЕ ВыпискаИзЛицевогоСчетаДокументыДвижений.ИсполняющийДокумент.СуммаДокумента
		|	КОНЕЦ КАК СуммаСписано
		|ИЗ
		|	Документ.ВыпискаИзЛицевогоСчета.ДокументыДвижений КАК ВыпискаИзЛицевогоСчетаДокументыДвижений
		|ГДЕ
		|	ВыпискаИзЛицевогоСчетаДокументыДвижений.Ссылка = &Ссылка
		|ИТОГИ
		|	СУММА(СуммаПоступило),
		|	СУММА(СуммаСписано)
		|ПО
		|	ОБЩИЕ";

	Запрос.УстановитьПараметр("Ссылка", ВыпискаСсылка);

	Результат = Запрос.Выполнить();

	Выгрузка = Результат.Выгрузить();

	Если Выгрузка.Количество()>0 Тогда
		СуммаПоступило = Выгрузка[0].СуммаПоступило;
		СуммаСписано = Выгрузка[0].СуммаСписано;
	КонецЕсли;
КонецПроцедуры

Процедура ПересчитатьСуммуОстатковВыпискиИзЛС(Задание,ВыпискаОбъект)
	
	Перем СуммаПоступило;
	Перем СуммаСписано;
	
	ОстНаНачало = 0;
	
	Если Задание.ОбъектыОбмена.Количество() > 0 Тогда
		ПоследняяВыписка = Задание.ОбъектыОбмена[Задание.ОбъектыОбмена.Количество()-1].Объект;
		Если ПоследняяВыписка.Остатки.Количество() > 0 И ПоследняяВыписка.ЛицевойСчет = ВыпискаОбъект.ЛицевойСчет Тогда
			ОстНаНачало     = ПоследняяВыписка.Остатки[0].ОстатокНаКонецДня;
			ИсточникСредств = ПоследняяВыписка.Остатки[0].ИсточникСредств;
			Показатель      = ПоследняяВыписка.Остатки[0].Показатель;
		КонецЕсли;	
		ВыпискаОбъект.ДатаПредыдущейВыписки = ПоследняяВыписка.ДатаВыписки;
	КонецЕсли;
	//Записываем документ перед тем как пересчитать ТЧ Остатки
	ВыпискаОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	ПолучитьСуммыПоступленияСписанияИзВыписки(ВыпискаОбъект.Ссылка, СуммаПоступило, СуммаСписано);
	
	Если ВыпискаОбъект.Остатки.Количество() = 0 Тогда
		СтрокаОстатков                      = ВыпискаОбъект.Остатки.Добавить();
		СтрокаОстатков.ИсточникСредств      = ИсточникСредств;
		СтрокаОстатков.Показатель           = Показатель;
		СтрокаОстатков.ОстатокНаНачалоДня   = ОстНаНачало;
		СтрокаОстатков.ОстатокНаКонецДня    = ОстНаНачало + СуммаПоступило - СуммаСписано;
	Иначе
		СтрокаОстатков = ВыпискаОбъект.Остатки[0];
		СтрокаОстатков.ОстатокНаКонецДня = СтрокаОстатков.ОстатокНаНачалоДня + СуммаПоступило - СуммаСписано;
	КонецЕсли;
	
	ВыпискаОбъект.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры

Процедура ОбработатьДеревоВариантов(ДеревоВыполнения, ПараметрыВызоваФункции, ИсполняющийДокумент, Объект, Задание, ДанныеНовыхКонтрагентов)
	
	Для каждого ТекВариантВыполнения Из ДеревоВыполнения.Строки Цикл
	
		Если ЗначениеЗаполнено(ИсполняющийДокумент) Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекВариантВыполнения.Вариант = "Действие" Тогда
			ИсполняющийДокумент = ВыполнитьТекущееДействие(ТекВариантВыполнения.Действие, ПараметрыВызоваФункции, Объект, Задание, ДанныеНовыхКонтрагентов);
		ИначеЕсли ТекВариантВыполнения.Вариант = "Вариант" Тогда
			УсловиеВыполнено = ПроверитьВыполнениеУсловияВыполнения(ТекВариантВыполнения.Условие, ПараметрыВызоваФункции);
			ТекВетка = ДеревоВыполнения.Строки[0].Строки.Найти(Строка(УсловиеВыполнено), "Вариант", Ложь); 
			ОбработатьДеревоВариантов(ТекВетка, ПараметрыВызоваФункции, ИсполняющийДокумент, Объект, Задание, ДанныеНовыхКонтрагентов);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Функция ВыполнитьТекущееДействие(Знач Действие, Параметры, Объект, Задание, ДанныеНовыхКонтрагентов)
	Действие = ВРег(Действие);
	Если Действие = "ОПРЕДЕЛИТЬПЛАТЕЖНОЕПОРУЧЕНИЕ" Тогда
		Возврат БиблиотекаФункцийОбмена.ОпределитьПлатежноеПоручение(Объект.ЛицевойСчет.Код, Объект.Организация, Параметры);
	ИначеЕсли Действие = "СОЗДАТЬПП" Тогда
		Возврат БиблиотекаФункцийОбмена.СоздатьПП(Параметры, Объект);
	ИначеЕсли Действие = "СОЗДАТЬПЛАТЕЖНОЕТРЕБОВАНИЕ" Тогда
		Возврат БиблиотекаФункцийОбмена.СоздатьПлатежноеТребование(Параметры, Объект);
	ИначеЕсли Действие = "КАССОВОЕПОСТУПЛЕНИЕПОПП" Тогда
		Возврат БиблиотекаФункцийОбмена.КассовоеПоступлениеПоПП(Параметры, Объект, Истина, Истина, Задание.ВидОбмена, ДанныеНовыхКонтрагентов);
	ИначеЕсли Действие = "КАССОВОЕВЫБЫТИЕПОПП" Тогда
		Возврат БиблиотекаФункцийОбмена.КассовоеВыбытиеПоПП(Параметры, Объект, Истина, Задание.ВидОбмена, ДанныеНовыхКонтрагентов);
	КонецЕсли;
	Возврат Неопределено;		
КонецФункции

Функция ПроверитьВыполнениеУсловияВыполнения(Условие, Параметры)
	ВидыСравнений = Новый Массив;
	ВидыСравнений.Добавить("=");
	ВидыСравнений.Добавить("<>");
	ВидыСравнений.Добавить(">");
	ВидыСравнений.Добавить("<");
	
	Результат = Ложь;
	
	Для каждого ТекВидСравнения Из ВидыСравнений Цикл
	
		Поз = Найти(Условие, ТекВидСравнения);
		Если Поз>0 Тогда
			ЛеваяСтрона = СокрЛП(Лев(Условие, Поз-1));
			ПраваяСторона = СокрЛП(Сред(Условие, Поз+СтрДлина(ТекВидСравнения)));
			
			Если ВРЕГ(Лев(ЛеваяСтрона, 22)) = "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ." Тогда
				ЗначениеПараметра = Неопределено;
				Параметры.Свойство(Сред(ЛеваяСтрона,23), ЗначениеПараметра);
			Иначе
				ЗначениеПараметра = ЛеваяСтрона;
			КонецЕсли;
			Если ВРЕГ(Лев(ПраваяСторона, 22)) = "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ." Тогда
				ЗначениеСравнения = Неопределено;
				Параметры.Свойство(Сред(ПраваяСторона,23), ЗначениеСравнения);
			Иначе
				ЗначениеСравнения = ПраваяСторона;
			КонецЕсли;
			
			Если ТипЗнч(ЗначениеПараметра) = Тип("Строка") Тогда
				Если Лев(ПраваяСторона,1) = Строка("""") Тогда
					ЗначениеСравнения = Сред(ПраваяСторона, 2, СтрДлина(ПраваяСторона)-2);
				Иначе
					ЗначениеСравнения = ПраваяСторона;
				КонецЕсли;
			ИначеЕсли ТипЗнч(ЗначениеПараметра) = Тип("Число") Тогда
				ЗначениеСравнения = Число(ПраваяСторона);
			КонецЕсли;
			Если ТекВидСравнения = "=" Тогда
				Результат = ЗначениеПараметра = ЗначениеСравнения;
			ИначеЕсли ТекВидСравнения = "<>" Тогда
				Результат = ЗначениеПараметра <> ЗначениеСравнения;
			ИначеЕсли ТекВидСравнения = ">" Тогда
				Результат = ЗначениеПараметра > ЗначениеСравнения;
			ИначеЕсли ТекВидСравнения = "<" Тогда
				Результат = ЗначениеПараметра < ЗначениеСравнения;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	Если Результат Тогда
		Возврат "Истина";
	Иначе
		Возврат "Ложь";
	КонецЕсли;
	
КонецФункции

Функция СоздатьДеревоВыполнения(Знач ФункцияЗаполнения)
	ДеревоДействий = Новый ДеревоЗначений;
	ДеревоДействий.Колонки.Добавить("Условие", Новый ОписаниеТипов("Строка"));
	ДеревоДействий.Колонки.Добавить("Действие", Новый ОписаниеТипов("Строка"));
	ДеревоДействий.Колонки.Добавить("Вариант", Новый ОписаниеТипов("Строка"));
	ДеревоДействий.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	
	СоздатьВетвьВарианта(ФункцияЗаполнения, ДеревоДействий);
	
	ДеревоРезультат = Новый ДеревоЗначений;
	ДеревоРезультат.Колонки.Добавить("Условие", Новый ОписаниеТипов("Строка"));
	ДеревоРезультат.Колонки.Добавить("Действие", Новый ОписаниеТипов("Строка"));
	ДеревоРезультат.Колонки.Добавить("Вариант", Новый ОписаниеТипов("Строка"));
	ДеревоРезультат.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	
	СобратьДеревоВариантов(ФункцияЗаполнения, ДеревоДействий, ДеревоРезультат);
	
	Возврат ДеревоРезультат;
	
КонецФункции

Процедура СобратьДеревоВариантов(Формула, ДеревоДействий, ДеревоРезультат)
	ЧастиФормулы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Формула, ";", Истина);	
	Для каждого ЧастьФормулы Из ЧастиФормулы Цикл
		
		ЧастьФормулы = СокрЛП(ЧастьФормулы);
		ТекДействие = ДеревоРезультат.Строки.Добавить();
		Если Лев(ЧастьФормулы, 1) = "[" Тогда
			НомерВарианта = Сред(ЧастьФормулы, 9, СтрДлина(ЧастьФормулы)-9);
			Вариант = ДеревоДействий.Строки.НайтиСтроки(Новый Структура("Вариант, Номер", "Вариант", НомерВарианта), Истина)[0];
			ЗаполнитьЗначенияСвойств(ТекДействие, Вариант, "Вариант, Условие");
			
			ВеткаИстина = ТекДействие.Строки.Добавить();
			ВеткаИстина.Вариант = "Истина";
			ВариантИстина = Вариант.Строки.Найти("Истина", "Вариант");
			СобратьДеревоВариантов(ВариантИстина["Действие"], ДеревоДействий, ВеткаИстина);
			
			ВеткаЛожь = ТекДействие.Строки.Добавить();
			ВеткаЛожь.Вариант = "Ложь";
			ВариантЛожь = Вариант.Строки.Найти("Ложь", "Вариант");
			СобратьДеревоВариантов(ВариантЛожь["Действие"], ДеревоДействий, ВеткаЛожь);
		Иначе 
			ТекДействие.Вариант = "Действие";
			ТекДействие.Действие = ЧастьФормулы;
		КонецЕсли;
	
	КонецЦикла; 
	
КонецПроцедуры

Процедура СоздатьВетвьВарианта(Формула, Корень, Номер = 1)
	Если Найти(Формула, "?")=0 Тогда
		Возврат;
	КонецЕсли;
	
	ВременнаяСтрока = Формула;
	Позиция = 0;
	Поз = Найти(ВременнаяСтрока, "?");
	Пока Поз>0 Цикл
		Позиция = Позиция + Поз;
		ВременнаяСтрока = Сред(ВременнаяСтрока, Поз+1);
		Поз = Найти(ВременнаяСтрока, "?");
	КонецЦикла;
	ПозицияК = Позиция + Найти(ВременнаяСтрока, ")");
	ВременнаяСтрока = Сред(Формула, Позиция+1, ПозицияК - Позиция - 1);
	ВременнаяСтрока = Сред(ВременнаяСтрока, Найти(ВременнаяСтрока, "(")+1);
	СоставФормулы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВременнаяСтрока, ",", Ложь);
	Пока СоставФормулы.Количество()<3 Цикл
		СоставФормулы.Добавить("");
	КонецЦикла;
	
	НовВыбор = Корень.Строки.Добавить();
	НовВыбор.Номер = Номер;
	НовВыбор.Вариант = "Вариант";
	НовВыбор.Условие = СоставФормулы[0];
	
	ДействиеИстина = НовВыбор.Строки.Добавить();
	ДействиеИстина.Номер = Номер;
	ДействиеИстина.Вариант = "Истина";
	ДействиеИстина.Действие = СоставФормулы[1];	
	
	ДействиеИстина = НовВыбор.Строки.Добавить();
	ДействиеИстина.Номер = Номер;
	ДействиеИстина.Вариант = "Ложь";
	ДействиеИстина.Действие = СоставФормулы[2];	
	
	Формула = Лев(Формула, Позиция-1) + "[Вариант"+Номер+"]" + Сред(Формула, ПозицияК + 1);
	
	СоздатьВетвьВарианта(Формула, Корень, Номер+1);	

КонецПроцедуры
 
Процедура СкопироватьВетвьДерева(Источник, Приемник, ЗначенияРеквизитов = Неопределено)   Экспорт

	Для каждого ТекСтр Из Источник.Строки Цикл
	
		НовСтр = Приемник.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр,,"Родитель, Строки");
		Если ТипЗнч(ЗначенияРеквизитов) = Тип("Структура") Тогда
			// в параметре значенияРеквизитов может быть структура для заполнения значений создаваемой ветви
			ЗаполнитьЗначенияСвойств(НовСтр, ЗначенияРеквизитов);
		КонецЕсли;
		СкопироватьВетвьДерева(ТекСтр, НовСтр, ЗначенияРеквизитов);
	
	КонецЦикла; 

КонецПроцедуры

Процедура ЗаполнитьИменаПолейДереваСтруктуры(ДеревоСтруктуры, ТаблицаДанных, СчетчикКолонок)   Экспорт
	Для каждого ТекСтрока Из ДеревоСтруктуры.Строки Цикл
		Если ТекСтрока.Строки.Количество() = 0  Тогда
			ТекСтрока.ИмяПоляТаблицы = "Поле"+СчетчикКолонок;
			ТаблицаДанных.Колонки.Добавить("Поле"+СчетчикКолонок,Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(1000)));
			СчетчикКолонок = СчетчикКолонок+1;
		КонецЕсли;
		Если ПустаяСтрока(ТекСтрока.ПолноеИмяПоля) Тогда
			Если ТекСтрока.Родитель<>Неопределено Тогда
				ТекСтрока.ПолноеИмяПоля = ТекСтрока.Родитель.ПолноеИмяПоля+"/"+ТекСтрока.ИмяПоля;
			Иначе
				ТекСтрока.ПолноеИмяПоля = "/"+ТекСтрока.ИмяПоля;
			КонецЕсли;
		КонецЕсли;
		ЗаполнитьИменаПолейДереваСтруктуры(ТекСтрока, ТаблицаДанных, СчетчикКолонок);
	КонецЦикла; 
КонецПроцедуры

Процедура ОбозначитьЛистьяДерева(Ветвь)  Экспорт  
	
	Лист = Истина;
	Для каждого ТекСтрока Из Ветвь.Строки Цикл
		Если ТекСтрока.Строки.Количество()>0 Тогда
			Лист = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Лист Тогда
		Для каждого ТекСтрока Из Ветвь.Строки Цикл
			ТекСтрока.КонечныйЭлемент = Ложь;
			ОбозначитьЛистьяДерева(ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьСтруктуруСхемыКомпоновкиИзДерева(ДеревоСтруктуры, Группировка, СхемаКомпоновкиРезультата, НаборДанных, РазрешенныеМодули, СоответствиеГруппировок) Экспорт
	
	Для каждого СтрокаДерева Из ДеревоСтруктуры.Строки Цикл
		
		Если ПустаяСтрока(СтрокаДерева.ИмяПоляТаблицы) Тогда	
			//ГруппировкаСхемы = Группировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			//ГруппировкаСхемы.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			ГруппировкаСхемы          = СоответствиеГруппировок[СтрокаДерева.Группировка];
			
			Если ГруппировкаСхемы     = Неопределено Тогда
				СоответствиеГруппировок.Вставить(СтрокаДерева.Группировка, Группировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных")));
				ГруппировкаСхемы      = СоответствиеГруппировок[СтрокаДерева.Группировка];
				ГруппировкаСхемы.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			КонецЕсли;
			
			СоздатьСтруктуруСхемыКомпоновкиИзДерева(СтрокаДерева, ГруппировкаСхемы, СхемаКомпоновкиРезультата, НаборДанных, РазрешенныеМодули, СоответствиеГруппировок);
			
		Иначе
			
			НовПоле                   = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			НовПоле.Поле 		      = СтрокаДерева.ИмяПоляТаблицы;
			НовПоле.ПутьКДанным	      = СтрокаДерева.ИмяПоляТаблицы;
			НовПоле.Роль.Обязательное = Истина;
			
			ГруппировкаСхемы          = СоответствиеГруппировок[СтрокаДерева.Группировка];
			
			Если ГруппировкаСхемы     = Неопределено Тогда
				
				СоответствиеГруппировок.Вставить(СтрокаДерева.Группировка, Группировка.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных")));
				ГруппировкаСхемы      = СоответствиеГруппировок[СтрокаДерева.Группировка];
				ГруппировкаСхемы.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
				
			КонецЕсли;
			
			ЗаменяемыеЗначения        = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВРЕГ("Значение"));
			ЗаменяющиеЗначения        = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаДерева.ИмяПоляТаблицы);
			
			РазложениеПолей           = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДерева.ПолеОбъекта, ";");			
			// для каждого поля объекта сделаем вычисляемое поле
			Для Каждого ТекПолеОбъекта Из РазложениеПолей Цикл
				
				Если ЗначениеЗаполнено(ТекПолеОбъекта) Тогда
					
					ПутьКДаннымВычисляемогоПоля      = ТекПолеОбъекта;
					
					Если Не ПустаяСтрока(СтрокаДерева.ТабличнаяЧасть) Тогда
						ПутьКДаннымВычисляемогоПоля  = СтрокаДерева.ТабличнаяЧасть + "." + ПутьКДаннымВычисляемогоПоля;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаДерева.Условие) Тогда
						ВыражениеВычисляемогоПоля 	 = 	""""+СтрЗаменить(СтрокаДерева.Условие,"""","""""")+"""";
					Иначе
						ВыражениеВычисляемогоПоля 	 = ОбщийМодульСКД.ПреобразоватьВыражениеСКД(СтрокаДерева.ПорядокЗаполнения, РазрешенныеМодули, ЗаменяемыеЗначения, ЗаменяющиеЗначения);
					КонецЕсли;
					
					ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновкиРезультата, ПутьКДаннымВычисляемогоПоля, ВыражениеВычисляемогоПоля);
					
					ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(ГруппировкаСхемы, ПутьКДаннымВычисляемогоПоля);
					
					Если Не ПустаяСтрока(СтрокаДерева.ДопДействия) Тогда
						// разберем доп.действия. в них могут быть заданы явно поля объекта
						
						Действия                                    = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДерева.ДопДействия, ";", Истина);
						Для каждого Действие Из Действия Цикл
						
							ЧастиДействия = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(Действие), "=", Истина);
							
							Если ЧастиДействия.Количество()         = 2 Тогда
								
								ЧастиЛевойСтороны                   = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЧастиДействия[0], ".", Истина);
								
								Если ЧастиЛевойСтороны.Количество() = 2 И ВРЕГ(ЧастиЛевойСтороны[0]) = "СТРОКА" Тогда
									
									ПутьКДаннымВычисляемогоПоля     = СокрЛП(ЧастиЛевойСтороны[1]);	
									
									Если Не ПустаяСтрока(СтрокаДерева.ТабличнаяЧасть) Тогда
										ПутьКДаннымВычисляемогоПоля = СтрокаДерева.ТабличнаяЧасть + "." + ПутьКДаннымВычисляемогоПоля;
									КонецЕсли;
									
									ВыражениеВычисляемогоПоля       = ЧастиДействия[1];	
									ВыражениеВычисляемогоПоля       = СтрЗаменить(ВыражениеВычисляемогоПоля, "Значение", СтрокаДерева.ИмяПоляТаблицы);
									
									ОбщийМодульСКД.ПроверитьПолучениеПредопределенныхЭлементов(ВыражениеВычисляемогоПоля);
								    ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновкиРезультата, СокрЛП(ПутьКДаннымВычисляемогоПоля), ВыражениеВычисляемогоПоля);
									ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(ГруппировкаСхемы, ПутьКДаннымВычисляемогоПоля);
									
								Иначе
									
									ПутьКДаннымВычисляемогоПоля     = СокрЛП(ЧастиДействия[0]);
									
									Если Не ПустаяСтрока(СтрокаДерева.ТабличнаяЧасть) Тогда
										ПутьКДаннымВычисляемогоПоля  = СтрокаДерева.ТабличнаяЧасть + "." + ПутьКДаннымВычисляемогоПоля;
									КонецЕсли;
								
									ВыражениеВычисляемогоПоля       = ЧастиДействия[1];
									ВыражениеВычисляемогоПоля       = СтрЗаменить(ВыражениеВычисляемогоПоля, "Значение", СтрокаДерева.ИмяПоляТаблицы);
									
									ВыражениеВычисляемогоПоля 	    = ОбщийМодульСКД.ПреобразоватьВыражениеСКД(ВыражениеВычисляемогоПоля, РазрешенныеМодули, ЗаменяемыеЗначения, ЗаменяющиеЗначения);

									
									ОбщийМодульСКД.ПроверитьПолучениеПредопределенныхЭлементов(ВыражениеВычисляемогоПоля);
								    ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновкиРезультата, СокрЛП(ПутьКДаннымВычисляемогоПоля), ВыражениеВычисляемогоПоля);
									ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(ГруппировкаСхемы, ПутьКДаннымВычисляемогоПоля);
									
								КонецЕсли;
								
								
							КонецЕсли;
							
						КонецЦикла; 
						
					КонецЕсли;
					
					//ДобавитьИмяРеквизитаВСтруктуру(ТекПолеОбъекта, ИменаРеквизитов);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбозначитьГруппировкиВДереве(Дерево)  Экспорт
	Для каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Если ЗначениеЗаполнено(СтрокаДерева.Группировка) Тогда
			УстановитьГруппировкуВетви(СтрокаДерева, СтрокаДерева.Группировка);
		КонецЕсли;
	    ОбозначитьГруппировкиВДереве(СтрокаДерева)
	КонецЦикла; 
КонецПроцедуры

Процедура УстановитьГруппировкуВетви(Ветвь, Группировка)
	Если Ветвь = Неопределено ИЛИ Ветвь.Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ТекСтрока Из Ветвь.Родитель.Строки Цикл
		Если ПустаяСтрока(ТекСтрока.Группировка) Тогда
			ТекСтрока.Группировка = Группировка;
		КонецЕсли;
		УстановитьГруппировкуВетви(ТекСтрока.Родитель, Группировка);
	КонецЦикла;
КонецПроцедуры

Процедура СократитьДерево(ДеревоСтруктуры, СокращенноеДеревоСтруктуры, СоответствиеГруппировок) Экспорт

	Для каждого СтрокаСтруктуры Из ДеревоСтруктуры.Строки Цикл
		
		Если ТипЗнч(СокращенноеДеревоСтруктуры) = Тип("СтрокаДереваЗначений") И СтрокаСтруктуры.Группировка = СокращенноеДеревоСтруктуры.Группировка Тогда
			
			СократитьДерево(СтрокаСтруктуры, СокращенноеДеревоСтруктуры, СоответствиеГруппировок);
			
		Иначе	
			
			ТекСтрока                 = СокращенноеДеревоСтруктуры.Строки.Найти(СтрокаСтруктуры.Группировка, "Группировка");
			
			Если ТекСтрока            = Неопределено Тогда
				
				ТекСтрока             = СокращенноеДеревоСтруктуры.Строки.Добавить();
				ТекСтрока.Группировка = СтрокаСтруктуры.Группировка;
				ОписаниеГруппировки   = СоответствиеГруппировок[СтрокаСтруктуры.Группировка];
				
				Если ОписаниеГруппировки <> Неопределено Тогда
					
					Для каждого ПолеГруппировки Из ОписаниеГруппировки.ПоляГруппировки.Элементы Цикл
						ТекСтрока.Поля.Добавить(Строка(ПолеГруппировки.Поле));
					КонецЦикла; 
					
				КонецЕсли;
				
			КонецЕсли;
			
			СократитьДерево(СтрокаСтруктуры, ТекСтрока, СоответствиеГруппировок);
			
		КонецЕсли;
		
	КонецЦикла; 

КонецПроцедуры

Процедура ЗагрузитьИзФайлаXML_AZK(ТекстФайла, Формат, Задание, ИмяФайла, ДанныеНовыхКонтрагентов)
	
	ПравилаЗагрузки = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(Формат);
	
	СоответствиеКолонок                                   = Новый Соответствие;
	ДеревоСтруктуры                                       = Новый ДеревоЗначений;
	
	ДеревоСтруктуры.Колонки.Добавить("ИмяПоля",				Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПолноеИмяПоля",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ИмяПоляТаблицы",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПорядокЗаполнения", 	Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПолеОбъекта",			Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ТабличнаяЧасть",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ДопДействия",			Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("Условие",				Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("КонечныйЭлемент", 	Новый ОписаниеТипов("Булево"));
	ДеревоСтруктуры.Колонки.Добавить("Группировка",			Новый ОписаниеТипов("Строка"));
	
	Для каждого ТекПравило Из ПравилаЗагрузки Цикл
		// если поле объекта не задано, то мы не учитываем узел
		Если ЗначениеЗаполнено(ТекПравило.ПолеОбъекта) Тогда
			
			КоллекцияСтрокДерева = ДеревоСтруктуры.Строки;
			ЧастиИмени           = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекПравило.ПолеФайлаПередачи, "/");
			МаксИндекс           = ЧастиИмени.ВГраница();
			
			Для Индекс           = 0 По МаксИндекс Цикл
				ЧастьИмени       = ЧастиИмени[Индекс];
				
				Если ПустаяСтрока(ЧастьИмени) Тогда
					Продолжить;
				КонецЕсли;
				
				ТекСтрокаДерева                     = КоллекцияСтрокДерева.Найти(ЧастьИмени, "ИмяПоля");
				
				Если ТекСтрокаДерева = Неопределено Тогда
					
					ТекСтрокаДерева                 = КоллекцияСтрокДерева.Добавить();
					ТекСтрокаДерева.ИмяПоля         = ЧастьИмени;
					
					Если ЗначениеЗаполнено(ТекПравило.ТабличнаяЧасть) Тогда
						ТекСтрокаДерева.Группировка = ТекПравило.ТабличнаяЧасть;
					ИначеЕсли ЗначениеЗаполнено(ТекПравило.ПолеОбъекта) И Найти(ТекПравило.ПолеОбъекта, ".") = 0 Тогда
						ТекСтрокаДерева.Группировка = "Объект";
					КонецЕсли;
					
					Если Индекс = МаксИндекс Тогда
						
						ТекСтрокаДерева.ПолноеИмяПоля 		= ВРег(ТекПравило.ПолеФайлаПередачи);
						ТекСтрокаДерева.ПолеОбъекта 		= ТекПравило.ПолеОбъекта;
						ТекСтрокаДерева.ПорядокЗаполнения	= ТекПравило.ПорядокЗаполнения;
						ТекСтрокаДерева.ТабличнаяЧасть 		= ТекПравило.ТабличнаяЧасть;
						ТекСтрокаДерева.ДопДействия 		= ТекПравило.ДопДействия;
						ТекСтрокаДерева.Условие		 		= ТекПравило.Условие;
						ТекСтрокаДерева.КонечныйЭлемент		= Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
				КоллекцияСтрокДерева = ТекСтрокаДерева.Строки;
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбозначитьЛистьяДерева(ДеревоСтруктуры);
	ОбозначитьГруппировкиВДереве(ДеревоСтруктуры);
		
	// для каждого поля зададим имя поля таблицы и сразу создадим структуру таблицы
	ТаблицаДанных                = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("КонечныйЭлемент");
	СчетчикКолонок               = 1;
	ЗаполнитьИменаПолейДереваСтруктуры(ДеревоСтруктуры, ТаблицаДанных, СчетчикКолонок);
	
	ЧтениеXML 			         = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстФайла);

	ПутьПравилаОбработки         = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		// Обработка узла XML           	
		Если ЧтениеXML.ТипУзла   = ТипУзлаXML.НачалоЭлемента Тогда
			ИмяПоля              = ЧтениеXML.Имя;		
			ПутьПравилаОбработки = ПутьПравилаОбработки + "/" + ВРег(ИмяПоля);
			
			ТекСтрока            = ДеревоСтруктуры.Строки.Найти(ПутьПравилаОбработки, "ПолноеИмяПоля",Истина);
			Если ТекСтрока<>Неопределено Тогда
				СтрокаДанных     = ТаблицаДанных.Добавить();
				
				Для каждого ПоляСтроки Из ТекСтрока.Строки Цикл
					СтрокаДанных.КонечныйЭлемент        = ПоляСтроки.КонечныйЭлемент;
					Если ПоляСтроки.Строки.Количество() = 0 Тогда					
						Если Лев(ПоляСтроки.ИмяПоля, 1) = "@" Тогда
							// добавитьСтроку
							ЗначениеПоля = ""; 
							
							Если ЧтениеXML.ПолучитьАтрибут(Сред(ПоляСтроки.ИмяПоля, 2))<> Неопределено Тогда
								ЗначениеПоля = ЧтениеXML.ПолучитьАтрибут(Сред(ПоляСтроки.ИмяПоля, 2))
							ИначеЕсли ЧтениеXML.ПолучитьАтрибут(Сред(НРег(ПоляСтроки.ИмяПоля), 2))<> Неопределено Тогда
	                            ЗначениеПоля = ЧтениеXML.ПолучитьАтрибут(Сред(НРег(ПоляСтроки.ИмяПоля), 2))
							КонецЕсли;	
							
							СтрокаДанных[ПоляСтроки.ИмяПоляТаблицы] = ЗначениеПоля;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла; 
			КонецЕсли;
		ИначеЕсли ЧтениеXML.ТипУзла  = ТипУзлаXML.КонецЭлемента Тогда 			
			ПутьПравилаОбработки     = Лев(ПутьПравилаОбработки, СтрДлина(ПутьПравилаОбработки) - (СтрДлина(ЧтениеXML.Имя)+1));
		КонецЕсли;
		
	КонецЦикла;
	
	МассивИменСтрок                  = Новый Массив;
	МассивИменСтрок.Добавить("/EXTRWT/WTFORMAT/DOCAZKREQUESTS/DOCAZKREQUEST/@DOCUMENTNUMBER");
	
	МассивИменПолейТД                = Новый Массив;
	
	Для Каждого ЭлМас Из МассивИменСтрок Цикл
		ТекСтрока                    = ДеревоСтруктуры.Строки.Найти(ЭлМас, "ПолноеИмяПоля",Истина);
		Если ТекСтрока <> Неопределено Тогда
			МассивИменПолейТД.Добавить(ТекСтрока.ИмяПоляТаблицы);	
		КонецЕсли;
	КонецЦикла;
	
	// заполним колонки конечных элементов значениями из вышестоящих неконечных элементов
	СвернутьТаблицуЗначений(ТаблицаДанных, МассивИменПолейТД);
	
	// создание схемы компоновки данных
	СхемаКомпоновкиРезультата         = Новый СхемаКомпоновкиДанных;
	ИсточникДанных                    = СхемаКомпоновкиРезультата.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя                = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных                       = СхемаКомпоновкиРезультата.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя 			      = "НаборДанных1";
	НаборДанных.ИмяОбъекта 		      = "ВходящиеДанные";
	НаборДанных.ИсточникДанных 	      = "ИсточникДанных1";
	
	РазрешенныеМодули                 = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("БИБЛИОТЕКАФУНКЦИЙОБМЕНА");
	СоответствиеГруппировок           = Новый Соответствие;
	СоздатьСтруктуруСхемыКомпоновкиИзДерева(ДеревоСтруктуры, СхемаКомпоновкиРезультата.НастройкиПоУмолчанию, СхемаКомпоновкиРезультата, НаборДанных, РазрешенныеМодули, СоответствиеГруппировок);	
	
	ВнешниеНаборы                     = Новый Структура("ВходящиеДанные", ТаблицаДанных);
	ФорматЗагрузки                    = Формат;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "КассовыйОрган";
	Параметр.Значение                 = Задание.КассовыйОрган;
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "Организация";
	Параметр.Значение                 = Задание.Организация;
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "ВалютаРеглУчета";
	Параметр.Значение                 = Константы.ВалютаРегламентированногоУчета.Получить();
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	НастройкиКомпоновки               = СхемаКомпоновкиРезультата.НастройкиПоУмолчанию;
	
	КомпоновщикМакета                 = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки                   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиРезультата, НастройкиКомпоновки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	ПроцессорКомпоновки               = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы,,Истина);
	ПроцессорВывода                   = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ДеревоЗначений);
	
	РезультатВыполнения               = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	СокращенноеДеревоСтруктуры        = Новый ДеревоЗначений;
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Группировка", Новый ОписаниеТипов("Строка"));
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Поля", Новый ОписаниеТипов("Массив"));
	
	СократитьДерево(ДеревоСтруктуры, СокращенноеДеревоСтруктуры, СоответствиеГруппировок); 
	
	Для каждого СтрокаДокумента Из РезультатВыполнения.Строки Цикл
		
		СтрокаГруппировки             = СокращенноеДеревоСтруктуры.Строки[0];
		
		// выделяем объект для импорта
		Попытка
			СохраненныйДокумент       = Документы[Формат.ИдентификаторОбъекта.Имя].НайтиПоНомеру(СтрокаДокумента.Номер, СтрокаДокумента.Дата);
		Исключение
			СохраненныйДокумент       = Документы[Формат.ИдентификаторОбъекта.Имя].ПустаяСсылка();
		КонецПопытки;

		Если СохраненныйДокумент.Пустая() Тогда
			ДокументОбъект            = Документы[Формат.ИдентификаторОбъекта.Имя].СоздатьДокумент();
		Иначе
			ДокументОбъект            = СохраненныйДокумент.ПолучитьОбъект();
			Если БиблиотекаФункцийОбмена.ПолучитьСтатусДокумента(ДокументОбъект.Ссылка) <> Перечисления.СтатусыИсполненияДокумента.ВРаботе Тогда
				ВызватьИсключение НСтр("ru='Документ с таким же номером был обработан ранее (его статус отличен от статуса <<в работе>>) '") + СохраненныйДокумент;
			КонецЕсли;	
			Попытка
				ЗаблокироватьДанныеДляРедактирования(ДокументОбъект.Ссылка);
			Исключение
				ВызватьИсключение НСтр("ru='Невозможно заблокировать для редактирования документ '") + СохраненныйДокумент;
			КонецПопытки;
			ДокументОбъект.РеквизитыДокументаОснования.Очистить();
			ДокументОбъект.РасшифровкаПлатежа.Очистить();
		КонецЕсли;
		
		// запись реквизитов шапки документа
		СтрокаРеквизитов              = "";
		СтрокаРеквизитовПП            = "";
		
		ПроизвольныеПараметры         = Новый Структура;
		
		ПроизвольныеПараметры.Вставить("МесяцОплаты",    "");
        ПроизвольныеПараметры.Вставить("ГодОплаты",      "");	
		
		Для каждого ТекПоле Из СтрокаГруппировки.Поля Цикл
			Если Найти(ВРЕГ(ТекПоле), "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ") = 0 Тогда
				СтрокаРеквизитов    = СтрокаРеквизитов   + "," + ТекПоле;
			Иначе
				СтрокаРеквизитовПП  = СтрокаРеквизитовПП + "," + ТекПоле;
			КонецЕсли;
		КонецЦикла;
		
		СтрокаРеквизитов            = Сред(СтрокаРеквизитов, 2);
		СтрокаРеквизитовПП          = Сред(СтрокаРеквизитовПП, 2);
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДокумента, СтрокаРеквизитов);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, Задание, "Организация");
		
		СтруктураПроверки           = Новый Структура(СтрЗаменить(СтрокаРеквизитовПП, ".", ""));
						
		ЗаполнитьЗначенияСвойств(СтруктураПроверки, СтрокаДокумента);
		
		Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
			Если ВРЕГ(Лев(ЗначениеПроверки.Ключ, 21)) = "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ" Тогда
				ПроизвольныеПараметры.Вставить(Сред(ЗначениеПроверки.Ключ, 22), ЗначениеПроверки.Значение);
			КонецЕсли;
		КонецЦикла; 

		
		// обработка реквизитов табличных частей
		Для каждого ВложеннаяГруппировка Из СтрокаГруппировки.Строки Цикл
			
			СтрокаРеквизитов          = "";
			СтрокаРеквизитовПП        = "";
			
			Для каждого ТекПоле Из ВложеннаяГруппировка.Поля Цикл
				
				Если Найти(ВРЕГ(ТекПоле), "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ") = 0 Тогда
				
					Если Лев(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 1) = ВложеннаяГруппировка.Группировка + "." Тогда
						СтрокаРеквизитов  = СтрокаРеквизитов + "," + Сред(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 2);	
					Иначе
						СтрокаРеквизитов  = СтрокаРеквизитов + "," + ТекПоле;
					КонецЕсли;
					
				Иначе
					
					СтрокаРеквизитовПП  = СтрокаРеквизитовПП + "," + ТекПоле;
					
				КонецЕсли;
				
			КонецЦикла;
			
			СтрокаРеквизитов          = Сред(СтрокаРеквизитов, 2);
			СтрокаРеквизитовПП        = Сред(СтрокаРеквизитовПП, 2);
			КБКНазначения             = "";  
			
			ПараметрыВызоваФункции    = Новый Структура;
						
			ПараметрыВызоваФункции.Вставить("ИННПлательщика", "");
			ПараметрыВызоваФункции.Вставить("КПППлательщика", "");	
				
			// в СтрокаРеквизитов только имена табличной части
			
			Для каждого ВложеннаяСтрока Из СтрокаДокумента.Строки Цикл
				
								
				Если ВложеннаяГруппировка.Группировка  =  "РасшифровкаПлатежа" Тогда
					
					ФункцияЗаполнения                                 = ВложеннаяСтрока["РасшифровкаПлатежаКБКНазначениеПлатежа"];
					
					Если ФункцияЗаполнения                            = "НайтиКБКПоНаименованию" Тогда
						
						ПараметрыВызоваФункции.Вставить("ППП",            "");
						ПараметрыВызоваФункции.Вставить("КФСР",           "");
						ПараметрыВызоваФункции.Вставить("КЦСР",           "");
						ПараметрыВызоваФункции.Вставить("КВР",            "");
						ПараметрыВызоваФункции.Вставить("КИФ",            "");
						ПараметрыВызоваФункции.Вставить("КД",             "");
						ПараметрыВызоваФункции.Вставить("АУБУ",           Ложь);
						ПараметрыВызоваФункции.Вставить("ИННПлательщика", "");
						ПараметрыВызоваФункции.Вставить("КПППлательщика", "");
						
						СтруктураПроверки                             = Новый Структура(СтрЗаменить(СтрокаРеквизитовПП, ".", ""));
						
						ЗаполнитьЗначенияСвойств(СтруктураПроверки, ВложеннаяСтрока);
						
						Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
							Если ВРЕГ(Лев(ЗначениеПроверки.Ключ, 39)) = "РАСШИФРОВКАПЛАТЕЖАПРОИЗВОЛЬНЫЕПАРАМЕТРЫ" Тогда
								ПараметрыВызоваФункции.Вставить(Сред(ЗначениеПроверки.Ключ, 40), ЗначениеПроверки.Значение);
							КонецЕсли;
						КонецЦикла; 
						
						Если ЗначениеЗаполнено(ПараметрыВызоваФункции.КИФ) Тогда
							
							КБКНазначения                                 = БиблиотекаФункцийОбмена.НайтиКБКПоНаименованию(Строка(ПараметрыВызоваФункции.КИФ), Перечисления.ВидыКБК.КИФ, Ложь, , , ДокументОбъект.Дата); 					
							
						Иначе
							
							Если ПараметрыВызоваФункции.АУБУ Тогда  //для заявок АУ/БУ
								
								Если ЗначениеЗаполнено(ПараметрыВызоваФункции.КД) И ПараметрыВызоваФункции.КД <> "000"  Тогда
									КодБК                                     = Строка(ПараметрыВызоваФункции.ППП)  + Строка(ПараметрыВызоваФункции.КФСР)  + 
								                                                Строка(ПараметрыВызоваФункции.КЦСР) + Строка(ПараметрыВызоваФункции.КД); 
									ВидБК									  = Перечисления.ВидыКБК.КДБ;		
								Иначе
									КодБК                                     = Строка(ПараметрыВызоваФункции.ППП)  + Строка(ПараметрыВызоваФункции.КФСР)  + 
								                                                Строка(ПараметрыВызоваФункции.КЦСР) + Строка(ПараметрыВызоваФункции.КВР);
									ВидБК									  = Перечисления.ВидыКБК.КРБ;											
								КонецЕсли;
								
								КБКНазначения                                 = БиблиотекаФункцийОбмена.НайтиКБКПоНаименованию(Прав(КодБК, 17), ВидБК, Ложь, Истина, , ДокументОбъект.Дата);
							
							Иначе
								КодБК                                         = Строка(ПараметрыВызоваФункции.ППП)  + Строка(ПараметрыВызоваФункции.КФСР)  + 
								                                                Строка(ПараметрыВызоваФункции.КЦСР) + Строка(ПараметрыВызоваФункции.КВР); 
																				
								КБКНазначения                                 = БиблиотекаФункцийОбмена.НайтиКБКПоНаименованию(Прав(КодБК, 17), Перечисления.ВидыКБК.КРБ, Ложь, , , ДокументОбъект.Дата);
							КонецЕсли;
							
						КонецЕсли;
											
					КонецЕсли;	
				КонецЕсли;

				ЕстьЗаполненные       = Ложь;
				СтруктураПроверки     = Новый Структура(СтрокаРеквизитов);
				
				Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
					СтруктураПроверки[ЗначениеПроверки.Ключ]          = ВложеннаяСтрока[ВложеннаяГруппировка.Группировка+ЗначениеПроверки.Ключ];	
					ЕстьЗаполненные                                   = Макс(ЕстьЗаполненные, ЗначениеЗаполнено(СтруктураПроверки[ЗначениеПроверки.Ключ]));
				КонецЦикла;
				
				Если ЕстьЗаполненные Тогда
					ЗаполнитьЗначенияСвойств(ДокументОбъект[ВложеннаяГруппировка.Группировка].Добавить(), СтруктураПроверки);
					
					Если ВложеннаяГруппировка.Группировка  =  "РасшифровкаПлатежа" Тогда
						 ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].КБКНазначениеПлатежа = КБКНазначения;
						 ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].Сумма                = ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].СуммаВал; 
						 
						 Если ЗначениеЗаполнено(ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].КФО) Тогда
						 
						 	СписокИсточников = ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(ДокументОбъект.ЛицевойСчет, ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].КФО);
	
							Если СписокИсточников.Количество() > 0 Тогда
								 ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].ИсточникСредств = СписокИсточников[0];
							КонецЕсли; 
							 
						 КонецЕсли;	
									 
						 Если ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].Сумма = 0 Тогда
							  ДокументОбъект.РасшифровкаПлатежа.Удалить(ДокументОбъект.РасшифровкаПлатежа.Количество() - 1)
						 КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла; 
				
		КонецЦикла; 
		
		ДокументОбъект.СуммаДокументаВВалюте = ДокументОбъект.РасшифровкаПлатежа.Итог("СуммаВал");
		ДокументОбъект.СуммаДокумента        = ДокументОбъект.РасшифровкаПлатежа.Итог("Сумма");
		
		ДокументОбъект.Контрагент            = БиблиотекаФункцийОбмена.ОпределитьКонтрагента(ДокументОбъект.КонтрагентИНН, ДокументОбъект.КонтрагентКПП, ДокументОбъект.КонтрагентНаименование, , , ВидОбмена, ДанныеНовыхКонтрагентов);
		
		Если ЗначениеЗаполнено(ДокументОбъект.ИнойПлательщикИНН) ИЛИ ЗначениеЗаполнено(ДокументОбъект.ИнойПлательщикКПП) ИЛИ ЗначениеЗаполнено(ДокументОбъект.ИнойПлательщиеНаименование) Тогда  
			 ДокументОбъект.ИнойПлательщик   = БиблиотекаФункцийОбмена.ОпределитьКонтрагента(ДокументОбъект.ИнойПлательщикИНН, ДокументОбъект.ИнойПлательщикКПП, ДокументОбъект.ИнойПлательщиеНаименование, , , ВидОбмена, ДанныеНовыхКонтрагентов);
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Контрагент) И ТипЗнч(ДанныеНовыхКонтрагентов) = Тип("ТаблицаЗначений") Тогда
			Если ДанныеНовыхКонтрагентов.Количество() > 0 И НЕ ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
				 ДанныеНовыхКонтрагентов[ДанныеНовыхКонтрагентов.Количество()-1].ДокументСсылка     = ДокументОбъект.Ссылка;
				 ДанныеНовыхКонтрагентов[ДанныеНовыхКонтрагентов.Количество()-1].ИмяРеквизита       = "Контрагент";	 
			КонецЕсли;
		КонецЕсли;
		
		ДокументОбъект.ИННПлательщика        = ?(ЗначениеЗаполнено(ПараметрыВызоваФункции.ИННПлательщика), ПараметрыВызоваФункции.ИННПлательщика, ДокументОбъект.ИННПлательщика);
		ДокументОбъект.КПППлательщика        = ?(ЗначениеЗаполнено(ПараметрыВызоваФункции.КПППлательщика), ПараметрыВызоваФункции.КПППлательщика, ДокументОбъект.КПППлательщика);
		
		ДокументОбъект.ПериодОплатыЖКХ       = БиблиотекаФункцийОбмена.ПреобразованиеСтрокиВДату( "01." + Формат(ПроизвольныеПараметры.МесяцОплаты,  "ЧЦ=2; ЧВН=") + "." + Формат(ПроизвольныеПараметры.ГодОплаты,  "ЧЦ=4; ЧВН="));
		
		Если ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
			
			ДокументОбъект.СчетКонтрагента  = БиблиотекаФункцийОбмена.ОпределитьСчетКонтрагента(ДокументОбъект.Контрагент, ДокументОбъект.КонтрагентЛицевойСчет, 
			                                  ДокументОбъект.КонтрагентБИКБанка, ДокументОбъект.КонтрагентНаименованиеБанка, ДокументОбъект.КонтрагентКорСчетБанка);
											  
            МенеджерПечати                  = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ." + Формат.ИдентификаторОбъекта.Имя);											  
											  
			МенеджерПечати.ЗаполнитьРеквизитыПолучателя(ДокументОбъект);
								  
		КонецЕсли;		
		
		Если ДокументОбъект.Ссылка.Пустая() ИЛИ ДокументОбъект.Модифицированность() Тогда					
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);	
		КонецЕсли;			
		
		Если Задание.ОбъектыОбмена.Найти(ДокументОбъект.Ссылка) = Неопределено Тогда    
			
			НовСтрокаЗадания                    = Задание.ОбъектыОбмена.Добавить();
			НовСтрокаЗадания.ИмяФайлаЗагрузки	= ИмяФайла;
			НовСтрокаЗадания.Формат				= Формат;
			НовСтрокаЗадания.Объект				= ДокументОбъект.Ссылка;  
			
		КонецЕсли;
		//-------------------------------------
		
    КонецЦикла;

КонецПроцедуры 

Процедура ЗагрузитьИзФайлаXML_RMS(ТекстФайла, Формат, Задание, ИмяФайла, ДанныеНовыхКонтрагентов)
	
	ПравилаЗагрузки = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(Формат);
	
	СоответствиеКолонок                                   = Новый Соответствие;
	ДеревоСтруктуры                                       = Новый ДеревоЗначений;
	
	ДеревоСтруктуры.Колонки.Добавить("ИмяПоля",				Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПолноеИмяПоля",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ИмяПоляТаблицы",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПорядокЗаполнения", 	Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПолеОбъекта",			Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ТабличнаяЧасть",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ДопДействия",			Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("Условие",				Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("КонечныйЭлемент", 	Новый ОписаниеТипов("Булево"));
	ДеревоСтруктуры.Колонки.Добавить("Группировка",			Новый ОписаниеТипов("Строка"));     
	
	НомерСтрокиОсновногоФайла                            = Задание.ФайлыОбмена.НайтиСтроки(Новый Структура("ИмяФайлаЗагрузки", ИмяФайла))[0].НомерСтроки;
	
	Для каждого ТекПравило Из ПравилаЗагрузки Цикл
		// если поле объекта не задано, то мы не учитываем узел
		Если ЗначениеЗаполнено(ТекПравило.ПолеОбъекта) Тогда
			
			КоллекцияСтрокДерева = ДеревоСтруктуры.Строки;
			ЧастиИмени           = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекПравило.ПолеФайлаПередачи, "/");
			МаксИндекс           = ЧастиИмени.ВГраница();
			
			Для Индекс           = 0 По МаксИндекс Цикл
				ЧастьИмени       = ЧастиИмени[Индекс];
				
				Если ПустаяСтрока(ЧастьИмени) Тогда
					Продолжить;
				КонецЕсли;
				
				ТекСтрокаДерева                     = КоллекцияСтрокДерева.Найти(ЧастьИмени, "ИмяПоля");
				
				Если ТекСтрокаДерева = Неопределено Тогда
					
					ТекСтрокаДерева                 = КоллекцияСтрокДерева.Добавить();
					ТекСтрокаДерева.ИмяПоля         = ЧастьИмени;
					
					Если ЗначениеЗаполнено(ТекПравило.ТабличнаяЧасть) Тогда
						ТекСтрокаДерева.Группировка = ТекПравило.ТабличнаяЧасть;
					ИначеЕсли ЗначениеЗаполнено(ТекПравило.ПолеОбъекта) И Найти(ТекПравило.ПолеОбъекта, ".") = 0 Тогда
						ТекСтрокаДерева.Группировка = "Объект";
					КонецЕсли;
					
					Если Индекс = МаксИндекс Тогда
						
						ТекСтрокаДерева.ПолноеИмяПоля 		= ВРег(ТекПравило.ПолеФайлаПередачи);
						ТекСтрокаДерева.ПолеОбъекта 		= ТекПравило.ПолеОбъекта;
						ТекСтрокаДерева.ПорядокЗаполнения	= ТекПравило.ПорядокЗаполнения;
						ТекСтрокаДерева.ТабличнаяЧасть 		= ТекПравило.ТабличнаяЧасть;
						ТекСтрокаДерева.ДопДействия 		= ТекПравило.ДопДействия;
						ТекСтрокаДерева.Условие		 		= ТекПравило.Условие;
						ТекСтрокаДерева.КонечныйЭлемент		= Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
				КоллекцияСтрокДерева = ТекСтрокаДерева.Строки;
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбозначитьЛистьяДерева(ДеревоСтруктуры);
	ОбозначитьГруппировкиВДереве(ДеревоСтруктуры);
		
	// для каждого поля зададим имя поля таблицы и сразу создадим структуру таблицы
	ТаблицаДанных                = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("КонечныйЭлемент");
	СчетчикКолонок               = 1;
	ЗаполнитьИменаПолейДереваСтруктуры(ДеревоСтруктуры, ТаблицаДанных, СчетчикКолонок);
			
	ЧтениеXML 			         = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстФайла);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM    = ПостроительDOM.Прочитать(ЧтениеXML);

	ПутьПравилаОбработки         = "";
	ЧтениеXML.УстановитьСтроку(ТекстФайла);
	
	
	СписокКонечныхЭлементов       = Новый СписокЗначений;
	СписокКонечныхЭлементов.Добавить("bscDcmnts");
	
	СоответствиеИндексов          = Новый Соответствие;
	
	Пока ЧтениеXML.Прочитать() Цикл
		// Обработка узла XML           	
		Если ЧтениеXML.ТипУзла   = ТипУзлаXML.НачалоЭлемента Тогда
			
			ИмяПоля              = ЧтениеXML.ЛокальноеИмя;	
			ИмяПоляDOM           = ЧтениеXML.ЛокальноеИмя;
			ПутьПравилаОбработки = ПутьПравилаОбработки + "/" + ИмяПоля;
			
			ТекСтрока            = ДеревоСтруктуры.Строки.Найти(ПутьПравилаОбработки, "ПолноеИмяПоля",Истина);
			Если ТекСтрока <> Неопределено Тогда
				
				//Индекс = ПолучитьИндекс(ИмяПоля, СоответствиеИндексов);
				
				Если (ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[0].ДочерниеУзлы.Количество()> 0) 
				//	 И (СписокКонечныхЭлементов.НайтиПоЗначению(ИмяПоля) <> Неопределено) 
					 И (ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[0].ДочерниеУзлы[0].ИмяУзла) <> "#text" Тогда
					СтрокаДанных     = ТаблицаДанных.Добавить();
				КонецЕсли;
				
				РодительскийУзел     = "";
				
				Для каждого ПоляСтроки Из ТекСтрока.Строки Цикл
					
					СтрокаДанных.КонечныйЭлемент = Ложь; //(ПоляСтроки.КонечныйЭлемент); 
					
					Если ПоляСтроки.ИмяПоля = "baseDocId" ИЛИ ПоляСтроки.ИмяПоля = "paymentPurpose" Тогда
						СтрокаДанных.КонечныйЭлемент = Истина;	
					КонецЕсли;	
					
					Если ПоляСтроки.Строки.Количество() = 0 Тогда					
						Если Лев(ПоляСтроки.ИмяПоля, 1) = "@" Тогда
							// добавитьСтроку
							СтрокаДанных[ПоляСтроки.ИмяПоляТаблицы] = ЧтениеXML.ПолучитьАтрибут(Сред(ПоляСтроки.ИмяПоля, 2));
						Иначе
							Индекс                                  = ПолучитьИндекс(ПоляСтроки.ИмяПоля, СоответствиеИндексов);
														
							Если ДокументDOM.ПолучитьЭлементыПоИмени(ПоляСтроки.ИмяПоля).Количество() > Индекс Тогда
								
								Если РодительскийУзел = "" Тогда
								
								   РодительскийУзел = ДокументDOM.ПолучитьЭлементыПоИмени(ПоляСтроки.ИмяПоля)[Индекс].РодительскийУзел;
								  
							    ИначеЕсли ДокументDOM.ПолучитьЭлементыПоИмени(ПоляСтроки.ИмяПоля)[Индекс].РодительскийУзел <> РодительскийУзел Тогда
									 //Узлы не одного уровня
									 ДекрементироватьИндекс(ПоляСтроки.ИмяПоля, СоответствиеИндексов);
									 //так как ранее инкрементировался вызовом
									 Продолжить;
								КонецЕсли;	
								
								СтрокаДанных[ПоляСтроки.ИмяПоляТаблицы] = ДокументDOM.ПолучитьЭлементыПоИмени(ПоляСтроки.ИмяПоля)[Индекс].ТекстовоеСодержимое;
							Иначе
								СтрокаДанных[ПоляСтроки.ИмяПоляТаблицы] = "";
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла; 
			КонецЕсли;
			
		ИначеЕсли ЧтениеXML.ТипУзла  = ТипУзлаXML.КонецЭлемента Тогда 			
			ПутьПравилаОбработки     = Лев(ПутьПравилаОбработки, СтрДлина(ПутьПравилаОбработки) - (СтрДлина(ЧтениеXML.Имя)+1));
		КонецЕсли;
		
	КонецЦикла;	  
	
	СтруктураКлючей                  = Новый Структура;
			
	МассивИменСтрок                  = Новый Массив;
	МассивИменСтрок.Добавить("/GENERALDATAVOS/COUNT/RSKPVOS/RSKPN/RSKPN/RSKPDATE");
	
	МассивИменПолейТД                = Новый Массив;
	
	Для Каждого ЭлМас Из МассивИменСтрок Цикл
		ТекСтрока                    = ДеревоСтруктуры.Строки.Найти(ЭлМас, "ПолноеИмяПоля",Истина);
		Если ТекСтрока <> Неопределено Тогда
			МассивИменПолейТД.Добавить(ТекСтрока.ИмяПоляТаблицы);	
		КонецЕсли;
	КонецЦикла;  
	
	ТаблицаДанных.Сортировать("КонечныйЭлемент");
	
	// заполним колонки конечных элементов значениями из вышестоящих неконечных элементов
	СвернутьТаблицуЗначений(ТаблицаДанных, МассивИменПолейТД);
	
	// создание схемы компоновки данных
	СхемаКомпоновкиРезультата         = Новый СхемаКомпоновкиДанных;
	ИсточникДанных                    = СхемаКомпоновкиРезультата.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя                = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных                       = СхемаКомпоновкиРезультата.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя 			      = "НаборДанных1";
	НаборДанных.ИмяОбъекта 		      = "ВходящиеДанные";
	НаборДанных.ИсточникДанных 	      = "ИсточникДанных1";
	
	РазрешенныеМодули                 = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("БИБЛИОТЕКАФУНКЦИЙОБМЕНА");
	СоответствиеГруппировок           = Новый Соответствие;
	СоздатьСтруктуруСхемыКомпоновкиИзДерева(ДеревоСтруктуры, СхемаКомпоновкиРезультата.НастройкиПоУмолчанию, СхемаКомпоновкиРезультата, НаборДанных, РазрешенныеМодули, СоответствиеГруппировок);	
	
	ВнешниеНаборы                     = Новый Структура("ВходящиеДанные", ТаблицаДанных);
	ФорматЗагрузки                    = Формат;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "КассовыйОрган";
	Параметр.Значение                 = Задание.КассовыйОрган;
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "Организация";
	Параметр.Значение                 = Задание.Организация;
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;   
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "ДатаФормирования";
	Параметр.Значение                 = Задание.Дата;
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "ВалютаРеглУчета";
	Параметр.Значение                 = Константы.ВалютаРегламентированногоУчета.Получить();
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	НастройкиКомпоновки               = СхемаКомпоновкиРезультата.НастройкиПоУмолчанию;
	
	КомпоновщикМакета                 = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки                   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиРезультата, НастройкиКомпоновки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	ПроцессорКомпоновки               = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы,,Истина);
	ПроцессорВывода                   = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ДеревоЗначений);
	
	РезультатВыполнения               = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	СокращенноеДеревоСтруктуры        = Новый ДеревоЗначений;
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Группировка", Новый ОписаниеТипов("Строка"));
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Поля", Новый ОписаниеТипов("Массив"));
	
	СократитьДерево(ДеревоСтруктуры, СокращенноеДеревоСтруктуры, СоответствиеГруппировок); 
	
	Для каждого СтрокаДокумента Из РезультатВыполнения.Строки Цикл
		
		СтрокаГруппировки             = СокращенноеДеревоСтруктуры.Строки[0];
	
	    СтрокаДокумента               = РезультатВыполнения.Строки[0];
		// выделяем объект для импорта
		Попытка
			СохраненныйДокумент       = Документы[Формат.ИдентификаторОбъекта.Имя].НайтиПоРеквизиту("GUID", СтрокаДокумента.GUID);
		Исключение
			СохраненныйДокумент       = Документы[Формат.ИдентификаторОбъекта.Имя].ПустаяСсылка();
		КонецПопытки;

		Если СохраненныйДокумент.Пустая() Тогда
			ДокументОбъект            = Документы[Формат.ИдентификаторОбъекта.Имя].СоздатьДокумент();
		Иначе
			
			Если Задание.ВидОбмена.ОтменаПовторнойЗагрузкиПроведенныхДокументов И СохраненныйДокумент.Проведен Тогда 
				
				Если Задание.ОбъектыОбмена.Найти(СохраненныйДокумент) = Неопределено Тогда    
			
					НовСтрокаЗадания                    = Задание.ОбъектыОбмена.Добавить();
					НовСтрокаЗадания.ИмяФайлаЗагрузки	= ИмяФайла;
					НовСтрокаЗадания.Формат				= Формат;
					НовСтрокаЗадания.Объект				= СохраненныйДокумент;  
					
				КонецЕсли; 
				
				Сообщение    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(НСтр("ru='В файле [ИмяФайла] есть ссылка на документ [Документ], загруженный ранее и проведенный. Он останется без изменений.'"),
																									Новый Структура("Документ, ИмяФайла", 
																													СохраненныйДокумент, 
																													ИмяФайла));
				ОбщегоНазначения.СообщитьПользователю(Сообщение,,"ФайлыОбмена["+НомерСтрокиОсновногоФайла+"].ИмяФайлаЗагрузки");


				Продолжить;
			КонецЕсли;
			
			ДокументОбъект            = СохраненныйДокумент.ПолучитьОбъект(); 
						
			Если БиблиотекаФункцийОбмена.ПолучитьСтатусДокумента(ДокументОбъект.Ссылка) <> Перечисления.СтатусыИсполненияДокумента.ВРаботе Тогда
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(НСтр("ru='Документ [Документ] с таким же GUID [GUID] был обработан ранее (его статус отличен от статуса <<в работе>>)'"), 
				                                                                                    Новый Структура("Документ, GUID", 
																													СохраненныйДокумент, 
																													СтрокаДокумента.GUID));   
			КонецЕсли;	
			Попытка
				ЗаблокироватьДанныеДляРедактирования(ДокументОбъект.Ссылка);
			Исключение
				ВызватьИсключение НСтр("ru='Невозможно заблокировать для редактирования документ '") + СохраненныйДокумент;
			КонецПопытки;     
			
			Если Метаданные.Документы[Формат.ИдентификаторОбъекта.Имя].ТабличныеЧасти.Найти("ДокументыОснования") <> Неопределено Тогда
				ДокументОбъект.ДокументыОснования.Очистить();
			КонецЕсли;	
			
			Если Метаданные.Документы[Формат.ИдентификаторОбъекта.Имя].ТабличныеЧасти.Найти("РеквизитыПлатежногоДокумента") <> Неопределено Тогда
				ДокументОбъект.РеквизитыПлатежногоДокумента.Очистить();
			КонецЕсли;	

			Если Метаданные.Документы[Формат.ИдентификаторОбъекта.Имя].ТабличныеЧасти.Найти("ИзмененныеРеквизиты") <> Неопределено Тогда
				ДокументОбъект.ИзмененныеРеквизиты.Очистить();
			КонецЕсли;	
			
		КонецЕсли;
		
		// запись реквизитов шапки документа
		СтрокаРеквизитов              = "";
		СтрокаРеквизитовПП            = "";
		
		ПроизвольныеПараметры         = Новый Структура;
		
		ПроизвольныеПараметры.Вставить("МесяцОплаты",    "");
        ПроизвольныеПараметры.Вставить("ГодОплаты",      "");	
		
		Для каждого ТекПоле Из СтрокаГруппировки.Поля Цикл
			Если Найти(ВРЕГ(ТекПоле), "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ") = 0 Тогда
				СтрокаРеквизитов    = СтрокаРеквизитов   + "," + ТекПоле;
			Иначе
				СтрокаРеквизитовПП  = СтрокаРеквизитовПП + "," + ТекПоле;
			КонецЕсли;
		КонецЦикла;
		
		СтрокаРеквизитов            = Сред(СтрокаРеквизитов, 2);
		СтрокаРеквизитовПП          = Сред(СтрокаРеквизитовПП, 2);
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДокумента, СтрокаРеквизитов);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, Задание, "Организация");
		
		СтруктураПроверки           = Новый Структура(СтрЗаменить(СтрокаРеквизитовПП, ".", ""));
						
		ЗаполнитьЗначенияСвойств(СтруктураПроверки, СтрокаДокумента);
		
		Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
			Если ВРЕГ(Лев(ЗначениеПроверки.Ключ, 21)) = "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ" Тогда
				ПроизвольныеПараметры.Вставить(Сред(ЗначениеПроверки.Ключ, 22), ЗначениеПроверки.Значение);
			КонецЕсли;
		КонецЦикла; 

		
		// обработка реквизитов табличных частей
		Для каждого ВложеннаяГруппировка Из СтрокаГруппировки.Строки Цикл
			
			СтрокаРеквизитов          = "";
			СтрокаРеквизитовПП        = "";
			
			Для каждого ТекПоле Из ВложеннаяГруппировка.Поля Цикл
				
				Если Найти(ВРЕГ(ТекПоле), "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ") = 0 Тогда
				
					Если Лев(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 1) = ВложеннаяГруппировка.Группировка + "." Тогда
						СтрокаРеквизитов  = СтрокаРеквизитов + "," + Сред(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 2);	
					Иначе
						СтрокаРеквизитов  = СтрокаРеквизитов + "," + ТекПоле;
					КонецЕсли;
					
				Иначе
					
					СтрокаРеквизитовПП  = СтрокаРеквизитовПП + "," + ТекПоле;
					
				КонецЕсли;
				
			КонецЦикла;
			
			СтрокаРеквизитов          = Сред(СтрокаРеквизитов, 2);
			СтрокаРеквизитовПП        = Сред(СтрокаРеквизитовПП, 2);
			КБКНазначения             = "";  
			
			ПараметрыВызоваФункции    = Новый Структура;
						
			ПараметрыВызоваФункции.Вставить("ИННПлательщика", "");
			ПараметрыВызоваФункции.Вставить("КПППлательщика", "");	
				
			// в СтрокаРеквизитов только имена табличной части
			
			Для каждого ВложеннаяСтрока Из СтрокаДокумента.Строки Цикл
				
								
				ЕстьЗаполненные       = Ложь;
				СтруктураПроверки     = Новый Структура(СтрокаРеквизитов);
				
				Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
					СтруктураПроверки[ЗначениеПроверки.Ключ]          = ВложеннаяСтрока[ВложеннаяГруппировка.Группировка+ЗначениеПроверки.Ключ];	
					ЕстьЗаполненные                                   = Макс(ЕстьЗаполненные, ЗначениеЗаполнено(СтруктураПроверки[ЗначениеПроверки.Ключ]));
				КонецЦикла;
				
				Если ЕстьЗаполненные Тогда   
					
					Если ВложеннаяГруппировка.Группировка  =  "ДокументыОснования" И (СтрокаДокумента.Строки.Количество() = 1) Тогда
						
						ЗаполнитьЗначенияСвойств(ДокументОбъект, СтруктураПроверки);   
						
					ИначеЕсли ВложеннаяГруппировка.Группировка  =  "РеквизитыПлатежногоДокумента" Тогда  
						
						ЗаполнитьЗначенияСвойств(ДокументОбъект[ВложеннаяГруппировка.Группировка].Добавить(), СтруктураПроверки); 
						ДокументОбъект[ВложеннаяГруппировка.Группировка][ДокументОбъект[ВложеннаяГруппировка.Группировка].Количество()-1].КлючСтроки = Новый УникальныйИдентификатор;   
						
						СтруктураКлючей.Вставить("_" + СтруктураПроверки["НомерСтроки"], ДокументОбъект[ВложеннаяГруппировка.Группировка][ДокументОбъект[ВложеннаяГруппировка.Группировка].Количество()-1].КлючСтроки);
						
					ИначеЕсли ВложеннаяГруппировка.Группировка  =  "ИзмененныеРеквизиты" Тогда 
						
						ЗаполнитьЗначенияСвойств(ДокументОбъект[ВложеннаяГруппировка.Группировка].Добавить(), СтруктураПроверки); 
						
						Если ЗначениеЗаполнено(СтруктураПроверки.НомерСтроки) И СтруктураПроверки.НомерСтроки <= ДокументОбъект.РеквизитыПлатежногоДокумента.Количество() Тогда 
							ДокументОбъект[ВложеннаяГруппировка.Группировка][ДокументОбъект[ВложеннаяГруппировка.Группировка].Количество()-1].КлючСтроки = СтруктураКлючей["_" + СтруктураПроверки["НомерСтроки"]]; 
						КонецЕсли;	
						
					Иначе
						
						ЗаполнитьЗначенияСвойств(ДокументОбъект[ВложеннаяГруппировка.Группировка].Добавить(), СтруктураПроверки);	
						
					КонецЕсли;	
																			
				КонецЕсли;
				
			КонецЦикла; 
				
		КонецЦикла; 
				
		Если Метаданные.Документы[Формат.ИдентификаторОбъекта.Имя].Реквизиты.Найти("КонтрагентИНН") <> Неопределено Тогда
		
			ДокументОбъект.Контрагент            = БиблиотекаФункцийОбмена.ОпределитьКонтрагента(ДокументОбъект.КонтрагентИНН, ДокументОбъект.КонтрагентКПП, ДокументОбъект.КонтрагентНаименование, , , ВидОбмена, ДанныеНовыхКонтрагентов);
			
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.Контрагент) И ТипЗнч(ДанныеНовыхКонтрагентов) = Тип("ТаблицаЗначений") Тогда
				Если ДанныеНовыхКонтрагентов.Количество() > 0 И НЕ ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
					 ДанныеНовыхКонтрагентов[ДанныеНовыхКонтрагентов.Количество()-1].ДокументСсылка     = ДокументОбъект.Ссылка;
					 ДанныеНовыхКонтрагентов[ДанныеНовыхКонтрагентов.Количество()-1].ИмяРеквизита       = "Контрагент";	 
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
			
			ДокументОбъект.СчетКонтрагента  = БиблиотекаФункцийОбмена.ОпределитьСчетКонтрагента(ДокументОбъект.Контрагент, ?(ЗначениеЗаполнено(ДокументОбъект.КонтрагентЛицевойСчет), ДокументОбъект.КонтрагентЛицевойСчет, ДокументОбъект.КонтрагентБанковскийСчет), 
			                                  ДокументОбъект.КонтрагентБИКБанка, ДокументОбъект.КонтрагентНаименованиеБанка, ДокументОбъект.КонтрагентКорСчетБанка);
											  								  
		КонецЕсли;		
		
		Если ДокументОбъект.Ссылка.Пустая() ИЛИ ДокументОбъект.Модифицированность() Тогда					
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);	
		КонецЕсли;			
		
		Если Задание.ОбъектыОбмена.Найти(ДокументОбъект.Ссылка) = Неопределено Тогда    
			
			НовСтрокаЗадания                    = Задание.ОбъектыОбмена.Добавить();
			НовСтрокаЗадания.ИмяФайлаЗагрузки	= ИмяФайла;
			НовСтрокаЗадания.Формат				= Формат;
			НовСтрокаЗадания.Объект				= ДокументОбъект.Ссылка;  
			
		КонецЕсли;
		//-------------------------------------
		
    КонецЦикла;

КонецПроцедуры 

Функция ПолучитьИндекс(ИмяПоля, СоответствиеИндексов) Экспорт
	
    Индекс = СоответствиеИндексов.Получить(ИмяПоля);
	
	Если Индекс = Неопределено Тогда
		 Индекс = 0;
	КонецЕсли;  
	 
	СоответствиеИндексов.Вставить(ИмяПоля, Индекс + 1); 
		
	Возврат Индекс;
	
КонецФункции  

Процедура ДекрементироватьИндекс(ИмяПоля, СоответствиеИндексов) Экспорт
	
    Индекс = СоответствиеИндексов.Получить(ИмяПоля);
	
	Если Индекс = Неопределено Тогда
		 Индекс = 0;
	КонецЕсли;
	
	СоответствиеИндексов.Вставить(ИмяПоля, ?(Индекс > 0, Индекс - 1, 0));
		
КонецПроцедуры


Процедура ЗагрузитьИзФайлаXML_TXL(ТекстФайла, Формат, Задание, ИмяФайла, ДанныеНовыхКонтрагентов, СтруктураВыписки)
	
	Перем СостояниеПлатежноРасчетныхДокументов;	
	
	СписокСтрокПП = Новый ТаблицаЗначений; 
	СписокСтрокПП.Колонки.Добавить("НомерСтр");
	СписокСтрокПП.Колонки.Добавить("КБК"); 
	СписокСтрокПП.Колонки.Добавить("ТипКБК"); 
	СписокСтрокПП.Колонки.Добавить("КодЦели"); 
	СписокСтрокПП.Колонки.Добавить("НомерБО"); 
	СписокСтрокПП.Колонки.Добавить("ОКАТО"); 
	СписокСтрокПП.Колонки.Добавить("Сумма"); 
	СписокСтрокПП.Колонки.Добавить("ЭтоСписание");
	СписокСтрокПП.Колонки.Добавить("Операция");
	СписокСтрокПП.Колонки.Добавить("Дебет");
    СписокСтрокПП.Колонки.Добавить("Кредит");     
	СписокСтрокПП.Колонки.Добавить("Примечание");  
	СписокСтрокПП.Колонки.Добавить("ИНН");     
	СписокСтрокПП.Колонки.Добавить("КПП");
    СписокСтрокПП.Колонки.Добавить("Наименование"); 
	СписокСтрокПП.Колонки.Добавить("ФИО");
	
	СостояниеПлатежноРасчетныхДокументов = Новый Структура;
	
	НомерСтрокиОсновногоФайла            = Задание.ФайлыОбмена.НайтиСтроки(Новый Структура("ИмяФайлаЗагрузки", ИмяФайла))[0].НомерСтроки;
	
	СоответствиеКолонок                  = Новый Соответствие; 
	ДеревоСтруктуры                      = СоотвествиеФорматовРабочимСтруктурам.Получить(Формат.Наименование);
	
	Если ДеревоСтруктуры = Неопределено Тогда
				
		ПравилаЗагрузки                                       = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(Формат);	
		ДеревоСтруктуры                                       = Новый ДеревоЗначений;
		
		ДеревоСтруктуры.Колонки.Добавить("ИмяПоля",				Новый ОписаниеТипов("Строка"));
		ДеревоСтруктуры.Колонки.Добавить("ПолноеИмяПоля",		Новый ОписаниеТипов("Строка"));
		ДеревоСтруктуры.Колонки.Добавить("ИмяПоляТаблицы",		Новый ОписаниеТипов("Строка"));
		ДеревоСтруктуры.Колонки.Добавить("ПорядокЗаполнения", 	Новый ОписаниеТипов("Строка"));
		ДеревоСтруктуры.Колонки.Добавить("ПолеОбъекта",			Новый ОписаниеТипов("Строка"));
		ДеревоСтруктуры.Колонки.Добавить("ТабличнаяЧасть",		Новый ОписаниеТипов("Строка"));
		ДеревоСтруктуры.Колонки.Добавить("ДопДействия",			Новый ОписаниеТипов("Строка"));
		ДеревоСтруктуры.Колонки.Добавить("Условие",				Новый ОписаниеТипов("Строка"));
		ДеревоСтруктуры.Колонки.Добавить("КонечныйЭлемент", 	Новый ОписаниеТипов("Булево"));
		ДеревоСтруктуры.Колонки.Добавить("Группировка",			Новый ОписаниеТипов("Строка"));
		
		ОписаниеОбъектаОшибки = Новый ТаблицаЗначений;
		ОписаниеОбъектаОшибки.Колонки.Добавить("ПолеФайла", , "Поле файла передачи");
		ОписаниеОбъектаОшибки.Колонки.Добавить("Ошибка",    , "Ошибка заполнения поля файла передачи");
		
		Для каждого ТекПравило Из ПравилаЗагрузки Цикл
			// если поле объекта не задано, то мы не учитываем узел
			Если ЗначениеЗаполнено(ТекПравило.ПолеОбъекта) Тогда
				
				КоллекцияСтрокДерева = ДеревоСтруктуры.Строки;
				ЧастиИмени           = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекПравило.ПолеФайлаПередачи, "/");
				МаксИндекс           = ЧастиИмени.ВГраница();
				
				Для Индекс           = 0 По МаксИндекс Цикл
					ЧастьИмени       = ЧастиИмени[Индекс];
					
					Если ПустаяСтрока(ЧастьИмени) Тогда
						Продолжить;
					КонецЕсли;
					
					ТекСтрокаДерева                     = КоллекцияСтрокДерева.Найти(ЧастьИмени, "ИмяПоля");
					
					Если ТекСтрокаДерева = Неопределено Тогда
						
						ТекСтрокаДерева                 = КоллекцияСтрокДерева.Добавить();
						ТекСтрокаДерева.ИмяПоля         = ЧастьИмени;
						
						Если ЗначениеЗаполнено(ТекПравило.ТабличнаяЧасть) Тогда
							ТекСтрокаДерева.Группировка = ТекПравило.ТабличнаяЧасть;
						ИначеЕсли ЗначениеЗаполнено(ТекПравило.ПолеОбъекта) И Найти(ТекПравило.ПолеОбъекта, ".") = 0 Тогда
							ТекСтрокаДерева.Группировка = "Объект";
						КонецЕсли;
						
						Если Индекс = МаксИндекс Тогда
							
							ТекСтрокаДерева.ПолноеИмяПоля 		= ТекПравило.ПолеФайлаПередачи;
							ТекСтрокаДерева.ПолеОбъекта 		= ТекПравило.ПолеОбъекта;
							ТекСтрокаДерева.ПорядокЗаполнения	= ТекПравило.ПорядокЗаполнения;
							ТекСтрокаДерева.ТабличнаяЧасть 		= ТекПравило.ТабличнаяЧасть;
							ТекСтрокаДерева.ДопДействия 		= ТекПравило.ДопДействия;
							ТекСтрокаДерева.Условие		 		= ТекПравило.Условие;
							ТекСтрокаДерева.КонечныйЭлемент		= Истина;
							
						КонецЕсли;
						
					КонецЕсли;
					
					КоллекцияСтрокДерева = ТекСтрокаДерева.Строки;
					
				КонецЦикла; 
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбозначитьЛистьяДерева(ДеревоСтруктуры);
		ОбозначитьГруппировкиВДереве(ДеревоСтруктуры);  
		
		СоотвествиеФорматовРабочимСтруктурам.Вставить(Формат.Наименование, ДеревоСтруктуры);
		
	КонецЕсли;	
		
	// для каждого поля зададим имя поля таблицы и сразу создадим структуру таблицы
	ТаблицаДанных                = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("КонечныйЭлемент");
	СчетчикКолонок               = 1;
	ЗаполнитьИменаПолейДереваСтруктуры(ДеревоСтруктуры, ТаблицаДанных, СчетчикКолонок);
	
	ЧтениеXML 			         = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстФайла);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM    = ПостроительDOM.Прочитать(ЧтениеXML);

	ПутьПравилаОбработки         = "";
	ЧтениеXML.УстановитьСтроку(ТекстФайла);
	
	СоответствиеИндексов          = Новый Соответствие;
	
	Пока ЧтениеXML.Прочитать() Цикл
		// Обработка узла XML           	
		Если ЧтениеXML.ТипУзла   = ТипУзлаXML.НачалоЭлемента Тогда
			
			ИмяПоля              = ЧтениеXML.ЛокальноеИмя;	
			ИмяПоляDOM           = ЧтениеXML.ЛокальноеИмя;
			ПутьПравилаОбработки = ПутьПравилаОбработки + "/" + ИмяПоля;
			
			ТекСтрока            = ДеревоСтруктуры.Строки.Найти(ПутьПравилаОбработки, "ПолноеИмяПоля",Истина);
			Если ТекСтрока <> Неопределено Тогда
				
				Если (ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[0].ДочерниеУзлы.Количество()> 0) И 
					 (ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[0].ДочерниеУзлы[0].ИмяУзла) <> "#text" Тогда
					СтрокаДанных                 = ТаблицаДанных.Добавить(); 
					СтрокаДанных.КонечныйЭлемент = Ложь;
				КонецЕсли;
				
				РодительскийУзел     = "";  
				
				Индекс                                  = ПолучитьИндекс(ИмяПоля, СоответствиеИндексов);
				Если ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля).Количество() > Индекс Тогда 
					
					РодительскийУзел = ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[Индекс];
					
					Для Каждого ДочернийУзел Из ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[Индекс].ДочерниеУзлы Цикл
						
						ОбрабатываемоеПравило = ТекСтрока.Строки.Найти(ДочернийУзел.ИмяУзла, "ИмяПоля"); 
												
						Если ОбрабатываемоеПравило <> Неопределено Тогда   
							
							 Если НЕ ЗначениеЗаполнено(ОбрабатываемоеПравило.ИмяПоляТаблицы) Тогда 
								Продолжить;
							 КонецЕсли;
							 
							 СтрокаДанных.КонечныйЭлемент = ОбрабатываемоеПравило.КонечныйЭлемент;
							 СтрокаДанных[ОбрабатываемоеПравило.ИмяПоляТаблицы] = ДочернийУзел.ТекстовоеСодержимое;
							 
						КонецЕсли;
						
					КонецЦикла;	
						
				КонецЕсли;	
				
			КонецЕсли;
			
		ИначеЕсли ЧтениеXML.ТипУзла  = ТипУзлаXML.КонецЭлемента Тогда 			
			ПутьПравилаОбработки     = Лев(ПутьПравилаОбработки, СтрДлина(ПутьПравилаОбработки) - (СтрДлина(ЧтениеXML.Имя)+1));
		КонецЕсли;
		
	КонецЦикла;	
			
	МассивИменСтрок                  = Новый Массив;
	МассивИменСтрок.Добавить("/self:Rep_ADI/BasicInform_DocGuid");
	
	МассивИменПолейТД                = Новый Массив;
	
	Для Каждого ЭлМас Из МассивИменСтрок Цикл
		ТекСтрока                    = ДеревоСтруктуры.Строки.Найти(ЭлМас, "ПолноеИмяПоля",Истина);
		Если ТекСтрока <> Неопределено Тогда
			МассивИменПолейТД.Добавить(ТекСтрока.ИмяПоляТаблицы);	
		КонецЕсли;
	КонецЦикла;
	
	// заполним колонки конечных элементов значениями из вышестоящих неконечных элементов
	СвернутьТаблицуЗначений(ТаблицаДанных, МассивИменПолейТД);
	
	// создание схемы компоновки данных
	СхемаКомпоновкиРезультата         = Новый СхемаКомпоновкиДанных;
	ИсточникДанных                    = СхемаКомпоновкиРезультата.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя                = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных                       = СхемаКомпоновкиРезультата.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя 			      = "НаборДанных1";
	НаборДанных.ИмяОбъекта 		      = "ВходящиеДанные";
	НаборДанных.ИсточникДанных 	      = "ИсточникДанных1";
	
	РазрешенныеМодули                 = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("БИБЛИОТЕКАФУНКЦИЙОБМЕНА");
	СоответствиеГруппировок           = Новый Соответствие;
	СоздатьСтруктуруСхемыКомпоновкиИзДерева(ДеревоСтруктуры, СхемаКомпоновкиРезультата.НастройкиПоУмолчанию, СхемаКомпоновкиРезультата, НаборДанных, РазрешенныеМодули, СоответствиеГруппировок);	
	
	ВнешниеНаборы                     = Новый Структура("ВходящиеДанные", ТаблицаДанных);
	ФорматЗагрузки                    = Формат;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "КассовыйОрган";
	Параметр.Значение                 = Задание.КассовыйОрган;
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "Организация";
	Параметр.Значение                 = Задание.Организация;
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "ВалютаРеглУчета";
	Параметр.Значение                 = Константы.ВалютаРегламентированногоУчета.Получить();
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	НастройкиКомпоновки               = СхемаКомпоновкиРезультата.НастройкиПоУмолчанию;
	
	КомпоновщикМакета                 = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки                   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиРезультата, НастройкиКомпоновки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	ПроцессорКомпоновки               = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы,,Истина);
	ПроцессорВывода                   = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ДеревоЗначений);
	
	РезультатВыполнения               = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	СокращенноеДеревоСтруктуры        = Новый ДеревоЗначений;
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Группировка", Новый ОписаниеТипов("Строка"));
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Поля", Новый ОписаниеТипов("Массив"));
	
	СократитьДерево(ДеревоСтруктуры, СокращенноеДеревоСтруктуры, СоответствиеГруппировок); 
	
	ПараметрыВызоваФункции = Новый Структура;
	
	//--------------------------------------------------------------
	//обработка структуры с расчетными документами
	
	Если НЕ ЗначениеЗаполнено(Формат.ИдентификаторОбъекта) Тогда
		
		Для каждого СтрокаДокумента Из РезультатВыполнения.Строки Цикл
			
			СтрокаГруппировки               = СокращенноеДеревоСтруктуры.Строки[0];
			
			РасчетныйДокумент               = СтруктураВыписки[0].СписокПП.Добавить();
			РасчетныйДокумент.ПечатныйОбраз = Новый Структура;
			РасчетныйДокумент.СписокСтрокПП = СписокСтрокПП;
			
			СтрокаРеквизитов                = "";
			СтрокаРеквизитовПО              = "";
								
			Для каждого ТекПоле Из СтрокаГруппировки.Поля Цикл
				Если Найти(ВРЕГ(ТекПоле), "ПЕЧАТНЫЙОБРАЗ") <> 0 Тогда
					СтрокаРеквизитовПО  = СтрокаРеквизитовПО + "," + ТекПоле;					
				Иначе
					СтрокаРеквизитов    = СтрокаРеквизитов   + "," + ТекПоле;
				КонецЕсли;
			КонецЦикла;
			
			СтрокаРеквизитов            = Сред(СтрокаРеквизитов,   2);
			СтрокаРеквизитовПО          = Сред(СтрокаРеквизитовПО, 2);
			
			ЗаполнитьЗначенияСвойств(РасчетныйДокумент, СтрокаДокумента, СтрокаРеквизитов);
			
			СтруктураПроверки           = Новый Структура(СтрЗаменить(СтрокаРеквизитовПО, ".", ""));
					
			ЗаполнитьЗначенияСвойств(СтруктураПроверки, СтрокаДокумента);
			
			Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
				Если ВРЕГ(Лев(ЗначениеПроверки.Ключ, 13)) = "ПЕЧАТНЫЙОБРАЗ" Тогда
					РасчетныйДокумент.ПечатныйОбраз.Вставить(Сред(ЗначениеПроверки.Ключ, 14), ЗначениеПроверки.Значение);
				КонецЕсли;
			КонецЦикла; 
			
			Для каждого ВложеннаяГруппировка Из СтрокаГруппировки.Строки Цикл
				
				СтрокаРеквизитов          = "";   
				СтрокаРеквизитовПО        = "";
								
				Для каждого ТекПоле Из ВложеннаяГруппировка.Поля Цикл
					
					Если Найти(ВРЕГ(ТекПоле), "ПЕЧАТНЫЙОБРАЗ") <> 0 Тогда  
						Если Лев(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 1) = ВложеннаяГруппировка.Группировка + "." Тогда
							СтрокаРеквизитовПО  = СтрокаРеквизитовПО + "," + Сред(ТекПоле, СтрНайти(ТекПоле, ".", НаправлениеПоиска.СКонца)+1);	
						Иначе
							СтрокаРеквизитовПО  = СтрокаРеквизитовПО + "," + ТекПоле;
						КонецЕсли;
					Иначе
						Если Лев(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 1) = ВложеннаяГруппировка.Группировка + "." Тогда
							СтрокаРеквизитов  = СтрокаРеквизитов + "," + Сред(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 2);	
						Иначе
							СтрокаРеквизитов  = СтрокаРеквизитов + "," + ТекПоле;
						КонецЕсли;   
					КонецЕсли;	
																					
				КонецЦикла;
				
				СтрокаРеквизитов          = Сред(СтрокаРеквизитов, 2);  
				СтрокаРеквизитовПО        = Сред(СтрокаРеквизитовПО, 2);
				
				Если Врег(ВложеннаяГруппировка.Группировка)  <>  "СТРОКАПП" Тогда  
					 РасчетныйДокумент.ПечатныйОбраз.Вставить(Строка(ВложеннаяГруппировка.Группировка), Новый Массив); 
				КонецЕсли;	 
		
				Для каждого ВложеннаяСтрока Из СтрокаДокумента.Строки Цикл  
					
					//реквизиты для печатного образа
					
				    ЕстьЗаполненные       = Ложь;
					СтруктураПроверки     = Новый Структура(СтрЗаменить(СтрокаРеквизитовПО, ".", ""));
					
					Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл 
						
						СтруктураПроверки[ЗначениеПроверки.Ключ]          = ?(РезультатВыполнения.Колонки.Найти(ВложеннаяГруппировка.Группировка + "_ПечатныйОбраз_" + ЗначениеПроверки.Ключ) <> Неопределено,
						                                                      ВложеннаяСтрока[ВложеннаяГруппировка.Группировка + "_ПечатныйОбраз_" + ЗначениеПроверки.Ключ],
																			  ВложеннаяСтрока[ВложеннаяГруппировка.Группировка + "ПечатныйОбраз" + ЗначениеПроверки.Ключ]);	
						ЕстьЗаполненные                                   = Макс(ЕстьЗаполненные, ЗначениеЗаполнено(СтруктураПроверки[ЗначениеПроверки.Ключ]));
					КонецЦикла;
					
					Если ЕстьЗаполненные Тогда
						РасчетныйДокумент.ПечатныйОбраз[ВложеннаяГруппировка.Группировка].Добавить(СтруктураПроверки);								
					КонецЕсли; 			
	
				
					Если (Врег(ВложеннаяГруппировка.Группировка)  =  "СТРОКАПП") ИЛИ 
						 (Врег(ВложеннаяГруппировка.Группировка)  =  "РЕКВИЗИТЫПЛАТЕЖНОГОДОКУМЕНТА") Тогда
						
						ЕстьЗаполненные       = Ложь;
						СтруктураПроверки     = Новый Структура(СтрЗаменить(СтрокаРеквизитов, ".", ""));
						
						Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
							СтруктураПроверки[ЗначениеПроверки.Ключ]          = ВложеннаяСтрока[ВложеннаяГруппировка.Группировка + ЗначениеПроверки.Ключ];	
							ЕстьЗаполненные                                   = Макс(ЕстьЗаполненные, ЗначениеЗаполнено(СтруктураПроверки[ЗначениеПроверки.Ключ]));
						КонецЦикла;
						
						Если ЕстьЗаполненные Тогда
							ЗаполнитьЗначенияСвойств(РасчетныйДокумент.СписокСтрокПП.Добавить(), СтруктураПроверки);								
						КонецЕсли; 			
						
					ИначеЕсли (Врег(ВложеннаяГруппировка.Группировка)  =  "ИЗМЕНЕННЫЕРЕКВИЗИТЫ") Тогда
						
						ЕстьЗаполненные       = Ложь;
						СтруктураПроверки     = Новый Структура(СтрЗаменить(СтрокаРеквизитов, ".", ""));
						
						Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
							СтруктураПроверки[ЗначениеПроверки.Ключ]          = ВложеннаяСтрока[ВложеннаяГруппировка.Группировка + ЗначениеПроверки.Ключ];	
							ЕстьЗаполненные                                   = Макс(ЕстьЗаполненные, ЗначениеЗаполнено(СтруктураПроверки[ЗначениеПроверки.Ключ]));
						КонецЦикла;
						
						Если (ЕстьЗаполненные) И ЗначениеЗаполнено(СтруктураПроверки.НомерСтр) Тогда
                        	ЗаполнитьЗначенияСвойств(РасчетныйДокумент.СписокСтрокПП[СтруктураПроверки.НомерСтр - 1], СтруктураПроверки);								
						КонецЕсли; 
						
					КонецЕсли;
					
				КонецЦикла;	

			КонецЦикла;	
				
		КонецЦикла;	
			
		Возврат;
		
	КонецЕсли;
	
	//--------------------------------------------------------------
	
	Для каждого СтрокаДокумента Из РезультатВыполнения.Строки Цикл
		
		Если РезультатВыполнения.Колонки.Найти("ЛицевойСчет") <> Неопределено И НЕ ЗначениеЗаполнено(СтрокаДокумента["ЛицевойСчет"]) Тогда		    
			
			    СтрокаОписания = ОписаниеОбъектаОшибки.Добавить();
				СтрокаОписания.ПолеФайла = НСтр("ru='Не найден лицевой счет'"); 
				СтрокаОписания.Ошибка    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(	НСтр("ru='Не найден лицевой счет №[ЛицевойСчет], указанный в файле [ИмяФайла]'"),
																									Новый Структура("ЛицевойСчет, ИмяФайла", 
																													СтрокаДокумента["НомерЛицевогоСчетаФайла"], 
																													ИмяФайла));
				ОбщегоНазначения.СообщитьПользователю(СтрокаОписания.Ошибка,,"ФайлыОбмена["+НомерСтрокиОсновногоФайла+"].ИмяФайлаЗагрузки");
				ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), НомерСтрокиОсновногоФайла);
				Продолжить;
				
        КонецЕсли;
		
		СтрокаГруппировки             = СокращенноеДеревоСтруктуры.Строки[0];
		
		// выделяем объект для импорта
		Если РезультатВыполнения.Колонки.Найти("СостояниеПлатежноРасчетныхДокументовGUIDКО") <> Неопределено Тогда		
			СохраненныйДокумент       = БиблиотекаФункцийОбмена.НайтиДокументПоGUID(Формат.ИдентификаторОбъекта.Имя, СтрокаДокумента.СостояниеПлатежноРасчетныхДокументовGUIDКО);
		Иначе
			СохраненныйДокумент       = "";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СохраненныйДокумент) Тогда		
			СохраненныйДокумент       = Документы[Формат.ИдентификаторОбъекта.Имя].ПустаяСсылка();
		КонецЕсли;

		Если СохраненныйДокумент.Пустая() Тогда
			ДокументОбъект            = Документы[Формат.ИдентификаторОбъекта.Имя].СоздатьДокумент();
			ДокументОбъект.Дата       = ТекущаяДатаСеанса();
		Иначе 
			
			Если Задание.ВидОбмена.ОтменаПовторнойЗагрузкиПроведенныхДокументов И СохраненныйДокумент.Проведен Тогда 
				
				Если Задание.ОбъектыОбмена.Найти(СохраненныйДокумент) = Неопределено Тогда    
			
					НовСтрокаЗадания                    = Задание.ОбъектыОбмена.Добавить();
					НовСтрокаЗадания.ИмяФайлаЗагрузки	= ИмяФайла;
					НовСтрокаЗадания.Формат				= Формат;
					НовСтрокаЗадания.Объект				= СохраненныйДокумент;  
					
				КонецЕсли;   
				
				Сообщение    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(НСтр("ru='В файле [ИмяФайла] есть ссылка на документ [Документ], загруженный ранее и проведенный. Он останется без изменений.'"),
																									Новый Структура("Документ, ИмяФайла", 
																													СохраненныйДокумент, 
																													ИмяФайла));
				ОбщегоНазначения.СообщитьПользователю(Сообщение,,"ФайлыОбмена["+НомерСтрокиОсновногоФайла+"].ИмяФайлаЗагрузки");


				Продолжить;
			КонецЕсли;
						
			ДокументОбъект            = СохраненныйДокумент.ПолучитьОбъект();     
						
			Если БиблиотекаФункцийОбмена.ПолучитьСтатусДокумента(ДокументОбъект.Ссылка) <> Перечисления.СтатусыИсполненияДокумента.ВРаботе Тогда
				ВызватьИсключение НСтр("ru='Документ с таким же GUID был обработан ранее (его статус отличен от статуса <<в работе>>) '") + СохраненныйДокумент;
			КонецЕсли;	
			Попытка
				ЗаблокироватьДанныеДляРедактирования(ДокументОбъект.Ссылка);
			Исключение
				ВызватьИсключение НСтр("ru='Невозможно заблокировать для редактирования документ '") + СохраненныйДокумент;
			КонецПопытки;
			
			Для каждого ТабЧасть Из Метаданные.Документы[Формат.ИдентификаторОбъекта.Имя].ТабличныеЧасти Цикл
				ДокументОбъект[ТабЧасть.Имя].Очистить();
			КонецЦикла;
			
		КонецЕсли;
		
		//настроим расшифровку под эту Выписку, так как в оригинале она к Выпискам вообще не привязана
		
		СтруктураВыписки[0].GUIDВыписки    = ?(РезультатВыполнения.Колонки.Найти("СостояниеПлатежноРасчетныхДокументовGUIDКО") <> Неопределено, СтрокаДокумента.СостояниеПлатежноРасчетныхДокументовGUIDКО, "");
		СтруктураВыписки[0].НомерЛС        = СтрокаДокумента.ЛицевойСчет.Код;
		СтруктураВыписки[0].ДатаВыписки    = ДокументОбъект.Дата;
		
		//----------------------------------
		
		// запись реквизитов шапки документа
		СтрокаРеквизитов              = "";
		СтрокаРеквизитовПП            = "";
		СтрокаРеквизитовСР            = ""; 
				
		ПроизвольныеПараметры         = Новый Структура;
				
		Для каждого ТекПоле Из СтрокаГруппировки.Поля Цикл
			Если Найти(ВРЕГ(ТекПоле), "СОСТОЯНИЕПЛАТЕЖНОРАСЧЕТНЫХДОКУМЕНТОВ") <> 0 Тогда
				СтрокаРеквизитовСР  = СтрокаРеквизитовСР + "," + ТекПоле;			
			ИначеЕсли Найти(ВРЕГ(ТекПоле), "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ") <> 0 Тогда
				СтрокаРеквизитовПП  = СтрокаРеквизитовПП + "," + ТекПоле;				
			ИначеЕсли Найти(ВРЕГ(ТекПоле), "ФАЙЛА") = 0 Тогда  
				//не относится к сообщениям об ошибках с данными из файла
				СтрокаРеквизитов    = СтрокаРеквизитов   + "," + ТекПоле;
			КонецЕсли;
		КонецЦикла;
		
		СтрокаРеквизитов            = Сред(СтрокаРеквизитов,   2);
		СтрокаРеквизитовПП          = Сред(СтрокаРеквизитовПП, 2);
		СтрокаРеквизитовСР          = Сред(СтрокаРеквизитовСР, 2);
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДокумента, СтрокаРеквизитов);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, Задание, "Организация");
		
		Если ДокументОбъект.ЭтоНовый() Тогда
			ДокументОбъект.Записать();
		КонецЕсли;
		
		//------------------------------------
		Если ЗначениеЗаполнено(СтрокаРеквизитовСР) Тогда
			
			Запись                              = РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.СоздатьМенеджерЗаписи();
			Запись.ПлатежноРасчетныйДокумент 	= ДокументОбъект.Ссылка;
			
			РеквизитыСР                         = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаРеквизитовСР, ",");
			
			Для каждого РеквизитСР Из РеквизитыСР Цикл			
				Запись[Сред(РеквизитСР, 38)]    = СтрокаДокумента[СтрЗаменить(РеквизитСР, ".", "")];
			КонецЦикла;
				
			Запись.Записать();
			
		КонецЕсли;
        //------------------------------------
		
		СтруктураПроверки           = Новый Структура(СтрЗаменить(СтрокаРеквизитовПП, ".", ""));
						
		ЗаполнитьЗначенияСвойств(СтруктураПроверки, СтрокаДокумента);
		
		// обработка реквизитов табличных частей
		Для каждого ВложеннаяГруппировка Из СтрокаГруппировки.Строки Цикл
			
			СтрокаРеквизитов          = "";
			СтрокаРеквизитовПП        = "";
			
			Для каждого ТекПоле Из ВложеннаяГруппировка.Поля Цикл
				
				Если Найти(ВРЕГ(ТекПоле), "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ") = 0 Тогда
				
					Если Лев(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 1) = ВложеннаяГруппировка.Группировка + "." Тогда
						СтрокаРеквизитов  = СтрокаРеквизитов + "," + Сред(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 2);	
					Иначе
						СтрокаРеквизитов  = СтрокаРеквизитов + "," + ТекПоле;
					КонецЕсли;
					
					Если Найти(ВРЕГ(ТекПоле), "СОСТОЯНИЕПЛАТЕЖНОРАСЧЕТНЫХДОКУМЕНТОВ") > 0 Тогда
						 СтрокаРеквизитовСР = СтрокаРеквизитовСР + "," + ТекПоле;
					КонецЕсли;
					
				Иначе
					
					СтрокаРеквизитовПП  = СтрокаРеквизитовПП + "," + ТекПоле;
										
				КонецЕсли;
				
			КонецЦикла;
			
			СтрокаРеквизитов          = Сред(СтрокаРеквизитов, 2);
			СтрокаРеквизитовПП        = Сред(СтрокаРеквизитовПП, 2); 
			
			ПараметрыВызоваФункции    = Новый Соответствие;
			
			н = " ";
			
			Для каждого ВложеннаяСтрока Из СтрокаДокумента.Строки Цикл
				
				Для каждого Параметр Из РезультатВыполнения.Колонки  Цикл
					Если Найти(Параметр.Имя, "__") > 0 И ЗначениеЗаполнено(ВложеннаяСтрока[Параметр.Имя]) Тогда
						
						Если Сред(Параметр.Имя, Найти(Параметр.Имя, "__") + 2) <> н Тогда
							РабочаяСтрока = СтрокаДокумента.Строки.Добавить();
							н             = Сред(Параметр.Имя, Найти(Параметр.Имя, "__") + 2);
						КонецЕсли;
						
						РабочаяСтрока[Лев(Параметр.Имя, Найти(Параметр.Имя, "__")-1)] = ВложеннаяСтрока[Параметр.Имя];
						
					КонецЕсли;	
				КонецЦикла;
				
			КонецЦикла;
						
			
			Для каждого ВложеннаяСтрока Из СтрокаДокумента.Строки Цикл
				
				Если ВложеннаяГруппировка.Группировка  =  "ДокументыДвижений" Тогда
					
					ФункцияЗаполнения                  = ВложеннаяСтрока["ДокументыДвиженийИсполняющийДокумент"];
					
					РазложениеИсполняемыхДействий = СтрРазделить(ФункцияЗаполнения, ";");
					ИсполняющийДокумент           = Неопределено;	
					
					ПараметрыВызоваФункции.Вставить("НомерДок",            "");
					ПараметрыВызоваФункции.Вставить("ДатаДок",             "");
					ПараметрыВызоваФункции.Вставить("СуммаСписания",       "");
					
																	
					СтруктураПроверки                             = Новый Структура(СтрЗаменить(СтрокаРеквизитовПП, ".", ""));
					
					ЗаполнитьЗначенияСвойств(СтруктураПроверки, ВложеннаяСтрока);
					
					Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
						Если ВРЕГ(Лев(ЗначениеПроверки.Ключ, 38)) = "ДОКУМЕНТЫДВИЖЕНИЙПРОИЗВОЛЬНЫЕПАРАМЕТРЫ" Тогда
							ПараметрыВызоваФункции.Вставить(Сред(ЗначениеПроверки.Ключ, 39), ЗначениеПроверки.Значение);
						КонецЕсли;
					КонецЦикла; 
					
					//****************************************************************************
					
					ПараметрНомерДок 			= ?(ЗначениеЗаполнено(ПараметрыВызоваФункции.Получить("НомерДок")), ПараметрыВызоваФункции.Получить("НомерДок"), ПараметрыВызоваФункции.Получить("НомерПодтверждающегоДокумента"));
					ПараметрДатаДок 			= ?(ЗначениеЗаполнено(ПараметрыВызоваФункции.Получить("ДатаДок")),  ПараметрыВызоваФункции.Получить("ДатаДок"),  ПараметрыВызоваФункции.Получить("ДатаПодтверждающегоДокумента"));
					ПараметрИмяДок              = ПараметрыВызоваФункции.Получить("ИмяДок");
					ПараметрГУИД 				= ПараметрыВызоваФункции.Получить("GUIDПП");
					ПараметрСуммаПоступления	= ПараметрыВызоваФункции.Получить("СуммаПоступления");
					ПараметрСуммаСписания 		= ПараметрыВызоваФункции.Получить("СуммаСписания");     
					ПараметрСуммаКорректировки  = ПараметрыВызоваФункции.Получить("СуммаКорректировки"); 
					ПараметрКВД					= ПараметрыВызоваФункции.Получить("КВД");
					ПараметрИсточникиСтредств	= ПараметрыВызоваФункции.Получить("ИсточникиСредств");
					ПараметрНомерКОО        	= ПараметрыВызоваФункции.Получить("НомерКОО");
					ПараметрНомерПодтверДок     = ПараметрыВызоваФункции.Получить("НомерПодтверждающегоДокумента");
				    ПараметрДатаПодтверДок      = ПараметрыВызоваФункции.Получить("ДатаПодтверждающегоДокумента");
					
					Если ПараметрСуммаПоступления<>Неопределено Тогда
						ПараметрСуммаПоступления =  БиблиотекаФункцийОбмена.СтрокаВЧисло(ПараметрСуммаПоступления);
					Иначе
						ПараметрСуммаПоступления = 0;
					КонецЕсли;
					Если ПараметрСуммаСписания<>Неопределено Тогда
						ПараметрСуммаСписания = БиблиотекаФункцийОбмена.СтрокаВЧисло(ПараметрСуммаСписания);
					Иначе
						ПараметрСуммаСписания = 0;
					КонецЕсли;
										
					Для каждого ВыполняемоеДействие Из РазложениеИсполняемыхДействий Цикл
						// выполняем действие для данной строки
						Если ВРЕГ(ВыполняемоеДействие) = ВРЕГ("НовоеКассовоеПоступление") Тогда
							Если ПараметрСуммаПоступления>0 Тогда
																
								Если НЕ ЗначениеЗаполнено(ИсполняющийДокумент) Тогда
									 ИсполняющийДокумент = БиблиотекаФункцийОбмена.СоздатьКассовоеПоступление(СтруктураВыписки,
																											  ДокументОбъект.Ссылка, 
																											  ПараметрГУИД, 
																											  ПараметрКВД, 
																											  ПараметрИсточникиСтредств,
																											  ПараметрСуммаПоступления,
								      																	      ПараметрыВызоваФункции,
																											  ВидОбмена,
																											  ДанныеНовыхКонтрагентов);
								КонецЕсли;																			  																													  
							КонецЕсли;	
							
						ИначеЕсли ВРЕГ(ВыполняемоеДействие) = ВРЕГ("ПолучитьЗаявку") Тогда
							Если (ПараметрСуммаСписания>0) ИЛИ (ПараметрСуммаКорректировки>0) Тогда
								ИсполняющийДокумент = БиблиотекаФункцийОбмена.ОпределитьЗаявку(	ДокументОбъект.Организация,
																								ДокументОбъект.ЛицевойСчет.Код,
																								ПараметрНомерДок, 
																								ПараметрДатаДок,
																								?(ПараметрСуммаСписания>0, ПараметрСуммаСписания, ПараметрСуммаКорректировки),
																								ПараметрГУИД);
																							
							КонецЕсли;																										
							Если НЕ ЗначениеЗаполнено(ИсполняющийДокумент) Тогда   
																								
								Если ПараметрСуммаСписания > 0 Тогда 
							  		ИсполняющийДокумент =  БиблиотекаФункцийОбмена.СоздатьКассовоеВыбытие(	СтруктураВыписки, 
																											ДокументОбъект.Ссылка, 
																											ПараметрГУИД,
									 																		ПараметрКВД, 
																											ПараметрИсточникиСтредств, 
																											ПараметрСуммаСписания,
																											ПараметрыВызоваФункции,
																											ВидОбмена,
																										    ДанныеНовыхКонтрагентов);   
								КонецЕсли;

                                Если НЕ ЗначениеЗаполнено(ИсполняющийДокумент) И (ПараметрСуммаСписания > 0) И (ЗначениеЗаполнено(ПараметрНомерКОО)) Тогда 
                                	ИсполняющийДокумент = БиблиотекаФункцийОбмена.СоздатьКассовоеВыбытиеНаОснованииЗаявленияНаАккредитив(ПараметрНомерКОО, ПараметрСуммаСписания, ДокументОбъект.ДатаВыписки);
								КонецЕсли;

							Иначе    
								 Если ТипЗнч(ИсполняющийДокумент) = Тип("ДокументСсылка.ВнешнееРСКП") Тогда
											 ИсполняющийДокумент = БиблиотекаФункцийОбмена.СоздатьКассовоеВыбытиеНаОснованииРСКП(ИсполняющийДокумент, ДокументОбъект.Ссылка, СтруктураВыписки, ПараметрГУИД, ПараметрыВызоваФункции)
										Иначе

								 			 БиблиотекаФункцийОбмена.ЗаписатьОбразПервичногоДокументаЗаявки(ИсполняющийДокумент, 
								 																	СтруктураВыписки, 
																									ДокументОбъект.Ссылка, 
																									ДокументОбъект.ДатаВыписки,
																									ПараметрГУИД,
								 																	ПараметрыВызоваФункции);  
								 КонецЕсли;																	
							КонецЕсли; 					
						КонецЕсли;
						
					КонецЦикла; 

					
					
					//****************************************************************************
																	
					Если ЗначениеЗаполнено(ИсполняющийДокумент) Тогда
						ДокументОбъект.ДокументыДвижений.Добавить().ИсполняющийДокумент = ИсполняющийДокумент;
					КонецЕсли;					 		
							
                    Продолжить;
						
                КонецЕсли;
								 
				ЕстьЗаполненные       = Ложь;
				СтруктураПроверки     = Новый Структура(СтрЗаменить(СтрокаРеквизитов, ".", ""));
				
				Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
					СтруктураПроверки[ЗначениеПроверки.Ключ]          = ВложеннаяСтрока[ВложеннаяГруппировка.Группировка + ЗначениеПроверки.Ключ];	
					ЕстьЗаполненные                                   = Макс(ЕстьЗаполненные, ЗначениеЗаполнено(СтруктураПроверки[ЗначениеПроверки.Ключ]));
				КонецЦикла;
				
				Если ВложеннаяГруппировка.Группировка  =  "Остатки" Тогда
					
					Если (СтруктураПроверки["ОстатокНаНачалоДня"] = 0 И СтруктураПроверки["ОстатокНаКонецДня"] = 0) ИЛИ
						ДокументОбъект.Остатки.Количество()> 0 Тогда
						 Продолжить;
					КонецЕсли;	
						
				КонецЕсли;
				
				Если ВложеннаяГруппировка.Группировка  =  "" Тогда
					
					 Если ЕстьЗаполненные Тогда
					      ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтруктураПроверки);
					 КонецЕсли;
					
					 Продолжить;					
				КонецЕсли;

				
				Если ЕстьЗаполненные Тогда
					ЗаполнитьЗначенияСвойств(ДокументОбъект[ВложеннаяГруппировка.Группировка].Добавить(), СтруктураПроверки);   
					
					Если ВложеннаяГруппировка.Группировка  =  "Остатки" Тогда
						
						НомерСтроки = 1;  
						
						Пока Найти(СтрокаРеквизитов, "__" + Строка(НомерСтроки)) > 0 Цикл
							
							СтрокаОстатков = ДокументОбъект.Остатки.Добавить();
							Если Найти(СтрокаРеквизитов, "ОстатокНаНачалоДня__" + Строка(НомерСтроки)) > 0 Тогда
								СтрокаОстатков.ОстатокНаНачалоДня = СтруктураПроверки["ОстатокНаНачалоДня__" + Строка(НомерСтроки)];				 		
							КонецЕсли;	
							Если Найти(СтрокаРеквизитов, "ОстатокНаКонецДня__" + Строка(НомерСтроки)) > 0 Тогда
								СтрокаОстатков.ОстатокНаКонецДня = СтруктураПроверки["ОстатокНаКонецДня__" + Строка(НомерСтроки)];				 		
							КонецЕсли;	
							Если Найти(СтрокаРеквизитов, "ИсточникСредств__" + Строка(НомерСтроки)) > 0 Тогда
								СтрокаОстатков.ИсточникСредств = СтруктураПроверки["ИсточникСредств__" + Строка(НомерСтроки)];				 		
							КонецЕсли;	
							Если Найти(СтрокаРеквизитов, "Показатель__" + Строка(НомерСтроки)) > 0 Тогда
								СтрокаОстатков.Показатель = СтруктураПроверки["Показатель__" + Строка(НомерСтроки)]; 		
							КонецЕсли;	
							
							НомерСтроки    = НомерСтроки + 1;
							
						КонецЦикла;	
							
					КонецЕсли;		
										
				КонецЕсли; 				
					
			КонецЦикла;	
			
		КонецЦикла;
        		
								
		Если  ДокументОбъект.Модифицированность() Тогда					
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);	
		КонецЕсли;		
		
		Если Задание.ОбъектыОбмена.Найти(ДокументОбъект.Ссылка) = Неопределено Тогда  
			
			НовСтрокаЗадания                    = Задание.ОбъектыОбмена.Добавить();
			НовСтрокаЗадания.ИмяФайлаЗагрузки	= ИмяФайла;
			НовСтрокаЗадания.Формат				= Формат;
			НовСтрокаЗадания.Объект				= ДокументОбъект.Ссылка;      
			
			Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ВыпискаИзЛицевогоСчета") Тогда  
				
				Для каждого СтрокаВыписки Из ДокументОбъект.ДокументыДвижений Цикл
					
					СтрокаЗадания = Задание.ОбъектыОбмена.Найти(СтрокаВыписки.ИсполняющийДокумент, "Объект");
					
					Если СтрокаЗадания <> Неопределено Тогда 
						 Задание.ОбъектыОбмена.Удалить(СтрокаЗадания);
					КонецЕсли;  
					 
				КонецЦикла;	
				
			КонецЕсли;	
			
		КонецЕсли;
		//-------------------------------------
		
    КонецЦикла;
	
КонецПроцедуры     

Функция НайтиСтрокиРаспоряженияНаКартыМИР(Ссылка, НомерПлатежнойКарты, ДатаРожденияДержателяКарты, ВидВыплатНаКартуМИР)
	
	Запрос       = Новый Запрос;   
	Запрос.УстановитьПараметр("Ссылка", 	                Ссылка);
	Запрос.УстановитьПараметр("НомерПлатежнойКарты", 	    НомерПлатежнойКарты);
	Запрос.УстановитьПараметр("ДатаРожденияДержателяКарты", ДатаРожденияДержателяКарты);  
	Запрос.УстановитьПараметр("ВидВыплатНаКартуМИР",        ВидВыплатНаКартуМИР);
	Запрос.Текст = "ВЫБРАТЬ
    |	РаспоряжениеОПеречисленииНаКартыМирСостав.НомерСтроки КАК НомерСтроки
	|ИЗ
    |	Документ.РаспоряжениеОПеречисленииНаКартыМир.Состав КАК РаспоряжениеОПеречисленииНаКартыМирСостав 
	|ГДЕ
	|	(РаспоряжениеОПеречисленииНаКартыМирСостав.Ссылка = &Ссылка) И 
	|   ((РаспоряжениеОПеречисленииНаКартыМирСостав.НомерПлатежнойКарты = &НомерПлатежнойКарты) ИЛИ (РаспоряжениеОПеречисленииНаКартыМирСостав.ПлатежнаяКарта.Код = &НомерПлатежнойКарты)) И
	|   (РаспоряжениеОПеречисленииНаКартыМирСостав.ВидВыплатНаКартуМИР.Код = &ВидВыплатНаКартуМИР)";
	
	Если ЗначениеЗаполнено(ДатаРожденияДержателяКарты) Тогда
		Запрос.Текст = Запрос.Текст + "
		| И ((РаспоряжениеОПеречисленииНаКартыМирСостав.ДатаРожденияДержателяКарты = &ДатаРожденияДержателяКарты) 
		|ИЛИ (РаспоряжениеОПеречисленииНаКартыМирСостав.Контрагент.ЮридическоеФизическоеЛицо.ДатаРождения = &ДатаРожденияДержателяКарты))  
		|";
	КонецЕсли;	
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции	

Процедура ЗагрузитьИзФайлаXML_EB(ТекстФайла, Формат, Задание, ИмяФайла, ДанныеНовыхКонтрагентов, ОписаниеОбъектаОшибки)
	
	Перем СостояниеПлатежноРасчетныхДокументов;
	
	СостояниеПлатежноРасчетныхДокументов = Новый Структура;
	
	ПравилаЗагрузки                      = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(Формат);
	
	СоответствиеКолонок                                   = Новый Соответствие;
	ДеревоСтруктуры                                       = Новый ДеревоЗначений;
	
	ДеревоСтруктуры.Колонки.Добавить("ИмяПоля",				Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПолноеИмяПоля",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ИмяПоляТаблицы",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПорядокЗаполнения", 	Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПолеОбъекта",			Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ТабличнаяЧасть",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ДопДействия",			Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("Условие",				Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("КонечныйЭлемент", 	Новый ОписаниеТипов("Булево"));
	ДеревоСтруктуры.Колонки.Добавить("Группировка",			Новый ОписаниеТипов("Строка"));
	
	Для каждого ТекПравило Из ПравилаЗагрузки Цикл
		// если поле объекта не задано, то мы не учитываем узел
		Если ЗначениеЗаполнено(ТекПравило.ПолеОбъекта) Тогда
			
			КоллекцияСтрокДерева = ДеревоСтруктуры.Строки;
			ЧастиИмени           = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекПравило.ПолеФайлаПередачи, "/");
			МаксИндекс           = ЧастиИмени.ВГраница();
			
			Для Индекс           = 0 По МаксИндекс Цикл
				ЧастьИмени       = ЧастиИмени[Индекс];
				
				Если ПустаяСтрока(ЧастьИмени) Тогда
					Продолжить;
				КонецЕсли;
				
				ТекСтрокаДерева                     = КоллекцияСтрокДерева.Найти(ЧастьИмени, "ИмяПоля");
				
				Если ТекСтрокаДерева = Неопределено Тогда
					
					ТекСтрокаДерева                 = КоллекцияСтрокДерева.Добавить();
					ТекСтрокаДерева.ИмяПоля         = ЧастьИмени;
					
					Если ЗначениеЗаполнено(ТекПравило.ТабличнаяЧасть) Тогда
						ТекСтрокаДерева.Группировка = ТекПравило.ТабличнаяЧасть;
					ИначеЕсли ЗначениеЗаполнено(ТекПравило.ПолеОбъекта) И Найти(ТекПравило.ПолеОбъекта, ".") = 0 Тогда
						ТекСтрокаДерева.Группировка = "Объект";
					КонецЕсли;
					
					Если Индекс = МаксИндекс Тогда
						
						ТекСтрокаДерева.ПолноеИмяПоля 		= ТекПравило.ПолеФайлаПередачи;
						ТекСтрокаДерева.ПолеОбъекта 		= ТекПравило.ПолеОбъекта;
						ТекСтрокаДерева.ПорядокЗаполнения	= ТекПравило.ПорядокЗаполнения;
						ТекСтрокаДерева.ТабличнаяЧасть 		= ТекПравило.ТабличнаяЧасть;
						ТекСтрокаДерева.ДопДействия 		= ТекПравило.ДопДействия;
						ТекСтрокаДерева.Условие		 		= ТекПравило.Условие;
						ТекСтрокаДерева.КонечныйЭлемент		= Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
				КоллекцияСтрокДерева = ТекСтрокаДерева.Строки;
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбозначитьЛистьяДерева(ДеревоСтруктуры);
	ОбозначитьГруппировкиВДереве(ДеревоСтруктуры);
		
	// для каждого поля зададим имя поля таблицы и сразу создадим структуру таблицы
	ТаблицаДанных                = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("КонечныйЭлемент");
	СчетчикКолонок               = 1;
	ЗаполнитьИменаПолейДереваСтруктуры(ДеревоСтруктуры, ТаблицаДанных, СчетчикКолонок);
	
	ЧтениеXML 			         = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстФайла);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM    = ПостроительDOM.Прочитать(ЧтениеXML);

	ПутьПравилаОбработки         = "";
	ЧтениеXML.УстановитьСтроку(ТекстФайла);
	
	СоответствиеИндексов          = Новый Соответствие;
	
	Пока ЧтениеXML.Прочитать() Цикл
		// Обработка узла XML           	
		Если ЧтениеXML.ТипУзла   = ТипУзлаXML.НачалоЭлемента Тогда
			
			ИмяПоля              = ЧтениеXML.ЛокальноеИмя;	
			ИмяПоляDOM           = ЧтениеXML.ЛокальноеИмя;
			ПутьПравилаОбработки = ПутьПравилаОбработки + "/" + ИмяПоля;
			
			ТекСтрока            = ДеревоСтруктуры.Строки.Найти(ПутьПравилаОбработки, "ПолноеИмяПоля",Истина);
			Если ТекСтрока <> Неопределено Тогда
				
				Если (ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[0].ДочерниеУзлы.Количество()> 0) И 
					 (ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[0].ДочерниеУзлы[0].ИмяУзла) <> "#text" Тогда
					СтрокаДанных                 = ТаблицаДанных.Добавить(); 
					СтрокаДанных.КонечныйЭлемент = Ложь;
				КонецЕсли;
				
				РодительскийУзел     = "";  
				
				Индекс                                  = ПолучитьИндекс(ИмяПоля, СоответствиеИндексов);
				Если ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля).Количество() > Индекс Тогда 
					
					РодительскийУзел = ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[Индекс];
					
					Для Каждого ДочернийУзел Из ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[Индекс].ДочерниеУзлы Цикл
						
						ОбрабатываемоеПравило = ТекСтрока.Строки.Найти(?(ЗначениеЗаполнено(ДочернийУзел.ЛокальноеИмя), ДочернийУзел.ЛокальноеИмя, ДочернийУзел.ИмяУзла) , "ИмяПоля"); 
												
						Если ОбрабатываемоеПравило <> Неопределено Тогда   
							
							 Если НЕ ЗначениеЗаполнено(ОбрабатываемоеПравило.ИмяПоляТаблицы) Тогда 
								Продолжить;
							 КонецЕсли;
							 
							 СтрокаДанных.КонечныйЭлемент = ОбрабатываемоеПравило.КонечныйЭлемент;
							 СтрокаДанных[ОбрабатываемоеПравило.ИмяПоляТаблицы] = ДочернийУзел.ТекстовоеСодержимое;
							 
						КонецЕсли;
						
					КонецЦикла;	
						
				КонецЕсли;	
				
			КонецЕсли;
			
		ИначеЕсли ЧтениеXML.ТипУзла  = ТипУзлаXML.КонецЭлемента Тогда 			
			ПутьПравилаОбработки     = Лев(ПутьПравилаОбработки, СтрДлина(ПутьПравилаОбработки) - (СтрДлина(ЧтениеXML.Имя)+1));
		КонецЕсли;
		
	КонецЦикла;	
			
	МассивИменСтрок                  = Новый Массив;
	МассивИменСтрок.Добавить("exchangePacket/formularCollection/formular/GUID_Ord");
	
	МассивИменПолейТД                = Новый Массив;
	
	Для Каждого ЭлМас Из МассивИменСтрок Цикл
		ТекСтрока                    = ДеревоСтруктуры.Строки.Найти(ЭлМас, "ПолноеИмяПоля",Истина);
		Если ТекСтрока <> Неопределено Тогда
			МассивИменПолейТД.Добавить(ТекСтрока.ИмяПоляТаблицы);	
		КонецЕсли;
	КонецЦикла;   
	
	Если ДокументDOM.ПолучитьЭлементыПоИмени("Inf_Signs").Количество() > 0 Тогда  
	//в файле есть секция с подписями ответственного исполнителя, то информацию о нем нужно сдвинуть в шапку документа,
	//чтобы не множить количество строк результата запроса
	    		
		Если ТаблицаДанных.Количество()>1 Тогда
			
			ЕстьСтрокиСКомментариями = Ложь;    
			
			Для к = 0 По ТаблицаДанных.Количество()- 2 Цикл   
				Если ТаблицаДанных[к].КонечныйЭлемент Тогда
					 ЕстьСтрокиСКомментариями = Истина;
					 Продолжить;
				 КонецЕсли;
			КонецЦикла;	 
			
			Если ЕстьСтрокиСКомментариями Тогда
				ТаблицаДанных[ТаблицаДанных.Количество()-1].КонечныйЭлемент = Ложь;
				ТаблицаДанных.Сдвинуть(ТаблицаДанных.Количество()-1, (-1)*(ТаблицаДанных.Количество()-1));   
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	// заполним колонки конечных элементов значениями из вышестоящих неконечных элементов
	СвернутьТаблицуЗначений(ТаблицаДанных, МассивИменПолейТД);
	
	// создание схемы компоновки данных
	СхемаКомпоновкиРезультата         = Новый СхемаКомпоновкиДанных;
	ИсточникДанных                    = СхемаКомпоновкиРезультата.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя                = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных                       = СхемаКомпоновкиРезультата.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя 			      = "НаборДанных1";
	НаборДанных.ИмяОбъекта 		      = "ВходящиеДанные";
	НаборДанных.ИсточникДанных 	      = "ИсточникДанных1";
	
	РазрешенныеМодули                 = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("БИБЛИОТЕКАФУНКЦИЙОБМЕНА");
	СоответствиеГруппировок           = Новый Соответствие;
	СоздатьСтруктуруСхемыКомпоновкиИзДерева(ДеревоСтруктуры, СхемаКомпоновкиРезультата.НастройкиПоУмолчанию, СхемаКомпоновкиРезультата, НаборДанных, РазрешенныеМодули, СоответствиеГруппировок);	
	
	ВнешниеНаборы                     = Новый Структура("ВходящиеДанные", ТаблицаДанных);
	ФорматЗагрузки                    = Формат;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "КассовыйОрган";
	Параметр.Значение                 = Задание.КассовыйОрган;
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "Организация";
	Параметр.Значение                 = Задание.Организация;
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "ВалютаРеглУчета";
	Параметр.Значение                 = Константы.ВалютаРегламентированногоУчета.Получить();
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	НастройкиКомпоновки               = СхемаКомпоновкиРезультата.НастройкиПоУмолчанию;
	
	КомпоновщикМакета                 = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки                   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиРезультата, НастройкиКомпоновки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	ПроцессорКомпоновки               = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы,,Истина);
	ПроцессорВывода                   = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ДеревоЗначений);
	
	РезультатВыполнения               = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	СокращенноеДеревоСтруктуры        = Новый ДеревоЗначений;
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Группировка", Новый ОписаниеТипов("Строка"));
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Поля", Новый ОписаниеТипов("Массив"));
	
	СократитьДерево(ДеревоСтруктуры, СокращенноеДеревоСтруктуры, СоответствиеГруппировок); 
	
	ПараметрыВызоваФункции = Новый Структура;
	
	Для каждого СтрокаДокумента Из РезультатВыполнения.Строки[0].Строки Цикл
		
		СтрокаГруппировки             = СокращенноеДеревоСтруктуры.Строки[0].Строки[0];
		
		// выделяем объект для импорта
		СохраненныйДокумент           = БиблиотекаФункцийОбмена.НайтиДокументПоРеквизитуGUID(Формат.ИдентификаторОбъекта.Имя, СтрокаДокумента.ПроизвольныеПараметрыGUIDРаспоряжения);
		
		Если НЕ ЗначениеЗаполнено(СохраненныйДокумент) Тогда  
			
			СтрокаОписания = ОписаниеОбъектаОшибки.Добавить();
			СтрокаОписания.ПолеФайла = НСтр("ru='Не найдено Распоряжение о перечислении на карты МИР'"); 
			СтрокаОписания.Ошибка    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
			                                                        НСтр("ru='Отсутсвует документ для обработки с GUID: [GUID]'"),
																	Новый Структура("GUID", Строка(СтрокаДокумента.ПроизвольныеПараметрыGUIDРаспоряжения))
																	);
			ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), Задание.ФайлыОбмена.Найти(ИмяФайла, "ИмяФайлаЗагрузки").НомерСтроки);
			
			Возврат;
			
		Иначе
			ДокументОбъект            = СохраненныйДокумент.ПолучитьОбъект();
			//Если БиблиотекаФункцийОбмена.ПолучитьСтатусДокумента(ДокументОбъект.Ссылка) <> Перечисления.СтатусыИсполненияДокумента.ВРаботе Тогда
			//	ВызватьИсключение НСтр("ru='Документ с таким же номером был обработан ранее (его статус отличен от статуса <<в работе>>) '") + СохраненныйДокумент;
			//КонецЕсли;	
			Попытка
				ЗаблокироватьДанныеДляРедактирования(ДокументОбъект.Ссылка);
			Исключение
				ВызватьИсключение НСтр("ru='Невозможно заблокировать для редактирования документ '") + СохраненныйДокумент;
			КонецПопытки;
			
		КонецЕсли;
		
		
		
		// запись реквизитов шапки документа
		СтрокаРеквизитов              = "";
		СтрокаРеквизитовПП            = "";
		СтрокаРеквизитовСР            = ""; 
				
		ПроизвольныеПараметры         = Новый Структура;
				
		Для каждого ТекПоле Из СтрокаГруппировки.Поля Цикл
			Если Найти(ВРЕГ(ТекПоле), "СОСТОЯНИЕПЛАТЕЖНОРАСЧЕТНЫХДОКУМЕНТОВ") <> 0 Тогда
				СтрокаРеквизитовСР  = СтрокаРеквизитовСР + "," + ТекПоле;			
			ИначеЕсли Найти(ВРЕГ(ТекПоле), "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ") <> 0 Тогда
				СтрокаРеквизитовПП  = СтрокаРеквизитовПП + "," + ТекПоле;				
			ИначеЕсли Найти(ВРЕГ(ТекПоле), "ФАЙЛА") = 0 Тогда  
				//не относится к сообщениям об ошибках с данными из файла
				СтрокаРеквизитов    = СтрокаРеквизитов   + "," + ТекПоле;
			КонецЕсли;
		КонецЦикла;
		
		СтрокаРеквизитов            = Сред(СтрокаРеквизитов,   2);
		СтрокаРеквизитовПП          = Сред(СтрокаРеквизитовПП, 2);
		СтрокаРеквизитовСР          = Сред(СтрокаРеквизитовСР, 2);  
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДокумента, СтрокаРеквизитов);   
		//по умолчанию Извещение согласует выплату во всех строках Распоряжения
		Для каждого СтрокаСостав Из ДокументОбъект.Состав Цикл
			
			СтрокаСостав.Выплачено      = Истина;
			СтрокаСостав.Ошибка         = 1;
			СтрокаСостав.ОписаниеОшибки = "";
			
		КонецЦикла;    
		
			//------------------------------------
		Если ЗначениеЗаполнено(СтрокаРеквизитовСР) Тогда
			
			Запись                              = РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.СоздатьМенеджерЗаписи();
			Запись.ПлатежноРасчетныйДокумент 	= ДокументОбъект.Ссылка;
			
			РеквизитыСР                         = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаРеквизитовСР, ",");
			
			Для каждого РеквизитСР Из РеквизитыСР Цикл			
				Запись[Сред(РеквизитСР, 38)]    = СтрокаДокумента[СтрЗаменить(РеквизитСР, ".", "")];
			КонецЦикла;
				
			Запись.Записать();
			
		КонецЕсли;
        //------------------------------------
		
		// обработка реквизитов табличных частей
		Для каждого ВложеннаяГруппировка Из СтрокаГруппировки.Строки Цикл
			
			СтрокаРеквизитов          = "";
			СтрокаРеквизитовПП        = "";   // ревизиты произвольных параметров
			СтрокаРеквизитовСР        = "";   // реквизиты состояния РП документов
			
			Для каждого ТекПоле Из ВложеннаяГруппировка.Поля Цикл
				
				Если (Найти(ВРЕГ(ТекПоле), "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ") = 0) И (Найти(ВРЕГ(ТекПоле), "СОСТОЯНИЕПЛАТЕЖНОРАСЧЕТНЫХДОКУМЕНТОВ") = 0) Тогда
				
					Если Лев(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 1) = ВложеннаяГруппировка.Группировка + "." Тогда
						СтрокаРеквизитов  = СтрокаРеквизитов + "," +Сред(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 2);	
					Иначе
						СтрокаРеквизитов  = СтрокаРеквизитов + "," +ТекПоле;
					КонецЕсли;
					
				ИначеЕсли  Найти(ВРЕГ(ТекПоле), "СОСТОЯНИЕПЛАТЕЖНОРАСЧЕТНЫХДОКУМЕНТОВ") = 0 Тогда
					
					СтрокаРеквизитовПП  = СтрокаРеквизитовПП + "," +ТекПоле;
					
				Иначе
					
					СтрокаРеквизитовСР  = СтрокаРеквизитовСР + "," +ТекПоле;
				
				КонецЕсли;
				
			КонецЦикла;	
							
			// в СтрокаРеквизитов только имена табличной части
			
			Для каждого ВложеннаяСтрока Из СтрокаДокумента.Строки Цикл
				
								
				Если ВложеннаяГруппировка.Группировка  =  "Состав" Тогда
					
												
					ЕстьЗаполненные       = Ложь;
					СтруктураПроверки     = Новый Структура(СтрокаРеквизитов);  
										
					Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
						
						СтруктураПроверки[ЗначениеПроверки.Ключ]          = ВложеннаяСтрока[ВложеннаяГруппировка.Группировка + ЗначениеПроверки.Ключ];	
						ЕстьЗаполненные                                   = Макс(ЕстьЗаполненные, ЗначениеЗаполнено(СтруктураПроверки[ЗначениеПроверки.Ключ]));
											 
					КонецЦикла;
					
					
					Если ЕстьЗаполненные Тогда
						
						 НомераСтрокРаспоряжения = НайтиСтрокиРаспоряженияНаКартыМИР(ДокументОбъект.Ссылка, ВложеннаяСтрока.СоставНомерПлатежнойКарты, ВложеннаяСтрока.СоставДатаРожденияДержателяКарты, ВложеннаяСтрока.СоставВидВыплатНаКартуМИР);
						 
						 Для Каждого НомерСтроки Из НомераСтрокРаспоряжения Цикл
							 ДокументОбъект.Состав[НомерСтроки.НомерСтроки - 1].Выплачено = Ложь; 
						 КонецЦикла;	 
									           						
						Если НомераСтрокРаспоряжения.Количество() > 0 Тогда 
							
							Для каждого ВложеннаяГруппировка_2 Из ВложеннаяГруппировка.Строки Цикл
					
								Если ВложеннаяГруппировка_2.Группировка = "Ошибки" Тогда												
									
									Для каждого НомерСтроки Из НомераСтрокРаспоряжения  Цикл 
										
										ТаблицаОшибок = Новый ТаблицаЗначений;   
										ТаблицаОшибок.Колонки.Добавить("Код",      Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(4)));  
										ТаблицаОшибок.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
										
										Для каждого ВложеннаяСтрока_2 Из ВложеннаяСтрока.Строки Цикл
											
											СтрокаОшибка          = ТаблицаОшибок.Добавить();
											СтрокаОшибка.Код      = ВложеннаяСтрока_2.ОшибкиКодОшибки;
											СтрокаОшибка.Описание = ВложеннаяСтрока_2.ОшибкиТекстОшибки;
																						
										КонецЦикла;	    
										
										ДокументОбъект.Состав[НомерСтроки.НомерСтроки - 1].ОписаниеОшибки = ЗначениеВСтрокуВнутр(ТаблицаОшибок);
										Если ТаблицаОшибок.Количество()>0 Тогда
											ДокументОбъект.Состав[НомерСтроки.НомерСтроки - 1].Ошибка = 0;
										КонецЕсли;
										
									КонецЦикла;
								КонецЕсли;	
									
							КонецЦикла;
							
						КонецЕсли;   
						
					КонецЕсли;
									
				КонецЕсли;	
								
			КонецЦикла; 
				
		КонецЦикла; 
		
				
		Если  ДокументОбъект.Модифицированность() Тогда					
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);	
		КонецЕсли;			
		
		Если Задание.ОбъектыОбмена.Найти(ДокументОбъект.Ссылка) = Неопределено Тогда   
			
			НовСтрокаЗадания                    = Задание.ОбъектыОбмена.Добавить();
			НовСтрокаЗадания.ИмяФайлаЗагрузки	= ИмяФайла;
			НовСтрокаЗадания.Формат				= Формат;
			НовСтрокаЗадания.Объект				= ДокументОбъект.Ссылка;     
			
		КонецЕсли;
		//-------------------------------------
		
    КонецЦикла;
		
КонецПроцедуры

Процедура ЗагрузитьИзФайлаXML_RPP(ТекстФайла, Формат, Задание, ИмяФайла, ДанныеНовыхКонтрагентов, ОписаниеОбъектаОшибки)
	
	Перем СостояниеПлатежноРасчетныхДокументов;
	
	СостояниеПлатежноРасчетныхДокументов = Новый Структура;
	
	ПравилаЗагрузки                      = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(Формат);
	
	СоответствиеКолонок                                   = Новый Соответствие;
	ДеревоСтруктуры                                       = Новый ДеревоЗначений;
	
	ДеревоСтруктуры.Колонки.Добавить("ИмяПоля",				Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПолноеИмяПоля",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ИмяПоляТаблицы",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПорядокЗаполнения", 	Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПолеОбъекта",			Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ТабличнаяЧасть",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ДопДействия",			Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("Условие",				Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("КонечныйЭлемент", 	Новый ОписаниеТипов("Булево"));
	ДеревоСтруктуры.Колонки.Добавить("Группировка",			Новый ОписаниеТипов("Строка"));
	
	Для каждого ТекПравило Из ПравилаЗагрузки Цикл
		// если поле объекта не задано, то мы не учитываем узел
		Если ЗначениеЗаполнено(ТекПравило.ПолеОбъекта) Тогда
			
			КоллекцияСтрокДерева = ДеревоСтруктуры.Строки;
			ЧастиИмени           = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекПравило.ПолеФайлаПередачи, "/");
			МаксИндекс           = ЧастиИмени.ВГраница();
			
			Для Индекс           = 0 По МаксИндекс Цикл
				ЧастьИмени       = ЧастиИмени[Индекс];
				
				Если ПустаяСтрока(ЧастьИмени) Тогда
					Продолжить;
				КонецЕсли;
				
				ТекСтрокаДерева                     = КоллекцияСтрокДерева.Найти(ЧастьИмени, "ИмяПоля");
				
				Если ТекСтрокаДерева = Неопределено Тогда
					
					ТекСтрокаДерева                 = КоллекцияСтрокДерева.Добавить();
					ТекСтрокаДерева.ИмяПоля         = ЧастьИмени;
					
					Если ЗначениеЗаполнено(ТекПравило.ТабличнаяЧасть) Тогда
						ТекСтрокаДерева.Группировка = ТекПравило.ТабличнаяЧасть;
					ИначеЕсли ЗначениеЗаполнено(ТекПравило.ПолеОбъекта) И Найти(ТекПравило.ПолеОбъекта, ".") = 0 Тогда
						ТекСтрокаДерева.Группировка = "Объект";
					КонецЕсли;
					
					Если Индекс = МаксИндекс Тогда
						
						ТекСтрокаДерева.ПолноеИмяПоля 		= ТекПравило.ПолеФайлаПередачи;
						ТекСтрокаДерева.ПолеОбъекта 		= ТекПравило.ПолеОбъекта;
						ТекСтрокаДерева.ПорядокЗаполнения	= ТекПравило.ПорядокЗаполнения;
						ТекСтрокаДерева.ТабличнаяЧасть 		= ТекПравило.ТабличнаяЧасть;
						ТекСтрокаДерева.ДопДействия 		= ТекПравило.ДопДействия;
						ТекСтрокаДерева.Условие		 		= ТекПравило.Условие;
						ТекСтрокаДерева.КонечныйЭлемент		= Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
				КоллекцияСтрокДерева = ТекСтрокаДерева.Строки;
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбозначитьЛистьяДерева(ДеревоСтруктуры);
	ОбозначитьГруппировкиВДереве(ДеревоСтруктуры);
		
	// для каждого поля зададим имя поля таблицы и сразу создадим структуру таблицы
	ТаблицаДанных                = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("КонечныйЭлемент");
	СчетчикКолонок               = 1;
	ЗаполнитьИменаПолейДереваСтруктуры(ДеревоСтруктуры, ТаблицаДанных, СчетчикКолонок);
	
	ЧтениеXML 			         = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстФайла);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM    = ПостроительDOM.Прочитать(ЧтениеXML);

	ПутьПравилаОбработки         = "";
	ЧтениеXML.УстановитьСтроку(ТекстФайла);
	
	СоответствиеИндексов          = Новый Соответствие;
	
	Пока ЧтениеXML.Прочитать() Цикл
		// Обработка узла XML           	
		Если ЧтениеXML.ТипУзла   = ТипУзлаXML.НачалоЭлемента Тогда
			
			ИмяПоля              = ЧтениеXML.Имя;		
			ПутьПравилаОбработки = ПутьПравилаОбработки + "/" + ИмяПоля;
			
			ТекСтрока            = ДеревоСтруктуры.Строки.Найти(ПутьПравилаОбработки, "ПолноеИмяПоля",Истина);
			Если ТекСтрока <> Неопределено Тогда
				
				//Индекс = ПолучитьИндекс(ИмяПоля, СоответствиеИндексов);
				
				Если (ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[0].ДочерниеУзлы.Количество()> 0) И 
					 (ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[0].ДочерниеУзлы[0].ИмяУзла) <> "#text" Тогда
					СтрокаДанных     = ТаблицаДанных.Добавить();
				КонецЕсли;
				
				Для каждого ПоляСтроки Из ТекСтрока.Строки Цикл
					
					СтрокаДанных.КонечныйЭлемент = ПоляСтроки.КонечныйЭлемент;
					
					Если ПоляСтроки.Строки.Количество() = 0 Тогда					
						Если Лев(ПоляСтроки.ИмяПоля, 1) = "@" Тогда
							// добавитьСтроку
							СтрокаДанных[ПоляСтроки.ИмяПоляТаблицы] = ЧтениеXML.ПолучитьАтрибут(Сред(ПоляСтроки.ИмяПоля, 2));
						Иначе
							Индекс                                  = ПолучитьИндекс(ПоляСтроки.ИмяПоля, СоответствиеИндексов);
							Если ДокументDOM.ПолучитьЭлементыПоИмени(ПоляСтроки.ИмяПоля).Количество() > Индекс Тогда
								СтрокаДанных[ПоляСтроки.ИмяПоляТаблицы] = ДокументDOM.ПолучитьЭлементыПоИмени(ПоляСтроки.ИмяПоля)[Индекс].ТекстовоеСодержимое;
							Иначе
								СтрокаДанных[ПоляСтроки.ИмяПоляТаблицы] = "";
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла; 
			КонецЕсли;
			
		ИначеЕсли ЧтениеXML.ТипУзла  = ТипУзлаXML.КонецЭлемента Тогда 			
			ПутьПравилаОбработки     = Лев(ПутьПравилаОбработки, СтрДлина(ПутьПравилаОбработки) - (СтрДлина(ЧтениеXML.Имя)+1));
		КонецЕсли;
		
	КонецЦикла;
			
	МассивИменСтрок                  = Новый Массив;
	МассивИменСтрок.Добавить("/ProcessRegPayOrder/DataArea/Header/Report/GUID_FK");
	
	МассивИменПолейТД                = Новый Массив;
	
	Для Каждого ЭлМас Из МассивИменСтрок Цикл
		ТекСтрока                    = ДеревоСтруктуры.Строки.Найти(ЭлМас, "ПолноеИмяПоля",Истина);
		Если ТекСтрока <> Неопределено Тогда
			МассивИменПолейТД.Добавить(ТекСтрока.ИмяПоляТаблицы);	
		КонецЕсли;
	КонецЦикла;
	
	// заполним колонки конечных элементов значениями из вышестоящих неконечных элементов
	СвернутьТаблицуЗначений(ТаблицаДанных, МассивИменПолейТД);
	
	// создание схемы компоновки данных
	СхемаКомпоновкиРезультата         = Новый СхемаКомпоновкиДанных;
	ИсточникДанных                    = СхемаКомпоновкиРезультата.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя                = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных                       = СхемаКомпоновкиРезультата.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя 			      = "НаборДанных1";
	НаборДанных.ИмяОбъекта 		      = "ВходящиеДанные";
	НаборДанных.ИсточникДанных 	      = "ИсточникДанных1";
	
	РазрешенныеМодули                 = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("БИБЛИОТЕКАФУНКЦИЙОБМЕНА");
	СоответствиеГруппировок           = Новый Соответствие;
	СоздатьСтруктуруСхемыКомпоновкиИзДерева(ДеревоСтруктуры, СхемаКомпоновкиРезультата.НастройкиПоУмолчанию, СхемаКомпоновкиРезультата, НаборДанных, РазрешенныеМодули, СоответствиеГруппировок);	
	
	ВнешниеНаборы                     = Новый Структура("ВходящиеДанные", ТаблицаДанных);
	ФорматЗагрузки                    = Формат;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "КассовыйОрган";
	Параметр.Значение                 = Задание.КассовыйОрган;
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "Организация";
	Параметр.Значение                 = Задание.Организация;
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "ВалютаРеглУчета";
	Параметр.Значение                 = Константы.ВалютаРегламентированногоУчета.Получить();
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	НастройкиКомпоновки               = СхемаКомпоновкиРезультата.НастройкиПоУмолчанию;
	
	КомпоновщикМакета                 = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки                   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиРезультата, НастройкиКомпоновки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	ПроцессорКомпоновки               = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы,,Истина);
	ПроцессорВывода                   = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ДеревоЗначений);
	
	РезультатВыполнения               = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	СокращенноеДеревоСтруктуры        = Новый ДеревоЗначений;
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Группировка", Новый ОписаниеТипов("Строка"));
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Поля", Новый ОписаниеТипов("Массив"));
	
	СократитьДерево(ДеревоСтруктуры, СокращенноеДеревоСтруктуры, СоответствиеГруппировок); 
	
	ПараметрыВызоваФункции = Новый Структура;
	
	Для каждого СтрокаДокумента Из РезультатВыполнения.Строки[0].Строки Цикл
		
		СтрокаГруппировки             = СокращенноеДеревоСтруктуры.Строки[0];
		
		// выделяем объект для импорта
		СохраненныйДокумент           = БиблиотекаФункцийОбмена.НайтиДокументПоGUID(Формат.ИдентификаторОбъекта.Имя, СтрокаДокумента.СостояниеПлатежноРасчетныхДокументовGUIDКО);
		
		Если НЕ ЗначениеЗаполнено(СохраненныйДокумент) Тогда  
			
			СтрокаОписания = ОписаниеОбъектаОшибки.Добавить();
			СтрокаОписания.ПолеФайла = НСтр("ru='Не найден документ для расшифровки'"); 
			СтрокаОписания.Ошибка    = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
			                                                        НСтр("ru='Отсутсвует документ для обработки с GUID: [GUID]'"),
																	Новый Структура("GUID", Строка(СтрокаДокумента.СостояниеПлатежноРасчетныхДокументовGUIDКО))
																	);
			ВставитьОшибкуВДокумент(Задание, ЗначениеВСтрокуВнутр(ОписаниеОбъектаОшибки), Задание.ФайлыОбмена.Найти(ИмяФайла, "ИмяФайлаЗагрузки").НомерСтроки);
			
			Возврат;
			
		Иначе
			ДокументОбъект            = СохраненныйДокумент.ПолучитьОбъект();
			//Если БиблиотекаФункцийОбмена.ПолучитьСтатусДокумента(ДокументОбъект.Ссылка) <> Перечисления.СтатусыИсполненияДокумента.ВРаботе Тогда
			//	ВызватьИсключение НСтр("ru='Документ с таким же номером был обработан ранее (его статус отличен от статуса <<в работе>>) '") + СохраненныйДокумент;
			//КонецЕсли;	
			Попытка
				ЗаблокироватьДанныеДляРедактирования(ДокументОбъект.Ссылка);
			Исключение
				ВызватьИсключение НСтр("ru='Невозможно заблокировать для редактирования документ '") + СохраненныйДокумент;
			КонецПопытки;
			
			Если ДокументОбъект.РасшифровкаПлатежа.Количество() > 0 Тогда
				
				 КБКНазначениеПлатежа   =  ДокументОбъект.РасшифровкаПлатежа[0].КБКНазначениеПлатежа;
				 КОСГУНазначениеПлатежа =  ДокументОбъект.РасшифровкаПлатежа[0].КОСГУНазначениеПлатежа;
				 ИсточникСредств        =  ДокументОбъект.РасшифровкаПлатежа[0].ИсточникСредств; 
				 
			КонецЕсли;
			
			ДокументОбъект.РасшифровкаПлатежа.Очистить();
		КонецЕсли;
		
		// запись реквизитов шапки документа
		СтрокаРеквизитов              = "";
		
		Для каждого ТекПоле Из СтрокаГруппировки.Поля Цикл
			Если (Найти(ВРЕГ(ТекПоле), "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ") = 0) И (Найти(ВРЕГ(ТекПоле), "СОСТОЯНИЕПЛАТЕЖНОРАСЧЕТНЫХДОКУМЕНТОВ") = 0) Тогда
				СтрокаРеквизитов          = СтрокаРеквизитов + "," +ТекПоле;
			КонецЕсли;
		КонецЦикла;
		
		СтрокаРеквизитов              = Сред(СтрокаРеквизитов, 2);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаДокумента, СтрокаРеквизитов);
		ЗаполнитьЗначенияСвойств(ДокументОбъект, Задание, "Организация");
		
		
		// обработка реквизитов табличных частей
		Для каждого ВложеннаяГруппировка Из СтрокаГруппировки.Строки[0].Строки Цикл
			
			СтрокаРеквизитов          = "";
			СтрокаРеквизитовПП        = "";   // ревизиты произвольных параметров
			СтрокаРеквизитовСР        = "";   // реквизиты состояния РП документов
			
			Для каждого ТекПоле Из ВложеннаяГруппировка.Поля Цикл
				
				Если (Найти(ВРЕГ(ТекПоле), "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ") = 0) И (Найти(ВРЕГ(ТекПоле), "СОСТОЯНИЕПЛАТЕЖНОРАСЧЕТНЫХДОКУМЕНТОВ") = 0) Тогда
				
					Если Лев(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 1) = ВложеннаяГруппировка.Группировка + "." Тогда
						СтрокаРеквизитов  = СтрокаРеквизитов + "," +Сред(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 2);	
					Иначе
						СтрокаРеквизитов  = СтрокаРеквизитов + "," +ТекПоле;
					КонецЕсли;
					
				ИначеЕсли  Найти(ВРЕГ(ТекПоле), "СОСТОЯНИЕПЛАТЕЖНОРАСЧЕТНЫХДОКУМЕНТОВ") = 0 Тогда
					
					СтрокаРеквизитовПП  = СтрокаРеквизитовПП + "," +ТекПоле;
					
				Иначе
					
					СтрокаРеквизитовСР  = СтрокаРеквизитовСР + "," +ТекПоле;
				
				КонецЕсли;
				
			КонецЦикла;	
							
			// в СтрокаРеквизитов только имена табличной части
			
			Для каждого ВложеннаяСтрока Из СтрокаДокумента.Строки Цикл
				
								
				Если ВложеннаяГруппировка.Группировка  =  "РасшифровкаПлатежа" Тогда
					
												
					ЕстьЗаполненные       = Ложь;
					СтруктураПроверки     = Новый Структура(СтрокаРеквизитов);
					
					Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
						СтруктураПроверки[ЗначениеПроверки.Ключ]          = ВложеннаяСтрока[ВложеннаяГруппировка.Группировка+ЗначениеПроверки.Ключ];	
						ЕстьЗаполненные                                   = Макс(ЕстьЗаполненные, ЗначениеЗаполнено(СтруктураПроверки[ЗначениеПроверки.Ключ]));
					КонецЦикла;
					
					
					Если ЕстьЗаполненные Тогда
						
						ЗаполнитьЗначенияСвойств(ДокументОбъект[ВложеннаяГруппировка.Группировка].Добавить(), СтруктураПроверки);
						
						ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].КБКНазначениеПлатежа   = КБКНазначениеПлатежа;
						ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].КОСГУНазначениеПлатежа = КОСГУНазначениеПлатежа;
						ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].ИсточникСредств        = ИсточникСредств;
						ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].Сумма                  = ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].СуммаВал;
						
						ПараметрыВызоваФункции.Вставить("ИННПлательщика",           "");
						ПараметрыВызоваФункции.Вставить("КПППлательщика",           "");
						ПараметрыВызоваФункции.Вставить("ФИОПлательщика",           "");
						ПараметрыВызоваФункции.Вставить("НаименованиеПлательщика",  "");
						
						СтруктураПроверки                             = Новый Структура(СтрЗаменить(СтрокаРеквизитовПП, ".", ""));
						
						ЗаполнитьЗначенияСвойств(СтруктураПроверки, ВложеннаяСтрока);
						
						Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
							Если ВРЕГ(Лев(ЗначениеПроверки.Ключ, 39)) = "РАСШИФРОВКАПЛАТЕЖАПРОИЗВОЛЬНЫЕПАРАМЕТРЫ" Тогда
								ПараметрыВызоваФункции.Вставить(Сред(ЗначениеПроверки.Ключ, 40), ЗначениеПроверки.Значение);
							КонецЕсли;
						КонецЦикла; 
						
						Если НЕ ЗначениеЗаполнено(ПараметрыВызоваФункции.ФИОПлательщика) И СтрНайти(ПараметрыВызоваФункции.НаименованиеПлательщика, "//") > 0 Тогда
						// признаки оформления наименования для физлица при отсутствии другой информации из банка
						
						Массив                           = Новый Массив;
						Массив.Добавить("СокращатьНаименованиеПлательщика");
						ДанныеПараметров                 = Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПолучитьПараметрыНастройкиОбмена(Массив, Задание.НастройкаОбмена);
						СокращатьНаименованиеПлательщика = ДанныеПараметров.Получить("СокращатьНаименованиеПлательщика");
						СокращатьНаименованиеПлательщика = ?(СокращатьНаименованиеПлательщика = Неопределено, Ложь, СокращатьНаименованиеПлательщика);
						
							Если СокращатьНаименованиеПлательщика Тогда
								ПредполагаемоеФИО = СокрЛП(Сред(ПараметрыВызоваФункции.НаименованиеПлательщика, СтрНайти(ПараметрыВызоваФункции.НаименованиеПлательщика, "//") + 2));
								Если СтрНайти(ПредполагаемоеФИО, "//") > 0 Тогда
									ПредполагаемоеФИО = СокрЛП(Лев(ПредполагаемоеФИО, СтрНайти(ПредполагаемоеФИО, "//") - 1));  
								КонецЕсли;
								
								ПараметрыВызоваФункции.ФИОПлательщика = ТРег(ПредполагаемоеФИО);
							КонецЕсли;
						
						КонецЕсли;

						ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].Контрагент = 
						               БиблиотекаФункцийОбмена.ОпределитьКонтрагента(ПараметрыВызоваФункции.ИННПлательщика, 
									   ПараметрыВызоваФункции.КПППлательщика, ПараметрыВызоваФункции.НаименованиеПлательщика,
									   ПараметрыВызоваФункции.ФИОПлательщика,, ВидОбмена, ДанныеНовыхКонтрагентов);
									   
					    Если НЕ ЗначениеЗаполнено(ДокументОбъект.РасшифровкаПлатежа[ДокументОбъект.РасшифровкаПлатежа.Количество() - 1].Контрагент) И ТипЗнч(ДанныеНовыхКонтрагентов) = Тип("ТаблицаЗначений") Тогда
							
							Если ДанныеНовыхКонтрагентов.Количество() > 0 И НЕ ЗначениеЗаполнено(ДанныеНовыхКонтрагентов[ДанныеНовыхКонтрагентов.Количество() - 1].ДокументСсылка) Тогда
								
								 ДанныеНовыхКонтрагентов[ДанныеНовыхКонтрагентов.Количество()-1].ДокументСсылка     = ДокументОбъект.Ссылка;
								 ДанныеНовыхКонтрагентов[ДанныеНовыхКонтрагентов.Количество()-1].ИмяТабличнойЧасти  = "РасшифровкаПлатежа";
								 ДанныеНовыхКонтрагентов[ДанныеНовыхКонтрагентов.Количество()-1].НомерСтроки        = ДокументОбъект.РасшифровкаПлатежа.Количество() - 1;
								 ДанныеНовыхКонтрагентов[ДанныеНовыхКонтрагентов.Количество()-1].ИмяРеквизита       = "Контрагент";
								 
							КонецЕсли;
							 
						КонецЕсли;
			           						
					КонецЕсли;

                КонецЕсли;	
								
			КонецЦикла; 
				
		КонецЦикла; 
		
				
		Если  ДокументОбъект.Модифицированность() Тогда					
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);	
		КонецЕсли;			
		
		Если Задание.ОбъектыОбмена.Найти(ДокументОбъект.Ссылка) = Неопределено Тогда   
			
			НовСтрокаЗадания                    = Задание.ОбъектыОбмена.Добавить();
			НовСтрокаЗадания.ИмяФайлаЗагрузки	= ИмяФайла;
			НовСтрокаЗадания.Формат				= Формат;
			НовСтрокаЗадания.Объект				= ДокументОбъект.Ссылка;     
			
		КонецЕсли;
		//-------------------------------------
		
    КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗагрузитьИзФайлаXML2(ТекстФайла, Формат, Задание, ИмяФайла, ДанныеНовыхКонтрагентов)
	
		
	ПравилаЗагрузки = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(Формат);
	
	
	СоответствиеКолонок                                   = Новый Соответствие;
	ДеревоСтруктуры                                       = Новый ДеревоЗначений;
	
	ДеревоСтруктуры.Колонки.Добавить("ИмяПоля",				Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПолноеИмяПоля",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ИмяПоляТаблицы",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПорядокЗаполнения", 	Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ПолеОбъекта",			Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ТабличнаяЧасть",		Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("ДопДействия",			Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("Условие",				Новый ОписаниеТипов("Строка"));
	ДеревоСтруктуры.Колонки.Добавить("КонечныйЭлемент", 	Новый ОписаниеТипов("Булево"));
	ДеревоСтруктуры.Колонки.Добавить("Группировка",			Новый ОписаниеТипов("Строка"));
	
	Для каждого ТекПравило Из ПравилаЗагрузки Цикл
		// если поле объекта не задано, то мы не учитываем узел
		Если ЗначениеЗаполнено(ТекПравило.ПолеОбъекта) Тогда
			
			КоллекцияСтрокДерева = ДеревоСтруктуры.Строки;
			ЧастиИмени           = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекПравило.ПолеФайлаПередачи, "/");
			МаксИндекс           = ЧастиИмени.ВГраница();
			
			Для Индекс           = 0 По МаксИндекс Цикл
				ЧастьИмени       = ЧастиИмени[Индекс];
				
				Если ПустаяСтрока(ЧастьИмени) Тогда
					Продолжить;
				КонецЕсли;
				
				ТекСтрокаДерева                     = КоллекцияСтрокДерева.Найти(ЧастьИмени, "ИмяПоля");
				
				Если ТекСтрокаДерева = Неопределено Тогда
					
					ТекСтрокаДерева                 = КоллекцияСтрокДерева.Добавить();
					ТекСтрокаДерева.ИмяПоля         = ЧастьИмени;
					
					Если ЗначениеЗаполнено(ТекПравило.ТабличнаяЧасть) Тогда
						ТекСтрокаДерева.Группировка = ТекПравило.ТабличнаяЧасть;
					ИначеЕсли ЗначениеЗаполнено(ТекПравило.ПолеОбъекта) И Найти(ТекПравило.ПолеОбъекта, ".") = 0 Тогда
						ТекСтрокаДерева.Группировка = "Объект";
					КонецЕсли;
					
					Если Индекс = МаксИндекс Тогда
						
						ТекСтрокаДерева.ПолноеИмяПоля 		= ТекПравило.ПолеФайлаПередачи;
						ТекСтрокаДерева.ПолеОбъекта 		= ТекПравило.ПолеОбъекта;
						ТекСтрокаДерева.ПорядокЗаполнения	= ТекПравило.ПорядокЗаполнения;
						ТекСтрокаДерева.ТабличнаяЧасть 		= ТекПравило.ТабличнаяЧасть;
						ТекСтрокаДерева.ДопДействия 		= ТекПравило.ДопДействия;
						ТекСтрокаДерева.Условие		 		= ТекПравило.Условие;
						ТекСтрокаДерева.КонечныйЭлемент		= Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
				КоллекцияСтрокДерева = ТекСтрокаДерева.Строки;
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбозначитьЛистьяДерева(ДеревоСтруктуры);
	ОбозначитьГруппировкиВДереве(ДеревоСтруктуры);
	
	// получили дерево вида
	//		ИмяПоляТаблицы			ПолноеИмяПоля								КонечныйЭлемент		   								
	//	PacketESID					/PacketESID                                 Ложь
	//		ED211                   /PacketESID/ED211                           Ложь
	//			@EDNo				/PacketESID/ED211/@EDNo                     Ложь
	// 			@OutBal            	/PacketESID/ED211/@OutBal                   Ложь
	//      	TransInfo           /PacketESID/ED211/TransInfo                 Ложь
	//				@DC				/PacketESID/ED211/TransInfo/@DC	            Ложь
	//				@Sum			/PacketESID/ED211/TransInfo/@Sum            Ложь
	//				EDRefID         /PacketESID/ED211/TransInfo/EDRefID         Ложь
	//					@EDNo		/PacketESID/ED211/TransInfo/EDRefID/@EDNo	Истина	
	// некоторые узлы (PacketESID) используются в файле только для группировки и не содержат сами никаких данных.
	// для таких узлов добавим поле для группировки
	
	// для каждого поля зададим имя поля таблицы и сразу создадим структуру таблицы
	ТаблицаДанных                = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("КонечныйЭлемент");        
	
	СчетчикКолонок               = 1;
	ЗаполнитьИменаПолейДереваСтруктуры(ДеревоСтруктуры, ТаблицаДанных, СчетчикКолонок);
	
	ЧтениеXML 			         = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстФайла);

	ПутьПравилаОбработки         = "";    
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM    = ПостроительDOM.Прочитать(ЧтениеXML);

	ПутьПравилаОбработки         = "";
	ЧтениеXML.УстановитьСтроку(ТекстФайла);
	
	СоответствиеИндексов          = Новый Соответствие;
	
	Пока ЧтениеXML.Прочитать() Цикл
		// Обработка узла XML           	
		Если ЧтениеXML.ТипУзла   = ТипУзлаXML.НачалоЭлемента Тогда
			
			ИмяПоля              = ЧтениеXML.ЛокальноеИмя;		
			ПутьПравилаОбработки = ПутьПравилаОбработки + "/" + ИмяПоля;
			
			ТекСтрока            = ДеревоСтруктуры.Строки.Найти(ПутьПравилаОбработки, "ПолноеИмяПоля",Истина);
			Если ТекСтрока <> Неопределено Тогда
				
				//Индекс = ПолучитьИндекс(ИмяПоля, СоответствиеИндексов);
				
				Если (ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[0].ДочерниеУзлы.Количество()> 0) И 
					 (ДокументDOM.ПолучитьЭлементыПоИмени(ИмяПоля)[0].ДочерниеУзлы[0].ИмяУзла) <> "#text" Тогда
					СтрокаДанных     = ТаблицаДанных.Добавить();
				КонецЕсли;
				
				Для каждого ПоляСтроки Из ТекСтрока.Строки Цикл
					
					СтрокаДанных.КонечныйЭлемент = ПоляСтроки.КонечныйЭлемент;  
					
					Если ПоляСтроки.Строки.Количество() = 0 Тогда					
						Если Лев(ПоляСтроки.ИмяПоля, 1) = "@" Тогда
							// добавитьСтроку
							СтрокаДанных[ПоляСтроки.ИмяПоляТаблицы] = ЧтениеXML.ПолучитьАтрибут(Сред(ПоляСтроки.ИмяПоля, 2));
						Иначе
							Индекс                                  = ПолучитьИндекс(ПоляСтроки.ИмяПоля, СоответствиеИндексов);
							Если ДокументDOM.ПолучитьЭлементыПоИмени(ПоляСтроки.ИмяПоля).Количество() > Индекс Тогда
								СтрокаДанных[ПоляСтроки.ИмяПоляТаблицы] = ДокументDOM.ПолучитьЭлементыПоИмени(ПоляСтроки.ИмяПоля)[Индекс].ТекстовоеСодержимое;
							Иначе
								СтрокаДанных[ПоляСтроки.ИмяПоляТаблицы] = "";
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла; 
			КонецЕсли;
			
		ИначеЕсли ЧтениеXML.ТипУзла  = ТипУзлаXML.КонецЭлемента Тогда 			
			ПутьПравилаОбработки     = Лев(ПутьПравилаОбработки, СтрДлина(ПутьПравилаОбработки) - (СтрДлина(ЧтениеXML.ЛокальноеИмя)+1));
		КонецЕсли;
		
	КонецЦикла;
	
	//Пока ЧтениеXML.Прочитать() Цикл
	//	// Обработка узла XML           	
	//	Если ЧтениеXML.ТипУзла   = ТипУзлаXML.НачалоЭлемента Тогда
	//		ИмяПоля              = ЧтениеXML.ЛокальноеИмя;		
	//		ПутьПравилаОбработки = ПутьПравилаОбработки + "/" + ИмяПоля;
	//		
	//		ТекСтрока            = ДеревоСтруктуры.Строки.Найти(ПутьПравилаОбработки, "ПолноеИмяПоля",Истина);
	//		Если ТекСтрока <> Неопределено Тогда 
	//							
	//			СтрокаДанных     = ТаблицаДанных.Добавить();
	//			
	//			Для каждого ПоляСтроки Из ТекСтрока.Строки Цикл
	//				СтрокаДанных.КонечныйЭлемент        = ПоляСтроки.КонечныйЭлемент;
	//			//	Если ПоляСтроки.Строки.Количество() = 0 Тогда					
	//					Если Лев(ПоляСтроки.ИмяПоля, 1) = "@" Тогда
	//						// добавитьСтроку
	//						СтрокаДанных[ПоляСтроки.ИмяПоляТаблицы] = ЧтениеXML.ПолучитьАтрибут(Сред(ПоляСтроки.ИмяПоля, 2));
	//					КонецЕсли;
	//			//	КонецЕсли;
	//			КонецЦикла; 
	//		КонецЕсли;
	//	ИначеЕсли ЧтениеXML.ТипУзла  = ТипУзлаXML.КонецЭлемента Тогда 	
	//		ПутьПравилаОбработки     = Лев(ПутьПравилаОбработки, СтрДлина(ПутьПравилаОбработки) - (СтрДлина(ЧтениеXML.ЛокальноеИмя)+1));			
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	МассивИменСтрок                  = Новый Массив;
	МассивИменСтрок.Добавить("/PacketESID/ED211/@EDNo");
	МассивИменСтрок.Добавить("/ED211/@EDNo");
	
	МассивИменПолейТД                = Новый Массив;
	
	Для Каждого ЭлМас Из МассивИменСтрок Цикл
		ТекСтрока                    = ДеревоСтруктуры.Строки.Найти(ЭлМас, "ПолноеИмяПоля",Истина);
		Если ТекСтрока <> Неопределено Тогда
			МассивИменПолейТД.Добавить(ТекСтрока.ИмяПоляТаблицы);	
		КонецЕсли;
	КонецЦикла;	
	
	Если Формат.ИдентификаторОбъекта.Имя = "КассовоеПоступление" Тогда 
		Для к = 1 по ТаблицаДанных.Количество()-1 Цикл
			
			Если ТаблицаДанных[к].КонечныйЭлемент И ТаблицаДанных[к - 1].КонечныйЭлемент Тогда
				 ТаблицаДанных[к - 1].КонечныйЭлемент = Ложь;
			КонецЕсли;
			
		КонецЦикла; 
	КонецЕсли;
	
	// заполним колонки конечных элементов значениями из вышестоящих неконечных элементов
	СвернутьТаблицуЗначений(ТаблицаДанных, МассивИменПолейТД);
	
	// создание схемы компоновки данных
	СхемаКомпоновкиРезультата         = Новый СхемаКомпоновкиДанных;
	ИсточникДанных                    = СхемаКомпоновкиРезультата.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя                = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных                       = СхемаКомпоновкиРезультата.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя 			      = "НаборДанных1";
	НаборДанных.ИмяОбъекта 		      = "ВходящиеДанные";
	НаборДанных.ИсточникДанных 	      = "ИсточникДанных1";
	
	РазрешенныеМодули                 = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("БИБЛИОТЕКАФУНКЦИЙОБМЕНА");
	СоответствиеГруппировок           = Новый Соответствие;
	СоздатьСтруктуруСхемыКомпоновкиИзДерева(ДеревоСтруктуры, СхемаКомпоновкиРезультата.НастройкиПоУмолчанию, СхемаКомпоновкиРезультата, НаборДанных, РазрешенныеМодули, СоответствиеГруппировок);	
	
	ВнешниеНаборы                     = Новый Структура("ВходящиеДанные", ТаблицаДанных);
	ФорматЗагрузки                    = Формат;
	
	Параметр                          = СхемаКомпоновкиРезультата.Параметры.Добавить();
	Параметр.Имя                      = "КассовыйОрган";
	Параметр.Значение                 = Задание.КассовыйОрган;
	Параметр.ВключатьВДоступныеПоля   = Ложь;
	Параметр.ОграничениеИспользования = Истина;
	
	НастройкиКомпоновки               = СхемаКомпоновкиРезультата.НастройкиПоУмолчанию;
	
	КомпоновщикМакета                 = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки                   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиРезультата, НастройкиКомпоновки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	ПроцессорКомпоновки               = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы,,Истина);
	ПроцессорВывода                   = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ДеревоЗначений);
	
	РезультатВыполнения               = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	СокращенноеДеревоСтруктуры        = Новый ДеревоЗначений;
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Группировка", Новый ОписаниеТипов("Строка"));
	СокращенноеДеревоСтруктуры.Колонки.Добавить("Поля", Новый ОписаниеТипов("Массив"));
	
	СократитьДерево(ДеревоСтруктуры, СокращенноеДеревоСтруктуры, СоответствиеГруппировок);  
	
	Для каждого СтрокаРезультата Из РезультатВыполнения.Строки Цикл  
		
		Если Формат.ИдентификаторОбъекта.Имя = "" Тогда   
			Продолжить;   
			
		ИначеЕсли Формат.ИдентификаторОбъекта.Имя = "ПлатежноеПоручение" Тогда	
			
			ДокументОбъект     = Документы.ПлатежноеПоручение.ПустаяСсылка();
			
			СтрокаГруппировки  = СокращенноеДеревоСтруктуры.Строки[0];   
			ПечатныйОбраз      = Новый Структура;
			
			СтрокаРеквизитовПО = "";
								
			Для каждого ТекПоле Из СтрокаГруппировки.Поля Цикл
				Если Найти(ВРЕГ(ТекПоле), "ПЕЧАТНЫЙОБРАЗ") <> 0 Тогда
					СтрокаРеквизитовПО  = СтрокаРеквизитовПО + "," + ТекПоле;					
				КонецЕсли;
			КонецЦикла;
			
			СтрокаРеквизитовПО          = Сред(СтрокаРеквизитовПО, 2);			
			СтруктураПроверки           = Новый Структура(СтрЗаменить(СтрокаРеквизитовПО, ".", ""));
					
			ЗаполнитьЗначенияСвойств(СтруктураПроверки, СтрокаРезультата);
			
			Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
				Если ВРЕГ(Лев(ЗначениеПроверки.Ключ, 13)) = "ПЕЧАТНЫЙОБРАЗ" Тогда
					ПечатныйОбраз.Вставить(Сред(ЗначениеПроверки.Ключ, 14), ЗначениеПроверки.Значение);
				КонецЕсли;
			КонецЦикла;    
			
			ДокументОбъект = БиблиотекаФункцийОбмена.ПодобратьППЗаписатьОбразУФЭБС(ПечатныйОбраз, Задание.Ссылка);	
			
		ИначеЕсли Формат.ИдентификаторОбъекта.Имя = "ЗаявкаНаСдачуПолучениеНаличных" Тогда	
			
			ДокументОбъект     = Документы.ЗаявкаНаСдачуПолучениеНаличных.ПустаяСсылка();
			
			СтрокаГруппировки  = СокращенноеДеревоСтруктуры.Строки[0];   
			ПечатныйОбраз      = Новый Структура;
			
			СтрокаРеквизитовПО = "";
								
			Для каждого ТекПоле Из СтрокаГруппировки.Поля Цикл
				Если Найти(ВРЕГ(ТекПоле), "ПЕЧАТНЫЙОБРАЗ") <> 0 Тогда
					СтрокаРеквизитовПО  = СтрокаРеквизитовПО + "," + ТекПоле;					
				КонецЕсли;
			КонецЦикла;
			
			СтрокаРеквизитовПО          = Сред(СтрокаРеквизитовПО, 2);			
			СтруктураПроверки           = Новый Структура(СтрЗаменить(СтрокаРеквизитовПО, ".", ""));
					
			ЗаполнитьЗначенияСвойств(СтруктураПроверки, СтрокаРезультата);
			
			Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
				Если ВРЕГ(Лев(ЗначениеПроверки.Ключ, 13)) = "ПЕЧАТНЫЙОБРАЗ" Тогда
					ПечатныйОбраз.Вставить(Сред(ЗначениеПроверки.Ключ, 14), ЗначениеПроверки.Значение);
				КонецЕсли;
			КонецЦикла;    
			
			ДокументОбъект = БиблиотекаФункцийОбмена.ПодобратьЗаявкуНДЗаписатьОбразУФЭБС(ПечатныйОбраз, Задание.Ссылка);	
		
		ИначеЕсли Формат.ИдентификаторОбъекта.Имя = "КассовоеПоступление" Тогда    
						
			СтрокаГруппировки  = СокращенноеДеревоСтруктуры.Строки[0];   
			ДокументОбъект     = Документы.КассовоеПоступление.ПустаяСсылка();
			ПечатныйОбраз      = Новый Структура;
			
			СтрокаРеквизитовПО = "";
								
			Для каждого ТекПоле Из СтрокаГруппировки.Поля Цикл
				Если Найти(ВРЕГ(ТекПоле), "ПЕЧАТНЫЙОБРАЗ") <> 0 Тогда
					СтрокаРеквизитовПО  = СтрокаРеквизитовПО + "," + ТекПоле;					
				КонецЕсли;
			КонецЦикла;
			
			СтрокаРеквизитовПО          = Сред(СтрокаРеквизитовПО, 2);			
			СтруктураПроверки           = Новый Структура(СтрЗаменить(СтрокаРеквизитовПО, ".", ""));
					
			ЗаполнитьЗначенияСвойств(СтруктураПроверки, СтрокаРезультата);
			
			Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
				Если ВРЕГ(Лев(ЗначениеПроверки.Ключ, 13)) = "ПЕЧАТНЫЙОБРАЗ" Тогда
					ПечатныйОбраз.Вставить(Сред(ЗначениеПроверки.Ключ, 14), ЗначениеПроверки.Значение);
				КонецЕсли;
			КонецЦикла; 
			
			ДокументОбъект = БиблиотекаФункцийОбмена.СоздатьКассовоеПоступлениеНаОснованииПечатногоОбразаПП(ПечатныйОбраз, Задание.Ссылка, ДанныеНовыхКонтрагентов);
			
		ИначеЕсли Формат.ИдентификаторОбъекта.Имя = "ВыпискаИзЛицевогоСчета" Тогда	
			
			СтрокаГруппировки             = СокращенноеДеревоСтруктуры.Строки[0]; 

			// выделяем объект для импорта
			СохраненныйДокумент           = Документы.ВыпискаИзЛицевогоСчета.НайтиПоНомеру(СтрокаРезультата.Номер, СтрокаРезультата.Дата);
			
			Если СохраненныйДокумент.Пустая() Тогда
				ДокументОбъект            = Документы.ВыпискаИзЛицевогоСчета.СоздатьДокумент();
			Иначе
				ДокументОбъект            = СохраненныйДокумент.ПолучитьОбъект();
				Попытка
					ЗаблокироватьДанныеДляРедактирования(ДокументОбъект.Ссылка);
				Исключение
					ВызватьИсключение НСтр("ru='Невозможно заблокировать для редактирования документ '") + СохраненныйДокумент;
				КонецПопытки;
				ДокументОбъект.Остатки.Очистить();
				ДокументОбъект.ДокументыДвижений.Очистить();
			КонецЕсли;
			
			// запись реквизитов шапки документа
			СтрокаРеквизитов              = "";
			
			Для каждого ТекПоле Из СтрокаГруппировки.Поля Цикл
				СтрокаРеквизитов          = СтрокаРеквизитов + "," + ТекПоле;
			КонецЦикла;
			
			СтрокаРеквизитов              = Сред(СтрокаРеквизитов, 2);
			ЗаполнитьЗначенияСвойств(ДокументОбъект, СтрокаРезультата, СтрокаРеквизитов);
			ЗаполнитьЗначенияСвойств(ДокументОбъект, Задание, "Организация");
			
			Если ДокументОбъект.Ссылка.Пустая() Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
			// обработка реквизитов табличных частей
			Для каждого ВложеннаяГруппировка Из СтрокаГруппировки.Строки Цикл
				
				СтрокаРеквизитов          = "";
				
				Для каждого ТекПоле Из ВложеннаяГруппировка.Поля Цикл
					
					Если Лев(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 1) = ВложеннаяГруппировка.Группировка + "." Тогда
						СтрокаРеквизитов  = СтрокаРеквизитов + "," +Сред(ТекПоле, СтрДлина(ВложеннаяГруппировка.Группировка) + 2);	
					Иначе
						СтрокаРеквизитов  = СтрокаРеквизитов + "," +ТекПоле;
					КонецЕсли;
					
				КонецЦикла;
				
				СтрокаРеквизитов          = Сред(СтрокаРеквизитов, 2);
				
				Если Найти(СтрокаРеквизитов, ".") = 0 Тогда
					
					// в СтрокаРеквизитов только имена табличной части
					СтруктураПроверки     = Новый Структура(СтрокаРеквизитов);
					Для каждого ВложеннаяСтрока Из СтрокаРезультата.Строки Цикл
						
						ЕстьЗаполненные   = Ложь;
						
						Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
							СтруктураПроверки[ЗначениеПроверки.Ключ]          = ВложеннаяСтрока[ВложеннаяГруппировка.Группировка+ЗначениеПроверки.Ключ];	
							ЕстьЗаполненные                                   = Макс(ЕстьЗаполненные, ЗначениеЗаполнено(СтруктураПроверки[ЗначениеПроверки.Ключ]));
						КонецЦикла;
						
						Если ЕстьЗаполненные Тогда
							ЗаполнитьЗначенияСвойств(ДокументОбъект[ВложеннаяГруппировка.Группировка].Добавить(), СтруктураПроверки);
						КонецЕсли;
						
					КонецЦикла; 
					
				Иначе
					
					// в СтрокаРеквизитов есть дополнительные параметры. Требуется выделение параметров и вызов процедуры
					СтруктураПроверки                                         = Новый Структура(СтрЗаменить(СтрокаРеквизитов, ".", ""));	
					
					Для каждого ВложеннаяСтрока Из СтрокаРезультата.Строки Цикл
						
						ЕстьЗаполненные                                       = Ложь;
						ЗаполнитьЗначенияСвойств(СтруктураПроверки, ВложеннаяСтрока);
						
						Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
							ЕстьЗаполненные                                   = Макс(ЕстьЗаполненные, ЗначениеЗаполнено(СтруктураПроверки[ЗначениеПроверки.Ключ]));
							Если ЕстьЗаполненные Тогда
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если ЕстьЗаполненные Тогда
							
							ФункцияЗаполнения                                 = ВложеннаяСтрока["ДокументыДвиженийИсполняющийДокумент"];
						    ИсполняющийДокумент                               = "";	
							
							Если ФункцияЗаполнения                       = "ОпределитьПлатежныйДокумент" Тогда
								
								ПараметрыВызоваФункции                        = Новый Структура;
								
								Для каждого ЗначениеПроверки Из СтруктураПроверки Цикл
									Если ВРЕГ(Лев(ЗначениеПроверки.Ключ, 21)) = "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ" Тогда
										ПараметрыВызоваФункции.Вставить(Сред(ЗначениеПроверки.Ключ, 22), ЗначениеПроверки.Значение);
									КонецЕсли;
								КонецЦикла; 
								
								ИсполняющийДокумент                           = БиблиотекаФункцийОбмена.ОпределитьПлатежныйДокументУФЭБС(ПараметрыВызоваФункции, ДокументОбъект.Ссылка);							
								
								Если ЗначениеЗаполнено(ИсполняющийДокумент) Тогда

									СостояниеПлатежноРасчетныхДокументов = Новый Структура("ПлатежноРасчетныйДокумент, Статус, ДатаПроведения", ИсполняющийДокумент.Ссылка, 
									                                       Перечисления.СтатусыИсполненияДокумента.Исполнен, ДокументОбъект.ДатаВыписки); 
									ПлатежноРасчетныеДокументы.ЗарегестрироватьИсполнениеЗаявки(СостояниеПлатежноРасчетныхДокументов);

								КонецЕсли;				
						
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ИсполняющийДокумент) Тогда
								ДокументОбъект.ДокументыДвижений.Добавить().ИсполняющийДокумент = ИсполняющийДокумент;
							КонецЕсли;	
							
						КонецЕсли;
						
					КонецЦикла; 
				КонецЕсли;
			КонецЦикла; 
			
			// записываем импортированный документ
			Если ДокументОбъект.Модифицированность() Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;  
			
		КонецЕсли;	
						
		Если НЕ (ДокументОбъект.Ссылка.Пустая()) И Задание.ОбъектыОбмена.Найти(ДокументОбъект.Ссылка) = Неопределено Тогда 
			
			НовСтрокаЗадания                    = Задание.ОбъектыОбмена.Добавить();
			НовСтрокаЗадания.ИмяФайлаЗагрузки	= ИмяФайла;
			НовСтрокаЗадания.Формат				= Формат;
			НовСтрокаЗадания.Объект				= ДокументОбъект.Ссылка;  
			
		КонецЕсли;
		//-------------------------------------
	КонецЦикла; 	
	
КонецПроцедуры

///////////////////////////////////////////////////
Процедура ПрочитатьЗначениеПутиПравила(ПараметрыЧтения, ПутьПравила)
	
	СтруктураПоиска = Новый Структура("ПолеФайлаПередачи",ПутьПравила);
	Правила = ПараметрыЧтения.ПравилаОбмена.НайтиСтроки(СтруктураПоиска);
	
	ЧтениеXML = ПараметрыЧтения.ЧтениеXML;
	
	Для Каждого Правило Из Правила Цикл
				
		ТабличнаяЧасть = ПолучитьТабличнуюЧасть(Правило.ТабличнаяЧасть, ПараметрыЧтения.ТабЧасти);
		
		Если (ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента) И Найти(Врег(Правило.Условие), ВРег("*НоваяСтрока")) > 0 Тогда
			ТекущаяСтрокаДанных = ПараметрыЧтения.ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрокаДанных, ЗначенияСлужебныхПолей(ТабличнаяЧасть, ПараметрыЧтения.НомераОбходовТаблиц, Истина));
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Тогда
			ПрочитатьДополнительныеДействия(ПараметрыЧтения, Правило, ЧтениеXML.Значение);
		КонецЕсли;
	
		Если ЗначениеЗаполнено(Правило.ПолеОбъекта) И ЧтениеXML.ТипУзла <> ТипУзлаXML.КонецЭлемента Тогда
			
			Отбор = ЗначенияСлужебныхПолей(ТабличнаяЧасть, ПараметрыЧтения.НомераОбходовТаблиц);
			СтрокиОтбора = ПараметрыЧтения.ТаблицаДанных.НайтиСтроки(Отбор);
			Если СтрокиОтбора.Количество() > 0 Тогда
				ТекущаяСтрокаДанных = СтрокиОтбора[0];
			Иначе
				ТекущаяСтрокаДанных = ПараметрыЧтения.ТаблицаДанных.Добавить();
				ЗаполнитьЗначенияСвойств(ТекущаяСтрокаДанных, Отбор);
			КонецЕсли;
						
			ИмяПоля = ПолучитьИмяПоля(ПараметрыЧтения.СоответствиеКолонок, Правило, ПараметрыЧтения.ТаблицаДанных);
			
			Если ИмяПоля <> Неопределено И ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
				ТекущаяСтрокаДанных[ИмяПоля] = ЧтениеXML.Значение;
			КонецЕсли;
		
			Правило.Отключить = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТабличнуюЧасть(Знач ТабличнаяЧасть, ТабЧасти)
	
	Для Каждого ИмяТабЧасти Из ТабЧасти Цикл
		ТабличнаяЧасть = СтрЗаменить(ТабличнаяЧасть, "[" + ИмяТабЧасти.Ключ + "]", ИмяТабЧасти.Значение);
	КонецЦикла;
	
	Возврат ВРег(ТабличнаяЧасть);
	
КонецФункции

Процедура ПрочитатьДополнительныеДействия(ПараметрыЧтения, Правило, ЗначениеXML)
		
	Если Не ПустаяСтрока(Правило.ДопДействия) Тогда
		
		ДопДействия = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Правило.ДопДействия, ";");
		Для Каждого ТекДопДействие Из ДопДействия Цикл
			Если Не ПустаяСтрока(ТекДопДействие) Тогда					
				
				ЧастиРавенства = РазобратьРавенство(ТекДопДействие);
				Если ЧастиРавенства.Количество() = 2 Тогда
					
					Если Найти(Врег(Правило.Условие), ВРег("*УсловиеТЧ")) > 0 Тогда
						
						Значение = ПолучитьЗначениеПоСтроковомуПредставлению(ЧастиРавенства[1], ЗначениеXML);
						ПараметрыЧтения.ТабЧасти.Вставить(ЧастиРавенства[0], Значение);
						
					Иначе
						
						ТабличнаяЧасть = ПолучитьТабличнуюЧасть(Правило.ТабличнаяЧасть, ПараметрыЧтения.ТабЧасти);
						
						Отбор = ЗначенияСлужебныхПолей(ТабличнаяЧасть, ПараметрыЧтения.НомераОбходовТаблиц);
						СтрокиОтбора = ПараметрыЧтения.ТаблицаДанных.НайтиСтроки(Отбор);
						Если СтрокиОтбора.Количество() > 0 Тогда
							ТекущаяСтрокаДанных = СтрокиОтбора[0];
						Иначе
							ТекущаяСтрокаДанных = ПараметрыЧтения.ТаблицаДанных.Добавить();
							ЗаполнитьЗначенияСвойств(ТекущаяСтрокаДанных, Отбор);
						КонецЕсли;
						
						ИмяПоля = СтрЗаменить(ЧастиРавенства[0], ".", "_");
						Если ПараметрыЧтения.ТаблицаДанных.Колонки.Найти(ИмяПоля) = Неопределено Тогда
							ПараметрыЧтения.ТаблицаДанных.Колонки.Добавить(ИмяПоля);
						КонецЕсли;
						
						Если ПараметрыЧтения.КолонкиТаблицы.Найти(ИмяПоля) = Неопределено Тогда
							ПараметрыЧтения.КолонкиТаблицы.Добавить(ИмяПоля);
						КонецЕсли;
						
						Значение = ПолучитьЗначениеПоСтроковомуПредставлению(ЧастиРавенства[1], ЗначениеXML);
						
						ТекущаяСтрокаДанных[ИмяПоля] = Значение;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьЗначениеПоСтроковомуПредставлению(Представление, Параметр = Неопределено)
	
	Запрос = Новый Запрос("ВЫБРАТЬ " + Представление + " КАК Результат");
	
	Если Параметр <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(ВРег(Запрос.Текст), "ЗНАЧЕНИЕ", "&ЗНАЧЕНИЕ");
		Запрос.УстановитьПараметр("Значение", Параметр);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Результат;	
	
КонецФункции

Функция ПолучитьИмяПоля(ТаблицаКолонок, Правило, ТаблицаДанных = Неопределено)
	
	Если СокрЛП(Правило.ПолеОбъекта) = "" Тогда
		ИмяПоля = Неопределено;
		
	Иначе
		
		Отбор = Новый Структура("ПутьПравила,ИмяКолонки", Правило.ПолеФайлаПередачи, Правило.ПолеОбъекта);
		Результат = ТаблицаКолонок.НайтиСтроки(Отбор);
		
		Если Результат.Количество() > 0 Тогда
			ИмяПоля = Результат[0].ИмяПоля;
		Иначе
			ИмяПоля = ?(ЗначениеЗаполнено(Правило.ПорядокЗаполнения), "Поле" + Формат(ТаблицаКолонок.Количество() + 1,"ЧГ="), СтрЗаменить(Правило.ПолеОбъекта, ".", "_"));
					
			НовоеПоле = ТаблицаКолонок.Добавить();
			НовоеПоле.ПутьПравила = Отбор.ПутьПравила;
			НовоеПоле.ИмяКолонки = Отбор.ИмяКолонки;
			НовоеПоле.ИмяПоля = ИмяПоля;
			Если ТаблицаДанных <> Неопределено Тогда
				Если ТаблицаДанных.Колонки.Найти(ИмяПоля) = Неопределено Тогда
					ТаблицаДанных.Колонки.Добавить(ИмяПоля);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат ИмяПоля;	
	
КонецФункции

Функция ПолучитьДанныеИмпортаПоСхемеФормата(ПравилаЗагрузки, ТаблицаДанных, СоответствиеКолонок, ПоляГруппировки, ЗаданиеСсылка)
	
	СхемаКомпоновкиРезультата = Новый СхемаКомпоновкиДанных;
	
	ТаблицаДанных.Колонки.Добавить("СлужебноеПоле_ПолеСвязи");
	ТаблицаДанных.ЗаполнитьЗначения(Истина, "СлужебноеПоле_ПолеСвязи"); 
	ВнешниеНаборы = Новый Структура("ВходящиеДанные", ТаблицаДанных);
	
	ВычисляемыеПоля = Новый ТаблицаЗначений;
	ВычисляемыеПоля.Колонки.Добавить("Путь");
	ВычисляемыеПоля.Колонки.Добавить("Выражение");	
	
	БюджетнаяОтчетность.ДобавитьТаблицуЗначенийВНаборыДанныхСхемыКомпоновкиДанных(СхемаКомпоновкиРезультата, ТаблицаДанных, "ВходящиеДанные");
	
	Для Каждого ТекПравилоЗагрузки Из ПравилаЗагрузки Цикл
		Если ЗначениеЗаполнено(ТекПравилоЗагрузки.ПолеОбъекта) И Не ТекПравилоЗагрузки.Отключить Тогда
			
			ВычПоле = ВычисляемыеПоля.Добавить();		
			ВычПоле.Путь = СтрЗаменить(ТекПравилоЗагрузки.ПолеОбъекта, ".", "_");
			
			ВыражениеВычисляемогоПоля = ПолучитьИмяПоля(СоответствиеКолонок, ТекПравилоЗагрузки);
			
			Если ЗначениеЗаполнено(ТекПравилоЗагрузки.ПорядокЗаполнения) Тогда
				ВыражениеВычисляемогоПоля = ПодставитьФормулуВместоЗначения(ТекПравилоЗагрузки.ПорядокЗаполнения, ВыражениеВычисляемогоПоля);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекПравилоЗагрузки.ПравилоФорматированияИмпорт) Тогда
				ВыражениеВычисляемогоПоля = ПодставитьФормулуВместоЗначения(ТекПравилоЗагрузки.ПравилоФорматированияИмпорт, ВыражениеВычисляемогоПоля);	
			КонецЕсли;	
			
			//ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновкиРезультата, ПутьКДаннымВычисляемогоПоля, ВыражениеВычисляемогоПоля);			
			//
			//Если ПоляГруппировки.Найти(ПутьКДаннымВычисляемогоПоля) = Неопределено Тогда
			//	ПоляГруппировки.Добавить(ПутьКДаннымВычисляемогоПоля);
			//КонецЕсли;
			
			ВычПоле.Выражение = ВыражениеВычисляемогоПоля;
			
		КонецЕсли;		
	КонецЦикла;
	
	ДобавитьВычисляемыеПоляВСхему(СхемаКомпоновкиРезультата, ВычисляемыеПоля, ПоляГруппировки);
	Если ЗначениеЗаполнено(ЗаданиеСсылка) Тогда
		НаборЗадание = СхемаКомпоновкиРезультата.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		НаборЗадание.Имя = "НаборЗадание";
		НаборЗадание.ИсточникДанных	= СхемаКомпоновкиРезультата.НаборыДанных.Найти("ВходящиеДанные").ИсточникДанных;
		НаборЗадание.АвтоЗаполнениеДоступныхПолей = Истина;

		НаборЗадание.Запрос = "ВЫБРАТЬ
		                      |	ЗаданиеНаИмпортДанныхБанкиКС.Ссылка КАК Задание,
		                      |	ИСТИНА КАК ПолеСвязи
		                      |ИЗ
		                      |	Документ.ЗаданиеНаИмпортДанныхБанкиКС КАК ЗаданиеНаИмпортДанныхБанкиКС
		                      |ГДЕ
		                      |	ЗаданиеНаИмпортДанныхБанкиКС.Ссылка = &Задание";
							  
		ПараметрЗадание = СхемаКомпоновкиРезультата.Параметры.Добавить();
		ПараметрЗадание.Имя = "Задание";
		ПараметрЗадание.Значение = ЗаданиеСсылка;
		ПараметрЗадание.ДоступенСписокЗначений = Ложь;	
		ПараметрЗадание.ОграничениеИспользования = Истина;
								  
		
		СвязьНаборовДанных = СхемаКомпоновкиРезультата.СвязиНаборовДанных.Добавить();
		СвязьНаборовДанных.НаборДанныхИсточник	= "НаборЗадание";   
		СвязьНаборовДанных.НаборДанныхПриемник	= "ВходящиеДанные";
		СвязьНаборовДанных.ВыражениеИсточник	= "ПолеСвязи";
		СвязьНаборовДанных.ВыражениеПриемник	= "СлужебноеПоле_ПолеСвязи";
	КонецЕсли;	
	
	Настройки = СхемаКомпоновкиРезультата.НастройкиПоУмолчанию;
	
	ГруппировкаСхемы = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаСхемы.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Для Каждого ПолеГруппировки Из ПоляГруппировки Цикл
		ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(ГруппировкаСхемы, ПолеГруппировки);	
	КонецЦикла;
	ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(ГруппировкаСхемы, "СлужебноеПоле_ТабличнаяЧасть");
	ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(ГруппировкаСхемы, "СлужебноеПоле_ИдентификаторСтроки");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиРезультата, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы,,Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ТаблицаЗначений);
	
	РезультатВыполнения = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	
	Возврат РезультатВыполнения;  
	
КонецФункции

Функция ПодставитьФормулуВместоЗначения(СтрокаСоЗначением, Формула)
	
		РезультатОбработки = "";
		Попытка
			БухгалтерскиеОперацииСервер.ОбработатьФормулуРеквизитаПроводки(СтрокаСоЗначением,РезультатОбработки,"Порядок заполнения",Новый Массив,"","",ОписаниеОшибки, Ложь);
		Исключение
			ТекстОшибки = ИнформацияОбОшибке().Описание;
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
		
		Результат = СтрЗаменить(РезультатОбработки,"<ЗНАЧЕНИЕ>",Формула);		
		
		Возврат Результат;
		
КонецФункции

Функция ЗначенияСлужебныхПолей(ИмяТабЧасти, НомераОбходовТаблиц, Инкрементировать = Ложь)
	
	Результат = Новый Структура("СлужебноеПоле_ТабличнаяЧасть, СлужебноеПоле_ИдентификаторСтроки", "", ""); 
	
	//Если ПустаяСтрока(ИмяТабЧасти) Тогда
	//	Возврат Результат;
	//КонецЕсли;
	//
	//Таблицы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяТабЧасти, ".");
	
	Если ПустаяСтрока(ИмяТабЧасти) Тогда
		Таблицы = ОбщегоНазначенияБГУ.Массив("");
	Иначе
		Таблицы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("." + ИмяТабЧасти, ".");
	КонецЕсли;
	
	Если НомераОбходовТаблиц = Неопределено Тогда
		НомераОбходовТаблиц = Новый ДеревоЗначений;
		НомераОбходовТаблиц.Колонки.Добавить("ИмяТаблицы");
		НомераОбходовТаблиц.Колонки.Добавить("Количество");
	КонецЕсли;

	ТекСтрока = НомераОбходовТаблиц;
	БылаДобавлена = Ложь;
	Идентификаторы = Новый Массив;	
	
	Для Каждого Таблица Из Таблицы Цикл
		ИндексТаблицы = ТекСтрока.Строки.Найти(Таблица, "ИмяТаблицы");
		Если ИндексТаблицы = Неопределено Тогда
			ТекСтрока = ТекСтрока.Строки.Добавить();	
			ТекСтрока.ИмяТаблицы = Таблица;
			ТекСтрока.Количество = 1;
			БылаДобавлена = Истина;
		Иначе
			//ИндексТаблицы.Количество = ИндексТаблицы.Количество + 1;
			ТекСтрока = ИндексТаблицы;
		КонецЕсли;
		
		Идентификаторы.Добавить(ТекСтрока.Количество);
		
	КонецЦикла;
	
	Если Инкрементировать И Не БылаДобавлена Тогда
		ТекСтрока.Количество = ТекСтрока.Количество + 1;
		Идентификаторы[Идентификаторы.ВГраница()] = Идентификаторы[Идентификаторы.ВГраница()] + 1;
		ТекСтрока.Строки.Очистить();
	КонецЕсли;
	
	ИдентификаторСтроки = СтрСоединить(Идентификаторы, "/");
	
	Результат.СлужебноеПоле_ТабличнаяЧасть = ИмяТабЧасти;
	Результат.СлужебноеПоле_ИдентификаторСтроки = ИдентификаторСтроки;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьВычисляемыеПоляВСхему(СхемаКомпоновки, ВычисляемыеПоля, ПоляГруппировки)
	
	ВычисляемыеПоля.Свернуть("Путь,Выражение");
	
	ВычПоля = ВычисляемыеПоля.Скопировать(, "Путь");
	ВычПоля.Свернуть("Путь");
	ВычПоля = ВычПоля.ВыгрузитьКолонку("Путь");
	
	Для Каждого ВычПоле Из ВычПоля Цикл
		
		Если ПоляГруппировки.Найти(ВычПоле) = Неопределено Тогда
			ПоляГруппировки.Добавить(ВычПоле);
		КонецЕсли;
		
		ВыраженияПоля = ВычисляемыеПоля.НайтиСтроки(Новый Структура("Путь", ВычПоле));
		
		Если ВыраженияПоля.Количество() = 1 И ВыраженияПоля[0].Выражение = ВычПоле Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Выражение Из ВыраженияПоля Цикл
			ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновки, ВычПоле, Выражение.Выражение);			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////

Функция ПолучитьПутьПравилаОбработкиБезПространстваИмен(Знач ПутьПравилаОбработки)   Экспорт
	
	Если СтрНайти(ПутьПравилаОбработки,":")=0 Тогда
		//Если нет двоеточия, значит и пространства имен нет, возвращаем исходное значение
		Возврат ПутьПравилаОбработки;	
	КонецЕсли;
	
	МассивБлоков = СтрРазделить(ПутьПравилаОбработки,"/",Истина);
	Для Инд = 0 По МассивБлоков.ВГраница() Цикл

 		ТекБлок = МассивБлоков[Инд];
		Если СтрНайти(ТекБлок,":")>0 Тогда
			ЭтоАтрибут = СтрНачинаетсяС(ТекБлок,"@");
			МассивЧастей = СтрРазделить(ТекБлок,":",Ложь);
			ТекБлок = ?(ЭтоАтрибут,"@","")+МассивЧастей[1];// первая часть это пространство имен
            МассивБлоков[Инд] = ТекБлок;
		Иначе
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	ПутьПравилаОбработки_БезПространстваИмен = СтрСоединить(МассивБлоков,"/");
	Возврат ПутьПравилаОбработки_БезПространстваИмен;
		
КонецФункции	

Процедура ЗагрузитьИзФайлаXML(ТекстФайла, Формат, Задание,п4,ИмяФайлаЗагрузки,п6,п7,п8,п9,ОписаниеОбъектаОшибки,ТекстОшибкиУНИФО="", ДанныеНовыхКонтрагентов, РасшифровкаXML)
	Перем ПравилаЗагрузки, ТаблицаДанных, СоответствиеКолонок, СхемаКомпоновкиРезультата, ИменаРеквизитов, НомераОбходовТаблиц;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстФайла);
	ПутьПравилаОбработки = "";
	ВыполняласьОбработкаТекстаXML = Ложь;
	
	Если Формат.Владелец.ПредставлениеВНомереВерсии = "AZK" Тогда
		ЗагрузитьИзФайлаXML_AZK(ТекстФайла, Формат, Задание, ИмяФайлаЗагрузки, ДанныеНовыхКонтрагентов);
		Возврат;
	КонецЕсли;    
	
	Если Формат.Владелец.ПредставлениеВНомереВерсии = "RMS"  Тогда
		ЗагрузитьИзФайлаXML_RMS(ТекстФайла, Формат, Задание, ИмяФайлаЗагрузки, ДанныеНовыхКонтрагентов);
		Возврат;
	КонецЕсли;    
	
	Если Формат.Владелец.ПредставлениеВНомереВерсии = "RPP" Тогда
		ЗагрузитьИзФайлаXML_RPP(ТекстФайла, Формат, Задание, ИмяФайлаЗагрузки, ДанныеНовыхКонтрагентов, ОписаниеОбъектаОшибки);
		Возврат;
	КонецЕсли;  
	
	Если Формат.Владелец.ПредставлениеВНомереВерсии = "EB" Тогда
		ЗагрузитьИзФайлаXML_EB(ТекстФайла, Формат, Задание, ИмяФайлаЗагрузки, ДанныеНовыхКонтрагентов, ОписаниеОбъектаОшибки);
		Возврат;
	КонецЕсли;
	
	Если Формат.Владелец.ПредставлениеВНомереВерсии = "NBP" Тогда
		ЗагрузитьИзФайлаXML_TXL(ТекстФайла, Формат, Задание, ИмяФайлаЗагрузки, ДанныеНовыхКонтрагентов, РасшифровкаXML);
		Возврат;
	КонецЕсли;
	
	Если Формат.Владелец.ПредставлениеВНомереВерсии = "TXL" Тогда     
		Если (Формат.ИдентификаторОбъекта.Имя = "ЗаявкаНаВозврат") ИЛИ (Формат.ИдентификаторОбъекта.Имя = "УведомлениеОбУточненииВидаИПринадлежностиПлатежа") Тогда
			ЗагрузитьИзФайлаXML_RMS(ТекстФайла, Формат, Задание, ИмяФайлаЗагрузки, ДанныеНовыхКонтрагентов);	
		Иначе	
			ЗагрузитьИзФайлаXML_TXL(ТекстФайла, Формат, Задание, ИмяФайлаЗагрузки, ДанныеНовыхКонтрагентов, РасшифровкаXML);    
		КонецЕсли;	
		Возврат;
	КонецЕсли;
	
	Если Найти(Формат.Наименование, "ED")>0 Тогда
		ЗагрузитьИзФайлаXML2(ТекстФайла, Формат, Задание, ИмяФайлаЗагрузки, ДанныеНовыхКонтрагентов);
		Возврат;
	КонецЕсли;
	
	Если Формат.ИдентификаторОбъекта.Имя = "РегистрацияСведенийОбИмуществе" Тогда
		РезультатВыполнения = ЗагрузитьИзФайлаXML3(ТекстФайла, Формат, Задание.Ссылка);
		РеестрИмуществаСервер.ОбработатьДанныеИмпорта(Задание, Формат, РезультатВыполнения);
		Возврат;		
	КонецЕсли;	
		
	ПравилаОбменаТекФормата = Справочники.ФорматыОбменаБанкиКС.ПолучитьПравилаОбменаПоФормату(Формат);
	
	ДействиеНадФайлом = "";
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ПутьПравилаОбработки = ПутьПравилаОбработки + "/" + ЧтениеXML.Имя;
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			
			ПолеСтроки	 = ЧтениеXML.Значение;
			СтруктураПоиска = Новый Структура("ПолеФайлаПередачи",ПутьПравилаОбработки);
			СтрокиПравил = ПравилаОбменаТекФормата.НайтиСтроки(СтруктураПоиска);
			
			//Правило		 = Формат.ПравилаОбмена.Найти(ПутьПравилаОбработки, "ПолеФайлаПередачи");
			Если СтрокиПравил.Количество()>0 Тогда 
				Правило = СтрокиПравил[0];
			Иначе
				ПутьПравилаОбработки_БезПространстваИмен = ПолучитьПутьПравилаОбработкиБезПространстваИмен(ПутьПравилаОбработки);
				СтруктураПоиска = Новый Структура("ПолеФайлаПередачи",ПутьПравилаОбработки_БезПространстваИмен);
				СтрокиПравил = ПравилаОбменаТекФормата.НайтиСтроки(СтруктураПоиска);
				Если СтрокиПравил.Количество()>0 Тогда 
					Правило = СтрокиПравил[0];
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Правило) Тогда
				ОбработатьТекстXML(Формат, Правило, Задание, ПолеСтроки, ПравилаЗагрузки, ТаблицаДанных, СоответствиеКолонок, СхемаКомпоновкиРезультата, ИменаРеквизитов, ИмяФайлаЗагрузки, ОписаниеОбъектаОшибки);
				ВыполняласьОбработкаТекстаXML = Истина;
			КонецЕсли;
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			позУзла = Найти(ПутьПравилаОбработки+"/", "/"+ ЧтениеXML.Имя+"/");
			Если позУзла >= 1 Тогда
				ПутьПравилаОбработки = Лев(ПутьПравилаОбработки, позУзла - 1);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДействиеНадФайлом = "ИмпортПлатежей" Тогда
		//Все уже сделано
		Возврат;
	КонецЕсли;
	
	Если Не ВыполняласьОбработкаТекстаXML Тогда
		ТекстОшибкиУНИФО = НСтр("ru='Файл не содержит данных для загрузки'");
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СхемаКомпоновкиРезультата) <> Тип("СхемаКомпоновкиДанных") Тогда
		ВызватьИсключение "Не сформирована схема СКД";
	КонецЕсли;
	
	Если ТипЗнч(ТаблицаДанных) <> Тип("ТаблицаЗначений") Тогда
		ВызватьИсключение "Не сформирована таблица данных";
	ИначеЕсли ТаблицаДанных.Количество()=0 Тогда
		ВызватьИсключение "Таблица данных пустая";
	КонецЕсли;
	
	Если ПравилаЗагрузки.Количество()=0 Тогда
		Возврат;		
	КонецЕсли;
	
	ВнешниеНаборы = Новый Структура("ВходящиеДанные", ТаблицаДанных);
	ФорматЗагрузки = ПравилаЗагрузки[0].Ссылка;
	
	ЭтоЗапросКвитированияНачислений = Ложь;
	
	Если ФорматЗагрузки = Формат Тогда
		// Это обработка формата Ответ_УНИФО
		ЭтоЗапросКвитированияНачислений = Истина;		
	КонецЕсли;
	
	Если НЕ ЭтоЗапросКвитированияНачислений Тогда
		Возврат;
	КонецЕсли;
		
	НастройкиКомпновоки = СхемаКомпоновкиРезультата.НастройкиПоУмолчанию;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиРезультата, НастройкиКомпновоки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы,,Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ТаблицаЗначений);
	
	РезультатВыполнения = ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
	Если ЭтоЗапросКвитированияНачислений Тогда
		Если РезультатВыполнения.Колонки.Найти("ПроизвольныеПараметрыНачисление")=Неопределено 
			ИЛИ РезультатВыполнения.Колонки.Найти("ПроизвольныеПараметрыСтатусКвитирования")=Неопределено Тогда
			ЭтоЗапросКвитированияНачислений = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	МассивИменПараметров = Новый Массив;
	МассивИменПараметров.Добавить("ЗагружатьНовыеИзмененныеПлатежи");
	ЗагружатьНовыеИзмененныеПлатежи = Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПолучитьПараметрыНастройкиОбмена(МассивИменПараметров,Задание.НастройкаОбмена).Получить("ЗагружатьНовыеИзмененныеПлатежи");
	
	Для каждого ТекСтрокаРезультата Из РезультатВыполнения Цикл
		
		Если ЭтоЗапросКвитированияНачислений Тогда
			Если ЗначениеЗаполнено(ТекСтрокаРезультата.ПроизвольныеПараметрыНачисление) Тогда
				//Установим статус квитирования начислению, которе есть в базе
				ЗаписьРегистра = РегистрыСведений.СтатусыКвитированияНачислений.СоздатьМенеджерЗаписи();
				ЗаписьРегистра.Начисление = ТекСтрокаРезультата.ПроизвольныеПараметрыНачисление;
				ЗаписьРегистра.СтатусКвитирования = ТекСтрокаРезультата.ПроизвольныеПараметрыСтатусКвитирования;
				ЗаписьРегистра.ОстатокЗадолженности = ТекСтрокаРезультата.ПроизвольныеПараметрыОстатокЗадолженности;
				ЗаписьРегистра.Записать(Истина);
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	Если СообщилиОбИмпорте = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Обновлены статусы квитирования начислений.'"));
		СообщилиОбИмпорте = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьТекстXML(Формат, Правило, Задание, ПолеСтроки, ПравилаЗагрузки, ТаблицаДанных, СоответствиеКолонок, СхемаКомпоновкиРезультата, ИменаРеквизитов, ИмяФайлаЗагрузки, ОписаниеОбъектаОшибки)
	
	ДопДействия = Правило.ДопДействия;
	Поз = Найти(ДопДействия, "(");
	
	ТекФормат = Формат;
	
	Если Поз>0 Тогда
		// описана процедура
		ВызываемаяПроцедура = Лев(ДопДействия, Поз-1);
		СтрокаПараметров = Сред(ДопДействия, Поз+1);
		СтрокаПараметров = Лев(СтрокаПараметров, Найти(СтрокаПараметров, ")")-1);
		РазложениеПараметров = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПараметров, ",");
			
		Если ВызываемаяПроцедура = "ИмпортироватьВложение_base64" Тогда
			
			ДействиеНадФайлом = "ИмпортПлатежей";
			
			ИмяФормата = СтрЗаменить(РазложениеПараметров[2], """", "");
			
			ИменаРеквизитов = Новый Соответствие;
						
			ДвоичныеДанные 		= Base64Значение(ПолеСтроки);
			ИмяВременногоФайла	= ПолучитьИмяВременногоФайла();
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			ТекстовыйФайл 		= Новый ЧтениеТекста(ИмяВременногоФайла, КодировкаТекста.UTF8);
			СодержимоеФайла		= ТекстовыйФайл.Прочитать();
			ТекстовыйФайл.Закрыть();
			
			Если ПолучитьФункциональнуюОпцию("ЭтоБазаГАН") И ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюГИСГМП") Тогда
				Если ИмяФормата = "Payment_GMP"	Тогда
					ПараметрыДанных = Новый Соответствие;
					ПараметрыДанных.Вставить("ТекстФайла",СодержимоеФайла);
					
					СоответствиеРеквизитов = Новый Соответствие;
					СоответствиеРеквизитов.Вставить("/FinalPayment/payeeINN","ИНН");
					СоответствиеРеквизитов.Вставить("/FinalPayment/payeeKPP","КПП");
					СоответствиеРеквизитов.Вставить("/FinalPayment/Payee/payeeINN","ИНН");
					СоответствиеРеквизитов.Вставить("/FinalPayment/Payee/payeeKPP","КПП");

					ПараметрыДанных.Вставить("СоответствиеРеквизитов",СоответствиеРеквизитов);
					
					СтруктураРеквизитов = БиблиотекаФункцийОбмена.ПолучитьЗначенияИзXML(Формат.Владелец,ПараметрыДанных,"СоответствиеРеквизитов");
					Если СтруктураРеквизитов<>Неопределено Тогда
						Если СтруктураРеквизитов.Свойство("ИНН") И СтруктураРеквизитов.Свойство("КПП") Тогда
							Если Задание.Организация.ИНН <> СтруктураРеквизитов.ИНН 
								ИЛИ Задание.Организация.КПП <> СтруктураРеквизитов.КПП Тогда
								Если НЕ ЗначениеЗаполнено(БиблиотекаФункцийОбмена.ОпределитьКонтрагентаАН(СтруктураРеквизитов.ИНН, СтруктураРеквизитов.КПП)) Тогда
									// такого АН контрагента нет, значит считаем, что он есть в базе как Учреждение
									// оставляем этот же формат.
								Иначе
									//Значит это платеж подведомственного администратора начислений
									ИмяФормата = ИмяФормата+"_N";
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли ИмяФормата = "Payment_GMP_1_16" Тогда
					ПараметрыДанных = Новый Соответствие;
					ПараметрыДанных.Вставить("ТекстФайла",СодержимоеФайла);
					
					СоответствиеРеквизитов = Новый Соответствие;
					СоответствиеРеквизитов.Вставить("/FinalPayment/payeeINN","ИНН");
					СоответствиеРеквизитов.Вставить("/FinalPayment/payeeKPP","КПП");
					СоответствиеРеквизитов.Вставить("/FinalPayment/Payee/payeeINN","ИНН");
					СоответствиеРеквизитов.Вставить("/FinalPayment/Payee/payeeKPP","КПП");
					ПараметрыДанных.Вставить("СоответствиеРеквизитов",СоответствиеРеквизитов);
					
					СтруктураРеквизитов = БиблиотекаФункцийОбмена.ПолучитьЗначенияИзXML(Формат.Владелец,ПараметрыДанных,"СоответствиеРеквизитов");
					Если СтруктураРеквизитов<>Неопределено Тогда
						Если СтруктураРеквизитов.Свойство("ИНН") И СтруктураРеквизитов.Свойство("КПП") Тогда
							Если Задание.Организация.ИНН <> СтруктураРеквизитов.ИНН 
								ИЛИ Задание.Организация.КПП <> СтруктураРеквизитов.КПП Тогда
								Если НЕ ЗначениеЗаполнено(БиблиотекаФункцийОбмена.ОпределитьКонтрагентаАН(СтруктураРеквизитов.ИНН, СтруктураРеквизитов.КПП)) Тогда
									// такого АН контрагента нет, значит считаем, что он есть в базе как Учреждение
									// оставляем этот же формат.
								Иначе
									//Значит это платеж подведомственного администратора начислений
									ИмяФормата = "N_"+ИмяФормата;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ТекФормат = Справочники.ФорматыОбменаБанкиКС.ПолучитьФорматПоВладельцуНаправлениюНаименованию(Задание.ВидОбмена,Перечисления.НаправлениеОбменаБанкиКС.Импорт,ИмяФормата);
			
			РезультатВыполнения = ЗагрузитьИзФайлаXML3(СодержимоеФайла, ТекФормат, Задание.Ссылка);
			
			КоличествоСтрок = РезультатВыполнения.Количество();
			
			ЭтоПлатеж = РезультатВыполнения.Колонки.Найти("БанковскийИдентификаторПлатежа")<>Неопределено
				И РезультатВыполнения.Колонки.Найти("СтатусПлатежа")<>Неопределено;
			
			МассивИменПараметров = Новый Массив;
			МассивИменПараметров.Добавить("ЗагружатьНовыеИзмененныеПлатежи");
			ЗагружатьНовыеИзмененныеПлатежи = Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПолучитьПараметрыНастройкиОбмена(МассивИменПараметров,Задание.НастройкаОбмена).Получить("ЗагружатьНовыеИзмененныеПлатежи");
			
			Если Задание.ВидОбмена.ПредставлениеВНомереВерсии = "GY" И ЗагружатьНовыеИзмененныеПлатежи<>Ложь Тогда
				ЗагружатьНовыеИзмененныеПлатежи = Истина;
			КонецЕсли;
			
			ИмяФормата = ТекФормат.ИдентификаторОбъекта.Имя;
			Объект = Неопределено;
			
			РезультатВыполнения.Сортировать("СлужебноеПоле_ТабличнаяЧасть,СлужебноеПоле_ИдентификаторСтроки");
			
			Для Инд = 0 По КоличествоСтрок-1 Цикл
				ТекСтрока = РезультатВыполнения[Инд];
				Если НЕ ЗначениеЗаполнено(ТекСтрока.СлужебноеПоле_ТабличнаяЧасть) И ЭтоПлатеж Тогда
					// В цикле может быть только 1 строка и этот запрос выполнится только 1 раз.
					БанковскийИдентификаторПлатежа = ТекСтрока.БанковскийИдентификаторПлатежа;
					
					Запрос = Новый Запрос;
					Запрос.Текст =  "ВЫБРАТЬ Первые 1
									|	Док.Ссылка,
									|	Док.СодержимоеФайла
									|ИЗ
									|	Документ."+ИмяФормата+" КАК Док
									|ГДЕ
									|	Док.ПометкаУдаления = Ложь
									|	И Док.БанковскийИдентификаторПлатежа = &БанковскийИдентификаторПлатежа";

					Запрос.УстановитьПараметр("БанковскийИдентификаторПлатежа",БанковскийИдентификаторПлатежа);
					Результат = Запрос.Выполнить();
					Если НЕ Результат.Пустой() Тогда
						Если ЗагружатьНовыеИзмененныеПлатежи = Истина И ТекСтрока.СтатусПлатежа = "1" Тогда
							//Платеж был ранее загружен и в файл не вносились изменения, пропускаем
							Продолжить;
						КонецЕсли;
						Выборка = Результат.Выбрать();
						Выборка.Следующий();
						
						Если ЗагружатьНовыеИзмененныеПлатежи = Истина И ТекСтрока.СтатусПлатежа <> "1"
							И Выборка.СодержимоеФайла = СодержимоеФайла Тогда
							//Платеж был ранее загружен, в файл вносились изменения, но они были ранее загружены, пропускаем 
							Продолжить;
						КонецЕсли;
						
						ОбъектСсылка = Выборка.Ссылка;
						
					Иначе
						ОбъектСсылка = Неопределено;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ОбъектСсылка) тогда
						Объект             = ОбъектСсылка.ПолучитьОбъект();
						ОчиститьТабличныеЧасти(Объект);
						
						Объект.Организация = Задание.Организация;
						Объект.Дата        = ТекущаяДатаСеанса();
					Иначе	
						Объект             = Документы[ИмяФормата].СоздатьДокумент();
						Объект.Организация = Задание.Организация;
						Объект.Дата        = ТекущаяДатаСеанса();
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(Объект,ТекСтрока);				
					
					Объект.СодержимоеФайла = СодержимоеФайла;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ТекСтрока.СлужебноеПоле_ТабличнаяЧасть) И Объект <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(Объект[ТекСтрока.СлужебноеПоле_ТабличнаяЧасть].Добавить(),ТекСтрока);
				КонецЕсли;
				
			КонецЦикла;
			
			Если Объект <> Неопределено Тогда				
				ГосУслуги.ЗаполнитьНоменклатуруИПлательщикаПлатежа(Объект);
				ЗаписатьНовыйОбъектИмпорта(Задание, Объект, Неопределено, ИмяФайлаЗагрузки, ОписаниеОбъектаОшибки, Формат);
			КонецЕсли;
						
		ИначеЕсли ВызываемаяПроцедура = "ПолучитьУИН_base64" Тогда
			
			РазложениеПараметров[1] = СокрЛП(СтрЗаменить(РазложениеПараметров[1], """", ""));
			ТекУИН = БиблиотекаФункцийОбмена.ПолучитьУИН_base64(ПолеСтроки,РазложениеПараметров[1]);
			
			Если ПравилаЗагрузки = Неопределено Тогда
				ПравилаЗагрузки = ПолучитьПравилаЗагрузкиДляУНИФО(Формат, Формат.Наименование);
			КонецЕсли;
			
			Если ТаблицаДанных = Неопределено Тогда
				СформироватьТаблицуДанных(ПравилаЗагрузки, ТаблицаДанных, СоответствиеКолонок, СхемаКомпоновкиРезультата, ИменаРеквизитов); 	
			КонецЕсли;
			
			НоваяСтрокаДанных = ТаблицаДанных.Добавить();
			
			ИмяПоля = СоответствиеКолонок.Получить(Правило.ПолеФайлаПередачи);
			Если ИмяПоля <> Неопределено Тогда
				НоваяСтрокаДанных[ИмяПоля] = ТекУИН;
			КонецЕсли;
		ИначеЕсли ВызываемаяПроцедура = "УстановитьСтатусКвитирования" Тогда
			Если ТаблицаДанных <> Неопределено Тогда
				
				ИмяПоля = СоответствиеКолонок.Получить(Правило.ПолеФайлаПередачи);
				Если ИмяПоля <> Неопределено И ТаблицаДанных.Количество()>0 Тогда
					ТаблицаДанных[ТаблицаДанных.Количество()-1][ИмяПоля] = ПолеСтроки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПравилаЗагрузкиДляУНИФО(Формат, ИмяФормата)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ТипПоляФайлаПередачи,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ОграничениеРазмерности,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ОписаниеПоляФайлаПередачи,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПолеОбъекта,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПорядокЗаполнения,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ОбязательностьЗаполнения,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ТабличнаяЧасть,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.Условие,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ДопДействия,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.СекцияПечати,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПеременнаяПечати,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.Отключить,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.Ссылка
	               |ПОМЕСТИТЬ ТабФорматов
	               |ИЗ
	               |	Справочник.ФорматыОбменаБанкиКС.ПравилаОбмена КАК ФорматыОбменаБанкиКСПравилаОбмена
	               |ГДЕ
	               |	ФорматыОбменаБанкиКСПравилаОбмена.Ссылка.Владелец = &Владелец
	               |	И ФорматыОбменаБанкиКСПравилаОбмена.Ссылка.НаправлениеОбмена = &НаправлениеОбмена
	               |	И ФорматыОбменаБанкиКСПравилаОбмена.Ссылка.Наименование = &Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПользовательскиеВыраженияПолейФорматовОбмена.ФорматОбмена,
	               |	ПользовательскиеВыраженияПолейФорматовОбмена.ОбрабатываемоеПоле,
	               |	ПользовательскиеВыраженияПолейФорматовОбмена.ПолеФайла,
	               |	ПользовательскиеВыраженияПолейФорматовОбмена.НомерСтрокиПравил,
	               |	ПользовательскиеВыраженияПолейФорматовОбмена.ПользовательскоеВыражение
	               |ПОМЕСТИТЬ ПереопределяемыеПоля
	               |ИЗ
	               |	РегистрСведений.ПользовательскиеВыраженияПолейФорматовОбмена КАК ПользовательскиеВыраженияПолейФорматовОбмена
	               |ГДЕ
	               |	ПользовательскиеВыраженияПолейФорматовОбмена.Использовать
	               |	И ПользовательскиеВыраженияПолейФорматовОбмена.ФорматОбмена В
	               |			(ВЫБРАТЬ
	               |				ТабФорматов.Ссылка
	               |			ИЗ
	               |				ТабФорматов КАК ТабФорматов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабФорматов.ПолеФайлаПередачи,
				   |	ТабФорматов.Ссылка,
	               |	ТабФорматов.НомерСтроки КАК НомерСтроки,
	               |	ТабФорматов.ТипПоляФайлаПередачи,
	               |	ТабФорматов.ТипПоляФайлаПередачи.ПравилоФорматирования КАК ПравилоФорматирования,
				   |	ТабФорматов.ТипПоляФайлаПередачи.ПравилоФорматированияИмпорт КАК ПравилоФорматированияИмпорт,
	               |	ТабФорматов.ТипПоляФайлаПередачи.СтрогоРавноМаксимальномуРазмеру КАК СтрогоРавноМаксимальномуРазмеру,
	               |	ТабФорматов.ОграничениеРазмерности,
	               |	ТабФорматов.ОписаниеПоляФайлаПередачи,
	               |	ТабФорматов.ОбязательностьЗаполнения,
	               |	ТабФорматов.ТабличнаяЧасть,
	               |	ВЫБОР
	               |		КОГДА НЕ ПереопределяемыеПоля_ПолеОбъекта_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_ПолеОбъекта_Номер.ПользовательскоеВыражение
	               |		КОГДА НЕ ПереопределяемыеПоля_ПолеОбъекта_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_ПолеОбъекта_Ноль.ПользовательскоеВыражение
	               |		ИНАЧЕ ТабФорматов.ПолеОбъекта
	               |	КОНЕЦ КАК ПолеОбъекта,
	               |	ВЫБОР
	               |		КОГДА НЕ ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ПользовательскоеВыражение
	               |		КОГДА НЕ ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ПользовательскоеВыражение
	               |		ИНАЧЕ ТабФорматов.ПорядокЗаполнения
	               |	КОНЕЦ КАК ПорядокЗаполнения,
	               |	ВЫБОР
	               |		КОГДА НЕ ПереопределяемыеПоля_Условие_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_Условие_Номер.ПользовательскоеВыражение
	               |		КОГДА НЕ ПереопределяемыеПоля_Условие_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_Условие_Ноль.ПользовательскоеВыражение
	               |		ИНАЧЕ ТабФорматов.Условие
	               |	КОНЕЦ КАК Условие,
	               |	ВЫБОР
	               |		КОГДА НЕ ПереопределяемыеПоля_ДопДействия_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_ДопДействия_Номер.ПользовательскоеВыражение
	               |		КОГДА НЕ ПереопределяемыеПоля_ДопДействия_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_ДопДействия_Ноль.ПользовательскоеВыражение
	               |		ИНАЧЕ ТабФорматов.ДопДействия
	               |	КОНЕЦ КАК ДопДействия
	               |ИЗ
	               |	ТабФорматов КАК ТабФорматов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПолеОбъекта_Номер
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПолеОбъекта_Номер.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_ПолеОбъекта_Номер.ОбрабатываемоеПоле = ""ПолеОбъекта"")
	               |			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_ПолеОбъекта_Номер.НомерСтрокиПравил
				   |			И ТабФорматов.Ссылка = ПереопределяемыеПоля_ПолеОбъекта_Номер.ФорматОбмена
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПолеОбъекта_Ноль
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПолеОбъекта_Ноль.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_ПолеОбъекта_Ноль.ОбрабатываемоеПоле = ""ПолеОбъекта"")
	               |			И (ПереопределяемыеПоля_ПолеОбъекта_Ноль.НомерСтрокиПравил = 0)
				   |			И ТабФорматов.Ссылка = ПереопределяемыеПоля_ПолеОбъекта_Ноль.ФорматОбмена
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПорядокЗаполнения_Номер
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ОбрабатываемоеПоле = ""ПорядокЗаполнения"")
	               |			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_ПорядокЗаполнения_Номер.НомерСтрокиПравил
				   |			И ТабФорматов.Ссылка = ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ФорматОбмена
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПорядокЗаполнения_Ноль
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ОбрабатываемоеПоле = ""ПорядокЗаполнения"")
	               |			И (ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.НомерСтрокиПравил = 0)
				   |			И ТабФорматов.Ссылка = ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ФорматОбмена
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_Условие_Номер
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_Условие_Номер.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_Условие_Номер.ОбрабатываемоеПоле = ""Условие"")
	               |			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_Условие_Номер.НомерСтрокиПравил
				   |			И ТабФорматов.Ссылка = ПереопределяемыеПоля_Условие_Номер.ФорматОбмена
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_Условие_Ноль
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_Условие_Ноль.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_Условие_Ноль.ОбрабатываемоеПоле = ""Условие"")
	               |			И (ПереопределяемыеПоля_Условие_Ноль.НомерСтрокиПравил = 0)
				   |			И ТабФорматов.Ссылка = ПереопределяемыеПоля_Условие_Ноль.ФорматОбмена
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ДопДействия_Номер
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ДопДействия_Номер.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_ДопДействия_Номер.ОбрабатываемоеПоле = ""ДопДействия"")
	               |			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_ДопДействия_Номер.НомерСтрокиПравил
				   |			И ТабФорматов.Ссылка = ПереопределяемыеПоля_ДопДействия_Номер.ФорматОбмена
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ДопДействия_Ноль
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ДопДействия_Ноль.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_ДопДействия_Ноль.ОбрабатываемоеПоле = ""ДопДействия"")
	               |			И (ПереопределяемыеПоля_ДопДействия_Ноль.НомерСтрокиПравил = 0)
				   |			И ТабФорматов.Ссылка = ПереопределяемыеПоля_ДопДействия_Ноль.ФорматОбмена
	               |ГДЕ
	               |	ТабФорматов.Отключить = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки КАК НомерСтроки,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.ТипПоляФайлаПередачи,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.ОграничениеРазмерности,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.ОписаниеПоляФайлаПередачи,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.ПолеОбъекта,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.ПорядокЗаполнения,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.ОбязательностьЗаполнения,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.ТабличнаяЧасть,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.Условие,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.ДопДействия,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.СекцияПечати,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.ПеременнаяПечати,
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.Ссылка
	//			   |ИЗ
	//			   |	Справочник.ФорматыОбменаБанкиКС.ПравилаОбмена КАК ФорматыОбменаБанкиКСПравилаОбмена
	//			   |ГДЕ
	//			   |	ФорматыОбменаБанкиКСПравилаОбмена.Ссылка.Владелец = &Владелец
	//			   |	И ФорматыОбменаБанкиКСПравилаОбмена.Ссылка.НаправлениеОбмена = &НаправлениеОбмена
	//			   |	И ФорматыОбменаБанкиКСПравилаОбмена.Ссылка.Наименование = &Наименование
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	НомерСтроки";
	Запрос.УстановитьПараметр("Владелец", Формат.Владелец);
	Запрос.УстановитьПараметр("НаправлениеОбмена", Формат.НаправлениеОбмена);
	Запрос.УстановитьПараметр("Наименование", ИмяФормата);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура СформироватьТаблицуДанных(ПравилаЗагрузки, ТаблицаДанных, СоответствиеКолонок, СхемаКомпоновкиРезультата, ИменаРеквизитов) 	
	
	СхемаКомпоновкиРезультата = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиРезультата.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновкиРезультата.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя 			= "НаборДанных1";
	НаборДанных.ИмяОбъекта 		= "ВходящиеДанные";
	НаборДанных.ИсточникДанных 	= "ИсточникДанных1";
	
	ГруппировкаСхемы = СхемаКомпоновкиРезультата.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаСхемы.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	СоответствиеКолонок = Новый Соответствие;
	ТаблицаДанных = Новый ТаблицаЗначений;
	Для каждого ТекПравилоЗагрузки Из ПравилаЗагрузки Цикл
		Если ЗначениеЗаполнено(ТекПравилоЗагрузки.ПолеОбъекта) Тогда
			Если Найти(ТекПравилоЗагрузки.ПолеОбъекта, ";")=0 Тогда
				// задано поле объекта. Причем одно поле. 
				// в этом случае может быть заполнен порядок заполнения
				ИмяПоля = "Поле"+(СоответствиеКолонок.Количество()+1);
				
				ТаблицаДанных.Колонки.Добавить(ИмяПоля);
				СоответствиеКолонок.Вставить(СокрЛП(ТекПравилоЗагрузки.ПолеФайлаПередачи), ИмяПоля);
				
				Если ЗначениеЗаполнено(ТекПравилоЗагрузки.ПорядокЗаполнения) Тогда
					НовПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
					НовПоле.Поле 		= ИмяПоля;
					НовПоле.ПутьКДанным	= ИмяПоля;
					НовПоле.Роль.Обязательное = Истина;
				
					ПутьКДаннымВычисляемогоПоля = ТекПравилоЗагрузки.ПолеОбъекта;
					ВыражениеВычисляемогоПоля = СтрЗаменить(ТекПравилоЗагрузки.ПорядокЗаполнения, "Значение", ИмяПоля);
					
					Если Не ПустаяСтрока(ТекПравилоЗагрузки.ПравилоФорматированияИмпорт) Тогда
						ВыражениеВычисляемогоПоля = СтрЗаменить(ТекПравилоЗагрузки.ПравилоФорматированияИмпорт, "Значение", ВыражениеВычисляемогоПоля);	
					КонецЕсли;	
					
					ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновкиРезультата, ПутьКДаннымВычисляемогоПоля, ВыражениеВычисляемогоПоля);
					
				Иначе
					НовПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
					НовПоле.Поле 		= ИмяПоля;
					НовПоле.ПутьКДанным	= ТекПравилоЗагрузки.ПолеОбъекта;
					НовПоле.Роль.Обязательное = Истина;
				КонецЕсли;
				
				ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(ГруппировкаСхемы, ТекПравилоЗагрузки.ПолеОбъекта);
				ДобавитьИмяРеквизитаВСтруктуру(ТекПравилоЗагрузки.ПолеОбъекта, ИменаРеквизитов);
			Иначе
				// задано несколько полей.
				// поле набора данных будет одно
				ИмяПоля = "Поле"+(СоответствиеКолонок.Количество()+1);
				
				ТаблицаДанных.Колонки.Добавить(ИмяПоля);
				СоответствиеКолонок.Вставить(СокрЛП(ТекПравилоЗагрузки.ПолеФайлаПередачи), ИмяПоля);
				
				НовПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
				НовПоле.Поле 		= ИмяПоля;
				НовПоле.ПутьКДанным	= ИмяПоля;
				НовПоле.Роль.Обязательное = Истина;
				
				РазложениеПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекПравилоЗагрузки.ПолеОбъекта, ";");
				// для каждого поля объекта сделаем вычисляемое поле
				Для Каждого ТекПолеОбъекта Из РазложениеПолей Цикл
					
					Если ЗначениеЗаполнено(ТекПолеОбъекта) Тогда
						ПутьКДаннымВычисляемогоПоля = ТекПолеОбъекта;
						ВыражениеВычисляемогоПоля 	= ИмяПоля;
						ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновкиРезультата, ПутьКДаннымВычисляемогоПоля, ВыражениеВычисляемогоПоля);
						
						ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(ГруппировкаСхемы, ТекПолеОбъекта);
						ДобавитьИмяРеквизитаВСтруктуру(ТекПолеОбъекта, ИменаРеквизитов);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
				
		КонецЕсли;		
	КонецЦикла; 
КонецПроцедуры

Процедура ДобавитьИмяРеквизитаВСтруктуру(ПолеОбъекта, ИменаРеквизитов)
	Если ИменаРеквизитов = Неопределено Тогда
		ИменаРеквизитов = Новый Соответствие;
	КонецЕсли;
	СоставИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолеОбъекта, ".");
	Если ИменаРеквизитов.Получить(СоставИмени[0]) = Неопределено Тогда
		Если СоставИмени.Количество() = 2 Тогда
			ИменаРеквизитов.Вставить(СоставИмени[0], Новый Соответствие);
		Иначе
			ИменаРеквизитов.Вставить(СоставИмени[0], СоставИмени[0]);
		КонецЕсли;			
	КонецЕсли;
	Если СоставИмени.Количество() = 2 Тогда
		ИменаРеквизитов[СоставИмени[0]].Вставить(СоставИмени[1], СоставИмени[0]+СоставИмени[1]);
	КонецЕсли;
КонецПроцедуры

Процедура ОчиститьТабличныеЧасти(ДокументОбъект)
	Для каждого ТабличнаяЧасть из ДокументОбъект.Метаданные().ТабличныеЧасти цикл
		ДокументОбъект[ТабличнаяЧасть.Имя].Очистить();
	КонецЦикла;	
КонецПроцедуры	

// Заменяет некоторые ключевые слова встроенного языка, чтобы код работал в вычисляемом поле СКД
//
Функция ПреобразоватьПодСКД(Знач Строка)
	Возврат Строка;
	Результат = "";
	Если Лев(ВРЕГ(Строка), 13) = "ПЕРЕЧИСЛЕНИЯ." Тогда
		Результат = "Значение(Перечисление.";
		Строка = Сред(Строка, 14);
		Результат = Результат + Строка+")";
	ИначеЕсли Лев(ВРЕГ(Строка), 12) = "СПРАВОЧНИКИ." Тогда
		Результат = "Значение(Справочник.";
		Строка = Сред(Строка, 13);
		Результат = Результат + Строка+")";
	ИначеЕсли ЛЕВ(ВРЕГ(Строка), 6) = "ЧИСЛО(" Тогда
		Результат = СтрЗаменить(ВРЕГ(Строка), "ЧИСЛО(", "БиблиотекаФункцийОбмена.СтрокаВЧисло(");
		//Результат = "Выразить("+Сред(Строка, 7, СтрДлина(Строка)-7)+", ""Число"")" ;
	Иначе
		Результат = Строка;
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Получает выражение для вычисляемого поля СКД из текста на встроенном языке
Функция ФункцияВычисленияПараметра(СтрокаФункции, ИмяПараметра, ФункцияВычисления = "")
	Результат = Ложь;
	СтрокиФункции = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаФункции, ";");
	Для каждого ТекСтрокаФункции Из СтрокиФункции Цикл
	
		Если Найти(ТекСтрокаФункции, "=")>0 Тогда
			ЧастиРавенства = РазобратьРавенство(ТекСтрокаФункции);
			Если ВРЕГ(ЧастиРавенства[0])=ВРЕГ(ИмяПараметра) Тогда
				ФункцияВычисления = ПреобразоватьПодСКД(ЧастиРавенства[1]);
				Результат = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	Возврат Результат;
КонецФункции

Процедура УстановитьСоответствующееПолеРасшифровки(СтруктураТекущегоПоля, РеквизитыСтруктурыВРасшифровке)
	
	РазложениеПутиКДанным = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтруктураТекущегоПоля.ПутьКДанным, ".");
	
	Если Найти(СтруктураТекущегоПоля.Поле, ".") > 0 Тогда
		ТекущаяСекция         = Лев(СтруктураТекущегоПоля.Поле, Найти(СтруктураТекущегоПоля.Поле, ".") - 1); 
	КонецЕсли;
		
	Если РазложениеПутиКДанным.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = РазложениеПутиКДанным[РазложениеПутиКДанным.ВГраница()];
	
	Если РеквизитыСтруктурыВРасшифровке[ТекущаяСекция].Получить(ИмяПоля) <> Неопределено Тогда
		
		РеквизитыСтруктурыВРасшифровке[ТекущаяСекция][ИмяПоля] = СтруктураТекущегоПоля.ПутьКДанным;
		
	ИначеЕсли РазложениеПутиКДанным.Количество() = 2 Тогда
		
		Если РеквизитыСтруктурыВРасшифровке[ТекущаяСекция].Получить(РазложениеПутиКДанным[0]) = Неопределено Тогда
			РеквизитыСтруктурыВРасшифровке[ТекущаяСекция].Вставить(РазложениеПутиКДанным[0], Новый Структура);
		ИначеЕсли ТипЗнч(РеквизитыСтруктурыВРасшифровке[ТекущаяСекция][РазложениеПутиКДанным[0]]) <> Тип("Структура") Тогда
			РеквизитыСтруктурыВРасшифровке[ТекущаяСекция][РазложениеПутиКДанным[0]] = Новый Структура;
		КонецЕсли;
		
		Если НЕ РеквизитыСтруктурыВРасшифровке[ТекущаяСекция][РазложениеПутиКДанным[0]].Свойство(РазложениеПутиКДанным[1]) Тогда
			РеквизитыСтруктурыВРасшифровке[ТекущаяСекция][РазложениеПутиКДанным[0]].Вставить(РазложениеПутиКДанным[1], СтруктураТекущегоПоля.ПутьКДанным);
		Иначе
			РеквизитыСтруктурыВРасшифровке[ТекущаяСекция][РазложениеПутиКДанным[0]][РазложениеПутиКДанным[1]] = СтруктураТекущегоПоля.ПутьКДанным;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоПроизвольныеПараметры(ДопДействия)
	Возврат СтрЧислоВхождений(ВРег(ДопДействия), "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ.ВСТАВИТЬ")=1;
КонецФункции

Функция ПолучитьАтрибутыПоляПроизвольныхПараметров(ТекСтрока, ИмяСекции="")
	ВызватьИсключение "ПолучитьАтрибутыПоляПроизвольныхПараметров"; 	
КонецФункции

Процедура ЗаписатьНовыйОбъектИмпорта(Задание, Объект, СостояниеПлатежноРасчетныхДокументов, ИмяФайлаЗагрузки, Описание, Формат)
	
	// записываем объект
//	Если Объект <> "" Тогда
		
		Попытка
			
			Объект.Записать();
			
			Если Задание.ОбъектыОбмена.Найти(Объект.Ссылка) = Неопределено Тогда  
				
				СтрокаОбъектов                  = Задание.ОбъектыОбмена.Добавить();
				
				СтрокаОбъектов.Объект           = Объект.Ссылка;
				СтрокаОбъектов.ИмяФайлаЗагрузки = ИмяФайлаЗагрузки;
				СтрокаОбъектов.Формат           = Формат;
				
				Если Описание.Количество() > 0 Тогда
					СтрокаОбъектов.ОписаниеОшибки   = ЗначениеВСтрокуВнутр(Описание);
				КонецЕсли;      
				
			КонецЕсли;
			
			Если ТипЗнч(СостояниеПлатежноРасчетныхДокументов) = Тип("Структура") Тогда
			//МассивУНИФО = Новый Массив;
			//МассивУНИФО.Добавить("ПлатежВОплатуГосуслуг");
			//МассивУНИФО.Добавить("КвитанцияНаОплатуГосуслуг");
			//Если МассивУНИФО.Найти(Формат.ИдентификаторОбъекта.Имя)=Неопределено Тогда
				СостояниеПлатежноРасчетныхДокументов.Вставить("ПлатежноРасчетныйДокумент",Объект.Ссылка);
				ПлатежноРасчетныеДокументы.ЗарегестрироватьИсполнениеЗаявки(СостояниеПлатежноРасчетныхДокументов);
				
				ОчиститьСостояниеПлатежноРасчетногоДокумента(СостояниеПлатежноРасчетныхДокументов); 
			КонецЕсли;
			
		Исключение
			
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Системе не удалось записать загруженный объект '") + Объект + "!!! По причине: " + ОписаниеОшибки());
			
		КонецПопытки;
		
//	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьСостояниеПлатежноРасчетногоДокумента(СостояниеПлатежноРасчетныхДокументов) 
	СостояниеПлатежноРасчетныхДокументов.Очистить();
	Для каждого Ресурс из Метаданные.РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.Ресурсы цикл
		СостояниеПлатежноРасчетныхДокументов.Вставить(Ресурс.Имя);
	КонецЦикла;	
	СостояниеПлатежноРасчетныхДокументов.Вставить("ПервичныйОбразИРеквизиты","");
КонецПРоцедуры	

// добавляет в группировку BD вложенные группировки BDPD и BDPDST
//
Процедура ДополнитьПоляГруппировкиПолямиРасшифровки(УровеньГруппировки, ПоляРасшифровки, Префикс, ПараметрыТекущейГруппировки, СчетчикПараметровТекущейГруппировки)
	УровеньГруппировки2 = УровеньГруппировки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	УровеньГруппировки2.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	//УровеньГруппировки2.ПараметрыВывода.УстановитьЗначениеПараметра("РасположениеИтогов", РасположениеИтоговКомпоновкиДанных.НачалоИКонец);
	
	УровеньГруппировки3 = УровеньГруппировки2.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	УровеньГруппировки3.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	Для каждого ДобавленоПоле Из ПоляРасшифровки Цикл
		Если Лев(ДобавленоПоле.Поле, 3) = "BD." Тогда
			ДобавленоПолеПутьКДанным = ?(ПустаяСтрока(ДобавленоПоле.ПутьКДанным), ДобавленоПоле.Поле, ДобавленоПоле.ПутьКДанным);
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировки,	Префикс + ДобавленоПолеПутьКДанным);
		
			ПараметрыТекущейГруппировки.Вставить(ДобавленоПолеПутьКДанным, "П"+СчетчикПараметровТекущейГруппировки);
			СчетчикПараметровТекущейГруппировки = СчетчикПараметровТекущейГруппировки + 2;
		ИначеЕсли (Лев(ДобавленоПоле.Поле, 5) = "BDPD.") ИЛИ (Лев(ДобавленоПоле.Поле, 5) = "BDPL.") Тогда
			ДобавленоПолеПутьКДанным = ?(ПустаяСтрока(ДобавленоПоле.ПутьКДанным), ДобавленоПоле.Поле, ДобавленоПоле.ПутьКДанным);
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировки2,	Префикс + ДобавленоПолеПутьКДанным);
		
			ПараметрыТекущейГруппировки.Вставить(ДобавленоПолеПутьКДанным, "П"+СчетчикПараметровТекущейГруппировки);
			СчетчикПараметровТекущейГруппировки = СчетчикПараметровТекущейГруппировки + 2;
		Иначе
			ДобавленоПолеПутьКДанным = ?(ПустаяСтрока(ДобавленоПоле.ПутьКДанным), ДобавленоПоле.Поле, ДобавленоПоле.ПутьКДанным);
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировки3,	Префикс + ДобавленоПолеПутьКДанным);
		
			ПараметрыТекущейГруппировки.Вставить(ДобавленоПолеПутьКДанным, "П"+СчетчикПараметровТекущейГруппировки);
			СчетчикПараметровТекущейГруппировки = СчетчикПараметровТекущейГруппировки + 2;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ДополнитьПоляГруппировкиПолямиРасшифровки_ВО(УровеньГруппировки, ПоляРасшифровки, Префикс, ПараметрыТекущейГруппировки, СчетчикПараметровТекущейГруппировки)
	УровеньГруппировки2 = УровеньГруппировки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	УровеньГруппировки2.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	//УровеньГруппировки2.ПараметрыВывода.УстановитьЗначениеПараметра("РасположениеИтогов", РасположениеИтоговКомпоновкиДанных.НачалоИКонец);
	
	УровеньГруппировки3 = УровеньГруппировки2.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	УровеньГруппировки3.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	Для каждого ДобавленоПоле Из ПоляРасшифровки Цикл
		Если Лев(ДобавленоПоле.Поле, 3) = "BH." Тогда
			ДобавленоПолеПутьКДанным = ?(ПустаяСтрока(ДобавленоПоле.ПутьКДанным), ДобавленоПоле.Поле, ДобавленоПоле.ПутьКДанным);
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировки,	Префикс+ДобавленоПолеПутьКДанным);
		
			ПараметрыТекущейГруппировки.Вставить(ДобавленоПолеПутьКДанным, "П"+СчетчикПараметровТекущейГруппировки);
			СчетчикПараметровТекущейГруппировки = СчетчикПараметровТекущейГруппировки + 2;
		ИначеЕсли Лев(ДобавленоПоле.Поле, 3) = "ZR." Тогда
			ДобавленоПолеПутьКДанным = ?(ПустаяСтрока(ДобавленоПоле.ПутьКДанным), ДобавленоПоле.Поле, ДобавленоПоле.ПутьКДанным);
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировки2,	Префикс+ДобавленоПолеПутьКДанным);
		
			ПараметрыТекущейГруппировки.Вставить(ДобавленоПолеПутьКДанным, "П"+СчетчикПараметровТекущейГруппировки);
			СчетчикПараметровТекущейГруппировки = СчетчикПараметровТекущейГруппировки + 2;
		ИначеЕсли Лев(ДобавленоПоле.Поле, 6) = "ZROSN." Тогда
			ДобавленоПолеПутьКДанным = ?(ПустаяСтрока(ДобавленоПоле.ПутьКДанным), ДобавленоПоле.Поле, ДобавленоПоле.ПутьКДанным);
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировки3,	Префикс+ДобавленоПолеПутьКДанным);
		
			ПараметрыТекущейГруппировки.Вставить(ДобавленоПолеПутьКДанным, "П"+СчетчикПараметровТекущейГруппировки);
			СчетчикПараметровТекущейГруппировки = СчетчикПараметровТекущейГруппировки + 2;
		ИначеЕсли Лев(ДобавленоПоле.Поле, 5) = "ZRST." Тогда
			ДобавленоПолеПутьКДанным = ?(ПустаяСтрока(ДобавленоПоле.ПутьКДанным), ДобавленоПоле.Поле, ДобавленоПоле.ПутьКДанным);
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировки3,	Префикс+ДобавленоПолеПутьКДанным);
		
			ПараметрыТекущейГруппировки.Вставить(ДобавленоПолеПутьКДанным, "П"+СчетчикПараметровТекущейГруппировки);
			СчетчикПараметровТекущейГруппировки = СчетчикПараметровТекущейГруппировки + 2;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


// Добавляет поле в указанный набор данных СКД
//
Функция ДобавитьПолеВНаборДанных(НаборДанных, ПолеФайлаПередачи)
	ПолеФайла = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолеФайлаПередачи, ".");
	ИмяПоля = ПолеФайла[0]+"_"+ПолеФайла[1];
	Если НаборДанных.Поля.Найти(ИмяПоля) = Неопределено Тогда
		НовПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовПоле.Поле 		= ИмяПоля;
		НовПоле.ПутьКДанным	= ПолеФайла[0]+"."+ПолеФайла[1];
		НовПоле.Роль.Обязательное = Истина;
	КонецЕсли;
	Возврат НовПоле.ПутьКДанным;
КонецФункции

Функция РазобратьРавенство(Строка)
	Результат = Новый Массив;
	
	Позиция = Найти(Строка, "=");
	Если Позиция>0 Тогда
		Результат.Добавить(СокрЛП(Лев(Строка, Позиция-1)));
		Результат.Добавить(СокрЛП(Сред(Строка, Позиция+1)));
	КонецЕсли;

	Возврат Результат;
КонецФункции

Процедура НайтиСоответствиеПоПравилу(Правило, СоответствиеПеременных, МаркерСтроки, ЗначениеПеременной)
	
	Если НЕ ЗначениеЗаполнено(Правило.СекцияПечати) ИЛИ НЕ ЗначениеЗаполнено(Правило.ПеременнаяПечати) Тогда
		 Возврат;
	КонецЕсли;
	
	МногострочнаяСекция = Правило.Ссылка.ПравилаПечати.Найти(Правило.СекцияПечати).Многострочная;   
	
	Если Правило.ТипПоляФайлаПередачи.Наименование = "DATE_for_bank" Тогда
		 ЗначениеПеременной = БиблиотекаФункцийОбмена.ДатаИзБанковскойСтр(ЗначениеПеременной);
	КонецЕсли; 
	 
	Если Правило.ТипПоляФайлаПередачи.Наименование = "DATE_TIME_for_bank" Тогда
		 ЗначениеПеременной = БиблиотекаФункцийОбмена.ДатаИзБанковскойСтр(ЗначениеПеременной, Истина);
	КонецЕсли;
	
	Если Найти(Правило.ПолеФайлаПередачи, МаркерСтроки) > 0 Тогда
		
		ИмяПеременной 		= Правило.ПеременнаяПечати;
		ДобавитьСтроку 		= Ложь;	
			
		МассивСтрок   = СоответствиеПеременных.Получить(Правило.СекцияПечати);
		
		Если МассивСтрок = Неопределено Тогда
			
			МассивСтрок    = Новый Массив;
			ДобавитьСтроку = Истина;
			
		КонецЕсли;
		
		к = МассивСтрок.Количество();
		
		Если НЕ ДобавитьСтроку Тогда
			
			Если НЕ МассивСтрок[к-1].Свойство(ИмяПеременной) Тогда
				
				// спец. обработка переменной
				Если ИмяПеременной = "СуммаДК_УФЭБС" Тогда
					
					ЗначениеПризнака = "";
					Если МассивСтрок[к-1].Свойство("ПризнакДебета_УФЭБС", ЗначениеПризнака) Тогда
						
						Если ЗначениеПризнака = "1" Тогда
							ИмяПеременной = "Дебет";
						ИначеЕсли ЗначениеПризнака = "2" Тогда
							ИмяПеременной = "Кредит";
						КонецЕсли;
						
					КонецЕсли;
					
				ИначеЕсли ИмяПеременной = "ПризнакДебета_УФЭБС" Тогда
					
					СуммаДК = "";
					Если МассивСтрок[к-1].Свойство("СуммаДК_УФЭБС", СуммаДК) Тогда
						
						Если ЗначениеПеременной = "1" Тогда
							МассивСтрок[к-1].Вставить("Дебет",  СуммаДК);  
						ИначеЕсли ЗначениеПеременной = "2" Тогда
							МассивСтрок[к-1].Вставить("Кредит", СуммаДК);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				//---------------------------
				
				МассивСтрок[к-1].Вставить(ИмяПеременной, ЗначениеПеременной);
				
			Иначе
				ДобавитьСтроку = МногострочнаяСекция;  // добавляем строку только для многострочной части
			КонецЕсли;
			
		КонецЕсли;
		
		Если ДобавитьСтроку Тогда
			
			НаборПеременныхСтроки = Новый Структура;
			МассивСтрок.Добавить(НаборПеременныхСтроки);
			
			МассивСтрок[к].Вставить(ИмяПеременной, ЗначениеПеременной);
			//номер строки
			МассивСтрок[к].Вставить("Ном", к + 1);
			
		КонецЕсли;
		
		СоответствиеПеременных.Вставить(Правило.СекцияПечати, МассивСтрок);
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПолеНабораДанных(НаборДанных, Поле, ПутьКДанным, Заголовок = "")

	НовПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	НовПоле.Поле = Поле;
	НовПоле.ПутьКДанным = ПутьКДанным;
	НовПоле.Заголовок = Заголовок;
	НовПоле.Роль.Обязательное = Истина;

КонецПроцедуры

Функция ПреобразованиеПредставлениеКодировки(Кодировка) Экспорт
	
	Если Кодировка = "UTF8" Тогда
		Возврат "UTF-8"
	ИначеЕсли Кодировка = "UTF16" Тогда
		Возврат "UTF-16"
	ИначеЕсли (Кодировка = "ANSI") ИЛИ (Кодировка = "OEM") ИЛИ (Кодировка = "Системная") Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Недопустимая кодировка для XML файла: ") + Кодировка);
		Возврат ""
	КонецЕсли;
	
	Возврат Кодировка;
	
КонецФункции

// Функция возвращает имя файла передачи по требованиям типа формата
Функция ПолучитьИмяФайлаПередачи(Формат = "", Постфикс = "", ДокументСсылка = Неопределено, КодКлиента = "")
	
	СтрокаПробелов              = "000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипыОбменаБанкиКСИмяФайлаПередачи.ИмяПараметра,
	               |	ТипыОбменаБанкиКСИмяФайлаПередачи.ДлинаПараметра,
	               |	ТипыОбменаБанкиКСИмяФайлаПередачи.Значение,
	               |	ВЫБОР
	               |		КОГДА ТипыОбменаБанкиКСИмяФайлаПередачи.Значение ПОДОБНО &ВсеЗадаетПользователь
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПроизвольныйПараметр
	               |ИЗ
	               |	Справочник.ТипыОбменаБанкиКС.ИмяФайлаПередачи КАК ТипыОбменаБанкиКСИмяФайлаПередачи
	               |ГДЕ
	               |	ТипыОбменаБанкиКСИмяФайлаПередачи.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТипыОбменаБанкиКСИмяФайлаПередачи.НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", ВидОбмена);
	Запрос.УстановитьПараметр("ВсеЗадаетПользователь", "%адает%пользоват%все%");
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновки.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НомерПроизвольногоПараметра = 0;
	ПорядковыйНомерФайлаЗаСессию = ПорядковыйНомерФайлаЗаСессию + 1;
	ДлинаПорядоковогоНомера = 0 ;
	
	РазрешенныеОбщиеМодули = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВРЕГ("БиблиотекаФункцийОбмена"));
	
	ЗаменяемыеСлова = Новый Массив;
	ЗаменяемыеСлова.Добавить(ВРЕГ("Длина"));
	ЗаменяемыеСлова.Добавить(ВРЕГ("ОбрабатываемыйФормат"));
	ЗаменяемыеСлова.Добавить(ВРЕГ("ОбъектыОбмена"));
	ЗаменяющиеСлова = Новый Массив;
	ЗаменяющиеСлова.Добавить("<ДЛИНА>");
	ЗаменяющиеСлова.Добавить("&ОбрабатываемыйФормат");
	ЗаменяющиеСлова.Добавить("&ОбъектыОбмена");
	
	Если ДокументСсылка <> Неопределено Тогда
		ЗаменяемыеСлова.Добавить(ВРЕГ("ДокументСсылка"));
		ЗаменяющиеСлова.Добавить("&ДокументСсылка");
	КонецЕсли;
	
	ЗаменяемыеСлова.Добавить(ВРЕГ("КодКлиента"));
	ЗаменяющиеСлова.Добавить("&КодКлиента");
	
	ТекстВыражения = "";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.ПроизвольныйПараметр Тогда
			
			ЗначениеПоля = Задание.ПроизвольныеПараметры[НомерПроизвольногоПараметра].Значение;
			ДопПробелы   = Лев(СтрокаПробелов, Задание.ПроизвольныеПараметры[НомерПроизвольногоПараметра].Длина - СтрДлина(ЗначениеПоля));
			ТекстВыражения = ТекстВыражения + "+&П"+НомерПроизвольногоПараметра;
			
			Параметр = СхемаКомпоновки.Параметры.Добавить();
			Параметр.Имя = "П"+НомерПроизвольногоПараметра;
			Параметр.ТипЗначения = Новый ОписаниеТипов("Строка");
			Параметр.ОграничениеИспользования = Истина;
			Параметр.Значение = ЗначениеПоля + ДопПробелы;
			
			НомерПроизвольногоПараметра = НомерПроизвольногоПараметра + 1;
			
		Иначе
			
			ИспользуемыеРеквизиты = Новый Массив;
			Выражение = ОбщийМодульСКД.ПреобразоватьВыражениеСКД(Выборка.Значение, РазрешенныеОбщиеМодули, ЗаменяемыеСлова, ЗаменяющиеСлова, ИспользуемыеРеквизиты);
			Выражение = СтрЗаменить(Выражение, "<ДЛИНА>", Выборка.ДлинаПараметра);
			Для каждого ТекИспользуемыйРеквизит Из ИспользуемыеРеквизиты Цикл
			
				ИмяПараметра = СтрЗаменить(ТекИспользуемыйРеквизит, ".", "_");
				Выражение = СтрЗаменить(Выражение, ТекИспользуемыйРеквизит, "&"+ИмяПараметра);
				
				Если СхемаКомпоновки.Параметры.Найти(ИмяПараметра) = Неопределено Тогда
					
					НовыйПараметр = СхемаКомпоновки.Параметры.Добавить();
					НовыйПараметр.Имя = ИмяПараметра;
					Если ЛЕВ(ВРЕГ(ТекИспользуемыйРеквизит), 8) = "ЗАДАНИЕ." Тогда
						ЗначениеПараметра = ЗначениеРеквизита(Задание, Сред(ТекИспользуемыйРеквизит, 9));
					ИначеЕсли ЛЕВ(ВРЕГ(ТекИспользуемыйРеквизит), 21) = "ОБРАБАТЫВАЕМЫЙФОРМАТ." Тогда
						ЗначениеПараметра = ЗначениеРеквизита(ОбрабатываемыйФормат, Сред(ТекИспользуемыйРеквизит, 22));
					ИначеЕсли ЛЕВ(ВРЕГ(ТекИспользуемыйРеквизит), 15) = "ДОКУМЕНТССЫЛКА." И (ДокументСсылка <> Неопределено) Тогда
						ЗначениеПараметра = ЗначениеРеквизита(ДокументСсылка, Сред(ТекИспользуемыйРеквизит, 16));
					Иначе
						ЗначениеПараметра = "";
					КонецЕсли;
					НовыйПараметр.Значение = ЗначениеПараметра;
					НовыйПараметр.ОграничениеИспользования = Истина;
					
				КонецЕсли;
			
			КонецЦикла; 
			
			Если Формат.Владелец.ПредставлениеВНомереВерсии  = "NBP" И Выборка.ИмяПараметра = "Системное имя документа" Тогда
			//в Обмене НУБП Электронный бюджет первый параметр имеет разную длину: для выгрузки 15	
			     ТекстВыражения = ТекстВыражения + "+Выразить(" + Выражение + ",""Строка(15)"")";
			Иначе	
			     ТекстВыражения = ТекстВыражения + "+Выразить(" + Выражение + ",""Строка("+Выборка.ДлинаПараметра+")"")";
		    КонецЕсли;
			
			Если ВРЕГ(СокрЛП(Выборка.Значение)) = ВРЕГ("&ПорядковыйНомерФайлаЗаСессию") Тогда
				ДлинаПорядоковогоНомера = Выборка.ДлинаПараметра;	
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла; 
	
	Параметр = СхемаКомпоновки.Параметры.Добавить();
	Параметр.Имя = "ОбрабатываемыйФормат";
	Параметр.ОграничениеИспользования = Истина;
	Параметр.Значение = ОбрабатываемыйФормат;
	
	Если ДлинаПорядоковогоНомера>0 Тогда
		Параметр = СхемаКомпоновки.Параметры.Добавить();
		Параметр.Имя = "ПорядковыйНомерФайлаЗаСессию";
		Параметр.ОграничениеИспользования = Истина;
		Параметр.Значение = Формат(ПорядковыйНомерФайлаЗаСессию, "ЧЦ="+ДлинаПорядоковогоНомера+"; ЧВН=");
	КонецЕсли;
	
	Параметр = СхемаКомпоновки.Параметры.Добавить();
	Параметр.Имя = "ОбъектыОбмена";
	Параметр.ОграничениеИспользования = Истина;
	Параметр.ДоступенСписокЗначений = Истина;
	Если ТипЗнч(Задание.ОбъектыОбмена) = Тип("ТаблицаЗначений") Тогда
		Параметр.Значение = Задание.ОбъектыОбмена;
	Иначе
		Параметр.Значение = Задание.ОбъектыОбмена.Выгрузить();
	КонецЕсли;
	
	Если ДокументСсылка <> Неопределено Тогда
		Параметр = СхемаКомпоновки.Параметры.Добавить();
		Параметр.Имя = "ДокументСсылка";
		Параметр.ОграничениеИспользования = Истина;
		Параметр.ДоступенСписокЗначений = Ложь;
		Параметр.Значение = ДокументСсылка;
	КонецЕсли;
	
	Параметр = СхемаКомпоновки.Параметры.Добавить();
	Параметр.Имя = "КодКлиента";
	Параметр.ОграничениеИспользования = Истина;
	Параметр.ДоступенСписокЗначений = Ложь;
	Параметр.Значение = КодКлиента;
	
	ТекстВыражения = Сред(ТекстВыражения, 2);
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	НаборДанных.Имя = "НаборДанных1";
	НаборДанных.Запрос = "ВЫБРАТЬ
	                     |	1 КАК Поле1
	                     |{ВЫБРАТЬ
	                     |	Поле1}";
						 
	ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновки, "ИмяФайла", "Выразить("+ТекстВыражения+", ""Строка(250)"")");
	
	НастройкиПоУмолчанию = СхемаКомпоновки.НастройкиПоУмолчанию;
	
	Выбор = НастройкиПоУмолчанию.Выбор;
	
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(Выбор, "ИмяФайла");
	ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(Выбор, "Поле1");
	
	НовГруппировка = НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	НовГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиПоУмолчанию,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,,Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Новый ТаблицаЗначений);
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных).ВыгрузитьКолонку("ИмяФайла");
	
	Если Результат.Количество()>0 Тогда
		ВозвращаемоеИмя = СокрЛП(Результат[0]);
		Если ЗначениеЗаполнено(Постфикс) Тогда
			ПозицияТочки = СтрНайти(ВозвращаемоеИмя, ".", НаправлениеПоиска.СКонца);
			Если ПозицияТочки>0 Тогда
				ВозвращаемоеИмя = Сред(ВозвращаемоеИмя,1,ПозицияТочки-1)+Постфикс+Сред(ВозвращаемоеИмя,ПозицияТочки);
			Иначе
				ВозвращаемоеИмя = ВозвращаемоеИмя+Постфикс;
			КонецЕсли;
		КонецЕсли;	
		Возврат ВозвращаемоеИмя;
	Иначе
		Возврат "";
	КонецЕсли;
	 
	//ИмяФайла                     = "";
	//НомерПроизвольногоПараметра  = 0;
	//ПорядковыйНомерФайлаЗаСессию = ПорядковыйНомерФайлаЗаСессию + 1;
	//
	//СтрокаПробелов              = "000000000000000000000000000000000000000000000";
	//
	//// построение имени файла передачи
	//Попытка
	//	Для к = 1 По ВидОбмена.ИмяФайлаПередачи.Количество() Цикл
	//		
	//		Правило             = ВидОбмена.ИмяФайлаПередачи.Найти(к, "НомерСтроки");
	//		
	//		Если (Найти(Нрег(Правило.Значение), "задает")   > 0)  И
	//			(Найти(Нрег(Правило.Значение), "пользоват") > 0) И
	//			(Найти(Нрег(Правило.Значение), "все")       > 0) Тогда
	//			
	//			ЗначениеПоля                = Задание.ПроизвольныеПараметры[НомерПроизвольногоПараметра].Значение;
	//			ДопПробелы                  = Лев(СтрокаПробелов, Задание.ПроизвольныеПараметры[НомерПроизвольногоПараметра].Длина - СтрДлина(ЗначениеПоля));
	//			ИмяФайла                    = ИмяФайла + ЗначениеПоля + ДопПробелы;
	//			НомерПроизвольногоПараметра = НомерПроизвольногоПараметра + 1;
	//			
	//		Иначе
	//			
	//			Длина               = Правило.ДлинаПараметра;
	//			ИмяФайла            = Вычислить("ИмяФайла + Строка(" + Правило.Значение + ")");
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//Исключение
	//	ИмяФайла = "";
	//КонецПопытки;
	//
	//Возврат ИмяФайла;
	
КонецФункции

Функция ЗначениеРеквизита(Знач Элемент, ИмяРеквизита)
	Если ИмяРеквизита<>"" и Элемент<>Неопределено Тогда
		ИмяРеквизита = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяРеквизита, ".");
		Для каждого ТекИмяРеквизита Из ИмяРеквизита Цикл
			Элемент = Элемент[ТекИмяРеквизита];
		КонецЦикла;
	ИначеЕсли ИмяРеквизита = "Наименование" Тогда
		Элемент = Неопределено;
	КонецЕсли;	
	Возврат Элемент;
КонецФункции

// Функция фозвращает имя последнего элемента в заданном пути (Путь)
Функция ИмяПоследнегоВПути(Путь = "")
	
	Поз      = Найти(Путь, "/");
	СокрПуть = Путь;
	
	Пока Поз >0 Цикл
		
		ПослПоз  = Поз;
		СокрПуть = Сред(СокрПуть, ПослПоз + 1);
		Поз      = Найти(СокрПуть, "/");
		
	КонецЦикла;
	
	Если (ПослПоз > 1) И (ПослПоз < СтрДлина(Путь)) Тогда
		ИмяПоследнего = СокрПуть;
		Путь          = Лев(Путь,  СтрДлина(Путь) - СтрДлина(ИмяПоследнего) - 1);
	Иначе
		ИмяПоследнего = "";
	КонецЕсли;
	
	Возврат ИмяПоследнего;
	
КонецФункции

// Функция возвращает ссылку на элемент в документе (Документ),
// описанному выражением XPath (Путь)
Функция ПолучитьЭлементРодитель(Документ, знач Путь, СоответствиеПространствИмен,знач ПрошлыйУзел,КонтекстВыполнения)
	
	//ВыражениеXPath    = Документ.СоздатьВыражениеXPath(Путь, Новый РазыменовательПространствИменDOM(Документ));
	
	ВыражениеXPath    = Документ.СоздатьВыражениеXPath(Путь, Новый РазыменовательПространствИменDOM(СоответствиеПространствИмен));
	Если Лев(Путь,1) = "." Тогда
		Если КонтекстВыполнения<>Неопределено Тогда
			РезультатXPath    = ВыражениеXPath.Вычислить(КонтекстВыполнения);
		Иначе
			РезультатXPath    = ВыражениеXPath.Вычислить(ПрошлыйУзел);
		КонецЕсли;
	Иначе
		РезультатXPath    = ВыражениеXPath.Вычислить(Документ);
	КонецЕсли;
	ЭлементDOM        = РезультатXPath.ПолучитьСледующий();
	
	Если ЭлементDOM   = Неопределено Тогда
		
		ИмяНовогоУзла = ИмяПоследнегоВПути(Путь);
		
		Если ЗначениеЗаполнено(ИмяНовогоУзла) Тогда
			
			Родитель  = ПолучитьЭлементРодитель(Документ, Путь, СоответствиеПространствИмен, ПрошлыйУзел,КонтекстВыполнения);
			
			Если Родитель <> Неопределено Тогда
				
				Если Найти(ИмяНовогоУзла,":")>0 Тогда
					Префикс = Лев(ИмяНовогоУзла,Найти(ИмяНовогоУзла,":")-1);
					URIПоПрефиксу = СоответствиеПространствИмен.Получить(Префикс);
					URIПоПрефиксу = ?(ЗначениеЗаполнено(URIПоПрефиксу),URIПоПрефиксу,"");
					НовыйЭлемент      = Документ.СоздатьЭлемент(URIПоПрефиксу,ИмяНовогоУзла);
				Иначе	
					НовыйЭлемент      = Документ.СоздатьЭлемент(ИмяНовогоУзла);
				КонецЕсли;

				Возврат Родитель.ДобавитьДочерний(НовыйЭлемент);
				
			КонецЕсли;
			
		Иначе
			Возврат "";
		КонецЕсли;
		
	Иначе
		
		Возврат ЭлементDOM;
		
	КонецЕсли;
	
КонецФункции

Процедура ВставитьОшибкуВОписание(ОписаниеОбъекта,ПереченьМодулей)
	Если ПереченьМодулей = Неопределено Тогда
		ПереченьМодулей = "";
	КонецЕсли;
	СтрокаОписания = ОписаниеОбъекта.Добавить();
				
	СтрокаОписания.ПолеФайла = "";
	СтрокаОписания.Ошибка    = НСтр("ru='Используются вызовы запрещенных общих модулей: "+ПереченьМодулей+"'");

КонецПроцедуры

Функция ПолучитьРазрешенныеМодули()
	
	РазрешенныеМодули = Новый Массив;
	РазрешенныеМодули.Добавить(НРег("БиблиотекаФункцийОбмена."));
	РазрешенныеМодули.Добавить(НРег("СтроковыеФункцииКлиентСервер."));  

	Возврат РазрешенныеМодули;
КонецФункции

Процедура ОпределитьВложеннуюТЧПоИмениТЧ(ИмяТЧ,Уровень,ТекТЧ,ОсновнаяТЧ)
	Уровень = 0;
	ТекТЧ = "";
	ПолноеИмя = ИмяТЧ;
	
	Пока Найти(ПолноеИмя, ".") Цикл
		Позиция = Найти(ПолноеИмя, ".");
		ОсновнаяТЧ = Лев(ПолноеИмя,Позиция-1);
		ПолноеИмя = Сред(ПолноеИмя,Позиция+1);
		Уровень = Уровень + 1;
	КонецЦикла;
    ТекТЧ = ПолноеИмя;
КонецПроцедуры

Функция ПроверитьСхему(ОбрабатываемыйФорматСхема,РазрешенныеМодули,МассивВызововОбщихМодулей,ПереченьМодулей)
	Результат = Истина;
	Если ТипЗнч(ОбрабатываемыйФорматСхема) = Тип("СправочникСсылка.ФорматыОбменаБанкиКС") Тогда
		Схема = ОбрабатываемыйФорматСхема.СхемаФорматирования.Получить();
	ИначеЕсли ТипЗнч(ОбрабатываемыйФорматСхема) = Тип("СхемаКомпоновкиДанных") Тогда
		Схема = ОбрабатываемыйФорматСхема;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(Запись,Схема);
	СтрокаСхема = Запись.Закрыть();
	
	ПроверяемыйТекст = НРег(Сред(СтрокаСхема,Найти(СтрокаСхема,"<calculatedField>")));
	ПозицияГраницы = Найти(ПроверяемыйТекст,НРег("<settingsVariant>"));
	Если ПозицияГраницы > 0 Тогда
		ПроверяемыйТекст = Лев(ПроверяемыйТекст,ПозицияГраницы);
	КонецЕсли;
	Для Каждого РазрешенныйМодуль Из РазрешенныеМодули Цикл
		ИндексМодуля = МассивВызововОбщихМодулей.Найти(РазрешенныйМодуль);
		Если ИндексМодуля <> Неопределено Тогда 
			МассивВызововОбщихМодулей.Удалить(ИндексМодуля);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЗапрещенныйМодуль Из МассивВызововОбщихМодулей Цикл
		Если Найти(ПроверяемыйТекст,ЗапрещенныйМодуль)<>0 Тогда
			Результат = Ложь;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Используется запрещенный модуль: "+ЗапрещенныйМодуль+"'"));
			ПереченьМодулей = ПереченьМодулей + ?(ПереченьМодулей="","",", ") + ЗапрещенныйМодуль; 
		КонецЕсли;		
	КонецЦикла;
	//РазрешенныеМодули.Добавить(НРег("ГосУслуги."));
    //надо найти список всех общих модулей, которые используются
	Возврат Результат;
КонецФункции

Процедура ЗагрузитьИсточник_Расшифровка_ВС(Знач Текст, ТаблицаРезультат, ИдентификаторДокумента)
	
	Если ТипЗнч(Текст) <> Тип("ТекстовыйДокумент") Тогда
		ВрТекст = Текст;
		Текст = Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(ВрТекст);
	КонецЕсли;
	
	МассивКолонок = Новый Массив;
	Для каждого ТекКолонка Из ТаблицаРезультат.Колонки Цикл
		МассивКолонок.Добавить(ТекКолонка.Имя);
	КонецЦикла; 
	
	МассивСП 	= Новый Массив; 	// для хранения данных строки SP
	МассивСПД 	= Новый Массив;	// для хранения данных строки SPD
	КоличествоСтрок = Текст.КоличествоСтрок();
	
	Для СчетчикСтрок=1 По КоличествоСтрок Цикл
		
		ТекущаяСтрока = Текст.ПолучитьСтроку(СчетчикСтрок);
		
		Если Лев(ТекущаяСтрока, 3) = "FK|"
			ИЛИ Лев(ТекущаяСтрока, 5) = "FROM|"
			ИЛИ Лев(ТекущаяСтрока, 7) = "SECURE|"
			ИЛИ Лев(ТекущаяСтрока, 3) = "TO|" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Лев(ТекущаяСтрока, 3) = "SP|" Тогда
			МассивСП = СтрРазделить(ТекущаяСтрока, "|");
			МассивСП.Удалить(МассивСП.ВГраница());
		ИначеЕсли Лев(ТекущаяСтрока, 4) = "SPD|" Тогда
			МассивСПД = СтрРазделить(ТекущаяСтрока, "|");
			МассивСПД.Удалить(МассивСПД.ВГраница());
		ИначеЕсли СокрЛП(ТекущаяСтрока) = "" Тогда   //если это пустая строка
			Продолжить;
		Иначе
			МассивСПРР = СтрРазделить(ТекущаяСтрока, "|");
			МассивСПРР.Удалить(МассивСПРР.ВГраница());
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.SP_ID = ИдентификаторДокумента;
			СчетчикКолонок = 0;
			Для СчетчикМассива = 1 По МассивСП.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивСП[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			Для СчетчикМассива = 1 По МассивСПД.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивСПД[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			Для СчетчикМассива = 1 По МассивСПРР.ВГраница() Цикл
				НоваяСтрока[МассивКолонок[СчетчикКолонок]] = МассивСПРР[СчетчикМассива];
				СчетчикКолонок = СчетчикКолонок + 1;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ДополнитьПоляГруппировкиПолямиРасшифровки_ВС(УровеньГруппировки, ПоляРасшифровки, Префикс, ПараметрыТекущейГруппировки, СчетчикПараметровТекущейГруппировки)
	УровеньГруппировки2 = УровеньГруппировки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	УровеньГруппировки2.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	//УровеньГруппировки2.ПараметрыВывода.УстановитьЗначениеПараметра("РасположениеИтогов", РасположениеИтоговКомпоновкиДанных.НачалоИКонец);
	
	УровеньГруппировки3 = УровеньГруппировки2.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	УровеньГруппировки3.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	Для каждого ДобавленоПоле Из ПоляРасшифровки Цикл
		Если Лев(ДобавленоПоле.Поле, 3) = "SP." Тогда
			ДобавленоПолеПутьКДанным = ?(ПустаяСтрока(ДобавленоПоле.ПутьКДанным), ДобавленоПоле.Поле, ДобавленоПоле.ПутьКДанным);
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировки,	Префикс + ДобавленоПолеПутьКДанным);
		
			ПараметрыТекущейГруппировки.Вставить(ДобавленоПолеПутьКДанным, "П"+СчетчикПараметровТекущейГруппировки);
			СчетчикПараметровТекущейГруппировки = СчетчикПараметровТекущейГруппировки + 2;
		ИначеЕсли Лев(ДобавленоПоле.Поле, 4) = "SPD." Тогда
			ДобавленоПолеПутьКДанным = ?(ПустаяСтрока(ДобавленоПоле.ПутьКДанным), ДобавленоПоле.Поле, ДобавленоПоле.ПутьКДанным);
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировки2,	Префикс + ДобавленоПолеПутьКДанным);
		
			ПараметрыТекущейГруппировки.Вставить(ДобавленоПолеПутьКДанным, "П"+СчетчикПараметровТекущейГруппировки);
			СчетчикПараметровТекущейГруппировки = СчетчикПараметровТекущейГруппировки + 2;
		Иначе
			ДобавленоПолеПутьКДанным = ?(ПустаяСтрока(ДобавленоПоле.ПутьКДанным), ДобавленоПоле.Поле, ДобавленоПоле.ПутьКДанным);
			ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(УровеньГруппировки3,	Префикс + ДобавленоПолеПутьКДанным);
		
			ПараметрыТекущейГруппировки.Вставить(ДобавленоПолеПутьКДанным, "П"+СчетчикПараметровТекущейГруппировки);
			СчетчикПараметровТекущейГруппировки = СчетчикПараметровТекущейГруппировки + 2;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

КоличествоДокументовВОдномФайле = 0;
ОбменСЭмулятором = Ложь;
ТестовыйОбмен = Ложь;

#КонецЕсли