
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СтрокаСимволов") Тогда
		Стр = Параметры.СтрокаСимволов;
		
		Если Стр = Символы.ПС Тогда
			СтрокаСимволов = "Перевод строки";
			Элементы.СтрокаСимволов.РедактированиеТекста = ЛОЖЬ;
		ИначеЕсли Стр = Символы.Таб Тогда
			СтрокаСимволов = "Табуляция";
			Элементы.СтрокаСимволов.РедактированиеТекста = ЛОЖЬ;
		ИначеЕсли Стр = Символы.НПП Тогда
			СтрокаСимволов = "Неразрывный пробел";
			Элементы.СтрокаСимволов.РедактированиеТекста = ЛОЖЬ;
		Иначе
			СтрокаСимволов = Стр;
			Элементы.СтрокаСимволов.РедактированиеТекста = ИСТИНА;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаСимволовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Закрыть(ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(СтрокаСимволов);
	
КонецПроцедуры

#КонецОбласти


