#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	// TODO:
	//   - Либо заполнить описание: НастройкиВарианта.Описание = НСтр("ru = ''");
	//   - Либо отключить вариант:  НастройкиВарианта.Включен = Ложь;
	
КонецПроцедуры

Процедура ДобавитьКомандуСравненияДвижений(КомандыОтчетов, Параметры) Экспорт
	
	ТипПараметраКоманды = Метаданные.ОпределяемыеТипы.ДокументыСравнениеДвижений.Тип;
	
	Команда						= КомандыОтчетов.Добавить();
	Команда.Представление		= НСтр("ru = 'Сравнение движений'");
	Команда.МножественныйВыбор	= Ложь;
	Команда.ИмяПараметраФормы	= "";
	Команда.Важность			= "СмТакже";
	Команда.ТипПараметра		= ТипПараметраКоманды;
	Команда.Обработчик			= "ОбщегоНазначенияБГУКлиент.СравнитьДвиженияДокумента";
	Команда.СочетаниеКлавиш		= Новый СочетаниеКлавиш(Клавиша.C, Ложь, Истина, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьОтчет(Документ, СпособВыводаОтчета, ИсключитьРБ = Истина, Группировать = Истина, ДвиженияДокумента = Неопределено) Экспорт
	
	Макет = Отчеты.ДвиженияДокументаБГУ.ПолучитьМакет("Макет");
	
	МетаданныеДокумента = Документ.Метаданные();
	МассивИсключаемыхРегистров = Новый Массив;
	Если ИсключитьРБ И НЕ ТипЗнч(Документ) = Тип("ДокументСсылка.ОперацияБух") Тогда
		МассивИсключаемыхРегистров.Добавить(Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ);
	КонецЕсли;
	Для Каждого МетаданныеРегистра Из МетаданныеДокумента.Движения Цикл
		Если Не ПравоДоступа("Чтение", МетаданныеРегистра) Тогда
			МассивИсключаемыхРегистров.Добавить(МетаданныеРегистра);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаРегистров = Новый ТаблицаЗначений;
	ТаблицаРегистров.Колонки.Добавить("Регистр");
	ТаблицаРегистров.Колонки.Добавить("ВидРегистра");
	ТаблицаРегистров.Колонки.Добавить("Синоним");
	ТаблицаРегистров.Колонки.Добавить("Порядок");
	ТаблицаРегистров.Колонки.Добавить("Пустой");
	
	Для Каждого МетаданныеРегистра Из МетаданныеДокумента.Движения Цикл
		Если МассивИсключаемыхРегистров.Найти(МетаданныеРегистра) = Неопределено Тогда
			ВидРегистра = ОпределитьВидРегистра(МетаданныеРегистра);
			Если ЗначениеЗаполнено(ВидРегистра) Тогда
				НоваяСтрока = ТаблицаРегистров.Добавить();
				НоваяСтрока.Регистр = МетаданныеРегистра;
				НоваяСтрока.ВидРегистра = ВидРегистра;
				НоваяСтрока.Синоним = МетаданныеРегистра.Синоним;
				НоваяСтрока.Порядок = ОпределитьПорядокРегистра(ВидРегистра, МетаданныеРегистра.Имя, МетаданныеРегистра.Синоним);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаРегистров.Сортировать("Порядок,Синоним");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Для Каждого СтрокаРегистров Из ТаблицаРегистров Цикл
		ВывестиДанныеПоРегистру(Документ, СтрокаРегистров, СпособВыводаОтчета, Макет, ТабличныйДокумент, Группировать, ДвиженияДокумента);
	КонецЦикла;
	
	Если Группировать Тогда
		КоличествоВыводимыхРегистров = ТаблицаРегистров.НайтиСтроки(Новый Структура("Пустой", Ложь)).Количество();
		Если КоличествоВыводимыхРегистров > 1 Тогда
			ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(0);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ВывестиДанныеПоРегистру(Документ, СтрокаРегистров, СпособВыводаОтчета, Макет, ТабличныйДокумент, Группировать, ДвиженияДокумента)
	
	МетаданныеРегистра = СтрокаРегистров.Регистр;
	ВидРегистра = СтрокаРегистров.ВидРегистра;
	
	ТаблицаАктивность = Новый ТаблицаЗначений;
	ТаблицаАктивность.Колонки.Добавить("Активность");
	
	Результат = ПолучитьДанныеПоДвижениям(МетаданныеРегистра, ВидРегистра);
	
	ТаблицаРесурсов			= Результат.ТаблицаРесурсов;
	ТаблицаИзмерений		= Результат.ТаблицаИзмерений;
	ТаблицаРеквизитов		= Результат.ТаблицаРеквизитов;
	ТаблицаВидДвижений		= Результат.ТаблицаВидДвижений;
	ТаблицаДанныеДляРасчета	= Результат.ТаблицаДанныеДляРасчета;
	
	ЕстьТаблицаДвижений			= ТаблицаВидДвижений <> Неопределено;
	ЕстьТаблицаДанныеДляРасчета	= ТаблицаДанныеДляРасчета <> Неопределено;
	
	Запрос = Новый Запрос(Результат.ТекстЗапроса);
	Запрос.УстановитьПараметр("Документ", Документ);
	Если ДвиженияДокумента = Неопределено Тогда
		ТаблицаРегистра = Запрос.Выполнить().Выгрузить();
	Иначе
		Если ДвиженияДокумента.Свойство(МетаданныеРегистра.Имя) Тогда
			ТаблицаРегистра = ДвиженияДокумента[МетаданныеРегистра.Имя];
		Иначе
			ТаблицаРегистра = Новый ТаблицаЗначений;
		КонецЕсли;
	КонецЕсли;
	
	КоличествоСтрокРезультата = ТаблицаРегистра.Количество();
	СтрокаРегистров.Пустой = (КоличествоСтрокРезультата = 0);
	
	Если КоличествоСтрокРезультата = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Выборка Из ТаблицаРегистра Цикл
		
		СтрокаАктивность = ТаблицаАктивность.Добавить();
		СтрокаАктивность.Активность = Выборка.Активность;
		
		СтрокаИзмерений  = ТаблицаИзмерений.Добавить();
		СтрокаРеквизитов = ТаблицаРеквизитов.Добавить();
		
		Для Каждого ЭлементАналитики Из Результат.СтруктураПолей.Измерения.МассивРеквизитовАналитики Цикл
			
			СтрокаИзмерений[ЭлементАналитики.Поле] = ПолучитьЗначенияВСтроку(Выборка, ЭлементАналитики.МассивПолей);
			
		КонецЦикла;
		
		Для Каждого ЭлементАналитики Из Результат.СтруктураПолей.Реквизиты.МассивРеквизитовАналитики Цикл
			
			СтрокаРеквизитов[ЭлементАналитики.Поле] = ПолучитьЗначенияВСтроку(Выборка, ЭлементАналитики.МассивПолей);
			
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ТаблицаРесурсов.Добавить(), Выборка, Результат.СтруктураПолей.Ресурсы.СтрокаПолей);
		ЗаполнитьЗначенияСвойств(СтрокаИзмерений,  Выборка, Результат.СтруктураПолей.Измерения.СтрокаПолей);
		ЗаполнитьЗначенияСвойств(СтрокаРеквизитов, Выборка, Результат.СтруктураПолей.Реквизиты.СтрокаПолей);
		
		Если ЕстьТаблицаДвижений Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаВидДвижений.Добавить(), Выборка, "ВидДвижения");
		КонецЕсли;
		
		Если ЕстьТаблицаДанныеДляРасчета Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаДанныеДляРасчета.Добавить(), Выборка, Результат.СтруктураПолей.ДанныеДляРасчета.СтрокаПолей);
		КонецЕсли;
		
	КонецЦикла;
	
	ЦветЗеленый = WebЦвета.Зеленый;
	ЦветКрасный = WebЦвета.Кирпичный;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьЗаголовок.Параметры.СинонимРегистра = НСтр("ru = 'Регистр'") + " " + НРег(ВидРегистра) + " """ + МетаданныеРегистра.Синоним + """";;
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Если Группировать Тогда
		ТабличныйДокумент.НачатьГруппуСтрок();
	КонецЕсли;
	
	Если СпособВыводаОтчета = 2 Тогда
		//По горизонтали
		ОбластьЗаголовок	= Макет.ПолучитьОбласть("ЗаголовокЯчейки");
		ОбластьЯчейка		= Макет.ПолучитьОбласть("Ячейка");
		ОбластьОтступ		= Макет.ПолучитьОбласть("Отступ1");
		
		ТабличныйДокумент.Вывести(ОбластьОтступ);
		
		//Активность
		ОбластьЗаголовок.Параметры.ЗаголовокКолонки = "Активность";
		ТабличныйДокумент.Присоединить(ОбластьЗаголовок);
		Область = ТабличныйДокумент.Область("ЗаголовокЯчейки");
		Область.ШиринаКолонки = 10;
		
		Если ЕстьТаблицаДвижений Тогда
			
			ОбластьЗаголовок.Параметры.ЗаголовокКолонки = "Вид движения";
			ТабличныйДокумент.Присоединить(ОбластьЗаголовок);
			
		КонецЕсли;
		
		Если ЕстьТаблицаДанныеДляРасчета Тогда
			
			ПрисоединитьОбласть(ТабличныйДокумент, ОбластьЗаголовок, ТаблицаДанныеДляРасчета);
			
		КонецЕсли;
		
		ПрисоединитьОбласть(ТабличныйДокумент, ОбластьЗаголовок, ТаблицаИзмерений);
		ПрисоединитьОбласть(ТабличныйДокумент, ОбластьЗаголовок, ТаблицаРесурсов);
		ПрисоединитьОбласть(ТабличныйДокумент, ОбластьЗаголовок, ТаблицаРеквизитов);
		
		Для НомерСтроки = 1 По КоличествоСтрокРезультата Цикл
			
			ТабличныйДокумент.Вывести(ОбластьОтступ);
			//Активность
			ОбластьЯчейка.Параметры.Значение = ТаблицаАктивность[НомерСтроки-1].Активность;
			ТабличныйДокумент.Присоединить(ОбластьЯчейка);
			Область = ТабличныйДокумент.Область("Ячейка");
			Область.ШиринаКолонки = 10;
			
			Если ТаблицаАктивность[НомерСтроки-1].Активность = Ложь Тогда
				Область.ЦветТекста = ЦветКрасный;
			Иначе
				Область.ЦветТекста = ЦветЗеленый;
			КонецЕсли;
			
			//
			Если ЕстьТаблицаДвижений Тогда
				
				ОбластьЯчейка.Параметры.Значение = ТаблицаВидДвижений[НомерСтроки-1].ВидДвижения;
				ТабличныйДокумент.Присоединить(ОбластьЯчейка);
				
				Область = ТабличныйДокумент.Область("Ячейка");
				Область.ШиринаКолонки = 13;
				
				Если ТаблицаВидДвижений[НомерСтроки-1].ВидДвижения = ВидДвиженияНакопления.Расход Тогда
					Область.ЦветТекста = ЦветКрасный;
				Иначе
					Область.ЦветТекста = ЦветЗеленый;
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЕстьТаблицаДанныеДляРасчета Тогда
				ПрисоединитьОбластьПоСтроке(ТабличныйДокумент, ОбластьЯчейка, ТаблицаДанныеДляРасчета[НомерСтроки-1]);
			КонецЕсли;
			
			ПрисоединитьОбластьПоСтроке(ТабличныйДокумент, ОбластьЯчейка, ТаблицаИзмерений[НомерСтроки-1]);
			ПрисоединитьОбластьПоСтроке(ТабличныйДокумент, ОбластьЯчейка, ТаблицаРесурсов[НомерСтроки-1]);
			ПрисоединитьОбластьПоСтроке(ТабличныйДокумент, ОбластьЯчейка, ТаблицаРеквизитов[НомерСтроки-1]);
			
		КонецЦикла;
	Иначе
		// Вывод таблицы
		
		Если ЕстьТаблицаДвижений Тогда
			
			ОбластьШапки                  = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ОбластьДеталиШапки            = Макет.ПолучитьОбласть("ДеталиШапки");
			ОбластьДетали                 = Макет.ПолучитьОбласть("Детали");
			ОбластьШапкиВидДвижения       = Макет.ПолучитьОбласть("ШапкаТаблицыВидДвижения");
			ОбластьДеталиШапкиВидДвижения = Макет.ПолучитьОбласть("ДеталиШапкиВидДвижения");
			ОбластьДеталиВидДвижения      = Макет.ПолучитьОбласть("ДеталиВидДвижения");
			ОбластьОтступ                 = Макет.ПолучитьОбласть("Отступ");
			
		ИначеЕсли ЕстьТаблицаДанныеДляРасчета Тогда
			
			ОбластьШапки       = Макет.ПолучитьОбласть("ШапкаТаблицы2");
			ОбластьДеталиШапки = Макет.ПолучитьОбласть("ДеталиШапки2");
			ОбластьДетали      = Макет.ПолучитьОбласть("Детали2");
			ОбластьОтступ      = Макет.ПолучитьОбласть("Отступ2");
			
		Иначе
			
			ОбластьШапки       = Макет.ПолучитьОбласть("ШапкаТаблицы1");
			ОбластьДеталиШапки = Макет.ПолучитьОбласть("ДеталиШапки1");
			ОбластьДетали      = Макет.ПолучитьОбласть("Детали1");
			ОбластьОтступ      = Макет.ПолучитьОбласть("Отступ2");
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьОтступ);
		//Активность
		ОбластьШапкиАктивность       = Макет.ПолучитьОбласть("ШапкаТаблицыАктивность"+?(ЕстьТаблицаДвижений,"","1"));
		ОбластьДеталиШапкиАктивность = Макет.ПолучитьОбласть("ДеталиШапкиАктивность"+?(ЕстьТаблицаДвижений,"","1"));
		ОбластьДеталиАктивность      = Макет.ПолучитьОбласть("ДеталиАктивность"+?(ЕстьТаблицаДвижений,"","1"));
		
		ТабличныйДокумент.Присоединить(ОбластьШапкиАктивность);
		//
		Если ЕстьТаблицаДвижений Тогда
			ТабличныйДокумент.Присоединить(ОбластьШапкиВидДвижения);
		КонецЕсли;
		
		ТабличныйДокумент.Присоединить(ОбластьШапки);
		
		КоличествоКолонокШапки = Макс(ТаблицаРесурсов.Колонки.Количество(),
			ТаблицаИзмерений.Колонки.Количество(),
			ТаблицаРеквизитов.Колонки.Количество(),
			?(ЕстьТаблицаДанныеДляРасчета, ТаблицаДанныеДляРасчета.Количество(), 0));
		
		ТонкаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
		Для НомерСтроки = 1 По КоличествоКолонокШапки Цикл
			
			СдвигКолонки = 0;
			
			//Данные расчета
			Если ЕстьТаблицаДанныеДляРасчета Тогда
				
				СдвигКолонки = 1;
				ОбластьДеталиШапки.Параметры.ДанныеРасчета = Неопределено;
				Если ТаблицаДанныеДляРасчета.Колонки.Количество() >= НомерСтроки Тогда
					
					ОбластьДеталиШапки.Параметры.ДанныеРасчета = ТаблицаДанныеДляРасчета.Колонки[НомерСтроки-1].Заголовок;
					ОбластьДеталиШапки.Область(1, СдвигКолонки, 1, СдвигКолонки + 1).Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);
					
				Иначе
					ОбластьДеталиШапки.Область(1, СдвигКолонки, 1, СдвигКолонки + 1).Обвести(ТонкаяЛиния,,ТонкаяЛиния,);
				КонецЕсли;
			КонецЕсли;
			
			//Измерения
			ОбластьДеталиШапки.Параметры.Измерения = Неопределено;
			Если ТаблицаИзмерений.Колонки.Количество() >= НомерСтроки Тогда
				
				ОбластьДеталиШапки.Параметры.Измерения = ТаблицаИзмерений.Колонки[НомерСтроки-1].Заголовок;
				ОбластьДеталиШапки.Область(1, СдвигКолонки + 1, 1, СдвигКолонки + 1).Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);
				
			Иначе
				ОбластьДеталиШапки.Область(1, СдвигКолонки + 1, 1, СдвигКолонки + 1).Обвести(ТонкаяЛиния,,ТонкаяЛиния,);
			КонецЕсли;
			
			//Ресурсы
			ОбластьДеталиШапки.Параметры.Ресурсы       = Неопределено;
			Если ТаблицаРесурсов.Колонки.Количество() >= НомерСтроки Тогда
				
				ОбластьДеталиШапки.Параметры.Ресурсы = ТаблицаРесурсов.Колонки[НомерСтроки-1].Заголовок;
				ОбластьДеталиШапки.Область(1, СдвигКолонки + 2, 1, СдвигКолонки + 2).Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);
				
			Иначе
				ОбластьДеталиШапки.Область(1, СдвигКолонки + 2, 1, СдвигКолонки + 2).Обвести(ТонкаяЛиния,,ТонкаяЛиния,);
			КонецЕсли;
			
			//Реквизиты
			ОбластьДеталиШапки.Параметры.Реквизиты     = Неопределено;
			Если ТаблицаРеквизитов.Колонки.Количество() >= НомерСтроки Тогда
				
				ОбластьДеталиШапки.Параметры.Реквизиты = ТаблицаРеквизитов.Колонки[НомерСтроки-1].Заголовок;
				ОбластьДеталиШапки.Область(1, СдвигКолонки + 3, 1, СдвигКолонки + 3).Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);
				
			Иначе
				ОбластьДеталиШапки.Область(1, СдвигКолонки + 3, 1, СдвигКолонки + 3).Обвести(ТонкаяЛиния,,ТонкаяЛиния,);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьОтступ);
			
			//Активность
			ТабличныйДокумент.Присоединить(ОбластьДеталиШапкиАктивность);
			//
			
			Если ЕстьТаблицаДвижений Тогда
				ТабличныйДокумент.Присоединить(ОбластьДеталиШапкиВидДвижения);
			КонецЕсли;
			
			ПрисоединеннаяОбласть = ТабличныйДокумент.Присоединить(ОбластьДеталиШапки);
			
			Если НомерСтроки = КоличествоКолонокШапки Тогда
				
				ПрисоединеннаяОбласть.Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
				//Активность
				ТабличныйДокумент.Область("ДеталиШапкиАктивность"+?(ЕстьТаблицаДвижений,"","1")).Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
				//
				Если ЕстьТаблицаДвижений Тогда
					
					ТабличныйДокумент.Область("ДеталиШапкиВидДвижения").Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Для НомерСтроки = 1 По КоличествоСтрокРезультата Цикл
			
			ВыведенВидДвижения = Ложь;
			ВыведенаАктивность = Ложь;
			
			Для НомерКолонки = 1 По КоличествоКолонокШапки Цикл
				
				СдвигКолонки = 0;
				//Данные расчета
				Если ЕстьТаблицаДанныеДляРасчета Тогда
					
					СдвигКолонки = 1;
					ОбластьДетали.Параметры.ДанныеРасчета = Неопределено;
					ОбластьОбвести = ОбластьДетали.Область(1, СдвигКолонки, 1, СдвигКолонки);
					Если ТаблицаДанныеДляРасчета.Колонки.Количество() >= НомерКолонки Тогда
						
						ИмяКолонки = ТаблицаДанныеДляРасчета.Колонки[НомерКолонки-1].Имя;
						ОбластьДетали.Параметры.ДанныеРасчета = ТаблицаДанныеДляРасчета[НомерСтроки-1][ИмяКолонки];
						ОбластьОбвести.Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);
						
					Иначе
						
						ОбластьОбвести.Обвести(ТонкаяЛиния,, ТонкаяЛиния,); 
						
					КонецЕсли;
				КонецЕсли;
				
				// Измерения
				ОбластьДетали.Параметры.Измерения = Неопределено;
				ОбластьОбвести = ОбластьДетали.Область(1, СдвигКолонки + 1, 1, СдвигКолонки + 1);
				Если ТаблицаИзмерений.Колонки.Количество() >= НомерКолонки Тогда
					
					ИмяКолонки = ТаблицаИзмерений.Колонки[НомерКолонки-1].Имя;
					ОбластьДетали.Параметры.Измерения = ТаблицаИзмерений[НомерСтроки-1][ИмяКолонки];
					ОбластьОбвести.Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);
					
				Иначе
					
					ОбластьОбвести.Обвести(ТонкаяЛиния, , ТонкаяЛиния,);
					
				КонецЕсли;
				
				// Ресурсы.
				ОбластьДетали.Параметры.Ресурсы = Неопределено;
				ОбластьОбвести = ОбластьДетали.Область(1, СдвигКолонки + 2, 1, СдвигКолонки + 2);
				Если ТаблицаРесурсов.Колонки.Количество() >= НомерКолонки Тогда
					
					ИмяКолонки = ТаблицаРесурсов.Колонки[НомерКолонки-1].Имя;
					ОбластьДетали.Параметры.Ресурсы = ТаблицаРесурсов[НомерСтроки-1][ИмяКолонки];
					ОбластьОбвести.Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);
					
				Иначе
					
					ОбластьОбвести.Обвести(ТонкаяЛиния,, ТонкаяЛиния,);
					
				КонецЕсли;
				
				// Реквизиты.
				ОбластьДетали.Параметры.Реквизиты = Неопределено;
				ОбластьОбвести = ОбластьДетали.Область(1, СдвигКолонки + 3, 1, СдвигКолонки + 3);
				Если ТаблицаРеквизитов.Колонки.Количество() >= НомерКолонки Тогда
					
					ИмяКолонки = ТаблицаРеквизитов.Колонки[НомерКолонки-1].Имя;
					ОбластьДетали.Параметры.Реквизиты = ТаблицаРеквизитов[НомерСтроки-1][ИмяКолонки];
					ОбластьОбвести.Обвести(ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния, ТонкаяЛиния);
					
				Иначе
					
					ОбластьОбвести.Обвести(ТонкаяЛиния, , ТонкаяЛиния,);
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьОтступ);
				
				//Активность
				Активность = ?(ВыведенаАктивность, "", ТаблицаАктивность[НомерСтроки-1]["Активность"]);
				
				ОбластьДеталиАктивность.Параметры.Активность = Активность;
				ТабличныйДокумент.Присоединить(ОбластьДеталиАктивность);
				
				Если Не ВыведенаАктивность Тогда
					Если Активность = Ложь Тогда
						ТабличныйДокумент.Область("ДеталиАктивность"+?(ЕстьТаблицаДвижений,"","1")).ЦветТекста = ЦветКрасный;
					Иначе
						ТабличныйДокумент.Область("ДеталиАктивность"+?(ЕстьТаблицаДвижений,"","1")).ЦветТекста = ЦветЗеленый;
					КонецЕсли;
				КонецЕсли;
				
				ВыведенаАктивность = Истина;
				//
				
				Если ЕстьТаблицаДвижений Тогда
					
					ВидДвижения = ?(ВыведенВидДвижения, "", ТаблицаВидДвижений[НомерСтроки-1]["ВидДвижения"]);
					
					ОбластьДеталиВидДвижения.Параметры.ВидДвижения = ВидДвижения;
					ТабличныйДокумент.Присоединить(ОбластьДеталиВидДвижения);
					
					Если Не ВыведенВидДвижения Тогда
						Если ВидДвижения = ВидДвиженияНакопления.Расход Тогда
							ТабличныйДокумент.Область("ДеталиВидДвижения").ЦветТекста = ЦветКрасный;
						Иначе
							ТабличныйДокумент.Область("ДеталиВидДвижения").ЦветТекста = ЦветЗеленый;
						КонецЕсли;
					КонецЕсли;
					
					ВыведенВидДвижения = Истина;
					
				КонецЕсли;
				
				ПрисоединеннаяОбласть = ТабличныйДокумент.Присоединить(ОбластьДетали);
				
				Если НомерКолонки = КоличествоКолонокШапки Тогда
					
					ПрисоединеннаяОбласть.Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
					//Активность
					ТабличныйДокумент.Область("ДеталиАктивность"+?(ЕстьТаблицаДвижений,"","1")).Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
					//
					Если ЕстьТаблицаДвижений Тогда
						
						ТабличныйДокумент.Область("ДеталиВидДвижения").Обвести(ТонкаяЛиния,, ТонкаяЛиния, ТонкаяЛиния);
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если Группировать Тогда
		ТабличныйДокумент.ЗакончитьГруппуСтрок();
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьВидРегистра(МетаданныеРегистра)
	
	Если Метаданные.РегистрыНакопления.Индекс(МетаданныеРегистра) >= 0 Тогда
		ВидРегистра = "Накопления";
	ИначеЕсли Метаданные.РегистрыСведений.Индекс(МетаданныеРегистра) >= 0 Тогда
		ВидРегистра = "Сведений";
	ИначеЕсли Метаданные.РегистрыБухгалтерии.Индекс(МетаданныеРегистра) >= 0 Тогда
		ВидРегистра = "Бухгалтерии";
	ИначеЕсли Метаданные.РегистрыРасчета.Индекс(МетаданныеРегистра) >= 0 Тогда
		ВидРегистра = "Расчета";
	Иначе
		ВидРегистра = "";
	КонецЕсли;
	
	Возврат ВидРегистра;
	
КонецФункции

Функция ОпределитьПорядокРегистра(ВидРегистра, Имя, Синоним)
	
	Если ВидРегистра = "Бухгалтерии" Тогда
		Порядок = 1;
	ИначеЕсли ВидРегистра = "Расчета" Тогда
		Порядок = 2;
	ИначеЕсли ВидРегистра = "Накопления" Тогда
		Порядок = 3;
	ИначеЕсли ВидРегистра = "Сведений" Тогда
		Порядок = 4;
	Иначе
		Порядок = 9; // исключительный вариант
	КонецЕсли;
	
	Если СтрНачинаетсяС(Имя, "Удалить") Тогда
		Порядок = 5;
	ИначеЕсли СтрНачинаетсяС(Синоним, "(не используется)")
		Или СтрНачинаетсяС(Синоним, "(устарел)") Тогда
		Порядок = 6;
	КонецЕсли;
	
	Возврат Порядок;
	
КонецФункции

Функция ПолучитьДанныеПоДвижениям(МетаданныеРегистра, ВидРегистра)
	
	ТаблицаРесурсов			= Новый ТаблицаЗначений;
	ТаблицаИзмерений		= Новый ТаблицаЗначений;
	ТаблицаРеквизитов		= Новый ТаблицаЗначений;
	ТаблицаДанныеДляРасчета	= Неопределено;
	ТаблицаВидДвижений		= Неопределено;
	
	СтруктураПолей = Новый Структура("Измерения, Реквизиты, ДанныеДляРасчета, Ресурсы",
		Новый Структура("СтрокаПолей, МассивРеквизитовАналитики", "", Новый Массив),
		Новый Структура("СтрокаПолей, МассивРеквизитовАналитики", "", Новый Массив),
		Новый Структура("СтрокаПолей, МассивРеквизитовАналитики", "", Новый Массив),
		Новый Структура("СтрокаПолей, МассивРеквизитовАналитики", "", Новый Массив));
	
	ТекстСоединения   = "";
	ТекстПолейВыборки = "";
	
	Для Счетчик = 1 По 2 Цикл
		
		Если Счетчик = 1 Тогда
			ИмяКоллекции = "Измерения";
			ИмяТаблицы = ТаблицаИзмерений;
		Иначе
			ИмяКоллекции = "Реквизиты";
			ИмяТаблицы = ТаблицаРеквизитов;
		КонецЕсли;
		
		Для Каждого Измерение Из МетаданныеРегистра[ИмяКоллекции] Цикл
			
			Если ПолеОтключеноФункциональнойОпцией(Измерение) Тогда
				Продолжить;
			КонецЕсли;
			
			НуженДтКт = (ВидРегистра = "Бухгалтерии") И ИмяКоллекции = "Измерения" И НЕ Измерение.Балансовый;
			
			Если НуженДтКт Тогда
				
				ДобавитьКолонкуВТаблицу(Измерение, ИмяТаблицы, "Дт");
				ДобавитьКолонкуВТаблицу(Измерение, ИмяТаблицы, "Кт");
				
			Иначе
				
				ДобавитьКолонкуВТаблицу(Измерение, ИмяТаблицы);
				
			КонецЕсли;
			
			Если НуженДтКт Тогда
				
				ТекстПоля = " ПРЕДСТАВЛЕНИЕССЫЛКИ(Таблица." + Измерение.Имя + "Дт ) КАК " + Измерение.Имя + "Дт,
					| ПРЕДСТАВЛЕНИЕССЫЛКИ(Таблица." + Измерение.Имя + "Кт ) КАК " + Измерение.Имя + "Кт, ";
				
				СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей
					+ ?(ПустаяСтрока(СтруктураПолей[ИмяКоллекции].СтрокаПолей),"", ",") 
					+ Измерение.Имя + "Дт," + Измерение.Имя + "Кт";
				
			Иначе
				
				ТекстПоля = " ПРЕДСТАВЛЕНИЕССЫЛКИ(Таблица." + Измерение.Имя + " ) КАК " + Измерение.Имя + ", ";
				
				СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей
					+ ?(ПустаяСтрока(СтруктураПолей[ИмяКоллекции].СтрокаПолей),"", ",") + Измерение.Имя;
				
				
			КонецЕсли;
			
			ТекстПолейВыборки = ТекстПолейВыборки + Символы.ПС + ТекстПоля;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ИмяКоллекции = "Ресурсы";
	Для Каждого Ресурс Из МетаданныеРегистра[ИмяКоллекции] Цикл
		
		НуженДтКт = (ВидРегистра = "Бухгалтерии") И Не Ресурс.Балансовый;
		
		Если НуженДтКт Тогда
			
			ТекстПолейВыборки = ТекстПолейВыборки + "
				|Таблица." + Ресурс.Имя + "Дт КАК " + Ресурс.Имя +"Дт,
				|Таблица." + Ресурс.Имя + "Кт КАК " + Ресурс.Имя +"Кт, ";
			
			СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей
				+ ?(ПустаяСтрока(СтруктураПолей[ИмяКоллекции].СтрокаПолей),"", ",")
				+ Ресурс.Имя + "Дт," + Ресурс.Имя + "Кт";
			
			ДобавитьКолонкуВТаблицу(Ресурс, ТаблицаРесурсов, "Дт");
			ДобавитьКолонкуВТаблицу(Ресурс, ТаблицаРесурсов, "Кт");
			
		Иначе
			
			ТекстПолейВыборки = ТекстПолейВыборки + "
				|Таблица." + Ресурс.Имя + " КАК " + Ресурс.Имя +", ";
			
			СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей
				+ ?(ПустаяСтрока(СтруктураПолей[ИмяКоллекции].СтрокаПолей),"", ",") + Ресурс.Имя;
			
			ДобавитьКолонкуВТаблицу(Ресурс, ТаблицаРесурсов);
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Специфические случаи разных регистров.
	Если ВидРегистра = "Накопления"
		И МетаданныеРегистра.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
		
		ТаблицаВидДвижений = Новый ТаблицаЗначений;
		ТаблицаВидДвижений.Колонки.Добавить("ВидДвижения", , "Вид движения");
		
		ТекстПолейВыборки = ТекстПолейВыборки + "Таблица.ВидДвижения КАК ВидДвижения, ";
		
	ИначеЕсли ВидРегистра = "Бухгалтерии" Тогда
		
		ИмяКоллекции = "Измерения";
		ИмяТаблицы   = ТаблицаИзмерений;
		
		СтрокаПолейСчетИСубконто = "";
		
		ДобавитьКолонкиСчетИСубконтоВТаблицу(МетаданныеРегистра.ПланСчетов.МаксКоличествоСубконто,
			ТаблицаИзмерений, СтрокаПолейСчетИСубконто);
		
		СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей
			+ ?(ПустаяСтрока(СтруктураПолей[ИмяКоллекции].СтрокаПолей),"", ",") + СтрокаПолейСчетИСубконто;
		
		ТекстПолейВыборки = ТекстПолейВыборки + "
			|Таблица.СчетДт КАК СчетДт,
			|Таблица.СчетКт КАК СчетКт, ";
		
		Для НомерСубконто = 1 По МетаданныеРегистра.ПланСчетов.МаксКоличествоСубконто Цикл
			
			ТекстПолейВыборки = ТекстПолейВыборки + "
			|ПРЕДСТАВЛЕНИЕССЫЛКИ(Таблица.СубконтоДт" + НомерСубконто + ") КАК СубконтоДт" + НомерСубконто + ",
			|ПРЕДСТАВЛЕНИЕССЫЛКИ(Таблица.СубконтоКт" + НомерСубконто + ") КАК СубконтоКт" + НомерСубконто + ",";
			
		КонецЦикла;
		
	ИначеЕсли ВидРегистра = "Расчета" Тогда
		
		ТаблицаДанныеДляРасчета = Новый ТаблицаЗначений;
		
		ИмяКоллекции = "ДанныеДляРасчета";
		ИмяТаблицы   = ТаблицаДанныеДляРасчета;
		
		ДобавитьКолонкуПериодВТаблицу(ИмяТаблицы, "ВидРасчета", "Вид расчета");
		СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей + " ВидРасчета";
		
		ДобавитьКолонкуПериодВТаблицу(ИмяТаблицы, "ПериодРегистрации", "Период регистрации");
		СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей + ", ПериодРегистрации";
		
		ДобавитьКолонкуПериодВТаблицу(ИмяТаблицы, "Сторно", "Сторно");
		СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей + ", Сторно";
		
		ТекстПолейВыборки = ТекстПолейВыборки + "
			|Таблица.ВидРасчета КАК ВидРасчета,
			|Таблица.Сторно КАК Сторно,
			|Таблица.ПериодРегистрации КАК ПериодРегистрации, ";
		
		Если МетаданныеРегистра.БазовыйПериод Тогда
			
			ТекстПолейВыборки = ТекстПолейВыборки + "
				|Таблица.БазовыйПериодНачало КАК БазовыйПериодНачало,
				|Таблица.БазовыйПериодКонец КАК БазовыйПериодКонец,";
			
			ДобавитьКолонкуПериодВТаблицу(ИмяТаблицы, "БазовыйПериодНачало", "Базовый период начало");
			СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей + ", БазовыйПериодНачало";
			ДобавитьКолонкуПериодВТаблицу(ИмяТаблицы, "БазовыйПериодКонец", "Базовый период конец");
			СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей + ", БазовыйПериодКонец";
			
		КонецЕсли;
		
		Если МетаданныеРегистра.ПериодДействия Тогда
			
			ТекстПолейВыборки = ТекстПолейВыборки + "
				|Таблица.ПериодДействияНачало КАК ПериодДействияНачало,
				|Таблица.ПериодДействияКонец КАК ПериодДействияКонец,";
			
			ДобавитьКолонкуПериодВТаблицу(ИмяТаблицы, "ПериодДействияНачало", "Период действия начало");
			СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей + ", ПериодДействияНачало";
			ДобавитьКолонкуПериодВТаблицу(ИмяТаблицы, "ПериодДействияКонец", "Период действия конец");
			СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей + ", ПериодДействияКонец";
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЕстьПериод = Истина;
	Если (ВидРегистра = "Сведений" И МетаданныеРегистра.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический)
		Или ВидРегистра = "Расчета" Тогда
		
		ЕстьПериод = Ложь;
		
	КонецЕсли;
	
	Если ЕстьПериод Тогда
		
		ТекстПолейВыборки = ТекстПолейВыборки + "
			|Таблица.Период КАК Период, ";
		
		ИмяКоллекции = "Измерения";
		ИмяТаблицы   = ТаблицаИзмерений;
		
		ДобавитьКолонкуПериодВТаблицу(ТаблицаИзмерений);
		СтруктураПолей[ИмяКоллекции].СтрокаПолей = СтруктураПолей[ИмяКоллекции].СтрокаПолей + ", Период";
		
	КонецЕсли;
	
	ТекстПолейВыборки = ТекстПолейВыборки + "
		|Таблица.Активность КАК Активность,
		|Таблица.НомерСтроки КАК НомерСтроки";
	
	ТекстЗапроса =
	"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|" + ТекстПолейВыборки + "
	|ИЗ
	|	" + МетаданныеРегистра.ПолноеИмя() + ?(ВидРегистра = "Бухгалтерии", ".ДвиженияССубконто", "") + " КАК Таблица 
	|" + ТекстСоединения + "
	|ГДЕ
	|	Таблица.Регистратор = &Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстЗапроса"				, ТекстЗапроса);
	Результат.Вставить("СтруктураПолей"				, СтруктураПолей);
	Результат.Вставить("ТаблицаРесурсов"			, ТаблицаРесурсов);
	Результат.Вставить("ТаблицаИзмерений"			, ТаблицаИзмерений);
	Результат.Вставить("ТаблицаРеквизитов"			, ТаблицаРеквизитов);
	Результат.Вставить("ТаблицаВидДвижений"			, ТаблицаВидДвижений);
	Результат.Вставить("ТаблицаДанныеДляРасчета"	, ТаблицаДанныеДляРасчета);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьКолонкуВТаблицу(МетаданныеПоля, ТаблицаПолей, Постфикс = "")
	
	ТаблицаПолей.Колонки.Добавить(МетаданныеПоля.Имя + Постфикс, , МетаданныеПоля.Синоним + ?(Постфикс = "", "", " ") + Постфикс);
	
КонецПроцедуры

Процедура ДобавитьКолонкуПериодВТаблицу(ТаблицаПолей, Колонка = "Период", ПредставлениеКолонки = "Период")
	
	ТаблицаПолей.Колонки.Добавить(Колонка, , ПредставлениеКолонки);
	
КонецПроцедуры

Процедура ПрисоединитьОбласть(ТабличныйДокумент, ОбластьМакета, Таблица)
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		
		ОбластьМакета.Параметры.ЗаголовокКолонки = Колонка.Заголовок;
		ТабличныйДокумент.Присоединить(ОбластьМакета);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрисоединитьОбластьПоСтроке(ТабличныйДокумент, Область, СтрокаТаблицы)
	
	Для Каждого Колонка Из СтрокаТаблицы.Владелец().Колонки Цикл
		
		Область.Параметры.Значение = СтрокаТаблицы[Колонка.Имя];
		ТабличныйДокумент.Присоединить(Область);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолеОтключеноФункциональнойОпцией(МетаданныеПоля)
	
	Результат = Ложь;
	
	Если Метаданные.ФункциональныеОпции.ИспользоватьУчетПоИФО.Состав.Содержит(МетаданныеПоля) Тогда
		
		Результат = Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
		
	ИначеЕсли Метаданные.ФункциональныеОпции.ИспользоватьУчетПоПодразделениям.Состав.Содержит(МетаданныеПоля) Тогда
		
		Результат = Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
		
	ИначеЕсли Метаданные.ФункциональныеОпции.ИспользоватьВалютныйУчет.Состав.Содержит(МетаданныеПоля) Тогда
		
		Результат = Не ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
		
	ИначеЕсли Метаданные.ФункциональныеОпции.ВидимостьУдаленныхРеквизитов.Состав.Содержит(МетаданныеПоля) Тогда
		
		Результат = Не ПолучитьФункциональнуюОпцию("ВидимостьУдаленныхРеквизитов");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначенияВСтроку(ВыбокаДанных, МассивПолей)
	
	Результат = "";
	Для Каждого ИмяПоля Из МассивПолей Цикл
		Если ЗначениеЗаполнено(ВыбокаДанных[ИмяПоля]) Тогда
			
			Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + ВыбокаДанных[ИмяПоля];
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьКолонкиСчетИСубконтоВТаблицу(МаксКоличествоСубконто, ТаблицаПолей, СтрокаПолейСчетИСубконто)
	
	ТаблицаПолей.Колонки.Добавить("СчетДт", , "Счет Дт");
	СтрокаПолейСчетИСубконто = "СчетДт";
	
	Для НомерСубконто = 1 По МаксКоличествоСубконто Цикл
		ТаблицаПолей.Колонки.Добавить("СубконтоДт" + НомерСубконто, , "Субконто" + НомерСубконто + " Дт");
		СтрокаПолейСчетИСубконто = СтрокаПолейСчетИСубконто + "," + "СубконтоДт" + НомерСубконто;
	КонецЦикла;
	
	ТаблицаПолей.Колонки.Добавить("СчетКт", , "Счет Кт");
	СтрокаПолейСчетИСубконто = СтрокаПолейСчетИСубконто + ",СчетКт";
	
	Для НомерСубконто = 1 По МаксКоличествоСубконто Цикл
		ТаблицаПолей.Колонки.Добавить("СубконтоКт" + НомерСубконто, , "Субконто" + НомерСубконто + " Кт");
		СтрокаПолейСчетИСубконто = СтрокаПолейСчетИСубконто + "," + "СубконтоКт" + НомерСубконто;
	КонецЦикла;
	
КонецПроцедуры

Функция СравнитьДвиженияДокумента(Документ) Экспорт
	
	ДвиженияДокумента = Новый Структура;
	
	ДокументПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Проведен");
	
	ТаблицыДляДвижений = Новый Структура;
	ДопСвойства = Новый Структура("ТаблицыДляДвижений", ТаблицыДляДвижений);
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ);
	
	Попытка
		Менеджер.ИнициализироватьДанныеДокумента(Документ, ДопСвойства);
	Исключение
	КонецПопытки;
	
	Если ТаблицыДляДвижений.Количество() > 0 Тогда
		мДвижения = Метаданные.Документы[Документ.Метаданные().Имя].Движения;
		Для Каждого мТаблицаДвижений Из мДвижения Цикл
			ИмяТаблицы = мТаблицаДвижений.Имя;
			Если ТаблицыДляДвижений.Свойство(ИмяТаблицы) Тогда
				Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(мТаблицаДвижений.ПолноеИмя());
				НаборЗаписей = Менеджер.СоздатьНаборЗаписей();
				НаборЗаписей.Загрузить(ТаблицыДляДвижений[ИмяТаблицы]);
				Если Не ДокументПроведен Тогда
					НаборЗаписей.УстановитьАктивность(Ложь);
				КонецЕсли;
				ДвиженияДокумента.Вставить(ИмяТаблицы, НаборЗаписей.Выгрузить());
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Проводки = Обработки.ФормированиеБухгалтерскихПроводок.СформироватьТаблицуПроводок(Документ);
	Если Проводки <> Неопределено Тогда
		
		Если Проводки.Колонки.Найти("ВидМежотчетногоПериода") = Неопределено Тогда
			Проводки.Колонки.Добавить("ВидМежотчетногоПериода");
		КонецЕсли;
		Если Не ДокументПроведен Тогда
			Проводки.ЗаполнитьЗначения(Ложь, "Активность");
		КонецЕсли;
		БухгалтерскийУчет.ОчиститьРеквизитыПроводокПоПризнакамУчета(Проводки);
		ДвиженияДокумента.Вставить("ЖурналПроводокЕПСБУ", Проводки);
		
		ПроводкиРБ = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СоздатьНаборЗаписей();
		ПроводкиРБ.Загрузить(Проводки);
		Если ДопСвойства.Свойство("НеФормироватьУчетныеДанныеИзПроводок") Тогда
			ПроводкиРБ.ДополнительныеСвойства.Вставить("НеФормироватьУчетныеДанныеИзПроводок");
		КонецЕсли;
		
		РегистрыСведений.УчетныеДанныеОбъектаОС.СформироватьДвиженияПоРегистру(Документ, ПроводкиРБ, ДвиженияДокумента);
		УчетУСН.СформироватьДвиженияПоНалоговомуУчетуУСН(Документ, ПроводкиРБ, ДвиженияДокумента);
		
	КонецЕсли;
	
	ТабДокДвиженияДокумента		= СформироватьОтчет(Документ, 2, Ложь, Ложь);
	ТабДокДвиженияПроведением	= СформироватьОтчет(Документ, 2, Ложь, Ложь, ДвиженияДокумента);
	
	ТабДоки = Новый Структура("Левый,Правый", ТабДокДвиженияДокумента, ТабДокДвиженияПроведением);
	
	Данные = Новый Структура;
	Данные.Вставить("АдресТабличныхДокументов", ПоместитьВоВременноеХранилище(ТабДоки));
	Данные.Вставить("ЗаголовокЛевый" , "Движения документа");
	Данные.Вставить("ЗаголовокПравый", "Движения проведением");
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#КонецЕсли