
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация)
		И Параметры.Свойство("НаДату") И ЗначениеЗаполнено(Параметры.НаДату) Тогда
		
		УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(Параметры.Организация, Параметры.НаДату);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтатусыОперацийНачисленияДоходов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатусыОперацийНачисленияДоходов КАК СтатусыОперацийНачисленияДоходов
		|ГДЕ
		|	&УсловиеПоКоду";
		
		Если УчетнаяПолитика.ФорматКодаСтатусовОперацийНачисленияДоходов = 0 Тогда // Код в формате 0Y.XX (старый формат кода).
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКоду", "ПОДСТРОКА(СтатусыОперацийНачисленияДоходов.Код, 0, 1) = ""0""");
		Иначе // Код в формате ZY.XX.
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКоду", "НЕ ПОДСТРОКА(СтатусыОперацийНачисленияДоходов.Код, 0, 1) = ""0""");
		КонецЕсли;
		
		СтатусыОперацийНачисленияДоходов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		СписокСтатусыОпераций = Новый СписокЗначений;
		СписокСтатусыОпераций.ЗагрузитьЗначения(СтатусыОперацийНачисленияДоходов);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", СписокСтатусыОпераций,
			ВидСравненияКомпоновкиДанных.ВСписке, "Отбор по формату кода", Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, "ОтборПоФорматуКода");
		
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийСтатусОперации") И ЗначениеЗаполнено(Параметры.ТекущийСтатусОперации) Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.ТекущийСтатусОперации;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

