
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
	Список, 
	"ПризнакНацПроекта", 
	"_______[" + БюджетнаяКлассификацияКлиентСервер.СтрокаКодовНацПроектов('20241231') + "]_________"); 
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
	Список, 
	"ПризнакНацПроекта2025", 
	"_______[" + БюджетнаяКлассификацияКлиентСервер.СтрокаКодовНацПроектов() + "]_________");
	
	БухгалтерскиеОперацииСервер.УстановитьОтборСпискаИзНастроекКомпоновки(Список, Параметры);
	
	БухгалтерскийУчет.ПриСозданииНаСервереФормыВыбораКПС(Отказ, ЭтотОбъект);
	УстановитьДополнительныйОтборКПС();
	Если ТекстДополнительныйОтбор = "" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТекстДополнительныйОтбор",
			"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДополнительныйОтборВключен",
			"Видимость", Ложь);
	КонецЕсли;
	
	БюджетнаяКлассификация.УстановитьУсловноеОформлениеПоляВидКПСБУАУВСписке(Список);
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	
	БюджетнаяКлассификацияКлиентСервер.УстановитьОтборНаДату(ЭтаФорма,НаДату);

КонецПроцедуры

&НаКлиенте
Процедура ДополнительныйОтборВключенПриИзменении(Элемент)
	УстановитьИспользованиеДополнительногоОтбора();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ ИНФОРМАЦИОННЫЙ ЦЕНТР

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Группа Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ПараметрыОтбора = Новый Структура;
	
	Для Каждого ЭлементКомпоновки ИЗ Список.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементКомпоновки) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если  ЭлементКомпоновки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидПоказателя") Тогда
			ПараметрыОтбора.Вставить("ОтборВидПоказателя", Новый Структура("ВидСравнения, ЗначениеОтбора", ЭлементКомпоновки.ВидСравнения, ЭлементКомпоновки.ПравоеЗначение));	
			//Прервать;
		ИначеЕсли ЭлементКомпоновки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РазделПодразделКРБ") Тогда
			ПараметрыОтбора.Вставить("РазделПодразделКРБ", ЭлементКомпоновки.ПравоеЗначение);
		ИначеЕсли ЭлементКомпоновки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦелеваяСтатьяКРБ") Тогда
			ПараметрыОтбора.Вставить("ЦелеваяСтатьяКРБ", ЭлементКомпоновки.ПравоеЗначение);
		ИначеЕсли ЭлементКомпоновки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПрограммаЦелевойСтатьиКРБ") Тогда
			ПараметрыОтбора.Вставить("ПрограммаЦелевойСтатьиКРБ", ЭлементКомпоновки.ПравоеЗначение);
		ИначеЕсли ЭлементКомпоновки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидРасходаКРБ") Тогда
			ПараметрыОтбора.Вставить("ГруппаВР", ЭлементКомпоновки.ПравоеЗначение);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОтбора.Вставить("НаДату", НаДату);	
			
	ОткрытьФорму("Справочник.КлассификационныеПризнакиСчетов.ФормаОбъекта", ПараметрыОтбора, Элемент);		
			
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДополнительныйОтборКПС()
	
	Если ПустаяСтрока(ВидыПоказателей) Или СтрНайти(ВидыПоказателей, ";") > 0 Или СтрНайти(ВидыПоказателей, "АУ и БУ") > 0 Тогда
		// Отключаемый отбор пока устанавливается только в случае использования одного вида показателя
		// и не используется для АУиБУ
		Возврат;
	КонецЕсли;
	
	ОтключаемыйОтбор = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОтключаемыйОтбор");
	Если ОтключаемыйОтбор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаОтключаемогоОтбора = ГруппаОтключаемогоОтбора();
	МетаданныеСправочника = Метаданные.Справочники.КлассификационныеПризнакиСчетов;
	ЭлементыДополнительногоОтбора = Новый Массив;
	Для Каждого ЭлементОтбора Из ОтключаемыйОтбор Цикл
		РеквизитСправочника = МетаданныеСправочника.Реквизиты.Найти(ЭлементОтбора.Ключ);
		Если РеквизитСправочника <> Неопределено Тогда
			ТипРеквизита = РеквизитСправочника.Тип;
			ЗначениеЭлемента = БухгалтерскийУчет.ЗначениеЭлементаОтбора(ТипРеквизита, ЭлементОтбора.Значение);
			УстановитьЭлементОтключаемогоОтбора(ГруппаОтключаемогоОтбора, ЭлементОтбора.Ключ, ЗначениеЭлемента);
			ЭлементыДополнительногоОтбора.Добавить(РеквизитСправочника.Синоним + "(" + ЭлементОтбора.Значение + ")");
		КонецЕсли;
	КонецЦикла;

	ТекстДополнительныйОтбор = СтрСоединить(ЭлементыДополнительногоОтбора, ", ");
	Элементы.ГруппаДополнительныйОтбор.ЗаголовокСвернутогоОтображения =
		Элементы.ГруппаДополнительныйОтбор.Заголовок + ": " + ТекстДополнительныйОтбор;
	ДополнительныйОтборВключен = Истина;
	УстановитьИспользованиеДополнительногоОтбора();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭлементОтключаемогоОтбора(ГруппаОтбора, ИмяЭлементаОтбора, ЗначениеЭлементаОтбора)
	
	Если ТипЗнч(ЗначениеЭлементаОтбора) = Тип("Массив") Тогда
		ИспользуемыйВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Иначе
		ИспользуемыйВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора,
		ИмяЭлементаОтбора,
		ЗначениеЭлементаОтбора,
		ИспользуемыйВидСравнения,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

&НаСервере
Функция ГруппаОтключаемогоОтбора()
	ПредставлениеГруппыОтбора = "ДополнительныйОтбор";
	ОтборСписка = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
	ГруппаОтбора = Неопределено;
	Для Каждого ЭлементОтбора Из ОтборСписка.Элементы Цикл
		Если ЭлементОтбора.Представление = ПредставлениеГруппыОтбора Тогда
			ГруппаОтбора = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ГруппаОтбора = Неопределено Тогда
		ГруппаОтбора = ОтборСписка.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ГруппаОтбора.Представление = ПредставлениеГруппыОтбора;
		ГруппаОтбора.Использование = Ложь;
	КонецЕсли;
	Возврат ГруппаОтбора;
КонецФункции

&НаСервере
Процедура УстановитьИспользованиеДополнительногоОтбора()
	ГруппаОтбора = ГруппаОтключаемогоОтбора();
	ГруппаОтбора.Использование = ДополнительныйОтборВключен;
КонецПроцедуры

#КонецОбласти