////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
//Если заполнение не используется то код процедур нужно закомментировать  

Процедура РасшифроватьАвтозаполнение(ФормаОтчета, АдресТаблицыПоказателей) Экспорт
	

	ЗаполнениеОтчетностиФормаОтчетаКлиент.РасшифроватьАвтозаполнение(ФормаОтчета, АдресТаблицыПоказателей);

	
КонецПроцедуры

Процедура ВыполнитьДействиеКоманды(Команда,ФормаОтчета) Экспорт


	ЗаполнениеОтчетностиФормаОтчетаКлиент.ВыполнитьДействиеКоманды(Команда,ФормаОтчета);

	
КонецПроцедуры

Процедура ВывестиРазделСправки(Команда,ФормаОтчета) Экспорт
	

	ЗаполнениеОтчетностиФормаОтчетаКлиент.ВывестиРазделСправки(Команда,ФормаОтчета);

	
КонецПроцедуры

Процедура ВвестиПараметрыИВыполнитьДействиеКоманды(Команда, ФормаОтчета, ОбработкаЗавершения) Экспорт
	

	ЗаполнениеОтчетностиФормаОтчетаКлиент.ВвестиПараметрыИВыполнитьДействиеКоманды(Команда, ФормаОтчета, ОбработкаЗавершения);

	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Информационные ссылки

Процедура НажатиеНаИнформационнуюСсылку(Форма, ЭлементФормы) Экспорт 
	

	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(Форма, ЭлементФормы);	

	
КонецПроцедуры

Процедура НажатиеНаСсылкуВсеИнформационныеСсылки(ИмяФормы) Экспорт 
	

	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ИмяФормы);	

	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// прочее

Процедура ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещенияОЗакрытии, ТекстПредложения = "", 
	ВозможноПродолжениеБезУстановки = Истина) Экспорт
	

		
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещенияОЗакрытии, ТекстПредложения, ВозможноПродолжениеБезУстановки);
		

	
КонецПроцедуры	

