
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Отчет, Параметры);
	
	Если НЕ ЗначениеЗаполнено(Отчет.Организация) Тогда
		Отчет.Организация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		Отчет.НачалоПериода = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Отчет.КонецПериода = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.ФондовыеОрдера) Тогда
		Отчет.ФондовыеОрдера=1;
	КонецЕсли;
	
	РегистрыУчета.ПриСозданииНаСервере(ЭтотОбъект, "ГруппаДополнительныхКоманд");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоВсемОрганизациямПриИзменении(Элемент)
	
	Если Отчет.ПоВсемОрганизациям Тогда
		
		Отчет.Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Отчет.Подразделение = ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка");
		
	КонецЕсли;	
	
	Элементы.Организация.Доступность = НЕ Отчет.ПоВсемОрганизациям;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Подразделение", "Доступность", НЕ Отчет.ПоВсемОрганизациям);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Отказ = Ложь;
	
	Очиститьсообщения();
	
	СформироватьОтчетСервер(Отказ);
	
	Если Отказ Тогда
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Нет данных для печати. Проверьте параметры отчета.'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	
	ЗначениеПериода = Новый СтандартныйПериод(Отчет.НачалоПериода, Отчет.КонецПериода); 
	
	Диалог.Период = ЗначениеПериода;
	
	Обработчик = Новый ОписаниеОповещения("УстановитьПериодЗавершение", ЭтотОбъект); 
	
	Диалог.Показать(Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("СтандартныйПериод") Тогда
		Отчет.НачалоПериода = РезультатВыбора.ДатаНачала;
		Отчет.КонецПериода  = РезультатВыбора.ДатаОкончания;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ГРУППЫ РЕГИСТРЫ УЧЕТА

&НаКлиенте
Процедура Подключаемый_Команда(Команда)
	
	РегистрыУчетаКлиент.ОбработчикКомандыРаботыСРегистромУчета(ЭтотОбъект, Команда, "ЖурналРегистрации");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура вызывает заполнение отчета. В случае формирования по одной
// организации, удаляются все дополнительные закладки и таблицы с формы,
// кроме стандартных.
// В случае формирования отчета по всем организациям, закладка Кассовая книга
// прячется и на форме создаются закладки и таблицы для каждой организации.
// 
&НаСервере
Процедура СформироватьОтчетСервер(Отказ)
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНачала", 		НачалоДня(Отчет.НачалоПериода));
	Запрос.УстановитьПараметр("ДатаКонца", 			КонецДня(Отчет.КонецПериода));
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", Отчет.ПоВсемОрганизациям);
	Запрос.УстановитьПараметр("Организация", 		Отчет.Организация);
	Запрос.УстановитьПараметр("ЕстьПодразделение", 	ЗначениеЗаполнено(Отчет.Подразделение));
	Запрос.УстановитьПараметр("Подразделение", 		Отчет.Подразделение);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриходныйКассовыйОрдер.Ссылка,
	|	""Приходный"" КАК ТипОрдера,
	|	ПриходныйКассовыйОрдер.Организация,
	|	ВЫБОР
	|		КОГДА ПриходныйКассовыйОрдер.Подразделение.ВедетсяКассоваяКнига
	|			ТОГДА ПриходныйКассовыйОрдер.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ПриходныйКассовыйОрдер.Дата,
	|	ПриходныйКассовыйОрдер.Номер,
	|	ПриходныйКассовыйОрдер.СуммаДокумента КАК Сумма,
	|	ВЫБОР
	|		КОГДА ПриходныйКассовыйОрдер.Аннулирован
	|			ТОГДА ""АННУЛИРОВАН""
	|		ИНАЧЕ ПриходныйКассовыйОрдер.ПринятоОт
	|	КОНЕЦ КАК Примечание,
	|	ВЫБОР
	|		КОГДА ПриходныйКассовыйОрдер.Аннулирован
	|			ТОГДА """"
	|		ИНАЧЕ ПриходныйКассовыйОрдер.Основание
	|	КОНЕЦ КАК Основание
	|ПОМЕСТИТЬ ВсеОрдера
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И (&ЕстьПодразделение
	|				И ПриходныйКассовыйОрдер.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ПриходныйКассовыйОрдер.Подразделение ЕСТЬ NULL 
	|					ИЛИ ПриходныйКассовыйОрдер.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ ПриходныйКассовыйОрдер.Подразделение.ВедетсяКассоваяКнига)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (НЕ &ПоВсемОрганизациям
	|				И ПриходныйКассовыйОрдер.Организация = &Организация
	|			ИЛИ &ПоВсемОрганизациям)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Ссылка,
	|	""Расходный"",
	|	РасходныйКассовыйОрдер.Организация,
	|	ВЫБОР
	|		КОГДА РасходныйКассовыйОрдер.Подразделение.ВедетсяКассоваяКнига
	|			ТОГДА РасходныйКассовыйОрдер.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ,
	|	РасходныйКассовыйОрдер.Дата,
	|	РасходныйКассовыйОрдер.Номер,
	|	РасходныйКассовыйОрдер.СуммаДокумента,
	|	ВЫБОР
	|		КОГДА РасходныйКассовыйОрдер.Аннулирован
	|			ТОГДА ""АННУЛИРОВАН""
	|		ИНАЧЕ РасходныйКассовыйОрдер.Выдать
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасходныйКассовыйОрдер.Аннулирован
	|			ТОГДА """"
	|		ИНАЧЕ РасходныйКассовыйОрдер.Основание
	|	КОНЕЦ
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И (&ЕстьПодразделение
	|				И РасходныйКассовыйОрдер.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (РасходныйКассовыйОрдер.Подразделение ЕСТЬ NULL 
	|					ИЛИ РасходныйКассовыйОрдер.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ РасходныйКассовыйОрдер.Подразделение.ВедетсяКассоваяКнига)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (НЕ &ПоВсемОрганизациям
	|				И РасходныйКассовыйОрдер.Организация = &Организация
	|			ИЛИ &ПоВсемОрганизациям)";
	
	Если Отчет.ФондовыеОрдера = 2 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПриходныйКассовыйОрдер", "Документ.ПриходныйОрдерФондовый");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РасходныйКассовыйОрдер", "Документ.РасходныйОрдерФондовый");
		
	Иначе
		
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВедомостьНаВыдачуДенегИзКассы.Ссылка,
		|	""Расходный"",
		|	ВедомостьНаВыдачуДенегИзКассы.Организация,
		|	ВЫБОР
		|		КОГДА ВедомостьНаВыдачуДенегИзКассы.Подразделение.ВедетсяКассоваяКнига
		|			ТОГДА ВедомостьНаВыдачуДенегИзКассы.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВедомостьНаВыдачуДенегИзКассы.Дата,
		|	ВедомостьНаВыдачуДенегИзКассы.Номер,
		|	ВедомостьНаВыдачуДенегИзКассы.СуммаВыплачено,
		|	ВЫБОР
		|		КОГДА ВедомостьНаВыдачуДенегИзКассы.Аннулирован
		|			ТОГДА ""АННУЛИРОВАН""
		|		ИНАЧЕ ВедомостьНаВыдачуДенегИзКассы.Основание
		|	КОНЕЦ,
		|   """"
		|ИЗ
		|	Документ.ВедомостьНаВыдачуДенегИзКассы КАК ВедомостьНаВыдачуДенегИзКассы
		|ГДЕ
		|	ВедомостьНаВыдачуДенегИзКассы.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
		|	И (&ЕстьПодразделение
		|				И ВедомостьНаВыдачуДенегИзКассы.Подразделение = &Подразделение
		|			ИЛИ НЕ &ЕстьПодразделение
		|				И (ВедомостьНаВыдачуДенегИзКассы.Подразделение ЕСТЬ NULL 
		|					ИЛИ ВедомостьНаВыдачуДенегИзКассы.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|					ИЛИ НЕ ВедомостьНаВыдачуДенегИзКассы.Подразделение.ВедетсяКассоваяКнига)
		|			ИЛИ &ПоВсемОрганизациям)
		|	И (НЕ &ПоВсемОрганизациям
		|				И ВедомостьНаВыдачуДенегИзКассы.Организация = &Организация
		|			ИЛИ &ПоВсемОрганизациям)";
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеОрдера.Организация КАК Организация,
	|	ВсеОрдера.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ОрганизацииПодразделения
	|ИЗ
	|	ВсеОрдера КАК ВсеОрдера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииПодразделения.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ОрганизацииПодразделения.Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование
	|			ТОГДА ОрганизацииПодразделения.Организация.НаименованиеСокращенное
	|		КОГДА ОрганизацииПодразделения.Организация.НаименованиеПолное = """"
	|			ТОГДА ОрганизацииПодразделения.Организация.Наименование
	|		ИНАЧЕ ОрганизацииПодразделения.Организация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ОрганизацииПодразделения.Организация.Наименование КАК ОргНаименование,
	|	ОрганизацииПодразделения.Организация.Код КАК ОргКод,
	|	ОрганизацииПодразделения.Организация.КодОКПО КАК КодОКПО,
	|	ОрганизацииПодразделения.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОрганизацииПодразделения.Подразделение.НаименованиеПолное, """") = """"
	|			ТОГДА ЕСТЬNULL(ОрганизацииПодразделения.Подразделение.Наименование, """")
	|		ИНАЧЕ ОрганизацииПодразделения.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеПодразделения,
	|	ЕСТЬNULL(ОрганизацииПодразделения.Подразделение.Наименование, """") КАК ПодрНаименование,
	|	ЕСТЬNULL(ОрганизацииПодразделения.Подразделение.Код, """") КАК ПодрКод,
	|	СУММА(ВЫБОР
	|			КОГДА ВсеОрдера.ТипОрдера = ""Приходный""
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПриходные,
	|	СУММА(ВЫБОР
	|			КОГДА ВсеОрдера.ТипОрдера = ""Расходный""
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоРасходные
	|ИЗ
	|	ОрганизацииПодразделения КАК ОрганизацииПодразделения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеОрдера КАК ВсеОрдера
	|		ПО ОрганизацииПодразделения.Организация = ВсеОрдера.Организация
	|			И ОрганизацииПодразделения.Подразделение = ВсеОрдера.Подразделение
	|
	|СГРУППИРОВАТЬ ПО
	|	ОрганизацииПодразделения.Организация,
	|	ВЫБОР
	|		КОГДА ОрганизацииПодразделения.Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование
	|			ТОГДА ОрганизацииПодразделения.Организация.НаименованиеСокращенное
	|		КОГДА ОрганизацииПодразделения.Организация.НаименованиеПолное = """"
	|			ТОГДА ОрганизацииПодразделения.Организация.Наименование
	|		ИНАЧЕ ОрганизацииПодразделения.Организация.НаименованиеПолное
	|	КОНЕЦ,
	|	ОрганизацииПодразделения.Организация.Наименование,
	|	ОрганизацииПодразделения.Организация.Код,
	|	ОрганизацииПодразделения.Организация.КодОКПО,
	|	ОрганизацииПодразделения.Подразделение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОрганизацииПодразделения.Подразделение.НаименованиеПолное, """") = """"
	|			ТОГДА ЕСТЬNULL(ОрганизацииПодразделения.Подразделение.Наименование, """")
	|		ИНАЧЕ ОрганизацииПодразделения.Подразделение.НаименованиеПолное
	|	КОНЕЦ,
	|	ЕСТЬNULL(ОрганизацииПодразделения.Подразделение.Наименование, """"),
	|	ЕСТЬNULL(ОрганизацииПодразделения.Подразделение.Код, """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОрдера.Организация КАК Организация,
	|	ВсеОрдера.Подразделение КАК Подразделение,
	|	ВсеОрдера.Дата КАК ДатаПКО,
	|	ВсеОрдера.Номер КАК Номер,
	|	ВсеОрдера.Сумма КАК СуммаПКО,
	|	ВсеОрдера.Примечание КАК ПримечаниеПКО,
	|	ВсеОрдера.Основание КАК ОснованиеПКО,
	|	ВсеОрдера.Ссылка
	|ИЗ
	|	ВсеОрдера КАК ВсеОрдера
	|ГДЕ
	|	ВсеОрдера.ТипОрдера = ""Приходный""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Подразделение,
	|	ВсеОрдера.Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОрдера.Организация КАК Организация,
	|	ВсеОрдера.Подразделение КАК Подразделение,
	|	ВсеОрдера.Дата КАК ДатаРКО,
	|	ВсеОрдера.Номер КАК Номер,
	|	ВсеОрдера.Сумма КАК СуммаРКО,
	|	ВсеОрдера.Примечание КАК ПримечаниеРКО,
	|	ВсеОрдера.Основание КАК ОснованиеРКО,
	|	ВсеОрдера.Ссылка
	|ИЗ
	|	ВсеОрдера КАК ВсеОрдера
	|ГДЕ
	|	ВсеОрдера.ТипОрдера = ""Расходный""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Подразделение,
	|	ВсеОрдера.Дата,
	|	Номер";	
	
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаОрганизации = МассивРезультатов[2].Выбрать();
	
	ВыборкаПриходные = МассивРезультатов[3].Выбрать();
	
	ВыборкаРасходные = МассивРезультатов[4].Выбрать();
	
	Отказ = ВыборкаОрганизации.Количество() = 0;
	
	// удалим все добавленные элементы
	МассивУдаляемыхРеквизитов 	= Новый Массив;
	МассивУдаляемыхЭлементов 	= Новый Массив;
	Для ТекИнд = 2 по Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.Количество() Цикл
		МассивУдаляемыхРеквизитов.Добавить(Элементы.ГруппаСтраниц.ПодчиненныеЭлементы[ТекИнд-1].ПодчиненныеЭлементы[0].ПутьКДанным);
		МассивУдаляемыхЭлементов.Добавить(Элементы.ГруппаСтраниц.ПодчиненныеЭлементы[ТекИнд-1]);
	КонецЦикла;
	Для каждого Элемент из МассивУдаляемыхЭлементов Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	ИзменитьРеквизиты(, МассивУдаляемыхРеквизитов);
	
	Если Отказ Тогда
		ЖурналРегистрации.Очистить();
		Элементы.ГруппаСтраниц.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		Элементы.ГруппаЖурналРегистрации.Видимость = Истина;
		Возврат;
	Иначе
		Элементы.ГруппаЖурналРегистрации.Видимость = Ложь;
	КонецЕсли;
	
	ТипыРеквизита = Новый Массив;
	ТипыРеквизита.Добавить(Тип("ТабличныйДокумент"));
	ОписаниеТиповРеквизитов = Новый ОписаниеТипов(ТипыРеквизита);
	
	ЖурналыРегистрации = Новый Массив;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.ЖурналРегистрацииКО3.ПФ_MXL_КО3");
	
	ОбластьТитульныйЛист = Макет.ПолучитьОбласть("ТитульныйЛист");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	СтруктураОблТЛ = Новый Структура;
	СтруктураОблТЛ.Вставить("ЗаПериод",	"за " + ПредставлениеПериода(НачалоДня(Отчет.НачалоПериода), КонецДня(Отчет.КонецПериода), "ФП = Истина"));
	
	
	Пока ВыборкаОрганизации.Следующий() Цикл
		
		КоличествоСтрок = Макс(ВыборкаОрганизации.КоличествоПриходные, ВыборкаОрганизации.КоличествоРасходные);
		
		ЖурналРегистрацииОрганизации = Новый ТабличныйДокумент;
		
		Если Отчет.ВывестиТитульныеЛисты Тогда
			
			ОбластьТитульныйЛист.Параметры.Заполнить(СтруктураОблТЛ);
			ОбластьТитульныйЛист.Параметры.Заполнить(ВыборкаОрганизации);
			
			ЖурналРегистрацииОрганизации.Вывести(ОбластьТитульныйЛист);
			
			ЖурналРегистрацииОрганизации.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Организация, Подразделение", ВыборкаОрганизации.Организация, ВыборкаОрганизации.Подразделение);
		
		ЖурналРегистрацииОрганизации.Вывести(ОбластьШапка);
		
		Для Инд = 1 По КоличествоСтрок Цикл
			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			
			Если ВыборкаПриходные.НайтиСледующий(СтруктураПоиска) Тогда
				
				СтруктураОблСтрока = Новый Структура("НомерПКО");
				
				СтруктураОблСтрока.НомерПКО = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаПриходные.Ссылка, ВыборкаПриходные.Номер);
				
				ОбластьСтрока.Параметры.Заполнить(СтруктураОблСтрока);
				
				ОбластьСтрока.Параметры.Заполнить(ВыборкаПриходные);
				
			КонецЕсли;
			
			Если ВыборкаРасходные.НайтиСледующий(СтруктураПоиска) Тогда
				
				СтруктураОблСтрока = Новый Структура("НомерРКО");
				
				СтруктураОблСтрока.НомерРКО = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаРасходные.Ссылка, ВыборкаРасходные.Номер);
				
				ОбластьСтрока.Параметры.Заполнить(СтруктураОблСтрока);
				
				ОбластьСтрока.Параметры.Заполнить(ВыборкаРасходные);
				
			КонецЕсли;
			
			МассивПроверки = Новый Массив;
			МассивПроверки.Добавить(ОбластьСтрока);
			
			Если НЕ ЖурналРегистрацииОрганизации.ПроверитьВывод(МассивПроверки) Тогда // перенос
				
				ЖурналРегистрацииОрганизации.ВывестиГоризонтальныйРазделительСтраниц();
				ЖурналРегистрацииОрганизации.Вывести(ОбластьШапка);
				
			КонецЕсли;
			
			ЖурналРегистрацииОрганизации.Вывести(ОбластьСтрока);
			
			
		КонецЦикла;
		
		//Элемент и реквизит формы для размещения журнала регистрации
		МассивДобавляемыхРеквизитов = Новый Массив;
		
		ТекПостфикс = Прав(ПолучитьНавигационнуюСсылку(ВыборкаОрганизации.Организация),32) + Прав(ПолучитьНавигационнуюСсылку(ВыборкаОрганизации.Подразделение),32);
		
		НовСтр = Элементы.Добавить("Страница" + ТекПостфикс, Тип("ГруппаФормы"), Элементы.ГруппаСтраниц);
		НовСтр.Заголовок = ВыборкаОрганизации.ПодрНаименование + " " + ВыборкаОрганизации.ОргНаименование;
		
		НовыйРеквизит = Новый РеквизитФормы("Таблица" + ТекПостфикс, ОписаниеТиповРеквизитов);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		ЖурналыРегистрации.Добавить(НовСтр);
		
		НовТаб=Элементы.Добавить("Таблица" + ТекПостфикс, Тип("ПолеФормы"), НовСтр);
		НовТаб.ПутьКДанным="Таблица" + ТекПостфикс;
		НовТаб.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		ЭтаФорма["Таблица" + ТекПостфикс].Очистить();
		ЭтаФорма["Таблица" + ТекПостфикс].Вывести(ЖурналРегистрацииОрганизации);
		
	КонецЦикла; // Пока ВыборкаОрганизации.Следующий()
	
	Если ЖурналыРегистрации.Количество() > 1 Тогда
		
		Элементы.ГруппаСтраниц.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		
				
	Иначе
		
		Элементы.ГруппаСтраниц.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		
		// Для сохранения регистра учета
		ЖурналРегистрации.Очистить();
		ЖурналРегистрации.Вывести(ЖурналРегистрацииОрганизации);
		
	КонецЕсли;
	
	Элементы.ГруппаСтраниц.ТекущаяСтраница = ЖурналыРегистрации[0];
	
КонецПроцедуры

#КонецОбласти
