
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		//новая запись
		
		Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
			Запись.Организация = ПараметрыСеанса.ТекущаяОрганизация;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.РедакцияПС) Тогда
			Запись.РедакцияПС = ПредопределенноеЗначение("Перечисление.РедакцииПланаСчетов.Приказ298н2019");
		КонецЕсли;
	
	Иначе
		
		ТолькоПросмотр = РегистрыСведений.ДатыПереходаНаПрименениеРедакцийПС.ЗаписьИзмененийНевозможна(Запись.Организация, Запись.РедакцияПС);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Отказ = РегистрыСведений.ДатыПереходаНаПрименениеРедакцийПС.ЗаписьИзмененийНевозможна(Запись.Организация, Запись.РедакцияПС);
	Если Отказ Тогда
		ТекстОшибки = Нстр("ru = 'Изменение даты перехода невозможно: есть проведенные документы по переходу на применение приказа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Модифицированность Тогда
		Запись.АвторИзменения 	= ПользователиКлиентСервер.АвторизованныйПользователь();
		Запись.ДатаИзменения 	= ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ДанныеЗаписи = Новый Структура("Организация,РедакцияПС,ДатаНачалаПрименения");
	ЗаполнитьЗначенияСвойств(ДанныеЗаписи, Запись);
	Оповестить("ДатыПереходаНаПрименениеРедакцийПСЗапись", ДанныеЗаписи);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи); 
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаНачалаПримененияПриИзменении(Элемент)
	
	Если Запись.РедакцияПС = ПредопределенноеЗначение("Перечисление.РедакцииПланаСчетов.Приказ64н2018") Тогда
		
		Если НЕ Год(Запись.ДатаНачалаПрименения) = Год('20180101') Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Переход на применение положений приказа
			|Минфина России от 31.03.2018 № 64н
			|должен быть осуществлен в 2018 г.'"), ,
			"ДатаНачалаПрименения",
			"Запись");
			
			Запись.ДатаНачалаПрименения = "";
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти