#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если ВидОперации = Перечисления.ВидыОперацийПереносОплатыОбразование.ПереносОплатыПрочихКредиторов Тогда
		НеПроверяемыеРеквизиты.Добавить("Расчеты.Студент");
		НеПроверяемыеРеквизиты.Добавить("Расчеты.Факультет");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	СведенияОДоговорахСтудентов = РаботаСоСтудентами.СведенияОДоговорахСтудентов(Расчеты.ВыгрузитьКолонку("Договор"));
	СведенияОДоговорахРасчетов  = РаботаСоСтудентами.СведенияОДоговорахСтудентов(Расчеты.ВыгрузитьКолонку("ДоговорРасчетов"));
	Для Каждого СтрокаТаблицы Из Расчеты Цикл
		
		// Проверим исходный договор, с которого переносится оплата.
		Если ВидОперации = Перечисления.ВидыОперацийПереносОплатыОбразование.ПереносОплатыМеждуДоговорамиСтудента
			ИЛИ ВидОперации = Перечисления.ВидыОперацийПереносОплатыОбразование.ПереносОплатыМеждуСтудентами Тогда
			
			ОтборПоДоговору = Новый Структура("Договор", СтрокаТаблицы.Договор);
			СведенияОДоговоре = СведенияОДоговорахСтудентов.НайтиСтроки(ОтборПоДоговору);
			ЭтоДоговорСтудента = (СведенияОДоговоре.Количество() > 0);
			Если Не ЭтоДоговорСтудента Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Договор ""%1"" не является договором на платное обучение. Проверьте данные в регистре ""%2"".'"),
						СтрокаТаблицы.Договор,
						Метаданные.РегистрыНакопления.РасчетыСоСтудентами.Синоним);
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
					НСтр("ru = 'Договор'"), СтрокаТаблицы.НомерСтроки, НСтр("ru = 'Расчеты'"), ТекстОшибки);
				ПолеОшибки = "Расчеты[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Договор";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.Ссылка, ПолеОшибки, "Объект", Отказ);
				Продолжить;
			КонецЕсли;
			Если СведенияОДоговоре[0].ЭтоДоговорСтудентаЗаПрочиеУслуги Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Договор ""%1"" не является договором на платное обучение. Документ не предназначен для переноса оплаты между договорами за прочие услуги учащимся.'"),
						СтрокаТаблицы.Договор);
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
					НСтр("ru = 'Договор'"), СтрокаТаблицы.НомерСтроки, НСтр("ru = 'Расчеты'"), ТекстОшибки);
				ПолеОшибки = "Расчеты[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Договор";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.Ссылка, ПолеОшибки, "Объект", Отказ);
			КонецЕсли; 
			
		КонецЕсли;
		
		// Проверим договор, на который переносится оплата.
		ОтборПоДоговору = Новый Структура("Договор", СтрокаТаблицы.ДоговорРасчетов);
		СведенияОДоговоре = СведенияОДоговорахРасчетов.НайтиСтроки(ОтборПоДоговору);
		ЭтоДоговорСтудента = (СведенияОДоговоре.Количество() > 0);
		Если ЭтоДоговорСтудента И СведенияОДоговоре[0].ЭтоДоговорСтудентаЗаПрочиеУслуги Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Договор ""%1"" не является договором на платное обучение. Документ не предназначен для переноса оплаты между договорами за прочие услуги учащимся.'"),
					СтрокаТаблицы.ДоговорРасчетов);
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
				НСтр("ru = 'Договор расчетов'"), СтрокаТаблицы.НомерСтроки, НСтр("ru = 'Расчеты'"), ТекстОшибки);
			ПолеОшибки = "Расчеты[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ДоговорРасчетов";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.Ссылка, ПолеОшибки, "Объект", Отказ);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СуммаДокумента = Расчеты.Итог("Сумма");
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет") Тогда
		ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
		Для Каждого СтрокаРасчеты Из Расчеты Цикл
			СтрокаРасчеты.Валюта = ВалютаРеглУчета;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
