#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда	
		
		Если  НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ВидКонтрагента") = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			
			ТекстСообщения = НСтр("ru = 'Возможно создание на основании контрагента только с видом Физ. лицо!'");
			ВызватьИсключение ТекстСообщения;
			
		КонецЕсли; 
		
		Контрагент 		= ДанныеЗаполнения;
		Наименование 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование");
		Владелец 		= ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
