&НаКлиенте
Перем ПредустановленныйОтборПодборОстатковМЗ;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФорму();
	
	НастроитьФорму();
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект);
	// Конец Централизованная бухгалтерия
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = Истина;
	// Конец ПодключаемоеОборудование
	
	Если НужноЗаблокироватьРеквизиты() Тогда
		// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
		ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
		НастроитьДоступностьСпискаНФА();
		// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	КонецЕсли;
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов 
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1Сдокументооборотом
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПредустановленныйОтборПодборОстатковМЗ = ПолучитьПредустановленныйОтборПодборОстатковМЗ();
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект); 
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, "СканерШтрихкода");
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ОтключитьОборудованиеЗавершение", ЭтотОбъект); 
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("СканерШтрихкода"));
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Тогда
		ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПанельРасписки
	Если ИмяСобытия = "ЗаписанДокументРаспискиИнвентаризации" И Объект.Ссылка = Параметр.ДокументОписи Тогда
		НастроитьФормуПоРасписке();
		
		НастроитьДоступностьСпискаНФА();
	КонецЕсли;
	// Конец ПанельРасписки
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Если Параметр[1] = Неопределено Тогда
				Штрихкод = Параметр[0];
			Иначе
				Штрихкод = Параметр[1][1];
			КонецЕсли;
			
			Отказ = Ложь;
			ОтменитьДобавлениеСтрокиРаздела21(Отказ);
			
			Если Не Отказ Тогда
				ДобавитьОСПоШтрихкоду(Штрихкод);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// Внутренний ЭДО
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец Внутренний ЭДО
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ИнициализацияФормыВыполнена Тогда
		НастроитьФорму();
	КонецЕсли;
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом 
	
	// ДатыЗапретаИзмененияДанных
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ДатыЗапретаИзмененияДанных
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ); 
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1Сдокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НастроитьФорму();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	Если НужноЗаблокироватьРеквизиты() Тогда
		// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
		ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
		НастроитьДоступностьСпискаНФА();
		// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	КонецЕсли;
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если КонтролироватьПоследовательностьЗаполненияРазделов <> 
		ДопустимостьЗаполненияРазделовПрежнееЗначение.КонтролироватьПоследовательностьЗаполненияРазделов Тогда
		
		НастроитьФорму_ДопустимостьЗаполненияРазделов_Сервер();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РешениеОПроведенииИнвентаризацииПриИзменении(Элемент)
	
	// РешениеОПроведенииИнвентаризации
	ИнвентаризацияКлиент.ВыбраноРешениеОПроведенииИнвентаризации(ЭтаФорма);
	// Конец РешениеОПроведенииИнвентаризации
	
КонецПроцедуры

#Область ПанельРасписки

&НаКлиенте
Процедура ДекорацияРаспискаНадписьНажатие(Элемент)
	
	ДополнительноПроверяемыеПоляПередСозданиемРасписки = Новый Структура();
	ДополнительноПроверяемыеПоляПередСозданиемРасписки.Вставить("ОтветственныйИсполнительБухгалтерскойСлужбы",
		НСтр("ru='Ответственный исполнитель бух. службы'"));
	
	ИнвентаризацияКлиент.ПриНажатииНадписиРасписка(ЭтаФорма, ДополнительноПроверяемыеПоляПередСозданиемРасписки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРаспискаКомментарийГиперссылкаНадписьНажатие(Элемент)
	
	ИнвентаризацияКлиент.ПриНажатииГиперссылкиКомментарияПанелиРасписки(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПанельСерииДокументов

&НаКлиенте
Процедура ДекорацияЗаголовочныйДокументГиперссылкаНажатие(Элемент)
	
	ПоказатьЗначение(, ДанныеПанелиСерииДокументов.СвойстваСерии.ОбщиеСвойства.ЗаголовочныйДокументСсылка);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПредставлениеСпискаСчетовНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущийЭлемент = Элементы.СписокСчетов;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеМестаПроведенияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущийЭлемент = Элементы.МестаИнвентаризации;
	
КонецПроцедуры

#Область ОтборПоПодразделению

&НаКлиенте
Процедура ДекорацияПодразделениеНажатие(Элемент)
	
	ИнвентаризацияКлиент.ПриНажатииНаДекорациюПодразделение(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	НастроитьОтборПоПодразделению();
	
КонецПроцедуры

#КонецОбласти

// Внутренний ЭДО
&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец Внутренний ЭДО

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
                ПараметрыПеретаскивания, СтандартнаяОбработка);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
                ПараметрыПеретаскивания, СтандартнаяОбработка);
    
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
	УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект);
КонецПроцедуры
//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Раздел1

&НаКлиенте
Процедура СписокНФАНФАПриИзменении(Элемент)
	
	ТекДанные = Элементы.СписокНФА.ТекущиеДанные;
	
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("ТипНфаОС",			(ТипЗнч(ТекДанные.НФА) = Тип("СправочникСсылка.ОсновныеСредства")));
	СтруктураЗаполнения.Вставить("ТипНфаНоменклатура",	(ТипЗнч(ТекДанные.НФА) = Тип("СправочникСсылка.Номенклатура")));
	
	ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНФАНФАОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Тип") Тогда
		УстановитьПараметрыВыбораОстатковНФА(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНФАНФААвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ПараметрыПолученияДанных.Вставить("ПредустановленныйОтбор", ПредустановленныйОтборПодборОстатковМЗ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Раздел1

&НаКлиенте
Процедура Раздел1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Раздел1НомерСтроки" Тогда
		ТекДанные = Элементы.Раздел1.ТекущиеДанные;
		
		Если ЗначениеЗаполнено(ТекДанные.ИдентификаторСтроки) Тогда
			ПоказатьПредупреждение(, ПолучитьТекстСообщенияОстаткиЗабаланс(ТекДанные.ИдентификаторСтроки));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел1МестоИнвентаризацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтменитьНедопустимоеИзменениеМестаИнвентаризацииВСтрокеРаздела1(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел1МестоИнвентаризацииОчистка(Элемент, СтандартнаяОбработка)
	
	ОтменитьНедопустимоеИзменениеМестаИнвентаризацииВСтрокеРаздела1(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел1МестоИнвентаризацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Раздел1.ТекущиеДанные;
	
	ТекДанные.МестоИнвентаризацииЗаполненоВручную = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Раздел21

&НаКлиенте
Процедура Раздел21Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьПриНеобходимостиФормуРазбивкиСтрокиРаздела2("Раздел21", Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ОтменитьДобавлениеСтрокиРаздела21(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21ПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.Раздел21.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтменитьУдалениеАвтоСтрокРаздела21(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОтменитьУдалениеФрагментаСтроки("Раздел21", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока  Тогда
		ТекДанные = Элементы.Раздел21.ТекущиеДанные;
		
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураЗаполнения = Новый Структура();
		СтруктураЗаполнения.Вставить("ДобавленоВручную",		Истина);
		СтруктураЗаполнения.Вставить("ИдентификаторСтроки",		"");
		СтруктураЗаполнения.Вставить("ПризнакФрагментаСтроки",	Ложь);
		
		Если Не Копирование И Объект.МестаИнвентаризации.Количество() = 1 Тогда
			СтруктураЗаполнения.Вставить("МестоИнвентаризации",	Объект.МестаИнвентаризации.Получить(0).МестоИнвентаризации);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураЗаполнения);
		
		НастроитьФорму_ДопустимостьЗаполненияРазделов_Клиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21ПослеУдаления(Элемент)
	
	НастроитьФорму_ДопустимостьЗаполненияРазделов_Клиент();
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21НФАПриИзменении(Элемент)
	
	ТекДанные = Элементы.Раздел21.ТекущиеДанные;
	
	ТипНфаОС			= (ТипЗнч(ТекДанные.НФА) = Тип("СправочникСсылка.ОсновныеСредства"));
	ТипНфаНоменклатура	= (ТипЗнч(ТекДанные.НФА) = Тип("СправочникСсылка.Номенклатура"));
	
	Если ЗначениеЗаполнено(ТекДанные.НФА) И ТипНфаОС Тогда
		ЕдИзм = ЕдИзмШт;
		
	ИначеЕсли ЗначениеЗаполнено(ТекДанные.НФА) И ТипНфаНоменклатура Тогда
		ЕдИзм = ПрочитатьЕдиницуИзмеренияНоменклатуры(ТекДанные.НФА);
		
	Иначе
		ЕдИзм = Неопределено;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура("
		|ЕдИзм,
		|СтатусОбъекта,
		|ЦелеваяФункцияАктива,
		|Примечание,
		|ИдентификаторСтроки,
		|Количество,
		|ТипНфаОС,
		|ТипНфаНоменклатура");
	
	СтруктураЗаполнения.ЕдИзм				= ЕдИзм;
	СтруктураЗаполнения.ТипНфаОС			= ТипНфаОС;
	СтруктураЗаполнения.ТипНфаНоменклатура	= ТипНфаНоменклатура;
	
	ЗаполнитьЗначенияСвойств(Элементы.Раздел21.ТекущиеДанные, СтруктураЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21НФАНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтменитьДействиеДляАвтоСтрокиРаздела21(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21НФАОчистка(Элемент, СтандартнаяОбработка)
	
	ОтменитьДействиеДляАвтоСтрокиРаздела21(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21ИнвентарныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтменитьДействиеДляАвтоСтрокиРаздела21(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21ИнвентарныйНомерОчистка(Элемент, СтандартнаяОбработка)
	
	ОтменитьДействиеДляАвтоСтрокиРаздела21(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21ЕдИзмНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтменитьДействиеДляАвтоСтрокиРаздела21(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21ЕдИзмОчистка(Элемент, СтандартнаяОбработка)
	
	ОтменитьДействиеДляАвтоСтрокиРаздела21(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21МестоИнвентаризацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтменитьДействиеДляАвтоСтрокиРаздела21(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел21МестоИнвентаризацииОчистка(Элемент, СтандартнаяОбработка)
	
	ОтменитьДействиеДляАвтоСтрокиРаздела21(СтандартнаяОбработка);
	
КонецПроцедуры


&НаКлиенте
Процедура Раздел21КоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Раздел21.ТекущиеДанные;
	
	Если ТекДанные.ТипНфаОС Тогда
		ТекДанные.Количество = Окр(ТекДанные.Количество, 0);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Раздел21ПримечаниеОткрытие(Элемент, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.НачатьВводТекстовойСтроки(ЭтаФорма, Элементы.Раздел21.ТекущиеДанные, "Примечание", НСтр("ru='Примечание'"), СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Раздел22

&НаКлиенте
Процедура Раздел22ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел22ПередУдалением(Элемент, Отказ)
	
	ОтменитьУдалениеАвтоСтрокРаздела22(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел22КоличествоНеСоответствуетПриИзменении(Элемент)
	
	РассчитатьПоказателиСтрокиРаздела22(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел22СуммаНеСоответствуетПриИзменении(Элемент)
	
	РассчитатьПоказателиСтрокиРаздела22(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел22КоличествоОбесценениеПриИзменении(Элемент)
	
	РассчитатьПоказателиСтрокиРаздела22(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел22СуммаОбесценениеПриИзменении(Элемент)
	
	РассчитатьПоказателиСтрокиРаздела22(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Раздел23

&НаКлиенте
Процедура Раздел3КоличествоНедостачаПодтвержденоПриИзменении(Элемент)
	
	РассчитатьПоказателиСтрокиРаздела3(Элемент);
	
	ОчиститьРеквизитыДокументаПриОтсутствииПодтвержденияВСтрокеРаздела3();
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел3СуммаНедостачаПодтвержденоПриИзменении(Элемент)
	
	РассчитатьПоказателиСтрокиРаздела3(Элемент);
	
	ОчиститьРеквизитыДокументаПриОтсутствииПодтвержденияВСтрокеРаздела3();
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел3ЦенаПриИзменении(Элемент)
	
	РассчитатьПоказателиСтрокиРаздела3(Элемент);
	
	ОчиститьРеквизитыДокументаПриОтсутствииПодтвержденияВСтрокеРаздела3();
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел3КоличествоИзлишкиПодтвержденоПриИзменении(Элемент)
	
	РассчитатьПоказателиСтрокиРаздела3(Элемент);
	
	ОчиститьРеквизитыДокументаПриОтсутствииПодтвержденияВСтрокеРаздела3();
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел3СуммаИзлишкиПодтвержденоПриИзменении(Элемент)
	
	РассчитатьПоказателиСтрокиРаздела3(Элемент);
	
	ОчиститьРеквизитыДокументаПриОтсутствииПодтвержденияВСтрокеРаздела3();
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел3КоличествоНедостачаНеПодтвержденоПриИзменении(Элемент)
	
	РассчитатьПоказателиСтрокиРаздела3(Элемент);
	
	ОчиститьРеквизитыДокументаПриОтсутствииПодтвержденияВСтрокеРаздела3();
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел3СуммаНедостачаНеПодтвержденоПриИзменении(Элемент)
	
	РассчитатьПоказателиСтрокиРаздела3(Элемент);
	
	ОчиститьРеквизитыДокументаПриОтсутствииПодтвержденияВСтрокеРаздела3();
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел3КоличествоИзлишкиНеПодтвержденоПриИзменении(Элемент)
	
	РассчитатьПоказателиСтрокиРаздела3(Элемент);
	
	ОчиститьРеквизитыДокументаПриОтсутствииПодтвержденияВСтрокеРаздела3();
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел3ОбъяснениеПричинРасхожденийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.НачатьВводТекстовойСтроки(ЭтаФорма,
		Элементы.Раздел3.ТекущиеДанные,
		"ОбъяснениеПричинРасхождений",
		НСтр("ru='Объяснение причин расхождений'"),
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Раздел4

&НаКлиенте
Процедура Раздел4ЗаключениеКомиссииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.НачатьВыборЗаключенияКомиссииПоИнвОписи(ЭтаФорма, Элементы.Раздел4.ТекущиеДанные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел4ЗаключениеКомиссииОткрытие(Элемент, СтандартнаяОбработка)
	
	СохранитьИзменения = ДопустимостьЗаполненияРазделовПрежнееЗначение.Раздел4;
	
	ИнвентаризацияКлиент.НачатьВводТекстовойСтроки(ЭтаФорма, Элементы.Раздел4.ТекущиеДанные,
		"ЗаключениеКомиссии", НСтр("ru='Заключение комиссии'"), СтандартнаяОбработка, СохранитьИзменения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставКомиссииРаздел2

&НаКлиенте
Процедура СоставКомиссииРаздел2ПриИзменении(Элемент)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(ЭтотОбъект, Элемент);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииРаздел2ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиямиКлиент.ЗаполнитьСписокВыбораЗамещающийСотрудник(ЭтотОбъект, Элемент);
	// Конец ЗамещениеЧленаКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииРаздел2ЗамещающийСотрудникПриИзменении(Элемент)
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиямиКлиент.ЗаполнитьСведенияЗамещающегоСотрудникаВСтрокеТаблицы(ЭтотОбъект, Элемент);
	// Конец ЗамещениеЧленаКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииРаздел2ОтсутствуетПриИзменении(Элемент)
	
	ИнвентаризацияКлиент.СоставКомиссииОтсутствуетПриИзменении(ЭтаФорма, Элемент, "СоставКомиссииРаздел2");
	
	// ЗамещениеЧленаКомиссии
	ОбновитьЗамещенияПриОтсутствииСервер("СоставКомиссииРаздел2");
	// Конец ЗамещениеЧленаКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииРаздел2ПричинаОтсутствияПриИзменении(Элемент)
	
	ИнвентаризацияКлиент.СоставКомиссииПричинаОтсутствияПриИзменении(ЭтаФорма, Элемент, "СоставКомиссииРаздел2");
	
	// ЗамещениеЧленаКомиссии
	ОбновитьЗамещенияПриОтсутствииСервер("СоставКомиссииРаздел2");
	// Конец ЗамещениеЧленаКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииРаздел2ПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.СоставКомиссииПричинаОтсутствияНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставКомиссииРаздел4

&НаКлиенте
Процедура СоставКомиссииРаздел4ПриИзменении(Элемент)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(ЭтотОбъект, Элемент);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииРаздел4ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиямиКлиент.ЗаполнитьСписокВыбораЗамещающийСотрудник(ЭтотОбъект, Элемент);
	// Конец ЗамещениеЧленаКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииРаздел4ЗамещающийСотрудникПриИзменении(Элемент)
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиямиКлиент.ЗаполнитьСведенияЗамещающегоСотрудникаВСтрокеТаблицы(ЭтотОбъект, Элемент);
	// Конец ЗамещениеЧленаКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииРаздел4ОтсутствуетПриИзменении(Элемент)
	
	ИнвентаризацияКлиент.СоставКомиссииОтсутствуетПриИзменении(ЭтаФорма, Элемент, "СоставКомиссииРаздел4");
	
	// ЗамещениеЧленаКомиссии
	ОбновитьЗамещенияПриОтсутствииСервер("СоставКомиссииРаздел4");
	// Конец ЗамещениеЧленаКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииРаздел4ПричинаОтсутствияПриИзменении(Элемент)
	
	ИнвентаризацияКлиент.СоставКомиссииПричинаОтсутствияПриИзменении(ЭтаФорма, Элемент, "СоставКомиссииРаздел4");
	
	// ЗамещениеЧленаКомиссии
	ОбновитьЗамещенияПриОтсутствииСервер("СоставКомиссииРаздел4");
	// Конец ЗамещениеЧленаКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииРаздел4ПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.СоставКомиссииПричинаОтсутствияНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаКонтролироватьПоследовательностьЗаполненияРазделов(Команда)
	
	Если КонтролироватьПоследовательностьЗаполненияРазделов Тогда
		ПодтвердитьОтключениеКонтроляПоследовательностиЗаполненияРазделов();
		
		Возврат;
	КонецЕсли;
	
	ИзменитьНастройкуКонтроляПоследовательностиЗаполненияРазделов();
	
КонецПроцедуры

// Список НФА

&НаКлиенте
Процедура ПодборОС(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборМЗ(Команда)
	
	ПараметрыПодбора = УправлениеМатериальнымиЗапасамиФормыКлиент.ПараметрыОткрытияПодбора();
	
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить(НСтр("ru = 'Организация'"));
	
	ПараметрыПодбора.ПроверяемыеРеквизиты = СтрСоединить(ПроверяемыеРеквизиты, ";");
	
	УправлениеМатериальнымиЗапасамиФормыКлиент.ОткрытьПодборМатериалов(ЭтотОбъект, Объект, ПараметрыПодбора);
	
КонецПроцедуры

// Места инвентаризации

&НаКлиенте
Процедура ПоказатьСообщениеМестоИнвентаризации(Команда)
	
	ТекстСообщения = НСтр("ru='Есть места инвентаризации, заданные текстовой строкой. Это не позволяет корректно применить указанный здесь отбор по месту проведения инвентаризации.
		|
		|Будет применен отбор по всем ЦМО (всем местам хранения) ответственного лица.
		|
		|При заполнении раздела 1 возможны пустые поля в колонке ""Место инвентаризации"", если в остатках место хранения определено, но такого ссылочного значения не указано в списке мест проведения инвентаризации.
		|
		|Такие пустые места инвентаризации в разделе 1 необходимо заполнить вручную.'");
	
	ПоказатьПредупреждение(, ТекстСообщения);
	
КонецПроцедуры

// Раздел 1

&НаКлиенте
Процедура ЗаполнитьРаздел1(Команда)
	
	ПроверитьИЗаполнитьРаздел1Клиент(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоОшибкиУчета(Команда)
	
	УстановитьОтборСтрокРаздел("Раздел1ПоказатьТолькоОшибкиУчета", "Раздел1");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоПустыеМестаИнвентаризации(Команда)
	
	УстановитьОтборСтрокРаздел("Раздел1ПоказатьТолькоПустыеМестаИнвентаризации", "Раздел1");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоДопСведения(Команда)
	
	УстановитьОтборСтрокРаздел("Раздел1ПоказатьТолькоДопСведения", "Раздел1");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоМестаИнвентаризацииЗаполненныеВручную(Команда)
	
	УстановитьОтборСтрокРаздел("Раздел1ПоказатьТолькоМестаИнвентаризацииЗаполненныеВручную", "Раздел1");
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеЗаполнениеСтрокРаздела1(Команда)
	
	ОткрытьФормуГрупповогоЗаполненияСтрок("Раздел1");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеВТСД(Команда)
	
	ПроверитьИВыгрузитьДанныеВТСДКлиент();
	
КонецПроцедуры

// Раздел 2.1

&НаКлиенте
Процедура ЗаполнитьРаздел21(Команда)
	
	ПроверитьИЗаполнитьРаздел21Клиент(Команда, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаздел21СКоличеством(Команда)
	
	ПроверитьИЗаполнитьРаздел21Клиент(Команда, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьСтрокуРаздела21(Команда)
	
	ОткрытьФормуРазбивкиСтрокиРаздела2("Раздел21");
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеЗаполнениеСтрокРаздела21(Команда)
	
	ОткрытьФормуГрупповогоЗаполненияСтрок("Раздел21");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВРаздел22(Команда)
	
	ПроверитьИДобавитьВРаздел22();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоФрагментыСтрокРаздела21(Команда)
	
	УстановитьОтборСтрокРаздел("Раздел21ПоказатьТолькоФрагментыСтрокРаздела21", "Раздел21");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоПустыеМестаИнвентаризацииРаздел21(Команда)
	
	УстановитьОтборСтрокРаздел("Раздел21ПоказатьТолькоПустыеМестаИнвентаризацииРаздел21", "Раздел21");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоДобавленныеВручнуюРаздел21(Команда)
	
	УстановитьОтборСтрокРаздел("Раздел21ПоказатьТолькоДобавленныеВручнуюРаздел21", "Раздел21");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ПроверитьИЗагрузитьДанныеИзТСДКлиент();
	
КонецПроцедуры

// Раздел 2.2

&НаКлиенте
Процедура ЗаполнитьРаздел22(Команда)
	
	ПроверитьИЗаполнитьРаздел22Клиент(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТолькоДобавленныеВручнуюРаздел22(Команда)
	
	УстановитьОтборСтрокРаздел("Раздел22ПоказатьТолькоДобавленныеВручнуюРаздел22", "Раздел22");
	
КонецПроцедуры

// Раздел 3

&НаКлиенте
Процедура ЗаполнитьРаздел3(Команда)
	
	ПроверитьИЗаполнитьРаздел3Клиент(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеЗаполнениеСтрокРаздела3(Команда)
	
	ОткрытьФормуГрупповогоЗаполненияСтрок("Раздел3");
	
КонецПроцедуры

// Раздел 4

&НаКлиенте
Процедура ЗаполнитьРаздел4(Команда)
	
	ПроверитьИЗаполнитьРаздел4Клиент(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеЗаполнениеСтрокРаздела4(Команда)
	
	ОткрытьФормуГрупповогоЗаполненияСтрок("Раздел4");
	
КонецПроцедуры

// Содержательные документы

&НаКлиенте
Процедура ОбновитьСтатусыСодержательныхДокументов(Команда)
	
	ЗаполнитьСлужебныеКолонкиСпискаДокументовСерии();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДокументыСерии(Команда)
	
	ИнвентаризацияКлиент.ПодтвердитьИУдалитьДокументыСерии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИУдалитьДокументыСерии(Команда)
	
	ИнвентаризацияКлиент.ПодтвердитьОчиститьИУдалитьДокументыСерии(ЭтаФорма);
	
КонецПроцедуры

// Причины недоступности разделов.

&НаКлиенте
Процедура ПоказатьПричинуНедоступностиРаздела1(Команда)
	
	ПоказатьПредупреждение(, ПричинаНедоступностиРаздела1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПричинуНедоступностиРаздела21(Команда)
	
	ПоказатьПредупреждение(, ПричинаНедоступностиРаздела21);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПричинуНедоступностиРаздела22(Команда)
	
	ПоказатьПредупреждение(, ПричинаНедоступностиРаздела22);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПричинуНедоступностиРаздела3(Команда)
	
	ПоказатьПредупреждение(, ПричинаНедоступностиРаздела3);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПричинуНедоступностиРаздела4(Команда)
	
	ПоказатьПредупреждение(, ПричинаНедоступностиРаздела4);
	
КонецПроцедуры

// Внутренний ЭДО
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец Внутренний ЭДО

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
    РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1Сдокументооборотом 

#Область ВводДокументовНФА

&НаКлиенте
Процедура ВвестиДокументыПоОтклонениям(Команда)
	Текст = "";
	Если ЭтотОбъект.Модифицированность Тогда
		Текст = НСтр("ru = 'Документ модифицирован. Его следует записать и провести'");
	ИначеЕсли НЕ Объект.Проведен Тогда
		Текст = НСтр("ru = 'Ввод документов по отклонениям возможен только после проведения документа'");
	КонецЕсли;
	Если ЗначениеЗаполнено(Текст) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;	

	ПараметрыФормы = Новый Структура("ДокументИнвентаризации", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.ПомощникВводаДокументовОтклоненияИнвентаризацииНФА", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФорму()
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиями.ИнициализироватьФормуДокументаЗамещениеЧленаКомиссии(ЭтотОбъект,, "СоставКомиссииРаздел2,СоставКомиссииРаздел4");
	// Конец ЗамещениеЧленаКомиссии
	
	ЕдИзмШт = Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
	
	ИнвентаризацияСервер.ЗаполнитьСписокВыбораЭлементаСтатусОбъяснения(Элементы.Раздел4СтатусОбъяснения);
	
	УстановитьУсловноеОформление();
	
	КонтролироватьПоследовательностьЗаполненияРазделов = Истина;
	
	ИнициализацияФормыВыполнена = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	
	Перем РезультатыДиагностики;
	
	// ПанельРасписки
	НастроитьФормуПоРасписке();
	// Конец ПанельРасписки
	
	// СерииДокументов
	НастроитьФормуПоСерииДокументов();
	// Конец СерииДокументов
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриЧтенииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиями.ЗаполнитьСлужебныеКолонкиЗамещениеЧленаКомиссии(ЭтотОбъект);
	// Конец ЗамещениеЧленаКомиссии
	
	ЗаполнитьСписокВыбораМестоИнвентаризации();
	
	НастроитьФормуПоВидуИнвентаризации();
	
	НастроитьВидимостьНадписиМестаИнвентаризации();
	
	УстановитьПредставленияРеквизитовШапки();
	
	НастроитьНедоступностьИзмененияКолонок();
	
	Документы.ИнвентаризационнаяОписьНФА.ЗаполнитьСлужебныеКолонки(ЭтаФорма, "СписокНФА,Раздел1,Раздел21,Раздел22,Раздел3,Раздел4", РезультатыДиагностики);
	
	НастроитьФорму_ДопустимостьЗаполненияРазделов_Сервер();
	
	ОбновитьКнопкиПоказать("Раздел1,Раздел21,Раздел22", РезультатыДиагностики);
	
	НастроитьОтборПоПодразделению();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставленияРеквизитовШапки()
	
	ИнвентаризацияСервер.УстановитьПредставлениеСпискаСчетовНаФормеОписи(ЭтаФорма);
	
	ИнвентаризацияСервер.УстановитьПредставлениеНомераКомиссииНаФормеОписи(ЭтаФорма);
	
	ИнвентаризацияСервер.УстановитьПредставлениеСпискаМестИнвентаризацииНаФормеОписи(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстСообщенияОстаткиЗабаланс(ИдентификаторСтроки)
	
	Возврат Документы.ИнвентаризационнаяОписьНФА.ПолучитьТекстСообщенияОстаткиЗабаланс(Объект.ДополнениеРаздела1, ИдентификаторСтроки, Истина);
	
КонецФункции

&НаКлиенте
Функция ОтменитьВызовГрупповогоЗаполненияСтрокРаздела1()
	
	Для Каждого ИдСтроки Из Элементы.Раздел1.ВыделенныеСтроки Цикл
		ТекДанные = Объект.Раздел1.НайтиПоИдентификатору(ИдСтроки);
		
		Если Не ДопустимоИзменитьМестоИнвентаризацииВСтрокеРаздела1(ТекДанные) Тогда
			ПоказатьПредупреждение(, НСтр("ru='Не предусмотрено изменение автоматически заполненных мест инвентаризации'"));
			
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ОтменитьУдалениеАвтоСтрокРаздела21(Отказ)
	
	Для Каждого ИдСтроки Из Элементы.Раздел21.ВыделенныеСтроки Цикл
		
		ТекДанные = Объект.Раздел21.НайтиПоИдентификатору(ИдСтроки);
		
		Если Не ТекДанные.ДобавленоВручную Тогда
			Отказ = Истина;
			
			ПоказатьПредупреждение(, НСтр("ru='Не предусмотрено удаление строк, полученных заполнением по данным из раздела 1'"));
			
			Возврат;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьУдалениеАвтоСтрокРаздела22(Отказ)
	
	Для Каждого ИдСтроки Из Элементы.Раздел22.ВыделенныеСтроки Цикл
		
		ТекДанные = Объект.Раздел22.НайтиПоИдентификатору(ИдСтроки);
		
		Если Не ТекДанные.ДобавленоВручную Тогда
			Отказ = Истина;
			
			ПоказатьПредупреждение(, НСтр("ru='Не предусмотрено удаление строк, полученных заполнением по данным из раздела 2.1'"));
			
			Возврат;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьДействиеДляАвтоСтрокиРаздела21(СтандартнаяОбработка)
	
	ТекДанные = Элементы.Раздел21.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекДанные.ДобавленоВручную Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСписокВыбораМестоИнвентаризации()
	
	СодержимоеСписка = Объект.МестаИнвентаризации.Выгрузить().ВыгрузитьКолонку("МестоИнвентаризации");
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("Раздел1МестоИнвентаризации");
	ИменаЭлементов.Добавить("Раздел21МестоИнвентаризации");
	
	Для Каждого ИмяЭлемента Из ИменаЭлементов Цикл
		СписокВыбора = Элементы[ИмяЭлемента].СписокВыбора;
		
		СписокВыбора.Очистить();
		
		СписокВыбора.ЗагрузитьЗначения(СодержимоеСписка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьНедоступностьИзмененияКолонок()
	
	// Постоянно недоступные колонки.
	
	НедоступныеКолонки = Новый Массив();
	
	НедоступныеКолонки.Добавить("СписокДокументовСерииДокументОписи");
	
	НедоступныеКолонки.Добавить("СписокСчетовКФО");
	НедоступныеКолонки.Добавить("СписокСчетовСчет");
	
	НедоступныеКолонки.Добавить("МестаИнвентаризацииМестоИнвентаризации");
	
	НедоступныеКолонки.Добавить("Раздел1ИнвентарныйНомер");
	НедоступныеКолонки.Добавить("Раздел1ЕдИзм");
	НедоступныеКолонки.Добавить("Раздел1НФА");
	НедоступныеКолонки.Добавить("Раздел1Счет");
	НедоступныеКолонки.Добавить("Раздел1КПС");
	НедоступныеКолонки.Добавить("Раздел1КФО");
	НедоступныеКолонки.Добавить("Раздел1ИФО");
	НедоступныеКолонки.Добавить("Раздел1ЦМО");
	НедоступныеКолонки.Добавить("Раздел1Подразделение");
	НедоступныеКолонки.Добавить("Раздел1Количество");
	НедоступныеКолонки.Добавить("Раздел1Сумма");
	
	НедоступныеКолонки.Добавить("Раздел22НФА");
	НедоступныеКолонки.Добавить("Раздел22ИнвентарныйНомер");
	НедоступныеКолонки.Добавить("Раздел22ЕдИзм");
	НедоступныеКолонки.Добавить("Раздел22МестоИнвентаризации");
	НедоступныеКолонки.Добавить("Раздел22КоличествоНедостача");
	НедоступныеКолонки.Добавить("Раздел22КоличествоИзлишки");
	
	НедоступныеКолонки.Добавить("Раздел3НФА");
	НедоступныеКолонки.Добавить("Раздел3ИнвентарныйНомер");
	НедоступныеКолонки.Добавить("Раздел3ЕдИзм");
	НедоступныеКолонки.Добавить("Раздел3МестоИнвентаризации");
	НедоступныеКолонки.Добавить("Раздел3КоличествоНедостача");
	НедоступныеКолонки.Добавить("Раздел3СуммаНедостача");
	НедоступныеКолонки.Добавить("Раздел3КоличествоИзлишки");
	
	НедоступныеКолонки.Добавить("Раздел4НФА");
	НедоступныеКолонки.Добавить("Раздел4ИнвентарныйНомер");
	НедоступныеКолонки.Добавить("Раздел4ЕдИзм");
	НедоступныеКолонки.Добавить("Раздел4МестоИнвентаризации");
	НедоступныеКолонки.Добавить("Раздел4КоличествоНеСоответствует");
	НедоступныеКолонки.Добавить("Раздел4СуммаНеСоответствует");
	НедоступныеКолонки.Добавить("Раздел4КоличествоОбесценение");
	НедоступныеКолонки.Добавить("Раздел4СуммаОбесценение");
	
	ИнвентаризацияСервер.НастроитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки);
	
	НедоступныеКолонки = Новый Массив();
	НедоступныеКолонки.Добавить("СоставКомиссииРаздел2Сотрудник");
	НедоступныеКолонки.Добавить("СоставКомиссииРаздел4Сотрудник");
	
	ИнвентаризацияСервер.НастроитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоВидуИнвентаризации()
	
	ЭтоВыборочнаяИнвентаризация = Объект.ЭтоВыборочнаяИнвентаризация;
	
	Элементы.ГруппаСписокНФА.Видимость = ЭтоВыборочнаяИнвентаризация;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьЕдиницуИзмеренияНоменклатуры(Ссылка)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ЕдиницаИзмерения");
	
КонецФункции

&НаКлиенте
Процедура ОтменитьНедопустимоеИзменениеМестаИнвентаризацииВСтрокеРаздела1(СтандартнаяОбработка)
	
	Если Не ДопустимоИзменитьМестоИнвентаризацииВСтрокеРаздела1(Элементы.Раздел1.ТекущиеДанные) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДопустимоИзменитьМестоИнвентаризацииВСтрокеРаздела1(ТекДанные)
	
	Возврат Не ЗначениеЗаполнено(ТекДанные.МестоИнвентаризации)
		Или ТекДанные.МестоИнвентаризацииЗаполненоВручную;
	
КонецФункции

&НаКлиенте
Процедура ОтменитьДобавлениеСтрокиРаздела21(Отказ)
	
	Если Объект.Раздел1.Количество() > 0 И Объект.Раздел21.Количество() = 0 Тогда
		Отказ = Истина;
		
		ПоказатьПредупреждение(, НСтр("ru='Добавление строки в раздел 2.1 отменено.
			|Необходимо предварительно заполнить раздел 2.1 по данным раздела 1.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьАвтоматическиДобавленнаяСтрокаРаздела21()
	
	Для Каждого ИдСтроки Из Элементы.Раздел21.ВыделенныеСтроки Цикл
		ТекДанные = Объект.Раздел21.НайтиПоИдентификатору(ИдСтроки);
		
		Если Не ТекДанные.ДобавленоВручную Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьПоказателиСтрокиРаздела22(Элемент)
	
	ТекДанные = Элементы.Раздел22.ТекущиеДанные;
	
	ИмяПоля = СтрЗаменить(Элемент.Имя, "Раздел22", "");
	
	Если ТекДанные.ТипНфаОС Тогда
		Если ИмяПоля = "КоличествоНеСоответствует" Тогда
			ТекДанные.КоличествоНеСоответствует = Окр(ТекДанные.КоличествоНеСоответствует, 0);
		КонецЕсли;
		
		Если ИмяПоля = "КоличествоОбесценение" Тогда
			ТекДанные.КоличествоОбесценение = Окр(ТекДанные.КоличествоОбесценение, 0);
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоля = "КоличествоНеСоответствует" Тогда
		Если ТекДанные.КоличествоНеСоответствует > ТекДанные.КоличествоИзРаздела21 Тогда
			ТекДанные.КоличествоНеСоответствует = ТекДанные.КоличествоИзРаздела21;
		КонецЕсли;
		
		ТекДанные.СуммаНеСоответствует = ТекДанные.КоличествоНеСоответствует * ТекДанные.Цена;
		
	ИначеЕсли ИмяПоля = "КоличествоОбесценение" Тогда
		Если ТекДанные.КоличествоОбесценение > ТекДанные.КоличествоИзРаздела21 Тогда
			ТекДанные.КоличествоОбесценение = ТекДанные.КоличествоИзРаздела21;
		КонецЕсли;
		
		ТекДанные.СуммаОбесценение = ТекДанные.КоличествоОбесценение * ТекДанные.Цена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоказателиСтрокиРаздела3(Элемент)
	
	ТекДанные = Элементы.Раздел3.ТекущиеДанные;
	
	ИмяПоля = СтрЗаменить(Элемент.Имя, "Раздел3", "");
	
	//	КоличествоНедостачаПодтверждено
	//	СуммаНедостачаПодтверждено
	//	Цена
	//	КоличествоИзлишкиПодтверждено
	//	СуммаИзлишкиПодтверждено
	//	КоличествоНедостачаНеПодтверждено
	//	СуммаНедостачаНеПодтверждено
	//КоличествоИзлишкиНеПодтверждено	
	
	Если ТекДанные.ТипНфаОС Тогда
		Если ИмяПоля = "КоличествоНедостачаПодтверждено" Тогда
			ТекДанные.КоличествоНедостачаПодтверждено = Окр(ТекДанные.КоличествоНедостачаПодтверждено, 0);
		КонецЕсли;
		
		Если ИмяПоля = "КоличествоИзлишкиПодтверждено" Тогда
			ТекДанные.КоличествоИзлишкиПодтверждено = Окр(ТекДанные.КоличествоИзлишкиПодтверждено, 0);
		КонецЕсли;
		
		Если ИмяПоля = "КоличествоНедостачаНеПодтверждено" Тогда
			ТекДанные.КоличествоНедостачаНеПодтверждено = Окр(ТекДанные.КоличествоНедостачаНеПодтверждено, 0);
		КонецЕсли;
		
		Если ИмяПоля = "КоличествоИзлишкиНеПодтверждено" Тогда
			ТекДанные.КоличествоИзлишкиНеПодтверждено = Окр(ТекДанные.КоличествоИзлишкиНеПодтверждено, 0);
		КонецЕсли;
	КонецЕсли;
	
	ЦенаНедостачи = ?(ТекДанные.КоличествоНедостача <> 0,
		ТекДанные.СуммаНедостача / ТекДанные.КоличествоНедостача,
		0);
	
	Если ИмяПоля = "КоличествоНедостачаПодтверждено" Тогда
		// Подтверждено
		Если ТекДанные.КоличествоНедостачаПодтверждено > ТекДанные.КоличествоНедостача Тогда
			ТекДанные.КоличествоНедостачаПодтверждено = ТекДанные.КоличествоНедостача;
		КонецЕсли;
		
		Если ТекДанные.КоличествоНедостачаПодтверждено = ТекДанные.КоличествоНедостача Тогда
			ТекДанные.СуммаНедостачаПодтверждено = ТекДанные.СуммаНедостача;
		Иначе
			ТекДанные.СуммаНедостачаПодтверждено = ТекДанные.КоличествоНедостачаПодтверждено * ЦенаНедостачи;
		КонецЕсли;
		
		Если ТекДанные.СуммаНедостачаПодтверждено > ТекДанные.СуммаНедостача Тогда
			ТекДанные.СуммаНедостачаПодтверждено = ТекДанные.СуммаНедостача;
		КонецЕсли;
		
		// Не подтверждено
		ТекДанные.КоличествоНедостачаНеПодтверждено	= ТекДанные.КоличествоНедостача - ТекДанные.КоличествоНедостачаПодтверждено;
		ТекДанные.СуммаНедостачаНеПодтверждено		= ТекДанные.СуммаНедостача - ТекДанные.СуммаНедостачаПодтверждено;
		
	ИначеЕсли ИмяПоля = "СуммаНедостачаПодтверждено" Тогда
		// Подтверждено
		Если ТекДанные.СуммаНедостачаПодтверждено > ТекДанные.СуммаНедостача Тогда
			ТекДанные.СуммаНедостачаПодтверждено = ТекДанные.СуммаНедостача;
		КонецЕсли;
		
		// Не подтверждено
		ТекДанные.СуммаНедостачаНеПодтверждено = ТекДанные.СуммаНедостача - ТекДанные.СуммаНедостачаПодтверждено;
		
	ИначеЕсли ИмяПоля = "Цена" Тогда
		ТекДанные.СуммаИзлишкиПодтверждено = ТекДанные.КоличествоИзлишкиПодтверждено * ТекДанные.Цена;
		
		
	ИначеЕсли ИмяПоля = "КоличествоИзлишкиПодтверждено" Тогда
		// Подтверждено
		Если ТекДанные.КоличествоИзлишкиПодтверждено > ТекДанные.КоличествоИзлишки Тогда
			ТекДанные.КоличествоИзлишкиПодтверждено = ТекДанные.КоличествоИзлишки;
		КонецЕсли;
		
		ТекДанные.СуммаИзлишкиПодтверждено = ТекДанные.КоличествоИзлишкиПодтверждено * ТекДанные.Цена;
		
		// Не подтверждено
		ТекДанные.КоличествоИзлишкиНеПодтверждено = ТекДанные.КоличествоИзлишки - ТекДанные.КоличествоИзлишкиПодтверждено;
		
		
	ИначеЕсли ИмяПоля = "КоличествоНедостачаНеПодтверждено" Тогда
		// Не подтверждено
		Если ТекДанные.КоличествоНедостачаНеПодтверждено > ТекДанные.КоличествоНедостача Тогда
			ТекДанные.КоличествоНедостачаНеПодтверждено = ТекДанные.КоличествоНедостача;
		КонецЕсли;
		
		Если ТекДанные.КоличествоНедостачаНеПодтверждено = ТекДанные.КоличествоНедостача Тогда
			ТекДанные.СуммаНедостачаНеПодтверждено = ТекДанные.СуммаНедостача;
		Иначе
			ТекДанные.СуммаНедостачаНеПодтверждено = ТекДанные.КоличествоНедостачаНеПодтверждено * ЦенаНедостачи;
		КонецЕсли;
		
		Если ТекДанные.СуммаНедостачаНеПодтверждено > ТекДанные.СуммаНедостача Тогда
			ТекДанные.СуммаНедостачаНеПодтверждено = ТекДанные.СуммаНедостача;
		КонецЕсли;
		
		// Подтверждено
		ТекДанные.КоличествоНедостачаПодтверждено	= ТекДанные.КоличествоНедостача - ТекДанные.КоличествоНедостачаНеПодтверждено;
		ТекДанные.СуммаНедостачаПодтверждено		= ТекДанные.СуммаНедостача - ТекДанные.СуммаНедостачаНеПодтверждено;
		
	ИначеЕсли ИмяПоля = "СуммаНедостачаНеПодтверждено" Тогда
		// Подтверждено
		Если ТекДанные.СуммаНедостачаНеПодтверждено > ТекДанные.СуммаНедостача Тогда
			ТекДанные.СуммаНедостачаНеПодтверждено = ТекДанные.СуммаНедостача;
		КонецЕсли;
		
		// Не подтверждено
		ТекДанные.СуммаНедостачаПодтверждено = ТекДанные.СуммаНедостача - ТекДанные.СуммаНедостачаНеПодтверждено;
		
		
	ИначеЕсли ИмяПоля = "КоличествоИзлишкиНеПодтверждено" Тогда
		// Не подтверждено
		Если ТекДанные.КоличествоИзлишкиНеПодтверждено > ТекДанные.КоличествоИзлишки Тогда
			ТекДанные.КоличествоИзлишкиНеПодтверждено = ТекДанные.КоличествоИзлишки;
		КонецЕсли;
		
		// Подтверждено
		ТекДанные.КоличествоИзлишкиПодтверждено = ТекДанные.КоличествоИзлишки - ТекДанные.КоличествоИзлишкиНеПодтверждено;
		ТекДанные.СуммаИзлишкиПодтверждено = ТекДанные.КоличествоИзлишкиПодтверждено * ТекДанные.Цена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизитыДокументаПриОтсутствииПодтвержденияВСтрокеРаздела3()
	
	ТекДанные = Элементы.раздел3.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекДанные.КоличествоНедостачаПодтверждено)
		И Не ЗначениеЗаполнено(ТекДанные.СуммаНедостачаПодтверждено)
		И Не ЗначениеЗаполнено(ТекДанные.КоличествоИзлишкиПодтверждено)
		И Не ЗначениеЗаполнено(ТекДанные.СуммаИзлишкиПодтверждено) Тогда
		
		ОчищающаяСтруктура = Новый Структура("НаименованиеДокумента,НомерДокумента,ДатаДокумента");
		
		ЗаполнитьЗначенияСвойств(ТекДанные, ОчищающаяСтруктура);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьНадписиМестаИнвентаризации()
	
	ЕстьТекстовоеЗначение = Ложь;
	
	Для Каждого СтрокаТаблицы Из Объект.МестаИнвентаризации Цикл
		Если ТипЗнч(СтрокаТаблицы.МестоИнвентаризации) = Тип("Строка") Тогда
			ЕстьТекстовоеЗначение = Истина;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ШапкаПоказатьСообщениеМестоИнвентаризации.Видимость = ЕстьТекстовоеЗначение;
	Элементы.МестаИнвентаризацииПоказатьСообщениеМестоИнвентаризации.Видимость = ЕстьТекстовоеЗначение;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьСпискаНФА()
	
	// Поле СписокНФА подключен к подсистеме СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов.
	// Для таблицы формы этой подсистемой устанавливается признак ТолькоПросмотр для блокировки реквизита.
	// Для других полей формы сбрасывается признак Доступность для блокировки реквизита.
	
	Если Не Объект.ЭтоВыборочнаяИнвентаризация Или ИнвентаризацияКлиентСервер.ЭтоСодержательныйДокументСерииДокументовОписи(Объект) Тогда
		// Список НФА не показывается и не используется.
		Возврат;
	КонецЕсли;
	
	НоваяДоступность = Истина;
	
	Если ЗначениеЗаполнено(ДанныеПанелиРасписки.Расписка) И ДанныеПанелиРасписки.РаспискаПроведена Тогда
		НоваяДоступность = Ложь;
	КонецЕсли;
	
	// Список элементов формы см. в модуле менеджера, Функция ПолучитьБлокируемыеРеквизитыОбъекта()
	ИменаЗависимыхЭлементовФормы = СтрРазделить("СписокНФАГруппаПодобрать,СписокНФАПодборМЗ,СписокНФАПодборОС", ", ", Ложь);
	
	Элементы.СписокНФА.ТолькоПросмотр = Не НоваяДоступность;
	
	Для Каждого ИмяЭлемента Из ИменаЗависимыхЭлементовФормы Цикл
		Элементы[ИмяЭлемента].Доступность = НоваяДоступность;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НужноЗаблокироватьРеквизиты()
	
	Возврат ИнвентаризацияКлиентСервер.ЭтоСодержательныйДокументСерииДокументовОписи(Объект)
		Или ЗначениеЗаполнено(ДанныеПанелиРасписки.Расписка);
	
КонецФункции

#Область УсловноеОформление

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ИнвентаризацияСервер.ДобавитьУсловноеОформлениеСоставКомиссииПричинаОтсутствия(ЭтаФорма, "СоставКомиссииРаздел2");
	ИнвентаризацияСервер.ДобавитьУсловноеОформлениеСоставКомиссииПричинаОтсутствия(ЭтаФорма, "СоставКомиссииРаздел4");
	
	ДобавитьУсловноеОформлениеКФО0ВСпискеСчетов();
	
	ДобавитьУсловноеОформление_НеПрименяетсяИнвНомер("СписокНФА");
	
	ДобавитьУсловноеОформлениеРаздела1();
	
	ДобавитьУсловноеОформлениеРаздела21();
	
	ДобавитьУсловноеОформлениеРаздела22();
	
	ДобавитьУсловноеОформлениеРаздела3();
	
	ДобавитьУсловноеОформлениеРаздела4();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеРаздела1()
	
	ДобавитьУсловноеОформление_НеПрименяетсяИнвНомер("Раздел1");
	
	ДобавитьУсловноеОформление_ФорматКоличества("Раздел1", "Количество");
	
	ДобавитьУсловноеОформление_ОформлениеМестаИнвентаризацииЗаполненногоАвтоматическиВРазделе1();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеРаздела21()
	
	ДобавитьУсловноеОформление_НеПрименяетсяИнвНомер("Раздел21");
	
	ДобавитьУсловноеОформление_ФорматКоличества("Раздел21", "Количество");
	
	ДобавитьУсловноеОформление_НедоступностьАвтоСтрокРаздела21();
	
	ДобавитьУсловноеОформление_БлокировкаКолонокВоФрагментахСтроки("Раздел21");
	
	ДобавитьУсловноеОформление_СбросОтметкиНезаполненногоКоличестваВРазделе21();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеРаздела22()
	
	ДобавитьУсловноеОформление_НеПрименяетсяИнвНомер("Раздел22");
	
	ДобавитьУсловноеОформление_ФорматКоличества("Раздел22", "КоличествоНедостача,КоличествоИзлишки,КоличествоНеСоответствует,КоличествоОбесценение");
	
	ДобавитьУсловноеОформление_СбросОтметкиНезаполненногоНеСоответствуетИОбесценениеРаздел22();
	
	ДобавитьУсловноеОформление_НедоступнаКолонкаСуммаНедостачиРаздел22();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеРаздела3()
	
	ДобавитьУсловноеОформление_НеПрименяетсяИнвНомер("Раздел3");
	
	ДобавитьУсловноеОформление_ФорматКоличества("Раздел3", "КоличествоНедостача,КоличествоИзлишки,КоличествоНедостачаПодтверждено,КоличествоИзлишкиПодтверждено,КоличествоНедостачаНеПодтверждено,КоличествоИзлишкиНеПодтверждено");
	
	//
	// Недоступность полей излишков (Раздел 3)
	//
	ИменаПолейИзлишки = Новый Массив();
	ИменаПолейИзлишки.Добавить("Цена");
	ИменаПолейИзлишки.Добавить("КоличествоИзлишкиПодтверждено");
	ИменаПолейИзлишки.Добавить("СуммаИзлишкиПодтверждено");
	ИменаПолейИзлишки.Добавить("КоличествоИзлишкиНеПодтверждено");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Недоступность полей излишков (Раздел 3)'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Раздел3.КоличествоИзлишки");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='х'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	// Оформляемые поля
	Для Каждого ИмяПоля Из ИменаПолейИзлишки Цикл
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Раздел3" + ИмяПоля);
	КонецЦикла;
	
	//
	// Недоступность полей количества недостачи (Раздел 3)
	//
	ИменаПолейНедостача = Новый Массив();
	ИменаПолейНедостача.Добавить("КоличествоНедостачаНеПодтверждено");
	ИменаПолейНедостача.Добавить("КоличествоНедостачаПодтверждено");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Недоступность полей количества недостачи (Раздел 3)'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Раздел3.КоличествоНедостача");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='х'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	// Оформляемые поля
	Для Каждого ИмяПоля Из ИменаПолейНедостача Цикл
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Раздел3" + ИмяПоля);
	КонецЦикла;
	
	//
	// Недоступность полей суммы недостачи (Раздел 3)
	//
	ИменаПолейНедостача = Новый Массив();
	ИменаПолейНедостача.Добавить("СуммаНедостачаНеПодтверждено");
	ИменаПолейНедостача.Добавить("СуммаНедостачаПодтверждено");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Недоступность полей суммы недостачи (Раздел 3)'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Раздел3.СуммаНедостача");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='х'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	// Оформляемые поля
	Для Каждого ИмяПоля Из ИменаПолейНедостача Цикл
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Раздел3" + ИмяПоля);
	КонецЦикла;	
	
	//
	// Отметка незаполненного наименования, номера, даты первичного документа (Раздел 3)
	//
	ИменаПолейДокумента = Новый Массив();
	ИменаПолейДокумента.Добавить("НаименованиеДокумента");
	ИменаПолейДокумента.Добавить("НомерДокумента");
	ИменаПолейДокумента.Добавить("ДатаДокумента");
	
	Для Каждого ИмяПоля Из ИменаПолейДокумента Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = СтрШаблон(НСтр("ru='Отметка незаполненного первичного документа (Раздел 3, %1)'"), ИмяПоля);
		
		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Раздел3.СуммаИзлишкиПодтверждено");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Раздел3.КоличествоИзлишкиПодтверждено");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Раздел3.Цена");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Раздел3.СуммаНедостачаПодтверждено");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Раздел3.КоличествоНедостачаПодтверждено");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Раздел3." + ИмяПоля);
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='х'"));
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
		
		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Раздел3" + ИмяПоля);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеРаздела4()
	
	ДобавитьУсловноеОформление_НеПрименяетсяИнвНомер("Раздел4", Истина);
	
	ДобавитьУсловноеОформление_ФорматКоличества("Раздел4", "КоличествоНедостачаНеПодтверждено,КоличествоИзлишкиНеПодтверждено,КоличествоНеСоответствует,КоличествоОбесценение");
	
	ДобавитьУсловноеОформление_НедоступностьГраф810Раздела4();
	
	ИнвентаризацияСервер.ДобавитьУсловноеОформление_НедоступностьСтатусаОбъясненияПриОтсутствииОтклонений(ЭтотОбъект);
	
	ИменаПолей = Новый Массив();
	ИменаПолей.Добавить("НомерСтроки");
	ИменаПолей.Добавить("КодСтроки");
	ИменаПолей.Добавить("НФА");
	ИменаПолей.Добавить("ИнвентарныйНомер");
	ИменаПолей.Добавить("ЕдИзм");
	ИменаПолей.Добавить("МестоИнвентаризации");
	ИменаПолей.Добавить("СтатусОбъяснения");
	ИменаПолей.Добавить("КоличествоНедостачаНеПодтверждено");
	ИменаПолей.Добавить("СуммаНедостачаНеПодтверждено");
	ИменаПолей.Добавить("КоличествоИзлишкиНеПодтверждено");
	ИменаПолей.Добавить("КоличествоНеСоответствует");
	ИменаПолей.Добавить("СуммаНеСоответствует");
	ИменаПолей.Добавить("КоличествоОбесценение");
	ИменаПолей.Добавить("СуммаОбесценение");
	
	ИнвентаризацияСервер.ДобавитьУсловноеОформление_НулеваяСтрокаРазделаПриОтсутствииОтклонений(ЭтотОбъект, "Раздел4", ИменаПолей);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеКФО0ВСпискеСчетов()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Представление пустого КФО в списке счетов'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СписокСчетов.КФО");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "0");
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокСчетовКФО");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_НеПрименяетсяИнвНомер(ИмяТЧ, ОтключитьПриВыявленныхОтклоненияхВРазделе4 = Ложь)
	
	//---
	// надпись "не применяется" для инвентарного номера
	//---
	ПредставлениеШаблон = НСтр("ru='Надпись ""не применяется"" колонки Инвентарный номер для номенклатуры (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ТипНфаОС");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	
	Если ОтключитьПриВыявленныхОтклоненияхВРазделе4 Тогда
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВыявленыОтклонения");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Истина;
	КонецЕсли;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='не применяется'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ИнвентарныйНомер");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_ФорматКоличества(ИмяТЧ, ИменаКолонокКоличества)
	
	ПредставлениеШаблон = НСтр("ru='Форма колонки Количество для ОС (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ТипНфаОС");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧДЦ=0");
	
	// Оформляемые поля
	МассивИмен = СтрРазделить(ИменаКолонокКоличества, ", ", Ложь);
	Для Каждого ИмяПоля Из МассивИмен Цикл
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + ИмяПоля);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_БлокировкаКолонокВоФрагментахСтроки(ИмяТЧ) Экспорт
	
	ИменаПолей = Новый Массив();
	ИменаПолей.Добавить("НФА");
	ИменаПолей.Добавить("ИнвентарныйНомер");
	ИменаПолей.Добавить("ЕдИзм");
	ИменаПолей.Добавить("МестоИнвентаризации");
	ИменаПолей.Добавить("Количество");
	ИменаПолей.Добавить("СтатусОбъекта");
	ИменаПолей.Добавить("ЦелеваяФункцияАктива");
	
	ШрифтНаклонный = Новый Шрифт(,,,Истина);
	
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = СтрШаблон(НСтр("ru='Выделение поля %1 во фрагментах разбитой строки (%2)'"), ИмяПоля, ИмяТЧ);
		
		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ПризнакФрагментаСтроки");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Истина;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтНаклонный);
		
		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + ИмяПоля);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_НедоступностьАвтоСтрокРаздела21()
	
	ИмяТЧ = "Раздел21";
	
	ИменаПолей = Новый Массив();
	ИменаПолей.Добавить("НФА");
	ИменаПолей.Добавить("ИнвентарныйНомер");
	ИменаПолей.Добавить("ЕдИзм");
	ИменаПолей.Добавить("МестоИнвентаризации");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Недоступность полей в авто строках раздела 2.1'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ДобавленоВручную");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);

	// Оформляемые поля
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + ИмяПоля);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_ОформлениеМестаИнвентаризацииЗаполненногоАвтоматическиВРазделе1()
	
	ИмяТЧ = "Раздел1";
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Оформление места инвентаризации, заполненного автоматически в разделе1'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".МестоИнвентаризацииЗаполненоВручную");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "МестоИнвентаризации");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_СбросОтметкиНезаполненногоКоличестваВРазделе21()
	
	ИмяТЧ = "Раздел21";
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Сброс отметки незаполненного в автоматически добавленных строках раздела 2.1'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ДобавленоВручную");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "Количество");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_СбросОтметкиНезаполненногоНеСоответствуетИОбесценениеРаздел22()
	
	ДобавитьУсловноеОформление_СбросОтметкиНезаполненногоКачХарПриНаличииОтклоненийРаздел22(
		"КоличествоНеСоответствует", "СуммаНеСоответствует");
	ДобавитьУсловноеОформление_СбросОтметкиНезаполненногоКачХарПриНаличииОтклоненийРаздел22(
		"КоличествоОбесценение", "СуммаОбесценение");
	
	ДобавитьУсловноеОформление_СбросОтметкиНезаполненногоКачХарПриЗаполненныхКорПоляхРаздел22(
		"КоличествоНеСоответствует", "СуммаНеСоответствует",
		"КоличествоОбесценение", "СуммаОбесценение");
	ДобавитьУсловноеОформление_СбросОтметкиНезаполненногоКачХарПриЗаполненныхКорПоляхРаздел22(
		"КоличествоОбесценение", "СуммаОбесценение",
		"КоличествоНеСоответствует", "СуммаНеСоответствует");
	
	ДобавитьУсловноеОформление_СбросОтметкиНезаполненногоКоличествоКачХарПриОтсутствииКоличестваРаздел22();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_СбросОтметкиНезаполненногоКачХарПриНаличииОтклоненийРаздел22(ИмяПоляКоличество, ИмяПоляСумма)
	
	ИмяТЧ = "Раздел22";
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Сброс отметки незаполненного полей кач.хар. (%1, %2) при наличии отклонений в строке (%3)'"),
		ИмяПоляКоличество, ИмяПоляСумма, ИмяТЧ);
	
	// Условия
	ГруппаИли = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	Условие = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.КоличествоНедостача", ИмяТЧ));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Условие = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.СуммаНедостача", ИмяТЧ));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Условие = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.КоличествоИзлишки", ИмяТЧ));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + ИмяПоляКоличество);
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + ИмяПоляСумма);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_СбросОтметкиНезаполненногоКачХарПриЗаполненныхКорПоляхРаздел22(ИмяПоляКоличество, ИмяПоляСумма,
		ИмяПоляКоличествоКор, ИмяПоляСуммаКор)
	
	ИмяТЧ = "Раздел22";
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Сброс отметки незаполненного полей кач.хар. (%1, %2) при заполненных полях %3, %4 (%5)'"),
		ИмяПоляКоличество, ИмяПоляСумма, ИмяПоляКоличествоКор, ИмяПоляСуммаКор, ИмяТЧ);
	
	// Условия (заполнены кор.поля)
	ГруппаИли = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	Условие = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.%2", ИмяТЧ, ИмяПоляКоличествоКор));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Условие = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.%2", ИмяТЧ, ИмяПоляСуммаКор));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + ИмяПоляКоличество);
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + ИмяПоляСумма);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_СбросОтметкиНезаполненногоКоличествоКачХарПриОтсутствииКоличестваРаздел22()
	
	ИмяТЧ = "Раздел22";
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Сброс отметки незаполненного полей количества кач.хар. при отсутствии количества в разделе 2.1 (%1)'"), ИмяТЧ);
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".КоличествоИзРаздела21");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = 0;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "КоличествоНеСоответствует");
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "КоличествоОбесценение");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_НедоступнаКолонкаСуммаНедостачиРаздел22()
	
	ИмяТЧ = "Раздел22";
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Недоступна колонка Сумма недостачи  (%1)'"), ИмяТЧ);
	
	// Условия
	ГруппаИли = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	Условие = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".КоличествоИзРаздела21");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Условие = ГруппаИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".КоличествоНедостача");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "СуммаНедостача");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_НедоступностьГраф810Раздела4()
	
	//
	// Недоступность граф 8-10 при статусах 0, 2 (Раздел 4)
	//
	ИменаПолей = Новый Массив();
	ИменаПолей.Добавить("КоличествоНедостачаНеПодтверждено");
	ИменаПолей.Добавить("СуммаНедостачаНеПодтверждено");
	ИменаПолей.Добавить("КоличествоИзлишкиНеПодтверждено");
	
	СписокСтатусов = Новый СписокЗначений();
	СписокСтатусов.Добавить(Перечисления.СтатусыОбъясненияОтветственногоЛица.НеТребуется);
	СписокСтатусов.Добавить(Перечисления.СтатусыОбъясненияОтветственногоЛица.Принято);
	СписокСтатусов.Добавить(Перечисления.СтатусыОбъясненияОтветственногоЛица.ПустаяСсылка());
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Недоступность граф 8-10 при статусах 0, 2 (Раздел 4)'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Раздел4.СтатусОбъяснения");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	Условие.ПравоеЗначение = СписокСтатусов;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	
	// Оформляемые поля
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Раздел4" + ИмяПоля);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПодборОС

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыФормы) Экспорт
	
	ДополнитьПараметрыПодбораСервер(ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьПараметрыПодбораСервер(ПараметрыФормы)
	
	Документы.ИнвентаризационнаяОписьНФА.ДополнитьПараметрыФормыПодбораОстатковОС(ПараметрыФормы, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоОстаткамЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработкаВыбораПодбораОССервер(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодбораОССервер(Знач ВыбранноеЗначение)
	
	ТаблицаОС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресОСВХранилище);
	
	// Предзаполнение корзины временно отключено.
	//ПоискОС = Новый Структура("ТипНфаОС", Истина);
	//
	//МассивСтрок = Объект.СписокНФА.НайтиСтроки(ПоискОС);
	//
	//Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
	//	ИндексСтроки = Объект.СписокНФА.Индекс(СтрокаТаблицы);
	//	
	//	Объект.СписокНФА.Удалить(ИндексСтроки);
	//КонецЦикла;
	
	СлужебныеКолонки = Новый Структура("ТипНфаНоменклатура,ТипНфаОС", Ложь, Истина);
	
	Поиск = Новый Структура("НФА,ИнвентарныйНомер");
	
	Для Каждого СтрокаТаблицыОС Из ТаблицаОС Цикл
		Поиск.НФА = СтрокаТаблицыОС.ОсновноеСредство;
		Поиск.ИнвентарныйНомер = СтрокаТаблицыОС.ИнвентарныйНомер;
		
		МассивСтрок = Объект.СписокНФА.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.СписокНФА.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Поиск);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СлужебныеКолонки);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПодборМЗ

&НаКлиенте
Процедура ДополнитьСтруктуруПодбора(ПараметрыПодбора, ДополнительныйПараметр) Экспорт
	
	ДополнитьСтруктуруПодбораСервер(ПараметрыПодбора, ДополнительныйПараметр);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьСтруктуруПодбораСервер(ПараметрыФормы, ДополнительныйПараметр)
	
	Документы.ИнвентаризационнаяОписьНФА.ДополнитьПараметрыФормыПодбораОстатковМЗ(ПараметрыФормы, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение)
	
	ТаблицаМЗ = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	ТаблицаМЗ.Колонки.Номенклатура.Имя = "НФА";
	
	СлужебныеКолонки = Новый Структура("ТипНфаНоменклатура,ТипНфаОС", Истина, Ложь);
	
	Поиск = Новый Структура("НФА");
	
	Для Каждого СтрокаТаблицыМЗ Из ТаблицаМЗ Цикл
		ЗаполнитьЗначенияСвойств(Поиск, СтрокаТаблицыМЗ);
		
		МассивСтрок = Объект.СписокНФА.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.СписокНФА.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыМЗ);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СлужебныеКолонки);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредустановленныйОтборПодборОстатковМЗ()
	
	СписокСсылок = Документы.ИнвентаризационнаяОписьНФА.ПолучитьИсключаемыеТипыНоменклатуры();
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных();
	
	НовыйЭлемент = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипНоменклатуры");
	НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	НовыйЭлемент.ПравоеЗначение = Новый ФиксированныйМассив(СписокСсылок);
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(НастройкиКомпоновки);
	
КонецФункции

&НаКлиенте
Процедура УстановитьПараметрыВыбораОстатковНФА(ВыбранныйТип)
	
	МассивПараметров = Новый Массив();
	
	Если ВыбранныйТип = Тип("СправочникСсылка.Номенклатура") Тогда
		НовыйПараметр = Новый ПараметрВыбора("ПредустановленныйОтбор", ПредустановленныйОтборПодборОстатковМЗ);
		МассивПараметров.Добавить(НовыйПараметр);
	КонецЕсли;
	
	Элементы.СписокНФАНФА.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

#КонецОбласти

#Область ГрупповоеЗаполнениеСтрок

&НаКлиенте
Процедура ОткрытьФормуГрупповогоЗаполненияСтрок(ИмяТабличнойЧасти)
	
	КоличествоСтрок = Элементы[ИмяТабличнойЧасти].ВыделенныеСтроки.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		ТекстСообщения = НСтр("ru='Выделите несколько строк для выполнения группового заполнения'");
		
		ПоказатьПредупреждение(, ТекстСообщения, 20);
		
		Возврат;
	КонецЕсли;
	
	Если ИмяТабличнойЧасти = "Раздел1" И ОтменитьВызовГрупповогоЗаполненияСтрокРаздела1() Тогда
		Возврат;
	КонецЕсли;
	
	СвязиПараметровВыбора = Новый Структура();
	СвязиПараметровВыбора.Вставить("МассивМестИнвентаризации", ПолучитьМассивМестИнвентаризации());
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	
	ОповещениеВыбор = Новый ОписаниеОповещения("ЗакрытаФормаГрупповогоЗаполненияСтрок", ЭтаФорма, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КоличествоСтрок",			КоличествоСтрок);
	ПараметрыФормы.Вставить("СвязиПараметровВыбора",	СвязиПараметровВыбора);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",		Новый Структура());
	ПараметрыФормы.Вставить("ОписьСсылка",				Объект.Ссылка);
	ПараметрыФормы.Вставить("ИмяТабличнойЧасти",		ИмяТабличнойЧасти);
	
	НеиспользуемыеПоля = "";
	
	Если ИмяТабличнойЧасти = "Раздел1" Тогда
		НеиспользуемыеПоля = "СтатусОбъекта,ЦелеваяФункцияАктива,Примечание,ЗаключениеКомиссии,СтатусОбъяснения,ОбъяснениеПричинРасхождений";
		
	ИначеЕсли ИмяТабличнойЧасти = "Раздел21" Тогда
		НеиспользуемыеПоля = "ЗаключениеКомиссии,СтатусОбъяснения,ОбъяснениеПричинРасхождений";
		
		Если ЕстьАвтоматическиДобавленнаяСтрокаРаздела21() Тогда
			НеиспользуемыеПоля = НеиспользуемыеПоля + ",МестоИнвентаризации";
		КонецЕсли;
		
	ИначеЕсли ИмяТабличнойЧасти = "Раздел3" Тогда
		НеиспользуемыеПоля = "МестоИнвентаризации,Примечание,СтатусОбъекта,СтатусОбъяснения,ЦелеваяФункцияАктива,ЗаключениеКомиссии";
		
	ИначеЕсли ИмяТабличнойЧасти = "Раздел4" Тогда
		НеиспользуемыеПоля = "СтатусОбъекта,ЦелеваяФункцияАктива,Примечание,МестоИнвентаризации,ОбъяснениеПричинРасхождений";
		
		Если Не Объект.ВыявленыОтклонения Тогда
			НеиспользуемыеПоля = НеиспользуемыеПоля + ",СтатусОбъяснения";
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("НеиспользуемыеПоля", НеиспользуемыеПоля);
	
	ОткрытьФорму("Документ.ИнвентаризационнаяОписьНФА.Форма.ГрупповоеЗаполнениеСтрок", ПараметрыФормы,,,,, ОповещениеВыбор, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытаФормаГрупповогоЗаполненияСтрок(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТабличнойЧасти = ПараметрыОповещения["ИмяТабличнойЧасти"];
	
	ВыделенныеСтроки = Элементы[ИмяТабличнойЧасти].ВыделенныеСтроки;
	
	СтруктураЗаполнения = Новый Структура();
	
	Если ИмяТабличнойЧасти = "Раздел1" Тогда
		СтруктураЗаполнения.Вставить("МестоИнвентаризацииЗаполненоВручную", Истина);
	КонецЕсли;
	
	Если ВыделенныеСтроки.Количество() < 100 Тогда
		ЗаполнитьВыделенныеСтрокиКлиент(ИмяТабличнойЧасти, ВыделенныеСтроки, РезультатВыбора, СтруктураЗаполнения);
	Иначе
		ЗаполнитьВыделенныеСтрокиСервер(ИмяТабличнойЧасти, ВыделенныеСтроки, РезультатВыбора, СтруктураЗаполнения);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВыделенныеСтрокиКлиент(ИмяТабличнойЧасти, ВыделенныеСтроки, РезультатВыбора, СтруктураЗаполнения)
	
	ЗаполнитьВыделенныеСтроки(Объект[ИмяТабличнойЧасти], ВыделенныеСтроки, РезультатВыбора, СтруктураЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыделенныеСтрокиСервер(ИмяТабличнойЧасти, ВыделенныеСтроки, РезультатВыбора, СтруктураЗаполнения)
	
	ЗаполнитьВыделенныеСтроки(Объект[ИмяТабличнойЧасти], ВыделенныеСтроки, РезультатВыбора, СтруктураЗаполнения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьВыделенныеСтроки(ТабличнаяЧасть, ВыделенныеСтроки, РезультатВыбора, СтруктураЗаполнения)
	
	Для Каждого ИдСтроки Из ВыделенныеСтроки Цикл
		СтрокаТаблицы = ТабличнаяЧасть.НайтиПоИдентификатору(ИдСтроки);
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РезультатВыбора);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураЗаполнения);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьМассивМестИнвентаризации()
	
	Результат = Новый Массив();
	
	Для Каждого СтрокаТаблицы Из Объект.МестаИнвентаризации Цикл
		Результат.Добавить(СтрокаТаблицы.МестоИнвентаризации);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ТСД

// Выгрузка в ТСД

&НаКлиенте
Процедура ПроверитьИВыгрузитьДанныеВТСДКлиент()
	
	Перем ЕстьОСБезШтрихкода;
	
	#Если ВебКлиент Тогда
	ПоказатьПредупреждение(,НСтр("ru = 'Работа с торговым оборудованием не поддерживается в режиме веб-клиента.
					|Для использования терминала сбора данных запустите программу в режиме тонкого клиента.'"), 15);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Объекты не выгружены'"));
	Возврат;
	#КонецЕсли

	АдресХранилищаСведений = ПолучитьСведенияДляВыгрузкиВТСД(ЕстьОСБезШтрихкода);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("АдресХранилищаСведений", АдресХранилищаСведений);
	
	Если ЕстьОСБезШтрихкода > 0 Тогда
		
		ТекстВопроса = НСтр("ru = 'Обнаружены объекты без штрихкода.
									|Объекты без штрихкода не будут выгружены в ТСД.
									|Открыть форму формирования штрихкода для данных объектов?'");
		Кнопки = Новый СписокЗначений();									
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Открыть форму формирования штрихкода'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Выгрузить в ТСД объекты со штрихкодом'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		Оповещение = Новый ОписаниеОповещения("ПроверитьИВыгрузитьДанныеВТСДКлиент_ОтветФормированиеШтрихкода", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, 15);
		
	Иначе
		ВыгрузитьДанныеВТСДКлиент(Неопределено, ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСведенияДляВыгрузкиВТСД(ЕстьОСБезШтрихкода = Неопределено, ДляСозданияШтрихкодов = Ложь)
	
	Возврат Документы.ИнвентаризационнаяОписьНФА.ПолучитьСведенияДляВыгрузкиВТСД(ЭтаФорма, ЕстьОСБезШтрихкода, ДляСозданияШтрихкодов);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьИВыгрузитьДанныеВТСДКлиент_ОтветФормированиеШтрихкода(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		// Открыть форму ввода штрихкода и после закрытия перезаполнить таблицу ТСД
		ПараметрыФормы = Новый Структура("МассивОбъектов", ПолучитьСведенияДляВыгрузкиВТСД(, Истина));
		
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьДанныеВТСДКлиент", ЭтотОбъект);
		
		ОткрытьФорму("РегистрСведений.ШтрихКоды.Форма.ФормаСозданияШтрихкодовОС", ПараметрыФормы, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		Возврат;
		
	ИначеЕсли Результат <> КодВозвратаДиалога.Нет Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Объекты не выгружены'"));
		
		Возврат;
		
	Иначе
		ВыгрузитьДанныеВТСДКлиент(Неопределено, ДополнительныеПараметры);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеВТСДКлиент(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	МассивТСД = ПрочитатьСведенияДляВыгрузкиВТСД(ДополнительныеПараметры);
	
	Если МассивТСД.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Нет объектов для выгрузки в ТСД'"), 15);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Объекты не выгружены'"));
		Возврат;
	КонецЕсли;
	
	УправлениеОсновнымиСредствамиКлиент.ВыгрузитьДанныеВТСД(ЭтотОбъект, МассивТСД);
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьСведенияДляВыгрузкиВТСД(ДополнительныеПараметры)
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		АдресХранилищаСведений = ДополнительныеПараметры.АдресХранилищаСведений;
	Иначе
		// Перезаполнить таблицу ТСД после закрытия формы штрихкода
		АдресХранилищаСведений = ПолучитьСведенияДляВыгрузкиВТСД();
	КонецЕсли;
	
	Возврат ПолучитьИзВременногоХранилища(АдресХранилищаСведений);
	
КонецФункции

// Загрузка из ТСД

&НаКлиенте
Процедура ПроверитьИЗагрузитьДанныеИзТСДКлиент()
	
	#Если ВебКлиент Тогда
	ПоказатьПредупреждение(,НСтр("ru = 'Работа с торговым оборудованием не поддерживается в режиме веб-клиента.
					|Для использования терминала сбора данных запустите программу в режиме тонкого клиента.'"), 15);
	Возврат;
	#КонецЕсли
	
	Отказ = Ложь;
	
	ОтменитьДобавлениеСтрокиРаздела21(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Доступность = Ложь; // Блокируем интерфейс пользователя.
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьДанныеИзТСДКлиент_Завершение", ЭтотОбъект);
	
	ОборудованиеТерминалыСбораДанныхКлиент.НачатьЗагрузкуДанныеИзТСД(Оповещение, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзТСДКлиент_Завершение(Результат, ДополнительныеПараметры) Экспорт

	ЭтаФорма.Доступность = Истина; // Разблокировка интерфейса пользователя.
	
	Если Результат.Результат Тогда
		МассивТСД = Результат.ТаблицаТоваров;
		
		ЗагрузитьДанныеИзТСДСервер(МассивТСД);
		
		ПоказатьПредупреждение(,Нстр("ru = 'Данные загружены'"));
	Иначе
		ТекстСообщения = НСтр("ru = 'При выполнении операции произошла ошибка:""%1"".'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Результат.ОписаниеОшибки);
		
		Сообщить(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеИзТСДСервер(МассивТСД)
	
	Документы.ИнвентаризационнаяОписьНФА.ЗагрузитьДанныеИзТСД(Объект, МассивТСД);
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьОСПоШтрихкоду(Штрихкод)
	
	РезультатПоискаШК = РегистрыСведений.Штрихкоды.НайтиОбъектПоШтрихкоду(Штрихкод);
	
	Если Не ЗначениеЗаполнено(РезультатПоискаШК.ОсновноеСредство) Тогда
		Возврат;
	КонецЕсли;
	
	ПоискСтроки = Новый Структура();
	ПоискСтроки.Вставить("НФА",				РезультатПоискаШК.ОсновноеСредство);
	ПоискСтроки.Вставить("ИнвентарныйНомер",РезультатПоискаШК.ИнвентарныйНомер);
	
	МассивСтрок = Объект.Раздел21.НайтиСтроки(ПоискСтроки);
	
	Если МассивСтрок.Количество() = 0 Тогда
		СтруктураЗаполнения = Новый Структура();
		СтруктураЗаполнения.Вставить("ДобавленоВручную",	Истина);
		СтруктураЗаполнения.Вставить("ТипНфаОС",			Истина);
		СтруктураЗаполнения.Вставить("ТипНфаНоменклатура",	Ложь);
		СтруктураЗаполнения.Вставить("ЕдИзм",				ЕдИзмШт);
		
		Если Объект.МестаИнвентаризации.Количество() = 1 Тогда
			СтруктураЗаполнения.Вставить("МестоИнвентаризации", Объект.МестаИнвентаризации[0].МестоИнвентаризации);
		КонецЕсли;
		
		СтрокаТаблицы = Объект.Раздел21.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ПоискСтроки);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураЗаполнения);
	Иначе
		СтрокаТаблицы = МассивСтрок[0];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ИнвентарныйНомер) Тогда
		СтрокаТаблицы.Количество = 1;
	Иначе
		СтрокаТаблицы.Количество = СтрокаТаблицы.Количество + 1;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПанельРасписки

&НаСервере
Процедура НастроитьФормуПоРасписке()
	
	НастроитьПанельРаспискиИнвентаризацииСервер();
	
	НастроитьОбщуюДоступностьРазделов();
	
	Если НужноЗаблокироватьРеквизиты() Тогда
		// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
		ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
		НастроитьДоступностьСпискаНФА();
		// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПанельРаспискиИнвентаризацииСервер()
	
	ИнвентаризацияСервер.НастроитьПанельРаспискиНаФормеОписи(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОбщуюДоступностьРазделов()
	
	ЭтоОбычныйДокумент			= ИнвентаризацияКлиентСервер.ЭтоОбычныйДокументОписи(Объект);
	ЭтоЗаголовочныйДокумент		= ИнвентаризацияКлиентСервер.ЭтоЗаголовочныйДокументСерииДокументовОписи(Объект);
	ЭтоСодержательныйДокумент	= ИнвентаризацияКлиентСервер.ЭтоСодержательныйДокументСерииДокументовОписи(Объект);
	
	Если ЭтоОбычныйДокумент Или ЭтоЗаголовочныйДокумент Тогда
		РаспискаПроведена = ЗначениеЗаполнено(ДанныеПанелиРасписки.Расписка) И ДанныеПанелиРасписки.РаспискаПроведена;
	Иначе
		РаспискаПроведена = Ложь;
	КонецЕсли;
	
	// Видимость закладок
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("ГруппаРаздел1");
	ИменаЭлементов.Добавить("ГруппаРаздел21");
	ИменаЭлементов.Добавить("ГруппаРаздел22");
	ИменаЭлементов.Добавить("ГруппаРаздел3");
	ИменаЭлементов.Добавить("ГруппаРаздел4");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов,
		"Видимость",
		ЭтоОбычныйДокумент Или ЭтоСодержательныйДокумент);
		
	Элементы.ГруппаСписокДокументовСерии.Видимость	= ЭтоЗаголовочныйДокумент;
	Элементы.ГруппаКомиссия.Видимость				= ЭтоОбычныйДокумент Или ЭтоЗаголовочныйДокумент;
	
	// Общая доступность разделов.
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("ГруппаРаздел1Заголовок");
	ИменаЭлементов.Добавить("ГруппаРаздел21Заголовок");
	ИменаЭлементов.Добавить("ГруппаРаздел22Заголовок");
	ИменаЭлементов.Добавить("ГруппаРаздел3Заголовок");
	ИменаЭлементов.Добавить("ГруппаРаздел4Заголовок");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов,
		"Доступность",
		РаспискаПроведена Или ЭтоСодержательныйДокумент);
	
	// СерииДокументов
	Если ЭтоСодержательныйДокумент Тогда
		// Только просмотр реквизитов шапки для содержательных документов
		ИменаЭлементов = Новый Массив();
		ИменаЭлементов.Добавить("Организация");
		ИменаЭлементов.Добавить("Подразделение");
		ИменаЭлементов.Добавить("ИФО");
		ИменаЭлементов.Добавить("РешениеОПроведенииИнвентаризации");
		ИменаЭлементов.Добавить("ОтветственныйИсполнитель");
		ИменаЭлементов.Добавить("ОтветственныйИсполнительБухгалтерскойСлужбы");
		
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
			ИменаЭлементов,
			"ТолькоПросмотр",
			Истина);
	КонецЕсли;
	// Конец СерииДокументов
	
	Если ЭтоЗаголовочныйДокумент Тогда
		// В заголовочном документе разделы не видны и не редактируются.
		Элементы.ФормаКомандаКонтролироватьПоследовательностьЗаполненияРазделов.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеРаздела1

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел1Клиент(Команда)
	
	ИнвентаризацияКлиент.ПроверитьЗаписьДокумента(ЭтаФорма,
		НСтр("ru = 'Заполнить по данным бух.учета'"),
		"ПроверитьИЗаполнитьРаздел1ПослеПроверкиЗаписиДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел1ПослеПроверкиЗаписиДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Объект.Раздел1.Количество() > 0 Тогда 
		ТекстВопроса = НСтр("ru='Перед заполнением табличные части документа будут очищены.
			|
			|Продолжить и заполнить раздел 1?'");
		Оповещение = Новый ОписаниеОповещения("ПроверитьИЗаполнитьРаздел1КлиентЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПроверитьИЗаполнитьРаздел1КорректностьЗаполненияПредыдущихРазделовКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел1КлиентЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ПроверитьИЗаполнитьРаздел1КорректностьЗаполненияПредыдущихРазделовКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел1КорректностьЗаполненияПредыдущихРазделовКлиент()
	
	Перем Отказ;
	
	ПроверитьИЗаполнитьРаздел1КорректностьЗаполненияПредыдущихРазделовСервер(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРаздел1Клиент();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаполнитьРаздел1КорректностьЗаполненияПредыдущихРазделовСервер(Отказ)
	
	Документы.ИнвентаризационнаяОписьНФА.ПроверитьПередЗаполнениемРаздела1(Объект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаздел1Клиент()
	
	Объект.Раздел1.Очистить();
	Объект.Раздел21.Очистить();
	Объект.Раздел22.Очистить();
	Объект.Раздел3.Очистить();
	Объект.Раздел4.Очистить();
	Объект.ВыявленыОтклонения = Ложь;
	
	Объект.СписокДокументовСерии.Очистить();
	
	РезультатЗадания = ЗаполнитьРаздел1Сервер();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеЗаполненияРаздел1Клиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРаздел1Сервер()
	
	ПараметрыФункции = Новый Структура("Ссылка");
	
	ЗаполнитьЗначенияСвойств(ПараметрыФункции, Объект);
	
	// СерииДокументов
	ИнвентаризацияСервер.ДобавитьПараметрыРасчетаСерииДокументов(ПараметрыФункции, Объект);
	// Конец СерииДокументов
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Заполнение раздела 1 инвентаризационной описи 0510466'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Документы.ИнвентаризационнаяОписьНФА.ПолучитьДанныеДляРаздела1",
		ПараметрыФункции)
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаполненияРаздел1Клиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗавершениеЗаполненияРаздел1Сервер(Результат.АдресРезультата);
		
		Если ИнвентаризацияКлиентСервер.ЭтоОбычныйДокументОписи(Объект) Тогда
			Если Объект.Раздел1.Количество() = 0 Тогда
				ТекстСообщения = НСтр("ru='После заполнения раздел 1 оказался пустым'");
				
				ПоказатьПредупреждение(, ТекстСообщения);
			КонецЕсли;
			
		ИначеЕсли ИнвентаризацияКлиентСервер.ЭтоЗаголовочныйДокументСерииДокументовОписи(Объект) Тогда
			ИнвентаризацияКлиент.СообщитьОСозданииСерииДокументов(Объект.СписокДокументовСерии.Количество(), "1, 2, 3, 4");
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='При заполнении раздела 1 возникла ошибка'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеЗаполненияРаздел1Сервер(АдресРезультата)
	
	Перем РезультатыДиагностики;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если Результат.Свойство("Раздел1") И Результат.Свойство("ДополнениеРаздела1") Тогда
		Объект.Раздел1.Загрузить(Результат.Раздел1);
		Объект.ДополнениеРаздела1.Загрузить(Результат.ДополнениеРаздела1);
		
		Объект.ИдентификаторСерииДокументов = "";
		Объект.ЭтоЗаголовочныйДокумент = Ложь;
		
		Модифицированность = Истина;
	Иначе
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
	// СерииДокументов
	НастроитьФормуПоСерииДокументов();
	// Конец СерииДокументов
	
	Документы.ИнвентаризационнаяОписьНФА.ЗаполнитьСлужебныеКолонки(ЭтаФорма, "Раздел1", РезультатыДиагностики);
	
	НастроитьФорму_ДопустимостьЗаполненияРазделов_Сервер();
	
	ОбновитьКнопкиПоказать("Раздел1,Раздел21,Раздел22", РезультатыДиагностики);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеРаздела21

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел21Клиент(Команда, СКоличеством)
	
	ДополнительныеПараметры = Новый Структура("СКоличеством", СКоличеством);
	
	ИнвентаризацияКлиент.ПроверитьЗаписьДокумента(ЭтаФорма,
		НСтр("ru = 'Заполнить по данным раздела 1'"),
		"ПроверитьИЗаполнитьРаздел21ПослеПроверкиЗаписиДокумента",
		ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел21ПослеПроверкиЗаписиДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Объект.Раздел21.Количество() > 0 Тогда 
		ТекстВопроса = НСтр("ru='Перед заполнением табличные части документа будут очищены.
			|
			|Продолжить и заполнить раздел 2.1?'");
		Оповещение = Новый ОписаниеОповещения("ПроверитьИЗаполнитьРаздел21КлиентЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПроверитьИЗаполнитьРаздел21КорректностьЗаполненияПредыдущихРазделовКлиент(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел21КлиентЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ПроверитьИЗаполнитьРаздел21КорректностьЗаполненияПредыдущихРазделовКлиент(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел21КорректностьЗаполненияПредыдущихРазделовКлиент(ДополнительныеПараметры)
	
	Перем Отказ;
	
	ПроверитьИЗаполнитьРаздел21КорректностьЗаполненияПредыдущихРазделовСервер(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРаздел21Клиент(ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаполнитьРаздел21КорректностьЗаполненияПредыдущихРазделовСервер(Отказ)
	
	Документы.ИнвентаризационнаяОписьНФА.ПроверитьПередЗаполнениемРаздела21(Объект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаздел21Клиент(ДополнительныеПараметры)
	
	Объект.Раздел21.Очистить();
	Объект.Раздел22.Очистить();
	Объект.Раздел3.Очистить();
	Объект.Раздел4.Очистить();
	Объект.ВыявленыОтклонения = Ложь;
	
	Объект.СписокДокументовСерии.Очистить();
	
	РезультатЗадания = ЗаполнитьРаздел21Сервер(ДополнительныеПараметры);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеЗаполненияРаздел21Клиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРаздел21Сервер(ДополнительныеПараметры)
	
	ПараметрыФункции = Новый Структура("Ссылка");
	ПараметрыФункции.Вставить("СКоличеством", ДополнительныеПараметры.СКоличеством);
	
	ЗаполнитьЗначенияСвойств(ПараметрыФункции, Объект);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Заполнение раздела 2.1 инвентаризационной описи 0510466'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Документы.ИнвентаризационнаяОписьНФА.ПолучитьДанныеДляРаздела21",
		ПараметрыФункции)
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаполненияРаздел21Клиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗавершениеЗаполненияРаздел21Сервер(Результат.АдресРезультата);
		
		Если Объект.Раздел21.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='После заполнения раздел 2.1 оказался пустым'");
			
			ПоказатьПредупреждение(, ТекстСообщения);
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='При заполнении раздела 2.1 возникла ошибка'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеЗаполненияРаздел21Сервер(АдресРезультата)
	
	Перем РезультатыДиагностики;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Объект.Раздел21.Загрузить(Результат.ТаблицаРаздела21);
	
	Модифицированность = Истина;
	
	Документы.ИнвентаризационнаяОписьНФА.ЗаполнитьСлужебныеКолонки(ЭтаФорма, "Раздел21", РезультатыДиагностики);
	
	НастроитьФорму_ДопустимостьЗаполненияРазделов_Сервер();
	
	ОбновитьКнопкиПоказать("Раздел21,Раздел22", РезультатыДиагностики);
	
КонецПроцедуры

#КонецОбласти

#Область РазбивкаСтрокиРаздела21

&НаКлиенте
Процедура ОткрытьФормуРазбивкиСтрокиРаздела2(ИмяТЧ)
	
	ТекДанные = Элементы[ИмяТЧ].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru='Выберите разбиваемую строку'"));
		
		Возврат;
	КонецЕсли;
	
	Если Элементы[ИмяТЧ].ВыделенныеСтроки.Количество() > 1 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Выберите одну строку для разбивки,
			|сейчас выбрано несколько строк'"));
		
		Возврат;
	КонецЕсли;
	
	ПараметрыФормыРазбивки = ПолучитьПараметрыФормыРазбивкиСтрокиРаздела2(ИмяТЧ, ТекДанные.ПолучитьИдентификатор());
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяТЧ",			ИмяТЧ);
	ДополнительныеПараметры.Вставить("ИсходнаяСтрока",	ПараметрыФормыРазбивки.ИсходнаяСтрока);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытаФормаРазбивкиСтрокиРаздела2", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.ИнвентаризационнаяОписьНФА.Форма.РазбивкаСтрокиРаздела21", ПараметрыФормыРазбивки,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормыРазбивкиСтрокиРаздела2(ИмяТЧ, ИдСтроки)
	
	ТекДанные = Объект[ИмяТЧ].НайтиПоИдентификатору(ИдСтроки);
	
	Возврат Документы.ИнвентаризационнаяОписьНФА.ПолучитьПараметрыФормыРазбивкиСтрокиРаздела2(Объект, ИмяТЧ, ТекДанные);
	
КонецФункции

&НаКлиенте
Процедура ЗакрытаФормаРазбивкиСтрокиРаздела2(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТЧ = ДополнительныеПараметры.ИмяТЧ;
	
	// НомераСтрокФрагментов упорядочены по возрастанию.
	НомераСтрокФрагментов	= РезультатВыбора.НомераСтрокФрагментов;
	ФрагментыСтроки			= РезультатВыбора.ФрагментыСтроки;
	
	КоличествоПрежнихФрагментов = НомераСтрокФрагментов.Количество();
	КоличествоНовыхФрагментов = ФрагментыСтроки.Количество();
	
	// Удаляем прежние фрагменты, начиная с последнего.
	Для Счетчик = 1 По КоличествоПрежнихФрагментов Цикл
		Индекс = КоличествоПрежнихФрагментов - Счетчик;
		
		Объект[ИмяТЧ].Удалить(НомераСтрокФрагментов[Индекс] - 1);
	КонецЦикла;
	
	// Вставляем новые фрагменты на место первой строки прежних фрагментов, начиная с последнего.
	ИндексВставки = НомераСтрокФрагментов[0] - 1;
	
	СлужебныеКолонки = Новый Структура();
	СлужебныеКолонки.Вставить("ТипНфаОС", ТипЗнч(ДополнительныеПараметры.ИсходнаяСтрока.НФА) = Тип("СправочникСсылка.ОсновныеСредства"));
	
	Для Счетчик = 1 По КоличествоНовыхФрагментов Цикл
		Индекс = КоличествоНовыхФрагментов - Счетчик;
		
		СтруктураСтроки = ФрагментыСтроки[Индекс];
		
		НоваяСтрока = Объект[ИмяТЧ].Вставить(ИндексВставки);
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДополнительныеПараметры.ИсходнаяСтрока);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СлужебныеКолонки);
		
		НоваяСтрока.ПризнакФрагментаСтроки = Истина;
	КонецЦикла;
	
	Если КоличествоНовыхФрагментов = 1 Тогда
		НоваяСтрока.ИдентификаторСтроки = Неопределено;
		НоваяСтрока.ПризнакФрагментаСтроки = Ложь;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Элементы[ИмяТЧ].ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПриНеобходимостиФормуРазбивкиСтрокиРаздела2(ИмяТЧ, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы[ИмяТЧ].ТекущиеДанные;
	
	Если Не ТекДанные.ПризнакФрагментаСтроки Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = СтрЗаменить(Поле.Имя, ИмяТЧ, "");
	
	// Эти поля разрешаем редактировать обычным способом в табличной части
	Если ИмяПоля = "Примечание"
		Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуРазбивкиСтрокиРаздела2(ИмяТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьУдалениеФрагментаСтроки(ИмяТЧ, Отказ)
	
	Перем НомерСтроки;
	
	ВыделенныеСтроки = Элементы[ИмяТЧ].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() < 100 Тогда
		ОтменитьУдалениеФрагментаСтрокиКлиент(ИмяТЧ, Отказ, ВыделенныеСтроки, НомерСтроки);
	Иначе
		ОтменитьУдалениеФрагментаСтрокиСервер(ИмяТЧ, Отказ, ВыделенныеСтроки, НомерСтроки);
	КонецЕсли;
	
	Если Отказ Тогда
		ТекстСообшения = СтрШаблон(НСтр("ru = 'Среди выбранных строк есть фрагмент разбитой строки (N %1).
			|Удаление и редактирование всех фрагментов разбитой строки выполняется сообща в форме разбивки строки.
			|
			|Воспользуйтесь формой разбивки строки для редактирования фрагментов разбитой строки.'"), НомерСтроки);
		
		ПоказатьПредупреждение(, ТекстСообшения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьУдалениеФрагментаСтрокиКлиент(ИмяТЧ, Отказ, ВыделенныеСтроки, НомерСтроки);
	
	Если ИнвентаризацияКлиентСервер.ЕстьПризнакФрагментаСтрок(Объект[ИмяТЧ], ВыделенныеСтроки, НомерСтроки) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьУдалениеФрагментаСтрокиСервер(ИмяТЧ, Отказ, ВыделенныеСтроки, НомерСтроки);
	
	Если ИнвентаризацияКлиентСервер.ЕстьПризнакФрагментаСтрок(Объект[ИмяТЧ], ВыделенныеСтроки, НомерСтроки) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДобавлениеСтрокиВРаздел22

&НаКлиенте
Процедура ПроверитьИДобавитьВРаздел22()
	
	КоличествоСтрок = Элементы.Раздел21.ВыделенныеСтроки.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		ТекстСообщения = НСтр("ru='Выберите строки для добавления в раздел 2.2'");
		
		ПоказатьПредупреждение(, ТекстСообщения, 20);
		
		Возврат;
	КонецЕсли;
	
	Текст1 = НСтр("ru='Добавить выбранные строки в раздел 2.2 для указания информации об объектах НФА, '");
	Текст2 = НСтр("ru='имеющих признаки несоответствия условиям актива или признаки обесценения, '");
	Текст3 = НСтр("ru='или объектах НФА, имеющих суммовую недостачу, у которых не ведется количественный учет '");
	Текст4 = НСтр("ru='(например, библиотечный фонд стоимостью до 100 тыс. рублей включительно)?'");
	
	ТекстВопроса = Текст1 + Текст2 + Текст3 + Текст4;
	
	Оповещение = Новый ОписаниеОповещения("ПроверитьИДобавитьВРаздел22Завершение", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИДобавитьВРаздел22Завершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Перем РезультатДобавления;
	
	Если РезультатВыбора <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Раздел21.ВыделенныеСтроки;
	
	КоличествоСтрок = ВыделенныеСтроки.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		ТекстСообщения = НСтр("ru='Не выбраны строки для добавления в раздел 2.2'");
		
		ПоказатьПредупреждение(, ТекстСообщения, 20);
		
		Возврат;
	КонецЕсли;
	
	РезультатДобавления = ДобавитьВРаздел22Сервер(ВыделенныеСтроки);
	
	РезультатПоискаНеучтенныхОтклонений = РезультатДобавления.РезультатПоискаНеучтенныхОтклоненийРазделов1и21ПоСпискуНФА;
	
	Если РезультатПоискаНеучтенныхОтклонений.ЕстьНеучтенныеОтклонения Тогда
		Если РезультатПоискаНеучтенныхОтклонений.КоличествоРазличныхКодовСтрок = 1 Тогда
			ШаблонСтрокиПереченьКодовСтрок = НСтр("ru='код строки %1'");
		Иначе
			ШаблонСтрокиПереченьКодовСтрок = НСтр("ru='коды строк %1'");
		КонецЕсли;
		
		ПереченьКодовСтрок = СтрШаблон(ШаблонСтрокиПереченьКодовСтрок, РезультатПоискаНеучтенныхОтклонений.КодыСтрокСтрокой);
		
		ТекстШаблон = НСтр("ru='Добавление строк в раздел 2.2 отменено.
			|Среди выбранных строк раздела 2.1 выявлено наличие отклонений от раздела 1, которые пока не отражены в разделе 2.2.
			|См. %1.
			|
			|Необходимо заполнить раздел 2.2 по команде ""Заполнить недостачу и излишки"" и указать сведения о несоответствии условиям актива или обесценении непосредственно в разделе 2.2.'");
		
		ПоказатьПредупреждение(, СтрШаблон(ТекстШаблон, ПереченьКодовСтрок));
		
		Возврат;
	КонецЕсли;
	
	ДобавленоСтрок							= РезультатДобавления.ДобавленоСтрок;
	ПропущеноПоПричинеНаличияСтрок			= РезультатДобавления.ПропущеноПоПричинеНаличияСтрок;
	ПропущеноПоПричинеНулевогоКоличества	= РезультатДобавления.ПропущеноПоПричинеНулевогоКоличества;
	
	МассивТекстов = Новый Массив();
	
	Если ДобавленоСтрок > 0 Тогда
		// Категории для русского языка:
		//	Ноль	(-);
		//	Один	(1 шт);
		//	Два		(-);
		//	Немного	(2 шт);
		//	Много	(5 шт);
		//	Другое	(-)
		ТекстДобавленоСтрок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru=';добавлена %1 строка;;добавлено %1 строки;добавлено %1 строк;'"),
			ДобавленоСтрок);
			
		МассивТекстов.Добавить(СтрШаблон(НСтр("ru='В раздел 2.2 успешно %1.'"), ТекстДобавленоСтрок));
		
		НастроитьФорму_ДопустимостьЗаполненияРазделов_Клиент();
	КонецЕсли;
	
	Если ПропущеноПоПричинеНаличияСтрок > 0 Тогда
		МассивТекстов.Добавить(СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru=';%1 строка не была добавлена, потому что уже присутствует в разделе 2.2.;;%1 строки не были добавлены, потому что уже присутствуют в разделе 2.2.;%1 строк не были добавлены, потому что уже присутствуют в разделе 2.2.;'"),
			ПропущеноПоПричинеНаличияСтрок));
	КонецЕсли;
	
	Если ПропущеноПоПричинеНулевогоКоличества > 0 Тогда
		ТекстПропущеноСтрок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru=';%1 строка не была добавлена;;%1 строки не были добавлены;%1 строк не были добавлены;'"),
			ПропущеноПоПричинеНулевогоКоличества);
		
		МассивТекстов.Добавить(СтрШаблон(НСтр("ru='%1, потому что поле Количество нулевое.'"), ТекстПропущеноСтрок));
	КонецЕсли;
	
	Если МассивТекстов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьПредупреждение(, СтрСоединить(МассивТекстов, "
		|
		|"));
	
КонецПроцедуры

&НаСервере
Функция ДобавитьВРаздел22Сервер(Знач ВыделенныеСтроки, ДобавлятьСНулевымКоличеством = Истина)
	
	РезультатПоискаНеучтенныхОтклонений = Документы.ИнвентаризационнаяОписьНФА.НайтиНеучтенныеОтклоненияРазделов1и21ПоСпискуНФА(Объект, ВыделенныеСтроки);
	
	РезультатДобавления = НовыйРезультатДобавленияВРаздел22();
	РезультатДобавления.РезультатПоискаНеучтенныхОтклоненийРазделов1и21ПоСпискуНФА = РезультатПоискаНеучтенныхОтклонений;
	
	Если РезультатПоискаНеучтенныхОтклонений.ЕстьНеучтенныеОтклонения Тогда
		Возврат РезультатДобавления;
	КонецЕсли;
	
	Поиск = Новый Структура("КодСтроки");
	
	ДобавленныеСтроки = Новый Массив();
	
	Для Каждого ИдСтроки Из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.Раздел21.НайтиПоИдентификатору(ИдСтроки);
		
		Если СтрокаТаблицы.Количество = 0 И Не ДобавлятьСНулевымКоличеством Тогда
			РезультатДобавления.ПропущеноПоПричинеНулевогоКоличества = РезультатДобавления.ПропущеноПоПричинеНулевогоКоличества + 1;
			
			Продолжить;
		КонецЕсли;
		
		Поиск.КодСтроки = СтрокаТаблицы.НомерСтроки;
		
		МассивСтрок = Объект.Раздел22.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() > 0 Тогда
			РезультатДобавления.ПропущеноПоПричинеНаличияСтрок = РезультатДобавления.ПропущеноПоПричинеНаличияСтрок + 1;
			
			Продолжить;
		КонецЕсли;
			
		НоваяСтрока = Объект.Раздел22.Добавить();
		НоваяСтрока.ДобавленоВручную = Истина;
		НоваяСтрока.КодСтроки = СтрокаТаблицы.НомерСтроки;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, "НФА,ИнвентарныйНомер,ЕдИзм,МестоИнвентаризации,ТипНфаНоменклатура,ТипНфаОС");
		
		НоваяСтрока.КоличествоИзРаздела21	= СтрокаТаблицы.Количество;
		НоваяСтрока.Цена					= СтрокаТаблицы.Цена;
		
		ДобавленныеСтроки.Добавить(НоваяСтрока);
		
		РезультатДобавления.ДобавленоСтрок = РезультатДобавления.ДобавленоСтрок + 1;
	КонецЦикла;
	
	Если РезультатДобавления.ДобавленоСтрок > 0 Тогда
		Объект.Раздел22.Сортировать("КодСтроки");
		
		Модифицированность = Истина;
	КонецЕсли;
	
	Возврат РезультатДобавления;
	
КонецФункции

&НаСервере
Функция НовыйРезультатДобавленияВРаздел22()
	
	РезультатДобавления = Новый Структура();
	РезультатДобавления.Вставить("ДобавленоСтрок", 0);
	РезультатДобавления.Вставить("ПропущеноПоПричинеНаличияСтрок", 0);
	РезультатДобавления.Вставить("ПропущеноПоПричинеНулевогоКоличества", 0);
	РезультатДобавления.Вставить("РезультатПоискаНеучтенныхОтклоненийРазделов1и21ПоСпискуНФА", Новый Структура());
	
	Возврат РезультатДобавления;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеРаздела22

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел22Клиент(Команда)
	
	ИнвентаризацияКлиент.ПроверитьЗаписьДокумента(ЭтаФорма,
		НСтр("ru = 'Заполнить по данным предыдущих разделов'"),
		"ПроверитьИЗаполнитьРаздел22ПослеПроверкиЗаписиДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел22ПослеПроверкиЗаписиДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Объект.Раздел22.Количество() > 0 Тогда 
		ТекстВопроса = НСтр("ru='Перед заполнением табличные части документа будут очищены.
			|
			|Продолжить и заполнить раздел 2.2?'");
		Оповещение = Новый ОписаниеОповещения("ПроверитьИЗаполнитьРаздел22КлиентЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПроверитьИЗаполнитьРаздел22КорректностьЗаполненияПредыдущихРазделовКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел22КлиентЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ПроверитьИЗаполнитьРаздел22КорректностьЗаполненияПредыдущихРазделовКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел22КорректностьЗаполненияПредыдущихРазделовКлиент()
	
	Перем Отказ;
	
	ПроверитьИЗаполнитьРаздел22КорректностьЗаполненияПредыдущихРазделовСервер(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРаздел22Клиент();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаполнитьРаздел22КорректностьЗаполненияПредыдущихРазделовСервер(Отказ)
	
	Документы.ИнвентаризационнаяОписьНФА.ПроверитьПередЗаполнениемРаздела22(Объект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаздел22Клиент()
	
	Объект.Раздел22.Очистить();
	Объект.Раздел3.Очистить();
	Объект.Раздел4.Очистить();
	Объект.ВыявленыОтклонения = Ложь;
	
	РезультатЗадания = ЗаполнитьРаздел22Сервер();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеЗаполненияРаздел22Клиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРаздел22Сервер()
	
	ПараметрыФункции = Новый Структура("Ссылка");
	
	ЗаполнитьЗначенияСвойств(ПараметрыФункции, Объект);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Заполнение раздела 2.2 инвентаризационной описи 0510466'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Документы.ИнвентаризационнаяОписьНФА.ПолучитьДанныеДляРаздела22",
		ПараметрыФункции)
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаполненияРаздел22Клиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗавершениеЗаполненияРаздел22Сервер(Результат.АдресРезультата);
		
		Если Объект.Раздел22.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='После заполнения раздел 2.2 оказался пустым'");
			
			ПоказатьПредупреждение(, ТекстСообщения);
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='При заполнении раздела 2.2 возникла ошибка'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеЗаполненияРаздел22Сервер(АдресРезультата)
	
	Перем РезультатыДиагностики;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Объект.Раздел22.Загрузить(Результат.ТаблицаРаздела22);
	
	Модифицированность = Истина;
	
	Документы.ИнвентаризационнаяОписьНФА.ЗаполнитьСлужебныеКолонки(ЭтаФорма, "Раздел22", РезультатыДиагностики);
	
	НастроитьФорму_ДопустимостьЗаполненияРазделов_Сервер();
	
	ОбновитьКнопкиПоказать("Раздел22", РезультатыДиагностики);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеРаздела3

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел3Клиент(Команда)
	
	ИнвентаризацияКлиент.ПроверитьЗаписьДокумента(ЭтаФорма,
		НСтр("ru = 'Заполнить по данным раздела 2.2'"),
		"ПроверитьИЗаполнитьРаздел3ПослеПроверкиЗаписиДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел3ПослеПроверкиЗаписиДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Объект.Раздел3.Количество() > 0 Тогда 
		ТекстВопроса = НСтр("ru='Перед заполнением табличные части документа будут очищены.
			|
			|Продолжить и заполнить раздел 3?'");
		Оповещение = Новый ОписаниеОповещения("ПроверитьИЗаполнитьРаздел3КлиентЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПроверитьИЗаполнитьРаздел3КорректностьЗаполненияПредыдущихРазделовКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел3КлиентЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ПроверитьИЗаполнитьРаздел3КорректностьЗаполненияПредыдущихРазделовКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел3КорректностьЗаполненияПредыдущихРазделовКлиент()
	
	ЗаполнитьРаздел3Клиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаздел3Клиент()
	
	Объект.Раздел3.Очистить();
	Объект.Раздел4.Очистить();
	Объект.ВыявленыОтклонения = Ложь;
	
	РезультатЗадания = ЗаполнитьРаздел3Сервер();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеЗаполненияРаздел3Клиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРаздел3Сервер()
	
	ПараметрыФункции = Новый Структура("Ссылка");
	
	ЗаполнитьЗначенияСвойств(ПараметрыФункции, Объект);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Заполнение раздела 3 инвентаризационной описи 0510466'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Документы.ИнвентаризационнаяОписьНФА.ПолучитьДанныеДляРаздела3",
		ПараметрыФункции)
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаполненияРаздел3Клиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗавершениеЗаполненияРаздел3Сервер(Результат.АдресРезультата);
		
		Если Объект.Раздел3.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='После заполнения раздел 3 оказался пустым'");
			
			ПоказатьПредупреждение(, ТекстСообщения);
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='При заполнении раздела 3 возникла ошибка'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеЗаполненияРаздел3Сервер(АдресРезультата)
	
	Перем РезультатыДиагностики;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Объект.Раздел3.Загрузить(Результат.ТаблицаРаздела3);
	
	Модифицированность = Истина;
	
	НастроитьФорму_ДопустимостьЗаполненияРазделов_Сервер();
	
	Документы.ИнвентаризационнаяОписьНФА.ЗаполнитьСлужебныеКолонки(ЭтаФорма, "Раздел3", РезультатыДиагностики);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеРаздела4

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел4Клиент(Команда)
	
	ИнвентаризацияКлиент.ПроверитьЗаписьДокумента(ЭтаФорма,
		НСтр("ru = 'Заполнить по данным разделов 2.2 и 3'"),
		"ПроверитьИЗаполнитьРаздел4ПослеПроверкиЗаписиДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел4ПослеПроверкиЗаписиДокумента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Объект.Раздел4.Количество() > 0 Тогда 
		ТекстВопроса = НСтр("ru='Перед заполнением табличные части документа будут очищены.
			|
			|Продолжить и заполнить раздел 4?'");
		Оповещение = Новый ОписаниеОповещения("ПроверитьИЗаполнитьРаздел4КлиентЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПроверитьИЗаполнитьРаздел4КорректностьЗаполненияПредыдущихРазделовКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел4КлиентЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ПроверитьИЗаполнитьРаздел4КорректностьЗаполненияПредыдущихРазделовКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел4КорректностьЗаполненияПредыдущихРазделовКлиент()
	
	Отказ = Ложь;
	
	ПроверитьИЗаполнитьРаздел4КорректностьЗаполненияПредыдущихРазделовСервер(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРаздел4Клиент();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьИЗаполнитьРаздел4КорректностьЗаполненияПредыдущихРазделовСервер(Отказ)
	
	Документы.ИнвентаризационнаяОписьНФА.ПроверитьПередЗаполнениемРаздела4(Объект, Отказ);
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ЗаполнитьРаздел4Клиент()
	
	Объект.Раздел4.Очистить();
	Объект.ВыявленыОтклонения = Ложь;
	
	РезультатЗадания = ЗаполнитьРаздел4Сервер();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеЗаполненияРаздел4Клиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРаздел4Сервер()
	
	ПараметрыФункции = Новый Структура("Ссылка");
	
	ЗаполнитьЗначенияСвойств(ПараметрыФункции, Объект);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Заполнение раздела 4 инвентаризационной описи 0510466'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Документы.ИнвентаризационнаяОписьНФА.ПолучитьДанныеДляРаздела4",
		ПараметрыФункции)
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаполненияРаздел4Клиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗавершениеЗаполненияРаздел4Сервер(Результат.АдресРезультата);
		
		Если Объект.Раздел4.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='После заполнения раздел 4 оказался пустым'");
			
			ПоказатьПредупреждение(, ТекстСообщения);
		КонецЕсли;
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='При заполнении раздела 4 возникла ошибка'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеЗаполненияРаздел4Сервер(АдресРезультата)
	
	Перем РезультатыДиагностики;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Объект.Раздел4.Загрузить(Результат.ТаблицаРаздела4);
	
	Объект.ВыявленыОтклонения = Результат.ВыявленыОтклонения;
	
	Модифицированность = Истина;
	
	НастроитьФорму_ДопустимостьЗаполненияРазделов_Сервер();
	
	Документы.ИнвентаризационнаяОписьНФА.ЗаполнитьСлужебныеКолонки(ЭтаФорма, "Раздел4", РезультатыДиагностики);
	
КонецПроцедуры

#КонецОбласти

#Область КнопкиПоказать

// Общие процедуры

&НаСервере
Процедура ОбновитьКнопкиПоказать(ИменаРазделов, РезультатыДиагностики)
	
	МассивИмен = СтрРазделить(ИменаРазделов, ", ");
	
	Для Каждого НаименованиеРаздела Из МассивИмен Цикл
		СброситьНеактуальныйОтборСтрокРаздела(НаименованиеРаздела, РезультатыДиагностики);
		
		НастроитьВидимостьКнопокПоказатьРаздела(НаименованиеРаздела, РезультатыДиагностики);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СброситьНеактуальныйОтборСтрокРаздела(НаименованиеРаздела, РезультатыДиагностики)
	
	НастройкиКнопок = ПолучитьНастройкиКнопокПоказать(НаименованиеРаздела);
	
	Для Каждого Элемент Из НастройкиКнопок Цикл
		ИмяТекущейКнопки = Элемент.Ключ;
		НастройкаТекущейКолонки = Элемент.Значение;
		
		Если РезультатыДиагностики.Свойство(НаименованиеРаздела) Тогда
			РезультатДиагностики = РезультатыДиагностики[НаименованиеРаздела][НастройкаТекущейКолонки.КлючРезультатаДиагностики];
		Иначе
			// Отсутствие диагностики по разделу считаем полным отсутствием установленных признаков
			РезультатДиагностики = Ложь;
		КонецЕсли;
		
		Если Не РезультатДиагностики И Элементы[ИмяТекущейКнопки].Пометка Тогда
			Элементы[ИмяТекущейКнопки].Пометка = Ложь;
			
			Элементы[НаименованиеРаздела].ОтборСтрок = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьКнопокПоказатьРаздела(НаименованиеРаздела, РезультатыДиагностики)
	
	НастройкиКнопок = ПолучитьНастройкиКнопокПоказать(НаименованиеРаздела);
	
	Для Каждого Элемент Из НастройкиКнопок Цикл
		ИмяТекущейКнопки = Элемент.Ключ;
		НастройкаТекущейКолонки = Элемент.Значение;
		
		Если РезультатыДиагностики.Свойство(НаименованиеРаздела) Тогда
			РезультатДиагностики = РезультатыДиагностики[НаименованиеРаздела][НастройкаТекущейКолонки.КлючРезультатаДиагностики];
		Иначе
			// Отсутствие диагностики по разделу считаем полным отсутствием установленных признаков
			РезультатДиагностики = Ложь;
		КонецЕсли;
		
		Элементы[ИмяТекущейКнопки].Видимость = РезультатДиагностики;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрокРаздел(НаименованиеКнопки, НаименованиеРаздела)
	
	Элементы[НаименованиеКнопки].Пометка = Не Элементы[НаименованиеКнопки].Пометка;
	
	НастройкиКнопок = ПолучитьНастройкиКнопокПоказать(НаименованиеРаздела);
	
	Если Элементы[НаименованиеКнопки].Пометка Тогда
		НовыйОтборСтрок = НастройкиКнопок[НаименованиеКнопки].ОтборСтрок;
	Иначе
		НовыйОтборСтрок = Неопределено;
	КонецЕсли;
	
	Элементы[НаименованиеРаздела].ОтборСтрок = НовыйОтборСтрок;
	
	// Сбрасываем пометки у всех остальных кнопок
	
	Для Каждого Элемент Из НастройкиКнопок Цикл
		ИмяТекущейКнопки = Элемент.Ключ;
		
		Если ИмяТекущейКнопки = НаименованиеКнопки Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы[ИмяТекущейКнопки].Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНастройкиКнопокПоказать(НаименованиеРаздела)
	
	Если НаименованиеРаздела = "Раздел1" Тогда
		Возврат ПолучитьНастройкиКнопокПоказатьРаздела1();
		
	ИначеЕсли НаименованиеРаздела = "Раздел21" Тогда
		Возврат ПолучитьНастройкиКнопокПоказатьРаздела21();
		
	ИначеЕсли НаименованиеРаздела = "Раздел22" Тогда
		Возврат ПолучитьНастройкиКнопокПоказатьРаздела22();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьОписаниеКнопкиПоказатьРаздела(НастройкиКнопок, ИмяКнопки, ОтборСтрок, КлючРезультатаДиагностики)
	
	Настройки = Новый Структура("ОтборСтрок,КлючРезультатаДиагностики");
	
	Настройки.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	Настройки.КлючРезультатаДиагностики = КлючРезультатаДиагностики;
	
	НастройкиКнопок.Вставить(ИмяКнопки, Настройки);
	
КонецПроцедуры

// Настройки разделов

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНастройкиКнопокПоказатьРаздела1()
	
	НастройкиКнопок = Новый Структура();
	
	ДобавитьОписаниеКнопкиПоказатьРаздела(НастройкиКнопок,
		"Раздел1ПоказатьТолькоОшибкиУчета",
		Новый Структура("ОшибкаУчета", Истина),
		"ЕстьОшибкиУчета");
		
	ДобавитьОписаниеКнопкиПоказатьРаздела(НастройкиКнопок,
		"Раздел1ПоказатьТолькоПустыеМестаИнвентаризации",
		Новый Структура("МестоИнвентаризации", Неопределено),
		"ЕстьПустыеМестаИнвентаризации");
		
	ДобавитьОписаниеКнопкиПоказатьРаздела(НастройкиКнопок,
		"Раздел1ПоказатьТолькоДопСведения",
		Новый Структура("ЕстьДопСведения", Истина),
		"ЕстьДопСведения");
		
	ДобавитьОписаниеКнопкиПоказатьРаздела(НастройкиКнопок,
		"Раздел1ПоказатьТолькоМестаИнвентаризацииЗаполненныеВручную",
		Новый Структура("МестоИнвентаризацииЗаполненоВручную", Истина),
		"ЕстьМестаИнвентаризацииЗаполненныеВручную");
		
	Возврат НастройкиКнопок;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНастройкиКнопокПоказатьРаздела21()
	
	НастройкиКнопок = Новый Структура();
	
	ДобавитьОписаниеКнопкиПоказатьРаздела(НастройкиКнопок,
		"Раздел21ПоказатьТолькоПустыеМестаИнвентаризацииРаздел21",
		Новый Структура("МестоИнвентаризации", Неопределено),
		"ЕстьПустыеМестаИнвентаризации");
		
	ДобавитьОписаниеКнопкиПоказатьРаздела(НастройкиКнопок,
		"Раздел21ПоказатьТолькоФрагментыСтрокРаздела21",
		Новый Структура("ПризнакФрагментаСтроки", Истина),
		"ЕстьФрагментыСтрок");
		
	ДобавитьОписаниеКнопкиПоказатьРаздела(НастройкиКнопок,
		"Раздел21ПоказатьТолькоДобавленныеВручнуюРаздел21",
		Новый Структура("ДобавленоВручную", Истина),
		"ЕстьДобавленныеВручную");
	
	Возврат НастройкиКнопок;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНастройкиКнопокПоказатьРаздела22()
	
	НастройкиКнопок = Новый Структура();
	
	ДобавитьОписаниеКнопкиПоказатьРаздела(НастройкиКнопок,
		"Раздел22ПоказатьТолькоДобавленныеВручнуюРаздел22",
		Новый Структура("ДобавленоВручную", Истина),
		"ЕстьДобавленныеВручную");
	
	Возврат НастройкиКнопок;
	
КонецФункции

#КонецОбласти

#Область РешениеОПроведенииИнвентаризации

&НаКлиенте
Процедура ЗакрытаФормаВыбораДанныхИзРешенияОПроведенииИнвентаризации(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОписьПоРешениюОПроведенииИнвентаризацииСервер(РезультатВыбора);
	
	ПослеЗаполненияОписиПоРешениюОПроведенииИнвентаризацииКлиент(РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписьПоРешениюОПроведенииИнвентаризацииСервер(РезультатВыбора)
	
	Перем РезультатыДиагностики;
	
	ИнвентаризацияСервер.ЗаполнитьОписьПоРешениюИзФормыОписи(ЭтаФорма, РезультатВыбора);
	
	Объект.СписокНФА.Очистить();
	
	Объект.Раздел1.Очистить();
	Объект.Раздел21.Очистить();
	Объект.Раздел22.Очистить();
	Объект.Раздел3.Очистить();
	Объект.Раздел4.Очистить();
	Объект.ВыявленыОтклонения = Ложь;
	
	Объект.СписокДокументовСерии.Очистить();
	
	Документы.ИнвентаризационнаяОписьНФА.ЗаполнитьСлужебныеКолонки(ЭтаФорма, "СписокНФА,Раздел1,Раздел21,Раздел22,Раздел3,Раздел4", РезультатыДиагностики);
	
	ОбновитьКнопкиПоказать("Раздел1,Раздел21,Раздел22", РезультатыДиагностики);
	
	НастроитьФормуПоВидуИнвентаризации();
	
	УстановитьПредставленияРеквизитовШапки();
	
	ЗаполнитьСписокВыбораМестоИнвентаризации();
	
	НастроитьВидимостьНадписиМестаИнвентаризации();
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.КомиссияПриИзмененииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиями.ПриИзмененииКомиссииЗамещениеЧленаКомиссии(ЭтотОбъект);
	// Конец ЗамещениеЧленаКомиссии
	
	РаботаСКомиссиями.ЗаполнитьОтветственногоИсполнителяКомиссииВДокументеОписи(ЭтотОбъект);
	
	НастроитьФорму_ДопустимостьЗаполненияРазделов_Сервер();
	
	НастроитьОтборПоПодразделению();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполненияОписиПоРешениюОПроведенииИнвентаризацииКлиент(РезультатВыбора)
	
	ИнвентаризацияКлиент.СообщитьОЗаполненииНаОснованииРешенияОПроведенииИнвентаризации();
	
КонецПроцедуры

#КонецОбласти

#Область ПанельСерииДокументов

&НаСервере
Процедура НастроитьФормуПоСерииДокументов()
	
	НастроитьПанельСерииДокументовСервер();
	
	Если Объект.СписокДокументовСерии.Количество() > 0 Тогда
		ЗаполнитьСлужебныеКолонкиСпискаДокументовСерии();
	КонецЕсли;
	
	НастроитьОбщуюДоступностьРазделов();

КонецПроцедуры

&НаСервере
Процедура НастроитьПанельСерииДокументовСервер()
	
	ИнвентаризацияСервер.НастроитьПанельСерииДокументовНаФормеОписи(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеКолонкиСпискаДокументовСерии()
	
	ИнвентаризацияСервер.ЗаполнитьСлужебныеКолонкиСпискаДокументовСерии(ЭтаФорма);
	
	ИтогКоличествоСтрокРаздел1 = Объект.СписокДокументовСерии.Итог("КоличествоСтрокРаздел1");
	ИтогКоличествоСтрокРаздел21 = Объект.СписокДокументовСерии.Итог("КоличествоСтрокРаздел21");
	ИтогКоличествоСтрокРаздел22 = Объект.СписокДокументовСерии.Итог("КоличествоСтрокРаздел22");
	ИтогКоличествоСтрокРаздел3 = Объект.СписокДокументовСерии.Итог("КоличествоСтрокРаздел3");
	ИтогКоличествоСтрокРаздел4 = Объект.СписокДокументовСерии.Итог("КоличествоСтрокРаздел4");
	
КонецПроцедуры

#КонецОбласти

#Область УдалениеСодержательныхДокументов

// Пометка удаления

&НаКлиенте
Процедура ПодтвердитьИУдалитьДокументыСерииЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		УдалитьДокументыСерииКлиент(ДополнительныеПараметры.ЗначениеПометкиУдаления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДокументыСерииКлиент(ЗначениеПометкиУдаления)
	
	УдалитьДокументыСерииСервер(ЗначениеПометкиУдаления);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументыСерииСервер(ЗначениеПометкиУдаления)
	
	ИнвентаризацияСервер.УстановитьПометкуУдаленияСодержательныхДокументовСерии(Объект, ЗначениеПометкиУдаления);
	
	// СерииДокументов
	НастроитьФормуПоСерииДокументов();
	// Конец СерииДокументов
	
КонецПроцедуры

// Очистка и пометка удаления

&НаКлиенте
Процедура ПодтвердитьОчиститьИУдалитьДокументыСерииЗавершение(РезультатВыбора, ОписаниеОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ОчиститьИУдалитьДокументыСерииКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИУдалитьДокументыСерииКлиент()
	
	ОчиститьИУдалитьДокументыСерииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьИУдалитьДокументыСерииСервер()
	
	ИнвентаризацияСервер.ОчиститьСодержательныеДокументыСерии(Объект);
	
	// СерииДокументов
	НастроитьФормуПоСерииДокументов();
	// Конец СерииДокументов
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область КонтрольПоследовательностиЗаполненияРазделов

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьДопустимостьЗаполненияРазделов(Форма)
	
	Объект = Форма.Объект;
	
	КонтролироватьПоследовательностьЗаполненияРазделов = Форма.КонтролироватьПоследовательностьЗаполненияРазделов;
	
	Форма.ПричинаНедоступностиРаздела1 = "";
	Форма.ПричинаНедоступностиРаздела21 = "";
	Форма.ПричинаНедоступностиРаздела22 = "";
	Форма.ПричинаНедоступностиРаздела3 = "";
	Форма.ПричинаНедоступностиРаздела4 = "";
	
	ДопустимостьЗаполненияРазделов = Новый Структура();
	ДопустимостьЗаполненияРазделов.Вставить("КонтролироватьПоследовательностьЗаполненияРазделов",
		КонтролироватьПоследовательностьЗаполненияРазделов);
	
	СовместноЗаполненыРазделы1и21 = ?(Объект.Раздел1.Количество() > 0,
		Объект.Раздел21.Количество() > 0,
		Истина);
	
	ДопустимостьЗаполненияРазделов.Вставить("Раздел1",
		Объект.Раздел21.Количество() = 0
		И Объект.Раздел22.Количество() = 0
		И Объект.Раздел3.Количество() = 0
		И Объект.Раздел4.Количество() = 0
		Или Не КонтролироватьПоследовательностьЗаполненияРазделов);
		
	Если Не ДопустимостьЗаполненияРазделов.Раздел1 Тогда
		Форма.ПричинаНедоступностиРаздела1 = НСтр("ru='Заполнен один из последующих разделов.'");
	КонецЕсли;
		
	ДопустимостьЗаполненияРазделов.Вставить("Раздел21",
		Объект.Раздел22.Количество() = 0
		И Объект.Раздел3.Количество() = 0
		И Объект.Раздел4.Количество() = 0
		Или Не КонтролироватьПоследовательностьЗаполненияРазделов);
		
	Если Не ДопустимостьЗаполненияРазделов.Раздел21 Тогда
		Форма.ПричинаНедоступностиРаздела21 = НСтр("ru='Заполнен один из последующих разделов.'");
	КонецЕсли;
	
	ДопустимостьЗаполненияРазделов.Вставить("Раздел22",
		СовместноЗаполненыРазделы1и21
		И Объект.Раздел3.Количество() = 0
		И Объект.Раздел4.Количество() = 0
		Или Не КонтролироватьПоследовательностьЗаполненияРазделов);
		
	Если Не СовместноЗаполненыРазделы1и21 Тогда
		Форма.ПричинаНедоступностиРаздела22 = НСтр("ru='Не заполнены предыдущие разделы 1 и 2.1.'");
	ИначеЕсли Не ДопустимостьЗаполненияРазделов.Раздел22 Тогда
		Форма.ПричинаНедоступностиРаздела22 = НСтр("ru='Заполнен один из последующих разделов.'");
	КонецЕсли;
	
	ДопустимостьЗаполненияРазделов.Вставить("Раздел3",
		СовместноЗаполненыРазделы1и21
		И Объект.Раздел4.Количество() = 0
		Или Не КонтролироватьПоследовательностьЗаполненияРазделов);
		
	Если Не СовместноЗаполненыРазделы1и21 Тогда
		Форма.ПричинаНедоступностиРаздела3 = НСтр("ru='Не заполнены предыдущие разделы 1 и 2.1.'");
	ИначеЕсли Не ДопустимостьЗаполненияРазделов.Раздел3 Тогда
		Форма.ПричинаНедоступностиРаздела3 = НСтр("ru='Заполнен последующий раздел 4.'");
	КонецЕсли;
	
	ДопустимостьЗаполненияРазделов.Вставить("Раздел4",
		СовместноЗаполненыРазделы1и21
		И Не Объект.Проведен
		Или Не КонтролироватьПоследовательностьЗаполненияРазделов);
		
	Если Объект.Проведен Тогда
		Форма.ПричинаНедоступностиРаздела4 = НСтр("ru='Документ описи проведен.'");
	ИначеЕсли Не СовместноЗаполненыРазделы1и21 Тогда
		Форма.ПричинаНедоступностиРаздела4 = НСтр("ru='Не заполнены предыдущие разделы 1 и 2.1.'");
	КонецЕсли;
	
	Возврат ДопустимостьЗаполненияРазделов;
	
КонецФункции

&НаКлиенте
Процедура НастроитьФорму_ДопустимостьЗаполненияРазделов_Клиент()
	
	ДопустимостьЗаполненияРазделов = ОпределитьДопустимостьЗаполненияРазделов(ЭтотОбъект);
	
	ИменаРазделов = ОпределитьИзменияДопустимостиРедактированияРазделов(ЭтотОбъект,
		ДопустимостьЗаполненияРазделов,
		ДопустимостьЗаполненияРазделовПрежнееЗначение);
		
	Если ИменаРазделов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьФорму_ДопустимостьЗаполненияРазделов_Сервер(ДопустимостьЗаполненияРазделов, ИменаРазделов);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму_ДопустимостьЗаполненияРазделов_Сервер(ДопустимостьЗаполненияРазделов = Неопределено, ИменаРазделов = Неопределено)
	
	Если ДопустимостьЗаполненияРазделов = Неопределено Тогда
		ДопустимостьЗаполненияРазделов = ОпределитьДопустимостьЗаполненияРазделов(ЭтотОбъект);
	КонецЕсли;
	
	ДопустимостьЗаполненияРазделовПрежнееЗначение = Новый ФиксированнаяСтруктура(ДопустимостьЗаполненияРазделов);
	
	НастроитьПометкуКнопкиКонтролироватьПоследовательностьЗаполненияРазделов(ЭтотОбъект);
	
	Если ИменаРазделов = Неопределено Или ИменаРазделов.Найти("Раздел1") <> Неопределено Тогда
		НастроитьФорму_ДопустимостьЗаполненияРазделов_Раздел1(ДопустимостьЗаполненияРазделов);
	КонецЕсли;
	
	Если ИменаРазделов = Неопределено Или ИменаРазделов.Найти("Раздел21") <> Неопределено Тогда
		НастроитьФорму_ДопустимостьЗаполненияРазделов_Раздел21(ДопустимостьЗаполненияРазделов);
	КонецЕсли;
	
	Если ИменаРазделов = Неопределено Или ИменаРазделов.Найти("Раздел22") <> Неопределено Тогда
		НастроитьФорму_ДопустимостьЗаполненияРазделов_Раздел22(ДопустимостьЗаполненияРазделов);
	КонецЕсли;
	
	Если ИменаРазделов = Неопределено Или ИменаРазделов.Найти("Раздел3") <> Неопределено Тогда
		НастроитьФорму_ДопустимостьЗаполненияРазделов_Раздел3(ДопустимостьЗаполненияРазделов);
	КонецЕсли;
	
	Если ИменаРазделов = Неопределено Или ИменаРазделов.Найти("Раздел4") <> Неопределено Тогда
		НастроитьФорму_ДопустимостьЗаполненияРазделов_Раздел4(ДопустимостьЗаполненияРазделов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму_ДопустимостьЗаполненияРазделов_Раздел1(ДопустимостьЗаполненияРазделов)
	
	ДопустимоРедактирование = ДопустимостьЗаполненияРазделов.Раздел1;
	
	Элементы.Раздел1ПоказатьПричинуНедоступностиРаздела1.Видимость = Не ДопустимоРедактирование;
	
	Элементы.Раздел1.ИзменятьПорядокСтрок = ДопустимоРедактирование;
	
	НедоступныеКолонки = Новый Массив();
	НедоступныеКолонки.Добавить("Раздел1МестоИнвентаризации");
	
	Если ДопустимоРедактирование Тогда
		ИнвентаризацияСервер.ОтключитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки, НедоступныеКолонки);
	Иначе
		ИнвентаризацияСервер.НастроитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки,, НедоступныеКолонки);
	КонецЕсли;
	
	// Команды заполнения.
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("Раздел1ЗаполнитьРаздел1");
	ИменаЭлементов.Добавить("Раздел1ГрупповоеЗаполнениеСтрокРаздела1");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов,
		"Доступность",
		ДопустимоРедактирование);
		
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("Раздел1ВыгрузитьДанныеВТСД");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов,
		"Доступность",
		ДопустимоРедактирование И ДопустимостьЗаполненияРазделов.Раздел21);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму_ДопустимостьЗаполненияРазделов_Раздел21(ДопустимостьЗаполненияРазделов)
	
	ДопустимоРедактирование = ДопустимостьЗаполненияРазделов.Раздел21;
	
	Элементы.Раздел21ПоказатьПричинуНедоступностиРаздела21.Видимость = Не ДопустимоРедактирование;
	
	Элементы.Раздел21.ИзменятьСоставСтрок = ДопустимоРедактирование;
	Элементы.Раздел21.ИзменятьПорядокСтрок = ДопустимоРедактирование;
	
	НедоступныеКолонки = Новый Массив();
	НедоступныеКолонки.Добавить("Раздел21НФА");
	НедоступныеКолонки.Добавить("Раздел21ИнвентарныйНомер");
	НедоступныеКолонки.Добавить("Раздел21ЕдИзм");
	НедоступныеКолонки.Добавить("Раздел21МестоИнвентаризации");
	НедоступныеКолонки.Добавить("Раздел21Количество");
	НедоступныеКолонки.Добавить("Раздел21СтатусОбъекта");
	НедоступныеКолонки.Добавить("Раздел21ЦелеваяФункцияАктива");
	НедоступныеКолонки.Добавить("Раздел21Примечание");
	НедоступныеКолонки.Добавить("Раздел21Цена");
	
	Если ДопустимоРедактирование Тогда
		ИнвентаризацияСервер.ОтключитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки, НедоступныеКолонки);
	Иначе
		ИнвентаризацияСервер.НастроитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки,, НедоступныеКолонки);
	КонецЕсли;
	
	// Команды заполнения.
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("Раздел21ЗаполнитьРаздел21");
	ИменаЭлементов.Добавить("Раздел21ЗаполнитьРаздел21СКоличеством");
	ИменаЭлементов.Добавить("Раздел21РазбитьСтрокуРаздела21");
	ИменаЭлементов.Добавить("Раздел21ГрупповоеЗаполнениеСтрокРаздела21");
	ИменаЭлементов.Добавить("Раздел21ЗагрузитьДанныеИзТСД");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов,
		"Доступность",
		ДопустимоРедактирование);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму_ДопустимостьЗаполненияРазделов_Раздел22(ДопустимостьЗаполненияРазделов)
	
	ДопустимоРедактирование = ДопустимостьЗаполненияРазделов.Раздел22;
	
	Элементы.Раздел22ПоказатьПричинуНедоступностиРаздела22.Видимость = Не ДопустимоРедактирование;
	
	НедоступныеКолонки = Новый Массив();
	НедоступныеКолонки.Добавить("Раздел22КоличествоНеСоответствует");
	НедоступныеКолонки.Добавить("Раздел22СуммаНеСоответствует");
	НедоступныеКолонки.Добавить("Раздел22КоличествоОбесценение");
	НедоступныеКолонки.Добавить("Раздел22СуммаОбесценение");
	НедоступныеКолонки.Добавить("Раздел22Цена");
	
	Если ДопустимоРедактирование Тогда
		ИнвентаризацияСервер.ОтключитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки, НедоступныеКолонки);
	Иначе
		ИнвентаризацияСервер.НастроитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки,, НедоступныеКолонки);
	КонецЕсли;
	
	// Состав комиссии раздела 2.
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("СоставКомиссииРаздел2Отсутствует");
	ИменаЭлементов.Добавить("СоставКомиссииРаздел2ПричинаОтсутствия");
	ИменаЭлементов.Добавить("СоставКомиссииРаздел2ЗамещающийСотрудник");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов,
		"ТолькоПросмотр",
		Не ДопустимоРедактирование);
	
	// Команды заполнения.
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("Раздел21ДобавитьВРаздел22");
	ИменаЭлементов.Добавить("Раздел22ЗаполнитьРаздел22");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов,
		"Доступность",
		ДопустимоРедактирование);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму_ДопустимостьЗаполненияРазделов_Раздел3(ДопустимостьЗаполненияРазделов)
	
	ДопустимоРедактирование = ДопустимостьЗаполненияРазделов.Раздел3;
	
	Элементы.Раздел3ПоказатьПричинуНедоступностиРаздела3.Видимость = Не ДопустимоРедактирование;
	
	НедоступныеКолонки = Новый Массив();
	НедоступныеКолонки.Добавить("Раздел3КоличествоНедостачаПодтверждено");
	НедоступныеКолонки.Добавить("Раздел3СуммаНедостачаПодтверждено");
	НедоступныеКолонки.Добавить("Раздел3Цена");
	НедоступныеКолонки.Добавить("Раздел3КоличествоИзлишкиПодтверждено");
	НедоступныеКолонки.Добавить("Раздел3СуммаИзлишкиПодтверждено");
	НедоступныеКолонки.Добавить("Раздел3НаименованиеДокумента");
	НедоступныеКолонки.Добавить("Раздел3НомерДокумента");
	НедоступныеКолонки.Добавить("Раздел3ДатаДокумента");
	НедоступныеКолонки.Добавить("Раздел3КоличествоНедостачаНеПодтверждено");
	НедоступныеКолонки.Добавить("Раздел3СуммаНедостачаНеПодтверждено");
	НедоступныеКолонки.Добавить("Раздел3КоличествоИзлишкиНеПодтверждено");
	НедоступныеКолонки.Добавить("Раздел3ОбъяснениеПричинРасхождений");
	
	Если ДопустимоРедактирование Тогда
		ИнвентаризацияСервер.ОтключитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки, НедоступныеКолонки);
	Иначе
		ИнвентаризацияСервер.НастроитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки,, НедоступныеКолонки);
	КонецЕсли;
	
	// Команды заполнения.
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("Раздел3ЗаполнитьРаздел3");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов,
		"Доступность",
		ДопустимоРедактирование);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму_ДопустимостьЗаполненияРазделов_Раздел4(ДопустимостьЗаполненияРазделов)
	
	ДопустимоРедактирование = ДопустимостьЗаполненияРазделов.Раздел4;
	
	Элементы.Раздел4ПоказатьПричинуНедоступностиРаздела4.Видимость = Не ДопустимоРедактирование;
	
	НедоступныеКолонки = Новый Массив();
	НедоступныеКолонки.Добавить("Раздел4ЗаключениеКомиссии");
	НедоступныеКолонки.Добавить("Раздел4СтатусОбъяснения");
	НедоступныеКолонки.Добавить("Раздел4СуммаНедостачаНеПодтверждено");
	НедоступныеКолонки.Добавить("Раздел4КоличествоНедостачаНеПодтверждено");
	НедоступныеКолонки.Добавить("Раздел4КоличествоИзлишкиНеПодтверждено");
	
	Если ДопустимоРедактирование Тогда
		ИнвентаризацияСервер.ОтключитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки, НедоступныеКолонки);
	Иначе
		ИнвентаризацияСервер.НастроитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки,, НедоступныеКолонки);
	КонецЕсли;
	
	// Состав комиссии раздела 4.
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("СоставКомиссииРаздел4Отсутствует");
	ИменаЭлементов.Добавить("СоставКомиссииРаздел4ПричинаОтсутствия");
	ИменаЭлементов.Добавить("СоставКомиссииРаздел4ЗамещающийСотрудник");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов,
		"ТолькоПросмотр",
		Не ДопустимоРедактирование);
	
	// Команды заполнения.
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("Раздел4ЗаполнитьРаздел4");
	ИменаЭлементов.Добавить("Раздел4ГрупповоеЗаполнениеСтрокРаздела4");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов,
		"Доступность",
		ДопустимоРедактирование);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИзменияДопустимостиРедактированияРазделов(Форма, ТекущееЗначение, ПрежнееЗначение)
	
	ИзменияДопустимости = Новый Массив();
	
	Для Каждого Элемент Из ТекущееЗначение Цикл
		ИмяТЧРаздела = Элемент.Ключ;
		
		Если Элемент.Значение <> ПрежнееЗначение[ИмяТЧРаздела] Тогда
			ИзменияДопустимости.Добавить(ИмяТЧРаздела);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИзменияДопустимости;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьПометкуКнопкиКонтролироватьПоследовательностьЗаполненияРазделов(Форма)
	
	Форма.Элементы.ФормаКомандаКонтролироватьПоследовательностьЗаполненияРазделов.Пометка =
		Форма.КонтролироватьПоследовательностьЗаполненияРазделов;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНастройкуКонтроляПоследовательностиЗаполненияРазделов()
	
	КонтролироватьПоследовательностьЗаполненияРазделов = Не КонтролироватьПоследовательностьЗаполненияРазделов;
	
	НастроитьПометкуКнопкиКонтролироватьПоследовательностьЗаполненияРазделов(ЭтотОбъект);
	
	НастроитьФорму_ДопустимостьЗаполненияРазделов_Клиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьОтключениеКонтроляПоследовательностиЗаполненияРазделов()

	ТекстВопроса = НСтр("ru='Не рекомендуется отключать контроль последовательности заполнения разделов описи.
		|
		|Отключение контроля позволит заполнить разделы описи
		|в неожиданном сочетании и в порядке, отличном от предписываемого приказом Минфина от 15.04.2021 N 61н.
		|
		|Продолжить и отключить контроль последовательности заполнения разделов описи?'");
	
	Оповещение = Новый ОписаниеОповещения("ПодтвержденоОтключениеКонтроляПоследовательностиЗаполненияРазделов", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвержденоОтключениеКонтроляПоследовательностиЗаполненияРазделов(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ИзменитьНастройкуКонтроляПоследовательностиЗаполненияРазделов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтборПоПодразделению

&НаСервере
Процедура НастроитьОтборПоПодразделению()
	
	ИнвентаризацияСервер.НастроитьОтборПоПодразделениюНаФормеОписи(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

// НедоступныеКолонки
&НаКлиенте
Процедура Подключаемый_НедоступностьИзмененияКолонок_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НедоступностьИзмененияКолонок_Очистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
// Конец НедоступныеКолонки

// ЗамещениеЧленаКомиссии
&НаСервере
Процедура ОбновитьЗамещенияПриОтсутствииСервер(ИмяТабличнойЧасти = "СоставКомиссии")
	
	РаботаСКомиссиями.ОбновитьЗамещенияПриОтсутствии(ЭтотОбъект, ИмяТабличнойЧасти);
	
КонецПроцедуры
// Конец ЗамещениеЧленаКомиссии

// ПодключаемоеОборудование
&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт

	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		Сообщить(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Оборудование подключено.'" );
		Сообщить(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт

	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При отключении оборудования произошла ошибка: ""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		Сообщить(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Оборудование отключено.'" );
		Сообщить(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры
// Конец ПодключаемоеОборудование

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
    ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти
