#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных
	
Перем Формат;	
Перем ПравилаЗагрузки;
Перем ДеревоСтруктуры;
Перем ОбработкаОбменов;
Перем СоответствияТипыДокументов;

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьЗагрузитьДанные(ТаблицаРезультат, ИнформацияОбОшибке) Экспорт
	
	Результат 	= Истина;
	Отказ 		= Ложь;
	
	Если ТаблицаРезультат.ТипДанных	= "UISPBO" Тогда
		ЗагрузитьСБО(ТаблицаРезультат, ИнформацияОбОшибке, Результат, Отказ);
	ИначеЕсли ТаблицаРезультат.ТипДанных	= "UISPZR" Тогда
		ЗагрузитьРСКП(ТаблицаРезультат, ИнформацияОбОшибке, Результат, Отказ);
	ИначеЕсли ТаблицаРезультат.ТипДанных	= "UISPMO" Тогда
		ЗагрузитьСДО(ТаблицаРезультат, ИнформацияОбОшибке, Результат, Отказ);
	КонецЕсли;	
		
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьСБО(ТаблицаРезультат, ИнформацияОбОшибке, Результат, Отказ)	
	
	Загрузка = Новый Структура;
	Загрузка.Вставить("Договор", Неопределено);
	Загрузка.Вставить("ДействующийДокумент", Неопределено);
	Загрузка.Вставить("ТекущийДокумент", Неопределено);
	Загрузка.Вставить("СведенияОбОрганизации", Неопределено);
	Загрузка.Вставить("СведенияЗагруженные", Неопределено);
	Загрузка.Вставить("ЗагруженныеДанные", Неопределено);
	Загрузка.Вставить("УчетныйНомерБО", Неопределено);
	Загрузка.Вставить("ГосударственныйКонтрактЕИС", Неопределено);
	
	Статусы = Новый Соответствие;
	Статусы.Вставить("boProject", 1);
	Статусы.Вставить("boSentForVerification", 2);
	Статусы.Вставить("boRegistred", 3);
	Статусы.Вставить("boNotificationPublish", 4);
	Статусы.Вставить("boDeniedRegistration", 5);
	
	КодПоРПБС = Неопределено;
	ТаблицаРезультат.Свойство("КодПоРПБС",КодПоРПБС);
	
	НомерЛС = Неопределено;
	ТаблицаРезультат.Свойство("НомерЛС",НомерЛС);
	
	ТОФК = Неопределено;
	ТаблицаРезультат.Свойство("ТОФК",ТОФК);
	
	Загрузка.СведенияОбОрганизации = СведенияОбОрганизации(КодПоРПБС, НомерЛС, ТОФК);
	
	Если Загрузка.СведенияОбОрганизации = Неопределено Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- Не найдено или отсутствует право доступа к данным учреждения с кодом по Сводному реестру %1.'"),КодПоРПБС);
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|
		|" + ТекстОшибки;
		Результат = Ложь;
		Возврат;
	КонецЕсли;	
	
	Если НЕ ТаблицаРезультат.Свойство("БизнесID") ИЛИ НЕ ЗначениеЗаполнено(ТаблицаРезультат.БизнесID) Тогда
		ТекстОшибки = НСтр("ru = '- Не указан уникальный идентификатор (GUID) электронного документа.'");
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|
		|" + ТекстОшибки;
		Результат = Ложь;
		Возврат;
	КонецЕсли;
	
	ТипСвязанногоДокумента = "";
	ТаблицаРезультат.Свойство("ТипСвязанногоДокумента",ТипСвязанногоДокумента);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СведенияОбОбязательствахЗагруженные.ДокументРегистрации КАК ДокументРегистрации,
	|	СведенияОбОбязательствахЗагруженные.GUIDДокумента КАК GUIDДокумента,
	|	СведенияОбОбязательствахЗагруженные.УчетныйНомер КАК УчетныйНомер,
	|	СведенияОбОбязательствахЗагруженные.НомерИзменения КАК НомерИзменения,
	|	СведенияОбОбязательствахЗагруженные.СтатусДокумента КАК СтатусДокумента
	|ИЗ
	|	РегистрСведений.СведенияОбОбязательствахЗагруженные КАК СведенияОбОбязательствахЗагруженные
	|ГДЕ
	|	СведенияОбОбязательствахЗагруженные.GUIDДокумента = &GUIDДокумента");
	
	Запрос.УстановитьПараметр("GUIDДокумента", ТаблицаРезультат.БизнесID);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		СведенияБО = РезультатЗапроса.Выбрать();
		СведенияБО.Следующий();
		Если СведенияБО.СтатусДокумента = "boDeniedRegistration" Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- Документ ""%1"" уже загружен в программу и имеет статус %2. Повторная загрузка невозможна'"),
				СведенияБО.ДокументРегистрации,
				СведенияБО.СтатусДокумента);
			ИнформацияОбОшибке = ИнформацияОбОшибке + "
			|
			|" + ТекстОшибки;
			Результат = Ложь;
			Возврат;
		КонецЕсли;
		
				
		Если Статусы[СведенияБО.СтатусДокумента] > Статусы[ТаблицаРезультат.ТипФайла] Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- Уже загружен документ ""%1"" со статусом %2. Загрузка документа со статусом %3 невозможна'"),
				СведенияБО.ДокументРегистрации,
				СведенияБО.СтатусДокумента,
				ТаблицаРезультат.ТипФайла);
			ИнформацияОбОшибке = ИнформацияОбОшибке + "
			|
			|" + ТекстОшибки;
			Результат = Ложь;
			Возврат;
		КонецЕсли;
		
		Загрузка.СведенияЗагруженные = РегистрыСведений.СведенияОбОбязательствахЗагруженные.СоздатьМенеджерЗаписи();
		Загрузка.СведенияЗагруженные.ДокументРегистрации = СведенияБО.ДокументРегистрации;
		Загрузка.СведенияЗагруженные.Организация = Загрузка.СведенияОбОрганизации.Организация;
		Загрузка.СведенияЗагруженные.Прочитать();
		
		Загрузка.ЗагруженныеДанные = Загрузка.СведенияЗагруженные.ЗагруженныеДанные.Получить();
	
	КонецЕсли;
	
	Если ТаблицаРезультат.Свойство("УчетныйНомерБО") И ЗначениеЗаполнено(ТаблицаРезультат.УчетныйНомерБО) Тогда
		Загрузка.УчетныйНомерБО = ТаблицаРезультат.УчетныйНомерБО;  
	ИначеЕсли ТаблицаРезультат.Свойство("УчетныйНомерБОПУР") И ЗначениеЗаполнено(ТаблицаРезультат.УчетныйНомерБОПУР) Тогда
		Загрузка.УчетныйНомерБО = ТаблицаРезультат.УчетныйНомерБОПУР;  
	КонецЕсли;	
	
	Если СтрНайти("/CONTRACT/MOD_CONTRACT/COR_CONTRACT/COMPL_SVIK/CLOSE_SVIK/MOD_SBO/MOD_NOTICE/CAN_NOTICE/MOD_PBO/MOD_SBO/",
		"/" + ТипСвязанногоДокумента + "/") > 0 ИЛИ Статусы[ТаблицаРезультат.ТипФайла] > 2 Тогда
		// Это контракт или изменения существующего обязательства, должен быть номер БО
		Если НЕ ЗначениеЗаполнено(Загрузка.УчетныйНомерБО) Тогда
			ТекстОшибки = НСтр("ru = '- Не указан учетный номер бюджетного обязательства.'");
			ИнформацияОбОшибке = ИнформацияОбОшибке + "
			|
			|" + ТекстОшибки;
			Результат = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Если НЕ Загрузка.СведенияЗагруженные = Неопределено Тогда
		// Изменения в существующем документе
		Загрузка.Договор = Загрузка.СведенияЗагруженные.ДокументРегистрации.Договор.ПолучитьОбъект();
		Загрузка.ТекущийДокумент = Загрузка.СведенияЗагруженные.ДокументРегистрации.ПолучитьОбъект();
	
	ИначеЕсли ЗначениеЗаполнено(Загрузка.УчетныйНомерБО) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ЕСТЬNULL(СведенияОбОбязательствахЗагруженные.ДокументРегистрации, Неопределено)) КАК ДокументРегистрации,
		|	МАКСИМУМ(ЕСТЬNULL(СведенияОбОбязательствахЗагруженные.НомерИзменения, 0)) КАК НомерИзменения,
		|	УчетныеНомераОбязательств.Обязательство КАК Обязательство,
		|	ЕСТЬNULL(СрокиИсполненияИСуммыОбязательствСрезПоследних.Регистратор, Неопределено) КАК ДействующийДокумент	
		|ИЗ
		|	РегистрСведений.СведенияОбОбязательствахЗагруженные КАК СведенияОбОбязательствахЗагруженные
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.УчетныеНомераОбязательств КАК УчетныеНомераОбязательств
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних КАК СрокиИсполненияИСуммыОбязательствСрезПоследних
		|			ПО (СрокиИсполненияИСуммыОбязательствСрезПоследних.Обязательство = УчетныеНомераОбязательств.Обязательство)
		|		ПО (СведенияОбОбязательствахЗагруженные.УчетныйНомер = УчетныеНомераОбязательств.УчетныйНомерОбязательства)
		|ГДЕ
		|	(СведенияОбОбязательствахЗагруженные.УчетныйНомер = &УчетныйНомер
		|			ИЛИ УчетныеНомераОбязательств.УчетныйНомерОбязательства = &УчетныйНомер)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОбОбязательствахЗагруженные.УчетныйНомер,
		|	УчетныеНомераОбязательств.Обязательство,
		|	СрокиИсполненияИСуммыОбязательствСрезПоследних.Регистратор");
		
		Запрос.УстановитьПараметр("УчетныйНомер", Загрузка.УчетныйНомерБО);
		
		Выборка = Запрос.Выполнить().Выгрузить();
		
		Если Выборка.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(Выборка[0].Обязательство) Тогда
				Загрузка.Договор = Выборка[0].Обязательство.ПолучитьОбъект();
			Иначе
				Загрузка.Договор = Справочники.Договоры.СоздатьЭлемент();
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка[0].ДействующийДокумент) Тогда
				Загрузка.ДействующийДокумент = Выборка[0].ДействующийДокумент.ПолучитьОбъект();
			КонецЕсли;
			Загрузка.ТекущийДокумент = Документы.РегистрацияОбязательствИСведенийПоДоговорам.СоздатьДокумент();
		ИначеЕсли СтрНайти("/MOD_CONTRACT/COR_CONTRACT/COMPL_SVIK/CLOSE_SVIK/MOD_SBO/MOD_NOTICE/CAN_NOTICE/MOD_PBO/MOD_SBO/",
			"/" + ТипСвязанногоДокумента + "/") > 0 Тогда
			// Это изменения существующего обязательства, должен быть первичный документ
			Если НЕ ТаблицаРезультат.Свойство("УчетныйНомерБО") ИЛИ НЕ ЗначениеЗаполнено(ТаблицаРезультат.УчетныйНомерБО) Тогда
				ТекстОшибки = НСтр("ru = '- Отсутствуют данные первичной регистрации обязательства.'");
				ИнформацияОбОшибке = ИнформацияОбОшибке + "
				|
				|" + ТекстОшибки;
				Результат = Ложь;
				Возврат;
			Иначе
				// Учетный номер есть, но данные регистрации обязательства ранее не загружались
				Загрузка.Договор = ДоговорПоНомеруБОРНКП(ТаблицаРезультат.УчетныйНомерБО);
				Если Загрузка.Договор = Неопределено Тогда
					// Договор  ранее не создавался
					Загрузка.Договор = Справочники.Договоры.СоздатьЭлемент();
				Иначе
					Загрузка.Договор = Загрузка.Договор.ПолучитьОбъект();
				КонецЕсли;
				Загрузка.ТекущийДокумент = Документы.РегистрацияОбязательствИСведенийПоДоговорам.СоздатьДокумент();
			КонецЕсли;
		Иначе	
			// Первая загрузка
			Загрузка.Договор = Справочники.Договоры.СоздатьЭлемент();
			Загрузка.ТекущийДокумент = Документы.РегистрацияОбязательствИСведенийПоДоговорам.СоздатьДокумент();
		КонецЕсли;
		
	Иначе
		// Первая загрузка
		Загрузка.Договор = Справочники.Договоры.СоздатьЭлемент();
		Загрузка.ТекущийДокумент = Документы.РегистрацияОбязательствИСведенийПоДоговорам.СоздатьДокумент();
	КонецЕсли;

	// Данные договора
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация", Загрузка.СведенияОбОрганизации.Организация);
	СтруктураРеквизитов.Вставить("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком")); 
	Если ТипСвязанногоДокумента = "CONTRACT" 
		ИЛИ ТипСвязанногоДокумента = "NOTICE" Тогда
		СтруктураРеквизитов.Вставить("ЗаключаетсяПоРезультатамКонкурсныхПроцедур", Истина);
	Иначе
		СтруктураРеквизитов.Вставить("ЗаключаетсяПоРезультатамКонкурсныхПроцедур", Ложь);  
	КонецЕсли;
	Если ТаблицаРезультат.Свойство("ВидОснования") Тогда
		СтруктураРеквизитов.Вставить("ВидОбязательства", ТаблицаРезультат.ВидОснования);
	Иначе
		СтруктураРеквизитов.Вставить("ВидОбязательства", "");
	КонецЕсли;	
	Если ТаблицаРезультат.Свойство("НомерОснования") Тогда
		СтруктураРеквизитов.Вставить("НомерДоговора", ТаблицаРезультат.НомерОснования);
	Иначе
		СтруктураРеквизитов.Вставить("НомерДоговора", "");
	КонецЕсли;
	Если ТаблицаРезультат.Свойство("ДатаОснования") Тогда
		СтруктураРеквизитов.Вставить("ДатаДоговора", ТаблицаРезультат.ДатаОснования);
	Иначе
		СтруктураРеквизитов.Вставить("ДатаДоговора", Дата(1,1,1));
	КонецЕсли;
	Если ТаблицаРезультат.Свойство("ПредметОснования") Тогда
		СтруктураРеквизитов.Вставить("КраткоеСодержание", ТаблицаРезультат.ПредметОснования);
	Иначе
		СтруктураРеквизитов.Вставить("КраткоеСодержание", "");
	КонецЕсли;
	
	МассивСтрок = ТаблицаРезультат.РасшифровкаОбязательства.НайтиСтроки(Новый Структура("ПериодПланаМесяц", "00"));
	СтруктураРеквизитов.Вставить("Долгосрочный", МассивСтрок.Количество() > 0);
	
	АвтоНаименование = " от " + Формат(СтруктураРеквизитов.ДатаДоговора, "ДФ=dd.MM.yyyy; ДП=-") + " № " + СокрЛП(СтруктураРеквизитов.НомерДоговора);
	АвтоНаименование = СокрЛ(Лев(СокрЛП(СтруктураРеквизитов.ВидОбязательства), 59 - СтрДлина(АвтоНаименование)) + АвтоНаименование);
	СтруктураРеквизитов.Вставить("Наименование", АвтоНаименование);
	
	Если Загрузка.Договор.ЭтоНовый() Тогда
		ЗаполнитьЗначенияСвойств(Загрузка.Договор, СтруктураРеквизитов);  
	КонецЕсли;	
		
	// Результат конкурсных процедур
	Если Загрузка.Договор.ЗаключаетсяПоРезультатамКонкурсныхПроцедур Тогда
		Если НЕ Загрузка.Договор.ПризнакЗавершенияКонкурсныхПроцедур Тогда
			Если ТипСвязанногоДокумента = "CONTRACT" 
				ИЛИ ТипСвязанногоДокумента = "MOD_CONTRACT" 
				ИЛИ ТипСвязанногоДокумента = "COR_CONTRACT" Тогда
				Загрузка.Договор.ПризнакЗавершенияКонкурсныхПроцедур = Истина;
				Загрузка.Договор.РезультатЗавершенияКонкурсныхПроцедур = 1;
				Загрузка.Договор.Наименование = СтруктураРеквизитов.Наименование;
			ИначеЕсли ТипСвязанногоДокумента = "CAN_NOTICE" Тогда		
				Загрузка.Договор.ПризнакЗавершенияКонкурсныхПроцедур = Истина;
				Загрузка.Договор.РезультатЗавершенияКонкурсныхПроцедур = 2;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	// Контрагенты. Могут появится после завершения конкурсных процедур, надо проверить и для существующего договора
	Если ТаблицаРезультат.Свойство("РеквизитыКонтрагента") 
		И ТаблицаРезультат.РеквизитыКонтрагента.Количество() > 0 Тогда
		ЭтоПервыйКонтрагент = Истина;
		Для Каждого Контрагент Из ТаблицаРезультат.РеквизитыКонтрагента Цикл 
			ИНН = "";
			Контрагент.Свойство("ИНН",ИНН);
			
			КПП = "";
			Контрагент.Свойство("КПП",КПП);
			
			Наименование = "";
			Контрагент.Свойство("Наименование",Наименование);
			
			КодПоСводномуРеестру = "";
			Контрагент.Свойство("КодПоСводномуРеестру",КодПоСводномуРеестру);   
			
			Если Загрузка.СведенияОбОрганизации.ИНН = ИНН 
				И Загрузка.СведенияОбОрганизации.КПП = КПП Тогда 
				// В ЕИС в список контрагентов включают Организацию - заказчика
				// (контрагент - получатель неустоек)
				// В НПА и описании форматов такого нет, но приходится учитывать
				Продолжить;
			КонецЕсли;	
						
			КонтрагентСсылка = БиблиотекаФункцийОбмена.ОпределитьКонтрагента(ИНН, КПП, Наименование,, КодПоСводномуРеестру);
			Если ЗначениеЗаполнено(КонтрагентСсылка) Тогда
				СчетКонтрагента = НайтиСоздатьСчетКонтрагента(КонтрагентСсылка, Контрагент); 
				Если ЭтоПервыйКонтрагент И НЕ ЗначениеЗаполнено(Загрузка.Договор.Контрагент) Тогда
						Загрузка.Договор.Контрагент = КонтрагентСсылка;
						Загрузка.Договор.СчетКонтрагента = СчетКонтрагента;
						ЭтоПервыйКонтрагент = Ложь;
				КонецЕсли;		
				Если Загрузка.Договор.Контрагенты.Найти(КонтрагентСсылка, "Контрагент") = Неопределено 
					И НЕ Загрузка.Договор.Контрагент = КонтрагентСсылка Тогда
					НовКонтрагент = Загрузка.Договор.Контрагенты.Добавить();
					НовКонтрагент.Контрагент = КонтрагентСсылка;
					НовКонтрагент.СчетКонтрагента = СчетКонтрагента;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	
	// Государственные контракты из ЕИС в сфере закупок
	Если ТаблицаРезультат.Свойство("НомерРеестровойЗаписи")
		И ЗначениеЗаполнено(ТаблицаРезультат.НомерРеестровойЗаписи) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ГосударственныеКонтрактыЕИС.Ссылка КАК Ссылка,
		|	ГосударственныеКонтрактыЕИС.ВладелецКонтракта КАК ВладелецКонтракта,
		|	ГосударственныеКонтрактыЕИС.Код КАК Код
		|ИЗ
		|	Справочник.ГосударственныеКонтрактыЕИС КАК ГосударственныеКонтрактыЕИС
		|ГДЕ
		|	ГосударственныеКонтрактыЕИС.Код = &Код");
		Запрос.УстановитьПараметр("Код", СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ТаблицаРезультат.НомерРеестровойЗаписи, 19, " ", "Справа"));
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если Загрузка.Договор.ЭтоНовый()
				ИЛИ НЕ Выборка.ВладелецКонтракта = Загрузка.Договор.Ссылка Тогда
				// Госконтракт уже введен вручную и создан договор
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- В программе уже введены сведения о госконтракте %1, привязанные к договору %2. Загрузка невозможна'"),
				Выборка.Ссылка,
				Выборка.ВладелецКонтракта);
				ИнформацияОбОшибке = ИнформацияОбОшибке + "
				|
				|" + ТекстОшибки;
				Результат = Ложь;
				Возврат;
			КонецЕсли;
		Иначе
			Загрузка.ГосударственныйКонтрактЕИС = Справочники.ГосударственныеКонтрактыЕИС.СоздатьЭлемент();
			Загрузка.ГосударственныйКонтрактЕИС.Код = ТаблицаРезультат.НомерРеестровойЗаписи;
			Загрузка.ГосударственныйКонтрактЕИС.Организация = Загрузка.СведенияОбОрганизации.Организация; 
			Загрузка.ГосударственныйКонтрактЕИС.Контрагент = Загрузка.Договор.Контрагент;
			Загрузка.ГосударственныйКонтрактЕИС.ДатаЗаключенияКонтракта = Загрузка.Договор.ДатаДоговора;
			Загрузка.ГосударственныйКонтрактЕИС.Номер = Загрузка.Договор.НомерДоговора;
			Загрузка.ГосударственныйКонтрактЕИС.Наименование = Загрузка.Договор.Наименование;
			ИдентификационныйКодЗакупки = "";
			Если ТаблицаРезультат.Свойство("ИКЗ", ИдентификационныйКодЗакупки) Тогда
				Загрузка.ГосударственныйКонтрактЕИС.ИдентификационныйКодЗакупки	= ИдентификационныйКодЗакупки;
			КонецЕсли;
			Если Загрузка.Договор.ЭтоНовый() Тогда
				Загрузка.Договор.УстановитьСсылкуНового(Справочники.Договоры.ПолучитьСсылку());
				ВладелецКонтракта = Загрузка.Договор.ПолучитьСсылкуНового();
			Иначе
				ВладелецКонтракта = Загрузка.Договор.Ссылка;
			КонецЕсли;
			Загрузка.ГосударственныйКонтрактЕИС.ВладелецКонтракта = ВладелецКонтракта;
		КонецЕсли;	
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
	
	// Расшифровка обязательства
	РасшифровкаИсходная = Новый ТаблицаЗначений;
	РасшифровкаИсходная.Колонки.Добавить("КПС", 					Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	РасшифровкаИсходная.Колонки.Добавить("КФО", 					Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));	
	РасшифровкаИсходная.Колонки.Добавить("КЭК", 					Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));	
	РасшифровкаИсходная.Колонки.Добавить("КодЦели", 				Новый ОписаниеТипов("СправочникСсылка.ВидыЦелевыхСредств"));	
	РасшифровкаИсходная.Колонки.Добавить("ОбъектФАИП");	
	РасшифровкаИсходная.Колонки.Добавить("ПериодПлана", 			Новый ОписаниеТипов("СправочникСсылка.Периоды"));	
	РасшифровкаИсходная.Колонки.Добавить("РазделЛицевогоСчета", 	Новый ОписаниеТипов("СправочникСсылка.РазделыЛицевыхСчетов"));					
	РасшифровкаИсходная.Колонки.Добавить("Сумма", 					Новый ОписаниеТипов("Число"));	
	РасшифровкаИсходная.Колонки.Добавить("СуммаВВалюте", 			Новый ОписаниеТипов("Число"));	
	РасшифровкаИсходная.Колонки.Добавить("СуммаВВалютеБезусловная", Новый ОписаниеТипов("Число"));	
	
	ДатаБО = Неопределено;
	ТаблицаРезультат.Свойство("ДатаБО",ДатаБО);
		
	Для Каждого СтрИсходная Из ТаблицаРезультат.РасшифровкаОбязательства Цикл
		
		СтрТЧ = Новый Структура;
		СтрТЧ.Вставить("КФО", ПредопределенноеЗначение("Перечисление.КВД.Бюджет"));
		
		// КПС
		СтрТЧ.Вставить("КПС", КПСПоТекстовомуКодуКБК(СтрИсходная.КБК, СтрИсходная.ТипКБК, ДатаБО, ИнформацияОбОшибке)); 
		
		// Период плана
		Периодичность = ?(СтрИсходная.ПериодПланаМесяц = "00", ПредопределенноеЗначение("Перечисление.Периодичность.Год"), ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
		ДатаНачала = ?(СтрИсходная.ПериодПланаМесяц = "00", НачалоГода(Дата(Число(СтрИсходная.ПериодПланаГод), 1, 1)), НачалоМесяца(Дата(Число(СтрИсходная.ПериодПланаГод), Число(СтрИсходная.ПериодПланаМесяц), 1))); 
		СтрТЧ.Вставить("ПериодПлана", Справочники.Периоды.НайтиСоздатьПериод(Периодичность, ДатаНачала));
		
		// Раздел лицевого счета
		Если НЕ Загрузка.СведенияОбОрганизации.ЛицевойСчет = Неопределено Тогда
			СтрТЧ.Вставить("РазделЛицевогоСчета",  
			БухгалтерскиеОперации.РазделЛицевогоСчетаПоКФО(Загрузка.СведенияОбОрганизации.ЛицевойСчет, ПредопределенноеЗначение("Перечисление.КВД.Бюджет")));
		КонецЕсли;	
		
		// Объект ФАИП/КМИ
		ФАИПКМИ = Неопределено;
		Если ЗначениеЗаполнено(СтрИсходная.КодФАИП) Тогда
			Если СтрДлина(СтрИсходная.КодФАИП) = 24 Тогда // Это КМИ
				ФАИПКМИ = НайтиСоздатьКМИ(Загрузка.СведенияОбОрганизации.Организация, СтрИсходная.КодФАИП, СтрИсходная.НаименованиеФАИП);
			Иначе // Это ФАИП
				ФАИПКМИ = НайтиСоздатьФАИП(Загрузка.СведенияОбОрганизации.Организация, СтрИсходная.КодФАИП, СтрИсходная.НаименованиеФАИП);
			КонецЕсли;	
		КонецЕсли;
		СтрТЧ.Вставить("ОбъектФАИП", ФАИПКМИ);  
		//КЭК. В общем случае КОСГУ (КЭК) определить для нового договора и документа невозможно.
		СтрТЧ.Вставить("КЭК", Справочники.КОСГУ.ПустаяСсылка());
		// Код цели
		СтрТЧ.Вставить("КодЦели", КодЦелиТекстовомуКоду(СтрИсходная.АналитическийКод)); 
		
		// Суммы по строке
		СтрТЧ.Вставить("Сумма", СтрИсходная.Сумма);  
		СтрТЧ.Вставить("СуммаВВалюте", СтрИсходная.Сумма);    
		СтрТЧ.Вставить("СуммаВВалютеБезусловная", СтрИсходная.СуммаБезусловная); 
		
		НовСтр = РасшифровкаИсходная.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрТЧ); 
	КонецЦикла;	
	
	// Ссылки на приложенные файлы - надо заполнить
	ВложенныеФайлы = Загрузка.Договор.ДокументыЕИС;
	Для Каждого ВложенныйФайл Из ТаблицаРезультат.ВложенныеФайлы Цикл
		Если ВложенныеФайлы.Найти(ВложенныйФайл.СсылкаДляСкачивания, "СсылкаДляСкачивания") = Неопределено Тогда
			НовСтр = ВложенныеФайлы.Добавить();
			НовСтр.ИмяФайла = ВложенныйФайл.ИмяФайла;
			НовСтр.СсылкаДляСкачивания = ВложенныйФайл.СсылкаДляСкачивания;
		КонецЕсли;
	КонецЦикла;	
	
	// Пишем объекты в БД
	
	Загрузка.Договор.Записать();
	Если ЗагруженныеОбъекты.НайтиСтроки(Новый Структура("ЗагруженныйОбъект", Загрузка.Договор.Ссылка)).Количество() = 0 Тогда
		НовСтр = ЗагруженныеОбъекты.Добавить();
		НовСтр.ЗагруженныйОбъект = Загрузка.Договор.Ссылка;
	КонецЕсли;	
	Если НЕ Загрузка.ГосударственныйКонтрактЕИС = Неопределено Тогда
		  Загрузка.ГосударственныйКонтрактЕИС.Записать();
		  Если ЗагруженныеОбъекты.НайтиСтроки(Новый Структура("ЗагруженныйОбъект", Загрузка.ГосударственныйКонтрактЕИС.Ссылка)).Количество() = 0 Тогда
			  НовСтр = ЗагруженныеОбъекты.Добавить();
			  НовСтр.ЗагруженныйОбъект = Загрузка.ГосударственныйКонтрактЕИС.Ссылка;
		  КонецЕсли;
	КонецЕсли;	  
	
	ТекущийДокумент = Загрузка.ТекущийДокумент;
	Если ТекущийДокумент.Проведен Тогда
		ТекущийДокумент.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;	 
	
	Если Загрузка.ДействующийДокумент = Неопределено Тогда //Заполняем по договору
		ТекущийДокумент.Заполнить(Загрузка.Договор.Ссылка);
		ТекущийДокумент.ЛицевойСчет = ?(ЗначениеЗаполнено(ТекущийДокумент.ЛицевойСчет), ТекущийДокумент.ЛицевойСчет, Загрузка.СведенияОбОрганизации.ЛицевойСчет);
		Если НЕ Загрузка.СведенияОбОрганизации.РеквизитыЛС = Неопределено Тогда
			ТекущийДокумент.ОрганКазначейства 		= ?(ЗначениеЗаполнено(ТекущийДокумент.ОрганКазначейства), ТекущийДокумент.ОрганКазначейства, Загрузка.СведенияОбОрганизации.КассовыйОрган);
			ТекущийДокумент.РеквизитыЛицевогоСчета 	= ?(ЗначениеЗаполнено(ТекущийДокумент.РеквизитыЛицевогоСчета), ТекущийДокумент.РеквизитыЛицевогоСчета, Загрузка.СведенияОбОрганизации.РеквизитыЛС);
		КонецЕсли;
	Иначе //Заполняем по существующему документу
		ТекущийДокумент.Заполнить(Загрузка.ДействующийДокумент.Ссылка);
	КонецЕсли;
	ТаблицаРезультат.Свойство("СрокИсполнения", ТекущийДокумент.СрокИсполнения); 

	ТекущийДокумент.Дата = ДатаБО; 
	ТаблицаРезультат.Свойство("ПроцентАванса", ТекущийДокумент.АвансПроцентом);
	ТаблицаРезультат.Свойство("СуммаПоОснованию_руб", ТекущийДокумент.Сумма);
	ТаблицаРезультат.Свойство("СуммаАванса", ТекущийДокумент.СуммаАванса);
	ТаблицаРезультат.Свойство("СуммаПоОснованию_вал", ТекущийДокумент.СуммаВВалюте);
	
	// Заполняем таблицу Расшифровка обязательства документа
	ТабЧасть = ТекущийДокумент.РасшифровкаОбязательстваБюджет;
	СтруктураПоиска = Новый Структура("КПС, КФО, ОбъектФАИП, ПериодПлана, КодЦели");
	// Ищем аналогичные строки в ТЧ и файле
	Для Каждого СтрФайл Из РасшифровкаИсходная Цикл 
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрФайл);
		НайденныеСтроки = ТабЧасть.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 1 Тогда
			//можно заполнить суммы изменений
			ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], СтрФайл, "Сумма, СуммаВВалюте, СуммаВВалютеБезусловная");
		КонецЕсли;
	КонецЦикла;
	// Добавляем строки отсутствующие в ТЧ и присутствующие в файле
	Для Каждого СтрФайл Из РасшифровкаИсходная Цикл 
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрФайл);
		НайденныеСтроки = ТабЧасть.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НовСтр = ТабЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, СтрФайл);
		КонецЕсли;
	КонецЦикла;
	// Обнуляем строки присутствующие в ТЧ и отсутствующие в файле
	СтрНоль = Новый Структура("Сумма, СуммаВВалюте, СуммаВВалютеБезусловная", 0, 0, 0);
	Для Каждого СтрТч Из ТабЧасть Цикл 
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрТч);
		НайденныеСтроки = РасшифровкаИсходная.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрТч, СтрНоль);
		КонецЕсли;
	КонецЦикла;
		
	ТекущийДокумент.ДополнительныеСвойства.Вставить("ЭтоНовый", ТекущийДокумент.ЭтоНовый());					
	ТекущийДокумент.Записать();
	
	Если Загрузка.ДействующийДокумент = Неопределено Тогда
		// Надо записать бух. операцию для первого документа в цепочке 
		ТиповаяОперация = БухгалтерскиеОперацииСервер.ТиповаяОперацияПоУмолчанию(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ТекущийДокумент.Ссылка)));
		ДопРеквизиты = БухгалтерскиеОперацииСервер.ЗаполнитьДополнительныеРеквизиты(ТекущийДокумент.Ссылка, ТиповаяОперация);
		ПараметрыЗаписиТиповойОперации = БухгалтерскиеОперацииСервер.ЗаписатьТиповуюОперациюИДопРеквизиты_Параметры();
		ПараметрыЗаписиТиповойОперации.Документ					= ТекущийДокумент.Ссылка;
		ПараметрыЗаписиТиповойОперации.Операция					= ТиповаяОперация;
		ПараметрыЗаписиТиповойОперации.Организация				= Загрузка.СведенияОбОрганизации.Организация;
		ПараметрыЗаписиТиповойОперации.Дата						= ТекущийДокумент.Дата;
		ПараметрыЗаписиТиповойОперации.ДополнительныеРеквизиты	= ДопРеквизиты;
		БухгалтерскиеОперацииСервер.ЗаписатьТиповуюОперациюИДопРеквизиты(ПараметрыЗаписиТиповойОперации, Отказ);
	Иначе
		//Операцию возьмем из предыдущего документа
		ТиповаяОперация = БухгалтерскиеОперацииСервер.БухгалтерскаяОперацияДокумента(Загрузка.ДействующийДокумент.Ссылка);
		ДопРеквизиты = БухгалтерскиеОперацииСервер.ЗаполнитьДополнительныеРеквизиты(Загрузка.ДействующийДокумент.Ссылка, ТиповаяОперация);
		ПараметрыЗаписиТиповойОперации = БухгалтерскиеОперацииСервер.ЗаписатьТиповуюОперациюИДопРеквизиты_Параметры();
		ПараметрыЗаписиТиповойОперации.Документ					= ТекущийДокумент.Ссылка;
		ПараметрыЗаписиТиповойОперации.Операция					= ТиповаяОперация;
		ПараметрыЗаписиТиповойОперации.Организация				= Загрузка.СведенияОбОрганизации.Организация;
		ПараметрыЗаписиТиповойОперации.Дата						= ТекущийДокумент.Дата;
		ПараметрыЗаписиТиповойОперации.ДополнительныеРеквизиты	= ДопРеквизиты;
		БухгалтерскиеОперацииСервер.ЗаписатьТиповуюОперациюИДопРеквизиты(ПараметрыЗаписиТиповойОперации, Отказ);
	КонецЕсли;		
	
	//Сведения о загрузке обязательства
	Если Загрузка.СведенияЗагруженные = Неопределено Тогда
		Запись = РегистрыСведений.СведенияОбОбязательствахЗагруженные.СоздатьМенеджерЗаписи();
	Иначе 
		Запись = Загрузка.СведенияЗагруженные;
	КонецЕсли;	
	Запись.ДокументРегистрации = ТекущийДокумент.Ссылка;
	Запись.Организация = Загрузка.СведенияОбОрганизации.Организация;
	Запись.УчетныйНомер = Загрузка.УчетныйНомерБО;
	
	НомерВерсииБОЕИС = "0";
	Если НЕ ТаблицаРезультат.Свойство("НомерВерсииБОЕИС",НомерВерсииБОЕИС) Тогда
		НомерВерсииБОЕИС = "0";
	КонецЕсли;
	
	Запись.НомерИзменения = Число(НомерВерсииБОЕИС);
	
	БизнесID = Неопределено;
	ТаблицаРезультат.Свойство("БизнесID",БизнесID);
	
	Запись.GUIDДокумента = БизнесID;
	
	БизнесIDРодительский = Неопределено;
	ТаблицаРезультат.Свойство("БизнесIDРодительский",БизнесIDРодительский);
	
	Запись.GUIDРодителя = БизнесIDРодительский;
	Запись.СтатусДокумента = ТаблицаРезультат.ТипФайла;
	Если СоответствияТипыДокументов[ТаблицаРезультат.ТипФайла] = Истина Тогда
		Запись.СтатусДокументаПодробно = Перечисления.ТипыДокументовСообщенийЕИС[ТаблицаРезультат.ТипФайла];
	Иначе
		Запись.СтатусДокументаПодробно = ПредопределенноеЗначение("Перечисление.ТипыДокументовСообщенийЕИС.ПустаяСсылка");
	КонецЕсли;
	Запись.ЗагруженныеДанные = Новый ХранилищеЗначения(ТаблицаРезультат);
	Запись.ДатаЗагрузки = ТекущаяДатаСеанса();
	Запись.Пользователь = Пользователи.ТекущийПользователь();
	Запись.Записать();

	// Учетный номер обязательства
	Если ЗначениеЗаполнено(Загрузка.УчетныйНомерБО) Тогда
		Запись = Неопределено;
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	УчетныеНомераОбязательств.Обязательство КАК Обязательство,
		|	УчетныеНомераОбязательств.УчетныйНомерОбязательства КАК УчетныйНомерОбязательства
		|ИЗ
		|	РегистрСведений.УчетныеНомераОбязательств КАК УчетныеНомераОбязательств
		|ГДЕ
		|	УчетныеНомераОбязательств.Обязательство = &Обязательство");
		Запрос.УстановитьПараметр("Обязательство", Загрузка.Договор.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если НЕ Выборка.УчетныйНомерОбязательства = Загрузка.УчетныйНомерБО Тогда
				Запись = РегистрыСведений.УчетныеНомераОбязательств.СоздатьМенеджерЗаписи();
				Запись.Обязательство = Загрузка.Договор.Ссылка;
				Запись.Прочитать();
			КонецЕсли;
		Иначе
			Запись = РегистрыСведений.УчетныеНомераОбязательств.СоздатьМенеджерЗаписи();
			Запись.Обязательство = Загрузка.Договор.Ссылка;
		КонецЕсли;
		Если НЕ Запись = Неопределено Тогда
			Запись.УчетныйНомерОбязательства = Загрузка.УчетныйНомерБО;
			Запись.Записать();
		КонецЕсли;		
	КонецЕсли;
	
	// Характеристики договора
	Если НЕ Загрузка.ГосударственныйКонтрактЕИС = Неопределено Тогда
		Если ЗначениеЗаполнено(Загрузка.ГосударственныйКонтрактЕИС.Код) Тогда
			Запись = РегистрыСведений.ХарактеристикиОбязательств.СоздатьМенеджерЗаписи();
			Запись.Период = ТекущаяДатаСеанса();
			Запись.Договор = Загрузка.Договор.Ссылка;
	        Запись.ВидХарактеристики = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыХарактеристикОбязательства.НомерРеестровойЗаписи");
			Запись.ЗначениеХарактеристики = Загрузка.ГосударственныйКонтрактЕИС.Код;
		    Запись.Записать(); 
		КонецЕсли;
		Если ЗначениеЗаполнено(Загрузка.ГосударственныйКонтрактЕИС.ИдентификационныйКодЗакупки) Тогда
			Запись = РегистрыСведений.ХарактеристикиОбязательств.СоздатьМенеджерЗаписи();
			Запись.Период = ТекущаяДатаСеанса();
			Запись.Договор = Загрузка.Договор.Ссылка;
	        Запись.ВидХарактеристики = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыХарактеристикОбязательства.ИКЗ");
			Запись.ЗначениеХарактеристики = Загрузка.ГосударственныйКонтрактЕИС.ИдентификационныйКодЗакупки;
		    Запись.Записать(); 
		КонецЕсли;
	КонецЕсли;	
	
	ЗафиксироватьТранзакцию();
	Исключение
		
	Результат = Ложь;
	ИнформацияОбОшибке = ИнформацияОбОшибке + "
			|
			|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	ОтменитьТранзакцию();
	
	ЗагруженныеОбъекты.Очистить();
	
	КонецПопытки;	

	Если Результат Тогда
		Если ЗагруженныеОбъекты.НайтиСтроки(Новый Структура("ЗагруженныйОбъект", ТекущийДокумент.Ссылка)).Количество() = 0 Тогда
			НовСтр = ЗагруженныеОбъекты.Добавить();
			НовСтр.ЗагруженныйОбъект = ТекущийДокумент.Ссылка;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ЗагрузитьРСКП(ТаблицаРезультат, ИнформацияОбОшибке, Результат, Отказ)	
	
	Загрузка = Новый Структура;
	Загрузка.Вставить("Договор", Неопределено);
	Загрузка.Вставить("Контрагент", Неопределено);
	Загрузка.Вставить("ФАИПКМИ", Неопределено);
	Загрузка.Вставить("ТекущийДокумент", Неопределено);
	Загрузка.Вставить("СведенияОбОрганизации", Неопределено);
	Загрузка.Вставить("СведенияЗагруженные", Неопределено);
	Загрузка.Вставить("ЗагруженныеДанные", Неопределено);
	Загрузка.Вставить("УчетныйНомерБО", Неопределено);
	Загрузка.Вставить("НомерРеестровойЗаписи", Неопределено);
	
	КодПоРПБС = Неопределено;
	ТаблицаРезультат.Свойство("КодПоРПБС",КодПоРПБС);
	
	НомерЛС = Неопределено;
	ТаблицаРезультат.Свойство("НомерЛС",НомерЛС);
	
	ТОФК = Неопределено;
	ТаблицаРезультат.Свойство("ТОФК",ТОФК);
	
	Загрузка.СведенияОбОрганизации = СведенияОбОрганизации(КодПоРПБС, НомерЛС, ТОФК);
	
	Если Загрузка.СведенияОбОрганизации = Неопределено Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- Не найдено или отсутствует право доступа к данным учреждения с кодом по Сводному реестру %1.'"),
		КодПоРПБС);
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|
		|" + ТекстОшибки;
		Результат = Ложь;
		Возврат;
	КонецЕсли;	
	
	Если НЕ ТаблицаРезультат.Свойство("БизнесID") ИЛИ НЕ ЗначениеЗаполнено(ТаблицаРезультат.БизнесID) Тогда
		ТекстОшибки = НСтр("ru = '- Не указан уникальный идентификатор (GUID) электронного документа.'");
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|
		|" + ТекстОшибки;
		Результат = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ТаблицаРезультат.Свойство("НомерБО") И ЗначениеЗаполнено(ТаблицаРезультат.НомерБО) Тогда
		Загрузка.УчетныйНомерБО = ТаблицаРезультат.НомерБО;
	КонецЕсли;
	
	Если ТаблицаРезультат.Свойство("НомерРеестровойЗаписи") И ЗначениеЗаполнено(ТаблицаРезультат.НомерРеестровойЗаписи) Тогда
		Загрузка.НомерРеестровойЗаписи = ТаблицаРезультат.НомерРеестровойЗаписи;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Загрузка.УчетныйНомерБО) И НЕ ЗначениеЗаполнено(Загрузка.НомерРеестровойЗаписи) Тогда
		ТекстОшибки = НСтр("ru = '- Не указан номер бюджетного обязательства и (или) номер реестровой записи.'");
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|
		|" + ТекстОшибки;
		Результат = Ложь;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СведенияОбОбязательствахЗагруженные.ДокументРегистрации КАК ДокументРегистрации,
	|	СведенияОбОбязательствахЗагруженные.GUIDДокумента КАК GUIDДокумента,
	|	СведенияОбОбязательствахЗагруженные.УчетныйНомер КАК УчетныйНомер,
	|	СведенияОбОбязательствахЗагруженные.НомерИзменения КАК НомерИзменения,
	|	СведенияОбОбязательствахЗагруженные.СтатусДокумента КАК СтатусДокумента
	|ИЗ
	|	РегистрСведений.СведенияОбОбязательствахЗагруженные КАК СведенияОбОбязательствахЗагруженные
	|ГДЕ
	|	СведенияОбОбязательствахЗагруженные.GUIDДокумента = &GUIDДокумента");
	
	Запрос.УстановитьПараметр("GUIDДокумента", ТаблицаРезультат.БизнесID);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		СведенияБО = РезультатЗапроса.Выбрать();
		СведенияБО.Следующий();
		Если СведенияБО.СтатусДокумента = "zkrDeniedRegistration" Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- Документ ""%1"" уже загружен в программу и имеет статус %2. Повторная загрузка невозможна'"),
			    СведенияБО.ДокументРегистрации,
				СведенияБО.СтатусДокумента);
			ИнформацияОбОшибке = ИнформацияОбОшибке + "
			|
			|" + ТекстОшибки;
			Результат = Ложь;
			Возврат;
		КонецЕсли;
		
		Статусы = Новый Соответствие;
		Статусы.Вставить("zkrProject", 1);
		Статусы.Вставить("zkrSentForVerification", 2);
		Статусы.Вставить("zkrDeniedRegistration", 3);
		Статусы.Вставить("zkrRegistred", 4);
		Статусы.Вставить("zkrExecuted", 5);
		Статусы.Вставить("zkrCanceled", 6); 

		Если Статусы[СведенияБО.СтатусДокумента] > Статусы[ТаблицаРезультат.ТипФайла] Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- Уже загружен документ ""%1"" со статусом %2. Загрузка документа со статусом %3 невозможна'"),
				СведенияБО.ДокументРегистрации,
				СведенияБО.СтатусДокумента,
				ТаблицаРезультат.ТипФайла);
			ИнформацияОбОшибке = ИнформацияОбОшибке + "
			|
			|" + ТекстОшибки;
			Результат = Ложь;
			Возврат;
		КонецЕсли;
		
		Загрузка.СведенияЗагруженные = РегистрыСведений.СведенияОбОбязательствахЗагруженные.СоздатьМенеджерЗаписи();
		Загрузка.СведенияЗагруженные.ДокументРегистрации = СведенияБО.ДокументРегистрации;
		Загрузка.СведенияЗагруженные.Организация = Загрузка.СведенияОбОрганизации.Организация;
		Загрузка.СведенияЗагруженные.Прочитать();
		
		Загрузка.ЗагруженныеДанные = Загрузка.СведенияЗагруженные.ЗагруженныеДанные.Получить();
	
	КонецЕсли;
	
	Если НЕ Загрузка.СведенияЗагруженные = Неопределено Тогда
		// Изменения в существующем документе
		Загрузка.Договор = Загрузка.СведенияЗагруженные.ДокументРегистрации.Договор.ПолучитьОбъект();
		Загрузка.ТекущийДокумент = Загрузка.СведенияЗагруженные.ДокументРегистрации.ПолучитьОбъект();
	Иначе
		// Первая загрузка
		Загрузка.Договор = ДоговорПоНомеруБОРНКП(Загрузка.УчетныйНомерБО, Загрузка.НомерРеестровойЗаписи);
		Если НЕ ЗначениеЗаполнено(Загрузка.Договор) Тогда
			Если ЗначениеЗаполнено(Загрузка.УчетныйНомерБО) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- Не найден договор с номером бюджетного обязательства %1.
					|Укажите номер бюджетного обязательства %1 в поле ""Учетный номер обязательтсва"" на закладке ""Характеристики"" соответствующего договора.'"),
					Загрузка.УчетныйНомерБО);
			Иначе
				ТекстОшибки = НСтр("ru = 'Не найден договор с номером реестровой записи %1.
					|Укажите номер реестровой записи %1 в одной из характеристик договора:
					|1) Регистрационные данные - Номер реестровой записи, присвоенный уполномоченным органом
					|2) Информация об оплате контрактов - Номер реестровой записи в реестре контрактов/ реестре соглашений.
					|ИЛИ загрузите государственный контракт с номером реестровой записи %1 из ЕИС в справочник ""Государственные контракты из ЕИС в сфере закупок""
					|Статья на ИТС о загрузке гос.контрактов: https://its.1c.ru/db/metbud81#content:7861:hdoc.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Загрузка.НомерРеестровойЗаписи);
			КонецЕсли;
			ИнформацияОбОшибке = ИнформацияОбОшибке + "
			|
			|" + ТекстОшибки;
			Результат = Ложь;
			Возврат;
		КонецЕсли;
		Загрузка.Договор = Загрузка.Договор.ПолучитьОбъект();
		Загрузка.ТекущийДокумент = Документы.ВнешнееРСКП.СоздатьДокумент();
	КонецЕсли;
	
	КодФАИП = Неопределено;
	ТаблицаРезультат.Свойство("КодФАИП",КодФАИП);
	
	// Объект ФАИП/КМИ
	Если ЗначениеЗаполнено(КодФАИП) Тогда
		Если СтрДлина(КодФАИП) = 24 Тогда // Это КМИ
			Загрузка.ФАИПКМИ = НайтиСоздатьКМИ(Загрузка.СведенияОбОрганизации.Организация, КодФАИП, "", Ложь);
		Иначе // Это ФАИП
			Загрузка.ФАИПКМИ = НайтиСоздатьФАИП(Загрузка.СведенияОбОрганизации.Организация, КодФАИП, "", Ложь);
		КонецЕсли;	
	КонецЕсли;
			
	НачатьТранзакцию();
	Попытка
	
	// Расшифровка обязательства
	РасшифровкаИсходная = Новый ТаблицаЗначений;
	РасшифровкаИсходная.Колонки.Добавить("КБКНазначениеПлатежа", 	Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	РасшифровкаИсходная.Колонки.Добавить("КФО", 					Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));	
	РасшифровкаИсходная.Колонки.Добавить("КОСГУНазначениеПлатежа", 	Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));	
	РасшифровкаИсходная.Колонки.Добавить("ИсточникСредств", 		Новый ОписаниеТипов("СправочникСсылка.ИсточникиСредств"));		
	РасшифровкаИсходная.Колонки.Добавить("КодЦели", 				Новый ОписаниеТипов("СправочникСсылка.ВидыЦелевыхСредств"));	
	РасшифровкаИсходная.Колонки.Добавить("Сумма", 					Новый ОписаниеТипов("Число"));	
	РасшифровкаИсходная.Колонки.Добавить("СуммаВал", 				Новый ОписаниеТипов("Число"));	
	
		
	Для Каждого СтрИсходная Из ТаблицаРезультат.РасшифровкаЗаявки Цикл
		СтрТЧ = Новый Структура; 
		
		// ИсточникСредств и КФО
		Если СтрИсходная.КодВидаСредств = "1" Тогда // это бюджет
			СтрТЧ.Вставить("ИсточникСредств", ПредопределенноеЗначение("Справочник.ИсточникиСредств.СредстваБюджета")); 
			СтрТЧ.Вставить("КФО", ПредопределенноеЗначение("Перечисление.КВД.Бюджет"));
		Иначе
			ПолучитьКФОИсточникСредств(СтрТЧ, Загрузка.СведенияОбОрганизации.ЛицевойСчет, СтрИсходная.КодВидаСредств);
		КонецЕсли;	
		
		// КПС
		СтрТЧ.Вставить("КБКНазначениеПлатежа", КПСПоТекстовомуКодуКБК(СтрИсходная.КБК, СтрИсходная.ТипКБК, ТаблицаРезультат.ДатаЗаявки, ИнформацияОбОшибке)); 
		
		//КЭК. В общем случае КОСГУ (КЭК) определить для нового договора и документа невозможно.
		СтрТЧ.Вставить("КОСГУНазначениеПлатежа", Справочники.КОСГУ.ПустаяСсылка());
		// Код цели
		СтрТЧ.Вставить("КодЦели", КодЦелиТекстовомуКоду(СтрИсходная.КодЦели)); 
		
		// Суммы по строке
		СтрТЧ.Вставить("Сумма", СтрИсходная.Сумма);  
		СтрТЧ.Вставить("СуммаВал", СтрИсходная.СуммаВВалюте); 
		Если ТаблицаРезультат.КодВалюты = "643" Тогда
			СтрТЧ.Сумма = СтрТЧ.СуммаВал;
		КонецЕсли;	
		
		НовСтр = РасшифровкаИсходная.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, СтрТЧ); 
	КонецЦикла;
	
	РасшифровкаИсходная.Свернуть("КБКНазначениеПлатежа,КФО,КОСГУНазначениеПлатежа,ИсточникСредств,КодЦели","Сумма,СуммаВал");//если вдруг КБК заполнить не удалось, чтобы сумма общая была правильная
	
	// Ссылки на приложенные файлы - надо заполнить
	Если ТаблицаРезультат.ВложенныеФайлы.Количество() > 0 Тогда
		ВложенныеФайлы = Загрузка.Договор.ДокументыЕИС;
		Для Каждого ВложенныйФайл Из ТаблицаРезультат.ВложенныеФайлы Цикл
			Если ВложенныеФайлы.Найти(ВложенныйФайл.СсылкаДляСкачивания, "СсылкаДляСкачивания") = Неопределено Тогда
				НовСтр = ВложенныеФайлы.Добавить();
				НовСтр.ИмяФайла = ВложенныйФайл.ИмяФайла;
				НовСтр.СсылкаДляСкачивания = ВложенныйФайл.СсылкаДляСкачивания;
			КонецЕсли;
		КонецЦикла;
		Загрузка.Договор.Записать();
		Если ЗагруженныеОбъекты.НайтиСтроки(Новый Структура("ЗагруженныйОбъект", Загрузка.Договор.Ссылка)).Количество() = 0 Тогда
			НовСтр = ЗагруженныеОбъекты.Добавить();
			НовСтр.ЗагруженныйОбъект = Загрузка.Договор.Ссылка;
		КонецЕсли;	
	КонецЕсли;
			
	ТекущийДокумент = Загрузка.ТекущийДокумент;
	
	ДатаЗаявки = Неопределено;
	ТаблицаРезультат.Свойство("ДатаЗаявки",ДатаЗаявки);
	
	НомерЗаявки = Неопределено;
	ТаблицаРезультат.Свойство("НомерЗаявки",НомерЗаявки);
	
	КодПризнакаАвансовогоПлатежа = Неопределено;
	ТаблицаРезультат.Свойство("КодПризнакаАвансовогоПлатежа",КодПризнакаАвансовогоПлатежа);

	НазначениеПлатежа = Неопределено;
	ТаблицаРезультат.Свойство("НазначениеПлатежа",НазначениеПлатежа);
	
	
	ТекущийДокумент.Дата = ДатаЗаявки; 
	ТекущийДокумент.Номер = НомерЗаявки; 
	ТекущийДокумент.Организация = Загрузка.СведенияОбОрганизации.Организация;
	ТекущийДокумент.Контрагент = Загрузка.Договор.Контрагент;
	ТекущийДокумент.СчетКонтрагента = Загрузка.Договор.СчетКонтрагента;
	ТекущийДокумент.Договор = Загрузка.Договор.Ссылка;
	ТекущийДокумент.ЛицевойСчет = Загрузка.СведенияОбОрганизации.ЛицевойСчет;
	ТекущийДокумент.ОбъектФАИП = Загрузка.ФАИПКМИ;
	ТекущийДокумент.АвансовыйПлатеж = ?(КодПризнакаАвансовогоПлатежа = "1", Истина, Ложь);
	ТекущийДокумент.НазначениеПлатежа = НазначениеПлатежа;
		
	// Заполняем таблицу Расшифровка заявки документа
	ТабЧасть = ТекущийДокумент.РасшифровкаПлатежа;
	СтруктураПоиска = Новый Структура("ИсточникСредств, КБКНазначениеПлатежа, КФО, КодЦели");
	// Ищем аналогичные строки в ТЧ и файле
	Для Каждого СтрФайл Из РасшифровкаИсходная Цикл 
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрФайл);
		НайденныеСтроки = ТабЧасть.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 1 Тогда
			//можно заполнить суммы изменений
			ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], СтрФайл, "Сумма, СуммаВал");
		КонецЕсли;
	КонецЦикла;
	// Добавляем строки отсутствующие в ТЧ и присутствующие в файле
	Для Каждого СтрФайл Из РасшифровкаИсходная Цикл 
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрФайл);
		НайденныеСтроки = ТабЧасть.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НовСтр = ТабЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, СтрФайл);
		КонецЕсли;
	КонецЦикла;
	// Обнуляем строки присутствующие в ТЧ и отсутствующие в файле
	МассивКУдалению = Новый Массив;
	Для Каждого СтрТч Из ТабЧасть Цикл 
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрТч);
		НайденныеСтроки = РасшифровкаИсходная.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			МассивКУдалению.Добавить(СтрТч);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлМас Из МассивКУдалению Цикл
		ТабЧасть.Удалить(ЭлМас);	
	КонецЦикла;
	
	ТекущийДокумент.СуммаДокумента = ТекущийДокумент.РасшифровкаПлатежа.Итог("Сумма");
	ТекущийДокумент.СуммаДокументаВВалюте = ТекущийДокумент.РасшифровкаПлатежа.Итог("СуммаВал");
		
	ТекущийДокумент.ДополнительныеСвойства.Вставить("ЭтоНовый", ТекущийДокумент.ЭтоНовый());					
	ТекущийДокумент.Записать();
	
	//Сведения о загрузке 
	Если Загрузка.СведенияЗагруженные = Неопределено Тогда
		Запись = РегистрыСведений.СведенияОбОбязательствахЗагруженные.СоздатьМенеджерЗаписи();
	Иначе 
		Запись = Загрузка.СведенияЗагруженные;
	КонецЕсли;	
	Запись.ДокументРегистрации = ТекущийДокумент.Ссылка;
	Запись.Организация = Загрузка.СведенияОбОрганизации.Организация;
	Запись.УчетныйНомер = Загрузка.УчетныйНомерБО;
	Запись.GUIDДокумента = ТаблицаРезультат.БизнесID;
	Запись.СтатусДокумента = ТаблицаРезультат.ТипФайла;
	Если СоответствияТипыДокументов[ТаблицаРезультат.ТипФайла] = Истина Тогда
		Запись.СтатусДокументаПодробно = Перечисления.ТипыДокументовСообщенийЕИС[ТаблицаРезультат.ТипФайла];
	Иначе
		Запись.СтатусДокументаПодробно = ПредопределенноеЗначение("Перечисление.ТипыДокументовСообщенийЕИС.ПустаяСсылка");
	КонецЕсли;
	Запись.ЗагруженныеДанные = Новый ХранилищеЗначения(ТаблицаРезультат);
	Запись.ДатаЗагрузки = ТекущаяДатаСеанса();
	Запись.Пользователь = Пользователи.ТекущийПользователь();
	Запись.Записать();
	
	ЗафиксироватьТранзакцию();
	
	Исключение
		
	Результат = Ложь;
	ИнформацияОбОшибке = ИнформацияОбОшибке + "
			|
			|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	ОтменитьТранзакцию();
	
	ЗагруженныеОбъекты.Очистить();
	
	КонецПопытки;	

	Если Результат Тогда
		Если ЗагруженныеОбъекты.НайтиСтроки(Новый Структура("ЗагруженныйОбъект", ТекущийДокумент.Ссылка)).Количество() = 0 Тогда
			НовСтр = ЗагруженныеОбъекты.Добавить();
			НовСтр.ЗагруженныйОбъект = ТекущийДокумент.Ссылка;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ЗагрузитьСДО(ТаблицаРезультат, ИнформацияОбОшибке, Результат, Отказ)	
	
	Загрузка = Новый Структура;
	Загрузка.Вставить("Договор", Неопределено);
	Загрузка.Вставить("ДействующийДокумент", Неопределено);
	Загрузка.Вставить("ТекущийДокумент", Неопределено);
	Загрузка.Вставить("СведенияОбОрганизации", Неопределено);
	Загрузка.Вставить("СведенияЗагруженные", Неопределено);
	Загрузка.Вставить("ЗагруженныеДанные", Неопределено);
	Загрузка.Вставить("УчетныйНомерБО", Неопределено);
	Загрузка.Вставить("ГосударственныйКонтрактЕИС", Неопределено);

	Статусы = Новый Соответствие;
	Статусы.Вставить("moSentForVerification", 1);
	Статусы.Вставить("moRegistred", 2);
	Статусы.Вставить("moDeniedRegistration", 3);
	
	КодПоРПБС = Неопределено;
	ТаблицаРезультат.Свойство("КодПоРПБС",КодПоРПБС);
	
	НомерЛС = Неопределено;
	ТаблицаРезультат.Свойство("НомерЛС",НомерЛС);
	
	ТОФК = Неопределено;
	ТаблицаРезультат.Свойство("ТОФК",ТОФК);
	
	Загрузка.СведенияОбОрганизации = СведенияОбОрганизации(КодПоРПБС, НомерЛС, ТОФК);
	
	Если Загрузка.СведенияОбОрганизации = Неопределено Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- Не найдено или отсутствует право доступа к данным учреждения с кодом по Сводному реестру %1.'"),
		КодПоРПБС);
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|
		|" + ТекстОшибки;
		Результат = Ложь;
		Возврат;
	КонецЕсли;	
	
	Если НЕ ТаблицаРезультат.Свойство("БизнесID") ИЛИ НЕ ЗначениеЗаполнено(ТаблицаРезультат.БизнесID) Тогда
		ТекстОшибки = НСтр("ru = '- Не указан уникальный идентификатор (GUID) электронного документа.'");
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|
		|" + ТекстОшибки;
		Результат = Ложь;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СведенияОбОбязательствахЗагруженные.ДокументРегистрации КАК ДокументРегистрации,
	|	СведенияОбОбязательствахЗагруженные.GUIDДокумента КАК GUIDДокумента,
	|	СведенияОбОбязательствахЗагруженные.УчетныйНомер КАК УчетныйНомер,
	|	СведенияОбОбязательствахЗагруженные.НомерИзменения КАК НомерИзменения,
	|	СведенияОбОбязательствахЗагруженные.СтатусДокумента КАК СтатусДокумента
	|ИЗ
	|	РегистрСведений.СведенияОбОбязательствахЗагруженные КАК СведенияОбОбязательствахЗагруженные
	|ГДЕ
	|	СведенияОбОбязательствахЗагруженные.GUIDДокумента = &GUIDДокумента");
	
	Запрос.УстановитьПараметр("GUIDДокумента", ТаблицаРезультат.БизнесID);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		СведенияДО = РезультатЗапроса.Выбрать();
		СведенияДО.Следующий();
		Если СведенияДО.СтатусДокумента = "boDeniedRegistration" Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- Документ ""%1"" уже загружен в программу и имеет статус %2. Повторная загрузка невозможна'"),
				СведенияДО.ДокументРегистрации,
				СведенияДО.СтатусДокумента);
			ИнформацияОбОшибке = ИнформацияОбОшибке + "
			|
			|" + ТекстОшибки;
			Результат = Ложь;
			Возврат;
		КонецЕсли;
		Если Статусы[СведенияДО.СтатусДокумента] > Статусы[ТаблицаРезультат.ТипФайла] Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- Уже загружен документ ""%1"" со статусом %2. Загрузка документа со статусом %3 невозможна'"),
				СведенияДО.ДокументРегистрации,
				СведенияДО.СтатусДокумента,
				ТаблицаРезультат.ТипФайла);
			ИнформацияОбОшибке = ИнформацияОбОшибке + "
			|
			|" + ТекстОшибки;
			Результат = Ложь;
			Возврат;
		КонецЕсли;
		
		Загрузка.СведенияЗагруженные = РегистрыСведений.СведенияОбОбязательствахЗагруженные.СоздатьМенеджерЗаписи();
		Загрузка.СведенияЗагруженные.ДокументРегистрации = СведенияДО.ДокументРегистрации;
		Загрузка.СведенияЗагруженные.Организация = Загрузка.СведенияОбОрганизации.Организация;
		Загрузка.СведенияЗагруженные.Прочитать();
		Загрузка.ЗагруженныеДанные = Загрузка.СведенияЗагруженные.ЗагруженныеДанные.Получить();
	КонецЕсли;
	
	Если НЕ ТаблицаРезультат.Свойство("УчетныйНомерБО") ИЛИ НЕ ЗначениеЗаполнено(ТаблицаРезультат.УчетныйНомерБО) Тогда
		ТекстОшибки = НСтр("ru = '- Не указан учетный номер бюджетного обязательства.'");
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|
		|" + ТекстОшибки;
		Результат = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ТаблицаРезультат.Свойство("УчетныйНомерБО") И ЗначениеЗаполнено(ТаблицаРезультат.УчетныйНомерБО) Тогда
		Загрузка.УчетныйНомерБО = ТаблицаРезультат.УчетныйНомерБО;
	КонецЕсли;	
	
	Если НЕ Загрузка.СведенияЗагруженные = Неопределено Тогда
		// Изменения в существующем документе
		Загрузка.Договор = Загрузка.СведенияЗагруженные.ДокументРегистрации.Договор;
		Загрузка.ТекущийДокумент = Загрузка.СведенияЗагруженные.ДокументРегистрации.ПолучитьОбъект();
	Иначе	
		// Первая загрузка
		Загрузка.Договор = ДоговорПоНомеруБОРНКП(ТаблицаРезультат.УчетныйНомерБО);
		Загрузка.ТекущийДокумент = Документы.СведенияОДенежномОбязательстве.СоздатьДокумент();
	КонецЕсли;
	
	Если Загрузка.Договор = Неопределено Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '- Не найден договор по учетному номеру бюджетного обязательства %1.
			|Укажите номер бюджетного обязательства %1 в поле ""Учетный номер обязательтсва"" на закладке ""Характеристики"" соответствующего договора.'"),
			ТаблицаРезультат.УчетныйНомерБО);
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|
		|" + ТекстОшибки;
		Результат = Ложь;
		Возврат;
	Иначе
		Загрузка.Договор = Загрузка.Договор.ПолучитьОбъект();
	КонецЕсли;

	НачатьТранзакцию();
	Попытка
		
		ДатаДО = Неопределено;
		ТаблицаРезультат.Свойство("ДатаДО",ДатаДО);
			
		// Расшифровка обязательства
		РасшифровкаИсходная = Новый ТаблицаЗначений;
		РасшифровкаИсходная.Колонки.Добавить("КПС", 					Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		РасшифровкаИсходная.Колонки.Добавить("КФО", 					Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));	
		РасшифровкаИсходная.Колонки.Добавить("КЭК", 					Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));	
		РасшифровкаИсходная.Колонки.Добавить("КодЦели", 				Новый ОписаниеТипов("СправочникСсылка.ВидыЦелевыхСредств"));	
		РасшифровкаИсходная.Колонки.Добавить("ОбъектФАИП");	
		РасшифровкаИсходная.Колонки.Добавить("ИсточникСредств", 		Новый ОписаниеТипов("СправочникСсылка.ИсточникиСредств"));	
		РасшифровкаИсходная.Колонки.Добавить("Валюта", 					Новый ОписаниеТипов("СправочникСсылка.Валюты"));
		РасшифровкаИсходная.Колонки.Добавить("СрокИсполнения", 			Новый ОписаниеТипов("Дата"));	
		РасшифровкаИсходная.Колонки.Добавить("Сумма", 					Новый ОписаниеТипов("Число"));	
		РасшифровкаИсходная.Колонки.Добавить("СуммаВВалюте",			Новый ОписаниеТипов("Число"));	
		РасшифровкаИсходная.Колонки.Добавить("СуммаАванса", 			Новый ОписаниеТипов("Число"));	
			
		Для Каждого СтрИсходная Из ТаблицаРезультат.РасшифровкаОбязательства Цикл
			СтрТЧ = Новый Структура;
			СтрТЧ.Вставить("КФО", ПредопределенноеЗначение("Перечисление.КВД.Бюджет"));
			// КПС
			СтрТЧ.Вставить("КПС", КПСПоТекстовомуКодуКБК(СтрИсходная.КБК, СтрИсходная.ТипКБК, ДатаДО, ИнформацияОбОшибке));
			// ИсточникСредств
			СтрТЧ.Вставить("ИсточникСредств", ПредопределенноеЗначение("Справочник.ИсточникиСредств.СредстваБюджета")); 
			// Объект ФАИП/КМИ
			ФАИПКМИ = Неопределено;
			Если ЗначениеЗаполнено(СтрИсходная.КодФАИП) Тогда
				Если СтрДлина(СтрИсходная.КодФАИП) = 24 Тогда // Это КМИ
					ФАИПКМИ = НайтиСоздатьКМИ(Загрузка.СведенияОбОрганизации.Организация, СтрИсходная.КодФАИП, "");
				Иначе // Это ФАИП
					ФАИПКМИ = НайтиСоздатьФАИП(Загрузка.СведенияОбОрганизации.Организация, СтрИсходная.КодФАИП, "");
				КонецЕсли;	
			КонецЕсли;
			СтрТЧ.Вставить("ОбъектФАИП", ФАИПКМИ);  
			//КЭК. В общем случае КОСГУ (КЭК) определить для нового договора и документа невозможно.
			СтрТЧ.Вставить("КЭК", Справочники.КОСГУ.ПустаяСсылка());
			// Код цели
			СтрТЧ.Вставить("КодЦели", КодЦелиТекстовомуКоду(СтрИсходная.КодЦели)); 
			// Валюта
			СтрТЧ.Вставить("Валюта", ВалютаПоТекстовомуКоду(СтрИсходная.КодВалюты)); 
			// Срок исполнения
			СтрТЧ.Вставить("СрокИсполнения", СтрИсходная.ПланируемыйСрокИсполнения);
			
			// Суммы по строке
			СтрТЧ.Вставить("Сумма", СтрИсходная.СуммаДОВРублях);  
			СтрТЧ.Вставить("СуммаВВалюте", СтрИсходная.СуммаДОВВалютеОбязательства);    
			СтрТЧ.Вставить("СуммаАванса", СтрИсходная.СуммаАванса); 
			
			НовСтр = РасшифровкаИсходная.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, СтрТЧ); 
		КонецЦикла;	
		
		// Ссылки на приложенные файлы - надо заполнить
		ВложенныеФайлы = Загрузка.Договор.ДокументыЕИС;
		Для Каждого ВложенныйФайл Из ТаблицаРезультат.ВложенныеФайлы Цикл
			Если ВложенныеФайлы.Найти(ВложенныйФайл.СсылкаДляСкачивания, "СсылкаДляСкачивания") = Неопределено Тогда
				НовСтр = ВложенныеФайлы.Добавить();
				НовСтр.ИмяФайла = ВложенныйФайл.ИмяФайла;
				НовСтр.СсылкаДляСкачивания = ВложенныйФайл.СсылкаДляСкачивания;
			КонецЕсли;
		КонецЦикла;	
		
		// Пишем объекты в БД
		
		Загрузка.Договор.Записать();
		Если ЗагруженныеОбъекты.НайтиСтроки(Новый Структура("ЗагруженныйОбъект", Загрузка.Договор.Ссылка)).Количество() = 0 Тогда
			НовСтр = ЗагруженныеОбъекты.Добавить();
			НовСтр.ЗагруженныйОбъект = Загрузка.Договор.Ссылка;
		КонецЕсли;	
			
		ТекущийДокумент = Загрузка.ТекущийДокумент;
		
		ТекущийДокумент.ЛицевойСчет = Загрузка.СведенияОбОрганизации.ЛицевойСчет;
		ТекущийДокумент.Организация = Загрузка.СведенияОбОрганизации.Организация;
		ТекущийДокумент.РеквизитыЛицевогоСчета = Загрузка.СведенияОбОрганизации.РеквизитыЛС;
		ТекущийДокумент.ОрганКазначейства = Загрузка.СведенияОбОрганизации.КассовыйОрган;
		ТекущийДокумент.Договор = Загрузка.Договор.Ссылка;
		ТаблицаРезультат.Свойство("НомерСведенийДО", ТекущийДокумент.НомерДокументаЕИС);
		ТаблицаРезультат.Свойство("ДатаДО", ТекущийДокумент.ДатаДокументаЕИС); 
		Если ТаблицаРезультат.Свойство("УчетныйНомерДО") И ЗначениеЗаполнено(ТаблицаРезультат.УчетныйНомерДО) Тогда
			ТекущийДокумент.УчетныйНомер = ТаблицаРезультат.УчетныйНомерДО;
		ИначеЕсли ТаблицаРезультат.Свойство("УчетныйНомерДОПУР") И ЗначениеЗаполнено(ТаблицаРезультат.УчетныйНомерДОПУР) Тогда
			ТекущийДокумент.УчетныйНомер = ТаблицаРезультат.УчетныйНомерДОПУР;
		КонецЕсли;
		ТекущийДокумент.Дата = ТекущийДокумент.ДатаДокументаЕИС;
		
		// Подтверждающий документ 
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭлектронныйДокументПоставщика.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЭлектронныйДокументПоставщика КАК ЭлектронныйДокументПоставщика
		|ГДЕ
		|	ЭлектронныйДокументПоставщика.Организация = &Организация
		|	И ЭлектронныйДокументПоставщика.Договор = &Договор
		|	И ЭлектронныйДокументПоставщика.НомерПервичногоДокумента = &НомерПервичногоДокумента
		|	И ГОД(ЭлектронныйДокументПоставщика.ДатаПервичногоДокумента) = ГОД(&ДатаПервичногоДокумента)
		|	И МЕСЯЦ(ЭлектронныйДокументПоставщика.ДатаПервичногоДокумента) = МЕСЯЦ(&ДатаПервичногоДокумента)
		|	И ДЕНЬ(ЭлектронныйДокументПоставщика.ДатаПервичногоДокумента) = ДЕНЬ(&ДатаПервичногоДокумента)");
		Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
		Запрос.УстановитьПараметр("Договор", ТекущийДокумент.Договор);
		
		НомерОснования = Неопределено;
		ТаблицаРезультат.Свойство("НомерОснования",НомерОснования);
		
		ДатаОснования = Неопределено;
		ТаблицаРезультат.Свойство("ДатаОснования",ДатаОснования);
		
		Запрос.УстановитьПараметр("НомерПервичногоДокумента", НомерОснования);
		Запрос.УстановитьПараметр("ДатаПервичногоДокумента", ДатаОснования);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекущийДокумент.ПодтверждающийДокумент = Выборка.Ссылка;
		КонецЕсли;
		
		// Заполняем таблицу Расшифровка обязательства документа
		ТабЧасть = ТекущийДокумент.РасшифровкаОбязательства;
		СтруктураПоиска = Новый Структура("КПС, КФО, ОбъектФАИП, КодЦели, Валюта, СрокИсполнения");
		// Ищем аналогичные строки в ТЧ и файле
		Для Каждого СтрФайл Из РасшифровкаИсходная Цикл 
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрФайл);
			НайденныеСтроки = ТабЧасть.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 1 Тогда
				//можно заполнить суммы изменений
				ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], СтрФайл, "Сумма, СуммаВВалюте, СуммаАванса");
			КонецЕсли;
		КонецЦикла;
		// Добавляем строки отсутствующие в ТЧ и присутствующие в файле
		Для Каждого СтрФайл Из РасшифровкаИсходная Цикл 
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрФайл);
			НайденныеСтроки = ТабЧасть.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 0 Тогда
				НовСтр = ТабЧасть.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, СтрФайл);
			КонецЕсли;
		КонецЦикла;
		// Обнуляем строки присутствующие в ТЧ и отсутствующие в файле
		Для Каждого СтрТч Из ТабЧасть Цикл 
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрТч);
			НайденныеСтроки = РасшифровкаИсходная.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ТабЧасть.Удалить(СтрТч);
			КонецЕсли;
		КонецЦикла;
			
		ТекущийДокумент.ДополнительныеСвойства.Вставить("ЭтоНовый", ТекущийДокумент.ЭтоНовый());					
		ТекущийДокумент.Записать();
		
		//Сведения о загрузке обязательства
		Если Загрузка.СведенияЗагруженные = Неопределено Тогда
			Запись = РегистрыСведений.СведенияОбОбязательствахЗагруженные.СоздатьМенеджерЗаписи();
		Иначе 
			Запись = Загрузка.СведенияЗагруженные;
		КонецЕсли;	
		Запись.ДокументРегистрации = ТекущийДокумент.Ссылка;
		Запись.Организация = Загрузка.СведенияОбОрганизации.Организация;
		Запись.УчетныйНомер = Загрузка.УчетныйНомерБО;
		
		НомерВерсииДОЕИС = "0";
		Если НЕ ТаблицаРезультат.Свойство("НомерВерсииДОЕИС",НомерВерсииДОЕИС) Тогда
			НомерВерсииДОЕИС = "0";
		КонецЕсли;
		
		Запись.НомерИзменения = Число(НомерВерсииДОЕИС);
		
		БизнесID = Неопределено;
		ТаблицаРезультат.Свойство("БизнесID",БизнесID);
		
		Запись.GUIDДокумента = БизнесID;
		
		БизнесIDРодительский = Неопределено;
		ТаблицаРезультат.Свойство("БизнесIDРодительский",БизнесIDРодительский);
		
		Запись.GUIDРодителя = БизнесIDРодительский;
		Запись.СтатусДокумента = ТаблицаРезультат.ТипФайла;
		Если СоответствияТипыДокументов[ТаблицаРезультат.ТипФайла] = Истина Тогда
			Запись.СтатусДокументаПодробно = Перечисления.ТипыДокументовСообщенийЕИС[ТаблицаРезультат.ТипФайла];
		Иначе
			Запись.СтатусДокументаПодробно = ПредопределенноеЗначение("Перечисление.ТипыДокументовСообщенийЕИС.ПустаяСсылка");
		КонецЕсли;
		Запись.ЗагруженныеДанные = Новый ХранилищеЗначения(ТаблицаРезультат);
		Запись.ДатаЗагрузки = ТекущаяДатаСеанса();
		Запись.Пользователь = Пользователи.ТекущийПользователь();
		Запись.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		
		Результат = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
				|
				|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОтменитьТранзакцию();
		
		ЗагруженныеОбъекты.Очистить();
	
	КонецПопытки;	

	Если Результат Тогда
		Если ЗагруженныеОбъекты.НайтиСтроки(Новый Структура("ЗагруженныйОбъект", ТекущийДокумент.Ссылка)).Количество() = 0 Тогда
			НовСтр = ЗагруженныеОбъекты.Добавить();
			НовСтр.ЗагруженныйОбъект = ТекущийДокумент.Ссылка;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры	

Функция КПСПоТекстовомуКодуКБК(СтрКБК, СтрТипКБК, ДатаЗначения, ИнформацияОбОшибке)
	
	КПС = Неопределено;
	ТипКБК = БиблиотекаФункцийОбмена.ПолучитьВидКБК(СтрТипКБК); 
	КБКСтрокой = Сред(СтрКБК, 4);
	
	КПС = Справочники.КлассификационныеПризнакиСчетов.НайтиКПС(КБКСтрокой, ТипКБК, НачалоГода(ДатаЗначения), ДатаЗначения);
	
	Если НЕ ЗначениеЗаполнено(КПС) Тогда
		СтруктураКодаБК = "";
		Если БюджетнаяКлассификация.НайтиКомпонентыКБК(КБКСтрокой, ТипКБК,, ДатаЗначения, СтруктураКодаБК) Тогда
			СтруктураКодаБКНов = Новый Структура(СтруктураКодаБК);
			СтруктураКодаБКНов.Вставить("ДатаНачалаДействия", НачалоГода(ДатаЗначения));
			СтруктураКодаБКНов.Вставить("ДатаОкончанияДействия", ДатаЗначения);
			СтруктураКодаБК = Новый ФиксированнаяСтруктура(СтруктураКодаБКНов);
			КПС = Справочники.КлассификационныеПризнакиСчетов.НайтиСоздатьКПСПоСтруктуреБК(СтруктураКодаБК, ТипКБК, Истина);
		Иначе
			ТекстОшибки = НСтр("ru='Не удалось найти элементы БК для создания КПС с кодом %1. КПС не заполнен.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,КБКСтрокой);
			ИнформацияОбОшибке = ИнформацияОбОшибке + "
			|
			|" + ТекстОшибки;
		КонецЕсли;
	КонецЕсли;

	Возврат КПС;
	
КонецФункции

Функция НайтиСоздатьКМИ(Организация, КодКМИ, НаименованиеКМИ, Создавать = Истина)
	
	КМИ = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МероприятияПоИнформатизации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.МероприятияПоИнформатизации КАК МероприятияПоИнформатизации
	|ГДЕ
	|	МероприятияПоИнформатизации.Владелец = &Владелец
	|	И МероприятияПоИнформатизации.Код = &Код");
	
	Запрос.УстановитьПараметр("Владелец", Организация);
	Запрос.УстановитьПараметр("Код", КодКМИ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КМИ = Выборка.Ссылка;
	ИначеЕсли Создавать Тогда
		КМИОбъект = Справочники.МероприятияПоИнформатизации.СоздатьЭлемент();
		КМИОбъект.Владелец 		= Организация;
		КМИОбъект.Код 			= КодКМИ;
		КМИОбъект.Наименование 	= НаименованиеКМИ;
		Если НЕ СтрЧислоВхождений(КодКМИ, ".") = 5 Тогда
			КМИОбъект.КодБезРазделительныхТочек = Истина;
		КонецЕсли;
		КМИОбъект.Записать();
		КМИ = КМИОбъект.Ссылка;
	КонецЕсли;
	
	Возврат КМИ;
	
КонецФункции	

Функция НайтиСоздатьФАИП(Организация, КодФАИП, НаименованиеФАИП, Создавать = Истина)
	
	ФАИП = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Организация = &Организация
	|	И ОсновныеСредства.КодФАИП = &КодФАИП");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КодФАИП", КодФАИП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ФАИП = Выборка.Ссылка;
	ИначеЕсли Создавать Тогда
		ФАИПОбъект = Справочники.ОсновныеСредства.СоздатьЭлемент();
		ФАИПОбъект.ВидНФА 				= ПредопределенноеЗначение("Перечисление.ВидыНФА.КапВложения");
		ФАИПОбъект.Организация 			= Организация;
		ФАИПОбъект.Наименование 		= НаименованиеФАИП;
		ФАИПОбъект.НаименованиеПолное 	= НаименованиеФАИП;
		ФАИПОбъект.КодФАИП 				= КодФАИП;
		ФАИПОбъект.Записать();
		ФАИП = ФАИПОбъект.Ссылка; 
	КонецЕсли;	
	
	Возврат ФАИП;
	
КонецФункции	

Функция НайтиСоздатьСчетКонтрагента(КонтрагентСсылка, Контрагент)
	
	СчетКонтрагента = Неопределено;
	
	НомерЛицевогоСчета = "";
	Контрагент.Свойство("НомерЛицевогоСчета",НомерЛицевогоСчета);
	
	НомерБанковскогоСчета = "";
	Контрагент.Свойство("НомерБанковскогоСчета",НомерБанковскогоСчета);
	
	БИКБанка = "";
	Контрагент.Свойство("БИКБанка",БИКБанка);
	
	КоррСчетБанка = "";
	Контрагент.Свойство("КоррСчетБанка",КоррСчетБанка);
	
	Если ЗначениеЗаполнено(НомерЛицевогоСчета) ИЛИ ЗначениеЗаполнено(НомерБанковскогоСчета) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеИКазначейскиеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеИКазначейскиеСчета КАК БанковскиеИКазначейскиеСчета
		|ГДЕ
		|	БанковскиеИКазначейскиеСчета.Владелец = &Владелец
		|	И БанковскиеИКазначейскиеСчета.Код = &Код");
		Запрос.УстановитьПараметр("Владелец", КонтрагентСсылка);
		Запрос.УстановитьПараметр("Код", ?(ЗначениеЗаполнено(НомерЛицевогоСчета), НомерЛицевогоСчета, НомерБанковскогоСчета));
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СчетКонтрагента = Выборка.Ссылка; 
		Иначе //не нашли
			ЭтоКазначейскийСчет = ЗначениеЗаполнено(НомерЛицевогоСчета);
			СчетКонтрагентаОбъект = Справочники.БанковскиеИКазначейскиеСчета.СоздатьЭлемент();
			СчетКонтрагентаОбъект.Владелец = КонтрагентСсылка;
			СчетКонтрагентаОбъект.ТипЛицевогоСчета = ?(ЭтоКазначейскийСчет, ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Казначейский"),
			                                                                ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский"));
			СчетКонтрагентаОбъект.Код = ?(ЭтоКазначейскийСчет, НомерЛицевогоСчета, НомерБанковскогоСчета);
			
			Если ЭтоКазначейскийСчет Тогда
				//Реквизитов казначейства у нас нет, можем только поискать по банковскому счету
				Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	БанковскиеИКазначейскиеСчета.Владелец КАК Владелец,
				|	БанковскиеИКазначейскиеСчета.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.БанковскиеИКазначейскиеСчета КАК БанковскиеИКазначейскиеСчета
				|ГДЕ
				|	БанковскиеИКазначейскиеСчета.Владелец ССЫЛКА Справочник.Казначейства
				|	И БанковскиеИКазначейскиеСчета.Код = &Код");
				
				Запрос.УстановитьПараметр("Код", НомерБанковскогоСчета);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					СчетКонтрагентаОбъект.КассовыйОрган = Выборка.Владелец;
					СчетКонтрагентаОбъект.СчетКазначейства = Выборка.Ссылка;
				КонецЕсли;
			Иначе //банковский счет
				БанкСсылка = Неопределено;
				//Поищем по БИК
				Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Банки.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Банки КАК Банки
				|ГДЕ
				|	Банки.Код = &Код");
				Запрос.УстановитьПараметр("Код", БИКБанка);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					БанкСсылка = Выборка.Ссылка;
				Иначе
					ЗаписьОБанке = "";
					РаботаСБанками.ПолучитьДанныеКлассификатора(БИКБанка, КоррСчетБанка, ЗаписьОБанке);
					Если ТипЗнч(ЗаписьОБанке) = Тип("СправочникСсылка.КлассификаторБанков") Тогда
						//Нашли в классификаторе
						НовыеБанки = РаботаСБанкамиБГУ.ПодобратьБанкИзКлассификатора(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗаписьОБанке));
						Для Каждого НовыйБанк Из НовыеБанки Цикл
							Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйБанк, "ЭтоГруппа") Тогда
								БанкСсылка = НовыйБанк;
								Прервать;
							КонецЕсли;
						КонецЦикла;	
					КонецЕсли;
				КонецЕсли;
	            СчетКонтрагентаОбъект.КассовыйОрган = БанкСсылка;
			КонецЕсли;	
			
			СтрокаНаименования	= "";
			Если ЗначениеЗаполнено(СчетКонтрагентаОбъект.КассовыйОрган) Тогда
				СтрокаНаименования	= Строка(СчетКонтрагентаОбъект.КассовыйОрган);
			КонецЕсли;
			
			Если ЭтоКазначейскийСчет И НЕ СчетКонтрагентаОбъект.СчетКазначейства.Пустая() Тогда
				СтрокаНаименования	= СтрокаНаименования + ", " + СчетКонтрагентаОбъект.СчетКазначейства.Код;
			КонецЕсли;

			СчетКонтрагентаОбъект.Наименование = ?(СтрокаНаименования = "",СчетКонтрагентаОбъект.Код, СтрокаНаименования);
			СчетКонтрагентаОбъект.Записать();
			СчетКонтрагента = СчетКонтрагентаОбъект.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СчетКонтрагента; 

КонецФункции

Функция СведенияОбОрганизации(КодПоРПБС, НомерЛС, ТОФК)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ЛицевыеСчета.Ссылка, НЕОПРЕДЕЛЕНО) КАК ЛицевойСчет,
	|	ЕСТЬNULL(РеквизитыЛицевыхСчетов.Ссылка, НЕОПРЕДЕЛЕНО) КАК РеквизитыЛС,
	|	ЕСТЬNULL(РеквизитыЛицевыхСчетов.КассовыйОрган, НЕОПРЕДЕЛЕНО) КАК КассовыйОрган,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|		ПО Организации.Ссылка = ЛицевыеСчета.Владелец
	|			И (ЛицевыеСчета.Код = &НомерЛС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	|		ПО (ЛицевыеСчета.Ссылка = РеквизитыЛицевыхСчетов.Владелец)
	|			И (РеквизитыЛицевыхСчетов.КассовыйОрган.Код = &КодТОФК)
	|ГДЕ
	|	Организации.КодПоРПБС = &КодПоРПБС
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организации.УчетПереданныхПолномочий");
	
	Запрос.УстановитьПараметр("КодПоРПБС", КодПоРПБС);
	Запрос.УстановитьПараметр("НомерЛС", НомерЛС);
	Запрос.УстановитьПараметр("КодТОФК", ТОФК);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура;
		Результат.Вставить("Организация", Выборка.Ссылка);
		Результат.Вставить("ЛицевойСчет", Выборка.ЛицевойСчет);
		Результат.Вставить("РеквизитыЛС", Выборка.РеквизитыЛС); 
		Результат.Вставить("КассовыйОрган", Выборка.КассовыйОрган);
		Результат.Вставить("ИНН", Выборка.ИНН); 
		Результат.Вставить("КПП", Выборка.КПП);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ДоговорПоНомеруБОРНКП(УчетныйНомерБО = Неопределено, НомерРеестровойЗаписи = Неопределено)
	НайденныйДоговор = Неопределено;
	Если ЗначениеЗаполнено(УчетныйНомерБО) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеНомераОбязательств.Обязательство КАК Обязательство
		|ИЗ
		|	РегистрСведений.УчетныеНомераОбязательств КАК УчетныеНомераОбязательств
		|ГДЕ
		|	УчетныеНомераОбязательств.УчетныйНомерОбязательства = &УчетныйНомерОбязательства");
		Запрос.УстановитьПараметр("УчетныйНомерОбязательства", УчетныйНомерБО);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НайденныйДоговор = Выборка.Обязательство;
		КонецЕсли;	
	ИначеЕсли ЗначениеЗаполнено(НомерРеестровойЗаписи) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ГосударственныеКонтрактыЕИС.ВладелецКонтракта КАК ВладелецКонтракта
		|ИЗ
		|	Справочник.ГосударственныеКонтрактыЕИС КАК ГосударственныеКонтрактыЕИС
		|ГДЕ
		|	ГосударственныеКонтрактыЕИС.Код = &Код
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХарактеристикиОбязательствСрезПоследних.Договор
		|ИЗ
		|	РегистрСведений.ХарактеристикиОбязательств.СрезПоследних КАК ХарактеристикиОбязательствСрезПоследних
		|ГДЕ
		|	ХарактеристикиОбязательствСрезПоследних.ВидХарактеристики = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыХарактеристикОбязательства.НомерРеестровойЗаписи)
		|	И ХарактеристикиОбязательствСрезПоследних.ЗначениеХарактеристики = &Код
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХарактеристикиОбязательствСрезПоследних.Договор
		|ИЗ
		|	РегистрСведений.ХарактеристикиОбязательств.СрезПоследних КАК ХарактеристикиОбязательствСрезПоследних
		|ГДЕ
		|	ХарактеристикиОбязательствСрезПоследних.ВидХарактеристики = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыХарактеристикОбязательства.НомерРеестровойЗаписиВРеестреКонтрактов)
		|	И ХарактеристикиОбязательствСрезПоследних.ЗначениеХарактеристики = &Код");
		Запрос.УстановитьПараметр("Код", СтроковыеФункцииКлиентСервер.ДополнитьСтроку(НомерРеестровойЗаписи, 19, " ", "Справа"));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НайденныйДоговор = Выборка.ВладелецКонтракта;
		КонецЕсли;	
	КонецЕсли;	
	Возврат НайденныйДоговор;
КонецФункции	

Функция КодЦелиТекстовомуКоду(КодЦели)
	НайденныйКодЦели = Неопределено;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦелевыхСредств.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыЦелевыхСредств КАК ВидыЦелевыхСредств
	|ГДЕ
	|	ВидыЦелевыхСредств.Код = &Код");
	Запрос.УстановитьПараметр("Код", СтроковыеФункцииКлиентСервер.ДополнитьСтроку(КодЦели, 25, " ", "Справа"));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НайденныйКодЦели = Выборка.Ссылка;
	КонецЕсли;	
	Возврат НайденныйКодЦели;
КонецФункции	

Функция ВалютаПоТекстовомуКоду(КодВалюты)
	НайденнаяВалюта = Неопределено;
	Если НЕ ЗначениеЗаполнено(КодВалюты) Или КодВалюты = "643" Тогда
		НайденнаяВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Валюты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.Код = &Код");
		Запрос.УстановитьПараметр("Код", КодВалюты);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НайденнаяВалюта = Выборка.Ссылка;	
		КонецЕсли;
	КонецЕсли;
	Возврат НайденнаяВалюта;
КонецФункции

Процедура ПолучитьКФОИсточникСредств(СтрТЧ, ЛицевойСчет, КодВидаСредств) 
	
	СтрТЧ.Вставить("ИсточникСредств", ПредопределенноеЗначение("Справочник.ИсточникиСредств.ПустаяСсылка")); 
	СтрТЧ.Вставить("КФО", ПредопределенноеЗначение("Перечисление.КВД.ПустаяСсылка"));

	КодДляПоиска = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(КодВидаСредств, 2, "0", "Слева"); 
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазделыЛицевыхСчетов.ИсточникСредств КАК ИсточникСредств,
	|	РазделыЛицевыхСчетов.ДопустимыеКФО.(
	|		КФО КАК КФО
	|	) КАК ДопустимыеКФО
	|ИЗ
	|	Справочник.РазделыЛицевыхСчетов КАК РазделыЛицевыхСчетов
	|ГДЕ
	|	РазделыЛицевыхСчетов.Владелец = &Владелец
	|	И РазделыЛицевыхСчетов.ИсточникСредств.Код = &Код"); 
	
	Запрос.УстановитьПараметр("Владелец", ЛицевойСчет);
	Запрос.УстановитьПараметр("Код", КодДляПоиска); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтрТЧ.Вставить("ИсточникСредств", Выборка.ИсточникСредств);
		ТабКФО = Выборка.ДопустимыеКФО.Выбрать();
		Если ТабКФО.Количество() = 1 Тогда
			ТабКФО.Следующий();
			СтрТЧ.Вставить("КФО", ТабКФО.КФО);
		КонецЕсли;	
	КонецЕсли;	

КонецПроцедуры

// Читает только заголовок, извлекая лишь комментарий, имена объектов (справочников, записей И тп), 
//  а также количество объектов Каждого объекта
//
// Возвращает Истина, если структура заголовка соответствует
//
Функция ПолучитьСвойстваФайлаЗагрузки(Знач ИмяФайла) Экспорт
	
	Попытка
			
		Если ЭтоАдресВременногоХранилища(ИмяФайла) Тогда
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("defx");
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ИмяФайла);
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			РабИмяФайла = ИмяВременногоФайла;
			
		Иначе
			
			РабИмяФайла = ИмяФайла;
			
		КонецЕсли;
		
		//**********************************		
				
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ЗагрузитьФайл(Знач ИмяФайла, ИнформацияОбОшибке = "") Экспорт

	ДанныеЗагрузки = Неопределено;
	ТипФайла = "";
	ТипДанных = "";
		
	Если ЭтоАдресВременногоХранилища(ИмяФайла) Тогда
		ДвоичныеДанные     = ПолучитьИзВременногоХранилища(ИмяФайла);
		ЗагружаемыйОбъект  = ДвоичныеДанные.ОткрытьПотокДляЧтения();
	Иначе
		ЗагружаемыйОбъект = ИмяФайла;
	КонецЕсли;
	
	ОбработкаОбменов = Обработки.ОбменВФорматахУФК_УФЭБС.Создать();
	
	ТекстовыйФайл    = Новый ЧтениеТекста(ЗагружаемыйОбъект, ОбработкаОбменов.ПреобразованиеПредставлениеКодировки(ВидОбмена.КодировкаТекстаФайла));
	ТекстФайла       = ТекстовыйФайл.Прочитать();
	ТекстовыйФайл.Закрыть();
		
	ДанныеЗагрузки = ЗагрузитьДанныеИзТекста(ТекстФайла, ТипДанных, ТипФайла, ИнформацияОбОшибке);
	
	Возврат ДанныеЗагрузки;
	
КонецФункции // ЗагрузитьФайл()

Функция ЗагрузитьДанныеИзТекста(ТекстФайла, ТипДанных, ТипФайла, ИнформацияОбОшибке) Экспорт
	
	Формат = ОпределитьПодходящийФормат(ТекстФайла, ТипДанных, ТипФайла, ИнформацияОбОшибке);
	
	Если НЕ ЗначениеЗаполнено(Формат) Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	ОбработкаОбменов = Обработки.ОбменВФорматахУФК_УФЭБС.Создать();
	ТабилцаДанных = ОбработкаОбменов.ЗагрузитьИзФайлаXML3(ТекстФайла,Формат,Документы.ЗаданиеНаИмпортДанныхБанкиКС.ПустаяСсылка());

	// Для всех типов данных
	ДанныеЗагрузки = Новый Структура;
	ДанныеЗагрузки.Вставить("ВложенныеФайлы", Новый ТаблицаЗначений);
	КолонкиТаблицыФайлов = ДанныеЗагрузки.ВложенныеФайлы.Колонки;
	КолонкиТаблицыФайлов.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
	КолонкиТаблицыФайлов.Добавить("СсылкаДляСкачивания", Новый ОписаниеТипов("Строка"));
	КолонкиТаблицыФайлов.Добавить("КонтентID", Новый ОписаниеТипов("Строка"));

	Если ТипДанных = "UISPBO" Тогда
		// Для принятых обязательств
		ДанныеЗагрузки.Вставить("РеквизитыКонтрагента", Новый Массив);
		
		ДанныеЗагрузки.Вставить("РасшифровкаОбязательства", Новый ТаблицаЗначений);
		КолонкиРасшифровки = ДанныеЗагрузки.РасшифровкаОбязательства.Колонки;
		КолонкиРасшифровки.Добавить("КодФАИП", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("НаименованиеФАИП", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ВидСредств", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("КБК", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ТипКБК", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("АналитическийКод", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ПериодПланаМесяц", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ПериодПланаГод", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
		КолонкиРасшифровки.Добавить("СуммаБезусловная", Новый ОписаниеТипов("Число"));
	ИначеЕсли ТипДанных = "UISPZR" Тогда
		// Для ЗКР
		ДанныеЗагрузки.Вставить("РасшифровкаЗаявки", Новый ТаблицаЗначений);
		КолонкиРасшифровки = ДанныеЗагрузки.РасшифровкаЗаявки.Колонки;
		КолонкиРасшифровки.Добавить("НомерСтроки", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("КодВидаСредств", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("НаименованиеВидаСредств", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("КБК", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("КодЦели", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ТипКБК", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("КБКПолучателя", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("КодЦелиПолучателя", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ТипКБКПолучателя", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("СуммаВВалюте", Новый ОписаниеТипов("Число"));
		КолонкиРасшифровки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
		КолонкиРасшифровки.Добавить("НазначениеПлатежа", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("Примечание", Новый ОписаниеТипов("Строка"));
		
		ДанныеЗагрузки.Вставить("ДокументыОснования", Новый ТаблицаЗначений);
		КолонкиРасшифровки = ДанныеЗагрузки.ДокументыОснования.Колонки;
		КолонкиРасшифровки.Добавить("ВидДокументаОснования", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("НомерДокументаОснования", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ДатаДокументаОснования", Новый ОписаниеТипов("Дата"));
		КолонкиРасшифровки.Добавить("ПредметДокументаОснования", Новый ОписаниеТипов("Строка"));
	ИначеЕсли ТипДанных = "UISPMO" Тогда
		// Для денежных обязательств
		ДанныеЗагрузки.Вставить("РасшифровкаОбязательства", Новый ТаблицаЗначений);
		КолонкиРасшифровки = ДанныеЗагрузки.РасшифровкаОбязательства.Колонки;
		КолонкиРасшифровки.Добавить("НомерСтроки", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ВидСредств", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ПланируемыйСрокИсполнения", Новый ОписаниеТипов("Дата"));
		КолонкиРасшифровки.Добавить("КБК", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ТипКБК", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("КодФАИП", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("КодЦели", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("СуммаДОВВалютеОбязательства", Новый ОписаниеТипов("Число"));
		КолонкиРасшифровки.Добавить("КодВалюты", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("СуммаДОВРублях", Новый ОписаниеТипов("Число"));
		КолонкиРасшифровки.Добавить("СуммаАванса", Новый ОписаниеТипов("Число"));
		
		ДанныеЗагрузки.Вставить("РасшифровкаСведенийТРУ", Новый ТаблицаЗначений);
		КолонкиРасшифровки = ДанныеЗагрузки.РасшифровкаСведенийТРУ.Колонки;
		КолонкиРасшифровки.Добавить("ИдентификаторТРУвГК", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("НаименованиеТРУ", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ТипОбъектаЗакупки", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ЭтоОС", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("СпособУказанияОбъема", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("КодОКЕИ", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("ОбозначениеЕИ", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("Цена", Новый ОписаниеТипов("Число"));
		КолонкиРасшифровки.Добавить("ЦенаБезНДС", Новый ОписаниеТипов("Число"));
		КолонкиРасшифровки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		КолонкиРасшифровки.Добавить("Объем", Новый ОписаниеТипов("Строка"));
		КолонкиРасшифровки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
		КолонкиРасшифровки.Добавить("СуммаБезНДС", Новый ОписаниеТипов("Число"));
		КолонкиРасшифровки.Добавить("СтавкаНДС", Новый ОписаниеТипов("Число"));
		КолонкиРасшифровки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число"));
	КонецЕсли;
	
	Для Каждого СтрТЧ Из ТабилцаДанных Цикл
		
		Если ЗначениеЗаполнено(СтрТЧ.СлужебноеПоле_ТабличнаяЧасть) Тогда
			
			Если ВРЕГ(СтрТЧ.СлужебноеПоле_ТабличнаяЧасть) = "СЛУЖЕБНЫЕПОЛЯ" Тогда
				Для Каждого ТекКолонка Из ТабилцаДанных.Колонки Цикл
					Если СтрНачинаетсяС(ТекКолонка.Имя,"СлужебноеПоле_") Тогда
						Продолжить;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(СтрТЧ[ТекКолонка.Имя]) Тогда
						Продолжить;
					КонецЕсли;
					ИмяДляДанных = ТекКолонка.Имя;
					Если СтрНачинаетсяС(ИмяДляДанных,"Структура_") Тогда
						ИмяДляДанных = Сред(ИмяДляДанных,11);
					КонецЕсли;
					ДанныеЗагрузки.Вставить(ИмяДляДанных,СтрТЧ[ТекКолонка.Имя]);
				КонецЦикла;
				
			ИначеЕсли ВРЕГ(СтрТЧ.СлужебноеПоле_ТабличнаяЧасть) = "РЕКВИЗИТЫКОНТРАГЕНТА"
				И ТипДанных = "UISPBO" Тогда
				
				ДанныеКонтрагента = Новый Структура();
				Для Каждого ТекКолонка Из ТабилцаДанных.Колонки Цикл
					Если СтрНачинаетсяС(ТекКолонка.Имя,"СлужебноеПоле_") Тогда
						Продолжить;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(СтрТЧ[ТекКолонка.Имя]) Тогда
						Продолжить;
					КонецЕсли;
					Если СтрНачинаетсяС(ИмяДляДанных,"Структура_") Тогда
						Продолжить;
					КонецЕсли;
					ИмяДляДанных = ТекКолонка.Имя;
					Если СтрНачинаетсяС(ИмяДляДанных,"Структура_") Тогда
						ИмяДляДанных = Сред(ИмяДляДанных,11);
					КонецЕсли;
					ДанныеКонтрагента.Вставить(ИмяДляДанных,СтрТЧ[ТекКолонка.Имя]);
				КонецЦикла;
				ДанныеЗагрузки.РеквизитыКонтрагента.Добавить(ДанныеКонтрагента);											
				
			ИначеЕсли ВРЕГ(СтрТЧ.СлужебноеПоле_ТабличнаяЧасть) = "РАСШИФРОВКАОБЯЗАТЕЛЬСТВА"
				И ТипДанных = "UISPBO" Тогда
				
				ДанныеРасшифровки = Новый Структура;
				
				Для Каждого ТекКолонка Из ТабилцаДанных.Колонки Цикл
					Если СтрНачинаетсяС(ТекКолонка.Имя,"СлужебноеПоле_") Тогда
						Продолжить;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(СтрТЧ[ТекКолонка.Имя]) Тогда
						Продолжить;
					КонецЕсли;
					Если СтрНачинаетсяС(ИмяДляДанных,"Структура_") Тогда
						Продолжить;
					КонецЕсли;
					ИмяДляДанных = ТекКолонка.Имя;
					Если СтрНачинаетсяС(ИмяДляДанных,"Структура_") Тогда
						ИмяДляДанных = Сред(ИмяДляДанных,11);
					КонецЕсли;
					ДанныеРасшифровки.Вставить(ИмяДляДанных,СтрТЧ[ТекКолонка.Имя]);
				КонецЦикла;
				
				ДобавитьСтрокуВтаблицу(ДанныеРасшифровки, ДанныеЗагрузки.РасшифровкаОбязательства, ДанныеЗагрузки.ДатаБО); 
					
			ИначеЕсли ДанныеЗагрузки.Свойство(СтрТЧ.СлужебноеПоле_ТабличнаяЧасть) Тогда
				
				ЗаполнитьЗначенияСвойств(ДанныеЗагрузки[СтрТЧ.СлужебноеПоле_ТабличнаяЧасть].Добавить(),СтрТЧ);
				
			КонецЕсли;
		Иначе
			Для Каждого ТекКолонка Из ТабилцаДанных.Колонки Цикл
				Если СтрНачинаетсяС(ТекКолонка.Имя,"СлужебноеПоле_") Тогда
					Продолжить;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрТЧ[ТекКолонка.Имя]) Тогда
					Продолжить;
				КонецЕсли;
				ИмяДляДанных = ТекКолонка.Имя;
				Если СтрНачинаетсяС(ИмяДляДанных,"Структура_") Тогда
					ИмяДляДанных = Сред(ИмяДляДанных,11);
				КонецЕсли;
				
				ДанныеЗагрузки.Вставить(ИмяДляДанных,СтрТЧ[ТекКолонка.Имя]);
			КонецЦикла;
		КонецЕсли;
				
	КонецЦикла;
		
	Если ТипДанных = "UISPBO" Тогда
		ДанныеЗагрузки.РасшифровкаОбязательства.Свернуть("КодФАИП, НаименованиеФАИП, ВидСредств, КБК, ТипКБК, АналитическийКод, ПериодПланаМесяц, ПериодПланаГод", "Сумма, СуммаБезусловная");						
	КонецЕсли;
	
	ДанныеЗагрузки.Вставить("ТипФайла", ТипФайла);
	ДанныеЗагрузки.Вставить("ТипДанных", ТипДанных);
			
	Возврат ДанныеЗагрузки;
	
КонецФункции

Функция ОпределитьПодходящийФормат(Стр, ТипДанных, ТипФайла, СообщениеОбОшибке)
	
	ПрефиксНомераВерсии = "";
	
	Если Найти(Стр, "self:MSC_ApplCashFlow") > 0 Тогда
		ТипДанных = "UISPZR";
		Если СтрНайти(Стр, "zkrDeniedRegistration") > 0 Тогда 
			ТипФайла = "zkrDeniedRegistration";
			Стр = СтрЗаменить(Стр, "zkrDeniedRegistration", "zkrProject");
		ИначеЕсли СтрНайти(Стр, "zkrExecuted") > 0 Тогда 
			ТипФайла = "zkrExecuted";
			Стр = СтрЗаменить(Стр, "zkrExecuted", "zkrProject");
		ИначеЕсли СтрНайти(Стр, "zkrCanceled") > 0 Тогда 
			ТипФайла = "zkrCanceled";
			Стр = СтрЗаменить(Стр, "zkrCanceled", "zkrProject");
	    ИначеЕсли СтрНайти(Стр, "zkrRegistred") > 0 Тогда 
			ТипФайла = "zkrRegistred";
			Стр = СтрЗаменить(Стр, "zkrRegistred", "zkrProject");
		ИначеЕсли СтрНайти(Стр, "zkrSentForVerification") > 0 Тогда 
			ТипФайла = "zkrSentForVerification";
			Стр = СтрЗаменить(Стр, "zkrSentForVerification", "zkrProject");	
		ИначеЕсли СтрНайти(Стр, "zkrProject") > 0 Тогда 
			ТипФайла = "zkrProject";
		КонецЕсли;
	ИначеЕсли Найти(Стр, "bo:InfrmtnBdgtOblgtns") > 0 Тогда
		ТипДанных = "UISPBO";
		Если СтрНайти(Стр, "boRegistred") > 0 Тогда 
			ТипФайла = "boRegistred";
			Стр = СтрЗаменить(Стр, "boRegistred", "boNotificationPublish");
		ИначеЕсли СтрНайти(Стр, "boProject") > 0 Тогда 
			ТипФайла = "boProject";
			Стр = СтрЗаменить(Стр, "boProject", "boNotificationPublish");
		ИначеЕсли СтрНайти(Стр, "boDeniedRegistration") > 0 Тогда 
			ТипФайла = "boDeniedRegistration";
			Стр = СтрЗаменить(Стр, "boDeniedRegistration", "boNotificationPublish");
	    ИначеЕсли СтрНайти(Стр, "boSentForVerification") > 0 Тогда 
			ТипФайла = "boSentForVerification";
			Стр = СтрЗаменить(Стр, "boSentForVerification", "boNotificationPublish");
		ИначеЕсли СтрНайти(Стр, "boNotificationPublish") > 0 Тогда 
			ТипФайла = "boNotificationPublish";
		КонецЕсли;
	ИначеЕсли Найти(Стр, "self:EXP_SDO") > 0 Тогда	
	    ТипДанных = "UISPMO";
		Если СтрНайти(Стр, "moRegistred") > 0 Тогда 
			ТипФайла = "moRegistred";
		ИначеЕсли СтрНайти(Стр, "moSentForVerification") > 0 Тогда 
			ТипФайла = "moSentForVerification";
			Стр = СтрЗаменить(Стр, "moSentForVerification", "moRegistred");
		ИначеЕсли СтрНайти(Стр, "moDeniedRegistration") > 0 Тогда 
			ТипФайла = "moDeniedRegistration";
			Стр = СтрЗаменить(Стр, "moDeniedRegistration", "moRegistred");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипДанных) ИЛИ НЕ ЗначениеЗаполнено(ТипФайла)Тогда
		СообщениеОбОшибке = НСтр("ru = 'Неизвестный тип данных.'");
		Возврат Неопределено;
	КонецЕсли;	
		
	ПозВерсии   = Найти(Стр, "versionID=");

	Если ПозВерсии > 0 Тогда
		НомерВерсии = ТипДанных + "_" + Сред(Стр, ПозВерсии + 11, 3);
	Иначе
		СообщениеОбОшибке = НСтр("ru = 'В файле отсутсвует информация о версии обмена: атрибут versionID элемента formular.'");
		Возврат Неопределено;
	КонецЕсли;	
		
	Формат = БиблиотекаФункцийОбмена.ВернутьФорматПоМаркеру(НомерВерсии,  ВидОбмена, Перечисления.НаправлениеОбменаБанкиКС.Импорт);
	Если НЕ ЗначениеЗаполнено(Формат) Тогда
		СообщениеОбОшибке = НСтр("ru = 'Для импорта информации в системе отсутствует необходимый формат '") + НомерВерсии +  НСтр("ru = '.'");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Формат;
	
КонецФункции
	
Процедура ДобавитьСтрокуВтаблицу(СтрРасшифровки, ТабРасшифровка, ДатаБО) 
	
	Если СтрРасшифровки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПризнакБезусловногоПлатежа = "";
	СтрРасшифровки.Свойство("ПризнакБезусловногоПлатежа", ПризнакБезусловногоПлатежа);
	
	КодФАИП = "";
	СтрРасшифровки.Свойство("КодФАИП",КодФАИП);
	
	НаименованиеФАИП = "";
	СтрРасшифровки.Свойство("НаименованиеФАИП",НаименованиеФАИП);
	
	ВидСредств = "";
	СтрРасшифровки.Свойство("ВидСредств",ВидСредств);
	
	КБК = "";
	СтрРасшифровки.Свойство("КБК",КБК);
	
	ТипКБК = "";
	СтрРасшифровки.Свойство("ТипКБК",ТипКБК);
	
	АналитическийКод = "";
	СтрРасшифровки.Свойство("АналитическийКод",АналитическийКод);	
	
	Для Каждого КлючЗначение Из СтрРасшифровки Цикл
		
		Если Лев(Нрег(КлючЗначение.Ключ), 7) = "суммабо" И  
			НЕ Сред(Нрег(КлючЗначение.Ключ), 9) = "текущийгод" И
			ЗначениеЗаполнено(Число(КлючЗначение.Значение)) Тогда
			
			НовСтр = ТабРасшифровка.Добавить();
			
			Если ПризнакБезусловногоПлатежа = "0" Тогда
				НовСтр.СуммаБезусловная = Число(КлючЗначение.Значение);
			КонецЕсли;
			
			НовСтр.Сумма = Число(КлючЗначение.Значение);
			
			НомерМесяца = НомерМесяцаСтрокой(Сред(Нрег(КлючЗначение.Ключ), 9));
			Если НомерМесяца = "00" Тогда
				ГодПлана = ГодПланаСтрокой(ДатаБО, Сред(Нрег(КлючЗначение.Ключ), 9));
			Иначе
				ГодПлана = Формат(ДатаБО, "ДФ=гггг");
			КонецЕсли;	
			
			НовСтр.ПериодПланаМесяц = НомерМесяца;
			НовСтр.ПериодПланаГод = ГодПлана;
			НовСтр.КодФАИП = КодФАИП;
			НовСтр.НаименованиеФАИП = НаименованиеФАИП;
			НовСтр.ВидСредств = ВидСредств;
			НовСтр.КБК = КБК;
			НовСтр.ТипКБК = ТипКБК;
			НовСтр.АналитическийКод = АналитическийКод;
			
		КонецЕсли;	
			
	КонецЦикла;	
	
КонецПроцедуры

Функция ГодПланаСтрокой(ДатаБО, ИмяПериода)
	
	Если НРег(ИмяПериода) = НРег("1год") Тогда
		Модификатор = 1;
	ИначеЕсли НРег(ИмяПериода) = НРег("2год") Тогда
		Модификатор = 2;
	ИначеЕсли НРег(ИмяПериода) = НРег("3год") Тогда
		Модификатор = 3;
	ИначеЕсли НРег(ИмяПериода) = НРег("следующиеГода") Тогда
		Модификатор = 4;
	Иначе
		Модификатор = 0;
	КонецЕсли;
	
	НоваяДата = ДобавитьМесяц(ДатаБО, Модификатор*12);

	Возврат Формат(НоваяДата, "ДФ=гггг");
	
КонецФункции	

Функция НомерМесяцаСтрокой(НаименованиеМесяца)
	
	СоответствиеМесяцев = Новый Соответствие;
	СоответствиеМесяцев.Вставить("ЯНВАРЬ", 	"01");
	СоответствиеМесяцев.Вставить("ФЕВРАЛЬ", "02");
	СоответствиеМесяцев.Вставить("МАРТ", 	"03");
	СоответствиеМесяцев.Вставить("АПРЕЛЬ", 	"04");
	СоответствиеМесяцев.Вставить("МАЙ", 	"05");
	СоответствиеМесяцев.Вставить("ИЮНЬ", 	"06");
	СоответствиеМесяцев.Вставить("ИЮЛЬ", 	"07");
	СоответствиеМесяцев.Вставить("АВГУСТ", 	"08");
	СоответствиеМесяцев.Вставить("СЕНТЯБРЬ", "09");
	СоответствиеМесяцев.Вставить("ОКТЯБРЬ", "10");
	СоответствиеМесяцев.Вставить("НОЯБРЬ", 	"11");
	СоответствиеМесяцев.Вставить("ДЕКАБРЬ", "12");
	
	Результат = СоответствиеМесяцев.Получить(ВРег(НаименованиеМесяца));
	
	Возврат ?(Результат = Неопределено, "00", Результат);
	
КонецФункции	

#КонецОбласти

#Область Инициализация

СоответствияТипыДокументов = Новый Соответствие;
Для Каждого ТекЗначение Из Метаданные.Перечисления.ТипыДокументовСообщенийЕИС.ЗначенияПеречисления Цикл
	СоответствияТипыДокументов.Вставить(ТекЗначение.Имя, Истина);	
КонецЦикла;

#КонецОбласти

#КонецЕсли
