////////////////////////////////////////////////////////////////////////////////
// БУХГАЛТЕРСКИЙ УЧЕТ, КЛИЕНТСЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ                    //
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ДатаНачалаДействияПриказа209н() Экспорт
	Возврат Дата('20190101');
КонецФункции

Функция ДатаНачалаДействияПриказа117н() Экспорт
	Возврат '20260101';
КонецФункции

// Признак применения Приказа Минфина России № 209н.
// 
// Параметры:
//  НаДату - Дата - На дату
//  Организация - СправочникСсылка, СправочникСсылка.Организации - Организация
// 
// Возвращаемое значение:
//  Булево - Применяется приказ 209н
Функция ПрименяетсяПриказ209н(НаДату, Организация) Экспорт
	
	Если НаДату < ДатаНачалаДействияПриказа209н() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат НаДату >= БухгалтерскийУчетВызовСервераПовтИсп.ДатаПереходаНаРедакциюПС(Организация, НачалоГода(НаДату));
	
КонецФункции

// Признак применения Приказа Минфина России от 29.08.2025 № 117н.
// 
// Параметры:
//  НаДату - Дата
// 
// Возвращаемое значение:
//  Булево - Применяется приказ 117н
Функция ПрименяетсяПриказ117н(НаДату) Экспорт
	
	// Дата начала действия приказа 117н - '20260101'
	Возврат НаДату >= ДатаНачалаДействияПриказа117н();
	
КонецФункции

// Признак применения детального КЭК 34х (44х). В течение срока действия приказа 209н применяется детальный КЭК.
// После 01.01.2026 применяются груповые КЭК.
// 
// Параметры:
//  НаДату - Дата
//  Организация - СправочникСсылка.Организации
// 
// Возвращаемое значение:
//  Булево - Применяется детальный КЭК34х
Функция ПрименяетсяДетальныйКЭК340и440(НаДату, Организация) Экспорт
	Если ПрименяетсяПриказ117н(НаДату) Тогда
		Возврат Ложь;
	Иначе
		Возврат ПрименяетсяПриказ209н(НаДату, Организация);
	КонецЕсли;
КонецФункции

// Возвращает структуру для использования в функции КЭКПроводки
// 
// Возвращаемое значение:
// Структура - структура с ключами для заполнения:
//  * Организация - СправочникСсылка.Организации
//  * ИФО - СправочникСсылка.ИсточникиФинансовогоОбеспечения
//  * КФО - ПеречислениеСсылка.КВД
//  * Дата - Дата
//  * Счет - ПланСчетовСсылка.ЕПСБУ
//  * Субконто1 - Характеристика.ВидыСубконто
//  * Субконто2 - Характеристика.ВидыСубконто
//  * Субконто3 - Характеристика.ВидыСубконто
//  * ДтКт - Строка
//  * КЭКОперации - СправочникСсылка.КОСГУ
//
Функция ПараметрыРасчетаКЭКПроводки() Экспорт
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация");
	ПараметрыРасчета.Вставить("ИФО");
	ПараметрыРасчета.Вставить("КФО");
	ПараметрыРасчета.Вставить("Дата");
	ПараметрыРасчета.Вставить("Счет");
	ПараметрыРасчета.Вставить("Субконто1");
	ПараметрыРасчета.Вставить("Субконто2");
	ПараметрыРасчета.Вставить("Субконто3");
	ПараметрыРасчета.Вставить("ДтКт");
	ПараметрыРасчета.Вставить("КЭКОперации");
	ПараметрыРасчета.Вставить("ВводОстатков");

	Возврат ПараметрыРасчета;

КонецФункции

// Строка кодов групповых КЭК, которые требуется заменять на детальные.
//
Функция КОСГУКонтрагенты() Экспорт
	Возврат "730, 830, 560, 660, 550, 650, 540, 640";
КонецФункции

// Строка кодов групповых КЭК, которые требуется заменять на детальные.
//
Функция КОСГУМатериалы() Экспорт
	Возврат "340, 440";
КонецФункции

Процедура УстановитьТипРеквизитовШапкиПоПлануСчетов(ТипОбъекта = "Документы", ИмяОбъекта, ДанныеФормы) Экспорт
	
	ТипПС = Новый Массив;
	ТипПС.Добавить(БухгалтерскийУчетВызовСервераПовтИсп.ТекущийПланСчетов());
    ТипПС = Новый ОписаниеТипов(ТипПС);
	
    РеквизитыТипаСчет = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьМассивРеквизитовТипаСчет(ТипОбъекта, ИмяОбъекта);	

	Для Каждого РеквизитИмя Из РеквизитыТипаСчет Цикл
		
		ДанныеФормы[РеквизитИмя] =	ТипПС.ПривестиЗначение(ДанныеФормы[РеквизитИмя]);
		
    КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьТипРеквизитаФормыПоПлануСчетов(РеквизитФормы) Экспорт
	
	ТипПС = Новый Массив;
	ТипПС.Добавить(БухгалтерскийУчетВызовСервераПовтИсп.ТекущийПланСчетов());
    ТипПС = Новый ОписаниеТипов(ТипПС);
	
	РеквизитФормы =	ТипПС.ПривестиЗначение(РеквизитФормы);
	
КонецПроцедуры

Процедура УстановитьФлагОтразитьВМежотчетномПериоде(Форма) Экспорт

	Форма.ОтразитьВМежотчетномПериоде = ЗначениеЗаполнено(Форма.Объект.ВидМежотчетногоПериода);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидМежотчетногоПериода",
		"Видимость", ЗначениеЗаполнено(Форма.Объект.ВидМежотчетногоПериода)); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ФинансовыйГод",
		"Видимость", ЗначениеЗаполнено(Форма.Объект.ВидМежотчетногоПериода));

КонецПроцедуры

Процедура УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(Форма, ИмяСвойства = "Доступность") Экспорт

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ОтразитьВМежотчетномПериоде",
		ИмяСвойства, Форма.Объект.Дата >= НачалоДня(КонецГода(Форма.Объект.Дата)) И Форма.Объект.Дата <= КонецГода(Форма.Объект.Дата));

КонецПроцедуры

Процедура УстановитьПараметрыПолейАналитикиСчета(Форма, Счет, ПоляАналитики, ИмяТаблицыФормы = "") Экспорт
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
	Для Индекс = 1 По 3 Цикл
		Если ПоляАналитики.Свойство("Субконто" + Индекс) Тогда
			
			ИменаЭлементов      = РасшифроватьОписаниеПоляАналитикиСчета(ПоляАналитики["Субконто" + Индекс], ИмяТаблицыФормы);
			ТипЗначенияСубконто = ДанныеСчета["ВидСубконто" + Индекс + "ТипЗначения"];
			
			Если Индекс <= ДанныеСчета.КоличествоСубконто Тогда
				
				Если СубконтоЗаполняетсяАвтоматически(Счет, Индекс) Тогда
					Форма.Элементы[ИменаЭлементов.ИмяПоляФормы].ПодсказкаВвода = НСтр("ru = '<авто>'");
				Иначе
					Форма.Элементы[ИменаЭлементов.ИмяПоляФормы].ОграничениеТипа = ТипЗначенияСубконто;
					Форма.Элементы[ИменаЭлементов.ИмяПоляФормы].ПодсказкаВвода  = ДанныеСчета["ВидСубконто" + Индекс + "Наименование"];
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ПоляАналитики.Свойство("Подразделение") Тогда
		ИменаЭлементов = РасшифроватьОписаниеПоляАналитикиСчета(ПоляАналитики.Подразделение, ИмяТаблицыФормы);
		Форма.Элементы[ИменаЭлементов.ИмяПоляФормы].ПодсказкаВвода = НСтр("ru = 'Подразделение'");
	КонецЕсли;
	
	Если ПоляАналитики.Свойство("КПС") Тогда
		ИменаЭлементов = РасшифроватьОписаниеПоляАналитикиСчета(ПоляАналитики.КПС, ИмяТаблицыФормы);
		Форма.Элементы[ИменаЭлементов.ИмяПоляФормы].ПодсказкаВвода = НСтр("ru = 'КПС'");
	КонецЕсли;
	
	Если ПоляАналитики.Свойство("КЭК") Тогда
		ИменаЭлементов = РасшифроватьОписаниеПоляАналитикиСчета(ПоляАналитики.КЭК, ИмяТаблицыФормы);
		Форма.Элементы[ИменаЭлементов.ИмяПоляФормы].ПодсказкаВвода = НСтр("ru = 'КЭК'");
	КонецЕсли;
	
КонецПроцедуры

// Заполняет свойства счета в соответствующие данные формы (строки таблицы формы).
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура, ДанныеФормыЭлементКоллекции - данные, в которые заполняются значения свойств счета
//  Счет - ПланСчетовСсылка.ЕПСБУ
//  ПоляАналитики - Структура - может содержать свойства:
//   * Субконто1 - Строка
//   * Субконто2 - Строка
//   * Субконто3 - Строка
//   * Подразделение - Строка
//   * КПС - Строка
//   * КЭК - Строка
Процедура УстановитьДоступностьПолейАналитикиСчета(Объект, Счет, ПоляАналитики) Экспорт
	ЗаполнитьЗначенияСвойств(Объект, СвойстваПолейАналитикиСчета(Счет, ПоляАналитики));
КонецПроцедуры	

// Свойства для заполнения полей аналитики счета в строке таблицы или объекте.
// 
// Параметры:
//  Счет - ПланСчетовСсылка.ЕПСБУ
//  ПоляАналитики - Структура - может содержать свойства:
//   * Субконто1 - Строка
//   * Субконто2 - Строка
//   * Субконто3 - Строка
//   * Подразделение - Строка
//   * КПС - Строка
//   * КЭК - Строка
// 
// Возвращаемое значение:
//  Структура - содержит ключи и значения для заполнения в форме
Функция СвойстваПолейАналитикиСчета(Счет, ПоляАналитики) Экспорт
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
	СвойстваПолейАналитики = Новый Структура;
	Для Индекс = 1 По 3 Цикл
		Если ПоляАналитики.Свойство("Субконто" + Индекс) Тогда
			
			ИменаЭлементов = РасшифроватьОписаниеПоляАналитикиСчета(ПоляАналитики["Субконто" + Индекс]);
			
			Если Индекс <= ДанныеСчета.КоличествоСубконто Тогда
				Если СубконтоЗаполняетсяАвтоматически(Счет, Индекс, ДанныеСчета) Тогда
					// Не показывать
					СвойстваПолейАналитики.Вставить(ИменаЭлементов.ПризнакДоступностиПоля, 0);
				ИначеЕсли ДанныеСчета["ВидСубконто" + Индекс + "Обязательный"] Тогда
					// Обязательное субконто.
					СвойстваПолейАналитики.Вставить(ИменаЭлементов.ПризнакДоступностиПоля, 1);
				Иначе
					// Необязательное субконто.
					СвойстваПолейАналитики.Вставить(ИменаЭлементов.ПризнакДоступностиПоля, 2);
				КонецЕсли;
			Иначе
				// Не показывать.
				СвойстваПолейАналитики.Вставить(ИменаЭлементов.ПризнакДоступностиПоля, 0);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ПоляАналитики.Свойство("Подразделение") Тогда
		
		ИменаЭлементов = РасшифроватьОписаниеПоляАналитикиСчета(ПоляАналитики.Подразделение);
		
		Если НЕ ДанныеСчета.УчетПоПодразделениям Тогда
			СвойстваПолейАналитики.Вставить(ИменаЭлементов.ПризнакДоступностиПоля, 0); // Не показывать.
		ИначеЕсли ПоляАналитики.Свойство("АвтоПодразделение") И ПоляАналитики.АвтоПодразделение Тогда
			СвойстваПолейАналитики.Вставить(ИменаЭлементов.ПризнакДоступностиПоля, 3); // Подразделение заполняется автоматически, необязательно указывать подразделение.
		ИначеЕсли НЕ ДанныеСчета.РазрешитьНеУказыватьПодразделение Тогда
			СвойстваПолейАналитики.Вставить(ИменаЭлементов.ПризнакДоступностиПоля, 1); // Обязательно указывать подразделение.
		Иначе
			СвойстваПолейАналитики.Вставить(ИменаЭлементов.ПризнакДоступностиПоля, 2); // Необязательно указывать подразделение.
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПоляАналитики.Свойство("КПС") Тогда
		ИменаЭлементов = РасшифроватьОписаниеПоляАналитикиСчета(ПоляАналитики.КПС);
		СвойстваПолейАналитики.Вставить(ИменаЭлементов.ПризнакДоступностиПоля, ДанныеСчета.УчетПоКПС);
	КонецЕсли;
	
	Если ПоляАналитики.Свойство("КЭК") Тогда
		ИменаЭлементов = РасшифроватьОписаниеПоляАналитикиСчета(ПоляАналитики.КЭК);
		СвойстваПолейАналитики.Вставить(ИменаЭлементов.ПризнакДоступностиПоля, ДанныеСчета.УчетПоКЭК);
	КонецЕсли;
	
	Возврат СвойстваПолейАналитики;
	
КонецФункции

Функция РасшифроватьОписаниеПоляАналитикиСчета(ПутьКДаннымАналитикиСчета, ИмяТаблицыФормы = "") Экспорт
	
	ИменаЭлементов = Новый Структура;
	ИменаЭлементов.Вставить("ПутьКДаннымАналитикиСчета", ПутьКДаннымАналитикиСчета);
	
	// Убираем префикс "Объект.", если есть.
	ИменаЭлементов.Вставить("ПолеАналитикиСчета",
		СтрЗаменить(ПутьКДаннымАналитикиСчета, "Объект.", ""));
	
	ПозицияТочки = Найти(ИменаЭлементов.ПолеАналитикиСчета, ".");
	
	// Имя таблицы на форме.
	Если Найти(ПутьКДаннымАналитикиСчета, "Объект.") Тогда
		ИменаЭлементов.Вставить("ИмяТаблицыФормы",
			"Объект." + Лев(ИменаЭлементов.ПолеАналитикиСчета, ПозицияТочки - 1));
	Иначе
		ИменаЭлементов.Вставить("ИмяТаблицыФормы",
			Лев(ИменаЭлементов.ПолеАналитикиСчета, ПозицияТочки - 1));
	КонецЕсли;
	
	// Имя поля на форме.
	ИмяТаблицыНаФормеОтличаетсяОтСтандартного = ЗначениеЗаполнено(ИмяТаблицыФормы);
	Если ИмяТаблицыНаФормеОтличаетсяОтСтандартного Тогда
		ИменаЭлементов.Вставить("ИмяПоляФормы",
			ИмяТаблицыФормы + Сред(ИменаЭлементов.ПолеАналитикиСчета, ПозицияТочки + 1) );
	Иначе
		ИменаЭлементов.Вставить("ИмяПоляФормы",
			СтрЗаменить(ИменаЭлементов.ПолеАналитикиСчета, ".", ""));
	КонецЕсли;
	
	// Имя дополнительной колонки с признаком доступности поля.
	ИменаЭлементов.Вставить("ПризнакДоступностиПоля",
		Сред(ИменаЭлементов.ПолеАналитикиСчета, ПозицияТочки + 1) + "Доступность");
	
	Возврат ИменаЭлементов;
	
КонецФункции

// Устанавливает доступность элементов формы, содержащих значения субконто, заголовки субконто.
// На форме должны быть реквизиты (тип "Строка") для отображения наименования субконто.
// Имена реквизитов, элементов формы задаются в параметр "МассивПолей" (см. процедуру "ДобавитьПолеДляУстановкиЗаголовковСубконто").
//
// Параметры:
//	Счет - ПланСчетовСсылка - счет, для которого устанавливаются субконто
//	Форма - Управляемая форма
//	Объект - любой тип, содержащий данные объекта, из которого проверяется заполнение реквизитов
//	МассивПолей - Массив - массив, заполненный процедурой БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто()
//
// Пример:
//	&НаКлиенте
//	Процедура СчетУчетаЗатратПриИзменении(Элемент)
//		Перем МассивПолей;
//		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
//			"Субконто1", "СубконтоЗатрат1", "ЗаголовокСубконтоЗатрат1", Истина, "СубконтоЗатрат1", Истина, Истина);
//		БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(Объект.СчетУчетаЗатрат, ЭтаФорма, Объект, МассивПолей);
//	КонецПроцедуры
//
Процедура УстановитьЗаголовкиИДоступностьСубконто(Счет, Форма, Объект, МассивПолей) Экспорт

	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
	Для каждого Поле Из МассивПолей Цикл
		
		ЗаполнятьОбязательно = Ложь;
		ДоступностьПоля = Ложь;
		ЗаголовокПоля = "";
		Если Поле.ИмяСвойства = "Подразделение" Тогда
			ДоступностьПоля = СвойстваСчета.УчетПоПодразделениям;
			ЗаполнятьОбязательно = СвойстваСчета.УчетПоПодразделениям И НЕ СвойстваСчета.РазрешитьНеУказыватьПодразделение;
			ЗаголовокПоля = НСтр("ru = 'Подразделение'");
		ИначеЕсли Поле.ИмяСвойства = "КПС" Тогда
			ДоступностьПоля = СвойстваСчета.УчетПоКПС;
			ЗаполнятьОбязательно = СвойстваСчета.УчетПоКПС;
			ЗаголовокПоля = НСтр("ru = 'КПС'");
		ИначеЕсли Поле.ИмяСвойства = "КЭК" Тогда
			ДоступностьПоля = СвойстваСчета.УчетПоКЭК;
			ЗаполнятьОбязательно = СвойстваСчета.УчетПоКЭК;
			ЗаголовокПоля = НСтр("ru = 'КЭК'");
		ИначеЕсли Лев(Поле.ИмяСвойства, 8) = "Субконто" Тогда
			НомерСубконто = Сред(Поле.ИмяСвойства, 9, 1);
			ДоступностьПоля = СвойстваСчета["ВидСубконто" + НомерСубконто] <> Неопределено;
			ЗаполнятьОбязательно = СвойстваСчета["ВидСубконто" + НомерСубконто + "Обязательный"];
			ЗаголовокПоля = СвойстваСчета["ВидСубконто" + НомерСубконто + "Наименование"];
		Иначе
			Продолжить;
		КонецЕсли;
		
		Форма.Элементы[Поле.ИмяЭлемента].Доступность = ДоступностьПоля;
		Если ЗначениеЗаполнено(Поле.ИмяЗаголовкаЭлемента) Тогда
			Форма.Элементы[Поле.ИмяЗаголовкаЭлемента].Доступность = ДоступностьПоля;
			Если Поле.УстанавливатьЗаголовок Тогда
				Если Поле.УстанавливатьЗаголовокЭлемента Тогда
					Форма.Элементы[Поле.ИмяЗаголовкаЭлемента].Заголовок =
						?(ПустаяСтрока(ЗаголовокПоля), НСтр("ru = '<не используется>'"), ЗаголовокПоля);
				Иначе
					Форма[Поле.ИмяЗаголовкаЭлемента] = "" + ЗаголовокПоля + ?(ПустаяСтрока(ЗаголовокПоля), "", ":");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Поле.АвтоотметкаНезаполненного Тогда
			Если ДоступностьПоля И ЗаполнятьОбязательно Тогда
				Форма.Элементы[Поле.ИмяЭлемента].АвтоотметкаНезаполненного = Истина;
				Если Поле.ЭтоПолеОбъекта Тогда
					Форма.Элементы[Поле.ИмяЭлемента].ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(Объект[Поле.ИмяРеквизита]);
				Иначе
					Форма.Элементы[Поле.ИмяЭлемента].ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(Форма[Поле.ИмяРеквизита]);
				КонецЕсли;
			Иначе
				Форма.Элементы[Поле.ИмяЭлемента].АвтоотметкаНезаполненного = Ложь;
				Форма.Элементы[Поле.ИмяЭлемента].ОтметкаНезаполненного = Ложь;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры

// Заполняет массив полей для использования в процедуре "УстановитьЗаголовкиИДоступностьСубконто".
// Для каждого поля указывается: имя проверяемого свойства счета,имя реквизита объекта, имя элемента формы, имя элемента формы заголовка,
// признак изменения текста заголовка, принадлежность реквизита (объект или форма). 
// Если в первом вызове МассивПолей = Неопределено, то создается новый массив.
//
// Параметры:
//	МассивПолей	- Неопределено
//				- Массив
//	ИмяСвойства - Строка - Имя свойства счета: "Подразделение", "Субконто1", "Субконто2", "Субконто3".
//	ИмяЭлемента - Строка - имя элемента формы, связанного с данными
//	ИмяЗаголовкаЭлемента - Строка - имя элемента формы, связанного с заголовком
//	УстанавливатьЗаголовок - Булево - изменять текст заголовка. Текст заголовка не изменяется, например, если ТипЗнч(Форма["ИмяЗаголовкаЭлемента"]) = Тип("ДекорацияФормы")
//	ИмяРеквизита - Строка - имя реквизита объекта, содержащего данные
//	АвтоотметкаНезаполненного - Булево - устанавливать автоотметку незаполненного для обязательного реквизита
//	ЭтоПолеОбъекта - Булево - если Истина, то читаются данные из объекта. Иначе - из формы. (см. описание "УстановитьЗаголовкиИДоступностьСубконто")
//
// Пример:
//	&НаКлиентеНаСервереБезКонтекста
//	Процедура УстановитьЗаголовокиСубконтоЗатрат(Форма, Объект)
//		Перем МассивПолей;
//		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
//			"Подразделение", "ПодразделениеЗатрат", "ЗаголовокПодразделениеЗатрат", Ложь, "ПодразделениеЗатрат", Истина, Истина);
//		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
//			"Субконто1", "СубконтоЗатрат1", "ЗаголовокСубконтоЗатрат1", Истина, "СубконтоЗатрат1", Истина, Истина);
//		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
//			"Субконто2", "СубконтоЗатрат2", "ЗаголовокСубконтоЗатрат2", Истина, "СубконтоЗатрат2", Истина, Истина);
//		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
//			"Субконто3", "СубконтоЗатрат3", "ЗаголовокСубконтоЗатрат3", Истина, "СубконтоЗатрат3", Истина, Истина);
//		БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(Объект.СчетУчетаЗатрат, Форма, Объект, МассивПолей);
//	КонецПроцедуры // УстановитьЗаголовокиСубконтоЗатрат()
//
Процедура ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, ИмяСвойства, ИмяЭлемента, ИмяЗаголовкаЭлемента, УстанавливатьЗаголовок, ИмяРеквизита, АвтоотметкаНезаполненного, ЭтоПолеОбъекта = Истина, УстанавливатьЗаголовокЭлемента = Ложь) Экспорт

	Если МассивПолей = Неопределено Тогда
		МассивПолей = Новый Массив;
	КонецЕсли;
	
	Поле = Новый Структура;
	Поле.Вставить("ИмяСвойства",					ИмяСвойства);
	Поле.Вставить("ИмяЭлемента",					ИмяЭлемента);
	Поле.Вставить("ИмяЗаголовкаЭлемента",			ИмяЗаголовкаЭлемента);
	Поле.Вставить("УстанавливатьЗаголовок",			УстанавливатьЗаголовок);
	Поле.Вставить("ИмяРеквизита",					ИмяРеквизита);
	Поле.Вставить("АвтоотметкаНезаполненного",		АвтоотметкаНезаполненного);
	Поле.Вставить("ЭтоПолеОбъекта",					ЭтоПолеОбъекта);
	Поле.Вставить("УстанавливатьЗаголовокЭлемента",	УстанавливатьЗаголовокЭлемента);
	МассивПолей.Добавить(Поле);

КонецПроцедуры

// Конструктор свойств формы и объекта, используемых для установки параметров выбора субконто.
//
// Параметры:
//  СубконтоФормы    - Строка - Имя элемента формы связанного с данными
//  СубконтоОбъекта  - Строка - имя реквизита объекта, содержащего данные Субконто 
//  СчетУчетаОбъекта - Строка - имя реквизита объекта, содержащего данные Счет
//
// Возвращаемое значение:
//   Структура: См. НовыеПараметрыУстановкиСвойствСубконто()
//
Функция ПараметрыУстановкиСвойствСубконтоПоШаблону(СубконтоФормы, СубконтоОбъекта, СчетУчетаОбъекта) Экспорт
	
	Результат = НовыеПараметрыУстановкиСвойствСубконто();
	
	Если НЕ ПустаяСтрока(СубконтоФормы) Тогда
		Для Индекс = 1 По 3 Цикл
			Результат.ПоляФормы["Субконто" + Индекс] = СубконтоФормы + Индекс;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(СубконтоОбъекта) Тогда
		Для Индекс = 1 По 3 Цикл
			Результат.ПоляОбъекта["Субконто" + Индекс] = СубконтоОбъекта + Индекс;
		КонецЦикла;
	КонецЕсли;

	Если НЕ ПустаяСтрока(СчетУчетаОбъекта) Тогда
		Результат.ПоляОбъекта.СчетУчета = СчетУчетаОбъекта;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Форма              - ФормаКлиентскогоПриложения
//  Объект             - ДанныеФормыСтруктура - данные формы содержащие данные объекта
//                     - ДанныеФормыЭлементКоллекции - данные строки табличной части
//                     - ФормаКлиентскогоПриложения
//  ПараметрыУстановки - Структура: см. НовыеПараметрыУстановкиСвойствСубконто()
//
Процедура УстановитьПараметрыВыбораСубконтоПриИзмененииОрганизации(Форма, Объект, ПараметрыУстановки) Экспорт
	
	ОчиститьСубконтоПриИзмененииОрганизации(Объект, ПараметрыУстановки);
	
	ДанныеОбъекта = ДанныеУстановкиПараметровСубконто(Объект, ПараметрыУстановки);

	УстановитьПараметрыВыбораСубконто(Форма, Объект, ПараметрыУстановки, ДанныеОбъекта);
	
КонецПроцедуры

// Параметры:
//  Форма              - ФормаКлиентскогоПриложения
//  Объект             - ДанныеФормыСтруктура - данные формы содержащие данные объекта
//                     - ДанныеФормыЭлементКоллекции - данные строки табличной части
//                     - ФормаКлиентскогоПриложения
//  ПараметрыУстановки - Структура: см. НовыеПараметрыУстановкиСвойствСубконто()
//
Процедура УстановитьПараметрыВыбораСубконтоПриИзмененииСчета(Форма, Объект, ПараметрыУстановки) Экспорт
	
	ДанныеОбъекта = ДанныеУстановкиПараметровСубконто(Объект, ПараметрыУстановки);

	УстановитьПараметрыВыбораСубконто(Форма, Объект, ПараметрыУстановки, ДанныеОбъекта);
	
КонецПроцедуры

// Параметры:
//  Форма              - ФормаКлиентскогоПриложения
//  Объект             - ДанныеФормыСтруктура - данные формы содержащие данные объекта
//                     - ДанныеФормыЭлементКоллекции - данные строки табличной части
//                     - ФормаКлиентскогоПриложения
//  НомерСубконто      - Число
//  ПараметрыУстановки - Структура: см. НовыеПараметрыУстановкиСвойствСубконто()
//
Процедура УстановитьПараметрыВыбораСубконтоПриИзмененииСубконто(Форма, Объект, НомерСубконто, ПараметрыУстановки) Экспорт
	
	ОчиститьСубконтоПриИзмененииСубконто(Объект, ПараметрыУстановки, НомерСубконто);

	ДанныеОбъекта = ДанныеУстановкиПараметровСубконто(Объект, ПараметрыУстановки);

	УстановитьПараметрыВыбораСубконто(Форма, Объект, ПараметрыУстановки, ДанныеОбъекта);
	
КонецПроцедуры

// Параметры:
//  Объект             - ДанныеФормыСтруктура - данные формы содержащие данные объекта
//                     - ДанныеФормыЭлементКоллекции - данные строки табличной части
//                     - ФормаКлиентскогоПриложения
//  ПараметрыУстановки - Структура: см. НовыеПараметрыУстановкиСвойствСубконто()
//
Процедура ОчиститьСубконтоПриИзмененииОрганизации(Объект, ПараметрыУстановки) Экспорт
	
	ТипыСубконтоСвязанныеСОрганизацией = БухгалтерскийУчетВызовСервераПовтИсп.ТипыСубконтоСвязанныеСОрганизацией();
	
	ПоляОбъекта = ПараметрыУстановки.ПоляОбъекта;
	
	Для каждого ПолеОбъекта Из ПоляОбъекта Цикл
		ИмяПоля = ПолеОбъекта.Значение;
		Если ЗначениеЗаполнено(ИмяПоля)
			И ЗначениеЗаполнено(Объект[ИмяПоля]) Тогда
			ТипПоля = ТипЗнч(Объект[ИмяПоля]);
			Если ТипыСубконтоСвязанныеСОрганизацией[ТипПоля] <> Неопределено Тогда
				Объект[ИмяПоля] = Новый (ТипПоля);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура изменяет параметры выбора для ПоляВвода управляемой формы:
//
//Параметры:
//	ЭлементФормыСчет - ПолеВвода управляемой формы, для которого изменяется параметр выбора 
//  МассивСчетов                 - <Массив> ИЛИ <Неопределено> - счета, которыми нужно ограничить список. 
//	                                   Если не заполнено - ограничения не будет
//  ОтборПоПризнакуВалютный      - <Булево> ИЛИ <Неопределено> - Значение для установки соответсвтующего параметра выбора. 
//                                     Если неопределено, параметр выбора не устанавливается.
//  ОтборПоПризнкуЗабалансовый   - <Булево> ИЛИ <Неопределено> - Значение для установки соответсвтующего параметра выбора. 
//                                     Если неопределено, параметр выбора не устанавливается.
//  ОтборПоПризнакуСчетГруппа    - <Булево> ИЛИ <Неопределено> - Значение для установки соответсвтующего параметра выбора. 
//                                     Если неопределено, параметр выбора не устанавливается.
//
//
Процедура ИзменитьПараметрыВыбораСчета(ЭлементФормыСчет, МассивСчетов, ОтборПоПризнакуВалютный = Неопределено, ОтборПоПризнкуЗабалансовый = Неопределено, ОтборПоПризнакуСчетГруппа = Ложь) Экспорт

	МассивОтборов = Новый Массив;
	Если ОтборПоПризнакуСчетГруппа <> Неопределено Тогда
		МассивОтборов.Добавить(Новый ПараметрВыбора("Отбор.ЗапретитьИспользоватьВПроводках", ОтборПоПризнакуСчетГруппа));
	КонецЕсли; 
	
	Если ОтборПоПризнакуВалютный <> Неопределено Тогда
		МассивОтборов.Добавить(Новый ПараметрВыбора("Отбор.Валютный", ОтборПоПризнакуВалютный));
	КонецЕсли; 
	
	Если ОтборПоПризнкуЗабалансовый <> Неопределено Тогда
		МассивОтборов.Добавить(Новый ПараметрВыбора("Отбор.Забалансовый", ОтборПоПризнкуЗабалансовый));
	КонецЕсли; 
	
	Если МассивСчетов <> Неопределено И МассивСчетов.Количество() > 0 Тогда
		МассивОтборов.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивСчетов)));
	КонецЕсли; 

	ПараметрыВыбора = Новый ФиксированныйМассив(МассивОтборов);
	ЭлементФормыСчет.ПараметрыВыбора = ПараметрыВыбора;
	
КонецПроцедуры

// Заполняет добавленные колонки ОтражениеВУчете и ОтражениеВУчетеЗаполнено для строки документа
//
// Параметры:
//	ДанныеСтроки     - строка документа или структура с аналогичными полями: Счет, Субконто1-3, СчетНУ, СубконтоНУ1-3,
//						 и добавленными колонками ОтражениеВУчете и ОтражениеВУчетеЗаполнено.
//	ПараметрыОбъекта - Структура параметров объекта, определяющими используемую систему налогообложения и состав полей
//						 (по умолчанию будут использоваться только поля Счет и Субконто1-3).
//	ПоляФормы        - Структура с наименованиями полей Счет, Субконто1-3, СчетНУ, СубконтоНУ1-3 и пр. строки документа
//						 (необходимы только если отличаются от установленных по умолчанию).
//
Процедура ЗаполнитьДобавленныеКолонкиОтражениеВУчете(ДанныеСтроки, ПараметрыОбъекта=Неопределено, ПоляФормы=Неопределено) Экспорт

	// Преобразуем входные параметры к каноническому виду
	
	Если ПараметрыОбъекта = Неопределено Тогда
		ПараметрыОбъекта = Новый Структура();
	КонецЕсли;
	
	ПараметрыОбъекта.Вставить("РежимДоходы", ?(ПараметрыОбъекта.Свойство("РежимДоходы"), ПараметрыОбъекта.РежимДоходы, Ложь));
	
	ПараметрыОбъекта.Вставить("ОтражатьВНалоговомУчете",
		?(ПараметрыОбъекта.Свойство("ОтражатьВНалоговомУчете"), ПараметрыОбъекта.ОтражатьВНалоговомУчете, Ложь));
		
	ПараметрыОбъекта.Вставить("ОтражатьВУСНДоходыМинусРасходы",
		?(ПараметрыОбъекта.Свойство("ОтражатьВУСНДоходыМинусРасходы"), ПараметрыОбъекта.ОтражатьВУСНДоходыМинусРасходы, Ложь));
		
	ПараметрыОбъекта.Вставить("ЕстьПодразделение",
		?(ПараметрыОбъекта.Свойство("ЕстьПодразделение"), ПараметрыОбъекта.ЕстьПодразделение, Ложь));
		
	ПараметрыОбъекта.Вставить("ЕстьКФО", ?(ПараметрыОбъекта.Свойство("ЕстьКФО"), ПараметрыОбъекта.ЕстьКФО, Ложь));
	ПараметрыОбъекта.Вставить("ЕстьКПС", ?(ПараметрыОбъекта.Свойство("ЕстьКПС"), ПараметрыОбъекта.ЕстьКПС, Ложь));
	ПараметрыОбъекта.Вставить("ЕстьКЭК", ?(ПараметрыОбъекта.Свойство("ЕстьКЭК"), ПараметрыОбъекта.ЕстьКЭК, Ложь));
	ПараметрыОбъекта.Вставить("ЕстьНДС", ?(ПараметрыОбъекта.Свойство("ЕстьНДС"), ПараметрыОбъекта.ЕстьНДС, Ложь));
	ПараметрыОбъекта.Вставить("ОтразитьВКарточкеКапвложений", 
		?(ПараметрыОбъекта.Свойство("ОтразитьВКарточкеКапвложений"), 
		ПараметрыОбъекта.ОтразитьВКарточкеКапвложений, Ложь));
	
	Если ПоляФормы = Неопределено Тогда
		ПоляФормы = Новый Структура();
	КонецЕсли;
	
	ПоляФормы.Вставить("Подразделение", ?(ПоляФормы.Свойство("Подразделение"), ПоляФормы.Подразделение, "Подразделение"));
	
	ПоляФормы.Вставить("Счет",          ?(ПоляФормы.Свойство("Счет"),          ПоляФормы.Счет,          "Счет"));
	ПоляФормы.Вставить("Субконто1",     ?(ПоляФормы.Свойство("Субконто1"),     ПоляФормы.Субконто1,     "Субконто1"));
	ПоляФормы.Вставить("Субконто2",     ?(ПоляФормы.Свойство("Субконто2"),     ПоляФормы.Субконто2,     "Субконто2"));
	ПоляФормы.Вставить("Субконто3",     ?(ПоляФормы.Свойство("Субконто3"),     ПоляФормы.Субконто3,     "Субконто3"));
	
	ПоляФормы.Вставить("СчетНУ",        ?(ПоляФормы.Свойство("СчетНУ"),        ПоляФормы.СчетНУ,        "СчетНУ"));
	ПоляФормы.Вставить("СубконтоНУ1",   ?(ПоляФормы.Свойство("СубконтоНУ1"),   ПоляФормы.СубконтоНУ1,   "СубконтоНУ1"));
	ПоляФормы.Вставить("СубконтоНУ2",   ?(ПоляФормы.Свойство("СубконтоНУ2"),   ПоляФормы.СубконтоНУ2,   "СубконтоНУ2"));
	ПоляФормы.Вставить("СубконтоНУ3",   ?(ПоляФормы.Свойство("СубконтоНУ3"),   ПоляФормы.СубконтоНУ3,   "СубконтоНУ3"));
	
	ПоляФормы.Вставить("ВидДеятельностиНУ",     ?(ПоляФормы.Свойство("ВидДеятельностиНУ"),     ПоляФормы.ВидДеятельностиНУ,     "ВидДеятельностиНУ"));
	ПоляФормы.Вставить("СтатьяПрочихДоходовНУ", ?(ПоляФормы.Свойство("СтатьяПрочихДоходовНУ"), ПоляФормы.СтатьяПрочихДоходовНУ, "СтатьяПрочихДоходовНУ"));
	
	ПоляФормы.Вставить("СчетУчетаНДС",  ?(ПоляФормы.Свойство("СчетУчетаНДС"),  ПоляФормы.СчетУчетаНДС,  "СчетУчетаНДС"));
	
	ПоляФормы.Вставить("КФО",           ?(ПоляФормы.Свойство("КФО"),           ПоляФормы.КФО,           "КФО"));
	ПоляФормы.Вставить("КПС",           ?(ПоляФормы.Свойство("КПС"),           ПоляФормы.КПС,           "КПС"));
	ПоляФормы.Вставить("КЭК",           ?(ПоляФормы.Свойство("КЭК"),           ПоляФормы.КЭК,           "КЭК"));
	
	ПоляФормы.Вставить("ОтражениеВУСН",   ?(ПоляФормы.Свойство("ОтражениеВУСН"),   ПоляФормы.ОтражениеВУСН,   "ОтражениеВУСН"));
	ПоляФормы.Вставить("ОтражениеВУчете", ?(ПоляФормы.Свойство("ОтражениеВУчете"), ПоляФормы.ОтражениеВУчете, "ОтражениеВУчете"));

	ПоляФормы.Вставить("ОтразитьВКарточкеКапвложений", ?(ПоляФормы.Свойство("ОтразитьВКарточкеКапвложений"),   
		ПоляФормы.ОтразитьВКарточкеКапвложений, "ОтразитьВКарточкеКапвложений"));
	ПоляФормы.Вставить("КарточкаКапвложений", ?(ПоляФормы.Свойство("КарточкаКапвложений"), 
		ПоляФормы.КарточкаКапвложений, "КарточкаКапвложений"));

	СтроковыеПредставленияСубконто = Новый Структура();
	
	ОтражениеВУчетеЗаполнено = Истина;
	ОтражениеВУчетеПустое    = Истина;
	
	Счет = ДанныеСтроки[ПоляФормы.Счет];
	
	// Бухгалтерский учет
	ОтражениеВУчетеТекст = "";
	Если ЗначениеЗаполнено(Счет) Тогда
		
		ОтражениеВУчетеПустое = Ложь;
		
		СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
		
		ОтражениеВУчетеТекст = ОтражениеВУчетеТекст
			+ ?(ПараметрыОбъекта.ЕстьКФО, Строка(ДанныеСтроки[ПоляФормы.КФО])+".", "")
			+ Строка(СвойстваСчета.Код)
			+ ?(ПараметрыОбъекта.ЕстьКПС, "."+ДанныеСтроки[ПоляФормы.КПС], "")
			+ ?(ПараметрыОбъекта.ЕстьКЭК, "."+ДанныеСтроки[ПоляФормы.КЭК], "");
		
		Если ПараметрыОбъекта.ЕстьПодразделение Тогда
			ЗначениеПодразделение = ДанныеСтроки[ПоляФормы.Подразделение];
			Если ЗначениеЗаполнено(ЗначениеПодразделение) Тогда
				ОтражениеВУчетеТекст = ОтражениеВУчетеТекст+ ", " + ЗначениеПодразделение;
			Иначе
				ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ", <...>";
				Если СвойстваСчета.УчетПоПодразделениям И НЕ СвойстваСчета.РазрешитьНеУказыватьПодразделение Тогда
					ОтражениеВУчетеЗаполнено = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Для Н = 1 По СвойстваСчета.КоличествоСубконто Цикл
			ЗначениеСубконто = ДанныеСтроки[ПоляФормы["Субконто" + Н]];
			Если ЗначениеЗаполнено(ЗначениеСубконто) Тогда
				ПредставлениеСубконто = Строка(ЗначениеСубконто);
				
				СтроковыеПредставленияСубконто.Вставить("ЗначениеСубконто" + Н, ЗначениеСубконто);
				СтроковыеПредставленияСубконто.Вставить("ПредставлениеСубконто" + Н, ПредставлениеСубконто);
				
				ДополнитьПредставлениеКоличественногоСубконто(ЗначениеСубконто, ПредставлениеСубконто, СвойстваСчета, ПараметрыОбъекта);
				
				ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ", " + ПредставлениеСубконто;
			ИначеЕсли СубконтоЗаполняетсяАвтоматически(Счет, Н) Тогда
				Продолжить;
			Иначе
				ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ", <...>";
				Если СвойстваСчета["ВидСубконто" + Н + "Обязательный"] Тогда
					ОтражениеВУчетеЗаполнено = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		ОтражениеВУчетеТекст     = ОтражениеВУчетеТекст + "<...>";
		ОтражениеВУчетеЗаполнено = Ложь;
	КонецЕсли;

	// Счет учета НДС - до затрат НУ, т.к. аналитика НУ чаще всего совпадает с БУ
	Если ПараметрыОбъекта.ЕстьНДС Тогда
		Если ЗначениеЗаполнено(ДанныеСтроки[ПоляФормы.СчетУчетаНДС]) Тогда
			СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки[ПоляФормы.СчетУчетаНДС]);
			ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ", " + СвойстваСчета.Код;
		Иначе
			Если ДанныеСтроки.СуммаНДС <> 0 Тогда
				ОтражениеВУчетеТекст 	= ОтражениеВУчетеТекст + ", <...>";
				ОтражениеВУчетеЗаполнено = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// Налоговый учет
	Если ПараметрыОбъекта.ОтражатьВНалоговомУчете Тогда
		
		Если ЗначениеЗаполнено(ДанныеСтроки[ПоляФормы.СчетНУ]) Тогда
			
			ОтражениеВУчетеПустое = Ложь;
			
			СвойстваСчетаНУ = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеСтроки[ПоляФормы.СчетНУ]);
			
			ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ";"+Символы.ПС+"НУ: " + СвойстваСчетаНУ.Код;
			
			Если ПараметрыОбъекта.РежимДоходы Тогда
				
				Если БухгалтерскийУчетКлиентСервер.СчетВИерархии(ДанныеСтроки[ПоляФормы.СчетНУ], "Н91.01") Тогда
					
					Если ЗначениеЗаполнено(ДанныеСтроки[ПоляФормы.СтатьяПрочихДоходовНУ]) Тогда
						ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ", " + ДанныеСтроки[ПоляФормы.СтатьяПрочихДоходовНУ];
					Иначе
						ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ", <...>";
						ОтражениеВУчетеЗаполнено = Ложь;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДанныеСтроки[ПоляФормы.ВидДеятельностиНУ]) Тогда
					ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ", " + ДанныеСтроки[ПоляФормы.ВидДеятельностиНУ];
				Иначе
					ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ", <...>";
					ОтражениеВУчетеЗаполнено = Ложь;
				КонецЕсли;
				
			Иначе // Расходы.
				
				Для Н = 1 По СвойстваСчетаНУ.КоличествоСубконто Цикл
					
					ЗначениеСубконтоНУ = ДанныеСтроки[ПоляФормы["СубконтоНУ" + Н]];
					
					Если ЗначениеЗаполнено(ЗначениеСубконтоНУ) Тогда
					
						ПредставлениеСубконтоНУ = "";
						
						// Если совпадает с субконто БУ, то представление выводим как для БУ.
						ЗначениеСубконтоБУ = Неопределено;
						Если СтроковыеПредставленияСубконто.Свойство("ЗначениеСубконто" + Н, ЗначениеСубконтоБУ) Тогда
							Если ЗначениеСубконтоБУ = ЗначениеСубконтоНУ Тогда
								ПредставлениеСубконтоНУ = СтроковыеПредставленияСубконто["ПредставлениеСубконто" + Н];
							КонецЕсли;
						КонецЕсли;
						
						ПредставлениеСубконтоНУ = Строка(ЗначениеСубконтоНУ);
					
						ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ", " + ПредставлениеСубконтоНУ;
					
					Иначе
						
						ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ", <...>";
						Если СвойстваСчетаНУ["ВидСубконто" + Н + "Обязательный"] Тогда
							ОтражениеВУчетеЗаполнено = Ложь;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			Если ПараметрыОбъекта.РежимДоходы Тогда
				
				ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ";"+Символы.ПС+"НУ: <...>";
				ОтражениеВУчетеЗаполнено = Ложь;
				
			Иначе // Расходы.
				
				ВыбранСчетПрочихДоходовРасходов = БухгалтерскийУчетКлиентСервер.СчетВИерархии(Счет, "401.10,401.20");
				Если ВыбранСчетПрочихДоходовРасходов Тогда
					// В этом случае нужно явно указать счет и аналитику НУ
					ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ";"+Символы.ПС+"НУ: <...>";
					ОтражениеВУчетеЗаполнено = Ложь;
				Иначе
					ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ";"+Символы.ПС+"НУ: аналогично БУ";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	// УСН Доходы минус расходы
	Если ПараметрыОбъекта.ОтражатьВУСНДоходыМинусРасходы Тогда
		Если БухгалтерскийУчетКлиентСервер.СчетВИерархии(Счет, "206.00,302.00") Тогда
			// Не указывается отражение в УСН.
		ИначеЕсли ЗначениеЗаполнено(ДанныеСтроки[ПоляФормы.ОтражениеВУСН]) Тогда
			ОтражениеРасходовВУСН = НРЕГ(Лев(ДанныеСтроки[ПоляФормы.ОтражениеВУСН], 1)) // первую букву в нижний регистр
				+ Сред(ДанныеСтроки[ПоляФормы.ОтражениеВУСН], 2);
			ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ";" + Символы.ПС
				+ "УСН: Расходы " + ОтражениеРасходовВУСН;
		Иначе
			ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ";" + Символы.ПС
				+ "УСН: <авто>";
		КонецЕсли;
	КонецЕсли;

	// Карточка капвложений
	Если ПараметрыОбъекта.ОтразитьВКарточкеКапвложений Тогда
		ОтражениеВУчетеТекст = ОтражениеВУчетеТекст + ";" + Символы.ПС
			+ "Карточка капвложений: " + ДанныеСтроки[ПоляФормы.КарточкаКапвложений];
	КонецЕсли;

	// Заполним добавленные колонки
	ДанныеСтроки[ПоляФормы.ОтражениеВУчете] = ?(ОтражениеВУчетеПустое, "<...>", ОтражениеВУчетеТекст);
	ДанныеСтроки[ПоляФормы.ОтражениеВУчете + "Заполнено"] = ОтражениеВУчетеЗаполнено;

КонецПроцедуры

// Параметры для функции БухгалтерскийУчетКлиентСервер.ПредставлениеСтрокиЦенаНДСВалюта
// 
// Возвращаемое значение:
//  Структура - Представление строки цена НДСВалюта параметры:
// * ВалютаДокумента - СправочникСсылка.Валюты -
// * ВалютаРеглУчета - СправочникСсылка.Валюты -
// * Кратность - Число -
// * Курс - Число -
// * ПоказыватьВалюту - Булево -
// * ПоказыватьНДС - Булево -
// * ПоказыватьТипЦены - Булево -
// * ПринятьНДСКВычету - Булево -
// * ПринятьНДСКВычетуУказываетсяВСтроках - Булево -
// * СуммаВключаетНДС - Булево -
// * ТипЦены - СправочникСсылка.ТипыЦенНоменклатуры
// * УчитыватьНДС - Булево -
Функция ПредставлениеСтрокиЦенаНДСВалюта_Параметры() Экспорт
	ПараметрыПредставления = Новый Структура;
	ПараметрыПредставления.Вставить("ВалютаДокумента", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
	ПараметрыПредставления.Вставить("ВалютаРеглУчета", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
	ПараметрыПредставления.Вставить("Кратность", 0);
	ПараметрыПредставления.Вставить("Курс", 0);
	ПараметрыПредставления.Вставить("ПоказыватьВалюту", Ложь);
	ПараметрыПредставления.Вставить("ПоказыватьНДС", Ложь);
	ПараметрыПредставления.Вставить("ПоказыватьТипЦены", Ложь);
	ПараметрыПредставления.Вставить("ПринятьНДСКВычету", Ложь);
	ПараметрыПредставления.Вставить("ПринятьНДСКВычетуУказываетсяВСтроках", Ложь);
	ПараметрыПредставления.Вставить("СуммаВключаетНДС", Ложь);
	ПараметрыПредставления.Вставить("ТипЦены", ПредопределенноеЗначение("Справочник.ТипыЦенНоменклатуры.ПустаяСсылка"));
	ПараметрыПредставления.Вставить("УчитыватьНДС", Ложь);
	Возврат ПараметрыПредставления;
КонецФункции

// Представление строки цена НДС валюта.
// 
// Параметры:
//  ПараметрыПредставления - см. ПредставлениеСтрокиЦенаНДСВалюта_Параметры
// 
// Возвращаемое значение:
//  Строка
Функция ПредставлениеСтрокиЦенаНДСВалюта(ПараметрыПредставления) Экспорт
	Перем ПоказыватьНДС;
	Перем ПоказыватьВалюту;
	Перем ПоказыватьТипЦены;
	Перем ВалютаРеглУчета;
	Перем Курс;
	Перем Кратность;
	Перем УчитыватьНДС;
	Перем ПринятьНДСКВычету;
	
	ПараметрыПредставления.Свойство("ПоказыватьТипЦены", ПоказыватьТипЦены);
	ПараметрыПредставления.Свойство("ПоказыватьВалюту",  ПоказыватьВалюту);
	ПараметрыПредставления.Свойство("ПоказыватьНДС",     ПоказыватьНДС);
	ПараметрыПредставления.Свойство("УчитыватьНДС",      УчитыватьНДС);
	ПараметрыПредставления.Свойство("ПринятьНДСКВычету", ПринятьНДСКВычету);
	
	ЧастиПредставления = Новый Массив;
	
	Если ПоказыватьТипЦены = Истина Тогда
		
		ШаблонСтрокиЦен = НСтр("ru = 'Тип цен: %1'");
		Если ЗначениеЗаполнено(ПараметрыПредставления.ТипЦены) Тогда
			ТипЦены = Строка(ПараметрыПредставления.ТипЦены);
		Иначе
			ТипЦены = НСтр("ru = '<Не выбран>'");
		КонецЕсли;
		ЧастиПредставления.Добавить(СтрШаблон(ШаблонСтрокиЦен, ТипЦены));
		
	КонецЕсли;
	
	Если ПоказыватьВалюту = Истина Тогда
		
		Если ПараметрыПредставления.Свойство("Курс", Курс) И Курс <> 0 Тогда
			
			ПараметрыПредставления.Свойство("Кратность", Кратность);
			ПараметрыПредставления.Свойство("ВалютаРеглУчета", ВалютаРеглУчета);
			Если Не ЗначениеЗаполнено(ВалютаРеглУчета) Тогда
				ВалютаРеглУчета = ОбщегоНазначенияБГУВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
			КонецЕсли;
			Если ПараметрыПредставления.ВалютаДокумента = ВалютаРеглУчета Тогда
				ШаблонТекстаВалюты = НСтр("ru = 'Валюта: %1'");
			ИначеЕсли Кратность = 1 Тогда
				ШаблонТекстаВалюты = НСтр("ru = 'Валюта: %1 = %2 руб.'");
			Иначе
				ШаблонТекстаВалюты = НСтр("ru = 'Валюта: %3%1 = %2 руб.'");
			КонецЕсли;
			
		Иначе
			
			ШаблонТекстаВалюты = НСтр("ru = 'Валюта: %1'");
			
		КонецЕсли;
		
		ЧастиПредставления.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаВалюты,
				ПараметрыПредставления.ВалютаДокумента, Курс, Кратность));
		
	КонецЕсли;
	
	Если ПоказыватьНДС = Истина Тогда
		
		Если УчитыватьНДС = Ложь Тогда
			ПредставлениеНДС = НСТр("ru = 'НДС не учитывается'");
		Иначе
			
			ПринятьНДСКВычетуУказываетсяВСтроках = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				ПараметрыПредставления,
				"ПринятьНДСКВычетуУказываетсяВСтроках",
				Ложь);
			Если ПринятьНДСКВычетуУказываетсяВСтроках Или ПринятьНДСКВычету = Неопределено Тогда
				ПредставлениеПринятьНДСКВычету = "";
			ИначеЕсли ПринятьНДСКВычету Тогда
				ПредставлениеПринятьНДСКВычету = НСтр("ru = 'принимается к вычету'");
			Иначе
				ПредставлениеПринятьНДСКВычету = НСтр("ru = 'не принимается к вычету'");
			КонецЕсли;
				
			Если ПараметрыПредставления.СуммаВключаетНДС Тогда
				ПредставлениеСуммаВключаетНДС = НСтр("ru = 'включен в сумму'");
			Иначе
				ПредставлениеСуммаВключаетНДС = НСтр("ru = 'не включен в сумму'");
			КонецЕсли;
			
			Если ПредставлениеПринятьНДСКВычету = "" Тогда
				ПредставлениеНДС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСТр("ru = 'НДС %1'"), ПредставлениеСуммаВключаетНДС);
			Иначе
				ПредставлениеНДС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСТр("ru = 'НДС: %1, %2'"), ПредставлениеСуммаВключаетНДС, ПредставлениеПринятьНДСКВычету);
			КонецЕсли;
			
		КонецЕсли;
		
		ЧастиПредставления.Добавить(ПредставлениеНДС);
		
	КонецЕсли;
	
	Возврат СтрСоединить(ЧастиПредставления, "; ");

КонецФункции

Функция МодульЧисла(Число) Экспорт
	
	Возврат ?(Число < 0, -Число, Число);
	
КонецФункции

// Заменяет на NULL реквизиты проводок, отключенные признаками учета счета.
//
// Параметры:
//  Проводка		 - СтрокаТаблицыЗначений, ДанныеФормыСтруктура - описание колонок см. БухгалтерскийУчет.ОчиститьРеквизитыПроводокПоПризнакамУчета()
//  ПризнакиУчета	 - Структура - содержит ключи:
//    *УчетПоКПС - Булево -
//    *УчетПоКЭК - Булево -
//    *УчетПоПодразделениям - Булево -
//    *Валютный - Булево -
//    *Количественный - Булево -
//  СторонаПроводки	 - Строка - "Дт" или "Кт"
//
Процедура ОчиститьРеквизитыКорреспонденцииПроводкиПоПризнакамУчета(Проводка, ПризнакиУчета, СторонаПроводки) Экспорт

	Если Не ПризнакиУчета.УчетПоКПС Тогда
		Проводка["КПС" + СторонаПроводки] = Null;
	КонецЕсли;
	Если Не ПризнакиУчета.УчетПоКЭК Тогда
		Проводка["КЭК" + СторонаПроводки] = Null;
	КонецЕсли;
	Если Не ПризнакиУчета.УчетПоПодразделениям Тогда
		Проводка["Подразделение" + СторонаПроводки] = Null;
	КонецЕсли;
	Если Не ПризнакиУчета.Валютный Тогда
		Проводка["Валюта" + СторонаПроводки] = Null;
		Проводка["ВалютнаяСумма" + СторонаПроводки] = Null;
	КонецЕсли;
	Если Не ПризнакиУчета.Количественный Тогда
		Проводка["Количество" + СторонаПроводки] = Null;
	КонецЕсли;

КонецПроцедуры

#Область РаботаСНалоговымиРеквизитами

// Плучает значения налоговых реквизитов по их строковому представлению
//
// Параметры:
//  Объект - Структура, ДанныеФормыСтруктура, 
//
// Возвращаемое значение:
//  Структура, ключи:
//  	ПолеВводаГодПериода
//		ПолеВводаДатаПериода
//		ПолеВводаНомерПериода
//  	ПолеВводаПоказательДаты
//		ПолеВводаПоказательНомера
//		ПолеВводаПоказательОснования
//		ПолеВводаПоказательПериода
//		ПолеВводаПоказательТипа
//		ПолеВводаСтатусСоставителя
//		ПолеВводаКодТаможенногоОргана
//		ТипНалоговогоПериодаСтрокой
//
Функция ПолучитьЗначенияНалоговыхРеквизитов(Знач Объект) Экспорт
	
	Результат = Новый Структура;
	
	Если Объект.Свойство("СтатусСоставителя") Тогда
		Если ЗначениеЗаполнено(Объект.СтатусСоставителя) И СокрЛП(Объект.СтатусСоставителя) <> "0" Тогда
			Попытка
				Результат.Вставить("ПолеВводаСтатусСоставителя", ПредопределенноеЗначение("Перечисление.СтатусыСоставителя._"+СокрЛП(Объект.СтатусСоставителя)));
			Исключение
				Результат.Вставить("ПолеВводаСтатусСоставителя", ПредопределенноеЗначение("Перечисление.СтатусыСоставителя.ПустаяСсылка"));
			КонецПопытки;
		Иначе
			Результат.Вставить("ПолеВводаСтатусСоставителя", ПредопределенноеЗначение("Перечисление.СтатусыСоставителя.ПустаяСсылка"));
		КонецЕсли;
	КонецЕсли;	
	
	Если Объект.Свойство("ПоказательОснования") Тогда
		Если ЗначениеЗаполнено(Объект.ПоказательОснования) И СокрЛП(Объект.ПоказательОснования) <> "0" Тогда
			Попытка
				Результат.Вставить("ПолеВводаПоказательОснования", ПредопределенноеЗначение("Перечисление.ОснованияПлатежа." + СокрЛП(Объект.ПоказательОснования)));
			Исключение
				Результат.Вставить("ПолеВводаПоказательОснования", ПредопределенноеЗначение("Перечисление.ОснованияПлатежа.ПустаяСсылка"));
			КонецПопытки;
		Иначе
			Результат.Вставить("ПолеВводаПоказательОснования", ПредопределенноеЗначение("Перечисление.ОснованияПлатежа.ПустаяСсылка"));
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Свойство("ПоказательТипа") Тогда
		Если ЗначениеЗаполнено(Объект.ПоказательТипа) И СокрЛП(Объект.ПоказательТипа) <> "0" Тогда
			Попытка
				ПоказательТипаПеречисление = ПредопределенноеЗначение("Перечисление.ПоказателиТипа." + СокрЛП(Объект.ПоказательТипа));
				Если НЕ ЗначениеЗаполнено(ПоказательТипаПеречисление) Тогда
					Попытка
						ПоказательТипаПеречисление = ПредопределенноеЗначение("Перечисление.ПоказателиТипа." + "_" + СокрЛП(Объект.ПоказательТипа));
					Исключение
						ПоказательТипаПеречисление = Неопределено;
					КонецПопытки;
				КонецЕсли;	
			Исключение
				ПоказательТипаПеречисление = Неопределено;
			КонецПопытки;
			Результат.Вставить("ПолеВводаПоказательТипа", ПоказательТипаПеречисление);
		Иначе
			Результат.Вставить("ПолеВводаПоказательТипа", ПредопределенноеЗначение("Перечисление.ПоказателиТипа.ПустаяСсылка"));
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Свойство("ПоказательПериода") Тогда 
		Если ЗначениеЗаполнено(Объект.ПоказательПериода) И Объект.ПоказательПериода <> "0" Тогда
			
			Результат.Вставить("ПолеВводаКодТаможенногоОргана", Объект.ПоказательПериода);
			Результат.Вставить("ТипНалоговогоПериодаСтрокой", "");
			
			СоставПериода = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Объект.ПоказательПериода, ".");
			
			Если СоставПериода.Количество() = 3 Тогда
				
				Если ЗначениеЗаполнено(СоставПериода[0])
					И ЗначениеЗаполнено(СоставПериода[1])
					И ЗначениеЗаполнено(СоставПериода[2]) Тогда
					Попытка
						ПолеВводаДатаПериода = Дата(СоставПериода[2], СоставПериода[1], СоставПериода[0]);
					Исключение
						ПолеВводаДатаПериода = '00010101000000';
					КонецПопытки;
					
					Результат.Вставить("ПолеВводаДатаПериода", ПолеВводаДатаПериода);
					
					Если ЗначениеЗаполнено(ПолеВводаДатаПериода) Тогда
						Результат.Вставить("ПолеВводаПоказательПериода", ПредопределенноеЗначение("Перечисление.ПоказателиПериода.ДАТА"));
						Результат.Вставить("ПолеВводаНомерПериода", 0);
						Результат.Вставить("ПолеВводаГодПериода",   0);
						Результат.Вставить("ТипНалоговогоПериодаСтрокой", "ДАТА");
					Иначе
						Попытка
							Результат.Вставить("ПолеВводаПоказательПериода", ПредопределенноеЗначение("Перечисление.ПоказателиПериода." + СоставПериода[0]));
							Результат.Вставить("ТипНалоговогоПериодаСтрокой", СоставПериода[0]);
						Исключение
							Результат.Вставить("ПолеВводаПоказательПериода", ПредопределенноеЗначение("Перечисление.ПоказателиПериода.ПустаяСсылка"));
							Результат.Вставить("ТипНалоговогоПериодаСтрокой", "");
						КонецПопытки;
						Если ЗначениеЗаполнено(Результат.ПолеВводаПоказательПериода) Тогда
							Результат.Вставить("ПолеВводаНомерПериода", СоставПериода[1]);
							Результат.Вставить("ПолеВводаГодПериода",   СоставПериода[2]);
						Иначе
							Результат.Вставить("ПолеВводаНомерПериода", 0);
							Результат.Вставить("ПолеВводаГодПериода",   0);
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					Результат.Вставить("ПолеВводаПоказательПериода", ПредопределенноеЗначение("Перечисление.ПоказателиПериода.ПустаяСсылка"));
					Результат.Вставить("ТипНалоговогоПериодаСтрокой", "");
					Результат.Вставить("ПолеВводаДатаПериода", "");
					Результат.Вставить("ПолеВводаНомерПериода", 0);
					Результат.Вставить("ПолеВводаГодПериода",   0);
				КонецЕсли;
			Иначе
				Результат.Вставить("ПолеВводаПоказательПериода", ПредопределенноеЗначение("Перечисление.ПоказателиПериода.ПустаяСсылка"));
				Результат.Вставить("ТипНалоговогоПериодаСтрокой", "");
				Результат.Вставить("ПолеВводаДатаПериода", "");
				Результат.Вставить("ПолеВводаНомерПериода", 0);
				Результат.Вставить("ПолеВводаГодПериода",   0);
			КонецЕсли;	
		Иначе
			Результат.Вставить("ПолеВводаПоказательПериода", ПредопределенноеЗначение("Перечисление.ПоказателиПериода.ПустаяСсылка"));
			Результат.Вставить("ТипНалоговогоПериодаСтрокой", "");
			Результат.Вставить("ПолеВводаДатаПериода", "");
			Результат.Вставить("ПолеВводаНомерПериода", 0);
			Результат.Вставить("ПолеВводаГодПериода",   0);
		КонецЕсли;	
	КонецЕсли;
	
	Если Объект.Свойство("ПоказательНомера") Тогда
		Если Объект.ПоказательНомера <> "0" Тогда
			Результат.Вставить("ПолеВводаПоказательНомера", Объект.ПоказательНомера);
		Иначе
			Результат.Вставить("ПолеВводаПоказательНомера", "");
		КонецЕсли;	
	КонецЕсли;	
	
	Если Объект.Свойство("ПоказательДаты") Тогда
		Если ЗначениеЗаполнено(Объект.ПоказательДаты) И СокрЛП(Объект.ПоказательДаты) <> "0" Тогда
			СоставДаты = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(Объект.ПоказательДаты), ".");
			Если СоставДаты.Количество() = 3 
				И ЗначениеЗаполнено(СоставДаты[0])
				И ЗначениеЗаполнено(СоставДаты[1])
				И ЗначениеЗаполнено(СоставДаты[2]) Тогда
				Попытка
					Результат.Вставить("ПолеВводаПоказательДаты", Дата(СоставДаты[2], СоставДаты[1], СоставДаты[0]));
				Исключение
					Результат.Вставить("ПолеВводаПоказательДаты", "");
				КонецПопытки;
			Иначе
				Результат.Вставить("ПолеВводаПоказательДаты", "");
			КонецЕсли;
		Иначе
			Результат.Вставить("ПолеВводаПоказательДаты", "");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьВидимостьРеквизитовНалоговогоПериода(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Форма.ТаможенныйПлатеж Тогда
		Элементы.КодТаможенногоОргана.Видимость = Истина;
		Элементы.ПоказательНалоговогоПериода.Видимость = Ложь;
		Возврат;
	КонецЕсли;

	Элементы.КодТаможенногоОргана.Видимость = Ложь;
	Элементы.ПоказательНалоговогоПериода.Видимость = Истина;

	Если НЕ ЗначениеЗаполнено(Форма.ПолеВводаПоказательПериода) Тогда
		Элементы.ГруппаСтраницаДата.Видимость = Ложь;
		Возврат;
	КонецЕсли;
		
	Элементы.ГруппаСтраницаДата.Видимость = Истина;
	
	Если Форма.ПолеВводаПоказательПериода = ПредопределенноеЗначение("Перечисление.ПоказателиПериода.ДАТА") Тогда 
		Элементы.ГруппаСтраницаДата.ТекущаяСтраница = Элементы.ГруппаПлатежПоДате;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтраницаДата.ТекущаяСтраница = Элементы.ГруппаПлатежПоПериоду;
	
	Если Форма.ПолеВводаПоказательПериода =ПредопределенноеЗначение("Перечисление.ПоказателиПериода.ГД") Тогда
		Элементы.ПолеВводаНомерПериода.Видимость 			= Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ПолеВводаНомерПериода.Видимость 			= Истина;
	
	Если Форма.ПолеВводаПоказательПериода = ПредопределенноеЗначение("Перечисление.ПоказателиПериода.МС") Тогда
		Элементы.ПолеВводаНомерПериода.МинимальноеЗначение = 1;
		Элементы.ПолеВводаНомерПериода.МаксимальноеЗначение = 12;
		Элементы.ПолеВводаНомерПериода.Заголовок = "Месяц";
    ИначеЕсли Форма.ПолеВводаПоказательПериода = ПредопределенноеЗначение("Перечисление.ПоказателиПериода.КВ") Тогда
		Элементы.ПолеВводаНомерПериода.Заголовок = "Квартал";
		Элементы.ПолеВводаНомерПериода.МинимальноеЗначение = 1;
		Элементы.ПолеВводаНомерПериода.МаксимальноеЗначение = 4;
    ИначеЕсли Форма.ПолеВводаПоказательПериода = ПредопределенноеЗначение("Перечисление.ПоказателиПериода.ПЛ") Тогда
		Элементы.ПолеВводаНомерПериода.Заголовок = "Полугодие";
		Элементы.ПолеВводаНомерПериода.МинимальноеЗначение = 1;
		Элементы.ПолеВводаНомерПериода.МаксимальноеЗначение = 2;
 	КонецЕсли;
	
КонецПроцедуры	

Функция ПредставлениеНалоговыхРеквизитов(СтруктураРеквизитов, Разделитель = ", ") Экспорт
	
	СтрокаПредставления = "";
	
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		СтрокаПредставления = СтрокаПредставления + КлючИЗначение.Значение + Разделитель;
	КонецЦикла;
	
	СтрокаПредставления = ?(ЗначениеЗаполнено(СтрокаПредставления), СтрокаПредставления, "<...>");
	
	Возврат СтрокаПредставления;
	
КонецФункции

Функция НалоговыеРеквизитыПлатежногоДокумента(СтруктураРеквизитов) Экспорт
	
	Результат = Новый Структура;
	
	Если СтруктураРеквизитов.Свойство("СтатусСоставителя") Тогда
		
		Результат.Вставить("СтатусСоставителя", Лев(СтруктураРеквизитов.СтатусСоставителя, 2));
		
	КонецЕсли;   
	
	Если СтруктураРеквизитов.Свойство("ПоказательОснования") Тогда
		
		Результат.Вставить("ПоказательОснования",  Лев(СтрЗаменить(СтруктураРеквизитов.ПоказательОснования, "(с 01.01.2014 не используется) ", ""), 2));
		
	КонецЕсли;   
	
	Если СтруктураРеквизитов.Свойство("ПоказательНомера") Тогда
		
		Результат.Вставить("ПоказательНомера", СокрЛП(СтруктураРеквизитов.ПоказательНомера));
		
	КонецЕсли;   
	
	Если СтруктураРеквизитов.Свойство("ПоказательДаты") Тогда
		
		Если ЗначениеЗаполнено(СтруктураРеквизитов.ПоказательДаты) тогда
			Результат.Вставить("ПоказательДаты", СтруктураРеквизитов.ПоказательДаты);
		Иначе
			Результат.Вставить("ПоказательДаты", "");
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("ПоказательТипа") Тогда
		
		Результат.Вставить("ПоказательТипа", Лев(СтрЗаменить(СтруктураРеквизитов.ПоказательТипа, "(с 01.01.2014 не используется) ", ""), 2));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Процедура ОпределитьРеквизитыНалоговогоПериода(Знач НалоговыйПериод, Знач ТаможенныйПлатеж, Знач Дата, ЗначенияРеквизитов = Неопределено, ПересчитатьНомерПериода = Ложь) Экспорт
	
	Если ЗначенияРеквизитов = Неопределено Тогда
		
		ЗначенияРеквизитов = Новый Структура("ПоказательПериода, ПолеВводаГодПериода, ПолеВводаНомерПериода, ПолеВводаДатаПериода, ПолеВводаКодТаможенногоОргана");
		
	КонецЕсли;	
	
	Если ТаможенныйПлатеж Тогда
		
		ЗначенияРеквизитов.ПоказательПериода = ЗначенияРеквизитов.ПолеВводаКодТаможенногоОргана;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(НалоговыйПериод) Тогда	
	
		ЗначенияРеквизитов.ПоказательПериода = "";
		
	Иначе	
		
		Если НалоговыйПериод = ПредопределенноеЗначение("Перечисление.ПоказателиПериода.ДАТА") Тогда
			Если НЕ ЗначениеЗаполнено(ЗначенияРеквизитов.ПолеВводаДатаПериода) Тогда
				ЗначенияРеквизитов.ПолеВводаДатаПериода = Дата;	
			КонецЕсли;
			
			ЗначенияРеквизитов.ПоказательПериода = Строка(ЗначенияРеквизитов.ПолеВводаДатаПериода);
			
		Иначе
			Если НЕ ЗначениеЗаполнено(ЗначенияРеквизитов.ПолеВводаГодПериода) Тогда
				ЗначенияРеквизитов.ПолеВводаГодПериода = ?(ЗначениеЗаполнено(ЗначенияРеквизитов.ПолеВводаДатаПериода), Год(ЗначенияРеквизитов.ПолеВводаДатаПериода), Год(Дата));
			КонецЕсли;
			
			Если НалоговыйПериод = ПредопределенноеЗначение("Перечисление.ПоказателиПериода.ГД") Тогда
				
				ЗначенияРеквизитов.ПолеВводаНомерПериода = 0;
				
			Иначе
				
				Если ЗначенияРеквизитов.ПолеВводаНомерПериода = Неопределено
					ИЛИ (НалоговыйПериод = ПредопределенноеЗначение("Перечисление.ПоказателиПериода.ПЛ") И ЗначенияРеквизитов.ПолеВводаНомерПериода > 2) 
					ИЛИ (НалоговыйПериод = ПредопределенноеЗначение("Перечисление.ПоказателиПериода.КВ") И ЗначенияРеквизитов.ПолеВводаНомерПериода > 4) Тогда
					ЗначенияРеквизитов.ПолеВводаНомерПериода = 0;
				КонецЕсли;	
				
				Если НЕ ЗначениеЗаполнено(ЗначенияРеквизитов.ПолеВводаНомерПериода) ИЛИ 
					(НалоговыйПериод = ПредопределенноеЗначение("Перечисление.ПоказателиПериода.МС") И ПересчитатьНомерПериода)  Тогда
					
					НомерМесяца = ?(ЗначениеЗаполнено(ЗначенияРеквизитов.ПолеВводаДатаПериода), Месяц(ЗначенияРеквизитов.ПолеВводаДатаПериода), Месяц(Дата));
					
					ЗначенияРеквизитов.ПолеВводаНомерПериода = ?(НалоговыйПериод = ПредопределенноеЗначение("Перечисление.ПоказателиПериода.МС"), НомерМесяца, 
					?(НалоговыйПериод = ПредопределенноеЗначение("Перечисление.ПоказателиПериода.ПЛ"), ?(НомерМесяца / 6 > 1, 2, 1), Цел((НомерМесяца - 1) / 3) + 1));
					
				КонецЕсли;
			КонецЕсли;

            ЗначенияРеквизитов.ПоказательПериода = Лев(НалоговыйПериод, 2) + "." + Формат(ЗначенияРеквизитов.ПолеВводаНомерПериода, "ЧЦ=2; ЧН=; ЧВН=") + "." + Формат(ЗначенияРеквизитов.ПолеВводаГодПериода, "ЧЦ=4; ЧГ=");
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры	

Функция ОКАТООКТМОПоДате(Дата, КодОКАТО, КодОКТМО) Экспорт
	
	Если Дата >= Дата(2014, 1, 1) И ЗначениеЗаполнено(КодОКТМО) Тогда
		
		Возврат КодОКТМО;
		
	КонецЕсли;	
	
	Возврат  КодОКАТО
	
КонецФункции	

Процедура ЗаполнитьНезаполненныеНалоговыеРеквизиты(Объект, СписокРеквизитов = Неопределено, ЗаполнятьНулем = Истина, Дата = неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		#Если Клиент Тогда
		Дата = ТекущаяДата();
		#Иначе
		Дата = ТекущаяДатаСеанса();
		#КонецЕсли
	КонецЕсли;	
	
	//На основании  письма-разъяснения Банка России от 30.12.2014 № 234-Т оставляем
	//заполнение незаполненного поля 110 нулем до специальных указаний
	//
	//НеИспользоватьПоказательТипа = Дата > Дата(2015,1,1); 
	
	НеИспользоватьПоказательТипа = Ложь;

	Если СписокРеквизитов = Неопределено Тогда 
		СписокРеквизитов = Новый Массив;
		СписокРеквизитов.Добавить("КодБКНалога");
		СписокРеквизитов.Добавить("КодОКАТО");	
		СписокРеквизитов.Добавить("ПоказательОснования");	 
		СписокРеквизитов.Добавить("ПоказательПериода");	 
		СписокРеквизитов.Добавить("ПоказательТипа");
		СписокРеквизитов.Добавить("ПоказательНомера"); 
		СписокРеквизитов.Добавить("ПоказательДаты");	
		СписокРеквизитов.Добавить("СтатусСоставителя");
	ИначеЕсли ТипЗнч(СписокРеквизитов) = Тип("Строка") Тогда
		СписокРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокРеквизитов);
	КонецЕсли;
	
	Если НеИспользоватьПоказательТипа Тогда
		
		ИндексПоказательТипа = СписокРеквизитов.Найти("ПоказательТипа");
		
		Если НЕ ИндексПоказательТипа = Неопределено Тогда
			
			СписокРеквизитов.Удалить(ИндексПоказательТипа);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ИмяРеквизита Из СписокРеквизитов Цикл
		
		Если НЕ ЗначениеЗаполнено(Объект[ИмяРеквизита]) Или Объект[ИмяРеквизита] = "0" Тогда
				
		    	Объект[ИмяРеквизита] = ?(ЗаполнятьНулем И НЕ(ИмяРеквизита = "ПоказательТипа"), "0", "");
				
		КонецЕсли;	
		
	КонецЦикла	
		
КонецПроцедуры

#КонецОбласти

 #Область УстаревшиеПроцедурыИФункции
	
// Устарела. Следует использовать БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(...).
// Процедура установки типа и доступности субконто в зависимости от выбранного счета.
//
Процедура ПриВыбореСчета(Счет, Форма, ПоляФормы, ЗаголовкиПолей = Неопределено, ЭтоТаблица = Ложь) Экспорт
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
	Для Индекс = 1 По 3 Цикл
		Если Индекс <= ДанныеСчета.КоличествоСубконто Тогда
			Если Не ЭтоТаблица Тогда
				Если ЗаголовкиПолей.Свойство("Субконто" + Индекс) Тогда
					Форма[ЗаголовкиПолей["Субконто" + Индекс]] = ДанныеСчета["ВидСубконто" + Индекс + "Наименование"] + ":";
				КонецЕсли;
				Если СубконтоЗаполняетсяАвтоматически(Счет, Индекс) Тогда
					Форма.Элементы[ПоляФормы["Субконто" + Индекс]].Доступность = Ложь;
					Форма.Элементы[ПоляФормы["Субконто" + Индекс]].ПодсказкаВвода = "<авто>";
				ИначеЕсли ПоляФормы.Свойство("Субконто" + Индекс) Тогда
					Форма.Элементы[ПоляФормы["Субконто" + Индекс]].Доступность = Истина;
				КонецЕсли;
			КонецЕсли;
		Иначе 
			// Ничего делать не надо, т.к. не доступные поля будут скрыты
			Если Не ЭтоТаблица Тогда
				Если ЗаголовкиПолей.Свойство("Субконто" + Индекс) Тогда
					Форма[ЗаголовкиПолей["Субконто" + Индекс]] = "";
				КонецЕсли;
				Если ПоляФормы.Свойство("Субконто" + Индекс) Тогда
					Форма.Элементы[ПоляФормы["Субконто" + Индекс]].Доступность = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЭтоТаблица Тогда
		Если ЗаголовкиПолей.Свойство("Подразделение") Тогда
			Форма[ЗаголовкиПолей["Подразделение"]] = ?(ДанныеСчета.УчетПоПодразделениям, "Подразделение:", "");
		КонецЕсли;
		Если ПоляФормы.Свойство("Подразделение") Тогда
			Форма.Элементы[ПоляФормы["Подразделение"]].Доступность = ДанныеСчета.УчетПоПодразделениям;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Устарела. Следует использовать БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(...).
// Процедура установки типа и доступности субконто в зависимости от выбранного счета
//
Процедура ПриИзмененииСчета(Счет, Объект, ПоляОбъекта, ЭтоТаблица = Ложь) Экспорт
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
	Для Индекс = 1 По 3 Цикл
		Если Индекс <= ДанныеСчета.КоличествоСубконто Тогда
			Если ПоляОбъекта.Свойство("Субконто" + Индекс) Тогда
				Если ЭтоТаблица Тогда
					Объект[ПоляОбъекта["Субконто" + Индекс] + "Доступность"] = Истина;
				КонецЕсли;	
			КонецЕсли;
		Иначе 
			Если ПоляОбъекта.Свойство("Субконто" + Индекс) Тогда
				Объект[ПоляОбъекта["Субконто" + Индекс]] = Неопределено;
				Если ЭтоТаблица Тогда
					Объект[ПоляОбъекта["Субконто" + Индекс] + "Доступность"] = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПоляОбъекта.Свойство("Подразделение") Тогда
		Если ДанныеСчета.УчетПоПодразделениям Тогда
			Если ЭтоТаблица Тогда
				Объект[ПоляОбъекта["Подразделение"] + "Доступность"] = Истина;
			КонецЕсли;
		Иначе
			Объект[ПоляОбъекта.Подразделение] = Неопределено;
			Если ЭтоТаблица Тогда
				Объект[ПоляОбъекта["Подразделение"] + "Доступность"] = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Устарела. Следует использовать БухгалтерскийУчет.СчетПоКоду
//
Функция СчетПоКоду(КодСчета, Знач НаДату = Неопределено, Знач Организация = Неопределено) Экспорт
	
	Возврат БухгалтерскийУчетВызовСервера.СчетПоКоду(КодСчета, НаДату, Организация);
	
КонецФункции

// Устарела. Следует использовать БухгалтерскийУчет.СписокСчетов
// 
Функция СписокСчетов(Счета, Знач НаДату = Неопределено, БезУчетаИерархии = Ложь, Знач Организация = Неопределено) Экспорт
	
	Возврат БухгалтерскийУчетВызовСервера.СписокСчетов(Счета, НаДату, БезУчетаИерархии, Организация);
	
КонецФункции

// Устарела. Следует использовать БухгалтерскийУчет.СчетВИерархии
// Проверяет принадлежность счета иерархии, заданной параметром Эталон.
//
// Параметры:
//	Счет - ПланСчетовСсылка - счет, который необходимо проверить.
//	Эталон - Строка, Массив, ПланСчетовСсылка - иерархия счетов.
//
// Пример:
//	БухгалтерскийУчетКлиентСервер.СчетВИерархии(Счет, "206.00, 302.00")
// 
// Возвращаемое значение:
//	Булево
// 
Функция СчетВИерархии(Счет, Эталон) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Счет) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипЗнчЭталон = ТипЗнч(Эталон);
	Если ТипЗнчЭталон = Тип("Строка") Тогда
		
		Возврат (БухгалтерскийУчетВызовСервераПовтИсп.СписокСчетов(Эталон).Найти(Счет) <> Неопределено);
		
	ИначеЕсли ТипЗнчЭталон = Тип("СписокЗначений") Тогда // Приведем к простому типу для кэширования.
		
		СчетаКэш = Новый Структура;
		Для Каждого Счет Из Эталон Цикл
			СчетаКэш.Вставить("Счет" + Эталон.Индекс(Счет), Счет.Значение);
		КонецЦикла;
		Возврат (БухгалтерскийУчетВызовСервераПовтИсп.СписокСчетов(СчетаКэш).Найти(Счет) <> Неопределено);
		
	ИначеЕсли ТипЗнчЭталон = Тип("Массив") Тогда // Приведем к простому типу для кэширования.
		
		СчетаКэш = Новый Структура;
		Для Индекс = 0 По Эталон.Количество() - 1 Цикл
			СчетаКэш.Вставить("Счет" + Индекс, Эталон[Индекс]);
		КонецЦикла;
		Возврат (БухгалтерскийУчетВызовСервераПовтИсп.СписокСчетов(СчетаКэш).Найти(Счет) <> Неопределено);
		
	ИначеЕсли ТипЗнчЭталон = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
		
		Возврат Счет = Эталон ИЛИ Счет.ПринадлежитЭлементу(Эталон);
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти   

 #Область СлужебныеПроцедурыИФункции

Функция СубконтоЗаполняетсяАвтоматически(Счет, НомерСубконто, Знач СвойстваСчета = Неопределено)
	
	Если СвойстваСчета = Неопределено Тогда
		СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	КонецЕсли;
	
	ВидСубконто = СвойстваСчета["ВидСубконто" + НомерСубконто];
	Если ВидСубконто = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.Партии")
	   И БухгалтерскийУчетКлиентСервер.СчетВИерархии(Счет, "105.00") Тогда
		// Партионный учет на счетах 105.ХХ ведется автоматически, субконто "Партии" не нужно указывать.
		Возврат Истина;
	ИначеЕсли ВидСубконто = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ДокументыРасчетов")
	   И БухгалтерскийУчетКлиентСервер.СчетВИерархии(Счет, "206.00") Тогда
		// В случае аванса поставщику документом расчетов будет являться сам документ аванса.
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ДополнитьПредставлениеКоличественногоСубконто(ЗначениеСубконто, ПредставлениеСубконто, СвойстваСчета, ПараметрыОбъекта)
	
	Если НЕ СвойстваСчета.Количественный Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПараметрыОбъекта.Свойство("Количество") ИЛИ ПараметрыОбъекта.Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗначениеСубконто) ИЛИ ТипЗнч(ЗначениеСубконто) <> Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеСубконто = ПредставлениеСубконто
		+ " ("
		+ Строка(ПараметрыОбъекта.Количество)
		+ ?(ПараметрыОбъекта.Свойство("ЕдиницаИзмерения") И ЗначениеЗаполнено(ПараметрыОбъекта.ЕдиницаИзмерения),
				" " + Строка(ПараметрыОбъекта.ЕдиницаИзмерения),
				"")
		+ ")";
	
КонецПроцедуры

// Конструктор свойств счета и аналитики счета, используемых для установки параметров выбора субконто.
// 
// Возвращаемое значение:
//  Структура - Имена полей формы:
// * ПоляФормы - Структура:
//   ** Субконто1 - Строка
//   ** Субконто2 - Строка
//   ** Субконто3 - Строка
// * ПоляОбъекта - Структура - Имена полей объекта:
//   ** СчетУчета - Строка
//   ** Субконто1 - Строка
//   ** Субконто2 - Строка
//   ** Субконто3 - Строка
// * ДопРеквизиты - Структура
//
Функция НовыеПараметрыУстановкиСвойствСубконто()
	
	Результат = Новый Структура;
	
	ПоляФормы = Новый Структура;
	ПоляФормы.Вставить("Субконто1");
	ПоляФормы.Вставить("Субконто2");
	ПоляФормы.Вставить("Субконто3");
	Результат.Вставить("ПоляФормы", ПоляФормы);
	
	ПоляОбъекта = Новый Структура;
	ПоляОбъекта.Вставить("СчетУчета", "СчетУчета");
	ПоляОбъекта.Вставить("Субконто1");
	ПоляОбъекта.Вставить("Субконто2");
	ПоляОбъекта.Вставить("Субконто3");
	Результат.Вставить("ПоляОбъекта", ПоляОбъекта);
	
	ДопРеквизиты = Новый Структура;
	Результат.Вставить("ДопРеквизиты", ДопРеквизиты);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеУстановкиПараметровСубконто(Объект, ПараметрыУстановки)
	
	Результат = Новый Структура;
	
	ПоляОбъекта  = ПараметрыУстановки.ПоляОбъекта;
	ДопРеквизиты = ПараметрыУстановки.ДопРеквизиты;
	
	Для Индекс = 1 По 3 Цикл
		Если НЕ ЗначениеЗаполнено(ПоляОбъекта["Субконто" + Индекс]) Тогда
			Продолжить;
		КонецЕсли;
		ЗначениеСубконто = Объект[ПоляОбъекта["Субконто" + Индекс]];
		ТипСубконто = ТипЗнч(ЗначениеСубконто);
		Если ТипСубконто = Тип("СправочникСсылка.Контрагенты") Тогда
			Результат.Вставить("Контрагент", ЗначениеСубконто);
		ИначеЕсли ТипСубконто = Тип("СправочникСсылка.ВидыНалоговИПлатежей") Тогда
			Результат.Вставить("ВидНалогаИлиПлатежа", ЗначениеСубконто);
		ИначеЕсли ТипСубконто = Тип("СправочникСсылка.ВидыДенежныхДокументов") Тогда
			Результат.Вставить("ВидДенежногоДокумента", ЗначениеСубконто);
		ИначеЕсли ТипСубконто = Тип("СправочникСсылка.БСО") Тогда
			Результат.Вставить("БСО", ЗначениеСубконто);
		КонецЕсли;
		Если Индекс = 1 Тогда
			Результат.Вставить("Субконто1", ЗначениеСубконто);
		КонецЕсли;
	КонецЦикла;
	Результат.Вставить("СчетУчета", Объект[ПоляОбъекта.СчетУчета]);
	
	Для каждого ДопРеквизит Из ДопРеквизиты Цикл
		Результат.Вставить(ДопРеквизит.Ключ, ДопРеквизит.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьПараметрыВыбораСубконто(Форма, Объект, ПараметрыУстановки, ДанныеОбъекта)
	
	Элементы = Форма.Элементы;
	
	ПоляОбъекта = ПараметрыУстановки.ПоляОбъекта;
	ПоляФормы   = ПараметрыУстановки.ПоляФормы;
	
	ВидыПараметров = Новый Соответствие;
	ДобавитьВидыПараметровСвязьПоОрганизации(ВидыПараметров);
	
	ВидыПараметров.Вставить(Тип("СправочникСсылка.Договоры"), 					"Договоры");
	ВидыПараметров.Вставить(Тип("СправочникСсылка.РазделыЛицевыхСчетов"), 		"РазделыЛицевыхСчетов");
	ВидыПараметров.Вставить(Тип("СправочникСсылка.НалогиИПлатежиОрганизации"), 	"НалогиИПлатежиОрганизации");
	ВидыПараметров.Вставить(Тип("СправочникСсылка.ДенежныеДокументы"), 			"ДенежныеДокументы");
	ВидыПараметров.Вставить(Тип("СправочникСсылка.РасходыУСН"), 				"РасходыУСН");
	ВидыПараметров.Вставить(Тип("СправочникСсылка.ДополнительнаяБюджетнаяКлассификация"),
		"ДополнительнаяБюджетнаяКлассификация");
	ВидыПараметров.Вставить(Тип("СправочникСсылка.СерииБСО"), 					"СерииБСО");
	ВидыПараметров.Вставить(Тип("СправочникСсылка.Субконто"), 					"Субконто");
	
	Для Индекс = 1 По 3 Цикл
		Если НЕ ЗначениеЗаполнено(ПоляФормы["Субконто" + Индекс])
			ИЛИ НЕ ЗначениеЗаполнено(ПоляОбъекта["Субконто" + Индекс]) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементФормыСубконто = Элементы.Найти(ПоляФормы["Субконто" + Индекс]);
		Если ЭлементФормыСубконто = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТипСубконто   = ТипЗнч(Объект[ПоляОбъекта["Субконто" + Индекс]]);
		ВидПараметров = ВидыПараметров[ТипСубконто];
		Если ВидПараметров <> Неопределено Тогда
			
			МассивПараметров = Новый Массив();
			Если ВидПараметров = "Организация" Тогда
				Если ДанныеОбъекта.Свойство("Организация") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Организация", ДанныеОбъекта.Организация));
				КонецЕсли;
			ИначеЕсли ВидПараметров = "Владелец" Тогда
				Если ДанныеОбъекта.Свойство("Организация") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ДанныеОбъекта.Организация));
				КонецЕсли;
			ИначеЕсли ВидПараметров = "Договоры" Тогда
				Если ДанныеОбъекта.Свойство("Организация") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Организация", ДанныеОбъекта.Организация));
				КонецЕсли;
				Если ДанныеОбъекта.Свойство("Контрагент") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Контрагент", ДанныеОбъекта.Контрагент));
				КонецЕсли;
			ИначеЕсли ВидПараметров = "РазделыЛицевыхСчетов" Тогда
				Если ДанныеОбъекта.Свойство("Организация") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Организация", ДанныеОбъекта.Организация));
				КонецЕсли;
			ИначеЕсли ВидПараметров = "НалогиИПлатежиОрганизации" Тогда
				Если ДанныеОбъекта.Свойство("Организация") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ДанныеОбъекта.Организация));
				КонецЕсли;
				Если ДанныеОбъекта.Свойство("ВидНалогаИлиПлатежа") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ВидНалогаИлиПлатежа", ДанныеОбъекта.ВидНалогаИлиПлатежа));
				КонецЕсли;
			ИначеЕсли ВидПараметров = "ДенежныеДокументы" Тогда
				Если ДанныеОбъекта.Свойство("ВидДенежногоДокумента") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ДанныеОбъекта.ВидДенежногоДокумента));
				КонецЕсли;
			ИначеЕсли ВидПараметров = "РасходыУСН" Тогда
				Если ДанныеОбъекта.Свойство("СчетУчета") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Счет", ДанныеОбъекта.СчетУчета));
				КонецЕсли;
				Если ДанныеОбъекта.Свойство("Субконто1") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Субконто1", ДанныеОбъекта.Субконто1));
				КонецЕсли;
			ИначеЕсли ВидПараметров = "ДополнительнаяБюджетнаяКлассификация" Тогда
				Если ДанныеОбъекта.Свойство("КПС") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("КПС", ДанныеОбъекта.КПС));
				КонецЕсли;
				Если ДанныеОбъекта.Свойство("КЭК") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("КЭК", ДанныеОбъекта.КЭК));
				КонецЕсли;
			ИначеЕсли ВидПараметров = "СерииБСО" Тогда
				Если ДанныеОбъекта.Свойство("БСО") Тогда
					МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ДанныеОбъекта.БСО));
				КонецЕсли;
			ИначеЕсли ВидПараметров = "Субконто" И ДанныеОбъекта.Свойство("СчетУчета") Тогда
				СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ДанныеОбъекта.СчетУчета);
				МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Владелец", СвойстваСчета["ВидСубконто" + Индекс]));
			КонецЕсли;
			
			Если МассивПараметров.Количество() > 0 Тогда
				ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
				ЭлементФормыСубконто.ПараметрыВыбора = ПараметрыВыбора;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьСубконтоПриИзмененииСубконто(Объект, ПараметрыУстановки, НомерСубконто)
	
	ТипыСубконтоДляОчистки = ТипыСубконтоДляОчисткиПриИзмененииСубконто();
	
	ПоляОбъекта = ПараметрыУстановки.ПоляОбъекта;
	
	Для Индекс = НомерСубконто + 1 По 3 Цикл
		
		Если НЕ ЗначениеЗаполнено(ПоляОбъекта["Субконто" + Индекс]) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = ПоляОбъекта["Субконто" + Индекс];

		Если ЗначениеЗаполнено(ИмяПоля)
			И ЗначениеЗаполнено(Объект[ИмяПоля]) Тогда
			ТипПоля = ТипЗнч(Объект[ИмяПоля]);
			Если ТипыСубконтоДляОчистки[ТипПоля] <> Неопределено Тогда
				Объект[ИмяПоля] = Новый (ТипПоля);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьВидыПараметровСвязьПоОрганизации(ВидыПараметров)

	ТипыСубконтоСвязанныеСОрганизацией = БухгалтерскийУчетВызовСервераПовтИсп.ТипыСубконтоСвязанныеСОрганизацией();
	ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ВидыПараметров, ТипыСубконтоСвязанныеСОрганизацией, Истина);

КонецПроцедуры

Функция ТипыСубконтоДляОчисткиПриИзмененииСубконто()
	
	ТипыСубконтоДляОчистки = Новый Соответствие;
	ТипыСубконтоДляОчистки.Вставить(Тип("СправочникСсылка.Договоры"), Истина);
	ТипыСубконтоДляОчистки.Вставить(Тип("СправочникСсылка.НалогиИПлатежиОрганизации"), Истина);
	ТипыСубконтоДляОчистки.Вставить(Тип("СправочникСсылка.ДенежныеДокументы"), Истина);
	ТипыСубконтоДляОчистки.Вставить(Тип("СправочникСсылка.РасходыУСН"), Истина);
	ТипыСубконтоДляОчистки.Вставить(Тип("СправочникСсылка.СерииБСО"), Истина);
	
	Возврат ТипыСубконтоДляОчистки;

КонецФункции

#КонецОбласти

