#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗащитаПерсональныхДанных") Тогда
		МодульЗащитаПерсональныхДанных = ОбщегоНазначения.ОбщийМодуль("ЗащитаПерсональныхДанных");
		МодульЗащитаПерсональныхДанных.ДобавитьКомандуПечатиСогласияНаОбработкуПерсональныхДанных(КомандыПечати);
	КонецЕсли;
	
КонецПроцедуры
	
// Возвращает контактную информацию физического лица в виде структуры,
// где ключ - имя вида контактной информации (предопределенного элемента справочника
// "Виды контактной информации".
//
// Параметры:
//  ФизЛицо - СправочникСсылка.ФизическиеЛица
//  СтруктураДанных - структура, где ключ - вид контактной информации
//
Процедура ПолучитьКИФизЛица(ФизЛицо,ТребуемыеДанные) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	СписокВидовКИ = Новый СписокЗначений;
	Для каждого КлючЗначение из ТребуемыеДанные Цикл
		ТекПараметр = КлючЗначение.Ключ;
		Попытка
		СписокВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации[ТекПараметр],ТекПараметр);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	ОтборПоВидам = Ложь;
	Если СписокВидовКИ.Количество() > 0 Тогда
		ОтборПоВидам = Истина;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектСсылка", ФизЛицо); 
	Запрос.УстановитьПараметр("СписокВидовКИ", СписокВидовКИ);
	Запрос.УстановитьПараметр("ОтборПоВидам", Истина);
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Ссылка = &ОбъектСсылка
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоВидам
	               |				ТОГДА КонтактнаяИнформация.Вид В (&СписокВидовКИ)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ" ;
			
	Запрос.Текст = ТекстЗапроса;		
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если ОтборПоВидам Тогда
		Для Каждого СтрокаСписка Из СписокВидовКИ Цикл
			ТекВидКИ    = СтрокаСписка.Значение;
			ТекПараметр = СтрокаСписка.Представление;
			
			НайденнаяСтрока = ТаблицаЗапроса.Найти(ТекВидКИ,"Вид");
			Если НайденнаяСтрока <> Неопределено Тогда
				ТребуемыеДанные.Вставить(ТекПараметр, НайденнаяСтрока.Представление);
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		Для Каждого СтрокаТаблицы Из ТаблицаЗапроса Цикл
			ТребуемыеДанные.Вставить(СтрокаТаблицы.Вид, СтрокаТаблицы.Представление);		
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

// Возвращает ФИО физлица на указанную дату
//
Функция ФИОФизлица(ФизлицоСсылка, Знач Дата = Неопределено) Экспорт
	
	ФИО = "";
	
	Если НЕ ЗначениеЗаполнено(ФизлицоСсылка) Тогда
		Возврат ФИО;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ФИОФизическихЛицСрезПоследних.Фамилия,
	|	ФИОФизическихЛицСрезПоследних.Имя,
	|	ФИОФизическихЛицСрезПоследних.Отчество
	|ИЗ
	|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&Дата, ФизическоеЛицо = &ФизлицоСсылка) КАК ФИОФизическихЛицСрезПоследних");
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ФизлицоСсылка", ФизлицоСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ФИО = Выборка.Фамилия + " " + Выборка.Имя + " " + Выборка.Отчество;
		
	КонецЕсли;
	
	Возврат ФИО;
	
КонецФункции	

Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	МассивРедактируемыхРеквизитов = Новый Массив;
	МассивРедактируемыхРеквизитов.Добавить("ДатаРождения");
	МассивРедактируемыхРеквизитов.Добавить("Пол");
	МассивРедактируемыхРеквизитов.Добавить("Родитель");
	Возврат МассивРедактируемыхРеквизитов;	
КонецФункции

Функция ГражданствоФизЛица(ФизЛицо, ДатаЗначения = Неопределено) Экспорт 
	
	Если ДатаЗначения = Неопределено Тогда
		 ДатаЗначения = ТекущаяДатаСеанса();
	КонецЕсли;	 
	
	Гражд = РегистрыСведений.ГражданствоФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо", ФизЛицо));
	
	Если Гражд.Количество() > 0 Тогда
		Возврат Гражд[0].Страна;
	Иначе
		Возврат Справочники.СтраныМира.Россия;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет данные регистра ФИОФизическихЛиц для элементов
// для которых не существует ни одной записи
//
Процедура ЗаполнитьФИОФизическихЛиц() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.Ссылка,
	               |	ФизическиеЛица.Наименование
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	               |		ПО ФизическиеЛица.Ссылка = ФИОФизическихЛиц.ФизическоеЛицо
	               |ГДЕ
	               |	ФизическиеЛица.ЭтоГруппа = ЛОЖЬ
	               |	И ФИОФизическихЛиц.ФизическоеЛицо ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Выборка.Наименование, " ");
	
		Если МассивФИО.Количество() > 0 Тогда
			НоваяЗапись = РегистрыСведений.ФИОФизическихЛиц.СоздатьМенеджерЗаписи();
			НоваяЗапись.Период = '19800101';
			НоваяЗапись.ФизическоеЛицо = Выборка.Ссылка;
			НоваяЗапись.Фамилия  = МассивФИО[0];
			Если МассивФИО.Количество() > 1 Тогда
				НоваяЗапись.Имя      = МассивФИО[1];
			КонецЕсли;
			Если МассивФИО.Количество() > 2 Тогда
				НоваяЗапись.Отчество = МассивФИО[2];
			КонецЕсли;
			НоваяЗапись.Записать(Ложь);
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры


#КонецОбласти

#КонецЕсли