#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	МассивКУдалению = Новый Массив;
	Для Каждого СтрТЧ Из СоставПакета Цикл		
		Если НЕ ЗначениеЗаполнено(СтрТЧ.Начисление) Тогда
			МассивКУдалению.Добавить(СтрТЧ);
		Иначе
			Если ТипЗнч(СтрТЧ.Начисление) = Тип("ДокументСсылка.КвитанцияНаОплатуГосуслуг") Тогда
				СтрТЧ.ИдСущности = "N_"+Строка(СтрТЧ.Начисление.УникальныйИдентификатор());
			ИначеЕсли ТипЗнч(СтрТЧ.Начисление) = Тип("ДокументСсылка.НачислениеОтПодведомственного") Тогда
				СтрТЧ.ИдСущности = СтрТЧ.Начисление.ИД_Начисления;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлМас Из МассивКУдалению Цикл
		СоставПакета.Удалить(ЭлМас);	
	КонецЦикла;
	
	КоличествоНачислений = СоставПакета.Количество();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
