#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

Функция ТекстЗапросаШапкиДляПечатиТребованияНакладной0510451() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПринятиеКУчетуОбъектовОС.Ссылка КАК Ссылка,
	|	ПринятиеКУчетуОбъектовОС.Номер КАК Номер,
	|	ПринятиеКУчетуОбъектовОС.Дата КАК Дата,
	|	ПринятиеКУчетуОбъектовОС.Организация КАК Организация,
	|	"""" КАК НаименованиеСтруктурногоПодразделения,
	|	ПринятиеКУчетуОбъектовОС.ПодразделениеОтправитель.Наименование КАК НаименованиеОтправитель,
	|	ПринятиеКУчетуОбъектовОС.ЦМООтправитель.Сотрудник КАК СотрудникОтправитель,
	|	ПринятиеКУчетуОбъектовОС.ЦМООтправитель.МестоХранения КАК МестоХраненияОтправитель,
	|	ПринятиеКУчетуОбъектовОС.Подразделение.Наименование КАК НаименованиеПолучатель,
	|	ПринятиеКУчетуОбъектовОС.ЦМО.Сотрудник КАК СотрудникПолучатель,
	|	ПринятиеКУчетуОбъектовОС.ЦМО.МестоХранения КАК МестоХраненияПолучатель,
	|	ПринятиеКУчетуОбъектовОС.ОснованиеДляАкта КАК ДокументОснование,
	|	ПринятиеКУчетуОбъектовОС.НомерОснованияДляАкта КАК ДокументОснованиеНомер,
	|	ПринятиеКУчетуОбъектовОС.ДатаОснованияДляАкта КАК ДокументОснованиеДата,
	|	ПринятиеКУчетуОбъектовОС.Затребовал КАК Затребовал,
	|	ПринятиеКУчетуОбъектовОС.ОтпускРазрешил КАК ОтпускРазрешил,
	|	ПринятиеКУчетуОбъектовОС.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель,
	|	ПринятиеКУчетуОбъектовОС.ИФО КАК ИФО,
	|	ПринятиеКУчетуОбъектовОС.Руководитель КАК УполномоченноеЛицо,
	|	ИСТИНА КАК СуммаУказанаВДокументе
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС КАК ПринятиеКУчетуОбъектовОС
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОС.Ссылка В(&МассивОбъектов)
	|	И НЕ ПринятиеКУчетуОбъектовОС.ВидПоступления В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПринятиеКУчетуОбъектовОС.Ссылка,
	|	ПринятиеКУчетуОбъектовОС.Номер,
	|	ПринятиеКУчетуОбъектовОС.Дата,
	|	ПринятиеКУчетуОбъектовОС.Организация,
	|	"""",
	|	"""",
	|	ВЫБОР
	|		КОГДА НЕ ЦМООтправители.ЦМО ЕСТЬ NULL
	|			ТОГДА ЦМООтправители.ЦМО.Сотрудник
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ЦМООтправители.ЦМО ЕСТЬ NULL
	|			ТОГДА ЦМООтправители.ЦМО.МестоХранения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)
	|	КОНЕЦ,
	|	ПринятиеКУчетуОбъектовОС.Подразделение.Наименование,
	|	ПринятиеКУчетуОбъектовОС.ЦМО.Сотрудник,
	|	ПринятиеКУчетуОбъектовОС.ЦМО.МестоХранения,
	|	ПринятиеКУчетуОбъектовОС.ОснованиеДляАкта,
	|	ПринятиеКУчетуОбъектовОС.НомерОснованияДляАкта,
	|	ПринятиеКУчетуОбъектовОС.ДатаОснованияДляАкта,
	|	ПринятиеКУчетуОбъектовОС.Затребовал,
	|	ПринятиеКУчетуОбъектовОС.ОтпускРазрешил,
	|	ПринятиеКУчетуОбъектовОС.ОтветственныйИсполнитель,
	|	ПринятиеКУчетуОбъектовОС.ИФО,
	|	ПринятиеКУчетуОбъектовОС.Руководитель,
	|	ИСТИНА
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС КАК ПринятиеКУчетуОбъектовОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КапитальныеВложения.Ссылка КАК Ссылка,
	|			КапитальныеВложения.ЦМО КАК ЦМО
	|		ИЗ
	|			Документ.ПринятиеКУчетуОбъектовОС.КапитальныеВложения КАК КапитальныеВложения
	|		ГДЕ
	|			КапитальныеВложения.Ссылка В
	|					(ВЫБРАТЬ
	|						КапВложения_ЦМО.Ссылка
	|					ИЗ
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							КапВложения1.Ссылка КАК Ссылка,
	|							КОЛИЧЕСТВО(КапВложения1.ЦМО) КАК КолЦМО
	|						ИЗ
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								КапВложения.Ссылка КАК Ссылка,
	|								КапВложения.ЦМО КАК ЦМО
	|							ИЗ
	|								Документ.ПринятиеКУчетуОбъектовОС.КапитальныеВложения КАК КапВложения
	|							ГДЕ
	|								КапВложения.Ссылка В (&МассивОбъектов)) КАК КапВложения1
	|						СГРУППИРОВАТЬ ПО
	|							КапВложения1.Ссылка
	|						ИМЕЮЩИЕ
	|							КОЛИЧЕСТВО(КапВложения1.ЦМО) = 1) КАК КапВложения_ЦМО)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			КапитальныеВложения.Ссылка,
	|			КапитальныеВложения.ЦМО) КАК ЦМООтправители
	|		ПО ПринятиеКУчетуОбъектовОС.Ссылка = ЦМООтправители.Ссылка
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОС.Ссылка В(&МассивОбъектов)
	|	И ПринятиеКУчетуОбъектовОС.ВидПоступления В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление))";
	
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаТаблицДляПечатиТребованияНакладной0510451() Экспорт
	Возврат
	"ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ОсновныеСредства.ОсновноеСредство.Наименование
	|		ИНАЧЕ ОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК НФАНаименование,
	|	ОсновныеСредства.ИнвентарныйНомер.Код КАК НомерНоменклатурный,
	|	ОсновныеСредства.ИнвентарныйНомер.НомерПаспорта КАК НомерПаспорта,
	|	ЕдИзм.Код КАК ЕдИзмКод,
	|	ЕдИзм.НаименованиеПолное КАК ЕдИзмНаименование,
	|	ОсновныеСредства.Количество КАК Затребовано,
	|	ОсновныеСредства.Количество КАК Количество,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.КПС КАК КПС,
	|	ОсновныеСредства.Ссылка.КФО КАК КФО,
	|	ОсновныеСредства.СчетУчетаОС КАК СчетУчета,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство.Код КАК НФАКод,
	|	ОсновныеСредства.ОсновноеСредство КАК Номенклатура
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК ЕдИзм
	|		ПО ЕдИзм.Ссылка = &ЕдИзмШт
	|ГДЕ
	|	ОсновныеСредства.Ссылка В (&МассивОбъектов)";
КонецФункции

// Добавить данные для печати0510448.
// 
// Параметры:
//  ДанныеДокументов - см. УправлениеПечатьюБГУ.ТаблицаШапкиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448
//  МассивОбъектов - Массив из ДокументОбъект.ПринятиеКУчетуОбъектовОС
//  МЗПоСебестоимости - Булево - не используется для печати ОС
Процедура ДобавитьДанныеДляПечати0510448(ДанныеДокументов, МассивОбъектов, МЗПоСебестоимости = Ложь) Экспорт
	
	ДанныеДляПечати = ДанныеДляПечати0510448_ОС(МассивОбъектов);
	
	ВыборкаДокументов  = ДанныеДляПечати.ВыборкаДокументов;
	ВыборкаОС          = ДанныеДляПечати.ВыборкаНФА;
	ВыборкаФайлы       = ДанныеДляПечати.ВыборкаФайлы;
	СоставКомиссий     = ДанныеДляПечати.СоставКомиссий;
	ВыборкаОбременения = ДанныеДляПечати.ВыборкаОбременения;
	ВыборкаФайлыАктаЭДО = ДанныеДляПечати.ВыборкаФайлыАктаЭДО;
	// Выборка для определения документов, по которым будет распечатано более одного акта,
	// соответственно, нужно будет добавлять к номеру акта дополнительный суффикс
	ВыборкаДокументовПоКоличеству  = ДанныеДляПечати.ВыборкаДокументовПоКоличеству;

	ДатыОкончанияАморт = Неопределено;
	Если ДанныеДляПечати.Свойство("ДатыОкончанияАмортизации") Тогда
		ДатыОкончанияАморт = ДанныеДляПечати.ДатыОкончанияАмортизации;
	КонецЕсли;	
	
	ДопКолонки = "НомерСтроки,НФА,НаименованиеНФА,Адрес,Назначение";
	Справочники.ОсновныеСредства.ИнициализироватьПараметрыДопХарактеристик(ДанныеДляПечати);
	ПустыеДанныеСтрокиХарактеристик = Новый Структура(ДопКолонки);
	
	МетодыНачисления = УправлениеОсновнымиСредствамиПовтИсп.СпособыНачисленияАмортизации_Соответствие();
			
	Пока ВыборкаДокументов.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		СтруктураПоискаССотрудником = Новый Структура("Ссылка, СотрудникПолучатель", ВыборкаДокументов.Ссылка, ВыборкаДокументов.СотрудникПолучатель);
		
		СтрокаДокумента = ДанныеДокументов.Добавить();
		СтрокаДокумента.ИндивидуальныеХарактеристики = УправлениеПечатьюБГУ.ТаблицаИндивидуальныеХарактеристикиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		СтрокаДокумента.ПередаваемыеОбъекты = УправлениеПечатьюБГУ.ТаблицаСведенияОПередаваемыхОбъектахНФААктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		СтрокаДокумента.ПринятыеОбъектыНФА = УправлениеПечатьюБГУ.ТаблицаСведенияОПринятыхОбъектахНФААктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		СтрокаДокумента.СведенияОбОграничениях = УправлениеПечатьюБГУ.ТаблицаСведенияОбОграниченияхАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		СтрокаДокумента.СоставКомиссии = УправлениеПечатьюБГУ.ТаблицаКомиссияДляПечатиПриказ61н();
		СтрокаДокумента.Файлы = УправлениеПечатьюБГУ.ТаблицаФайлыДляПечатиПриказ61н();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, ВыборкаДокументов);

		НачислятьАмортизациюПервымЧислом = Истина;
		Если ЗначениеЗаполнено(ВыборкаДокументов.Организация) И ЗначениеЗаполнено(ВыборкаДокументов.Дата) Тогда
			НачислятьАмортизациюПервымЧислом = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
				ВыборкаДокументов.Организация, НачалоМесяца(ВыборкаДокументов.Дата)).НачислятьАмортизациюПервымЧислом;
		КонецЕсли;		
		
		// Данные руководителя
		РуководительЕстьВЗапросе = Ложь;
		Если ВыборкаДокументов.Владелец().Колонки.Найти("Руководитель") <> Неопределено И ЗначениеЗаполнено(ВыборкаДокументов["Руководитель"]) Тогда
			РуководительЕстьВЗапросе = Истина;
		КонецЕсли;
		
		Если Не РуководительЕстьВЗапросе Тогда
			СтрокаДокумента.Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
				Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ВыборкаДокументов.Организация,
				ВыборкаДокументов.Дата, ВыборкаДокументов.СтруктурноеПодразделение).ОтветственноеЛицоСсылка;
		КонецЕсли;	

		// Шапка
		
		СтрокаДокумента.НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
			ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер);
		ВыборкаДокументовПоКоличеству.Сбросить();
		Если ВыборкаДокументовПоКоличеству.НайтиСледующий(СтруктураПоиска) Тогда
			// Если по документу формируются более одного акта, то к номеру добавим суффикс в виде
			// табельного номера МОЛ (код сотрудника), которому приходуются НФА.
			Если ЗначениеЗаполнено(ВыборкаДокументов.КодСотрудникПолучатель) Тогда
				СтрокаДокумента.НомерАкта = СтрокаДокумента.НомерАкта + " /" + ВыборкаДокументов.КодСотрудникПолучатель;
			КонецЕсли;	
		КонецЕсли;	
		СтрокаДокумента.ДатаАкта = ВыборкаДокументов.Дата;
		
		// Раздел 1
		
		ТаблицаХарактеристик = ДанныеДляПечати.ТаблицаХарактеристики.СкопироватьКолонки();
		СписокКолонок = СтрРазделить(ДопКолонки, ",");
		Для Каждого Колонка Из СписокКолонок Цикл
			ТаблицаХарактеристик.Колонки.Добавить(Колонка);
		КонецЦикла;
		
		ВыборкаОС.Сбросить();
		
		КолонкиВыборки = ВыборкаОС.Владелец().Колонки;
		НомерСтрокиПередаваемыеОбъекты = 0;
		Пока ВыборкаОС.НайтиСледующий(СтруктураПоискаССотрудником) Цикл
			
			Если ВыборкаДокументов.Передача Тогда
				НомерСтрокиПередаваемыеОбъекты = НомерСтрокиПередаваемыеОбъекты + 1;
				
				СтрокаПередача = СтрокаДокумента.ПередаваемыеОбъекты.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПередача, ВыборкаОС);
				СтрокаПередача.КодОбъекта = КодОбъектаКапвложенийДля0510448(ВыборкаОС, КолонкиВыборки);
				
				// Строки будем нумеровать последовательно, т.к. номер строки из запроса может иметь пропуски
				// из-за свертки данных в запросах. Нпример, для капвложений один объект может быть в нескольких
				// строках таблицы (разная аналитика КПС).
				СтрокаПередача.НомерСтроки = НомерСтрокиПередаваемыеОбъекты;
				
				СтрокаПередача.СрокЭксплуатации = УправлениеОсновнымиСредствами.РассчитатьМесяцыЭксплуатации(,
					ВыборкаОС.ДатаВводаВЭксплуатацию, ?(ВыборкаДокументов.Принятие,
					ВыборкаДокументов.Дата, ВыборкаДокументов.ДатаСписания));

				СтрокаПередача.ДатаОкончанияАмортизации = 
					ДатаОкончанияАмортизацииРаздела1ф0510448(ВыборкаОС, ДатыОкончанияАморт, НачислятьАмортизациюПервымЧислом);

			КонецЕсли;
			
			ДанныеДляПечати.Вставить("МожетСодержатьДрагМатериалы", ВыборкаОС.МожетСодержатьДрагМатериалы);
			ДанныеДляПечати.Вставить("ДатаСписания", ВыборкаДокументов.ДатаСписания);
			
			СтруктураПоискаОС = Новый Структура("ОсновноеСредство", ВыборкаОС.НФА);
			Справочники.ОсновныеСредства.ЗаполнитьТаблицуДопХарактеристик(
				ДанныеДляПечати, СтруктураПоискаОС,, ВыборкаОС.ИнвентарныйНомерСсылка);
			Если ДанныеДляПечати.ТаблицаХарактеристики.Количество() = 0
				И ТипЗнч(ВыборкаОС.НФА) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
				СтрокаХар = ТаблицаХарактеристик.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаХар, ВыборкаОС,, "Количество");
			Иначе
				Для НомерСтроки = 1 По ДанныеДляПечати.ТаблицаХарактеристики.Количество() Цикл
					СтрокаХар = ТаблицаХарактеристик.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаХар, ДанныеДляПечати.ТаблицаХарактеристики[НомерСтроки-1]);
					Если НомерСтроки = 1 Тогда
						ЗаполнитьЗначенияСвойств(СтрокаХар, ВыборкаОС, ДопКолонки);
					ИначеЕсли НомерСтроки = 2 Тогда
						ЗаполнитьЗначенияСвойств(СтрокаХар, ПустыеДанныеСтрокиХарактеристик);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
		// Раздел 2
		НомерСтроки = 0;
		КолонкиХарактеристик_НеХарактеристики = Новый Массив;
		КолонкиХарактеристик_НеХарактеристики.Добавить("НомерСтроки");
		КолонкиХарактеристик_НеХарактеристики.Добавить("НаименованиеНФА");
		КолонкиХарактеристик_НеХарактеристики.Добавить("НФА");
		
		Для Каждого СтрокаХарактеристик Из ТаблицаХарактеристик Цикл
			// Строки без доп. характеристик выводить не будем
			ЕстьДанные = Ложь;
			Для каждого Колонка из ТаблицаХарактеристик.Колонки Цикл
				Если КолонкиХарактеристик_НеХарактеристики.Найти(Колонка.Имя) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;	
				Если ЗначениеЗаполнено(СтрокаХарактеристик[Колонка.Имя]) Тогда
					ЕстьДанные = Истина;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
			
			// Если никаких доп. характеристик нет, строку не выводим 
			Если НЕ ЕстьДанные Тогда
				Продолжить;
			КонецЕсли;	
			
			// Нумеруем только строки где указан НФА. Если НФА не указан, то это данные характеристик объекта.
			// Их не нумеруем.
			Если ЗначениеЗаполнено(СтрокаХарактеристик.НФА) Тогда
				НомерСтроки = НомерСтроки + 1;
				НомерСтрокиОбъектаХарактеристик = "" + НомерСтроки;
			Иначе					
				НомерСтрокиОбъектаХарактеристик = "";
			КонецЕсли;
			СтрокаИндивидуальныеХарактеристики = СтрокаДокумента.ИндивидуальныеХарактеристики.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИндивидуальныеХарактеристики, СтрокаХарактеристик);
			СтрокаИндивидуальныеХарактеристики.НомерСтроки = НомерСтрокиОбъектаХарактеристик;
		КонецЦикла;
		
		// Раздел 3

		Если ВыборкаОбременения <> Неопределено Тогда
			
			ВыборкаОС.Сбросить();
			Пока ВыборкаОС.НайтиСледующий(СтруктураПоискаССотрудником) Цикл
				ОтборОС = Новый Структура("ОсновноеСредство, ИнвНомер", ВыборкаОС.НФА, ВыборкаОС.ИнвентарныйНомерСсылка);
				ПараметрыОтбора = Новый Структура("НФА, ИнвентарныйНомерСсылка", ВыборкаОС.НФА, ВыборкаОС.ИнвентарныйНомерСсылка);
				ВыборкаОбременения.Сбросить();
				Пока ВыборкаОбременения.НайтиСледующий(ОтборОС) Цикл
					СтрокаОграничения = СтрокаДокумента.СведенияОбОграничениях.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаОграничения, ВыборкаОС);
					ЗаполнитьЗначенияСвойств(СтрокаОграничения, ВыборкаОбременения);
					СтрокаОграничения.НФА = ВыборкаОбременения.ОсновноеСредство;
					
					Если НЕ СокрЛП(НРЕГ(ВыборкаОС.НаименованиеНФА)) = СокрЛП(НРЕГ(ВыборкаОбременения.НаименованиеЧасти)) Тогда
						СтрокаОграничения.НаименованиеНФА = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2)'"),
								ВыборкаОС.НаименованиеНФА,
								ВыборкаОбременения.НаименованиеЧасти);						
					КонецЕсли;
					СтрокаОграничения.ЗначениеОграничения = ВыборкаОбременения.РазмерЧасти;
					
					Контрагент = ВыборкаОбременения.Контрагент;
					
					Реквизиты = "ИНН, КПП, ЮридическоеФизическоеЛицо, ВидКонтрагента, Наименование";
					ЗначенияРеквизитовКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаОбременения.Контрагент, Реквизиты);
					СтрокаОграничения.ИННКонтрагентаОграничения = ЗначенияРеквизитовКонтрагента.ИНН;
					СтрокаОграничения.КППКонтрагентаОграничения = ЗначенияРеквизитовКонтрагента.КПП;
					ЮридическоеФизическоеЛицо = ЗначенияРеквизитовКонтрагента.ЮридическоеФизическоеЛицо;
					Если ЗначенияРеквизитовКонтрагента.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
						РеквизитыЮЛ = "ОГРН, НаименованиеПолное";
						ЗначенияРеквизитовЮЛ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЮридическоеФизическоеЛицо, РеквизитыЮЛ);
						СтрокаОграничения.ОГРНКонтрагентаОграничения = ЗначенияРеквизитовЮЛ.ОГРН;
						СтрокаОграничения.НаименованиеКонтрагентаОграничения = ЗначенияРеквизитовЮЛ.НаименованиеПолное;
					Иначе
						СтрокаОграничения.НаименованиеКонтрагентаОграничения = Справочники.ФизическиеЛица.ФИОФизлица(ЮридическоеФизическоеЛицо);
					КонецЕсли;
					
					НайденныеСтроки = СтрокаДокумента.ПередаваемыеОбъекты.НайтиСтроки(ПараметрыОтбора);
					Если НайденныеСтроки.Количество()>0 Тогда
						СтрокаОграничения.НомерСтроки = НайденныеСтроки[0].НомерСтроки;	
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
		// Раздел 4
		
		Если ВыборкаДокументов.Принятие Тогда
			ВыборкаОС.Сбросить();

			НомерСтроки = 0;
			Пока ВыборкаОС.НайтиСледующий(СтруктураПоискаССотрудником) Цикл
				НомерСтроки = НомерСтроки + 1;
			
				СтрокаПриятогоОбъекта = СтрокаДокумента.ПринятыеОбъектыНФА.Добавить();
				Если ВыборкаДокументов.ВидИмуществаВТабличнойЧасти Тогда
					ЗаполнитьЗначенияСвойств(СтрокаПриятогоОбъекта, ВыборкаДокументов,,"ВидИмущества");
					ЗаполнитьЗначенияСвойств(СтрокаПриятогоОбъекта, ВыборкаОС);
				Иначе
					ЗаполнитьЗначенияСвойств(СтрокаПриятогоОбъекта, ВыборкаДокументов);
					ЗаполнитьЗначенияСвойств(СтрокаПриятогоОбъекта, ВыборкаОС,,"ВидИмущества");
				КонецЕсли;	

				МетодАмортизации = "";
				Если ЗначениеЗаполнено(ВыборкаОС.ПорядокНачисления) Тогда
					МетодАмортизации = МетодыНачисления[Строка(ВыборкаОС.ПорядокНачисления)];
				КонецЕсли;
				СтрокаПриятогоОбъекта.МетодАмортизации = МетодАмортизации;
				
				Если ВыборкаОС.ПорядокНачисления = 3 // линейный метод начисления
					И ЗначениеЗаполнено(ВыборкаОС.ДатаВводаВЭксплуатацию) 
					И ЗначениеЗаполнено(ВыборкаОС.СрокПолезногоИспользования) Тогда
					СтрокаПриятогоОбъекта.ДатаОкончанияАмортизации = ДатаОкончанияАмортизации(
						ВыборкаОС.ДатаВводаВЭксплуатацию, 
						ВыборкаОС.СрокПолезногоИспользования, 
						НачислятьАмортизациюПервымЧислом);
				КонецЕсли;	 
				
				СтрокаПриятогоОбъекта.НомерСтроки = НомерСтроки;
			КонецЦикла;
		КонецЕсли;
		
		// Приложения

		Сч = 0;
		Пока ВыборкаФайлыАктаЭДО.НайтиСледующий(СтруктураПоиска) Цикл
			Сч = Сч + 1;
			ЗаполнитьЗначенияСвойств(СтрокаДокумента.Файлы.Добавить(), ВыборкаФайлыАктаЭДО);
		КонецЦикла;
		
		Если Сч = 0 Тогда
			Пока ВыборкаФайлы.НайтиСледующий(СтруктураПоиска) Цикл
				ЗаполнитьЗначенияСвойств(СтрокаДокумента.Файлы.Добавить(), ВыборкаФайлы);
			КонецЦикла;
		КонецЕсли;
		
		// Комиссия
		
		Отбор = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		СтрокиКомиссииДокумента = СоставКомиссий.НайтиСтроки(Отбор);
		Для Каждого СтрокаКомиссии Из СтрокиКомиссииДокумента Цикл
			СтрокаКомиссииДокумента = СтрокаДокумента.СоставКомиссии.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКомиссииДокумента, СтрокаКомиссии);
			СтрокаКомиссииДокумента.ФИО = КорреспондентыКлиентСервер.ФИО(
				Новый Структура("Фамилия, Имя, Отчество",
					СтрокаКомиссии.Фамилия,
					СтрокаКомиссии.Имя,
					СтрокаКомиссии.Отчество), Истина);
		КонецЦикла;		
		
	КонецЦикла;
	
КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Формирует таблицу двдижений по регистру сведений "Операции капвложений"
// Вызывается после формирования таблицы проводок для документа при его проведении
//
// Параметры:
//  ТаблицаПроводок - Таблица значений. Таблица проводок, которые будут сформированы
//  ДокументОбъект - Документ объект. Документ, из которого формируются движения
//  ДополнительныеРеквизиты - Структура. Структура дополнительных реквизитов типовой бухгалтерской операции
//  ТабДвижений - Таблица значений. Исходящая таблица. Ее заполняет эта функция
//  ТекстОшибки - Строка. Исходящая строка, описание ошики. Ее заполняет эта функция, если была ошибка.
//
// Возвращает флаг ошибки. Если Истина - все ОК, иначе - Ложь
Функция ИнициализироватьТабДвиженийДляКарточкиКапвложений(
	ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТабДвижений, ТекстОшибки) Экспорт

	ОперацииСоСчетом106 = Новый Массив;
	ОперацииСоСчетом106.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление);
	ОперацииСоСчетом106.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение);
	Если ОперацииСоСчетом106.Найти(ДокументОбъект.ВидПоступления) = Неопределено
		ИЛИ НЕ ДокументОбъект.ОтразитьВКарточкеКапвложений 
		ИЛИ НЕ ОбслуживаниеКарточекКапвложенийВызовСервера.ЭтоСчетКапвложений(ДокументОбъект.СчетКредита) Тогда
		Возврат Истина;	
	ИначеЕсли НЕ ЗначениеЗаполнено(ДокументОбъект.КарточкаКапвложений) Тогда
		ТекстОшибки = НСтр("ru = 'На закладке документа ""Стоимость вложений"" включен флажок 
		|""Отражать в карточке капвложений"", но не заполнена Карточка капвложений'");
		Возврат Ложь;
	КонецЕсли;	
	
	НоваяСтрока = ТабДвижений.Добавить();
	НоваяСтрока.Организация         = ДокументОбъект.Организация;
	НоваяСтрока.КарточкаКапвложений = ДокументОбъект.КарточкаКапвложений;
	НоваяСтрока.Период              = ДокументОбъект.Дата;

	Возврат Истина;
КонецФункции	

// Формирует таблицу разделителей для формирования нескольких документов "Принятие к учету объектов ОС" 
// на основании одного документа 
// 
// Параметры:
//  - ДокументОснование - ДокументСсылка.ИнвентаризационнаяОписьНФА  - документ-основание
//  - СсылкаЦелевогоДокумента - ДокументСсылка.ПринятиеКУчетуОбъектовОС - ссылка на текущий документ.
//						Следует передавать, только, если ссылка не пустая. Если передан, то данные этого 
//                      документа не учитываются, как отработанные. Передается, если документ заполняется
//                      из формы самого документа (при выборе документа-основания)
//
// Возвращаемое значение:
// 	- ТаблицаЗначений с полями:
//  * ЦМО - ДокументСсылка.ЦМО
Функция ТаблицаРазделителейДокументов(ДокументОснование, СсылкаЦелевогоДокумента = Неопределено) Экспорт  
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ИнвентаризационнаяОписьНФА") Тогда
		Возврат ТаблицаРазделителейДокументов_ИнвентаризационнаяОписьНФА(ДокументОснование, СсылкаЦелевогоДокумента);
	КонецЕсли;	
КонецФункции	

// Формирует текст запроса для получения НФА, уже отработанных данным документом
// по инвентаризации
//
// Возвращаемое значение:
// - Строка - текст запроса
Функция ТекстЗапроса_НФАОтработанныеПоИнвентаризации() Экспорт
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК ДокументОтклонения,
	|	ОсновныеСредства.Ссылка.ДокументОснование КАК ДокументИнвентаризации,
	|	ОсновныеСредства.ОсновноеСредство КАК НФА,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОтклоненийВИнвентаризацииНФА.Излишки) КАК ВидОтклонения,
	|	ОсновныеСредства.Ссылка.ЦМО.МестоХранения КАК МестоИнвентаризации,
	|	ОсновныеСредства.Количество КАК Количество
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка.ДокументОснование В(&ДокументыИнвентаризации)
	|	И НЕ ОсновныеСредства.Ссылка = &ПринятиеКУчетуОбъектовОССсылка
	|	И НЕ ОсновныеСредства.Ссылка.ПометкаУдаления";
	
	Возврат ТекстЗапроса;
КонецФункции	

// Определяет, возможны ли гарантийные обязательства для указанной операции.
//
// Параметры:
//   ВидОперации - ПеречислениеСсылка.ВидыОперацийПринятияКУчетуОС - вид поступления для проверки возможности 
//   	гарантийных обязательств поставщика для переданного вида поступления.
//
// Возвращаемое значение:
//   Булево - Истина, если возможны гарантийные обязательства, иначе Ложь
Функция ВозможныГарантийныеОбязательства(ВидОперации) Экспорт
	ВО_Приобретение = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение");	
	ВО_ПоступлениеНФАБаланс = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс");	

	МассивВО = Новый Массив;
	МассивВО.Добавить(ВО_Приобретение);
	МассивВО.Добавить(ВО_ПоступлениеНФАБаланс);
	Возврат(МассивВО.Найти(ВидОперации) <> Неопределено);
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПрослеживаемыйТовар

Функция ЕстьПрослеживаемыеТовары(Объект) Экспорт

	Если УправлениеОсновнымиСредствамиКлиентСервер.ПризнакЕстьПрослеживаемыеТоварыВТабличнойЧасти(Объект.ВидПоступления) Тогда
		
		// При поступлении могут быть комплекты ОС, которые содержат прослеживаемые товары.
		// Такие объекты никак не выделяются. Нужна возможность указать РНПТ вручную. 
		ЕстьПрослеживаемыеТовары = Истина;
		
	ИначеЕсли УправлениеОсновнымиСредствамиКлиентСервер.ПризнакЕстьПрослеживаемыеТоварыВШапке(Объект.ВидПоступления) Тогда
		
		ЕстьПрослеживаемыеТовары = ПрослеживаемостьБГУ.ПрослеживаемоеОсновноеСредство(Объект.ВнеоборотныйАктив, Объект);
		
	Иначе
		
		ЕстьПрослеживаемыеТовары = Ложь;
		
	КонецЕсли;
	
	Возврат ЕстьПрослеживаемыеТовары;

КонецФункции

//Формирует текст запроса для определения прослеживаемого товара в документе
//
// Возвращаемое значение:
//  Строка - Текст сформированного запроса.
//
Функция ТекстЗапросаТаблицаПрослеживаемыхТоваровПоОснованию() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство КАК Номенклатура,
	|	СУММА(ПринятиеКУчетуОбъектовОСОсновныеСредства.Количество) КАК Количество,
	|	СУММА(ПринятиеКУчетуОбъектовОСОсновныеСредства.Сумма) КАК Сумма,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.Дата КАК ПериодСобытия,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство.СтранаПроисхождения КАК СтранаПроисхождения
	|ПОМЕСТИТЬ ВТ_ТаблицаТоваров
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ПринятиеКУчетуОбъектовОСОсновныеСредства
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ПрослеживаемыйТовар
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = &Основание
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.ОтражатьВПрослеживаемости
	|	И ЕСТЬNULL(ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.Контрагент.ЮридическоеФизическоеЛицо.СтранаРегистрации.УчастникЕАЭС, ЛОЖЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.Организация,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.Дата,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство.СтранаПроисхождения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаТоваров.Количество КАК Количество,
	|	ВТ_ТаблицаТоваров.Сумма КАК Сумма,
	|	ВТ_ТаблицаТоваров.Организация КАК Организация,
	|	ВТ_ТаблицаТоваров.ПериодСобытия КАК ПериодСобытия,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРегистрацииПрослеживаемыхТоваров.ВвозТоваровИзЕАЭС) КАК ВидОперации,
	|	ВТ_ТаблицаТоваров.Номенклатура.КодТНВЭД КАК ТНВЭД,
	|	ВТ_ТаблицаТоваров.СтранаПроисхождения КАК СтранаПроисхождения
	|ПОМЕСТИТЬ ВТ_ТоварыПоОснованию
	|ИЗ
	|	ВТ_ТаблицаТоваров КАК ВТ_ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаТоваров.Количество КАК Количество,
	|	ВТ_ТаблицаТоваров.Сумма КАК Сумма,
	|	ВТ_ТаблицаТоваров.Организация КАК Организация,
	|	ВТ_ТаблицаТоваров.ПериодСобытия КАК ПериодСобытия,
	|	ЛОЖЬ КАК РанееРегистрировалсяВПрослеживаемости,
	|	0 КАК КоличествоУчет,
	|	ВТ_ТаблицаТоваров.ТНВЭД КАК ТНВЭД,
	|	ВТ_ТаблицаТоваров.ВидОперации КАК ВидОперации,
	|	ВТ_ТаблицаТоваров.СтранаПроисхождения КАК СтранаПроисхождения
	|ПОМЕСТИТЬ ВТ_ТаблицаТоваровРазмеченный
	|ИЗ
	|	ВТ_ТоварыПоОснованию КАК ВТ_ТаблицаТоваров";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаРНПТПоДокументу() Экспорт
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПринятиеКУчетуОС.Ссылка,
	|	ЮрЛицоДокумента.СтранаРегистрации
	|ПОМЕСТИТЬ СтраныРегистрацииКонтрагента
	|ИЗ
	|	Документ.ПринятиеКУчетуОС КАК ПринятиеКУчетуОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентДокумента
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮрЛицоДокумента
	|			ПО КонтрагентДокумента.ЮридическоеФизическоеЛицо = ЮрЛицоДокумента.Ссылка
	|		ПО ПринятиеКУчетуОС.Контрагент = КонтрагентДокумента.Ссылка
	|ГДЕ
	|	ПринятиеКУчетуОС.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПринятиеКУчетуОС.Ссылка,
	|	ФизЛицоДокумента.СтранаРегистрации
	|ИЗ
	|	Документ.ПринятиеКУчетуОС КАК ПринятиеКУчетуОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентДокумента
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизЛицоДокумента
	|			ПО КонтрагентДокумента.ЮридическоеФизическоеЛицо = ФизЛицоДокумента.Ссылка
	|		ПО ПринятиеКУчетуОС.Контрагент = КонтрагентДокумента.Ссылка
	|ГДЕ
	|	ПринятиеКУчетуОС.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраныРегистрацииКонтрагента.Ссылка
	|ИЗ
	|	СтраныРегистрацииКонтрагента КАК СтраныРегистрацииКонтрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|		ПО СтраныРегистрацииКонтрагента.СтранаРегистрации = СтраныМира.Ссылка
	|ГДЕ
	|	СтраныМира.УчастникЕАЭС
	|	И СтраныМира.Ссылка <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.Дата КАК Период,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка КАК Регистратор,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ПорядокОтраженияВОтчетностиПоПрослеживаемости.ОтчетОбОперациях) КАК ОтражениеВОтчетности,
	|	НАЧАЛОПЕРИОДА(ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.Дата, КВАРТАЛ) КАК ПериодОперации,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка КАК ДокументОперации,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.Контрагент КАК Контрагент,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.КодОперацииПрослеживаемости КАК КодОперации,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Сумма КАК СуммаБезНДС,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ЗНАЧЕНИЕ(Справочник.ТипыДокументов.УПД) КАК ТипДокументаВПрослеживаемости,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.НомерПервичногоДокумента КАК НомерДокумента,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка.ДатаПервичногоДокумента КАК ДатаДокумента,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.СтранаПроисхождения,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ИдентификаторСтроки
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ПринятиеКУчетуОбъектовОСОсновныеСредства
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	ВЫБОР
	|		КОГДА ТаблицаСведенияПрослеживаемости.Комплектующее <> ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|				И ТаблицаСведенияПрослеживаемости.Комплектующее <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ТаблицаСведенияПрослеживаемости.Комплектующее
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Комплектующее,
	|	ТаблицаСведенияПрослеживаемости.Комплектующее.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ТаблицаСведенияПрослеживаемости.Количество КАК Количество,
	|	ТаблицаСведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ТаблицаСведенияПрослеживаемости.СуммаБезНДС КАК СуммаБезНДС,
	|	ТаблицаСведенияПрослеживаемости.ИдентификаторСтроки
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.СведенияПрослеживаемости КАК ТаблицаСведенияПрослеживаемости
	|ГДЕ
	|	ТаблицаСведенияПрослеживаемости.Ссылка = &Ссылка
	|"
КонецФункции

// Параметры отражения в прослеживаемости.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект.ПринятиеКУчетуОбъектовОС
// 
// Возвращаемое значение:
//  см. ПрослеживаемостьБГУ.ПараметрыОтраженияВПрослеживаемости
// 
Функция ПараметрыОтраженияВПрослеживаемости(ДокументОбъект) Экспорт
	Результат = ПрослеживаемостьБГУ.ПараметрыОтраженияВПрослеживаемости();

	Если ДокументОбъект.Ссылка.Пустая() Тогда
		Период = Новый Граница(ДокументОбъект.Дата, ВидГраницы.Включая);
	Иначе
		Период = Новый Граница(ДокументОбъект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	ТипДокументаВПрослеживаемости = ПрослеживаемостьБГУ.ВидСопроводительногоДокументаОтражающегоСодержаниеОперации(
		ДокументОбъект); 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("ТипДокументаВПрослеживаемости", ТипДокументаВПрослеживаемости);

	Запрос.Текст = ТекстЗапросаТаблицаРНПТПоДокументу();
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Результат.КонтрагентЧленЕАЭС = Не РезультатЗапроса[РезультатЗапроса.ВГраница() - 2].Пустой();
	
	ТаблицаТовары = РезультатЗапроса[РезультатЗапроса.ВГраница() - 1].Выгрузить(); // ТаблицаЗначений
	ТаблицаСведенияРНПТ = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить(); // ТаблицаЗначений
	ТаблицаСведенияРНПТ.Индексы.Добавить("ИдентификаторСтроки");
	ТаблицаСведенияРНПТ.Индексы.Добавить("ИдентификаторСтроки, Комплектующее");
	
	ОстаткиРНПТ = ПрослеживаемостьБГУ.ОстаткиРНПТОС(ДокументОбъект);
	ОстаткиРНПТ.Индексы.Добавить("ОсновноеСредство, РНПТ, Комплектующее");
	
	// 1. Если это поступление, а не принятие к учету
	РаспределяемыеСтрокиРНПТ = Новый Массив;
	Для Каждого СтрокаТовара Из ТаблицаТовары Цикл
		СтрокиРНПТ = ТаблицаСведенияРНПТ.НайтиСтроки(
			Новый Структура("ИдентификаторСтроки", СтрокаТовара.ИдентификаторСтроки));
		Для Каждого СтрокаРНПТ Из СтрокиРНПТ Цикл
			Если ЗначениеЗаполнено(СтрокаРНПТ.Комплектующее) Тогда
				ДобавитьСтрокуВТаблицуРНПТ(Результат.РНПТ_ОС, СтрокаТовара, СтрокаРНПТ, ДокументОбъект.ВнеоборотныйАктив);
			Иначе
				РаспределяемыеСтрокиРНПТ.Добавить(СтрокаРНПТ);
			КонецЕсли;
		КонецЦикла;
		ПрослеживаемостьБГУ.РаспределитьСуммуПоМассивуСтрок(РаспределяемыеСтрокиРНПТ, СтрокаТовара.СуммаБезНДС,
			"Количество", "СуммаБезНДС");
		Для Каждого СтрокаРНПТ Из РаспределяемыеСтрокиРНПТ Цикл
			ДобавитьСтрокуВТаблицуРНПТ(Результат.РНПТ_ОС, СтрокаТовара, СтрокаРНПТ, ДокументОбъект.ВнеоборотныйАктив);
		КонецЦикла;
		РаспределяемыеСтрокиРНПТ.Очистить();
	КонецЦикла;

	Если ДокументОбъект.ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение
			Или ДокументОбъект.ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление Тогда
				
		Результат.ЭтоПеремещение = Истина;
		// 2. Если принятие к учету
		ОСРНПТДокумента2 = Результат.РНПТ_ОС.Скопировать(, "ОсновноеСредство, РНПТ, Комплектующее, СуммаБезНДС, Количество");
		ОСРНПТДокумента2.Свернуть("ОсновноеСредство, РНПТ, Комплектующее", "СуммаБезНДС, Количество");
		ОСРНПТДокумента = Результат.РНПТ_ОС.Скопировать(, "РНПТ, Комплектующее, СуммаБезНДС, Количество");
		ОСРНПТДокумента.Свернуть("РНПТ, Комплектующее", "СуммаБезНДС, Количество");
		Для Каждого СочетаниеОСРНПТ Из ОСРНПТДокумента Цикл
			СтрокиОстатков = ОстаткиРНПТ.НайтиСтроки(
				Новый Структура("ОсновноеСредство, РНПТ, Комплектующее", ДокументОбъект.ВнеоборотныйАктив,
					СочетаниеОСРНПТ.РНПТ, Неопределено));
			Если СтрокиОстатков.Количество() = 0 Тогда
				Сумма = 0;
			Иначе
				Сумма = СтрокиОстатков[0].СуммаБезНДС;
			КонецЕсли;
			СтрокиРНПТ = ОСРНПТДокумента2.НайтиСтроки(Новый Структура("РНПТ, Комплектующее",
				СочетаниеОСРНПТ.РНПТ, Неопределено));
			ПрослеживаемостьБГУ.РаспределитьСуммуПоМассивуСтрок(СтрокиРНПТ, Сумма, "СуммаБезНДС", "СуммаБезНДС");
		КонецЦикла;
		
		СуществующиеСтрокиРНПТ = Новый Массив;
		Для Каждого СтрокаРНПТ Из Результат.РНПТ_ОС Цикл
			СуществующиеСтрокиРНПТ.Добавить(СтрокаРНПТ);
			НайденныеСтроки = ОСРНПТДокумента2.НайтиСтроки(
				Новый Структура("ОсновноеСредство, РНПТ, Комплектующее",
					СтрокаРНПТ.ОсновноеСредство, СтрокаРНПТ.РНПТ, СтрокаРНПТ.Комплектующее));
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаРНПТ.СуммаБезНДС = НайденныеСтроки[0].СуммаБезНДС / НайденныеСтроки[0].Количество
					 * СтрокаРНПТ.Количество;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаРНПТ Из СуществующиеСтрокиРНПТ Цикл
			НоваяСтрокаРНПТ = Результат.РНПТ_ОС.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРНПТ, СтрокаРНПТ);
			
			СтрокаРНПТ.ЭтоСписание = Истина;
			СтрокаРНПТ.ОсновноеСредство = ДокументОбъект.ВнеоборотныйАктив;
		КонецЦикла;
	КонецЕсли;

	Возврат Результат;
КонецФункции

Процедура ДобавитьСтрокуВТаблицуРНПТ(ТаблицаРНПТ, СтрокаТовара, СтрокаРНПТ, ВнеоборотныйАктив)
	НоваяСтрокаРНПТ = ТаблицаРНПТ.Добавить();
	НоваяСтрокаРНПТ.Период = СтрокаТовара.ДатаДокумента;
	ЗаполнитьЗначенияСвойств(НоваяСтрокаРНПТ, СтрокаТовара);
	ЗаполнитьЗначенияСвойств(НоваяСтрокаРНПТ, СтрокаРНПТ);
	НоваяСтрокаРНПТ.КапитальноеВложение = ВнеоборотныйАктив;
	Если ЗначениеЗаполнено(НоваяСтрокаРНПТ.Комплектующее) Тогда
		НоваяСтрокаРНПТ.СтранаПроисхождения = СтрокаРНПТ.СтранаПроисхождения;
	Иначе
		НоваяСтрокаРНПТ.СтранаПроисхождения = СтрокаТовара.СтранаПроисхождения;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, 
		"Организация, ВидПоступления, Дата, Номер, ВнеоборотныйАктив, 
		|СчетКредита, ОтразитьВКарточкеКапвложений, ПервичныйДокумент");
	ЭтоПоступлениеИзПользования = УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПоступлениеИзПользования(ЗначенияРеквизитов.ВидПоступления);
	УчетНаСчете21ВУсловнойОценке = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
		ЗначенияРеквизитов.Организация, ЗначенияРеквизитов.Дата).УчетНаСчете21ВУсловнойОценке;
	
	ОперацииПоступленияНаБаланс = Новый Массив;
	ОперацииПоступленияНаБаланс.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение);
	ОперацииПоступленияНаБаланс.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление);
	ОперацииПоступленияНаБаланс.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс);

	МассивСчетовМЦ = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляКапвложенийСМЦ();
	МассивСчетовМЦ = УчетДрагМатериалов.ДополнитьМассивСчетовДМДляМЦ(ЗначенияРеквизитов.Организация, МассивСчетовМЦ, "Основные средства");
	МассивСчетовМЦ = УчетДрагМатериалов.ДополнитьМассивСчетовДМДляМЦ(ЗначенияРеквизитов.Организация, МассивСчетовМЦ, "Номенклатура");
	
	МассивСубконтоМЦ = Новый Массив;
	МассивСубконтоМЦ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.МатериальнаяЦенность);
	
	МассивСубконтоМЗ = Новый Массив;
	МассивСубконтоМЗ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	ИмяДокумента = ?(ЗначениеЗаполнено(ЗначенияРеквизитов.ПервичныйДокумент)
		И ЗначенияРеквизитов.ПервичныйДокумент <> 
			Справочники.ПервичныеДокументы.НайтиПоРеквизиту("Идентификатор", "ДокументКонтрагента_Служебный"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначенияРеквизитов.ПервичныйДокумент, "ВидПервичногоДокумента"),
		НСтр("ru = 'Акт о приеме-передаче объектов нефинансовых активов'"));
	Запрос.УстановитьПараметр("ИмяДокумента", ИмяДокумента);
	
	Запрос.УстановитьПараметр("ЭтоПоступлениеИзПользования"	, ЭтоПоступлениеИзПользования);
	Запрос.УстановитьПараметр("ОперацииПоступленияНаБаланс"	, ОперацииПоступленияНаБаланс);
	Запрос.УстановитьПараметр("УчетПоПодразделениям"		, ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Запрос.УстановитьПараметр("НомерДокумента"				, ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДокументСсылка, ЗначенияРеквизитов.Номер));
	Запрос.УстановитьПараметр("Счет01"						, БухгалтерскийУчет.СписокСчетов("01"));
	Запрос.УстановитьПараметр("Учет21Условно"				, УчетНаСчете21ВУсловнойОценке);
	Запрос.УстановитьПараметр("ГраницаДокумента"            , Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация"                 , ЗначенияРеквизитов.Организация);
	Запрос.УстановитьПараметр("ВнеоборотныйАктив"           , ЗначенияРеквизитов.ВнеоборотныйАктив);
	Запрос.УстановитьПараметр("ВозможныГарантийныеОбязательства", 
		ВозможныГарантийныеОбязательства(ЗначенияРеквизитов.ВидПоступления));
	Запрос.УстановитьПараметр("Период"           			, ЗначенияРеквизитов.Дата);
	Запрос.УстановитьПараметр("МассивСчетовМЦ"				, МассивСчетовМЦ);
	Запрос.УстановитьПараметр("МассивСубконтоМЦ"			, МассивСубконтоМЦ);
	Запрос.УстановитьПараметр("МассивСубконтоМЗ"			, МассивСубконтоМЗ);

	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Дата,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Ссылка.ВидПоступления КАК ВидПоступления,
	|	ТаблицаОсновныеСредства.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаОсновныеСредства.Ссылка.Договор КАК Договор,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМООтправитель КАК ЦМООтправитель,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|				И ТаблицаОсновныеСредства.СчетУчетаОС.УчетПоПодразделениям
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|				И ТаблицаОсновныеСредства.СчетУчетаОС.УчетПоПодразделениям
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.ПодразделениеОтправитель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеОтправитель,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.СчетУчетаОС КАК СчетУчетаОС,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ТаблицаОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ТаблицаОсновныеСредства.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию КАК ПринятиеСВводом,
	|	ТаблицаОсновныеСредства.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	|	ТаблицаОсновныеСредства.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ТаблицаОсновныеСредства.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ТаблицаОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	&ИмяДокумента КАК ИмяДокумента,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.Ссылка.НомерПервичногоДокумента = """"
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Номер
	|		ИНАЧЕ ТаблицаОсновныеСредства.Ссылка.НомерПервичногоДокумента
	|	КОНЕЦ КАК НомерДокумента,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.Ссылка.ДатаПервичногоДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.Ссылка.ДатаПервичногоДокумента
	|	КОНЕЦ КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.Ссылка.ВидПервичногоДокумента = """"
	|			ИЛИ ТаблицаОсновныеСредства.Ссылка.НФАПереданыЭлектроннымАктом
	|			ТОГДА &ИмяДокумента
	|		ИНАЧЕ ТаблицаОсновныеСредства.Ссылка.ВидПервичногоДокумента
	|	КОНЕЦ КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НаименованиеГТ КАК НаименованиеГТ,
	|	ТаблицаОсновныеСредства.ДатаГТ КАК ДатаГТ,
	|	ТаблицаОсновныеСредства.НомерГТ КАК НомерГТ,
	|	ТаблицаОсновныеСредства.СрокДействияГТ КАК СрокДействияГТ,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.Ссылка.ВидПоступления В (&ОперацииПоступленияНаБаланс)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПоступлениеНаБаланс,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|				ИЛИ НЕ ТаблицаОсновныеСредства.ОсновноеСредство.ГрупповойУчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПообъектныйУчет,
	|	ТаблицаОсновныеСредства.Ссылка.ПередачаЧастейОбъектов КАК ПередачаЧастейОбъектов
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ТаблицаОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ТаблицаОсновныеСредства.Ссылка)
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка";
	
	ИнициализироватьЗапросыБУ(Запрос, НомераТаблиц, ЗначенияРеквизитов, СтруктураДополнительныеСвойства);
	
	#Область НалоговыйУчет
	Если УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВНалоговомУчетеПринятиеКУчету(ДокументСсылка) Тогда
		ИнициализироватьЗапросыНУ(Запрос, НомераТаблиц);
	КонецЕсли;
	#КонецОбласти
	
	#Область УпрощеннаяСистемаНалогообложения
	Если УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВУСНДоходыМинусРасходыПринятиеКУчету(ДокументСсылка) Тогда
		ИнициализироватьЗапросыУСН(Запрос, НомераТаблиц);
	КонецЕсли;
	#КонецОбласти
	
	ИнициализироватьЗапросыПоОтражениюЭДВУчете(Запрос, НомераТаблиц);
	
	#Область УчетДрагМатериалов
	ИнициализироватьЗапросыДМ(Запрос, НомераТаблиц);
	#КонецОбласти
	
	ПрослеживаемостьБГУ.ИнициализироватьЗапросыСвойстваРНПТ(ДокументСсылка, Запрос, НомераТаблиц);

	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыБУ(Запрос, НомераТаблиц, ЗначенияРеквизитов, СтруктураДополнительныеСвойства)
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету) КАК Событие,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.НомерСтроки КАК Порядок1,
	|	1 КАК Порядок2
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ЭтоПоступлениеНаБаланс
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Дата,
	|	ТаблицаОсновныеСредства.Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию),
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ТаблицаОсновныеСредства.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию
	|	КОНЕЦ,
	|	ТаблицаОсновныеСредства.НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента,
	|	ТаблицаОсновныеСредства.НомерСтроки,
	|	2
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ЭтоПоступлениеНаБаланс
	|	И ТаблицаОсновныеСредства.ПообъектныйУчет
	|	И (ТаблицаОсновныеСредства.ПринятиеСВводом
	|	ИЛИ ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию <> ДАТАВРЕМЯ(1, 1, 1)
	|	И
	|		ТаблицаОсновныеСредства.ПорядокПогашенияСтоимости <> ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Дата,
	|	ТаблицаОсновныеСредства.Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание),
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.Дата > ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию
	|			ТОГДА ТаблицаОсновныеСредства.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию
	|	КОНЕЦ,
	|	ТаблицаОсновныеСредства.НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента,
	|	ТаблицаОсновныеСредства.НомерСтроки,
	|	3
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ЭтоПоступлениеНаБаланс
	|	И ТаблицаОсновныеСредства.ПообъектныйУчет
	|	И ТаблицаОсновныеСредства.ПринятиеСВводом
	|	И
	|		ТаблицаОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок1,
	|	Порядок2";

	НомераТаблиц.Вставить("НачислениеАмортизацииОСБухгалтерскийУчет", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОсновныеСредства.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.НачислятьАмортизацию КАК НачислятьАмортизацию
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ЭтоПоступлениеНаБаланс
	|	И ТаблицаОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|	И ТаблицаОсновныеСредства.СпособНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|	И НЕ ТаблицаОсновныеСредства.НачислятьАмортизацию";
	
	НомераТаблиц.Вставить("ПараметрыАмортизацииОСБухгалтерскийУчет", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОсновныеСредства.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	|	ТаблицаОсновныеСредства.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ЭтоПоступлениеНаБаланс";
	
	НомераТаблиц.Вставить("АмортизацияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
	|	ОсновныеСредства.КЭКЗатрат КАК КЭК,
	|	ОсновныеСредства.СубконтоЗатрат1 КАК Субконто1,
	|	ОсновныеСредства.СубконтоЗатрат2 КАК Субконто2,
	|	ОсновныеСредства.СубконтоЗатрат3 КАК Субконто3,
	|	ОсновныеСредства.СтатьяПрочихРасходов КАК СубконтоНУ,
	|	ОсновныеСредства.КПСЗатрат КАК КПС,
	|	ОсновныеСредства.ПодразделениеЗатрат КАК Подразделение
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ОсновныеСредства.Ссылка)
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|	И ОсновныеСредства.Ссылка.ВидПоступления В(&ОперацииПоступленияНаБаланс)
	|	И ОсновныеСредства.ПорядокПогашенияСтоимости <> ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СтоимостьНеПогашается)";
	
	НомераТаблиц.Вставить("РасчетАмортизацииОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И (ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|					ИЛИ ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка))
	|			ТОГДА ОсновныеСредства.ОставшийсяСрокПолезногоИспользования
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СрокИспользованияДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И (ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|					ИЛИ ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|					ИЛИ ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции))
	|			ТОГДА ОсновныеСредства.Сумма - ОсновныеСредства.СуммаАмортизации - ОсновныеСредства.СуммаОбесценения
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|			ТОГДА ОсновныеСредства.КоэффициентУскорения
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентУскорения,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции)
	|			ТОГДА ОсновныеСредства.ПараметрВыработки
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ПараметрВыработки,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции)
	|			ТОГДА ОсновныеСредства.ПредполагаемыйОбъемВыработки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПредполагаемыйОбъемВыработки
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ОсновныеСредства.Ссылка)
	|ГДЕ
	|	НЕ &ЭтоПоступлениеИзПользования
	|	И ОсновныеСредства.Ссылка = &Ссылка
	|	И (ОсновныеСредства.СрокПолезногоИспользования <> 0
	|			ИЛИ ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации))";
	
	НомераТаблиц.Вставить("ВТ_Стоимость", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СтоимостьОбъектовОС", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СтоимостьОбъектовОСПоКонтрагентам", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОсновныеСредства.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.ЦМООтправитель КАК ЦМООтправитель,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.ПодразделениеОтправитель КАК ПодразделениеОтправитель,
	|	ТаблицаОсновныеСредства.Контрагент КАК Контрагент,
	|	ТаблицаОсновныеСредства.Договор КАК Договор,
	|	ТаблицаОсновныеСредства.СчетУчетаОС КАК Счет,
	|	ТаблицаОсновныеСредства.Сумма КАК Стоимость,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.ВидПоступления КАК ВидПоступления,
	|	ТаблицаОсновныеСредства.ЭтоПоступлениеНаБаланс КАК ЭтоПоступлениеБаланс,
	|	ВЫБОР
	|		КОГДА &ВозможныГарантийныеОбязательства
	|			ТОГДА ТаблицаОсновныеСредства.НаименованиеГТ
	|		ИНАЧЕ """"	
	|	КОНЕЦ КАК НаименованиеГТ,
	|	ВЫБОР
	|		КОГДА &ВозможныГарантийныеОбязательства
	|			ТОГДА ТаблицаОсновныеСредства.НомерГТ
	|		ИНАЧЕ """"	
	|	КОНЕЦ КАК НомерГТ,
	|	ВЫБОР
	|		КОГДА &ВозможныГарантийныеОбязательства
	|			ТОГДА ТаблицаОсновныеСредства.ДатаГТ
	|		ИНАЧЕ """"	
	|	КОНЕЦ КАК ДатаГТ,
	|	ВЫБОР
	|		КОГДА &ВозможныГарантийныеОбязательства
	|			ТОГДА ТаблицаОсновныеСредства.СрокДействияГТ
	|		ИНАЧЕ """"	
	|	КОНЕЦ КАК СрокДействияГТ,
	|	ВЫБОР
	|		КОГДА СубконтоДоговоры.ВидСубконто ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаОсновныеСредства.Договор
	|	КОНЕЦ КАК ДоговорБаланс,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАЗабаланс)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПоступлениеЗабаланс,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21)
	|				ИЛИ ТаблицаОсновныеСредства.ВидПоступления В (&ОперацииПоступленияНаБаланс)
	|					И ТаблицаОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию)
	|					И ТаблицаОсновныеСредства.ПринятиеСВводом
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПоступлениеОперУчет,
	|	ВЫБОР
	|		КОГДА (ТаблицаОсновныеСредства.ЦМО <> ТаблицаОсновныеСредства.ЦМООтправитель
	|				ИЛИ ТаблицаОсновныеСредства.Подразделение <> ТаблицаОсновныеСредства.ПодразделениеОтправитель)
	|				И НЕ ТаблицаОсновныеСредства.ПередачаЧастейОбъектов
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьПеремещение,
	|	ВЫБОР
	|		КОГДА (ТаблицаОсновныеСредства.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды)
	|				ИЛИ ТаблицаОсновныеСредства.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользования))
	|				И НЕ ТаблицаОсновныеСредства.ПередачаЧастейОбъектов
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПеремещениеБаланс,
	|	ВЫБОР
	|		КОГДА (ТаблицаОсновныеСредства.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАрендыОперУчет)
	|				ИЛИ ТаблицаОсновныеСредства.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользованияОперУчет))
	|				И НЕ ТаблицаОсновныеСредства.ПередачаЧастейОбъектов
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПеремещениеОперУчет,
	|	ТаблицаОсновныеСредства.ПередачаЧастейОбъектов КАК ПередачаЧастейОбъектов
	|ПОМЕСТИТЬ ВТ_Стоимость
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК СубконтоДоговоры
	|		ПО ТаблицаОсновныеСредства.СчетУчетаОС = СубконтоДоговоры.Ссылка
	|			И (СубконтоДоговоры.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры))
	|ГДЕ
	|	ТаблицаОсновныеСредства.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА Таблица.ЭтоПеремещениеОперУчет
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|	КОНЕЦ КАК ВидРаспоряжения,
	|	Таблица.Период КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.ОсновноеСредство КАК ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	Таблица.ЦМООтправитель КАК ЦМО,
	|	Таблица.ДоговорБаланс КАК Договор,
	|	Таблица.ПодразделениеОтправитель КАК Подразделение,
	|	Таблица.Стоимость КАК Стоимость,
	|	Таблица.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение) КАК Событие,
	|	Таблица.НазваниеДокумента КАК НазваниеДокумента,
	|	Таблица.НомерДокумента КАК НомерДокумента,
	|	Таблица.ДатаДокумента КАК ДатаДокумента,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	"""" КАК НаименованиеГТ,
	|	"""" КАК НомерГТ,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаГТ,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК СрокДействияГТ,
	|	1 КАК НомерТаблицы
	|ИЗ
	|	ВТ_Стоимость КАК Таблица
	|ГДЕ
	|	(Таблица.ЭтоПеремещениеБаланс
	|			ИЛИ Таблица.ЭтоПеремещениеОперУчет)
	|	И Таблица.ЕстьПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВЫБОР
	|		КОГДА Таблица.ЭтоПеремещениеОперУчет
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|	КОНЕЦ,
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.ЦМО,
	|	Таблица.ДоговорБаланс,
	|	Таблица.Подразделение,
	|	Таблица.Стоимость,
	|	Таблица.Количество,
	|	ВЫБОР
	|		КОГДА Таблица.ЭтоПоступлениеБаланс
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение)
	|	КОНЕЦ,
	|	Таблица.НазваниеДокумента,
	|	Таблица.НомерДокумента,
	|	Таблица.ДатаДокумента,
	|	Таблица.НомерСтроки,
	|	Таблица.НаименованиеГТ,
	|	Таблица.НомерГТ,
	|	Таблица.ДатаГТ,
	|	Таблица.СрокДействияГТ,
	|	2
	|ИЗ
	|	ВТ_Стоимость КАК Таблица
	|ГДЕ
	|	(Таблица.ЭтоПоступлениеБаланс
	|			ИЛИ (Таблица.ЭтоПеремещениеБаланс
	|				ИЛИ Таблица.ЭтоПеремещениеОперУчет)
	|				И Таблица.ЕстьПеремещение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе),
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.ЦМО,
	|	Таблица.ДоговорБаланс,
	|	Таблица.Подразделение,
	|	Таблица.Стоимость,
	|	Таблица.Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание),
	|	Таблица.НазваниеДокумента,
	|	Таблица.НомерДокумента,
	|	Таблица.ДатаДокумента,
	|	Таблица.НомерСтроки,
	|	"""",
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	3
	|ИЗ
	|	ВТ_Стоимость КАК Таблица
	|ГДЕ
	|	Таблица.ЭтоПоступлениеБаланс
	|	И Таблица.ЭтоПоступлениеОперУчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет),
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.ЦМО,
	|	Таблица.ДоговорБаланс,
	|	Таблица.Подразделение,
	|	ВЫБОР
	|		КОГДА &Учет21Условно
	|			ТОГДА Таблица.Количество
	|		ИНАЧЕ Таблица.Стоимость
	|	КОНЕЦ,
	|	Таблица.Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету),
	|	Таблица.НазваниеДокумента,
	|	Таблица.НомерДокумента,
	|	Таблица.ДатаДокумента,
	|	Таблица.НомерСтроки,
	|	"""",
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	4
	|ИЗ
	|	ВТ_Стоимость КАК Таблица
	|ГДЕ
	|	Таблица.ЭтоПоступлениеОперУчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	НомерТаблицы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Таблица.ЭтоПоступлениеЗабаланс
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА Таблица.ЭтоПоступлениеЗабаланс
	|			ТОГДА ВЫБОР
	|					КОГДА Таблица.Счет В (&Счет01)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении)
	|				КОНЕЦ
	|		КОГДА Таблица.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзУправления)
	|				ИЛИ Таблица.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзУправленияОперУчет)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВУправление)
	|		КОГДА Таблица.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды)
	|				ИЛИ Таблица.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАрендыОперУчет)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду)
	|		КОГДА Таблица.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользования)
	|				ИЛИ Таблица.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользованияОперУчет)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПустаяСсылка)
	|	КОНЕЦ КАК ВидРаспоряжения,
	|	Таблица.Период КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.ОсновноеСредство КАК ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА &ЭтоПоступлениеИзПользования И НЕ Таблица.ПередачаЧастейОбъектов
	|			ТОГДА Таблица.ЦМООтправитель
	|		ИНАЧЕ Таблица.ЦМО
	|	КОНЕЦ КАК ЦМО,
	|	ВЫБОР
	|		КОГДА &ЭтоПоступлениеИзПользования И НЕ Таблица.ПередачаЧастейОбъектов
	|			ТОГДА Таблица.ПодразделениеОтправитель
	|		ИНАЧЕ Таблица.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &ЭтоПоступлениеИзПользования
	|				ИЛИ НЕ СубконтоКонтрагенты.ВидСубконто ЕСТЬ NULL
	|				ИЛИ НЕ СубконтоДоговоры.ВидСубконто ЕСТЬ NULL
	|			ТОГДА Таблица.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ &ЭтоПоступлениеИзПользования
	|				И НЕ СубконтоДоговоры.ВидСубконто ЕСТЬ NULL
	|			ТОГДА Таблица.Договор
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ КАК Договор,
	|	Таблица.Стоимость КАК Стоимость,
	|	Таблица.Количество КАК Количество,
	|	Таблица.НазваниеДокумента КАК НазваниеДокумента,
	|	Таблица.НомерДокумента КАК НомерДокумента,
	|	Таблица.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	ВТ_Стоимость КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК СубконтоКонтрагенты
	|		ПО Таблица.Счет = СубконтоКонтрагенты.Ссылка
	|			И (СубконтоКонтрагенты.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК СубконтоДоговоры
	|		ПО Таблица.Счет = СубконтоДоговоры.Ссылка
	|			И (СубконтоДоговоры.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры))
	|ГДЕ
	|	(Таблица.ЭтоПоступлениеЗабаланс
	|			ИЛИ &ЭтоПоступлениеИзПользования)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Таблица.НомерСтроки";
	
	НомераТаблиц.Вставить("АмортизацияОбъектовОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Таблица.Дата КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.ОсновноеСредство КАК ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА Таблица.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|				И Таблица.ПринятиеСВводом
	|			ТОГДА Таблица.Сумма - Таблица.СуммаОбесценения
	|		ИНАЧЕ Таблица.СуммаАмортизации
	|	КОНЕЦ КАК СуммаАмортизации,
	|	Таблица.СуммаОбесценения КАК СуммаОбесценения,
	|	ЛОЖЬ КАК ЭтоСписание
	|ИЗ
	|	ТаблицаОсновныеСредства КАК Таблица
	|ГДЕ
	|	Таблица.ЭтоПоступлениеНаБаланс
	|	И (ВЫБОР
	|				КОГДА Таблица.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|						И Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|						И Таблица.ПринятиеСВводом
	|					ТОГДА Таблица.Сумма
	|				ИНАЧЕ Таблица.СуммаАмортизации
	|			КОНЕЦ <> 0
	|			ИЛИ Таблица.СуммаОбесценения <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Таблица.Дата,
	|	Таблица.Организация,
	|	Таблица.ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.СуммаАмортизации,
	|	Таблица.СуммаОбесценения,
	|	ИСТИНА
	|ИЗ
	|	ТаблицаОсновныеСредства КАК Таблица
	|ГДЕ
	|	Таблица.ЭтоПоступлениеНаБаланс
	|	И Таблица.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию)
	|	И Таблица.ПринятиеСВводом
	|	И (Таблица.СуммаАмортизации <> 0
	|			ИЛИ Таблица.СуммаОбесценения <> 0)";
	
	НомераТаблиц.Вставить("ПервоначальныеСведенияОСБухгалтерскийУчет", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Количество = 0
	|			ТОГДА ОсновныеСредства.Сумма
	|		ИНАЧЕ ОсновныеСредства.Сумма / ОсновныеСредства.Количество
	|	КОНЕЦ КАК ПервоначальнаяСтоимость,
	|	СУММА(ОсновныеСредства.СуммаАмортизации) КАК ПервоначальнаяСуммаАмортизации,
	|	СУММА(ОсновныеСредства.СуммаОбесценения) КАК ПервоначальнаяСуммаОбесценения,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Количество = 0
	|			ТОГДА ОсновныеСредства.СуммаВВалюте
	|		ИНАЧЕ ОсновныеСредства.СуммаВВалюте / ОсновныеСредства.Количество
	|	КОНЕЦ КАК ПервоначальнаяСтоимостьВВалюте,
	|	ОсновныеСредства.Ссылка.ВалютаПоступления КАК ВалютаПоступления,
	|	ОсновныеСредства.Ссылка.Курс КАК Курс,
	|	ОсновныеСредства.Ссылка.Кратность КАК Кратность,
	|	СУММА(ОсновныеСредства.Количество) КАК Количество
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ОсновныеСредства.Ссылка)
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|	И &ЭтоПоступлениеИзПользования = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ,
	|	ОсновныеСредства.Ссылка.Организация,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Количество = 0
	|			ТОГДА ОсновныеСредства.Сумма
	|		ИНАЧЕ ОсновныеСредства.Сумма / ОсновныеСредства.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Количество = 0
	|			ТОГДА ОсновныеСредства.СуммаВВалюте
	|		ИНАЧЕ ОсновныеСредства.СуммаВВалюте / ОсновныеСредства.Количество
	|	КОНЕЦ,
	|	ОсновныеСредства.Ссылка.ВалютаПоступления,
	|	ОсновныеСредства.Ссылка.Курс,
	|	ОсновныеСредства.Ссылка.Кратность";
	
	НомераТаблиц.Вставить("НомераИнвентарныхКарточек", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПринятиеКУчетуОбъектовОС.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ПринятиеКУчетуОбъектовОС.Ссылка КАК Регистратор,
	|	ПринятиеКУчетуОбъектовОС.Организация КАК Организация,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.НомерИнвентарнойКарточки КАК НомерИнвентарнойКарточки,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПринятиеКУчетуОбъектовОС.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК ДатаИнвентарнойКарточки
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ПринятиеКУчетуОбъектовОСОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОбъектовОС КАК ПринятиеКУчетуОбъектовОС
	|		ПО ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = ПринятиеКУчетуОбъектовОС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ПринятиеКУчетуОбъектовОС.Ссылка)
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОС.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.СоздатьИнвентарнуюКарточку = ИСТИНА";
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыНУ(Запрос, НомераТаблиц)

	НомераТаблиц.Вставить("ПервоначальныеСведенияОСНалоговыйУчет", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ПорядокВключенияСтоимостиВСоставРасходовНУ КАК ПорядокВключенияСтоимостиВСоставРасходов,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОбъектовОСОсновныеСредства.Количество = 0
	|			ТОГДА ПринятиеКУчетуОбъектовОСОсновныеСредства.СуммаНУ
	|		ИНАЧЕ ПринятиеКУчетуОбъектовОСОсновныеСредства.СуммаНУ / ПринятиеКУчетуОбъектовОСОсновныеСредства.Количество
	|	КОНЕЦ КАК ПервоначальнаяСтоимостьНУ,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОбъектовОСОсновныеСредства.Количество = 0
	|			ТОГДА ПринятиеКУчетуОбъектовОСОсновныеСредства.СуммаНеУчитываетсяНУ
	|		ИНАЧЕ ПринятиеКУчетуОбъектовОСОсновныеСредства.СуммаНеУчитываетсяНУ / ПринятиеКУчетуОбъектовОСОсновныеСредства.Количество
	|	КОНЕЦ КАК РасходыНеУчитываетсяНУ,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОбъектовОСОсновныеСредства.Количество = 0
	|			ТОГДА ПринятиеКУчетуОбъектовОСОсновныеСредства.СуммаЕНВД
	|		ИНАЧЕ ПринятиеКУчетуОбъектовОСОсновныеСредства.СуммаЕНВД / ПринятиеКУчетуОбъектовОСОсновныеСредства.Количество
	|	КОНЕЦ КАК РасходыЕНВД,
	|	ПринятиеКУчетуОбъектовОС.Дата КАК ДатаПринятияКУчету,
	|	&Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПринятиеКУчетуОбъектовОС.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ПринятиеКУчетуОбъектовОС.Организация КАК Организация
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ПринятиеКУчетуОбъектовОСОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОбъектовОС КАК ПринятиеКУчетуОбъектовОС
	|		ПО ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = ПринятиеКУчетуОбъектовОС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ПринятиеКУчетуОбъектовОС.Ссылка)
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОС.Ссылка = &Ссылка";
	
	НомераТаблиц.Вставить("НачислениеАмортизацииОСНалоговыйУчет", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуОбъектовОС.Организация КАК Организация,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.НачислятьАмортизациюНУ КАК НачислятьАмортизацию,
	|	&Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПринятиеКУчетуОбъектовОС.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ПринятиеКУчетуОбъектовОСОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОбъектовОС КАК ПринятиеКУчетуОбъектовОС
	|		ПО ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = ПринятиеКУчетуОбъектовОС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ПринятиеКУчетуОбъектовОС.Ссылка)
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОС.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.ПорядокВключенияСтоимостиВСоставРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)";
	
	НомераТаблиц.Вставить("ПараметрыАмортизацииОСНалоговыйУчет", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуОбъектовОС.Организация КАК Организация,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.СрокПолезногоИспользованияНУ КАК СрокПолезногоИспользования,
	|	&Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПринятиеКУчетуОбъектовОС.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ПринятиеКУчетуОбъектовОСОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОбъектовОС КАК ПринятиеКУчетуОбъектовОС
	|		ПО ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = ПринятиеКУчетуОбъектовОС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ПринятиеКУчетуОбъектовОС.Ссылка)
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОС.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.ПорядокВключенияСтоимостиВСоставРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)";
	
	НомераТаблиц.Вставить("ПараметрыАмортизационнойПремииНалоговыйУчет", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуОбъектовОС.Организация КАК Организация,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.СчетУчетаЗатратПоАмортизационнойПремии КАК СчетУчетаРасходов,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.СубконтоПоАмортизационнойПремии1 КАК СубконтоРасходов1,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.СубконтоПоАмортизационнойПремии2 КАК СубконтоРасходов2,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.СубконтоПоАмортизационнойПремии3 КАК СубконтоРасходов3,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ПодразделениеПоАмортизационнойПремии КАК ПодразделениеРасходов,
	|	&Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПринятиеКУчетуОбъектовОС.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ПринятиеКУчетуОбъектовОСОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОбъектовОС КАК ПринятиеКУчетуОбъектовОС
	|		ПО ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = ПринятиеКУчетуОбъектовОС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ПринятиеКУчетуОбъектовОС.Ссылка)
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОС.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.ПорядокВключенияСтоимостиВСоставРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.ПроцентКапитальныхВложенийВключаемыхВРасходыНУ > 0";
	
	НомераТаблиц.Вставить("НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуОбъектовОС.Организация КАК Организация,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.СпециальныйКоэффициентНУ КАК СпециальныйКоэффициент,
	|	&Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПринятиеКУчетуОбъектовОС.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ПринятиеКУчетуОбъектовОСОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОбъектовОС КАК ПринятиеКУчетуОбъектовОС
	|		ПО ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = ПринятиеКУчетуОбъектовОС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ПринятиеКУчетуОбъектовОС.Ссылка)
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОС.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.ПорядокВключенияСтоимостиВСоставРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)";
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыУСН(Запрос, НомераТаблиц)

	НомераТаблиц.Вставить("ПервоначальныеСведенияОСНалоговыйУчетУСН", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ПорядокВключенияСтоимостиВСоставРасходовУСН КАК ПорядокВключенияСтоимостиВСоставРасходовУСН,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОбъектовОСОсновныеСредства.ПорядокВключенияСтоимостиВСоставРасходовУСН = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставРасходовНаОСиНМА)
	|			ТОГДА ПринятиеКУчетуОбъектовОСОсновныеСредства.СрокПолезногоИспользованияУСН
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СрокПолезногоИспользования,
	|	&Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПринятиеКУчетуОбъектовОС.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ПринятиеКУчетуОбъектовОС.Организация КАК Организация
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ПринятиеКУчетуОбъектовОСОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОбъектовОС КАК ПринятиеКУчетуОбъектовОС
	|		ПО ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = ПринятиеКУчетуОбъектовОС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ПринятиеКУчетуОбъектовОС.Ссылка)
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОС.Ссылка = &Ссылка";

КонецПроцедуры

Процедура ИнициализироватьЗапросыДМ(Запрос, НомераТаблиц)
	
	НомераТаблиц.Вставить("ВТ_ОстаткиМЦКапвложения", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_ОстаткиМЦНаСчетах", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_ОстаткиМЦВсего", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("НаличиеДрагМатериаловВОбъектахНФА", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() + 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МЦСДрагоценнымиМатериалами.Ссылка КАК ДокументСсылка,
	|	МЦСДрагоценнымиМатериалами.ОбъектМЦ КАК ОбъектМЦ,
	|	МЦСДрагоценнымиМатериалами.Количество КАК КоличествоМЦ,
	|	ВЫРАЗИТЬ(МЦСДрагоценнымиМатериалами.Ссылка КАК Документ.ПринятиеКУчетуОбъектовОС).Организация КАК Организация
	|ПОМЕСТИТЬ ОстаткиМЦКапвложения
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.МЦСДрагоценнымиМатериалами КАК МЦСДрагоценнымиМатериалами
	|ГДЕ
	|	МЦСДрагоценнымиМатериалами.Ссылка = &Ссылка
	|	И МЦСДрагоценнымиМатериалами.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ОбъектМЦ,
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиМЦНаСчетах
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&МассивСчетовМЦ),
	|			&МассивСубконтоМЦ,
	|			Организация = &Организация
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ОстаткиМЦКапвложения.ОбъектМЦ
	|					ИЗ
	|						ОстаткиМЦКапвложения КАК ОстаткиМЦКапвложения)) КАК ЖурналПроводокЕПСБУОстатки
	|ГДЕ
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&МассивСчетовМЦ),
	|			&МассивСубконтоМЗ,
	|			Организация = &Организация
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ОстаткиМЦКапвложения.ОбъектМЦ
	|					ИЗ
	|						ОстаткиМЦКапвложения КАК ОстаткиМЦКапвложения)) КАК ЖурналПроводокЕПСБУОстатки
	|ГДЕ
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт > 0
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			&Период,
	|			Организация = &Организация 
	|				И ИнвентарныйНомер = Значение(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) 
	|				И ОсновноеСредство В (ВЫБРАТЬ
	|						ОстаткиМЦКапвложения.ОбъектМЦ
	|					ИЗ
	|						ОстаткиМЦКапвложения КАК ОстаткиМЦКапвложения)) КАК СтоимостьОбъектовОСОстатки 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.ОсновноеСредство,
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В (ВЫБРАТЬ
	|						ОстаткиМЦКапвложения.ОбъектМЦ
	|					ИЗ
	|						ОстаткиМЦКапвложения КАК ОстаткиМЦКапвложения)
	|               И ИнвентарныйНомер = Значение(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|				И (ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование)
	|					ИЛИ ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении))) КАК СтоимостьОбъектовОСПоКонтрагентамОстатки
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиМЦНаСчетах.ОбъектМЦ КАК ОбъектМЦ,
	|	СУММА(ОстаткиМЦНаСчетах.КоличествоОстаток) КАК КоличествоОстатокВсего
	|ПОМЕСТИТЬ ОстаткиМЦВсего
	|ИЗ
	|	ОстаткиМЦНаСчетах КАК ОстаткиМЦНаСчетах
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиМЦНаСчетах.ОбъектМЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.НомерСтроки КАК НомерСтроки,
	|	ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.Ссылка.Организация КАК Организация,
	|	ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.ОбъектНФА КАК ОбъектНФА,
	|	ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.ИнвНомер КАК ИнвНомер,
	|	ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.ВидДрагМатериала КАК ВидДрагМатериала,
	|	ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.МассаДМ КАК МассаДМ,
	|	ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.КоличествоДМ КАК КоличествоДМ,
	|	&ИмяДокумента КАК Основание,
	|	&НомерДокумента КАК НомерОснования,
	|	ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.Ссылка.Дата КАК ДатаОснования,
	|	ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.ЕдИзм КАК ЕдИзм,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.Ссылка КАК Документ.ПринятиеКУчетуОбъектовОС).ВидПоступления = Значение(Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс)
	|			ТОГДА ВЫРАЗИТЬ(ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.Ссылка КАК Документ.ПринятиеКУчетуОбъектовОС).АналитикаОперацииСДрагМатериалами
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыАналитикиОперацииСДрагМатериалами.ПустаяСсылка)
	|	КОНЕЦ КАК АналитикаОперации	
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ДрагоценныеМатериалы КАК ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиМЦКапвложения КАК ОстаткиМЦКапвложения
	|		ПО (ОстаткиМЦКапвложения.ДокументСсылка = ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.Ссылка)
	|			И (ОстаткиМЦКапвложения.ОбъектМЦ = ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.ОбъектНФА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.Ссылка)
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОбъектовОСДрагоценныеМатериалы.МассаДМ > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ОстаткиМЦКапвложения.ДокументСсылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ,
	|	ОстаткиМЦКапвложения.ДокументСсылка,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	0,
	|	ОстаткиМЦКапвложения.Организация,
	|	ОстаткиМЦКапвложения.ОбъектМЦ,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка),
	|	НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала,
	|	ВЫБОР
	|		КОГДА ОстаткиМЦКапвложения.КоличествоМЦ = ОстаткиМЦВсего.КоличествоОстатокВсего
	|			ТОГДА НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток
	|		ИНАЧЕ ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток * ОстаткиМЦКапвложения.КоличествоМЦ / ОстаткиМЦВсего.КоличествоОстатокВсего КАК ЧИСЛО(17,8))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОстаткиМЦКапвложения.КоличествоМЦ = ОстаткиМЦВсего.КоличествоОстатокВсего
	|			ТОГДА НаличиеДрагМатериаловВОбъектахНФАОстатки.КоличествоДМОстаток
	|		ИНАЧЕ НаличиеДрагМатериаловВОбъектахНФАОстатки.КоличествоДМОстаток * ОстаткиМЦКапвложения.КоличествоМЦ / ОстаткиМЦВсего.КоличествоОстатокВсего
	|	КОНЕЦ,
	|	&ИмяДокумента,
	|	&НомерДокумента,
	|	ОстаткиМЦКапвложения.ДокументСсылка.Дата,
	|	НаличиеДрагМатериаловВОбъектахНФАОстатки.ЕдИзм,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыАналитикиОперацииСДрагМатериалами.ПустаяСсылка)
	|ИЗ
	|	ОстаткиМЦКапвложения КАК ОстаткиМЦКапвложения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВОбъектахНФА.Остатки(&Период, Организация = &Организация) КАК НаличиеДрагМатериаловВОбъектахНФАОстатки
	|		ПО ОстаткиМЦКапвложения.ОбъектМЦ = НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА
	|			И (НаличиеДрагМатериаловВОбъектахНФАОстатки.Организация = ОстаткиМЦКапвложения.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиМЦВсего КАК ОстаткиМЦВсего
	|		ПО (ОстаткиМЦВсего.ОбъектМЦ = ОстаткиМЦКапвложения.ОбъектМЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ОстаткиМЦКапвложения.ДокументСсылка)
	|ГДЕ
	|	ОстаткиМЦКапвложения.ДокументСсылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	 
КонецПроцедуры	

Процедура ИнициализироватьЗапросыПоОтражениюЭДВУчете(Запрос, НомераТаблиц)
	
	НомераТаблиц.Вставить("ОтражениеЭДВУчете", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	РегистрыНакопления.ОтражениеЭДВУчете.ТекстЗапросаПоОтражениюЭДВУчете(Запрос.Параметры.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуОбъектовОС";
	КомандаПечати.Идентификатор		= "АктПриемаПередачи0510448";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о приеме-передаче НФА'"), "0510448", "61н", "100н");
	КомандаПечати.Порядок			= 1;
	УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "НФАПереданыЭлектроннымАктом",
		Ложь, ВидСравнения.Равно);
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);

	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуОбъектовОС";
	КомандаПечати.Идентификатор		= "ОтветныйАктПриемаПередачи0510448";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Ответный Акт о приеме-передаче НФА'"), "0510448", "61н", "100н");
	КомандаПечати.Порядок			= 1;
	УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "НФАПереданыЭлектроннымАктом",
		Истина, ВидСравнения.Равно);
	
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "ТребованиеНакладная0510451_100н", 2);
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "АктПриемаПередачи0504101_103н", 101);
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуОбъектовОС";
	КомандаПечати.Идентификатор		= "Накладная0504204";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(
		НСтр("ru = 'Требование - накладная'"), "0504204", "52н", , Истина);
	КомандаПечати.Порядок			= 103;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуОбъектовОС";
	КомандаПечати.Идентификатор		= "ПриходныйОрдер0504207_103н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Приходный ордер'"), "0504207", "52н", "103н");
	КомандаПечати.Порядок			= 5;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуОбъектовОС";
	КомандаПечати.Идентификатор		= "Ведомость0504210_103н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Ведомость выдачи ОС'"), "0504210", "52н", "103н");
	КомандаПечати.Порядок			= 6;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "СправкаОСодержанииДрагМатериалов", 7);
	
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "АктПриемаПередачи0504101", 102);
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуОбъектовОС";
	КомандаПечати.Идентификатор		= "ПриходныйОрдер0504207_52н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Приходный ордер'"), "0504207", "52н",, Истина);
	КомандаПечати.Порядок			= 104;
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуОбъектовОС";
	КомандаПечати.Идентификатор		= "Ведомость0504210";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Ведомость выдачи ОС'"), "0504210", "52н",, Истина);
	КомандаПечати.Порядок			= 105;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"АктПриемаПередачи0510448") Тогда
		
		ТабличныйДокумент = УправлениеПечатьюБГУ.Напечатать0510448(МассивОбъектов, ОбъектыПечати, Ложь);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"АктПриемаПередачи0510448", "Акт о приеме-передаче НФА (ф.0510448)",
			ТабличныйДокумент);
		
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОтветныйАктПриемаПередачи0510448") Тогда
		
		ТабличныйДокумент = ЭлектронныеДокументыБГУ.НапечататьОтветный0510448(МассивОбъектов, ОбъектыПечати,
			ДанныеДляПечатиОтветного0510448(МассивОбъектов));
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ОтветныйАктПриемаПередачи0510448", "Ответный Акт о приеме-передаче НФА (ф.0510448)",
			ТабличныйДокумент);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"АктПриемаПередачи0504101") Тогда
		
		ТабличныйДокумент = УправлениеПечатьюБГУ.Напечатать0504101(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"АктПриемаПередачи0504101", "Акт о приеме-передаче НФА (ф.0504101)", ТабличныйДокумент);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"АктПриемаПередачи0504101_103н") Тогда
		
		ТабличныйДокумент = УправлениеПечатьюБГУ.Напечатать0504101(МассивОбъектов, ОбъектыПечати, "103н");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"АктПриемаПередачи0504101_103н", "Акт о приеме-передаче НФА (ф.0504101)", ТабличныйДокумент);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Накладная0504204") Тогда
		
		ТабличныйДокумент = Печать0504204(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Накладная0504204", "Требование-накладная (ф. 0504204)", ТабличныйДокумент);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриходныйОрдер0504207_103н") Тогда
		
		ТабличныйДокумент = Печать0504207(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ПриходныйОрдер0504207_103н");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПриходныйОрдер0504207_103н", "Приходный ордер (ф.0504207)", ТабличныйДокумент);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриходныйОрдер0504207_52н") Тогда
		
		ТабличныйДокумент = Печать0504207(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ПриходныйОрдер0504207");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПриходныйОрдер0504207_52н", "Приходный ордер (ф.0504207)", ТабличныйДокумент);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Ведомость0504210_103н") Тогда
		
		ТабличныйДокумент = Печать0504210(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ВедомостьВыдачиНФА_0504210_103н");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Ведомость0504210_103н", "Ведомость выдачи ОС (ф. 0504210)", ТабличныйДокумент);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Ведомость0504210") Тогда
		
		ТабличныйДокумент = Печать0504210(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ВедомостьВыдачиНФА_0504210_52н");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Ведомость0504210", "Ведомость выдачи ОС (ф. 0504210)", ТабличныйДокумент);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"СправкаОСодержанииДрагМатериалов") Тогда
		
		ТабличныйДокумент = УчетДрагМатериалов.ПечатьСправкиОСодержанииДрагМатериалов(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"СправкаОСодержанииДрагМатериалов", "Справка о содержании драг. материалов", ТабличныйДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

Функция Печать0504204(МассивОбъектов, ОбъектыПечати)
	
	ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ЕдИзмШт", ЕдиницаИзмерения);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	Документ.Проведен КАК Проведен,
	|	Документ.Организация КАК Организация,
	|	Документ.ИФО КАК ИФО,
	|	"""" КАК пКоррСчет,
	|	Документ.ЦМО КАК ЦМО,
	|	Документ.ЦМО КАК ЦМООтправитель,
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Организация.НаименованиеПолное КАК пНаименованиеОрганизации,
	|	Документ.Организация.КодОКПО КАК пКодОКПО,
	|	Документ.ЦМО.Сотрудник КАК МолПолучатель,
	|	Документ.ЦМО.Сотрудник КАК МолОтправитель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Документ.Подразделение, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА Документ.Подразделение.ОбособленноеПодразделение
	|						ТОГДА Документ.Подразделение.НаименованиеПолное
	|					ИНАЧЕ Документ.Подразделение.Наименование
	|				КОНЕЦ
	|	КОНЕЦ КАК пПодразделениеПолучатель,
	|	Документ.Подразделение.Код КАК пПодразделениеПолучательКод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Документ.Подразделение, 0) <> 0
	|			ТОГДА ВЫБОР
	|					КОГДА Документ.Подразделение.ОбособленноеПодразделение
	|						ТОГДА Документ.Подразделение.НаименованиеПолное
	|					ИНАЧЕ Документ.Подразделение.Наименование
	|				КОНЕЦ
	|	КОНЕЦ КАК пПодразделениеОтправитель,
	|	Документ.ПодразделениеОтправитель.Код КАК пПодразделениеОтправительКод,
	|	"""" КАК Затребовал,
	|	"""" КАК ОтпускРазрешил,
	|	Документ.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель,
	|	Документ.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК Номенклатура,
	|	ОсновныеСредства.ОсновноеСредство.Код КАК пКодМЦ,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ОсновныеСредства.ОсновноеСредство.Наименование
	|		ИНАЧЕ ОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК пНоменклатура,
	|	ОсновныеСредства.ОсновноеСредство.Наименование КАК НоменклатураНаименование,
	|	ОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения).Код КАК пКодЕдиницы,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения).Наименование КАК пЕдиница,
	|	ОсновныеСредства.Количество КАК пЗатребовано,
	|	ОсновныеСредства.Количество КАК пКоличество,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Количество = 0
	|			ТОГДА ОсновныеСредства.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ОсновныеСредства.Сумма / ОсновныеСредства.Количество КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК пЦена,
	|	ОсновныеСредства.Сумма КАК пСумма,
	|	ОсновныеСредства.ИнвентарныйНомер КАК пНоменклатурныйНомер,
	|	ОсновныеСредства.СчетУчетаОС КАК Счет,
	|	ОсновныеСредства.СчетУчетаОС.КОСГУКт КАК КЭК,
	|	ОсновныеСредства.КПС КАК КПС,
	|	ОсновныеСредства.Ссылка.КФО КАК КФО,
	|	"""" КАК Примечание
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(Проводки.СчетДт, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетДт,
	|	ЕСТЬNULL(Проводки.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПСДт,
	|	ЕСТЬNULL(Проводки.КЭКДт, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭКДт,
	|	ЕСТЬNULL(Проводки.СчетКт, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетКт,
	|	ЕСТЬNULL(Проводки.КПСКт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПСКт,
	|	ЕСТЬNULL(Проводки.КЭККт, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭККт,
	|	ЕСТЬNULL(Проводки.КФО, ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)) КАК КФО,
	|	Проводки.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА Проводки.СубконтоКт1 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ВЫРАЗИТЬ(Проводки.СубконтоКт1 КАК Справочник.ОсновныеСредства)
	|		КОГДА Проводки.СубконтоКт2 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ВЫРАЗИТЬ(Проводки.СубконтоКт2 КАК Справочник.ОсновныеСредства)
	|		КОГДА Проводки.СубконтоКт3 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ВЫРАЗИТЬ(Проводки.СубконтоКт3 КАК Справочник.ОсновныеСредства)
	|	КОНЕЦ КАК Материал,
	|	Проводки.НомерСтроки КАК НомерСтроки,
	|	Проводки.Регистратор КАК Регистратор,
	|	Проводки.КоличествоКт КАК КоличествоКт,
	|	Проводки.ЖурналОпераций КАК ЖурналОпераций
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(, , Регистратор В (&МассивОбъектов), , ) КАК Проводки
	|ГДЕ
	|	(Проводки.СчетДт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|			ИЛИ Проводки.СчетКт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский))
	|	И (Проводки.Регистратор, Проводки.СчетКт) В
	|			(ВЫБРАТЬ
	|				ВТ.Ссылка,
	|				ВТ.СчетУчетаОС
	|			ИЗ
	|				Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ВТ
	|			ГДЕ
	|				ВТ.Ссылка В (&МассивОбъектов))
	|ИТОГИ ПО
	|	Регистратор";
	
	Возврат УправлениеПечатьюБГУ.ПечатьТребованияНакладной0504204(Запрос.ВыполнитьПакет(), ОбъектыПечати);
	
КонецФункции

Функция Печать0504207(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов"		, МассивОбъектов);
	Запрос.УстановитьПараметр("ВалютаРубли"			, Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ЕдИзмШт"				, ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Счета101"			, БухгалтерскийУчет.СписокСчетов("101.00,102.00,103.00,108.00,111.60"));
	Запрос.УстановитьПараметр("Счета21"				, БухгалтерскийУчет.СписокСчетов("21"));
	Запрос.УстановитьПараметр("СчетаЗабаланс"		, БухгалтерскийУчет.СписокСчетов("01,02,25,26"));
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОбъектовОС
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.ПринятиеКУчетуОбъектовОС)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОбъектовИК
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.ПринятиеКУчетуОбъектовИК)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Ссылка,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт КАК КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт КАК КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КЭККт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК Справочник.ОсновныеСредства)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК Справочник.ОсновныеСредства)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|	КОНЕЦ КАК ОсновноеСредствоСсылка,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт В (&СчетаЗабаланс)
	|			ТОГДА 3
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт В (&Счета21)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Приоритет
	|ПОМЕСТИТЬ СчетаДтКт1
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор В (&МассивОбъектов)
	|				И (ВидСубконтоДт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ИЛИ ВидСубконтоДт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ИЛИ ВидСубконтоДт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства))
	|				И СчетДт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|				И Счет В (&Счета101, &Счета21, &СчетаЗабаланс),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ОсновноеСредствоСсылка,
	|	КПСДт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаДтКт1.Ссылка КАК Ссылка,
	|	СчетаДтКт1.ОсновноеСредствоСсылка КАК ОсновноеСредствоСсылка,
	|	МИНИМУМ(СчетаДтКт1.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ СчетаДтКт2
	|ИЗ
	|	СчетаДтКт1 КАК СчетаДтКт1
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаДтКт1.Ссылка,
	|	СчетаДтКт1.ОсновноеСредствоСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаДтКт1.Ссылка КАК Ссылка,
	|	СчетаДтКт1.ОсновноеСредствоСсылка КАК ОсновноеСредствоСсылка,
	|	МАКСИМУМ(СчетаДтКт1.СчетДт) КАК СчетДт,
	|	МАКСИМУМ(СчетаДтКт1.КПСДт) КАК КПСДт,
	|	МАКСИМУМ(СчетаДтКт1.КПСКт) КАК КПСКт,
	|	МАКСИМУМ(СчетаДтКт1.СчетКт) КАК СчетКт,
	|	МАКСИМУМ(СчетаДтКт1.КЭКДт) КАК КЭКДт,
	|	МАКСИМУМ(СчетаДтКт1.КЭККт) КАК КЭККт,
	|	МАКСИМУМ(СчетаДтКт1.КФО) КАК КФО
	|ПОМЕСТИТЬ СчетаДтКт
	|ИЗ
	|	СчетаДтКт1 КАК СчетаДтКт1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаДтКт2 КАК СчетаДтКт2
	|		ПО СчетаДтКт1.Ссылка = СчетаДтКт2.Ссылка
	|			И СчетаДтКт1.ОсновноеСредствоСсылка = СчетаДтКт2.ОсновноеСредствоСсылка
	|			И СчетаДтКт1.Приоритет = СчетаДтКт2.Приоритет
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаДтКт1.Ссылка,
	|	СчетаДтКт1.ОсновноеСредствоСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ОсновноеСредствоСсылка,
	|	КПСДт";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПринятиеКУчетуОбъектовОС.Ссылка КАК Ссылка,
	|	ПринятиеКУчетуОбъектовОС.Номер КАК Номер,
	|	ПринятиеКУчетуОбъектовОС.Дата КАК Дата,
	|	ПринятиеКУчетуОбъектовОС.ОснованиеДляАкта КАК ВидПервичногоДокумента,
	|	ПринятиеКУчетуОбъектовОС.ДатаОснованияДляАкта КАК ДатаПервичногоДокумента,
	|	ПринятиеКУчетуОбъектовОС.НомерОснованияДляАкта КАК НомерПервичногоДокумента,
	|	"""" КАК КодАналитики,
	|	ПринятиеКУчетуОбъектовОС.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОбъектовОС.Организация.НаименованиеПолное = """"
	|			ТОГДА ПринятиеКУчетуОбъектовОС.Организация.Наименование
	|		ИНАЧЕ ПринятиеКУчетуОбъектовОС.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Получатель,
	|	ПринятиеКУчетуОбъектовОС.Организация.КодОКПО КАК ОКПОПолучатель,
	|	ПринятиеКУчетуОбъектовОС.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОбъектовОС.Подразделение.НаименованиеПолное = """"
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ПринятиеКУчетуОбъектовОС.Подразделение)
	|		ИНАЧЕ ПринятиеКУчетуОбъектовОС.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК ПодразделениеПолучатель,
	|	ПринятиеКУчетуОбъектовОС.Контрагент КАК Контрагент,
	|	ПринятиеКУчетуОбъектовОС.Контрагент.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОбъектовОС.Контрагент.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ПринятиеКУчетуОбъектовОС.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|							И НЕ ПринятиеКУчетуОбъектовОС.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|						ТОГДА ПринятиеКУчетуОбъектовОС.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|					ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ПринятиеКУчетуОбъектовОС.Контрагент)
	|				КОНЕЦ
	|		ИНАЧЕ ПринятиеКУчетуОбъектовОС.Контрагент.НаименованиеСокращенное
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОбъектовОС.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ПринятиеКУчетуОбъектовОС.Контрагент.ЮридическоеФизическоеЛицо.КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОКПОПоставщик,
	|	ПринятиеКУчетуОбъектовОС.Контрагент.ИНН КАК ИННПоставщик,
	|	ПринятиеКУчетуОбъектовОС.Контрагент.КПП КАК КПППоставщик,
	|	ПринятиеКУчетуОбъектовОС.Договор.Представление КАК Договор,
	|	ПринятиеКУчетуОбъектовОС.ЦМО.Сотрудник КАК Принял,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сдал,
	|	&ВалютаРубли КАК ВалютаДокумента,
	|	ПринятиеКУчетуОбъектовОС.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель,
	|	ПринятиеКУчетуОбъектовОС.ОтветственныйИсполнительБух КАК ОтветственныйИсполнительБух
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС КАК ПринятиеКУчетуОбъектовОС
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОС.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПринятиеКУчетуОбъектовИК.Ссылка,
	|	ПринятиеКУчетуОбъектовИК.Номер,
	|	ПринятиеКУчетуОбъектовИК.Дата,
	|	ПринятиеКУчетуОбъектовИК.ОснованиеДляАкта,
	|	ПринятиеКУчетуОбъектовИК.ДатаОснованияДляАкта,
	|	ПринятиеКУчетуОбъектовИК.НомерОснованияДляАкта,
	|	"""",
	|	ПринятиеКУчетуОбъектовИК.Организация,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОбъектовИК.Организация.НаименованиеПолное = """"
	|			ТОГДА ПринятиеКУчетуОбъектовИК.Организация.Наименование
	|		ИНАЧЕ ПринятиеКУчетуОбъектовИК.Организация.НаименованиеПолное
	|	КОНЕЦ,
	|	ПринятиеКУчетуОбъектовИК.Организация.КодОКПО,
	|	ПринятиеКУчетуОбъектовИК.Подразделение,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОбъектовИК.Подразделение.НаименованиеПолное = """"
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ПринятиеКУчетуОбъектовИК.Подразделение)
	|		ИНАЧЕ ПринятиеКУчетуОбъектовИК.Подразделение.НаименованиеПолное
	|	КОНЕЦ,
	|	ПринятиеКУчетуОбъектовИК.Контрагент,
	|	ПринятиеКУчетуОбъектовИК.Контрагент.ЮридическоеФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОбъектовИК.Контрагент.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ПринятиеКУчетуОбъектовИК.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|							И НЕ ПринятиеКУчетуОбъектовИК.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|						ТОГДА ПринятиеКУчетуОбъектовИК.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|					ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ПринятиеКУчетуОбъектовИК.Контрагент)
	|				КОНЕЦ
	|		ИНАЧЕ ПринятиеКУчетуОбъектовИК.Контрагент.НаименованиеСокращенное
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОбъектовИК.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ПринятиеКУчетуОбъектовИК.Контрагент.ЮридическоеФизическоеЛицо.КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ПринятиеКУчетуОбъектовИК.Контрагент.ИНН,
	|	ПринятиеКУчетуОбъектовИК.Контрагент.КПП,
	|	"""",
	|	ПринятиеКУчетуОбъектовИК.ЦМО.Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
	|	&ВалютаРубли,
	|	ПринятиеКУчетуОбъектовИК.ОтветственныйИсполнитель,
	|	ПринятиеКУчетуОбъектовИК.ОтветственныйИсполнительБух
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовИК КАК ПринятиеКУчетуОбъектовИК
	|ГДЕ
	|	ПринятиеКУчетуОбъектовИК.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка КАК Ссылка,
	|	1 КАК Порядок,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство КАК Номенклатура,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство.Наименование КАК НоменклатураНаименование,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство.НоменклатурныйНомер КАК НомерНоменклатурный,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Сумма КАК Всего,
	|	0 КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДС,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Сумма КАК Сумма,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Количество КАК Количество,
	|	СчетаДтКт.СчетДт КАК СчетДт,
	|	СчетаДтКт.КПСДт КАК КПСДт,
	|	СчетаДтКт.КПСКт КАК КПСКт,
	|	СчетаДтКт.СчетКт КАК СчетКт,
	|	СчетаДтКт.КЭКДт КАК КЭКДт,
	|	СчетаДтКт.КЭККт КАК КЭККт,
	|	СчетаДтКт.КФО КАК КФО,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения) КАК ЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения).Наименование КАК ЕдиницаНаименование,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения).Код КАК ЕдиницаКод
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ПринятиеКУчетуОбъектовОСОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка = СчетаДтКт.Ссылка
	|			И ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство = СчетаДтКт.ОсновноеСредствоСсылка
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПринятиеКУчетуОбъектовИКОсновныеСредства.Ссылка,
	|	1,
	|	ПринятиеКУчетуОбъектовИКОсновныеСредства.НомерСтроки,
	|	ПринятиеКУчетуОбъектовИКОсновныеСредства.ОсновноеСредство,
	|	ПринятиеКУчетуОбъектовИКОсновныеСредства.ОсновноеСредство.Наименование,
	|	ПринятиеКУчетуОбъектовИКОсновныеСредства.ОсновноеСредство.НаименованиеПолное,
	|	ПринятиеКУчетуОбъектовИКОсновныеСредства.ОсновноеСредство.НоменклатурныйНомер,
	|	ПринятиеКУчетуОбъектовИКОсновныеСредства.Сумма,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка),
	|	ПринятиеКУчетуОбъектовИКОсновныеСредства.Сумма,
	|	ПринятиеКУчетуОбъектовИКОсновныеСредства.Количество,
	|	СчетаДтКт.СчетДт,
	|	СчетаДтКт.КПСДт,
	|	СчетаДтКт.КПСКт,
	|	СчетаДтКт.СчетКт,
	|	СчетаДтКт.КЭКДт,
	|	СчетаДтКт.КЭККт,
	|	СчетаДтКт.КФО,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения),
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения).Наименование,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения).Код
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовИК.ОсновныеСредства КАК ПринятиеКУчетуОбъектовИКОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПринятиеКУчетуОбъектовИКОсновныеСредства.Ссылка = СчетаДтКт.Ссылка
	|			И ПринятиеКУчетуОбъектовИКОсновныеСредства.ОсновноеСредство = СчетаДтКт.ОсновноеСредствоСсылка
	|ГДЕ
	|	ПринятиеКУчетуОбъектовИКОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Порядок,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат УправлениеПечатьюБГУ.ПечатьПриходногоОрдера_0504207(РезультатЗапроса, ОбъектыПечати,, ИмяМакета);
	
КонецФункции

Функция Печать0504210(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивОбъектов"	, МассивОбъектов);
	Запрос.УстановитьПараметр("ЕдИзмШт"			, Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка КАК Ссылка,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	МИНИМУМ(ПринятиеКУчетуОбъектовОСОсновныеСредства.НомерСтроки) КАК НомерСтроки,
	|	СУММА(ПринятиеКУчетуОбъектовОСОсновныеСредства.Количество) КАК Количество,
	|	СУММА(ПринятиеКУчетуОбъектовОСОсновныеСредства.Сумма) КАК Сумма
	|ПОМЕСТИТЬ СписокОС
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ПринятиеКУчетуОбъектовОСОсновныеСредства
	|ГДЕ
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка В(&МассивОбъектов)
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию)
	|	И ПринятиеКУчетуОбъектовОСОсновныеСредства.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию
	|
	|СГРУППИРОВАТЬ ПО
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.Ссылка,
	|	ПринятиеКУчетуОбъектовОСОсновныеСредства.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУСубконто.Регистратор КАК Регистратор,
	|	ЖурналПроводокЕПСБУСубконто.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ НомераПроводок
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Субконто КАК ЖурналПроводокЕПСБУСубконто
	|ГДЕ
	|	(ЖурналПроводокЕПСБУСубконто.Регистратор, ЖурналПроводокЕПСБУСубконто.Значение) В
	|			(ВЫБРАТЬ
	|				СписокОС.Ссылка КАК Ссылка,
	|				СписокОС.ОсновноеСредство КАК ОсновноеСредство
	|			ИЗ
	|				СписокОС КАК СписокОС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУ.Регистратор КАК Документ.ПринятиеКУчетуОбъектовОС) КАК Регистратор,
	|	ЖурналПроводокЕПСБУ.СчетДт КАК СчетДт,
	|	ЖурналПроводокЕПСБУ.КПСДт КАК КПСДт,
	|	ЖурналПроводокЕПСБУ.КЭКДт КАК КЭКДт,
	|	ЖурналПроводокЕПСБУ.СчетКт КАК СчетКт,
	|	ЖурналПроводокЕПСБУ.КПСКт КАК КПСКт,
	|	ЖурналПроводокЕПСБУ.КЭККт КАК КЭККт,
	|	ЖурналПроводокЕПСБУ.КФО КАК КФО
	|ПОМЕСТИТЬ Движения
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЖурналПроводокЕПСБУ
	|ГДЕ
	|	(ЖурналПроводокЕПСБУ.Регистратор, ЖурналПроводокЕПСБУ.НомерСтроки) В
	|			(ВЫБРАТЬ
	|				НомераПроводок.Регистратор КАК Регистратор,
	|				НомераПроводок.НомерСтроки КАК НомерСтроки
	|			ИЗ
	|				НомераПроводок КАК НомераПроводок)
	|	И (ЖурналПроводокЕПСБУ.СчетДт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|			ИЛИ ЖурналПроводокЕПСБУ.СчетКт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский))";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШапкаДокумента.Ссылка КАК Ссылка,
	|	ШапкаДокумента.Дата КАК Дата,
	|	ШапкаДокумента.Номер КАК Номер,
	|	ШапкаДокумента.Организация КАК Организация,
	|	ШапкаДокумента.Организация.НаименованиеПолное КАК ОрганизацияНаименование,
	|	ШапкаДокумента.Организация.КодОКПО КАК ОрганизацияКодОКПО,
	|	ШапкаДокумента.Подразделение.Наименование КАК ПодразделениеНаименование,
	|	ШапкаДокумента.ЦМО.Сотрудник КАК МОЛ,
	|	ШапкаДокумента.Подразделение КАК Подразделение,
	|	ШапкаДокумента.Ответственный КАК ОтветственныйИсполнитель
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС КАК ШапкаДокумента
	|ГДЕ
	|	ШапкаДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Движения.Регистратор КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(Движения.СчетДт) КАК СчетДтПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Движения.КПСДт) КАК КПСДтПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Движения.КЭКДт) КАК КЭКДтПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Движения.СчетКт) КАК СчетКтПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Движения.КПСКт) КАК КПСКтПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Движения.КЭККт) КАК КЭККтПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Движения.КФО) КАК КФОПредставление,
	|	ЕСТЬNULL(Движения.СчетДт.Порядок, 0) КАК СчетДтПорядок,
	|	ЕСТЬNULL(Движения.СчетКт.Порядок, 0) КАК СчетКтПорядок
	|ИЗ
	|	Движения КАК Движения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	СчетДтПорядок,
	|	СчетКтПорядок
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.ЦМО КАК ЦМОПолучатель,
	|	Документ.ЦМО.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокОС.Ссылка КАК Ссылка,
	|	СписокОС.ОсновноеСредство КАК Номенклатура,
	|	СписокОС.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА СписокОС.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА СписокОС.ОсновноеСредство.Наименование
	|		ИНАЧЕ СписокОС.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеМатериал,
	|	СписокОС.ОсновноеСредство.Код КАК КодМатериал,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения).Наименование КАК НаименованиеЕдИзм,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения).Код КАК КодЕдИзм
	|ИЗ
	|	СписокОС КАК СписокОС
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписокОС.Ссылка,
	|	СписокОС.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧДокумента.Ссылка КАК Ссылка,
	|	ТЧДокумента.НомерСтроки КАК НомерСтроки,
	|	ТЧДокумента.ОсновноеСредство КАК Номенклатура,
	|	ТЧДокумента.Ссылка.ЦМО КАК ЦМОПолучатель,
	|	ТЧДокумента.Количество КАК Количество
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ТЧДокумента
	|ГДЕ
	|	(ТЧДокумента.Ссылка, ТЧДокумента.ОсновноеСредство) В
	|			(ВЫБРАТЬ
	|				ВТ.Ссылка,
	|				ВТ.ОсновноеСредство
	|			ИЗ
	|				СписокОС КАК ВТ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокОС.Ссылка КАК Ссылка,
	|	СписокОС.ОсновноеСредство КАК Номенклатура,
	|	СписокОС.Количество КАК Количество,
	|	СписокОС.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА СписокОС.Количество <> 0
	|			ТОГДА ВЫРАЗИТЬ(СписокОС.Сумма / СписокОС.Количество КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	СписокОС КАК СписокОС";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат УправлениеПечатьюБГУ.ПечатьВедомостиВыдачиНФА_0504210(РезультатЗапроса, ОбъектыПечати, ИмяМакета);
	
КонецФункции

Функция ДанныеДляПечати0510448(МассивОбъектов) Экспорт
	
	ДанныеДляПечати = ДанныеДляПечати0510448_ОС(МассивОбъектов);
	
	ВыборкаДокументов  = ДанныеДляПечати.ВыборкаДокументов;
	ВыборкаОС          = ДанныеДляПечати.ВыборкаНФА;
	ВыборкаФайлы       = ДанныеДляПечати.ВыборкаФайлы;
	СоставКомиссий     = ДанныеДляПечати.СоставКомиссий;
	ВыборкаОбременения = ДанныеДляПечати.ВыборкаОбременения;
	ВыборкаФайлыАктаЭДО = ДанныеДляПечати.ВыборкаФайлыАктаЭДО;
	
	ДатыОкончанияАморт = Неопределено;
	Если ДанныеДляПечати.Свойство("ДатыОкончанияАмортизации") Тогда
		ДатыОкончанияАморт = ДанныеДляПечати.ДатыОкончанияАмортизации;
	КонецЕсли;	
	
	ДопКолонки = "НомерСтроки,НФА,НаименованиеНФА,Адрес,Назначение";
	Справочники.ОсновныеСредства.ИнициализироватьПараметрыДопХарактеристик(ДанныеДляПечати);
	ПустыеДанныеСтрокиХарактеристик = Новый Структура(ДопКолонки);
	
	ДанныеДокументов = УправлениеПечатьюБГУ.ТаблицаШапкиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		СтрокаДокумента = ДанныеДокументов.Добавить();
		СтрокаДокумента.ИндивидуальныеХарактеристики = УправлениеПечатьюБГУ.ТаблицаИндивидуальныеХарактеристикиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		СтрокаДокумента.ПередаваемыеОбъекты = УправлениеПечатьюБГУ.ТаблицаСведенияОПередаваемыхОбъектахНФААктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		СтрокаДокумента.ПринятыеОбъектыНФА = УправлениеПечатьюБГУ.ТаблицаСведенияОПринятыхОбъектахНФААктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		СтрокаДокумента.СведенияОбОграничениях = УправлениеПечатьюБГУ.ТаблицаСведенияОбОграниченияхАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		СтрокаДокумента.СоставКомиссии = УправлениеПечатьюБГУ.ТаблицаКомиссияДляПечатиПриказ61н();
		СтрокаДокумента.Файлы = УправлениеПечатьюБГУ.ТаблицаФайлыДляПечатиПриказ61н();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, ВыборкаДокументов);
		
		НачислятьАмортизациюПервымЧислом = Истина;
		Если ЗначениеЗаполнено(ВыборкаДокументов.Организация) И ЗначениеЗаполнено(ВыборкаДокументов.Дата) Тогда
			НачислятьАмортизациюПервымЧислом = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
				ВыборкаДокументов.Организация, НачалоМесяца(ВыборкаДокументов.Дата)).НачислятьАмортизациюПервымЧислом;
		КонецЕсли;		
		
		// Данные руководителя
		РуководительЕстьВЗапросе = Ложь;
		Если ВыборкаДокументов.Владелец().Колонки.Найти("Руководитель") <> Неопределено И ЗначениеЗаполнено(ВыборкаДокументов["Руководитель"]) Тогда
			РуководительЕстьВЗапросе = Истина;
		КонецЕсли;
		
		Если Не РуководительЕстьВЗапросе Тогда
			СтрокаДокумента.Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
				Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ВыборкаДокументов.Организация,
				ВыборкаДокументов.Дата, ВыборкаДокументов.СтруктурноеПодразделение).ОтветственноеЛицоСсылка;
		КонецЕсли;	

		// Шапка
		
		СтрокаДокумента.НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
			ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер);
		СтрокаДокумента.ДатаАкта = ВыборкаДокументов.Дата;
		
		// Раздел 1
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		
		ТаблицаХарактеристик = ДанныеДляПечати.ТаблицаХарактеристики.СкопироватьКолонки();
		СписокКолонок = СтрРазделить(ДопКолонки, ",");
		Для Каждого Колонка Из СписокКолонок Цикл
			ТаблицаХарактеристик.Колонки.Добавить(Колонка);
		КонецЦикла;
		
		ВыборкаОС.Сбросить();
		
		НомерСтрокиПередаваемыеОбъекты = 0;
		Пока ВыборкаОС.НайтиСледующий(СтруктураПоиска) Цикл
			
			Если ВыборкаДокументов.Передача Тогда
				НомерСтрокиПередаваемыеОбъекты = НомерСтрокиПередаваемыеОбъекты + 1;
				
				СтрокаПередача = СтрокаДокумента.ПередаваемыеОбъекты.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПередача, ВыборкаОС);
				
				// Строки будем нумеровать последовательно, т.к. номер строки из запроса может иметь пропуски
				// из-за свертки данных в запросах. Нпример, для капвложений один объект может быть в нескольких
				// строках таблицы (разная аналитика КПС).
				СтрокаПередача.НомерСтроки = НомерСтрокиПередаваемыеОбъекты;
				
				СтрокаПередача.СрокЭксплуатации = УправлениеОсновнымиСредствами.РассчитатьМесяцыЭксплуатации(,
					ВыборкаОС.ДатаВводаВЭксплуатацию, ?(ВыборкаДокументов.Принятие,
					ВыборкаДокументов.Дата, ВыборкаДокументов.ДатаСписания));
				
				СтрокаПередача.ДатаОкончанияАмортизации = 
					ДатаОкончанияАмортизацииРаздела1ф0510448(ВыборкаОС, ДатыОкончанияАморт, НачислятьАмортизациюПервымЧислом);
				
			КонецЕсли;
			
			ДанныеДляПечати.Вставить("МожетСодержатьДрагМатериалы", ВыборкаОС.МожетСодержатьДрагМатериалы);
			ДанныеДляПечати.Вставить("ДатаСписания", ВыборкаДокументов.ДатаСписания);
			
			СтруктураПоискаОС = Новый Структура("ОсновноеСредство", ВыборкаОС.НФА);
			Справочники.ОсновныеСредства.ЗаполнитьТаблицуДопХарактеристик(
				ДанныеДляПечати, СтруктураПоискаОС,, ВыборкаОС.ИнвентарныйНомерСсылка);
			Если ДанныеДляПечати.ТаблицаХарактеристики.Количество() = 0
				И ТипЗнч(ВыборкаОС.НФА) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
				СтрокаХар = ТаблицаХарактеристик.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаХар, ВыборкаОС);
			Иначе
				Для НомерСтроки = 1 По ДанныеДляПечати.ТаблицаХарактеристики.Количество() Цикл
					СтрокаХар = ТаблицаХарактеристик.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаХар, ДанныеДляПечати.ТаблицаХарактеристики[НомерСтроки-1]);
					Если НомерСтроки = 1 Тогда
						ЗаполнитьЗначенияСвойств(СтрокаХар, ВыборкаОС, ДопКолонки);
					ИначеЕсли НомерСтроки = 2 Тогда
						ЗаполнитьЗначенияСвойств(СтрокаХар, ПустыеДанныеСтрокиХарактеристик);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
		// Раздел 2
		НомерСтроки = 0;
		Для Каждого СтрокаХарактеристик Из ТаблицаХарактеристик Цикл
			// Нумеруем только строки где указан НФА. Если НФА не указан, то это данные характеристик объекта.
			// Их не нумеруем.
			Если ЗначениеЗаполнено(СтрокаХарактеристик.НФА) Тогда
				НомерСтроки = НомерСтроки + 1;
				НомерСтрокиОбъектаХарактеристик = "" + НомерСтроки;
			Иначе					
				НомерСтрокиОбъектаХарактеристик = "";
			КонецЕсли;
			СтрокаИндивидуальныеХарактеристики = СтрокаДокумента.ИндивидуальныеХарактеристики.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИндивидуальныеХарактеристики, СтрокаХарактеристик);
			Если НЕ ЗначениеЗаполнено(СтрокаИндивидуальныеХарактеристики.Драгметалл) Тогда
				СтрокаИндивидуальныеХарактеристики.Количество = Неопределено;
			КонецЕсли;	
			СтрокаИндивидуальныеХарактеристики.НомерСтроки = НомерСтрокиОбъектаХарактеристик;
		КонецЦикла;
		
		// Раздел 3
		
		Если ВыборкаОбременения <> Неопределено Тогда
			
			ВыборкаОС.Сбросить();
			Пока ВыборкаОС.Следующий() Цикл
				ОтборОС = Новый Структура("ОсновноеСредство, ИнвНомер", ВыборкаОС.НФА, ВыборкаОС.ИнвентарныйНомерСсылка);
				ПараметрыОтбора = Новый Структура("НФА, ИнвентарныйНомерСсылка", ВыборкаОС.НФА, ВыборкаОС.ИнвентарныйНомерСсылка);
				ВыборкаОбременения.Сбросить();
				Пока ВыборкаОбременения.НайтиСледующий(ОтборОС) Цикл
					СтрокаОграничения = СтрокаДокумента.СведенияОбОграничениях.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаОграничения, ВыборкаОС);
					ЗаполнитьЗначенияСвойств(СтрокаОграничения, ВыборкаОбременения);
					СтрокаОграничения.НФА = ВыборкаОбременения.ОсновноеСредство;
					
					Если НЕ СокрЛП(НРЕГ(ВыборкаОС.НаименованиеНФА)) = СокрЛП(НРЕГ(ВыборкаОбременения.НаименованиеЧасти)) Тогда
						СтрокаОграничения.НаименованиеНФА = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2)'"),
								ВыборкаОС.НаименованиеНФА,
								ВыборкаОбременения.НаименованиеЧасти);						
					КонецЕсли;
					СтрокаОграничения.ЗначениеОграничения = ВыборкаОбременения.РазмерЧасти;
					
					Контрагент = ВыборкаОбременения.Контрагент;
					
					Реквизиты = "ИНН, КПП, ЮридическоеФизическоеЛицо, ВидКонтрагента, Наименование";
					ЗначенияРеквизитовКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаОбременения.Контрагент, Реквизиты);
					СтрокаОграничения.ИННКонтрагентаОграничения = ЗначенияРеквизитовКонтрагента.ИНН;
					СтрокаОграничения.КППКонтрагентаОграничения = ЗначенияРеквизитовКонтрагента.КПП;
					ЮридическоеФизическоеЛицо = ЗначенияРеквизитовКонтрагента.ЮридическоеФизическоеЛицо;
					Если ЗначенияРеквизитовКонтрагента.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
						РеквизитыЮЛ = "ОГРН, НаименованиеПолное";
						ЗначенияРеквизитовЮЛ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЮридическоеФизическоеЛицо, РеквизитыЮЛ);
						СтрокаОграничения.ОГРНКонтрагентаОграничения = ЗначенияРеквизитовЮЛ.ОГРН;
						СтрокаОграничения.НаименованиеКонтрагентаОграничения = ЗначенияРеквизитовЮЛ.НаименованиеПолное;
					Иначе
						СтрокаОграничения.НаименованиеКонтрагентаОграничения = Справочники.ФизическиеЛица.ФИОФизлица(ЮридическоеФизическоеЛицо);
					КонецЕсли;
					
					НайденныеСтроки = СтрокаДокумента.ПередаваемыеОбъекты.НайтиСтроки(ПараметрыОтбора);
					Если НайденныеСтроки.Количество()>0 Тогда
						СтрокаОграничения.НомерСтроки = НайденныеСтроки[0].НомерСтроки;	
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
		// Раздел 4
		
		Если ВыборкаДокументов.Принятие Тогда
			ВыборкаОС.Сбросить();
			
			НомерСтроки = 0;
			Пока ВыборкаОС.НайтиСледующий(СтруктураПоиска) Цикл
				НомерСтроки = НомерСтроки + 1;
			
				СтрокаПриятогоОбъекта = СтрокаДокумента.ПринятыеОбъектыНФА.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПриятогоОбъекта, ВыборкаДокументов);
				ЗаполнитьЗначенияСвойств(СтрокаПриятогоОбъекта, ВыборкаОС);
				
				СтрокаПриятогоОбъекта.ДатаОкончанияАмортизации = 
					ДатаОкончанияАмортизацииРаздела1ф0510448(ВыборкаОС, ДатыОкончанияАморт, НачислятьАмортизациюПервымЧислом);
							
				СтрокаПриятогоОбъекта.НомерСтроки = НомерСтроки;
			КонецЦикла;
		КонецЕсли;
		
		// Приложения
		
		КоличествоФайловЭД = 0;
		Пока ВыборкаФайлыАктаЭДО.НайтиСледующий(СтруктураПоиска) Цикл
			Если ЗначениеЗаполнено(ВыборкаФайлыАктаЭДО.Описание) Тогда
				КоличествоФайловЭД = КоличествоФайловЭД + 1;
				ЗаполнитьЗначенияСвойств(СтрокаДокумента.Файлы.Добавить(), ВыборкаФайлыАктаЭДО);
			КонецЕсли;
		КонецЦикла;
		
		Если КоличествоФайловЭД = 0 Тогда
			Пока ВыборкаФайлы.НайтиСледующий(СтруктураПоиска) Цикл
				ЗаполнитьЗначенияСвойств(СтрокаДокумента.Файлы.Добавить(), ВыборкаФайлы);
			КонецЦикла;
		КонецЕсли;
		
		// Комиссия
		
		Отбор = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		СтрокиКомиссииДокумента = СоставКомиссий.НайтиСтроки(Отбор);
		Для Каждого СтрокаКомиссии Из СтрокиКомиссииДокумента Цикл
			СтрокаКомиссииДокумента = СтрокаДокумента.СоставКомиссии.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКомиссииДокумента, СтрокаКомиссии);
			СтрокаКомиссииДокумента.ФИО = КорреспондентыКлиентСервер.ФИО(
				Новый Структура("Фамилия, Имя, Отчество",
					СтрокаКомиссии.Фамилия,
					СтрокаКомиссии.Имя,
					СтрокаКомиссии.Отчество), Истина);
			СтрокаКомиссииДокумента.ОсобыеОтметки = ЭлектронныеДокументыБГУ.ФИОПоСтруктуре(СтрокаКомиссии);		
		КонецЦикла;		
		
	КонецЦикла;
	
	Возврат ДанныеДокументов;
	
КонецФункции

Функция ДанныеДляПечати0510448_ОС(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("НаименованиеПриказаОКомиссии", "Приказ");
	Запрос.УстановитьПараметр("Счета106", БухгалтерскийУчет.СписокСчетов("106.00"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыПроведенияДокументов.Документ КАК Документ,
	|	ДатыПроведенияДокументов.ДатаПроведения КАК ДатаПроведения
	|ПОМЕСТИТЬ ДатыПроведения
	|ИЗ
	|	РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|ГДЕ
	|	ДатыПроведенияДокументов.Документ В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	Документ.Организация КАК Организация,
	|	Документ.Подразделение КАК Подразделение,
	|	Документ.ЦМО.Сотрудник КАК СотрудникПолучатель,
	|	NULL КАК СотрудникОтправитель,
	|	Документ.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Документ.ВидИмуществаВТабличнойЧасти
	|			ТОГДА """"
	|		ИНАЧЕ	
	|			ВЫБОР
	|				КОГДА Документ.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|					ТОГДА ""недвижимость""
	|				КОГДА Документ.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное)
	|					ТОГДА ""особо ценное""
	|				КОГДА Документ.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|					ТОГДА ""иное движимое""
	|				КОГДА Документ.ВидИмущества <> ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	|					ТОГДА ПРЕДСТАВЛЕНИЕ(Документ.ВидИмущества)
	|				ИНАЧЕ """"
	|			КОНЕЦ	
	|	КОНЕЦ КАК ВидИмущества,
	|	Документ.ОснованиеДляАкта КАК ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	|	Документ.НаименованиеПриказа КАК НаименованиеПриказа,
	|	Документ.НомерПриказа КАК НомерПриказа,
	|	Документ.ДатаПриказа КАК ДатаПриказа,
	|	ИСТИНА КАК Принятие,
	|	ВЫБОР
	|		КОГДА Документ.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение)
	|				ИЛИ Документ.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Передача,
	|	NULL КАК ДатаСписания,
	|	Документ.НФАПереданыЭлектроннымАктом КАК НФАПереданыЭлектроннымАктом,
	|	Документ.Ответственный КАК Ответственный,
	|	Документ.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель,
	|	Документ.Руководитель КАК Руководитель,
	|	Документ.ВидИмуществаВТабличнойЧасти КАК ВидИмуществаВТабличнойЧасти
	|ПОМЕСТИТЬ Документ
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Номер,
	|	Документ.Дата,
	|	Документ.Организация,
	|	Документ.Подразделение,
	|	Документ.ЦМО.Сотрудник,
	|	NULL,
	|	Документ.Контрагент,
	|	ВЫБОР
	|		КОГДА Документ.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|			ТОГДА ""недвижимость""
	|		КОГДА Документ.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|			ТОГДА ""иное движимое""
	|		ИНАЧЕ ""казна""
	|	КОНЕЦ,
	|	Документ.ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта,
	|	Документ.Комиссия.НаименованиеПриказа,
	|	Документ.НомерПриказа,
	|	Документ.ДатаПриказа,
	|	ИСТИНА,
	|	ВЫБОР
	|		КОГДА Документ.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ПринятиеКУчетуИзготовление)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	NULL,
	|	Документ.НФАПереданыЭлектроннымАктом,
	|	Документ.Ответственный,
	|	Документ.ОтветственныйИсполнитель,
	|	Документ.Руководитель,
	|	Ложь
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовИК КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Номер,
	|	Документ.Дата,
	|	Документ.Организация,
	|	Документ.Подразделение,
	|	NULL,
	|	Документ.ЦМО.Сотрудник,
	|	Документ.Контрагент,
	|	ВЫБОР
	|		КОГДА Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаКапвложений)
	|			ТОГДА ""вложения в нефинансовые активы""
	|		КОГДА Документ.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|			ТОГДА ""недвижимость""
	|		КОГДА Документ.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное)
	|			ТОГДА ""особо ценное""
	|		КОГДА Документ.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|			ТОГДА ""иное движимое""
	|		КОГДА Документ.ВидИмущества <> ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(Документ.ВидИмущества)
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	Документ.ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта,
	|	Документ.НаименованиеПриказа,
	|	Документ.НомерПриказа,
	|	Документ.ДатаПриказа,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	Документ.Дата,
	|	ЛОЖЬ,
	|	Документ.Ответственный,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
	|	Документ.Руководитель,
	|	Ложь
	|ИЗ
	|	Документ.ПередачаОбъектовОС КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Номер,
	|	Документ.Дата,
	|	Документ.Организация,
	|	Документ.Подразделение,
	|	NULL,
	|	Документ.ЦМО.Сотрудник,
	|	Документ.Контрагент,
	|	ВЫБОР
	|		КОГДА Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ПередачаКапвложений)
	|			ТОГДА ""вложения в нефинансовые активы казны""
	|		ИНАЧЕ ""казна""
	|	КОНЕЦ,
	|	Документ.ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта,
	|	ВЫБОР
	|		КОГДА Документ.Комиссия <> ЗНАЧЕНИЕ(Справочник.ПостоянноДействующиеКомиссии.ПустаяСсылка)
	|			ТОГДА Документ.Комиссия.НаименованиеПриказа
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	Документ.НомерПриказа,
	|	Документ.ДатаПриказа,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	Документ.Дата,
	|	ЛОЖЬ,
	|	Документ.Ответственный,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
	|	Документ.Руководитель,
	|	Ложь
	|ИЗ
	|	Документ.ПередачаОбъектовИК КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Номер,
	|	Документ.Дата,
	|	Документ.Организация,
	|	Документ.Подразделение,
	|	Документ.ЦМО.Сотрудник,
	|	NULL,
	|	Документ.Контрагент,
	|	""вложения в нефинансовые активы"",
	|	Документ.ВидПервичногоДокумента,
	|	Документ.НомерПервичногоДокумента,
	|	Документ.ДатаПервичногоДокумента,
	|	Документ.НаименованиеПриказа,
	|	Документ.НомерПриказа,
	|	Документ.ДатаПриказа,
	|	ИСТИНА,
	|	ИСТИНА,
	|	NULL,
	|	Документ.НФАПереданыЭлектроннымАктом,
	|	Документ.Ответственный,
	|	Документ.ОтветственныйИсполнитель,
	|	Документ.Руководитель,
	|	Ложь
	|ИЗ
	|	Документ.ПоступлениеОС КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Номер,
	|	Документ.Дата,
	|	Документ.Организация,
	|	Документ.Подразделение,
	|	Документ.ЦМО.Сотрудник,
	|	NULL,
	|	Документ.Контрагент,
	|	""вложения в нефинансовые активы"",
	|	Документ.ВидПервичногоДокумента,
	|	Документ.НомерПервичногоДокумента,
	|	Документ.ДатаПервичногоДокумента,
	|	Документ.НаименованиеПриказа,
	|	Документ.НомерПриказа,
	|	Документ.ДатаПриказа,
	|	ИСТИНА,
	|	ИСТИНА,
	|	NULL,
	|	Документ.НФАПереданыЭлектроннымАктом,
	|	Документ.Ответственный,
	|	Документ.ОтветственныйИсполнитель,
	|	Документ.Руководитель,
	|	Ложь
	|ИЗ
	|	Документ.ПоступлениеОСИК КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Номер,
	|	Документ.Дата,
	|	Документ.Организация,
	|	Документ.Подразделение,
	|	ТЧОС.Сотрудник,
	|	Документ.ЦМО.Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА Документ.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|			ТОГДА ""недвижимость""
	|		КОГДА Документ.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное)
	|			ТОГДА ""особо ценное""
	|		КОГДА Документ.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|			ТОГДА ""иное движимое""
	|		КОГДА Документ.ВидИмущества <> ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(Документ.ВидИмущества)
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	Документ.ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта,
	|	Документ.НаименованиеПриказа,
	|	Документ.НомерПриказа,
	|	Документ.ДатаПриказа,
	|	ИСТИНА,
	|	ИСТИНА,
	|	Документ.Дата,
	|	ЛОЖЬ,
	|	Документ.Ответственный,
	|	Документ.ОтветственныйИсполнитель,
	|	Документ.Руководитель,
	|	Ложь
	|ИЗ
	|	Документ.СписаниеОбъектовОС КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЧ.Ссылка КАК Ссылка,
	|			ВЫБОР
	|				КОГДА ТЧ.Ссылка.ВосстановитьНаБалансе
	|					ТОГДА ТЧ.ЦМОВосстановление.Сотрудник
	|				ИНАЧЕ ТЧ.Ссылка.ЦМО.Сотрудник
	|			КОНЕЦ КАК Сотрудник
	|		ИЗ
	|			Документ.СписаниеОбъектовОС.ОсновныеСредства КАК ТЧ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧ.Ссылка,
	|			ВЫБОР
	|				КОГДА ТЧ.Ссылка.ВосстановитьНаБалансе
	|					ТОГДА ТЧ.ЦМОВосстановление.Сотрудник
	|				ИНАЧЕ ТЧ.Ссылка.ЦМО.Сотрудник
	|			КОНЕЦ) КАК ТЧОС
	|		ПО Документ.Ссылка = ТЧОС.Ссылка
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Номер,
	|	Документ.Дата,
	|	Документ.Организация,
	|	Документ.Подразделение,
	|	ТЧОС.Сотрудник,
	|	Документ.ЦМО.Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ПРЕДСТАВЛЕНИЕ(Документ.ВидИмущества),
	|	Документ.ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта,
	|	Документ.НаименованиеПриказа,
	|	Документ.НомерПриказа,
	|	Документ.ДатаПриказа,
	|	ИСТИНА,
	|	ИСТИНА,
	|	Документ.Дата,
	|	ЛОЖЬ,
	|	Документ.Ответственный,
	|	Документ.ОтветственныйИсполнитель,
	|	Документ.Руководитель,
	|	Ложь
	|ИЗ
	|	Документ.СписаниеОбъектовИК КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТЧ.Ссылка КАК Ссылка,
	|			ВЫБОР
	|				КОГДА ТЧ.Ссылка.ВосстановитьНаБалансе
	|					ТОГДА ТЧ.ЦМОВосстановление.Сотрудник
	|				ИНАЧЕ ТЧ.Ссылка.ЦМО.Сотрудник
	|			КОНЕЦ КАК Сотрудник
	|		ИЗ
	|			Документ.СписаниеОбъектовИК.ОсновныеСредства КАК ТЧ
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТЧ.Ссылка,
	|			ВЫБОР
	|				КОГДА ТЧ.Ссылка.ВосстановитьНаБалансе
	|					ТОГДА ТЧ.ЦМОВосстановление.Сотрудник
	|				ИНАЧЕ ТЧ.Ссылка.ЦМО.Сотрудник
	|			КОНЕЦ) КАК ТЧОС
	|		ПО Документ.Ссылка = ТЧОС.Ссылка
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Номер,
	|	Документ.Дата,
	|	Документ.Организация,
	|	Документ.Подразделение,
	|	ВЫБОР
	|		КОГДА Документ.ВосстановитьНаБалансе
	|			ТОГДА Документ.ЦМОВосстановление.Сотрудник
	|		ИНАЧЕ Документ.ЦМО.Сотрудник
	|	КОНЕЦ,
	|	Документ.ЦМО.Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	""иное движимое"",
	|	Документ.ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта,
	|	Документ.НаименованиеПриказа,
	|	Документ.НомерПриказа,
	|	Документ.ДатаПриказа,
	|	ИСТИНА,
	|	ИСТИНА,
	|	Документ.Дата,
	|	ЛОЖЬ,
	|	Документ.Ответственный,
	|	Документ.ОтветственныйИсполнитель,
	|	Документ.Руководитель,
	|	Ложь
	|ИЗ
	|	Документ.СписаниеТранспорта КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО КАК ВидОперации,
	|	ЛОЖЬ КАК ЭтоПередачаКапвложений,
	|	МИНИМУМ(ОсновныеСредства.НомерСтроки) КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.ОсновноеСредство.Код КАК КодОбъекта,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП КАК КодФАИП,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СУММА(ОсновныеСредства.Сумма) КАК Сумма,
	|	СУММА(ОсновныеСредства.Количество) КАК Количество,
	|	СУММА(ОсновныеСредства.СуммаАмортизации) КАК СуммаАмортизации,
	|	СУММА(ОсновныеСредства.СуммаОбесценения) КАК СуммаОбесценения,
	|	СУММА(0) КАК СуммаВложений,
	|	ОсновныеСредства.СчетУчетаОС КАК СчетУчета,
	|	ОсновныеСредства.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ОсновныеСредства.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	|	ОсновныеСредства.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ОсновныеСредства.ОставшийсяСрокПолезногоИспользования КАК ОставшийсяСрокПолезногоИспользования,
	|	ОсновныеСредства.Ссылка.ЦМО.Сотрудник КАК СотрудникПолучатель,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачалаВложений,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВидИмуществаВТабличнойЧасти
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ОсновныеСредства.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|						ТОГДА ""недвижимость""
	|					КОГДА ОсновныеСредства.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное)
	|						ТОГДА ""особо ценное""
	|					КОГДА ОсновныеСредства.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|						ТОГДА ""иное движимое""
	|					КОГДА ОсновныеСредства.ВидИмущества <> ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	|						ТОГДА ПРЕДСТАВЛЕНИЕ(ОсновныеСредства.ВидИмущества)
	|					ИНАЧЕ """"
	|				КОНЕЦ 
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВидИмущества
	|ПОМЕСТИТЬ ОсновныеСредства
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.СчетУчетаОС,
	|	ОсновныеСредства.СрокПолезногоИспользования,
	|	ОсновныеСредства.ПорядокПогашенияСтоимости,
	|	ОсновныеСредства.СпособНачисленияАмортизации,
	|	ОсновныеСредства.ОставшийсяСрокПолезногоИспользования,
	|	ОсновныеСредства.ОсновноеСредство.Код,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП,
	|	ОсновныеСредства.Ссылка.ЦМО.Сотрудник,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВидИмуществаВТабличнойЧасти
	|			ТОГДА
	|				ВЫБОР
	|					КОГДА ОсновныеСредства.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|						ТОГДА ""недвижимость""
	|					КОГДА ОсновныеСредства.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное)
	|						ТОГДА ""особо ценное""
	|					КОГДА ОсновныеСредства.ВидИмущества = ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|						ТОГДА ""иное движимое""
	|					КОГДА ОсновныеСредства.ВидИмущества <> ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	|						ТОГДА ПРЕДСТАВЛЕНИЕ(ОсновныеСредства.ВидИмущества)
	|					ИНАЧЕ """"
	|				КОНЕЦ 
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	МИНИМУМ(ОсновныеСредства.НомерСтроки),
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ОсновноеСредство.Код,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	СУММА(ОсновныеСредства.Сумма),
	|	СУММА(ОсновныеСредства.Количество),
	|	СУММА(ОсновныеСредства.СуммаАмортизации),
	|	СУММА(ОсновныеСредства.СуммаОбесценения),
	|	СУММА(0),
	|	ОсновныеСредства.СчетУчетаОС,
	|	ОсновныеСредства.СрокПолезногоИспользования,
	|	ОсновныеСредства.ПорядокПогашенияСтоимости,
	|	ОсновныеСредства.СпособНачисленияАмортизации,
	|	ОсновныеСредства.ОставшийсяСрокПолезногоИспользования,
	|	ОсновныеСредства.Ссылка.ЦМО.Сотрудник,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.СчетУчетаОС,
	|	ОсновныеСредства.СрокПолезногоИспользования,
	|	ОсновныеСредства.ПорядокПогашенияСтоимости,
	|	ОсновныеСредства.СпособНачисленияАмортизации,
	|	ОсновныеСредства.ОставшийсяСрокПолезногоИспользования,
	|	ОсновныеСредства.ОсновноеСредство.Код,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП,
	|	ОсновныеСредства.Ссылка.ЦМО.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.Ссылка.ВидОперации,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаКапвложений)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	МИНИМУМ(ОсновныеСредства.НомерСтроки),
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ОсновноеСредство.Код,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	СУММА(ВЫБОР
	|			КОГДА ОсновныеСредства.Всего <> 0
	|				ТОГДА ОсновныеСредства.Всего
	|			ИНАЧЕ ОсновныеСредства.Сумма
	|		КОНЕЦ),
	|	СУММА(ОсновныеСредства.Количество),
	|	СУММА(ОсновныеСредства.СуммаАмортизации + ОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц),
	|	СУММА(ОсновныеСредства.СуммаОбесценения),
	|	СУММА(ВЫБОР
	|			КОГДА ОсновныеСредства.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаКапвложений)
	|				ТОГДА ОсновныеСредства.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ОсновныеСредства.СчетУчета,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.КарточкаКапвложений <> ЗНАЧЕНИЕ(Справочник.КарточкиКапвложений.ПустаяСсылка)
	|			ТОГДА ОсновныеСредства.КарточкаКапвложений.ДатаНачалаВложений
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.Ссылка.ВидОперации,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаКапвложений)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.СчетУчета,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ОсновноеСредство.Код,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.КарточкаКапвложений <> ЗНАЧЕНИЕ(Справочник.КарточкиКапвложений.ПустаяСсылка)
	|			ТОГДА ОсновныеСредства.КарточкаКапвложений.ДатаНачалаВложений
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ		
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.Ссылка.ВидОперации,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ПередачаКапвложений)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	МИНИМУМ(ОсновныеСредства.НомерСтроки),
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ОсновноеСредство.Код,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	СУММА(ОсновныеСредства.Сумма),
	|	СУММА(ОсновныеСредства.Количество),
	|	СУММА(ОсновныеСредства.СуммаАмортизации + ОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц),
	|	СУММА(ОсновныеСредства.СуммаОбесценения),
	|	СУММА(ВЫБОР
	|			КОГДА ОсновныеСредства.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ПередачаКапвложений)
	|				ТОГДА ОсновныеСредства.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ОсновныеСредства.СчетУчета,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.КарточкаКапвложений <> ЗНАЧЕНИЕ(Справочник.КарточкиКапвложений.ПустаяСсылка)
	|			ТОГДА ОсновныеСредства.КарточкаКапвложений.ДатаНачалаВложений
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,		
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ПередачаОбъектовИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.Ссылка.ВидОперации,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ПередачаКапвложений)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.СчетУчета,
	|	ОсновныеСредства.ОсновноеСредство.Код,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.КарточкаКапвложений <> ЗНАЧЕНИЕ(Справочник.КарточкиКапвложений.ПустаяСсылка)
	|			ТОГДА ОсновныеСредства.КарточкаКапвложений.ДатаНачалаВложений
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ		
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	МИНИМУМ(ОсновныеСредства.НомерСтроки),
	|	ОсновныеСредства.ВнеоборотныйАктив,
	|	ОсновныеСредства.ВнеоборотныйАктив.Код,
	|	ОсновныеСредства.ВнеоборотныйАктив.КодФАИП,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка),
	|	СУММА(0),
	|	СУММА(ОсновныеСредства.Количество),
	|	СУММА(ОсновныеСредства.СуммаАмортизации),
	|	СУММА(ОсновныеСредства.СуммаОбесценения),
	|	СУММА(ОсновныеСредства.Всего),
	|	ОсновныеСредства.СчетУчета,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	ОсновныеСредства.Ссылка.ЦМО.Сотрудник,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ПоступлениеОС.КапВложения КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.ВнеоборотныйАктив,
	|	ОсновныеСредства.СчетУчета,
	|	ОсновныеСредства.ВнеоборотныйАктив.Код,
	|	ОсновныеСредства.ВнеоборотныйАктив.КодФАИП,
	|	ОсновныеСредства.Ссылка.ЦМО.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	МИНИМУМ(ОсновныеСредства.НомерСтроки),
	|	ОсновныеСредства.ВнеоборотныйАктив,
	|	ОсновныеСредства.ВнеоборотныйАктив.Код,
	|	ОсновныеСредства.ВнеоборотныйАктив.КодФАИП,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка),
	|	СУММА(0),
	|	СУММА(ОсновныеСредства.Количество),
	|	СУММА(ОсновныеСредства.СуммаАмортизации),
	|	СУММА(ОсновныеСредства.СуммаОбесценения),
	|	СУММА(ОсновныеСредства.Всего),
	|	ОсновныеСредства.СчетУчета,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	ОсновныеСредства.Ссылка.ЦМО.Сотрудник,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.ПоступлениеОСИК.КапВложения КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.ВнеоборотныйАктив,
	|	ОсновныеСредства.СчетУчета,
	|	ОсновныеСредства.ВнеоборотныйАктив.Код,
	|	ОсновныеСредства.ВнеоборотныйАктив.КодФАИП,
	|	ОсновныеСредства.Ссылка.ЦМО.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	МИНИМУМ(ОсновныеСредства.НомерСтроки),
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ОсновноеСредство.Код,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	СУММА(ОсновныеСредства.СуммаВосстановление),
	|	СУММА(ОсновныеСредства.Количество),
	|	СУММА(ОсновныеСредства.СуммаАмортизации),
	|	СУММА(ОсновныеСредства.СуммаОбесценения),
	|	СУММА(0),
	|	ОсновныеСредства.СчетУчетаВосстановление,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВосстановитьНаБалансе
	|			ТОГДА ОсновныеСредства.ЦМОВосстановление.Сотрудник
	|		ИНАЧЕ ОсновныеСредства.Ссылка.ЦМО.Сотрудник
	|	КОНЕЦ,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.СписаниеОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.СчетУчетаВосстановление,
	|	ОсновныеСредства.ОсновноеСредство.Код,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВосстановитьНаБалансе
	|			ТОГДА ОсновныеСредства.ЦМОВосстановление.Сотрудник
	|		ИНАЧЕ ОсновныеСредства.Ссылка.ЦМО.Сотрудник
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	МИНИМУМ(ОсновныеСредства.НомерСтроки),
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ОсновноеСредство.Код,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	СУММА(ОсновныеСредства.СуммаВосстановление),
	|	СУММА(ОсновныеСредства.Количество),
	|	СУММА(ОсновныеСредства.СуммаАмортизации),
	|	СУММА(ОсновныеСредства.СуммаОбесценения),
	|	СУММА(0),
	|	ОсновныеСредства.СчетУчетаВосстановление,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВосстановитьНаБалансе
	|			ТОГДА ОсновныеСредства.ЦМОВосстановление.Сотрудник
	|		ИНАЧЕ ОсновныеСредства.Ссылка.ЦМО.Сотрудник
	|	КОНЕЦ,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.СписаниеОбъектовИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.СчетУчетаВосстановление,
	|	ОсновныеСредства.ОсновноеСредство.Код,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВосстановитьНаБалансе
	|			ТОГДА ОсновныеСредства.ЦМОВосстановление.Сотрудник
	|		ИНАЧЕ ОсновныеСредства.Ссылка.ЦМО.Сотрудник
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	ЛОЖЬ,
	|	1,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ОсновноеСредство.Код,
	|	ОсновныеСредства.ОсновноеСредство.КодФАИП,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.СуммаВосстановление,
	|	1,
	|	ОсновныеСредства.СуммаАмортизации,
	|	ОсновныеСредства.СуммаОбесценения,
	|	0,
	|	ОсновныеСредства.СчетУчетаВосстановление,
	|	NULL,
	|	NULL,
	|	NULL,
	|	0,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ВосстановитьНаБалансе
	|			ТОГДА ОсновныеСредства.ЦМОВосстановление.Сотрудник
	|		ИНАЧЕ ОсновныеСредства.ЦМО.Сотрудник
	|	КОНЕЦ,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	Документ.СписаниеТранспорта КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка КАК Ссылка,
	|	СоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СоставКомиссии.Сотрудник КАК Сотрудник,
	|	ЛОЖЬ КАК Председатель,
	|	СоставКомиссии.Отсутствует КАК Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии КАК НаименованиеДолжности,
	|	СоставКомиссии.ФамилияЧленаКомиссии КАК Фамилия,
	|	СоставКомиссии.ИмяЧленаКомиссии КАК Имя,
	|	СоставКомиссии.ОтчествоЧленаКомиссии КАК Отчество
	|ПОМЕСТИТЬ СоставКомиссии
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.Сотрудник,
	|	ЛОЖЬ,
	|	СоставКомиссии.Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовИК.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовИК КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.Сотрудник,
	|	ЛОЖЬ,
	|	СоставКомиссии.Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.ПередачаОбъектовОС.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.ПередачаОбъектовОС КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.Сотрудник,
	|	ЛОЖЬ,
	|	СоставКомиссии.Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.ПередачаОбъектовИК.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.ПередачаОбъектовИК КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.Сотрудник,
	|	ЛОЖЬ,
	|	СоставКомиссии.Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.ПоступлениеОС.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.ПоступлениеОС КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.Сотрудник,
	|	ЛОЖЬ,
	|	СоставКомиссии.Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.ПоступлениеОСИК.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.ПоступлениеОСИК КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.Сотрудник,
	|	ЛОЖЬ,
	|	СоставКомиссии.Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.СписаниеОбъектовОС.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.СписаниеОбъектовОС КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.Сотрудник,
	|	ЛОЖЬ,
	|	СоставКомиссии.Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.СписаниеОбъектовИК.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.СписаниеОбъектовИК КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.Сотрудник,
	|	ЛОЖЬ,
	|	СоставКомиссии.Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.СписаниеТранспорта.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.СписаниеТранспорта КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОбъектНФА КАК ОсновноеСредство,
	|	ДрагоценныеМатериалы.ИнвНомер КАК ИнвентарныйНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала КАК ВидДрагМатериала,
	|	ДрагоценныеМатериалы.МассаДМ КАК МассаДМ,
	|	ДрагоценныеМатериалы.ЕдИзм КАК ЕдИзм
	|ПОМЕСТИТЬ ДрагоценныеМатериалы
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОбъектНФА,
	|	ДрагоценныеМатериалы.ИнвНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала,
	|	ДрагоценныеМатериалы.МассаДМ,
	|	ДрагоценныеМатериалы.ЕдИзм
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовИК.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОбъектНФА,
	|	ДрагоценныеМатериалы.ИнвНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала,
	|	ДрагоценныеМатериалы.МассаДМ,
	|	ДрагоценныеМатериалы.ЕдИзм
	|ИЗ
	|	Документ.ПередачаОбъектовОС.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОбъектНФА,
	|	ДрагоценныеМатериалы.ИнвНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала,
	|	ДрагоценныеМатериалы.МассаДМ,
	|	ДрагоценныеМатериалы.ЕдИзм
	|ИЗ
	|	Документ.ПередачаОбъектовИК.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОбъектНФА,
	|	ДрагоценныеМатериалы.ИнвНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала,
	|	ДрагоценныеМатериалы.МассаДМ,
	|	ДрагоценныеМатериалы.ЕдИзм
	|ИЗ
	|	Документ.СписаниеОбъектовОС.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОбъектНФА,
	|	ДрагоценныеМатериалы.ИнвНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала,
	|	ДрагоценныеМатериалы.МассаДМ,
	|	ДрагоценныеМатериалы.ЕдИзм
	|ИЗ
	|	Документ.СписаниеОбъектовИК.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОбъектНФА,
	|	ДрагоценныеМатериалы.ИнвНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала,
	|	ДрагоценныеМатериалы.МассаДМ,
	|	ДрагоценныеМатериалы.ЕдИзм
	|ИЗ
	|	Документ.СписаниеТранспорта.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОС.ИнвНомер КАК ИнвентарныйНомер,
	|	СобытияОС.Событие КАК Событие, 
	|	СобытияОС.ДатаСобытия КАК ДатаСобытия
	|ПОМЕСТИТЬ ДатыСобытийОС
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ОсновныеСредства.ОсновноеСредство
	|					ИЗ
	|						ОсновныеСредства КАК ОсновныеСредства)
	|				И (Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|					ИЛИ Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету))) КАК СобытияОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизации.Организация КАК Организация,
	|	ПараметрыАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыАмортизации.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	|	ПараметрыАмортизации.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	|ПОМЕСТИТЬ ПараметрыАмортизации
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			,
	|			(Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ОсновныеСредства.ОсновноеСредство.Организация КАК Организация,
	|					ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|				ИЗ
	|					ОсновныеСредства КАК ОсновныеСредства
	|				ГДЕ
	|					ОсновныеСредства.ПорядокПогашенияСтоимости ЕСТЬ NULL)) КАК ПараметрыАмортизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетАмортизации.Организация КАК Организация,
	|	РасчетАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизации.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ РасчетАмортизации
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|				ИЗ
	|					ОсновныеСредства КАК ОсновныеСредства
	|				ГДЕ
	|					ОсновныеСредства.СрокПолезногоИспользования ЕСТЬ NULL)) КАК РасчетАмортизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	|	МИНИМУМ(ВложенныйЗапрос.ДатаОперации) КАК ДатаОперации
	|ПОМЕСТИТЬ ОперацииКапвложений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК ОсновноеСредство,
	|		ЖурналПроводокЕПСБУДвиженияССубконто.Период КАК ДатаОперации
	|	ИЗ
	|		РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|				,
	|				,
	|				СчетДт В (&Счета106)
	|				И СубконтоДт1 В
	|					(ВЫБРАТЬ
	|						Таб.ОсновноеСредство
	|					ИЗ
	|						ОсновныеСредства КАК Таб
	|					ГДЕ
	|						Таб.ЭтоПередачаКапвложений)
	|				И НЕ (СчетКт В (&Счета106) И СубконтоДт1 = СубконтоКт1)
	|				,
	|				,
	|				) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИсторияКапвложений.ОбъектВложений,
	|		ИсторияКапвложений.Период
	|	ИЗ
	|		РегистрНакопления.ИсторияКапвложений КАК ИсторияКапвложений
	|	ГДЕ
	|		ИсторияКапвложений.ОбъектВложений В
	|				(ВЫБРАТЬ
	|					Таб.ОсновноеСредство
	|				ИЗ
	|					ОсновныеСредства КАК Таб
	|				ГДЕ
	|					Таб.ЭтоПередачаКапвложений)
	|		И ИсторияКапвложений.СторонаСчетВложения = ""Дт"") КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияКадастровогоУчетаСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастроваяСтоимость КАК КадастроваяСтоимость,
	|	СведенияКадастровогоУчетаСрезПоследних.ДоляПлощадиЧислитель КАК ДоляПлощадиЧислитель,
	|	СведенияКадастровогоУчетаСрезПоследних.ДоляПлощадиЗнаменатель КАК ДоляПлощадиЗнаменатель,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомерЗдания КАК КадастровыйНомерЗдания,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомерЗемлиНедвижимости КАК КадастровыйНомерЗемлиНедвижимости,
	|	СведенияКадастровогоУчетаСрезПоследних.ВидОбъектаНедвижимости КАК ВидОбъектаНедвижимости,
	|	СведенияКадастровогоУчетаСрезПоследних.УсловныйНомер КАК УсловныйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.ЭтоПомещение КАК ЭтоПомещение,
	|	СведенияКадастровогоУчетаСрезПоследних.КоличествоЭтажей КАК КоличествоЭтажей,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщийОбъем КАК ОбщийОбъем,
	|	СведенияКадастровогоУчетаСрезПоследних.ПодземныйОбъем КАК ПодземныйОбъем
	|ПОМЕСТИТЬ КадастровыйУчет	
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ОсновныеСредства КАК ВТ)) КАК СведенияКадастровогоУчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документ1.Ссылка КАК Ссылка,
	|	Документ1.Номер КАК Номер,
	|	Документ1.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Документ1.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА Документ1.Организация
	|		ИНАЧЕ Документ1.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА Документ1.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ1.Организация.НаименованиеПолное = """"
	|						ТОГДА Документ1.Организация.Наименование
	|					ИНАЧЕ Документ1.Организация.НаименованиеПолное
	|				КОНЕЦ
	|		ИНАЧЕ Документ1.Организация.ГоловнаяОрганизация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ВЫБОР
	|		КОГДА Документ1.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА Документ1.Организация.КодПоРПБС
	|		ИНАЧЕ Документ1.Организация.ГоловнаяОрганизация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБС,
	|	ВЫБОР
	|		КОГДА Документ1.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|		ИНАЧЕ Документ1.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА Документ1.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ Документ1.Организация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Документ1.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ Документ1.Организация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБСПодр,
	|	Документ1.Подразделение КАК СтруктурноеПодразделение,
	|	ВЫБОР
	|		КОГДА Документ1.Подразделение.НаименованиеПолное = """"
	|			ТОГДА Документ1.Подразделение.Наименование
	|		ИНАЧЕ Документ1.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеСтруктурногоПодразделения,
	|	Документ1.Организация.КодПоППП.НаименованиеПолное КАК Учредитель,
	|	Документ1.Организация.КодПоППП.Код КАК ГлаваБК,
	|	Документ1.Организация.Бюджет.НаименованиеПолное КАК БюджетНаименование,
	|	Документ1.Организация.Бюджет.Код КАК ОКТМО,
	|	ВЫБОР
	|		КОГДА Документ1.Контрагент.ОбособленноеПодразделение
	|				И Документ1.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Документ1.Контрагент.ГоловнаяОрганизация
	|		ИНАЧЕ Документ1.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Документ1.Контрагент.ОбособленноеПодразделение
	|				И Документ1.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).НаименованиеПолное
	|					КОГДА Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ФизическиеЛица
	|						ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК Справочник.ФизическиеЛица).Наименование
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Документ1.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|					ТОГДА """"
	|				КОГДА Документ1.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|					ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).НаименованиеПолное
	|				КОГДА Документ1.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ФизическиеЛица
	|					ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ФизическиеЛица).Наименование
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	ВЫБОР
	|		КОГДА Документ1.Контрагент.ОбособленноеПодразделение
	|				И Документ1.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоППП.НаименованиеПолное
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Документ1.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|					ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоППП.НаименованиеПолное
	|			КОНЕЦ
	|	КОНЕЦ КАК КонтрагентУчредитель,
	|	ВЫБОР
	|		КОГДА Документ1.Контрагент.ОбособленноеПодразделение
	|				И Документ1.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоППП.Код
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Документ1.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|					ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоППП.Код
	|			КОНЕЦ
	|	КОНЕЦ КАК КонтрагентГлаваБК,
	|	ВЫБОР
	|		КОГДА Документ1.Контрагент.ОбособленноеПодразделение
	|				И Документ1.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).Бюджет.НаименованиеПолное
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Документ1.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|					ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).Бюджет.НаименованиеПолное
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК КонтрагентБюджетНаименование,
	|	ВЫБОР
	|		КОГДА Документ1.Контрагент.ОбособленноеПодразделение
	|				И Документ1.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).Бюджет.Код
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Документ1.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|					ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).Бюджет.Код
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК КонтрагентОКТМО,
	|	ВЫБОР
	|		КОГДА Документ1.Контрагент.ОбособленноеПодразделение
	|				И Документ1.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоРПБС
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Документ1.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|					ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоРПБС
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК КонтрагентКодРПБС,
	|	ВЫБОР
	|		КОГДА Документ1.Контрагент.ОбособленноеПодразделение
	|				И Документ1.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Документ1.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК КонтрагентОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА Документ1.Контрагент.ОбособленноеПодразделение
	|				И Документ1.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ1.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).НаименованиеПолное
	|					КОГДА Документ1.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ФизическиеЛица
	|						ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ФизическиеЛица).Наименование
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентОбособленноеПодразделениеНаименование,
	|	ВЫБОР
	|		КОГДА Документ1.Контрагент.ОбособленноеПодразделение
	|				И Документ1.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ1.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|						ТОГДА ВЫРАЗИТЬ(Документ1.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоРПБС
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентОбособленноеПодразделениеКодРПБС,
	|	Документ1.СотрудникПолучатель КАК Сотрудник,
	|	Документ1.СотрудникПолучатель КАК СотрудникПолучатель,
	|	Документ1.СотрудникОтправитель КАК СотрудникОтправитель,
	|	ВЫБОР
	|		КОГДА Документ1.СотрудникПолучатель ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ Документ1.СотрудникПолучатель.Код
	|	КОНЕЦ КАК КодСотрудникПолучатель,
	|	Документ1.ВидИмущества КАК ВидИмущества,
	|	Документ1.ОснованиеДляАкта КАК НаименованиеОснования,
	|	Документ1.НомерОснованияДляАкта КАК НомерОснования,
	|	Документ1.ДатаОснованияДляАкта КАК ДатаОснования,
	|	Документ1.НаименованиеПриказа КАК НаименованиеПриказа,
	|	Документ1.НомерПриказа КАК НомерПриказа,
	|	Документ1.ДатаПриказа КАК ДатаПриказа,
	|	ВЫБОР
	|		КОГДА Документ1.ДатаСписания ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ЕСТЬNULL(ДатыПроведения.ДатаПроведения, Документ1.ДатаСписания)
	|	КОНЕЦ КАК ДатаСписания,
	|	Документ1.Принятие КАК Принятие,
	|	Документ1.Передача КАК Передача,
	|	Документ1.Ответственный КАК Ответственный,
	|	Документ1.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель,
	|	Документ1.Руководитель КАК Руководитель,
	|	&ПолеАналитическойГруппы КАК АналитическаяГруппа,
	|	Документ1.НФАПереданыЭлектроннымАктом КАК НФАПереданыЭлектроннымАктом,
	|	Документ1.ВидИмуществаВТабличнойЧасти КАК ВидИмуществаВТабличнойЧасти
	|ИЗ
	|	Документ КАК Документ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОсновныеСредства КАК ОсновныеСредства
	|		ПО Документ1.Ссылка = ОсновныеСредства.Ссылка
	|			И (ОсновныеСредства.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПроведения КАК ДатыПроведения
	|		ПО Документ1.Ссылка = ДатыПроведения.Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ1.Дата,
	|	Документ1.Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК НФА,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ОсновныеСредства.ОсновноеСредство.Наименование
	|		ИНАЧЕ ОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеНФА,
	|	ОсновныеСредства.ОсновноеСредство.КодОКОФ.Код КАК КодПоОКОФ,
	|	ОсновныеСредства.ОсновноеСредство.МожетСодержатьДрагМатериалы КАК МожетСодержатьДрагМатериалы,
	|	ОсновныеСредства.ОсновноеСредство.АмортизационнаяГруппа.Порядок + 1 КАК АмортизационнаяГруппа,
	|	ОсновныеСредства.КодФАИП КАК КодФАИП,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомерСсылка,
	|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредства.ИнвентарныйНомер) КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ЭтоПередачаКапвложений
	|			ТОГДА 0
	|		ИНАЧЕ ОсновныеСредства.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ОсновныеСредства.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ЭтоПередачаКапвложений
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ОсновныеСредства.Количество = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВЫРАЗИТЬ(ОсновныеСредства.Сумма / ОсновныеСредства.Количество КАК ЧИСЛО(15, 2))
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	ОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ОсновныеСредства.СуммаВложений КАК СуммаВложений,
	|	ЕСТЬNULL(ЕСТЬNULL(ОсновныеСредства.СрокПолезногоИспользования, РасчетАмортизации.СрокПолезногоИспользования), 0) КАК СрокПолезногоИспользования,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|			ТОГДА ВЫБОР
	|					КОГДА ОсновныеСредства.ОставшийсяСрокПолезногоИспользования <> 0
	|						ТОГДА 100 / ОсновныеСредства.ОставшийсяСрокПолезногоИспользования
	|					КОГДА ЕСТЬNULL(ОсновныеСредства.СрокПолезногоИспользования, 0) <> 0
	|						ТОГДА 100 / ЕСТЬNULL(ОсновныеСредства.СрокПолезногоИспользования, 0)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОГДА (ОсновныеСредства.Ссылка ССЫЛКА Документ.СписаниеОбъектовОС
	|				ИЛИ ОсновныеСредства.Ссылка ССЫЛКА Документ.СписаниеТранспорта)
	|				И ЕСТЬNULL(ПараметрыАмортизации.ПорядокПогашенияСтоимости, ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ЕСТЬNULL(ПараметрыАмортизации.СпособНачисленияАмортизации, ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|			ТОГДА ВЫБОР
	|					КОГДА ОсновныеСредства.ОставшийсяСрокПолезногоИспользования <> 0
	|						ТОГДА 100 / ОсновныеСредства.ОставшийсяСрокПолезногоИспользования
	|					КОГДА ЕСТЬNULL(ЕСТЬNULL(ОсновныеСредства.СрокПолезногоИспользования, РасчетАмортизации.СрокПолезногоИспользования), 0) <> 0
	|						ТОГДА 100 / ЕСТЬNULL(ЕСТЬNULL(ОсновныеСредства.СрокПолезногоИспользования, РасчетАмортизации.СрокПолезногоИспользования), 0)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НормаАмортизации,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ЭтоПередачаКапвложений
	|			ТОГДА """"
	|		ИНАЧЕ ОсновныеСредства.ИнвентарныйНомер.ЗаводскойНомер
	|	КОНЕЦ КАК ЗаводскойНомер,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ЭтоПередачаКапвложений
	|			ТОГДА """"
	|		ИНАЧЕ ОсновныеСредства.ИнвентарныйНомер.РеестровыйНомер
	|	КОНЕЦ КАК РеестровыйНомер,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ЭтоПередачаКапвложений
	|			ТОГДА """"
	|		КОГДА ОсновныеСредства.ИнвентарныйНомер.ИнойНомер <> """"
	|			ТОГДА ОсновныеСредства.ИнвентарныйНомер.ИнойНомер
	|		ИНАЧЕ ОсновныеСредства.КодОбъекта
	|	КОНЕЦ КАК ИнойНомер,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ЭтоПередачаКапвложений
	|			ТОГДА ЕСТЬNULL(КадастровыйУчет.КадастровыйНомер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КадастровыйНомерОбъектаКапвложений,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ЭтоПередачаКапвложений
	|			ТОГДА 
	|				ВЫБОР
	|					КОГДА ОсновныеСредства.ДатаНачалаВложений = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА 
	|							ВЫБОР
	|								КОГДА ОперацииКапвложений.ДатаОперации ЕСТЬ NULL
	|									ТОГДА """"
	|								ИНАЧЕ ГОД(ОперацииКапвложений.ДатаОперации)
	|							КОНЕЦ		
	|					ИНАЧЕ ГОД(ОсновныеСредства.ДатаНачалаВложений)
	|				КОНЕЦ
	|		ИНАЧЕ ОсновныеСредства.ИнвентарныйНомер.ДатаВыпуска
	|	КОНЕЦ КАК ДатаВыпуска,
	|	ОсновныеСредства.ОсновноеСредство.Сведения КАК Сведения,
	|	ЕСТЬNULL(ОсновныеСредства.ОсновноеСредство.Назначение, """") КАК Назначение,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Адрес,
	|	ДатыСобытийОСВводВЭксплуатацию.ДатаСобытия КАК ДатаВводаВЭксплуатацию,
	|	ДатыСобытийОСПринятиеКУчету.ДатаСобытия КАК ДатаПринятиеКУчету,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЕСТЬNULL(ОсновныеСредства.ПорядокПогашенияСтоимости, ПараметрыАмортизации.ПорядокПогашенияСтоимости), ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЕСТЬNULL(ОсновныеСредства.СпособНачисленияАмортизации, ПараметрыАмортизации.СпособНачисленияАмортизации), ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|						ТОГДА 2
	|					КОГДА ЕСТЬNULL(ЕСТЬNULL(ОсновныеСредства.СпособНачисленияАмортизации, ПараметрыАмортизации.СпособНачисленияАмортизации), ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|						ТОГДА 3
	|					КОГДА ЕСТЬNULL(ЕСТЬNULL(ОсновныеСредства.СпособНачисленияАмортизации, ПараметрыАмортизации.СпособНачисленияАмортизации), ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|						ТОГДА 4
	|					КОГДА ЕСТЬNULL(ЕСТЬNULL(ОсновныеСредства.СпособНачисленияАмортизации, ПараметрыАмортизации.СпособНачисленияАмортизации), ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции)
	|						ТОГДА 5
	|					ИНАЧЕ 1
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ПорядокНачисления,
	|	&ПолеАналитическойГруппы КАК АналитическаяГруппа,
	|	ОсновныеСредства.СотрудникПолучатель КАК СотрудникПолучатель,
	|	ОсновныеСредства.ВидИмущества КАК ВидИмущества
	|ИЗ
	|	ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыСобытийОС КАК ДатыСобытийОСВводВЭксплуатацию
	|		ПО ОсновныеСредства.ОсновноеСредство = ДатыСобытийОСВводВЭксплуатацию.ОсновноеСредство
	|			И ОсновныеСредства.ИнвентарныйНомер = ДатыСобытийОСВводВЭксплуатацию.ИнвентарныйНомер
	|			И ДатыСобытийОСВводВЭксплуатацию.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыСобытийОС КАК ДатыСобытийОСПринятиеКУчету
	|		ПО ОсновныеСредства.ОсновноеСредство = ДатыСобытийОСПринятиеКУчету.ОсновноеСредство
	|			И ОсновныеСредства.ИнвентарныйНомер = ДатыСобытийОСПринятиеКУчету.ИнвентарныйНомер
	|			И ДатыСобытийОСПринятиеКУчету.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ОсновныеСредства.ОсновноеСредство = КонтактнаяИнформация.Ссылка
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестонахожденияОбъектаОС))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизации КАК ПараметрыАмортизации
	|		ПО ОсновныеСредства.ОсновноеСредство = ПараметрыАмортизации.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетАмортизации КАК РасчетАмортизации
	|		ПО ОсновныеСредства.ОсновноеСредство = РасчетАмортизации.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОперацииКапвложений КАК ОперацииКапвложений
	|		ПО ОсновныеСредства.ОсновноеСредство = ОперацииКапвложений.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ КадастровыйУчет КАК КадастровыйУчет
	|		ПО ОсновныеСредства.ОсновноеСредство = КадастровыйУчет.ОсновноеСредство
	|			И ОсновныеСредства.ИнвентарныйНомер = КадастровыйУчет.ИнвентарныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка КАК Ссылка,
	|	СоставКомиссии.Сотрудник КАК Сотрудник,
	|	СоставКомиссии.Председатель КАК Председатель,
	|	СоставКомиссии.НаименованиеДолжности КАК НаименованиеДолжности,
	|	СоставКомиссии.Фамилия КАК Фамилия,
	|	СоставКомиссии.Имя КАК Имя,
	|	СоставКомиссии.Отчество КАК Отчество
	|ИЗ
	|	СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	НЕ СоставКомиссии.Отсутствует
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	СоставКомиссии.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КадастровыйУчет.ОсновноеСредство КАК ОсновноеСредство,
	|	КадастровыйУчет.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	КадастровыйУчет.КадастроваяСтоимость КАК КадастроваяСтоимость,
	|	КадастровыйУчет.ДоляПлощадиЧислитель КАК ДоляПлощадиЧислитель,
	|	КадастровыйУчет.ДоляПлощадиЗнаменатель КАК ДоляПлощадиЗнаменатель,
	|	КадастровыйУчет.КадастровыйНомер КАК КадастровыйНомер,
	|	КадастровыйУчет.КадастровыйНомерЗдания КАК КадастровыйНомерЗдания,
	|	КадастровыйУчет.КадастровыйНомерЗемлиНедвижимости КАК КадастровыйНомерЗемлиНедвижимости,
	|	КадастровыйУчет.ВидОбъектаНедвижимости КАК ВидОбъектаНедвижимости,
	|	КадастровыйУчет.УсловныйНомер КАК УсловныйНомер,
	|	КадастровыйУчет.ЭтоПомещение КАК ЭтоПомещение,
	|	КадастровыйУчет.КоличествоЭтажей КАК КоличествоЭтажей,
	|	КадастровыйУчет.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	КадастровыйУчет.ОбщийОбъем КАК ОбщийОбъем,
	|	КадастровыйУчет.ПодземныйОбъем КАК ПодземныйОбъем
	|ИЗ
	|	КадастровыйУчет КАК КадастровыйУчет
	|ИТОГИ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПаспортаТранспортныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПаспортаТранспортныхСредствСрезПоследних.СерияНомер КАК СерияНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.ИдентификационныйНомер КАК ИдентификационныйНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.Марка КАК Марка,
	|	ПаспортаТранспортныхСредствСрезПоследних.Модель КАК Модель,
	|	ПаспортаТранспортныхСредствСрезПоследних.Тип КАК Тип,
	|	ПаспортаТранспортныхСредствСрезПоследних.ДвигательМодель КАК ДвигательМодель,
	|	ПаспортаТранспортныхСредствСрезПоследних.ДвигательНомер КАК ДвигательНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.НомерШасси КАК НомерШасси,
	|	ПаспортаТранспортныхСредствСрезПоследних.НомерКузова КАК НомерКузова,
	|	ПаспортаТранспортныхСредствСрезПоследних.ЭкологическийКласс КАК ЭкологическийКласс,
	|	ПаспортаТранспортныхСредствСрезПоследних.Масса КАК Масса,
	|	ПаспортаТранспортныхСредствСрезПоследних.ГаражныйНомер КАК ГаражныйНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.Грузоподъемность КАК Грузоподъемность,
	|	ПаспортаТранспортныхСредствСрезПоследних.Колонна КАК Колонна,
	|	ПаспортаТранспортныхСредствСрезПоследних.РегистрационныйЗнак КАК РегистрационныйЗнак,
	|	ПаспортаТранспортныхСредствСрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|	ПаспортаТранспортныхСредствСрезПоследних.ДатаСнятияСУчета КАК ДатаСнятияСУчета
	|ИЗ
	|	РегистрСведений.ПаспортаТранспортныхСредств.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ОсновныеСредства КАК ВТ)) КАК ПаспортаТранспортныхСредствСрезПоследних
	|ИТОГИ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительныеРеквизиты.Ссылка КАК ОсновноеСредство,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК ИнвентарныйНомер,
	|	ДополнительныеРеквизиты.Свойство.Заголовок КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ДополнительныеРеквизиты.Значение ССЫЛКА Справочник.ЗначенияСвойствОбъектов
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ДополнительныеРеквизиты.Значение.ПолноеНаименование КАК СТРОКА(1))) = """"
	|						ТОГДА ДополнительныеРеквизиты.Значение.Наименование
	|					ИНАЧЕ ВЫРАЗИТЬ(ДополнительныеРеквизиты.Значение.ПолноеНаименование КАК СТРОКА(1000))
	|				КОНЕЦ
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДополнительныеРеквизиты.Значение)
	|	КОНЕЦ КАК ЗначениеХарактеристики,
	|	ДополнительныеРеквизиты.ТекстоваяСтрока КАК ТекстоваяСтрока
	|ИЗ
	|	Справочник.ОсновныеСредства.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	ДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ.ОсновноеСредство
	|			ИЗ
	|				ОсновныеСредства КАК ВТ)
	|	И ДополнительныеРеквизиты.Значение <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка),
	|	ДополнительныеСведения.Свойство.Заголовок,
	|	ВЫБОР
	|		КОГДА ДополнительныеСведения.Значение ССЫЛКА Справочник.ЗначенияСвойствОбъектов
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ДополнительныеСведения.Значение.ПолноеНаименование КАК СТРОКА(1))) = """"
	|						ТОГДА ДополнительныеСведения.Значение.Наименование
	|					ИНАЧЕ ВЫРАЗИТЬ(ДополнительныеСведения.Значение.ПолноеНаименование КАК СТРОКА(1000))
	|				КОНЕЦ
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДополнительныеСведения.Значение)
	|	КОНЕЦ,
	|	""""
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.ОсновныеСредства) В
	|			(ВЫБРАТЬ
	|				ВТ.ОсновноеСредство
	|			ИЗ
	|				ОсновныеСредства КАК ВТ)
	|	И ДополнительныеСведения.Значение <> НЕОПРЕДЕЛЕНО
	|ИТОГИ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОсновноеСредство КАК ОсновноеСредство,
	|	ДрагоценныеМатериалы.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала КАК Драгметалл,
	|	ДрагоценныеМатериалы.ЕдИзм КАК НаименованиеЕИ,
	|	ДрагоценныеМатериалы.ЕдИзм.Код КАК КодЕИ,
	|	ДрагоценныеМатериалы.МассаДМ КАК Количество
	|ИЗ
	|	ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ИТОГИ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Файлы.ВладелецФайла КАК Ссылка,
	|	Файлы.Ссылка КАК Файл,
	|	Файлы.Наименование КАК ИмяФайла,
	|	Файлы.Описание КАК Описание
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла В(&МассивОбъектов)
	|	И НЕ Файлы.Служебный
	|	И НЕ Файлы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Обременения.Ссылка.ОС КАК ОсновноеСредство,
	|	Обременения.Ссылка КАК ИнвНомер,
	|	Обременения.ВидОбременения КАК ВидОграничения,
	|	Обременения.ДокументРегистрацииДата КАК РегистрацияДата,
	|	Обременения.ДокументРегистрацииНомер КАК РегистрацияНомер,
	|	Обременения.ЕдиницаИзмерения КАК ЕдИзмОграничения,
	|	Обременения.НаименованиеЧасти КАК НаименованиеЧасти,
	|	Обременения.РазмерЧасти КАК РазмерЧасти,
	|	Обременения.ДатаНачала КАК НачалоОграничения,
	|	Обременения.ДатаОкончания КАК ОкончаниеОграничения,
	|	Обременения.ДокументОбремененияВид КАК ВидДокументаОграничения,
	|	Обременения.ДокументОбремененияДата КАК ДатаДокументаОграничения,
	|	Обременения.ДокументОбремененияНомер КАК НомерДокументаОграничения,
	|	Обременения.Контрагент КАК Контрагент,
	|	"""" КАК НомерКартыОграничения
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС.Обременения КАК Обременения
	|ГДЕ
	|	Обременения.Ссылка.ОС В
	|			(ВЫБРАТЬ
	|				ВТ.ОсновноеСредство
	|			ИЗ
	|				ОсновныеСредства КАК ВТ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Обременения.Ссылка.ОС,
	|	Обременения.Ссылка,
	|	Обременения.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АмортизацияОбъектовОС.ОсновноеСредство КАК НФА,
	|	АмортизацияОбъектовОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АмортизацияОбъектовОС.ДатаСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА АмортизацияОбъектовОС.Период
	|			ИНАЧЕ АмортизацияОбъектовОС.ДатаСобытия
	|		КОНЕЦ) КАК ДатаОкончанияАмортизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		РН_Амортизация.ОсновноеСредство КАК ОсновноеСредство,
	|		РН_Амортизация.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|		РН_Амортизация.ДатаСобытия КАК ДатаСобытия,
	|		РН_Амортизация.Период КАК Период,
	|		РН_АмортизацияСторно.ДокументСторнированный ЕСТЬ NULL КАК НеСторнирован
	|	ИЗ
	|		РегистрНакопления.АмортизацияОбъектовОС КАК РН_Амортизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ     
	|				ОперацииСторно.ОсновноеСредство КАК ОсновноеСредство,
	|				ОперацииСторно.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|				ОперацииСторно.Регистратор.ДокументОснование КАК ДокументСторнированный
	|			ИЗ
	|				РегистрНакопления.АмортизацияОбъектовОС КАК ОперацииСторно
	|			ГДЕ	
	|				(ОперацииСторно.ОсновноеСредство, ОперацииСторно.ИнвентарныйНомер) В
	|						(ВЫБРАТЬ
	|							Таб.ОсновноеСредство,
	|							Таб.ИнвентарныйНомер
	|						ИЗ
	|							ОсновныеСредства КАК Таб)
	|				И ТИПЗНАЧЕНИЯ(ОперацииСторно.Регистратор) = ТИП(Документ.Сторно)
	|				И ОперацииСторно.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			) КАК РН_АмортизацияСторно
	|			
	|			ПО РН_Амортизация.Регистратор = РН_АмортизацияСторно.ДокументСторнированный
	|			И РН_Амортизация.ОсновноеСредство = РН_АмортизацияСторно.ОсновноеСредство
	|			И РН_Амортизация.ИнвентарныйНомер = РН_АмортизацияСторно.ИнвентарныйНомер
	|	ГДЕ
	|		(РН_Амортизация.ОсновноеСредство, РН_Амортизация.ИнвентарныйНомер) В
	|				(ВЫБРАТЬ
	|					Таб.ОсновноеСредство,
	|					Таб.ИнвентарныйНомер
	|				ИЗ
	|					ОсновныеСредства КАК Таб)
	|		И РН_Амортизация.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И ТИПЗНАЧЕНИЯ(РН_Амортизация.Регистратор) <> ТИП(Документ.Сторно)) КАК АмортизацияОбъектовОС           
	|ГДЕ
	|	АмортизацияОбъектовОС.НеСторнирован			
	|
	|СГРУППИРОВАТЬ ПО
	|	АмортизацияОбъектовОС.ОсновноеСредство,
	|	АмортизацияОбъектовОС.ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриложенныеФайлыДляЭДОБГУ.ВидСведений КАК ВидСведений,
	|	ПриложенныеФайлыДляЭДОБГУ.НаименованиеДокументаФайла КАК Описание,
	|	ПриложенныеФайлыДляЭДОБГУ.ПрисоединенныйФайл КАК Файл,
	|	ПриложенныеФайлыДляЭДОБГУ.ДокументЭД КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПриложенныеФайлыДляЭДОБГУ.ПрисоединенныйФайл) КАК ИмяФайла,
	|	ПриложенныеФайлыДляЭДОБГУ.НаименованиеДокументаФайла КАК НаименованиеДокументаФайла
	|ИЗ
	|	РегистрСведений.ПриложенныеФайлыДляЭДОБГУ КАК ПриложенныеФайлыДляЭДОБГУ
	|ГДЕ
	|	ПриложенныеФайлыДляЭДОБГУ.ДокументЭД В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	Документ КАК Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	Документ.Ссылка
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПолеАналитическойГруппы", 
	"ВЫБОР
	|		КОГДА ЕСТЬNULL(ОсновныеСредства.СчетУчета.Забалансовый, ИСТИНА)
	|			ТОГДА """"
	|		ИНАЧЕ ПОДСТРОКА(ОсновныеСредства.СчетУчета.Код, 5, 1) + ""0""
	|	КОНЕЦ");
	Результат = Запрос.ВыполнитьПакет();
	
	ДанныеДляПечати = Новый Структура;
	ДанныеДляПечати.Вставить("ВыборкаДокументов"	, Результат[10].Выбрать());
	ДанныеДляПечати.Вставить("ВыборкаНФА"			, Результат[11].Выбрать());
	ДанныеДляПечати.Вставить("СоставКомиссий"		, Результат[12].Выгрузить());
	ДанныеДляПечати.Вставить("ЕГРН"					, Результат[13].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДанныеДляПечати.Вставить("ПТС"					, Результат[14].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДанныеДляПечати.Вставить("Характеристики"		, Результат[15].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДанныеДляПечати.Вставить("Драгметаллы"			, Результат[16].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДанныеДляПечати.Вставить("ВыборкаФайлы"			, Результат[17].Выбрать());
	ДанныеДляПечати.Вставить("ВыборкаОбременения"	, Результат[18].Выбрать());
	ДанныеДляПечати.Вставить("ДатыОкончанияАмортизации", Результат[19].Выгрузить());
	ДанныеДляПечати.Вставить("ВыборкаФайлыАктаЭДО"	, Результат[20].Выбрать());
	ДанныеДляПечати.Вставить("ВыборкаДокументовПоКоличеству", Результат[21].Выбрать());
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция ДанныеДляПечатиОтветного0510448(МассивОбъектов) Экспорт
	
	ДанныеДляПечати = ДанныеДляПечати0510448_ОС(МассивОбъектов);
	
	ВыборкаДокументов  = ДанныеДляПечати.ВыборкаДокументов;
	ВыборкаОС          = ДанныеДляПечати.ВыборкаНФА;
	ВыборкаФайлы       = ДанныеДляПечати.ВыборкаФайлы;
	СоставКомиссий     = ДанныеДляПечати.СоставКомиссий;
	ВыборкаОбременения = ДанныеДляПечати.ВыборкаОбременения;
	ВыборкаФайлыАктаЭДО = ДанныеДляПечати.ВыборкаФайлыАктаЭДО;
	
	ДатыОкончанияАморт = Неопределено;
	Если ДанныеДляПечати.Свойство("ДанныеДляПечати") Тогда
		ДатыОкончанияАморт = ДанныеДляПечати.ДатыОкончанияАмортизации;
	КонецЕсли;	
	
	ДопКолонки = "НомерСтроки,НФА,НаименованиеНФА,Адрес,Назначение";
	Справочники.ОсновныеСредства.ИнициализироватьПараметрыДопХарактеристик(ДанныеДляПечати);
	ПустыеДанныеСтрокиХарактеристик = Новый Структура(ДопКолонки);
	
	ДанныеДокументов = УправлениеПечатьюБГУ.ТаблицаШапкиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		СтрокаДокумента = ДанныеДокументов.Добавить();
		СтрокаДокумента.ИндивидуальныеХарактеристики = УправлениеПечатьюБГУ.ТаблицаИндивидуальныеХарактеристикиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		СтрокаДокумента.ПередаваемыеОбъекты = УправлениеПечатьюБГУ.ТаблицаСведенияОПередаваемыхОбъектахНФААктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		СтрокаДокумента.ПринятыеОбъектыНФА = УправлениеПечатьюБГУ.ТаблицаСведенияОПринятыхОбъектахНФААктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		СтрокаДокумента.СведенияОбОграничениях = УправлениеПечатьюБГУ.ТаблицаСведенияОбОграниченияхАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		СтрокаДокумента.СоставКомиссии = УправлениеПечатьюБГУ.ТаблицаКомиссияДляПечатиПриказ61н();
		СтрокаДокумента.Файлы = ЭлектронныеДокументыБГУ.ТаблицаФайлыДляПечатиПриказ61н();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, ВыборкаДокументов);
		
		НачислятьАмортизациюПервымЧислом = Истина;
		Если ЗначениеЗаполнено(ВыборкаДокументов.Организация) И ЗначениеЗаполнено(ВыборкаДокументов.Дата) Тогда
			НачислятьАмортизациюПервымЧислом = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
				ВыборкаДокументов.Организация, НачалоМесяца(ВыборкаДокументов.Дата)).НачислятьАмортизациюПервымЧислом;
		КонецЕсли;		
		
		// Данные руководителя
		РуководительЕстьВЗапросе = Ложь;
		Если ВыборкаДокументов.Владелец().Колонки.Найти("Руководитель") <> Неопределено И ЗначениеЗаполнено(ВыборкаДокументов["Руководитель"]) Тогда
			РуководительЕстьВЗапросе = Истина;
		КонецЕсли;
		
		Если Не РуководительЕстьВЗапросе Тогда
			СтрокаДокумента.Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
				Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ВыборкаДокументов.Организация,
				ВыборкаДокументов.Дата, ВыборкаДокументов.СтруктурноеПодразделение).ОтветственноеЛицоСсылка;
		КонецЕсли;	

		// Шапка
		
		СтрокаДокумента.НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
			ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер);
		СтрокаДокумента.ДатаАкта = ВыборкаДокументов.Дата;
		
		// Раздел 1
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		
		ТаблицаХарактеристик = ДанныеДляПечати.ТаблицаХарактеристики.СкопироватьКолонки();
		СписокКолонок = СтрРазделить(ДопКолонки, ",");
		Для Каждого Колонка Из СписокКолонок Цикл
			ТаблицаХарактеристик.Колонки.Добавить(Колонка);
		КонецЦикла;
		
		ВыборкаОС.Сбросить();
		
		Пока ВыборкаОС.НайтиСледующий(СтруктураПоиска) Цикл
			
			Если ВыборкаДокументов.Передача Тогда
				
				СтрокаПередача = СтрокаДокумента.ПередаваемыеОбъекты.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПередача, ВыборкаОС);
				
				СтрокаПередача.СрокЭксплуатации = УправлениеОсновнымиСредствами.РассчитатьМесяцыЭксплуатации(,
					ВыборкаОС.ДатаВводаВЭксплуатацию, ?(ВыборкаДокументов.Принятие,
					ВыборкаДокументов.Дата, ВыборкаДокументов.ДатаСписания));
				
				СтрокаПередача.ДатаОкончанияАмортизации = 
					ДатаОкончанияАмортизацииРаздела1ф0510448(ВыборкаОС, ДатыОкончанияАморт, НачислятьАмортизациюПервымЧислом);
				
			КонецЕсли;
			
			ДанныеДляПечати.Вставить("МожетСодержатьДрагМатериалы", ВыборкаОС.МожетСодержатьДрагМатериалы);
			ДанныеДляПечати.Вставить("ДатаСписания", ВыборкаДокументов.ДатаСписания);
			
			СтруктураПоискаОС = Новый Структура("ОсновноеСредство", ВыборкаОС.НФА);
			Справочники.ОсновныеСредства.ЗаполнитьТаблицуДопХарактеристик(
				ДанныеДляПечати, СтруктураПоискаОС,, ВыборкаОС.ИнвентарныйНомерСсылка);
			Если ДанныеДляПечати.ТаблицаХарактеристики.Количество() = 0
				И ТипЗнч(ВыборкаОС.НФА) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
				СтрокаХар = ТаблицаХарактеристик.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаХар, ВыборкаОС);
			Иначе
				Для НомерСтроки = 1 По ДанныеДляПечати.ТаблицаХарактеристики.Количество() Цикл
					СтрокаХар = ТаблицаХарактеристик.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаХар, ДанныеДляПечати.ТаблицаХарактеристики[НомерСтроки-1]);
					Если НомерСтроки = 1 Тогда
						ЗаполнитьЗначенияСвойств(СтрокаХар, ВыборкаОС, ДопКолонки);
					ИначеЕсли НомерСтроки = 2 Тогда
						ЗаполнитьЗначенияСвойств(СтрокаХар, ПустыеДанныеСтрокиХарактеристик);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
		// Раздел 2
		
		Для Каждого СтрокаХарактеристик Из ТаблицаХарактеристик Цикл
			СтрокаИндивидуальныеХарактеристики = СтрокаДокумента.ИндивидуальныеХарактеристики.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИндивидуальныеХарактеристики, СтрокаХарактеристик);
		КонецЦикла;
		
		// Раздел 3
		
		Если ВыборкаОбременения <> Неопределено Тогда
			
			ВыборкаОС.Сбросить();
			Пока ВыборкаОС.Следующий() Цикл
				ОтборОС = Новый Структура("ОсновноеСредство, ИнвНомер", ВыборкаОС.НФА, ВыборкаОС.ИнвентарныйНомерСсылка);
				ПараметрыОтбора = Новый Структура("НФА, ИнвентарныйНомерСсылка", ВыборкаОС.НФА, ВыборкаОС.ИнвентарныйНомерСсылка);
				ВыборкаОбременения.Сбросить();
				Пока ВыборкаОбременения.НайтиСледующий(ОтборОС) Цикл
					СтрокаОграничения = СтрокаДокумента.СведенияОбОграничениях.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаОграничения, ВыборкаОС);
					ЗаполнитьЗначенияСвойств(СтрокаОграничения, ВыборкаОбременения);
					СтрокаОграничения.НФА = ВыборкаОбременения.ОсновноеСредство;
					Контрагент = ВыборкаОбременения.Контрагент;
					
					Реквизиты = "ИНН, КПП, ЮридическоеФизическоеЛицо, ВидКонтрагента, Наименование";
					ЗначенияРеквизитовКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаОбременения.Контрагент, Реквизиты);
					СтрокаОграничения.ИННКонтрагентаОграничения = ЗначенияРеквизитовКонтрагента.ИНН;
					СтрокаОграничения.КППКонтрагентаОграничения = ЗначенияРеквизитовКонтрагента.КПП;
					ЮридическоеФизическоеЛицо = ЗначенияРеквизитовКонтрагента.ЮридическоеФизическоеЛицо;
					Если ЗначенияРеквизитовКонтрагента.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
						РеквизитыЮЛ = "ОГРН, НаименованиеПолное";
						ЗначенияРеквизитовЮЛ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЮридическоеФизическоеЛицо, РеквизитыЮЛ);
						СтрокаОграничения.ОГРНКонтрагентаОграничения = ЗначенияРеквизитовЮЛ.ОГРН;
						СтрокаОграничения.НаименованиеКонтрагентаОграничения = ЗначенияРеквизитовЮЛ.НаименованиеПолное;
					Иначе
						СтрокаОграничения.НаименованиеКонтрагентаОграничения = Справочники.ФизическиеЛица.ФИОФизлица(ЮридическоеФизическоеЛицо);
					КонецЕсли;
					
					НайденныеСтроки = СтрокаДокумента.ПередаваемыеОбъекты.НайтиСтроки(ПараметрыОтбора);
					Если НайденныеСтроки.Количество()>0 Тогда
						СтрокаОграничения.НомерСтроки = НайденныеСтроки[0].НомерСтроки;	
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
		// Раздел 4
		
		Если ВыборкаДокументов.Принятие Тогда
			ВыборкаОС.Сбросить();
			
			Пока ВыборкаОС.НайтиСледующий(СтруктураПоиска) Цикл
			
				СтрокаПриятогоОбъекта = СтрокаДокумента.ПринятыеОбъектыНФА.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПриятогоОбъекта, ВыборкаДокументов);
				ЗаполнитьЗначенияСвойств(СтрокаПриятогоОбъекта, ВыборкаОС);
			
				Если ВыборкаОС.ПорядокНачисления = 3 // линейный метод начисления
					И ЗначениеЗаполнено(ВыборкаОС.ДатаВводаВЭксплуатацию) 
					И ЗначениеЗаполнено(ВыборкаОС.СрокПолезногоИспользования) Тогда
					СтрокаПриятогоОбъекта.ДатаОкончанияАмортизации = ДатаОкончанияАмортизации(
						ВыборкаОС.ДатаВводаВЭксплуатацию, 
						ВыборкаОС.СрокПолезногоИспользования, 
						НачислятьАмортизациюПервымЧислом);
				КонецЕсли;	 
				
			КонецЦикла;
		КонецЕсли;
		
		// Приложения
		
		КоличествоФайловЭД = 0;
		Пока ВыборкаФайлыАктаЭДО.НайтиСледующий(СтруктураПоиска) Цикл
			КоличествоФайловЭД = КоличествоФайловЭД + 1;
			
			ЗаполнитьЗначенияСвойств(СтрокаДокумента.Файлы.Добавить(), ВыборкаФайлыАктаЭДО);
		КонецЦикла;
		
		Если КоличествоФайловЭД = 0 Тогда
			Пока ВыборкаФайлы.НайтиСледующий(СтруктураПоиска) Цикл
				ЗаполнитьЗначенияСвойств(СтрокаДокумента.Файлы.Добавить(), ВыборкаФайлы);
			КонецЦикла;
		КонецЕсли;
		
		// Комиссия
		
		Отбор = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		СтрокиКомиссииДокумента = СоставКомиссий.НайтиСтроки(Отбор);
		Для Каждого СтрокаКомиссии Из СтрокиКомиссииДокумента Цикл
			СтрокаКомиссииДокумента = СтрокаДокумента.СоставКомиссии.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКомиссииДокумента, СтрокаКомиссии);
			ФИОСИнициалами = ЭлектронныеДокументыБГУ.ИнициалыФамилияПоСтруктуреФИО(СтрокаКомиссии);
			СтрокаКомиссииДокумента.ФИО = ФИОСИнициалами;
			СтрокаКомиссииДокумента.ОсобыеОтметки = ЭлектронныеДокументыБГУ.ФИОПоСтруктуре(СтрокаКомиссии);
		КонецЦикла;		
		
	КонецЦикла;
	
	Возврат ДанныеДокументов;
	
КонецФункции

Процедура ДобавитьКодККодуОбъекта(КодОбъекта, ИмяПоля, Выборка, КолонкиВыборки)
	ТекущийКод = "";
	Если КолонкиВыборки.Найти(ИмяПоля) <> Неопределено Тогда
		ТекущийКод = СокрЛП(Выборка[ИмяПоля]);
	КонецЕсли;	                                                     
	КодОбъекта = КодОбъекта + ?(ЗначениеЗаполнено(КодОбъекта), "/", "") + ?(ЗначениеЗаполнено(ТекущийКод), ТекущийКод, "-");
КонецПроцедуры	

Функция КодОбъектаКапвложенийДля0510448(ВыборкаОС, КолонкиВыборки)
	КодОбъекта = "";                                                                    
	ДобавитьКодККодуОбъекта(КодОбъекта, "УчетныйНомерОбъектаКапвложений", ВыборкаОС, КолонкиВыборки);
	ДобавитьКодККодуОбъекта(КодОбъекта, "РеестровыйНомерОбъектаКапвложений", ВыборкаОС, КолонкиВыборки);
	ДобавитьКодККодуОбъекта(КодОбъекта, "КадастровыйНомерОбъектаКапвложений", ВыборкаОС, КолонкиВыборки);
	ДобавитьКодККодуОбъекта(КодОбъекта, "КодФАИП", ВыборкаОС, КолонкиВыборки);
	
	КодОбъекта = ?(КодОбъекта = "-/-/-/-", "-", КодОбъекта);
	
	Возврат КодОбъекта;
КонецФункции	

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Многопоточный обработчик обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	ПервичныеДокументыБГУ.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры,
		Тип("ДокументСсылка.ПринятиеКУчетуОбъектовОС"));	
	
КонецПроцедуры

// Парный обработчик к процедуре ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию
// 
// Параметры:
//  Параметры - Структура:
//   * ОбработкаЗавершена - Булево
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПервичныеДокументыБГУ.ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры,
		Тип("ДокументСсылка.ПринятиеКУчетуОбъектовОС"));
	
КонецПроцедуры

#КонецОбласти

Функция ТаблицаРазделителейДокументов_ИнвентаризационнаяОписьНФА(ДокументОснование, СсылкаЦелевогоДокумента)
	Запрос = Новый Запрос;

	Документы.ИнвентаризационнаяОписьНФА.ЗапросДанныхДокументаИнвентаризации(Запрос, ДокументОснование, СсылкаЦелевогоДокумента);
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеИнвентаризации.ИФО КАК ИФО,
	|	ДанныеИнвентаризации.ЦМОРаздела4 КАК ЦМО
	|ИЗ
	|	ДанныеДокументаИнвентаризации КАК ДанныеИнвентаризации
	|ГДЕ
	|	ДанныеИнвентаризации.ДокументИнвентаризации = &Ссылка
	|	И ДанныеИнвентаризации.ВидОбъекта В (2, 3, 4)
	|	И ДанныеИнвентаризации.КоличествоИзлишкиНеПодтверждено <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеИнвентаризации.ИФО,
	|	ДанныеИнвентаризации.ЦМОРаздела4";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	Возврат(Запрос.Выполнить().Выгрузить());
КонецФункции	

Функция ДатаОкончанияАмортизации(ДатаВводаВЭксплуатацию, СрокПолезногоИспользования, НачислятьАмортизациюПервымЧислом)
	Если НачислятьАмортизациюПервымЧислом Тогда
		ДатаОкончанияАмортизации = НачалоМесяца(ДобавитьМесяц(ДатаВводаВЭксплуатацию, СрокПолезногоИспользования));
	Иначе	
		ДатаОкончанияАмортизации = КонецМесяца(ДобавитьМесяц(ДатаВводаВЭксплуатацию, СрокПолезногоИспользования));
	КонецЕсли;
	Возврат ДатаОкончанияАмортизации;	
КонецФункции	

Функция ДатаОкончанияАмортизацииРаздела1ф0510448(ВыборкаОС, ДатыОкончанияАморт, НачислятьАмортизациюПервымЧислом)
	Если ВыборкаОС.ПорядокНачисления = 3 // линейный метод начисления
		И (ЗначениеЗаполнено(ВыборкаОС.ДатаВводаВЭксплуатацию) 
			ИЛИ ЗначениеЗаполнено(ВыборкаОС.ДатаПринятиеКУчету)) 
		И ЗначениеЗаполнено(ВыборкаОС.СрокПолезногоИспользования) Тогда
		
		ДатаОтсчета = ВыборкаОС.ДатаПринятиеКУчету;
		Если ЗначениеЗаполнено(ВыборкаОС.ДатаВводаВЭксплуатацию) 
			И ЗначениеЗаполнено(ДатаОтсчета) 
			И ВыборкаОС.ДатаВводаВЭксплуатацию < ДатаОтсчета Тогда
			ДатаОтсчета = ВыборкаОС.ДатаВводаВЭксплуатацию;	 
		КонецЕсли;
		 	
		ДатаОкончанияАмортизации = ДатаОкончанияАмортизации(
			ДатаОтсчета, 
			ВыборкаОС.СрокПолезногоИспользования, 
			НачислятьАмортизациюПервымЧислом);
	Иначе								
		ПоискДаты = Новый Структура;
		ПоискДаты.Вставить("НФА", ВыборкаОС.НФА);
		ПоискДаты.Вставить("ИнвентарныйНомер", ВыборкаОС.ИнвентарныйНомерСсылка);
		
		Если ДатыОкончанияАморт <> Неопределено Тогда
			НайденныеДаты = ДатыОкончанияАморт.НайтиСтроки(ПоискДаты);
			Если НайденныеДаты.Количество() > 0 И ЗначениеЗаполнено(НайденныеДаты[0].ДатаОкончанияАмортизации) Тогда
				ДатаОкончанияАмортизации = НайденныеДаты[0].ДатаОкончанияАмортизации;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	                     
	
	Возврат ДатаОкончанияАмортизации;
КонецФункции	

#КонецОбласти

#КонецЕсли

