
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = '2022.12.31 23:59:59';
		Если ПустаяСтрока(Объект.Содержание) Тогда
			Объект.Содержание = НСтр("ru = 'Перевод в состав биологических активов'");
		КонецЕсли;
		УстановитьВидимостьЭлементов(ЭтотОбъект);
		ЗаполнитьСчетаДляОтбора();
	КонецЕсли;
	УстановитьДоступностьЗаполнения(ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Тогда
		ОбработкаВыбораПодбораНоменклатурыНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	ЗаполнитьСчетаДляОтбора();
	ОтметитьСохраненныеСчета();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьОтмеченныеСчета(ТекущийОбъект);
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьДоступностьЗаполнения(ЭтотОбъект);
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ВидОперацииПриИзмененииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИФОПриИзменении(Элемент)
	
	Объект.ОсновныеСредства.Очистить();
	Объект.Материалы.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКФОПриИзменении(Элемент)
	
	Объект.ОсновныеСредства.Очистить();
	Объект.Материалы.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	
	Объект.ОсновныеСредства.Очистить();
	Объект.Материалы.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьОС(Команда)
	
	ЗаполнитьОССервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОСБаланс(Команда)
	
	ОСБаланс = Истина;
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьОСОперУчет(Команда)
	
	ОСБаланс = Ложь;
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСчетОС(Команда)
	
	Если Элементы.ОсновныеСредства.ВыделенныеСтроки.Количество() > 0 Тогда
		ЗаполнитьСчетБА("ОсновныеСредства");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМЗизОС(Команда)
	
	СоздатьМЗВопрос("ОсновныеСредства");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМЗ(Команда)
	
	ЗаполнитьМЗСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьМЗ(Команда)
	
	УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборМатериаловРасширенный(ЭтотОбъект, Объект,, ДополнитьСтруктуруПодбора());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСчетМЗ(Команда)
	
	Если Элементы.Материалы.ВыделенныеСтроки.Количество() > 0 Тогда
		ЗаполнитьСчетБА("Материалы");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМЗизМЗ(Команда)
	
	СоздатьМЗВопрос("Материалы");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВложения(Команда)
	
	ЗаполнитьВложенияСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьВложенияОС(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьВложенияМЗ(Команда)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор,ЗакрыватьПриВыборе", Истина, Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Вложения);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМЗизВложений(Команда)
	
	СоздатьМЗВопрос("Вложения");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВПути(Команда)
	
	ЗаполнитьВПутиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьВПутиОС(Команда)
	
	Отбор = Новый Структура("Организация", Объект.Организация);
	ПараметрыФормы = Новый Структура("МножественныйВыбор,ЗакрыватьПриВыборе,Отбор", Истина, Ложь, Отбор);
	ОткрытьФорму("Справочник.ОсновныеСредства.ФормаВыбора", ПараметрыФормы, Элементы.ВПути);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьВПутиМЗ(Команда)
	
	ПараметрыФормы = Новый Структура("МножественныйВыбор,ЗакрыватьПриВыборе", Истина, Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.ВПути);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМЗизВПути(Команда)
	
	СоздатьМЗВопрос("ВПути");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеСредства

&НаКлиенте
Процедура ОсновныеСредстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваЦенаБАПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.СуммаБА = ТекущиеДанные.Количество * ТекущиеДанные.ЦенаБА;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСчетУчетаБАПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СчетУчетаБА) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ОсновноеСредство,ИнвентарныйНомер,СчетУчетаБА",
		ТекущиеДанные.ОсновноеСредство, ТекущиеДанные.ИнвентарныйНомер,
		ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка"));
	
	СтрокиТЧ = Объект.ОсновныеСредства.НайтиСтроки(Отбор);
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
		СтрокаТЧ.СчетУчетаБА = ТекущиеДанные.СчетУчетаБА;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваНоменклатураБАПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.НоменклатураБА) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ОсновноеСредство,ИнвентарныйНомер,НоменклатураБА",
		ТекущиеДанные.ОсновноеСредство, ТекущиеДанные.ИнвентарныйНомер,
		ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	
	СтрокиТЧ = Объект.ОсновныеСредства.НайтиСтроки(Отбор);
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
		СтрокаТЧ.НоменклатураБА = ТекущиеДанные.НоменклатураБА;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаБАПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.СуммаБА = ?(ТекущиеДанные.ЦенаБА = ТекущиеДанные.Цена,
			ТекущиеДанные.Сумма, ТекущиеДанные.Количество * ТекущиеДанные.ЦенаБА);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаБАПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ЦенаБА = ?(ТекущиеДанные.Количество = 0, 0,
			Окр(ТекущиеДанные.СуммаБА / ТекущиеДанные.Количество, 2));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаБАПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СчетУчетаБА) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Номенклатура,СчетУчетаБА", ТекущиеДанные.Номенклатура,
		ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка"));
	
	СтрокиТЧ = Объект.Материалы.НайтиСтроки(Отбор);
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
		СтрокаТЧ.СчетУчетаБА = ТекущиеДанные.СчетУчетаБА;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураБАПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.НоменклатураБА) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Номенклатура,НоменклатураБА", ТекущиеДанные.Номенклатура,
		ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	
	СтрокиТЧ = Объект.Материалы.НайтиСтроки(Отбор);
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
		СтрокаТЧ.НоменклатураБА = ТекущиеДанные.НоменклатураБА;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВложения

&НаКлиенте
Процедура ВложенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		ЗаполнитьВложенияПодборомМЗ(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложенияПодборомМЗ(СписокМЗ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСчетов", БухгалтерскийУчет.СписокСчетов("106.2П,106.3П"));
	Запрос.УстановитьПараметр("Организация"	, Объект.Организация);
	Запрос.УстановитьПараметр("СписокМЗ"	, СписокМЗ);
	Запрос.УстановитьПараметр("Период"		, Объект.Дата + 1);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Вложение,
	|	ЕСТЬNULL(Остатки.Счет, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетУчета,
	|	ЕСТЬNULL(ЕПСБУ.Ссылка, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетУчетаБА
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|				&Период,
	|				Счет В (&СписокСчетов),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура),
	|				Организация = &Организация
	|					И Субконто1 В (&СписокМЗ)) КАК Остатки
	|		ПО (Номенклатура.Ссылка = (ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.Номенклатура)))
	|			И (Остатки.КоличествоОстаток <> 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ПО (""106."" + ПОДСТРОКА(Остатки.Счет.Код, 5, 1) + ""7"" = ЕПСБУ.Код)
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокМЗ)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура("Вложение,СчетУчета", Выборка.Вложение, Выборка.СчетУчета);
		Если Объект.Вложения.НайтиСтроки(Отбор).Количество() = 0 Тогда
			НоваяСтрока = Объект.Вложения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВПути

&НаКлиенте
Процедура ВПутиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		ТипЭлемента = ТипЗнч(ВыбранноеЗначение[0]);
		Если ТипЭлемента = Тип("СправочникСсылка.ОсновныеСредства") Тогда
			ЗаполнитьВПутиПодборомОС(ВыбранноеЗначение);
		ИначеЕсли ТипЭлемента = Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаполнитьВПутиПодборомМЗ(ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВПутиПодборомОС(СписокОС)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСчетов", БухгалтерскийУчет.СписокСчетов("107.21,107.31"));
	Запрос.УстановитьПараметр("Организация"	, Объект.Организация);
	Запрос.УстановитьПараметр("СписокОС"	, СписокОС);
	Запрос.УстановитьПараметр("Период"		, Объект.Дата + 1);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.Ссылка КАК НФА,
	|	ЕСТЬNULL(Остатки.Счет, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетУчета,
	|	ЕСТЬNULL(ЕПСБУ.Ссылка, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетУчетаБА
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|				&Период,
	|				Счет В (&СписокСчетов),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
	|				Организация = &Организация
	|					И Субконто1 В (&СписокОС)) КАК Остатки
	|		ПО (ОсновныеСредства.Ссылка = (ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.ОсновныеСредства)))
	|			И (Остатки.КоличествоОстаток <> 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ПО (""107."" + ПОДСТРОКА(Остатки.Счет.Код, 5, 1) + ""4"" = ЕПСБУ.Код)
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&СписокОС)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура("НФА,СчетУчета", Выборка.НФА, Выборка.СчетУчета);
		Если Объект.ВПути.НайтиСтроки(Отбор).Количество() = 0 Тогда
			НоваяСтрока = Объект.ВПути.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВПутиПодборомМЗ(СписокМЗ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСчетов", БухгалтерскийУчет.СписокСчетов("107.23,107.33"));
	Запрос.УстановитьПараметр("Организация"	, Объект.Организация);
	Запрос.УстановитьПараметр("СписокМЗ"	, СписокМЗ);
	Запрос.УстановитьПараметр("Период"		, Объект.Дата + 1);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК НФА,
	|	ЕСТЬNULL(Остатки.Счет, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетУчета,
	|	ЕСТЬNULL(ЕПСБУ.Ссылка, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетУчетаБА
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|				&Период,
	|				Счет В (&СписокСчетов),
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура),
	|				Организация = &Организация
	|					И Субконто1 В (&СписокМЗ)) КАК Остатки
	|		ПО (Номенклатура.Ссылка = (ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.Номенклатура)))
	|			И (Остатки.КоличествоОстаток <> 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ПО (""107."" + ПОДСТРОКА(Остатки.Счет.Код, 5, 1) + ""4"" = ЕПСБУ.Код)
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокМЗ)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура("НФА,СчетУчета", Выборка.НФА, Выборка.СчетУчета);
		Если Объект.ВПути.НайтиСтроки(Отбор).Количество() = 0 Тогда
			НоваяСтрока = Объект.ВПути.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПометкуВсеСчета(Команда)
	УстановитьЗначениеПометкиВсеСчета(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуВсеСчета(Команда)
	УстановитьЗначениеПометкиВсеСчета(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	ОтмеченныеСчета = ОтмеченныеСчета();
	ЗаполнитьСчетаДляОтбора();
	Для Каждого Счет Из СчетаДляОтбора Цикл
		Счет.Пометка = ОтмеченныеСчета.Получить(Счет.Значение) <> Неопределено;
	КонецЦикла;
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеПометкиВсеСчета(Пометка)
	Для Каждого Счет Из СчетаДляОтбора Цикл
		Счет.Пометка = Пометка;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СчетаПоКоду(КодыСчетов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка
	|ПОМЕСТИТЬ РодительскиеСчета
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Код В (&КодыСчетов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Ссылка,
	|	ЕПСБУ.Код КАК Код,
	|	ЕПСБУ.Наименование,
	|	ЕПСБУ.ДатаНачалаДействия,
	|	ЕПСБУ.ДатаОкончанияДействия
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В ИЕРАРХИИ
	|		(ВЫБРАТЬ
	|			РодительскиеСчета.Ссылка
	|		ИЗ
	|			РодительскиеСчета КАК РодительскиеСчета)
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	Запрос.УстановитьПараметр("КодыСчетов", СтрРазделить(КодыСчетов, ","));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСчетаДляОтбора()
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.ОсновныеСредства") Тогда
		СтрокаСчетов = "101.00,21";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.МатериальныеЗапасы") Тогда
		СтрокаСчетов = "105.36,105.26";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.Вложения") Тогда
		СтрокаСчетов = "106.21,106.31,106.2П,106.3П";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.ВПути") Тогда
		СтрокаСчетов = "107.21,107.23,107.31,107.33";
	Иначе
		СтрокаСчетов = "";
	КонецЕсли;
	
	СчетаДляОтбора.Очистить();
	Для Каждого Счет Из СчетаПоКоду(СтрокаСчетов) Цикл
		Если ЗначениеЗаполнено(Счет.ДатаОкончанияДействия) Тогда
			ПредставлениеСчета = НСтр("ru = '%1 - (до %3) %2'");
		Иначе
			ПредставлениеСчета = НСтр("ru = '%1 - %2'");
		КонецЕсли;
		СчетаДляОтбора.Добавить(Счет.Ссылка, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПредставлениеСчета,
			Счет.Код,
			Счет.Наименование,
			Формат(Счет.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy;")));
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СчетаСУчетомОтметок(КодыСчетов)
	
	ОтмеченныеСчета = ОтмеченныеСчета();
	Результат = Новый Массив;
	Для Каждого Счет Из СчетаПоКоду(КодыСчетов) Цикл
		Если ОтмеченныеСчета.Количество() = 0
			Или ОтмеченныеСчета.Получить(Счет.Ссылка) <> Неопределено Тогда
			Результат.Добавить(Счет.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОтмеченныеСчета()
	Результат = Новый Соответствие;
	Для Каждого Счет Из СчетаДляОтбора Цикл
		Если Счет.Пометка Тогда
			Результат.Вставить(Счет.Значение, Истина);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура СохранитьОтмеченныеСчета(ТекущийОбъект)
	ТекущийОбъект.ОтборСчета.Очистить();
	Для Каждого Счет Из ОтмеченныеСчета() Цикл
		ТекущийОбъект.ОтборСчета.Добавить().СчетУчета = Счет.Ключ;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОтметитьСохраненныеСчета()
	СохраненныеСчета = Объект.ОтборСчета.Выгрузить();
	СохраненныеСчета.Индексы.Добавить("СчетУчета");
	
	Для Каждого Счет Из СчетаДляОтбора Цикл
		Счет.Пометка = СохраненныеСчета.Найти(Счет.Значение, "СчетУчета") <> Неопределено;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОсновныеСредстваЗаголовокОС.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОсновныеСредства.ОсновноеСредство", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "ОС:");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОсновныеСредстваЗаголовокБА.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОсновныеСредства.ОсновноеСредство", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "БА:");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыЗаголовокМЗ.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.Номенклатура", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "МЗ:");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыЗаголовокБА.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.Номенклатура", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "БА:");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.СтраницаОС.Видимость = (Объект.ВидОперации =
		ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.ОсновныеСредства"));
	Элементы.СтраницаМЗ.Видимость = (Объект.ВидОперации =
		ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.МатериальныеЗапасы"));
	Элементы.СтраницаВложения.Видимость = (Объект.ВидОперации =
		ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.Вложения"));
	Элементы.СтраницаВПути.Видимость = (Объект.ВидОперации =
		ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.ВПути"));
	
	Элементы.ПеренестиОбесценение.Видимость = Элементы.СтраницаОС.Видимость;
	
	ВидимостьОтборМЗ = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.МатериальныеЗапасы")
		Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.Вложения")
		Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.ВПути");
	ВидимостьОтборОС = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.ОсновныеСредства")
		Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.Вложения")
		Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.ВПути");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОтборГруппаМЗ", "Видимость", ВидимостьОтборМЗ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОтборГруппаОС", "Видимость", ВидимостьОтборОС);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЗаполнения(Форма)
	
	Элементы = Форма.Элементы;
	МожноЗаполнить = Не Форма.Объект.Проведен;
	
	Элементы.ПодсказкаЗаполнение1.Видимость		= Не МожноЗаполнить;
	Элементы.ПодсказкаЗаполнение2.Видимость		= Не МожноЗаполнить;
	Элементы.ПодсказкаЗаполнение3.Видимость		= Не МожноЗаполнить;
	Элементы.ПодсказкаЗаполнение4.Видимость		= Не МожноЗаполнить;
	
	Элементы.ОсновныеСредстваПодбор.Доступность	= МожноЗаполнить;
	Элементы.МатериалыПодбор.Доступность		= МожноЗаполнить;
	Элементы.ВложенияПодбор.Доступность			= МожноЗаполнить;
	Элементы.ВПутиПодбор.Доступность			= МожноЗаполнить;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.Вложения") Тогда
		
		ПараметрыПодбора.Отбор.Вставить("Организация", Объект.Организация);
		
		Если ЗначениеЗаполнено(Объект.ОтборИФО) Тогда
			ПараметрыПодбора.Отбор.Вставить("ИФО", Объект.ОтборИФО);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ОтборКФО) Тогда
			ПараметрыПодбора.Отбор.Вставить("КФО", Объект.ОтборКФО);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
			ПараметрыПодбора.Отбор.Вставить("Подразделение", Объект.ОтборПодразделение);
		КонецЕсли;
		
		ПараметрыПодбора.Отбор.Вставить("Счет", "106.21,106.31");
		ПараметрыПодбора.Вставить("ВидРаспоряжения", "Вложения");
		ПараметрыПодбора.Вставить("СкрытьКолонки", "ВидНФА,КФО,КПС,Подразделение,Количество,Цена,Сумма");
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.ОсновныеСредства") Тогда
		
		ПараметрыПодбора.Отбор.Вставить("Организация", Объект.Организация);
		ПараметрыПодбора.Отбор.Вставить("ВидНФА", ПредопределенноеЗначение("Перечисление.ВидыНФА.ОС"));
		ПараметрыПодбора.Отбор.Вставить("ТипНФА", ПредопределенноеЗначение("Перечисление.ТипыНФА.Биоресурсы"));
		
		Если ЗначениеЗаполнено(Объект.ОтборИФО) Тогда
			ПараметрыПодбора.Отбор.Вставить("ИФО", Объект.ОтборИФО);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ОтборКФО) Тогда
			ПараметрыПодбора.Отбор.Вставить("КФО", Объект.ОтборКФО);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
			ПараметрыПодбора.Отбор.Вставить("Подразделение", Объект.ОтборПодразделение);
		КонецЕсли;
		
		Если ОСБаланс Тогда
			ПараметрыПодбора.Отбор.Вставить("Счет", "101.00");
			ПараметрыПодбора.Вставить("ВидРаспоряжения", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаБалансе"));
		Иначе
			ПараметрыПодбора.Вставить("ВидРаспоряжения", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.ОперативныйУчет"));
		КонецЕсли;
		
		ПараметрыПодбора.Вставить("СкрытьКолонки", "КФО,КПС,ЦМО");
		
		Если Объект.ОсновныеСредства.Количество() > 0 Тогда
			ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьОСВХранилище()
	
	ТаблицаОС = Объект.ОсновныеСредства.Выгрузить();
	
	ТаблицаОС.Колонки.Добавить("ГрупповойУчет");
	Данные = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТаблицаОС.ВыгрузитьКолонку("ОсновноеСредство"), "ГрупповойУчет");
	Для Каждого СтрокаОС Из ТаблицаОС Цикл
		СтрокаОС.ГрупповойУчет = Данные[СтрокаОС.ОсновноеСредство];
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);
	
КонецФункции

&НаСервере
Функция СоответствиеСчетовВложений(СписокСчетов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетСтарый.Ссылка КАК СчетСтарый,
	|	СчетНовый.Ссылка КАК СчетНовый
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК СчетСтарый
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК СчетНовый
	|		ПО (""106."" + ПОДСТРОКА(СчетСтарый.Код, 5, 1) + ""7"" = СчетНовый.Код)
	|ГДЕ
	|	СчетСтарый.Ссылка В(&СписокСчетов)";
	
	Результат = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.СчетСтарый, Выборка.СчетНовый);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодборПоОстаткамЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработкаВыбораПодбораОсновныхСредствНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодбораОсновныхСредствНаСервере(Знач ВыбранноеЗначение)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.Вложения") Тогда
		
		НовыеСтроки = Новый Массив;
		СписокСчетов = Новый Массив;
		
		Таблица = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресОСВХранилище);
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			Отбор = Новый Структура("Вложение,СчетУчета", СтрокаТаблицы.ОсновноеСредство, СтрокаТаблицы.СчетУчета);
			Если Объект.Вложения.НайтиСтроки(Отбор).Количество() = 0 Тогда
				НоваяСтрока = Объект.Вложения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Отбор);
				НовыеСтроки.Добавить(НоваяСтрока);
				СписокСчетов.Добавить(НоваяСтрока.СчетУчета);
			КонецЕсли;
		КонецЦикла;
		
		СчетСтарыйНовый = СоответствиеСчетовВложений(СписокСчетов);
		
		Для Каждого НоваяСтрока Из НовыеСтроки Цикл
			НоваяСтрока.СчетУчетаБА = СчетСтарыйНовый[НоваяСтрока.СчетУчета];
		КонецЦикла;
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковБА.ОсновныеСредства") Тогда
		
		ДобавленныеСтроки = УправлениеОсновнымиСредствами.ОбработатьПодборОсновныхСредств(
			Объект.ОсновныеСредства, ВыбранноеЗначение, , "ОсновноеСредство,ИнвентарныйНомер");
		
		Для Каждого НоваяСтрока Из ДобавленныеСтроки Цикл
			НоваяСтрока.ЦенаБА = НоваяСтрока.Цена;
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из Объект.ОсновныеСредства Цикл
			ТекущаяСтрока.СуммаБА = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаБА;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОССервер()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	Остатки.Счет КАК СчетУчета
	|ПОМЕСТИТЬ ВТ_РБ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СписокСчетов),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).ВидНФА = ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ОС)
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).ТипНФА = ЗНАЧЕНИЕ(Перечисление.ТипыНФА.Биоресурсы)
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И &ОтборГруппаОС) КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ОсновноеСредство КАК ОсновноеСредство,
	|	Остатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	Остатки.КоличествоОстаток КАК Количество,
	|	Остатки.СтоимостьОстаток КАК Сумма,
	|	ВЫБОР
	|		КОГДА Остатки.КоличествоОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Остатки.СтоимостьОстаток / Остатки.КоличествоОстаток КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК Цена,
	|	ВТ_РБ.СчетУчета КАК СчетУчета
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ_РБ.ОсновноеСредство КАК ОсновноеСредство
	|					ИЗ
	|						ВТ_РБ КАК ВТ_РБ)
	|				И Подразделение = &Подразделение) КАК Остатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РБ КАК ВТ_РБ
	|		ПО Остатки.ОсновноеСредство = ВТ_РБ.ОсновноеСредство
	|			И (ВЫБОР
	|				КОГДА Остатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ = ВТ_РБ.СчетУчета.Забалансовый)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Остатки.ОсновноеСредство.Наименование,
	|	Остатки.ИнвентарныйНомер.Код";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период"			, Объект.Дата + 1);
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("СписокСчетов"	, СчетаСУчетомОтметок("101.00,21"));
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(Объект.ОтборИФО) Тогда
		Запрос.УстановитьПараметр("ИФО", Объект.ОтборИФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИФО = &ИФО", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОтборКФО) Тогда
		Запрос.УстановитьПараметр("КФО", Объект.ОтборКФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КФО = &КФО", "");
	КонецЕсли;
	
	Если УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям() И ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Объект.ОтборПодразделение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Подразделение = &Подразделение", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ОтборГруппаОС) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборГруппаОС", "Субконто1 В ИЕРАРХИИ (&ГруппаОС)");
		Запрос.УстановитьПараметр("ГруппаОС", Объект.ОтборГруппаОС);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборГруппаОС", "ИСТИНА");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Объект.ОсновныеСредства.Загрузить(Результат);
	
	Для Каждого СтрокаОС Из Объект.ОсновныеСредства Цикл
		СтрокаОС.ЦенаБА  = СтрокаОС.Цена;
		СтрокаОС.СуммаБА = СтрокаОС.Сумма;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМЗСервер()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Счет КАК СчетУчета,
	|	Остатки.КФО КАК КФО,
	|	Остатки.КПС КАК КПС,
	|	Остатки.ИФО КАК ИФО,
	|	Остатки.Подразделение КАК Подразделение,
	|	ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	Остатки.КоличествоОстатокДт КАК Количество,
	|	Остатки.СуммаОстатокДт КАК Сумма,
	|	ВЫБОР
	|		КОГДА Остатки.КоличествоОстатокДт = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(Остатки.СуммаОстатокДт / Остатки.КоличествоОстатокДт КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СписокСчетов),
	|			,
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И Подразделение = &Подразделение
	|				И &ОтборГруппаМЗ) КАК Остатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.Номенклатура).Наименование";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период"			, Объект.Дата + 1);
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("СписокСчетов"	, СчетаСУчетомОтметок("105.26,105.36"));
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(Объект.ОтборИФО) Тогда
		Запрос.УстановитьПараметр("ИФО", Объект.ОтборИФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИФО = &ИФО", "");
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Остатки.ИФО", "Значение(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОтборКФО) Тогда
		Запрос.УстановитьПараметр("КФО", Объект.ОтборКФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КФО = &КФО", "");
	КонецЕсли;
	
	УчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("105.00").УчетПоПодразделениям;
	
	Если УчетПоПодразделениям И ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Объект.ОтборПодразделение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Подразделение = &Подразделение", "");
	КонецЕсли;
	Если Не УчетПоПодразделениям Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Остатки.Подразделение", "Значение(Справочник.Подразделения.ПустаяСсылка)");
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОтборГруппаМЗ) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборГруппаМЗ", "Субконто1 В ИЕРАРХИИ (&ГруппаМЗ)");
		Запрос.УстановитьПараметр("ГруппаМЗ", Объект.ОтборГруппаМЗ);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборГруппаМЗ", "ИСТИНА");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Объект.Материалы.Загрузить(Результат);
	
	Для Каждого СтрокаМЗ Из Объект.Материалы Цикл
		СтрокаМЗ.ЦенаБА  = СтрокаМЗ.Цена;
		СтрокаМЗ.СуммаБА = СтрокаМЗ.Сумма;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВложенияСервер()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Счет КАК СчетУчета,
	|	ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.ОсновныеСредства) КАК Вложение
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СписокСчетов),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И Подразделение = &Подразделение
	|				И &ОтборГруппаОС) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоОстаток <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Счет,
	|	ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.Номенклатура)
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СписокСчетов),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура),
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И Подразделение = &Подразделение
	|				И &ОтборГруппаМЗ) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоОстаток <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.ОсновноеСредство КАК НФА,
	|	ОсновныеСредства.НоменклатураБА КАК НоменклатураБА
	|ПОМЕСТИТЬ ВТ_СоответствиеБА
	|ИЗ
	|	Документ.ПереносОстатковБиологическиеАктивы.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Материалы.Номенклатура,
	|	Материалы.НоменклатураБА
	|ИЗ
	|	Документ.ПереносОстатковБиологическиеАктивы.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СоответствиеБА.НФА КАК НФА,
	|	МАКСИМУМ(ВТ_СоответствиеБА.НоменклатураБА) КАК НоменклатураБА
	|ПОМЕСТИТЬ ВТ_БА
	|ИЗ
	|	ВТ_СоответствиеБА КАК ВТ_СоответствиеБА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СоответствиеБА.НФА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.Вложение КАК Вложение,
	|	ВТ_Остатки.СчетУчета КАК СчетУчета,
	|	ВТ_БА.НоменклатураБА КАК НоменклатураБА,
	|	ЕПСБУ.Ссылка КАК СчетУчетаБА
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БА КАК ВТ_БА
	|		ПО ВТ_Остатки.Вложение = ВТ_БА.НФА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ПО (""106."" + ПОДСТРОКА(ВТ_Остатки.СчетУчета.Код, 5, 1) + ""7"" = ЕПСБУ.Код)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Остатки.СчетУчета.Порядок,
	|	ВТ_Остатки.Вложение.Наименование";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период"			, Объект.Дата + 1);
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("СписокСчетов"	, СчетаСУчетомОтметок("106.21,106.31,106.2П,106.3П"));
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(Объект.ОтборИФО) Тогда
		Запрос.УстановитьПараметр("ИФО", Объект.ОтборИФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИФО = &ИФО", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОтборКФО) Тогда
		Запрос.УстановитьПараметр("КФО", Объект.ОтборКФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КФО = &КФО", "");
	КонецЕсли;
	
	Если УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям() И ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Объект.ОтборПодразделение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Подразделение = &Подразделение", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ОтборГруппаОС) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборГруппаОС", "Субконто1 В ИЕРАРХИИ (&ГруппаОС)");
		Запрос.УстановитьПараметр("ГруппаОС", Объект.ОтборГруппаОС);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборГруппаОС", "ИСТИНА");
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ОтборГруппаМЗ) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборГруппаМЗ", "Субконто1 В ИЕРАРХИИ (&ГруппаМЗ)");
		Запрос.УстановитьПараметр("ГруппаМЗ", Объект.ОтборГруппаМЗ);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборГруппаМЗ", "ИСТИНА");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Объект.Вложения.Загрузить(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВПутиСервер()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Остатки.Счет КАК СчетУчета,
	|	ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.ОсновныеСредства) КАК НФА
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СписокСчетов),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И Подразделение = &Подразделение
	|				И &ОтборГруппаОС) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоОстаток <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Счет,
	|	ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.Номенклатура)
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СписокСчетов),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура),
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И Подразделение = &Подразделение
	|				И &ОтборГруппаМЗ) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоОстаток <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.ОсновноеСредство КАК НФА,
	|	ОсновныеСредства.НоменклатураБА КАК НоменклатураБА
	|ПОМЕСТИТЬ ВТ_СоответствиеБА
	|ИЗ
	|	Документ.ПереносОстатковБиологическиеАктивы.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Материалы.Номенклатура,
	|	Материалы.НоменклатураБА
	|ИЗ
	|	Документ.ПереносОстатковБиологическиеАктивы.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СоответствиеБА.НФА КАК НФА,
	|	МАКСИМУМ(ВТ_СоответствиеБА.НоменклатураБА) КАК НоменклатураБА
	|ПОМЕСТИТЬ ВТ_БА
	|ИЗ
	|	ВТ_СоответствиеБА КАК ВТ_СоответствиеБА
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СоответствиеБА.НФА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.НФА КАК НФА,
	|	ВТ_Остатки.СчетУчета КАК СчетУчета,
	|	ВТ_БА.НоменклатураБА КАК НоменклатураБА,
	|	ЕПСБУ.Ссылка КАК СчетУчетаБА
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БА КАК ВТ_БА
	|		ПО ВТ_Остатки.НФА = ВТ_БА.НФА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ПО (""107."" + ПОДСТРОКА(ВТ_Остатки.СчетУчета.Код, 5, 1) + ""4"" = ЕПСБУ.Код)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Остатки.СчетУчета.Порядок,
	|	ВТ_Остатки.НФА.Наименование";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период"			, Объект.Дата + 1);
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("СписокСчетов"	, СчетаСУчетомОтметок("107.21,107.23,107.31,107.33"));
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(Объект.ОтборИФО) Тогда
		Запрос.УстановитьПараметр("ИФО", Объект.ОтборИФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИФО = &ИФО", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОтборКФО) Тогда
		Запрос.УстановитьПараметр("КФО", Объект.ОтборКФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КФО = &КФО", "");
	КонецЕсли;
	
	Если УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям() И ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Объект.ОтборПодразделение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Подразделение = &Подразделение", "");
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ОтборГруппаОС) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборГруппаОС", "Субконто1 В ИЕРАРХИИ (&ГруппаОС)");
		Запрос.УстановитьПараметр("ГруппаОС", Объект.ОтборГруппаОС);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборГруппаОС", "ИСТИНА");
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.ОтборГруппаМЗ) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборГруппаМЗ", "Субконто1 В ИЕРАРХИИ (&ГруппаМЗ)");
		Запрос.УстановитьПараметр("ГруппаМЗ", Объект.ОтборГруппаМЗ);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборГруппаМЗ", "ИСТИНА");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Объект.ВПути.Загрузить(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМЗВопрос(ИмяТЧ)
	
	Если Элементы[ИмяТЧ].ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'В справочнике ""Номенклатура"" будут созданы элементы с типом номенклатуры ""Биологические активы""
                         |для выделенных строк табличной части с пустыми значениями в графе ""Биологический актив"".
                         |Продолжить?'");
	
	ДопПараметры = Новый Структура("ИмяТЧ", ИмяТЧ);
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьМЗЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМЗЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Параметры.ИмяТЧ = "ОсновныеСредства" Тогда
			СоздатьМЗизОССервер();
		ИначеЕсли Параметры.ИмяТЧ = "Материалы" Тогда
			СоздатьМЗизМЗСервер();
		ИначеЕсли Параметры.ИмяТЧ = "Вложения" Тогда
			СоздатьМЗизВложенийСервер();
		ИначеЕсли Параметры.ИмяТЧ = "ВПути" Тогда
			СоздатьМЗизВПутиСервер();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьМЗизОССервер()
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("ОсновноеСредство"	, Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	Данные.Колонки.Добавить("ИнвентарныйНомер"	, Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	Данные.Колонки.Добавить("СчетУчета"			, Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ОсновныеСредства.ВыделенныеСтроки Цикл
		
		СтрокаТЧ = Объект.ОсновныеСредства.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.НоменклатураБА) Тогда
			
			СтрокаДанные					= Данные.Добавить();
			СтрокаДанные.ОсновноеСредство	= СтрокаТЧ.ОсновноеСредство;
			СтрокаДанные.ИнвентарныйНомер	= СтрокаТЧ.ИнвентарныйНомер;
			СтрокаДанные.СчетУчета			= СтрокаТЧ.СчетУчетаБА;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", Данные);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(Таблица.ОсновноеСредство КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(Таблица.ИнвентарныйНомер КАК Справочник.ИнвентарныеНомераОС) КАК ИнвентарныйНомер,
	|	ВЫРАЗИТЬ(Таблица.СчетУчета КАК ПланСчетов.ЕПСБУ) КАК СчетУчета
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ.ОсновноеСредство.Наименование КАК Наименование,
	|	ВТ.ОсновноеСредство.НаименованиеПолное КАК НаименованиеПолное,
	|	ВТ.ОсновноеСредство.ИзготовительОС КАК ИзготовительОС,
	|	ВТ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(ВТ.ИнвентарныйНомер), """") КАК КодИнвентарногоНомера,
	|	ВТ.СчетУчета КАК СчетУчета,
	|	ВТ.СчетУчета.Код КАК КодСчетаУчета
	|ИЗ
	|	ВТ КАК ВТ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЕдШт = Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйЭлемент					= Справочники.Номенклатура.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= Выборка.Наименование;
		НовыйЭлемент.НаименованиеПолное	= Выборка.НаименованиеПолное;
		НовыйЭлемент.СчетУчета			= Выборка.КодСчетаУчета;
		НовыйЭлемент.ИнвентарныйНомер	= Выборка.КодИнвентарногоНомера;
		НовыйЭлемент.ТипНоменклатуры	= Перечисления.ТипыНоменклатуры.БиологическиеАктивы;
		НовыйЭлемент.Родитель			= Объект.ГруппаБА;
		НовыйЭлемент.ЕдиницаИзмерения	= ЕдШт;
		НовыйЭлемент.ИзготовительОС		= Выборка.ИзготовительОС;
		
		НовыйЭлемент.Записать();
		
		Отбор = Новый Структура("ОсновноеСредство,ИнвентарныйНомер,СчетУчетаБА,НоменклатураБА",
			Выборка.ОсновноеСредство, Выборка.ИнвентарныйНомер, Выборка.СчетУчета, Справочники.Номенклатура.ПустаяСсылка());
		СтрокиТЧ = Объект.ОсновныеСредства.НайтиСтроки(Отбор);
		Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
			СтрокаТЧ.НоменклатураБА = НовыйЭлемент.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьМЗизМЗСервер()
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Номенклатура"	, Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Данные.Колонки.Добавить("СчетУчета"		, Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Материалы.ВыделенныеСтроки Цикл
		
		СтрокаТЧ = Объект.Материалы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.НоменклатураБА) Тогда
			
			СтрокаДанные				= Данные.Добавить();
			СтрокаДанные.Номенклатура	= СтрокаТЧ.Номенклатура;
			СтрокаДанные.СчетУчета		= СтрокаТЧ.СчетУчетаБА;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", Данные);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(Таблица.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(Таблица.СчетУчета КАК ПланСчетов.ЕПСБУ) КАК СчетУчета
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Номенклатура.Наименование КАК Наименование,
	|	ВТ.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	ВТ.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ.Номенклатура.ИзготовительОС КАК ИзготовительОС,
	|	ВТ.СчетУчета КАК СчетУчета,
	|	ВТ.СчетУчета.Код КАК КодСчетаУчета
	|ИЗ
	|	ВТ КАК ВТ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйЭлемент					= Справочники.Номенклатура.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= Выборка.Наименование;
		НовыйЭлемент.НаименованиеПолное	= Выборка.НаименованиеПолное;
		НовыйЭлемент.СчетУчета			= Выборка.КодСчетаУчета;
		НовыйЭлемент.ТипНоменклатуры	= Перечисления.ТипыНоменклатуры.БиологическиеАктивы;
		НовыйЭлемент.Родитель			= Объект.ГруппаБА;
		НовыйЭлемент.ЕдиницаИзмерения	= Выборка.ЕдиницаИзмерения;
		НовыйЭлемент.ИзготовительОС		= Выборка.ИзготовительОС;
		
		НовыйЭлемент.Записать();
		
		Отбор = Новый Структура("Номенклатура,СчетУчетаБА,НоменклатураБА", Выборка.Номенклатура, Выборка.СчетУчета,
			Справочники.Номенклатура.ПустаяСсылка());
		СтрокиТЧ = Объект.Материалы.НайтиСтроки(Отбор);
		Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
			СтрокаТЧ.НоменклатураБА = НовыйЭлемент.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьМЗизВложенийСервер()
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Вложение"	, Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства,СправочникСсылка.Номенклатура"));
	Данные.Колонки.Добавить("СчетУчета"	, Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Вложения.ВыделенныеСтроки Цикл
		
		СтрокаТЧ = Объект.Вложения.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.НоменклатураБА) Тогда
			
			СтрокаДанные			= Данные.Добавить();
			СтрокаДанные.Вложение	= СтрокаТЧ.Вложение;
			СтрокаДанные.СчетУчета	= СтрокаТЧ.СчетУчетаБА;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", Данные);
	Запрос.УстановитьПараметр("ЕдШт", Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА Таблица.Вложение ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ВЫРАЗИТЬ(Таблица.Вложение КАК Справочник.ОсновныеСредства)
	|		КОГДА Таблица.Вложение ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(Таблица.Вложение КАК Справочник.Номенклатура)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫРАЗИТЬ(Таблица.СчетУчета КАК ПланСчетов.ЕПСБУ) КАК СчетУчета
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Номенклатура.Наименование КАК Наименование,
	|	ВТ.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	ВТ.Номенклатура.ИзготовительОС КАК ИзготовительОС,
	|	ВЫБОР
	|		КОГДА ВТ.Номенклатура ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ВТ.Номенклатура КАК Справочник.Номенклатура).ЕдиницаИзмерения
	|		ИНАЧЕ &ЕдШт
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВТ.СчетУчета КАК СчетУчета
	|ИЗ
	|	ВТ КАК ВТ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйЭлемент					= Справочники.Номенклатура.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= Выборка.Наименование;
		НовыйЭлемент.НаименованиеПолное	= Выборка.НаименованиеПолное;
		НовыйЭлемент.СчетУчета			= "113.00";
		НовыйЭлемент.ТипНоменклатуры	= Перечисления.ТипыНоменклатуры.БиологическиеАктивы;
		НовыйЭлемент.Родитель			= Объект.ГруппаБА;
		НовыйЭлемент.ЕдиницаИзмерения	= Выборка.ЕдиницаИзмерения;
		НовыйЭлемент.ИзготовительОС		= Выборка.ИзготовительОС;
		
		НовыйЭлемент.Записать();
		
		Отбор = Новый Структура("Вложение,СчетУчетаБА,НоменклатураБА", Выборка.Номенклатура, Выборка.СчетУчета,
			Справочники.Номенклатура.ПустаяСсылка());
		СтрокиТЧ = Объект.Вложения.НайтиСтроки(Отбор);
		Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
			СтрокаТЧ.НоменклатураБА = НовыйЭлемент.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьМЗизВПутиСервер()
	
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("НФА"		, Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства,СправочникСсылка.Номенклатура"));
	Данные.Колонки.Добавить("СчетУчета"	, Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ВПути.ВыделенныеСтроки Цикл
		
		СтрокаТЧ = Объект.ВПути.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.НоменклатураБА) Тогда
			
			СтрокаДанные			= Данные.Добавить();
			СтрокаДанные.НФА		= СтрокаТЧ.НФА;
			СтрокаДанные.СчетУчета	= СтрокаТЧ.СчетУчетаБА;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Данные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", Данные);
	Запрос.УстановитьПараметр("ЕдШт", Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА Таблица.НФА ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ВЫРАЗИТЬ(Таблица.НФА КАК Справочник.ОсновныеСредства)
	|		КОГДА Таблица.НФА ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(Таблица.НФА КАК Справочник.Номенклатура)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫРАЗИТЬ(Таблица.СчетУчета КАК ПланСчетов.ЕПСБУ) КАК СчетУчета
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Номенклатура.Наименование КАК Наименование,
	|	ВТ.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	ВТ.Номенклатура.ИзготовительОС КАК ИзготовительОС,
	|	ВЫБОР
	|		КОГДА ВТ.Номенклатура ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ВТ.Номенклатура КАК Справочник.Номенклатура).ЕдиницаИзмерения
	|		ИНАЧЕ &ЕдШт
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВТ.СчетУчета КАК СчетУчета
	|ИЗ
	|	ВТ КАК ВТ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйЭлемент					= Справочники.Номенклатура.СоздатьЭлемент();
		НовыйЭлемент.Наименование		= Выборка.Наименование;
		НовыйЭлемент.НаименованиеПолное	= Выборка.НаименованиеПолное;
		НовыйЭлемент.СчетУчета			= "113.00";
		НовыйЭлемент.ТипНоменклатуры	= Перечисления.ТипыНоменклатуры.БиологическиеАктивы;
		НовыйЭлемент.Родитель			= Объект.ГруппаБА;
		НовыйЭлемент.ЕдиницаИзмерения	= Выборка.ЕдиницаИзмерения;
		НовыйЭлемент.ИзготовительОС		= Выборка.ИзготовительОС;
		
		НовыйЭлемент.Записать();
		
		Отбор = Новый Структура("НФА,СчетУчетаБА,НоменклатураБА", Выборка.Номенклатура, Выборка.СчетУчета,
			Справочники.Номенклатура.ПустаяСсылка());
		СтрокиТЧ = Объект.ВПути.НайтиСтроки(Отбор);
		Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
			СтрокаТЧ.НоменклатураБА = НовыйЭлемент.Ссылка;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ДополнитьСтруктуруПодбора()
	
	ПараметрыПодбора = Новый Структура;
	
	ПараметрыПодбора.Вставить("ПоказыватьОстатки"			, Истина);
	ПараметрыПодбора.Вставить("ПоказыватьСчетУчета"			, Истина);
	ПараметрыПодбора.Вставить("НеИспользоватьСубконтоЦМО"	, Истина);
	ПараметрыПодбора.Вставить("ИмяТаблицы"					, "Материалы");
	
	ТипыНоменклатуры = Новый СписокЗначений;
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ"));
	ПараметрыПодбора.Вставить("ТипыНоменклатуры", ТипыНоменклатуры);
	
	Если ЗначениеЗаполнено(Объект.ОтборИФО) Тогда
		ПараметрыПодбора.Вставить("ИФО", Объект.ОтборИФО);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОтборКФО) Тогда
		ПараметрыПодбора.Вставить("КФО", Объект.ОтборКФО);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
		ПараметрыПодбора.Вставить("Подразделение", Объект.ОтборПодразделение);
	КонецЕсли; 
	
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодбораНоменклатурыНаСервере(ВыбранноеЗначение)
	
	СписокПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	
	Для Каждого ЭлементПодбора Из СписокПодбора Цикл
		
		НоваяСтрока = Объект.Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементПодбора);
		НоваяСтрока.ЦенаБА  = НоваяСтрока.Цена;
		НоваяСтрока.СуммаБА = НоваяСтрока.Сумма;
		
		//Если ЗначениеЗаполнено(Объект.ОтборИФО) Тогда
		//	НоваяСтрока.ИФО = Объект.ОтборИФО;
		//КонецЕсли;
		//
		//Если ЗначениеЗаполнено(Объект.ОтборКФО) Тогда
		//	НоваяСтрока.КФО = Объект.ОтборКФО;
		//КонецЕсли;
		//
		//Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
		//	НоваяСтрока.Подразделение = Объект.ОтборПодразделение;
		//КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСчетБА(ИмяТЧ)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОграниченияСчета", "113.00");
	
	ДопПараметры = Новый Структура("ИмяТЧ", ИмяТЧ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСчетаБА", ЭтотОбъект, ДопПараметры);
	
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСчетаБА(Результат, Параметры) Экспорт
	
	Для Каждого ВыделеннаяСтрока Из Элементы[Параметры.ИмяТЧ].ВыделенныеСтроки Цикл
		СтрокаТЧ = Объект[Параметры.ИмяТЧ].НайтиПоИдентификатору(ВыделеннаяСтрока);
		СтрокаТЧ.СчетУчетаБА = Результат;
	КонецЦикла;
	
КонецПроцедуры

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)
	
	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтотОбъект.Элементы[ИмяЭлемента]);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
