#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает действующие настройки компенсации и ставки по ребенку на дату.
// 
// Параметры:
// 	Дата - Дата - дата получения данных
// 	Ребенок - СправочникСсылка.Дети - ребенок, по которму получает сведения
// Возвращаемое значение:
// 	ТаблицаЗначений - Описание:
// * НастройкаКомпенсации - СправочникСсылка.НастройкиРасчетовПоРодительскойПлате - настройка расчета
// * ПроцентКомпенсации - Число - процент компенсации
// * КФО - ПеречислениеСсылка.КВД - КФО
// * КПС - СправочникСсылка.КлассификационныеПризнакиСчетов - КПС
Функция ПараметрыНаДату(Дата, Ребенок) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НастройкаКомпенсации", Новый ОписаниеТипов("СправочникСсылка.НастройкиРасчетовПоРодительскойПлате"));
	Результат.Колонки.Добавить("ПроцентКомпенсации",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(3));
	Результат.Колонки.Добавить("КФО",                  Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	Результат.Колонки.Добавить("КПС",                  Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПараметрыКомпенсацииРодительскойПлатыПоДетям.НастройкаКомпенсации,
	|	ПараметрыКомпенсацииРодительскойПлатыПоДетям.Ставка,
	|	ЕСТЬNULL(ПараметрыОтраженияКомпенсацииРодительскойПлатыСрезПоследних.КПС,
	|		ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
	|	ЕСТЬNULL(ПараметрыОтраженияКомпенсацииРодительскойПлатыСрезПоследних.КФО,
	|		ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)) КАК КФО
	|ИЗ
	|	РегистрСведений.ПараметрыКомпенсацииРодительскойПлатыПоДетям КАК ПараметрыКомпенсацииРодительскойПлатыПоДетям
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыОтраженияКомпенсацииРодительскойПлаты.СрезПоследних(&Дата,) КАК
	|			ПараметрыОтраженияКомпенсацииРодительскойПлатыСрезПоследних
	|		ПО ПараметрыКомпенсацииРодительскойПлатыПоДетям.НастройкаКомпенсации = ПараметрыОтраженияКомпенсацииРодительскойПлатыСрезПоследних.НастройкаКомпенсации
	|ГДЕ
	|	ПараметрыКомпенсацииРодительскойПлатыПоДетям.ДатаНачала <= &Дата
	|	И (ПараметрыКомпенсацииРодительскойПлатыПоДетям.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|	ИЛИ ПараметрыКомпенсацииРодительскойПлатыПоДетям.ДатаОкончания >= &Дата)";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ребенок", Ребенок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), Выборка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецОбласти

#КонецЕсли