		 
#Область Константы

// Функция возвращает уникальный идентификатор с признаком изменения объекта из БМО.
//
// Возвращаемое значение :
//	УникальныйИдентификатор.
//
Функция ИзмененУИ() Экспорт
	
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000008");
	
КонецФункции

// Функция возвращает уникальный идентификатор с признаком получения объекта из БМО.
//
// Возвращаемое значение :
//	УникальныйИдентификатор.
//
Функция ПолученУИ() Экспорт
	
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000009");
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура-обработчик события "ПередЗаписью" справочников для механизма регистрации объектов на узлах.
//
// Параметры:
//  Источник - СправочникОбъект, ПланВидовХарактеристикОбъект, ПланСчетовОбъект - источник события.
//  Отказ - Булево - флаг отказа от выполнения обработчика.
//
Процедура ФИБОбменБГУПередЗаписью(Источник, Отказ) Экспорт
	Перем Флаг, Тип;

	Тип = ТипЗнч(Источник);
	Флаг = (Тип = Тип("ПланСчетовОбъект.ЕПСБУ"));
	Если (Флаг И СчетДляФО(Источник.Код)) Тогда
		Возврат;                                                                                                                  
	ИначеЕсли Источник.ОбменДанными.Загрузка Тогда
		Флаг = (Тип = Тип("СправочникОбъект.ГлавыПоБюджетнойКлассификации"));
		Флаг = Флаг Или (Тип = Тип("СправочникОбъект.ВидыДоходовКДБ"));
		Флаг = Флаг Или (Тип = Тип("СправочникОбъект.СтатьиКИФ"));
		Флаг = Флаг Или (Тип = Тип("СправочникОбъект.ЦелевыеСтатьиКРБ"));
		Флаг = Флаг Или (Тип = Тип("СправочникОбъект.ПрограммыЦелевыхСтатейКРБ"));
		Флаг = Флаг Или (Тип = Тип("СправочникОбъект.ВидыРасходовКРБ"));
		Если (Флаг И (Не ЗначениеЗаполнено(Источник.ОкончаниеДействия))) Тогда
			Если Источник.ДополнительныеСвойства.Свойство("ПолучениеЭлементаДанных") Тогда
				Источник.ДатаОкончанияДействия = ДатаГоризонта();
			ИначеЕсли (ТипЗнч(Источник.ОбменДанными.Отправитель) = Тип("ПланОбменаСсылка.ФИБОбменБГУ")) Тогда	
				Источник.ДатаОкончанияДействия = ДатаГоризонта();
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ФИБОбменБГУ", Источник, Отказ);

КонецПроцедуры

// Процедура-обработчик события "ПередЗаписью" регистров для механизма регистрации объектов на узлах.
//
// Параметры:
//  Источник       - НаборЗаписейРегистра - источник события.
//  Отказ          - Булево - флаг отказа от выполнения обработчика.
//  Замещение      - Булево - признак замещения существующего набора записей.
// 
Процедура ФИБОбменБГУПередЗаписьюРегистра(Источник, Отказ, Замещение) Экспорт
	Перем Флаг, Ссылка, УИ, Тип;

	Флаг = (ТипЗнч(Источник) = Тип("РегистрБухгалтерииНаборЗаписей.ЖурналПроводокЕПСБУ"));
	Если Флаг Тогда
		Ссылка = Регистратор(Источник);
		Тип = ТипЗнч(Ссылка);
		Флаг = (Тип = Тип("ДокументСсылка.ОперацияБух"));
		Флаг = Флаг Или (Тип = Тип("ДокументСсылка.БюджетныеДанные"));
		Флаг = Флаг Или (Тип = Тип("ДокументСсылка.КассовоеВыбытие"));
		Флаг = Флаг Или (Тип = Тип("ДокументСсылка.КассовоеПоступление"));
		Флаг = Флаг Или (Тип = Тип("ДокументСсылка.РасходноеРасписание"));
		Флаг = Флаг Или (Тип = Тип("ДокументСсылка.РегистрацияОбязательствИСведенийПоДоговорам"));
		Если Флаг Тогда
			УстановитьОтключениеБезопасногоРежима(Истина);
			УстановитьПривилегированныйРежим(Истина);
			УИ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ИДИсточника");
			Если ЭтоОбъектИзБМО(УИ) Тогда
				Возврат;
			КонецЕсли;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ФИБОбменБГУ",
																		Источник,
																		Отказ,
																		Замещение);

КонецПроцедуры

// Процедура-обработчик события "ПередЗаписью" документов для механизма регистрации объектов на узлах.
//
// Параметры:
//  Источник - ДокументОбъект - источник события.
//  Отказ - Булево - флаг отказа от выполнения обработчика.
//  РежимЗаписи - РежимЗаписиДокумента - режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - режим проведения документа.
//
Процедура ФИБОбменБГУПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Перем Флаг, Тип, фОБ;

	Тип = ТипЗнч(Источник);
	фОБ = (Тип = Тип("ДокументОбъект.ОперацияБух"));
	Флаг = фОБ Или (Тип = Тип("ДокументОбъект.БюджетныеДанные"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.КассовоеВыбытие"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.КассовоеПоступление"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.РасходноеРасписание"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.РегистрацияОбязательствИСведенийПоДоговорам"));
	Если (Флаг И (Не ЭтоОбъектИзБМО(Источник.ИДИсточника))) Тогда
		Возврат;
	ИначеЕсли (Флаг И (Не Источник.ОбменДанными.Загрузка)) Тогда
		Если (Не Источник.ДополнительныеСвойства.Свойство("ФИБОбменБГУ")) Тогда
			Если (Источник.ИДИсточника <> ПолученУИ()) Тогда
				Источник.ИДИсточника = ИзмененУИ();
			ИначеЕсли ((Не фОБ) Или ЕстьИзмененияОперацияБух(Источник)) Тогда
				Источник.ИДИсточника = ИзмененУИ();
			КонецЕсли;	
			Если (Не ОбъектУчаствовалВОбмене(Источник.Ссылка)) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Источник.Движения.ЖурналПроводокЕПСБУ.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	ИначеЕсли ((Тип = Тип("ПланСчетовОбъект.ЕПСБУ")) И СчетДляФО(Источник.Код)) Тогда
		Возврат;
	КонецЕсли;
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ФИБОбменБГУ",
																		 Источник,
																		 Отказ,
																		 РежимЗаписи,
																		 РежимПроведения);
	Если (Флаг И (Не Источник.ОбменДанными.Загрузка)) Тогда
		Источник.Движения.ЖурналПроводокЕПСБУ.ДополнительныеСвойства.Удалить("ОтключитьМеханизмРегистрацииОбъектов");
	КонецЕсли;

КонецПроцедуры

// Процедура-обработчик события "ПередУдалением" ссылочных типов данных для механизма регистрации объектов на узлах.
//
// Параметры:
//  Источник - СправочникОбъект, ДокументОбъект, ПланВидовХарактеристикОбъект, ПланСчетовОбъект - источник события.
//  Отказ - Булево - флаг отказа от выполнения обработчика.
//
Процедура ФИБОбменБГУПередУдалением(Источник, Отказ) Экспорт
	Перем Флаг;

	Тип = ТипЗнч(Источник);
	Флаг = (Тип = Тип("ДокументОбъект.ОперацияБух"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.БюджетныеДанные"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.КассовоеВыбытие"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.КассовоеПоступление"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.РасходноеРасписание"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.РегистрацияОбязательствИСведенийПоДоговорам"));
	Если (Флаг И (Не ЭтоОбъектИзБМО(Источник.ИДИсточника))) Тогда
		Возврат;
	ИначеЕсли Флаг Тогда
		Источник.Движения.ЖурналПроводокЕПСБУ.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		Источник.ИДИсточника = ИзмененУИ();
	ИначеЕсли ((Тип = Тип("ПланСчетовОбъект.ЕПСБУ")) И СчетДляФО(Источник.Код)) Тогда
		Возврат;
	КонецЕсли;
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ФИБОбменБГУ", Источник, Отказ);
	Если Флаг Тогда
		Источник.Движения.ЖурналПроводокЕПСБУ.ДополнительныеСвойства.Удалить("ОтключитьМеханизмРегистрацииОбъектов");
	КонецЕсли;

КонецПроцедуры

// Обработчик регистрации изменений для начальной выгрузки данных.
//
// Параметры:
// 	Получатель - ПланОбменаСсылка.ФИБОбменБГУ - узел плана обмена, в который требуется выгрузить данные.
//	СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки
//                                 события.
//	Отбор - Массив - регистрируемые объекты метаданных.
//
Процедура РегистрацияИзмененийНачальнойВыгрузкиДанных(Знач Получатель, СтандартнаяОбработка, Знач Отбор) Экспорт
	Перем Стр, Значения, Текст, Знч, МД, Элем, Таб;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	СтандартнаяОбработка = Истина;
	ФИББГУМенеджерОбменаПереопределяемый.РегистрацияИзмененийНачальнойВыгрузкиДанных(Получатель, СтандартнаяОбработка, Отбор);
	Если (Не СтандартнаяОбработка) Тогда
		Возврат;
	ИначеЕсли (ТипЗнч(Получатель) <> Тип("ПланОбменаСсылка.ФИБОбменБГУ")) Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	// Получаем настройки отбора данных.
	Стр = "РежимВыгрузкиБК,РежимВыгрузкиСправочников,РежимВыгрузкиСведений,РежимВыгрузкиСостояний";
	Стр = Стр + ",БылаВыполненаРегистрацияИзмененийНачальнойВыгрузкиДанных";
	Значения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Получатель, Стр);
	// Регистрация для выгрузки адреса хоста.
	Знч = (Значения.РежимВыгрузкиСостояний = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.РегистрыСведений.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		МД = РегистрыСведений.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ.СоздатьНаборЗаписей();
		МД.Отбор.Корреспондент.Установить(Получатель);
		ПланыОбмена.ЗарегистрироватьИзменения(Получатель, МД);
	КонецЕсли;
	// ДОПОЛНИТЕЛЬНАЯ КЛАССИФИКАЦИЯ.
	// Регистрация изменений элементов бюджета.
	Знч = (Значения.РежимВыгрузкиСправочников = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.ЭлементыБюджета;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.ЭлементыБюджета КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|УПОРЯДОЧИТЬ ПО Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// Регистрация изменений бюджетов.
	Знч = (Значения.РежимВыгрузкиСправочников = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.Бюджеты;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.Бюджеты КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|УПОРЯДОЧИТЬ ПО Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// Регистрация изменений КОСГУ.
	Знч = (Значения.РежимВыгрузкиСправочников = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.КОСГУ;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.КОСГУ КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|УПОРЯДОЧИТЬ ПО Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// Регистрация изменений видов целевых средств.
	Знч = (Значения.РежимВыгрузкиСправочников = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.ВидыЦелевыхСредств;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.ВидыЦелевыхСредств КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|УПОРЯДОЧИТЬ ПО Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// Регистрация изменений мероприятий.
	Знч = (Значения.РежимВыгрузкиСправочников = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.Мероприятия;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.Мероприятия КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|УПОРЯДОЧИТЬ ПО Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// БЮДЖЕТНАЯ КЛАССИФИКАЦИЯ.
	// Регистрация изменений глав по бюджетной классификации.
	Знч = (Значения.РежимВыгрузкиБК = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.ГлавыПоБюджетнойКлассификации;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.ГлавыПоБюджетнойКлассификации КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|  И (ДатаВремя(2016, 1, 1) < Спр.ДатаОкончанияДействия)
				|УПОРЯДОЧИТЬ ПО Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// ДОХОДЫ.
	// Регистрация изменений видов доходов КДБ.
	Знч = (Значения.РежимВыгрузкиБК = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.ВидыДоходовКДБ;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.ВидыДоходовКДБ КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|  И (ДатаВремя(2016, 1, 1) < Спр.ДатаОкончанияДействия)
				|УПОРЯДОЧИТЬ ПО Спр.Ссылка ИЕРАРХИЯ, Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// Регистрация изменений группы подвидов КДБ.
	Знч = (Значения.РежимВыгрузкиБК = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.ГруппыПодвидовКДБ;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.ГруппыПодвидовКДБ КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|УПОРЯДОЧИТЬ ПО Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// ИСТОЧНИКИ.
	// Регистрация изменений статей КИФ.
	Знч = (Значения.РежимВыгрузкиБК = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.СтатьиКИФ;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.СтатьиКИФ КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|  И (ДатаВремя(2016, 1, 1) < Спр.ДатаОкончанияДействия)
				|УПОРЯДОЧИТЬ ПО Спр.Ссылка ИЕРАРХИЯ, Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// Регистрация изменений видов КИФ.
	Знч = (Значения.РежимВыгрузкиБК = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.ВидыКИФ;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.ВидыКИФ КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|УПОРЯДОЧИТЬ ПО Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// РАСХОДЫ.
	// Регистрация изменений разделов, подразделов КРБ.
	Знч = (Значения.РежимВыгрузкиБК = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.РазделыПодразделыКРБ;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.РазделыПодразделыКРБ КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|УПОРЯДОЧИТЬ ПО Спр.Ссылка ИЕРАРХИЯ, Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// Регистрация изменений целевых статей КРБ.
	Знч = (Значения.РежимВыгрузкиБК = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.ЦелевыеСтатьиКРБ;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.ЦелевыеСтатьиКРБ КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|  И (ДатаВремя(2016, 1, 1) < Спр.ДатаОкончанияДействия)
				|УПОРЯДОЧИТЬ ПО Спр.Ссылка ИЕРАРХИЯ, Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// Регистрация изменений программ целевых статей КРБ.
	Знч = (Значения.РежимВыгрузкиБК = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.ПрограммыЦелевыхСтатейКРБ;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.ПрограммыЦелевыхСтатейКРБ КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|  И (ДатаВремя(2016, 1, 1) < Спр.ДатаОкончанияДействия)
				|УПОРЯДОЧИТЬ ПО Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// Регистрация изменений видов расходов КРБ.
	Знч = (Значения.РежимВыгрузкиБК = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.ВидыРасходовКРБ;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.ВидыРасходовКРБ КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|  И (ДатаВремя(2016, 1, 1) < Спр.ДатаОкончанияДействия)
				|УПОРЯДОЧИТЬ ПО Спр.Ссылка ИЕРАРХИЯ, Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// НАСТРОЙКИ УЧЕТА И ПРОВОДКИ.
	// Регистрация изменений в плане счетов.
	Знч = (Значения.РежимВыгрузкиСведений = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.ПланыСчетов.ЕПСБУ;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	ЕПСБУ.Ссылка КАК Ссылка,
		        |	ЕПСБУ.Код КАК Код
		        |ИЗ	ПланСчетов.ЕПСБУ КАК ЕПСБУ
				|ГДЕ (ЕПСБУ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
				|  И (НЕ ЕПСБУ.ПометкаУдаления)
				|  И (НЕ ЕПСБУ.ЭлементГруппа)
				|  И (НЕ ЕПСБУ.ЗапретитьИспользоватьВПроводках)
				|УПОРЯДОЧИТЬ ПО ЕПСБУ.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			Если (Не СчетДляФО(Стр.Код)) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Регистрация изменений в журналах.
	Знч = (Значения.РежимВыгрузкиСведений = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
	Если (Знч И (ТипЗнч(Отбор) = Тип("Массив"))) Тогда
		МД = Метаданные.Справочники.Журналы;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	КонецЕсли;
	Если Знч Тогда
		Текст = "ВЫБРАТЬ
		        |	Спр.Ссылка КАК Ссылка
		        |ИЗ	Справочник.Журналы КАК Спр
				|ГДЕ (НЕ Спр.ПометкаУдаления)
				|  И (НЕ Спр.ЭтоГруппа)
				|УПОРЯДОЧИТЬ ПО Спр.Код";
		Таб = ПолучитьДанные(Текст);
		Для Каждого Стр Из Таб Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Получатель, Стр.Ссылка);
		КонецЦикла;
	КонецЕсли;
	// Регистрация изменений в бухгалтерском регистре.
	Если (ТипЗнч(Отбор) = Тип("Массив")) Тогда
		МД = Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ;
		Знч = (Отбор.Найти(МД) <> Неопределено);
	Иначе
		Знч = Истина;
	КонецЕсли;
	Если Знч Тогда
		Таб = РегистрыСведений.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ.СоздатьНаборЗаписей();
		Таб.Отбор.Узел.Установить(Получатель);
		Таб.Записать(Истина);
	КонецЕсли;
	// Изменение признака для ручной перерегистрации данных.
	Если (Значения.БылаВыполненаРегистрацияИзмененийНачальнойВыгрузкиДанных = Истина) Тогда
		Возврат;
	ИначеЕсли (ТипЗнч(Отбор) = Тип("Массив")) Тогда
		Возврат;
	КонецЕсли;
	Элем = Получатель.ПолучитьОбъект();
	Если (Элем = Неопределено) Тогда
		Возврат;
	ИначеЕсли Элем.БылаВыполненаРегистрацияИзмененийНачальнойВыгрузкиДанных Тогда
		Возврат;
	КонецЕсли;
	Элем.БылаВыполненаРегистрацияИзмененийНачальнойВыгрузкиДанных = Истина;
	Элем.ОбменДанными.Загрузка = Истина;
	Элем.Записать();

КонецПроцедуры

#КонецОбласти

#Область ФункцииДляОпределенияРеальногоИзмененияДокументов

// Процедура удаляет колонку из таблицы значений.
//
// Параметры :
//	Таб - ТаблицаЗначений.
//	Имя - Строка - имя колонки.
//
Процедура УдалитьКолонку(Знач Таб, Знач Имя) 
	Перем Колонки;
	
	Колонки = Таб.Колонки;
	Если (Колонки.Найти(Имя) <> Неопределено) Тогда
		Колонки.Удалить(Имя);
	КонецЕсли;

КонецПроцедуры

// Процедура удаляет колонку из таблиц значений.
//
// Параметры :
//	Таб1 - ТаблицаЗначений.
//	Таб2 - ТаблицаЗначений.
//	Имя - Строка - имя колонки.
//
Процедура УдалитьКолонкуИзТаблиц(Знач Таб1, Знач Таб2, Знач Имя) 
	
	УдалитьКолонку(Таб1, Имя);
	УдалитьКолонку(Таб2, Имя);

КонецПроцедуры

// Функция проверяет есть ли изменения в операции.
//
// Параметры :
// 	Источник - ДокументОбъект.ОперацияБух - записываемый объект.
//
// Возвращаемое значение :
//	Булево.
//
Функция ЕстьИзмененияОперацияБух(Знач Источник)
	Перем иТаб, Таб, иЗапись, Запись, Знч, иЗнч, Сч, Колво;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ЭтоНовый() Тогда
		Возврат Истина;
	ИначеЕсли Источник.ОбменДанными.Загрузка Тогда
		Возврат Истина;
	ИначеЕсли Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат Истина;
	КонецЕсли;

	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ПометкаУдаления");
	Реквизиты.Вставить("Дата");
	Реквизиты.Вставить("Организация");
	Реквизиты.Вставить("ИФО");
	Реквизиты.Вставить("Основание");
	Реквизиты.Вставить("ИДИсточника");
	Реквизиты.Вставить("ВидМежотчетногоПериода");
	Реквизиты.Вставить("НомерИсточника");
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Ссылка, Реквизиты);
	Для Каждого Запись Из Реквизиты Цикл
		Знч = Запись.Значение;
		иЗнч = Источник[Запись.Ключ];
		Если (Знч <> иЗнч) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	иТаб = Источник.Движения.ЖурналПроводокЕПСБУ.Выгрузить();
	Запись = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СоздатьНаборЗаписей();
	Запись.Отбор.Регистратор.Установить(Источник.Ссылка);
	Запись.Прочитать();
	Таб = Запись.Выгрузить();
	Запись = Неопределено;
	Колво = Таб.Количество();
	Если (Колво <> иТаб.Количество()) Тогда
		Возврат Истина;
	КонецЕсли;
//	УдалитьКолонкуИзТаблиц(Таб, иТаб, "Активность");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "Регистратор");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "НомерСтроки");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "Период");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "УточнениеПериода");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "МоментВремени");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "Организация");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "ИФО");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "ВидМежотчетногоПериода");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "СуммаНеУчитываетсяНУ");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "СуммаЕНВД");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "СуммаНДС");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "ПодразделениеДт");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "ПодразделениеКт");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "КоличествоДт");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "КоличествоКт");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "ВидСубконтоДт1");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "ВидСубконтоКт1");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "ВидСубконтоДт2");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "ВидСубконтоКт2");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "ВидСубконтоДт3");
	УдалитьКолонкуИзТаблиц(Таб, иТаб, "ВидСубконтоКт3");
	Для Сч=0 По Колво-1 Цикл
		Запись = Таб[Сч];
		иЗапись = иТаб[Сч];
		Для Каждого Набор Из Таб.Колонки Цикл
			Знч = Запись[Набор.Имя];
			иЗнч = иЗапись[Набор.Имя];
			Если ((Знч <> иЗнч) И (ЗначениеЗаполнено(Знч) Или ЗначениеЗаполнено(иЗнч))) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает мдентификатор модуля.
// 
// Возвращаемое значение :
//  Строка. 
//
Функция Подключаемый_ИдентификаторМодуля() Экспорт
	
	Возврат "99159ab9-4982-492c-b8b3-d5b18c35f539";
			 
КонецФункции

// Функция определяет цель получения объекта ИБ по умолчанию.
//
// Возвращаемое значение :
//	Строка.
//
Функция ДействиеПоУмолчанию()
	
	Возврат "ПолучитьСсылку";
	
КонецФункции

// Функция определяет создан ли объект при обмене с БМО.
// 
// Параметры :
//	УИ - УникальныйИдентификатор.
//
// Возвращаемое значение :
//	Булево.
//
Функция ЭтоОбъектИзБМО(Знач УИ)

	Если (УИ = ПолученУИ()) Тогда
		Возврат Истина;
	ИначеЕсли (УИ = ИзмененУИ()) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

// Функция возвращает регистратора из отбора набора записей.
//
// Параметры :
//	Набор - набор записей.
//
// Возвращаемое значение :
//	Неопределено, ДокументСсылка.
// 
Функция Регистратор(Знач Набор)
	Перем Элем, Имя;

	Имя = ВРег("Регистратор");
	Для Каждого Элем Из Набор.Отбор Цикл
		Если (Не Элем.Использование) Тогда
			Продолжить;
		ИначеЕсли (ВРег(Элем.Имя) <> Имя) Тогда
			Продолжить;
		Иначе
			Возврат Элем.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;

КонецФункции

// Функция для получения данных без ограничений по RLS.
//
// Параметры :
//  Текст - Строка - текст запросы.
//  Параметры - Структура - параметры запроса.
//
// Возвращаемое значение :
//  ТаблицаЗначений.
//
Функция ПолучитьДанные(Знач Текст, Знач Параметры = Неопределено) Экспорт
	Перем Запрос, Элем, Результат;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(Текст);
	Если (Параметры <> Неопределено) Тогда
		Для Каждого Элем Из Параметры Цикл
			Запрос.УстановитьПараметр(Элем.Ключ, Элем.Значение);
		КонецЦикла;
	КонецЕсли;	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
КонецФункции

// Функция возвращает минимальную дату.
// 
// Возвращаемое значение :
//  Дата. 
//
Функция ДатаНачала() Экспорт
	
	Возврат '20160101';
	
КонецФункции	

// Функция возвращает максимальную дату.
// 
// Возвращаемое значение :
//  Дата. 
//
Функция ДатаГоризонта() Экспорт
	
	Возврат '29990101';

КонецФункции	

// Функция определяет используется ли счет в учете финансовым органом.
//
// Параметры :
//	Код - Строка - код счета.
//
// Возвращаемое значение :
//	Булево.
//
Функция СчетДляФО(Знач Код)
	Перем Знч, Номер;
	
	Номер = СокрЛП(Код);
	// Служебные и забалансовые счета ФО. 
	Если (Номер = "19") Тогда
		Возврат Истина;
	ИначеЕсли (Номер = "00") Тогда
		Возврат Истина;
	ИначеЕсли (Номер = "000") Тогда
		Возврат Истина;
	ИначеЕсли (Номер = "000.00") Тогда
		Возврат Истина;
	КонецЕсли;
	// Счета ФО. 
	Знч = Лев(Номер, 4);
	Если (Знч = "202.") Тогда
		Возврат Истина;
	ИначеЕсли (Знч = "203.") Тогда
		Возврат Истина;
	ИначеЕсли (Знч = "211.") Тогда
		Возврат Истина;
	ИначеЕсли (Знч = "212.") Тогда
		Возврат Истина;
	ИначеЕсли (Знч = "306.") Тогда
		Возврат Истина;
	ИначеЕсли (Знч = "307.") Тогда
		Возврат Истина;
	ИначеЕсли (Знч = "308.") Тогда
		Возврат Истина;
	ИначеЕсли (Знч = "309.") Тогда
		Возврат Истина;
	ИначеЕсли (Знч = "402.") Тогда
		Возврат Истина;
	ИначеЕсли (Знч = "501.") Тогда
		Возврат (Сред(Номер, 6, 1) = "9");
	ИначеЕсли (Знч = "503.") Тогда
		Возврат (Сред(Номер, 6, 1) = "9");
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

// Функция возвращает значение ключевого реквизита.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	Имя - Строка - имя реквизита.
//
// Возвращаемое значение :
//	Произвольный.
//
Функция КлючевойРеквизит(Знач ДанныеXDTO, Знач Имя)
	Перем КС, Рез;
	
	Если (Не ДанныеXDTO.Свойство("КлючевыеСвойства", КС)) Тогда
		КС = ДанныеXDTO;
	ИначеЕсли (ТипЗнч(КС) <> Тип("Структура")) Тогда
		КС = ДанныеXDTO;
	КонецЕсли;	
	Если КС.Свойство(Имя, Рез) Тогда
		Возврат Рез;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция возвращает ключевые свойства данных выгрузки.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//
// Возвращаемое значение :
//	Структура.
//
Функция КлючевыеСвойства(Знач ДанныеXDTO)
	Перем КС;
	
	Если (Не ДанныеXDTO.Свойство("КлючевыеСвойства", КС)) Тогда
		КС = Новый Структура;
		ДанныеXDTO.Вставить("КлючевыеСвойства", КС);
	КонецЕсли;
	Возврат КС;
	
КонецФункции	

// Функция возвращает строку с внешним идентификатором объекта.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//
// Возвращаемое значение :
//	Строка.
//
Функция ИдентификаторXDTO(Знач ДанныеXDTO)
	Перем Ссылка, Рез;
	
	Ссылка = КлючевойРеквизит(ДанныеXDTO, "Ссылка");
	Если (ТипЗнч(Ссылка) <> Тип("Структура")) Тогда
		Возврат "";
	ИначеЕсли (Не Ссылка.Свойство("Значение", Рез)) Тогда
		Возврат "";
	Иначе
		Возврат СокрЛП(Рез);
	КонецЕсли;
	
КонецФункции	

// Функция определяет, что объект участвовал в обмене с узлом.
//
// Параметры :
//	Ссылка - ДокументСсылка, ПланВидовХарактеристикСсылка, СправочникСсылка.
//	Узел - ПланОбменаСсылка.
//
// Возвращаемое значение :
//	Булево.
// 
Функция ОбъектУчаствовалВОбмене(Знач Ссылка, Знач Узел = Неопределено)
	Перем Текст, Отбор, Таб;
	
	Если (Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Ссылка))) Тогда
		Возврат Ложь;
	ИначеЕсли Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", Ссылка);
	Текст = Новый Массив;
	Текст.Добавить("ВЫБРАТЬ ПЕРВЫЕ 1");
	Текст.Добавить("Рег.Ссылка КАК Ссылка");
	Текст.Добавить("ИЗ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК Рег");
	Текст.Добавить("ГДЕ (Рег.Ссылка = &Ссылка)");
	Если (Узел <> Неопределено) Тогда
		Отбор.Вставить("Узел", Узел);
		Текст.Добавить("И (Рег.УзелИнформационнойБазы = &Узел)");
	КонецЕсли;
	Таб = ПолучитьДанные(СтрСоединить(Текст, Символы.ПС), Отбор);
	Возврат (Таб.Количество() > 0);

КонецФункции

// Функция определяет, что объект участвовал в обмене с узлом и был выгружен из текущей базы данных.
//
// Параметры :
//	Ссылка - ДокументСсылка, ПланВидовХарактеристикСсылка, СправочникСсылка.
//	Узел - ПланОбменаСсылка.
//
// Возвращаемое значение :
//	Булево.
// 
Функция ОбъектИзЭтойБазыДанных(Знач Ссылка, Знач Узел)
	Перем Стр;
	
	Стр = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныйИдентификаторПоСсылкеОбъекта(Узел, Ссылка, "");
	Возврат (СокрЛП(Ссылка.УникальныйИдентификатор()) = Стр);
	
КонецФункции

// Функция возвращает ссылку пл идентификатору.
//
// Параметры :
//	Идентификатор - Строка - идентификатор объекта конфигурации.
//	Вид - Строка - вид объекта конфигурации.
//	УзелИнформационнойБазы - ПланОбменаСсылка.ФИБОбменБГУ - узел плана обмена.
//
// Возвращаемое значение :
//	Сссылка на объект или неопределено.
// 
Функция СсылкаПоИдентификатору(Знач Идентификатор, Знач Вид, Знач УзелИнформационнойБазы)
	Перем Текст, Отбор, Таб;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Идентификатор", Идентификатор);
	Отбор.Вставить("Узел", УзелИнформационнойБазы);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Рег.Ссылка КАК Ссылка
			|ИЗ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК Рег
			|ГДЕ (Рег.УзелИнформационнойБазы = &Узел)
			|  И (Рег.Идентификатор = &Идентификатор)
			|  И (Рег.Ссылка ССЫЛКА " + Вид + ")";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() = 0) Тогда
		Возврат Неопределено;
	Иначе	
		Возврат Таб[0].Ссылка;
	КонецЕсли;

КонецФункции

// Процедура добавляет идентификатор объекта в публичные идентификаторы.
//
// Параметры :
//	Ссылка - ДокументСсылка, ПланВидовХарактеристикСсылка, СправочникСсылка.
//	Узел - ПланОбменаСсылка.ФИБОбменБГУ.
//	Идентификатор - Строка.
//
Процедура ДобавитьИдентификаторXDTO(Знач Ссылка, Знач Узел, Знач Идентификатор)
	Перем Набор, Отбор, Запись;
	
	Если (Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Ссылка))) Тогда
		Возврат;
	ИначеЕсли Ссылка.Пустая() Тогда
		Возврат;
	ИначеЕсли (ТипЗнч(Узел) <> Тип("ПланОбменаСсылка.ФИБОбменБГУ")) Тогда
		Возврат;
	ИначеЕсли Узел.Пустая() Тогда
		Возврат;
	ИначеЕсли ПустаяСтрока(Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	Набор = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СоздатьНаборЗаписей();
	Отбор = Набор.Отбор;
	Отбор.Идентификатор.Установить(Идентификатор);
	Отбор.Ссылка.Установить(Ссылка);
	Отбор.УзелИнформационнойБазы.Установить(Узел);
	Запись = Набор.Добавить();
	Запись.Идентификатор = Идентификатор;
	Запись.Ссылка = Ссылка;
	Запись.УзелИнформационнойБазы = Узел;
	Набор.Записать(Истина);

КонецПроцедуры

// Процедура при необходимости регистрирует загруженный документ.
//
// Параметры :
//	Объект - ДокументОбъект - загруженный документ.
//	Узел - ПланОбменаСсылка.ФИБОбменБГУ - узел плана обмена.
//
Процедура ЗарегистрироватьОбъект(Знач Объект, Знач Узел)
	
	Если ((ТипЗнч(Узел) = Тип("ПланОбменаСсылка.ФИБОбменБГУ")) И (Не Узел.Пустая())) Тогда
		Если ЭтоОбъектИзБМО(Объект.ИДИсточника) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура удаляет регистрацию выгружаемых данных из узла плана обмена.
//
// Параметры :
//	Данные - выгружаемые данные.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура УдалитьРегистрацию(Знач Данные, Знач КомпонентыОбмена)
	Перем Узел;
	
	Узел = КомпонентыОбмена.УзелКорреспондента;
	Если ((ТипЗнч(Узел) = Тип("ПланОбменаСсылка.ФИБОбменБГУ")) И (Не Узел.Пустая())) Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Данные);
	КонецЕсли;	

КонецПроцедуры

// Регистрация за период изменений в бухгалтерском регистре.
//
// Параметры :
// 	Узел - ПланОбменаСсылка.ФИБОбменБГУ - узел плана обмена, в который требуется выгрузить данные.
//  Начало - Дата - начало периода регистрации.
//  Конец - Дата, Неопределено - конец периода регистрации (все до этой даты, т.е. <, если не заполнено,
//								 то без ограничений сверху).
//	Организации - Массив - ограничение по организациям.
//  Счета - Массив, Неопределено - ограничение по счетам. 
//  ВыгружатьДанныеПоЗабалансовымСчетам - Булево - выгружать данные по забалансовым счетам.
//
Процедура РегистрацияИзмененийВБухгалтерскомРегистре(Знач Узел,
													 Знач Начало,
													 Знач Конец,
													 Знач Организации,
													 Знач Счета,
													 Знач ВыгружатьДанныеПоЗабалансовымСчетам)
	Перем Отбор, Текст, Таб, Запись, Набор, Элем, СтандартнаяОбработка;	
	
	СтандартнаяОбработка = Истина;
	ФИББГУМенеджерОбменаПереопределяемый.РегистрацияИзмененийВБухгалтерскомРегистре(Узел,
																					Начало,
																					Конец,
																					Организации,
																					Счета,
																					ВыгружатьДанныеПоЗабалансовымСчетам,
																					СтандартнаяОбработка);
	Если (Не СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;																					
	Отбор = Новый Структура;
	Отбор.Вставить("Организации", Организации);
	Отбор.Вставить("Начало", НачалоДня(Начало));
	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ЕПСБУ.Регистратор КАК Ссылка,
			|	Док.ИДИсточника КАК ИДИсточника
	        |ИЗ	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЕПСБУ
			|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацияБух КАК Док
			|ПО (Док.Ссылка = ЕПСБУ.Регистратор)
			|ГДЕ (ЕПСБУ.Активность И (ЕПСБУ.Организация В (&Организации)))
			|  И (&Начало <= ЕПСБУ.Период)";
	// Ограничение по дате.
	Если ЗначениеЗаполнено(Конец) Тогда
		Текст = Текст + " И (ЕПСБУ.Период < &Конец)";
		Отбор.Вставить("Конец", НачалоДня(Конец));
	КонецЕсли;
	// Ограничение по счетам.
	Если (Счета <> Неопределено) Тогда
		Текст = Текст + " И ((ЕПСБУ.СчетДт В (&Счета)) ИЛИ (ЕПСБУ.СчетКт В (&Счета)))";
		Отбор.Вставить("Счета", Счета);
	КонецЕсли;
	Если (ВыгружатьДанныеПоЗабалансовымСчетам <> Истина) Тогда
		Текст = Текст + " И ((НЕ ЕПСБУ.СчетДт.Забалансовый) ИЛИ (НЕ ЕПСБУ.СчетКт.Забалансовый))";
	КонецЕсли;
	Таб = ПолучитьДанные(Текст, Отбор);
	Набор = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СоздатьНаборЗаписей();
	Элем = Набор.Отбор.Регистратор;
	Для Каждого Запись Из Таб Цикл
		Если (Не ЭтоОбъектИзБМО(Запись.ИДИсточника)) Тогда
			Элем.Установить(Запись.Ссылка);
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Набор);
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

// Функция определяет была ли начата регистрация данных бухгалтерского регистра для узла плана обмена.
//
// Параметры :
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
// Возвращаемое значение :
//	Булево.
//
Функция РегистрацияНачата(Знач КомпонентыОбмена) 
	Перем Узел;

	Узел = КомпонентыОбмена.УзелКорреспондента;
	Если ((ТипЗнч(Узел) = Тип("ПланОбменаСсылка.ФИБОбменБГУ")) И (Не Узел.Пустая())) Тогда
		Возврат ФИББГУМенеджерОбменаПовтИсп.РегистрацияНачата(Узел);
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции	
	
#КонецОбласти

// Служебные процедуры и функции для заполнения данных при загрузке.
#Область СлужебныеПроцедурыИФункцииЗаполненияДанныхЗагрузки

// Процедура выполняет добавление текста к комментарию объекта.
// 
// Параметры :
//	Объект - ДокументОбъект.ОперацияБух - объект информационной базы.
//	Текст - Строка - текст для добавления к комментарию.
//
Процедура ДобавитьКомментарий(Знач Объект, Знач Текст)

	Если ПустаяСтрока(Объект.Комментарий) Тогда
		Объект.Комментарий = Текст;
	Иначе
		Объект.Комментарий = Объект.Комментарий + "; " + Текст;
	КонецЕсли;

КонецПроцедуры

// Функция проверяет что текста нет в комментарии.
// 
// Параметры :
//	Объект - ДокументОбъект.ОперацияБух - объект информационной базы.
//	Текст - Строка - искомый текст.
//
// Возвращаемое значение :
//	Булево.
//
Функция НетТекстаВКомментарии(Знач Объект, Знач Текст)

	Если ПустаяСтрока(Текст) Тогда
		Возврат Ложь;
	Иначе
		Возврат (СтрНайти(Объект.Комментарий, Текст) = 0);
	КонецЕсли;

КонецФункции

// Функция возвращает начало строки для сообщения о проблемах в проводке.
//
// Параметры :
//	Номер - Число - номер строки.
//	Начало - Булево - начало строки уже сформировано.
//
// Возвращаемое значение :
//	Строка.
//
Функция ТекстСНомеромСтроки(Знач Номер, Начало)

	Если Начало Тогда
		Возврат "";
	КонецЕсли;
	Начало = Истина;
	Возврат СтрШаблон(НСтр("ru = 'В строке %1:'"), Формат(Номер, "ЧДЦ=0; ЧГ="));

КонецФункции

// Функция возвращает КФО по коду.
//
// Параметры :
//	Код - Строка - код вида финансового обеспечения.
//
// Возвращаемое значение :
//	ПеречислениеСсылка.КВД.
//
Функция КФО(Знач Код)
	Перем Элем;
	
	Если ПустаяСтрока(Код) Тогда
		Возврат Перечисления.КВД.ПустаяСсылка();
	КонецЕсли;
	Для Каждого Элем Из Перечисления.КВД Цикл
		Если (СокрЛП(Элем) = Код) Тогда
			Возврат Элем;
		КонецЕсли;
	КонецЦикла;
	Возврат Перечисления.КВД.ПустаяСсылка();

КонецФункции

// Процедура устанавливает минимальную возможную дату начала действия для объекта.
//
// Параметры :
//	Объект - СправочникОбъект.
//	ДопОтбор - Неопределено, Структура - значения дополнительного отбора.
// 
Процедура УстановитьМинимальнуюДатуНачалаДействия(Знач Объект, Знач ДопОтбор = Неопределено)
	Перем МД, Текст, Отбор, Таб, Дата, Элем;
	
	МД = Объект.Метаданные();
	Отбор = Новый Структура;
	Отбор.Вставить("Код", Объект.Код);
	Отбор.Вставить("Дата", НачалоДня(Объект.ДатаНачалаДействия));
	Текст = Новый Массив;
	Текст.Добавить("ВЫБРАТЬ");
	Текст.Добавить("МАКСИМУМ(Спр.ДатаОкончанияДействия) КАК ДатаНачалаДействия");
	Текст.Добавить("ИЗ Справочник." + МД.Имя + " КАК Спр");
	Текст.Добавить("ГДЕ (Спр.Код = &Код) И (Спр.ДатаОкончанияДействия < &Дата)");
	Если (Не Объект.Ссылка.Пустая()) Тогда
		Текст.Добавить("И (Спр.Ссылка <> &Ссылка)");
		Отбор.Вставить("Ссылка", Объект.Ссылка);
	КонецЕсли;	
	Если (МД.Реквизиты.Найти("Бюджет") <> Неопределено) Тогда
		Текст.Добавить("И (Спр.Бюджет = &Бюджет)");
		Отбор.Вставить("Бюджет", Объект.Бюджет);
	КонецЕсли;
	Если (ДопОтбор <> Неопределено) Тогда
		Для Каждого Элем Из ДопОтбор Цикл
			Текст.Добавить("И (Спр." + Элем.Ключ + " = &" + Элем.Ключ + ")");
			Отбор.Вставить(Элем.Ключ, Элем.Значение);
		КонецЦикла;
	КонецЕсли;
	Таб = ПолучитьДанные(СтрСоединить(Текст, Символы.ПС), Отбор);
	Если (Таб.Количество() = 0) Тогда
		Объект.ДатаНачалаДействия = ДатаНачала();
		Возврат;
	КонецЕсли;
	Дата = Таб[0].ДатаНачалаДействия;
	Если ((ТипЗнч(Дата) = Тип("Дата")) И ЗначениеЗаполнено(Дата)) Тогда
		Объект.ДатаНачалаДействия = Мин(Объект.ДатаНачалаДействия, КонецДня(Дата) + 1);
		Объект.ДатаНачалаДействия = Макс(ДатаНачала(), Объект.ДатаНачалаДействия);
	Иначе
		Объект.ДатаНачалаДействия = ДатаНачала();
	КонецЕсли;

КонецПроцедуры

// Процедура устанавливает максимальную возможную дату окончания действия для объекта.
//
// Параметры :
//	Объект - СправочникОбъект.
//	ДопОтбор - Неопределено, Структура - значения дополнительного отбора.
//
Процедура УстановитьМаксимальнуюДатуОкончанияДействия(Знач Объект, Знач ДопОтбор = Неопределено)
	Перем МД, Текст, Отбор, Таб, Дата, Элем;
	
	МД = Объект.Метаданные();
	Отбор = Новый Структура;
	Отбор.Вставить("Код", Объект.Код);
	Отбор.Вставить("Дата", КонецДня(Объект.ДатаОкончанияДействия));
	Текст = Новый Массив;
	Текст.Добавить("ВЫБРАТЬ");
	Текст.Добавить("МИНИМУМ(Спр.ДатаНачалаДействия) КАК ДатаОкончанияДействия");
	Текст.Добавить("ИЗ Справочник." + МД.Имя + " КАК Спр");
	Текст.Добавить("ГДЕ (Спр.Код = &Код) И (&Дата < Спр.ДатаНачалаДействия)");
	Если (Не Объект.Ссылка.Пустая()) Тогда
		Текст.Добавить("И (Спр.Ссылка <> &Ссылка)");
		Отбор.Вставить("Ссылка", Объект.Ссылка);
	КонецЕсли;
	Если (МД.Реквизиты.Найти("Бюджет") <> Неопределено) Тогда
		Текст.Добавить("И (Спр.Бюджет = &Бюджет)");
		Отбор.Вставить("Бюджет", Объект.Бюджет);
	КонецЕсли;
	Если (ДопОтбор <> Неопределено) Тогда
		Для Каждого Элем Из ДопОтбор Цикл
			Текст.Добавить("И (Спр." + Элем.Ключ + " = &" + Элем.Ключ + ")");
			Отбор.Вставить(Элем.Ключ, Элем.Значение);
		КонецЦикла;
	КонецЕсли;
	Таб = ПолучитьДанные(СтрСоединить(Текст, Символы.ПС), Отбор);
	Если (Таб.Количество() = 0) Тогда
		Объект.ДатаОкончанияДействия = ДатаГоризонта();
		Объект.ОкончаниеДействия = Неопределено;
		Возврат;
	КонецЕсли;
	Дата = Таб[0].ДатаОкончанияДействия;
	Если ((ТипЗнч(Дата) = Тип("Дата")) И ЗначениеЗаполнено(Дата)) Тогда
		Объект.ДатаОкончанияДействия = Макс(Объект.ДатаОкончанияДействия, НачалоДня(НачалоДня(Дата) - 1));
		Объект.ОкончаниеДействия = Объект.ДатаОкончанияДействия;
	Иначе
		Объект.ДатаОкончанияДействия = ДатаГоризонта();
		Объект.ОкончаниеДействия = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Функция находит раздел,подраздел по коду.
//
// Параметры :
//	Код - Строка - код раздела,подраздела.
//
// Возвращаемое значение :
//	СправочникСсылка.РазделыПодразделыКРБ.
//
Функция РазделПодраздел(Знач Код)
	
	Если (ТипЗнч(Код) <> Тип("Строка")) Тогда
		Возврат Справочники.РазделыПодразделыКРБ.ПустаяСсылка();
	ИначеЕсли ПустаяСтрока(Код) Тогда
		Возврат Справочники.РазделыПодразделыКРБ.ПустаяСсылка();
	ИначеЕсли (Лев(Код, 4) = "0000") Тогда
		Возврат Справочники.РазделыПодразделыКРБ.ПустаяСсылка();
	Иначе
		Возврат ФИББГУМенеджерОбменаПовтИсп.РазделПодраздел(Лев(Код, 4));
	КонецЕсли;

КонецФункции

// Функция находит группу КИФ по коду.
//
// Параметры :
//	Код - Строка - код КИФ.
//
// Возвращаемое значение :
//	СправочникСсылка.ГруппыПодгруппыКИФ.
//
Функция ГруппаКИФ(Знач Код)

	Если (ТипЗнч(Код) <> Тип("Строка")) Тогда
		Возврат Справочники.ГруппыПодгруппыКИФ.ПустаяСсылка();
	ИначеЕсли ПустаяСтрока(Код) Тогда
		Возврат Справочники.ГруппыПодгруппыКИФ.ПустаяСсылка();
	Иначе
		Возврат ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ(Лев(Код, 4));
	КонецЕсли;

КонецФункции

// Функция находит аналитический код КПС по коду.
//
// Параметры :
//	Код - Строка - аналитический код КПС.
//
// Возвращаемое значение :
//	СправочникСсылка.АналитическиеКодыКПС.
//
Функция АналитическийКодКПС(Знач Код)
	Перем Текст, Таб, Отбор;
	
	Если (ТипЗнч(Код) <> Тип("Строка")) Тогда
		Возврат Справочники.АналитическиеКодыКПС.ПустаяСсылка();
	ИначеЕсли ПустаяСтрока(Код) Тогда
		Возврат Справочники.АналитическиеКодыКПС.ПустаяСсылка();
	ИначеЕсли (Лев(Код, 10) = "0000000000") Тогда
		Возврат Справочники.АналитическиеКодыКПС.ПустаяСсылка();
	Иначе	
		Возврат ФИББГУМенеджерОбменаПовтИсп.АналитическийКодКПС(Лев(Код, 10));
	КонецЕсли;

КонецФункции

// Функция определяет вид КБК по коду типа.
//
// Параметры :
//	Тип - Строка - код типа БК.
//
// Возвращаемое значение :
//	ПеречислениеСсылка.ВидыКБК.
//
Функция ВидКБК(Знач Тип)
	
	Если (Тип = "10") Тогда
		Возврат Перечисления.ВидыКБК.КРБ;
	ИначеЕсли (Тип = "20") Тогда
		Возврат Перечисления.ВидыКБК.КДБ;
	ИначеЕсли (Тип = "31") Тогда
		Возврат Перечисления.ВидыКБК.КИФ;
	ИначеЕсли (Тип = "32") Тогда
		Возврат Перечисления.ВидыКБК.КИФ;
	Иначе	
		Возврат Перечисления.ВидыКБК.ПустаяСсылка();
	КонецЕсли;

КонецФункции

// Функция находит КПС по реквизитам из файла.
//
// Параметры :
//	рКПС - Структура - реквизиты КБК.
//	НаДату - Дата - дата действия КПС.
//	КФО - ПеречислениеСсылка.КВД - код вида финансового обеспечения.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
// Возвращаемое значение :
//	СправочникСсылка.КлассификационныеПризнакиСчетов, Строка.
//
Функция НайтиКПС(Знач рКПС, Знач НаДату, Знач КФО, Знач КомпонентыОбмена)
	Перем Тип, Текст, Отбор, ВидКБК, Таб, КПС;
	Перем ПКО, Действие, Знч, Флаг, Объект;
	
	Если (рКПС = Неопределено) Тогда
		Возврат Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка();
	ИначеЕсли (Не рКПС.Свойство("Код", КПС)) Тогда
		Возврат Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка();
	ИначеЕсли ПустаяСтрока(КПС) Тогда
		Возврат Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка();
	ИначеЕсли (СтрДлина(КПС) <> 17) Тогда
		Возврат СтрШаблон(НСтр("ru = 'Длина кода КПС ""%1"" должна быть равна 17 символам'"), КПС);
	ИначеЕсли (Не рКПС.Свойство("Тип", Тип)) Тогда
		Тип = "";
	КонецЕсли;
	УстановитьОтключениеБезопасногоРежима(Истина);
	Отбор = Новый Структура;
	Отбор.Вставить("Код", КПС);
	Отбор.Вставить("НаДату", НаДату);
	Текст = Новый Массив;
	Текст.Добавить("ВЫБРАТЬ ПЕРВЫЕ 1");
	Текст.Добавить("Спр.Ссылка КАК Ссылка");
	Текст.Добавить("ИЗ Справочник.КлассификационныеПризнакиСчетов КАК Спр");
	Текст.Добавить("ГДЕ (Спр.Код = &Код)");
	Текст.Добавить("И (НЕ Спр.ЭтоГруппа)");
	Текст.Добавить("И (Спр.ДатаНачалаДействия <= &НаДату)");
	Текст.Добавить("И (&НаДату <= Спр.ДатаОкончанияДействия)");
	ВидКБК = ВидКБК(Тип);
	Если (КФО = Перечисления.КВД.Бюджет) Тогда
		Если ВидКБК.Пустая() Тогда
			Отбор.Вставить("ВидыКБК", Новый Массив);
			Отбор.ВидыКБК.Добавить(Перечисления.ВидыКБК.КРБ);
			Отбор.ВидыКБК.Добавить(Перечисления.ВидыКБК.КДБ);
			Отбор.ВидыКБК.Добавить(Перечисления.ВидыКБК.КИФ);
			Текст.Добавить("И (Спр.ВидПоказателя В (&ВидыКБК))");
		Иначе
			Отбор.Вставить("ВидКБК", ВидКБК);
			Текст.Добавить("И (Спр.ВидПоказателя = &ВидКБК)");
		КонецЕсли;
	ИначеЕсли (Не ВидКБК.Пустая()) Тогда
		Отбор.Вставить("ВидКБК", ВидКБК);
		Текст.Добавить("И ((Спр.ВидПоказателя = &ВидКБК) ИЛИ (Спр.УточнениеПоказателя = &ВидКБК))");
	КонецЕсли;
	Текст.Добавить("УПОРЯДОЧИТЬ ПО Спр.ПометкаУдаления, Спр.ВидПоказателя, Спр.УточнениеПоказателя");
	Таб = ПолучитьДанные(СтрСоединить(Текст, Символы.ПС), Отбор);
	Если (Таб.Количество() > 0) Тогда
		Возврат Таб[0].Ссылка;
	КонецЕсли;
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	// Если не определен тип КБК, то возвращаем ошибку.	
	Флаг = КФО.Пустая();
	Флаг = Флаг Или (НаДату < ДатаНачала());
	Флаг = Флаг Или ((КФО = Перечисления.КВД.Бюджет) И ВидКБК.Пустая());
	Если Флаг Тогда
		Возврат СтрШаблон(НСтр("ru = 'По коду ""%1"" не найден КПС'"), КПС);
	КонецЕсли;
	Действие = ДействиеПоУмолчанию();
	// Создание нового КПС.
	Объект = Справочники.КлассификационныеПризнакиСчетов.СоздатьЭлемент();
	Объект.Код = КПС;
	// Заполнение вида КБК.
	Если (КФО = Перечисления.КВД.Бюджет) Тогда
		Объект.ВидПоказателя = ВидКБК;
		Объект.УточнениеПоказателя = Перечисления.ВидыКБК.ПустаяСсылка();
	ИначеЕсли ВидКБК.Пустая() Тогда
		Объект.ВидПоказателя = Перечисления.ВидыКБК.Произвольный;
		Объект.УточнениеПоказателя = Перечисления.ВидыКБК.ПустаяСсылка();
	Иначе
		Объект.ВидПоказателя = Перечисления.ВидыКБК.АУИБУ;
		Объект.УточнениеПоказателя = ВидКБК;
	КонецЕсли;
	// Заполнение периода действия.
	Объект.ДатаНачалаДействия = НачалоДня(НаДату);
	Объект.ДатаОкончанияДействия = КонецДня(НаДату);
	Отбор = Новый Структура;
	Отбор.Вставить("ЭтоГруппа", Ложь);
	Отбор.Вставить("ВидПоказателя", Объект.ВидПоказателя);
	Отбор.Вставить("УточнениеПоказателя", Объект.УточнениеПоказателя);
	УстановитьМинимальнуюДатуНачалаДействия(Объект, Отбор);
	УстановитьМаксимальнуюДатуОкончанияДействия(Объект, Отбор);
	// Заполнение бюджетной классификации.
	Если (Объект.ВидПоказателя = Перечисления.ВидыКБК.КРБ) Тогда
		Если (рКПС.Свойство("РазделПодразделКРБ", Отбор) И (Отбор <> Неопределено)) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_РазделПодразделКРБ_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.РазделыПодразделыКРБ")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.РазделыПодразделыКРБ")) Тогда
				Знч = Справочники.РазделыПодразделыКРБ.ПустаяСсылка();
			КонецЕсли;
			Объект.РазделПодразделКРБ = Знч;
		Иначе
			// Старый формат.
			Объект.РазделПодразделКРБ = РазделПодраздел(Лев(КПС, 4));
		КонецЕсли;	
		Если (рКПС.Свойство("ЦелеваяСтатьяКРБ", Отбор) И (Отбор <> Неопределено)) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ЦелеваяСтатьяКРБ_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.ЦелевыеСтатьиКРБ")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.ЦелевыеСтатьиКРБ")) Тогда
				Знч = Справочники.ЦелевыеСтатьиКРБ.ПустаяСсылка();
			КонецЕсли;
			Объект.ЦелеваяСтатьяКРБ = Знч;
			Если (Не Знч.Пустая()) Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Наименование", "НаименованиеПолное");
				Отбор.Вставить("ДНД", "ДатаНачалаДействия");
				Отбор.Вставить("ДОД", "ДатаОкончанияДействия");
				Отбор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Знч, Отбор);
				ЗаполнитьЗначенияСвойств(Объект, Отбор); 
				Объект.ДатаНачалаДействия = Макс(Объект.ДатаНачалаДействия, Отбор.ДНД);
				Объект.ДатаОкончанияДействия = Мин(Объект.ДатаОкончанияДействия, Отбор.ДОД);
			КонецЕсли;	
		КонецЕсли;	
		Если (рКПС.Свойство("ПрограммаЦелевойСтатьиКРБ", Отбор) И (Отбор <> Неопределено)) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ПрограммаЦелевойСтатьиКРБ_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.ПрограммыЦелевыхСтатейКРБ")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.ПрограммыЦелевыхСтатейКРБ")) Тогда
				Знч = Справочники.ПрограммыЦелевыхСтатейКРБ.ПустаяСсылка();
			КонецЕсли;
			Объект.ПрограммаЦелевойСтатьиКРБ = Знч;
			Если (Объект.ЦелеваяСтатьяКРБ.Пустая() И (Не Знч.Пустая())) Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("ЦелеваяСтатьяКРБ", "ЦелеваяСтатья");
				Отбор.Вставить("Наименование", "НаименованиеПолное");
				Отбор.Вставить("НаименованиеЦС", "ЦелеваяСтатья.НаименованиеПолное");
				Отбор.Вставить("ДНД", "ДатаНачалаДействия");
				Отбор.Вставить("ДОД", "ДатаОкончанияДействия");
				Отбор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Знч, Отбор);
				ЗаполнитьЗначенияСвойств(Объект, Отбор);
				Если ПустаяСтрока(Объект.Наименование) Тогда
					Объект.Наименование = Отбор.НаименованиеЦС;
				КонецЕсли;	
				Объект.ДатаНачалаДействия = Макс(Объект.ДатаНачалаДействия, Отбор.ДНД);
				Объект.ДатаОкончанияДействия = Мин(Объект.ДатаОкончанияДействия, Отбор.ДОД);
			КонецЕсли;	
		КонецЕсли;	
		Если (рКПС.Свойство("ВидРасходаКРБ", Отбор) И (Отбор <> Неопределено)) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ВидРасходовКРБ_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.ВидыРасходовКРБ")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.ВидыРасходовКРБ")) Тогда
				Знч = Справочники.ВидыРасходовКРБ.ПустаяСсылка();
			КонецЕсли;
			Объект.ВидРасходаКРБ = Знч;
			Если (Не Знч.Пустая()) Тогда
				Отбор = Новый Структура;
				Флаг = ПустаяСтрока(Объект.Наименование);
				Если Флаг Тогда
					Отбор.Вставить("Наименование", "НаименованиеПолное");
				КонецЕсли;	
				Отбор.Вставить("ДНД", "ДатаНачалаДействия");
				Отбор.Вставить("ДОД", "ДатаОкончанияДействия");
				Отбор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Знч, Отбор);
				Если Флаг Тогда
					ЗаполнитьЗначенияСвойств(Объект, Отбор);
				КонецЕсли;	
				Объект.ДатаНачалаДействия = Макс(Объект.ДатаНачалаДействия, Отбор.ДНД);
				Объект.ДатаОкончанияДействия = Мин(Объект.ДатаОкончанияДействия, Отбор.ДОД);
			КонецЕсли;	
		КонецЕсли;	
	ИначеЕсли (Объект.ВидПоказателя = Перечисления.ВидыКБК.КДБ) Тогда
		Если (рКПС.Свойство("ВидДоходаКДБ", Отбор) И (Отбор <> Неопределено)) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ВидДоходовКДБ_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.ВидыДоходовКДБ")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.ВидыДоходовКДБ")) Тогда
				Знч = Справочники.ВидыДоходовКДБ.ПустаяСсылка();
			КонецЕсли;
			Объект.ВидДоходаКДБ = Знч;
			Если (Не Знч.Пустая()) Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Наименование", "НаименованиеПолное");
				Отбор.Вставить("ДНД", "ДатаНачалаДействия");
				Отбор.Вставить("ДОД", "ДатаОкончанияДействия");
				Отбор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Знч, Отбор);
				ЗаполнитьЗначенияСвойств(Объект, Отбор); 
				Объект.ДатаНачалаДействия = Макс(Объект.ДатаНачалаДействия, Отбор.ДНД);
				Объект.ДатаОкончанияДействия = Мин(Объект.ДатаОкончанияДействия, Отбор.ДОД);
			КонецЕсли;	
		КонецЕсли;
		Если (рКПС.Свойство("ГруппаПодвидаКДБ", Отбор) И (Отбор <> Неопределено)) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ГруппаПодвидаКДБ_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.ГруппыПодвидовКДБ")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.ГруппыПодвидовКДБ")) Тогда
				Знч = Справочники.ГруппыПодвидовКДБ.ПустаяСсылка();
			КонецЕсли;
			Объект.ГруппаПодвидаКДБ = Знч;
			Если (Объект.ВидДоходаКДБ.Пустая() И (Не Знч.Пустая())) Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("ВидДоходаКДБ", "ВидДохода");
				Отбор.Вставить("Наименование", "НаименованиеПолное");
				Отбор.Вставить("НаименованиеВД", "ВидДохода.НаименованиеПолное");
				Отбор.Вставить("ДНД", "ВидДохода.ДатаНачалаДействия");
				Отбор.Вставить("ДОД", "ВидДохода.ДатаОкончанияДействия");
				Отбор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Знч, Отбор);
				ЗаполнитьЗначенияСвойств(Объект, Отбор);
				Если (Не Объект.ВидДоходаКДБ.Пустая()) Тогда
					Если ПустаяСтрока(Объект.Наименование) Тогда
						Объект.Наименование = Отбор.НаименованиеВД;
					КонецЕсли;	
					Объект.ДатаНачалаДействия = Макс(Объект.ДатаНачалаДействия, Отбор.ДНД);
					Объект.ДатаОкончанияДействия = Мин(Объект.ДатаОкончанияДействия, Отбор.ДОД);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		Если (рКПС.Свойство("АналитическаяГруппаКДБ", Отбор) И (Отбор <> Неопределено)) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_КОСГУ_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.КОСГУ")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.КОСГУ")) Тогда
				Знч = Справочники.КОСГУ.ПустаяСсылка();
			КонецЕсли;
			Объект.АналитическаяГруппаКДБ = Знч;
		КонецЕсли;
	ИначеЕсли (Объект.ВидПоказателя = Перечисления.ВидыКБК.КИФ) Тогда
		Если (рКПС.Свойство("ГруппаПодгруппаКИФ", Отбор) И (Отбор <> Неопределено)) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ГруппаПодгруппаКИФ_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.ГруппыПодгруппыКИФ")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.ГруппыПодгруппыКИФ")) Тогда
				Знч = Справочники.ГруппыПодгруппыКИФ.ПустаяСсылка();
			КонецЕсли;
			Объект.ГруппаПодгруппаКИФ = Знч;
		КонецЕсли;	
		Если (рКПС.Свойство("СтатьяКИФ", Отбор) И (Отбор <> Неопределено)) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_СтатьяКИФ_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.СтатьиКИФ")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.СтатьиКИФ")) Тогда
				Знч = Справочники.СтатьиКИФ.ПустаяСсылка();
			КонецЕсли;
			Объект.СтатьяКИФ = Знч;
			Если (Не Знч.Пустая()) Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("Наименование", "НаименованиеПолное");
				Отбор.Вставить("ДНД", "ДатаНачалаДействия");
				Отбор.Вставить("ДОД", "ДатаОкончанияДействия");
				Отбор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Знч, Отбор);
				ЗаполнитьЗначенияСвойств(Объект, Отбор); 
				Объект.ДатаНачалаДействия = Макс(Объект.ДатаНачалаДействия, Отбор.ДНД);
				Объект.ДатаОкончанияДействия = Мин(Объект.ДатаОкончанияДействия, Отбор.ДОД);
			КонецЕсли;	
			Если (Объект.ГруппаПодгруппаКИФ.Пустая() И (Не Знч.Пустая())) Тогда
				Объект.ГруппаПодгруппаКИФ = ФИББГУМенеджерОбменаПовтИсп.ПолучитьВладельца(Знч);
			КонецЕсли;	
		КонецЕсли;
		Если (рКПС.Свойство("ВидКИФ", Отбор) И (Отбор <> Неопределено)) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ВидКИФ_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.ВидыКИФ")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.ВидыКИФ")) Тогда
				Знч = Справочники.ВидыКИФ.ПустаяСсылка();
			КонецЕсли;
			Объект.ВидКИФ = Знч;
			Если (Объект.СтатьяКИФ.Пустая() И (Не Знч.Пустая())) Тогда
				Отбор = Новый Структура;
				Отбор.Вставить("СтатьяКИФ", "Владелец");
				Отбор.Вставить("Наименование", "НаименованиеПолное");
				Отбор.Вставить("НаименованиеС", "Владелец.НаименованиеПолное");
				Отбор.Вставить("ДНД", "Владелец.ДатаНачалаДействия");
				Отбор.Вставить("ДОД", "Владелец.ДатаОкончанияДействия");
				Отбор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Знч, Отбор);
				ЗаполнитьЗначенияСвойств(Объект, Отбор);
				Если (Не Объект.СтатьяКИФ.Пустая()) Тогда
					Если ПустаяСтрока(Объект.Наименование) Тогда
						Объект.Наименование = Отбор.НаименованиеС;
					КонецЕсли;	
					Объект.ДатаНачалаДействия = Макс(Объект.ДатаНачалаДействия, Отбор.ДНД);
					Объект.ДатаОкончанияДействия = Мин(Объект.ДатаОкончанияДействия, Отбор.ДОД);
				КонецЕсли;	
			КонецЕсли;
			Знч = Объект.СтатьяКИФ;
			Если (Объект.ГруппаПодгруппаКИФ.Пустая() И (Не Знч.Пустая())) Тогда
				Объект.ГруппаПодгруппаКИФ = ФИББГУМенеджерОбменаПовтИсп.ПолучитьВладельца(Знч);
			КонецЕсли;	
		КонецЕсли;
		Если (рКПС.Свойство("АналитическаяГруппаКИФ", Отбор) И (Отбор <> Неопределено)) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_КОСГУ_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.КОСГУ")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.КОСГУ")) Тогда
				Знч = Справочники.КОСГУ.ПустаяСсылка();
			КонецЕсли;
			Объект.АналитическаяГруппаКИФ = Знч;
		КонецЕсли;
		// Старый формат.
		Если Объект.ГруппаПодгруппаКИФ.Пустая() Тогда
			Объект.ГруппаПодгруппаКИФ = ГруппаКИФ(Лев(КПС, 4));
		КонецЕсли;	
	ИначеЕсли (Объект.ВидПоказателя = Перечисления.ВидыКБК.АУИБУ) Тогда
		Если (рКПС.Свойство("РазделПодразделКРБ", Отбор) И (Отбор <> Неопределено)) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_РазделПодразделКРБ_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.РазделыПодразделыКРБ")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.РазделыПодразделыКРБ")) Тогда
				Знч = Справочники.РазделыПодразделыКРБ.ПустаяСсылка();
			КонецЕсли;
			Объект.РазделПодразделКРБ = Знч;
		Иначе
			// Старый формат.
			Объект.РазделПодразделКРБ = РазделПодраздел(Лев(КПС, 4));
		КонецЕсли;	
		Объект.АналитическийКодКПС = АналитическийКодКПС(Сред(КПС, 5, 10));
		Если (Объект.УточнениеПоказателя = Перечисления.ВидыКБК.КРБ) Тогда
			Если (рКПС.Свойство("ВидРасходаКРБ", Отбор) И (Отбор <> Неопределено)) Тогда
				ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ВидРасходовКРБ_Получение");
				Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
				Тип = ТипЗнч(Знч);
				Если (Тип = Тип("СправочникОбъект.ВидыРасходовКРБ")) Тогда
					Знч = Знч.Ссылка;
				ИначеЕсли (Тип <> Тип("СправочникСсылка.ВидыРасходовКРБ")) Тогда
					Знч = Справочники.ВидыРасходовКРБ.ПустаяСсылка();
				КонецЕсли;
				Объект.ВидРасходаКРБ = Знч;
				Если (Не Знч.Пустая()) Тогда
					Отбор = Новый Структура;
					Отбор.Вставить("Наименование", "НаименованиеПолное");
					Отбор.Вставить("ДНД", "ДатаНачалаДействия");
					Отбор.Вставить("ДОД", "ДатаОкончанияДействия");
					Отбор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Знч, Отбор);
					ЗаполнитьЗначенияСвойств(Объект, Отбор); 
					Объект.ДатаНачалаДействия = Макс(Объект.ДатаНачалаДействия, Отбор.ДНД);
					Объект.ДатаОкончанияДействия = Мин(Объект.ДатаОкончанияДействия, Отбор.ДОД);
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли (Объект.УточнениеПоказателя = Перечисления.ВидыКБК.КДБ) Тогда
			Если (рКПС.Свойство("АналитическаяГруппаКДБ", Отбор) И (Отбор <> Неопределено)) Тогда
				ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_КОСГУ_Получение");
				Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
				Тип = ТипЗнч(Знч);
				Если (Тип = Тип("СправочникОбъект.КОСГУ")) Тогда
					Знч = Знч.Ссылка;
				ИначеЕсли (Тип <> Тип("СправочникСсылка.КОСГУ")) Тогда
					Знч = Справочники.КОСГУ.ПустаяСсылка();
				КонецЕсли;
				Объект.АналитическаяГруппаКДБ = Знч;
			КонецЕсли;
		Иначе
			Если (рКПС.Свойство("АналитическаяГруппаКИФ", Отбор) И (Отбор <> Неопределено)) Тогда
				ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_КОСГУ_Получение");
				Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Отбор, ПКО, Действие);
				Тип = ТипЗнч(Знч);
				Если (Тип = Тип("СправочникОбъект.КОСГУ")) Тогда
					Знч = Знч.Ссылка;
				ИначеЕсли (Тип <> Тип("СправочникСсылка.КОСГУ")) Тогда
					Знч = Справочники.КОСГУ.ПустаяСсылка();
				КонецЕсли;
				Объект.АналитическаяГруппаКИФ = Знч;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Заполнение наименования КПС по наименованию из простых кодов БК.
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Знч = Объект.ГруппаПодгруппаКИФ;
		Если Знч.Пустая() Тогда
			Знч = Объект.АналитическаяГруппаКДБ;
			Если Знч.Пустая() Тогда
				Знч = Объект.АналитическаяГруппаКИФ;
				Если Знч.Пустая() Тогда
					Знч = Объект.РазделПодразделКРБ;
					Если Знч.Пустая() Тогда
						Знч = Объект.АналитическийКодКПС;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		Если Знч.Пустая() Тогда
			Объект.Наименование = СтрШаблон(НСтр("ru = 'КПС ""%1"" создан при синхронизации данных с БМО'"), КПС);
		Иначе	
			Объект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Знч, "НаименованиеПолное");
		КонецЕсли;	
	КонецЕсли;
	Если (Объект.ДатаОкончанияДействия = ДатаГоризонта()) Тогда
		Объект.ОкончаниеДействия = Неопределено;
	Иначе
		Объект.ОкончаниеДействия = Объект.ДатаОкончанияДействия;
	КонецЕсли;	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

// Функция находит КЭК по коду.
//
// Параметры :
//	Код - Строка - код КЭК.
//
// Возвращаемое значение :
//	СправочникСсылка.КОСГУ.
//
Функция КЭК(Знач Код)
	Перем Текст, Таб, Отбор;
	
	Если (ТипЗнч(Код) <> Тип("Строка")) Тогда
		Возврат Справочники.КОСГУ.ПустаяСсылка();
	ИначеЕсли ПустаяСтрока(Код) Тогда
		Возврат Справочники.КОСГУ.ПустаяСсылка();
	КонецЕсли;
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	Спр.Ссылка КАК Ссылка
	        |ИЗ	Справочник.КОСГУ КАК Спр
	        |ГДЕ (Спр.Код = &Код)
			|УПОРЯДОЧИТЬ ПО Спр.ПометкаУдаления";
	Отбор = Новый Структура;
	Отбор.Вставить("Код", Лев(Код, 3));
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() > 0) Тогда
		Возврат Таб[0].Ссылка;
	КонецЕсли;
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Объект = Справочники.КОСГУ.СоздатьЭлемент();
	Объект.Код = Код;
	Объект.НаименованиеПолное = СтрШаблон(НСтр("ru = 'КЭК ""%1"" создан синхронизации данных с БМО'"), Код);
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

// Функция возвращает пустой договор.
//
// Параметры :
//	Организация - СправочникСсылка.Организации - учреждение.
//	Контрагент - СправочникСсылка.Контрагенты - контрагент.
//
// Возвращаемое значение :
//	СправочникСсылка.Договоры.
//
Функция ПустойДоговор(Знач Организация, Знач Контрагент)
	Перем Текст, Таб;

	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	Спр.Ссылка КАК Ссылка
	        |ИЗ	Справочник.Договоры КАК Спр
	        |ГДЕ (Спр.Код = ""00000000000"")
			|УПОРЯДОЧИТЬ ПО Спр.ПометкаУдаления, Спр.ВАрхиве";
	Таб = ПолучитьДанные(Текст);
	Если (Таб.Количество() > 0) Тогда
		Возврат Таб[0].Ссылка;
	КонецЕсли;
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Таб = Справочники.Договоры.СоздатьЭлемент();
	Таб.ЭлементГруппа = Ложь;
	Таб.ВАрхиве = Истина;
	Таб.Организация = Организация;
	Таб.Код = "00000000000";
	Таб.Наименование = НСтр("ru = 'Не заполнен (создан при обмене с БМО)'");
	Таб.Контрагент = Контрагент;
	Таб.ОбменДанными.Загрузка = Истина;
	Таб.Записать();
	Возврат Таб.Ссылка;

КонецФункции

// Функция ищет раздел лицевого счета.
//
// Параметры :
//	ЛС - СправочникСсылка.ЛицевыеСчета - лицевой счет.
//	КФО - ПеречислениеСсылка.КВД - код вида финансового обеспечения.
//
// Возвращаемое значение :
//	СправочникСсылка.РазделыЛицевыхСчетов.
//
Функция НайтиРазделЛицевогоСчета(Знач ЛС, Знач КФО)
	Перем Текст, Таб, Отбор;
	
	Если ЛС.Пустая() Тогда
		Возврат Справочники.РазделыЛицевыхСчетов.ПустаяСсылка();
	ИначеЕсли КФО.Пустая() Тогда
		Возврат Справочники.РазделыЛицевыхСчетов.ПустаяСсылка();
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("ЛС", ЛС);
	Отбор.Вставить("КФО", КФО);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	Спр.Ссылка КАК Ссылка
	        |ИЗ Справочник.РазделыЛицевыхСчетов КАК Спр
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РазделыЛицевыхСчетов.ДопустимыеКФО КАК СпрКФО
			|ПО (Спр.Ссылка = СпрКФО.Ссылка) 
	        |ГДЕ (Спр.Владелец = &ЛС) И (СпрКФО.КФО = &КФО)
			|УПОРЯДОЧИТЬ ПО Спр.ПометкаУдаления";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() > 0) Тогда
		Возврат Таб[0].Ссылка;
	ИначеЕсли (КФО <> Перечисления.КВД.Бюджет) Тогда
		Возврат Справочники.РазделыЛицевыхСчетов.ПустаяСсылка();
	КонецЕсли;
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Таб = Справочники.РазделыЛицевыхСчетов.СоздатьЭлемент();
	Таб.Владелец = ЛС;
	Таб.ИсточникСредств = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиСредств.СредстваБюджета");
	Таб.Код = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Таб.ИсточникСредств, "Код");
	Таб.ДопустимыеКФО.Добавить().КФО = КФО;
	Таб.Наименование = "(" + Таб.Код + ") " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Таб.Владелец, "Наименование"); 
	Таб.ОбменДанными.Загрузка = Истина;
	Таб.Записать();
	Возврат Таб.Ссылка;

КонецФункции

// Функция возвращает период по реквизитам из файла.
//
// Параметры :
//	рПериод - Структура - реквизиты периода.
//
// Возвращаемое значение :
//	СправочникСсылка.Периоды.
//
Функция ПериодПлана(Знач рПериод)
	Перем ДатаНачала, ДатаОкончания;
	
	Если (рПериод = Неопределено) Тогда
		Возврат Справочники.Периоды.ПустаяСсылка();
	ИначеЕсли (Не рПериод.Свойство("ДатаНачала", ДатаНачала)) Тогда
		Возврат Справочники.Периоды.ПустаяСсылка();
	ИначеЕсли (ТипЗнч(ДатаНачала) <> Тип("Дата")) Тогда
		Возврат Справочники.Периоды.ПустаяСсылка();
	ИначеЕсли (Не рПериод.Свойство("ДатаОкончания", ДатаОкончания)) Тогда
		Возврат Справочники.Периоды.ПустаяСсылка();
	ИначеЕсли (ТипЗнч(ДатаОкончания) <> Тип("Дата")) Тогда
		Возврат Справочники.Периоды.ПустаяСсылка();
	Иначе
		Возврат ФИББГУМенеджерОбменаПовтИсп.ПериодПлана(НачалоДня(ДатаНачала), НачалоДня(ДатаОкончания));
	КонецЕсли;	
	
КонецФункции

// Функция ищет счет контрагента.
//
// Параметры :
//	Контрагент - СправочникСсылка.Контрагенты - контрагент.
//	Номер - Строка - номер счета контрагента.
//	ТипЛицевогоСчета - Неопределено, ПеречислениеСсылка.ТипыЛицевыхСчетов - тип лицевого счета. 
//
// Возвращаемое значение :
//	СправочникСсылка.БанковскиеИКазначейскиеСчета.
//
Функция НайтиСчетКонтрагента(Знач Контрагент, Знач Номер = "", Знач ТипЛицевогоСчета = Неопределено)
	Перем Текст, Таб, Отбор;
	
	Если Контрагент.Пустая() Тогда
		Возврат Справочники.БанковскиеИКазначейскиеСчета.ПустаяСсылка();
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Контрагент", Контрагент);
	Если ПустаяСтрока(Номер) Тогда
		Текст = "ВЫБРАТЬ ПЕРВЫЕ 2
				|	Спр.Ссылка КАК Ссылка
				|ИЗ Справочник.БанковскиеИКазначейскиеСчета КАК Спр
				|ГДЕ (Спр.Владелец = &Контрагент)
				|  И (НЕ Спр.ПометкаУдаления)";
	Иначе	
		Отбор.Вставить("Код", Номер);
		Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	Спр.Ссылка КАК Ссылка
				|ИЗ Справочник.БанковскиеИКазначейскиеСчета КАК Спр
				|ГДЕ (Спр.Владелец = &Контрагент) И (Спр.Код = &Код)
				|  И (НЕ Спр.ПометкаУдаления)";
	КонецЕсли;
	Если (ТипЛицевогоСчета <> Неопределено) Тогда
		Отбор.Вставить("ТипЛицевогоСчета", ТипЛицевогоСчета);
		Текст = Текст + "
				|  И (Спр.ТипЛицевогоСчета = &ТипЛицевогоСчета)";
	КонецЕсли;	
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() = 1) Тогда
		Возврат Таб[0].Ссылка;
	Иначе
		Возврат Справочники.БанковскиеИКазначейскиеСчета.ПустаяСсылка();
	КонецЕсли;

КонецФункции

// Процедура добавляет учетный номер обязательства.
//
// Параметры :
//	УчетныйНомер - Строка - учетный номер обязательства.
//	Договор - СправочникСсылка.Договоры - договор.
//
Процедура ДобавитьУчетныйНомер(Знач УчетныйНомер, Знач Договор)
	Перем Набор, Запись;
	
	Если ПустаяСтрока(УчетныйНомер) Тогда	
		Возврат;
	ИначеЕсли Договор.Пустая() Тогда
		Возврат;
	КонецЕсли;
	// Запись номер обязательства в базу.
	Набор = РегистрыСведений.УчетныеНомераОбязательств.СоздатьНаборЗаписей();
	Набор.Отбор.Обязательство.Установить(Договор);
	Запись = Набор.Добавить();
	Запись.Обязательство = Договор;
	Запись.УчетныйНомерОбязательства = УчетныйНомер;
	Набор.Записать(Истина);
	
КонецПроцедуры

// Функция возвращает идентификатор вида субконто.
//
// Параметры :
//	Тип - тип ссылки на внешний объект.
//
// Возвращаемое значение :
//	Строка.
//
Функция ВидСубконтоСтр(Знач Тип)
	
	Если (Тип = Тип("СправочникСсылка.БСО")) Тогда
		Возврат "БСО";
	ИначеЕсли (Тип = Тип("СправочникСсылка.ВидыДенежныхДокументов")) Тогда
		Возврат "ВДД";
	ИначеЕсли (Тип = Тип("СправочникСсылка.ВидыЗатрат")) Тогда
		Возврат "ВЗ";
	ИначеЕсли (Тип = Тип("СправочникСсылка.ВидыНалоговИПлатежей")) Тогда
		Возврат "ВНИП";
	ИначеЕсли (Тип = Тип("СправочникСсылка.ВидыОбязательств")) Тогда
		Возврат "ВО";
	ИначеЕсли (Тип = Тип("СправочникСсылка.ВидыУдержаний")) Тогда
		Возврат "ВУ";
	ИначеЕсли (Тип = Тип("СправочникСсылка.ДенежныеДокументы")) Тогда
		Возврат "ДД";
	ИначеЕсли (Тип = Тип("СправочникСсылка.НалогиИПлатежиОрганизации")) Тогда
		Возврат "НИПО";
	ИначеЕсли (Тип = Тип("СправочникСсылка.ОбъектыФинансовыхВложений")) Тогда
		Возврат "ОФВ";
	ИначеЕсли (Тип = Тип("СправочникСсылка.ОсновныеСредства")) Тогда
		Возврат "ОО";
	ИначеЕсли (Тип = Тип("СправочникСсылка.ПричиныОшибокПрошлыхЛет")) Тогда
		Возврат "ПОПЛ";
	ИначеЕсли (Тип = Тип("СправочникСсылка.РазделыЛицевыхСчетов")) Тогда
		Возврат "РЛС";
	ИначеЕсли (Тип = Тип("СправочникСсылка.РасходыБудущихПериодов")) Тогда
		Возврат "РБП";
	ИначеЕсли (Тип = Тип("СправочникСсылка.Резервы")) Тогда
		Возврат "РЕЗ";
	ИначеЕсли (Тип = Тип("СправочникСсылка.ЦМО")) Тогда
		Возврат "ЦМО";
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область ПроцедурыКонвертации

// Возвращает версию формата менеджера обмена.
//
// Возвращаемое значение:
//  Строка - номер версии.
//
Функция ВерсияФорматаМенеджераОбмена() Экспорт

    Возврат "2";

КонецФункции

// Вызывается перед выполнением синхронизации данных.
//
// Параметры:
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализируемые
//								   в рамках выполнения сеанса обмена.
//
Процедура ПередКонвертацией(Знач КомпонентыОбмена) Экспорт
	Перем ЭтоОтправка, Узел, Стр, Текст, Таб, Набор;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Узел = КомпонентыОбмена.УзелКорреспондента;
	Если (Не ЗначениеЗаполнено(Узел)) Тогда
		КомпонентыОбмена.XMLСхема = СтрЗаменить(КомпонентыОбмена.XMLСхема, "EnterpriseData", "StateAccounting");
		Возврат;
	КонецЕсли;	
	ЭтоОтправка = (КомпонентыОбмена.НаправлениеОбмена = "Отправка");
	Если ЭтоОтправка Тогда
		Стр = "БылаВыполненаРегистрацияИзмененийНачальнойВыгрузкиДанных";
		Если (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Узел, Стр) <> Истина) Тогда
			РегистрацияИзмененийНачальнойВыгрузкиДанных(Узел, Истина, Неопределено);
		КонецЕсли;
	Иначе	
		Стр = "ПроверятьПолученныеДокументы";
		Парам = КомпонентыОбмена.ПараметрыКонвертации;
		Парам.ПроверятьПолученныеПроводки = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Узел, Стр) = Истина);
		// Удаление лишних ссылок.
		Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		        |	Рег.Ссылка КАК Ссылка
		        |ИЗ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК Рег
		        |ГДЕ (Рег.УзелИнформационнойБазы = &Узел)
		        |  И (Рег.Ссылка ССЫЛКА Справочник.Журналы)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
		        |	Рег.Ссылка КАК Ссылка
		        |ИЗ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК Рег
		        |ГДЕ (Рег.УзелИнформационнойБазы = &Узел)
				|  И (Рег.Ссылка = Неопределено)";
		Стр = Новый Структура;
		Стр.Вставить("Узел", Узел);
		Таб = ПолучитьДанные(Текст, Стр);
		Если (Таб.Количество() <> 0) Тогда
			Набор = РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.СоздатьНаборЗаписей();
			Набор.Отбор.УзелИнформационнойБазы.Установить(Узел);
			Набор.ОбменДанными.Загрузка = Истина;
			Для Каждого Стр Из Таб Цикл
				Набор.Отбор.Ссылка.Установить(Стр.Ссылка);
				Набор.Записать(Истина);
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	ФИББГУМенеджерОбменаПереопределяемый.ПередКонвертацией(КомпонентыОбмена);

КонецПроцедуры

// Вызывается после выполнения синхронизации данных.
//
// Параметры:
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные
//								   в рамках выполнения сеанса обмена.
//
Процедура ПослеКонвертации(Знач КомпонентыОбмена) Экспорт
	Перем ЭтоОтправка, Флаг, Узел, Набор, Запись, ДГ, Знч;
	Перем Начало, Конец, Организации, Счета, Стр, ПШ;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	ЭтоОтправка = (КомпонентыОбмена.НаправлениеОбмена = "Отправка");
	Если (Не ЭтоОтправка) Тогда
		// Получаем настройки отбора данных.
		Стр = "Ссылка,РежимВыгрузкиЕПСБУ,ДатаНачалаВыгрузкиЕПСБУ,Организации,НомерОтправленного";
		Стр = Стр + ",Счета,ИспользоватьОтборПоСчетам,ВыгружатьДанныеПоЗабалансовымСчетам";
		Стр = Стр + ",ПериодРегистрацииВМесяцахЕПСБУ,НомерПринятого,ЭтоБМО";
		Узел = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КомпонентыОбмена.УзелКорреспондента, Стр);
		Организации = Узел.Организации.Выгрузить().ВыгрузитьКолонку("Организация");
		Узел.Удалить("Организации");
		Счета = Узел.Счета.Выгрузить().ВыгрузитьКолонку("Счет");
		Узел.Удалить("Счета");
		Набор = РегистрыСведений.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ.СоздатьНаборЗаписей();
		Набор.Отбор.Узел.Установить(Узел.Ссылка);
		Набор.Прочитать();
		Флаг = (Узел.РежимВыгрузкиЕПСБУ = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию);
		Флаг = Флаг И (Организации.Количество() > 0);
		Если Флаг Тогда
			Если (Набор.Количество() = 1) Тогда
				Запись = Набор[0];
				ПШ = Ложь;
			Иначе             
				Набор.Очистить();
				Запись = Набор.Добавить();
				Запись.Узел = Узел.Ссылка;
				Запись.НомерПакета = 2;
				Запись.ДатаРегистрации = Узел.ДатаНачалаВыгрузкиЕПСБУ;
				ФИББГУМенеджерОбменаПереопределяемый.ИнициализироватьДатуРегистрации(Запись);
				ПШ = Истина;
			КонецЕсли;                                          
			ДГ = ДатаГоризонта();
			Флаг = (Узел.ЭтоБМО = Истина);
			Флаг = Флаг Или ((ТипЗнч(Узел.НомерПринятого) = Тип("Число") И (2 <= Узел.НомерПринятого)));
			Флаг = Флаг И (Запись.ДатаРегистрации < ДГ);
			Флаг = Флаг И (Макс(2, Запись.НомерПакета) <= КомпонентыОбмена.НомерСообщенияПолученногоКорреспондентом);
			Если Флаг Тогда
				Запись.НомерПакета = 1 + Узел.НомерОтправленного; 
				Начало = Запись.ДатаРегистрации;
				Конец = Начало;
				Знч = Мин(Макс(1, Узел.ПериодРегистрацииВМесяцахЕПСБУ), 96); 
				ФИББГУМенеджерОбменаПереопределяемый.УвеличитьДатуРегистрации(Конец, ПШ, Знч);
				Если (ТекущаяДатаСеанса() < Конец) Тогда
					Конец = Неопределено;
					Запись.ДатаРегистрации = ДГ;
				Иначе
					Запись.ДатаРегистрации = Конец;
				КонецЕсли;
				Если (Не Узел.ИспользоватьОтборПоСчетам) Тогда
					Счета = Неопределено;
				КонецЕсли;
				Флаг = Узел.ВыгружатьДанныеПоЗабалансовымСчетам;
				РегистрацияИзмененийВБухгалтерскомРегистре(Узел.Ссылка,
														   Начало,
														   Конец,
														   Организации,
														   Счета,
														   Флаг);
				Набор.Записать(Истина);
			ИначеЕсли (Запись.НомерПакета < 2) Тогда
				Набор.Очистить();
				Набор.Записать(Истина);
			КонецЕсли;	
		ИначеЕсли (Набор.Количество() > 0) Тогда
			Набор.Очистить();
			Набор.Записать(Истина);
		КонецЕсли;	
	КонецЕсли;	
	ФИББГУМенеджерОбменаПереопределяемый.ПослеКонвертации(КомпонентыОбмена);
	
КонецПроцедуры
                                      
// Вызывается перед выполнением отложенного заполнения.
//
// Параметры:
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные
//								   в рамках выполнения сеанса обмена.
//
Процедура ПередОтложеннымЗаполнением(Знач КомпонентыОбмена) Экспорт

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	ФИББГУМенеджерОбменаПереопределяемый.ПередОтложеннымЗаполнением(КомпонентыОбмена);
	
КонецПроцедуры

// Процедура-обработчик события менеджера обмена перед обработкой удаления объекта (пришла информация об удалении объекта в другой базе данных).
//
// Параметры:
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные
//								   в рамках выполнения сеанса обмена.
//  Объект - объект, удаленный в другой базе данных.
//
Процедура ПередОбработкойУдаляемогоОбъекта(Знач КомпонентыОбмена, Объект) Экспорт
	Перем Тип, Флаг;

	Тип = ТипЗнч(Объект);
	Флаг = (Тип = Тип("ДокументОбъект.ОперацияБух"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.БюджетныеДанные"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.КассовоеВыбытие"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.КассовоеПоступление"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.РасходноеРасписание"));
	Флаг = Флаг Или (Тип = Тип("ДокументОбъект.РегистрацияОбязательствИСведенийПоДоговорам"));
	Если (Флаг И (Объект.ИДИсточника = ИзмененУИ())) Тогда
		Объект = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

// Правила обработки данных.
#Область ПОД

// Заполняет таблицу правил обработки данных.
//
// Параметры:
//  НаправлениеОбмена - строка ("Отправка" либо "Получение").
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ЗаполнитьПравилаОбработкиДанных(Знач НаправлениеОбмена, Знач ПравилаОбработкиДанных) Экспорт
	Перем Колонки, Имя;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Если (НаправлениеОбмена = "Отправка") Тогда
		Колонки = ПравилаОбработкиДанных.Колонки;
		Имя = "ОчисткаДанных";
		Если (Колонки.Найти(Имя) = Неопределено) Тогда
	    	Колонки.Добавить(Имя, Новый ОписаниеТипов("Булево"));
		КонецЕсли;
		ДобавитьПОД_Справочник_Бюджет_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Валюта_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидДоходовКДБ_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидКИФ_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидРасходовКРБ_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидЦелевыхСредств_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВнешнийОбъект_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ГлаваПоБюджетнойКлассификации_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ГруппаПодвидаКДБ_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ГруппаПодгруппаКИФ_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Договор_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Журнал_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Казначейство_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_КЕИ_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Контрагент_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_КОСГУ_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ЛицевойСчет_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Мероприятие_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Номенклатура_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ПрограммаЦелевойСтатьиКРБ_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Организация_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_РазделПодразделКРБ_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_СтатьяКИФ_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ЦелеваяСтатьяКРБ_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ЭлементБюджета_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_БухгалтерскаяСправка_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ОперацияБух_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_БюджетныеДанные_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_КассовоеВыбытие_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_КассовоеПоступление_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_РасходноеРасписание_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_РегистрацияОбязательств_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_ПланСчетов_ЕПСБУ_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_РегистрСведений_БГУАдресаХостов_Отправка(ПравилаОбработкиДанных);
	ИначеЕсли (НаправлениеОбмена = "Получение") Тогда
		ДобавитьПОД_ПланОбмена_ФИБОбменБГУ_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Бюджет_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Валюта_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидДоходовКДБ_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидКИФ_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидРасходовКРБ_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ВидЦелевыхСредств_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ГлаваПоБюджетнойКлассификации_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ГруппаПодвидаКДБ_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ГруппаПодгруппаКИФ_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Договор_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ИФО_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Казначейство_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_КЕИ_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Контрагент_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_КОСГУ_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ЛицевойСчет_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Мероприятие_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Номенклатура_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Организация_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_РазделПодразделКРБ_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_СтатьяКИФ_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ЦелеваяСтатьяКРБ_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ЭлементБюджета_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_БухгалтерскаяСправка_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_БюджетныеДанные_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_КассовоеВыбытие_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_КассовоеПоступление_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_РасходноеРасписание_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_РегистрацияОбязательств_Получение(ПравилаОбработкиДанных);
	КонецЕсли;
	ФИББГУМенеджерОбменаПереопределяемый.ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных);

КонецПроцедуры

// Правила отправки данных.
#Область ПОД_Отправка

// Процедура добавляет обработчики для выгрузки данных бюджетов.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Бюджет_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Бюджет_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.Бюджеты;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_Бюджет_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных валюты.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Валюта_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Валюта_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.Валюты;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_Валюта_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных вида доходов КДБ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ВидДоходовКДБ_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВидДоходовКДБ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыДоходовКДБ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВидДоходовКДБ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных подвида видов КИФ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ВидКИФ_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВидКИФ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыКИФ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВидКИФ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных вида расходов КРБ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ВидРасходовКРБ_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВидРасходовКРБ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыРасходовКРБ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВидРасходовКРБ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных вида целевых средств.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ВидЦелевыхСредств_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВидЦелевыхСредств_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыЦелевыхСредств;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВидЦелевыхСредств_Отправка");
  	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_НС_ВидЦелевыхСредств_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных субконто (внешние объекты).
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ВнешнийОбъект_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_БСО_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.БСО;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_БСО_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_БСО_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВДД_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыДенежныхДокументов;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВДД_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_ВДД_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВидЗатрат_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыЗатрат;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВидЗатрат_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_ВидЗатрат_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВНП_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыНалоговИПлатежей;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВНП_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_ВНП_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВидОбязательств_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыОбязательств;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВидОбязательств_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_ВидОбязательств_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВидУдержаний_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ВидыУдержаний;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВидУдержаний_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_ВидУдержаний_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ДД_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ДенежныеДокументы;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ДД_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_ДД_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_НПО_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.НалогиИПлатежиОрганизации;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_НПО_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_НПО_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ОФВ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ОбъектыФинансовыхВложений;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ОФВ_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_ОФВ_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ОсновныеСредства_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ОсновныеСредства;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ОсновныеСредства_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_ОсновныеСредства_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ПОПЛ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ПричиныОшибокПрошлыхЛет;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ПОПЛ_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_ПОПЛ_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_РЛС_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.РазделыЛицевыхСчетов;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_РЛС_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_РЛС_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_РБП_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.РасходыБудущихПериодов;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_РБП_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_РБП_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Резерв_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.Резервы;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_Резерв_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_Резерв_Отправка");

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ЦМО_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ЦМО;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ЦМО_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_ВО_ЦМО_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных главы по БК.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ГлаваПоБюджетнойКлассификации_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ГлаваПоБюджетнойКлассификации_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ГлавыПоБюджетнойКлассификации;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ГлаваПоБюджетнойКлассификации_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных группы подвидов доходов КДБ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ГруппаПодвидаКДБ_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ГруппаПодвидаКДБ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ГруппыПодвидовКДБ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ГруппаПодвидаКДБ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных группы (подгруппы) КИФ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ГруппаПодгруппаКИФ_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ГруппаПодгруппаКИФ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ГруппыПодгруппыКИФ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ГруппаПодгруппаКИФ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных договора.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Договор_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Договор_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.Договоры;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_Договор_Отправка");
  	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_НС_Договор_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных журналов.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Журнал_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Журнал_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.Журналы;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_Журнал_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных казначейства.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Казначейство_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Казначейство_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.Казначейства;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_Казначейство_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных классификатора единиц измерения.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_КЕИ_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_КЕИ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.КлассификаторЕдиницИзмерения;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_КЕИ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных контрагента.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Контрагент_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Контрагент_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.Контрагенты;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_Контрагент_Отправка");
  	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_НС_Контрагент_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных КОСГУ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_КОСГУ_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_КОСГУ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.КОСГУ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_КОСГУ_Отправка");
   	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_НС_КОСГУ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных лицевого счета.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ЛицевойСчет_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ЛицевойСчет_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ЛицевыеСчета;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ЛицевойСчет_Отправка");
   	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_НС_ЛицевойСчет_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных мероприятия.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Мероприятие_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Мероприятие_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.Мероприятия;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_Мероприятие_Отправка");
   	Запись.ИспользуемыеПКО.Добавить("РС_БГУ_НС_Мероприятие_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных номенклатуры.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Номенклатура_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Номенклатура_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.Номенклатура;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_Номенклатура_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных направлений расходов.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ПрограммаЦелевойСтатьиКРБ_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ПрограммаЦелевойСтатьиКРБ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ПрограммыЦелевыхСтатейКРБ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ПрограммаЦелевойСтатьиКРБ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных организации.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Организация_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Организация_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.Организации;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_Организация_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных раздела, подраздела КРБ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_РазделПодразделКРБ_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_РазделПодразделКРБ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.РазделыПодразделыКРБ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_РазделПодразделКРБ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных статьи КИФ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_СтатьяКИФ_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_СтатьяКИФ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.СтатьиКИФ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_СтатьяКИФ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных программных (непрограммных) направлений расходов.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ЦелеваяСтатьяКРБ_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ЦелеваяСтатьяКРБ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ЦелевыеСтатьиКРБ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ЦелеваяСтатьяКРБ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных элемента бюджета.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ЭлементБюджета_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ЭлементБюджета_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Справочники.ЭлементыБюджета;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Справочник_ЭлементБюджета_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных бухгалтерского регистра.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_БухгалтерскаяСправка_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_БухгалтерскаяСправка_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("Документ_БухгалтерскаяСправка_Отправка");
	Запись.ИспользуемыеПКО.Добавить("РегистрСведений_БГУИнформацияОбОбъектах_Отправка");
	
КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных с информацией об бухгалтерской операции.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_ОперацияБух_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_ОперацияБух_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Документы.ОперацияБух;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("РегистрСведений_БГУИнформацияОбОбъектах_ОБ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных с информацией о бюджетных данных.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_БюджетныеДанные_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_БюджетныеДанные_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Документы.БюджетныеДанные;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("РегистрСведений_БГУИнформацияОбОбъектах_БД_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных с информацией о кассовых выбытиях.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_КассовоеВыбытие_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_КассовоеВыбытие_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Документы.КассовоеВыбытие;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("РегистрСведений_БГУИнформацияОбОбъектах_КВ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных с информацией о кассовых выбытиях.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_КассовоеПоступление_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_КассовоеПоступление_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Документы.КассовоеПоступление;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("РегистрСведений_БГУИнформацияОбОбъектах_КП_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных с информацией о расходных расписаниях.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_РасходноеРасписание_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_РасходноеРасписание_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Документы.РасходноеРасписание;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("РегистрСведений_БГУИнформацияОбОбъектах_РР_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных сведений об обязательствах.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_РегистрацияОбязательств_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_РегистрацияОбязательств_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.Документы.РегистрацияОбязательствИСведенийПоДоговорам;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("РегистрСведений_БГУИнформацияОбОбъектах_БВО_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных плана счетов.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_ПланСчетов_ЕПСБУ_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "ПланСчетов_ЕПСБУ_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.ПланыСчетов.ЕПСБУ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("ПланСчетов_ЕПСБУ_Отправка");

КонецПроцедуры

// Процедура добавляет обработчики для выгрузки данных с адресом хоста.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_РегистрСведений_БГУАдресаХостов_Отправка(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "РегистрСведений_БГУАдресаХостов_Отправка";
	Запись.ОбъектВыборкиМетаданные = Метаданные.РегистрыСведений.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ;
	Запись.ОчисткаДанных = Ложь;
	Запись.ИспользуемыеПКО.Добавить("РегистрСведений_БГУАдресаХостов_Отправка");

КонецПроцедуры

#КонецОбласти

// Правила получения данных.
#Область ПОД_Получение

// Процедура добавляет обработчики для загрузки данных настроек узла плана обмена.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_ПланОбмена_ФИБОбменБГУ_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "ПланОбмена_ФИБОбменБГУ_Получение";
	Запись.ОбъектВыборкиФормат = "ПланОбмена.ФИБОбменБГУ";
	Запись.ИспользуемыеПКО.Добавить("ПланОбмена_ФИБОбменБГУ_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в бюджет.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Бюджет_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Бюджет_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.Бюджеты";
	Запись.ИспользуемыеПКО.Добавить("Справочник_Бюджет_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в валюту.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Валюта_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Валюта_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.Валюты";
	Запись.ИспользуемыеПКО.Добавить("Справочник_Валюта_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в вид доходов КДБ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ВидДоходовКДБ_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВидДоходовКДБ_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.ВидыДоходовКДБ";
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВидДоходовКДБ_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в вид КИФ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ВидКИФ_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВидКИФ_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.ВидыКИФ";
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВидКИФ_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в вид расходов КРБ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ВидРасходовКРБ_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВидРасходовКРБ_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.ВидыРасходовКРБ";
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВидРасходовКРБ_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в вид целевых средств.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ВидЦелевыхСредств_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ВидЦелевыхСредств_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.ВидыЦелевыхСредств";
	Запись.ИспользуемыеПКО.Добавить("Справочник_ВидЦелевыхСредств_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в главу по БК.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ГлаваПоБюджетнойКлассификации_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ГлаваПоБюджетнойКлассификации_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.ГлавыПоБюджетнойКлассификации";
	Запись.ИспользуемыеПКО.Добавить("Справочник_ГлаваПоБюджетнойКлассификации_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в подвид дохода КДБ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ГруппаПодвидаКДБ_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ГруппаПодвидаКДБ_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.ГруппыПодвидовКДБ";
	Запись.ИспользуемыеПКО.Добавить("Справочник_ГруппаПодвидаКДБ_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в группу, подгруппу КИФ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ГруппаПодгруппаКИФ_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ГруппаПодгруппаКИФ_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.ГруппыПодгруппыКИФ";
	Запись.ИспользуемыеПКО.Добавить("Справочник_ГруппаПодгруппаКИФ_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в договор.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Договор_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Договор_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.Договоры";
	Запись.ИспользуемыеПКО.Добавить("Справочник_Договор_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в ИФО.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ИФО_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Если (Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО")) Тогда
		Возврат;
	КонецЕсли;
	
	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ИФО_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.ИсточникиФинансовогоОбеспечения";
	Запись.ИспользуемыеПКО.Добавить("Справочник_ИФО_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в казначейство.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Казначейство_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Казначейство_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.Казначейства";
	Запись.ИспользуемыеПКО.Добавить("Справочник_Казначейство_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в классификатор единиц измерения.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_КЕИ_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_КЕИ_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.КлассификаторЕдиницИзмерения";
	Запись.ИспользуемыеПКО.Добавить("Справочник_КЕИ_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в контрагента.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Контрагент_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Контрагент_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.Контрагенты";
	Запись.ИспользуемыеПКО.Добавить("Справочник_Контрагент_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в КЭК.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_КОСГУ_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_КОСГУ_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.КОСГУ";
	Запись.ИспользуемыеПКО.Добавить("Справочник_КОСГУ_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в лицевой счет.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ЛицевойСчет_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ЛицевойСчет_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.ЛицевыеСчета";
	Запись.ИспользуемыеПКО.Добавить("Справочник_ЛицевойСчет_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в мероприятие.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Мероприятие_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Мероприятие_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.Мероприятия";
	Запись.ИспользуемыеПКО.Добавить("Справочник_Мероприятие_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в номенклатуру.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Номенклатура_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Номенклатура_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.Номенклатура";
	Запись.ИспользуемыеПКО.Добавить("Справочник_Номенклатура_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в организацию.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_Организация_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_Организация_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.Учреждения";
	Запись.ИспользуемыеПКО.Добавить("Справочник_Организация_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в направление расходов.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ПрограммаЦелевойСтатьиКРБ_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.ПрограммыЦелевыхСтатейКРБ";
	Запись.ИспользуемыеПКО.Добавить("Справочник_ПрограммаЦелевойСтатьиКРБ_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в раздел, подраздел КРБ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_РазделПодразделКРБ_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_РазделПодразделКРБ_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.РазделыПодразделыКРБ";
	Запись.ИспользуемыеПКО.Добавить("Справочник_РазделПодразделКРБ_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в статья КИФ.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_СтатьяКИФ_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_СтатьяКИФ_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.СтатьиКИФ";
	Запись.ИспользуемыеПКО.Добавить("Справочник_СтатьяКИФ_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в программное (непрограммное) направление расходов.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ЦелеваяСтатьяКРБ_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ЦелеваяСтатьяКРБ_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.ЦелевыеСтатьиКРБ";
	Запись.ИспользуемыеПКО.Добавить("Справочник_ЦелеваяСтатьяКРБ_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в элемент бюджета.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Справочник_ЭлементБюджета_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;

	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Справочник_ЭлементБюджета_Получение";
	Запись.ОбъектВыборкиФормат = "Справочник.ЭлементыБюджета";
	Запись.ИспользуемыеПКО.Добавить("Справочник_ЭлементБюджета_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в бухгалтерскую операцию.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_БухгалтерскаяСправка_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;
	
	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_БухгалтерскаяСправка_Получение";
	Запись.ОбъектВыборкиФормат = "Документ.БухгалтерскаяСправка";
	Запись.ИспользуемыеПКО.Добавить("Документ_БухгалтерскаяСправка_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки бюджетных данных.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_БюджетныеДанные_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;
	
	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_БюджетныеДанные_Получение";
	Запись.ОбъектВыборкиФормат = "Документ.БюджетныеДанные";
	Запись.ИспользуемыеПКО.Добавить("Документ_БюджетныеДанные_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в кассовое выбытие.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_КассовоеВыбытие_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;
	
	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_КассовоеВыбытие_Получение";
	Запись.ОбъектВыборкиФормат = "Документ.КассовоеВыбытие";
	Запись.ИспользуемыеПКО.Добавить("Документ_КассовоеВыбытие_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки данных в кассовое поступление.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_КассовоеПоступление_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;
	
	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_КассовоеПоступление_Получение";
	Запись.ОбъектВыборкиФормат = "Документ.КассовоеПоступление";
	Запись.ИспользуемыеПКО.Добавить("Документ_КассовоеПоступление_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки расходных расписаний.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_РасходноеРасписание_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;
	
	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_РасходноеРасписание_Получение";
	Запись.ОбъектВыборкиФормат = "Документ.РасходноеРасписание";
	Запись.ИспользуемыеПКО.Добавить("Документ_РасходноеРасписание_Получение");

КонецПроцедуры

// Процедура добавляет обработчики для загрузки сведений об обязательствах.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПОД_Документ_РегистрацияОбязательств_Получение(Знач ПравилаОбработкиДанных)
	Перем Запись;
	
	Запись = ПравилаОбработкиДанных.Добавить();
	Запись.Имя = "Документ_РегистрацияОбязательств_Получение";
	Запись.ОбъектВыборкиФормат = "Документ.РегистрацияОбязательствИСведенийПоДоговорам";
	Запись.ИспользуемыеПКО.Добавить("Документ_РегистрацияОбязательств_Получение");

КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Правила конвертации данных.
#Область ПКО

// Заполняет таблицу правил конвертации объектов.
//
// Параметры:
//  НаправлениеОбмена - строка ("Отправка" либо "Получение").
//  ПравилаКонвертации - таблица значений, в которую добавляются правила.
//
Процедура ЗаполнитьПравилаКонвертацииОбъектов(Знач НаправлениеОбмена, Знач ПравилаКонвертации) Экспорт

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Если (НаправлениеОбмена = "Отправка") Тогда
		ДобавитьПКО_Справочник_Бюджет_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Валюта_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ВидДоходовКДБ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ВидКИФ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ВидРасходовКРБ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ВидЦелевыхСредств_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ВнешнийОбъект_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ГлаваПоБюджетнойКлассификации_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ГруппаПодвидаКДБ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ГруппаПодгруппаКИФ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Договор_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Журнал_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Казначейство_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_КЕИ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Контрагент_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_КОСГУ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ЛицевойСчет_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Мероприятие_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Номенклатура_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Организация_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_РазделПодразделКРБ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_СтатьяКИФ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ЦелеваяСтатьяКРБ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ЭлементБюджета_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Документ_БухгалтерскаяСправка_Отправка(ПравилаКонвертации);
		ДобавитьПКО_ПланСчетов_ЕПСБУ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_РегистрСведений_БГУАдресаХостов_Отправка(ПравилаКонвертации);
		ДобавитьПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка(ПравилаКонвертации);
	ИначеЕсли (НаправлениеОбмена = "Получение") Тогда
		ДобавитьПКО_ПланОбмена_ФИБОбменБГУ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Бюджет_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Валюта_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ВидДоходовКДБ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ВидКИФ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ВидРасходовКРБ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ВидЦелевыхСредств_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ГлаваПоБюджетнойКлассификации_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ГруппаПодвидаКДБ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ГруппаПодгруппаКИФ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Договор_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ИФО_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Казначейство_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_КЕИ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Контрагент_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_КОСГУ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ЛицевойСчет_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Мероприятие_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Номенклатура_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Организация_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_РазделПодразделКРБ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_СтатьяКИФ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ЦелеваяСтатьяКРБ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ЭлементБюджета_Получение(ПравилаКонвертации);
		ДобавитьПКО_Документ_БухгалтерскаяСправка_Получение(ПравилаКонвертации);
		ДобавитьПКО_Документ_БюджетныеДанные_Получение(ПравилаКонвертации);
		ДобавитьПКО_Документ_КассовоеВыбытие_Получение(ПравилаКонвертации);
		ДобавитьПКО_Документ_КассовоеПоступление_Получение(ПравилаКонвертации);
		ДобавитьПКО_Документ_РасходноеРасписание_Получение(ПравилаКонвертации);
		ДобавитьПКО_Документ_РегистрацияОбязательств_Получение(ПравилаКонвертации);
	КонецЕсли;
	ФИББГУМенеджерОбменаПереопределяемый.ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации);

КонецПроцедуры

// Правила конвертации данных в пакетный файл.
#Область ПКО_Отправка

#Область Справочник_Бюджет

// Процедура добавляет обработчики для конвертации данных бюджетов при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Бюджет_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Бюджет_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Бюджеты;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Бюджеты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Элемент";
	НоваяСтрока.СвойствоФормата = "ЭлементБюджета";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЭлементБюджета_Отправка";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПубличноПравовогоОбразования";
	НоваяСтрока.СвойствоФормата = "НаименованиеПубличноПравовогоОбразования";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеФинансовогоОргана";
	НоваяСтрока.СвойствоФормата = "НаименованиеФинансовогоОргана";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодОрФК";
	НоваяСтрока.СвойствоФормата = "КодОрФК";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодОКПОФинансовогоОргана";
	НоваяСтрока.СвойствоФормата = "КодОКПОФинансовогоОргана";
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_Валюта

// Процедура добавляет обработчики для конвертации данных валюты при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Валюта_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Валюта_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Валюты;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Валюты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПараметрыПрописи";
	НоваяСтрока.СвойствоФормата = "ПараметрыПрописи";

КонецПроцедуры

#КонецОбласти

#Область Справочник_ВидДоходовКДБ

// Процедура добавляет обработчики для конвертации данных вида доходов КДБ при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ВидДоходовКДБ_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, КонвертацияТабличнойЧасти, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидДоходовКДБ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыДоходовКДБ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ВидыДоходовКДБ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаНачалаДействия";
	НоваяСтрока.СвойствоФормата = "НачалоДействия";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОкончаниеДействия";
	НоваяСтрока.СвойствоФормата = "ОкончаниеДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Элемент";
	НоваяСтрока.СвойствоФормата = "ЭлементБюджета";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЭлементБюджета_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЭлементГруппа";
	НоваяСтрока.СвойствоФормата = "ЭлементГруппа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидДоходовКДБ_Отправка";

	ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "АналитическиеГруппы";
    КонвертацияТабличнойЧасти.ТЧФормата = "АналитическиеГруппы";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "АналитическаяГруппа";
	НоваяСтрока.СвойствоФормата = "АналитическаяГруппа";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Отправка";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_ВидКИФ

// Процедура добавляет обработчики для конвертации данных подвида видов КИФ при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ВидКИФ_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидКИФ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыКИФ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ВидыКИФ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Владелец";
	НоваяСтрока.СвойствоФормата = "Владелец";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтатьяКИФ_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_ВидРасходовКРБ

// Процедура добавляет обработчики для конвертации данных вида расходов КРБ при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ВидРасходовКРБ_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидРасходовКРБ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыРасходовКРБ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ВидыРасходовКРБ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаНачалаДействия";
	НоваяСтрока.СвойствоФормата = "НачалоДействия";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОкончаниеДействия";
	НоваяСтрока.СвойствоФормата = "ОкончаниеДействия";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидРасходовКРБ_Отправка";
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_ВидЦелевыхСредств

// Процедура добавляет обработчики для конвертации данных вида целевых средств при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ВидЦелевыхСредств_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидЦелевыхСредств_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыЦелевыхСредств;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ВидыЦелевыхСредств";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидЦелевыхСредств_Отправка";

КонецПроцедуры

#КонецОбласти

#Область Справочник_ВнешнийОбъект

// Процедура добавляет обработчики для конвертации данных субконто (внешних объектов) при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ВнешнийОбъект_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_БСО_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.БСО;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВДД_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыДенежныхДокументов;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидЗатрат_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыЗатрат;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВНП_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыНалоговИПлатежей;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидОбязательств_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыОбязательств;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидУдержаний_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыУдержаний;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ДД_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ДенежныеДокументы;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_НПО_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.НалогиИПлатежиОрганизации;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ОФВ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ОбъектыФинансовыхВложений;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ОсновныеСредства_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ОсновныеСредства;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ПОПЛ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ПричиныОшибокПрошлыхЛет;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_РЛС_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.РазделыЛицевыхСчетов;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_РБП_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.РасходыБудущихПериодов;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Резерв_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Резервы;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ЦМО_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ЦМО;
	ПравилоКонвертации.ОбъектФормата = "ВнешнийОбъект";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ВнешнийОбъект_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

КонецПроцедуры

// Обработчик конвертирует данные из субконто (внешнего объекта) в пакет XDTO.
// 
// Параметры :
//	ДанныеИБ - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура ПКО_ВнешнийОбъект_ПриОтправкеДанных(Знач ДанныеИБ,
											  Знач ДанныеXDTO,
											  Знач КомпонентыОбмена,
											  Знач СтекВыгрузки,
											  Пропустить)

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	ДанныеXDTO.Вставить("Представление", СокрЛП(ДанныеИБ.Ссылка));
															
КонецПроцедуры

#КонецОбласти

#Область Справочник_ГлаваПоБюджетнойКлассификации

// Процедура добавляет обработчики для конвертации данных главы по БК при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ГлаваПоБюджетнойКлассификации_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ГлаваПоБюджетнойКлассификации_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ГлавыПоБюджетнойКлассификации;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ГлавыПоБюджетнойКлассификации";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаНачалаДействия";
	НоваяСтрока.СвойствоФормата = "НачалоДействия";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОкончаниеДействия";
	НоваяСтрока.СвойствоФормата = "ОкончаниеДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры

#КонецОбласти

#Область Справочник_ГруппаПодвидовКДБ

// Процедура добавляет обработчики для конвертации данных группы подвидов доходов КДБ при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ГруппаПодвидаКДБ_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ГруппаПодвидаКДБ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ГруппыПодвидовКДБ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ГруппыПодвидовКДБ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидДохода";
	НоваяСтрока.СвойствоФормата = "ВидДохода";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидДоходовКДБ_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры

#КонецОбласти

#Область Справочник_ГруппаПодгруппаКИФ

// Процедура добавляет обработчики для конвертации данных группы (подгруппы) КИФ при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ГруппаПодгруппаКИФ_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока, КонвертацияТабличнойЧасти;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ГруппаПодгруппаКИФ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ГруппыПодгруппыКИФ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ГруппыПодгруппыКИФ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ГруппаПодгруппаКИФ_Отправка";

	ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	
	КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
	КонвертацияТабличнойЧасти.ТЧКонфигурации = "ДопустимыеКОСГУ";
	КонвертацияТабличнойЧасти.ТЧФормата = "ДопустимыеКОСГУ";
	КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КОСГУ";
	НоваяСтрока.СвойствоФормата = "КОСГУ";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Отправка";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_Договор

// Процедура добавляет обработчики для конвертации данных договора при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Договор_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Договор_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Договоры;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Договоры";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_Договор_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организация_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидОбязательства";
	НоваяСтрока.СвойствоФормата = "ВидДоговора";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаДоговора";
	НоваяСтрока.СвойствоФормата = "ДатаДоговора";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НомерДоговора";
	НоваяСтрока.СвойствоФормата = "НомерДоговора";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "НомерОбязательства";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Контрагент";
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагент_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КраткоеСодержание";
	НоваяСтрока.СвойствоФормата = "КраткоеСодержание";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НормативноПравовойАкт";
	НоваяСтрока.СвойствоФормата = "НормативноПравовойАкт";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "УчетПредметаДоговора";
	НоваяСтрока.СвойствоФормата = "УчетПредметаДоговора";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЗаключаетсяПоРезультатамКонкурсныхПроцедур";
	НоваяСтрока.СвойствоФормата = "ЗаключаетсяПоРезультатамКонкурсныхПроцедур";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВАрхиве";
	НоваяСтрока.СвойствоФормата = "ВАрхиве";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаПомещенияВАрхив";
	НоваяСтрока.СвойствоФормата = "ДатаПомещенияВАрхив";
	
КонецПроцедуры

// Обработчик конвертирует данные из договора в пакет XDTO.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.Договора - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура ПКО_Справочник_Договор_Отправка_ПриОтправкеДанных(Знач ДанныеИБ,
															Знач ДанныеXDTO,
															Знач КомпонентыОбмена,
															Знач СтекВыгрузки,
															Пропустить)
	Перем КС, Набор, Запись;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Набор = РегистрыСведений.УчетныеНомераОбязательств.СоздатьНаборЗаписей();
	Набор.Отбор.Обязательство.Установить(ДанныеИБ.Ссылка);
	Набор.Прочитать();
	Если (Набор.Количество() > 0) Тогда
		Запись = Набор[0];
		Если (Не ПустаяСтрока(Запись.УчетныйНомерОбязательства)) Тогда
			КС = КлючевыеСвойства(ДанныеXDTO);
			КС.Вставить("НомерОбязательства", СокрЛП(Запись.УчетныйНомерОбязательства));
		КонецЕсли;	
	КонецЕсли;
	ФИББГУМенеджерОбменаПереопределяемый.Отправка_ПослеЗаполненияДанныхДоговора(ДанныеИБ, 
																				ДанныеXDTO, 
																				КомпонентыОбмена, 
																				СтекВыгрузки, 
																				Пропустить);
															
КонецПроцедуры
															
#КонецОбласти

#Область Справочник_Журнал

// Процедура добавляет обработчики для конвертации данных журналов при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Журнал_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Журнал_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Журналы;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Журналы";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры

#КонецОбласти

#Область Справочник_Казначейство

// Процедура добавляет обработчики для конвертации данных казначейства при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Казначейство_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Казначейство_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Казначейства;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Казначейства";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_Казначейство_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "Код";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИНН";
	НоваяСтрока.СвойствоФормата = "ИНН";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПП";
	НоваяСтрока.СвойствоФормата = "КПП";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "КодОКПО";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
КонецПроцедуры

// Обработчик конвертирует данные из казначейства в пакет XDTO.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.Казначейства - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура ПКО_Справочник_Казначейство_Отправка_ПриОтправкеДанных(Знач ДанныеИБ,
															     Знач ДанныеXDTO,
																 Знач КомпонентыОбмена,
																 Знач СтекВыгрузки,
																 Пропустить)
	Перем КС;

	// Заполнение свойств.
	КС = КлючевыеСвойства(ДанныеXDTO);
	// Код ФК.
	Если (Не ПустаяСтрока(ДанныеИБ.Код)) Тогда
		КС.Вставить("Код",  СокрЛП(Лев(СокрЛП(ДанныеИБ.Код), 4)));
	КонецЕсли;
	// ОКПО.
	Если (Не ПустаяСтрока(ДанныеИБ.КодОКПО)) Тогда
		ДанныеXDTO.Вставить("КодОКПО", СокрЛП(Лев(СокрЛП(ДанныеИБ.КодОКПО), 10)));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Справочник_КлассификаторЕдиницИзмерения

// Процедура добавляет обработчики для конвертации данных классификатора единиц измерения при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_КЕИ_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_КЕИ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.КлассификаторЕдиницИзмерения;
	ПравилоКонвертации.ОбъектФормата = "Справочник.КлассификаторЕдиницИзмерения";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "УсловноеОбозначение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "МеждународноеСокращение";
	НоваяСтрока.СвойствоФормата = "МеждународноеСокращение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеМеждународное";
	НоваяСтрока.СвойствоФормата = "НаименованиеМеждународное";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НациональноеСокращение";
	НоваяСтрока.СвойствоФормата = "НациональноеСокращение";
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_Контрагент

// Процедура добавляет обработчики для конвертации данных контрагента при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Контрагент_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Контрагент_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Контрагенты;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Контрагенты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_Контрагент_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИНН";
	НоваяСтрока.СвойствоФормата = "ИНН";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПП";
	НоваяСтрока.СвойствоФормата = "КПП";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "КодУчреждения";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "ЮрЛицо";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "ТипКонтрагента";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "Наименование";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "ОГРН";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "КодОКПО";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "Фамилия";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "Имя";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "Отчество";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "СНИЛС";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
КонецПроцедуры

// Обработчик конвертирует данные из контрагента в пакет XDTO.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.Контрагенты - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура ПКО_Справочник_Контрагент_Отправка_ПриОтправкеДанных(Знач ДанныеИБ,
															   Знач ДанныеXDTO,
															   Знач КомпонентыОбмена,
															   Знач СтекВыгрузки,
															   Пропустить)
	Перем Знч, КС;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	// Наименование.
	Если ПустаяСтрока(ДанныеИБ.НаименованиеСокращенное) Тогда
		ДанныеXDTO.Вставить("Наименование", ДанныеИБ.Наименование);
	Иначе
		ДанныеXDTO.Вставить("Наименование", ДанныеИБ.НаименованиеСокращенное);
	КонецЕсли;
	// Юр.лицо.
	Если (ДанныеИБ.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо) Тогда
		ДанныеXDTO.Вставить("ЮрЛицо", "0");
	Иначе
		ДанныеXDTO.Вставить("ЮрЛицо", "1");
	КонецЕсли;
	// Тип контрагента.
	Знч = ПолучитьКод(ДанныеИБ.ТипКонтрагента);
	Если (Не ПустаяСтрока(Знч)) Тогда
		ДанныеXDTO.Вставить("ТипКонтрагента", Знч);
	КонецЕсли;
	// Кодовые реквизиты.
	Знч = ТипЗнч(ДанныеИБ.ЮридическоеФизическоеЛицо);
	Если (Знч = Тип("СправочникСсылка.ФизическиеЛица")) Тогда
		// Получение реквизитов физ.лица.
		Знч = Новый Структура;
		Знч.Вставить("НаименованиеПолное", "Наименование");
		Знч.Вставить("КодОКПО", "КодОКПО");
		Знч.Вставить("СНИЛС", "СтраховойНомерПФР");
		Знч = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.ЮридическоеФизическоеЛицо, Знч);
		// Полное наименование.
		Если ПустаяСтрока(Знч.НаименованиеПолное) Тогда
			ДанныеXDTO.Вставить("НаименованиеПолное", ДанныеXDTO.Наименование);
		Иначе
			ДанныеXDTO.Вставить("НаименованиеПолное", Знч.НаименованиеПолное);
		КонецЕсли;
		// ОКПО.
		Если (Не ПустаяСтрока(Знч.КодОКПО)) Тогда
			ДанныеXDTO.Вставить("КодОКПО", СокрЛП(Лев(СокрЛП(Знч.КодОКПО), 10)));
		КонецЕсли;
		// СНИЛС.
		Если (Не ПустаяСтрока(Знч.СНИЛС)) Тогда
			ДанныеXDTO.Вставить("СНИЛС", СокрЛП(Знч.СНИЛС));
		КонецЕсли;
		// ФИО.
		Знч = Новый Структура;
		Знч.Вставить("ФизическоеЛицо", ДанныеИБ.ЮридическоеФизическоеЛицо);
		Знч = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(, Знч);
		Если (Знч.Количество() > 0) Тогда
			КС = Знч[0];
			ДанныеXDTO.Вставить("Фамилия", СокрЛП(КС.Фамилия));
			ДанныеXDTO.Вставить("Имя", СокрЛП(КС.Имя));
			ДанныеXDTO.Вставить("Отчество", СокрЛП(КС.Отчество));
		КонецЕсли;	
	ИначеЕсли (Знч = Тип("СправочникСсылка.ЮридическиеЛица")) Тогда
		// Получение реквизитов юр.лица.
		Знч = Новый Структура;
		Знч.Вставить("Бюджет", "Бюджет");
		Знч.Вставить("КодБюджета", "Бюджет.Код");
		Знч.Вставить("Код", "КодПоРПБС");
		Знч.Вставить("НаименованиеПолное", "НаименованиеПолное");
		Знч.Вставить("ОГРН", "ОГРН");
		Знч.Вставить("КодОКПО", "КодОКПО");
		Знч = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.ЮридическоеФизическоеЛицо, Знч);
		// Заполнение свойств.
		КС = КлючевыеСвойства(ДанныеXDTO);
		// Код УБП.
		Если (Не ПустаяСтрока(Знч.Код)) Тогда
			КС.Вставить("КодУчреждения", СокрЛП(Лев(СокрЛП(Знч.Код), 8)));
		КонецЕсли;
		// Полное наименование.
		Если ПустаяСтрока(Знч.НаименованиеПолное) Тогда
			ДанныеXDTO.Вставить("НаименованиеПолное", ДанныеXDTO.Наименование);
		Иначе
			ДанныеXDTO.Вставить("НаименованиеПолное", Знч.НаименованиеПолное);
		КонецЕсли;
		// ОГРН.
		Если (Не ПустаяСтрока(Знч.ОГРН)) Тогда
			ДанныеXDTO.Вставить("ОГРН", СокрЛП(Лев(СокрЛП(Знч.ОГРН), 13)));
		КонецЕсли;
		// ОКПО.
		Если (Не ПустаяСтрока(Знч.КодОКПО)) Тогда
			ДанныеXDTO.Вставить("КодОКПО", СокрЛП(Лев(СокрЛП(Знч.КодОКПО), 10)));
		КонецЕсли;
		// Бюджет.
		Если (Не ПустаяСтрока(Знч.КодБюджета)) Тогда
			ДанныеXDTO.Вставить("Бюджет", Новый Структура("Ссылка,Код", Знч.Бюджет, Знч.КодБюджета));
		КонецЕсли;	
	КонецЕсли;
	ФИББГУМенеджерОбменаПереопределяемый.Отправка_ПослеЗаполненияДанныхКонтрагента(ДанныеИБ,
																				   ДанныеXDTO,
																				   КомпонентыОбмена,
																				   СтекВыгрузки,
																				   Пропустить);

КонецПроцедуры

#КонецОбласти

#Область Справочник_КОСГУ

// Процедура добавляет обработчики для конвертации данных КОСГУ при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_КОСГУ_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_КОСГУ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.КОСГУ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.КОСГУ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Отправка";
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_ЛицевойСчет

// Процедура добавляет обработчики для конвертации данных лицевого счета при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ЛицевойСчет_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ЛицевойСчет_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ЛицевыеСчета;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ЛицевыеСчета";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_ЛицевойСчет_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "Код";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Владелец";
	НоваяСтрока.СвойствоФормата = "Владелец";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организация_Отправка";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидЛицевогоСчета";
	НоваяСтрока.СвойствоФормата = "ВидЛицевогоСчета";

КонецПроцедуры

// Обработчик конвертирует данные из лицевого счета в пакет XDTO.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.ЛицевыеСчета - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура ПКО_Справочник_ЛицевойСчет_Отправка_ПриОтправкеДанных(Знач ДанныеИБ,
															    Знач ДанныеXDTO,
																Знач КомпонентыОбмена,
																Знач СтекВыгрузки,
																Пропустить)
	Перем КС;

	// Заполнение свойств.
	КС = КлючевыеСвойства(ДанныеXDTO);
	// Номер лицевого счета.
	Если (Не ПустаяСтрока(ДанныеИБ.Код)) Тогда
		КС.Вставить("Код",  СокрЛП(Лев(СокрЛП(ДанныеИБ.Код), 20)));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Справочник_Мероприятие

// Процедура добавляет обработчики для конвертации данных мероприятия при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Мероприятие_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Мероприятие_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Мероприятия;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Мероприятия";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Мероприятие_Отправка";
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_Номенклатура

// Процедура добавляет обработчики для конвертации данных номенклатуры при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Номенклатура_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Номенклатура_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Номенклатура;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Номенклатура";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_ПрограммаЦелевыхСтатейКРБ

// Процедура добавляет обработчики для конвертации данных направления расходов при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ПрограммаЦелевойСтатьиКРБ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ПрограммыЦелевыхСтатейКРБ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ПрограммыЦелевыхСтатейКРБ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаНачалаДействия";
	НоваяСтрока.СвойствоФормата = "НачалоДействия";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОкончаниеДействия";
	НоваяСтрока.СвойствоФормата = "ОкончаниеДействия";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЦелеваяСтатья";
	НоваяСтрока.СвойствоФормата = "ЦелеваяСтатья";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЦелеваяСтатьяКРБ_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры

#КонецОбласти

#Область Справочник_Организация

// Процедура добавляет обработчики для конвертации данных организации при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Организация_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Организация_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Организации;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Учреждения";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_Организация_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИНН";
	НоваяСтрока.СвойствоФормата = "ИНН";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПП";
	НоваяСтрока.СвойствоФормата = "КПП";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "КодУчреждения";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "Наименование";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодОКАТО";
	НоваяСтрока.СвойствоФормата = "КодОКАТО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодОКТМО";
	НоваяСтрока.СвойствоФормата = "КодОКТМО";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодОКПО";
	НоваяСтрока.СвойствоФормата = "КодОКПО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодПоППП";
	НоваяСтрока.СвойствоФормата = "КодПоППП";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ГлаваПоБюджетнойКлассификации_Отправка";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Распорядитель";
	НоваяСтрока.СвойствоФормата = "Распорядитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагент_Отправка";
	
КонецПроцедуры

// Обработчик конвертирует данные из организации в пакет XDTO.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.Организации - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура ПКО_Справочник_Организация_Отправка_ПриОтправкеДанных(Знач ДанныеИБ,
															    Знач ДанныеXDTO,
																Знач КомпонентыОбмена,
																Знач СтекВыгрузки,
																Пропустить)
	Перем КС;

	// Заполнение свойств.
	КС = КлючевыеСвойства(ДанныеXDTO);
	// Код УБП.
	Если (Не ПустаяСтрока(ДанныеИБ.КодПоРПБС)) Тогда
		КС.Вставить("КодУчреждения", СокрЛП(Лев(СокрЛП(ДанныеИБ.КодПоРПБС), 8)));
	КонецЕсли;
	// Наименование.
	Если ПустаяСтрока(ДанныеИБ.НаименованиеСокращенное) Тогда
		ДанныеXDTO.Вставить("Наименование", ДанныеИБ.Наименование);
	Иначе
		ДанныеXDTO.Вставить("Наименование", ДанныеИБ.НаименованиеСокращенное);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Справочник_РазделПодразделКРБ

// Процедура добавляет обработчики для конвертации данных раздела, подраздела КРБ при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_РазделПодразделКРБ_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_РазделПодразделКРБ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.РазделыПодразделыКРБ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.РазделыПодразделыКРБ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_РазделПодразделКРБ_Отправка";
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_СтатьяКИФ

// Процедура добавляет обработчики для конвертации данных статьи КИФ при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_СтатьяКИФ_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, КонвертацияТабличнойЧасти, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_СтатьяКИФ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.СтатьиКИФ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.СтатьиКИФ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Владелец";
	НоваяСтрока.СвойствоФормата = "Владелец";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ГруппаПодгруппаКИФ_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаНачалаДействия";
	НоваяСтрока.СвойствоФормата = "НачалоДействия";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОкончаниеДействия";
	НоваяСтрока.СвойствоФормата = "ОкончаниеДействия";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Элемент";
	НоваяСтрока.СвойствоФормата = "ЭлементБюджета";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЭлементБюджета_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЭлементГруппа";
	НоваяСтрока.СвойствоФормата = "ЭлементГруппа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтатьяКИФ_Отправка";

	ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "ДопустимыеКОСГУ";
    КонвертацияТабличнойЧасти.ТЧФормата = "ДопустимыеКОСГУ";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КОСГУ";
	НоваяСтрока.СвойствоФормата = "КОСГУ";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Отправка";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры

#КонецОбласти

#Область Справочник_ЦелеваяСтатьяКРБ

// Процедура добавляет обработчики для конвертации данных программного (непрограммного) направления расходов при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ЦелеваяСтатьяКРБ_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ЦелеваяСтатьяКРБ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ЦелевыеСтатьиКРБ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ЦелевыеСтатьиКРБ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаНачалаДействия";
	НоваяСтрока.СвойствоФормата = "НачалоДействия";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОкончаниеДействия";
	НоваяСтрока.СвойствоФормата = "ОкончаниеДействия";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Отправка";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЦелеваяСтатьяКРБ_Отправка";
	
КонецПроцедуры

#КонецОбласти

#Область Справочник_ЭлементБюджета

// Процедура добавляет обработчики для конвертации данных элемента бюджета при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ЭлементБюджета_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ЭлементБюджета_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ЭлементыБюджета;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ЭлементыБюджета";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
КонецПроцедуры

#КонецОбласти

#Область Документ_БухгалтерскаяСправка

// Процедура добавляет обработчики для конвертации данных бухгалтерского регистра при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Документ_БухгалтерскаяСправка_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_БухгалтерскаяСправка_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ;
	ПравилоКонвертации.ОбъектФормата = "Документ.БухгалтерскаяСправка";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_БухгалтерскаяСправка_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоУникальномуИдентификатору";
	
КонецПроцедуры

// Функция возвращает код элемента справочника.
//
// Параметры:
//  Ссылка - СправочникСсылка.
//
// Возвращаемое значение :
//	Строка.
//
Функция ПолучитьКод(Знач Ссылка)
	
	Если (Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Ссылка))) Тогда
		Возврат "";
	ИначеЕсли Ссылка.Пустая() Тогда
		Возврат "";
	Иначе
		Возврат ФИББГУМенеджерОбменаПовтИсп.ПолучитьКод(Ссылка);
	КонецЕсли;	

КонецФункции

// Функция выполняет замену фиксированных структур на структуры и возвращает в результате.
//
// Параметры :
//	Значение - ФиксированнаяСтруктура.
//
// Возвращаемое значение :
//	Структура.
//
Функция ЗаменитьФиксированныеСтруктурыНаСтруктуры(Знач Значение)
	Перем Имена, Рез;
	
	Рез = Новый Структура(Значение);
	Имена = Новый Массив;
	Для Каждого Элем Из Рез Цикл
		Если (ТипЗнч(Элем.Значение) = Тип("ФиксированнаяСтруктура")) Тогда
			Имена.Добавить(Элем.Ключ);
		КонецЕсли;	
	КонецЦикла;
	Для Каждого Элем Из Имена Цикл
		Рез[Элем] = ЗаменитьФиксированныеСтруктурыНаСтруктуры(Рез[Элем]);
	КонецЦикла;
	Возврат Рез;
	
КонецФункции	
	
// Функция возвращает реквизиты КПС.
//
// Параметры:
//  Ссылка - СправочникСсылка.КлассификационныеПризнакиСчетов - классификационный признак счета.
//	ЭтоБМО - Булево - это обмен с БМО.
//
// Возвращаемое значение :
//	Структура, Неопределено.
//
Функция ПолучитьРеквизитыКПС(Знач Ссылка, Знач ЭтоБМО)
	Перем Рез;
	
	Если ЭтоБМО Тогда
		Рез = ФИББГУМенеджерОбменаПовтИсп.ПолучитьРеквизитыКПС(Ссылка, Ложь);
		Если (Рез = Неопределено) Тогда
			Возврат Рез;
		КонецЕсли;
		Рез = Новый Структура(Рез);
	Иначе
		Рез = ФИББГУМенеджерОбменаПовтИсп.ПолучитьРеквизитыКПС(Ссылка, Истина);
		Если (Рез = Неопределено) Тогда
			Возврат Рез;
		КонецЕсли;	
		Рез = ЗаменитьФиксированныеСтруктурыНаСтруктуры(Рез);
	КонецЕсли;
	Если ПустаяСтрока(Рез.Тип) Тогда
		Рез.Удалить("Тип");
	КонецЕсли;
	Возврат Рез;

КонецФункции

// Функция возвращает реквизиты справочника с кодом.
//
// Параметры:
//  Ссылка - СправочникСсылка.
//
// Возвращаемое значение :
//	Структура, Неопределено.
//
Функция ПолучитьРеквизитыКода(Знач Ссылка)
	Перем Код, Рез;
	
	Код = ПолучитьКод(Ссылка);
	Если ПустаяСтрока(Код) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Рез = Новый Структура;
	Рез.Вставить("Ссылка", Ссылка);	
	Рез.Вставить("Код", Код);
	Возврат Рез;
	
КонецФункции	

// Функция возвращает реквизиты учреждения.
//
// Параметры:
//  Ссылка - СправочникСсылка.Организации - учреждение.
//
// Возвращаемое значение :
//	Структура, Неопределено.
//
Функция ПолучитьРеквизитыОрганизации(Знач Ссылка)
	Перем Реквизиты, Рез, Стр;

	Реквизиты = ФИББГУМенеджерОбменаПовтИсп.ПолучитьРеквизитыКонтрагента(Ссылка);
	Если (Реквизиты = Неопределено) Тогда
		Возврат Неопределено;
	ИначеЕсли ПустаяСтрока(Реквизиты.Код) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	Рез = Новый Структура;
	Рез.Вставить("Ссылка", Ссылка);
	Рез.Вставить("Код", Реквизиты.Код);
	Если (Не ПустаяСтрока(Реквизиты.ИНН)) Тогда
		Рез.Вставить("ИНН", Реквизиты.ИНН);
		Если (Не ПустаяСтрока(Реквизиты.КПП)) Тогда
			Рез.Вставить("КПП", Реквизиты.КПП);
		КонецЕсли;	
	КонецЕсли;
	Если (Не ПустаяСтрока(Реквизиты.КодБюджета)) Тогда
		Стр = Новый Структура;
		Стр.Вставить("Ссылка", Реквизиты.Бюджет);
		Стр.Вставить("Код", Реквизиты.КодБюджета);
		Рез.Вставить("Бюджет", Стр);
	КонецЕсли;
	Возврат Рез;
	
КонецФункции	

// Функция возвращает реквизиты договора.
//
// Параметры:
//  Ссылка - СправочникСсылка.Договоры - договор.
//
// Возвращаемое значение :
//	Структура, Неопределено.
//
Функция ПолучитьРеквизитыДоговора(Знач Ссылка)
	Перем Рез, Знч;

	Если (ТипЗнч(Ссылка) <> Тип("СправочникСсылка.Договоры")) Тогда
		Возврат Неопределено;
	ИначеЕсли Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;	
	Рез = ФИББГУМенеджерОбменаПовтИсп.ПолучитьРеквизитыДоговора(Ссылка);
	Если (Рез = Неопределено) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	Рез = Новый Структура(Рез);
	Рез.Вставить("Ссылка", Ссылка);
	Знч = ПолучитьРеквизитыОрганизации(Рез.Организация);
	Если (Знч <> Неопределено) Тогда
		Рез.Вставить("Организация", Знч);
	КонецЕсли;
	Возврат Рез;
	
КонецФункции	

// Функция возвращает реквизиты контрагента.
//
// Параметры:
//  Ссылка - СправочникСсылка.Контрагенты - контрагент.
//
// Возвращаемое значение :
//	Структура, Неопределено.
//
Функция ПолучитьРеквизитыКонтрагента(Знач Ссылка)
	Перем Знч, Рез;

	Если (ТипЗнч(Ссылка) = Тип("СправочникСсылка.Договоры")) Тогда
		Если Ссылка.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;	
		Знч = ФИББГУМенеджерОбменаПовтИсп.ПолучитьРеквизитыКонтрагента(Ссылка);
	ИначеЕсли (ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты")) Тогда
		Если Ссылка.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;	
		Знч = ФИББГУМенеджерОбменаПовтИсп.ПолучитьРеквизитыКонтрагента(Ссылка);
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	Если (Знч = Неопределено) Тогда
		Возврат Неопределено;
	ИначеЕсли ПустаяСтрока(Знч.ИНН) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	Рез = Новый Структура;
	Рез.Вставить("Ссылка", Знч.Контрагент);
	Рез.Вставить("ИНН", Знч.ИНН);
	Если (Не ПустаяСтрока(Знч.КПП)) Тогда
		Рез.Вставить("КПП", Знч.КПП);
	КонецЕсли;
	Если (Не ПустаяСтрока(Знч.Код)) Тогда
		Рез.Вставить("КодУчреждения", Знч.Код);
	КонецЕсли;
	Возврат Рез;
	
КонецФункции	

// Функция возвращает реквизиты контрагента.
//
// Параметры:
//  Ссылка - СправочникСсылка.Контрагенты - контрагент.
//
// Возвращаемое значение :
//	Структура, Неопределено.
//
Функция ПолучитьРеквизитыЛицевогоСчета(Знач Ссылка)
	Перем Код, Владелец, Рез;

	Если (ТипЗнч(Ссылка) <> Тип("СправочникСсылка.ЛицевыеСчета")) Тогда
		Возврат Неопределено;
	ИначеЕсли Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Код = ФИББГУМенеджерОбменаПовтИсп.ПолучитьКод(Ссылка);
	Если ПустаяСтрока(Код) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Владелец = ФИББГУМенеджерОбменаПовтИсп.ПолучитьВладельца(Ссылка);
	Владелец = ПолучитьРеквизитыОрганизации(Владелец);
	Если (Владелец = Неопределено) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	Рез = Новый Структура;
	Рез.Вставить("Ссылка", Ссылка);
	Рез.Вставить("Владелец", Владелец);
	Рез.Вставить("Код", СокрЛП(Лев(СокрЛП(Код), 20)));
	Возврат Рез;
	
КонецФункции	

// Функция проверяет наличие реквизитов в структуре.
// 
// Параметры :
//	Реквизиты - Структура.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
// Возвращаемое значение :
//	Булево.
//
Функция ПустыеРеквизиты(Знач Реквизиты, Знач КомпонентыОбмена)
	Перем Элем, Рез, Удалить, Длины, Знч;
	
	Рез = Истина;
	Удалить = Новый Массив;
	Для Каждого Элем Из Реквизиты Цикл
		Если ПустаяСтрока(Элем.Значение) Тогда
			Удалить.Добавить(Элем.Ключ);
		Иначе
			Рез = Ложь;
		КонецЕсли;
	КонецЦикла;
	Если (Не Рез) Тогда
		Для Каждого Элем Из Удалить Цикл
			Реквизиты.Удалить(Элем);
		КонецЦикла;
		Длины = КомпонентыОбмена.ПараметрыКонвертации.ОграниченияДлиныПлатежныхРеквизитов;
		Если (Длины = Неопределено) Тогда
			Длины = Новый Структура;
			Длины.Вставить("Плательщик", 160);
			Длины.Вставить("ПлательщикИНН", 12);
			Длины.Вставить("ПлательщикКПП", 9);
			Длины.Вставить("ПлательщикРС", 20);
			Длины.Вставить("ПлательщикБИК", 9);
			Длины.Вставить("ПлательщикБанк", 160);
			Длины.Вставить("ПлательщикКоррсчет", 20);
			Длины.Вставить("Получатель", 160);
			Длины.Вставить("ПолучательИНН", 12);
			Длины.Вставить("ПолучательКПП", 9);
			Длины.Вставить("ПолучательРС", 20);
			Длины.Вставить("ПолучательБИК", 9);
			Длины.Вставить("ПолучательБанк", 160);
			Длины.Вставить("ПолучательКоррсчет", 20);
			Длины.Вставить("НазначениеПлатежа", 210);
			Длины.Вставить("УИН", 25);
			Длины.Вставить("ПНСтатусСоставителя", 2);
			Длины.Вставить("ПНКодБК", 20);
			Длины.Вставить("ПНПоказательОснования", 2);
			Длины.Вставить("ПНПоказательПериода", 10);
			Длины.Вставить("ПНПоказательТипа", 2);
			Длины.Вставить("ПНПоказательНомера", 18);
			Длины.Вставить("ПНПоказательДаты", 10);
			КомпонентыОбмена.ПараметрыКонвертации.ОграниченияДлиныПлатежныхРеквизитов = Длины;
		КонецЕсли;	
		Для Каждого Элем Из Длины Цикл
			Если Реквизиты.Свойство(Элем.Ключ, Знч) Тогда
				Если (СтрДлина(Знч) > Элем.Значение) Тогда
					Знч = Лев(СокрЛП(Знч), Элем.Значение);
					Реквизиты.Вставить(Элем.Ключ, Знч);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Рез;

КонецФункции

// Процедура выполняет добавление данных о платежных реквизитах.
// 
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	Ссылка - ДокументСсылка - регистратор.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ДобавитьРеквизитыПлатежныхДокументов(Знач ДанныеXDTO, Знач Ссылка, Знач КомпонентыОбмена)
	Перем Тип, Реквизиты, РеквизитыПД, Направление;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	ФИББГУМенеджерОбменаПереопределяемый.Отправка_ПередДобавлениемРеквизитовПлатежныхДокументов(ДанныеXDTO, Ссылка, КомпонентыОбмена);
	Тип = ТипЗнч(Ссылка);
	Если (Тип = Тип("ДокументСсылка.ЗаявкаНаВозврат")) Тогда
		Направление = "1";
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Получатель", "КонтрагентНаименование");
		Реквизиты.Вставить("ПолучательИНН", "КонтрагентИНН");
		Реквизиты.Вставить("ПолучательКПП", "КонтрагентКПП");
		Реквизиты.Вставить("ПолучательРС", "КонтрагентБанковскийСчет");
		Реквизиты.Вставить("ПолучательБИК", "КонтрагентБИКБанка");
		Реквизиты.Вставить("ПолучательБанк", "КонтрагентНаименованиеБанка");
		Реквизиты.Вставить("ПолучательКоррсчет", "КонтрагентКорСчетБанка");
		Реквизиты.Вставить("НазначениеПлатежа", "НазначениеПлатежа");
	ИначеЕсли (Тип = Тип("ДокументСсылка.ЗаявкаНаКассовыйРасход")) Тогда
		Направление = "1";
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("ПлательщикИНН", "ИННПлательщика");
		Реквизиты.Вставить("ПлательщикКПП", "КПППлательщика");
		Реквизиты.Вставить("Получатель", "КонтрагентНаименование");
		Реквизиты.Вставить("ПолучательИНН", "КонтрагентИНН");
		Реквизиты.Вставить("ПолучательКПП", "КонтрагентКПП");
		Реквизиты.Вставить("ПолучательРС", "КонтрагентБанковскийСчет");
		Реквизиты.Вставить("ПолучательБИК", "КонтрагентБИКБанка");
		Реквизиты.Вставить("ПолучательБанк", "КонтрагентНаименованиеБанка");
		Реквизиты.Вставить("ПолучательКоррсчет", "КонтрагентКорСчетБанка");
		Реквизиты.Вставить("НазначениеПлатежа", "НазначениеПлатежа");
		Реквизиты.Вставить("КодВидаДохода", "КодВидаДохода");
		Реквизиты.Вставить("ПНСтатусСоставителя", "СтатусСоставителя");
		Реквизиты.Вставить("ПНКодБК", "КодБКНалога");
		Реквизиты.Вставить("ПНКодОКАТО", "КодОКАТО");
		Реквизиты.Вставить("ПНПоказательОснования", "ПоказательОснования");
		Реквизиты.Вставить("ПНПоказательПериода", "ПоказательПериода");
		Реквизиты.Вставить("ПНПоказательТипа", "ПоказательТипа");
		Реквизиты.Вставить("ПНПоказательНомера", "ПоказательНомера");
		Реквизиты.Вставить("ПНПоказательДаты", "ПоказательДаты");
	ИначеЕсли (Тип = Тип("ДокументСсылка.ЗаявкаНаКассовыйРасходСокращенная")) Тогда
		Направление = "1";
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("ПлательщикИНН", "ИННПлательщика");
		Реквизиты.Вставить("ПлательщикКПП", "КПППлательщика");
		Реквизиты.Вставить("Получатель", "КонтрагентНаименование");
		Реквизиты.Вставить("ПолучательИНН", "КонтрагентИНН");
		Реквизиты.Вставить("ПолучательКПП", "КонтрагентКПП");
		Реквизиты.Вставить("ПолучательРС", "КонтрагентБанковскийСчет");
		Реквизиты.Вставить("ПолучательБИК", "КонтрагентБИКБанка");
		Реквизиты.Вставить("ПолучательБанк", "КонтрагентНаименованиеБанка");
		Реквизиты.Вставить("ПолучательКоррсчет", "КонтрагентКорСчетБанка");
		Реквизиты.Вставить("НазначениеПлатежа", "НазначениеПлатежа");
		Реквизиты.Вставить("КодВидаДохода", "КодВидаДохода");
		Реквизиты.Вставить("ПНСтатусСоставителя", "СтатусСоставителя");
		Реквизиты.Вставить("ПНКодБК", "КодБКНалога");
		Реквизиты.Вставить("ПНКодОКАТО", "КодОКАТО");
		Реквизиты.Вставить("ПНПоказательОснования", "ПоказательОснования");
		Реквизиты.Вставить("ПНПоказательПериода", "ПоказательПериода");
		Реквизиты.Вставить("ПНПоказательТипа", "ПоказательТипа");
		Реквизиты.Вставить("ПНПоказательНомера", "ПоказательНомера");
		Реквизиты.Вставить("ПНПоказательДаты", "ПоказательДаты");
	ИначеЕсли (Тип = Тип("ДокументСсылка.КассовоеВыбытие")) Тогда
		Направление = "1";
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Получатель", "ПолучательПлатежа.Наименование");
		Реквизиты.Вставить("ПолучательИНН", "ПолучательПлатежа.ИНН");
		Реквизиты.Вставить("ПолучательКПП", "ПолучательПлатежа.КПП");
		Реквизиты.Вставить("ПолучательРС", "СчетКонтрагента.Код");
		Реквизиты.Вставить("ПолучательБИК", "СчетКонтрагента.КассовыйОрган.Код");
		Реквизиты.Вставить("ПолучательБанк", "СчетКонтрагента.КассовыйОрган.Наименование");
		Реквизиты.Вставить("ПолучательКоррсчет", "СчетКонтрагента.КассовыйОрган.КоррСчет");
		Реквизиты.Вставить("НазначениеПлатежа", "НазначениеПлатежа");
	ИначеЕсли (Тип = Тип("ДокументСсылка.КассовоеПоступление")) Тогда
		Направление = "2";
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Плательщик", "Плательщик.Наименование");
		Реквизиты.Вставить("ПлательщикИНН", "Плательщик.ИНН");
		Реквизиты.Вставить("ПлательщикКПП", "Плательщик.КПП");
		Реквизиты.Вставить("ПлательщикРС", "СчетКонтрагента.Код");
		Реквизиты.Вставить("ПлательщикБИК", "СчетКонтрагента.КассовыйОрган.Код");
		Реквизиты.Вставить("ПлательщикБанк", "СчетКонтрагента.КассовыйОрган.Наименование");
		Реквизиты.Вставить("ПлательщикКоррсчет", "СчетКонтрагента.КассовыйОрган.КоррСчет");
		Реквизиты.Вставить("НазначениеПлатежа", "НазначениеПлатежа");
	ИначеЕсли (Тип = Тип("ДокументСсылка.ПлатежноеПоручение")) Тогда
		Направление = "1";
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Плательщик", "ПлательщикНаименование");
		Реквизиты.Вставить("ПлательщикИНН", "ИННПлательщика");
		Реквизиты.Вставить("ПлательщикКПП", "КПППлательщика");
		Реквизиты.Вставить("ПлательщикРС", "ПлательщикБанковскийСчет");
		Реквизиты.Вставить("ПлательщикБИК", "ПлательщикБИКБанка");
		Реквизиты.Вставить("ПлательщикБанк", "ПлательщикНаименованиеБанка");
		Реквизиты.Вставить("ПлательщикКоррсчет", "ПлательщикКорСчетБанка");
		Реквизиты.Вставить("Получатель", "КонтрагентНаименование");
		Реквизиты.Вставить("ПолучательИНН", "КонтрагентИНН");
		Реквизиты.Вставить("ПолучательКПП", "КонтрагентКПП");
		Реквизиты.Вставить("ПолучательРС", "КонтрагентБанковскийСчет");
		Реквизиты.Вставить("ПолучательБИК", "КонтрагентБИКБанка");
		Реквизиты.Вставить("ПолучательБанк", "КонтрагентНаименованиеБанка");
		Реквизиты.Вставить("ПолучательКоррсчет", "КонтрагентКорСчетБанка");
		Реквизиты.Вставить("НазначениеПлатежа", "НазначениеПлатежа");
		Реквизиты.Вставить("КодВидаДохода", "КодВидаДохода");
		Реквизиты.Вставить("ИдентификаторКонтракта", "ИдентификаторГосКонтракта");
		Реквизиты.Вставить("НомерАккредитива", "НомерАккредитива");
		Реквизиты.Вставить("УИН", "ИдентификаторПлатежа");
		Реквизиты.Вставить("ПНСтатусСоставителя", "СтатусСоставителя");
		Реквизиты.Вставить("ПНКодБК", "КодБКНалога");
		Реквизиты.Вставить("ПНКодОКАТО", "КодОКАТО");
		Реквизиты.Вставить("ПНПоказательОснования", "ПоказательОснования");
		Реквизиты.Вставить("ПНПоказательПериода", "ПоказательПериода");
		Реквизиты.Вставить("ПНПоказательТипа", "ПоказательТипа");
		Реквизиты.Вставить("ПНПоказательНомера", "ПоказательНомера");
		Реквизиты.Вставить("ПНПоказательДаты", "ПоказательДаты");
	Иначе
		Возврат;
	КонецЕсли;

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);

	Если ПустыеРеквизиты(Реквизиты, КомпонентыОбмена) Тогда
		Возврат;
	КонецЕсли;

	Если (Не ПустаяСтрока(Направление)) Тогда
		Реквизиты.Вставить("Направление", Направление);
	КонецЕсли;

	РеквизитыПД = Новый Массив;
	РеквизитыПД.Добавить(Реквизиты);
	ДанныеXDTO.Вставить("РеквизитыПлатежныхДокументов", РеквизитыПД);

КонецПроцедуры

// Процедура выполняет заполнение корреспонденции счета по значению одного субконто.
//
// Параметры :
//	ЭлемXDTO - Структура - с данными объекта XDTO.
//	Субконто - значение субконто.
//	КтДт - Строка - субконто по дебету/кредиту.
// 
Процедура ЗаполнитьОдноСубконто(Знач ЭлемXDTO, Знач Субконто, Знач КтДт)
	Перем Знч;

	// Заполнение по реквизиту.
	Знч = ТипЗнч(Субконто);
	Если (Знч = Тип("СправочникСсылка.Контрагенты")) Тогда
		Знч = ПолучитьРеквизитыКонтрагента(Субконто);
		Если (Знч <> Неопределено) Тогда
			ЭлемXDTO.Вставить("Контрагент" + КтДт, Знч);
		КонецЕсли;
	ИначеЕсли (Знч = Тип("СправочникСсылка.Договоры")) Тогда
		Знч = ПолучитьРеквизитыДоговора(Субконто);
		Если (Знч <> Неопределено) Тогда
			ЭлемXDTO.Вставить("Договор" + КтДт, Знч);
		КонецЕсли;	
		Знч = ПолучитьРеквизитыКонтрагента(Субконто);
		Если (Знч <> Неопределено) Тогда
			ЭлемXDTO.Вставить("Контрагент" + КтДт, Знч);
		КонецЕсли;
	ИначеЕсли (Знч = Тип("СправочникСсылка.РазделыЛицевыхСчетов")) Тогда
		Если (Не Субконто.Пустая()) Тогда
			Знч = ФИББГУМенеджерОбменаПовтИсп.ПолучитьВладельца(Субконто);
			Знч = ПолучитьРеквизитыЛицевогоСчета(Знч);
			Если (Знч <> Неопределено) Тогда
				ЭлемXDTO.Вставить("ЛицевойСчет" + КтДт, Знч);
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли (Знч = Тип("СправочникСсылка.ЛицевыеСчета")) Тогда
		Знч = ПолучитьРеквизитыЛицевогоСчета(Субконто);
		Если (Знч <> Неопределено) Тогда
			ЭлемXDTO.Вставить("ЛицевойСчет" + КтДт, Знч);
		КонецЕсли;
	ИначеЕсли (Знч = Тип("СправочникСсылка.ВидыЦелевыхСредств")) Тогда
		Знч = ПолучитьРеквизитыКода(Субконто);
		Если (Знч <> Неопределено) Тогда
			ЭлемXDTO.Вставить("ВидЦелевых" + КтДт, Знч);
		КонецЕсли;
	ИначеЕсли (Знч = Тип("СправочникСсылка.Мероприятия")) Тогда
		Знч = ПолучитьРеквизитыКода(Субконто);
		Если (Знч <> Неопределено) Тогда
			ЭлемXDTO.Вставить("Мероприятие" + КтДт, Знч);
		КонецЕсли;
	ИначеЕсли (Знч = Тип("СправочникСсылка.Номенклатура")) Тогда
		Знч = ФИББГУМенеджерОбменаПовтИсп.ПолучитьРеквизитыНоменклатуры(Субконто);
		Если (Знч <> Неопределено) Тогда
			Знч = Новый Структура(Знч);
			Знч.Вставить("Ссылка", Субконто);
			ЭлемXDTO.Вставить("Номенклатура" + КтДт, Знч);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	
	
// Процедура выполняет заполнение корреспонденции счета по субконто.
//
// Параметры :
//	ЭлемXDTO - Структура - с данными объекта XDTO.
//	Запись - РегистрБухгалтерииЗапись - обрабатываемая запись информационной базы.
//	КтДт - Строка - субконто по дебету/кредиту.
//	ВО - Массив - заполнить субконто (внешние объекты).
// 
Процедура ЗаполнитьПоСубконто(Знач ЭлемXDTO, Знач Запись, Знач КтДт, Знач ВО)
	Перем Субконто, СубконтоКтДт, Знч, Вид, КС, РЛС;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Если (КтДт = "Дт") Тогда
		Субконто = Запись.ХарактеристикаДвиженияДт;
		СубконтоКтДт = Запись.СубконтоДт;
	Иначе
		Субконто = Запись.ХарактеристикаДвиженияКт;
		СубконтоКтДт = Запись.СубконтоКт;
	КонецЕсли;                       
	ФИББГУМенеджерОбменаПереопределяемый.Отправка_ПередЗаполнениемПоСубконто(ЭлемXDTO, Запись, КтДт, Субконто, СубконтоКтДт);
	Если (Субконто <> Неопределено) Тогда
		ЗаполнитьОдноСубконто(ЭлемXDTO, Субконто, КтДт);
	КонецЕсли;	
	Если (СубконтоКтДт <> Неопределено) Тогда
		Если (ВО = Неопределено) Тогда
			Для Каждого Субконто Из СубконтоКтДт Цикл
				ЗаполнитьОдноСубконто(ЭлемXDTO, Субконто.Значение, КтДт);
			КонецЦикла;
		Иначе	
			РЛС = ПланыВидовХарактеристик.ВидыСубконто.РазделыЛицевыхСчетов;
			Для Каждого Субконто Из СубконтоКтДт Цикл
				Знч = Субконто.Значение;
				ЗаполнитьОдноСубконто(ЭлемXDTO, Знч, КтДт);
				Если (Субконто.Ключ = РЛС) Тогда
					Продолжить;
				КонецЕсли;	
				Вид = ВидСубконтоСтр(ТипЗнч(Знч));
				Если ПустаяСтрока(Вид) Тогда
					Продолжить;
				ИначеЕсли Знч.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				ЭлемXDTO.Вставить("КлючСтроки", Запись.НомерСтроки);
				КС = Новый Структура;
				КС.Вставить("Ссылка", Знч);
				Знч = Новый Структура;
				Знч.Вставить("КлючевыеСвойства", КС);
				Знч.Вставить("Вид", Вид);
				Знч.Вставить("Ключ", Запись.НомерСтроки);
				ВО.Добавить(Знч);
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;	
	ФИББГУМенеджерОбменаПереопределяемый.Отправка_ПослеЗаполненияПоСубконто(ЭлемXDTO, Запись, КтДт);

КонецПроцедуры

// Процедура записывает в файл обмена информацию об удалении объекта.
//
// Параметры :
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	ИмяТипа - Строка - имя типа объекта.
//	Ссылка - ДокументСсылка - ссылка на удаляемый объект.
//
Процедура ЗаписатьУдалениеОбъектаXDTO(Знач КомпонентыОбмена, Знач ИмяТипа, Знач Ссылка)
	Перем тоУдалениеОбъекта, тоЛюбаяСсылка, сЛюбаяСсылка, тоСсылкаНаОбъект;
	Перем Объект, сОбъект, тоОбъект, ОбъектУО, Элем;

	тоУдалениеОбъекта  = ФабрикаXDTO.Тип(КомпонентыОбмена.XMLСхема, "УдалениеОбъекта");
	Если (тоУдалениеОбъекта = Неопределено) Тогда
		Возврат;
	КонецЕсли;	
	сЛюбаяСсылка = тоУдалениеОбъекта.Свойства[0];
	тоЛюбаяСсылка = сЛюбаяСсылка.Тип;
	тоСсылкаНаОбъект = тоЛюбаяСсылка.Свойства[0].Тип;
	тоОбъект = Неопределено;
	сОбъект = Неопределено;
	Для Каждого Элем Из тоСсылкаНаОбъект.Свойства Цикл
		Если (Элем.Имя = ИмяТипа) Тогда
			сОбъект = Элем;
			тоОбъект = Элем.Тип;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	Если (тоОбъект = Неопределено) Тогда
		Возврат;
	КонецЕсли;	
	Элем = ФабрикаXDTO.Создать(тоОбъект, СокрЛП(Ссылка.УникальныйИдентификатор()));
	Объект = ФабрикаXDTO.Создать(тоЛюбаяСсылка);
	Объект.СсылкаНаОбъект = ФабрикаXDTO.Создать(тоСсылкаНаОбъект);
	Объект.СсылкаНаОбъект.Установить(сОбъект, Элем);
	ОбъектУО = ФабрикаXDTO.Создать(тоУдалениеОбъекта);
	ОбъектУО.СсылкаНаОбъект = ФабрикаXDTO.Создать(тоЛюбаяСсылка);
	ОбъектУО.Установить(сЛюбаяСсылка, Объект);
	ФабрикаXDTO.ЗаписатьXML(КомпонентыОбмена.ФайлОбмена, ОбъектУО);

КонецПроцедуры

// Обработчик конвертирует данные из бухгалтерского регистра в пакет XDTO.
// 
// Параметры :
//	ДанныеИБ - РегистрБухгалтерииНаборЗаписей - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура ПКО_Документ_БухгалтерскаяСправка_Отправка_ПриОтправкеДанных(Знач ДанныеИБ,
																	   Знач ДанныеXDTO,
																	   Знач КомпонентыОбмена,
																	   Знач СтекВыгрузки,
																	   Пропустить)
	Перем Проводки, Запись, Элем, Знч, Таб, Стр, ЭтоБМО;
	Перем Регистратор, МД, ДатаДок, ВОДт, ВОКт;
	Перем Организация, ИФО, УточнениеПериода;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	// Если начальная регистрация не начата, то нет смысла выгружать (изменения зарегистрируются при начальной регистрации).
	Если (Не РегистрацияНачата(КомпонентыОбмена)) Тогда
		Пропустить = Истина;
		Возврат;
	КонецЕсли;	
	// Получение регистратора.
	Регистратор = Регистратор(ДанныеИБ);
	Если (Регистратор = Неопределено) Тогда
		Пропустить = Истина;
		Возврат;
	ИначеЕсли (Не ОбщегоНазначения.СсылкаСуществует(Регистратор)) Тогда
		ЗаписатьУдалениеОбъектаXDTO(КомпонентыОбмена, "БухгалтерскаяСправкаСсылка", Регистратор);
		Пропустить = Истина;
		Возврат;
	КонецЕсли;
	МД = Регистратор.Метаданные();
	ДанныеXDTO.КлючевыеСвойства.Вставить("Ссылка", Регистратор.УникальныйИдентификатор());
	Таб = ДанныеИБ;
	Знч = Новый Структура;
	Знч.Вставить("Представление");
	Для Каждого Элем Из МД.СтандартныеРеквизиты Цикл
		Если (Элем.Имя = "Номер") Тогда
			Знч.Вставить(Элем.Имя);
		ИначеЕсли (Элем.Имя = "Дата") Тогда
			Знч.Вставить(Элем.Имя);
		КонецЕсли;
	КонецЦикла;
	Если (МД.Реквизиты.Найти("Организация") <> Неопределено) Тогда
		Знч.Вставить("Организация");
	КонецЕсли;
	Если (МД.Реквизиты.Найти("ИФО") <> Неопределено) Тогда
		Знч.Вставить("ИФО");
	КонецЕсли;
	Если (МД.Реквизиты.Найти("ВидМежотчетногоПериода") <> Неопределено) Тогда
		Знч.Вставить("ВидМежотчетногоПериода");
	КонецЕсли;
	Элем = ТипЗнч(Регистратор);
	Стр = (Элем = Тип("ДокументСсылка.ОперацияБух"));
	Стр = Стр Или (Элем = Тип("ДокументСсылка.БюджетныеДанные"));
	Стр = Стр Или (Элем = Тип("ДокументСсылка.КассовоеВыбытие"));
	Стр = Стр Или (Элем = Тип("ДокументСсылка.КассовоеПоступление"));
	Стр = Стр Или (Элем = Тип("ДокументСсылка.РасходноеРасписание"));
	Стр = Стр Или (Элем = Тип("ДокументСсылка.РегистрацияОбязательствИСведенийПоДоговорам"));
	Если (Стр И (МД.Реквизиты.Найти("ИДИсточника") <> Неопределено)) Тогда
		Знч.Вставить("ИДИсточника");
	КонецЕсли;
	Знч = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Регистратор, Знч);
	Если (Знч.Свойство("ИДИсточника") И ЭтоОбъектИзБМО(Знч.ИДИсточника)) Тогда
		Пропустить = Истина;
		УдалитьРегистрацию(ДанныеИБ, КомпонентыОбмена);
		Возврат;
	ИначеЕсли (ДанныеИБ.Количество() = 0) Тогда
		ЗаписатьУдалениеОбъектаXDTO(КомпонентыОбмена, "БухгалтерскаяСправкаСсылка", Регистратор);
		Пропустить = Истина;
		Возврат;
	КонецЕсли;
	// Представление документа.
	Если (Знч.Свойство("Представление") И (Не ПустаяСтрока(Знч.Представление))) Тогда
		ДанныеXDTO.Вставить("ПредставлениеДокумента", Лев(СокрЛП(Знч.Представление), 255));
	Иначе
		ДанныеXDTO.Вставить("ПредставлениеДокумента", "-");
	КонецЕсли;
	// Номер документа.
	Если (Знч.Свойство("Номер") И (Не ПустаяСтрока(Знч.Номер))) Тогда
		ДанныеXDTO.Вставить("НомерДокумента", СокрЛП(Знч.Номер));
	КонецЕсли;
	// Дата документа.
	Если (Знч.Свойство("Дата") И ЗначениеЗаполнено(Знч.Дата)) Тогда
		ДатаДок = Знч.Дата;
		ДанныеXDTO.Вставить("ДатаДокумента", ДатаДок);
	Иначе
		ДатаДок = Неопределено;
	КонецЕсли;
	// Организация.
	Если Знч.Свойство("Организация") Тогда
		Организация = Знч.Организация;
		Если (ТипЗнч(Организация) <> Тип("СправочникСсылка.Организации")) Тогда
			Организация = Неопределено;
		ИначеЕсли Организация.Пустая() Тогда	
			Организация = Неопределено;
		КонецЕсли;	
	Иначе
		Организация = Неопределено;
	КонецЕсли;
	// Код главы (источник финансового обеспечения).
	Если Знч.Свойство("ИФО") Тогда
		ИФО = Знч.ИФО;
		Если (ТипЗнч(ИФО) <> Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения")) Тогда
			ИФО = Неопределено;
		ИначеЕсли ИФО.Пустая() Тогда	
			ИФО = Неопределено;
		КонецЕсли;	
	Иначе	
		ИФО = Неопределено;
	КонецЕсли;
	// Межотчетный период.
	Если (ДатаДок = Неопределено) Тогда
		УточнениеПериода = Null;
	ИначеЕсли Знч.Свойство("ВидМежотчетногоПериода") Тогда
		УточнениеПериода = БухгалтерскийУчет.ЗначениеУточненияПериода(Знч.ВидМежотчетногоПериода);
	Иначе
		УточнениеПериода = Неопределено;
	КонецЕсли;
	ЭтоБМО = (КомпонентыОбмена.УзелКорреспондентаОбъект.ЭтоБМО = Истина);
	// Заполнение общих реквизитов по проводкам.
	Для Каждого Запись Из Таб Цикл
		Знч = Истина;
		// Учреждение.
		Если (Запись.Организация = Организация) Тогда
			Знч = Ложь;
		ИначеЕсли (Организация = Неопределено) Тогда
			Знч = Ложь;
			Организация = Запись.Организация;
		Иначе
			Организация = Null;
		КонецЕсли;
		// Код главы.
		Если (Запись.ИФО = ИФО) Тогда
			Знч = Ложь;
		ИначеЕсли (ИФО = Неопределено) Тогда
			Знч = Ложь;
			ИФО = Запись.ИФО;
		Иначе
			ИФО = Null;
		КонецЕсли;
		// Межотчетный период.
		Если (Запись.Период <> ДатаДок) Тогда
			УточнениеПериода = Null;
		ИначеЕсли (Запись.УточнениеПериода = УточнениеПериода) Тогда
			Знч = Ложь;
		ИначеЕсли (УточнениеПериода = Неопределено) Тогда
			Знч = Ложь;
			УточнениеПериода = Запись.УточнениеПериода;
		Иначе
			УточнениеПериода = Null;
		КонецЕсли;
		Если Знч Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	// Организкция.
	Если ((Организация <> Неопределено) И (Организация <> Null)) Тогда
		Знч = ПолучитьРеквизитыОрганизации(Организация);
		Если (Знч <> Неопределено) Тогда
			ДанныеXDTO.Вставить("Организация", Знч);
		КонецЕсли;
	КонецЕсли;
	// ИФО.
	Если ((ИФО <> Неопределено) И (ИФО <> Null)) Тогда
		Знч = ФИББГУМенеджерОбменаПовтИсп.ПолучитьППП(ИФО);
		Если (Знч = "000") Тогда
			Знч = ФИББГУМенеджерОбменаПовтИсп.ПолучитьППП(Организация);
		КонецЕсли;
		Если (Знч <> "000") Тогда
			ДанныеXDTO.Вставить("ИФО", Новый Структура("КодГлавыБК", Новый Структура("Код", Знч)));
		КонецЕсли;
	КонецЕсли;
	// Межотчетный период.
	Если ((УточнениеПериода <> Неопределено)
	   И  (УточнениеПериода <> Null)
	   И  (УточнениеПериода <> 0)) Тогда
		ДанныеXDTO.Вставить("УточнениеПериода", УточнениеПериода);
	КонецЕсли;
	// Определение необходимости выгрузки внешних объектов.
	Знч = (ЭтоБМО И (КомпонентыОбмена.УзелКорреспондентаОбъект.РежимВыгрузкиРасш = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости));
	Если Знч Тогда
		ВОДт = Новый Массив;
		ВОКт = Новый Массив;
	Иначе
		ВОДт = Неопределено;
		ВОКт = Неопределено;
	КонецЕсли;	
	Проводки = Новый Массив;
	Для Каждого Запись Из Таб Цикл
		Элем = Новый Структура;
		// Суммы.
		Если (Запись.Сумма <> 0) Тогда
			Элем.Вставить("Сумма", Запись.Сумма);
		КонецЕсли;
		Если ЗначениеЗаполнено(Запись.ВалютнаяСуммаДт) Тогда
			Элем.Вставить("СуммаВВалютеДт", Запись.ВалютнаяСуммаДт);
		КонецЕсли;
		Если ЗначениеЗаполнено(Запись.ВалютнаяСуммаКт) Тогда
			Элем.Вставить("СуммаВВалютеКт", Запись.ВалютнаяСуммаКт);
		КонецЕсли;
		Если (Элем.Количество() = 0) Тогда
			Продолжить;
		КонецЕсли;
		// Период.
		Знч = Запись.Период;
		Если (Знч <> ДатаДок) Тогда
			Элем.Вставить("Период", Знч);
		КонецЕсли;
		// Уточнение периода.
		Знч = Запись.УточнениеПериода;
		Если ((Знч <> 0) И (Знч <> УточнениеПериода)) Тогда
			Элем.Вставить("УточнениеПериода", Знч);
		КонецЕсли;
		// Балансовые измерения.
		// Номер журнала.
		Знч = ПолучитьКод(Запись.ЖурналОпераций);
		Если (Не ПустаяСтрока(Знч)) Тогда
			Элем.Вставить("НомерЖурнала", Знч);
		КонецЕсли;
		// КФО.
		Знч = ФИББГУМенеджерОбменаПовтИсп.ПолучитьКодКФО(Запись.КФО);
		Если (Не ПустаяСтрока(Знч)) Тогда
			Элем.Вставить("КФО", Знч);
		КонецЕсли;
		// Реквизиты.
		Знч = СокрЛП(Запись.Содержание);
		Если (Не ПустаяСтрока(Знч)) Тогда
			Элем.Вставить("Содержание", Знч);
		КонецЕсли;
		// Вид документа.
		Знч = СокрЛП(Запись.ВидПервичногоДокумента);
		Если (Не ПустаяСтрока(Знч)) Тогда
			Элем.Вставить("ВидДокумента", Знч);
		КонецЕсли;
		// Номер документа.
		Знч = СокрЛП(Запись.НомерПервичногоДокумента);
		Если (Не ПустаяСтрока(Знч)) Тогда
			Элем.Вставить("НомерДокумента", СокрЛП(Прав(Знч, 50)));
		КонецЕсли;
		// Дата документа.
		Знч = Запись.ДатаПервичногоДокумента;
		Если ЗначениеЗаполнено(Знч) Тогда
			Элем.Вставить("ДатаДокумента", Знч);
		КонецЕсли;
		// Корреспонденция по дебету.
		Знч = Лев(СокрЛП(Запись.СчетДт), 6);
		Если (Не ПустаяСтрока(Знч)) Тогда
			Элем.Вставить("СчетДт", Новый Структура("Код", Знч));
		КонецЕсли;
		// КПС.
		Знч = ПолучитьРеквизитыКПС(Запись.КПСДт, ЭтоБМО);
		Если (Знч <> Неопределено) Тогда
			Элем.Вставить("КПСДт", Знч);
		КонецЕсли;
		// КОСГУ.
		Знч = ПолучитьРеквизитыКода(Запись.КЭКДт);
		Если (Знч <> Неопределено) Тогда
			Элем.Вставить("КЭКДт", Знч);
		КонецЕсли;
		// Валюта.
		Если ЗначениеЗаполнено(Запись.ВалютаДт) Тогда
			Знч = ФИББГУМенеджерОбменаПовтИсп.ПолучитьРеквизитыВалюты(Запись.ВалютаДт);
			Если (Знч <> Неопределено) Тогда
				Знч = Новый Структура(Знч);
				Знч.Вставить("Ссылка", Запись.ВалютаДт);
				Элем.Вставить("ВалютаДт", Знч);
			КонецЕсли;
		КонецЕсли;
		// Заполнение корреспонденции счета по субконто.
		ЗаполнитьПоСубконто(Элем, Запись, "Дт", ВОДт);
		// Корреспонденция по кредиту.
		Знч = Лев(СокрЛП(Запись.СчетКт), 6);
		Если (Не ПустаяСтрока(Знч)) Тогда
			Элем.Вставить("СчетКт", Новый Структура("Код", Знч));
		КонецЕсли;
		// КБК.
		Знч = ПолучитьРеквизитыКПС(Запись.КПСКт, ЭтоБМО);
		Если (Знч <> Неопределено) Тогда
			Элем.Вставить("КПСКт", Знч);
		КонецЕсли;
		// КОСГУ.
		Знч = ПолучитьРеквизитыКода(Запись.КЭККт);
		Если (Знч <> Неопределено) Тогда
			Элем.Вставить("КЭККт", Знч);
		КонецЕсли;
		// Валюта.
		Если ЗначениеЗаполнено(Запись.ВалютаКт) Тогда
			Знч = ФИББГУМенеджерОбменаПовтИсп.ПолучитьРеквизитыВалюты(Запись.ВалютаКт);
			Если (Знч <> Неопределено) Тогда
				Знч = Новый Структура(Знч);
				Знч.Вставить("Ссылка", Запись.ВалютаКт);
				Элем.Вставить("ВалютаКт", Знч);
			КонецЕсли;
		КонецЕсли;
		// Заполнение корреспонденции счета по субконто.
		ЗаполнитьПоСубконто(Элем, Запись, "Кт", ВОКт);
		// Добавление строки.
		Проводки.Добавить(Элем);
	КонецЦикла;
	// Если нет ни одной проводки, то документ надо удалить.
	Если (Проводки.Количество() = 0) Тогда
		ЗаписатьУдалениеОбъектаXDTO(КомпонентыОбмена, "БухгалтерскаяСправкаСсылка", Регистратор);
		Пропустить = Истина;
		Возврат;
	КонецЕсли;	
	// Добавление реквизитов с проводками.
	ДанныеXDTO.Вставить("Проводки", Проводки);
	// При обмене БМО нужны реквизиты платежки и внешние объекты.	
	Если ЭтоБМО Тогда
		// Внешние объекты (дебет).
		Если ((ВОДт <> Неопределено) И (ВОДт.Количество() <> 0)) Тогда
			ДанныеXDTO.Вставить("СубконтоДт", ВОДт);
		КонецЕсли;	
		// Внешние объекты (кредит).
		Если ((ВОКт <> Неопределено) И (ВОКт.Количество() <> 0)) Тогда
			ДанныеXDTO.Вставить("СубконтоКт", ВОКт);
		КонецЕсли;	
		// Добавление реквизитов платежных документов.
		ДобавитьРеквизитыПлатежныхДокументов(ДанныеXDTO, Регистратор, КомпонентыОбмена);
	КонецЕсли;
	// Заполнение дополнительных реквизитов.
	ФИББГУМенеджерОбменаПереопределяемый.Отправка_ПослеЗаполненияБухгалтерскойСправки(Регистратор,
																					  ДанныеИБ,
																					  ДанныеXDTO,
																					  КомпонентыОбмена,
																					  СтекВыгрузки,
																					  Пропустить);

КонецПроцедуры

#КонецОбласти

#Область ПланСчетов_ЕПСБУ

// Процедура добавляет обработчики для конвертации данных плана счетов при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_ПланСчетов_ЕПСБУ_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "ПланСчетов_ЕПСБУ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.ПланыСчетов.ЕПСБУ;
	ПравилоКонвертации.ОбъектФормата = "ПланСчетов.ЕПСБУ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_ПланСчетов_ЕПСБУ_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "";
	НоваяСтрока.СвойствоФормата = "Код";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Забалансовый";
	НоваяСтрока.СвойствоФормата = "Забалансовый";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Валютный";
	НоваяСтрока.СвойствоФормата = "Валютный";
	
КонецПроцедуры

// Обработчик конвертирует данные из плана счетов в пакет XDTO.
// 
// Параметры :
//	ДанныеИБ - ПланСчетовОбъект - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура ПКО_ПланСчетов_ЕПСБУ_Отправка_ПриОтправкеДанных(Знач ДанныеИБ,
														  Знач ДанныеXDTO,
														  Знач КомпонентыОбмена,
														  Знач СтекВыгрузки,
														  Пропустить)
	Перем ВидыСубконто, Субконто, Вид, КС, Код, ВС, Тип, Типы, Стр;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Пропустить = ДанныеИБ.ПометкаУдаления;
	Если Пропустить Тогда
		УдалитьРегистрацию(ДанныеИБ.Ссылка, КомпонентыОбмена);
		Возврат;
	КонецЕсли;
	Пропустить = ДанныеИБ.ЗапретитьИспользоватьВПроводках;
	Если Пропустить Тогда
		УдалитьРегистрацию(ДанныеИБ.Ссылка, КомпонентыОбмена);
		Возврат;
	КонецЕсли;
	Пропустить = ДанныеИБ.ЭлементГруппа;
	Если Пропустить Тогда
		УдалитьРегистрацию(ДанныеИБ.Ссылка, КомпонентыОбмена);
		Возврат;
	КонецЕсли;
	Пропустить = ЗначениеЗаполнено(ДанныеИБ.ДатаОкончанияДействия);
	Если Пропустить Тогда
		УдалитьРегистрацию(ДанныеИБ.Ссылка, КомпонентыОбмена);
		Возврат;
	КонецЕсли;
	Код = Лев(СокрЛП(ДанныеИБ.Код), 6);
	Пропустить = СчетДляФО(Код);
	Если Пропустить Тогда
		УдалитьРегистрацию(ДанныеИБ.Ссылка, КомпонентыОбмена);
		Возврат;
	КонецЕсли;
	Если (Не ДанныеИБ.Забалансовый) Тогда
		ДанныеXDTO.Вставить("КЭК", (ДанныеИБ.КОСГУДт <> ДанныеИБ.КОСГУКт));
	ИначеЕсли ДанныеИБ.УчетПоКЭК Тогда
		ДанныеXDTO.Вставить("КЭК", Ложь);
	КонецЕсли;
	Если (КомпонентыОбмена.УзелКорреспондентаОбъект.РежимВыгрузкиРасш = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости) Тогда
		ВС = Новый Массив;
	Иначе
		ВС = Неопределено;
	КонецЕсли;
	ВидыСубконто = ПланыВидовХарактеристик.ВидыСубконто;
	Для Каждого Субконто Из ДанныеИБ.ВидыСубконто Цикл
		Вид = Субконто.ВидСубконто;
		Если (ВидыСубконто.ЛицевыеСчета = Вид) Тогда
			ДанныеXDTO.Вставить("ЛицевойСчет", Субконто.ТолькоОбороты);
		ИначеЕсли (ВидыСубконто.РазделыЛицевыхСчетов = Вид) Тогда
			ДанныеXDTO.Вставить("ЛицевойСчет", Субконто.ТолькоОбороты);
		ИначеЕсли (ВидыСубконто.Договоры = Вид) Тогда
			ДанныеXDTO.Вставить("Договор", Субконто.ТолькоОбороты);
		ИначеЕсли (ВидыСубконто.Контрагенты = Вид) Тогда
			ДанныеXDTO.Вставить("Контрагент", Субконто.ТолькоОбороты);
		ИначеЕсли (ВидыСубконто.ВидыЦелевыхСредств = Вид) Тогда
			ДанныеXDTO.Вставить("ВидЦелевых", Субконто.ТолькоОбороты);
		ИначеЕсли (ВидыСубконто.Мероприятия = Вид) Тогда
			ДанныеXDTO.Вставить("Мероприятие", Субконто.ТолькоОбороты);
		ИначеЕсли (ВидыСубконто.Номенклатура = Вид) Тогда
			ДанныеXDTO.Вставить("Номенклатура", Субконто.ТолькоОбороты);
		ИначеЕсли (ВС <> Неопределено) Тогда
			Типы = Вид.ТипЗначения.Типы();
			Для Каждого Тип Из Типы Цикл
				Стр = ВидСубконтоСтр(Тип);
				Если ПустаяСтрока(Стр) Тогда
					Продолжить;
				КонецЕсли;
				КС = Новый Структура;
				КС.Вставить("Вид", Стр);
				КС.Вставить("Наименование", СокрЛП(Вид.Наименование));
				КС.Вставить("ТолькоОбороты", Субконто.ТолькоОбороты);
				ВС.Добавить(КС);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	КС = КлючевыеСвойства(ДанныеXDTO);
	КС.Вставить("Код", Код);
	Если ((ВС <> Неопределено) И (ВС.Количество() > 0)) Тогда
		ДанныеXDTO.Вставить("ВидыСубконто", ВС);
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область РегистрСведений_БГУАдресаХостов

// Процедура добавляет обработчики для конвертации данных с адресом хоста при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_РегистрСведений_БГУАдресаХостов_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РегистрСведений_БГУАдресаХостов_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.РегистрыСведений.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУАдресаХостов";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУАдресаХостов_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

КонецПроцедуры

// Обработчик конвертирует данные с адресом хоста в пакет XDTO.
// 
// Параметры :
//	ДанныеИБ - РегистрСведенийНаборЗаписей.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура ПКО_РегистрСведений_БГУАдресаХостов_Отправка_ПриОтправкеДанных(Знач ДанныеИБ,
																		 Знач ДанныеXDTO,
																		 Знач КомпонентыОбмена,
																		 Знач СтекВыгрузки,
																		 Пропустить)
	Перем Стр, Знч, Парам;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Стр = СокрЛП(Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить());
	Если (Не ПустаяСтрока(Стр)) Тогда
		ДанныеXDTO.Вставить("АдресХоста", Стр);
		Возврат;
	КонецЕсли;
	Стр = СокрЛП(Константы.АдресПубликацииИнформационнойБазыВЛокальнойСети.Получить());
	Если (Не ПустаяСтрока(Стр)) Тогда
		ДанныеXDTO.Вставить("АдресХоста", Стр);
		Возврат;
	КонецЕсли;
	Стр = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
	Если (Не ПустаяСтрока(Стр)) Тогда
		ДанныеXDTO.Вставить("АдресХоста", Стр);
		Возврат;
	КонецЕсли;
	Парам = СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы());
	Если (Парам.Свойство("file", Стр) И (Не ПустаяСтрока(Стр))) Тогда
		Стр = СтрЗаменить(Стр, "\", "/");
		Стр = СтрЗаменить(Стр, ":/", "/");
		Стр = СтрЗаменить(Стр, "//", "/");
		Стр = "e1c://filev/" + Стр;
		ДанныеXDTO.Вставить("АдресХоста", Стр);
		Возврат;
	КонецЕсли;
	Если (Парам.Свойство("Srvr", Стр) И (Не ПустаяСтрока(Стр))) Тогда
		Стр = "e1c://server/" + Стр;
		Если (Парам.Свойство("Ref", Знч) И (Не ПустаяСтрока(Знч))) Тогда
			Стр = Стр + "/" + Знч;
		КонецЕсли;
		ДанныеXDTO.Вставить("АдресХоста", Стр);
		Возврат;
	КонецЕсли;
	Пропустить = Истина;

КонецПроцедуры

#КонецОбласти

#Область РегистрСведений_БГУИнформацияОбОбъектах

// Процедура добавляет обработчики для конвертации данных с информацией об объектах при отправке.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РегистрСведений_БГУИнформацияОбОбъектах_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РегистрСведений_БГУИнформацияОбОбъектах_ОБ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ОперацияБух;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РегистрСведений_БГУИнформацияОбОбъектах_БД_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.БюджетныеДанные;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РегистрСведений_БГУИнформацияОбОбъектах_КВ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.КассовоеВыбытие;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РегистрСведений_БГУИнформацияОбОбъектах_КП_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.КассовоеПоступление;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РегистрСведений_БГУИнформацияОбОбъектах_РР_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.РасходноеРасписание;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РегистрСведений_БГУИнформацияОбОбъектах_БВО_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.РегистрацияОбязательствИСведенийПоДоговорам;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	// Внешние объекты.
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_БСО_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.БСО;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_ВДД_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыДенежныхДокументов;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_ВидЗатрат_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыЗатрат;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_ВНП_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыНалоговИПлатежей;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_ВидОбязательств_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыОбязательств;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_ВидУдержаний_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыУдержаний;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_ДД_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ДенежныеДокументы;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_НПО_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.НалогиИПлатежиОрганизации;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_ОФВ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ОбъектыФинансовыхВложений;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_ОсновныеСредства_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ОсновныеСредства;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_ПОПЛ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ПричиныОшибокПрошлыхЛет;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_РЛС_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.РазделыЛицевыхСчетов;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_РБП_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.РасходыБудущихПериодов;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_Резерв_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Резервы;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_ВО_ЦМО_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ЦМО;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	// Навигационные ссылки на элементы справочников.
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_НС_ВидЦелевыхСредств_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыЦелевыхСредств;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_НС_Договор_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Договоры;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_НС_Контрагент_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Контрагенты;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_НС_КОСГУ_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.КОСГУ;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_НС_ЛицевойСчет_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ЛицевыеСчета;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "РС_БГУ_НС_Мероприятие_Отправка";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Мероприятия;
	ПравилоКонвертации.ОбъектФормата = "РегистрСведений.БГУИнформацияОбОбъектах";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";
	
КонецПроцедуры

// Обработчик конвертирует данные с информацией об объектах в пакет XDTO.
// 
// Параметры :
//	ДанныеИБ - ДокументОбъект, РегистрБухгалтерииНаборЗаписей.ЖурналПроводокЕПСБУ - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных(Знач ДанныеИБ,
																				 Знач ДанныеXDTO,
																				 Знач КомпонентыОбмена,
																				 Знач СтекВыгрузки,
																				 Пропустить)
	Перем Ссылка, Стр, Тип;
																				 
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Если (ТипЗнч(ДанныеИБ) = Тип("РегистрБухгалтерииНаборЗаписей.ЖурналПроводокЕПСБУ")) Тогда
		Ссылка = Регистратор(ДанныеИБ);
		Если (Ссылка = Неопределено) Тогда
			Пропустить = Истина;
			Возврат;
		ИначеЕсли (Не ОбщегоНазначения.СсылкаСуществует(Ссылка)) Тогда
			Пропустить = Истина;
			Возврат;
		КонецЕсли;
		Пропустить = (ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОперацияБух"));
		Если Пропустить Тогда
			Пропустить = ЭтоОбъектИзБМО(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ИДИсточника"));
			Если Пропустить Тогда
				УдалитьРегистрацию(ДанныеИБ, КомпонентыОбмена);
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
		ДанныеXDTO.Вставить("ОбъектКонфигурации", Ссылка.УникальныйИдентификатор());
	Иначе	
		Ссылка = ДанныеИБ.Ссылка;
		Тип = ТипЗнч(Ссылка);
		// Проверка что объект из текущей базы.
		Если (Тип = Тип("СправочникСсылка.ВидыЦелевыхСредств")) Тогда
			Пропустить = (Не ОбъектИзЭтойБазыДанных(Ссылка, КомпонентыОбмена.УзелКорреспондента));
			Стр = "ВЦС";
		ИначеЕсли (Тип = Тип("СправочникСсылка.Договоры")) Тогда
			Пропустить = (Не ОбъектИзЭтойБазыДанных(Ссылка, КомпонентыОбмена.УзелКорреспондента));
			Стр = "Д";
		ИначеЕсли (Тип = Тип("СправочникСсылка.Контрагенты")) Тогда
			Если (ТипЗнч(ДанныеИБ.ЮридическоеФизическоеЛицо) <> Тип("СправочникСсылка.ЮридическиеЛица")) Тогда
				Пропустить = Истина;
			ИначеЕсли ДанныеИБ.ЮридическоеФизическоеЛицо.Пустая() Тогда
				Пропустить = Истина;
			Иначе	
				Стр = Новый Структура;
				Стр.Вставить("КодПоРПБС");
				Стр = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.ЮридическоеФизическоеЛицо, Стр);
				Если ПустаяСтрока(Стр.КодПоРПБС) Тогда
					Пропустить = Истина;
				Иначе	
					Пропустить = (Не ОбъектИзЭтойБазыДанных(Ссылка, КомпонентыОбмена.УзелКорреспондента));
				КонецЕсли;	
			КонецЕсли;	
			Стр = "К";
		ИначеЕсли (Тип = Тип("СправочникСсылка.КОСГУ")) Тогда
			Пропустить = (Не ОбъектИзЭтойБазыДанных(Ссылка, КомпонентыОбмена.УзелКорреспондента));
			Стр = "КОСГУ";
		ИначеЕсли (Тип = Тип("СправочникСсылка.ЛицевыеСчета")) Тогда
			Пропустить = (Не ОбъектИзЭтойБазыДанных(Ссылка, КомпонентыОбмена.УзелКорреспондента));
			Стр = "ЛС";
		ИначеЕсли (Тип = Тип("СправочникСсылка.Мероприятия")) Тогда
			Пропустить = (Не ОбъектИзЭтойБазыДанных(Ссылка, КомпонентыОбмена.УзелКорреспондента));
			Стр = "М";
		Иначе
			Пропустить = Ложь;
			Стр = ВидСубконтоСтр(Тип);
		КонецЕсли;
		Если Пропустить Тогда
			УдалитьРегистрацию(Ссылка, КомпонентыОбмена);
			Возврат;
		КонецЕсли;	
		Если ПустаяСтрока(Стр) Тогда
			// Проверяем, что объект пришел из БМО.
			Пропустить = (Не ЭтоОбъектИзБМО(ДанныеИБ.ИДИсточника));
			Если Пропустить Тогда
				УдалитьРегистрацию(Ссылка, КомпонентыОбмена);
				Возврат;
			КонецЕсли;
			// Объект должен был участвовать в обмене.
			Пропустить = (Не ОбъектУчаствовалВОбмене(Ссылка, КомпонентыОбмена.УзелКорреспондента));
			Если Пропустить Тогда
				УдалитьРегистрацию(Ссылка, КомпонентыОбмена);
				Возврат;
			КонецЕсли;
			Если (ДанныеИБ.ИДИсточника = ИзмененУИ()) Тогда
				ДанныеXDTO.Вставить("Изменен", Истина);
			КонецЕсли;
		КонецЕсли;	
		ДанныеXDTO.Вставить("ОбъектКонфигурации", Ссылка);
	КонецЕсли;
	// Навигационная ссылка документа.
	ДанныеXDTO.Вставить("НавигационнаяСсылкаОбъекта", ПолучитьНавигационнуюСсылку(Ссылка));

КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Правила конвертации данных из пакетного файла.
#Область ПКО_Получение

#Область ПланОбмена_ФИБОбменБГУ

// Процедура добавляет обработчики для конвертации данных в настройки узла плана обмена при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_ПланОбмена_ФИБОбменБГУ_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "ПланОбмена_ФИБОбменБГУ_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.РегистрыСведений.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ;
	ПравилоКонвертации.ОбъектФормата = "ПланОбмена.ФИБОбменБГУ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_ПланОбмена_ФИБОбменБГУ_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_ПланОбмена_ФИБОбменБГУ_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "ПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Узел";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	ПравилоКонвертации.ПоляПоиска.Добавить("Узел");

КонецПроцедуры

// Процедура перерегистрирует справочники выгруженные при обмене из узла.
//
// Параметры :
//	Узел - ПланОбменаСсылка.
//
Процедура ЗарегистрироватьСправочникиБМО(Знач Узел)
	Перем Отбор, Текст, Знч, Значения;

	// Дополнительная классификация.
	Отбор = Новый Структура;
	Отбор.Вставить("Узел", Узел);
	// Коды целей.
	Текст = "ВЫБРАТЬ
	        |	ПИСО.Ссылка КАК Ссылка,
	        |	ПИСО.Идентификатор КАК Идентификатор
	        |ИЗ	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИСО
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦелевыхСредств КАК Спр
			|ПО (Спр.Ссылка = ПИСО.Ссылка)
	        |ГДЕ (ПИСО.УзелИнформационнойБазы = &Узел)";
	Значения = ПолучитьДанные(Текст, Отбор);
	Для Каждого Знч Из Значения Цикл
		Если (СокрЛП(Знч.Ссылка.УникальныйИдентификатор()) = Знч.Идентификатор) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Знч.Ссылка);
		КонецЕсли;	
	КонецЦикла;	
	// Мероприятия.
	Текст = "ВЫБРАТЬ
	        |	ПИСО.Ссылка КАК Ссылка,
	        |	ПИСО.Идентификатор КАК Идентификатор
	        |ИЗ	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИСО
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Мероприятия КАК Спр
			|ПО (Спр.Ссылка = ПИСО.Ссылка)
	        |ГДЕ (ПИСО.УзелИнформационнойБазы = &Узел)";
	Значения = ПолучитьДанные(Текст, Отбор);
	Для Каждого Знч Из Значения Цикл
		Если (СокрЛП(Знч.Ссылка.УникальныйИдентификатор()) = Знч.Идентификатор) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Знч.Ссылка);
		КонецЕсли;	
	КонецЦикла;	
	// КОСГУ.
	Текст = "ВЫБРАТЬ
	        |	ПИСО.Ссылка КАК Ссылка,
	        |	ПИСО.Идентификатор КАК Идентификатор
	        |ИЗ	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИСО
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК Спр
			|ПО (Спр.Ссылка = ПИСО.Ссылка)
	        |ГДЕ (ПИСО.УзелИнформационнойБазы = &Узел)";
	Значения = ПолучитьДанные(Текст, Отбор);
	Для Каждого Знч Из Значения Цикл
		Если (СокрЛП(Знч.Ссылка.УникальныйИдентификатор()) = Знч.Идентификатор) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Знч.Ссылка);
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

// Процедура перерегистрирует справочники выгруженные при обмене из узла.
//
// Параметры :
//	Узел - ПланОбменаСсылка.
//
Процедура ЗарегистрироватьСсылкиБМО(Знач Узел)
	Перем Отбор, Текст, Знч, Значения;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Узел", Узел);
	// Лицевые счета.
	Текст = "ВЫБРАТЬ
	        |	ПИСО.Ссылка КАК Ссылка,
	        |	ПИСО.Идентификатор КАК Идентификатор
	        |ИЗ	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИСО
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЛицевыеСчета КАК Спр
			|ПО (Спр.Ссылка = ПИСО.Ссылка)
	        |ГДЕ (ПИСО.УзелИнформационнойБазы = &Узел)";
	Значения = ПолучитьДанные(Текст, Отбор);
	Для Каждого Знч Из Значения Цикл
		Если (СокрЛП(Знч.Ссылка.УникальныйИдентификатор()) = Знч.Идентификатор) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Знч.Ссылка);
		КонецЕсли;	
	КонецЦикла;	
	// Договоры.
	Текст = "ВЫБРАТЬ
	        |	ПИСО.Ссылка КАК Ссылка,
	        |	ПИСО.Идентификатор КАК Идентификатор
	        |ИЗ	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИСО
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Спр
			|ПО (Спр.Ссылка = ПИСО.Ссылка)
	        |ГДЕ (ПИСО.УзелИнформационнойБазы = &Узел)";
	Значения = ПолучитьДанные(Текст, Отбор);
	Для Каждого Знч Из Значения Цикл
		Если (СокрЛП(Знч.Ссылка.УникальныйИдентификатор()) = Знч.Идентификатор) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, Знч.Ссылка);
		КонецЕсли;	
	КонецЦикла;	
	// Учреждения из контрагентов.
	Текст = "ВЫБРАТЬ
	        |	ПИСО.Ссылка КАК Ссылка,
	        |	ПИСО.Идентификатор КАК Идентификатор,
			|	СпрЮЛ.КодПоРПБС КАК КодПоРПБС
	        |ИЗ	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИСО
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СпрК
			|ПО (СпрК.Ссылка = ПИСО.Ссылка)
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК СпрЮЛ
			|ПО (СпрЮЛ.Ссылка = СпрК.ЮридическоеФизическоеЛицо)
	        |ГДЕ (ПИСО.УзелИнформационнойБазы = &Узел) И (СпрЮЛ.КодПоРПБС <> """")";
	Значения = ПолучитьДанные(Текст, Отбор);
	Для Каждого Знч Из Значения Цикл                                                 
		Если (Не ПустаяСтрока(Знч.КодПоРПБС)) Тогда
			Если (СокрЛП(Знч.Ссылка.УникальныйИдентификатор()) = Знч.Идентификатор) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(Узел, Знч.Ссылка);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	

КонецПроцедуры				

// Обработчик сохраняет данные из пакета XDTO в настройки узла обмена.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - РегистрСведенийНаборЗаписей.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_ПланОбмена_ФИБОбменБГУ_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																	    Знач ПолученныеДанные,
																	    Знач КомпонентыОбмена)
	Перем Узел, Объект, Запись, Значения, Новая;
	Перем ТекЗначения, Знч, Элем, Текст, Отбор;
	Перем ПКО, бПКО, Действие;
	
	// Получаем узел плана обмена.
	Узел = КомпонентыОбмена.УзелКорреспондента;
	Если (Не ЗначениеЗаполнено(Узел)) Тогда
		Возврат;
	КонецЕсли;
	ПолученныеДанные.Отбор.Узел.Установить(Узел);
	// Получение объекта.
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Объект = Узел.ПолучитьОбъект();
	Если (Объект = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	// Сохраняем значения настроек до загрузки изменений.
	ТекЗначения = Новый Структура;
	ТекЗначения.Вставить("ВерсияКорреспондента", Объект.ВерсияКорреспондента);
	ТекЗначения.Вставить("ЭтоБМО", Объект.ЭтоБМО);
	ТекЗначения.Вставить("ДатаНачалаВыгрузкиЕПСБУ", Объект.ДатаНачалаВыгрузкиЕПСБУ);
	ТекЗначения.Вставить("ВыгружатьДанныеПоЗабалансовымСчетам", Объект.ВыгружатьДанныеПоЗабалансовымСчетам);
	ТекЗначения.Вставить("ИспользоватьОтборПоСчетам", Объект.ИспользоватьОтборПоСчетам);
	ТекЗначения.Вставить("Организации", Объект.Организации.ВыгрузитьКолонку("Организация"));
	ТекЗначения.Вставить("Счета", Объект.Счета.ВыгрузитьКолонку("Счет"));
	ТекЗначения.Вставить("РежимВыгрузкиРасш", Объект.РежимВыгрузкиРасш);
	ТекЗначения.Вставить("РежимВыгрузкиСправочниковБМО", Объект.РежимВыгрузкиСправочниковБМО);
	ТекЗначения.Вставить("РежимВыгрузкиСсылокБМО", Объект.РежимВыгрузкиСсылокБМО);
	ТекЗначения.Вставить("РежимВыгрузкиСостоянийБД", Объект.РежимВыгрузкиСостоянийБД);
	ТекЗначения.Вставить("РежимВыгрузкиСостоянийРР", Объект.РежимВыгрузкиСостоянийРР);
	ТекЗначения.Вставить("РежимВыгрузкиСостоянийБВО", Объект.РежимВыгрузкиСостоянийБВО);
	ТекЗначения.Вставить("РежимВыгрузкиСостоянийКВ", Объект.РежимВыгрузкиСостоянийКВ);
	ТекЗначения.Вставить("РежимВыгрузкиСостоянийКП", Объект.РежимВыгрузкиСостоянийКП);
	ТекЗначения.Вставить("РежимВыгрузкиСостоянийБС", Объект.РежимВыгрузкиСостоянийБС);
	// Версия БМО.
	Если ДанныеXDTO.Свойство("Версия", Знч) Тогда
		Если (Объект.ВерсияКорреспондента <> Знч) Тогда
			Объект.ДатаОбновленияВерсииКорреспондента = ТекущаяДатаСеанса();
		КонецЕсли;	
		Объект.ВерсияКорреспондента = Знч;
	КонецЕсли;	
	// Дата начала выгрузки бухгалтерских справок.
	Если ДанныеXDTO.Свойство("ДатаНачалаВыгрузкиБС", Знч) Тогда
		Объект.ДатаНачалаВыгрузкиЕПСБУ = Макс(ДатаНачала(), Знч);
	Иначе
		Объект.ДатаНачалаВыгрузкиЕПСБУ = ДатаНачала();
	КонецЕсли;	
	// Ограничения на возможный период выгрузки данных о бухгалтерских справках.
	Если ДанныеXDTO.Свойство("МинимальныйПериодРегистрацииВМесяцахБС", Знч) Тогда
		Объект.МинимальныйПериодРегистрацииВМесяцахЕПСБУ = Знч;
	КонецЕсли;	
	Если ДанныеXDTO.Свойство("МаксимальныйПериодРегистрацииВМесяцахБС", Знч) Тогда
		Объект.МаксимальныйПериодРегистрацииВМесяцахЕПСБУ = Знч;
	КонецЕсли;	
	// Выгружать бухгалтерские справки по забалансовым счетам.
	Если (ДанныеXDTO.Свойство("ЗабалансовыеСчета", Знч) И (Знч = Истина)) Тогда
		Объект.ВыгружатьДанныеПоЗабалансовымСчетам = Истина;
	Иначе
		Объект.ВыгружатьДанныеПоЗабалансовымСчетам = Ложь;
	КонецЕсли;
	// Отбор по организациям.
	Если ДанныеXDTO.Свойство("Организации", Значения) Тогда
		Действие = ДействиеПоУмолчанию();
		// Правило для получения бюджета.
		бПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Бюджет_Получение");
		Знч = Новый Структура;
		Знч.Вставить("ПравилоКонвертации", бПКО);
		Знч.Вставить("УдалятьСозданныеПоКлючевымСвойствам", Истина);
		бПКО = Знч;
		// Правило для получения организации.
		ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Организация_Получение");
		Знч = Новый Структура;
		Знч.Вставить("ПравилоКонвертации", ПКО);
		Знч.Вставить("УдалятьСозданныеПоКлючевымСвойствам", Истина);
		ПКО = Знч;
		// Загрузка списка организаций.
		Объект.Организации.Очистить();
		Для Каждого Запись Из Значения Цикл
			Элем = Запись.Организация;
			Если (Элем = Неопределено) Тогда
				Продолжить;
			КонецЕсли;
			// Нужно для удаления бюджета, если его не было в базе данных.
			Знч = Неопределено;
			Если (Элем.Свойство("Бюджет", Знч) И (Знч <> Неопределено)) Тогда
				ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Знч, бПКО, Действие);
			КонецЕсли;
			// Поиск организации.
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Элем, ПКО, Действие);
			Если ((ТипЗнч(Знч) = Тип("СправочникСсылка.Организации")) И (Не Знч.Пустая())) Тогда
				Новая = Объект.Организации.Добавить();
				Новая.Организация = Знч;
			Иначе
				Текст = Новый Массив;
				Если Элем.Свойство("Код", Знч) Тогда
					Текст.Добавить(НСтр("ru = 'код:'") + " " + СокрЛП(Знч));
				КонецЕсли;	
				Если Элем.Свойство("ИНН", Знч) Тогда
					Текст.Добавить(НСтр("ru = 'ИНН:'") + " " + СокрЛП(Знч));
				КонецЕсли;
				Если Элем.Свойство("КПП", Знч) Тогда
					Текст.Добавить(НСтр("ru = 'КПП:'") + " " + СокрЛП(Знч));
				КонецЕсли;
				Текст = НСтр("ru = 'Отсутствует организация с реквизитами'") + " " + СтрСоединить(Текст, "; ") + ".";
				Знч = Перечисления.ТипыПроблемОбменаДанными.ОшибкаВыполненияКодаОбработчиковПриПолученииДанных; 
				РегистрыСведений.РезультатыОбменаДанными.ЗарегистрироватьОшибкуПроверкиОбъекта(Узел, Узел, Текст, Знч);
			КонецЕсли;	
		КонецЦикла;
	Иначе
		Объект.Организации.Очистить();
	КонецЕсли;	
	// Отбор по счетам.
	Если ДанныеXDTO.Свойство("Счета", Значения) Тогда
		Объект.ИспользоватьОтборПоСчетам = Истина;
		Текст = "ВЫБРАТЬ
		        |	ЕПСБУ.Ссылка КАК Ссылка
		        |ИЗ	ПланСчетов.ЕПСБУ КАК ЕПСБУ
		        |ГДЕ (НЕ ЕПСБУ.ПометкаУдаления)
		        |  И (ЕПСБУ.Код ПОДОБНО &Код + ""%"")";
		Отбор = Новый Структура;
		Отбор.Вставить("Код", "");
		Объект.Счета.Очистить();
		Для Каждого Запись Из Значения Цикл
			Элем = Запись.Счет;
			Если (Элем = Неопределено) Тогда
				Продолжить;
			ИначеЕсли (Не Элем.Свойство("Код", Знч)) Тогда
				Продолжить;
			ИначеЕсли ПустаяСтрока(Знч) Тогда
				Продолжить;
			КонецЕсли;
			Отбор.Код = СокрЛП(Знч);
			Знч = ПолучитьДанные(Текст, Отбор);
			Для Каждого Элем Из Знч Цикл
				Новая = Объект.Счета.Добавить();
				Новая.Счет = Элем.Ссылка;
			КонецЦикла;	
		КонецЦикла;	
	Иначе
		Объект.ИспользоватьОтборПоСчетам = Ложь;
		Объект.Счета.Очистить();
	КонецЕсли;
	// Выгружать внешние объекты.
	Если (ДанныеXDTO.Свойство("ВнешниеОбъекты", Знч) И (Знч = Истина)) Тогда
		Объект.РежимВыгрузкиРасш = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
	Иначе
		Объект.РежимВыгрузкиРасш = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
	КонецЕсли;
	// Выгружать навигационные ссылки на элементы справочников.
	Если (ДанныеXDTO.Свойство("ИнформацияОбЭлементах", Знч) И (Знч = Истина)) Тогда
		Объект.РежимВыгрузкиСправочниковБМО = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
		Объект.РежимВыгрузкиСсылокБМО = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
	Иначе
		Объект.РежимВыгрузкиСправочниковБМО = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
		Объект.РежимВыгрузкиСсылокБМО = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
	КонецЕсли;
	// Выгружать состояния объектов.
	Если (Не ДанныеXDTO.Свойство("ИнформацияОСостоянияхБД", Знч)) Тогда
		Объект.РежимВыгрузкиСостоянийБД = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	ИначеЕсли (Знч = Истина) Тогда
		Объект.РежимВыгрузкиСостоянийБД = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	Иначе
		Объект.РежимВыгрузкиСостоянийБД = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
	КонецЕсли;
	Если (Не ДанныеXDTO.Свойство("ИнформацияОСостоянияхРР", Знч)) Тогда
		Объект.РежимВыгрузкиСостоянийРР = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	ИначеЕсли (Знч = Истина) Тогда
		Объект.РежимВыгрузкиСостоянийРР = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	Иначе
		Объект.РежимВыгрузкиСостоянийРР = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
	КонецЕсли;
	Если (Не ДанныеXDTO.Свойство("ИнформацияОСостоянияхБВО", Знч)) Тогда
		Объект.РежимВыгрузкиСостоянийБВО = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	ИначеЕсли (Знч = Истина) Тогда
		Объект.РежимВыгрузкиСостоянийБВО = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	Иначе
		Объект.РежимВыгрузкиСостоянийБВО = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
	КонецЕсли;
	Если (Не ДанныеXDTO.Свойство("ИнформацияОСостоянияхКВ", Знч)) Тогда
		Объект.РежимВыгрузкиСостоянийКВ = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	ИначеЕсли (Знч = Истина) Тогда
		Объект.РежимВыгрузкиСостоянийКВ = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	Иначе
		Объект.РежимВыгрузкиСостоянийКВ = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
	КонецЕсли;
	Если (Не ДанныеXDTO.Свойство("ИнформацияОСостоянияхКП", Знч)) Тогда
		Объект.РежимВыгрузкиСостоянийКП = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	ИначеЕсли (Знч = Истина) Тогда
		Объект.РежимВыгрузкиСостоянийКП = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	Иначе
		Объект.РежимВыгрузкиСостоянийКП = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
	КонецЕсли;
	Если (Не ДанныеXDTO.Свойство("ИнформацияОСостоянияхБС", Знч)) Тогда
		Объект.РежимВыгрузкиСостоянийБС = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	ИначеЕсли (Знч = Истина) Тогда
		Объект.РежимВыгрузкиСостоянийБС = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	Иначе
		Объект.РежимВыгрузкиСостоянийБС = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать;
	КонецЕсли;
	// Если изменений нет, то не нужно изменять настройки.
	Если (Не ТекЗначения.ЭтоБМО) Тогда
		Объект.ЭтоБМО = Истина;
		Знч = Ложь;
	ИначеЕсли (ТекЗначения.ДатаНачалаВыгрузкиЕПСБУ <> Объект.ДатаНачалаВыгрузкиЕПСБУ) Тогда
		Знч = Ложь;
	ИначеЕсли (ТекЗначения.ВыгружатьДанныеПоЗабалансовымСчетам <> Объект.ВыгружатьДанныеПоЗабалансовымСчетам) Тогда
		Знч = Ложь;
	ИначеЕсли (ТекЗначения.ИспользоватьОтборПоСчетам <> Объект.ИспользоватьОтборПоСчетам) Тогда
		Знч = Ложь;
	ИначеЕсли (ТекЗначения.РежимВыгрузкиРасш <> Объект.РежимВыгрузкиРасш) Тогда
		Знч = Ложь;
	ИначеЕсли (ТекЗначения.Организации.Количество() <> Объект.Организации.Количество()) Тогда
		Знч = Ложь;
	ИначеЕсли (ТекЗначения.Счета.Количество() <> Объект.Счета.Количество()) Тогда
		Знч = Ложь;
	Иначе
		Знч = Истина;
		Для Каждого Запись Из Объект.Организации Цикл
			Если (ТекЗначения.Организации.Найти(Запись.Организация) = Неопределено) Тогда
				Знч = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
		Если Знч Тогда
			Для Каждого Запись Из Объект.Счета Цикл
				Если (ТекЗначения.Счета.Найти(Запись.Счет) = Неопределено) Тогда
					Знч = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	// Если нет изменений, то нет смысла сохранять изменения.
	Если Знч Тогда
		Знч = (ТекЗначения.РежимВыгрузкиСправочниковБМО <> Объект.РежимВыгрузкиСправочниковБМО);
		Знч = Знч Или (ТекЗначения.РежимВыгрузкиСсылокБМО <> Объект.РежимВыгрузкиСсылокБМО);
		Знч = Знч Или (ТекЗначения.РежимВыгрузкиСостоянийБД <> Объект.РежимВыгрузкиСостоянийБД);
		Знч = Знч Или (ТекЗначения.РежимВыгрузкиСостоянийРР <> Объект.РежимВыгрузкиСостоянийРР);
		Знч = Знч Или (ТекЗначения.РежимВыгрузкиСостоянийБВО <> Объект.РежимВыгрузкиСостоянийБВО);
		Знч = Знч Или (ТекЗначения.РежимВыгрузкиСостоянийКВ <> Объект.РежимВыгрузкиСостоянийКВ);
		Знч = Знч Или (ТекЗначения.РежимВыгрузкиСостоянийКП <> Объект.РежимВыгрузкиСостоянийКП);
		Знч = Знч Или (ТекЗначения.РежимВыгрузкиСостоянийБС <> Объект.РежимВыгрузкиСостоянийБС);
		Если Знч Тогда
			// При изменении переключателей нужно сбросить кеш.
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать();                        
			КомпонентыОбмена.УзелКорреспондентаОбъект = Объект;
			// Обновление кэшируемых данных, зависящих от значений реквизитов данного узла обмена.
			ОбменДаннымиВызовСервера.СброситьКэшМеханизмаРегистрацииОбъектов();
			ОбновитьПовторноИспользуемыеЗначения();
			// Регистрация элементов.                       
			Если (Объект.РежимВыгрузкиСправочниковБМО = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости) Тогда
				ЗарегистрироватьСправочникиБМО(Узел);
			КонецЕсли;	
			Если (Объект.РежимВыгрузкиСсылокБМО = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости) Тогда
				ЗарегистрироватьСсылкиБМО(Узел);
			КонецЕсли;	
		ИначеЕсли (ТекЗначения.ВерсияКорреспондента <> Объект.ВерсияКорреспондента) Тогда
			// При изменении версии корреспондента просто сохраняем версию без регистрации для отправки данных.
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать();                        
			КомпонентыОбмена.УзелКорреспондентаОбъект = Объект;
		КонецЕсли;	
		Возврат;
	КонецЕсли;
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();                        
	КомпонентыОбмена.УзелКорреспондентаОбъект = Объект;
	// Обновление кэшируемых данных, зависящих от значений реквизитов данного узла обмена.
	ОбменДаннымиВызовСервера.СброситьКэшМеханизмаРегистрацииОбъектов();
	ОбновитьПовторноИспользуемыеЗначения();
	// Регистрация бухгалтерских справок.
	Значения = РегистрыСведений.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ.СоздатьНаборЗаписей();
	Значения.Отбор.Узел.Установить(Узел);
	Значения.Записать(Истина);
	// Регистрация для выгрузки адреса текущей базы данных.
	Значения = РегистрыСведений.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ.СоздатьНаборЗаписей();
	Значения.Отбор.Узел.Установить(Узел);
	ПланыОбмена.ЗарегистрироватьИзменения(Узел, Значения);
	// Регистрация для выгрузки плана счетов ЕПСБУ с настройками субконто (внешних объектов).
	Знч = (Объект.РежимВыгрузкиРасш = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости);
	Знч = Знч И (ТекЗначения.РежимВыгрузкиРасш <> Объект.РежимВыгрузкиРасш);
	Если Знч Тогда
		Знч = Новый Массив;
		Знч.Добавить(Метаданные.ПланыСчетов.ЕПСБУ);
		РегистрацияИзмененийНачальнойВыгрузкиДанных(Объект.Ссылка, Истина, Знч);
	КонецЕсли;
	// Регистрация элементов.                       
	Знч = (Объект.РежимВыгрузкиСправочниковБМО = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости);
	Знч = Знч И (ТекЗначения.РежимВыгрузкиСправочниковБМО <> Объект.РежимВыгрузкиСправочниковБМО);
	Если Знч Тогда
		ЗарегистрироватьСправочникиБМО(Узел);
	КонецЕсли;	
	Знч = (Объект.РежимВыгрузкиСсылокБМО = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости);
	Знч = Знч И (ТекЗначения.РежимВыгрузкиСсылокБМО <> Объект.РежимВыгрузкиСсылокБМО);
	Если Знч Тогда
		ЗарегистрироватьСсылкиБМО(Узел);
	КонецЕсли;	

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в настройки узла обмена.
// 
// Параметры :
//	ДанныеИБ - РегистрСведенийНаборЗаписей.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ - объект информационной базы.
//	ПолученныеДанные - РегистрСведенийНаборЗаписей.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	Пропустить - Булево - пропустить объект.
//
Процедура ПКО_ПланОбмена_ФИБОбменБГУ_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																		    Знач ПолученныеДанные,
																		    Знач КомпонентыОбмена,
																			Пропустить)
	
	Пропустить = Истина;

КонецПроцедуры

#КонецОбласти

#Область Справочник_Бюджет

// Процедура добавляет обработчики для конвертации данных в бюджет при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Бюджет_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Бюджет_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Бюджеты;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Бюджеты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Элемент";
	НоваяСтрока.СвойствоФормата = "ЭлементБюджета";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЭлементБюджета_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПубличноПравовогоОбразования";
	НоваяСтрока.СвойствоФормата = "НаименованиеПубличноПравовогоОбразования";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеФинансовогоОргана";
	НоваяСтрока.СвойствоФормата = "НаименованиеФинансовогоОргана";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодОрФК";
	НоваяСтрока.СвойствоФормата = "КодОрФК";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодОКПОФинансовогоОргана";
	НоваяСтрока.СвойствоФормата = "КодОКПОФинансовогоОргана";
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Код");

КонецПроцедуры

#КонецОбласти

#Область Справочник_Валюта

// Процедура добавляет обработчики для конвертации данных в валюту при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Валюта_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Валюта_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Валюты;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Валюты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_Валюта_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_Валюта_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Код");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в соответствие.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - СправочникОбъект.Валюты - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_Валюта_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																   Знач ПолученныеДанные,
																   Знач КомпонентыОбмена)

	ПолученныеДанные.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в валюту.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.Валюты - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.Валюты - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_Валюта_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																	   Знач ПолученныеДанные,
																	   Знач КомпонентыОбмена)

	Если ((ДанныеИБ <> Неопределено) И (Не ДанныеИБ.СпособУстановкиКурса.Пустая())) Тогда
		ПолученныеДанные.СпособУстановкиКурса = ДанныеИБ.СпособУстановкиКурса;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Справочник_ВидДоходовКДБ

// Процедура добавляет обработчики для конвертации данных в вид доходов КДБ при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ВидДоходовКДБ_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, КонвертацияТабличнойЧасти, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидДоходовКДБ_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыДоходовКДБ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ВидыДоходовКДБ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_ВидДоходовКДБ_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Справочник_ВидДоходовКДБ_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаНачалаДействия";
	НоваяСтрока.СвойствоФормата = "НачалоДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаОкончанияДействия";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОкончаниеДействия";
	НоваяСтрока.СвойствоФормата = "ОкончаниеДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Элемент";
	НоваяСтрока.СвойствоФормата = "ЭлементБюджета";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЭлементБюджета_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЭлементГруппа";
	НоваяСтрока.СвойствоФормата = "ЭлементГруппа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидДоходовКДБ_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Группа";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подгруппа";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Статья";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Подстатья";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "АналитическиеГруппы";
    КонвертацияТабличнойЧасти.ТЧФормата = "АналитическиеГруппы";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "АналитическаяГруппа";
	НоваяСтрока.СвойствоФормата = "АналитическаяГруппа";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в вид доходов КДБ.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - СправочникОбъект.ВидыДоходовКДБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ВидДоходовКДБ_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																		  Знач ПолученныеДанные,
																		  Знач КомпонентыОбмена)
	Перем Код, Знч;

	Если ЗначениеЗаполнено(ПолученныеДанные.ОкончаниеДействия) Тогда
		ПолученныеДанные.ДатаОкончанияДействия = ПолученныеДанные.ОкончаниеДействия;
	Иначе
		ПолученныеДанные.ДатаОкончанияДействия = ДатаГоризонта();
	КонецЕсли;
	// Передача идентификатора в обработчик поиска.
	Знч = ИдентификаторXDTO(ДанныеXDTO);
	Если (Не ПустаяСтрока(Знч)) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("ИдентификаторXDTO", Знч);
	КонецЕсли;	
	Код = ПолученныеДанные.Код;
	ПолученныеДанные.Наименование = Код + "0000000";
	ПолученныеДанные.Группа = Лев(Код, 1);
	ПолученныеДанные.Подгруппа = Сред(Код, 2, 2);
	ПолученныеДанные.Статья = Сред(Код, 4, 2);
	ПолученныеДанные.Подстатья = Сред(Код, 6, 3);

КонецПроцедуры

// Обработчик выполняет поиск вида доходов КДБ.
//
// Параметры :
//	ДанныеИБ - СправочникСсылка.ВидыДоходовКДБ - найденный объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ВидыДоходовКДБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ВидДоходовКДБ_Получение_АлгоритмПоиска(ДанныеИБ,
																Знач ПолученныеДанные,
																Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	ИначеЕсли ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Текст) Тогда
		ДанныеИБ = СсылкаПоИдентификатору(Текст, "Справочник.ВидыДоходовКДБ", КомпонентыОбмена.УзелКорреспондента);
		Если (ДанныеИБ <> Неопределено) Тогда
			Возврат;															
		КонецЕсли;	
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Код", ПолученныеДанные.Код);
	Отбор.Вставить("ДатаНачалаДействия", ПолученныеДанные.ДатаНачалаДействия);
	Отбор.Вставить("ДатаОкончанияДействия", ПолученныеДанные.ДатаОкончанияДействия);
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка
			|ИЗ	Справочник.ВидыДоходовКДБ КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.Код = &Код) И (НЕ Спр.ПометкаУдаления)
			|  И (Спр.ДатаНачалаДействия = &ДатаНачалаДействия)
			|  И (Спр.ДатаОкончанияДействия = &ДатаОкончанияДействия)
			|УПОРЯДОЧИТЬ ПО (ПИ.Ссылка ЕСТЬ NULL) УБЫВ";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		ДанныеИБ = Таб[0].Ссылка;
		Возврат;
	КонецЕсли;	
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка
			|ИЗ	Справочник.ВидыДоходовКДБ КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.Код = &Код) И (НЕ Спр.ПометкаУдаления) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И (((Спр.ДатаНачалаДействия <= &ДатаНачалаДействия) И (&ДатаНачалаДействия <= Спр.ДатаОкончанияДействия))
			|ИЛИ  ((Спр.ДатаНачалаДействия <= &ДатаОкончанияДействия) И (&ДатаОкончанияДействия <= Спр.ДатаОкончанияДействия)))
			|УПОРЯДОЧИТЬ ПО
			|(&ДатаОкончанияДействия = Спр.ДатаОкончанияДействия) УБЫВ,
			|(Спр.ДатаНачалаДействия = &ДатаНачалаДействия) УБЫВ,
			|((Спр.ДатаНачалаДействия <= &ДатаОкончанияДействия) И (&ДатаОкончанияДействия <= Спр.ДатаОкончанияДействия)) УБЫВ,
			|((Спр.ДатаНачалаДействия <= &ДатаНачалаДействия) И (&ДатаНачалаДействия <= Спр.ДатаОкончанияДействия)) УБЫВ";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		ДанныеИБ = Таб[0].Ссылка;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область Справочник_ВидКИФ

// Процедура добавляет обработчики для конвертации данных в вид КИФ при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ВидКИФ_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидКИФ_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыКИФ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ВидыКИФ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_ВидКИФ_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ВидКИФ_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Справочник_ВидКИФ_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Владелец";
	НоваяСтрока.СвойствоФормата = "Владелец";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтатьяКИФ_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в вид КИФ.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - СправочникОбъект.ВидыКИФ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ВидКИФ_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																   Знач ПолученныеДанные,
																   Знач КомпонентыОбмена)
	Перем Код;

	// Полный код складывается из кода группы, подгруппы КИФ, кода статьи КИФ и кода вида КИФ.
	Код = ПолучитьКод(ФИББГУМенеджерОбменаПовтИсп.ПолучитьВладельца(ПолученныеДанные.Владелец));
	Код = Код + ПолучитьКод(ПолученныеДанные.Владелец);
	Код = Код + ПолученныеДанные.Код;
	ПолученныеДанные.Наименование = Код;

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в вид КИФ.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.ВидыКИФ - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ВидыКИФ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ВидКИФ_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																	   Знач ПолученныеДанные,
																	   Знач КомпонентыОбмена)

	// Заполнение свойств объекта ИБ, если он есть в базе.
	Если (ДанныеИБ <> Неопределено) Тогда
		ДанныеИБ.ПометкаУдаления = ПолученныеДанные.ПометкаУдаления;
		Если ПолученныеДанные.Бюджет.Пустая() Тогда
			ПолученныеДанные.Бюджет = ДанныеИБ.Бюджет;
		КонецЕсли;	 
	КонецЕсли;

КонецПроцедуры

// Обработчик выполняет поиск вид КИФ.
//
// Параметры :
//	ДанныеИБ - СправочникСсылка.ВидыКИФ - найденный объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ВидыКИФ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ВидКИФ_Получение_АлгоритмПоиска(ДанныеИБ,
														 Знач ПолученныеДанные,
														 Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб, Запись;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Код", ПолученныеДанные.Код);
	Отбор.Вставить("Владелец", ПолученныеДанные.Владелец);
	Отбор.Вставить("Бюджет", ПолученныеДанные.Бюджет);
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка,
			|	Спр.Бюджет КАК Бюджет
			|ИЗ	Справочник.ВидыКИФ КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.Владелец = &Владелец) И (Спр.Код = &Код) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И ((Спр.Бюджет = &Бюджет) ИЛИ (&Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.ПустаяСсылка)))
			|УПОРЯДОЧИТЬ ПО Спр.ПометкаУдаления";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		Запись = Таб[0];
		ДанныеИБ = Запись.Ссылка;
		ПолученныеДанные.Бюджет = Запись.Бюджет;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область Справочник_ВидРасходовКРБ

// Процедура добавляет обработчики для конвертации данных в вид расходов КРБ при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ВидРасходовКРБ_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидРасходовКРБ_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыРасходовКРБ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ВидыРасходовКРБ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_ВидРасходовКРБ_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ВидРасходовКРБ_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Справочник_ВидРасходовКРБ_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаНачалаДействия";
	НоваяСтрока.СвойствоФормата = "НачалоДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаОкончанияДействия";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОкончаниеДействия";
	НоваяСтрока.СвойствоФормата = "ОкончаниеДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидРасходовКРБ_Получение";

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в вид расходов КРБ.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - СправочникОбъект.ВидыРасходовКРБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ВидРасходовКРБ_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																		   Знач ПолученныеДанные,
																		   Знач КомпонентыОбмена)

	Если ЗначениеЗаполнено(ПолученныеДанные.ОкончаниеДействия) Тогда
		ПолученныеДанные.ДатаОкончанияДействия = ПолученныеДанные.ОкончаниеДействия;
	Иначе
		ПолученныеДанные.ДатаОкончанияДействия = ДатаГоризонта();
	КонецЕсли;
	// Передача идентификатора в обработчик поиска.
	Знч = ИдентификаторXDTO(ДанныеXDTO);
	Если (Не ПустаяСтрока(Знч)) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("ИдентификаторXDTO", Знч);
	КонецЕсли;	

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в вид расходов КРБ.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.ВидыРасходовКРБ - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ВидыРасходовКРБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ВидРасходовКРБ_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																		       Знач ПолученныеДанные,
																			   Знач КомпонентыОбмена)

	// Заполнение свойств объекта ИБ, если он есть в базе.
	Если (ДанныеИБ <> Неопределено) Тогда
		ДанныеИБ.ПометкаУдаления = ПолученныеДанные.ПометкаУдаления;
		Если ПолученныеДанные.Бюджет.Пустая() Тогда
			ПолученныеДанные.Бюджет = ДанныеИБ.Бюджет;
		КонецЕсли;	 
	КонецЕсли;

КонецПроцедуры

// Обработчик выполняет поиск вида расходов КРБ.
//
// Параметры :
//	ДанныеИБ - СправочникСсылка.ВидыРасходовКРБ - найденный объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ВидыРасходовКРБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ВидРасходовКРБ_Получение_АлгоритмПоиска(ДанныеИБ,
																 Знач ПолученныеДанные,
																 Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб, Запись;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	ИначеЕсли ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Текст) Тогда
		ДанныеИБ = СсылкаПоИдентификатору(Текст, "Справочник.ВидыРасходовКРБ", КомпонентыОбмена.УзелКорреспондента);
		Если (ДанныеИБ <> Неопределено) Тогда
			Возврат;															
		КонецЕсли;	
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Код", ПолученныеДанные.Код);
	Отбор.Вставить("Бюджет", ПолученныеДанные.Бюджет);
	Отбор.Вставить("ДатаНачалаДействия", ПолученныеДанные.ДатаНачалаДействия);
	Отбор.Вставить("ДатаОкончанияДействия", ПолученныеДанные.ДатаОкончанияДействия);
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка,
			|	Спр.Бюджет КАК Бюджет
			|ИЗ	Справочник.ВидыРасходовКРБ КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.Код = &Код) И (НЕ Спр.ПометкаУдаления)
			|  И ((Спр.Бюджет = &Бюджет) ИЛИ (&Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.ПустаяСсылка)))
			|  И (Спр.ДатаНачалаДействия = &ДатаНачалаДействия)
			|  И (Спр.ДатаОкончанияДействия = &ДатаОкончанияДействия)
			|УПОРЯДОЧИТЬ ПО (ПИ.Ссылка ЕСТЬ NULL) УБЫВ";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		Запись = Таб[0];
		ДанныеИБ = Запись.Ссылка;
		ПолученныеДанные.Бюджет = Запись.Бюджет;
		Возврат;
	КонецЕсли;	
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка,
			|	Спр.Бюджет КАК Бюджет
			|ИЗ	Справочник.ВидыРасходовКРБ КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.Код = &Код) И (НЕ Спр.ПометкаУдаления) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И ((Спр.Бюджет = &Бюджет) ИЛИ (&Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.ПустаяСсылка)))
			|  И (((Спр.ДатаНачалаДействия <= &ДатаНачалаДействия) И (&ДатаНачалаДействия <= Спр.ДатаОкончанияДействия))
			|ИЛИ  ((Спр.ДатаНачалаДействия <= &ДатаОкончанияДействия) И (&ДатаОкончанияДействия <= Спр.ДатаОкончанияДействия)))
			|УПОРЯДОЧИТЬ ПО
			|(&ДатаОкончанияДействия = Спр.ДатаОкончанияДействия) УБЫВ,
			|(Спр.ДатаНачалаДействия = &ДатаНачалаДействия) УБЫВ,
			|((Спр.ДатаНачалаДействия <= &ДатаОкончанияДействия) И (&ДатаОкончанияДействия <= Спр.ДатаОкончанияДействия)) УБЫВ,
			|((Спр.ДатаНачалаДействия <= &ДатаНачалаДействия) И (&ДатаНачалаДействия <= Спр.ДатаОкончанияДействия)) УБЫВ";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		Запись = Таб[0];
		ДанныеИБ = Запись.Ссылка;
		ПолученныеДанные.Бюджет = Запись.Бюджет;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область Справочник_ВидЦелевыхСредств

// Процедура добавляет обработчики для конвертации данных в вид целевых средств при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ВидЦелевыхСредств_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ВидЦелевыхСредств_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ВидыЦелевыхСредств;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ВидыЦелевыхСредств";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидЦелевыхСредств_Получение";
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Код");

КонецПроцедуры

#КонецОбласти

#Область Справочник_ГлаваПоБюджетнойКлассификации

// Процедура добавляет обработчики для конвертации данных в главу по БК при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ГлаваПоБюджетнойКлассификации_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ГлаваПоБюджетнойКлассификации_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ГлавыПоБюджетнойКлассификации;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ГлавыПоБюджетнойКлассификации";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_ГлаваПоБюджетнойКлассификации_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ГлаваПоБюджетнойКлассификации_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Справочник_ГлаваПоБюджетнойКлассификации_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаНачалаДействия";
	НоваяСтрока.СвойствоФормата = "НачалоДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаОкончанияДействия";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОкончаниеДействия";
	НоваяСтрока.СвойствоФормата = "ОкончаниеДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Получение";

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в главу по БК.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - СправочникОбъект.ГлавыПоБюджетнойКлассификации - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ГлаваПоБюджетнойКлассификации_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																						  Знач ПолученныеДанные,
																						  Знач КомпонентыОбмена)
	Перем Знч;
																						  
	Если ЗначениеЗаполнено(ПолученныеДанные.ОкончаниеДействия) Тогда
		ПолученныеДанные.ДатаОкончанияДействия = ПолученныеДанные.ОкончаниеДействия;
	Иначе
		ПолученныеДанные.ДатаОкончанияДействия = ДатаГоризонта();
	КонецЕсли;
	// Передача идентификатора в обработчик поиска.
	Знч = ИдентификаторXDTO(ДанныеXDTO);
	Если (Не ПустаяСтрока(Знч)) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("ИдентификаторXDTO", Знч);
	КонецЕсли;	

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в главу по БК.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.ГлавыПоБюджетнойКлассификации - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ГлавыПоБюджетнойКлассификации - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ГлаваПоБюджетнойКлассификации_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																							  Знач ПолученныеДанные,
																							  Знач КомпонентыОбмена)

	// Заполнение свойств объекта ИБ, если он есть в базе.
	Если (ДанныеИБ <> Неопределено) Тогда
		ДанныеИБ.ПометкаУдаления = ПолученныеДанные.ПометкаУдаления;
		Если ПолученныеДанные.Бюджет.Пустая() Тогда
			ПолученныеДанные.Бюджет = ДанныеИБ.Бюджет;
		КонецЕсли;	 
	КонецЕсли;

КонецПроцедуры

// Обработчик выполняет поиск главы по БК.
//
// Параметры :
//	ДанныеИБ - СправочникСсылка.ГлавыПоБюджетнойКлассификации - найденный объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ГлавыПоБюджетнойКлассификации - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ГлаваПоБюджетнойКлассификации_Получение_АлгоритмПоиска(ДанныеИБ,
																				Знач ПолученныеДанные,
																				Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб, Запись;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	ИначеЕсли ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Текст) Тогда
		ДанныеИБ = СсылкаПоИдентификатору(Текст, "Справочник.ГлавыПоБюджетнойКлассификации", КомпонентыОбмена.УзелКорреспондента);
		Если (ДанныеИБ <> Неопределено) Тогда
			Возврат;															
		КонецЕсли;	
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Код", ПолученныеДанные.Код);
	Отбор.Вставить("Бюджет", ПолученныеДанные.Бюджет);
	Отбор.Вставить("ДатаНачалаДействия", ПолученныеДанные.ДатаНачалаДействия);
	Отбор.Вставить("ДатаОкончанияДействия", ПолученныеДанные.ДатаОкончанияДействия);
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка,
			|	Спр.Бюджет КАК Бюджет
			|ИЗ	Справочник.ГлавыПоБюджетнойКлассификации КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.Код = &Код) И (НЕ Спр.ПометкаУдаления)
			|  И ((Спр.Бюджет = &Бюджет) ИЛИ (&Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.ПустаяСсылка)))
			|  И (Спр.ДатаНачалаДействия = &ДатаНачалаДействия)
			|  И (Спр.ДатаОкончанияДействия = &ДатаОкончанияДействия)
			|УПОРЯДОЧИТЬ ПО (ПИ.Ссылка ЕСТЬ NULL) УБЫВ";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		Запись = Таб[0];
		ДанныеИБ = Запись.Ссылка;
		ПолученныеДанные.Бюджет = Запись.Бюджет;
		Возврат;
	КонецЕсли;	
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка,
			|	Спр.Бюджет КАК Бюджет
			|ИЗ	Справочник.ГлавыПоБюджетнойКлассификации КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.Код = &Код) И (НЕ Спр.ПометкаУдаления) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И ((Спр.Бюджет = &Бюджет) ИЛИ (&Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.ПустаяСсылка)))
			|  И (((Спр.ДатаНачалаДействия <= &ДатаНачалаДействия) И (&ДатаНачалаДействия <= Спр.ДатаОкончанияДействия))
			|ИЛИ  ((Спр.ДатаНачалаДействия <= &ДатаОкончанияДействия) И (&ДатаОкончанияДействия <= Спр.ДатаОкончанияДействия)))
			|УПОРЯДОЧИТЬ ПО
			|(&ДатаОкончанияДействия = Спр.ДатаОкончанияДействия) УБЫВ,
			|(Спр.ДатаНачалаДействия = &ДатаНачалаДействия) УБЫВ,
			|((Спр.ДатаНачалаДействия <= &ДатаОкончанияДействия) И (&ДатаОкончанияДействия <= Спр.ДатаОкончанияДействия)) УБЫВ,
			|((Спр.ДатаНачалаДействия <= &ДатаНачалаДействия) И (&ДатаНачалаДействия <= Спр.ДатаОкончанияДействия)) УБЫВ";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		Запись = Таб[0];
		ДанныеИБ = Запись.Ссылка;
		ПолученныеДанные.Бюджет = Запись.Бюджет;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область Справочник_ГруппаПодвидаКДБ

// Процедура добавляет обработчики для конвертации данных в подвид доходов при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ГруппаПодвидаКДБ_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ГруппаПодвидаКДБ_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ГруппыПодвидовКДБ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ГруппыПодвидовКДБ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_ГруппаПодвидаКДБ_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ГруппаПодвидаКДБ_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Справочник_ГруппаПодвидаКДБ_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидДохода";
	НоваяСтрока.СвойствоФормата = "ВидДохода";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидДоходовКДБ_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в подвид доходов.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - СправочникОбъект.ГруппыПодвидовКДБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ГруппаПодвидаКДБ_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																			 Знач ПолученныеДанные,
																			 Знач КомпонентыОбмена)
	Перем Код;

	// Полный код складывается из кода вида доходов и кода подвида доходов.
	Если ПолученныеДанные.ВидДохода.Пустая() Тогда
		Код = "0000000000";
	Иначе	
		Код = ПолучитьКод(ПолученныеДанные.ВидДохода);
	КонецЕсли;	
	Код = Код + ПолученныеДанные.Код;
	Код = Код + "000";
	ПолученныеДанные.Наименование = Код;

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в подвид доходов.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.ГруппыПодвидовКДБ - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ГруппыПодвидовКДБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ГруппаПодвидаКДБ_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																				 Знач ПолученныеДанные,
																				 Знач КомпонентыОбмена)

	// Заполнение свойств объекта ИБ, если он есть в базе.
	Если (ДанныеИБ <> Неопределено) Тогда
		ДанныеИБ.ПометкаУдаления = ПолученныеДанные.ПометкаУдаления;
		Если ПолученныеДанные.Бюджет.Пустая() Тогда
			ПолученныеДанные.Бюджет = ДанныеИБ.Бюджет;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Обработчик выполняет поиск подвида доходов.
//
// Параметры :
//	ДанныеИБ - СправочникСсылка.ГруппыПодвидовКДБ - найденный объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ГруппыПодвидовКДБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ГруппаПодвидаКДБ_Получение_АлгоритмПоиска(ДанныеИБ,
																   Знач ПолученныеДанные,
																   Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб, Запись;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Код", ПолученныеДанные.Код);
	Отбор.Вставить("ВидДохода", ПолученныеДанные.ВидДохода);
	Отбор.Вставить("Бюджет", ПолученныеДанные.Бюджет);
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка,
			|	Спр.Бюджет КАК Бюджет
			|ИЗ	Справочник.ГруппыПодвидовКДБ КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.ВидДохода = &ВидДохода) И (Спр.Код = &Код) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И ((Спр.Бюджет = &Бюджет) ИЛИ (&Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.ПустаяСсылка)))
			|УПОРЯДОЧИТЬ ПО Спр.ПометкаУдаления";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		Запись = Таб[0];
		ДанныеИБ = Запись.Ссылка;
		ПолученныеДанные.Бюджет = Запись.Бюджет;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Справочник_ГруппаПодгруппаКИФ

// Процедура добавляет обработчики для конвертации данных в группу, подгруппу КИФ при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ГруппаПодгруппаКИФ_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, КонвертацияТабличнойЧасти, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ГруппаПодгруппаКИФ_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ГруппыПодгруппыКИФ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ГруппыПодгруппыКИФ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ГруппаПодгруппаКИФ_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ГруппаПодгруппаКИФ_Получение";
	
	ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "ДопустимыеКОСГУ";
    КонвертацияТабличнойЧасти.ТЧФормата = "ДопустимыеКОСГУ";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КОСГУ";
	НоваяСтрока.СвойствоФормата = "КОСГУ";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Код");

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в группу, подгруппу КИФ.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.ГруппыПодгруппыКИФ - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ГруппыПодгруппыКИФ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ГруппаПодгруппаКИФ_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																				   Знач ПолученныеДанные,
																				   Знач КомпонентыОбмена)
 	// Заполнение свойств объекта ИБ, если он есть в базе.
	Если (ДанныеИБ <> Неопределено) Тогда
		ДанныеИБ.ПометкаУдаления = ПолученныеДанные.ПометкаУдаления;
		ПолученныеДанные.ЭлементГруппа = ДанныеИБ.ЭлементГруппа;
		ПолученныеДанные.Элемент = ДанныеИБ.Элемент;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Справочник_Договор

// Процедура добавляет обработчики для конвертации данных в договор при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Договор_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Договор_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Договоры;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Договоры";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_Договор_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_Договор_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организация_Получение";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидОбязательства";
	НоваяСтрока.СвойствоФормата = "ВидДоговора";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаДоговора";
	НоваяСтрока.СвойствоФормата = "ДатаДоговора";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НомерДоговора";
	НоваяСтрока.СвойствоФормата = "НомерДоговора";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидДоговора";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЗаключаетсяПоРезультатамКонкурсныхПроцедур";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПризнакЗавершенияКонкурсныхПроцедур";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "РезультатЗавершенияКонкурсныхПроцедур";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Контрагент";
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагент_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КраткоеСодержание";
	НоваяСтрока.СвойствоФормата = "КраткоеСодержание";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НормативноПравовойАкт";
	НоваяСтрока.СвойствоФормата = "НормативноПравовойАкт";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "УчетПредметаДоговора";
	НоваяСтрока.СвойствоФормата = "УчетПредметаДоговора";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВАрхиве";
	НоваяСтрока.СвойствоФормата = "ВАрхиве";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаПомещенияВАрхив";
	НоваяСтрока.СвойствоФормата = "ДатаПомещенияВАрхив";
	
	ПравилоКонвертации.ПоляПоиска.Добавить("ВидДоговора,ВидОбязательства,ДатаДоговора,НомерДоговора,Организация");
	ПравилоКонвертации.ПоляПоиска.Добавить("ВидОбязательства,ДатаДоговора,НомерДоговора,Организация");

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в договор.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - СправочникОбъект.Договоры - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_Договор_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																	Знач ПолученныеДанные,
																	Знач КомпонентыОбмена)
	Перем ВД, Знч;
	
	// Конкурсные процедуры.
	Знч = ДанныеXDTO.Свойство("ЗаключаетсяПоРезультатамКонкурсныхПроцедур", Знч) И (Знч = Истина);
	ПолученныеДанные.ЗаключаетсяПоРезультатамКонкурсныхПроцедур = Знч;
	// Вид договора.
	ВД = НРег(СокрЛП(КлючевойРеквизит(ДанныеXDTO, "ВидДоговора")));
	Если ПустаяСтрока(ВД) Тогда
		ВД = НРег(СокрЛП(ПолученныеДанные.ВидОбязательства));
	КонецЕсли;	
	Если (ВД = "контракт") Тогда
		ПолученныеДанные.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		Если ПолученныеДанные.ЗаключаетсяПоРезультатамКонкурсныхПроцедур Тогда
			ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Истина;
			ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 1;
		Иначе
			ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Ложь;
			ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 0;
		КонецЕсли;	
	ИначеЕсли (ВД = "проект контракта") Тогда
		ПолученныеДанные.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		ПолученныеДанные.ЗаключаетсяПоРезультатамКонкурсныхПроцедур = Истина;
		ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Истина;
		ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 1;
	ИначеЕсли (ВД = "договор") Тогда
		ПолученныеДанные.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		Знч = ДанныеXDTO.Свойство("ЗаключаетсяПоРезультатамКонкурсныхПроцедур", Знч) И (Знч = Истина);
		Если ПолученныеДанные.ЗаключаетсяПоРезультатамКонкурсныхПроцедур Тогда
			ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Истина;
			ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 1;
		Иначе
			ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Ложь;
			ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 0;
		КонецЕсли;	
	ИначеЕсли (ВД = "соглашение") Тогда
		ПолученныеДанные.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ИноеОбязательство;
		ПолученныеДанные.ЗаключаетсяПоРезультатамКонкурсныхПроцедур = Ложь;
		ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Ложь;
		ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 0;
	ИначеЕсли (ВД = "нормативный правовой акт") Тогда
		ПолученныеДанные.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ИноеОбязательство;
		ПолученныеДанные.ЗаключаетсяПоРезультатамКонкурсныхПроцедур = Ложь;
		ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Ложь;
		ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 0;
	ИначеЕсли (ВД = "исполнительный документ") Тогда
		ПолученныеДанные.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ИноеОбязательство;
		ПолученныеДанные.ЗаключаетсяПоРезультатамКонкурсныхПроцедур = Ложь;
		ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Ложь;
		ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 0;
	ИначеЕсли (ВД = "решение налогового органа") Тогда
		ПолученныеДанные.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ИноеОбязательство;
		ПолученныеДанные.ЗаключаетсяПоРезультатамКонкурсныхПроцедур = Ложь;
		ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Ложь;
		ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 0;
	ИначеЕсли (ВД = "извещение об осуществлении закупки") Тогда
		ПолученныеДанные.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		ПолученныеДанные.ЗаключаетсяПоРезультатамКонкурсныхПроцедур = Истина;
		ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Ложь;
		ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 0;
	ИначеЕсли (ВД = "приглашение принять участие в определении поставщика (подрядчика, исполнителя)") Тогда
		ПолученныеДанные.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		ПолученныеДанные.ЗаключаетсяПоРезультатамКонкурсныхПроцедур = Истина;
		ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Ложь;
		ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 0;
	Иначе
		ПолученныеДанные.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ИноеОбязательство;
		Если ПолученныеДанные.ЗаключаетсяПоРезультатамКонкурсныхПроцедур Тогда
			ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Истина;
			ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 1;
		Иначе
			ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = Ложь;
			ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = 0;
		КонецЕсли;	
	КонецЕсли;
	// Наименование договора.
	ПолученныеДанные.Наименование = СокрЛП(КлючевойРеквизит(ДанныеXDTO, "ВидДоговора")) + " " + НСтр("ru = '№'") 
									+ СокрЛП(КлючевойРеквизит(ДанныеXDTO, "НомерДоговора")) + " " + НСтр("ru = 'от'")
									+ " " + Формат(КлючевойРеквизит(ДанныеXDTO, "ДатаДоговора"), "ДФ=dd.MM.yyyy");
	// Учетный номер.
	Знч = СокрЛП(КлючевойРеквизит(ДанныеXDTO, "НомерОбязательства"));
	Если (Не ПустаяСтрока(Знч)) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("УчетныйНомер", Знч);
	КонецЕсли;	
	
КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в договор.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.Договоры - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.Договоры - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_Договор_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																		Знач ПолученныеДанные,
																		Знач КомпонентыОбмена)
	Перем Флаг, УчетныйНомер, Ссылка;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Если ПолученныеДанные.ДополнительныеСвойства.Свойство("УчетныйНомер", УчетныйНомер) Тогда
		УчетныйНомер = СокрЛП(УчетныйНомер);
	Иначе	
		УчетныйНомер = "";
	КонецЕсли;
	Если (ДанныеИБ = Неопределено) Тогда
		ПолученныеДанные.УстановитьНовыйКод();
		Если (Не ПустаяСтрока(УчетныйНомер)) Тогда
			Ссылка = ПолученныеДанные.Ссылка;
			Если Ссылка.Пустая() Тогда
				Ссылка = ПолученныеДанные.ПолучитьСсылкуНового();
				Если Ссылка.Пустая() Тогда
					Ссылка = Справочники.Договоры.ПолучитьСсылку();
					ПолученныеДанные.УстановитьСсылкуНового(Ссылка);
				КонецЕсли;
			КонецЕсли;
			ДобавитьУчетныйНомер(УчетныйНомер, Ссылка);
		КонецЕсли;	
	Иначе
		Флаг = (ПолученныеДанные.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ИноеОбязательство);
		Флаг = Флаг И (Не ДанныеИБ.ВидДоговора.Пустая());
		Если Флаг Тогда
			ПолученныеДанные.ВидДоговора = ДанныеИБ.ВидДоговора;
			ПолученныеДанные.ЗаключаетсяПоРезультатамКонкурсныхПроцедур = ДанныеИБ.ЗаключаетсяПоРезультатамКонкурсныхПроцедур;
			ПолученныеДанные.ПризнакЗавершенияКонкурсныхПроцедур = ДанныеИБ.ПризнакЗавершенияКонкурсныхПроцедур;
			ПолученныеДанные.РезультатЗавершенияКонкурсныхПроцедур = ДанныеИБ.РезультатЗавершенияКонкурсныхПроцедур;
		КонецЕсли;
		ДобавитьУчетныйНомер(УчетныйНомер, ДанныеИБ.Ссылка);
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область Справочник_ИсточникФинансовогоОбеспечения

// Процедура добавляет обработчики для конвертации данных в ИФО при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ИФО_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	Если (Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО")) Тогда
		Возврат;
	КонецЕсли;	
	
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ИФО_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ИсточникиФинансовогоОбеспечения;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ИсточникиФинансовогоОбеспечения";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ИФО_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодГлавыБК";
	НоваяСтрока.СвойствоФормата = "КодГлавыБК";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ГлаваПоБюджетнойКлассификации_Получение";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

	ПравилоКонвертации.ПоляПоиска.Добавить("КодГлавыБК,Бюджет");
	ПравилоКонвертации.ПоляПоиска.Добавить("КодГлавыБК");

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в ИФО.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.ИсточникиФинансовогоОбеспечения - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ИсточникиФинансовогоОбеспечения - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ИФО_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																	Знач ПолученныеДанные,
																	Знач КомпонентыОбмена)
	Перем Стр;

	Стр = НСтр("ru = 'Наименование будет заполнено при следующей синхронизации данных (можно изменить вручную)'");
	Если (ДанныеИБ = Неопределено) Тогда
		Если ПустаяСтрока(ПолученныеДанные.Наименование) Тогда
			ПолученныеДанные.Наименование = Стр;
		КонецЕсли;	
		ПолученныеДанные.ИспользоватьРеквизитыИФО = Истина;
	Иначе									
		Если ПустаяСтрока(ПолученныеДанные.Наименование) Тогда
			ПолученныеДанные.Наименование = ДанныеИБ.Наименование;
		ИначеЕсли ((ДанныеИБ.Наименование <> Стр) И (Не ПустаяСтрока(ДанныеИБ.Наименование))) Тогда																						   
			ПолученныеДанные.Наименование = ДанныеИБ.Наименование;
		КонецЕсли;
		ПолученныеДанные.ИспользоватьРеквизитыИФО = ДанныеИБ.ИспользоватьРеквизитыИФО;
		Если (Не ДанныеИБ.Бюджет.Пустая()) Тогда
			ПолученныеДанные.Бюджет = ДанныеИБ.Бюджет;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Справочник_Казначейство

// Процедура добавляет обработчики для конвертации данных в казначейство при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Казначейство_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Казначейство_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Казначейства;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Казначейства";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_Казначейство_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИНН";
	НоваяСтрока.СвойствоФормата = "ИНН";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПП";
	НоваяСтрока.СвойствоФормата = "КПП";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодОКПО";
	НоваяСтрока.СвойствоФормата = "КодОКПО";

	ПравилоКонвертации.ПоляПоиска.Добавить("Код");
	ПравилоКонвертации.ПоляПоиска.Добавить("ИНН,КПП");
	ПравилоКонвертации.ПоляПоиска.Добавить("ИНН");

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в казначейство.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.Казначейства - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.Казначейства - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_Казначейство_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																			 Знач ПолученныеДанные,
																			 Знач КомпонентыОбмена)
	Перем Флаг;

	Если (ДанныеИБ <> Неопределено) Тогда
		Флаг = (Не ПустаяСтрока(ДанныеИБ.КодОКПО));
		Флаг = Флаг И ПустаяСтрока(ПолученныеДанные.КодОКПО);
		Если Флаг Тогда
			ПолученныеДанные.КодОКПО = ДанныеИБ.КодОКПО;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Справочник_КлассификаторЕдиницИзмерения

// Процедура добавляет обработчики для конвертации данных в классификатор единиц измерения при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_КЕИ_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_КЕИ_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.КлассификаторЕдиницИзмерения;
	ПравилоКонвертации.ОбъектФормата = "Справочник.КлассификаторЕдиницИзмерения";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "УсловноеОбозначение";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "МеждународноеСокращение";
	НоваяСтрока.СвойствоФормата = "МеждународноеСокращение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеМеждународное";
	НоваяСтрока.СвойствоФормата = "НаименованиеМеждународное";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НациональноеСокращение";
	НоваяСтрока.СвойствоФормата = "НациональноеСокращение";

	ПравилоКонвертации.ПоляПоиска.Добавить("Код");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");

КонецПроцедуры

#КонецОбласти

#Область Справочник_Контрагент

// Процедура добавляет обработчики для конвертации данных в контрагента при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Контрагент_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Контрагент_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Контрагенты;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Контрагенты";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_Контрагент_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_Контрагент_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИНН";
	НоваяСтрока.СвойствоФормата = "ИНН";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПП";
	НоваяСтрока.СвойствоФормата = "КПП";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеСокращенное";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидКонтрагента";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ТипКонтрагента";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

	ПравилоКонвертации.ПоляПоиска.Добавить("ИНН,КПП");
	ПравилоКонвертации.ПоляПоиска.Добавить("ИНН");

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в контрагента.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - СправочникОбъект.Контрагенты - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_Контрагент_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																	   Знач ПолученныеДанные,
																	   Знач КомпонентыОбмена)
	Перем Знч, Бюджет;
	
	// Передача кода УБП для создания подчиненных элементов справочников.
	Знч = СокрЛП(КлючевойРеквизит(ДанныеXDTO, "КодУчреждения"));
	Если (Не ПустаяСтрока(Знч)) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("КодУчреждения", Знч);
	КонецЕсли;
	// Заполнение вида контрагента.
	Если (ДанныеXDTO.Свойство("ЮрЛицо", Знч) И (Знч = "0")) Тогда
		ПолученныеДанные.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо;
	Иначе
		ПолученныеДанные.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо;
	КонецЕсли;
	// Заполнение типа контрагента.
	Если (ДанныеXDTO.Свойство("ТипКонтрагента", Знч) И (Не ПустаяСтрока(Знч))) Тогда
		ПолученныеДанные.ТипКонтрагента = ФИББГУМенеджерОбменаПовтИсп.НайтиТипКонтрагента(Знч);
	КонецЕсли;
	// Передача полного наименования для создания подчиненных элементов справочников.
	Если (ДанныеXDTO.Свойство("НаименованиеПолное", Знч) И (Не ПустаяСтрока(Знч))) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("НаименованиеПолное", Знч);
	КонецЕсли;
	// Передача ОГРН для создания подчиненных элементов справочников.
	Если (ДанныеXDTO.Свойство("ОГРН", Знч) И (Не ПустаяСтрока(Знч))) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("ОГРН", Знч);
	КонецЕсли;
	// Передача КодОКПО для создания подчиненных элементов справочников.
	Если (ДанныеXDTO.Свойство("КодОКПО", Знч) И (Не ПустаяСтрока(Знч))) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("КодОКПО", Знч);
	КонецЕсли;
	// Передача фамилии для заполнения подчиненных структур.
	Если (ДанныеXDTO.Свойство("Фамилия", Знч) И (Не ПустаяСтрока(Знч))) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("Фамилия", Знч);
	КонецЕсли;
	// Передача имени для заполнения подчиненных структур.
	Если (ДанныеXDTO.Свойство("Имя", Знч) И (Не ПустаяСтрока(Знч))) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("Имя", Знч);
	КонецЕсли;
	// Передача отчества для заполнения подчиненных структур.
	Если (ДанныеXDTO.Свойство("Отчество", Знч) И (Не ПустаяСтрока(Знч))) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("Отчество", Знч);
	КонецЕсли;
	// Передача СНИЛС для создания подчиненных элементов справочников.
	Если (ДанныеXDTO.Свойство("СНИЛС", Знч) И (Не ПустаяСтрока(Знч))) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("СНИЛС", Знч);
	КонецЕсли;
	// Передача бюджета для создания подчиненных элементов справочников.
	Если (ДанныеXDTO.Свойство("Бюджет", Бюджет) И (ТипЗнч(Бюджет) = Тип("Структура"))) Тогда
		Если Бюджет.Свойство("Код", Знч) Тогда
			ПолученныеДанные.ДополнительныеСвойства.Вставить("Бюджет", Знч);
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в контрагента.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.Контрагенты - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.Контрагенты - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_Контрагент_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																		   Знач ПолученныеДанные,
																		   Знач КомпонентыОбмена)
	Перем Объект, Знч, Флаг, Рег, Запись;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	// Если объект был в базе, то оставляем некоторые свойства без изменений.
	Если (ДанныеИБ <> Неопределено) Тогда
		ДанныеИБ.ПометкаУдаления = ПолученныеДанные.ПометкаУдаления;
		ПолученныеДанные.ЮридическоеФизическоеЛицо = ДанныеИБ.ЮридическоеФизическоеЛицо;
		ДанныеИБ.ВидКонтрагента = ПолученныеДанные.ВидКонтрагента;
		Если ПолученныеДанные.ТипКонтрагента.Пустая() Тогда
			ПолученныеДанные.ТипКонтрагента = ДанныеИБ.ТипКонтрагента;
		Иначе
			ДанныеИБ.ТипКонтрагента = ПолученныеДанные.ТипКонтрагента;
		КонецЕсли;
	КонецЕсли;
	// Создание подчиненных элементов справочников.	
	Если (ПолученныеДанные.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо) Тогда
		Если (ТипЗнч(ПолученныеДанные.ЮридическоеФизическоеЛицо) <> Тип("СправочникСсылка.ФизическиеЛица")) Тогда
			ПолученныеДанные.ЮридическоеФизическоеЛицо = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПолученныеДанные.ЮридическоеФизическоеЛицо) Тогда
			Объект = ПолученныеДанные.ЮридическоеФизическоеЛицо.ПолучитьОбъект();
		Иначе
			Объект = Неопределено;
		КонецЕсли;
		Если (Объект = Неопределено) Тогда
			Объект = Справочники.ФизическиеЛица.СоздатьЭлемент();
			Объект.Наименование = ПолученныеДанные.Наименование;
			Объект.ИНН = ПолученныеДанные.ИНН;
			Объект.КПП = ПолученныеДанные.КПП;
			Если ПолученныеДанные.ДополнительныеСвойства.Свойство("КодОКПО", Знч) Тогда
				Объект.КодОКПО = Знч;
			КонецЕсли;	
			Если ПолученныеДанные.ДополнительныеСвойства.Свойство("СНИЛС", Знч) Тогда
				Объект.СтраховойНомерПФР = Знч;
			КонецЕсли;	
			Объект.СтранаРегистрации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СтраныМира.Россия");
			Объект.УстановитьНовыйКод();
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать();
			ПолученныеДанные.ЮридическоеФизическоеЛицо = Объект.Ссылка;
		Иначе
			Флаг = Ложь;
			Если (ПолученныеДанные.Наименование <> Объект.Наименование) Тогда
				Объект.Наименование = ПолученныеДанные.Наименование;
				Флаг = Истина;
			КонецЕсли;
			Если (ПолученныеДанные.ИНН <> Объект.ИНН) Тогда
				Объект.ИНН = ПолученныеДанные.ИНН;
				Флаг = Истина;
			КонецЕсли;
			Если (ПолученныеДанные.КПП <> Объект.КПП) Тогда
				Объект.КПП = ПолученныеДанные.КПП;
				Флаг = Истина;
			КонецЕсли;
			Если ПолученныеДанные.ДополнительныеСвойства.Свойство("КодОКПО", Знч) Тогда
				Если (Знч <> Объект.КодОКПО) Тогда
					Объект.КодОКПО = Знч;
					Флаг = Истина;
				КонецЕсли;
			КонецЕсли;
			Если ПолученныеДанные.ДополнительныеСвойства.Свойство("СНИЛС", Знч) Тогда
				Если (Знч <> Объект.СтраховойНомерПФР) Тогда
					Объект.СтраховойНомерПФР = Знч;
					Флаг = Истина;
				КонецЕсли;
			КонецЕсли;
			Если Флаг Тогда
				Объект.ОбменДанными.Загрузка = Истина;
				Объект.Записать();
			КонецЕсли;
		КонецЕсли;
		// ФИО.           
		Знч = ПолученныеДанные.ДополнительныеСвойства;
		Флаг = Знч.Свойство("Фамилия") Или Знч.Свойство("Имя") Или Знч.Свойство("Отчество");
		Если Флаг Тогда
			Рег = РегистрыСведений.ФИОФизическихЛиц.СоздатьНаборЗаписей();
			Рег.Отбор.ФизическоеЛицо.Установить(Объект.Ссылка);
			Запись = Рег.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Знч);
			Запись.ФизическоеЛицо = Объект.Ссылка;
			Запись.Период = ТекущаяДатаСеанса();
			Рег.ОбменДанными.Загрузка = Истина;
			Рег.Записать(Истина);
		КонецЕсли;	
	Иначе
		Если (ТипЗнч(ПолученныеДанные.ЮридическоеФизическоеЛицо) <> Тип("СправочникСсылка.ЮридическиеЛица")) Тогда
			ПолученныеДанные.ЮридическоеФизическоеЛицо = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПолученныеДанные.ЮридическоеФизическоеЛицо) Тогда
			Объект = ПолученныеДанные.ЮридическоеФизическоеЛицо.ПолучитьОбъект();
		Иначе
			Объект = Неопределено;
		КонецЕсли;
		Если (Объект = Неопределено) Тогда
			Объект = Справочники.ЮридическиеЛица.СоздатьЭлемент();
			Объект.Наименование = ПолученныеДанные.Наименование;
			Объект.НаименованиеПолное = ПолученныеДанные.Наименование;
			Объект.ИНН = ПолученныеДанные.ИНН;
			Объект.КПП = ПолученныеДанные.КПП;
			Если ПолученныеДанные.ДополнительныеСвойства.Свойство("НаименованиеПолное", Знч) Тогда
				Объект.НаименованиеПолное = Знч;
			КонецЕсли;
			Если ПолученныеДанные.ДополнительныеСвойства.Свойство("КодУчреждения", Знч) Тогда
				Объект.КодПоРПБС = Знч;
				Если (Не ПустаяСтрока(Знч)) Тогда
					Знч = "";
					ПолученныеДанные.ДополнительныеСвойства.Свойство("Бюджет", Знч);
					Объект.Бюджет = ФИББГУМенеджерОбменаПовтИсп.НайтиБюджет(Знч);
				КонецЕсли;	
			КонецЕсли;
			Если ПолученныеДанные.ДополнительныеСвойства.Свойство("ОГРН", Знч) Тогда
				Объект.ОГРН = Знч;
			КонецЕсли;	
			Если ПолученныеДанные.ДополнительныеСвойства.Свойство("КодОКПО", Знч) Тогда
				Объект.КодОКПО = Знч;
			КонецЕсли;	
			Объект.СтранаРегистрации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СтраныМира.Россия");
			Объект.УстановитьНовыйКод();
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать();
			ПолученныеДанные.ЮридическоеФизическоеЛицо = Объект.Ссылка;
		Иначе
			Флаг = Ложь;
			Если (ПолученныеДанные.Наименование <> Объект.Наименование) Тогда
				Объект.Наименование = ПолученныеДанные.Наименование;
				Флаг = Истина;
			КонецЕсли;
			Если (ПолученныеДанные.ИНН <> Объект.ИНН) Тогда
				Объект.ИНН = ПолученныеДанные.ИНН;
				Флаг = Истина;
			КонецЕсли;
			Если (ПолученныеДанные.КПП <> Объект.КПП) Тогда
				Объект.КПП = ПолученныеДанные.КПП;
				Флаг = Истина;
			КонецЕсли;
			Если ПолученныеДанные.ДополнительныеСвойства.Свойство("НаименованиеПолное", Знч) Тогда
				Если (Знч <> Объект.НаименованиеПолное) Тогда
					Объект.НаименованиеПолное = Знч;
					Флаг = Истина;
				КонецЕсли;
			КонецЕсли;
			Если ПолученныеДанные.ДополнительныеСвойства.Свойство("КодУчреждения", Знч) Тогда
				Если (Знч <> Объект.КодПоРПБС) Тогда
					Объект.КодПоРПБС = Знч;
					Флаг = Истина;
				КонецЕсли;
			КонецЕсли;
			Если ((Не ПустаяСтрока(Объект.КодПоРПБС)) И ПолученныеДанные.ДополнительныеСвойства.Свойство("Бюджет", Знч)) Тогда
				Знч = ФИББГУМенеджерОбменаПовтИсп.НайтиБюджет(Знч);
				Если (Знч <> Объект.Бюджет) Тогда
					Объект.Бюджет = Знч;
					Флаг = Истина;
				КонецЕсли;
			КонецЕсли;
			Если ПолученныеДанные.ДополнительныеСвойства.Свойство("ОГРН", Знч) Тогда
				Если (Знч <> Объект.ОГРН) Тогда
					Объект.ОГРН = Знч;
					Флаг = Истина;
				КонецЕсли;
			КонецЕсли;
			Если ПолученныеДанные.ДополнительныеСвойства.Свойство("КодОКПО", Знч) Тогда
				Если (Знч <> Объект.КодОКПО) Тогда
					Объект.КодОКПО = Знч;
					Флаг = Истина;
				КонецЕсли;
			КонецЕсли;
			Если Флаг Тогда
				Объект.ОбменДанными.Загрузка = Истина;
				Объект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Заполнение в объекте в базе ссылки на подчиненный элемент справочника.
	Если (ДанныеИБ <> Неопределено) Тогда
		ДанныеИБ.ЮридическоеФизическоеЛицо = ПолученныеДанные.ЮридическоеФизическоеЛицо;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Справочник_КОСГУ

// Процедура добавляет обработчики для конвертации данных в КОСГУ при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_КОСГУ_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_КОСГУ_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.КОСГУ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.КОСГУ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Код");

КонецПроцедуры

#КонецОбласти

#Область Справочник_ЛицевойСчет

// Процедура добавляет обработчики для конвертации данных в лицевой счет при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила.
//
Процедура ДобавитьПКО_Справочник_ЛицевойСчет_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ЛицевойСчет_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ЛицевыеСчета;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ЛицевыеСчета";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ЛицевойСчет_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Владелец";
	НоваяСтрока.СвойствоФормата = "Владелец";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организация_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидЛицевогоСчета";
	НоваяСтрока.СвойствоФормата = "ВидЛицевогоСчета";
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Владелец,Код");

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в лицевой счет.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.ЛицевыеСчета - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.Организации - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ЛицевойСчет_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																		    Знач ПолученныеДанные,
																		    Знач КомпонентыОбмена)

	Если (ДанныеИБ <> Неопределено) Тогда
		ПолученныеДанные.ТипЛицевогоСчета = ДанныеИБ.ТипЛицевогоСчета;																		
		ПолученныеДанные.ВидЛицевогоСчета = ДанныеИБ.ВидЛицевогоСчета;
	КонецЕсли;
	Если ПолученныеДанные.ТипЛицевогоСчета.Пустая() Тогда
		ПолученныеДанные.ТипЛицевогоСчета = Перечисления.ТипыЛицевыхСчетов.Казначейский;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область Справочник_Номенклатура

// Процедура добавляет обработчики для конвертации данных в номенклатуру при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Номенклатура_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Номенклатура_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Номенклатура;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Номенклатура";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_Номенклатура_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_Номенклатура_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в номенклатуру.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - СправочникОбъект.Номенклатура - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_Номенклатура_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																		 Знач ПолученныеДанные,
																		 Знач КомпонентыОбмена)
	Перем Знч;
	
	// Короткое наименование.
	Знч = КлючевойРеквизит(ДанныеXDTO, "Наименование");
	ПолученныеДанные.Наименование = СокрЛП(Лев(СокрЛП( Знч), 100));

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в номенклатуру.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.Номенклатура - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.Номенклатура - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_Номенклатура_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																			 Знач ПолученныеДанные,
																			 Знач КомпонентыОбмена)

	Если (ДанныеИБ = Неопределено) Тогда
		УстановитьОтключениеБезопасногоРежима(Истина);
		УстановитьПривилегированныйРежим(Истина);
		ПолученныеДанные.УстановитьНовыйКод();
		ПолученныеДанные.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПрочиеМЗ;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Справочник_Мероприятие

// Процедура добавляет обработчики для конвертации данных в мероприятие при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_Мероприятие_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Мероприятие_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Мероприятия;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Мероприятия";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Мероприятие_Получение";
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Код");

КонецПроцедуры

#КонецОбласти

#Область Справочник_Организация

// Процедура добавляет обработчики для конвертации данных в организацию при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила.
//
Процедура ДобавитьПКО_Справочник_Организация_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_Организация_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.Организации;
	ПравилоКонвертации.ОбъектФормата = "Справочник.Учреждения";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодПоРПБС";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИНН";
	НоваяСтрока.СвойствоФормата = "ИНН";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПП";
	НоваяСтрока.СвойствоФормата = "КПП";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеСокращенное";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "НаименованиеПолное";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодОКАТО";
	НоваяСтрока.СвойствоФормата = "КодОКАТО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодОКТМО";
	НоваяСтрока.СвойствоФормата = "КодОКТМО";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодОКПО";
	НоваяСтрока.СвойствоФормата = "КодОКПО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодПоППП";
	НоваяСтрока.СвойствоФормата = "КодПоППП";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ГлаваПоБюджетнойКлассификации_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Распорядитель";
	НоваяСтрока.СвойствоФормата = "Распорядитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагент_Получение";
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Бюджет,КодПоРПБС");
	ПравилоКонвертации.ПоляПоиска.Добавить("ИНН,КПП");
	ПравилоКонвертации.ПоляПоиска.Добавить("КодПоРПБС");
	ПравилоКонвертации.ПоляПоиска.Добавить("ИНН");

КонецПроцедуры

#КонецОбласти

#Область Справочник_ПрограммаЦелевойСтатьиКРБ

// Процедура добавляет обработчики для конвертации данных в направление расходов при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ПрограммаЦелевойСтатьиКРБ_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ПрограммыЦелевыхСтатейКРБ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ПрограммыЦелевыхСтатейКРБ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаНачалаДействия";
	НоваяСтрока.СвойствоФормата = "НачалоДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаОкончанияДействия";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОкончаниеДействия";
	НоваяСтрока.СвойствоФормата = "ОкончаниеДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЦелеваяСтатья";
	НоваяСтрока.СвойствоФормата = "ЦелеваяСтатья";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЦелеваяСтатьяКРБ_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Получение";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в направление расходов.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - СправочникОбъект.ПрограммыЦелевыхСтатейКРБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																					  Знач ПолученныеДанные,
																					  Знач КомпонентыОбмена)
	Перем Знч;
																					  
	Если ЗначениеЗаполнено(ПолученныеДанные.ОкончаниеДействия) Тогда
		ПолученныеДанные.ДатаОкончанияДействия = ПолученныеДанные.ОкончаниеДействия;
	Иначе
		ПолученныеДанные.ДатаОкончанияДействия = ДатаГоризонта();
	КонецЕсли;
	// Передача идентификатора в обработчик поиска.
	Знч = ИдентификаторXDTO(ДанныеXDTO);
	Если (Не ПустаяСтрока(Знч)) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("ИдентификаторXDTO", Знч);
	КонецЕсли;
	Знч = ПолучитьКод(ПолученныеДанные.ЦелеваяСтатья);
	ПолученныеДанные.Наименование = Знч + ПолученныеДанные.Код;

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в направление расходов.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.ПрограммыЦелевыхСтатейКРБ - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ПрограммыЦелевыхСтатейКРБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																						  Знач ПолученныеДанные,
																						  Знач КомпонентыОбмена)

	// Заполнение свойств объекта ИБ, если он есть в базе.
	Если (ДанныеИБ <> Неопределено) Тогда
		ДанныеИБ.ПометкаУдаления = ПолученныеДанные.ПометкаУдаления;
		Если ПолученныеДанные.Бюджет.Пустая() Тогда
			ПолученныеДанные.Бюджет = ДанныеИБ.Бюджет;
		КонецЕсли;	 
	КонецЕсли;

КонецПроцедуры

// Обработчик выполняет поиск направления расходов.
//
// Параметры :
//	ДанныеИБ - СправочникСсылка.ПрограммыЦелевыхСтатейКРБ - найденный объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ПрограммыЦелевыхСтатейКРБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение_АлгоритмПоиска(ДанныеИБ,
																			Знач ПолученныеДанные,
																			Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб, Запись;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	ИначеЕсли ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Текст) Тогда
		ДанныеИБ = СсылкаПоИдентификатору(Текст, "Справочник.ПрограммыЦелевыхСтатейКРБ", КомпонентыОбмена.УзелКорреспондента);
		Если (ДанныеИБ <> Неопределено) Тогда
			Возврат;															
		КонецЕсли;	
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Код", ПолученныеДанные.Код);
	Отбор.Вставить("ЦелеваяСтатья", ПолученныеДанные.ЦелеваяСтатья);
	Отбор.Вставить("Бюджет", ПолученныеДанные.Бюджет);
	Отбор.Вставить("ДатаНачалаДействия", ПолученныеДанные.ДатаНачалаДействия);
	Отбор.Вставить("ДатаОкончанияДействия", ПолученныеДанные.ДатаОкончанияДействия);
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка,
			|	Спр.Бюджет КАК Бюджет
			|ИЗ	Справочник.ПрограммыЦелевыхСтатейКРБ КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.ЦелеваяСтатья = &ЦелеваяСтатья) И (Спр.Код = &Код) И (НЕ Спр.ПометкаУдаления)
			|  И ((Спр.Бюджет = &Бюджет) ИЛИ (&Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.ПустаяСсылка)))
			|  И (Спр.ДатаНачалаДействия = &ДатаНачалаДействия)
			|  И (Спр.ДатаОкончанияДействия = &ДатаОкончанияДействия)
			|УПОРЯДОЧИТЬ ПО (ПИ.Ссылка ЕСТЬ NULL) УБЫВ";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		Запись = Таб[0];
		ДанныеИБ = Запись.Ссылка;
		ПолученныеДанные.Бюджет = Запись.Бюджет;
		Возврат;
	КонецЕсли;	
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка,
			|	Спр.Бюджет КАК Бюджет
			|ИЗ	Справочник.ПрограммыЦелевыхСтатейКРБ КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.ЦелеваяСтатья = &ЦелеваяСтатья) И (Спр.Код = &Код) И (НЕ Спр.ПометкаУдаления) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И ((Спр.Бюджет = &Бюджет) ИЛИ (&Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.ПустаяСсылка)))
			|  И (((Спр.ДатаНачалаДействия <= &ДатаНачалаДействия) И (&ДатаНачалаДействия <= Спр.ДатаОкончанияДействия))
			|ИЛИ  ((Спр.ДатаНачалаДействия <= &ДатаОкончанияДействия) И (&ДатаОкончанияДействия <= Спр.ДатаОкончанияДействия)))
			|УПОРЯДОЧИТЬ ПО
			|(&ДатаОкончанияДействия = Спр.ДатаОкончанияДействия) УБЫВ,
			|(Спр.ДатаНачалаДействия = &ДатаНачалаДействия) УБЫВ,
			|((Спр.ДатаНачалаДействия <= &ДатаОкончанияДействия) И (&ДатаОкончанияДействия <= Спр.ДатаОкончанияДействия)) УБЫВ,
			|((Спр.ДатаНачалаДействия <= &ДатаНачалаДействия) И (&ДатаНачалаДействия <= Спр.ДатаОкончанияДействия)) УБЫВ";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		Запись = Таб[0];
		ДанныеИБ = Запись.Ссылка;
		ПолученныеДанные.Бюджет = Запись.Бюджет;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область Справочник_РазделПодразделКРБ

// Процедура добавляет обработчики для конвертации данных в раздел,подраздел КРБ при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_РазделПодразделКРБ_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_РазделПодразделКРБ_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.РазделыПодразделыКРБ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.РазделыПодразделыКРБ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_РазделПодразделКРБ_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_РазделПодразделКРБ_Получение";
	
	ПравилоКонвертации.ПоляПоиска.Добавить("Код");

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в раздел, подраздел КРБ.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.РазделыПодразделыКРБ - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.РазделыПодразделыКРБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_РазделПодразделКРБ_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																				   Знач ПолученныеДанные,
																				   Знач КомпонентыОбмена)

	// Заполнение свойств объекта ИБ, если он есть в базе.
	Если (ДанныеИБ <> Неопределено) Тогда
		ДанныеИБ.ПометкаУдаления = ПолученныеДанные.ПометкаУдаления;
		ПолученныеДанные.ЭлементГруппа = ДанныеИБ.ЭлементГруппа; 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Справочник_СтатьяКИФ

// Процедура добавляет обработчики для конвертации данных в статью КИФ при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_СтатьяКИФ_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, КонвертацияТабличнойЧасти, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_СтатьяКИФ_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.СтатьиКИФ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.СтатьиКИФ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_СтатьяКИФ_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_СтатьяКИФ_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Справочник_СтатьяКИФ_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Владелец";
	НоваяСтрока.СвойствоФормата = "Владелец";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ГруппаПодгруппаКИФ_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаНачалаДействия";
	НоваяСтрока.СвойствоФормата = "НачалоДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаОкончанияДействия";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОкончаниеДействия";
	НоваяСтрока.СвойствоФормата = "ОкончаниеДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Элемент";
	НоваяСтрока.СвойствоФормата = "ЭлементБюджета";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЭлементБюджета_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЭлементГруппа";
	НоваяСтрока.СвойствоФормата = "ЭлементГруппа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_СтатьяКИФ_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "ДопустимыеКОСГУ";
    КонвертацияТабличнойЧасти.ТЧФормата = "ДопустимыеКОСГУ";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КОСГУ";
	НоваяСтрока.СвойствоФормата = "КОСГУ";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "Наименование";

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в статью КИФ.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - СправочникОбъект.СтатьиКИФ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_СтатьяКИФ_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																	  Знач ПолученныеДанные,
																	  Знач КомпонентыОбмена)
	Перем Код, Знч;
	
	// Наименование (полный код).
	Код = ДанныеXDTO.КлючевыеСвойства.Владелец.Код;
	Код = Код + ПолученныеДанные.Код;
	ПолученныеДанные.Наименование = Код + "0000";
	// Владелец (старый формат).
	Если ПолученныеДанные.Владелец.Пустая() Тогда
		ПолученныеДанные.Владелец = ГруппаКИФ(Код);
	КонецЕсли;	
	Если ЗначениеЗаполнено(ПолученныеДанные.ОкончаниеДействия) Тогда
		ПолученныеДанные.ДатаОкончанияДействия = ПолученныеДанные.ОкончаниеДействия;
	Иначе
		ПолученныеДанные.ДатаОкончанияДействия = ДатаГоризонта();
	КонецЕсли;
	// Передача идентификатора в обработчик поиска.
	Знч = ИдентификаторXDTO(ДанныеXDTO);
	Если (Не ПустаяСтрока(Знч)) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("ИдентификаторXDTO", Знч);
	КонецЕсли;	

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в статью КИФ.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.СтатьиКИФ - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.СтатьиКИФ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_СтатьяКИФ_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																	      Знач ПолученныеДанные,
																		  Знач КомпонентыОбмена)

	// Заполнение свойств объекта ИБ, если он есть в базе.
	Если (ДанныеИБ <> Неопределено) Тогда
		ДанныеИБ.ПометкаУдаления = ПолученныеДанные.ПометкаУдаления;
		ПолученныеДанные.ЭлементГруппа = ДанныеИБ.ЭлементГруппа;
		Если ПолученныеДанные.Бюджет.Пустая() Тогда
			ПолученныеДанные.Бюджет = ДанныеИБ.Бюджет;
		КонецЕсли;	 
	КонецЕсли;

КонецПроцедуры

// Обработчик выполняет поиск статьи КИФ.
//
// Параметры :
//	ДанныеИБ - СправочникСсылка.СтатьиКИФ - найденный объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.СтатьиКИФ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_СтатьяКИФ_Получение_АлгоритмПоиска(ДанныеИБ,
															Знач ПолученныеДанные,
															Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб, Запись;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	ИначеЕсли ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Текст) Тогда
		ДанныеИБ = СсылкаПоИдентификатору(Текст, "Справочник.СтатьиКИФ", КомпонентыОбмена.УзелКорреспондента);
		Если (ДанныеИБ <> Неопределено) Тогда
			Возврат;															
		КонецЕсли;	
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Код", ПолученныеДанные.Код);
	Отбор.Вставить("Владелец", ПолученныеДанные.Владелец);
	Отбор.Вставить("Бюджет", ПолученныеДанные.Бюджет);
	Отбор.Вставить("ДатаНачалаДействия", ПолученныеДанные.ДатаНачалаДействия);
	Отбор.Вставить("ДатаОкончанияДействия", ПолученныеДанные.ДатаОкончанияДействия);
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка,
			|	Спр.Бюджет КАК Бюджет
			|ИЗ	Справочник.СтатьиКИФ КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.Владелец = &Владелец) И (Спр.Код = &Код) И (НЕ Спр.ПометкаУдаления)
			|  И ((Спр.Бюджет = &Бюджет) ИЛИ (&Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.ПустаяСсылка)))
			|  И (Спр.ДатаНачалаДействия = &ДатаНачалаДействия)
			|  И (Спр.ДатаОкончанияДействия = &ДатаОкончанияДействия)
			|УПОРЯДОЧИТЬ ПО (ПИ.Ссылка ЕСТЬ NULL) УБЫВ";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		Запись = Таб[0];
		ДанныеИБ = Запись.Ссылка;
		ПолученныеДанные.Бюджет = Запись.Бюджет;
		Возврат;
	КонецЕсли;	
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка,
			|	Спр.Бюджет КАК Бюджет
			|ИЗ	Справочник.СтатьиКИФ КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.Владелец = &Владелец) И (Спр.Код = &Код) И (НЕ Спр.ПометкаУдаления) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И ((Спр.Бюджет = &Бюджет) ИЛИ (&Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.ПустаяСсылка)))
			|  И (((Спр.ДатаНачалаДействия <= &ДатаНачалаДействия) И (&ДатаНачалаДействия <= Спр.ДатаОкончанияДействия))
			|ИЛИ  ((Спр.ДатаНачалаДействия <= &ДатаОкончанияДействия) И (&ДатаОкончанияДействия <= Спр.ДатаОкончанияДействия)))
			|УПОРЯДОЧИТЬ ПО
			|(&ДатаОкончанияДействия = Спр.ДатаОкончанияДействия) УБЫВ,
			|(Спр.ДатаНачалаДействия = &ДатаНачалаДействия) УБЫВ,
			|((Спр.ДатаНачалаДействия <= &ДатаОкончанияДействия) И (&ДатаОкончанияДействия <= Спр.ДатаОкончанияДействия)) УБЫВ,
			|((Спр.ДатаНачалаДействия <= &ДатаНачалаДействия) И (&ДатаНачалаДействия <= Спр.ДатаОкончанияДействия)) УБЫВ";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		Запись = Таб[0];
		ДанныеИБ = Запись.Ссылка;
		ПолученныеДанные.Бюджет = Запись.Бюджет;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область Справочник_ЦелеваяСтатьяКРБ

// Процедура добавляет обработчики для конвертации данных в программное (непрограммное) направление расходов при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ЦелеваяСтатьяКРБ_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ЦелеваяСтатьяКРБ_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ЦелевыеСтатьиКРБ;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ЦелевыеСтатьиКРБ";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Справочник_ЦелеваяСтатьяКРБ_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_ЦелеваяСтатьяКРБ_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Справочник_ЦелеваяСтатьяКРБ_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаНачалаДействия";
	НоваяСтрока.СвойствоФормата = "НачалоДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаОкончанияДействия";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОкончаниеДействия";
	НоваяСтрока.СвойствоФормата = "ОкончаниеДействия";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Бюджет";
	НоваяСтрока.СвойствоФормата = "Бюджет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Бюджет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Родитель";
	НоваяСтрока.СвойствоФормата = "Родитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЦелеваяСтатьяКРБ_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Наименование";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в программное (непрограммное) направление расходов.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - СправочникОбъект.ЦелевыеСтатьиКРБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ЦелеваяСтатьяКРБ_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																			 Знач ПолученныеДанные,
																			 Знач КомпонентыОбмена)
	Перем Код, Знч;

	Если ЗначениеЗаполнено(ПолученныеДанные.ОкончаниеДействия) Тогда
		ПолученныеДанные.ДатаОкончанияДействия = ПолученныеДанные.ОкончаниеДействия;
	Иначе
		ПолученныеДанные.ДатаОкончанияДействия = ДатаГоризонта();
	КонецЕсли;
	// Передача идентификатора в обработчик поиска.
	Знч = ИдентификаторXDTO(ДанныеXDTO);
	Если (Не ПустаяСтрока(Знч)) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("ИдентификаторXDTO", Знч);
	КонецЕсли;	
	Код = ПолученныеДанные.Код;
	ПолученныеДанные.Наименование = Код + "00000";

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в программное (непрограммное) направление расходов.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.СтатьиКИФ - объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.СтатьиКИФ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ЦелеваяСтатьяКРБ_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																				 Знач ПолученныеДанные,
																				 Знач КомпонентыОбмена)

	// Заполнение свойств объекта ИБ, если он есть в базе.
	Если (ДанныеИБ <> Неопределено) Тогда
		ДанныеИБ.ПометкаУдаления = ПолученныеДанные.ПометкаУдаления;
		Если ПолученныеДанные.Бюджет.Пустая() Тогда
			ПолученныеДанные.Бюджет = ДанныеИБ.Бюджет;
		КонецЕсли;	 
	КонецЕсли;

КонецПроцедуры

// Обработчик выполняет поиск программного (непрограммного) направления расходов.
//
// Параметры :
//	ДанныеИБ - СправочникСсылка.ЦелевыеСтатьиКРБ - найденный объект информационной базы.
//	ПолученныеДанные - СправочникОбъект.ЦелевыеСтатьиКРБ - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Справочник_ЦелеваяСтатьяКРБ_Получение_АлгоритмПоиска(ДанныеИБ,
																   Знач ПолученныеДанные,
																   Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб, Запись;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	ИначеЕсли ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Текст) Тогда
		ДанныеИБ = СсылкаПоИдентификатору(Текст, "Справочник.ЦелевыеСтатьиКРБ", КомпонентыОбмена.УзелКорреспондента);
		Если (ДанныеИБ <> Неопределено) Тогда
			Возврат;															
		КонецЕсли;	
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Код", ПолученныеДанные.Код);
	Отбор.Вставить("Бюджет", ПолученныеДанные.Бюджет);
	Отбор.Вставить("ДатаНачалаДействия", ПолученныеДанные.ДатаНачалаДействия);
	Отбор.Вставить("ДатаОкончанияДействия", ПолученныеДанные.ДатаОкончанияДействия);
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка,
			|	Спр.Бюджет КАК Бюджет
			|ИЗ	Справочник.ЦелевыеСтатьиКРБ КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.Код = &Код) И (НЕ Спр.ПометкаУдаления)
			|  И ((Спр.Бюджет = &Бюджет) ИЛИ (&Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.ПустаяСсылка)))
			|  И (Спр.ДатаНачалаДействия = &ДатаНачалаДействия)
			|  И (Спр.ДатаОкончанияДействия = &ДатаОкончанияДействия)
			|УПОРЯДОЧИТЬ ПО (ПИ.Ссылка ЕСТЬ NULL) УБЫВ";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		Запись = Таб[0];
		ДанныеИБ = Запись.Ссылка;
		ПолученныеДанные.Бюджет = Запись.Бюджет;
		Возврат;
	КонецЕсли;	
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка,
			|	Спр.Бюджет КАК Бюджет
			|ИЗ	Справочник.ЦелевыеСтатьиКРБ КАК Спр
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Спр.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Спр.Код = &Код) И (НЕ Спр.ПометкаУдаления) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И ((Спр.Бюджет = &Бюджет) ИЛИ (&Бюджет = ЗНАЧЕНИЕ(Справочник.Бюджеты.ПустаяСсылка)))
			|  И (((Спр.ДатаНачалаДействия <= &ДатаНачалаДействия) И (&ДатаНачалаДействия <= Спр.ДатаОкончанияДействия))
			|ИЛИ  ((Спр.ДатаНачалаДействия <= &ДатаОкончанияДействия) И (&ДатаОкончанияДействия <= Спр.ДатаОкончанияДействия)))
			|УПОРЯДОЧИТЬ ПО
			|(&ДатаОкончанияДействия = Спр.ДатаОкончанияДействия) УБЫВ,
			|(Спр.ДатаНачалаДействия = &ДатаНачалаДействия) УБЫВ,
			|((Спр.ДатаНачалаДействия <= &ДатаОкончанияДействия) И (&ДатаОкончанияДействия <= Спр.ДатаОкончанияДействия)) УБЫВ,
			|((Спр.ДатаНачалаДействия <= &ДатаНачалаДействия) И (&ДатаНачалаДействия <= Спр.ДатаОкончанияДействия)) УБЫВ";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		Запись = Таб[0];
		ДанныеИБ = Запись.Ссылка;
		ПолученныеДанные.Бюджет = Запись.Бюджет;
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область Справочник_ЭлементБюджета

// Процедура добавляет обработчики для конвертации данных в элемент бюджета при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Справочник_ЭлементБюджета_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Справочник_ЭлементБюджета_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Справочники.ЭлементыБюджета;
	ПравилоКонвертации.ОбъектФормата = "Справочник.ЭлементыБюджета";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Код";
	НоваяСтрока.СвойствоФормата = "Код";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НаименованиеПолное";
	НоваяСтрока.СвойствоФормата = "Наименование";

	ПравилоКонвертации.ПоляПоиска.Добавить("Код");

КонецПроцедуры

#КонецОбласти

#Область Документ_БухгалтерскаяСправка

// Процедура добавляет обработчики для конвертации данных в бухгалтерскую операцию при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Документ_БухгалтерскаяСправка_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_БухгалтерскаяСправка_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.ОперацияБух;
	ПравилоКонвертации.ОбъектФормата = "Документ.БухгалтерскаяСправка";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Документ_БухгалтерскаяСправка_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Документ_БухгалтерскаяСправка_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Документ_БухгалтерскаяСправка_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ПослеЗагрузкиВсехДанных = "ПКО_Документ_БухгалтерскаяСправка_Получение_ПослеЗагрузкиВсехДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "ДатаДокумента";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НомерИсточника";
	НоваяСтрока.СвойствоФормата = "НомерДокумента";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Основание";
	НоваяСтрока.СвойствоФормата = "ПредставлениеДокумента";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организация_Получение";

	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
		НоваяСтрока.СвойствоКонфигурации = "ИФО";
		НоваяСтрока.СвойствоФормата = "ИФО";
		НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ИФО_Получение";
	КонецЕсли;

КонецПроцедуры

// Функция возвращает значение межотчетного периода по значению уточнения.
//
// Возвращаемое значение :
//	ПеречислениеСсылка.ВидыМежотчетногоПериода.
//
Функция ВидМежотчетногоПериода(Знач УточнениеПериода)
	Перем Элем, Вес, ТекВес, Рез;
	
	Рез = Перечисления.ВидыМежотчетногоПериода.ПустаяСсылка();
	Если (ТипЗнч(УточнениеПериода) <> Тип("Число")) Тогда
		Возврат Рез;
	ИначеЕсли (УточнениеПериода <= 0) Тогда	
		Возврат Рез;
	КонецЕсли;
	ТекВес = -1;
	Для Каждого Элем Из Перечисления.ВидыМежотчетногоПериода Цикл
		Вес = БухгалтерскийУчет.ЗначениеУточненияПериода(Элем);
		Если (Вес <= УточнениеПериода) И (ТекВес < Вес) Тогда
			ТекВес = Вес;
			Рез = Элем;
		КонецЕсли;
	КонецЦикла;
	Возврат Рез;

КонецФункции

// Обработчик сохраняет данные из пакета XDTO в соответствие.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - ДокументОбъект.ОперацияБух - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Документ_БухгалтерскаяСправка_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																			   Знач ПолученныеДанные,
																			   Знач КомпонентыОбмена)
	Перем Знч;

	ПолученныеДанные.Ответственный = Пользователи.ТекущийПользователь();
	ПолученныеДанные.ИДИсточника = ПолученУИ();
	ПолученныеДанные.ИспользоватьТиповыеОперации = Ложь;
	Если (КонецГода(ПолученныеДанные.Дата) <> ПолученныеДанные.Дата) Тогда
		Знч = 0;
	ИначеЕсли (Не ДанныеXDTO.Свойство("УточнениеПериода", Знч)) Тогда
		Знч = 0;
	КонецЕсли;
	ПолученныеДанные.ВидМежотчетногоПериода = ВидМежотчетногоПериода(Знч);
	// Передача идентификатора в обработчик перед записью.
	Знч = ИдентификаторXDTO(ДанныеXDTO);
	Если (Не ПустаяСтрока(Знч)) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("ИдентификаторXDTO", Знч);
	КонецЕсли;	
	// Передача проводок в обработчик перед записью.
	Если (ДанныеXDTO.Свойство("Проводки", Знч) И (Знч <> Неопределено)) Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("Проводки", Знч);
	КонецЕсли;

КонецПроцедуры

// Функция выполняет поиск журнала операций по номеру.
//
// Параметры :
//  Код - Строка - номер журнала.
//
// Возвращаемое значение :
//  СправочникСсылка.Журналы.
//
Функция НайтиЖурналОпераций(Знач Код)
	Перем Текст, Таб, Отбор;
	
	Если (ТипЗнч(Код) <> Тип("Строка")) Тогда
		Возврат Справочники.Журналы.ПустаяСсылка();
	ИначеЕсли ПустаяСтрока(Код) Тогда
		Возврат Справочники.Журналы.ПустаяСсылка();
	КонецЕсли;
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	Спр.Ссылка КАК Ссылка
	        |ИЗ	Справочник.Журналы КАК Спр
	        |ГДЕ (Спр.Код = &Код) И (НЕ Спр.ЭтоГруппа)
			|УПОРЯДОЧИТЬ ПО Спр.ПометкаУдаления";
	Отбор = Новый Структура;
	Отбор.Вставить("Код", Код);
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() = 0) Тогда
		Возврат Справочники.Журналы.ПустаяСсылка();
	Иначе
		Возврат Таб[0].Ссылка;
	КонецЕсли;

КонецФункции

// Функция находит бухгалтерский счет по коду.
//
// Параметры :
//	Код - Строка - код счета.
//	НаДату - Дата - дата действия счета.
//	Организация - СправочникСсылка.Организации - учреждение.
//
// Возвращаемое значение :
//	ПланСчетовСсылка.ЕПСБУ.
//
Функция НайтиСчет(Знач Код, Знач НаДату, Знач Организация)
	Перем Рез;

	Если ПустаяСтрока(Код) Тогда
		Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;

	Рез = БухгалтерскийУчет.СчетПоКоду(Код, НаДату, Организация);

	Если (ТипЗнч(Рез) = Тип("ПланСчетовСсылка.ЕПСБУ")) Тогда
		Возврат Рез;
	Иначе
		Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;

КонецФункции

// Процедура выполняет заполнение субконто по корреспонденции счета.
//
// Параметры :
//	ЗаписьXDTO - Структура - с данными объекта XDTO.
//	Запись - РегистрБухгалтерииЗапись - обрабатываемая запись информационной базы.
//	КтДт - Строка - субконто по дебету/кредиту.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
// 
Функция ЗаполнитьСубконто(Знач ЗаписьXDTO, Знач Запись, Знач КтДт, Знач КомпонентыОбмена)
	Перем Субконто, СубконтоКтДт, ВидыСубконто, Счет;
	Перем Обработано, Знч, Вид, Стр;
	Перем Действие, ПКО, Тип;
	
	Обработано = Новый Структура;
	Счет = Запись["Счет" + КтДт];
	СубконтоКтДт = Запись["Субконто" + КтДт];
	ВидыСубконто = ПланыВидовХарактеристик.ВидыСубконто;
	Действие = ДействиеПоУмолчанию();
	Для Каждого Субконто Из Счет.ВидыСубконто Цикл
		Вид = Субконто.ВидСубконто;
		Если (ВидыСубконто.Контрагенты = Вид) Тогда
			Обработано.Вставить("Контрагент", Истина);
			Стр = ЗаписьXDTO["Контрагент" + КтДт];
			Если (Стр = Неопределено) Тогда
				Знч = Справочники.Контрагенты.ПустаяСсылка();
			Иначе	
				ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Контрагент_Получение");
				Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
				Тип = ТипЗнч(Знч);
				Если (Тип = Тип("СправочникОбъект.Контрагенты")) Тогда
					Знч = Знч.Ссылка;
				ИначеЕсли (Тип <> Тип("СправочникСсылка.Контрагенты")) Тогда
					Знч = Справочники.Контрагенты.ПустаяСсылка();
				КонецЕсли;	
			КонецЕсли;	
			СубконтоКтДт[Вид] = Знч;
		ИначеЕсли (ВидыСубконто.Договоры = Вид) Тогда
			Обработано.Вставить("Договор", Истина);
			Стр = ЗаписьXDTO["Договор" + КтДт];
			Если (Стр = Неопределено) Тогда
				Стр = ЗаписьXDTO["Контрагент" + КтДт];
				Если (Стр = Неопределено) Тогда
					Знч = Справочники.Контрагенты.ПустаяСсылка();
				Иначе	
					ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Контрагент_Получение");
					Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
					Тип = ТипЗнч(Знч);
					Если (Тип = Тип("СправочникОбъект.Контрагенты")) Тогда
						Знч = Знч.Ссылка;
					ИначеЕсли (Тип <> Тип("СправочникСсылка.Контрагенты")) Тогда
						Знч = Справочники.Контрагенты.ПустаяСсылка();
					КонецЕсли;	
				КонецЕсли;	
				Знч = ПустойДоговор(Запись.Организация, Знч);
			Иначе	
				ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Договор_Получение");
				Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
				Тип = ТипЗнч(Знч);
				Если (Тип = Тип("СправочникОбъект.Договоры")) Тогда
					Знч = Знч.Ссылка;
				ИначеЕсли (Тип <> Тип("СправочникСсылка.Договоры")) Тогда
					Знч = Справочники.Договоры.ПустаяСсылка();
				КонецЕсли;	
			КонецЕсли;	
			СубконтоКтДт[Вид] = Знч;
		ИначеЕсли ((ВидыСубконто.ЛицевыеСчета = Вид) Или (ВидыСубконто.РазделыЛицевыхСчетов = Вид)) Тогда
			Обработано.Вставить("ЛС", Истина);
			Стр = ЗаписьXDTO["ЛицевойСчет" + КтДт];
			Если (Стр = Неопределено) Тогда
				Если (ВидыСубконто.РазделыЛицевыхСчетов = Вид) Тогда
					Знч = Справочники.РазделыЛицевыхСчетов.ПустаяСсылка();
				Иначе
					Знч = Справочники.ЛицевыеСчета.ПустаяСсылка();
				КонецЕсли;	
			Иначе
				ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ЛицевойСчет_Получение");
				Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
				Тип = ТипЗнч(Знч);
				Если (Тип = Тип("СправочникОбъект.ЛицевыеСчета")) Тогда
					Знч = Знч.Ссылка;
				ИначеЕсли (Тип <> Тип("СправочникСсылка.ЛицевыеСчета")) Тогда
					Знч = Справочники.ЛицевыеСчета.ПустаяСсылка();
				КонецЕсли;	
				Если (ВидыСубконто.РазделыЛицевыхСчетов = Вид) Тогда
					Если Знч.Пустая() Тогда
						Знч = Справочники.РазделыЛицевыхСчетов.ПустаяСсылка();
					Иначе
						Знч = НайтиРазделЛицевогоСчета(Знч, Запись.КФО);
						Если (Знч.Пустая() И Стр.Свойство("Код")) Тогда
							Возврат СтрШаблон(НСтр("ru = 'Для л/c ""%1"" не найден раздел'"), Стр.Код);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
			СубконтоКтДт[Вид] = Знч;
		ИначеЕсли (ВидыСубконто.ВидыЦелевыхСредств = Вид) Тогда
			Обработано.Вставить("ВидЦелевых", Истина);
			Стр = ЗаписьXDTO["ВидЦелевых" + КтДт];
			Если (Стр = Неопределено) Тогда
				Знч = Справочники.ВидыЦелевыхСредств.ПустаяСсылка();
			Иначе	
				ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ВидЦелевыхСредств_Получение");
				Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
				Тип = ТипЗнч(Знч);
				Если (Тип = Тип("СправочникОбъект.ВидыЦелевыхСредств")) Тогда
					Знч = Знч.Ссылка;
				ИначеЕсли (Тип <> Тип("СправочникСсылка.ВидыЦелевыхСредств")) Тогда
					Знч = Справочники.ВидыЦелевыхСредств.ПустаяСсылка();
				КонецЕсли;	
			КонецЕсли;
			СубконтоКтДт[Вид] = Знч;
		ИначеЕсли (ВидыСубконто.Мероприятия = Вид) Тогда
			Обработано.Вставить("Мероприятие", Истина);
			Стр = ЗаписьXDTO["Мероприятие" + КтДт];
			Если (Стр = Неопределено) Тогда
				Знч = Справочники.Мероприятия.ПустаяСсылка();
			Иначе	
				ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Мероприятие_Получение");
				Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
				Тип = ТипЗнч(Знч);
				Если (Тип = Тип("СправочникОбъект.Мероприятия")) Тогда
					Знч = Знч.Ссылка;
				ИначеЕсли (Тип <> Тип("СправочникСсылка.Мероприятия")) Тогда
					Знч = Справочники.Мероприятия.ПустаяСсылка();
				КонецЕсли;	
			КонецЕсли;
			СубконтоКтДт[Вид] = Знч;
		ИначеЕсли (ВидыСубконто.Номенклатура = Вид) Тогда
			Обработано.Вставить("Номенклатура", Истина);
			Стр = ЗаписьXDTO["Номенклатура" + КтДт];
			Если (Стр = Неопределено) Тогда
				Знч = Справочники.Номенклатура.ПустаяСсылка();
			Иначе	
				ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Номенклатура_Получение");
				Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
				Тип = ТипЗнч(Знч);
				Если (Тип = Тип("СправочникОбъект.Номенклатура")) Тогда
					Знч = Знч.Ссылка;
				ИначеЕсли (Тип <> Тип("СправочникСсылка.Номенклатура")) Тогда
					Знч = Справочники.Номенклатура.ПустаяСсылка();
				КонецЕсли;	
			КонецЕсли;
			СубконтоКтДт[Вид] = Знч;
		КонецЕсли;
	КонецЦикла;
	// Заполнение характеристики движения.
	// Договор.
	Если (Не Обработано.Свойство("Договор")) Тогда
		Стр = ЗаписьXDTO["Договор" + КтДт];
		Если (Стр <> Неопределено) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Договор_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.Договоры")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.Договоры")) Тогда
				Знч = Справочники.Договоры.ПустаяСсылка();
			КонецЕсли;
			Если (Не Знч.Пустая()) Тогда
				Запись["ХарактеристикаДвижения" + КтДт] = Знч;
				Возврат "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Контрагент.
	Если (Не Обработано.Свойство("Контрагент")) Тогда
		Стр = ЗаписьXDTO["Контрагент" + КтДт];
		Если (Стр <> Неопределено) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Контрагент_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.Контрагенты")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.Контрагенты")) Тогда
				Знч = Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;
			Если (Не Знч.Пустая()) Тогда
				Запись["ХарактеристикаДвижения" + КтДт] = Знч;
				Возврат "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Лицевой счет.
	Если (Не Обработано.Свойство("ЛС")) Тогда
		Стр = ЗаписьXDTO["ЛицевойСчет" + КтДт];
		Если (Стр <> Неопределено) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ЛицевойСчет_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.ЛицевыеСчета")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.ЛицевыеСчета")) Тогда
				Знч = Справочники.ЛицевыеСчета.ПустаяСсылка();
			КонецЕсли;
			Если (Не Знч.Пустая()) Тогда
				Запись["ХарактеристикаДвижения" + КтДт] = Знч;
				Возврат "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Вид целевых средств.
	Если (Не Обработано.Свойство("ВидЦелевых")) Тогда
		Стр = ЗаписьXDTO["ВидЦелевых" + КтДт];
		Если (Стр <> Неопределено) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_ВидЦелевыхСредств_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.ВидыЦелевыхСредств")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.ВидыЦелевыхСредств")) Тогда
				Знч = Справочники.ВидыЦелевыхСредств.ПустаяСсылка();
			КонецЕсли;
			Если (Не Знч.Пустая()) Тогда
				Запись["ХарактеристикаДвижения" + КтДт] = Знч;
				Возврат "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Мероприятие.
	Если (Не Обработано.Свойство("Мероприятие")) Тогда
		Стр = ЗаписьXDTO["Мероприятие" + КтДт];
		Если (Стр <> Неопределено) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Мероприятие_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.Мероприятия")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.Мероприятия")) Тогда
				Знч = Справочники.Мероприятия.ПустаяСсылка();
			КонецЕсли;
			Если (Не Знч.Пустая()) Тогда
				Запись["ХарактеристикаДвижения" + КтДт] = Знч;
				Возврат "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Номенклатура.
	Если (Не Обработано.Свойство("Номенклатура")) Тогда
		Стр = ЗаписьXDTO["Номенклатура" + КтДт];
		Если (Стр <> Неопределено) Тогда
			ПКО = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Номенклатура_Получение");
			Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена, Стр, ПКО, Действие);
			Тип = ТипЗнч(Знч);
			Если (Тип = Тип("СправочникОбъект.Номенклатура")) Тогда
				Знч = Знч.Ссылка;
			ИначеЕсли (Тип <> Тип("СправочникСсылка.Номенклатура")) Тогда
				Знч = Справочники.Номенклатура.ПустаяСсылка();
			КонецЕсли;
			Если (Не Знч.Пустая()) Тогда
				Запись["ХарактеристикаДвижения" + КтДт] = Знч;
				Возврат "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат "";

КонецФункции

// Процедура выполняет заполнение проводок.
//
// Параметры :
//	Объект - ДокументОбъект.ОперацияБух - заполняемый документ.
//	Проводки - информация о проводках.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ЗаполнитьПроводки(Знач Объект, Знач Проводки, Знач КомпонентыОбмена)
	Перем ЕПСБУ, Общие, Запись, Новая, Стр, Номер, Начало, НаДату, Знч, Узел;
	Перем ПКО_КОСГУ, ПКО_Валюта, Действие, Тип;
	
	Узел = КомпонентыОбмена.УзелКорреспондента;
	Объект.СуммаДокумента = 0;
	ЕПСБУ = Объект.Движения.ЖурналПроводокЕПСБУ;
	ЕПСБУ.Очистить();
	ОбменДаннымиСервер.УстановитьОбменДаннымиЗагрузка(ЕПСБУ, Истина, Ложь, Узел);
	ЕПСБУ.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта");
	ЕПСБУ.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	ЕПСБУ.Записывать = Истина;
	// Если нет проводок, то ничего не нужно делать.	
	Если (Проводки = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	// Заполнение проводок.
	НаДату = НачалоДня(Объект.Дата);
	ПКО_КОСГУ = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_КОСГУ_Получение");
	ПКО_Валюта = Неопределено;
	Действие = ДействиеПоУмолчанию();
	Знч = ПустаяСтрока(Объект.Комментарий);
	Знч = Знч И (Не КомпонентыОбмена.ПараметрыКонвертации.ПроверятьПолученныеПроводки);
	// Заполнение общих реквизитов.
	Общие = Новый Структура;
	Общие.Вставить("Активность", Знч);
	Общие.Вставить("Организация", Объект.Организация);
	Общие.Вставить("ИФО", Объект.ИФО);
	Общие.Вставить("Период", Объект.Дата);
	Общие.Вставить("УточнениеПериода", БухгалтерскийУчет.ЗначениеУточненияПериода(Объект.ВидМежотчетногоПериода));
	Общие.Вставить("ВидМежотчетногоПериода", Объект.ВидМежотчетногоПериода);
	Номер = 0;
	Для Каждого Запись Из Проводки Цикл
		Начало = Ложь;
		Номер = Номер + 1;
		Новая = ЕПСБУ.Добавить();
		// Заполнение общих реквизитов.
		ЗаполнитьЗначенияСвойств(Новая, Общие);
		// Сумма.
		Новая.Сумма = Запись.Сумма;
		Объект.СуммаДокумента = Объект.СуммаДокумента + Новая.Сумма;
		// КФО.
		Новая.КФО = КФО(Запись.КФО);
		Если (Новая.КФО.Пустая() И (Не ПустаяСтрока(Запись.КФО))) Тогда
			Стр = СтрШаблон(НСтр("ru = 'По коду ""%1"" не найден КФО'"), Запись.КФО);
			Если НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Номер, Начало) + Стр);
			КонецЕсли;	
		КонецЕсли;
		// Журнал.
		Новая.ЖурналОпераций = НайтиЖурналОпераций(Запись.НомерЖурнала);
		Если (Новая.ЖурналОпераций.Пустая() И (Не ПустаяСтрока(Запись.НомерЖурнала))) Тогда
			Стр = СтрШаблон(НСтр("ru = 'По номеру ""%1"" не найден журнал'"), Запись.НомерЖурнала);
			Если НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Номер, Начало) + Стр);
			КонецЕсли;	
		КонецЕсли;
		// Поиск счета (дт).
		Стр = Запись.СчетДт;
		Если ((Стр <> Неопределено) И Стр.Свойство("Код", Знч)) Тогда
			Новая.СчетДт = НайтиСчет(Знч, НаДату, Объект.Организация);
			Если (Новая.СчетДт.Пустая() И (Не ПустаяСтрока(Знч))) Тогда
				Стр = СтрШаблон(НСтр("ru = 'По коду ""%1"" не найден счет'"), Знч);
				Если НетТекстаВКомментарии(Объект, Стр) Тогда
					ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Номер, Начало) + Стр + " " + НСтр("ru = '(дт)'"));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Поиск счета (кт).
		Стр = Запись.СчетКт;
		Если ((Стр <> Неопределено) И Стр.Свойство("Код", Знч)) Тогда
			Новая.СчетКт = НайтиСчет(Знч, НаДату, Объект.Организация);
			Если (Новая.СчетКт.Пустая() И (Не ПустаяСтрока(Знч))) Тогда
				Стр = СтрШаблон(НСтр("ru = 'По коду ""%1"" не найден счет'"), Знч);
				Если НетТекстаВКомментарии(Объект, Стр) Тогда
					ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Номер, Начало) + Стр + " " + НСтр("ru = '(кт)'"));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		// Заполнение - дебет.
		Если (Не Новая.СчетДт.Пустая()) Тогда
			// Заполнение КБК.
			Стр = НайтиКПС(Запись.КПСДт, НаДату, Новая.КФО, КомпонентыОбмена);
			Если (ТипЗнч(Стр) <> Тип("Строка")) Тогда
				Новая.КПСДт = Стр;
			ИначеЕсли НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Номер, Начало) + Стр + " " + НСтр("ru = '(дт)'"));
			КонецЕсли;
			// КОСГУ.
			Если (Запись.КЭКДт <> Неопределено) Тогда
				Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена,
																		   Запись.КЭКДт,
																		   ПКО_КОСГУ,
																		   Действие);
				Тип = ТипЗнч(Знч);
				Если (Тип = Тип("СправочникОбъект.КОСГУ")) Тогда
					Знч = Знч.Ссылка;
				ИначеЕсли (Тип <> Тип("СправочникСсылка.КОСГУ")) Тогда
					Знч = Справочники.КОСГУ.ПустаяСсылка();
				КонецЕсли;
				Если Знч.Пустая() Тогда
					Новая.КЭКДт = КЭК("000");
				Иначе	
					Новая.КЭКДт = Знч.Ссылка;
				КонецЕсли;	
			Иначе
				Новая.КЭКДт = КЭК("000");
			КонецЕсли;
			// Заполнение валюты и суммы в валюте.
			Если Новая.СчетДт.Валютный Тогда
				Если (Запись.ВалютаДт <> Неопределено) Тогда
					Если (ПКО_Валюта = Неопределено) Тогда
						ПКО_Валюта = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Валюта_Получение");
					КонецЕсли;	
					Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена,
																			   Запись.ВалютаДт,
																			   ПКО_Валюта,
																			   Действие);
					Тип = ТипЗнч(Знч);
					Если (Тип = Тип("СправочникОбъект.Валюты")) Тогда
						Знч = Знч.Ссылка;
					ИначеЕсли (Тип <> Тип("СправочникСсылка.Валюты")) Тогда
						Знч = Справочники.Валюты.ПустаяСсылка();
					КонецЕсли;
					Новая.ВалютаДт = Знч;
				Иначе
					Новая.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
				КонецЕсли;
				Новая.ВалютнаяСуммаДт = Запись.СуммаВВалютеДт;
			КонецЕсли;
			// Заполнение субконто.
			Стр = ЗаполнитьСубконто(Запись, Новая, "Дт", КомпонентыОбмена);
			Если ((Не ПустаяСтрока(Стр)) И НетТекстаВКомментарии(Объект, Стр)) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Номер, Начало) + Стр + " " + НСтр("ru = '(дт)'"));
			КонецЕсли;
		КонецЕсли;
		// Заполнение - кредит.
		Если (Не Новая.СчетКт.Пустая()) Тогда
			// Заполнение КБК.
			Стр = НайтиКПС(Запись.КПСКт, НаДату, Новая.КФО, КомпонентыОбмена);
			Если (ТипЗнч(Стр) <> Тип("Строка")) Тогда
				Новая.КПСКт = Стр;
			ИначеЕсли НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Номер, Начало) + Стр + " " + НСтр("ru = '(кт)'"));
			КонецЕсли;
			// КОСГУ.
			Если (Запись.КЭККт <> Неопределено) Тогда
				Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена,
																		   Запись.КЭККт,
																		   ПКО_КОСГУ,
																		   Действие);
				Тип = ТипЗнч(Знч);
				Если (Тип = Тип("СправочникОбъект.КОСГУ")) Тогда
					Знч = Знч.Ссылка;
				ИначеЕсли (Тип <> Тип("СправочникСсылка.КОСГУ")) Тогда
					Знч = Справочники.КОСГУ.ПустаяСсылка();
				КонецЕсли;
				Если Знч.Пустая() Тогда
					Новая.КЭККт = КЭК("000");
				Иначе
					Новая.КЭККт = Знч.Ссылка;
				КонецЕсли;	
			Иначе	
				Новая.КЭККт = КЭК("000");
			КонецЕсли;
			// Заполнение валюты и суммы в валюте.
			Если Новая.СчетКт.Валютный Тогда
				Если (Запись.ВалютаКт <> Неопределено) Тогда
					Если (ПКО_Валюта = Неопределено) Тогда
						ПКО_Валюта = ОбменДаннымиXDTOСервер.ПКОПоИмени(КомпонентыОбмена, "Справочник_Валюта_Получение");
					КонецЕсли;	
					Знч = ОбменДаннымиXDTOСервер.СтруктураОбъектаXDTOВДанныеИБ(КомпонентыОбмена,
																			   Запись.ВалютаКт,
																			   ПКО_Валюта,
																			   Действие);
					Тип = ТипЗнч(Знч);
					Если (Тип = Тип("СправочникОбъект.Валюты")) Тогда
						Знч = Знч.Ссылка;
					ИначеЕсли (Тип <> Тип("СправочникСсылка.Валюты")) Тогда
						Знч = Справочники.Валюты.ПустаяСсылка();
					КонецЕсли;
					Новая.ВалютаКт = Знч;
				Иначе
					Новая.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
				КонецЕсли;
				Новая.ВалютнаяСуммаКт = Запись.СуммаВВалютеКт;
			КонецЕсли;
			// Заполнение субконто.
			Стр = ЗаполнитьСубконто(Запись, Новая, "Кт", КомпонентыОбмена);
			Если ((Не ПустаяСтрока(Стр)) И НетТекстаВКомментарии(Объект, Стр)) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Номер, Начало) + Стр + " " + НСтр("ru = '(кт)'"));
			КонецЕсли;
		КонецЕсли;
		// Заполнение реквизитов.
		Новая.ВидПервичногоДокумента = Запись.ВидДокумента;
		Новая.НомерПервичногоДокумента = Запись.НомерДокумента;
		Новая.ДатаПервичногоДокумента = Запись.ДатаДокумента;
		Новая.Содержание = Запись.Содержание;
	КонецЦикла;
	// Если были ошибки, то записи не активны.	
	Если (Общие.Активность И (Не ПустаяСтрока(Объект.Комментарий))) Тогда
		ЕПСБУ.УстановитьАктивность(Ложь);
	КонецЕсли;

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в бухгалтерскую операцию.
// 
// Параметры :
//	ДанныеИБ - ДокументОбъект.ОперацияБух - объект информационной базы.
//	ПолученныеДанные - ДокументОбъект.ОперацияБух - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	Пропустить - Булево - пропустить объект.
//
Процедура ПКО_Документ_БухгалтерскаяСправка_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																				   Знач ПолученныеДанные,
																			   	   Знач КомпонентыОбмена,
																				   Пропустить)
	Перем Проводки, Узел, Стр;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	// Получение данных о бухгалтерских проводках.
	Данные = ПолученныеДанные.ДополнительныеСвойства;
	Если (Не Данные.Свойство("Проводки", Проводки)) Тогда
		Проводки = Неопределено;
	КонецЕсли;
	Данные.Удалить("Проводки");
	// Заполнение проводок.
	Если (ДанныеИБ = Неопределено) Тогда
		ПолученныеДанные.УстановитьНовыйНомер();
		ЗаполнитьПроводки(ПолученныеДанные, Проводки, КомпонентыОбмена);
	ИначеЕсли (ДанныеИБ.ИДИсточника = ИзмененУИ()) Тогда
		Узел = КомпонентыОбмена.УзелКорреспондента;
		ЗарегистрироватьОбъект(ДанныеИБ, Узел);
		Пропустить = Истина;
		Если ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Стр) Тогда
			Если (Не ОбъектУчаствовалВОбмене(ДанныеИБ.Ссылка, Узел)) Тогда
				ДобавитьИдентификаторXDTO(ДанныеИБ.Ссылка, Узел, Стр);
			КонецЕсли;
		КонецЕсли;	
		Возврат;
	Иначе	
		ЗаполнитьЗначенияСвойств(ДанныеИБ, ПолученныеДанные,, "Номер");
		ЗаполнитьПроводки(ДанныеИБ, Проводки, КомпонентыОбмена);
	КонецЕсли;

КонецПроцедуры

// Обработчик выполняет поиск бухгалтерской операции.
//
// Параметры :
//	ДанныеИБ - ДокументСсылка.ОперацияБух - найденный объект информационной базы.
//	ПолученныеДанные - Документбъект.ОперацияБух - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Документ_БухгалтерскаяСправка_Получение_АлгоритмПоиска(ДанныеИБ,
																	 Знач ПолученныеДанные,
																	 Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	ИначеЕсли ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Текст) Тогда
		ДанныеИБ = СсылкаПоИдентификатору(Текст, "Документ.ОперацияБух", КомпонентыОбмена.УзелКорреспондента);
		Если (ДанныеИБ <> Неопределено) Тогда
			Возврат;															
		КонецЕсли;	
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", ПолученныеДанные.Организация);
	Отбор.Вставить("ИФО", ПолученныеДанные.ИФО);
	Отбор.Вставить("Дата", НачалоДня(ПолученныеДанные.Дата));
	Отбор.Вставить("НомерИсточника", ПолученныеДанные.НомерИсточника);
	Отбор.Вставить("Основание", Лев(ПолученныеДанные.Основание, 255));
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Отбор.Вставить("ИУИ", ИзмененУИ());
	Отбор.Вставить("ПУИ", ПолученУИ());
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Док.Ссылка КАК Ссылка
			|ИЗ	Документ.ОперацияБух КАК Док
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Док.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Док.Организация = &Организация) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И (Док.НомерИсточника = &НомерИсточника)
			|  И (НАЧАЛОПЕРИОДА(Док.Дата, ДЕНЬ) = &Дата)
			|  И ((Док.ИДИсточника = &ИУИ) ИЛИ (Док.ИДИсточника = &ПУИ))
			|  И ((Док.ИФО = &ИФО) ИЛИ (&ИФО = ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)))
			|  И (ВЫРАЗИТЬ(Док.Основание КАК СТРОКА(255)) = &Основание)
			|УПОРЯДОЧИТЬ ПО Док.ПометкаУдаления, (Док.ИФО <> &ИФО)";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		ДанныеИБ = Таб[0].Ссылка;
	КонецЕсли;	

КонецПроцедуры

// Обработчик для дополнительной обработки после загрузки данных в бухгалтерские операции.
// 
// Параметры :
//	Объект - ДокументОбъект.ОперацияБух - объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	ОбъектМодифицирован - Булево - модифицированность объекта.
//
Процедура ПКО_Документ_БухгалтерскаяСправка_Получение_ПослеЗагрузкиВсехДанных(Знач Объект,
																			  Знач КомпонентыОбмена,
																			  ОбъектМодифицирован)
	Перем ЕПСБУ, Текст, Сообщение, Сообщения, Узел, Запись;

	ОбъектМодифицирован = Ложь;
	Узел = КомпонентыОбмена.УзелКорреспондента;
	Если (Не ПустаяСтрока(Объект.Комментарий)) Тогда
		Текст = НСтр("ru = 'Не удалось полностью обработать данные из пакета для документа ""%1""!'");
		Текст = СтрШаблон(Текст, СокрЛП(Объект.Ссылка));
		Текст = Текст + Символы.ПС + НСтр("ru = 'см. текст ошибки в комментарии этого документа:'");
		Текст = Текст + Символы.ПС + Объект.Комментарий;
		ВызватьИсключение Текст;
	ИначеЕсли (Не КомпонентыОбмена.ПараметрыКонвертации.ПроверятьПолученныеПроводки) Тогда
		ЗарегистрироватьОбъект(Объект, Узел);
		Возврат;
	КонецЕсли;
	ЕПСБУ = Объект.Движения.ЖурналПроводокЕПСБУ;
	Если (ЕПСБУ.Количество() = 0) Тогда
		ЕПСБУ.Прочитать();
	КонецЕсли;
	Для Каждого Запись Из ЕПСБУ Цикл
		Запись.Активность = Истина;
	КонецЦикла;	
	ЕПСБУ.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта");
	ЕПСБУ.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	Попытка
		ОбменДаннымиСервер.УстановитьОбменДаннымиЗагрузка(Объект, Ложь, Ложь, Узел);
		Объект.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта");
		Объект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		Объект.ДополнительныеСвойства.Вставить("ФИБОбменБГУ");
		Сообщения = ПолучитьСообщенияПользователю(Истина);
		Объект.Записать();
		Для Каждого Сообщение Из Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;
	Исключение
		Текст = Новый Массив;
		Текст.Добавить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Сообщения = ПолучитьСообщенияПользователю(Истина);
		Для Каждого Сообщение Из Сообщения Цикл
			Текст.Добавить(Сообщение.Текст);
		КонецЦикла;
		ВызватьИсключение СтрСоединить(Текст, Символы.ПС);
	КонецПопытки;
	ЗарегистрироватьОбъект(Объект, Узел);

КонецПроцедуры

#КонецОбласти

#Область Документ_БюджетныеДанные

// Процедура добавляет обработчики для конвертации данных в бюджетные данные при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Документ_БюджетныеДанные_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, КонвертацияТабличнойЧасти, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_БюджетныеДанные_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.БюджетныеДанные;
	ПравилоКонвертации.ОбъектФормата = "Документ.БюджетныеДанные";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Документ_БюджетныеДанные_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Документ_БюджетныеДанные_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Документ_БюджетныеДанные_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ПослеЗагрузкиВсехДанных = "ПКО_Документ_БюджетныеДанные_Получение_ПослеЗагрузкиВсехДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "ДатаДокумента";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организация_Получение";

	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
		НоваяСтрока.СвойствоКонфигурации = "ИФО";
		НоваяСтрока.СвойствоФормата = "ИФО";
		НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ИФО_Получение";
	КонецЕсли;	
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЛицевойСчет";
	НоваяСтрока.СвойствоФормата = "ЛицевойСчет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЛицевойСчет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "РазделЛицевогоСчета";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидДанных";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НомерПервичногоДокумента";
	НоваяСтрока.СвойствоФормата = "НомерПервичногоДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаПервичногоДокумента";
	НоваяСтрока.СвойствоФормата = "ДатаПервичногоДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидПервичногоДокумента";
	НоваяСтрока.СвойствоФормата = "ВидПервичногоДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаВведенияВДействиеАссигнований";
	НоваяСтрока.СвойствоФормата = "ДатаВведенияВДействиеАссигнований";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаВведенияВДействиеЛБО";
	НоваяСтрока.СвойствоФормата = "ДатаВведенияВДействиеЛБО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаВведенияВДействиеПОФ";
	НоваяСтрока.СвойствоФормата = "ДатаВведенияВДействиеПОФ";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОтКогоРуководительДолжность";
	НоваяСтрока.СвойствоФормата = "ОтКогоРуководительДолжность";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОтКогоРуководительФИО";
	НоваяСтрока.СвойствоФормата = "ОтКогоРуководительФИО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "АссигнованияНаТекущийГод";
	НоваяСтрока.СвойствоФормата = "АссигнованияНаТекущийГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "АссигнованияНаПервыйПлановыйГод";
	НоваяСтрока.СвойствоФормата = "АссигнованияНаПервыйПлановыйГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "АссигнованияНаВторойПлановыйГод";
	НоваяСтрока.СвойствоФормата = "АссигнованияНаВторойПлановыйГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЛБОНаТекущийГод";
	НоваяСтрока.СвойствоФормата = "ЛБОНаТекущийГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЛБОНаПервыйПлановыйГод";
	НоваяСтрока.СвойствоФормата = "ЛБОНаПервыйПлановыйГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЛБОНаВторойПлановыйГод";
	НоваяСтрока.СвойствоФормата = "ЛБОНаВторойПлановыйГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПОФНаТекущийГод";
	НоваяСтрока.СвойствоФормата = "ПОФНаТекущийГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОчереднойПериод";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "Ассигнования";
    КонвертацияТабличнойЧасти.ТЧФормата = "Ассигнования";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПС";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КОСГУ";
	НоваяСтрока.СвойствоФормата = "КОСГУ";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодЦели";
	НоваяСтрока.СвойствоФормата = "КодЦели";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидЦелевыхСредств_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодМероприятия";
	НоваяСтрока.СвойствоФормата = "КодМероприятия";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Мероприятие_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаТекущийГод";
	НоваяСтрока.СвойствоФормата = "СуммаНаТекущийГод";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаПервыйПлановыйГод";
	НоваяСтрока.СвойствоФормата = "СуммаНаПервыйПлановыйГод";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаВторойПлановыйГод";
	НоваяСтрока.СвойствоФормата = "СуммаНаВторойПлановыйГод";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Примечание";
	НоваяСтрока.СвойствоФормата = "Примечание";
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "ЛБО";
    КонвертацияТабличнойЧасти.ТЧФормата = "ЛБО";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПС";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КОСГУ";
	НоваяСтрока.СвойствоФормата = "КОСГУ";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодЦели";
	НоваяСтрока.СвойствоФормата = "КодЦели";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидЦелевыхСредств_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодМероприятия";
	НоваяСтрока.СвойствоФормата = "КодМероприятия";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Мероприятие_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаТекущийГод";
	НоваяСтрока.СвойствоФормата = "СуммаНаТекущийГод";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаПервыйПлановыйГод";
	НоваяСтрока.СвойствоФормата = "СуммаНаПервыйПлановыйГод";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаВторойПлановыйГод";
	НоваяСтрока.СвойствоФормата = "СуммаНаВторойПлановыйГод";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Примечание";
	НоваяСтрока.СвойствоФормата = "Примечание";
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "ПОФ";
    КонвертацияТабличнойЧасти.ТЧФормата = "ПОФ";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПС";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КОСГУ";
	НоваяСтрока.СвойствоФормата = "КОСГУ";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодЦели";
	НоваяСтрока.СвойствоФормата = "КодЦели";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидЦелевыхСредств_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодМероприятия";
	НоваяСтрока.СвойствоФормата = "КодМероприятия";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Мероприятие_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаТекущийГод";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Примечание";
	НоваяСтрока.СвойствоФормата = "Примечание";

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в бюджетные данные.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - ДокументОбъект.БюджетныеДанные - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Документ_БюджетныеДанные_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																		  Знач ПолученныеДанные,
																		  Знач КомпонентыОбмена)
	Перем Объект, Таб, Знч, Код, Коды;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Объект = ПолученныеДанные;
	Объект.Ответственный = Пользователи.ТекущийПользователь();
	Объект.ИДИсточника = ПолученУИ();
	Если ДанныеXDTO.Свойство("ВидДанных", Знч) Тогда
		Объект.ВидДанных = ВидКБК(Знч);
	КонецЕсли;
	Объект.РазделЛицевогоСчета = НайтиРазделЛицевогоСчета(Объект.ЛицевойСчет, Перечисления.КВД.Бюджет);
	Если (ДанныеXDTO.Свойство("ОчереднойПериод", Знч) И (Знч = Истина)) Тогда
		Объект.ОчереднойПериод = 1;
	Иначе
		Объект.ОчереднойПериод = 0;
	КонецЕсли;
	Объект.СпециальныеУказания.Очистить();
	Если ДанныеXDTO.Свойство("КодСпецУказаний", Знч) Тогда
		Коды = СтрРазделить(Знч, ",", Ложь);
		Для Каждого Код Из Коды Цикл
			Знч = Справочники.СпецУказанияПоБюджетнымДанным.НайтиПоКоду(Код);
			Если ЗначениеЗаполнено(Знч) Тогда
				Объект.СпециальныеУказания.Добавить().СпециальноеУказание = Знч;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	// Передача идентификатора в обработчик перед записью.
	Знч = ИдентификаторXDTO(ДанныеXDTO);
	Если (Не ПустаяСтрока(Знч)) Тогда
		Объект.ДополнительныеСвойства.Вставить("ИдентификаторXDTO", Знч);
	КонецЕсли;	
	// Передача табличных частей в обработчик перед записью.
	Если (ДанныеXDTO.Свойство("Ассигнования", Таб) И (Таб <> Неопределено)) Тогда
		Объект.ДополнительныеСвойства.Вставить("тБА", Таб);
	КонецЕсли;		
	Если (ДанныеXDTO.Свойство("ЛБО", Таб) И (Таб <> Неопределено)) Тогда
		Объект.ДополнительныеСвойства.Вставить("тЛБО", Таб);
	КонецЕсли;		
	Если (ДанныеXDTO.Свойство("ПОФ", Таб) И (Таб <> Неопределено)) Тогда
		Объект.ДополнительныеСвойства.Вставить("тПОФ", Таб);
	КонецЕсли;		
																		  
КонецПроцедуры

// Обработчик выполняет поиск бюджетных данных.
//
// Параметры :
//	ДанныеИБ - ДокументСсылка.БюджетныеДанные - найденный объект информационной базы.
//	ПолученныеДанные - Документбъект.БюджетныеДанные - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Документ_БюджетныеДанные_Получение_АлгоритмПоиска(ДанныеИБ,
																Знач ПолученныеДанные,
																Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	ИначеЕсли ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Текст) Тогда
		ДанныеИБ = СсылкаПоИдентификатору(Текст, "Документ.БюджетныеДанные", КомпонентыОбмена.УзелКорреспондента);
		Если (ДанныеИБ <> Неопределено) Тогда
			Возврат;															
		КонецЕсли;	
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", ПолученныеДанные.Организация);
	Отбор.Вставить("ИФО", ПолученныеДанные.ИФО);
	Отбор.Вставить("Дата", НачалоДня(ПолученныеДанные.Дата));
	Отбор.Вставить("ВидПервичногоДокумента", ПолученныеДанные.ВидПервичногоДокумента);
	Отбор.Вставить("НомерПервичногоДокумента", ПолученныеДанные.НомерПервичногоДокумента);
	Отбор.Вставить("ДатаПервичногоДокумента", НачалоДня(ПолученныеДанные.ДатаПервичногоДокумента));
	Отбор.Вставить("ОчереднойПериод", ПолученныеДанные.ОчереднойПериод);
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Отбор.Вставить("ИУИ", ИзмененУИ());
	Отбор.Вставить("ПУИ", ПолученУИ());
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Док.Ссылка КАК Ссылка
			|ИЗ	Документ.БюджетныеДанные КАК Док
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Док.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Док.Организация = &Организация) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И (Док.ОчереднойПериод = &ОчереднойПериод)
			|  И (Док.ВидПервичногоДокумента = &ВидПервичногоДокумента)
			|  И (Док.НомерПервичногоДокумента = &НомерПервичногоДокумента)
			|  И (НАЧАЛОПЕРИОДА(Док.ДатаПервичногоДокумента, ДЕНЬ) = &ДатаПервичногоДокумента)
			|  И (НАЧАЛОПЕРИОДА(Док.Дата, ДЕНЬ) = &Дата)
			|  И ((Док.ИДИсточника = &ИУИ) ИЛИ (Док.ИДИсточника = &ПУИ))
			|  И ((Док.ИФО = &ИФО) ИЛИ (&ИФО = ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)))
			|УПОРЯДОЧИТЬ ПО Док.ПометкаУдаления, (Док.ИФО <> &ИФО)";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		ДанныеИБ = Таб[0].Ссылка;
	КонецЕсли;	

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в бюджетные данные.
// 
// Параметры :
//	ДанныеИБ - ДокументОбъект.БюджетныеДанные - объект информационной базы.
//	ПолученныеДанные - ДокументОбъект.БюджетныеДанные - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	Пропустить - Булево - пропустить объект.
//
Процедура ПКО_Документ_БюджетныеДанные_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																			  Знач ПолученныеДанные,
																			  Знач КомпонентыОбмена,
																			  Пропустить)
	Перем Объект, Запись, Новая, Сч, Колво, Таб, Стр, Начало, Узел;
																			  
	Если (ДанныеИБ = Неопределено) Тогда
		ПолученныеДанные.УстановитьНовыйНомер();
	ИначеЕсли (ДанныеИБ.ИДИсточника = ИзмененУИ()) Тогда
		Узел = КомпонентыОбмена.УзелКорреспондента;
		ЗарегистрироватьОбъект(ДанныеИБ, Узел);
		Пропустить = Истина;
		Если ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Стр) Тогда
			Если (Не ОбъектУчаствовалВОбмене(ДанныеИБ.Ссылка, Узел)) Тогда
				ДобавитьИдентификаторXDTO(ДанныеИБ.Ссылка, Узел, Стр);
			КонецЕсли;
		КонецЕсли;	
		Возврат;
	КонецЕсли;
	// Заполнение расшифровки нужно выполнять перед записью, т.к. при конвертации объекты ее не созданы в базе данных.	
	Объект = ПолученныеДанные;
	Если (Объект.ДополнительныеСвойства.Свойство("тБА", Таб) И (Таб <> Неопределено)) Тогда
		Колво = Таб.Количество() - 1;
		Для Сч=0 По Колво Цикл
			Начало = Ложь;
			Запись = Таб[Сч];
			Новая = Объект.Ассигнования[Сч];
			// Заполнение КБК.
			Стр = НайтиКПС(Запись.КПС, Объект.ДатаВведенияВДействиеАссигнований, Перечисления.КВД.Бюджет, КомпонентыОбмена);
			Если (ТипЗнч(Стр) <> Тип("Строка")) Тогда
				Новая.КПС = Стр;
			ИначеЕсли НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	Если (Объект.ДополнительныеСвойства.Свойство("тЛБО", Таб) И (Таб <> Неопределено)) Тогда
		Колво = Таб.Количество() - 1;
		Для Сч=0 По Колво Цикл
			Начало = Ложь;
			Запись = Таб[Сч];
			Новая = Объект.ЛБО[Сч];
			// Заполнение КБК.
			Стр = НайтиКПС(Запись.КПС, Объект.ДатаВведенияВДействиеЛБО, Перечисления.КВД.Бюджет, КомпонентыОбмена);
			Если (ТипЗнч(Стр) <> Тип("Строка")) Тогда
				Новая.КПС = Стр;
			ИначеЕсли НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	Если (Объект.ДополнительныеСвойства.Свойство("тПОФ", Таб) И (Таб <> Неопределено)) Тогда
		Колво = Таб.Количество() - 1;
		Для Сч=0 По Колво Цикл
			Начало = Ложь;
			Запись = Таб[Сч];
			Новая = Объект.ПОФ[Сч];
			// Заполнение КБК.
			Стр = НайтиКПС(Запись.КПС, Объект.ДатаВведенияВДействиеПОФ, Перечисления.КВД.Бюджет, КомпонентыОбмена);
			Если (ТипЗнч(Стр) <> Тип("Строка")) Тогда
				Новая.КПС = Стр;
			ИначеЕсли НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	Если (ДанныеИБ <> Неопределено) Тогда
		ЗаполнитьЗначенияСвойств(ДанныеИБ, Объект,, "Номер");
		ДанныеИБ.Ассигнования.Очистить();
		Для Каждого Запись Из Объект.Ассигнования Цикл
			ЗаполнитьЗначенияСвойств(ДанныеИБ.Ассигнования.Добавить(), Запись); 
		КонецЦикла;	
		ДанныеИБ.ЛБО.Очистить();
		Для Каждого Запись Из Объект.ЛБО Цикл
			ЗаполнитьЗначенияСвойств(ДанныеИБ.ЛБО.Добавить(), Запись); 
		КонецЦикла;	
		ДанныеИБ.ПОФ.Очистить();
		Для Каждого Запись Из Объект.ПОФ Цикл
			ЗаполнитьЗначенияСвойств(ДанныеИБ.ПОФ.Добавить(), Запись); 
		КонецЦикла;	
		ДанныеИБ.СпециальныеУказания.Очистить();
		Для Каждого Запись Из Объект.СпециальныеУказания Цикл
			ЗаполнитьЗначенияСвойств(ДанныеИБ.СпециальныеУказания.Добавить(), Запись); 
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

// Обработчик для дополнительной обработки после загрузки данных в бюджетные данные.
// 
// Параметры :
//	Объект - ДокументОбъект.БюджетныеДанные - объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	ОбъектМодифицирован - Булево - модифицированность объекта.
//
Процедура ПКО_Документ_БюджетныеДанные_Получение_ПослеЗагрузкиВсехДанных(Знач Объект,
																		 Знач КомпонентыОбмена,
																		 ОбъектМодифицирован)
	Перем Узел;

	ОбъектМодифицирован = Ложь;
	Узел = КомпонентыОбмена.УзелКорреспондента;
	ЗарегистрироватьОбъект(Объект, Узел);

КонецПроцедуры

#КонецОбласти

#Область Документ_КассовоеВыбытие

// Процедура добавляет обработчики для конвертации данных в кассовое выбытие при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Документ_КассовоеВыбытие_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, КонвертацияТабличнойЧасти, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_КассовоеВыбытие_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.КассовоеВыбытие;
	ПравилоКонвертации.ОбъектФормата = "Документ.КассовоеВыбытие";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Документ_КассовоеВыбытие_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Документ_КассовоеВыбытие_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Документ_КассовоеВыбытие_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ПослеЗагрузкиВсехДанных = "ПКО_Документ_КассовоеВыбытие_Получение_ПослеЗагрузкиВсехДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "ДатаДокумента";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организация_Получение";

	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
		НоваяСтрока.СвойствоКонфигурации = "ИФО";
		НоваяСтрока.СвойствоФормата = "ИФО";
		НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ИФО_Получение";
	КонецЕсли;	
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЛицевойСчет";
	НоваяСтрока.СвойствоФормата = "ЛицевойСчет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЛицевойСчет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Договор";
	НоваяСтрока.СвойствоФормата = "Договор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Договор_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИсполняемыйДоговор";
	НоваяСтрока.СвойствоФормата = "Договор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Договор_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Контрагент";
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагент_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СчетКонтрагента";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаДокумента";
	НоваяСтрока.СвойствоФормата = "СуммаДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаДокументаВВалюте";
	НоваяСтрока.СвойствоФормата = "СуммаДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НазначениеПлатежа";
	НоваяСтрока.СвойствоФормата = "НазначениеПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НомерПервичногоДокумента";
	НоваяСтрока.СвойствоФормата = "НомерПервичногоДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаПервичногоДокумента";
	НоваяСтрока.СвойствоФормата = "ДатаПервичногоДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидПервичногоДокумента";
	НоваяСтрока.СвойствоФормата = "ВидПервичногоДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПолучательПлатежа";
	НоваяСтрока.СвойствоФормата = "ПолучательПлатежа";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагент_Получение";
	
	ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "РасшифровкаПлатежа";
    КонвертацияТабличнойЧасти.ТЧФормата = "РасшифровкаПлатежа";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КБКНазначениеПлатежа";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КОСГУНазначениеПлатежа";
	НоваяСтрока.СвойствоФормата = "КОСГУНазначениеПлатежа";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Сумма";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаВал";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодЦели";
	НоваяСтрока.СвойствоФормата = "КодЦели";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидЦелевыхСредств_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодМероприятия";
	НоваяСтрока.СвойствоФормата = "КодМероприятия";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Мероприятие_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Примечание";
	НоваяСтрока.СвойствоФормата = "Примечание";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КФО";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в кассовое выбытие.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - ДокументОбъект.КассовоеВыбытие - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Документ_КассовоеВыбытие_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																		  Знач ПолученныеДанные,
																		  Знач КомпонентыОбмена)
	Перем Объект, РасшифровкаПлатежа, Знч;

	Объект = ПолученныеДанные;
	Объект.Ответственный = Пользователи.ТекущийПользователь();
	Объект.ИДИсточника = ПолученУИ();
	// Лицевой счет контрагента.
	Если ДанныеXDTO.Свойство("ЛицевойСчетКонтрагента", Знч) Тогда
		Знч = СокрЛП(Знч);
	Иначе
		Знч = "";
	КонецЕсли;	
	Если ПустаяСтрока(Знч) Тогда
		Объект.СчетКонтрагента = НайтиСчетКонтрагента(Объект.Контрагент);
	Иначе	
		Объект.СчетКонтрагента = НайтиСчетКонтрагента(Объект.Контрагент, Знч, Перечисления.ТипыЛицевыхСчетов.Казначейский);
	КонецЕсли;	
	// Передача идентификатора в обработчик перед записью.
	Знч = ИдентификаторXDTO(ДанныеXDTO);
	Если (Не ПустаяСтрока(Знч)) Тогда
		Объект.ДополнительныеСвойства.Вставить("ИдентификаторXDTO", Знч);
	КонецЕсли;	
	// Передача расшифровки в обработчик перед записью.
	Если (ДанныеXDTO.Свойство("РасшифровкаПлатежа", РасшифровкаПлатежа) И (РасшифровкаПлатежа <> Неопределено)) Тогда
		Объект.ДополнительныеСвойства.Вставить("Содержание", РасшифровкаПлатежа);
	КонецЕсли;		
																		  
КонецПроцедуры

// Обработчик выполняет поиск кассового выбытия.
//
// Параметры :
//	ДанныеИБ - ДокументСсылка.КассовоеВыбытие - найденный объект информационной базы.
//	ПолученныеДанные - Документбъект.КассовоеВыбытие - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Документ_КассовоеВыбытие_Получение_АлгоритмПоиска(ДанныеИБ,
																Знач ПолученныеДанные,
																Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	ИначеЕсли ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Текст) Тогда
		ДанныеИБ = СсылкаПоИдентификатору(Текст, "Документ.КассовоеВыбытие", КомпонентыОбмена.УзелКорреспондента);
		Если (ДанныеИБ <> Неопределено) Тогда
			Возврат;															
		КонецЕсли;	
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", ПолученныеДанные.Организация);
	Отбор.Вставить("ИФО", ПолученныеДанные.ИФО);
	Отбор.Вставить("Дата", НачалоДня(ПолученныеДанные.Дата));
	Отбор.Вставить("ВидПервичногоДокумента", ПолученныеДанные.ВидПервичногоДокумента);
	Отбор.Вставить("НомерПервичногоДокумента", ПолученныеДанные.НомерПервичногоДокумента);
	Отбор.Вставить("ДатаПервичногоДокумента", НачалоДня(ПолученныеДанные.ДатаПервичногоДокумента));
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Отбор.Вставить("ИУИ", ИзмененУИ());
	Отбор.Вставить("ПУИ", ПолученУИ());
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Док.Ссылка КАК Ссылка
			|ИЗ	Документ.КассовоеВыбытие КАК Док
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Док.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Док.Организация = &Организация) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И (Док.ВидПервичногоДокумента = &ВидПервичногоДокумента)
			|  И (Док.НомерПервичногоДокумента = &НомерПервичногоДокумента)
			|  И (НАЧАЛОПЕРИОДА(Док.ДатаПервичногоДокумента, ДЕНЬ) = &ДатаПервичногоДокумента)
			|  И (НАЧАЛОПЕРИОДА(Док.Дата, ДЕНЬ) = &Дата)
			|  И ((Док.ИДИсточника = &ИУИ) ИЛИ (Док.ИДИсточника = &ПУИ))
			|  И ((Док.ИФО = &ИФО) ИЛИ (&ИФО = ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)))
			|УПОРЯДОЧИТЬ ПО Док.ПометкаУдаления, (Док.ИФО <> &ИФО)";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		ДанныеИБ = Таб[0].Ссылка;
	КонецЕсли;	

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в кассовое выбытие.
// 
// Параметры :
//	ДанныеИБ - ДокументОбъект.КассовоеВыбытие - объект информационной базы.
//	ПолученныеДанные - ДокументОбъект.КассовоеВыбытие - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	Пропустить - Булево - пропустить объект.
//
Процедура ПКО_Документ_КассовоеВыбытие_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																			  Знач ПолученныеДанные,
																			  Знач КомпонентыОбмена,
																			  Пропустить)
	Перем Объект, Запись, Новая, Сч, Колво, РасшифровкаПлатежа, Стр, Начало, Узел;
																			  
	Если (ДанныеИБ = Неопределено) Тогда
		ПолученныеДанные.УстановитьНовыйНомер();
	ИначеЕсли (ДанныеИБ.ИДИсточника = ИзмененУИ()) Тогда
		Узел = КомпонентыОбмена.УзелКорреспондента;
		ЗарегистрироватьОбъект(ДанныеИБ, Узел);
		Пропустить = Истина;
		Если ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Стр) Тогда
			Если (Не ОбъектУчаствовалВОбмене(ДанныеИБ.Ссылка, Узел)) Тогда
				ДобавитьИдентификаторXDTO(ДанныеИБ.Ссылка, Узел, Стр);
			КонецЕсли;
		КонецЕсли;	
		Возврат;
	КонецЕсли;
	// Заполнение расшифровки нужно выполнять перед записью, т.к. при конвертации объекты ее не созданы в базе данных.	
	Объект = ПолученныеДанные;
	Если (Объект.ДополнительныеСвойства.Свойство("Содержание", РасшифровкаПлатежа) И (РасшифровкаПлатежа <> Неопределено)) Тогда
		Колво = РасшифровкаПлатежа.Количество() - 1;
		Для Сч=0 По Колво Цикл
			Начало = Ложь;
			Запись = РасшифровкаПлатежа[Сч];
			Новая = Объект.РасшифровкаПлатежа[Сч];
			// КФО.
			Новая.КФО = КФО(Запись.КФО);
			Если (Новая.КФО.Пустая() И (Не ПустаяСтрока(Запись.КФО))) Тогда
				Стр = СтрШаблон(НСтр("ru = 'По коду ""%1"" не найден КФО'"), Запись.КФО);
				Если НетТекстаВКомментарии(Объект, Стр) Тогда
					ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
				КонецЕсли;	
			КонецЕсли;
			// Заполнение КБК.
			Стр = НайтиКПС(Запись.КБКНазначениеПлатежа, Объект.Дата, Новая.КФО, КомпонентыОбмена);
			Если (ТипЗнч(Стр) <> Тип("Строка")) Тогда
				Новая.КБКНазначениеПлатежа = Стр;
			ИначеЕсли НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	Если (ДанныеИБ <> Неопределено) Тогда
		ЗаполнитьЗначенияСвойств(ДанныеИБ, Объект,, "Номер");
		ДанныеИБ.РасшифровкаПлатежа.Очистить();
		Для Каждого Запись Из Объект.РасшифровкаПлатежа Цикл
			ЗаполнитьЗначенияСвойств(ДанныеИБ.РасшифровкаПлатежа.Добавить(), Запись); 
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

// Обработчик для дополнительной обработки после загрузки данных в кассовое выбытие.
// 
// Параметры :
//	Объект - ДокументОбъект.КассовоеВыбытие - объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	ОбъектМодифицирован - Булево - модифицированность объекта.
//
Процедура ПКО_Документ_КассовоеВыбытие_Получение_ПослеЗагрузкиВсехДанных(Знач Объект,
																		 Знач КомпонентыОбмена,
																		 ОбъектМодифицирован)
	Перем Узел;

	ОбъектМодифицирован = Ложь;
	Узел = КомпонентыОбмена.УзелКорреспондента;
	ЗарегистрироватьОбъект(Объект, Узел);

КонецПроцедуры

#КонецОбласти

#Область Документ_КассовоеПоступление

// Процедура добавляет обработчики для конвертации данных в кассовое поступление при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Документ_КассовоеПоступление_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_КассовоеПоступление_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.КассовоеПоступление;
	ПравилоКонвертации.ОбъектФормата = "Документ.КассовоеПоступление";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Документ_КассовоеПоступление_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Документ_КассовоеПоступление_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Документ_КассовоеПоступление_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ПослеЗагрузкиВсехДанных = "ПКО_Документ_КассовоеПоступление_Получение_ПослеЗагрузкиВсехДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "ДатаДокумента";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организация_Получение";

	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
		НоваяСтрока.СвойствоКонфигурации = "ИФО";
		НоваяСтрока.СвойствоФормата = "ИФО";
		НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ИФО_Получение";
	КонецЕсли;	
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЛицевойСчет";
	НоваяСтрока.СвойствоФормата = "ЛицевойСчет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЛицевойСчет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИсполняемыйДоговор";
	НоваяСтрока.СвойствоФормата = "Договор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Договор_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Контрагент";
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагент_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СчетКонтрагента";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаДокумента";
	НоваяСтрока.СвойствоФормата = "СуммаДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаДокументаВВалюте";
	НоваяСтрока.СвойствоФормата = "СуммаДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НазначениеПлатежа";
	НоваяСтрока.СвойствоФормата = "НазначениеПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ИдентификаторПлатежа";
	НоваяСтрока.СвойствоФормата = "ИдентификаторПлатежа";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НомерПервичногоДокумента";
	НоваяСтрока.СвойствоФормата = "НомерПервичногоДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаПервичногоДокумента";
	НоваяСтрока.СвойствоФормата = "ДатаПервичногоДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидПервичногоДокумента";
	НоваяСтрока.СвойствоФормата = "ВидПервичногоДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Плательщик";
	НоваяСтрока.СвойствоФормата = "Плательщик";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагент_Получение";
	
	ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "РасшифровкаПлатежа";
    КонвертацияТабличнойЧасти.ТЧФормата = "РасшифровкаПлатежа";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КБКНазначениеПлатежа";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КОСГУНазначениеПлатежа";
	НоваяСтрока.СвойствоФормата = "КОСГУНазначениеПлатежа";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Сумма";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаВал";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодЦели";
	НоваяСтрока.СвойствоФормата = "КодЦели";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидЦелевыхСредств_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодМероприятия";
	НоваяСтрока.СвойствоФормата = "КодМероприятия";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Мероприятие_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Примечание";
	НоваяСтрока.СвойствоФормата = "Примечание";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КФО";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Договор";
	НоваяСтрока.СвойствоФормата = "Договор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Договор_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Контрагент";
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагент_Получение";

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в кассовое поступление.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - ДокументОбъект.КассовоеПоступление - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Документ_КассовоеПоступление_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																		  	  Знач ПолученныеДанные,
																		 	  Знач КомпонентыОбмена)
	Перем Объект, РасшифровкаПлатежа, Знч;

	Объект = ПолученныеДанные;
	Объект.Ответственный = Пользователи.ТекущийПользователь();
	Объект.ИДИсточника = ПолученУИ();
	// Лицевой счет контрагента.
	Если ДанныеXDTO.Свойство("ЛицевойСчетКонтрагента", Знч) Тогда
		Знч = СокрЛП(Знч);
	Иначе
		Знч = "";
	КонецЕсли;	
	Если ПустаяСтрока(Знч) Тогда
		Объект.СчетКонтрагента = НайтиСчетКонтрагента(Объект.Контрагент);
	Иначе	
		Объект.СчетКонтрагента = НайтиСчетКонтрагента(Объект.Контрагент, Знч, Перечисления.ТипыЛицевыхСчетов.Казначейский);
	КонецЕсли;	
	// Передача идентификатора в обработчик перед записью.
	Знч = ИдентификаторXDTO(ДанныеXDTO);
	Если (Не ПустаяСтрока(Знч)) Тогда
		Объект.ДополнительныеСвойства.Вставить("ИдентификаторXDTO", Знч);
	КонецЕсли;	
	// Передача расшифровки в обработчик перед записью.
	Если (ДанныеXDTO.Свойство("РасшифровкаПлатежа", РасшифровкаПлатежа) И (РасшифровкаПлатежа <> Неопределено)) Тогда
		Объект.ДополнительныеСвойства.Вставить("Содержание", РасшифровкаПлатежа);
	КонецЕсли;		
																		  
КонецПроцедуры

// Обработчик выполняет поиск кассового поступления.
//
// Параметры :
//	ДанныеИБ - ДокументСсылка.КассовоеПоступление - найденный объект информационной базы.
//	ПолученныеДанные - Документбъект.КассовоеПоступление - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Документ_КассовоеПоступление_Получение_АлгоритмПоиска(ДанныеИБ,
																	Знач ПолученныеДанные,
																	Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	ИначеЕсли ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Текст) Тогда
		ДанныеИБ = СсылкаПоИдентификатору(Текст, "Документ.КассовоеПоступление", КомпонентыОбмена.УзелКорреспондента);
		Если (ДанныеИБ <> Неопределено) Тогда
			Возврат;															
		КонецЕсли;	
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", ПолученныеДанные.Организация);
	Отбор.Вставить("ИФО", ПолученныеДанные.ИФО);
	Отбор.Вставить("Дата", НачалоДня(ПолученныеДанные.Дата));
	Отбор.Вставить("ВидПервичногоДокумента", ПолученныеДанные.ВидПервичногоДокумента);
	Отбор.Вставить("НомерПервичногоДокумента", ПолученныеДанные.НомерПервичногоДокумента);
	Отбор.Вставить("ДатаПервичногоДокумента", НачалоДня(ПолученныеДанные.ДатаПервичногоДокумента));
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Отбор.Вставить("ИУИ", ИзмененУИ());
	Отбор.Вставить("ПУИ", ПолученУИ());
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Док.Ссылка КАК Ссылка
			|ИЗ	Документ.КассовоеПоступление КАК Док
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Док.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Док.Организация = &Организация) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И (Док.ВидПервичногоДокумента = &ВидПервичногоДокумента)
			|  И (Док.НомерПервичногоДокумента = &НомерПервичногоДокумента)
			|  И (НАЧАЛОПЕРИОДА(Док.ДатаПервичногоДокумента, ДЕНЬ) = &ДатаПервичногоДокумента)
			|  И (НАЧАЛОПЕРИОДА(Док.Дата, ДЕНЬ) = &Дата)
			|  И ((Док.ИДИсточника = &ИУИ) ИЛИ (Док.ИДИсточника = &ПУИ))
			|  И ((Док.ИФО = &ИФО) ИЛИ (&ИФО = ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)))
			|УПОРЯДОЧИТЬ ПО Док.ПометкаУдаления, (Док.ИФО <> &ИФО)";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		ДанныеИБ = Таб[0].Ссылка;
	КонецЕсли;	

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в кассовое поступление.
// 
// Параметры :
//	ДанныеИБ - ДокументОбъект.КассовоеПоступление - объект информационной базы.
//	ПолученныеДанные - ДокументОбъект.КассовоеПоступление - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	Пропустить - Булево - пропустить объект.
//
Процедура ПКО_Документ_КассовоеПоступление_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																				  Знач ПолученныеДанные,
																				  Знач КомпонентыОбмена,
																				  Пропустить)
	Перем Объект, Запись, Новая, Сч, Колво, РасшифровкаПлатежа, Стр, Начало, Узел;

	Если (ДанныеИБ = Неопределено) Тогда
		ПолученныеДанные.УстановитьНовыйНомер();
	ИначеЕсли (ДанныеИБ.ИДИсточника = ИзмененУИ()) Тогда
		Узел = КомпонентыОбмена.УзелКорреспондента;
		ЗарегистрироватьОбъект(ДанныеИБ, Узел);
		Пропустить = Истина;
		Если ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Стр) Тогда
			Если (Не ОбъектУчаствовалВОбмене(ДанныеИБ.Ссылка, Узел)) Тогда
				ДобавитьИдентификаторXDTO(ДанныеИБ.Ссылка, Узел, Стр);
			КонецЕсли;
		КонецЕсли;	
		Возврат;
	КонецЕсли;
	// Заполнение расшифровки нужно выполнять перед записью, т.к. при конвертации объекты ее не созданы в базе данных.	
	Объект = ПолученныеДанные;
	Если (Объект.ДополнительныеСвойства.Свойство("Содержание", РасшифровкаПлатежа) И (РасшифровкаПлатежа <> Неопределено)) Тогда
		Колво = РасшифровкаПлатежа.Количество() - 1;
		Для Сч=0 По Колво Цикл
			Начало = Ложь;
			Запись = РасшифровкаПлатежа[Сч];
			Новая = Объект.РасшифровкаПлатежа[Сч];
			// КФО.
			Новая.КФО = КФО(Запись.КФО);
			Если (Новая.КФО.Пустая() И (Не ПустаяСтрока(Запись.КФО))) Тогда
				Стр = СтрШаблон(НСтр("ru = 'По коду ""%1"" не найден КФО'"), Запись.КФО);
				Если НетТекстаВКомментарии(Объект, Стр) Тогда
					ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
				КонецЕсли;	
			КонецЕсли;
			// Заполнение КБК.
			Стр = НайтиКПС(Запись.КБКНазначениеПлатежа, Объект.Дата, Новая.КФО, КомпонентыОбмена);
			Если (ТипЗнч(Стр) <> Тип("Строка")) Тогда
				Новая.КБКНазначениеПлатежа = Стр;
			ИначеЕсли НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;		
	Если (ДанныеИБ <> Неопределено) Тогда
		ЗаполнитьЗначенияСвойств(ДанныеИБ, Объект,, "Номер");
		ДанныеИБ.РасшифровкаПлатежа.Очистить();
		Для Каждого Запись Из Объект.РасшифровкаПлатежа Цикл
			ЗаполнитьЗначенияСвойств(ДанныеИБ.РасшифровкаПлатежа.Добавить(), Запись); 
		КонецЦикла;	
	КонецЕсли;	
																			  
КонецПроцедуры

// Обработчик для дополнительной обработки после загрузки данных в кассовое поступление.
// 
// Параметры :
//	Объект - ДокументОбъект.КассовоеПоступление - объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	ОбъектМодифицирован - Булево - модифицированность объекта.
//
Процедура ПКО_Документ_КассовоеПоступление_Получение_ПослеЗагрузкиВсехДанных(Знач Объект,
																			 Знач КомпонентыОбмена,
																			 ОбъектМодифицирован)
	Перем Узел;

	ОбъектМодифицирован = Ложь;
	Узел = КомпонентыОбмена.УзелКорреспондента;
	ЗарегистрироватьОбъект(Объект, Узел);

КонецПроцедуры

#КонецОбласти

#Область Документ_РасходноеРасписание

// Процедура добавляет обработчики для конвертации данных в расходное расписание при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Документ_РасходноеРасписание_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, КонвертацияТабличнойЧасти, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_РасходноеРасписание_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.РасходноеРасписание;
	ПравилоКонвертации.ОбъектФормата = "Документ.РасходноеРасписание";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Документ_РасходноеРасписание_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Документ_РасходноеРасписание_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Документ_РасходноеРасписание_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ПослеЗагрузкиВсехДанных = "ПКО_Документ_РасходноеРасписание_Получение_ПослеЗагрузкиВсехДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "ДатаДокумента";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НомерИсточника";
	НоваяСтрока.СвойствоФормата = "НомерДокумента";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номер";
	НоваяСтрока.СвойствоФормата = "НомерДокументаФО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидДанных";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организация_Получение";

	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
		НоваяСтрока.СвойствоКонфигурации = "ИФО";
		НоваяСтрока.СвойствоФормата = "ИФО";
		НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ИФО_Получение";
	КонецЕсли;	
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Распорядитель";
	НоваяСтрока.СвойствоФормата = "Распорядитель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организация_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЛицевойСчет";
	НоваяСтрока.СвойствоФормата = "ЛицевойСчет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЛицевойСчет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "РазделЛицевогоСчета";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЛицевойСчетПБС";
	НоваяСтрока.СвойствоФормата = "ЛицевойСчетПБС";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЛицевойСчет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "РазделЛицевогоСчетаПБС";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДоведениеДанныхСебеКакПБС";
	НоваяСтрока.СвойствоФормата = "ДоведениеДанныхСебеКакПБС";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Получатель";
	НоваяСтрока.СвойствоФормата = "Получатель";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагент_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СчетПолучателя";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаВведенияВДействие";
	НоваяСтрока.СвойствоФормата = "ДатаВведенияВДействие";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаВведенияВДействиеАссигнований";
	НоваяСтрока.СвойствоФормата = "ДатаВведенияВДействиеАссигнований";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаВведенияВДействиеЛБО";
	НоваяСтрока.СвойствоФормата = "ДатаВведенияВДействиеЛБО";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ДатаВведенияВДействиеПОФ";
	НоваяСтрока.СвойствоФормата = "ДатаВведенияВДействиеПОФ";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОрганКазначейства";
	НоваяСтрока.СвойствоФормата = "ОрганКазначейства";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Казначейство_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОрганКазначействаКуда";
	НоваяСтрока.СвойствоФормата = "ОрганКазначействаКуда";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Казначейство_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПризнакСекретности";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОснованиеСекретности";
	НоваяСтрока.СвойствоФормата = "ОснованиеСекретности";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "АссигнованияНаТекущийГод";
	НоваяСтрока.СвойствоФормата = "АссигнованияНаТекущийГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "АссигнованияНаПервыйПлановыйГод";
	НоваяСтрока.СвойствоФормата = "АссигнованияНаПервыйПлановыйГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "АссигнованияНаВторойПлановыйГод";
	НоваяСтрока.СвойствоФормата = "АссигнованияНаВторойПлановыйГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЛБОНаТекущийГод";
	НоваяСтрока.СвойствоФормата = "ЛБОНаТекущийГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЛБОНаПервыйПлановыйГод";
	НоваяСтрока.СвойствоФормата = "ЛБОНаПервыйПлановыйГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЛБОНаВторойПлановыйГод";
	НоваяСтрока.СвойствоФормата = "ЛБОНаВторойПлановыйГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПОФНаТекущийГод";
	НоваяСтрока.СвойствоФормата = "ПОФНаТекущийГод";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОчереднойПериод";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "Ассигнования";
    КонвертацияТабличнойЧасти.ТЧФормата = "Ассигнования";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПС";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КОСГУ";
	НоваяСтрока.СвойствоФормата = "КОСГУ";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодЦели";
	НоваяСтрока.СвойствоФормата = "КодЦели";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидЦелевыхСредств_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодМероприятия";
	НоваяСтрока.СвойствоФормата = "КодМероприятия";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Мероприятие_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаТекущийГод";
	НоваяСтрока.СвойствоФормата = "СуммаНаТекущийГод";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаПервыйПлановыйГод";
	НоваяСтрока.СвойствоФормата = "СуммаНаПервыйПлановыйГод";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаВторойПлановыйГод";
	НоваяСтрока.СвойствоФормата = "СуммаНаВторойПлановыйГод";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Примечание";
	НоваяСтрока.СвойствоФормата = "Примечание";
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "ЛБО";
    КонвертацияТабличнойЧасти.ТЧФормата = "ЛБО";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПС";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КОСГУ";
	НоваяСтрока.СвойствоФормата = "КОСГУ";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодЦели";
	НоваяСтрока.СвойствоФормата = "КодЦели";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидЦелевыхСредств_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодМероприятия";
	НоваяСтрока.СвойствоФормата = "КодМероприятия";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Мероприятие_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаТекущийГод";
	НоваяСтрока.СвойствоФормата = "СуммаНаТекущийГод";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаПервыйПлановыйГод";
	НоваяСтрока.СвойствоФормата = "СуммаНаПервыйПлановыйГод";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаВторойПлановыйГод";
	НоваяСтрока.СвойствоФормата = "СуммаНаВторойПлановыйГод";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Примечание";
	НоваяСтрока.СвойствоФормата = "Примечание";
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "ПОФ";
    КонвертацияТабличнойЧасти.ТЧФормата = "ПОФ";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПС";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КОСГУ";
	НоваяСтрока.СвойствоФормата = "КОСГУ";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодЦели";
	НоваяСтрока.СвойствоФормата = "КодЦели";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидЦелевыхСредств_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодМероприятия";
	НоваяСтрока.СвойствоФормата = "КодМероприятия";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Мероприятие_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНаТекущийГод";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Примечание";
	НоваяСтрока.СвойствоФормата = "Примечание";
	
КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в расходное расписание.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - ДокументОбъект.РасходноеРасписание - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Документ_РасходноеРасписание_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																			  Знач ПолученныеДанные,
																			  Знач КомпонентыОбмена)
	Перем Объект, Таб, Знч, Код, Коды;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Объект = ПолученныеДанные;
	Объект.Ответственный = Пользователи.ТекущийПользователь();
	Объект.ИДИсточника = ПолученУИ();
	Если ДанныеXDTO.Свойство("ВидДанных", Знч) Тогда
		Объект.ВидДанных = ВидКБК(Знч);
	КонецЕсли;
	Объект.РазделЛицевогоСчета = НайтиРазделЛицевогоСчета(Объект.ЛицевойСчет, Перечисления.КВД.Бюджет);
	Объект.РазделЛицевогоСчетаПБС = НайтиРазделЛицевогоСчета(Объект.ЛицевойСчетПБС, Перечисления.КВД.Бюджет);
	// Лицевой счет получателя.
	Если ДанныеXDTO.Свойство("ЛицевойСчетПолучателя", Знч) Тогда
		Знч = СокрЛП(Знч);
	Иначе
		Знч = "";
	КонецЕсли;	
	Объект.СчетПолучателя = НайтиСчетКонтрагента(Объект.Получатель, Знч, Перечисления.ТипыЛицевыхСчетов.Казначейский);
	// Признак секретности.
	Если ДанныеXDTO.Свойство("ПризнакСекретности", Знч) Тогда
		Знч = СокрЛП(Знч);
	Иначе
		Знч = "";
	КонецЕсли;
	Если (Знч = "0") Тогда
		Объект.ПризнакСекретности = Перечисления.ПризнакСекретности.НеСекретно;
	ИначеЕсли (Знч = "1") Тогда
		Объект.ПризнакСекретности = Перечисления.ПризнакСекретности.ДСП;
	ИначеЕсли (Знч = "2") Тогда
		Объект.ПризнакСекретности = Перечисления.ПризнакСекретности.Секретно;
	ИначеЕсли (Знч = "3") Тогда
		Объект.ПризнакСекретности = Перечисления.ПризнакСекретности.СовершенноСекретно;
	ИначеЕсли (Знч = "4") Тогда
		Объект.ПризнакСекретности = Перечисления.ПризнакСекретности.ОсобойВажности;
	ИначеЕсли (ДанныеXDTO.Свойство("ОснованиеСекретности", Знч) И (Не ПустаяСтрока(Знч))) Тогда
		Объект.ПризнакСекретности = Перечисления.ПризнакСекретности.НеСекретно;
	Иначе
		Объект.ПризнакСекретности = Перечисления.ПризнакСекретности.ПустаяСсылка();
	КонецЕсли;	
	Если (ДанныеXDTO.Свойство("ОчереднойПериод", Знч) И (Знч = Истина)) Тогда
		Объект.ОчереднойПериод = 1;
	Иначе
		Объект.ОчереднойПериод = 0;
	КонецЕсли;
	Объект.СпециальныеУказания.Очистить();
	Если ДанныеXDTO.Свойство("КодСпецУказаний", Знч) Тогда
		Коды = СтрРазделить(Знч, ",", Ложь);
		Для Каждого Код Из Коды Цикл
			Знч = Справочники.СпецУказанияПоБюджетнымДанным.НайтиПоКоду(Код);
			Если ЗначениеЗаполнено(Знч) Тогда
				Объект.СпециальныеУказания.Добавить().СпециальноеУказание = Знч;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	// Передача идентификатора в обработчик перед записью.
	Знч = ИдентификаторXDTO(ДанныеXDTO);
	Если (Не ПустаяСтрока(Знч)) Тогда
		Объект.ДополнительныеСвойства.Вставить("ИдентификаторXDTO", Знч);
	КонецЕсли;	
	// Передача табличных частей в обработчик перед записью.
	Если (ДанныеXDTO.Свойство("Ассигнования", Таб) И (Таб <> Неопределено)) Тогда
		Объект.ДополнительныеСвойства.Вставить("тБА", Таб);
	КонецЕсли;		
	Если (ДанныеXDTO.Свойство("ЛБО", Таб) И (Таб <> Неопределено)) Тогда
		Объект.ДополнительныеСвойства.Вставить("тЛБО", Таб);
	КонецЕсли;		
	Если (ДанныеXDTO.Свойство("ПОФ", Таб) И (Таб <> Неопределено)) Тогда
		Объект.ДополнительныеСвойства.Вставить("тПОФ", Таб);
	КонецЕсли;		
																		  
КонецПроцедуры

// Обработчик выполняет поиск расходного расписания.
//
// Параметры :
//	ДанныеИБ - ДокументСсылка.РасходноеРасписание - найденный объект информационной базы.
//	ПолученныеДанные - Документбъект.РасходноеРасписание - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Документ_РасходноеРасписание_Получение_АлгоритмПоиска(ДанныеИБ,
																	Знач ПолученныеДанные,
																	Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	ИначеЕсли ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Текст) Тогда
		ДанныеИБ = СсылкаПоИдентификатору(Текст, "Документ.РасходноеРасписание", КомпонентыОбмена.УзелКорреспондента);
		Если (ДанныеИБ <> Неопределено) Тогда
			Возврат;															
		КонецЕсли;	
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", ПолученныеДанные.Организация);
	Отбор.Вставить("ИФО", ПолученныеДанные.ИФО);
	Отбор.Вставить("Дата", НачалоДня(ПолученныеДанные.Дата));
	Отбор.Вставить("НомерИсточника", ПолученныеДанные.НомерИсточника);
	Отбор.Вставить("Номер", ПолученныеДанные.Номер);
	Отбор.Вставить("ДатаВведенияВДействие", НачалоДня(ПолученныеДанные.ДатаВведенияВДействие));
	Отбор.Вставить("ОчереднойПериод", ПолученныеДанные.ОчереднойПериод);
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Отбор.Вставить("ИУИ", ИзмененУИ());
	Отбор.Вставить("ПУИ", ПолученУИ());
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Док.Ссылка КАК Ссылка
			|ИЗ	Документ.РасходноеРасписание КАК Док
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Док.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Док.Организация = &Организация) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И (Док.ОчереднойПериод = &ОчереднойПериод)
			|  И (Док.НомерИсточника = &НомерИсточника)
			|  И (НАЧАЛОПЕРИОДА(Док.ДатаВведенияВДействие, ДЕНЬ) = &ДатаВведенияВДействие)
			|  И (НАЧАЛОПЕРИОДА(Док.Дата, ДЕНЬ) = &Дата)
			|  И ((Док.ИДИсточника = &ИУИ) ИЛИ (Док.ИДИсточника = &ПУИ))
			|  И ((Док.ИФО = &ИФО) ИЛИ (&ИФО = ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)))
			|УПОРЯДОЧИТЬ ПО Док.ПометкаУдаления, (Док.ИФО <> &ИФО), (Док.Номер <> &Номер)";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		ДанныеИБ = Таб[0].Ссылка;
	КонецЕсли;	

КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в расходное расписание.
// 
// Параметры :
//	ДанныеИБ - ДокументОбъект.РасходноеРасписание - объект информационной базы.
//	ПолученныеДанные - ДокументОбъект.РасходноеРасписание - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	Пропустить - Булево - пропустить объект.
//
Процедура ПКО_Документ_РасходноеРасписание_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																				  Знач ПолученныеДанные,
																				  Знач КомпонентыОбмена,
																				  Пропустить)
	Перем Объект, Запись, Новая, Сч, Колво, Таб, Стр, Начало, Узел;
																			  
	Если (ДанныеИБ = Неопределено) Тогда
		Если ПустаяСтрока(ПолученныеДанные.Номер) Тогда
			ПолученныеДанные.УстановитьНовыйНомер();
		КонецЕсли;	
	ИначеЕсли (ДанныеИБ.ИДИсточника = ИзмененУИ()) Тогда
		Узел = КомпонентыОбмена.УзелКорреспондента;
		ЗарегистрироватьОбъект(ДанныеИБ, Узел);
		Пропустить = Истина;
		Если ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Стр) Тогда
			Если (Не ОбъектУчаствовалВОбмене(ДанныеИБ.Ссылка, Узел)) Тогда
				ДобавитьИдентификаторXDTO(ДанныеИБ.Ссылка, Узел, Стр);
			КонецЕсли;
		КонецЕсли;	
		Возврат;
	КонецЕсли;
	// Заполнение расшифровки нужно выполнять перед записью, т.к. при конвертации объекты ее не созданы в базе данных.	
	Объект = ПолученныеДанные;
	Если (ПустаяСтрока(Объект.Номер) И (ДанныеИБ <> Неопределено)) Тогда
		Объект.Номер = ДанныеИБ.Номер;
	КонецЕсли;	
	Если (Объект.ДополнительныеСвойства.Свойство("тБА", Таб) И (Таб <> Неопределено)) Тогда
		Колво = Таб.Количество() - 1;
		Для Сч=0 По Колво Цикл
			Начало = Ложь;
			Запись = Таб[Сч];
			Новая = Объект.Ассигнования[Сч];
			// Заполнение КБК.
			Стр = НайтиКПС(Запись.КПС, Объект.ДатаВведенияВДействиеАссигнований, Перечисления.КВД.Бюджет, КомпонентыОбмена);
			Если (ТипЗнч(Стр) <> Тип("Строка")) Тогда
				Новая.КПС = Стр;
			ИначеЕсли НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	Если (Объект.ДополнительныеСвойства.Свойство("тЛБО", Таб) И (Таб <> Неопределено)) Тогда
		Колво = Таб.Количество() - 1;
		Для Сч=0 По Колво Цикл
			Начало = Ложь;
			Запись = Таб[Сч];
			Новая = Объект.ЛБО[Сч];
			// Заполнение КБК.
			Стр = НайтиКПС(Запись.КПС, Объект.ДатаВведенияВДействиеЛБО, Перечисления.КВД.Бюджет, КомпонентыОбмена);
			Если (ТипЗнч(Стр) <> Тип("Строка")) Тогда
				Новая.КПС = Стр;
			ИначеЕсли НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	Если (Объект.ДополнительныеСвойства.Свойство("тПОФ", Таб) И (Таб <> Неопределено)) Тогда
		Колво = Таб.Количество() - 1;
		Для Сч=0 По Колво Цикл
			Начало = Ложь;
			Запись = Таб[Сч];
			Новая = Объект.ПОФ[Сч];
			// Заполнение КБК.
			Стр = НайтиКПС(Запись.КПС, Объект.ДатаВведенияВДействиеПОФ, Перечисления.КВД.Бюджет, КомпонентыОбмена);
			Если (ТипЗнч(Стр) <> Тип("Строка")) Тогда
				Новая.КПС = Стр;
			ИначеЕсли НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;		
	Если (ДанныеИБ <> Неопределено) Тогда
		ЗаполнитьЗначенияСвойств(ДанныеИБ, Объект,, "Номер");
		ДанныеИБ.Ассигнования.Очистить();
		Для Каждого Запись Из Объект.Ассигнования Цикл
			ЗаполнитьЗначенияСвойств(ДанныеИБ.Ассигнования.Добавить(), Запись); 
		КонецЦикла;	
		ДанныеИБ.ЛБО.Очистить();
		Для Каждого Запись Из Объект.ЛБО Цикл
			ЗаполнитьЗначенияСвойств(ДанныеИБ.ЛБО.Добавить(), Запись); 
		КонецЦикла;	
		ДанныеИБ.ПОФ.Очистить();
		Для Каждого Запись Из Объект.ПОФ Цикл
			ЗаполнитьЗначенияСвойств(ДанныеИБ.ПОФ.Добавить(), Запись); 
		КонецЦикла;	
		ДанныеИБ.СпециальныеУказания.Очистить();
		Для Каждого Запись Из Объект.СпециальныеУказания Цикл
			ЗаполнитьЗначенияСвойств(ДанныеИБ.СпециальныеУказания.Добавить(), Запись); 
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

// Обработчик для дополнительной обработки после загрузки данных в расходное расписание.
// 
// Параметры :
//	Объект - ДокументОбъект.РасходноеРасписание - объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	ОбъектМодифицирован - Булево - модифицированность объекта.
//
Процедура ПКО_Документ_РасходноеРасписание_Получение_ПослеЗагрузкиВсехДанных(Знач Объект,
																			 Знач КомпонентыОбмена,
																			 ОбъектМодифицирован)
	Перем Узел;

	ОбъектМодифицирован = Ложь;
	Узел = КомпонентыОбмена.УзелКорреспондента;
	ЗарегистрироватьОбъект(Объект, Узел);

КонецПроцедуры

#КонецОбласти

#Область Документ_РегистрацияОбязательствИСведенийПоДоговорам

// Процедура добавляет обработчики для конвертации данных в сведения об обязательствах данные при получении.
//
// Параметры :
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ДобавитьПКО_Документ_РегистрацияОбязательств_Получение(Знач ПравилаКонвертации)
	Перем ПравилоКонвертации, КонвертацияТабличнойЧасти, НоваяСтрока;

	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО = "Документ_РегистрацияОбязательств_Получение";
	ПравилоКонвертации.ОбъектДанных = Метаданные.Документы.РегистрацияОбязательствИСведенийПоДоговорам;
	ПравилоКонвертации.ОбъектФормата = "Документ.РегистрацияОбязательствИСведенийПоДоговорам";
	ПравилоКонвертации.ПравилоДляГруппыСправочника = Ложь;
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO = "ПКО_Документ_РегистрацияОбязательств_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Документ_РегистрацияОбязательств_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.АлгоритмПоиска = "ПКО_Документ_РегистрацияОбязательств_Получение_АлгоритмПоиска";
	ПравилоКонвертации.ПослеЗагрузкиВсехДанных = "ПКО_Документ_РегистрацияОбязательств_Получение_ПослеЗагрузкиВсехДанных";
	ПравилоКонвертации.ВариантИдентификации = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Дата";
	НоваяСтрока.СвойствоФормата = "ДатаДокумента";

	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "НомерИсточника";
	НоваяСтрока.СвойствоФормата = "НомерДокумента";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Организация";
	НоваяСтрока.СвойствоФормата = "Организация";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Организация_Получение";

	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
		НоваяСтрока.СвойствоКонфигурации = "ИФО";
		НоваяСтрока.СвойствоФормата = "ИФО";
		НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ИФО_Получение";
	КонецЕсли;	
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЛицевойСчет";
	НоваяСтрока.СвойствоФормата = "ЛицевойСчет";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ЛицевойСчет_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Договор";
	НоваяСтрока.СвойствоФормата = "Договор";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Договор_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ВидОбязательства";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Контрагент";
	НоваяСтрока.СвойствоФормата = "Контрагент";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Контрагент_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СчетКонтрагента";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОрганКазначейства";
	НоваяСтрока.СвойствоФормата = "ОрганКазначейства";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Казначейство_Получение";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СрокИсполнения";
	НоваяСтрока.СвойствоФормата = "СрокИсполнения";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Сумма";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаВВалюте";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаАванса";
	НоваяСтрока.СвойствоФормата = "СуммаАванса";
	
	НоваяСтрока = ПравилоКонвертации.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КазначейскоеСопровождение";
	НоваяСтрока.СвойствоФормата = "КазначейскоеСопровождение";
	
	ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "РасшифровкаОбязательстваБюджет";
    КонвертацияТабличнойЧасти.ТЧФормата = "РасшифровкаОбязательстваБюджет";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПС";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КЭК";
	НоваяСтрока.СвойствоФормата = "КЭК";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодЦели";
	НоваяСтрока.СвойствоФормата = "КодЦели";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидЦелевыхСредств_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодМероприятия";
	НоваяСтрока.СвойствоФормата = "КодМероприятия";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Мероприятие_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КФО";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПериодПлана";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Сумма";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаВВалюте";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаВВалютеБезусловная";
	НоваяСтрока.СвойствоФормата = "СуммаБезусловная";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаИсполнено";
	НоваяСтрока.СвойствоФормата = "СуммаИсполнено";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаИсполненоБезусловно";
	НоваяСтрока.СвойствоФормата = "СуммаИсполненоБезусловно";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНеИсполнено";
	НоваяСтрока.СвойствоФормата = "СуммаНеИсполнено";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаНеИсполненоБезусловно";
	НоваяСтрока.СвойствоФормата = "СуммаНеИсполненоБезусловно";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОКП";
	НоваяСтрока.СвойствоФормата = "ОКП";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номенклатура";
	НоваяСтрока.СвойствоФормата = "Номенклатура";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Номенклатура_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЕдиницаИзмерения";
	НоваяСтрока.СвойствоФормата = "ЕдиницаИзмерения";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КЕИ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Количество";
	НоваяСтрока.СвойствоФормата = "Количество";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "РазделЛицевогоСчета";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЗапретИзменения";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
    КонвертацияТабличнойЧасти = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
    КонвертацияТабличнойЧасти.ТЧКонфигурации = "РасшифровкаОбязательстваВнебюджет";
    КонвертацияТабличнойЧасти.ТЧФормата = "РасшифровкаОбязательстваВнебюджет";
    КонвертацияТабличнойЧасти.Свойства = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КПС";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КЭК";
	НоваяСтрока.СвойствоФормата = "КЭК";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КОСГУ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодЦели";
	НоваяСтрока.СвойствоФормата = "КодЦели";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_ВидЦелевыхСредств_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КодМероприятия";
	НоваяСтрока.СвойствоФормата = "КодМероприятия";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Мероприятие_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "КФО";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ПериодПлана";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Сумма";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаВВалюте";
	НоваяСтрока.СвойствоФормата = "Сумма";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "СуммаВВалютеБезусловная";
	НоваяСтрока.СвойствоФормата = "СуммаБезусловная";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ОКП";
	НоваяСтрока.СвойствоФормата = "ОКП";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Номенклатура";
	НоваяСтрока.СвойствоФормата = "Номенклатура";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_Номенклатура_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЕдиницаИзмерения";
	НоваяСтрока.СвойствоФормата = "ЕдиницаИзмерения";
	НоваяСтрока.ПравилоКонвертацииСвойства = "Справочник_КЕИ_Получение";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "Количество";
	НоваяСтрока.СвойствоФормата = "Количество";
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "РазделЛицевогоСчета";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;
	
	НоваяСтрока = КонвертацияТабличнойЧасти.Свойства.Добавить();
	НоваяСтрока.СвойствоКонфигурации = "ЗапретИзменения";
	НоваяСтрока.СвойствоФормата = "";
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = Истина;

КонецПроцедуры

// Обработчик сохраняет данные из пакета XDTO в сведения об обязательствах.
//
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	ПолученныеДанные - ДокументОбъект.РегистрацияОбязательствИСведенийПоДоговорам - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Документ_РегистрацияОбязательств_Получение_ПриКонвертацииДанныхXDTO(Знач ДанныеXDTO,
																				  Знач ПолученныеДанные,
																				  Знач КомпонентыОбмена)
	Перем Объект, Таб, Знч, УчетПредмета, ПринятоеОбязательство, ДД, ВД;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Объект = ПолученныеДанные;
	Объект.Ответственный = Пользователи.ТекущийПользователь();
	Объект.ИДИсточника = ПолученУИ();
	// Вид обязательства.
	УчетПредмета = ДанныеXDTO.Свойство("УчетПредмета", Знч) И (Знч = Истина);
	ПринятоеОбязательство = ДанныеXDTO.Свойство("ПринятоеОбязательство", Знч) И (Знч = Истина);
	Если ПолученныеДанные.Договор.Пустая() Тогда
		Если (Не ПринятоеОбязательство) Тогда
			Знч = Перечисления.ВидыПринятыхОбязательств.ПринимаемоеОбязательство;
		ИначеЕсли УчетПредмета Тогда
			Знч = Перечисления.ВидыПринятыхОбязательств.ПринятоеОбязательствоУчетПредмета;
		Иначе	
			Знч = Перечисления.ВидыПринятыхОбязательств.ПринятоеОбязательство;
		КонецЕсли;	
	Иначе	
		ДД = РаботаСОбязательствами.ПолучитьДейстующийДокументОбязательствоУчетПредмета(ПолученныеДанные.Договор);
		Если ЗначениеЗаполнено(ДД.ДействующийДокумент) Тогда
			Объект.ДополнительныеСвойства.Вставить("ДейстующийДокумент", ДД);
			Если (Год(ПолученныеДанные.Дата) = Год(ДД.ДействующийДокументДата)) Тогда
				Если (Не ПринятоеОбязательство) Тогда
					Знч = Перечисления.ВидыПринятыхОбязательств.ПринимаемоеОбязательствоИзменения;
				ИначеЕсли УчетПредмета Тогда
					ВД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДД.ДействующийДокумент, "ВидОбязательства");
					Если (ВД = Перечисления.ВидыПринятыхОбязательств.ПринимаемоеОбязательство)
					 Или (ВД = Перечисления.ВидыПринятыхОбязательств.ПринимаемоеОбязательствоИзменения)
					 Или (ВД = Перечисления.ВидыПринятыхОбязательств.ПринимаемоеОбязательствоПеререгистрация) Тогда
						Знч = Перечисления.ВидыПринятыхОбязательств.ПринятоеОбязательствоКонкурсныеПроцедуры;
					Иначе	
						Знч = Перечисления.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательстваУчетПредмета;
					КонецЕсли;	
				Иначе
					Знч = Перечисления.ВидыПринятыхОбязательств.ЗаявкаНаИзменениеОбязательства;
				КонецЕсли;	
			ИначеЕсли (Не ПринятоеОбязательство) Тогда
				Знч = Перечисления.ВидыПринятыхОбязательств.ПринимаемоеОбязательствоПеререгистрация;
			ИначеЕсли УчетПредмета Тогда
				Знч = Перечисления.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета;
			Иначе
				Знч = Перечисления.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства;
			КонецЕсли;	
		ИначеЕсли (Не ПринятоеОбязательство) Тогда
			Знч = Перечисления.ВидыПринятыхОбязательств.ПринимаемоеОбязательство;
		ИначеЕсли УчетПредмета Тогда
			Знч = Перечисления.ВидыПринятыхОбязательств.ПринятоеОбязательствоУчетПредмета;
		Иначе
			Знч = Перечисления.ВидыПринятыхОбязательств.ПринятоеОбязательство;
		КонецЕсли;	
	КонецЕсли;	
	Объект.ВидОбязательства = Знч;
	// Лицевой счет контрагента.
	Если ДанныеXDTO.Свойство("ЛицевойСчетКонтрагента", Знч) Тогда
		Знч = СокрЛП(Знч);
	Иначе
		Знч = "";
	КонецЕсли;	
	Если ПустаяСтрока(Знч) Тогда
		Объект.СчетКонтрагента = НайтиСчетКонтрагента(Объект.Контрагент);
	Иначе	
		Объект.СчетКонтрагента = НайтиСчетКонтрагента(Объект.Контрагент, Знч, Перечисления.ТипыЛицевыхСчетов.Казначейский);
	КонецЕсли;	
	// Передача идентификатора в обработчик перед записью.
	Знч = ИдентификаторXDTO(ДанныеXDTO);
	Если (Не ПустаяСтрока(Знч)) Тогда
		Объект.ДополнительныеСвойства.Вставить("ИдентификаторXDTO", Знч);
	КонецЕсли;	
	// Передача табличных частей в обработчик перед записью.
	Если (ДанныеXDTO.Свойство("РасшифровкаОбязательстваБюджет", Таб) И (Таб <> Неопределено)) Тогда
		Объект.ДополнительныеСвойства.Вставить("тРасшифровкаОбязательстваБюджет", Таб);
	КонецЕсли;		
	Если (ДанныеXDTO.Свойство("РасшифровкаОбязательстваВнебюджет", Таб) И (Таб <> Неопределено)) Тогда
		Объект.ДополнительныеСвойства.Вставить("тРасшифровкаОбязательстваВнебюджет", Таб);
	КонецЕсли;		
	// Учетный номер.
	Знч = "";
	Если (ДанныеXDTO.Свойство("НомерОбязательства", Знч) И (Не ПустаяСтрока(Знч))) Тогда
		Объект.ДополнительныеСвойства.Вставить("УчетныйНомер", Знч);
	КонецЕсли;	
																		  
КонецПроцедуры

// Обработчик выполняет поиск сведений об обязательствах.
//
// Параметры :
//	ДанныеИБ - ДокументСсылка.РегистрацияОбязательствИСведенийПоДоговорам - найденный объект информационной базы.
//	ПолученныеДанные - Документбъект.РегистрацияОбязательствИСведенийПоДоговорам - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//
Процедура ПКО_Документ_РегистрацияОбязательств_Получение_АлгоритмПоиска(ДанныеИБ,
																		Знач ПолученныеДанные,
																		Знач КомпонентыОбмена)
	Перем Текст, Отбор, Таб;															
																
	Если (ДанныеИБ <> Неопределено) Тогда
		Возврат;															
	ИначеЕсли ПолученныеДанные.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Текст) Тогда
		ДанныеИБ = СсылкаПоИдентификатору(Текст, "Документ.РегистрацияОбязательствИСведенийПоДоговорам", КомпонентыОбмена.УзелКорреспондента);
		Если (ДанныеИБ <> Неопределено) Тогда
			Возврат;															
		КонецЕсли;	
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", ПолученныеДанные.Организация);
	Отбор.Вставить("Дата", НачалоДня(ПолученныеДанные.Дата));
	Отбор.Вставить("НомерИсточника", ПолученныеДанные.НомерИсточника);
	Отбор.Вставить("Договор", ПолученныеДанные.Договор);
	Отбор.Вставить("Узел", КомпонентыОбмена.УзелКорреспондента);
	Отбор.Вставить("ИУИ", ИзмененУИ());
	Отбор.Вставить("ПУИ", ПолученУИ());
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Док.Ссылка КАК Ссылка
			|ИЗ	Документ.РегистрацияОбязательствИСведенийПоДоговорам КАК Док
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПИ
			|ПО (ПИ.Ссылка = Док.Ссылка) И (ПИ.УзелИнформационнойБазы = &Узел)
			|ГДЕ (Док.Организация = &Организация) И (ПИ.Ссылка ЕСТЬ NULL)
			|  И (Док.Договор = &Договор)
			|  И (Док.НомерИсточника = &НомерИсточника)
			|  И (НАЧАЛОПЕРИОДА(Док.Дата, ДЕНЬ) = &Дата)
			|  И ((Док.ИДИсточника = &ИУИ) ИЛИ (Док.ИДИсточника = &ПУИ))
			|УПОРЯДОЧИТЬ ПО Док.ПометкаУдаления";
	Таб = ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() <> 0) Тогда
		ДанныеИБ = Таб[0].Ссылка;
	КонецЕсли;	

КонецПроцедуры

// Заполнение признака запрета изменения.
//
// Параметры :
//  Объект - ДокументОбъект.РегистрацияОбязательствИСведенийПоДоговорам - объект информационной базы.
//	ИмяТаблицы - Строка - имя табличной части.
//
Процедура ЗаполнитьЗапретИзменения(Знач Объект, Знач ИмяТаблицы)
	Перем ДД, Текст, Таб, рТаб, Отбор, Запись, рЗапись, Строки, Сч, Индекс, Колво, Флаг;
	
	Если (Не Объект.ДополнительныеСвойства.Свойство("ДейстующийДокумент", ДД)) Тогда
		Возврат;
	ИначеЕсли (ТипЗнч(ДД) <> Тип("Структура")) Тогда
		Возврат;
	ИначеЕсли (Не ЗначениеЗаполнено(ДД.ДействующийДокумент)) Тогда
		Возврат;
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", ДД.ДействующийДокумент);
	Текст = "ВЫБРАТЬ
	        |	Таб.ДопКлассификация КАК ДопКлассификация,
	        |	Таб.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	        |	Таб.КодМероприятия КАК КодМероприятия,
	        |	Таб.КодЦели КАК КодЦели,
	        |	Таб.КПС КАК КПС,
	        |	Таб.КФО КАК КФО,
	        |	Таб.КЭК КАК КЭК,
	        |	Таб.Номенклатура КАК Номенклатура,
	        |	Таб.ОбъектФАИП КАК ОбъектФАИП,
	        |	Таб.ОКП КАК ОКП,
	        |	Таб.ПериодПлана КАК ПериодПлана,
	        |	Таб.РазделЛицевогоСчета КАК РазделЛицевогоСчета,
	        |	Таб.Подразделение КАК Подразделение
	        |ИЗ Документ.РегистрацияОбязательствИСведенийПоДоговорам." + ИмяТаблицы + " КАК Таб
			|ГДЕ (Таб.Ссылка = &Ссылка)
			|УПОРЯДОЧИТЬ ПО Таб.НомерСтроки";
	Таб = ПолучитьДанные(Текст, Отбор);
	Колво = Таб.Количество();
	Если (Колво = 0) Тогда
		Возврат;
	КонецЕсли;
	// Строки табличной части.
	Таб.Колонки.Добавить("СТЧ");
	// Таблица объекта с данными.
	рТаб = Объект[ИмяТаблицы];
	// Очистка незаполненной номенклатуры в документе.
	Для Каждого Запись Из рТаб Цикл
		Если (Не ЗначениеЗаполнено(Запись.Номенклатура)) Тогда
			Запись.Номенклатура = Неопределено;
		КонецЕсли;	
	КонецЦикла;	
	// Очистка незаполненной номенклатуры в текущих значениях.
	Для Каждого Запись Из Таб Цикл
		Если (Не ЗначениеЗаполнено(Запись.Номенклатура)) Тогда
			Запись.Номенклатура = Неопределено;
		КонецЕсли;	
	КонецЦикла;	
	// Поиск строк по всем измерениям.
	Отбор = Новый Структура;
	Отбор.Вставить("ЕдиницаИзмерения");
	Отбор.Вставить("КодМероприятия");
	Отбор.Вставить("КодЦели");
	Отбор.Вставить("КПС");
	Отбор.Вставить("КФО");
	Отбор.Вставить("КЭК");
	Отбор.Вставить("Номенклатура");
	Отбор.Вставить("ОКП");
	Отбор.Вставить("ПериодПлана");
	Отбор.Вставить("РазделЛицевогоСчета");
	Отбор.Вставить("ЗапретИзменения", Ложь);
	Флаг = Ложь;
	Для Каждого Запись Из Таб Цикл
		ЗаполнитьЗначенияСвойств(Отбор, Запись);
		Строки = рТаб.НайтиСтроки(Отбор);
		Для Каждого рЗапись Из Строки Цикл
			ЗаполнитьЗначенияСвойств(рЗапись, Запись);
			рЗапись.ЗапретИзменения = Истина;
			Запись.СТЧ = рЗапись;
			Прервать;
		КонецЦикла;
		Флаг = Флаг Или (Запись.СТЧ = Неопределено);
	КонецЦикла;	
	// Поиск строк по бюджетной и дополнительной классификации с учетом возможного уточнения.
	Если Флаг Тогда
		Отбор.Удалить("ЕдиницаИзмерения");
		Отбор.Удалить("КФО");
		Отбор.Удалить("Номенклатура");
		Отбор.Удалить("ОКП");
		Отбор.Удалить("РазделЛицевогоСчета");
		Флаг = Ложь;
		Для Каждого Запись Из Таб Цикл
			Если (Запись.СТЧ <> Неопределено) Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Отбор, Запись);
			Строки = рТаб.НайтиСтроки(Отбор);
			Для Каждого рЗапись Из Строки Цикл
				Если ((Не рЗапись.ЕдиницаИзмерения.Пустая()) И (рЗапись.ЕдиницаИзмерения <> Запись.ЕдиницаИзмерения)) Тогда
					Продолжить;
				ИначеЕсли ((Не рЗапись.КФО.Пустая()) И (рЗапись.КФО <> Запись.КФО)) Тогда
					Продолжить;
				ИначеЕсли ((ТипЗнч(рЗапись.Номенклатура) = ТипЗнч(Запись.Номенклатура)) И (рЗапись.Номенклатура <> Запись.Номенклатура)) Тогда
					Продолжить;
				ИначеЕсли ((Не ПустаяСтрока(рЗапись.ОКП)) И (рЗапись.ОКП <> Запись.ОКП)) Тогда
					Продолжить;
				ИначеЕсли ((Не рЗапись.РазделЛицевогоСчета.Пустая()) И (рЗапись.РазделЛицевогоСчета <> Запись.РазделЛицевогоСчета)) Тогда
					Продолжить;
				КонецЕсли;	
				ЗаполнитьЗначенияСвойств(рЗапись, Запись);
				рЗапись.ЗапретИзменения = Истина;
				Запись.СТЧ = рЗапись;
				Прервать;
			КонецЦикла;	
			Флаг = Флаг Или (Запись.СТЧ = Неопределено);
		КонецЦикла;	
		// Поиск строк по КПС с учетом возможного уточнения.
		Если Флаг Тогда
			Отбор.Удалить("КодМероприятия");
			Отбор.Удалить("КодЦели");
			Отбор.Удалить("КЭК");
			Для Каждого Запись Из Таб Цикл
				Если (Запись.СТЧ <> Неопределено) Тогда
					Продолжить;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(Отбор, Запись);
				Строки = рТаб.НайтиСтроки(Отбор);
				Для Каждого рЗапись Из Строки Цикл
					Если ((Не рЗапись.ЕдиницаИзмерения.Пустая()) И (рЗапись.ЕдиницаИзмерения <> Запись.ЕдиницаИзмерения)) Тогда
						Продолжить;
					ИначеЕсли ((Не рЗапись.КФО.Пустая()) И (рЗапись.КФО <> Запись.КФО)) Тогда
						Продолжить;
					ИначеЕсли ((ТипЗнч(рЗапись.Номенклатура) = ТипЗнч(Запись.Номенклатура)) И (рЗапись.Номенклатура <> Запись.Номенклатура)) Тогда
						Продолжить;
					ИначеЕсли ((Не ПустаяСтрока(рЗапись.ОКП)) И (рЗапись.ОКП <> Запись.ОКП)) Тогда
						Продолжить;
					ИначеЕсли ((Не рЗапись.РазделЛицевогоСчета.Пустая()) И (рЗапись.РазделЛицевогоСчета <> Запись.РазделЛицевогоСчета)) Тогда
						Продолжить;
					ИначеЕсли ((Не рЗапись.КодМероприятия.Пустая()) И (рЗапись.КодМероприятия <> Запись.КодМероприятия)) Тогда
						Продолжить;
					ИначеЕсли ((Не рЗапись.КодЦели.Пустая()) И (рЗапись.КодЦели <> Запись.КодЦели)) Тогда
						Продолжить;
					ИначеЕсли ((Не рЗапись.КЭК.Пустая()) И (рЗапись.КЭК <> Запись.КЭК)) Тогда
						Продолжить;
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(рЗапись, Запись);
					рЗапись.ЗапретИзменения = Истина;
					Запись.СТЧ = рЗапись;
					Прервать;
				КонецЦикла;	
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;	
	// Добавление ранее существующих строк.
	Для Сч=1 По Колво Цикл
		Индекс = Колво - Сч;
		Запись = Таб[Индекс];
		Если (Запись.СТЧ = Неопределено) Тогда
			рЗапись = рТаб.Вставить(0);
			ЗаполнитьЗначенияСвойств(рЗапись, Запись);
			рЗапись.ЗапретИзменения = Истина;
		Иначе
			Индекс = рТаб.Индекс(Запись.СТЧ);
			Если (Индекс > 0) Тогда
				рТаб.Сдвинуть(Запись.СТЧ, -Индекс);
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

// Обработчик записывает данные из пакета XDTO в сведения об обязательствах.
// 
// Параметры :
//	ДанныеИБ - ДокументОбъект.РегистрацияОбязательствИСведенийПоДоговорам - объект информационной базы.
//	ПолученныеДанные - ДокументОбъект.РегистрацияОбязательствИСведенийПоДоговорам - новый объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	Пропустить - Булево - пропустить объект.
//
Процедура ПКО_Документ_РегистрацияОбязательств_Получение_ПередЗаписьюПолученныхДанных(Знач ДанныеИБ,
																					  Знач ПолученныеДанные,
																					  Знач КомпонентыОбмена,
																					  Пропустить)
	Перем Объект, Запись, Новая, Сч, Колво, Таб, Стр, Начало, Узел, УчетныйНомер;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Объект = ПолученныеДанные;
	Если Объект.ДополнительныеСвойства.Свойство("УчетныйНомер", УчетныйНомер) Тогда
		УчетныйНомер = СокрЛП(УчетныйНомер);
	Иначе	
		УчетныйНомер = "";
	КонецЕсли;
	Если (ДанныеИБ = Неопределено) Тогда
		Объект.УстановитьНовыйНомер();
		Объект.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643");
		Объект.Курс = 1;
		Объект.Кратность = 1;
	ИначеЕсли (ДанныеИБ.ИДИсточника = ИзмененУИ()) Тогда
		Узел = КомпонентыОбмена.УзелКорреспондента;
		ЗарегистрироватьОбъект(ДанныеИБ, Узел);
		Пропустить = Истина;
		Если Объект.ДополнительныеСвойства.Свойство("ИдентификаторXDTO", Стр) Тогда
			Если (Не ОбъектУчаствовалВОбмене(ДанныеИБ.Ссылка, Узел)) Тогда
				ДобавитьИдентификаторXDTO(ДанныеИБ.Ссылка, Узел, Стр);
			КонецЕсли;
		КонецЕсли;
		ДобавитьУчетныйНомер(УчетныйНомер, Объект.Договор);
		Возврат;
	ИначеЕсли ПолученныеДанные.Договор.Пустая() Тогда
		ПолученныеДанные.Договор = ДанныеИБ.Договор;
	КонецЕсли;
	// Заполнение расшифровки нужно выполнять перед записью, т.к. при конвертации объекты ее не созданы в базе данных.	
	Если (Объект.ДополнительныеСвойства.Свойство("тРасшифровкаОбязательстваБюджет", Таб) И (Таб <> Неопределено)) Тогда
		Колво = Таб.Количество() - 1;
		Для Сч=0 По Колво Цикл
			Начало = Ложь;
			Запись = Таб[Сч];
			Новая = Объект.РасшифровкаОбязательстваБюджет[Сч];
			// КФО.
			Новая.КФО = КФО(Запись.КФО);
			Если (Новая.КФО.Пустая() И (Не ПустаяСтрока(Запись.КФО))) Тогда
				Стр = СтрШаблон(НСтр("ru = 'По коду ""%1"" не найден КФО'"), Запись.КФО);
				Если НетТекстаВКомментарии(Объект, Стр) Тогда
					ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
				КонецЕсли;	
			КонецЕсли;
			// Заполнение КБК.
			Стр = НайтиКПС(Запись.КПС, Объект.Дата, Новая.КФО, КомпонентыОбмена);
			Если (ТипЗнч(Стр) <> Тип("Строка")) Тогда
				Новая.КПС = Стр;
			ИначеЕсли НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
			КонецЕсли;
			// Заполнение раздела лицевого счета.
			Новая.РазделЛицевогоСчета = НайтиРазделЛицевогоСчета(Объект.ЛицевойСчет, Новая.КФО);
			// Заполнение периода плана.
			Новая.ПериодПлана = ПериодПлана(Запись.ПериодПлана);
		КонецЦикла;
	КонецЕсли;		
	Если (Объект.ДополнительныеСвойства.Свойство("тРасшифровкаОбязательстваВнебюджет", Таб) И (Таб <> Неопределено)) Тогда
		Колво = Таб.Количество() - 1;
		Для Сч=0 По Колво Цикл
			Начало = Ложь;
			Запись = Таб[Сч];
			Новая = Объект.РасшифровкаОбязательстваВнебюджет[Сч];
			// КФО.
			Новая.КФО = КФО(Запись.КФО);
			Если (Новая.КФО.Пустая() И (Не ПустаяСтрока(Запись.КФО))) Тогда
				Стр = СтрШаблон(НСтр("ru = 'По коду ""%1"" не найден КФО'"), Запись.КФО);
				Если НетТекстаВКомментарии(Объект, Стр) Тогда
					ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
				КонецЕсли;	
			КонецЕсли;
			// Заполнение КБК.
			Стр = НайтиКПС(Запись.КПС, Объект.Дата, Новая.КФО, КомпонентыОбмена);
			Если (ТипЗнч(Стр) <> Тип("Строка")) Тогда
				Новая.КПС = Стр;
			ИначеЕсли НетТекстаВКомментарии(Объект, Стр) Тогда
				ДобавитьКомментарий(Объект, ТекстСНомеромСтроки(Сч + 1, Начало) + Стр);
			КонецЕсли;
			// Заполнение раздела лицевого счета.
			Новая.РазделЛицевогоСчета = НайтиРазделЛицевогоСчета(Объект.ЛицевойСчет, Новая.КФО);
			// Заполнение периода плана.
			Новая.ПериодПлана = ПериодПлана(Запись.ПериодПлана);
		КонецЦикла;
	КонецЕсли;
	ЗаполнитьЗапретИзменения(Объект, "РасшифровкаОбязательстваБюджет");
	ЗаполнитьЗапретИзменения(Объект, "РасшифровкаОбязательстваВнебюджет");
	Если (ДанныеИБ = Неопределено) Тогда
		ДобавитьУчетныйНомер(УчетныйНомер, Объект.Договор);
	Иначе	
		ЗаполнитьЗначенияСвойств(ДанныеИБ, Объект,, "Номер");
		ДанныеИБ.РасшифровкаОбязательстваБюджет.Очистить();
		Для Каждого Запись Из Объект.РасшифровкаОбязательстваБюджет Цикл
			ЗаполнитьЗначенияСвойств(ДанныеИБ.РасшифровкаОбязательстваБюджет.Добавить(), Запись); 
		КонецЦикла;	
		ДанныеИБ.РасшифровкаОбязательстваВнебюджет.Очистить();
		Для Каждого Запись Из Объект.РасшифровкаОбязательстваВнебюджет Цикл
			ЗаполнитьЗначенияСвойств(ДанныеИБ.РасшифровкаОбязательстваВнебюджет.Добавить(), Запись); 
		КонецЦикла;
		ДобавитьУчетныйНомер(УчетныйНомер, ДанныеИБ.Договор);
	КонецЕсли;	
	
КонецПроцедуры

// Обработчик для дополнительной обработки после загрузки данных в сведения об обязательствах.
// 
// Параметры :
//	Объект - ДокументОбъект.РегистрацияОбязательствИСведенийПоДоговорам - объект информационной базы.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	ОбъектМодифицирован - Булево - модифицированность объекта.
//
Процедура ПКО_Документ_РегистрацияОбязательств_Получение_ПослеЗагрузкиВсехДанных(Знач Объект,
																				 Знач КомпонентыОбмена,
																				 ОбъектМодифицирован)
	Перем Узел;

	ОбъектМодифицирован = Ложь;
	Узел = КомпонентыОбмена.УзелКорреспондента;
	ЗарегистрироватьОбъект(Объект, Узел);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ПКПД

// Заполняет таблицу правил конвертации предопределенных данных.
//
// Параметры:
//  НаправлениеОбмена - строка ("Отправка" либо "Получение").
//  ПравилаКонвертации - таблица значений, в которую будут добавлены правила. 
//
Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных(Знач НаправлениеОбмена, Знач ПравилаКонвертации) Экспорт

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	ФИББГУМенеджерОбменаПереопределяемый.ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации);
	
КонецПроцедуры

#КонецОбласти

#Область Параметры

// Заполняет параметры конвертации.
//
// Параметры:
//  ПараметрыКонвертации - Структура, в которую добавляются параметры конвертации.
//
Процедура ЗаполнитьПараметрыКонвертации(Знач ПараметрыКонвертации) Экспорт

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыКонвертации.Вставить("ПроверятьПолученныеПроводки", Ложь);
	ПараметрыКонвертации.Вставить("ОграниченияДлиныПлатежныхРеквизитов", Неопределено); 
	ФИББГУМенеджерОбменаПереопределяемый.ЗаполнитьПараметрыКонвертации(ПараметрыКонвертации);
	
КонецПроцедуры

#КонецОбласти

#Область ОбщегоНазначения

// Процедура-обертка, выполняет запуск указанной в параметрах процедуры модуля менеджера обмена через формат.
//
// Параметры:
//  ИмяПроцедуры - Строка.
//  СтруктураПараметров - Структура, содержащая передаваемые параметры.
//
Процедура ВыполнитьПроцедуруМодуляМенеджера(Знач ИмяПроцедуры, Знач Параметры) Экспорт
	Перем Имя, Пропустить, ОбъектМодифицирован, Ссылка;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Если СтрНачинаетсяС(ИмяПроцедуры, "ПКО_Документ_") Тогда
		Имя = Сред(ИмяПроцедуры, 14);
		Если СтрЗаканчиваетсяНа(Имя, "_Отправка_ПриОтправкеДанных") Тогда
			Имя = Лев(Имя, СтрДлина(Имя) - 27);
			Если (Имя = "БухгалтерскаяСправка") Тогда
				Пропустить = Ложь;
				ПКО_Документ_БухгалтерскаяСправка_Отправка_ПриОтправкеДанных(Параметры.ДанныеИБ,
																			 Параметры.ДанныеXDTO,
																			 Параметры.КомпонентыОбмена,
																			 Параметры.СтекВыгрузки,
																			 Пропустить);
				Если Пропустить Тогда
					Параметры.ДанныеXDTO = Неопределено;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрЗаканчиваетсяНа(Имя, "_Получение_ПриКонвертацииДанныхXDTO") Тогда
			Имя = Лев(Имя, СтрДлина(Имя) - 35);
			Если (Имя = "БухгалтерскаяСправка") Тогда
				ПКО_Документ_БухгалтерскаяСправка_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																					 Параметры.ПолученныеДанные,
																					 Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "БюджетныеДанные") Тогда
				ПКО_Документ_БюджетныеДанные_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																				Параметры.ПолученныеДанные,
																				Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "КассовоеВыбытие") Тогда
				ПКО_Документ_КассовоеВыбытие_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																				Параметры.ПолученныеДанные,
																				Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "КассовоеПоступление") Тогда
				ПКО_Документ_КассовоеПоступление_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																					Параметры.ПолученныеДанные,
																					Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "РасходноеРасписание") Тогда
				ПКО_Документ_РасходноеРасписание_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																					Параметры.ПолученныеДанные,
																					Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "РегистрацияОбязательств") Тогда
				ПКО_Документ_РегистрацияОбязательств_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																						Параметры.ПолученныеДанные,
																						Параметры.КомпонентыОбмена);
			КонецЕсли;																		 
		ИначеЕсли СтрЗаканчиваетсяНа(Имя, "_Получение_ПередЗаписьюПолученныхДанных") Тогда
			Имя = Лев(Имя, СтрДлина(Имя) - 39);
			Если (Имя = "БухгалтерскаяСправка") Тогда
				Пропустить = Ложь;
				ПКО_Документ_БухгалтерскаяСправка_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																						 Параметры.ПолученныеДанные,
																						 Параметры.КомпонентыОбмена,
																						 Пропустить);
				Если Пропустить Тогда
					Параметры.ДанныеИБ = Неопределено;
					Параметры.ПолученныеДанные = Неопределено;
				КонецЕсли;
			ИначеЕсли (Имя = "БюджетныеДанные") Тогда
				Пропустить = Ложь;																
				ПКО_Документ_БюджетныеДанные_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																					Параметры.ПолученныеДанные,
																					Параметры.КомпонентыОбмена,
																					Пропустить);
				Если Пропустить Тогда
					Параметры.ДанныеИБ = Неопределено;
					Параметры.ПолученныеДанные = Неопределено;
				КонецЕсли;
			ИначеЕсли (Имя = "КассовоеВыбытие") Тогда
				Пропустить = Ложь;																
				ПКО_Документ_КассовоеВыбытие_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																					Параметры.ПолученныеДанные,
																					Параметры.КомпонентыОбмена,
																					Пропустить);
				Если Пропустить Тогда
					Параметры.ДанныеИБ = Неопределено;
					Параметры.ПолученныеДанные = Неопределено;
				КонецЕсли;
			ИначеЕсли (Имя = "КассовоеПоступление") Тогда
				Пропустить = Ложь;																
				ПКО_Документ_КассовоеПоступление_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																						Параметры.ПолученныеДанные,
																						Параметры.КомпонентыОбмена,
																						Пропустить);
				Если Пропустить Тогда
					Параметры.ДанныеИБ = Неопределено;
					Параметры.ПолученныеДанные = Неопределено;
				КонецЕсли;
			ИначеЕсли (Имя = "РасходноеРасписание") Тогда
				Пропустить = Ложь;																
				ПКО_Документ_РасходноеРасписание_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																						Параметры.ПолученныеДанные,
																						Параметры.КомпонентыОбмена,
																						Пропустить);
				Если Пропустить Тогда
					Параметры.ДанныеИБ = Неопределено;
					Параметры.ПолученныеДанные = Неопределено;
				КонецЕсли;
			ИначеЕсли (Имя = "РегистрацияОбязательств") Тогда
				Пропустить = Ложь;																
				ПКО_Документ_РегистрацияОбязательств_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																							Параметры.ПолученныеДанные,
																							Параметры.КомпонентыОбмена,
																							Пропустить);
				Если Пропустить Тогда
					Параметры.ДанныеИБ = Неопределено;
					Параметры.ПолученныеДанные = Неопределено;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрЗаканчиваетсяНа(Имя, "_Получение_ПослеЗагрузкиВсехДанных") Тогда
			Имя = Лев(Имя, СтрДлина(Имя) - 34);
			Если (Имя = "БухгалтерскаяСправка") Тогда
				ОбъектМодифицирован = Параметры.ОбъектМодифицирован;
				ПКО_Документ_БухгалтерскаяСправка_Получение_ПослеЗагрузкиВсехДанных(Параметры.Объект,
																					Параметры.КомпонентыОбмена,
																					ОбъектМодифицирован);
				Параметры.ОбъектМодифицирован = ОбъектМодифицирован;
			ИначеЕсли (Имя = "БюджетныеДанные") Тогда
				ОбъектМодифицирован = Параметры.ОбъектМодифицирован;
				ПКО_Документ_БюджетныеДанные_Получение_ПослеЗагрузкиВсехДанных(Параметры.Объект,
																			   Параметры.КомпонентыОбмена,
																			   ОбъектМодифицирован);
				Параметры.ОбъектМодифицирован = ОбъектМодифицирован;
			ИначеЕсли (Имя = "КассовоеВыбытие") Тогда
				ОбъектМодифицирован = Параметры.ОбъектМодифицирован;
				ПКО_Документ_КассовоеВыбытие_Получение_ПослеЗагрузкиВсехДанных(Параметры.Объект,
																			   Параметры.КомпонентыОбмена,
																			   ОбъектМодифицирован);
				Параметры.ОбъектМодифицирован = ОбъектМодифицирован;
			ИначеЕсли (Имя = "КассовоеПоступление") Тогда
				ОбъектМодифицирован = Параметры.ОбъектМодифицирован;
				ПКО_Документ_КассовоеПоступление_Получение_ПослеЗагрузкиВсехДанных(Параметры.Объект,
																				   Параметры.КомпонентыОбмена,
																				   ОбъектМодифицирован);
				Параметры.ОбъектМодифицирован = ОбъектМодифицирован;
			ИначеЕсли (Имя = "РасходноеРасписание") Тогда
				ОбъектМодифицирован = Параметры.ОбъектМодифицирован;
				ПКО_Документ_РасходноеРасписание_Получение_ПослеЗагрузкиВсехДанных(Параметры.Объект,
																				   Параметры.КомпонентыОбмена,
																				   ОбъектМодифицирован);
				Параметры.ОбъектМодифицирован = ОбъектМодифицирован;
			ИначеЕсли (Имя = "РегистрацияОбязательств") Тогда
				ОбъектМодифицирован = Параметры.ОбъектМодифицирован;
				ПКО_Документ_РегистрацияОбязательств_Получение_ПослеЗагрузкиВсехДанных(Параметры.Объект,
																					   Параметры.КомпонентыОбмена,
																					   ОбъектМодифицирован);
				Параметры.ОбъектМодифицирован = ОбъектМодифицирован;
			КонецЕсли;
		ИначеЕсли СтрЗаканчиваетсяНа(Имя, "_Получение_АлгоритмПоиска") Тогда																 
			Имя = Лев(Имя, СтрДлина(Имя) - 25);
			Ссылка = Параметры.ДанныеИБ;
			Если (Имя = "БухгалтерскаяСправка") Тогда
				ПКО_Документ_БухгалтерскаяСправка_Получение_АлгоритмПоиска(Ссылка,
																		   Параметры.ПолученныеДанные,
																		   Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "БюджетныеДанные") Тогда
				ПКО_Документ_БюджетныеДанные_Получение_АлгоритмПоиска(Ссылка,
																	  Параметры.ПолученныеДанные,
																	  Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "КассовоеВыбытие") Тогда
				ПКО_Документ_КассовоеВыбытие_Получение_АлгоритмПоиска(Ссылка,
																	  Параметры.ПолученныеДанные,
																	  Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "КассовоеПоступление") Тогда
				ПКО_Документ_КассовоеПоступление_Получение_АлгоритмПоиска(Ссылка,
																		  Параметры.ПолученныеДанные,
																		  Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "РасходноеРасписание") Тогда
				ПКО_Документ_РасходноеРасписание_Получение_АлгоритмПоиска(Ссылка,
																		  Параметры.ПолученныеДанные,
																		  Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "РегистрацияОбязательств") Тогда
				ПКО_Документ_РегистрацияОбязательств_Получение_АлгоритмПоиска(Ссылка,
																			  Параметры.ПолученныеДанные,
																			  Параметры.КомпонентыОбмена);
			КонецЕсли;
			Параметры.ДанныеИБ = Ссылка;													  
		КонецЕсли;
	ИначеЕсли СтрНачинаетсяС(ИмяПроцедуры, "ПКО_Справочник_") Тогда
		Имя = Сред(ИмяПроцедуры, 16);
		Если СтрЗаканчиваетсяНа(Имя, "_Получение_ПриКонвертацииДанныхXDTO") Тогда
			Имя = Лев(Имя, СтрДлина(Имя) - 35);
			Если (Имя = "Валюта") Тогда
				ПКО_Справочник_Валюта_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																		 Параметры.ПолученныеДанные,
																		 Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ВидДоходовКДБ") Тогда
				ПКО_Справочник_ВидДоходовКДБ_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																				Параметры.ПолученныеДанные,
																				Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ВидКИФ") Тогда
				ПКО_Справочник_ВидКИФ_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																		 Параметры.ПолученныеДанные,
																		 Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ВидРасходовКРБ") Тогда
				ПКО_Справочник_ВидРасходовКРБ_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																				 Параметры.ПолученныеДанные,
																				 Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ГлаваПоБюджетнойКлассификации") Тогда
				ПКО_Справочник_ГлаваПоБюджетнойКлассификации_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																								Параметры.ПолученныеДанные,
																								Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ГруппаПодвидаКДБ") Тогда
				ПКО_Справочник_ГруппаПодвидаКДБ_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																				   Параметры.ПолученныеДанные,
																				   Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "Договор") Тогда
				ПКО_Справочник_Договор_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																		  Параметры.ПолученныеДанные,
																		  Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "Контрагент") Тогда
				ПКО_Справочник_Контрагент_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																			 Параметры.ПолученныеДанные,
																			 Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ПрограммаЦелевойСтатьиКРБ") Тогда
				ПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																							Параметры.ПолученныеДанные,
																							Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "СтатьяКИФ") Тогда
				ПКО_Справочник_СтатьяКИФ_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																			Параметры.ПолученныеДанные,
																			Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "Номенклатура") Тогда
				ПКО_Справочник_Номенклатура_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																			   Параметры.ПолученныеДанные,
																			   Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ЦелеваяСтатьяКРБ") Тогда
				ПКО_Справочник_ЦелеваяСтатьяКРБ_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																				   Параметры.ПолученныеДанные,
																				   Параметры.КомпонентыОбмена);
			КонецЕсли;
		ИначеЕсли СтрЗаканчиваетсяНа(Имя, "_Получение_ПередЗаписьюПолученныхДанных") Тогда																 
			Имя = Лев(Имя, СтрДлина(Имя) - 39);
			Если (Имя = "Валюта") Тогда
				ПКО_Справочник_Валюта_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																			 Параметры.ПолученныеДанные,
																			 Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ВидКИФ") Тогда
				ПКО_Справочник_ВидКИФ_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																			 Параметры.ПолученныеДанные,
																			 Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ВидРасходовКРБ") Тогда
				ПКО_Справочник_ВидРасходовКРБ_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																					 Параметры.ПолученныеДанные,
																					 Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ГлаваПоБюджетнойКлассификации") Тогда
				ПКО_Справочник_ГлаваПоБюджетнойКлассификации_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																									Параметры.ПолученныеДанные,
																									Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ГруппаПодвидаКДБ") Тогда
				ПКО_Справочник_ГруппаПодвидаКДБ_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																					   Параметры.ПолученныеДанные,
																					   Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ГруппаПодгруппаКИФ") Тогда
				ПКО_Справочник_ГруппаПодгруппаКИФ_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																						 Параметры.ПолученныеДанные,
																						 Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "Договор") Тогда
				ПКО_Справочник_Договор_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																			  Параметры.ПолученныеДанные,
																			  Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ИФО") Тогда
				ПКО_Справочник_ИФО_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																		  Параметры.ПолученныеДанные,
																		  Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "Казначейство") Тогда
				ПКО_Справочник_Казначейство_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																				   Параметры.ПолученныеДанные,
																				   Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "Контрагент") Тогда
				ПКО_Справочник_Контрагент_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																				 Параметры.ПолученныеДанные,
																				 Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ЛицевойСчет") Тогда
				ПКО_Справочник_ЛицевойСчет_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																				  Параметры.ПолученныеДанные,
																				  Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "Номенклатура") Тогда
				ПКО_Справочник_Номенклатура_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																				   Параметры.ПолученныеДанные,
																				   Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ПрограммаЦелевойСтатьиКРБ") Тогда
				ПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																								Параметры.ПолученныеДанные,
																								Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "РазделПодразделКРБ") Тогда
				ПКО_Справочник_РазделПодразделКРБ_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																						 Параметры.ПолученныеДанные,
																						 Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "СтатьяКИФ") Тогда
				ПКО_Справочник_СтатьяКИФ_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																				Параметры.ПолученныеДанные,
																				Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ЦелеваяСтатьяКРБ") Тогда
				ПКО_Справочник_ЦелеваяСтатьяКРБ_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																					   Параметры.ПолученныеДанные,
																					   Параметры.КомпонентыОбмена);
			КонецЕсли;
		ИначеЕсли СтрЗаканчиваетсяНа(Имя, "_Отправка_ПриОтправкеДанных") Тогда																 
			Имя = Лев(Имя, СтрДлина(Имя) - 27);
			Пропустить = Ложь;
			Если (Имя = "Договор") Тогда
				ПКО_Справочник_Договор_Отправка_ПриОтправкеДанных(Параметры.ДанныеИБ,
																  Параметры.ДанныеXDTO,
																  Параметры.КомпонентыОбмена,
																  Параметры.СтекВыгрузки,
																  Пропустить);
			ИначеЕсли (Имя = "Казначейство") Тогда
				ПКО_Справочник_Казначейство_Отправка_ПриОтправкеДанных(Параметры.ДанныеИБ,
																	   Параметры.ДанныеXDTO,
																	   Параметры.КомпонентыОбмена,
																	   Параметры.СтекВыгрузки,
																	   Пропустить);
			ИначеЕсли (Имя = "Контрагент") Тогда
				ПКО_Справочник_Контрагент_Отправка_ПриОтправкеДанных(Параметры.ДанныеИБ,
																	 Параметры.ДанныеXDTO,
																	 Параметры.КомпонентыОбмена,
																	 Параметры.СтекВыгрузки,
																	 Пропустить);
			ИначеЕсли (Имя = "ЛицевойСчет") Тогда
				ПКО_Справочник_ЛицевойСчет_Отправка_ПриОтправкеДанных(Параметры.ДанныеИБ,
																	  Параметры.ДанныеXDTO,
																	  Параметры.КомпонентыОбмена,
																	  Параметры.СтекВыгрузки,
																	  Пропустить);
			ИначеЕсли (Имя = "Организация") Тогда
				ПКО_Справочник_Организация_Отправка_ПриОтправкеДанных(Параметры.ДанныеИБ,
																	  Параметры.ДанныеXDTO,
																	  Параметры.КомпонентыОбмена,
																	  Параметры.СтекВыгрузки,
																	  Пропустить);
			КонецЕсли;
			Если Пропустить Тогда
				Параметры.ДанныеXDTO = Неопределено;
			КонецЕсли;
		ИначеЕсли СтрЗаканчиваетсяНа(Имя, "_Получение_АлгоритмПоиска") Тогда																 
			Имя = Лев(Имя, СтрДлина(Имя) - 25);
			Ссылка = Параметры.ДанныеИБ;
			Если (Имя = "ВидДоходовКДБ") Тогда
				ПКО_Справочник_ВидДоходовКДБ_Получение_АлгоритмПоиска(Ссылка,
																	  Параметры.ПолученныеДанные,
																	  Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ВидКИФ") Тогда
				ПКО_Справочник_ВидКИФ_Получение_АлгоритмПоиска(Ссылка,
															   Параметры.ПолученныеДанные,
															   Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ВидРасходовКРБ") Тогда
				ПКО_Справочник_ВидРасходовКРБ_Получение_АлгоритмПоиска(Ссылка,
																	   Параметры.ПолученныеДанные,
																	   Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ГлаваПоБюджетнойКлассификации") Тогда
				ПКО_Справочник_ГлаваПоБюджетнойКлассификации_Получение_АлгоритмПоиска(Ссылка,
																					  Параметры.ПолученныеДанные,
																					  Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ГруппаПодвидаКДБ") Тогда
				ПКО_Справочник_ГруппаПодвидаКДБ_Получение_АлгоритмПоиска(Ссылка,
																		 Параметры.ПолученныеДанные,
																		 Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ПрограммаЦелевойСтатьиКРБ") Тогда
				ПКО_Справочник_ПрограммаЦелевойСтатьиКРБ_Получение_АлгоритмПоиска(Ссылка,
																				  Параметры.ПолученныеДанные,
																				  Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "СтатьяКИФ") Тогда
				ПКО_Справочник_СтатьяКИФ_Получение_АлгоритмПоиска(Ссылка,
																  Параметры.ПолученныеДанные,
																  Параметры.КомпонентыОбмена);
			ИначеЕсли (Имя = "ЦелеваяСтатьяКРБ") Тогда
				ПКО_Справочник_ЦелеваяСтатьяКРБ_Получение_АлгоритмПоиска(Ссылка,
																		 Параметры.ПолученныеДанные,
																		 Параметры.КомпонентыОбмена);
			КонецЕсли;
			Параметры.ДанныеИБ = Ссылка;													  
		КонецЕсли;
	ИначеЕсли СтрНачинаетсяС(ИмяПроцедуры, "ПКО_ПланСчетов_") Тогда
		Имя = Сред(ИмяПроцедуры, 16);
		Если (Имя = "ЕПСБУ_Отправка_ПриОтправкеДанных") Тогда
			Пропустить = Ложь;
			ПКО_ПланСчетов_ЕПСБУ_Отправка_ПриОтправкеДанных(Параметры.ДанныеИБ,
															Параметры.ДанныеXDTO,
															Параметры.КомпонентыОбмена,
															Параметры.СтекВыгрузки,
															Пропустить);
			Если Пропустить Тогда
				Параметры.ДанныеXDTO = Неопределено;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли СтрНачинаетсяС(ИмяПроцедуры, "ПКО_РегистрСведений_") Тогда
		Имя = Сред(ИмяПроцедуры, 21);
		Если СтрЗаканчиваетсяНа(Имя, "_Отправка_ПриОтправкеДанных") Тогда
			Имя = Лев(Имя, СтрДлина(Имя) - 27);
			Если (Имя = "БГУАдресаХостов") Тогда
				Пропустить = Ложь;
				ПКО_РегистрСведений_БГУАдресаХостов_Отправка_ПриОтправкеДанных(Параметры.ДанныеИБ,
														 					   Параметры.ДанныеXDTO,
																			   Параметры.КомпонентыОбмена,
																			   Параметры.СтекВыгрузки,
																			   Пропустить);
				Если Пропустить Тогда
					Параметры.ДанныеXDTO = Неопределено;
				КонецЕсли;
			ИначеЕсли (Имя = "БГУИнформацияОбОбъектах") Тогда
				Пропустить = Ложь;
				ПКО_РегистрСведений_БГУИнформацияОбОбъектах_Отправка_ПриОтправкеДанных(Параметры.ДанныеИБ,
																					   Параметры.ДанныеXDTO,
																					   Параметры.КомпонентыОбмена,
																					   Параметры.СтекВыгрузки,
																					   Пропустить);
				Если Пропустить Тогда
					Параметры.ДанныеXDTO = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли СтрНачинаетсяС(ИмяПроцедуры, "ПКО_ПланОбмена_") Тогда
		Имя = Сред(ИмяПроцедуры, 16);
		Если (Имя = "ФИБОбменБГУ_Получение_ПриКонвертацииДанныхXDTO") Тогда
			ПКО_ПланОбмена_ФИБОбменБГУ_Получение_ПриКонвертацииДанныхXDTO(Параметры.ДанныеXDTO,
																		  Параметры.ПолученныеДанные,
																		  Параметры.КомпонентыОбмена);
		ИначеЕсли (Имя = "ФИБОбменБГУ_Получение_ПередЗаписьюПолученныхДанных") Тогда
			Пропустить = Ложь;
			ПКО_ПланОбмена_ФИБОбменБГУ_Получение_ПередЗаписьюПолученныхДанных(Параметры.ДанныеИБ,
																			  Параметры.ПолученныеДанные,
																			  Параметры.КомпонентыОбмена,
																			  Пропустить);
			Если Пропустить Тогда
				Параметры.ДанныеИБ = Неопределено;
				Параметры.ПолученныеДанные = Неопределено;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли (ИмяПроцедуры = "ПКО_ВнешнийОбъект_ПриОтправкеДанных") Тогда
		Пропустить = Ложь;
		ПКО_ВнешнийОбъект_ПриОтправкеДанных(Параметры.ДанныеИБ,
											Параметры.ДанныеXDTO,
											Параметры.КомпонентыОбмена,
											Параметры.СтекВыгрузки,
											Пропустить);
		Если Пропустить Тогда
			Параметры.ДанныеXDTO = Неопределено;
		КонецЕсли;
	КонецЕсли;
	ФИББГУМенеджерОбменаПереопределяемый.ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры);

КонецПроцедуры

#КонецОбласти
