#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает Истину - признак, что отчет можно сохранить как регистр учета.
// 
// Возвращаемое значение:
//  Булево - Это регистр учета
Функция ЭтоРегистрУчета() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Заполняет свойства регистра учета для сохранения.
// 
// Параметры:
//  ОтчетОбъект - ФормаКлиентскогоПриложения:
//   * КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных
//  СвойстваРегистраУчета - Структура
Процедура СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета) Экспорт
	
	СвойстваРегистраУчета.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	СвойстваРегистраУчета.Вставить("НачалоПериода", '00010101');
	СвойстваРегистраУчета.Вставить("КонецПериода", '00010101');
	СвойстваРегистраУчета.Вставить("ДополнениеИмени", "");
	СвойстваРегистраУчета.Вставить("Подразделение", Справочники.Подразделения.ПустаяСсылка());
	СвойстваРегистраУчета.Вставить("ВключатьОбособленныеПодразделения", Ложь);

	НастройкиОтчета = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрПериод = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ПараметрПериод <> Неопределено Тогда
		Период = ПараметрПериод.Значение; // СтандартныйПериод
		СвойстваРегистраУчета.НачалоПериода = Период.ДатаНачала;
		СвойстваРегистраУчета.КонецПериода = Период.ДатаОкончания;
	КонецЕсли;
	
	ПараметрОрганизация = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	Если ПараметрОрганизация <> Неопределено Тогда
		СвойстваРегистраУчета.Организация = ПараметрОрганизация.Значение;
	КонецЕсли;
	
	ПараметрПодразделение = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Подразделение"));
	Если ПараметрПодразделение <> Неопределено
			И ПараметрПодразделение.Использование Тогда
		СвойстваРегистраУчета.Подразделение = ПараметрПодразделение.Значение;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СвойстваРегистраУчета.НачалоПериода)
			Или Не ЗначениеЗаполнено(СвойстваРегистраУчета.КонецПериода)
			Или Не ЗначениеЗаполнено(СвойстваРегистраУчета.Организация) Тогда
		СвойстваРегистраУчета.Вставить("НетДанных", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Настройки размещения в панели отчетов.
//
// Параметры:
//  Настройки    - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//  НастройкиОтчета - СтрокаДереваЗначений
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КнигаУчетаБСО_0504045");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет группируется по ЦМО. Разные ЦМО с одинаковым Сотрудником выводятся разными листами.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КнигаУчетаБСО_0504045_ПоСотрудникам");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет группируется по Сотруднику. Разные ЦМО с одинаковым Сотрудником выводятся в один лист.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КнигаУчетаБСО_0504045_БезЦМО");
	НастройкиВарианта.Описание = НСтр("ru = 'Без учета ЦМО и сотрудников. Все ЦМО выводятся в один лист.'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли