#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьНастройкиПоДоходам(Очищать = Истина) Экспорт
	
	Регистр = РегистрыСведений.СоответствиеКПСКОСГУ.СоздатьНаборЗаписей();
	Регистр.Отбор.ТипДанных.Установить(ПредопределенноеЗначение("Перечисление.ВидыКБК.КДБ"));
	Регистр.Прочитать();
	
	ТабИсходная = Регистр.ВыгрузитьКолонки();
	Макет = ПолучитьМакет("Доходы");
	ОбластьКодДохода	= Макет.ПолучитьОбласть("КодДохода");
	ОбластьКОСГУ		= Макет.ПолучитьОбласть("КОСГУ");
	н = 0;
	Пока (Истина) Цикл
		н = н + 1;
		ТекКод = СокрЛП(ОбластьКодДохода.Область(н, 1).Текст);
		Если НЕ ЗначениеЗаполнено(ТекКод) Тогда
			Прервать;
		КонецЕсли;
		ТекКОСГУ = СокрЛП(ОбластьКОСГУ.Область(н, 1).Текст);
		Если НЕ ЗначениеЗаполнено(ТекКОСГУ) ИЛИ ТекКОСГУ = "000" Тогда
			Продолжить;
		КонецЕсли;
		ТекКод = СтрЗаменить(ТекКод, " ", "");
		Если НЕ СтрДлина(ТекКод) = 17 Тогда
			Продолжить;
		КонецЕсли;	
		МассивКОСГУ = СтрРазделить(СтрЗаменить(ТекКОСГУ, " ", ""), ",", Ложь);
		Для Каждого ЗнКОСГУ Из МассивКОСГУ Цикл
			Стр = ТабИсходная.Добавить();
			Стр.ТипДанных = ПредопределенноеЗначение("Перечисление.ВидыКБК.КДБ");
			Стр.ВидДохода = Лев(ТекКод, 10);
			Стр.АналитическийКодДохода = Прав(ТекКод, 3);
			Стр.КОСГУ = ЗнКОСГУ;
		КонецЦикла;
	КонецЦикла;
	ТабИсходная.Свернуть("ТипДанных,ВидДохода,АналитическийКодДохода,КОСГУ"); 
	
	Если Очищать Тогда
		Регистр.Очистить();
	КонецЕсли;	
	ТаблицаСоответствия = Регистр.Выгрузить();
	
	Для Каждого Стр Из ТабИсходная Цикл
		
		Строки = ТаблицаСоответствия.НайтиСтроки(Новый Структура("ТипДанных,ВидДохода,АналитическийКодДохода,КОСГУ", 
		Стр.ТипДанных, Стр.ВидДохода, Стр.АналитическийКодДохода, Стр.КОСГУ));
		Если Строки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаСоответствия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	Регистр.Загрузить(ТаблицаСоответствия);
	Регистр.Записать();
	
КонецПроцедуры	

Процедура ЗагрузитьНастройкиПоРасходам(Очищать = Истина) Экспорт
	
	Регистр = РегистрыСведений.СоответствиеКПСКОСГУ.СоздатьНаборЗаписей();
	Регистр.Отбор.ТипДанных.Установить(ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ"));
	Регистр.Прочитать();
	
	ТабИсходная = Регистр.ВыгрузитьКолонки();
	Макет = Обработки.АудитСостоянияСистемыБГУ.ПолучитьМакет("СоответствиеВидовРасходовКРБиКОСГУ");
	н = 1;
	Пока (Истина) Цикл
		н = н + 1;
		ТекКод = СокрЛП(Макет.Область("R" + Строка(н) + "C1:R" + Строка(н) + "C1").Текст);
		Если НЕ ЗначениеЗаполнено(ТекКод) Тогда
			Прервать;
		КонецЕсли;
		ТекКОСГУ = СокрЛП(Макет.Область("R" + Строка(н) + "C2:R" + Строка(н) + "C2").Текст);
		Если НЕ ЗначениеЗаполнено(ТекКОСГУ) ИЛИ ТекКОСГУ = "000" Тогда
			Продолжить;
		КонецЕсли;
		ТекКод = СтрЗаменить(ТекКод, " ", "");
		Если НЕ СтрДлина(ТекКод) = 3 Тогда
			Продолжить;
		КонецЕсли;	
		МассивКОСГУ = СтрРазделить(СтрЗаменить(ТекКОСГУ, " ", ""), ",", Ложь);
		Для Каждого ЗнКОСГУ Из МассивКОСГУ Цикл
			Стр = ТабИсходная.Добавить();
			Стр.ТипДанных = ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ");
			Стр.ВидРасхода = ТекКод;
			Стр.КОСГУ = ЗнКОСГУ;
		КонецЦикла;
	КонецЦикла;
	ТабИсходная.Свернуть("ТипДанных,ВидРасхода,КОСГУ"); 
	
	Если Очищать Тогда
		Регистр.Очистить();
	КонецЕсли;	
	ТаблицаСоответствия = Регистр.Выгрузить();
	
	Для Каждого Стр Из ТабИсходная Цикл
		
		Строки = ТаблицаСоответствия.НайтиСтроки(Новый Структура("ТипДанных,ВидРасхода,КОСГУ", 
		Стр.ТипДанных, Стр.ВидРасхода, Стр.КОСГУ));
		Если Строки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаСоответствия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	Регистр.Загрузить(ТаблицаСоответствия);
	Регистр.Записать();
	
КонецПроцедуры	


#КонецОбласти
 
#КонецЕсли