
&НаКлиенте
Перем СвязиКПередаче;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторОбъекта = Параметры.ИдентификаторОбъекта;
	Если НЕ ЗначениеЗаполнено(ИдентификаторОбъекта) Тогда
		ОписаниеОшибки = НСтр("ru = 'Не указан тип объекта, для которого указываются связи параметров выбора'");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ДополнительныйРеквизитОперации) Тогда
		ДоступныеТипыРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ДополнительныйРеквизитОперации,
																			"ТипЗначения");
	Иначе
		ДоступныеТипыРеквизита = Параметры.ДоступныеТипыРеквизита;
	КонецЕсли;
	
	СсылочныеТипы = Новый Массив;
	Если ДоступныеТипыРеквизита.Типы().Количество() = 0 Тогда
		ОписаниеОшибки = НСтр("ru = 'Не известный тип реквизита'");
		Возврат;
	Иначе
		Для каждого ТекущийТип Из ДоступныеТипыРеквизита.Типы() Цикл
		
			Если ОбщегоНазначения.ЭтоСсылка(ТекущийТип) Тогда
				СсылочныеТипы.Добавить(ТекущийТип);
			КонецЕсли;
		
		КонецЦикла; 
	КонецЕсли;
	
	Если СсылочныеТипы.Количество() = 0 Тогда
		ОписаниеОшибки = НСтр("ru = 'Нельзя задавать связи параметров выбора для примитивных типов:
									|строка, число, дата, булево.'");
		Возврат;
	КонецЕсли;
	
	ТаблицаРеквизитовОбъекта = Новый ТаблицаЗначений;
	ТаблицаРеквизитовОбъекта.Колонки.Добавить("ИмяРеквизита", 			Новый ОписаниеТипов("Строка"));
	ТаблицаРеквизитовОбъекта.Колонки.Добавить("ТипЗначенияРеквизита", 	Новый ОписаниеТипов("ОписаниеТипов"));
	
	Для каждого ТекущийТип Из СсылочныеТипы Цикл
	
		МетаданныеТипа = Метаданные.НайтиПоТипу(ТекущийТип);
		Для каждого ТекущийРеквизит Из МетаданныеТипа.СтандартныеРеквизиты Цикл
			
			ИмяТекущегоРеквизита = "Отбор." + ТекущийРеквизит.Имя;
			ТекущийРеквизитВТаблице = ТаблицаРеквизитовОбъекта.Найти(ИмяТекущегоРеквизита, "ИмяРеквизита");
			Если ТекущийРеквизитВТаблице = Неопределено Тогда
				
				ТекущийРеквизитВТаблице = ТаблицаРеквизитовОбъекта.Добавить();
				ТекущийРеквизитВТаблице.ИмяРеквизита = ИмяТекущегоРеквизита;
				
			КонецЕсли;
			
			ТипыТекущегоРеквизита = ТекущийРеквизитВТаблице.ТипЗначенияРеквизита.Типы();
			ТипыРеквизитаМетаданных = ТекущийРеквизит.Тип.Типы();
			ИзменилсяТип = Ложь;
			Для Каждого ТекущийТипРеквизитаМетаданных Из ТипыРеквизитаМетаданных Цикл
				Если ТипыТекущегоРеквизита.Найти(ТекущийТипРеквизитаМетаданных) = Неопределено Тогда
					ТипыТекущегоРеквизита.Добавить(ТекущийТипРеквизитаМетаданных);
					ИзменилсяТип = Истина;
				КонецЕсли;
			КонецЦикла;
			Если ИзменилсяТип Тогда
				ТекущийРеквизитВТаблице.ТипЗначенияРеквизита = Новый ОписаниеТипов(ТипыТекущегоРеквизита);
			КонецЕсли;
		
		КонецЦикла; 
		
		Если НЕ Перечисления.ТипВсеСсылки().СодержитТип(ТекущийТип) Тогда
			Для Каждого ТекущийРеквизит Из МетаданныеТипа.Реквизиты Цикл
				
				ИмяТекущегоРеквизита = "Отбор." + ТекущийРеквизит.Имя;
				ТекущийРеквизитВТаблице = ТаблицаРеквизитовОбъекта.Найти(ИмяТекущегоРеквизита, "ИмяРеквизита");
				Если ТекущийРеквизитВТаблице = Неопределено Тогда
					
					ТекущийРеквизитВТаблице = ТаблицаРеквизитовОбъекта.Добавить();
					ТекущийРеквизитВТаблице.ИмяРеквизита = ИмяТекущегоРеквизита;
					
				КонецЕсли;
				
				ТипыТекущегоРеквизита = ТекущийРеквизитВТаблице.ТипЗначенияРеквизита.Типы();
				ТипыРеквизитаМетаданных = ТекущийРеквизит.Тип.Типы();
				ИзменилсяТип = Ложь;
				Для Каждого ТекущийТипРеквизитаМетаданных Из ТипыРеквизитаМетаданных Цикл
					Если ТипыТекущегоРеквизита.Найти(ТекущийТипРеквизитаМетаданных) = Неопределено Тогда
						ТипыТекущегоРеквизита.Добавить(ТекущийТипРеквизитаМетаданных);
						ИзменилсяТип = Истина;
					КонецЕсли;
				КонецЦикла;
				Если ИзменилсяТип Тогда
					ТекущийРеквизитВТаблице.ТипЗначенияРеквизита = Новый ОписаниеТипов(ТипыТекущегоРеквизита);
				КонецЕсли;
			
			КонецЦикла; 
		КонецЕсли;
	
	КонецЦикла;
	
	ТаблицаРеквизитовОбъекта.Сортировать("ИмяРеквизита");
	Элементы.СвязиПараметровВыбораИмя.СписокВыбора.ЗагрузитьЗначения(
													ТаблицаРеквизитовОбъекта.ВыгрузитьКолонку("ИмяРеквизита"));
	ТипыРеквизитовОбъекта = Новый ФиксированныйМассив(
													ТаблицаРеквизитовОбъекта.ВыгрузитьКолонку("ТипЗначенияРеквизита"));
	
	МетаданныеОбъекта = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторОбъекта);
	
	ВрТипыРеквизитовОбъекта = Новый Соответствие;
	Для Каждого РеквизитОбъекта Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		
		ИмяРеквизита 			= "Объект." + РеквизитОбъекта.Имя;
		ПредставлениеРеквизита	= ПользовательскоеПредставлениеРеквизита(РеквизитОбъекта);
		ДоступныеРеквизиты.Добавить(ИмяРеквизита, ПредставлениеРеквизита);
		ВрТипыРеквизитовОбъекта.Вставить(ИмяРеквизита, РеквизитОбъекта.Тип);
	
	КонецЦикла; 
	
	Для Каждого РеквизитОбъекта Из МетаданныеОбъекта.Реквизиты Цикл
	
		ИмяРеквизита 			= "Объект." + РеквизитОбъекта.Имя;
		ПредставлениеРеквизита	= ПользовательскоеПредставлениеРеквизита(РеквизитОбъекта);
		ДоступныеРеквизиты.Добавить(ИмяРеквизита, ПредставлениеРеквизита);
		ВрТипыРеквизитовОбъекта.Вставить(ИмяРеквизита, РеквизитОбъекта.Тип);
	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Параметры.ИмяТабличнойЧасти) Тогда
		ИмяТабличнойЧасти = Параметры.ИмяТабличнойЧасти;
		ТабличнаяЧасть = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
		Если ТабличнаяЧасть <> Неопределено Тогда
			СинонимТЧ = ТабличнаяЧасть.Синоним;
			
			Для каждого РеквизитОбъекта Из ТабличнаяЧасть.Реквизиты Цикл
			
				ИмяРеквизита 			= ИмяТабличнойЧасти + "." + РеквизитОбъекта.Имя;
				ПредставлениеРеквизита	= ПользовательскоеПредставлениеРеквизита(РеквизитОбъекта, 
																				ИмяТабличнойЧасти,
																				СинонимТЧ);
				ДоступныеРеквизиты.Добавить(ИмяРеквизита, ПредставлениеРеквизита);
				ВрТипыРеквизитовОбъекта.Вставить(ИмяРеквизита, РеквизитОбъекта.Тип);
			
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ТабличнаяЧасть) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КолонкиДополнительныхТабличныхЧастей.Владелец.Наименование КАК ЗаголовокТабличнойЧасти,
		               |	КолонкиДополнительныхТабличныхЧастей.Владелец.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
		               |	КолонкиДополнительныхТабличныхЧастей.Наименование КАК ЗаголовокРеквизита,
		               |	КолонкиДополнительныхТабличныхЧастей.ИмяКолонки КАК ИмяРеквизита,
		               |	КолонкиДополнительныхТабличныхЧастей.ОписаниеТипаКолонки.ТипЗначения Как ТипЗначения
		               |ИЗ
		               |	Справочник.КолонкиДополнительныхТабличныхЧастей КАК КолонкиДополнительныхТабличныхЧастей
		               |ГДЕ
		               |	КолонкиДополнительныхТабличныхЧастей.Владелец = &ТабличнаяЧасть
		               |	И НЕ КолонкиДополнительныхТабличныхЧастей.ЭтоГруппа
		               |	И НЕ КолонкиДополнительныхТабличныхЧастей.ПометкаУдаления
		               |	И КолонкиДополнительныхТабличныхЧастей.Ссылка <> &ТекущаяКолонка";
		Запрос.УстановитьПараметр("ТабличнаяЧасть", Параметры.ТабличнаяЧасть);					   
		Запрос.УстановитьПараметр("ТекущаяКолонка", Параметры.ТекущаяКолонка);					   
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ДанныеКолонки = Новый Структура("ИмяТабличнойЧасти, ЗаголовокТабличнойЧасти, ИмяРеквизита, ЗаголовокРеквизита",
											Выборка.ИмяТабличнойЧасти,
											Выборка.ЗаголовокТабличнойЧасти,
											Выборка.ИмяРеквизита,
											Выборка.ЗаголовокРеквизита);
											
			ИмяРеквизита 			= ДанныеКолонки.ИмяТабличнойЧасти + "." + ДанныеКолонки.ИмяРеквизита;
			ПредставлениеРеквизита	= ПользовательскоеПредставлениеРеквизита(ДанныеКолонки, 
																			Выборка.ЗаголовокТабличнойЧасти,
																			СинонимТЧ);
			ДоступныеРеквизиты.Добавить(ИмяРеквизита, ПредставлениеРеквизита);
			ВрТипыРеквизитовОбъекта.Вставить(ИмяРеквизита, Выборка.ТипЗначения);
			
		КонецЦикла;
		
		Если Параметры.ТабличнаяЧасть.ПредопределеннаяТабличнаяЧасть Тогда
			ИмяТабличнойЧасти = Параметры.ТабличнаяЧасть.ИмяТабличнойЧасти;
			ТабличнаяЧасть = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
			Если ТабличнаяЧасть <> Неопределено Тогда
				СинонимТЧ = ТабличнаяЧасть.Синоним;
				
				Для каждого РеквизитОбъекта Из ТабличнаяЧасть.Реквизиты Цикл
				
					ИмяРеквизита 			= ИмяТабличнойЧасти + "." + РеквизитОбъекта.Имя;
					ПредставлениеРеквизита	= ПользовательскоеПредставлениеРеквизита(РеквизитОбъекта, 
																					ИмяТабличнойЧасти,
																					СинонимТЧ);
					ДоступныеРеквизиты.Добавить(ИмяРеквизита, ПредставлениеРеквизита);
					ВрТипыРеквизитовОбъекта.Вставить(ИмяРеквизита, РеквизитОбъекта.Тип);
				
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.ДополнительныеРеквизиты.Количество() > 0 Тогда
		Для Каждого РеквизитОбъекта Из Параметры.ДополнительныеРеквизиты Цикл
		
			ИмяРеквизита 			= РеквизитОбъекта.Значение;
			ПредставлениеРеквизита	= ПользовательскоеПредставлениеРеквизита(РеквизитОбъекта);
			ДоступныеРеквизиты.Добавить(ИмяРеквизита, ПредставлениеРеквизита);
			ВрТипыРеквизитовОбъекта.Вставить(ИмяРеквизита, РеквизитОбъекта.ТипЗначения);
		
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.ДобавленныеРеквизиты) = Тип("Массив") Тогда
		Для Каждого ТекущийДобавленныйРеквизит Из Параметры.ДобавленныеРеквизиты Цикл
		
			ИмяТабличнойЧасти 	= ТекущийДобавленныйРеквизит.ИмяТабличнойЧасти;
			СинонимТЧ			= ТекущийДобавленныйРеквизит.ЗаголовокТабличнойЧасти;
			
			ИмяРеквизита = ?(ПустаяСтрока(ИмяТабличнойЧасти), "", ИмяТабличнойЧасти + ".")
							+ ТекущийДобавленныйРеквизит.ИмяРеквизита;
			ПредставлениеРеквизита	= ПользовательскоеПредставлениеРеквизита(ТекущийДобавленныйРеквизит);
			ДоступныеРеквизиты.Добавить(ИмяРеквизита, ПредставлениеРеквизита);
			
			Если ТипЗнч(ТекущийДобавленныйРеквизит.ТипЗначения) 
								= Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыОпераций") Тогда
				ВрТипыРеквизитовОбъекта.Вставить(ИмяРеквизита, ТекущийДобавленныйРеквизит.ТипЗначения.ТипЗначения);
			Иначе
				ВрТипыРеквизитовОбъекта.Вставить(ИмяРеквизита, ТекущийДобавленныйРеквизит.ТипЗначения);
			КонецЕсли;				
		
		КонецЦикла; 
	КонецЕсли;
	
	ТипыРеквизитовОбъектаИсточника = Новый ФиксированноеСоответствие(ВрТипыРеквизитовОбъекта);
	
	ДоступныеРеквизиты.СортироватьПоПредставлению();
	
	ПрочитатьПереданныеСвязи(Параметры.ВыбранныеСвязи);
	
	Если СвязиПараметровВыбора.Количество() > 0 Тогда
		НедействительныеСвязи = Новый Массив;
		Для каждого ТекущаяСвязь Из СвязиПараметровВыбора Цикл
			
			ЭлементВДоступныхРеквизитах = ДоступныеРеквизиты.НайтиПоЗначению(ТекущаяСвязь.Реквизит);
			Если ЭлементВДоступныхРеквизитах <> Неопределено Тогда
				ВыбранныеРеквизиты.Добавить(ЭлементВДоступныхРеквизитах.Значение,
											ЭлементВДоступныхРеквизитах.Представление);
			
				ДоступныеРеквизиты.Удалить(ЭлементВДоступныхРеквизитах);
			Иначе
				НедействительныеСвязи.Добавить(ТекущаяСвязь);	
			КонецЕсли;
		
		КонецЦикла;
		Если НедействительныеСвязи.Количество() > 0 Тогда
			Для каждого НедействетельнаяСвязь Из НедействительныеСвязи Цикл
			
				СвязиПараметровВыбора.Удалить(НедействетельнаяСвязь);	
			
			КонецЦикла;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Отказ = Истина;
		//Предупреждение(ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Связи параметров выбора были изменены.
			|Использовать новые связи параметров выбора?'");
		
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
			ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 15, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		ПодготовитьСвязиКПередаче();
		ОповеститьОВыборе(СвязиКПередаче);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ДоступныеРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДобавитьВСвязиПараметровВыбора();
КонецПроцедуры

&НаКлиенте
Процедура СвязиПараметровВыбораПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	УдалитьИзСвязейПараметровВыбора();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	ПодготовитьСвязиКПередаче();
	ОповеститьОВыборе(СвязиКПередаче);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СвязиПараметровВыбора

&НаКлиенте
Процедура СвязиПараметровВыбораИмяПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязиПараметровВыбораРежимПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УдалитьПараметр(Команда)
	
	УдалитьИзСвязейПараметровВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПараметр(Команда)
	
	ДобавитьВСвязиПараметровВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Модифицированность = Ложь;
	Закрыть(Неопределено);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПользовательскоеПредставлениеРеквизита(РеквизитОбъекта, Префикс = "", ПрефиксПользовательский = "")

	Результат = "";
	Синоним = ?(ПустаяСтрока(ПрефиксПользовательский), "", ПрефиксПользовательский + ". ");
	Имя = ?(ПустаяСтрока(Префикс), "", Префикс + ".");
	Если ТипЗнч(РеквизитОбъекта) = Тип("ОбъектМетаданных") Тогда
		Синоним = Синоним + РеквизитОбъекта.Синоним;	
		Имя = Имя + РеквизитОбъекта.Имя;
	ИначеЕсли ТипЗнч(РеквизитОбъекта) = Тип("ОписаниеСтандартногоРеквизита") Тогда
		Синоним = Синоним + РеквизитОбъекта.Синоним;	
		Имя = Имя + РеквизитОбъекта.Имя;
	ИначеЕсли ТипЗнч(РеквизитОбъекта) = Тип("ЭлементСпискаЗначений") Тогда
		Синоним = Синоним + РеквизитОбъекта.Представление;	
		Имя = Имя + РеквизитОбъекта.Значение;
	ИначеЕсли ТипЗнч(РеквизитОбъекта) = Тип("Структура") Тогда
		Синоним = "";
		Если НЕ ПустаяСтрока(РеквизитОбъекта.ИмяТабличнойЧасти) Тогда
			Если ПустаяСтрока(РеквизитОбъекта.ЗаголовокТабличнойЧасти) Тогда
				Синоним = РеквизитОбъекта.ИмяТабличнойЧасти + ". ";
			Иначе
				Синоним = РеквизитОбъекта.ЗаголовокТабличнойЧасти + ". ";
			КонецЕсли;
			Имя = РеквизитОбъекта.ИмяТабличнойЧасти + ".";
		КонецЕсли;
		Если ПустаяСтрока(РеквизитОбъекта.ЗаголовокРеквизита) Тогда
			Синоним = Синоним + РеквизитОбъекта.ИмяРеквизита;
		Иначе
			Синоним = Синоним + РеквизитОбъекта.ЗаголовокРеквизита;
		КонецЕсли;
		Имя = Имя + РеквизитОбъекта.ИмяРеквизита;
	КонецЕсли;
	
	Результат = "";
	Если Не ПустаяСтрока(Синоним) Тогда
		Результат = Результат + Синоним;
	КонецЕсли;
	Если Не ПустаяСтрока(Имя) Тогда
		Результат = Результат + " (" +Имя + ")";
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПользовательскоеПредставлениеРеквизита()

&НаКлиенте
Процедура ДобавитьВСвязиПараметровВыбора()

	ТекущийРеквизит = Элементы.ДоступныеРеквизиты.ТекущиеДанные;
	Если ТекущийРеквизит = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеРеквизиты.НайтиПоЗначению(ТекущийРеквизит.Значение) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеРеквизиты.Добавить(ТекущийРеквизит.Значение, ТекущийРеквизит.Представление);
	
	ДоступныеРеквизиты.Удалить(ДоступныеРеквизиты.НайтиПоЗначению(ТекущийРеквизит.Значение));
	
	НовСтр = СвязиПараметровВыбора.Добавить();
	НовСтр.Реквизит = ТекущийРеквизит.Значение;
//	НовСтр.Имя = "Отбор." + ?(Лев(НовСтр.Реквизит, 7) = "Объект.", Сред(НовСтр.Реквизит, 8), НовСтр.Реквизит);
	НовСтр.Имя = "Отбор." + Сред(НовСтр.Реквизит, Найти(НовСтр.Реквизит, ".")+1);
	НовСтр.Режим = "Очищать";
	
	ТипЗначенияВыбранногоРеквизита = ТипыРеквизитовОбъектаИсточника[ТекущийРеквизит.Значение];
	Если ТипЗначенияВыбранногоРеквизита <> Неопределено Тогда
		
		ПозицияТипа = ТипыРеквизитовОбъекта.Найти(ТипЗначенияВыбранногоРеквизита);
		Если ПозицияТипа <> Неопределено Тогда
			НовСтр.Имя = Элементы.СвязиПараметровВыбораИмя.СписокВыбора.Получить(ПозицияТипа).Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Модифицированность = Истина;

КонецПроцедуры // ДобавитьВСвязиПараметровВыбора()

&НаКлиенте
Процедура УдалитьИзСвязейПараметровВыбора()
	
	ТекущийРеквизит = Элементы.СвязиПараметровВыбора.ТекущиеДанные;
	Если ТекущийРеквизит = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитКУдалению = ВыбранныеРеквизиты.НайтиПоЗначению(ТекущийРеквизит.Реквизит);
	ДоступныеРеквизиты.Добавить(РеквизитКУдалению.Значение, РеквизитКУдалению.Представление);
	
	ВыбранныеРеквизиты.Удалить(РеквизитКУдалению);
	
	НайденныйРеквизит = СвязиПараметровВыбора.НайтиПоИдентификатору(ТекущийРеквизит.ПолучитьИдентификатор());
	СвязиПараметровВыбора.Удалить(НайденныйРеквизит);
	
	ДоступныеРеквизиты.СортироватьПоПредставлению();
	
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьПереданныеСвязи(ВыбранныеСвязи)

	ТекВыбранныеСвязи = Неопределено;
	Если Лев(Параметры.ВыбранныеСвязи, 4) = "{""#""" Тогда
		Попытка
		
			ТекВыбранныеСвязи = ЗначениеИзСтрокиВнутр(ВыбранныеСвязи);
		
		Исключение
			
			ТекВыбранныеСвязи = Неопределено;
			
		КонецПопытки;
	КонецЕсли;
	
	Если ТипЗнч(ТекВыбранныеСвязи)=Тип("Массив") Тогда
		
		Для каждого ТекСвязь Из ТекВыбранныеСвязи Цикл
		
			НовСтр = СвязиПараметровВыбора.Добавить();
			НовСтр.Имя = ТекСвязь.Имя;
			НовСтр.Реквизит = ТекСвязь.Реквизит;
			НовСтр.Режим = ТекСвязь.Режим;
		
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры // ПрочитатьПереданныеСвязи()

&НаКлиенте
Процедура ПодготовитьСвязиКПередаче()

	Результат = Новый Массив;
	ПредставлениеРезультата = "";
	Для каждого ТекСтр Из СвязиПараметровВыбора Цикл
	
		Результат.Добавить(Новый Структура("Имя, Реквизит, Режим",
											ТекСтр.Имя, ТекСтр.Реквизит, ТекСтр.Режим));
		ПредставлениеРезультата = ПредставлениеРезультата + ТекСтр.имя +"("+ТекСтр.Реквизит+"), ";							
	
	КонецЦикла;
	
	ПредставлениеРезультата = Лев(ПредставлениеРезультата, СтрДлина(ПредставлениеРезультата)-2);
	
	СвязиКПередаче = Новый СписокЗначений;
	СвязиКПередаче.Добавить(РезультатВСтроку(Результат), ПредставлениеРезультата);
	
	Модифицированность = Ложь;

КонецПроцедуры // ПодготовитьСвязиКПередаче()

&НаСервереБезКонтекста
Функция РезультатВСтроку(Результат)

	Возврат ЗначениеВСтрокуВнутр(Результат);

КонецФункции // РезультатВСтроку()
