#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ ЭтоНовый() И НЕ Ссылка.Код = Код Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ХарактеристикиДополнительнойБюджетнойКлассификации.ДополнительнаяБюджетнаяКлассификация КАК ДопКл
		|ПОМЕСТИТЬ ДопКлассификация
		|ИЗ
		|	РегистрСведений.ХарактеристикиДополнительнойБюджетнойКлассификации КАК ХарактеристикиДополнительнойБюджетнойКлассификации
		|ГДЕ
		|	ХарактеристикиДополнительнойБюджетнойКлассификации.ЗначениеДопКлассификатора = &ЗначениеДопКлассификатора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХарактеристикиДополнительнойБюджетнойКлассификации.ДополнительнаяБюджетнаяКлассификация КАК ДополнительнаяБюджетнаяКлассификация,
		|	ХарактеристикиДополнительнойБюджетнойКлассификации.ВидДопКлассификатора КАК ВидДопКлассификатора,
		|	ХарактеристикиДополнительнойБюджетнойКлассификации.ВидДопКлассификатора.Код КАК КодВидаДопКлассификатора,
		|	ХарактеристикиДополнительнойБюджетнойКлассификации.ВидДопКлассификатора.Наименование КАК НаименованиеВидаДопКлассификатора,
		|	ВЫБОР
		|		КОГДА ХарактеристикиДополнительнойБюджетнойКлассификации.ЗначениеДопКлассификатора = &ЗначениеДопКлассификатора
		|			ТОГДА &НовыйКод
		|		ИНАЧЕ ХарактеристикиДополнительнойБюджетнойКлассификации.ЗначениеДопКлассификатора.Код
		|	КОНЕЦ КАК Значение,
		|	ХарактеристикиДополнительнойБюджетнойКлассификации.ЗначениеДопКлассификатора.ДетализируемыйКодБК КАК ЗначениеДетализируемойБК
		|ИЗ
		|	РегистрСведений.ХарактеристикиДополнительнойБюджетнойКлассификации КАК ХарактеристикиДополнительнойБюджетнойКлассификации
		|ГДЕ
		|	ХарактеристикиДополнительнойБюджетнойКлассификации.ДополнительнаяБюджетнаяКлассификация В
		|			(ВЫБРАТЬ
		|				ДопКлассификация.ДопКл
		|			ИЗ
		|				ДопКлассификация КАК ДопКлассификация)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДополнительнаяБюджетнаяКлассификация,
		|	НаименованиеВидаДопКлассификатора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДопКлассификация.ДопКл
		|ИЗ
		|	ДопКлассификация КАК ДопКлассификация");
		
		Запрос.УстановитьПараметр("ЗначениеДопКлассификатора", Ссылка);
		Запрос.УстановитьПараметр("НовыйКод", Код);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ДополнительнаяБюджетнаяКлассификация");
			ЭлементБлокировки.ИсточникДанных = МассивРезультатов[2];
			Блокировка.Заблокировать();
			
		Исключение	
			
			Отказ = Истина;
			Возврат;
			
		КонецПопытки;
		
		ВыборкаДопКл = МассивРезультатов[2].Выбрать();
		
		ТаблицаХарактеристик = МассивРезультатов[1].Выгрузить();
		
		Пока ВыборкаДопКл.Следующий() Цикл
			
			ТаблицаХарактеристикДопКл = ТаблицаХарактеристик.НайтиСтроки(Новый Структура("ДополнительнаяБюджетнаяКлассификация", ВыборкаДопКл.ДопКл));
			НовоеНаименование = Справочники.ДополнительнаяБюджетнаяКлассификация.СформироватьНаименование(ТаблицаХарактеристикДопКл);
			ОбъектДопКл = ВыборкаДопКл.ДопКл.ПолучитьОбъект();
			
			Если НЕ СокрЛП(ОбъектДопКл.Наименование) = НовоеНаименование Тогда
				
				ОбъектДопКл.Наименование  = НовоеНаименование;
				ОбъектДопКл.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ХарактеристикиДополнительнойБюджетнойКлассификации");
		ЭлементБлокировкиДанных.УстановитьЗначение("ВидДопКлассификатора", ЭтотОбъект.Владелец);
		БлокировкаДанных.Заблокировать();
		
		Набор = РегистрыСведений.ХарактеристикиДополнительнойБюджетнойКлассификации.СоздатьНаборЗаписей();
		Набор.Отбор.ВидДопКлассификатора.Установить(ЭтотОбъект.Владелец);
		Набор.Записывать = Истина;
		Набор.ОбменДанными.Загрузка = Истина;
		
		Набор.Прочитать();
		
		НаборТаблица = Набор.Выгрузить();
		
		УдаляемыеСтроки = НаборТаблица.НайтиСтроки(Новый Структура("ЗначениеДопКлассификатора", ЭтотОбъект.Ссылка));
		
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
			НаборТаблица.Удалить(УдаляемаяСтрока);
		КонецЦикла;	
		
		Набор.Загрузить(НаборТаблица);
			
		Набор.Записать(); 
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли