
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	МассивОбластей = Новый Массив;
	
	НачалоПоиска = ДокументРезультат.Область("R1");
	Пока Истина Цикл
		Область = ДокументРезультат.НайтиТекст("РазделительСтраниц", НачалоПоиска);
		
		Если Область <> Неопределено Тогда
			МассивОбластей.Добавить(Область);
			НачалоПоиска = Область;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОбластей.Количество() > 1 Тогда
		Для Каждого Область Из МассивОбластей Цикл
			Область.Текст = "";
			ДокументРезультат.Область("R"+Область.Верх).КонецСтраницы = Истина;
		КонецЦикла;
	ИначеЕсли МассивОбластей.Количество() = 1 Тогда
		Область = МассивОбластей[0];
		Область.Текст = "";
	КонецЕсли;
КонецПроцедуры
