#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗащитаПерсональныхДанных") Тогда
		МодульЗащитаПерсональныхДанных = ОбщегоНазначения.ОбщийМодуль("ЗащитаПерсональныхДанных");
		МодульЗащитаПерсональныхДанных.ДобавитьКомандуПечатиСогласияНаОбработкуПерсональныхДанных(КомандыПечати);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Организация");

	Возврат Результат;
	
КонецФункции

Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт 

	Результат = Новый Массив;
	Результат.Добавить("Контрагент");
		
	Возврат Результат;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоГруппа ИЛИ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Возвращает первого найденного плательщика и договор для указанного студента.
//
Функция ПолучитьДанныеПлательщикаНаДату(Учащийся, Период) Экспорт 
	
	Сведения = Новый Структура("Контрагент, ДоговорКонтрагента, ПорядокВыпискиСФ", 
											Справочники.Контрагенты.ПустаяСсылка(), 
											Справочники.Договоры.ПустаяСсылка(), 
											Перечисления.ПорядокВыпискиСФЗаУслуги.ПустаяСсылка()
										);
	
	Если НЕ Учащийся.Пустая() Тогда
		
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		               |	Плательщики.Контрагент,
		               |	Плательщики.Договор КАК ДоговорКонтрагента,
		               |	Плательщики.ПорядокВыпискиСФ
		               |ИЗ
		               |	РегистрСведений.ПлательщикиПоДоговоруОбразование.СрезПоследних(&Период, Студент = &Учащийся) КАК Плательщики";
		Запрос.Текст = ТекстЗапроса; 
		Запрос.УстановитьПараметр("Период", Период);		
		Запрос.УстановитьПараметр("Учащийся", Учащийся);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Сведения, Выборка);
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат Сведения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
