
#Область СлужебныйПрограммныйИнтерфейс

// см. УправлениеМатериальнымиЗапасамиПовтИсп.ДанныеСчетовУчетаМЗ
Функция ДанныеСчетовУчетаМЗ(Знач Организация, Знач ТолькоБалансовые, Знач Включать106 = Ложь, Знач Включать113 = Ложь, Знач Включать108 = Ложь) Экспорт
	Возврат УправлениеМатериальнымиЗапасамиПовтИсп.ДанныеСчетовУчетаМЗ(Организация, ТолькоБалансовые, Включать106, Включать113, Включать108);
КонецФункции

// см. УправлениеМатериальнымиЗапасамиПовтИсп.СчетВПутиПоСчетуУчетаМЗ
Функция СчетВПутиПоСчетуУчетаМЗ(Знач СчетУчетаМЗ) Экспорт
	Возврат УправлениеМатериальнымиЗапасамиПовтИсп.СчетВПутиПоСчетуУчетаМЗ(СчетУчетаМЗ);
КонецФункции

#КонецОбласти