#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(НаименованиеСценария) Тогда
		ТекНаименование = """" + НаименованиеСценария + """";
	Иначе
		ТекНаименование = "<не задан>";
	КонецЕсли;	
	Наименование = "Период: """+Строка(Период) +""", Сценарий: "+ТекНаименование;
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли