#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыбранныеЗначения.ЗагрузитьЗначения(Параметры.ВыбранныеЗначения);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СписокСчетов", Параметры.ЗначенияДляВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранныеЗначения.НайтиПоЗначению(ВыбраннаяСтрока) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныеЗначения.Добавить(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьВыбор(Команда)
	
	ПроверитьИЗакончитьВыбор();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьИЗакончитьВыбор()
	
	МассивСчетов = ВыбранныеЗначения.ВыгрузитьЗначения();
	
	Если МассивСчетов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Не выбрано ни одного счета'"),
			,
			"СписокВыбранныхЗначений");
		
		Возврат;
	КонецЕсли;
	
	Закрыть(МассивСчетов);
	
КонецПроцедуры

#КонецОбласти
