#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ТипыСвойства = ТипЗначения.Типы();
	
	Если ТипыСвойства.Количество()>0 Тогда
		Если ТипыСвойства[0] = Тип("СправочникСсылка.Субконто") 
			И УточнениеТипа.Пустая() Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Не указано уточнение типа для значений свойств'"),,
				"УточнениеТипа",
				"Объект",
				Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли