////////////////////////////////////////////////////////////////////////////////
// УчетНДСКлиентСерверПовтИсп
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

//---
// Инструкции учета НДС
//---

Функция ИнструкцииУчета_ИдентификаторСуществует(Идентификатор) Экспорт
	
	Возврат НЕ (УчетНДСКлиентСерверПовтИсп.ИнструкцииУчета_ПолучитьСтрокуОбщейТаблицы(Идентификатор) = Неопределено);
	
КонецФункции

Функция ИнструкцииУчета_ПолучитьСписокИдентификаторов() Экспорт
	
	Возврат УчетНДСВызовСервера.ИнструкцииУчета_ПолучитьСписокИдентификаторов();
	
КонецФункции

Функция ИнструкцииУчета_ПолучитьСписокДатНачалаПрименения() Экспорт
	
	Возврат УчетНДСВызовСервера.ИнструкцииУчета_ПолучитьСписокДатНачалаПрименения();
	
КонецФункции

Функция ИнструкцииУчета_ПолучитьСтрокуОбщейТаблицы(Идентификатор) Экспорт
	
	Возврат УчетНДСВызовСервера.ИнструкцииУчета_ПолучитьСтрокуОбщейТаблицы(Идентификатор);
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
