
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БухгалтерскиеОперацииСервер.УстановитьОтборСпискаИзНастроекКомпоновки(Список, Параметры);
	Если Не Параметры.Отбор.Свойство("Владелец", ОтборВладелец)
			И ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
		ОтборВладелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Номенклатура, "БСО");
		Параметры.Отбор.Вставить("Владелец", ОтборВладелец);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборВладелец) Тогда
		Элементы.ОтборВладелец.ТолькоПросмотр = Истина;
		Элементы.ОтборВладелец.КнопкаОткрытия = Ложь;
		Элементы.Владелец.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборВладелецПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец", ОтборВладелец,,, ЗначениеЗаполнено(ОтборВладелец));
    Элементы.Владелец.Видимость = Не ЗначениеЗаполнено(ОтборВладелец);
КонецПроцедуры

#КонецОбласти
