
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		НормативыПроезда.Отбор, "Организация",  ОтборОрганизация,,, ОтборОрганизацияИспользование);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		НормативыПроездаКМестуОтпускаДляКрайнегоСевера.Отбор, "Организация",  ОтборОрганизация,,, ОтборОрганизацияИспользование);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		НормативыПроживания.Отбор, "Организация",  ОтборОрганизация,,, ОтборОрганизацияИспользование);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		НормативыСуточных.Отбор, "Организация",  ОтборОрганизация,,, ОтборОрганизацияИспользование);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НормативыПроездаОрганизация", "Видимость", Не ОтборОрганизацияИспользование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НормативыПроездаКМестуОтпускаДляКрайнегоСевераОрганизация", "Видимость", Не ОтборОрганизацияИспользование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НормативыПроживанияОрганизация", "Видимость", Не ОтборОрганизацияИспользование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НормативыСуточныхОрганизация", "Видимость", Не ОтборОрганизацияИспользование);
	
КонецПроцедуры

#КонецОбласти
