
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ФормаКлиентскогоПриложения")
		И ПараметрыВыполненияКоманды.Источник.ТолькоПросмотр Тогда
		
		// Если ТолькоПросмотр, то нужно открывать только существующую запись.
		// Если записи еще нет, то нужно просто предупредить об этом
		КлючЗаписи = ПолучитьКлючПоследнейЗаписи(ПараметрКоманды);
		Если КлючЗаписи = Неопределено Тогда
			ПоказатьПредупреждение(Неопределено, НСтр("ru='Учетная политика не задана'"));
		Иначе
			ОткрытьФорму("РегистрСведений.УчетнаяПолитикаОрганизаций.ФормаЗаписи", 
						Новый Структура("Ключ", КлючЗаписи),
						ПараметрыВыполненияКоманды.Источник, 
						ПараметрыВыполненияКоманды.Уникальность, 
						ПараметрыВыполненияКоманды.Окно);
						
		КонецЕсли;
		
	Иначе
		ПараметрыФормы = Новый Структура("Организация, ПолучитьНаТекущуюДату", ПараметрыВыполненияКоманды.Источник.Параметры.Ключ, Истина);
		ОткрытьФорму(	"РегистрСведений.УчетнаяПолитикаОрганизаций.ФормаЗаписи", 
						ПараметрыФормы, 
						ПараметрыВыполненияКоманды.Источник, 
						ПараметрыВыполненияКоманды.Уникальность, 
						ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючПоследнейЗаписи(Организация)

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	              |	УчетнаяПолитикаОрганизаций.Период КАК Период,
	              |	УчетнаяПолитикаОрганизаций.Организация
	              |ИЗ
	              |	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	              |ГДЕ
	              |	УчетнаяПолитикаОрганизаций.Организация = &Организация
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Период УБЫВ";
	Запрос.УстановитьПараметр("Организация", Организация);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат РегистрыСведений.УчетнаяПолитикаОрганизаций.СоздатьКлючЗаписи(Новый Структура("Организация, Период", Выборка.Организация, Выборка.Период));
	КонецЕсли;

КонецФункции // ПолучитьКлючПоследнейЗаписи()
 
