
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьФормуПоОбъекту();
		
		Если Объект.Числитель = 0 Тогда
			Объект.Числитель = 1;
		КонецЕсли;	
		Если Объект.Знаменатель = 0 Тогда
			Объект.Знаменатель = 1;
		КонецЕсли;	
	КонецЕсли;
	
	БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НаименованиеБазовойЕдиницыИзмеренияПоТипуИзмерения(Объект.ТипИзмеряемойВеличины);
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьФормуПоОбъекту();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьФормуПоОбъекту()
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
 	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаПравилаПересчета", "Видимость", ЗначениеЗаполнено(Объект.ТипИзмеряемойВеличины));
	
КонецПроцедуры

#КонецОбласти