#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка.Пустая() Тогда
		
		Если НЕ ДополнительныеСвойства.Свойство("АдресОсновногоФайла")
			ИЛИ НЕ ЗначениеЗаполнено(ДополнительныеСвойства.АдресОсновногоФайла) Тогда
			ТекстСообщения = НСтр("ru='Электронный документ не сформирован. Запись документа запрещена.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
		
		Если НЕ ДополнительныеСвойства.Свойство("СоставМаршрута")
			ИЛИ ДополнительныеСвойства.СоставМаршрута.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='Не определен маршрут подписания электронного документа. Запись документа запрещена.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
		
		ВнутреннийЭДОПереопределяемый.ПроверитьСоставМаршрутаНовогоДокумента(
			УчетныйДокумент, ДополнительныеСвойства.СоставМаршрута, ЭтотОбъект);
			
		Если ВнутреннийЭДОПереопределяемый.НовыйВнутреннийДокументНеПризнанКорректнымДляЗаписи(
			УчетныйДокумент, ДополнительныеСвойства.СоставМаршрута, ЭтотОбъект) Тогда
			Если НЕ ВнутреннийЭДОПереопределяемый.НеБлокироватьСозданиеВнутреннихЭДДляНекорректныхДокументовУчета(Организация) Тогда
				Отказ = Истина;
				ТекстСообщения = НСтр("ru='Не выполнены требования к документам учета для оформления электронного документа. Запись документа запрещена.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Возврат;
			КонецЕсли;	
		КонецЕсли;			
		
		ВнутреннийЭДО.ЗаблокироватьРегистрСостоянияУчетныхДокументов(УчетныйДокумент);
		
		Если ВнутреннийЭДО.СуществуетАктуальныйЭлектронныйДокумент(УчетныйДокумент, ИдентификаторКомандыПечати) Тогда
			ТекстСообщения = НСтр("ru='Для выбранной печатной формы уже существует актуальный электронный документ. Запись документа запрещена.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
		
		НоваяСсылка = Документы.ВнутреннийЭлектронныйДокумент.ПолучитьСсылку();
		УстановитьСсылкуНового(НоваяСсылка);

		ДобавитьОсновнойФайл(ДополнительныеСвойства.АдресОсновногоФайла, ДополнительныеСвойства.ИмяФайла, НоваяСсылка);

		ДобавитьОсновнойФайлPDF(ДополнительныеСвойства.АдресОсновногоФайлаPDF, ДополнительныеСвойства.ИмяФайлаPDF, НоваяСсылка);
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", Ссылка.Пустая());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Для не новых документов запуск процесса не производится
	Если НЕ ДополнительныеСвойства.Свойство("ЭтоНовый")
		ИЛИ НЕ ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСостояния = Новый Структура;
	ПараметрыСостояния.Вставить("УчетныйДокумент", УчетныйДокумент);
	ПараметрыСостояния.Вставить("ЭлектронныйДокумент", Ссылка);
	ПараметрыСостояния.Вставить("Состояние", ВнутреннийЭДО.СостояниеДокументаТребуетсяПодписание());
	ПараметрыСостояния.Вставить("Актуальный", Истина);
	ПараметрыСостояния.Вставить("ДатаИзменения", ТекущаяДатаСеанса());
	ПараметрыСостояния.Вставить("Комментарий", "");
	
	ВнутреннийЭДО.УстановитьСостояниеДокумента(ПараметрыСостояния);
	
	ПараметрыМаршрута = Новый Структура;
	ПараметрыМаршрута.Вставить("ЭлектронныйДокумент", Ссылка);
	ПараметрыМаршрута.Вставить("СоставМаршрута", ДополнительныеСвойства.СоставМаршрута);
	
	ВнутреннийЭДО.СохранитьМаршрутПодписанияДокумента(ПараметрыМаршрута);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ВнутреннийЭДОПереопределяемый.ВнутреннийЭлектронныйДокументОбработкаЗаполнения(
		ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОсновнойФайл(АдресФайла, ИмяФайла, Владелец) Экспорт
	
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.Автор = Пользователи.ТекущийПользователь();
	ПараметрыФайла.ВладелецФайлов = Владелец;
	ПараметрыФайла.ИмяБезРасширения = ИмяФайла;
	ПараметрыФайла.Служебный = Истина;
	
	ОсновнойФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресФайла);
	
КонецПроцедуры

Процедура ДобавитьОсновнойФайлPDF(АдресФайла, ИмяФайла, Владелец) Экспорт
	Если ЗначениеЗаполнено(АдресФайла) Тогда
		ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
		ПараметрыФайла.Автор = Пользователи.ТекущийПользователь();
		ПараметрыФайла.ВладелецФайлов = Владелец;
		ПараметрыФайла.ИмяБезРасширения = ИмяФайла;
		ПараметрыФайла.Служебный = Истина;
		
		ОсновнойФайлPDF = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресФайла);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
