#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает ссылку на присоединенный файл
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.ПакетыДанныхДляМСД, владелец присоединенного файла.
//	ИмяПакета	   - Строка, наименование элемента справочника ПакетыДанныхДляМСДПрисоединенныеФайлы.
// Возвращаемое значение:
// 	СправочникСсылка.ПакетыДанныхДляМСДПрисоединенныеФайлы.
//
Функция ПрисоединенныйФайлВыгрузки(ДокументСсылка, ИмяПакета) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПакетыДанныхДляМСДПрисоединенныеФайлы.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ПакетыДанныхДляМСДПрисоединенныеФайлы КАК ПакетыДанныхДляМСДПрисоединенныеФайлы
	                      |ГДЕ
	                      |	ПакетыДанныхДляМСДПрисоединенныеФайлы.ВладелецФайла = &ДокументСсылка
	                      |	И ПакетыДанныхДляМСДПрисоединенныеФайлы.Наименование = &ИмяПакета
	                      |	И НЕ ПакетыДанныхДляМСДПрисоединенныеФайлы.ПометкаУдаления
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПакетыДанныхДляМСДПрисоединенныеФайлы.ДатаСоздания УБЫВ");
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка); 
	Запрос.УстановитьПараметр("ИмяПакета", ИмяПакета);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;           
	
	Возврат Неопределено;
	
КонецФункции

// Выполняет выгрузку данных
// Параметры:
//  СтруктураПараметров - Структура:
// 		* ВидПередаваемыхДанных 	- Булево - Истина - отчетные данные, Ложь - оперативны данные;
//		* НачалоПериода				- Дата - начало выгружаемого периода;
//		* ОкончаниеПериода			- Дата - окончание выгружаемого периода;
// 		* АдресРезультата			- Строка - адрес во временном хранилище, куда помещается результат выгрузки;
// 		* ДокументСсылка			- ДокументСсылка.ПакетыДанныхДляМСД - ссылка документа "Пакет передаваемых данных";
// 		* ВерсияТаксономии			- Строка - версия таксономии, по которой выполняется выгрузка.
// 	АдресРезультата					- Строка - адрес во временном хранилище, куда помещается результат выгрузки.
//
Процедура ВыполнитьВыгрузку(СтруктураПараметров,  АдресРезультата) Экспорт
	
	ПараметрыВыполнения = Новый Структура;
	
	ПараметрыВыполнения.Вставить("текФабрикаXDTO");
	ПараметрыВыполнения.Вставить("СоответствиеАналитик");
	ПараметрыВыполнения.Вставить("ДатаНачалаВыгрузки");
	ПараметрыВыполнения.Вставить("НачалоПериода");
	ПараметрыВыполнения.Вставить("ОкончаниеПериода");
	ПараметрыВыполнения.Вставить("СоответствиеПорядковыхНомеров");
	ПараметрыВыполнения.Вставить("ПорядковыйНомер");
	ПараметрыВыполнения.Вставить("ДокументСсылка");
	ПараметрыВыполнения.Вставить("ВерсияТаксономии");
	ПараметрыВыполнения.Вставить("ТаблицаРеквизитовАналитик");
	ПараметрыВыполнения.Вставить("Организация");
	ПараметрыВыполнения.Вставить("ВыполнятьПроверку");
	ПараметрыВыполнения.Вставить("НаборИсторияПроверкиАналитик");
	ПараметрыВыполнения.Вставить("МассивСчетовПерезагружаемые");
	ПараметрыВыполнения.Вставить("ПерезагружаемыеПериоды");
	ПараметрыВыполнения.Вставить("Каталог");
	ПараметрыВыполнения.Вставить("ПакетныйРежимВыгрузки");
	ПараметрыВыполнения.Вставить("ПространствоИменПакет");
	ПараметрыВыполнения.Вставить("ИспользоватьСхемуВыгрузки2026"); 
	
	ПараметрыВыполнения.ДатаНачалаВыгрузки = ТекущаяДатаСеанса();
	ПараметрыВыполнения.НачалоПериода = СтруктураПараметров.НачалоПериода;
	ПараметрыВыполнения.ОкончаниеПериода = СтруктураПараметров.ОкончаниеПериода;
	ПараметрыВыполнения.ДокументСсылка = СтруктураПараметров.ДокументСсылка;
	ПараметрыВыполнения.ВерсияТаксономии = СтруктураПараметров.ВерсияТаксономии;
	ПараметрыВыполнения.Организация = СтруктураПараметров.Организация;
	ПараметрыВыполнения.ВыполнятьПроверку = МодульСбораДанныхПовтИсп.ВыполнятьПроверкуПриВыгрузке(); 	
	
	НаборИсторияПроверкиАналитик = РегистрыСведений.ИсторияПроверкиАналитикМСД.СоздатьНаборЗаписей();
	НаборИсторияПроверкиАналитик.Отбор.Документ.Установить(СтруктураПараметров.ДокументСсылка);
	НаборИсторияПроверкиАналитик.Очистить();
	
	ПараметрыВыполнения.НаборИсторияПроверкиАналитик = НаборИсторияПроверкиАналитик;
	ПараметрыВыполнения.МассивСчетовПерезагружаемые = ПолучитьМассивСчетовПерезагружаемые(ПараметрыВыполнения);
	ПараметрыВыполнения.ПерезагружаемыеПериоды = Новый Массив;
	ПараметрыВыполнения.ПакетныйРежимВыгрузки = Константы.ПакетныйРежимВыгрузкиОстатковМСД.Получить(); 
	ПараметрыВыполнения.ИспользоватьСхемуВыгрузки2026 = ИспользоватьСхемуВыгрузки2026(ПараметрыВыполнения.ОкончаниеПериода);
	
	Если ПараметрыВыполнения.ИспользоватьСхемуВыгрузки2026 Тогда
		ПараметрыВыполнения.ПространствоИменПакет = "MSD_DATA_FHD_1_0_2";
	Иначе
		ПараметрыВыполнения.ПространствоИменПакет = МодульСбораДанных.ПространствоИмен();	
	КонецЕсли;	
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'ФОРМИРОВАНИЕ ВЫГРУЗКИ - НАЧАЛО'"));
	
	ИмяФайлаСхемы = ПолучитьИмяВременногоФайла("XSD");  
	
	
	НаборСхем = ФабрикаXDTO.ЭкспортСхемыXML(ПараметрыВыполнения.ПространствоИменПакет);
	СхемаXML = НаборСхем.Получить(0);
	СхемаXML.ОбновитьЭлементDOM();
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайлаСхемы);
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(СхемаXML.ДокументDOM, ЗаписьXML);
	ЗаписьXML.Закрыть();
	
	ПараметрыВыполнения.текФабрикаXDTO = СоздатьФабрикуXDTO(ИмяФайлаСхемы);
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ПараметрыВыполнения.СоответствиеПорядковыхНомеров = Новый Соответствие;
	ПараметрыВыполнения.ПорядковыйНомер = 1;
	
	Если Не ПараметрыВыполнения.Свойство("ВерсияТаксономии") Тогда
		ПараметрыВыполнения.Вставить("ВерсияТаксономии", "");	
	КонецЕсли;
	Если ПустаяСтрока(ПараметрыВыполнения.ВерсияТаксономии) Тогда 
		МодульОбщегоНазначенияМСД = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияМСД");
		ДанныеВерсии = МодульОбщегоНазначенияМСД.ТекущаяВерсияТаксономии(ПараметрыВыполнения.ОкончаниеПериода, ПараметрыВыполнения.Организация);
		Если ДанныеВерсии = Неопределено Тогда
			ВызватьИсключение ("Отсутствует утвержденная таксономия на конец периода");
		КонецЕсли;
		ПараметрыВыполнения.ВерсияТаксономии = ДанныеВерсии.Версия;
	КонецЕсли;
	
	ВыгружатьМО = (КонецДня(ПараметрыВыполнения.ОкончаниеПериода) >= Дата(2025,12,31,23,59,59)); 
	Если ПараметрыВыполнения.ИспользоватьСхемуВыгрузки2026 И ВыгружатьМО Тогда
		Если ПериодПроверкиЗакрытияСчетов(ПараметрыВыполнения) Тогда			
			МассивСсылокЗакрытие = ПроверитьДатыЗакрытияГода(ПараметрыВыполнения);
			Если МассивСсылокЗакрытие.Количество() Тогда
				ОписаниеОшибки = НСтр("ru='Не удалось выполнить выгрузку пакета.
				|Обнаружены документы закрытия счетов санкционирования, в которых дата относится к закрываемому году или дата не входит в выгружаемый период.
				|Для корректной выгрузки дата в таких документах должна приходиться на следующий год и входить в выгружаемый период.
				|Исправьте дату указанных документов и повторите попытку.%1'", ОбщегоНазначения.КодОсновногоЯзыка());
				МассивСсылокВСтроку = "";
				Для каждого СтрокаСсылка Из МассивСсылокЗакрытие Цикл
					МассивСсылокВСтроку = МассивСсылокВСтроку + "
					|" + СтрокаСсылка;
				КонецЦикла;
				ТекстИсключения = СтрШаблон(ОписаниеОшибки, МассивСсылокВСтроку);
				ОбщегоНазначения.СообщитьПользователю(ТекстИсключения);
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Сбор данных в менеджер временных таблиц - начало'"));
	
	СформироватьДанныеДляВыгрузки(МенеджерВТ, ПараметрыВыполнения);
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Сбор данных в менеджер временных таблиц - Окончание'"));
	
	Каталог = ПолучитьИмяВременногоФайла() + ПолучитьРазделительПути() + XMLСтрока(Новый УникальныйИдентификатор) + ПолучитьРазделительПути();
	СоздатьКаталог(Каталог); 
	ПараметрыВыполнения.Каталог = Каталог;
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование Header.xml - начало'"));
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(Каталог + "Header.xml");
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ОбъектBody 		= ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "Body"));
	
	ОбъектHeader 	= ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "Body").Свойства.Получить("Header").Тип);
	ОбъектHeader.VersionTFF 			= ПараметрыВыполнения.ВерсияТаксономии;
	Если ПараметрыВыполнения.ИспользоватьСхемуВыгрузки2026 Тогда
		ОбъектHeader.VersionScheme 			= "1.0.2"; 	
	Иначе	
		ОбъектHeader.VersionScheme 			= "1.0.1"; 
	КонецЕсли;	
	
	ОбъектHeader.DueDateOf 				= ТекущаяДатаСеанса();
	ОбъектHeader.StartPeriodOfBalance 	= СтруктураПараметров.НачалоПериода;
	ОбъектHeader.EndPeriodOfBalance 	= СтруктураПараметров.ОкончаниеПериода;
	ОбъектHeader.OperationalData 		= Не СтруктураПараметров.ВидПередаваемыхДанных;
	
	ДанныеОПрограмме = МодульСбораДанныхПовтИсп.ДанныеОПрограмме();
	
	ОбъектHeader.SourceName		 		= ДанныеОПрограмме.Имя;
	ОбъектHeader.SourceVersion	 		= ДанныеОПрограмме.Версия;
	ОбъектHeader.Vendor					= ДанныеОПрограмме.Поставщик;
	
	ОбъектBody.Header					= ОбъектHeader;
	ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектBody);
	ЗаписьXML.Закрыть();
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование Header.xml - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование AnalyticsData.xml - начало'"));	
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(Каталог + "AnalyticsData.xml");
	ЗаписатьШапкуНачалаЭлемента(ЗаписьXML, ПараметрыВыполнения.ПространствоИменПакет);
	ЗаписьXML.ЗаписатьНачалоЭлемента("AnalyticsData");
	
	ЗаполнитьАналитики(ЗаписьXML, МенеджерВТ, ПараметрыВыполнения);
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Body
	ЗаписьXML.ЗаписатьКонецЭлемента(); // AnalyticsData
	ЗаписьXML.Закрыть();  
		
	ДанныеАналитикВ_МенеджерВТ(ПараметрыВыполнения.СоответствиеПорядковыхНомеров, МенеджерВТ);
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТИменаАналитик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТУчетныеНомераОбязательств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТХарактеристикиОбязательств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТАналитики_OS_NMA_NPA_ARENDA
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_АналитикиСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТаблицаНомеровАналитик");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование AnalyticsData.xml - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование остатков - начало'"));
	
	ЗаписьXML = Новый ЗаписьXML(); 
	ЗаписьXML.ОткрытьФайл(Каталог + "Data_Balance.xml");	
	ЗаписатьШапкуНачалаЭлемента(ЗаписьXML, ПараметрыВыполнения.ПространствоИменПакет);
	ЗаписьXML.ЗаписатьНачалоЭлемента("DataBalance");
	
	ЗаполнитьОстатки(ЗаписьXML, МенеджерВТ, ПараметрыВыполнения);
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // Body
	ЗаписьXML.ЗаписатьКонецЭлемента(); // DataBalance
	ЗаписьXML.Закрыть();   
	
	Если ПараметрыВыполнения.ИспользоватьСхемуВыгрузки2026 Тогда
		ЗаписьXML = Новый ЗаписьXML(); 
		ЗаписьXML.ОткрытьФайл(Каталог + "DataBalanceReloadPeriods.xml");		
		ЗаписатьШапкуНачалаЭлемента(ЗаписьXML, ПараметрыВыполнения.ПространствоИменПакет);		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DataBalanceRP");
		
		Если ПараметрыВыполнения.ПерезагружаемыеПериоды.Количество() Тогда
			ЗаполнитьОстатки(ЗаписьXML, МенеджерВТ, ПараметрыВыполнения, Истина);
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Body
		ЗаписьXML.ЗаписатьКонецЭлемента(); // DataBalanceRP
		ЗаписьXML.Закрыть(); 
	КонецЕсли;
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование остатков - окончание'"));
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование оборотов - начало'"));
	ЗаполнитьОбороты(Каталог, МенеджерВТ, ПараметрыВыполнения);
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование оборотов - окончание'"));
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Создание архивного файла - начало'"));
	
	РезультатМассив = Новый Массив;
	
	ФайлыВозврата = НайтиФайлы(Каталог, "*.xml");
	Для Каждого ФайлВозврата Из ФайлыВозврата Цикл
		РезультатМассив.Добавить(Новый Структура(ФайлВозврата.ИмяБезРасширения, Новый ДвоичныеДанные(ФайлВозврата.ПолноеИмя)));
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(РезультатМассив), АдресРезультата);
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Создание архивного файла - окончание'"));
	
	УдалитьФайлы(Каталог);
	
	ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Записать(Истина);
	ПараметрыВыполнения.текФабрикаXDTO = Неопределено;
	ПозицияРазделителя = СтрНайти(ИмяФайлаСхемы, ПолучитьРазделительПути(), НаправлениеПоиска.СКонца);
	УдалитьФайлы(ИмяФайлаСхемы);
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'ФОРМИРОВАНИЕ ВЫГРУЗКИ - ОКОНЧАНИЕ'"));
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

Функция ПолучитьТабличныйДокументИзХранилища(СтруктураПараметров,  АдресРезультата) Экспорт
	
	ДокументСсылка = СтруктураПараметров.ДокументСсылка; 
	ИмяДокумента = СтруктураПараметров.ИмяДокумента;
	
	ТабДок = ДокументСсылка[ИмяДокумента].Получить();
	Если ТабДок = Неопределено Тогда
		ТабДок = Новый ТабличныйДокумент;
		Макет = ПолучитьМакет("ПФ_MXL_" + ИмяДокумента);
		Область = Макет.ПолучитьОбласть("СтрокаДанныеОтсутствуют");
		ТабДок.Вывести(Область);
	КонецЕсли;
	ПоместитьВоВременноеХранилище(ТабДок, АдресРезультата); 
	
КонецФункции

Функция СформироватьТабличныеДокументы(СтруктураПараметров,  АдресРезультата) Экспорт
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование печатных форм - начало'"));
	
	ДокументСсылка = СтруктураПараметров.ДокументСсылка;
	ИмяПакета = СтруктураПараметров.ИмяПакета;
	
	МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
	
	ФайлВыгрузки = ПрисоединенныйФайлВыгрузки(ДокументСсылка, ИмяПакета);
	ДанныеФайла = Неопределено;
	Если НЕ ФайлВыгрузки = Неопределено Тогда
		ДанныеФайла = МодульРаботаСФайлами.ДвоичныеДанныеФайла(ФайлВыгрузки);
	КонецЕсли;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("zip");
	Если НЕ ДанныеФайла = Неопределено Тогда
		ДанныеФайла.Записать(ИмяФайла);
	КонецЕсли;
	
	ФайлыДанных = РаспаковатьФайлАрхива(ИмяФайла, ИмяПакета);	
	УдалитьФайлы(ИмяФайла);
	
	ПутьКФайлу = Неопределено;
	
	КэшИдентификаторов = Новый Соответствие;
	Если ФайлыДанных.Файлы.Свойство("AnalyticsData", ПутьКФайлу) Тогда
		ЗагрузитьАналитики(ПутьКФайлу, КэшИдентификаторов);
	КонецЕсли;
	
	ОбъектДокумент = ДокументСсылка.ПолучитьОбъект();	
	
	Если ФайлыДанных.Файлы.Свойство("DataBalanceReloadPeriods", ПутьКФайлу) Тогда
		ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование ПФ_MXL_ДанныеДляПересчетаОстатков - начало'"));
		ЗагрузитьОстаткиПересчет(ПутьКФайлу, ОбъектДокумент, КэшИдентификаторов);
		ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование ПФ_MXL_ДанныеДляПересчетаОстатков - конец'"));
	КонецЕсли;
	
	Если ФайлыДанных.Файлы.Свойство("MO", ПутьКФайлу) Тогда
		ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование ПФ_MXL_ДанныеМО - начало'"));
		ЗагрузитьДанныеМО(ПутьКФайлу, ОбъектДокумент, КэшИдентификаторов);
		ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование ПФ_MXL_ДанныеМО - конец'"));
	КонецЕсли;
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование ПФ_MXL_ДанныеОстатковИОборотов - начало'"));
	ЗагрузитьДанныеОстатковИОборотов(ФайлыДанных.Файлы, ОбъектДокумент, КэшИдентификаторов);
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование ПФ_MXL_ДанныеОстатковИОборотов - конец'"));
	
	ОбъектДокумент.Записать();
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Формирование печатных форм - окончание'"));
	
КонецФункции 

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ВыполнитьВыгрузку", Истина);
	Методы.Вставить("ПолучитьТабличныйДокументИзХранилища", Истина);
	Методы.Вставить("СформироватьТабличныеДокументы", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСМенеджеромВременныхТаблиц

Процедура СформироватьДанныеДляВыгрузки(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.СформироватьДанныеДляВыгрузки(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	НекорректныеГруппыСчетов = ВыполнитьПроверкуГруппировкиСчетов(ПараметрыВыполнения);
	Если НекорректныеГруппыСчетов.Количество() Тогда
		ТекстИсключения = СтрШаблон(НСтр("ru='Обнаружено несоответствие в иерархии счетов ЕПСБУ. 
		|Следующие счета не могут быть группами:
		|%1.'"), СтрСоединить(НекорректныеГруппыСчетов, "; "));
		ОбщегоНазначения.СообщитьПользователю(ТекстИсключения);
		ВызватьИсключение ТекстИсключения;		
	КонецЕсли;
	
	ДанныеВерсии = ПараметрыВыполнения.ВерсияТаксономии;
	Если ДанныеВерсии = Неопределено Тогда
		ВызватьИсключение (НСтр("ru='Отсутствует утвержденная таксономия на начало периода'"));
	КонецЕсли;  
	
	ИспользуютсяИнтеграцииЭБ = Ложь;
	МодульСбораДанныхПереопределяемый.ОпределитьВозможностьИспользованияИнтеграцийЭБ(ИспользуютсяИнтеграцииЭБ); 
	ПараметрыВыполнения.Вставить("ИспользуютсяИнтеграцииЭБ", ИспользуютсяИнтеграцииЭБ);
	ИспользуетсяУчетФинВложений = Константы.ИспользоватьУчетФинансовыхВложений.Получить();
	ПараметрыВыполнения.Вставить("ИспользуетсяУчетФинВложений", ИспользуетсяУчетФинВложений);
	ИспользуетсяБГУСпец = Ложь;
	МодульСбораДанныхПереопределяемый.ОпределитьИспользованиеБГУСпец(ИспользуетсяБГУСпец);
	ПараметрыВыполнения.Вставить("ИспользуетсяБГУСпец", ИспользуетсяБГУСпец);
	
	ПараметрыВыполнения.ТаблицаРеквизитовАналитик = РеквизитыАналитик(ДанныеВерсии);
	ПараметрыВыполнения.ТаблицаРеквизитовАналитик.Индексы.Добавить("Аналитика");
	ПараметрыВыполнения.ТаблицаРеквизитовАналитик.Индексы.Добавить("Используется");
	ПараметрыВыполнения.ТаблицаРеквизитовАналитик.Индексы.Добавить("Обязательный");
	
	МакетОписания = ПолучитьМакет("РаспределениеСчетовПоКЭК");
	ОбластьМакета = МакетОписания.Область(1, 1, МакетОписания.ВысотаТаблицы, МакетОписания.ШиринаТаблицы);
	Построитель = Новый ПостроительЗапроса;
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьМакета);
	Построитель.ИсточникДанных = ИсточникДанных;
	Построитель.Выполнить();
	ТаблицаСчетовПоКЭК = Построитель.Результат.Выгрузить();
	
	МодульСбораДанныхПереопределяемый.ТаблицаСчетовПоКЭК(ТаблицаСчетовПоКЭК);
	ТаблицаКЭК = ТаблицаСчетовПоКЭК.Скопировать(,"ПоКЭК");
	
	МассивКодовПоКЭК = Новый Массив;
	Для Каждого Строка Из ТаблицаКЭК Цикл
		Если Не ПустаяСтрока(Строка.ПоКЭК) Тогда
			МассивКодовПоКЭК.Добавить(Строка.ПоКЭК);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаКЭК000 = ТаблицаСчетовПоКЭК.Скопировать(,"КЭК000");
	МассивКодовКЭК000 = Новый Массив;
	Для Каждого Строка Из ТаблицаКЭК000 Цикл
		Если Не ПустаяСтрока(Строка.КЭК000) Тогда
			МассивКодовКЭК000.Добавить(Строка.КЭК000);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаКЭК00Х = ТаблицаСчетовПоКЭК.Скопировать(,"КЭК00Х");
	МассивКодовКЭК00Х = Новый Массив;
	Для Каждого Строка Из ТаблицаКЭК00Х Цикл
		Если Не ПустаяСтрока(Строка.КЭК00Х) Тогда
			МассивКодовКЭК00Х.Добавить(Строка.КЭК00Х);
		КонецЕсли;
	КонецЦикла;
	
	МодульБухгалтерскийУчет = ОбщегоНазначения.ОбщийМодуль("БухгалтерскийУчет");
	
	ОборотныеСчета	= МодульБухгалтерскийУчет.СписокСчетов(МассивКодовКЭК000);
	СчетаКИСЕ		= МодульБухгалтерскийУчет.СписокСчетов(МассивКодовКЭК00Х);
	
	СчетаПоКЭК		= МодульБухгалтерскийУчет.СписокСчетов(МассивКодовПоКЭК);
	
	СчетаСанкционирования = МодульБухгалтерскийУчет.СписокСчетов(СтрРазделить("501.00,502.00,503.00,504.00,506.00,507.00,508.00", ","));
	
	СчетаИсключенияОС		= МодульБухгалтерскийУчет.СписокСчетов(СтрРазделить("106.00,09", ","));
	МодульСбораДанныхПереопределяемый.СчетаИсключенияОС(СчетаИсключенияОС); 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПерезагружаемыеПериоды", Ложь);
	ПараметрыВыполнения.Вставить("СубконтоНаСчетах", ПолучитьСубконтоНаСчетах(ПараметрыВыполнения));
	ДополнительныеПараметры.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);	
	
	УсловиеСчетаОборотыДт = "";
	УсловиеСчетаОборотыКт = "";
	Для каждого СтрокаСубконто Из ПараметрыВыполнения.СубконтоНаСчетах Цикл
		УсловиеСчетаОборотыДт = УсловиеСчетаОборотыДт + ?(УсловиеСчетаОборотыДт = "", "", " И ") + "НЕ ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт В (&Счета_" + СтрокаСубконто.Идентификатор + ")";	
		УсловиеСчетаОборотыКт = УсловиеСчетаОборотыКт + ?(УсловиеСчетаОборотыКт = "", "", " И ") + "НЕ ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт В (&Счета_" + СтрокаСубконто.Идентификатор + ")";
	КонецЦикла;	
	
	#Область ЗапросДанныхВыгрузки
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиВыгрузкиАналитикМСД.Организация КАК Организация,
	|	НастройкиВыгрузкиАналитикМСД.Счет КАК Счет,
	|	НастройкиВыгрузкиАналитикМСД.Аналитика1 КАК Аналитика1,
	|	НастройкиВыгрузкиАналитикМСД.Аналитика2 КАК Аналитика2,
	|	НастройкиВыгрузкиАналитикМСД.Аналитика3 КАК Аналитика3,
	|	НастройкиВыгрузкиАналитикМСД.Аналитика4 КАК Аналитика4,
	|	НастройкиВыгрузкиАналитикМСД.Аналитика5 КАК Аналитика5,
	|	НастройкиВыгрузкиАналитикМСД.Аналитика6 КАК Аналитика6,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках1
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика1 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОстатках1 КАК ОбязательноВОстатках1,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках2
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика2 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОстатках2 КАК ОбязательноВОстатках2,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках3
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика3 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОстатках3 КАК ОбязательноВОстатках3,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках4
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика4 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОстатках4 КАК ОбязательноВОстатках4,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках5
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика5 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОстатках5 КАК ОбязательноВОстатках5,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках6
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика6 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОстатках6 КАК ОбязательноВОстатках6,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах1
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика1 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОборотах1 КАК ОбязательноВОборотах1,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах2
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика2 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОборотах2 КАК ОбязательноВОборотах2,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах3
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика3 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОборотах3 КАК ОбязательноВОборотах3,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах4
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика4 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОборотах4 КАК ОбязательноВОборотах4,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах5
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика5 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОборотах5 КАК ОбязательноВОборотах5,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах6
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика6 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОборотах6 КАК ОбязательноВОборотах6,
	|	НастройкиВыгрузкиАналитикМСД.ВОстатках1 КАК ВОстатках1,
	|	НастройкиВыгрузкиАналитикМСД.ВОстатках2 КАК ВОстатках2,
	|	НастройкиВыгрузкиАналитикМСД.ВОстатках3 КАК ВОстатках3,
	|	НастройкиВыгрузкиАналитикМСД.ВОстатках4 КАК ВОстатках4,
	|	НастройкиВыгрузкиАналитикМСД.ВОстатках5 КАК ВОстатках5,
	|	НастройкиВыгрузкиАналитикМСД.ВОстатках6 КАК ВОстатках6,
	|	НастройкиВыгрузкиАналитикМСД.ВОборотах1 КАК ВОборотах1,
	|	НастройкиВыгрузкиАналитикМСД.ВОборотах2 КАК ВОборотах2,
	|	НастройкиВыгрузкиАналитикМСД.ВОборотах3 КАК ВОборотах3,
	|	НастройкиВыгрузкиАналитикМСД.ВОборотах4 КАК ВОборотах4,
	|	НастройкиВыгрузкиАналитикМСД.ВОборотах5 КАК ВОборотах5,
	|	НастройкиВыгрузкиАналитикМСД.ВОборотах6 КАК ВОборотах6
	|ПОМЕСТИТЬ ВТТаблицаСвязейАналитик
	|ИЗ
	|	РегистрСведений.НастройкиВыгрузкиАналитикМСД КАК НастройкиВыгрузкиАналитикМСД
	|ГДЕ
	|	НастройкиВыгрузкиАналитикМСД.Версия = &Версия
	|	И НастройкиВыгрузкиАналитикМСД.Организация = &Организация 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	""000"",
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Код КАК Код,
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ1.Ссылка КАК Родитель,
	|	ЕПСБУ2.Ссылка КАК РодительРодитель,
	|	ЕПСБУ.Вид КАК Вид,
	|	ЕПСБУ1.Код КАК КодРодитель,
	|	ЕПСБУ2.Код КАК КодРодтельРодитель,
	|	ЕПСБУ.Забалансовый КАК Забалансовый,
	|	ЕПСБУ.Количественный КАК Количественный
	|ПОМЕСТИТЬ ВТПланСчетов
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ1
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ2
	|			ПО ЕПСБУ1.Родитель = ЕПСБУ2.Ссылка
	|				И (&ДатаНачала МЕЖДУ ЕПСБУ2.ДатаНачалаДействия И ВЫБОР
	|					КОГДА ЕПСБУ2.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДАТАВРЕМЯ(2999, 12, 31, 23, 59, 59)
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕПСБУ2.ДатаОкончанияДействия, ГОД, 1)
	|				КОНЕЦ)
	|		ПО (ВЫБОР
	|				КОГДА ЕПСБУ.Код = ""106.КС""
	|					ТОГДА ЕПСБУ1.Код = ""106.11""
	|				ИНАЧЕ ЕПСБУ.Родитель = ЕПСБУ1.Ссылка
	|			КОНЕЦ)
	|			И (&ДатаНачала МЕЖДУ ЕПСБУ1.ДатаНачалаДействия И ВЫБОР
	|				КОГДА ЕПСБУ1.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(2999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕПСБУ1.ДатаОкончанияДействия, ГОД, 1)
	|			КОНЕЦ)
	|ГДЕ
	|	&ДатаНачала МЕЖДУ ЕПСБУ.ДатаНачалаДействия И ВЫБОР
	|			КОГДА ЕПСБУ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДАТАВРЕМЯ(2999, 12, 31, 23, 59, 59)
	|			ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕПСБУ.ДатаОкончанияДействия, ГОД, 1)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация
	|ПОМЕСТИТЬ ВТОрганизацииФедеральногоБюджета
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Бюджеты КАК Бюджеты
	|		ПО Организации.Бюджет = Бюджеты.Ссылка
	|ГДЕ
	|	Бюджеты.Код = ""00000001""
	|	И Организации.Ссылка = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Бюджеты КАК Бюджеты
	|		ПО Организации.Бюджет = Бюджеты.Ссылка
	|ГДЕ
	|	Бюджеты.Код = ""00000001""
	|	И Организации.УчетПереданныхПолномочий
	|	И Организации.ПолучательПолномочий = &Организация
	|	И НЕ Организации.Ссылка = &Организация
	|	И НЕ Организации.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПеремещениеОСОсновныеСредства.Ссылка КАК Ссылка,
	|	ПеремещениеОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ЛОЖЬ КАК МежотчетныйПериод,
	|   НакладнаяНаВнутреннееПеремещениеОС2.Дата КАК ДатаДокумента
	|ПОМЕСТИТЬ Регистраторы
	|ИЗ
	|	Документ.НакладнаяНаВнутреннееПеремещениеОС2.ОсновныеСредства КАК ПеремещениеОСОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НакладнаяНаВнутреннееПеремещениеОС2 КАК НакладнаяНаВнутреннееПеремещениеОС2
	|		ПО ПеремещениеОСОсновныеСредства.Ссылка = НакладнаяНаВнутреннееПеремещениеОС2.Ссылка
	|ГДЕ
	|	НакладнаяНаВнутреннееПеремещениеОС2.Организация = &Организация
	|	И НакладнаяНаВнутреннееПеремещениеОС2.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НакладнаяНаВнутреннееПеремещениеОС2.Проведен
	|	И НакладнаяНаВнутреннееПеремещениеОС2.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеОС.ПеремещениеОСМеждуСчетами)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПереносОстатковПереводы.Ссылка,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПереносОстатковПереводы.Субконто1) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА ПереносОстатковПереводы.Субконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(ПереносОстатковПереводы.Субконто2) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА ПереносОстатковПереводы.Субконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(ПереносОстатковПереводы.Субконто3) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА ПереносОстатковПереводы.Субконто3
	|	КОНЕЦ,
	|	НЕ ПереносОстатковПоКПС.ВидМежотчетногоПериода = ЗНАЧЕНИЕ(Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка),
	|   ПереносОстатковПоКПС.Дата
	|ИЗ
	|	Документ.ПереносОстатковПоКПС.Переводы КАК ПереносОстатковПереводы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереносОстатковПоКПС КАК ПереносОстатковПоКПС
	|		ПО ПереносОстатковПереводы.Ссылка = ПереносОстатковПоКПС.Ссылка
	|ГДЕ
	|	ПереносОстатковПоКПС.Организация = &Организация
	|	И ПереносОстатковПоКПС.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ПереносОстатковПоКПС.Проведен
	|	И ПереносОстатковПереводы.Счет В ИЕРАРХИИ(&Счет101)" + ?(ИспользуютсяИнтеграцииЭБ, "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПереносОстатковПереводы.Ссылка,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПереносОстатковПереводы.Субконто1) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА ПереносОстатковПереводы.Субконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(ПереносОстатковПереводы.Субконто2) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА ПереносОстатковПереводы.Субконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(ПереносОстатковПереводы.Субконто3) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА ПереносОстатковПереводы.Субконто3
	|	КОНЕЦ,
	|	ИСТИНА,
	|	ПОД_ФК_ДокументыМежотчетногоПериода.ДатаПервичногоОтраженияВУчетеОперацииМО
	|ИЗ
	|	РегистрСведений.ПОД_ФК_ДокументыМежотчетногоПериода КАК ПОД_ФК_ДокументыМежотчетногоПериода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереносОстатковПоКПС.Переводы КАК ПереносОстатковПереводы
	|		ПО ПОД_ФК_ДокументыМежотчетногоПериода.Документ = ПереносОстатковПереводы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПереносОстатковПоКПС КАК ПереносОстатковПоКПС
	|		ПО ПОД_ФК_ДокументыМежотчетногоПериода.Документ = ПереносОстатковПоКПС.Ссылка
	|ГДЕ
	|	ПереносОстатковПоКПС.Организация = &Организация
	|	И ПереносОстатковПоКПС.Проведен
	|	И ПереносОстатковПереводы.Счет В ИЕРАРХИИ(&Счет101)
	|	И ПОД_ФК_ДокументыМежотчетногоПериода.ДатаПервичногоОтраженияВУчетеОперацииМО МЕЖДУ &ДатаНачала И &ДатаОкончания", "") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РН_ОстаткиИОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	РН_ОстаткиИОбороты.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	РН_ОстаткиИОбороты.ЦМО КАК ЦМО,
	|	РН_ОстаткиИОбороты.Договор КАК Договор,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РН_ОстаткиИОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|			ТОГДА ""101.00""
	|		КОГДА РН_ОстаткиИОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|			ТОГДА ""21""
	|		КОГДА РН_ОстаткиИОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении)
	|			ТОГДА ""02""
	|		КОГДА РН_ОстаткиИОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование)
	|			ТОГДА ""01""
	|		КОГДА РН_ОстаткиИОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВУправление)
	|			ТОГДА ""24""
	|		КОГДА РН_ОстаткиИОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду)
	|			ТОГДА ""25""
	|		КОГДА РН_ОстаткиИОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование)
	|			ТОГДА ""26""
	|		КОГДА РН_ОстаткиИОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВЛичноеПользование)
	|			ТОГДА ""27""
	|	КОНЕЦ КАК Счет,
	|	&ДатаНачала КАК Период,
	|	ЛОЖЬ КАК Амортизация,
	|	ЛОЖЬ КАК Обесценение,
	|	РН_ОстаткиИОбороты.КоличествоОстаток КАК КоличествоОборот,
	|	РН_ОстаткиИОбороты.СтоимостьОстаток КАК СтоимостьОборот
	|ПОМЕСТИТЬ ДвиженияРН_ЕстьЦМОДогКон
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(&ДатаНачала, Организация = &Организация) КАК РН_ОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО РН_ОстаткиИОбороты.ОсновноеСредство = Регистраторы.ОсновноеСредство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОС.ОсновноеСредство,
	|	СтоимостьОбъектовОС.ИнвентарныйНомер,
	|	СтоимостьОбъектовОС.ЦМО,
	|	СтоимостьОбъектовОС.Договор КАК Договор,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ВЫБОР
	|		КОГДА СтоимостьОбъектовОС.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|			ТОГДА ""101.00""
	|		КОГДА СтоимостьОбъектовОС.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|			ТОГДА ""21""
	|		КОГДА СтоимостьОбъектовОС.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении)
	|			ТОГДА ""02""
	|		КОГДА СтоимостьОбъектовОС.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование)
	|			ТОГДА ""01""
	|		КОГДА СтоимостьОбъектовОС.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВУправление)
	|			ТОГДА ""24""
	|		КОГДА СтоимостьОбъектовОС.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду)
	|			ТОГДА ""25""
	|		КОГДА СтоимостьОбъектовОС.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование)
	|			ТОГДА ""26""
	|		КОГДА СтоимостьОбъектовОС.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВЛичноеПользование)
	|			ТОГДА ""27""
	|	КОНЕЦ,
	|	СтоимостьОбъектовОС.Период,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СтоимостьОбъектовОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -СтоимостьОбъектовОС.Количество
	|		ИНАЧЕ СтоимостьОбъектовОС.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтоимостьОбъектовОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -СтоимостьОбъектовОС.Стоимость
	|		ИНАЧЕ СтоимостьОбъектовОС.Стоимость
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС КАК СтоимостьОбъектовОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО СтоимостьОбъектовОС.ОсновноеСредство = Регистраторы.ОсновноеСредство
	|ГДЕ
	|	СтоимостьОбъектовОС.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И СтоимостьОбъектовОС.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" +
	Переносы_ПолучитьТекстЗапросаСтоимостьОбъектовОС(ДополнительныеПараметры.ПараметрыВыполнения, МенеджерВТ) + "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСОбороты.Период КАК Период,
	|	СтоимостьОбъектовОСОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОбороты.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СУММА(СтоимостьОбъектовОСОбороты.СтоимостьОборот) КАК СтоимостьОборот,
	|	СУММА(СтоимостьОбъектовОСОбороты.КоличествоОборот) КАК КоличествоОборот,
	|	СтоимостьОбъектовОСОбороты.Амортизация КАК Амортизация,
	|	СтоимостьОбъектовОСОбороты.Обесценение КАК Обесценение,
	|	СтоимостьОбъектовОСОбороты.Счет КАК Счет
	|ПОМЕСТИТЬ ДвиженияРН_НетЦМОДогКон
	|ИЗ
	|	ДвиженияРН_ЕстьЦМОДогКон КАК СтоимостьОбъектовОСОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОбъектовОСОбороты.Обесценение,
	|	СтоимостьОбъектовОСОбороты.Счет,
	|	СтоимостьОбъектовОСОбороты.Амортизация,
	|	СтоимостьОбъектовОСОбороты.Период,
	|	СтоимостьОбъектовОСОбороты.ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОбороты.ОсновноеСредство
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РН_Амортизация.ОсновноеСредство КАК ОсновноеСредство,
	|	РН_Амортизация.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	""104.00"" КАК Счет,
	|	&ДатаНачала КАК Период,
	|	ИСТИНА КАК Амортизация,
	|	ЛОЖЬ КАК Обесценение,
	|	0 КАК КоличествоОборот,
	|	РН_Амортизация.СуммаАмортизацииОстаток КАК СтоимостьОборот
	|ПОМЕСТИТЬ ДвиженияРН_АмортОбесц
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Остатки(&ДатаНачала, Организация = &Организация) КАК РН_Амортизация 
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО РН_Амортизация.ОсновноеСредство = Регистраторы.ОсновноеСредство
	|ГДЕ
	|	РН_Амортизация.СуммаАмортизацииОстаток <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АмортизацияОбъектовОС.ОсновноеСредство,
	|	АмортизацияОбъектовОС.ИнвентарныйНомер,

	|	""104.00"",
	|	АмортизацияОбъектовОС.Период,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	0,
	|	ВЫБОР
	|		КОГДА АмортизацияОбъектовОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -АмортизацияОбъектовОС.СуммаАмортизации
	|		ИНАЧЕ АмортизацияОбъектовОС.СуммаАмортизации
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС КАК АмортизацияОбъектовОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО АмортизацияОбъектовОС.ОсновноеСредство = Регистраторы.ОсновноеСредство
	|ГДЕ
	|	АмортизацияОбъектовОС.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И АмортизацияОбъектовОС.Организация = &Организация
	|	И АмортизацияОбъектовОС.СуммаАмортизации <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РН_Амортизация.ОсновноеСредство,
	|	РН_Амортизация.ИнвентарныйНомер,

	|	""114.00"",
	|	&ДатаНачала,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	0,
	|	РН_Амортизация.СуммаОбесцененияОстаток
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Остатки(&ДатаНачала, Организация = &Организация) КАК РН_Амортизация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО РН_Амортизация.ОсновноеСредство = Регистраторы.ОсновноеСредство
	|ГДЕ
	|	РН_Амортизация.СуммаОбесцененияОстаток <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АмортизацияОбъектовОС.ОсновноеСредство,
	|	АмортизацияОбъектовОС.ИнвентарныйНомер,

	|	""114.00"",
	|	АмортизацияОбъектовОС.Период,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	0,
	|	ВЫБОР
	|		КОГДА АмортизацияОбъектовОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА -АмортизацияОбъектовОС.СуммаОбесценения
	|		ИНАЧЕ АмортизацияОбъектовОС.СуммаОбесценения
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС КАК АмортизацияОбъектовОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО АмортизацияОбъектовОС.ОсновноеСредство = Регистраторы.ОсновноеСредство
	|ГДЕ
	|	АмортизацияОбъектовОС.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И АмортизацияОбъектовОС.Организация = &Организация
	|	И АмортизацияОбъектовОС.СуммаОбесценения <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|		ВЫБОР КОГДА Регистраторы.МежотчетныйПериод ТОГДА Регистраторы.ДатаДокумента ИНАЧЕ ЖурналПроводокЕПСБУДвиженияССубконто.Период КОНЕЦ КАК Период, 
	|		ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор,
	|		ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК ОсновноеСредство,
	|		ЛОЖЬ КАК ЭтоРасход,
	|		ЛОЖЬ КАК Амортизация,
	|		ЛОЖЬ КАК Обесценение,
	|		Регистраторы.МежотчетныйПериод КАК МежотчетныйПериод
	|ПОМЕСТИТЬ ДвиженияБУДоков
	|ИЗ
	|		РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|				,
	|				,
	|				Активность
	|					И СчетДт В ИЕРАРХИИ (&Счет101),
	|				,
	|				) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 = Регистраторы.ОсновноеСредство
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|		ВЫБОР КОГДА Регистраторы.МежотчетныйПериод ТОГДА Регистраторы.ДатаДокумента ИНАЧЕ ЖурналПроводокЕПСБУДвиженияССубконто.Период КОНЕЦ,
	|		ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|		ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1,
	|		ИСТИНА,
	|		ЛОЖЬ,
	|		ЛОЖЬ,
	|		Регистраторы.МежотчетныйПериод
	|ИЗ
	|		РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|				,
	|				,
	|				Активность	
	|					И СчетКт В ИЕРАРХИИ (&Счет101),
	|				,
	|				) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 = Регистраторы.ОсновноеСредство
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|		ВЫБОР КОГДА Регистраторы.МежотчетныйПериод ТОГДА Регистраторы.ДатаДокумента ИНАЧЕ ЖурналПроводокЕПСБУДвиженияССубконто.Период КОНЕЦ,
	|		ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|		ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1,
	|		ЛОЖЬ,
	|		ИСТИНА,
	|		ЛОЖЬ,
	|		Регистраторы.МежотчетныйПериод
	|ИЗ
	|		РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|				,
	|				,
	|				Активность
	|					И СчетКт В ИЕРАРХИИ (&Счет104),
	|				,
	|				) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 = Регистраторы.ОсновноеСредство
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|		ВЫБОР КОГДА Регистраторы.МежотчетныйПериод ТОГДА Регистраторы.ДатаДокумента ИНАЧЕ ЖурналПроводокЕПСБУДвиженияССубконто.Период КОНЕЦ,
	|		ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|		ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1,
	|		ИСТИНА,
	|		ИСТИНА,
	|		ЛОЖЬ,
	|		Регистраторы.МежотчетныйПериод
	|ИЗ
	|		РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|				,
	|				,
	|				Активность
	|					И СчетДт В ИЕРАРХИИ (&Счет104),
	|				,
	|				) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 = Регистраторы.ОсновноеСредство
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|		ВЫБОР КОГДА Регистраторы.МежотчетныйПериод ТОГДА Регистраторы.ДатаДокумента ИНАЧЕ ЖурналПроводокЕПСБУДвиженияССубконто.Период КОНЕЦ,
	|		ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|		ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1,
	|		ЛОЖЬ,
	|		ЛОЖЬ,
	|		ИСТИНА,
	|		Регистраторы.МежотчетныйПериод
	|ИЗ
	|		РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|				,
	|				,
	|				Активность
	|					И СчетКт В ИЕРАРХИИ (&Счет114),
	|				,
	|				) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 = Регистраторы.ОсновноеСредство
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|		ВЫБОР КОГДА Регистраторы.МежотчетныйПериод ТОГДА Регистраторы.ДатаДокумента ИНАЧЕ ЖурналПроводокЕПСБУДвиженияССубконто.Период КОНЕЦ,
	|		ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|		ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1,
	|		ИСТИНА,
	|		ЛОЖЬ,
	|		ИСТИНА,
	|		Регистраторы.МежотчетныйПериод
	|ИЗ
	|		РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|				,
	|				,
	|				Активность
	|					И СчетДт В ИЕРАРХИИ (&Счет114),
	|				,
	|				) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Регистраторы КАК Регистраторы
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 = Регистраторы.ОсновноеСредство
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Движения.Период КАК Период,
	|	Движения.Регистратор КАК Регистратор,
	|	Движения.ОсновноеСредство КАК ОсновноеСредство,
	|	Движения.ЭтоРасход КАК ЭтоРасход,
	|	Движения.Амортизация КАК Амортизация,
	|	Движения.Обесценение КАК Обесценение,
	|	Движения.МежотчетныйПериод КАК МежотчетныйПериод
	|ПОМЕСТИТЬ ДвиженияБУДоковСвернутая
	|ИЗ
	|	ДвиженияБУДоков КАК Движения
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.Период,
	|	Движения.Регистратор,
	|	Движения.ОсновноеСредство,
	|	Движения.ЭтоРасход,
	|	Движения.Амортизация,
	|	Движения.Обесценение,
	|	Движения.МежотчетныйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДвиженияБУДоков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияБУДоков.Период КАК Период,
	|	ДвиженияБУДоков.Регистратор КАК Регистратор,
	|	ДвиженияБУДоков.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(ДвиженияРН.ИнвентарныйНомер, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК ИнвентарныйНомер,
	|	СУММА(ЕСТЬNULL(ДвиженияРН.СтоимостьОборот, 0)) КАК СтоимостьОборот,
	|	СУММА(ЕСТЬNULL(ДвиженияРН.КоличествоОборот, 0)) КАК КоличествоОборот,
	|	ЛОЖЬ КАК Забаланс,
	|	ДвиженияБУДоков.Амортизация КАК Амортизация,
	|	ДвиженияБУДоков.Обесценение КАК Обесценение,
	|	ДвиженияБУДоков.ЭтоРасход КАК ЭтоРасход,
	|	ДвиженияРН.Счет КАК Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ) КАК ГрупповойУчет
	|ПОМЕСТИТЬ ДвиженияБУДоковОбработанная_АмортОбесц
	|ИЗ
	|	ДвиженияБУДоковСвернутая КАК ДвиженияБУДоков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияРН_АмортОбесц КАК ДвиженияРН
	|		ПО ДвиженияБУДоков.ОсновноеСредство = ДвиженияРН.ОсновноеСредство
	|			И ДвиженияБУДоков.Амортизация = ДвиженияРН.Амортизация 
	|			И ДвиженияБУДоков.Обесценение = ДвиженияРН.Обесценение
	|			И ДвиженияБУДоков.Период >= ДвиженияРН.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО ДвиженияБУДоков.ОсновноеСредство = ОсновныеСредства.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияБУДоков.Период,
	|	ДвиженияБУДоков.Регистратор,
	|	ДвиженияБУДоков.ОсновноеСредство,
	|	ЕСТЬNULL(ДвиженияРН.ИнвентарныйНомер, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)),
	|	ДвиженияБУДоков.Амортизация,
	|	ДвиженияБУДоков.Обесценение,
	|	ДвиженияБУДоков.ЭтоРасход,
	|	ДвиженияРН.Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДвиженияРН.КоличествоОборот) <> 0
	|		ИЛИ СУММА(ДвиженияРН.СтоимостьОборот) <> 0)
    |;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияБУДоков.Период КАК Период,
	|	ДвиженияБУДоков.Регистратор КАК Регистратор,
	|	ДвиженияБУДоков.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(ДвиженияРН.ИнвентарныйНомер, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК ИнвентарныйНомер,
	|	ЕСТЬNULL(ДвиженияРН.ЦМО, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)) КАК ЦМО, 
	|	ЕСТЬNULL(ДвиженияРН.Договор, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)) КАК Договор, 
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	СУММА(ЕСТЬNULL(ДвиженияРН.СтоимостьОборот, 0)) КАК СтоимостьОборот,
	|	СУММА(ЕСТЬNULL(ДвиженияРН.КоличествоОборот, 0)) КАК КоличествоОборот,
	|	ЛОЖЬ КАК Забаланс,
	|	ДвиженияБУДоков.Амортизация КАК Амортизация,
	|	ДвиженияБУДоков.Обесценение КАК Обесценение,
	|	ДвиженияБУДоков.ЭтоРасход КАК ЭтоРасход,
	|	ДвиженияРН.Счет КАК Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ) КАК ГрупповойУчет
	|ПОМЕСТИТЬ ДвиженияБУДоковОбработанная_ЕстьЦМОДогКон
	|ИЗ
	|	ДвиженияБУДоковСвернутая КАК ДвиженияБУДоков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияРН_ЕстьЦМОДогКон КАК ДвиженияРН
	|		ПО ДвиженияБУДоков.ОсновноеСредство = ДвиженияРН.ОсновноеСредство
	|			И ДвиженияБУДоков.Амортизация = ДвиженияРН.Амортизация 
	|			И ДвиженияБУДоков.Обесценение = ДвиженияРН.Обесценение
	|			И ДвиженияБУДоков.Период >= ДвиженияРН.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО ДвиженияБУДоков.ОсновноеСредство = ОсновныеСредства.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияБУДоков.Период,
	|	ДвиженияБУДоков.Регистратор,
	|	ДвиженияБУДоков.ОсновноеСредство,
	|	ЕСТЬNULL(ДвиженияРН.ИнвентарныйНомер, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)),
	|	ЕСТЬNULL(ДвиженияРН.ЦМО, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)),
	|	ЕСТЬNULL(ДвиженияРН.Договор, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)),
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ДвиженияБУДоков.Амортизация,
	|	ДвиженияБУДоков.Обесценение,
	|	ДвиженияБУДоков.ЭтоРасход,
	|	ДвиженияРН.Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДвиженияРН.КоличествоОборот) <> 0
	|		ИЛИ СУММА(ДвиженияРН.СтоимостьОборот) <> 0)
    |;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияБУДоков.Период КАК Период,
	|	ДвиженияБУДоков.Регистратор КАК Регистратор,
	|	ДвиженияБУДоков.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(ДвиженияРН.ИнвентарныйНомер, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК ИнвентарныйНомер,
	|	СУММА(ЕСТЬNULL(ДвиженияРН.СтоимостьОборот, 0)) КАК СтоимостьОборот,
	|	СУММА(ЕСТЬNULL(ДвиженияРН.КоличествоОборот, 0)) КАК КоличествоОборот,
	|	ЛОЖЬ КАК Забаланс,
	|	ДвиженияБУДоков.Амортизация КАК Амортизация,
	|	ДвиженияБУДоков.Обесценение КАК Обесценение,
	|	ДвиженияБУДоков.ЭтоРасход КАК ЭтоРасход,
	|	ДвиженияРН.Счет КАК Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ) КАК ГрупповойУчет
	|ПОМЕСТИТЬ ДвиженияБУДоковОбработанная_НетЦМОДогКон
	|ИЗ
	|	ДвиженияБУДоковСвернутая КАК ДвиженияБУДоков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияРН_НетЦМОДогКон КАК ДвиженияРН
	|		ПО ДвиженияБУДоков.ОсновноеСредство = ДвиженияРН.ОсновноеСредство
	|			И ДвиженияБУДоков.Амортизация = ДвиженияРН.Амортизация 
	|			И ДвиженияБУДоков.Обесценение = ДвиженияРН.Обесценение
	|			И ДвиженияБУДоков.Период >= ДвиженияРН.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО ДвиженияБУДоков.ОсновноеСредство = ОсновныеСредства.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияБУДоков.Период,
	|	ДвиженияБУДоков.Регистратор,
	|	ДвиженияБУДоков.ОсновноеСредство,
	|	ЕСТЬNULL(ДвиженияРН.ИнвентарныйНомер, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)),
	|	ДвиженияБУДоков.Амортизация,
	|	ДвиженияБУДоков.Обесценение,
	|	ДвиженияБУДоков.ЭтоРасход,
	|	ДвиженияРН.Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДвиженияРН.КоличествоОборот) <> 0
	|		ИЛИ СУММА(ДвиженияРН.СтоимостьОборот) <> 0)
    |;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" +
	Переносы_ПолучитьТекстЗапросаДвиженияБУДоков(ДополнительныеПараметры.ПараметрыВыполнения) + "
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДвиженияБУДоковСвернутая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СтоимостьОбъектовОСОбороты.Период КАК Период,
	|	СтоимостьОбъектовОСОбороты.Регистратор КАК Регистратор,
	|	СтоимостьОбъектовОСОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОбороты.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОбороты.ЦМО КАК ЦМО,
	|	СтоимостьОбъектовОСОбороты.Договор КАК Договор,
	|	СтоимостьОбъектовОСОбороты.СтоимостьОборот КАК СтоимостьОборот,
	|	СтоимостьОбъектовОСОбороты.КоличествоОборот КАК КоличествоОборот,
	|	НЕ СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе) КАК Забаланс, 
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ЛОЖЬ КАК Амортизация,
	|	ЛОЖЬ КАК Обесценение,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьОбъектовОСОбороты.Регистратор) = ТИП(Документ.СписаниеОбъектовОС)
	|			ТОГДА (СтоимостьОбъектовОСОбороты.СтоимостьРасход > 0 ИЛИ СтоимостьОбъектовОСОбороты.КоличествоРасход > 0)
	|		ИНАЧЕ СтоимостьОбъектовОСОбороты.СтоимостьПриход = 0
	|				И СтоимостьОбъектовОСОбороты.КоличествоПриход = 0
	|	КОНЕЦ КАК ЭтоРасход,
	|	ВЫБОР
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|			ТОГДА ""101.00""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|			ТОГДА ""21""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении)
	|			ТОГДА ""02""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование)
	|			ТОГДА ""01""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВУправление)
	|			ТОГДА ""24""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду)
	|			ТОГДА ""25""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование)
	|			ТОГДА ""26""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВЛичноеПользование)
	|			ТОГДА ""27""
	|	КОНЕЦ КАК Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ) КАК ГрупповойУчет
	|ПОМЕСТИТЬ ВТОборотыОС_ПоИнвентарным_ЕстьЦМОДогКон
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Обороты(&ДатаНачала, &ДатаОкончания, Запись, НЕ ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК СтоимостьОбъектовОСОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО СтоимостьОбъектовОСОбороты.ОсновноеСредство = ОсновныеСредства.Ссылка
	|ГДЕ
	|	НЕ СтоимостьОбъектовОСОбороты.Регистратор В
	|				(ВЫБРАТЬ
	|					ВТ_МОРегистраторы.Документ
	|				ИЗ
	|					ВТ_МОРегистраторы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МОРегистраторы.ДатаПервичногоОтраженияВУчетеОперацииМО КАК Период,
	|	СтоимостьОбъектовОСОбороты.Регистратор КАК Регистратор,
	|	СтоимостьОбъектовОСОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОбороты.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОбороты.ЦМО КАК ЦМО,
	|	СтоимостьОбъектовОСОбороты.Договор КАК Договор,
	|	СтоимостьОбъектовОСОбороты.СтоимостьОборот КАК СтоимостьОборот,
	|	СтоимостьОбъектовОСОбороты.КоличествоОборот КАК КоличествоОборот,
	|	НЕ СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе) КАК Забаланс, 
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ЛОЖЬ КАК Амортизация,
	|	ЛОЖЬ КАК Обесценение,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьОбъектовОСОбороты.Регистратор) = ТИП(Документ.СписаниеОбъектовОС)
	|			ТОГДА (СтоимостьОбъектовОСОбороты.СтоимостьРасход > 0 ИЛИ СтоимостьОбъектовОСОбороты.КоличествоРасход > 0)
	|		ИНАЧЕ СтоимостьОбъектовОСОбороты.СтоимостьПриход = 0
	|				И СтоимостьОбъектовОСОбороты.КоличествоПриход = 0
	|	КОНЕЦ КАК ЭтоРасход,
	|	ВЫБОР
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|			ТОГДА ""101.00""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|			ТОГДА ""21""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении)
	|			ТОГДА ""02""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование)
	|			ТОГДА ""01""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВУправление)
	|			ТОГДА ""24""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду)
	|			ТОГДА ""25""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование)
	|			ТОГДА ""26""
	|		КОГДА СтоимостьОбъектовОСОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВЛичноеПользование)
	|			ТОГДА ""27""
	|	КОНЕЦ КАК Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ) КАК ГрупповойУчет
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Обороты(,, Запись, НЕ ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК СтоимостьОбъектовОСОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО СтоимостьОбъектовОСОбороты.ОсновноеСредство = ОсновныеСредства.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МОРегистраторы КАК ВТ_МОРегистраторы
	|		ПО СтоимостьОбъектовОСОбороты.Регистратор = ВТ_МОРегистраторы.Документ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.Период,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.Регистратор,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.ОсновноеСредство,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.ИнвентарныйНомер,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.ЦМО,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.Договор,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.СтоимостьОборот,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.КоличествоОборот,
	|	НЕ СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе),
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.Контрагент,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьОбъектовОСПоКонтрагентамОбороты.Регистратор) = ТИП(Документ.СписаниеОбъектовОС)
	|			ТОГДА (СтоимостьОбъектовОСПоКонтрагентамОбороты.СтоимостьРасход > 0 ИЛИ СтоимостьОбъектовОСПоКонтрагентамОбороты.КоличествоРасход > 0)
	|		ИНАЧЕ СтоимостьОбъектовОСПоКонтрагентамОбороты.СтоимостьПриход = 0
	|		И СтоимостьОбъектовОСПоКонтрагентамОбороты.КоличествоПриход = 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|			ТОГДА ""101.00""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|			ТОГДА ""21""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении)
	|			ТОГДА ""02""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование)
	|			ТОГДА ""01""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВУправление)
	|			ТОГДА ""24""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду)
	|			ТОГДА ""25""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование)
	|			ТОГДА ""26""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВЛичноеПользование)
	|			ТОГДА ""27""
	|	КОНЕЦ,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам.Обороты(&ДатаНачала, &ДатаОкончания, Запись, НЕ ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК СтоимостьОбъектовОСПоКонтрагентамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО СтоимостьОбъектовОСПоКонтрагентамОбороты.ОсновноеСредство = ОсновныеСредства.Ссылка
	|ГДЕ
	|	НЕ СтоимостьОбъектовОСПоКонтрагентамОбороты.Регистратор В
	|				(ВЫБРАТЬ
	|					ВТ_МОРегистраторы.Документ
	|				ИЗ
	|					ВТ_МОРегистраторы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МОРегистраторы.ДатаПервичногоОтраженияВУчетеОперацииМО,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.Регистратор,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.ОсновноеСредство,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.ИнвентарныйНомер,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.ЦМО,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.Договор,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.СтоимостьОборот,
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.КоличествоОборот,
	|	НЕ СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе),
	|	СтоимостьОбъектовОСПоКонтрагентамОбороты.Контрагент,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьОбъектовОСПоКонтрагентамОбороты.Регистратор) = ТИП(Документ.СписаниеОбъектовОС)
	|			ТОГДА (СтоимостьОбъектовОСПоКонтрагентамОбороты.СтоимостьРасход > 0 ИЛИ СтоимостьОбъектовОСПоКонтрагентамОбороты.КоличествоРасход > 0)
	|		ИНАЧЕ СтоимостьОбъектовОСПоКонтрагентамОбороты.СтоимостьПриход = 0
	|		И СтоимостьОбъектовОСПоКонтрагентамОбороты.КоличествоПриход = 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|			ТОГДА ""101.00""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|			ТОГДА ""21""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении)
	|			ТОГДА ""02""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование)
	|			ТОГДА ""01""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВУправление)
	|			ТОГДА ""24""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду)
	|			ТОГДА ""25""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование)
	|			ТОГДА ""26""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОбороты.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВЛичноеПользование)
	|			ТОГДА ""27""
	|	КОНЕЦ,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам.Обороты(, , Запись, НЕ ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК СтоимостьОбъектовОСПоКонтрагентамОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО СтоимостьОбъектовОСПоКонтрагентамОбороты.ОсновноеСредство = ОсновныеСредства.Ссылка 
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МОРегистраторы КАК ВТ_МОРегистраторы
	|		ПО СтоимостьОбъектовОСПоКонтрагентамОбороты.Регистратор = ВТ_МОРегистраторы.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" +
	Обороты_ПолучитьТекстЗапросаСтоимостьОбъектовОС(ДополнительныеПараметры.ПараметрыВыполнения) + " 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСОбороты.Период КАК Период,
	|	СтоимостьОбъектовОСОбороты.Регистратор КАК Регистратор,
	|	СтоимостьОбъектовОСОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОбороты.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СУММА(СтоимостьОбъектовОСОбороты.СтоимостьОборот) КАК СтоимостьОборот,
	|	СУММА(СтоимостьОбъектовОСОбороты.КоличествоОборот) КАК КоличествоОборот,
	|	СтоимостьОбъектовОСОбороты.Забаланс КАК Забаланс,
	|	СтоимостьОбъектовОСОбороты.Амортизация КАК Амортизация,
	|	СтоимостьОбъектовОСОбороты.Обесценение КАК Обесценение,
	|	СтоимостьОбъектовОСОбороты.ЭтоРасход КАК ЭтоРасход,
	|	СтоимостьОбъектовОСОбороты.Счет КАК Счет,
	|	СтоимостьОбъектовОСОбороты.ГрупповойУчет КАК ГрупповойУчет
	|ПОМЕСТИТЬ ВТОборотыОС_ПоИнвентарным_НетЦМОДогКон
	|ИЗ
	|	ВТОборотыОС_ПоИнвентарным_ЕстьЦМОДогКон КАК СтоимостьОбъектовОСОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОбъектовОСОбороты.Обесценение,
	|	СтоимостьОбъектовОСОбороты.Счет,
	|	СтоимостьОбъектовОСОбороты.ЭтоРасход,
	|	СтоимостьОбъектовОСОбороты.ГрупповойУчет,
	|	СтоимостьОбъектовОСОбороты.Забаланс,
	|	СтоимостьОбъектовОСОбороты.Амортизация,
	|	СтоимостьОбъектовОСОбороты.Период,
	|	СтоимостьОбъектовОСОбороты.Регистратор,
	|	СтоимостьОбъектовОСОбороты.ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОбороты.ОсновноеСредство
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	АмортизацияОбъектовОСОбороты.Период КАК Период,
	|	АмортизацияОбъектовОСОбороты.Регистратор КАК Регистратор,
	|	АмортизацияОбъектовОСОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	АмортизацияОбъектовОСОбороты.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка) КАК ЦМО,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка) КАК Договор,
	|	СУММА(-АмортизацияОбъектовОСОбороты.СуммаАмортизацииОборот) КАК СтоимостьОборот,
	|	0 КАК КоличествоОборот,
	|	ЛОЖЬ КАК Забаланс,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ИСТИНА КАК Амортизация,
	|	ЛОЖЬ КАК Обесценение,
	|	-АмортизацияОбъектовОСОбороты.СуммаАмортизацииОборот < 0 КАК ЭтоРасход,
	|	""104.00"" КАК Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ) КАК ГрупповойУчет
	|ПОМЕСТИТЬ ВТОборотыОС_ПоИнвентарным_АмортОбесц
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Обороты(&ДатаНачала, &ДатаОкончания, Запись, НЕ ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК АмортизацияОбъектовОСОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО АмортизацияОбъектовОСОбороты.ОсновноеСредство = ОсновныеСредства.Ссылка
	|ГДЕ
	|	НЕ АмортизацияОбъектовОСОбороты.СуммаАмортизацииОборот = 0
	|	И НЕ АмортизацияОбъектовОСОбороты.Регистратор В
	|				(ВЫБРАТЬ
	|					ВТ_МОРегистраторы.Документ
	|				ИЗ
	|					ВТ_МОРегистраторы)
	|СГРУППИРОВАТЬ ПО
	|	АмортизацияОбъектовОСОбороты.Период,
	|	АмортизацияОбъектовОСОбороты.Регистратор,
	|	АмортизацияОбъектовОСОбороты.ОсновноеСредство,
	|	АмортизацияОбъектовОСОбороты.ИнвентарныйНомер,
	|	-АмортизацияОбъектовОСОбороты.СуммаАмортизацииОборот < 0,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	| 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МОРегистраторы.ДатаПервичногоОтраженияВУчетеОперацииМО,
	|	АмортизацияОбъектовОСОбороты.Регистратор,
	|	АмортизацияОбъектовОСОбороты.ОсновноеСредство,
	|	АмортизацияОбъектовОСОбороты.ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	СУММА(-АмортизацияОбъектовОСОбороты.СуммаАмортизацииОборот),
	|	0,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	-АмортизацияОбъектовОСОбороты.СуммаАмортизацииОборот < 0,
	|	""104.00"",
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Обороты(,, Запись, НЕ ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК АмортизацияОбъектовОСОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО АмортизацияОбъектовОСОбороты.ОсновноеСредство = ОсновныеСредства.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МОРегистраторы КАК ВТ_МОРегистраторы
	|		ПО АмортизацияОбъектовОСОбороты.Регистратор = ВТ_МОРегистраторы.Документ
	|ГДЕ
	|	НЕ АмортизацияОбъектовОСОбороты.СуммаАмортизацииОборот = 0
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МОРегистраторы.ДатаПервичногоОтраженияВУчетеОперацииМО,
	|	АмортизацияОбъектовОСОбороты.Регистратор,
	|	АмортизацияОбъектовОСОбороты.ОсновноеСредство,
	|	АмортизацияОбъектовОСОбороты.ИнвентарныйНомер,
	|	-АмортизацияОбъектовОСОбороты.СуммаАмортизацииОборот < 0,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АмортизацияОбъектовОСОбороты.Период,
	|	АмортизацияОбъектовОСОбороты.Регистратор,
	|	АмортизацияОбъектовОСОбороты.ОсновноеСредство,
	|	АмортизацияОбъектовОСОбороты.ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	СУММА(-АмортизацияОбъектовОСОбороты.СуммаОбесцененияОборот),
	|	0,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	-АмортизацияОбъектовОСОбороты.СуммаОбесцененияОборот < 0,
	|	""114.00"",
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Обороты(&ДатаНачала, &ДатаОкончания, Запись, НЕ ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК АмортизацияОбъектовОСОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО АмортизацияОбъектовОСОбороты.ОсновноеСредство = ОсновныеСредства.Ссылка
	|ГДЕ
	|	НЕ АмортизацияОбъектовОСОбороты.СуммаОбесцененияОборот = 0
	|	И НЕ АмортизацияОбъектовОСОбороты.Регистратор В
	|				(ВЫБРАТЬ
	|					ВТ_МОРегистраторы.Документ
	|				ИЗ
	|					ВТ_МОРегистраторы)
	|СГРУППИРОВАТЬ ПО
	|	АмортизацияОбъектовОСОбороты.Период,
	|	АмортизацияОбъектовОСОбороты.Регистратор,
	|	АмортизацияОбъектовОСОбороты.ОсновноеСредство,
	|	АмортизацияОбъектовОСОбороты.ИнвентарныйНомер,
	|	-АмортизацияОбъектовОСОбороты.СуммаОбесцененияОборот < 0,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_МОРегистраторы.ДатаПервичногоОтраженияВУчетеОперацииМО,
	|	АмортизацияОбъектовОСОбороты.Регистратор,
	|	АмортизацияОбъектовОСОбороты.ОсновноеСредство,
	|	АмортизацияОбъектовОСОбороты.ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	СУММА(-АмортизацияОбъектовОСОбороты.СуммаОбесцененияОборот),
	|	0,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	-АмортизацияОбъектовОСОбороты.СуммаОбесцененияОборот < 0,
	|	""114.00"",
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Обороты(,, Запись, НЕ ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК АмортизацияОбъектовОСОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО АмортизацияОбъектовОСОбороты.ОсновноеСредство = ОсновныеСредства.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МОРегистраторы КАК ВТ_МОРегистраторы
	|		ПО АмортизацияОбъектовОСОбороты.Регистратор = ВТ_МОРегистраторы.Документ
	|ГДЕ
	|	НЕ АмортизацияОбъектовОСОбороты.СуммаОбесцененияОборот = 0
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МОРегистраторы.ДатаПервичногоОтраженияВУчетеОперацииМО,
	|	АмортизацияОбъектовОСОбороты.Регистратор,
	|	АмортизацияОбъектовОСОбороты.ОсновноеСредство,
	|	АмортизацияОбъектовОСОбороты.ИнвентарныйНомер,
	|	-АмортизацияОбъектовОСОбороты.СуммаОбесцененияОборот < 0,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////" + 
	ПолучитьВТ_ЕПСБУВидыСубконто(ПараметрыВыполнения) + "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Период КАК Период,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Организация КАК Организация,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт КАК КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт КАК КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КЭККт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СуммаОборот, 0) КАК Сумма,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоОборотДт, 0) КАК КоличествоДт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоОборотКт, 0) КАК КоличествоКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт КАК ВалютаДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт КАК ВалютаКт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаОборотДт, 0) КАК ВалютнаяСуммаДт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаОборотКт, 0) КАК ВалютнаяСуммаКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СубСчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СубСчетКт,
	|	(ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор) = ТИП(Документ.НакладнаяНаВнутреннееПеремещениеОС2) И ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.НакладнаяНаВнутреннееПеремещениеОС2).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеОС.ПеремещениеОСМеждуСчетами))
	|		ИЛИ ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор) = ТИП(Документ.ПереносОстатковПоКПС) КАК ПолучитьИнвНомер,
	|	ЛОЖЬ КАК МежотчетныйПериод,
	|	ЛОЖЬ КАК ЗаключениеСчетов
	|ПОМЕСТИТЬ ВТ_ЖурналПроводокЕПСБУДвиженияССубконто_Предварительно
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(&ДатаНачала, &ДатаОкончания, Запись, , , , , ) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.Организация = ВТОрганизацииФедеральногоБюджета.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Период,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Организация,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СуммаОборот, 0),
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоОборотДт, 0),
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоОборотКт, 0),
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаОборотДт, 0),
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаОборотКт, 0),
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт, 
	|	(ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор) = ТИП(Документ.НакладнаяНаВнутреннееПеремещениеОС2) И ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.НакладнаяНаВнутреннееПеремещениеОС2).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеОС.ПеремещениеОСМеждуСчетами))
	|		ИЛИ ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор) = ТИП(Документ.ПереносОстатковПоКПС) КАК ПолучитьИнвНомер,
	|	ЛОЖЬ,
	|	ИСТИНА
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(&ДатаНачала, &ДатаОкончанияГраницаЗакрытие, Запись, , , , , ) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.Организация = ВТОрганизацииФедеральногоБюджета.Организация
	|ГДЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.УточнениеПериода = 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_МОРегистраторы.ДатаПервичногоОтраженияВУчетеОперацииМО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Организация,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма, 0),
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт, 0),
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт, 0),
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаДт, 0),
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаКт, 0),
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	(ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор) = ТИП(Документ.НакладнаяНаВнутреннееПеремещениеОС2) И ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.НакладнаяНаВнутреннееПеремещениеОС2).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеОС.ПеремещениеОСМеждуСчетами))
	|		ИЛИ ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор) = ТИП(Документ.ПереносОстатковПоКПС) КАК ПолучитьИнвНомер,
	|	ИСТИНА,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(, , Активность И Регистратор В (ВЫБРАТЬ ВТ_МОРегистраторы.Документ ИЗ ВТ_МОРегистраторы), , ) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.Организация = ВТОрганизацииФедеральногоБюджета.Организация 
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МОРегистраторы КАК ВТ_МОРегистраторы
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор = ВТ_МОРегистраторы.Документ
	|ГДЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.УточнениеПериода = 7
	|	ИЛИ (ЖурналПроводокЕПСБУДвиженияССубконто.УточнениеПериода = 4
	|				И (ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт В ИЕРАРХИИ (&СчетаСанкционирования)
	|					ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт В ИЕРАРХИИ (&СчетаСанкционирования)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////  
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Период КАК Период,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Организация КАК Организация,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт КАК КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт КАК КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КЭККт," +
	СтрЗаменить(СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаСубконто(), "
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1"), 
	"%ИмяВТ", "ЖурналПроводокЕПСБУДвиженияССубконто"), "%Суффикс", "Дт") + " КАК СубконтоДт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3," +
	СтрЗаменить(СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаСубконто(), "
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1"), 
	"%ИмяВТ", "ЖурналПроводокЕПСБУДвиженияССубконто"), "%Суффикс", "Кт") + " КАК СубконтоКт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма КАК Сумма,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт КАК КоличествоДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт КАК КоличествоКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт КАК ВалютаДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт КАК ВалютаКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СубСчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СубСчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ПолучитьИнвНомер КАК ПолучитьИнвНомер,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.МежотчетныйПериод КАК МежотчетныйПериод,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ЗаключениеСчетов КАК ЗаключениеСчетов
	|ПОМЕСТИТЬ ВТ_ЖурналПроводокЕПСБУДвиженияССубконто
	|ИЗ
	|	ВТ_ЖурналПроводокЕПСБУДвиженияССубконто_Предварительно КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.Организация = ВТОрганизацииФедеральногоБюджета.Организация
	|ГДЕ
	|	" + УсловиеСчетаОборотыДт + " И " + УсловиеСчетаОборотыКт + 
	ПолучитьТекстЗапросаОбороты(ДополнительныеПараметры.ПараметрыВыполнения) + " 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_МОРегистраторы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////	
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Период КАК Период,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Организация КАК Организация,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт КАК КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт КАК КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КЭККт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК Сумма,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт) КАК КоличествоДт,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт) КАК КоличествоКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт КАК ВалютаДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт КАК ВалютаКт,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаДт) КАК ВалютнаяСуммаДт,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаКт) КАК ВалютнаяСуммаКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубСчетДт КАК СубСчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубСчетКт КАК СубСчетКт,
	|	" + ПолучитьТекстЗапросаТипКБК("КлассификационныеПризнакиСчетов_Дт") + " КАК ТипКПСДт,
	|	" + ПолучитьТекстЗапросаТипКБК("КлассификационныеПризнакиСчетов_Кт") + " КАК ТипКПСКт," + 
	?(ПараметрыВыполнения.ИспользуетсяБГУСпец, СтрЗаменить(МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконто(), "%Суффикс", "Дт"), "
	|	ЕПСБУВидыСубконтоДт1.ВидСубконто") + " КАК ВидСубконтоДт1,
	|	ЕПСБУВидыСубконтоДт2.ВидСубконто КАК ВидСубконтоДт2,
	|	ЕПСБУВидыСубконтоДт3.ВидСубконто КАК ВидСубконтоДт3," + 
	?(ПараметрыВыполнения.ИспользуетсяБГУСпец, СтрЗаменить(МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконто(), "%Суффикс", "Кт"), "
	|	ЕПСБУВидыСубконтоКт1.ВидСубконто") + " КАК ВидСубконтоКт1,
	|	ЕПСБУВидыСубконтоКт2.ВидСубконто КАК ВидСубконтоКт2,
	|	ЕПСБУВидыСубконтоКт3.ВидСубконто КАК ВидСубконтоКт3,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|		ИЛИ ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|		ИЛИ ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО), ЛОЖЬ) КАК ЕстьЦМО_Дт,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|		ИЛИ ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|		ИЛИ ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО), ЛОЖЬ) КАК ЕстьЦМО_Кт,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)" + 
	СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|		ИЛИ " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение(), ""), "%Суффикс", "Дт") + "
	|		ИЛИ ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|		ИЛИ ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры), ЛОЖЬ) КАК ЕстьДоговоры_Дт,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)" + 
	СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|		ИЛИ " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение(), ""), "%Суффикс", "Кт") + "
	|		ИЛИ ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|		ИЛИ ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры), ЛОЖЬ) КАК ЕстьДоговоры_Кт,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|		ИЛИ ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|		ИЛИ ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты), ЛОЖЬ) КАК ЕстьКонтрагенты_Дт,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|		ИЛИ ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|		ИЛИ ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты), ЛОЖЬ) КАК ЕстьКонтрагенты_Кт,
	|	ПОДСТРОКА(ВТПланСчетовДт.Код, 1, 3) = ""104"" КАК АмортизацияДт,
	|	ПОДСТРОКА(ВТПланСчетовКт.Код, 1, 3) = ""104"" КАК АмортизацияКт,
	|	ПОДСТРОКА(ВТПланСчетовДт.Код, 1, 3) = ""114"" КАК ОбесценениеДт,
	|	ПОДСТРОКА(ВТПланСчетовКт.Код, 1, 3) = ""114"" КАК ОбесценениеКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТПланСчетовДт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовДт.КодРодитель, ВТПланСчетовДт.Код)) = ""102.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетовДт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовДт.КодРодитель, ВТПланСчетовДт.Код)) = ""103.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетовДт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовДт.КодРодитель, ВТПланСчетовДт.Код)) = ""111.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетовДт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовДт.КодРодитель, ВТПланСчетовДт.Код)) = ""108.00""
	|			ТОГДА ""101.00""
	|		ИНАЧЕ ЕСТЬNULL(ВТПланСчетовДт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовДт.КодРодитель, ВТПланСчетовДт.Код))
	|	КОНЕЦ КАК КодВерхнегоУровняДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТПланСчетовКт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовКт.КодРодитель, ВТПланСчетовКт.Код)) = ""102.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетовКт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовКт.КодРодитель, ВТПланСчетовКт.Код)) = ""103.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетовКт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовКт.КодРодитель, ВТПланСчетовКт.Код)) = ""111.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетовКт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовКт.КодРодитель, ВТПланСчетовКт.Код)) = ""108.00""
	|			ТОГДА ""101.00""
	|		ИНАЧЕ ЕСТЬNULL(ВТПланСчетовКт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовКт.КодРодитель, ВТПланСчетовКт.Код))
	|	КОНЕЦ КАК КодВерхнегоУровняКт,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)
	|	КОНЕЦ КАК ЦМО_Дт,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка) 
	|	КОНЕЦ КАК ЦМО_Кт,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|	КОНЕЦ КАК ОС_Дт,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|	КОНЕЦ КАК ОС_Кт,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагенты_Дт,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагенты_Кт,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))" + 
	СтрЗаменить(СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|		КОГДА " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение() + "
	|			ТОГДА " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаСубконтоВыражение(), ""), "%ИмяВТ", "ЖурналПроводокЕПСБУДвиженияССубконто"), "%Суффикс", "Дт") + "
	|		КОГДА ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ КАК Договоры_Дт,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))" + 
	СтрЗаменить(СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|		КОГДА " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение() + "
	|			ТОГДА " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаСубконтоВыражение(), ""), "%ИмяВТ", "ЖурналПроводокЕПСБУДвиженияССубконто"), "%Суффикс", "Кт") + "
	|		КОГДА ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ КАК Договоры_Кт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ПолучитьИнвНомер КАК ПолучитьИнвНомер,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.МежотчетныйПериод КАК МежотчетныйПериод,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ЗаключениеСчетов КАК ЗаключениеСчетов
	|ПОМЕСТИТЬ ВТОбороты_Общие_Предварительно
	|ИЗ
	|	ВТ_ЖурналПроводокЕПСБУДвиженияССубконто КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификационныеПризнакиСчетов КАК КлассификационныеПризнакиСчетов_Дт
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт = КлассификационныеПризнакиСчетов_Дт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификационныеПризнакиСчетов КАК КлассификационныеПризнакиСчетов_Кт
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт = КлассификационныеПризнакиСчетов_Кт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконтоДт1
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубСчетДт = ЕПСБУВидыСубконтоДт1.Ссылка
	|			И (ЕПСБУВидыСубконтоДт1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконтоДт2
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубСчетДт = ЕПСБУВидыСубконтоДт2.Ссылка
	|			И (ЕПСБУВидыСубконтоДт2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконтоДт3
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубСчетДт = ЕПСБУВидыСубконтоДт3.Ссылка
	|			И (ЕПСБУВидыСубконтоДт3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконтоКт1
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубСчетКт = ЕПСБУВидыСубконтоКт1.Ссылка
	|			И (ЕПСБУВидыСубконтоКт1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконтоКт2
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубСчетКт = ЕПСБУВидыСубконтоКт2.Ссылка
	|			И (ЕПСБУВидыСубконтоКт2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконтоКт3
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубСчетКт = ЕПСБУВидыСубконтоКт3.Ссылка
	|			И (ЕПСБУВидыСубконтоКт3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ВТПланСчетовДт
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт = ВТПланСчетовДт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ВТПланСчетовКт
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт = ВТПланСчетовКт.Ссылка 
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Период,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Организация,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубСчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СубСчетКт," + 
	?(ПараметрыВыполнения.ИспользуетсяБГУСпец, СтрЗаменить(МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконто(), "%Суффикс", "Дт"), "
	|	ЕПСБУВидыСубконтоДт1.ВидСубконто") + ",
	|	ЕПСБУВидыСубконтоДт2.ВидСубконто,
	|	ЕПСБУВидыСубконтоДт3.ВидСубконто," + 
	?(ПараметрыВыполнения.ИспользуетсяБГУСпец, СтрЗаменить(МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконто(), "%Суффикс", "Кт"), "
	|	ЕПСБУВидыСубконтоКт1.ВидСубконто") + ",
	|	ЕПСБУВидыСубконтоКт2.ВидСубконто,
	|	ЕПСБУВидыСубконтоКт3.ВидСубконто,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ИЛИ ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ИЛИ ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО), ЛОЖЬ),
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ИЛИ ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ИЛИ ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО), ЛОЖЬ),
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)" + 
	СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|			ИЛИ " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение(), ""), "%Суффикс", "Дт") + "
	|			ИЛИ ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ИЛИ ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры), ЛОЖЬ),
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)" + 
	СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|			ИЛИ " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение(), ""), "%Суффикс", "Кт") + "
	|			ИЛИ ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ИЛИ ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры), ЛОЖЬ),
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ИЛИ ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ИЛИ ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты), ЛОЖЬ),
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ИЛИ ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ИЛИ ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты), ЛОЖЬ),
	|	ПОДСТРОКА(ВТПланСчетовДт.Код, 1, 3) = ""104"",
	|	ПОДСТРОКА(ВТПланСчетовКт.Код, 1, 3) = ""104"",
	|	ПОДСТРОКА(ВТПланСчетовДт.Код, 1, 3) = ""114"",
	|	ПОДСТРОКА(ВТПланСчетовКт.Код, 1, 3) = ""114"",
	|	" + ПолучитьТекстЗапросаТипКБК("КлассификационныеПризнакиСчетов_Дт") + ",
	|	" + ПолучитьТекстЗапросаТипКБК("КлассификационныеПризнакиСчетов_Кт") + ",
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТПланСчетовКт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовКт.КодРодитель, ВТПланСчетовКт.Код)) = ""102.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетовКт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовКт.КодРодитель, ВТПланСчетовКт.Код)) = ""103.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетовКт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовКт.КодРодитель, ВТПланСчетовКт.Код)) = ""111.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетовКт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовКт.КодРодитель, ВТПланСчетовКт.Код)) = ""108.00""
	|			ТОГДА ""101.00""
	|		ИНАЧЕ ЕСТЬNULL(ВТПланСчетовКт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовКт.КодРодитель, ВТПланСчетовКт.Код))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТПланСчетовДт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовДт.КодРодитель, ВТПланСчетовДт.Код)) = ""102.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетовДт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовДт.КодРодитель, ВТПланСчетовДт.Код)) = ""103.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетовДт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовДт.КодРодитель, ВТПланСчетовДт.Код)) = ""111.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетовДт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовДт.КодРодитель, ВТПланСчетовДт.Код)) = ""108.00""
	|			ТОГДА ""101.00""
	|		ИНАЧЕ ЕСТЬNULL(ВТПланСчетовДт.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетовДт.КодРодитель, ВТПланСчетовДт.Код))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоДт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))" + 
	СтрЗаменить(СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|		КОГДА " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение() + "
	|			ТОГДА " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаСубконтоВыражение(), ""), "%ИмяВТ", "ЖурналПроводокЕПСБУДвиженияССубконто"), "%Суффикс", "Дт") + "
	|		КОГДА ЕПСБУВидыСубконтоДт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоДт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕПСБУВидыСубконтоКт1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))" + 
	СтрЗаменить(СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|		КОГДА " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение() + "
	|			ТОГДА " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаСубконтоВыражение(), ""), "%ИмяВТ", "ЖурналПроводокЕПСБУДвиженияССубконто"), "%Суффикс", "Кт") + "
	|		КОГДА ЕПСБУВидыСубконтоКт2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))
	|		КОГДА ЕПСБУВидыСубконтоКт3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ПолучитьИнвНомер,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.МежотчетныйПериод,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ЗаключениеСчетов
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВТОбороты_Общие_Предварительно.Период, ДЕНЬ) КАК Период,
	|	ВТОбороты_Общие_Предварительно.Организация КАК Организация,
	|	ВТОбороты_Общие_Предварительно.СчетДт КАК СчетДт,
	|	ВТОбороты_Общие_Предварительно.СчетКт КАК СчетКт,
	|	ВТОбороты_Общие_Предварительно.КФО КАК КФО,
	|	ВТОбороты_Общие_Предварительно.КПСДт КАК КПСДт,
	|	ВТОбороты_Общие_Предварительно.КПСКт КАК КПСКт,
	|	ВТОбороты_Общие_Предварительно.КЭКДт КАК КЭКДт,
	|	ВТОбороты_Общие_Предварительно.КЭККт КАК КЭККт,
	|	ВЫБОР
	|		КОГДА ВТОбороты_Общие_Предварительно.ВидСубконтоДт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Дт", "ИнвентарныйНомер", "СубконтоДт1", ПараметрыВыполнения) + "
	|		ИНАЧЕ ВТОбороты_Общие_Предварительно.СубконтоДт1
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА ВТОбороты_Общие_Предварительно.ВидСубконтоДт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Дт", "ИнвентарныйНомер", "СубконтоДт2", ПараметрыВыполнения) + "
	|		ИНАЧЕ ВТОбороты_Общие_Предварительно.СубконтоДт2
	|	КОНЕЦ КАК СубконтоДт2, 
	|	ВЫБОР
	|		КОГДА ВТОбороты_Общие_Предварительно.ВидСубконтоДт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Дт", "ИнвентарныйНомер", "СубконтоДт3", ПараметрыВыполнения) + "
	|		ИНАЧЕ ВТОбороты_Общие_Предварительно.СубконтоДт3
	|	КОНЕЦ КАК СубконтоДт3,
	|	ВЫБОР
	|		КОГДА ВТОбороты_Общие_Предварительно.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Кт", "ИнвентарныйНомер", "СубконтоКт1", ПараметрыВыполнения) + "
	|		ИНАЧЕ ВТОбороты_Общие_Предварительно.СубконтоКт1
	|	КОНЕЦ КАК СубконтоКт1,
	|	ВЫБОР
	|		КОГДА ВТОбороты_Общие_Предварительно.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Кт", "ИнвентарныйНомер", "СубконтоКт2", ПараметрыВыполнения) + "
	|		ИНАЧЕ ВТОбороты_Общие_Предварительно.СубконтоКт2
	|	КОНЕЦ КАК СубконтоКт2,
	|	ВЫБОР
	|		КОГДА ВТОбороты_Общие_Предварительно.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|			ТОГДА " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Кт", "ИнвентарныйНомер", "СубконтоКт3", ПараметрыВыполнения) + "
	|		ИНАЧЕ ВТОбороты_Общие_Предварительно.СубконтоКт3
	|	КОНЕЦ КАК СубконтоКт3,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОсновныеСредстваДт.ГрупповойУчет, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОбороты_Общие_Предварительно.Сумма = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Дт", "СтоимостьОборот", "Сумма", ДополнительныеПараметры.ПараметрыВыполнения) + "
	|				КОНЕЦ 
	|		КОГДА ЕСТЬNULL(ОсновныеСредстваКт.ГрупповойУчет, ЛОЖЬ) 
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОбороты_Общие_Предварительно.Сумма = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Кт", "СтоимостьОборот", "Сумма", ДополнительныеПараметры.ПараметрыВыполнения, Истина) + "
	|				КОНЕЦ
	|		ИНАЧЕ ВТОбороты_Общие_Предварительно.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОсновныеСредстваДт.ГрупповойУчет, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОбороты_Общие_Предварительно.Сумма = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Дт", "СтоимостьОборот", "Сумма", ДополнительныеПараметры.ПараметрыВыполнения) + "
	|				КОНЕЦ 
	|		КОГДА ЕСТЬNULL(ОсновныеСредстваКт.ГрупповойУчет, ЛОЖЬ) 
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОбороты_Общие_Предварительно.Сумма = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Кт", "СтоимостьОборот", "Сумма", ДополнительныеПараметры.ПараметрыВыполнения, Истина) + "
	|				КОНЕЦ
	|		ИНАЧЕ ВТОбороты_Общие_Предварительно.Сумма
	|	КОНЕЦ КАК СуммаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОсновныеСредстваКт.ГрупповойУчет, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОбороты_Общие_Предварительно.Сумма = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Кт", "СтоимостьОборот", "Сумма", ДополнительныеПараметры.ПараметрыВыполнения, Истина) + "
	|				КОНЕЦ 
	|		КОГДА ЕСТЬNULL(ОсновныеСредстваДт.ГрупповойУчет, ЛОЖЬ) 
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОбороты_Общие_Предварительно.Сумма = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Дт", "СтоимостьОборот", "Сумма", ДополнительныеПараметры.ПараметрыВыполнения) + "
	|				КОНЕЦ
	|		ИНАЧЕ ВТОбороты_Общие_Предварительно.Сумма
	|	КОНЕЦ КАК СуммаКт,
    |	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОсновныеСредстваДт.ГрупповойУчет, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОбороты_Общие_Предварительно.КоличествоДт = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Дт", "КоличествоОборот", "КоличествоДт", ДополнительныеПараметры.ПараметрыВыполнения) + "
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(ОсновныеСредстваКт.ГрупповойУчет, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОбороты_Общие_Предварительно.КоличествоДт = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Кт", "КоличествоОборот", "КоличествоДт", ДополнительныеПараметры.ПараметрыВыполнения, Истина) + "
	|				КОНЕЦ
	|		ИНАЧЕ ВТОбороты_Общие_Предварительно.КоличествоДт
	|	КОНЕЦ КАК КоличествоДт, 
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОсновныеСредстваКт.ГрупповойУчет, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОбороты_Общие_Предварительно.КоличествоКт = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Кт", "КоличествоОборот", "КоличествоКт", ДополнительныеПараметры.ПараметрыВыполнения, Истина) + "
	|				КОНЕЦ
	|		КОГДА ЕСТЬNULL(ОсновныеСредстваДт.ГрупповойУчет, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОбороты_Общие_Предварительно.КоличествоКт = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("Дт", "КоличествоОборот", "КоличествоКт", ДополнительныеПараметры.ПараметрыВыполнения) + "
	|				КОНЕЦ
	|		ИНАЧЕ ВТОбороты_Общие_Предварительно.КоличествоКт
	|	КОНЕЦ КАК КоличествоКт,	
	|	ВТОбороты_Общие_Предварительно.ВалютаДт КАК ВалютаДт,
	|	ВТОбороты_Общие_Предварительно.ВалютаКт КАК ВалютаКт,
	|	ВТОбороты_Общие_Предварительно.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
	|	ВТОбороты_Общие_Предварительно.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт,
	|	ВТОбороты_Общие_Предварительно.СубСчетДт КАК СубСчетДт,
	|	ВТОбороты_Общие_Предварительно.СубСчетКт КАК СубСчетКт,
	|	ВТОбороты_Общие_Предварительно.ТипКПСДт КАК ТипКПСДт,
	|	ВТОбороты_Общие_Предварительно.ТипКПСКт КАК ТипКПСКт,
	|	ЕСТЬNULL(ОсновныеСредстваДт.ГрупповойУчет, ЛОЖЬ) КАК ГрупповойУчетДт, 
	|	ЕСТЬNULL(ОсновныеСредстваКт.ГрупповойУчет, ЛОЖЬ) КАК ГрупповойУчетКт, 
	|	ВТОбороты_Общие_Предварительно.ПолучитьИнвНомер КАК ПолучитьИнвНомер,
	|	ВТОбороты_Общие_Предварительно.СчетДт = ВТОбороты_Общие_Предварительно.СчетКт КАК ЭтоПеремещение,
	|	ВТОбороты_Общие_Предварительно.ОС_Дт КАК ОС_Дт, 
	|	ВТОбороты_Общие_Предварительно.ОС_Кт КАК ОС_Кт,
	|	ВТОбороты_Общие_Предварительно.МежотчетныйПериод КАК МежотчетныйПериод,
	|	ВТОбороты_Общие_Предварительно.ЗаключениеСчетов КАК ЗаключениеСчетов,
	|	ВТОбороты_Общие_Предварительно.КодВерхнегоУровняДт КАК КодВерхнегоУровняДт,
	|	ВТОбороты_Общие_Предварительно.КодВерхнегоУровняКт КАК КодВерхнегоУровняКт
	|ПОМЕСТИТЬ ВТОбороты_Общие_Предварительно_Обработанные
	|ИЗ
	|	ВТОбороты_Общие_Предварительно КАК ВТОбороты_Общие_Предварительно
	|		" + Обороты_ПолучитьСоединенияВТСтоимостьОбъектовОС("Дт", ПараметрыВыполнения) + "
	|		" + Обороты_ПолучитьСоединенияВТСтоимостьОбъектовОС("Кт", ПараметрыВыполнения) + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредстваДт
	|		ПО ВТОбороты_Общие_Предварительно.ОС_Дт = ОсновныеСредстваДт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредстваКт
	|		ПО ВТОбороты_Общие_Предварительно.ОС_Кт = ОсновныеСредстваКт.Ссылка 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////" +
	Обороты_УничтожитьТаблицыСтоимостьОС(ПараметрыВыполнения) + "
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВТОбороты_Общие_Предварительно_Обработанные.Период, ДЕНЬ) КАК Период,
	|	ВТОбороты_Общие_Предварительно_Обработанные.Организация КАК Организация,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.Счет, ЕПСБУ_Дт.Код) КАК СчетДт,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.Счет, ЕПСБУ_Кт.Код) КАК СчетКт,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТОбороты_Общие_Предварительно_Обработанные.КФО) КАК КФО,
	|	ВТОбороты_Общие_Предварительно_Обработанные.КФО КАК КФОСсылка,
	|	ЕСТЬNULL(КлассификационныеПризнакиСчетов_Дт.Код, """") КАК КПСДт,
	|	ЕСТЬNULL(КлассификационныеПризнакиСчетов_Кт.Код, """") КАК КПСКт,
	|	ЕСТЬNULL(КОСГУ_Дт.Код, """") КАК КЭКДт,
	|	ЕСТЬNULL(КОСГУ_Кт.Код, """") КАК КЭККт,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт1) = ТИП(Справочник.ОсновныеСредства) 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ГрупповойУчетДт
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ЭтоПеремещение 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ОС_Дт = ВТОбороты_Общие_Предварительно_Обработанные.ОС_Кт
	|	ТОГДА ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт1 ИНАЧЕ ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт1
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт2) = ТИП(Справочник.ОсновныеСредства) 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ГрупповойУчетДт
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ЭтоПеремещение 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ОС_Дт = ВТОбороты_Общие_Предварительно_Обработанные.ОС_Кт
	|	ТОГДА ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт2 ИНАЧЕ ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт2
	|	КОНЕЦ КАК СубконтоДт2, 
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт3) = ТИП(Справочник.ОсновныеСредства) 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ГрупповойУчетДт
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ЭтоПеремещение 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ОС_Дт = ВТОбороты_Общие_Предварительно_Обработанные.ОС_Кт
	|	ТОГДА ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт3 ИНАЧЕ ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт3
	|	КОНЕЦ КАК СубконтоДт3,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт1) = ТИП(Справочник.ОсновныеСредства) 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ГрупповойУчетКт
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ЭтоПеремещение 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ОС_Кт = ВТОбороты_Общие_Предварительно_Обработанные.ОС_Дт
	|	ТОГДА ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт1 ИНАЧЕ ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт1
	|	КОНЕЦ КАК СубконтоКт1,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт2) = ТИП(Справочник.ОсновныеСредства) 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ГрупповойУчетКт
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ЭтоПеремещение 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ОС_Кт = ВТОбороты_Общие_Предварительно_Обработанные.ОС_Дт
	|	ТОГДА ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт2 ИНАЧЕ ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт2
	|	КОНЕЦ КАК СубконтоКт2, 
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт3) = ТИП(Справочник.ОсновныеСредства) 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ГрупповойУчетКт
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ЭтоПеремещение 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ОС_Кт = ВТОбороты_Общие_Предварительно_Обработанные.ОС_Дт
	|	ТОГДА ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт3 ИНАЧЕ ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт3
	|	КОНЕЦ КАК СубконтоКт3,
	|	ВЫБОР КОГДА (ВТОбороты_Общие_Предварительно_Обработанные.ГрупповойУчетДт ИЛИ ВТОбороты_Общие_Предварительно_Обработанные.ГрупповойУчетКт)
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ЭтоПеремещение
	|		И ВТОбороты_Общие_Предварительно_Обработанные.СуммаДт <> ВТОбороты_Общие_Предварительно_Обработанные.СуммаКт 
	|	ТОГДА ВЫБОР КОГДА ВТОбороты_Общие_Предварительно_Обработанные.СуммаДт <= ВТОбороты_Общие_Предварительно_Обработанные.СуммаКт 
	|			ТОГДА ВТОбороты_Общие_Предварительно_Обработанные.СуммаДт 
	|			ИНАЧЕ ВТОбороты_Общие_Предварительно_Обработанные.СуммаКт 
	|		КОНЕЦ
	|	ИНАЧЕ ВТОбороты_Общие_Предварительно_Обработанные.СуммаДт
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР КОГДА ЕПСБУ_Дт.Количественный ТОГДА ВЫБОР КОГДА (ВТОбороты_Общие_Предварительно_Обработанные.ГрупповойУчетДт ИЛИ ВТОбороты_Общие_Предварительно_Обработанные.ГрупповойУчетКт)
	|		И ВТОбороты_Общие_Предварительно_Обработанные.ЭтоПеремещение
	|		И ВТОбороты_Общие_Предварительно_Обработанные.КоличествоДт <> ВТОбороты_Общие_Предварительно_Обработанные.КоличествоКт 
	|	ТОГДА ВЫБОР КОГДА ВТОбороты_Общие_Предварительно_Обработанные.КоличествоДт <= ВТОбороты_Общие_Предварительно_Обработанные.КоличествоКт
	|			ТОГДА ВТОбороты_Общие_Предварительно_Обработанные.КоличествоДт
	|			ИНАЧЕ ВТОбороты_Общие_Предварительно_Обработанные.КоличествоКт 
	|		КОНЕЦ
	|	ИНАЧЕ ВТОбороты_Общие_Предварительно_Обработанные.КоличествоДт 
	|	КОНЕЦ ИНАЧЕ 0 КОНЕЦ КАК КоличествоДт,
	|	ВЫБОР КОГДА ЕПСБУ_Кт.Количественный ТОГДА ВЫБОР КОГДА ВТОбороты_Общие_Предварительно_Обработанные.КоличествоКт = 0 ТОГДА 0
	|	ИНАЧЕ ВЫБОР КОГДА ВТОбороты_Общие_Предварительно_Обработанные.КодВерхнегоУровняДт = ""101.00"" 
	|		И ВТОбороты_Общие_Предварительно_Обработанные.КодВерхнегоУровняКт = ""106.00"" 
	|		И (ВТОбороты_Общие_Предварительно_Обработанные.ГрупповойУчетДт ИЛИ ВТОбороты_Общие_Предварительно_Обработанные.ГрупповойУчетКт) ТОГДА 
	|			ВТОбороты_Общие_Предварительно_Обработанные.КоличествоДт
	|		ИНАЧЕ ВТОбороты_Общие_Предварительно_Обработанные.КоличествоКт КОНЕЦ
	|	КОНЕЦ ИНАЧЕ 0 КОНЕЦ КАК КоличествоКт,
	|	ЕСТЬNULL(ВалютыДт.Код, """") КАК ВалютаДт,
	|	ЕСТЬNULL(ВалютыКт.Код, """") КАК ВалютаКт,
	|	ВТОбороты_Общие_Предварительно_Обработанные.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
	|	ВТОбороты_Общие_Предварительно_Обработанные.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикДт_Общ.ВОборотах1
	|			ТОГДА ВТТаблицаСвязейАналитикДт_Общ.Аналитика1
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаДт1,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикДт_Общ.ВОборотах2
	|			ТОГДА ВТТаблицаСвязейАналитикДт_Общ.Аналитика2
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаДт2,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикДт_Общ.ВОборотах3
	|			ТОГДА ВТТаблицаСвязейАналитикДт_Общ.Аналитика3
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаДт3,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикДт_Общ.ВОборотах4
	|			ТОГДА ВТТаблицаСвязейАналитикДт_Общ.Аналитика4
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаДт4,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикДт_Общ.ВОборотах5
	|			ТОГДА ВТТаблицаСвязейАналитикДт_Общ.Аналитика5
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаДт5,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикДт_Общ.ВОборотах6
	|			ТОГДА ВТТаблицаСвязейАналитикДт_Общ.Аналитика6
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаДт6,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикКТ_Общ.ВОборотах1
	|			ТОГДА ВТТаблицаСвязейАналитикКТ_Общ.Аналитика1
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаКт1,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикКТ_Общ.ВОборотах2
	|			ТОГДА ВТТаблицаСвязейАналитикКТ_Общ.Аналитика2
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаКт2,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикКТ_Общ.ВОборотах3
	|			ТОГДА ВТТаблицаСвязейАналитикКТ_Общ.Аналитика3
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаКт3,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикКТ_Общ.ВОборотах4
	|			ТОГДА ВТТаблицаСвязейАналитикКТ_Общ.Аналитика4
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаКт4,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикКТ_Общ.ВОборотах5
	|			ТОГДА ВТТаблицаСвязейАналитикКТ_Общ.Аналитика5
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаКт5,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикКТ_Общ.ВОборотах6
	|			ТОГДА ВТТаблицаСвязейАналитикКТ_Общ.Аналитика6
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АналитикаКт6,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.ОбязательноВОборотах1, ЛОЖЬ) КАК ОбязательноВОборотахДт1,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.ОбязательноВОборотах2, ЛОЖЬ) КАК ОбязательноВОборотахДт2,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.ОбязательноВОборотах3, ЛОЖЬ) КАК ОбязательноВОборотахДт3,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.ОбязательноВОборотах4, ЛОЖЬ) КАК ОбязательноВОборотахДт4,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.ОбязательноВОборотах5, ЛОЖЬ) КАК ОбязательноВОборотахДт5,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.ОбязательноВОборотах6, ЛОЖЬ) КАК ОбязательноВОборотахДт6,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.ОбязательноВОборотах1, ЛОЖЬ) КАК ОбязательноВОборотахКт1,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.ОбязательноВОборотах2, ЛОЖЬ) КАК ОбязательноВОборотахКт2,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.ОбязательноВОборотах3, ЛОЖЬ) КАК ОбязательноВОборотахКт3,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.ОбязательноВОборотах4, ЛОЖЬ) КАК ОбязательноВОборотахКт4,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.ОбязательноВОборотах5, ЛОЖЬ) КАК ОбязательноВОборотахКт5,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.ОбязательноВОборотах6, ЛОЖЬ) КАК ОбязательноВОборотахКт6,
	|	" + ПолучитьТекстЗапросаТипКБК("КлассификационныеПризнакиСчетов_Дт") + " КАК ТипКПСДт,
	|	" + ПолучитьТекстЗапросаТипКБК("КлассификационныеПризнакиСчетов_Кт") + " КАК ТипКПСКт,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубСчетДт КАК СубСчетДт,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубСчетКт КАК СубСчетКт,
	|	ЕПСБУ_Дт.Ссылка КАК СчетСсылкаДт,
	|	ЕПСБУ_Кт.Ссылка КАК СчетСсылкаКт,
	|	ВТОбороты_Общие_Предварительно_Обработанные.МежотчетныйПериод КАК МежотчетныйПериод,
	|	ВТОбороты_Общие_Предварительно_Обработанные.ЗаключениеСчетов КАК ЗаключениеСчетов
	|ПОМЕСТИТЬ ВТОбороты_Общие
	|ИЗ
	|	ВТОбороты_Общие_Предварительно_Обработанные КАК ВТОбороты_Общие_Предварительно_Обработанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ЕПСБУ_Дт
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитикДт_Общ
	|			ПО (ЕПСБУ_Дт.Код = ВТТаблицаСвязейАналитикДт_Общ.Счет
	|					ИЛИ ЕПСБУ_Дт.КодРодитель = ВТТаблицаСвязейАналитикДт_Общ.Счет
	|					ИЛИ ЕПСБУ_Дт.КодРодтельРодитель = ВТТаблицаСвязейАналитикДт_Общ.Счет)
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.СчетДт = ЕПСБУ_Дт.Ссылка 
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ЕПСБУ_Кт
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитикКТ_Общ
	|			ПО (ЕПСБУ_Кт.Код = ВТТаблицаСвязейАналитикКТ_Общ.Счет
	|					ИЛИ ЕПСБУ_Кт.КодРодитель = ВТТаблицаСвязейАналитикКТ_Общ.Счет
	|					ИЛИ ЕПСБУ_Кт.КодРодтельРодитель = ВТТаблицаСвязейАналитикКТ_Общ.Счет)
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.СчетКт = ЕПСБУ_Кт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификационныеПризнакиСчетов КАК КлассификационныеПризнакиСчетов_Дт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.КПСДт = КлассификационныеПризнакиСчетов_Дт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификационныеПризнакиСчетов КАК КлассификационныеПризнакиСчетов_Кт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.КПСКт = КлассификационныеПризнакиСчетов_Кт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК КОСГУ_Дт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.КЭКДт = КОСГУ_Дт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК КОСГУ_Кт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.КЭККт = КОСГУ_Кт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыДт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.ВалютаДт = ВалютыДт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыКт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.ВалютаКт = ВалютыКт.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВТОбороты_Общие_Предварительно_Обработанные.Период, ДЕНЬ),
	|	ВТОбороты_Общие_Предварительно_Обработанные.Организация,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.Счет, ЕПСБУ_Дт.Код),
	|	"""",
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТОбороты_Общие_Предварительно_Обработанные.КФО),
	|	ВТОбороты_Общие_Предварительно_Обработанные.КФО,
	|	ЕСТЬNULL(КлассификационныеПризнакиСчетов_Дт.Код, """"),
	|	ЕСТЬNULL(КлассификационныеПризнакиСчетов_Кт.Код, """"),
	|	ЕСТЬNULL(КОСГУ_Дт.Код, """"),
	|	ЕСТЬNULL(КОСГУ_Кт.Код, """"),
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт1,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт2,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт3,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт1,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт2,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт3,
	|	ВТОбороты_Общие_Предварительно_Обработанные.Сумма,
	|	ВЫБОР КОГДА ЕПСБУ_Дт.Количественный ТОГДА ВТОбороты_Общие_Предварительно_Обработанные.КоличествоДт ИНАЧЕ 0 КОНЕЦ,
	|	ВЫБОР КОГДА ЕСТЬNULL(ЕПСБУ_Кт.Код, """") <> """" И ЕПСБУ_Кт.Количественный ТОГДА ВТОбороты_Общие_Предварительно_Обработанные.КоличествоКт ИНАЧЕ 0 КОНЕЦ,
	|	ЕСТЬNULL(ВалютыДт.Код, """"),
	|	ЕСТЬNULL(ВалютыКт.Код, """"),
	|	ВТОбороты_Общие_Предварительно_Обработанные.ВалютнаяСуммаДт,
	|	ВТОбороты_Общие_Предварительно_Обработанные.ВалютнаяСуммаКт,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикДт_Общ.ВОборотах1
	|			ТОГДА ВТТаблицаСвязейАналитикДт_Общ.Аналитика1
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикДт_Общ.ВОборотах2
	|			ТОГДА ВТТаблицаСвязейАналитикДт_Общ.Аналитика2
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикДт_Общ.ВОборотах3
	|			ТОГДА ВТТаблицаСвязейАналитикДт_Общ.Аналитика3
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикДт_Общ.ВОборотах4
	|			ТОГДА ВТТаблицаСвязейАналитикДт_Общ.Аналитика4
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикДт_Общ.ВОборотах5
	|			ТОГДА ВТТаблицаСвязейАналитикДт_Общ.Аналитика5
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикДт_Общ.ВОборотах6
	|			ТОГДА ВТТаблицаСвязейАналитикДт_Общ.Аналитика6
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.ОбязательноВОборотах1, ЛОЖЬ),
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.ОбязательноВОборотах2, ЛОЖЬ),
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.ОбязательноВОборотах3, ЛОЖЬ),
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.ОбязательноВОборотах4, ЛОЖЬ),
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.ОбязательноВОборотах5, ЛОЖЬ),
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикДт_Общ.ОбязательноВОборотах6, ЛОЖЬ),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	" + ПолучитьТекстЗапросаТипКБК("КлассификационныеПризнакиСчетов_Дт") + ",
	|	" + ПолучитьТекстЗапросаТипКБК("КлассификационныеПризнакиСчетов_Кт") + ",
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубСчетДт,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубСчетКт,
	|	ЕПСБУ_Дт.Ссылка,
	|	NULL,
	|	ВТОбороты_Общие_Предварительно_Обработанные.МежотчетныйПериод,
	|	ВТОбороты_Общие_Предварительно_Обработанные.ЗаключениеСчетов
	|ИЗ
	|	ВТОбороты_Общие_Предварительно_Обработанные КАК ВТОбороты_Общие_Предварительно_Обработанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ЕПСБУ_Кт
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитикКТ_Общ
	|			ПО (ЕПСБУ_Кт.Код = ВТТаблицаСвязейАналитикКТ_Общ.Счет
	|					ИЛИ ЕПСБУ_Кт.КодРодитель = ВТТаблицаСвязейАналитикКТ_Общ.Счет
	|					ИЛИ ЕПСБУ_Кт.КодРодтельРодитель = ВТТаблицаСвязейАналитикКТ_Общ.Счет)
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.СчетКт = ЕПСБУ_Кт.Ссылка	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ЕПСБУ_Дт
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитикДт_Общ
	|			ПО (ЕПСБУ_Дт.Код = ВТТаблицаСвязейАналитикДт_Общ.Счет
	|					ИЛИ ЕПСБУ_Дт.КодРодитель = ВТТаблицаСвязейАналитикДт_Общ.Счет
	|					ИЛИ ЕПСБУ_Дт.КодРодтельРодитель = ВТТаблицаСвязейАналитикДт_Общ.Счет)
	|		ПО (ЕПСБУ_Дт.Забалансовый)
	|			И ВТОбороты_Общие_Предварительно_Обработанные.СчетДт = ЕПСБУ_Дт.Ссылка
	|			И (ВТОбороты_Общие_Предварительно_Обработанные.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|				ИЛИ ЕПСБУ_Кт.Ссылка ЕСТЬ NULL)  
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификационныеПризнакиСчетов КАК КлассификационныеПризнакиСчетов_Дт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.КПСДт = КлассификационныеПризнакиСчетов_Дт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификационныеПризнакиСчетов КАК КлассификационныеПризнакиСчетов_Кт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.КПСКт = КлассификационныеПризнакиСчетов_Кт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК КОСГУ_Дт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.КЭКДт = КОСГУ_Дт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК КОСГУ_Кт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.КЭККт = КОСГУ_Кт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыДт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.ВалютаДт = ВалютыДт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыКт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.ВалютаКт = ВалютыКт.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВТОбороты_Общие_Предварительно_Обработанные.Период, ДЕНЬ),
	|	ВТОбороты_Общие_Предварительно_Обработанные.Организация,
	|	"""",
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.Счет, ЕПСБУ_Кт.Код),
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТОбороты_Общие_Предварительно_Обработанные.КФО),
	|	ВТОбороты_Общие_Предварительно_Обработанные.КФО,
	|	ЕСТЬNULL(КлассификационныеПризнакиСчетов_Дт.Код, """"),
	|	ЕСТЬNULL(КлассификационныеПризнакиСчетов_Кт.Код, """"),
	|	ЕСТЬNULL(КОСГУ_Дт.Код, """"),
	|	ЕСТЬNULL(КОСГУ_Кт.Код, """"),
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт1,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт2,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубконтоДт3,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт1,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт2,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубконтоКт3,
	|	ВТОбороты_Общие_Предварительно_Обработанные.Сумма,
	|	ВЫБОР КОГДА ЕСТЬNULL(ЕПСБУ_Дт.Код, """") <> """" И ЕПСБУ_Дт.Количественный ТОГДА ВТОбороты_Общие_Предварительно_Обработанные.КоличествоДт ИНАЧЕ 0 КОНЕЦ,
	|	ВЫБОР КОГДА ЕПСБУ_Кт.Количественный ТОГДА ВТОбороты_Общие_Предварительно_Обработанные.КоличествоКт ИНАЧЕ 0 КОНЕЦ,
	|	ЕСТЬNULL(ВалютыДт.Код, """"),
	|	ЕСТЬNULL(ВалютыКт.Код, """"),
	|	ВТОбороты_Общие_Предварительно_Обработанные.ВалютнаяСуммаДт,
	|	ВТОбороты_Общие_Предварительно_Обработанные.ВалютнаяСуммаКт,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикКТ_Общ.ВОборотах1
	|			ТОГДА ВТТаблицаСвязейАналитикКТ_Общ.Аналитика1
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикКТ_Общ.ВОборотах2
	|			ТОГДА ВТТаблицаСвязейАналитикКТ_Общ.Аналитика2
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикКТ_Общ.ВОборотах3
	|			ТОГДА ВТТаблицаСвязейАналитикКТ_Общ.Аналитика3
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикКТ_Общ.ВОборотах4
	|			ТОГДА ВТТаблицаСвязейАналитикКТ_Общ.Аналитика4
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикКТ_Общ.ВОборотах5
	|			ТОГДА ВТТаблицаСвязейАналитикКТ_Общ.Аналитика5
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитикКТ_Общ.ВОборотах6
	|			ТОГДА ВТТаблицаСвязейАналитикКТ_Общ.Аналитика6
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.ОбязательноВОборотах1, ЛОЖЬ),
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.ОбязательноВОборотах2, ЛОЖЬ),
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.ОбязательноВОборотах3, ЛОЖЬ),
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.ОбязательноВОборотах4, ЛОЖЬ),
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.ОбязательноВОборотах5, ЛОЖЬ),
	|	ЕСТЬNULL(ВТТаблицаСвязейАналитикКТ_Общ.ОбязательноВОборотах6, ЛОЖЬ),
	|	" + ПолучитьТекстЗапросаТипКБК("КлассификационныеПризнакиСчетов_Дт") + ",
	|	" + ПолучитьТекстЗапросаТипКБК("КлассификационныеПризнакиСчетов_Кт") + ",
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубСчетДт,
	|	ВТОбороты_Общие_Предварительно_Обработанные.СубСчетКт,
	|	NULL,
	|	ЕПСБУ_Кт.Ссылка,
	|	ВТОбороты_Общие_Предварительно_Обработанные.МежотчетныйПериод,
	|	ВТОбороты_Общие_Предварительно_Обработанные.ЗаключениеСчетов
	|ИЗ
	|	ВТОбороты_Общие_Предварительно_Обработанные КАК ВТОбороты_Общие_Предварительно_Обработанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ЕПСБУ_Дт
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитикДТ_Общ
	|			ПО (ЕПСБУ_Дт.Код = ВТТаблицаСвязейАналитикДТ_Общ.Счет
	|					ИЛИ ЕПСБУ_Дт.КодРодитель = ВТТаблицаСвязейАналитикДТ_Общ.Счет
	|					ИЛИ ЕПСБУ_Дт.КодРодтельРодитель = ВТТаблицаСвязейАналитикДТ_Общ.Счет)
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.СчетДт = ЕПСБУ_Дт.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ЕПСБУ_Кт
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитикКТ_Общ
	|			ПО (ЕПСБУ_Кт.Код = ВТТаблицаСвязейАналитикКТ_Общ.Счет
	|					ИЛИ ЕПСБУ_Кт.КодРодитель = ВТТаблицаСвязейАналитикКТ_Общ.Счет
	|					ИЛИ ЕПСБУ_Кт.КодРодтельРодитель = ВТТаблицаСвязейАналитикКТ_Общ.Счет)
	|		ПО (ЕПСБУ_Кт.Забалансовый)
	|			И ВТОбороты_Общие_Предварительно_Обработанные.СчетКт = ЕПСБУ_Кт.Ссылка
	|			И (ВТОбороты_Общие_Предварительно_Обработанные.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|				ИЛИ ЕПСБУ_Дт.Ссылка ЕСТЬ NULL) 
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификационныеПризнакиСчетов КАК КлассификационныеПризнакиСчетов_Дт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.КПСДт = КлассификационныеПризнакиСчетов_Дт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификационныеПризнакиСчетов КАК КлассификационныеПризнакиСчетов_Кт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.КПСКт = КлассификационныеПризнакиСчетов_Кт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК КОСГУ_Дт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.КЭКДт = КОСГУ_Дт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК КОСГУ_Кт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.КЭККт = КОСГУ_Кт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыДт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.ВалютаДт = ВалютыДт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК ВалютыКт
	|		ПО ВТОбороты_Общие_Предварительно_Обработанные.ВалютаКт = ВалютыКт.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЖурналПроводокЕПСБУДвиженияССубконто
	|;
	|  
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЖурналПроводокЕПСБУДвиженияССубконто_Предварительно
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОбороты_Общие_Предварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОбороты_Общие_Предварительно_Обработанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" + ПолучитьТекстЗапросаОстатки("Начало", "&ДатаНачала", "&ДатаНачала", ДополнительныеПараметры) + "
	|" + ?(КонецДня(ПараметрыВыполнения.ОкончаниеПериода) = КонецГода(ПараметрыВыполнения.ОкончаниеПериода), 
	ПолучитьТекстЗапросаОстатки("Конец", "&ДатаОкончанияГраница", "&ДатаОкончанияГраницаВключая", ДополнительныеПараметры),
	ПолучитьТекстЗапросаОстатки("Конец", "&ДатаОкончанияГраницаВключая", "&ДатаОкончанияГраницаВключая", ДополнительныеПараметры)) + "
	|" + ПолучитьТекстЗапросаОстаткиПредварительно("Начало", "&ДатаНачала", ПараметрыВыполнения, Истина, "ВТОстаткиПредварительно") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|" + ПолучитьТекстЗапросаОстаткиПредварительно("Конец", "&ДатаОкончания", ПараметрыВыполнения) + "
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетКод,
	|	СубСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" + УничтожитьТаблицыПредварительно("Начало") + "
	|" + УничтожитьТаблицыПредварительно("Конец") + "
	|" + ПолучитьТекстЗапросаОстаткиОкончательно("ВТОстаткиПредварительно", "ВТОстаткиБезСубконто4", "ВТОстатки") + 
	?(ПараметрыВыполнения.ИспользоватьСхемуВыгрузки2026, ПолучитьТекстЗапросаПерезагружаемыеПериоды(ПараметрыВыполнения), "") + 
	Остатки_УничтожитьТаблицыСтоимостьОС(ПараметрыВыполнения) + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОбороты_Общие.Период КАК Период,
	|	ВТОбороты_Общие.Организация КАК Организация,
	|	ВТОбороты_Общие.СчетДт КАК СчетДт,
	|	ВТОбороты_Общие.СчетКт КАК СчетКт,
	|	ВТОбороты_Общие.КФО КАК КФО,
	|	ВТОбороты_Общие.КФОСсылка КАК КФОСсылка,
	|	ВТОбороты_Общие.КПСДт КАК КПСДт,
	|	ВТОбороты_Общие.КПСКт КАК КПСКт,
	|	ВТОбороты_Общие.КЭКДт КАК КЭКДт,
	|	ВТОбороты_Общие.КЭККт КАК КЭККт,
	|	ВТОбороты_Общие.СубконтоДт1 КАК СубконтоДт1,
	|	ВТОбороты_Общие.СубконтоДт2 КАК СубконтоДт2,
	|	ВТОбороты_Общие.СубконтоДт3 КАК СубконтоДт3,
	|	ВТОбороты_Общие.СубконтоКт1 КАК СубконтоКт1,
	|	ВТОбороты_Общие.СубконтоКт2 КАК СубконтоКт2,
	|	ВТОбороты_Общие.СубконтоКт3 КАК СубконтоКт3,
	|	СУММА(ВТОбороты_Общие.Сумма) КАК Сумма,
	|	СУММА(ВТОбороты_Общие.КоличествоДт) КАК КоличествоДт,
	|	СУММА(ВТОбороты_Общие.КоличествоКт) КАК КоличествоКт,
	|	ВТОбороты_Общие.ВалютаДт КАК ВалютаДт,
	|	ВТОбороты_Общие.ВалютаКт КАК ВалютаКт,
	|	СУММА(ВТОбороты_Общие.ВалютнаяСуммаДт) КАК ВалютнаяСуммаДт,
	|	СУММА(ВТОбороты_Общие.ВалютнаяСуммаКт) КАК ВалютнаяСуммаКт,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаДт1, """") КАК АналитикаДт1,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаДт2, """") КАК АналитикаДт2,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаДт3, """") КАК АналитикаДт3,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаДт4, """") КАК АналитикаДт4,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаДт5, """") КАК АналитикаДт5,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаДт6, """") КАК АналитикаДт6,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаКт1, """") КАК АналитикаКт1,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаКт2, """") КАК АналитикаКт2,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаКт3, """") КАК АналитикаКт3,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаКт4, """") КАК АналитикаКт4,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаКт5, """") КАК АналитикаКт5,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаКт6, """") КАК АналитикаКт6,
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахДт1, ЛОЖЬ) КАК ОбязательноВОборотахДт1,
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахДт2, ЛОЖЬ) КАК ОбязательноВОборотахДт2,
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахДт3, ЛОЖЬ) КАК ОбязательноВОборотахДт3,
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахДт4, ЛОЖЬ) КАК ОбязательноВОборотахДт4,
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахДт5, ЛОЖЬ) КАК ОбязательноВОборотахДт5,
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахДт6, ЛОЖЬ) КАК ОбязательноВОборотахДт6,
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахКт1, ЛОЖЬ) КАК ОбязательноВОборотахКт1,
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахКт2, ЛОЖЬ) КАК ОбязательноВОборотахКт2,
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахКт3, ЛОЖЬ) КАК ОбязательноВОборотахКт3,
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахКт4, ЛОЖЬ) КАК ОбязательноВОборотахКт4,
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахКт5, ЛОЖЬ) КАК ОбязательноВОборотахКт5,
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахКт6, ЛОЖЬ) КАК ОбязательноВОборотахКт6,
	|	ВТОбороты_Общие.ТипКПСДт КАК ТипКПСДт,
	|	ВТОбороты_Общие.ТипКПСКт КАК ТипКПСКт,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОбороты_Общие.СубконтоДт1) КАК УИ_Дт1,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОбороты_Общие.СубконтоДт2) КАК УИ_Дт2,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОбороты_Общие.СубконтоДт3) КАК УИ_Дт3,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОбороты_Общие.СубконтоКт1) КАК УИ_Кт1,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОбороты_Общие.СубконтоКт2) КАК УИ_Кт2,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОбороты_Общие.СубконтоКт3) КАК УИ_Кт3,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОбороты_Общие.Организация) КАК УИ_Организации,
	|	ВТОбороты_Общие.СчетСсылкаДт.Код КАК СубСчетДт,
	|	ВТОбороты_Общие.СчетСсылкаКт.Код КАК СубСчетКт,
	|	ВТОбороты_Общие.СчетСсылкаДт КАК СчетСсылкаДт,
	|	ВТОбороты_Общие.СчетСсылкаКт КАК СчетСсылкаКт," + 
	?(ПараметрыВыполнения.ИспользуетсяБГУСпец, СтрЗаменить(МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконто(), "%Суффикс", "Дт"), "
	|	ЕПСБУВидыСубконтоДт1.ВидСубконто") + " КАК ВидСубконтоДт1,
	|	ЕПСБУВидыСубконтоДт2.ВидСубконто КАК ВидСубконтоДт2,
	|	ЕПСБУВидыСубконтоДт3.ВидСубконто КАК ВидСубконтоДт3,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОбороты_Общие.АналитикаДт1 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт2 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт3 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт4 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт5 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|	КОНЕЦ КАК ВидСубконтоДт4," + 
	?(ПараметрыВыполнения.ИспользуетсяБГУСпец, СтрЗаменить(МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконто(), "%Суффикс", "Кт"), "
	|	ЕПСБУВидыСубконтоКт1.ВидСубконто") + " КАК ВидСубконтоКт1,
	|	ЕПСБУВидыСубконтоКт2.ВидСубконто КАК ВидСубконтоКт2,
	|	ЕПСБУВидыСубконтоКт3.ВидСубконто КАК ВидСубконтоКт3,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОбороты_Общие.АналитикаКт1 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт2 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт3 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт4 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт5 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|	КОНЕЦ КАК ВидСубконтоКт4,
	|	НЕ(НЕ ВТОбороты_Общие.АналитикаДт1 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаДт2 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаДт3 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаДт4 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаДт5 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаДт6 = ""KONTRAGENT"")
	|		И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|		И (НЕ(НЕ ЕПСБУВидыСубконтоДт1.ВидСубконто ЕСТЬ NULL
	|					И ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт1) = ТИП(Справочник.Контрагенты))
	|			И НЕ(НЕ ЕПСБУВидыСубконтоДт2.ВидСубконто ЕСТЬ NULL
	|					И ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт2) = ТИП(Справочник.Контрагенты))
	|			И НЕ(НЕ ЕПСБУВидыСубконтоДт3.ВидСубконто ЕСТЬ NULL
	|					И ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт3) = ТИП(Справочник.Контрагенты))) КАК ТребуетсяСубконтоДт4,
	|	НЕ(НЕ ВТОбороты_Общие.АналитикаКт1 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаКт2 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаКт3 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаКт4 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаКт5 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаКт6 = ""KONTRAGENT"")
	|		И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|		И (НЕ(НЕ ЕПСБУВидыСубконтоКт1.ВидСубконто ЕСТЬ NULL
	|					И ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт1) = ТИП(Справочник.Контрагенты))
	|			И НЕ(НЕ ЕПСБУВидыСубконтоКт2.ВидСубконто ЕСТЬ NULL
	|					И ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт2) = ТИП(Справочник.Контрагенты))
	|			И НЕ(НЕ ЕПСБУВидыСубконтоКт3.ВидСубконто ЕСТЬ NULL
	|					И ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт3) = ТИП(Справочник.Контрагенты))) КАК ТребуетсяСубконтоКт4,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОбороты_Общие.АналитикаДт1 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт2 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт3 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт4 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт5 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОбороты_Общие.СубконтоДт1" + 
	СтрЗаменить(СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|					КОГДА " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение() + "
	|						ТОГДА ВТОбороты_Общие.СубконтоДт1", ""), "%ИмяВТ", "ВТОбороты_Общие"), "%Суффикс", "Дт") + "
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОбороты_Общие.СубконтоДт2
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОбороты_Общие.СубконтоДт3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорДт,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОбороты_Общие.АналитикаКт1 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт2 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт3 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт4 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт5 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОбороты_Общие.СубконтоКт1" + 
	СтрЗаменить(СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|					КОГДА " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение() + "
	|						ТОГДА ВТОбороты_Общие.СубконтоКт1", ""), "%ИмяВТ", "ВТОбороты_Общие"), "%Суффикс", "Кт") + "
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОбороты_Общие.СубконтоКт2
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОбороты_Общие.СубконтоКт3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорКт,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт1) = ТИП(Справочник.Договоры) 
	|		ТОГДА  ВТОбороты_Общие.СубконтоДт1 
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт2) = ТИП(Справочник.Договоры)
	|		ТОГДА  ВТОбороты_Общие.СубконтоДт2
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт3) = ТИП(Справочник.Договоры)
	|		ТОГДА  ВТОбороты_Общие.СубконтоДт3
	|	КОНЕЦ КАК ДоговорДтСоединение, 
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт1) = ТИП(Справочник.Договоры) 
	|		ТОГДА  ВТОбороты_Общие.СубконтоКт1 
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт2) = ТИП(Справочник.Договоры)
	|		ТОГДА  ВТОбороты_Общие.СубконтоКт2
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт3) = ТИП(Справочник.Договоры)
	|		ТОГДА  ВТОбороты_Общие.СубконтоКт3
	|	КОНЕЦ КАК ДоговорКтСоединение, 
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт1) = ТИП(Справочник.Контрагенты) 
	|		ТОГДА  ВТОбороты_Общие.СубконтоДт1 
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт2) = ТИП(Справочник.Контрагенты)
	|		ТОГДА  ВТОбороты_Общие.СубконтоДт2
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт3) = ТИП(Справочник.Контрагенты)
	|		ТОГДА  ВТОбороты_Общие.СубконтоДт3
	|	КОНЕЦ КАК КонтрагентДтСоединение,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт1) = ТИП(Справочник.Контрагенты) 
	|		ТОГДА  ВТОбороты_Общие.СубконтоКт1 
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт2) = ТИП(Справочник.Контрагенты)
	|		ТОГДА  ВТОбороты_Общие.СубконтоКт2
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт3) = ТИП(Справочник.Контрагенты)
	|		ТОГДА  ВТОбороты_Общие.СубконтоКт3
	|	КОНЕЦ КАК КонтрагентКтСоединение,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОбороты_Общие.АналитикаДт1 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт2 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт3 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт4 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт5 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОбороты_Общие.СубконтоДт1
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОбороты_Общие.СубконтоДт2
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОбороты_Общие.СубконтоДт3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)
	|	КОНЕЦ КАК ОбъектыФВДт,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОбороты_Общие.АналитикаКт1 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт2 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт3 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт4 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт5 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОбороты_Общие.СубконтоКт1
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОбороты_Общие.СубконтоКт2
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОбороты_Общие.СубконтоКт3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)
	|	КОНЕЦ КАК ОбъектыФВКт,
	|	ВТОбороты_Общие.МежотчетныйПериод КАК МежотчетныйПериод,
	|	ВТОбороты_Общие.ЗаключениеСчетов КАК ЗаключениеСчетов
	|ПОМЕСТИТЬ ВТОборотыБезСубконто4
	|ИЗ
	|	ВТОбороты_Общие КАК ВТОбороты_Общие
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконтоКт1
	|		ПО ВТОбороты_Общие.СубСчетКт = ЕПСБУВидыСубконтоКт1.Ссылка
	|			И (ЕПСБУВидыСубконтоКт1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконтоКт2
	|		ПО ВТОбороты_Общие.СубСчетКт = ЕПСБУВидыСубконтоКт2.Ссылка
	|			И (ЕПСБУВидыСубконтоКт2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконтоКт3
	|		ПО ВТОбороты_Общие.СубСчетКт = ЕПСБУВидыСубконтоКт3.Ссылка
	|			И (ЕПСБУВидыСубконтоКт3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконтоДт1
	|		ПО ВТОбороты_Общие.СубСчетДт = ЕПСБУВидыСубконтоДт1.Ссылка
	|			И (ЕПСБУВидыСубконтоДт1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконтоДт2
	|		ПО ВТОбороты_Общие.СубСчетДт = ЕПСБУВидыСубконтоДт2.Ссылка
	|			И (ЕПСБУВидыСубконтоДт2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконтоДт3
	|		ПО ВТОбороты_Общие.СубСчетДт = ЕПСБУВидыСубконтоДт3.Ссылка
	|			И (ЕПСБУВидыСубконтоДт3.НомерСтроки = 3)
	|ГДЕ
	|	НЕ(ЕСТЬNULL(ВТОбороты_Общие.Сумма, 0) = 0
	|				И ЕСТЬNULL(ВТОбороты_Общие.КоличествоДт, 0) = 0
	|				И ЕСТЬNULL(ВТОбороты_Общие.КоличествоКт, 0) = 0
	|				И ЕСТЬNULL(ВТОбороты_Общие.ВалютнаяСуммаДт, 0) = 0
	|				И ЕСТЬNULL(ВТОбороты_Общие.ВалютнаяСуммаКт, 0) = 0)
	|	И ВЫБОР
	|			КОГДА НЕ(НЕ ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТОбороты_Общие.СубконтоДт1, НЕОПРЕДЕЛЕНО)) = ТИП(Справочник.ИнвентарныеНомераОС)
	|							И НЕ ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТОбороты_Общие.СубконтоДт2, НЕОПРЕДЕЛЕНО)) = ТИП(Справочник.ИнвентарныеНомераОС)
	|							И НЕ ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТОбороты_Общие.СубконтоДт3, НЕОПРЕДЕЛЕНО)) = ТИП(Справочник.ИнвентарныеНомераОС))
	|					И НЕ(НЕ ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТОбороты_Общие.СубконтоКт1, НЕОПРЕДЕЛЕНО)) = ТИП(Справочник.ИнвентарныеНомераОС)
	|							И НЕ ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТОбороты_Общие.СубконтоКт2, НЕОПРЕДЕЛЕНО)) = ТИП(Справочник.ИнвентарныеНомераОС)
	|							И НЕ ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТОбороты_Общие.СубконтоКт3, НЕОПРЕДЕЛЕНО)) = ТИП(Справочник.ИнвентарныеНомераОС))
	|				ТОГДА ВЫБОР
	|						КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТОбороты_Общие.СубконтоДт1, НЕОПРЕДЕЛЕНО)) = ТИП(Справочник.ИнвентарныеНомераОС)
	|							ТОГДА ВТОбороты_Общие.СубконтоДт1
	|						КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТОбороты_Общие.СубконтоДт2, НЕОПРЕДЕЛЕНО)) = ТИП(Справочник.ИнвентарныеНомераОС)
	|							ТОГДА ВТОбороты_Общие.СубконтоДт2
	|						КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТОбороты_Общие.СубконтоДт3, НЕОПРЕДЕЛЕНО)) = ТИП(Справочник.ИнвентарныеНомераОС)
	|							ТОГДА ВТОбороты_Общие.СубконтоДт3
	|					КОНЕЦ = ВЫБОР
	|						КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТОбороты_Общие.СубконтоКт1, НЕОПРЕДЕЛЕНО)) = ТИП(Справочник.ИнвентарныеНомераОС)
	|							ТОГДА ВТОбороты_Общие.СубконтоКт1
	|						КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТОбороты_Общие.СубконтоКт2, НЕОПРЕДЕЛЕНО)) = ТИП(Справочник.ИнвентарныеНомераОС)
	|							ТОГДА ВТОбороты_Общие.СубконтоКт2
	|						КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТОбороты_Общие.СубконтоКт3, НЕОПРЕДЕЛЕНО)) = ТИП(Справочник.ИнвентарныеНомераОС)
	|							ТОГДА ВТОбороты_Общие.СубконтоКт3
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОбороты_Общие.Период,
	|	ВТОбороты_Общие.Организация,
	|	ВТОбороты_Общие.СчетДт,
	|	ВТОбороты_Общие.СчетКт,
	|	ВТОбороты_Общие.КФО,
	|	ВТОбороты_Общие.КФОСсылка,
	|	ВТОбороты_Общие.КПСДт,
	|	ВТОбороты_Общие.КПСКт,
	|	ВТОбороты_Общие.КЭКДт,
	|	ВТОбороты_Общие.КЭККт,
	|	ВТОбороты_Общие.СубконтоДт1,
	|	ВТОбороты_Общие.СубконтоДт2,
	|	ВТОбороты_Общие.СубконтоДт3,
	|	ВТОбороты_Общие.СубконтоКт1,
	|	ВТОбороты_Общие.СубконтоКт2,
	|	ВТОбороты_Общие.СубконтоКт3,
	|	ВТОбороты_Общие.ВалютаДт,
	|	ВТОбороты_Общие.ВалютаКт,
	|	ВТОбороты_Общие.ТипКПСДт,
	|	ВТОбороты_Общие.ТипКПСКт,
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаДт1, """"),
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаДт2, """"),
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаДт3, """"),
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаДт4, """"),
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаДт5, """"),
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаДт6, """"),
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаКт1, """"),
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаКт2, """"),
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаКт3, """"),
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаКт4, """"),
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаКт5, """"),
	|	ЕСТЬNULL(ВТОбороты_Общие.АналитикаКт6, """"),
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахДт1, ЛОЖЬ),
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахДт2, ЛОЖЬ),
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахДт3, ЛОЖЬ),
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахДт4, ЛОЖЬ),
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахДт5, ЛОЖЬ),
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахДт6, ЛОЖЬ),
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахКт1, ЛОЖЬ),
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахКт2, ЛОЖЬ),
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахКт3, ЛОЖЬ),
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахКт4, ЛОЖЬ),
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахКт5, ЛОЖЬ),
	|	ЕСТЬNULL(ВТОбороты_Общие.ОбязательноВОборотахКт6, ЛОЖЬ)," + 
	?(ПараметрыВыполнения.ИспользуетсяБГУСпец, СтрЗаменить(МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконто(), "%Суффикс", "Дт"), "
	|	ЕПСБУВидыСубконтоДт1.ВидСубконто") + ",
	|	ЕПСБУВидыСубконтоДт2.ВидСубконто,
	|	ЕПСБУВидыСубконтоДт3.ВидСубконто," + 
	?(ПараметрыВыполнения.ИспользуетсяБГУСпец, СтрЗаменить(МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконто(), "%Суффикс", "Кт"), "
	|	ЕПСБУВидыСубконтоКт1.ВидСубконто") + ",
	|	ЕПСБУВидыСубконтоКт2.ВидСубконто,
	|	ЕПСБУВидыСубконтоКт3.ВидСубконто,
	|	ВТОбороты_Общие.СчетСсылкаДт.Код,
	|	ВТОбороты_Общие.СчетСсылкаКт.Код,
	|	ВТОбороты_Общие.СчетСсылкаДт,
	|	ВТОбороты_Общие.СчетСсылкаКт,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОбороты_Общие.АналитикаКт1 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт2 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт3 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт4 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт5 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОбороты_Общие.АналитикаДт1 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт2 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт3 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт4 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт5 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОбороты_Общие.АналитикаДт1 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт2 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт3 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт4 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт5 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОбороты_Общие.СубконтоДт1" + 
	СтрЗаменить(СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|					КОГДА " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение() + "
	|						ТОГДА ВТОбороты_Общие.СубконтоДт1", ""), "%ИмяВТ", "ВТОбороты_Общие"), "%Суффикс", "Дт") + "
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОбороты_Общие.СубконтоДт2
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОбороты_Общие.СубконтоДт3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОбороты_Общие.АналитикаКт1 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт2 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт3 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт4 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт5 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОбороты_Общие.СубконтоКт1" + 
	СтрЗаменить(СтрЗаменить(?(ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|					КОГДА " + МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение() + "
	|						ТОГДА ВТОбороты_Общие.СубконтоКт1", ""), "%ИмяВТ", "ВТОбороты_Общие"), "%Суффикс", "Кт") + "
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОбороты_Общие.СубконтоКт2
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОбороты_Общие.СубконтоКт3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт1) = ТИП(Справочник.Договоры) 
	|		ТОГДА  ВТОбороты_Общие.СубконтоДт1 
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт2) = ТИП(Справочник.Договоры)
	|		ТОГДА  ВТОбороты_Общие.СубконтоДт2
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт3) = ТИП(Справочник.Договоры)
	|		ТОГДА  ВТОбороты_Общие.СубконтоДт3
	|	КОНЕЦ, 
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт1) = ТИП(Справочник.Договоры) 
	|		ТОГДА  ВТОбороты_Общие.СубконтоКт1 
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт2) = ТИП(Справочник.Договоры)
	|		ТОГДА  ВТОбороты_Общие.СубконтоКт2
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт3) = ТИП(Справочник.Договоры)
	|		ТОГДА  ВТОбороты_Общие.СубконтоКт3
	|	КОНЕЦ,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт1) = ТИП(Справочник.Контрагенты) 
	|		ТОГДА  ВТОбороты_Общие.СубконтоДт1 
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт2) = ТИП(Справочник.Контрагенты)
	|		ТОГДА  ВТОбороты_Общие.СубконтоДт2
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт3) = ТИП(Справочник.Контрагенты)
	|		ТОГДА  ВТОбороты_Общие.СубконтоДт3
	|	КОНЕЦ,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт1) = ТИП(Справочник.Контрагенты) 
	|		ТОГДА  ВТОбороты_Общие.СубконтоКт1 
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт2) = ТИП(Справочник.Контрагенты)
	|		ТОГДА  ВТОбороты_Общие.СубконтоКт2
	|	КОГДА ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт3) = ТИП(Справочник.Контрагенты)
	|		ТОГДА  ВТОбороты_Общие.СубконтоКт3
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОбороты_Общие.АналитикаДт1 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт2 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт3 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт4 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт5 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаДт6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОбороты_Общие.СубконтоДт1
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОбороты_Общие.СубконтоДт2
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОбороты_Общие.СубконтоДт3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОбороты_Общие.АналитикаКт1 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт2 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт3 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт4 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт5 = ""KONTRAGENT""
	|						И НЕ ВТОбороты_Общие.АналитикаКт6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОбороты_Общие.СубконтоКт1
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОбороты_Общие.СубконтоКт2
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОбороты_Общие.СубконтоКт3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)
	|	КОНЕЦ,
	|	НЕ(НЕ ВТОбороты_Общие.АналитикаДт1 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаДт2 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаДт3 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаДт4 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаДт5 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаДт6 = ""KONTRAGENT"")
	|		И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|		И (НЕ(НЕ ЕПСБУВидыСубконтоДт1.ВидСубконто ЕСТЬ NULL
	|					И ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт1) = ТИП(Справочник.Контрагенты))
	|			И НЕ(НЕ ЕПСБУВидыСубконтоДт2.ВидСубконто ЕСТЬ NULL
	|					И ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт2) = ТИП(Справочник.Контрагенты))
	|			И НЕ(НЕ ЕПСБУВидыСубконтоДт3.ВидСубконто ЕСТЬ NULL
	|					И ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоДт3) = ТИП(Справочник.Контрагенты))),
	|	НЕ(НЕ ВТОбороты_Общие.АналитикаКт1 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаКт2 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаКт3 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаКт4 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаКт5 = ""KONTRAGENT""
	|				И НЕ ВТОбороты_Общие.АналитикаКт6 = ""KONTRAGENT"")
	|		И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			И НЕ ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|		И (НЕ(НЕ ЕПСБУВидыСубконтоКт1.ВидСубконто ЕСТЬ NULL
	|					И ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт1) = ТИП(Справочник.Контрагенты))
	|			И НЕ(НЕ ЕПСБУВидыСубконтоКт2.ВидСубконто ЕСТЬ NULL
	|					И ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт2) = ТИП(Справочник.Контрагенты))
	|			И НЕ(НЕ ЕПСБУВидыСубконтоКт3.ВидСубконто ЕСТЬ NULL
	|					И ТИПЗНАЧЕНИЯ(ВТОбороты_Общие.СубконтоКт3) = ТИП(Справочник.Контрагенты))),
	|	ВТОбороты_Общие.МежотчетныйПериод,
	|	ВТОбороты_Общие.ЗаключениеСчетов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТребуетсяСубконтоДт4,
	|	ТребуетсяСубконтоКт4,
	|	ДоговорДт,
	|	ДоговорКт,
	|	ОбъектыФВДт,
	|	ОбъектыФВКт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОбороты_Общие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////" + ?(ПараметрыВыполнения.ИспользуетсяУчетФинВложений, "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦенныеБумагиОбороты.Период КАК Период,
	|	ЦенныеБумагиОбороты.Организация КАК Организация,
	|	ЦенныеБумагиОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЦенныеБумагиОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ЦенныеБумагиОбороты.КоличествоРасход КАК КоличествоРасход
	|ПОМЕСТИТЬ ВТЦенныеБумагиОбороты
	|ИЗ
	|	РегистрНакопления.ЦенныеБумаги.Обороты(&ДатаНачала, &ДатаОкончания, День, ) КАК ЦенныеБумагиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОборотыБезСубконто4.Период КАК Период,
	|	ВТОборотыБезСубконто4.Организация КАК Организация,
	|	ВТОборотыБезСубконто4.СчетДт КАК СчетДт,
	|	ЕСТЬNULL(ВТОборотыБезСубконто4.СубконтоДт2, ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)) КАК СубконтоДт2,
	|	СУММА(ВТОборотыБезСубконто4.Сумма) КАК Сумма,
	|	МАКСИМУМ(" + ?(ПараметрыВыполнения.ИспользуетсяУчетФинВложений, "
	|			ЕСТЬNULL(ВТЦенныеБумагиОбороты.КоличествоПриход, ВТОборотыБезСубконто4.КоличествоДт)","
	|			ВТОборотыБезСубконто4.КоличествоДт") + ") КАК КоличествоДт
	|ПОМЕСТИТЬ ВТОборотыЦенныеБумаги_Дебет
	|ИЗ
	|	ВТОборотыБезСубконто4 КАК ВТОборотыБезСубконто4" + ?(ПараметрыВыполнения.ИспользуетсяУчетФинВложений, "
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦенныеБумагиОбороты КАК ВТЦенныеБумагиОбороты
	|		ПО ВТОборотыБезСубконто4.Период = ВТЦенныеБумагиОбороты.Период
	|			И ВТОборотыБезСубконто4.Организация = ВТЦенныеБумагиОбороты.Организация
	|			И (ВЫБОР
	|					КОГДА ВТОборотыБезСубконто4.СубконтоДт2 ССЫЛКА Справочник.ОбъектыФинансовыхВложений
	|						ТОГДА ВТОборотыБезСубконто4.СубконтоДт2 = ВТЦенныеБумагиОбороты.ЦеннаяБумага
	|				КОНЕЦ)", "") + "
	|ГДЕ 
	|	ВТОборотыБезСубконто4.СчетДт = ""31""
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОборотыБезСубконто4.Период,
	|	ВТОборотыБезСубконто4.Организация,
	|	ВТОборотыБезСубконто4.СчетДт,
	|	ЕСТЬNULL(ВТОборотыБезСубконто4.СубконтоДт2, ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка))
	|
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////// 
	|ВЫБРАТЬ
	|	ВТОборотыБезСубконто4.Период КАК Период,
	|	ВТОборотыБезСубконто4.Организация КАК Организация,
	|	ВТОборотыБезСубконто4.СчетКт КАК СчетКт,
	|	ЕСТЬNULL(ВТОборотыБезСубконто4.СубконтоКт2, ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)) КАК СубконтоКт2,
	|	СУММА(ВТОборотыБезСубконто4.Сумма) КАК Сумма,
	|	МАКСИМУМ(" + ?(ПараметрыВыполнения.ИспользуетсяУчетФинВложений, "
	|			ЕСТЬNULL(ВТЦенныеБумагиОбороты.КоличествоРасход, ВТОборотыБезСубконто4.КоличествоКт)","
	|			ВТОборотыБезСубконто4.КоличествоКт") + ") КАК КоличествоКт
	|ПОМЕСТИТЬ ВТОборотыЦенныеБумаги_Кредит
	|ИЗ
	|	ВТОборотыБезСубконто4 КАК ВТОборотыБезСубконто4" + ?(ПараметрыВыполнения.ИспользуетсяУчетФинВложений, "
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦенныеБумагиОбороты КАК ВТЦенныеБумагиОбороты
	|		ПО ВТОборотыБезСубконто4.Период = ВТЦенныеБумагиОбороты.Период
	|			И ВТОборотыБезСубконто4.Организация = ВТЦенныеБумагиОбороты.Организация
	|			И (ВЫБОР
	|					КОГДА ВТОборотыБезСубконто4.СубконтоКт2 ССЫЛКА Справочник.ОбъектыФинансовыхВложений
	|						ТОГДА ВТОборотыБезСубконто4.СубконтоКт2 = ВТЦенныеБумагиОбороты.ЦеннаяБумага
	|				КОНЕЦ)", "") + "
	|ГДЕ 
	|	ВТОборотыБезСубконто4.СчетКт = ""31""
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОборотыБезСубконто4.Период,
	|	ВТОборотыБезСубконто4.Организация,
	|	ВТОборотыБезСубконто4.СчетКт,
	|	ЕСТЬNULL(ВТОборотыБезСубконто4.СубконтоКт2, ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка))
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////", "") + "
	|ВЫБРАТЬ
	|	ВТОборотыБезСубконто4.Период КАК Период,
	|	ВТОборотыБезСубконто4.Организация КАК Организация,
	|	ВТОборотыБезСубконто4.СчетДт КАК СчетДт,
	|	ВТОборотыБезСубконто4.СчетКт КАК СчетКт,
	|	ВТОборотыБезСубконто4.КФО КАК КФО,
	|	ВТОборотыБезСубконто4.КФОСсылка КАК КФОСсылка,
	|	ПОДСТРОКА(ВТОборотыБезСубконто4.КПСДт, 1, 17) КАК КПСДт,
	|	ПОДСТРОКА(ВТОборотыБезСубконто4.КПСКт, 1, 17) КАК КПСКт,
	|	ВТОборотыБезСубконто4.КЭКДт КАК КЭКДт,
	|	ВТОборотыБезСубконто4.КЭККт КАК КЭККт,
	|	ВТОборотыБезСубконто4.СубконтоДт1 КАК СубконтоДт1,
	|	ВТОборотыБезСубконто4.СубконтоДт2 КАК СубконтоДт2,
	|	ВТОборотыБезСубконто4.СубконтоДт3 КАК СубконтоДт3,
	|	ЕСТЬNULL(ЕСТЬNULL(ДоговорыДт.Контрагент, ОбъектыФинансовыхВложенийДт.Контрагент), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК СубконтоДт4,
	|	ВТОборотыБезСубконто4.СубконтоКт1 КАК СубконтоКт1,
	|	ВТОборотыБезСубконто4.СубконтоКт2 КАК СубконтоКт2,
	|	ВТОборотыБезСубконто4.СубконтоКт3 КАК СубконтоКт3,
	|	ЕСТЬNULL(ЕСТЬNULL(ДоговорыКт.Контрагент, ОбъектыФинансовыхВложенийКт.Контрагент), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК СубконтоКт4,
	|	%ПоляРазвернутыеАналитикиОбороты
	|	ВТОборотыБезСубконто4.Сумма КАК Сумма, 
	|	ВЫБОР
	|		КОГДА ВТОборотыБезСубконто4.СчетДт = ""31"" И ВТОборотыБезСубконто4.Сумма <> 0" + ?(ПараметрыВыполнения.ИспользуетсяУчетФинВложений, "
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТОборотыЦенныеБумаги_Дебет.КоличествоДт, ВТОборотыБезСубконто4.КоличествоДт) /
	|				(ВЫРАЗИТЬ(ЕСТЬNULL(ВТОборотыЦенныеБумаги_Дебет.Сумма, ВТОборотыБезСубконто4.Сумма) КАК Число(38,20)) / ВТОборотыБезСубконто4.Сумма) КАК Число(24))","
	|			ТОГДА ВТОборотыБезСубконто4.КоличествоДт") + "
	|		ИНАЧЕ ВТОборотыБезСубконто4.КоличествоДт
	|	КОНЕЦ КАК КоличествоДт, 
	|	ВЫБОР
	|		КОГДА ВТОборотыБезСубконто4.СчетКт = ""31"" И ВТОборотыБезСубконто4.Сумма <> 0" + ?(ПараметрыВыполнения.ИспользуетсяУчетФинВложений, "
	|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТОборотыЦенныеБумаги_Кредит.КоличествоКт, ВТОборотыБезСубконто4.КоличествоКт) /
	|				(ЕСТЬNULL(ВТОборотыЦенныеБумаги_Кредит.Сумма, ВТОборотыБезСубконто4.Сумма) / ВТОборотыБезСубконто4.Сумма) КАК Число(24))","
	|			ТОГДА ВТОборотыБезСубконто4.КоличествоКт") + "
	|		ИНАЧЕ ВТОборотыБезСубконто4.КоличествоКт
	|	КОНЕЦ КАК КоличествоКт,
	|	ВТОборотыБезСубконто4.ВалютаДт КАК ВалютаДт,
	|	ВТОборотыБезСубконто4.ВалютаКт КАК ВалютаКт,
	|	ВТОборотыБезСубконто4.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
	|	ВТОборотыБезСубконто4.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт,
	|	ВТОборотыБезСубконто4.АналитикаДт1 КАК АналитикаДт1,
	|	ВТОборотыБезСубконто4.АналитикаДт2 КАК АналитикаДт2,
	|	ВТОборотыБезСубконто4.АналитикаДт3 КАК АналитикаДт3,
	|	ВТОборотыБезСубконто4.АналитикаДт4 КАК АналитикаДт4,
	|	ВТОборотыБезСубконто4.АналитикаДт5 КАК АналитикаДт5,
	|	ВТОборотыБезСубконто4.АналитикаДт6 КАК АналитикаДт6,
	|	ВТОборотыБезСубконто4.АналитикаКт1 КАК АналитикаКт1,
	|	ВТОборотыБезСубконто4.АналитикаКт2 КАК АналитикаКт2,
	|	ВТОборотыБезСубконто4.АналитикаКт3 КАК АналитикаКт3,
	|	ВТОборотыБезСубконто4.АналитикаКт4 КАК АналитикаКт4,
	|	ВТОборотыБезСубконто4.АналитикаКт5 КАК АналитикаКт5,
	|	ВТОборотыБезСубконто4.АналитикаКт6 КАК АналитикаКт6,
	|	ВТОборотыБезСубконто4.ОбязательноВОборотахДт1 КАК ОбязательноВОборотахДт1,
	|	ВТОборотыБезСубконто4.ОбязательноВОборотахДт2 КАК ОбязательноВОборотахДт2,
	|	ВТОборотыБезСубконто4.ОбязательноВОборотахДт3 КАК ОбязательноВОборотахДт3,
	|	ВТОборотыБезСубконто4.ОбязательноВОборотахДт4 КАК ОбязательноВОборотахДт4,
	|	ВТОборотыБезСубконто4.ОбязательноВОборотахДт5 КАК ОбязательноВОборотахДт5,
	|	ВТОборотыБезСубконто4.ОбязательноВОборотахДт6 КАК ОбязательноВОборотахДт6,
	|	ВТОборотыБезСубконто4.ОбязательноВОборотахКт1 КАК ОбязательноВОборотахКт1,
	|	ВТОборотыБезСубконто4.ОбязательноВОборотахКт2 КАК ОбязательноВОборотахКт2,
	|	ВТОборотыБезСубконто4.ОбязательноВОборотахКт3 КАК ОбязательноВОборотахКт3,
	|	ВТОборотыБезСубконто4.ОбязательноВОборотахКт4 КАК ОбязательноВОборотахКт4,
	|	ВТОборотыБезСубконто4.ОбязательноВОборотахКт5 КАК ОбязательноВОборотахКт5,
	|	ВТОборотыБезСубконто4.ОбязательноВОборотахКт6 КАК ОбязательноВОборотахКт6,
	|	ВТОборотыБезСубконто4.ТипКПСДт КАК ТипКПСДт,
	|	ВТОборотыБезСубконто4.ТипКПСКт КАК ТипКПСКт,
	|	ВТОборотыБезСубконто4.УИ_Дт1 КАК УИ_Дт1,
	|	ВТОборотыБезСубконто4.УИ_Дт2 КАК УИ_Дт2,
	|	ВТОборотыБезСубконто4.УИ_Дт3 КАК УИ_Дт3,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЕСТЬNULL(ЕСТЬNULL(ДоговорыДт.Контрагент, ОбъектыФинансовыхВложенийДт.Контрагент), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))) КАК УИ_Дт4,
	|	ВТОборотыБезСубконто4.ДоговорДтСоединение КАК ДоговорДт,
    |   ДоговорыДтСоединение.Контрагент = ЕСТЬNULL(ЕСТЬNULL(ДоговорыДт.Контрагент, ОбъектыФинансовыхВложенийДт.Контрагент), ВТОборотыБезСубконто4.КонтрагентДтСоединение) КАК ПолучитьGRAF_ISPДт,
	|	ВТОборотыБезСубконто4.УИ_Кт1 КАК УИ_Кт1,
	|	ВТОборотыБезСубконто4.УИ_Кт2 КАК УИ_Кт2,
	|	ВТОборотыБезСубконто4.УИ_Кт3 КАК УИ_Кт3,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЕСТЬNULL(ЕСТЬNULL(ДоговорыКт.Контрагент, ОбъектыФинансовыхВложенийКт.Контрагент), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))) КАК УИ_Кт4,
	|	ВТОборотыБезСубконто4.ДоговорКтСоединение КАК ДоговорКт,
	|   ДоговорыКтСоединение.Контрагент = ЕСТЬNULL(ЕСТЬNULL(ДоговорыКт.Контрагент, ОбъектыФинансовыхВложенийКт.Контрагент), ВТОборотыБезСубконто4.КонтрагентКтСоединение) КАК ПолучитьGRAF_ISPКт,
	|	ВТОборотыБезСубконто4.УИ_Организации КАК УИ_Организации,
	|	ВТОборотыБезСубконто4.ВидСубконтоДт1 КАК ВидСубконтоДт1,
	|	ВТОборотыБезСубконто4.ВидСубконтоДт2 КАК ВидСубконтоДт2,
	|	ВТОборотыБезСубконто4.ВидСубконтоДт3 КАК ВидСубконтоДт3,
	|	ВТОборотыБезСубконто4.ВидСубконтоДт4 КАК ВидСубконтоДт4,
	|	ВТОборотыБезСубконто4.ВидСубконтоКт1 КАК ВидСубконтоКт1,
	|	ВТОборотыБезСубконто4.ВидСубконтоКт2 КАК ВидСубконтоКт2,
	|	ВТОборотыБезСубконто4.ВидСубконтоКт3 КАК ВидСубконтоКт3,
	|	ВТОборотыБезСубконто4.ВидСубконтоКт4 КАК ВидСубконтоКт4,
	|	ВТОборотыБезСубконто4.СубСчетДт КАК СубСчетДт,
	|	ВТОборотыБезСубконто4.СубСчетКт КАК СубСчетКт,
	|	ВТОборотыБезСубконто4.СчетСсылкаДт КАК СчетСсылкаДт,
	|	ВТОборотыБезСубконто4.СчетСсылкаКт КАК СчетСсылкаКт,
	|	ВТОборотыБезСубконто4.МежотчетныйПериод КАК МежотчетныйПериод,
	|	ВТОборотыБезСубконто4.ЗаключениеСчетов КАК ЗаключениеСчетов
	|ПОМЕСТИТЬ ВТОбороты
	|ИЗ
	|	ВТОборотыБезСубконто4 КАК ВТОборотыБезСубконто4
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК ДоговорыДт
	|		ПО (ВТОборотыБезСубконто4.ТребуетсяСубконтоДт4)
	|			И ВТОборотыБезСубконто4.ДоговорДт = ДоговорыДт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК ДоговорыКт
	|		ПО (ВТОборотыБезСубконто4.ТребуетсяСубконтоКт4)
	|			И ВТОборотыБезСубконто4.ДоговорКт = ДоговорыКт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК ДоговорыДтСоединение
	|		ПО ВТОборотыБезСубконто4.ДоговорДтСоединение = ДоговорыДтСоединение.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК ДоговорыКтСоединение
	|		ПО ВТОборотыБезСубконто4.ДоговорКтСоединение = ДоговорыКтСоединение.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФинансовыхВложений КАК ОбъектыФинансовыхВложенийДт
	|		ПО (ВТОборотыБезСубконто4.ТребуетсяСубконтоДт4)
	|			И ВТОборотыБезСубконто4.ОбъектыФВДт = ОбъектыФинансовыхВложенийДт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФинансовыхВложений КАК ОбъектыФинансовыхВложенийКт
	|		ПО (ВТОборотыБезСубконто4.ТребуетсяСубконтоКт4)
	|			И ВТОборотыБезСубконто4.ОбъектыФВКт = ОбъектыФинансовыхВложенийКт.Ссылка" + ?(ПараметрыВыполнения.ИспользуетсяУчетФинВложений, "
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОборотыЦенныеБумаги_Дебет КАК ВТОборотыЦенныеБумаги_Дебет
	|		ПО ВТОборотыБезСубконто4.Период = ВТОборотыЦенныеБумаги_Дебет.Период
	|			И ВТОборотыБезСубконто4.Организация = ВТОборотыЦенныеБумаги_Дебет.Организация
	|			И ЕСТЬNULL(ВТОборотыБезСубконто4.СубконтоДт2, ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)) = ВТОборотыЦенныеБумаги_Дебет.СубконтоДт2
	|			И ВТОборотыБезСубконто4.СчетДт = ВТОборотыЦенныеБумаги_Дебет.СчетДт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОборотыЦенныеБумаги_Кредит КАК ВТОборотыЦенныеБумаги_Кредит
	|		ПО ВТОборотыБезСубконто4.Период = ВТОборотыЦенныеБумаги_Кредит.Период
	|			И ВТОборотыБезСубконто4.Организация = ВТОборотыЦенныеБумаги_Кредит.Организация
	|			И ЕСТЬNULL(ВТОборотыБезСубконто4.СубконтоКт2, ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)) = ВТОборотыЦенныеБумаги_Кредит.СубконтоКт2
	|			И ВТОборотыБезСубконто4.СчетКт = ВТОборотыЦенныеБумаги_Кредит.СчетКт", "") + "

	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаДт1,
	|	АналитикаДт2,
	|	АналитикаДт3,
	|	АналитикаДт4,
	|	АналитикаДт5,
	|	АналитикаДт6,
	|	АналитикаКт1,
	|	АналитикаКт2,
	|	АналитикаКт3,
	|	АналитикаКт4,
	|	АналитикаКт5,
	|	АналитикаКт6,
	|	УИ_Дт1,
	|	УИ_Дт2,
	|	УИ_Дт3,
	|	УИ_Дт4,
	|	УИ_Кт1,
	|	УИ_Кт2,
	|	УИ_Кт3,
	|	УИ_Кт4,
	|	УИ_Организации,
	|	ВидСубконтоДт1,
	|	ВидСубконтоДт2,
	|	ВидСубконтоДт3,
	|	ВидСубконтоДт4,
	|	ВидСубконтоКт1,
	|	ВидСубконтоКт2,
	|	ВидСубконтоКт3,
	|	ВидСубконтоКт4,
	|	СубСчетДт,
	|	СубСчетКт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" + ?(ПараметрыВыполнения.ПакетныйРежимВыгрузки, "", ПолучитьТекстЗапросаАналитик(ПараметрыВыполнения)) + "
	|ВЫБРАТЬ
	|	ВТТаблицаСвязейАналитик.Аналитика1 КАК Аналитика1
	|ПОМЕСТИТЬ ВТИменаАналитикПредварительно
	|ИЗ
	|	ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТТаблицаСвязейАналитик.Аналитика2
	|ИЗ
	|	ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТТаблицаСвязейАналитик.Аналитика3
	|ИЗ
	|	ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТТаблицаСвязейАналитик.Аналитика4
	|ИЗ
	|	ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТТаблицаСвязейАналитик.Аналитика5
	|ИЗ
	|	ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТТаблицаСвязейАналитик.Аналитика6
	|ИЗ
	|	ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ORGANIZATION""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТИменаАналитикПредварительно.Аналитика1 КАК ИмяАналитики
	|ПОМЕСТИТЬ ВТИменаАналитик
	|ИЗ
	|	ВТИменаАналитикПредварительно КАК ВТИменаАналитикПредварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТИменаАналитикПредварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТаблицаСвязейАналитик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОрганизацииФедеральногоБюджета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЕПСБУВидыСубконто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПланСчетов" + ?(ПараметрыВыполнения.ИспользуетсяУчетФинВложений, "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТЦенныеБумагиОстаткиНачало
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТЦенныеБумагиОстаткиКонец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТЦенныеБумагиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОборотыЦенныеБумаги_Дебет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОборотыЦенныеБумаги_Кредит", ""));    
	
	#КонецОбласти	
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыВыполнения.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПараметрыВыполнения.ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДатаОкончанияГраница", Новый Граница(Новый МоментВремениСУточнениемПериода(КонецДня(ПараметрыВыполнения.ОкончаниеПериода), 1), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаОкончанияГраницаЗакрытие", КонецДня(ПараметрыВыполнения.ОкончаниеПериода) + 1);
	Запрос.УстановитьПараметр("ДатаОкончанияГраницаВключая", Новый Граница(КонецДня(ПараметрыВыполнения.ОкончаниеПериода), ВидГраницы.Включая));	
	
	Запрос.УстановитьПараметр("Версия", ДанныеВерсии); 
	Запрос.УстановитьПараметр("Организация", ПараметрыВыполнения.Организация);
	
	Запрос.УстановитьПараметр("СчетаКИСЕ", СчетаКИСЕ);
	Запрос.УстановитьПараметр("ОборотныеСчета", ОборотныеСчета);
	Запрос.УстановитьПараметр("СчетаПоКЭК", СчетаПоКЭК);
	Запрос.УстановитьПараметр("СчетаИсключенияОС", СчетаИсключенияОС);
	Запрос.УстановитьПараметр("Счет101", МодульБухгалтерскийУчет.СписокСчетов(СтрРазделить("101.00,102.00,103.00,104.00,106.00,108.00,111.00," +
	"01,02,09,13,21,22,24,25,26,27,38,39", ",")));
	Запрос.УстановитьПараметр("Счет104", МодульБухгалтерскийУчет.СписокСчетов(СтрРазделить("104.00", ",")));
	Запрос.УстановитьПараметр("Счет114", МодульБухгалтерскийУчет.СписокСчетов(СтрРазделить("114.00", ",")));
	
	Для каждого СтрокаПериод Из ПараметрыВыполнения.ПерезагружаемыеПериоды Цикл
		Запрос.УстановитьПараметр(СтрокаПериод.ИмяПараметрДата, СтрокаПериод.ОкончаниеПериода);	
	КонецЦикла;
	Запрос.УстановитьПараметр("СчетаПерезагружаемыеПериоды", ПараметрыВыполнения.МассивСчетовПерезагружаемые);
	
	Запрос.УстановитьПараметр("СчетаСанкционирования", СчетаСанкционирования);
	
	Для каждого СтрокаСубконто Из ПараметрыВыполнения.СубконтоНаСчетах Цикл
		Запрос.УстановитьПараметр("Счета_" + СтрокаСубконто.Идентификатор, СтрокаСубконто.МассивСчетов);
		Запрос.УстановитьПараметр("МассивСубконто_" + СтрокаСубконто.Идентификатор, СтрокаСубконто.МассивСубконто);
	КонецЦикла;	
	Запрос.УстановитьПараметр("СчетаДляСубконто", ПараметрыВыполнения.СчетаДляСубконто);
	Запрос.УстановитьПараметр("ВидыСубконтоТаблица", ПараметрыВыполнения.ВидыСубконтоТаблица);
	
	#Область ПоляАналитик 
	
	ТекстПоляАналитикиОстатки = "";  
	ТекстПоляАналитикиОборотыДт = "";
	ТекстПоляАналитикиОборотыКт = "";
	
	ЗапросВидыСубконто = Новый Запрос;
	ЗапросВидыСубконто.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросВидыСубконто.Текст = ТекстСвязейСВидамиСубконто() + "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВидыСубконтоАналитик.ИмяАналитики КАК ИмяАналитики,
	|	ВТ_ВидыСубконтоАналитик.ВидСубконто КАК ВидСубконто
	|ИЗ
	|	ВТ_ВидыСубконтоАналитик КАК ВТ_ВидыСубконтоАналитик
	|ИТОГИ ПО
	|	ИмяАналитики";
	ВыборкаИмяАналитики = ЗапросВидыСубконто.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	ШаблонПолеОстатки = "ВЫБОР
	|		КОГДА ВТОстаткиБезСубконто4.ВидСубконто1 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА ВТОстаткиБезСубконто4.Субконто1
	|		КОГДА ВТОстаткиБезСубконто4.ВидСубконто2 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА ВТОстаткиБезСубконто4.Субконто2
	|		КОГДА ВТОстаткиБезСубконто4.ВидСубконто3 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА ВТОстаткиБезСубконто4.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК %ИмяАналитики,
	|";  
	
	ШаблонПолеОстаткиКонтрагент = "ВЫБОР
	|		КОГДА ВТОстаткиБезСубконто4.ВидСубконто1 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА ВТОстаткиБезСубконто4.Субконто1
	|		КОГДА ВТОстаткиБезСубконто4.ВидСубконто2 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА ВТОстаткиБезСубконто4.Субконто2
	|		КОГДА ВТОстаткиБезСубконто4.ВидСубконто3 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА ВТОстаткиБезСубконто4.Субконто3
	|		КОГДА ВТОстаткиБезСубконто4.ВидСубконто4 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЕСТЬNULL(ЕСТЬNULL(Договоры.Контрагент, ОбъектыФинансовыхВложений.Контрагент), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)))
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК %ИмяАналитики,
	|";
	
	ШаблонПолеОбороты = "ВЫБОР
	|		КОГДА ВТОборотыБезСубконто4.ВидСубконто%Суффикс1 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА ВТОборотыБезСубконто4.УИ_%Суффикс1
	|		КОГДА ВТОборотыБезСубконто4.ВидСубконто%Суффикс2 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА ВТОборотыБезСубконто4.УИ_%Суффикс2
	|		КОГДА ВТОборотыБезСубконто4.ВидСубконто%Суффикс3 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА ВТОборотыБезСубконто4.УИ_%Суффикс3 
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК %ИмяАналитики_%Суффикс,
	|"; 
	
	ШаблонПолеОборотыКонтрагент = "ВЫБОР
	|		КОГДА ВТОборотыБезСубконто4.ВидСубконто%Суффикс1 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА ВТОборотыБезСубконто4.УИ_%Суффикс1
	|		КОГДА ВТОборотыБезСубконто4.ВидСубконто%Суффикс2 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА ВТОборотыБезСубконто4.УИ_%Суффикс2
	|		КОГДА ВТОборотыБезСубконто4.ВидСубконто%Суффикс3 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА ВТОборотыБезСубконто4.УИ_%Суффикс3
	|		КОГДА ВТОборотыБезСубконто4.ВидСубконто%Суффикс4 В (&ВидыСубконто_%ИмяАналитики)
	|			ТОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЕСТЬNULL(ЕСТЬNULL(Договоры%Суффикс.Контрагент, ОбъектыФинансовыхВложений%Суффикс.Контрагент), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))) 
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК %ИмяАналитики_%Суффикс,
	|"; 
			
	Пока ВыборкаИмяАналитики.Следующий() Цикл
		ЭтоКонтрагент = ВыборкаИмяАналитики.ИмяАналитики = "KONTRAGENT";
		ТекстПоляАналитикиОстатки = ТекстПоляАналитикиОстатки + СтрЗаменить(?(ЭтоКонтрагент, ШаблонПолеОстаткиКонтрагент, ШаблонПолеОстатки), "%ИмяАналитики", ВыборкаИмяАналитики.ИмяАналитики);		
		ТекстПоляАналитикиОборотыДт = ТекстПоляАналитикиОборотыДт + СтрЗаменить(?(ЭтоКонтрагент, ШаблонПолеОборотыКонтрагент, ШаблонПолеОбороты), "%ИмяАналитики", ВыборкаИмяАналитики.ИмяАналитики);
		ТекстПоляАналитикиОборотыДт = СтрЗаменить(ТекстПоляАналитикиОборотыДт, "%Суффикс", "Дт");
		ТекстПоляАналитикиОборотыКт = ТекстПоляАналитикиОборотыКт + СтрЗаменить(?(ЭтоКонтрагент, ШаблонПолеОборотыКонтрагент, ШаблонПолеОбороты), "%ИмяАналитики", ВыборкаИмяАналитики.ИмяАналитики);
		ТекстПоляАналитикиОборотыКт = СтрЗаменить(ТекстПоляАналитикиОборотыКт, "%Суффикс", "Кт");	
	
		МассивВидовСубконто = Новый Массив;
		ВыборкаВидыСубконто = ВыборкаИмяАналитики.Выбрать();
		Пока ВыборкаВидыСубконто.Следующий() Цикл
			МассивВидовСубконто.Добавить(ВыборкаВидыСубконто.ВидСубконто);		
		КонецЦикла;
		Запрос.УстановитьПараметр("ВидыСубконто_" + ВыборкаИмяАналитики.ИмяАналитики, МассивВидовСубконто);
	КонецЦикла;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ПоляРазвернутыеАналитикиОстатки", ТекстПоляАналитикиОстатки); 
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ПоляРазвернутыеАналитикиОбороты", ТекстПоляАналитикиОборотыДт + ТекстПоляАналитикиОборотыКт); 
	
	#КонецОбласти
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СпецАналитикуВМенеджерВТ(МенеджерВТ, МассивВидовСубконто, Аналитика, АналитикиСтрокой = Неопределено, ПараметрыВыполнения)
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	Если АналитикиСтрокой = Неопределено Тогда
		АналитикиСтрокой = МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Аналитика);
	КонецЕсли;
	Запрос = Новый Запрос;
	Если ПараметрыВыполнения.ПакетныйРежимВыгрузки Тогда
		ТекстЗапроса = 		ПолучитьТекстЗапросаАналитик(ПараметрыВыполнения) + "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТАналитики.Аналитика КАК Аналитика
		|ПОМЕСТИТЬ ВТАналитики_%1
		|ИЗ
		|	ВТАналитики КАК ВТАналитики
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Аналитика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТАналитики";
	Иначе	
		ТекстЗапроса = 		"
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТАналитики.Аналитика КАК Аналитика
		|ПОМЕСТИТЬ ВТАналитики_%1
		|ИЗ
		|	ВТАналитики КАК ВТАналитики
		|ГДЕ
		|	ВТАналитики.ВидСубконто В (&МассивВидовСубконто)
		|	И (ВТАналитики.Аналитика1 В (&АналитикиСтрокой)
		|			ИЛИ ВТАналитики.Аналитика2 В (&АналитикиСтрокой)
		|			ИЛИ ВТАналитики.Аналитика3 В (&АналитикиСтрокой)
		|			ИЛИ ВТАналитики.Аналитика4 В (&АналитикиСтрокой)
		|			ИЛИ ВТАналитики.Аналитика5 В (&АналитикиСтрокой)
		|			ИЛИ ВТАналитики.Аналитика6 В (&АналитикиСтрокой))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Аналитика";
	КонецЕсли;
	Запрос.Текст = СтрШаблон(ТекстЗапроса, Аналитика);
	Запрос.УстановитьПараметр("АналитикиСтрокой", АналитикиСтрокой);
	Запрос.УстановитьПараметр("МассивВидовСубконто", МассивВидовСубконто);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СпецАналитикиНаборомВМенеджерВТ(МенеджерВТ, Аналитика)
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = СтрШаблон("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОбороты.СубконтоДт1 КАК Субконто1,
	|	ВТОбороты.СубконтоДт2 КАК Субконто2,
	|	ВТОбороты.СубконтоДт3 КАК Субконто3
	|ПОМЕСТИТЬ ВТАналитики_
	|ИЗ
	|	ВТОбороты КАК ВТОбороты
	|ГДЕ
	|	(ВТОбороты.АналитикаДт1 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаДт2 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаДт3 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаДт4 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаДт5 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаДт6 = &Аналитика)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОбороты.СубконтоКт1,
	|	ВТОбороты.СубконтоКт2,
	|	ВТОбороты.СубконтоКт3
	|ИЗ
	|	ВТОбороты КАК ВТОбороты
	|ГДЕ
	|	(ВТОбороты.АналитикаКт1 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаКт2 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаКт3 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаКт4 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаКт5 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаКт6 = &Аналитика)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОстатки.Субконто11,
	|	ВТОстатки.Субконто21,
	|	ВТОстатки.Субконто31
	|ИЗ
	|	ВТОстатки КАК ВТОстатки
	|ГДЕ
	|	(ВТОстатки.Аналитика1 = &Аналитика
	|			ИЛИ ВТОстатки.Аналитика2 = &Аналитика
	|			ИЛИ ВТОстатки.Аналитика3 = &Аналитика
	|			ИЛИ ВТОстатки.Аналитика4 = &Аналитика
	|			ИЛИ ВТОстатки.Аналитика5 = &Аналитика
	|			ИЛИ ВТОстатки.Аналитика6 = &Аналитика)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТАналитики_.Субконто1 КАК Аналитика
	|ПОМЕСТИТЬ ВТАналитики_%1
	|ИЗ
	|	ВТАналитики_ КАК ВТАналитики_
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТАналитики_.Субконто2
	|ИЗ
	|	ВТАналитики_ КАК ВТАналитики_
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТАналитики_.Субконто3
	|ИЗ
	|	ВТАналитики_ КАК ВТАналитики_", Аналитика);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Аналитика", Аналитика);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 
	
	Запрос.Выполнить();
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СпецАналитикиНаборомВсехСубконтоВМенеджерВТ(МенеджерВТ, Аналитика)
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = СтрШаблон("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОбороты.СубконтоДт1 КАК Субконто1,
	|	ВТОбороты.СубконтоДт2 КАК Субконто2,
	|	ВТОбороты.СубконтоДт3 КАК Субконто3
	|ПОМЕСТИТЬ ВТАналитики_%1
	|ИЗ
	|	ВТОбороты КАК ВТОбороты
	|ГДЕ
	|	(ВТОбороты.АналитикаДт1 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаДт2 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаДт3 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаДт4 = &Аналитика  
	|			ИЛИ ВТОбороты.АналитикаДт5 = &Аналитика							 
	|			ИЛИ ВТОбороты.АналитикаДт6 = &Аналитика)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОстатки.Субконто11,
	|	ВТОстатки.Субконто21,
	|	ВТОстатки.Субконто31
	|ИЗ
	|	ВТОстатки КАК ВТОстатки
	|ГДЕ
	|	(ВТОстатки.Аналитика1 = &Аналитика
	|			ИЛИ ВТОстатки.Аналитика2 = &Аналитика
	|			ИЛИ ВТОстатки.Аналитика3 = &Аналитика
	|			ИЛИ ВТОстатки.Аналитика4 = &Аналитика
	|			ИЛИ ВТОстатки.Аналитика5 = &Аналитика							 
	|			ИЛИ ВТОстатки.Аналитика6 = &Аналитика)							 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОбороты.СубконтоКт1,
	|	ВТОбороты.СубконтоКт2,
	|	ВТОбороты.СубконтоКт3
	|ИЗ
	|	ВТОбороты КАК ВТОбороты
	|ГДЕ
	|	(ВТОбороты.АналитикаКт1 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаКт2 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаКт3 = &Аналитика
	|			ИЛИ ВТОбороты.АналитикаКт4 = &Аналитика 
	|			ИЛИ ВТОбороты.АналитикаКт5 = &Аналитика							 
	|			ИЛИ ВТОбороты.АналитикаКт6 = &Аналитика)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1,
	|	Субконто2,
	|	Субконто3", Аналитика);							 
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Аналитика", Аналитика);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 
	
	Запрос.Выполнить();	
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьАналитики(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""Организации"" - начало'"));	
	ORGANIZATION(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""Организации"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""Адрес"" - начало'"));
	ADRES(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                           
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""Адрес"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""ОС"" - начало'"));
	OS(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                           
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""ОС"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""Контрагенты"" - начало'"));
	KONTRAGENT(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);	                                
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""Контрагенты"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""Договоры"" - начало'"));
	OSN_RASCH(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);	                                    
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""Договоры"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""НМА"" - начало'"));
	NMA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);	                                        
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""НМА"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""НПА"" - начало'"));
	NPA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);	                                        
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""НПА"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""OS_V_PUTI"" - начало'"));
	OS_V_PUTI(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                    
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""OS_V_PUTI"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""OS_NMA_NPA_KAZNA"" - начало'"));
	OS_NMA_NPA_KAZNA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                             
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""OS_NMA_NPA_KAZNA"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""OS_NMA_NPA_ARENDA"" - начало'"));
	OS_NMA_NPA_ARENDA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                             
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""OS_NMA_NPA_ARENDA"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""MZ_BIO"" - начало'"));
	MZ_BIO(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);	                                    
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""MZ_BIO"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""KAP_VL_OS_NMA_NPA"" - начало'"));
	KAP_VL_OS_NMA_NPA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                            
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""KAP_VL_OS_NMA_NPA"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_ZATRAT"" - начало'"));
	VID_ZATRAT(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);	                                
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_ZATRAT"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""KAP_VL_MZ"" - начало'"));
	KAP_VL_MZ(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                    
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""KAP_VL_MZ"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""GRAF_AMORT"" - начало'"));
	GRAF_AMORT(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                   
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""GRAF_AMORT"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""SCHET"" - начало'"));
	SCHET(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                        
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""SCHET"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_DEN_DOC"" - начало'"));
	VID_DEN_DOC(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                  
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_DEN_DOC"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_DOH_BUD_PER"" - начало'"));
	VID_DOH_BUD_PER(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                  
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_DOH_BUD_PER"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""OBJ_FIN_VL"" - начало'"));
	OBJ_FIN_VL(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                   
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""OBJ_FIN_VL"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""GRAF_ISP"" - начало'"));
	GRAF_ISP(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""GRAF_ISP"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_PLAT_BUDJ"" - начало'"));
	VID_PLAT_BUDJ(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);	                            
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_PLAT_BUDJ"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""ADM_BUDJ"" - начало'"));
	ADM_BUDJ(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);	                                    
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""ADM_BUDJ"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_UDERJ"" - начало'"));
	VID_UDERJ(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);	                                
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_UDERJ"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""BSO"" - начало'"));
	BSO(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                          
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""BSO"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""MOL_SOTRUDNIK"" - начало'"));
	MOL_SOTRUDNIK(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""MOL_SOTRUDNIK"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_POST"" - начало'"));
	VID_POST(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_POST"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""MESTO_ADDR_NFA"" - начало'"));
	MESTO_ADDR_NFA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""MESTO_ADDR_NFA"" - окончание'"));
	// бывшие функции
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_RASH_PODOTCHET"" - начало'"));
	VID_RASH_PODOTCHET(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_RASH_PODOTCHET"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""TIP_IMUCH_ZAB"" - начало'"));
	TIP_IMUCH_ZAB(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""TIP_IMUCH_ZAB"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""KOD_CELI"" - начало'"));
	KOD_CELI(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""KOD_CELI"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""MESTO_ROZN"" - начало'"));
	MESTO_ROZN(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""MESTO_ROZN"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""PRICH_OSH"" - начало'"));
	PRICH_OSH(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""PRICH_OSH"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""REG_NOMER_GARANT"" - начало'"));
	REG_NOMER_GARANT(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""REG_NOMER_GARANT"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""UCH_NOMER_DO"" - начало'"));
	UCH_NOMER_DO(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""UCH_NOMER_DO"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_IMUCH"" - начало'"));
	VID_IMUCH(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_IMUCH"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_IMUCH_ZAB"" - начало'"));
	VID_IMUCH_ZAB(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_IMUCH_ZAB"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_OBESPECH"" - начало'"));
	VID_OBESPECH(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_OBESPECH"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_RACH_ZAIM_KR"" - начало'"));
	VID_RACH_ZAIM_KR(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_RACH_ZAIM_KR"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_RASH_BUD_PER"" - начало'"));
	VID_RASH_BUD_PER(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_RASH_BUD_PER"" - окончание'"));
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_REZERV"" - начало'"));
	VID_REZERV(МенеджерВТ, ПараметрыВыполнения);                                     
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Выгрузка аналитики ""VID_REZERV"" - окончание'"));
	
	МодульСбораДанныхПереопределяемый.ЗаполнитьАналитики(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения);
	
КонецПроцедуры

Процедура ЗаполнитьОбороты(Каталог, МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.ЗаполнитьОбороты(Каталог, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	#Область ТекстЗапроса
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВТОбороты.Период КАК Date,
	|	ЕСТЬNULL(ВТ_ЗначенияАналитикОрганизация.НомерПП, """") КАК ORGANIZATION,
	|	ВТОбороты.МежотчетныйПериод КАК МежотчетныйПериод,
	|	ВТОбороты.ЗаключениеСчетов КАК IsClosingOperation,
	|	ВТОбороты.СчетДт КАК Account_Dt,
	|	ВТОбороты.СчетКт КАК Account_Kt,
	|	ВТОбороты.КФО КАК KFO,
	|	ВТОбороты.КПСДт КАК KBK_Dt,
	|	ВТОбороты.КПСКт КАК KBK_Kt,
	|	ВТОбороты.ТипКПСДт КАК TypeKBK_Dt,
	|	ВТОбороты.ТипКПСКт КАК TypeKBK_Kt,
	|	ВТОбороты.КЭКДт КАК KOSGU_Dt,
	|	ВТОбороты.КЭККт КАК KOSGU_Kt,
	|	ВТОбороты.СубконтоДт1 КАК СубконтоДт1,
	|	ВТОбороты.СубконтоДт2 КАК СубконтоДт2,
	|	ВТОбороты.СубконтоДт3 КАК СубконтоДт3,
	|	ВТОбороты.СубконтоКт1 КАК СубконтоКт1,
	|	ВТОбороты.СубконтоКт2 КАК СубконтоКт2,
	|	ВТОбороты.СубконтоКт3 КАК СубконтоКт3,
	|	ЕСТЬNULL(ВТОбороты.Сумма, 0) КАК Summa,
	|	ЕСТЬNULL(ВТОбороты.КоличествоДт, 0) КАК Kol_Dt,
	|	ЕСТЬNULL(ВТОбороты.КоличествоКт, 0) КАК Kol_Kt,
	|	ВТОбороты.ВалютаДт КАК Val_Dt,
	|	ВТОбороты.ВалютаКт КАК Val_Kt,
	|	ЕСТЬNULL(ВТОбороты.ВалютнаяСуммаДт, 0) КАК ValSumma_Dt,
	|	ЕСТЬNULL(ВТОбороты.ВалютнаяСуммаКт, 0) КАК ValSumma_Kt,
	|	ВТОбороты.СубСчетДт КАК СубСчетДт, 
	|	ВТОбороты.СубСчетКт КАК СубСчетКт,
	|	%ПоляЗначенияАналитикВТОбороты_
	|	ВТОбороты.АналитикаДт1 КАК АналитикаДт1,
	|	ВТОбороты.АналитикаДт2 КАК АналитикаДт2,
	|	ВТОбороты.АналитикаДт3 КАК АналитикаДт3,
	|	ВТОбороты.АналитикаДт4 КАК АналитикаДт4,
	|	ВТОбороты.АналитикаДт5 КАК АналитикаДт5,
	|	ВТОбороты.АналитикаДт6 КАК АналитикаДт6,
	|	ВТОбороты.АналитикаКт1 КАК АналитикаКт1,
	|	ВТОбороты.АналитикаКт2 КАК АналитикаКт2,
	|	ВТОбороты.АналитикаКт3 КАК АналитикаКт3,
	|	ВТОбороты.АналитикаКт4 КАК АналитикаКт4,
	|	ВТОбороты.АналитикаКт5 КАК АналитикаКт5,
	|	ВТОбороты.АналитикаКт6 КАК АналитикаКт6,
	|	ВТОбороты.ОбязательноВОборотахДт1 КАК ОбязательноВОборотахДт1,
	|	ВТОбороты.ОбязательноВОборотахДт2 КАК ОбязательноВОборотахДт2,
	|	ВТОбороты.ОбязательноВОборотахДт3 КАК ОбязательноВОборотахДт3,
	|	ВТОбороты.ОбязательноВОборотахДт4 КАК ОбязательноВОборотахДт4,
	|	ВТОбороты.ОбязательноВОборотахДт5 КАК ОбязательноВОборотахДт5,
	|	ВТОбороты.ОбязательноВОборотахДт6 КАК ОбязательноВОборотахДт6,
	|	ВТОбороты.ОбязательноВОборотахКт1 КАК ОбязательноВОборотахКт1,
	|	ВТОбороты.ОбязательноВОборотахКт2 КАК ОбязательноВОборотахКт2,
	|	ВТОбороты.ОбязательноВОборотахКт3 КАК ОбязательноВОборотахКт3,
	|	ВТОбороты.ОбязательноВОборотахКт4 КАК ОбязательноВОборотахКт4,
	|	ВТОбороты.ОбязательноВОборотахКт5 КАК ОбязательноВОборотахКт5,
	|	ВТОбороты.ОбязательноВОборотахКт6 КАК ОбязательноВОборотахКт6
	|ПОМЕСТИТЬ ВТ_ОборотыСАналитиками
	|ИЗ
	|	ВТОбороты КАК ВТОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияАналитик КАК ВТ_ЗначенияАналитикОрганизация
	|		ПО (ВТ_ЗначенияАналитикОрганизация.ИмяАналитики = ""ORGANIZATION"")
	|			И ВТОбороты.УИ_Организации = ВТ_ЗначенияАналитикОрганизация.УИ_Субконто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаИдентификаторовGRAF_ISP КАК ВТ_ТаблицаИдентификаторовGRAF_ISP_Дт
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияАналитик КАК ВТ_ЗначенияАналитик_GRAF_ISP_Дт
	|				ПО (ВТ_ЗначенияАналитик_GRAF_ISP_Дт.ИмяАналитики = ""GRAF_ISP"")
	|				И ВТ_ЗначенияАналитик_GRAF_ISP_Дт.УИ_Субконто_GRAF = ВТ_ТаблицаИдентификаторовGRAF_ISP_Дт.УИ_GRAF_ISP
	|		ПО ВТОбороты.ПолучитьGRAF_ISPДт 
	|			И ВТОбороты.СчетСсылкаДт = ВТ_ТаблицаИдентификаторовGRAF_ISP_Дт.Счет
	|			И ВТОбороты.ДоговорДт = ВТ_ТаблицаИдентификаторовGRAF_ISP_Дт.Договор 
	|			И ВТОбороты.КФОСсылка = ВТ_ТаблицаИдентификаторовGRAF_ISP_Дт.КФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаИдентификаторовGRAF_ISP КАК ВТ_ТаблицаИдентификаторовGRAF_ISP_Кт
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияАналитик КАК ВТ_ЗначенияАналитик_GRAF_ISP_Кт
	|				ПО (ВТ_ЗначенияАналитик_GRAF_ISP_Кт.ИмяАналитики = ""GRAF_ISP"")
	|				И ВТ_ЗначенияАналитик_GRAF_ISP_Кт.УИ_Субконто_GRAF = ВТ_ТаблицаИдентификаторовGRAF_ISP_Кт.УИ_GRAF_ISP
	|		ПО ВТОбороты.ПолучитьGRAF_ISPКт 
	|			И ВТОбороты.СчетСсылкаКт = ВТ_ТаблицаИдентификаторовGRAF_ISP_Кт.Счет
	|			И ВТОбороты.ДоговорКт = ВТ_ТаблицаИдентификаторовGRAF_ISP_Кт.Договор
	|			И ВТОбороты.КФОСсылка = ВТ_ТаблицаИдентификаторовGRAF_ISP_Кт.КФО
	|		%СоединенияЗначенияАналитик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОборотыСАналитиками.Date КАК Date,
	|	ВТ_ОборотыСАналитиками.ORGANIZATION КАК ORGANIZATION,
	|	ВТ_ОборотыСАналитиками.МежотчетныйПериод КАК МежотчетныйПериод,
	|	ВТ_ОборотыСАналитиками.IsClosingOperation КАК IsClosingOperation,
	|	ВТ_ОборотыСАналитиками.Account_Dt КАК Account_Dt,
	|	ВТ_ОборотыСАналитиками.Account_Kt КАК Account_Kt,
	|	ВТ_ОборотыСАналитиками.KFO КАК KFO,
	|	ВТ_ОборотыСАналитиками.KBK_Dt КАК KBK_Dt,
	|	ВТ_ОборотыСАналитиками.KBK_Kt КАК KBK_Kt,
	|	ВТ_ОборотыСАналитиками.TypeKBK_Dt КАК TypeKBK_Dt,
	|	ВТ_ОборотыСАналитиками.TypeKBK_Kt КАК TypeKBK_Kt,
	|	ВТ_ОборотыСАналитиками.KOSGU_Dt КАК KOSGU_Dt,
	|	ВТ_ОборотыСАналитиками.KOSGU_Kt КАК KOSGU_Kt,
	|	СУММА(ВТ_ОборотыСАналитиками.Summa) КАК Summa,
	|	СУММА(ВТ_ОборотыСАналитиками.Kol_Dt) КАК Kol_Dt,
	|	СУММА(ВТ_ОборотыСАналитиками.Kol_Kt) КАК Kol_Kt,
	|	ВТ_ОборотыСАналитиками.Val_Dt КАК Val_Dt,
	|	ВТ_ОборотыСАналитиками.Val_Kt КАК Val_Kt,
	|	СУММА(ВТ_ОборотыСАналитиками.ValSumma_Dt) КАК ValSumma_Dt,
	|	СУММА(ВТ_ОборотыСАналитиками.ValSumma_Kt) КАК ValSumma_Kt,
	|	ВТ_ОборотыСАналитиками.СубСчетДт КАК СубСчетДт, 
	|	ВТ_ОборотыСАналитиками.СубСчетКт КАК СубСчетКт,
	|	ВТ_ОборотыСАналитиками.АналитикаДт1 КАК АналитикаДт1,
	|	ВТ_ОборотыСАналитиками.АналитикаДт2 КАК АналитикаДт2,
	|	ВТ_ОборотыСАналитиками.АналитикаДт3 КАК АналитикаДт3,
	|	ВТ_ОборотыСАналитиками.АналитикаДт4 КАК АналитикаДт4,
	|	ВТ_ОборотыСАналитиками.АналитикаДт5 КАК АналитикаДт5,
	|	ВТ_ОборотыСАналитиками.АналитикаДт6 КАК АналитикаДт6,
	|	ВТ_ОборотыСАналитиками.АналитикаКт1 КАК АналитикаКт1,
	|	ВТ_ОборотыСАналитиками.АналитикаКт2 КАК АналитикаКт2,
	|	ВТ_ОборотыСАналитиками.АналитикаКт3 КАК АналитикаКт3,
	|	ВТ_ОборотыСАналитиками.АналитикаКт4 КАК АналитикаКт4,
	|	ВТ_ОборотыСАналитиками.АналитикаКт5 КАК АналитикаКт5,
	|	ВТ_ОборотыСАналитиками.АналитикаКт6 КАК АналитикаКт6,
	|	%ПоляЗначенияАналитикВТОборотыСАналитиками_
	|	ДЕНЬ(ВТ_ОборотыСАналитиками.Date) КАК День
	|ИЗ
	|	ВТ_ОборотыСАналитиками КАК ВТ_ОборотыСАналитиками
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОборотыСАналитиками.Date,
	|	ВТ_ОборотыСАналитиками.ORGANIZATION, 
	|	ВТ_ОборотыСАналитиками.МежотчетныйПериод,
	|	ВТ_ОборотыСАналитиками.IsClosingOperation,
	|	ВТ_ОборотыСАналитиками.Account_Dt,
	|	ВТ_ОборотыСАналитиками.Account_Kt,
	|	ВТ_ОборотыСАналитиками.KFO,
	|	ВТ_ОборотыСАналитиками.KBK_Dt,
	|	ВТ_ОборотыСАналитиками.KBK_Kt,
	|	ВТ_ОборотыСАналитиками.TypeKBK_Dt,
	|	ВТ_ОборотыСАналитиками.TypeKBK_Kt,
	|	ВТ_ОборотыСАналитиками.KOSGU_Dt,
	|	ВТ_ОборотыСАналитиками.KOSGU_Kt,
	|	ВТ_ОборотыСАналитиками.Val_Dt,
	|	ВТ_ОборотыСАналитиками.Val_Kt,
	|	ВТ_ОборотыСАналитиками.СубСчетДт, 
	|	ВТ_ОборотыСАналитиками.СубСчетКт,
	|	ВТ_ОборотыСАналитиками.АналитикаДт1,
	|	ВТ_ОборотыСАналитиками.АналитикаДт2,
	|	ВТ_ОборотыСАналитиками.АналитикаДт3,
	|	ВТ_ОборотыСАналитиками.АналитикаДт4,
	|	ВТ_ОборотыСАналитиками.АналитикаДт5,
	|	ВТ_ОборотыСАналитиками.АналитикаДт6,
	|	ВТ_ОборотыСАналитиками.АналитикаКт1,
	|	ВТ_ОборотыСАналитиками.АналитикаКт2,
	|	ВТ_ОборотыСАналитиками.АналитикаКт3,
	|	ВТ_ОборотыСАналитиками.АналитикаКт4,
	|	ВТ_ОборотыСАналитиками.АналитикаКт5,
	|	ВТ_ОборотыСАналитиками.АналитикаКт6,
	|	%ГруппировкаВТОборотыСАналитиками
	|	ДЕНЬ(ВТ_ОборотыСАналитиками.Date)
	|ИТОГИ ПО
	|	День";
	#КонецОбласти
	
	ПоляЗначенияАналитикВТОбороты = "";
	СоединенияЗначенияАналитик = "";
	ПоляЗначенияАналитикВТОборотыСАналитиками = "";
	ГруппировкаВТОборотыСАналитиками = "";
	
	ЗапросАналитики = Новый Запрос;
	ЗапросАналитики.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросАналитики.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВидыСубконтоАналитик.ИмяАналитики КАК ИмяАналитики
	|ИЗ
	|	ВТ_ВидыСубконтоАналитик КАК ВТ_ВидыСубконтоАналитик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВидыСубконтоАналитик";
	
	ВыборкаИменаАналитик = ЗапросАналитики.Выполнить().Выбрать(); 
	
	ШаблонСоединение = 
	"
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияАналитик КАК ВТ_ЗначенияАналитик_%1_%2
	|		ПО (ВТ_ЗначенияАналитик_%1_%2.ИмяАналитики = ""%1"")
	|			И ВТ_ЗначенияАналитик_%1_%2.УИ_Субконто = ВТОбороты.%1_%2";
	
	Пока ВыборкаИменаАналитик.Следующий() Цикл
		Для НомерИтерации = 1 По 2 Цикл
			Если НомерИтерации = 1 Тогда
				Суффикс = "Дт";
			Иначе
				Суффикс = "Кт";
			КонецЕсли;
		ПоляЗначенияАналитикВТОбороты = ПоляЗначенияАналитикВТОбороты + 
		СтрШаблон("ВЫБОР КОГДА ВТ_ЗначенияАналитик_%1_%2.ИмяАналитики = ВТОбороты.Аналитика%2%3 " +
		"ИЛИ ВТ_ЗначенияАналитик_%1_%2.ИмяАналитики = ВТОбороты.Аналитика%2%4 " + 
		"ИЛИ ВТ_ЗначенияАналитик_%1_%2.ИмяАналитики = ВТОбороты.Аналитика%2%5 " + 
		"ИЛИ ВТ_ЗначенияАналитик_%1_%2.ИмяАналитики = ВТОбороты.Аналитика%2%6 " + 
		"ИЛИ ВТ_ЗначенияАналитик_%1_%2.ИмяАналитики = ВТОбороты.Аналитика%2%7 " + 
		"ИЛИ ВТ_ЗначенияАналитик_%1_%2.ИмяАналитики = ВТОбороты.Аналитика%2%8 " + 
		"ТОГДА ЕСТЬNULL(ВТ_ЗначенияАналитик_%1_%2.НомерПП, """") ИНАЧЕ """" КОНЕЦ КАК Значение_%1_%2,", 
		ВыборкаИменаАналитик.ИмяАналитики, Суффикс, "1", "2", "3", "4", "5", "6");
		Если Не ВыборкаИменаАналитик.ИмяАналитики = "GRAF_ISP" Тогда
			СоединенияЗначенияАналитик = СоединенияЗначенияАналитик + СтрШаблон(ШаблонСоединение, ВыборкаИменаАналитик.ИмяАналитики, Суффикс);
		КонецЕсли;	
		ПоляЗначенияАналитикВТОборотыСАналитиками = ПоляЗначенияАналитикВТОборотыСАналитиками + СтрШаблон("
		|	ВТ_ОборотыСАналитиками.Значение_%1_%2 КАК Значение_%1_%2,", ВыборкаИменаАналитик.ИмяАналитики, Суффикс); 
		ГруппировкаВТОборотыСАналитиками = ГруппировкаВТОборотыСАналитиками + СтрШаблон("
		|	ВТ_ОборотыСАналитиками.Значение_%1_%2,", ВыборкаИменаАналитик.ИмяАналитики, Суффикс);
		КонецЦикла;
	КонецЦикла;		 
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПоляЗначенияАналитикВТОбороты_", ПоляЗначенияАналитикВТОбороты);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СоединенияЗначенияАналитик", СоединенияЗначенияАналитик);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПоляЗначенияАналитикВТОборотыСАналитиками_", ПоляЗначенияАналитикВТОборотыСАналитиками);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ГруппировкаВТОборотыСАналитиками", ГруппировкаВТОборотыСАналитиками);
	
	Запрос = Новый Запрос(ТекстЗапроса); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоДням = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДеньНачалоПериода = День(ПараметрыВыполнения.НачалоПериода);
	КоличествоДней = День(ПараметрыВыполнения.ОкончаниеПериода) - ДеньНачалоПериода + 1; 
	
	ВыгружатьМО = Не (КонецДня(ПараметрыВыполнения.ОкончаниеПериода) = Дата(2025,12,31,23,59,59)); 
	Если ПараметрыВыполнения.ИспользоватьСхемуВыгрузки2026 И ВыгружатьМО Тогда		

		ЗаписьXMLMO = Новый ЗаписьXML(); 
		ЗаписьXMLMO.ОткрытьФайл(Каталог + "MO.xml");
		ЗаписатьШапкуНачалаЭлемента(ЗаписьXMLMO, ПараметрыВыполнения.ПространствоИменПакет);
		
	КонецЕсли;
	
	Для _День = 1 По КоличествоДней Цикл
		
		ЗаписьСобытияВЖурналРегистрации(СтрШаблон(НСтр("ru = 'Выгрузка оборотов за %1 день - начало'"), Строка(ДеньНачалоПериода)));
		
		ЗаписьXML = Новый ЗаписьXML(); 
		ЗаписьXML.ОткрытьФайл(Каталог + СтрШаблон("Data_Transactions_%1.xml", Строка(ДеньНачалоПериода)));
		ЗаписатьШапкуНачалаЭлемента(ЗаписьXML, ПараметрыВыполнения.ПространствоИменПакет); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("DataTransactions");

		ВыборкаПоДням.Сбросить();
		
		Если ВыборкаПоДням.НайтиСледующий(Новый Структура("День", ДеньНачалоПериода)) Тогда    
			
			Выборка = ВыборкаПоДням.Выбрать();  
			
			Пока Выборка.Следующий() Цикл  				
				
				ОбъектDataTransactionsDay = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "DataTransactionsDay")); 					
				ЗаполнитьЗначенияСвойств(ОбъектDataTransactionsDay, Выборка,, "TypeKBK_Dt,TypeKBK_Kt,Kol_Dt,Kol_Kt");      
				Если ЗначениеЗаполнено(Выборка.TypeKBK_Dt) Тогда
					ОбъектDataTransactionsDay.TypeKBK_Dt = Выборка.TypeKBK_Dt;
				КонецЕсли;
				Если ЗначениеЗаполнено(Выборка.TypeKBK_Kt) Тогда
					ОбъектDataTransactionsDay.TypeKBK_Kt = Выборка.TypeKBK_Kt;
				КонецЕсли;  
				
				ОбъектDataTransactionsDay.Kol_Dt = Выборка.Kol_Dt; 
				ОбъектDataTransactionsDay.Kol_Kt = Выборка.Kol_Kt;
				
				Для НомерИтерации = 1 По 2 Цикл 
					Если НомерИтерации = 1 Тогда
						Суффикс = "Дт";
						Суффикс2 = "Dt";
					Иначе
						Суффикс = "Кт";
						Суффикс2 = "Kt";
					КонецЕсли;	
					Если ЗначениеЗаполнено(Выборка["Аналитика" + Суффикс + "1"]) Тогда
						Analytics_1 = "";
						Если Выборка["Аналитика" + Суффикс + "1"] = "TOVAR_ROZN" Тогда
							Если Выборка["СубСчет" + Суффикс] = "105.2В" ИЛИ Выборка["СубСчет" + Суффикс] = "105.3В" Тогда
								Analytics_1 = "0";
							Иначе
								Analytics_1 = "1";
							КонецЕсли;	
						Иначе 
							Если НЕ РезультатЗапроса.Колонки.Найти("Значение_" + Выборка["Аналитика" + Суффикс + "1"] + "_" + Суффикс) = Неопределено Тогда
								Analytics_1 = Выборка["Значение_" + Выборка["Аналитика" + Суффикс + "1"] + "_" + Суффикс] ;
							КонецЕсли;
						КонецЕсли;
						ОбъектDataTransactionsDay["Analytics_" + Суффикс2 + "1"] = Analytics_1;
					Иначе
						ОбъектDataTransactionsDay["Analytics_" + Суффикс2 + "1"] = "";
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Выборка["Аналитика" + Суффикс + "2"]) Тогда
						Analytics_2 = "";
						Если Выборка["Аналитика" + Суффикс + "2"] = "VID_RASCH_PROCH_KR" Тогда
							Analytics_2 = "2";	
						Иначе
							Если НЕ РезультатЗапроса.Колонки.Найти("Значение_" + Выборка["Аналитика" + Суффикс + "2"] + "_" + Суффикс) = Неопределено Тогда
								Analytics_2 = Выборка["Значение_" + Выборка["Аналитика" + Суффикс + "2"] + "_" + Суффикс]; 
							КонецЕсли;
						КонецЕсли; 
						ОбъектDataTransactionsDay["Analytics_" + Суффикс2 + "2"] = Analytics_2; 
					Иначе
						ОбъектDataTransactionsDay["Analytics_" + Суффикс2 + "2"] = ""; 
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Выборка["Аналитика" + Суффикс + "3"]) Тогда
						Analytics_3 = "";
						Если Выборка["Аналитика" + Суффикс + "3"] = "VID_UCHETA" Тогда
							Если Выборка["СубСчет" + Суффикс] = "07.1" Тогда
								Analytics_3 = "1";
							Иначе
								Analytics_3 = "2";
							КонецЕсли;	
						Иначе
							Если НЕ РезультатЗапроса.Колонки.Найти("Значение_" + Выборка["Аналитика" + Суффикс + "3"] + "_" + Суффикс) = Неопределено Тогда
								Analytics_3 = Выборка["Значение_" + Выборка["Аналитика" + Суффикс + "3"] + "_" + Суффикс];
							КонецЕсли;
						КонецЕсли;
						ОбъектDataTransactionsDay["Analytics_" + Суффикс2 + "3"] = Analytics_3;
					Иначе
						ОбъектDataTransactionsDay["Analytics_" + Суффикс2 + "3"] = "";
					КонецЕсли;
					
					Если НЕ РезультатЗапроса.Колонки.Найти("Значение_" + Выборка["Аналитика" + Суффикс + "4"] + "_" + Суффикс) = Неопределено Тогда
						ОбъектDataTransactionsDay["Analytics_" + Суффикс2 + "4"] = Выборка["Значение_" + Выборка["Аналитика" + Суффикс + "4"] + "_" + Суффикс]; 
					Иначе
						ОбъектDataTransactionsDay["Analytics_" + Суффикс2 + "4"] = "";
					КонецЕсли;
					Если НЕ РезультатЗапроса.Колонки.Найти("Значение_" + Выборка["Аналитика" + Суффикс + "5"] + "_" + Суффикс) = Неопределено Тогда
						ОбъектDataTransactionsDay["Analytics_" + Суффикс2 + "5"] = Выборка["Значение_" + Выборка["Аналитика" + Суффикс + "5"] + "_" + Суффикс];
					Иначе
						ОбъектDataTransactionsDay["Analytics_" + Суффикс2 + "5"] = "";
					КонецЕсли;
					Если НЕ РезультатЗапроса.Колонки.Найти("Значение_" + Выборка["Аналитика" + Суффикс + "6"] + "_" + Суффикс) = Неопределено Тогда
						ОбъектDataTransactionsDay["Analytics_" + Суффикс2 + "6"] = Выборка["Значение_" + Выборка["Аналитика" + Суффикс + "6"] + "_" + Суффикс];
					Иначе
						ОбъектDataTransactionsDay["Analytics_" + Суффикс2 + "6"] = "";
					КонецЕсли;				
				КонецЦикла;
				
				
				Если Выборка.МежотчетныйПериод Тогда 
					Если ПараметрыВыполнения.ИспользоватьСхемуВыгрузки2026 И ВыгружатьМО Тогда
						ОбъектDataTransactionsMO = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "DataTransactionsMO"));
						ИсключаемыеСвойства = ?(ЗначениеЗаполнено(Выборка.TypeKBK_Dt), "", "TypeKBK_Dt,");
						ИсключаемыеСвойства = ИсключаемыеСвойства + ?(ИсключаемыеСвойства = "", "", ",") + ?(ЗначениеЗаполнено(Выборка.TypeKBK_Kt), "", "TypeKBK_Kt");
						
						ЗаполнитьЗначенияСвойств(ОбъектDataTransactionsMO, ОбъектDataTransactionsDay,,ИсключаемыеСвойства);
						ОбъектDataTransactionsMO.DateRegistration = ОбъектDataTransactionsDay.Date;
						ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXMLMO, ОбъектDataTransactionsMO);
					КонецЕсли;
				Иначе
					ОбъектDataTransactionsDay.Проверить();	
					ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектDataTransactionsDay);
				КонецЕсли;
				
			КонецЦикла;  
			
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // Body
		ЗаписьXML.ЗаписатьКонецЭлемента(); // DataTransactions	

		ЗаписьXML.Закрыть();

		ЗаписьСобытияВЖурналРегистрации(СтрШаблон(НСтр("ru = 'Выгрузка оборотов за %1 - окончание'"), Строка(ДеньНачалоПериода)));
		ДеньНачалоПериода = ДеньНачалоПериода + 1;
		
	КонецЦикла; 
	
	Если ПараметрыВыполнения.ИспользоватьСхемуВыгрузки2026 И ВыгружатьМО Тогда
		ЗаписьXMLMO.ЗаписатьКонецЭлемента(); // Body
		ЗаписьXMLMO.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОстатки(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, Перезагружаемые = Ложь)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.ЗаполнитьОстатки(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, Перезагружаемые, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВТ = ?(Перезагружаемые, "ВТОстаткиПерезагружаемые", "ВТОстатки");
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СУММА(1) КАК КоличествоЗаписей
	|ИЗ
	|	" + ИмяВТ + " КАК ВТОстатки");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	КоличествоЗаписей = ?(ЗначениеЗаполнено(Выборка.КоличествоЗаписей), Выборка.КоличествоЗаписей, 0);
	#Область ТекстЗапроса	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ЗначенияАналитикОрганизации.НомерПП, """") КАК ORGANIZATION,
	|	ВТОстатки.ДатаОкончания КАК Date,
	|	ЕСТЬNULL(ВТОстатки.СчетКод, """") КАК Account,
	|	ВТОстатки.Счет КАК Счет,
	|	ЕСТЬNULL(ВТОстатки.КФО, """") КАК KFO,
	|	ЕСТЬNULL(ВТОстатки.КПС, """") КАК KBK,
	|	ЕСТЬNULL(ВТОстатки.КЭК, """") КАК KOSGU,
	|	ВТОстатки.СубСчет КАК СубСчет,
	|	%ПоляЗначенияАналитикВТОстатки_
	|	(ЕСТЬNULL(ВТОстатки.СуммаОстатокДт, 0)) КАК СуммаОстатокДт,
	|	(ЕСТЬNULL(ВТОстатки.СуммаОстатокКт, 0)) КАК СуммаОстатокКт,
	|	(ЕСТЬNULL(ВТОстатки.КоличествоОстатокДт, 0)) КАК КоличествоОстатокДт,
	|	(ЕСТЬNULL(ВТОстатки.КоличествоОстатокКт, 0)) КАК КоличествоОстатокКт,
	|	ЕСТЬNULL(ВТОстатки.Валюта, """") КАК Валюта,
	|	(ЕСТЬNULL(ВТОстатки.ВалютнаяСуммаОстатокДт, 0)) КАК ВалютнаяСуммаОстатокДт,
	|	(ЕСТЬNULL(ВТОстатки.ВалютнаяСуммаОстатокКт, 0)) КАК ВалютнаяСуммаОстатокКт,
	|	ЕСТЬNULL(ВТОстатки.ОбязательноВОстатках1, ЛОЖЬ) КАК ОбязательноВОстатках1,
	|	ЕСТЬNULL(ВТОстатки.ОбязательноВОстатках2, ЛОЖЬ) КАК ОбязательноВОстатках2,
	|	ЕСТЬNULL(ВТОстатки.ОбязательноВОстатках3, ЛОЖЬ) КАК ОбязательноВОстатках3,
	|	ЕСТЬNULL(ВТОстатки.ОбязательноВОстатках4, ЛОЖЬ) КАК ОбязательноВОстатках4,
	|	ЕСТЬNULL(ВТОстатки.ОбязательноВОстатках5, ЛОЖЬ) КАК ОбязательноВОстатках5,
	|	ЕСТЬNULL(ВТОстатки.ОбязательноВОстатках6, ЛОЖЬ) КАК ОбязательноВОстатках6,
	|	ЕСТЬNULL(ВТОстатки.ТипКБК, """") КАК ТипКБК,
	|	ВТОстатки.ВидСчета КАК ВидСчета,
	|	ЕСТЬNULL(ВТОстатки.Аналитика1, """") КАК Аналитика1,
	|	ЕСТЬNULL(ВТОстатки.Аналитика2, """") КАК Аналитика2,
	|	ЕСТЬNULL(ВТОстатки.Аналитика3, """") КАК Аналитика3,
	|	ЕСТЬNULL(ВТОстатки.Аналитика4, """") КАК Аналитика4,
	|	ЕСТЬNULL(ВТОстатки.Аналитика5, """") КАК Аналитика5,
	|	ЕСТЬNULL(ВТОстатки.Аналитика6, """") КАК Аналитика6,
	|	ВТОстатки.Субконто11 КАК Субконто11,
	|	ВТОстатки.Субконто21 КАК Субконто21,
	|	ВТОстатки.Субконто31 КАК Субконто31
	|ПОМЕСТИТЬ ВТОстаткиПередВыгрузкой
	|ИЗ
	|	" + ИмяВТ + " КАК ВТОстатки
	|		%СоединенияЗначенияАналитик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияАналитик КАК ВТ_ЗначенияАналитикОрганизации
	|		ПО (ВТ_ЗначенияАналитикОрганизации.ИмяАналитики = ""ORGANIZATION"")
	|			И ВТОстатки.УИ_Организации = ВТ_ЗначенияАналитикОрганизации.УИ_Субконто 
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаИдентификаторовGRAF_ISP КАК ВТ_ТаблицаИдентификаторовGRAF_ISP
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияАналитик КАК ВТ_ЗначенияАналитик_GRAF_ISP
	|				ПО (ВТ_ЗначенияАналитик_GRAF_ISP.ИмяАналитики = ""GRAF_ISP"")
	|				И ВТ_ЗначенияАналитик_GRAF_ISP.УИ_Субконто_GRAF = ВТ_ТаблицаИдентификаторовGRAF_ISP.УИ_GRAF_ISP
	|		ПО ВТОстатки.ПолучитьGRAF_ISP
	|			И ВТОстатки.Счет = ВТ_ТаблицаИдентификаторовGRAF_ISP.Счет
	|			И ВТОстатки.Договор = ВТ_ТаблицаИдентификаторовGRAF_ISP.Договор
	|			И ВТОстатки.КФОСсылка = ВТ_ТаблицаИдентификаторовGRAF_ISP.КФО
	|ГДЕ %УсловиеБольшихДанных И %Счет_УсловиеБольшихДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстаткиПередВыгрузкой.ORGANIZATION КАК ORGANIZATION,
	|	ВТОстаткиПередВыгрузкой.Date КАК Date,
	|	ВТОстаткиПередВыгрузкой.Account КАК Account,
	|	ВТОстаткиПередВыгрузкой.KFO КАК KFO,
	|	ВТОстаткиПередВыгрузкой.KBK КАК KBK,
	|	ВТОстаткиПередВыгрузкой.KOSGU КАК KOSGU,
	|	ВТОстаткиПередВыгрузкой.СубСчет КАК СубСчет,
	|	ВТОстаткиПередВыгрузкой.Аналитика1 КАК Аналитика1,
	|	ВТОстаткиПередВыгрузкой.Аналитика2 КАК Аналитика2,
	|	ВТОстаткиПередВыгрузкой.Аналитика3 КАК Аналитика3,
	|	ВТОстаткиПередВыгрузкой.Аналитика4 КАК Аналитика4,
	|	ВТОстаткиПередВыгрузкой.Аналитика5 КАК Аналитика5,
	|	ВТОстаткиПередВыгрузкой.Аналитика6 КАК Аналитика6,
	|	%ПоляЗначенияАналитикВТОстаткиПередВыгрузкой_
	|	СУММА(ВТОстаткиПередВыгрузкой.СуммаОстатокДт) КАК Summa_Dt,
	|	СУММА(ВТОстаткиПередВыгрузкой.СуммаОстатокКт) КАК Summa_Kt,
	|	СУММА(ВТОстаткиПередВыгрузкой.КоличествоОстатокДт) КАК Kol_Dt,
	|	СУММА(ВТОстаткиПередВыгрузкой.КоличествоОстатокКт) КАК Kol_Kt,
	|	ВТОстаткиПередВыгрузкой.Валюта КАК Val,
	|	СУММА(ВТОстаткиПередВыгрузкой.ВалютнаяСуммаОстатокДт) КАК ValSumma_Dt,
	|	СУММА(ВТОстаткиПередВыгрузкой.ВалютнаяСуммаОстатокКт) КАК ValSumma_Kt,
	|	ВТОстаткиПередВыгрузкой.ТипКБК КАК TypeKBK,
	|	ВТОстаткиПередВыгрузкой.ВидСчета КАК ВидСчета
	|ИЗ
	|	ВТОстаткиПередВыгрузкой КАК ВТОстаткиПередВыгрузкой
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОстаткиПередВыгрузкой.ORGANIZATION,
	|	ВТОстаткиПередВыгрузкой.Date,
	|	ВТОстаткиПередВыгрузкой.Account,
	|	ВТОстаткиПередВыгрузкой.KFO,
	|	ВТОстаткиПередВыгрузкой.KBK,
	|	ВТОстаткиПередВыгрузкой.KOSGU, 
	|	ВТОстаткиПередВыгрузкой.СубСчет,
	|	ВТОстаткиПередВыгрузкой.Аналитика1,
	|	ВТОстаткиПередВыгрузкой.Аналитика2,
	|	ВТОстаткиПередВыгрузкой.Аналитика3,
	|	ВТОстаткиПередВыгрузкой.Аналитика4,
	|	ВТОстаткиПередВыгрузкой.Аналитика5,
	|	ВТОстаткиПередВыгрузкой.Аналитика6,
	|	%ГруппировкаВТОстаткиПередВыгрузкой
	|	ВТОстаткиПередВыгрузкой.Валюта,
	|	ВТОстаткиПередВыгрузкой.ТипКБК,
	|	ВТОстаткиПередВыгрузкой.ВидСчета
	|	
	|ИМЕЮЩИЕ
	|	(СУММА(ВТОстаткиПередВыгрузкой.СуммаОстатокДт) <> 0
	|		ИЛИ СУММА(ВТОстаткиПередВыгрузкой.СуммаОстатокКт) <> 0
	|		ИЛИ СУММА(ВТОстаткиПередВыгрузкой.КоличествоОстатокДт) <> 0
	|		ИЛИ СУММА(ВТОстаткиПередВыгрузкой.КоличествоОстатокКт) <> 0
	|		ИЛИ СУММА(ВТОстаткиПередВыгрузкой.ВалютнаяСуммаОстатокДт) <> 0
	|		ИЛИ СУММА(ВТОстаткиПередВыгрузкой.ВалютнаяСуммаОстатокКт) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	| УНИЧТОЖИТЬ ВТОстаткиПередВыгрузкой";		
	
	#КонецОбласти		            
		
	МассивАналитик = Новый Массив;
	Если ПараметрыВыполнения.ПакетныйРежимВыгрузки Тогда
						
		ЗапросСчетов = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                            |	НастройкиВыгрузкиАналитикМСД.Счет КАК Счет,
		                            |	ПОДСТРОКА(НастройкиВыгрузкиАналитикМСД.Счет, 1, 3) КАК ГруппаСчетов,
		                            |	НастройкиВыгрузкиАналитикМСД.Аналитика1 КАК Аналитика1,
		                            |	НастройкиВыгрузкиАналитикМСД.Аналитика2 КАК Аналитика2,
		                            |	НастройкиВыгрузкиАналитикМСД.Аналитика3 КАК Аналитика3,
		                            |	НастройкиВыгрузкиАналитикМСД.Аналитика4 КАК Аналитика4,
		                            |	НастройкиВыгрузкиАналитикМСД.Аналитика5 КАК Аналитика5,
		                            |	НастройкиВыгрузкиАналитикМСД.Аналитика6 КАК Аналитика6
		                            |ИЗ
		                            |	РегистрСведений.НастройкиВыгрузкиАналитикМСД КАК НастройкиВыгрузкиАналитикМСД
		                            |ГДЕ
		                            |	НастройкиВыгрузкиАналитикМСД.Версия = &Версия
		                            |	И НастройкиВыгрузкиАналитикМСД.Организация = &Организация
		                            |ИТОГИ ПО
		                            |	ГруппаСчетов");
		ЗапросСчетов.УстановитьПараметр("Версия", ПараметрыВыполнения.ВерсияТаксономии);		
		ЗапросСчетов.УстановитьПараметр("Организация", ПараметрыВыполнения.Организация);	
		ВыборкаСчетов = ЗапросСчетов.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСчетов.Следующий() Цикл
			МассивСчетов = Новый Массив; 
			МассивАналитик = Новый Массив;
			ТекстЗапросаПоШаблону = ТекстЗапроса;
			ВыборкаСчетовДетальные = ВыборкаСчетов.Выбрать();
			Пока ВыборкаСчетовДетальные.Следующий() Цикл
				МассивСчетов.Добавить(ВыборкаСчетовДетальные.Счет); 
				Если ЗначениеЗаполнено(ВыборкаСчетовДетальные.Аналитика1) Тогда
					МассивАналитик.Добавить(ВыборкаСчетовДетальные.Аналитика1);
				КонецЕсли;
				Если ЗначениеЗаполнено(ВыборкаСчетовДетальные.Аналитика2) Тогда
					МассивАналитик.Добавить(ВыборкаСчетовДетальные.Аналитика2);
				КонецЕсли;
				Если ЗначениеЗаполнено(ВыборкаСчетовДетальные.Аналитика3) Тогда
					МассивАналитик.Добавить(ВыборкаСчетовДетальные.Аналитика3);
				КонецЕсли;
				Если ЗначениеЗаполнено(ВыборкаСчетовДетальные.Аналитика4) Тогда
					МассивАналитик.Добавить(ВыборкаСчетовДетальные.Аналитика4);
				КонецЕсли;
				Если ЗначениеЗаполнено(ВыборкаСчетовДетальные.Аналитика5) Тогда
					МассивАналитик.Добавить(ВыборкаСчетовДетальные.Аналитика5);
				КонецЕсли;
				Если ЗначениеЗаполнено(ВыборкаСчетовДетальные.Аналитика6) Тогда
					МассивАналитик.Добавить(ВыборкаСчетовДетальные.Аналитика6);
				КонецЕсли;
			КонецЦикла;
			 					
			ЗаполнитьТекстЗапросаСоединениемСАналитиками(МенеджерВТ, ТекстЗапросаПоШаблону, МассивАналитик);
			
			Запрос = Новый Запрос(СтрЗаменить(ТекстЗапросаПоШаблону, "%УсловиеБольшихДанных", "ВТОстатки.СчетКод В (&Счет)"));
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 
			Запрос.УстановитьПараметр("Счет", МассивСчетов);

			ЗапросКолЗаписей = Новый Запрос("ВЫБРАТЬ
			                                |	СУММА(1) КАК КоличествоЗаписей,
			                                |	МИНИМУМ(ВТОстатки.НомерСтроки) КАК Минимум,
			                                |	МАКСИМУМ(ВТОстатки.НомерСтроки) КАК Максимум
			                                |ИЗ
			                                |	" + ИмяВТ + " КАК ВТОстатки
			                                |ГДЕ
			                                |	ВТОстатки.СчетКод В(&Счет)");
			ЗапросКолЗаписей.УстановитьПараметр("Счет", МассивСчетов);
			ЗапросКолЗаписей.МенеджерВременныхТаблиц = МенеджерВТ;
			Выборка = ЗапросКолЗаписей.Выполнить().Выбрать();
			Выборка.Следующий();
			КоличествоЗаписей = ?(ЗначениеЗаполнено(Выборка.КоличествоЗаписей), Выборка.КоличествоЗаписей, 0);
			Если КоличествоЗаписей = 0 Тогда
				Продолжить;
			КонецЕсли;	
			НомерСтрокиТекущий = Выборка.Минимум - 1;
			НомерСтрокиТекущий = 0;
			ДиапазонПакет = 200000;
			НомерСтрокиПакет = ДиапазонПакет;
			Итерация = 1;
			Если КоличествоЗаписей > НомерСтрокиПакет Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Счет_УсловиеБольшихДанных", "ВТОстатки.НомерСтроки > &НомерСтрокиТекущий И ВТОстатки.НомерСтроки <= &НомерСтрокиПакет");
				ПотребуетсяИтераций = (Выборка.Максимум - Выборка.Минимум) / НомерСтрокиПакет + 1;
				Пока Итерация < ПотребуетсяИтераций Цикл
					Запрос.УстановитьПараметр("НомерСтрокиТекущий", НомерСтрокиТекущий);
					Запрос.УстановитьПараметр("НомерСтрокиПакет", НомерСтрокиПакет);
	                ЗаписьСобытияВЖурналРегистрации(НСтр(СтрШаблон("ru = 'Запрос остатков - выполнение запроса по счету %1 - диапазон записей: %2 - %3'", ВыборкаСчетов.ГруппаСчетов, НомерСтрокиТекущий, НомерСтрокиПакет)));
				    ТаблицаДанных = Запрос.Выполнить().Выгрузить(); 
					ЗаполнитьXDTOПоТаблице_Остатки(ТаблицаДанных, ЗаписьXML, ПараметрыВыполнения);
					НомерСтрокиТекущий = НомерСтрокиТекущий + ДиапазонПакет; 
					НомерСтрокиПакет = НомерСтрокиПакет + ДиапазонПакет;
                    Итерация = Итерация + 1;
				КонецЦикла;	
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Счет_УсловиеБольшихДанных", "ИСТИНА"); 
				ЗаписьСобытияВЖурналРегистрации(НСтр(СтрШаблон("ru = 'Запрос остатков - выполнение запроса по счету %1 - количество записей: %2'", ВыборкаСчетов.ГруппаСчетов, КоличествоЗаписей)));
				ТаблицаДанных = Запрос.Выполнить().Выгрузить(); 
				ЗаполнитьXDTOПоТаблице_Остатки(ТаблицаДанных, ЗаписьXML, ПараметрыВыполнения);
			КонецЕсли;	
				
		КонецЦикла; 		
	Иначе
		
		ЗаполнитьТекстЗапросаСоединениемСАналитиками(МенеджерВТ, ТекстЗапроса, МассивАналитик);
	
		Запрос = Новый Запрос(СтрЗаменить(ТекстЗапроса, "%УсловиеБольшихДанных", "ИСТИНА"));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Счет_УсловиеБольшихДанных", "ИСТИНА"); 
		ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Запрос остатков - выполнение запроса'"));
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 			
		ТаблицаДанных = Запрос.Выполнить().Выгрузить(); 
		ЗаполнитьXDTOПоТаблице_Остатки(ТаблицаДанных, ЗаписьXML, ПараметрыВыполнения);
	КонецЕсли;	
	
	Запрос = Новый Запрос("
	|////////////////////////////////////////////////////////////////////////////////
	| УНИЧТОЖИТЬ " + ИмяВТ);
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

#Область ЗаполнениеАналитик

Процедура ORGANIZATION(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;

	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.ORGANIZATION(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(?(ПараметрыВыполнения.ПакетныйРежимВыгрузки, 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОстатки.Организация КАК Аналитика
	|ПОМЕСТИТЬ ВТАналитики 
	|ИЗ
	|	ВТОстаткиБезСубконто4 КАК ВТОстатки
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОбороты.Организация
	|ИЗ
	|	ВТОборотыБезСубконто4 КАК ВТОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////", 
	"") + "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Организации.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Организации.Ссылка) КАК GUID,
	|	ВЫБОР
	|		КОГДА ОрганизацииКодСВР.КодПоРПБС = """"
	|			ТОГДА ""        ""
	|		ИНАЧЕ ВЫРАЗИТЬ(ОрганизацииКодСВР.КодПоРПБС КАК СТРОКА(8))
	|	КОНЕЦ КАК KOD_SVR,
	|	ВЫРАЗИТЬ(Бюджеты.Код КАК СТРОКА(8)) КАК OKTMO_BUDJ,
	|	ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(300)) КАК NAME,
	|	Организации.ИНН КАК INN,
	|	Организации.КПП КАК KPP,
	|	ВЫБОР
	|		КОГДА Организации.УчетПереданныхПолномочий
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК PER_POLN,
	|	ЕСТЬNULL(Организации.КодПоППП.Код, """") КАК GLAVA,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетнаяПолитикаОрганизацийСрезПоследних.ПолномочияГРБС, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК GRBS,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетнаяПолитикаОрганизацийСрезПоследних.ПолномочияРБС, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК RBS,
	|	ВЫБОР
	|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ""0""
	|		ИНАЧЕ ""1""
	|	КОНЕЦ КАК FILIAL,
	|	ВЫБОР
	|		КОГДА СтруктурыРПС.ТипПланаСчетов = ЗНАЧЕНИЕ(Перечисление.ТипыПлановСчетов.ДляАвтономных)
	|			ТОГДА ""3""
	|		КОГДА СтруктурыРПС.ТипПланаСчетов = ЗНАЧЕНИЕ(Перечисление.ТипыПлановСчетов.ДляБюджетных)
	|			ТОГДА ""2""
	|		КОГДА СтруктурыРПС.ТипПланаСчетов = ЗНАЧЕНИЕ(Перечисление.ТипыПлановСчетов.ДляКазенных)
	|			ТОГДА ""1""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК VID_PLAN_SCHET
	|ИЗ
	|	ВТАналитики КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурыРПС КАК СтруктурыРПС
	|				ПО УчетнаяПолитикаОрганизацийСрезПоследних.СтруктураРПС = СтруктурыРПС.Ссылка
	|			ПО Организации.Ссылка = УчетнаяПолитикаОрганизацийСрезПоследних.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Бюджеты КАК Бюджеты
	|			ПО Организации.Бюджет = Бюджеты.Ссылка
	|		ПО ВТАналитики.Аналитика = Организации.Ссылка,
	|	Справочник.Организации КАК ОрганизацииКодСВР
	|ГДЕ
	|	ОрганизацииКодСВР.Ссылка = &Организация" + 
	?(ПараметрыВыполнения.ПакетныйРежимВыгрузки, "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОстаткиБезСубконто4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОборотыБезСубконто4", "")); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Организация", ПараметрыВыполнения.Организация);
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("ORGANIZATION", ПараметрыВыполнения);
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("ORGANIZATION", ПараметрыВыполнения);		
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		ОбъектORGANIZATION = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "ORGANIZATION")); 
		
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
		Если СтруктураРеквизитов.Свойство("GUID") Тогда
			СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID); 
		КонецЕсли;     
		
		пЗаполнитьЗначенияСвойств(ОбъектORGANIZATION, СтруктураРеквизитов); 
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда 
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "ORGANIZATION", Выборка.Name, НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		ОбъектORGANIZATION.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ = 0");
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("ORGANIZATION_" + ОбъектORGANIZATION.GUID, ОбъектORGANIZATION.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектORGANIZATION);
	КонецЦикла;
	
КонецПроцедуры     

Процедура ADRES(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.ADRES(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаАдресов = НоваяТаблицаАдресов();
	СтрокаКолонок = "";
	ЭтоПервый = Истина;
	Для Каждого тКолонка Из ТаблицаАдресов.Колонки Цикл
		Если ЭтоПервый Тогда
			ЭтоПервый = Ложь;
		Иначе
			СтрокаКолонок = СтрокаКолонок + ",";
		КонецЕсли;
		СтрокаКолонок = СтрокаКолонок + тКолонка.Имя;
	КонецЦикла;  
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦМО);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	
	МассивАналитик = СтрРазделить("MESTO_ADDR_NFA,MOL_SOTRUDNIK,KONTRAGENT", ",", Ложь);
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МассивСубконто, "ADRES", МассивАналитик, ПараметрыВыполнения);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(МестаХраненияКонтактнаяИнформация.Представление КАК СТРОКА(500)) КАК Представление,
	|	ВЫРАЗИТЬ(МестаХраненияКонтактнаяИнформация.ЗначенияПолей КАК СТРОКА(1024)) КАК ЗначенияПолей,
	|	МестаХраненияКонтактнаяИнформация.Страна КАК Страна 
	|ПОМЕСТИТЬ ВТАдресы						  
	|ИЗ
	|	ВТАналитики_ADRES КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦМО КАК ЦМО
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МестаХранения.КонтактнаяИнформация КАК МестаХраненияКонтактнаяИнформация
	|			ПО ЦМО.МестоХранения = МестаХраненияКонтактнаяИнформация.Ссылка
	|		ПО ВТАналитики.Аналитика = ЦМО.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ФизическиеЛицаКонтактнаяИнформация.Представление КАК СТРОКА(500)),
	|	ВЫРАЗИТЬ(ФизическиеЛицаКонтактнаяИнформация.ЗначенияПолей КАК СТРОКА(1024)),
	|	ФизическиеЛицаКонтактнаяИнформация.Страна
	|ИЗ
	|	ВТАналитики_ADRES КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦМО КАК ЦМО
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|					ПО Контрагенты.ЮридическоеФизическоеЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|						И (ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица))
	|				ПО Сотрудники.Контрагент = Контрагенты.Ссылка
	|			ПО ЦМО.Сотрудник = Сотрудники.Ссылка
	|		ПО ВТАналитики.Аналитика = ЦМО.Ссылка
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ФизическиеЛицаКонтактнаяИнформация.Представление КАК СТРОКА(500)),
	|	ВЫРАЗИТЬ(ФизическиеЛицаКонтактнаяИнформация.ЗначенияПолей КАК СТРОКА(1024)),
	|	ФизическиеЛицаКонтактнаяИнформация.Страна
	|ИЗ
	|	ВТАналитики_ADRES КАК ВТАналитики
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|		ПО Контрагенты.ЮридическоеФизическоеЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|			И (ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица))  
	|	ПО ВТАналитики.Аналитика = Контрагенты.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ЮридическиеЛицаКонтактнаяИнформация.Представление КАК СТРОКА(500)),
	|	ВЫРАЗИТЬ(ЮридическиеЛицаКонтактнаяИнформация.ЗначенияПолей КАК СТРОКА(1024)),
	|	ЮридическиеЛицаКонтактнаяИнформация.Страна
	|ИЗ
	|	ВТАналитики_ADRES КАК ВТАналитики,
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица.КонтактнаяИнформация КАК ЮридическиеЛицаКонтактнаяИнформация
	|		ПО Контрагенты.ЮридическоеФизическоеЛицо = ЮридическиеЛицаКонтактнаяИнформация.Ссылка
	|			И (ЮридическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты))
	|	ПО ВТАналитики.Аналитика = Контрагенты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТАдресы.Представление КАК Представление,
	|	ВТАдресы.ЗначенияПолей КАК ЗначенияПолей,
	|	ВТАдресы.Страна КАК Страна
	|ИЗ
	|	ВТАдресы КАК ВТАдресы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТАдресы.Представление,
	|	ВТАдресы.Страна,
	|	ВТАдресы.ЗначенияПолей");
	
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	ЗаполнитьСтрокиАдреса(ТаблицаАдресов, Выгрузка, СтрокаКолонок);
	
	
	КолонкиМуниципал = "NAS_PUNKT_MUN, REGION, RAION, MUN_RAION_OKRUG, POSELENIE, GOROD, NAS_PUNKT, TERRITORIYA, ХЭШ_NAS_PUNKT_MUN";
	КолонкиАдм		 = "NAS_PUNKT_ADM, REGION, RAION, GOROD, NAS_PUNKT, TERRITORIYA, ХЭШ_NAS_PUNKT_ADM";
	
	ТаблицаАдресов.Свернуть(СтрокаКолонок);
	СтрокиКУдалению = ТаблицаАдресов.НайтиСтроки(Новый Структура("REGION", ""));
	удКоличество = СтрокиКУдалению.Количество();
	Для НН = 1 По удКоличество Цикл
		удСтрока = СтрокиКУдалению[удКоличество - НН];
		ТаблицаАдресов.Удалить(удСтрока);
	КонецЦикла;
	
	ТаблицаМуниципал = ТаблицаАдресов.Скопировать(Новый Структура("ADM_MUN_DELENIE", "1"), КолонкиМуниципал);
	ТаблицаМуниципал.Свернуть(КолонкиМуниципал);
	ТаблицаМуниципал.Индексы.Добавить("ХЭШ_NAS_PUNKT_MUN");
	ТаблицаМуниципалХеш = ТаблицаМуниципал.Скопировать(,"ХЭШ_NAS_PUNKT_MUN");
	ТаблицаМуниципалХеш.Свернуть("ХЭШ_NAS_PUNKT_MUN");
	новТаблицаМуниципал = ТаблицаМуниципал.СкопироватьКолонки();
	Для Каждого текХеш Из ТаблицаМуниципалХеш Цикл
		Строка = ТаблицаМуниципал.Найти(текХеш.ХЭШ_NAS_PUNKT_MUN, "ХЭШ_NAS_PUNKT_MUN");
		ЗаполнитьЗначенияСвойств(новТаблицаМуниципал.Добавить(), Строка);
	КонецЦикла;
	
	ТаблицаАдм = ТаблицаАдресов.Скопировать(Новый Структура("ADM_MUN_DELENIE", "2"), КолонкиАдм); 
	ТаблицаАдм.Свернуть(КолонкиАдм);
	ТаблицаАдм.Индексы.Добавить("ХЭШ_NAS_PUNKT_ADM");
	ТаблицаАдмХеш = ТаблицаАдм.Скопировать(,"ХЭШ_NAS_PUNKT_ADM");
	ТаблицаАдмХеш.Свернуть("ХЭШ_NAS_PUNKT_ADM");
	новТаблицаАдм = ТаблицаАдм.СкопироватьКолонки();
	Для Каждого текХеш Из ТаблицаАдмХеш Цикл
		Строка = ТаблицаАдм.Найти(текХеш.ХЭШ_NAS_PUNKT_ADM, "ХЭШ_NAS_PUNKT_ADM");
		ЗаполнитьЗначенияСвойств(новТаблицаАдм.Добавить(), Строка);
	КонецЦикла;
	
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("NAS_PUNKT_MUN", ПараметрыВыполнения);
	
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("NAS_PUNKT_MUN", ПараметрыВыполнения);
	Для Каждого текМуниципал Из ТаблицаМуниципал Цикл                   
		
		ОбъектNAS_PUNKT_MUN = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "NAS_PUNKT_MUN"));  
		
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, текМуниципал);
		пЗаполнитьЗначенияСвойств(ОбъектNAS_PUNKT_MUN, СтруктураРеквизитов);
		п_Представление = "";
		ЗаполнитьСтрокуИзСтруктуры(п_Представление, СтруктураРеквизитов, ", ");
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "NAS_PUNKT_MUN", п_Представление, НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		ОбъектNAS_PUNKT_MUN.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");
		СтрокиАдреса = ТаблицаАдресов.НайтиСтроки(Новый Структура("ADM_MUN_DELENIE, ХЭШ_NAS_PUNKT_MUN", "1", текМуниципал.ХЭШ_NAS_PUNKT_MUN));
		Для Каждого текСтрокаАдреса Из СтрокиАдреса Цикл
			текСтрокаАдреса.NAS_PUNKT_MUN = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0")
		КонецЦикла;
		
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1; 
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектNAS_PUNKT_MUN);
	КонецЦикла;
	
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("NAS_PUNKT_ADM", ПараметрыВыполнения);
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("NAS_PUNKT_ADM", ПараметрыВыполнения);
	Для Каждого текАдм Из ТаблицаАдм Цикл
		ОбъектNAS_PUNKT_ADM = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "NAS_PUNKT_ADM"));
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, текАдм);
		пЗаполнитьЗначенияСвойств(ОбъектNAS_PUNKT_ADM, СтруктураРеквизитов);
		п_Представление = "";
		ЗаполнитьСтрокуИзСтруктуры(п_Представление, СтруктураРеквизитов, ", ");
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "NAS_PUNKT_ADM", п_Представление, НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		ОбъектNAS_PUNKT_ADM.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");
		СтрокиАдреса = ТаблицаАдресов.НайтиСтроки(Новый Структура("ADM_MUN_DELENIE, ХЭШ_NAS_PUNKT_ADM", "2", текАдм.ХЭШ_NAS_PUNKT_ADM));
		Для Каждого текСтрокаАдреса Из СтрокиАдреса Цикл
			текСтрокаАдреса.NAS_PUNKT_ADM = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0")
		КонецЦикла;
		
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;   
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектNAS_PUNKT_ADM);
	КонецЦикла;
	
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("ADRES", ПараметрыВыполнения);
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("ADRES", ПараметрыВыполнения);		
	Для Каждого текАдрес Из ТаблицаАдресов Цикл
		ОбъектADRES = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "ADRES")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, текАдрес);         
		пЗаполнитьЗначенияСвойств(ОбъектADRES, СтруктураРеквизитов);           
		
		п_Представление = "";
		ЗаполнитьСтрокуИзСтруктуры(п_Представление, СтруктураРеквизитов, ", ");		
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "ADRES", п_Представление, НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		ОбъектADRES.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("ADRES_" + текАдрес.ХЭШ, ОбъектADRES.ID);
		
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектADRES); 
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАдресы; УНИЧТОЖИТЬ ВТАналитики_ADRES"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура OS(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.OS(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства), "OS",, ПараметрыВыполнения);      
	
	#Область ТекстЗапроса
	
	Запрос = Новый Запрос(		
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ИнвентарныеНомераОС.ОС, ВТАналитики_OS.Аналитика) КАК Аналитика,
	|	ВТАналитики_OS.Аналитика КАК GUID
	|ПОМЕСТИТЬ ВТАналитикиOS_
	|ИЗ
	|	ВТАналитики_OS КАК ВТАналитики_OS
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ПО ВТАналитики_OS.Аналитика = ИнвентарныеНомераОС.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Аналитика,
	|	GUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиOS_ КАК Т)) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ ВТРасчетАмортизацииОС
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиOS_ КАК Т)) КАК РасчетАмортизацииОССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь
	|ПОМЕСТИТЬ ВТСведенияКадастровогоУчета
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					Т.Аналитика
	|				ИЗ
	|					ВТАналитикиOS_ КАК Т)) КАК СведенияКадастровогоУчетаСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОС.Событие КАК Событие,
	|	МАКСИМУМ(СобытияОС.Период) КАК Период,
	|	СобытияОС.Активность КАК Активность
	|ПОМЕСТИТЬ ВТ_СобытияОССрез
	|ИЗ
	|	РегистрСведений.СобытияОС КАК СобытияОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.Событие,
	|	СобытияОС.ОсновноеСредство,
	|	СобытияОС.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ДатаСобытия КАК ДатаСобытия,
	|	СобытияОС.ИнвНомер КАК ИнвНомер
	|ПОМЕСТИТЬ ВТ_СобытияОС
	|ИЗ
	|	ВТ_СобытияОССрез КАК ВТ_СобытияОССрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК СобытияОС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиOS_ КАК ВТАналитикиOS_
	|			ПО СобытияОС.ОсновноеСредство = ВТАналитикиOS_.Аналитика
	|				И (СобытияОС.Активность)
	|		ПО ВТ_СобытияОССрез.ОсновноеСредство = СобытияОС.ОсновноеСредство
	|			И ВТ_СобытияОССрез.Событие = СобытияОС.Событие
	|			И ВТ_СобытияОССрез.Период = СобытияОС.Период
	|			И ВТ_СобытияОССрез.Активность = СобытияОС.Активность
	|ГДЕ
	|	СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|	И СобытияОС.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИнвНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТАналитикиOS_.GUID КАК GUID,
	|	ИнвентарныеНомераОС.Ссылка КАК Ссылка,
	|	ИнвентарныеНомераОС.Код КАК INV_NOMER,
	|	ИнвентарныеНомераОС.ОС КАК ОС,
	|	ВЫРАЗИТЬ(ИнвентарныеНомераОС.ЗаводскойНомер КАК СТРОКА(40)) КАК NUM_ZAVOD,
	|	ИнвентарныеНомераОС.РеестровыйНомер КАК NUM_REESTR,
	|	ИнвентарныеНомераОС.ИнойНомер КАК NUM_INOY,
	|	ИнвентарныеНомераОС.ДатаВыпуска КАК DATA_VYP,
	|	ЕСТЬNULL(ВТ_СобытияОС.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_EKSP
	|ПОМЕСТИТЬ ВТ_ИнвНомера
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиOS_ КАК ВТАналитикиOS_
	|		ПО ИнвентарныеНомераОС.Ссылка = ВТАналитикиOS_.GUID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СобытияОС КАК ВТ_СобытияОС
	|		ПО ИнвентарныеНомераОС.Ссылка = ВТ_СобытияОС.ИнвНомер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОС,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТАналитикиOS_.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитикиOS_.GUID) КАК GUID,
	|	ОсновныеСредстваПравообладания.ВидПрава КАК VID_PRAVA,
	|	ОсновныеСредстваПравообладания.ДатаДокумента КАК DATE,
	|	ОсновныеСредстваПравообладания.НомерДокумента КАК NOMER
	|ИЗ
	|	ВТАналитикиOS_ КАК ВТАналитикиOS_
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.Правообладания КАК ОсновныеСредстваПравообладания
	|		ПО ВТАналитикиOS_.Аналитика = ОсновныеСредстваПравообладания.Ссылка
	|ИТОГИ ПО
	|	GUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ИнвНомера.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТ_ИнвНомера.GUID) КАК GUID,
	|	ВТ_ИнвНомера.INV_NOMER КАК Наименование,
	|	ИнвентарныеНомераОСОбременения.НаименованиеЧасти КАК NAME_IT,
	|	ИнвентарныеНомераОСОбременения.РазмерЧасти КАК RAZMER_IT,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, ""000"") КАК ED_IZM,
	|	ИнвентарныеНомераОСОбременения.ВидОбременения КАК VID_OBREM,
	|	ИнвентарныеНомераОСОбременения.ДатаНачала КАК DATE_NACH,
	|	ИнвентарныеНомераОСОбременения.ДатаОкончания КАК DATE_OKONCH,
	|	ИнвентарныеНомераОСОбременения.ДокументРегистрацииДата КАК DOC_REG_DATE,
	|	ИнвентарныеНомераОСОбременения.ДокументРегистрацииНомер КАК DOC_REG_NUM,
	|	ИнвентарныеНомераОСОбременения.ДокументОбремененияВид КАК DOC_OBR_VID,
	|	ИнвентарныеНомераОСОбременения.ДокументОбремененияДата КАК DOC_OBR_DATE,
	|	ИнвентарныеНомераОСОбременения.ДокументОбремененияНомер КАК DOC_OBR_NUM,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ИнвентарныеНомераОСОбременения.Контрагент) КАК GUIDКонтрагент,
	|	ИнвентарныеНомераОСОбременения.Контрагент КАК Контрагент
	|ИЗ
	|	ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС.Обременения КАК ИнвентарныеНомераОСОбременения
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|			ПО ИнвентарныеНомераОСОбременения.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ПО ВТ_ИнвНомера.Ссылка = ИнвентарныеНомераОСОбременения.Ссылка
	|ИТОГИ ПО
	|	GUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАналитикиOS_.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитикиOS_.GUID) КАК GUID,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ОсновныеСредства.НаименованиеПолное = """"
	|				ТОГДА ОсновныеСредства.Наименование
	|			ИНАЧЕ ОсновныеСредства.НаименованиеПолное
	|		КОНЕЦ КАК СТРОКА(300)) КАК NAME,
	|	ЕСТЬNULL(ВТРасчетАмортизацииОС.СрокПолезногоИспользования, 0) КАК SROK,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПерваяГруппа)
	|			ТОГДА ""01""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВтораяГруппа)
	|			ТОГДА ""02""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ТретьяГруппа)
	|			ТОГДА ""03""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ЧетвертаяГруппа)
	|			ТОГДА ""04""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПятаяГруппа)
	|			ТОГДА ""05""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ШестаяГруппа)
	|			ТОГДА ""06""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.СедьмаяГруппа)
	|			ТОГДА ""07""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа)
	|			ТОГДА ""08""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа)
	|			ТОГДА ""09""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа)
	|			ТОГДА ""10""
	|		ИНАЧЕ ""00""
	|	КОНЕЦ КАК AMORT_GR,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОсновныеСредства.КодОКОФ) КАК OKOF,
	|	ВЫБОР
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|			ТОГДА ""01""
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|			ТОГДА ""02""
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|			ТОГДА ""03""
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции)
	|			ТОГДА ""04""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК SPOSOB_AMORT,
	|	ЕСТЬNULL(ВТСведенияКадастровогоУчета.КадастровыйНомер, """") КАК NUM_KADASTR,
	|	ЕСТЬNULL(ВТСведенияКадастровогоУчета.ОбщаяПлощадь, 0) КАК SQUARE,
	|	ЕСТЬNULL(ВТ_ИнвНомера.INV_NOMER, """") КАК INV_NOMER,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_ZAVOD, """") КАК NUM_ZAVOD,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_REESTR, """") КАК NUM_REESTR,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_INOY, """") КАК NUM_INOY,
	|	ЕСТЬNULL(ВТ_ИнвНомера.DATA_VYP, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_VYP,
	|	ЕСТЬNULL(ВТ_ИнвНомера.DATA_EKSP, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_EKSP
	|ИЗ
	|	ВТАналитикиOS_ КАК ВТАналитикиOS_
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетАмортизацииОС КАК ВТРасчетАмортизацииОС
	|			ПО ОсновныеСредства.Ссылка = ВТРасчетАмортизацииОС.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет КАК ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|			ПО ОсновныеСредства.Ссылка = ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияКадастровогоУчета КАК ВТСведенияКадастровогоУчета
	|			ПО ОсновныеСредства.Ссылка = ВТСведенияКадастровогоУчета.ОсновноеСредство
	|		ПО ВТАналитикиOS_.Аналитика = ОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|		ПО ВТАналитикиOS_.GUID = ВТ_ИнвНомера.Ссылка
	|");
	
	#КонецОбласти	
	
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка 				= Пакет[Пакет.Количество() - 1].Выбрать();
	ВыборкаПравообладателей = Пакет[Пакет.Количество() - 3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбременений 		= Пакет[Пакет.Количество() - 2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураРеквизитовОС = СтруктураРеквизитовАналитики("OS", ПараметрыВыполнения);
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество(); 
	
	Если СтруктураРеквизитовОС.Свойство("OS_PRAVOOBLADANIE") Тогда
		
		СтруктураРеквизитов = СтруктураРеквизитовАналитики("OS_PRAVOOBLADANIE", ПараметрыВыполнения);
		МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("OS_PRAVOOBLADANIE", ПараметрыВыполнения);		
		
		Пока ВыборкаПравообладателей.Следующий() Цикл     
			ОбъектPRAVOOBLADANIE = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "OS_PRAVOOBLADANIE"));       
			ОбъектPRAVOOBLADANIE.ID =  Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");     
			ОбъектPRAVOOBLADANIE.OWNER =  XMLСтрока(ВыборкаПравообладателей.GUID);     
			ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("OS_PRAVOOBLADANIE_" + ОбъектPRAVOOBLADANIE.OWNER, ОбъектPRAVOOBLADANIE.ID); 
			ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
			
			ВыборкаПравообладателейВыборка = ВыборкаПравообладателей.Выбрать();
			п_НН = 1;
			Пока ВыборкаПравообладателейВыборка.Следующий() Цикл 
				новСтрока =  ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "PRAVOOBLADANIE").Свойства.Получить("ROW").Тип);
				ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ВыборкаПравообладателейВыборка);
				пЗаполнитьЗначенияСвойств(новСтрока, СтруктураРеквизитов);
				Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
					ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "OS_PRAVOOBLADANIE", Строка(ВыборкаПравообладателейВыборка.Ссылка), НН, МассивОбязательныхРеквизитов);
				КонецЕсли;
				
				новСтрока.ROWNUM = п_НН;
				п_НН = п_НН + 1;
				
				ОбъектPRAVOOBLADANIE.ROW.Добавить(новСтрока);
			КонецЦикла;
			               
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектPRAVOOBLADANIE);	
		КонецЦикла;
		
	КонецЕсли;
	
	Если СтруктураРеквизитовОС.Свойство("OS_OBREMENENIE") Тогда
		МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("OS_OBREMENENIE", ПараметрыВыполнения);		
		СтруктураРеквизитов = СтруктураРеквизитовАналитики("OS_OBREMENENIE", ПараметрыВыполнения);
		Пока ВыборкаОбременений.Следующий() Цикл
			
			ОбъектOBREMENENIE = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "OS_OBREMENENIE"));       
			ОбъектOBREMENENIE.ID =  Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");     
			ОбъектOBREMENENIE.OWNER =  XMLСтрока(ВыборкаОбременений.GUID);     
			ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("OS_OBREMENENIE_" + ОбъектOBREMENENIE.OWNER, ОбъектOBREMENENIE.ID); 
			ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
			
			ВыборкаОбремененийВыборка = ВыборкаОбременений.Выбрать();  
			п_НН = 1;			
			Пока ВыборкаОбремененийВыборка.Следующий() Цикл
				новСтрока = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "OBREMENENIE").Свойства.Получить("ROW").Тип);
				ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ВыборкаОбремененийВыборка);  
				
				Если СтруктураРеквизитов.Свойство("KONTRAGENT") Тогда
					ИД_Контрагента = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("KONTRAGENT_" + XMLСтрока(ВыборкаОбремененийВыборка.GUIDКонтрагент));
					СтруктураРеквизитов.KONTRAGENT = ?(ЗначениеЗаполнено(ИД_Контрагента), ИД_Контрагента, "");
				КонецЕсли;
				
				пЗаполнитьЗначенияСвойств(новСтрока, СтруктураРеквизитов); 
				Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
					ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "OS_OBREMENENIE", Строка(ВыборкаОбремененийВыборка.Наименование), НН, МассивОбязательныхРеквизитов);
				КонецЕсли;
				новСтрока.ROWNUM = п_НН;
				п_НН = п_НН + 1;       
				ОбъектOBREMENENIE.ROW.Добавить(новСтрока);
			КонецЦикла;
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектOBREMENENIE);
		КонецЦикла;
		
	КонецЕсли;
	
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("OS", ПараметрыВыполнения);	
	
	Пока Выборка.Следующий() Цикл  
		ОбъектOS = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "OS")); 
		
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитовОС, Выборка);	
		СтруктураРеквизитовОС.GUID = XMLСтрока(Выборка.GUID);
		пЗаполнитьЗначенияСвойств(ОбъектOS, СтруктураРеквизитовОС);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитовОС, "OS", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		ОбъектOS.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("OS_" + ОбъектOS.GUID, ОбъектOS.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		
		Если СтруктураРеквизитовОС.Свойство("OS_PRAVOOBLADANIE") Тогда
			ИД_Правообладания = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("OS_PRAVOOBLADANIE_" + ОбъектOS.GUID);		
			ОбъектOS.OS_PRAVOOBLADANIE = ?(ЗначениеЗаполнено(ИД_Правообладания), ИД_Правообладания, "");
		КонецЕсли;		
		Если СтруктураРеквизитовОС.Свойство("OS_OBREMENENIE") Тогда
			ИД_Обременений = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("OS_OBREMENENIE_" + ОбъектOS.GUID);	
			ОбъектOS.OS_OBREMENENIE = ?(ЗначениеЗаполнено(ИД_Обременений), ИД_Обременений, "");
		КонецЕсли;		
		             
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектOS);
	КонецЦикла;
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_OS; УНИЧТОЖИТЬ ВТАналитикиOS_; УНИЧТОЖИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет; УНИЧТОЖИТЬ ВТРасчетАмортизацииОС; 
	|УНИЧТОЖИТЬ ВТСведенияКадастровогоУчета; УНИЧТОЖИТЬ ВТ_СобытияОССрез; УНИЧТОЖИТЬ ВТ_СобытияОС; УНИЧТОЖИТЬ ВТ_ИнвНомера"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры      

Процедура KONTRAGENT(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.KONTRAGENT(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.НалогиИПлатежиОрганизации);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений);  
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.КорреспондентыПоВнутреннимРасчетам);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦМО);
	
	МассивАналитик = СтрРазделить("KONTRAGENT,ADM_BUDJ,OSN_RASCH,MOL_SOTRUDNIK,NMA,NPA,OS,OBJ_FIN_VL", ",");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МассивСубконто, "Контрагента", МассивАналитик, ПараметрыВыполнения);
	
	#Область ТекстЗапроса
	
	Запрос = Новый Запрос(	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.Код КАК ID_KONTRAGENTA,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ КАК VID_KONTRAGENTA,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	Контрагенты.ТипКонтрагента КАК ТипКонтрагента
	|ПОМЕСТИТЬ ВТКонтрагентыПредварительно
	|ИЗ
	|	ВТАналитики_Контрагента КАК ВТАналитики_Контрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВТАналитики_Контрагента.Аналитика = Контрагенты.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка,
	|	Контрагенты.Наименование,
	|	Контрагенты.Код,
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.ТипКонтрагента
	|ИЗ
	|	ВТАналитики_Контрагента КАК ВТАналитики_Контрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НалогиИПлатежиОрганизации КАК НалогиИПлатежиОрганизации
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ПО НалогиИПлатежиОрганизации.Контрагент = Контрагенты.Ссылка
	|		ПО ВТАналитики_Контрагента.Аналитика = НалогиИПлатежиОрганизации.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыСправочник.Ссылка,
	|	КонтрагентыСправочник.Наименование,
	|	КонтрагентыСправочник.Код,
	|	ВЫБОР
	|		КОГДА КонтрагентыСправочник.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ,
	|	КонтрагентыСправочник.ЮридическоеФизическоеЛицо,
	|	КонтрагентыСправочник.ТипКонтрагента
	|ИЗ
	|	ВТАналитики_Контрагента КАК ВТАналитики_Контрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыСправочник
	|			ПО Договоры.Контрагент = КонтрагентыСправочник.Ссылка
	|		ПО ВТАналитики_Контрагента.Аналитика = Договоры.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыСправочник.Ссылка,
	|	КонтрагентыСправочник.Наименование,
	|	КонтрагентыСправочник.Код,
	|	ВЫБОР
	|		КОГДА КонтрагентыСправочник.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ,
	|	КонтрагентыСправочник.ЮридическоеФизическоеЛицо,
	|	КонтрагентыСправочник.ТипКонтрагента
	|ИЗ
	|	ВТАналитики_Контрагента КАК ВТАналитики_Контрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры.Контрагенты КАК ДоговорыКонтрагенты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыСправочник
	|			ПО ДоговорыКонтрагенты.Контрагент = КонтрагентыСправочник.Ссылка
	|		ПО ВТАналитики_Контрагента.Аналитика = ДоговорыКонтрагенты.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыСправочник.Ссылка,
	|	КонтрагентыСправочник.Наименование,
	|	КонтрагентыСправочник.Код,
	|	ВЫБОР
	|		КОГДА КонтрагентыСправочник.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ,
	|	КонтрагентыСправочник.ЮридическоеФизическоеЛицо,
	|	КонтрагентыСправочник.ТипКонтрагента
	|ИЗ
	|	ВТАналитики_Контрагента КАК ВТАналитики_Контрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦМО КАК ЦМО
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыСправочник
	|			ПО ЦМО.Сотрудник.Контрагент = КонтрагентыСправочник.Ссылка
	|		ПО ВТАналитики_Контрагента.Аналитика = ЦМО.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыСправочник.Ссылка,
	|	КонтрагентыСправочник.Наименование,
	|	КонтрагентыСправочник.Код,
	|	ВЫБОР
	|		КОГДА КонтрагентыСправочник.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ,
	|	КонтрагентыСправочник.ЮридическоеФизическоеЛицо,
	|	КонтрагентыСправочник.ТипКонтрагента
	|ИЗ
	|	ВТАналитики_Контрагента КАК ВТАналитики_Контрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС.Обременения КАК ОбремененияТЧ
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыСправочник
	|				ПО ОбремененияТЧ.Контрагент = КонтрагентыСправочник.Ссылка
	|			ПО ИнвентарныеНомераОС.Ссылка = ОбремененияТЧ.Ссылка
	|		ПО ВТАналитики_Контрагента.Аналитика = ИнвентарныеНомераОС.ОС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыСправочник.Ссылка,
	|	КонтрагентыСправочник.Наименование,
	|	КонтрагентыСправочник.Код,
	|	ВЫБОР
	|		КОГДА КонтрагентыСправочник.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ,
	|	КонтрагентыСправочник.ЮридическоеФизическоеЛицо,
	|	КонтрагентыСправочник.ТипКонтрагента
	|ИЗ
	|	ВТАналитики_Контрагента КАК ВТАналитики_Контрагента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыФинансовыхВложений КАК ОбъектыФинансовыхВложений
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыСправочник
	|			ПО ОбъектыФинансовыхВложений.Контрагент = КонтрагентыСправочник.Ссылка
	|		ПО ВТАналитики_Контрагента.Аналитика = ОбъектыФинансовыхВложений.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЮридическоеФизическоеЛицо,
	|	ТипКонтрагента,
	|	VID_KONTRAGENTA
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЮридическиеЛица.Ссылка КАК Ссылка,
	|	ЮридическиеЛица.Бюджет КАК Бюджет,
	|	ЮридическиеЛица.СтранаРегистрации КАК СтранаРегистрации,
	|	ЮридическиеЛица.КодПоППП КАК КодПоППП,
	|	ЮридическиеЛица.Наименование КАК Наименование,
	|	Выразить(ЮридическиеЛица.ИНН Как Строка(10)) КАК ИНН,
	|	ЮридическиеЛица.КПП КАК КПП,
	|	ЮридическиеЛица.КодОКПО КАК КодОКПО,
	|	ЮридическиеЛица.КодПоРПБС КАК КодПоРПБС,
	|	ЮридическиеЛица.НаименованиеПолное КАК НаименованиеПолное,
	|	ЮридическиеЛица.ОГРН КАК ОГРН
	|ПОМЕСТИТЬ ВТЮрЛица
	|ИЗ
	|	Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Бюджет,
	|	СтранаРегистрации,
	|	КодПоППП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛица.Ссылка КАК Ссылка,
	|	ФизическиеЛица.Наименование КАК Наименование,
	|	ФизическиеЛица.ИНН КАК ИНН,
	|	ФизическиеЛица.ОГРНИП КАК ОГРНИП,
	|	ФизическиеЛица.СтранаРегистрации КАК СтранаРегистрации
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	СтранаРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТКонтрагентыПредварительно.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТКонтрагентыПредварительно.Ссылка) КАК GUID,
	|	ВТКонтрагентыПредварительно.Наименование КАК Наименование,
	|	ВТКонтрагентыПредварительно.ID_KONTRAGENTA КАК ID_KONTRAGENTA,
	|	ВТКонтрагентыПредварительно.VID_KONTRAGENTA КАК VID_KONTRAGENTA,
	|	ЕСТЬNULL(ТипыКонтрагентов.Код, """") КАК TIP_KONTRAGENTA,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТКонтрагентыПредварительно.ЮридическоеФизическоеЛицо) КАК GUIDЮридическоеФизическоеЛицо,
	|	ВТКонтрагентыПредварительно.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо
	|ИЗ
	|	ВТКонтрагентыПредварительно КАК ВТКонтрагентыПредварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыКонтрагентов КАК ТипыКонтрагентов
	|		ПО ВТКонтрагентыПредварительно.ТипКонтрагента = ТипыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТЮрЛица.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТЮрЛица.Ссылка) КАК GUID,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ЮридическиеЛицаКонтактнаяИнформация.ЗначенияПолей, """") КАК СТРОКА(1024)) КАК ЗначенияПолей,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ЮридическиеЛицаКонтактнаяИнформация.Представление, """") КАК СТРОКА(1024)) КАК Представление,
	|	ЕстьNull(ГлавыПоБюджетнойКлассификации.Код, """") КАК GLAVA,
	|	ВТЮрЛица.ИНН КАК INN,
	|	ВТЮрЛица.КодПоРПБС КАК KOD_SVR,
	|	ВТЮрЛица.КПП КАК KPP,
	|	ВЫБОР
	|		КОГДА ВТЮрЛица.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ИЛИ ВТЮрЛица.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ КАК NALOG_STATUS,
	|	ВТЮрЛица.НаименованиеПолное КАК OFIC_NAIM_POLN,
	|	ВТЮрЛица.Наименование КАК OFIC_NAIM_SOKR,
	|	ВТЮрЛица.ОГРН КАК OGRN,
	|	ЕстьNull(Бюджеты.Код, """") КАК OKTMO_BUDJ,
	|	ЕстьNull(СтраныМира.Наименование, ""РОССИЯ"") КАК STRANA
	|ИЗ
	|	ВТКонтрагентыПредварительно КАК ВТКонтрагентыПредварительно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЮрЛица КАК ВТЮрЛица
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица.КонтактнаяИнформация КАК ЮридическиеЛицаКонтактнаяИнформация
	|			ПО (ВТЮрЛица.Ссылка = ЮридическиеЛицаКонтактнаяИнформация.Ссылка)
	|				И (ЮридическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Бюджеты КАК Бюджеты
	|			ПО (ВТЮрЛица.Бюджет = Бюджеты.Ссылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГлавыПоБюджетнойКлассификации КАК ГлавыПоБюджетнойКлассификации
	|			ПО (ВТЮрЛица.КодПоППП = ГлавыПоБюджетнойКлассификации.Ссылка)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|			ПО (ВТЮрЛица.СтранаРегистрации = СтраныМира.Ссылка)
	|		ПО (ВТКонтрагентыПредварительно.VID_KONTRAGENTA = ""1""
	|				И ВТКонтрагентыПредварительно.ЮридическоеФизическоеЛицо = ВТЮрЛица.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТФизЛица.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТФизЛица.Ссылка) КАК GUID,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ФизическиеЛицаКонтактнаяИнформация.ЗначенияПолей, """") КАК СТРОКА(1024)) КАК ЗначенияПолей,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ФизическиеЛицаКонтактнаяИнформация.Представление, """") КАК СТРОКА(1024)) КАК Представление,
	|	ВТФизЛица.Наименование КАК FIO,
	|	ВЫБОР
	|		КОГДА ВТФизЛица.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ИЛИ ВТФизЛица.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)		
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ КАК NALOG_STATUS,
	|	ВТФизЛица.ОГРНИП КАК OGRNIP,
	|	ЕстьNull(СтраныМира.Наименование, ""РОССИЯ"") КАК STRANA
	|ИЗ
	|	ВТКонтрагентыПредварительно КАК ВТКонтрагентыПредварительно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизЛица КАК ВТФизЛица
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|			ПО (ВТФизЛица.Ссылка = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|					И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраныМира КАК СтраныМира
	|			ПО (ВТФизЛица.СтранаРегистрации = СтраныМира.Ссылка)
	|		ПО (ВТКонтрагентыПредварительно.VID_KONTRAGENTA = ""2""
	|				И ВТКонтрагентыПредварительно.ЮридическоеФизическоеЛицо = ВТФизЛица.Ссылка)");
	
	#КонецОбласти	
	
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Пакет = Запрос.ВыполнитьПакет();
	Выборка 	= Пакет[Пакет.Количество() - 3].Выбрать();
	ЮрЛица 		= Пакет[Пакет.Количество() - 2].Выбрать();
	ФизЛица 	= Пакет[Пакет.Количество() - 1].Выбрать();
	
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("UR_LICO", ПараметрыВыполнения);
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("UR_LICO", ПараметрыВыполнения);
	
	Пока ЮрЛица.Следующий() Цикл  
		
		ОбъектUR_LICO = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "UR_LICO"));
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ЮрЛица);
		СтруктураРеквизитов.GUID = XMLСтрока(ЮрЛица.GUID);                                    
		
		пЗаполнитьЗначенияСвойств(ОбъектUR_LICO, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "UR_LICO", Строка(ЮрЛица.OFIC_NAIM_SOKR), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		ОбъектUR_LICO.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("UR_LICO_" + ОбъектUR_LICO.GUID, ОбъектUR_LICO.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		Если СтруктураРеквизитов.Свойство("ADRES") Тогда
			АдресСтрокой = ПолучитьАдресСтрокой(ЮрЛица.ЗначенияПолей);
			ИДАдреса = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("ADRES_" + РассчитатьХешСтроки(АдресСтрокой + ЮрЛица.Представление));		
			ОбъектUR_LICO.ADRES = ?(ЗначениеЗаполнено(ИДАдреса), ИДАдреса, "");
		КонецЕсли;
		
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектUR_LICO);
	КонецЦикла;
	
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("FIZ_LICO", ПараметрыВыполнения);
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("FIZ_LICO", ПараметрыВыполнения);		
	
	Пока ФизЛица.Следующий() Цикл  
		
		ОбъектFIZ_LICO = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "FIZ_LICO"));  
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ФизЛица);	
		СтруктураРеквизитов.GUID = XMLСтрока(ФизЛица.GUID);                                    		
		пЗаполнитьЗначенияСвойств(ОбъектFIZ_LICO, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "FIZ_LICO", Строка(ФизЛица.FIO), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		
		ОбъектFIZ_LICO.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("FIZ_LICO_" + ОбъектFIZ_LICO.GUID, ОбъектFIZ_LICO.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		Если СтруктураРеквизитов.Свойство("ADRES") Тогда
			АдресСтрокой = ПолучитьАдресСтрокой(ФизЛица.ЗначенияПолей);
			ИДАдреса = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("ADRES_" + РассчитатьХешСтроки(АдресСтрокой + ФизЛица.Представление));		
			ОбъектFIZ_LICO.ADRES = ?(ЗначениеЗаполнено(ИДАдреса), ИДАдреса, "");
		КонецЕсли; 
		
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектFIZ_LICO);
	КонецЦикла;
	
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("KONTRAGENT", ПараметрыВыполнения);		
	
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("KONTRAGENT", ПараметрыВыполнения);	
	Пока Выборка.Следующий() Цикл 
		Если Не ЗначениеЗаполнено(Выборка.ЮридическоеФизическоеЛицо) Тогда 
			НН = НН + 1;
			новЗапись = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Добавить();
			новЗапись.Документ 			= ПараметрыВыполнения.ДокументСсылка;
			новЗапись.ВерсияФормата 	= ПараметрыВыполнения.ВерсияТаксономии;
			новЗапись.НомерЗаписи 		= НН; 
			новЗапись.ТипЗаписи 		= Перечисления.ТипыЗаписейМСД.РеквизитыАналитик;  
			новЗапись.ИмяАналитики 		= "KONTRAGENT";
			новЗапись.ДатаПроверки 		= ТекущаяДатаСеанса();
			новЗапись.Ошибка 			= Истина;
			новЗапись.ТекстСообщения 	= СтрШаблон(НСтр("ru='В аналитике %1 (%2) не заполнен реквизит %3'"), "KONTRAGENT", Строка(Выборка.GUID), "ЮридическоеФизическоеЛицо");
		КонецЕсли;
		
		ОбъектKONTRAGENT = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "KONTRAGENT")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);   
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);   
		
		пЗаполнитьЗначенияСвойств(ОбъектKONTRAGENT, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "KONTRAGENT", Строка(Выборка.Наименование), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		
		ОбъектKONTRAGENT.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("KONTRAGENT_" + ОбъектKONTRAGENT.GUID, ОбъектKONTRAGENT.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		
		Если СтруктураРеквизитов.Свойство("VID_KONTRAGENTA") И СтруктураРеквизитов.Свойство("UR_LICO") И Выборка.VID_KONTRAGENTA = "1" Тогда 
			ИД_ЮрЛица = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("UR_LICO_" + XMLСтрока(Выборка.GUIDЮридическоеФизическоеЛицо));
			ОбъектKONTRAGENT.UR_LICO = ?(ЗначениеЗаполнено(ИД_ЮрЛица), ИД_ЮрЛица, "");
		ИначеЕсли СтруктураРеквизитов.Свойство("VID_KONTRAGENTA") И СтруктураРеквизитов.Свойство("FIZ_LICO") И Выборка.VID_KONTRAGENTA = "2" Тогда                                                                       
			ИД_ФизЛица = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("FIZ_LICO_" + XMLСтрока(Выборка.GUIDЮридическоеФизическоеЛицо));
			ОбъектKONTRAGENT.FIZ_LICO = ?(ЗначениеЗаполнено(ИД_ФизЛица), ИД_ФизЛица, "");
		КонецЕсли;
		
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектKONTRAGENT);		
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТКонтрагентыПредварительно; УНИЧТОЖИТЬ ВТАналитики_Контрагента; УНИЧТОЖИТЬ ВТЮрЛица; УНИЧТОЖИТЬ ВТФизЛица"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура OSN_RASCH(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.OSN_RASCH(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ПринятыеОбязательства);
	
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МассивСубконто, "OSN_RASCH",,ПараметрыВыполнения);
	
	#Область ТекстЗапроса	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетныеНомераОбязательств.Обязательство КАК Обязательство,
	|	УчетныеНомераОбязательств.УчетныйНомерОбязательства КАК УчетныйНомерОбязательства
	|ПОМЕСТИТЬ ВТУчетныеНомераОбязательств
	|ИЗ
	|	РегистрСведений.УчетныеНомераОбязательств КАК УчетныеНомераОбязательств
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Обязательство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХарактеристикиОбязательствСрезПоследних.Договор КАК Договор,
	|	ХарактеристикиОбязательствСрезПоследних.ЗначениеХарактеристики КАК ЗначениеХарактеристики
	|ПОМЕСТИТЬ ВТХарактеристикиОбязательств
	|ИЗ
	|	РегистрСведений.ХарактеристикиОбязательств.СрезПоследних(
	|			&Дата,
	|			Договор В (ВЫБРАТЬ Т.Аналитика ИЗ ВТАналитики_OSN_RASCH КАК Т)
	|			И ВидХарактеристики = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыХарактеристикОбязательства.ИКЗ)) КАК ХарактеристикиОбязательствСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Договоры.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Договоры.Ссылка) КАК GUID,
	|	Договоры.Наименование КАК NAME,
	|	Договоры.ВидОбязательства КАК VID_OSN,
	|	Договоры.НомерДоговора КАК NOMER_OSN,
	|	Договоры.ДатаДоговора КАК DATE_OSN,
	|	ВЫРАЗИТЬ(Договоры.УИН КАК СТРОКА(36)) КАК UIN,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТУчетныеНомераОбязательств.УчетныйНомерОбязательства, """") КАК СТРОКА(20)) КАК NOMER_BO,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Договоры.Контрагент) КАК GUIDКонтрагент,
	|	Договоры.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(ВТХарактеристикиОбязательств.ЗначениеХарактеристики, """") КАК IKZ
	|ИЗ
	|	ВТАналитики_OSN_RASCH КАК ВТАналитики_OSN_RASCH
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТУчетныеНомераОбязательств КАК ВТУчетныеНомераОбязательств
	|			ПО (Договоры.Ссылка = ВТУчетныеНомераОбязательств.Обязательство)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбязательств КАК ВТХарактеристикиОбязательств
	|			ПО (Договоры.Ссылка = ВТХарактеристикиОбязательств.Договор)
	|		ПО (ВТАналитики_OSN_RASCH.Аналитика = Договоры.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагенты.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДоговорыКонтрагенты.Ссылка) КАК GUID,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДоговорыКонтрагенты.Контрагент) КАК GUIDКонтрагент,
	|	ДоговорыКонтрагенты.Контрагент КАК Контрагент
	|ИЗ
	|	ВТАналитики_OSN_RASCH КАК ВТАналитики_OSN_RASCH
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры.Контрагенты КАК ДоговорыКонтрагенты
	|		ПО ВТАналитики_OSN_RASCH.Аналитика = ДоговорыКонтрагенты.Ссылка
	|ИТОГИ ПО
	|	GUID");
	
	#КонецОбласти	
	
	Запрос.УстановитьПараметр("Дата", ПараметрыВыполнения.ОкончаниеПериода);	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;  
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[Пакет.Количество() - 2].Выбрать();
	ВыборкаСпискаКонтрагентов = Пакет[Пакет.Количество() - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураРеквизитовДоговор = СтруктураРеквизитовАналитики("OSN_RASCH", ПараметрыВыполнения);
	
	Если СтруктураРеквизитовДоговор.Свойство("SPIS_KONTRAGENT") Тогда
		Пока ВыборкаСпискаКонтрагентов.Следующий() Цикл
			ВыборкаСпискаДетально = ВыборкаСпискаКонтрагентов.Выбрать();  
			
			Если ВыборкаСпискаДетально.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОбъектГУИДКонтрагента = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "SPIS_KONTRAGENT"));   	
			ОбъектГУИДКонтрагента.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
			ОбъектГУИДКонтрагента.OWNER = XMLСтрока(ВыборкаСпискаКонтрагентов.GUID);  
			ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("SPIS_KONTRAGENT_" + ОбъектГУИДКонтрагента.OWNER, ОбъектГУИДКонтрагента.ID);
			ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;       
			
			п_НН = 1; 
			Пока ВыборкаСпискаДетально.Следующий() Цикл   				
				новСтрока = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "SPIS_KONTRAGENT").Свойства.Получить("ROW").Тип);
				новСтрока.ROWNUM = п_НН;
				п_НН = п_НН + 1;
				ИД_Контрагента = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("KONTRAGENT_" + XMLСтрока(ВыборкаСпискаДетально.GUIDКонтрагент));				
				новСтрока.KONTRAGENT = ?(ЗначениеЗаполнено(ИД_Контрагента), ИД_Контрагента, "");
				ОбъектГУИДКонтрагента.ROW.Добавить(новСтрока);
			КонецЦикла;          			
			
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектГУИДКонтрагента);			
		КонецЦикла;	
	КонецЕсли;
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("OSN_RASCH", ПараметрыВыполнения);		
	
	Пока Выборка.Следующий() Цикл  
		ОбъектOSN_RASCH = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "OSN_RASCH")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитовДоговор, Выборка);    
		СтруктураРеквизитовДоговор.GUID = XMLСтрока(Выборка.GUID); 
		
		пЗаполнитьЗначенияСвойств(ОбъектOSN_RASCH, СтруктураРеквизитовДоговор);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитовДоговор, "OSN_RASCH", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		ОбъектOSN_RASCH.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("OSN_RASCH_" + ОбъектOSN_RASCH.GUID, ОбъектOSN_RASCH.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;               
		Если СтруктураРеквизитовДоговор.Свойство("KONTRAGENT") Тогда
			ИД_Контрагента = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("KONTRAGENT_" + XMLСтрока(Выборка.GUIDКонтрагент));		
			ОбъектOSN_RASCH.KONTRAGENT = ?(ЗначениеЗаполнено(ИД_Контрагента), ИД_Контрагента, ""); 
		КонецЕсли;
		
		Если СтруктураРеквизитовДоговор.Свойство("SPIS_KONTRAGENT") Тогда
			ИД_СпискаКонтрагентов = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("SPIS_KONTRAGENT_" + ОбъектOSN_RASCH.GUID);		
			ОбъектOSN_RASCH.SPIS_KONTRAGENT = ?(ЗначениеЗаполнено(ИД_СпискаКонтрагентов), ИД_СпискаКонтрагентов, ""); 
		КонецЕсли;
		 
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектOSN_RASCH);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_OSN_RASCH"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура NMA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.NMA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства), "NMA",,ПараметрыВыполнения);		
	
	#Область ТекстЗапроса
	
	Запрос = Новый Запрос(		
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ИнвентарныеНомераОС.ОС, ВТАналитики_NMA.Аналитика) КАК Аналитика,
	|	ВТАналитики_NMA.Аналитика КАК GUID
	|ПОМЕСТИТЬ ВТАналитикиNMA_
	|ИЗ
	|	ВТАналитики_NMA КАК ВТАналитики_NMA
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ПО ВТАналитики_NMA.Аналитика = ИнвентарныеНомераОС.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Аналитика,
	|	GUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиNMA_ КАК Т)) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ ВТРасчетАмортизацииОС
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиNMA_ КАК Т)) КАК РасчетАмортизацииОССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь
	|ПОМЕСТИТЬ ВТСведенияКадастровогоУчета
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					Т.Аналитика
	|				ИЗ
	|					ВТАналитикиNMA_ КАК Т)) КАК СведенияКадастровогоУчетаСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОС.Событие КАК Событие,
	|	МАКСИМУМ(СобытияОС.Период) КАК Период,
	|	СобытияОС.Активность КАК Активность
	|ПОМЕСТИТЬ ВТ_СобытияОССрез
	|ИЗ
	|	РегистрСведений.СобытияОС КАК СобытияОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.Событие,
	|	СобытияОС.ОсновноеСредство,
	|	СобытияОС.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ДатаСобытия КАК ДатаСобытия,
	|	СобытияОС.ИнвНомер КАК ИнвНомер
	|ПОМЕСТИТЬ ВТ_СобытияОС
	|ИЗ
	|	ВТ_СобытияОССрез КАК ВТ_СобытияОССрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК СобытияОС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиNMA_ КАК ВТАналитикиNMA_
	|			ПО СобытияОС.ОсновноеСредство = ВТАналитикиNMA_.Аналитика
	|				И (СобытияОС.Активность)
	|		ПО ВТ_СобытияОССрез.ОсновноеСредство = СобытияОС.ОсновноеСредство
	|			И ВТ_СобытияОССрез.Событие = СобытияОС.Событие
	|			И ВТ_СобытияОССрез.Период = СобытияОС.Период
	|			И ВТ_СобытияОССрез.Активность = СобытияОС.Активность
	|ГДЕ
	|	СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|	И СобытияОС.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИнвНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТАналитикиNMA_.GUID КАК GUID,
	|	ИнвентарныеНомераОС.Ссылка КАК Ссылка,
	|	ИнвентарныеНомераОС.Код КАК INV_NOMER,
	|	ИнвентарныеНомераОС.ОС КАК ОС,
	|	ВЫРАЗИТЬ(ИнвентарныеНомераОС.ЗаводскойНомер КАК СТРОКА(40)) КАК NUM_ZAVOD,
	|	ИнвентарныеНомераОС.РеестровыйНомер КАК NUM_REESTR,
	|	ИнвентарныеНомераОС.ИнойНомер КАК NUM_INOY,
	|	ИнвентарныеНомераОС.ДатаВыпуска КАК DATA_VYP,
	|	ЕСТЬNULL(ВТ_СобытияОС.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_EKSP
	|ПОМЕСТИТЬ ВТ_ИнвНомера
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиNMA_ КАК ВТАналитикиNMA_
	|		ПО ИнвентарныеНомераОС.Ссылка = ВТАналитикиNMA_.GUID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СобытияОС КАК ВТ_СобытияОС
	|		ПО ИнвентарныеНомераОС.Ссылка = ВТ_СобытияОС.ИнвНомер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОС,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТАналитикиNMA_.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитикиNMA_.GUID) КАК GUID,
	|	ОсновныеСредстваПравообладания.ВидПрава КАК VID_PRAVA,
	|	ОсновныеСредстваПравообладания.ДатаДокумента КАК DATE,
	|	ОсновныеСредстваПравообладания.НомерДокумента КАК NOMER
	|ИЗ
	|	ВТАналитикиNMA_ КАК ВТАналитикиNMA_
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.Правообладания КАК ОсновныеСредстваПравообладания
	|		ПО ВТАналитикиNMA_.Аналитика = ОсновныеСредстваПравообладания.Ссылка
	|ИТОГИ ПО
	|	GUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ИнвНомера.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТ_ИнвНомера.GUID) КАК GUID,
	|	ВТ_ИнвНомера.INV_NOMER КАК Наименование,
	|	ИнвентарныеНомераОСОбременения.НаименованиеЧасти КАК NAME_IT,
	|	ИнвентарныеНомераОСОбременения.РазмерЧасти КАК RAZMER_IT,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, ""000"") КАК ED_IZM,
	|	ИнвентарныеНомераОСОбременения.ВидОбременения КАК VID_OBREM,
	|	ИнвентарныеНомераОСОбременения.ДатаНачала КАК DATE_NACH,
	|	ИнвентарныеНомераОСОбременения.ДатаОкончания КАК DATE_OKONCH,
	|	ИнвентарныеНомераОСОбременения.ДокументРегистрацииДата КАК DOC_REG_DATE,
	|	ИнвентарныеНомераОСОбременения.ДокументРегистрацииНомер КАК DOC_REG_NUM,
	|	ИнвентарныеНомераОСОбременения.ДокументОбремененияВид КАК DOC_OBR_VID,
	|	ИнвентарныеНомераОСОбременения.ДокументОбремененияДата КАК DOC_OBR_DATE,
	|	ИнвентарныеНомераОСОбременения.ДокументОбремененияНомер КАК DOC_OBR_NUM,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ИнвентарныеНомераОСОбременения.Контрагент) КАК GUIDКонтрагент,
	|	ИнвентарныеНомераОСОбременения.Контрагент КАК Контрагент
	|ИЗ
	|	ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС.Обременения КАК ИнвентарныеНомераОСОбременения
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|			ПО ИнвентарныеНомераОСОбременения.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ПО ВТ_ИнвНомера.Ссылка = ИнвентарныеНомераОСОбременения.Ссылка
	|ИТОГИ ПО
	|	GUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТАналитикиNMA_.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитикиNMA_.GUID) КАК GUID,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ОсновныеСредства.НаименованиеПолное = """"
	|				ТОГДА ОсновныеСредства.Наименование
	|			ИНАЧЕ ОсновныеСредства.НаименованиеПолное
	|		КОНЕЦ КАК СТРОКА(300)) КАК NAME,
	|	ЕСТЬNULL(ВТРасчетАмортизацииОС.СрокПолезногоИспользования, 0) КАК SROK,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПерваяГруппа)
	|			ТОГДА ""01""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВтораяГруппа)
	|			ТОГДА ""02""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ТретьяГруппа)
	|			ТОГДА ""03""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ЧетвертаяГруппа)
	|			ТОГДА ""04""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПятаяГруппа)
	|			ТОГДА ""05""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ШестаяГруппа)
	|			ТОГДА ""06""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.СедьмаяГруппа)
	|			ТОГДА ""07""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа)
	|			ТОГДА ""08""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа)
	|			ТОГДА ""09""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа)
	|			ТОГДА ""10""
	|		ИНАЧЕ ""00""
	|	КОНЕЦ КАК AMORT_GR,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОсновныеСредства.КодОКОФ) КАК OKOF,
	|	ВЫБОР
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|			ТОГДА ""01""
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|			ТОГДА ""02""
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|			ТОГДА ""03""
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции)
	|			ТОГДА ""04""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК SPOSOB_AMORT,
	|	ЕСТЬNULL(ВТСведенияКадастровогоУчета.КадастровыйНомер, """") КАК NUM_KADASTR,
	|	ЕСТЬNULL(ВТСведенияКадастровогоУчета.ОбщаяПлощадь, 0) КАК SQUARE,
	|	ЕСТЬNULL(ВТ_ИнвНомера.INV_NOMER, """") КАК INV_NOMER,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_ZAVOD, """") КАК NUM_ZAVOD,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_REESTR, """") КАК NUM_REESTR,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_INOY, """") КАК NUM_INOY,
	|	ЕСТЬNULL(ВТ_ИнвНомера.DATA_VYP, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_VYP,
	|	ЕСТЬNULL(ВТ_ИнвНомера.DATA_EKSP, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_EKSP
	|ИЗ
	|	ВТАналитикиNMA_ КАК ВТАналитикиNMA_
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетАмортизацииОС КАК ВТРасчетАмортизацииОС
	|			ПО ОсновныеСредства.Ссылка = ВТРасчетАмортизацииОС.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет КАК ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|			ПО ОсновныеСредства.Ссылка = ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияКадастровогоУчета КАК ВТСведенияКадастровогоУчета
	|			ПО ОсновныеСредства.Ссылка = ВТСведенияКадастровогоУчета.ОсновноеСредство
	|		ПО ВТАналитикиNMA_.Аналитика = ОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|		ПО ВТАналитикиNMA_.GUID = ВТ_ИнвНомера.Ссылка"); 
	
	#КонецОбласти	
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка 				= Пакет[Пакет.Количество() - 1].Выбрать();
	ВыборкаПравообладателей = Пакет[Пакет.Количество() - 3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбременений 		= Пакет[Пакет.Количество() - 2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураРеквизитовNMA = СтруктураРеквизитовАналитики("NMA", ПараметрыВыполнения);
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	
	Если СтруктураРеквизитовNMA.Свойство("NMA_PRAVOOBLADANIE") Тогда
		МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("NMA_PRAVOOBLADANIE", ПараметрыВыполнения);		
		
		СтруктураРеквизитов = СтруктураРеквизитовАналитики("NMA_PRAVOOBLADANIE", ПараметрыВыполнения);
		
		Пока ВыборкаПравообладателей.Следующий() Цикл     
			ОбъектPRAVOOBLADANIE = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "NMA_PRAVOOBLADANIE"));       
			ОбъектPRAVOOBLADANIE.ID =  Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");     
			ОбъектPRAVOOBLADANIE.OWNER =  XMLСтрока(ВыборкаПравообладателей.GUID);     
			ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("NMA_PRAVOOBLADANIE_" + ОбъектPRAVOOBLADANIE.OWNER, ОбъектPRAVOOBLADANIE.ID); 
			ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
			
			ВыборкаПравообладателейВыборка = ВыборкаПравообладателей.Выбрать();
			п_НН = 1;    
			Пока ВыборкаПравообладателейВыборка.Следующий() Цикл 
				новСтрока = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "PRAVOOBLADANIE").Свойства.Получить("ROW").Тип);
				ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ВыборкаПравообладателейВыборка);
				пЗаполнитьЗначенияСвойств(новСтрока, СтруктураРеквизитов);
				Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
					ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "NMA_PRAVOOBLADANIE", Строка(ВыборкаПравообладателейВыборка.Ссылка), НН, МассивОбязательныхРеквизитов);
				КонецЕсли;
				
				новСтрока.ROWNUM = п_НН;
				п_НН = п_НН + 1;
				ОбъектPRAVOOBLADANIE.ROW.Добавить(новСтрока);
			КонецЦикла;
                
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектPRAVOOBLADANIE);			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СтруктураРеквизитовNMA.Свойство("NMA_OBREMENENIE") Тогда
		МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("NMA_OBREMENENIE", ПараметрыВыполнения);		
		
		СтруктураРеквизитов = СтруктураРеквизитовАналитики("NMA_OBREMENENIE", ПараметрыВыполнения);
		Пока ВыборкаОбременений.Следующий() Цикл
			
			ОбъектOBREMENENIE = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "NMA_OBREMENENIE"));       
			ОбъектOBREMENENIE.ID =  Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");     
			ОбъектOBREMENENIE.OWNER =  XMLСтрока(ВыборкаОбременений.GUID);     
			ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("NMA_OBREMENENIE" + ОбъектOBREMENENIE.OWNER, ОбъектOBREMENENIE.ID); 
			ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
			
			ВыборкаОбремененийВыборка = ВыборкаОбременений.Выбрать();  
			п_НН = 1;
			Пока ВыборкаОбремененийВыборка.Следующий() Цикл
				новСтрока = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "OBREMENENIE").Свойства.Получить("ROW").Тип);
				ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ВыборкаОбремененийВыборка);
				пЗаполнитьЗначенияСвойств(новСтрока, СтруктураРеквизитов);
				Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
					ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "NMA_OBREMENENIE", Строка(ВыборкаОбремененийВыборка.Наименование), НН, МассивОбязательныхРеквизитов);
				КонецЕсли;
				
				новСтрока.ROWNUM = п_НН;
				п_НН = п_НН + 1;    
				Если СтруктураРеквизитов.Свойство("KONTRAGENT") Тогда
					ИД_Контрагента = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("KONTRAGENT_" + XMLСтрока(ВыборкаОбремененийВыборка.GUIDКонтрагент));
					новСтрока.KONTRAGENT = ?(ЗначениеЗаполнено(ИД_Контрагента), ИД_Контрагента, "");
				КонецЕсли;
				ОбъектOBREMENENIE.ROW.Добавить(новСтрока);
			КонецЦикла;                  
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектOBREMENENIE);
		КонецЦикла;
		
	КонецЕсли;
	
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("NMA", ПараметрыВыполнения);		
	
	Пока Выборка.Следующий() Цикл  
		ОбъектNMA = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "NMA")); 
		
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитовNMA, Выборка);		
		СтруктураРеквизитовNMA.GUID = XMLСтрока(Выборка.GUID);                                    
		пЗаполнитьЗначенияСвойств(ОбъектNMA, СтруктураРеквизитовNMA);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитовNMA, "NMA", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		ОбъектNMA.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("NMA_" + ОбъектNMA.GUID, ОбъектNMA.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		
		Если СтруктураРеквизитовNMA.Свойство("NMA_PRAVOOBLADANIE") Тогда
			ИД_Правообладания = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("NMA_PRAVOOBLADANIE_" + ОбъектNMA.GUID);		
			ОбъектNMA.NMA_PRAVOOBLADANIE = ?(ЗначениеЗаполнено(ИД_Правообладания), ИД_Правообладания, "");
		КонецЕсли;		
		Если СтруктураРеквизитовNMA.Свойство("NMA_OBREMENENIE") Тогда
			ИД_Обременений = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("NMA_OBREMENENIE_" + ОбъектNMA.GUID);	
			ОбъектNMA.NMA_OBREMENENIE = ?(ЗначениеЗаполнено(ИД_Обременений), ИД_Обременений, "");
		КонецЕсли;		
		                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектNMA);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_NMA; УНИЧТОЖИТЬ ВТАналитикиNMA_; УНИЧТОЖИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет; УНИЧТОЖИТЬ ВТРасчетАмортизацииОС; 
	|УНИЧТОЖИТЬ ВТСведенияКадастровогоУчета; УНИЧТОЖИТЬ ВТ_СобытияОССрез; УНИЧТОЖИТЬ ВТ_СобытияОС; УНИЧТОЖИТЬ ВТ_ИнвНомера"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();			
	
КонецПроцедуры      

Процедура NPA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.NPA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства), "NPA",,ПараметрыВыполнения);		
	
	#Область ТекстЗапроса
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ИнвентарныеНомераОС.ОС, ВТАналитики_NPA.Аналитика) КАК Аналитика,
	|	ВТАналитики_NPA.Аналитика КАК GUID
	|ПОМЕСТИТЬ ВТАналитикиNPA_
	|ИЗ
	|	ВТАналитики_NPA КАК ВТАналитики_NPA
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ПО ВТАналитики_NPA.Аналитика = ИнвентарныеНомераОС.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Аналитика,
	|	GUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиNPA_ КАК Т)) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ ВТРасчетАмортизацииОС
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиNPA_ КАК Т)) КАК РасчетАмортизацииОССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь
	|ПОМЕСТИТЬ ВТСведенияКадастровогоУчета
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					Т.Аналитика
	|				ИЗ
	|					ВТАналитикиNPA_ КАК Т)) КАК СведенияКадастровогоУчетаСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОС.Событие КАК Событие,
	|	МАКСИМУМ(СобытияОС.Период) КАК Период,
	|	СобытияОС.Активность КАК Активность
	|ПОМЕСТИТЬ ВТ_СобытияОССрез
	|ИЗ
	|	РегистрСведений.СобытияОС КАК СобытияОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.Событие,
	|	СобытияОС.ОсновноеСредство,
	|	СобытияОС.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ДатаСобытия КАК ДатаСобытия,
	|	СобытияОС.ИнвНомер КАК ИнвНомер
	|ПОМЕСТИТЬ ВТ_СобытияОС
	|ИЗ
	|	ВТ_СобытияОССрез КАК ВТ_СобытияОССрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК СобытияОС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиNPA_ КАК ВТАналитикиNPA_
	|			ПО СобытияОС.ОсновноеСредство = ВТАналитикиNPA_.Аналитика
	|				И (СобытияОС.Активность)
	|		ПО ВТ_СобытияОССрез.ОсновноеСредство = СобытияОС.ОсновноеСредство
	|			И ВТ_СобытияОССрез.Событие = СобытияОС.Событие
	|			И ВТ_СобытияОССрез.Период = СобытияОС.Период
	|			И ВТ_СобытияОССрез.Активность = СобытияОС.Активность
	|ГДЕ
	|	СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|	И СобытияОС.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИнвНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТАналитикиNPA_.GUID КАК GUID,
	|	ИнвентарныеНомераОС.Ссылка КАК Ссылка,
	|	ИнвентарныеНомераОС.Код КАК INV_NOMER,
	|	ИнвентарныеНомераОС.ОС КАК ОС,
	|	ВЫРАЗИТЬ(ИнвентарныеНомераОС.ЗаводскойНомер КАК СТРОКА(40)) КАК NUM_ZAVOD,
	|	ИнвентарныеНомераОС.РеестровыйНомер КАК NUM_REESTR,
	|	ИнвентарныеНомераОС.ИнойНомер КАК NUM_INOY,
	|	ИнвентарныеНомераОС.ДатаВыпуска КАК DATA_VYP,
	|	ЕСТЬNULL(ВТ_СобытияОС.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_EKSP
	|ПОМЕСТИТЬ ВТ_ИнвНомера
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиNPA_ КАК ВТАналитикиNPA_
	|		ПО ИнвентарныеНомераОС.Ссылка = ВТАналитикиNPA_.GUID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СобытияОС КАК ВТ_СобытияОС
	|		ПО ИнвентарныеНомераОС.Ссылка = ВТ_СобытияОС.ИнвНомер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОС,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТАналитикиNPA_.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитикиNPA_.GUID) КАК GUID,
	|	ОсновныеСредстваПравообладания.ВидПрава КАК VID_PRAVA,
	|	ОсновныеСредстваПравообладания.ДатаДокумента КАК DATE,
	|	ОсновныеСредстваПравообладания.НомерДокумента КАК NOMER
	|ИЗ
	|	ВТАналитикиNPA_ КАК ВТАналитикиNPA_
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.Правообладания КАК ОсновныеСредстваПравообладания
	|		ПО ВТАналитикиNPA_.Аналитика = ОсновныеСредстваПравообладания.Ссылка
	|ИТОГИ ПО
	|	GUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ИнвНомера.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТ_ИнвНомера.GUID) КАК GUID,
	|	ВТ_ИнвНомера.INV_NOMER КАК Наименование,
	|	ИнвентарныеНомераОСОбременения.НаименованиеЧасти КАК NAME_IT,
	|	ИнвентарныеНомераОСОбременения.РазмерЧасти КАК RAZMER_IT,
	|	ЕСТЬNULL(КлассификаторЕдиницИзмерения.Код, ""000"") КАК ED_IZM,
	|	ИнвентарныеНомераОСОбременения.ВидОбременения КАК VID_OBREM,
	|	ИнвентарныеНомераОСОбременения.ДатаНачала КАК DATE_NACH,
	|	ИнвентарныеНомераОСОбременения.ДатаОкончания КАК DATE_OKONCH,
	|	ИнвентарныеНомераОСОбременения.ДокументРегистрацииДата КАК DOC_REG_DATE,
	|	ИнвентарныеНомераОСОбременения.ДокументРегистрацииНомер КАК DOC_REG_NUM,
	|	ИнвентарныеНомераОСОбременения.ДокументОбремененияВид КАК DOC_OBR_VID,
	|	ИнвентарныеНомераОСОбременения.ДокументОбремененияДата КАК DOC_OBR_DATE,
	|	ИнвентарныеНомераОСОбременения.ДокументОбремененияНомер КАК DOC_OBR_NUM,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ИнвентарныеНомераОСОбременения.Контрагент) КАК GUIDКонтрагент,
	|	ИнвентарныеНомераОСОбременения.Контрагент КАК Контрагент
	|ИЗ
	|	ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС.Обременения КАК ИнвентарныеНомераОСОбременения
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|			ПО ИнвентарныеНомераОСОбременения.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ПО ВТ_ИнвНомера.Ссылка = ИнвентарныеНомераОСОбременения.Ссылка
	|ИТОГИ ПО
	|	GUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТАналитикиNPA_.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитикиNPA_.GUID) КАК GUID,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ОсновныеСредства.НаименованиеПолное = """"
	|				ТОГДА ОсновныеСредства.Наименование
	|			ИНАЧЕ ОсновныеСредства.НаименованиеПолное
	|		КОНЕЦ КАК СТРОКА(300)) КАК NAME,
	|	ЕСТЬNULL(ВТРасчетАмортизацииОС.СрокПолезногоИспользования, 0) КАК SROK,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПерваяГруппа)
	|			ТОГДА ""01""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВтораяГруппа)
	|			ТОГДА ""02""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ТретьяГруппа)
	|			ТОГДА ""03""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ЧетвертаяГруппа)
	|			ТОГДА ""04""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПятаяГруппа)
	|			ТОГДА ""05""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ШестаяГруппа)
	|			ТОГДА ""06""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.СедьмаяГруппа)
	|			ТОГДА ""07""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ВосьмаяГруппа)
	|			ТОГДА ""08""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДевятаяГруппа)
	|			ТОГДА ""09""
	|		КОГДА ОсновныеСредства.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ДесятаяГруппа)
	|			ТОГДА ""10""
	|		ИНАЧЕ ""00""
	|	КОНЕЦ КАК AMORT_GR,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОсновныеСредства.КодОКОФ) КАК OKOF,
	|	ВЫБОР
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|			ТОГДА ""01""
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|			ТОГДА ""02""
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|			ТОГДА ""03""
	|		КОГДА ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции)
	|			ТОГДА ""04""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК SPOSOB_AMORT,
	|	ЕСТЬNULL(ВТСведенияКадастровогоУчета.КадастровыйНомер, """") КАК NUM_KADASTR,
	|	ЕСТЬNULL(ВТСведенияКадастровогоУчета.ОбщаяПлощадь, 0) КАК SQUARE,
	|	ЕСТЬNULL(ВТ_ИнвНомера.INV_NOMER, """") КАК INV_NOMER,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_ZAVOD, """") КАК NUM_ZAVOD,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_REESTR, """") КАК NUM_REESTR,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_INOY, """") КАК NUM_INOY,
	|	ЕСТЬNULL(ВТ_ИнвНомера.DATA_VYP, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_VYP,
	|	ЕСТЬNULL(ВТ_ИнвНомера.DATA_EKSP, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_EKSP
	|ИЗ
	|	ВТАналитикиNPA_ КАК ВТАналитикиNPA_
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетАмортизацииОС КАК ВТРасчетАмортизацииОС
	|			ПО ОсновныеСредства.Ссылка = ВТРасчетАмортизацииОС.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет КАК ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|			ПО ОсновныеСредства.Ссылка = ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияКадастровогоУчета КАК ВТСведенияКадастровогоУчета
	|			ПО ОсновныеСредства.Ссылка = ВТСведенияКадастровогоУчета.ОсновноеСредство
	|		ПО ВТАналитикиNPA_.Аналитика = ОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|		ПО ВТАналитикиNPA_.GUID = ВТ_ИнвНомера.Ссылка");
	
	#КонецОбласти	
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка 				= Пакет[Пакет.Количество() - 1].Выбрать();
	ВыборкаПравообладателей = Пакет[Пакет.Количество() - 3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбременений 		= Пакет[Пакет.Количество() - 2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СтруктураРеквизитовNPA = СтруктураРеквизитовАналитики("NPA", ПараметрыВыполнения);
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество(); 
	
	Если СтруктураРеквизитовNPA.Свойство("NPA_PRAVOOBLADANIE") Тогда
		МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("NPA_PRAVOOBLADANIE", ПараметрыВыполнения);		
		
		СтруктураРеквизитов = СтруктураРеквизитовАналитики("NPA_PRAVOOBLADANIE", ПараметрыВыполнения);
		
		Пока ВыборкаПравообладателей.Следующий() Цикл     
			ОбъектPRAVOOBLADANIE = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "NPA_PRAVOOBLADANIE"));       
			ОбъектPRAVOOBLADANIE.ID =  Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");     
			ОбъектPRAVOOBLADANIE.OWNER =  XMLСтрока(ВыборкаПравообладателей.GUID);     
			ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("NPA_PRAVOOBLADANIE_" + ОбъектPRAVOOBLADANIE.OWNER, ОбъектPRAVOOBLADANIE.ID); 
			ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
			
			ВыборкаПравообладателейВыборка = ВыборкаПравообладателей.Выбрать();
			п_НН = 1; 
			Пока ВыборкаПравообладателейВыборка.Следующий() Цикл 
				новСтрока = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "PRAVOOBLADANIE").Свойства.Получить("ROW").Тип);
				ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ВыборкаПравообладателейВыборка);
				пЗаполнитьЗначенияСвойств(новСтрока, СтруктураРеквизитов);
				Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
					ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "NPA_PRAVOOBLADANIE", Строка(ВыборкаПравообладателейВыборка.Ссылка), НН, МассивОбязательныхРеквизитов);
				КонецЕсли;
				
				новСтрока.ROWNUM = п_НН;
				п_НН = п_НН + 1;
				
				ОбъектPRAVOOBLADANIE.ROW.Добавить(новСтрока);
			КонецЦикла;
			                
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектPRAVOOBLADANIE);
		КонецЦикла;
		
	КонецЕсли;
	
	Если СтруктураРеквизитовNPA.Свойство("NPA_OBREMENENIE") Тогда
		МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("NPA_OBREMENENIE", ПараметрыВыполнения);		
		
		СтруктураРеквизитов = СтруктураРеквизитовАналитики("NPA_OBREMENENIE", ПараметрыВыполнения);
		Пока ВыборкаОбременений.Следующий() Цикл
			
			ОбъектOBREMENENIE = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "NPA_OBREMENENIE"));       
			ОбъектOBREMENENIE.ID =  Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");     
			ОбъектOBREMENENIE.OWNER =  XMLСтрока(ВыборкаОбременений.GUID);     
			ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("NPA_OBREMENENIE_" + ОбъектOBREMENENIE.OWNER, ОбъектOBREMENENIE.ID); 
			ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
			
			ВыборкаОбремененийВыборка = ВыборкаОбременений.Выбрать();  
			п_НН = 1;
			Пока ВыборкаОбремененийВыборка.Следующий() Цикл
				новСтрока = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "NPA_OBREMENENIE").Свойства.Получить("ROW").Тип);
				ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ВыборкаОбремененийВыборка);
				пЗаполнитьЗначенияСвойств(новСтрока, СтруктураРеквизитов);
				Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
					ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "NPA_OBREMENENIE", Строка(ВыборкаОбремененийВыборка.Наименование), НН, МассивОбязательныхРеквизитов);
				КонецЕсли;
				
				новСтрока.ROWNUM = п_НН;
				п_НН = п_НН + 1;    
				Если СтруктураРеквизитов.Свойство("KONTRAGENT") Тогда
					ИД_Контрагента = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("KONTRAGENT_" + XMLСтрока(ВыборкаОбремененийВыборка.GUIDКонтрагент));
					новСтрока.KONTRAGENT = ?(ЗначениеЗаполнено(ИД_Контрагента), ИД_Контрагента, "");
				КонецЕсли;
				
				ОбъектOBREMENENIE.ROW.Добавить(новСтрока);
			КонецЦикла;   
			
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектOBREMENENIE);
		КонецЦикла;
		
	КонецЕсли;
	
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("NPA", ПараметрыВыполнения);		
	
	Пока Выборка.Следующий() Цикл  
		ОбъектNPA = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "NPA")); 
		
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитовNPA, Выборка);				
		СтруктураРеквизитовNPA.GUID = XMLСтрока(Выборка.GUID);                                    
		
		
		пЗаполнитьЗначенияСвойств(ОбъектNPA, СтруктураРеквизитовNPA);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитовNPA, "NPA", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		ОбъектNPA.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("NPA_" + ОбъектNPA.GUID, ОбъектNPA.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		
		Если СтруктураРеквизитовNPA.Свойство("NPA_PRAVOOBLADANIE") Тогда
			ИД_Правообладания = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("NPA_PRAVOOBLADANIE_" + ОбъектNPA.GUID);		
			ОбъектNPA.NPA_PRAVOOBLADANIE = ?(ЗначениеЗаполнено(ИД_Правообладания), ИД_Правообладания, "");
		КонецЕсли;		
		Если СтруктураРеквизитовNPA.Свойство("NPA_OBREMENENIE") Тогда
			ИД_Обременений = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("NPA_OBREMENENIE_" + ОбъектNPA.GUID);	
			ОбъектNPA.NPA_OBREMENENIE = ?(ЗначениеЗаполнено(ИД_Обременений), ИД_Обременений, "");
		КонецЕсли;		
		                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектNPA);
	КонецЦикла;   
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_NPA; УНИЧТОЖИТЬ ВТАналитикиNPA_; УНИЧТОЖИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет; УНИЧТОЖИТЬ ВТРасчетАмортизацииОС; 
	|УНИЧТОЖИТЬ ВТСведенияКадастровогоУчета; УНИЧТОЖИТЬ ВТ_СобытияОССрез; УНИЧТОЖИТЬ ВТ_СобытияОС; УНИЧТОЖИТЬ ВТ_ИнвНомера"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();		
	
КонецПроцедуры  

Процедура MZ_BIO(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.MZ_BIO(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	СпецАналитикиНаборомВМенеджерВТ(МенеджерВТ, "MZ_BIO");      
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Номенклатура.Ссылка) КАК GUID,
	|	Номенклатура.Наименование КАК NAME,
	|	ВЫБОР
	|		КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Медикаменты)
	|			ТОГДА ""1""
	|		КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПродуктыПитания)
	|			ТОГДА ""2""
	|		КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ГСМ)
	|			ТОГДА ""3""
	|		КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Стройматериалы)
	|			ТОГДА ""4""
	|		КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МягкийИнвентарь)
	|			ТОГДА ""5""
	|		КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПрочиеМЗ)
	|			ТОГДА ""6""
	|		КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Продукция)
	|			ТОГДА ""7""
	|		КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.БСО)
	|			ТОГДА ""8""
	|		КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.БиологическиеАктивы)
	|			ТОГДА ""9""
	|		ИНАЧЕ ""6""
	|	КОНЕЦ КАК VID_MZ_BIO,
	|	Номенклатура.Сведения КАК SORT_VOZR_GR,
	|	ВЫБОР
	|		КОГДА Номенклатура.ВключитьВСоставВнеоборотныхАктивов
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК VNEOBR_AKTIV,
	|	ЕстьNull(КлассификаторЕдиницИзмерения.Код, ""000"") КАК ED_IZM,
	|	Номенклатура.ОКП КАК KOD_OKPD2
	|ИЗ
	|	ВТАналитики_MZ_BIO КАК ВТАналитики_MZ_BIO
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|			ПО Номенклатура.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ПО ВТАналитики_MZ_BIO.Аналитика = Номенклатура.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Выборка 				= Запрос.Выполнить().Выбрать();
	
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("MZ_BIO", ПараметрыВыполнения);
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("MZ_BIO", ПараметрыВыполнения);
	
	Пока Выборка.Следующий() Цикл  
		ОбъектВMZ_BIO = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "MZ_BIO")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);                                  
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);
		
		пЗаполнитьЗначенияСвойств(ОбъектВMZ_BIO, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "MZ_BIO", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		
		ОбъектВMZ_BIO.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("MZ_BIO_" + ОбъектВMZ_BIO.GUID, ОбъектВMZ_BIO.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1; 
		                 
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектВMZ_BIO);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_MZ_BIO"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры  

Процедура KAP_VL_OS_NMA_NPA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.KAP_VL_OS_NMA_NPA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства), "KAP_VL_OS_NMA_NPA",,ПараметрыВыполнения);		
	
	#Область ТекстЗапроса
	
	Запрос = Новый Запрос(  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ИнвентарныеНомераОС.ОС, ВТАналитики_KAP_VL_OS_NMA_NPA.Аналитика) КАК Аналитика,
	|	ВТАналитики_KAP_VL_OS_NMA_NPA.Аналитика КАК GUID		
	|ПОМЕСТИТЬ ВТАналитикиKAP_VL_OS_NMA_NPA_
	|ИЗ
	|	ВТАналитики_KAP_VL_OS_NMA_NPA КАК ВТАналитики_KAP_VL_OS_NMA_NPA
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ПО ВТАналитики_KAP_VL_OS_NMA_NPA.Аналитика = ИнвентарныеНомераОС.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Аналитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиKAP_VL_OS_NMA_NPA_ КАК Т)) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	СпособНачисленияАмортизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ ВТРасчетАмортизацииОС
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиKAP_VL_OS_NMA_NPA_ КАК Т)) КАК РасчетАмортизацииОССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь
	|ПОМЕСТИТЬ ВТСведенияКадастровогоУчета
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					Т.Аналитика
	|				ИЗ
	|					ВТАналитикиKAP_VL_OS_NMA_NPA_ КАК Т)) КАК СведенияКадастровогоУчетаСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОС.Событие КАК Событие,
	|	МАКСИМУМ(СобытияОС.Период) КАК Период,
	|	СобытияОС.Активность КАК Активность
	|ПОМЕСТИТЬ ВТ_СобытияОССрез
	|ИЗ
	|	РегистрСведений.СобытияОС КАК СобытияОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.Событие,
	|	СобытияОС.ОсновноеСредство,
	|	СобытияОС.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ДатаСобытия КАК ДатаСобытия,
	|	СобытияОС.ИнвНомер КАК ИнвНомер
	|ПОМЕСТИТЬ ВТ_СобытияОС
	|ИЗ
	|	ВТ_СобытияОССрез КАК ВТ_СобытияОССрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК СобытияОС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиKAP_VL_OS_NMA_NPA_ КАК ВТАналитикиKAP_VL_OS_NMA_NPA_
	|			ПО СобытияОС.ОсновноеСредство = ВТАналитикиKAP_VL_OS_NMA_NPA_.Аналитика
	|				И (СобытияОС.Активность)
	|		ПО ВТ_СобытияОССрез.ОсновноеСредство = СобытияОС.ОсновноеСредство
	|			И ВТ_СобытияОССрез.Событие = СобытияОС.Событие
	|			И ВТ_СобытияОССрез.Период = СобытияОС.Период
	|			И ВТ_СобытияОССрез.Активность = СобытияОС.Активность
	|ГДЕ
	|	СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|	И СобытияОС.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИнвНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИнвентарныеНомераОС.Ссылка КАК Ссылка,
	|	ИнвентарныеНомераОС.Код КАК Код,
	|	ИнвентарныеНомераОС.ОС КАК ОС,
	|	ВЫРАЗИТЬ(ИнвентарныеНомераОС.ЗаводскойНомер КАК СТРОКА(40)) КАК ЗаводскойНомер,
	|	ИнвентарныеНомераОС.РеестровыйНомер КАК РеестровыйНомер,
	|	ИнвентарныеНомераОС.ИнойНомер КАК ИнойНомер,
	|	ИнвентарныеНомераОС.ДатаВыпуска КАК ДатаВыпуска,
	|	ЕСТЬNULL(ВТ_СобытияОС.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСобытия
	|ПОМЕСТИТЬ ВТ_ИнвНомера
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиKAP_VL_OS_NMA_NPA_ КАК ВТАналитикиKAP_VL_OS_NMA_NPA_
	|		ПО (НЕ ИнвентарныеНомераОС.ПометкаУдаления)
	|			И (ВТАналитикиKAP_VL_OS_NMA_NPA_.Аналитика = ИнвентарныеНомераОС.ОС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СобытияОС КАК ВТ_СобытияОС
	|		ПО (ИнвентарныеНомераОС.Ссылка = ВТ_СобытияОС.ИнвНомер)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(КарточкиКапвложений.Ссылка) КАК Ссылка,
	|	КарточкиКапвложений.ОбъектВложений КАК ОбъектВложений,
	|	МАКСИМУМ(КарточкиКапвложений.Код) КАК Код,
	|	МАКСИМУМ(КарточкиКапвложений.УчетныйНомерОбъектаКапвложений) КАК УчетныйНомерОбъектаКапвложений,
	|	МАКСИМУМ(КарточкиКапвложений.ДатаНачалаВложений) КАК ДатаНачалаВложений,
	|	МАКСИМУМ(КарточкиКапвложений.ДатаЗакрытияКарточки) КАК ДатаЗакрытияКарточки
	|ПОМЕСТИТЬ ВТКарточкиКапВложений
	|ИЗ
	|	Справочник.КарточкиКапвложений КАК КарточкиКапвложений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиKAP_VL_OS_NMA_NPA_ КАК ВТАналитикиKAP_VL_OS_NMA_NPA_
	|		ПО (КарточкиКапвложений.ОбъектВложений = ВТАналитикиKAP_VL_OS_NMA_NPA_.Аналитика)
	|
	|СГРУППИРОВАТЬ ПО
	|	КарточкиКапвложений.ОбъектВложений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ОбъектВложений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ   
	|   ВТАналитикиKAP_VL_OS_NMA_NPA_.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитикиKAP_VL_OS_NMA_NPA_.GUID) КАК GUID,
	|	ЕСТЬNULL(ВТКарточкиКапВложений.Код, ""   "") КАК NUM,
	|	ЕСТЬNULL(ВТКарточкиКапВложений.УчетныйНомерОбъектаКапвложений, """") КАК UCH_NOMER,
	|	ЕСТЬNULL(ОсновныеСредства.УчетныйНомерОбъектаКапвложенийДоПоступления, """") КАК UCH_NOMER_DO_POST,
	|	ВТКарточкиКапВложений.ДатаНачалаВложений КАК ДатаНачалаВложений,
	|	ЕСТЬNULL(ВТКарточкиКапВложений.ДатаЗакрытияКарточки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗакрытияКарточки
	|ИЗ
	|	ВТАналитикиKAP_VL_OS_NMA_NPA_ КАК ВТАналитикиKAP_VL_OS_NMA_NPA_
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|			ПО ОсновныеСредства.Ссылка = ВТ_ИнвНомера.ОС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКарточкиКапВложений КАК ВТКарточкиКапВложений
	|			ПО ОсновныеСредства.Ссылка = ВТКарточкиКапВложений.ОбъектВложений
	|		ПО ВТАналитикиKAP_VL_OS_NMA_NPA_.Аналитика = ОсновныеСредства.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ                        
	|   ВТАналитикиKAP_VL_OS_NMA_NPA_.GUID КАК Ссылка, 
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитикиKAP_VL_OS_NMA_NPA_.GUID) КАК GUID,
	|	ВЫРАЗИТЬ(ОсновныеСредства.НаименованиеПолное КАК СТРОКА(300)) КАК NAME,
	|	ЕСТЬNULL(СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер, """") КАК NUM_KADASTR,
	|	ЕСТЬNULL(ВТ_ИнвНомера.РеестровыйНомер, """") КАК NUM_REESTR,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ИнвНомера.ЗаводскойНомер, """") КАК СТРОКА(40)) КАК NUM_ZAVOD,
	|	ЕСТЬNULL(ВТ_ИнвНомера.ИнойНомер, """") КАК NUM_INOY,
	|	ОсновныеСредства.КодФАИП КАК UK_OKS
	|ИЗ
	|	ВТАналитикиKAP_VL_OS_NMA_NPA_ КАК ВТАналитикиKAP_VL_OS_NMA_NPA_
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|			ПО (ОсновныеСредства.Ссылка = ВТ_ИнвНомера.ОС)
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияКадастровогоУчета КАК СведенияКадастровогоУчетаСрезПоследних
	|			ПО (ОсновныеСредства.Ссылка = СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство)
	|		ПО (ВТАналитикиKAP_VL_OS_NMA_NPA_.Аналитика = ОсновныеСредства.Ссылка)");
	
	#КонецОбласти	
	
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка 				= Пакет[Пакет.Количество() - 1].Выбрать();
	ВыборкаКарточек			= Пакет[Пакет.Количество() - 2].Выбрать();
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("KARTOCHKA_KAP_VL", ПараметрыВыполнения);
	
	СтруктураРеквизитовКапВложений = СтруктураРеквизитовАналитики("KAP_VL_OS_NMA_NPA", ПараметрыВыполнения);
	
	Если СтруктураРеквизитовКапВложений.Свойство("KARTOCHKA_KAP_VL") Тогда
		СтруктураРеквизитов = СтруктураРеквизитовАналитики("KARTOCHKA_KAP_VL", ПараметрыВыполнения);
		Пока ВыборкаКарточек.Следующий() Цикл
			ОбъектKARTOCHKA_KAP_VL  = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "KARTOCHKA_KAP_VL"));
			ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ВыборкаКарточек); 
			пЗаполнитьЗначенияСвойств(ОбъектKARTOCHKA_KAP_VL, СтруктураРеквизитов);
			Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
				ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "KARTOCHKA_KAP_VL", Строка(ВыборкаКарточек.Ссылка), НН, МассивОбязательныхРеквизитов);
			КонецЕсли;
			
			ОбъектKARTOCHKA_KAP_VL.ID =  Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
			ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("KARTOCHKA_KAP_VL_" + XMLСтрока(ВыборкаКарточек.GUID), ОбъектKARTOCHKA_KAP_VL.ID);
			ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
			
			Если СтруктураРеквизитов.Свойство("GOD_VLOG") Тогда
				ОбъектKARTOCHKA_KAP_VL.GOD_VLOG = Формат(ВыборкаКарточек.ДатаНачалаВложений, НСтр("ru='ДФ=''yyyy'''")); 
			КонецЕсли;
			Если СтруктураРеквизитов.Свойство("STATUS_NACH_GODA") Тогда
				Если ЗначениеЗаполнено(ВыборкаКарточек.ДатаНачалаВложений) И ВыборкаКарточек.ДатаНачалаВложений <=НачалоГода(ТекущаяДатаСеанса())
					И (Не ЗначениеЗаполнено(ВыборкаКарточек.ДатаЗакрытияКарточки) ИЛИ ВыборкаКарточек.ДатаЗакрытияКарточки > НачалоГода(ТекущаяДатаСеанса())) Тогда 
					ОбъектKARTOCHKA_KAP_VL.STATUS_NACH_GODA = СтрШаблон(НСтр("ru = 'У объекта начаты капитальные вложения c %1'") , Формат(ВыборкаКарточек.ДатаНачалаВложений, "ДЛФ=ДД"));
				ИначеЕсли Не ЗначениеЗаполнено(ВыборкаКарточек.ДатаНачалаВложений) Тогда                                                                                                       
					ОбъектKARTOCHKA_KAP_VL.STATUS_NACH_GODA = НСтр("ru = 'У объекта не начаты капитальные вложения'");
				ИначеЕсли ЗначениеЗаполнено(ВыборкаКарточек.ДатаЗакрытияКарточки) И ВыборкаКарточек.ДатаЗакрытияКарточки < НачалоГода(ТекущаяДатаСеанса()) Тогда                                       
					ОбъектKARTOCHKA_KAP_VL.STATUS_NACH_GODA = СтрШаблон(НСтр("ru = 'У объекта закрыта карточка капитальных вложений c %1'") , Формат(ВыборкаКарточек.ДатаЗакрытияКарточки,"ДЛФ=ДД"));
				Иначе  
					ОбъектKARTOCHKA_KAP_VL.STATUS_NACH_GODA = НСтр("ru = 'Статус объекта капитальных вложений не определен'");
				КонецЕсли;
			КонецЕсли;	
			
			Если СтруктураРеквизитов.Свойство("STATUS_OTCH_DATA") Тогда			
				Если ЗначениеЗаполнено(ВыборкаКарточек.ДатаНачалаВложений) И ВыборкаКарточек.ДатаНачалаВложений <= ТекущаяДатаСеанса()
					И (Не ЗначениеЗаполнено(ВыборкаКарточек.ДатаЗакрытияКарточки) ИЛИ ВыборкаКарточек.ДатаЗакрытияКарточки > ТекущаяДатаСеанса()) Тогда 
					ОбъектKARTOCHKA_KAP_VL.STATUS_OTCH_DATA = СтрШаблон(НСтр("ru = 'У объекта начаты капитальные вложения c %1'") , Формат(ВыборкаКарточек.ДатаНачалаВложений, "ДЛФ=ДД"));
				ИначеЕсли Не ЗначениеЗаполнено(ВыборкаКарточек.ДатаНачалаВложений) Тогда                                                                                                       
					ОбъектKARTOCHKA_KAP_VL.STATUS_OTCH_DATA = НСтр("ru = 'У объекта не начаты капитальные вложения'");
				ИначеЕсли ЗначениеЗаполнено(ВыборкаКарточек.ДатаЗакрытияКарточки) И ВыборкаКарточек.ДатаЗакрытияКарточки < ТекущаяДатаСеанса() Тогда                                       
					ОбъектKARTOCHKA_KAP_VL.STATUS_NACH_GODA = СтрШаблон(НСтр("ru = 'У объекта закрыта карточка капитальных вложений c %1'") , Формат(ВыборкаКарточек.ДатаЗакрытияКарточки, "ДЛФ=ДД"));
				Иначе 
					ОбъектKARTOCHKA_KAP_VL.STATUS_OTCH_DATA = НСтр("ru = 'Статус объекта капитальных вложений не определен'");
				КонецЕсли;
			КонецЕсли;
			
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектKARTOCHKA_KAP_VL);
		КонецЦикла;
		
	КонецЕсли;   
	
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("KAP_VL_OS_NMA_NPA", ПараметрыВыполнения);
	
	Пока Выборка.Следующий() Цикл  
		ОбъектKAP_VL_OS_NMA_NPA = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "KAP_VL_OS_NMA_NPA"));         
		
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитовКапВложений, Выборка);  
		СтруктураРеквизитовКапВложений.GUID = XMLСтрока(Выборка.GUID);           
		пЗаполнитьЗначенияСвойств(ОбъектKAP_VL_OS_NMA_NPA, СтруктураРеквизитовКапВложений);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитовКапВложений, "KAP_VL_OS_NMA_NPA", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		
		ОбъектKAP_VL_OS_NMA_NPA.ID =  Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("KAP_VL_OS_NMA_NPA_" + ОбъектKAP_VL_OS_NMA_NPA.GUID, ОбъектKAP_VL_OS_NMA_NPA.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		
		
		Если СтруктураРеквизитовКапВложений.Свойство("KARTOCHKA_KAP_VL") Тогда	
			ИД_Карточки = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("KARTOCHKA_KAP_VL_" + ОбъектKAP_VL_OS_NMA_NPA.GUID);
			ОбъектKAP_VL_OS_NMA_NPA.KARTOCHKA_KAP_VL = ?(ЗначениеЗаполнено(ИД_Карточки), ИД_Карточки, "");
		КонецЕсли;
		                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектKAP_VL_OS_NMA_NPA);	
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_KAP_VL_OS_NMA_NPA; УНИЧТОЖИТЬ ВТАналитикиKAP_VL_OS_NMA_NPA_; УНИЧТОЖИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет; УНИЧТОЖИТЬ ВТРасчетАмортизацииОС; 
	|УНИЧТОЖИТЬ ВТСведенияКадастровогоУчета; УНИЧТОЖИТЬ ВТ_СобытияОССрез; УНИЧТОЖИТЬ ВТ_СобытияОС; УНИЧТОЖИТЬ ВТ_ИнвНомера; УНИЧТОЖИТЬ ВТКарточкиКапВложений"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры      

Процедура VID_ZATRAT(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_ZATRAT(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат), "VID_ZATRAT",,ПараметрыВыполнения);      
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыЗатрат.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВидыЗатрат.Ссылка) КАК GUID,
	|	ВЫРАЗИТЬ(ВидыЗатрат.Наименование КАК Строка(90)) КАК NAME
	|ИЗ
	|	ВТАналитики_VID_ZATRAT КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗатрат КАК ВидыЗатрат
	|		ПО ВТАналитики.Аналитика = ВидыЗатрат.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Выборка				= Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("VID_ZATRAT", ПараметрыВыполнения);
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("VID_ZATRAT", ПараметрыВыполнения);
	
	Пока Выборка.Следующий() Цикл  
		ОбъектVID_ZATRAT = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "VID_ZATRAT")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);                                    
		
		пЗаполнитьЗначенияСвойств(ОбъектVID_ZATRAT, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "VID_ZATRAT", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		ОбъектVID_ZATRAT.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_ZATRAT_" + ОбъектVID_ZATRAT.GUID, ОбъектVID_ZATRAT.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;		               
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектVID_ZATRAT);
	КонецЦикла; 
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_ZATRAT"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры  

Процедура KAP_VL_MZ(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.KAP_VL_MZ(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура), "KAP_VL_MZ",,ПараметрыВыполнения);		
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Номенклатура.Ссылка) КАК GUID,
	|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(300)) КАК NAME,
	|	Номенклатура.НоменклатурныйНомер КАК NUM_INOY,
	|	Номенклатура.ОКП КАК KOD_OKPD2
	|ИЗ
	|	ВТАналитики_KAP_VL_MZ КАК ВТАналитики_KAP_VL_MZ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТАналитики_KAP_VL_MZ.Аналитика = Номенклатура.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("KAP_VL_MZ", ПараметрыВыполнения);
	
	Выборка 			= Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("KAP_VL_MZ", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		ОбъектKAP_VL_MZ = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "KAP_VL_MZ"));         
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);         		
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);           
		
		пЗаполнитьЗначенияСвойств(ОбъектKAP_VL_MZ, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "KAP_VL_MZ", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		ОбъектKAP_VL_MZ.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("KAP_VL_MZ_" + ОбъектKAP_VL_MZ.GUID, ОбъектKAP_VL_MZ.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		               
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектKAP_VL_MZ);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_KAP_VL_MZ"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры      

Процедура GRAF_AMORT(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.GRAF_AMORT(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикиНаборомВсехСубконтоВМенеджерВТ(МенеджерВТ, "GRAF_AMORT");      
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства), "OS_NMA_NPA_ARENDA",,ПараметрыВыполнения);  
	
	#Область ТекстЗапроса
	
	Запрос = Новый Запрос(		
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_GRAF_AMORT.Субконто1) = ТИП(Справочник.Договоры)
	|			ТОГДА ВТАналитики_GRAF_AMORT.Субконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_GRAF_AMORT.Субконто2) = ТИП(Справочник.Договоры)
	|			ТОГДА ВТАналитики_GRAF_AMORT.Субконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_GRAF_AMORT.Субконто3) = ТИП(Справочник.Договоры)
	|			ТОГДА ВТАналитики_GRAF_AMORT.Субконто3
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_GRAF_AMORT.Субконто1) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА ВТАналитики_GRAF_AMORT.Субконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_GRAF_AMORT.Субконто2) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА ВТАналитики_GRAF_AMORT.Субконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_GRAF_AMORT.Субконто3) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА ВТАналитики_GRAF_AMORT.Субконто3
	|	КОНЕЦ КАК ОС
	|ПОМЕСТИТЬ ВТ_GRAF_AMORT_
	|ИЗ
	|	ВТАналитики_GRAF_AMORT КАК ВТАналитики_GRAF_AMORT
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор,
	|	ОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТАналитики_OS_NMA_NPA_ARENDA.Аналитика КАК Аналитика,
	|	ЕСТЬNULL(ИнвентарныеНомераОС.Ссылка, ВТАналитики_OS_NMA_NPA_ARENDA.Аналитика) КАК Ссылка
	|ПОМЕСТИТЬ ВТ_АналитикиСвязи
	|ИЗ
	|	ВТАналитики_OS_NMA_NPA_ARENDA КАК ВТАналитики_OS_NMA_NPA_ARENDA
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ПО (НЕ ИнвентарныеНомераОС.ПометкаУдаления)
	|			И ВТАналитики_OS_NMA_NPA_ARENDA.Аналитика = ИнвентарныеНомераОС.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Аналитика,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_GRAF_AMORT_.Договор КАК Договор,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТ_GRAF_AMORT_.Договор) КАК GUID, 
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТ_АналитикиСвязи.Ссылка) КАК GUIDОС,
	|	ВТ_АналитикиСвязи.Ссылка КАК ОС,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Договоры.Контрагент) КАК GUIDКонтрагент,
	|	Договоры.Контрагент КАК Контрагент
	|ИЗ
	|	ВТ_GRAF_AMORT_ КАК ВТ_GRAF_AMORT_
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АналитикиСвязи КАК ВТ_АналитикиСвязи
	|		ПО (ВТ_GRAF_AMORT_.ОС = ВТ_АналитикиСвязи.Аналитика)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО (ВТ_GRAF_AMORT_.Договор = Договоры.Ссылка)
	|ИТОГИ ПО
	|	GUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ГрафикАмортизацииПравПользованияОСОбороты.Договор КАК Договор,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ГрафикАмортизацииПравПользованияОСОбороты.Договор) КАК GUID, 
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТ_АналитикиСвязи.Ссылка) КАК GUIDОсновноеСредство,
	|	ВТ_АналитикиСвязи.Ссылка КАК ОсновноеСредство,
	|	ГрафикАмортизацииПравПользованияОСОбороты.ДатаНачисленияАмортизации КАК DATE,
	|	ГрафикАмортизацииПравПользованияОСОбороты.АмортизацияОборот КАК SUMMA
	|ИЗ
	|	РегистрНакопления.ГрафикАмортизацииПравПользованияОС.Обороты(
	|			,
	|			,
	|			Запись,
	|			(Договор, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВТ_GRAF_AMORT_.Договор КАК Договор,
	|					ВТ_GRAF_AMORT_.ОС КАК ОС
	|				ИЗ
	|					ВТ_GRAF_AMORT_ КАК ВТ_GRAF_AMORT_)) КАК ГрафикАмортизацииПравПользованияОСОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АналитикиСвязи КАК ВТ_АналитикиСвязи
	|		ПО (ГрафикАмортизацииПравПользованияОСОбороты.ОсновноеСредство = ВТ_АналитикиСвязи.Аналитика)
	|ИТОГИ ПО
	|	GUID");
	
	#КонецОбласти	
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;  
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка 				= Пакет[Пакет.Количество() - 2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаГрафика			= Пакет[Пакет.Количество() - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СоответствиеСтрокаОС = Неопределено;
	
	СтруктураРеквизитовГрафика = СтруктураРеквизитовАналитики("GRAF_AMORT", ПараметрыВыполнения); 
	Если СтруктураРеквизитовГрафика.Свойство("GRAF_AMORT_OS") Тогда                               
		СоответствиеСтрокаОС = Новый Соответствие;
		Пока Выборка.Следующий() Цикл 
			ОбъектGRAFIK_OS = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "GRAF_AMORT_OS"));   
			ОбъектGRAFIK_OS.OWNER = XMLСтрока(Выборка.GUID);
			ОбъектGRAFIK_OS.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
			ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("GRAF_AMORT_OS" + ОбъектGRAFIK_OS.OWNER, ОбъектGRAFIK_OS.ID);
			ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
			п_НН = 1;      
			ДанныеСтроки = Новый Структура("OS, KONTRAGENT");
			ВыборкаОС = Выборка.Выбрать();
			Пока ВыборкаОС.Следующий() Цикл
				новСтрока = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "GRAF_AMORT_OS").Свойства.Получить("ROW").Тип);
				новСтрока.ROWNUM = п_НН;
				ИД_ОС = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("OS_NMA_NPA_ARENDA_" + XMLСтрока(ВыборкаОС.GUIDОС));
				ДанныеСтроки.OS = ?(ЗначениеЗаполнено(ИД_ОС), ИД_ОС, "");
				ИД_КОНТРАГЕНТ = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("KONTRAGENT_" + XMLСтрока(ВыборкаОС.GUIDКонтрагент));
				ДанныеСтроки.KONTRAGENT = ?(ЗначениеЗаполнено(ИД_КОНТРАГЕНТ), ИД_КОНТРАГЕНТ, "");
				ЗаполнитьЗначенияСвойств(новСтрока, ДанныеСтроки);
				СоответствиеСтрокаОС.Вставить(ОбъектGRAFIK_OS.OWNER + "_" + XMLСтрока(ВыборкаОС.GUIDОС), п_НН);
				п_НН = п_НН + 1;
				ОбъектGRAFIK_OS.ROW.Добавить(новСтрока);   
			КонецЦикла;
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектGRAFIK_OS);
		КонецЦикла;
	КонецЕсли;
	
	Если СтруктураРеквизитовГрафика.Свойство("GRAFIK_AMORT_DETAIL") Тогда
		СтруктураРеквизитов = СтруктураРеквизитовАналитики("GRAFIK_AMORT_DETAIL", ПараметрыВыполнения);
		Пока ВыборкаГрафика.Следующий() Цикл  
			
			ОбъектGRAFIK = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "GRAFIK_AMORT_DETAIL"));   
			ОбъектGRAFIK.OWNER = XMLСтрока(ВыборкаГрафика.GUID);
			ОбъектGRAFIK.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
			ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("GRAFIK_AMORT_DETAIL_" + ОбъектGRAFIK.OWNER, ОбъектGRAFIK.ID);
			ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
			п_НН = 1;  
			ВыборкаГрафикаДетали = ВыборкаГрафика.Выбрать();
			Пока ВыборкаГрафикаДетали.Следующий() Цикл 
				новСтрока = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "GRAFIK_AMORT_DETAIL").Свойства.Получить("ROW").Тип);
				ЗаполнитьЗначенияСвойств(новСтрока, ВыборкаГрафикаДетали);
				новСтрока.ROWNUM = п_НН;
				п_НН = п_НН + 1;
				Если Не СоответствиеСтрокаОС = Неопределено Тогда
					СтрокаОС = СоответствиеСтрокаОС.Получить(ОбъектGRAFIK.OWNER + "_" + XMLСтрока(ВыборкаГрафикаДетали.GUIDОсновноеСредство));
					Если ЗначениеЗаполнено(СтрокаОС) Тогда
						новСтрока.OS_ROWNUM = Формат(СтрокаОС, "ЧГ=0");
					КонецЕсли;
				КонецЕсли;
				ОбъектGRAFIK.ROW.Добавить(новСтрока);   
			КонецЦикла;
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектGRAFIK);              			
		КонецЦикла;
	КонецЕсли;
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектGRAF_AMORT = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "GRAF_AMORT")); 
		ОбъектGRAF_AMORT.GUID = XMLСтрока(Выборка.GUID); 
		ОбъектGRAF_AMORT.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("GRAF_AMORT_" + ОбъектGRAF_AMORT.GUID, ОбъектGRAF_AMORT.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;	
		Если СтруктураРеквизитовГрафика.Свойство("GRAF_AMORT_OS") Тогда
			ИД_GRAF_AMORT_OS = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("GRAF_AMORT_OS" + ОбъектGRAF_AMORT.GUID);
			ОбъектGRAF_AMORT.GRAF_AMORT_OS = ?(ЗначениеЗаполнено(ИД_GRAF_AMORT_OS), ИД_GRAF_AMORT_OS, "");
		КонецЕсли;
		
		Если СтруктураРеквизитовГрафика.Свойство("GRAFIK_AMORT_DETAIL") Тогда
			ИД_Графика = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("GRAFIK_AMORT_DETAIL_" + XMLСтрока(Выборка.GUID));
			ОбъектGRAF_AMORT.GRAFIK_AMORT_DETAIL = ?(ЗначениеЗаполнено(ИД_Графика), ИД_Графика, "");
		КонецЕсли;
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектGRAF_AMORT);                  		
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_GRAF_AMORT; УНИЧТОЖИТЬ ВТ_GRAF_AMORT_"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры  

Процедура SCHET(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.SCHET(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЛицевыеСчета);
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.РазделыЛицевыхСчетов);
	
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МассивСубконто, "SCHET",,ПараметрыВыполнения); 
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЛицевыеСчета.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЛицевыеСчета.Ссылка) КАК GUID,
	|	ЛицевыеСчета.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЛицевыеСчета.ТипЛицевогоСчета = ЗНАЧЕНИЕ(Перечисление.ТипыЛицевыхСчетов.Казначейский)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ КАК VID_SCHET,
	|	ВЫРАЗИТЬ(ЛицевыеСчета.Код КАК СТРОКА(11)) КАК NUM_LIC_SCHET,
	|	ВЫРАЗИТЬ(ЛицевыеСчета.Код КАК СТРОКА(20)) КАК NUM_BANK_SCHET,
	|	ЕСТЬNULL(РеквизитыЛицевыхСчетов.БанкДляРасчетов.Код, Банки.Код) КАК BIK
	|ИЗ
	|	ВТАналитики_SCHET КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеИКазначейскиеСчета КАК БанковскиеИКазначейскиеСчета
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|					ПО БанковскиеИКазначейскиеСчета.КассовыйОрган = Банки.Ссылка
	|				ПО РеквизитыЛицевыхСчетов.СчетКазначейства = БанковскиеИКазначейскиеСчета.Ссылка
	|			ПО ЛицевыеСчета.Ссылка = РеквизитыЛицевыхСчетов.Владелец
	|		ПО ВТАналитики.Аналитика = ЛицевыеСчета.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РазделыЛицевыхСчетов.Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(РазделыЛицевыхСчетов.Ссылка),
	|	РазделыЛицевыхСчетов.Наименование,
	|	ВЫБОР
	|		КОГДА ЛицевыеСчета.ТипЛицевогоСчета = ЗНАЧЕНИЕ(Перечисление.ТипыЛицевыхСчетов.Казначейский)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ,
	|	ВЫРАЗИТЬ(ЛицевыеСчета.Код КАК СТРОКА(11)),
	|	ВЫРАЗИТЬ(ЛицевыеСчета.Код КАК СТРОКА(20)),
	|	ЕСТЬNULL(РеквизитыЛицевыхСчетов.БанкДляРасчетов.Код, Банки.Код)
	|ИЗ
	|	ВТАналитики_SCHET КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РазделыЛицевыхСчетов КАК РазделыЛицевыхСчетов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеИКазначейскиеСчета КАК БанковскиеИКазначейскиеСчета
	|						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|						ПО БанковскиеИКазначейскиеСчета.КассовыйОрган = Банки.Ссылка
	|					ПО РеквизитыЛицевыхСчетов.СчетКазначейства = БанковскиеИКазначейскиеСчета.Ссылка
	|				ПО ЛицевыеСчета.Ссылка = РеквизитыЛицевыхСчетов.Владелец
	|			ПО РазделыЛицевыхСчетов.Владелец = ЛицевыеСчета.Ссылка
	|		ПО ВТАналитики.Аналитика = РазделыЛицевыхСчетов.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Выборка 				= Запрос.Выполнить().Выбрать();
	
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("SCHET", ПараметрыВыполнения);
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("SCHET", ПараметрыВыполнения); 
	
	Пока Выборка.Следующий() Цикл  
		
		ОбъектSCHET = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "SCHET")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);         
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);                                    
		
		пЗаполнитьЗначенияСвойств(ОбъектSCHET, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "SCHET", Строка(Выборка.Наименование), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;                                      	
		
		ОбъектSCHET.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("SCHET_" + ОбъектSCHET.GUID, ОбъектSCHET.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;	
		               
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектSCHET);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_SCHET"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры  

Процедура VID_DEN_DOC(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_DEN_DOC(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ВидыДенежныхДокументов), "VID_DEN_DOC",,ПараметрыВыполнения);      
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыДенежныхДокументов.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВидыДенежныхДокументов.Ссылка) КАК GUID,
	|	ВидыДенежныхДокументов.Наименование КАК NAME
	|ИЗ
	|	ВТАналитики_VID_DEN_DOC КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДенежныхДокументов КАК ВидыДенежныхДокументов
	|		ПО ВТАналитики.Аналитика = ВидыДенежныхДокументов.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("VID_DEN_DOC", ПараметрыВыполнения);
	
	Выборка 				= Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("VID_DEN_DOC", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		ОбъектVID_DEN_DOC = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "VID_DEN_DOC")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка); 
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);                                    
		
		пЗаполнитьЗначенияСвойств(ОбъектVID_DEN_DOC, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "VID_DEN_DOC", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		ОбъектVID_DEN_DOC.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_DEN_DOC_" + ОбъектVID_DEN_DOC.GUID, ОбъектVID_DEN_DOC.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;		                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектVID_DEN_DOC);
	КонецЦикла;       
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_DEN_DOC"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры  

Процедура OBJ_FIN_VL(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.OBJ_FIN_VL(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	СпецАналитикиНаборомВМенеджерВТ(МенеджерВТ, "OBJ_FIN_VL");      	
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОбъектыФинансовыхВложений.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОбъектыФинансовыхВложений.Ссылка) КАК GUID,
	|	ОбъектыФинансовыхВложений.Наименование КАК NAME,
	|	ВЫБОР
	|		КОГДА ОбъектыФинансовыхВложений.ВидВложения = ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхВложений.ЦенныеБумаги)
	|			ТОГДА ""1""
	|		КОГДА ОбъектыФинансовыхВложений.ВидВложения = ЗНАЧЕНИЕ(Перечисление.ВидыФинансовыхВложений.УчастиеВКапитале)
	|			ТОГДА ""2""
	|		ИНАЧЕ ""3""
	|	КОНЕЦ КАК VID_VL,
	|	ВЫБОР
	|		КОГДА ОбъектыФинансовыхВложений.ВидЦеннойБумаги = ЗНАЧЕНИЕ(Перечисление.ВидыЦенныхБумаг.Облигация)
	|			ТОГДА ""1""
	|		КОГДА ОбъектыФинансовыхВложений.ВидЦеннойБумаги = ЗНАЧЕНИЕ(Перечисление.ВидыЦенныхБумаг.Вексель)
	|			ТОГДА ""2""
	|		ИНАЧЕ ""3""
	|	КОНЕЦ КАК VID_CENN_BUM,
	|	ВЫБОР
	|		КОГДА ОбъектыФинансовыхВложений.ФормаУчастияВКапитале = ЗНАЧЕНИЕ(Перечисление.ФормыУчастияВКапитале.Акции)
	|			ТОГДА ""1""
	|		КОГДА ОбъектыФинансовыхВложений.ФормаУчастияВКапитале = ЗНАЧЕНИЕ(Перечисление.ФормыУчастияВКапитале.Вклады)
	|			ТОГДА ""2""
	|		ИНАЧЕ ""3""
	|	КОНЕЦ КАК FORMA_UCH_CAP,
	|	ВЫБОР
	|		КОГДА ОбъектыФинансовыхВложений.Документарные
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК DOKUMENTAR,
	|	ОбъектыФинансовыхВложений.РНФИ КАК NUM_REESTR,
	|	ОбъектыФинансовыхВложений.РегистрационныйНомер КАК REG_NOM,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОбъектыФинансовыхВложений.Контрагент) КАК GUIDКонтрагент,
	|	ОбъектыФинансовыхВложений.Контрагент КАК Контрагент
	|ИЗ
	|	ВТАналитики_OBJ_FIN_VL КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыФинансовыхВложений КАК ОбъектыФинансовыхВложений
	|		ПО ВТАналитики.Аналитика = ОбъектыФинансовыхВложений.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("OBJ_FIN_VL", ПараметрыВыполнения);
	
	Выборка 				= Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("OBJ_FIN_VL", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		ОбъектOBJ_FIN_VL = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "OBJ_FIN_VL")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка); 
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);    
		
		пЗаполнитьЗначенияСвойств(ОбъектOBJ_FIN_VL, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "OBJ_FIN_VL", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;		
		
		ОбъектOBJ_FIN_VL.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("OBJ_FIN_VL_" + ОбъектOBJ_FIN_VL.GUID, ОбъектOBJ_FIN_VL.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;	
		Если СтруктураРеквизитов.Свойство("KONTRAGENT") Тогда
			ИД_Контрагента = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("KONTRAGENT_" + XMLСтрока(Выборка.GUIDКонтрагент));
			ОбъектOBJ_FIN_VL.KONTRAGENT = ?(ЗначениеЗаполнено(ИД_Контрагента), ИД_Контрагента, "");
		КонецЕсли;
		                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектOBJ_FIN_VL);
	КонецЦикла;    
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_OBJ_FIN_VL"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры  

Процедура GRAF_ISP(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.GRAF_ISP(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьАналитикиГрафикИсполнения(МенеджерВТ, ПараметрыВыполнения.ОкончаниеПериода); 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВТАналитики.Договор КАК Договор,
	|	Договоры.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
	|	Договоры.ВестиПланГрафикИсполнения КАК ВестиПланГрафикИсполнения,
	|	ВТАналитики.Контрагент КАК Контрагент,
	|	ВТАналитики.СчетРасчетов КАК СчетРасчетов,
	|	ВТАналитики.КФО КАК КФО, 
	|	ВТАналитики.КПС КАК КПС,
	|	ВТАналитики.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТАналитики_GRAF_ISP_Предварительно
	|ИЗ
	|	ВТАналитики_GRAF_ISP КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВТАналитики.Договор = Договоры.Ссылка
	|		И ВТАналитики.Контрагент = Договоры.Контрагент
	|
	|ГДЕ
	|	ВТАналитики.СуммаОстаток <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТАналитики.Договор КАК Договор,
	|	ВТАналитики.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
	|	ВТАналитики.ВестиПланГрафикИсполнения КАК ВестиПланГрафикИсполнения,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики.Договор) КАК GUID,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики.Контрагент) КАК GUIDКонтрагент,
	|	ВТАналитики.Контрагент КАК Контрагент,
	|	ВТАналитики.СчетРасчетов КАК СчетРасчетов,
	|	ВТАналитики.КФО КАК КФО,
	|	СУММА(ВЫБОР
	|		КОГДА ВТАналитики.СуммаОстаток > 0
	|			ТОГДА ВТАналитики.СуммаОстаток
	|		ИНАЧЕ -ВТАналитики.СуммаОстаток
	|	КОНЕЦ) КАК СуммаОстаток
	|ИЗ
	|	ВТАналитики_GRAF_ISP_Предварительно КАК ВТАналитики
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТАналитики.Договор,
	|	ВТАналитики.ВестиГрафикПлатежей,
	|	ВТАналитики.ВестиПланГрафикИсполнения, 
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики.Договор),
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики.Контрагент),
	|	ВТАналитики.Контрагент, 
	|	ВТАналитики.СчетРасчетов,
	|	ВТАналитики.КФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТАналитики.Договор КАК Договор,
	|	ВТАналитики.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
	|	ВТАналитики.ВестиПланГрафикИсполнения КАК ВестиПланГрафикИсполнения,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики.Договор) КАК GUID,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики.Контрагент) КАК GUIDКонтрагент,
	|	ВТАналитики.Контрагент КАК Контрагент,
	|	ВТАналитики.СчетРасчетов КАК СчетРасчетов,
	|	ВТАналитики.КФО КАК КФО,
	|	ВТАналитики.КПС КАК КПС,
	|	СУММА(ВЫБОР
	|		КОГДА ВТАналитики.СуммаОстаток > 0
	|			ТОГДА ВТАналитики.СуммаОстаток
	|		ИНАЧЕ -ВТАналитики.СуммаОстаток
	|	КОНЕЦ) КАК СуммаОстаток
	|ИЗ
	|	ВТАналитики_GRAF_ISP_Предварительно КАК ВТАналитики
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТАналитики.Договор,
	|	ВТАналитики.ВестиГрафикПлатежей,
	|	ВТАналитики.ВестиПланГрафикИсполнения, 
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики.Договор),
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики.Контрагент),
	|	ВТАналитики.Контрагент, 
	|	ВТАналитики.СчетРасчетов,
	|	ВТАналитики.КФО,
	|	ВТАналитики.КПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТАналитики_GRAF_ISP
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТАналитики_GRAF_ISP_Предварительно");
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаОтбор = Результат[Результат.Количество()-4].Выгрузить(); 
	ТаблицаОтборКПС = Результат[Результат.Количество()-3].Выгрузить();
	Результат = Неопределено;
	
	ЗаписьСобытияВЖурналРегистрации(СтрШаблон(НСтр("ru = 'Получение данных для формирования графика исполнения обязательств (%1 строк договоров). Начало'"), Строка(ТаблицаОтбор.Количество())));
	
	ЗапросГрафика = Новый Запрос("ВЫБРАТЬ
	                             |	Таблица.Договор КАК Договор, 
	                             |	Таблица.Контрагент КАК Контрагент,
	                             |	Таблица.ВидРасчетов КАК ВидРасчетов,
								 |	Таблица.ВидЗадолженности КАК ВидЗадолженности,
	                             |	Таблица.СчетРасчетов КАК СчетРасчетов,
	                             |	Таблица.КПС КАК КПС,
	                             |	Таблица.КФО КАК КФО,
	                             |	Таблица.СрокИсполнения КАК СрокИсполнения,
	                             |	Таблица.Остаток КАК Остаток
	                             |ПОМЕСТИТЬ ВТ
	                             |ИЗ
	                             |	&Таблица КАК Таблица
	                             |;
	                             |
	                             |////////////////////////////////////////////////////////////////////////////////
	                             |ВЫБРАТЬ
	                             |	ВТ.Договор КАК Договор,
	                             |	ВТ.Контрагент КАК Контрагент,
	                             |	ВТ.ВидРасчетов КАК ВидРасчетов,
								 |	ВТ.ВидЗадолженности КАК ВидЗадолженности,
	                             |	ВТ.СчетРасчетов КАК СчетРасчетов,
	                             |	ЕСТЬNULL(КлассификационныеПризнакиСчетов.Код,"""") КАК КПС,
	                             |	ВТ.КПС КАК КПССсылка,
	                             |	ВТ.КФО КАК КФО,
	                             |	ВТ.Остаток КАК Сумма,
	                             |	ВТ.СрокИсполнения КАК Дата
	                             |ИЗ
	                             |	ВТ КАК ВТ
	                             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификационныеПризнакиСчетов КАК КлассификационныеПризнакиСчетов
	                             |		ПО ВТ.КПС = КлассификационныеПризнакиСчетов.Ссылка
	            	             |ГДЕ
	                             |	ВТ.Остаток <> 0
								 |
								 |УПОРЯДОЧИТЬ ПО
	                             |	Дата");
	
	МодульКонтрольИсполненияДоговоров = ОбщегоНазначения.ОбщийМодуль("КонтрольИсполненияДоговоров");
	
	СтандартнаяОбработка = Истина;
	Таблица = Неопределено; 

	МодульСбораДанныхПереопределяемый.КонтрольИсполненияДоговоровГрафик(Таблица, ТаблицаОтбор, ПараметрыВыполнения, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		Таблица = МодульКонтрольИсполненияДоговоров.АнализЗадолженности(ПараметрыВыполнения.Организация,
		ПараметрыВыполнения.ОкончаниеПериода,
		ТаблицаОтбор);
	КонецЕсли;
	
	ЗапросГрафика.УстановитьПараметр("Таблица", Таблица);
	ТаблицаГрафика = ЗапросГрафика.Выполнить().Выгрузить();
	ТаблицаГрафика.Индексы.Добавить("Договор"); 
	Таблица = Неопределено;

	
	ТаблицаИдентификаторовGRAF_ISP = Новый ТаблицаЗначений;
	
	ТаблицаИдентификаторовGRAF_ISP.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаИдентификаторовGRAF_ISP.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.Договоры")); 
	ТаблицаИдентификаторовGRAF_ISP.Колонки.Добавить("КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД")); 
	ТаблицаИдентификаторовGRAF_ISP.Колонки.Добавить("УИ_GRAF_ISP", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТаблицаИдентификаторовGRAF_ISP.Индексы.Добавить("УИ_GRAF_ISP");

	СписокДоговоров = ТаблицаОтбор.ВыгрузитьКолонку("Договор");

	Если ПолучитьФункциональнуюОпцию("СрокИсполненияВРегистреСрокиИсполненияИСуммыОбязательств") Тогда
		МодульУчетРасчетов = ОбщегоНазначения.ОбщийМодуль("УчетРасчетов");
	    СвойстваДоговоров = МодульУчетРасчетов.СрокиИсполненияИСуммыОбязательствПоДоговорам(СписокДоговоров, ПараметрыВыполнения.ОкончаниеПериода);
	Иначе // Дата исполнения указывается в справочнике "Договоры" в реквизите "Окончание" (закладка "Свойства").
		МодульИнвентаризацияСервер = ОбщегоНазначения.ОбщийМодуль("ИнвентаризацияСервер");
		СвойстваДоговоров = МодульИнвентаризацияСервер.ПолучитьДатыОкончанияДоговоров(СписокДоговоров);
	КонецЕсли;
	
	СоответсвиеКодВидаСчета = ПолучитьСоответсвиеКодВидаСчета();
	
	МодульБухгалтерскийУчет = ОбщегоНазначения.ОбщийМодуль("БухгалтерскийУчет");
	ЗаписьСобытияВЖурналРегистрации(СтрШаблон(НСтр("ru = 'Получение данных для формирования графика исполнения обязательств (%1 записей для %2 договоров). Конец'"), Строка(ТаблицаГрафика.Количество()), Строка(ТаблицаОтбор.Количество())));
	СтруктураРеквизитовГрафика = СтруктураРеквизитовАналитики("GRAF_ISP", ПараметрыВыполнения);
	Если СтруктураРеквизитовГрафика.Свойство("GRAFIK_ISP_DETAIL") Тогда
		СтруктураРеквизитов = СтруктураРеквизитовАналитики("GRAFIK_ISP_DETAIL", ПараметрыВыполнения);
		Для каждого Выборка Из ТаблицаОтбор Цикл 
			ОтборДетали = Новый Структура;
			ОтборДетали.Вставить("Договор", Выборка.Договор);
			ОтборДетали.Вставить("Контрагент", Выборка.Контрагент);
			
			МассивСчет = СтрРазделить(Выборка.СчетРасчетов, ".", Истина);			
			КодАналитическогоСубсчета = ?(МассивСчет.Количество() > 1, МассивСчет[1], "");
			Если МассивСчет[0] = "206" Тогда
				СчетРасчетов = "302" + ?(МассивСчет.Количество() > 1, "." + КодАналитическогоСубсчета, "");
				СчетРасчетовСсылка = МодульБухгалтерскийУчет.СчетПоКоду(СчетРасчетов, ПараметрыВыполнения.ОкончаниеПериода); 
				ОтборДетали.Вставить("СчетРасчетов", СчетРасчетовСсылка);
				ОтборДетали.Вставить("ВидЗадолженности", Перечисления.ВидыЗадолженности.Дебиторская);
			ИначеЕсли МассивСчет[0] = "302" Тогда
				ОтборДетали.Вставить("СчетРасчетов", Выборка.СчетРасчетов);
				ОтборДетали.Вставить("ВидЗадолженности", Перечисления.ВидыЗадолженности.Кредиторская);
			Иначе
				ОтборДетали.Вставить("СчетРасчетов", Выборка.СчетРасчетов);
			КонецЕсли;

			ОтборДетали.Вставить("КФО", Выборка.КФО);
			
			ОбъектGRAFIK = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "GRAFIK_ISP_DETAIL"));			
			GUID_GRAFIK = ПолучитьGUIDГрафикаИсполнения(Выборка, СоответсвиеКодВидаСчета);
			СтрокиGUID_GRAFIK = ТаблицаИдентификаторовGRAF_ISP.НайтиСтроки(Новый Структура("УИ_GRAF_ISP", GUID_GRAFIK)); 
			Если НЕ СтрокиGUID_GRAFIK.Количество() Тогда
				НовСтрокаGUID_GRAFIK = ТаблицаИдентификаторовGRAF_ISP.Добавить();
				НовСтрокаGUID_GRAFIK.Счет = Выборка.СчетРасчетов;
				НовСтрокаGUID_GRAFIK.Договор = Выборка.Договор;
				НовСтрокаGUID_GRAFIK.КФО = Выборка.КФО;
				НовСтрокаGUID_GRAFIK.УИ_GRAF_ISP = GUID_GRAFIK;	
			КонецЕсли; 
		
			ОбъектGRAFIK.OWNER = GUID_GRAFIK;
			ОбъектGRAFIK.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");
			ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("GRAFIK_ISP_DETAIL_" + ОбъектGRAFIK.OWNER, ОбъектGRAFIK.ID);
			ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
			п_НН = 1;
			
			ТаблицаГрафики = Новый ТаблицаЗначений;
			ТаблицаГрафики.Колонки.Добавить("ROWNUM"); 
			ТаблицаГрафики.Колонки.Добавить("DATE");
            ТаблицаГрафики.Колонки.Добавить("SUMMA");
			ТаблицаГрафики.Колонки.Добавить("KPS");
            ТаблицаГрафики.Колонки.Добавить("KOD_VID_RASCH_Z_KR");
			
			п_Детали = ТаблицаГрафика.НайтиСтроки(ОтборДетали);
			Если Не п_Детали.Количество() = 0  Тогда
				СуммаОстатокПоУчету = Выборка.СуммаОстаток;
				СуммаОстатокПоГрафику = 0;
				Для Каждого ВыборкаГрафикаДетали Из п_Детали Цикл
					СуммаОстатокПоГрафику = СуммаОстатокПоГрафику + ВыборкаГрафикаДетали.Сумма;	
				КонецЦикла;
				РазницаОстатки = СуммаОстатокПоУчету - СуммаОстатокПоГрафику;
							
				Для Каждого ВыборкаГрафикаДетали Из п_Детали Цикл 
					
					Сумма = ВыборкаГрафикаДетали.Сумма;
					Если РазницаОстатки < 0 Тогда
						КОтражению = Мин(СуммаОстатокПоУчету, ВыборкаГрафикаДетали.Сумма);
						Сумма	   = КОтражению;		
						СуммаОстатокПоУчету = СуммаОстатокПоУчету - КОтражению;	
					КонецЕсли;
					
					СрокИсполнения = ?(ТипЗнч(ВыборкаГрафикаДетали.Дата) = Тип("Дата"), ВыборкаГрафикаДетали.Дата, Дата(1,1,1));
					Если Не ЗначениеЗаполнено(СрокИсполнения) Тогда
						СрокИсполнения = ПолучитьСрокИсполнения(СвойстваДоговоров, Выборка, ПараметрыВыполнения);
						СтрокиДатаНеопределена = ТаблицаГрафики.НайтиСтроки(Новый Структура("DATE", СрокИсполнения));
						Если Не СтрокиДатаНеопределена.Количество() = 0 Тогда
							новСтрока = СтрокиДатаНеопределена[0];
							новСтрока.SUMMA = новСтрока.SUMMA + Сумма;
							Если СуммаОстатокПоУчету = 0 Тогда
								Прервать;
							Иначе
								Продолжить;
							КонецЕсли;
						КонецЕсли;	
					КонецЕсли;
					
					новСтрока =  ТаблицаГрафики.Добавить();
					новСтрока.ROWNUM 	= п_НН; 
					новСтрока.DATE 		= СрокИсполнения;
					новСтрока.SUMMA		= Сумма;
					новСтрока.KPS		= ВыборкаГрафикаДетали.КПС;
					новСтрока.KOD_VID_RASCH_Z_KR = f_VID_RACH_ZAIM_KR(Неопределено, Новый Структура("Субконто1, Субконто2, Субконто3", ВыборкаГрафикаДетали.ВидРасчетов), "");
					Если СуммаОстатокПоУчету = 0 Тогда
						Прервать;
					КонецЕсли;	
					п_НН = п_НН + 1;
					
				КонецЦикла;
				Если РазницаОстатки > 0 Тогда
					СрокИсполнения = ПолучитьСрокИсполнения(СвойстваДоговоров, Выборка, ПараметрыВыполнения);			
					СтрокиДатаНеопределена = ТаблицаГрафики.НайтиСтроки(Новый Структура("DATE", СрокИсполнения));
					Если СтрокиДатаНеопределена.Количество() = 0 Тогда  
						новСтрока =   ТаблицаГрафики.Добавить();
						новСтрока.ROWNUM 	= п_НН; 
						новСтрока.DATE 		= СрокИсполнения;
						новСтрока.SUMMA		= РазницаОстатки;
						новСтрока.KPS		= ВыборкаГрафикаДетали.КПС;
						новСтрока.KOD_VID_RASCH_Z_KR = "1";
					Иначе	
						новСтрока = СтрокиДатаНеопределена[0];
						новСтрока.SUMMA = новСтрока.SUMMA + РазницаОстатки;
					КонецЕсли;								
				КонецЕсли;  
			Иначе
				ОкончаниеДоговора = ПолучитьСрокИсполнения(СвойстваДоговоров, Выборка, ПараметрыВыполнения);

				ОтборДетали = Новый Структура;
				ОтборДетали.Вставить("Договор", Выборка.Договор);
				ОтборДетали.Вставить("Контрагент", Выборка.Контрагент);
				ОтборДетали.Вставить("СчетРасчетов", Выборка.СчетРасчетов);
				ОтборДетали.Вставить("КФО", Выборка.КФО);
				
				п_Детали = ТаблицаОтборКПС.НайтиСтроки(ОтборДетали);
										
				Для Каждого ВыборкаГрафикаДетали Из п_Детали Цикл 			
					новСтрока =  ТаблицаГрафики.Добавить();
					новСтрока.ROWNUM 	= 1; 
					новСтрока.DATE 		= ОкончаниеДоговора;
					новСтрока.SUMMA		= ВыборкаГрафикаДетали.СуммаОстаток;
					новСтрока.KPS		= Строка(ВыборкаГрафикаДетали.КПС);
					новСтрока.KOD_VID_RASCH_Z_KR = "1";						
				КонецЦикла;	
			КонецЕсли; 
			
			Для каждого СтрокаТаблицаГрафик Из ТаблицаГрафики Цикл
				новСтрока = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "GRAFIK_ISP_DETAIL").Свойства.Получить("ROW").Тип);
				ЗаполнитьЗначенияСвойств(новСтрока, СтрокаТаблицаГрафик);
				ОбъектGRAFIK.ROW.Добавить(новСтрока);
			КонецЦикла;	
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектGRAFIK);
		КонецЦикла;
		
	КонецЕсли;
		
	Для каждого Выборка Из ТаблицаОтбор Цикл
		GUID_GRAFIK = ПолучитьGUIDГрафикаИсполнения(Выборка, СоответсвиеКодВидаСчета);			
		ИД_Графика = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("GRAFIK_ISP_DETAIL_" + GUID_GRAFIK);
		Если ЗначениеЗаполнено(ИД_Графика) Тогда
			ОбъектGRAF_ISP = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "GRAF_ISP"));
			ОбъектGRAF_ISP.GUID = GUID_GRAFIK; 
			ОбъектGRAF_ISP.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");
			ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("GRAF_ISP_" + ОбъектGRAF_ISP.GUID, ОбъектGRAF_ISP.ID);
			ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
			
			Если СтруктураРеквизитовГрафика.Свойство("KONTRAGENT") Тогда
				ИД_Контрагента = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("KONTRAGENT_" + XMLСтрока(Выборка.GUIDКонтрагент));
				ОбъектGRAF_ISP.KONTRAGENT = ?(ЗначениеЗаполнено(ИД_Контрагента), ИД_Контрагента, "");
			КонецЕсли;
			
			Если СтруктураРеквизитовГрафика.Свойство("GRAFIK_ISP_DETAIL") Тогда
				ИД_Графика = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("GRAFIK_ISP_DETAIL_" + ОбъектGRAF_ISP.GUID);
				ОбъектGRAF_ISP.GRAFIK_ISP_DETAIL = ?(ЗначениеЗаполнено(ИД_Графика), ИД_Графика, "");
			КонецЕсли;
			
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектGRAF_ISP);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	| ТаблицаИдентификаторовGRAF_ISP.Счет, 
	| ТаблицаИдентификаторовGRAF_ISP.Договор, 
	| ТаблицаИдентификаторовGRAF_ISP.КФО,
	| ТаблицаИдентификаторовGRAF_ISP.УИ_GRAF_ISP
	|ПОМЕСТИТЬ ВТ_ТаблицаИдентификаторовGRAF_ISP 
	|ИЗ 
	| &ТаблицаИдентификаторовGRAF_ISP КАК ТаблицаИдентификаторовGRAF_ISP");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("ТаблицаИдентификаторовGRAF_ISP", ТаблицаИдентификаторовGRAF_ISP);
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура VID_PLAT_BUDJ(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_PLAT_BUDJ(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ВидыНалоговИПлатежей), "VID_PLAT_BUDJ",,ПараметрыВыполнения);      
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыНалоговИПлатежей.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВидыНалоговИПлатежей.Ссылка) КАК GUID,
	|	ВидыНалоговИПлатежей.Наименование КАК NAME,
	|	ВидыНалоговИПлатежей.КодГлавыБК КАК GLAVA,
	|	ВидыНалоговИПлатежей.Классификатор КАК KBK,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВидыНалоговИПлатежей.ВидКлассификатора) КАК VID_KBK,
	|	ВидыНалоговИПлатежей.СчетУчета КАК KOD_SCHET_EPSBU
	|ИЗ
	|	ВТАналитики_VID_PLAT_BUDJ КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНалоговИПлатежей КАК ВидыНалоговИПлатежей
	|		ПО ВТАналитики.Аналитика = ВидыНалоговИПлатежей.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("VID_PLAT_BUDJ", ПараметрыВыполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("VID_PLAT_BUDJ", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		Объект_VID_PLAT_BUDJ = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "VID_PLAT_BUDJ")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
		СтруктураРеквизитов.NAME = Лев(СтруктураРеквизитов.NAME, 80);
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);                                    
		
		пЗаполнитьЗначенияСвойств(Объект_VID_PLAT_BUDJ, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "VID_PLAT_BUDJ", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		Объект_VID_PLAT_BUDJ.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_PLAT_BUDJ_" + Объект_VID_PLAT_BUDJ.GUID, Объект_VID_PLAT_BUDJ.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;		
               
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Объект_VID_PLAT_BUDJ);
	КонецЦикла;    
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_PLAT_BUDJ"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры  

Процедура ADM_BUDJ(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.ADM_BUDJ(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.НалогиИПлатежиОрганизации), "ADM_BUDJ",,ПараметрыВыполнения);		
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НалогиИПлатежиОрганизации.Ссылка КАК Ссылка,
	|	НалогиИПлатежиОрганизации.Наименование КАК Наименование,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(НалогиИПлатежиОрганизации.Ссылка) КАК GUID,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(НалогиИПлатежиОрганизации.Контрагент) КАК GUIDКонтрагент,
	|	НалогиИПлатежиОрганизации.Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(НалогиИПлатежиОрганизации.КодОКТМО КАК СТРОКА(8)) КАК OKTMO_BUDJ
	|ИЗ
	|	ВТАналитики_ADM_BUDJ КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НалогиИПлатежиОрганизации КАК НалогиИПлатежиОрганизации
	|		ПО ВТАналитики.Аналитика = НалогиИПлатежиОрганизации.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("ADM_BUDJ", ПараметрыВыполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("ADM_BUDJ", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		Объект_ADM_BUDJ = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "ADM_BUDJ")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);   
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);      
		
		пЗаполнитьЗначенияСвойств(Объект_ADM_BUDJ, СтруктураРеквизитов);
		
		Объект_ADM_BUDJ.GUID = XMLСтрока(Выборка.GUID);      
		Объект_ADM_BUDJ.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("ADM_BUDJ_" + Объект_ADM_BUDJ.GUID, Объект_ADM_BUDJ.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		Если СтруктураРеквизитов.Свойство("KONTRAGENT") Тогда
			ИД_Контрагента = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("KONTRAGENT_" + XMLСтрока(Выборка.GUIDКонтрагент));
			Объект_ADM_BUDJ.KONTRAGENT = ?(ЗначениеЗаполнено(ИД_Контрагента), ИД_Контрагента, "");  
			СтруктураРеквизитов.KONTRAGENT = ?(ЗначениеЗаполнено(ИД_Контрагента), ИД_Контрагента, "");  
		КонецЕсли;
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "ADM_BUDJ", Строка(Выборка.Наименование), НН, МассивОбязательныхРеквизитов);		
		КонецЕсли;
                 
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Объект_ADM_BUDJ);
	КонецЦикла;
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_ADM_BUDJ"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры  

Процедура VID_UDERJ(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_UDERJ(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ВидыУдержаний), "VID_UDERJ",,ПараметрыВыполнения);      
		
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыУдержаний.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВидыУдержаний.Ссылка) КАК GUID,
	|	ВидыУдержаний.Наименование КАК NAME
	|ИЗ
	|	ВТАналитики_VID_UDERJ КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыУдержаний КАК ВидыУдержаний
	|		ПО ВТАналитики.Аналитика = ВидыУдержаний.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("VID_UDERJ", ПараметрыВыполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("VID_UDERJ", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		Объект_VID_UDERJ = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "VID_UDERJ")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID); 
		
		пЗаполнитьЗначенияСвойств(Объект_VID_UDERJ, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "VID_UDERJ", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		Объект_VID_UDERJ.GUID = XMLСтрока(Выборка.GUID); 
		Объект_VID_UDERJ.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_UDERJ_" + Объект_VID_UDERJ.GUID, Объект_VID_UDERJ.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Объект_VID_UDERJ);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_UDERJ"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры         

Процедура BSO(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.BSO(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.БСО), "BSO",,ПараметрыВыполнения);		
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	БСО.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(БСО.Ссылка) КАК GUID,
	|	ВЫРАЗИТЬ(БСО.Наименование КАК СТРОКА(100)) КАК NAME_BSO,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(БСО.ВидБСО.Наименование, """") КАК СТРОКА(100)) КАК VID_BSO
	|ИЗ
	|	ВТАналитики_BSO КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БСО КАК БСО
	|		ПО ВТАналитики.Аналитика = БСО.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("BSO", ПараметрыВыполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("BSO", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		Объект_BSO = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "BSO")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);                                    
		
		пЗаполнитьЗначенияСвойств(Объект_BSO, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "BSO", Строка(Выборка.NAME_BSO), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		Объект_BSO.GUID = XMLСтрока(Выборка.GUID);                                    
		Объект_BSO.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("BSO_" + Объект_BSO.GUID, Объект_BSO.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Объект_BSO);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_BSO"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры         

Процедура OS_V_PUTI(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.OS_V_PUTI(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства), "OS_V_PUTI",,ПараметрыВыполнения);      
	
	#Область ТекстЗапроса
	
	Запрос = Новый Запрос(	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ИнвентарныеНомераОС.ОС, ВТАналитики_OS_V_PUTI.Аналитика) КАК Аналитика,
	|	ВТАналитики_OS_V_PUTI.Аналитика КАК GUID
	|ПОМЕСТИТЬ ВТАналитикиОС_В_ПУТИ_
	|ИЗ
	|	ВТАналитики_OS_V_PUTI КАК ВТАналитики_OS_V_PUTI
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ПО ВТАналитики_OS_V_PUTI.Аналитика = ИнвентарныеНомераОС.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Аналитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиОС_В_ПУТИ_ КАК Т)) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	СпособНачисленияАмортизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ ВТРасчетАмортизацииОС
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиОС_В_ПУТИ_ КАК Т)) КАК РасчетАмортизацииОССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь
	|ПОМЕСТИТЬ ВТСведенияКадастровогоУчета
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					Т.Аналитика
	|				ИЗ
	|					ВТАналитикиОС_В_ПУТИ_ КАК Т)) КАК СведенияКадастровогоУчетаСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОС.Событие КАК Событие,
	|	МАКСИМУМ(СобытияОС.Период) КАК Период,
	|	СобытияОС.Активность КАК Активность
	|ПОМЕСТИТЬ ВТ_СобытияОССрез
	|ИЗ
	|	РегистрСведений.СобытияОС КАК СобытияОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.Событие,
	|	СобытияОС.ОсновноеСредство,
	|	СобытияОС.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ДатаСобытия КАК ДатаСобытия,
	|	СобытияОС.ИнвНомер КАК ИнвНомер
	|ПОМЕСТИТЬ ВТ_СобытияОС
	|ИЗ
	|	ВТ_СобытияОССрез КАК ВТ_СобытияОССрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК СобытияОС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиОС_В_ПУТИ_ КАК ВТАналитикиОС_В_ПУТИ_
	|			ПО СобытияОС.ОсновноеСредство = ВТАналитикиОС_В_ПУТИ_.Аналитика
	|				И (СобытияОС.Активность)
	|		ПО ВТ_СобытияОССрез.ОсновноеСредство = СобытияОС.ОсновноеСредство
	|			И ВТ_СобытияОССрез.Событие = СобытияОС.Событие
	|			И ВТ_СобытияОССрез.Период = СобытияОС.Период
	|			И ВТ_СобытияОССрез.Активность = СобытияОС.Активность
	|ГДЕ
	|	СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|	И СобытияОС.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИнвНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИнвентарныеНомераОС.Ссылка КАК Ссылка,
	|	ИнвентарныеНомераОС.Код КАК INV_NOMER,
	|	ИнвентарныеНомераОС.ОС КАК ОС,
	|	ВЫРАЗИТЬ(ИнвентарныеНомераОС.ЗаводскойНомер КАК СТРОКА(40)) КАК NUM_ZAVOD,
	|	ИнвентарныеНомераОС.РеестровыйНомер КАК NUM_REESTR,
	|	ИнвентарныеНомераОС.ИнойНомер КАК NUM_INOY,
	|	ИнвентарныеНомераОС.ДатаВыпуска КАК DATA_VYP,
	|	ЕСТЬNULL(ВТ_СобытияОС.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_EKSP
	|ПОМЕСТИТЬ ВТ_ИнвНомера
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиОС_В_ПУТИ_ КАК ВТАналитикиОС_В_ПУТИ_
	|		ПО (НЕ ИнвентарныеНомераОС.ПометкаУдаления)
	|			И (ВТАналитикиОС_В_ПУТИ_.Аналитика = ИнвентарныеНомераОС.ОС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СобытияОС КАК ВТ_СобытияОС
	|		ПО ИнвентарныеНомераОС.Ссылка = ВТ_СобытияОС.ИнвНомер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТАналитикиОС_В_ПУТИ_.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитикиОС_В_ПУТИ_.GUID) КАК GUID,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ОсновныеСредства.НаименованиеПолное = """"
	|				ТОГДА ОсновныеСредства.Наименование
	|			ИНАЧЕ ОсновныеСредства.НаименованиеПолное
	|		КОНЕЦ КАК СТРОКА(300)) КАК NAME,
	|	ОсновныеСредства.КодФАИП КАК UK_OKS,
	|	ЕСТЬNULL(ВТСведенияКадастровогоУчета.КадастровыйНомер, """") КАК NUM_KADASTR,
	|	ЕСТЬNULL(ВТСведенияКадастровогоУчета.ОбщаяПлощадь, 0) КАК SQUARE,
	|	ЕСТЬNULL(ВТ_ИнвНомера.INV_NOMER, """") КАК INV_NOMER,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_ZAVOD, """") КАК NUM_ZAVOD,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_REESTR, """") КАК NUM_REESTR,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_INOY, """") КАК NUM_INOY,
	|	ЕСТЬNULL(ВТ_ИнвНомера.DATA_VYP, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_VYP,
	|	ЕСТЬNULL(ВТ_ИнвНомера.DATA_EKSP, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_EKSP
	|ИЗ
	|	ВТАналитикиОС_В_ПУТИ_ КАК ВТАналитикиОС_В_ПУТИ_
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетАмортизацииОС КАК ВТРасчетАмортизацииОС
	|			ПО ОсновныеСредства.Ссылка = ВТРасчетАмортизацииОС.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет КАК ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|			ПО ОсновныеСредства.Ссылка = ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияКадастровогоУчета КАК ВТСведенияКадастровогоУчета
	|			ПО ОсновныеСредства.Ссылка = ВТСведенияКадастровогоУчета.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|			ПО ОсновныеСредства.Ссылка = ВТ_ИнвНомера.ОС
	|		ПО ВТАналитикиОС_В_ПУТИ_.Аналитика = ОсновныеСредства.Ссылка");
	
	#КонецОбласти	
	
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("OS_V_PUTI", ПараметрыВыполнения);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("OS_V_PUTI", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		Объект_OS_V_PUTI = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "OS_V_PUTI")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка); 
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);                                    
		
		пЗаполнитьЗначенияСвойств(Объект_OS_V_PUTI, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "OS_V_PUTI", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		Объект_OS_V_PUTI.GUID = XMLСтрока(Выборка.GUID);                                    
		Объект_OS_V_PUTI.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("OS_V_PUTI_" + Объект_OS_V_PUTI.GUID, Объект_OS_V_PUTI.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;	
		                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Объект_OS_V_PUTI);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_OS_V_PUTI; УНИЧТОЖИТЬ ВТАналитикиОС_В_ПУТИ_; УНИЧТОЖИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет; УНИЧТОЖИТЬ ВТРасчетАмортизацииОС; 
	|УНИЧТОЖИТЬ ВТСведенияКадастровогоУчета; УНИЧТОЖИТЬ ВТ_СобытияОССрез; УНИЧТОЖИТЬ ВТ_СобытияОС; УНИЧТОЖИТЬ ВТ_ИнвНомера"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры  

Процедура OS_NMA_NPA_KAZNA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.OS_NMA_NPA_KAZNA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства), "OS_NMA_NPA_KAZNA",,ПараметрыВыполнения);      
	
	#Область ТекстЗапроса
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ИнвентарныеНомераОС.ОС, ВТАналитики_OS_NMA_NPA_KAZNA.Аналитика) КАК Аналитика,
	|	ВТАналитики_OS_NMA_NPA_KAZNA.Аналитика КАК GUID
	|ПОМЕСТИТЬ ВТАналитикиОС_НМА_НПА_Казна_
	|ИЗ
	|	ВТАналитики_OS_NMA_NPA_KAZNA КАК ВТАналитики_OS_NMA_NPA_KAZNA
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ПО ВТАналитики_OS_NMA_NPA_KAZNA.Аналитика = ИнвентарныеНомераОС.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Аналитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиОС_НМА_НПА_Казна_ КАК Т)) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	СпособНачисленияАмортизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ ВТРасчетАмортизацииОС
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиОС_НМА_НПА_Казна_ КАК Т)) КАК РасчетАмортизацииОССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь
	|ПОМЕСТИТЬ ВТСведенияКадастровогоУчета
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					Т.Аналитика
	|				ИЗ
	|					ВТАналитикиОС_НМА_НПА_Казна_ КАК Т)) КАК СведенияКадастровогоУчетаСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОС.Событие КАК Событие,
	|	МАКСИМУМ(СобытияОС.Период) КАК Период,
	|	СобытияОС.Активность КАК Активность
	|ПОМЕСТИТЬ ВТ_СобытияОССрез
	|ИЗ
	|	РегистрСведений.СобытияОС КАК СобытияОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.Событие,
	|	СобытияОС.ОсновноеСредство,
	|	СобытияОС.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ДатаСобытия КАК ДатаСобытия,
	|	СобытияОС.ИнвНомер КАК ИнвНомер
	|ПОМЕСТИТЬ ВТ_СобытияОС
	|ИЗ
	|	ВТ_СобытияОССрез КАК ВТ_СобытияОССрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК СобытияОС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиОС_НМА_НПА_Казна_ КАК ВТАналитикиОС_НМА_НПА_Казна_
	|			ПО СобытияОС.ОсновноеСредство = ВТАналитикиОС_НМА_НПА_Казна_.Аналитика
	|				И (СобытияОС.Активность)
	|		ПО ВТ_СобытияОССрез.ОсновноеСредство = СобытияОС.ОсновноеСредство
	|			И ВТ_СобытияОССрез.Событие = СобытияОС.Событие
	|			И ВТ_СобытияОССрез.Период = СобытияОС.Период
	|			И ВТ_СобытияОССрез.Активность = СобытияОС.Активность
	|ГДЕ
	|	СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|	И СобытияОС.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИнвНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИнвентарныеНомераОС.Ссылка КАК Ссылка,
	|	ИнвентарныеНомераОС.Код КАК INV_NOMER,
	|	ИнвентарныеНомераОС.ОС КАК ОС,
	|	ВЫРАЗИТЬ(ИнвентарныеНомераОС.ЗаводскойНомер КАК СТРОКА(40)) КАК NUM_ZAVOD,
	|	ИнвентарныеНомераОС.РеестровыйНомер КАК NUM_REESTR,
	|	ИнвентарныеНомераОС.ИнойНомер КАК NUM_INOY,
	|	ИнвентарныеНомераОС.ДатаВыпуска КАК DATA_VYP,
	|	ЕСТЬNULL(ВТ_СобытияОС.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_EKSP
	|ПОМЕСТИТЬ ВТ_ИнвНомера
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиОС_НМА_НПА_Казна_ КАК ВТАналитикиОС_НМА_НПА_Казна_
	|		ПО (НЕ ИнвентарныеНомераОС.ПометкаУдаления)
	|			И (ВТАналитикиОС_НМА_НПА_Казна_.Аналитика = ИнвентарныеНомераОС.ОС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СобытияОС КАК ВТ_СобытияОС
	|		ПО ИнвентарныеНомераОС.Ссылка = ВТ_СобытияОС.ИнвНомер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТАналитикиОС_НМА_НПА_Казна_.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитикиОС_НМА_НПА_Казна_.GUID) КАК GUID,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ОсновныеСредства.НаименованиеПолное = """"
	|				ТОГДА ОсновныеСредства.Наименование
	|			ИНАЧЕ ОсновныеСредства.НаименованиеПолное
	|		КОНЕЦ КАК СТРОКА(300)) КАК NAME,
	|	ЕСТЬNULL(ВТСведенияКадастровогоУчета.КадастровыйНомер, """") КАК NUM_KADASTR,
	|	ЕСТЬNULL(ВТ_ИнвНомера.INV_NOMER, """") КАК INV_NOMER,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_ZAVOD, """") КАК NUM_ZAVOD,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_REESTR, """") КАК NUM_REESTR,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_INOY, """") КАК NUM_INOY
	|ИЗ
	|	ВТАналитикиОС_НМА_НПА_Казна_ КАК ВТАналитикиОС_НМА_НПА_Казна_
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетАмортизацииОС КАК ВТРасчетАмортизацииОС
	|			ПО ОсновныеСредства.Ссылка = ВТРасчетАмортизацииОС.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет КАК ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|			ПО ОсновныеСредства.Ссылка = ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияКадастровогоУчета КАК ВТСведенияКадастровогоУчета
	|			ПО ОсновныеСредства.Ссылка = ВТСведенияКадастровогоУчета.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|			ПО ОсновныеСредства.Ссылка = ВТ_ИнвНомера.ОС
	|		ПО ВТАналитикиОС_НМА_НПА_Казна_.Аналитика = ОсновныеСредства.Ссылка");
	
	#КонецОбласти	
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("OS_NMA_NPA_KAZNA", ПараметрыВыполнения);
	
	Выборка 				= Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("OS_NMA_NPA_KAZNA", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		Объект_OS_NMA_NPA_KAZNA = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "OS_NMA_NPA_KAZNA")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка); 
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);                                    
		
		пЗаполнитьЗначенияСвойств(Объект_OS_NMA_NPA_KAZNA, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "OS_NMA_NPA_KAZNA", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;		
		
		Объект_OS_NMA_NPA_KAZNA.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("OS_NMA_NPA_KAZNA_" + Объект_OS_NMA_NPA_KAZNA.GUID, Объект_OS_NMA_NPA_KAZNA.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;	
		                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Объект_OS_NMA_NPA_KAZNA);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_OS_NMA_NPA_KAZNA; УНИЧТОЖИТЬ ВТАналитикиОС_НМА_НПА_Казна_; УНИЧТОЖИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет; УНИЧТОЖИТЬ ВТРасчетАмортизацииОС; 
	|УНИЧТОЖИТЬ ВТСведенияКадастровогоУчета; УНИЧТОЖИТЬ ВТ_СобытияОССрез; УНИЧТОЖИТЬ ВТ_СобытияОС; УНИЧТОЖИТЬ ВТ_ИнвНомера"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры  

Процедура OS_NMA_NPA_ARENDA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.OS_NMA_NPA_ARENDA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства), "OS_NMA_NPA_ARENDA",,ПараметрыВыполнения);      
	
	#Область ТекстЗапроса
	
	Запрос = Новый Запрос(	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ИнвентарныеНомераОС.ОС, ВТАналитики_OS_NMA_NPA_ARENDA.Аналитика) КАК Аналитика,
	|	ВТАналитики_OS_NMA_NPA_ARENDA.Аналитика КАК GUID		
	|ПОМЕСТИТЬ ВТАналитикиОС_НМА_НПА_Аренда_
	|ИЗ
	|	ВТАналитики_OS_NMA_NPA_ARENDA КАК ВТАналитики_OS_NMA_NPA_ARENDA
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ПО ВТАналитики_OS_NMA_NPA_ARENDA.Аналитика = ИнвентарныеНомераОС.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Аналитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиОС_НМА_НПА_Аренда_ КАК Т)) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	СпособНачисленияАмортизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ ВТРасчетАмортизацииОС
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			Активность
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Т.Аналитика
	|					ИЗ
	|						ВТАналитикиОС_НМА_НПА_Аренда_ КАК Т)) КАК РасчетАмортизацииОССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь
	|ПОМЕСТИТЬ ВТСведенияКадастровогоУчета
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					Т.Аналитика
	|				ИЗ
	|					ВТАналитикиОС_НМА_НПА_Аренда_ КАК Т)) КАК СведенияКадастровогоУчетаСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОС.Событие КАК Событие,
	|	МАКСИМУМ(СобытияОС.Период) КАК Период,
	|	СобытияОС.Активность КАК Активность
	|ПОМЕСТИТЬ ВТ_СобытияОССрез
	|ИЗ
	|	РегистрСведений.СобытияОС КАК СобытияОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.Событие,
	|	СобытияОС.ОсновноеСредство,
	|	СобытияОС.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ДатаСобытия КАК ДатаСобытия,
	|	СобытияОС.ИнвНомер КАК ИнвНомер
	|ПОМЕСТИТЬ ВТ_СобытияОС
	|ИЗ
	|	ВТ_СобытияОССрез КАК ВТ_СобытияОССрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК СобытияОС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиОС_НМА_НПА_Аренда_ КАК ВТАналитикиОС_НМА_НПА_Аренда_
	|			ПО СобытияОС.ОсновноеСредство = ВТАналитикиОС_НМА_НПА_Аренда_.Аналитика
	|				И (СобытияОС.Активность)
	|		ПО ВТ_СобытияОССрез.ОсновноеСредство = СобытияОС.ОсновноеСредство
	|			И ВТ_СобытияОССрез.Событие = СобытияОС.Событие
	|			И ВТ_СобытияОССрез.Период = СобытияОС.Период
	|			И ВТ_СобытияОССрез.Активность = СобытияОС.Активность
	|ГДЕ
	|	СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|	И СобытияОС.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИнвНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИнвентарныеНомераОС.Ссылка КАК Ссылка,
	|	ИнвентарныеНомераОС.Код КАК INV_NOMER,
	|	ИнвентарныеНомераОС.ОС КАК ОС,
	|	ВЫРАЗИТЬ(ИнвентарныеНомераОС.ЗаводскойНомер КАК СТРОКА(40)) КАК NUM_ZAVOD,
	|	ИнвентарныеНомераОС.РеестровыйНомер КАК NUM_REESTR,
	|	ИнвентарныеНомераОС.ИнойНомер КАК NUM_INOY,
	|	ИнвентарныеНомераОС.ДатаВыпуска КАК DATA_VYP,
	|	ЕСТЬNULL(ВТ_СобытияОС.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК DATA_EKSP
	|ПОМЕСТИТЬ ВТ_ИнвНомера
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитикиОС_НМА_НПА_Аренда_ КАК ВТАналитикиОС_НМА_НПА_Аренда_
	|		ПО (НЕ ИнвентарныеНомераОС.ПометкаУдаления)
	|			И (ВТАналитикиОС_НМА_НПА_Аренда_.Аналитика = ИнвентарныеНомераОС.ОС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СобытияОС КАК ВТ_СобытияОС
	|		ПО ИнвентарныеНомераОС.Ссылка = ВТ_СобытияОС.ИнвНомер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТАналитикиОС_НМА_НПА_Аренда_.GUID КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитикиОС_НМА_НПА_Аренда_.GUID) КАК GUID,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ОсновныеСредства.НаименованиеПолное = """"
	|				ТОГДА ОсновныеСредства.Наименование
	|			ИНАЧЕ ОсновныеСредства.НаименованиеПолное
	|		КОНЕЦ КАК СТРОКА(300)) КАК NAME,
	|	ЕСТЬNULL(ВТСведенияКадастровогоУчета.КадастровыйНомер, """") КАК NUM_KADASTR,
	|	ЕСТЬNULL(ВТ_ИнвНомера.INV_NOMER, """") КАК INV_NOMER,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_ZAVOD, """") КАК NUM_ZAVOD,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_REESTR, """") КАК NUM_REESTR,
	|	ЕСТЬNULL(ВТ_ИнвНомера.NUM_INOY, """") КАК NUM_INOY,
	|	"""" Как UCH_NOMER
	|ИЗ
	|	ВТАналитикиОС_НМА_НПА_Аренда_ КАК ВТАналитикиОС_НМА_НПА_Аренда_
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетАмортизацииОС КАК ВТРасчетАмортизацииОС
	|			ПО ОсновныеСредства.Ссылка = ВТРасчетАмортизацииОС.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет КАК ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет
	|			ПО ОсновныеСредства.Ссылка = ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияКадастровогоУчета КАК ВТСведенияКадастровогоУчета
	|			ПО ОсновныеСредства.Ссылка = ВТСведенияКадастровогоУчета.ОсновноеСредство
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнвНомера КАК ВТ_ИнвНомера
	|			ПО ОсновныеСредства.Ссылка = ВТ_ИнвНомера.ОС
	|		ПО ВТАналитикиОС_НМА_НПА_Аренда_.Аналитика = ОсновныеСредства.Ссылка"); 
	
	#КонецОбласти	
	
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("OS_NMA_NPA_ARENDA", ПараметрыВыполнения);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка 				= Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("OS_NMA_NPA_ARENDA", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		Объект_OS_NMA_NPA_ARENDA = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "OS_NMA_NPA_ARENDA")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка); 
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);                                    
		
		пЗаполнитьЗначенияСвойств(Объект_OS_NMA_NPA_ARENDA, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "OS_NMA_NPA_ARENDA", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		Объект_OS_NMA_NPA_ARENDA.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("OS_NMA_NPA_ARENDA_" + Объект_OS_NMA_NPA_ARENDA.GUID, Объект_OS_NMA_NPA_ARENDA.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;		
		                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Объект_OS_NMA_NPA_ARENDA);		
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_OS_NMA_NPA_ARENDA; УНИЧТОЖИТЬ ВТАналитикиОС_НМА_НПА_Аренда_; УНИЧТОЖИТЬ ВТ_ПараметрыАмортизацииОСБухгалтерскийУчет; УНИЧТОЖИТЬ ВТРасчетАмортизацииОС; 
	|УНИЧТОЖИТЬ ВТСведенияКадастровогоУчета; УНИЧТОЖИТЬ ВТ_СобытияОССрез; УНИЧТОЖИТЬ ВТ_СобытияОС; УНИЧТОЖИТЬ ВТ_ИнвНомера"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры  

Процедура MOL_SOTRUDNIK(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.MOL_SOTRUDNIK(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	СпецАналитикиНаборомВМенеджерВТ(МенеджерВТ, "MOL_SOTRUDNIK");      
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЦМО.Ссылка КАК Ссылка,
	|	ЦМО.Наименование КАК Наименование,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЦМО.Ссылка) КАК GUID,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФизическиеЛица.Ссылка) КАК GUIDФизЛицо,
	|	ФизическиеЛица.Ссылка КАК ФизЛицо
	|ИЗ
	|	ВТАналитики_MOL_SOTRUDNIK КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦМО КАК ЦМО
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|					ПО Контрагенты.ЮридическоеФизическоеЛицо = ФизическиеЛица.Ссылка
	|				ПО Сотрудники.Контрагент = Контрагенты.Ссылка
	|			ПО ЦМО.Сотрудник = Сотрудники.Ссылка
	|		ПО ВТАналитики.Аналитика = ЦМО.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("MOL_SOTRUDNIK", ПараметрыВыполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("MOL_SOTRUDNIK", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		Объект_MOL_SOTRUDNIK = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "MOL_SOTRUDNIK")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);    
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);  
		
		пЗаполнитьЗначенияСвойств(Объект_MOL_SOTRUDNIK, СтруктураРеквизитов);                                                            
		
		Объект_MOL_SOTRUDNIK.GUID = XMLСтрока(Выборка.GUID);  
		Объект_MOL_SOTRUDNIK.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("MOL_SOTRUDNIK_" + Объект_MOL_SOTRUDNIK.GUID, Объект_MOL_SOTRUDNIK.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1; 
		Если СтруктураРеквизитов.Свойство("FIZ_LICO") Тогда
			ИД_Контрагента = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("FIZ_LICO_" + XMLСтрока(Выборка.GUIDФизЛицо));
			Объект_MOL_SOTRUDNIK.FIZ_LICO = ?(ЗначениеЗаполнено(ИД_Контрагента), ИД_Контрагента, "");
			СтруктураРеквизитов.FIZ_LICO = ?(ЗначениеЗаполнено(ИД_Контрагента), ИД_Контрагента, "");
		КонецЕсли;
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда		
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "MOL_SOTRUDNIK", Строка(Выборка.Наименование), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Объект_MOL_SOTRUDNIK);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_MOL_SOTRUDNIK"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры         

Процедура VID_POST(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_POST(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ВидыОбязательств), "VID_POST",,ПараметрыВыполнения);      
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыОбязательств.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВидыОбязательств.Ссылка) КАК GUID,
	|	ВЫРАЗИТЬ(ВидыОбязательств.Наименование КАК СТРОКА(100)) КАК NAME
	|ИЗ
	|	ВТАналитики_VID_POST КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыОбязательств КАК ВидыОбязательств
	|		ПО ВТАналитики.Аналитика = ВидыОбязательств.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("VID_POST", ПараметрыВыполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("VID_POST", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		Объект_VID_POST = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "VID_POST")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка); 
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);                                    
		
		пЗаполнитьЗначенияСвойств(Объект_VID_POST, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "VID_POST", Строка(Выборка.NAME), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;		
		
		Объект_VID_POST.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_POST_" + Объект_VID_POST.GUID, Объект_VID_POST.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;	
                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Объект_VID_POST);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_POST"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры         

Процедура MESTO_ADDR_NFA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.MESTO_ADDR_NFA(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	СпецАналитикиНаборомВМенеджерВТ(МенеджерВТ, "MESTO_ADDR_NFA");      
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЦМО.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЦМО.Ссылка) КАК GUID, 
	|	ЦМО.Наименование КАК Наименование,
	|	МестаХранения.Наименование КАК MESTO,
	|	ЕстьNull(МестаХраненияКонтактнаяИнформация.Представление, """") КАК Представление,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(МестаХраненияКонтактнаяИнформация.ЗначенияПолей, """") КАК СТРОКА(1024)) КАК ЗначенияПолей,
	|	ЕстьNull(МестаХраненияКонтактнаяИнформация.Страна, """") КАК Страна,
	|	ЕстьNull(МестаХраненияКонтактнаяИнформация.Представление, """") КАК ADRES_PREDSTAVLENIE
	|ИЗ
	|	ВТАналитики_MESTO_ADDR_NFA КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦМО КАК ЦМО
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаХранения КАК МестаХранения
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаХранения.КонтактнаяИнформация КАК МестаХраненияКонтактнаяИнформация
	|				ПО МестаХранения.Ссылка = МестаХраненияКонтактнаяИнформация.Ссылка
	|					И (МестаХраненияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаХранения))
	|			ПО ЦМО.МестоХранения = МестаХранения.Ссылка
	|		ПО ВТАналитики.Аналитика = ЦМО.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеСредства.Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОсновныеСредства.Ссылка),
	|	ОсновныеСредства.Наименование,
	|	ОсновныеСредства.Местонахождение,
	|	ЕстьNull(ОсновныеСредстваКонтактнаяИнформация.Представление, """"),
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ОсновныеСредстваКонтактнаяИнформация.ЗначенияПолей, """") КАК СТРОКА(1024)),
	|	ЕстьNull(ОсновныеСредстваКонтактнаяИнформация.Страна, """"),
	|	ЕстьNull(ОсновныеСредстваКонтактнаяИнформация.Представление, """")
	|ИЗ
	|	ВТАналитики_MESTO_ADDR_NFA КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|			ПРАВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.КонтактнаяИнформация КАК ОсновныеСредстваКонтактнаяИнформация
	|			ПО (ОсновныеСредстваКонтактнаяИнформация.Ссылка = ОсновныеСредства.Ссылка)
	|		ПО ВТАналитики.Аналитика = ОсновныеСредства.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	НН = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Количество();
	МассивОбязательныхРеквизитов = МассивОбязательныхРеквизитовАналитики("MESTO_ADDR_NFA", ПараметрыВыполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("MESTO_ADDR_NFA", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		Объект_MESTO_ADDR_NFA = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "MESTO_ADDR_NFA")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка); 
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);               
		
		пЗаполнитьЗначенияСвойств(Объект_MESTO_ADDR_NFA, СтруктураРеквизитов);
		Если ПараметрыВыполнения.ВыполнятьПроверку Тогда
			ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, "MESTO_ADDR_NFA", Строка(Выборка.Наименование), НН, МассивОбязательныхРеквизитов);
		КонецЕсли;
		
		Объект_MESTO_ADDR_NFA.GUID = XMLСтрока(Выборка.GUID);               
		Объект_MESTO_ADDR_NFA.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("MESTO_ADDR_NFA_" + Объект_MESTO_ADDR_NFA.GUID, Объект_MESTO_ADDR_NFA.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;
		Если СтруктураРеквизитов.Свойство("ADRES") Тогда
			АдресСтрокой = ПолучитьАдресСтрокой(Выборка.ЗначенияПолей);
			ИДАдреса = ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Получить("ADRES_" + РассчитатьХешСтроки(АдресСтрокой + Выборка.Представление));		
			Объект_MESTO_ADDR_NFA.ADRES = ?(ЗначениеЗаполнено(ИДАдреса), ИДАдреса, "");
		КонецЕсли;		
		                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Объект_MESTO_ADDR_NFA);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_MESTO_ADDR_NFA"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры         

Процедура VID_DOH_BUD_PER(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения)
	
	ЗаписьXML = ОбщийОбъект;
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_DOH_BUD_PER(ОбщийОбъект, МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура), "VID_DOH_BUD_PER",,ПараметрыВыполнения);	
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Номенклатура.Ссылка) КАК GUID,
	|	Номенклатура.Наименование КАК NAME
	|ИЗ
	|	ВТАналитики_VID_DOH_BUD_PER КАК ВТАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТАналитики.Аналитика = Номенклатура.Ссылка");       
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 
	
	Выборка 				= Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = СтруктураРеквизитовАналитики("VID_DOH_BUD_PER", ПараметрыВыполнения);
	Пока Выборка.Следующий() Цикл  
		ОбъектVID_DOH_BUD_PER = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "VID_DOH_BUD_PER")); 
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка); 
		СтруктураРеквизитов.GUID = XMLСтрока(Выборка.GUID);                                    
		
		пЗаполнитьЗначенияСвойств(ОбъектVID_DOH_BUD_PER, СтруктураРеквизитов);
		
		ОбъектVID_DOH_BUD_PER.ID = Формат(ПараметрыВыполнения.ПорядковыйНомер, "ЧГ=0");  
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_DOH_BUD_PER_" + ОбъектVID_DOH_BUD_PER.GUID, ОбъектVID_DOH_BUD_PER.ID);
		ПараметрыВыполнения.ПорядковыйНомер = ПараметрыВыполнения.ПорядковыйНомер + 1;		
                
		ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектVID_DOH_BUD_PER);
	КонецЦикла;       
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_DOH_BUD_PER"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура VID_RASH_PODOTCHET(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_RASH_PODOTCHET(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ВидыРасчетовСПЛ), "VID_RASH_PODOTCHET",,ПараметрыВыполнения);	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАналитики_VID_RASH_PODOTCHET.Аналитика КАК Аналитика,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_VID_RASH_PODOTCHET.Аналитика)) КАК GUID
	|ИЗ
	|	ВТАналитики_VID_RASH_PODOTCHET КАК ВТАналитики_VID_RASH_PODOTCHET
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_RASH_PODOTCHET_" + Строка(Выборка.GUID), ?(Выборка.Аналитика = Перечисления.ВидыРасчетовСПЛ.РасчетыПоДД, "2", "1"));	
	КонецЦикла;	 
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_RASH_PODOTCHET"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;                      Запрос.Выполнить();
	
КонецПроцедуры

Процедура TIP_IMUCH_ZAB(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.TIP_IMUCH_ZAB(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	СпецАналитикиНаборомВсехСубконтоВМенеджерВТ(МенеджерВТ, "TIP_IMUCH_ZAB"); 
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР	
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_TIP_IMUCH_ZAB.Субконто1) = ТИП(Справочник.Номенклатура)
	|			ТОГДА ВТАналитики_TIP_IMUCH_ZAB.Субконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_TIP_IMUCH_ZAB.Субконто2) = ТИП(Справочник.Номенклатура)
	|			ТОГДА ВТАналитики_TIP_IMUCH_ZAB.Субконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_TIP_IMUCH_ZAB.Субконто3) = ТИП(Справочник.Номенклатура)
	|			ТОГДА ВТАналитики_TIP_IMUCH_ZAB.Субконто3
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_TIP_IMUCH_ZAB.Субконто1) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА ВТАналитики_TIP_IMUCH_ZAB.Субконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_TIP_IMUCH_ZAB.Субконто2) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА ВТАналитики_TIP_IMUCH_ZAB.Субконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_TIP_IMUCH_ZAB.Субконто3) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА ВТАналитики_TIP_IMUCH_ZAB.Субконто3
	|	КОНЕЦ КАК Аналитика
	|ПОМЕСТИТЬ ВТАналитики_TIP_IMUCH_ZAB_Предварительно
	|ИЗ
	|	ВТАналитики_TIP_IMUCH_ZAB КАК ВТАналитики_TIP_IMUCH_ZAB
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Аналитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_TIP_IMUCH_ZAB_Предварительно.Аналитика)) КАК GUID,
	|	ВЫБОР
	|		КОГДА Номенклатура.Ссылка ЕСТЬ NULL
	|			ТОГДА ""1""
	|		КОГДА Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.БиологическиеАктивы)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""2""
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	ВТАналитики_TIP_IMUCH_ZAB_Предварительно КАК ВТАналитики_TIP_IMUCH_ZAB_Предварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (ВТАналитики_TIP_IMUCH_ZAB_Предварительно.Аналитика = Номенклатура.Ссылка)
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("TIP_IMUCH_ZAB_" + Выборка.GUID, Выборка.Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_TIP_IMUCH_ZAB; УНИЧТОЖИТЬ ВТАналитики_TIP_IMUCH_ZAB_Предварительно"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры 

Процедура KOD_CELI(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.KOD_CELI(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ВидыЦелевыхСредств), "KOD_CELI",,ПараметрыВыполнения);	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВидыЦелевыхСредств.Код КАК Значение,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_KOD_CELI.Аналитика)) КАК GUID
	|ИЗ
	|	ВТАналитики_KOD_CELI КАК ВТАналитики_KOD_CELI
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦелевыхСредств КАК ВидыЦелевыхСредств
	|		ПО ВТАналитики_KOD_CELI.Аналитика = ВидыЦелевыхСредств.Ссылка
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("KOD_CELI_" + Выборка.GUID, Выборка.Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_KOD_CELI"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура MESTO_ROZN(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.MESTO_ROZN(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ЦМО), "MESTO_ROZN",,ПараметрыВыполнения);	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЦМО.МестоХранения КАК Значение,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_MESTO_ROZN.Аналитика)) КАК GUID
	|ИЗ
	|	ВТАналитики_MESTO_ROZN КАК ВТАналитики_MESTO_ROZN
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦМО КАК ЦМО
	|		ПО ВТАналитики_MESTO_ROZN.Аналитика = ЦМО.Ссылка
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("MESTO_ROZN_" + Выборка.GUID, Выборка.Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_MESTO_ROZN"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура PRICH_OSH(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.PRICH_OSH(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ПричиныОшибокПрошлыхЛет), "PRICH_OSH",,ПараметрыВыполнения);	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПричиныОшибокПрошлыхЛет.КодПричиныОшибки КАК Значение,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_PRICH_OSH.Аналитика)) КАК GUID
	|ИЗ
	|	ВТАналитики_PRICH_OSH КАК ВТАналитики_PRICH_OSH
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПричиныОшибокПрошлыхЛет КАК ПричиныОшибокПрошлыхЛет
	|		ПО ВТАналитики_PRICH_OSH.Аналитика = ПричиныОшибокПрошлыхЛет.Ссылка
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("PRICH_OSH_" + Выборка.GUID, Лев(Строка(Выборка.Значение), 4)) ;
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_PRICH_OSH"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура REG_NOMER_GARANT(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.REG_NOMER_GARANT(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.Договоры), "REG_NOMER_GARANT",,ПараметрыВыполнения);	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Договоры.НомерЦеннойБумаги КАК Значение,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_REG_NOMER_GARANT.Аналитика)) КАК GUID
	|ИЗ
	|	ВТАналитики_REG_NOMER_GARANT КАК ВТАналитики_REG_NOMER_GARANT
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВТАналитики_REG_NOMER_GARANT.Аналитика = Договоры.Ссылка
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("REG_NOMER_GARANT_" + Выборка.GUID, Выборка.Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_REG_NOMER_GARANT"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();	 
	
КонецПроцедуры

Процедура UCH_NOMER_DO(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.UCH_NOMER_DO(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.Договоры), "UCH_NOMER_DO",,ПараметрыВыполнения);	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Договоры.НомерЦеннойБумаги КАК Значение,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_UCH_NOMER_DO.Аналитика)) КАК GUID
	|ИЗ
	|	ВТАналитики_UCH_NOMER_DO КАК ВТАналитики_UCH_NOMER_DO
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО ВТАналитики_UCH_NOMER_DO.Аналитика = Договоры.Ссылка
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("UCH_NOMER_DO_" + Выборка.GUID, Выборка.Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_UCH_NOMER_DO"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();	 
	
КонецПроцедуры

Процедура VID_IMUCH(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_IMUCH(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства), "VID_IMUCH",,ПараметрыВыполнения);	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОсновныеСредства.ТипНФА КАК Значение,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_VID_IMUCH.Аналитика)) КАК GUID
	|ИЗ
	|	ВТАналитики_VID_IMUCH КАК ВТАналитики_VID_IMUCH
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО (ВТАналитики_VID_IMUCH.Аналитика = ОсновныеСредства.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеСредства.ТипНФА,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_VID_IMUCH.Аналитика))
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитики_VID_IMUCH КАК ВТАналитики_VID_IMUCH
	|			ПО (ВТАналитики_VID_IMUCH.Аналитика = ИнвентарныеНомераОС.Ссылка)
	|		ПО (ИнвентарныеНомераОС.ОС = ОсновныеСредства.Ссылка)		
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_IMUCH_" + Выборка.GUID, Строка(Выборка.Значение));
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_IMUCH"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();	 
	
КонецПроцедуры

Процедура VID_IMUCH_ZAB(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_IMUCH_ZAB(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства), "VID_IMUCH_ZAB",,ПараметрыВыполнения);	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОсновныеСредства.ТипНФА КАК ТипНФА,
	|	ОсновныеСредства.Ссылка КАК ОС,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_VID_IMUCH_ZAB.Аналитика)) КАК GUID
	|ИЗ
	|	ВТАналитики_VID_IMUCH_ZAB КАК ВТАналитики_VID_IMUCH_ZAB
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО (ВТАналитики_VID_IMUCH_ZAB.Аналитика = ОсновныеСредства.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеСредства.ТипНФА,
	|	ОсновныеСредства.Ссылка,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_VID_IMUCH_ZAB.Аналитика))
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналитики_VID_IMUCH_ZAB КАК ВТАналитики_VID_IMUCH_ZAB
	|			ПО (ВТАналитики_VID_IMUCH_ZAB.Аналитика = ИнвентарныеНомераОС.Ссылка)
	|		ПО (ИнвентарныеНомераОС.ОС = ОсновныеСредства.Ссылка)
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать(); 
	МодульУправлениеОсновнымиСредствами = ОбщегоНазначения.ОбщийМодуль("УправлениеОсновнымиСредствами");	
	Пока Выборка.Следующий() Цикл     
		Значение = "";
		ВидИмущества = МодульУправлениеОсновнымиСредствами.ДанныеОбъектаОС(Выборка.ОС, КонецДня(ТекущаяДатаСеанса())).ВидИмущества;
		Если ВидИмущества = Перечисления.ВидыИмущества.ВКонцессии Тогда
			Значение = "90";
		ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ПраваПользованияНМА Тогда
			Значение = "60";
		ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.Аренда Тогда
			Значение = "40";
		ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.Лизинг Тогда
			Значение = "40";
		ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.ИноеДвижимое Тогда
			Значение = "30";   
		ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.Казна Тогда  
			Если Выборка.ТипНФА = Перечисления.ТипыНФА.ЖилыеПомещения
				Или Выборка.ТипНФА = Перечисления.ТипыНФА.НежилыеПомещения
				Или Выборка.ТипНФА = Перечисления.ТипыНФА.Сооружения Тогда
				Значение = "51";
			Иначе            
				Значение = "52";                                                
			КонецЕсли;
		ИначеЕсли ВидИмущества = Перечисления.ВидыИмущества.НедвижимоеИмущество Тогда
			Значение = "10";   
		Иначе
			Значение = "20";
		КонецЕсли;
		
		
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_IMUCH_ZAB_" + Выборка.GUID, Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_IMUCH_ZAB"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();	 
	
КонецПроцедуры

Процедура VID_OBESPECH(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_OBESPECH(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ВидыОбеспечения), "VID_OBESPECH",,ПараметрыВыполнения);	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАналитики_VID_OBESPECH.Аналитика КАК Аналитика,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_VID_OBESPECH.Аналитика)) КАК GUID
	|ИЗ
	|	ВТАналитики_VID_OBESPECH КАК ВТАналитики_VID_OBESPECH
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл    
		Значение = "";
		ВидОбеспечения = Выборка.Аналитика;
		Если ВидОбеспечения = Перечисления.ВидыОбеспечения.Залог Тогда			
			Значение = "01";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.БанковскаяГарантия Тогда			
			Значение = "02";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.БанковскаяГарантия Тогда			
			Значение = "02";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.НезависимаяГарантия Тогда			
			Значение = "03";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.Задаток Тогда			
			Значение = "04";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.Поручительство Тогда			
			Значение = "05";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.ОбеспечительныйПлатеж Тогда			
			Значение = "06";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.УдержаниеВещиДолжника Тогда			
			Значение = "07";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.ИноеОбеспечение Тогда			
			Значение = "08";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.БанковскаяГарантияОбеспечениеЗаявки Тогда			
			Значение = "09";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.БанковскаяГарантияОбеспечениеКонтракта Тогда			
			Значение = "10";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.БанковскаяГарантияОбеспечениеГарантийныхОбязательств Тогда			
			Значение = "11";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.НезависимаяГарантияОбеспечениеЗаявки Тогда			
			Значение = "12";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.НезависимаяГарантияОбеспечениеКонтракта Тогда			
			Значение = "13";
		ИначеЕсли ВидОбеспечения = Перечисления.ВидыОбеспечения.НезависимаяГарантияОбеспечениеГарантийныхОбязательств Тогда			
			Значение = "14";
		КонецЕсли;
		
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_OBESPECH_" + Выборка.GUID, Значение);	
	КонецЦикла;	 
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_OBESPECH"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура VID_RACH_ZAIM_KR(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_RACH_ZAIM_KR(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.ВидыРасчетовПоЗаймам), "VID_RACH_ZAIM_KR",,ПараметрыВыполнения);	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАналитики_VID_RACH_ZAIM_KR.Аналитика КАК Аналитика,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_VID_RACH_ZAIM_KR.Аналитика)) КАК GUID
	|ИЗ
	|	ВТАналитики_VID_RACH_ZAIM_KR КАК ВТАналитики_VID_RACH_ZAIM_KR
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл    
		Значение = "1";
		ВидРасчетовПоЗаймам = Выборка.Аналитика;
		Если ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг Тогда			
			Значение =  "1";
		ИначеЕсли ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.Проценты Тогда			
			Значение =  "2";
		ИначеЕсли ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.Штрафы Тогда			
			Значение =  "3";
		ИначеЕсли ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.ПениНаОсновнойДолг Тогда			
			Значение =  "4";
		ИначеЕсли ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.ПениНаПроценты Тогда			
			Значение =  "5";
		ИначеЕсли ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.СтоимостьРазмещенияЦБ Тогда			
			Значение =  "6";
		ИначеЕсли ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.ОтклонениеОтНоминала Тогда			
			Значение =  "7";
		КонецЕсли;
		
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_RACH_ZAIM_KR_" + Выборка.GUID, Значение);	
	КонецЦикла;	 
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_RACH_ZAIM_KR"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура VID_RASH_BUD_PER(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_RASH_BUD_PER(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.РасходыБудущихПериодов), "VID_RASH_BUD_PER",,ПараметрыВыполнения);	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РасходыБудущихПериодов.ВидРБП КАК ВидРБП,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_VID_RASH_BUD_PER.Аналитика)) КАК GUID
	|ИЗ
	|	ВТАналитики_VID_RASH_BUD_PER КАК ВТАналитики_VID_RASH_BUD_PER
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РасходыБудущихПериодов КАК РасходыБудущихПериодов
	|		ПО ВТАналитики_VID_RASH_BUD_PER.Аналитика = РасходыБудущихПериодов.Ссылка
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Значение = "";
		ВидРБП = Выборка.ВидРБП;
		Если ВидРБП = Перечисления.ВидыРБП.НеисключительныеПраваПользованияНМА Тогда
			Значение = "01";
		ИначеЕсли ВидРБП = Перечисления.ВидыРБП.ОсвоениеПриродныхРесурсов Тогда
			Значение = "02";
		ИначеЕсли ВидРБП = Перечисления.ВидыРБП.ДолгосрочноеСтрахованиеЖизни Тогда
			Значение = "03";
		ИначеЕсли ВидРБП = Перечисления.ВидыРБП.СтрахованиеНаОплатуМедицинскихРасходов Тогда
			Значение = "04";
		ИначеЕсли ВидРБП = Перечисления.ВидыРБП.СтрахованиеНаСлучайСмертиИУтратыРаботоспособности Тогда
			Значение = "05";
		ИначеЕсли ВидРБП = Перечисления.ВидыРБП.ПрочиеВидыСтрахования Тогда
			Значение = "06";
		ИначеЕсли ВидРБП = Перечисления.ВидыРБП.УбыткиОтРеализацииАмортизируемогоИмущества Тогда
			Значение = "07";
		ИначеЕсли ВидРБП = Перечисления.ВидыРБП.УбыткиПрошлыхЛет Тогда
			Значение = "08";
		ИначеЕсли ВидРБП = Перечисления.ВидыРБП.УбыткиПрошлыхЛетОбслуживающихПроизводствИХозяйств Тогда
			Значение = "09";
		ИначеЕсли ВидРБП = Перечисления.ВидыРБП.УпущеннаяВыгодаПоДоговорамАрендыНаЛьготныхУсловиях Тогда
			Значение = "10";
		ИначеЕсли ВидРБП = Перечисления.ВидыРБП.Прочие Тогда
			Значение = "11";
		КонецЕсли;
		
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_RASH_BUD_PER_" + Выборка.GUID, Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_RASH_BUD_PER"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();	 
	
КонецПроцедуры

Процедура VID_REZERV(МенеджерВТ, ПараметрыВыполнения)
	
	СтандартнаяОбработка = Истина;
	МодульСбораДанныхПереопределяемый.VID_REZERV(МенеджерВТ, ПараметрыВыполнения, СтандартнаяОбработка);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	СпецАналитикуВМенеджерВТ(МенеджерВТ, МодульОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПланыВидовХарактеристик.ВидыСубконто.Резервы), "VID_REZERV",,ПараметрыВыполнения);	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Резервы.ВидРезерва КАК ВидРезерва,
	|	ПредставлениеСсылки(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТАналитики_VID_REZERV.Аналитика)) КАК GUID
	|ИЗ
	|	ВТАналитики_VID_REZERV КАК ВТАналитики_VID_REZERV
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Резервы КАК Резервы
	|		ПО ВТАналитики_VID_REZERV.Аналитика = Резервы.Ссылка
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Значение = "08";
		ВидРезерва = Строка(Выборка.ВидРезерва);
		Если ВидРезерва = РезервОплатаОтпуска() Тогда
			Значение = "01";
		ИначеЕсли СтрНачинаетсяС(ВидРезерва, РезервВзносВнебюджет()) Тогда
			Значение = "02";
		ИначеЕсли ВидРезерва = РезервПретензии() Тогда
			Значение = "03";
		ИначеЕсли ВидРезерва = РезервРеструктуризация() Тогда
			Значение = "04";
		ИначеЕсли ВидРезерва = РезервГарантийныйРемонт() Тогда
			Значение = "05";
		ИначеЕсли ВидРезерва = РезервУбыточныйДоговор() Тогда
			Значение = "06";
		ИначеЕсли ВидРезерва = РезервДемонтажОС() Тогда
			Значение = "07";
		ИначеЕсли ВидРезерва = РезервИные() Тогда
			Значение = "08";
		КонецЕсли;
		ПараметрыВыполнения.СоответствиеПорядковыхНомеров.Вставить("VID_REZERV_" + Выборка.GUID, Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ВТАналитики_VID_REZERV"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Выполнить();	 
	
КонецПроцедуры

#КонецОбласти 

#Область Адрес

Процедура ЗаполнитьСтрокиАдреса(ТаблицаАдресов, Выгрузка, СтрокаКолонок)
	
	МодульОбщегоНазначенияКлиентСервер 					= ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	МодульУправлениеКонтактнойИнформациейКлиентСервер	= ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиентСервер");
	МодульУправлениеКонтактнойИнформацией 				= ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	МодульУправлениеКонтактнойИнформациейСлужебный		= ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформациейСлужебный");
	МодульРаботаСАдресами								= ОбщегоНазначения.ОбщийМодуль("РаботаСАдресами");
	
	Для Каждого текСтрока Из Выгрузка Цикл
		АдресСтрокой = текСтрока.ЗначенияПолей;
		Попытка
			Если НЕ МодульУправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(АдресСтрокой) Тогда
				АдресСтрокой = МодульУправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(АдресСтрокой, Перечисления.ТипыКонтактнойИнформации.Адрес);
				текСтрока.ЗначенияПолей = АдресСтрокой;
			КонецЕсли;                                 
			АдресИзJSON = МодульУправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(АдресСтрокой, Перечисления.ТипыКонтактнойИнформации.Адрес);
		Исключение
			ВызватьИсключение(СтрШаблон(НСтр("ru = 'Ошибка преобразования данных адреса:%1%2%1Представление: %3'"), Символы.ПС, АдресСтрокой, текСтрока.Представление) + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	МассивПолейЗначений = Выгрузка.ВыгрузитьКолонку("ЗначенияПолей");
	
	МассивРезультат = МодульРаботаСАдресами.СведенияОбАдресах(МассивПолейЗначений, Новый Структура("БезПредставлений", Истина)); 	
	
	
	
	
	Для НН = 0 По Выгрузка.Количество() - 1 Цикл
		Выборка = Выгрузка[НН];
		СтруктураАдреса = МассивРезультат[НН];
		новСтрока = ТаблицаАдресов.Добавить();
		
		п_Страна = СтруктураАдреса.Страна;
		
		новСтрока.STRANA			= ?(ПустаяСтрока(п_Страна), ?(ПустаяСтрока(Выборка.Страна), "РОССИЯ", Выборка.Страна), п_Страна);
		новСтрока.OKTMO 			= "";
		новСтрока.INDEX 			= Лев(?(ПустаяСтрока(СтруктураАдреса.Индекс), "000000", СтруктураАдреса.Индекс), 6);
		новСтрока.ADM_MUN_DELENIE 	= ?(СтруктураАдреса.ТипАдреса = "Административно-территориальный", "2", "1");
		новСтрока.ULICA_VID 		= СтруктураАдреса.УлицаСокращение + ?(ЗначениеЗаполнено(СтруктураАдреса.УлицаСокращение),".", "");
		новСтрока.ULICA 			= СтруктураАдреса.Улица;         
		
		новСтрока.DOM_VID 		= СтруктураАдреса.Здание.ТипЗдания;                                                         		
		новСтрока.DOM 			= СтруктураАдреса.Здание.Номер;                                                             
		
		Если Не СтруктураАдреса.Корпуса.Количество() = 0 Тогда  		
			
			ЭтоПервый 		= Истина;
			СтроениеВид 	= "";  
			Строение 		= "";
			Для Каждого текКорпус Из СтруктураАдреса.Корпуса Цикл
				Если ЭтоПервый Тогда
					СтроениеВид 	= текКорпус.ТипКорпуса; 
					Строение 		= текКорпус.Номер; 
					ЭтоПервый = Ложь;				
				Иначе                                  
					Строение 		= Строение + ", " + текКорпус.ТипКорпуса + " " +текКорпус.Номер; 
				КонецЕсли;
				Если СтрДлина(Строение) > 50 Тогда
					Прервать;	
				КонецЕсли;
			КонецЦикла;
			
			новСтрока.STROENIE_VID  = СтроениеВид;
			новСтрока.STROENIE		= ?(СтрДлина(Строение) > 50, Лев(Строение, 50), Строение); 
			
		КонецЕсли;
		
		Если Не СтруктураАдреса.Помещения.Количество() = 0 Тогда
			
			ЭтоПервый = Истина;
			ОфисВид 	= "";  
			Офис 		= "";
			
			Для Каждого текКорпус Из СтруктураАдреса.Помещения Цикл        
				Если ЭтоПервый Тогда
					ОфисВид 	= текКорпус.ТипПомещения; 
					Офис 		= текКорпус.Номер; 
					ЭтоПервый = Ложь;				
				Иначе                                  
					Офис 		= Офис + ", " + текКорпус.ТипПомещения + " " +текКорпус.Номер; 
				КонецЕсли;
				Если СтрДлина(Офис) > 50 Тогда
					Прервать;	
				КонецЕсли;
			КонецЦикла;			
			
			новСтрока.OFIS_VID  = ОфисВид;
			новСтрока.OFIS		 = ?(СтрДлина(Офис) > 50, Лев(Офис, 50), Офис);       
			
		КонецЕсли;
		
		
		ХешДеления = "";	
		
		
		новСтрока.REGION 		= СтруктураАдреса.РегионТипКраткий + ?(ЗначениеЗаполнено(СтруктураАдреса.РегионТипКраткий),". ", "")
		+ СтруктураАдреса.Регион;
		новСтрока.RAION 		= СтруктураАдреса.РайонТипКраткий + ?(ЗначениеЗаполнено(СтруктураАдреса.РайонТипКраткий),". ", "")
		+ СтруктураАдреса.Район;
		новСтрока.GOROD 		= СтруктураАдреса.ГородТипКраткий + ?(ЗначениеЗаполнено(СтруктураАдреса.ГородТипКраткий),". ", "")
		+ СтруктураАдреса.Город;
		новСтрока.NAS_PUNKT 	= СтруктураАдреса.НаселенныйПунктТипКраткий + ?(ЗначениеЗаполнено(СтруктураАдреса.НаселенныйПунктТипКраткий),". ", "")
		+ СтруктураАдреса.НаселенныйПункт;
		новСтрока.TERRITORIYA	= СтруктураАдреса.ТерриторияТипКраткий + ?(ЗначениеЗаполнено(СтруктураАдреса.ТерриторияТипКраткий),". ", "")
		+ СтруктураАдреса.Территория;
		
		ХешДеления = новСтрока.REGION + новСтрока.RAION + новСтрока.GOROD + новСтрока.NAS_PUNKT + новСтрока.TERRITORIYA;
		
		Если новСтрока.ADM_MUN_DELENIE = "1" Тогда
			
			новСтрока.MUN_RAION_OKRUG 	= СтруктураАдреса.МуниципальныйРайонТипКраткий + ?(ЗначениеЗаполнено(СтруктураАдреса.МуниципальныйРайонТипКраткий),". ", "")
			+ СтруктураАдреса.МуниципальныйРайон;													                     
			новСтрока.POSELENIE		= СтруктураАдреса.ПоселениеТипКраткий + ?(ЗначениеЗаполнено(СтруктураАдреса.ПоселениеТипКраткий),". ", "")
			+ СтруктураАдреса.Поселение;														
			ХешДеления = ХешДеления + новСтрока.MUN_RAION_OKRUG + новСтрока.POSELENIE;												
			
			новСтрока.ХЭШ_NAS_PUNKT_MUN = РассчитатьХешСтроки(ХешДеления);
		Иначе                                                            
			новСтрока.ХЭШ_NAS_PUNKT_ADM = РассчитатьХешСтроки(ХешДеления);		
		КонецЕсли; 
		новСтрока.ХЭШ = РассчитатьХешСтроки(Выборка.ЗначенияПолей + Выборка.Представление);		
	КонецЦикла;
	
	
КонецПроцедуры


#КонецОбласти

#Область ОпределениеЗначенияАналитики

Функция f_VID_RACH_ZAIM_KR(Аналитика, Выборка, ДтКт)
	
	ИмяПеречисления = "ВидыРасчетовПоЗаймам";
	Для НН = 1 По 3 Цикл
		Суффикс = ДтКт + Строка(НН);
		Если ТипЗнч(Выборка["Субконто" + Суффикс]) = Тип("ПеречислениеСсылка." + ИмяПеречисления) И ЗначениеЗаполнено(Выборка["Субконто" + Суффикс]) Тогда
			ВидРасчетовПоЗаймам = Выборка["Субконто" + Суффикс];
			Если ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг Тогда			
				Возврат "1";
			ИначеЕсли ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.Проценты Тогда			
				Возврат "2";
			ИначеЕсли ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.Штрафы Тогда			
				Возврат "3";
			ИначеЕсли ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.ПениНаОсновнойДолг Тогда			
				Возврат "4";
			ИначеЕсли ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.ПениНаПроценты Тогда			
				Возврат "5";
			ИначеЕсли ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.СтоимостьРазмещенияЦБ Тогда			
				Возврат "6";
			ИначеЕсли ВидРасчетовПоЗаймам = Перечисления.ВидыРасчетовПоЗаймам.ОтклонениеОтНоминала Тогда			
				Возврат "7";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "1";
	
КонецФункции

Функция МассивОбязательныхРеквизитовАналитики(Аналитика, ПараметрыВыполнения)
	
	Результат = Новый Массив;
	МассивСтрок = ПараметрыВыполнения.ТаблицаРеквизитовАналитик.НайтиСтроки(Новый Структура("Аналитика, Используется, Обязательный", Аналитика, Истина, Истина));
	Для Каждого Строка Из МассивСтрок Цикл 
		
		Результат.Добавить(Строка.Реквизит);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции  

Процедура ПроверитьОбязательностьРеквизитов(ПараметрыВыполнения, СтруктураРеквизитов, Аналитика, ПредставлениеСсылки, НН, МассивОбязательныхРеквизитов)   
	
	Для Каждого текРеквизит Из МассивОбязательныхРеквизитов Цикл
		Если текРеквизит = "Владелец" Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтруктураРеквизитов[текРеквизит]) Тогда 
			НН = НН + 1;
			новЗапись = ПараметрыВыполнения.НаборИсторияПроверкиАналитик.Добавить();
			новЗапись.Документ 			= ПараметрыВыполнения.ДокументСсылка;
			новЗапись.ВерсияФормата 	= ПараметрыВыполнения.ВерсияТаксономии;
			новЗапись.НомерЗаписи 		= НН; 
			новЗапись.ТипЗаписи 		= Перечисления.ТипыЗаписейМСД.РеквизитыАналитик;  
			новЗапись.ИмяАналитики 		= Аналитика;
			новЗапись.ДатаПроверки 		= ТекущаяДатаСеанса();
			новЗапись.Ошибка 			= Истина;
			новЗапись.ТекстСообщения 	= СтрШаблон(НСтр("ru = 'В аналитике %1 (%2) не заполнен реквизит %3'"), Аналитика, ПредставлениеСсылки, текРеквизит);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписьСобытияВЖурналРегистрации(ТекстСообщения, Уровень = Неопределено)
	
	Если Уровень = Неопределено Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'ВыгрузкаПакетаДляМСД'", ОбщегоНазначения.КодОсновногоЯзыка()), Уровень,,, ТекстСообщения, РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
	
КонецПроцедуры

Функция РассчитатьХешСтроки(Строка)
	
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеш.Добавить(Строка);
	
	Возврат НРег(СтрЗаменить(Хеш.ХешСумма, " ", ""));	
	
КонецФункции

Функция РеквизитыАналитик(Версия) 
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиРеквизитовАналитикМСД.Аналитика КАК Аналитика,
	|	НастройкиРеквизитовАналитикМСД.Реквизит КАК Реквизит,
	|	НастройкиРеквизитовАналитикМСД.Используется КАК Используется,
	|	НастройкиРеквизитовАналитикМСД.Обязательный КАК Обязательный
	|ИЗ
	|	РегистрСведений.НастройкиРеквизитовАналитикМСД КАК НастройкиРеквизитовАналитикМСД
	|ГДЕ
	|	НастройкиРеквизитовАналитикМСД.Версия = &Версия"); 
	Запрос.УстановитьПараметр("Версия", Версия);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

Функция НоваяТаблицаАдресов()
	
	Результат = Новый ТаблицаЗначений;   
	Результат.Колонки.Добавить("ID", 				Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("STRANA", 			Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	Результат.Колонки.Добавить("INDEX", 			Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(6)));
	Результат.Колонки.Добавить("OKTMO", 			Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(8)));
	Результат.Колонки.Добавить("ADM_MUN_DELENIE", 	Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1)));
	Результат.Колонки.Добавить("NAS_PUNKT_ADM", 	Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("NAS_PUNKT_MUN", 	Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("REGION", 			Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("RAION", 			Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("MUN_RAION_OKRUG", 	Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("POSELENIE", 		Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("GOROD", 			Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("NAS_PUNKT", 		Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("TERRITORIYA", 		Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("ULICA_VID", 		Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)));
	Результат.Колонки.Добавить("ULICA", 			Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(250)));
	Результат.Колонки.Добавить("DOM_VID", 			Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("DOM", 				Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("STROENIE_VID", 		Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("STROENIE", 			Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("OFIS_VID", 			Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("OFIS", 				Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	Результат.Колонки.Добавить("PREDSTAVLENIE", 	Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(500)));
	Результат.Колонки.Добавить("ХЭШ_NAS_PUNKT_ADM", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(40)));
	Результат.Колонки.Добавить("ХЭШ_NAS_PUNKT_MUN", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(40)));
	Результат.Колонки.Добавить("ХЭШ", 				Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	
	Возврат Результат;
	
	
КонецФункции

Функция СтруктураРеквизитовАналитики(Аналитика, ПараметрыВыполнения)
	
	Результат = Новый Структура;
	МассивСтрок = ПараметрыВыполнения.ТаблицаРеквизитовАналитик.НайтиСтроки(Новый Структура("Аналитика, Используется", Аналитика, Истина));
	Для Каждого Строка Из МассивСтрок Цикл 
		
		Результат.Вставить(Строка.Реквизит);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура пЗаполнитьЗначенияСвойств(Приемник, Источник)
	
	Для Каждого Элемент Из Источник Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Или Элемент.Ключ = "NAS_PUNKT_ADM" Или Элемент.Ключ = "NAS_PUNKT_MUN" Или Элемент.Ключ = "ED_IZM" Или Элемент.Ключ = "UCH_NOMER"
			Или Элемент.Ключ = "GLAVA" Или Элемент.Ключ = "KBK"	
			Тогда                  
			Попытка
				Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда 
					Приемник[Элемент.Ключ] = СокрЛП(Элемент.Значение);
				Иначе
					Приемник[Элемент.Ключ] = Элемент.Значение;
				КонецЕсли;
			Исключение  
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ЗаписьСобытияВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке), УровеньЖурналаРегистрации.Ошибка);				
			КонецПопытки;                       
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуИзСтруктуры(СтрокаРезультат, Структура, Разделитель = "")
	
	Для Каждого Элемент Из Структура Цикл
		СтрокаРезультат = СтрокаРезультат + Строка(Элемент.Значение) + Разделитель;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДанныеАналитикВ_МенеджерВТ(СоответствиеПорядковыхНомеров, МенеджерВТ)
	
	ТаблицаАналитик = Новый ТаблицаЗначений;
	
	ТаблицаАналитик.Колонки.Добавить("УИ_Субконто", Новый ОписаниеТипов("УникальныйИдентификатор")); 
	ТаблицаАналитик.Колонки.Добавить("УИ_Субконто_GRAF", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТаблицаАналитик.Колонки.Добавить("ИмяАналитики", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	ТаблицаАналитик.Колонки.Добавить("НомерПП", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150)));
	
	Для Каждого текЭлемент Из СоответствиеПорядковыхНомеров Цикл          
		Если Не Сред(текЭлемент.Ключ, СтрДлина(текЭлемент.Ключ) - 36, 1) = "_" Тогда
			Продолжить;
		КонецЕсли;
		ГУИД = Прав(текЭлемент.Ключ, 36);
		ИмяАналитики = Лев(текЭлемент.Ключ, СтрДлина(текЭлемент.Ключ) - 37);
		новСтрока = ТаблицаАналитик.Добавить();
		Если НЕ Найти(ГУИД, "-") = 0 Тогда 
			новСтрока.УИ_Субконто = Новый УникальныйИдентификатор(ГУИД);
		Иначе
			новСтрока.УИ_Субконто_GRAF = ГУИД;
			ГУИДБезТире = Лев(ГУИД, 32);
			ГУИДСТире = Лев(ГУИДБезТире, 8) + "-" + Сред(ГУИДБезТире, 9, 4) + "-" 
			+ Сред(ГУИДБезТире, 13, 4) + "-" + Сред(ГУИДБезТире, 17, 4) + "-" 
			+ Прав(ГУИДБезТире, 12);
			новСтрока.УИ_Субконто = Новый УникальныйИдентификатор(ГУИДСТире);
		КонецЕсли;	
		новСтрока.ИмяАналитики = ИмяАналитики;
		новСтрока.НомерПП = текЭлемент.Значение;
	КонецЦикла;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВТТаблица.УИ_Субконто КАК УИ_Субконто,
	|	ВТТаблица.УИ_Субконто_GRAF КАК УИ_Субконто_GRAF,
	|	ВТТаблица.ИмяАналитики КАК ИмяАналитики,
	|	ВТТаблица.НомерПП КАК НомерПП
	|ПОМЕСТИТЬ ВТТаблицаНомеровАналитик
	|ИЗ
	|	&Таблица КАК ВТТаблица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИмяАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТаблицаНомеровАналитик.УИ_Субконто КАК УИ_Субконто,
	|	ВТТаблицаНомеровАналитик.УИ_Субконто_GRAF КАК УИ_Субконто_GRAF,
	|	ВТТаблицаНомеровАналитик.ИмяАналитики КАК ИмяАналитики,
	|	ВТТаблицаНомеровАналитик.НомерПП КАК НомерПП
	|ПОМЕСТИТЬ ВТ_ЗначенияАналитик
	|ИЗ
	|	ВТИменаАналитик КАК ВТИменаАналитик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаНомеровАналитик КАК ВТТаблицаНомеровАналитик
	|		ПО (ВТТаблицаНомеровАналитик.ИмяАналитики = ВТИменаАналитик.ИмяАналитики)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВидыСубконтоАналитик КАК ВТ_ВидыСубконтоАналитик
	|		ПО (ВТТаблицаНомеровАналитик.ИмяАналитики = ВТ_ВидыСубконтоАналитик.ИмяАналитики)	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВидыРасчетовСПрочимиДебиторамиКредиторами.Ссылка),
	|	"""",
	|	""VID_FORM_RASH"",
	|	ПРЕДСТАВЛЕНИЕ(ВидыРасчетовСПрочимиДебиторамиКредиторами.Ссылка)
	|ИЗ
	|	Перечисление.ВидыРасчетовСПрочимиДебиторамиКредиторами КАК ВидыРасчетовСПрочимиДебиторамиКредиторами
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИмяАналитики,
	|	УИ_Субконто
	|"); 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Таблица", ТаблицаАналитик);
	Запрос.Выполнить();			
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииКомандПечати

Функция ПечатьПротокола(МассивОбъектов, ПараметрыПечати = Неопределено, ОбъектыПечати = Неопределено) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПротоколВыгрузки";
	
	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
	Макет = МодульУправлениеПечатью.МакетПечатнойФормы("Документ.ПакетыДанныхДляМСД.ПФ_MXL_ПротоколВыгрузки");
	
	ОбластьШапка 			=  Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаОстатки 	=  Макет.ПолучитьОбласть("ШапкаОстатки");
	ОбластьСтрокаОстатки 	=  Макет.ПолучитьОбласть("СтрокаОстатки");
	ОбластьШапкаОбороты 	=  Макет.ПолучитьОбласть("ШапкаОбороты");
	ОбластьСтрокаОбороты 	=  Макет.ПолучитьОбласть("СтрокаОбороты");
	ОбластьШапкаАналитики 	=  Макет.ПолучитьОбласть("ШапкаАналитики");
	ОбластьСтрокаАналитики 	=  Макет.ПолучитьОбласть("СтрокаАналитики");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПакетыДанныхДляМСД.Ссылка КАК Ссылка,
	|	ПакетыДанныхДляМСД.ВерсияТаксономии КАК ВерсияТаксономии,
	|	ПакетыДанныхДляМСД.ДатаУтвержденияТаксономии КАК ДатаУтвержденияТаксономии,
	|	ИсторияПроверкиАналитикМСД.ТипЗаписи КАК ТипЗаписи,
	|	ИсторияПроверкиАналитикМСД.КодСчета КАК КодСчета,
	|	ИсторияПроверкиАналитикМСД.ИмяАналитики КАК ИмяАналитики,
	|	ИсторияПроверкиАналитикМСД.ТекстСообщения КАК ОписаниеОшибки,
	|	ИсторияПроверкиАналитикМСД.ДатаПроверки КАК ДатаПроверки
	|ИЗ
	|	РегистрСведений.ИсторияПроверкиАналитикМСД КАК ИсторияПроверкиАналитикМСД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПакетыДанныхДляМСД КАК ПакетыДанныхДляМСД
	|		ПО ИсторияПроверкиАналитикМСД.Документ = ПакетыДанныхДляМСД.Ссылка
	|			И
	|			ПакетыДанныхДляМСД.Ссылка В(&МассивОбъектов)
	|ИТОГИ
	|	МАКСИМУМ(ВерсияТаксономии),
	|	МАКСИМУМ(ДатаУтвержденияТаксономии)
	|ПО
	|	Ссылка,
	|	ТипЗаписи"); 
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Для каждого СсылкаДокумент Из МассивОбъектов Цикл
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			ОбластьШапка.Параметры.Документ = Строка(СсылкаДокумент); 
			
			СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаДокумент, "ВерсияТаксономии, ДатаУтвержденияТаксономии");
			ОбластьШапка.Параметры.ВерсияФормата = СтрШаблон("%1 от %2", СтруктураРеквизитов.ВерсияТаксономии, Строка(СтруктураРеквизитов.ДатаУтвержденияТаксономии));
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			МодульУправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, СсылкаДокумент);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла; 
		
	Иначе	
		ВыборкаОбщий = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Отбор = Новый Структура("ТипЗаписи"); 
		
		Пока ВыборкаОбщий.Следующий() Цикл
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;			
			ОбластьШапка.Параметры.Документ = Строка(ВыборкаОбщий.Ссылка);
			ОбластьШапка.Параметры.ВерсияФормата = СтрШаблон("%1 от %2", ВыборкаОбщий.ВерсияТаксономии, Строка(ВыборкаОбщий.ДатаУтвержденияТаксономии));
			ТабличныйДокумент.Вывести(ОбластьШапка);
			ВыборкаТипов = ВыборкаОбщий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			/// аналитики		
			ВыборкаТипов.Сбросить();
			Отбор.ТипЗаписи = Перечисления.ТипыЗаписейМСД.РеквизитыАналитик;
			Если ВыборкаТипов.НайтиСледующий(Отбор) Тогда
				Выборка = ВыборкаТипов.Выбрать();      
				ОбластьШапкаАналитики.Параметры.Количество = Выборка.Количество();
				ТабличныйДокумент.Вывести(ОбластьШапкаАналитики);  
				ТабличныйДокумент.НачатьГруппуСтрок();
				Пока Выборка.Следующий() Цикл
					ОбластьСтрокаАналитики.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Вывести(ОбластьСтрокаАналитики);
				КонецЦикла;
				Выборка = Неопределено;
				ТабличныйДокумент.ЗакончитьГруппуСтрок();
				
			КонецЕсли;
			/// остатки		
			ВыборкаТипов.Сбросить();
			Отбор.ТипЗаписи = Перечисления.ТипыЗаписейМСД.НачальныйОстаток;
			Если ВыборкаТипов.НайтиСледующий(Отбор) Тогда   
				Выборка = ВыборкаТипов.Выбрать();
				ОбластьШапкаОстатки.Параметры.Период = "начало";
				ОбластьШапкаОстатки.Параметры.Количество = Выборка.Количество();			
				ТабличныйДокумент.Вывести(ОбластьШапкаОстатки); 
				ТабличныйДокумент.НачатьГруппуСтрок();
				
				Пока Выборка.Следующий() Цикл
					ОбластьСтрокаОстатки.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Вывести(ОбластьСтрокаОстатки);
				КонецЦикла;            
				Выборка = Неопределено;   
				ТабличныйДокумент.ЗакончитьГруппуСтрок();
				
			КонецЕсли;	
			ВыборкаТипов.Сбросить();
			Отбор.ТипЗаписи = Перечисления.ТипыЗаписейМСД.КонечныйОстаток;
			Если ВыборкаТипов.НайтиСледующий(Отбор) Тогда   
				Выборка = ВыборкаТипов.Выбрать();
				ОбластьШапкаОстатки.Параметры.Период = "конец";   
				ОбластьШапкаОстатки.Параметры.Количество = Выборка.Количество();			
				
				ТабличныйДокумент.Вывести(ОбластьШапкаОстатки);
				ТабличныйДокумент.НачатьГруппуСтрок();
				
				Пока Выборка.Следующий() Цикл
					ОбластьСтрокаОстатки.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Вывести(ОбластьСтрокаОстатки);
				КонецЦикла; 
				Выборка = Неопределено; 
				ТабличныйДокумент.ЗакончитьГруппуСтрок();
				
			КонецЕсли;			
			/// обороты
			ВыборкаТипов.Сбросить();
			Отбор.ТипЗаписи = Перечисления.ТипыЗаписейМСД.Обороты;
			Если ВыборкаТипов.НайтиСледующий(Отбор) Тогда   
				Выборка = ВыборкаТипов.Выбрать();   
				ОбластьШапкаОбороты.Параметры.Количество = Выборка.Количество();			
				ТабличныйДокумент.Вывести(ОбластьШапкаОбороты); 
				ТабличныйДокумент.НачатьГруппуСтрок();
				
				Пока Выборка.Следующий() Цикл
					ОбластьСтрокаОбороты.Параметры.Заполнить(Выборка);
					ТабличныйДокумент.Вывести(ОбластьСтрокаОбороты);
				КонецЦикла;            
				Выборка = Неопределено;
				ТабличныйДокумент.ЗакончитьГруппуСтрок();
				
			КонецЕсли;	
			
			МодульУправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаОбщий.Ссылка);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьТабличныйДокументПротоколСтраницы(Файл, Документ, ПериодФормат) Экспорт
	
	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xml");
	МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
	ДанныеФайла = МодульРаботаСФайлами.ДвоичныеДанныеФайла(Файл, Ложь);
	Если ДанныеФайла <> Неопределено Тогда
		ДанныеФайла.Записать(ИмяФайла);
	КонецЕсли;    
	
	Попытка 
		Чтение = Новый ЧтениеXML;
		Чтение.ОткрытьФайл(ИмяФайла); 
		ОбъектBody = ФабрикаXDTO.ПрочитатьXML(Чтение, ФабрикаXDTO.Тип("MSD_DATA_FHD/VerificationProtocol_1_0_1", "Body"));
	Исключение
		Чтение.Закрыть();
		Попытка  			
			Чтение = Новый ЧтениеXML;
			Чтение.ОткрытьФайл(ИмяФайла);
			ОбъектBody = ФабрикаXDTO.ПрочитатьXML(Чтение, ФабрикаXDTO.Тип("MSD_DATA_FHD/VerificationProtocol", "Body"));	
		Исключение
			Чтение.Закрыть();
			УдалитьФайлы(ИмяФайла);
			ЗаписьЖурналаРегистрации("МСД.ФормированиеПротоколаЗагрузкиПакета", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			Возврат Неопределено; 	
		КонецПопытки;
	КонецПопытки; 
	
	Чтение.Закрыть();
	УдалитьФайлы(ИмяФайла);
	
	МакетОшибки = ПолучитьМакет("ПФ_MXL_ПротоколЗагрузки_Ошибки");
	МакетПредупреждения = ПолучитьМакет("ПФ_MXL_ПротоколЗагрузки_Предупреждения");
	МакетТранспортнаяИнформация = ПолучитьМакет("ПФ_MXL_ПротоколЗагрузки_ТранспортнаяИнформация");
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
	
	ТабличныйДокументОшибки = Новый ТабличныйДокумент; 
	ТабличныйДокументПредупреждения = Новый ТабличныйДокумент;
	ТабличныйДокументТранспортнаяИнформация = Новый ТабличныйДокумент;
	
	ОбластьЗаголовокОшибки = МакетОшибки.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьЗаголовокПредупреждения = МакетПредупреждения.ПолучитьОбласть("ЗаголовокОтчета");
	ОбластьЗаголовокТранспортнаяИнформация = МакетТранспортнаяИнформация.ПолучитьОбласть("ЗаголовокОтчета");
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		ОбластьЗаголовокОшибки.Параметры.Документ = "Документ не сформирован";
		ОбластьЗаголовокПредупреждения.Параметры.Документ = "Документ не сформирован";
		ОбластьЗаголовокТранспортнаяИнформация.Параметры.Документ = "Документ не сформирован";
	Иначе
		ОбластьЗаголовокОшибки.Параметры.Документ = Документ;
		ОбластьЗаголовокПредупреждения.Параметры.Документ = Документ;
		ОбластьЗаголовокТранспортнаяИнформация.Параметры.Документ = Документ; 
		
	КонецЕсли;
	
	ТабличныйДокументОшибки.Вывести(ОбластьЗаголовокОшибки);
	ТабличныйДокументПредупреждения.Вывести(ОбластьЗаголовокПредупреждения);
	ТабличныйДокументТранспортнаяИнформация.Вывести(ОбластьЗаголовокТранспортнаяИнформация);
	
	#Область ИсторияОбработкиПакета
	
	ОбластьЗаголовокИстория = МакетТранспортнаяИнформация.ПолучитьОбласть("ЗаголовокИсторияПакета");
	ТабличныйДокументТранспортнаяИнформация.Вывести(ОбластьЗаголовокИстория);
	
	Если ЕстьСвойствоXDTO(ОбъектBody, "Partition1") Тогда
		
		ТабличныйДокументТранспортнаяИнформация.НачатьГруппуСтрок("История обработки пакетов данных");
		
		ОбластьИД = МакетТранспортнаяИнформация.ПолучитьОбласть("СтрокаИдентификаторПакета");
		
		ОбластьСтрока = МакетТранспортнаяИнформация.ПолучитьОбласть("СтрокаИсторияПакета");
		
		Partition1 = ПроверитьСформироватьСписокXDTO(ОбъектBody.Partition1);
		
		Для каждого текСтрока Из Partition1 Цикл 		 
			
			СведенияОПакете = СтрШаблон(
			"Идентификатор пакета: %1
			|Имя файла: %2",
			текСтрока.GUID,
			текСтрока.FileName);
			
			ДлинаИмени = СтрДлина(текСтрока.FileName);
			
			ЧастиНомера = СтрРазделить(Сред(текСтрока.FileName, ДлинаИмени-8, 5), "-");
			МодульСтроковыеФункцииКлиентСервер = ОбщегоНазначения.ОбщийМодуль("СтроковыеФункцииКлиентСервер");
			
			Если ЧастиНомера.Количество() = 2
				И МодульСтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЧастиНомера[0])
				И МодульСтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЧастиНомера[1]) Тогда
				ВсегоФайлов = Число(ЧастиНомера[1]);
				Если ВсегоФайлов > 1 Тогда
					СведенияОПакете = СведенияОПакете + Символы.ПС +
					СтрШаблон("Файл %1 из %2", Число(ЧастиНомера[0]), Число(ЧастиНомера[1]));
				КонецЕсли;
			КонецЕсли;
			
			ОбластьИД.Параметры.УникальныйИдентификатор = СведенияОПакете;
			ТабличныйДокументТранспортнаяИнформация.Вывести(ОбластьИД); 			
			
			ТабличныйДокументТранспортнаяИнформация.НачатьГруппуСтрок("Пакет " + текСтрока.GUID);
			
			Для Каждого текСтрокаDetail Из текСтрока.Details Цикл					
				ОбластьСтрока.Параметры.Дата = текСтрокаDetail.Date;
				ОбластьСтрока.Параметры.Статус = текСтрокаDetail.Status;
				Если  ЕстьСвойствоXDTO(текСтрокаDetail, "StatusMessage") Тогда
					ОбластьСтрока.Параметры.ТекстСообщения = текСтрокаDetail.StatusMessage;
				КонецЕсли;
				ТабличныйДокументТранспортнаяИнформация.Вывести(ОбластьСтрока);
			КонецЦикла;
			ТабличныйДокументТранспортнаяИнформация.Область(ТабличныйДокументТранспортнаяИнформация.ВысотаТаблицы, 1, ТабличныйДокументТранспортнаяИнформация.ВысотаТаблицы, 5).ГраницаСнизу = Линия;
			
			ТабличныйДокументТранспортнаяИнформация.ЗакончитьГруппуСтрок();
			
		КонецЦикла;
		
		ТабличныйДокументТранспортнаяИнформация.ЗакончитьГруппуСтрок();			
		
	КонецЕсли; 
	
	#КонецОбласти
	
	#Область ПроверкаЭлектроннойПодписи
	
	ОбластьЗаголовокЭП = МакетТранспортнаяИнформация.ПолучитьОбласть("ЗаголовокЭП");
	ТабличныйДокументТранспортнаяИнформация.Вывести(ОбластьЗаголовокЭП);
	
	Если ЕстьСвойствоXDTO(ОбъектBody, "Partition2") Тогда
		
		ТабличныйДокументТранспортнаяИнформация.НачатьГруппуСтрок("Проверки электронной подписи"); 
		
		ОбластьСтрока = МакетТранспортнаяИнформация.ПолучитьОбласть("СтрокаЭП");
		ОбластьИД = МакетТранспортнаяИнформация.ПолучитьОбласть("СтрокаИдентификаторПакета");
		
		Partition2 = ПроверитьСформироватьСписокXDTO(ОбъектBody.Partition2);
		
		Для Каждого текСтрока Из Partition2 Цикл 
			
			ОбластьИД.Параметры.УникальныйИдентификатор = текСтрока.GUID;
			ТабличныйДокументТранспортнаяИнформация.Вывести(ОбластьИД);
			
			ТабличныйДокументТранспортнаяИнформация.Область(ТабличныйДокументТранспортнаяИнформация.ВысотаТаблицы, 1, ТабличныйДокументТранспортнаяИнформация.ВысотаТаблицы, 5).ГраницаСнизу = Линия;
			
			ТабличныйДокументТранспортнаяИнформация.НачатьГруппуСтрок("Проверка электронной подписи пакета");
			
			Для Каждого текСтрокаDetails Из текСтрока.Details Цикл
				ОбластьСтрока.Параметры.ДатаПроверки = Формат(текСтрокаDetails.DateInspection, "ДФ=дд.ММ.гггг");
				ОбластьСтрока.Параметры.ИмяФайла = текСтрокаDetails.FileName;
				ОбластьСтрока.Параметры.ИмяФайлаПодписи = текСтрокаDetails.SigFileName;
				ОбластьСтрока.Параметры.ФайлПодписан = текСтрокаDetails.FileSigned; 
				ОбластьСтрока.Параметры.ПодписьДействительна = текСтрокаDetails.SigValid;
				ОбластьСтрока.Параметры.ТекстСообщения = текСтрокаDetails.ErrorDescription;
				ТабличныйДокументТранспортнаяИнформация.Вывести(ОбластьСтрока);
			КонецЦикла;
			ТабличныйДокументТранспортнаяИнформация.ЗакончитьГруппуСтрок(); 		
			
		КонецЦикла;
		
		ТабличныйДокументТранспортнаяИнформация.ЗакончитьГруппуСтрок();			
		
	КонецЕсли;
	
	#КонецОбласти 
	
	#Область Таксономия
	
	Если ЕстьСвойствоXDTO(ОбъектBody, "Partition3") Тогда 		
		
		ОбластьЗаголовокАналитик = МакетОшибки.ПолучитьОбласть("ЗаголовокПроверкаАналитик");
		ТабличныйДокументОшибки.Вывести(ОбластьЗаголовокАналитик);
		
		Partition3 = ПроверитьСформироватьСписокXDTO(ОбъектBody.Partition3);
		
		Для каждого текСтрока Из Partition3 Цикл
			
			Если ЕстьСвойствоXDTO(текСтрока, "BlockingErr") Тогда
				ЗаполнитьОбластьТаксономии(МакетОшибки, ТабличныйДокументОшибки, текСтрока.BlockingErr, "Ошибка");
			КонецЕсли;
			
			ОбластьЗаголовокАналитик = МакетПредупреждения.ПолучитьОбласть("ЗаголовокПроверкаАналитик");
			ТабличныйДокументПредупреждения.Вывести(ОбластьЗаголовокАналитик);
			
			Если ЕстьСвойствоXDTO(текСтрока, "Notifications") Тогда
				ЗаполнитьОбластьТаксономии(МакетПредупреждения, ТабличныйДокументПредупреждения, текСтрока.Notifications, "Предупреждение");
			КонецЕсли; 	
			
		КонецЦикла;
		
	КонецЕсли;				
	
	#КонецОбласти
	
	#Область ПроверкаКонтрольныхСоотношений
	
	Если ЕстьСвойствоXDTO(ОбъектBody, "Partition5") Тогда
		
		//БлокирующиеКС
		ОбластьЗаголовокАналитик = МакетОшибки.ПолучитьОбласть("ЗаголовокПроверкаКС");
		ОбластьЗаголовокАналитик.Параметры.Заголовок = "Проверка блокирующих контрольных соотношений";
		ТабличныйДокументОшибки.Вывести(ОбластьЗаголовокАналитик);
		
		ТабличныйДокументОшибки.НачатьГруппуСтрок("Проверка блокирующих контрольных соотношений");
		
		ЗаполнитьОбластьКС(МакетОшибки, ОбъектBody, ТабличныйДокументОшибки, "Ошибка");
		
		ТабличныйДокументОшибки.ЗакончитьГруппуСтрок();	
		
		//ПредупреждающиеКС
		ОбластьЗаголовокАналитик = МакетПредупреждения.ПолучитьОбласть("ЗаголовокПроверкаКС");
		ОбластьЗаголовокАналитик.Параметры.Заголовок = "Проверка предупреждающих контрольных соотношений";
		ТабличныйДокументПредупреждения.Вывести(ОбластьЗаголовокАналитик);
		
		ТабличныйДокументПредупреждения.НачатьГруппуСтрок("Проверка предупреждающих контрольных соотношений");
		
		ЗаполнитьОбластьКС(МакетПредупреждения, ОбъектBody, ТабличныйДокументПредупреждения, "Предупреждение");
		
		ТабличныйДокументПредупреждения.ЗакончитьГруппуСтрок();
		
	КонецЕсли;
	
	#КонецОбласти 
	
	#Область ПроверкаНСИ
	
	Если ЕстьСвойствоXDTO(ОбъектBody, "Partition4") Тогда
		
		ОбластьЗаголовокНСИ = МакетОшибки.ПолучитьОбласть("ЗаголовокНСИБезЗМ");
		ТабличныйДокументОшибки.Вывести(ОбластьЗаголовокНСИ);
		
		Partition4 = ПроверитьСформироватьСписокXDTO(ОбъектBody.Partition4);
		
		Для каждого текСтрока Из Partition4 Цикл
			
			Если ЕстьСвойствоXDTO(текСтрока, "NoRequestMechanism") Тогда
				ЗаполнитьОбластьНСИ(МакетОшибки, ТабличныйДокументОшибки, текСтрока.NoRequestMechanism);		
			КонецЕсли;
			
			ОбластьЗаголовокНСИ = МакетОшибки.ПолучитьОбласть("ЗаголовокНСИСЗМ");
			ТабличныйДокументОшибки.Вывести(ОбластьЗаголовокНСИ);
			
			Если ЕстьСвойствоXDTO(текСтрока, "RequestMechanism") Тогда
				ЗаполнитьОбластьНСИ(МакетОшибки, ТабличныйДокументОшибки, текСтрока.RequestMechanism);		
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецОбласти 
	
	ТабличныйДокументМассив = Новый Массив;
	ТабличныйДокументМассив.Добавить(Новый Структура("ТабличныйДокумент, ИмяМакета, СинонимМакета", ТабличныйДокументОшибки, "Ошибки", "Ошибки")); 
	ТабличныйДокументМассив.Добавить(Новый Структура("ТабличныйДокумент, ИмяМакета, СинонимМакета", ТабличныйДокументПредупреждения, "Предупреждения", "Предупреждения"));
	ТабличныйДокументМассив.Добавить(Новый Структура("ТабличныйДокумент, ИмяМакета, СинонимМакета", ТабличныйДокументТранспортнаяИнформация, "ТранспортнаяИнформация", "Транспортная информация"));
	Возврат ТабличныйДокументМассив;
	
КонецФункции

Процедура ЗаполнитьОбластьКС(Макет, ОбъектBody, ТабличныйДокумент, Результат)
	
	МассивКодКС = Новый Массив; 
	СообщенияПоКодуКС = Новый Соответствие;
	
	Для Каждого текСтрока Из ОбъектBody.Partition5 Цикл
		Условие = ?(Результат = "Ошибка", текСтрока.isBlockingErr, НЕ текСтрока.isBlockingErr);
		Если Условие Тогда 
			МассивКодКС.Добавить(текСтрока.Code);			
			Сообщения = Новый Массив;			
			Для Каждого СтрокаMessage Из текСтрока.Message Цикл
				Если ЗначениеЗаполнено(СтрокаMessage.DetailErrorDescription) Тогда
					Сообщения.Добавить(СтрокаMessage.DetailErrorDescription);
				КонецЕсли; 
			КонецЦикла;				
			Если Сообщения.Количество() Тогда
				СообщенияПоКодуКС.Вставить(текСтрока.Code, Сообщения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Если НЕ МассивКодКС.Количество() Тогда
		Возврат;	
	КонецЕсли;	
	
	ДанныеДляПечатиКС = Справочники.КонтрольныеСоотношенияМСД.ПолучитьДанныеДляПечати(Неопределено, Неопределено, МассивКодКС);	 
	
	ТабличныйДокумент.НачатьГруппуСтрок();
	
	ДополнительныеПараметры = Справочники.КонтрольныеСоотношенияМСД.ПолучитьДополнительныеПараметрыПроверки();
	ДополнительныеПараметры.Результат = Результат; 
	ДополнительныеПараметры.СообщенияПоКодуКС = СообщенияПоКодуКС;
	
	Если ДанныеДляПечатиКС.Строки.Количество() Тогда
		Для Каждого ДанныеВидКС Из ДанныеДляПечатиКС.Строки Цикл			
			ЭтоФЛК = (ДанныеВидКС.ВидКонтрольногоСоотношения = "ФЛК");			
			ОбластьСтрока = ?(ЭтоФЛК, Макет.ПолучитьОбласть("СтрокаФЛК"), Макет.ПолучитьОбласть("СтрокаДок")); 
			ДополнительныеПараметры.ЭтоФЛК = ЭтоФЛК;
			Справочники.КонтрольныеСоотношенияМСД.ВывестиДанныеВТабличныйДокумент(ДанныеВидКС, ОбластьСтрока, Макет, ТабличныйДокумент, ДополнительныеПараметры);				
		КонецЦикла; 
	Иначе
		Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
		
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаКС");
		ОбластьТекстСообщения = Макет.ПолучитьОбласть("ТекстСообщенияКС");
		
		Для Каждого текСтрока Из ОбъектBody.Partition5 Цикл
			Условие = ?(Результат = "Ошибка", текСтрока.isBlockingErr, НЕ текСтрока.isBlockingErr);
			Если Условие Тогда
				ОбластьСтрока.Параметры.Наименование = текСтрока.Name;
				Если ЗначениеЗаполнено(текСтрока.Description) Тогда
					ОбластьСтрока.Параметры.Наименование = СтрШаблон("%1: %2", текСтрока.Name, текСтрока.Description);
				КонецЕсли;
				ОбластьСтрока.Параметры.Код = текСтрока.Code;
				ОбластьСтрока.Параметры.Результат = Результат; 
				ТабличныйДокумент.Вывести(ОбластьСтрока); 
				
				ТабличныйДокумент.НачатьГруппуСтрок(текСтрока.Name);				
				Для Каждого СтрокаMessage Из текСтрока.Message Цикл
					ОбластьТекстСообщения.Параметры.ТекстСообщения = СтрокаMessage.DetailErrorDescription; 
					ТабличныйДокумент.Вывести(ОбластьТекстСообщения);
				КонецЦикла;	
				ТабличныйДокумент.ЗакончитьГруппуСтрок();	
			КонецЕсли;
			ТабличныйДокумент.Область(ТабличныйДокумент.ВысотаТаблицы, 1, ТабличныйДокумент.ВысотаТаблицы, 5).ГраницаСнизу = Линия;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры	

Функция ЕстьСвойствоXDTO(ОбъектXDTO, ИмяСвойства)
	
	Возврат ОбъектXDTO.Свойства().Получить(ИмяСвойства) <> Неопределено;
	
КонецФункции 

#КонецОбласти

Функция ПроверитьСформироватьСписокXDTO(СписокXDTO)
	
	Результат = Новый Массив;
	Если ТипЗнч(СписокXDTO) = Тип("СписокXDTO") Тогда
		Результат = СписокXDTO;
	Иначе
		Результат.Добавить(СписокXDTO);		 
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьОбластьНСИ(Макет, ТабличныйДокумент, СписокXDTO)
	
	ТабличныйДокумент.НачатьГруппуСтрок("Проверка нормативно-справочной информации");
	
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаНСИ");
	ОбластьТекстСообщения = Макет.ПолучитьОбласть("ТекстСообщенияНСИ");
	
	
	Для каждого текНСИ ИЗ СписокXDTO Цикл 
		
		ПредыдущееЗначение = "";	
		
		Для каждого текСтрока ИЗ текНСИ.NSI Цикл
			Если НЕ ПредыдущееЗначение = текСтрока.ClassifierName Тогда
				ПредыдущееЗначение = текСтрока.ClassifierName;
				ОбластьСтрока.Параметры.ИдентификаторОбъектаНСИ = текСтрока.ClassifierName;
				ОбластьСтрока.Параметры.Результат = "Ошибка";
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			КонецЕсли;	
			ОбластьТекстСообщения.Параметры.Значение = текСтрока.Value; 
			ОбластьТекстСообщения.Параметры.ТекстСообщения = текСтрока.DetailErrorDescription;						
			ТабличныйДокумент.Вывести(ОбластьТекстСообщения);					
		КонецЦикла;
		
	КонецЦикла;
	
	ТабличныйДокумент.ЗакончитьГруппуСтрок();
	
КонецПроцедуры	

Процедура ЗаполнитьОбластьТаксономии(Макет, ТабличныйДокумент, СписокXDTO, Результат)
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
	
	ТабличныйДокумент.НачатьГруппуСтрок("Проверка аналитик");
	
	ОбластьТипЗаписи		= Макет.ПолучитьОбласть("СтрокаТипЗаписи");
	ОбластьСтрока			= Макет.ПолучитьОбласть("СтрокаАналитика");
	ОбластьСтрокаСообщение	= Макет.ПолучитьОбласть("СтрокаСообщениеАналитика");	
	
	Для каждого СтрокаPart3 ИЗ СписокXDTO Цикл
		
		ОбластьТипЗаписи.Параметры.ТипЗаписи = СтрокаPart3.DataType;
		ТабличныйДокумент.Вывести(ОбластьТипЗаписи);
		
		ТабличныйДокумент.НачатьГруппуСтрок("Проверка аналитик - " + СтрокаPart3.DataType);
		
		Account = ПроверитьСформироватьСписокXDTO(СтрокаPart3.Account);
		
		Для каждого СтрокаAccount ИЗ Account Цикл
			
			НомерСтроки = ТабличныйДокумент.ВысотаТаблицы;
			
			RecordAnalytics = ПроверитьСформироватьСписокXDTO(СтрокаAccount.RecordAnalytics);
			
			Для каждого СтрокаRecordAnalytics ИЗ  RecordAnalytics Цикл
				
				ОбластьСтрока.Параметры.КодСчета = СтрокаAccount.AccountCode; 
				ОбластьСтрока.Параметры.Результат = Результат;
				ОбластьСтрока.Параметры.ИмяАналитики = СтрШаблон("Проверка на заполнение обязательной аналитики ""%1""", СтрокаRecordAnalytics.AnalyticName);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
				Message = ПроверитьСформироватьСписокXDTO(СтрокаRecordAnalytics.Message);
				
				Если Message.Количество() > 0 Тогда
					
					ТабличныйДокумент.НачатьГруппуСтрок();
					
					Для каждого СтрокаMessage ИЗ Message Цикл
						
						ОбластьСтрокаСообщение.Параметры.ТекстСообщения = СтрокаMessage.DetailErrorDescription;
						ТабличныйДокумент.Вывести(ОбластьСтрокаСообщение);  
						
					КонецЦикла;
					
					ТабличныйДокумент.ЗакончитьГруппуСтрок();
					
				КонецЕсли;
				
			КонецЦикла;
			
			ТабличныйДокумент.Область(НомерСтроки+1, 1, ТабличныйДокумент.ВысотаТаблицы, 1).Объединить();
			ТабличныйДокумент.Область(ТабличныйДокумент.ВысотаТаблицы, 1, ТабличныйДокумент.ВысотаТаблицы, 5).ГраницаСнизу = Линия;
			
		КонецЦикла;
		
		ТабличныйДокумент.ЗакончитьГруппуСтрок();
		
	КонецЦикла;
	
	ТабличныйДокумент.ЗакончитьГруппуСтрок();
	
КонецПроцедуры	  

Функция ТекстСвязейСВидамиСубконто()
	Возврат 
	#Область ТекстЗапроса	
	"
	|ВЫБРАТЬ
	|	""ORGANIZATION"" КАК ИмяАналитики,
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка) КАК ВидСубконто
	|ПОМЕСТИТЬ ВТ_ВидыСубконтоАналитик
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""OS"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""KONTRAGENT"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""KONTRAGENT"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.КорреспондентыПоВнутреннимРасчетам)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""OSN_RASCH"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""OSN_RASCH"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ПринятыеОбязательства)		
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""NMA"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""NPA"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""MZ_BIO"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""KAP_VL_OS_NMA_NPA"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_ZATRAT"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ВидыЗатрат)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""KAP_VL_MZ"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""GRAF_AMORT"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""SCHET"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ЛицевыеСчета)   
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""SCHET"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.РазделыЛицевыхСчетов)		
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_DEN_DOC"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ВидыДенежныхДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""OBJ_FIN_VL"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""GRAF_ISP"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_PLAT_BUDJ"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ВидыНалоговИПлатежей)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ADM_BUDJ"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.НалогиИПлатежиОрганизации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_UDERJ"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ВидыУдержаний)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""BSO"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.БСО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""OS_V_PUTI"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""OS_NMA_NPA_KAZNA"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""OS_NMA_NPA_ARENDA"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""MOL_SOTRUDNIK"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_POST"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ВидыОбязательств)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""MESTO_ADDR_NFA"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_DOH_BUD_PER"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_RASH_PODOTCHET"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ВидыРасчетовСПЛ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""TIP_IMUCH_ZAB"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""TIP_IMUCH_ZAB"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""KOD_CELI"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ВидыЦелевыхСредств)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""MESTO_ROZN"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""PRICH_OSH"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ПричиныОшибокПрошлыхЛет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""REG_NOMER_GARANT"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""UCH_NOMER_DO"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_IMUCH"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_IMUCH_ZAB"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_OBESPECH"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ВидыОбеспечения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_RACH_ZAIM_KR"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ВидыРасчетовПоЗаймам)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_RASH_BUD_PER"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.РасходыБудущихПериодов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_REZERV"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.Резервы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""VID_FORM_RASH"",
	|	Значение(ПланВидовХарактеристик.ВидыСубконто.ВидыРасчетовСПрочимиДебиторамиКредиторами)
	|ИНДЕКСИРОВАТЬ ПО 
	|	ИмяАналитики
	|;
	| /////////////////////////////////////////////////////////////
	|";
	#КонецОбласти
	
КонецФункции

Функция РезервОплатаОтпуска()
	Возврат "Резерв на оплату отпусков";	
КонецФункции

Функция РезервВзносВнебюджет()
	Возврат "Резервы по взносам во внебюджетные фонды на суммы резерва очередных отпусков";	
КонецФункции 

Функция РезервПретензии()
	Возврат "Резерв по претензиям, искам";	
КонецФункции 

Функция РезервРеструктуризация()
	Возврат "Резерв по реструктуризации";	
КонецФункции 

Функция РезервГарантийныйРемонт()
	Возврат "Резерв по гарантийному ремонту";	
КонецФункции 

Функция РезервУбыточныйДоговор()
	Возврат "Резерв по убыточным договорным обязательствам";	
КонецФункции 

Функция РезервДемонтажОС()
	Возврат "Резерв на демонтаж и вывод основных средств из эксплуатации";	
КонецФункции   

Функция РезервИные()
	Возврат "Иные резервы";	
КонецФункции 

Функция ПолучитьМассивСчетовПерезагружаемые(ПараметрыВыполнения) 
	
	ЗапросСчетов = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиВыгрузкиАналитикМСД.Счет КАК Счет
	|ИЗ
	|	РегистрСведений.НастройкиВыгрузкиАналитикМСД КАК НастройкиВыгрузкиАналитикМСД
	|ГДЕ
	|	НастройкиВыгрузкиАналитикМСД.Версия = &Версия
	|	И НастройкиВыгрузкиАналитикМСД.Организация = &Организация
	|	И (НастройкиВыгрузкиАналитикМСД.ВОстатках1
	|				И НЕ НастройкиВыгрузкиАналитикМСД.ВОборотах1
	|			ИЛИ НастройкиВыгрузкиАналитикМСД.ВОстатках2
	|				И НЕ НастройкиВыгрузкиАналитикМСД.ВОборотах2
	|			ИЛИ НастройкиВыгрузкиАналитикМСД.ВОстатках3
	|				И НЕ НастройкиВыгрузкиАналитикМСД.ВОборотах3
	|			ИЛИ НастройкиВыгрузкиАналитикМСД.ВОстатках4
	|				И НЕ НастройкиВыгрузкиАналитикМСД.ВОборотах4
	|			ИЛИ НастройкиВыгрузкиАналитикМСД.ВОстатках5
	|				И НЕ НастройкиВыгрузкиАналитикМСД.ВОборотах5
	|			ИЛИ НастройкиВыгрузкиАналитикМСД.ВОстатках6
	|				И НЕ НастройкиВыгрузкиАналитикМСД.ВОборотах6)");
	ЗапросСчетов.УстановитьПараметр("Версия", ПараметрыВыполнения.ВерсияТаксономии);		
	ЗапросСчетов.УстановитьПараметр("Организация", ПараметрыВыполнения.Организация);	
	ВыборкаСчетов = ЗапросСчетов.Выполнить().Выгрузить();
	МассивСчетовПерезагружаемые = ОбщегоНазначения.ВыгрузитьКолонку(ВыборкаСчетов, "Счет", Истина);
	Возврат МассивСчетовПерезагружаемые;
	
КонецФункции

Функция ПолучитьТекстЗапросаТипКБК(ИмяТаблицы)
	
	ТекстЗапроса = "ВЫБОР
	|		КОГДА %1.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыКБК.КДБ)
	|			ТОГДА ""1""
	|		КОГДА %1.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыКБК.КРБ)
	|			ТОГДА ""2""
	|		КОГДА %1.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыКБК.КИФ)
	|			ТОГДА ""3""
	|		КОГДА %1.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыКБК.гКБК)
	|			ТОГДА ""4""
	|		КОГДА %1.ВидПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыКБК.АУИБУ)
	|			ТОГДА ВЫБОР
	|				КОГДА %1.УточнениеПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыКБК.КДБ)
	|					ТОГДА ""6""
	|				КОГДА %1.УточнениеПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыКБК.КРБ)
	|					ТОГДА ""7""
	|				КОГДА %1.УточнениеПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыКБК.КИФ)
	|					ТОГДА ""8""
	|				КОГДА %1.УточнениеПоказателя = ЗНАЧЕНИЕ(Перечисление.ВидыКБК.гКБК)
	|					ТОГДА ""9""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ";
	Возврат СтрШаблон(ТекстЗапроса, ИмяТаблицы);
	
КонецФункции	

Функция ПолучитьСтруктуруПерезагружаемыйПериод()
	
	СтруктураПериод = Новый Структура;
	СтруктураПериод.Вставить("ИмяВТ");
	СтруктураПериод.Вставить("ИмяПараметрДата");
	СтруктураПериод.Вставить("ОкончаниеПериода"); 
	СтруктураПериод.Вставить("ЭтоГраница");
	Возврат СтруктураПериод;
	
КонецФункции	

Функция ПолучитьТекстЗапросаАналитик(ПараметрыВыполнения)
	
	ЕстьПерезагружаемыеПериоды = Булево(ПараметрыВыполнения.ПерезагружаемыеПериоды.Количество());	
	
	Если ПараметрыВыполнения.ПакетныйРежимВыгрузки Тогда
		ШаблонУсловия = 	
		"ГДЕ
		|	%ИмяТаблицы.ВидСубконто%СуффиксВС В (&МассивВидовСубконто)
		|	И (%ИмяТаблицы.Аналитика%Суффикс1 В (&АналитикиСтрокой)
		|			ИЛИ %ИмяТаблицы.Аналитика%Суффикс2 В (&АналитикиСтрокой)
		|			ИЛИ %ИмяТаблицы.Аналитика%Суффикс3 В (&АналитикиСтрокой)
		|			ИЛИ %ИмяТаблицы.Аналитика%Суффикс4 В (&АналитикиСтрокой)
		|			ИЛИ %ИмяТаблицы.Аналитика%Суффикс5 В (&АналитикиСтрокой)
		|			ИЛИ %ИмяТаблицы.Аналитика%Суффикс6 В (&АналитикиСтрокой))";
	КонецЕсли;
	
	ТекстЗапроса = "";
	ИмяТаблицы = "ВТОбороты";
	ПолучитьПервый = Истина;
	
	Для ИтерацияСуффикс = 1 По 2 Цикл
		Суффикс = ?(ИтерацияСуффикс = 1, "Дт", "Кт");
		Для Итерация = 1 По 4 Цикл
			
			ШаблонИтерация = ПолучитьШаблонТекстаЗапросаАналитик(ПолучитьПервый);
			ПолучитьПервый = Ложь;
			ТекстЗапросаИтерация = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ШаблонИтерация, "%СуффиксС", Суффикс + Итерация), "%СуффиксВС", Суффикс + Итерация), "%Суффикс", Суффикс), "%ИмяТаблицы", ИмяТаблицы);
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаИтерация  
			+ СтрЗаменить(СтрЗаменить(СтрЗаменить(ШаблонУсловия, "%СуффиксВС", Суффикс + Итерация), "%Суффикс", Суффикс), "%ИмяТаблицы", ИмяТаблицы) + "
			|
			|ОБЪЕДИНИТЬ ВСЕ";	
			
		КонецЦикла;
	КонецЦикла; 
	
	Для ИтерацияОстатки = 1 По 2 Цикл
		Если ИтерацияОстатки = 1 Тогда
			ИмяТаблицы = "ВТОстатки";	  
		Иначе
			Если ЕстьПерезагружаемыеПериоды Тогда
				ИмяТаблицы = "ВТОстаткиПерезагружаемые";
			Иначе 
				Прервать;	
			КонецЕсли;		  
		КонецЕсли;  
		
		Для Итерация = 1 По 4 Цикл
			
			ШаблонИтерация = ПолучитьШаблонТекстаЗапросаАналитик();
			ТекстЗапросаИтерация = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(ШаблонИтерация, "%СуффиксС", Строка(Итерация) + "1"), "%СуффиксВС", Строка(Итерация)), "%Суффикс", ""), "%ИмяТаблицы", ИмяТаблицы);
			ТекстЗапроса = ТекстЗапроса + ТекстЗапросаИтерация  
			+ СтрЗаменить(СтрЗаменить(СтрЗаменить(ШаблонУсловия, "%СуффиксВС", Строка(Итерация)), "%Суффикс", ""), "%ИмяТаблицы", ИмяТаблицы) 
			+ ?(?(ЕстьПерезагружаемыеПериоды, ИмяТаблицы = "ВТОстаткиПерезагружаемые", ИмяТаблицы = "ВТОстатки") И Итерация = 4, "
			|
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////","
			|
			|ОБЪЕДИНИТЬ ВСЕ");
			
		КонецЦикла; 
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТАналитикаОбщий.Аналитика КАК Аналитика,
	|	ВТАналитикаОбщий.ВидСубконто КАК ВидСубконто,
	|	ВТАналитикаОбщий.Аналитика1 КАК Аналитика1,
	|	ВТАналитикаОбщий.Аналитика2 КАК Аналитика2,
	|	ВТАналитикаОбщий.Аналитика3 КАК Аналитика3,
	|	ВТАналитикаОбщий.Аналитика4 КАК Аналитика4,
	|	ВТАналитикаОбщий.Аналитика5 КАК Аналитика5,
	|	ВТАналитикаОбщий.Аналитика6 КАК Аналитика6
	|ПОМЕСТИТЬ ВТАналитики
	|ИЗ
	|	ВТАналитикаРазвернутая КАК ВТАналитикаОбщий" + ?(ПараметрыВыполнения.ПакетныйРежимВыгрузки, "", "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОстатки.Организация КАК Аналитика,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка) КАК ВидСубконто,
	|	"""" КАК Аналитика1,
	|	"""" КАК Аналитика2,
	|	"""" КАК Аналитика3,
	|	"""" КАК Аналитика4,
	|	"""" КАК Аналитика5,
	|	"""" КАК Аналитика6
	|ИЗ
	|	ВТОстаткиБезСубконто4 КАК ВТОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТОбороты.Организация,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка),
	|	"""" КАК Аналитика1,
	|	"""" КАК Аналитика2,
	|	"""" КАК Аналитика3,
	|	"""" КАК Аналитика4,
	|	"""" КАК Аналитика5,
	|	"""" КАК Аналитика6
	|ИЗ
	|	ВТОборотыБезСубконто4 КАК ВТОбороты") + " 
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТАналитикаРазвернутая
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьШаблонТекстаЗапросаАналитик(Первый = Ложь)
	
	ШаблонТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	%ИмяТаблицы.Субконто%СуффиксС" 		+ ?(Первый, " КАК Аналитика", "") + ",
	|	%ИмяТаблицы.ВидСубконто%СуффиксВС" 	+ ?(Первый, " КАК ВидСубконто", "") + ",
	|	%ИмяТаблицы.Аналитика%Суффикс1" 	+ ?(Первый, " КАК Аналитика1", "") + ",
	|	%ИмяТаблицы.Аналитика%Суффикс2" 	+ ?(Первый, " КАК Аналитика2", "") + ",
	|	%ИмяТаблицы.Аналитика%Суффикс3" 	+ ?(Первый, " КАК Аналитика3", "") + ",
	|	%ИмяТаблицы.Аналитика%Суффикс4" 	+ ?(Первый, " КАК Аналитика4", "") + ",
	|	%ИмяТаблицы.Аналитика%Суффикс5" 	+ ?(Первый, " КАК Аналитика5", "") + ",
	|	%ИмяТаблицы.Аналитика%Суффикс6" 	+ ?(Первый, " КАК Аналитика6", "") 
	+ ?(Первый, "
	|ПОМЕСТИТЬ ВТАналитикаРазвернутая", "") + "
	|ИЗ
	|	%ИмяТаблицы КАК %ИмяТаблицы
	|";
	Возврат ШаблонТекстЗапроса;
	
КонецФункции	

Функция ИспользоватьСхемуВыгрузки2026(Дата) 
	Возврат КонецДня(Дата) >= Дата(2025,12,31,23,59,59);	
КонецФункции

Функция ЗаполнитьОбластьПересчетОстатков(ОбластьСтрока, Выборка, ИмяПоля = "", ПерваяИтерация = Ложь)
	
	Если ПерваяИтерация Тогда
		ОбластьСтрока.Параметры[ИмяПоля] = Выборка[ИмяПоля];	
	Иначе
		ОбластьСтрока.Параметры[ИмяПоля + "СальдоНаКонецДт"]  = Выборка.СуммаДт;
		ОбластьСтрока.Параметры[ИмяПоля + "СальдоНаКонецКт"]  = Выборка.СуммаКт;
	КонецЕсли;
	
КонецФункции   

Процедура ЗаполнитьXDTOПоТаблице_Остатки(ТаблицаДанных, ЗаписьXML, ПараметрыВыполнения)
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Запрос остатков - выполнено, начало записи в файл'"));
	
	ВсегоЗаписей = ТаблицаДанных.Количество();
	Если ВсегоЗаписей > 0 Тогда
		Для Сч = 1 По ВсегоЗаписей Цикл
			Выборка = ТаблицаДанных[0];	
			ОбъектDataBalance = ПараметрыВыполнения.текФабрикаXDTO.Создать(ПараметрыВыполнения.текФабрикаXDTO.Тип(ПараметрыВыполнения.ПространствоИменПакет, "DataBalanceRecord"));
			ОбъектDataBalance.ORGANIZATION = Выборка.ORGANIZATION;
			ОбъектDataBalance.Date = Выборка.Date;
			ОбъектDataBalance.Account = Выборка.Account;
			ОбъектDataBalance.KFO = Выборка.KFO;
			ОбъектDataBalance.KBK = Выборка.KBK;     
			Если ЗначениеЗаполнено(Выборка.TypeKBK) Тогда
				ОбъектDataBalance.TypeKBK = Выборка.TypeKBK;
			КонецЕсли;		
			ОбъектDataBalance.KOSGU = Выборка.KOSGU; 
			
			Если ЗначениеЗаполнено(Выборка.Аналитика1) Тогда
				Analytics_1 = "";
				Если Выборка.Аналитика1 = "TOVAR_ROZN" Тогда
					Если Выборка.СубСчет = "105.2В" ИЛИ Выборка.СубСчет = "105.3В" Тогда
						Analytics_1 = "0";
					Иначе
						Analytics_1 = "1";
					КонецЕсли;	
				Иначе 
					Если НЕ ТаблицаДанных.Колонки.Найти("Значение_" + Выборка.Аналитика1) = Неопределено Тогда
						Analytics_1 = Выборка["Значение_" + Выборка.Аналитика1];
					КонецЕсли;
				КонецЕсли;
				ОбъектDataBalance.Analytics_1 = Analytics_1;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.Аналитика2) Тогда
				Analytics_2 = "";
				Если Выборка.Аналитика2 = "VID_RASCH_PROCH_KR" Тогда
					Analytics_2 = "2";	
				Иначе
					Если НЕ ТаблицаДанных.Колонки.Найти("Значение_" + Выборка.Аналитика2) = Неопределено Тогда
						Analytics_2 = Выборка["Значение_" + Выборка.Аналитика2]; 
					КонецЕсли;
				КонецЕсли; 
				ОбъектDataBalance.Analytics_2 = Analytics_2;  
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.Аналитика3) Тогда
				Analytics_3 = "";
				Если Выборка.Аналитика3 = "VID_UCHETA" Тогда
					Если Выборка.СубСчет = "07.1" Тогда
						Analytics_3 = "1";
					Иначе
						Analytics_3 = "2";
					КонецЕсли;	
				Иначе
					Если НЕ ТаблицаДанных.Колонки.Найти("Значение_" + Выборка.Аналитика3) = Неопределено Тогда
						Analytics_3 = Выборка["Значение_" + Выборка.Аналитика3];
					КонецЕсли;
				КонецЕсли;
				ОбъектDataBalance.Analytics_3 = Analytics_3; 
			КонецЕсли;
			
			Если НЕ ТаблицаДанных.Колонки.Найти("Значение_" + Выборка.Аналитика4) = Неопределено Тогда
				ОбъектDataBalance.Analytics_4 = Выборка["Значение_" + Выборка.Аналитика4]; 
			КонецЕсли;
			Если НЕ ТаблицаДанных.Колонки.Найти("Значение_" + Выборка.Аналитика5) = Неопределено Тогда
				ОбъектDataBalance.Analytics_5 = Выборка["Значение_" + Выборка.Аналитика5]; 
			КонецЕсли;
			Если НЕ ТаблицаДанных.Колонки.Найти("Значение_" + Выборка.Аналитика6) = Неопределено Тогда
				ОбъектDataBalance.Analytics_6 = Выборка["Значение_" + Выборка.Аналитика6];
			КонецЕсли;
			ОбъектDataBalance.Summa_Dt = Выборка.Summa_Dt;
			ОбъектDataBalance.Summa_Kt = Выборка.Summa_Kt;
			ОбъектDataBalance.Kol_Dt = ОбработатьКоличествоXDTO(Выборка.Kol_Dt); 
			ОбъектDataBalance.Kol_Kt = ОбработатьКоличествоXDTO(Выборка.Kol_Kt);
			ОбъектDataBalance.Val = Выборка.Val;
			ОбъектDataBalance.ValSumma_Dt = Выборка.ValSumma_Dt;
			ОбъектDataBalance.ValSumma_Kt = Выборка.ValSumma_Kt; 
			
			ПараметрыВыполнения.текФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектDataBalance); 
			ТаблицаДанных.Удалить(Выборка);
		КонецЦикла;	
	КонецЕсли;
	
	ЗаписьСобытияВЖурналРегистрации(НСтр("ru = 'Запрос остатков - данные записаны'"));
	
КонецПроцедуры		

Функция ОбработатьКоличествоXDTO(КоличествоЗначение) 
	
	МассивКоличество = СтрРазделить(Формат(КоличествоЗначение, "ЧГ="), ",");
	Количество = "";
	ПерваяИтерация = Истина;
	Для каждого ЭлементКоличество Из МассивКоличество Цикл
		Количество = Количество + ?(ПерваяИтерация, Лев(ЭлементКоличество, 15), "," + Лев(ЭлементКоличество, 3));
		ПерваяИтерация = Ложь;
	КонецЦикла;	
	Если ЗначениеЗаполнено(Количество) Тогда
		КоличествоИтог = Число(Количество);  
	Иначе
		КоличествоИтог = КоличествоЗначение;
	КонецЕсли;	
	Возврат КоличествоИтог; 
				
КонецФункции	

Процедура ЗаписатьШапкуНачалаЭлемента(ЗаписьXML, ПространствоИменПакет)
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();		
	ЗаписьXML.ЗаписатьНачалоЭлемента("Body");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", ПространствоИменПакет);
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xs", "http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");		

КонецПроцедуры	

Процедура ЗаполнитьТабДокПересчетОстатков(Набор, МакетПересчетОстатков, ТабДокПересчетОстатков)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВТОстатки.Организация КАК Организация,
	|	ВТОстатки.Период КАК Период,
	|	ВТОстатки.Счет КАК Счет,
	|	ВТОстатки.КПС КАК КПС,
	|	ВТОстатки.КФО КАК КФО,
	|	ВТОстатки.КЭК КАК КЭК,
	|	ВТОстатки.СуммаДт КАК СуммаДт,
	|	ВТОстатки.СуммаКт КАК СуммаКт
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Набор КАК ВТОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Счет,
	|	КПС,
	|	КФО");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Набор", Набор);
	Запрос.Выполнить();
	
	ТекстЗапросаГруппировка =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.Период КАК Период
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	ЗапросГруппировка = Новый Запрос(ТекстЗапросаГруппировка);
	ЗапросГруппировка.МенеджерВременныхТаблиц = МенеджерВТ;
	РезультатЗапросаГруппировка = ЗапросГруппировка.Выполнить();
	ВыборкаДата = РезультатЗапросаГруппировка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьШапка = МакетПересчетОстатков.ПолучитьОбласть("Шапка|КолонкаШапка");
	ТабДокПересчетОстатков.Присоединить(ОбластьШапка);
	
	ПорядокДат = Новый Массив;
	
	Пока ВыборкаДата.Следующий() Цикл 				
		ОбластьШапка = МакетПересчетОстатков.ПолучитьОбласть("Шапка|КолонкаСальдо"); 
		ОбластьШапка.Параметры.ДатаСальдо = Формат(ВыборкаДата.Период, "ДЛФ=Д");
		ТабДокПересчетОстатков.Присоединить(ОбластьШапка);
		ПорядокДат.Добавить(ВыборкаДата.Период);
	КонецЦикла; 
	
	ТекстЗапросаОрганизация =
	"ВЫБРАТЬ
	|	ВТ.Организация КАК Организация,
	|	ВТ.Период КАК Период,
	|	ВТ.СуммаДт КАК СуммаДт,
	|	ВТ.СуммаКт КАК СуммаКт
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Период
	|ИТОГИ
	|	СУММА(СуммаДт),
	|	СУММА(СуммаКт)
	|ПО
	|	Организация,
	|	Период";
	
	ЗапросГруппировка = Новый Запрос(ТекстЗапросаОрганизация);
	ЗапросГруппировка.МенеджерВременныхТаблиц = МенеджерВТ;
	РезультатЗапросаГруппировка = ЗапросГруппировка.Выполнить();
	
	ВыборкаОрганизация = РезультатЗапросаГруппировка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизация.Следующий() Цикл 			
		ЗаполнитьСтрокуОбласти(ВыборкаОрганизация, "Организация", ТабДокПересчетОстатков, МакетПересчетОстатков, ПорядокДат);
		
		ТекстЗапросаСчет =
		"ВЫБРАТЬ
		|	ВТ.Счет КАК Счет,
		|	ВТ.Период КАК Период,
		|	ВТ.СуммаДт КАК СуммаДт,
		|	ВТ.СуммаКт КАК СуммаКт
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	Счет,
		|	Период
		|ИТОГИ
		|	СУММА(СуммаДт),
		|	СУММА(СуммаКт)
		|ПО
		|	Счет,
		|	Период"; 
		
		ЗапросСчет = Новый Запрос(ТекстЗапросаСчет);
		ЗапросСчет.МенеджерВременныхТаблиц = МенеджерВТ;
		ЗапросСчет.УстановитьПараметр("Организация", ВыборкаОрганизация.Организация); 
		РезультатЗапросаСчет = ЗапросСчет.Выполнить();
		
		ВыборкаСчет = РезультатЗапросаСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСчет.Следующий() Цикл 
			ЗаполнитьСтрокуОбласти(ВыборкаСчет, "Счет", ТабДокПересчетОстатков, МакетПересчетОстатков, ПорядокДат);				
			ТекстЗапросаКПС =
			"ВЫБРАТЬ
			|	ВТ.КПС КАК КПС,
			|	ВТ.Период КАК Период,
			|	ВТ.СуммаДт КАК СуммаДт,
			|	ВТ.СуммаКт КАК СуммаКт
			|ИЗ
			|	ВТ КАК ВТ
			|ГДЕ
			|	ВТ.Организация = &Организация
			|	И ВТ.Счет = &Счет
			|
			|УПОРЯДОЧИТЬ ПО
			|	КПС,
			|	Период
			|ИТОГИ
			|	СУММА(СуммаДт),
			|	СУММА(СуммаКт)
			|ПО
			|	КПС,
			|	Период"; 
			
			ЗапросКПС = Новый Запрос(ТекстЗапросаКПС);
			ЗапросКПС.МенеджерВременныхТаблиц = МенеджерВТ;
			ЗапросКПС.УстановитьПараметр("Организация", ВыборкаОрганизация.Организация); 
			ЗапросКПС.УстановитьПараметр("Счет", ВыборкаСчет.Счет); 
			РезультатЗапросаКПС = ЗапросКПС.Выполнить();
			
			ВыборкаКПС = РезультатЗапросаКПС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКПС.Следующий() Цикл 
				ЗаполнитьСтрокуОбласти(ВыборкаКПС, "КПС", ТабДокПересчетОстатков, МакетПересчетОстатков, ПорядокДат);	
				
				ТекстЗапросаКФО =
				"ВЫБРАТЬ
				|	ВТ.КФО КАК КФО,
				|	ВТ.Период КАК Период,
				|	ВТ.СуммаДт КАК СуммаДт,
				|	ВТ.СуммаКт КАК СуммаКт
				|ИЗ
				|	ВТ КАК ВТ
				|ГДЕ
				|	ВТ.Организация = &Организация
				|	И ВТ.Счет = &Счет 
				|	И ВТ.КПС = &КПС
				|
				|УПОРЯДОЧИТЬ ПО
				|	КФО,
				|	Период
				|ИТОГИ
				|	СУММА(СуммаДт),
				|	СУММА(СуммаКт)
				|ПО
				|	КФО,
				|	Период"; 
				
				ЗапросКФО = Новый Запрос(ТекстЗапросаКФО);
				ЗапросКФО.МенеджерВременныхТаблиц = МенеджерВТ;
				ЗапросКФО.УстановитьПараметр("Организация", ВыборкаОрганизация.Организация); 
				ЗапросКФО.УстановитьПараметр("Счет", ВыборкаСчет.Счет);
				ЗапросКФО.УстановитьПараметр("КПС", ВыборкаКПС.КПС);
				РезультатЗапросаКФО = ЗапросКФО.Выполнить();
				
				ВыборкаКФО = РезультатЗапросаКФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКФО.Следующий() Цикл 
					ЗаполнитьСтрокуОбласти(ВыборкаКФО, "КФО", ТабДокПересчетОстатков, МакетПересчетОстатков, ПорядокДат);
					
					ТекстЗапросаКЭК =
					"ВЫБРАТЬ
					|	ВТ.КЭК КАК КЭК,
					|	ВТ.Период КАК Период,
					|	ВТ.СуммаДт КАК СуммаДт,
					|	ВТ.СуммаКт КАК СуммаКт
					|ИЗ
					|	ВТ КАК ВТ
					|ГДЕ
					|	ВТ.Организация = &Организация
					|	И ВТ.Счет = &Счет 
					|	И ВТ.КПС = &КПС
					|	И ВТ.КФО = &КФО
					|
					|УПОРЯДОЧИТЬ ПО
					|	КЭК,
					|	Период
					|ИТОГИ
					|	СУММА(СуммаДт),
					|	СУММА(СуммаКт)
					|ПО
					|	КЭК,
					|	Период"; 
					
					ЗапросКЭК = Новый Запрос(ТекстЗапросаКЭК);
					ЗапросКЭК.МенеджерВременныхТаблиц = МенеджерВТ;
					ЗапросКЭК.УстановитьПараметр("Организация", ВыборкаОрганизация.Организация); 
					ЗапросКЭК.УстановитьПараметр("Счет", ВыборкаСчет.Счет);
					ЗапросКЭК.УстановитьПараметр("КПС", ВыборкаКПС.КПС); 
					ЗапросКЭК.УстановитьПараметр("КФО", ВыборкаКФО.КФО);
					
					РезультатЗапросаКЭК = ЗапросКЭК.Выполнить();
					
					ВыборкаКЭК = РезультатЗапросаКЭК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаКЭК.Следующий() Цикл 
						ЗаполнитьСтрокуОбласти(ВыборкаКЭК, "КЭК", ТабДокПересчетОстатков, МакетПересчетОстатков, ПорядокДат);
					КонецЦикла;	
					
					ТабДокПересчетОстатков.ЗакончитьГруппуСтрок(); 
				КонецЦикла; //ВыборкаКФО	
				ТабДокПересчетОстатков.ЗакончитьГруппуСтрок(); 	
			КонецЦикла; //ВыборкаКПС
			ТабДокПересчетОстатков.ЗакончитьГруппуСтрок(); 
		КонецЦикла; //ВыборкаСчет
		ТабДокПересчетОстатков.ЗакончитьГруппуСтрок();	
	КонецЦикла; //ВыборкаОрганизация
	
КонецПроцедуры	

Процедура ЗаполнитьТабДокОстаткиИОбороты(НаборОстатки, НаборОбороты, МакетОстаткиИОбороты, ТабДокОстаткиИОбороты, ОбъектДокумент)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЕПСБУ.Код КАК Код,
	                      |	ЕПСБУ.Забалансовый КАК Забалансовый
	                      |ПОМЕСТИТЬ ВТЕПСБУ
	                      |ИЗ
	                      |	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТОстатки.Организация КАК Организация,
	                      |	ВТОстатки.Период КАК Период,
	                      |	ВТОстатки.Счет КАК Счет,
	                      |	ВТОстатки.КПС КАК КПС,
	                      |	ВТОстатки.КФО КАК КФО,
	                      |	ВТОстатки.КЭК КАК КЭК,
	                      |	ВТОстатки.СуммаДт КАК СуммаДт,
	                      |	ВТОстатки.СуммаКт КАК СуммаКт
	                      |ПОМЕСТИТЬ ВТОстатки
	                      |ИЗ
	                      |	&НаборОстатки КАК ВТОстатки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТОбороты.Организация КАК Организация,
	                      |	ВТОбороты.Период КАК Период,
	                      |	ВТОбороты.Счет КАК Счет,
	                      |	ВТОбороты.КПС КАК КПС,
	                      |	ВТОбороты.КФО КАК КФО,
	                      |	ВТОбороты.КЭК КАК КЭК,
	                      |	ВТОбороты.СуммаДт КАК СуммаДт,
	                      |	ВТОбороты.СуммаКт КАК СуммаКт
	                      |ПОМЕСТИТЬ ВТОбороты
	                      |ИЗ
	                      |	&НаборОбороты КАК ВТОбороты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТОстатки.Организация КАК Организация,
	                      |	ВТОстатки.Счет КАК Счет,
	                      |	ВТОстатки.КПС КАК КПС,
	                      |	ВТОстатки.КФО КАК КФО,
	                      |	ВТОстатки.КЭК КАК КЭК,
	                      |	ВТОстатки.СуммаДт КАК СальдоНаНачалоДт,
	                      |	ВТОстатки.СуммаКт КАК СальдоНаНачалоКт,
	                      |	NULL КАК СальдоНаКонецДт,
	                      |	NULL КАК СальдоНаКонецКт,
	                      |	NULL КАК ОборотДт,
	                      |	NULL КАК ОборотКт,
	                      |	ВТЕПСБУ.Забалансовый КАК Забалансовый
	                      |ИЗ
	                      |	ВТОстатки КАК ВТОстатки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЕПСБУ КАК ВТЕПСБУ
	                      |		ПО ВТОстатки.Счет = ВТЕПСБУ.Код
	                      |ГДЕ
	                      |	ВТОстатки.Период = &НачалоПериода
	                      |	И НЕ ВТОстатки.Счет = """"
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ВТОстатки.Организация,
	                      |	ВТОстатки.Счет,
	                      |	ВТОстатки.КПС,
	                      |	ВТОстатки.КФО,
	                      |	ВТОстатки.КЭК,
	                      |	NULL,
	                      |	NULL,
	                      |	ВТОстатки.СуммаДт,
	                      |	ВТОстатки.СуммаКт,
	                      |	NULL,
	                      |	NULL,
	                      |	ВТЕПСБУ.Забалансовый
	                      |ИЗ
	                      |	ВТОстатки КАК ВТОстатки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЕПСБУ КАК ВТЕПСБУ
	                      |		ПО ВТОстатки.Счет = ВТЕПСБУ.Код
	                      |ГДЕ
	                      |	ВТОстатки.Период = &КонецПериода
	                      |	И НЕ ВТОстатки.Счет = """"
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ВТОбороты.Организация,
	                      |	ВТОбороты.Счет,
	                      |	ВТОбороты.КПС,
	                      |	ВТОбороты.КФО,
	                      |	ВТОбороты.КЭК,
	                      |	NULL,
	                      |	NULL,
	                      |	NULL,
	                      |	NULL,
	                      |	ВТОбороты.СуммаДт,
	                      |	ВТОбороты.СуммаКт,
	                      |	ВТЕПСБУ.Забалансовый
	                      |ИЗ
	                      |	ВТОбороты КАК ВТОбороты
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТЕПСБУ КАК ВТЕПСБУ
	                      |		ПО ВТОбороты.Счет = ВТЕПСБУ.Код
	                      |ГДЕ
	                      |	НЕ ВТОбороты.Счет = """"
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Организация,
	                      |	Забалансовый,
	                      |	Счет,
	                      |	КПС,
	                      |	КФО,
	                      |	КЭК
	                      |ИТОГИ
	                      |	СУММА(СальдоНаНачалоДт),
	                      |	СУММА(СальдоНаНачалоКт),
	                      |	СУММА(СальдоНаКонецДт),
	                      |	СУММА(СальдоНаКонецКт),
	                      |	СУММА(ОборотДт),
	                      |	СУММА(ОборотКт)
	                      |ПО
	                      |	Организация,
	                      |	Забалансовый,
	                      |	Счет,
	                      |	КПС,
	                      |	КФО,
	                      |	КЭК");
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("НаборОстатки", НаборОстатки);
	Запрос.УстановитьПараметр("НаборОбороты", НаборОбороты);  
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ОбъектДокумент.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", НачалоДня(ОбъектДокумент.ОкончаниеПериода));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьШапка = МакетОстаткиИОбороты.ПолучитьОбласть("Шапка");  
	ОбластьСтрокаОрганизация = МакетОстаткиИОбороты.ПолучитьОбласть("СтрокаОрганизация");
	ОбластьСтрокаЗабаланс = МакетОстаткиИОбороты.ПолучитьОбласть("СтрокаЗабаланс");
	ОбластьСтрокаСчет = МакетОстаткиИОбороты.ПолучитьОбласть("СтрокаСчет");
	ОбластьСтрокаКПС = МакетОстаткиИОбороты.ПолучитьОбласть("СтрокаКПС");
	ОбластьСтрокаКФО = МакетОстаткиИОбороты.ПолучитьОбласть("СтрокаКФО");
	ОбластьСтрокаКЭК = МакетОстаткиИОбороты.ПолучитьОбласть("СтрокаКЭК");
	ТабДокОстаткиИОбороты.Вывести(ОбластьШапка);  
	
	ВыборкаОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизация.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаОрганизация.Параметры, ВыборкаОрганизация);	
		ТабДокОстаткиИОбороты.Вывести(ОбластьСтрокаОрганизация);
		ТабДокОстаткиИОбороты.НачатьГруппуСтрок("Организация");
		
		ВыборкаЗабалансовый = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗабалансовый.Следующий() Цикл 
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаЗабаланс.Параметры, ВыборкаЗабалансовый);
			Если ВыборкаЗабалансовый.Забалансовый = Истина Тогда
				ОбластьСтрокаЗабаланс.Параметры.Забалансовый = "Забалансовые счета";	
			Иначе
				ОбластьСтрокаЗабаланс.Параметры.Забалансовый = "Балансовые счета";
			КонецЕсли;	
			ТабДокОстаткиИОбороты.Вывести(ОбластьСтрокаЗабаланс);
			ТабДокОстаткиИОбороты.НачатьГруппуСтрок("Забаланс");
		
			ВыборкаСчет = ВыборкаЗабалансовый.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСчет.Следующий() Цикл	
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаСчет.Параметры, ВыборкаСчет);	
				ТабДокОстаткиИОбороты.Вывести(ОбластьСтрокаСчет);
				ТабДокОстаткиИОбороты.НачатьГруппуСтрок("Счет");
				
				ВыборкаКПС = ВыборкаСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКПС.Следующий() Цикл 
					ЗаполнитьЗначенияСвойств(ОбластьСтрокаКПС.Параметры, ВыборкаКПС);	
					ТабДокОстаткиИОбороты.Вывести(ОбластьСтрокаКПС);
					ТабДокОстаткиИОбороты.НачатьГруппуСтрок("КПС");
					
					ВыборкаКФО = ВыборкаКПС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаКФО.Следующий() Цикл 
						ЗаполнитьЗначенияСвойств(ОбластьСтрокаКФО.Параметры, ВыборкаКФО);	
						ТабДокОстаткиИОбороты.Вывести(ОбластьСтрокаКФО);
						ТабДокОстаткиИОбороты.НачатьГруппуСтрок("КФО");
						
						ВыборкаКЭК = ВыборкаКФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаКЭК.Следующий() Цикл 
							ЗаполнитьЗначенияСвойств(ОбластьСтрокаКЭК.Параметры, ВыборкаКЭК);	
							ТабДокОстаткиИОбороты.Вывести(ОбластьСтрокаКЭК);
						КонецЦикла;	
						ТабДокОстаткиИОбороты.ЗакончитьГруппуСтрок();
					КонецЦикла;				
					ТабДокОстаткиИОбороты.ЗакончитьГруппуСтрок();
				КонецЦикла;				
				ТабДокОстаткиИОбороты.ЗакончитьГруппуСтрок();
			КонецЦикла;
			ТабДокОстаткиИОбороты.ЗакончитьГруппуСтрок();
		КонецЦикла;	
		ТабДокОстаткиИОбороты.ЗакончитьГруппуСтрок();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуОбласти(ВыборкаГруппировка, ИмяПоля, ТабДокПересчетОстатков, МакетПересчетОстатков, ПорядокДат)
	
	Итерация = 0;
	ВыборкаДата = ВыборкаГруппировка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДата.Следующий() Цикл 				
		Если Итерация = 0 Тогда
			ОбластьИмяПоля = МакетПересчетОстатков.ПолучитьОбласть("Строка" + ИмяПоля + "|КолонкаШапка");
			ЗаполнитьОбластьПересчетОстатков(ОбластьИмяПоля, ВыборкаДата, ИмяПоля, Истина);
			ТабДокПересчетОстатков.Вывести(ОбластьИмяПоля);
			Если НЕ ИмяПоля = "КЭК" Тогда
				ТабДокПересчетОстатков.НачатьГруппуСтрок(ИмяПоля); 
			КонецЕсли;	
		КонецЕсли;
		
		ОбластьИмяПоля = МакетПересчетОстатков.ПолучитьОбласть("Строка" + ИмяПоля + "|КолонкаСальдо");				
		Пока НЕ ПорядокДат[Итерация] = ВыборкаДата.Период Цикл
			ТабДокПересчетОстатков.Присоединить(ОбластьИмяПоля);
			Итерация = Итерация + 1;
		КонецЦикла;	
		ЗаполнитьОбластьПересчетОстатков(ОбластьИмяПоля, ВыборкаДата, ИмяПоля);
		ТабДокПересчетОстатков.Присоединить(ОбластьИмяПоля);						
		Итерация = Итерация + 1;
	КонецЦикла;
	
КонецПроцедуры	

Функция ПроверитьДатыЗакрытияГода(ПараметрыВыполнения) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация
	|ПОМЕСТИТЬ ВТОрганизацииФедеральногоБюджета
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Бюджеты КАК Бюджеты
	|		ПО Организации.Бюджет = Бюджеты.Ссылка
	|ГДЕ
	|	Бюджеты.Код = ""00000001""
	|	И Организации.Ссылка = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Бюджеты КАК Бюджеты
	|		ПО Организации.Бюджет = Бюджеты.Ссылка
	|ГДЕ
	|	Бюджеты.Код = ""00000001""
	|	И Организации.УчетПереданныхПолномочий
	|	И Организации.ПолучательПолномочий = &Организация
	|	И НЕ Организации.Ссылка = &Организация
	|	И НЕ Организации.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытиеСчетовСанкционирования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗакрытиеСчетовСанкционирования КАК ЗакрытиеСчетовСанкционирования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
	|		ПО ЗакрытиеСчетовСанкционирования.Организация = ВТОрганизацииФедеральногоБюджета.Организация
	|ГДЕ
	|	ЗакрытиеСчетовСанкционирования.Проведен
	|	И ГОД(ЗакрытиеСчетовСанкционирования.ФинансовыйГод) = &ТекущийГод
	|	И ГОД(ЗакрытиеСчетовСанкционирования.Дата) = &ТекущийГод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеСчетовСанкционирования.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеСчетовСанкционирования КАК ЗакрытиеСчетовСанкционирования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
	|		ПО ЗакрытиеСчетовСанкционирования.Организация = ВТОрганизацииФедеральногоБюджета.Организация
	|ГДЕ
	|	ЗакрытиеСчетовСанкционирования.Проведен
	|	И ГОД(ЗакрытиеСчетовСанкционирования.ФинансовыйГод) = &ТекущийГод
	|	И ГОД(ЗакрытиеСчетовСанкционирования.Дата) = ГОД(&ДатаОкончания)
	|	И КОНЕЦПЕРИОДА(ЗакрытиеСчетовСанкционирования.Дата, ДЕНЬ) > КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Организация", ПараметрыВыполнения.Организация);
	ОкончаниеПериода = ПараметрыВыполнения.ОкончаниеПериода;
	Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериода);
	Если КонецДня(ОкончаниеПериода) = КонецГода(ОкончаниеПериода) Тогда
		Запрос.УстановитьПараметр("ТекущийГод", Год(ОкончаниеПериода));
	Иначе
		Запрос.УстановитьПараметр("ТекущийГод", Год(ОкончаниеПериода)-1);	
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();	
	МассивСсылок = Новый Массив;	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСсылок.Добавить(ВыборкаДетальныеЗаписи.Ссылка);								
	КонецЦикла;
	Возврат МассивСсылок;
	
КонецФункции	

Функция ПериодПроверкиЗакрытияСчетов(ПараметрыВыполнения) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПериодыМСД.Ссылка КАК Ссылка,
		|	ПериодыМСД.ДатаНачала КАК ДатаНачала,
		|	ПериодыМСД.ДатаОкончания КАК ДатаОкончания,
		|	ПериодыМСД.Периодичность КАК Периодичность
		|ПОМЕСТИТЬ ВТ_Декабрь
		|ИЗ
		|	Справочник.ПериодыМСД КАК ПериодыМСД
		|ГДЕ
		|	ПериодыМСД.Периодичность = &ПериодичностьОтчетный
		|	И НЕ ПериодыМСД.ПометкаУдаления
		|	И ПериодыМСД.ДатаНачала = &ДатаНачалаДекабрь
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПериодыМСД.Ссылка КАК Ссылка,
		|	ПериодыМСД.ДатаНачала КАК ДатаНачала,
		|	ПериодыМСД.ДатаОкончания КАК ДатаОкончания,
		|	ПериодыМСД.Периодичность КАК Периодичность
		|ПОМЕСТИТЬ ВТ_Январь
		|ИЗ
		|	Справочник.ПериодыМСД КАК ПериодыМСД
		|ГДЕ
		|	ПериодыМСД.Периодичность = &ПериодичностьОтчетный
		|	И НЕ ПериодыМСД.ПометкаУдаления
		|	И ПериодыМСД.ДатаНачала = &ДатаНачалаЯнварь
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПериодыМСД.Ссылка КАК Ссылка,
		|	ПериодыМСД.ДатаНачала КАК ДатаНачала,
		|	ПериодыМСД.ДатаОкончания КАК ДатаОкончания,
		|	ПериодыМСД.Периодичность КАК Периодичность
		|ПОМЕСТИТЬ ВТ_ПерваяДекада
		|ИЗ
		|	Справочник.ПериодыМСД КАК ПериодыМСД
		|ГДЕ
		|	ПериодыМСД.Периодичность = &ПериодичностьПроизвольный
		|	И НЕ ПериодыМСД.ПометкаУдаления
		|	И ПериодыМСД.ДатаНачала = &ДатаНачалаЯнварь
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Декабрь.Ссылка КАК Ссылка,
		|	ВТ_Декабрь.ДатаНачала КАК ДатаНачала,
		|	ВТ_Декабрь.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	ВТ_Декабрь КАК ВТ_Декабрь
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ВТ_Декабрь.ДатаНачала, ДЕНЬ) = &ДатаНачала
		|	И КОНЕЦПЕРИОДА(ВТ_Декабрь.ДатаОкончания, ДЕНЬ) = &ДатаОкончания
		|	И &ВидПередаваемыхДанных В (ВТ_Декабрь.Периодичность = &ПериодичностьОтчетный)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Январь.Ссылка,
		|	ВТ_Январь.ДатаНачала,
		|	ВТ_Январь.ДатаОкончания
		|ИЗ
		|	ВТ_Январь КАК ВТ_Январь
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ВТ_Январь.ДатаНачала, ДЕНЬ) = &ДатаНачала
		|	И КОНЕЦПЕРИОДА(ВТ_Январь.ДатаОкончания, ДЕНЬ) = &ДатаОкончания
		|	И &ВидПередаваемыхДанных В (ВТ_Январь.Периодичность = &ПериодичностьОтчетный)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ПерваяДекада.Ссылка,
		|	ВТ_ПерваяДекада.ДатаНачала,
		|	ВТ_ПерваяДекада.ДатаОкончания
		|ИЗ
		|	ВТ_ПерваяДекада КАК ВТ_ПерваяДекада
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ВТ_ПерваяДекада.ДатаНачала, ДЕНЬ) = &ДатаНачала
		|	И КОНЕЦПЕРИОДА(ВТ_ПерваяДекада.ДатаОкончания, ДЕНЬ) = &ДатаОкончания
		|	И НЕ &ВидПередаваемыхДанных В (ВТ_ПерваяДекада.Периодичность = &ПериодичностьПроизвольный)";
	
	Запрос.УстановитьПараметр("ДатаНачалаДекабрь", Дата(Год(ПараметрыВыполнения.НачалоПериода), 12, 01));
	Запрос.УстановитьПараметр("ДатаНачалаЯнварь", Дата(Год(ПараметрыВыполнения.НачалоПериода), 01, 01));
	Запрос.УстановитьПараметр("ПериодичностьПроизвольный", Перечисления.ПериодичностьМСД.ПроизвольныйПериод);
	Запрос.УстановитьПараметр("ПериодичностьОтчетный", Перечисления.ПериодичностьМСД.Месяц); 
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ПараметрыВыполнения.НачалоПериода));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПараметрыВыполнения.ОкончаниеПериода));
	Запрос.УстановитьПараметр("ВидПередаваемыхДанных", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыВыполнения.ДокументСсылка, "ВидПередаваемыхДанных"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();	
	
КонецФункции	

Процедура ЗаполнитьТекстЗапросаСоединениемСАналитиками(МенеджерВТ, ТекстЗапроса, МассивАналитик)
	
	ПоляЗначенияАналитикВТОстатки = "";
	СоединенияЗначенияАналитик = "";
	ПоляЗначенияАналитикВТОстаткиПередВыгрузкой = "";
	ГруппировкаВТОстаткиПередВыгрузкой = "";
	ПоляЗначенияАналитикВТОстаткиПередВыгрузкой_СвернутыеОстатки = "";
	
	ШаблонСоединение = 
	"
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияАналитик КАК ВТ_ЗначенияАналитик_%1
	|		ПО (ВТ_ЗначенияАналитик_%1.ИмяАналитики = ""%1"")
	|			И ВТ_ЗначенияАналитик_%1.УИ_Субконто = ВТОстатки.%1";

	ЕстьАналитики = МассивАналитик.Количество();
	
	ЗапросАналитики = Новый Запрос;
	ЗапросАналитики.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросАналитики.Текст = 
	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВидыСубконтоАналитик.ИмяАналитики КАК ИмяАналитики
	|ИЗ
	|	ВТ_ВидыСубконтоАналитик КАК ВТ_ВидыСубконтоАналитик" + ?(ЕстьАналитики, "
	|ГДЕ
	|	ВТ_ВидыСубконтоАналитик.ИмяАналитики В(&МассивАналитик)", "");
	
	Если ЕстьАналитики Тогда
		ЗапросАналитики.УстановитьПараметр("МассивАналитик", МассивАналитик);
	КонецЕсли;
	
	ВыборкаИменаАналитик = ЗапросАналитики.Выполнить().Выбрать(); 
	
	Пока ВыборкаИменаАналитик.Следующий() Цикл 	
		ПоляЗначенияАналитикВТОстатки = ПоляЗначенияАналитикВТОстатки + СтрШаблон("
		|	ВЫБОР КОГДА ВТ_ЗначенияАналитик_%1.ИмяАналитики = ВТОстатки.Аналитика1 " +
		"ИЛИ ВТ_ЗначенияАналитик_%1.ИмяАналитики = ВТОстатки.Аналитика2 " + 
		"ИЛИ ВТ_ЗначенияАналитик_%1.ИмяАналитики = ВТОстатки.Аналитика3 " + 
		"ИЛИ ВТ_ЗначенияАналитик_%1.ИмяАналитики = ВТОстатки.Аналитика4 " + 
		"ИЛИ ВТ_ЗначенияАналитик_%1.ИмяАналитики = ВТОстатки.Аналитика5 " + 
		"ИЛИ ВТ_ЗначенияАналитик_%1.ИмяАналитики = ВТОстатки.Аналитика6 " + 
		"ТОГДА ЕСТЬNULL(ВТ_ЗначенияАналитик_%1.НомерПП, """") ИНАЧЕ """" КОНЕЦ КАК Значение_%1,", ВыборкаИменаАналитик.ИмяАналитики); 
		Если Не ВыборкаИменаАналитик.ИмяАналитики = "GRAF_ISP" Тогда
			СоединенияЗначенияАналитик = СоединенияЗначенияАналитик + СтрШаблон(ШаблонСоединение, ВыборкаИменаАналитик.ИмяАналитики); 
		КонецЕсли;
		ПоляЗначенияАналитикВТОстаткиПередВыгрузкой = ПоляЗначенияАналитикВТОстаткиПередВыгрузкой + СтрШаблон("
		|	ВТОстаткиПередВыгрузкой.Значение_%1 КАК Значение_%1,", ВыборкаИменаАналитик.ИмяАналитики);
		ГруппировкаВТОстаткиПередВыгрузкой = ГруппировкаВТОстаткиПередВыгрузкой + СтрШаблон("
		|	ВТОстаткиПередВыгрузкой.Значение_%1,", ВыборкаИменаАналитик.ИмяАналитики); 
		ПоляЗначенияАналитикВТОстаткиПередВыгрузкой_СвернутыеОстатки = ПоляЗначенияАналитикВТОстаткиПередВыгрузкой_СвернутыеОстатки + СтрШаблон("
		|	ВТОстаткиПередВыгрузкой_СвернутыеОстатки.Значение_%1 КАК Значение_%1,", ВыборкаИменаАналитик.ИмяАналитики);	
	КонецЦикла;	 
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПоляЗначенияАналитикВТОстатки_", ПоляЗначенияАналитикВТОстатки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%СоединенияЗначенияАналитик", СоединенияЗначенияАналитик);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПоляЗначенияАналитикВТОстаткиПередВыгрузкой_", ПоляЗначенияАналитикВТОстаткиПередВыгрузкой);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ГруппировкаВТОстаткиПередВыгрузкой", ГруппировкаВТОстаткиПередВыгрузкой);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПоляЗначенияАналитикВТОстаткиПередВыгрузкойСвернутыеОстатки_", ПоляЗначенияАналитикВТОстаткиПередВыгрузкой_СвернутыеОстатки);

КонецПроцедуры

Процедура ПолучитьАналитикиГрафикИсполнения(МенеджерВТ, ОкончаниеПериода)

	Запрос = Новый Запрос;	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВТОстатки.Счет КАК Счет,
	               |	ВТОстатки.КФОСсылка КАК КФО,
	               |	ВТОстатки.КПССсылка КАК КПС,
	               |	ВТОстатки.Субконто11 КАК Субконто1,
	               |	ВТОстатки.Субконто21 КАК Субконто2,
	               |	ВТОстатки.Субконто31 КАК Субконто3,
	               |	ВТОстатки.СуммаОстаток КАК СуммаОстаток
	               |ПОМЕСТИТЬ ВТАналитикиДоговор
	               |ИЗ
	               |	ВТОстатки КАК ВТОстатки
	               |ГДЕ
	               |	(ВТОстатки.Аналитика1 = &Аналитика
	               |			ИЛИ ВТОстатки.Аналитика2 = &Аналитика
	               |			ИЛИ ВТОстатки.Аналитика3 = &Аналитика
	               |			ИЛИ ВТОстатки.Аналитика4 = &Аналитика
	               |			ИЛИ ВТОстатки.Аналитика5 = &Аналитика
	               |			ИЛИ ВТОстатки.Аналитика6 = &Аналитика)
	               |	И ВТОстатки.ДатаОкончания = &ОкончаниеПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТАналитики_.Субконто1 КАК Договор, 
				   |	ВТАналитики_.Субконто2 КАК Субконто2,
				   |	ВТАналитики_.Субконто3 КАК Субконто3,
	               |	ВТАналитики_.Счет КАК Счет,
	               |	ВТАналитики_.КФО КАК КФО,
	               |	ВТАналитики_.КПС КАК КПС,
	               |	ВТАналитики_.СуммаОстаток КАК СуммаОстаток,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_.Субконто2) = ТИП(Справочник.Контрагенты)
	               |			ТОГДА ВТАналитики_.Субконто2
	               |		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_.Субконто3) = ТИП(Справочник.Контрагенты)
	               |			ТОГДА ВТАналитики_.Субконто3
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	КОНЕЦ КАК Контрагент
	               |ПОМЕСТИТЬ ВТАналитикиПредварительно
	               |ИЗ
	               |	ВТАналитикиДоговор КАК ВТАналитики_
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ВТАналитики_.Субконто1) = ТИП(Справочник.Договоры)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТАналитики_.Субконто2,
				   |	ВТАналитики_.Субконто1,
				   |	ВТАналитики_.Субконто3,
	               |	ВТАналитики_.Счет,
	               |	ВТАналитики_.КФО,
	               |	ВТАналитики_.КПС,
	               |	ВТАналитики_.СуммаОстаток,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_.Субконто1) = ТИП(Справочник.Контрагенты)
	               |			ТОГДА ВТАналитики_.Субконто1
	               |		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_.Субконто3) = ТИП(Справочник.Контрагенты)
	               |			ТОГДА ВТАналитики_.Субконто3
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПУстаяСсылка)
	               |	КОНЕЦ
	               |ИЗ
	               |	ВТАналитикиДоговор КАК ВТАналитики_
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ВТАналитики_.Субконто2) = ТИП(Справочник.Договоры)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТАналитики_.Субконто3,
				   |	ВТАналитики_.Субконто1,
				   |	ВТАналитики_.Субконто2,
	               |	ВТАналитики_.Счет,
	               |	ВТАналитики_.КФО,
	               |	ВТАналитики_.КПС,
	               |	ВТАналитики_.СуммаОстаток,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_.Субконто1) = ТИП(Справочник.Контрагенты)
	               |			ТОГДА ВТАналитики_.Субконто1
	               |		КОГДА ТИПЗНАЧЕНИЯ(ВТАналитики_.Субконто2) = ТИП(Справочник.Контрагенты)
	               |			ТОГДА ВТАналитики_.Субконто2
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПУстаяСсылка)
	               |	КОНЕЦ
	               |ИЗ
	               |	ВТАналитикиДоговор КАК ВТАналитики_
	               |ГДЕ
	               |	ТИПЗНАЧЕНИЯ(ВТАналитики_.Субконто3) = ТИП(Справочник.Договоры)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТАналитикиДоговор.Договор КАК Договор,
				   |	ВТАналитикиДоговор.Субконто2 КАК Субконто2,
				   |	ВТАналитикиДоговор.Субконто3 КАК Субконто3,
	               |	ВТАналитикиДоговор.Счет КАК СчетРасчетов,
	               |	ВТАналитикиДоговор.КФО КАК КФО,
	               |	ВТАналитикиДоговор.КПС КАК КПС,
	               |	СУММА(ВТАналитикиДоговор.СуммаОстаток) КАК СуммаОстаток,
	               |	ВТАналитикиДоговор.Контрагент КАК Контрагент
	               |ПОМЕСТИТЬ ВТАналитики_GRAF_ISP
	               |ИЗ
	               |	ВТАналитикиПредварительно КАК ВТАналитикиДоговор
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТАналитикиДоговор.Договор,
				   |	ВТАналитикиДоговор.Субконто2,
				   |	ВТАналитикиДоговор.Субконто3,
	               |	ВТАналитикиДоговор.Счет,
	               |	ВТАналитикиДоговор.КФО,
	               |	ВТАналитикиДоговор.КПС,
	               |	ВТАналитикиДоговор.Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТАналитикиДоговор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТАналитикиПредварительно";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Аналитика", "GRAF_ISP"); 
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ОкончаниеПериода));
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 
	Запрос.Выполнить();
	
КонецПроцедуры	

Функция ПолучитьВТ_ЕПСБУВидыСубконто(ПараметрыВыполнения)
	
	ТаблицаВидыСубконто = Новый ТаблицаЗначений;
	ТаблицаВидыСубконто.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаВидыСубконто.Колонки.Добавить("ВидСубконто", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто"));
	ТаблицаВидыСубконто.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10)));
	Для каждого СтрокаСубконто Из ПараметрыВыполнения.СубконтоНаСчетах Цикл
		Для каждого СтрокаСчет Из СтрокаСубконто.МассивСчетов Цикл
			НомерСтрокиСубконто = 1;
			Для каждого СтрокаСубконтоМассив Из СтрокаСубконто.МассивСубконто Цикл
				НоваяСтрока = ТаблицаВидыСубконто.Добавить();
				НоваяСтрока.Ссылка = СтрокаСчет;
				НоваяСтрока.НомерСтроки = НомерСтрокиСубконто; 
				НоваяСтрока.ВидСубконто = СтрокаСубконтоМассив; 
				НомерСтрокиСубконто = НомерСтрокиСубконто + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	ПараметрыВыполнения.Вставить("ВидыСубконтоТаблица", ТаблицаВидыСубконто);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВидыСубконтоТаблица.Ссылка КАК Ссылка,
	|	ВидыСубконтоТаблица.НомерСтроки КАК НомерСтроки,
	|	ВидыСубконтоТаблица.ВидСубконто КАК ВидСубконто
	|ПОМЕСТИТЬ ВТ_ВидыСубконтоТаблица
	|ИЗ
	|	&ВидыСубконтоТаблица КАК ВидыСубконтоТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУВидыСубконто.Ссылка КАК Ссылка,
	|	ЕПСБУВидыСубконто.НомерСтроки КАК НомерСтроки,
	|	ЕПСБУВидыСубконто.ВидСубконто КАК ВидСубконто
	|ПОМЕСТИТЬ ВТ_ЕПСБУВидыСубконто
	|ИЗ
	|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|ГДЕ
	|	НЕ ЕПСБУВидыСубконто.Ссылка В (&СчетаДляСубконто)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ВидыСубконтоТаблица.Ссылка,
	|	ВТ_ВидыСубконтоТаблица.НомерСтроки,
	|	ВТ_ВидыСубконтоТаблица.ВидСубконто
	|ИЗ
	|	ВТ_ВидыСубконтоТаблица КАК ВТ_ВидыСубконтоТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ВидыСубконтоТаблица
	|;";
	
	Возврат ТекстЗапроса;
	
КонецФункции	

Функция ПолучитьСубконтоНаСчетах(ПараметрыВыполнения)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕПСБУВидыСубконто.Ссылка КАК Ссылка,
		|	ЕПСБУВидыСубконто.ВидСубконто КАК Субконто1,
		|	NULL КАК Субконто2,
		|	NULL КАК Субконто3,
		|	ЕПСБУВидыСубконто.ВидСубконто КАК ВидСубконто
		|ПОМЕСТИТЬ ВТСубконтоПоСчетам
		|ИЗ
		|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|		ПО ЕПСБУВидыСубконто.Ссылка = ЕПСБУ.Ссылка
		|ГДЕ
		|	(ЕПСБУ.Ссылка В(&СчетаДляСубконто)
		|	И ЕПСБУВидыСубконто.ВидСубконто В(&ВидыСубконто))
		|	И ЕПСБУВидыСубконто.НомерСтроки = 1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕПСБУВидыСубконто.Ссылка,
		|	ЕПСБУВидыСубконто.ВидСубконто,
		|	NULL,
		|	NULL,
		|	ЕПСБУВидыСубконто.ВидСубконто
		|ИЗ
		|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|		ПО ЕПСБУВидыСубконто.Ссылка = ЕПСБУ.Ссылка
		|ГДЕ
		|	(ЕПСБУ.Ссылка В(&СчетаДляСубконто26) И ЕПСБУВидыСубконто.ВидСубконто В(&ВидыСубконто26))
		|	И ЕПСБУВидыСубконто.НомерСтроки = 1
		|
		|ОБЪЕДИНИТЬ ВСЕ
        |
		|ВЫБРАТЬ
		|	ЕПСБУВидыСубконто.Ссылка,
		|	NULL,
		|	ЕПСБУВидыСубконто.ВидСубконто,
		|	NULL,
		|	ЕПСБУВидыСубконто.ВидСубконто
		|ИЗ
		|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|		ПО ЕПСБУВидыСубконто.Ссылка = ЕПСБУ.Ссылка
		|ГДЕ
		|	(ЕПСБУ.Ссылка В(&СчетаДляСубконто)
		|	И ЕПСБУВидыСубконто.ВидСубконто В(&ВидыСубконто))
		|	И ЕПСБУВидыСубконто.НомерСтроки = 2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕПСБУВидыСубконто.Ссылка,
		|	NULL,
		|	ЕПСБУВидыСубконто.ВидСубконто,
		|	NULL,
		|	ЕПСБУВидыСубконто.ВидСубконто
		|ИЗ
		|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|		ПО ЕПСБУВидыСубконто.Ссылка = ЕПСБУ.Ссылка
		|ГДЕ
		|	(ЕПСБУ.Ссылка В(&СчетаДляСубконто26) И ЕПСБУВидыСубконто.ВидСубконто В(&ВидыСубконто26))
		|	И ЕПСБУВидыСубконто.НомерСтроки = 2
		|
		| 
		|ОБЪЕДИНИТЬ ВСЕ
        |
		|ВЫБРАТЬ
		|	ЕПСБУВидыСубконто.Ссылка,
		|	NULL,
		|	NULL,
		|	ЕПСБУВидыСубконто.ВидСубконто,
		|	ЕПСБУВидыСубконто.ВидСубконто
		|ИЗ
		|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|		ПО ЕПСБУВидыСубконто.Ссылка = ЕПСБУ.Ссылка
		|ГДЕ
		|	(ЕПСБУ.Ссылка В(&СчетаДляСубконто)
		|	И ЕПСБУВидыСубконто.ВидСубконто В(&ВидыСубконто))
		|	И ЕПСБУВидыСубконто.НомерСтроки = 3
		| 
		|ОБЪЕДИНИТЬ ВСЕ
        |
		|ВЫБРАТЬ
		|	ЕПСБУВидыСубконто.Ссылка,
		|	NULL,
		|	NULL,
		|	ЕПСБУВидыСубконто.ВидСубконто,
		|	ЕПСБУВидыСубконто.ВидСубконто
		|ИЗ
		|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|		ПО ЕПСБУВидыСубконто.Ссылка = ЕПСБУ.Ссылка
		|ГДЕ
		|	(ЕПСБУ.Ссылка В(&СчетаДляСубконто26) И ЕПСБУВидыСубконто.ВидСубконто В(&ВидыСубконто26))
		|	И ЕПСБУВидыСубконто.НомерСтроки = 3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСубконтоПоСчетам.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ВТСубконтоПоСчетам.Субконто1) КАК Субконто1,
		|	МАКСИМУМ(ВТСубконтоПоСчетам.Субконто2) КАК Субконто2,
		|	МАКСИМУМ(ВТСубконтоПоСчетам.Субконто3) КАК Субконто3,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТСубконтоПоСчетам.ВидСубконто) КАК ВидСубконто
		|ПОМЕСТИТЬ ВТСубконтоПоСчетамГруппировка
		|ИЗ
		|	ВТСубконтоПоСчетам КАК ВТСубконтоПоСчетам
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСубконтоПоСчетам.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСубконтоПоСчетамГруппировка.Ссылка КАК Ссылка,
		|	ВТСубконтоПоСчетамГруппировка.Субконто1 КАК Субконто1,
		|	ВТСубконтоПоСчетамГруппировка.Субконто2 КАК Субконто2,
		|	ВТСубконтоПоСчетамГруппировка.Субконто3 КАК Субконто3,
		|	ВТСубконтоПоСчетамГруппировка.ВидСубконто КАК ВидСубконто
		|ИЗ
		|	ВТСубконтоПоСчетамГруппировка КАК ВТСубконтоПоСчетамГруппировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСубконтоПоСчетамГруппировка.Субконто1 КАК Субконто1,
		|	ВТСубконтоПоСчетамГруппировка.Субконто2 КАК Субконто2,
		|	ВТСубконтоПоСчетамГруппировка.Субконто3 КАК Субконто3,
		|	ВТСубконтоПоСчетамГруппировка.ВидСубконто КАК ВидСубконто
		|ИЗ
		|	ВТСубконтоПоСчетамГруппировка КАК ВТСубконтоПоСчетамГруппировка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСубконтоПоСчетамГруппировка.Субконто2,
		|	ВТСубконтоПоСчетамГруппировка.Субконто3,
		|	ВТСубконтоПоСчетамГруппировка.Субконто1,
		|	ВТСубконтоПоСчетамГруппировка.ВидСубконто
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидСубконто";
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ВидыНалоговИПлатежей);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.НалогиИПлатежиОрганизации);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ВидыЦелевыхСредств);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ВидыРасчетовСПЛ);
	
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто); 
	
	ВидыСубконто26 = Новый Массив;
	ВидыСубконто26.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	ВидыСубконто26.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	ВидыСубконто26.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Запрос.УстановитьПараметр("ВидыСубконто26", ВидыСубконто26);

	МодульБухгалтерскийУчет = ОбщегоНазначения.ОбщийМодуль("БухгалтерскийУчет");
	СчетаДляСубконто = МодульБухгалтерскийУчет.СписокСчетов(СтрРазделить("205.00,208.00,209.00,303.00,26", ","));
	Запрос.УстановитьПараметр("СчетаДляСубконто", СчетаДляСубконто);  
	
	СчетаДляСубконто26 = МодульБухгалтерскийУчет.СписокСчетов(СтрРазделить("26", ","));
	Запрос.УстановитьПараметр("СчетаДляСубконто26", СчетаДляСубконто26);
	
	ПараметрыВыполнения.Вставить("СчетаДляСубконто", СчетаДляСубконто);
	
	СоответствиеТиповЗначений = Новый Соответствие;
	СоответствиеТиповЗначений.Вставить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты, "Справочник.Контрагенты");
	СоответствиеТиповЗначений.Вставить(ПланыВидовХарактеристик.ВидыСубконто.Договоры, "Справочник.Договоры");
	СоответствиеТиповЗначений.Вставить(ПланыВидовХарактеристик.ВидыСубконто.ВидыНалоговИПлатежей, "Справочник.ВидыНалоговИПлатежей");
	СоответствиеТиповЗначений.Вставить(ПланыВидовХарактеристик.ВидыСубконто.НалогиИПлатежиОрганизации, "Справочник.НалогиИПлатежиОрганизации");
	СоответствиеТиповЗначений.Вставить(ПланыВидовХарактеристик.ВидыСубконто.ВидыЦелевыхСредств, "Справочник.ВидыЦелевыхСредств");
	СоответствиеТиповЗначений.Вставить(ПланыВидовХарактеристик.ВидыСубконто.ВидыРасчетовСПЛ, "Перечисление.ВидыРасчетовСПЛ");
	СоответствиеТиповЗначений.Вставить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства, "Справочник.ОсновныеСредства");
	СоответствиеТиповЗначений.Вставить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура, "Справочник.Номенклатура");
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДетальнаяТаблица = РезультатЗапроса[РезультатЗапроса.Количество()-2].Выгрузить(); 
	ГруппировкаТаблица = РезультатЗапроса[РезультатЗапроса.Количество()-1].Выгрузить(); 
	
	СубконтоНаСчетах = Новый Массив;
	
	Идентификатор = 1;
	Для каждого Группировка Из ГруппировкаТаблица Цикл
		СтруктураСубконтоНаСчетах = ПолучитьШаблонСтруктурыСубконтоНаСчетах(); 
		СтруктураСубконтоНаСчетах.Идентификатор = Идентификатор;
		ТипЗначенияСубконто = Новый Массив;
		МассивСубконто = Новый Массив;
		ДобавитьСубконтоВМассивы(Группировка.Субконто1, МассивСубконто, ТипЗначенияСубконто, СоответствиеТиповЗначений);
		ДобавитьСубконтоВМассивы(Группировка.Субконто2, МассивСубконто, ТипЗначенияСубконто, СоответствиеТиповЗначений);
		ДобавитьСубконтоВМассивы(Группировка.Субконто3, МассивСубконто, ТипЗначенияСубконто, СоответствиеТиповЗначений);
		СтруктураСубконтоНаСчетах.ТипЗначенияСубконто = ТипЗначенияСубконто;
		СтруктураСубконтоНаСчетах.МассивСубконто = МассивСубконто;
		Отбор = Новый Структура;
		Для каждого Колонка Из ГруппировкаТаблица.Колонки Цикл
			Отбор.Вставить(Колонка.Имя, Группировка[Колонка.Имя]);	
		КонецЦикла;
		СчетаСтроки = ДетальнаяТаблица.НайтиСтроки(Отбор);
		МассивСчетов = Новый Массив;
		Для каждого СчетСтрока Из СчетаСтроки Цикл
			МассивСчетов.Добавить(СчетСтрока.Ссылка);		
		КонецЦикла;
        СтруктураСубконтоНаСчетах.МассивСчетов = МассивСчетов;
		СубконтоНаСчетах.Добавить(СтруктураСубконтоНаСчетах);
		Идентификатор = Идентификатор + 1;
	КонецЦикла;
	Возврат СубконтоНаСчетах;
	
КонецФункции

Функция ПолучитьШаблонСтруктурыСубконтоНаСчетах()	
	
	СтруктураСубконтоНаСчетах = Новый Структура;
	СтруктураСубконтоНаСчетах.Вставить("Идентификатор");
	СтруктураСубконтоНаСчетах.Вставить("ТипЗначенияСубконто");
	СтруктураСубконтоНаСчетах.Вставить("МассивСубконто");
	СтруктураСубконтоНаСчетах.Вставить("МассивСчетов");
	Возврат СтруктураСубконтоНаСчетах; 
	
КонецФункции

Процедура ДобавитьСубконтоВМассивы(Субконто, МассивСубконто, ТипЗначенияСубконто, СоответствиеТиповЗначений)
	
	Если ЗначениеЗаполнено(Субконто) Тогда
		МассивСубконто.Добавить(Субконто);
		ТипЗначенияСубконто.Добавить(СоответствиеТиповЗначений.Получить(Субконто));
	КонецЕсли;
	
КонецПроцедуры	

Функция ВыполнитьПроверкуГруппировкиСчетов(ПараметрыВыполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕПСБУ.Код КАК Код
	               |ИЗ
	               |	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	               |ГДЕ
	               |	&ДатаНачала МЕЖДУ ЕПСБУ.ДатаНачалаДействия И ВЫБОР
	               |			КОГДА ЕПСБУ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	               |				ТОГДА ДАТАВРЕМЯ(2999, 12, 31, 23, 59, 59)
	               |			ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕПСБУ.ДатаОкончанияДействия, ГОД, 1)
	               |		КОНЕЦ
	               |	И ЕПСБУ.Код В(&СписокКодовПроверка)
	               |	И ЕПСБУ.ЭлементГруппа"; 
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыВыполнения.НачалоПериода); 
	СписокКодовПроверка = Новый Массив;
	СписокКодовПроверка.Добавить("401.10");
	СписокКодовПроверка.Добавить("401.20");
	СписокКодовПроверка.Добавить("401.40");
	Запрос.УстановитьПараметр("СписокКодовПроверка", СписокКодовПроверка);
	
	ВыборкаСчетов = Запрос.Выполнить().Выбрать();  
	НекорректныеГруппыСчетов = Новый Массив;
	Пока ВыборкаСчетов.Следующий() Цикл
		НекорректныеГруппыСчетов.Добавить(ВыборкаСчетов.Код);		
	КонецЦикла;	 
	Возврат НекорректныеГруппыСчетов;
	
КонецФункции
	
Функция ПолучитьТекстПолеВыбораПоСубконто(СтрокаСубконто, Суффикс)
	
	ТекстПолеВыбора = "";
	ИтерацияСубконто = 1;
		Для каждого Субкотно Из СтрокаСубконто.ТипЗначенияСубконто Цикл  
			ТекстПолеВыбора = ТекстПолеВыбора + "
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.Субконто" + Суффикс + "1) = ТИП(" + Субкотно + ")
			|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.Субконто" + Суффикс + "1
			|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.Субконто" + Суффикс + "2) = ТИП(" + Субкотно + ")
			|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.Субконто" + Суффикс + "2
			|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.Субконто" + Суффикс + "3) = ТИП(" + Субкотно + ")
			|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.Субконто" + Суффикс + "3
			|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ПакетыДанныхДляМСД.ПустаяСсылка)
			|	КОНЕЦ,";
			ИтерацияСубконто = ИтерацияСубконто + 1;
		КонецЦикла;	
		
		Если ИтерацияСубконто <= 3 Тогда
			Для ИтерацияСубконто = ИтерацияСубконто По 3 Цикл
				ТекстПолеВыбора = ТекстПолеВыбора + "
				|	ЗНАЧЕНИЕ(Документ.ПакетыДанныхДляМСД.ПустаяСсылка),";
			КонецЦикла;	
		КонецЕсли;
		Возврат ТекстПолеВыбора;
	
КонецФункции

Функция ПолучитьGUIDГрафикаИсполнения(Выборка, СоответсвиеКодВидаСчета)
	
	МассивСчет = СтрРазделить(Выборка.СчетРасчетов, ".", Истина);		
	КодАналитическогоСубсчета = ?(МассивСчет.Количество() > 1, МассивСчет[1], "");
	КодВидаСчета = СоответсвиеКодВидаСчета[МассивСчет[0]];
	Возврат СтрЗаменить(XMLСтрока(Выборка.GUID), "-", "") + Выборка.КФО + КодВидаСчета + КодАналитическогоСубсчета;	
	
КонецФункции	

Функция ПолучитьСоответсвиеКодВидаСчета()
	
	СоответствиеКодСчета = Новый Соответствие;
	СоответствиеКодСчета.Вставить("205", "0");
	СоответствиеКодСчета.Вставить("206", "1");
	СоответствиеКодСчета.Вставить("207", "2");
	СоответствиеКодСчета.Вставить("208", "3");
	СоответствиеКодСчета.Вставить("209", "4");
	СоответствиеКодСчета.Вставить("210", "5");
	СоответствиеКодСчета.Вставить("301", "6");
	СоответствиеКодСчета.Вставить("302", "7"); 
	СоответствиеКодСчета.Вставить("303", "8");
	СоответствиеКодСчета.Вставить("304", "9");
	Возврат СоответствиеКодСчета;
	
КонецФункции

Функция ПолучитьСрокИсполнения(СвойстваДоговоров, Выборка, ПараметрыВыполнения)
	
	СрокИсполнения = Дата(2999,12,31);						
	Если НЕ Выборка.ВестиГрафикПлатежей И НЕ Выборка.ВестиПланГрафикИсполнения Тогда
		Если ПараметрыВыполнения.ИспользуютсяИнтеграцииЭБ Тогда
    		МодульСбораДанныхПереопределяемый.ПолучитьДатуОкончанияДоговора(СвойстваДоговоров, Выборка.Договор, Выборка.СчетРасчетов, СрокИсполнения);
		Иначе
			МодульСбораДанных.ПолучитьДатуОкончанияДоговора(СвойстваДоговоров, Выборка.Договор, Выборка.СчетРасчетов, СрокИсполнения);
		КонецЕсли;	
	КонецЕсли;
	Возврат СрокИсполнения;
	
КонецФункции	
	
#Область ФормированиеТабличныхДокументов

Функция ОткрытьФайлПакета(ПутьКФайлу, Знач ИмяТега, ПространствоИмен)
	
	ИмяТега = ВРег(ИмяТега);
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ПутьКФайлу);
	
	ПространствоИмен = Чтение.ЗначениеАтрибута("xmlns");
	
	Пока НЕ (Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента И ВРег(Чтение.Имя) = ИмяТега) Цикл
		Если НЕ Чтение.Прочитать() Тогда
			Прервать;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПространствоИмен) Тогда
			ПространствоИмен = Чтение.ЗначениеАтрибута("xmlns");
		КонецЕсли;
	КонецЦикла;
	
	Если ПространствоИмен = Неопределено Тогда
		Файл = Новый Файл(ПутьКФайлу);
		ВызватьИсключение СтрШаблон("В файле %1 не найден атрибут ""xmlns""", Файл.Имя);
	КонецЕсли;
	
	Возврат Чтение;
	
КонецФункции

Функция РаспаковатьФайлАрхива(ИмяФайлаАрхива, ИмяФайлаДляСообщения)
	
	Файл = Новый Файл(ИмяФайлаАрхива);
	Если НЕ Файл.Существует() Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Файл %1 не существует", ИмяФайлаДляСообщения));
		Возврат Неопределено;
	КонецЕсли;
	
	РазделительПути = ПолучитьРазделительПути();
	
	ИмяБезРасширения = Файл.ИмяБезРасширения;
	
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяБезРасширения + РазделительПути;
	
	Чтение = Новый ЧтениеZipФайла(ИмяФайлаАрхива);
	Чтение.ИзвлечьВсе(ВременныйКаталог);
	
	Файлы = Новый Структура;
	ФайлыЭП = Новый Структура;
	
	ЕстьДанные = Ложь;
	НайденныеФайлыДанных = НайтиФайлы(ВременныйКаталог, "*.xml");
	Если НайденныеФайлыДанных.Количество() Тогда
		ЕстьДанные = Истина;
		
		Для Каждого Файл Из НайденныеФайлыДанных Цикл
			Файлы.Вставить(Файл.ИмяБезРасширения, Файл.ПолноеИмя);
		КонецЦикла;
		
		НайденныеФайлыЭП = НайтиФайлы(ВременныйКаталог, "*.p7s");
		Для Каждого Файл Из НайденныеФайлыЭП Цикл
			ФайлыЭП.Вставить(Файл.ИмяБезРасширения, Файл.ПолноеИмя);
		КонецЦикла;
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Архив %1 не содержит xml файлов с данными", ИмяФайлаДляСообщения));
	КонецЕсли;
	
	Если ЕстьДанные Тогда
		Возврат Новый Структура("Файлы,ФайлыЭП,ВременныйКаталог", Файлы, ФайлыЭП, ВременныйКаталог);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТЗДанныеОстатков()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Организация", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	ТЗ.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата")); 
	ТЗ.Колонки.Добавить("Счет", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(6)));
	ТЗ.Колонки.Добавить("КПС", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(17)));
	ТЗ.Колонки.Добавить("КФО", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("КЭК", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(3))); 
	ТЗ.Колонки.Добавить("СуммаДт", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(18,2)));
	ТЗ.Колонки.Добавить("СуммаКт", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(18,2)));
	Возврат ТЗ;
	
КонецФункции

Функция ПолучитьТЗДанныеМО()
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Организация", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	ТЗ.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата")); 
	ТЗ.Колонки.Добавить("СчетДт", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(6)));
	ТЗ.Колонки.Добавить("СчетКт", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(6)));
	ТЗ.Колонки.Добавить("КПСДт", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(17))); 
	ТЗ.Колонки.Добавить("КПСКт", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(17)));
	ТЗ.Колонки.Добавить("КФО", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(1)));
	ТЗ.Колонки.Добавить("КЭКДт", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(3))); 
	ТЗ.Колонки.Добавить("КЭККт", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(3))); 
	ТЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(18,2)));
	Возврат ТЗ;
	
КонецФункции

Процедура ЗагрузитьОстаткиПересчет(ПутьКФайлу, ОбъектДокумент, КэшИдентификаторов)
	
	ПространствоИмен = Неопределено;
	Файл = ОткрытьФайлПакета(ПутьКФайлу, "DataBalanceRecord", ПространствоИмен);
	
	Тип = ФабрикаXDTO.Тип(ПространствоИмен, "DataBalanceRecord");
	Набор = ПолучитьТЗДанныеОстатков();
	
	Пока Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		ЗаписьXDTO = ФабрикаXDTO.ПрочитатьXML(Файл, Тип);
		Запись = Набор.Добавить();
		Запись.Организация  = КэшИдентификаторов[ЗаписьXDTO.ORGANIZATION];
		Запись.Счет			= ЗаписьXDTO.Account;
		Запись.Период		= ЗаписьXDTO.Date;
		Запись.КПС			= ЗаписьXDTO.KBK;
		Запись.КФО			= ЗаписьXDTO.KFO;
		Запись.КЭК			= ЗаписьXDTO.KOSGU;		
		Запись.СуммаДт		= ЗаписьXDTO.Summa_Dt;
		Запись.СуммаКт		= ЗаписьXDTO.Summa_Kt;		
	КонецЦикла;
	
	Набор.Свернуть("Организация, Счет, Период, КПС, КФО, КЭК", "СуммаДт, СуммаКт");
	
	ТабДокПересчетОстатков = Новый ТабличныйДокумент; 
	МакетПересчетОстатков = ПолучитьМакет("ПФ_MXL_ДанныеДляПересчетаОстатков");
	
	ЗаполнитьТабДокПересчетОстатков(Набор, МакетПересчетОстатков, ТабДокПересчетОстатков);
	
	ОбъектДокумент.ДанныеДляПересчетаОстатков = Новый ХранилищеЗначения(ТабДокПересчетОстатков, Новый СжатиеДанных(9));		
	
КонецПроцедуры

Процедура ЗагрузитьДанныеОстатковИОборотов(ФайлыДанных, ОбъектДокумент, КэшИдентификаторов)
	
	ПутьКФайлуОстатки = Неопределено;
	Если ФайлыДанных.Свойство("Data_Balance", ПутьКФайлуОстатки) Тогда
		
		ПространствоИмен = Неопределено;
		Файл = ОткрытьФайлПакета(ПутьКФайлуОстатки, "DataBalanceRecord", ПространствоИмен);
		
		Тип = ФабрикаXDTO.Тип(ПространствоИмен, "DataBalanceRecord");
		НаборОстатки = ПолучитьТЗДанныеОстатков();
		НаборОбороты = НаборОстатки.Скопировать();
		
		Пока Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
			ЗаписьXDTO = ФабрикаXDTO.ПрочитатьXML(Файл, Тип);
			Запись = НаборОстатки.Добавить();
			Запись.Организация  = КэшИдентификаторов[ЗаписьXDTO.ORGANIZATION];
			Запись.Счет			= ЗаписьXDTO.Account;
			Запись.Период		= ЗаписьXDTO.Date;
			Запись.КПС			= ЗаписьXDTO.KBK;
			Запись.КФО			= ЗаписьXDTO.KFO;
			Запись.КЭК			= ЗаписьXDTO.KOSGU;		
			Запись.СуммаДт		= ЗаписьXDTO.Summa_Dt;
			Запись.СуммаКт		= ЗаписьXDTO.Summa_Kt;	
		КонецЦикла;
		
		НаборОстатки.Свернуть("Организация, Счет, Период, КПС, КФО, КЭК", "СуммаДт, СуммаКт");
		НаборОстатки.Сортировать("Организация, Счет, КПС, КФО, КЭК");
		
		Суффиксы = Новый Структура;
		Суффиксы.Вставить("Дт", "_Dt");
		Суффиксы.Вставить("Кт", "_Kt");
		
		ПространствоИмен = Неопределено;
		
		Для Каждого Элемент Из ФайлыДанных Цикл
			Если НЕ СтрНачинаетсяС(ВРег(Элемент.Ключ), ВРег("Data_Transactions")) Тогда
				Продолжить;
			КонецЕсли;
			
			Файл = ОткрытьФайлПакета(Элемент.Значение, "DataTransactions", ПространствоИмен);
			
			Тип = ФабрикаXDTO.Тип(ПространствоИмен, "DataTransactions");
			
			Попытка
				Обороты = ФабрикаXDTO.ПрочитатьXML(Файл, Тип);
			Исключение
				Текст = ОписаниеОшибки();
				Продолжить;
			КонецПопытки;
			
			Для Каждого ЗаписьXDTO Из Обороты.DataTransactionsDay Цикл
				
				Для Каждого ЭлементСуффикс Из Суффиксы Цикл
					Суффикс = ЭлементСуффикс.Ключ;
					СуффиксXDTO	= ЭлементСуффикс.Значение;
					Запись = НаборОбороты.Добавить();
					Запись.Организация  	= КэшИдентификаторов[ЗаписьXDTO.ORGANIZATION];
					Запись["Сумма"+Суффикс]	= ЗаписьXDTO.Summa;
					Запись.КФО				= ЗаписьXDTO.KFO;
					Запись.Счет				= ЗаписьXDTO["Account" + СуффиксXDTO];
					Запись.КПС				= ЗаписьXDTO["KBK" + СуффиксXDTO];    				
					Запись.КЭК				= ЗаписьXDTO["KOSGU" + СуффиксXDTO];
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		НаборОбороты.Свернуть("Организация, Счет, Период, КПС, КФО, КЭК", "СуммаДт, СуммаКт");
		НаборОбороты.Сортировать("Организация, Счет, КПС, КФО, КЭК");
		
		ТабДокОстаткиИОбороты = Новый ТабличныйДокумент; 
		МакетОстаткиИОбороты = ПолучитьМакет("ПФ_MXL_ДанныеОстатковИОборотов");
		
		ЗаполнитьТабДокОстаткиИОбороты(НаборОстатки, НаборОбороты, МакетОстаткиИОбороты, ТабДокОстаткиИОбороты, ОбъектДокумент);
		
		ОбъектДокумент.ДанныеОстатковИОборотов = Новый ХранилищеЗначения(ТабДокОстаткиИОбороты, Новый СжатиеДанных(9));	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьДанныеМО(ПутьКФайлу, ОбъектДокумент, КэшИдентификаторов)
	
	ПространствоИмен = Неопределено;
	Файл = ОткрытьФайлПакета(ПутьКФайлу, "DataTransactionsMO", ПространствоИмен);
	
	Тип = ФабрикаXDTO.Тип(ПространствоИмен, "DataTransactionsMO");
	Набор = ПолучитьТЗДанныеМО();
	
	Пока Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		ЗаписьXDTO = ФабрикаXDTO.ПрочитатьXML(Файл, Тип);
		Запись = Набор.Добавить();
		Запись.Организация  = КэшИдентификаторов[ЗаписьXDTO.ORGANIZATION];
		Запись.СчетДт		= ЗаписьXDTO.Account_Dt; 
		Запись.СчетКт		= ЗаписьXDTO.Account_Kt;
		Запись.Период		= ЗаписьXDTO.DateRegistration;
		Запись.КПСДт		= ЗаписьXDTO.KBK_Dt;
		Запись.КПСКт		= ЗаписьXDTO.KBK_Kt;
		Запись.КФО			= ЗаписьXDTO.KFO;
		Запись.КЭКДт		= ЗаписьXDTO.KOSGU_Dt;	
		Запись.КЭККт		= ЗаписьXDTO.KOSGU_Kt;	
		Запись.Сумма		= ЗаписьXDTO.Summa;		
	КонецЦикла;
	
	Набор.Свернуть("Организация, СчетДт, СчетКт, Период, КПСДт, КПСКт, КФО, КЭКДт, КЭККт", "Сумма");
	Набор.Сортировать("Организация, Период");
	
	ТабДокМО = Новый ТабличныйДокумент; 
	
	МакетМО = ПолучитьМакет("ПФ_MXL_ДанныеМО");
	ОбластьШапка = МакетМО.ПолучитьОбласть("Шапка"); 
	ОбластьСтрокаПериод = МакетМО.ПолучитьОбласть("СтрокаПериод"); 
	ОбластьСтрокаОрганизация = МакетМО.ПолучитьОбласть("СтрокаОрганизация");
	ТабДокМО.Вывести(ОбластьШапка);
	
	ОрганизацияТекущая = Неопределено;
	ЕстьДанные = Ложь;
	Для каждого СтрокаМО Из Набор Цикл 
		ЕстьДанные = Истина;
		Если НЕ ОрганизацияТекущая = СтрокаМО.Организация Тогда
			Если НЕ ОрганизацияТекущая = Неопределено Тогда
				ТабДокМО.ЗакончитьГруппуСтрок();	
			КонецЕсли;	
			ОрганизацияТекущая = СтрокаМО.Организация;
			ОбластьСтрокаОрганизация.Параметры.Организация = ОрганизацияТекущая;
			ТабДокМО.Вывести(ОбластьСтрокаОрганизация);
			ТабДокМО.НачатьГруппуСтрок("Организация");
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаПериод.Параметры, СтрокаМО,,"Период");
		ОбластьСтрокаПериод.Параметры.Период = Формат(СтрокаМО.Период, "ДЛФ=Д");
		ТабДокМО.Вывести(ОбластьСтрокаПериод);
	КонецЦикла;
	Если ЕстьДанные Тогда 
		ТабДокМО.ЗакончитьГруппуСтрок();
	КонецЕсли;	
	ОбъектДокумент.ДанныеМО = Новый ХранилищеЗначения(ТабДокМО, Новый СжатиеДанных(9));	
	
КонецПроцедуры

Процедура ЗагрузитьАналитики(ФайлАналитик, КэшИдентификаторов)
	
	ПространствоИмен = Неопределено;
	
	Файл = ОткрытьФайлПакета(ФайлАналитик, "AnalyticsData", ПространствоИмен);
	Файл.Прочитать();
	
	ИмяТипа = Неопределено;
	
	Пока Файл.ТипУзла <> ТипУзлаXML.КонецЭлемента Цикл
		Если Файл.Имя = "ORGANIZATION" Тогда				
			ИмяТипа = Файл.Имя;
			Тип = ФабрикаXDTO.Тип(ПространствоИмен, ИмяТипа);
			
			ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(Файл, Тип);
			
			GUID = Новый УникальныйИдентификатор(ОбъектXDTO.GUID);
			НайденнаяСсылка = Справочники.Организации.ПолучитьСсылку(GUID);
			КэшИдентификаторов.Вставить(ОбъектXDTO.ID, НайденнаяСсылка.Наименование);
		Иначе
			Прервать;		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Остатки_ТекстЗапроса

Функция Остатки_ПолучитьТекстЗапросаСтоимостьОбъектовОС(ИмяОстатки, ПараметрыВыполнения)

	ТекстЗапроса = "";
	ПерваяИтерация = Истина; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
		|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК Субконто1,
		|	ЖурналПроводокЕПСБУОстатки.Субконто2 КАК Субконто2,
		|	ЖурналПроводокЕПСБУОстатки.Субконто3 КАК Субконто3,
		|	ЖурналПроводокЕПСБУОстатки.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС,
		|	ЖурналПроводокЕПСБУОстатки.КЭК КАК КЭК,
		|	ЖурналПроводокЕПСБУОстатки.ИФО КАК ИФО,
		|	ЖурналПроводокЕПСБУОстатки.Валюта КАК Валюта,
		|	ЖурналПроводокЕПСБУОстатки.Подразделение КАК Подразделение,
		|	ЖурналПроводокЕПСБУОстатки.ЖурналОпераций КАК ЖурналОпераций,
		|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО
		|ПОМЕСТИТЬ ВТОстаткиСчет
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&ПараметрДатаОстатки, , , ) КАК ЖурналПроводокЕПСБУОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
		|		И НЕ ЕПСБУВидыСубконто1.НомерСтроки ЕСТЬ NULL КАК ЕстьДоговоры,
		|	НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
		|		И НЕ ЕПСБУВидыСубконто2.НомерСтроки ЕСТЬ NULL КАК ЕстьЦМО,
		|	НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
		|		И НЕ ЕПСБУВидыСубконто3.НомерСтроки ЕСТЬ NULL КАК ЕстьКонтрагенты
		|ИЗ
		|	ВТОстаткиСчет КАК ВТОстаткиСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|		ПО ВТОстаткиСчет.Счет = ЕПСБУВидыСубконто.Ссылка
		|			И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ВидыСубконто.ОсновныеСредства))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто1
		|		ПО ВТОстаткиСчет.Счет = ЕПСБУВидыСубконто1.Ссылка
		|			И (ЕПСБУВидыСубконто1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ВидыСубконто.Договоры))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто2
		|		ПО ВТОстаткиСчет.Счет = ЕПСБУВидыСубконто2.Ссылка
		|			И (ЕПСБУВидыСубконто2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ВидыСубконто.ЦМО))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто3
		|		ПО ВТОстаткиСчет.Счет = ЕПСБУВидыСубконто3.Ссылка
		|			И (ЕПСБУВидыСубконто3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ВидыСубконто.Контрагенты))
		|ГДЕ
		|	(НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
		|				И НЕ ЕПСБУВидыСубконто1.НомерСтроки ЕСТЬ NULL
		|			ИЛИ НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
		|				И НЕ ЕПСБУВидыСубконто2.НомерСтроки ЕСТЬ NULL
		|			ИЛИ НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
		|				И НЕ ЕПСБУВидыСубконто3.НомерСтроки ЕСТЬ NULL)
		|			И НЕ(НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
		|					И НЕ ЕПСБУВидыСубконто1.НомерСтроки ЕСТЬ NULL
		|					И НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
		|					И НЕ ЕПСБУВидыСубконто2.НомерСтроки ЕСТЬ NULL
		|					И НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
		|					И НЕ ЕПСБУВидыСубконто3.НомерСтроки ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("ПараметрДатаОстатки", ?(ИмяОстатки = "Начало", ПараметрыВыполнения.НачалоПериода, 
	Новый Граница(КонецДня(ПараметрыВыполнения.ОкончаниеПериода), ВидГраницы.Включая)));
	
	ВыборкаРазрез = Запрос.Выполнить().Выбрать();
		
	МассивСрезСубконто = Новый Массив;

	Пока ВыборкаРазрез.Следующий() Цикл 
		СтрокаМассив = Новый Структура("ЕстьЦМО, ЕстьДоговоры, ЕстьКонтрагенты");
		ЗаполнитьЗначенияСвойств(СтрокаМассив, ВыборкаРазрез);
		МассивСрезСубконто.Добавить(СтрокаМассив);
		ШаблонВТ = Остатки_ПолучитьШаблонВТСтоимостьОбъектовОС(СтрокаМассив.ЕстьЦМО, СтрокаМассив.ЕстьДоговоры, СтрокаМассив.ЕстьКонтрагенты);
		ИмяВТ = "Есть" + ?(СтрокаМассив.ЕстьЦМО, "ЦМО", "") + ?(СтрокаМассив.ЕстьДоговоры, "Дог", "") + ?(СтрокаМассив.ЕстьКонтрагенты, "Кон", "");
		ШаблонВТ = СтрЗаменить(ШаблонВТ, "%ИмяВТСтоимостьОС", ИмяВТ);
		Если ПерваяИтерация Тогда
			ТекстЗапроса = ШаблонВТ + "
			|;
			|";
			ПерваяИтерация = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|////////////////////////////////////////////////////////////////////////////////
			|" + ШаблонВТ + "
			|;
			|";		
		КонецЕсли;	
	КонецЦикла;
	ПараметрыВыполнения.Вставить("МассивСрезСубконто_" + ИмяОстатки, МассивСрезСубконто);
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция Остатки_ПолучитьШаблонВТСтоимостьОбъектовОС(ЕстьЦМО, ЕстьДоговоры, ЕстьКонтрагенты) 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер," + ?(ЕстьЦМО, "
	|	СтоимостьОбъектовОСОстатки.ЦМО КАК ЦМО,", "") + ?(ЕстьДоговоры, "
	|	СтоимостьОбъектовОСОстатки.Договор КАК Договор,", "") + "
	|	СУММА(СтоимостьОбъектовОСОстатки.СтоимостьОстаток) КАК СтоимостьОстаток,
	|	СУММА(СтоимостьОбъектовОСОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СтоимостьОбъектовОСОстатки.Забаланс КАК Забаланс," + ?(ЕстьКонтрагенты, "
	|	СтоимостьОбъектовОСОстатки.Контрагент КАК Контрагент,", "") + "
	|	СтоимостьОбъектовОСОстатки.Амортизация КАК Амортизация,
	|	СтоимостьОбъектовОСОстатки.Обесценение КАК Обесценение,
	|	СтоимостьОбъектовОСОстатки.Счет КАК Счет,
	|	СтоимостьОбъектовОСОстатки.ГрупповойУчет КАК ГрупповойУчет
	|ПОМЕСТИТЬ ВТОстаткиОС_%ИмяОстатки_%ИмяВТСтоимостьОС
	|ИЗ
	|	ВТОстаткиОС_%ИмяОстатки_ЕстьЦМОДогКон КАК СтоимостьОбъектовОСОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОбъектовОСОстатки.Обесценение," + ?(ЕстьЦМО, "
	|	СтоимостьОбъектовОСОстатки.ЦМО,", "") + ?(ЕстьДоговоры, "
	|	СтоимостьОбъектовОСОстатки.Договор,", "") + ?(ЕстьКонтрагенты, "
	|	СтоимостьОбъектовОСОстатки.Контрагент,", "") + "
	|	СтоимостьОбъектовОСОстатки.Счет,
	|	СтоимостьОбъектовОСОстатки.ГрупповойУчет,
	|	СтоимостьОбъектовОСОстатки.Забаланс,
	|	СтоимостьОбъектовОСОстатки.Амортизация,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство";	
		  
	Возврат ТекстЗапроса;
	
КонецФункции	

Функция Остатки_ПолучитьПолеВыбораВТСтоимостьОбъектовОС(ОсновноеПоле, ВспомогательноеПоле, ПараметрыВыполнения)

	ИмяОстатки = ПараметрыВыполнения.ИмяОстатки;
	ТекстПоляВыбора = "ВЫБОР
	|					КОГДА ВТОстатки%ИмяОстатки_С_ОС.Амортизация ИЛИ ВТОстатки%ИмяОстатки_С_ОС.Обесценение ТОГДА" + 
	?(ОсновноеПоле = "ИнвентарныйНомер", "
	|						ВЫБОР КОГДА ВТОстаткиОС_%ИмяОстатки_АмортОбесц.%ОсновноеПоле ЕСТЬ NULL 
	|							ИЛИ ВТОстаткиОС_%ИмяОстатки_АмортОбесц.%ОсновноеПоле = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) ТОГДА
	|								ВТОстатки%ИмяОстатки_С_ОС.%ВспомогательноеПоле
	|						ИНАЧЕ ВТОстаткиОС_%ИмяОстатки_АмортОбесц.%ОсновноеПоле КОНЕЦ", "
	|						ЕСТЬNULL(ВТОстаткиОС_%ИмяОстатки_АмортОбесц.%ОсновноеПоле, ВТОстатки%ИмяОстатки_С_ОС.%ВспомогательноеПоле)") + "
	|					КОГДА НЕ ВТОстатки%ИмяОстатки_С_ОС.ЕстьЦМО И НЕ ВТОстатки%ИмяОстатки_С_ОС.ЕстьДоговоры И НЕ ВТОстатки%ИмяОстатки_С_ОС.ЕстьКонтрагенты ТОГДА" + 
	?(ОсновноеПоле = "ИнвентарныйНомер", "
	|						ВЫБОР КОГДА ВТОстаткиОС_%ИмяОстатки_НетЦМОДогКон.%ОсновноеПоле ЕСТЬ NULL 
	|							ИЛИ ВТОстаткиОС_%ИмяОстатки_НетЦМОДогКон.%ОсновноеПоле = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) ТОГДА
	|								ВТОстатки%ИмяОстатки_С_ОС.%ВспомогательноеПоле
	|						ИНАЧЕ ВТОстаткиОС_%ИмяОстатки_НетЦМОДогКон.%ОсновноеПоле КОНЕЦ", "
	|						ЕСТЬNULL(ВТОстаткиОС_%ИмяОстатки_НетЦМОДогКон.%ОсновноеПоле, ВТОстатки%ИмяОстатки_С_ОС.%ВспомогательноеПоле)");
	Для каждого СтрокаМассива Из ПараметрыВыполнения["МассивСрезСубконто_" + ИмяОстатки] Цикл
		ИмяВТ = "Есть" + ?(СтрокаМассива.ЕстьЦМО, "ЦМО", "") + ?(СтрокаМассива.ЕстьДоговоры, "Дог", "") + ?(СтрокаМассива.ЕстьКонтрагенты, "Кон", ""); 
		ТекстПоляВыбора = ТекстПоляВыбора + "
		|					КОГДА " + ?(СтрокаМассива.ЕстьЦМО, "", "НЕ ") + "ВТОстатки%ИмяОстатки_С_ОС.ЕстьЦМО И " + ?(СтрокаМассива.ЕстьДоговоры, "", "НЕ ") + "ВТОстатки%ИмяОстатки_С_ОС.ЕстьДоговоры И " + ?(СтрокаМассива.ЕстьКонтрагенты, "", "НЕ ") + "ВТОстатки%ИмяОстатки_С_ОС.ЕстьКонтрагенты ТОГДА" + 
		?(ОсновноеПоле = "ИнвентарныйНомер", "
		|						ВЫБОР КОГДА ВТОстаткиОС_%ИмяОстатки_" + ИмяВТ + ".%ОсновноеПоле ЕСТЬ NULL 
		|							ИЛИ ВТОстаткиОС_%ИмяОстатки_" + ИмяВТ + ".%ОсновноеПоле = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) ТОГДА
		|								ВТОстатки%ИмяОстатки_С_ОС.%ВспомогательноеПоле
		|						ИНАЧЕ ВТОстаткиОС_%ИмяОстатки_" + ИмяВТ + ".%ОсновноеПоле КОНЕЦ", "
		|						ЕСТЬNULL(ВТОстаткиОС_%ИмяОстатки_" + ИмяВТ + ".%ОсновноеПоле, ВТОстатки%ИмяОстатки_С_ОС.%ВспомогательноеПоле)");
	КонецЦикла;		
	ТекстПоляВыбора = ТекстПоляВыбора + "
	|					КОНЕЦ";
	ТекстПоляВыбора = СтрЗаменить(ТекстПоляВыбора, "%ОсновноеПоле", ОсновноеПоле);
	ТекстПоляВыбора = СтрЗаменить(ТекстПоляВыбора, "%ВспомогательноеПоле", ВспомогательноеПоле);
	Возврат ТекстПоляВыбора;
	
КонецФункции  

Функция Остатки_ПолучитьСоединенияВТСтоимостьОбъектовОС(ПараметрыВыполнения)
	
	ИмяОстатки = ПараметрыВыполнения.ИмяОстатки;
	БазовыеУсловияСоединения = "(НЕ ВТОстатки%ИмяОстатки_С_ОС.Счет В ИЕРАРХИИ (&СчетаИсключенияОС))
	|			И ВТОстатки%ИмяОстатки_С_ОС.Счет.Забалансовый = ВТОстаткиОС_%ИмяОстатки_%ИмяВТ.Забаланс
	|			И ВТОстатки%ИмяОстатки_С_ОС.Амортизация = ВТОстаткиОС_%ИмяОстатки_%ИмяВТ.Амортизация
	|			И ВТОстатки%ИмяОстатки_С_ОС.Обесценение = ВТОстаткиОС_%ИмяОстатки_%ИмяВТ.Обесценение
	|			И ВТОстатки%ИмяОстатки_С_ОС.ОС = ВТОстаткиОС_%ИмяОстатки_%ИмяВТ.ОсновноеСредство
	|			И ВТОстатки%ИмяОстатки_С_ОС.КодВерхнегоУровня = ВТОстаткиОС_%ИмяОстатки_%ИмяВТ.Счет";
	
	ТекстСоединения = "ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиОС_%ИмяОстатки_АмортОбесц КАК ВТОстаткиОС_%ИмяОстатки_АмортОбесц
	|		ПО " + СтрЗаменить(БазовыеУсловияСоединения, "%ИмяВТ", "АмортОбесц") + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиОС_%ИмяОстатки_НетЦМОДогКон КАК ВТОстаткиОС_%ИмяОстатки_НетЦМОДогКон
	|		ПО " + СтрЗаменить(БазовыеУсловияСоединения, "%ИмяВТ", "НетЦМОДогКон") + "
	|			И (НЕ ВТОстатки%ИмяОстатки_С_ОС.ЕстьЦМО И НЕ ВТОстатки%ИмяОстатки_С_ОС.ЕстьДоговоры И НЕ ВТОстатки%ИмяОстатки_С_ОС.ЕстьКонтрагенты)";
	Для каждого СтрокаМассива Из ПараметрыВыполнения["МассивСрезСубконто_" + ИмяОстатки] Цикл
		ИмяВТ = "Есть" + ?(СтрокаМассива.ЕстьЦМО, "ЦМО", "") + ?(СтрокаМассива.ЕстьДоговоры, "Дог", "") + ?(СтрокаМассива.ЕстьКонтрагенты, "Кон", ""); 
		ТекстСоединения = ТекстСоединения + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиОС_%ИмяОстатки_" + ИмяВТ + " КАК ВТОстаткиОС_%ИмяОстатки_" + ИмяВТ + "
		|		ПО " + СтрЗаменить(БазовыеУсловияСоединения, "%ИмяВТ", ИмяВТ) + "
		|			И (" 
		+ ?(СтрокаМассива.ЕстьЦМО, "ВТОстатки%ИмяОстатки_С_ОС.ЦМО = ВТОстаткиОС_%ИмяОстатки_" + ИмяВТ + ".ЦМО И ", "НЕ ") + "ВТОстатки%ИмяОстатки_С_ОС.ЕстьЦМО И " 
		+ ?(СтрокаМассива.ЕстьДоговоры, "ВТОстатки%ИмяОстатки_С_ОС.Договор = ВТОстаткиОС_%ИмяОстатки_" + ИмяВТ + ".Договор И ", "НЕ ") + "ВТОстатки%ИмяОстатки_С_ОС.ЕстьДоговоры И " 
		+ ?(СтрокаМассива.ЕстьКонтрагенты, "ВТОстатки%ИмяОстатки_С_ОС.Контрагент = ВТОстаткиОС_%ИмяОстатки_" + ИмяВТ + ".Контрагент И ", "НЕ ") + "ВТОстатки%ИмяОстатки_С_ОС.ЕстьКонтрагенты)"; 
	КонецЦикла;		
	Возврат ТекстСоединения;
	
КонецФункции

Функция Остатки_УничтожитьТаблицыСтоимостьОС(ПараметрыВыполнения) 
	
	ТекстЗапроса = "
	|УНИЧТОЖИТЬ ВТОстаткиОС_Начало_ЕстьЦМОДогКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОстаткиОС_Начало_НетЦМОДогКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОстаткиОС_Начало_АмортОбесц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОстаткиОС_Конец_ЕстьЦМОДогКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОстаткиОС_Конец_НетЦМОДогКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОстаткиОС_Конец_АмортОбесц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////"; 
	
	Для Итерация = 1 По 2 Цикл
		ИмяОстатки = ?(Итерация = 1, "Начало", "Конец");
		Для каждого СтрокаМассив ИЗ ПараметрыВыполнения["МассивСрезСубконто_" + ИмяОстатки] Цикл 
			ИмяВТ = "Есть" + ?(СтрокаМассив.ЕстьЦМО, "ЦМО", "") + ?(СтрокаМассив.ЕстьДоговоры, "Дог", "") + ?(СтрокаМассив.ЕстьКонтрагенты, "Кон", "");
			ТекстЗапроса = ТекстЗапроса + "
			|УНИЧТОЖИТЬ  ВТОстаткиОС_" + ИмяОстатки + "_" + ИмяВТ + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////";		
		КонецЦикла;

	КонецЦикла;

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаОстатки(ИмяОстатки, ПараметрДатаОстаткиГраница, ПараметрДатаОстатки, ДополнительныеПараметры)
	
	ДополнительныеПараметры.ПараметрыВыполнения.Вставить("ИмяОстатки", ИмяОстатки);
	
	УсловиеСчета = "";
	Для каждого СтрокаСубконто Из ДополнительныеПараметры.ПараметрыВыполнения.СубконтоНаСчетах Цикл
		УсловиеСчета = УсловиеСчета + ?(УсловиеСчета = "", "", " И ") + "НЕ Счет В (&Счета_" + СтрокаСубконто.Идентификатор + ")";	
	КонецЦикла;	
	
	ТекстЗапроса =   	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.КФО, Значение(Перечисление.КВД.ПустаяСсылка)) КАК КФО,
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто1, ЗНАЧЕНИЕ(Документ.ПакетыДанныхДляМСД.ПустаяСсылка)) КАК Субконто1,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто2, ЗНАЧЕНИЕ(Документ.ПакетыДанныхДляМСД.ПустаяСсылка)) КАК Субконто2,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто3, ЗНАЧЕНИЕ(Документ.ПакетыДанныхДляМСД.ПустаяСсылка)) КАК Субконто3,
	|	ЖурналПроводокЕПСБУОстатки.Организация КАК Организация,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.КПС, Значение(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.ИФО, Значение(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Валюта, Значение(Справочник.Валюты.ПустаяСсылка)) КАК Валюта
	|ПОМЕСТИТЬ ВТОстатки%ИмяОстатки_БезКЭК
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(%ПараметрДатаОстаткиГраница, " + УсловиеСчета + ", , ) КАК ЖурналПроводокЕПСБУОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
	|		ПО ЖурналПроводокЕПСБУОстатки.Организация = ВТОрганизацииФедеральногоБюджета.Организация 
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ВТПланСчетов
	|		ПО ЖурналПроводокЕПСБУОстатки.Счет = ВТПланСчетов.Ссылка" +
	?(ДополнительныеПараметры.ПерезагружаемыеПериоды, "
	|ГДЕ
	|	ВТПланСчетов.Код В (&СчетаПерезагружаемыеПериоды)", "") + 
	ПолучитьТекстЗапросаОстаткиБезКЭК(ДополнительныеПараметры) + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3,
	|	Организация,
	|	КПС,
	|	ИФО,
	|	Валюта,
	|	КФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.КФО, ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)) КАК КФО,
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто1, ЗНАЧЕНИЕ(Документ.ПакетыДанныхДляМСД.ПустаяСсылка)) КАК Субконто1,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто2, ЗНАЧЕНИЕ(Документ.ПакетыДанныхДляМСД.ПустаяСсылка)) КАК Субконто2,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто3, ЗНАЧЕНИЕ(Документ.ПакетыДанныхДляМСД.ПустаяСсылка)) КАК Субконто3,
	|	ЖурналПроводокЕПСБУОстатки.Организация КАК Организация,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.КПС, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
	|	ЖурналПроводокЕПСБУОстатки.КЭК КАК КЭК,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Валюта, 
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт КАК СуммаОстатокКт,
	|	ЖурналПроводокЕПСБУОстатки.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
	|	ЖурналПроводокЕПСБУОстатки.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт КАК КоличествоОстатокДт,
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокКт КАК КоличествоОстатокКт
	|ПОМЕСТИТЬ ВТОстатки%ИмяОстатки_СКЭК
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(%ПараметрДатаОстаткиГраница, " + УсловиеСчета + ", , ) КАК ЖурналПроводокЕПСБУОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
	|		ПО ЖурналПроводокЕПСБУОстатки.Организация = ВТОрганизацииФедеральногоБюджета.Организация 
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ВТПланСчетов
	|		ПО ЖурналПроводокЕПСБУОстатки.Счет = ВТПланСчетов.Ссылка" +
	?(ДополнительныеПараметры.ПерезагружаемыеПериоды, "
	|ГДЕ
	|	ВТПланСчетов.Код В (&СчетаПерезагружаемыеПериоды)", "") + 
	ПолучитьТекстЗапросаОстаткиСКЭК(ДополнительныеПараметры) + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет,
	|	Субконто1,
	|	Субконто2,
	|	Субконто3,
	|	Организация,
	|	КПС,
	|	ИФО,
	|	Валюта,
	|	КФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстатки_СКЭК.КФО КАК КФО,
	|	ВТОстатки_СКЭК.Счет КАК Счет," +
	СтрЗаменить(СтрЗаменить(?(ДополнительныеПараметры.ПараметрыВыполнения.ИспользуетсяБГУСпец, МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаСубконто(Истина), "
	|	ВТОстатки_СКЭК.Субконто1"), 
	"%ИмяВТ", "ВТОстатки_СКЭК"), "%Суффикс", "") + " КАК Субконто1,
	|	ВТОстатки_СКЭК.Субконто2 КАК Субконто2,
	|	ВТОстатки_СКЭК.Субконто3 КАК Субконто3,
	|	ВТОстатки_СКЭК.Организация КАК Организация,
	|	ВТОстатки_СКЭК.КПС КАК КПС,
	|	ВТОстатки_СКЭК.КЭК КАК КЭК,
	|	ВТОстатки_СКЭК.ИФО КАК ИФО,
	|	ВТОстатки_СКЭК.Валюта КАК Валюта,
	|	ВТОстатки_СКЭК.СуммаОстаток КАК СуммаОстаток,
	|	ВТОстатки_СКЭК.СуммаОстатокДт КАК СуммаОстатокДт,
	|	ВТОстатки_СКЭК.СуммаОстатокКт КАК СуммаОстатокКт,
	|	ВТОстатки_СКЭК.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
	|	ВТОстатки_СКЭК.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
	|	ВТОстатки_СКЭК.КоличествоОстатокДт КАК КоличествоОстатокДт,
	|	ВТОстатки_СКЭК.КоличествоОстатокКт КАК КоличествоОстатокКт
	|ПОМЕСТИТЬ ВТОстатки%ИмяОстатки_Предварительно
	|ИЗ
	|	ВТОстатки%ИмяОстатки_СКЭК КАК ВТОстатки_СКЭК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОстатки%ИмяОстатки_БезКЭК КАК ВТОстатки_БезКЭК
	|		ПО (ВТОстатки_СКЭК.Счет = ВТОстатки_БезКЭК.Счет
	|				И ВТОстатки_СКЭК.Субконто1 = ВТОстатки_БезКЭК.Субконто1
	|				И ВТОстатки_СКЭК.Субконто2 = ВТОстатки_БезКЭК.Субконто2
	|				И ВТОстатки_СКЭК.Субконто3 = ВТОстатки_БезКЭК.Субконто3
	|				И ВТОстатки_СКЭК.Организация = ВТОстатки_БезКЭК.Организация
	|				И ВТОстатки_СКЭК.КПС = ВТОстатки_БезКЭК.КПС
	|				И ВТОстатки_СКЭК.ИФО = ВТОстатки_БезКЭК.ИФО
	|				И ВТОстатки_СКЭК.Валюта = ВТОстатки_БезКЭК.Валюта
	|				И ВТОстатки_СКЭК.КФО = ВТОстатки_БезКЭК.КФО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОстатки%ИмяОстатки_БезКЭК
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОстатки%ИмяОстатки_СКЭК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОстатки.ЦМО КАК ЦМО,
	|	СтоимостьОбъектовОСОстатки.Договор КАК Договор,
	|	СтоимостьОбъектовОСОстатки.СтоимостьОстаток КАК СтоимостьОстаток,
	|	СтоимостьОбъектовОСОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	НЕ СтоимостьОбъектовОСОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе) КАК Забаланс,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ЛОЖЬ КАК Амортизация,
	|	ЛОЖЬ КАК Обесценение,
	|	ВЫБОР
	|		КОГДА СтоимостьОбъектовОСОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|			ТОГДА ""101.00""
	|		КОГДА СтоимостьОбъектовОСОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|			ТОГДА ""21""
	|		КОГДА СтоимостьОбъектовОСОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении)
	|			ТОГДА ""02""
	|		КОГДА СтоимостьОбъектовОСОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование)
	|			ТОГДА ""01""
	|		КОГДА СтоимостьОбъектовОСОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВУправление)
	|			ТОГДА ""24""
	|		КОГДА СтоимостьОбъектовОСОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду)
	|			ТОГДА ""25""
	|		КОГДА СтоимостьОбъектовОСОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование)
	|			ТОГДА ""26""
	|		КОГДА СтоимостьОбъектовОСОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВЛичноеПользование)
	|			ТОГДА ""27""
	|	КОНЕЦ КАК Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ) КАК ГрупповойУчет
	|ПОМЕСТИТЬ ВТОстаткиОС_%ИмяОстатки_ЕстьЦМОДогКон
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(%ПараметрДатаОстатки, НЕ ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК СтоимостьОбъектовОСОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО СтоимостьОбъектовОСОстатки.ОсновноеСредство = ОсновныеСредства.Ссылка
	|ГДЕ
	|	(СтоимостьОбъектовОСОстатки.КоличествоОстаток = 1
	|			ИЛИ СтоимостьОбъектовОСОстатки.КоличествоОстаток = 0)
	|	И СтоимостьОбъектовОСОстатки.СтоимостьОстаток >= 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.ОсновноеСредство,
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.ИнвентарныйНомер,
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.ЦМО КАК ЦМО,
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.Договор КАК Договор,
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.СтоимостьОстаток,
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.КоличествоОстаток,
	|	ИСТИНА,
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.Контрагент КАК Контрагент,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|			ТОГДА ""101.00""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|			ТОГДА ""21""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении)
	|			ТОГДА ""02""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование)
	|			ТОГДА ""01""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВУправление)
	|			ТОГДА ""24""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду)
	|			ТОГДА ""25""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование)
	|			ТОГДА ""26""
	|		КОГДА СтоимостьОбъектовОСПоКонтрагентамОстатки.ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВЛичноеПользование)
	|			ТОГДА ""27""
	|	КОНЕЦ,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам.Остатки(%ПараметрДатаОстатки, НЕ ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК СтоимостьОбъектовОСПоКонтрагентамОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО СтоимостьОбъектовОСПоКонтрагентамОстатки.ОсновноеСредство = ОсновныеСредства.Ссылка
	|ГДЕ
	|	(СтоимостьОбъектовОСПоКонтрагентамОстатки.КоличествоОстаток = 1
	|			ИЛИ СтоимостьОбъектовОСПоКонтрагентамОстатки.КоличествоОстаток = 0)
	|	И СтоимостьОбъектовОСПоКонтрагентамОстатки.СтоимостьОстаток >= 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|" +
	Остатки_ПолучитьТекстЗапросаСтоимостьОбъектовОС(ИмяОстатки, ДополнительныеПараметры.ПараметрыВыполнения) + "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СУММА(СтоимостьОбъектовОСОстатки.СтоимостьОстаток) КАК СтоимостьОстаток,
	|	СУММА(СтоимостьОбъектовОСОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СтоимостьОбъектовОСОстатки.Забаланс КАК Забаланс,
	|	СтоимостьОбъектовОСОстатки.Амортизация КАК Амортизация,
	|	СтоимостьОбъектовОСОстатки.Обесценение КАК Обесценение,
	|	СтоимостьОбъектовОСОстатки.Счет КАК Счет,
	|	СтоимостьОбъектовОСОстатки.ГрупповойУчет КАК ГрупповойУчет
	|ПОМЕСТИТЬ ВТОстаткиОС_%ИмяОстатки_НетЦМОДогКон
	|ИЗ
	|	ВТОстаткиОС_%ИмяОстатки_ЕстьЦМОДогКон КАК СтоимостьОбъектовОСОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОбъектовОСОстатки.Обесценение,
	|	СтоимостьОбъектовОСОстатки.Счет,
	|	СтоимостьОбъектовОСОстатки.ГрупповойУчет,
	|	СтоимостьОбъектовОСОстатки.Забаланс,
	|	СтоимостьОбъектовОСОстатки.Амортизация,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	АмортизацияОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка) КАК ЦМО,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)КАК Договор,
	|	АмортизацияОбъектовОСОстатки.СуммаАмортизацииОстаток КАК СтоимостьОстаток,
	|	0 КАК КоличествоОстаток,
	|	ЛОЖЬ КАК Забаланс,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
	|	ИСТИНА КАК Амортизация,
	|	ЛОЖЬ КАК Обесценение,
	|	""104.00"" КАК Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ) КАК ГрупповойУчет
	|ПОМЕСТИТЬ ВТОстаткиОС_%ИмяОстатки_АмортОбесц
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Остатки(%ПараметрДатаОстатки, НЕ ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК АмортизацияОбъектовОСОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО АмортизацияОбъектовОСОстатки.ОсновноеСредство = ОсновныеСредства.Ссылка
	|ГДЕ
	|	НЕ АмортизацияОбъектовОСОстатки.СуммаАмортизацииОстаток = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АмортизацияОбъектовОСОстатки.ОсновноеСредство,
	|	АмортизацияОбъектовОСОстатки.ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	АмортизацияОбъектовОСОстатки.СуммаОбесцененияОстаток,
	|	0,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	""114.00"",
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Остатки(%ПараметрДатаОстатки, НЕ ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК АмортизацияОбъектовОСОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО АмортизацияОбъектовОСОстатки.ОсновноеСредство = ОсновныеСредства.Ссылка
	|ГДЕ
	|	НЕ АмортизацияОбъектовОСОстатки.СуммаОбесцененияОстаток = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстатки%ИмяОстатки_Предварительно.Счет КАК Счет,
	|	ВТОстатки%ИмяОстатки_Предварительно.Субконто1 КАК Субконто1,
	|	ВТОстатки%ИмяОстатки_Предварительно.Субконто2 КАК Субконто2,
	|	ВТОстатки%ИмяОстатки_Предварительно.Субконто3 КАК Субконто3,
	|	ВТОстатки%ИмяОстатки_Предварительно.Организация КАК Организация,
	|	ВТОстатки%ИмяОстатки_Предварительно.КПС КАК КПС,
	|	ВЫБОР
	|		КОГДА ВТОстатки%ИмяОстатки_Предварительно.Счет В (&СчетаПоКЭК)
	|			ТОГДА ЕСТЬNULL(КОСГУ.Код, ""000"")
	|		КОГДА ВТОстатки%ИмяОстатки_Предварительно.Счет В (&СчетаКИСЕ)
	|			ТОГДА ""00"" + ЕСТЬNULL(ПОДСТРОКА(КОСГУ.Код, 3, 1), ""0"")
	|		КОГДА ВТОстатки%ИмяОстатки_Предварительно.Счет В (&ОборотныеСчета)
	|			ТОГДА ""000""
	|		ИНАЧЕ ЕСТЬNULL(КОСГУ.Код, ""000"")
	|	КОНЕЦ КАК КЭК,
	|	ВТОстатки%ИмяОстатки_Предварительно.ИФО КАК ИФО,
	|	ВТОстатки%ИмяОстатки_Предварительно.Валюта КАК Валюта,
	|	СУММА(ВТОстатки%ИмяОстатки_Предварительно.СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(ВТОстатки%ИмяОстатки_Предварительно.СуммаОстатокДт) КАК СуммаОстатокДт,
	|	СУММА(ВТОстатки%ИмяОстатки_Предварительно.СуммаОстатокКт) КАК СуммаОстатокКт,
	|	СУММА(ВТОстатки%ИмяОстатки_Предварительно.ВалютнаяСуммаОстатокДт) КАК ВалютнаяСуммаОстатокДт,
	|	СУММА(ВТОстатки%ИмяОстатки_Предварительно.ВалютнаяСуммаОстатокКт) КАК ВалютнаяСуммаОстатокКт,
	|	СУММА(ВТОстатки%ИмяОстатки_Предварительно.КоличествоОстатокДт) КАК КоличествоОстатокДт,
	|	СУММА(ВТОстатки%ИмяОстатки_Предварительно.КоличествоОстатокКт) КАК КоличествоОстатокКт,
	|	ВТОстатки%ИмяОстатки_Предварительно.КФО КАК КФО,
	|	НЕ ЕПСБУВидыСубконто1.НомерСтроки ЕСТЬ NULL
	|		И НЕ ЕПСБУВидыСубконто2.НомерСтроки ЕСТЬ NULL КАК ЕстьЦМО,
	|	НЕ ЕПСБУВидыСубконто1.НомерСтроки ЕСТЬ NULL
	|		И НЕ ЕПСБУВидыСубконто3.НомерСтроки ЕСТЬ NULL КАК ЕстьДоговоры,
	|	НЕ ЕПСБУВидыСубконто4.Ссылка ЕСТЬ NULL КАК ЕстьКонтрагенты,
	|	ЕСТЬNULL(ЕПСБУВидыСубконто1.НомерСтроки, 0) КАК НомерСтрокиОС,
	|	ЕСТЬNULL(ЕПСБУВидыСубконто2.НомерСтроки, 0) КАК НомерСтрокиЦМО,
	|	ЕСТЬNULL(ЕПСБУВидыСубконто3.НомерСтроки, 0) КАК НомерСтрокиДоговоры,
	|	ЕСТЬNULL(ЕПСБУВидыСубконто4.НомерСтроки, 0) КАК НомерСтрокиКонтрагенты,
	|	ПОДСТРОКА(ВТПланСчетов.Код, 1, 3) = ""104"" КАК Амортизация,
	|	ПОДСТРОКА(ВТПланСчетов.Код, 1, 3) = ""114"" КАК Обесценение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТПланСчетов.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетов.КодРодитель, ВТПланСчетов.Код)) = ""102.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетов.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетов.КодРодитель, ВТПланСчетов.Код)) = ""103.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетов.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетов.КодРодитель, ВТПланСчетов.Код)) = ""111.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетов.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетов.КодРодитель, ВТПланСчетов.Код)) = ""108.00""
	|			ТОГДА ""101.00""
	|		ИНАЧЕ ЕСТЬNULL(ВТПланСчетов.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетов.КодРодитель, ВТПланСчетов.Код))
	|	КОНЕЦ КАК КодВерхнегоУровня
	|ПОМЕСТИТЬ ВТОстатки%ИмяОстатки
	|ИЗ
	|	ВТОстатки%ИмяОстатки_Предварительно КАК ВТОстатки%ИмяОстатки_Предварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто1
	|		ПО ВТОстатки%ИмяОстатки_Предварительно.Счет = ЕПСБУВидыСубконто1.Ссылка
	|			И (ЕПСБУВидыСубконто1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ВидыСубконто.ОсновныеСредства))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто3
	|		ПО ВТОстатки%ИмяОстатки_Предварительно.Счет = ЕПСБУВидыСубконто3.Ссылка
	|			И (ЕПСБУВидыСубконто3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ВидыСубконто.Договоры)" + 
	?(ДополнительныеПараметры.ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|			ИЛИ " + СтрЗаменить(МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение(3), "%Суффикс", ""), "") + ")
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто2
	|		ПО ВТОстатки%ИмяОстатки_Предварительно.Счет = ЕПСБУВидыСубконто2.Ссылка
	|			И (ЕПСБУВидыСубконто2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ВидыСубконто.ЦМО))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК КОСГУ
	|		ПО ВТОстатки%ИмяОстатки_Предварительно.КЭК = КОСГУ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто4
	|		ПО ВТОстатки%ИмяОстатки_Предварительно.Счет = ЕПСБУВидыСубконто4.Ссылка
	|			И (ЕПСБУВидыСубконто4.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ВидыСубконто.Контрагенты)" + 
	?(ДополнительныеПараметры.ПараметрыВыполнения.ИспользуетсяБГУСпец, "
	|			ИЛИ " + СтрЗаменить(МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение(4), "%Суффикс", ""), "") + ")
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ВТПланСчетов
	|		ПО ВТОстатки%ИмяОстатки_Предварительно.Счет = ВТПланСчетов.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОстатки%ИмяОстатки_Предварительно.Счет,
	|	ВТОстатки%ИмяОстатки_Предварительно.Организация,
	|	ВТОстатки%ИмяОстатки_Предварительно.КПС,
	|	ВЫБОР
	|		КОГДА ВТОстатки%ИмяОстатки_Предварительно.Счет В (&СчетаПоКЭК)
	|			ТОГДА ЕСТЬNULL(КОСГУ.Код, ""000"")
	|		КОГДА ВТОстатки%ИмяОстатки_Предварительно.Счет В (&СчетаКИСЕ)
	|			ТОГДА ""00"" + ЕСТЬNULL(ПОДСТРОКА(КОСГУ.Код, 3, 1), ""0"")
	|		КОГДА ВТОстатки%ИмяОстатки_Предварительно.Счет В (&ОборотныеСчета)
	|			ТОГДА ""000""
	|		ИНАЧЕ ЕСТЬNULL(КОСГУ.Код, ""000"")
	|	КОНЕЦ,
	|	ВТОстатки%ИмяОстатки_Предварительно.ИФО,
	|	ВТОстатки%ИмяОстатки_Предварительно.Валюта,
	|	ВТОстатки%ИмяОстатки_Предварительно.КФО,
	|	НЕ ЕПСБУВидыСубконто1.НомерСтроки ЕСТЬ NULL
	|		И НЕ ЕПСБУВидыСубконто2.НомерСтроки ЕСТЬ NULL,
	|	НЕ ЕПСБУВидыСубконто1.НомерСтроки ЕСТЬ NULL
	|		И НЕ ЕПСБУВидыСубконто3.НомерСтроки ЕСТЬ NULL,
	|	ЕСТЬNULL(ЕПСБУВидыСубконто1.НомерСтроки, 0),
	|	ЕСТЬNULL(ЕПСБУВидыСубконто2.НомерСтроки, 0),
	|	ЕСТЬNULL(ЕПСБУВидыСубконто3.НомерСтроки, 0),
	|	НЕ ЕПСБУВидыСубконто4.Ссылка ЕСТЬ NULL,
	|	ЕСТЬNULL(ЕПСБУВидыСубконто4.НомерСтроки, 0),
	|	ПОДСТРОКА(ВТПланСчетов.Код, 1, 3) = ""104"",
	|	ПОДСТРОКА(ВТПланСчетов.Код, 1, 3) = ""114"",
	|	ВТОстатки%ИмяОстатки_Предварительно.Субконто1,
	|	ВТОстатки%ИмяОстатки_Предварительно.Субконто2,
	|	ВТОстатки%ИмяОстатки_Предварительно.Субконто3,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТПланСчетов.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетов.КодРодитель, ВТПланСчетов.Код)) = ""102.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетов.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетов.КодРодитель, ВТПланСчетов.Код)) = ""103.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетов.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетов.КодРодитель, ВТПланСчетов.Код)) = ""111.00""
	|				ИЛИ ЕСТЬNULL(ВТПланСчетов.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетов.КодРодитель, ВТПланСчетов.Код)) = ""108.00""
	|			ТОГДА ""101.00""
	|		ИНАЧЕ ЕСТЬNULL(ВТПланСчетов.КодРодтельРодитель, ЕСТЬNULL(ВТПланСчетов.КодРодитель, ВТПланСчетов.Код))
	|	КОНЕЦ
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстатки%ИмяОстатки.Счет КАК Счет,
	|	ВТОстатки%ИмяОстатки.Субконто1 КАК Субконто1,
	|	ВТОстатки%ИмяОстатки.Субконто2 КАК Субконто2,
	|	ВТОстатки%ИмяОстатки.Субконто3 КАК Субконто3,
	|	ВТОстатки%ИмяОстатки.Организация КАК Организация,
	|	ВТОстатки%ИмяОстатки.КПС КАК КПС,
	|	ВТОстатки%ИмяОстатки.КЭК КАК КЭК,
	|	ВТОстатки%ИмяОстатки.ИФО КАК ИФО,
	|	ВТОстатки%ИмяОстатки.Валюта КАК Валюта,
	|	ВТОстатки%ИмяОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВТОстатки%ИмяОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
	|	ВТОстатки%ИмяОстатки.СуммаОстатокКт КАК СуммаОстатокКт,
	|	ВТОстатки%ИмяОстатки.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
	|	ВТОстатки%ИмяОстатки.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
	|	ВТОстатки%ИмяОстатки.КоличествоОстатокДт КАК КоличествоОстатокДт,
	|	ВТОстатки%ИмяОстатки.КоличествоОстатокКт КАК КоличествоОстатокКт,
	|	ВТОстатки%ИмяОстатки.КФО КАК КФО,
	|	ВТОстатки%ИмяОстатки.ЕстьЦМО КАК ЕстьЦМО,
	|	ВТОстатки%ИмяОстатки.ЕстьДоговоры КАК ЕстьДоговоры,
	|	ВТОстатки%ИмяОстатки.ЕстьКонтрагенты КАК ЕстьКонтрагенты,
	|	ВТОстатки%ИмяОстатки.НомерСтрокиОС КАК НомерСтрокиОС,
	|	ВТОстатки%ИмяОстатки.НомерСтрокиЦМО КАК НомерСтрокиЦМО,
	|	ВТОстатки%ИмяОстатки.НомерСтрокиДоговоры КАК НомерСтрокиДоговоры,
	|	ВЫБОР
	|		КОГДА ВТОстатки%ИмяОстатки.НомерСтрокиОС = 1
	|			ТОГДА ВТОстатки%ИмяОстатки.Субконто1
	|		КОГДА ВТОстатки%ИмяОстатки.НомерСтрокиОС = 2
	|			ТОГДА ВТОстатки%ИмяОстатки.Субконто2
	|		КОГДА ВТОстатки%ИмяОстатки.НомерСтрокиОС = 3
	|			ТОГДА ВТОстатки%ИмяОстатки.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ОС,
	|	ВЫБОР
	|		КОГДА ВТОстатки%ИмяОстатки.НомерСтрокиЦМО = 1
	|			ТОГДА ВТОстатки%ИмяОстатки.Субконто1
	|		КОГДА ВТОстатки%ИмяОстатки.НомерСтрокиЦМО = 2
	|			ТОГДА ВТОстатки%ИмяОстатки.Субконто2
	|		КОГДА ВТОстатки%ИмяОстатки.НомерСтрокиЦМО = 3
	|			ТОГДА ВТОстатки%ИмяОстатки.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЦМО,
	|	ВЫБОР
	|		КОГДА ВТОстатки%ИмяОстатки.НомерСтрокиДоговоры = 1
	|			ТОГДА ВТОстатки%ИмяОстатки.Субконто1
	|		КОГДА ВТОстатки%ИмяОстатки.НомерСтрокиДоговоры = 2
	|			ТОГДА ВТОстатки%ИмяОстатки.Субконто2
	|		КОГДА ВТОстатки%ИмяОстатки.НомерСтрокиДоговоры = 3
	|			ТОГДА ВТОстатки%ИмяОстатки.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА ВТОстатки%ИмяОстатки.НомерСтрокиКонтрагенты = 1
	|			ТОГДА ВТОстатки%ИмяОстатки.Субконто1
	|		КОГДА ВТОстатки%ИмяОстатки.НомерСтрокиКонтрагенты = 2
	|			ТОГДА ВТОстатки%ИмяОстатки.Субконто2
	|		КОГДА ВТОстатки%ИмяОстатки.НомерСтрокиКонтрагенты = 3
	|			ТОГДА ВТОстатки%ИмяОстатки.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Контрагент,
	|	ВТОстатки%ИмяОстатки.Амортизация КАК Амортизация,
	|	ВТОстатки%ИмяОстатки.Обесценение КАК Обесценение,
	|	ВТОстатки%ИмяОстатки.КодВерхнегоУровня КАК КодВерхнегоУровня
	|ПОМЕСТИТЬ ВТОстатки%ИмяОстатки_С_ОС
	|ИЗ
	|	ВТОстатки%ИмяОстатки КАК ВТОстатки%ИмяОстатки
	|ГДЕ
	|	НЕ ВТОстатки%ИмяОстатки.НомерСтрокиОС = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстатки%ИмяОстатки.Счет КАК Счет,
	|	ВТОстатки%ИмяОстатки.Субконто1 КАК Субконто1,
	|	ВТОстатки%ИмяОстатки.Субконто2 КАК Субконто2,
	|	ВТОстатки%ИмяОстатки.Субконто3 КАК Субконто3,
	|	ВТОстатки%ИмяОстатки.Организация КАК Организация,
	|	ВТОстатки%ИмяОстатки.КПС КАК КПС,
	|	ВТОстатки%ИмяОстатки.КЭК КАК КЭК,
	|	ВТОстатки%ИмяОстатки.ИФО КАК ИФО,
	|	ВТОстатки%ИмяОстатки.Валюта КАК Валюта,
	|	ВТОстатки%ИмяОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВТОстатки%ИмяОстатки.СуммаОстатокДт КАК СуммаОстатокДт,
	|	ВТОстатки%ИмяОстатки.СуммаОстатокКт КАК СуммаОстатокКт,
	|	ВТОстатки%ИмяОстатки.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
	|	ВТОстатки%ИмяОстатки.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
	|	ВТОстатки%ИмяОстатки.КоличествоОстатокДт КАК КоличествоОстатокДт,
	|	ВТОстатки%ИмяОстатки.КоличествоОстатокКт КАК КоличествоОстатокКт,
	|	ВТОстатки%ИмяОстатки.КФО КАК КФО,
	|	ВТОстатки%ИмяОстатки.ЕстьЦМО КАК ЕстьЦМО,
	|	ВТОстатки%ИмяОстатки.ЕстьДоговоры КАК ЕстьДоговоры,
	|	ВТОстатки%ИмяОстатки.НомерСтрокиОС КАК НомерСтрокиОС
	|ПОМЕСТИТЬ ВТОстатки%ИмяОстатки_Без_ОС
	|ИЗ
	|	ВТОстатки%ИмяОстатки КАК ВТОстатки%ИмяОстатки
	|ГДЕ
	|	ВТОстатки%ИмяОстатки.НомерСтрокиОС = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОстатки%ИмяОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстатки%ИмяОстатки_С_ОС.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТОстатки%ИмяОстатки_С_ОС.Субконто1) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА " + Остатки_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("ИнвентарныйНомер", "Субконто1", ДополнительныеПараметры.ПараметрыВыполнения) + "
	|		ИНАЧЕ ВТОстатки%ИмяОстатки_С_ОС.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТОстатки%ИмяОстатки_С_ОС.Субконто2) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА " + Остатки_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("ИнвентарныйНомер", "Субконто2", ДополнительныеПараметры.ПараметрыВыполнения) + "
	|		ИНАЧЕ ВТОстатки%ИмяОстатки_С_ОС.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ВТОстатки%ИмяОстатки_С_ОС.Субконто3) = ТИП(Справочник.ОсновныеСредства)
	|			ТОГДА " + Остатки_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("ИнвентарныйНомер", "Субконто3", ДополнительныеПараметры.ПараметрыВыполнения) + "
	|		ИНАЧЕ ВТОстатки%ИмяОстатки_С_ОС.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	ВТОстатки%ИмяОстатки_С_ОС.Организация КАК Организация,
	|	ВТОстатки%ИмяОстатки_С_ОС.КПС КАК КПС,
	|	ВТОстатки%ИмяОстатки_С_ОС.КЭК КАК КЭК,
	|	ВТОстатки%ИмяОстатки_С_ОС.ИФО КАК ИФО,
	|	ВТОстатки%ИмяОстатки_С_ОС.Валюта КАК Валюта, 
	|	ВТОстатки%ИмяОстатки_С_ОС.СуммаОстаток КАК СуммаОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОстатки%ИмяОстатки_С_ОС.СуммаОстатокДт = 0
	|							И ВТОстатки%ИмяОстатки_С_ОС.КоличествоОстатокДт = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Остатки_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("СтоимостьОстаток", "СуммаОстатокДт", ДополнительныеПараметры.ПараметрыВыполнения) + "
	|				КОНЕЦ
	|		ИНАЧЕ ВТОстатки%ИмяОстатки_С_ОС.СуммаОстатокДт
	|	КОНЕЦ КАК СуммаОстатокДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА  ВТОстатки%ИмяОстатки_С_ОС.СуммаОстатокКт = 0
	|							И ВТОстатки%ИмяОстатки_С_ОС.КоличествоОстатокКт = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Остатки_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("СтоимостьОстаток", "СуммаОстатокКт", ДополнительныеПараметры.ПараметрыВыполнения) + "
	|				КОНЕЦ
	|		ИНАЧЕ ВТОстатки%ИмяОстатки_С_ОС.СуммаОстатокКт
	|	КОНЕЦ КАК СуммаОстатокКт,
	|	ВТОстатки%ИмяОстатки_С_ОС.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
	|	ВТОстатки%ИмяОстатки_С_ОС.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
	|	ВЫБОР КОГДА ЕПСБУ.Количественный ТОГДА ВЫБОР
	|		КОГДА ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОстатки%ИмяОстатки_С_ОС.СуммаОстатокДт = 0
	|							И ВТОстатки%ИмяОстатки_С_ОС.КоличествоОстатокДт = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Остатки_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("КоличествоОстаток", "КоличествоОстатокДт", ДополнительныеПараметры.ПараметрыВыполнения) + "
	|				КОНЕЦ
	|		ИНАЧЕ ВТОстатки%ИмяОстатки_С_ОС.КоличествоОстатокДт
	|	КОНЕЦ ИНАЧЕ 0 КОНЕЦ КАК КоличествоОстатокДт,
	|	ВЫБОР КОГДА ЕПСБУ.Количественный ТОГДА ВЫБОР
	|		КОГДА ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТОстатки%ИмяОстатки_С_ОС.СуммаОстатокКт = 0
	|							И ВТОстатки%ИмяОстатки_С_ОС.КоличествоОстатокКт = 0
	|						ТОГДА 0
	|					ИНАЧЕ " + Остатки_ПолучитьПолеВыбораВТСтоимостьОбъектовОС("КоличествоОстаток", "КоличествоОстатокКт", ДополнительныеПараметры.ПараметрыВыполнения) + "
	|				КОНЕЦ
	|		ИНАЧЕ ВТОстатки%ИмяОстатки_С_ОС.КоличествоОстатокКт
	|	КОНЕЦ ИНАЧЕ 0 КОНЕЦ КАК КоличествоОстатокКт,
	|	ВТОстатки%ИмяОстатки_С_ОС.КФО КАК КФО
	|ПОМЕСТИТЬ ВТОстатки%ИмяОстаткиОбработанная
	|ИЗ
	|	ВТОстатки%ИмяОстатки_С_ОС КАК ВТОстатки%ИмяОстатки_С_ОС
	|		" + Остатки_ПолучитьСоединенияВТСтоимостьОбъектовОС(ДополнительныеПараметры.ПараметрыВыполнения) + " 
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО ВТОстатки%ИмяОстатки_С_ОС.ОС = ОсновныеСредства.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ПО ВТОстатки%ИмяОстатки_С_ОС.Счет = ЕПСБУ.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТОстатки%ИмяОстатки_Без_ОС.Счет,
	|	ВТОстатки%ИмяОстатки_Без_ОС.Субконто1,
	|	ВТОстатки%ИмяОстатки_Без_ОС.Субконто2,
	|	ВТОстатки%ИмяОстатки_Без_ОС.Субконто3,
	|	ВТОстатки%ИмяОстатки_Без_ОС.Организация,
	|	ВТОстатки%ИмяОстатки_Без_ОС.КПС,
	|	ВТОстатки%ИмяОстатки_Без_ОС.КЭК,
	|	ВТОстатки%ИмяОстатки_Без_ОС.ИФО,
	|	ВТОстатки%ИмяОстатки_Без_ОС.Валюта,
	|	ВТОстатки%ИмяОстатки_Без_ОС.СуммаОстаток,
	|	ВТОстатки%ИмяОстатки_Без_ОС.СуммаОстатокДт,
	|	ВТОстатки%ИмяОстатки_Без_ОС.СуммаОстатокКт,
	|	ВТОстатки%ИмяОстатки_Без_ОС.ВалютнаяСуммаОстатокДт,
	|	ВТОстатки%ИмяОстатки_Без_ОС.ВалютнаяСуммаОстатокКт,
	|	ВЫБОР КОГДА ЕПСБУ.Количественный ТОГДА ВТОстатки%ИмяОстатки_Без_ОС.КоличествоОстатокДт ИНАЧЕ 0 КОНЕЦ,
	|	ВЫБОР КОГДА ЕПСБУ.Количественный ТОГДА ВТОстатки%ИмяОстатки_Без_ОС.КоличествоОстатокКт ИНАЧЕ 0 КОНЕЦ,
	|	ВТОстатки%ИмяОстатки_Без_ОС.КФО
	|ИЗ
	|	ВТОстатки%ИмяОстатки_Без_ОС КАК ВТОстатки%ИмяОстатки_Без_ОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ПО ВТОстатки%ИмяОстатки_Без_ОС.Счет = ЕПСБУ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОстатки%ИмяОстатки_С_ОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОстатки%ИмяОстатки_Без_ОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////" + 
	?(ДополнительныеПараметры.ПараметрыВыполнения.ИспользуетсяУчетФинВложений, "
	|ВЫБРАТЬ
	|	ЦенныеБумагиОстатки.Организация КАК Организация,
	|	ЦенныеБумагиОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЦенныеБумагиОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТЦенныеБумагиОстатки%ИмяОстатки
	|ИЗ
	|	РегистрНакопления.ЦенныеБумаги.Остатки(%ПараметрДатаОстатки, ) КАК ЦенныеБумагиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////", "");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяОстатки", ИмяОстатки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПараметрДатаОстаткиГраница", ПараметрДатаОстаткиГраница);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПараметрДатаОстатки", ПараметрДатаОстатки);
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция ПолучитьТекстЗапросаОстаткиПредварительно(ИмяОстатки, ПараметрДатаОстатки, ПараметрыВыполнения, ПерваяТаблицаОбъединения = Ложь, ИмяОстаткиПредварительно = "")
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВТОстатки%ИмяОстаткиОбработанная.Организация" 				    + ?(ПерваяТаблицаОбъединения, " КАК Организация", "") + ",
	|	%ПараметрДатаОстатки" 											+ ?(ПерваяТаблицаОбъединения, " КАК ДатаОкончания", "") + ",
	|	ЕПСБУ.Ссылка" 													+ ?(ПерваяТаблицаОбъединения, " КАК Счет", "") + ",
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТОстатки%ИмяОстаткиОбработанная.КФО)" 		+ ?(ПерваяТаблицаОбъединения, " КАК КФО", "") + ",
	|	ВТОстатки%ИмяОстаткиОбработанная.КФО" 							+ ?(ПерваяТаблицаОбъединения, " КАК КФОСсылка", "") + ",
	|	ЕСТЬNULL(КлассификационныеПризнакиСчетов.Код, """")" 			+ ?(ПерваяТаблицаОбъединения, " КАК КПС", "") + ",
	|	ЕСТЬNULL(КлассификационныеПризнакиСчетов.Ссылка, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка))" + ?(ПерваяТаблицаОбъединения, " КАК КПССсылка", "") + ",
	|	ВТОстатки%ИмяОстаткиОбработанная.КЭК" 							+ ?(ПерваяТаблицаОбъединения, " КАК КЭК", "") + ",
	|	ВТОстатки%ИмяОстаткиОбработанная.Субконто1" 					+ ?(ПерваяТаблицаОбъединения, " КАК Субконто1", "") + ",
	|	ВТОстатки%ИмяОстаткиОбработанная.Субконто2" 					+ ?(ПерваяТаблицаОбъединения, " КАК Субконто2", "") + ",
	|	ВТОстатки%ИмяОстаткиОбработанная.Субконто3" 					+ ?(ПерваяТаблицаОбъединения, " КАК Субконто3", "") + ",
	|	СУММА(ВТОстатки%ИмяОстаткиОбработанная.СуммаОстаток)" 			+ ?(ПерваяТаблицаОбъединения, " КАК СуммаОстаток", "") + ",
	|	СУММА(ВТОстатки%ИмяОстаткиОбработанная.СуммаОстатокДт)" 		+ ?(ПерваяТаблицаОбъединения, " КАК СуммаОстатокДт", "") + ",
	|	СУММА(ВТОстатки%ИмяОстаткиОбработанная.СуммаОстатокКт)" 		+ ?(ПерваяТаблицаОбъединения, " КАК СуммаОстатокКт", "") + ",
	|	СУММА(ВЫБОР
	|			КОГДА ВТТаблицаСвязейАналитик_Общ.Счет = ""31""" + ?(ПараметрыВыполнения.ИспользуетсяУчетФинВложений, "
	|				ТОГДА ЕСТЬNULL(ВТЦенныеБумагиОстатки%ИмяОстатки.КоличествоОстаток, ВТОстатки%ИмяОстаткиОбработанная.КоличествоОстатокДт)", "
	|				ТОГДА ВТОстатки%ИмяОстаткиОбработанная.КоличествоОстатокДт") + "
	|			ИНАЧЕ ВТОстатки%ИмяОстаткиОбработанная.КоличествоОстатокДт
	|		КОНЕЦ)" 													+ ?(ПерваяТаблицаОбъединения, " КАК КоличествоОстатокДт", "") + ",
	|	СУММА(ВТОстатки%ИмяОстаткиОбработанная.КоличествоОстатокКт)" 	+ ?(ПерваяТаблицаОбъединения, " КАК КоличествоОстатокКт", "") + ",
	|	ЕСТЬNULL(Валюты.Код, """")" 									+ ?(ПерваяТаблицаОбъединения, " КАК Валюта", "") + ",
	|	СУММА(ВТОстатки%ИмяОстаткиОбработанная.ВалютнаяСуммаОстатокДт)" + ?(ПерваяТаблицаОбъединения, " КАК ВалютнаяСуммаОстатокДт", "") + ",
	|	СУММА(ВТОстатки%ИмяОстаткиОбработанная.ВалютнаяСуммаОстатокКт)" + ?(ПерваяТаблицаОбъединения, " КАК ВалютнаяСуммаОстатокКт", "") + ",
	|	ВТТаблицаСвязейАналитик_Общ.Счет" 								+ ?(ПерваяТаблицаОбъединения, " КАК СчетКод", "") + ",
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитик_Общ.ВОстатках1
	|			ТОГДА ВТТаблицаСвязейАналитик_Общ.Аналитика1
	|		ИНАЧЕ """"
	|	КОНЕЦ" 															+ ?(ПерваяТаблицаОбъединения, " КАК Аналитика1", "") + ",
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитик_Общ.ВОстатках2
	|			ТОГДА ВТТаблицаСвязейАналитик_Общ.Аналитика2
	|		ИНАЧЕ """"
	|	КОНЕЦ" 															+ ?(ПерваяТаблицаОбъединения, " КАК Аналитика2", "") + ",
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитик_Общ.ВОстатках3
	|			ТОГДА ВТТаблицаСвязейАналитик_Общ.Аналитика3
	|		ИНАЧЕ """"
	|	КОНЕЦ" 															+ ?(ПерваяТаблицаОбъединения, " КАК Аналитика3", "") + ",
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитик_Общ.ВОстатках4
	|			ТОГДА ВТТаблицаСвязейАналитик_Общ.Аналитика4
	|		ИНАЧЕ """"
	|	КОНЕЦ" 															+ ?(ПерваяТаблицаОбъединения, " КАК Аналитика4", "") + ",
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитик_Общ.ВОстатках5
	|			ТОГДА ВТТаблицаСвязейАналитик_Общ.Аналитика5
	|		ИНАЧЕ """"
	|	КОНЕЦ" 															+ ?(ПерваяТаблицаОбъединения, " КАК Аналитика5", "") + ",
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитик_Общ.ВОстатках6
	|			ТОГДА ВТТаблицаСвязейАналитик_Общ.Аналитика6
	|		ИНАЧЕ """"
	|	КОНЕЦ" 															+ ?(ПерваяТаблицаОбъединения, " КАК Аналитика6", "") + ",
	|	ВТТаблицаСвязейАналитик_Общ.ОбязательноВОстатках1" 				+ ?(ПерваяТаблицаОбъединения, " КАК ОбязательноВОстатках1", "") + ",
	|	ВТТаблицаСвязейАналитик_Общ.ОбязательноВОстатках2" 				+ ?(ПерваяТаблицаОбъединения, " КАК ОбязательноВОстатках2", "") + ",
	|	ВТТаблицаСвязейАналитик_Общ.ОбязательноВОстатках3" 				+ ?(ПерваяТаблицаОбъединения, " КАК ОбязательноВОстатках3", "") + ",
	|	ВТТаблицаСвязейАналитик_Общ.ОбязательноВОстатках4" 				+ ?(ПерваяТаблицаОбъединения, " КАК ОбязательноВОстатках4", "") + ",
	|	ВТТаблицаСвязейАналитик_Общ.ОбязательноВОстатках5" 				+ ?(ПерваяТаблицаОбъединения, " КАК ОбязательноВОстатках5", "") + ",
	|	ВТТаблицаСвязейАналитик_Общ.ОбязательноВОстатках6" 				+ ?(ПерваяТаблицаОбъединения, " КАК ОбязательноВОстатках6", "") + ",
	|	ВТОстатки%ИмяОстаткиОбработанная.Счет" 							+ ?(ПерваяТаблицаОбъединения, " КАК СубСчет", "") + ",
	|	" + ПолучитьТекстЗапросаТипКБК("КлассификационныеПризнакиСчетов") + 
	"" 															        + ?(ПерваяТаблицаОбъединения, " КАК ТипКБК", "") + ",
	|	ЕПСБУ.Вид" 														+ ?(ПерваяТаблицаОбъединения, " КАК ВидСчета", "") + ",
	|	ЕПСБУ.Код" 														+ ?(ПерваяТаблицаОбъединения, " КАК СубСчетКод", "") + " 
	|" 																	+ ?(ПерваяТаблицаОбъединения, "ПОМЕСТИТЬ %ИмяОстаткиПредварительно", "") + " 
	|ИЗ
	|	ВТОстатки%ИмяОстаткиОбработанная КАК ВТОстатки%ИмяОстаткиОбработанная
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ЕПСБУ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитик_Общ
	|			ПО (ЕПСБУ.Код = ВТТаблицаСвязейАналитик_Общ.Счет
	|					ИЛИ ЕПСБУ.КодРодитель = ВТТаблицаСвязейАналитик_Общ.Счет
	|					ИЛИ ЕПСБУ.КодРодтельРодитель = ВТТаблицаСвязейАналитик_Общ.Счет)
	|		ПО ВТОстатки%ИмяОстаткиОбработанная.Счет = ЕПСБУ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
	|		ПО ВТОстатки%ИмяОстаткиОбработанная.Организация = ВТОрганизацииФедеральногоБюджета.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификационныеПризнакиСчетов КАК КлассификационныеПризнакиСчетов
	|		ПО ВТОстатки%ИмяОстаткиОбработанная.КПС = КлассификационныеПризнакиСчетов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ВТОстатки%ИмяОстаткиОбработанная.Валюта = Валюты.Ссылка" + ?(ПараметрыВыполнения.ИспользуетсяУчетФинВложений, "
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦенныеБумагиОстатки%ИмяОстатки КАК ВТЦенныеБумагиОстатки%ИмяОстатки
	|		ПО ВТОстатки%ИмяОстаткиОбработанная.Организация = ВТЦенныеБумагиОстатки%ИмяОстатки.Организация
	|			И (ВЫБОР
	|				КОГДА ВТОстатки%ИмяОстаткиОбработанная.Субконто2 ССЫЛКА Справочник.ОбъектыФинансовыхВложений
	|					ТОГДА ВТОстатки%ИмяОстаткиОбработанная.Субконто2 = ВТЦенныеБумагиОстатки%ИмяОстатки.ЦеннаяБумага
	|			КОНЕЦ)", "") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТОстатки%ИмяОстаткиОбработанная.Организация,
	|	ЕПСБУ.Ссылка,
	|	ВТОстатки%ИмяОстаткиОбработанная.Субконто1,
	|	ВТОстатки%ИмяОстаткиОбработанная.Субконто2,
	|	ВТОстатки%ИмяОстаткиОбработанная.Субконто3,
	|	ВТТаблицаСвязейАналитик_Общ.ОбязательноВОстатках2,
	|	ВТТаблицаСвязейАналитик_Общ.ОбязательноВОстатках3,
	|	ВТТаблицаСвязейАналитик_Общ.ОбязательноВОстатках4,
	|	ВТТаблицаСвязейАналитик_Общ.ОбязательноВОстатках5,
	|	ВТТаблицаСвязейАналитик_Общ.ОбязательноВОстатках6,
	|	ВТОстатки%ИмяОстаткиОбработанная.Счет,
	|	ЕСТЬNULL(КлассификационныеПризнакиСчетов.Код, """"),
	|	ЕСТЬNULL(КлассификационныеПризнакиСчетов.Ссылка, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)),
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитик_Общ.ВОстатках1
	|			ТОГДА ВТТаблицаСвязейАналитик_Общ.Аналитика1
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитик_Общ.ВОстатках2
	|			ТОГДА ВТТаблицаСвязейАналитик_Общ.Аналитика2
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитик_Общ.ВОстатках3
	|			ТОГДА ВТТаблицаСвязейАналитик_Общ.Аналитика3
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитик_Общ.ВОстатках4
	|			ТОГДА ВТТаблицаСвязейАналитик_Общ.Аналитика4
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитик_Общ.ВОстатках5
	|			ТОГДА ВТТаблицаСвязейАналитик_Общ.Аналитика5
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТТаблицаСвязейАналитик_Общ.ВОстатках6
	|			ТОГДА ВТТаблицаСвязейАналитик_Общ.Аналитика6
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЕПСБУ.Вид,
	|	ВТТаблицаСвязейАналитик_Общ.ОбязательноВОстатках1,
	|	ЕСТЬNULL(Валюты.Код, """"),
	|	ВТТаблицаСвязейАналитик_Общ.Счет,
	|	ВТОстатки%ИмяОстаткиОбработанная.КЭК,
	|	ЕПСБУ.Код,
	|	" + ПолучитьТекстЗапросаТипКБК("КлассификационныеПризнакиСчетов") + ",
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТОстатки%ИмяОстаткиОбработанная.КФО),
	|	ВТОстатки%ИмяОстаткиОбработанная.КФО"; 
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса ,"%ИмяОстаткиПредварительно" , ИмяОстаткиПредварительно);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса ,"%ИмяОстатки" , ИмяОстатки);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПараметрДатаОстатки", ПараметрДатаОстатки);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция УничтожитьТаблицыПредварительно(ИмяОстатки) 
	
	ТекстЗапроса =
	"УНИЧТОЖИТЬ ВТОстатки%ИмяОстатки_Предварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОстатки%ИмяОстаткиОбработанная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса ,"%ИмяОстатки" , ИмяОстатки);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаОстаткиОкончательно(ИмяОстаткиПредварительно, ИмяОстаткиБезСубконто4, ИмяОстатки)
	
	ИспользуетсяБГУСпец = Ложь;
	МодульСбораДанныхПереопределяемый.ОпределитьИспользованиеБГУСпец(ИспользуетсяБГУСпец);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВТОстаткиПредварительно.Организация КАК Организация,
	|	ВТОстаткиПредварительно.ДатаОкончания КАК ДатаОкончания,
	|	ВТОстаткиПредварительно.Счет КАК Счет,
	|	ВТОстаткиПредварительно.КФО КАК КФО,
	|	ВТОстаткиПредварительно.КФОСсылка КАК КФОСсылка,
	|	ВТОстаткиПредварительно.КПС КАК КПС,
	|	ВТОстаткиПредварительно.КПССсылка КАК КПССсылка,
	|	ВТОстаткиПредварительно.КЭК КАК КЭК,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОстаткиПредварительно.Субконто1) КАК Субконто1,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОстаткиПредварительно.Субконто2) КАК Субконто2,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОстаткиПредварительно.Субконто3) КАК Субконто3,
	|	ВТОстаткиПредварительно.СуммаОстаток КАК СуммаОстаток,
	|	ВЫБОР
	|		КОГДА ВТОстаткиПредварительно.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА ВТОстаткиПредварительно.СуммаОстатокДт - ВТОстаткиПредварительно.СуммаОстатокКт
	|		КОГДА ВТОстаткиПредварительно.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОстаткиПредварительно.СуммаОстатокДт - ВТОстаткиПредварительно.СуммаОстатокКт > 0
	|					ТОГДА ВТОстаткиПредварительно.СуммаОстатокДт - ВТОстаткиПредварительно.СуммаОстатокКт
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаОстатокДт,
	|	ВЫБОР
	|		КОГДА ВТОстаткиПредварительно.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА 0
	|		КОГДА ВТОстаткиПредварительно.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА ВТОстаткиПредварительно.СуммаОстатокКт - ВТОстаткиПредварительно.СуммаОстатокДт
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОстаткиПредварительно.СуммаОстатокКт - ВТОстаткиПредварительно.СуммаОстатокДт > 0
	|					ТОГДА ВТОстаткиПредварительно.СуммаОстатокКт - ВТОстаткиПредварительно.СуммаОстатокДт
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаОстатокКт,
	|	ВЫБОР
	|		КОГДА ВТОстаткиПредварительно.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА ВТОстаткиПредварительно.КоличествоОстатокДт - ВТОстаткиПредварительно.КоличествоОстатокКт
	|		КОГДА ВТОстаткиПредварительно.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОстаткиПредварительно.КоличествоОстатокДт - ВТОстаткиПредварительно.КоличествоОстатокКт > 0
	|					ТОГДА ВТОстаткиПредварительно.КоличествоОстатокДт - ВТОстаткиПредварительно.КоличествоОстатокКт
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОстатокДт,
	|	ВЫБОР
	|		КОГДА ВТОстаткиПредварительно.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА 0
	|		КОГДА ВТОстаткиПредварительно.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА ВТОстаткиПредварительно.КоличествоОстатокКт - ВТОстаткиПредварительно.КоличествоОстатокДт
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОстаткиПредварительно.КоличествоОстатокКт - ВТОстаткиПредварительно.КоличествоОстатокДт > 0
	|					ТОГДА ВТОстаткиПредварительно.КоличествоОстатокКт - ВТОстаткиПредварительно.КоличествоОстатокДт
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОстатокКт,
	|	ВТОстаткиПредварительно.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ВТОстаткиПредварительно.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА ВТОстаткиПредварительно.ВалютнаяСуммаОстатокДт - ВТОстаткиПредварительно.ВалютнаяСуммаОстатокКт
	|		КОГДА ВТОстаткиПредварительно.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОстаткиПредварительно.ВалютнаяСуммаОстатокДт - ВТОстаткиПредварительно.ВалютнаяСуммаОстатокКт > 0
	|					ТОГДА ВТОстаткиПредварительно.ВалютнаяСуммаОстатокДт - ВТОстаткиПредварительно.ВалютнаяСуммаОстатокКт
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ВалютнаяСуммаОстатокДт,
	|	ВЫБОР
	|		КОГДА ВТОстаткиПредварительно.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Активный)
	|			ТОГДА 0
	|		КОГДА ВТОстаткиПредварительно.ВидСчета = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
	|			ТОГДА ВТОстаткиПредварительно.ВалютнаяСуммаОстатокКт - ВТОстаткиПредварительно.ВалютнаяСуммаОстатокДт
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТОстаткиПредварительно.ВалютнаяСуммаОстатокКт - ВТОстаткиПредварительно.ВалютнаяСуммаОстатокДт > 0
	|					ТОГДА ВТОстаткиПредварительно.ВалютнаяСуммаОстатокКт - ВТОстаткиПредварительно.ВалютнаяСуммаОстатокДт
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК ВалютнаяСуммаОстатокКт,
	|	ВТОстаткиПредварительно.СчетКод КАК СчетКод,
	|	ВТОстаткиПредварительно.Аналитика1 КАК Аналитика1,
	|	ВТОстаткиПредварительно.Аналитика2 КАК Аналитика2,
	|	ВТОстаткиПредварительно.Аналитика3 КАК Аналитика3,
	|	ВТОстаткиПредварительно.Аналитика4 КАК Аналитика4,
	|	ВТОстаткиПредварительно.Аналитика5 КАК Аналитика5,
	|	ВТОстаткиПредварительно.Аналитика6 КАК Аналитика6,
	|	ВТОстаткиПредварительно.ОбязательноВОстатках1 КАК ОбязательноВОстатках1,
	|	ВТОстаткиПредварительно.ОбязательноВОстатках2 КАК ОбязательноВОстатках2,
	|	ВТОстаткиПредварительно.ОбязательноВОстатках3 КАК ОбязательноВОстатках3,
	|	ВТОстаткиПредварительно.ОбязательноВОстатках4 КАК ОбязательноВОстатках4,
	|	ВТОстаткиПредварительно.ОбязательноВОстатках5 КАК ОбязательноВОстатках5,
	|	ВТОстаткиПредварительно.ОбязательноВОстатках6 КАК ОбязательноВОстатках6,
	|	ВТОстаткиПредварительно.СубСчетКод КАК СубСчет,
	|	ВТОстаткиПредварительно.ТипКБК КАК ТипКБК,
	|	ВТОстаткиПредварительно.ВидСчета КАК ВидСчета,
	|	ВТОстаткиПредварительно.Субконто1 КАК Субконто11,
	|	ВТОстаткиПредварительно.Субконто2 КАК Субконто21,
	|	ВТОстаткиПредварительно.Субконто3 КАК Субконто31,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТОстаткиПредварительно.Организация) КАК УИ_Организации," + 
	?(ИспользуетсяБГУСпец, СтрЗаменить(МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконто(""), "%Суффикс", ""), "
	|	ЕПСБУВидыСубконто.ВидСубконто") + " КАК ВидСубконто1,
	|	ЕПСБУВидыСубконто1.ВидСубконто КАК ВидСубконто2,
	|	ЕПСБУВидыСубконто2.ВидСубконто КАК ВидСубконто3,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОстаткиПредварительно.Аналитика1 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика2 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика3 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика4 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика5 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконто.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконто1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконто2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|	КОНЕЦ КАК ВидСубконто4,
	|	НЕ(НЕ ВТОстаткиПредварительно.Аналитика1 = ""KONTRAGENT""
	|				И НЕ ВТОстаткиПредварительно.Аналитика2 = ""KONTRAGENT""
	|				И НЕ ВТОстаткиПредварительно.Аналитика3 = ""KONTRAGENT""
	|				И НЕ ВТОстаткиПредварительно.Аналитика4 = ""KONTRAGENT""
	|				И НЕ ВТОстаткиПредварительно.Аналитика5 = ""KONTRAGENT""
	|				И НЕ ВТОстаткиПредварительно.Аналитика6 = ""KONTRAGENT"")
	|		И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконто.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			И НЕ ЕСТЬNULL(ЕПСБУВидыСубконто1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|			И НЕ ЕСТЬNULL(ЕПСБУВидыСубконто2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)) КАК ТребуетсяСубконто4,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОстаткиПредварительно.Аналитика1 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика2 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика3 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика4 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика5 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконто.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконто1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконто2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|				И (НЕ(НЕ ЕПСБУВидыСубконто.ВидСубконто ЕСТЬ NULL
	|							И ТИПЗНАЧЕНИЯ(ВТОстаткиПредварительно.Субконто1) = ТИП(Справочник.Контрагенты))
	|					И НЕ(НЕ ЕПСБУВидыСубконто1.ВидСубконто ЕСТЬ NULL
	|							И ТИПЗНАЧЕНИЯ(ВТОстаткиПредварительно.Субконто2) = ТИП(Справочник.Контрагенты))
	|					И НЕ(НЕ ЕПСБУВидыСубконто2.ВидСубконто ЕСТЬ NULL
	|							И ТИПЗНАЧЕНИЯ(ВТОстаткиПредварительно.Субконто3) = ТИП(Справочник.Контрагенты)))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконто.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОстаткиПредварительно.Субконто1
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконто1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОстаткиПредварительно.Субконто2
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконто2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений)
	|						ТОГДА ВТОстаткиПредварительно.Субконто3
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыФинансовыхВложений.ПустаяСсылка)
	|	КОНЕЦ КАК ОбъектыФВ,
	|	ВЫБОР
	|		КОГДА НЕ(НЕ ВТОстаткиПредварительно.Аналитика1 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика2 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика3 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика4 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика5 = ""KONTRAGENT""
	|						И НЕ ВТОстаткиПредварительно.Аналитика6 = ""KONTRAGENT"")
	|				И (НЕ ЕСТЬNULL(ЕПСБУВидыСубконто.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконто1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
	|					И НЕ ЕСТЬNULL(ЕПСБУВидыСубконто2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
	|				И (НЕ(НЕ ЕПСБУВидыСубконто.ВидСубконто ЕСТЬ NULL
	|							И ТИПЗНАЧЕНИЯ(ВТОстаткиПредварительно.Субконто1) = ТИП(Справочник.Контрагенты))
	|					И НЕ(НЕ ЕПСБУВидыСубконто1.ВидСубконто ЕСТЬ NULL
	|							И ТИПЗНАЧЕНИЯ(ВТОстаткиПредварительно.Субконто2) = ТИП(Справочник.Контрагенты))
	|					И НЕ(НЕ ЕПСБУВидыСубконто2.ВидСубконто ЕСТЬ NULL
	|							И ТИПЗНАЧЕНИЯ(ВТОстаткиПредварительно.Субконто3) = ТИП(Справочник.Контрагенты)))
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконто.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОстаткиПредварительно.Субконто1
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконто1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОстаткиПредварительно.Субконто2
	|					КОГДА ЕСТЬNULL(ЕПСБУВидыСубконто2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
	|						ТОГДА ВТОстаткиПредварительно.Субконто3" + 
	?(ИспользуетсяБГУСпец, "
	|					КОГДА " + СтрЗаменить(МодульСбораДанныхПереопределяемый.ПолучитьТекстЗапросаВидСубконтоСравнение(""), "%Суффикс", "") + "
	|						ТОГДА ВТОстаткиПредварительно.Субконто1", "") + "
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ КАК Договор,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерСтроки	
	|ПОМЕСТИТЬ %ИмяОстаткиБезСубконто4
	|ИЗ
	|	%ИмяОстаткиПредварительно КАК ВТОстаткиПредварительно
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО ВТОстаткиПредварительно.СубСчет = ЕПСБУВидыСубконто.Ссылка
	|			И (ЕПСБУВидыСубконто.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконто1
	|		ПО ВТОстаткиПредварительно.СубСчет = ЕПСБУВидыСубконто1.Ссылка
	|			И (ЕПСБУВидыСубконто1.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕПСБУВидыСубконто КАК ЕПСБУВидыСубконто2
	|		ПО ВТОстаткиПредварительно.СубСчет = ЕПСБУВидыСубконто2.Ссылка
	|			И (ЕПСБУВидыСубконто2.НомерСтроки = 3)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ %ИмяОстаткиПредварительно
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ОстаткиБезСубконто4.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВДельтаНомерСтроки
	|ИЗ
	|	%ИмяОстаткиБезСубконто4 КАК ОстаткиБезСубконто4
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстаткиБезСубконто4.Организация КАК Организация,
	|	ВТОстаткиБезСубконто4.ДатаОкончания КАК ДатаОкончания,
	|	ВТОстаткиБезСубконто4.Счет КАК Счет,
	|	ВТОстаткиБезСубконто4.КФО КАК КФО,
	|	ВТОстаткиБезСубконто4.КФОСсылка КАК КФОСсылка,
	|	ПОДСТРОКА(ВТОстаткиБезСубконто4.КПС, 1, 17) КАК КПС,
	|	ВТОстаткиБезСубконто4.КПССсылка КАК КПССсылка,
	|	ВТОстаткиБезСубконто4.КЭК КАК КЭК,
	|	ВТОстаткиБезСубконто4.Субконто1 КАК Субконто1,
	|	ВТОстаткиБезСубконто4.Субконто2 КАК Субконто2,
	|	ВТОстаткиБезСубконто4.Субконто3 КАК Субконто3,
	|	ВТОстаткиБезСубконто4.СуммаОстаток КАК СуммаОстаток,
	|	ВТОстаткиБезСубконто4.СуммаОстатокДт КАК СуммаОстатокДт,
	|	ВТОстаткиБезСубконто4.СуммаОстатокКт КАК СуммаОстатокКт,
	|	ВТОстаткиБезСубконто4.КоличествоОстатокДт КАК КоличествоОстатокДт,
	|	ВТОстаткиБезСубконто4.КоличествоОстатокКт КАК КоличествоОстатокКт,
	|	ВТОстаткиБезСубконто4.Валюта КАК Валюта,
	|	ВТОстаткиБезСубконто4.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
	|	ВТОстаткиБезСубконто4.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
	|	ВТОстаткиБезСубконто4.СчетКод КАК СчетКод,
	|	ВТОстаткиБезСубконто4.Аналитика1 КАК Аналитика1,
	|	ВТОстаткиБезСубконто4.Аналитика2 КАК Аналитика2,
	|	ВТОстаткиБезСубконто4.Аналитика3 КАК Аналитика3,
	|	ВТОстаткиБезСубконто4.Аналитика4 КАК Аналитика4,
	|	ВТОстаткиБезСубконто4.Аналитика5 КАК Аналитика5,
	|	ВТОстаткиБезСубконто4.Аналитика6 КАК Аналитика6,
	|	ВТОстаткиБезСубконто4.ОбязательноВОстатках1 КАК ОбязательноВОстатках1,
	|	ВТОстаткиБезСубконто4.ОбязательноВОстатках2 КАК ОбязательноВОстатках2,
	|	ВТОстаткиБезСубконто4.ОбязательноВОстатках3 КАК ОбязательноВОстатках3,
	|	ВТОстаткиБезСубконто4.ОбязательноВОстатках4 КАК ОбязательноВОстатках4,
	|	ВТОстаткиБезСубконто4.ОбязательноВОстатках5 КАК ОбязательноВОстатках5,
	|	ВТОстаткиБезСубконто4.ОбязательноВОстатках6 КАК ОбязательноВОстатках6,
	|	ВТОстаткиБезСубконто4.СубСчет КАК СубСчет,
	|	ВТОстаткиБезСубконто4.ТипКБК КАК ТипКБК,
	|	ВТОстаткиБезСубконто4.ВидСчета КАК ВидСчета,
	|	ВТОстаткиБезСубконто4.Субконто11 КАК Субконто11,
	|	ВТОстаткиБезСубконто4.Субконто21 КАК Субконто21,
	|	ВТОстаткиБезСубконто4.Субконто31 КАК Субконто31,
	|	ВТОстаткиБезСубконто4.УИ_Организации КАК УИ_Организации,
	|	ВТОстаткиБезСубконто4.ВидСубконто1 КАК ВидСубконто1,
	|	ВТОстаткиБезСубконто4.ВидСубконто2 КАК ВидСубконто2,
	|	ВТОстаткиБезСубконто4.ВидСубконто3 КАК ВидСубконто3,
	|	ВТОстаткиБезСубконто4.ВидСубконто4 КАК ВидСубконто4,
	|	ВТОстаткиБезСубконто4.ТребуетсяСубконто4 КАК ТребуетсяСубконто4,
	|	ВТОстаткиБезСубконто4.ОбъектыФВ КАК ОбъектыФВ,
	|	ВТОстаткиБезСубконто4.Договор КАК Договор,
	| 	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОстаткиБезСубконто4.Субконто11) = ТИП(Справочник.Договоры)
	| 	ТОГДА ВТОстаткиБезСубконто4.Субконто11
	| 	КОГДА ТИПЗНАЧЕНИЯ(ВТОстаткиБезСубконто4.Субконто21) = ТИП(Справочник.Договоры)
	| 	ТОГДА ВТОстаткиБезСубконто4.Субконто21
	| 	КОГДА ТИПЗНАЧЕНИЯ(ВТОстаткиБезСубконто4.Субконто31) = ТИП(Справочник.Договоры)
	| 	ТОГДА ВТОстаткиБезСубконто4.Субконто31
	| 	КОНЕЦ КАК ДоговорСоединение,
	| 	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ВТОстаткиБезСубконто4.Субконто11) = ТИП(Справочник.Контрагенты)
	| 	ТОГДА ВТОстаткиБезСубконто4.Субконто11
	| 	КОГДА ТИПЗНАЧЕНИЯ(ВТОстаткиБезСубконто4.Субконто21) = ТИП(Справочник.Контрагенты)
	| 	ТОГДА ВТОстаткиБезСубконто4.Субконто21
	| 	КОГДА ТИПЗНАЧЕНИЯ(ВТОстаткиБезСубконто4.Субконто31) = ТИП(Справочник.Контрагенты)
	| 	ТОГДА ВТОстаткиБезСубконто4.Субконто31
	| 	КОНЕЦ КАК КонтрагентСоединение,
	|	ВТОстаткиБезСубконто4.НомерСтроки - ВДельтаНомерСтроки.НомерСтроки + 1 КАК НомерСтроки
	|ПОМЕСТИТЬ %ИмяОстаткиБезСубконто4_НомерСтроки
	|ИЗ
	|	%ИмяОстаткиБезСубконто4 КАК ВТОстаткиБезСубконто4
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВДельтаНомерСтроки КАК ВДельтаНомерСтроки
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	| УНИЧТОЖИТЬ ВДельтаНомерСтроки		
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстаткиБезСубконто4.Организация КАК Организация,
	|	ВТОстаткиБезСубконто4.ДатаОкончания КАК ДатаОкончания,
	|	ВТОстаткиБезСубконто4.Счет КАК Счет,
	|	ВТОстаткиБезСубконто4.КФО КАК КФО,
	|	ВТОстаткиБезСубконто4.КФОСсылка КАК КФОСсылка,
	|	ПОДСТРОКА(ВТОстаткиБезСубконто4.КПС, 1, 17) КАК КПС,
	|	ВТОстаткиБезСубконто4.КПССсылка КАК КПССсылка,
	|	ВТОстаткиБезСубконто4.КЭК КАК КЭК,
	|	ВТОстаткиБезСубконто4.Субконто1 КАК Субконто1,
	|	ВТОстаткиБезСубконто4.Субконто2 КАК Субконто2,
	|	ВТОстаткиБезСубконто4.Субконто3 КАК Субконто3,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ЕСТЬNULL(ЕСТЬNULL(Договоры.Контрагент, ОбъектыФинансовыхВложений.Контрагент), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))) КАК Субконто4,
	|	%ПоляРазвернутыеАналитикиОстатки
	|	ВТОстаткиБезСубконто4.СуммаОстаток КАК СуммаОстаток,
	|	ВТОстаткиБезСубконто4.СуммаОстатокДт КАК СуммаОстатокДт,
	|	ВТОстаткиБезСубконто4.СуммаОстатокКт КАК СуммаОстатокКт,
	|	ВТОстаткиБезСубконто4.КоличествоОстатокДт КАК КоличествоОстатокДт,
	|	ВТОстаткиБезСубконто4.КоличествоОстатокКт КАК КоличествоОстатокКт,
	|	ВТОстаткиБезСубконто4.Валюта КАК Валюта,
	|	ВТОстаткиБезСубконто4.ВалютнаяСуммаОстатокДт КАК ВалютнаяСуммаОстатокДт,
	|	ВТОстаткиБезСубконто4.ВалютнаяСуммаОстатокКт КАК ВалютнаяСуммаОстатокКт,
	|	ВТОстаткиБезСубконто4.СчетКод КАК СчетКод,
	|	ВТОстаткиБезСубконто4.Аналитика1 КАК Аналитика1,
	|	ВТОстаткиБезСубконто4.Аналитика2 КАК Аналитика2,
	|	ВТОстаткиБезСубконто4.Аналитика3 КАК Аналитика3,
	|	ВТОстаткиБезСубконто4.Аналитика4 КАК Аналитика4,
	|	ВТОстаткиБезСубконто4.Аналитика5 КАК Аналитика5,
	|	ВТОстаткиБезСубконто4.Аналитика6 КАК Аналитика6,
	|	ВТОстаткиБезСубконто4.ОбязательноВОстатках1 КАК ОбязательноВОстатках1,
	|	ВТОстаткиБезСубконто4.ОбязательноВОстатках2 КАК ОбязательноВОстатках2,
	|	ВТОстаткиБезСубконто4.ОбязательноВОстатках3 КАК ОбязательноВОстатках3,
	|	ВТОстаткиБезСубконто4.ОбязательноВОстатках4 КАК ОбязательноВОстатках4,
	|	ВТОстаткиБезСубконто4.ОбязательноВОстатках5 КАК ОбязательноВОстатках5,
	|	ВТОстаткиБезСубконто4.ОбязательноВОстатках6 КАК ОбязательноВОстатках6,
	|	ВТОстаткиБезСубконто4.СубСчет КАК СубСчет,
	|	ВТОстаткиБезСубконто4.ТипКБК КАК ТипКБК,
	|	ВТОстаткиБезСубконто4.ВидСчета КАК ВидСчета,
	|	ВТОстаткиБезСубконто4.Субконто11 КАК Субконто11,
	|	ВТОстаткиБезСубконто4.Субконто21 КАК Субконто21,
	|	ВТОстаткиБезСубконто4.Субконто31 КАК Субконто31,
	|	ЕСТЬNULL(ЕСТЬNULL(Договоры.Контрагент, ОбъектыФинансовыхВложений.Контрагент), ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Субконто41,
	| 	ВТОстаткиБезСубконто4.ДоговорСоединение КАК Договор,
	| 	ДоговорыСоединение.Контрагент = ЕСТЬNULL(ЕСТЬNULL(Договоры.Контрагент, ОбъектыФинансовыхВложений.Контрагент), ВТОстаткиБезСубконто4.КонтрагентСоединение) КАК ПолучитьGRAF_ISP,
	|	ВТОстаткиБезСубконто4.УИ_Организации КАК УИ_Организации,
	|	ВТОстаткиБезСубконто4.ВидСубконто1 КАК ВидСубконто1,
	|	ВТОстаткиБезСубконто4.ВидСубконто2 КАК ВидСубконто2,
	|	ВТОстаткиБезСубконто4.ВидСубконто3 КАК ВидСубконто3,
	|	ВТОстаткиБезСубконто4.ВидСубконто4 КАК ВидСубконто4,
	|	ВТОстаткиБезСубконто4.НомерСтроки
	|ПОМЕСТИТЬ %ИмяОстатки
	|ИЗ
	|	%ИмяОстаткиБезСубконто4_НомерСтроки КАК ВТОстаткиБезСубконто4
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
	|		ПО (ВТОстаткиБезСубконто4.ТребуетсяСубконто4)
	|			И ВТОстаткиБезСубконто4.Договор = Договоры.Ссылка
	| 		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК ДоговорыСоединение
	| 		ПО ВТОстаткиБезСубконто4.ДоговорСоединение = ДоговорыСоединение.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыФинансовыхВложений КАК ОбъектыФинансовыхВложений
	|		ПО (ВТОстаткиБезСубконто4.ТребуетсяСубконто4)
	|			И ВТОстаткиБезСубконто4.ОбъектыФВ = ОбъектыФинансовыхВложений.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Аналитика1,
	|	Аналитика2,
	|	Аналитика3,
	|	Аналитика4,
	|	Аналитика5,
	|	Аналитика6,
	|	ВидСубконто1,
	|	Субконто1,
	|	ВидСубконто2,
	|	Субконто2,
	|	ВидСубконто3,
	|	Субконто3,
	|	ВидСубконто4,
	|	Субконто4,
	|	УИ_Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	| УНИЧТОЖИТЬ %ИмяОстаткиБезСубконто4_НомерСтроки		
	|;
	|////////////////////////////////////////////////////////////////////////////////"; 
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса ,"%ИмяОстаткиПредварительно" , ИмяОстаткиПредварительно); 
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса ,"%ИмяОстаткиБезСубконто4" , ИмяОстаткиБезСубконто4);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса ,"%ИмяОстатки" , ИмяОстатки);
	
	Возврат ТекстЗапроса;

КонецФункции	

Функция ПолучитьТекстЗапросаПерезагружаемыеПериоды(ПараметрыВыполнения)
	
	ТекстЗапроса = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ПакетыДанныхДляМСД.НачалоПериода, ДЕНЬ) КАК НачалоПериода,
	|	КОНЕЦПЕРИОДА(ПакетыДанныхДляМСД.ОкончаниеПериода, ДЕНЬ) КАК ОкончаниеПериода,
	|	ПакетыДанныхДляМСД.ВидПередаваемыхДанных КАК ВидПередаваемыхДанных,
	|	МАКСИМУМ(ПакетыДанныхМСД.ДатаФормирования) КАК ДатаФормирования
	|ПОМЕСТИТЬ ВТ_ОтправленныеПакеты
	|ИЗ
	|	РегистрСведений.ПакетыДанныхМСД КАК ПакетыДанныхМСД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПакетыДанныхДляМСД КАК ПакетыДанныхДляМСД
	|		ПО ПакетыДанныхМСД.Пакет = ПакетыДанныхДляМСД.Ссылка
	|ГДЕ
	|	НЕ ПакетыДанныхМСД.Статус В (&СтатусСформирован)
	|	И ПакетыДанныхДляМСД.ОкончаниеПериода > &ОкончаниеПериода
	|	И НЕ ПакетыДанныхДляМСД.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ПакетыДанныхДляМСД.НачалоПериода, ДЕНЬ),
	|	КОНЕЦПЕРИОДА(ПакетыДанныхДляМСД.ОкончаниеПериода, ДЕНЬ),
	|	ПакетыДанныхДляМСД.ВидПередаваемыхДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ОтправленныеПакеты.ОкончаниеПериода КАК ОкончаниеПериода,
	|	ПакетыДанныхМСД.Пакет КАК Пакет,
	|	МАКСИМУМ(ПакетыДанныхМСД.Период) КАК Период,
	|	ВТ_ОтправленныеПакеты.ВидПередаваемыхДанных КАК ВидПередаваемыхДанных
	|ПОМЕСТИТЬ ВТ_СтатусПакетаСрез
	|ИЗ
	|	ВТ_ОтправленныеПакеты КАК ВТ_ОтправленныеПакеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПакетыДанныхМСД КАК ПакетыДанныхМСД
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПакетыДанныхДляМСД КАК ПакетыДанныхДляМСД
	|			ПО ПакетыДанныхМСД.Пакет = ПакетыДанныхДляМСД.Ссылка
	|		ПО (ВТ_ОтправленныеПакеты.НачалоПериода = НАЧАЛОПЕРИОДА(ПакетыДанныхДляМСД.НачалоПериода, ДЕНЬ))
	|			И (ВТ_ОтправленныеПакеты.ОкончаниеПериода = КОНЕЦПЕРИОДА(ПакетыДанныхДляМСД.ОкончаниеПериода, ДЕНЬ))
	|			И (ВТ_ОтправленныеПакеты.ВидПередаваемыхДанных = ПакетыДанныхДляМСД.ВидПередаваемыхДанных)
	|			И ВТ_ОтправленныеПакеты.ДатаФормирования = ПакетыДанныхМСД.ДатаФормирования
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОтправленныеПакеты.ОкончаниеПериода,
	|	ПакетыДанныхМСД.Пакет,
	|	ВТ_ОтправленныеПакеты.ВидПередаваемыхДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ_СтатусПакетаСрез.ОкончаниеПериода КАК ОкончаниеПериода,
	|	МЕСЯЦ(ВТ_СтатусПакетаСрез.ОкончаниеПериода) КАК Месяц,
	|	ВТ_СтатусПакетаСрез.ВидПередаваемыхДанных КАК ВидПередаваемыхДанных
	|ПОМЕСТИТЬ ВТ_ОкончаниеПериода
	|ИЗ
	|	РегистрСведений.ПакетыДанныхМСД КАК ПакетыДанныхМСД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтатусПакетаСрез КАК ВТ_СтатусПакетаСрез
	|		ПО (ВТ_СтатусПакетаСрез.Пакет = ПакетыДанныхМСД.Пакет)
	|			И (ВТ_СтатусПакетаСрез.Период = ПакетыДанныхМСД.Период)
	|ГДЕ
	|	ПакетыДанныхМСД.Статус В(&СтатусПринят)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОкончаниеПериода.Месяц КАК Месяц,
	|	МАКСИМУМ(ВТ_ОкончаниеПериода.ОкончаниеПериода) КАК ОкончаниеПериода,
	|	МАКСИМУМ(ВТ_ОкончаниеПериода.ВидПередаваемыхДанных) КАК ВидПередаваемыхДанных
	|ПОМЕСТИТЬ ВТ_ОкончаниеПериодаГруппировка
	|ИЗ
	|	ВТ_ОкончаниеПериода КАК ВТ_ОкончаниеПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОкончаниеПериода.Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОкончаниеПериодаГруппировка.Месяц КАК Месяц,
	|	ВТ_ОкончаниеПериода.ОкончаниеПериода КАК ОкончаниеПериода,
	|	ВТ_ОкончаниеПериода.ВидПередаваемыхДанных КАК ВидПередаваемыхДанных
	|ИЗ
	|	ВТ_ОкончаниеПериодаГруппировка КАК ВТ_ОкончаниеПериодаГруппировка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОкончаниеПериода КАК ВТ_ОкончаниеПериода
	|		ПО ВТ_ОкончаниеПериодаГруппировка.ВидПередаваемыхДанных = ВТ_ОкончаниеПериода.ВидПередаваемыхДанных
	|			И (ВЫБОР
	|				КОГДА ВТ_ОкончаниеПериодаГруппировка.ВидПередаваемыхДанных
	|					ТОГДА ВТ_ОкончаниеПериодаГруппировка.ОкончаниеПериода = ВТ_ОкончаниеПериода.ОкончаниеПериода
	|				ИНАЧЕ ВТ_ОкончаниеПериодаГруппировка.Месяц = ВТ_ОкончаниеПериода.Месяц
	|			КОНЕЦ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Месяц,
	|	ОкончаниеПериода";
	
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ПараметрыВыполнения.ОкончаниеПериода));
	
	МассивСтатусПринят = Новый Массив;
	МассивСтатусПринят.Добавить(Перечисления.СтатусыПакетовМСД.Принят);
	МассивСтатусПринят.Добавить(Перечисления.СтатусыПакетовМСД.ПринятСПредупреждениями);
	МассивСтатусПринят.Добавить(Перечисления.СтатусыПакетовМСД.ПринятДанныеОтсутствуют);
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	Запрос.УстановитьПараметр("СтатусПринят", МассивСтатусПринят);
	Запрос.УстановитьПараметр("СтатусСформирован", МодульОбщегоНазначенияКлиентСервер.МассивЗначений(Перечисления.СтатусыПакетовМСД.Сформирован, Перечисления.СтатусыПакетовМСД.Формирование));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТекстЗапроса;	
	КонецЕсли;	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	ДополнительныеПараметрыОстатки = Новый Структура;
	ДополнительныеПараметрыОстатки.Вставить("ПерезагружаемыеПериоды", Истина);
	ДополнительныеПараметрыОстатки.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ФорматДатыСтрока = Формат(ВыборкаДетальныеЗаписи.ОкончаниеПериода, "ДФ=ггггММдд");
		ИмяВТ = "ВТ_" + ФорматДатыСтрока;
		ИмяПараметрДата = "ПараметрДата_" + ФорматДатыСтрока;
		
		ПостфиксПараметра = "";
		Если КонецДня(ВыборкаДетальныеЗаписи.ОкончаниеПериода) = КонецГода(ВыборкаДетальныеЗаписи.ОкончаниеПериода) Тогда
			ПостфиксПараметра = "Граница";
			ПерезагружаемыйПериод = ПолучитьСтруктуруПерезагружаемыйПериод();
			ПерезагружаемыйПериод.ИмяВТ = ИмяВТ;
			ПерезагружаемыйПериод.ИмяПараметрДата = ИмяПараметрДата + ПостфиксПараметра;
			ПерезагружаемыйПериод.ОкончаниеПериода = Новый Граница(Новый МоментВремениСУточнениемПериода(КонецДня(ВыборкаДетальныеЗаписи.ОкончаниеПериода), 1), ВидГраницы.Включая);
			ПерезагружаемыйПериод.ЭтоГраница = Истина;
			ПараметрыВыполнения.ПерезагружаемыеПериоды.Добавить(ПерезагружаемыйПериод); 
		КонецЕсли;	
		
		ТекстЗапроса = ТекстЗапроса + "
		|" + ПолучитьТекстЗапросаОстатки(ИмяВТ, "&" + ИмяПараметрДата + ?(ПостфиксПараметра = "", "ГраницаВключая", ПостфиксПараметра), "&" + ИмяПараметрДата + "ГраницаВключая", ДополнительныеПараметрыОстатки);		
				
		ПерезагружаемыйПериод = ПолучитьСтруктуруПерезагружаемыйПериод();
		ПерезагружаемыйПериод.ИмяВТ = ИмяВТ;
		ПерезагружаемыйПериод.ИмяПараметрДата = ИмяПараметрДата;
		ПерезагружаемыйПериод.ОкончаниеПериода = ВыборкаДетальныеЗаписи.ОкончаниеПериода;
		ПерезагружаемыйПериод.ЭтоГраница = Ложь;
		ПараметрыВыполнения.ПерезагружаемыеПериоды.Добавить(ПерезагружаемыйПериод); 
		
		ПерезагружаемыйПериод = ПолучитьСтруктуруПерезагружаемыйПериод();
		ПерезагружаемыйПериод.ИмяВТ = ИмяВТ;
		ПерезагружаемыйПериод.ИмяПараметрДата = ИмяПараметрДата + "ГраницаВключая";
		ПерезагружаемыйПериод.ОкончаниеПериода = Новый Граница(ВыборкаДетальныеЗаписи.ОкончаниеПериода, ВидГраницы.Включая);
		ПерезагружаемыйПериод.ЭтоГраница = Истина;
		ПараметрыВыполнения.ПерезагружаемыеПериоды.Добавить(ПерезагружаемыйПериод);
	КонецЦикла; 
	
	ПерваяТаблица = Истина;
	Для каждого СтрокаПериод Из ПараметрыВыполнения.ПерезагружаемыеПериоды Цикл 
		Если СтрокаПериод.ЭтоГраница Тогда
			Продолжить;	
		КонецЕсли;
		Если ПерваяТаблица Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|" + ПолучитьТекстЗапросаОстаткиПредварительно(СтрокаПериод.ИмяВТ, "&" + СтрокаПериод.ИмяПараметрДата, ПараметрыВыполнения, Истина, "ВТОстаткиПерезагружаемыеПредварительно");
			ПерваяТаблица = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|" + ПолучитьТекстЗапросаОстаткиПредварительно(СтрокаПериод.ИмяВТ, "&" + СтрокаПериод.ИмяПараметрДата, ПараметрыВыполнения);
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетКод,
	|	СубСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	
	Для каждого СтрокаПериод Из ПараметрыВыполнения.ПерезагружаемыеПериоды Цикл
		Если СтрокаПериод.ЭтоГраница Тогда
			Продолжить;	
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|" + УничтожитьТаблицыПредварительно(СтрокаПериод.ИмяВТ); 
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|" + ПолучитьТекстЗапросаОстаткиОкончательно("ВТОстаткиПерезагружаемыеПредварительно", "ВТОстаткиПерезагружаемыеБезСубконто4", "ВТОстаткиПерезагружаемые");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаОстаткиБезКЭК(ДополнительныеПараметры)
	
	СубконтоНаСчетах = ДополнительныеПараметры.ПараметрыВыполнения.СубконтоНаСчетах;
	ТекстЗапроса = "";
	Для каждого СтрокаСубконто Из СубконтоНаСчетах Цикл		
		ТекстПолеВыбора = "";
		
		ИтерацияСубконто = 1;
		Для каждого Субкотно Из СтрокаСубконто.ТипЗначенияСубконто Цикл  
			ТекстПолеВыбора = ТекстПолеВыбора + "
			|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто" + ИтерацияСубконто + ", ЗНАЧЕНИЕ(" + Субкотно + ".ПустаяСсылка)),";
			ИтерацияСубконто = ИтерацияСубконто + 1;
		КонецЦикла;	
		
		Если ИтерацияСубконто <= 3 Тогда
			Для ИтерацияСубконто = ИтерацияСубконто По 3 Цикл
				ТекстПолеВыбора = ТекстПолеВыбора + "
				|	ЗНАЧЕНИЕ(Документ.ПакетыДанныхДляМСД.ПустаяСсылка),";
			КонецЦикла;	
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.КФО, ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)),
		|	ЖурналПроводокЕПСБУОстатки.Счет," + 
		ТекстПолеВыбора + "
		|	ЖурналПроводокЕПСБУОстатки.Организация,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.КПС, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)),
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)),
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(%ПараметрДатаОстаткиГраница, Счет В (&Счета_" + СтрокаСубконто.Идентификатор + "), &МассивСубконто_" + СтрокаСубконто.Идентификатор + ", ) КАК ЖурналПроводокЕПСБУОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
		|		ПО ЖурналПроводокЕПСБУОстатки.Организация = ВТОрганизацииФедеральногоБюджета.Организация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ВТПланСчетов
		|		ПО ЖурналПроводокЕПСБУОстатки.Счет = ВТПланСчетов.Ссылка" +
		?(ДополнительныеПараметры.ПерезагружаемыеПериоды, "
		|ГДЕ
		|	ВТПланСчетов.Код В (&СчетаПерезагружаемыеПериоды)", "");
	КонецЦикла;	
	Возврат ТекстЗапроса; 
	
КонецФункции

Функция ПолучитьТекстЗапросаОстаткиСКЭК(ДополнительныеПараметры)
	
	СубконтоНаСчетах = ДополнительныеПараметры.ПараметрыВыполнения.СубконтоНаСчетах;
	ТекстЗапроса = "";
	Для каждого СтрокаСубконто Из СубконтоНаСчетах Цикл		
		ТекстПолеВыбора = "";
		
		ИтерацияСубконто = 1;
		Для каждого Субкотно Из СтрокаСубконто.ТипЗначенияСубконто Цикл  
			ТекстПолеВыбора = ТекстПолеВыбора + "
			|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто" + ИтерацияСубконто + ", ЗНАЧЕНИЕ(" + Субкотно + ".ПустаяСсылка)),";
			ИтерацияСубконто = ИтерацияСубконто + 1;
		КонецЦикла;	
		
		Если ИтерацияСубконто <= 3 Тогда
			Для ИтерацияСубконто = ИтерацияСубконто По 3 Цикл
				ТекстПолеВыбора = ТекстПолеВыбора + "
				|	ЗНАЧЕНИЕ(Документ.ПакетыДанныхДляМСД.ПустаяСсылка),";
			КонецЦикла;	
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.КФО, ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)),
		|	ЖурналПроводокЕПСБУОстатки.Счет," + 
		ТекстПолеВыбора + "
		|	ЖурналПроводокЕПСБУОстатки.Организация,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.КПС, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)),
		|	ЖурналПроводокЕПСБУОстатки.КЭК,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)),
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)),
		|	ЖурналПроводокЕПСБУОстатки.СуммаОстаток,
		|	ЖурналПроводокЕПСБУОстатки.СуммаРазвернутыйОстатокДт,
		|	ЖурналПроводокЕПСБУОстатки.СуммаРазвернутыйОстатокКт,
		|	ЖурналПроводокЕПСБУОстатки.ВалютнаяСуммаРазвернутыйОстатокДт,
		|	ЖурналПроводокЕПСБУОстатки.ВалютнаяСуммаРазвернутыйОстатокКт,
		|	ЖурналПроводокЕПСБУОстатки.КоличествоРазвернутыйОстатокДт,
		|	ЖурналПроводокЕПСБУОстатки.КоличествоРазвернутыйОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(%ПараметрДатаОстаткиГраница, Счет В (&Счета_" + СтрокаСубконто.Идентификатор + "), &МассивСубконто_" + СтрокаСубконто.Идентификатор + ", ) КАК ЖурналПроводокЕПСБУОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
		|		ПО ЖурналПроводокЕПСБУОстатки.Организация = ВТОрганизацииФедеральногоБюджета.Организация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ВТПланСчетов
		|		ПО ЖурналПроводокЕПСБУОстатки.Счет = ВТПланСчетов.Ссылка" +
		?(ДополнительныеПараметры.ПерезагружаемыеПериоды, "
		|ГДЕ
		|	ВТПланСчетов.Код В (&СчетаПерезагружаемыеПериоды)", "");		
	КонецЦикла;	
	Возврат ТекстЗапроса; 
	
КонецФункции

#КонецОбласти

#Область Переносы_ТекстЗапроса

Функция Переносы_ПолучитьТекстЗапросаСтоимостьОбъектовОС(ПараметрыВыполнения, МенеджерВТ)

	ТекстЗапроса = "";
	ПерваяИтерация = Истина; 	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
	?(ПараметрыВыполнения.ИспользуютсяИнтеграцииЭБ, 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыМежотчетногоПериода.Документ КАК Документ,
	|	ДокументыМежотчетногоПериода.ДатаПервичногоОтраженияВУчетеОперацииМО КАК ДатаПервичногоОтраженияВУчетеОперацииМО
	|ПОМЕСТИТЬ ВТ_МОРегистраторы
	|ИЗ
	|	РегистрСведений.ПОД_ФК_ДокументыМежотчетногоПериода КАК ДокументыМежотчетногоПериода
	|ГДЕ
	|	ДокументыМежотчетногоПериода.ДатаПервичногоОтраженияВУчетеОперацииМО МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыМежотчетногоПериода.Документ КАК Документ,
	|	ДокументыМежотчетногоПериода.ДатаПроведения КАК ДатаПервичногоОтраженияВУчетеОперацииМО
	|ИЗ
	|	РегистрСведений.ДатыПроведенияДокументов КАК ДокументыМежотчетногоПериода
	|ГДЕ
	|	ДокументыМежотчетногоПериода.ДатаПроведения МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеСчетовСанкционирования.Ссылка,
	|	ЗакрытиеСчетовСанкционирования.Дата
	|ИЗ
	|	Документ.ЗакрытиеСчетовСанкционирования КАК ЗакрытиеСчетовСанкционирования
	|ГДЕ
	|	ЗакрытиеСчетовСанкционирования.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ЗакрытиеСчетовСанкционирования.ВидМежотчетногоПериода = ЗНАЧЕНИЕ(Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПереносПоказателейПоСанкционированию.Ссылка,
	|	ПереносПоказателейПоСанкционированию.Дата
	|ИЗ
	|	Документ.ПереносПоказателейПоСанкционированию КАК ПереносПоказателейПоСанкционированию
	|ГДЕ
	|	ПереносПоказателейПоСанкционированию.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания",
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыМежотчетногоПериода.Документ КАК Документ,
	|	ДокументыМежотчетногоПериода.ДатаПроведения КАК ДатаПервичногоОтраженияВУчетеОперацииМО
	|ПОМЕСТИТЬ ВТ_МОРегистраторы
	|ИЗ
	|	РегистрСведений.ДатыПроведенияДокументов КАК ДокументыМежотчетногоПериода
	|ГДЕ
	|	ДокументыМежотчетногоПериода.ДатаПроведения МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОперацияБух.Ссылка,
	|	ОперацияБух.Дата
	|ИЗ
	|	Документ.ОперацияБух КАК ОперацияБух
	|ГДЕ
	|	ОперацияБух.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ОперацияБух.ВидМежотчетногоПериода = ЗНАЧЕНИЕ(Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПереносОстатковПоКПС.Ссылка,
	|	ПереносОстатковПоКПС.Дата
	|ИЗ
	|	Документ.ПереносОстатковПоКПС КАК ПереносОстатковПоКПС
	|ГДЕ
	|	ПереносОстатковПоКПС.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ПереносОстатковПоКПС.ВидМежотчетногоПериода = ЗНАЧЕНИЕ(Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРегистров.Ссылка,
	|	КорректировкаРегистров.Дата
	|ИЗ
	|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
	|ГДЕ
	|	КорректировкаРегистров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ КорректировкаРегистров.ВидМежотчетногоПериода = ЗНАЧЕНИЕ(Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗакрытиеСчетовСанкционирования.Ссылка,
	|	ЗакрытиеСчетовСанкционирования.Дата
	|ИЗ
	|	Документ.ЗакрытиеСчетовСанкционирования КАК ЗакрытиеСчетовСанкционирования
	|ГДЕ
	|	ЗакрытиеСчетовСанкционирования.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ЗакрытиеСчетовСанкционирования.ВидМежотчетногоПериода = ЗНАЧЕНИЕ(Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПереносПоказателейПоСанкционированию.Ссылка,
	|	ПереносПоказателейПоСанкционированию.Дата
	|ИЗ
	|	Документ.ПереносПоказателейПоСанкционированию КАК ПереносПоказателейПоСанкционированию
	|ГДЕ
	|	ПереносПоказателейПоСанкционированию.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания") + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЖурналПроводокЕПСБУОбороты.СчетДт КАК Счет
	|ПОМЕСТИТЬ ВТОборотыСчет
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(&ДатаНачала, &ДатаОкончания, Запись, , , , , ) КАК ЖурналПроводокЕПСБУОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЖурналПроводокЕПСБУОбороты.СчетКт
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(&ДатаНачала, &ДатаОкончания, Запись, , , , , ) КАК ЖурналПроводокЕПСБУОбороты
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(, , Активность И Регистратор В (ВЫБРАТЬ ВТ_МОРегистраторы.Документ ИЗ ВТ_МОРегистраторы), , ) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(, , Активность И Регистратор В (ВЫБРАТЬ ВТ_МОРегистраторы.Документ ИЗ ВТ_МОРегистраторы), , ) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
	|		И НЕ ЕПСБУВидыСубконто1.НомерСтроки ЕСТЬ NULL КАК ЕстьДоговоры,
	|	НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
	|		И НЕ ЕПСБУВидыСубконто2.НомерСтроки ЕСТЬ NULL КАК ЕстьЦМО,
	|	НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
	|		И НЕ ЕПСБУВидыСубконто3.НомерСтроки ЕСТЬ NULL КАК ЕстьКонтрагенты
	|ИЗ
	|	ВТОборотыСчет КАК ВТОборотыСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО ВТОборотыСчет.Счет = ЕПСБУВидыСубконто.Ссылка
	|			И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ВидыСубконто.ОсновныеСредства))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто1
	|		ПО ВТОборотыСчет.Счет = ЕПСБУВидыСубконто1.Ссылка
	|			И (ЕПСБУВидыСубконто1.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ВидыСубконто.Договоры))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто2
	|		ПО ВТОборотыСчет.Счет = ЕПСБУВидыСубконто2.Ссылка
	|			И (ЕПСБУВидыСубконто2.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ВидыСубконто.ЦМО))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто3
	|		ПО ВТОборотыСчет.Счет = ЕПСБУВидыСубконто3.Ссылка
	|			И (ЕПСБУВидыСубконто3.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовхарактеристик.ВидыСубконто.Контрагенты))
	|ГДЕ
	|	(НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
	|				И НЕ ЕПСБУВидыСубконто1.НомерСтроки ЕСТЬ NULL
	|			ИЛИ НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
	|				И НЕ ЕПСБУВидыСубконто2.НомерСтроки ЕСТЬ NULL
	|			ИЛИ НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
	|				И НЕ ЕПСБУВидыСубконто3.НомерСтроки ЕСТЬ NULL)
	|	И НЕ(НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
	|				И НЕ ЕПСБУВидыСубконто1.НомерСтроки ЕСТЬ NULL
	|				И НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
	|				И НЕ ЕПСБУВидыСубконто2.НомерСтроки ЕСТЬ NULL
	|				И НЕ ЕПСБУВидыСубконто.НомерСтроки ЕСТЬ NULL
	|				И НЕ ЕПСБУВидыСубконто3.НомерСтроки ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОборотыСчет";
	
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыВыполнения.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПараметрыВыполнения.ОкончаниеПериода));
	
	ВыборкаРазрез = Запрос.Выполнить().Выбрать();
	
	МассивСрезСубконто = Новый Массив;
	
	Пока ВыборкаРазрез.Следующий() Цикл 
		СтрокаМассив = Новый Структура("ЕстьЦМО, ЕстьДоговоры, ЕстьКонтрагенты");
		ЗаполнитьЗначенияСвойств(СтрокаМассив, ВыборкаРазрез);
		МассивСрезСубконто.Добавить(СтрокаМассив);
		ШаблонВТ = Переносы_ПолучитьШаблонВТСтоимостьОбъектовОС(СтрокаМассив.ЕстьЦМО, СтрокаМассив.ЕстьДоговоры, СтрокаМассив.ЕстьКонтрагенты);
		ИмяВТ = "Есть" + ?(СтрокаМассив.ЕстьЦМО, "ЦМО", "") + ?(СтрокаМассив.ЕстьДоговоры, "Дог", "") + ?(СтрокаМассив.ЕстьКонтрагенты, "Кон", "");
		ШаблонВТ = СтрЗаменить(ШаблонВТ, "%ИмяВТСтоимостьОС", ИмяВТ);
		Если ПерваяИтерация Тогда
			ТекстЗапроса = ШаблонВТ + "
			|;
			|";
			ПерваяИтерация = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|////////////////////////////////////////////////////////////////////////////////
			|" + ШаблонВТ + "
			|;
			|";		
		КонецЕсли;	
	КонецЦикла;
	ПараметрыВыполнения.Вставить("МассивСрезСубконто", МассивСрезСубконто);
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция Переносы_ПолучитьШаблонВТСтоимостьОбъектовОС(ЕстьЦМО, ЕстьДоговоры, ЕстьКонтрагенты) 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтоимостьОбъектовОСОбороты.Период КАК Период,
	|	СтоимостьОбъектовОСОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОбороты.ИнвентарныйНомер КАК ИнвентарныйНомер," + ?(ЕстьЦМО, "
	|	СтоимостьОбъектовОСОбороты.ЦМО КАК ЦМО,", "") + ?(ЕстьДоговоры, "
	|	СтоимостьОбъектовОСОбороты.Договор КАК Договор,", "") + "
	|	СУММА(СтоимостьОбъектовОСОбороты.СтоимостьОборот) КАК СтоимостьОборот,
	|	СУММА(СтоимостьОбъектовОСОбороты.КоличествоОборот) КАК КоличествоОборот," + ?(ЕстьКонтрагенты, "
	|	СтоимостьОбъектовОСОбороты.Контрагент КАК Контрагент,", "") + "
	|	СтоимостьОбъектовОСОбороты.Амортизация КАК Амортизация,
	|	СтоимостьОбъектовОСОбороты.Обесценение КАК Обесценение,
	|	СтоимостьОбъектовОСОбороты.Счет КАК Счет
	|ПОМЕСТИТЬ ДвиженияРН_%ИмяВТСтоимостьОС
	|ИЗ
	|	ДвиженияРН_ЕстьЦМОДогКон КАК СтоимостьОбъектовОСОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОбъектовОСОбороты.Обесценение," + ?(ЕстьЦМО, "
	|	СтоимостьОбъектовОСОбороты.ЦМО,", "") + ?(ЕстьДоговоры, "
	|	СтоимостьОбъектовОСОбороты.Договор,", "") + ?(ЕстьКонтрагенты, "
	|	СтоимостьОбъектовОСОбороты.Контрагент,", "") + "
	|	СтоимостьОбъектовОСОбороты.Счет,
	|	СтоимостьОбъектовОСОбороты.Амортизация,
	|	СтоимостьОбъектовОСОбороты.Период,
	|	СтоимостьОбъектовОСОбороты.ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОбороты.ОсновноеСредство";
	  
	Возврат ТекстЗапроса;
	
КонецФункции

Функция Переносы_ПолучитьТекстЗапросаДвиженияБУДоков(ПараметрыВыполнения)
	
	ПерваяИтерация = Истина;	
	Для каждого СтрокаМассив Из ПараметрыВыполнения.МассивСрезСубконто Цикл
		
		ШаблонВТ = Переносы_ПолучитьШаблонДвиженияБУДоков(СтрокаМассив.ЕстьЦМО, СтрокаМассив.ЕстьДоговоры, СтрокаМассив.ЕстьКонтрагенты);
		ИмяВТ = "Есть" + ?(СтрокаМассив.ЕстьЦМО, "ЦМО", "") + ?(СтрокаМассив.ЕстьДоговоры, "Дог", "") + ?(СтрокаМассив.ЕстьКонтрагенты, "Кон", "");
		ШаблонВТ = СтрЗаменить(ШаблонВТ, "%ИмяВТСтоимостьОС", ИмяВТ);
		Если ПерваяИтерация Тогда
			ТекстЗапроса = ШаблонВТ + "
			|;
			|";
			ПерваяИтерация = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|////////////////////////////////////////////////////////////////////////////////
			|" + ШаблонВТ + "
			|;
			|";		
		КонецЕсли;
		
	КонецЦикла;

	Возврат ТекстЗапроса;	
	
КонецФункции

Функция Переносы_ПолучитьШаблонДвиженияБУДоков(ЕстьЦМО, ЕстьДоговоры, ЕстьКонтрагенты)
	
	ТекстЗапроса = " 	
	|ВЫБРАТЬ
	|	ДвиженияБУДоков.Период КАК Период, 
	|	ДвиженияБУДоков.Регистратор КАК Регистратор,
	|	ДвиженияБУДоков.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(ДвиженияРН.ИнвентарныйНомер, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК ИнвентарныйНомер," + ?(ЕстьЦМО, "
	|	ЕСТЬNULL(ДвиженияРН.ЦМО, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)) КАК ЦМО,", "") + ?(ЕстьДоговоры, "
	|	ЕСТЬNULL(ДвиженияРН.Договор, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)) КАК Договор,", "") + "
	|	СУММА(ЕСТЬNULL(ДвиженияРН.СтоимостьОборот, 0)) КАК СтоимостьОборот,
	|	СУММА(ЕСТЬNULL(ДвиженияРН.КоличествоОборот, 0)) КАК КоличествоОборот,
	|	ЛОЖЬ КАК Забаланс," + ?(ЕстьКонтрагенты, "
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,", "") + "
	|	ДвиженияБУДоков.Амортизация КАК Амортизация,
	|	ДвиженияБУДоков.Обесценение КАК Обесценение,
	|	ДвиженияБУДоков.ЭтоРасход КАК ЭтоРасход,
	|	ДвиженияРН.Счет КАК Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ) КАК ГрупповойУчет
	|ПОМЕСТИТЬ ДвиженияБУДоковОбработанная_%ИмяВТСтоимостьОС
	|ИЗ
	|	ДвиженияБУДоковСвернутая КАК ДвиженияБУДоков
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияРН_%ИмяВТСтоимостьОС КАК ДвиженияРН
	|		ПО ДвиженияБУДоков.ОсновноеСредство = ДвиженияРН.ОсновноеСредство
	|			И ДвиженияБУДоков.Амортизация = ДвиженияРН.Амортизация 
	|			И ДвиженияБУДоков.Обесценение = ДвиженияРН.Обесценение
	|			И ДвиженияБУДоков.Период >= ДвиженияРН.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ПО ДвиженияБУДоков.ОсновноеСредство = ОсновныеСредства.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияБУДоков.Период,
	|	ДвиженияБУДоков.Регистратор,
	|	ДвиженияБУДоков.ОсновноеСредство,
	|	ЕСТЬNULL(ДвиженияРН.ИнвентарныйНомер, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка))," + ?(ЕстьЦМО, "
	|	ЕСТЬNULL(ДвиженияРН.ЦМО, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)),", "") + ?(ЕстьДоговоры, "
	|	ЕСТЬNULL(ДвиженияРН.Договор, ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)),", "") + ?(ЕстьКонтрагенты, "
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),", "") + "
	|	ДвиженияБУДоков.Амортизация,
	|	ДвиженияБУДоков.Обесценение,
	|	ДвиженияБУДоков.ЭтоРасход,
	|	ДвиженияРН.Счет,
	|	ЕСТЬNULL(ОсновныеСредства.ГрупповойУчет, ЛОЖЬ)
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДвиженияРН.КоличествоОборот) <> 0
	|		ИЛИ СУММА(ДвиженияРН.СтоимостьОборот) <> 0)";
		  
	Возврат ТекстЗапроса;

КонецФункции	

#КонецОбласти

#Область Обороты_ТекстЗапроса

Функция Обороты_ПолучитьТекстЗапросаСтоимостьОбъектовОС(ПараметрыВыполнения)

	ТекстЗапроса = "";
	ПерваяИтерация = Истина; 
	
	Для каждого СтрокаМассив Из ПараметрыВыполнения.МассивСрезСубконто Цикл
		ШаблонВТ = Обороты_ПолучитьШаблонВТСтоимостьОбъектовОС(СтрокаМассив.ЕстьЦМО, СтрокаМассив.ЕстьДоговоры, СтрокаМассив.ЕстьКонтрагенты);
		ИмяВТ = "Есть" + ?(СтрокаМассив.ЕстьЦМО, "ЦМО", "") + ?(СтрокаМассив.ЕстьДоговоры, "Дог", "") + ?(СтрокаМассив.ЕстьКонтрагенты, "Кон", "");
		ШаблонВТ = СтрЗаменить(ШаблонВТ, "%ИмяВТСтоимостьОС", ИмяВТ);
		Если ПерваяИтерация Тогда
			ТекстЗапроса = ШаблонВТ + "
			|;
			|";
			ПерваяИтерация = Ложь;
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|////////////////////////////////////////////////////////////////////////////////
			|" + ШаблонВТ + "
			|;
			|";	
		КонецЕсли;	
	КонецЦикла;
	Возврат ТекстЗапроса;
	
КонецФункции

Функция Обороты_ПолучитьШаблонВТСтоимостьОбъектовОС(ЕстьЦМО, ЕстьДоговоры, ЕстьКонтрагенты) 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтоимостьОбъектовОСОбороты.Период КАК Период,
	|	СтоимостьОбъектовОСОбороты.Регистратор КАК Регистратор,
	|	СтоимостьОбъектовОСОбороты.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОбороты.ИнвентарныйНомер КАК ИнвентарныйНомер," + ?(ЕстьЦМО, "
	|	СтоимостьОбъектовОСОбороты.ЦМО КАК ЦМО,", "") + ?(ЕстьДоговоры, "
	|	СтоимостьОбъектовОСОбороты.Договор КАК Договор,", "") + "
	|	СУММА(СтоимостьОбъектовОСОбороты.СтоимостьОборот) КАК СтоимостьОборот,
	|	СУММА(СтоимостьОбъектовОСОбороты.КоличествоОборот) КАК КоличествоОборот,
	|	СтоимостьОбъектовОСОбороты.Забаланс КАК Забаланс," + ?(ЕстьКонтрагенты, "
	|	СтоимостьОбъектовОСОбороты.Контрагент КАК Контрагент,", "") + "
	|	СтоимостьОбъектовОСОбороты.Амортизация КАК Амортизация,
	|	СтоимостьОбъектовОСОбороты.Обесценение КАК Обесценение,
	|	СтоимостьОбъектовОСОбороты.ЭтоРасход КАК ЭтоРасход,
	|	СтоимостьОбъектовОСОбороты.Счет КАК Счет,
	|	СтоимостьОбъектовОСОбороты.ГрупповойУчет КАК ГрупповойУчет
	|ПОМЕСТИТЬ ВТОборотыОС_ПоИнвентарным_%ИмяВТСтоимостьОС
	|ИЗ
	|	ВТОборотыОС_ПоИнвентарным_ЕстьЦМОДогКон КАК СтоимостьОбъектовОСОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОбъектовОСОбороты.Обесценение," + ?(ЕстьЦМО, "
	|	СтоимостьОбъектовОСОбороты.ЦМО,", "") + ?(ЕстьДоговоры, "
	|	СтоимостьОбъектовОСОбороты.Договор,", "") + ?(ЕстьКонтрагенты, "
	|	СтоимостьОбъектовОСОбороты.Контрагент,", "") + "
	|	СтоимостьОбъектовОСОбороты.Счет,
	|	СтоимостьОбъектовОСОбороты.ЭтоРасход,
	|	СтоимостьОбъектовОСОбороты.ГрупповойУчет,
	|	СтоимостьОбъектовОСОбороты.Забаланс,
	|	СтоимостьОбъектовОСОбороты.Амортизация,
	|	СтоимостьОбъектовОСОбороты.Период, 
	|	СтоимостьОбъектовОСОбороты.Регистратор,
	|	СтоимостьОбъектовОСОбороты.ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОбороты.ОсновноеСредство";
	  
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция Обороты_ПолучитьСоединенияВТСтоимостьОбъектовОС(Суффикс, ПараметрыВыполнения)
	
	БазовыеУсловияСоединения = "(НЕ ВТОбороты_Общие_Предварительно.Счет%Суффикс В ИЕРАРХИИ (&СчетаИсключенияОС))
	|			И ВТОбороты_Общие_Предварительно.Амортизация%Суффикс = ВТОборотыОС_ПоИнвентарным_%ИмяВТ%Суффикс.Амортизация
	|			И ВТОбороты_Общие_Предварительно.Обесценение%Суффикс = ВТОборотыОС_ПоИнвентарным_%ИмяВТ%Суффикс.Обесценение
	|			И ВТОбороты_Общие_Предварительно.Период = ВТОборотыОС_ПоИнвентарным_%ИмяВТ%Суффикс.Период
	|			И (ВТОбороты_Общие_Предварительно.Регистратор = ВТОборотыОС_ПоИнвентарным_%ИмяВТ%Суффикс.Регистратор
	|			ИЛИ ВТОборотыОС_ПоИнвентарным_%ИмяВТ%Суффикс.Регистратор ССЫЛКА Документ.КорректировкаРегистров)
	|			И ВТОбороты_Общие_Предварительно.Счет%Суффикс.Забалансовый = ВТОборотыОС_ПоИнвентарным_%ИмяВТ%Суффикс.Забаланс
	|			И (" + ?(Суффикс = "Кт", "", "НЕ") + " ВТОборотыОС_ПоИнвентарным_%ИмяВТ%Суффикс.ЭтоРасход)
	|			И ВТОбороты_Общие_Предварительно.КодВерхнегоУровня%Суффикс = ВТОборотыОС_ПоИнвентарным_%ИмяВТ%Суффикс.Счет
	|			И ВТОбороты_Общие_Предварительно.ОС_%Суффикс = ВТОборотыОС_ПоИнвентарным_%ИмяВТ%Суффикс.ОсновноеСредство";  
	
	БазовыеУсловияСоединенияДвиженияБУДоков = СтрЗаменить(БазовыеУсловияСоединения, "ВТОборотыОС_ПоИнвентарным_", "ДвиженияБУДоковОбработанная_");
	БазовыеУсловияСоединенияДвиженияБУДоков = БазовыеУсловияСоединенияДвиженияБУДоков + "
	|			И ВТОбороты_Общие_Предварительно.ПолучитьИнвНомер";
	
	ТекстСоединения = "ЛЕВОЕ СОЕДИНЕНИЕ ВТОборотыОС_ПоИнвентарным_АмортОбесц КАК ВТОборотыОС_ПоИнвентарным_АмортОбесц%Суффикс
	|		ПО " + ?(Суффикс = "Кт", СтрЗаменить(СтрЗаменить(БазовыеУсловияСоединения, "%ИмяВТ", "АмортОбесц"), "( ВТОборотыОС_ПоИнвентарным_АмортОбесц%Суффикс.ЭтоРасход)","
	|			ВЫБОР КОГДА ВТОбороты_Общие_Предварительно.АмортизацияКт И ВТОбороты_Общие_Предварительно.Сумма < 0 
	|				ТОГДА (НЕ ВТОборотыОС_ПоИнвентарным_АмортОбесцКт.ЭтоРасход)
	|				КОГДА ВТОборотыОС_ПоИнвентарным_АмортОбесцКт.Регистратор ССЫЛКА Документ.КорректировкаРегистров 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ (ВТОборотыОС_ПоИнвентарным_АмортОбесцКт.ЭтоРасход)
	|			КОНЕЦ"), СтрЗаменить(БазовыеУсловияСоединения, "%ИмяВТ", "АмортОбесц")) + " 
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОборотыОС_ПоИнвентарным_НетЦМОДогКон КАК ВТОборотыОС_ПоИнвентарным_НетЦМОДогКон%Суффикс
	|		ПО " + СтрЗаменить(БазовыеУсловияСоединения, "%ИмяВТ", "НетЦМОДогКон") + "
	|			И (НЕ ВТОбороты_Общие_Предварительно.ЕстьЦМО_%Суффикс И НЕ ВТОбороты_Общие_Предварительно.ЕстьДоговоры_%Суффикс И НЕ ВТОбороты_Общие_Предварительно.ЕстьКонтрагенты_%Суффикс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияБУДоковОбработанная_АмортОбесц КАК ДвиженияБУДоковОбработанная_АмортОбесц%Суффикс
	|		ПО " + СтрЗаменить(БазовыеУсловияСоединенияДвиженияБУДоков, "%ИмяВТ", "АмортОбесц") + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияБУДоковОбработанная_НетЦМОДогКон КАК ДвиженияБУДоковОбработанная_НетЦМОДогКон%Суффикс
	|		ПО " + СтрЗаменить(БазовыеУсловияСоединенияДвиженияБУДоков, "%ИмяВТ", "НетЦМОДогКон") + "
	|			И (НЕ ВТОбороты_Общие_Предварительно.ЕстьЦМО_%Суффикс И НЕ ВТОбороты_Общие_Предварительно.ЕстьДоговоры_%Суффикс И НЕ ВТОбороты_Общие_Предварительно.ЕстьКонтрагенты_%Суффикс)";

	Для каждого СтрокаМассива Из ПараметрыВыполнения.МассивСрезСубконто Цикл
		ИмяВТ = "Есть" + ?(СтрокаМассива.ЕстьЦМО, "ЦМО", "") + ?(СтрокаМассива.ЕстьДоговоры, "Дог", "") + ?(СтрокаМассива.ЕстьКонтрагенты, "Кон", ""); 
		ТекстСоединения = ТекстСоединения + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОборотыОС_ПоИнвентарным_" + ИмяВТ + " КАК ВТОборотыОС_ПоИнвентарным_" + ИмяВТ + Суффикс + "
		|		ПО " + СтрЗаменить(БазовыеУсловияСоединения, "%ИмяВТ", ИмяВТ) + "
		|			И (" 
		+ ?(СтрокаМассива.ЕстьЦМО, "ВТОбороты_Общие_Предварительно.ЦМО_%Суффикс = ВТОборотыОС_ПоИнвентарным_" + ИмяВТ + Суффикс + ".ЦМО И ", "НЕ ") + "ВТОбороты_Общие_Предварительно.ЕстьЦМО_%Суффикс И " 
		+ ?(СтрокаМассива.ЕстьДоговоры, "ВТОбороты_Общие_Предварительно.Договоры_%Суффикс = ВТОборотыОС_ПоИнвентарным_" + ИмяВТ + Суффикс + ".Договор И ", "НЕ ") + "ВТОбороты_Общие_Предварительно.ЕстьДоговоры_%Суффикс И " 
		+ ?(СтрокаМассива.ЕстьКонтрагенты, "ВТОбороты_Общие_Предварительно.Контрагенты_%Суффикс = ВТОборотыОС_ПоИнвентарным_" + ИмяВТ + Суффикс + ".Контрагент И ", "НЕ ") + "ВТОбороты_Общие_Предварительно.ЕстьКонтрагенты_%Суффикс)";
		
		ТекстСоединения = ТекстСоединения + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияБУДоковОбработанная_" + ИмяВТ + " КАК ДвиженияБУДоковОбработанная_" + ИмяВТ + Суффикс + "
		|		ПО " + СтрЗаменить(БазовыеУсловияСоединенияДвиженияБУДоков, "%ИмяВТ", ИмяВТ) + "
		|			И (" 
		+ ?(СтрокаМассива.ЕстьЦМО, "ВТОбороты_Общие_Предварительно.ЦМО_%Суффикс = ДвиженияБУДоковОбработанная_" + ИмяВТ + Суффикс + ".ЦМО И ", "НЕ ") + "ВТОбороты_Общие_Предварительно.ЕстьЦМО_%Суффикс И " 
		+ ?(СтрокаМассива.ЕстьДоговоры, "ВТОбороты_Общие_Предварительно.Договоры_%Суффикс = ДвиженияБУДоковОбработанная_" + ИмяВТ + Суффикс + ".Договор И ", "НЕ ") + "ВТОбороты_Общие_Предварительно.ЕстьДоговоры_%Суффикс И " 
		+ ?(СтрокаМассива.ЕстьКонтрагенты, "ВТОбороты_Общие_Предварительно.Контрагенты_%Суффикс = ДвиженияБУДоковОбработанная_" + ИмяВТ + Суффикс + ".Контрагент И ", "НЕ ") + "ВТОбороты_Общие_Предварительно.ЕстьКонтрагенты_%Суффикс)";
	КонецЦикла;	
	ТекстСоединения = СтрЗаменить(ТекстСоединения, "%Суффикс", Суффикс);
	Возврат ТекстСоединения;
	
КонецФункции

Функция Обороты_ПолучитьПолеВыбораВТСтоимостьОбъектовОС(Суффикс, ОсновноеПоле, ВспомогательноеПоле, ПараметрыВыполнения, Минус = Ложь)
		
	ТекстПоляВыбора = "ВЫБОР
	|					КОГДА ВТОбороты_Общие_Предварительно.Амортизация%Суффикс ИЛИ ВТОбороты_Общие_Предварительно.Обесценение%Суффикс ТОГДА" + 
	?(ОсновноеПоле = "ИнвентарныйНомер", "
	|						ВЫБОР КОГДА ВТОборотыОС_ПоИнвентарным_АмортОбесц%Суффикс.%ОсновноеПоле ЕСТЬ NULL 
	|							ИЛИ ВТОборотыОС_ПоИнвентарным_АмортОбесц%Суффикс.%ОсновноеПоле = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) ТОГДА
	|								ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле
	|						ИНАЧЕ ВТОборотыОС_ПоИнвентарным_АмортОбесц%Суффикс.%ОсновноеПоле КОНЕЦ", 
	?(ОсновноеПоле = "СтоимостьОборот" И Суффикс = "Кт", "
	|						ВЫБОР КОГДА ЕСТЬNULL(" + ?(Минус, "-", "") + "ВТОборотыОС_ПоИнвентарным_АмортОбесц%Суффикс.%ОсновноеПоле, ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле) < 0 
	|							И ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле < 0
	|						ТОГДА
	|							ВЫБОР КОГДА -ЕСТЬNULL(" + ?(Минус, "-", "") + "ВТОборотыОС_ПоИнвентарным_АмортОбесц%Суффикс.%ОсновноеПоле, ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле) <= -ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле
	|								ТОГДА ЕСТЬNULL(" + ?(Минус, "-", "") + "ВТОборотыОС_ПоИнвентарным_АмортОбесц%Суффикс.%ОсновноеПоле, ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле)
	|							ИНАЧЕ ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле 
	|							КОНЕЦ
	|						ИНАЧЕ 
	|							ВЫБОР КОГДА ЕСТЬNULL(" + ?(Минус, "-", "") + "ВТОборотыОС_ПоИнвентарным_АмортОбесц%Суффикс.%ОсновноеПоле, ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле) <= ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле
	|								ТОГДА ЕСТЬNULL(" + ?(Минус, "-", "") + "ВТОборотыОС_ПоИнвентарным_АмортОбесц%Суффикс.%ОсновноеПоле, ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле)
	|							ИНАЧЕ ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле
	|							КОНЕЦ
	|						КОНЕЦ", "
	|						ЕСТЬNULL(" + ?(Минус, "-", "") + "ВТОборотыОС_ПоИнвентарным_АмортОбесц%Суффикс.%ОсновноеПоле, ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле)")) + "	 
	|					КОГДА НЕ ВТОбороты_Общие_Предварительно.ЕстьЦМО_%Суффикс И НЕ ВТОбороты_Общие_Предварительно.ЕстьДоговоры_%Суффикс И НЕ ВТОбороты_Общие_Предварительно.ЕстьКонтрагенты_%Суффикс ТОГДА" + 
	?(ОсновноеПоле = "ИнвентарныйНомер", "
	|						ВЫБОР КОГДА ВТОборотыОС_ПоИнвентарным_НетЦМОДогКон%Суффикс.%ОсновноеПоле ЕСТЬ NULL 
	|							ИЛИ ВТОборотыОС_ПоИнвентарным_НетЦМОДогКон%Суффикс.%ОсновноеПоле = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) ТОГДА
	|								ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле
	|						ИНАЧЕ ВТОборотыОС_ПоИнвентарным_НетЦМОДогКон%Суффикс.%ОсновноеПоле КОНЕЦ", "
	|						ЕСТЬNULL(" + ?(Минус, "-", "") + "ВТОборотыОС_ПоИнвентарным_НетЦМОДогКон%Суффикс.%ОсновноеПоле, ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле)");
	
	Для каждого СтрокаМассива Из ПараметрыВыполнения.МассивСрезСубконто Цикл
		ИмяВТ = "Есть" + ?(СтрокаМассива.ЕстьЦМО, "ЦМО", "") + ?(СтрокаМассива.ЕстьДоговоры, "Дог", "") + ?(СтрокаМассива.ЕстьКонтрагенты, "Кон", ""); 
		ТекстПоляВыбора = ТекстПоляВыбора + "
		|					КОГДА " + ?(СтрокаМассива.ЕстьЦМО, "", "НЕ ") + "ВТОбороты_Общие_Предварительно.ЕстьЦМО_%Суффикс И " + ?(СтрокаМассива.ЕстьДоговоры, "", "НЕ ") + "ВТОбороты_Общие_Предварительно.ЕстьДоговоры_%Суффикс И " + ?(СтрокаМассива.ЕстьКонтрагенты, "", "НЕ ") + "ВТОбороты_Общие_Предварительно.ЕстьКонтрагенты_%Суффикс ТОГДА" + 
		?(ОсновноеПоле = "ИнвентарныйНомер", "
		|						ВЫБОР КОГДА ВТОборотыОС_ПоИнвентарным_" + ИмяВТ + Суффикс + ".%ОсновноеПоле ЕСТЬ NULL 
		|							ИЛИ ВТОборотыОС_ПоИнвентарным_" + ИмяВТ + Суффикс + ".%ОсновноеПоле = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) ТОГДА
		|								ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле
		|						ИНАЧЕ ВТОборотыОС_ПоИнвентарным_" + ИмяВТ + Суффикс + ".%ОсновноеПоле КОНЕЦ", "
		|						ЕСТЬNULL(" + ?(Минус, "-", "") + "ВТОборотыОС_ПоИнвентарным_" + ИмяВТ + Суффикс + ".%ОсновноеПоле, ВТОбороты_Общие_Предварительно.%ВспомогательноеПоле)");		
	КонецЦикла;		
	ТекстПоляВыбора = ТекстПоляВыбора + "
	|					КОНЕЦ";
	ТекстПоляВыбора = СтрЗаменить(ТекстПоляВыбора, "%ОсновноеПоле", ОсновноеПоле);
	ТекстПоляВыбора = СтрЗаменить(ТекстПоляВыбора, "%ВспомогательноеПоле", ВспомогательноеПоле);
	ТекстПоляВыбора = СтрЗаменить(ТекстПоляВыбора, "%Суффикс", Суффикс);
	
	ТекстПоляВыбораДвиженияБУДоков = СтрЗаменить(СтрЗаменить(ТекстПоляВыбора, "ВТОборотыОС_ПоИнвентарным_", "ДвиженияБУДоковОбработанная_"), "-", "");
	
	ТекстПоляРезультат = "ВЫБОР
	|					КОГДА ВТОбороты_Общие_Предварительно.ПолучитьИнвНомер ТОГДА
	|						" + ТекстПоляВыбораДвиженияБУДоков + " 
	|					ИНАЧЕ " + ТекстПоляВыбора + " КОНЕЦ";
		
	Возврат ТекстПоляРезультат;
	
КонецФункции

Функция Обороты_УничтожитьТаблицыСтоимостьОС(ПараметрыВыполнения) 
	
	ТекстЗапроса = "
	|УНИЧТОЖИТЬ Регистраторы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДвиженияРН_ЕстьЦМОДогКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДвиженияРН_НетЦМОДогКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДвиженияРН_АмортОбесц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДвиженияБУДоковОбработанная_ЕстьЦМОДогКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДвиженияБУДоковОбработанная_НетЦМОДогКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДвиженияБУДоковОбработанная_АмортОбесц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОборотыОС_ПоИнвентарным_ЕстьЦМОДогКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОборотыОС_ПоИнвентарным_НетЦМОДогКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТОборотыОС_ПоИнвентарным_АмортОбесц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////"; 
	
	Для каждого СтрокаМассив ИЗ ПараметрыВыполнения.МассивСрезСубконто Цикл 
		ИмяВТ = "Есть" + ?(СтрокаМассив.ЕстьЦМО, "ЦМО", "") + ?(СтрокаМассив.ЕстьДоговоры, "Дог", "") + ?(СтрокаМассив.ЕстьКонтрагенты, "Кон", "");
		ТекстЗапроса = ТекстЗапроса + "
		|УНИЧТОЖИТЬ  ДвиженияРН_" + ИмяВТ + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ  ДвиженияБУДоковОбработанная_" + ИмяВТ + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ  ВТОборотыОС_ПоИнвентарным_" + ИмяВТ + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";		
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаОбороты(ПараметрыВыполнения)
	
	СубконтоНаСчетах = ПараметрыВыполнения.СубконтоНаСчетах;
	ТекстЗапроса = ""; 

	Для каждого СтрокаСубконто Из СубконтоНаСчетах Цикл	

		ТекстПолеВыбораДт = ПолучитьТекстПолеВыбораПоСубконто(СтрокаСубконто, "Дт");
		ТекстПолеВыбораКт = ПолучитьТекстПолеВыбораПоСубконто(СтрокаСубконто, "Кт");
				
		УсловиеСчетаОборотыДт = "";
		УсловиеСчетаОборотыКт = "";
		
		Для каждого СтрокаСубконтоВложенный Из СубконтоНаСчетах Цикл 
			ТекстПолеВыбораВложенныйКт = ПолучитьТекстПолеВыбораПоСубконто(СтрокаСубконтоВложенный, "Кт");
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЖурналПроводокЕПСБУДвиженияССубконто.Период,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.Организация,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт," + 
			ТекстПолеВыбораДт + 
			ТекстПолеВыбораВложенныйКт + "
			|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаДт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаКт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.ПолучитьИнвНомер КАК ПолучитьИнвНомер,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.МежотчетныйПериод КАК МежотчетныйПериод,
			|	ЖурналПроводокЕПСБУДвиженияССубконто.ЗаключениеСчетов КАК ЗаключениеСчетов

			|ИЗ
			|	ВТ_ЖурналПроводокЕПСБУДвиженияССубконто_Предварительно КАК ЖурналПроводокЕПСБУДвиженияССубконто
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
			|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.Организация = ВТОрганизацииФедеральногоБюджета.Организация
			|ГДЕ
			|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт В (&Счета_" + СтрокаСубконто.Идентификатор + ")
			|	И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт В (&Счета_" + СтрокаСубконтоВложенный.Идентификатор + ")";	
			
			УсловиеСчетаОборотыДт = УсловиеСчетаОборотыДт + ?(УсловиеСчетаОборотыДт = "", "", " И ") + "НЕ ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт В (&Счета_" + СтрокаСубконтоВложенный.Идентификатор + ")";	
			УсловиеСчетаОборотыКт = УсловиеСчетаОборотыКт + ?(УсловиеСчетаОборотыКт = "", "", " И ") + "НЕ ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт В (&Счета_" + СтрокаСубконтоВложенный.Идентификатор + ")";
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Период,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Организация,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт," + 
		ТекстПолеВыбораДт + "
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ПолучитьИнвНомер,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.МежотчетныйПериод,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ЗаключениеСчетов
		|ИЗ
		|	ВТ_ЖурналПроводокЕПСБУДвиженияССубконто_Предварительно КАК ЖурналПроводокЕПСБУДвиженияССубконто
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
		|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.Организация = ВТОрганизацииФедеральногоБюджета.Организация
		|ГДЕ
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт В (&Счета_" + СтрокаСубконто.Идентификатор + ")
		|	И " + УсловиеСчетаОборотыКт + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Период,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Организация,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3," + 
		ТекстПолеВыбораКт + "
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ПолучитьИнвНомер,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.МежотчетныйПериод,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ЗаключениеСчетов

		|ИЗ
		|	ВТ_ЖурналПроводокЕПСБУДвиженияССубконто_Предварительно КАК ЖурналПроводокЕПСБУДвиженияССубконто
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОрганизацииФедеральногоБюджета КАК ВТОрганизацииФедеральногоБюджета
		|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.Организация = ВТОрганизацииФедеральногоБюджета.Организация
		|ГДЕ
		|	" + УсловиеСчетаОборотыДт + "
		|	И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт В (&Счета_" + СтрокаСубконто.Идентификатор + ")";	
			
	КонецЦикла;	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьАдресСтрокой(Знач АдресСтрокой)
	
	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	МодульУправлениеКонтактнойИнформациейКлиентСервер = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиентСервер");
	Попытка
		Если НЕ МодульУправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(АдресСтрокой) Тогда
			АдресСтрокой = МодульУправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(АдресСтрокой, Перечисления.ТипыКонтактнойИнформации.Адрес);
		КонецЕсли;                                 
	Исключение
		ВызватьИсключение(СтрШаблон(НСтр("ru = 'Ошибка преобразования данных адреса:%1%2%1'"), Символы.ПС, АдресСтрокой) + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	Возврат АдресСтрокой;
	
КонецФункции	

#КонецОбласти

#КонецОбласти

#КонецЕсли