#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ЗаполнитьИтогиРаздела2();
	
	// СерииДокументов
	ИнвентаризацияСервер.ОбновитьРеквизитыСерииЗаголовочногоДокументаСерии(ЭтотОбъект);
	// Конец СерииДокументов
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// СерииДокументов
	ИнвентаризацияСервер.ОбновитьРеквизитыСерииСодержательныхДокументовСерии(ЭтотОбъект);
	// Конец СерииДокументов
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ОчищающаяСтруктура = Новый Структура("ДокументРасписки,ЭтоЗаголовочныйДокумент,ИдентификаторСерииДокументов");
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОчищающаяСтруктура);
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	// СерииДокументов
	ИнвентаризацияСервер.НастроитьПрефиксДокументаСерииДокументов(ЭтотОбъект, Префикс);
	// Конец СерииДокументов
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();
	НепроверяемыеРеквизиты.Добавить("Раздел21.НомерАктаСверки");
	НепроверяемыеРеквизиты.Добавить("Раздел21.ДатаАктаСверки");
	НепроверяемыеРеквизиты.Добавить("Раздел21.ЗаключениеКомиссии");
	
	НепроверяемыеРеквизиты.Добавить("Раздел22.НомерАктаСверки");
	НепроверяемыеРеквизиты.Добавить("Раздел22.ДатаАктаСверки");
	НепроверяемыеРеквизиты.Добавить("Раздел22.ЗаключениеКомиссии");
	
	НепроверяемыеРеквизиты.Добавить("СоставКомиссии.ПричинаОтсутствия");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	Если Документы.УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям.ЕстьОшибкиЗаполнения(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИтогиРаздела2()
	
	КолонкиГруппировкиСчет = "Счет,КПС,КФО,КЭК";
	
	КолонкиГруппировкиКонтрагент = "Контрагент,ИдентификаторКонтрагента";
	
	КолонкиСуммирования = "СуммаРуб,СуммаПодтвержденаАктомСверкиРуб,СуммаНеПодтвержденаАктомСверкиРуб";
	
	ВремТаблица = Раздел21.Выгрузить(, КолонкиГруппировкиСчет + "," + КолонкиСуммирования);
	ВремТаблица.Свернуть(КолонкиГруппировкиСчет, КолонкиСуммирования);
	ВремТаблица.Сортировать(КолонкиГруппировкиСчет);
	
	ИтогиРаздела21ПоСчету.Загрузить(ВремТаблица);
	
	ВремТаблица = Раздел21.Выгрузить(, КолонкиГруппировкиКонтрагент + "," + КолонкиСуммирования);
	ВремТаблица.Свернуть(КолонкиГруппировкиКонтрагент, КолонкиСуммирования);
	ВремТаблица.Сортировать(КолонкиГруппировкиКонтрагент);
	
	ИтогиРаздела21ПоКонтрагенту.Загрузить(ВремТаблица);
	
	ВремТаблица = Раздел22.Выгрузить(, КолонкиГруппировкиСчет + "," + КолонкиСуммирования);
	ВремТаблица.Свернуть(КолонкиГруппировкиСчет, КолонкиСуммирования);
	ВремТаблица.Сортировать(КолонкиГруппировкиСчет);
	
	ИтогиРаздела22ПоСчету.Загрузить(ВремТаблица);
	
	ВремТаблица = Раздел22.Выгрузить(, КолонкиГруппировкиКонтрагент + "," + КолонкиСуммирования);
	ВремТаблица.Свернуть(КолонкиГруппировкиКонтрагент, КолонкиСуммирования);
	ВремТаблица.Сортировать(КолонкиГруппировкиКонтрагент);
	
	ИтогиРаздела22ПоКонтрагенту.Загрузить(ВремТаблица);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
