
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Валюта") И ЗначениеЗаполнено(Параметры.Валюта) Тогда
		Валюта = Параметры.Валюта;
	КонецЕсли;
	Если Параметры.Свойство("ИФО") Тогда
		ИФО = Параметры.ИФО;
		Если Параметры.Свойство("ВидДокумента") И Параметры.ВидДокумента = "РегистрацияОбязательствИСведенийПоДоговорам" Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИФО", "ТолькоПросмотр", Истина);
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("КФО") И ЗначениеЗаполнено(Параметры.КФО) Тогда
		КФО = Параметры.КФО;
	КонецЕсли;
	Если Параметры.Свойство("КПС") И ЗначениеЗаполнено(Параметры.КПС) Тогда
		КПС = Параметры.КПС;
	КонецЕсли;
	Если Параметры.Свойство("КЭК") И ЗначениеЗаполнено(Параметры.КЭК) Тогда
		КЭК = Параметры.КЭК;
	КонецЕсли;
	Если Параметры.Свойство("СчетРасчетов") И ЗначениеЗаполнено(Параметры.СчетРасчетов) Тогда
		СчетРасчетов = Параметры.СчетРасчетов;
	КонецЕсли;
	Если Параметры.Свойство("НачалоПериода") И ЗначениеЗаполнено(Параметры.НачалоПериода) Тогда
		НачалоПериодаПлатежей = Параметры.НачалоПериода;
		НачалоПериодаНачислений = Параметры.НачалоПериода;
	КонецЕсли;
	Если Параметры.Свойство("КонецПериода") И ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
		КонецПериодаПлатежей = Параметры.КонецПериода;
		КонецПериодаНачислений = Параметры.КонецПериода;
	КонецЕсли;
	Если Параметры.Свойство("Договор") И ЗначениеЗаполнено(Параметры.Договор) Тогда
		Договор = Параметры.Договор;
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора,ВестиГрафикПлатежей,ВестиПланГрафикИсполнения");
		ВидДоговора = РеквизитыДоговора.ВидДоговора;
		ВестиГрафикПлатежей = ?(РеквизитыДоговора.ВестиГрафикПлатежей = Неопределено, Ложь, РеквизитыДоговора.ВестиГрафикПлатежей);
		ВестиГрафикИсполнения = ?(РеквизитыДоговора.ВестиПланГрафикИсполнения = Неопределено, Ложь, РеквизитыДоговора.ВестиПланГрафикИсполнения);
	Иначе
		ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПустаяСсылка();
		ВестиГрафикПлатежей = Истина;
		ВестиГрафикИсполнения = Истина;
	КонецЕсли;
	Если Параметры.Свойство("СуммаПоДоговору") И ЗначениеЗаполнено(Параметры.СуммаПоДоговору) Тогда
		СуммаПоДоговору = Параметры.СуммаПоДоговору;
	КонецЕсли;
	
	ПериодичностьЗаполнитьСписокВыбора(Элементы.ПериодичностьПлатежей.СписокВыбора, НачалоПериодаПлатежей, КонецПериодаПлатежей);
	ПериодичностьЗаполнитьСписокВыбора(Элементы.ПериодичностьНачислений.СписокВыбора, НачалоПериодаНачислений, КонецПериодаНачислений);
	ПериодичностьПлатежей = "ПоМесяцам";
	ПериодичностьНачислений = "ПоМесяцам";
	
	ВариантПлатежей = 1; // В начале периода.
	ВариантНачислений = 0; // В конце периода.
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГрафикПлатежей", "Доступность", ВестиГрафикПлатежей);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГрафикНачислений", "Доступность", ВестиГрафикИсполнения);
	
	ИспользоватьДетализациюПоКОСГУВГрафиках = КонтрольИсполненияДоговоров.ИспользоватьДетализациюПоКОСГУВГрафикахПоДоговорам(ВидДоговора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КЭК", "Видимость", ИспользоватьДетализациюПоКОСГУВГрафиках);
	
	ИспользоватьДополнительнуюАналитикуВГрафикахПлатежей = КонтрольИсполненияДоговоров.ИспользоватьДополнительнуюАналитикуВГрафикахПлатежей(ВидДоговора);
	ЭлементыДопАналитика = Новый Массив;
	ЭлементыДопАналитика.Добавить("ДопКлассификация");
	ЭлементыДопАналитика.Добавить("КодМероприятия");
	ЭлементыДопАналитика.Добавить("КодЦели");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыДопАналитика, "Видимость", ИспользоватьДополнительнуюАналитикуВГрафикахПлатежей);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность И НЕ ПеренестиВДокумент Тогда
		
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		Оповещение = Новый ОписаниеОповещения("ВопросЗавершитьРедактирование", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
		Отказ = Истина;
		
	Иначе
		
		Если ПеренестиВДокумент И НЕ Отказ Тогда
			Отказ = НЕ ПроверитьЗаполнениеНаКлиенте();
		КонецЕсли;
		
		Если Отказ Тогда
			ПеренестиВДокумент = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ПеренестиВДокумент Тогда
		
		СтруктураРезультат = Новый Структура("СуммаПоДоговору, СпособРаспределения,
			|НачалоПериодаНачислений, КонецПериодаНачислений, ПериодичностьНачислений, ВариантНачислений,
			|НачалоПериодаПлатежей, КонецПериодаПлатежей, ПериодичностьПлатежей, ВариантПлатежей,
			|ИФО, КФО, КПС, КЭК, СчетРасчетов, ДопКлассификация, КодМероприятия, КодЦели");
		ЗаполнитьЗначенияСвойств(СтруктураРезультат, ЭтотОбъект);
		
		ОповеститьОВыборе(СтруктураРезультат);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодичностьПлатежейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПериодичностьЗаполнитьСписокВыбора(Элемент.СписокВыбора, НачалоПериодаПлатежей, КонецПериодаПлатежей);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачисленийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПериодичностьЗаполнитьСписокВыбора(Элемент.СписокВыбора, НачалоПериодаНачислений, КонецПериодаНачислений);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОтбора = УчетРасчетовКлиент.ПараметрыОтбораСчетаРасчетов(
		Параметры, КЭК, Параметры.ДопустимыеСчета, СчетРасчетов);
	УчетРасчетовКлиент.РасшифровкаПлатежаСчетРасчетовНачалоВыбора(ПараметрыОтбора,
		Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетРасчетовАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ПараметрыОтбора = УчетРасчетовКлиент.ПараметрыОтбораСчетаРасчетов(
		Параметры, КЭК, Параметры.ДопустимыеСчета, СчетРасчетов);
	УчетРасчетовКлиент.РасшифровкаПлатежаСчетРасчетовАвтоПодбор(ПараметрыОтбора,
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетРасчетовОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПараметрыОтбора = УчетРасчетовКлиент.ПараметрыОтбораСчетаРасчетов(
		Параметры, КЭК, Параметры.ДопустимыеСчета, СчетРасчетов);
	УчетРасчетовКлиент.РасшифровкаПлатежаСчетРасчетовОкончаниеВводаТекста(ПараметрыОтбора,
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПериодНачислений(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = ЭтотОбъект.НачалоПериодаНачислений;
	Диалог.Период.ДатаОкончания = ЭтотОбъект.КонецПериодаНачислений;
	Диалог.Показать(Новый ОписаниеОповещения("УстановитьПериодНачисленийЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодНачисленийЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		ЭтотОбъект.НачалоПериодаНачислений = Период.ДатаНачала;
		ЭтотОбъект.КонецПериодаНачислений  = Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодПлатежей(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = ЭтотОбъект.НачалоПериодаПлатежей;
	Диалог.Период.ДатаОкончания = ЭтотОбъект.КонецПериодаПлатежей;
	Диалог.Показать(Новый ОписаниеОповещения("УстановитьПериодПлатежейЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодПлатежейЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		ЭтотОбъект.НачалоПериодаПлатежей = Период.ДатаНачала;
		ЭтотОбъект.КонецПериодаПлатежей  = Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьГрафики(Команда)
	
	ПеренестиВДокумент = Истина;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПериодичностьЗаполнитьСписокВыбора(СписокВыбора, НачалоПериода, КонецПериода)
	
	СписокВыбора.Очистить();
	
	СписокВыбора.Добавить("ПоМесяцам",    НСтр("ru = 'По месяцам'"));
	СписокВыбора.Добавить("ПоКварталам",  НСтр("ru = 'По кварталам'"));
	СписокВыбора.Добавить("ПоПолугодиям", НСтр("ru = 'По полугодиям'"));
	СписокВыбора.Добавить("ПоГодам",      НСтр("ru = 'По годам'"));
	
	// Дополнительные варианты, если дата начала и дата окончания периода
	// не совпадают с началом и окончанием календарного месяца (квартала, года).
	Если Не КонтрольИсполненияДоговоровКлиентСервер.ПериодКратенКалендарномуМесяцу(НачалоПериода, КонецПериода) Тогда
		СписокВыбора.Добавить("РазВ1Месяц",    НСтр("ru = 'Раз в месяц'"));
	КонецЕсли;
	Если Не КонтрольИсполненияДоговоровКлиентСервер.ПериодКратенКалендарномуКварталу(НачалоПериода, КонецПериода) Тогда
		СписокВыбора.Добавить("РазВ3Месяца",   НСтр("ru = 'Раз в 3 месяца'"));
	КонецЕсли;
	Если Не КонтрольИсполненияДоговоровКлиентСервер.ПериодКратенКалендарномуПолугодию(НачалоПериода, КонецПериода) Тогда
		СписокВыбора.Добавить("РазВ6Месяцев", НСтр("ru = 'Раз в 6 месяцев'"));
	КонецЕсли;
	Если Не КонтрольИсполненияДоговоровКлиентСервер.ПериодКратенКалендарномуГоду(НачалоПериода, КонецПериода) Тогда
		СписокВыбора.Добавить("РазВ12Месяцев", НСтр("ru = 'Раз в 12 месяцев'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗавершитьРедактирование(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокумент = Истина;
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		ПеренестиВДокумент = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеНаКлиенте()
	
	Отказ = Ложь;
	
	Если ВестиГрафикПлатежей Тогда
		
		Если Не ЗначениеЗаполнено(НачалоПериодаПлатежей) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
				НСтр("ru = 'Начало периода оплаты'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "НачалоПериодаПлатежей", "", Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонецПериодаПлатежей) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
				НСтр("ru = 'Конец периода оплаты'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "КонецПериодаПлатежей", "", Отказ);
		КонецЕсли;
		
		Если НачалоПериодаПлатежей > КонецПериодаПлатежей Тогда
			ТекстОшибки = НСтр("ru='Дата начала периода оплаты %1 превышает дату окончания %2'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				Формат(НачалоПериодаПлатежей, "ДЛФ=Д"),
				Формат(КонецПериодаПлатежей, "ДЛФ=Д"));
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Корректность",
				НСтр("ru = 'Начало периода оплаты'"), , , ТекстОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "НачалоПериодаПлатежей", "", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВестиГрафикИсполнения Тогда
		
		Если Не ЗначениеЗаполнено(НачалоПериодаНачислений) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
				НСтр("ru = 'Начало периода исполнения'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "НачалоПериодаНачислений", "", Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(КонецПериодаНачислений) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
				НСтр("ru = 'Конец периода исполнения'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "КонецПериодаНачислений", "", Отказ);
		КонецЕсли;
		
		Если НачалоПериодаНачислений > КонецПериодаНачислений Тогда
			ТекстОшибки = НСтр("ru='Дата начала периода исполнения %1 превышает дату окончания %2'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				Формат(НачалоПериодаПлатежей, "ДЛФ=Д"),
				Формат(КонецПериодаПлатежей, "ДЛФ=Д"));
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Корректность",
				НСтр("ru = 'Начало периода исполнения'"), , , ТекстОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "НачалоПериодаНачислений", "", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

#КонецОбласти

