#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыБГУ.ВывестиПодписьИсполнителяВОтчетСКД(КомпоновщикНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма, Неопределено - Форма отчета или форма настроек отчета.
//       Неопределено когда вызов без контекста.
//   КлючВарианта - Строка, Неопределено - Имя предопределенного
//       или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов без контекста.
//   Настройки - Структура - Настройки общей формы отчета (для изменения).
//       См. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриОпределенииСвойствЭлементовФормыНастроек = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;
	
КонецПроцедуры

// Вызывается после определения свойств элементов формы, связанных с пользовательскими настройками.
// См. ОтчетыСервер.СвойстваЭлементовФормыНастроек()
// Позволяет переопределить свойства, для целей персонализации отчета.
//
// Параметры:
//  ТипФормы - ТипФормыОтчета - см. Синтакс-помощник.
//  СвойстваЭлементов - Структура - см. ОтчетыСервер.СвойстваЭлементовФормыНастроек().
//  ПользовательскиеНастройки - КоллекцияЭлементовПользовательскихНастроекКомпоновкиДанных - элементы актуальных
//                              пользовательских настроек, влияющих на создание связанных элементов формы.
//
Процедура ПриОпределенииСвойствЭлементовФормыНастроек(ТипФормы, СвойстваЭлементов, ПользовательскиеНастройки) Экспорт 
	
	Если ТипФормы = ТипФормыОтчета.Настройка Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваГруппы = ОтчетыСервер.СвойстваГруппыЭлементовФормы();
	СвойстваГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СвойстваГруппы.Вставить("Отображение", ОтображениеОбычнойГруппы.ОбычноеВыделение);
	СвойстваЭлементов.Группы.Вставить("ФиксированныеПараметры_0", СвойстваГруппы);
	
	ФиксированныеПараметры_0 = СтрРазделить("Период,ТекущийГод,Организация", ",");
	
	ШиринаПоля = Новый Структура("ТекущийГод, Организация", 16, 0);
	
	КоличествоПолейВГруппе = 0;
	
	Для Каждого ЭлементНастройки Из ПользовательскиеНастройки Цикл 
		
		Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
			И ФиксированныеПараметры_0.Найти(Строка(ЭлементНастройки.Параметр)) <> Неопределено Тогда
			ИдентификаторГруппы = "ФиксированныеПараметры_0";
			ИмяПараметра = Строка(ЭлементНастройки.Параметр);
		ИначеЕсли ТипЗнч(ЭлементНастройки) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ИдентификаторГруппы = "ФиксированныеПараметры_0";
			ИмяПараметра = ""; 
		Иначе
			Продолжить;
		КонецЕсли;
		
		КоличествоПолейВГруппе = КоличествоПолейВГруппе + 1;
		
		СвойстваПоля = СвойстваЭлементов.Поля.Найти(
			ЭлементНастройки.ИдентификаторПользовательскойНастройки, "ИдентификаторНастройки");
		
		Если СвойстваПоля = Неопределено ИЛИ КоличествоПолейВГруппе > 3 Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля.ИдентификаторГруппы = ИдентификаторГруппы;
		
		Если ИмяПараметра <> "Период" Тогда 
			СвойстваПоля.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Если  ЗначениеЗаполнено(ИмяПараметра) И НЕ ШиринаПоля[ИмяПараметра] = 0 Тогда 
				СвойстваПоля.Ширина = ШиринаПоля[ИмяПараметра];
				СвойстваПоля.РастягиватьПоГоризонтали = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма отчета.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных - настройки для загрузки в компоновщик настроек.
//
// См. синтакс-помощник "Расширение управляемой формы для отчета.ПриЗагрузкеВариантаНаСервере" в синтакс-помощнике.
//
Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
	
	Если Форма.Параметры.Свойство("ОтборСоответствие") Тогда
		ОтчетыСервер.УстановитьФиксированныеОтборы(Форма.Параметры.ОтборСоответствие, Форма.Отчет.КомпоновщикНастроек.Настройки, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
