#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует новые поля
Процедура ПриОбновлении_2_0_44_ИнициализироватьНовыеПоля(Параметры = Неопределено) Экспорт
	
	// Подготовка
	МенеджерЗаписи			= РегистрыСведений.ДополнительныеГруппыСчетовИнвентаризацииМЗ.СоздатьМенеджерЗаписи();
	СтрокаИзмеренияРегистра	= "Организация,СчетГруппа";
	ВидСубконтоЦМО			= ПланыВидовХарактеристик.ВидыСубконто.ЦМО;
	
	// Выбираем еще необработанные записи регистра
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.ДополнительныеГруппыСчетовИнвентаризацииМЗ
	|ГДЕ
	|	СубконтоДляМОЛ = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|;";
	
	Выборка = ЗапросПоиск.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка, СтрокаИзмеренияРегистра);
		
		МенеджерЗаписи.Прочитать();
		
		// Убедиться, что запись все еще есть в базе данных
		Если МенеджерЗаписи.Выбран() Тогда
			
			МенеджерЗаписи["СубконтоДляМОЛ"]						= ВидСубконтоЦМО;
			МенеджерЗаписи["ИспользуетсяДополнительноеСубконто"]	= ЗначениеЗаполнено(Выборка["ДополнительноеСубконто"]);
			
			// Записать модифицированную запись в базу данных
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий
#КонецОбласти
//Код процедур и функций

#Область СлужебныеПроцедурыИФункции
#КонецОбласти
//Код процедур и функций

#КонецЕсли
		
