#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ОбнулитьЗаписьВФорме(Форма, ИмяРегистра, ВедущийОбъект) Экспорт

	Форма[ИмяРегистра + "Прежняя"] = Неопределено;
	
	Форма[ИмяРегистра + "НоваяЗапись"] = Ложь;

КонецПроцедуры

Процедура ОбнулитьДокументУдостоверящийЛичностьВФорме(Форма, ВедущийОбъект) Экспорт

	Форма.ДокументыФизическихЛицПрежняя = Неопределено;
	
	Форма.ДокументыФизическихЛицНоваяЗапись = Ложь;

КонецПроцедуры

Функция ПолучитьКПП(КонтрагентСсылка, Период = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(КонтрагентСсылка) Тогда
		ПолучитьТекущееЗначение = Истина;
		Если ЗначениеЗаполнено(Период) Тогда
			КППИстория = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонтрагентСсылка, "КППИстория").Выгрузить();
			КППИстория.Сортировать("ДатаОкончанияДействия ВОЗР");
			Для Каждого СтрокаИстории Из КППИстория Цикл
				Если ЗначениеЗаполнено(СтрокаИстории["ДатаОкончанияДействия"]) Тогда
					Если НачалоДня(Период) <= СтрокаИстории["ДатаОкончанияДействия"] Тогда
						КПП = СтрокаИстории["КПП"];
						ПолучитьТекущееЗначение = Ложь;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ПолучитьТекущееЗначение Тогда
			КПП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонтрагентСсылка, "КПП");
		КонецЕсли;
	Иначе
		КПП = "";
	КонецЕсли;
	
	Возврат КПП;
	
КонецФункции

 // Процедура получает данные контрагента в виде структуры.  
 //
 // Параметры
 //  ТребуемыеДанные  - Структура - Структура в которой задаются требуемые данные по контрагенту
 //                 Данные передаются в виде ключей структуры.
 //					Обязательно должен быть ключ "СсылкаНаОбъект", содержащий ссылку на объект 
 //					"Справочник.Контрагент" или "Справочник.Сотрудники", для которого необходимо получить данные.
 //                 Во втором случае ссылка на контрагента будет получена из сотрудника.
 //					Если требуется получение периодических реквизитов на дату, то должен быть
 //					ключ "Период", с требуемой датой получения периодических значений.
 //	 УдалятьСсылкуНаОбъект - Булево - После заполнения структуры удалить поле "СсылкаНаОбъект" и "Период",
 //					т.е. оставить только требуемые данные.
 //	Возможные ключи:
 // СсылкаНаОбъект - ссылка на объект.
 // Период - дата для получения периодических реквизитов.
 // ИНН
 //
 // Для физических лиц:
 // НаименованиеПолное - наименование физического лица (совпадает с "Фамилия + Имя + Отчество")
 // Фамилия
 // Имя
 // Отчество
 // УдостоверениеЛичности - представление удостоверения личности.
 //
 // Для юридических лиц:
 // НаименованиеПолное - официальное наименование юридического лица.
 // КПП
 // КодОКПО
 // ОГРН
 // Бюджет
 // КодПоППП
 // КодПоРПБС
 //
Процедура ПолучитьДанныеКонтрагента(ТребуемыеДанные, УдалятьСсылкуНаОбъект = Ложь) Экспорт

	Если ТипЗнч(ТребуемыеДанные) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТребуемыеДанные.Свойство("СсылкаНаОбъект") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТребуемыеДанные.Свойство("Период") Тогда
		УсловиеПериода = "(&Период, ФизическоеЛицо = &ФизическоеЛицо)";
		ЕстьПериод = Истина;
	Иначе
		УсловиеПериода = "(, ФизическоеЛицо = &ФизическоеЛицо)";
		ЕстьПериод = Ложь;
	КонецЕсли;
	
	СсылкаНаОбъект = ТребуемыеДанные.СсылкаНаОбъект;
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Сотрудники") Тогда
		СсылкаНаОбъект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "Контрагент", Истина);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;   
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	Контрагенты.ВидКонтрагента КАК ВидКонтрагента
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка"); 
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВидКонтрагента = Выборка.ВидКонтрагента;
		ЮрФизЛицо = Выборка.ЮридическоеФизическоеЛицо;
	Иначе
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	Контрагенты.НаименованиеДП Как ВыдатьКому,
				   |	Контрагенты.НаименованиеРП Как ПолучитьОтКого";
	ТекстТаблиц =  "
				   |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты";
	
	Если ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		ТекстТаблиц =  ТекстТаблиц + "
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица";
		ВыборФИО=Ложь;
		ВыборДокумента=Ложь;
		Если ТребуемыеДанные.Свойство("ИНН") Тогда
			ТекстЗапроса = ТекстЗапроса + ",
				   |	ФизическиеЛица.ИНН Как ИНН";		
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("НаименованиеПолное") Тогда
			ТекстЗапроса = ТекстЗапроса + ",
				   |	ФизическиеЛица.Наименование Как НаименованиеПолное";		
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("НалоговыйНомер") Тогда
			ТекстЗапроса = ТекстЗапроса + ",
				   |	ФизическиеЛица.НалоговыйНомер Как НалоговыйНомер";		
		КонецЕсли;
		
		Если ТребуемыеДанные.Свойство("Фамилия") Тогда
			ТекстЗапроса = ТекстЗапроса + ",	   
		               |	ФИОФизическихЛицСрезПоследних.Фамилия";
			Если НЕ ВыборФИО Тогда
				ТекстТаблиц = ТекстТаблиц +"
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних" + УсловиеПериода + " КАК ФИОФизическихЛицСрезПоследних
		               |			ПО ФизическиеЛица.Ссылка = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо";
				ВыборФИО = Истина;  
				Запрос.УстановитьПараметр("ФизическоеЛицо", ЮрФизЛицо); 
			КонецЕсли;
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("Имя") Тогда
			ТекстЗапроса = ТекстЗапроса + ",	   
		               |	ФИОФизическихЛицСрезПоследних.Имя";
			Если НЕ ВыборФИО Тогда
				ТекстТаблиц = ТекстТаблиц +"
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних"+УсловиеПериода+" КАК ФИОФизическихЛицСрезПоследних
		               |			ПО ФизическиеЛица.Ссылка = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо";
				ВыборФИО = Истина; 
				Запрос.УстановитьПараметр("ФизическоеЛицо", ЮрФизЛицо);
			КонецЕсли;
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("Отчество") Тогда
			ТекстЗапроса = ТекстЗапроса + ",	   
		               |	ФИОФизическихЛицСрезПоследних.Отчество";
			Если НЕ ВыборФИО Тогда
				ТекстТаблиц = ТекстТаблиц +"
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних"+УсловиеПериода+" КАК ФИОФизическихЛицСрезПоследних
		               |			ПО ФизическиеЛица.Ссылка = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо";
				ВыборФИО = Истина; 
				Запрос.УстановитьПараметр("ФизическоеЛицо", ЮрФизЛицо);
			КонецЕсли;
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("УдостоверениеЛичности") Тогда
			ТекстЗапроса = ТекстЗапроса + ",	   
		               |	ДокументыФизическихЛицСрезПоследних.Представление Как УдостоверениеЛичности";
			Если НЕ ВыборДокумента Тогда
				ТекстТаблиц = ТекстТаблиц +"
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних"+УсловиеПериода+" КАК ДокументыФизическихЛицСрезПоследних
		               |			ПО ФизическиеЛица.Ссылка = ДокументыФизическихЛицСрезПоследних.Физлицо
		               |				И (ДокументыФизическихЛицСрезПоследних.ЯвляетсяДокументомУдостоверяющимЛичность)";
				ВыборДокумента = Истина; 
				Если НЕ ВыборФИО Тогда 
					Запрос.УстановитьПараметр("ФизическоеЛицо", ЮрФизЛицо);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ТекстТаблиц = ТекстТаблиц + "
	               |		ПО Контрагенты.ЮридическоеФизическоеЛицо = ФизическиеЛица.Ссылка";
	Иначе // ЮридическоеЛицо	
		ТекстТаблиц =  ТекстТаблиц + "
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица";
		Если ТребуемыеДанные.Свойство("ИНН") Тогда
			ТекстЗапроса = ТекстЗапроса + ",
				   |	ЮридическиеЛица.ИНН Как ИНН";		
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("КПП") Тогда
			ТекстЗапроса = ТекстЗапроса + ",
				   |	ЮридическиеЛица.КПП Как КПП";		
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("КодОКПО") Тогда
			ТекстЗапроса = ТекстЗапроса + ",
				   |	ЮридическиеЛица.КодОКПО Как КодОКПО";		
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("ОГРН") Тогда
			ТекстЗапроса = ТекстЗапроса + ",
				   |	ЮридическиеЛица.ОГРН Как ОГРН";		
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("Бюджет") Тогда
			ТекстЗапроса = ТекстЗапроса + ",
				   |	ЮридическиеЛица.Бюджет Как Бюджет";		
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("КодПоППП") Тогда
			ТекстЗапроса = ТекстЗапроса + ",
				   |	ЮридическиеЛица.КодПоППП Как КодПоППП";		
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("КодПоРПБС") Тогда
			ТекстЗапроса = ТекстЗапроса + ",
				   |	ЮридическиеЛица.КодПоРПБС Как КодПоРПБС";		
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("НаименованиеПолное") Тогда
			ТекстЗапроса = ТекстЗапроса + ",
				   |	ЮридическиеЛица.НаименованиеПолное Как НаименованиеПолное";		
		КонецЕсли;
		Если ТребуемыеДанные.Свойство("НалоговыйНомер") Тогда
			ТекстЗапроса = ТекстЗапроса + ",
				   |	ЮридическиеЛица.НалоговыйНомер Как НалоговыйНомер";		
		КонецЕсли;
		ТекстТаблиц = ТекстТаблиц + "
		           |		ПО Контрагенты.ЮридическоеФизическоеЛицо = ЮридическиеЛица.Ссылка";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса 
					+ ТекстТаблиц + "
	               |ГДЕ
	               |	Контрагенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект); 
	Если ЕстьПериод Тогда
		Запрос.УстановитьПараметр("Период", ТребуемыеДанные.Период); 
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Для Каждого ТекСвойство из ТребуемыеДанные Цикл
		Если ТекСвойство.Ключ<>"СсылкаНаОбъект" И
			ТекСвойство.Ключ<>"Период" Тогда
			Если Результат.Колонки.Найти(ТекСвойство.Ключ)<>Неопределено Тогда
				
				ТребуемыеДанные[ТекСвойство.Ключ] = Выборка[ТекСвойство.Ключ];
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ТребуемыеДанные.Свойство("КПП") Тогда
		Период = Неопределено;
		ТребуемыеДанные.Свойство("Период", Период);
		ТребуемыеДанные.Вставить("КПП", ПолучитьКПП(ТребуемыеДанные.СсылкаНаОбъект, Период));
	КонецЕсли;
	
	Если УдалятьСсылкуНаОбъект Тогда
		ТребуемыеДанные.Удалить("СсылкаНаОбъект");
		Если ТребуемыеДанные.Свойство("Период") Тогда
			ТребуемыеДанные.Удалить("Период");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
 
// Функция формирует представление вида Фамилия И.О. или И.О.Фамилия контрагента.
//
// Параметры
//  Контрагент  - СправочникСсылка.Контрагенты или СправочникСсылка.Сотрудники - контрагент, для которого надо получить
//                 представление.
//  ИОвНачале  - Булево - Если ИСТИНА, тогда инициалы ставятся перед фамилией. Если ЛОЖЬ - то после.
//  ДатаПолучения  - Дата - Дата получения периодических реквизитов, если не задана, текущая дата.
//
Функция ФамилияИО(Контрагент, ИОвНачале = Ложь, Знач ДатаПолучения = Неопределено) Экспорт
	
	Если ДатаПолучения = Неопределено Тогда
		ДатаПолучения = ТекущаяДатаСеанса();
	КонецЕсли;

	Возврат Корреспонденты.ФИОПоОбъекту(Контрагент, ИОвНачале, ДатаПолучения);
	
КонецФункции // ФамилияИО()

// Функция получает контактную информацию из Контрагент.ЮридическоеФизическоеЛицо
// Параметры:
//	Контрагент - СправочникСсылка.Контрагенты
//	ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации - указывается вид контактной информации для контрагента (не для Физ Лица)
//
// Возвращаемое значение:
//	Строка
//
Функция ПолучитьКонтактнуюИнформацию(Контрагент, ВидКонтактнойИнформации) Экспорт
	ЮрФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ЮридическоеФизическоеЛицо");
	Если НЕ ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		Возврат "";
	КонецЕсли;
	
	СоответствиеКИ = Новый Соответствие;                                
	СоответствиеКИ.Вставить(Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты,	Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица); 
	СоответствиеКИ.Вставить(Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагенты,	Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
	СоответствиеКИ.Вставить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагенты,			Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица);
	СоответствиеКИ.Вставить(Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты,				Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	СоответствиеКИ.Вставить(Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияКонтрагенты,	Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	
	ТребуемыйВидКИ = ?(ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.ЮридическиеЛица"),
						ВидКонтактнойИнформации,
						СоответствиеКИ[ВидКонтактнойИнформации]);
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЮрФизЛицо, ТребуемыйВидКИ);
	
КонецФункции

// Определяет, является ли контрагент резидентом государства-члена таможенного союза (ЕАЭС)
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - контрагент, для которого определяется резидентство в ЕАЭС
//
// Возвращаемое значение:
//  Булево - Истина, если переданный контрагент является резидентом ЕАЭС,
//  Ложь - в противном случае.
Функция КонтрагентРезидентТаможенногоСоюза(Контрагент) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Контрагенты.ЮридическоеФизическоеЛицо.СтранаРегистрации, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаРегистрации
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтранаРегистрацииКонтрагента = Выборка.СтранаРегистрации;
	Иначе
		СтранаРегистрацииКонтрагента = Справочники.СтраныМира.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтранаРегистрацииКонтрагента) Тогда
		Возврат ОбщегоНазначенияБГУ.ГосударствоЧленТаможенногоСоюза(СтранаРегистрацииКонтрагента);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ЭтоФизическоеЛицо(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИменаРеквизитовКонтрагента = "ИНН, ЮридическоеФизическоеЛицо";
	РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, ИменаРеквизитовКонтрагента);
	
	Возврат РеквизитыКонтрагента.ЮридическоеФизическоеЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
		И НЕ ЗначениеЗаполнено(РеквизитыКонтрагента.ИНН);

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Анализирует пары ссылок справочника на возможность замены одной на другую 
// во всех местах использования с прикладной точки зрения.
// Проверки на запрет замены групп и ссылок разных типов производятся автоматически при начале замены.
//
// Параметры:
//     ПарыЗамен - Соответствие - Ключ - что будет заменено, значение - на что будет заменено.
//     Параметры - Структура    - Набор флагов, описывающих действие с заменяемыми элементами.
//                                Содержит необязательные реквизиты:
//                     * СпособУдаления - Строка, может принимать значения:
//                         "Непосредственно" - Если после замены ссылка нигде не используется,
//                                             то она будет удалена непосредственно
//                         "Пометка"         - Если после замены ссылка не используется, то
//                                             она будет помечена на удаление.
//                         Любые другие значения говорят о том, что заменяемая ссылка не будет изменена.
//
// Возвращаемое значение:
//     Соответствие - Ключ - исходная ссылка, значение - строка - описание, почему замена недопустима.
//                    Если все замены допустимы, то возвращается пустое соответствие;
//
Функция ВозможностьЗаменыЭлементов(Знач ПарыЗамен, Знач Параметры = Неопределено) Экспорт
	
	СпособУдаления = "";
	Если Параметры <> Неопределено Тогда
		Параметры.Свойство("СпособУдаления", СпособУдаления);
	КонецЕсли;
			
	Результат = Новый Соответствие;
	
	Для Каждого КлючЗначение Из ПарыЗамен Цикл
		ТекущаяСсылка = КлючЗначение.Ключ;
		ЦелеваяСсылка = КлючЗначение.Значение;
		
		Если ТекущаяСсылка = ЦелеваяСсылка Тогда
			Продолжить;
			
		Иначе	
			// Разрешаем заменять только при совпадении типа 
			// т.к. тип влияет на формирование бухгалтерских записей.
			ТекущийТип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСсылка, "ТипКонтрагента");
			ЦелевойТип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦелеваяСсылка, "ТипКонтрагента");
			
			Если НЕ ТекущийТип = ЦелевойТип Тогда
				Ошибка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'замена возможна только для элементов совпадающих типов.
				|У элементов ""%1"" и ""%2"" различается тип ""%3"" - ""%4"".'"),
				ТекущаяСсылка, ЦелеваяСсылка, ТекущийТип, ЦелевойТип);
				Результат.Вставить(ТекущаяСсылка, Ошибка);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗащитаПерсональныхДанных") Тогда
		МодульЗащитаПерсональныхДанных = ОбщегоНазначения.ОбщийМодуль("ЗащитаПерсональныхДанных");
		МодульЗащитаПерсональныхДанных.ДобавитьКомандуПечатиСогласияНаОбработкуПерсональныхДанных(КомандыПечати);
	КонецЕсли;
	
КонецПроцедуры

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВидКонтрагента; ВидКонтрагента");
	Результат.Добавить("ЮридическоеФизическоеЛицо");
	Результат.Добавить("ИНН");
	Результат.Добавить("КПП");
	Результат.Добавить("Наименование");

	
	Возврат Результат;  
	
КонецФункции

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Родитель");
	Возврат МассивРеквизитов;
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПроверкаВозможностиИзмененияВидаКонтрагента", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	Если Данные.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") 
		И ЗначениеЗаполнено(Данные.НаименованиеСокращенное) Тогда
		Представление = Данные.НаименованиеСокращенное;
		Если СтрНайти(Данные.НаименованиеСокращенное, Данные.Наименование) = 0  Тогда
			Представление = Представление + " (" + Данные.Наименование + ")";
		КонецЕсли;	
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Наименование");
	Поля.Добавить("НаименованиеСокращенное");
	Поля.Добавить("ВидКонтрагента");
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПроверкаВозможностиИзмененияВидаКонтрагента(Ссылка) Экспорт
	
	Критерии = Новый Структура("ЕстьСсылки, МестаИспользования", Ложь, "");
	
	Критерии.ЕстьСсылки = ОбщегоНазначения.ЕстьСсылкиНаОбъект(Ссылка);
	
	Если Критерии.ЕстьСсылки Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	&ВыпускиАкций КАК МестаИспользования
			|ИЗ
			|	Справочник.ВыпускиАкций КАК ВыпускиАкций
			|ГДЕ
			|	ВыпускиАкций.Владелец = &Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	&Дети
			|ИЗ
			|	Справочник.Дети КАК Дети
			|ГДЕ
			|	Дети.Контрагент = &Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	&НалогиИПлатежиОрганизации
			|ИЗ
			|	Справочник.НалогиИПлатежиОрганизации КАК НалогиИПлатежиОрганизации
			|ГДЕ
			|	НалогиИПлатежиОрганизации.Контрагент = &Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	&ОбъектыФинансовыхВложений
			|ИЗ
			|	Справочник.ОбъектыФинансовыхВложений КАК ОбъектыФинансовыхВложений
			|ГДЕ
			|	ОбъектыФинансовыхВложений.Контрагент = &Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	&Организации
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Распорядитель = &Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	&Сотрудники
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	Сотрудники.Контрагент = &Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	&Студенты
			|ИЗ
			|	Справочник.Студенты КАК Студенты
			|ГДЕ
			|	Студенты.Контрагент = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ВыпускиАкций", НСтр("ru = 'Выпуски акций'"));
		Запрос.УстановитьПараметр("Дети", НСтр("ru = 'Дети'"));
		Запрос.УстановитьПараметр("НалогиИПлатежиОрганизации", НСтр("ru = 'Налоги и платежи организации'"));
		Запрос.УстановитьПараметр("ОбъектыФинансовыхВложений", НСтр("ru = 'Объекты финансовых вложений'"));
		Запрос.УстановитьПараметр("Организации", НСтр("ru = 'Организации'"));
		Запрос.УстановитьПараметр("Сотрудники", НСтр("ru = 'Сотрудники'"));
		Запрос.УстановитьПараметр("Студенты", НСтр("ru = 'Учащиеся'"));
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Не РезультатЗапроса.Пустой() Тогда
			СписокМест = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("МестаИспользования");
			Разделитель = ", ";
			Критерии.МестаИспользования = СтрСоединить(СписокМест, Разделитель);
		КонецЕсли;

	КонецЕсли;

	Возврат Критерии;	
	
КонецФункции	

#КонецОбласти

#КонецЕсли

