#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.ПлатежнаяВедомость.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

    // Движения по денежным средствам.
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "НаличныеДенежныеСредства")

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеКомпенсацииОбразование") Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	НачислениеКомпенсацииОбразование.Организация КАК Организация,
		|	НачислениеКомпенсацииОбразование.Факультет КАК ПодразделениеКор,
		|	НачислениеКомпенсацииОбразование.ИФО КАК ИФО,
		|	НачислениеКомпенсацииОбразование.ПериодНачисления КАК ПериодНачисления,
		|	НачислениеКомпенсацииОбразование.ПериодНачисленияСтрокой КАК ПериодНачисленияСтрокой,
		|	НачислениеКомпенсацииОбразование.СуммаДокумента КАК СуммаДокумента,
		|	1 КАК СотрудникКонтрагент
		|ИЗ
		|	Документ.НачислениеКомпенсацииОбразование КАК НачислениеКомпенсацииОбразование
		|ГДЕ
		|	НачислениеКомпенсацииОбразование.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачислениеКомпенсацииОбразованиеКомпенсация.Контрагент КАК Контрагент,
		|	НачислениеКомпенсацииОбразованиеКомпенсация.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА НачислениеКомпенсацииОбразованиеКомпенсация.Ссылка.АналитикаЗатратВКаждойСтроке
		|			ТОГДА НачислениеКомпенсацииОбразованиеКомпенсация.КФО
		|		ИНАЧЕ НачислениеКомпенсацииОбразованиеКомпенсация.Ссылка.КФО
		|	КОНЕЦ КАК КФО,
		|	ВЫБОР
		|		КОГДА НачислениеКомпенсацииОбразованиеКомпенсация.Ссылка.АналитикаЗатратВКаждойСтроке
		|			ТОГДА НачислениеКомпенсацииОбразованиеКомпенсация.КПС
		|		ИНАЧЕ НачислениеКомпенсацииОбразованиеКомпенсация.Ссылка.КПС
		|	КОНЕЦ КАК КПС,
		|	ВЫБОР
		|		КОГДА НачислениеКомпенсацииОбразованиеКомпенсация.Ссылка.АналитикаЗатратВКаждойСтроке
		|			ТОГДА НачислениеКомпенсацииОбразованиеКомпенсация.КЭК
		|		ИНАЧЕ НачислениеКомпенсацииОбразованиеКомпенсация.Ссылка.КЭК
		|	КОНЕЦ КАК КЭК,
		|	ВЫБОР
		|		КОГДА НачислениеКомпенсацииОбразованиеКомпенсация.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
		|			ТОГДА НачислениеКомпенсацииОбразованиеКомпенсация.Ссылка.Основание
		|		ИНАЧЕ НачислениеКомпенсацииОбразованиеКомпенсация.ДоговорКонтрагента
		|	КОНЕЦ КАК ОснованиеПринятияОбязательства
		|ИЗ
		|	Документ.НачислениеКомпенсацииОбразование.Компенсация КАК НачислениеКомпенсацииОбразованиеКомпенсация
		|ГДЕ
		|	НачислениеКомпенсацииОбразованиеКомпенсация.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НачислениеКомпенсацииОбразованиеКомпенсация.НомерСтроки");
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Результат = Запрос.ВыполнитьПакет();
		
		Шапка = Результат[0].Выбрать();
		Таблица = Результат[1].Выгрузить();
		
		Таблица.Колонки.Добавить("ИдентификаторСтроки");
		
		Если Шапка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Шапка);
		Иначе
			Возврат;
		КонецЕсли;
		
		Счет = БухгалтерскийУчет.СчетПоКоду("201.34", Дата, Организация);
		КорСчет = БухгалтерскийУчет.СчетПоКоду("302.00", Дата, Организация);
		
		Для Каждого Стр ИЗ Таблица Цикл
			
			Стр.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			
			СтрСписки = Состав.Добавить(); 
			СтрРасш = РасшифровкаПлатежа.Добавить();

			ЗаполнитьЗначенияСвойств(СтрСписки, Стр);
			ЗаполнитьЗначенияСвойств(СтрРасш, Стр);
			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КассаОрганизации.ПроверитьКорректностьЗаполненияТаблицыКассовогоДокумента(ЭтотОбъект,, Отказ);
	
	Если НЕ СотрудникКонтрагент = 0 Тогда
		Инд = ПроверяемыеРеквизиты.Найти("Состав.Сотрудник");
		Если НЕ Инд  = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Инд);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Перем ИсходныйРежимЗаписи;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект); 
	
	ДополнительныеСвойства.Свойство("ИсходныйРежимЗаписи", ИсходныйРежимЗаписи);
	
	ТекущиеПрава = КассаОрганизации.ПраваНаТекущийКассовыйДокумент(Ссылка);
	Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Отказ = НЕ ТекущиеПрава.РазрешитьЗапись;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Отказ = НЕ ТекущиеПрава.РазрешитьОтменуПроведения;
	ИначеЕсли Проведен Тогда
		Если ИсходныйРежимЗаписи <> Неопределено 
			И ИсходныйРежимЗаписи = РежимЗаписиДокумента.Запись Тогда
			Отказ = НЕ ТекущиеПрава.РазрешитьЗапись;
		Иначе
			Отказ = Не ТекущиеПрава.РазрешитьПроведение;
		КонецЕсли;
	Иначе
		Отказ = НЕ ТекущиеПрава.РазрешитьПроведение;
	КонецЕсли;
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru='Недостаточно прав для выполнения операции'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	// Очистка табличной части РасшифровкаПлатежа от строк, не имеющих "родителя" в ТЧ Состав
	// Синхронизация общих реквизитов табличных частей Состав и РасшифровкаПлатежа
	ПоляСостава = Новый Массив;
	Для Каждого РеквизитСостава Из ЭтотОбъект.Метаданные().ТабличныеЧасти.Состав.Реквизиты Цикл
		Если НЕ РеквизитСостава.Имя = "Сумма"
			И НЕ РеквизитСостава.Имя = "Сотрудник" Тогда
			ПоляСостава.Добавить(РеквизитСостава.Имя);
		КонецЕсли;
	КонецЦикла;
	СписокСвойств = СтрСоединить(ПоляСостава, ", ");
	
	ЛишниеСтроки = Новый Массив;
	Для Каждого СтрокаРасшифровки Из ЭтотОбъект.РасшифровкаПлатежа Цикл
		СтрокаСостава = ЭтотОбъект.Состав.Найти(СтрокаРасшифровки.ИдентификаторСтроки, "ИдентификаторСтроки");
		Если СтрокаСостава = Неопределено Тогда
			ЛишниеСтроки.Добавить(СтрокаРасшифровки);
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаСостава, СписокСвойств);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЛишняяСтрока Из ЛишниеСтроки Цикл
		ЭтотОбъект.РасшифровкаПлатежа.Удалить(ЛишняяСтрока);
	КонецЦикла;
	
	Сотрудники = Новый Массив;
	Для Каждого СтрокаСотрудник Из Состав Цикл
		Сотрудники.Добавить(Справочники.Контрагенты.ФамилияИО(СтрокаСотрудник.Контрагент));
	КонецЦикла;
	
	КраткийСоставДокумента = СтрСоединить(Сотрудники, ", ");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
