#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)  
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОКомандировании")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОКомпенсацииРасходовДляКрайнегоСевера") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъема")  
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо") Тогда
		Если НЕ ДанныеЗаполнения.Проведен Тогда 
			СтандартнаяОбработка = Ложь; 
			ТекстОшибки = НСтр("ru='Ввести Отчет о расходах подотчетного лица можно только на основании проведенного документа. Ввод невозможен!'");			
			ВызватьИсключение ТекстОшибки;   
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОКомандировании") Тогда 
		ЗаполнитьПоРешениюОКомандировании(ДанныеЗаполнения); 		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОКомпенсацииРасходовДляКрайнегоСевера") Тогда
		ЗаполнитьПоРешениюОКомпенсацииРасходов(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъема") Тогда
		ЗаполнитьПоЗаявкеОбоснованиюНаЗакупкуМалогоОбъема(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо") Тогда		
		ЗаполнитьПоЗаявкеОбоснованиюНаЗакупкуМалогоОбъемаЧерезПодотчетноеЛицо(ДанныеЗаполнения); 		
	КонецЕсли;
	
	ЗаменитьКПСсУчетомПереносаОстатковПоКПС();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	// Проверка на непревышение суммы и количества относительно заявки-обоснования закупки малого объема
	Если ЗначениеЗаполнено(ДокументОснование)
		И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъема") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги.Количество) КАК Количество,
		|	СУММА(ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги.Сумма) КАК Сумма,
		|	СУММА(ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги.Сумма) / СУММА(ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги.Количество) КАК Цена
		|ИЗ
		|	Документ.ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги КАК ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги
		|ГДЕ
		|	ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги.Номенклатура";
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		ДанныеЗаявки = Запрос.Выполнить().Выгрузить();
		
		ДанныеОтчета = ТоварыРаботыУслуги.Выгрузить(, "Номенклатура, Количество, СуммаПринято");
		ДанныеОтчета.Свернуть("Номенклатура", "Количество, СуммаПринято");
		ДанныеОтчета.Колонки.Добавить("Цена");
		Для Каждого СтрокаОтчета Из ДанныеОтчета Цикл
			СтрокаОтчета.Цена = ?(СтрокаОтчета.Количество > 0, СтрокаОтчета.СуммаПринято / СтрокаОтчета.Количество, 0)
		КонецЦикла;
		
		Для Каждого СтрокаОтчета Из ДанныеОтчета Цикл
			СтрокаЗаявки = ДанныеЗаявки.Найти(СтрокаОтчета.Номенклатура, "Номенклатура");
			Если СтрокаЗаявки = Неопределено Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В исходной Заявке-обосновании отсутствует номенклатура ""%1""'"),
					СтрокаОтчета.Номенклатура);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Прервать;
			КонецЕсли;
			Если СтрокаЗаявки.Количество < СтрокаОтчета.Количество Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В исходной Заявке-обосновании указана номенклатура ""%1"" в количестве %2, а в Отчете - %3'"),
					СтрокаОтчета.Номенклатура, СтрокаЗаявки.Количество, СтрокаОтчета.Количество);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Прервать;
			КонецЕсли;
			Если СтрокаЗаявки.Сумма < СтрокаОтчета.СуммаПринято Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В исходной Заявке-обосновании указана номенклатура ""%1"" на сумму %2, а в Отчете - %3'"),
					СтрокаОтчета.Номенклатура, СтрокаЗаявки.Сумма, СтрокаОтчета.СуммаПринято);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Прервать;
			КонецЕсли;
			Если Окр(СтрокаЗаявки.Цена, 2) < Окр(СтрокаОтчета.Цена, 2) Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В исходной Заявке-обосновании указана номенклатура ""%1"" ценой %2, а в Отчете - %3'"),
					СтрокаОтчета.Номенклатура, Окр(СтрокаЗаявки.Цена, 2), Окр(СтрокаОтчета.Цена, 2));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Проверка на непревышение суммы и количества относительно заявки-обоснования закупки малого объема через подотчетное лицо
	Если ЗначениеЗаполнено(ДокументОснование)
		И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги.ОКПД КАК ОКПД,
		|	СУММА(ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги.Количество) КАК Количество,
		|	СУММА(ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо.ТоварыРаботыУслуги КАК ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги
		|ГДЕ
		|	ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаОбоснованиеЗакупкиМалогоОбъемаТоварыРаботыУслуги.ОКПД";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		ДанныеЗаявки = Запрос.Выполнить().Выгрузить();
		
		ПриходныеДокументы = Новый Массив;  
		ПоступлениеУслуг   = Новый Массив;
		
		Для Каждого Стр Из ТоварыРаботыУслуги Цикл
			Если Стр.ПоДокументу И ЗначениеЗаполнено(Стр.ПриходныйДокумент) Тогда  
				Если ТипЗнч(Стр.ПриходныйДокумент) = Тип("ДокументСсылка.ПоступлениеУслугРабот") Тогда    
					ПоступлениеУслуг.Добавить(Стр.ПриходныйДокумент);
				Иначе	
					ПриходныеДокументы.Добавить(Стр.ПриходныйДокумент);     
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 ССЫЛКА Справочник.ВидыДенежныхДокументов
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК Справочник.ВидыДенежныхДокументов).ОКП
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 ССЫЛКА Справочник.ВидыДенежныхДокументов
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК Справочник.ВидыДенежныхДокументов).ОКП
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 ССЫЛКА Справочник.ВидыДенежныхДокументов
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК Справочник.ВидыДенежныхДокументов).ОКП
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 ССЫЛКА Справочник.ДенежныеДокументы
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК Справочник.ДенежныеДокументы).Владелец.ОКП
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 ССЫЛКА Справочник.ДенежныеДокументы
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК Справочник.ДенежныеДокументы).Владелец.ОКП
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 ССЫЛКА Справочник.ДенежныеДокументы
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК Справочник.ДенежныеДокументы).Владелец.ОКП
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 ССЫЛКА Справочник.Номенклатура
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК Справочник.Номенклатура).ОКП
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 ССЫЛКА Справочник.Номенклатура
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК Справочник.Номенклатура).ОКП
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 ССЫЛКА Справочник.Номенклатура
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК Справочник.Номенклатура).ОКП
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 ССЫЛКА Справочник.ОсновныеСредства
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства).ОКП
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 ССЫЛКА Справочник.ОсновныеСредства
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК Справочник.ОсновныеСредства).ОКП
		|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 ССЫЛКА Справочник.ОсновныеСредства
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК Справочник.ОсновныеСредства).ОКП
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторПродукции.ПустаяСсылка)
		|	КОНЕЦ КАК ОКПД,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт КАК Количество,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма КАК СуммаПринято
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
		|			,
		|			,
		|			СчетКт В (&Счет208)
		|				И Регистратор В (&ПриходныеДокументы)
		|				И (СубконтоДт1 ССЫЛКА Справочник.ВидыДенежныхДокументов
		|					ИЛИ СубконтоДт2 ССЫЛКА Справочник.ВидыДенежныхДокументов
		|					ИЛИ СубконтоДт3 ССЫЛКА Справочник.ВидыДенежныхДокументов
		|					ИЛИ СубконтоДт1 ССЫЛКА Справочник.ДенежныеДокументы
		|					ИЛИ СубконтоДт2 ССЫЛКА Справочник.ДенежныеДокументы
		|					ИЛИ СубконтоДт3 ССЫЛКА Справочник.ДенежныеДокументы
		|					ИЛИ СубконтоДт1 ССЫЛКА Справочник.Номенклатура
		|					ИЛИ СубконтоДт2 ССЫЛКА Справочник.Номенклатура
		|					ИЛИ СубконтоДт3 ССЫЛКА Справочник.Номенклатура
		|					ИЛИ СубконтоДт1 ССЫЛКА Справочник.ОсновныеСредства
		|					ИЛИ СубконтоДт2 ССЫЛКА Справочник.ОсновныеСредства
		|					ИЛИ СубконтоДт3 ССЫЛКА Справочник.ОсновныеСредства),
		|			,
		|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ 
		|	ПоступлениеУслугРабот.Номенклатура.ОКП КАК ОКПД,     
		|   ПоступлениеУслугРабот.Количество       КАК Количество,
		|   ПоступлениеУслугРабот.Сумма            КАК СуммаПринято   
		|ИЗ
		|   Документ.ПоступлениеУслугРабот.УслугиИРаботы КАК ПоступлениеУслугРабот
		|ГДЕ
		|   ПоступлениеУслугРабот.Ссылка В (&ПоступлениеУслуг)
		|";
		
		Запрос.УстановитьПараметр("Счет208",            БухгалтерскийУчет.СписокСчетов("208.00"));
		Запрос.УстановитьПараметр("ПриходныеДокументы", ПриходныеДокументы);
		Запрос.УстановитьПараметр("ПоступлениеУслуг",   ПоступлениеУслуг);
		
		ДанныеПриходныхДокументов = Запрос.Выполнить().Выгрузить();
		
		ДанныеОтчета = ТоварыРаботыУслуги.Выгрузить(Новый Структура("ПоДокументу", Ложь), "ОКПД, Количество, СуммаПринято");
		
		Для Каждого ДанныеПриходногоДокумента Из ДанныеПриходныхДокументов Цикл
			ЗаполнитьЗначенияСвойств(ДанныеОтчета.Добавить(), ДанныеПриходногоДокумента);
		КонецЦикла;
		
		ДанныеОтчета.Свернуть("ОКПД", "Количество, СуммаПринято");
		
		Для Каждого СтрокаОтчета Из ДанныеОтчета Цикл
			Если Не ЗначениеЗаполнено(СтрокаОтчета.ОКПД) Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В Отчете указан объект закупки с незаполненным ОКПД'"),
					СтрокаОтчета.ОКПД);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Прервать;
			КонецЕсли;
			СтрокаЗаявки = ДанныеЗаявки.Найти(СтрокаОтчета.ОКПД, "ОКПД");
			Если СтрокаЗаявки = Неопределено Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В исходной Заявке-обосновании отсутствует объект закупки с ОКПД ""%1""'"),
					СтрокаОтчета.ОКПД);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Прервать;
			КонецЕсли;
			Если СтрокаЗаявки.Количество < СтрокаОтчета.Количество Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В исходной Заявке-обосновании указан объект закупки с ОКПД ""%1"" в количестве %2, а в Отчете - %3'"),
					СтрокаОтчета.ОКПД, СтрокаЗаявки.Количество, СтрокаОтчета.Количество);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Прервать;
			КонецЕсли;
			Если СтрокаЗаявки.Сумма < СтрокаОтчета.СуммаПринято Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В исходной Заявке-обосновании указан объект закупки с ОКПД ""%1"" на сумму %2, а в Отчете - %3'"),
					СтрокаОтчета.ОКПД, СтрокаЗаявки.Сумма, СтрокаОтчета.СуммаПринято);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	СуммаДокумента = 0;
	
	МассивТЧ = Новый Массив;
	МассивТЧ.Добавить("Суточные");
	МассивТЧ.Добавить("Проезд");
	МассивТЧ.Добавить("Проживание");
	МассивТЧ.Добавить("ПрочиеРасходы");
	МассивТЧ.Добавить("ТоварыРаботыУслуги");
	
	Для Каждого ТЧ Из МассивТЧ Цикл
		Для Каждого СтрокаТЧ Из ЭтотОбъект[ТЧ] Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "СпособОбеспечения")
				И СтрокаТЧ.СпособОбеспечения <> ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.АвансПодотчетномуЛицу")
				И СтрокаТЧ.СпособОбеспечения <> ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.ВыдачаДенежныхДокументов")
				И СтрокаТЧ.СпособОбеспечения <> ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.ВозмещениеПоФакту") Тогда
				Продолжить;
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаТЧ, "Валюта")
				И ЗначениеЗаполнено(СтрокаТЧ.Валюта)
				И СтрокаТЧ.Валюта <> БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
				СуммаДокумента = СуммаДокумента
					+ Документы.ОтчетОРасходахПодотчетногоЛица.СуммаВРублевомЭквиваленте(СтрокаТЧ.СуммаПринято, СтрокаТЧ.Валюта, КурсыВалют);
				Иначе
					СуммаДокумента = СуммаДокумента + СтрокаТЧ.СуммаПринято;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ДатаУтверждения) И ДатаУтверждения < НачалоДня(Дата) Тогда
		ТекстСообщения = НСтр("ru='Дата утверждения не может быть меньше даты документа.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ДатаУтверждения", "Объект", Отказ);
	КонецЕсли;
	
	НеПроверяемыеРеквизиты = Новый Массив;
	
	Если ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо")
		ИЛИ НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		НеПроверяемыеРеквизиты.Добавить("ТоварыРаботыУслуги.ОКПД");
	КонецЕсли;
	
	НеПроверяемыеРеквизиты.Добавить("Проезд.ДатаСФ");
	НеПроверяемыеРеквизиты.Добавить("Проезд.НомерСФ");
	НеПроверяемыеРеквизиты.Добавить("Проезд.Контрагент");
	НеПроверяемыеРеквизиты.Добавить("Проезд.СчетФактура");
	
	НеПроверяемыеРеквизиты.Добавить("Проживание.ДатаСФ");
	НеПроверяемыеРеквизиты.Добавить("Проживание.НомерСФ");
	НеПроверяемыеРеквизиты.Добавить("Проживание.Контрагент");
	НеПроверяемыеРеквизиты.Добавить("Проживание.СчетФактура");
	
	НеПроверяемыеРеквизиты.Добавить("ПрочиеРасходы.ДатаСФ");
	НеПроверяемыеРеквизиты.Добавить("ПрочиеРасходы.НомерСФ");
	НеПроверяемыеРеквизиты.Добавить("ПрочиеРасходы.Контрагент");
	НеПроверяемыеРеквизиты.Добавить("ПрочиеРасходы.СчетФактура");
	
	НеПроверяемыеРеквизиты.Добавить("ТоварыРаботыУслуги.ДатаСФ");
	НеПроверяемыеРеквизиты.Добавить("ТоварыРаботыУслуги.НомерСФ");
	НеПроверяемыеРеквизиты.Добавить("ТоварыРаботыУслуги.Контрагент");
	НеПроверяемыеРеквизиты.Добавить("ТоварыРаботыУслуги.СчетФактура");
	
	Документы.ОтчетОРасходахПодотчетногоЛица.ПроверитьЗаполненностьКолонокНДС(ЭтотОбъект, Отказ);
	
	Для Каждого СтрокаТЧ Из ТоварыРаботыУслуги Цикл
		Если НЕ СтрокаТЧ.ПоДокументу Тогда
			Продолжить;
		КонецЕсли;
		НеПроверяемыеРеквизиты.Добавить("ТоварыРаботыУслуги.Номенклатура");
		НеПроверяемыеРеквизиты.Добавить("ТоварыРаботыУслуги.ОКПД");
		НеПроверяемыеРеквизиты.Добавить("ТоварыРаботыУслуги.ЕдиницаИзмерения");
		Прервать;
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

Процедура ЗаполнитьПоРешениюОКомандировании(РешениеСсылка)
		
	Для Каждого ТабличнаяЧасть Из Метаданные().ТабличныеЧасти Цикл
		ЭтотОбъект[ТабличнаяЧасть.Имя].Очистить();
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РешениеОКомандировании.Ссылка КАК ДокументОснование,
	|	РешениеОКомандировании.Организация КАК Организация,
	|	РешениеОКомандировании.Подразделение КАК Подразделение,
	|	РешениеОКомандировании.Сотрудник КАК Сотрудник,
	|	РешениеОКомандировании.РуководительПодразделения КАК РуководительПодразделения,
	|	РешениеОКомандировании.ИФО КАК ИФО,
	|	РешениеОКомандировании.Должность КАК Должность,
	|	РешениеОКомандировании.ОсобыйСтатус КАК ОсобыйСтатус,
	|	РешениеОКомандировании.СодержаниеЗадания КАК СодержаниеЗадания,
	|	РешениеОКомандировании.ОснованиеПринятияОбязательства КАК ОснованиеПринятияОбязательства,
	|	РешениеОКомандировании.РазделЛицевогоСчета КАК РазделЛицевогоСчета,
	|	РешениеОКомандировании.КомандировкаЗаГраницу КАК КомандировкаЗаГраницу,
	|	РешениеОКомандировании.МестоИСроки.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Страна КАК Страна,
	|		ПунктНазначения КАК ПунктНазначения,
	|		ОрганизацияНазначения КАК ОрганизацияНазначения,
	|		ДатаНачала КАК ДатаНачала,
	|		ДатаОкончания КАК ДатаОкончания,
	|		Норматив КАК Норматив,
	|		Валюта КАК Валюта
	|	) КАК МестоИСроки,
	|	РешениеОКомандировании.Суточные.(
	|		НаименованиеРасхода КАК НаименованиеРасхода,
	|		Страна КАК Страна,
	|		Территория КАК Территория,
	|		ДополнительноеУсловие КАК ДополнительноеУсловие,
	|		КоличествоДней КАК КоличествоДней,
	|		ВЫБОР
	|			КОГДА РешениеОКомандировании.Суточные.КоличествоДней = 0
	|				ТОГДА РешениеОКомандировании.Суточные.Сумма
	|			ИНАЧЕ РешениеОКомандировании.Суточные.Сумма / РешениеОКомандировании.Суточные.КоличествоДней
	|		КОНЕЦ КАК Цена,
	|		Сумма КАК СуммаПлан,
	|		Сумма КАК СуммаФакт,
	|		0 КАК СуммаПринято,
	|		Валюта КАК Валюта,
	|		СпособОбеспечения КАК СпособОбеспечения,
	|		КФО КАК КФО,
	|		КПС КАК КПС,
	|		КЭК КАК КЭК,
	|		КодЦели КАК КодЦели,
	|		КодМероприятия КАК КодМероприятия,
	|		ДопКлассификация КАК ДопКлассификация,
	|		ИСТИНА КАК ЗапретИзменения
	|	) КАК Суточные,
	|	РешениеОКомандировании.УсловияПроезда.(
	|		НаименованиеРасхода КАК НаименованиеРасхода,
	|		ВидТранспорта КАК ВидТранспорта,
	|		ДатаОтправления КАК ДатаОтправления,
	|		ВЫБОР 
	|            КОГДА ТарифТудаОбратно
	|                  ТОГДА ДатаПрибытияОбратно
	|            ИНАЧЕ ДатаПрибытия 
	|       КОНЕЦ КАК ДатаПрибытия,
	|		ДатаПересеченияГраницы КАК ДатаПересеченияГраницы,
	|		КатегорияФактическая КАК КатегорияПоНормативу,
	|		КатегорияФактическая КАК КатегорияФактическая,
	|		СпособОбеспечения КАК СпособОбеспечения,
	|		1 КАК Количество,
	|		Сумма КАК Цена,
	|		Сумма КАК СуммаПлан,
	|		Сумма КАК СуммаФакт,
	|		0 КАК СуммаПринято,
	|		Валюта КАК Валюта,
	|		КФО КАК КФО,
	|		КПС КАК КПС,
	|		КЭК КАК КЭК,
	|		КодЦели КАК КодЦели,
	|		КодМероприятия КАК КодМероприятия,
	|		ДопКлассификация КАК ДопКлассификация,
	|		ИСТИНА КАК ЗапретИзменения
	|	) КАК УсловияПроезда,
	|	РешениеОКомандировании.УсловияПроживания.(
	|		НаименованиеРасхода КАК НаименованиеРасхода,
	|		Страна КАК Страна,
	|		ТерриторияСНадбавками КАК ТерриторияСНадбавками,
	|		УсловиеПроживания КАК УсловиеПроживания,
	|		ДатаЗаезда КАК ДатаЗаезда,
	|		ДатаВыезда КАК ДатаВыезда,
	|		КатегорияФактическая КАК КатегорияПоНормативу,
	|		КатегорияФактическая КАК КатегорияФактическая,
	|		СпособОбеспечения КАК СпособОбеспечения,
	|		КоличествоДней КАК КоличествоДней,
	|		Сумма КАК Цена,
	|		Сумма КАК СуммаПлан,
	|		Сумма КАК СуммаФакт,
	|		0 КАК СуммаПринято,
	|		Валюта КАК Валюта,
	|		КФО КАК КФО,
	|		КПС КАК КПС,
	|		КЭК КАК КЭК,
	|		КодЦели КАК КодЦели,
	|		КодМероприятия КАК КодМероприятия,
	|		ДопКлассификация КАК ДопКлассификация,
	|		ИСТИНА КАК ЗапретИзменения
	|	) КАК УсловияПроживания,
	|	РешениеОКомандировании.ПрочиеРасходы.(
	|		НаименованиеРасхода КАК НаименованиеРасхода,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК СуммаПлан,
	|		Сумма КАК СуммаФакт,
	|		0 КАК СуммаПринято,
	|		СпособОбеспечения КАК СпособОбеспечения,
	|		Валюта КАК Валюта,
	|		КФО КАК КФО,
	|		КПС КАК КПС,
	|		КЭК КАК КЭК,
	|		КодЦели КАК КодЦели,
	|		КодМероприятия КАК КодМероприятия,
	|		ДопКлассификация КАК ДопКлассификация,
	|		ИСТИНА КАК ЗапретИзменения
	|	) КАК ПрочиеРасходы,   
	|	РешениеОКомандировании.СпособыВыдачи.(
	|		Валюта КАК Валюта,
	|		СпособВыдачи КАК СпособВыдачи,
	|	) КАК СпособыВыдачи,
	|	РешениеОКомандировании.КурсыВалют.(
	|		Валюта КАК Валюта,
	|		Курс КАК Курс,
	|		Кратность КАК Кратность
	|	) КАК КурсыВалют
	|ИЗ
	|	Документ.РешениеОКомандировании КАК РешениеОКомандировании
	|ГДЕ
	|	РешениеОКомандировании.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", РешениеСсылка);
	
	СпособыОбеспеченияАванс = Новый Соответствие;
	СпособыОбеспеченияАванс.Вставить(
		ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.АвансПодотчетномуЛицу"), Истина);
	СпособыОбеспеченияАванс.Вставить(
		ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.ВыдачаДенежныхДокументов"), Истина);
	СпособыОбеспеченияАванс.Вставить(
		ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.ВозмещениеПоФакту"), Истина);
	
	Валюты = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка); 
		ДанныеСотрудника = Документы.ОтчетОРасходахПодотчетногоЛица.ДанныеСотрудника(ЭтотОбъект.Сотрудник, ЭтотОбъект.Дата);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеСотрудника);
		
		СтрокиМестоИСроки = Выборка.МестоИСроки.Выгрузить();
		СтрокиМестоИСроки.Сортировать("ДатаНачала, НомерСтроки");
		
		// поиск крайних дат в условиях проезда
		Если СтрокиМестоИСроки.Количество() = 0 Тогда
			ДеньВыезда = Дата(2999,1,1);
			ДеньПриезда = Дата(1,1,1);
		Иначе
			ДеньВыезда = СтрокиМестоИСроки[0].ДатаНачала;
			ДеньПриезда = СтрокиМестоИСроки[СтрокиМестоИСроки.Количество() - 1].ДатаОкончания;
		КонецЕсли;
		
		ВыборкаУсловияПроезда = Выборка.УсловияПроезда.Выбрать();
		Пока ВыборкаУсловияПроезда.Следующий() Цикл
			ДеньВыезда = Мин(ДеньВыезда, ВыборкаУсловияПроезда.ДатаОтправления);
			ДеньПриезда = Макс(ДеньПриезда, ВыборкаУсловияПроезда.ДатаПрибытия);
		КонецЦикла;
		
		Для Каждого СтрокаМестоИСроки Из СтрокиМестоИСроки Цикл
			
			НоваяСтрока = ОтчетОВыполненнойРаботе.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМестоИСроки);
			
			Если СтрокиМестоИСроки.Индекс(СтрокаМестоИСроки) = 0 Тогда
				НоваяСтрока.ДеньВыезда = ДеньВыезда;
			КонецЕсли;
			
			Если СтрокиМестоИСроки.Индекс(СтрокаМестоИСроки) = СтрокиМестоИСроки.Количество() - 1 Тогда
				НоваяСтрока.ДеньПриезда = ДеньПриезда;
				НоваяСтрока.Продолжительность = (ДеньПриезда - ДеньВыезда)/86400 + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		ТаблицаКурсыВалют = Выборка.КурсыВалют.Выгрузить();
		
		ВыборкаРасходы = Выборка.Суточные.Выбрать();
		Пока ВыборкаРасходы.Следующий() Цикл
			Если СпособыОбеспеченияАванс[ВыборкаРасходы.СпособОбеспечения] = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Суточные.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРасходы);
			Если НЕ Выборка.КомандировкаЗаГраницу Тогда
				НоваяСтрока.ДеньВыезда = ДеньВыезда;
				НоваяСтрока.ДеньПриезда = ДеньПриезда;
			КонецЕсли;
			НоваяСтрока.СуммаПланВРублевомЭквиваленте = Документы.РешениеОКомандировании.СуммаВРублевомЭквиваленте(
				НоваяСтрока.СуммаПлан, НоваяСтрока.Валюта, ТаблицаКурсыВалют);
			Валюты.Вставить(ВыборкаРасходы.Валюта);
		КонецЦикла;
		
		ВыборкаРасходы = Выборка.УсловияПроезда.Выбрать();
		Пока ВыборкаРасходы.Следующий() Цикл
			Если СпособыОбеспеченияАванс[ВыборкаРасходы.СпособОбеспечения] = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Проезд.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРасходы);
			НоваяСтрока.СуммаПланВРублевомЭквиваленте = Документы.РешениеОКомандировании.СуммаВРублевомЭквиваленте(
				НоваяСтрока.СуммаПлан, НоваяСтрока.Валюта, ТаблицаКурсыВалют);
			Валюты.Вставить(ВыборкаРасходы.Валюта);
		КонецЦикла;
		
		ВыборкаРасходы = Выборка.УсловияПроживания.Выбрать();
		Пока ВыборкаРасходы.Следующий() Цикл
			Если СпособыОбеспеченияАванс[ВыборкаРасходы.СпособОбеспечения] = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Проживание.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРасходы);
			НоваяСтрока.СуммаПланВРублевомЭквиваленте = Документы.РешениеОКомандировании.СуммаВРублевомЭквиваленте(
				НоваяСтрока.СуммаПлан, НоваяСтрока.Валюта, ТаблицаКурсыВалют);
			Валюты.Вставить(ВыборкаРасходы.Валюта);
		КонецЦикла;
		
		ВыборкаРасходы = Выборка.ПрочиеРасходы.Выбрать();
		Пока ВыборкаРасходы.Следующий() Цикл
			Если СпособыОбеспеченияАванс[ВыборкаРасходы.СпособОбеспечения] = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ПрочиеРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРасходы);
			НоваяСтрока.СуммаПланВРублевомЭквиваленте = Документы.РешениеОКомандировании.СуммаВРублевомЭквиваленте(
				НоваяСтрока.СуммаПлан, НоваяСтрока.Валюта, ТаблицаКурсыВалют);
			Валюты.Вставить(ВыборкаРасходы.Валюта);
		КонецЦикла;
		
		ТаблицаОбязательств = Документы.РешениеОКомандировании.ТаблицаОбязательствПоСвязаннымРешениям(
			Выборка.ДокументОснование);
		Для Каждого СтрокаОбязательства Из ТаблицаОбязательств Цикл
			НоваяСтрока = ДенежныеОбязательства.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОбязательства);
			НоваяСтрока.СуммаПоОснованию = СтрокаОбязательства.Сумма;
			НоваяСтрока.СуммаБОПоОснованию = СтрокаОбязательства.СуммаБО;
			НоваяСтрока.ФинансовыйГод = Год(ТекущаяДатаСеанса());
		КонецЦикла;
		
	КонецЕсли;     
	
	ВыборкаСпособыВыдачи = Выборка.СпособыВыдачи.Выбрать();
		Пока ВыборкаСпособыВыдачи.Следующий() Цикл
		
			НоваяСтрока = СпособыВыдачи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСпособыВыдачи);
		КонецЦикла;
	
	Для Каждого Валюта Из Валюты Цикл
		
		// В таблицу "Курсы валют" не нужно добавлять валюту рег. учета
		Если НЕ ЗначениеЗаполнено(Валюта.Ключ)
			ИЛИ Валюта.Ключ = ОбщегоНазначенияБГУПовтИсп.ПолучитьВалютуРегламентированногоУчета() Тогда
			Продолжить;
		КонецЕсли;
		
		Строка = КурсыВалют.Добавить();
		Строка.Валюта = Валюта.Ключ;
		КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта.Ключ, Дата);
		Строка.Курс = КурсКратность.Курс;
		Строка.Кратность = КурсКратность.Кратность;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоРешениюОКомпенсацииРасходов(РешениеСсылка)
	
	Для Каждого ТабличнаяЧасть Из ЭтотОбъект.Метаданные().ТабличныеЧасти Цикл
		ЭтотОбъект[ТабличнаяЧасть.Имя].Очистить();
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РешениеОКомпенсацииРасходовДляКрайнегоСевера.Ссылка КАК ДокументОснование,
	|	РешениеОКомпенсацииРасходовДляКрайнегоСевера.Организация КАК Организация,
	|	РешениеОКомпенсацииРасходовДляКрайнегоСевера.Подразделение КАК Подразделение,
	|	РешениеОКомпенсацииРасходовДляКрайнегоСевера.Сотрудник КАК Сотрудник,
	|	РешениеОКомпенсацииРасходовДляКрайнегоСевера.ИФО КАК ИФО,
	|	РешениеОКомпенсацииРасходовДляКрайнегоСевера.Должность КАК Должность,
	|	РешениеОКомпенсацииРасходовДляКрайнегоСевера.ОснованиеПринятияОбязательства КАК ОснованиеПринятияОбязательства,
	|	РешениеОКомпенсацииРасходовДляКрайнегоСевера.РазделЛицевогоСчета КАК РазделЛицевогоСчета,
	|	РешениеОКомпенсацииРасходовДляКрайнегоСевера.УсловияПроезда.(
	|		НаименованиеРасхода КАК НаименованиеРасхода,
	|		ВидТранспорта КАК ВидТранспорта,
	|		ДатаОтправления КАК ДатаОтправления,
	|		ДатаПрибытия КАК ДатаПрибытия,
	|		КатегорияПоНормативу КАК КатегорияПоНормативу,
	|		КатегорияПоНормативу КАК КатегорияФактическая,
	|		СпособОбеспечения КАК СпособОбеспечения,
	|		1 КАК Количество,
	|		Сумма КАК Цена,
	|		Сумма КАК СуммаПлан,
	|		Сумма КАК СуммаФакт,
	|		0 КАК СуммаПринято,
	|		КФО КАК КФО,
	|		КПС КАК КПС,
	|		КЭК КАК КЭК,
	|		КодЦели КАК КодЦели,
	|		КодМероприятия КАК КодМероприятия,
	|		ДопКлассификация КАК ДопКлассификация,
	|		ИСТИНА КАК ЗапретИзменения
	|	) КАК УсловияПроезда,
	|	РешениеОКомпенсацииРасходовДляКрайнегоСевера.ПрочиеРасходы.(
	|		НаименованиеРасхода КАК НаименованиеРасхода,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК СуммаПлан,
	|		Сумма КАК СуммаФакт,
	|		0 КАК СуммаПринято,
	|		СпособОбеспечения КАК СпособОбеспечения,
	|		КФО КАК КФО,
	|		КПС КАК КПС,
	|		КЭК КАК КЭК,
	|		КодЦели КАК КодЦели,
	|		КодМероприятия КАК КодМероприятия,
	|		ДопКлассификация КАК ДопКлассификация,
	|		ИСТИНА КАК ЗапретИзменения
	|	) КАК ПрочиеРасходы
	|ИЗ
	|	Документ.РешениеОКомпенсацииРасходовДляКрайнегоСевера КАК РешениеОКомпенсацииРасходовДляКрайнегоСевера
	|ГДЕ
	|	РешениеОКомпенсацииРасходовДляКрайнегоСевера.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", РешениеСсылка);
	
	СпособыОбеспеченияАванс = Новый Соответствие;
	СпособыОбеспеченияАванс.Вставить(
		ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.АвансПодотчетномуЛицу"), Истина);
	СпособыОбеспеченияАванс.Вставить(
		ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.ВыдачаДенежныхДокументов"), Истина);
	СпособыОбеспеченияАванс.Вставить(
		ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.ВозмещениеПоФакту"), Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка); 
		ДанныеСотрудника = Документы.ОтчетОРасходахПодотчетногоЛица.ДанныеСотрудника(ЭтотОбъект.Сотрудник, ЭтотОбъект.Дата);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеСотрудника);
		
		ВыборкаРасходы = Выборка.УсловияПроезда.Выбрать();
		Пока ВыборкаРасходы.Следующий() Цикл
			Если СпособыОбеспеченияАванс.Получить(ВыборкаРасходы.СпособОбеспечения) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Проезд.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРасходы);
			НоваяСтрока.СуммаПланВРублевомЭквиваленте = ВыборкаРасходы.СуммаПлан;
		КонецЦикла;
		
		ВыборкаРасходы = Выборка.ПрочиеРасходы.Выбрать();
		Пока ВыборкаРасходы.Следующий() Цикл
			Если СпособыОбеспеченияАванс.Получить(ВыборкаРасходы.СпособОбеспечения) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ПрочиеРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРасходы);
			НоваяСтрока.СуммаПланВРублевомЭквиваленте = ВыборкаРасходы.СуммаПлан;
		КонецЦикла;
		
		ТаблицаОбязательств = Документы.РешениеОКомпенсацииРасходовДляКрайнегоСевера.ТаблицаОбязательствПоРешениюОКомпенсации(
			Выборка.ДокументОснование);
		Для Каждого СтрокаОбязательства Из ТаблицаОбязательств Цикл
			НоваяСтрока = ДенежныеОбязательства.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОбязательства);
			НоваяСтрока.СуммаПоОснованию = СтрокаОбязательства.Сумма;
			НоваяСтрока.СуммаБОПоОснованию = СтрокаОбязательства.СуммаБО;
			НоваяСтрока.ФинансовыйГод = Год(ТекущаяДатаСеанса());
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаявкеОбоснованиюНаЗакупкуМалогоОбъема(ЗаявкаСсылка)
	
	Для Каждого ТабличнаяЧасть Из ЭтотОбъект.Метаданные().ТабличныеЧасти Цикл
		ЭтотОбъект[ТабличнаяЧасть.Имя].Очистить();
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Ссылка КАК ДокументОснование,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Организация КАК Организация,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ИФО КАК ИФО,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Подразделение КАК Подразделение,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ПодотчетноеЛицо КАК Сотрудник,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Руководитель КАК Руководитель,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.РуководительПодразделения КАК РуководительПодразделения,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.РазделЛицевогоСчета КАК РазделЛицевогоСчета,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Договор КАК ОснованиеПринятияОбязательства,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		ОКПД КАК ОКПД,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК СуммаПлан,
	|		Сумма КАК СуммаФакт,
	|		КФО КАК КФО,
	|		КПС КАК КПС,
	|		КЭК КАК КЭК,
	|		КодЦели КАК КодЦели,
	|		КодМероприятия КАК КодМероприятия,
	|		ДопКлассификация КАК ДопКлассификация,
	|		ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|		СпособОбеспечения КАК СпособОбеспечения,
	|		Подразделение КАК Подразделение,
	|	) КАК ТоварыРаботыУслуги
	|ИЗ
	|	Документ.ЗаявкаОбоснованиеЗакупкиМалогоОбъема КАК ЗаявкаОбоснованиеЗакупкиМалогоОбъема
	|ГДЕ
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
		ТребуемыеДанные = Новый Структура("СсылкаНаОбъект, Должность", Выборка.Сотрудник);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ТребуемыеДанные, Истина);
		Должность = ТребуемыеДанные.Должность;
		
		ВыборкаРасходы = Выборка.ТоварыРаботыУслуги.Выбрать();
		Пока ВыборкаРасходы.Следующий() Цикл
			НоваяСтрока = ТоварыРаботыУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРасходы);
			Если НЕ ЗначениеЗаполнено(ВыборкаРасходы.СпособОбеспечения) Тогда
				НоваяСтрока.СпособОбеспечения = ПредопределенноеЗначение("Перечисление.СпособыОбеспеченияКомандировки.АвансПодотчетномуЛицу");
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаОбязательств = Документы.ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТаблицаДенежныхОбязательствПоЗаявке(
			Выборка.ДокументОснование);
		Для Каждого СтрокаОбязательства Из ТаблицаОбязательств Цикл
			НоваяСтрока = ДенежныеОбязательства.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОбязательства);
			НоваяСтрока.СуммаПоОснованию = СтрокаОбязательства.Сумма;
			НоваяСтрока.СуммаБОПоОснованию = СтрокаОбязательства.СуммаБО;
			НоваяСтрока.ФинансовыйГод = Год(ТекущаяДатаСеанса());
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаявкеОбоснованиюНаЗакупкуМалогоОбъемаЧерезПодотчетноеЛицо(ЗаявкаСсылка)
	
	Для Каждого ТабличнаяЧасть Из ЭтотОбъект.Метаданные().ТабличныеЧасти Цикл
		ЭтотОбъект[ТабличнаяЧасть.Имя].Очистить();
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Ссылка КАК ДокументОснование,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Организация КАК Организация,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ИФО КАК ИФО,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Подразделение КАК Подразделение,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ПодотчетноеЛицо КАК Сотрудник,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Руководитель КАК Руководитель,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.РуководительПодразделения КАК РуководительПодразделения,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.РазделЛицевогоСчета КАК РазделЛицевогоСчета,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ОснованиеПринятияОбязательства КАК ОснованиеПринятияОбязательства,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.НазначениеАванса КАК НазначениеАванса,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ОКПД КАК ОКПД,
	|		Номенклатура КАК Номенклатура,
	|		Наименование КАК НаименованиеПлан,
	|		ИндивидуальнаяХарактеристика КАК ИндивидуальнаяХарактеристика,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Количество КАК Количество,
	|		ВЫБОР
	|			КОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.Количество > 0
	|				ТОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.Сумма / ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.Количество
	|			ИНАЧЕ ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.Сумма
	|		КОНЕЦ КАК Цена,
	|		Сумма КАК СуммаПлан,
	|		Сумма КАК СуммаФакт,
	|		КФО КАК КФО,
	|		КПС КАК КПС,
	|		КЭК КАК КЭК,
	|		КодЦели КАК КодЦели,
	|		КодМероприятия КАК КодМероприятия,
	|		ДопКлассификация КАК ДопКлассификация,
	|		ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|		ВЫБОР
	|			КОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.Ссылка.СпособВыдачиДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.СпособыВыдачиДенежныхСредствПодотчетномуЛицу.ДенежныеДокументы)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыОбеспеченияКомандировки.ВыдачаДенежныхДокументов)
	|			ИНАЧЕ ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.СпособОбеспечения
	|		КОНЕЦ КАК СпособОбеспечения,
	|		Подразделение КАК Подразделение
	|	) КАК ТоварыРаботыУслуги
	|ИЗ
	|	Документ.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо КАК ЗаявкаОбоснованиеЗакупкиМалогоОбъема
	|ГДЕ
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
		ТребуемыеДанные = Новый Структура("СсылкаНаОбъект, Должность", Выборка.Сотрудник);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ТребуемыеДанные, Истина);
		Должность = ТребуемыеДанные.Должность;
		
		ВыборкаРасходы = Выборка.ТоварыРаботыУслуги.Выбрать();
		Пока ВыборкаРасходы.Следующий() Цикл
			НоваяСтрока = ТоварыРаботыУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРасходы);
			Если НЕ ПустаяСтрока(ВыборкаРасходы.ИндивидуальнаяХарактеристика) Тогда
				НоваяСтрока.НаименованиеПлан = ВыборкаРасходы.НаименованиеПлан
					+ " " + ВыборкаРасходы.ИндивидуальнаяХарактеристика;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаОбязательств = Документы.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо.ТаблицаДенежныхОбязательствПоЗаявке(
			Выборка.ДокументОснование);
		Для Каждого СтрокаОбязательства Из ТаблицаОбязательств Цикл
			НоваяСтрока = ДенежныеОбязательства.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОбязательства);
			НоваяСтрока.СуммаПоОснованию = СтрокаОбязательства.Сумма;
			НоваяСтрока.СуммаБОПоОснованию = СтрокаОбязательства.СуммаБО;
			НоваяСтрока.ФинансовыйГод = Год(ТекущаяДатаСеанса());
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаменитьКПСсУчетомПереносаОстатковПоКПС()
	
	ДатаДокумента = ?(ЗначениеЗаполнено(ДатаУтверждения), ДатаУтверждения,
					?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
	
	ТабличныеЧастиДляЗаменыКПС = Новый Массив;
	ТабличныеЧастиДляЗаменыКПС.Добавить(Суточные);
	ТабличныеЧастиДляЗаменыКПС.Добавить(Проезд);
	ТабличныеЧастиДляЗаменыКПС.Добавить(Проживание);
	ТабличныеЧастиДляЗаменыКПС.Добавить(ПрочиеРасходы);
	ТабличныеЧастиДляЗаменыКПС.Добавить(ТоварыРаботыУслуги);
	ТабличныеЧастиДляЗаменыКПС.Добавить(ДенежныеОбязательства);
	
	РегистрыСведений.СоответствиеКПСПриПереносеОстатков.ЗаменитьКПСвТаблицахСУчетомПереносаОстатковПоКПС(
		ДатаДокумента, ДенежныеОбязательства, , ТабличныеЧастиДляЗаменыКПС);
	
	ДенежныеОбязательства.Свернуть("КФО,КПС,КЭК,КодЦели,КодМероприятия,ДопКлассификация,ФинансовыйГод,Подразделение,РазделЛицевогоСчета",
		"СуммаПоОснованию,СуммаБОПоОснованию,СуммаПоОтчету");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли