#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Шаблон1 = НСтр("ru = 'Не заполнено значение начисления за услугу!'");
	Шаблон2 = НСтр("ru = 'Не заполнено значение начала начисления!'");
	Шаблон3 = НСтр("ru = 'Дата начала начисления %1 не может быть больше даты окончания начисления %2!'");
	
	Для Каждого Стр Из ЭтотОбъект Цикл
		// НачислениеСтудентамЗаПрочиеУслуги не заполнено
		Если Не ЗначениеЗаполнено(Стр.НачислениеСтудентамЗаПрочиеУслуги) Тогда
			ОбщегоНазначения.СообщитьПользователю(Шаблон1);
			Отказ = Истина;
		КонецЕсли;
		
		// НачалоНачисления не заполнено
		Если Не ЗначениеЗаполнено(Стр.НачалоНачисления) Тогда
			ОбщегоНазначения.СообщитьПользователю(Шаблон2);
			Отказ = Истина;
		КонецЕсли;
				
		// НачалоНачисления больше ОкончанияНачисления			   
		Если ЗначениеЗаполнено(Стр.ОкончаниеНачисления) И (Стр.НачалоНачисления > Стр.ОкончаниеНачисления) Тогда
			ОбщегоНазначения.СообщитьПользователю(
									СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
													Шаблон3, 
													Формат(Стр.НачалоНачисления, "ДЛФ=D"),
													Формат(Стр.ОкончаниеНачисления, "ДЛФ=D")));
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

