////////////////////////////////////////////////////////////////////////////////
// УЧЕТ НДС, ПРОЦЕДУРЫ И ФУНКЦИИ ПОВТОРНОГО ИСПОЛЬЗОВАНИЯ                     //
////////////////////////////////////////////////////////////////////////////////
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

//---
// Инструкции учета НДС
//---

Функция ИнструкцииУчета_ПолучитьОбщуюТаблицуНастроек() Экспорт
	
	ТипСтрока			= Новый ОписаниеТипов("Строка");
	ТипДата				= Новый ОписаниеТипов("Дата");
	ТипФискСтруктура	= Новый ОписаниеТипов("ФиксированнаяСтруктура");
	
	// Возвращаемая таблица
	ТЗ = Новый ТаблицаЗначений();
	ТЗ.Колонки.Добавить("Идентификатор",		ТипСтрока);
	ТЗ.Колонки.Добавить("Представление",		ТипСтрока);
	ТЗ.Колонки.Добавить("ДатаНачалаПрименения",	ТипДата);
	ТЗ.Колонки.Добавить("Начисление",			ТипФискСтруктура);
	ТЗ.Колонки.Добавить("Вычет",				ТипФискСтруктура);
	ТЗ.Колонки.Добавить("РасчетыПоНалогу",		ТипФискСтруктура);
	
	// Инструкция 157н
	ИнструкцииУчета_Добавить157н(ТЗ);
	
	// Инструкция 157н (приказ 89н)
	ИнструкцииУчета_Добавить89н(ТЗ);
	
	// Инструкция 157н (приказ 209н)
	ИнструкцииУчета_Добавить209н(ТЗ);
	
	ТЗ.Сортировать("ДатаНачалаПрименения");
	
	Возврат ТЗ;
	
КонецФункции

Функция ИнструкцииУчета_ПолучитьПустуюСтруктуруСтроки() Экспорт
	
	Результат = Новый Структура();
	
	ОбщаяТаблицаНастроек = УчетНДСПовтИсп.ИнструкцииУчета_ПолучитьОбщуюТаблицуНастроек();
	
	Для Каждого КолонкаТаблицы Из ОбщаяТаблицаНастроек.Колонки Цикл
		Результат.Вставить(КолонкаТаблицы.Имя);
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Процедура ИнструкцииУчета_Добавить157н(ТЗ)
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока["Идентификатор"]		= "157н"; // регистр важен
	НоваяСтрока["Представление"]		= "Инструкция 157н";
	НоваяСтрока["ДатаНачалаПрименения"]	= '00010101';
	
	// Начисление
	Начисление = Новый Структура();
	
	// Начисление - Налоговый агент
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("302.00");
	СчетНачислениеДтЕдинственный	= Ложь;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	НалоговыйАгент = Новый Структура();
	НалоговыйАгент.Вставить("СчетНачислениеДт",					СчетНачислениеДт);
	НалоговыйАгент.Вставить("СчетНачислениеДтЕдинственный",		СчетНачислениеДтЕдинственный);
	НалоговыйАгент.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("НалоговыйАгент", Новый ФиксированнаяСтруктура(НалоговыйАгент));
	
	// Начисление - Аванс полученный
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("210.Р1");
	СчетНачислениеДтЕдинственный	= Истина;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	АвансПолученный = Новый Структура();
	АвансПолученный.Вставить("СчетНачислениеДт",				СчетНачислениеДт);
	АвансПолученный.Вставить("СчетНачислениеДтЕдинственный",	СчетНачислениеДтЕдинственный);
	АвансПолученный.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("АвансПолученный", Новый ФиксированнаяСтруктура(АвансПолученный));
	
	// Начисление - СМР хозспособом
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("210.Р1");
	СчетНачислениеДтЕдинственный	= Истина;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	СМРХозяйственнымСпособом = Новый Структура();
	СМРХозяйственнымСпособом.Вставить("СчетНачислениеДт",				СчетНачислениеДт);
	СМРХозяйственнымСпособом.Вставить("СчетНачислениеДтЕдинственный",	СчетНачислениеДтЕдинственный);
	СМРХозяйственнымСпособом.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("СМРХозяйственнымСпособом", Новый ФиксированнаяСтруктура(СМРХозяйственнымСпособом));
	
	// Начисление - Прочее при КФО=1
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("401.20");
	СчетНачислениеДтЕдинственный	= Истина;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	ПрочееБюджет = Новый Структура();
	ПрочееБюджет.Вставить("СчетНачислениеДт",				СчетНачислениеДт);
	ПрочееБюджет.Вставить("СчетНачислениеДтЕдинственный",	СчетНачислениеДтЕдинственный);
	ПрочееБюджет.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("ПрочееБюджет", Новый ФиксированнаяСтруктура(ПрочееБюджет));
	
	// Начисление - Прочее
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("401.00");
	СчетНачислениеДтЕдинственный	= Ложь;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	Прочее = Новый Структура();
	Прочее.Вставить("СчетНачислениеДт",					СчетНачислениеДт);
	Прочее.Вставить("СчетНачислениеДтЕдинственный",		СчетНачислениеДтЕдинственный);
	Прочее.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("Прочее", Новый ФиксированнаяСтруктура(Прочее));
	
	// Вычет
	Вычет = Новый Структура();
	
	// Вычет - Аванс полученный
	СчетВычетКт								= БухгалтерскийУчет.СчетПоКоду("210.Р1");
	СчетВычетКтЕдинственный					= Истина;
	СчетВычетКтКРаспределениюПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.Р1");
	СчетВычетКтБезРаспределенияПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.Р1");
	ВидыПоказателяКПСВычетКт = Новый Массив();
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.Произвольный);
	АвансПолученный = Новый Структура();
	АвансПолученный.Вставить("СчетВычетКт",								СчетВычетКт);
	АвансПолученный.Вставить("СчетВычетКтЕдинственный",					СчетВычетКтЕдинственный);
	АвансПолученный.Вставить("СчетВычетКтКРаспределениюПоУмолчанию",	СчетВычетКтКРаспределениюПоУмолчанию);
	АвансПолученный.Вставить("СчетВычетКтБезРаспределенияПоУмолчанию",	СчетВычетКтБезРаспределенияПоУмолчанию);
	АвансПолученный.Вставить("ВидыПоказателяКПСВычетКт",				ВидыПоказателяКПСВычетКт);
	Вычет.Вставить("АвансПолученный", Новый ФиксированнаяСтруктура(АвансПолученный));
	
	// Вычет - Прочее
	СчетВычетКт								= БухгалтерскийУчет.СчетПоКоду("210.01");
	СчетВычетКтЕдинственный					= Ложь;
	СчетВычетКтКРаспределениюПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.Н1");
	СчетВычетКтБезРаспределенияПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.Р1");
	ВидыПоказателяКПСВычетКт = Новый Массив();
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.Произвольный);
	Прочее = Новый Структура();
	Прочее.Вставить("СчетВычетКт",								СчетВычетКт);
	Прочее.Вставить("СчетВычетКтЕдинственный",					СчетВычетКтЕдинственный);
	Прочее.Вставить("СчетВычетКтКРаспределениюПоУмолчанию",		СчетВычетКтКРаспределениюПоУмолчанию);
	Прочее.Вставить("СчетВычетКтБезРаспределенияПоУмолчанию",	СчетВычетКтБезРаспределенияПоУмолчанию);
	Прочее.Вставить("ВидыПоказателяКПСВычетКт",					ВидыПоказателяКПСВычетКт);
	Вычет.Вставить("Прочее", Новый ФиксированнаяСтруктура(Прочее));
	
	// Расчеты по налогу
	РасчетыПоНалогу = Новый Структура();
	
	Счет = БухгалтерскийУчет.СчетПоКоду("303.04");
	ВидыПоказателяКПС_НалоговыйАгент = Новый Массив();
	ВидыПоказателяКПС_НалоговыйАгент.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПС_НалоговыйАгент.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПС_Прочее = Новый Массив();
	ВидыПоказателяКПС_Прочее.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПС_Прочее.Добавить(Перечисления.ВидыКБК.Произвольный);
	РасчетыПоНалогу.Вставить("Счет",								Счет);
	РасчетыПоНалогу.Вставить("ВидыПоказателяКПС_НалоговыйАгент",	ВидыПоказателяКПС_НалоговыйАгент);
	РасчетыПоНалогу.Вставить("ВидыПоказателяКПС_Прочее",			ВидыПоказателяКПС_Прочее);
	
	НоваяСтрока["Начисление"]		= Новый ФиксированнаяСтруктура(Начисление);
	НоваяСтрока["Вычет"]			= Новый ФиксированнаяСтруктура(Вычет);
	НоваяСтрока["РасчетыПоНалогу"]	= Новый ФиксированнаяСтруктура(РасчетыПоНалогу);
	
КонецПроцедуры	
	
Процедура ИнструкцииУчета_Добавить89н(ТЗ)
	
	//---
	// Инструкция 157н (приказ 89н)
	//---
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока["Идентификатор"]		= "89н"; // регистр важен
	НоваяСтрока["Представление"]		= "Инструкция 157н (приказ 89н)";
	НоваяСтрока["ДатаНачалаПрименения"]	= '20150101';
	
	// Начисление
	Начисление = Новый Структура();
	
	// Начисление - Налоговый агент
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("302.00");
	СчетНачислениеДтЕдинственный	= Ложь;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	НалоговыйАгент = Новый Структура();
	НалоговыйАгент.Вставить("СчетНачислениеДт",					СчетНачислениеДт);
	НалоговыйАгент.Вставить("СчетНачислениеДтЕдинственный",		СчетНачислениеДтЕдинственный);
	НалоговыйАгент.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("НалоговыйАгент", Новый ФиксированнаяСтруктура(НалоговыйАгент));

	// Начисление - Аванс полученный
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("210.11");
	СчетНачислениеДтЕдинственный	= Истина;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	АвансПолученный = Новый Структура();
	АвансПолученный.Вставить("СчетНачислениеДт",				СчетНачислениеДт);
	АвансПолученный.Вставить("СчетНачислениеДтЕдинственный",	СчетНачислениеДтЕдинственный);
	АвансПолученный.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("АвансПолученный", Новый ФиксированнаяСтруктура(АвансПолученный));
	
	// Начисление - СМР хозспособом
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("210.Р2");
	СчетНачислениеДтЕдинственный	= Истина;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	СМРХозяйственнымСпособом = Новый Структура();
	СМРХозяйственнымСпособом.Вставить("СчетНачислениеДт",				СчетНачислениеДт);
	СМРХозяйственнымСпособом.Вставить("СчетНачислениеДтЕдинственный",	СчетНачислениеДтЕдинственный);
	СМРХозяйственнымСпособом.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("СМРХозяйственнымСпособом", Новый ФиксированнаяСтруктура(СМРХозяйственнымСпособом));
	
	// Начисление - Прочее при КФО=1
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("401.20");
	СчетНачислениеДтЕдинственный	= Истина;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	ПрочееБюджет = Новый Структура();
	ПрочееБюджет.Вставить("СчетНачислениеДт",				СчетНачислениеДт);
	ПрочееБюджет.Вставить("СчетНачислениеДтЕдинственный",	СчетНачислениеДтЕдинственный);
	ПрочееБюджет.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("ПрочееБюджет", Новый ФиксированнаяСтруктура(ПрочееБюджет));
	
	// Начисление - Прочее
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("401.00");
	СчетНачислениеДтЕдинственный	= Ложь;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	Прочее = Новый Структура();
	Прочее.Вставить("СчетНачислениеДт",					СчетНачислениеДт);
	Прочее.Вставить("СчетНачислениеДтЕдинственный",		СчетНачислениеДтЕдинственный);
	Прочее.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("Прочее", Новый ФиксированнаяСтруктура(Прочее));
	
	// Вычет
	Вычет = Новый Структура();
	
	// Вычет - Аванс полученный
	СчетВычетКт								= БухгалтерскийУчет.СчетПоКоду("210.11");
	СчетВычетКтЕдинственный					= Истина;
	СчетВычетКтКРаспределениюПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.11");
	СчетВычетКтБезРаспределенияПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.11");
	ВидыПоказателяКПСВычетКт = Новый Массив();
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.Произвольный);
	АвансПолученный = Новый Структура();
	АвансПолученный.Вставить("СчетВычетКт",								СчетВычетКт);
	АвансПолученный.Вставить("СчетВычетКтЕдинственный",					СчетВычетКтЕдинственный);
	АвансПолученный.Вставить("СчетВычетКтКРаспределениюПоУмолчанию",	СчетВычетКтКРаспределениюПоУмолчанию);
	АвансПолученный.Вставить("СчетВычетКтБезРаспределенияПоУмолчанию",	СчетВычетКтБезРаспределенияПоУмолчанию);
	АвансПолученный.Вставить("ВидыПоказателяКПСВычетКт",				ВидыПоказателяКПСВычетКт);
	Вычет.Вставить("АвансПолученный", Новый ФиксированнаяСтруктура(АвансПолученный));
	
	// Вычет - Прочее
	СчетВычетКт								= БухгалтерскийУчет.СчетПоКоду("210.12");
	СчетВычетКтЕдинственный					= Ложь;
	СчетВычетКтКРаспределениюПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.Н2");
	СчетВычетКтБезРаспределенияПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.Р2");
	ВидыПоказателяКПСВычетКт = Новый Массив();
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.Произвольный);
	Прочее = Новый Структура();
	Прочее.Вставить("СчетВычетКт",								СчетВычетКт);
	Прочее.Вставить("СчетВычетКтЕдинственный",					СчетВычетКтЕдинственный);
	Прочее.Вставить("СчетВычетКтКРаспределениюПоУмолчанию",		СчетВычетКтКРаспределениюПоУмолчанию);
	Прочее.Вставить("СчетВычетКтБезРаспределенияПоУмолчанию",	СчетВычетКтБезРаспределенияПоУмолчанию);
	Прочее.Вставить("ВидыПоказателяКПСВычетКт",					ВидыПоказателяКПСВычетКт);
	Вычет.Вставить("Прочее", Новый ФиксированнаяСтруктура(Прочее));
	
	// Расчеты по налогу
	РасчетыПоНалогу = Новый Структура();
	
	Счет = БухгалтерскийУчет.СчетПоКоду("303.04");
	ВидыПоказателяКПС_НалоговыйАгент = Новый Массив();
	ВидыПоказателяКПС_НалоговыйАгент.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПС_НалоговыйАгент.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПС_Прочее = Новый Массив();
	ВидыПоказателяКПС_Прочее.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПС_Прочее.Добавить(Перечисления.ВидыКБК.Произвольный);
	РасчетыПоНалогу.Вставить("Счет",								Счет);
	РасчетыПоНалогу.Вставить("ВидыПоказателяКПС_НалоговыйАгент",	ВидыПоказателяКПС_НалоговыйАгент);
	РасчетыПоНалогу.Вставить("ВидыПоказателяКПС_Прочее",			ВидыПоказателяКПС_Прочее);
	
	НоваяСтрока["Начисление"]		= Новый ФиксированнаяСтруктура(Начисление);
	НоваяСтрока["Вычет"]			= Новый ФиксированнаяСтруктура(Вычет);
	НоваяСтрока["РасчетыПоНалогу"]	= Новый ФиксированнаяСтруктура(РасчетыПоНалогу);
	
КонецПроцедуры	
	
Процедура ИнструкцииУчета_Добавить209н(ТЗ)
	
	//---
	// Инструкция 157н (приказ 209н)
	//---
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока["Идентификатор"]		= "209н"; // регистр важен
	НоваяСтрока["Представление"]		= "Инструкция 157н (приказ 209н)";
	НоваяСтрока["ДатаНачалаПрименения"]	= '20161215';
	
	// Начисление
	Начисление = Новый Структура();
	
	// Начисление - Налоговый агент
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("302.00");
	СчетНачислениеДтЕдинственный	= Ложь;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.АУИБУ);
	НалоговыйАгент = Новый Структура();
	НалоговыйАгент.Вставить("СчетНачислениеДт",					СчетНачислениеДт);
	НалоговыйАгент.Вставить("СчетНачислениеДтЕдинственный",		СчетНачислениеДтЕдинственный);
	НалоговыйАгент.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("НалоговыйАгент", Новый ФиксированнаяСтруктура(НалоговыйАгент));

	// Начисление - Аванс полученный
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("210.11");
	СчетНачислениеДтЕдинственный	= Истина;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.АУИБУ);
	АвансПолученный = Новый Структура();
	АвансПолученный.Вставить("СчетНачислениеДт",				СчетНачислениеДт);
	АвансПолученный.Вставить("СчетНачислениеДтЕдинственный",	СчетНачислениеДтЕдинственный);
	АвансПолученный.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("АвансПолученный", Новый ФиксированнаяСтруктура(АвансПолученный));
	
	// Начисление (восстановление) - Аванс выданный
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("210.13");
	СчетНачислениеДтЕдинственный	= Истина;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.АУИБУ);
	АвансВыданный = Новый Структура();
	АвансВыданный.Вставить("СчетНачислениеДт",				СчетНачислениеДт);
	АвансВыданный.Вставить("СчетНачислениеДтЕдинственный",	СчетНачислениеДтЕдинственный);
	АвансВыданный.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("АвансВыданный", Новый ФиксированнаяСтруктура(АвансВыданный));
	
	// Начисление - СМР хозспособом
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("210.Р2");
	СчетНачислениеДтЕдинственный	= Истина;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.АУИБУ);
	СМРХозяйственнымСпособом = Новый Структура();
	СМРХозяйственнымСпособом.Вставить("СчетНачислениеДт",				СчетНачислениеДт);
	СМРХозяйственнымСпособом.Вставить("СчетНачислениеДтЕдинственный",	СчетНачислениеДтЕдинственный);
	СМРХозяйственнымСпособом.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("СМРХозяйственнымСпособом", Новый ФиксированнаяСтруктура(СМРХозяйственнымСпособом));
	
	// Начисление - Прочее при КФО=1
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("401.20");
	СчетНачислениеДтЕдинственный	= Истина;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.АУИБУ);
	ПрочееБюджет = Новый Структура();
	ПрочееБюджет.Вставить("СчетНачислениеДт",				СчетНачислениеДт);
	ПрочееБюджет.Вставить("СчетНачислениеДтЕдинственный",	СчетНачислениеДтЕдинственный);
	ПрочееБюджет.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	ПрочееБюджет.Вставить("КЭКНачислениеДт",				БухгалтерскийУчетПовтИсп.КЭКПоКоду("291"));
	
	Начисление.Вставить("ПрочееБюджет", Новый ФиксированнаяСтруктура(ПрочееБюджет));
	
	// Начисление - Прочее
	СчетНачислениеДт				= БухгалтерскийУчет.СчетПоКоду("401.00");
	СчетНачислениеДтЕдинственный	= Ложь;
	ВидыПоказателяКПСНачислениеДт = Новый Массив();
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.АУИБУ);
	ВидыПоказателяКПСНачислениеДт.Добавить(Перечисления.ВидыКБК.КРБ);
	Прочее = Новый Структура();
	Прочее.Вставить("СчетНачислениеДт",					СчетНачислениеДт);
	Прочее.Вставить("СчетНачислениеДтЕдинственный",		СчетНачислениеДтЕдинственный);
	Прочее.Вставить("СчетНачислениеДтПоУмолчанию",		БухгалтерскийУчет.СчетПоКоду("401.10"));
	Прочее.Вставить("ВидыПоказателяКПСНачислениеДт",	ВидыПоказателяКПСНачислениеДт);
	Начисление.Вставить("Прочее", Новый ФиксированнаяСтруктура(Прочее));
	
	// Вычет
	Вычет = Новый Структура();
	
	// Вычет - Аванс полученный
	СчетВычетКт								= БухгалтерскийУчет.СчетПоКоду("210.11");
	СчетВычетКтЕдинственный					= Истина;
	СчетВычетКтКРаспределениюПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.11");
	СчетВычетКтБезРаспределенияПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.11");
	ВидыПоказателяКПСВычетКт = Новый Массив();
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.АУИБУ);
	АвансПолученный = Новый Структура();
	АвансПолученный.Вставить("СчетВычетКт",								СчетВычетКт);
	АвансПолученный.Вставить("СчетВычетКтЕдинственный",					СчетВычетКтЕдинственный);
	АвансПолученный.Вставить("СчетВычетКтКРаспределениюПоУмолчанию",	СчетВычетКтКРаспределениюПоУмолчанию);
	АвансПолученный.Вставить("СчетВычетКтБезРаспределенияПоУмолчанию",	СчетВычетКтБезРаспределенияПоУмолчанию);
	АвансПолученный.Вставить("ВидыПоказателяКПСВычетКт",				ВидыПоказателяКПСВычетКт);
	Вычет.Вставить("АвансПолученный", Новый ФиксированнаяСтруктура(АвансПолученный));
	
	// Вычет - Аванс выданный
	СчетВычетКт								= БухгалтерскийУчет.СчетПоКоду("210.13");
	СчетВычетКтЕдинственный					= Истина;
	СчетВычетКтКРаспределениюПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.13");
	СчетВычетКтБезРаспределенияПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.13");
	ВидыПоказателяКПСВычетКт = Новый Массив();
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.АУИБУ);
	АвансПолученный = Новый Структура();
	АвансПолученный.Вставить("СчетВычетКт",								СчетВычетКт);
	АвансПолученный.Вставить("СчетВычетКтЕдинственный",					СчетВычетКтЕдинственный);
	АвансПолученный.Вставить("СчетВычетКтКРаспределениюПоУмолчанию",	СчетВычетКтКРаспределениюПоУмолчанию);
	АвансПолученный.Вставить("СчетВычетКтБезРаспределенияПоУмолчанию",	СчетВычетКтБезРаспределенияПоУмолчанию);
	АвансПолученный.Вставить("ВидыПоказателяКПСВычетКт",				ВидыПоказателяКПСВычетКт);
	Вычет.Вставить("АвансВыданный", Новый ФиксированнаяСтруктура(АвансПолученный));
	
	// Вычет - Прочее
	СчетВычетКт								= БухгалтерскийУчет.СчетПоКоду("210.12");
	СчетВычетКтЕдинственный					= Ложь;
	СчетВычетКтКРаспределениюПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.Н2");
	СчетВычетКтБезРаспределенияПоУмолчанию	= БухгалтерскийУчет.СчетПоКоду("210.Р2");
	ВидыПоказателяКПСВычетКт = Новый Массив();
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПСВычетКт.Добавить(Перечисления.ВидыКБК.АУИБУ);
	Прочее = Новый Структура();
	Прочее.Вставить("СчетВычетКт",								СчетВычетКт);
	Прочее.Вставить("СчетВычетКтЕдинственный",					СчетВычетКтЕдинственный);
	Прочее.Вставить("СчетВычетКтКРаспределениюПоУмолчанию",		СчетВычетКтКРаспределениюПоУмолчанию);
	Прочее.Вставить("СчетВычетКтБезРаспределенияПоУмолчанию",	СчетВычетКтБезРаспределенияПоУмолчанию);
	Прочее.Вставить("ВидыПоказателяКПСВычетКт",					ВидыПоказателяКПСВычетКт);
	Вычет.Вставить("Прочее", Новый ФиксированнаяСтруктура(Прочее));
	
	// Расчеты по налогу
	РасчетыПоНалогу = Новый Структура();
	
	Счет = БухгалтерскийУчет.СчетПоКоду("303.04");
	ВидыПоказателяКПС_НалоговыйАгент = Новый Массив();
	ВидыПоказателяКПС_НалоговыйАгент.Добавить(Перечисления.ВидыКБК.КРБ);
	ВидыПоказателяКПС_НалоговыйАгент.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПС_НалоговыйАгент.Добавить(Перечисления.ВидыКБК.АУИБУ);
	ВидыПоказателяКПС_Прочее = Новый Массив();
	ВидыПоказателяКПС_Прочее.Добавить(Перечисления.ВидыКБК.КДБ);
	ВидыПоказателяКПС_Прочее.Добавить(Перечисления.ВидыКБК.Произвольный);
	ВидыПоказателяКПС_Прочее.Добавить(Перечисления.ВидыКБК.АУИБУ);
	РасчетыПоНалогу.Вставить("Счет",								Счет);
	РасчетыПоНалогу.Вставить("ВидыПоказателяКПС_НалоговыйАгент",	ВидыПоказателяКПС_НалоговыйАгент);
	РасчетыПоНалогу.Вставить("ВидыПоказателяКПС_Прочее",			ВидыПоказателяКПС_Прочее);
	
	НоваяСтрока["Начисление"]		= Новый ФиксированнаяСтруктура(Начисление);
	НоваяСтрока["Вычет"]			= Новый ФиксированнаяСтруктура(Вычет);
	НоваяСтрока["РасчетыПоНалогу"]	= Новый ФиксированнаяСтруктура(РасчетыПоНалогу);
	
КонецПроцедуры

//---
// Ставки

// Функция возвращает число 0, 5, 7, 10, 18 или 20 в зависимости от указанной ставки НДС.
Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт
	
	Возврат УчетНДСКлиентСервер.ЗначениеСтавкиНДС(СтавкаНДС);
	
КонецФункции // ПолучитьСтавкуНДС()

//Устарела. Не используется. Возвращает массив ставок НДС без ставки 0%.
Функция МассивСтавокНДСБез0() Экспорт
	МассивСтавок = Новый Массив;
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.БезНДС);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС10);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС10_110);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС18);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС18_118);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС20);
	МассивСтавок.Добавить(Перечисления.СтавкиНДС.НДС20_120);
	
	Возврат МассивСтавок;
КонецФункции	

// Устарела. Не используется.
// Возвращает множители для расчета суммы НДС (исходя из базы и ставки).
//
// Возврат:
//	Соответствие вида СтавкаНДС (ссылка) - Множители (соответствие),
//		где Множители - тоже соответствие вида СуммаВключаетНДС (булево) - Множитель (число)
//
//	Для получения конкретного множителя необходимо к результату этой функции применить код:
//		.Получить(СтавкаНДС).Получить(СуммаВключаетНДС);
//
// Пример использования
// --------------------
//	// Кэшируем все множители:
//	МножителиСтавокНДС = УчетНДСПовтИсп.ПолучитьМножителиВсехСтавокДляРасчетаСуммыНДС();
//	
//	// Вариант 1. Сумма включает НДС:
//	СуммаВключаетНДС = Истина;
//	// Вариант 2. Сумма не включает НДС:
//	СуммаВключаетНДС = Ложь;
//	
//	// Получаем множитель для текущих условий:
//	Множитель = МножителиСтавокНДС.Получить(СтавкаНДС).Получить(СуммаВключаетНДС);
//	
//	СуммаНДС = Сумма * Множитель;
Функция ПолучитьМножителиВсехСтавокДляРасчетаСуммыНДС() Экспорт
	
	Результат = Новый Соответствие();
	
	Множители = Новый Соответствие();
	Множители.Вставить(Ложь,	0);	// Сумма не включает НДС
	Множители.Вставить(Истина,	0);	// Сумма включает НДС
	Результат.Вставить(Перечисления.СтавкиНДС.БезНДС,			Множители);
	Результат.Вставить(Перечисления.СтавкиНДС.НДС0,				Множители);
	Результат.Вставить(Перечисления.СтавкиНДС.ПустаяСсылка(),	Множители);
	
	Множители = Новый Соответствие();
	Множители.Вставить(Ложь,	0.1);		// Сумма не включает НДС
	Множители.Вставить(Истина,	10/110);	// Сумма включает НДС
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10,		Множители);
	Результат.Вставить(Перечисления.СтавкиНДС.НДС10_110,	Множители);
	
	Множители = Новый Соответствие();
	Множители.Вставить(Ложь,	0.18);		// Сумма не включает НДС
	Множители.Вставить(Истина,	18/118);	// Сумма включает НДС
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18,		Множители);
	Результат.Вставить(Перечисления.СтавкиНДС.НДС18_118,	Множители);
	
	Множители = Новый Соответствие();
	Множители.Вставить(Ложь,	0.2);		// Сумма не включает НДС
	Множители.Вставить(Истина,	20/120);	// Сумма включает НДС
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20,		Множители);
	Результат.Вставить(Перечисления.СтавкиНДС.НДС20_120,	Множители);
	
	Множители = Новый Соответствие();
	Множители.Вставить(Ложь,	0.05);		// Сумма не включает НДС
	Множители.Вставить(Истина,	5/105);		// Сумма включает НДС
	Результат.Вставить(Перечисления.СтавкиНДС.НДС5,		Множители);
	Результат.Вставить(Перечисления.СтавкиНДС.НДС5_105,	Множители);
	
	Множители = Новый Соответствие();
	Множители.Вставить(Ложь,	0.07);		// Сумма не включает НДС
	Множители.Вставить(Истина,	7/107);		// Сумма включает НДС
	Результат.Вставить(Перечисления.СтавкиНДС.НДС7,		Множители);
	Результат.Вставить(Перечисления.СтавкиНДС.НДС7_107,	Множители);
	
	Возврат Результат;
	
КонецФункции

//---
// Причины налогообложения

Функция ПолучитьТаблицуПричинНалогообложения() Экспорт
	
	// Обрабатываемые данные:
	МакетНастроек		= Перечисления.ПричиныНалогообложенияНДС.ПолучитьМакет("Настройки");
	ОбластьИменаКолонок	= МакетНастроек.ПолучитьОбласть("Колонки|ИменаКолонок");
	ОбластьДанные		= МакетНастроек.ПолучитьОбласть("Колонки|Строки");
	
	// Возвращаемая таблица (пока пустая):
	ТЗ = Новый ТаблицаЗначений();
	ТипБулево	= Новый ОписаниеТипов("Булево");
	ТипСтрока	= Новый ОписаниеТипов("Строка");
	ТЗ.Колонки.Добавить("ПричинаНалогообложения",		Новый ОписаниеТипов("ПеречислениеСсылка.ПричиныНалогообложенияНДС"));
	ТЗ.Колонки.Добавить("НачислениеСразу",				ТипБулево);
	ТЗ.Колонки.Добавить("НачислениеВБудущем",			ТипБулево);
	ТЗ.Колонки.Добавить("ВычетСразу",					ТипБулево);
	ТЗ.Колонки.Добавить("ВычетВБудущем",				ТипБулево);
	ТЗ.Колонки.Добавить("РаспределениеВозможно",		ТипБулево);
	ТЗ.Колонки.Добавить("НалоговыйАгент",				ТипБулево);
	ТЗ.Колонки.Добавить("Аванс",						ТипБулево);
	ТЗ.Колонки.Добавить("ДляСчетаФактурыВыданного",		ТипБулево);
	ТЗ.Колонки.Добавить("ДляСчетаФактурыПолученного",	ТипБулево);
	ТЗ.Колонки.Добавить("КодВидаТовара",				ТипБулево);
	ТЗ.Колонки.Добавить("СчетРасчетов",					ТипБулево);
	ТЗ.Колонки.Добавить("Продавец",						ТипСтрока);
	ТЗ.Колонки.Добавить("Покупатель",					ТипСтрока);
	
	// Запоминаем последовательность колонок возвращаемой таблицы:
	ИменаКолонокТЗ = Новый Массив();
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		ИменаКолонокТЗ.Добавить(Колонка.Имя);
	КонецЦикла;
	
	// Определим соответствие в последовательностей колонок табличного документа
	// и заполняемой таблицы:
	СоответствующиеКолонкиТЗ = Новый Соответствие();
	хМакс = ОбластьИменаКолонок.ШиринаТаблицы;
	Для х = 1 По хМакс Цикл
		ИмяКолонки = ОбластьИменаКолонок.Область(1, х, 1, х).Текст;
		Если ПустаяСтрока(ИмяКолонки) Тогда
			Продолжить;
		КонецЕсли;
		
		// Такая колонка есть в ТЗ?
		инд = ИменаКолонокТЗ.Найти(ИмяКолонки);
		Если НЕ инд = Неопределено Тогда
			СоответствующиеКолонкиТЗ.Вставить(х, ИмяКолонки);
		КонецЕсли;
	КонецЦикла;
	
	// Добавляем строки:
	уМакс = ОбластьДанные.ВысотаТаблицы;
	хМакс = ОбластьДанные.ШиринаСтраницы;
	Для у = 1 По уМакс Цикл // по строкам
		СтрокаТЗ = ТЗ.Добавить();
		
		Для х = 1 По хМакс Цикл // по столбцам
			
			ИмяКолонкиТЗ = СоответствующиеКолонкиТЗ.Получить(х);
			
			Если ИмяКолонкиТЗ = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстЯчейки = ОбластьДанные.Область(у, х, у, х).Текст;
			
			Если ИмяКолонкиТЗ = "ПричинаНалогообложения" Тогда
				Попытка
					Значение = Перечисления.ПричиныНалогообложенияНДС[ТекстЯчейки];
				Исключение
					ТекстСообщения = СтрШаблон(
						НСтр("ru='В макете настроек перечисления ПричиныНалогообложенияНДС указано несуществующее значение ""%1""'"),
						ТекстЯчейки);
						
					ВызватьИсключение ТекстСообщения;
				КонецПопытки;
				
			ИначеЕсли ИмяКолонкиТЗ = "Продавец" ИЛИ ИмяКолонкиТЗ = "Покупатель" Тогда
				Значение = ТекстЯчейки;
				
			Иначе
				ТекстЯчейки = ВРег(СокрЛП(ТекстЯчейки));
				Если ТекстЯчейки = "ИСТИНА"
					ИЛИ ТекстЯчейки = "ДА"
					ИЛИ ТекстЯчейки = "+" Тогда
					Значение = Истина;
				Иначе
					Значение = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаТЗ[ИмяКолонкиТЗ] = Значение;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции

Функция ПолучитьПричиныНалогообложенияНачислениеСразу() Экспорт
	
	Возврат ПолучитьПричиныНалогообложенияДляКолонкиТаблицыСлужебный("НачислениеСразу");
	
КонецФункции
Функция ПолучитьПричиныНалогообложенияНачислениеВБудущем() Экспорт
	
	Возврат ПолучитьПричиныНалогообложенияДляКолонкиТаблицыСлужебный("НачислениеВБудущем");
	
КонецФункции
Функция ПолучитьПричиныНалогообложенияВычетСразу() Экспорт
	
	Возврат ПолучитьПричиныНалогообложенияДляКолонкиТаблицыСлужебный("ВычетСразу");
	
КонецФункции
Функция ПолучитьПричиныНалогообложенияВычетВБудущем() Экспорт
	
	Возврат ПолучитьПричиныНалогообложенияДляКолонкиТаблицыСлужебный("ВычетВБудущем");
	
КонецФункции
Функция ПолучитьПричиныНалогообложенияРаспределениеВозможно() Экспорт
	
	Возврат ПолучитьПричиныНалогообложенияДляКолонкиТаблицыСлужебный("РаспределениеВозможно");
	
КонецФункции
Функция ПолучитьПричиныНалогообложенияДляСчетаФактурыВыданного() Экспорт
	
	Возврат ПолучитьПричиныНалогообложенияДляКолонкиТаблицыСлужебный("ДляСчетаФактурыВыданного");
	
КонецФункции
Функция ПолучитьПричиныНалогообложенияДляСчетаФактурыПолученного() Экспорт
	
	Возврат ПолучитьПричиныНалогообложенияДляКолонкиТаблицыСлужебный("ДляСчетаФактурыПолученного");
	
КонецФункции
Функция ПолучитьПричиныНалогообложенияНалоговыйАгент() Экспорт
	
	Возврат ПолучитьПричиныНалогообложенияДляКолонкиТаблицыСлужебный("НалоговыйАгент");
	
КонецФункции
Функция ПолучитьПричиныНалогообложенияАванс() Экспорт
	
	Возврат ПолучитьПричиныНалогообложенияДляКолонкиТаблицыСлужебный("Аванс");
	
КонецФункции
Функция ПолучитьПричиныНалогообложенияКодВидаТовара() Экспорт
	
	Возврат ПолучитьПричиныНалогообложенияДляКолонкиТаблицыСлужебный("КодВидаТовара");
	
КонецФункции
Функция ПолучитьПричиныНалогообложенияСчетРасчетов() Экспорт
	
	Возврат ПолучитьПричиныНалогообложенияДляКолонкиТаблицыСлужебный("СчетРасчетов");
	
КонецФункции

Функция ПолучитьПричиныНалогообложенияДляКолонкиТаблицыСлужебный(ИмяКолонки)
	
	ТЗ = УчетНДСПовтИсп.ПолучитьТаблицуПричинНалогообложения();
	
	ИмяКолонкиПричинаНалогообложения = "ПричинаНалогообложения";
	
	Поиск = Новый Структура(ИмяКолонки, Истина);
	Возврат ТЗ.Скопировать(Поиск, ИмяКолонкиПричинаНалогообложения).ВыгрузитьКолонку(ИмяКолонкиПричинаНалогообложения);
	
КонецФункции

Функция Начисление(ПричинаНалогообложения) Экспорт
	
	Возврат (УчетНДСПовтИсп.НачислениеСразу(ПричинаНалогообложения) ИЛИ УчетНДСПовтИсп.НачислениеВБудущем(ПричинаНалогообложения));
	
КонецФункции
Функция НачислениеСразу(ПричинаНалогообложения) Экспорт
	
	Возврат НЕ (УчетНДСПовтИсп.ПолучитьПричиныНалогообложенияНачислениеСразу().Найти(ПричинаНалогообложения) = Неопределено);
	
КонецФункции
Функция НачислениеВБудущем(ПричинаНалогообложения) Экспорт
	
	Возврат НЕ (УчетНДСПовтИсп.ПолучитьПричиныНалогообложенияНачислениеВБудущем().Найти(ПричинаНалогообложения) = Неопределено);
	
КонецФункции
Функция Вычет(ПричинаНалогообложения) Экспорт
	
	Возврат (УчетНДСПовтИсп.ВычетСразу(ПричинаНалогообложения) ИЛИ УчетНДСПовтИсп.ВычетВБудущем(ПричинаНалогообложения));
	
КонецФункции
Функция ВычетСразу(ПричинаНалогообложения) Экспорт
	
	Возврат НЕ (УчетНДСПовтИсп.ПолучитьПричиныНалогообложенияВычетСразу().Найти(ПричинаНалогообложения) = Неопределено);
	
КонецФункции
Функция ВычетВБудущем(ПричинаНалогообложения) Экспорт
	
	Возврат НЕ (УчетНДСПовтИсп.ПолучитьПричиныНалогообложенияВычетВБудущем().Найти(ПричинаНалогообложения) = Неопределено);
	
КонецФункции
Функция РаспределениеВозможно(ПричинаНалогообложения) Экспорт
	
	Возврат НЕ (УчетНДСПовтИсп.ПолучитьПричиныНалогообложенияРаспределениеВозможно().Найти(ПричинаНалогообложения) = Неопределено);
	
КонецФункции
Функция НалоговыйАгент(ПричинаНалогообложения) Экспорт
	
	Возврат НЕ (УчетНДСПовтИсп.ПолучитьПричиныНалогообложенияНалоговыйАгент().Найти(ПричинаНалогообложения) = Неопределено);
	
КонецФункции
Функция Аванс(ПричинаНалогообложения) Экспорт
	
	Возврат НЕ (УчетНДСПовтИсп.ПолучитьПричиныНалогообложенияАванс().Найти(ПричинаНалогообложения) = Неопределено);
	
КонецФункции
Функция СчетРасчетовИспользуется(ПричинаНалогообложения) Экспорт
	
	Возврат (УчетНДСПовтИсп.ПолучитьПричиныНалогообложенияСчетРасчетов().Найти(ПричинаНалогообложения) <> Неопределено);
	
КонецФункции
Функция КодВидаТовараИспользуется(ПричинаНалогообложения) Экспорт
	
	Возврат (УчетНДСПовтИсп.ПолучитьПричиныНалогообложенияКодВидаТовара().Найти(ПричинаНалогообложения) <> Неопределено);
	
КонецФункции

Функция ШкурыЛом(ПричинаНалогообложения) Экспорт
	
	Возврат (ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.АвансПолученныйЛом
		ИЛИ ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.РеализацияЛом);
	
КонецФункции

Функция ПродавецПокупатель(ПричинаНалогообложения) Экспорт
	
	Поиск = Новый Структура("ПричинаНалогообложения", ПричинаНалогообложения);
	
	МассивСтрок = УчетНДСПовтИсп.ПолучитьТаблицуПричинНалогообложения().НайтиСтроки(Поиск);
	
	Результат = Новый Структура("Продавец, Покупатель");
	
	Если МассивСтрок.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(Результат, МассивСтрок[0]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
