/////////////////////////////////////////////////////////////////////////////////
// ПРОВЕДЕНИЕ, СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ                                   //
/////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

///////////////////////////////////////////////////////////////////////////////////
// Процедуры для подготовки и записи движений документа.

// Процедура инициализирует общие структуры, используемые при проведении документов.
// Вызывается из модуля документов при проведении.
//
Процедура ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойства, РежимПроведения = Неопределено) Экспорт

	// В структуре "ДополнительныеСвойства" создаются свойства с ключами "ТаблицыДляДвижений", "ДляПроведения".

	// "ТаблицыДляДвижений" - структура, которая будет содержать таблицы значений с данными для выполнения движений.
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);
	
	// Настройка "Использовать отдельную дату проведения документов".
	ДокументСОтдельнойДатойПроведения = Метаданные.ОпределяемыеТипы.ДокументыСОтдельнойДатойПроведения.Тип.СодержитТип(ТипЗнч(ДокументСсылка));
	Если ДокументСОтдельнойДатойПроведения Тогда
		ДополнительныеСвойства.Вставить("ИспользоватьОтдельнуюДатуПроведенияДокументов", ПолучитьФункциональнуюОпцию("ИспользоватьОтдельнуюДатуПроведенияДокументов"));
		ДополнительныеСвойства.Вставить("УстановленнаяДатаПроведения", БухгалтерскийУчет.УстановленнаяДатаПроведения(ДокументСсылка));
	КонецЕсли;
	
	// "ДляПроведения" - структура, содержащая свойства и реквизиты документа, необходимые для проведения.
	ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
	
	// Структура, содержащая ключ с именем "МенеджерВременныхТаблиц", в значении которого хранится менеджер временных таблиц.
	// Содержит для каждой временной таблицы ключ (имя временной таблицы) и значение (признак наличия записей во временной таблице).
	ДополнительныеСвойства.ДляПроведения.Вставить("СтруктураВременныеТаблицы", Новый Структура("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц));
	ДополнительныеСвойства.ДляПроведения.Вставить("РежимПроведения",           РежимПроведения);
	ДополнительныеСвойства.ДляПроведения.Вставить("МетаданныеДокумента",       ДокументСсылка.Метаданные());
	ДополнительныеСвойства.ДляПроведения.Вставить("Ссылка",                    ДокументСсылка);
	
КонецПроцедуры

Процедура ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства) Экспорт

	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();

КонецПроцедуры

// Функция формирует массив имен регистров, по которым документ имеет движения.
// Вызывается при подготовке записей к регистрации движений.
//
Функция ПолучитьМассивИспользуемыхРегистров(Регистратор, Движения, МассивИсключаемыхРегистров = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);

	Результат = Новый Массив;
	МаксимумТаблицВЗапросе = 256;

	СчетчикТаблиц   = 0;
	СчетчикДвижений = 0;

	ВсегоДвижений = Движения.Количество();
	ТекстЗапроса  = "";
	Для Каждого Движение Из Движения Цикл

		СчетчикДвижений = СчетчикДвижений + 1;

		ПропуститьРегистр = МассивИсключаемыхРегистров <> Неопределено
							И МассивИсключаемыхРегистров.Найти(Движение.Имя) <> Неопределено;

		Если Не ПропуститьРегистр Тогда

			Если СчетчикТаблиц > 0 Тогда

				ТекстЗапроса = ТекстЗапроса + "
				|ОБЪЕДИНИТЬ ВСЕ
				|";

			КонецЕсли;

			СчетчикТаблиц = СчетчикТаблиц + 1;

			ТекстЗапроса = ТекстЗапроса + 
			"
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|""" + Движение.Имя + """ КАК ИмяРегистра
			|
			|ИЗ " + Движение.ПолноеИмя() + "
			|
			|ГДЕ Регистратор = &Регистратор
			|";

		КонецЕсли;

		Если СчетчикТаблиц = МаксимумТаблицВЗапросе Или СчетчикДвижений = ВсегоДвижений Тогда

			Запрос.Текст  = ТекстЗапроса;
			ТекстЗапроса  = "";
			СчетчикТаблиц = 0;
			Если Запрос.Текст = "" Тогда
				//В запросе нет текста, все регистры пропущены
				Продолжить;
			КонецЕсли;
			
			Если Результат.Количество() = 0 Тогда

				Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяРегистра");

			Иначе

				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Результат.Добавить(Выборка.ИмяРегистра);
				КонецЦикла;

			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Процедура выполняет подготовку наборов записей документа к записи движений.
// 1. Очищает наборы записей от "старых записей" (ситуация возможна только в толстом клиенте)
// 2. Взводит флаг записи у наборов, по которым документ имеет движения
// Вызывается из модуля документов при проведении.
// 
// В ДополнительныхСвойствах объекта может быть задан ключ МассивИменРегистров, 
// содержащий массив имен регистров для изменения.
// В этом случае будут изменены только перечисленные регистры.
//
Процедура ПодготовитьНаборыЗаписейКРегистрацииДвижений(Объект) Экспорт

	МассивИменРегистров = Неопределено;
	Если Объект.ДополнительныеСвойства.Свойство("МассивИменРегистров") Тогда
		МассивИменРегистров = Объект.ДополнительныеСвойства.МассивИменРегистров;
	КонецЕсли;
	
	// Регистры, движения по которым формируются не из модуля менеджера документа
	НеОчищаемыеРегистры = Новый Соответствие;
	НеОчищаемыеРегистры.Вставить(Тип("РегистрНакопленияНаборЗаписей.ОплатаПоставщикамКредиторам"), Истина);
	НеОчищаемыеРегистры.Вставить(Тип("РегистрНакопленияНаборЗаписей.ОплатаОтПокупателейДебиторов"), Истина);
	НеОчищаемыеРегистры.Вставить(Тип("РегистрНакопленияНаборЗаписей.ИсполнениеОбязательствПоставщиками"), Истина);
	НеОчищаемыеРегистры.Вставить(Тип("РегистрНакопленияНаборЗаписей.ИсполнениеДоговоровСПокупателями"), Истина);
	НеОчищаемыеРегистры.Вставить(Тип("РегистрСведенийНаборЗаписей.ОперацииСПрослеживаемымиТоварами"), Истина);
	НеОчищаемыеРегистры.Вставить(Тип("РегистрСведенийНаборЗаписей.ОперацииКапвложений"), Истина);
	
	Если МассивИменРегистров = Неопределено Тогда
		
		Для Каждого НаборЗаписей Из Объект.Движения Цикл
			
			// Регистры, движения по которым формируются не из модуля менеджера документа.
			Если НеОчищаемыеРегистры.Получить(ТипЗнч(НаборЗаписей)) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если НаборЗаписей.Количество() > 0 Тогда
				НаборЗаписей.Очистить();
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для каждого ТекДвижение Из МассивИменРегистров Цикл
		
			Если Объект.Движения.Найти(ТекДвижение)<>Неопределено Тогда
				
				НаборЗаписей = Объект.Движения[ТекДвижение];	
				Если НаборЗаписей.Количество() > 0 Тогда
					НаборЗаписей.Очистить();
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не Объект.ДополнительныеСвойства.ЭтоНовый Тогда
		
		Если МассивИменРегистров = Неопределено Тогда
			// Регистры, движения по которым формируются не из модуля менеджера документа.
			ИсключаемыеРегистры = Новый Массив;
			Если Объект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				// При проведении заполняем вручную, при отмене проведения очищаем стандартным образом.
				ИсключаемыеРегистры.Добавить("КнигаУчетаДоходовИРасходов");
			КонецЕсли;
			
			МассивИменРегистров = ПолучитьМассивИспользуемыхРегистров(Объект.Ссылка,
					Объект.ДополнительныеСвойства.ДляПроведения.МетаданныеДокумента.Движения,
					ИсключаемыеРегистры);
			
		КонецЕсли;
		
		Для Каждого ИмяРегистра Из МассивИменРегистров Цикл
			Объект.Движения[ИмяРегистра].Записывать = Истина;
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

// Процедура записывает движения документа. Дополнительно происходит копирование параметров
// в модули наборов записей для выполнения регистрации изменений в движениях.
// Процедура вызывается из модуля документов при проведении.
//
Процедура ЗаписатьНаборыЗаписей(Объект) Экспорт
	Перем РегистрыДляКонтроля;

	// Регистры, для которых будут рассчитаны таблицы изменений движений.
	Если Объект.ДополнительныеСвойства.ДляПроведения.Свойство("РегистрыДляКонтроля", РегистрыДляКонтроля) Тогда
		Для Каждого НаборЗаписей Из РегистрыДляКонтроля Цикл
			Если НаборЗаписей.Записывать Тогда

				// Установка флага регистрации изменений в наборе записей.
				НаборЗаписей.ДополнительныеСвойства.Вставить("РассчитыватьИзменения", Истина);
				НаборЗаписей.ДополнительныеСвойства.Вставить("ЭтоНовый", Объект.ДополнительныеСвойства.ЭтоНовый);

				// Структура для передачи данных в модули наборов записей.
				НаборЗаписей.ДополнительныеСвойства.Вставить("ДляПроведения", 
						Новый Структура("СтруктураВременныеТаблицы", Объект.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы));

			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Объект.Движения.Записать();

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////
// Процедуры формирования движений

Процедура ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
	// Инициализация дополнительных свойств для проведения документа
	Объект.ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);
	
	// Настройка "Использовать отдельную дату проведения документов".
	ДокументСОтдельнойДатойПроведения = Метаданные.ОпределяемыеТипы.ДокументыСОтдельнойДатойПроведения.Тип.СодержитТип(ТипЗнч(Объект.Ссылка));
	Если ДокументСОтдельнойДатойПроведения Тогда
		Объект.ДополнительныеСвойства.Вставить("ИспользоватьОтдельнуюДатуПроведенияДокументов", ПолучитьФункциональнуюОпцию("ИспользоватьОтдельнуюДатуПроведенияДокументов"));
		Объект.ДополнительныеСвойства.Вставить("УстановленнаяДатаПроведения", БухгалтерскийУчет.УстановленнаяДатаПроведения(Объект.Ссылка));
	КонецЕсли;
	
	// Инициализация данных документа
	ИмяДокумента = Объект.Метаданные().Имя;
	Документы[ИмяДокумента].ИнициализироватьДанныеДокумента(Объект.Ссылка, Объект.ДополнительныеСвойства);
	
	// Подготовка наборов записей
	МенеджерТаблицИзмененияРегистров = Новый МенеджерВременныхТаблиц;
	ВыполнятьКонтрольРезультатовПроведения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Объект.ДополнительныеСвойства, "КонтрольОстатковПослеПроведения", Ложь);
	Для Каждого НаборЗаписей Из Объект.Движения Цикл
		ТипНабора = ТипЗнч(НаборЗаписей);
		// Особые регистры - при проведении заполняем вручную, при отмене проведения очищаем стандартным образом.
		Если ТипНабора = Тип("РегистрНакопленияНаборЗаписей.КнигаУчетаДоходовИРасходов") Тогда
			Продолжить;
		ИначеЕсли ТипНабора = Тип("РегистрНакопленияНаборЗаписей.ОборотыРасчетовСУчредителями") Тогда
			Продолжить;
		ИначеЕсли ТипНабора = Тип("РегистрБухгалтерииНаборЗаписей.ЖурналПроводокЕПСБУ") Тогда
			Ключ = "НеФормироватьУчетныеДанныеИзПроводок";
			Значение = Неопределено;
			Если Объект.ДополнительныеСвойства.Свойство(Ключ, Значение) Тогда
				НаборЗаписей.ДополнительныеСвойства.Вставить(Ключ, Значение);
			КонецЕсли;
		Иначе
			Если ВыполнятьКонтрольРезультатовПроведения Тогда
				НаборЗаписей.ДополнительныеСвойства.Вставить("КонтрольОстатковПослеПроведения", Истина);
				НаборЗаписей.ДополнительныеСвойства.Вставить("МенеджерТаблицИзмененияРегистров", МенеджерТаблицИзмененияРегистров);
			КонецЕсли;
		КонецЕсли;
		НаборЗаписей.Записывать = Истина;
		
	КонецЦикла;
	
	ОтразитьДвиженияРезервирования(Объект);
	
	// Запись наборов записей
	ОтразитьДвиженияПоРегистрам(Объект);
	
	Если ВыполнятьКонтрольРезультатовПроведения Тогда
		Объект.Движения.Записать();
		ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ, РежимПроведения, МенеджерТаблицИзмененияРегистров);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтразитьДвиженияРезервирования(Объект) Экспорт
	ИмяТаблицы = "ДвиженияРезервТМЦ";
	ИмяРегистра = "РезервМЗ";
	Если РезервированиеНФА.ЭтоТипДокументаРезервированияОС(ТипЗнч(Объект.Ссылка)) Тогда
		ИмяТаблицы = "ДвиженияРезервОС";
		ИмяРегистра = "РезервОС";
	КонецЕсли;
		
	Если Объект.ДополнительныеСвойства.Свойство(ИмяТаблицы) Тогда
		ДвиженияРезерва = Объект.ДополнительныеСвойства[ИмяТаблицы]; // ТаблицаЗначений
		НаборЗаписей = Объект.Движения.Найти(ИмяРегистра); // РегистрНакопленияНаборЗаписей.РезервМЗ ИЛИ .РезервОС
		Если НаборЗаписей <> Неопределено Тогда
			НаборЗаписей.Очистить();
			Для Каждого СтрокаРезерва Из ДвиженияРезерва Цикл
				НовоеДвижениеРезерва = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НовоеДвижениеРезерва, СтрокаРезерва);
				НовоеДвижениеРезерва.Активность = Истина;
			КонецЦикла;
			НаборЗаписей.Записывать = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Объект, Отказ) Экспорт
	
	Для Каждого НаборЗаписей Из Объект.Движения Цикл
		НаборЗаписей.Записывать = Истина;
	КонецЦикла;
	
	Объект.Движения.Записать();
	
КонецПроцедуры

Процедура ОтразитьДвиженияПоРегистрам(Объект) Экспорт

	Для Каждого КлючТаблицы Из Объект.ДополнительныеСвойства.ТаблицыДляДвижений Цикл
		
		ТаблицаДвижений = КлючТаблицы.Значение;
		
		Если ТаблицаДвижений.Количество() > 0 Тогда
			ДвиженияДокумента = Объект.Движения.Найти(КлючТаблицы.Ключ);
			Если ДвиженияДокумента <> Неопределено Тогда
				ДвиженияДокумента.Записывать = Истина;
				ДвиженияДокумента.Загрузить(ТаблицаДвижений);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ, РежимПроведения, МенеджерТаблицИзмененияРегистров)
	
	ЗапросКонтроля = Новый Запрос;
	ЗапросКонтроля.МенеджерВременныхТаблиц = МенеджерТаблицИзмененияРегистров;
	ТекстыЗапроса = Новый СписокЗначений;
	
	МодулиМенеджеровРегистров = Новый Соответствие;
	Для Каждого НаборЗаписей Из Объект.Движения Цикл
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НаборЗаписей.ДополнительныеСвойства, "КонтрольИзмененийПриЗаписи", Ложь) Тогда
			ПолноеИмяОбъекта = СтандартныеПодсистемыВызовСервера.ПолноеИмяОбъектаМетаданных(ТипЗнч(НаборЗаписей));
			МодульМенеджера = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта);
			МодулиМенеджеровРегистров.Вставить(ТипЗнч(НаборЗаписей), МодульМенеджера);
			МодульМенеджера.ИнициализироватьДанныеКонтроляИзменений(ТекстыЗапроса);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ТекстыЗапроса.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекстЗапроса Из ТекстыЗапроса Цикл
		ЗапросКонтроля.Текст = ЗапросКонтроля.Текст + ТекстЗапроса.Значение + ОбщегоНазначения.РазделительПакетаЗапросов() + Символы.ПС;
	КонецЦикла;
	
	ЗапросКонтроля.УстановитьПараметр("МоментВремени",
		?(РежимПроведения = РежимПроведенияДокумента.Оперативный, Неопределено, Новый Граница(Объект.МоментВремени(), ВидГраницы.Включая)));
		
	РезультатыКонтроля = ЗапросКонтроля.ВыполнитьПакет();
	ЗапросКонтроля.МенеджерВременныхТаблиц.Закрыть();
	
	Если РезультатыКонтроля = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтруктураРезультатовКонтроля = Новый Структура;
	Для Каждого ТекстЗапроса Из ТекстыЗапроса Цикл
		ИмяТаблицы = ТекстЗапроса.Представление;
		Если НЕ ПустаяСтрока(ИмяТаблицы) Тогда
			Результат = РезультатыКонтроля[ТекстыЗапроса.Индекс(ТекстЗапроса)];
			Если Результат <> Неопределено Тогда
				СтруктураРезультатовКонтроля.Вставить(ИмяТаблицы, Результат.Выгрузить());
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Ошибки = Неопределено;
	Для Каждого ЭлементРезультат Из СтруктураРезультатовКонтроля Цикл
		МодульМенеджера = МодулиМенеджеровРегистров.Получить(ТипЗнч(Объект.Движения[ЭлементРезультат.Ключ]));
		МодульМенеджера.ПодготовитьСообщенияОРезультатахКонтроляИзменений(ЭлементРезультат.Значение, Ошибки);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	Объект.ДополнительныеСвойства.Вставить("ОшибкиПроведения", Ошибки);
	
КонецПроцедуры

Процедура ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, ИмяТаблицы) Экспорт

	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений[ИмяТаблицы];
	
	Если Отказ Или ТаблицаДвижений.Количество() = 0 Тогда	
		Возврат;		
	КонецЕсли;
	
	ДвиженияДокумента = Движения[ИмяТаблицы];
	ДвиженияДокумента.Записывать = Истина;
	ДвиженияДокумента.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

// Формирует и записывает движения документа по списку регистров с блокировкой регистров
// описание параметров см. ОтразитьДвиженияДокументаПоРегистрам
//
Процедура ОтразитьДвиженияДокументаПоРегистрамОтложенно(ДокументСсылка, Регистры) Экспорт
	
	Попытка
		
		НачатьТранзакцию();
		
		// Устанавливаем блокировку на все регистры
		Блокировка = Новый БлокировкаДанных;
		Для Каждого Регистр Из Регистры Цикл
			ЭлементБлокировки = Блокировка.Добавить(Регистр + ".НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", ДокументСсылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;			
		КонецЦикла;
		Блокировка.Заблокировать();
		
		ОтразитьДвиженияДокументаПоРегистрам(ДокументСсылка, Регистры);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Формирует и записывает движения документа по списку регистров
//
// Параметры:
//  ДокументСсылка	 - ДокументСсылка	- Ссылка на документ
//  Регистры		 - Массив			- Массив имен регистров, по которым нужно отразить движения.
//										  (допускается содержание регистра, для которого документ не является регистратором)
//
Процедура ОтразитьДвиженияДокументаПоРегистрам(ДокументСсылка, Регистры) Экспорт
	
	ТаблицыДляДвижений = Новый Структура;
	ДополнительныеСвойства = Новый Структура("ТаблицыДляДвижений", ТаблицыДляДвижений);
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДокументСсылка);
	
	Менеджер.ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства);
	
	Для Каждого ИмяРегистра Из Регистры Цикл
		ОтразитьДвиженияПоРегиструЗаписать(ДокументСсылка, ТаблицыДляДвижений, ИмяРегистра); 
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтразитьДвиженияПоРегиструЗаписать(ДокументСсылка, ТаблицыДляДвижений, ИмяТаблицы)

	ЧастиИмени	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяТаблицы, ".");
	ТипРегистра	= ЧастиИмени[0];
	ИмяРегистра	= ЧастиИмени[1];
	 
	Если ТипРегистра = "РегистрСведений" Тогда
		Регистр = РегистрыСведений[ИмяРегистра];
	ИначеЕсли ТипРегистра = "РегистрНакопления" Тогда
	    Регистр = РегистрыНакопления[ИмяРегистра];
	Иначе // другие регистры не нужны
		Возврат;
	КонецЕсли;	
	
	ДвиженияДокумента = Регистр.СоздатьНаборЗаписей();
	ОтборРегистратор = ДвиженияДокумента.Отбор.Найти("Регистратор");
	Если ОтборРегистратор <> Неопределено
		И ОтборРегистратор.ТипЗначения.СодержитТип(ТипЗнч(ДокументСсылка)) Тогда
		ОтборРегистратор.Установить(ДокументСсылка);
		ТаблицаДвижений = Неопределено;		
		Если Не ТаблицыДляДвижений.Свойство(ИмяРегистра, ТаблицаДвижений) Тогда
			ТаблицаДвижений = Новый ТаблицаЗначений;
		КонецЕсли;
		ДвиженияДокумента.Загрузить(ТаблицаДвижений);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(ДвиженияДокумента);
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////
// Прочие процедуры

Процедура УстановитьРежимПроведения(ДокументОбъект, РежимЗаписи, РежимПроведения) Экспорт

	Если ДокументОбъект.Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
