&НаКлиенте
Перем ПараметрыОбработчикаОжидания;
&НаКлиенте
Перем ФормаДлительнойОперации;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузкаАктивна = АктивнаЗагрузкаКомплектаНаСервере();
	
	//Обмен со Сводом
	ИспользоватьОбменСоСводомОтчетов = БюджетнаяОтчетностьСервер.ИспользоватьОбменСоСводомОтчетов();
	
	Элементы.ГруппаКолонокСостояниеСвод.Видимость = ИспользоватьОбменСоСводомОтчетов;
	Элементы.ГруппаПротоколы.Видимость = ИспользоватьОбменСоСводомОтчетов;
	Элементы.ГруппаДанныеСвода.Видимость = ИспользоватьОбменСоСводомОтчетов;
	Элементы.ТаблицаВыгрузокГруппаСостояниеСвод.Видимость = ИспользоватьОбменСоСводомОтчетов;
	Элементы.ФормаПодменюОбмена.Видимость = ИспользоватьОбменСоСводомОтчетов;
	
	Если ИспользоватьОбменСоСводомОтчетов Тогда
		УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьОбменаСоСводомОтчетов.Получить();
		
		Элементы.Состояние.Заголовок = "Состояние (БГУ)";
		Элементы.ТаблицаВыгрузокСостояние.Заголовок = "Состояние (БГУ)";
		

		ОбменЧерезВебСервис = Перечисления.СпособыВыгрузкиФайлов.WebСервис;

		Список.ТекстЗапроса = "ВЫБРАТЬ
		|	ДокументУниверсальныйРегламентированныйОтчет.ПометкаУдаления,
		|	ДокументУниверсальныйРегламентированныйОтчет.Номер,
		|	ДокументУниверсальныйРегламентированныйОтчет.Дата,
		|	ДокументУниверсальныйРегламентированныйОтчет.Проведен,
		|	ДокументУниверсальныйРегламентированныйОтчет.ВидОтчета,
		|	ДокументУниверсальныйРегламентированныйОтчет.Организация,
		|	ДокументУниверсальныйРегламентированныйОтчет.ПериодОтчета КАК ПериодОтчета,
		|	ДокументУниверсальныйРегламентированныйОтчет.ЕдиницаИзмерения,
		|	ДокументУниверсальныйРегламентированныйОтчет.Состояние,
		|	ДокументУниверсальныйРегламентированныйОтчет.ИФО,
		|	ДокументУниверсальныйРегламентированныйОтчет.УровеньТочности,
		|	ДокументУниверсальныйРегламентированныйОтчет.ДатаИзменения,
		|	ДокументУниверсальныйРегламентированныйОтчет.ПоследнийРедактировавший,
		|	ДокументУниверсальныйРегламентированныйОтчет.ПравилоОбработки,
		|	ДокументУниверсальныйРегламентированныйОтчет.ПравилоПроверки,
		|	ДокументУниверсальныйРегламентированныйОтчет.Редакция,
		|	ДокументУниверсальныйРегламентированныйОтчет.ШаблонОтчета,
		|	ДокументУниверсальныйРегламентированныйОтчет.ОписаниеАналитики,
		|	ДокументУниверсальныйРегламентированныйОтчет.Комментарий,
		|	ДокументУниверсальныйРегламентированныйОтчет.МоментВремени,
		|	ДокументУниверсальныйРегламентированныйОтчет.Ссылка,
		|	ВЫБОР
		|		КОГДА ДокументУниверсальныйРегламентированныйОтчет.ДатаЗаполнения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьДанныеЗаполнения,
		|	ДокументУниверсальныйРегламентированныйОтчет.Состояние.Порядок КАК ИндексКартинкиСостояния,
		|	СостоянияОтправленныхОтчетовСрезПоследних.Состояние КАК СостояниеСвод,
		|	ЕСТЬNULL(СостоянияОтправленныхОтчетовСрезПоследних.Состояние.Порядок, -1) КАК ИндексКартинкиСостоянияСвод,
		|	СостоянияОтправленныхОтчетовСрезПоследних.Период КАК ПериодСвод,
		|	СостоянияОтправленныхОтчетовСрезПоследних.Комментарий КАК КомментарийСвод,
		|	СостоянияОтправленныхОтчетовСрезПоследних.ПричинаИзмененияСостояния КАК ПричинаСвод,
		|	ЕСТЬNULL(НаличиеФайлов.ЕстьФайлы, ЛОЖЬ) КАК ЕстьФайлы
		|ИЗ
		|	Документ.УниверсальныйРегламентированныйОтчет КАК ДокументУниверсальныйРегламентированныйОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОтправленныхОтчетов.СрезПоследних КАК СостоянияОтправленныхОтчетовСрезПоследних
		|		ПО (СостоянияОтправленныхОтчетовСрезПоследних.ДокументОтчет = ДокументУниверсальныйРегламентированныйОтчет.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
        |		ПО ДокументУниверсальныйРегламентированныйОтчет.Ссылка = НаличиеФайлов.ОбъектСФайлами";
		
	КонецЕсли;
	//
	
	СоздатьДеревоВидовОтчетов();
	УстановитьЗапросСпискаВыгрузок();
	
	Если Не ПравоДоступа("Добавление", Метаданные.Документы.УниверсальныйРегламентированныйОтчет) Тогда
		Элементы.ДеревоВидовОтчетов.УстановитьДействие("Выбор","Подключаемый_ДеревоВидовОтчетовВыбор");
	КонецЕсли;
	
	УчетПоИФО = БюджетнаяОтчетностьСервер.ИспользоватьУчетПоИФО();
	Элементы.ГруппаОтборовПоИФО.Видимость = УчетПоИФО;
	Элементы.ИФО.Видимость = УчетПоИФО;
	Элементы.ТаблицаВыгрузокИФО.Видимость = УчетПоИФО;
	
	// Заполнение группы информационных ссылок
	БюджетнаяОтчетностьСерверПереопределяемый.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	
	//Выгрузка 
	ИницализацияСтраницыВыгрузка();
	

	// Форма открывается из формы 1С Отчетность
	СпособОткрытия = Неопределено;
	Если Параметры.Свойство("СпособОткрытия", СпособОткрытия) Тогда
		Если СпособОткрытия = "1CОтчетностьГрупповаяВыгрузка" ИЛИ СпособОткрытия = "1CОтчетностьОбменСводОтчетовСервис" Тогда
			
			Элементы.ЖурналыДокументов.ТекущаяСтраница = Элементы["ГруппаСтраницаВыгрузка"];
			
			Если ЗначениеЗаполнено(Параметры.ОтборОрганизация) Тогда
				ОтборОрганизация.Добавить(Параметры.ОтборОрганизация);
				ИспользоватьОтборОрганизаций = Истина;
			КонецЕсли;
			
			ПериодОтчетностиОтбор = ИнтеграцияОтчетностиГУИФормы1СОтчетность.ПолучитьПериодПоДатеНачалаОкончания(Параметры.НачалоПериода, Параметры.КонецПериода);
			Если ЗначениеЗаполнено(ПериодОтчетностиОтбор) Тогда
				ОтборПериодов.Добавить(ПериодОтчетностиОтбор);
				ИспользоватьОтборПериодов = Истина;
			КонецЕсли;
			
			Если СпособОткрытия = "1CОтчетностьОбменСводОтчетовСервис" Тогда
				РежимРаботы = 1;
				ПереключитьВидимостьЭлеменовОбменаСоСводомОтчетов(Истина);
			Иначе
				УстановитьОтборы();
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	РазворачиватьТаблицуФайлов = Истина;
	РазворачиватьТаблицуБезФайлов = Ложь;
	
	//добавить панель о новых версиях комплектов
	БюджетнаяОтчетность.ДобавитьИнформационнуюПанельНаФорму(Элементы);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ФормаПодменюОбмена);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом  
	ПараметрыРазмещения = ОбменСАрхивом.ПараметрыРазмещенияЭлементов();
	ПараметрыРазмещения.ИмяСписка = "Список";
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если ИспользоватьОбменСоСводомОтчетов Тогда
		ПереключитьВидимостьЭлеменовОбменаСоСводомОтчетов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжиданияЗагрузкаКомплекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Обработка.ИмпортКейса/ОкончаниеЗагрузки" Тогда
		СоздатьДеревоВидовОтчетов();
		БюджетнаяОтчетностьКлиент.ОбработатьОповещениеОЗагрузкеКомплекта(ИмяСобытия, Параметр, Источник, ЭтотОбъект);
		
	ИначеЕсли ИмяСобытия = "Запись_УниверсальныйРегламентированныйОтчет" Тогда	
				
		Если Элементы.ЖурналыДокументов.ТекущаяСтраница = Элементы.ГруппаСтраницаВыгрузка Тогда
			
			Если Элементы.ТаблицаВыгрузок.ТекущиеДанные <> Неопределено Тогда 
				ТекущийОтчет = Элементы.ТаблицаВыгрузок.ТекущиеДанные.Отчет;
			Иначе 
				ТекущийОтчет = Неопределено;
			КонецЕсли;
			
			ЗаполнитьТаблицуВыгрузокПоОтборам();
 
			УстановитьСтрокуВыгрузокНаОтчет(ТекущийОтчет);
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования") Тогда 
		СтруктураДанных = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.СформироватьСтруктуруДанныхДляУстановкиПодписей();
		
		ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.ДобавитьподписьВСтруктуру(СтруктураДанных,ВыбранноеЗначение);
		
		ДобавитьСертификаты(СтруктураДанных);
		
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Обработка = РеквизитФормыВЗначение("ОбработкаВыгрузки");
	
	Если Не Обработка.ПроверитьЗаполнение() Тогда 
		Отказ = Истина;
	КонецЕсли;	
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЖурналыДокументовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьОтборы();
	
	Если ТекущаяСтраница = Элементы.ГруппаСтраницаОтчеты Тогда	
		
		ТекущиеДанные = Элементы.ТаблицаВыгрузок.ТекущиеДанные;
		Если ТекущиеДанные<> Неопределено Тогда 
			
			Элементы.Список.ТекущаяСтрока = Элементы.ТаблицаВыгрузок.ТекущиеДанные.Отчет;
			
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаСтраницаВыгрузка Тогда 
		
		ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
		Если ТекущиеДанные <> Неопределено Тогда 
			
			УстановитьСтрокуВыгрузокНаОтчет(ТекущиеДанные);
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

//организация

&НаКлиенте
Процедура ИспользоватьОтборОрганизацийПриИзменении(Элемент)
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииПриИзменении(Элемент)
	
	ИспользоватьОтборОрганизаций = ОтборОрганизация.Количество() > 0;
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииОткрытие(Элемент, СтандартнаяОбработка)
		
	Если ОтборОрганизация.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;	
	
	ПоказатьЗначение(,ОтборОрганизация[0].Значение);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		                                                               
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Выберите организации");
	ПараметрыФормы.Вставить("ИсходныйСписок", ОтборОрганизация);
	ПараметрыФормы.Вставить("ТипИсточника", "Запрос");
	ПараметрыФормы.Вставить("ТипВыбираемогоЗначения", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ПараметрыФормы.Вставить("СписокДопПолейДляОтображения", Новый СписокЗначений);
	ПараметрыФормы.СписокДопПолейДляОтображения.Добавить("ИНН", "ИНН");
	
		
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораЗначенийВСписок", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивОрганизаций());
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборОрганизация.Очистить();
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда 
		ОтборОрганизация.ЗагрузитьЗначения(ВыбранноеЗначение.ВыгрузитьЗначения());
		
	Иначе 
		ОтборОрганизация.Добавить(ВыбранноеЗначение);
		
	КонецЕсли;
	
	
	ИспользоватьОтборОрганизаций = ОтборОрганизация.Количество() > 0;
	УстановитьОтборы();

	
КонецПроцедуры

// ИФО

&НаКлиенте
Процедура ИспользоватьОтборИФОПриИзменении(Элемент)
	УстановитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборИФОПриИзменении(Элемент)
	ИспользоватьОтборИФО = ОтборИФО.Количество() > 0;
	УстановитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборИФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		                                                               
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Выберите ИФО");
	ПараметрыФормы.Вставить("ИсходныйСписок", ОтборИФО);
	ПараметрыФормы.Вставить("ТипИсточника", "Запрос");
	ПараметрыФормы.Вставить("ТипВыбираемогоЗначения", Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));	
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораЗначенийВСписок", ПараметрыФормы, Элемент); 
	
КонецПроцедуры

// Период

&НаКлиенте
Процедура ИспользоватьОтборПериодовПриИзменении(Элемент)
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодовПриИзменении(Элемент)
	
	ИспользоватьОтборПериодов = ОтборПериодов.Количество() > 0;
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключатьПодчиненныеПериодыПриИзменении(Элемент)
	УстановитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		                                                               
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Выберите периоды");
	ПараметрыФормы.Вставить("ИсходныйСписок", ОтборПериодов);
	ПараметрыФормы.Вставить("ТипИсточника", "Запрос");
	ПараметрыФормы.Вставить("ТипВыбираемогоЗначения", Новый ОписаниеТипов("СправочникСсылка.Периоды"));
		
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораЗначенийВСписок", ПараметрыФормы, Элемент);

КонецПроцедуры

//вид отчета

&НаКлиенте
Процедура ИспользоватьОтборВидовОтчетаПриИзменении(Элемент)
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВидовОтчетовИспользоватьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоВидовОтчетов.ТекущиеДанные;
	
	Если ТекущиеДанные.Использовать = 2 Тогда
		ТекущиеДанные.Использовать = 0;
	КонецЕсли;
	
	УстановитьИспользованиеВДереве(ТекущиеДанные, ТекущиеДанные.Использовать);
	ОбновитьОтборВидОтчетов();
	
	ИспользоватьОтборВидовОтчета = ОтборВидОтчетов.Количество() > 0;
	
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВидовОтчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗагрузкаАктивна Тогда
		ЗагрузкаАктивна = АктивнаЗагрузкаКомплектаНаСервере();
		ПодключитьОбработчикОжиданияЗагрузкаКомплекта();
	КонецЕсли;
	
	Если ЗагрузкаАктивна Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = ДеревоВидовОтчетов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Не ДанныеСтроки.ЭтоГруппа Тогда
		
		ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения",ПолучитьТекущиеЗначенияРеквизитовОтбора());
		
		ПараметрыОткрытия.ЗначенияЗаполнения.Вставить("ВидОтчета", ДанныеСтроки.Значение);
		
		ОткрытьФорму("Документ.УниверсальныйРегламентированныйОтчет.ФормаОбъекта", ПараметрыОткрытия,,Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДеревоВидовОтчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Возврат;
	
КонецПроцедуры

//прочее

&НаКлиенте
Процедура ФорматВыгрузкиПриИзменении(Элемент)
	
	ФорматВыгрузкиПриИзмененииНаСервере();
	Если ЗначениеЗаполнено(ОбработкаВыгрузки.ФорматВыгрузки) Тогда
		ОповеститьОбИзменении(ОбработкаВыгрузки.ФорматВыгрузки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособВыгрузкиПриИзменении(Элемент)
	СпособВыгрузкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПутьВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДополнительныеПараметры = Новый Структура;                      
	ДополнительныеПараметры.Вставить("РежимРаботы",РежимДиалогаВыбораФайла.ВыборКаталога);
	ДополнительныеПараметры.Вставить("Каталог",ОбработкаВыгрузки.ПутьВыгрузки);
	
	ДополнительныеПараметры.Вставить("ПервичнаяПроверка","Результат <> Неопределено");
	ДополнительныеПараметры.Вставить("ОбработкаРезультата",Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма, ДополнительныеПараметры));
	
	ДополнительныеПараметры.Вставить("ОбработкаВыгрузки",ОбработкаВыгрузки);
	
	БюджетнаяОтчетностьКлиент.ВыбратьФайлСпростойОбработкой(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастройкиФормата_Подключаемый(Элемент)
	
	// Если изменилось значение доп.настройки, нужно отразить это же изменение в таблице доп.настроек.
	ПриИзмененииНастройкиФорматаНаСервере(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаНастройкиФормата_Подключаемый(Элемент, СтандартнаяОбработка)
	
	// Для элементов доп.настроек со списком выбора очистка не допускается. 
	Если Элемент.СписокВыбора.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ ИНФОРМАЦИОННЫЙ ЦЕНТР

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	БюджетнаяОтчетностьКлиентПереопределяемый.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	БюджетнаяОтчетностьКлиентПереопределяемый.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

// ПРОЦЕДУРЫ ПОДСИСТЕМЫ ИНФОРМАЦИОННЫЙ ЦЕНТР
////////////////////////////////////////////////////////////////////////////////


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаВыгрузок

&НаКлиенте
Процедура ТаблицаВыгрузокОтметкаПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаВыгрузок.ТекущиеДанные;
	
	ОбработатьИзменениеОтметкиОтчета(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеОтметкиОтчета(ТекДанные)
	
	НайденыеСтроки = ОбработкаВыгрузки.ОтчетыДляВыгрузки.НайтиСтроки(Новый Структура("Отчет",ТекДанные.Отчет));
	
	Если ТекДанные.Отметка Тогда	
	
		Если НЕ ЗначениеЗаполнено(НайденыеСтроки) Тогда 
			
			НоваяСтрока = ОбработкаВыгрузки.ОтчетыДляВыгрузки.Добавить();
			НоваяСтрока.Отчет = ТекДанные.Отчет;
			
			Элементы.ТаблицаФайловВыгружать.ТолькоПросмотр = Ложь;
		КонецЕсли; 
		
	Иначе
		
		Для Каждого СтрокаДляУдаления Из НайденыеСтроки Цикл 
			
			ОбработкаВыгрузки.ОтчетыДляВыгрузки.Удалить(СтрокаДляУдаления);
			
		КонецЦикла;
		
		СтрокиРанееОтмеченныхФайлов = ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.НайтиСтроки(Новый Структура("Отчет",ТекДанные.Отчет));
		Для Каждого СтрТЧ Из СтрокиРанееОтмеченныхФайлов Цикл
			ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.Удалить(СтрТЧ);	
		КонецЦикла;
		
		Для Каждого СтрТЧ Из ТаблицаФайлов.НайтиСтроки(Новый Структура("Отчет",ТекДанные.Отчет)) Цикл
			СтрТЧ.Выгружать = Ложь;	
		КонецЦикла;
		
		ОбновитьПодписьКоличестваФайлов(ЭтотОбъект);
		
		Элементы.ТаблицаФайловВыгружать.ТолькоПросмотр = Истина;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыгрузокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(,Элементы.ТаблицаВыгрузок.ТекущиеДанные.Отчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыгрузокПередНачаломИзменения(Элемент, Отказ)
	
	Если Элементы.ТаблицаВыгрузок.ТекущийЭлемент.Имя = "ТаблицаВыгрузокПолеИстоникСобытийНажатия" Тогда 
		
		ТекущиеДанные = Элементы.ТаблицаВыгрузок.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;	
		Если не ЗначениеЗаполнено(ТекущиеДанные.Пояснение) Тогда 
			Возврат;
		КонецЕсли;	
		
		ПоказатьПредупреждение(,ТекущиеДанные.Пояснение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыгрузокПриАктивизацииСтроки(Элемент)
	ТекущийОтчет = Неопределено;
	
	ТекДанные = Элементы.ТаблицаВыгрузок.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда 
		ТекущийОтчет = ТекДанные.Отчет;
	КонецЕсли;	
	
	Если ВозможнаВыгрузкаПрисоединенныхФайлов Тогда
		ПодключитьОбработчикОжидания("ОбновитьТаблицуФайлов",0.2,Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуФайлов() Экспорт
	
	Если ЗначениеЗаполнено(ПредыдущийОтчет) Тогда
		//при открытии формы нельзя определять настройки по текущим значениям, 
		//поэтому определяем только если это переключение на другую строку
		Если ЗначениеЗаполнено(КоличествоФайлов)
			И Элементы.Файлы.Скрыта() Тогда
			РазворачиватьТаблицуФайлов = Ложь;
		ИначеЕсли ЗначениеЗаполнено(КоличествоФайлов)
			И Элементы.Файлы.Скрыта() = Ложь тогда
			РазворачиватьТаблицуФайлов = Истина;
		ИначеЕсли НЕ ЗначениеЗаполнено(КоличествоФайлов)
			И Элементы.Файлы.Скрыта() = Ложь тогда
			РазворачиватьТаблицуБезФайлов = Истина;
		ИначеЕсли НЕ ЗначениеЗаполнено(КоличествоФайлов)
			И Элементы.Файлы.Скрыта() тогда
			РазворачиватьТаблицуБезФайлов = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСписокФайловНаСервере();
	
	Если ЗначениеЗаполнено(КоличествоФайлов)
		И РазворачиватьТаблицуФайлов
		И Элементы.Файлы.Скрыта() Тогда
		Элементы.Файлы.Показать();
	ИначеЕсли НЕ ЗначениеЗаполнено(КоличествоФайлов)
		И РазворачиватьТаблицуБезФайлов = Ложь
		И Элементы.Файлы.Скрыта() = Ложь Тогда
		Элементы.Файлы.Скрыть();
	КонецЕсли;
	
	ПредыдущийОтчет = ТекущийОтчет;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаФайлов

&НаКлиенте
Процедура ТаблицаФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПоказатьЗначение(, ТекДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФайловВыгружатьПриИзменении(Элемент)
	
	ОбновитьПодписьКоличестваФайлов(ЭтотОбъект);
	
	ТекДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;
	
	Если ТекДанные.Выгружать Тогда
		
		НоваяСтрока = ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.Добавить();
		НоваяСтрока.Отчет = ТекДанные.Отчет;
		НоваяСтрока.СсылкаНаПрисоединенныйФайл = ТекДанные.Ссылка;
		
	Иначе
		
		НайденыеСтроки = ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.НайтиСтроки(Новый Структура("Отчет,СсылкаНаПрисоединенныйФайл",ТекДанные.Отчет,ТекДанные.Ссылка));		
		
		Для Каждого СтрокаДляУдаления Из НайденыеСтроки Цикл 			
			ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.Удалить(СтрокаДляУдаления);			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПереключитьВидимостьЭлеменовОбменаСоСводомОтчетов(ОткрытиеНаСервере = Ложь)
	
	Если РежимРаботы = 1 Тогда
		Элементы.ФормаУстановитьОбычныйРежим.Картинка = Новый Картинка; 
		Элементы.ФормаУстановитьРежимОбменаСоСводом.Картинка = БиблиотекаКартинок.ПереместитьВправо;
	Иначе
		Элементы.ФормаУстановитьОбычныйРежим.Картинка = БиблиотекаКартинок.ПереместитьВправо; 
		Элементы.ФормаУстановитьРежимОбменаСоСводом.Картинка = Новый Картинка;
	КонецЕсли;
	
	ЭтоОбменЧерезСервис = РежимРаботы = 1 И ИспользоватьОбменСоСводомОтчетов;
	
	//показываем
	Элементы.ГруппаШапка.Видимость = ЭтоОбменЧерезСервис;
	Элементы.ФормаГруппаОбменСоСводом.Видимость = ЭтоОбменЧерезСервис;
	Элементы.ГруппаОтправкаПакетов.Видимость = ЭтоОбменЧерезСервис;
	Элементы.СписокПротоколовПолучитьСформированныеПротоколы.Видимость = ЭтоОбменЧерезСервис;	
	//скрываем
	Элементы.ГруппаОсновныеНастройки.Видимость = НЕ ЭтоОбменЧерезСервис;		
	Элементы.ГруппаОтборовПоПериоду.Видимость = НЕ ЭтоОбменЧерезСервис;
	Элементы.СтраницыПараметровВыгрузки.Видимость = НЕ ЭтоОбменЧерезСервис;
	
	Если ЭтоОбменЧерезСервис Тогда
		Элементы.ТаблицаВыгрузокВыгрузитьОтчеты.Заголовок = "Подготовить пакеты отчетов";
	Иначе
		Элементы.ТаблицаВыгрузокВыгрузитьОтчеты.Заголовок = "Выгрузить отчеты";
	КонецЕсли;
		
	//Если заполнена учетная запись, загрузить формат и способ из нее, иначе очистить.
	УчетнаяЗаписьПриИзмененииНаСервере();

	//Если это обмен через сервис, то следует использовать отбор по рабочему периоду, 
	//а не по периоду.
	
	УстановитьОтборы(ОткрытиеНаСервере);
КонецПроцедуры

&НаСервере
Процедура УстановитьЗапросСпискаВыгрузок()
	
	Если ВыгрузкаРегламентированнойБухгалтерскойОтчетностиПовтИсп.ТранспортИспользуется("Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС") Тогда 
		
		СписокВыгрузок.ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Ссылка,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.ПометкаУдаления,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Номер,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Дата,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Проведен,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Организация,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Период КАК ПериодОтчета,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.ФорматВыгрузки,
		|	ВЫБОР
		|		КОГДА ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Ссылка ССЫЛКА Документ.ЭлектронныйДокументБухгалтерскийОтчет
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС)
		|		ИНАЧЕ ВыгрузкиРегламентированныхБухгалтерскихОтчетов.СпособВыгрузки
		|	КОНЕЦ КАК СпособВыгрузки,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Тип,
		|	ВЫБОР
		|		КОГДА ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Ссылка ССЫЛКА Документ.ЭлектронныйДокументБухгалтерскийОтчет
		|			ТОГДА ЕСТЬNULL(СтатусыОтправки.Статус, ЗНАЧЕНИЕ(Перечисление.СостоянияПакетаОтчетов.Сформирован))
		|		ИНАЧЕ ЕСТЬNULL(ИсторияСостоянийПакетаОтчетовСрезПоследних.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияПакетаОтчетов.Сформирован))
		|	КОНЕЦ КАК Состояние
		|ИЗ
		|	ЖурналДокументов.ВыгрузкиРегламентированныхБухгалтерскихОтчетов КАК ВыгрузкиРегламентированныхБухгалтерскихОтчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОтправки КАК СтатусыОтправки
		|		ПО (ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Ссылка ССЫЛКА Документ.ЭлектронныйДокументБухгалтерскийОтчет)
		|			И ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Ссылка = СтатусыОтправки.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСостоянийПакетаОтчетов.СрезПоследних(, {(ПакетОтчетов) КАК Ссылка}) КАК ИсторияСостоянийПакетаОтчетовСрезПоследних
		|		ПО (ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Ссылка ССЫЛКА Документ.ПакетВыгрузкиОтчетности)
		|			И ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Ссылка = ИсторияСостоянийПакетаОтчетовСрезПоследних.ПакетОтчетов
		|ГДЕ
		|	(НЕ ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Ссылка ССЫЛКА Документ.ПакетВыгрузкиОтчетности
		|			ИЛИ ВыгрузкиРегламентированныхБухгалтерскихОтчетов.СпособВыгрузки <> ЗНАЧЕНИЕ(Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС))";
		
	Иначе 
		СписокВыгрузок.ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Ссылка,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.ПометкаУдаления,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Номер,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Дата,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Проведен,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Организация,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Период КАК ПериодОтчета,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.ФорматВыгрузки,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.СпособВыгрузки,
		|	ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Тип,
		|	ЕСТЬNULL(ИсторияСостоянийПакетаОтчетовСрезПоследних.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияПакетаОтчетов.Сформирован)) КАК Состояние
		|ИЗ
		|	ЖурналДокументов.ВыгрузкиРегламентированныхБухгалтерскихОтчетов КАК ВыгрузкиРегламентированныхБухгалтерскихОтчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСостоянийПакетаОтчетов.СрезПоследних(, {(ПакетОтчетов) КАК Ссылка}) КАК ИсторияСостоянийПакетаОтчетовСрезПоследних
		|		ПО ВыгрузкиРегламентированныхБухгалтерскихОтчетов.Ссылка = ИсторияСостоянийПакетаОтчетовСрезПоследних.ПакетОтчетов"
		
	КонецЕсли;	
	
	
КонецПроцедуры	

&НаСервере
Процедура ИницализацияСтраницыВыгрузка()
	ВыгрузкаДоступна = ОбщегоНазначения.ПодсистемаСуществует("УчетГосУчрежденийПодсистемы.РегламентированнаяБухОтчетность.ВыгрузкаРегламентированнойБухгалтерскойОтчетности");
	ВыгрузкаДоступна = ВыгрузкаДоступна И ПравоДоступа("Использование",Метаданные.Обработки.ВыгрузкаОтчетностиОрганизаций);
	
	Если не ВыгрузкаДоступна Тогда 
		Элементы.ГруппаСтраницаВыгрузка.Видимость = Ложь;
		
	Иначе 	
		ЗагрузитьНастройкиВыгрузкиОтчетов();
		ЗагрузитьНастройкиСпособаВыгрузки();
		ЗагрузитьДополнительныеНастройкиФормата();
		
		УстановитьОграниченияНаСпособВыгрузки();
		ОбновитьДопДанныеСтрок(Истина);
		
		УправлениеСтраницамиПараметровВыгрузки();
		УправлениеВидимостьюСтраницыЭЦП();
		УправлениеВидимостьюДопПараметров();
		УправлениеВидимостьюКнопкиСправки();
		
		ПереключитьВидимостьЭлеменовОбменаСоСводомОтчетов();
		
		ОбновитьНастройкиВыгрузкиПрисоединенныхФайлов();
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьСтрокуВыгрузокНаОтчет(Отчет)
	
	Если Отчет = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицыВыгрузок из ТаблицаВыгрузок Цикл 
		
		Если СтрокаТаблицыВыгрузок.Отчет <> Отчет Тогда 
			Продолжить;
		КонецЕсли;	
		
		Элементы.ТаблицаВыгрузок.ТекущаяСтрока = СтрокаТаблицыВыгрузок.ПолучитьИдентификатор();
		Прервать;
		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьНастройкиВыгрузкиПрисоединенныхФайлов()
	
	ВозможнаВыгрузкаПрисоединенныхФайлов = Ложь;
	Если ЗначениеЗаполнено(ОбработкаВыгрузки.ФорматВыгрузки) Тогда
		ВозможнаВыгрузкаПрисоединенныхФайлов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбработкаВыгрузки.ФорматВыгрузки,"ВозможнаВыгрузкаПрисоединенныхФайлов");
	КонецЕсли;
		
	Если ВозможнаВыгрузкаПрисоединенныхФайлов Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Файлы","Видимость",Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ОбработкаВыгрузкиПрисоединенныеФайлыДляВыгрузкиКоличествоСтрок","Видимость",Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияШтФайлов","Видимость",Истина);

		ОбновитьСписокФайловНаСервере();
	Иначе
		ТаблицаФайлов.Очистить();
		ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.Очистить();
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Файлы","Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ОбработкаВыгрузкиПрисоединенныеФайлыДляВыгрузкиКоличествоСтрок","Видимость",Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДекорацияШтФайлов","Видимость",Ложь);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивОрганизаций()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организации.Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Процедура СоздатьДеревоВидовОтчетов()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	0 КАК Использовать,
	|	ВидыОтчетов.Ссылка КАК Значение,
	|	ВидыОтчетов.ЭтоГруппа,
	|	ВЫБОР
	|		КОГДА ВидыОтчетов.ЭтоГруппа
	|				И НЕ ВидыОтчетов.ПометкаУдаления
	|			ТОГДА 0
	|		КОГДА ВидыОтчетов.ЭтоГруппа
	|				И ВидыОтчетов.ПометкаУдаления
	|			ТОГДА 2
	|		КОГДА НЕ ВидыОтчетов.ЭтоГруппа
	|				И НЕ ВидыОтчетов.ПометкаУдаления
	|			ТОГДА 1
	|		КОГДА НЕ ВидыОтчетов.ЭтоГруппа
	|				И ВидыОтчетов.ПометкаУдаления
	|			ТОГДА 3
	|	КОНЕЦ КАК ИндексКартинки
	|ИЗ
	|	Справочник.ВидыОтчетов КАК ВидыОтчетов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыОтчетов.Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	дзДеревоВидовОтчетов = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	УдалитьПустыеГруппыИзДерева(дзДеревоВидовОтчетов);
	ЗначениеВРеквизитФормы(дзДеревоВидовОтчетов,"ДеревоВидовОтчетов");

КонецПроцедуры

&НаСервере
Процедура УдалитьПустыеГруппыИзДерева(Дерево)

	СтрокиКУдалению = Новый Массив;
	
	Для Каждого Стр Из Дерево.Строки Цикл
		Если Стр.ЭтоГруппа Тогда
			
			УдалитьПустыеГруппыИзДерева(Стр);
			
			Если Стр.Строки.Количество() = 0 Тогда
				СтрокиКУдалению.Добавить(Стр);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

	Для Каждого Стр Из СтрокиКУдалению Цикл
		Дерево.Строки.Удалить(Стр);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИспользованиеВДереве(СтрокаДерева, Значение)
	
	ИзменитьФлажкиПодчиненныхЭлементов(СтрокаДерева,Значение);
	ИзменитьФлажкиРодительскихЭлементов(СтрокаДерева);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажкиПодчиненныхЭлементов(СтрокаДерева, ЗначениеФлажка)
	
	Потомки = СтрокаДерева.ПолучитьЭлементы();
	
	Для Каждого Потомок Из Потомки Цикл
		
		Потомок.Использовать = ЗначениеФлажка;
		
		ИзменитьФлажкиПодчиненныхЭлементов(Потомок, ЗначениеФлажка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлажкиРодительскихЭлементов(СтрокаДерева)
	
	Если ТипЗнч(СтрокаДерева) <> Тип("ДанныеФормыЭлементДерева") Тогда 
		Возврат;
	КонецЕсли;              
	
	Родитель = СтрокаДерева.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ПотомкиРодителя = Родитель.ПолучитьЭлементы();
	
	МассивЗначенийПотомков = Новый Массив;
	Для Каждого Потомок из ПотомкиРодителя Цикл
		
		Если МассивЗначенийПотомков.Найти(Потомок.Использовать) <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивЗначенийПотомков.Добавить(Потомок.Использовать);
		
		Если МассивЗначенийПотомков.Количество() > 1 Тогда 
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;
	
	Если МассивЗначенийПотомков.Количество() > 1 Тогда 
		Родитель.Использовать = 2;
		
	ИначеЕсли МассивЗначенийПотомков.Количество() = 1 Тогда 
		Родитель.Использовать = МассивЗначенийПотомков[0];
	КонецЕсли;	
	
	ИзменитьФлажкиРодительскихЭлементов(Родитель);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьИспользованиеРодителяВДереве(ДетальнаяСтрока)
	
	СтрокаРодитель = ДетальнаяСтрока.Родитель;
	Если НЕ СтрокаРодитель = Неопределено И СтрокаРодитель.Использовать = 0 Тогда
		СтрокаРодитель.Использовать = 2;
		УстановитьИспользованиеРодителяВДереве(СтрокаРодитель);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборВидОтчетов()
	
	ОтборВидОтчетов.Очистить();
	
	ПолучитьСписокВыбранныхЭлементовРекурсивно(ДеревоВидовОтчетов.ПолучитьЭлементы())
	
КонецПроцедуры	

&НаКлиенте
Процедура ПолучитьСписокВыбранныхЭлементовРекурсивно(КоллекцияЭлементов)

	Для Каждого ЭлементДерева Из КоллекцияЭлементов Цикл
		
		Если ЭлементДерева.ЭтоГруппа Тогда
			ПолучитьСписокВыбранныхЭлементовРекурсивно(ЭлементДерева.ПолучитьЭлементы());
			
		ИначеЕсли ЭлементДерева.Использовать = 1 Тогда
			ОтборВидОтчетов.Добавить(ЭлементДерева.Значение);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ПолучитьСписокВыбранныхЭлементов()

&НаКлиенте
Функция ПолучитьТекущиеЗначенияРеквизитовОтбора()

	ЗначенияРеквизитов = Новый Структура;
	
	Если ИспользоватьОтборОрганизаций и ОтборОрганизация.Количество() Тогда
		
		ЗначенияРеквизитов.Вставить("Организация", ОтборОрганизация[0].Значение);
		
	КонецЕсли;
	
	Если РежимРаботы = 1 Тогда
		Если ЗначениеЗаполнено(РабочийПериод) Тогда
			ЗначенияРеквизитов.Вставить("ПериодОтчета",ПолучитьПериодРП(РабочийПериод));
		КонецЕсли;		
	Иначе
		Если ИспользоватьОтборПериодов и ОтборПериодов.Количество() Тогда
			
			ЗначенияРеквизитов.Вставить("ПериодОтчета", ОтборПериодов[0].Значение);
			
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользоватьОтборИФО И ОтборИФО.Количество() Тогда
		 
		ЗначенияРеквизитов.Вставить("ИФО", ОтборИФО[0].Значение);
		 
	КонецЕсли;

	Возврат ЗначенияРеквизитов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПериодРП(РабочийПериод)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочийПериод,"Период");	
КонецФункции

&НаСервере
Процедура УстановитьОтборы(ОткрытиеНаСервере = Ложь)
	
	ЭтоОбменСоСводомОтчетов = РежимРаботы=1 И ИспользоватьОбменСоСводомОтчетов;
	Если ЭтоОбменСоСводомОтчетов Тогда
		КодСценария = "";
		ТекОтборПериодов = Неопределено;
		Если ЗначениеЗаполнено(РабочийПериод) Тогда
			РеквизитыРП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РабочийПериод,"Период,КодСценария");
			ТекОтборПериодов = РеквизитыРП.Период;
			КодСценария = РеквизитыРП.КодСценария;
		КонецЕсли;
		ТекИспользоватьОтборПериодов = ЗначениеЗаполнено(ТекОтборПериодов);
		СпособСравненияПериодов = ВидСравненияКомпоновкиДанных.Равно;
	Иначе
		ТекИспользоватьОтборПериодов = ИспользоватьОтборПериодов;
		ТекОтборПериодов = ОтборПериодов;
		Если ВключатьПодчиненныеПериоды Тогда
			СпособСравненияПериодов = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		Иначе
			СпособСравненияПериодов = ВидСравненияКомпоновкиДанных.ВСписке;
		КонецЕсли;
	КонецЕсли;
	
	// Отчеты
	Если Элементы.ЖурналыДокументов.ТекущаяСтраница = Элементы.ГруппаСтраницаОтчеты Тогда 
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.КомпоновщикНастроек.Настройки.Отбор, "Организация", ОтборОрганизация, ВидСравненияКомпоновкиДанных.ВСписке,,ИспользоватьОтборОрганизаций);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.КомпоновщикНастроек.Настройки.Отбор, "ПериодОтчета", ТекОтборПериодов, СпособСравненияПериодов,,ТекИспользоватьОтборПериодов);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.КомпоновщикНастроек.Настройки.Отбор, "ИФО", ОтборИФО, ВидСравненияКомпоновкиДанных.ВСписке,,ИспользоватьОтборИФО);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.КомпоновщикНастроек.Настройки.Отбор, "ВидОтчета", ОтборВидОтчетов, ВидСравненияКомпоновкиДанных.ВСписке,,ИспользоватьОтборВидовОтчета);
		
	// Выгрузки
	ИначеЕсли Элементы.ЖурналыДокументов.ТекущаяСтраница = Элементы.ГруппаСтраницаВыгрузка Тогда
		
		Если НЕ ОткрытиеНаСервере И ЭтоОбменСоСводомОтчетов 
			И НЕ ЗначениеЗаполнено(РабочийПериод) Тогда
			
			ТаблицаВыгрузок.Очистить();
			Элементы.РабочийПериод.АвтоОтметкаНезаполненного = Истина;
			Текст = Нстр("ru='Выгрузка отчетов выполняется в рамках рабочего периода. Укажите рабочий период.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,"РабочийПериод");
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(АдресСхемыТаблицыВыгрузок) Тогда 
			ПодготовитьСхемуСпискаВыгрузок();
		КонецЕсли;

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиСхемыВыгрузок.Настройки.Отбор, "Организация",	ОтборОрганизация,	ВидСравненияКомпоновкиДанных.ВСписке,,ИспользоватьОтборОрганизаций);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиСхемыВыгрузок.Настройки.Отбор, "ПериодОтчета",ТекОтборПериодов,		СпособСравненияПериодов,,ТекИспользоватьОтборПериодов);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиСхемыВыгрузок.Настройки.Отбор, "ИФО",			ОтборИФО,			ВидСравненияКомпоновкиДанных.ВСписке,,ИспользоватьОтборИФО);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиСхемыВыгрузок.Настройки.Отбор, "ВидОтчета",	ОтборВидОтчетов,	ВидСравненияКомпоновкиДанных.ВСписке,,ИспользоватьОтборВидовОтчета);
		
		Если ОтображатьТолькоВыгружаемые Тогда 
			Элементы.ТаблицаВыгрузок.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("НельзяВыгрузить",Ложь));
		Иначе 
			Элементы.ТаблицаВыгрузок.ОтборСтрок = Неопределено;
		КонецЕсли;
		
		ЗаполнитьТаблицуВыгрузокПоОтборам();
			
	// Результататы выгрузок
	ИначеЕсли Элементы.ЖурналыДокументов.ТекущаяСтраница = Элементы.ГруппаСтраницаРезультатыВыгрузок Тогда 
		
		ДополнительныеДанные = СобратьДанныеДляОтборов();
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокВыгрузок.КомпоновщикНастроек.Настройки.Отбор, "Организация", ОтборОрганизация, ВидСравненияКомпоновкиДанных.ВСписке,,ИспользоватьОтборОрганизаций);
		
		Если ЭтоОбменСоСводомОтчетов Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокВыгрузок.КомпоновщикНастроек.Настройки.Отбор, "ПериодОтчета", РабочийПериод, СпособСравненияПериодов,,ТекИспользоватьОтборПериодов);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокВыгрузок.КомпоновщикНастроек.Настройки.Отбор, "ПериодОтчета", ТекОтборПериодов, СпособСравненияПериодов,,ТекИспользоватьОтборПериодов);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокВыгрузок.КомпоновщикНастроек.Настройки.Отбор, , ДополнительныеДанные.МассивПоИФО, ВидСравненияКомпоновкиДанных.ВСписке, "СсылкаДляИФО",ИспользоватьОтборИФО);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокВыгрузок.КомпоновщикНастроек.Настройки.Отбор, , ДополнительныеДанные.МассивПоВиду, ВидСравненияКомпоновкиДанных.ВСписке, "СсылкаДляВида",ИспользоватьОтборВидовОтчета);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокВыгрузок.КомпоновщикНастроек.Настройки.Отбор, "СпособВыгрузки",	ОбменЧерезВебСервис,	ВидСравненияКомпоновкиДанных.Равно,,ЭтоОбменСоСводомОтчетов);
		
		//в бгу1 нужно править будет
		
	//Пакеты к отправке
	ИначеЕсли Элементы.ЖурналыДокументов.ТекущаяСтраница = Элементы.ГруппаОтправкаПакетов Тогда
			
		ЗаполнитьТаблицуПодготовленныхПакетов();
		
	//Полученные протоколы
	ИначеЕсли Элементы.ЖурналыДокументов.ТекущаяСтраница = Элементы.ГруппаПротоколы Тогда 
		
		МассивРП = Новый Массив;
		Если ЗначениеЗаполнено(РабочийПериод) Тогда
			МассивРП.Добавить(РабочийПериод);
		КонецЕсли;
		МассивРП.Добавить(Справочники.РабочиеПериодыПредоставленияОтчетности.ПустаяСсылка());
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокПротоколов.КомпоновщикНастроек.Настройки.Отбор, "Организация", ОтборОрганизация, ВидСравненияКомпоновкиДанных.ВСписке,,ИспользоватьОтборОрганизаций);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокПротоколов.КомпоновщикНастроек.Настройки.Отбор, "РабочийПериод", МассивРП, ВидСравненияКомпоновкиДанных.ВСписке,,ЗначениеЗаполнено(РабочийПериод));

		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
функция СобратьДанныеДляОтборов()
	
	Результат = Новый Структура;
	Результат.Вставить("МассивПоИФО",Новый Массив);
	Результат.Вставить("МассивПоВиду",Новый Массив);
	
	Если ИспользоватьОтборИФО Тогда 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИФО",ОтборИФО.ВыгрузитьЗначения());
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПакетВыгрузкиОтчетностиОтчетыПакета.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПакетВыгрузкиОтчетности.ОтчетыПакета КАК ПакетВыгрузкиОтчетностиОтчетыПакета
		|ГДЕ
		|	ПакетВыгрузкиОтчетностиОтчетыПакета.ОтчетСсылка.ИФО В(&ИФО)";
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат.МассивПоИФО,Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
		Если ВыгрузкаРегламентированнойБухгалтерскойОтчетностиПовтИсп.ТранспортИспользуется("Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС") Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЭлектронныйДокументБухгалтерскийОтчетЭкземплярыОтчетов.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЭлектронныйДокументБухгалтерскийОтчет.ЭкземплярыОтчетов КАК ЭлектронныйДокументБухгалтерскийОтчетЭкземплярыОтчетов
			|ГДЕ
			|	ЭлектронныйДокументБухгалтерскийОтчетЭкземплярыОтчетов.Отчет.ИФО В(&ИФО)";
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат.МассивПоИФО,Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	Если ИспользоватьОтборВидовОтчета Тогда 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВидыОтчетов",ОтборВидОтчетов.ВыгрузитьЗначения());
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПакетВыгрузкиОтчетностиОтчетыПакета.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПакетВыгрузкиОтчетности.ОтчетыПакета КАК ПакетВыгрузкиОтчетностиОтчетыПакета
		|ГДЕ
		|	ПакетВыгрузкиОтчетностиОтчетыПакета.ОтчетСсылка.ВидОтчета В(&ВидыОтчетов)";
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат.МассивПоВиду ,Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
		Если ВыгрузкаРегламентированнойБухгалтерскойОтчетностиПовтИсп.ТранспортИспользуется("Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС") Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЭлектронныйДокументБухгалтерскийОтчетЭкземплярыОтчетов.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЭлектронныйДокументБухгалтерскийОтчет.ЭкземплярыОтчетов КАК ЭлектронныйДокументБухгалтерскийОтчетЭкземплярыОтчетов
			|ГДЕ
			|	ЭлектронныйДокументБухгалтерскийОтчетЭкземплярыОтчетов.Отчет.ВидОтчета В(&ВидыОтчетов)";
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат.МассивПоВиду ,Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
			
		КонецЕсли;
		
		
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	ИзменитьФлажкиПодчиненныхЭлементов(ДеревоВидовОтчетов, Ложь);
	ОбновитьОтборВидОтчетов();
	
	УстановитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	ИзменитьФлажкиПодчиненныхЭлементов(ДеревоВидовОтчетов, Истина);
	ОбновитьОтборВидОтчетов();

	
	УстановитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)
	Для Каждого Стр Из ДеревоВидовОтчетов.ПолучитьЭлементы() Цикл
		Элементы.ДеревоВидовОтчетов.Развернуть(Стр.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	Для Каждого Стр Из ДеревоВидовОтчетов.ПолучитьЭлементы() Цикл
		Элементы.ДеревоВидовОтчетов.Свернуть(Стр.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееОбОтчете(Команда)
	Если Элементы.ДеревоВидовОтчетов.ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,НСтр("ru='Выберите отчет!'"));
		Возврат;
	КонецЕсли;
	
	Если Элементы.ДеревоВидовОтчетов.ТекущиеДанные.ЭтоГруппа = Истина Тогда
		ПоказатьПредупреждение(,НСтр("ru='Функция недоступна для группы отчетов!'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОтчета", Элементы.ДеревоВидовОтчетов.ТекущиеДанные.Значение);
	
	ОткрытьФорму("Справочник.ВидыОтчетов.Форма.ФормаРедакций", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СравнитьСУчетнымиДанными(Команда)
	ОчиститьСообщения();
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='В списке отчетов не выбран отчет.'"));
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ТекДанные) <> Тип("ДанныеФормыСтруктура") Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ТекДанные.ЕстьДанныеЗаполнения Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Для данного отчета отсутствуют сохраненные данные автозаполнения.'"));
		Возврат;
	КонецЕсли;
	
	БюджетнаяОтчетностьКлиент.СравнитьСДаннымиАвтозаполнения(ЭтотОбъект,ТекДанные.Ссылка,УникальныйИдентификатор,Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура СправочникОтчетов(Команда)
	
	ОткрытьФорму("Справочник.ВидыОтчетов.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетныеПериоды(Команда)
	
	ОткрытьФорму("Справочник.Периоды.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтрольныхСоотношений(Команда)
	
	ОткрытьФорму("Справочник.КонтрольныеСоотношения.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтчетности(Команда)
	
	ОткрытьФорму("ОбщаяФорма.НастройкаРегламентированнойБухОтчетности");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого СтрокаТаблицы Из ТаблицаВыгрузок Цикл 
		
		Если СтрокаТаблицы.НельзяВыгрузить Тогда 
			Продолжить;
		КонецЕсли;	
		
		СтрокаТаблицы.Отметка = Истина;
		
	КонецЦикла;	
		
	ЗаполнитьТаблицуПоОтметкам();

КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуВсе(Команда)
		
	СнятьОтметкуВсеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СнятьОтметкуВсеНаСервере()
	
	Для Каждого СтрокаТаблицы Из ТаблицаВыгрузок Цикл 
		
		СтрокаТаблицы.Отметка = Ложь;
		
	КонецЦикла;
	
	ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.Очистить();
	ЗаполнитьТаблицуПоОтметкам();
	
	Если ВозможнаВыгрузкаПрисоединенныхФайлов Тогда
		
		Элементы.ТаблицаФайловВыгружать.ТолькоПросмотр = Истина;
		Для Каждого СтрТЧ Из ТаблицаФайлов Цикл
			СтрТЧ.Выгружать = Ложь;
		КонецЦикла;
		
		ОбновитьПодписьКоличестваФайлов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыделенные(Команда)
	Для Каждого ИдВыделеннаяСтрока Из Элементы.ТаблицаВыгрузок.ВыделенныеСтроки Цикл 
		
		ВыделеннаяСтрока = ТаблицаВыгрузок.НайтиПоИдентификатору(ИдВыделеннаяСтрока);
		
		Если ВыделеннаяСтрока.НельзяВыгрузить Тогда 
			Продолжить;
		КонецЕсли;	
		
		ВыделеннаяСтрока.Отметка = Истина;
		
	КонецЦикла;
	
	ЗаполнитьТаблицуПоОтметкам();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуВыделенных(Команда)
	Для Каждого ИдВыделеннаяСтрока Из Элементы.ТаблицаВыгрузок.ВыделенныеСтроки Цикл 
		
		ВыделеннаяСтрока = ТаблицаВыгрузок.НайтиПоИдентификатору(ИдВыделеннаяСтрока);
		ВыделеннаяСтрока.Отметка = Ложь;
		
	КонецЦикла;
	
	СнятьОтметкуВыделенныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СнятьОтметкуВыделенныхНаСервере()
	
	ЗаполнитьТаблицуПоОтметкам();
	
	СоответствиеОтчетов = Новый Соответствие;
	Для Каждого СтрОтчета Из ОбработкаВыгрузки.ОтчетыДляВыгрузки Цикл
		СоответствиеОтчетов.Вставить(СтрОтчета.Отчет, Истина);	
	КонецЦикла;
	
	МассивСтрокКУдалению = Новый Массив;
	Для Каждого СтрФайла Из ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки Цикл
		Если СоответствиеОтчетов.Получить(СтрФайла.Отчет) <> Истина Тогда
			МассивСтрокКУдалению.Добавить(СтрФайла);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлМас Из МассивСтрокКУдалению Цикл
		ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.Удалить(ЭлМас);	
	КонецЦикла;
	
	Для Каждого СтрТЧ Из ТаблицаФайлов Цикл
		Если СоответствиеОтчетов.Получить(СтрТЧ.Отчет) <> Истина Тогда
	    	СтрТЧ.Выгружать = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьПодписьКоличестваФайлов(ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура ФорматыВыгрузки(Команда)
	ОткрытьФорму("Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭЦП(Команда)
	
	СтруктураДанных = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.СформироватьСтруктуруДанныхДляУстановкиПодписей();
	СтруктураДанных.ОписаниеПодписываемогоОбъекта = НСтр("ru = 'создаваемые пакеты'");
	СтруктураДанных.УидФормы = УникальныйИдентификатор;
	СтруктураДанных.РежимПредварительногоВыбораСертификатов = Истина;
	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.ВыбратьСертификатыДляПодписи(СтруктураДанных, ЭтаФорма);
	
	ДобавитьСертификаты(СтруктураДанных);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСертификат(Команда)
	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.ОткрытьСертификат(Элементы.ЭлектронныеЦифровыеПодписи.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчеты(Команда)
	
	Если РежимРаботы = 1 Тогда
		Для Каждого СтрТЧ Из ОбработкаВыгрузки.ДополнительныеНастройкиФормата Цикл
			Если СтрТЧ.Имя = "КодСценарияПолучателя" Тогда
				СтрТЧ.Значение = КодСценария;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПоместитьЗначенияНаСервере();
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	Если РежимРаботы = 1 Тогда
		ОбработкаВыгрузки.РабочийПериод = РабочийПериод;
	КонецЕсли;
	
	СтруктураДанных = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.СформироватьСтруктуруФормированияПакетов();
	СтруктураДанных.Обработка = ОбработкаВыгрузки;
	
	ОбработкаЗавершения = Новый ОписаниеОповещения("ОбработкаЗавершенияВыгрузки",ЭтаФорма,Неопределено);
	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.СформироватьПакеты(СтруктураДанных, ЭтаФорма, ОбработкаЗавершения);
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьЗначенияНаСервере()
	ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиентСервер.ПоместитьЗначенияВХранилища(ОбработкаВыгрузки.ДополнительныеНастройкиФормата);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоВыгружаемые(Команда)
	
	ОтображатьТолькоВыгружаемые = не ОтображатьТолькоВыгружаемые;
	УстановитьОтборы();
	УправлениеКнопкойТолькоВыгружаемые();

КонецПроцедуры

&НаКлиенте
Процедура СправкаПоФормату(Команда)
	
	СтруктураПараметов = Новый Структура;
	СтруктураПараметов.Вставить("Формат",ОбработкаВыгрузки.ФорматВыгрузки);
	
	ОткрытьФорму("Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности.Форма.ФормаСправки",СтруктураПараметов,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокФайлов(Команда)
	ОбновитьСписокФайловНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокОтчетов(Команда)
	УстановитьОтборы();
КонецПроцедуры

#КонецОбласти


&НаСервере
Процедура ПодготовитьСхемуСпискаВыгрузок()
	
	Схема = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = Схема.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "Основной"; 
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = Схема.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "Основной";
	НаборДанных.ИсточникДанных = "Основной";
	
	Если ИспользоватьОбменСоСводомОтчетов Тогда
		НаборДанных.Запрос = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УниверсальныйРегламентированныйОтчет.Ссылка КАК Отчет,
		|	УниверсальныйРегламентированныйОтчет.ВидОтчета КАК ВидОтчета,
		|	УниверсальныйРегламентированныйОтчет.Организация КАК Организация,
		|	УниверсальныйРегламентированныйОтчет.ПериодОтчета КАК ПериодОтчета,
		|	УниверсальныйРегламентированныйОтчет.ИФО КАК ИФО,
		|	УниверсальныйРегламентированныйОтчет.Состояние.Порядок КАК ИндексКартинкиСостояния,
		|	УниверсальныйРегламентированныйОтчет.Состояние КАК Состояние,
		|	УниверсальныйРегламентированныйОтчет.Дата КАК Дата,
		|	УниверсальныйРегламентированныйОтчет.Номер КАК Номер,
		|	УниверсальныйРегламентированныйОтчет.ОписаниеАналитики КАК ОписаниеАналитики,
		|	ВЫБОР
		|		КОГДА УниверсальныйРегламентированныйОтчет.ДатаЗаполнения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьДанныеЗаполнения,
		|	СостоянияОтправленныхОтчетовСрезПоследних.Состояние КАК СостояниеСвод,
		|	ЕСТЬNULL(СостоянияОтправленныхОтчетовСрезПоследних.Состояние.Порядок, -1) КАК ИндексКартинкиСостоянияСвод,
		|	ЕСТЬNULL(НаличиеФайлов.ЕстьФайлы, ЛОЖЬ) КАК ЕстьФайлы
		|ИЗ
		|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОтправленныхОтчетов.СрезПоследних КАК СостоянияОтправленныхОтчетовСрезПоследних
		|		ПО (СостоянияОтправленныхОтчетовСрезПоследних.ДокументОтчет = УниверсальныйРегламентированныйОтчет.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
		|		ПО УниверсальныйРегламентированныйОтчет.Ссылка = НаличиеФайлов.ОбъектСФайлами
		|
		|УПОРЯДОЧИТЬ ПО
		|	УниверсальныйРегламентированныйОтчет.Дата,
		|	УниверсальныйРегламентированныйОтчет.Номер";
	Иначе
		НаборДанных.Запрос = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УниверсальныйРегламентированныйОтчет.Ссылка КАК Отчет,
		|	УниверсальныйРегламентированныйОтчет.ВидОтчета КАК ВидОтчета,
		|	УниверсальныйРегламентированныйОтчет.Организация КАК Организация,
		|	УниверсальныйРегламентированныйОтчет.ПериодОтчета КАК ПериодОтчета,
		|	УниверсальныйРегламентированныйОтчет.ИФО КАК ИФО,
		|	УниверсальныйРегламентированныйОтчет.Состояние.Порядок КАК ИндексКартинкиСостояния,
		|	УниверсальныйРегламентированныйОтчет.Состояние КАК Состояние,
		|	УниверсальныйРегламентированныйОтчет.Дата,
		|	УниверсальныйРегламентированныйОтчет.Номер,
		|	УниверсальныйРегламентированныйОтчет.ОписаниеАналитики,
		|	ВЫБОР
		|		КОГДА УниверсальныйРегламентированныйОтчет.ДатаЗаполнения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьДанныеЗаполнения,
		|	ЕСТЬNULL(НаличиеФайлов.ЕстьФайлы, ЛОЖЬ) КАК ЕстьФайлы
		|ИЗ
		|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
		|		ПО УниверсальныйРегламентированныйОтчет.Ссылка = НаличиеФайлов.ОбъектСФайлами
		|
		|УПОРЯДОЧИТЬ ПО
		|	УниверсальныйРегламентированныйОтчет.Дата,
		|	УниверсальныйРегламентированныйОтчет.Номер";
	
	КонецЕсли;
	//НовПараметр = Схема.Параметры.Добавить();
	//НовПараметр.Имя = "Период";
	//НовПараметр.ОграничениеИспользования = Истина;
	
	АдресСхемыТаблицыВыгрузок = ПоместитьВоВременноеХранилище(Схема,ЭтаФорма.УникальныйИдентификатор);
		
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыТаблицыВыгрузок);
	НастройкиСхемыВыгрузок.Инициализировать(ИсточникДоступныхНастроек);
	
	ДетальныеЗаписи = НастройкиСхемыВыгрузок.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ДетальныеЗаписи.Имя = "ДетальныеЗаписи";
	ДетальныеЗаписи.Использование = Истина;
	
	Для Каждого ДоступноеПоле Из НастройкиСхемыВыгрузок.Настройки.ДоступныеПоляВыбора.Элементы Цикл
		Если ДоступноеПоле.Поле<>Новый ПолеКомпоновкиДанных("СистемныеПоля")
			И ДоступноеПоле.Поле<>Новый ПолеКомпоновкиДанных("ПараметрыДанных") Тогда
			ПолеОтчет = ДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ПолеОтчет.Поле = ДоступноеПоле.Поле;
			ПолеОтчет.Использование = Истина;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуВыгрузокПоОтборам()
	
	Если не ЗначениеЗаполнено(АдресСхемыТаблицыВыгрузок) Тогда 
		
		ПодготовитьСхемуСпискаВыгрузок();		
		
	КонецЕсли;
	
	Схема = ПолучитьИзВременногоХранилища(АдресСхемыТаблицыВыгрузок);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(Схема, НастройкиСхемыВыгрузок.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	ПроцессорВыводаРезультатаОтчета = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	РезультатСхемы = ПроцессорВыводаРезультатаОтчета.Вывести(ПроцессорКомпоновкиДанных);
	
	ТаблицаВыгрузок.Загрузить(РезультатСхемы);
	ПроставитьОтметкиПоТаблице();
	
	ОбновитьДопДанныеСтрок();
	
КонецПроцедуры	

&НаСервере
Процедура ПроставитьОтметкиПоТаблице()
	
	Для Каждого ВыгружаемыйОтчет из ОбработкаВыгрузки.ОтчетыДляВыгрузки Цикл 
		
		СтрокиДляОтметки = ТаблицаВыгрузок.НайтиСтроки(Новый Структура("Отчет",ВыгружаемыйОтчет.Отчет));
		Для Каждого СтрокДляОтметки из СтрокиДляОтметки Цикл
			СтрокДляОтметки.Отметка = Истина;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьДопДанныеСтрок(СниматьОтметкиНежелательных = Ложь)
	
	ОтметкаВыгрузкиПредупреждение = БиблиотекаКартинок.ОтметкаВыгрузкиПредупреждение;
	ОтметкаВыгрузкиНевозможно = БиблиотекаКартинок.ОтметкаВыгрузкиНевозможно;
	ОтметкаВыгрузкиПустаяКартинка = Новый Картинка;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФорматВыгрузки",ОбработкаВыгрузки.ФорматВыгрузки);
	Запрос.УстановитьПараметр("ТаблицаВыгрузок",ТаблицаВыгрузок.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаВыгрузок.ВидОтчета,
	|	ТаблицаВыгрузок.ИФО,
	|	ТаблицаВыгрузок.Дата,
	|	ТаблицаВыгрузок.ИндексКартинкиСостояния,
	|	ТаблицаВыгрузок.Состояние,
	|	ТаблицаВыгрузок.ИндексКартинкиСостоянияСвод,
	|	ТаблицаВыгрузок.СостояниеСвод,
	|	ТаблицаВыгрузок.Номер,
	|	ТаблицаВыгрузок.ОписаниеАналитики,
	|	ТаблицаВыгрузок.Организация,
	|	ТаблицаВыгрузок.Отчет,
	|	ТаблицаВыгрузок.Отметка,
	|	ТаблицаВыгрузок.ЕстьФайлы,
	|	ТаблицаВыгрузок.ЕстьДанныеЗаполнения,
	|	ТаблицаВыгрузок.ПериодОтчета,
	|	ТаблицаВыгрузок.ПустаяКолонка
	|ПОМЕСТИТЬ ИсходнаяТаблицаВыгрузок
	|ИЗ
	|	&ТаблицаВыгрузок КАК ТаблицаВыгрузок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиПоддерживаемыеВидыОтчетов.Ссылка,
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиПоддерживаемыеВидыОтчетов.КодВидаОтчета,
	|	ВидыОтчетов.Ссылка КАК ВидОтчета
	|ИЗ
	|	Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности.ПоддерживаемыеВидыОтчетов КАК ФорматыВыгрузкиБухгалтерскойОтчетностиПоддерживаемыеВидыОтчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыОтчетов КАК ВидыОтчетов
	|		ПО ФорматыВыгрузкиБухгалтерскойОтчетностиПоддерживаемыеВидыОтчетов.КодВидаОтчета = ВидыОтчетов.Код
	|ГДЕ
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиПоддерживаемыеВидыОтчетов.Ссылка = &ФорматВыгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходнаяТаблицаВыгрузок.*,
	|	ЛОЖЬ КАК СераяСтрока,
	|	ЛОЖЬ КАК НельзяВыгрузить,
	|	"""" КАК Пояснение,
	|	ИсходнаяТаблицаВыгрузок.Отчет.ПометкаУдаления КАК ОтчетПомеченНаУдаление,
	|	ИсходнаяТаблицаВыгрузок.Отчет.Состояние КАК Состояние
	|ИЗ
	|	ИсходнаяТаблицаВыгрузок КАК ИсходнаяТаблицаВыгрузок";
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ПоддерживаемыеВидыОтчетов = Результаты[1].Выгрузить().ВыгрузитьКолонку("ВидОтчета");
	НоваяТаблицаВыгрузок = Результаты[2].Выгрузить();
		
	ФорматПоВидамОтчетов = ПоддерживаемыеВидыОтчетов.Количество()>0;
	
	ТаблицаВыгрузок.Очистить();
	Для Каждого СтрокаТаблицыВыгрузок из НоваяТаблицаВыгрузок Цикл
		
		ИндексКартинки = 0;
		
		НоваяСтрока = ТаблицаВыгрузок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыВыгрузок);
		
		
		Если ФорматПоВидамОтчетов И ПоддерживаемыеВидыОтчетов.Найти(СтрокаТаблицыВыгрузок.ВидОтчета)=Неопределено Тогда 
			
			НоваяСтрока.НельзяВыгрузить = Истина;
			НоваяСтрока.СераяСтрока = Истина;
			НоваяСтрока.Отметка = Ложь;
			
			ИндексКартинки = Макс(ИндексКартинки,2);
			
			Шаблон = НСтр(
			"ru = 'Выбранный формат выгрузки не поддерживает вид отчета ""%1"".'");
			НоваяСтрока.Пояснение = НоваяСтрока.Пояснение + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, СтрокаТаблицыВыгрузок.ВидОтчета);
			
		ИначеЕсли СтрокаТаблицыВыгрузок.ОтчетПомеченНаУдаление Тогда 
			
			НоваяСтрока.НельзяВыгрузить = Истина;
			НоваяСтрока.Отметка = Ложь;
			
			ИндексКартинки = Макс(ИндексКартинки,2);
			
			НоваяСтрока.Пояснение = НоваяСтрока.Пояснение + НСтр(
			"ru = 'Этот отчет помечен на удаление.'");
			
		ИначеЕсли НЕ (СтрокаТаблицыВыгрузок.Состояние = Перечисления.СостоянияОтчетов.Подготовлен
			ИЛИ СтрокаТаблицыВыгрузок.Состояние = Перечисления.СостоянияОтчетов.Утвержден) Тогда
			
			Если СниматьОтметкиНежелательных Тогда 
				НоваяСтрока.Отметка = Ложь;	
			КонецЕсли;
			ИндексКартинки = Макс(ИндексКартинки,1);
			
			Шаблон = НСтр(
			"ru = 'Выбран отчет с состоянием ""%1"". Рекомендуется выгружать только отчеты в состоянии ""Подготовлен"", ""Утвержден"".'");
			НоваяСтрока.Пояснение = НоваяСтрока.Пояснение + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, СтрокаТаблицыВыгрузок.Состояние);
			
		КонецЕсли;
		
		НоваяСтрока.КартинкаПредупреждения = ОтметкаВыгрузкиПустаяКартинка;
		Если ИндексКартинки = 1 Тогда 
			НоваяСтрока.КартинкаПредупреждения = ОтметкаВыгрузкиПредупреждение;
		ИначеЕсли ИндексКартинки = 2 Тогда 
			НоваяСтрока.КартинкаПредупреждения = ОтметкаВыгрузкиНевозможно;
		КонецЕсли;	
				
	КонецЦикла;	
	ЗаполнитьТаблицуПоОтметкам();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПоОтметкам()
	
	ОбработкаВыгрузки.ОтчетыДляВыгрузки.Очистить();
	
	МассивСтрок = ТаблицаВыгрузок.НайтиСтроки(Новый Структура("Отметка",Истина));
	
	Для Каждого СтрокаМассива Из МассивСтрок Цикл 
		
		НоваяСтрока = ОбработкаВыгрузки.ОтчетыДляВыгрузки.Добавить();
		НоваяСтрока.Отчет = СтрокаМассива.Отчет; 
		
	КонецЦикла;
	
	Если ВозможнаВыгрузкаПрисоединенныхФайлов Тогда
		НайденыеСтроки = ОбработкаВыгрузки.ОтчетыДляВыгрузки.НайтиСтроки(Новый Структура("Отчет",ТекущийОтчет));
		Элементы.ТаблицаФайловВыгружать.ТолькоПросмотр = (НайденыеСтроки.Количество() = 0);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокФайловНаСервере()
	
	НайденыеСтроки = ОбработкаВыгрузки.ОтчетыДляВыгрузки.НайтиСтроки(Новый Структура("Отчет",ТекущийОтчет));
	Элементы.ТаблицаФайловВыгружать.ТолькоПросмотр = (НайденыеСтроки.Количество() = 0);
	
	СинхронизироватьТаблицыФайлов(Истина);

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка,
		|	Файлы.ПометкаУдаления КАК ПометкаУдаления,
		|	ВЫБОР
		|		КОГДА Файлы.ПометкаУдаления = ИСТИНА
		|			ТОГДА ЕСТЬNULL(Файлы.ИндексКартинки, 2) + 1
		|		ИНАЧЕ ЕСТЬNULL(Файлы.ИндексКартинки, 2)
		|	КОНЕЦ КАК ИндексКартинки,
		|	Файлы.Наименование КАК Наименование,
		|	ВЫРАЗИТЬ(Файлы.Описание КАК СТРОКА(500)) КАК Описание,
		|	Файлы.Автор КАК Автор,
		|	Файлы.ВладелецФайла КАК Отчет,
		|	Файлы.ДатаСоздания КАК ДатаСоздания,
		|	Файлы.Изменил КАК Отредактировал,
		|	ДОБАВИТЬКДАТЕ(Файлы.ДатаМодификацииУниверсальная, СЕКУНДА, &СекундДоМестногоВремени) КАК ДатаИзменения,
		|	ВЫРАЗИТЬ(Файлы.Размер / 1024 КАК ЧИСЛО(10, 0)) КАК Размер,
		|	Файлы.Расширение КАК Расширение
		|ИЗ
		|	Справочник.УниверсальныйРегламентированныйОтчетПрисоединенныеФайлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла
		|	И Файлы.ЭтоГруппа = ЛОЖЬ
		|	И Файлы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВладелецФайла", ТекущийОтчет);
	
	ДатаУниверсальная = ТекущаяДатаСеанса();
	Запрос.УстановитьПараметр("СекундДоМестногоВремени",
		МестноеВремя(ДатаУниверсальная, ЧасовойПоясСеанса()) - ДатаУниверсальная);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТаблицаРанееОтмеченныхФайловПоОтчету = ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.Выгрузить(Новый Структура("Отчет",ТекущийОтчет),"СсылкаНаПрисоединенныйФайл");
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = ТаблицаФайлов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи);
		Если ТаблицаРанееОтмеченныхФайловПоОтчету.Найти(НовСтр.Ссылка,"СсылкаНаПрисоединенныйФайл")<>Неопределено Тогда
			НовСтр.Выгружать = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьПодписьКоличестваФайлов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьТаблицыФайлов(Очищать = Истина)
		
	Если ТаблицаФайлов.Количество() Тогда
		ПрошлыйОтчет = ТаблицаФайлов[0].Отчет;
		
		МассивНайденных = ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.НайтиСтроки(Новый Структура("Отчет",ПрошлыйОтчет));//для удаления лишних
		
		//добавим файлы, которых нет в общей таблице, но которые были добавлены
		Для Каждого СтрТЧ Из ТаблицаФайлов.НайтиСтроки(Новый Структура("Выгружать",Истина)) Цикл
			Если ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.НайтиСтроки(Новый Структура("Отчет,СсылкаНаПрисоединенныйФайл",ПрошлыйОтчет,СтрТЧ.Ссылка)).Количество() = 0 Тогда
				НовСтр = ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.Добавить();
				НовСтр.Отчет = ПрошлыйОтчет;
				НовСтр.СсылкаНаПрисоединенныйФайл = СтрТЧ.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		//удалим файлы, которые есть в общей таблице, но которых нет в текущей
		Для Каждого СтрТЧ Из МассивНайденных Цикл
			Если ТаблицаФайлов.НайтиСтроки(Новый Структура("Ссылка",СтрТЧ.СсылкаНаПрисоединенныйФайл)).Количество() = 0 Тогда
				ОбработкаВыгрузки.ПрисоединенныеФайлыДляВыгрузки.Удалить(СтрТЧ);
			КонецЕсли;
		КонецЦикла;
		
		Если Очищать = Истина Тогда
			ТаблицаФайлов.Очистить();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодписьКоличестваФайлов(Форма)
	
	Перем Всего, Отмечено, СтрТЧ;
	
	Отмечено = 0;
	Всего = 0;
	Для Каждого СтрТЧ Из Форма.ТаблицаФайлов Цикл
		Если СтрТЧ.Выгружать Тогда
			Отмечено = Отмечено + 1;
		КонецЕсли;
		Всего = Всего + 1;
	КонецЦикла;
	
	Форма.КоличествоФайлов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 из %2'"),Отмечено,Всего);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграниченияНаСпособВыгрузки()
	
	Если РежимРаботы = 1 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СпособВыгрузки.РежимВыбораИзСписка = Ложь;
	
	Если Не ЗначениеЗаполнено(ОбработкаВыгрузки.ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФорматВыгрузки",ОбработкаВыгрузки.ФорматВыгрузки);
	Запрос.УстановитьПараметр("ВебСервис",ОбменЧерезВебСервис);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпособыОтправки.СпособОтправки КАК СпособОтправки
	|ИЗ
	|	Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности.ПоддерживаемыеСпособыОтправки КАК СпособыОтправки
	|ГДЕ
	|	СпособыОтправки.Ссылка = &ФорматВыгрузки
	|	И СпособыОтправки.СпособОтправки <> &ВебСервис
	|
	|УПОРЯДОЧИТЬ ПО
	|	СпособОтправки";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	МассивСпособов = Результат.Выгрузить().ВыгрузитьКолонку("СпособОтправки");
	
	Элементы.СпособВыгрузки.СписокВыбора.ЗагрузитьЗначения(МассивСпособов);
	Элементы.СпособВыгрузки.РежимВыбораИзСписка = Истина;
	
	Если МассивСпособов.Найти(ОбработкаВыгрузки.СпособВыгрузки) = Неопределено Тогда 
		ОбработкаВыгрузки.СпособВыгрузки = МассивСпособов[0];
		СпособВыгрузкиПриИзмененииНаСервере();
	КонецЕсли;	
	
	
КонецПроцедуры	

&НаСервере
Процедура ЗагрузитьНастройкиВыгрузкиОтчетов()
	
	СтруктураНастроек = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ЗагрузитьОсновныеНастройкиВыгрузки(ИмяПользователя());
	ЗаполнитьЗначенияСвойств(ОбработкаВыгрузки,СтруктураНастроек);
	
КонецПроцедуры	

&НаСервере
Процедура СохранитьНастройкиВыгрузкиОтчетов()
	
	Если Не ЗначениеЗаполнено(ОбработкаВыгрузки.ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбработкаВыгрузки.СпособВыгрузки) Тогда 
		Возврат;
	КонецЕсли;	

	
	СтруктураНастроек = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПолучитьСтруктуруОсновныхНастроекВыгрузки();
	ЗаполнитьЗначенияСвойств(СтруктураНастроек,ОбработкаВыгрузки);
	ВыгрузкаРегламентированнойБухгалтерскойОтчетности.СохранитьОсновныеНастройкиВыгрузки(ИмяПользователя(),СтруктураНастроек);
	
КонецПроцедуры	

&НаСервере
Процедура ЗагрузитьНастройкиСпособаВыгрузки()
	
	Если Не ЗначениеЗаполнено(ОбработкаВыгрузки.ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбработкаВыгрузки.СпособВыгрузки) Тогда 
		Возврат;
	КонецЕсли;	
	
	СтруктураНастроек = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ЗагрузитьНастройкиСпособаВыгрузки(ИмяПользователя(),ОбработкаВыгрузки.ФорматВыгрузки, ОбработкаВыгрузки.СпособВыгрузки);
	ТекущийПутьВыгрузки = ОбработкаВыгрузки.ПутьВыгрузки;
	ЗаполнитьЗначенияСвойств(ОбработкаВыгрузки,СтруктураНастроек);
	
	Если ОбработкаВыгрузки.СпособВыгрузки = Перечисления.СпособыВыгрузкиФайлов.Каталог 
		И НЕ ЗначениеЗаполнено(ОбработкаВыгрузки.ПутьВыгрузки) Тогда
		ОбработкаВыгрузки.ПутьВыгрузки = ТекущийПутьВыгрузки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСпособаВыгрузки()
	
	Если Не ЗначениеЗаполнено(ОбработкаВыгрузки.ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбработкаВыгрузки.СпособВыгрузки) Тогда 
		Возврат;
	КонецЕсли;	
	
	
	СтруктураНастроек = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПолучитьСтруктуруНастроекСпособаВыгрузки(ОбработкаВыгрузки.СпособВыгрузки);
	ЗаполнитьЗначенияСвойств(СтруктураНастроек,ОбработкаВыгрузки);
	ВыгрузкаРегламентированнойБухгалтерскойОтчетности.СохранитьНастройкиСпособаВыгрузки(ИмяПользователя(),ОбработкаВыгрузки.ФорматВыгрузки,ОбработкаВыгрузки.СпособВыгрузки,СтруктураНастроек);
	
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьДополнительныеНастройкиФормата()
	Если Не ЗначениеЗаполнено(ОбработкаВыгрузки.ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;
	Если ОбработкаВыгрузки.ФорматВыгрузки = ФорматТекущихДопНастроек Тогда 
		Возврат;
	КонецЕсли;	
	
	
	ТаблицаДополнительныхНастроек = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.СформироватьТаблицуДополнительныхНастроек();
	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ЗаполнитьТаблицуДополнительныхНастроек(ОбработкаВыгрузки.ФорматВыгрузки,ТаблицаДополнительныхНастроек);
	
	ОбработкаВыгрузки.ДополнительныеНастройкиФормата.Загрузить(ТаблицаДополнительныхНастроек);
	
	СоздатьРеквизитыДопНастроек(ТаблицаДополнительныхНастроек);
	
КонецПроцедуры	

&НаСервере
Процедура СоздатьРеквизитыДопНастроек(ТаблицаДополнительныхНастроек)
	
	//Изменение реквизитов формы для дополнительных настроек.
	МассивИменДопРеквизитов = Новый Массив;
	ДобавляемыеРеквизиты = Новый Массив;
	
	Для Каждого СтрокаДопНастройки Из ТаблицаДополнительныхНастроек Цикл
		
		// Новый дополнительный реквизит
		ИмяРеквизита = "ДопНастройка_"+СтрокаДопНастройки.Имя;

		МассивИменДопРеквизитов.Добавить(ИмяРеквизита);
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита,
													  СтрокаДопНастройки.ТипЗначения,
													  "",
													  СтрокаДопНастройки.Заголовок,
													  Истина));
		
	КонецЦикла;
	
	//Удаление ранее созданных реквизитов и элементов
	МассивУдаляемыхРеквизитов = Новый Массив;
	
	Если ТипЗнч(ДобавленныеЭлементы) = Тип("ФиксированныйМассив") Тогда
		Для Каждого ЭлМас Из ДобавленныеРеквизиты Цикл
			МассивУдаляемыхРеквизитов.Добавить(ЭлМас);
		КонецЦикла;
		Для Каждого ЭлМас Из ДобавленныеЭлементы Цикл
			ТекЭлемент = Элементы.Найти(ЭлМас);
			Если ТекЭлемент<>Неопределено Тогда
				Элементы.Удалить(ТекЭлемент);
			КонецЕсли;
		КонецЦикла;	    
	КонецЕсли;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты,МассивУдаляемыхРеквизитов);
	ДобавленныеРеквизиты = Новый ФиксированныйМассив(МассивИменДопРеквизитов);
	
	МассивЭлементов = Новый Массив;
	ГруппаДопНастроек = Элементы.ГруппаДополнительныеНастройкиФорматаОбмена;
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	Для Каждого СтрокаДопНастройки Из ТаблицаДополнительныхНастроек Цикл
		
		//Если для поля предусмотрена группировка, создаем для него группу или помещаем в ранее созданную.
		ГруппаПолей = Неопределено;
		Если ЗначениеЗаполнено(СтрокаДопНастройки.ГруппаПолей) Тогда
			ИмяГруппыПолей = "ДопНастройка_"+СтрокаДопНастройки.ГруппаПолей;
			ГруппаПолей = Элементы.Найти(ИмяГруппыПолей);
			Если ГруппаПолей = Неопределено Тогда
				ГруппаПолей = Элементы.Добавить(ИмяГруппыПолей,Тип("ГруппаФормы"),ГруппаДопНастроек);
				ГруппаПолей.Вид = ВидГруппыФормы.ОбычнаяГруппа;
				ГруппаПолей.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
				ГруппаПолей.ОтображатьЗаголовок = Истина;
				ГруппаПолей.Заголовок = БюджетнаяОтчетность.Синоним(СтрокаДопНастройки.ГруппаПолей);
				ГруппаПолей.Объединенная = Истина;
				ГруппаПолей.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
				ГруппаПолей.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
				
				МассивЭлементов.Добавить(ГруппаПолей.Имя);
			КонецЕсли;
		КонецЕсли;	
		
		ИмяРеквизита = "ДопНастройка_"+СтрокаДопНастройки.Имя;
		ТипПоля = Тип("ПолеФормы");
		Если СтрокаДопНастройки.ТипЗначения = ТипБулево Тогда
			ТипПоля = Тип("ПолеФлажкаФормы");
		КонецЕсли;	
			
		НовЭлемент  = Элементы.Добавить(ИмяРеквизита,
										Тип("ПолеФормы"),
										?(ГруппаПолей = Неопределено, ГруппаДопНастроек, ГруппаПолей));
										
		НовЭлемент.ПутьКДанным = ИмяРеквизита;
		НовЭлемент.Заголовок = СтрокаДопНастройки.Заголовок;
		
		// Определяем тип поля
		Если СтрокаДопНастройки.ТипЗначения = ТипБулево Тогда
			НовЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		Иначе
			НовЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовЭлемент.РастягиватьПоГоризонтали = Истина;
			НовЭлемент.УстановитьДействие("Очистка","ОчисткаНастройкиФормата_Подключаемый");
			Если СтрокаДопНастройки.СписокВыбора.Количество() > 0 Тогда
				НовЭлемент.РедактированиеТекста = Ложь;
				НовЭлемент.РежимВыбораИзСписка = Истина;
				Для Каждого ЭлементСписка Из СтрокаДопНастройки.СписокВыбора Цикл
					НовЭлемент.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
				КонецЦикла;	
			Иначе
				НовЭлемент.КнопкаОчистки = Истина;	
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДопНастройки.Описание) Тогда
			НовЭлемент.Подсказка = СтрокаДопНастройки.Описание;
			НовЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		КонецЕсли;
		
		// Заполяем сохраненные значения, или значения по умолчанию
		Если СтрокаДопНастройки.СохраненноеЗначение <> Неопределено Тогда
			ЭтотОбъект[ИмяРеквизита] = СтрокаДопНастройки.СохраненноеЗначение;
		ИначеЕсли СтрокаДопНастройки.ЗначениеПоУмолчанию <> Неопределено Тогда
			ЭтотОбъект[ИмяРеквизита] = СтрокаДопНастройки.ЗначениеПоУмолчанию;
		КонецЕсли;
				
		МассивЭлементов.Добавить(НовЭлемент.Имя);
		НовЭлемент.УстановитьДействие("ПриИзменении","ПриИзмененииНастройкиФормата_Подключаемый");
	КонецЦикла;

	ДобавленныеЭлементы = Новый ФиксированныйМассив(МассивЭлементов);
		
	ФорматТекущихДопНастроек = ОбработкаВыгрузки.ФорматВыгрузки;
	
КонецПроцедуры	

&НаСервере
Процедура ПриИзмененииНастройкиФорматаНаСервере(ИмяДопРеквизита)

	ИмяНастройки = СтрЗаменить(ИмяДопРеквизита,"ДопНастройка_", "");
	
	Отбор = Новый Структура("Имя", ИмяНастройки);
	СтрокиНастройки = ОбработкаВыгрузки.ДополнительныеНастройкиФормата.НайтиСтроки(Отбор);
	Если СтрокиНастройки.Количество() > 0 Тогда
		СтрокиНастройки[0].Значение = ЭтотОбъект[ИмяДопРеквизита];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДополнительныеНастройкиФормата() 
	Если Не ЗначениеЗаполнено(ОбработкаВыгрузки.ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;	
	
	ТаблицаДополнительныхНастроек = ОбработкаВыгрузки.ДополнительныеНастройкиФормата.Выгрузить();
	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ЗаписатьЗначенияТаблицыДополнительныхНастроекВРегистр(ОбработкаВыгрузки.ФорматВыгрузки,ТаблицаДополнительныхНастроек);
	
КонецПроцедуры	

&НаСервере
Процедура УправлениеСтраницамиПараметровВыгрузки()
	
	ИмяТранспорта = ПолучитьПолноеИмяПредопределенногоЗначения(ОбработкаВыгрузки.СпособВыгрузки);
	
	Если ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.Каталог" Тогда 
		НужнаяСтаница = Элементы.ВыгрузкаВКаталог;
		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.FTP" Тогда 
		НужнаяСтаница = Элементы.ВыгрузкаFTP;
		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.ЭлектроннаяПочта" Тогда 
		НужнаяСтаница = Элементы.ВыгрузкаЧерезEmail;

		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС" Тогда 
		НужнаяСтаница = Элементы.ВыгрузкаВФНС;
		
	Иначе
		НужнаяСтаница = Элементы.ВыгрузкаВКаталог;

	КонецЕсли;	
	
	НужнаяСтаница.Видимость = Истина;
	Элементы.СтраницыПараметровВыгрузки.ТекущаяСтраница = НужнаяСтаница;
	
	Для Каждого СтраницаПараметровВыгрузки Из Элементы.СтраницыПараметровВыгрузки.ПодчиненныеЭлементы Цикл 
		Если СтраницаПараметровВыгрузки = НужнаяСтаница Тогда 
			Продолжить;
		КонецЕсли;	
		СтраницаПараметровВыгрузки.Видимость = Ложь;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура УправлениеВидимостьюСтраницыЭЦП()
	
	ПоказыватьСтраницуЭЦП = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПоказыватьСтраницуЭЦП(ОбработкаВыгрузки.СпособВыгрузки);
	ИзменитьВидимостьСтраницыЭП(ПоказыватьСтраницуЭЦП);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВидимостьСтраницыЭП(ПоказыватьСтраницуЭЦП)
	Элементы.ГруппаНастройкиКриптографии.Видимость = ПоказыватьСтраницуЭЦП;
	Если ПоказыватьСтраницуЭЦП Тогда
		Элементы.ГруппаДополнительныеНастройки.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе	
		Элементы.ГруппаДополнительныеНастройки.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДопПараметров()
	
	Элементы.ГруппаДополнительныеНастройкиФорматаОбмена.Видимость = ОбработкаВыгрузки.ДополнительныеНастройкиФормата.Количество() > 0;
	
КонецПроцедуры	

&НаСервере
Процедура УправлениеВидимостьюКнопкиСправки()
	
	Элементы.КнопкаСправкаПоФормату.Видимость = ЗначениеЗаполнено(ОбработкаВыгрузки.ФорматВыгрузки) и ЗначениеЗаполнено(ОбработкаВыгрузки.ФорматВыгрузки.Справка);
	
КонецПроцедуры	

&НаКлиенте
Процедура УправлениеКнопкойТолькоВыгружаемые()
	
	Элементы.ТаблицаВыгрузокТолькоВыгружаемые.Пометка = ОтображатьТолькоВыгружаемые;
	
КонецПроцедуры	

&НаСервере
Процедура ФорматВыгрузкиПриИзмененииНаСервере()
	
	ОбновитьНастройкиПредопределенныхФорматов();
	
	ЗагрузитьНастройкиСпособаВыгрузки();
	ЗагрузитьДополнительныеНастройкиФормата();
	
	УстановитьОграниченияНаСпособВыгрузки();
	
	УправлениеВидимостьюДопПараметров();
	УправлениеВидимостьюКнопкиСправки();
	ОбновитьДопДанныеСтрок();
	
	ОбновитьНастройкиВыгрузкиПрисоединенныхФайлов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиПредопределенныхФорматов()
	
	ВыбранныйФормат = ОбработкаВыгрузки.ФорматВыгрузки;
	Если ЗначениеЗаполнено(ВыбранныйФормат) И ВыбранныйФормат.Предопределенный Тогда
		Справочники.ФорматыВыгрузкиБухгалтерскойОтчетности.ОбновитьНастройкиФорматов(ВыбранныйФормат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СпособВыгрузкиПриИзмененииНаСервере()
	
	ЗагрузитьНастройкиСпособаВыгрузки();
	
	УправлениеСтраницамиПараметровВыгрузки();
	УправлениеВидимостьюСтраницыЭЦП();
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьСертификаты(СтруктураДанных)
	Если СтруктураДанных.Отказ	Тогда 
		Возврат;
	КонецЕсли;	
	
	Для Каждого ВыбранныйСертификат Из СтруктураДанных.МассивОписанийСертификатов Цикл
		НоваяСтока = ОбработкаВыгрузки.ЭлектронныеЦифровыеПодписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтока,ВыбранныйСертификат,"КомуВыданСертификат,Отпечаток,ДатаПодписи,Комментарий,УстановившийПодпись");
		Если ЗначениеЗаполнено(ВыбранныйСертификат.СертификатСсылка) Тогда 
			НоваяСтока.СертификатСсылка = ВыбранныйСертификат.СертификатСсылка;
		Иначе 
			НоваяСтока.Сертификат = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ВыбранныйСертификат.Сертификат);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаЗавершенияВыгрузки(РезультатВыгрузки,ДополнительныеПараметры) Экспорт
	
	Если Строка(ОбработкаВыгрузки.СпособВыгрузки) = "Web-сервис" Тогда
		//При обмене через сервис устанавливается параметр КодСценарияПолучателя из РабочегоПериода.
		//По окончании формирования файла очистим значение параметра.
		Для Каждого СтрТЧ Из ОбработкаВыгрузки.ДополнительныеНастройкиФормата Цикл
			Если СтрТЧ.Имя = "КодСценарияПолучателя" Тогда
				СтрТЧ.Значение = "";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(РезультатВыгрузки) = Тип("Структура") Тогда
		Результат = РезультатВыгрузки.Результат;
		МассивПакетов = РезультатВыгрузки.МассивПакетов;		
	Иначе
		Результат = ?(РезультатВыгрузки = Неопределено, Ложь, РезультатВыгрузки);
		МассивПакетов = Новый Массив;
	КонецЕсли;
	
	Если Результат И Строка(ОбработкаВыгрузки.СпособВыгрузки) <> "Web-сервис" Тогда 
		СохранитьПользовательскиеДанные();
	КонецЕсли;	
	
	ПрочитатьЗначенияНаСервере();
	
	Если МассивПакетов.Количество()>0 И Строка(ОбработкаВыгрузки.СпособВыгрузки) = "Web-сервис" Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПодговленныеПакеты",ЭтотОбъект,МассивПакетов);
		ТекстВопроса = Нстр("ru='Отправить подготовленные пакеты?'");
		ПоказатьВопрос(ОписаниеОповещения,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
		
КонецПроцедуры	

&НаСервере
Процедура ПрочитатьЗначенияНаСервере()
	ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиентСервер.ПрочитатьЗначенияИзХранилища(ОбработкаВыгрузки.ДополнительныеНастройкиФормата);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПодговленныеПакеты(Результат,МассивПакетов) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОтправитьВыбранныеПакеты(МассивПакетов);
	Иначе
		Элементы.ЖурналыДокументов.ТекущаяСтраница = Элементы.ГруппаОтправкаПакетов;
		УстановитьОтборы();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьПользовательскиеДанные()
	
	СохранитьНастройкиВыгрузкиОтчетов();
	СохранитьНастройкиСпособаВыгрузки();
	СохранитьДополнительныеНастройкиФормата();
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	ОбработкаВыгрузки.ПутьВыгрузки = Результат.ВыбранныеФайлы[0];
	
КонецПроцедуры	

// Служебные
// Выгрузка
////////////////////////////////////////////////////////////////////////////////

#Область ОбменССервисом

&НаКлиенте
Процедура ОбновитьРабочиеПериоды(Команда)
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ТекстСообщения = Нстр("ru='Не выбрана учетная запись обмена со Сводом отчетов.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	ОбновитьРПНаСервере();
	ОповеститьОбИзменении(Тип("СправочникСсылка.РабочиеПериодыПредоставленияОтчетности"));
КонецПроцедуры

&НаСервере
Процедура ОбновитьРПНаСервере()
	
	WSПрокси = ПолучитьWSПроксиОбмена(30);
	
	Таб = Неопределено;
	Таб = WSПрокси.GetReportPeriod();
	
	ПолученныеПериоды = Таб.Получить();	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеПериодыПредоставленияОтчетности.Ссылка,
		|	РабочиеПериодыПредоставленияОтчетности.КодСценария,
		|	РабочиеПериодыПредоставленияОтчетности.НаименованиеСценария,
		|	РабочиеПериодыПредоставленияОтчетности.Период.ДатаНачала КАК ДатаНачала,
		|	РабочиеПериодыПредоставленияОтчетности.Период.Периодичность КАК Периодичность,
		|	РабочиеПериодыПредоставленияОтчетности.ПериодОткрыт
		|ИЗ
		|	Справочник.РабочиеПериодыПредоставленияОтчетности КАК РабочиеПериодыПредоставленияОтчетности";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаТекущих = РезультатЗапроса.Выгрузить();
	ТаблицаТекущих.Колонки.Добавить("Обработан",Новый ОписаниеТипов("Булево"));
	
	СтруктураПоиска = Новый Структура("КодСценария,ДатаНачала,Периодичность");
	
	МенеджерПериодичность = БюджетнаяОтчетностьСервер.ПолучитьМенеджерПериодичность();
	
	Для Каждого СтрТЧ Из ПолученныеПериоды Цикл
		
		СтруктураПоиска.КодСценария = СтрТЧ.СценарийКод;
		СтруктураПоиска.ДатаНачала = СтрТЧ.ДатаНачала;
		СтруктураПоиска.Периодичность = МенеджерПериодичность[СтрТЧ.ПериодичностьИмя];
		
		МассивСтрок = ТаблицаТекущих.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() = 0 Тогда
			//Создадим новые рабочие периоды
			ТекОбъект = Справочники.РабочиеПериодыПредоставленияОтчетности.СоздатьЭлемент();
			ТекОбъект.ПериодОткрыт = СтрТЧ.ПериодОткрыт;
			ТекОбъект.НаименованиеСценария = СтрТЧ.СценарийНаименование;
			ТекОбъект.КодСценария = СтрТЧ.СценарийКод;
			ТекОбъект.Период = Справочники.Периоды.НайтиСоздатьПериод(СтруктураПоиска.Периодичность, СтруктураПоиска.ДатаНачала);
			ТекОбъект.Записать();
		Иначе
			МассивСтрок[0].Обработан = Истина;
			//Обновим наименование у имеющихся
			Если МассивСтрок[0].ПериодОткрыт <> СтрТЧ.ПериодОткрыт
				ИЛИ МассивСтрок[0].НаименованиеСценария <> СтрТЧ.СценарийНаименование Тогда
				ТекОбъект = МассивСтрок[0].Ссылка.ПолучитьОбъект();
				ТекОбъект.ПериодОткрыт = СтрТЧ.ПериодОткрыт;
				ТекОбъект.НаименованиеСценария = СтрТЧ.СценарийНаименование;
				ТекОбъект.Записать();
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	//Для всех остальных закроем период
	МассивСтрок = ТаблицаТекущих.НайтиСтроки(Новый Структура("Обработан,ПериодОткрыт",Ложь,Истина));
	Для Каждого ЗакрытыйПериод Из МассивСтрок Цикл
		ТекОбъект = ЗакрытыйПериод.Ссылка.ПолучитьОбъект();
		ТекОбъект.ПериодОткрыт = Ложь;
		ТекОбъект.Записать();		
	КонецЦикла;

КонецПроцедуры


&НаСервере
Функция ПолучитьWSПроксиОбмена(Таймаут)
	
	Возврат Справочники.УчетныеЗаписиОбменаСводаОтчетов.ПолучитьWSПроксиОбмена(УчетнаяЗапись,Истина,Таймаут);
		
КонецФункции


&НаКлиенте
Процедура РабочийПериодПриИзменении(Элемент)
	УстановитьОтборы();
КонецПроцедуры


&НаСервере
Процедура УчетнаяЗаписьПриИзмененииНаСервере()
	Если РежимРаботы = 1 
		И ИспользоватьОбменСоСводомОтчетов Тогда
		Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
			Элементы.ВыборУчетнойЗаписи.Заголовок = "Учетная запись: """+Строка(УчетнаяЗапись)+"""";
			ОбработкаВыгрузки.ФорматВыгрузки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись,"ФорматОбмена");
			ОбработкаВыгрузки.СпособВыгрузки = ОбменЧерезВебСервис;
			ВидимостьЭП = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПоказыватьСтраницуЭЦП(ОбработкаВыгрузки.СпособВыгрузки);

			Элементы.ГруппаЭППакета.Видимость = ВидимостьЭП;
			ИзменитьВидимостьСтраницыЭП(ВидимостьЭП);
		Иначе
			Элементы.ВыборУчетнойЗаписи.Заголовок = "Выбрать учетную запись";
			ОбработкаВыгрузки.ФорматВыгрузки = Неопределено;
			ОбработкаВыгрузки.СпособВыгрузки = Неопределено;
		КонецЕсли;
		ФорматВыгрузкиПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиТаблицаПодготовленныхПакетов

&НаКлиенте
Процедура ТаблицаПодготовленныхПакетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя <> "ТаблицаПодготовленныхПакетовОтметка" Тогда
		ТекСтрока = ТаблицаПодготовленныхПакетов.НайтиПоИдентификатору(ВыбраннаяСтрока);
		ПоказатьЗначение(,ТекСтрока.ПакетВыгрузки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПодготовленныхПакетов()
	
	
	ТаблицаПодготовленныхПакетов.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПакетВыгрузкиОтчетности.Ссылка КАК ПакетВыгрузки,
		|	ПакетВыгрузкиОтчетности.Номер,
		|	ПакетВыгрузкиОтчетности.Дата КАК Дата,
		|	ПакетВыгрузкиОтчетности.Организация,
		|	ПакетВыгрузкиОтчетности.Период,
		|	ПакетВыгрузкиОтчетности.ФорматВыгрузки,
		|	ИсторияСостоянийПакетаОтчетовСрезПоследних.Состояние
		|ИЗ
		|	РегистрСведений.ИсторияСостоянийПакетаОтчетов.СрезПоследних КАК ИсторияСостоянийПакетаОтчетовСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПакетВыгрузкиОтчетности КАК ПакетВыгрузкиОтчетности
		|		ПО ИсторияСостоянийПакетаОтчетовСрезПоследних.ПакетОтчетов = ПакетВыгрузкиОтчетности.Ссылка
		|			И (ИсторияСостоянийПакетаОтчетовСрезПоследних.Состояние = &Подготовлен)
		|			И (ПакетВыгрузкиОтчетности.СпособВыгрузки = &ВебСервис)
		|ГДЕ
		|	(ПакетВыгрузкиОтчетности.Организация В (&Организации)
		|			ИЛИ &БезОтбораПоОрганизации)
		|	И ПакетВыгрузкиОтчетности.Период = &Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
	Запрос.УстановитьПараметр("ВебСервис", ОбменЧерезВебСервис);
	Запрос.УстановитьПараметр("Подготовлен", Перечисления.СостоянияПакетаОтчетов.Сформирован);
	Запрос.УстановитьПараметр("Организации", ОтборОрганизация.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Период", РабочийПериод);
	Запрос.УстановитьПараметр("БезОтбораПоОрганизации", Не ИспользоватьОтборОрганизаций);
	
	РезультатЗапроса = Запрос.Выполнить();
		
	ТаблицаПодготовленныхПакетов.Загрузить(РезультатЗапроса.Выгрузить());
	
	КоличествоПодготовленныхПакетов = ТаблицаПодготовленныхПакетов.Количество();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодготовленныеПакеты(Команда)
	ЗаполнитьТаблицуПодготовленныхПакетов();
КонецПроцедуры

&НаСервере
Процедура ОтправитьПакетыНаСервере(МассивОтчетов = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПакетВыгрузкиОтчетностиФайлыОтчетов.ДанныеФайлов КАК ДанныеФайлов,
		|	ПакетВыгрузкиОтчетностиФайлыОтчетов.Ссылка.Организация КАК Организация,
		|	ПакетВыгрузкиОтчетностиФайлыОтчетов.Ссылка КАК Ссылка,
		|	ПакетВыгрузкиОтчетностиФайлыОтчетов.Ссылка.Дата КАК Дата,
		|	ПакетВыгрузкиОтчетностиФайлыОтчетов.Ссылка.Номер КАК Номер
		|ИЗ
		|	Документ.ПакетВыгрузкиОтчетности.ФайлыОтчетов КАК ПакетВыгрузкиОтчетностиФайлыОтчетов
		|ГДЕ
		|	ПакетВыгрузкиОтчетностиФайлыОтчетов.Ссылка В(&Ссылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПакетВыгрузкиОтчетностиФайлыОтчетов.НомерСтроки";
		
	Если МассивОтчетов = Неопределено Тогда	
		
		МассивСтрок = ТаблицаПодготовленныхПакетов.НайтиСтроки(Новый Структура("Отметка",Истина));
		МассивПакетов = Новый Массив;
		Для Каждого ЭлМас Из МассивСтрок Цикл
			МассивПакетов.Добавить(ЭлМас.ПакетВыгрузки);	
		КонецЦикла;
	Иначе
		МассивПакетов = МассивОтчетов;
	КонецЕсли;
	Если МассивПакетов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Не отмечен ни один пакет отчетов для отправки.'"));
		Возврат;
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", МассивПакетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	WSПрокси = ПолучитьWSПроксиОбмена(Неопределено);
	
	ТаблицаПакетовОбмена = Новый ТаблицаЗначений;
	ТаблицаПакетовОбмена.Колонки.Добавить("ПакетОтчетов");
	ТаблицаПакетовОбмена.Колонки.Добавить("Состояние");
	ТаблицаПакетовОбмена.Колонки.Добавить("ИндексКартинкиСостояния");
	ТаблицаПакетовОбмена.Колонки.Добавить("Период");
	
	СоответствиеКартинок = Новый Соответствие;
	СоответствиеКартинок.Вставить(Перечисления.СостоянияПакетаОтчетов.Отправлен,3);
	СоответствиеКартинок.Вставить(Перечисления.СостоянияПакетаОтчетов.ОтклоненАдресатом,5);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекДанные = ВыборкаДетальныеЗаписи.ДанныеФайлов.Получить();	
		
		ДатаОбмена = ТекущаяДатаСеанса();
		
		Результат = WSПрокси.ImportReport(ТекДанные);
		СтруктураРезультата = Результат.Получить();
		
		ПротоколЗагрузки = Неопределено;
		ПротоколОбработки = Неопределено;
		ПротоколПроверки = Неопределено;
		Комментарий = Неопределено;
		
		СтруктураРезультата.Свойство("ПротоколЗагрузкиФайлов",ПротоколЗагрузки);
		СтруктураРезультата.Свойство("ПротоколОбработкиОтчетов",ПротоколОбработки);
		СтруктураРезультата.Свойство("ПротоколПроверки",ПротоколПроверки);
		СтруктураРезультата.Свойство("Комментарий",Комментарий);
		
		
		
		ЗаписьРегистраИстории = РегистрыСведений.ИсторияСостоянийПакетаОтчетов.СоздатьМенеджерЗаписи();
		ЗаписьРегистраИстории.ПакетОтчетов = ВыборкаДетальныеЗаписи.Ссылка;
		ЗаписьРегистраИстории.Период = ТекущаяДатаСеанса();
		
		ЗаписьРегистраИстории.Состояние = ?(СтруктураРезультата.ЗагрузкаВыполнялась = Истина,Перечисления.СостоянияПакетаОтчетов.Отправлен,Перечисления.СостоянияПакетаОтчетов.ОтклоненАдресатом);
		
		ЗаписьРегистраИстории.ПротоколИмпорта = Новый ХранилищеЗначения(ПротоколЗагрузки);
		ЗаписьРегистраИстории.ПротоколОбработки = Новый ХранилищеЗначения(ПротоколОбработки);
		ЗаписьРегистраИстории.ПротоколПроверки = Новый ХранилищеЗначения(ПротоколПроверки);
		ЗаписьРегистраИстории.Комментарий = Комментарий;
		
		НовСтр = ТаблицаПакетовОбмена.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,ЗаписьРегистраИстории);
		НовСтр.ИндексКартинкиСостояния = СоответствиеКартинок[НовСтр.Состояние];
		
		ЗаписьРегистраИстории.Записать(Истина);
		
		ЕстьТаблицаДанныхОтчетов = Ложь;
		Если СтруктураРезультата.Свойство("ТаблицаДанныхОтчетов") Тогда
			ЕстьТаблицаДанныхОтчетов = Истина;
			Для Каждого СтрТЧ Из СтруктураРезультата.ТаблицаДанныхОтчетов Цикл
				ЗаписьРегистра = РегистрыСведений.СостоянияОтправленныхОтчетов.СоздатьМенеджерЗаписи();
				ЗаписьРегистра.Период = СтрТЧ.Период;
				ЗаписьРегистра.Организация = ВыборкаДетальныеЗаписи.Организация;
				ЗаписьРегистра.ДокументОтчет = ВернутьСсылку(СтрТЧ.GUIDИсходногоДокумента);
				ЗаписьРегистра.Состояние = Перечисления.СостоянияОтчетов[СтрТЧ.Состояние];
				ЗаписьРегистра.Комментарий = СтрТЧ.Комментарий;
				ЗаписьРегистра.ПричинаИзмененияСостояния = СтрТЧ.ПричинаИзмененияСостояния;
				ЗаписьРегистра.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
		
		Если СтруктураРезультата.Свойство("ТаблицаРезультатовЗагрузки") Тогда
			
			Если ЕстьТаблицаДанныхОтчетов Тогда
				СтруктураРезультата.ТаблицаДанныхОтчетов.Индексы.Добавить("GUIDИсходногоДокумента");
			КонецЕсли;		
			
			Для Каждого СтрТЧ Из СтруктураРезультата.ТаблицаРезультатовЗагрузки Цикл
				
				
				ТекДатаОбмена = ДатаОбмена; //если никуда не загрузился, дата обмена по умолчанию
				НужнаяСтрока = Неопределено;
				Если ЕстьТаблицаДанныхОтчетов Тогда
					НужнаяСтрока = СтруктураРезультата.ТаблицаДанныхОтчетов.Найти(СтрТЧ.GUIDИсходногоДокумента,"GUIDИсходногоДокумента");
				КонецЕсли;	
				Если НужнаяСтрока <> Неопределено Тогда
					ТекДатаОбмена = НужнаяСтрока.Период;// если загрузился в отчет	
				ИначеЕсли ЗначениеЗаполнено(СтрТЧ.ДатаИзмененияФайла) Тогда
					ТекДатаОбмена = СтрТЧ.ДатаИзмененияФайла;// если загрузился в хранимые файлы	
				КонецЕсли;
				
				ЗаписьРегистра = РегистрыСведений.ИсторияОбменаСоСводомОтчетов.СоздатьМенеджерЗаписи();
				ЗаписьРегистра.Период = ТекДатаОбмена;
				ЗаписьРегистра.Организация = ВыборкаДетальныеЗаписи.Организация;
				ЗаписьРегистра.ЭкземплярОтчета = ВернутьСсылку(СтрТЧ.GUIDИсходногоДокумента);
								
				ЗаписьРегистра.ВходнойКонтроль = (СтрТЧ.Ошибка = Ложь);
				Если ЗначениеЗаполнено(СтрТЧ.Состояние) Тогда
					ЗаписьРегистра.Состояние = Перечисления.СостоянияОтчетов[СтрТЧ.Состояние];
				КонецЕсли;
				ЗаписьРегистра.ЗагруженВВерсииХранимыхФайлов = СтрТЧ.ЗагруженВВерсииХранимыхФайлов;//1 - все ок, 2 - ошибка, 0 - не выполнялось
				ЗаписьРегистра.ЗагруженВОтчет = СтрТЧ.ЗагруженВОтчет;							   //1 - все ок, 2 - ошибка, 0 - не выполнялось
				ЗаписьРегистра.СообщениеОбОшибке = СтрТЧ.Сообщения;
				ЗаписьРегистра.КСОшибки = СтрТЧ.КСОшибки;
				ЗаписьРегистра.КСПредупреждения = СтрТЧ.КСПредупреждения;
				ЗаписьРегистра.КСПроверкаВыполнена = СтрТЧ.КСПроверкаВыполнена;
				
				ЗаписьРегистра.ДатаДокументаПакета = ВыборкаДетальныеЗаписи.Дата;
				ЗаписьРегистра.НомерДокументаПакета = ВыборкаДетальныеЗаписи.Номер;
				
				ЗаписьРегистра.Записать(Истина);
			КонецЦикла;	
		КонецЕсли;
		
	КонецЦикла;
	АдресТаблицыПакетовОбмена = ПоместитьВоВременноеХранилище(ТаблицаПакетовОбмена,УникальныйИдентификатор);
	
	ЗаполнитьТаблицуПодготовленныхПакетов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьСсылку(ГУИД)
	Возврат Документы.УниверсальныйРегламентированныйОтчет.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));	
КонецФункции

&НаКлиенте
Процедура ОтправитьПакеты(Команда)
	ОтправитьВыбранныеПакеты();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВыбранныеПакеты(ВыбранныеПакеты = Неопределено)
	ОтправитьПакетыНаСервере(ВыбранныеПакеты);
	ПараметрыФормы = Новый Структура("АдресТаблицыПакетовОбмена",АдресТаблицыПакетовОбмена);
	ОткрытьФорму("РегистрСведений.ИсторияСостоянийПакетаОтчетов.Форма.ФормаРезультатаОбмена",ПараметрыФормы,ЭтотОбъект,Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИзмененияСостояний(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ТекДанные.Свойство("Ссылка") Тогда
		Возврат;
	КонецЕсли;
	Отбор = Новый Структура("ДокументОтчет",ТекДанные.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор",Отбор);
	ОткрытьФорму("РегистрСведений.СостоянияОтправленныхОтчетов.ФормаСписка",ПараметрыФормы,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодготовленныхПакетовПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.ТаблицаПодготовленныхПакетов.ТекущиеДанные;
	ОтборПоПакету = Неопределено;
	Если ТекСтрока <> Неопределено Тогда
		ОтборПоПакету = ТекСтрока.ПакетВыгрузки;
	КонецЕсли;
	ОтчетыПакета.Параметры.УстановитьЗначениеПараметра("Ссылка",ОтборПоПакету);
	ЭППакета.Параметры.УстановитьЗначениеПараметра("Ссылка",ОтборПоПакету);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНовыеПодписиПакета(Результат ,СтруктураДанных) Экспорт
	Если СтруктураДанных.Отказ Тогда 
		Возврат;  
	КонецЕсли;
	
	ЗаписатьНовыеПодписиПакетаСервере(СтруктураДанных);
	ОповеститьОбИзменении(СтруктураДанных.ОписаниеПодписываемогоОбъекта);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНовыеПодписиПакетаСервере(СтруктураДанных)
	Если СтруктураДанных.Отказ Тогда 
		Возврат;  
	КонецЕсли;
	
	ТекущийОбъект = СтруктураДанных.ОписаниеПодписываемогоОбъекта.ПолучитьОбъект();
	ТекущийОбъект.ДобавитьНовыеПодписи(СтруктураДанных);
	ТекущийОбъект.Записать();
	Элементы.ЭППакета.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодписатьПакет(Команда)
	ТекПакет = ЭППакета.Параметры.Элементы[0].Значение;
	
	Если ЗначениеЗаполнено(ТекПакет) Тогда
		СтруктураДанных = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.СформироватьСтруктуруДанныхДляУстановкиПодписей();
		СтруктураДанных.ОписаниеПодписываемогоОбъекта = ТекПакет; 
		СтруктураДанных.УидФормы = УникальныйИдентификатор;

		СтруктураДанных.РежимПредварительногоВыбораСертификатов = Ложь;

	
		ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.ВыбратьСертификатыДляПодписи(СтруктураДанных);
	
		ЗаполнитьОписаниеФайловДляФормированияПодписейНаКлиенте(СтруктураДанных);
	
		ОбработкаЗаписи = Новый ОписаниеОповещения("ЗаписатьНовыеПодписиПакета", ЭтотОбъект, СтруктураДанных);	
		ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент.СоздатьПодписи(СтруктураДанных, ОбработкаЗаписи);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОписаниеФайловДляФормированияПодписейНаКлиенте(СтруктураДанных)
	Если СтруктураДанных.Отказ Тогда 
		Возврат;  
	КонецЕсли;	
	
	ЗаполнитьОписаниеФайловДляФормированияПодписейНаСервере(СтруктураДанных);
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьОписаниеФайловДляФормированияПодписейНаСервере(СтруктураДанных)
	
	ТекущийОбъект = СтруктураДанных.ОписаниеПодписываемогоОбъекта.ПолучитьОбъект();
	
	ТекущийОбъект.ЗаполнитьОписаниеФайловДляФормированияПодписей(СтруктураДанных);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьАктуальностьКомплектовНаСервере()
	WSПрокси = ПолучитьWSПроксиОбмена(30);
	Таб = WSПрокси.GetReportVersion();
	Результат = Таб.Получить();
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТабУстановленныеКомплекты",Результат);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеКомплекты.ИдентификаторКомплекта,
		|	УстановленныеКомплекты.Версия
		|ПОМЕСТИТЬ ТаблицаУстановленныхКомплектовСвода
		|ИЗ
		|	&ТабУстановленныеКомплекты КАК УстановленныеКомплекты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановленныеКомплектыОтчетности.ИдентификаторКомплекта,
		|	УстановленныеКомплектыОтчетности.Наименование,
		|	УстановленныеКомплектыОтчетности.Версия,
		|	ТаблицаУстановленныхКомплектовСвода.Версия КАК ВерсияСвод
		|ИЗ
		|	ТаблицаУстановленныхКомплектовСвода КАК ТаблицаУстановленныхКомплектовСвода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеКомплектыОтчетности КАК УстановленныеКомплектыОтчетности
		|		ПО ТаблицаУстановленныхКомплектовСвода.ИдентификаторКомплекта = УстановленныеКомплектыОтчетности.ИдентификаторКомплекта";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ТекстСообщения = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекВерсия = СокрЛП(ВыборкаДетальныеЗаписи.Версия);
		ТекВерсия = СтрЗаменить(ТекВерсия," ","");
		Если ТекВерсия< ВыборкаДетальныеЗаписи.ВерсияСвод Тогда
			ТекстСообщения = ?(ТекстСообщения<>"",ТекстСообщения + Символы.ПС,"Необходимо обновить:"+ Символы.ПС)+"- комплект """+ВыборкаДетальныеЗаписи.Наименование+""" до версии " + ВыборкаДетальныеЗаписи.ВерсияСвод + " или выше.";	
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Установленные комплекты актуальны.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАктуальностьКомплектов(Команда)
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ТекстСообщения = Нстр("ru='Не выбрана учетная запись обмена со Сводом отчетов.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	ПроверитьАктуальностьКомплектовНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьСформированныеПротоколыНаСервере()
	
	НовыхПротоколов = Справочники.УчетныеЗаписиОбменаСводаОтчетов.ПолучитьСформированныеПротоколы(УчетнаяЗапись);
	
	Элементы.СписокПротоколов.Обновить();
	
	Возврат НовыхПротоколов;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьСформированныеПротоколы(Команда)
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ТекстСообщения = Нстр("ru='Не выбрана учетная запись обмена со Сводом отчетов.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	ОбновленоПротоколов = ПолучитьСформированныеПротоколыНаСервере();
	Если ОбновленоПротоколов>0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Загружены протоколы.'"));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Новых протоколов нет.'"));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбновитьСостоянияОтчетовНаСервере()
	
	НовыхСостояний = Справочники.УчетныеЗаписиОбменаСводаОтчетов.ОбновитьСостоянияОтчетов(УчетнаяЗапись);
	
	Элементы.Список.Обновить();
	
	Возврат НовыхСостояний;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСостоянияОтчетов(Команда)
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ТекстСообщения = Нстр("ru='Не выбрана учетная запись обмена со Сводом отчетов.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	ОбновленоСостояний = ОбновитьСостоянияОтчетовНаСервере();
	Если ОбновленоСостояний>0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Обновлены состояния отчетов.'"));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Обновление состояния отчетов отсутствует.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаКомплектов(Команда)
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ТекстСообщения = Нстр("ru='Не выбрана учетная запись обмена со Сводом отчетов.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("УчетнаяЗапись",УчетнаяЗапись);
	ОткрытьФорму("Обработка.ИмпортКейса.Форма.ФормаЗагрузкиКомплектовИзСервиса",ПараметрыФормы,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВыборУчетнойЗаписи(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораУчетнойЗаписи",ЭтотОбъект);
	ПоказатьВводЗначения(ОписаниеОповещения,УчетнаяЗапись,"Выберите учетную запись для обмена с 1С:Свод отчетов",Тип("СправочникСсылка.УчетныеЗаписиОбменаСводаОтчетов"));
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораУчетнойЗаписи(Результат, ДопПараметры) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		УчетнаяЗапись = Результат;
	КонецЕсли;
	
	УчетнаяЗаписьПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбычныйРежим(Команда)
	РежимРаботы = 0;
	ПереключитьВидимостьЭлеменовОбменаСоСводомОтчетов();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимОбменаСоСводом(Команда)
	РежимРаботы = 1;
	ПереключитьВидимостьЭлеменовОбменаСоСводомОтчетов();
КонецПроцедуры

#КонецОбласти

#Область ВыводБланкаВExcel

&НаКлиенте
Процедура ОткрытьВExcel(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивОтчетов = Новый Массив;
	ТипОтчета = Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет");
	Для Каждого ТекСтр Из Элементы.Список.ВыделенныеСтроки Цикл
		Если ТипЗнч(ТекСтр) = ТипОтчета Тогда
			МассивОтчетов.Добавить(ТекСтр);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОтчетов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Не выделены строки отчетов, которые необходимо сохранить в Excel.'"));
		Возврат;
	КонецЕсли;
	СохранятьВАрхив = МассивОтчетов.Количество()>1;
	
	Если СохранятьВАрхив Тогда
		Результат = ПолучитьАрхивОтчетов(МассивОтчетов);
		Если НЕ Результат.ЗаданиеВыполнено Тогда
			// Обработчик будет подключаться до тех пор, пока фоновое задание не будет выполнено
			ПодключатьОбработчикОжидания = ЗначениеЗаполнено(ИдентификаторЗадания);
			Если ПодключатьОбработчикОжидания Тогда
				ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания("Подключаемый_ПроверитьФормированиеАрхива", 1, Истина);
				ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
			КонецЕсли;
			
		Иначе
			СохранитьФайлАрхива();
		КонецЕсли;
	Иначе
		
		Результат = ПолучитьФайлExcelНаСервере(МассивОтчетов[0]);
		Если НЕ Результат.ЗаданиеВыполнено Тогда
			// Обработчик будет подключаться до тех пор, пока фоновое задание не будет выполнено
			ПодключатьОбработчикОжидания = ЗначениеЗаполнено(ИдентификаторЗадания);
			Если ПодключатьОбработчикОжидания Тогда
				ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания("Подключаемый_ПроверитьФормированиеExcel", 1, Истина);
				ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
			КонецЕсли;
			
		Иначе
			ВывестиФайлExcel();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьФормированиеExcel()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			ВывестиФайлExcel();
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьФормированиеExcel", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервере
Функция ПолучитьФайлExcelНаСервере(ОтчетСсылка)
	
	СтруктураПараметров = Новый Структура();	
	СтруктураПараметров.Вставить("ОтчетСсылка", ОтчетСсылка);
	
	НаименованиеФоновогоЗадания = НСтр("ru = 'Вывод регламентированного отчета в Excel'");
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор, 
		"Документы.УниверсальныйРегламентированныйОтчет.СформироватьФайлДляExcelПакетомОтчетов",
		СтруктураПараметров, 
		НаименованиеФоновогоЗадания);
		
	АдресФайлаExcel      = Результат.АдресХранилища;
	ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВывестиФайлExcel()
	
	#Если ВебКлиент Тогда
		ПолучитьФайл(АдресФайлаExcel, "Report.xlsx", Истина);
	#Иначе
		ИмяФайлаExcel = ПолучитьИмяВременногоФайла("xlsx");
		ПолучитьФайл(АдресФайлаExcel, ИмяФайлаExcel, Ложь);
		
		Оповещение = Новый ОписаниеОповещения("ЗапускПриложения", ЭтотОбъект);
		НачатьЗапускПриложения(Оповещение, ИмяФайлаExcel);
	#КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложения(Результат, ДополнительныйПараметр) Экспорт
	Возврат;
КонецПроцедуры

&НаСервере
Функция ПолучитьАрхивОтчетов(Знач МассивОтчетов)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("МассивОтчетов", МассивОтчетов);
	
	НаименованиеФоновогоЗадания = НСтр("ru = 'Сохранение регламентированных отчетов в Excel'");
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор, 
		"Документы.УниверсальныйРегламентированныйОтчет.СформироватьФайлыДляExcelВАрхиве",
		СтруктураПараметров, 
		НаименованиеФоновогоЗадания);
		
	АдресФайлаExcel      = Результат.АдресХранилища;
	ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьФормированиеАрхива()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			СохранитьФайлАрхива();
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьФормированиеАрхива", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлАрхива()
	
	ТекДата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	ПолучитьФайл(АдресФайлаExcel, "Reports "+ТекДата+".zip", Истина);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ ЗагрузкаАктивна Тогда
		ЗагрузкаАктивна = АктивнаЗагрузкаКомплектаНаСервере();
		ПодключитьОбработчикОжиданияЗагрузкаКомплекта();
	КонецЕсли;
	
	Если ЗагрузкаАктивна Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ ЗагрузкаАктивна Тогда
		ЗагрузкаАктивна = АктивнаЗагрузкаКомплектаНаСервере();
		ПодключитьОбработчикОжиданияЗагрузкаКомплекта();
	КонецЕсли;
	
	Если ЗагрузкаАктивна Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПроверкиЗагрузкиКомплектаОтчетности

&НаСервере 
Функция АктивнаЗагрузкаКомплектаНаСервере()
	
	ЗагрузкаАктивна = БюджетнаяОтчетность.ВыполняетсяЗагрузкаКомплекта();
	
	ЭтаФорма.ТолькоПросмотр = ЗагрузкаАктивна;
	Элементы.ПредупреждениеАктивнаяЗагрузкаКомлекта.Видимость = ЗагрузкаАктивна;
	
	Возврат ЗагрузкаАктивна;
	
КонецФункции

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияЗагрузкаКомплекта()
	
	Если ЗагрузкаАктивна Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбработчикОжиданияЗагрузкаКомплекта",30);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЗагрузкаКомплекта()
	
	ЗагрузкаАктивна = АктивнаЗагрузкаКомплектаНаСервере();
	
	Если НЕ ЗагрузкаАктивна Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Загрузка комплекта отчетности завершена. Работа с регламентированной отчетностью доступна в полном объеме.'"));
		ОтключитьОбработчикОжидания("Подключаемый_ОбработчикОжиданияЗагрузкаКомплекта");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом


&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если Команда.Имя = "НоваяВерсияКомплектаДекорацияНадписьЗакрыть" Тогда
		
		ЭлементЗакрыть = Элементы.Найти("НоваяВерсияКомплектаДекорацияНадписьЗакрыть");
		Если ЭлементЗакрыть <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,ЭлементЗакрыть.Родитель.Имя,"Видимость", Ложь);
		КонецЕсли;
		
	ИначеЕсли Команда.Имя = "НоваяВерсияКомплектаДекорацияНадписьЗагрузитьЛокально" Тогда
		
		ОткрытьФорму("Обработка.ИмпортКейса.Форма.ФормаЗагрузкиКомплектовСоСтраницыПоддержки",,ЭтотОбъект);	
		
	ИначеЕсли Команда.Имя = "НоваяВерсияКомплектаДекорацияНадписьЗагрузитьОблако" Тогда
		
		ОткрытьФорму("Обработка.ИмпортКейса.Форма.ФормаЗагрузкиКомплектовИзПоставляемыхДанных",,ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры


		
#КонецОбласти
