
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
	Список, 
	"ПризнакНацПроекта", 
	"___[" + БюджетнаяКлассификацияКлиентСервер.СтрокаКодовНацПроектов() + "]______");
	
	Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		
		НачальноеЗначениеВыбора = Параметры.ТекущаяСтрока;
		
		Если ТипЗнч(Параметры.ТекущаяСтрока) = Тип("Строка") Тогда

			НачальноеЗначениеВыбора =  Справочники.АналитическиеКодыКПС.НайтиПоКоду(Параметры.ТекущаяСтрока);
			
		КонецЕсли;	
		
		Параметры.ТекущаяСтрока = НачальноеЗначениеВыбора;
		
		Элементы.Список.ТекущаяСтрока = НачальноеЗначениеВыбора;
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти
