#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Документы.ИзменениеРешенияОПроведенииИнвентаризации.ЗаполнитьНаОсновании(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("НомерИзменения");
	
	ПроверяемыеРеквизиты.Добавить("Объекты.Примечание");
	
	Если Документы.ИзменениеРешенияОПроведенииИнвентаризации.ЕстьОшибкиЗаполнения(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ИнвентаризацияСервер.ПроверитьДопустимостьИзмененияПометкиУдаленияПередЗаписьюДокументаЦепочкиРешения(ЭтотОбъект, Отказ);
	
	НастройкиДокумента = Документы.ИзменениеРешенияОПроведенииИнвентаризации.ПолучитьНастройкиДокумента();
	
	Документы.ИзменениеРешенияОПроведенииИнвентаризации.ОчиститьНеиспользуемыеКолонки(ЭтотОбъект, НастройкиДокумента);
	
	Документы.ИзменениеРешенияОПроведенииИнвентаризации.ЗаполнитьКолонкуМодифицированность(ЭтотОбъект, НастройкиДокумента);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
