
Функция ВернутьХарактеристикиГосуслуги(Номенклатура,Дата) Экспорт
	Возврат Справочники.Номенклатура.ПолучитьХарактеристикиГосуслуги(Номенклатура, Дата);
КонецФункции

Функция ВернутьШаблонЗаполненияНазначенияПлатежа(Номенклатура) Экспорт
	Возврат Справочники.ШаблоныЗаполненияНПКвитанцииНаОплату.ПолучитьШаблонЗаполнения(Номенклатура);	
КонецФункции

Функция ВернутьПлательщикаПоУчащемусяНаДату(Учащийся,Дата) Экспорт
	
	Если ТипЗнч(Учащийся) = Тип("СправочникСсылка.Дети") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПлательщикиПоУслугамДДУ.Плательщик КАК Плательщик
			|ИЗ
			|	РегистрСведений.ПлательщикиПоУслугамДДУ.СрезПоследних(&Дата, Ребенок = &Ребенок) КАК ПлательщикиПоУслугамДДУ";

		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Ребенок", Учащийся);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Возврат ВыборкаДетальныеЗаписи.Плательщик;
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

Функция ВернутьПериодАктуальныхНастроек(Номенклатура,Дата = Неопределено) Экспорт
	
	Возврат РегистрыСведений.НастройкаИспользованияИдентификаторовПлательщика.ПолучитьПериодАктуальныхНастроек(Номенклатура,Дата);	
	
КонецФункции

Функция ВернутьНастройкуИспользуемыхИдентификаторов(Номенклатура,Дата) Экспорт
	
    Возврат ГосУслуги.ПолучитьНастройкуИспользуемыхИдентификаторов(Номенклатура,Дата);
	
КонецФункции

Функция ВернутьКодФКВидаАльтИдентификатора(ВидАльтеративногоИдентификатора) Экспорт
	
    Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидАльтеративногоИдентификатора,"Префикс");
	
КонецФункции

Функция ВернутьТаблицуНалоговыхРеквизитовПоДокументу(Ссылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеДоходовНачисления.ПоказательДаты,
		|	НачислениеДоходовНачисления.ПоказательНомера,
		|	НачислениеДоходовНачисления.Ссылка.ПоказательОснования КАК ПоказательОснования,
		|	НачислениеДоходовНачисления.Ссылка.ПоказательПериода КАК ПоказательПериода,
		|	НачислениеДоходовНачисления.Ссылка.ПоказательТипа КАК ПоказательТипа,
		|	НачислениеДоходовНачисления.Ссылка.СтатусСоставителя КАК СтатусСоставителя,
		|	НачислениеДоходовНачисления.ИДСтроки,
		|	НачислениеДоходовНачисления.Ссылка.КодБКНалога КАК КодБКПлатежа,
		|	НачислениеДоходовНачисления.Ссылка.КодОКАТО КАК КодОКАТО
		|ИЗ
		|	Документ.НачислениеДоходов.Начисления КАК НачислениеДоходовНачисления
		|ГДЕ
		|	НачислениеДоходовНачисления.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ВернутьТаблицуКПСКЭКПоДокументу(Ссылка) Экспорт

	Запрос = Новый Запрос;
	
	ТипДокумента = ТипЗнч(Ссылка);
	Если ТипДокумента = Тип("ДокументСсылка.СписаниеДоходовБудущихПериодов") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЧДок.КПС КАК КПС,
			|	ТЧДок.КЭК КАК КЭК,
			|	ТЧДок.ИДСтроки КАК ИДСтроки,
			|	ТЧДок.КПС.ДатаНачалаДействия КАК НачалоДействияКПС
			|ИЗ
			|	Документ.СписаниеДоходовБудущихПериодов.ДоходыБудущихПериодов КАК ТЧДок
			|ГДЕ
			|	ТЧДок.Ссылка = &Ссылка";
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.НачислениеПроцентовПенейШтрафовКПолучению") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЧДок.КПС КАК КПС,
			|	ТЧДок.КЭКДоходов КАК КЭК,
			|	ТЧДок.ИДСтроки КАК ИДСтроки,
			|	ТЧДок.КПС.ДатаНачалаДействия КАК НачалоДействияКПС
			|ИЗ
			|	Документ.НачислениеПроцентовПенейШтрафовКПолучению.Начисления КАК ТЧДок
			|ГДЕ
			|	ТЧДок.Ссылка = &Ссылка";	
	КонецЕсли;

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции