
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	КассаККМ 	= Параметры.КассаККМ;
	
	ЗаполнитьЗначенияНастроекНСПК();
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТестовоеПодключениеНСПК(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Перед тестом подключения необходимо записать изменения.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации 								= ЭлектронныеСертификатыНСПККлиентСервер.ПараметрыОперацииНСПК();
	ПараметрыОперации.АдресСервера 					= АдресСервисаНСПК; 
    ПараметрыОперации.КлючДоступа					= КлючОрганизацииНСПК;
    ПараметрыОперации.КлючКассы 					= КлючКассыНСПК;
    ПараметрыОперации.ИдентификаторЗапроса 			= Строка(Новый УникальныйИдентификатор);
    ПараметрыОперации.ИдентификаторКассы 			= ИдентификаторНСПК; 
    ПараметрыОперации.ПроверятьКорневыеСертификаты 	= ПроверятьКорневыеСертификатыНСПК; 
	
	Если ЗначениеЗаполнено(ПротоколОбменаНСПК) Тогда 
		ПараметрыОперации.ПротоколОбмена = ПротоколОбменаНСПК;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПроксиСервер) Тогда
		ПараметрыОперации.ИнтернетПрокси.Сервер 		= ПроксиСервер;
		ПараметрыОперации.ИнтернетПрокси.Порт 			= ПроксиПорт;
		ПараметрыОперации.ИнтернетПрокси.Пользователь 	= ПроксиПользователь;
		ПараметрыОперации.ИнтернетПрокси.Пароль 		= ПроксиПароль;
	КонецЕсли;
	
	ОповещениеМетода = Новый ОписаниеОповещения("ТестовоеПодключениеЗавершение", ЭтотОбъект, ПараметрыОперации);
	ЭлектронныеСертификатыНСПККлиент.НачатьТестовоеПодключение(ОповещениеМетода, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	СохранитьИзмененияНаСервере();
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ТестовоеПодключениеЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыполнения.Результат Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Тест подключения выполнен успешно'"));
	Иначе
		ОписаниеОшибки = НСтр("ru='ОШИБКА: (%1) %2'");
		ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, РезультатВыполнения.КодРезультата, РезультатВыполнения.ОписаниеОшибки); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияНастроекНСПК()
	
	УстановитьПривилегированныйРежим(Истина);
	АдресСервисаНСПК 					= ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Организация, "АдресСервисаНСПК");
	КлючОрганизацииНСПК 				= ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Организация, "КлючОрганизацииНСПК");
	ИдентификаторНСПК 					= ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(КассаККМ	, "ИдентификаторНСПК");
	КлючКассыНСПК 						= ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(КассаККМ	, "КлючКассыНСПК");
	ПроверятьКорневыеСертификатыНСПК 	= ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(КассаККМ	, "ПроверятьКорневыеСертификатыНСПК");
	ПротоколОбменаНСПК					= ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(КассаККМ	, "ПротоколОбменаНСПК");
	
	ИнтернетПроксиНСПК 					= ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(КассаККМ	, "ИнтернетПроксиНСПК");
	Если ЗначениеЗаполнено(ИнтернетПроксиНСПК) Тогда
		ПроксиСервер = ИнтернетПроксиНСПК.Сервер;
		ПроксиПорт = ИнтернетПроксиНСПК.Порт;
		ПроксиПользователь = ИнтернетПроксиНСПК.Пользователь;
		ПроксиПароль = ИнтернетПроксиНСПК.Пароль;
	КонецЕсли; 
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(АдресСервисаНСПК) Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Организация, АдресСервисаНСПК, "АдресСервисаНСПК");
	Иначе
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(Организация, "АдресСервисаНСПК");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючОрганизацииНСПК) Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Организация, КлючОрганизацииНСПК, "КлючОрганизацииНСПК");
	Иначе
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(Организация, "КлючОрганизацииНСПК");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторНСПК) Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(КассаККМ, ИдентификаторНСПК, "ИдентификаторНСПК");
	Иначе
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(КассаККМ, "ИдентификаторНСПК");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючКассыНСПК) Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(КассаККМ, КлючКассыНСПК, "КлючКассыНСПК");
	Иначе
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(КассаККМ, "КлючКассыНСПК");
	КонецЕсли;    
	
	Если ЗначениеЗаполнено(ПроверятьКорневыеСертификатыНСПК) Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(КассаККМ, ПроверятьКорневыеСертификатыНСПК, "ПроверятьКорневыеСертификатыНСПК");
	Иначе
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(КассаККМ, "ПроверятьКорневыеСертификатыНСПК");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПротоколОбменаНСПК) Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(КассаККМ, ПротоколОбменаНСПК, "ПротоколОбменаНСПК");
	Иначе
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(КассаККМ, "ПротоколОбменаНСПК");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПроксиСервер) Тогда
		ИнтернетПроксиНСПК = Новый Структура;
		ИнтернетПроксиНСПК.Вставить("Сервер"		, ПроксиСервер);
		ИнтернетПроксиНСПК.Вставить("Порт"			, ПроксиПорт);
		ИнтернетПроксиНСПК.Вставить("Пользователь"	, ПроксиПользователь);
		ИнтернетПроксиНСПК.Вставить("Пароль"		, ПроксиПароль);    
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(КассаККМ, ИнтернетПроксиНСПК, "ИнтернетПроксиНСПК");
	Иначе
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(КассаККМ, "ИнтернетПроксиНСПК");
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры   

#КонецОбласти
