#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма, Неопределено - Форма отчета или форма настроек отчета.
//       Неопределено когда вызов без контекста.
//   КлючВарианта - Строка, Неопределено - Имя предопределенного
//       или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов без контекста.
//   Настройки - Структура - Настройки общей формы отчета (для изменения).
//       См. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма отчета.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных - настройки для загрузки в компоновщик настроек.
//
// См. синтакс-помощник "Расширение управляемой формы для отчета.ПриЗагрузкеВариантаНаСервере" в синтакс-помощнике.
//
Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
	
	Если Форма.Параметры.Свойство("ОтборСоответствие") Тогда
		ОтчетыСервер.УстановитьФиксированныеОтборы(Форма.Параметры.ОтборСоответствие, Форма.Отчет.КомпоновщикНастроек.Настройки, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыГода = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("ТекущийГод");
	
	Если НЕ ПараметрыГода = Неопределено Тогда
		ПараметрыПериодаПользовательскаяНастройка = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
			ПараметрыГода.ИдентификаторПользовательскойНастройки);
		Если НЕ ПараметрыПериодаПользовательскаяНастройка = Неопределено Тогда
			ПараметрыГода = ПараметрыПериодаПользовательскаяНастройка;
		КонецЕсли;
	КонецЕсли;
	ТекущийГод = ПараметрыГода.Значение;
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаСметаДоход",						"504."+ТекущийГод+"1");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаСметаРасход",						"504."+ТекущийГод+"2");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаПолученоФинансовогоОбеспечения",	"508."+ТекущийГод+"0");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаПринимаемыеОбязательства",			"502."+ТекущийГод+"7");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаПринятыеОбязательства",			"502."+ТекущийГод+"1");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаДенежныеОбязательства",			"502."+ТекущийГод+"2");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаЗакрытия",							"000");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"Счета17Счета",							"17.01,17.03,17.06,17.07,17.30");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"Счета18Счета",							"18.01,18.03,18.06,18.07,18.30");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"Счета17Касса",							"17.34");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"Счета18Касса",							"18.34");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаВнутриведомственныеРасчеты",		"304.04");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаДенежныеСредства",					"201.11,201.21,201.27");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаБанк",								"201.21,201.27");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаКасса",							"201.34");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаОФК",								"201.11");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаВПЛСчета",							"ВПЛ.03,ВПЛ.11,ВПЛ.21,ВПЛ.23,ВПЛ.27");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаВПЛКасса",							"ВПЛ.34");
	
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"Счета205",								"205.00");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"Счета208",								"208.00");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"Счета209",								"209.00");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"Счета21005",							"210.05");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"Счета302",								"302.00");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"Счета30226",							"302.26");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"Счета30306",							"303.06");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"Счета30403",							"304.03");
	УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных,"СчетаНКО01",							"НКО.01");
	
	Для Каждого ЭлементСтруктуры Из КомпоновщикНастроек.Настройки.Структура Цикл
		Если ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
			СкопироватьОтборНастроекКомпоновкиДанных(ЭлементСтруктуры.Настройки.Отбор, НастройкиОтчета.Отбор,
				ЭлементСтруктуры.Настройки.Отбор.ДоступныеПоляОтбора);
		КонецЕсли;
	КонецЦикла;
	
	ОтчетыБГУ.ВывестиПодписьИсполнителяВОтчетСКД(КомпоновщикНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПараметрКомпоновщикаНастроек(ПараметрыДанных, ИмяПараметра, Счета)
	ПараметрыДанных.УстановитьЗначениеПараметра(ИмяПараметра, БухгалтерскийУчет.СписокСчетов(Счета));
КонецПроцедуры

Процедура СкопироватьОтборНастроекКомпоновкиДанных(КоллекцияПриемник, КоллекцияИсточник, ДоступныеПоляОтбораПриемника)

	Для каждого ЭлементОтбора Из КоллекцияИсточник.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			НоваяГруппа = КоллекцияПриемник.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НоваяГруппа, ЭлементОтбора);
			СкопироватьОтборНастроекКомпоновкиДанных(НоваяГруппа, ЭлементОтбора, ДоступныеПоляОтбораПриемника);
		ИначеЕсли ДоступныеПоляОтбораПриемника.НайтиПоле(ЭлементОтбора.ЛевоеЗначение) <> Неопределено Тогда
			НовыйЭлемент = КоллекцияПриемник.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементОтбора);
		КонецЕсли;
	
	КонецЦикла;
		
КонецПроцедуры // СкопироватьОтборСКД()

#КонецОбласти

#КонецЕсли
