#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ПодготовкаДанныхЭДО

Функция ПодготовитьДанныеДляЭД(ДокументСсылка) Экспорт
	ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	Руководитель = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(ДокументСсылка.Организация, 
																				Перечисления.ОтветственныеЛицаОрганизаций.Руководитель,
																				ДокументСсылка.Дата);
	ГлБухгалтер	 = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(ДокументСсылка.Организация, 
																				Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер,
																				ДокументСсылка.Дата);
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.ВалютаДокумента) Тогда
		КурсВзаиморасчетов = 1;
		КратностьВзаиморасчетов = 1;
	Иначе
		КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументСсылка.ВалютаДокумента, ДокументСсылка.Дата);
		КурсВзаиморасчетов = КурсКратность.Курс;
		КратностьВзаиморасчетов = КурсКратность.Кратность;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПередачаОбъектовОС.Номер КАК Номер,
	               |	ПередачаОбъектовОС.Дата КАК Дата,
	               |	ПередачаОбъектовОС.Организация КАК Организация,
	               |	ПередачаОбъектовОС.Контрагент КАК Контрагент,
	               |	ПередачаОбъектовОС.РасчетныйСчетКонтрагента КАК СчетПлательщика,
	               |	ПередачаОбъектовОС.Грузоотправитель КАК Грузоотправитель,
	               |	ВЫБОР
	               |		КОГДА ПередачаОбъектовОС.РасчетныйСчетГрузоотправителя <> ЗНАЧЕНИЕ(Справочник.БанковскиеИКазначейскиеСчета.ПустаяСсылка)
	               |			ТОГДА ПередачаОбъектовОС.РасчетныйСчетГрузоотправителя
	               |	КОНЕЦ КАК СчетГрузоотправителя,
	               |	ПередачаОбъектовОС.Грузополучатель КАК Грузополучатель,
	               |	ВЫБОР
	               |		КОГДА ПередачаОбъектовОС.РасчетныйСчетГрузополучателя <> ЗНАЧЕНИЕ(Справочник.БанковскиеИКазначейскиеСчета.ПустаяСсылка)
	               |			ТОГДА ПередачаОбъектовОС.РасчетныйСчетГрузополучателя
	               |		КОГДА ПередачаОбъектовОС.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ПередачаОбъектовОС.РасчетныйСчетКонтрагента
	               |	КОНЕЦ КАК СчетГрузополучателя,
	               |	ВЫРАЗИТЬ(ПередачаОбъектовОС.РеквизитыЛицевогоСчета КАК Справочник.РеквизитыЛицевыхСчетов).Владелец КАК ЛицевойСчет,
	               |	ПередачаОбъектовОС.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчета,
	               |	&Руководитель КАК Руководитель,
	               |	&ГлБухгалтер КАК ГлавныйБухгалтер,
	               |	ЗНАЧЕНИЕ(Документ.ПередачаОбъектовОС.ПустаяСсылка) КАК ДокументОснование,
	               |	ВЫРАЗИТЬ(ПередачаОбъектовОС.Договор КАК Справочник.Договоры) КАК Договор,
	               |	ВЫРАЗИТЬ(ПередачаОбъектовОС.Договор КАК Справочник.Договоры).НомерДоговора КАК ДокументОснованиеНомер,
	               |	ВЫРАЗИТЬ(ПередачаОбъектовОС.Договор КАК Справочник.Договоры).ДатаДоговора КАК ДокументОснованиеДата,
	               |	ВЫРАЗИТЬ(ПередачаОбъектовОС.Договор КАК Справочник.Договоры).ВидОбязательства КАК ДокументОснованиеНаименование,
	               |	ВЫБОР
	               |		КОГДА ПередачаОбъектовОС.ВалютаДокумента <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОС.ВалютаДокумента КАК Справочник.Валюты).Код
	               |		ИНАЧЕ ВЫРАЗИТЬ(&РегламентированнаяВалюта КАК Справочник.Валюты).Код
	               |	КОНЕЦ КАК ВалютаКод,
	               |	ВЫБОР
	               |		КОГДА ПередачаОбъектовОС.ВалютаДокумента <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОС.ВалютаДокумента КАК Справочник.Валюты).НаименованиеПолное
	               |		ИНАЧЕ ВЫРАЗИТЬ(&РегламентированнаяВалюта КАК Справочник.Валюты).НаименованиеПолное
	               |	КОНЕЦ КАК ВалютаНаименование,
	               |	&КурсВзаиморасчетов КАК Курс,
	               |	ВЫБОР
	               |		КОГДА ПередачаОбъектовОС.ВалютаДокумента <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |			ТОГДА ПередачаОбъектовОС.ВалютаДокумента
	               |		ИНАЧЕ &РегламентированнаяВалюта
	               |	КОНЕЦ КАК Валюта,
	               |	ПередачаОбъектовОС.Контрагент.ОбособленноеПодразделение КАК КонтрагентОбособленноеПодразделение,
	               |	ПередачаОбъектовОС.Контрагент.ГоловнаяОрганизация КАК КонтрагентГоловнаяОрганизация,
	               |	ВЫБОР
	               |		КОГДА ПередачаОбъектовОС.Контрагент.ОбособленноеПодразделение = ИСТИНА
	               |			ТОГДА ВЫБОР
	               |					КОГДА ПередачаОбъектовОС.Контрагент.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |						ТОГДА """"
	               |					КОГДА НЕ ПередачаОбъектовОС.Контрагент.ГоловнаяОрганизация.НаименованиеСокращенное = """"
	               |						ТОГДА ПередачаОбъектовОС.Контрагент.ГоловнаяОрганизация.НаименованиеСокращенное
	               |					КОГДА ПередачаОбъектовОС.Контрагент.ГоловнаяОрганизация.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |							И НЕ ПередачаОбъектовОС.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	               |						ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОС.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо.НаименованиеПолное КАК СТРОКА(1000))
	               |					ИНАЧЕ ПередачаОбъектовОС.Контрагент.ГоловнаяОрганизация.Наименование
	               |				КОНЕЦ
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК КонтрагентГоловнаяОрганизацияПредставление,
	               |	ВЫБОР
	               |		КОГДА ПередачаОбъектовОС.Контрагент.ОбособленноеПодразделение = ИСТИНА
	               |			ТОГДА ВЫБОР
	               |					КОГДА ПередачаОбъектовОС.Контрагент.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |						ТОГДА """"
	               |					ИНАЧЕ ПередачаОбъектовОС.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо.ИНН
	               |				КОНЕЦ
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК КонтрагентГоловнаяОрганизацияИНН,
	               |	ПередачаОбъектовОС.СведенияОВыбытииМаркированныхТоваров КАК СведенияОВыбытииМаркированныхТоваров,
	               |	ПередачаОбъектовОС.Ссылка КАК Ссылка,
	               |	ПередачаОбъектовОС.ОтветственныйПередалТРУВид КАК ОтветственныйПередалТРУВид,
	               |	ПередачаОбъектовОС.ОтветственныйПередалТРУДолжность КАК ОтветственныйПередалТРУДолжность,
	               |	ПередачаОбъектовОС.ОтветственныйПередалТРУИныеСведения КАК ОтветственныйПередалТРУИныеСведения,
	               |	ПередачаОбъектовОС.ОтветственныйПередалТРУ КАК ОтветственныйПередалТРУ,
	               |	ПередачаОбъектовОС.ОтветственныйПередалТРУДоверенность КАК ОтветственныйПередалТРУДоверенность,
	               |	ПередачаОбъектовОС.ОтветственныйПередалТРУОснованиеПолномочий КАК ОтветственныйПередалТРУОснованиеПолномочий,
	               |	ПередачаОбъектовОС.ОтветственныйПередалТРУКонтрагент КАК ОтветственныйПередалТРУКонтрагент,
	               |	ПередачаОбъектовОС.ДатаПередачиТРУ КАК ДатаПередачиТРУ,
	               |	ПередачаОбъектовОС.ТРУПереданы КАК ТРУПереданы
	               |ИЗ
	               |	Документ.ПередачаОбъектовОС КАК ПередачаОбъектовОС
	               |ГДЕ
	               |	ПередачаОбъектовОС.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПередачаОбъектовОСОсновныеСредства.НомерСтроки КАК НомерСтроки,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).НаименованиеПолное = """"
	               |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).Представление
	               |		ИНАЧЕ ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).НаименованиеПолное
	               |	КОНЕЦ КАК НаименованиеНоменклатуры,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).НаименованиеПолное = """"
	               |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).Представление
	               |		ИНАЧЕ ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).НаименованиеПолное
	               |	КОНЕЦ КАК ТоварНаименование,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).НоменклатурныйНомер = """"
	               |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).Код
	               |		ИНАЧЕ ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).НоменклатурныйНомер
	               |	КОНЕЦ КАК КодТовара,
	               |	ПРЕДСТАВЛЕНИЕ(ВЫРАЗИТЬ(&ЕдиницаИзмерения КАК Справочник.КлассификаторЕдиницИзмерения).Наименование) КАК ЕдиницаИзмерения,
	               |	ПРЕДСТАВЛЕНИЕ(ВЫРАЗИТЬ(&ЕдиницаИзмерения КАК Справочник.КлассификаторЕдиницИзмерения).Код) КАК БазоваяЕдиницаКод,
	               |	ПередачаОбъектовОСОсновныеСредства.Количество КАК МассаНетто,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА НЕ ПередачаОбъектовОСОсновныеСредства.Ссылка.СуммаВключаетНДС
	               |				ТОГДА ПередачаОбъектовОСОсновныеСредства.СтоимостьЕдиницы
	               |			КОГДА ПередачаОбъектовОСОсновныеСредства.Ссылка.ВалютаДокумента <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |					И ПередачаОбъектовОСОсновныеСредства.Ссылка.ВалютаДокумента <> &РегламентированнаяВалюта
	               |				ТОГДА (ПередачаОбъектовОСОсновныеСредства.Всего - ПередачаОбъектовОСОсновныеСредства.СуммаНДС) * ВЫБОР
	               |						КОГДА &КурсВзаиморасчетов = 0
	               |							ТОГДА 1
	               |						ИНАЧЕ &КурсВзаиморасчетов
	               |					КОНЕЦ / ВЫБОР
	               |						КОГДА &КратностьВзаиморасчетов = 0
	               |							ТОГДА 1
	               |						ИНАЧЕ &КратностьВзаиморасчетов
	               |					КОНЕЦ / ВЫБОР
	               |						КОГДА ПередачаОбъектовОСОсновныеСредства.Количество = 0
	               |							ТОГДА 1
	               |						ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.Количество
	               |					КОНЕЦ
	               |			КОГДА ПередачаОбъектовОСОсновныеСредства.СуммаНДС = 0 И ПередачаОбъектовОСОсновныеСредства.СтоимостьЕдиницы <> 0
	               |				ТОГДА ПередачаОбъектовОСОсновныеСредства.СтоимостьЕдиницы
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПередачаОбъектовОСОсновныеСредства.Всего = 0
	               |						ТОГДА ПередачаОбъектовОСОсновныеСредства.Сумма
	               |					ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.Всего - ПередачаОбъектовОСОсновныеСредства.СуммаНДС
	               |				КОНЕЦ / ВЫБОР
	               |					КОГДА ПередачаОбъектовОСОсновныеСредства.Количество = 0
	               |						ТОГДА 1
	               |					ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.Количество
	               |				КОНЕЦ
	               |		КОНЕЦ КАК ЧИСЛО(14, 2)) КАК Цена,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА ПередачаОбъектовОСОсновныеСредства.Ссылка.ВалютаДокумента <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |					И ПередачаОбъектовОСОсновныеСредства.Ссылка.ВалютаДокумента <> &РегламентированнаяВалюта
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПередачаОбъектовОСОсновныеСредства.Всего = 0
	               |							ТОГДА ПередачаОбъектовОСОсновныеСредства.Сумма
	               |						ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.Всего - ПередачаОбъектовОСОсновныеСредства.СуммаНДС
	               |					КОНЕЦ * ВЫБОР
	               |						КОГДА &КурсВзаиморасчетов = 0
	               |							ТОГДА 1
	               |						ИНАЧЕ &КурсВзаиморасчетов
	               |					КОНЕЦ / ВЫБОР
	               |						КОГДА &КратностьВзаиморасчетов = 0
	               |							ТОГДА 1
	               |						ИНАЧЕ &КратностьВзаиморасчетов
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПередачаОбъектовОСОсновныеСредства.Всего = 0
	               |						ТОГДА ПередачаОбъектовОСОсновныеСредства.Сумма
	               |					ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.Всего - ПередачаОбъектовОСОсновныеСредства.СуммаНДС
	               |				КОНЕЦ
	               |		КОНЕЦ КАК ЧИСЛО(14, 2)) КАК СуммаБезНДС,
	               |	ВЫБОР
	               |		КОГДА ПередачаОбъектовОСОсновныеСредства.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	               |		ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.СтавкаНДС
	               |	КОНЕЦ КАК СтавкаНДС,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА ПередачаОбъектовОСОсновныеСредства.Ссылка.ВалютаДокумента <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |					И ПередачаОбъектовОСОсновныеСредства.Ссылка.ВалютаДокумента <> &РегламентированнаяВалюта
	               |				ТОГДА ПередачаОбъектовОСОсновныеСредства.СуммаНДС * ВЫБОР
	               |						КОГДА &КурсВзаиморасчетов = 0
	               |							ТОГДА 1
	               |						ИНАЧЕ &КурсВзаиморасчетов
	               |					КОНЕЦ / ВЫБОР
	               |						КОГДА &КратностьВзаиморасчетов = 0
	               |							ТОГДА 1
	               |						ИНАЧЕ &КратностьВзаиморасчетов
	               |					КОНЕЦ
	               |			ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.СуммаНДС
	               |		КОНЕЦ КАК ЧИСЛО(14, 2)) КАК СуммаНДС,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА ПередачаОбъектовОСОсновныеСредства.Ссылка.ВалютаДокумента <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |					И ПередачаОбъектовОСОсновныеСредства.Ссылка.ВалютаДокумента <> &РегламентированнаяВалюта
	               |				ТОГДА ВЫБОР
	               |						КОГДА ПередачаОбъектовОСОсновныеСредства.Всего = 0
	               |							ТОГДА ПередачаОбъектовОСОсновныеСредства.Сумма
	               |						ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.Всего
	               |					КОНЕЦ * ВЫБОР
	               |						КОГДА &КурсВзаиморасчетов = 0
	               |							ТОГДА 1
	               |						ИНАЧЕ &КурсВзаиморасчетов
	               |					КОНЕЦ / ВЫБОР
	               |						КОГДА &КратностьВзаиморасчетов = 0
	               |							ТОГДА 1
	               |						ИНАЧЕ &КратностьВзаиморасчетов
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ПередачаОбъектовОСОсновныеСредства.Всего = 0
	               |						ТОГДА ПередачаОбъектовОСОсновныеСредства.Сумма
	               |					ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.Всего
	               |				КОНЕЦ
	               |		КОНЕЦ КАК ЧИСЛО(14, 2)) КАК СуммаСНДС,
	               |	ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Номенклатура,
	               |	ПРЕДСТАВЛЕНИЕ(ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).СтранаПроисхождения.Код) КАК КодСтраныПроисхождения,
	               |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).СтранаПроисхождения.Наименование КАК НаименованиеСтраныПроисхождения,
	               |	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) КАК НомерГТД,
	               |	""1"" КАК Признак,
	               |	ПередачаОбъектовОСОсновныеСредства.Количество КАК Количество,
	               |	"""" КАК ПризнакДополнительнаяИнформация,
	               |	ВЫРАЗИТЬ(&ЕдиницаИзмерения КАК Справочник.КлассификаторЕдиницИзмерения).Наименование КАК ЕдиницаИзмеренияНаименование,
	               |	ПередачаОбъектовОСОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодКаталога КАК КодКаталога,
	               |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодПоКТРУ КАК КодПоКТРУ,
	               |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодТНВЭД КАК КодТНВЭД,
	               |	"""" КАК СведенияОбъемноСортовогоУчетаМаркированныхТоваров
	               |ИЗ
	               |	Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ПередачаОбъектовОСОсновныеСредства
	               |ГДЕ
	               |	ПередачаОбъектовОСОсновныеСредства.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПередачаОбъектовОСКодыУпаковокМаркируемойПродукции.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ПередачаОбъектовОСКодыУпаковокМаркируемойПродукции.НомерУпаковки КАК НомерУпаковки,
	               |	ПередачаОбъектовОСКодыУпаковокМаркируемойПродукции.ТипУпаковки КАК ТипУпаковки
	               |ИЗ
	               |	Документ.ПередачаОбъектовОС.КодыУпаковокМаркируемойПродукции КАК ПередачаОбъектовОСКодыУпаковокМаркируемойПродукции
	               |ГДЕ
	               |	ПередачаОбъектовОСКодыУпаковокМаркируемойПродукции.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПередачаОбъектовОССведенияПрослеживаемости.РНПТ КАК РНПТ,
	               |	ПередачаОбъектовОССведенияПрослеживаемости.Количество КАК Количество,
	               |	ПередачаОбъектовОССведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	               |	ПередачаОбъектовОССведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки
	               |ИЗ
	               |	Документ.ПередачаОбъектовОС.СведенияПрослеживаемости КАК ПередачаОбъектовОССведенияПрослеживаемости
	               |ГДЕ
	               |	ПередачаОбъектовОССведенияПрослеживаемости.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПередачаОбъектовОСДанныеДляАктированияЕИС.НомерСтроки КАК НомерСтроки,
	               |	ПередачаОбъектовОСДанныеДляАктированияЕИС.ИдентификаторДляАктированияЕИС КАК ИдентификаторДляАктированияЕИС,
	               |	ПередачаОбъектовОСДанныеДляАктированияЕИС.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ПередачаОбъектовОСДанныеДляАктированияЕИС.СтранаПроизводителя КАК СтранаПроизводителя,
	               |	ПередачаОбъектовОСДанныеДляАктированияЕИС.ОбъемВТекстовомВыражении КАК ОбъемВТекстовомВыражении
	               |ИЗ
	               |	Документ.ПередачаОбъектовОС.ДанныеДляАктированияЕИС КАК ПередачаОбъектовОСДанныеДляАктированияЕИС
	               |ГДЕ
	               |	ПередачаОбъектовОСДанныеДляАктированияЕИС.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Руководитель", Руководитель.ОтветственноеЛицоСсылка);
	Запрос.УстановитьПараметр("ГлБухгалтер", ГлБухгалтер.ОтветственноеЛицоСсылка);
	Запрос.УстановитьПараметр("КурсВзаиморасчетов", КурсВзаиморасчетов);
	Запрос.УстановитьПараметр("КратностьВзаиморасчетов", КратностьВзаиморасчетов);
	Запрос.УстановитьПараметр("РегламентированнаяВалюта", ВалютаРегУчета);
	Запрос.УстановитьПараметр("СтавкаБезНДС", Перечисления.СтавкиНДС.БезНДС);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЭлектронныеДокументыБГУ.Штуки());
	
	Возврат(Запрос.ВыполнитьПакет());
КонецФункции	

Функция ПредварительныйКонтрольДанныхДляЭД(ДокументСсылка) Экспорт
	Результат = Истина;
	
	ВидКИАдрес = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		ДокументСсылка.Организация, ВидКИАдрес);
		
	Если НЕ ЗначениеЗаполнено(АдресОрганизации) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнен юридический адрес организации.'");
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		Результат = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.Контрагент) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнен контрагент.'");
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		Результат = Ложь;
	Иначе
		Контрагент = ДокументСсылка.Контрагент;
		
		Если ЗначениеЗаполнено(Контрагент.ЮридическоеФизическоеЛицо) Тогда
			Если ТипЗнч(Контрагент.ЮридическоеФизическоеЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
				ВидКИАдрес = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты;
			Иначе
				ВидКИАдрес = Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица;
			КонецЕсли;
			АдресКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				Контрагент.ЮридическоеФизическоеЛицо, ВидКИАдрес);
			
			Если НЕ ЗначениеЗаполнено(АдресКонтрагента) Тогда
				ОписаниеОшибки = НСтр("ru='Не заполнен юридический адрес контрагента.'");
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
				Результат = Ложь;
			КонецЕсли;	
		Иначе
			ОписаниеОшибки = НСтр("ru='Не заполнено юридическое/физическое лицо контрагента.'");
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.РасчетныйСчетКонтрагента) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнен расчетный счет контрагента в форме по ссылке ""Сведения для электронного УПД"" на закладке ""Дополнительно"".'");
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		Результат = Ложь;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.РеквизитыЛицевогоСчета) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнены реквизиты лицевого счета в форме по ссылке ""Сведения для электронного УПД"" на закладке ""Дополнительно"".'");
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		Результат = Ложь;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДокументСсылка.Грузоотправитель) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументСсылка.РасчетныйСчетГрузоотправителя) Тогда
			ОписаниеОшибки = НСтр("ru='Заполнен грузоотправитель, но не заполнен расчетный счет грузоотправителя в форме по ссылке ""Сведения для электронного УПД"" на закладке ""Дополнительно"".'");
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
			Результат = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДокументСсылка.Грузополучатель) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументСсылка.РасчетныйСчетГрузополучателя) Тогда
			ОписаниеОшибки = НСтр("ru='Заполнен грузополучатель, но не заполнен расчетный счет грузополучателя в форме по ссылке ""Сведения для электронного УПД"" на закладке ""Дополнительно"".'");
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
			Результат = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	НеобходимостьДанныхЭДОПродавцаДляГосНужд = ЭлектронныеДокументыБГУ.ВидимостьДанныхЭДОПродавцаДляГосНужд(ДокументСсылка.Контрагент, ДокументСсылка.Организация);
	Если НеобходимостьДанныхЭДОПродавцаДляГосНужд Тогда
		ДанныеЭДОПродавцаДляГосНужд = ЭлектронныеДокументыБГУ.ДанныеДляЭДПродавцаДляГосНужд(ДокументСсылка);
		Если НЕ ЗначениеЗаполнено(ДанныеЭДОПродавцаДляГосНужд.ДатаГосКонтракта) Тогда
			ОписаниеОшибки = НСтр("ru='Не заполнена дата гос.контракта в карточке договора %1 (реквизит ""от"" на закладке ""Обязательство"").'");
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, ДокументСсылка.Договор);
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
			Результат = Ложь;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ДанныеЭДОПродавцаДляГосНужд.НомерГосКонтракта) Тогда
			ОписаниеОшибки = НСтр("ru='Не заполнен номер гос.контракта в карточке договора %1 (реквизит ""№"" на закладке ""Обязательство"").'");
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, ДокументСсылка.Договор);
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
			Результат = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
	Для Каждого ТекСтрока Из ДокументСсылка.ОсновныеСредства Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ОсновноеСредство) Тогда
			ОписаниеОшибки = НСтр("ru='Не заполнен объект основных средств в строке %1 таблицы на закладке ""Основные средства"".'");
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, ТекСтрока.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
			Результат = Ложь;
		КонецЕсли;	
	КонецЦикла;
	
	ЭлектронныеДокументыБГУ.ПроверитьЗаполнениеДанныхМаркировкиВТаблицеМатериалов(ДокументСсылка, "ОсновныеСредства", "Основные средства", "ОсновноеСредство", Результат);
	
	Возврат Результат;
КонецФункции	

// Определяет видимость договора в табличной части в зависимости от вида операции и имущества.
// Если договор в ТЧ виден, он является субконто счета капвложений, по которому происходит списание
//
// Параметры:
//   ДоговорВТабличнойЧасти - Булево - признак наличия договора в табличной части для операцйи возврата со счетов 01 и 02
//   ВидОперации - ПеречислениеСсылка.ВидыОперацийПередачиОС - вид операции передачи ОС
//   ВидИмущества - ПеречислениеСсылка.ВидыИмущества - вид имущества
//
// Возвращаемое значение:
//   Булево - Истина, если договор виден в табличной части
Функция ЕстьДоговорВТабЧасти(ДоговорВТабличнойЧасти, ВидОперации, ВидИмущества) Экспорт
	Возврат ДоговорВТабличнойЧасти 
		ИЛИ 
		(ВидОперации = Перечисления.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106
	 	ИЛИ ВидОперации = Перечисления.ВидыОперацийПередачиОС.ПередачаКапвложений) 
		И ВидИмущества = Перечисления.ВидыИмущества.ВКонцессии;
КонецФункции	

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Настройка недоступности элементов таблицы.
// Ключ структуры - Имя табличной части, значение - массив имен реквизитов табличной части.
// 
// Возвращаемое значение:
//  Структура - Настройка недоступности элементов таблицы
Функция НастройкаНедоступностиЭлементовТаблицы() Экспорт
	Результат = Новый Структура;
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("ОсновноеСредство");
	ИменаРеквизитов.Добавить("ИнвентарныйНомер");
	ИменаРеквизитов.Добавить("КПС");
	ИменаРеквизитов.Добавить("СчетУчета");
	Результат.Вставить("ОсновныеСредства", ИменаРеквизитов);
	Возврат Результат;
КонецФункции

// Добавить данные для печати0510448.
// 
// Параметры:
//  ДанныеДокументов - см. УправлениеПечатьюБГУ.ТаблицаШапкиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448
//  МассивОбъектов - Массив из ДокументОбъект.ПринятиеКУчетуОбъектовОС
//  МЗПоСебестоимости - Булево - не используется для печати ОС
Процедура ДобавитьДанныеДляПечати0510448(ДанныеДокументов, МассивОбъектов, МЗПоСебестоимости = Ложь) Экспорт
	Документы.ПринятиеКУчетуОбъектовОС.ДобавитьДанныеДляПечати0510448(ДанныеДокументов, МассивОбъектов, МЗПоСебестоимости);
КонецПроцедуры

// Добавить данные для печати накладной0510458.
// 
// Параметры:
//  ДанныеДляПечати - см. УправлениеПечатьюБГУ.ТаблицаШапкиДляПечатиНакладной0510458
//  МассивОбъектов - Массив из ДокументСсылка.ПередачаОбъектовОС
Процедура ДобавитьДанныеДляПечатиНакладной0510458(ДанныеДляПечати, МассивОбъектов) Экспорт

	Запрос = Новый Запрос(ТекстЗапроса_ДанныеДляПечатиНакладной0510458());
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Шт = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");
	Запрос.УстановитьПараметр("ШтКод", "796");
	Запрос.УстановитьПараметр("ШтНаименование", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Шт, "Наименование"));
	
	Документы.НакладнаяНаВнутреннееПеремещениеОС2.СобратьДанныеДляНакладной0510458(ДанныеДляПечати, МассивОбъектов, Запрос);

КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Формирует таблицу двдижений по регистру сведений "Операции капвложений"
// Вызывается после формирования таблицы проводок для документа при его проведении
//
// Параметры:
//  ТаблицаПроводок - Таблица значений. Таблица проводок, которые будут сформированы
//  ДокументОбъект - Документ объект. Документ, из которого формируются движения
//  ДополнительныеРеквизиты - Структура. Структура дополнительных реквизитов типовой бухгалтерской операции
//  ТабДвижений - Таблица значений. Исходящая таблица. Ее заполняет эта функция
//  ТекстОшибки - Строка. Исходящая строка, описание ошики. Ее заполняет эта функция, если была ошибка.
//
// Возвращает флаг ошибки. Если Истина - все ОК, иначе - Ложь
Функция ИнициализироватьТабДвиженийДляКарточкиКапвложений(
	ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТабДвижений, ТекстОшибки) Экспорт

	ТекОрганизация = ДокументОбъект.Организация;
	ТекДата        = ДокументОбъект.Дата;
	Для каждого СтрокаТЧ из ДокументОбъект.ОсновныеСредства Цикл
		Если НЕ ОбслуживаниеКарточекКапвложений.ЭтоСчетКапвложений(СтрокаТЧ.СчетУчета) Тогда
			Продолжить;
		ИначеЕсли НЕ СтрокаТЧ.ОтразитьВКарточкеКапвложений ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.КарточкаКапвложений) Тогда
			Продолжить;
		ИначеЕсли ТабДвижений.Найти(СтрокаТЧ.КарточкаКапвложений, "КарточкаКапвложений") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока = ТабДвижений.Добавить();
		НоваяСтрока.Организация         = ТекОрганизация;
		НоваяСтрока.КарточкаКапвложений = СтрокаТЧ.КарточкаКапвложений;
		НоваяСтрока.Период              = ТекДата;
	КонецЦикла;	

	Возврат Истина;
КонецФункции	

// Формирует таблицу разделителей для формирования нескольких документов "Передача объектов ОС" на основании одного 
// документа - основания
// 
// Параметры:
//  - ДокОснование - ДокументСсылка - документ-основание
//
// Возвращает таблицу значений с полями:
//  * КФО - ПеречислениеСсылка.КФО
//  * ВидИмущества - ПеречислениеСсылка.ВидыИмущества
Функция ТаблицаРазделителейДокументов(ДокОснование, СсылкаЦелевогоДокумента = Неопределено) Экспорт
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПоступлениеОС") Тогда
		Возврат(ТаблицаРазделителейДокументов_ПоступлениеОС(ДокОснование, СсылкаЦелевогоДокумента));
	ИначеЕсли ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПринятиеКУчетуОбъектовОС") Тогда
		Возврат(ТаблицаРазделителейДокументов_ПринятиеКУчетуОС(ДокОснование, СсылкаЦелевогоДокумента));
	КонецЕсли;	
КонецФункции	

// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

КонецПроцедуры

// Формирует данные табличной части (ТЧ) документа для проверки остатков в функции ПолучитьОстаткиОСЗабаланс
// общего модуля БухгалтерскиеОперацииПовтИсп
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.ПередачаОбъектовОС - документ, для которого собираем данные ТЧ
//
// Возвращаемое значение:
//  - ТаблицаЗначений - таблица, содержащая данные ТЧ 
Функция ДанныеТЧдляПроверкиОстатковЗабалансомВТО(ДокументСсылка) Экспорт
	ДоговорВТабличнойЧасти = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ДоговорВТабличнойЧасти");
	
	Если ДоговорВТабличнойЧасти Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
		|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ОсновныеСредства.КПС КАК КПС,
		|	ОсновныеСредства.Количество КАК Количество,
		|	ОсновныеСредства.Всего КАК Сумма,
		|	ОсновныеСредства.СчетУчета КАК СчетУчета,
		|	ОсновныеСредства.Ссылка.Контрагент КАК Контрагент,
		|	ОсновныеСредства.Договор КАК Договор
		|ПОМЕСТИТЬ ТабЧасть
		|ИЗ
		|	Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
		|ГДЕ
		|	ОсновныеСредства.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕПСБУВидыСубконто.Ссылка,
		|	МАКСИМУМ(выбор
		|		когда ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
		|			тогда ИСТИНА
		|		иначе ЛОЖЬ
		|	конец) КАК ЕстьДоговоры,		
		|	МАКСИМУМ(выбор
		|		когда ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
		|			тогда ИСТИНА
		|		иначе ЛОЖЬ
		|	конец) КАК ЕстьКонтрагенты
		|ПОМЕСТИТЬ Счета
		|ИЗ
		|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|ГДЕ
		|	ЕПСБУВидыСубконто.Ссылка В
		|		(ВЫБРАТЬ
		|			Таб.СчетУчета
		|		ИЗ
		|			ТабЧасть КАК Таб)
		|	И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
		|	ИЛИ ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
		|СГРУППИРОВАТЬ ПО
		|	ЕПСБУВидыСубконто.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабЧасть.НомерСтроки КАК НомерСтроки,
		|	ТабЧасть.ОсновноеСредство КАК ОсновноеСредство,
		|	ТабЧасть.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ТабЧасть.КПС КАК КПС,
		|	ТабЧасть.Количество КАК Количество,
		|	ТабЧасть.Сумма КАК Сумма,
		|	ТабЧасть.СчетУчета КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА НЕ Счета.ЕстьКонтрагенты
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		ИНАЧЕ ТабЧасть.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА НЕ Счета.ЕстьДоговоры
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
		|		ИНАЧЕ ТабЧасть.Договор
		|	КОНЕЦ КАК Договор
		|ИЗ
		|	ТабЧасть КАК ТабЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ Счета КАК Счета
		|		ПО Счета.Ссылка = ТабЧасть.СчетУчета
		|";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
		|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ОсновныеСредства.КПС КАК КПС,
		|	ОсновныеСредства.Количество КАК Количество,
		|	ОсновныеСредства.Всего КАК Сумма,
		|	ОсновныеСредства.СчетУчета КАК СчетУчета
		|ИЗ
		|	Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
		|ГДЕ
		|	ОсновныеСредства.Ссылка = &Ссылка";
	КонецЕсли;	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции	

// Подготовить таблицу расчетов по документу.
// 
// Параметры:
//  Документ - ДокументОбъект.ПередачаОбъектовОС
//  Параметры - Структура - Параметры
//  Отказ - Булево
// 
// Возвращаемое значение:
//  см. УчетРасчетов.ПустаяТаблицаРасчетовПоДокументу
Функция ПодготовитьТаблицуРасчетовПоДокументу(Документ, Параметры, Отказ) Экспорт
	ТаблицаРасчетов = УчетРасчетов.ПустаяТаблицаРасчетовПоДокументу();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.Код КАК Код
	|ПОМЕСТИТЬ Счета
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Код В (""205.71"", ""205.72"", ""205.73"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛОЖЬ КАК ЭтоПоступление,
	|	ОсновныеСредства.Ссылка.ИФО КАК ИФО,
	|	ОсновныеСредства.Ссылка.КФО КАК КФО,
	|	&КПСДоходов КАК КПС,
	|	ОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ОсновноеСредство.ВидНФА = ЗНАЧЕНИЕ(Перечисление.ВидыНФА.НПА)
	|			ТОГДА ""205.73""
	|		КОГДА ОсновныеСредства.ОсновноеСредство.ВидНФА = ЗНАЧЕНИЕ(Перечисление.ВидыНФА.НМА)
	|			ТОГДА ""205.72""
	|		ИНАЧЕ ""205.71""
	|	КОНЕЦ КАК КодСчета,
	|	ОсновныеСредства.Ссылка.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ДоговорВТабличнойЧасти
	|			ТОГДА ОсновныеСредства.Договор
	|		ИНАЧЕ ОсновныеСредства.Ссылка.Договор
	|	КОНЕЦ КАК Договор,
	|	&Валюта КАК Валюта,
	|	ОсновныеСредства.Всего КАК Сумма,
	|	ОсновныеСредства.СуммаНДС КАК СуммаНДС
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	&ВидДокумента КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.ЭтоПоступление КАК ЭтоПоступление,
	|	ТЧ.ИФО КАК ИФО,
	|	ТЧ.КФО КАК КФО,
	|	ТЧ.КПС КАК КПС,
	|	ТЧ.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(Счета.Ссылка, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетРасчетов,
	|	ЕСТЬNULL(Счет_КЭК.КЭК, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭК,
	|	ТЧ.Контрагент КАК Контрагент,
	|	ТЧ.Договор КАК Договор,
	|	ТЧ.Валюта КАК Валюта,
	|	ТЧ.Сумма КАК СуммаРасчетов,
	|	ТЧ.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	ТЧ КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Счета КАК Счета
	|		ПО ТЧ.КодСчета = Счета.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СоответствияСчетКЭК.Счет КАК Счет,
	|			СоответствияСчетКЭК.КЭК КАК КЭК
	|		ИЗ
	|			РегистрСведений.СоответствияАналитическихСчетовКЭК КАК СоответствияСчетКЭК) КАК Счет_КЭК
	|		ПО Счета.Ссылка = Счет_КЭК.Счет";
	
	ВидДокумента = "Документ." + Документ.Метаданные().Имя + ".ОсновныеСредства";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ВидДокумента", ВидДокумента); 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДокументСсылка", Документ.Ссылка);
	Запрос.УстановитьПараметр("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("КПСДоходов", Параметры.КПС);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРасчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
//		НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(НоваяСтрока.СчетРасчетов);
	КонецЦикла;	
	
	ТаблицаРасчетов.Свернуть(
		"ЭтоПоступление, ИФО, КФО, КПС, Подразделение, КЭК, СчетРасчетов, Контрагент, Договор, Валюта",
		"СуммаНДС, СуммаРасчетов");
	
	Возврат ТаблицаРасчетов;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	//При выбытии ОС с прослеживаемыми товарами таблицы движений готовятся раньше
	Если СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПередачаОбъектовОС.Ссылка КАК Ссылка,
	|	ПередачаОбъектовОС.КФО КАК КФО,
	|	ПередачаОбъектовОС.ВидОперации КАК ВидОперации,
	|	ПередачаОбъектовОС.ВидИмущества КАК ВидИмущества,
	|	ПередачаОбъектовОС.Дата КАК Дата,
	|	ПередачаОбъектовОС.Номер КАК Номер,
	|	ПередачаОбъектовОС.Организация КАК Организация,
	|	ПередачаОбъектовОС.Договор КАК Договор,
	|	ПередачаОбъектовОС.Контрагент КАК Контрагент,
	|	ПередачаОбъектовОС.ПередачаЧастейОбъектов КАК ПередачаЧастейОбъектов,
	|	ПередачаОбъектовОС.ДоговорВТабличнойЧасти КАК ДоговорВТабличнойЧасти,
	|	ПередачаОбъектовОС.Резервировать КАК Резервировать
	|ИЗ
	|	Документ.ПередачаОбъектовОС КАК ПередачаОбъектовОС
	|ГДЕ
	|	ПередачаОбъектовОС.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатыПроведенияДокументов.ДатаПроведения КАК ДатаПроведения
	|ИЗ
	|	РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|ГДЕ
	|	ДатыПроведенияДокументов.Документ = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.ВыполнитьПакет();
	
	РеквизитыДокумента = Новый Структура();
	ДанныеДокумента = Результат[0].Выгрузить();
	Если ДанныеДокумента.Количество() > 0 Тогда
		Для каждого ТекКолонка из ДанныеДокумента.Колонки Цикл
			РеквизитыДокумента.Вставить(ТекКолонка.Имя, ДанныеДокумента[0][ТекКолонка.Имя]);
		КонецЦикла;	
	КонецЕсли;	
	
	Если РеквизитыДокумента.Резервировать Тогда
		Возврат;
	КонецЕсли;	
	
	// Если задана дата проведения, будем использовать ее в запросах
	ВыборкаДатаПроведения = Результат[1].Выбрать();
	Если ВыборкаДатаПроведения.Следующий() И ЗначениеЗаполнено(ВыборкаДатаПроведения.ДатаПроведения) Тогда
		РеквизитыДокумента.Вставить("Дата", ВыборкаДатаПроведения.ДатаПроведения);
	КонецЕсли;	
	
	ПараметрыСписания = УправлениеОсновнымиСредствами.ПараметрыСписанияОСПоРегистрамНакопления(РеквизитыДокумента.ВидОперации);
	ПараметрыСписания.ПередачаЧастейОбъектов = РеквизитыДокумента.ПередачаЧастейОбъектов;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"			, ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента"	, НСтр("ru = 'Акт о приеме-передаче объектов НФА'"));
	Запрос.УстановитьПараметр("НомерДокумента"	, ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДокументСсылка, РеквизитыДокумента.Номер));
	
	ЭтоПередачаВПользование = УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПередачаВПользование(РеквизитыДокумента.ВидОперации);
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|		ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.Ссылка.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМОПолучатель КАК ЦМОПолучатель,
	|	ТаблицаОсновныеСредства.Ссылка.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА
	|			ТаблицаОсновныеСредства.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаОСПолученныхВПользование)
	|		ИЛИ ТаблицаОсновныеСредства.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаОСнаХранении)
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Договор
	|		ИНАЧЕ &ПустойДоговор_ПодЗамену
	|	КОНЕЦ КАК Договор,
	|	ТаблицаОсновныеСредства.Ссылка.ВидОперации КАК ВидОперации,
	|	ЕСТЬNULL(ТаблицаОсновныеСредства.Ссылка.ПервичныйДокумент.ВидПервичногоДокумента, &ИмяДокумента) КАК
	|		НазваниеДокумента,
	|	&НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ТаблицаОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ТаблицаОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц КАК СуммаАмортизацииЗаТекущийМесяц,
	|	ТаблицаОсновныеСредства.ПричинаСписания КАК ПричинаСписания,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|		ИЛИ НЕ ТаблицаОсновныеСредства.ОсновноеСредство.ГрупповойУчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПообъектныйУчет,
	|	ТаблицаОсновныеСредства.СчетУчета КАК СчетУчета,
	|	ТаблицаОсновныеСредства.Ссылка.ПередачаЧастейОбъектов КАК ПередачаЧастейОбъектов
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ТаблицаОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ТаблицаОсновныеСредства.Ссылка)
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	Если РеквизитыДокумента.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаСобственныхОС") 
		И РеквизитыДокумента.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ПраваПользованияНМА") Тогда
		УправлениеОсновнымиСредствами.ДополнитьТекстЗапросаДоговоромИзРНСтоимостьОС(Запрос, РеквизитыДокумента);
		
	ИначеЕсли ЗначениеЗаполнено(ПараметрыСписания.ВидРаспоряженияУКонтрагента) Тогда
		
		Если ЭтоПередачаВПользование Тогда
			УправлениеОсновнымиСредствами.ДополнитьТекстЗапросаДоговоромИзРНСтоимостьОС(Запрос, РеквизитыДокумента);
		ИначеЕсли РеквизитыДокумента.ДоговорВТабличнойЧасти Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПустойДоговор_ПодЗамену", "ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОсновныеСредства.Ссылка.Контрагент", 
			"ВЫБОР
			|		КОГДА НЕ ОстаткиПоКонтрагентам.Контрагент ЕСТЬ NULL
			|			ТОГДА ОстаткиПоКонтрагентам.Контрагент
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			|	КОНЕЦ");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОсновныеСредства.Ссылка.Договор", 
			"ВЫБОР
			|		КОГДА НЕ ОстаткиПоКонтрагентам.Договор ЕСТЬ NULL
			|			ТОГДА ОстаткиПоКонтрагентам.Договор
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
			|	КОНЕЦ");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам.Остатки(
			|				&Период,
			|				Организация = &Организация
			|					И ОсновноеСредство В 
			|						(ВЫБРАТЬ 
			|							ВТ.ОсновноеСредство 
			|						ИЗ Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ВТ 
			|						ГДЕ ВТ.Ссылка = &Ссылка)
			|					И ВидРаспоряжения = &ВидРаспКонтр
			|                   И Контрагент = &Контрагент
			|					) КАК ОстаткиПоКонтрагентам
			|		ПО ТаблицаОсновныеСредства.ОсновноеСредство = ОстаткиПоКонтрагентам.ОсновноеСредство
			|			И ТаблицаОсновныеСредства.ИнвентарныйНомер = ОстаткиПоКонтрагентам.ИнвентарныйНомер
			|			И ТаблицаОсновныеСредства.Ссылка.Контрагент = ОстаткиПоКонтрагентам.Контрагент
			|			И ТаблицаОсновныеСредства.Договор = ОстаткиПоКонтрагентам.Договор
			|ГДЕ");
			
			Запрос.УстановитьПараметр("Контрагент", РеквизитыДокумента.Контрагент);
			
			Запрос.УстановитьПараметр("Период"			, РеквизитыДокумента.Дата);
			Запрос.УстановитьПараметр("Организация"		, РеквизитыДокумента.Организация);
			Запрос.УстановитьПараметр("ВидРаспКонтр"	, ПараметрыСписания.ВидРаспоряженияУКонтрагента);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПустойДоговор_ПодЗамену", "ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОсновныеСредства.Ссылка.Контрагент", "ОстаткиПоКонтрагентам.Контрагент");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОсновныеСредства.Ссылка.Договор", "ОстаткиПоКонтрагентам.Договор");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам.Остатки(
			|				&Период,
			|				Организация = &Организация
			|					И ОсновноеСредство В (ВЫБРАТЬ ВТ.ОсновноеСредство ИЗ Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ВТ ГДЕ ВТ.Ссылка = &Ссылка)
			|					И ВидРаспоряжения = &ВидРаспКонтр
			|                   И Контрагент = &Контрагент
			|                   И Договор = &Договор
			|					) КАК ОстаткиПоКонтрагентам
			|		ПО ТаблицаОсновныеСредства.ОсновноеСредство = ОстаткиПоКонтрагентам.ОсновноеСредство
			|			И ТаблицаОсновныеСредства.ИнвентарныйНомер = ОстаткиПоКонтрагентам.ИнвентарныйНомер
			|ГДЕ");
			
			Запрос.УстановитьПараметр("Контрагент", РеквизитыДокумента.Контрагент);
			Запрос.УстановитьПараметр("Договор", РеквизитыДокумента.Договор);
			
			Запрос.УстановитьПараметр("Период"			, РеквизитыДокумента.Дата);
			Запрос.УстановитьПараметр("Организация"		, РеквизитыДокумента.Организация);
			Запрос.УстановитьПараметр("ВидРаспКонтр"	, ПараметрыСписания.ВидРаспоряженияУКонтрагента);
		КонецЕсли;  
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПустойДоговор_ПодЗамену", "ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)");
	КонецЕсли;
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.ПричинаСписания КАК ПричинаСписания,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ПообъектныйУчет
	|	И (ТаблицаОсновныеСредства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаСобственныхОС)
	|	ИЛИ ТаблицаОсновныеСредства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОС)
	|	ИЛИ (ТаблицаОсновныеСредства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаОСнаХранении)
	|	И ТаблицаОсновныеСредства.СчетУчета = &СчетНеАктивов))";
	
	Запрос.УстановитьПараметр("СчетНеАктивов", 
		БухгалтерскийУчет.СчетПоКоду("02.3", РеквизитыДокумента.Дата, РеквизитыДокумента.Организация));
	
	// Движения по регистрам СтоимостьОбъектовОС и АмортизацияОбъектовОС.
	УправлениеОсновнымиСредствами.ДобавитьТаблицыСписанияОСПоРегистрамНакопления(Запрос, НомераТаблиц,
		ДокументСсылка, ПараметрыСписания);
	
	#Область УчетДрагМатериалов
	ИнициализироватьЗапросыДМ(Запрос, НомераТаблиц);
	#КонецОбласти
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
	Если ЭтоПередачаВПользование Тогда
		Для Каждого СтрокаТаблицы Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений["СтоимостьОбъектовОСПоКонтрагентам"] Цикл
			СтрокаТаблицы.Договор = Справочники.Договоры.ПустаяСсылка();
		КонецЦикла;
	КонецЕсли;
	
	УчетНДСРаздельный.ДобавитьДвиженияНеоблагаемыеНДСОперации(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, ДокументСсылка);
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыДМ(Запрос, НомераТаблиц)
	
	НомераТаблиц.Вставить("НаличиеДрагМатериаловВОбъектахНФА", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПередачаОбъектовОСДрагоценныеМатериалы.НомерСтроки КАК НомерСтроки,
	|	ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка КАК Документ.ПередачаОбъектовОС).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаКапвложений)
	|				ИЛИ ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка КАК Документ.ПередачаОбъектовОС).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106)
	|			ТОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ
	|		ИНАЧЕ ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектНФА
	|	КОНЕЦ КАК ОбъектНФА,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка КАК Документ.ПередачаОбъектовОС).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаКапвложений)
	|				ИЛИ ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка КАК Документ.ПередачаОбъектовОС).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|		ИНАЧЕ ПередачаОбъектовОСДрагоценныеМатериалы.ИнвНомер
	|	КОНЕЦ КАК ИнвНомер,
	|	ПередачаОбъектовОСДрагоценныеМатериалы.ВидДрагМатериала КАК ВидДрагМатериала,
	|	ПередачаОбъектовОСДрагоценныеМатериалы.МассаДМ КАК МассаДМ,
	|	ПередачаОбъектовОСДрагоценныеМатериалы.КоличествоДМ КАК КоличествоДМ,
	|	&ИмяДокумента КАК Основание,
	|	&НомерДокумента КАК НомерОснования,
	|	ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка.Дата КАК ДатаОснования,
	|	ПередачаОбъектовОСДрагоценныеМатериалы.ЕдИзм КАК ЕдИзм,
	|	ИСТИНА КАК ЭтоСписание,
	|	ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка.АналитикаОперацииСДрагМатериалами КАК АналитикаОперации
	|ИЗ
	|	Документ.ПередачаОбъектовОС.ДрагоценныеМатериалы КАК ПередачаОбъектовОСДрагоценныеМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка)
	|ГДЕ
	|	ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка = &Ссылка
	|	И ПередачаОбъектовОСДрагоценныеМатериалы.МассаДМ > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуОбъектовОС";
	КомандаПечати.Идентификатор		= "АктПриемаПередачи0510448";
	КомандаПечати.Представление		= НСтр("ru = 'Акт о приеме-передаче НФА (ф.0510448) (61н, ред. 100н)'");
	КомандаПечати.Порядок			= 1;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "АктПриемаПередачи0504101_103н", 101);
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "АктПриемаПередачи0504101", 102);
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПередачаОбъектовОС";
	КомандаПечати.Идентификатор		= "ПечатьИнвКарточек61н";
	КомандаПечати.Представление		= НСтр("ru = 'Инвентарные карточки объектов (61н)'");
	КомандаПечати.Порядок			= 3;
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПередачаОбъектовОС";
	КомандаПечати.Идентификатор		= "ПечатьКарточекКапвложений";
	КомандаПечати.Представление		= НСтр("ru = 'Карточки капвложений (61н)'");
	КомандаПечати.Порядок			= 4;
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПередачаОбъектовОС";
	КомандаПечати.Идентификатор		= "ПечатьИнвКарточек";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Инвентарные карточки объектов (52н, ред. 103н)'");
	КомандаПечати.Порядок			= 103;
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.Идентификатор		= "ПечатьИнвКарточек"
									+ ",Документ.ПринятиеКУчетуОбъектовОС.АктПриемаПередачи0504101_103н"
									+ ",Документ.ПринятиеКУчетуОбъектовОС.АктПриемаПередачи0504101_103н";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Комплект документов (Акт + инвентарные карточки) (52н, ред. 103н)'");
	КомандаПечати.Порядок			= 104;
	ПервичныеДокументыБГУ.ДобавитьУсловиеКомандыПечати(КомандаПечати, "АктПриемаПередачи0504101_103н");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати    = "Документ.ПередачаОбъектовОС";
	КомандаПечати.Идентификатор     = "Накладная0510458_157н";
	КомандаПечати.Представление     = УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(
		НСтр("ru = 'Накладная на отпуск материальных ценностей на сторону'"), "0510458", "61н", "157н");
	КомандаПечати.Порядок           = 7;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);

	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПередачаОбъектовОС";
	КомандаПечати.Идентификатор		= "Накладная0504205_103н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати( 
		НСтр("ru = 'Накладная на отпуск материалов на сторону'"), "0504205", "52н", "103н", Истина);
	КомандаПечати.Порядок			= 105;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПередачаОбъектовОС";
	КомандаПечати.Идентификатор		= "Накладная0504205_52н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати( 
		НСтр("ru = 'Накладная на отпуск материалов на сторону'"), "0504205", "52н", , Истина);
	КомандаПечати.Порядок			= 106;
	ПервичныеДокументыБГУ.ДобавитьУсловиеКомандыПечати(КомандаПечати);
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПередачаОбъектовОС";
	КомандаПечати.Идентификатор		= "ПечатьТТН_1208";
	КомандаПечати.Представление		= Нстр("ru='Товарно-транспортная накладная (ф. № 1-Т)'");
	КомандаПечати.Обработчик		= "УправлениеПечатьюБГУКлиент.ПечатьТТН";
	КомандаПечати.Порядок			= 9;
	
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "СправкаОСодержанииДрагМатериалов", 9);
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Накладная0510458_157н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная0510458_157н",
			УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Накладная на отпуск материальных ценностей на сторону'"), "0510458", "61н", "157н"),
			УправлениеПечатьюБГУ.НапечататьНакладнуюНаОтпускМЗ0510458(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ПечатьИнвКарточек61н") Тогда
		
		ДанныеДляПечати = УправлениеОсновнымиСредствами.ОбъектыДляГрупповойПечатиКарточек(МассивОбъектов);
		ИменаФайловПечати = Новый Соответствие;
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПечатьИнвКарточек61н","Инвентарные карточки объектов",
			Справочники.ОсновныеСредства.ПечатьИнвентарнойКарточки61н(
			ДанныеДляПечати, ПараметрыПечати, ОбъектыПечати, ИменаФайловПечати),,, ИменаФайловПечати);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ПечатьКарточекКапвложений") Тогда
		
		ДанныеДляПечати = 
			УправлениеОсновнымиСредствами.ОбъектыДляГрупповойПечатиКарточек(МассивОбъектов, "КарточкаКапвложений");

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"ПечатьКарточекКапвложений", НСтр("ru = 'Карточки капвложений (ф.0509211)'"), 
		Справочники.КарточкиКапвложений.Печать0509211(ДанныеДляПечати, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ПечатьИнвКарточек") Тогда
		
		ДанныеДляПечати = 
			УправлениеОсновнымиСредствами.ОбъектыДляГрупповойПечатиКарточек(МассивОбъектов);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПечатьИнвКарточек","Инвентарные карточки объектов",
			Справочники.ОсновныеСредства.ПечатьИнвентарнойКарточки(ДанныеДляПечати, ОбъектыПечати, "103н"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Накладная0504205_103н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная0504205_103н",
			"Накладная на отпуск материалов на сторону (ф.0504205) (в ред.103н)",
			ПечатьНакладной0504205(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_Накладная0504205_103н"));
		
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Накладная0504205_52н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная0504205_52н",
			"Накладная на отпуск материалов на сторону (ф.0504205)",
			ПечатьНакладной0504205(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_Накладная0504205"));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьНакладной0504205(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ЕдИзмШт", ЕдиницаИзмерения);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2
	|	КОНЕЦ КАК ОсновноеСредство,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СчетДебет,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт КАК КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт КАК КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКредит,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КЭККт,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт) КАК Количество
	|ПОМЕСТИТЬ Проводки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(,, Регистратор В (&МассивОбъектов),,) КАК
	|		ЖурналПроводокЕПСБУДвиженияССубконто
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2
	|	КОНЕЦ,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПередачаОбъектовОС.Ссылка КАК Ссылка,
	|	ПередачаОбъектовОС.Дата КАК Дата,
	|	ПередачаОбъектовОС.Номер КАК Номер,
	|	ПередачаОбъектовОС.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ПередачаОбъектовОС.Организация.НаименованиеПолное = """"
	|			ТОГДА ПередачаОбъектовОС.Организация.Наименование
	|		ИНАЧЕ ПередачаОбъектовОС.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Отправитель,
	|	ПередачаОбъектовОС.Организация.КодОКПО КАК ОКПООтправитель,
	|	ПередачаОбъектовОС.Организация.ИНН КАК ИННОтправитель,
	|	ВЫБОР
	|		КОГДА ПередачаОбъектовОС.Подразделение.ОбособленноеПодразделение
	|			ТОГДА ПередачаОбъектовОС.Подразделение.РегистрацияВНалоговомОргане.КПП
	|		ИНАЧЕ ПередачаОбъектовОС.Организация.КПП
	|	КОНЕЦ КАК КППОтправитель,
	|	ПередачаОбъектовОС.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ПередачаОбъектовОС.Подразделение.НаименованиеПолное = """"
	|			ТОГДА ПередачаОбъектовОС.Подразделение.Представление
	|		ИНАЧЕ ПередачаОбъектовОС.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК ПодразделениеОтправитель,
	|	ВЫБОР
	|		КОГДА ПередачаОбъектовОС.Контрагент.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|				КОГДА ПередачаОбъектовОС.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|				И НЕ ПередачаОбъектовОС.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|					ТОГДА ПередачаОбъектовОС.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|				ИНАЧЕ ПередачаОбъектовОС.Контрагент.Представление
	|			КОНЕЦ
	|		ИНАЧЕ ПередачаОбъектовОС.Контрагент.НаименованиеСокращенное
	|	КОНЕЦ КАК Получатель,
	|	ВЫБОР
	|		КОГДА ПередачаОбъектовОС.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ПередачаОбъектовОС.Контрагент.ЮридическоеФизическоеЛицо.КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОКПОПолучатель,
	|	ПередачаОбъектовОС.Контрагент.ИНН КАК ИННПолучатель,
	|	ПередачаОбъектовОС.Контрагент.КПП КАК КПППолучатель,
	|	ПередачаОбъектовОС.Договор.Представление КАК Договор,
	|	ПередачаОбъектовОС.ЦМО.Сотрудник КАК Отпустил,
	|	ПередачаОбъектовОС.Ответственный КАК Ответственный,
	|	ПередачаОбъектовОС.КФО КАК КФО,
	|	ВЫБОР
	|		КОГДА ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство.Наименование
	|		ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ИнвентарныйНомер.НомерПаспорта КАК СТРОКА(100)),
	|			"""") <> """"
	|			ТОГДА ПередачаОбъектовОСОсновныеСредства.ИнвентарныйНомер.НомерПаспорта
	|		КОГДА ЕСТЬNULL(ПередачаОбъектовОСОсновныеСредства.ИнвентарныйНомер.ИнойНомер, """") <> """"
	|			ТОГДА ПередачаОбъектовОСОсновныеСредства.ИнвентарныйНомер.ИнойНомер
	|		КОГДА ЕСТЬNULL(ПередачаОбъектовОСОсновныеСредства.ИнвентарныйНомер.Код, """") <> """"
	|			ТОГДА ПередачаОбъектовОСОсновныеСредства.ИнвентарныйНомер.Код
	|		ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство.Код
	|	КОНЕЦ КАК НомерПаспорта,
	|	ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство.НоменклатурныйНомер КАК НомерНоменклатурный,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения).Код КАК ЕдиницаКод,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения).Наименование КАК ЕдиницаНаименование,
	|	ПередачаОбъектовОСОсновныеСредства.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ПередачаОбъектовОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОС)
	|		ИЛИ ПередачаОбъектовОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОСОперУчет)
	|		ИЛИ ПередачаОбъектовОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106)
	|			ТОГДА ВЫБОР
	|				КОГДА НЕ ПередачаОбъектовОС.СуммаВключаетНДС
	|					ТОГДА ПередачаОбъектовОСОсновныеСредства.ЦенаПродажи
	|				ИНАЧЕ (ПередачаОбъектовОСОсновныеСредства.Всего - ПередачаОбъектовОСОсновныеСредства.СуммаНДС) / ВЫБОР
	|					КОГДА ПередачаОбъектовОСОсновныеСредства.Количество = 0
	|						ТОГДА 1
	|					ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.Количество
	|				КОНЕЦ
	|			КОНЕЦ
	|		ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.СтоимостьЕдиницы
	|	КОНЕЦ КАК Цена,
	|	ПередачаОбъектовОСОсновныеСредства.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ПередачаОбъектовОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОС)
	|		ИЛИ ПередачаОбъектовОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОСОперУчет)
	|		ИЛИ ПередачаОбъектовОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106)
	|			ТОГДА ПередачаОбъектовОСОсновныеСредства.Всего - ПередачаОбъектовОСОсновныеСредства.СуммаНДС
	|		ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.Сумма
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ПередачаОбъектовОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОС)
	|		ИЛИ ПередачаОбъектовОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОСОперУчет)
	|		ИЛИ ПередачаОбъектовОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106)
	|			ТОГДА ПередачаОбъектовОСОсновныеСредства.Всего
	|		ИНАЧЕ ПередачаОбъектовОСОсновныеСредства.Сумма
	|	КОНЕЦ КАК СуммаВсего,
	|	ПередачаОбъектовОСОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(Проводки.СчетДебет.Представление, """") КАК СчетДт,
	|	ЕСТЬNULL(Проводки.КПСДт.Представление, """") КАК КПСДт,
	|	ЕСТЬNULL(Проводки.КЭКДт.Представление, """") КАК КЭКДт,
	|	ЕСТЬNULL(Проводки.СчетКредит.Представление, """") КАК СчетКт,
	|	ЕСТЬNULL(Проводки.КПСКт.Представление, """") КАК КПСКт,
	|	ЕСТЬNULL(Проводки.КЭККт.Представление, """") КАК КЭККт
	|ИЗ
	|	Документ.ПередачаОбъектовОС КАК ПередачаОбъектовОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ПередачаОбъектовОСОсновныеСредства
	|			ЛЕВОЕ СОЕДИНЕНИЕ Проводки КАК Проводки
	|			ПО ПередачаОбъектовОСОсновныеСредства.Ссылка = Проводки.Ссылка
	|			И ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство = Проводки.ОсновноеСредство
	|			И ПередачаОбъектовОСОсновныеСредства.СчетУчета = Проводки.СчетКредит
	|			И ПередачаОбъектовОСОсновныеСредства.КПС = ЕСТЬNULL(Проводки.КПСКт,
	|				ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка))
	|			И Проводки.Количество <> 0
	|		ПО ПередачаОбъектовОС.Ссылка = ПередачаОбъектовОСОсновныеСредства.Ссылка
	|ГДЕ
	|	ПередачаОбъектовОС.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер,
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	Ссылка";
	
	Возврат УправлениеПечатьюБГУ.Напечатать0504205(Запрос, ОбъектыПечати, ИмяМакета);
	
КонецФункции

Функция ТекстЗапроса_ДанныеДляПечатиНакладной0510458()
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокШапка.Ссылка КАК Ссылка,
	|	ДокШапка.Номер КАК Номер,
	|	ДокШапка.Дата КАК Дата,
	|	ДокШапка.Организация КАК Организация,
	|	ДокШапка.ИФО КАК ИФО,
	|	ДокШапка.Подразделение.Наименование КАК НаименованиеОтправитель,
	|	ДокШапка.ЦМО.Сотрудник КАК СотрудникОтправитель,
	|	ВЫБОР
	|		КОГДА ДокШапка.Контрагент.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ДокШапка.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|							И НЕ ДокШапка.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|						ТОГДА ДокШапка.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|					ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДокШапка.Контрагент)
	|				КОНЕЦ
	|		ИНАЧЕ ДокШапка.Контрагент.НаименованиеСокращенное
	|	КОНЕЦ КАК НаименованиеПолучатель,
	|	ВЫБОР
	|		КОГДА ДокШапка.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ВЫРАЗИТЬ(ДокШапка.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОКПОПолучатель,
	|	ВЫБОР
	|		КОГДА ДокШапка.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ВЫРАЗИТЬ(ДокШапка.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоРПБС
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодРПБСПолучателя,
	|	ДокШапка.Контрагент.ИНН КАК ИННПолучатель,
	|	ДокШапка.Контрагент.КПП КАК КПППолучатель,
	|	ВЫБОР
	|		КОГДА ИсторияКППКонтрагент.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьИзменениеКПППолучатель,
	|	ВЫБОР
	|		КОГДА ДокШапка.Перевозчик.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ДокШапка.Перевозчик.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|							И НЕ ДокШапка.Перевозчик.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|						ТОГДА ДокШапка.Перевозчик.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|					ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДокШапка.Перевозчик)
	|				КОНЕЦ
	|		ИНАЧЕ ДокШапка.Перевозчик.НаименованиеСокращенное
	|	КОНЕЦ КАК НаименованиеПеревозчик,
	|	ВЫБОР
	|		КОГДА ДокШапка.Перевозчик.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ВЫРАЗИТЬ(ДокШапка.Перевозчик.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ОКПОПеревозчик,
	|	ДокШапка.Перевозчик.ИНН КАК ИННПеревозчик,
	|	ДокШапка.Перевозчик.КПП КАК КПППеревозчик,
	|	ВЫБОР
	|		КОГДА ИсторияКПППеревозчик.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьИзменениеКПППеревозчик,
	|	ДокШапка.ОснованиеДляАкта КАК ДокументОснование,
	|	ДокШапка.НомерОснованияДляАкта КАК ДокументОснованиеНомер,
	|	ДокШапка.ДатаОснованияДляАкта КАК ДокументОснованиеДата,
	|	ДокШапка.ДоверенностьВидДокумента КАК Доверенность,
	|	ДокШапка.ДатаДоверенности КАК ДоверенностьДата,
	|	ДокШапка.НомерДоверенности КАК ДоверенностьНомер,
	|	ДокШапка.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель,
	|	ДокШапка.Руководитель КАК УполномоченноеЛицо,
	|	"""" КАК ВидПередачиМЗ,
	|	ДокШапка.ВалютаДокумента КАК Валюта,
	|	"""" КАК ПолучилФИО,
	|	"""" КАК ПолучилДолжность,
	|	"""" КАК ПолучилДатаПодписи,
	|	ЛОЖЬ КАК Резервировать
	|ИЗ
	|	Документ.ПередачаОбъектовОС КАК ДокШапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КППИстория КАК ИсторияКППКонтрагент
	|		ПО ДокШапка.Контрагент = ИсторияКППКонтрагент.Ссылка
	|			И (ИсторияКППКонтрагент.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КППИстория КАК ИсторияКПППеревозчик
	|		ПО ДокШапка.Перевозчик = ИсторияКПППеревозчик.Ссылка
	|			И (ИсторияКПППеревозчик.НомерСтроки = 1)
	|ГДЕ
	|	ДокШапка.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер";
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|/////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокТЧ.Ссылка КАК Ссылка,
	|	ДокТЧ.ОсновноеСредство КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ДокТЧ.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ДокТЧ.ОсновноеСредство.Наименование
	|		ИНАЧЕ ДокТЧ.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК НФАНаименование,
	|	ДокТЧ.ОсновноеСредство.ОКП КАК КодТовара,
	|	"""" КАК НФАДопНаименование,
	|	&ШтКод КАК ЕдИзмКод,
	|	&ШтНаименование КАК ЕдИзмНаименование,
	|	ДокТЧ.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОС),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОСОперУчет),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106))
	|			ТОГДА ВЫБОР
	|				КОГДА НЕ ДокТЧ.Ссылка.СуммаВключаетНДС
	|					ТОГДА ДокТЧ.ЦенаПродажи
	|				ИНАЧЕ (ДокТЧ.Всего - ДокТЧ.СуммаНДС) / ВЫБОР
	|					КОГДА ДокТЧ.Количество = 0
	|						ТОГДА 1
	|					ИНАЧЕ ДокТЧ.Количество
	|				КОНЕЦ
	|			КОНЕЦ
	|		КОГДА ДокТЧ.Количество = 0
	|			ТОГДА ДокТЧ.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ДокТЧ.Сумма / ДокТЧ.Количество КАК ЧИСЛО(15, 3))
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОС),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОСОперУчет),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106))
	|			ТОГДА ДокТЧ.Всего - ДокТЧ.СуммаНДС
	|		ИНАЧЕ ДокТЧ.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОС),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОСОперУчет),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106))
	|			ТОГДА ДокТЧ.СтавкаНДС
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	КОНЕЦ КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОС),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОСОперУчет),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106))
	|			ТОГДА ДокТЧ.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ДокТЧ.Ссылка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОС),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОСОперУчет),
	|			ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106))
	|			ТОГДА ДокТЧ.Всего
	|		ИНАЧЕ ДокТЧ.Сумма
	|	КОНЕЦ КАК Всего,
	|	ДокТЧ.КПС КАК КПС,
	|	ДокТЧ.СчетУчета КАК СчетУчета,
	|	НЕОПРЕДЕЛЕНО КАК ДополнительнаяАналитикаСчета,
	|	ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка) КАК КЭК,
	|	ДокТЧ.Ссылка.КФО КАК КФО,
	|	ДокТЧ.НомерСтроки КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК ЗабалансовыйСчетУчета,
	|	НЕОПРЕДЕЛЕНО КАК ЗабалансовыйКПС,
	|	НЕОПРЕДЕЛЕНО КАК ЗабалансовыйКЭК,
	|	НЕОПРЕДЕЛЕНО КАК ЗабалансовыйДополнительнаяАналитикаСчета,
	|	ДокТЧ.ОсновноеСредство.Сведения КАК НФАХарактеристики
	|ИЗ
	|	Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ДокТЧ
	|ГДЕ
	|	ДокТЧ.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	Ссылка";
	
	Возврат ТекстЗапроса;
КонецФункции	

Функция ТекстЗапросаОСДляТТН(ОбщийИтог, ИмяОбъекта) Экспорт

   ТекстЗапроса = "ВЫБРАТЬ
	|	Шапка.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Шапка.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Шапка.Организация
	|		ИНАЧЕ Шапка.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Шапка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Шапка.Контрагент
	|		ИНАЧЕ Шапка.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА Шапка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Шапка.Договор.СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеИКазначейскиеСчета.ПустаяСсылка)
	|						ТОГДА Шапка.РасчетныйСчетКонтрагента
	|					ИНАЧЕ Шапка.Договор.СчетКонтрагента
	|				КОНЕЦ
	|		ИНАЧЕ Шапка.РасчетныйСчетГрузополучателя
	|	КОНЕЦ КАК РасчетныйСчетГрузополучателя,
	|	Шапка.Перевозчик КАК Перевозчик,
	|	Шапка.Организация КАК Организация
	|ИЗ
	|	&ИмяОбъектаШапка КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.ОсновноеСредство КАК Номенклатура,
	|	Таблица.ОсновноеСредство.Код КАК ТоварКод,
	|	Таблица.ИнвентарныйНомер КАК ТоварАртикул,
	|	Таблица.ОсновноеСредство.Наименование КАК ТоварНаименование,
	|	""шт"" КАК БазоваяЕдиницаНаименование,
	|	СУММА(Таблица.Количество) КАК Количество,
	|	СУММА(Таблица.Количество) КАК КоличествоМест,
	|	ВЫБОР
	|		КОГДА НЕ Таблица.Ссылка.ВидОперации В (&ВидыОперацийССуммойПродажи)
	|			ТОГДА Таблица.СтоимостьЕдиницы
	|		КОГДА НЕ Таблица.Ссылка.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА Таблица.Количество = 0
	|						ТОГДА 0
	|					ИНАЧЕ Таблица.Всего / Таблица.Количество
	|				КОНЕЦ
	|		ИНАЧЕ Таблица.ЦенаПродажи
	|	КОНЕЦ КАК Цена,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Таблица.Ссылка.ВидОперации В (&ВидыОперацийССуммойПродажи)
	|				ТОГДА Таблица.Сумма
	|			ИНАЧЕ Таблица.Всего
	|		КОНЕЦ) КАК СуммаСНДС,
	|	"""" КАК НомерПрейскуранта,
	|	"""" КАК ВидУпаковки,
	|	"""" КАК Масса,
	|	"""" КАК НомерЗаписиВКартотеке
	|ИЗ
	|	&ИмяОбъектаОС КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.ОсновноеСредство,
	|	Таблица.ОсновноеСредство.Код,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.ОсновноеСредство.Наименование,
	|	ВЫБОР
	|		КОГДА НЕ Таблица.Ссылка.ВидОперации В (&ВидыОперацийССуммойПродажи)
	|			ТОГДА Таблица.СтоимостьЕдиницы
	|		КОГДА НЕ Таблица.Ссылка.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА Таблица.Количество = 0
	|						ТОГДА 0
	|					ИНАЧЕ Таблица.Всего / Таблица.Количество
	|				КОНЕЦ
	|		ИНАЧЕ Таблица.ЦенаПродажи
	|	КОНЕЦ
	|";
	
	Если ОбщийИтог  Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ИТОГИ ПО
		|	ОБЩИЕ";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ИмяОбъектаШапка",ИмяОбъекта);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ИмяОбъектаОС",ИмяОбъекта+".ОсновныеСредства");
	
	Возврат ТекстЗапроса;

КонецФункции	
	
Функция ДанныеДляТТН(Ссылка, ОбщийИтог = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	ВидыОперацийССуммойПродажи = Новый Массив;
	ВидыОперацийССуммойПродажи.Добавить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106"));
	ВидыОперацийССуммойПродажи.Добавить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОС"));
	ВидыОперацийССуммойПродажи.Добавить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.РеализацияСобственныхОСОперУчет"));
	ВидыОперацийССуммойПродажи.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.Реализация"));
	Запрос.УстановитьПараметр("ВидыОперацийССуммойПродажи", ВидыОперацийССуммойПродажи);
	
	Запрос.Текст = ТекстЗапросаОСДляТТН(ОбщийИтог,"Документ.ПередачаОбъектовОС");
		
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Многопоточный обработчик обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	ПервичныеДокументыБГУ.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры,
		Тип("ДокументСсылка.ПередачаОбъектовОС"));	
	
КонецПроцедуры

// Парный обработчик к процедуре ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию
// 
// Параметры:
//  Параметры - Структура:
//   * ОбработкаЗавершена - Булево
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПервичныеДокументыБГУ.ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры, Тип("ДокументСсылка.ПередачаОбъектовОС"));
	
КонецПроцедуры

#КонецОбласти

#Область ВводНаОсновании

// Формирует таблицу разделителей для формирования нескольких документов "Передача объектов ОС" на основании одного документа
// "Принятие к учету ОС, НМА, НПА"                  
// 
// Параметры:
//  - ДокОснование - ДокументСсылка - документ-основание
//
// Возвращаемое значение:
// 	Структура
//  * Разделители - ТаблицаЗначений
//  * ЗаголовкиКолонок - Структура
Функция ТаблицаРазделителейДокументов_ПринятиеКУчетуОС(ДокОснование, СсылкаЦелевогоДокумента = Неопределено) Экспорт
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДокОснование, "ВидПоступления, ВидИмуществаВТабличнойЧасти");
	
	СтруктураРазделителей = Новый Структура("Разделители, ЗаголовкиКолонок");
	Если РеквизитыДокумента.ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАЗабаланс Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЧОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ТЧОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ТЧОсновныеСредства.ВидИмущества КАК ВидИмущества,
		|	ТЧОсновныеСредства.СчетУчета КАК СчетУчета,
		|	СУММА(ТЧОсновныеСредства.Количество) КАК Количество
		|ПОМЕСТИТЬ ОС_УжеПереданные
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТЧОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|		ТЧОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|		ТЧОсновныеСредства.Ссылка.ВидИмущества КАК ВидИмущества,
		|		ВЫБОР
		|			КОГДА ТЧОсновныеСредства.СчетУчета В ИЕРАРХИИ (&Счет01)
		|				ТОГДА &Счет01
		|			ИНАЧЕ &Счет02
		|		КОНЕЦ КАК СчетУчета,
		|		ТЧОсновныеСредства.Количество КАК Количество
		|	ИЗ
		|		Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ТЧОсновныеСредства
		|	ГДЕ
		|		ТЧОсновныеСредства.Ссылка.ДокументОснование = &Ссылка
		|		И НЕ ТЧОсновныеСредства.Ссылка.ПометкаУдаления
		|		И (&НетСсылкиЦелевогоДокумента 
		|			ИЛИ ТЧОсновныеСредства.Ссылка <> &СсылкаЦелевогоДокумента)) КАК ТЧОсновныеСредства
		|СГРУППИРОВАТЬ ПО		
		|	ТЧОсновныеСредства.ОсновноеСредство,
		|	ТЧОсновныеСредства.ИнвентарныйНомер,
		|	ТЧОсновныеСредства.ВидИмущества,
		|	ТЧОсновныеСредства.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЧОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ТЧОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ТЧОсновныеСредства.ВидИмущества КАК ВидИмущества,
		|	ВЫБОР
		|		КОГДА ТЧОсновныеСредства.СчетУчетаОС В ИЕРАРХИИ (&Счет01)
		|			ТОГДА &Счет01
		|		ИНАЧЕ &Счет02
		|	КОНЕЦ КАК СчетУчета,
		|	ТЧОсновныеСредства.Количество КАК Количество
		|ПОМЕСТИТЬ ОС_НужноПередать
		|ИЗ
		|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ТЧОсновныеСредства
		|ГДЕ
		|	ТЧОсновныеСредства.Ссылка = &Ссылка
		|	И ТЧОсновныеСредства.Ссылка.ВидИмуществаВТабличнойЧасти
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТЧОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ТЧОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ТЧОсновныеСредства.Ссылка.ВидИмущества КАК ВидИмущества,
		|	ВЫБОР
		|		КОГДА ТЧОсновныеСредства.СчетУчетаОС В ИЕРАРХИИ (&Счет01)
		|			ТОГДА &Счет01
		|		ИНАЧЕ &Счет02
		|	КОНЕЦ КАК СчетУчета,
		|	ТЧОсновныеСредства.Количество КАК Количество
		|ИЗ
		|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ТЧОсновныеСредства
		|ГДЕ
		|	ТЧОсновныеСредства.Ссылка = &Ссылка
		|	И НЕ ТЧОсновныеСредства.Ссылка.ВидИмуществаВТабличнойЧасти
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОС_НужноПередать.ОсновноеСредство КАК ОсновноеСредство,
		|	ОС_НужноПередать.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ОС_НужноПередать.ВидИмущества КАК ВидИмущества,
		|	ОС_НужноПередать.СчетУчета КАК СчетУчета,
		|	СУММА(ОС_НужноПередать.Количество - ЕСТЬNULL(ОС_УжеПереданные.Количество, 0)) КАК Количество
		|ПОМЕСТИТЬ ТЧОсновныеСредства
		|ИЗ
		|	ОС_НужноПередать КАК ОС_НужноПередать
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОС_УжеПереданные КАК ОС_УжеПереданные
		|		ПО ОС_НужноПередать.ОсновноеСредство = ОС_УжеПереданные.ОсновноеСредство
		|		И ОС_НужноПередать.ИнвентарныйНомер = ОС_УжеПереданные.ИнвентарныйНомер
		|		И ОС_НужноПередать.ВидИмущества = ОС_УжеПереданные.ВидИмущества
		|		И ОС_НужноПередать.СчетУчета = ОС_УжеПереданные.СчетУчета
		|СГРУППИРОВАТЬ ПО
		|	ОС_НужноПередать.ОсновноеСредство,
		|	ОС_НужноПередать.ИнвентарныйНомер,
		|	ОС_НужноПередать.ВидИмущества,
		|	ОС_НужноПередать.СчетУчета
		|ИМЕЮЩИЕ
		|	СУММА(ОС_НужноПередать.Количество - ЕСТЬNULL(ОС_УжеПереданные.Количество, 0)) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЧОсновныеСредства.ВидИмущества КАК ВидИмущества,
		|	ТЧОсновныеСредства.СчетУчета КАК СчетУчета
		|ИЗ
		|	ТЧОсновныеСредства КАК ТЧОсновныеСредства
		|СГРУППИРОВАТЬ ПО
		|	ТЧОсновныеСредства.ВидИмущества,
		|	ТЧОсновныеСредства.СчетУчета";
		
		СтруктураРазделителей.Вставить("ЗаголовкиКолонок", 
			Новый Структура("ВидИмущества, СчетУчета", "Вид имущества", "Счет учета"));
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТЧОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ТЧОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ТЧОсновныеСредства.Ссылка.ВидИмущества КАК ВидИмущества,
		|	СУММА(ТЧОсновныеСредства.Количество) КАК Количество
		|ПОМЕСТИТЬ ОС_УжеПереданные
		|ИЗ
		|	Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ТЧОсновныеСредства
		|ГДЕ
		|	ТЧОсновныеСредства.Ссылка.ДокументОснование = &Ссылка
		|	И НЕ ТЧОсновныеСредства.Ссылка.ПометкаУдаления
		|	И (&НетСсылкиЦелевогоДокумента 
		|			ИЛИ ТЧОсновныеСредства.Ссылка <> &СсылкаЦелевогоДокумента)
		|СГРУППИРОВАТЬ ПО	
		|	ТЧОсновныеСредства.ОсновноеСредство,
		|	ТЧОсновныеСредства.ИнвентарныйНомер,
		|	ТЧОсновныеСредства.Ссылка.ВидИмущества
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ТЧОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВЫБОР
		|		КОГДА ТЧОсновныеСредства.Ссылка.ВидИмуществаВТабличнойЧасти
		|			ТОГДА ТЧОсновныеСредства.ВидИмущества
		|		ИНАЧЕ ТЧОсновныеСредства.Ссылка.ВидИмущества
		|	КОНЕЦ КАК ВидИмущества,
		|	СУММА(ТЧОсновныеСредства.Количество - ЕСТЬNULL(ОС_УжеПереданные.Количество, 0)) КАК Количество
		|ПОМЕСТИТЬ ОС_МожноПередать
		|ИЗ
		|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ТЧОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОС_УжеПереданные КАК ОС_УжеПереданные
		|		ПО ТЧОсновныеСредства.ОсновноеСредство = ОС_УжеПереданные.ОсновноеСредство
		|		И ТЧОсновныеСредства.ИнвентарныйНомер = ОС_УжеПереданные.ИнвентарныйНомер
		|		И ТЧОсновныеСредства.ВидИмущества = ОС_УжеПереданные.ВидИмущества
		|ГДЕ
		|	ТЧОсновныеСредства.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ТЧОсновныеСредства.ОсновноеСредство,
		|	ТЧОсновныеСредства.ИнвентарныйНомер,
		|	ВЫБОР
		|		КОГДА ТЧОсновныеСредства.Ссылка.ВидИмуществаВТабличнойЧасти
		|			ТОГДА ТЧОсновныеСредства.ВидИмущества
		|		ИНАЧЕ ТЧОсновныеСредства.Ссылка.ВидИмущества
		|	КОНЕЦ
		|ИМЕЮЩИЕ
		|	СУММА(ТЧОсновныеСредства.Количество - ЕСТЬNULL(ОС_УжеПереданные.Количество, 0)) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОС_МожноПередать.ВидИмущества КАК ВидИмущества
		|ИЗ
		|	ОС_МожноПередать КАК ОС_МожноПередать
		|СГРУППИРОВАТЬ ПО
		|	ОС_МожноПередать.ВидИмущества";
		
		СтруктураРазделителей.Вставить("ЗаголовкиКолонок", Новый Структура("ВидИмущества", "Вид имущества"));
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);
	Запрос.УстановитьПараметр("Счет01", БухгалтерскийУчет.СчетПоКоду("01"));
	Запрос.УстановитьПараметр("Счет02", БухгалтерскийУчет.СчетПоКоду("02"));
	Запрос.УстановитьПараметр("СсылкаЦелевогоДокумента", СсылкаЦелевогоДокумента);
	Запрос.УстановитьПараметр("НетСсылкиЦелевогоДокумента", НЕ ЗначениеЗаполнено(СсылкаЦелевогоДокумента));
	
	ТаблицаРазделителей = Запрос.Выполнить().Выгрузить(); 
	СтруктураРазделителей.Вставить("Разделители", ТаблицаРазделителей);
	
	Возврат СтруктураРазделителей;
КонецФункции	

// Формирует таблицу разделителей для формирования нескольких документов "Передача объектов ОС" на основании одного документа
// "Поступление ОС"                  
// 
// Параметры:
//  - ДокОснование - ДокументСсылка - документ-основание
//
// Возвращает таблицу значений с полями:
//  * КФО - ПеречислениеСсылка.КФО
//  * ВидИмущества - ПеречислениеСсылка.ВидыИмущества
Функция ТаблицаРазделителейДокументов_ПоступлениеОС(ДокОснование, СсылкаЦелевогоДокумента = Неопределено) Экспорт
	СвойстваОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокОснование, "Дата, Организация");
	Счета_НедвижимоеИмущество = БухгалтерскийУчет.СписокСчетов(
		"106.10", СвойстваОбъекта.Дата,, СвойстваОбъекта.Организация);
	Счета_ДвижимоеОсобоЦенное = БухгалтерскийУчет.СписокСчетов(
		"106.20", СвойстваОбъекта.Дата,, СвойстваОбъекта.Организация);
	Счета_ИноеДвижимое = БухгалтерскийУчет.СписокСчетов(
		"106.30", СвойстваОбъекта.Дата,, СвойстваОбъекта.Организация);
	Счета_ВКонцессии = БухгалтерскийУчет.СписокСчетов(
		"106.90", СвойстваОбъекта.Дата,, СвойстваОбъекта.Организация);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТЧОсновныеСредства.КФО КАК КФО,
	|	ВЫБОР
	|		КОГДА ТЧОсновныеСредства.СчетУчета В (&Счета_НедвижимоеИмущество)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|		КОГДА ТЧОсновныеСредства.СчетУчета В (&Счета_ДвижимоеОсобоЦенное)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное)
	|		КОГДА ТЧОсновныеСредства.СчетУчета В (&Счета_ИноеДвижимое)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|		КОГДА ТЧОсновныеСредства.СчетУчета В (&Счета_ВКонцессии)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ВКонцессии)
	|	КОНЕЦ КАК ВидИмущества
	|ИЗ
	|	Документ.ПоступлениеОС.КапВложения КАК ТЧОсновныеСредства
	|ГДЕ
	|	ТЧОсновныеСредства.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧОсновныеСредства.КФО,
	|	ВЫБОР
	|		КОГДА ТЧОсновныеСредства.СчетУчета В (&Счета_НедвижимоеИмущество)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.НедвижимоеИмущество)
	|		КОГДА ТЧОсновныеСредства.СчетУчета В (&Счета_ДвижимоеОсобоЦенное)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное)
	|		КОГДА ТЧОсновныеСредства.СчетУчета В (&Счета_ИноеДвижимое)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ИноеДвижимое)
	|		КОГДА ТЧОсновныеСредства.СчетУчета В (&Счета_ВКонцессии)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ВКонцессии)
	|	КОНЕЦ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);
	Запрос.УстановитьПараметр("Счета_НедвижимоеИмущество", Счета_НедвижимоеИмущество);
	Запрос.УстановитьПараметр("Счета_ДвижимоеОсобоЦенное", Счета_ДвижимоеОсобоЦенное);
	Запрос.УстановитьПараметр("Счета_ИноеДвижимое", Счета_ИноеДвижимое);
	Запрос.УстановитьПараметр("Счета_ВКонцессии", Счета_ВКонцессии);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

//Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
//	Перем ЗначенияЗаполнения;
//	
//	Если ВидФормы = "ФормаОбъекта" Тогда
//		
//		Если Не Параметры.Свойство("Ключ") // новый документ
//			И Не Параметры.Свойство("ЗначениеКопирования") // не копируется
//			И (Не Параметры.Свойство("ЗначенияЗаполнения", ЗначенияЗаполнения)
//				Или ТипЗнч(ЗначенияЗаполнения) <> Тип("Структура")
//				Или Не ЗначенияЗаполнения.Свойство("ВидОперации"))
//			И Не Параметры.Свойство("Основание") Тогда
//			
//			СтандартнаяОбработка = Ложь;
//			ВыбраннаяФорма = "ФормаВыбораВидаПередачи";
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти
