
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Период") Тогда
		ДатаОтбор = Параметры.Отбор.Период;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаОтбор) Тогда
		ДатаОтбор = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Элементы.ВидОбъектаОтбор.ПараметрыВыбора = Новый ФиксированныйМассив(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый ПараметрВыбора("Отбор.Ссылка", РегистрыСведений.ЗначениеРеквизитовПоУмолчанию.ВозможныеИОМ())));
	
	Список.Параметры.УстановитьЗначениеПараметра("Период", ДатаОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ВыборОбъектовМетаданных" и Источник = УникальныйИдентификатор и ТипЗнч(Параметр) = Тип("СписокЗначений") Тогда
		Если Параметр.Количество()>0 Тогда
			Элементы.ВидОбъектаОтбор.СписокВыбора.Очистить();
			Элементы.ВидОбъектаОтбор.СписокВыбора.Добавить(Параметр[0].Значение, Параметр[0].Представление);
			ВидОбъектаОтбор = Параметр[0].Значение;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ВидОбъекта", ВидОбъектаОтбор,,, ЗначениеЗаполнено(ВидОбъектаОтбор));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаОтборПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("Период", ДатаОтбор);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаОтборПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ВидОбъекта", ВидОбъектаОтбор,,, ЗначениеЗаполнено(ВидОбъектаОтбор));
КонецПроцедуры

#КонецОбласти
