// Структура с необходимыми полями строки, которая была отредактирована в таблице.
// Содержит значения полей на момент начала редактирования.
// Используется для отмены редактирования.
&НаКлиенте
Перем РедактируемаяСтрока;

&НаКлиенте
Перем ТекстЗаголовкаСообщений;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Инициализация:
	ВалютаРУ = Константы.ВалютаРегламентированногоУчета.Получить();
	
	// Настраиваем форму:
	НастроитьФормуСервер();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.Подвал);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Инициализация
	ТекстЗаголовкаСообщений = НСтр("ru='Инвентаризация остатков на счетах учета денежных средств'");
	
	НастроитьТипЗначенияКассовогоОргана();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	//---
	// Поддержка выбора инвентаризационной комиссии.
	//---
	Если ИсточникВыбора.ИмяФормы = "Справочник.ПостоянноДействующиеКомиссии.Форма.ФормаВыбора" Тогда
		
		УправлениеОсновнымиСредствамиКлиент.УстановитьКомиссиюВДокументОС(	ВыбранноеЗначение,
																			Объект,
																			ЭтаФорма,
																			Объект.НомерПриказаКомиссии,
																			Объект.ДатаПриказаКомиссии);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.Сотрудники.ФормаВыбора"
		ИЛИ ИсточникВыбора.ИмяФормы = "Справочник.Сотрудники.Форма.ФормаВыбора" Тогда
		
		УправлениеОсновнымиСредствамиКлиент.ОбработатьВыборПредседателяКомиссии(
			ЭтаФорма,
			ВыбранноеЗначение,
			,
			Объект.ДолжностьПредседателяКомиссии,
			Объект.ФамилияПредседателяКомиссии,
			Объект.ИмяПредседателяКомиссии,
			Объект.ОтчествоПредседателяКомиссии);
	КонецЕсли;
	//---
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Нужно ли оставить видимыми колонки блока валюты, несмотря на значение соотв.функц.опции?
	ОпределитьНеобходимостьВключитьВидимостьКолонокВалютыСервер(ТекущийОбъект);
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииПоляОрганизация();
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	//---
	// Флажок <без ограничения>
	//---
	ОбщегоНазначенияБГУКлиентСервер.ФлажокБезОграничения_РеквизитСсылка_ПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура БезУчетаИФОПриИзменении(Элемент)
	
	//---
	// Флажок <без ограничения>
	//---
	ОбщегоНазначенияБГУКлиентСервер.ФлажокБезОграничения_РеквизитФлажок_ПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

// Настраивает отметки в списке счетов, соответствующие текущему значению типа лицевого счета.
&НаКлиенте
Процедура ТипЛицевогоСчетаПриИзменении(Элемент)
	
	// Настраиваем тип значения кассового органа:
	НастроитьТипЗначенияКассовогоОргана();
	
    // Отмечаем строки ТЧ.
	ОбозначениеТипа		= ПолучитьОбозначениеИзТипаЛицевогоСчета(Объект.ТипЛицевогоСчета);
	ТипКазначейский		= (ОбозначениеТипа = "Казначейский");
	ТипБанковский		= (ОбозначениеТипа = "Банковский");
	ТипБезОграничения	= (ОбозначениеТипа = "");
	ТаблЧасть = Объект["СписокСчетов"];
	Для Каждого СтрокаТЧ Из ТаблЧасть Цикл
		СтрокаТЧ["УчаствуетВРасчетах"] =
			((ТипБезОграничения ИЛИ ТипКазначейский) И СписокСчетовПоУмолчанию.Казначейские.Найти(СтрокаТЧ.Счет) <> Неопределено)
			ИЛИ
			((ТипБезОграничения ИЛИ ТипБанковский) И СписокСчетовПоУмолчанию.Банковские.Найти(СтрокаТЧ.Счет) <> Неопределено);
	КонецЦикла;
	
	//---
	// "Предустановленные отборы" в параметрах выбора элементов "Счет" формы
	//---
	ВходныеДанные = Новый Структура("ТипЛицевогоСчета, ПредустановленныеОтборы_Счет", Объект.ТипЛицевогоСчета, ПредустановленныеОтборы_Счет);
	ПредустановленныеОтборы_УстановитьПараметрыВыбораЭлементаСчет(Элементы["СписокСчетовСчет"], ВходныеДанные);
	
КонецПроцедуры
&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// РешениеОПроведенииИнвентаризации
&НаКлиенте
Процедура РешениеОПроведенииИнвентаризацииПриИзменении(Элемент)
	
	ИнвентаризацияКлиент.ВыбраноРешениеОПроведенииИнвентаризации(ЭтаФорма);
	
КонецПроцедуры
// Конец РешениеОПроведенииИнвентаризации

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОстаткиДенежныхСредств
&НаКлиенте
Процедура ОстаткиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы["Остатки"].ТекущиеДанные;
	
	// Настраивает тип значения колонки "Кассовый орган":
	Если ЗначениеЗаполнено(ТекДанные["КассовыйОрган"]) Тогда
		// Настраиваем элемент:
		Элементы["ОстаткиКассовыйОрган"].ВыбиратьТип = Ложь;
	Иначе
		// Настраиваем элемент:
		Элементы["ОстаткиКассовыйОрган"].ВыбиратьТип = (КассовыйОрган_ПустаяСсылка = Неопределено);
		
		// Устанавливаем ссылку нужного типа:
		ТекДанные["КассовыйОрган"] = КассовыйОрган_ПустаяСсылка;
	КонецЕсли;
	
	// При копировании очищаем поля, заполняемые по данным учета:
	Если Копирование Тогда
		ОчищающаяСтруктура = Новый Структура("
			|ЛицевойСчет,
			|РазделЛицевогоСчета,
			|РеквизитыЛицевогоСчета,
			|НомерЛицевогоСчета");
		ЗаполнитьЗначенияСвойств(ТекДанные, ОчищающаяСтруктура);
	КонецЕсли;
	
	// Запоминаем значения полей строки в начале ее редактирования:
	РедактируемаяСтрока = Новый Структура("
		|ЛицевойСчет,
		|РазделЛицевогоСчета,
		|РеквизитыЛицевогоСчета,
		|КассовыйОрган,
		|НомерЛицевогоСчета,
		|Валюта,
		|Курс,
		|Кратность,
		|СуммаВал,
		|СуммаРУ");

	ЗаполнитьЗначенияСвойств(РедактируемаяСтрока, ТекДанные);
	
КонецПроцедуры
&НаКлиенте
Процедура ОстаткиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы["Остатки"].ТекущиеДанные;
	
	Если ОтменаРедактирования Тогда
		
		Если НЕ НоваяСтрока Тогда
			// Восстанавливаем значение всех полей строки,
			// которые были запомнены в момент начала ее редактирования:
			ЗаполнитьЗначенияСвойств(ТекДанные, РедактируемаяСтрока);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

// ----- Остатки . Лицевой счет -----
&НаКлиенте
Процедура ОстаткиЛицевойСчетПриИзменении(Элемент)
	
	ОбновитьПоляСвязанныеСЛицевымСчетом("ЛицевойСчет");
	
КонецПроцедуры
&НаКлиенте
Процедура ОстаткиРеквизитыЛицевогоСчетаПриИзменении(Элемент)
	
	ОбновитьПоляСвязанныеСЛицевымСчетом("РеквизитыЛицевогоСчета");
	
КонецПроцедуры


// ----- Остатки . Валюта -----
&НаКлиенте
Процедура ОстаткиВалютаПриИзменении(Элемент)
	
	ТекДанные = Элементы["Остатки"].ТекущиеДанные;
	
	КурсКратность		= ПолучитьКурс(ТекДанные.Валюта, Объект.Дата);
	ТекДанные.Курс		= КурсКратность.Курс;
	ТекДанные.Кратность	= КурсКратность.Кратность;
	
	Если ЗначениеЗаполнено(ТекДанные.Валюта) Тогда
		ИзмененаСуммаРУ = ЗначениеЗаполнено(ТекДанные["СуммаРУ"]) И НЕ ЗначениеЗаполнено(ТекДанные["СуммаВал"]);
		ПересчитатьСуммуСтроки(ИзмененаСуммаРУ);
	Иначе
		// При очистке валюты очищаем и СуммуВал:
		ТекДанные["СуммаВал"] = 0;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОстаткиСуммаВалПриИзменении(Элемент)
	
	ПересчитатьСуммуСтроки();
	
КонецПроцедуры
&НаКлиенте
Процедура ОстаткиКурсПриИзменении(Элемент)
	
	ПересчитатьСуммуСтроки();
	
КонецПроцедуры
&НаКлиенте
Процедура ОстаткиКратностьПриИзменении(Элемент)
	
	ПересчитатьСуммуСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиСуммаРУПриИзменении(Элемент)
	
	ПересчитатьСуммуСтроки(Истина);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокСчетов

&НаКлиенте
Процедура СписокСчетовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы["СписокСчетов"].ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено И НЕ ОтменаРедактирования Тогда
		
		ТекСчет = ТекДанные["Счет"];
		
		// В новой строке, если заполнен счет, то автоматически устанавливаем флажок "Участвует":
		Если НоваяСтрока И ЗначениеЗаполнено(ТекСчет) Тогда
			ТекДанные["УчаствуетВРасчетах"] = Истина;
		ИначеЕсли НЕ ЗначениеЗаполнено(ТекСчет) Тогда
			ТекДанные["УчаствуетВРасчетах"] = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставКомиссии
&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеОсновнымиСредствамиКлиент.ОбработатьПодборКомиссии(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода",	Объект["ДатаНачала"]);
	СтруктураПараметров.Вставить("КонецПериода",	Объект["ДатаОкончания"]);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Объект["ДатаНачала"]	= РезультатВыбора["НачалоПериода"];
		Объект["ДатаОкончания"]	= РезультатВыбора["КонецПериода"];
	КонецЕсли;
	
КонецПроцедуры

// Страница "Остатки денежных средств"
&НаКлиенте
Процедура ЗаполнитьПоДаннымУчета(Команда)
	
	ПроверитьИЗаполнитьПоДаннымУчета();
	
КонецПроцедуры

// Страница "Настройки заполнения"
&НаКлиенте
Процедура ЗаполнитьСписокСчетовПоУмолчанию(Команда)
	
	ПроверитьИЗаполнитьСписокСчетовПоУмолчанию();
	
КонецПроцедуры

// Страница "Комиссия"
&НаКлиенте
Процедура ВыбратьКомиссию(Команда)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", Объект.Организация));
		ОткрытьФорму("Справочник.ПостоянноДействующиеКомиссии.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Сначала необходимо выбрать организацию'"), 10, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьВыборПредседателяКомиссии(ЭтаФорма, Объект.Организация, Объект.Дата);
	
КонецПроцедуры
&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборКомиссии(Элементы.СоставКомиссии, Объект.Организация, Объект.Дата);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик выбора строки постоянно действующией комиссии. см.ОбщегоНазначенияБГУКлиент.НачатьВыборПостоянноДействующейКомиссии.
// "Объект" передается явно, без этого данные объекта не заполняются в web-клиенте.
&НаКлиенте
Процедура УстановитьКомиссиюВДокумент(Результат, ДопПараметры) Экспорт
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Результат, ДопПараметры, Объект)	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСервер()
	
	// Для нового документа:
	Если Объект.Ссылка.Пустая() Тогда
		
		// Этот документ создан копированием?
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			// Это копия существующего документа.
			// Очищаем табличные части:
			Объект["Остатки"].Очистить();
			
			// Выводим сообщение:	
			ТекстСообщения = НСтр("ru='Этот документ был создан путем копирования другого документа. Поэтому некоторые табличные части и реквизиты копии были очищены.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
				Объект.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
	//---
	// Флажок <без ограничения>
	//---
	НастройкиМеханизма = Документы.ИнвентаризацияРасчетовПоПоступлениям.ФлажокБезОграничения_ПолучитьНастройкиМеханизма();
	ОбщегоНазначенияБГУ.ФлажокБезОграничения_ИнициализироватьФорму(ЭтаФорма, НастройкиМеханизма);
	
	//---
	// "Предустановленные отборы" в параметрах выбора элементов "Счет" формы
	//---
	ПредустановленныеОтборы_Инициализация();
	ВходныеДанные = Новый Структура("ТипЛицевогоСчета, ПредустановленныеОтборы_Счет", Объект.ТипЛицевогоСчета, ПредустановленныеОтборы_Счет);
	ПредустановленныеОтборы_УстановитьПараметрыВыбораЭлементаСчет(Элементы["СписокСчетовСчет"], ВходныеДанные);
	
	// Настраиваем видимость колонок блока валюты
	НастроитьВидимостьКолонокВалютыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоляОрганизация()
	
	// Предложим очистить табличную часть, содержащую данные.
	
	ОстаткиЗаполнены = (Объект["Остатки"].Количество() > 0);
	
	Если ОстаткиЗаполнены Тогда
		ТекстВопроса = НСтр("ru='Изменение организации вызовет очистку
			|некоторых реквизитов, а также
			|всех табличных частей документа.
			|
			|Продолжить и сменить организацию?'");
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПриИзмененииПоляОрганизация_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 40, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПриИзмененииПоляОрганизация_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		// Очищаем реквизиты документа
		ОчищающаяСтруктура = Новый Структура("
			|ДолжностьПредседателяКомиссии,
			|ФамилияПредседателяКомиссии,
			|ИмяПредседателяКомиссии,
			|ОтчествоПредседателяКомиссии,
			|НомерПриказаИнвентаризации,
			|ДатаПриказаИнвентаризации,
			|НомерПриказаКомиссии,
			|ДатаПриказаКомиссии");
		ЗаполнитьЗначенияСвойств(Объект, ОчищающаяСтруктура);
		
		// Очищаем табличные части документа
		Объект.Остатки.Очистить();
		Объект.СоставКомиссии.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКурс(Знач ВалютаДокумента,Дата)
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
КонецФункции
&НаКлиенте
Процедура ПересчитатьСуммуСтроки(ИзмененаСуммаРУ = Ложь)
	
	ТекДанные = Элементы["Остатки"].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИзмененаСуммаРУ Тогда
		// Рассчитываем СуммуВал:
		ТекВалюта = ТекДанные["Валюта"];
		УстановитьСуммуВал = (ТекВалюта = ВалютаРУ)
			ИЛИ (ЗначениеЗаполнено(ТекВалюта)
				И НЕ ЗначениеЗаполнено(ТекДанные["СуммаВал"])
				И ЗначениеЗаполнено(ТекДанные["СуммаРУ"]));
		Если УстановитьСуммуВал Тогда
			Если ТекДанные["Курс"] = 0 Тогда
				СуммаВал = 0;
			Иначе
				СуммаВал = ТекДанные["СуммаРУ"] * ТекДанные["Кратность"] / ТекДанные["Курс"];
			КонецЕсли;
			ТекДанные["СуммаВал"] = СуммаВал;
		КонецЕсли;
		
	Иначе
		// Рассчитываем СуммуРУ:
		Если ТекДанные["Кратность"] = 0 Тогда
			СуммаРУ = 0;
		Иначе;
			СуммаРУ = ТекДанные["СуммаВал"] * ТекДанные["Курс"] / ТекДанные["Кратность"];
		КонецЕсли;
		ТекДанные["СуммаРУ"] = СуммаРУ;
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура НастроитьТипЗначенияКассовогоОргана()
	
	ОбозначениеТипа = ПолучитьОбозначениеИзТипаЛицевогоСчета(Объект.ТипЛицевогоСчета);
	
	Если ОбозначениеТипа = "Казначейский" Тогда
		КассовыйОрган_ПустаяСсылка = ПредопределенноеЗначение("Справочник.Казначейства.ПустаяСсылка");
			
	ИначеЕсли ОбозначениеТипа = "Банковский" Тогда
		КассовыйОрган_ПустаяСсылка = ПредопределенноеЗначение("Справочник.Банки.ПустаяСсылка");
		
	Иначе
		// <без ограничения>
		КассовыйОрган_ПустаяСсылка = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает 0, 1 или 2 (соответствует списку выбора элемента ТипЛицевогоСчета).
//	ОбозначениеТипа = "Казначейский", "Банковский", <Любая другая строка>
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьТипЛицевогоСчетаИзОбозначения(ОбозначениеТипа)
	
	Если ОбозначениеТипа = "Казначейский" Тогда
		Возврат 1;
	ИначеЕсли ОбозначениеТипа = "Банковский" Тогда
		Возврат 2;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
// Возвращает "Казначейский", "Банковский", "".
//	ТипЛицевогоСчета = 0, 1 или 2 (соответствует списку выбора элемента ТипЛицевогоСчета)
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьОбозначениеИзТипаЛицевогоСчета(ТипЛицевогоСчета)
	
	Если ТипЛицевогоСчета = 1 Тогда
		Возврат "Казначейский";
	ИначеЕсли ТипЛицевогоСчета = 2 Тогда
		Возврат "Банковский";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции


// Устанавливает значение флага "ВключитьВидимостьКолонокВалюты" (реквизит формы).
&НаСервере
Процедура ОпределитьНеобходимостьВключитьВидимостьКолонокВалютыСервер(ТекущийОбъект)
	
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	
	// Если в табличной части уже есть строки, в которых валюта
	// отличается от регламентированной, то колонки скрывать не нужно:
	ТаблЧасть = ТекущийОбъект["Остатки"];
	Если НЕ ИспользоватьВалютныйУчет И ТаблЧасть.Количество() > 0 Тогда
		ЗапросВалюта = Новый Запрос();
		ЗапросВалюта.УстановитьПараметр("ТЗ", ТаблЧасть.Выгрузить(, "Валюта"));
		ЗапросВалюта.УстановитьПараметр("ВалютаРУ", Константы.ВалютаРегламентированногоУчета.Получить());
		ЗапросВалюта.Текст = "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Валюта	КАК Валюта
		|ПОМЕСТИТЬ
		|	ВалютыДокумента
		|ИЗ
		|	&ТЗ	КАК ТЗ
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТЗ.Валюта	КАК Валюта
		|ИЗ
		|	ВалютыДокумента	КАК ТЗ
		|ГДЕ
		|	НЕ ТЗ.Валюта = &ВалютаРУ
		|	И НЕ ТЗ.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|;";
		
		// Устанавливаем особый флаг:
		ЭтаФорма["ВключитьВидимостьКолонокВалюты"] = НЕ ЗапросВалюта.Выполнить().Пустой();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьКолонокВалютыСервер()
	
	ВидимостьКолонок = ВключитьВидимостьКолонокВалюты
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
		
	ИменаЭлементов = Новый Структура("
		|ОстаткиСуммаВал,
		|ОстаткиВалюта,
		|ОстаткиКурс,
		|ОстаткиКратность");
	Для Каждого Элем Из ИменаЭлементов Цикл
		Элементы[Элем.Ключ].Видимость = ВидимостьКолонок;
	КонецЦикла;
	
КонецПроцедуры

// КакоеПолеИзменилось = "ЛицевойСчет" или "РеквизитыЛицевогоСчета".
&НаКлиенте
Процедура ОбновитьПоляСвязанныеСЛицевымСчетом(КакоеПолеИзменилось)
	
	ТекДанные = Элементы["Остатки"].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если КакоеПолеИзменилось = "ЛицевойСчет" Тогда
		// Обновляем значения полей:
		//	- РазделЛицевогоСчета
		//	- РеквизитыЛицевогоПоля
		//	- КассовыйОрган
		//	- НомерЛицевогоСчета
		
		ЛицевойСчет = ТекДанные["ЛицевойСчет"];

		ОбновляющаяСтруктура = Новый Структура("КассовыйОрган, НомерЛицевогоСчета");
		
		Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
			ОбновляющаяСтруктура = ЗначенияСвойствЛицевогоСчета(ЛицевойСчет);
		КонецЕсли;
		
	ИначеЕсли КакоеПолеИзменилось = "РеквизитыЛицевогоСчета" Тогда
		// Обновляем значения полей:
		//	- КассовыйОрган
		
		РеквизитыЛицевогоСчета = ТекДанные["РеквизитыЛицевогоСчета"];
		
		ОбновляющаяСтруктура = Новый Структура("КассовыйОрган");
		
		Если ЗначениеЗаполнено(РеквизитыЛицевогоСчета) Тогда
			ОбновляющаяСтруктура.Вставить("КассовыйОрган", КассовыйОрганЛицевогоСчета(РеквизитыЛицевогоСчета));
		КонецЕсли;
		
	Иначе
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ТекДанные, ОбновляющаяСтруктура);
	
КонецПроцедуры

// Передаваемая ссылка должна быть обязательно заполнена.
&НаСервереБезКонтекста
Функция ЗначенияСвойствЛицевогоСчета(ЛицевойСчет)
	
	Результат = Новый Структура("
		|РазделЛицевогоСчета,
		|РеквизитыЛицевогоСчета,
		|КассовыйОрган,
		|НомерЛицевогоСчета");
	
	Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
		ЗапросСвойства = Новый Запрос();
		ЗапросСвойства.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		ЗапросСвойства.Текст = "
		|////////////////////////////////////////////////////////////////////////////////
		|// [0]. Искомые данные, часть 1/2
		|//
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Ссылка			КАК РеквизитыЛицевогоСчета,
		|	КассовыйОрган	КАК КассовыйОрган,
		|	Владелец.Код	КАК НомерЛицевогоСчета
		|ИЗ
		|	Справочник.РеквизитыЛицевыхСчетов
		|ГДЕ
		|	Владелец = &ЛицевойСчет
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|// [1]. Искомые данные, часть 2/2
		|//
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Ссылка			КАК РазделЛицевогоСчета
		|ИЗ
		|	Справочник.РазделыЛицевыхСчетов
		|ГДЕ
		|	Владелец = &ЛицевойСчет
		|;";
		РезультатыЗапросов = ЗапросСвойства.ВыполнитьПакет();
		Результат0 = РезультатыЗапросов[0];
		Результат1 = РезультатыЗапросов[1];
		Если НЕ Результат0.Пустой() Тогда
			Выборка = Результат0.Выбрать();
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
			Результат["НомерЛицевогоСчета"] = СокрЛП(Результат["НомерЛицевогоСчета"]);
		КонецЕсли;
		Если НЕ Результат1.Пустой() Тогда
			Выборка = Результат1.Выбрать();
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
// Передаваемая ссылка должна быть обязательно заполнена.
&НаСервереБезКонтекста
Функция КассовыйОрганЛицевогоСчета(РеквизитыЛицевогоСчета)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыЛицевогоСчета, "КассовыйОрган");
	
КонецФункции

//-----------------------------------------------------------------------
// "Предустановленные отборы" в параметрах выбора элементов "Счет" формы

// Заполняет используемые варианты отбора и записывает в реквизит "ПредустановленныеОтборы_Счет".
// На этой форме отбор счета однозначно определяется значением реквизита "ВидНФА".
//
// Возвращает отборы вида:
// (Группа "И")
//		*	Ссылка ВСпискеПоИерархии (СписокСчетов)
//		*	ЭлементГруппа=Ложь
//
//	Тип лицевого счета		СписокСчетов
//	------------------------------------
//	(Казначейский)			201.10, 304.05
//	(Банковский)			201.20
//	(без ограничения)		201.10, 304.05, 201.20
&НаСервере
Процедура ПредустановленныеОтборы_Инициализация()
	
	// Кодирование типа лицевого счета:
	ТипКазначейский		= ПолучитьТипЛицевогоСчетаИзОбозначения("Казначейский");
	ТипБанковский		= ПолучитьТипЛицевогоСчетаИзОбозначения("Банковский");
	ТипБезОграничения	= ПолучитьТипЛицевогоСчетаИзОбозначения("");
	
	СписокСчетовПоУмолчанию = Новый ФиксированнаяСтруктура(Документы.ИнвентаризацияОстатковНаСчетах.ПолучитьСписокСчетовПоУмолчанию());
	
	ВремСоответствие = Новый Соответствие();
	
	КлючиСоответствия = Новый Массив();
	КлючиСоответствия.Добавить(ТипКазначейский);
	КлючиСоответствия.Добавить(ТипБанковский);
	КлючиСоответствия.Добавить(ТипБезОграничения);
	
	Для Каждого КлючСоответствия Из КлючиСоответствия Цикл
		
		Если КлючСоответствия = ТипКазначейский Тогда
			СписокСчетов = СписокСчетовПоУмолчанию.Казначейские;
			
		ИначеЕсли КлючСоответствия = ТипБанковский Тогда
			СписокСчетов = СписокСчетовПоУмолчанию.Банковские;
			
		Иначе
			СписокСчетов = Новый Массив();
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокСчетов, СписокСчетовПоУмолчанию.Казначейские);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокСчетов, СписокСчетовПоУмолчанию.Банковские);
		КонецЕсли;
		
		НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных();
		Отбор = НастройкиКомпоновки.Отбор;
		
		// Группа "И":
		ГруппаИ = Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ГруппаИ.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		// В ИЕРАРХИИ (СписокСчетов):
		НовыйЭлемент = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		НовыйЭлемент.ПравоеЗначение = Новый ФиксированныйМассив(СписокСчетов);
		// ЭлементГруппа = ЛОЖЬ:
		НовыйЭлемент = ГруппаИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭлементГруппа");
		НовыйЭлемент.ПравоеЗначение = Ложь;
		
		// Получаем представление отбора:
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, НастройкиКомпоновки);
		ПредставлениеОтбора = ЗаписьXML.Закрыть();
		
		// Запоминаем текст отбора, соответствующий текущему ключу:
		ВремСоответствие.Вставить(КлючСоответствия, ПредставлениеОтбора);
		
	КонецЦикла;
	
	// Запоминаем подготовленные тексты отборов:
	ПредустановленныеОтборы_Счет = Новый ФиксированноеСоответствие(ВремСоответствие);
	
КонецПроцедуры
// Устанавливает параметр выбора "ПредустановленныйОтбор" указанного элемента.
&НаКлиентеНаСервереБезКонтекста
Процедура ПредустановленныеОтборы_УстановитьПараметрыВыбораЭлементаСчет(ЭлементСчет, ВходныеДанные)
	
	ПредустановленныеОтборы_Счет	= ВходныеДанные["ПредустановленныеОтборы_Счет"];
	ТипЛицевогоСчета				= ВходныеДанные["ТипЛицевогоСчета"];
	
	// Согласно ВходнымДанным получаем текст отбора:
	ТекстОтбора = ПредустановленныеОтборы_Счет.Получить(ТипЛицевогоСчета);
	Если ТекстОтбора = Неопределено Тогда
		// Такому значению ключа не соответствует никакой текст отбора.
		// Используем текст отбора для другого ключа:
		ТипЛицевогоСчета = 0; // Значение <без ограничения>
		ТекстОтбора = ПредустановленныеОтборы_Счет.Получить(ТипЛицевогоСчета);
	КонецЕсли;
	Если ТекстОтбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Устанавливаем параметр выбора:
	НовыйПараметр = Новый ПараметрВыбора("ПредустановленныйОтбор", ТекстОтбора);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	ЭлементСчет.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
КонецПроцедуры

//--------------------------------------------------------------------------------
// Заполнение таблиц

&НаКлиенте
Функция НеобходимыеРеквизитыЗаполнены()

	// Проверим корректность входных данных для заполнения.
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Результат = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поле ""Огранизация"" не заполнено'"),
			Объект.Ссылка,
			"Объект.Организация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаИнвентаризации) Тогда
		Результат = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не указана дата проведения инвентаризации'"),
			Объект.Ссылка,
			"Объект.ДатаИнвентаризации");
	КонецЕсли;
		
	// Количество счетов, участвующих в расчетах, должно быть больше 0:
	ФильтрСписокСчетов = Новый Массив();
	Для Каждого СтрокаСчета Из Объект["СписокСчетов"] Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаСчета.Счет) ИЛИ СтрокаСчета.УчаствуетВРасчетах = Ложь Тогда
			Продолжить;
		Иначе
			ФильтрСписокСчетов.Добавить(СтрокаСчета.Счет);
		КонецЕсли; 
	КонецЦикла; 
	Если ФильтрСписокСчетов.Количество() = 0 Тогда
		Результат = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Таблица ""Список счетов"" не содержит выбранных счетов учета остатков денежных средств'"),
			Объект.Ссылка,
			"Объект.СписокСчетов");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьИЗаполнитьСписокСчетовПоУмолчанию()
	
	Если Объект["СписокСчетов"].Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='Перед заполнением табличная часть ""Счета учета"" будет очищена. Заполнить?'");
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьСписокСчетовПоУмолчанию_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьСписокСчетовПоУмолчаниюКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗаполнитьСписокСчетовПоУмолчанию_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСписокСчетовПоУмолчаниюКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьСписокСчетовПоУмолчаниюКлиент()
	
	ЗаполнитьСписокСчетовПоУмолчаниюСервер();
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСписокСчетовПоУмолчаниюСервер()
	
	Документы.ИнвентаризацияОстатковНаСчетах.ЗаполнитьСписокСчетовПоУмолчанию(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьПоДаннымУчета()
	
	Если НеобходимыеРеквизитыЗаполнены() Тогда
		Если Объект["Остатки"].Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru='Перед заполнением табличная часть ""Остатки денежных средств"" будет очищена. Продолжить?'");
			
			ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьПоДаннымУчета_Выбор", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
		Иначе
			ЗаполнитьПоДаннымУчетаКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗаполнитьПоДаннымУчета_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДаннымУчетаКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьПоДаннымУчетаКлиент()
	
	ЗаполнитьПоДаннымУчетаНаСервере();
	
	// Если по данным учета не было добавлено ни одной строки, выведем сообщение:
	Если Объект["Остатки"].Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Остатки денежных средств, соответствующие условиям поиска, отсутствуют.'");
		
		ПоказатьПредупреждение(Неопределено, ТекстСообщения, 10, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьПоДаннымУчетаНаСервере()
	
	Документы.ИнвентаризацияОстатковНаСчетах.ЗаполнитьПоДаннымУчета(Объект);
	
	// Настраиваем видимость колонок блока валюты
	ОпределитьНеобходимостьВключитьВидимостьКолонокВалютыСервер(Объект);
	НастроитьВидимостьКолонокВалютыСервер();
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// РешениеОПроведенииИнвентаризации
&НаКлиенте
Процедура ЗакрытаФормаВыбораДанныхИзРешенияОПроведенииИнвентаризации(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОписьПоРешениюОПроведенииИнвентаризацииСервер(РезультатВыбора);
	
	ПослеЗаполненияОписиПоРешениюОПроведенииИнвентаризацииКлиент(РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписьПоРешениюОПроведенииИнвентаризацииСервер(РезультатВыбора)
	
	ИнвентаризацияСервер.ЗаполнитьОписьПоРешениюИзФормыОписи(ЭтаФорма, РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполненияОписиПоРешениюОПроведенииИнвентаризацииКлиент(РезультатВыбора)
	
	ИнвентаризацияКлиент.СообщитьОЗаполненииНаОснованииРешенияОПроведенииИнвентаризации();
	
КонецПроцедуры
// Конец РешениеОПроведенииИнвентаризации

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ИнформационныйЦентр
&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти
