#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ВедомостьСроковИсполненияПоПлатежамВБюджеты";
	КомандаПечати.Идентификатор		= "ВедомостьСроковИсполненияПоПлатежамВБюджеты";
	КомандаПечати.Представление		= НСтр("ru = 'Ведомость сроков исполнения по платежам в бюджеты'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВедомостьСроковИсполненияПоПлатежамВБюджеты") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ВедомостьСроковИсполненияПоПлатежамВБюджеты",
			НСтр("ru = 'Ведомость сроков исполнения по платежам в бюджеты'"),
			ПечатьВедомостьСроковИсполненияПоПлатежамВБюджеты(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПериодичностьВидаНалогаИлиПлатежа(ВидНалогаИлиПлатежа) Экспорт
	
	ПериодичностьВидовНалоговИлиПлатежей = Новый Соответствие;
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.НДС, 10); // Квартал.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.ПрибыльФБ, 12); // Год.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.ПрибыльРБ, 12); // Год.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.ИмуществоОрганизаций, 12); // Год.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.Транспортный, 12); // Год.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.Земельный, 12); // Год.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.ФСС_Добровольные, 12); // Год.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.СФР_НС, 9); // Месяц.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.ЕСТ, 9); // Месяц.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.НДФЛ, 9); // Месяц.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.НДФЛп61ст210ПоСтавке13, 9); // Месяц.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.НДФЛп61ст210ПоСтавке15, 9); // Месяц.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.НДФЛПоСтавке13, 9); // Месяц.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.НДФЛРКСН, 9); // Месяц.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.НДФЛРКСНПоСтавке15, 9); // Месяц.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.НДФЛСПревышения, 9); // Месяц.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.НДФЛСПревышенияПоСтавке18, 9); // Месяц.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.НДФЛСПревышенияПоСтавке20, 9); // Месяц.
	ПериодичностьВидовНалоговИлиПлатежей.Вставить(Справочники.ВидыНалоговИПлатежей.НДФЛСПревышенияПоСтавке22, 9); // Месяц.
	
	Значение = ПериодичностьВидовНалоговИлиПлатежей[ВидНалогаИлиПлатежа];
	Если Значение = Неопределено Тогда
		Возврат 0; // Документ.
	Иначе
		Возврат Значение;
	КонецЕсли;
	
КонецФункции

#Область ПечатьДокумента

Функция ПечатьВедомостьСроковИсполненияПоПлатежамВБюджеты(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_ВедомостьСроковИсполненияПоПлатежамВБюджеты";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВедомостьСроковИсполненияПоПлатежамВБюджеты.ПФ_MXL_ВедомостьСроковИсполненияПоПлатежамВБюджеты");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
	
	ДанныеДляПечати = ПолучитьДанныеДляПечати(МассивОбъектов);
	ВыборкаШапка = ДанныеДляПечати.Шапка.Выбрать();
	ВыборкаНалоги = ДанныеДляПечати.Налоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ФорматПоляПериод = Новый Соответствие;
	ФорматПоляПериод.Вставить(0,  "ДФ=дд.ММ.гггг;"); // Документ.
	ФорматПоляПериод.Вставить(9,  "ДФ=ММММ.гггг;"); // Месяц.
	ФорматПоляПериод.Вставить(10, "ДФ='к ""квартал"" гггг ""г.""'"); // Квартал.
	ФорматПоляПериод.Вставить(12, "ДФ='гггг ""г.""'"); // Год.
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл // Цикл по документам.
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДетализацияВТаблице = ?(ВыборкаШапка.Периодичность = 0, "Документ", "Период");
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы" + ДетализацияВТаблице);
		ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы" + ДетализацияВТаблице);
		ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы" + ДетализацияВТаблице);
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбщиеСведенияПоДокументу = ДанныеДляПечати.ОбщиеСведения.Получить(ВыборкаШапка.Ссылка);
		
		// Заголовок.
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаШапка);
		ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры, ОбщиеСведенияПоДокументу,
			"НаименованиеОрганизации, НаименованиеОбособленногоПодразделения, НаименованиеСтруктурногоПодразделения, СтруктурноеПодразделение,
			|Учредитель, БюджетНаименование, КодРПБС, КодРПБСОбособленногоПодразделения, ГлаваБК, ОКТМО");
		ОбластьЗаголовок.Параметры.ДатаСтрокой = Формат(ВыборкаШапка.Дата, "ДЛФ=ДД");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		// Таблица.
		ВыборкаНалоги.Сбросить();
		ОтборСтрок = Новый Структура("Ссылка", ВыборкаШапка.Ссылка);
		Если ВыборкаНалоги.НайтиСледующий(ОтборСтрок) Тогда
			ВыборкаСтрок= ВыборкаНалоги.Выбрать();
			КоличествоСтрок = ВыборкаСтрок.Количество();
		Иначе
			КоличествоСтрок = 0;
		КонецЕсли;
		Если КоличествоСтрок > 0 Тогда
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
			Пока ВыборкаСтрок.Следующий() Цикл
				ОбластьСтрокаТаблицы.Параметры.Заполнить(ВыборкаСтрок);
				Если ВыборкаШапка.Периодичность = 0 Тогда // Документ.
					ОбластьСтрокаТаблицы.Параметры.ДокументРегистратор = Строка(ВыборкаСтрок.ДокументРегистратор);
				Иначе // Месяц, Квартал, Год.
					ОбластьСтрокаТаблицы.Параметры.Период = Формат(ВыборкаСтрок.Период, ФорматПоляПериод[ВыборкаШапка.Периодичность]);
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			КонецЦикла;
			ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
			
		КонецЕсли;
		
		// Подписи.
		ДанныеГлавногоБухгалтера = Справочники.Сотрудники.ДанныеСотрудника(ВыборкаШапка.ГлавныйБухгалтер, 
			"ДолжностьНаименование,НаименованиеПолное", ВыборкаШапка.Дата);
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ДолжностьГлБух",   ДанныеГлавногоБухгалтера.ДолжностьНаименование);
		ФИОГлБух = КорреспондентыКлиентСервер.ФИО(ДанныеГлавногоБухгалтера.НаименованиеПолное);
		ЗначенияЗаполнения.Вставить("ФИОГлБух",         ФИОГлБух);
		ЗначенияЗаполнения.Вставить("Должность",        ОбщиеСведенияПоДокументу.ОтветственныйДолжность);
		ЗначенияЗаполнения.Вставить("ФИО",              ОбщиеСведенияПоДокументу.ОтветственныйФамилияИнициалы);
		ЗначенияЗаполнения.Вставить("НомерТелефона",    ОбщиеСведенияПоДокументу.ОтветственныйТелефон);
		ЗначенияЗаполнения.Вставить("ЭлектроннаяПочта", ОбщиеСведенияПоДокументу.ОтветственныйЭлПочта);
		ОбластьПодписи.Параметры.Заполнить(ЗначенияЗаполнения);
		ОбластьПодписи.Параметры.ДатаСтрокой = Формат(ВыборкаШапка.Дата, "ДЛФ=ДД");
		ТабличныйДокумент.Вывести(ОбластьПодписи);
		
		// В табличном документе зададим имя области, в которую был выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьДанныеДляПечати(МассивОбъектов)
	
	ТекстыЗапросов     = Новый Массив;
	ИндексыРезультатов = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ИндексыРезультатов.Вставить("Шапка", ТекстыЗапросов.Количество());
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВедомостьСроковИсполненияПоПлатежамВБюджеты.Ссылка КАК Ссылка,
	|	ВедомостьСроковИсполненияПоПлатежамВБюджеты.Номер КАК Номер,
	|	ВедомостьСроковИсполненияПоПлатежамВБюджеты.Дата КАК Дата,
	|	ВедомостьСроковИсполненияПоПлатежамВБюджеты.Организация КАК Организация,
	|	ВедомостьСроковИсполненияПоПлатежамВБюджеты.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ВедомостьСроковИсполненияПоПлатежамВБюджеты.Ответственный КАК Ответственный,
	|	ВедомостьСроковИсполненияПоПлатежамВБюджеты.Периодичность КАК Периодичность
	|ИЗ
	|	Документ.ВедомостьСроковИсполненияПоПлатежамВБюджеты КАК ВедомостьСроковИсполненияПоПлатежамВБюджеты
	|ГДЕ
	|	ВедомостьСроковИсполненияПоПлатежамВБюджеты.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер");
	
	ИндексыРезультатов.Вставить("Налоги", ТекстыЗапросов.Количество());
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Налоги.Ссылка КАК Ссылка,
	|	Налоги.НомерСтроки КАК НомерСтроки,
	|	Налоги.ИФО КАК ИФО,
	|	Налоги.КФО КАК КФО,
	|	Налоги.ВидНалогаИлиПлатежа КАК ВидНалога,
	|	Налоги.НалогСборПлатеж КАК НалогСборПлатеж,
	|	Налоги.Счет КАК Счет,
	|	Налоги.Подразделение КАК Подразделение,
	|	Налоги.КПС КАК КБК,
	|	Налоги.СрокИсполнения КАК СрокИсполнения,
	|	Налоги.Увеличение КАК Увеличение,
	|	Налоги.Уменьшение КАК Уменьшение,
	|	Налоги.Период КАК Период,
	|	Налоги.Регистратор КАК ДокументРегистратор
	|ИЗ
	|	Документ.ВедомостьСроковИсполненияПоПлатежамВБюджеты.Налоги КАК Налоги
	|ГДЕ
	|	Налоги.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Увеличение),
	|	СУММА(Уменьшение)
	|ПО
	|	Ссылка");
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ДанныеДляПечати = Новый Структура;
	ДанныеДляПечати.Вставить("Шапка", Результаты[ИндексыРезультатов.Шапка]);
	ДанныеДляПечати.Вставить("Налоги", Результаты[ИндексыРезультатов.Налоги]);
	
	// Добавим общие сведения для печати.
	ДанныеДляПечати.Вставить("ОбщиеСведения", 
		УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати(МассивОбъектов));
	
	Возврат ДанныеДляПечати;
	
КонецФункции

#КонецОбласти

#Область ПроведениеДокумента

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры
//  Ссылка  - ДокументСсылка.РасходныйОрдерФондовый - ссылка на текущий документ
//  ДополнительныеСвойства  - Структура - Структура данных для подсистемы печати
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ТаблицыЗапроса = Новый Массив;
	
	ТаблицыЗапроса.Добавить("СрокиИсполненияПоПлатежамВБюджеты");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Налоги.НомерСтроки КАК НомерСтроки,
	|	Налоги.Ссылка.Дата КАК ДатаДокумента,
	|	Налоги.Ссылка.Организация КАК Организация,
	|	Налоги.Период КАК Период,
	|	Налоги.Счет КАК Счет,
	|	Налоги.ИФО КАК ИФО,
	|	Налоги.КФО КАК КФО,
	|	Налоги.КПС КАК КПС,
	|	Налоги.Подразделение КАК Подразделение,
	|	Налоги.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
	|	Налоги.НалогСборПлатеж КАК НалогСборПлатеж,
	|	Налоги.СрокИсполнения КАК СрокИсполнения,
	|	Налоги.Увеличение КАК Сумма
	|ИЗ
	|	Документ.ВедомостьСроковИсполненияПоПлатежамВБюджеты.Налоги КАК Налоги
	|ГДЕ
	|	Налоги.Ссылка = &Ссылка
	|	И Налоги.Увеличение <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Налоги.НомерСтроки,
	|	Налоги.Ссылка.Дата,
	|	Налоги.Ссылка.Организация,
	|	Налоги.Период,
	|	Налоги.Счет,
	|	Налоги.ИФО,
	|	Налоги.КФО,
	|	Налоги.КПС,
	|	Налоги.Подразделение,
	|	Налоги.ВидНалогаИлиПлатежа,
	|	Налоги.НалогСборПлатеж,
	|	Налоги.СрокИсполнения,
	|	Налоги.Уменьшение
	|ИЗ
	|	Документ.ВедомостьСроковИсполненияПоПлатежамВБюджеты.Налоги КАК Налоги
	|ГДЕ
	|	Налоги.Ссылка = &Ссылка
	|	И Налоги.Уменьшение <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Движения в регистр СрокиИсполненияПоПлатежамВБюджеты формируются в том же периоде, в котором сформированы соответствующие бух.записи по счету 303.00.
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(ДополнительныеСвойства.ТаблицыДляДвижений, Результат, ТаблицыЗапроса);
	
КонецПроцедуры	

#КонецОбласти

#Область ЗаполнениеДокумента

Функция ЗаполнитьПоДаннымУчета(ДокументОбъект) Экспорт
	
	Отказ = Ложь;
	
	ДокументОбъект.Налоги.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", ?(ЗначениеЗаполнено(ДокументОбъект.НачалоПериода), НачалоДня(ДокументОбъект.НачалоПериода), Неопределено));
	Запрос.УстановитьПараметр("КонецПериода",  ?(ЗначениеЗаполнено(ДокументОбъект.КонецПериода), КонецДня(ДокументОбъект.КонецПериода), Неопределено));
	Запрос.УстановитьПараметр("Счета30300", БухгалтерскийУчет.СписокСчетов("303.00"));
	Запрос.УстановитьПараметр("Счет30314", БухгалтерскийУчет.СписокСчетов("303.14")); // Расчеты по единому налоговому платежу.
	Запрос.УстановитьПараметр("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	
	НомераТаблиц = Новый Структура;
	НомераТаблиц.Вставить("ВидыНалоговИПлатежей", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Обороты303ХХ", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ОтраженыСрокиИсполненияПоПлатежамВБюджеты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РасчетыПоПлатежамВБюджеты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СрокиИсполненияПоПлатежамВБюджеты", НомераТаблиц.Количество());
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыНалоговИПлатежей.Ссылка КАК ВидНалогаИлиПлатежа
	|ПОМЕСТИТЬ ВидыНалоговИПлатежей
	|ИЗ
	|	Справочник.ВидыНалоговИПлатежей КАК ВидыНалоговИПлатежей
	|ГДЕ
	|	&УсловиеВидыНалоговИПлатежей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУОбороты.Период КАК Период,
	|	ЕПСБУОбороты.Организация КАК Организация,
	|	ЕСТЬNULL(ЕПСБУОбороты.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ЕПСБУОбороты.КФО КАК КФО,
	|	ЕПСБУОбороты.КПС КАК КПС,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоПодразделениям
	|				И ЕПСБУОбороты.Счет.УчетПоПодразделениям
	|			ТОГДА ЕПСБУОбороты.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ЕПСБУОбороты.Счет КАК Счет,
	|	ЕПСБУОбороты.Субконто1 КАК Субконто1,
	|	ЕПСБУОбороты.Субконто2 КАК Субконто2,
	|	ЕПСБУОбороты.Субконто3 КАК Субконто3,
	|	ВЫРАЗИТЬ(ЕПСБУОбороты.Субконто1 КАК Справочник.ВидыНалоговИПлатежей) КАК ВидНалогаИлиПлатежа,
	|	ВЫРАЗИТЬ(ЕПСБУОбороты.Субконто2 КАК Справочник.НалогиИПлатежиОрганизации) КАК НалогСборПлатеж,
	|	ВЫБОР
	|		КОГДА НЕ ЕПСБУОбороты.Субконто3 ССЫЛКА Справочник.ВидыНалоговИПлатежей
	|				И НЕ ЕПСБУОбороты.Субконто3 ССЫЛКА Справочник.НалогиИПлатежиОрганизации
	|			ТОГДА ЕПСБУОбороты.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДопСубконто,
	|	ЕПСБУОбороты.КорСчет КАК КорСчет,
	|	ЕПСБУОбороты.Регистратор КАК ПериодРегистратор,
	|	ЕПСБУОбороты.СуммаОборотДт КАК Уменьшение,
	|	ЕПСБУОбороты.СуммаОборотКт КАК Увеличение
	|ПОМЕСТИТЬ Обороты303ХХ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор {(&Периодичность)},
	|			Счет В (&Счета30300)
	|				И НЕ Счет В (&Счет30314),
	|			,
	|			Организация = &Организация
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ВидыНалоговИПлатежей.ВидНалогаИлиПлатежа
	|					ИЗ
	|						ВидыНалоговИПлатежей),
	|			,
	|			) КАК ЕПСБУОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодРегистратор,
	|	ВидНалогаИлиПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВедомостьСроковИсполненияПоПлатежамВБюджеты.Регистратор КАК ПериодРегистратор,
	|	ВедомостьСроковИсполненияПоПлатежамВБюджеты.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа
	|ПОМЕСТИТЬ ОтраженыСрокиИсполненияПоПлатежамВБюджеты
	|ИЗ
	|	РегистрНакопления.СрокиИсполненияПоПлатежамВБюджеты КАК СрокиИсполненияПоПлатежамВБюджеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьСроковИсполненияПоПлатежамВБюджеты.Налоги КАК ВедомостьСроковИсполненияПоПлатежамВБюджеты
	|		ПО СрокиИсполненияПоПлатежамВБюджеты.Регистратор = ВедомостьСроковИсполненияПоПлатежамВБюджеты.Ссылка
	|ГДЕ
	|	ВедомостьСроковИсполненияПоПлатежамВБюджеты.Регистратор В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Обороты303ХХ.ПериодРегистратор
	|			ИЗ
	|				Обороты303ХХ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодРегистратор,
	|	ВидНалогаИлиПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты303ХХ.Период КАК Период,
	|	Обороты303ХХ.Организация КАК Организация,
	|	Обороты303ХХ.ИФО КАК ИФО,
	|	Обороты303ХХ.КФО КАК КФО,
	|	Обороты303ХХ.КПС КАК КПС,
	|	Обороты303ХХ.Подразделение КАК Подразделение,
	|	Обороты303ХХ.Счет КАК Счет,
	|	Обороты303ХХ.Субконто1 КАК Субконто1,
	|	Обороты303ХХ.Субконто2 КАК Субконто2,
	|	Обороты303ХХ.Субконто3 КАК Субконто3,
	|	Обороты303ХХ.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
	|	ЕСТЬNULL(Обороты303ХХ.НалогСборПлатеж, ЗНАЧЕНИЕ(Справочник.НалогиИПлатежиОрганизации.ПустаяСсылка)) КАК НалогСборПлатеж,
	|	Обороты303ХХ.ДопСубконто КАК ДопСубконто,
	|	Обороты303ХХ.КорСчет КАК КорСчет,
	|	Обороты303ХХ.ПериодРегистратор КАК ПериодРегистратор,
	|	Обороты303ХХ.Уменьшение КАК Уменьшение,
	|	Обороты303ХХ.Увеличение КАК Увеличение
	|ИЗ
	|	Обороты303ХХ КАК Обороты303ХХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтраженыСрокиИсполненияПоПлатежамВБюджеты КАК ОтраженыСрокиИсполненияПоПлатежамВБюджеты
	|		ПО Обороты303ХХ.ПериодРегистратор = ОтраженыСрокиИсполненияПоПлатежамВБюджеты.ПериодРегистратор
	|			И Обороты303ХХ.ВидНалогаИлиПлатежа = ОтраженыСрокиИсполненияПоПлатежамВБюджеты.ВидНалогаИлиПлатежа
	|ГДЕ
	|	ОтраженыСрокиИсполненияПоПлатежамВБюджеты.ПериодРегистратор ЕСТЬ NULL
	|	И ОтраженыСрокиИсполненияПоПлатежамВБюджеты.ВидНалогаИлиПлатежа ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрокиИсполненияПоПлатежамВБюджетыОстатки.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
	|	ЕСТЬNULL(СрокиИсполненияПоПлатежамВБюджетыОстатки.НалогСборПлатеж, ЗНАЧЕНИЕ(Справочник.НалогиИПлатежиОрганизации.ПустаяСсылка)) КАК НалогСборПлатеж,
	|	СрокиИсполненияПоПлатежамВБюджетыОстатки.Счет КАК Счет,
	|	ЕСТЬNULL(СрокиИсполненияПоПлатежамВБюджетыОстатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	СрокиИсполненияПоПлатежамВБюджетыОстатки.КФО КАК КФО,
	|	СрокиИсполненияПоПлатежамВБюджетыОстатки.КПС КАК КПС,
	|	ЕСТЬNULL(СрокиИсполненияПоПлатежамВБюджетыОстатки.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	СрокиИсполненияПоПлатежамВБюджетыОстатки.СрокИсполнения КАК СрокИсполнения,
	|	СрокиИсполненияПоПлатежамВБюджетыОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.СрокиИсполненияПоПлатежамВБюджеты.Остатки(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И ВидНалогаИлиПлатежа В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						Обороты303ХХ.ВидНалогаИлиПлатежа
	|					ИЗ
	|						Обороты303ХХ)) КАК СрокиИсполненияПоПлатежамВБюджетыОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидНалогаИлиПлатежа,
	|	НалогСборПлатеж,
	|	СрокИсполнения";
	
	Запрос.УстановитьПараметр("Периодичность", ДокументОбъект.Периодичность);
	Если ДокументОбъект.Периодичность = 0 Тогда // Документ.
	Иначе // Месяц, Квартал, Год.
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВедомостьСроковИсполненияПоПлатежамВБюджеты.Регистратор", "ВедомостьСроковИсполненияПоПлатежамВБюджеты.Период");
		Если ДокументОбъект.Периодичность = 9 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕПСБУОбороты.Регистратор", "НАЧАЛОПЕРИОДА(ЕПСБУОбороты.Период, МЕСЯЦ)");
		ИначеЕсли ДокументОбъект.Периодичность = 10 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕПСБУОбороты.Регистратор", "НАЧАЛОПЕРИОДА(ЕПСБУОбороты.Период, КВАРТАЛ)");
		ИначеЕсли ДокументОбъект.Периодичность = 12 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕПСБУОбороты.Регистратор", "НАЧАЛОПЕРИОДА(ЕПСБУОбороты.Период, ГОД)");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОбъект.ВидНалогаИлиПлатежа) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидыНалоговИПлатежей", "ВидыНалоговИПлатежей.Ссылка = &ВидНалогаИлиПлатежа");
		Запрос.УстановитьПараметр("ВидНалогаИлиПлатежа", ДокументОбъект.ВидНалогаИлиПлатежа);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидыНалоговИПлатежей", "ИСТИНА");
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	СрокиИсполненияПоПлатежамВБюджеты = Результат[НомераТаблиц.СрокиИсполненияПоПлатежамВБюджеты].Выгрузить();
	СрокиИсполненияПоПлатежамВБюджеты.Колонки.Добавить("ПериодРегистратор", Новый ОписаниеТипов("Дата"));
	СрокиИсполненияПоПлатежамВБюджеты.Колонки.Добавить("Погашено", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	КолонкиПоиска = "ВидНалогаИлиПлатежа,НалогСборПлатеж,Счет,ИФО,КФО,КПС,Подразделение";
	
	ТаблицаНалоги = ДокументОбъект.Налоги.ВыгрузитьКолонки();
	ТаблицаНалоги.Колонки.Добавить("КорСчет", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	
	РасчетыПоПлатежамВБюджеты = Результат[НомераТаблиц.РасчетыПоПлатежамВБюджеты].Выгрузить();
	Для Каждого СтрокаРасчеты Из РасчетыПоПлатежамВБюджеты Цикл
		
		Если СтрокаРасчеты.Увеличение > 0 Тогда
			
			// Заполняем СрокИсполнения в строке табличной части.
			Отбор = Новый Структура("ВидНалогаИлиПлатежа", СтрокаРасчеты.ВидНалогаИлиПлатежа);
			ПредельныеСрокиИсполнения = РегистрыСведений.ПредельныеСрокиИсполненияПоПлатежамВБюджеты.ПолучитьПоследнее(КонецДня(СтрокаРасчеты.Период), Отбор);
			
			СрокиИсполнения = Новый Массив;
			Если ЗначениеЗаполнено(ПредельныеСрокиИсполнения.СрокИсполнения) Тогда
				СрокиИсполнения.Добавить(ПредельныеСрокиИсполнения.СрокИсполнения);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПредельныеСрокиИсполнения.СрокИсполнения2) Тогда
				СрокиИсполнения.Добавить(ПредельныеСрокиИсполнения.СрокИсполнения2);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПредельныеСрокиИсполнения.СрокИсполнения3) Тогда
				СрокиИсполнения.Добавить(ПредельныеСрокиИсполнения.СрокИсполнения3);
			КонецЕсли;
			
			Если СрокиИсполнения.Количество() = 1 Тогда // Один срок исполнения, не требуется распределение суммы.
				
				СрокИсполнения = СрокиИсполнения[0];
				
				НоваяСтрока = ТаблицаНалоги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчеты);
				ЗаполнитьПериодРегистраторВСтроке(НоваяСтрока, СтрокаРасчеты, ДокументОбъект.Периодичность);
				НоваяСтрока.СрокИсполнения = СрокИсполнения;
				
				// Добавляем сумму Увеличение в таблицу остатков по срокам исполнения СрокиИсполненияПоПлатежамВБюджеты.
				Если ЗначениеЗаполнено(СрокИсполнения) Тогда
					НоваяСтрокаОстатков = СрокиИсполненияПоПлатежамВБюджеты.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаОстатков, СтрокаРасчеты, КолонкиПоиска + ",ПериодРегистратор");
					НоваяСтрокаОстатков.СрокИсполнения = СрокИсполнения;
					НоваяСтрокаОстатков.Сумма = СтрокаРасчеты.Увеличение;
				КонецЕсли;
				
			ИначеЕсли СрокиИсполнения.Количество() > 1 Тогда  // Требуется распределение суммы по нескольким срокам исполнения.
				
				БазаРаспределения = Новый Массив;
				Для Каждого СрокИсполнения Из СрокиИсполнения Цикл
					БазаРаспределения.Добавить(1); // Равными частями.
				КонецЦикла;
				
				РаспределениеСуммыУвеличение = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					СтрокаРасчеты.Увеличение, БазаРаспределения);
				
				Для Инд = 0 По РаспределениеСуммыУвеличение.Количество() - 1 Цикл
					
					НоваяСтрока = ТаблицаНалоги.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчеты);
					ЗаполнитьПериодРегистраторВСтроке(НоваяСтрока, СтрокаРасчеты, ДокументОбъект.Периодичность);
					НоваяСтрока.СрокИсполнения = СрокиИсполнения[Инд];
					НоваяСтрока.Увеличение = РаспределениеСуммыУвеличение[Инд];
					
					// Добавляем сумму Увеличение в таблицу остатков по срокам исполнения СрокиИсполненияПоПлатежамВБюджеты.
					НоваяСтрокаОстатков = СрокиИсполненияПоПлатежамВБюджеты.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаОстатков, СтрокаРасчеты, КолонкиПоиска + ",ПериодРегистратор");
					НоваяСтрокаОстатков.СрокИсполнения = СрокиИсполнения[Инд];
					НоваяСтрокаОстатков.Сумма = РаспределениеСуммыУвеличение[Инд];
					
				КонецЦикла;
				
			Иначе // Нет настроек по срокам исполнения.
				
				НоваяСтрока = ТаблицаНалоги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчеты);
				ЗаполнитьПериодРегистраторВСтроке(НоваяСтрока, СтрокаРасчеты, ДокументОбъект.Периодичность);
				
			КонецЕсли;
			
		Иначе // Уменьшение.
			
			НоваяСтрока = ТаблицаНалоги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчеты);
			ЗаполнитьПериодРегистраторВСтроке(НоваяСтрока, СтрокаРасчеты, ДокументОбъект.Периодичность);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СрокиИсполненияПоПлатежамВБюджеты.Свернуть(КолонкиПоиска + ",ПериодРегистратор,СрокИсполнения", "Сумма,Погашено");
	СрокиИсполненияПоПлатежамВБюджеты.Сортировать(КолонкиПоиска + ",ПериодРегистратор,СрокИсполнения");
	
	// 2.1 Вычет НДС (Дт 303.04 Кт 210.10) распределяем в рамках текущего квартала.
	Для Каждого СтрокаНалоги Из ТаблицаНалоги Цикл
		
		Если СтрокаНалоги.Уменьшение > 0
			И БухгалтерскийУчет.СчетВИерархии(СтрокаНалоги.Счет, "303.04")
			И БухгалтерскийУчет.СчетВИерархии(СтрокаНалоги.КорСчет, "210.10") Тогда
			
			Отбор = Новый Структура(КолонкиПоиска);
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаНалоги, КолонкиПоиска);
			Отбор.Вставить("ПериодРегистратор", СтрокаНалоги.Период); // Текущий квартал.
			
			НДСкВычетуЗаПериод = ?(СрокиИсполненияПоПлатежамВБюджеты.Количество() > 0, СрокиИсполненияПоПлатежамВБюджеты.НайтиСтроки(Отбор),
				СрокиИсполненияПоПлатежамВБюджеты.СкопироватьКолонки());
			СуммаНДСкВычетуЗаПериод = СрокиИсполненияПоПлатежамВБюджеты.Скопировать(Отбор).Итог("Сумма");
			
			ПогашеннаяСумма = Мин(СтрокаНалоги.Уменьшение, СуммаНДСкВычетуЗаПериод);
			Если ПогашеннаяСумма > 0 Тогда
				
				// Сумма НДС к вычету распределяется по срокам исполнения равномерно.
				// Учтем в таблице остатков СрокиИсполненияПоПлатежамВБюджеты в показателе Погашено.
				ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(ПогашеннаяСумма, НДСкВычетуЗаПериод, "Погашено", "Сумма", Ложь);
				
				// Остаток будет распределен на этапе 2.2.
				СтрокаНалоги.Уменьшение = СтрокаНалоги.Уменьшение - ПогашеннаяСумма;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	// Фиксируем в документе.
	Для Каждого СтрокаВычетНДС Из СрокиИсполненияПоПлатежамВБюджеты Цикл
		Если СтрокаВычетНДС.Погашено > 0 Тогда
			НоваяСтрока = ДокументОбъект.Налоги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВычетНДС, КолонкиПоиска + ",СрокИсполнения");
			НоваяСтрока.Уменьшение = СтрокаВычетНДС.Погашено;
			ЗаполнитьПериодРегистраторВСтроке(НоваяСтрока, СтрокаВычетНДС, ДокументОбъект.Периодичность);
		КонецЕсли;
	КонецЦикла;
	
	// 2.2 Погашение задолженности в порядке возрастания поля СрокИсполнения.
	Для Каждого СтрокаНалоги Из ТаблицаНалоги Цикл
		
		Если СтрокаНалоги.Увеличение <> 0 Тогда
			НоваяСтрока = ДокументОбъект.Налоги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНалоги);
		КонецЕсли;
		
		Если СтрокаНалоги.Уменьшение <> 0 Тогда
			
			НераспределеннаяСумма = СтрокаНалоги.Уменьшение;
			
			Отбор = Новый Структура(КолонкиПоиска);
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаНалоги, КолонкиПоиска);
			
			ОстаткиЗадолженности = ?(СрокиИсполненияПоПлатежамВБюджеты.Количество() > 0, СрокиИсполненияПоПлатежамВБюджеты.НайтиСтроки(Отбор),
				СрокиИсполненияПоПлатежамВБюджеты.СкопироватьКолонки());
			
			Для Каждого СтрокаОстатка Из ОстаткиЗадолженности Цикл
				
				Если НераспределеннаяСумма <= 0 Тогда
					Прервать;
				КонецЕсли;
				
				ПогашеннаяСумма = Мин(НераспределеннаяСумма, СтрокаОстатка.Сумма - СтрокаОстатка.Погашено); // За исключением погашенной части.
				Если ПогашеннаяСумма <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				// Фиксируем в документе.
				НоваяСтрока = ДокументОбъект.Налоги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатка, КолонкиПоиска + ",СрокИсполнения");
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНалоги, "Субконто1,Субконто2,Субконто3,Регистратор,Период");
				НоваяСтрока.Уменьшение = ПогашеннаяСумма;
				
				НераспределеннаяСумма = НераспределеннаяСумма - ПогашеннаяСумма;
				СтрокаОстатка.Погашено = СтрокаОстатка.Погашено + ПогашеннаяСумма;
				СтрокаНалоги.Уменьшение = СтрокаНалоги.Уменьшение - ПогашеннаяСумма;
				
			КонецЦикла;
			
			Если НераспределеннаяСумма <> 0 Тогда
				
				// Фиксируем в документе.
				НоваяСтрока = ДокументОбъект.Налоги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНалоги, КолонкиПоиска + ",Субконто1,Субконто2,Субконто3,Регистратор,Период");
				НоваяСтрока.Уменьшение = НераспределеннаяСумма; // Оставшаяся часть с пустым сроком исполнения.
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДокументОбъект.Периодичность <> 0 Тогда
		ДокументОбъект.Налоги.Свернуть(КолонкиПоиска + ",СрокИсполнения,Регистратор,Период", "Увеличение,Уменьшение");
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

Процедура ЗаполнитьПериодРегистраторВСтроке(СтрокаПриемник, СтрокаИсточник, Периодичность)
	
	Если Периодичность = 0 Тогда
		СтрокаПриемник.Регистратор = СтрокаИсточник.ПериодРегистратор; // Периодичность = Документ.
	Иначе
		СтрокаПриемник.Период = СтрокаИсточник.ПериодРегистратор; // Периодичность = Месяц, Квартал, Год.
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
