#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Результат        = Новый ТабличныйДокумент;
	Формат           = ПараметрыПечати.Формат;
	ИмяФайлаЗагрузки = ПараметрыПечати.ИмяФайла;
	СсылкаНаЗадание  = ПараметрыПечати.Ссылка;
	ОписаниеОшибки   = "";
	
	ОбъектыПечати.Добавить(Формат, Формат.Наименование);
	
	Если ОткрытьДокументФайла(Формат,	ИмяФайлаЗагрузки,	СсылкаНаЗадание, Результат, ОписаниеОшибки) Тогда     
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МакетФормата", "Печатная форма документа из файла :"+ ИмяФайлаЗагрузки, Результат);			
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьВсеПодчиненныйФайлы(СсылкаНаДокумент) Экспорт 

	ВладелецФайла 	= ССылкаНаДокумент;
	
	МассивФайлов 	= Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ВладелецФайла,МассивФайлов);
	УстановитьПривилегированныйРежим(Истина);	
	Для каждого ПрисоединенныйФайл Из МассивФайлов Цикл
		
		ПрисоединенныйФайл.ПолучитьОбъект().Удалить();
			
	КонецЦикла; 
	
КонецПроцедуры

Процедура УдалитьПодчиненныйФайл(СсылкаНаДокумент, ИмяФайла) Экспорт 

	ВладелецФайла 	= ССылкаНаДокумент;
	
	МассивФайлов 	= Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ВладелецФайла,МассивФайлов);
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ПрисоединенныйФайл Из МассивФайлов Цикл
		Если (ПрисоединенныйФайл.Наименование + "." + ПрисоединенныйФайл.Расширение) = ИмяФайла Тогда
			ПрисоединенныйФайл.ПолучитьОбъект().Удалить();
		КонецЕсли;	
	КонецЦикла; 
	
КонецПроцедуры

Функция ЗаполнитьТабличнуюЧастьФайлыОбмена(ДокументЗадание, ОписаниеОшибки = "") Экспорт
	
	Параметры	= ПараметрыЗадания(ДокументЗадание.Ссылка); 
	ШапкаДокумента = Параметры[0].Выгрузить();
	Если ШапкаДокумента.Количество() = 0 Тогда
		ОписаниеОшибки = НСтр("ru = 'Документ не записан. Запишите документ, повторите заполнение.'");
		Возврат Ложь;
	КонецЕсли;	
	
	Задание		= ШапкаДокумента[0];
	ФайлыОбмена = Параметры[1].Выгрузить();
	ФайлыОбмена.Очистить();
	
	УдалитьВсеПодчиненныйФайлы(ДокументЗадание.Ссылка);	
	
	// Определение каталога загрузки
	НастройкаОбмена = Задание.НастройкаОбмена;
	КаталогЗагрузки = НастройкаОбмена.ПутьЗагрузкиПоУмолчанию;
	Если НЕ Прав(КаталогЗагрузки, 1) = "\" Тогда
		КаталогЗагрузки = КаталогЗагрузки + "\";
	КонецЕсли;
	
	Попытка
	
		Если НастройкаОбмена.СпособОбмена = Перечисления.СпособыВыгрузкиФайлов.FTP Тогда
					
			КаталогЗагрузки = "";
			Соединение = ЭкспортФайловКлиентСервер.ПолучитьСоединениеСИнтернет(НастройкаОбмена, КаталогЗагрузки);
			
			МассивНайденныхНаСервере = Соединение.НайтиФайлы(КаталогЗагрузки,"*");
			
			// Перемещаем файлы во временный каталог
			ВременныйКаталог = ПолучитьИмяВременногоФайла();
			
			// Отсекаем имя файла от временного каталога
			РабИмяВременногоКаталога = ВременныйКаталог;
			позРазделителя           = Найти(РабИмяВременногоКаталога, "\");
			
			Пока (позРазделителя > 0) И (позРазделителя < СтрДлина(РабИмяВременногоКаталога)) Цикл
				
				ПозРаздПоследний         = позРазделителя;
				РабИмяВременногоКаталога = Лев(РабИмяВременногоКаталога, позРазделителя - 1) + "$" + Сред(РабИмяВременногоКаталога, позРазделителя + 1);
				позРазделителя           = Найти(РабИмяВременногоКаталога, "\");
				
			КонецЦикла;
			
			ВременныйКаталог = Лев(ВременныйКаталог, ПозРаздПоследний) + "To1C";
			
			СоздатьКаталог(ВременныйКаталог);
			УдалитьФайлы(ВременныйКаталог, "*");
			
			ВременныйКаталог = ВременныйКаталог + "\";
			
			Для Каждого Файл Из МассивНайденныхНаСервере Цикл
				Соединение.Получить(Файл.ПолноеИмя, ВременныйКаталог + Файл.Имя);
			КонецЦикла;
			
			МассивНайденных = НайтиФайлы(ВременныйКаталог, "*");
			
		Иначе // это локальный каталог
			
			МассивНайденных = НайтиФайлы(КаталогЗагрузки, "*");
			
		КонецЕсли;

		Для Каждого Файл Из МассивНайденных Цикл 
			
			ПредполагаемыйФормат = "";
			
			Если ИмяФайлаСоответствуетФорматам(Файл, Задание,ПредполагаемыйФормат , ОписаниеОшибки) Тогда
				
				Если ЗначениеЗаполнено(ПредполагаемыйФормат) Тогда
					
					Строка                  = ФайлыОбмена.Добавить();
					
					Строка.ИмяФайлаЗагрузки = Файл.Имя;
					Строка.Формат           = ПредполагаемыйФормат;
					Строка.ТипОбъекта       = ПредполагаемыйФормат.ПредставлениеОбъектаВНастройке;
					Строка.Загрузить        = Истина;
					
					Строка.ПолноеИмяФайла   = Файл.ПолноеИмя;
					
					ДвоичныеДанные 					= Новый ДвоичныеДанные(Файл.ПолноеИмя);
					АдресФайлаВоВременномХранилище 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные);
					
					 РаботаСФайлами.ДобавитьФайл(
					 Новый Структура("ВладелецФайлов, ИмяБезРасширения, РасширениеБезТочки, Автор, ВремяИзмененияУниверсальное",  
					 Задание.Ссылка, 
					 Лев(Файл.Имя, Найти(Файл.Имя, ".") - 1),
					 Сред(Файл.Имя, Найти(Файл.Имя, ".") + 1), 
					 Пользователи.ТекущийПользователь(),
					 УниверсальноеВремя(ТекущаяДатаСеанса())),     
					 АдресФайлаВоВременномХранилище);	
					
				КонецЕсли;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		
		КонецЦикла;
			
	Исключение
		ОписаниеОшибки = НСтр("ru = '"+ОписаниеОшибки()+"'");
		Возврат Ложь;
	КонецПопытки;
	

	ДокументЗадание.ФайлыОбмена.Загрузить(ФайлыОбмена);
	
	Для Каждого Строка Из ДокументЗадание.ОбъектыОбмена Цикл
		
		Строка.Объект.ПолучитьОбъект().УстановитьПометкуУдаления(Истина)
		
	КонецЦикла;
	
	ДокументЗадание.ОбъектыОбмена.Очистить();
	
	Если ДокументЗадание.ФайлыОбмена.Количество() = 0 Тогда
		ОписаниеОшибки =   НСтр("ru = 'Не найдено объектов, соответствующих настройкам обмена'");
		Возврат Ложь;
	КонецЕсли;
	
	
	Возврат Истина;
КонецФункции

Функция ОткрытьДокументФайла(Формат, ИмяФайлаЗагрузки, СсылкаНаЗадание, Результат, ОписаниеОшибки) Экспорт
	
	ОбработкаОбмена = Справочники.ТипыОбменаБанкиКС.ПолучитьОбработку(Формат.Владелец); //СоздатьОбработкуОбмена(Формат.Владелец, ОписаниеОшибки);
	
	Если ОбработкаОбмена = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат ОбработкаОбмена.ОткрытьДокументФайла(Формат, ИмяФайлаЗагрузки, СсылкаНаЗадание, Результат, ОписаниеОшибки);	
	
КонецФункции	

Процедура ЗагрузитьОбъекты(ЗаданиеНаИмпорт, Отказ = Ложь) экспорт
	ОписаниеОшибки = "";
	ОбработкаОбмена = Справочники.ТипыОбменаБанкиКС.ПолучитьОбработку(ЗаданиеНаИмпорт.ВидОбмена); //СоздатьОбработкуОбмена(ЗаданиеНаИмпорт.ВидОбмена, ОписаниеОшибки, Отказ);
	Если ОбработкаОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ОбработкаОбмена.ЗагрузитьОбъекты(ЗаданиеНаИмпорт);	
КонецПроцедуры	

Функция СформироватьЗаданиеНаИмпорт(ЗаданиеНаЭкспорт,УникальныйИдентификатор="",ЗагрузитьФайлы = Ложь) Экспорт
	Задание = Документы.ЗаданиеНаИмпортДанныхБанкиКС.СоздатьДокумент();
	Задание.Дата = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(Задание,ЗаданиеНаЭкспорт,"Организация,ДатаКон,ДатаНач,КассовыйОрган,ВидОбмена,НастройкаОбмена,НастройкаФорматов");
	Задание.Записать(РежимЗаписиДокумента.Запись);
	Если Задание.ВидОбмена.ТипФайлаПередачи = Перечисления.ТипыФайловПередачиДляОбмена.XML Тогда
		Расширение = "xml";
	Иначе
		Расширение = "txt";
	КонецЕсли;
	
	Для Каждого ОбъектОбмена Из ЗаданиеНаЭкспорт.ОбъектыОбмена Цикл
		
		ТаблицаОшибок = ЭкспортФайлов.ПолучитьТаблицуОшибок(ОбъектОбмена);
		Если ТаблицаОшибок.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОтветИзСервиса = ЭкспортФайлов.РазобратьОтветИзСервиса(ОбъектОбмена.ОтветWebСервиса, ТаблицаОшибок);
		
		Для Каждого ОтветWebСервиса Из ОтветИзСервиса Цикл
			
			Ответ = ОтветWebСервиса.Ответ;;
			Если ЗначениеЗаполнено(Ответ) Тогда
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
				Попытка
					Кодировка = КодировкаТекста[Задание.ВидОбмена.КодировкаТекстаФайла];
				Исключение
					Кодировка = Задание.ВидОбмена.КодировкаТекстаФайла;
				КонецПопытки;
				ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла,Кодировка);
				ЗаписьТекста.Записать(Ответ);
				ЗаписьТекста.Закрыть();
				Файл = Новый Файл(ИмяВременногоФайла);
				Если ТипЗнч(ОбъектОбмена.Объект) = Тип("ДокументСсылка.ЗапросУНИФО") Тогда
					Формат = Справочники.ФорматыОбменаБанкиКС.НайтиПоНаименованию("ОтветУНИФО",,,Задание.ВидОбмена);
					НовСтр = Задание.ФайлыОбмена.Добавить();
					НовСтр.Формат = Формат;
					НовСтр.ТипОбъекта = "Структура";
					НовСтр.Загрузить = Истина;
					НовСтр.ИмяФайлаЗагрузки = Файл.Имя;
					НовСтр.ПолноеИмяФайла   = Файл.ПолноеИмя;
					
					ДвоичныеДанные 					= Новый ДвоичныеДанные(Файл.ПолноеИмя);
					АдресФайлаВоВременномХранилище 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные);
					
					РаботаСФайлами.ДобавитьФайл(
					Новый Структура("ВладелецФайлов, ИмяБезРасширения, РасширениеБезТочки, Автор, ВремяИзмененияУниверсальное",  
					Задание.Ссылка, 
					Лев(Файл.Имя, Найти(Файл.Имя, ".") - 1),
					Сред(Файл.Имя, Найти(Файл.Имя, ".") + 1), 
					Пользователи.ТекущийПользователь(),
					УниверсальноеВремя(ТекущаяДатаСеанса())),     
					АдресФайлаВоВременномХранилище);	
								
					
				ИначеЕсли ТипЗнч(ОбъектОбмена.Объект) = Тип("ДокументСсылка.РегистрацияСведенийОбИмуществе") Тогда		
					РеестрИмуществаСервер.СформироватьЗаданиеНаИмпорт(ОбъектОбмена, Задание, Файл);
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
	Задание.Записать(РежимЗаписиДокумента.Запись);
	Если ЗагрузитьФайлы Тогда
		Отказ = Ложь;
		ЗагрузитьОбъекты(Задание, Отказ);
		Если Не Отказ Тогда
			Задание.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Задание.Ссылка;
	
КонецФункции

Функция РаспределитьОбъектыПоУчреждениям(ЗаданиеНаИмпортОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТабОбъектыОбмена",ЗаданиеНаИмпортОбъект.ОбъектыОбмена.Выгрузить());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КС_ЗаданиеНаИмпортОбъектыОбмена.Объект,
		|	КС_ЗаданиеНаИмпортОбъектыОбмена.ИмяФайлаЗагрузки,
		|	КС_ЗаданиеНаИмпортОбъектыОбмена.НомерСтроки,
		|	КС_ЗаданиеНаИмпортОбъектыОбмена.Формат
		|ПОМЕСТИТЬ ВремТаб
		|ИЗ
		|	&ТабОбъектыОбмена КАК КС_ЗаданиеНаИмпортОбъектыОбмена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Объект,
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.ИмяФайлаЗагрузки,
		|	ВложенныйЗапрос.НомерСтроки,
		|	ВложенныйЗапрос.Формат
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВремТаб.Объект КАК Объект,
		|		ВЫБОР
		|			КОГДА ВремТаб.Объект ССЫЛКА Документ.ПлатежВОплатуГосуслуг
		|				ТОГДА ВЫРАЗИТЬ(ВремТаб.Объект КАК Документ.ПлатежВОплатуГосуслуг).Организация
		|			КОГДА ВремТаб.Объект ССЫЛКА Документ.ПлатежПодведомственному
		|				ТОГДА ВЫРАЗИТЬ(ВремТаб.Объект КАК Документ.ПлатежПодведомственному).Организация
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ КАК Организация,
		|		ВремТаб.ИмяФайлаЗагрузки КАК ИмяФайлаЗагрузки,
		|		ВремТаб.НомерСтроки КАК НомерСтроки,
		|		ВремТаб.Формат КАК Формат
		|	ИЗ
		|		ВремТаб КАК ВремТаб) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Организация <> &Организация 
		|	И ВложенныйЗапрос.Организация<>Неопределено
		|ИТОГИ ПО
		|	Организация";

	Запрос.УстановитьПараметр("Организация", ЗаданиеНаИмпортОбъект.Организация);

	Результат = Запрос.Выполнить();
    МассивДокументовИмпорта = Новый Массив;
	
	ВыборкаУчреждение = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    МассивУдаляемыхСтрок = Новый Массив;
	ГлавныйКомментарий = "При группировке платежей по учреждениям сформированы документы: ";
	Пока ВыборкаУчреждение.Следующий() Цикл
		
        НовЗаданиеНаИмпорт = ЗаданиеНаИмпортОбъект.Скопировать();
		НовЗаданиеНаИмпорт.Дата = ЗаданиеНаИмпортОбъект.Дата;
		ВыборкаДетальныеЗаписи = ВыборкаУчреждение.Выбрать();
        НовЗаданиеНаИмпорт.Организация = ВыборкаУчреждение.Организация;
		НовЗаданиеНаИмпорт.КассовыйОрган = Неопределено;
		НовЗаданиеНаИмпорт.ФайлыОбмена.Очистить();
		НовЗаданиеНаИмпорт.ОбъектыОбмена.Очистить();
		
		МассивИспользуемыхФайлов = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовСтр = НовЗаданиеНаИмпорт.ОбъектыОбмена.Добавить();
			НовСтр.Объект = ВыборкаДетальныеЗаписи.Объект;
			НовСтр.ИмяФайлаЗагрузки = ВыборкаДетальныеЗаписи.ИмяФайлаЗагрузки;
            НовСтр.Формат = ВыборкаДетальныеЗаписи.Формат;
			НовСтр.ОписаниеОшибки = ЗаданиеНаИмпортОбъект.ОбъектыОбмена[ВыборкаДетальныеЗаписи.НомерСтроки-1].ОписаниеОшибки;
			Если МассивИспользуемыхФайлов.Найти(ВыборкаДетальныеЗаписи.ИмяФайлаЗагрузки)=Неопределено Тогда
				МассивИспользуемыхФайлов.Добавить(ВыборкаДетальныеЗаписи.ИмяФайлаЗагрузки);
			КонецЕсли;
			МассивУдаляемыхСтрок.Добавить(ЗаданиеНаИмпортОбъект.ОбъектыОбмена[ВыборкаДетальныеЗаписи.НомерСтроки-1]);
		КонецЦикла;
		НовЗаданиеНаИмпорт.Комментарий = "Документ сформирован при группировке платежей по организациям из документа " + Строка(ЗаданиеНаИмпортОбъект.Ссылка);
		НовЗаданиеНаИмпорт.Записать(РежимЗаписиДокумента.Запись);
		ГлавныйКомментарий = ГлавныйКомментарий + Строка(НовЗаданиеНаИмпорт.Ссылка)+";";
		МассивДокументовИмпорта.Добавить(НовЗаданиеНаИмпорт.Ссылка);
	КонецЦикла;
	
	Для Каждого ЭлМас Из МассивУдаляемыхСтрок Цикл
		ЗаданиеНаИмпортОбъект.ОбъектыОбмена.Удалить(ЭлМас);	
	КонецЦикла;
	
	Если ГлавныйКомментарий = "При группировке платежей по учреждениям сформированы документы: " Тогда
		ГлавныйКомментарий = "Все загруженые документы - загружены данным документом";
	КонецЕсли;
	
	ЗаданиеНаИмпортОбъект.Комментарий = ГлавныйКомментарий;
					
    ЗаданиеНаИмпортОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	МассивДокументовИмпорта.Добавить(ЗаданиеНаИмпортОбъект.Ссылка);
	
	Возврат МассивДокументовИмпорта;
	
КонецФункции

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".  
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.Ссылка.Организация КАК Организация,
	                      |	ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.Ссылка.КассовыйОрган КАК КассовыйОрган,
	                      |	ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.Ссылка.ВидОбмена КАК ТипФормата,
	                      |	ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.Объект КАК Объект,
	                      |	ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.ИмяФайлаЗагрузки КАК ИмяФайла,
	                      |	ЗНАЧЕНИЕ(Перечисление.НаправлениеОбменаБанкиКС.Импорт) КАК НаправлениеОбмена,
	                      |	ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.Ссылка.Дата КАК Дата
	                      |ПОМЕСТИТЬ Врем_Док
	                      |ИЗ
	                      |	Документ.ЗаданиеНаИмпортДанныхБанкиКС.ОбъектыОбмена КАК ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена
	                      |ГДЕ
	                      |	ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.Ссылка = &Ссылка
	                      |;
	                      |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ
						  |	КС_ИсторияОбмена.Объект КАК Объект
						  |ПОМЕСТИТЬ Врем_Кроме
						  |ИЗ
						  |	РегистрСведений.ИсторияОбменаБанкиКС КАК КС_ИсторияОбмена
						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Врем_Док КАК Врем_Док
						  |		ПО КС_ИсторияОбмена.Объект = Врем_Док.Объект
						  |			И КС_ИсторияОбмена.Организация = Врем_Док.Организация
						  |			И КС_ИсторияОбмена.КассовыйОрган = Врем_Док.КассовыйОрган
						  |			И КС_ИсторияОбмена.ТипФормата = Врем_Док.ТипФормата
						  |ГДЕ
						  |	КС_ИсторияОбмена.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.НаправлениеОбменаБанкиКС.Импорт)
						  |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Врем_Док.Организация,
	                      |	Врем_Док.КассовыйОрган,
	                      |	Врем_Док.ТипФормата,
	                      |	Врем_Док.Объект,
	                      |	Врем_Док.ИмяФайла,
	                      |	Врем_Док.НаправлениеОбмена,
	                      |	Врем_Док.Дата
	                      |ИЗ
	                      |	Врем_Док КАК Врем_Док
						  |");
						  
	Запрос.УстановитьПараметр("Ссылка",  ДокументСсылка);	
	Результат = Запрос.ВыполнитьПакет();
	ИсторияОбменаДвижения = Результат[2].Выгрузить();
	
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ИсторияОбменаБанкиКС",  ИсторияОбменаДвижения);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяФайлаСоответствуетФорматам(Файл, Задание,ПредполагаемыйФормат,ОписаниеОшибки = "")
	ТипФормата	 = Задание.ВидОбмена;
	Организация	 = Задание.Организация;
	ДатаКон		 = Задание.ДатаКон;
	ДатаНач 	 = Задание.ДатаНач;

	
	Если  ТипФормата.ИмяФайлаПередачи.Количество() = 0 Тогда
		ОписаниеОшибки = НСтр("ru='Правила для вычисления имени файла и подбора формата отсутствуют.'");
		Возврат Ложь;
	КонецЕсли;
	
	НомерПервогоСимвола   = 1;
	СвободныеПараметры    = Новый Соответствие;
	ИмяПроверяемогоФайла  = Файл.Имя;
	Для к = 1 По ТипФормата.ИмяФайлаПередачи.Количество() Цикл
			
		Правило             = ТипФормата.ИмяФайлаПередачи.Найти(к, "НомерСтроки");
		Длина               = Правило.ДлинаПараметра;
		
		Если НЕ ЗначениеЗаполнено(Правило.Соответствие) Тогда
			ОписаниеОшибки = НСтр("ru='Отсутствует порядок определения соответствия участка имени файла правилам в строке :" + Правило.НомерСтроки+"'");
			Возврат Ложь;
		КонецЕсли;
		
		Если СтрДлина(ИмяПроверяемогоФайла) >= (НомерПервогоСимвола + Длина - 1) Тогда
			Значение        = Сред(ИмяПроверяемогоФайла, НомерПервогоСимвола, Длина);
		Иначе
			Значение        = "";
		КонецЕсли;
			
		НомерПервогоСимвола = НомерПервогоСимвола + Длина;
		
		БылоИсключение = Ложь;
		Попытка
			Результат      = ОбщегоНазначения.ВычислитьВБезопасномРежиме(Правило.Соответствие); 
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			БылоИсключение = истина;
		КонецПопытки;
		
		Если БылоИсключение Тогда
			ОписаниеОшибки = НСтр("ru='"+ОписаниеОшибки+" в строке : " + Правило.НомерСтроки+"'");
			Возврат Ложь;
		КонецЕсли;	
		
		Если НЕ Результат Тогда
			// Правило вычислено но не верно поэтому возврат Истина;
			Возврат Истина;
		КонецЕсли;
			
	КонецЦикла;
			
	Возврат Истина;
	
КонецФункции

Функция ПараметрыЗадания(СсылкаНаДокумент) 
	ТекстЗапроса ="ВЫБРАТЬ
	              |	Задание.Ссылка,
	              |	Задание.Дата,
	              |	Задание.ДатаКон,
	              |	Задание.ДатаНач,
	              |	Задание.Организация,
	              |	Задание.КассовыйОрган,
	              |	Задание.ВидОбмена,
	              |	Задание.НастройкаОбмена
	              |ИЗ
	              |	Документ.ЗаданиеНаИмпортДанныхБанкиКС КАК Задание
	              |ГДЕ
	              |	Задание.Ссылка = &Ссылка
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ЗаданиеФайлыОбмена.ИмяФайлаЗагрузки,
	              |	ЗаданиеФайлыОбмена.Формат,
	              |	ЗаданиеФайлыОбмена.ТипОбъекта,
	              |	ЗаданиеФайлыОбмена.Загрузить,
	              |	ЗаданиеФайлыОбмена.ПолноеИмяФайла,
	              |	ЗаданиеФайлыОбмена.ОписаниеОшибки,
	              |	ЗаданиеФайлыОбмена.Описание
	              |ИЗ
	              |	Документ.ЗаданиеНаИмпортДанныхБанкиКС.ФайлыОбмена КАК ЗаданиеФайлыОбмена
	              |ГДЕ
	              |	ЗаданиеФайлыОбмена.Ссылка = &Ссылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	Возврат Запрос.ВыполнитьПакет();
КонецФункции	

#КонецОбласти

#КонецЕсли
