////////////////////////////////////////////////////////////////////////////////
// Бюджетная отчетность (получение НСИ - переопределяемый модуль):
//
//          Получение нормативно-справочной 
//          информации в рамках подсистемы отчетности
//  
////////////////////////////////////////////////////////////////////////////////

// Глава по БК, который получает отчет. Может отличаться от основного Главы учреждения
//
// Параметры:
//  Организация - орг. единица, предоставляющая отчет
//  ИФО - источник фин. обеспечения (может переопределять главу)
//
// Возвращаемое значение: используемый Глава по БК
//
Функция ГлаваПоБКПолучательОтчета(Знач Организация, Знач ИФО) Экспорт

	Перем Результат;
	
	ИспользоватьУчетПоИФО = БюджетнаяОтчетностьСервер.ИспользоватьУчетПоИФО();
	
	Если ЗначениеЗаполнено(ИФО) И ИспользоватьУчетПоИФО Тогда
		


			
			РеквизитыИФО  = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИФО, "ИспользоватьРеквизитыИФО,КодГлавыБК");
			Результат = РеквизитыИФО.КодГлавыБК;
			

				
		Если РеквизитыИФО.ИспользоватьРеквизитыИФО Тогда
			
			Возврат Результат;
			
		КонецЕсли;
		
		Возврат БюджетнаяОтчетностьПолучениеНСИ.ГлаваПоБК(Организация);
		
	Иначе 
		
		Возврат БюджетнаяОтчетностьПолучениеНСИ.ГлаваПоБК(Организация);
		
		
	КонецЕсли;
	
КонецФункции // ГлаваПоБКПолучательОтчета()

// Бюджет, в котором составлен отчет. Может отличаться от основного бюджета учреждения
//
// Параметры:
//  Организация - орг. единица, предоставляющая отчет
//  ИФО - источник фин. обеспечения (может переопределять бюджет)
//
// Возвращаемое значение: используемый бюджет
//
Функция БюджетПолучательОтчета(Знач Организация, Знач ИФО) Экспорт
	
	ИспользоватьУчетПоИФО = БюджетнаяОтчетностьСервер.ИспользоватьУчетПоИФО();

	Если ЗначениеЗаполнено(ИФО) И ИспользоватьУчетПоИФО Тогда
		
		РеквизитыИФО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИФО, "ИспользоватьРеквизитыИФО, Бюджет");
		Если РеквизитыИФО.ИспользоватьРеквизитыИФО Тогда
			Возврат РеквизитыИФО.Бюджет;
		Иначе
			Возврат БюджетнаяОтчетностьПолучениеНСИ.БюджетОрганизации(Организация);
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат БюджетнаяОтчетностьПолучениеНСИ.БюджетОрганизации(Организация);
		
КонецФункции // БюджетПолучательОтчета()

Функция ГоловнаяОрганизация(Знач Организация) Экспорт
	

	Возврат ОбщегоНазначенияБГУ.ГоловнаяОрганизация(Организация);

	
КонецФункции // ГоловнаяОрганизация()

Функция ОфициальноеНаименованиеОрганизации(Знач Организация, Знач ПриоритетСокращенного = Неопределено) Экспорт
	


		
		Если ПриоритетСокращенного = Неопределено Тогда
			Возврат Справочники.Организации.ПредставлениеУчреждения(Организация);
		Иначе
			Возврат Справочники.Организации.ПредставлениеУчреждения(Организация, ПриоритетСокращенного);
		КонецЕсли;
		

	
	Возврат Строка(Организация);

КонецФункции // ОфициальноеНаименованиеОрганизации()

Функция ОфициальноеНаименованиеКонтрагента(Знач Контрагент, Знач ПриоритетСокращенного = Неопределено) Экспорт
	


		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.НаименованиеСокращенное,
	|	Контрагенты.Наименование,
	|	ВЫРАЗИТЬ(Контрагенты.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).НаименованиеПолное КАК НаименованиеПолное
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат "";
	КонецЕсли;
	
	Если ПриоритетСокращенного = Неопределено Тогда
		ПриоритетСокращенного = Истина;
	КонецЕсли;
	
	РабочееНаименование = ?(ПриоритетСокращенного и Не ПустаяСтрока(Выборка.НаименованиеСокращенное),
							Выборка.НаименованиеСокращенное,
							Выборка.НаименованиеПолное);
	
	Если Не ПустаяСтрока(РабочееНаименование) Тогда
		Возврат РабочееНаименование;
	Иначе
		Возврат Выборка.Наименование;
	КонецЕсли;	
	

КонецФункции // ОфициальноеНаименованиеКонтрагента()

Функция СокращенноеНаименованиеКонтрагента(Знач Контрагент) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.НаименованиеСокращенное,
		|	Контрагенты.Наименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Ссылка";
	
	РабочееНаименование = "";
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.НаименованиеСокращенное) Тогда		
			РабочееНаименование = Выборка.НаименованиеСокращенное;
		Иначе
			РабочееНаименование = Выборка.Наименование;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РабочееНаименование;
	
КонецФункции // СокращенноеНаименованиеКонтрагента()

// Переопределяемый метод обращения к реквизитам аналитики.
//
Процедура ДополнитьСоответствиеПолейИТиповАналитики(СоответствиеПолей) Экспорт
	

		
	// Соответствие полей для типа СправочникСсылка.Контрагенты
	ДобавитьСоответствиеКонтрагенты(СоответствиеПолей, "КодПоППП", "ПРЕДСТАВЛЕНИЕССЫЛКИ($.ЮридическоеФизическоеЛицо.КодПоППП)");
	ДобавитьСоответствиеКонтрагенты(СоответствиеПолей, "КодПоРПБС");
	ДобавитьСоответствиеКонтрагенты(СоответствиеПолей, "КодОКПО");
	ДобавитьСоответствиеКонтрагенты(СоответствиеПолей, "ИНН");
	ДобавитьСоответствиеКонтрагенты(СоответствиеПолей, "КПП");
	ДобавитьСоответствиеКонтрагенты(СоответствиеПолей, "Бюджет", "ПРЕДСТАВЛЕНИЕССЫЛКИ($.ЮридическоеФизическоеЛицо.Бюджет)");
	ДобавитьСоответствиеКонтрагенты(СоответствиеПолей, "ОГРН");
	ДобавитьСоответствиеКонтрагенты(СоответствиеПолей, "СтранаРегистрации");
	
	// официальное наименование
	Стр              = СоответствиеПолей.Добавить();
	Стр.ТипЗначения  = "Справочник.Контрагенты";
	Стр.ИмяРеквизита = "НаименованиеПолное";
	Стр.ЭтоВыражение = Истина;
	Стр.ПутьКДанным  = 
	"ВЫБОР 
	|	КОГДА $.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) И НЕ ($.ЮридическоеФизическоеЛицо.НаименованиеПолное ПОДОБНО """")
	|		ТОГДА $.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|	КОГДА НЕ ($.НаименованиеСокращенное ПОДОБНО """")
	|		ТОГДА $.НаименованиеСокращенное 
	|	ИНАЧЕ 
	|		$.Наименование
	|КОНЕЦ";
	

	
КонецПроцедуры // СоответствиеПолейИТиповАналитики()

Процедура ДобавитьСоответствиеКонтрагенты(Знач СоответствиеПолей, Знач ИмяРеквизита, Знач Выражение = Неопределено)
	

		
	Стр              = СоответствиеПолей.Добавить();
	Стр.ТипЗначения  = "Справочник.Контрагенты";
	Стр.ИмяРеквизита = ИмяРеквизита;
	Стр.ЭтоВыражение = Истина;
	Стр.ПутьКДанным  = 
	"ВЫБОР 
	|	КОГДА $.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) 
	|		ТОГДА " + ?(Выражение = Неопределено, "$.ЮридическоеФизическоеЛицо."+ИмяРеквизита, Выражение) + "
	|	ИНАЧЕ """" 
	|КОНЕЦ";



КонецПроцедуры

Процедура ЗаполнитьСоответствиеПолейКодовОрганизации(Поля) Экспорт


		Поля.Вставить("ИНН"      , "ИНН");
		Поля.Вставить("КПП"      , "КПП");
		Поля.Вставить("КОДПОРПБС", "КодПоРПБС");
		Поля.Вставить("КОДПОППП" , "КодПоППП");
		Поля.Вставить("КОДОКАТО" , "КодОКАТО");
		Поля.Вставить("ОКПО"     , "КодОКПО");
		Поля.Вставить("ОКАТО"    , "КодОКАТО");
		Поля.Вставить("УБП"      , "КодПоРПБС");
		Поля.Вставить("КОДУБП"   , "КодПоРПБС");
		Поля.Вставить("КОДРПБС"  , "КодПоРПБС");
		Поля.Вставить("ППП"      , "КодПоППП");
		Поля.Вставить("БЮДЖЕТ"   , "Бюджет");
		Поля.Вставить("ОГРН"     , "ОГРН");
		


КонецПроцедуры 

Процедура ЗаполнитьСоответствиеПолейКодовКонтрагента(Поля) Экспорт




	
	Поля.Вставить("ИНН"      , "ЮридическоеФизическоеЛицо.ИНН");
	Поля.Вставить("КПП"      , "ЮридическоеФизическоеЛицо.КПП");
	Поля.Вставить("КОДПОРПБС", "ЮридическоеФизическоеЛицо.КодПоРПБС");
	Поля.Вставить("КОДПОППП" , "ЮридическоеФизическоеЛицо.КодПоППП");
	Поля.Вставить("КОДОКАТО" , "ЮридическоеФизическоеЛицо.Бюджет.Код");
	Поля.Вставить("ОКПО"     , "ЮридическоеФизическоеЛицо.КодОКПО");
	Поля.Вставить("ОКАТО"    , "ЮридическоеФизическоеЛицо.Бюджет.Код");
	Поля.Вставить("УБП"      , "ЮридическоеФизическоеЛицо.КодПоРПБС");
	Поля.Вставить("КОДУБП"   , "ЮридическоеФизическоеЛицо.КодПоРПБС");
	Поля.Вставить("КОДРПБС"  , "ЮридическоеФизическоеЛицо.КодПоРПБС");
	Поля.Вставить("ППП"      , "ЮридическоеФизическоеЛицо.КодПоППП");
	Поля.Вставить("ОГРН"     , "ЮридическоеФизическоеЛицо.ОГРН");
	Поля.Вставить("БЮДЖЕТ"   , "ЮридическоеФизическоеЛицо.Бюджет");
	Поля.Вставить("СТРАНА"   , "ЮридическоеФизическоеЛицо.СтранаРегистрации");
	Поля.Вставить("КОДСТРАНЫ", "ЮридическоеФизическоеЛицо.СтранаРегистрации.Код");

	


КонецПроцедуры 

// Возвращает контактное лицо организации с указанной ролью
//
// Параметры
//  Организация  - Справочник.Организации.
//                 организационная единица для которой определяется физлицо
//  Роль		 - Справочник.РолиКонтактныхЛиц
//                 искомая роль контактного лица
//
// Возвращаемое значение:
//  Справочники.Сотрудники в БГУ1 И БГУ2 или Справочник.КонтактныеЛицаОрганизаций в Своде 
//
Функция ОтветственноеЛицоОрганизации(Знач Организация, Роль, Дата) Экспорт

	Если Дата = Неопределено Тогда
		ИскатьНаДату = ТекущаяДатаСеанса();
	Иначе 
		ИскатьНаДату = Дата;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	ОрганизацияДляЗапроса = БюджетнаяОтчетностьПолучениеНСИ.ПолучитьОрганизациюДляОтветственныхЛиц(Организация);
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"	,ОрганизацияДляЗапроса);
	Запрос.УстановитьПараметр("Роль"		,Перечисления.ОтветственныеЛицаОрганизаций[Роль]);
	Запрос.УстановитьПараметр("Дата"		,КонецДня(ИскатьНаДату));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтветственныеЛицаУчрежденийСрезПоследних.ОтветственноеЛицо КАК ОтветственноеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И ВидОтветственногоЛица = &Роль
	|				И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК ОтветственныеЛицаУчрежденийСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ОтветственноеЛицо;
	Иначе
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // ОтветственноеЛицоОрганизации()

Функция ПолучитьРеквизитыОтветственногоЛица(ПерсонаСсылка,ДатаПолучения = Неопределено) Экспорт
	
	РеквизитыПерсоны = Новый Структура("Наименование,Фамилия,Имя,Отчество,Должность","","","","","");	

	ДанныеСотрудника = Справочники.Сотрудники.ПолучитьДанныеСотрудников(ПерсонаСсылка,"НаименованиеПолное,Фамилия,Имя,Отчество,Должность",ДатаПолучения);	
	Если ДанныеСотрудника.Количество()>0 Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыПерсоны,ДанныеСотрудника[0],"Фамилия,Имя,Отчество,Должность");
		РеквизитыПерсоны.Наименование = ДанныеСотрудника[0].НаименованиеПолное;
	КонецЕсли;		


	Возврат РеквизитыПерсоны;
		

КонецФункции // ФИООтветственногоЛица()

Функция ПостроитьЗапросКБюджету(Знач Параметр, Знач ИФО, Знач РеквизитБюджета) Экспорт 
	
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Организации") Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Организации.Бюджет." + БюджетнаяОтчетностьПолучениеНСИ.ИмяРеквизитаБюджета(РеквизитБюджета) + ", НЕОПРЕДЕЛЕНО) КАК Значение,
		|	2 КАК Приоритет
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Параметр";

	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Бюджеты") Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Бюджеты." + БюджетнаяОтчетностьПолучениеНСИ.ИмяРеквизитаБюджета(РеквизитБюджета) + " КАК Значение,
		|	2 КАК Приоритет
		|ИЗ
		|	Справочник.Бюджеты КАК Бюджеты
		|ГДЕ
		|	Бюджеты.Ссылка = &Параметр";
		
	Иначе
		ВызватьИсключение НСтр("ru = 'Неверное значение параметра (1)'");
	КонецЕсли;
	
	ИспользоватьУчетПоИФО = БюджетнаяОтчетностьСервер.ИспользоватьУчетПоИФО();

	Если ЗначениеЗаполнено(ИФО) И ИспользоватьУчетПоИФО Тогда
		
		// получение реквизитов относительно ИФО

		ТекстЗапросаИФО = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ИсточникиФинансовогоОбеспечения.Бюджет." + БюджетнаяОтчетностьПолучениеНСИ.ИмяРеквизитаБюджета(РеквизитБюджета) + ", НЕОПРЕДЕЛЕНО) КАК Значение,
		|	1 КАК Приоритет
		|ИЗ
		|	Справочник.ИсточникиФинансовогоОбеспечения КАК ИсточникиФинансовогоОбеспечения
		|ГДЕ
		|	ИсточникиФинансовогоОбеспечения.Ссылка = &ИФО
		|	И ИсточникиФинансовогоОбеспечения.ИспользоватьРеквизитыИФО";

		
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВложенныйЗапрос.Значение
		|ИЗ
		|	(
		|	" + ТекстЗапросаИФО + "
		|	ОБЪЕДИНИТЬ ВСЕ
		|	" + ТекстЗапроса + "
		|	) КАК ВложенныйЗапрос
		|УПОРЯДОЧИТЬ ПО
		|	ВложенныйЗапрос.Приоритет";
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Параметр", Параметр);
	Запрос.УстановитьПараметр("ИФО", ИФО);
	
	Возврат Запрос;
	
КонецФункции // ПостроитьЗапросКБюджету()

Функция ПолучитьДанныеЦБ(Знач Организация,Знач НаДату, РеквизитыЦБ) Экспорт
	
	Результат = "";

	ОргЦБ = ПолучитьЦБ(Организация);
	
	Если НЕ ЗначениеЗаполнено(ОргЦБ) Тогда
		Возврат "";
	КонецЕсли;
	
	МассивРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РеквизитыЦБ,,Истина,Истина);	
	Если МассивРеквизитов.Найти("Наименование")<> Неопределено Тогда
		Результат = БюджетнаяОтчетностьПолучениеНСИ.ОфициальноеНаименование(ОргЦБ,,НаДату);
	КонецЕсли;
	
	СтруктураРеквизитов = БюджетнаяОтчетностьПолучениеНСИ.ПолучитьКоды(ОргЦБ,РеквизитыЦБ);
	
	Для Каждого КлючИЗначение ИЗ СтруктураРеквизитов Цикл
		Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Результат = Результат + ?(ЗначениеЗаполнено(Результат),", ","")+КлючИЗначение.Ключ+" "+КлючИЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если МассивРеквизитов.Найти("Местонахождение")<>Неопределено Тогда
		Адрес = КонтактнаяИнформацияОрганизации(ОргЦБ,"ФактАдрес");
		Если ЗначениеЗаполнено(Адрес) Тогда     
			Результат = Результат + ?(ЗначениеЗаполнено(Результат),", ","")+Адрес;
		КонецЕсли;
	КонецЕсли;

	
	Возврат Результат;
КонецФункции

Функция ПолучитьДанныеЦБСтруктурой(Знач Организация,Знач НаДату, РеквизитыЦБ) Экспорт
	
	Результат = Новый Структура(РеквизитыЦБ);
	
	ОргЦБ = ПолучитьЦБ(Организация);
	
	Если НЕ ЗначениеЗаполнено(ОргЦБ) Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РеквизитыЦБ,,Истина,Истина);	
	Если МассивРеквизитов.Найти("Наименование")<> Неопределено Тогда
		Результат.Вставить("Наименование",БюджетнаяОтчетностьПолучениеНСИ.ОфициальноеНаименование(ОргЦБ,,НаДату));
	КонецЕсли;
	
	СтруктураРеквизитов = БюджетнаяОтчетностьПолучениеНСИ.ПолучитьКоды(ОргЦБ,РеквизитыЦБ);
	
	Для Каждого КлючИЗначение ИЗ СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);
	КонецЦикла;
	
	Если МассивРеквизитов.Найти("Местонахождение")<>Неопределено Тогда
		Адрес = КонтактнаяИнформацияОрганизации(ОргЦБ,"ФактАдрес");
		Результат.Вставить("Местонахождение",Адрес);
	КонецЕсли;

	Возврат Результат;
КонецФункции
	
Функция ПолучитьЦБ(Знач Организация) Экспорт
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЦентрализованнуюБухгалтерию") = Ложь Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОргЦБ = Константы.ОрганизацияЦентрализованнаяБухгалтерия.Получить();
	Если Не ЗначениеЗаполнено(ОргЦБ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Организация = ОргЦБ Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Возврат ОргЦБ;
	
КонецФункции

Функция КонтактнаяИнформацияОрганизации(Организация, ВидКИ) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление,
	               |	КонтактнаяИнформация.ЗначенияПолей
	               |ИЗ
	               |	Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Ссылка = &Организация";
				   
	ТаблицаКонтактнойИнформации = Запрос.Выполнить().Выгрузить();
	 
	СтруктураКИ = Новый Структура("Телефон, ЮрАдрес, ЮрСтрана, ЮрКодСтраны, ФактАдрес, ФактСтрана, ФактКодСтраны");
	
	Для каждого СтрокаКИ Из ТаблицаКонтактнойИнформации Цикл
		Если СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
		 	СтруктураКИ.ЮрАдрес = СтрокаКИ.Представление;
			СтруктураКИ.ЮрСтрана = "РОССИЯ";
			СтруктураКИ.ЮрКодСтраны = "643";
			СписокПолей = ПреобразоватьСтрокуВСписокПолей(СтрокаКИ.ЗначенияПолей);
			Для Каждого ЗначениеПоля Из СписокПолей Цикл
				Если ВРег(ЗначениеПоля.Представление) = "СТРАНА" Тогда
					СтруктураКИ.ЮрСтрана = ЗначениеПоля.Значение;
				ИначеЕсли ВРег(ЗначениеПоля.Представление) = "КОДСТРАНЫ" Тогда
					СтруктураКИ.ЮрКодСтраны = ЗначениеПоля.Значение;
				КонецЕсли;
			КонецЦикла;
        ИначеЕсли СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации Тогда
		 	СтруктураКИ.ФактАдрес = СтрокаКИ.Представление;
			СтруктураКИ.ФактСтрана = "РОССИЯ";
			СтруктураКИ.ФактКодСтраны = "643";
			СписокПолей = ПреобразоватьСтрокуВСписокПолей(СтрокаКИ.ЗначенияПолей);
			Для Каждого ЗначениеПоля Из СписокПолей Цикл
				Если ВРег(ЗначениеПоля.Представление) = "СТРАНА" Тогда
					СтруктураКИ.ФактСтрана = ЗначениеПоля.Значение;
				ИначеЕсли ВРег(ЗначениеПоля.Представление) = "КОДСТРАНЫ" Тогда
					СтруктураКИ.ФактКодСтраны = ЗначениеПоля.Значение;
				КонецЕсли;
			КонецЦикла;
	 	ИначеЕсли СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации ТОГДА
		 	СтруктураКИ.Телефон = СтрокаКИ.Представление;			
		КонецЕсли; 
	КонецЦикла; 
		
    Результат = "";
	
	Если СтруктураКИ.Свойство(ВидКИ, Результат) Тогда 
		Возврат Результат;
	Иначе
		Возврат "";
	КонецЕсли;
	
	Возврат "";
	

КонецФункции

Функция ПреобразоватьСтрокуВСписокПолей(СтрокаПолей)
	
	Результат = Новый СписокЗначений;
	ПоследнийЭлемент = Неопределено;
	
	Для Сч = 1 По СтрЧислоСтрок(СтрокаПолей) Цикл
		Стр = СтрПолучитьСтроку(СтрокаПолей, Сч);
		Если Лев(Стр, 1) = Символы.Таб Тогда
			Если ПоследнийЭлемент <> Неопределено Тогда
				ПоследнийЭлемент.Значение = ПоследнийЭлемент.Значение + Символы.ПС + Сред(Стр, 2);
			КонецЕсли;
		Иначе
			Поз = Найти(Стр, "=");
			Если Поз <> 0 Тогда
				ПоследнийЭлемент = Результат.Добавить(Сред(Стр, Поз+1), Лев(Стр, Поз-1));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции



