#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	ПрослеживаемостьБГУ.ОбработкаПроведения(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ЭтоЗаполнениеНаОснованииИнвентаризации0510466(ДанныеЗаполнения) Тогда
		ЗаполнитьПоИнвентаризации0510466(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		Основание = Неопределено;
		ДанныеЗаполнения.Свойство("Основание", Основание);
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ИнвентаризацияМЗ") Тогда
			СтандартнаяОбработка = Ложь;
			Документы.ИнвентаризацияМЗ.ВводНаОсновании_ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ТаксировкаПутевогоЛиста") Тогда
			ЗаполнитьПоТаксировкеДокументовУчетаГСМ(ДанныеЗаполнения, "ТС");
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ТаксировкаРабочегоЛистаАгрегата") Тогда	
			ЗаполнитьПоТаксировкеДокументовУчетаГСМ(ДанныеЗаполнения, "Агрегаты");
		КонецЕсли;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПоступлениеМЗ") Тогда
		
		ЗаполнитьПоПоступлениюМЗ(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомМЗ") Тогда
		
		ЗаполнитьПоРешениюОПрекращенииПризнанияАктивомМЗ(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.СписаниеТранспорта")
		Или ТипДанныхЗаполнения = Тип("ДокументСсылка.СписаниеТранспортаИК")
		Или ТипДанныхЗаполнения = Тип("ДокументСсылка.ПередачаОбъектовОС")
		Или ТипДанныхЗаполнения = Тип("ДокументСсылка.ПередачаОбъектовИК") Тогда
		
		ЗаполнитьПоСписаниюОС(ДанныеЗаполнения);
	
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ТребованиеНакладная0315006") Тогда
		
		ЗаполнитьПоТребованиюНакладной(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ИнвентаризационнаяОписьНФА") Тогда
		Документы.АктСписанияМЗ.ЗаполнитьПоИнвентаризации0510466(ДокументОснование, ЭтотОбъект)
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СтруктураДействий = УправлениеМатериальнымиЗапасами.ДопустимыеДействияОбработкиТабличнойЧасти();
	СтруктураДействий.ПроверитьОчиститьКПС = Истина;
	Если Не КФОВТабличнойЧасти Тогда
		СтруктураДействий.ОчиститьКФО = Истина;
	КонецЕсли;
		
	УправлениеМатериальнымиЗапасами.ОбработатьТабличнуюЧасть(Материалы, СтруктураДействий);

	ПрослеживаемостьБГУ.УстановкаВариантаКомплектаВТЧДокументов(ЭтотОбъект, "Материалы",, Отказ);
	ПрослеживаемостьБГУ.УдалитьНеиспользуемыеСтрокиСведенийПрослеживаемости(ЭтотОбъект, "Материалы", Истина);
	ПрослеживаемостьБГУ.СписаниеМЗПриЗаписи(ЭтотОбъект, Отказ, РежимЗаписи);
	УправлениеМатериальнымиЗапасами.ДокументПередЗаписью(ЭтотОбъект, РежимЗаписи, Отказ);
	ОбщегоНазначенияБГУ.ЗаполнитьИдентификаторыСтрок(Материалы, Ложь);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("Материалы.СтранаПроисхождения");
	Если КФОВТабличнойЧасти Тогда
		НепроверяемыеРеквизиты.Добавить("КФО");
	Иначе
		НепроверяемыеРеквизиты.Добавить("Материалы.КФО");
	КонецЕсли;
	
	Если ЕстьРешениеОПрекращенииПризнанияАктивом Тогда
		ПроверитьЗаполнениеРешенияОПрекращенииПризнанияАктивом(Отказ, НепроверяемыеРеквизиты);
	Иначе
		НепроверяемыеРеквизиты.Добавить("ДокументОснование");
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	УправлениеМатериальнымиЗапасами.ПроверитьЗаполнениеКолонкиКПСВТаблицеМатериалов(ЭтотОбъект, "Материалы", "Материалы", Отказ);
	ПрослеживаемостьБГУ.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	ОбработкаПроверкиЗаполненияСодержанияДрагМатериалов(Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗаполнениеРеквизитовОбъектов.ЗаполнитьДатуПриКопировании(ЭтотОбъект, ОбъектКопирования);
	ДатаНовогоДокумента = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	
	Если УправлениеМатериальнымиЗапасами.СчетУчетаРавен105(ЭтотОбъект)
			Или УправлениеМатериальнымиЗапасами.СчетУчетаРавен106(ЭтотОбъект) Тогда
		ОбязательноЗаполнитьКЭК = УправлениеМатериальнымиЗапасамиКлиентСервер.ИзменилосьПрименениеДетальногоКЭК340и440(
			ОбъектКопирования.Дата,
			ОбъектКопирования.Организация,
			ДатаНовогоДокумента,
			Организация);
		
		УправлениеМатериальнымиЗапасами.УстановитьНовоеЗначениеКЭКВТабличныхЧастях(ЭтотОбъект, ДатаНовогоДокумента,
			ОбязательноЗаполнитьКЭК);
	КонецЕсли;

	НеПересчитыватьСумму = Ложь;
	
	СтруктураДействий = УправлениеМатериальнымиЗапасами.ДопустимыеДействияОбработкиТабличнойЧасти();
	СтруктураДействий.ОчиститьДопСубконто = УправлениеМатериальнымиЗапасами.ПараметрыПроверкиЗаполненияДопСубконто(ВыдатьВЛичноеПользование, Дата, Организация);
	УправлениеМатериальнымиЗапасами.ОбработатьТабличнуюЧасть(Материалы, СтруктураДействий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

// Поступление на счет106.
// 
// Параметры:
//  ПоступлениеМЗ - ДокументСсылка.ПоступлениеМЗ
// 
// Возвращаемое значение:
//  Булево
Функция ПоступлениеНаСчет106(ПоступлениеМЗ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ПоступлениеМЗ);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Истина
	               |ИЗ
	               |	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЖурналПроводокЕПСБУ
	               |ГДЕ
	               |	ЖурналПроводокЕПСБУ.Регистратор = &Регистратор
	               |	И ЖурналПроводокЕПСБУ.СчетДт В (&Счет106)";
	Запрос.УстановитьПараметр("Счет106"  , БухгалтерскийУчет.СписокСчетов("106.00"));
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

Процедура ЗаполнитьПоПоступлениюМЗ(ПоступлениеМЗ)
	
	ДокументОснование = ПоступлениеМЗ;
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоступлениеМЗ, "Организация, ИФО, Подразделение, ЦМО, СчетУчета, ОтражатьВПрослеживаемости");
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыОснования, "Организация, ИФО, СчетУчета");
	ЦМООтправитель				= РеквизитыОснования.ЦМО;
	ПодразделениеОтправитель	= РеквизитыОснования.Подразделение;
	ОтражатьВПрослеживаемости = РеквизитыОснования.ОтражатьВПрослеживаемости;
	
	Если ЗначениеЗаполнено(Дата) Тогда 
		ДатаСчета = Дата;
	Иначе
		ДатаСчета = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	Счет106 = БухгалтерскийУчет.СчетПоКоду("106.00", ДатаСчета, Организация);
	ЗаменитьСчет105На106 = Ложь;
	Если РеквизитыОснования.СчетУчета <> Счет106 Тогда
		Если ПоступлениеНаСчет106(ПоступлениеМЗ) Тогда
			СчетУчета = Счет106;
			ЗаменитьСчет105На106 = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ПоступлениеМЗ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеМЗМатериалы.Номенклатура,
	|	ПоступлениеМЗМатериалы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ПоступлениеМЗМатериалы.Количество,
	|	ПоступлениеМЗМатериалы.Количество КАК КоличествоЗатребовано,
	|	ПоступлениеМЗМатериалы.СчетУчета,
	|	ПоступлениеМЗМатериалы.ДополнительнаяАналитикаСчета,
	|	ПоступлениеМЗМатериалы.КПС,
	|	ПоступлениеМЗМатериалы.КФО,
	|	ПоступлениеМЗМатериалы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ПоступлениеМЗМатериалы.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|ГДЕ
	|	ПоступлениеМЗМатериалы.Ссылка = &Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеМЗМатериалы.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеМЗДрагоценныеМатериалы.ОбъектНФА,
	|	ПоступлениеМЗДрагоценныеМатериалы.ВидДрагМатериала,
	|	ПоступлениеМЗДрагоценныеМатериалы.МассаДМ,
	|	ПоступлениеМЗДрагоценныеМатериалы.ЛигатурнаяМасса,
	|	ПоступлениеМЗДрагоценныеМатериалы.ЧистаяМасса,
	|	ПоступлениеМЗДрагоценныеМатериалы.ЕдИзм,
	|	ПоступлениеМЗДрагоценныеМатериалы.КоличествоДМ,
	|	ПоступлениеМЗДрагоценныеМатериалы.ИсточникОбразования
	|ИЗ
	|	Документ.ПоступлениеМЗ.ДрагоценныеМатериалы КАК ПоступлениеМЗДрагоценныеМатериалы
	|ГДЕ
	|	ПоступлениеМЗДрагоценныеМатериалы.Ссылка = &Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеМЗДрагоценныеМатериалы.НомерСтроки";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();

	Если ЗначениеЗаполнено(Дата) Тогда
		ДатаЗаполнения = Дата;
	Иначе
		ДатаЗаполнения = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;

	Материалы.Очистить();
	ИспользуемыеКФО = Новый Соответствие;
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если ЗаменитьСчет105На106 Тогда
			СчетУчетаМЗ = УправлениеМатериальнымиЗапасами.СчетВложенийПоСчетуМатериала(Выборка.СчетУчета,
																					 Организация,
																					 ДатаЗаполнения);
			Если ЗначениеЗаполнено(СчетУчетаМЗ) Тогда
				НоваяСтрока.СчетУчета = СчетУчетаМЗ;
			КонецЕсли;
		КонецЕсли;
		
		
		НоваяСтрока.КЭК = БухгалтерскийУчет.КЭКНоменклатуры(Организация,
															ИФО,
															Выборка.КФО,
															ДатаЗаполнения,
															НоваяСтрока.СчетУчета,
															Выборка.ТипНоменклатуры,
															"Кт");
						   
		ИспользуемыеКФО.Вставить(Выборка.КФО);
	КонецЦикла;				   

	Если ИспользуемыеКФО.Количество() = 1 Тогда
		Для Каждого ИспользуемыйКФО Из ИспользуемыеКФО Цикл
			КФО = ИспользуемыйКФО.Ключ;
			Прервать;
		КонецЦикла;
	Иначе
		КФОВТабличнойЧасти = Истина;
	КонецЕсли;
	
	ДрагоценныеМатериалы.Очистить();
	ВыборкаДМ = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаДМ.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДрагоценныеМатериалы.Добавить(), ВыборкаДМ)
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПоРешениюОПрекращенииПризнанияАктивомМЗ(РешениеОПрекращенииПризнанияАктивомМЗ)
	
	ДокументОснование = РешениеОПрекращенииПризнанияАктивомМЗ;
	ЕстьРешениеОПрекращенииПризнанияАктивом = Истина;
	ТребуетсяУтилизация = Истина;
	ПервичныйДокумент = ПервичныеДокументыБГУ.НайтиПоИдентификатору("АктОСписанииМЗ0510460_157н");
	Резервировать = Ложь;
	
	ДанныеРешения = Документы.АктСписанияМЗ.ДанныеПоРешениюОПрекращенииПризнания(ДокументОснование, Ссылка);
	
	Если ЗначениеЗаполнено(ДанныеРешения.ДанныеШапки.Организация) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеРешения.ДанныеШапки);
		СчетУчета = БухгалтерскийУчет.СчетПоКоду("105.00", ДанныеРешения.ДанныеШапки.ДатаОснования, Организация);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СчетУчета) Тогда
		Если ЗначениеЗаполнено(Дата) Тогда
			ДатаЗаполнения = Дата;
		Иначе
			ДатаЗаполнения = ОбщегоНазначения.ТекущаяДатаПользователя();
		КонецЕсли;
		СчетУчета = БухгалтерскийУчет.СчетПоКоду("105.00", ДатаЗаполнения, Организация);
	КонецЕсли;
	
	Материалы.Очистить();
	ИспользуемыеКФО = Новый Соответствие;
	Для Каждого СтрокаОстатка Из ДанныеРешения.ОстаткиМатериалов Цикл
		НоваяСтрока = Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатка);
		ИспользуемыеКФО.Вставить(СтрокаОстатка.КФО);
	КонецЦикла;				   

	Если ИспользуемыеКФО.Количество() > 1 Тогда
		КФО = Перечисления.КВД.ПустаяСсылка();
	Иначе
		Для Каждого ИспользуемыйКФО Из ИспользуемыеКФО Цикл
			КФО = ИспользуемыйКФО.Ключ;
		КонецЦикла;
	КонецЕсли;
	КФОВТабличнойЧасти = Не ЗначениеЗаполнено(КФО);
	
КонецПроцедуры

Процедура ЗаполнитьПоСписаниюОС(СписаниеТранспорта)
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СписаниеТранспорта,
		"Дата, Организация, ИФО, ЦМО, Подразделение");
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыОснования, "Дата, Организация, ИФО");
	
	ЦМООтправитель				= РеквизитыОснования.ЦМО;
	ПодразделениеОтправитель	= РеквизитыОснования.Подразделение;
	СчетУчета					= БухгалтерскийУчет.СчетПоКоду("09", Дата);
	ДокументОснование			= СписаниеТранспорта.Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"			, Новый Граница(РеквизитыОснования.Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация"		, РеквизитыОснования.Организация);
	Запрос.УстановитьПараметр("ИФО"				, РеквизитыОснования.ИФО);
	Запрос.УстановитьПараметр("СписокСчетов"	, БухгалтерскийУчет.СписокСчетов("09"));
	Запрос.УстановитьПараметр("Ссылка"			, СписаниеТранспорта);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеТранспорта.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ СписокОС
	|ИЗ
	|	Документ.СписаниеТранспорта КАК СписаниеТранспорта
	|ГДЕ
	|	СписаниеТранспорта.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеТранспортаИК.ОсновноеСредство
	|ИЗ
	|	Документ.СписаниеТранспортаИК КАК СписаниеТранспортаИК
	|ГДЕ
	|	СписаниеТранспортаИК.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство
	|ИЗ
	|	Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ПередачаОбъектовОСОсновныеСредства
	|ГДЕ
	|	ПередачаОбъектовОСОсновныеСредства.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаОбъектовИКОсновныеСредства.ОсновноеСредство
	|ИЗ
	|	Документ.ПередачаОбъектовИК.ОсновныеСредства КАК ПередачаОбъектовИКОсновныеСредства
	|ГДЕ
	|	ПередачаОбъектовИКОсновныеСредства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУОстатки.Организация КАК Организация,
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК СчетУчета,
	|	ЖурналПроводокЕПСБУОстатки.Субконто2 КАК Номенклатура,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто2 КАК Справочник.Номенклатура).ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС,
	|	ЖурналПроводокЕПСБУОстатки.КЭК КАК КЭК,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт КАК Количество,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ДополнительнаяАналитикаСчета,
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт КАК КоличествоНорма
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СписокСчетов),
	|			,
	|			Организация = &Организация
	|				И ИФО В (&ИФО)
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						СписокОС.ОсновноеСредство КАК ОсновноеСредство
	|					ИЗ
	|						СписокОС КАК СписокОС)) КАК ЖурналПроводокЕПСБУОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДополнительнаяАналитикаСчета,
	|	Номенклатура";
	
	
	ТабЗапчастей = Запрос.Выполнить().Выгрузить();
	МассивКФО = ТабЗапчастей.ВыгрузитьКолонку("КФО");
	Если МассивКФО.Количество() = 1 Тогда
		КФО = МассивКФО[0];
		КФОВТабличнойЧасти = Ложь;
	Иначе	
		КФОВТабличнойЧасти = Истина;
	КонецЕсли;	
	
	Материалы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьПоТребованиюНакладной(ТребованиеНакладная)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТребованиеНакладная0315006.Ссылка,
	|	ТребованиеНакладная0315006.Организация,
	|	ТребованиеНакладная0315006.ИФО,
	|	ТребованиеНакладная0315006.ЦМОПолучатель КАК ЦМООтправитель,
	|	ТребованиеНакладная0315006.ПодразделениеПолучатель КАК ПодразделениеОтправитель,
	|	ТребованиеНакладная0315006.СчетУчета,
	|	ТребованиеНакладная0315006.АналитикаОперацииСДрагМатериалами,
	|	ТребованиеНакладная0315006.НоменклатураЛома
	|ИЗ
	|	Документ.ТребованиеНакладная0315006 КАК ТребованиеНакладная0315006
	|ГДЕ
	|	ТребованиеНакладная0315006.Ссылка = &ТребованиеНакладная
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТребованиеНакладная0315006Материалы.Номенклатура,
	|	ТребованиеНакладная0315006Материалы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТребованиеНакладная0315006Материалы.КоличествоЗатребовано КАК КоличествоНорма,
	|	ТребованиеНакладная0315006Материалы.Количество,
	|	ТребованиеНакладная0315006Материалы.ДополнительнаяАналитикаСчета,
	|	ТребованиеНакладная0315006Материалы.СчетУчета,
	|	ТребованиеНакладная0315006Материалы.КФО,
	|	ТребованиеНакладная0315006Материалы.КПС,
	|	ТребованиеНакладная0315006Материалы.КоличествоВсегоДМ
	|ИЗ
	|	Документ.ТребованиеНакладная0315006.Материалы КАК ТребованиеНакладная0315006Материалы
	|ГДЕ
	|	ТребованиеНакладная0315006Материалы.Ссылка = &ТребованиеНакладная
	|УПОРЯДОЧИТЬ ПО
	|	ТребованиеНакладная0315006Материалы.НомерСтроки
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТребованиеНакладная0315006ДрагоценныеМатериалы.ОбъектНФА,
	|	ТребованиеНакладная0315006ДрагоценныеМатериалы.ВидДрагМатериала,
	|	ТребованиеНакладная0315006ДрагоценныеМатериалы.МассаДМ,
	|	ТребованиеНакладная0315006ДрагоценныеМатериалы.ЛигатурнаяМасса,
	|	ТребованиеНакладная0315006ДрагоценныеМатериалы.ЧистаяМасса,
	|	ТребованиеНакладная0315006ДрагоценныеМатериалы.ЕдИзм,
	|	ТребованиеНакладная0315006ДрагоценныеМатериалы.КоличествоДМ,
	|	ТребованиеНакладная0315006ДрагоценныеМатериалы.ИсточникОбразования
	|ИЗ
	|	Документ.ТребованиеНакладная0315006.ДрагоценныеМатериалы КАК ТребованиеНакладная0315006ДрагоценныеМатериалы
	|ГДЕ
	|	ТребованиеНакладная0315006ДрагоценныеМатериалы.Ссылка = &ТребованиеНакладная
	|УПОРЯДОЧИТЬ ПО
	|	ТребованиеНакладная0315006ДрагоценныеМатериалы.НомерСтроки";
	Запрос.УстановитьПараметр("ТребованиеНакладная", ТребованиеНакладная);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаДокумента = РезультатЗапроса[0].Выбрать();
	Если ТаблицаДокумента.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТаблицаДокумента);
	КонецЕсли;
	ДокументОснование = ТребованиеНакладная;
	
	Если ЗначениеЗаполнено(Дата) Тогда
		ДатаОпределенияКЭК = Дата;
	Иначе
		ДатаОпределенияКЭК = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	
	ИспользуемыеКФО = Новый Соответствие;
	Материалы.Очистить();
	ВыборкаМатериалы = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаМатериалы.Следующий() Цикл
		НоваяСтрока = Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаМатериалы);
		НоваяСтрока.КЭК = БухгалтерскийУчет.КЭКНоменклатуры(Организация, ИФО, ВыборкаМатериалы.КФО, ДатаОпределенияКЭК,
			НоваяСтрока.СчетУчета, ВыборкаМатериалы.ТипНоменклатуры, "Кт");
		ИспользуемыеКФО.Вставить(ВыборкаМатериалы.КФО);
	КонецЦикла;
	
	Если ИспользуемыеКФО.Количество() = 1 Тогда
		Для Каждого ИспользуемыйКФО Из ИспользуемыеКФО Цикл
			КФО = ИспользуемыйКФО.Ключ;
			Прервать;
		КонецЦикла;
	Иначе
		КФОВТабличнойЧасти = Истина;
	КонецЕсли;

	ДрагоценныеМатериалы.Очистить();
	ВыборкаДМ = РезультатЗапроса[2].Выбрать();
	Пока ВыборкаДМ.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДрагоценныеМатериалы.Добавить(), ВыборкаДМ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоТаксировкеДокументовУчетаГСМ(РеквизитыАкта, ВидМашины)
	ДокументОснование = РеквизитыАкта.Основание; 
	Если ВидМашины = "Агрегаты" Тогда
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование,
			"Дата, ПервичныйДокумент, Комиссия, РабочийЛистАгрегата, НомерРабочегоЛистаАгрегата, ДатаРабочегоЛистаАгрегата, ВидПервичногоДокумента, НомерПервичногоДокумента, ДатаПервичногоДокумента");
	Иначе	
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование,
			"Дата, ПервичныйДокумент, Комиссия, СерияПутевогоЛиста, НомерПутевогоЛиста, ДатаПутевогоЛиста, ВидПервичногоДокумента, НомерПервичногоДокумента, ДатаПервичногоДокумента");
	КонецЕсли;
	Организация 				= РеквизитыАкта.Организация;
	Комиссия					= РеквизитыОснования.Комиссия;
	Дата 						= РеквизитыОснования.Дата;
	ИФО 						= РеквизитыАкта.ИФО;
	КФОВТабличнойЧасти			= Истина;
	ЦМООтправитель				= РеквизитыАкта.ЦМООтправитель;
	ПодразделениеОтправитель	= РеквизитыАкта.ПодразделениеОтправитель;
	ПервичныйДокумент 	        = РеквизитыОснования.ПервичныйДокумент;
	
	Если ЗначениеЗаполнено(РеквизитыОснования.ВидПервичногоДокумента) Тогда
		ВидОснованияСписания = РеквизитыОснования.ВидПервичногоДокумента;
		ДатаОснованияСписания = РеквизитыОснования.ДатаПервичногоДокумента;
		НомерОснованияСписания = РеквизитыОснования.НомерПервичногоДокумента;
	Иначе
		Если ВидМашины = "Агрегаты" Тогда
			Если ТипЗнч(РеквизитыОснования.РабочийЛистАгрегата) = Тип("ДокументСсылка.УчетныйЛистТрактористаМашиниста") Тогда
				ВидОснованияСписания = НСтр("ru = 'Учетный лист тракториста-машиниста'");
			Иначе
				ВидОснованияСписания = НСтр("ru = 'Рабочий лист агрегата'");
			КонецЕсли;	
			ДатаОснованияСписания = РеквизитыОснования.ДатаРабочегоЛистаАгрегата;
			НомерОснованияСписания = РеквизитыОснования.НомерРабочегоЛистаАгрегата;
		Иначе
			ВидОснованияСписания = НСтр("ru = 'Путевой лист'");
			ДатаОснованияСписания = РеквизитыОснования.ДатаПутевогоЛиста;
			НомерОснованияСписания = СокрЛП(СтрШаблон("%1 %2", РеквизитыОснования.СерияПутевогоЛиста, РеквизитыОснования.НомерПутевогоЛиста));
		КонецЕсли;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаксировкаМатериалы.Номенклатура КАК Номенклатура,
	               |	ТаксировкаМатериалы.СчетУчета КАК СчетУчета,
	               |	ТаксировкаМатериалы.КФО КАК КФО,
	               |	ТаксировкаМатериалы.КПС КАК КПС,
	               |	ТаксировкаМатериалы.ДополнительнаяАналитикаСчета КАК ДополнительнаяАналитикаСчета,
	               |	ТаксировкаМатериалы.Количество КАК Количество,
	               |	ТаксировкаМатериалы.ПричинаСписания КАК ПричинаСписания,
	               |	ТаксировкаМатериалы.ПричинаСписанияСсылка КАК ПричинаСписанияСсылка,
	               |	ТаксировкаМатериалы.КоличествоНорма КАК КоличествоНорма,
	               |	&КЭК КАК КЭК
	               |ИЗ
	               |	Документ.ТаксировкаПутевогоЛиста.Материалы КАК ТаксировкаМатериалы
	               |ГДЕ
	               |	ТаксировкаМатериалы.Ссылка = &Таксировка
	               |	И ТаксировкаМатериалы.ИФО = &ИФО
	               |	И ТаксировкаМатериалы.ЦМО = &ЦМО
	               |	И ТаксировкаМатериалы.Подразделение = &Подразделение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаксировкаПутевогоЛистаСоставКомиссии.НомерСтроки КАК НомерСтроки,
	               |	ТаксировкаПутевогоЛистаСоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	               |	ТаксировкаПутевогоЛистаСоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	               |	ТаксировкаПутевогоЛистаСоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	               |	ТаксировкаПутевогоЛистаСоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии,
	               |	ТаксировкаПутевогоЛистаСоставКомиссии.Сотрудник КАК Сотрудник,
	               |	ТаксировкаПутевогоЛистаСоставКомиссии.Отсутствует КАК Отсутствует,
	               |	ТаксировкаПутевогоЛистаСоставКомиссии.ПричинаОтсутствия КАК ПричинаОтсутствия
	               |ИЗ
	               |	Документ.ТаксировкаПутевогоЛиста.СоставКомиссии КАК ТаксировкаПутевогоЛистаСоставКомиссии
	               |ГДЕ
	               |	ТаксировкаПутевогоЛистаСоставКомиссии.Ссылка = &Таксировка";
	Если ВидМашины = "Агрегаты" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаксировкаПутевогоЛиста", "ТаксировкаРабочегоЛистаАгрегата");
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Таксировка", ДокументОснование);
	Запрос.УстановитьПараметр("ИФО", ИФО);
	Запрос.УстановитьПараметр("ЦМО", ЦМООтправитель);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеОтправитель);
	
	КЭКДляГСМ = БухгалтерскийУчет.КЭКНоменклатуры(,,,ТекущаяДатаСеанса(),,Перечисления.ТипыНоменклатуры.ГСМ,);
	
	Запрос.УстановитьПараметр("КЭК", КЭКДляГСМ);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	НоменклатураАкта = РезультатЗапроса[0].Выгрузить();
	КомиссияАкта = РезультатЗапроса[1].Выгрузить();

	Материалы.Загрузить(НоменклатураАкта);
	СоставКомиссии.Загрузить(КомиссияАкта);
	
	Для Каждого ТекСтрока Из Материалы Цикл
		ТекСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЦикла;	
КонецПроцедуры	

Функция ЭтоЗаполнениеНаОснованииИнвентаризации0510466(ДанныеЗаполнения)
	Возврат ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ИнвентаризационнаяОписьНФА")
		И ДанныеЗаполнения.Свойство("Разделитель");
КонецФункции

// Заполнить по инвентаризации 0510466.
// 
// Параметры:
//  ДанныеЗаполнения - Структура:
//   * Разделитель - Структура
//   * ДокументОснование - ДокументСсылка.ИнвентаризационнаяОписьНФА
Процедура ЗаполнитьПоИнвентаризации0510466(ДанныеЗаполнения)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.Разделитель);
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	КФОВТабличнойЧасти = Истина;
	ПервичныйДокумент = ПервичныеДокументыБГУ.НайтиПоИдентификатору("АктОСписанииМЗ0510460_157н");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация"));
	Документы.АктСписанияМЗ.ЗаполнитьПоИнвентаризации0510466(
		ДанныеЗаполнения.ДокументОснование,
		ЭтотОбъект)
КонецПроцедуры

#КонецОбласти

Процедура ПроверитьЗаполнениеРешенияОПрекращенииПризнанияАктивом(Отказ, НепроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	НепроверяемыеРеквизиты.Добавить("ДокументОснование");
	ДатаРешения = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Дата"));
	Если ДатаРешения > Дата Тогда
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, "Корректность",
			НСтр("ru = 'Решение о прекращении признания активом'"), , ,
			СтрШаблон(НСтр("ru = 'Дата Решения о прекращении признания активом (%1) больше даты Акт о списании'"),
				Формат(ДатаРешения, "ДЛФ=D")));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, "ДокументОснование", "Объект", Отказ);
	КонецЕсли;
	Если Не Документы.АктСписанияМЗ.ПроверитьОстаткиМЗПоРешениюОПрекращенииПризнания(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполненияСодержанияДрагМатериалов(Отказ)
	
	ДрагМатериалы = ДрагоценныеМатериалы.Выгрузить(,"НомерСтроки, ОбъектНФА");
	ОбъектыДМ = ДрагоценныеМатериалы.Выгрузить(,"ОбъектНФА");
	ОбъектыДМ.Свернуть("ОбъектНФА");
	
	ТаблицаВсехОбъектов = Материалы.Выгрузить(,"СчетУчета, Номенклатура");
	
	ТаблицаОбъектовНФА = Новый ТаблицаЗначений;
	ТаблицаОбъектовНФА.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	МассивСчетовМЗ = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляМЗ();
	
	Для Каждого ТекСтрока Из ТаблицаВсехОбъектов Цикл
		Если МассивСчетовМЗ.Найти(ТекСтрока.СчетУчета)<>Неопределено Тогда
			НоваяСтрока = ТаблицаОбъектовНФА.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого ТекСтрока Из ОбъектыДМ Цикл
		ОбъектНФА = ТекСтрока.ОбъектНФА;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", ОбъектНФА);
		НайденныеСтроки = ТаблицаОбъектовНФА.НайтиСтроки(ПараметрыОтбора);   

		Если НайденныеСтроки.Количество() = 0 Тогда
			ПараметрыОтбораОбъекта = Новый Структура;
			ПараметрыОтбораОбъекта.Вставить("ОбъектНФА", ОбъектНФА);
			СтрокиСпискаДМ = ДрагМатериалы.НайтиСтроки(ПараметрыОтбораОбъекта);
			Если СтрокиСпискаДМ.Количество()=1 Тогда
				ТекстСтрокиДМ = "В строке ";
			Иначе
				ТекстСтрокиДМ = "В строках ";
			КонецЕсли;
			Для каждого ТекСтрокаДМ Из СтрокиСпискаДМ Цикл
				ТекстСтрокиДМ = ТекстСтрокиДМ + Формат(ТекСтрокаДМ.НомерСтроки, "ЧЦ=10") + ", ";
			КонецЦикла;	
			
			ТекстОшибки = НСтр("ru='%1 списка ""Содержание драг. материалов"" указана информация по номенклатуре, которой нет в списке ""Материальные запасы"": %2'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстОшибки, 
				Сред(ТекстСтрокиДМ, 1, СтрДлина(ТекстСтрокиДМ) - 2),
				ОбъектНФА);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект", Отказ);
			
		КонецЕсли;	
	КонецЦикла;
	
	ОбъектыДМ = ДрагоценныеМатериалы.Выгрузить();
	Для каждого ТекСтрока Из ОбъектыДМ Цикл
		//контроль лом/не лом
		Если НЕ ЗначениеЗаполнено(НоменклатураЛома) Тогда
			Если (ТекСтрока.МассаДМ > 0)И(ТекСтрока.ЛигатурнаяМасса > 0 ИЛИ ТекСтрока.ЧистаяМасса>0) Тогда
				ТекстОшибки = НСтр("ru='В строке %2 списка ""Содержание драг. материалов"" следует указать массу в реквизите ""Масса драг. материалов"" или в реквизитах ""Лигатурная масса лома"" и ""Чистая масса в ломе"": ""%1""'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
																					  ТекСтрока.ОбъектНФА,
																					  ТекСтрока.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект", Отказ);
			КонецЕсли;	
		КонецЕсли;	
		
		//заполнение количества драг. камней
		Если ТекСтрока.ВидДрагМатериала.ТипДрагМатериала <> Перечисления.ТипыДрагМатериалов.ДрагоценныеКамни
			И ТекСтрока.КоличествоДМ > 0 Тогда
			ТекстОшибки = НСтр("ru='В строке %2 списка ""Содержание драг. материалов"" значение реквизита ""Количество (шт)"" указывается только для драгоценных камней: ""%1""'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
																				  ТекСтрока.ОбъектНФА,
																				  ТекСтрока.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект", Отказ);
		КонецЕсли;	
	КонецЦикла;
	
	//контроль содержания учетных драг. материалов в списываемых НФА
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	&Организация КАК Организация,
	               |	ДрагМатериалыДокумента.ОбъектНФА,
	               |	ДрагМатериалыДокумента.МассаДМ,
	               |	ДрагМатериалыДокумента.ЛигатурнаяМасса,
	               |	ДрагМатериалыДокумента.ЧистаяМасса,
	               |	ДрагМатериалыДокумента.КоличествоДМ
	               |ПОМЕСТИТЬ ДрагМатериалыДокумента
	               |ИЗ
	               |	&ДрагМатериалыДокумента КАК ДрагМатериалыДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Организация КАК Организация,
	               |	ОбъектыДокумента.Номенклатура
	               |ПОМЕСТИТЬ ОбъектыДокумента
	               |ИЗ
	               |	&ОбъектыДокумента КАК ОбъектыДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОбъектыНФАДокумента.Организация,
	               |	ОбъектыНФАДокумента.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ДрагМатериалыДокумента.МассаДМ, 0) = 0
	               |				И ЕСТЬNULL(ДрагМатериалыДокумента.ЛигатурнаяМасса, 0) = 0
	               |				И ЕСТЬNULL(ДрагМатериалыДокумента.ЧистаяМасса, 0) = 0
	               |				И ЕСТЬNULL(ДрагМатериалыДокумента.КоличествоДМ, 0) = 0
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьДрагМатериалы
	               |ПОМЕСТИТЬ ОбъектыНФАДокумента
	               |ИЗ
	               |	ОбъектыДокумента КАК ОбъектыНФАДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДрагМатериалыДокумента КАК ДрагМатериалыДокумента
	               |		ПО ОбъектыНФАДокумента.Организация = ДрагМатериалыДокумента.Организация
	               |			И ОбъектыНФАДокумента.Номенклатура = ДрагМатериалыДокумента.ОбъектНФА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА КАК ОбъектНФА,
	               |	0 КАК ЧистаяМассаОстаток,
	               |	0 КАК ЛигатурнаяМассаОстаток,
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток КАК МассаДМОстаток,
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.КоличествоДМОстаток КАК КоличествоДМОстаток,
	               |	ОбъектыНФАДокумента.ЕстьДрагМатериалы КАК ЕстьДрагМатериалы
	               |ИЗ
	               |	ОбъектыНФАДокумента КАК ОбъектыНФАДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВОбъектахНФА.Остатки(&ДатаСведений, Организация = &Организация) КАК НаличиеДрагМатериаловВОбъектахНФАОстатки
	               |		ПО (НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА = ОбъектыНФАДокумента.Номенклатура)
	               |			И (НаличиеДрагМатериаловВОбъектахНФАОстатки.Организация = ОбъектыНФАДокумента.Организация)
	               |ГДЕ
	               |	ЕСТЬNULL(НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА, 0) <> 0
	               |	И ОбъектыНФАДокумента.ЕстьДрагМатериалы = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НаличиеДрагМатериаловВЛомеИОтходахОстатки.ОбъектНФА,
	               |	НаличиеДрагМатериаловВЛомеИОтходахОстатки.ЧистаяМассаОстаток,
	               |	НаличиеДрагМатериаловВЛомеИОтходахОстатки.ЛигатурнаяМассаОстаток,
	               |	0,
	               |	0,
	               |	ОбъектыНФАДокумента.ЕстьДрагМатериалы
	               |ИЗ
	               |	ОбъектыНФАДокумента КАК ОбъектыНФАДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВЛомеИОтходах.Остатки(&ДатаСведений, Организация = &Организация) КАК НаличиеДрагМатериаловВЛомеИОтходахОстатки
	               |		ПО (НаличиеДрагМатериаловВЛомеИОтходахОстатки.ОбъектНФА = ОбъектыНФАДокумента.Номенклатура)
	               |			И (НаличиеДрагМатериаловВЛомеИОтходахОстатки.Организация = ОбъектыНФАДокумента.Организация)
	               |ГДЕ
	               |	ЕСТЬNULL(НаличиеДрагМатериаловВЛомеИОтходахОстатки.ОбъектНФА, 0) <> 0
	               |	И ОбъектыНФАДокумента.ЕстьДрагМатериалы = ЛОЖЬ";
				   
	ТаблицаОбъектовНФА = Материалы.Выгрузить(,"Номенклатура");
	
	Запрос.УстановитьПараметр("ДрагМатериалыДокумента", ОбъектыДМ);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОбъектыДокумента", ТаблицаОбъектовНФА);
	Запрос.УстановитьПараметр("ДатаСведений", Новый Граница(Дата, ВидГраницы.Включая));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстОшибки = НСтр("ru='Для объекта ""%1"" из списка ""Материальные запасы"" в учете присутствуют остатки драгоценных материалов. Следует заполнить данные списка ""Содержание драг. материалов"" на закладке ""Драгоценные материалы"" и провести документ.'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Выборка.ОбъектНФА);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект");
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли