#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокКодовТНВЭД345.ЗагрузитьЗначения(Обработки.ПомощникИсключенияНФАИзПрослеживаемости.ПолучитьСписокКодовТНВЭД345().ВыгрузитьКолонку("Код"));
	СтранаИсключения345 = Справочники.СтраныМира.НайтиПоКоду("112"); // Беларусь
	
	УстановитьВидимостьДанныхНФА(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	НеОтображатьПодсказку = Элементы.ГруппаПодсказки.Скрыта();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НеОтображатьПодсказку Тогда
		Элементы.ГруппаПодсказки.Скрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказатьОстаткиПриИзменении(Элемент)
	
	Если ПоказатьОстатки Тогда
		ТекущиеДанные = Элементы.ПрослеживаемыеНФА.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			ПоказатьОстатки = 0;
		Иначе
			Элементы.ПрослеживаемыеНФАОстатки.ОтборСтрок = 
				Новый ФиксированнаяСтруктура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДанныхНФА(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Заполнить(Команда)
	
	Если Объект.ПрослеживаемыеНФА.Количество() Тогда
		Если Ждать СогласиеПользователяНаОчисткуТаблиц() = Ложь Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
	ПоказатьОстатки = 0;
	УстановитьВидимостьДанныхНФА(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИсключение(Команда)
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал = 1;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
	ВыполнитьФоновоеЗаданиеИсключенияСервер(),
	Новый ОписаниеОповещения("ОбработатьРезультатыИсключения", ЭтотОбъект),
	ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрослеживаемыеНФА

&НаКлиенте
Процедура ПрослеживаемыеНФАКОбработкеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПрослеживаемыеНФА.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.МожноИсключить И ТекущиеДанные.КОбработке Тогда
		ТекущиеДанные.КОбработке = Ложь;
		Возврат;
	КонецЕсли;
	
	ИзменениеОтметкиОбработкиСервер(ТекущиеДанные.ИдентификаторСтроки, ТекущиеДанные.КОбработке);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДанныхНФА(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ПоказатьОстатки Тогда
		Элементы.ДанныеНФА.ТекущаяСтраница = Элементы.ОстаткиНФА;
	Иначе
		Элементы.ДанныеНФА.ТекущаяСтраница = Элементы.ГруппировкаНФА;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.КодТНВЭД КАК КодТНВЭД,
	|	Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Номенклатура.Ссылка) КАК ИдентификаторСтроки,
	|	Номенклатура.ПрослеживаемыйТовар КАК Прослеживаемый,
	|	ИСТИНА КАК МожноИсключить
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.КодТНВЭД.Код В(&КодыТНВЭД)
	|	И Номенклатура.ПрослеживаемыйТовар
	|	И Номенклатура.СтранаПроисхождения = &СтранаПроисхожденияИсключения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрослеживаемыеТоварыОстатки.Организация КАК Организация,
	|	ПрослеживаемыеТоварыОстатки.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТоварыОстатки.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПрослеживаемыеТоварыОстатки.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТоварыОстатки.ВариантКомплекта КАК ВариантКомплекта,
	|	ПрослеживаемыеТоварыОстатки.Комплектующее КАК Комплектующее,
	|	ПрослеживаемыеТоварыОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ПрослеживаемыеТоварыОстатки.КоличествоПрослеживаемостиОстаток КАК КоличествоПрослеживаемостиОстаток,
	|	ПрослеживаемыеТоварыОстатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
	|	ВЫБОР
	|		КОГДА ПрослеживаемыеТоварыОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПрослеживаемыеТоварыОстатки.Номенклатура)
	|		ИНАЧЕ УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПрослеживаемыеТоварыОстатки.Комплектующее)
	|	КОНЕЦ КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ПрослеживаемыеТоварыОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ПрослеживаемыеТоварыОстатки.Номенклатура.КодТНВЭД
	|		ИНАЧЕ ПрослеживаемыеТоварыОстатки.Комплектующее.КодТНВЭД
	|	КОНЕЦ КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ПрослеживаемыеТоварыОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ПрослеживаемыеТоварыОстатки.Номенклатура.СтранаПроисхождения
	|		ИНАЧЕ ПрослеживаемыеТоварыОстатки.Комплектующее.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхожденияГруппа,
	|	ВЫБОР
	|		КОГДА ПрослеживаемыеТоварыОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ПрослеживаемыеТоварыОстатки.Номенклатура
	|		ИНАЧЕ ПрослеживаемыеТоварыОстатки.Комплектующее
	|	КОНЕЦ КАК НоменклатураГруппа,
	|	ВЫБОР
	|		КОГДА ПрослеживаемыеТоварыОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ПрослеживаемыеТоварыОстатки.Номенклатура.ПрослеживаемыйТовар
	|		ИНАЧЕ ПрослеживаемыеТоварыОстатки.Комплектующее.ПрослеживаемыйТовар
	|	КОНЕЦ КАК Прослеживаемый,
	|	ВЫБОР
	|		КОГДА ПрослеживаемыеТоварыОстатки.СтранаПроисхождения <> &СтранаПроисхожденияИсключения
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК МожноИсключить
	|ПОМЕСТИТЬ ВТ_ОстаткиНоменклатура
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары.Остатки КАК ПрослеживаемыеТоварыОстатки
	|ГДЕ
	|	(ПрослеживаемыеТоварыОстатки.Номенклатура.КодТНВЭД.Код В (&КодыТНВЭД)
	|			ИЛИ ПрослеживаемыеТоварыОстатки.Комплектующее.КодТНВЭД.Код В (&КодыТНВЭД))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.КодТНВЭД КАК КодТНВЭД,
	|	ОсновныеСредства.СтранаПроисхождения КАК СтранаПроисхождения,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОсновныеСредства.Ссылка) КАК ИдентификаторСтроки,
	|	ОсновныеСредства.ПрослеживаемыйТовар КАК Прослеживаемый,
	|	ИСТИНА КАК МожноИсключить
	|ПОМЕСТИТЬ ВТ_ОсновныеСредства
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.КодТНВЭД.Код В(&КодыТНВЭД)
	|	И ОсновныеСредства.ПрослеживаемыйТовар
	|	И ОсновныеСредства.СтранаПроисхождения = &СтранаПроисхожденияИсключения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрослеживаемыеОСОстатки.Организация КАК Организация,
	|	ПрослеживаемыеОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	ПрослеживаемыеОСОстатки.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПрослеживаемыеОСОстатки.РНПТ КАК РНПТ,
	|	ЗНАЧЕНИЕ(Справочник.ВариантыКомплектовМЗПТ.ПустаяСсылка) КАК ВариантКомплекта,
	|	ПрослеживаемыеОСОстатки.Комплектующее КАК Комплектующее,
	|	ПрослеживаемыеОСОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ПрослеживаемыеОСОстатки.КоличествоПрослеживаемостиОстаток КАК КоличествоПрослеживаемостиОстаток,
	|	ПрослеживаемыеОСОстатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
	|	ВЫБОР
	|		КОГДА ПрослеживаемыеОСОстатки.Комплектующее ССЫЛКА Справочник.ОсновныеСредства
	|					И ПрослеживаемыеОСОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|				ИЛИ ПрослеживаемыеОСОстатки.Комплектующее ССЫЛКА Справочник.Номенклатура
	|					И ПрослеживаемыеОСОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ ПрослеживаемыеОСОстатки.Комплектующее = НЕОПРЕДЕЛЕНО
	|			ТОГДА УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПрослеживаемыеОСОстатки.ОсновноеСредство)
	|		ИНАЧЕ УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПрослеживаемыеОСОстатки.Комплектующее)
	|	КОНЕЦ КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ПрослеживаемыеОСОстатки.Комплектующее ССЫЛКА Справочник.ОсновныеСредства
	|					И ПрослеживаемыеОСОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|				ИЛИ ПрослеживаемыеОСОстатки.Комплектующее ССЫЛКА Справочник.Номенклатура
	|					И ПрослеживаемыеОСОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ ПрослеживаемыеОСОстатки.Комплектующее = НЕОПРЕДЕЛЕНО
	|			ТОГДА ПрослеживаемыеОСОстатки.ОсновноеСредство.КодТНВЭД
	|		ИНАЧЕ ПрослеживаемыеОСОстатки.Комплектующее.КодТНВЭД
	|	КОНЕЦ КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА ПрослеживаемыеОСОстатки.Комплектующее ССЫЛКА Справочник.ОсновныеСредства
	|					И ПрослеживаемыеОСОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|				ИЛИ ПрослеживаемыеОСОстатки.Комплектующее ССЫЛКА Справочник.Номенклатура
	|					И ПрослеживаемыеОСОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ ПрослеживаемыеОСОстатки.Комплектующее = НЕОПРЕДЕЛЕНО
	|			ТОГДА ПрослеживаемыеОСОстатки.ОсновноеСредство.СтранаПроисхождения
	|		ИНАЧЕ ПрослеживаемыеОСОстатки.Комплектующее.СтранаПроисхождения
	|	КОНЕЦ КАК СтранаПроисхожденияГруппа,
	|	ВЫБОР
	|		КОГДА ПрослеживаемыеОСОстатки.Комплектующее ССЫЛКА Справочник.ОсновныеСредства
	|					И ПрослеживаемыеОСОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|				ИЛИ ПрослеживаемыеОСОстатки.Комплектующее ССЫЛКА Справочник.Номенклатура
	|					И ПрослеживаемыеОСОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ ПрослеживаемыеОСОстатки.Комплектующее = НЕОПРЕДЕЛЕНО
	|			ТОГДА ПрослеживаемыеОСОстатки.ОсновноеСредство
	|		ИНАЧЕ ПрослеживаемыеОСОстатки.Комплектующее
	|	КОНЕЦ КАК ОСГруппа,
	|	ВЫБОР
	|		КОГДА ПрослеживаемыеОСОстатки.Комплектующее ССЫЛКА Справочник.ОсновныеСредства
	|					И ПрослеживаемыеОСОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|				ИЛИ ПрослеживаемыеОСОстатки.Комплектующее ССЫЛКА Справочник.Номенклатура
	|					И ПрослеживаемыеОСОстатки.Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ ПрослеживаемыеОСОстатки.Комплектующее = НЕОПРЕДЕЛЕНО
	|			ТОГДА ПрослеживаемыеОСОстатки.ОсновноеСредство.ПрослеживаемыйТовар
	|		ИНАЧЕ ПрослеживаемыеОСОстатки.Комплектующее.ПрослеживаемыйТовар
	|	КОНЕЦ КАК Прослеживаемый,
	|	ВЫБОР
	|		КОГДА ПрослеживаемыеОСОстатки.СтранаПроисхождения <> &СтранаПроисхожденияИсключения
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК МожноИсключить
	|ПОМЕСТИТЬ ВТ_ОстаткиОС
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеОС.Остатки КАК ПрослеживаемыеОСОстатки
	|ГДЕ
	|	(ПрослеживаемыеОСОстатки.ОсновноеСредство.КодТНВЭД.Код В (&КодыТНВЭД)
	|			ИЛИ ПрослеживаемыеОСОстатки.Комплектующее.КодТНВЭД.Код В (&КодыТНВЭД))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.НФА КАК НФА,
	|	ВложенныйЗапрос.КодТНВЭД КАК КодТНВЭД,
	|	ВложенныйЗапрос.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВложенныйЗапрос.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	МАКСИМУМ(ВложенныйЗапрос.Прослеживаемый) КАК Прослеживаемый,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.НФА ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ""Номенклатура""
	|		ИНАЧЕ ""Основное средство""
	|	КОНЕЦ КАК ВидНФА,
	|	МАКСИМУМ(ВложенныйЗапрос.МожноИсключить) КАК МожноИсключить,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ВложенныйЗапрос.СтранаПроисхождения = &СтранаПроисхожденияИсключения
	|				ТОГДА ВложенныйЗапрос.МожноИсключить
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК КОбработке
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_Номенклатура.Ссылка КАК НФА,
	|		ВТ_Номенклатура.КодТНВЭД КАК КодТНВЭД,
	|		ВТ_Номенклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|		ВТ_Номенклатура.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		ВТ_Номенклатура.Прослеживаемый КАК Прослеживаемый,
	|		ВТ_Номенклатура.МожноИсключить КАК МожноИсключить
	|	ИЗ
	|		ВТ_Номенклатура КАК ВТ_Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_ОсновныеСредства.Ссылка,
	|		ВТ_ОсновныеСредства.КодТНВЭД,
	|		ВТ_ОсновныеСредства.СтранаПроисхождения,
	|		ВТ_ОсновныеСредства.ИдентификаторСтроки,
	|		ВТ_ОсновныеСредства.Прослеживаемый,
	|		ВТ_ОсновныеСредства.МожноИсключить
	|	ИЗ
	|		ВТ_ОсновныеСредства КАК ВТ_ОсновныеСредства
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_ОстаткиНоменклатура.НоменклатураГруппа,
	|		ВТ_ОстаткиНоменклатура.КодТНВЭД,
	|		ВТ_ОстаткиНоменклатура.СтранаПроисхожденияГруппа,
	|		ВТ_ОстаткиНоменклатура.ИдентификаторСтроки,
	|		ВТ_ОстаткиНоменклатура.Прослеживаемый,
	|		ВТ_ОстаткиНоменклатура.МожноИсключить
	|	ИЗ
	|		ВТ_ОстаткиНоменклатура КАК ВТ_ОстаткиНоменклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_ОстаткиОС.ОСГруппа,
	|		ВТ_ОстаткиОС.КодТНВЭД,
	|		ВТ_ОстаткиОС.СтранаПроисхожденияГруппа,
	|		ВТ_ОстаткиОС.ИдентификаторСтроки,
	|		ВТ_ОстаткиОС.Прослеживаемый,
	|		ВТ_ОстаткиОС.МожноИсключить
	|	ИЗ
	|		ВТ_ОстаткиОС КАК ВТ_ОстаткиОС) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.НФА,
	|	ВложенныйЗапрос.СтранаПроисхождения,
	|	ВложенныйЗапрос.КодТНВЭД,
	|	ВложенныйЗапрос.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.НФА ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ""Номенклатура""
	|		ИНАЧЕ ""Основное средство""
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВложенныйЗапрос.МожноИсключить) = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.НФА КАК НФА,
	|	ВложенныйЗапрос.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВложенныйЗапрос.ВариантКомплекта КАК ВариантКомплекта,
	|	ВложенныйЗапрос.РНПТ КАК РНПТ,
	|	ВложенныйЗапрос.Комплектующее КАК Комплектующее,
	|	ВложенныйЗапрос.КоличествоОстаток КАК Количество,
	|	ВложенныйЗапрос.КоличествоПрослеживаемостиОстаток КАК КоличествоПрослеживаемости,
	|	ВложенныйЗапрос.СуммаБезНДСОстаток КАК СуммаБезНДС,
	|	ВложенныйЗапрос.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.СтранаПроисхождения <> &СтранаПроисхожденияИсключения
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СписыватьОстаток,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.СтранаПроисхождения <> &СтранаПроисхожденияИсключения
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК КОбработке
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ОстаткиНоменклатура.Организация КАК Организация,
	|		ВТ_ОстаткиНоменклатура.Номенклатура КАК НФА,
	|		ВТ_ОстаткиНоменклатура.СтранаПроисхождения КАК СтранаПроисхождения,
	|		ВТ_ОстаткиНоменклатура.РНПТ КАК РНПТ,
	|		ВТ_ОстаткиНоменклатура.ВариантКомплекта КАК ВариантКомплекта,
	|		ВТ_ОстаткиНоменклатура.Комплектующее КАК Комплектующее,
	|		ВТ_ОстаткиНоменклатура.КоличествоОстаток КАК КоличествоОстаток,
	|		ВТ_ОстаткиНоменклатура.КоличествоПрослеживаемостиОстаток КАК КоличествоПрослеживаемостиОстаток,
	|		ВТ_ОстаткиНоменклатура.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
	|		ВТ_ОстаткиНоменклатура.ИдентификаторСтроки КАК ИдентификаторСтроки
	|	ИЗ
	|		ВТ_ОстаткиНоменклатура КАК ВТ_ОстаткиНоменклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_ОстаткиОС.Организация,
	|		ВТ_ОстаткиОС.ОсновноеСредство,
	|		ВТ_ОстаткиОС.СтранаПроисхождения,
	|		ВТ_ОстаткиОС.РНПТ,
	|		ВТ_ОстаткиОС.ВариантКомплекта,
	|		ВТ_ОстаткиОС.Комплектующее,
	|		ВТ_ОстаткиОС.КоличествоОстаток,
	|		ВТ_ОстаткиОС.КоличествоПрослеживаемостиОстаток,
	|		ВТ_ОстаткиОС.СуммаБезНДСОстаток,
	|		ВТ_ОстаткиОС.ИдентификаторСтроки
	|	ИЗ
	|		ВТ_ОстаткиОС КАК ВТ_ОстаткиОС) КАК ВложенныйЗапрос");
	
	Запрос.УстановитьПараметр("КодыТНВЭД", СписокКодовТНВЭД345);
	Запрос.УстановитьПараметр("СтранаПроисхожденияИсключения", СтранаИсключения345);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Объект.ПрослеживаемыеНФА.Загрузить(РезультатЗапроса[4].Выгрузить());
	Объект.ПрослеживаемыеНФАОстатки.Загрузить(РезультатЗапроса[5].Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеОтметкиОбработкиСервер(ИдентификаторСтроки, Отметка);
	
	СтрокиОстатки = Объект.ПрослеживаемыеНФАОстатки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	
	Для Каждого СтрокаОстатки Из СтрокиОстатки Цикл
		СтрокаОстатки.КОбработке = Отметка И СтрокаОстатки.СписыватьОстаток;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьФоновоеЗаданиеИсключенияСервер();

	ПараметрыМетода = Новый Структура;
	
	КолонкиОтстакиНФА = "Организация,НФА,Комплектующее,СтранаПроисхождения,ВариантКомплекта,
						|РНПТ,Количество,КоличествоПрослеживаемости,СуммаБезНДС";
	ПараметрыМетода.Вставить("ОстаткиНФА", ОбщегоНазначения.ТаблицаЗначенийВМассив(
			Объект.ПрослеживаемыеНФАОстатки.Выгрузить(Новый Структура("КОбработке" ,Истина), КолонкиОтстакиНФА)));
			
	КолонкиНФА = "НФА, ВидНФА, ИдентификаторСтроки";
	ПараметрыМетода.Вставить("НФА", ОбщегоНазначения.ТаблицаЗначенийВМассив(
			Объект.ПрослеживаемыеНФА.Выгрузить(Новый Структура("КОбработке, Прослеживаемый", Истина, Истина), КолонкиНФА)));
			
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Исключение НФА из прослеживаемости";
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("АдресРезультата", ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор));
	
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ИмяОбработки", РеквизитФормыВЗначение("Объект").Метаданные().Имя);
	ПараметрыЗапуска.Вставить("ИмяМетода", "ОбработатьИсключение");
	ПараметрыЗапуска.Вставить("ПараметрыВыполнения", ПараметрыМетода);
	ПараметрыЗапуска.Вставить("ЭтоВнешняяОбработка", Ложь);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
	"ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки",
	ПараметрыЗапуска,
	ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Асинх Функция СогласиеПользователяНаОчисткуТаблиц()
	
	ТекстВопроса = НСтр("ru = 'Даннные по НФА будут очищены'");
	Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатыИсключения(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультатов = Новый ТабличныйДокумент;
	ОбработатьРезультатыИсключенияСервер(Результат, ТаблицаРезультатов);
	
	Если ТаблицаРезультатов.ВысотаТаблицы > 1 Тогда
		КоллекцияПФ = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Макет");
		КоллекцияПФ[0].ТабличныйДокумент = ТаблицаРезультатов;
		ПараметрыПечати = Новый Структура("ЗаголовокФормы, ВладелецФормы", "Обработанные НФА", ЭтотОбъект);
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПФ, ,ПараметрыПечати);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатыИсключенияСервер(Результат, ТаблицаРезультатов)
	
	СтруктураРезультата = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если СтруктураРезультата = Неопределено Тогда
		Если Результат.Статус = "Ошибка" Тогда
			ОбщегоНазначения.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	НеобработанныеНФА = СтруктураРезультата.НеобработанныеНФА;
	ОшибкиСписания = СтруктураРезультата.ОшибкиСписания;
	
	Если ТипЗнч(НеобработанныеНФА) <> Тип("Соответствие")
		ИЛИ ТипЗнч(ОшибкиСписания) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ОшибкиСписания.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ОшибкиСписания);
	Иначе
		МакетТаблицаРезультатов = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ОбработанныеНФА");
		ОбластьШапка = МакетТаблицаРезультатов.ПолучитьОбласть("Шапка");
		ТаблицаРезультатов.АвтоМасштаб = Истина;
		ТаблицаРезультатов.Защита = Истина;

		ТаблицаРезультатов.Вывести(ОбластьШапка);
		
		МаксИндекс = Объект.ПрослеживаемыеНФА.Количество()-1;
		Для Индекс = -МаксИндекс По 0 Цикл
			
			СтрокаНФА = Объект.ПрослеживаемыеНФА[-Индекс];
			
			Если СтрокаНФА.КОбработке Тогда
				Если НеобработанныеНФА.Получить(СтрокаНФА.НФА) = Неопределено Тогда
					
					ОбластьСтрока = МакетТаблицаРезультатов.ПолучитьОбласть("Строка");
					ОбластьСтрока.Параметры.Заполнить(СтрокаНФА);
					ТаблицаРезультатов.Вывести(ОбластьСтрока);
					
					СтрокиОстатков = Объект.ПрослеживаемыеНФАОстатки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаНФА.ИдентификаторСтроки));
					Для Каждого СтрокаОстатки Из СтрокиОстатков Цикл
						СтрокаОстатки.КОбработке = Ложь;
					КонецЦикла;
					
					Объект.ПрослеживаемыеНФА.Удалить(-Индекс);
				Иначе
					Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Изменить НФА %1 не получилось, повторите запуск обработки с правами администратора'"), СтрокаНФА.НФА));
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'При обработке НФА %1 возникла ошибка, см. журнал регистрации'"), СтрокаНФА.НФА));
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПоказатьОстатки = 0;
	УстановитьВидимостьДанныхНФА(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

