
&НаКлиенте
Процедура ОписаниеИзменений(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
	Если ТекущиеДанные <> Неопределено Тогда
	
		ПараметрыФормы = Новый Структура("КлючДанных", ТекущиеДанные);
		ОткрытьФорму("РегистрСведений.УстановленныеКомплектыОтчетности.Форма.ИнформацияОКомплекте",ПараметрыФормы,ЭтаФорма);
		
	Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Необходимо выбрать строку в списке'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыОтбораСпискаОтчетов(Знач КлючЗаписи)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановленныеКомплектыОтчетности.Версия
	|ИЗ
	|	РегистрСведений.УстановленныеКомплектыОтчетности КАК УстановленныеКомплектыОтчетности
	|ГДЕ
	|	УстановленныеКомплектыОтчетности.ИдентификаторКомплекта = &ИдентификаторКомплекта";
	
	Запрос.УстановитьПараметр("ИдентификаторКомплекта",КлючЗаписи.ИдентификаторКомплекта);
	
	СтруктураКлюча = Новый Структура;
	Выборка        = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтруктураКлюча.Вставить("ИдентификаторКомплекта",КлючЗаписи.ИдентификаторКомплекта);
		СтруктураКлюча.Вставить("Версия"                ,Выборка.Версия);
		
	КонецЕсли;
	
	Возврат СтруктураКлюча;

КонецФункции // ПараметрыОтбораСпискаОтчетов()


&НаКлиенте
Процедура ВидыОтчетаТекущейВерсии(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
	Если ТекущиеДанные <> Неопределено Тогда
	
		ПараметрыФормы = Новый Структура("Отбор",ПараметрыОтбораСпискаОтчетов(ТекущиеДанные));
		
		ОткрытьФорму("РегистрСведений.ВерсииУстановленныхОтчетов.ФормаСписка", ПараметрыФормы, ЭтаФорма);
		
	Иначе
		
		ПоказатьПредупреждение(,НСтр("ru = 'Необходимо выбрать строку в списке'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗапись(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИдКомплекта = ТекДанные.ИдентификаторКомплекта;
	
	ТекстВопроса = НСтр("ru='Удалить запись?'");
	ОпОв = Новый ОписаниеОповещения("ПослеОтветаНаВопрос",ЭтотОбъект,ИдКомплекта);
	ПоказатьВопрос(ОпОв,ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, ИдКомплекта)Экспорт
	Если Результат<>КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	УдалитьЗаписьНаСервере(ИдКомплекта);
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьНаСервере(ИдКомплекта)
	Запись = РегистрыСведений.УстановленныеКомплектыОтчетности.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторКомплекта = ИдКомплекта;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры