#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры
//  Ссылка  - ДокументСсылка.РасходныйОрдерФондовый - ссылка на текущий документ
//  ДополнительныеСвойства  - Структура - Структура данных для подсистемы печати
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
		"Организация,ДатаИнвентаризации");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ДатаИнвентаризации"	, НачалоДня(ЗначенияРеквизитов.ДатаИнвентаризации));
	Запрос.УстановитьПараметр("ДатаНачалоГода"		, НачалоГода(ЗначенияРеквизитов.ДатаИнвентаризации));
	
	НомераТаблиц = Новый Структура;   
	НомераТаблиц.Вставить("ДанныеДокумента", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ДолгосрочныеПраваПользованияАктивами", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПраваПользования.Ссылка КАК Ссылка,
	|	ПраваПользования.Ссылка.Организация КАК Организация,
	|	ПраваПользования.Ссылка.ДатаИнвентаризации КАК ДатаИнвентаризации,
	|	ПраваПользования.Ссылка.Дата КАК Дата,
	|	""ПраваПользования"" КАК ИмяСписка,
	|	ПраваПользования.НомерСтроки КАК НомерСтроки,
	|	ПраваПользования.СчетУчета КАК СчетУчета,
	|	ПраваПользования.ИФО КАК ИФО,
	|	ПраваПользования.КФО КАК КФО,
	|	ПраваПользования.КПС КАК КПС,
	|	ПраваПользования.ОсновноеСредство КАК ОсновноеСредство,
	|	ПраваПользования.ОстаточнаяСтоимость КАК ОстаточнаяСтоимость,
	|	ПраваПользования.Долгосрочные КАК Долгосрочные
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.РасчетДолгосрочныхПравПользованияАктивами.ПраваПользования КАК ПраваПользования
	|ГДЕ
	|	ПраваПользования.Ссылка = &Ссылка
	|	И (ПраваПользования.Долгосрочные > 0
	|		ИЛИ &ДатаИнвентаризации = &ДатаНачалоГода)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПраваПользованияНМА.Ссылка,
	|	ПраваПользованияНМА.Ссылка.Организация,
	|	ПраваПользованияНМА.Ссылка.ДатаИнвентаризации,
	|	ПраваПользованияНМА.Ссылка.Дата,
	|	""ПраваПользованияНМА"",
	|	ПраваПользованияНМА.НомерСтроки,
	|	ПраваПользованияНМА.СчетУчета,
	|	ПраваПользованияНМА.ИФО,
	|	ПраваПользованияНМА.КФО,
	|	ПраваПользованияНМА.КПС,
	|	ПраваПользованияНМА.ОсновноеСредство,
	|	ПраваПользованияНМА.ОстаточнаяСтоимость,
	|	ПраваПользованияНМА.Долгосрочные
	|ИЗ
	|	Документ.РасчетДолгосрочныхПравПользованияАктивами.ПраваПользованияНМА КАК ПраваПользованияНМА
	|ГДЕ
	|	ПраваПользованияНМА.Ссылка = &Ссылка
	|	И (ПраваПользованияНМА.Долгосрочные > 0
	|		ИЛИ &ДатаИнвентаризации = &ДатаНачалоГода)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДолгосрочныеПраваПользования.Ссылка КАК Ссылка,
	|	ДолгосрочныеПраваПользования.Дата КАК Период,
	|	ДолгосрочныеПраваПользования.ДатаИнвентаризации КАК ДатаИнвентаризации,
	|	ДолгосрочныеПраваПользования.Организация КАК Организация,
	|	ДолгосрочныеПраваПользования.ИмяСписка КАК ИмяСписка,
	|	ДолгосрочныеПраваПользования.НомерСтроки КАК НомерСтроки,
	|	ДолгосрочныеПраваПользования.СчетУчета КАК СчетУчета,
	|	ДолгосрочныеПраваПользования.ИФО КАК ИФО,
	|	ДолгосрочныеПраваПользования.КФО КАК КФО,
	|	ДолгосрочныеПраваПользования.КПС КАК КПС,
	|	ДолгосрочныеПраваПользования.ОсновноеСредство КАК ОсновноеСредство,
	|	ДолгосрочныеПраваПользования.ОстаточнаяСтоимость КАК ОстаточнаяСтоимость,
	|	ДолгосрочныеПраваПользования.Долгосрочные КАК Долгосрочные
	|ИЗ
	|	ДанныеДокумента КАК ДолгосрочныеПраваПользования
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИмяСписка,
	|	НомерСтроки";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(ДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
КонецПроцедуры	

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ЗаполнитьПоДаннымУчета(ДокументОбъект, ЗаполнитьПраваПользованияОС = Истина, ЗаполнитьПраваПользованияНМА = Истина) Экспорт
	
	ПараметрыОтбора = Новый Структура;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(ДокументОбъект.ИФО) Тогда
		ПараметрыОтбора.Вставить("ИФО", ДокументОбъект.ИФО);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОбъект.КФО) Тогда
		ПараметрыОтбора.Вставить("КФО", ДокументОбъект.КФО);
	КонецЕсли;
	
	ОтчетРасчетДолгосрочныхПравПользованияАктивами = Отчеты.РасчетДолгосрочныхПравПользованияАктивами.Создать();
	
	Если ЗаполнитьПраваПользованияОС Тогда
		
		ТаблицаДолгосрочныеПраваПользованияОС = ОтчетРасчетДолгосрочныхПравПользованияАктивами.РассчитатьДолгосрочныеПраваПользованияОС(
			ДокументОбъект.Организация, ДокументОбъект.ДатаИнвентаризации, ПараметрыОтбора);
		
		ДокументОбъект.ПраваПользования.Очистить();
		Для Каждого СтрокаТаблицы Из ТаблицаДолгосрочныеПраваПользованияОС Цикл
			НоваяСтрока = ДокументОбъект.ПраваПользования.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗаполнитьПраваПользованияНМА Тогда
		
		ТаблицаДолгосрочныеПраваПользованияНМА = ОтчетРасчетДолгосрочныхПравПользованияАктивами.РассчитатьДолгосрочныеПраваПользованияНМА(
			ДокументОбъект.Организация, ДокументОбъект.ДатаИнвентаризации, ПараметрыОтбора);
		
		ДокументОбъект.ПраваПользованияНМА.Очистить();
		Для Каждого СтрокаТаблицы Из ТаблицаДолгосрочныеПраваПользованияНМА Цикл
			НоваяСтрока = ДокументОбъект.ПраваПользованияНМА.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
