
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ИндексПервогоЭлемента    = -1;
	ИндексПоследнегоЭлемента = -2;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ЭтотОбъектСсылка = Справочники.НастройкиРасчетовПоРодительскойПлате.ПолучитьСсылку();
		ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект,
			"ПараметрыОтраженияКомпенсацииРодительскойПлаты",
			Новый Структура("НастройкаКомпенсации", ЭтотОбъектСсылка));
		ТекущийРасчет = 0;
		
		Если Не Параметры.ЗначениеКопирования.Пустая() Тогда
			
			Объект.Настройки.Очистить();
			Для Каждого СтрокаИсточника Из Параметры.ЗначениеКопирования.Настройки Цикл
				СтрокаНастройки = Объект.Настройки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаНастройки, СтрокаИсточника);
				СтрокаНастройки.ФормулаСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(СтрокаИсточника.Формула.Получить());
			КонецЦикла;
			
		КонецЕсли;
		
		Если Объект.Настройки.Количество() = 0 Тогда
			Справочники.НастройкиРасчетовПоРодительскойПлате.ДобавитьПустыеСтрокиРасчета(Объект.Настройки);
		КонецЕсли;
			
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	ТекЭлемент = ИндексПервогоЭлемента;
	
	УстановитьНачальныйТекстФормулы();
	ПереиндексироватьДерево(ДеревоФормулы);

	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЭтотОбъектСсылка = ТекущийОбъект.Ссылка;
	Для Каждого СтрокаНастройки Из ТекущийОбъект.Настройки Цикл
		Объект.Настройки[СтрокаНастройки.НомерСтроки - 1].ФормулаСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(
			СтрокаНастройки.Формула.Получить());
	КонецЦикла;
	ПодготовитьФормуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(ЭтотОбъектСсылка);
	КонецЕсли;
	
	ПеренестиНастройкуФормулыВДанныеОбъекта();
	
	Для Каждого СтрокаНастройки Из ТекущийОбъект.Настройки Цикл
		НастройкаОбъекта = Объект.Настройки[СтрокаНастройки.НомерСтроки - 1];
		Если ЗначениеЗаполнено(НастройкаОбъекта.ФормулаСтрокой) Тогда
			ДеревоФормулыОбъекта = ОбщегоНазначения.ЗначениеИзСтрокиXML(НастройкаОбъекта.ФормулаСтрокой);
		Иначе
			ДеревоФормулыОбъекта = Неопределено;
		КонецЕсли;
		
		Если ТипЗнч(ДеревоФормулыОбъекта) = Тип("ДеревоЗначений") Тогда
			ОбновитьФормулуВДереве(ДеревоФормулыОбъекта);
			ЗначениеВРеквизитФормы(ДеревоФормулыОбъекта, "ДеревоФормулы");
			
			СтрокаНастройки.Формула = Новый ХранилищеЗначения(ДеревоФормулыОбъекта);
			СтрокаНастройки.ПредставлениеФормулы = СформироватьСтрокуФормулы();
			СтрокаНастройки.Схема = Новый ХранилищеЗначения(СформироватьСхемуРасчета(
				СтрокаНастройки.НомерСтроки - 1,
				СтрокаНастройки.ПредставлениеФормулы));
		Иначе
			СтрокаНастройки.Формула = Неопределено;
			СтрокаНастройки.Схема = Новый ХранилищеЗначения(Новый СхемаКомпоновкиДанных);
			СтрокаНастройки.ПредставлениеФормулы = "";
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ПараметрыЗаписи.Свойство("ПоУмолчанию") Тогда
		Отказ = Истина;
		ПроверитьНастройкаПоУмолчанию(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "ПараметрыОтраженияКомпенсацииРодительскойПлаты");
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Перем Закрыть;
	
	ПараметрыЗаписи.Свойство("Закрыть", Закрыть);
	
	Если (Закрыть <> Неопределено) И Закрыть И Открыта() Тогда
		Закрыть();
	Иначе
		ОтобразитьФормулуТекущейСтраницы();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтотОбъектСсылка = ТекущийОбъект.Ссылка;
	Для Каждого СтрокаНастройки Из ТекущийОбъект.Настройки Цикл
		Объект.Настройки[СтрокаНастройки.НомерСтроки - 1].ФормулаСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(
			СтрокаНастройки.Формула.Получить());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Результат = Истина;
	СообщениеПользователю = "";
	
	Если ИмяСобытия = "РодительскаяПлата_СозданНовыйОперанд" Тогда
		ДеревоОперандовПередНачаломДобавленияСервер(Параметр, Результат, СообщениеПользователю);
	КонецЕсли;
	
	Если Не Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю,,"ДеревоОперандов");
	КонецЕсли;
	
	РаскрытьДерево();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ПараметрыОтраженияВУчетеЗаполнены()
		И Не ЗначениеЗаполнено(ПараметрыОтраженияКомпенсацииРодительскойПлаты.Период) Тогда

		ОбщегоНазначения.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, 
				НСтр("ru = 'Параметры действуют с'")),,
				"Период",
				"ПараметрыОтраженияКомпенсацииРодительскойПлаты",
				Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ПараметрыОтраженияКомпенсацииРодительскойПлаты.Период) Тогда
		ЗаписатьПараметрыОтраженияВУчете();
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НеИспользуетсяПриИзменении(Элемент)
	Если Объект.НеИспользуется Тогда
		Объект.ПоУмолчанию = Ложь;
	КонецЕсли;
	
	УстановитьДоступностьЭлементов(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПоУмолчаниюПриИзменении(Элемент)
	Если Объект.ПоУмолчанию Тогда
		Объект.НеИспользуется = Ложь;
	КонецЕсли;
	
	УстановитьДоступностьЭлементов(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОперандовПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТекущийРодитель = ТекущиеДанные.ПолучитьРодителя();
	
	Отказ = Истина;
	
	Если (ТекущийРодитель = Неопределено Или Не (ТекущийРодитель.ИмяДляФормулы = "Пользовательские")) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru='Вы действительно хотите удалить операнд ""%1""?'"), 
							ТекущиеДанные.Представление);
							
	Оповещение = Новый ОписаниеОповещения("ДеревоОперандовПередУдалениемОповещение", ЭтотОбъект, ТекущиеДанные);
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОперандовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Копирование Тогда
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	Если Группа Тогда
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ПараметрыОперанда = Новый Структура;
	ПараметрыОперанда.Вставить("ИмяДляФормулы");
	ПараметрыОперанда.Вставить("Представление");
	ПараметрыОперанда.Вставить("Значение");
	ПараметрыОперанда.Вставить("Подсказка");
	
	ПараметрыФормы = Новый Структура("ПараметрыОперанда", ПараметрыОперанда);
	
	ОткрытьФорму("Справочник.НастройкиРасчетовПоРодительскойПлате.Форма.ФормаВводаОперанда", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОперандовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоОперандов.ТекущиеДанные;
	ВставитьВФормулу(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОперандовПередНачаломИзменения(Элемент, Отказ)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТекстСообщения = "";
	
	Если ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Нельзя редактировать группу операндов!'");
		Отказ = Истина;
	КонецЕсли;
	
	Если Родитель.ИмяДляФормулы <> "Пользовательские" Тогда
		ТекстСообщения = НСтр("ru='Нельзя редактировать предопределенные операнды!'");
		Отказ = Истина;
	КонецЕсли;
	
	Если ТекстСообщения <> "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ДеревоОперандов");
		
		Возврат;
	КонецЕсли;
	
	Строки = Объект.ДополнительныеОперанды.НайтиСтроки(Новый Структура("ИмяДляФормулы", ТекущиеДанные.ИмяДляФормулы));
	Если Строки.Количество() > 0 Тогда
		ИДСтроки = Строки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
	ПараметрыОперанда = Новый Структура;
	ПараметрыОперанда.Вставить("ИмяДляФормулы", ТекущиеДанные.ИмяДляФормулы);
	ПараметрыОперанда.Вставить("Представление", ТекущиеДанные.Представление);
	ПараметрыОперанда.Вставить("Значение", ТекущиеДанные.Значение);
	ПараметрыОперанда.Вставить("Подсказка", ТекущиеДанные.Подсказка);
	ПараметрыОперанда.Вставить("Редактирование", Истина);
	ПараметрыОперанда.Вставить("ИДСтроки", ИДСтроки);
	
	ПараметрыФормы = Новый Структура("ПараметрыОперанда", ПараметрыОперанда);
	
	ОткрытьФорму("Справочник.НастройкиРасчетовПоРодительскойПлате.Форма.ФормаВводаОперанда", ПараметрыФормы, ЭтаФорма);	
КонецПроцедуры

&НаКлиенте
Процедура ТекстФормулы0ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	ТекстФормулыПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТекстФормулы1ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	ТекстФормулыПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТекстФормулы2ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	ТекстФормулыПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТекстФормулы0ДокументСформирован(Элемент)
	ТекстФормулыДокументСформирован(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТекстФормулы1ДокументСформирован(Элемент)
	ТекстФормулыДокументСформирован(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТекстФормулы2ДокументСформирован(Элемент)
	ТекстФормулыДокументСформирован(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаФормулыРасчетовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ДействияПриСменеСтраницы();
КонецПроцедуры

&НаКлиенте
Процедура РасчетКомпенсацииНеЗависитОтБазыПриИзменении(Элемент)
	ВидимостьПоясненияФормулыКомпенсации(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиДобавленияОперандовФормулы

&НаКлиенте
Процедура ЗаписатьНастройкуИЗакрытьФорму(Команда)
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Закрыть", Истина);
	
	Записать(ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройку(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПлюс(Команда)
	ДобавитьМатематическийЗнак(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМинус(Команда)
	ДобавитьМатематическийЗнак(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУмножить(Команда)
	ДобавитьМатематическийЗнак(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРазделить(Команда)
	ДобавитьМатематическийЗнак(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСкобки(Команда)
	ДобавитьМатематическийЗнак(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУсловие(Команда)
	ДобавитьМатематическийЗнак(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБольше(Команда)
	ДобавитьМатематическийЗнак(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМеньше(Команда)
	ДобавитьМатематическийЗнак(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБольшеИлиРавно(Команда)
	ДобавитьМатематическийЗнак(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМеньшеИлиРавно(Команда)
	ДобавитьМатематическийЗнак(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРавно(Команда)
	ДобавитьМатематическийЗнак(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНеРавно(Команда)
	ДобавитьМатематическийЗнак(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВФормулу(Команда)
	ТекущиеДанные = Элементы.ДеревоОперандов.ТекущиеДанные;
	ВставитьВФормулу(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзФормулы(Команда)
	УдалитьОперанд();
	
	ВизуализироватьФормулу();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФормулу(Команда)

	ДеревоФормулы.ПолучитьЭлементы().Очистить();
	ТекЭлемент = ИндексПервогоЭлемента;
	ВизуализироватьФормулу();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПараметровОтраженияКомпенсации(Команда)
	ПараметрыФормы = Новый Структура("Отбор");
	ПараметрыФормы.Отбор = Новый Структура("НастройкаКомпенсации", ЭтотОбъектСсылка);
	ОткрытьФорму("РегистрСведений.ПараметрыОтраженияКомпенсацииРодительскойПлаты.ФормаСписка",
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФормулуПоТексту(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВводаСтрокиФормулы",ЭтотОбъект);
	
	СтрокаДляЧтения = Элементы["ТекстФормулы"+ТекущийРасчет].Документ.documentElement.innerHTML;
	СтрокаДляЧтения = СтрЗаменить (СтрокаДляЧтения,"</div><div>","");
	СтрокаДляЧтения = СтрЗаменить (СтрокаДляЧтения,"</div>","");
	СтрокаДляЧтения = СтрЗаменить (СтрокаДляЧтения,"<div>","");
	СтрокаДляЧтения = СтрЗаменить (СтрокаДляЧтения,"B","");
	СтрокаДляЧтения = СтрЗаменить (СтрокаДляЧтения,"E","");
	
	ИсходныйТекстФормулы = ЗаполнитьФормулуПоТекстуНаСервере(СтрокаДляЧтения);
	
	Подсказка = НСтр("ru = 'Введите текст формулы'");
	ПоказатьВводСтроки(ОповещениеОЗакрытии, ИсходныйТекстФормулы, Подсказка, 0, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтрокиФормулы(НовыйТекстФормулы, ДополнительныеПараметры) Экспорт
	
	Если НовыйТекстФормулы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуПоТексту(НовыйТекстФормулы);
	
	ЗаполнитьИтоговуюФормулуПоТаблице();
			
	ВизуализироватьФормулу();
	
КонецПроцедуры

#КонецОбласти


#Область ПрочиеКоманды

&НаКлиенте
Процедура ШагВперед(Команда)
	Док = Элементы["ТекстФормулы"+ТекущийРасчет].Документ;
	Элем = Док.getElementById("cp").nextSibling;
		
	Пока Элем.nodeType <> 1 Цикл
		Элем = Элем.nextSibling;
	КонецЦикла;
		
	ТекЭлемент = Элем.getAttribute("dataFld");
		
	Если ТекЭлемент = ИндексПоследнегоЭлемента Тогда
		ТекЭлемент = ИндексПервогоЭлемента;
	КонецЕсли;
	
	ВизуализироватьФормулу();
КонецПроцедуры

&НаКлиенте
Процедура ШагНазад(Команда)
	Если ТекЭлемент = ИндексПервогоЭлемента Или ТекЭлемент = ИндексПоследнегоЭлемента Тогда
		ИД = "fe";
	Иначе
		ИД = "p"+ТекЭлемент;
	КонецЕсли;
	
	Док = Элементы["ТекстФормулы"+ТекущийРасчет].Документ;
	ТекЭлем = Док.getElementById(ИД);
	Если ТекЭлем = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элем = ТекЭлем.previousSibling;
		
	Пока Элем.nodeType <> 1 Цикл
		Элем = Элем.previousSibling;
	КонецЦикла;
		
	ТекЭлемент = Элем.getAttribute("dataFld");
	
	ВизуализироватьФормулу();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкуВФайл(Команда)
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("СохранитьНастройкуВФайлОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Перед записью в файл настройку необходимо сохранить. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ПродолжитьСохранениеНастройкиВФайл();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкуИзФайла(Команда)
	Если Не Объект.Ссылка.Пустая() Тогда
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьНастройкуИзФайлаОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Текущая настройка будет заменена настройкой из файла. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ПродолжитьЗагрузкуНастройкиИзФайла();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоставляемуюНастройку(Команда)
	Если Не Объект.Ссылка.Пустая() Тогда
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьПоставляемуюНастройкуОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Текущая настройка будет заменена. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ДействияПриЗагрузкеНастройкиПоУмолчанию();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ДеревоОперандовПередУдалениемОповещение(Ответ, ДопПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Значение, ИмяДляФормулы, Представление");
	Отбор.Значение =      ДопПараметры.Значение;
	Отбор.ИмяДляФормулы = ДопПараметры.ИмяДляФормулы;
	Отбор.Представление = ДопПараметры.Представление;
	
	УдалитьОперандИзДанныхОбъекта(Отбор);
	УдалитьОперандИзДанныхФормы(Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОперандИзДанныхОбъекта(Отбор)

	Строки = Объект.ДополнительныеОперанды.НайтиСтроки(Отбор);
	
	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Объект.ДополнительныеОперанды.Удалить(Строки[0]);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОперандИзДанныхФормы(Отбор)
	ИндексГруппы = ДеревоОперандов.ПолучитьЭлементы().Количество() - 1;
	ГруппаПользовательскиеОперанды = ДеревоОперандов.ПолучитьЭлементы()[ИндексГруппы];
	ПользовательскиеОперанды = ГруппаПользовательскиеОперанды.ПолучитьЭлементы();
	УдаляемыеСтроки = Новый Массив;
	Для Каждого Операнд Из ПользовательскиеОперанды Цикл
		Если ОперандРавенЭлементуОтбора(Операнд, Отбор) Тогда
			УдаляемыеСтроки.Добавить(Операнд);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Строка Из УдаляемыеСтроки Цикл
		ПользовательскиеОперанды.Удалить(ПользовательскиеОперанды.Индекс(Строка));
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ОперандРавенЭлементуОтбора(Операнд, ЭлементОтбора)
	Возврат Операнд.ИмяДляФормулы = ЭлементОтбора.ИмяДляФормулы
			И Операнд.Значение = ЭлементОтбора.Значение
			И Операнд.Представление = ЭлементОтбора.Представление;
КонецФункции

&НаКлиенте
Процедура СохранитьНастройкуВФайлОповещение(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записать();
		ПродолжитьСохранениеНастройкиВФайл();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкуИзФайлаОповещение(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПродолжитьЗагрузкуНастройкиИзФайла();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПоставляемуюНастройкуОповещение(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ДействияПриЗагрузкеНастройкиПоУмолчанию();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройкаПоУмолчаниюОповещение(Ответ, ДопПараметры) Экспорт
	Перем ПоУмолчанию, НеИспользуется, ПоУмолчаниюТекущееЗначение, СуществующаяНастройкаСсылка, ПараметрыЗаписи, Отказ;
	
	ДопПараметры.Свойство("ПоУмолчанию", ПоУмолчанию);
	ДопПараметры.Свойство("НеИспользуется", НеИспользуется);
	ДопПараметры.Свойство("ПоУмолчаниюТекущееЗначение", ПоУмолчаниюТекущееЗначение);
	ДопПараметры.Свойство("СуществующаяНастройкаСсылка", СуществующаяНастройкаСсылка);
	ДопПараметры.Свойство("ПараметрыЗаписи", ПараметрыЗаписи);
	ДопПараметры.Свойство("Отказ", Отказ);
	
	Если Не ЗначениеЗаполнено(СуществующаяНастройкаСсылка) Или
		(ЗначениеЗаполнено(СуществующаяНастройкаСсылка) И (СуществующаяНастройкаСсылка = Объект.Ссылка)) Тогда
		
		Если Не ПоУмолчаниюТекущееЗначение Тогда
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Объект.ПоУмолчанию = ПоУмолчанию;
				Объект.НеИспользуется = НеИспользуется;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(СуществующаяНастройкаСсылка) И Объект.ПоУмолчанию И (СуществующаяНастройкаСсылка <> Объект.Ссылка) Тогда
			Если Ответ = КодВозвратаДиалога.Да Тогда
				ИзменитьНастройкуПоУмолчанию(СуществующаяНастройкаСсылка);
				
				Объект.ПоУмолчанию = Истина;
				Объект.НеИспользуется = Ложь;
			Иначе
				Объект.ПоУмолчанию = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ПоУмолчанию", Истина);
	
	Записать(ПараметрыЗаписи);
	
	УстановитьДоступностьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОперандОповещение(Ответ, ДопПараметры) Экспорт
	Перем ТекОперанд, ТекРодитель;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ДопПараметры.Свойство("ТекОперанд", ТекОперанд);
		ДопПараметры.Свойство("ТекРодитель", ТекРодитель);
		
		ТекОперанд = ТекРодитель;
		ТекРодитель = ТекОперанд.ПолучитьРодителя();
		
		ДопПараметры.ТекОперанд = ТекОперанд;
		ДопПараметры.ТекРодитель = ТекРодитель;
		
		ДействияПриУдаленииОперанда(ДопПараметры);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьФормулуВДереве(Ветвь)

	Для каждого Строка Из Ветвь.Строки Цикл
		
		Если Строка.Тип = "operand" Тогда
			
			СоставФункции = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Строка.ИмяДляФормулы, "()");
			Если СоставФункции.Количество() > 1 Тогда
				Строка.ВыражениеДляСКД = РодительскаяПлатаКлиентСервер.ВыражениеДляСКДПоФормуле(
					СоставФункции[0],
					ТаблицаОперандов,
					СоставФункции[1]);
			КонецЕсли;
			
		КонецЕсли;
		
		ОбновитьФормулуВДереве(Строка);
	
	КонецЦикла; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьПоясненияФормулыКомпенсации(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "НадписьРасчетКомпенсации2",
		"Видимость", Форма.Объект.РасчетКомпенсацииНеЗависитОтБазы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "НадписьРасчетКомпенсации",
		"Видимость", НЕ Форма.Объект.РасчетКомпенсацииНеЗависитОтБазы);

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗаполнитьДеревоОперандов();
	
	ПрочитатьПараметрыОтраженияВУчете();
	ТекЭлемент = ИндексПервогоЭлемента;
	ВосстановитьНастройки(ТекущийРасчет + 1);
	УстановитьДоступностьЭлементов(ЭтотОбъект);
	ВидимостьПоясненияФормулыКомпенсации(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНачальныйТекстФормулы()
	ТекстФормулы = Справочники.НастройкиРасчетовПоРодительскойПлате.ПолучитьМакет("ТекстФормулы").ПолучитьТекст();
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриЗагрузкеНастройкиПоУмолчанию()
	ТекстСообщения = "";
	Отказ = Ложь;
	ЗагрузитьПоставляемуюНастройкуСервер(ТекстСообщения, Отказ);
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	РаскрытьДерево();
	ОтобразитьФормулуТекущейСтраницы();
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСохранениеНастройкиВФайл()
	
	АдресФайла = СохранитьНастройкуСервер();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОкончаниеУстановкиРасширенияДляРаботыСФайламиСохранение", ЭтотОбъект, АдресФайла);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(ОписаниеОповещения,
		НСтр("ru = 'Рекомендуется установить расширение для работы с файлами (не обязательное действие).'"), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗагрузкуНастройкиИзФайла()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОкончаниеУстановкиРасширенияДляРаботыСФайламиЗагрузка", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(ОписаниеОповещения,
		НСтр("ru = 'Рекомендуется установить расширение для работы с файлами (не обязательное действие).'"), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеУстановкиРасширенияДляРаботыСФайламиСохранение(РасширениеПодключено, АдресФайла) Экспорт
	
	Если РасширениеПодключено Тогда
		
		ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(, АдресФайла);
		ОписаниеФайла = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеФайла);
		
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбораФайла.Заголовок = НСтр("ru='Выберите файл для сохранения'");
		ДиалогВыбораФайла.Фильтр = "Документ XML (*.xml)|*.xml";
		ДиалогВыбораФайла.МножественныйВыбор = Ложь;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьНастройкуПолучениеФайловОповещение", ЭтотОбъект);
		
		НачатьПолучениеФайлов(ОписаниеОповещения, ОписаниеФайла, ДиалогВыбораФайла);
		
	Иначе
		ПолучитьФайл(АдресФайла, "");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкуПолучениеФайловОповещение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	Если ПолученныеФайлы = Неопределено Тогда
		РезультатСоранения = НСтр("ru = 'Операция не выполнена'");
	Иначе
		РезультатСоранения = НСтр("ru = 'Настройка расчетов сохранена'");
	КонецЕсли;
	ПоказатьОповещениеПользователя(НСтр("ru = 'Сохранение настройки'"),, РезультатСоранения,,
		СтатусОповещенияПользователя.Информация);
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеУстановкиРасширенияДляРаботыСФайламиЗагрузка(РасширениеПодключено, ДополнительныеПараметры) Экспорт
	
	Если РасширениеПодключено Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьНастройкуВыборФайлаОповещение", ЭтотОбъект);
		
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбораФайла.Заголовок = НСтр("ru='Выберите файл с настройками'");
		ДиалогВыбораФайла.Фильтр = "Документ XML (*.xml)|*.xml";
		ДиалогВыбораФайла.МножественныйВыбор = Ложь;
		
		НачатьПомещениеФайлов(Оповещение, , ДиалогВыбораФайла, Истина, УникальныйИдентификатор);
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Загрузка настроек невозможна без установленного расширения для работы с файлами!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкуВыборФайлаОповещение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Адрес = ПомещенныеФайлы[0].Хранение;
	
	ЗагрузитьНастройкуПоАдресуФайла(Адрес);

	ОтобразитьФормулуТекущейСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриСменеСтраницы()
	ПеренестиНастройкуФормулыВДанныеОбъекта();
	ОтобразитьФормулуТекущейСтраницы();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма, ИмяЭлемента = "")
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ДеревоОперандов");
	ИменаЭлементов.Добавить("ПоУмолчанию");
	ИменаЭлементов.Добавить("ГруппаОператорыФормулы");
	ИменаЭлементов.Добавить("ПеренестиВФормулу");
	ИменаЭлементов.Добавить("УдалитьИзФормулы");
	ИменаЭлементов.Добавить("УдалитьФормулу");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Доступность", НЕ Форма.Объект.НеИспользуется);
	
	Если ИмяЭлемента = "НеИспользуется" Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "НеИспользуется",
		"Доступность", НЕ Форма.Объект.ПоУмолчанию);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНастройкаПоУмолчанию(Отказ, ПараметрыЗаписи)
	СуществующаяНастройкаСсылка = ВернутьНастройкуПоУмолчанию();
	
	Если Не ЗначениеЗаполнено(СуществующаяНастройкаСсылка) Или
		(ЗначениеЗаполнено(СуществующаяНастройкаСсылка) И (СуществующаяНастройкаСсылка = Объект.Ссылка)) Тогда
		
		Если Не Объект.ПоУмолчанию Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ПоУмолчаниюТекущееЗначение", Объект.ПоУмолчанию);
			ДопПараметры.Вставить("ПоУмолчанию", Истина);
			ДопПараметры.Вставить("НеИспользуется", Ложь);
			ДопПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
			ДопПараметры.Вставить("Отказ", Отказ);
			
			Оповещение = Новый ОписаниеОповещения("ПроверитьНастройкаПоУмолчаниюОповещение", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(Оповещение, 
							НСтр("ru='Для организации нет настройки по умолчанию.
								|Сделать текущую настройку настройкой по умолчанию?'"),
								РежимДиалогаВопрос.ДаНет,
								15,
								КодВозвратаДиалога.Да,
								,
								КодВозвратаДиалога.Да);
								
			Возврат;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(СуществующаяНастройкаСсылка) И Объект.ПоУмолчанию И (СуществующаяНастройкаСсылка <> Объект.Ссылка) Тогда
			ДопПараметры = Новый Структура;
			ДопПараметры.Вставить("ПоУмолчаниюТекущееЗначение", Объект.ПоУмолчанию);
			ДопПараметры.Вставить("ПоУмолчанию", Истина);
			ДопПараметры.Вставить("НеИспользуется", Ложь);
			ДопПараметры.Вставить("СуществующаяНастройкаСсылка", СуществующаяНастройкаСсылка);
			ДопПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
			ДопПараметры.Вставить("Отказ", Отказ);
			
			Оповещение = Новый ОписаниеОповещения("ПроверитьНастройкаПоУмолчаниюОповещение", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(Оповещение, 
							НСтр("ru='Для организации уже есть настройка по умолчанию.
								|Сделать текущую настройку настройкой по умолчанию?'"),
								РежимДиалогаВопрос.ДаНет,
								15,
								КодВозвратаДиалога.Нет,
								,
								КодВозвратаДиалога.Нет);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ПоУмолчанию", Истина);
	
	Записать(ПараметрыЗаписи);
	
	УстановитьДоступностьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ДеревоОперандовПередНачаломДобавленияСервер(Адрес, Результат, СообщениеПользователю="")
	ПараметрыОперанда = ПолучитьИзВременногоХранилища(Адрес);
	
	Если ТипЗнч(ПараметрыОперанда) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("ДеревоОперандов");
	
	Стр = Дерево.Строки.Найти("Пользовательские", "ИмяДляФормулы");
	
	Если Стр = Неопределено Тогда
		Результат = Ложь;
		СообщениеПользователю = НСтр("ru='В дереве операндов не найден родитель для ввода данных пользователя!'");
		
		Возврат;
	КонецЕсли;
	
	ЗначениеПоиска = ?(ПараметрыОперанда.ИмяДоИзменения <> "",
		ПараметрыОперанда.ИмяДоИзменения,
		ПараметрыОперанда.ИмяДляФормулы);
	
	Рек = Стр.Строки.Найти(ЗначениеПоиска, "ИмяДляФормулы");
	
	Если Рек <> Неопределено И Не ПараметрыОперанда.Редактирование Тогда
		Результат = Ложь;
		СообщениеПользователю = НСтр("ru='Уже существует операнд с таким же выражением для формулы!'");
		
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОперанда.Редактирование Тогда
		Стр1 = Рек;
		Операнд = Объект.ДополнительныеОперанды.НайтиПоИдентификатору(ПараметрыОперанда.ИДСтроки);
	Иначе
		Стр1 = Стр.Строки.Добавить();
		Операнд = Объект.ДополнительныеОперанды.Добавить();
	КонецЕсли;
	
	Стр1.Картинка = 1;
	Стр1.ИмяДляФормулы = ПараметрыОперанда.ИмяДляФормулы;
	Стр1.Представление = ПараметрыОперанда.Представление;
	Стр1.Значение = ПараметрыОперанда.Значение;
	Стр1.Подсказка = ПараметрыОперанда.Подсказка;
	
	ЗаполнитьЗначенияСвойств(Операнд, Стр1);

	Если ПараметрыОперанда.Редактирование Тогда
		УстановитьНовоеЗначениеОперандаВФормулу(ПараметрыОперанда);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоОперандов");
КонецПроцедуры

&НаСервере
Функция ВернутьНастройкуПоУмолчанию()
	Возврат РасчетыПоРодительскойПлате.ПолучитьНастройкуРасчета();
КонецФункции

&НаСервере
Процедура ИзменитьНастройкуПоУмолчанию(СуществующаяНастройкаСсылка)
	СуществующаяНастройка = СуществующаяНастройкаСсылка.ПолучитьОбъект();
	СуществующаяНастройка.ПоУмолчанию = Ложь;
	СуществующаяНастройка.Записать();
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки(НомерАлгоритма)
	Стр = Объект.Настройки[НомерАлгоритма - 1];

	Если ПустаяСтрока(Стр.ФормулаСтрокой) Тогда
		ДеревоФормулы.ПолучитьЭлементы().Очистить();
	Иначе
		ДФормулы = ОбщегоНазначения.ЗначениеИзСтрокиXML(Стр.ФормулаСтрокой);
		
		Если ДФормулы <> Неопределено Тогда
			ЗначениеВРеквизитФормы(ДФормулы, "ДеревоФормулы");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьДерево()
	Для Каждого Стр Из ДеревоОперандов.ПолучитьЭлементы() Цикл
		Элементы.ДеревоОперандов.Развернуть(Стр.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуПоТексту(НовыйТекстФормулы)
	
	НовыйТекстФормулы = СокрЛП(НовыйТекстФормулы);
	НовыйТекстФормулы = СтрЗаменить(НовыйТекстФормулы, " ","")+" ";
	
	ДлинаФормулы = СтрДлина(НовыйТекстФормулы);
	
	// Очищаем старую формулу
	ДеревоФормулы.ПолучитьЭлементы().Очистить();
	ТекЭлемент = ИндексПервогоЭлемента;
	
	ТаблицаТекстовойФормулы.Очистить();
	
	// Ищем известные команды в НовыйТекстФормулы.
	// Поиск символов из группы команд "Математические операнды".
	ДвойныеЗнакиПоПредставлению = МатематическиеЗнакиДвойные();
	ИсключенияДляПоискаЗнаков = Новый Массив;
	Для Каждого МатематическийЗнак Из ДвойныеЗнакиПоПредставлению Цикл
		ПредставлениеЗнака = МатематическийЗнак.Ключ;
		
		НачалоПоиска = 1;
		ВыполнятьПоиск = Истина;
		
		Пока ВыполнятьПоиск И НачалоПоиска<=ДлинаФормулы Цикл
			ПозицияОперанда = СтрНайти(НовыйТекстФормулы, ПредставлениеЗнака, НаправлениеПоиска.СНачала, НачалоПоиска);
			
			Если ПозицияОперанда = 0 Тогда
				ВыполнятьПоиск = Ложь;
			Иначе
				ДлинаЗнака = СтрДлина(ПредставлениеЗнака);
				Для Сч = 0 По ДлинаЗнака Цикл
					ИсключенияДляПоискаЗнаков.Добавить(ПозицияОперанда+Сч);
				КонецЦикла;				
				
				НоваяСтрокаОперанда = ТаблицаТекстовойФормулы.Добавить();
				НоваяСтрокаОперанда.ВидОперанда = 1; //Математический знак
				
				НоваяСтрокаОперанда.НачалоОперанда = ПозицияОперанда;
				НоваяСтрокаОперанда.КонецОперанда = ПозицияОперанда + ДлинаЗнака;
				НоваяСтрокаОперанда.ТекстОперанда = ПредставлениеЗнака;
				
				НачалоПоиска = ПозицияОперанда + ДлинаЗнака+1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
	// Поиск символов из группы команд "Математические операнды".
	ОдинарныеЗнакиПоПредставлению = МатематическиеЗнакиОдинарные();
	Для Каждого МатематическийЗнак Из ОдинарныеЗнакиПоПредставлению Цикл
		ПредставлениеЗнака = МатематическийЗнак.Ключ;
		
		НачалоПоиска = 1;
		ВыполнятьПоиск = Истина;
		
		Пока ВыполнятьПоиск И НачалоПоиска<=ДлинаФормулы Цикл
			ПозицияОперанда = СтрНайти(НовыйТекстФормулы, ПредставлениеЗнака, НаправлениеПоиска.СНачала, НачалоПоиска);
			
			Если ПозицияОперанда = 0 Тогда
				ВыполнятьПоиск = Ложь;
			Иначе
				Если ИсключенияДляПоискаЗнаков.Найти(ПозицияОперанда) = Неопределено Тогда
					НоваяСтрокаОперанда = ТаблицаТекстовойФормулы.Добавить();
					НоваяСтрокаОперанда.ВидОперанда = 1; //Математический знак
					
					НоваяСтрокаОперанда.НачалоОперанда = ПозицияОперанда;
					НоваяСтрокаОперанда.КонецОперанда = ПозицияОперанда+1;
					НоваяСтрокаОперанда.ТекстОперанда = ПредставлениеЗнака;
				КонецЕсли;	
				
				НачалоПоиска = ПозицияОперанда+1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
	// Поиск операндов из "дерева операндов".
	ВсеОперандыПоПредставлению = ОперандыПоПредставлению();
	Для Каждого ОперандИИндекс Из ВсеОперандыПоПредставлению Цикл
		
		ИмяФормулы = ОперандИИндекс.Ключ;
		
		НачалоПоиска = 1;
		ВыполнятьПоиск = Истина;
		
		Пока ВыполнятьПоиск И НачалоПоиска<=ДлинаФормулы Цикл
			ПозицияОперанда = СтрНайти(НовыйТекстФормулы, ИмяФормулы, НаправлениеПоиска.СНачала, НачалоПоиска);
			
			Если ПозицияОперанда = 0 Тогда
				ВыполнятьПоиск = Ложь;
			Иначе
				НоваяСтрокаОперанда = ТаблицаТекстовойФормулы.Добавить();
				НоваяСтрокаОперанда.ВидОперанда = 2; //Формула
				
				НоваяСтрокаОперанда.НачалоОперанда = ПозицияОперанда;
				НоваяСтрокаОперанда.ИмяДляПоиска = ИмяФормулы;
				
				ТекстОперандаСПараметрами = ИмяФормулы;
				ПозицияНачалаПараметров = ПозицияОперанда + СтрДлина(ТекстОперандаСПараметрами);
				Если Сред(НовыйТекстФормулы, ПозицияНачалаПараметров, 1) = "(" Тогда
					//Операнд с параметрами, добавляем все параметры до следующей скобки.
					ПозицияКонцаПараметров = СтрНайти(НовыйТекстФормулы, ")", НаправлениеПоиска.СНачала, ПозицияНачалаПараметров+1);
					Если ПозицияКонцаПараметров > 0 Тогда 
						ТекстОперандаСПараметрами = Сред(НовыйТекстФормулы, ПозицияОперанда, СтрДлина(ТекстОперандаСПараметрами) + ПозицияКонцаПараметров-ПозицияНачалаПараметров+1);
					КонецЕсли;
				КонецЕсли;					
				
				НоваяСтрокаОперанда.ТекстОперанда = ТекстОперандаСПараметрами;
				
				КонецОперанда = ПозицияОперанда + СтрДлина(ТекстОперандаСПараметрами);
				НоваяСтрокаОперанда.КонецОперанда = КонецОперанда;
								
				НачалоПоиска = КонецОперанда+1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Поиск условия "Если, То", запятых-разделителей и отдельных скобок.
	Для Сч = 1 По ДлинаФормулы+1 Цикл
		СпецСимвол = Сред(НовыйТекстФормулы,Сч,1);
		Если СпецСимвол = "(" ИЛИ СпецСимвол = ")" ИЛИ СпецСимвол = "," Тогда
			НоваяСтрокаОперанда = ТаблицаТекстовойФормулы.Добавить();
			НоваяСтрокаОперанда.ВидОперанда = 3; //Спецсимволы - условие ?(,,) или скобки ().
			
			НоваяСтрокаОперанда.НачалоОперанда	= Сч;
			НоваяСтрокаОперанда.КонецОперанда	= Сч+1;
			НоваяСтрокаОперанда.ТекстОперанда	= СпецСимвол;
			
		ИначеЕсли СпецСимвол = "?" Тогда
			НоваяСтрокаОперанда = ТаблицаТекстовойФормулы.Добавить();
			НоваяСтрокаОперанда.ВидОперанда = 3; //Спецсимволы - условие ?(,,) или скобки ().
			
			НоваяСтрокаОперанда.НачалоОперанда	= Сч;
			НоваяСтрокаОперанда.КонецОперанда	= Сч+2;
			НоваяСтрокаОперанда.ТекстОперанда	= "?(";
			
			Сч = Сч+1;
		КонецЕсли;
	КонецЦикла;
			
	ТаблицаТекстовойФормулы.Сортировать("НачалоОперанда, КонецОперанда");
	
	// Удаляем лишние элементы скобок и запятых, относящихся к формулам операндов.
	СтрокиДляУдаления = Новый Массив;
	ПредСтрока = Неопределено;
	Для Каждого СтрокаФормулы Из ТаблицаТекстовойФормулы Цикл
		Если ПредСтрока = Неопределено Тогда
			ПредСтрока = СтрокаФормулы;
			Продолжить;
		КонецЕсли;	
		
		Если СтрокаФормулы.КонецОперанда <= ПредСтрока.КонецОперанда Тогда
			СтрокиДляУдаления.Добавить(СтрокаФормулы);
		Иначе
			ПредСтрока = СтрокаФормулы;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл 
		ТаблицаТекстовойФормулы.Удалить(СтрокаДляУдаления);
	КонецЦикла;	
		
	// Проверяем разобранные элементы формулы. Обходим таблицу и сравниваем, какие симоволы не попали в таблицу - о них нужно сообщить пользователю.
	ПерваяСтрока = Истина;
	НеРаспознанныйТекст = Новый Массив;
	ЧисловыеОперандыДляДобавления = Новый Массив;
	
	ПредКонецСимвола = 0;
	Для Каждого СтрокаФормулы Из ТаблицаТекстовойФормулы Цикл
		
		ТекстОперанда = "";
		НачалоОперанда = 0;
		ДлинаОперанда = 0;
		
		Если ПерваяСтрока Тогда
			Если СтрокаФормулы.НачалоОперанда > 1 Тогда
				НачалоОперанда = 1;
				ДлинаОперанда = СтрокаФормулы.НачалоОперанда-1;
				ТекстОперанда = Сред(НовыйТекстФормулы, НачалоОперанда, ДлинаОперанда);
			КонецЕсли;
			ПерваяСтрока = Ложь;
			
		Иначе
			Если СтрокаФормулы.НачалоОперанда > ПредКонецСимвола Тогда
				НачалоОперанда = ПредКонецСимвола;
				ДлинаОперанда = СтрокаФормулы.НачалоОперанда - ПредКонецСимвола;
				ТекстОперанда = Сред(НовыйТекстФормулы, НачалоОперанда, ДлинаОперанда);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстОперанда) Тогда
			ОбработатьНераспознанныйОперанд(ЧисловыеОперандыДляДобавления, НеРаспознанныйТекст, ТекстОперанда, НачалоОперанда, ДлинаОперанда);
		КонецЕсли;
		
		ПредКонецСимвола = СтрокаФормулы.КонецОперанда;
	КонецЦикла;
	Если ПредКонецСимвола <= ДлинаФормулы Тогда
		ТекстОперанда = Сред(НовыйТекстФормулы, ПредКонецСимвола);
		НачалоОперанда = ПредКонецСимвола;
		ДлинаОперанда = ДлинаФормулы - ПредКонецСимвола;
		
		Если ЗначениеЗаполнено(ТекстОперанда) Тогда
			ОбработатьНераспознанныйОперанд(ЧисловыеОперандыДляДобавления, НеРаспознанныйТекст, ТекстОперанда, НачалоОперанда, ДлинаОперанда);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЧисловыеОперандыДляДобавления.Количество() Тогда
		ДобавитьЧисловыеОперандыНаСервере(ЧисловыеОперандыДляДобавления);
		РаскрытьДерево();
	КонецЕсли;	
		
	Для Каждого НераспознанныйФрагмент Из НеРаспознанныйТекст Цикл
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не распознан текст формулы: ""%1"". Необходимо проверить результат и добавить текст вручную.'"),
				НераспознанныйФрагмент);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНераспознанныйОперанд(ЧисловыеОперандыДляДобавления, НеРаспознанныйТекст, ТекстОперанда, НачалоОперанда, ДлинаОперанда)
	
	ЗначениеОперандаЧисло = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТекстОперанда);
	Если ЗначениеОперандаЧисло = Неопределено Тогда
		НеРаспознанныйТекст.Добавить(ТекстОперанда);
	Иначе
		//Добавляем новый операнд-число в список формул-операндов.
		ПараметрыЧисловогоОперанда = Новый Структура;
		ПараметрыЧисловогоОперанда.Вставить("ЗначениеСтрока", СокрЛП(ТекстОперанда));
		ПараметрыЧисловогоОперанда.Вставить("НачалоОперанда", НачалоОперанда);
		ПараметрыЧисловогоОперанда.Вставить("КонецОперанда", НачалоОперанда+ДлинаОперанда);
		
		ЧисловыеОперандыДляДобавления.Добавить(ПараметрыЧисловогоОперанда);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЧисловыеОперандыНаСервере(ЧисловыеОперандыДляДобавления)
	
	ДобавленныеОперанды = Новый Массив;
	Дерево = РеквизитФормыВЗначение("ДеревоОперандов");
		
	Для Каждого ЧисловойОперанд Из ЧисловыеОперандыДляДобавления Цикл
		
		ТекущееЗначениеСтрока = ЧисловойОперанд.ЗначениеСтрока;
		
		Если ДобавленныеОперанды.Найти(ТекущееЗначениеСтрока) = Неопределено Тогда
			
			ПараметрыОперанда = Новый Структура;
			ПараметрыОперанда.Вставить("ИмяДляФормулы", ТекущееЗначениеСтрока);
			ПараметрыОперанда.Вставить("Представление", ТекущееЗначениеСтрока);
			ПараметрыОперанда.Вставить("Значение", СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТекущееЗначениеСтрока));
			ПараметрыОперанда.Вставить("Подсказка", НСтр("ru = 'Числовое значение'"));
					
			Стр = Дерево.Строки.Найти("Пользовательские", "ИмяДляФормулы");
			
			Если Стр = Неопределено Тогда
				СообщениеПользователю = НСтр("ru='В дереве операндов не найден родитель для ввода данных пользователя!'");
				Возврат;
			КонецЕсли;

			Стр1 = Стр.Строки.Добавить();
			Операнд = Объект.ДополнительныеОперанды.Добавить();
			Стр1.Картинка = 1;
			Стр1.ИмяДляФормулы = ПараметрыОперанда.ИмяДляФормулы;
			Стр1.Представление = ПараметрыОперанда.Представление;
			Стр1.Значение = ПараметрыОперанда.Значение;
			Стр1.Подсказка = ПараметрыОперанда.Подсказка;
			
			ЗаполнитьЗначенияСвойств(Операнд, Стр1);
			
		КонецЕсли;
		
		//Добавление операнда в таблицу текстовой формулы.
		НоваяСтрокаОперанда = ТаблицаТекстовойФормулы.Добавить();
		НоваяСтрокаОперанда.ВидОперанда = 2; //Формула
		НоваяСтрокаОперанда.НачалоОперанда = ЧисловойОперанд.НачалоОперанда;
		НоваяСтрокаОперанда.ИмяДляПоиска = ЧисловойОперанд.ЗначениеСтрока;
		НоваяСтрокаОперанда.ТекстОперанда = ЧисловойОперанд.ЗначениеСтрока;
		НоваяСтрокаОперанда.КонецОперанда = ЧисловойОперанд.КонецОперанда;
			
		ДобавленныеОперанды.Добавить(ТекущееЗначениеСтрока);
		
	КонецЦикла;
	
	ТаблицаТекстовойФормулы.Сортировать("НачалоОперанда, КонецОперанда");
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоОперандов");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИтоговуюФормулуПоТаблице()
	
	// Для опередения условий используется соответствие ПервыйПараметрУсловия:
	// - с ключом номером уровня, тип - число;
	// - со значением - признаком первого параметра условия, тип - булево.
	УровеньУсловия = 0;
	ПервыйПараметрУсловия = Новый Соответствие;	
		
	УровеньСкобок = 0;
	
	ВсеОперандыПоПредставлению = ОперандыПоПредставлению();
	ВсеЗнакиПоПредставлению = МатематическиеЗнакиПоПредставлению();
	
	//Заполняем новую формулу по текстовой формуле.
	Для Каждого СтрокаОперанда Из ТаблицаТекстовойФормулы Цикл
		Если СтрокаОперанда.ВидОперанда = 3 Тогда
			//Элементы скобок или условия.
			Если СтрокаОперанда.ТекстОперанда = "?(" Тогда
				СтруктураОперанда = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
					ОписанияМатематическихЗнаков(), "УсловиеНачало");
				ДобавитьОперанд(СтруктураОперанда);
				
				УровеньУсловия = УровеньУсловия+1;
				ПервыйПараметрУсловия.Вставить(УровеньУсловия, Истина);
				
			ИначеЕсли СтрокаОперанда.ТекстОперанда = "," Тогда
				
				Если ПервыйПараметрУсловия.Получить(УровеньУсловия) = Истина Тогда
					СтруктураОперанда = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
						ОписанияМатематическихЗнаков(), "УсловиеТогда");
						
					ПервыйПараметрУсловия.Вставить(УровеньУсловия, Ложь);
				Иначе
					СтруктураОперанда = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
						ОписанияМатематическихЗнаков(), "УсловиеИначе");
				КонецЕсли;
				ДобавитьОперанд(СтруктураОперанда);
				
			ИначеЕсли СтрокаОперанда.ТекстОперанда = "(" Тогда
				СтруктураОперанда = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
					ОписанияМатематическихЗнаков(), "СкобкиНачало");
				ДобавитьОперанд(СтруктураОперанда);
				
				УровеньСкобок = УровеньСкобок+1;
				
			ИначеЕсли СтрокаОперанда.ТекстОперанда = ")" Тогда
				
				Если УровеньСкобок > 0 Тогда
					СтруктураОперанда = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
						ОписанияМатематическихЗнаков(), "СкобкиКонец");
					УровеньСкобок = УровеньСкобок-1;
					
				Иначе
					СтруктураОперанда = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
						ОписанияМатематическихЗнаков(), "УсловиеКонец");
					УровеньУсловия = УровеньУсловия-1;
				КонецЕсли;		
				
				ДобавитьОперанд(СтруктураОперанда);		
				
			КонецЕсли;
			
		ИначеЕсли СтрокаОперанда.ВидОперанда = 1 Тогда
			//Математический знак, добавляем аналогично команде.
					
			СтруктураОперанда = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
				ОписанияМатематическихЗнаков(), ВсеЗнакиПоПредставлению[СтрокаОперанда.ТекстОперанда]);
			ДобавитьОперанд(СтруктураОперанда);
			
		ИначеЕсли СтрокаОперанда.ВидОперанда = 2 Тогда
			//Операнд формулы, добавляем с поиском в дереве операндов.
			
			ОперандЭлемент = ВсеОперандыПоПредставлению.Получить(СтрокаОперанда.ИмяДляПоиска);
			ВставитьВФормулу(ОперандЭлемент, Ложь, СтрокаОперанда.ТекстОперанда);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВизуализироватьФормулу()
	
	ТекущийЭлемент = Элементы["ТекстФормулы"+ТекущийРасчет];
	
	Если НЕ ДокументHTMLГотов(ТекущийЭлемент) Тогда
		Возврат;
	КонецЕсли;

	Если ДеревоФормулы.ПолучитьЭлементы().Количество() = 0 Тогда
		ТекстФормулыHTML = "";
	Иначе
		ТекстФормулыHTML = ТекстHTML(ДеревоФормулы.ПолучитьЭлементы());
	КонецЕсли;
	
	Если ТекЭлемент = ИндексПервогоЭлемента Тогда
		ВставитьКареткуВИтоговуюФормулу(ТекстФормулыHTML, Истина);
	КонецЕсли;
	Если ТекЭлемент = ИндексПоследнегоЭлемента Тогда
		ВставитьКареткуВИтоговуюФормулу(ТекстФормулыHTML, Ложь);
	КонецЕсли;

	ПерваяСтрока = РодительскаяПлатаКлиентСервер.ТэгОперанда("startelement",
															 "se",
															 ИндексПервогоЭлемента,
															 "B");
	ПоследняяСтрока = РодительскаяПлатаКлиентСервер.ТэгОперанда("finalelement",
																"fe",
																ИндексПоследнегоЭлемента,
																"E");

	Результат = ПерваяСтрока + "
				|" + ТекстФормулыHTML + "
				|" + ПоследняяСтрока;
	
	УстановитьТекстФормулыВHTML(ТекущийЭлемент, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьКареткуВИтоговуюФормулу(ТекстФормулыHTML, ВНачало)
	Если ВНачало Тогда
		ТекстФормулыHTML = КареткаHTML() + "
			|" + ТекстФормулыHTML;
	Иначе
		ТекстФормулыHTML = ТекстФормулыHTML + "
			|" + КареткаHTML();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ДокументHTMLГотов(Элемент)
	
	Возврат Элемент.Документ <> Неопределено И Элемент.Документ.readyState = "complete";
	
КонецФункции

&НаКлиенте
Процедура УстановитьТекстФормулыВHTML(Элемент, Текст)
	
	Документ = Элемент.Документ;
	Строка = Документ.getElementById("p");
	
	Строка.removeChild(Строка.lastChild);
	Ячейка = Документ.createElement("TD");
	Ячейка.id = "cell";
	Ячейка.innerHtml = Текст;
	
	Строка.appendChild(Ячейка);
КонецПроцедуры

&НаКлиенте
Функция ТекстHTML(Дерево)
	Результат = "";
	Для Каждого Стр Из Дерево Цикл
		Если Стр.ПолучитьЭлементы().Количество() = 0 Тогда
			Если СокрЛП(Стр.СтрокаHtml) <> "" Тогда
				Результат = Результат + Символы.ПС + Стр.СтрокаHtml;
				
				Если Стр.ПолучитьИдентификатор() = ТекЭлемент Тогда
					Результат = Результат + Символы.ПС + КареткаHTML();
				КонецЕсли;
			КонецЕсли;
		Иначе
			Результат = Результат + ТекстHTML(Стр.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция КареткаHTML()
	Возврат РодительскаяПлатаКлиентСервер.ТэгОперанда("caretpos", "cp", "cp", "&nbsp;");
КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуHTML(СтрокаДерева)
	
	ИдСтроки = Сред(СтрокаДерева.Индекс, 2);
	Возврат РодительскаяПлатаКлиентСервер.ТэгОперанда(СтрокаДерева.Тип,
													  СтрокаДерева.Индекс,
													  ИДСтроки,
													  СтрокаДерева.ИмяДляФормулы);
	
КонецФункции

&НаКлиенте
Процедура СоздатьБлокСкобокНачало(СвойстваОперанда)

	СоставФормулы = Новый Массив;
	СоставФормулы.Добавить(Новый Структура("ИмяДляФормулы, ВыражениеДляСКД", "(", ""));
	
	ПараметрыДобавления = ПараметрыДобавляемогоОперанда();
	Родитель = НоваяСтрокаДереваОперандов(ПараметрыДобавления.Родитель, ПараметрыДобавления.Индекс, СвойстваОперанда);
	ВставитьФормулуВДерево(Родитель, "hooksbeg", СоставФормулы);

	ТекЭлемент = Родитель.ПолучитьЭлементы()[0].ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлокСкобокКонец(СвойстваОперанда)

	СоставФормулы = Новый Массив;
	СоставФормулы.Добавить(Новый Структура("ИмяДляФормулы, ВыражениеДляСКД", ")", ""));
	
	ПараметрыДобавления = ПараметрыДобавляемогоОперанда();
	Родитель = НоваяСтрокаДереваОперандов(ПараметрыДобавления.Родитель, ПараметрыДобавления.Индекс, СвойстваОперанда);
	ВставитьФормулуВДерево(Родитель, "hooksend", СоставФормулы);

	ТекЭлемент = Родитель.ПолучитьЭлементы()[0].ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлокСкобок(СвойстваОперанда)

	СоставФормулы = Новый Массив;
	СоставФормулы.Добавить(Новый Структура("ИмяДляФормулы, ВыражениеДляСКД", "(", ""));
	СоставФормулы.Добавить(Новый Структура("ИмяДляФормулы, ВыражениеДляСКД", ")",  ""));
	
	ПараметрыДобавления = ПараметрыДобавляемогоОперанда();
	Родитель = НоваяСтрокаДереваОперандов(ПараметрыДобавления.Родитель, ПараметрыДобавления.Индекс, СвойстваОперанда);
	ВставитьФормулуВДерево(Родитель, "hooks", СоставФормулы);

	ТекЭлемент = Родитель.ПолучитьЭлементы()[0].ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлокУсловия(СвойстваОперанда)

	СоставФормулы = Новый Массив;
	СоставФормулы.Добавить(Новый Структура("ИмяДляФормулы, ВыражениеДляСКД", "?(", " ВЫБОР КОГДА "));
	СоставФормулы.Добавить(Новый Структура("ИмяДляФормулы, ВыражениеДляСКД", ",",  " ТОГДА "));
	СоставФормулы.Добавить(Новый Структура("ИмяДляФормулы, ВыражениеДляСКД", ",",  " ИНАЧЕ "));
	СоставФормулы.Добавить(Новый Структура("ИмяДляФормулы, ВыражениеДляСКД", ")",  " КОНЕЦ "));
	
	ПараметрыДобавления = ПараметрыДобавляемогоОперанда();
	Родитель = НоваяСтрокаДереваОперандов(ПараметрыДобавления.Родитель, ПараметрыДобавления.Индекс, СвойстваОперанда);
	ВставитьФормулуВДерево(Родитель, "ifelse", СоставФормулы);
	
	ТекЭлемент = Родитель.ПолучитьЭлементы()[0].ПолучитьИдентификатор();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлокУсловияНачало(СвойстваОперанда)

	СоставФормулы = Новый Массив;
	СоставФормулы.Добавить(Новый Структура("ИмяДляФормулы, ВыражениеДляСКД", "?(", " ВЫБОР КОГДА "));
	
	ПараметрыДобавления = ПараметрыДобавляемогоОперанда();
	Родитель = НоваяСтрокаДереваОперандов(ПараметрыДобавления.Родитель, ПараметрыДобавления.Индекс, СвойстваОперанда);
	ВставитьФормулуВДерево(Родитель, "ifbeg", СоставФормулы);
	
	ТекЭлемент = Родитель.ПолучитьЭлементы()[0].ПолучитьИдентификатор();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлокУсловияТогда(СвойстваОперанда)

	СоставФормулы = Новый Массив;
	СоставФормулы.Добавить(Новый Структура("ИмяДляФормулы, ВыражениеДляСКД", ",",  " ТОГДА "));
	
	ПараметрыДобавления = ПараметрыДобавляемогоОперанда();
	Родитель = НоваяСтрокаДереваОперандов(ПараметрыДобавления.Родитель, ПараметрыДобавления.Индекс, СвойстваОперанда);
	ВставитьФормулуВДерево(Родитель, "iffirst", СоставФормулы);
	
	ТекЭлемент = Родитель.ПолучитьЭлементы()[0].ПолучитьИдентификатор();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлокУсловияИначе(СвойстваОперанда)

	СоставФормулы = Новый Массив;
	СоставФормулы.Добавить(Новый Структура("ИмяДляФормулы, ВыражениеДляСКД", ",",  " ИНАЧЕ "));
	
	ПараметрыДобавления = ПараметрыДобавляемогоОперанда();
	Родитель = НоваяСтрокаДереваОперандов(ПараметрыДобавления.Родитель, ПараметрыДобавления.Индекс, СвойстваОперанда);
	ВставитьФормулуВДерево(Родитель, "ifsecond", СоставФормулы);
	
	ТекЭлемент = Родитель.ПолучитьЭлементы()[0].ПолучитьИдентификатор();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлокУсловияКонец(СвойстваОперанда)

	СоставФормулы = Новый Массив;
	СоставФормулы.Добавить(Новый Структура("ИмяДляФормулы, ВыражениеДляСКД", ")",  " КОНЕЦ "));
	
	ПараметрыДобавления = ПараметрыДобавляемогоОперанда();
	Родитель = НоваяСтрокаДереваОперандов(ПараметрыДобавления.Родитель, ПараметрыДобавления.Индекс, СвойстваОперанда);
	ВставитьФормулуВДерево(Родитель, "ifend", СоставФормулы);
	
	ТекЭлемент = Родитель.ПолучитьЭлементы()[0].ПолучитьИдентификатор();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлокОперанда(СвойстваОперанда)
	ПараметрыДобавления = ПараметрыДобавляемогоОперанда();
	Стр = НоваяСтрокаДереваОперандов(ПараметрыДобавления.Родитель, ПараметрыДобавления.Индекс, СвойстваОперанда);
	ТекЭлемент = Стр.ПолучитьИдентификатор();
КонецПроцедуры

&НаКлиенте
Процедура ВставитьФормулуВДерево(Родитель, Тип, СоставФормулы)
	
	ИДСтроки = ТекЭлемент;
	СтруктураОперанда = СтруктураОперанда();
	СтруктураОперанда.Тип      = Тип;
	СтруктураОперанда.Значение = "";
	
	Для Каждого ЧастьФормулы Из СоставФормулы Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураОперанда, ЧастьФормулы);
		Инд = Родитель.ПолучитьЭлементы().Индекс(ДеревоФормулы.НайтиПоИдентификатору(ИДСтроки));
		НоваяСтрока = НоваяСтрокаДереваОперандов(Родитель, Инд+1, СтруктураОперанда);
		ИДСтроки = НоваяСтрока.ПолучитьИдентификатор();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НоваяСтрокаДереваОперандов(Родитель, Индекс, СвойстваОперанда)

	СтрокаОперанда = Родитель.ПолучитьЭлементы().Вставить(Индекс);
	
	ИДСтроки = СтрокаОперанда.ПолучитьИдентификатор();

	СтрокаОперанда.Индекс        = "p" + ИДСтроки;
	СтрокаОперанда.ИмяДляФормулы = СвойстваОперанда.ИмяДляФормулы;
	Если ТипЗнч(СвойстваОперанда.Значение) = Тип("Число") Тогда
		СтрокаОперанда.Значение = Формат(СвойстваОперанда.Значение, "ЧРД='.';ЧГ='';ЧН=0");
	Иначе
		СтрокаОперанда.Значение = СвойстваОперанда.Значение;
	КонецЕсли;
	СтрокаОперанда.Тип             = СвойстваОперанда.Тип;
	СтрокаОперанда.СтрокаHtml      = ПолучитьСтрокуHTML(СтрокаОперанда);
	СтрокаОперанда.ВыражениеДляСКД = СвойстваОперанда.ВыражениеДляСКД;

	Возврат СтрокаОперанда;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьОперанд(НовыйОперанд)
	
	Если НовыйОперанд.Тип = "hooks" Тогда
		СоздатьБлокСкобок(НовыйОперанд);
	ИначеЕсли НовыйОперанд.Тип = "hooksbeg" Тогда
		СоздатьБлокСкобокНачало(НовыйОперанд);
	ИначеЕсли НовыйОперанд.Тип = "hooksend" Тогда
		СоздатьБлокСкобокКонец(НовыйОперанд);
	ИначеЕсли НовыйОперанд.Тип = "ifelse" Тогда
		СоздатьБлокУсловия(НовыйОперанд);
	ИначеЕсли НовыйОперанд.Тип = "ifbeg" Тогда
		СоздатьБлокУсловияНачало(НовыйОперанд);
	ИначеЕсли НовыйОперанд.Тип = "iffirst" Тогда
		СоздатьБлокУсловияТогда(НовыйОперанд);
	ИначеЕсли НовыйОперанд.Тип = "ifsecond" Тогда
		СоздатьБлокУсловияИначе(НовыйОперанд);
	ИначеЕсли НовыйОперанд.Тип = "ifend" Тогда
		СоздатьБлокУсловияКонец(НовыйОперанд);
	Иначе
		СоздатьБлокОперанда(НовыйОперанд);
	КонецЕсли;
	
	ВизуализироватьФормулу();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОперанд()
	Если ТекЭлемент = ИндексПервогоЭлемента Или ДеревоФормулы.ПолучитьЭлементы().Количество() = 0 Тогда
		Возврат;
	ИначеЕсли ТекЭлемент = ИндексПоследнегоЭлемента Тогда
		Док = Элементы["ТекстФормулы"+ТекущийРасчет].Документ;
		Ячейка = Док.getElementById("cell");
		Элем = Ячейка.children(Ячейка.children.length - 3);
		
		ТекОперанд = ДеревоФормулы.НайтиПоИдентификатору(Элем.getAttribute("dataFld"));
	Иначе
		ТекОперанд = ДеревоФормулы.НайтиПоИдентификатору(ТекЭлемент);
	КонецЕсли;
	
	Если ТекОперанд = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекРодитель = ТекОперанд.ПолучитьРодителя();
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ТекОперанд", ТекОперанд);
	ДопПараметры.Вставить("ТекРодитель", ТекРодитель);	
	
	Если (ТекОперанд.Тип = "hooks" Или ТекОперанд.Тип = "ifelse") И (ТекОперанд.ИмяДляФормулы <> ",") Тогда
		Оповещение = Новый ОписаниеОповещения("УдалитьОперандОповещение", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, НСтр("ru='Удалить выражение в скобках целиком?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ДействияПриУдаленииОперанда(ДопПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриУдаленииОперанда(СтруктураПараметров)
	Перем ТекОперанд, ТекРодитель;
	
	СтруктураПараметров.Свойство("ТекОперанд", ТекОперанд);
	СтруктураПараметров.Свойство("ТекРодитель", ТекРодитель);
	
	Если ТекРодитель = Неопределено Тогда
		ТекРодитель = ДеревоФормулы;
	КонецЕсли;
	
	Если ТекЭлемент <> ИндексПоследнегоЭлемента Тогда
		ТекЭлемент = СменитьТекущийЭлемент();
	КонецЕсли;
	
	ТекРодитель.ПолучитьЭлементы().Удалить(ТекОперанд);
	
	ВизуализироватьФормулу();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоИТаблицуПредопределеннымиОперандами(Дерево)
	Родитель = Неопределено;
	Для Каждого СтрокаТаблицы Из Справочники.НастройкиРасчетовПоРодительскойПлате.ПредопределенныеОперандыФормулРасчета() Цикл
		
		Если ПустаяСтрока(СтрокаТаблицы.Родитель) Тогда
			Родитель = Дерево.Строки.Добавить();
			НоваяСтрока = Родитель;
		Иначе
			НоваяСтрока = Родитель.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(ТаблицаОперандов.Добавить(), СтрокаТаблицы);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьДополнительныеКоэффициенты(Дерево)
	ДопКоэффициенты = Дерево.Строки.Найти("Пользовательские", "ИмяДляФормулы");
	
	Для Каждого Операнд Из Объект.ДополнительныеОперанды Цикл
		Стр = ДопКоэффициенты.Строки.Добавить();
		
		ЗаполнитьЗначенияСвойств(Стр, Операнд);
		
		Стр.Картинка = 1;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция СформироватьСтрокуФормулы(Строка = Неопределено)
	Результат = "";
	
	Если Строка = Неопределено Тогда
		Строка = ДеревоФормулы.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого Стр Из Строка Цикл
		Если Стр.ПолучитьЭлементы().Количество() = 0 Тогда
			Результат = Результат + ?(Стр.ВыражениеДляСКД <> "", Стр.ВыражениеДляСКД, Стр.ИмяДляФормулы);
		Иначе
			Результат = Результат + СформироватьСтрокуФормулы(Стр.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ВыражениеДляФункции(Знач ИмяФункции)
	
	Если СтрЗаканчиваетсяНа(ИмяФункции, "()") Тогда
		ИмяФункции = Лев(ИмяФункции, СтрДлина(ИмяФункции) - 2);
	КонецЕсли;
	
	СтруктураФункции = РодительскаяПлатаКлиентСервер.ШаблонОписанияФункции();
	СтруктураФункции.ИмяФункции = ИмяФункции;
	
	СтрокиТаблицы = ТаблицаОперандов.НайтиСтроки(Новый Структура("ИмяДляФормулы", ИмяФункции));
	Если СтрокиТаблицы.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(СтруктураФункции, СтрокиТаблицы[0]);
	КонецЕсли;
	Возврат СтруктураФункции;
	
КонецФункции

&НаСервере
Функция СформироватьСхемуРасчета(ТекущийРасчет, Формула)
	Если ТекущийРасчет = 0 Тогда
		СКД = Справочники.НастройкиРасчетовПоРодительскойПлате.СхемаДляВыпискиКвитанций(Формула);
	ИначеЕсли ТекущийРасчет = 1 Тогда
		СКД = Справочники.НастройкиРасчетовПоРодительскойПлате.СхемаДляНачисленияПлаты(Формула);
	Иначе
		СКД = Справочники.НастройкиРасчетовПоРодительскойПлате.СхемаДляРасчетаКомпенсации(Формула,
			Объект.РасчетКомпенсацииНеЗависитОтБазы);
	КонецЕсли;
	
	Возврат СКД;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПереиндексироватьДерево(Дерево)
	Для Каждого Строка Из Дерево.ПолучитьЭлементы() Цикл
		Строка.Индекс = "p"+Строка.ПолучитьИдентификатор();
		Строка.СтрокаHtml = РодительскаяПлатаКлиентСервер.ТэгОперанда(Строка.Тип,
																	  Строка.Индекс,
																	  Строка.ПолучитьИдентификатор(),
																	  Строка.ИмяДляФормулы);
			
		Если Строка.ПолучитьЭлементы().Количество() > 0 Тогда
			ПереиндексироватьДерево(Строка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция СменитьТекущийЭлемент()
	Результат = ИндексПервогоЭлемента;
	
	Док = Элементы["ТекстФормулы"+ТекущийРасчет].Документ;
	Элем = Док.getElementById("p"+ТекЭлемент);
	
	СледЭлем = Элем.previousSibling;
	
	Пока СледЭлем.nodeType <> 1 Цикл
		СледЭлем = СледЭлем.previousSibling;
	КонецЦикла;
	
	Если СледЭлем <> Неопределено Тогда
		Результат = СледЭлем.getAttribute("dataFld");
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ВставитьВФормулу(ЭлементДереваОперандов, ИнтерактивныйВыбор = Истина, ТекстОперандаДляАнализа = "")
	
	Если ЭлементДереваОперандов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = ЭлементДереваОперандов.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Родитель.ИмяДляФормулы = "Пользовательские" Тогда
		ВыражениеДляСКД = Формат(ЭлементДереваОперандов.Значение, "ЧРД='.';ЧГ='';ЧН=0");
		ВставитьВФормулу_Окончание(ЭлементДереваОперандов, ВыражениеДляСКД, Новый Структура);
		Возврат;
	КонецЕсли;
	
	Структура = РодительскаяПлатаКлиентСервер.ШаблонОписанияФункции(ЭлементДереваОперандов);
	
	Период = Неопределено;
	
	Если ИнтерактивныйВыбор Тогда
		Если ТребуетсяВыборПериодаФормулы(Структура) Тогда
			ВыбратьПериодПараметра(Структура);
			Возврат;
		КонецЕсли;
	Иначе
		
		ВариантыПериодов = Новый Массив;
		ВариантыПериодов.Добавить("ПериодДокумента");
		ВариантыПериодов.Добавить("ПредыдущийМесяц");
		ВариантыПериодов.Добавить("ТекущийКвартал");
		ВариантыПериодов.Добавить("ПредыдущийКвартал");
		ВариантыПериодов.Добавить("ТекущееПолугодие");
		ВариантыПериодов.Добавить("ПредыдущееПолугодие");
		
		Для Каждого ТекВариант Из ВариантыПериодов Цикл
			Если СтрНайти(ТекстОперандаДляАнализа, ТекВариант) > 0 Тогда
				Период = ТекВариант;
				Структура.Вставить("Период", Период);
				Прервать;
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;
		
	ВыражениеДляСКД = РодительскаяПлатаКлиентСервер.ВыражениеДляСКДПоФормуле(ЭлементДереваОперандов.ИмяДляФормулы,
		ТаблицаОперандов,
		Период);
	ВставитьВФормулу_Окончание(ЭлементДереваОперандов, ВыражениеДляСКД, Структура);
	
КонецПроцедуры

&НаКлиенте
Функция ТребуетсяВыборПериодаФормулы(СтруктураФункции)

	Если СтрНайти(СтруктураФункции.Параметр1, "Период") > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Индекс = 1 По 6 Цикл
		
		ЗначениеПараметра = СтруктураФункции["Параметр" + Индекс];
		
		Если Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если СтрЗаканчиваетсяНа(ЗначениеПараметра, "()") Тогда
			Если ТребуетсяВыборПериодаФормулы(ВыражениеДляФункции(ЗначениеПараметра)) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции


&НаКлиенте
Процедура ТекстФормулыПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеСобытия.Element = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементФормулы = ДанныеСобытия.Element;
	
	Если Не ЗначениеЗаполнено(ЭлементФормулы.getAttribute("dataFld")) Тогда
		Возврат;
	КонецЕсли;
	
	Индекс = ЭлементФормулы.getAttribute("dataFld");
	
	Если Индекс <> "cp" Тогда
		ТекЭлемент = Индекс;
	КонецЕсли;
		
	ВизуализироватьФормулу();
КонецПроцедуры

&НаКлиенте
Процедура ТекстФормулыДокументСформирован(Элемент)
	ВизуализироватьФормулу();
КонецПроцедуры


&НаСервере
Функция СохранитьНастройкуСервер()
	
	НастройкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ИмяФайла = ПолучитьИмяВременногоФайла("xml");
	
	Запись = Новый ЗаписьXML;
	Запись.ОткрытьФайл(ИмяФайла);
	Запись.ЗаписатьОбъявлениеXML();

	Справочники.НастройкиРасчетовПоРодительскойПлате.СохранитьНастройкуВФайл(Запись, НастройкаОбъект);
	ДанныеФайла = Новый ДвоичныеДанные(ИмяФайла);

	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Расчеты по родительской плате'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеФайла, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьНастройкуСервер(Чтение)
	
	ЗагружаемаяНастройка = Справочники.НастройкиРасчетовПоРодительскойПлате.СтруктураДляЗагрузкиНастройки();
	
	Справочники.НастройкиРасчетовПоРодительскойПлате.ЗагрузитьНастройкуИзФайла(Чтение, ЗагружаемаяНастройка);
	
	ЗаполнитьЗначенияСвойств(Объект, ЗагружаемаяНастройка, "Наименование, НеИспользуется, ПоУмолчанию");
	
	Объект.Настройки.Очистить();
	
	Для Каждого СтрокаНастройки Из ЗагружаемаяНастройка.Настройки Цикл
		НоваяСтрока = Объект.Настройки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНастройки);
		НоваяСтрока.ФормулаСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(СтрокаНастройки.Формула.Получить());
	КонецЦикла;
	
	Объект.ДополнительныеОперанды.Загрузить(ЗагружаемаяНастройка.ДополнительныеОперанды);
	
	ЗаполнитьДеревоОперандов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОперандов()

	ДеревоОперандов.ПолучитьЭлементы().Очистить();
	ТаблицаОперандов.Очистить();
	
	Дерево = РеквизитФормыВЗначение("ДеревоОперандов");

	ЗаполнитьДеревоИТаблицуПредопределеннымиОперандами(Дерево);
	ПолучитьДополнительныеКоэффициенты(Дерево);
	ЗначениеВРеквизитФормы(Дерево, "ДеревоОперандов");

КонецПроцедуры


&НаСервере
Процедура ЗагрузитьПоставляемуюНастройкуСервер(ТекстСообщения, Отказ)

	ТекстНастройки = Справочники.НастройкиРасчетовПоРодительскойПлате.ТекстНастройкиПоУмолчанию();
	
	Чтение = Новый ЧтениеXML();
	Чтение.УстановитьСтроку(ТекстНастройки);
	
	ЗагрузитьНастройкуСервер(Чтение);

КонецПроцедуры

&НаКлиенте
Процедура ВставитьВФормулу_Окончание(ЭлементДереваОперандов, ВыражениеДляСКД, ПараметрыФормулы)
	Перем ЗначениеПериод;
	
	ИмяДляФормулы = ЭлементДереваОперандов.ИмяДляФормулы;
	Если ПараметрыФормулы.Свойство("Период", ЗначениеПериод) И ЗначениеЗаполнено(ЗначениеПериод) Тогда
		ИмяДляФормулы = ИмяДляФормулы + "(" + ЗначениеПериод + ")";
	КонецЕсли;
	
	СтруктураОперанда = СтруктураОперанда();
	СтруктураОперанда.ИмяДляФормулы   = ИмяДляФормулы;
	СтруктураОперанда.Значение        = ЭлементДереваОперандов.Значение;
	СтруктураОперанда.ВыражениеДляСКД = ВыражениеДляСКД;
	СтруктураОперанда.Тип             = "operand";
	
	ДобавитьОперанд(СтруктураОперанда);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодПараметра(СтруктураФункции)

	ДополнительныеПараметры = Новый Структура("СтруктураФункции", СтруктураФункции);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗакончитьВыборПериода", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Справочник.НастройкиРасчетовПоРодительскойПлате.Форма.ФормаВыбораПериодаПараметра",,,,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьВыборПериода(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.СтруктураФункции.Вставить("Период", ВыбранноеЗначение);
	
	ВыражениеДляСКД = РодительскаяПлатаКлиентСервер.ВыражениеДляСКДПоФормуле(
		ДополнительныеПараметры.СтруктураФункции.ИмяФункции,
		ТаблицаОперандов, ВыбранноеЗначение);
		
	ТекущиеДанные = Элементы.ДеревоОперандов.ТекущиеДанные;	
	ВставитьВФормулу_Окончание(ТекущиеДанные, ВыражениеДляСКД, ДополнительныеПараметры.СтруктураФункции);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыОтраженияВУчете()
	ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект,
		"ПараметрыОтраженияКомпенсацииРодительскойПлаты",
		Новый Структура("НастройкаКомпенсации", ЭтотОбъектСсылка));
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыОтраженияВУчете()
	ОбщегоНазначенияБГУ.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект,
		"ПараметрыОтраженияКомпенсацииРодительскойПлаты",
		Новый Структура("НастройкаКомпенсации", ЭтотОбъектСсылка));
КонецПроцедуры

&НаСервере
Функция ПараметрыОтраженияВУчетеЗаполнены()
	Возврат ЗначениеЗаполнено(ПараметрыОтраженияКомпенсацииРодительскойПлаты.КФО)
		ИЛИ ЗначениеЗаполнено(ПараметрыОтраженияКомпенсацииРодительскойПлаты.КПС);
КонецФункции

&НаСервере
Процедура ПеренестиНастройкуФормулыВДанныеОбъекта()
	
	ДФормулы = РеквизитФормыВЗначение("ДеревоФормулы");
	
	Объект.Настройки[ТекущийРасчет].ФормулаСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ДФормулы);
	Объект.Настройки[ТекущийРасчет].ПредставлениеФормулы = СформироватьСтрокуФормулы();
	Объект.Настройки[ТекущийРасчет].СхемаСтрокой = Новый ХранилищеЗначения(СформироватьСхемуРасчета(
		ТекущийРасчет,
		Объект.Настройки[ТекущийРасчет].ПредставлениеФормулы));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьФормулуТекущейСтраницы()

	ТекущаяСтраница = Элементы.ГруппаФормулыРасчетов.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Элементы.РасчетПлатыЗаУслуги Тогда
		ТекущийРасчет = 0;
	ИначеЕсли ТекущаяСтраница = Элементы.НачислениеПлатыЗаУслуги Тогда
		ТекущийРасчет = 1;
	Иначе
		ТекущийРасчет = 2;
	КонецЕсли;
	
	ДеревоФормулы.ПолучитьЭлементы().Очистить();
	
	ВосстановитьНастройки(ТекущийРасчет + 1);
	
	ТекЭлемент = ИндексПервогоЭлемента;
	
	ПереиндексироватьДерево(ДеревоФормулы);
	
	ВизуализироватьФормулу();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкуПоАдресуФайла(АдресФайлаИмяФайла)

	Если ЭтоАдресВременногоХранилища(АдресФайлаИмяФайла) Тогда
		ИмяФайла = ПолучитьИмяВременногоФайла("xml");
		ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаИмяФайла);
		ДанныеФайла.Записать(ИмяФайла);
	Иначе
		ИмяФайла = АдресФайлаИмяФайла;
	КонецЕсли;
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ИмяФайла);
	
	ЗагрузитьНастройкуСервер(Чтение);
	
	Если ЭтоАдресВременногоХранилища(АдресФайлаИмяФайла) Тогда
		Попытка
			УдалитьФайлы(ИмяФайла);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Расчеты по родительской плате'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьНовоеЗначениеОперандаВФормулу(ПараметрыОперанда)
	
	Для Каждого СтрокаНастройки Из Объект.Настройки Цикл
	
		Если СтрокаНастройки.НомерСтроки = ТекущийРасчет - 1 Тогда
			Дерево = РеквизитФормыВЗначение("ДеревоФормулы");
			УстановитьНовоеЗначениеОперандаВДерево(ПараметрыОперанда, Дерево);
			ЗначениеВРеквизитФормы(Дерево, "ДеревоФормулы");
		Иначе
			Дерево = ОбщегоНазначения.ЗначениеИзСтрокиXML(СтрокаНастройки.ФормулаСтрокой);
			УстановитьНовоеЗначениеОперандаВДерево(ПараметрыОперанда, Дерево);
			СтрокаНастройки.ФормулаСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(Дерево);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНовоеЗначениеОперандаВДерево(ПараметрыОперанда, Дерево)
	Если ТипЗнч(Дерево) <> Тип("ДеревоЗначений") Тогда
		Возврат;
	КонецЕсли;
	Строки = Дерево.Строки.НайтиСтроки(Новый Структура("ИмяДляФормулы", ПараметрыОперанда.ИмяДляФормулы), Истина);
	Для Каждого Строка Из Строки Цикл
		Строка.Значение        = ПараметрыОперанда.Значение;
		Строка.ВыражениеДляСКД = ЗначениеДляПодстановкиВСКД(ПараметрыОперанда.Значение);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗначениеДляПодстановкиВСКД(ИсходноеЗначение)
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(20, 10));
	Возврат Формат(ОписаниеТипаЧисло.ПривестиЗначение(ИсходноеЗначение), "ЧРД='.';ЧГ='';ЧН=0");
	
КонецФункции

&НаКлиенте
Процедура ДобавитьМатематическийЗнак(Команда)
	
	ИмяЗнака = ?(СтрНачинаетсяС(Команда.Имя, "Добавить"), Сред(Команда.Имя, 9), "");
	Если ПустаяСтрока(ИмяЗнака) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОперанда = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ОписанияМатематическихЗнаков(), ИмяЗнака);
	
	Если СтруктураОперанда = Неопределено Тогда
		ВызватьИсключение "Не правильный параметр " + ИмяЗнака;
	КонецЕсли;
		
	ДобавитьОперанд(СтруктураОперанда);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыДобавляемогоОперанда()
	
	Результат = Новый Структура("Родитель, Индекс");

	Если ТекЭлемент = ИндексПервогоЭлемента Или ДеревоФормулы.ПолучитьЭлементы().Количество() = 0 Тогда
		Результат.Родитель = ДеревоФормулы;
		Результат.Индекс   = 0;
	ИначеЕсли ТекЭлемент >= 0 Тогда
		Операнд = ДеревоФормулы.НайтиПоИдентификатору(ТекЭлемент);
		
		Если Операнд <> Неопределено И Операнд.ИмяДляФормулы = ")" Тогда
			ТекЭлемент = Операнд.ПолучитьРодителя().ПолучитьИдентификатор();
			Результат.Родитель = Операнд.ПолучитьРодителя().ПолучитьРодителя();
		Иначе
			Результат.Родитель = Операнд.ПолучитьРодителя();
		КонецЕсли;
		
		Если Результат.Родитель = Неопределено Тогда
			Результат.Родитель = ДеревоФормулы;
		КонецЕсли;
		
		Результат.Индекс = Результат.Родитель.ПолучитьЭлементы().Индекс(
			ДеревоФормулы.НайтиПоИдентификатору(ТекЭлемент)) + 1;
	ИначеЕсли ТекЭлемент = ИндексПоследнегоЭлемента Тогда
		Операнд = ДеревоФормулы.ПолучитьЭлементы()[ДеревоФормулы.ПолучитьЭлементы().Количество()-1];
		
		Результат.Родитель = ДеревоФормулы;
		Результат.Индекс = ДеревоФормулы.ПолучитьЭлементы().Индекс(
			ДеревоФормулы.НайтиПоИдентификатору(Операнд.ПолучитьИдентификатор())) + 1;
	Иначе
		ВызватьИсключение "Не найдена строка добавляемого операнда";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ОписанияМатематическихЗнаков()
	
	ВсеЗнаки = Новый Структура;
	ВсеЗнаки.Вставить("Плюс",           ПолучитьСтруктуруОперандаМатематическогоЗнака("mathsign", "+",       "+"));
	ВсеЗнаки.Вставить("Минус",          ПолучитьСтруктуруОперандаМатематическогоЗнака("mathsign", "-",       "-"));
	ВсеЗнаки.Вставить("Умножить",       ПолучитьСтруктуруОперандаМатематическогоЗнака("mathsign", "&times;", "*"));
	ВсеЗнаки.Вставить("Разделить",      ПолучитьСтруктуруОперандаМатематическогоЗнака("mathsign", "&divide;", "/"));
	ВсеЗнаки.Вставить("Скобки",         ПолучитьСтруктуруОперандаМатематическогоЗнака("hooks",    "",         ""));
	ВсеЗнаки.Вставить("СкобкиНачало",	ПолучитьСтруктуруОперандаМатематическогоЗнака("hooksbeg", "(",         ""));
	ВсеЗнаки.Вставить("СкобкиКонец",	ПолучитьСтруктуруОперандаМатематическогоЗнака("hooksend", ")",         ""));
	ВсеЗнаки.Вставить("Условие",        ПолучитьСтруктуруОперандаМатематическогоЗнака("ifelse",   "",         ""));
	ВсеЗнаки.Вставить("УсловиеНачало",  ПолучитьСтруктуруОперандаМатематическогоЗнака("ifbeg",	  "?(",         ""));
	ВсеЗнаки.Вставить("УсловиеТогда",	ПолучитьСтруктуруОперандаМатематическогоЗнака("iffirst",  ",",         ""));
	ВсеЗнаки.Вставить("УсловиеИначе",	ПолучитьСтруктуруОперандаМатематическогоЗнака("ifsecond", ",",         ""));
	ВсеЗнаки.Вставить("УсловиеКонец",	ПолучитьСтруктуруОперандаМатематическогоЗнака("ifend",	  ")",         ""));
	ВсеЗнаки.Вставить("Больше",         ПолучитьСтруктуруОперандаМатематическогоЗнака("bools",    "&gt;",     ">"));
	ВсеЗнаки.Вставить("Меньше",         ПолучитьСтруктуруОперандаМатематическогоЗнака("bools",    "&lt;",     "<"));
	ВсеЗнаки.Вставить("БольшеИлиРавно", ПолучитьСтруктуруОперандаМатематическогоЗнака("bools",    "&ge;",     ">="));
	ВсеЗнаки.Вставить("МеньшеИлиРавно", ПолучитьСтруктуруОперандаМатематическогоЗнака("bools",    "&le;",    "<="));
	ВсеЗнаки.Вставить("Равно",          ПолучитьСтруктуруОперандаМатематическогоЗнака("bools",    "=",        "="));
	ВсеЗнаки.Вставить("НеРавно",        ПолучитьСтруктуруОперандаМатематическогоЗнака("bools",    "&ne;",     "<>"));
	Возврат ВсеЗнаки;
	
КонецФункции

&НаКлиенте
Функция МатематическиеЗнакиПоПредставлению()
	
	ВсеЗнакиПоПредставлению = Новый Соответствие;
	
	Для Каждого ЗнакОдинарный Из  МатематическиеЗнакиОдинарные() Цикл
		ВсеЗнакиПоПредставлению.Вставить(ЗнакОдинарный.Ключ, ЗнакОдинарный.Значение);
	КонецЦикла;
	
	Для Каждого ЗнакДвойной Из  МатематическиеЗнакиДвойные() Цикл
		ВсеЗнакиПоПредставлению.Вставить(ЗнакДвойной.Ключ, ЗнакДвойной.Значение);
	КонецЦикла;	
	
	Возврат ВсеЗнакиПоПредставлению;
	
КонецФункции

&НаКлиенте
Функция МатематическиеЗнакиОдинарные()
	
	ЗнакиПоПредставлению = Новый Соответствие;
	
	ЗнакиПоПредставлению.Вставить("+",			"Плюс");
	ЗнакиПоПредставлению.Вставить("-",			"Минус");
	ЗнакиПоПредставлению.Вставить("*",			"Умножить");
	ЗнакиПоПредставлению.Вставить(Символ(215),	"Умножить");
	ЗнакиПоПредставлению.Вставить("/",			"Разделить");
	ЗнакиПоПредставлению.Вставить(Символ(247),	"Разделить");
	ЗнакиПоПредставлению.Вставить(">",			"Больше");
	ЗнакиПоПредставлению.Вставить("<",			"Меньше");
	ЗнакиПоПредставлению.Вставить(Символ(8805),	"БольшеИлиРавно");
	ЗнакиПоПредставлению.Вставить(Символ(8804),	"МеньшеИлиРавно");
	ЗнакиПоПредставлению.Вставить("=",			"Равно");
	ЗнакиПоПредставлению.Вставить(Символ(8800),	"НеРавно");
	
	Возврат ЗнакиПоПредставлению;
	
КонецФункции

&НаКлиенте
Функция МатематическиеЗнакиДвойные()
	
	ЗнакиПоПредставлению = Новый Соответствие;
	
	ЗнакиПоПредставлению.Вставить(">=",			"БольшеИлиРавно");
	ЗнакиПоПредставлению.Вставить("<=",			"МеньшеИлиРавно");
	ЗнакиПоПредставлению.Вставить("<>",			"НеРавно");
	
	Возврат ЗнакиПоПредставлению;
	
КонецФункции

&НаКлиенте
Функция ОперандыПоПредставлению()
	
	ВсеОперандыПоПредставлению = Новый Соответствие;
	
	ВсеГруппыДерева = ДеревоОперандов.ПолучитьЭлементы();
	Для Каждого ГруппаОперандовЭлемент Из ВсеГруппыДерева Цикл
		ОперандыГруппы = ГруппаОперандовЭлемент.ПолучитьЭлементы();
		Для Каждого ОперандЭлемент Из ОперандыГруппы Цикл
			ВсеОперандыПоПредставлению.Вставить(ОперандЭлемент.ИмяДляФормулы, ОперандЭлемент);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ВсеОперандыПоПредставлению;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруОперандаМатематическогоЗнака(ТипОперанда, ИмяДляФормулы, ВыражениеДляСКД)
	
	СтруктураОперанда = СтруктураОперанда();
	СтруктураОперанда.ИмяДляФормулы   = ИмяДляФормулы;
	СтруктураОперанда.Значение        = "";
	СтруктураОперанда.ВыражениеДляСКД = ВыражениеДляСКД;
	СтруктураОперанда.Тип             = ТипОперанда;
	Возврат СтруктураОперанда;
	
КонецФункции

&НаКлиенте
Функция СтруктураОперанда()
	Возврат Новый Структура("ИмяДляФормулы, Значение, ВыражениеДляСКД, Тип");
КонецФункции

&НаСервере
Функция ЗаполнитьФормулуПоТекстуНаСервере(СтрокаДляЧтения)
	
	Построитель = Новый ПостроительDOM;
	ЧтениеHTML = Новый ЧтениеHTML;
	
	ЧтениеHTML.УстановитьСтроку(СтрокаДляЧтения);
	ДокументHTML = Построитель.Прочитать(ЧтениеHTML);    
	
	ИсходныйТекстФормулы = СокрЛП(ДокументHTML.Тело.ТекстовоеСодержимое);
	ИсходныйТекстФормулы = СтрЗаменить(ИсходныйТекстФормулы, Символы.ПС,"");
	ИсходныйТекстФормулы = СтрЗаменить(ИсходныйТекстФормулы, " ","");
	
	Возврат ИсходныйТекстФормулы;
	
КонецФункции

#КонецОбласти
