#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Процедура очищает записи по реквизитам контрольного соотношения
//
// Параметры:
//  КонтрольноеСоотношение	- СправочникСсылка.КонтрольныеСоотношения	-  ссылка на справочник 
//
Процедура ОчиститьРеквизитыКонтрольногоСоотношения(КонтрольноеСоотношение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УсловияКонтрольныхСоотношений.КонтрольноеСоотношение,
	               |	УсловияКонтрольныхСоотношений.ИмяПараметра,
	               |	УсловияКонтрольныхСоотношений.СпособВычисленияПараметра,
	               |	УсловияКонтрольныхСоотношений.УточнениеСпособаОпределения,
	               |	УсловияКонтрольныхСоотношений.ВидАналитикиОтбор,
	               |	УсловияКонтрольныхСоотношений.РеквизитАналитики
	               |ИЗ
	               |	РегистрСведений.УсловияКонтрольныхСоотношений КАК УсловияКонтрольныхСоотношений
	               |ГДЕ
	               |	УсловияКонтрольныхСоотношений.КонтрольноеСоотношение = &КонтрольноеСоотношение
	               |	И ПОДСТРОКА(УсловияКонтрольныхСоотношений.ИмяПараметра, 1, 9) = ""Реквизит_""";
	Запрос.УстановитьПараметр("КонтрольноеСоотношение", КонтрольноеСоотношение);
	
	Записи = Запрос.Выполнить().Выбрать();
	Пока Записи.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.УсловияКонтрольныхСоотношений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Записи);
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры

// Определяет если отбор по переданному контрольному соотношению
//
// Параметры:
//  КонтрольноеСоотношение	 - СправочникСсылка.КонтрольныеСоотношения	 -  ссылка на справочник
// 
// Возвращаемое значение:
//  Булево - истина если есть отбор по реквизитам
//
Функция УстановленОтборКонтрольногоСоотношения(КонтрольноеСоотношение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	УсловияКонтрольныхСоотношений.КонтрольноеСоотношение
	               |ИЗ
	               |	РегистрСведений.УсловияКонтрольныхСоотношений КАК УсловияКонтрольныхСоотношений
	               |ГДЕ
	               |	УсловияКонтрольныхСоотношений.КонтрольноеСоотношение = &КонтрольноеСоотношение
	               |	И ПОДСТРОКА(УсловияКонтрольныхСоотношений.ИмяПараметра, 1, 9) = ""Реквизит_""";
	Запрос.УстановитьПараметр("КонтрольноеСоотношение", КонтрольноеСоотношение);

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецЕсли