#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Определяет список команд заполнения.
//
// Параметры:
//   КомандыЗаполнения - ТаблицаЗначений - Таблица с командами заполнения. Для изменения.
//       См. описание 1 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ЗаполнениеОбъектовПереопределяемый.ПередДобавлениемКомандЗаполнения().
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения, Параметры) Экспорт
	
КонецПроцедуры	

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДокумента(Документ, МассивСтрок)
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	МассивСтрок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	МассивСтрок.НоменклатураПлатежа КАК НоменклатураПлатежа,
	               |	МассивСтрок.Контрагент КАК Контрагент,
	               |	МассивСтрок.Договор КАК Договор,
	               |	МассивСтрок.Сумма КАК Сумма,
	               |	МассивСтрок.КонтактнаяИнформация КАК КонтактнаяИнформация,
	               |	МассивСтрок.ВидКонтактнойИнформации КАК ВидКонтактнойИнформации,
	               |	МассивСтрок.ДополнениеНоменклатуры КАК ДополнениеНоменклатуры
	               |ПОМЕСТИТЬ МассивСтрок
	               |ИЗ
	               |	&МассивСтрок КАК МассивСтрок
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МассивСтрок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	МассивСтрок.НоменклатураПлатежа КАК НоменклатураПлатежа,
	               |	МассивСтрок.Контрагент КАК Контрагент,
	               |	МассивСтрок.Договор КАК Договор,
	               |	МассивСтрок.Сумма КАК Сумма,
	               |	ДанныеДокументовСсылкиНаОплату.СчетНаОплату КАК СчетНаОплату,
	               |	ДанныеДокументовСсылкиНаОплату.СсылкаНаОплату КАК СсылкаНаОплату,
	               |	ДанныеДокументовСсылкиНаОплату.Примечание КАК Примечание,
	               |	ДанныеДокументовСсылкиНаОплату.СтатусОплаты КАК СтатусОплаты,
	               |	ДанныеДокументовСсылкиНаОплату.ЭквайринговаяОперация КАК ЭквайринговаяОперация,
	               |	ДанныеДокументовСсылкиНаОплату.СсылкаОтправлена КАК СсылкаОтправлена,
	               |	&Документ КАК Документ,
	               |	МассивСтрок.КонтактнаяИнформация КАК КонтактнаяИнформация,
	               |	МассивСтрок.ВидКонтактнойИнформации КАК ВидКонтактнойИнформации,
	               |	МассивСтрок.ДополнениеНоменклатуры КАК ДополнениеНоменклатуры
	               |ПОМЕСТИТЬ ДанныеОплаты
	               |ИЗ
	               |	МассивСтрок КАК МассивСтрок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДокументовСсылкиНаОплату КАК ДанныеДокументовСсылкиНаОплату
	               |		ПО МассивСтрок.ИдентификаторСтроки = ДанныеДокументовСсылкиНаОплату.ИдентификаторСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеОплаты.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ДанныеОплаты.НоменклатураПлатежа КАК НоменклатураПлатежа,
	               |	ДанныеОплаты.Контрагент КАК Контрагент,
	               |	ДанныеОплаты.Договор КАК Договор,
	               |	ДанныеОплаты.Сумма КАК Сумма,
	               |	ДанныеОплаты.СчетНаОплату КАК СчетНаОплату,
	               |	ДанныеОплаты.СсылкаНаОплату КАК СсылкаНаОплату,
	               |	ДанныеОплаты.Примечание КАК Примечание,
	               |	ДанныеОплаты.СтатусОплаты КАК СтатусОплаты,
	               |	ДанныеОплаты.ЭквайринговаяОперация КАК ЭквайринговаяОперация,
	               |	ЕСТЬNULL(ДанныеОплаты.СсылкаОтправлена, ЛОЖЬ) КАК СсылкаОтправлена,
	               |	ДанныеОплаты.Документ КАК Документ,
	               |	ДанныеОплаты.КонтактнаяИнформация КАК КонтактнаяИнформация,
	               |	ДанныеОплаты.ВидКонтактнойИнформации КАК ВидКонтактнойИнформации,
	               |	ДанныеОплаты.ДополнениеНоменклатуры КАК ДополнениеНоменклатуры
	               |ИЗ
	               |	ДанныеОплаты КАК ДанныеОплаты";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивСтрок"	, МассивСтрок);
	Запрос.УстановитьПараметр("Документ"	, Документ);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции	

Процедура ЗаписатьДанныеВРегистр(ДанныеСтроки)
	
	МенеджерЗаписи 							= РегистрыСведений.ДанныеДокументовСсылкиНаОплату.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ 				= ДанныеСтроки.Документ;
	МенеджерЗаписи.ИдентификаторСтроки 		= ДанныеСтроки.ИдентификаторСтроки;
	МенеджерЗаписи.СсылкаНаОплату 			= ДанныеСтроки.СсылкаНаОплату;
	МенеджерЗаписи.СчетНаОплату 			= ДанныеСтроки.СчетНаОплату;
	МенеджерЗаписи.Примечание 				= ДанныеСтроки.Примечание;
	МенеджерЗаписи.СтатусОплаты 			= ДанныеСтроки.СтатусОплаты;
	МенеджерЗаписи.ЭквайринговаяОперация 	= ДанныеСтроки.ЭквайринговаяОперация;
	МенеджерЗаписи.СсылкаОтправлена 		= ДанныеСтроки.СсылкаОтправлена; 
	МенеджерЗаписи.Записать();
	
КонецПроцедуры	

Функция СформироватьСчетаИСсылкиДлительнаяОперация(ПараметрыОперации) Экспорт 
	
	ДанныеДокумента = ПолучитьДанныеДокумента(ПараметрыОперации.ДокументСсылка, ПараметрыОперации.ПараметрыОплаты);
	
	Для Каждого Оплата Из ДанныеДокумента Цикл 
		Если НЕ ЗначениеЗаполнено(Оплата.СчетНаОплату) Тогда 
			Оплата.СчетНаОплату = СоздатьСчетНаОплату(ПараметрыОперации.Организация, ПараметрыОперации.ПараметрыДоговораЭквайринга, Оплата);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Оплата.СчетНаОплату) И Не Оплата.СсылкаОтправлена Тогда 
			ПараметрыСсылки 		= Новый Структура("ДокументОплаты, НастройкаИнтеграции", Оплата.СчетНаОплату, ПараметрыОперации.НастройкаСБП);
			Результат 				= ИнтеграцияССервисомПриемаПлатежейБГУ.ИдентификаторОплатыВПлатежнойСистемеСБП(ПараметрыСсылки);
			Оплата.СсылкаНаОплату 	= Результат.ПлатежнаяСсылка;
			Оплата.Примечание 		= Результат.ИнформацияОбОшибке;
		КонецЕсли;                
		
		ЗаписатьДанныеВРегистр(Оплата);
	КонецЦикла;	
	
КонецФункции

Функция СоздатьСчетНаОплату(Организация, ПараметрыДоговораЭквайринга, СтрокаТаблицы)
	
	Организация = Организация;
	СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	
	ДокументОбъект = Документы.СчетНаОплату.СоздатьДокумент();
	ДокументОбъект.Организация 		= Организация;
	ДокументОбъект.Дата 			= ТекущаяДата();
	ДокументОбъект.СуммаДокумента 	= СтрокаТаблицы.Сумма;
	ДокументОбъект.Контрагент 		= СтрокаТаблицы.Контрагент;
	ДокументОбъект.Договор 			= СтрокаТаблицы.Договор;
	ДокументОбъект.Комментарий 		= НСтр("ru='Оплата через СБП'"); 
	ДокументОбъект.СуммаВключаетНДС = Истина;
	Если ЗначениеЗаполнено(ПараметрыДоговораЭквайринга) Тогда 
		РеквизитыДоговораЭквайринга = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыДоговораЭквайринга, "КФО, СтавкаНДС");
		ДокументОбъект.КФО = РеквизитыДоговораЭквайринга.КФО;
		СтавкаНДС = РеквизитыДоговораЭквайринга.СтавкаНДС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.НоменклатураПлатежа) Тогда
		ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.НоменклатураПлатежа, "ТипНоменклатуры");
		ТипыНоменклатурыУслуга = РозничныеПродажиБГУ.ТипыУслугРабот();
		Если ТипыНоменклатурыУслуга.Найти(ТипНоменклатуры) = Неопределено Тогда
			НоваяСтрока = ДокументОбъект.Материалы.Добавить();
		Иначе
			НоваяСтрока = ДокументОбъект.Услуги.Добавить();
		КонецЕсли;
		НоваяСтрока.Номенклатура 	= СтрокаТаблицы.НоменклатураПлатежа;  
		НоваяСтрока.Количество 		= 1;
		НоваяСтрока.Цена 			= СтрокаТаблицы.Сумма;
		НоваяСтрока.СтавкаНДС 		= СтавкаНДС;
		СтавкаНДСЧисло 				= УчетНДСКлиентСервер.ЗначениеСтавкиНДС(СтавкаНДС);
		НоваяСтрока.СуммаНДС 		= СтрокаТаблицы.Сумма * СтавкаНДСЧисло / 100;
		НоваяСтрока.Сумма 			= СтрокаТаблицы.Сумма;
		НоваяСтрока.Всего 			= СтрокаТаблицы.Сумма;
	КонецЕсли;
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Возврат ДокументОбъект.Ссылка;
		
КонецФункции

Функция ОтправитьСсылкиДлительнаяОперация(ПараметрыОперации) Экспорт 
	
	ДанныеДокумента = ПолучитьДанныеДокумента(ПараметрыОперации.ДокументСсылка, ПараметрыОперации.ПараметрыОплаты);
	
	Для Каждого СтрокаСсылка Из ДанныеДокумента Цикл 
		Если ЗначениеЗаполнено(СтрокаСсылка.СсылкаНаОплату) И НЕ СтрокаСсылка.СсылкаОтправлена Тогда 
			ПараметрыОплаты = Новый Структура;
			ПараметрыОплаты.Вставить("Ссылка"					, СтрокаСсылка.СсылкаНаОплату);
			ПараметрыОплаты.Вставить("КонтактнаяИнформация"		, СтрокаСсылка.КонтактнаяИнформация);
			ПараметрыОплаты.Вставить("СуммаОплаты"				, СтрокаСсылка.Сумма);
			ПараметрыОплаты.Вставить("СчетНаоплату"				, СтрокаСсылка.СчетНаОплату);
			ПараметрыОплаты.Вставить("Номенклатура"				, СтрокаСсылка.НоменклатураПлатежа);
			ПараметрыОплаты.Вставить("ДополнениеНоменклатуры"	, СтрокаСсылка.ДополнениеНоменклатуры);
			ПараметрыОплаты.Вставить("Организация"				, ПараметрыОперации.Организация);
			ПараметрыОплаты.Вставить("НастройкаСБП"				, ПараметрыОперации.НастройкаСБП);
			Если СтрокаСсылка.ВидКонтактнойИнформации = 0 И ПараметрыОперации.ОтправкаSMSВозможна Тогда
				РезультатОтправки 		= ОтправитьСсылкуSMS(ПараметрыОплаты);
				СтрокаСсылка.Примечание = РезультатОтправки;
			КонецЕсли; 
			Если СтрокаСсылка.ВидКонтактнойИнформации = 1 И ПараметрыОперации.ОтправкаEmailВозможна Тогда  
				РезультатОтправки 		= ОтправитьСсылкуEmail(ПараметрыОплаты);
				СтрокаСсылка.Примечание = РезультатОтправки;
			КонецЕсли;
			Если СтрокаСсылка.Примечание = "Ссылка отправлена" Тогда 
				СтрокаСсылка.СсылкаОтправлена = Истина;
			КонецЕсли;	
		КонецЕсли;
		
		ЗаписатьДанныеВРегистр(СтрокаСсылка);
	КонецЦикла; 
	
КонецФункции

Функция ОтправитьСсылкуSMS(ПараметрыОплаты)
	
	НомераПолучателей = Новый Массив;
	НомераПолучателей.Добавить(ПараметрыОплаты.КонтактнаяИнформация);
	ТекстСообщения = "Вам выставлен счет на сумму " + Формат(ПараметрыОплаты.СуммаОплаты, "ЧФ=""Ч руб.""") + Символы.ПС +
					"Получатель: " + НаименованиеОрганизации(ПараметрыОплаты.Организация) + Символы.ПС +
					"Предмет расчета: " + ПараметрыОплаты.Номенклатура + ". " + ПараметрыОплаты.ДополнениеНоменклатуры + Символы.ПС +
					"Счет можно оплатить, перейдя по ссылке: " + ПараметрыОплаты.Ссылка;
	Результат = ОтправкаSMS.ОтправитьSMS(НомераПолучателей, ТекстСообщения);
	Если Результат.Свойство("ОписаниеОшибки") И Результат.ОписаниеОшибки <> "" Тогда 
		Возврат Результат.ОписаниеОшибки;
	Иначе
		Возврат НСтр("ru = 'Ссылка отправлена'");
	КонецЕсли;	
	
КонецФункции

Функция ОтправитьСсылкуEmail(ПараметрыОплаты)
	
	УчетнаяЗапись 	= РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	Письмо 			= ПодготовитьПисьмо(УчетнаяЗапись, ПараметрыОплаты);
	Результат 		= РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗапись, Письмо);
	Если Результат.ОшибочныеПолучатели.Количество() > 0 Тогда
		Возврат Результат[0].Значение;
	Иначе
		Возврат НСтр("ru = 'Ссылка отправлена'");
	КонецЕсли;
	
КонецФункции

Функция ПодготовитьПисьмо(УчетнаяЗапись, ПараметрыОплаты)
	
	ПараметрыПисьма = ПараметрыПисьма(ПараметрыОплаты);
	Возврат РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(УчетнаяЗапись, ПараметрыПисьма);
	
КонецФункции 

Функция ПараметрыПисьма(ПараметрыОплаты)
	
	ИдентификаторВложения 	= Новый УникальныйИдентификатор;
	ДанныеQRКода 			= ПоместитьВоВременноеХранилище(СистемаБыстрыхПлатежей.ИзображениеQRКодаСБП(ПараметрыОплаты.Ссылка, 360, 0));
	ФайлВложения 			= Новый Структура("Представление, АдресВоВременномХранилище, Идентификатор", "QR-код", ДанныеQRКода, ИдентификаторВложения);
	Вложения 				= Новый Массив(); 
	Вложения.Добавить(ФайлВложения);
	
	ТелоПисьма = "Вам выставлен счет на сумму " + Формат(ПараметрыОплаты.СуммаОплаты, "ЧФ=""Ч руб.""") + "<br>" +
				"Получатель: " + НаименованиеОрганизации(ПараметрыОплаты.Организация) + "<br>" +
				"Предмет расчета: " + ПараметрыОплаты.Номенклатура + ". " + ПараметрыОплаты.ДополнениеНоменклатуры + "<br>" +
				"Для оплаты отсканируйте QR-код в Вашем мобильном банковском приложении или перейдите по ссылке для  выбора приложения банка." + "<br>" +
				"Ссылка на оплату: " + ПараметрыОплаты.Ссылка + "<br>" + 
				"<p><img height=""300"" src=""cid:" + ИдентификаторВложения + """ style=""border:none;"" width=""300""/></p>";
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому "		, ПараметрыОплаты.КонтактнаяИнформация);
	ПараметрыПисьма.Вставить("Тема"			, "Счет на оплату через СБП на сумму " + Формат(ПараметрыОплаты.СуммаОплаты, "ЧФ=""Ч руб."""));
	ПараметрыПисьма.Вставить("Тело"			, ТелоПисьма); 
	ПараметрыПисьма.Вставить("Вложения" 	, Вложения);
	ПараметрыПисьма.Вставить("ТипТекста" 	, Перечисления.ТипыТекстовЭлектронныхПисем.HTMLСКартинками);
	
	Возврат ПараметрыПисьма;
	
КонецФункции 

Функция НаименованиеОрганизации(Организация)

	НаименованиеОрганизации = "";
	Если ЗначениеЗаполнено(Организация) Тогда 
		НаименованиеОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "НаименованиеСокращенное");
		Если Не ЗначениеЗаполнено(НаименованиеОрганизации) Тогда 
			НаименованиеОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Наименование");
		КонецЕсли;
	КонецЕсли;
	Возврат НаименованиеОрганизации;
	
КонецФункции	

Функция ПроверитьСостояниеОплатыДлительнаяОперация(ПараметрыОперации) Экспорт 
	
	ДанныеДокумента = ПолучитьДанныеДокумента(ПараметрыОперации.ДокументСсылка, ПараметрыОперации.ПараметрыОплаты);
	
	Для Каждого СтрокаСсылка Из ДанныеДокумента Цикл 
		Если Не ЗначениеЗаполнено(СтрокаСсылка.ЭквайринговаяОперация) Тогда 
			СостояниеОплаты = ПереводыСБПc2b.СтатусОплаты(СтрокаСсылка.СчетНаОплату, ПараметрыОперации.НастройкаСБП, Ложь);	
			СтрокаСсылка.СтатусОплаты = СостояниеОплаты.СтатусОперации; 
			Если СтрокаСсылка.СтатусОплаты = "Ошибка" Тогда 
				СтрокаСсылка.Примечание = СостояниеОплаты.СообщениеОбОшибке;
			КонецЕсли; 
			Если СтрокаСсылка.СтатусОплаты = "Выполнена" Тогда  
				Операция = Новый Структура;
				Операция.Вставить("ДатаОплаты"					, ТекущаяДата());
				Операция.Вставить("ВидОперации"					, Перечисления.ВидыОперацииЭквайринга.ОплатаЧерезСервисПриемаПлатежей);
				Операция.Вставить("ПараметрыДоговораЭквайринга"	, ПараметрыОперации.ПараметрыДоговораЭквайринга);
				Операция.Вставить("СуммаДокумента"				, СтрокаСсылка.Сумма);  
				Операция.Вставить("Счет"						, СтрокаСсылка.СчетНаОплату);
				СтрокаСсылка.ЭквайринговаяОперация = ИнтеграцияССервисомПриемаПлатежейБГУ.СоздатьЭквайринговуюОперациюПриЗагрузкеИзСБП(Операция);
			КонецЕсли;
		КонецЕсли;
		
		ЗаписатьДанныеВРегистр(СтрокаСсылка);
	КонецЦикла;	
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ОтправитьСсылкиДлительнаяОперация", Истина);
	Методы.Вставить("ПроверитьСостояниеОплатыДлительнаяОперация", Истина);
	Методы.Вставить("СформироватьСчетаИСсылкиДлительнаяОперация", Истина);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
