#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Форматирует сумму банковского платежного документа
//
// Параметры:
//  Сумма - число - реквизит, который надо отформатировать
//  ВыводитьСуммуБезКопеек - булево - флаг представления суммы без копеек
//
// Возвращаемое значение
//  Строка - Отформатированная строка
//
Функция ФорматироватьСуммуПлатежногоДокумента(Сумма, ВыводитьСуммуБезКопеек = Ложь) Экспорт
	
	Результат  = Сумма;
	ЦелаяЧасть = Цел(Сумма);
	
	Если Результат = ЦелаяЧасть Тогда
		Если ВыводитьСуммуБезКопеек Тогда
			Результат = Формат(Результат, "ЧДЦ=2; ЧРД='='; ЧГ=0");
			Результат = Лев(Результат, Найти(Результат, "="));
		Иначе
			Результат = Формат(Результат, "ЧДЦ=2; ЧРД='-'; ЧГ=0");
		КонецЕсли;
	Иначе
		Результат = Формат(Результат, "ЧДЦ=2; ЧРД='-'; ЧГ=0");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ФорматироватьСуммуПлатежногоДокумента()

//* Форматирует сумму прописью банковского платежного документа
//
// Параметры:
//  Сумма - число - реквизит, который надо представить прописью 
//  Валюта - СправочникСсылка.Валюты - валюта, в которой нужно представить сумму
//  ВыводитьСуммуБезКопеек - булево - флаг представления суммы без копеек
//
// Возвращаемое значение
//  Строка - Отформатированная строка
//
Функция ФорматироватьСуммуПрописьюПлатежногоДокумента(Сумма, Валюта, ВыводитьСуммуБезКопеек = Ложь) Экспорт
	
	Результат     = Сумма;
	ЦелаяЧасть    = Цел(Сумма);
	ФорматСтрока  = "Л=ru_RU; ДП=Ложь";
	Если ТипЗнч(Валюта) = Тип("СправочникСсылка.Валюты") Тогда
		ПарамПредмета = Валюта.ПараметрыПрописи;
	Иначе
		ПарамПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	КонецЕсли;	
	
	Если Результат = ЦелаяЧасть Тогда
		Если ВыводитьСуммуБезКопеек Тогда
			Результат = ЧислоПрописью(Результат, ФорматСтрока, ПарамПредмета);
			Результат = Лев(Результат, Найти(Результат, "0") - 1);
		Иначе
			Результат = ЧислоПрописью(Результат, ФорматСтрока, ПарамПредмета);
		КонецЕсли;
	Иначе
		Результат = ЧислоПрописью(Результат, ФорматСтрока, ПарамПредмета);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ФорматироватьСуммуПрописьюПлатежногоДокумента()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Объявление") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Объявление", "Объявление на взнос наличных", ПечатьОбъявления(МассивОбъектов, ОбъектыПечати, "Объявление"));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Объявление3352У") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Объявление3352У", "Объявление на взнос наличных (3352-У)", ПечатьОбъявления(МассивОбъектов, ОбъектыПечати, "Объявление3352У"));
		
	КонецЕсли;
		
КонецПроцедуры // Печать()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ОбъявлениеНаВзносНаличными";
	КомандаПечати.Идентификатор		= "Объявление3352У";
	КомандаПечати.Представление		= НСтр("ru = 'Объявление на взнос наличными (ф. 0402001) в ред. указания 3352-У'");
	КомандаПечати.Порядок			= 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ОбъявлениеНаВзносНаличными";
	КомандаПечати.Идентификатор		= "Объявление";
	КомандаПечати.Представление		= НСтр("ru = 'Объявление на взнос наличными (ф. 0402001)'");
	КомандаПечати.Порядок			= 2;
		
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует печатные формы документов
//
// Параметры
//  МассивОбъктов  - Массив - Массив ссылок на объекты которые нужно распечатать
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//
// Возвращаемое значение:
//   ТабличныйДокумент   - Результирующая таблица, содржащая печатный формы документов
//
Функция ПечатьОбъявления(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_Объявление";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОбъявлениеНаВзносНаличными.ПФ_MXL_" + ИмяМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ОбъявлениеНаВзносНаличными.Ссылка,
	|	ОбъявлениеНаВзносНаличными.Номер,
	|	ОбъявлениеНаВзносНаличными.Дата,
	|	ОбъявлениеНаВзносНаличными.Организация,
	|	ОбъявлениеНаВзносНаличными.ИсточникПоступления,
	|	ОбъявлениеНаВзносНаличными.ЛицевойСчет,
	|	ОбъявлениеНаВзносНаличными.РеквизитыЛицевогоСчета,
	|	ОбъявлениеНаВзносНаличными.ПечатьСуммыВКвитанции,
	|	ОбъявлениеНаВзносНаличными.СуммаДокумента,
	|	ОбъявлениеНаВзносНаличными.ОтКого,
	|	ОбъявлениеНаВзносНаличными.ОтКогоСчет,
	|	ОбъявлениеНаВзносНаличными.ИНН,
	|	ОбъявлениеНаВзносНаличными.КПП,
	|	ОбъявлениеНаВзносНаличными.ОКАТО,
	|	ОбъявлениеНаВзносНаличными.Получатель,
	|	ОбъявлениеНаВзносНаличными.РасчетныйСчет КАК ПолучательСчет,
	|	ОбъявлениеНаВзносНаличными.БанкВноситель,
	|	ОбъявлениеНаВзносНаличными.БанкПолучатель,
	|	ОбъявлениеНаВзносНаличными.БИКБанкаВносителя,
	|	ОбъявлениеНаВзносНаличными.БИКБанкаПолучателя,
	|	ОбъявлениеНаВзносНаличными.Символы.(
	|		Символ,
	|		Сумма,
	|		НомерСтроки
	|	) КАК СписокСимволов,
	|	ЛОЖЬ КАК МесяцПрописью,
	|	ЛОЖЬ КАК СуммаБезКопеек
	|ИЗ
	|	Документ.ОбъявлениеНаВзносНаличными КАК ОбъявлениеНаВзносНаличными
	|ГДЕ
	|	ОбъявлениеНаВзносНаличными.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов",МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;

	Пока Шапка.Следующий() Цикл

		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент  	= Ложь;
		ОбластьШапка        = Макет.ПолучитьОбласть("Объявление");
    	НомерСтрокиНачало 	= ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьШапка.Параметры.Заполнить(Шапка);

		
		Если ИмяМакета = "Объявление" Тогда
			
			ОбластьШапка.Параметры.Заполнить(ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(Шапка.Дата));
			
		КонецЕсли;
		
		ПараметрыСуммы = Новый Структура;
		ПараметрыСуммы.Вставить("СуммаЧислом", ФорматироватьСуммуПлатежногоДокумента(Шапка.СуммаДокумента, Шапка.СуммаБезКопеек));
		ПараметрыСуммы.Вставить("СуммаПрописью", ФорматироватьСуммуПрописьюПлатежногоДокумента(Шапка.СуммаДокумента, ,Шапка.СуммаБезКопеек));
		Если Шапка.ПечатьСуммыВКвитанции Тогда
			ПараметрыСуммы.Вставить("СуммаЧисломКв", ПараметрыСуммы.СуммаЧислом);
			ПараметрыСуммы.Вставить("СуммаПрописьюКв", ПараметрыСуммы.СуммаПрописью);
		КонецЕсли;
		
		ОбластьШапка.Параметры.Заполнить(ПараметрыСуммы);
				
		МаксимальноСимволов = 0;
		
		Если ИмяМакета = "Объявление" Тогда
			 МаксимальноСимволов = 4
		ИначеЕсли  ИмяМакета = "Объявление3352У" Тогда
			 МаксимальноСимволов = 3
        КонецЕсли;
		
		СписокСимволов = Шапка.СписокСимволов.Выбрать();
		
		Пока СписокСимволов.следующий() Цикл
			
			Если СписокСимволов.НомерСтроки > МаксимальноСимволов Тогда
				Прервать;
			КонецЕсли;
			
			СуммыПоСимв = Новый Структура("Симв" + СписокСимволов.НомерСтроки + ", " + "Сумма"+СписокСимволов.НомерСтроки,
			СписокСимволов.Символ, ФорматироватьСуммуПлатежногоДокумента(СписокСимволов.Сумма, Шапка.СуммаБезКопеек));
			
			ОбластьШапка.Параметры.Заполнить(СуммыПоСимв);
			
		КонецЦикла;
		
		Если Шапка.ПечатьСуммыВКвитанции Тогда
			ТабличныйДокумент.Вывести(ОбластьШапка);
		Иначе
			Шапка1 = ОбластьШапка.ПолучитьОбласть("Шапка_Объявления");
			ТабличныйДокумент.Вывести(Шапка1);
			ОблСумма = Макет.ПолучитьОбласть("Сумма_Квитанции");
			ТабличныйДокумент.Вывести(ОблСумма);
			Подвал1 = ОбластьШапка.ПолучитьОбласть("Подвал_Объявления");
			ТабличныйДокумент.Вывести(Подвал1);
		КонецЕсли;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
		
КонецФункции // ПечатьОбъявления()

#КонецОбласти

#КонецЕсли
