#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем URIПространстваИменСодержимого;// пространства имен содержимого

#Область ПрограммныйИнтерфейс	

Процедура ВыгрузитьКлассификаторы(МассивПараметры,УИД,Адрес) Экспорт

	Перем ЗаписьXMLСодержимого;
	Перем ЗаписьXMLСвойств;
	
	//ИмяФайла = ЭтотОбъект.ПутьВыгрузкиПоставки;
	//
	//Если ПустаяСтрока(ИмяФайла) Тогда
	//	ВызватьИсключение НСтр("ru = 'Имя файла не задано.'");
	//КонецЕсли;
	//		
	ИмяВремФайла = ПолучитьИмяВременногоФайла();
	// Создаем пакет.
	Пакет = ПакетныеФайлыOPC.ЗаписьСоздать(ИмяВремФайла,УровеньСжатияZIP.Оптимальный);
	
	ИнициализироватьЗаписьПакета(Пакет, "exf",
		"urn:rels-1c-ru:exchange:format/exf-catalog",
		ЗаписьXMLСодержимого);
		
	ВыгрузкаЗагрузкаСлужебныхДанных.УниверсальнаяВыгрузкаСправочников(ИмяВремФайла, МассивПараметры, 
		ЭтотОбъект.ОписаниеПоставки, ТекущаяДатаСеанса(),ЗаписьXMLСодержимого);  
		
	ДатаМодификации = ТекущаяУниверсальнаяДата();
	
	// Устанавливаем ядерные свойства пакетного документа.
	СвойстваПакета = ПакетныеФайлыOPC.ЗаписьПолучитьСтруктуруЯдерныхСвойств(Пакет);
	СвойстваПакета["dcterms:modified"] = ДатаМодификации;
	СвойстваПакета["dc:creator"]       = Поставщик;
	СвойстваПакета["dc:title"]         = НСтр("ru = 'Форматы обмена с казначейством/банком'");
	СвойстваПакета["dc:description"]   = ЭтотОбъект.ОписаниеПоставки;
	СвойстваПакета["dc:identifier"]    = ЭтотОбъект.Поставка.ИдентификаторПоставки;
	СвойстваПакета["dc:language"]      = НСтр("ru = '0x419'");
	СвойстваПакета["cp:subject"]       = Строка(ЭтотОбъект.Поставка);
	// Добавлено свойство - "версия", в которое устанавливается значение "10", означающее, что форматы выгружены из 10 релиза БГУ 2.
	// Предполагается, что в поставке с версией "10" будут уже доработанные под новый синтаксис/механизм форматы.
	СвойстваПакета["cp:version"]       = "10";
	
	// Формируем пакет.
	ПакетныеФайлыOPC.ЗаписьЗакрыть(Пакет);
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВремФайла),УИД);

КонецПроцедуры

Процедура ИнициализироватьЗаписьПакета(Знач Пакет, Знач ИмяКлассификатора, Знач URIТипаСвязи, ЗаписьXMLСодержимого)
	
	КаталогКлассификаторов = "/";
	ИмяФайлаСодержимого    = "/content.xml";
	
	ИмяЧастиСодержимого = КаталогКлассификаторов + ИмяКлассификатора + ИмяФайлаСодержимого;
	
	ЗаписьXMLСодержимого = ПакетныеФайлыOPC.ЗаписьДобавитьXMLЧасть(Пакет,
		ИмяЧастиСодержимого,
		"application/vnd.1c-dept74.exchange-format+xml");
	ПакетныеФайлыOPC.ЗаписьДобавитьСвязь(Пакет, "", URIТипаСвязи, ИмяЧастиСодержимого,, ИмяКлассификатора);
	
КонецПроцедуры

#КонецОбласти

URIПространстваИменСодержимого = "urn:schemas-1c-ru:exchange:format/2012/content";

#КонецЕсли