
Процедура ДополнитьМассивПодсистем(МассивПодсистем) Экспорт
	//В данной процедуре можно дополнить массив подсистем, своими подсистемами
	//объекты которых должны быть доступны для свертки.
	
КонецПроцедуры

// Процедура - Дополнить настройки свертки подчиненных регистров
//
// Параметры:
//  ТаблицаНастроек	 - ТаблицаЗначений - Таблица настроек по разделам
//	 Колонки таблицы:
//		Документ		- Объект метаданных - документ, в который будут сворачиваться данные раздела
//		РазделУчета		- Перечисление.РазделыУчетаДляВводаОстатков	- для документа "ВводНачальныхОстатков" раздел учета ввода остатков 
//		ТиповаяОперация	- Справочник.ТиповыеОперации - типовая операция, с которой будут созданы документы
//		ТекстЗапроса	- Строка - текст запроса обхода, которым получаются разрезы, в которых будут созданы документы 
//		СписокСчетов	- Строка - коды счетов, подставляется в запрос обхода и при получении остатков по регистру бухгалтерии
//		КлючОтбора		- Строка - поля, по которым соединяются регистры
//		Ограничение		- Число  - количество объектов (или записей, если раздел с одним регистром) в одном документе
//		Регистры		- ТаблицаЗначений - таблица с настройками способа свертки регистров
//		Комментарий		- Строка - комментарий, который будет добавлен в документ
//
Процедура ДополнитьНастройкиСверткиПодчиненныхРегистров(ТаблицаНастроек) Экспорт
	
КонецПроцедуры

// Процедура - Дополнить настройки свертки неподчиненных регистров
//
// Параметры:
//  ТаблицаНастроек	 - ТаблицаЗначений - Таблица настроек по регистрам
//	 Колонки таблицы:
//		ТипОбъекта			- Строка	- тип регистра (РегистрСведений, РегистрНакопления, РегистрБухгалтерии)
//		ИмяОбъекта			- Строка	- имя регистра (Синоним)
//		СпособСвертки		- Строка	- способ свертки регистра (Не сворачивать, Свернуть, {Перенести}, Очистить)
//		ДополнительныеПоля	- Структура	- ключ: имя поля таблицы, значение: формула поля
//		ПолеОрганизации		- Строка	- имя поля регистра, содержащего организацию
//
Процедура ДополнитьНастройкиСверткиНеподчиненныхРегистров(ТаблицаНастроек) Экспорт
	
КонецПроцедуры

// Процедура - Настроить состав сворачиваемых документов
//
// Параметры:
// СписокДокументов - Структура - Ключ: Имя документа; Значение: Помечать / Не помечать;
//
// Можно изменить способ свертки документа
//
Процедура НастроитьСоставСворачиваемыхДокументов(СписокДокументов) Экспорт
	
КонецПроцедуры
