#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УстановитьПоУмолчанию() Экспорт
	
	ВалютаСсылка = Справочники.Валюты.НайтиПоКоду("643");  
	Если ВалютаСсылка.Пустая() Тогда
		ВалютаОбъект = Справочники.Валюты.СоздатьЭлемент();
	Иначе
		ВалютаОбъект = ВалютаСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ВалютаОбъект.Код					= "643";                            
	ВалютаОбъект.Наименование			= "RUB";                
	ВалютаОбъект.НаименованиеПолное		= "Российский рубль";
	ВалютаОбъект.ПараметрыПрописи		= "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2 знака";
	ВалютаОбъект.СпособУстановкиКурса	= ПредопределенноеЗначение("Перечисление.СпособыУстановкиКурсаВалюты.РучнойВвод");
	ВалютаОбъект.Записать();	
	
	Константы.ВалютаРегламентированногоУчета.Установить(ВалютаОбъект.Ссылка);
	
КонецПроцедуры

#КонецЕсли