
#Область ОписаниеПеременных

&НаКлиенте
Перем ИзмененоФИО;

&НаКлиенте
Перем ФормаФизическогоЛица;

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Перем ОтключитьЗаполнениеПоИНН;
&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если ПравоДоступа("Добавление", Метаданные.Справочники.ЮридическиеЛица) Тогда
		ДоступныеВидыКонтрагентов.Добавить(ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо"));
	КонецЕсли;
	Если ПравоДоступа("Добавление", Метаданные.Справочники.ФизическиеЛица) Тогда
		ДоступныеВидыКонтрагентов.Добавить(ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо"));
	КонецЕсли;
	Если ПравоДоступа("Добавление", Метаданные.Справочники.Контрагенты) Тогда
		ДоступныеВидыКонтрагентов.Добавить(ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.УчетнаяГруппа"));
	КонецЕсли;

	Если Параметры.Ключ.Пустая() Тогда
		ИнициализироватьНовыйЭлемент();
		ЗаполнитьРеквизитыПоТекстуЗаполнения(Параметры.ТекстЗаполнения, Отказ); 
	КонецЕсли; 
	
	УстановитьВидимостьРеквизитовКонтрагента();

	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект,
			"ПараметрыКонтактнойИнформации") Тогда
		
		Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, ФизическоеЛицо, "КонтактнаяИнформация");
		ИначеЕсли Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, ЮридическоеЛицо, "КонтактнаяИнформация");
		КонецЕсли;
		
	КонецЕсли;
	
	// Обработчик подсистемы "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("Объект", Объект); 
	ПараметрыОтображенияМеток = УправлениеСвойствами.ПараметрыОтображенияМеток();
	ПараметрыОтображенияМеток.ИмяЭлементаДляРазмещенияМеток = "ГруппаМетки";
	ПараметрыОтображенияМеток.МаксимумМетокНаФорме = 3;
	ПараметрыОтображенияМеток.ВариантОтображенияМеток = Перечисления.ВариантыОтображенияМеток.Картинка;
	ДополнительныеПараметры.Вставить("ПараметрыОтображенияМеток", ПараметрыОтображенияМеток);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
		
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереКонтрагент(ЭтотОбъект, Параметры);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыПриСозданииНаСервере = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаСправочника();
	ПараметрыПриСозданииНаСервере.Форма                 = ЭтотОбъект;
	ПараметрыПриСозданииНаСервере.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаСправочника(ПараметрыПриСозданииНаСервере);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	ПараметрыПроцедуры = Новый Структура("ВариантОтображения", "Многострочный"); 
	ПараметрыОтображения = СПАРКРискиКлиентСервер.ПараметрыОтображенияДанныхСПАРК();
	СПАРКРиски.ПриСозданииНаСервере(
	ЭтотОбъект,
	Объект,
	Объект.Ссылка,
	?(Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо"), 
		ПредопределенноеЗначение("Перечисление.ВидыКонтрагентовСПАРКРиски.ИндивидуальныйПредприниматель"),
		ПредопределенноеЗначение("Перечисление.ВидыКонтрагентовСПАРКРиски.ЮридическоеЛицо")),
	ПараметрыОтображения);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски   
		
	// Команды1СПАРКРиски
	СПАРКРиски.ДобавитьПодключаемыеКомандыКонтрагента(ЭтотОбъект, Объект, Элементы.Подменю1СПАРКРиски);
	// Конец Команды1СПАРКРиски
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом 
	
	// СтандартныеПодсистемы.СклонениеПредставленийОбъектов
	СклонениеПредставленийОбъектов.ПриСозданииНаСервере(ЭтотОбъект, Объект.НаименованиеСокращенное);  
	// Конец СтандартныеПодсистемы.СклонениеПредставленийОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьДоступностьГоловнойОрганизации();
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ПриОткрытииКонтрагент(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства  
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если НЕ Элементы.Найти("РеквизитыФизическогоЛица") = Неопределено 
		И Элементы.РеквизитыФизическогоЛица.Видимость 
		И Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда 
		КорреспондентыКлиент.ОбновитьОтображениеПолейВводаГражданства(ЭтотОбъект);
		ПроверитьУдостоверениеЛичности();
	КонецЕсли;	
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	СПАРКРискиКлиент.ПриОткрытии(ЭтотОбъект, Объект);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыПриОткрытии = ОбменСКонтрагентамиКлиент.ПараметрыПриОткрытии();
	ПараметрыПриОткрытии.Форма                            = ЭтотОбъект;
	ПараметрыПриОткрытии.МестоРазмещенияКоманд            = Элементы.КомандыЭДО;
	ПараметрыПриОткрытии.ЕстьОбработчикОбновитьКомандыЭДО = Истина;
	
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ПараметрыПриОткрытии);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьДанныеКонтрагента();
	ИнициализироватьРегистрыКонтрагентаДляРедактированияВФорме();
		
	Если ЗначениеЗаполнено(ТекущийОбъект.ЮридическоеФизическоеЛицо) Тогда
		ОбщегоНазначенияклиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФизическоеЛицоНаименование", "КнопкаОткрытия", Истина);
		ОбщегоНазначенияклиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЮридическоеЛицоНаименование", "КнопкаОткрытия", Истина);
	Иначе
		Элементы.ЮридическоеЛицоНаименование.КнопкаВыбора = Истина;
		Элементы.ФизическоеЛицоНаименование.КнопкаВыбора  = Истина;
		ФизическоеЛицоСсылка 	= Справочники.ФизическиеЛица.ПолучитьСсылку();
		ЮридическоеЛицоСсылка 	= Справочники.ЮридическиеЛица.ПолучитьСсылку();
	КонецЕсли;	
		
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ФизическоеЛицо, "КонтактнаяИнформация");
	Иначе
		УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ЮридическоеЛицо, "КонтактнаяИнформация");
	КонецЕсли;
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
		ПроверитьЮридическоеЛицоНаСервере();
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
		ПроверитьФизическоеЛицоНаСервере(); 
	Иначе
		Элементы.ГруппаОшибки.Видимость = Ложь;  
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ФормаФизическогоЛица = Неопределено;
	
	Если ЭтоФизическоеЛицо Тогда
		
		Если НЕ ПустаяСтрока(ДокументыФизическихЛиц.ВидДокумента) И НЕ ЗначениеЗаполнено(ДокументыФизическихЛиц.Период) Тогда
			ТекстСообщения = НСтр("ru='Не заполнена дата начала действия сведений о документе удостоверяющем личность'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ДокументыФизическихЛиц.Период",,Отказ);
			Возврат;
		КонецЕсли;
		
		// ФИО	
		ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "ФИОФизическихЛиц");
		
		// гражданство
		ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "ГражданствоФизическихЛиц");
		
		// документ удостоверяющий личность
		ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "ДокументыФизическихЛиц");
		
	КонецЕсли;
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ЗаписьКонтрагенты");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	Если Параметры.Ключ.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(КонтрагентСсылка);
	КонецЕсли;
	
	// Обработчик подсистемы "Контактная информация"
	Если ТекущийОбъект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ФизическоеЛицо, Отказ);
		ТекущийОбъект.КонтактнаяИнформация.Загрузить(ФизическоеЛицо.КонтактнаяИнформация.Выгрузить())
	ИначеЕсли ТекущийОбъект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
	    УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ЮридическоеЛицо, Отказ);
		ТекущийОбъект.КонтактнаяИнформация.Загрузить(ЮридическоеЛицо.КонтактнаяИнформация.Выгрузить())
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ЮридическоеФизическоеЛицо) Тогда
		Если ТекущийОбъект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			ТекущийОбъект.ЮридическоеФизическоеЛицо = ФизическоеЛицоСсылка;
		ИначеЕсли ТекущийОбъект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			ТекущийОбъект.ЮридическоеФизическоеЛицо = ЮридическоеЛицоСсылка;
		КонецЕсли;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ЮридическоеФизическоеЛицо) Тогда  
		ТекущийОбъект.ИНН = ТекущийОбъект.ЮридическоеФизическоеЛицо.ИНН;
		Если ТекущийОбъект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			ТекущийОбъект.КПП = ТекущийОбъект.ЮридическоеФизическоеЛицо.КПП;
		КонецЕсли;
	КонецЕсли; 
	
	// Обработчик подсистемы "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереКонтрагент(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом 
	
	Если ТекущийОбъект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Попытка 
			ФизическоеЛицоОбъект = РеквизитФормыВЗначение("ФизическоеЛицо");
		Исключение
			ТекстСообщения = НСтр("ru='Элемент не записан. Возможно данные редактируются другим пользователем'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецПопытки;	
		// записать физ лицо
		Если ФизическоеЛицоОбъект.Ссылка.Пустая() Тогда
			ФизическоеЛицоОбъект.УстановитьСсылкуНового(ФизическоеЛицоСсылка);
			ФизическоеЛицоОбъект.Наименование = ФИОФизическихЛиц.Фамилия+" "+ФИОФизическихЛиц.Имя+" "+ФИОФизическихЛиц.Отчество;
		Иначе
			Попытка
				ФизическоеЛицоОбъект.Заблокировать();
			Исключение
				ТекстСообщения = НСтр("ru='Контрагент не записан. Возможно данные физического лица редактируются другим пользователем'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Возврат;
			КонецПопытки;
		КонецЕсли;
		Если ФизическоеЛицоОбъект.ПометкаУдаления Тогда
			ФизическоеЛицоОбъект.ПометкаУдаления = Ложь;			
		КонецЕсли;
		Попытка
			ФизическоеЛицоОбъект.Записать();
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось записать физическое лицо по причине: '")+ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецПопытки;
		//Если изменялся вид контрагента - запишем пометку удаления
		Если ОбщегоНазначения.СсылкаСуществует(ЮридическоеЛицоСсылка) Тогда
			ЮридическоеЛицоОбъект = РеквизитФормыВЗначение("ЮридическоеЛицо");
			ЮридическоеЛицоОбъект.ПометкаУдаления = Истина;
			ЮридическоеЛицоОбъект.Записать();
			ЗначениеВРеквизитФормы(ЮридическоеЛицоОбъект, "ЮридическоеЛицо");
		КонецЕсли;
		ЗаписатьФИОФизЛица();
		ЗаписатьУдостоверениеЛичностиФизЛица();
		ОбщегоНазначенияБГУ.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "ГражданствоФизическихЛиц", Новый Структура("ФизическоеЛицо",  ФизическоеЛицоСсылка));
	ИначеЕсли ТекущийОбъект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		Попытка 
			ЮридическоеЛицоОбъект = РеквизитФормыВЗначение("ЮридическоеЛицо");
		Исключение
			ТекстСообщения = НСтр("ru='Элемент не записан. Возможно данные редактируются другим пользователем'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецПопытки;	
		
		Если ЮридическоеЛицоОбъект.Ссылка.Пустая() Тогда
			ЮридическоеЛицоОбъект.УстановитьСсылкуНового(ЮридическоеЛицоСсылка);
			ЮридическоеЛицоОбъект.Наименование = ТекущийОбъект.Наименование;
		Иначе
			Попытка
				ЮридическоеЛицоОбъект.Заблокировать();
			Исключение
				ТекстСообщения = НСтр("ru='Контрагент не записан. Возможно данные юридического лица редактируются другим пользователем'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Возврат;
			КонецПопытки;
		КонецЕсли;
		Если ЮридическоеЛицоОбъект.ПометкаУдаления Тогда
			ЮридическоеЛицоОбъект.ПометкаУдаления = Ложь;			
		КонецЕсли;
		// реквизиты основного объекта
		Попытка
			ЮридическоеЛицоОбъект.Записать();
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось записать юридическое лицо по причине: '")+ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецПопытки;
		// Если изменялся вид контрагента - запишем пометку удаления
		Если ОбщегоНазначения.СсылкаСуществует(ФизическоеЛицоСсылка) Тогда
			ФизическоеЛицоОбъект = РеквизитФормыВЗначение("ФизическоеЛицо");
			ФизическоеЛицоОбъект.ПометкаУдаления = Истина;
			ФизическоеЛицоОбъект.Записать();
			ЗначениеВРеквизитФормы(ФизическоеЛицоОбъект, "ФизическоеЛицо");
		КонецЕсли;
		
	ИначеЕсли ТекущийОбъект.ВидКонтрагента = Перечисления.ЮрФизЛицо.УчетнаяГруппа Тогда

		//Если изменялся вид контрагента - запишем пометку удаления
		Если ОбщегоНазначения.СсылкаСуществует(ЮридическоеЛицоСсылка) Тогда
			ЮридическоеЛицоОбъект = РеквизитФормыВЗначение("ЮридическоеЛицо");
			ЮридическоеЛицоОбъект.ПометкаУдаления = Истина;
			ЮридическоеЛицоОбъект.Записать();
			ЗначениеВРеквизитФормы(ЮридическоеЛицоОбъект, "ЮридическоеЛицо");
		КонецЕсли;
		Если ОбщегоНазначения.СсылкаСуществует(ФизическоеЛицоСсылка) Тогда
			ФизическоеЛицоОбъект = РеквизитФормыВЗначение("ФизическоеЛицо");
			ФизическоеЛицоОбъект.ПометкаУдаления = Истина;
			ФизическоеЛицоОбъект.Записать();
			ЗначениеВРеквизитФормы(ФизическоеЛицоОбъект, "ФизическоеЛицо");
		КонецЕсли;
		
	КонецЕсли;  

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ИзменениеЮридическогоФизическогоЛица" И Параметр = Объект.ЮридическоеФизическоеЛицо Тогда
		ОбновитьРеквизитыЮрФизЛица();
		Модифицированность = Истина;
		
	ИначеЕсли ИмяСобытия="ИзмененоФИО" И Параметр = Объект.ЮридическоеФизическоеЛицо 
		И (ФормаФизическогоЛица = Неопределено ИЛИ НЕ ФормаФизическогоЛица.Открыта()) Тогда	
		
		ОбновитьФИОФизЛица();
		Модифицированность = Истина;
		
	ИначеЕсли ИмяСобытия = "ОбщегоНазначенияБГУКлиент_РезультатОтветаНаЗапросИзмененияРегистраФИОФизическихЛиц"
		И Источник = КонтрагентСсылка Тогда
		
		Если Параметр = КодВозвратаДиалога.Да Тогда
			ФИОФизическихЛиц.Период = ТекущаяДата();
		ИначеЕсли Параметр = КодВозвратаДиалога.Отмена Тогда
			ОбновитьФИОФизЛица();
		КонецЕсли;	
	ИначеЕсли ИмяСобытия = "ОбновитьСостояниеЭД"
		ИЛИ (ИмяСобытия = "ЗагрузкаРеквизитовКонтрагентаИзФайла" И Параметр = Объект.Ссылка) Тогда
		Прочитать();
		
	Иначе
		
		// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		ПараметрыОповещенияЭДО = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаСправочника();
		ПараметрыОповещенияЭДО.Форма                            = ЭтотОбъект;
		ПараметрыОповещенияЭДО.МестоРазмещенияКоманд            = Элементы.КомандыЭДО;
		ПараметрыОповещенияЭДО.ЕстьОбработчикОбновитьКомандыЭДО = Истина;

		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаСправочника(ИмяСобытия, Параметр, Источник, ПараметрыОповещенияЭДО);
		// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	КонецЕсли;
	
	// Подсистема "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	СПАРКРискиКлиент.ОбработкаОповещения(ЭтотОбъект, Объект, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если (ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ЮридическиеЛица") И НЕ ЭтоФизическоеЛицо) ИЛИ
		(ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ФизическиеЛица") И ЭтоФизическоеЛицо) Тогда
		
		ОбработатьВыборЮридическогоФизическогоЛица(ВыбранноеЗначение);
		
	ИначеЕсли НЕ ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда 
		
		ПоказатьПредупреждение(Неопределено, "Выбран не верный тип значения");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.СклонениеПредставленийОбъектов 
	ПараметрыСклонения = СклонениеПредставленийОбъектовКлиентСервер.ПараметрыСклонения();
	СклонениеПредставленийОбъектов.ПриЗаписиФормыОбъектаСклонения(ЭтотОбъект, Объект.НаименованиеСокращенное, ТекущийОбъект.Ссылка, ПараметрыСклонения);  
	// Конец СтандартныеПодсистемы.СклонениеПредставленийОбъектов  
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДанныеКонтрагента();
	
	Элементы.ФизическоеЛицоНаименование.КнопкаВыбора 	= Ложь;
	Элементы.ФизическоеЛицоНаименование.КнопкаОткрытия 	= Истина;
	
	Элементы.ЮридическоеЛицоНаименование.КнопкаВыбора 	= Ложь;
	Элементы.ЮридическоеЛицоНаименование.КнопкаОткрытия = Истина;
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	Если ТекущийОбъект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтотОбъект, ФизическоеЛицо);
	Иначе
	    УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтотОбъект, ЮридическоеЛицо);
	КонецЕсли;
	
	Если ДанныеРуководителейЗаполнять Тогда
		ЗаполнитьДанныеРуководителей(КонтрагентСсылка);
		ДанныеРуководителейЗаполнять = Ложь;
	КонецЕсли;	
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);

	// ИнтернетПоддержкаПользователей.СПАРКРиски
	СПАРКРиски.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.КонтактнаяИнформация.Доступность = Истина;
	
	Если ИзмененоФИО Тогда
		ИзмененоФИО = Ложь;
		ОповеститьОбИзменении(ФизическоеЛицоСсылка);
	КонецЕсли;
	
	Оповестить("Запись_Контрагенты", Новый Структура, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоФизическоеЛицо Тогда
		Если ЗначениеЗаполнено(ФизическоеЛицо.ИНН) Тогда
			ТекстСообщения = "";
			Если Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ФизическоеЛицо.ИНН, Ложь, ТекстСообщения) Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ФизическоеЛицо.ИНН");
			КонецЕсли;
		КонецЕсли;
		ОбщегоНазначенияБГУ.ПроверитьЗаписьВФорме(ЭтотОбъект, "ГражданствоФизическихЛиц", Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка), Отказ);
	Иначе
		Если ЗначениеЗаполнено(ЮридическоеЛицо.ИНН) Тогда
			ТекстСообщения = "";
			Если Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ЮридическоеЛицо.ИНН, Истина, ТекстСообщения) Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ЮридическоеЛицо.ИНН");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, ФизическоеЛицо, Отказ);
	Иначе
		УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, ЮридическоеЛицо, Отказ);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидКонтрагентаПриИзменении(Элемент)
	ВидКонтрагентаПриИзмененииКлиент();
	
	Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
				
		ЭтоФизическоеЛицо = Истина;
		
		ФизическоеЛицо.Наименование = Объект.Наименование;
		ЗаполнитьФИО(ЭтотОбъект);
		ПроверитьФизическоеЛицоНаСервере();

		Если Не ЗначениеЗаполнено(Объект.ЮридическоеФизическоеЛицо) Тогда
			ОбщегоНазначенияклиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФизическоеЛицоНаименование",
				"КнопкаОткрытия", Ложь);
			ОбщегоНазначенияклиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФизическоеЛицоНаименование",
				"КнопкаВыбора", Истина);
		КонецЕсли;	
	
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
		
		Если Не ЗначениеЗаполнено(ЮридическоеЛицо.НаименованиеПолное) Тогда
			ЮридическоеЛицо.НаименованиеПолное = Объект.Наименование;			
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.НаименованиеСокращенное) Тогда
			Объект.НаименованиеСокращенное = Объект.Наименование;			
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Объект.ЮридическоеФизическоеЛицо) Тогда
			ОбщегоНазначенияклиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЮридическоеЛицоНаименование",
				"КнопкаОткрытия", Ложь);
			ОбщегоНазначенияклиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЮридическоеЛицоНаименование",
				"КнопкаВыбора", Истина);
		КонецЕсли;	
		
	КонецЕслИ;	

КонецПроцедуры

&НаКлиенте
Процедура ЮридическоеЛицоСтранаРегистрацииПриИзменении(Элемент)
	УстановитьВидимостьРеквизитовКонтрагента()
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоСтранаРегистрацииПриИзменении(Элемент)
	УстановитьВидимостьРеквизитовКонтрагента()
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоНаименованиеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ, ЗакрыватьПриЗакрытииВладельца, ОповеститьОбИзменениях", Объект.ЮридическоеФизическоеЛицо, Истина, Истина);
	ФормаФизическогоЛица = ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоНаименованиеПриИзменении(Элемент)
	
	Если Параметры.Ключ.Пустая() И ЭтоФизическоеЛицо Тогда
		ПроверитьВидКонтрагентаФизЛицо(Объект.Наименование)
	Иначе
		ЗаполнитьФИО(ЭтотОбъект);
		ЗапроситьРежимИзмененияФИО(ЭтотОбъект, ФИОФизическихЛиц.Период);
		ПроверитьФизическоеЛицоНаСервере();
		ПроверитьПохожихСотрудников();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтадартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ТекущаяСтрока, КонтрагентСсылка, ТолькоБезКонтрагента", ФизическоеЛицоСсылка, Объект.Ссылка, Истина);
	
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическоеЛицоНаименованиеПолноеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Ключ, ЗакрыватьПриЗакрытииВладельца, ОповеститьОбИзменениях", Объект.ЮридическоеФизическоеЛицо, Истина, Истина);
	ОткрытьФорму("Справочник.ЮридическиеЛица.ФормаОбъекта",ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЮридическоеЛицоНаименованиеПолноеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтадартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ЗакрыватьПриЗакрытииВладельца, КонтрагентСсылка, ТолькоБезКонтрагента", Истина, Объект.Ссылка, Истина);
	ОткрытьФорму("Справочник.ЮридическиеЛица.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если Параметры.Ключ.Пустая() И НЕ ЭтоФизическоеЛицо Тогда
		ПроверитьВидКонтрагентаЮрЛицо(Объект.Наименование)
	Иначе
		ДействияПриИзмененииНаименованияЮрЛица();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЮридическоеЛицоКодПоПППНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ДополнительныйОтбор, ТекущаяСтрока", Новый Структура("Бюджет", ЮридическоеЛицо.Бюджет), ЮридическоеЛицо.КодПоППП);
	ОткрытьФорму("Справочник.ГлавыПоБюджетнойКлассификации.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ЮридическоеЛицоИННПриИзменении(Элемент)
	
	Объект.ИНН = ЮридическоеЛицо.ИНН;
	
	ПроверитьЮридическоеЛицоНаСервере();
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ОтключитьЗаполнениеПоИНН = Истина;
	ПодключитьОбработчикОжидания("Подключаемый_ВключитьЗаполнениеПоИНН", 0.1, Истина);
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	ЭтотОбъект.ИндексыСПАРКРиски = Неопределено;
	ОбновитьОтображениеИндексыСПАРК();
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски

КонецПроцедуры

&НаКлиенте
Процедура ЮридическоеЛицоКПППриИзменении(Элемент)
	
	Объект.КПП = ЮридическоеЛицо.КПП;
	ПроверитьЮридическоеЛицоНаСервере();
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоИННПриИзменении(Элемент)
	
	Объект.ИНН = ФизическоеЛицо.ИНН;
	
	ПроверитьФизическоеЛицоНаСервере();
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ОтключитьЗаполнениеПоИНН = Истина;
	ПодключитьОбработчикОжидания("Подключаемый_ВключитьЗаполнениеПоИНН", 0.1, Истина);
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоКПППриИзменении(Элемент)
	
	Объект.КПП = ФизическоеЛицо.КПП;

КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоСтраховойНомерПФРПриИзменении(Элемент)
	ПроверитьФизическоеЛицоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбособленноеПодразделениеПриИзменении(Элемент)
	
	ОчиститьГоловнуюОрганизацию();
	НастроитьДоступностьГоловнойОрганизации();
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
// Редактирование гражданства

&НаКлиенте
Процедура ГражданствоФизическихЛицСтранаПриИзменении(Элемент)
	КорреспондентыКлиент.ГражданствоФизическихЛицСтранаПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоФизическихЛицЛицоБезГражданстваПриИзменении(Элемент)
	КорреспондентыКлиент.ГражданствоФизическихЛицЛицоБезГражданстваПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоФизическихЛицПериодПриИзменении(Элемент)
	КорреспондентыКлиент.ОбновитьОтображениеПолейВводаГражданства(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ФИОПриИзменении()
	ФизическоеЛицо.Наименование = СокрП(ФИОФизическихЛиц.Фамилия+" "+ФИОФизическихЛиц.Имя+" "+ФИОФизическихЛиц.Отчество);	
	ИзмененоФИО = Истина;
КонецПроцедуры // ФИОПриИзменении()

&НаКлиенте
Процедура ФизическоеЛицоДатаРожденияПриИзменении(Элемент)
	ПроверитьФизическоеЛицоНаСервере();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// удостоверение личности физ лица

&НаКлиенте
Процедура ДокументыФизическихЛицВидДокументаПриИзменении(Элемент)
	ОбновитьПолеПериодУдостоверениеЛичности();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицСерияПриИзменении(Элемент)
	ОбновитьПолеПериодУдостоверениеЛичности();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицНомерПриИзменении(Элемент)
	ОбновитьПолеПериодУдостоверениеЛичности();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицКемВыданПриИзменении(Элемент)
	ОбновитьПолеПериодУдостоверениеЛичности();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицДатаВыдачиПриИзменении(Элемент)
	ОбновитьПолеПериодУдостоверениеЛичности();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицКодПодразделенияПриИзменении(Элемент)
	ОбновитьПолеПериодУдостоверениеЛичности();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// список дублей контрагентов

&НаКлиенте
Процедура НадписьПоясненияНекорректногоИННОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыПередачи.Вставить("ТекущаяСтрока", Объект.Ссылка);
	ПараметрыПередачи.Вставить("Отбор", Новый Структура);
	ПараметрыПередачи.Отбор.Вставить("ВидКонтрагента", Объект.ВидКонтрагента);
	
	Если Найти(НавигационнаяСсылка, "ЕстьДублиЮрЛицПоИНН") > 0 Тогда
		ПараметрыПередачи.Отбор.Вставить("ИНН", Объект.ИНН);
		ПараметрыПередачи.Отбор.Вставить("КПП", Объект.КПП); 
	ИначеЕсли Найти(НавигационнаяСсылка, "ЕстьДублиФизЛицоФИО") > 0 Тогда
		ПараметрыПередачи.Отбор.Вставить("Наименование", Объект.Наименование);
		ПараметрыПередачи.Отбор.Вставить("ДатаРождения", ФизическоеЛицо.ДатаРождения);
	ИначеЕсли Найти(НавигационнаяСсылка, "ЕстьДублиФизЛицоИНН") > 0 Тогда
	    ПараметрыПередачи.Отбор.Вставить("ИНН", ФизическоеЛицо.ИНН);
    ИначеЕсли Найти(НавигационнаяСсылка, "ЕстьДублиФизЛицоСНИЛС") > 0 Тогда
	    ПараметрыПередачи.Отбор.Вставить("СНИЛС", ФизическоеЛицо.СтраховойНомерПФР);
	Иначе
		Возврат;
	КонецЕсли;
	
	ЧтоВыполнитьПослеЗакрытия = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаСпискаДублей",
		ПараметрыПередачи,
		Элемент,
		,
		,
		,
		ЧтоВыполнитьПослеЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСпискаДублей(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
		ПроверитьЮридическоеЛицоНаСервере();
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
		ПроверитьФизическоеЛицоНаСервере();
	КонецЕсли;
	
КонецПроцедуры	 

&НаКлиенте
Процедура ДекорацияИндексыСПАРКРискиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(ЭтотОбъект, Элемент, 
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
КонецПроцедуры

&НаКлиенте
Процедура КодОКВЭДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", 				"Выбор вида деятельности по ОКВЭД");
	ПараметрыФормы.Вставить("НазваниеМакета",  			"ОКВЭД2");
	ПараметрыФормы.Вставить("Префикс",					"Классификатор");
	ПараметрыФормы.Вставить("ИмяРеквизитаКод",  		"КодОКВЭД");
	ПараметрыФормы.Вставить("ИмяРеквизитаНаименование",	"НаименованиеОКВЭД");
	
	ВыбратьИзКлассификатора(ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеСокращенноеПриИзменении(Элемент)
	// СтандартныеПодсистемы.СклонениеПредставленийОбъектов 
	ПараметрыСклонения = СклонениеПредставленийОбъектовКлиентСервер.ПараметрыСклонения();
	СклонениеПредставленийОбъектовКлиент.ПросклонятьПредставление(ЭтотОбъект, Объект.НаименованиеСокращенное, ПараметрыСклонения);
	// Конец СтандартныеПодсистемы.СклонениеПредставленийОбъектов
КонецПроцедуры  

&НаКлиенте
Процедура НаименованиеИППриИзменении(Элемент)
	// СтандартныеПодсистемы.СклонениеПредставленийОбъектов 
	ПараметрыСклонения = СклонениеПредставленийОбъектовКлиентСервер.ПараметрыСклонения();
	СклонениеПредставленийОбъектовКлиент.ПросклонятьПредставление(ЭтотОбъект, Объект.НаименованиеСокращенное, ПараметрыСклонения);
	// Конец СтандартныеПодсистемы.СклонениеПредставленийОбъектов
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ГражданствоИстория(Команда)
	
	КорреспондентыКлиент.ГражданствоИстория(ФизическоеЛицоСсылка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияФИО(Команда)
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка);
	ПараметрыФормы = Новый Структура("Отбор, ФизическоеЛицо, ЗакрыватьПриЗакрытииВладельца" , Отбор, ФизическоеЛицоСсылка, Истина);
	ОткрытьФорму("РегистрСведений.ФИОФизическихЛиц.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияУдостоверение(Команда)
	
	Отбор = Новый Структура("ФизЛицо, ЯвляетсяДокументомУдостоверяющимЛичность", ФизическоеЛицоСсылка, Истина);
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца", Отбор, Истина);
	ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеДокументыЭтогоЧеловека(Команда)
	
	Отбор = Новый Структура("ФизЛицо", ФизическоеЛицоСсылка);
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца", Отбор, Истина);
	ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.Форма.ДокументыФизическогоЛица", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИННЮЛ(Команда)
	
	ЗаполнитьПоИНН(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИННФЛ(Команда)
	
	ЗаполнитьПоИНН(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоНаименованию(Команда)
	
	Отбор  = Новый Структура("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты"));
	Строки = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
	ЮрАдресЗаполнен = НЕ Строки.Количество() = 0 И ЗначениеЗаполнено(Строки[0].Представление);
	РеквизитыЗаполнены = ЗначениеЗаполнено(Объект.ИНН) ИЛИ ЮрАдресЗаполнен;
	
	ЗаполнитьРеквизитыПоНаименованиюНаКлиенте(Объект.Наименование, РеквизитыЗаполнены);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоДаннымЕГР(Команда)
	
	ЗаполнитьРеквизитыПоДаннымЕГРНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ИсторияКПП(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ИсторияКПП", Объект.КППИстория);
	ОписаниеОповещения_Закрытие = Новый ОписаниеОповещения("ИсторияКПП_ЗавершеноРедактирование", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контрагенты.Форма.ИсторияКПП", ПараметрыФормы,,,,,ОписаниеОповещения_Закрытие, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПадежи(Команда)
	
	Если ЭтоФизическоеЛицо Тогда
		Исходныйтекст = ФизическоеЛицо.Наименование;
		ПолФЛ = ФизическоеЛицо.Пол;
	Иначе
		Исходныйтекст = ЮридическоеЛицо.НаименованиеПолное;
		ПолФЛ = Неопределено;
	КонецЕсли;	
	
	ЗаполнитьПадежиНаСервере(Исходныйтекст, ПолФЛ, Объект.НаименованиеДП, Объект.НаименованиеРП);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКонтрагента(Команда)
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ПроверитьКонтрагентаПоКнопке(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

КонецПроцедуры

// Команды1СПАРКРиски
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду1СПАРКРиски(Команда)
	СПАРКРискиКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец Команды1СПАРКРиски  

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом  

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.СклонениеПредставленийОбъектов 
&НаКлиенте
Процедура Склонения(Команда)
	ПараметрыСклонения = СклонениеПредставленийОбъектовКлиентСервер.ПараметрыСклонения();
	СклонениеПредставленийОбъектовКлиент.ПоказатьСклонение(ЭтотОбъект, Объект.НаименованиеСокращенное, ПараметрыСклонения);
КонецПроцедуры   
// Конец СтандартныеПодсистемы.СклонениеПредставленийОбъектов

&НаКлиенте
Процедура СклоненияЮЛ(Команда)
	ПараметрыСклонения = СклонениеПредставленийОбъектовКлиентСервер.ПараметрыСклонения();
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Склонения", СклоненияПредставления(ЮридическоеЛицо.НаименованиеПолное, ЮридическоеЛицо.Ссылка));
	СтруктураПараметров.Вставить("Представление", ЮридическоеЛицо.НаименованиеПолное);
	СтруктураПараметров.Вставить("ПараметрыСклонения", ПараметрыСклонения);
	СтруктураПараметров.Вставить("ИзмененоПредставление", Ложь);
	СтруктураПараметров.Вставить("ТолькоПросмотр", Истина);
	ОткрытьФорму("ОбщаяФорма.Склонения", СтруктураПараметров, ЭтотОбъект, , , ,);
КонецПроцедуры  

&НаКлиенте
Процедура СклоненияИП(Команда)
	ПараметрыСклонения = СклонениеПредставленийОбъектовКлиентСервер.ПараметрыСклонения();
	СклонениеПредставленийОбъектовКлиент.ПоказатьСклонение(ЭтотОбъект, Объект.НаименованиеСокращенное, ПараметрыСклонения);
КонецПроцедуры 

&НаКлиенте
Процедура СклоненияФЛ(Команда)
	ПараметрыСклонения = СклонениеПредставленийОбъектовКлиентСервер.ПараметрыСклонения(); 
	ПараметрыСклонения.ЭтоФИО = Истина;
	ПараметрыСклонения.Пол = ?(ФизическоеЛицо.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской"), 1, 2); 
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Склонения", СклоненияПредставления(ФизическоеЛицо.Наименование, ФизическоеЛицо.Ссылка));
	СтруктураПараметров.Вставить("Представление", ЮридическоеЛицо.НаименованиеПолное);
	СтруктураПараметров.Вставить("ПараметрыСклонения", ПараметрыСклонения);
	СтруктураПараметров.Вставить("ИзмененоПредставление", Ложь);
	СтруктураПараметров.Вставить("ТолькоПросмотр", Истина);
	ОткрытьФорму("ОбщаяФорма.Склонения", СтруктураПараметров, ЭтотОбъект, , , ,);
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗаблокированныеРеквизиты = ЗапретРедактированияРеквизитовОбъектовКлиент.Реквизиты(ЭтотОбъект);
	
	Если ЗаблокированныеРеквизиты.Количество() > 0 Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ссылка", Объект.Ссылка);
		ПараметрыФормы.Вставить("ВидКонтрагента", Объект.ВидКонтрагента);
		ПараметрыФормы.Вставить("ЗаблокированныеРеквизиты", ЗаблокированныеРеквизиты);
		
		ОткрытьФорму("Справочник.Контрагенты.Форма.РазблокированиеРеквизитов", ПараметрыФормы,
			ЭтотОбъект,,,, Новый ОписаниеОповещения("ПослеВыбораРеквизитовДляРазблокирования", ЭтотОбъект));
	Иначе
		ЗапретРедактированияРеквизитовОбъектовКлиент.ПоказатьПредупреждениеВсеВидимыеРеквизитыРазблокированы();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораРеквизитовДляРазблокирования(РазблокируемыеРеквизиты, Контекст) Экспорт
	
	Если ТипЗнч(РазблокируемыеРеквизиты) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтотОбъект,
		РазблокируемыеРеквизиты);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
        УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
    УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
&НаКлиенте
Процедура Подключаемый_ПоказатьПредложениеИспользоватьПроверкуКонтрагентов()
	ПроверкаКонтрагентовКлиент.ПредложитьВключитьПроверкуКонтрагентов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбработатьРезультатПроверкиКонтрагентов()
	ПроверкаКонтрагентовКлиент.ОбработатьРезультатПроверкиКонтрагентовВСправочнике(ЭтотОбъект);
КонецПроцедуры
// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

&НаСервере
Процедура ЗаполнитьРеквизитыПоТекстуЗаполнения(ТекстЗаполнения, Отказ)
	
	Если КорреспондентыКлиентСервер.ЭтоИНН(ТекстЗаполнения) Тогда
		
		Объект.Наименование = "";
		Объект.ИНН = ТекстЗаполнения;
		ОбъектОшибки = Неопределено;
		
		Если СтрДлина(Объект.ИНН) = 12 Тогда
			Если НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ФизЛицо) = Неопределено Тогда
				Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо");
				ФизическоеЛицо.ИНН = Объект.ИНН;
			Иначе
				Отказ = Истина;
				ОбъектОшибки = Метаданные.Справочники.ФизическиеЛица;
			КонецЕсли;
		Иначе
			Если НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ЮрЛицо) = Неопределено Тогда
				Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо");
				ЮридическоеЛицо.ИНН = Объект.ИНН;
			Иначе
				Отказ = Истина;
				ОбъектОшибки = Метаданные.Справочники.ЮридическиеЛица;
			КонецЕсли;
		КонецЕсли;
		
		Если Отказ Тогда
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Доступ. Отказ в доступе'"), УровеньЖурналаРегистрации.Ошибка, ОбъектОшибки, НСтр("ru = 'Право: Добавление'"));
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Недостаточно прав на создание контрагента вида %1.'"), ОбъектОшибки);
			Возврат;
		КонецЕсли;	
		
		ВидКонтрагентаПриИзмененииСервер();
		
		ОписаниеОшибки = "";
		ЗаполнитьРеквизитыПоИНННаСервере(ОписаниеОшибки);
		
		ТекстЗаполнения = Неопределено;
		
		ОтобразитьЗаполнениеПоДаннымЕГР = Ложь;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) 
		И НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Объект.ВидКонтрагента) = Неопределено Тогда
		ОтобразитьЗаполнениеПоДаннымЕГР = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьРежимИзмененияФИО(ФормаИсточник, ДатаИзменения)
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru =  'При редактировании Вы изменили полное имя физического лица. 
							|Если Вы просто исправили прежние данные (они были ошибочны), нажмите ""Исправлена ошибка"".
							|Если у физического лица сменилась фамилия, имя или отчество с %1, нажмите ""Изменилось имя""'"), 
				Формат(ТекущаяДата(), "ДФ='д ММММ гггг ""г""'"));
	ТекстКнопкиДа = НСтр("ru = 'Изменилось имя'");

	ОбщегоНазначенияБГУКлиент.ЗапроситьРежимИзмененияРегистра(ФормаИсточник, "ФИОФизическихЛиц", ТекстВопроса, ТекстКнопкиДа, Ложь,, КонтрагентСсылка);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьНовыйЭлемент()
	
	КонтрагентСсылка 		= Справочники.Контрагенты.ПолучитьСсылку();
	ФизическоеЛицоСсылка 	= Справочники.ФизическиеЛица.ПолучитьСсылку();
	ЮридическоеЛицоСсылка 	= Справочники.ЮридическиеЛица.ПолучитьСсылку();
	
	ВыполненаИнициализацияФИО = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда
		
		СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Объект.Наименование);

		ПолПоНаименованию = КорреспондентыКлиентСервер.ОпределитьПолПоОтчеству(СтруктураФИО.Отчество);
	
		Если ПолПоНаименованию = Неопределено Тогда
			Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо;
			
			Если НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ЮрЛицо) = Неопределено Тогда
				ПолеПоискаИНННаименование = Объект.Наименование;
				ОтобразитьЗаполнениеПоДаннымЕГР = Истина;
			Иначе
				Объект.Наименование = "";
			КонецЕсли;
			
		Иначе
			Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо;
			ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект,
				"ФИОФизическихЛиц",	Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));
			ВыполненаИнициализацияФИО = Истина;
			
			Если НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ФизЛицо)  = Неопределено Тогда
				ФизическоеЛицо.Наименование = Объект.Наименование;  
				ЗаполнитьФИО(ЭтотОбъект); 
				ФИОФизическихЛицНоваяЗапись = Истина;
				ПроверитьФизическоеЛицоНаСервере();
				
				ТекущийЭлемент = Элементы.ФизическоеЛицоНаименование;   
				
				ОтобразитьЗаполнениеПоДаннымЕГР = Истина; 
				
			Иначе
				Объект.Наименование = "";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидКонтрагента) Тогда
		Если НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ЮрЛицо) = Неопределено Тогда
			Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо;
			ЮридическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
			ОтобразитьЗаполнениеПоДаннымЕГР = Истина;
		ИначеЕсли НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ФизЛицо) = Неопределено Тогда
 	        Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо;
			ОтобразитьЗаполнениеПоДаннымЕГР = Истина;   
		ИначеЕсли НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.УчетнаяГруппа) = Неопределено Тогда
 	        Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.УчетнаяГруппа;
			ОтобразитьЗаполнениеПоДаннымЕГР = Ложь;  	
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидКонтрагента) Тогда
		Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо;
	КонецЕсли;	
	
	Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Если Не ВыполненаИнициализацияФИО Тогда
			ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект,
				"ФИОФизическихЛиц",	Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));
			ВыполненаИнициализацияФИО = Истина;
		КонецЕсли;
		Корреспонденты.ИнициализироватьДокументУдостоверяющийЛичностьДляРедактированияВФорме(ЭтотОбъект,
			ФизическоеЛицоСсылка);
		ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ГражданствоФизическихЛиц",
			Новый Структура("ФизическоеЛицо",  ФизическоеЛицоСсылка));
		ФизическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
		ГражданствоФизическихЛицЛицоБезГражданства = НЕ ЗначениеЗаполнено(ГражданствоФизическихЛиц.Страна);
	КонецЕсли;   
	
	Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.УчетнаяГруппа Тогда
		УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, ЮридическоеЛицо, "КонтактнаяИнформация");
	    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтактнаяИнформация", "Видимость", Ложь);
	КонецЕсли;	
	
	ЭтоФизическоеЛицо = Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо;
	Элементы.ЮридическоеЛицоНаименование.КнопкаВыбора = Истина;
	Элементы.ФизическоеЛицоНаименование.КнопкаВыбора = Истина; 
	Элементы.ГруппаОшибки.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЮридическоеЛицоНаСервере()
	
	ТекстСообщения = "";
	МассивРезультатовПроверки = Новый Массив;
	Элементы.ГруппаОшибки.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(ЮридическоеЛицо.ИНН) Тогда
		
		Если НЕ РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ЮридическоеЛицо.ИНН, Истина, ТекстСообщения) Тогда
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения));
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЮридическоеЛицо.КПП) Тогда
			Если НЕ РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(ЮридическоеЛицо.КПП, ТекстСообщения) Тогда
				МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения)); 
				МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЮридическоеЛицо.КодОКПО) Тогда
		
		Если НЕ РегламентированныеДанныеКлиентСервер.КодПоОКПОСоответствуетТребованиям(ЮридическоеЛицо.КодОКПО, Истина, ТекстСообщения) Тогда
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС + " " + ТекстСообщения));
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;
		
	КонецЕсли;
	
	Дубли = Корреспонденты.ПроверитьДублиКонтрагентаЮрЛица(ЮридическоеЛицо.ИНН, ЮридическоеЛицо.КПП, Объект.Ссылка);
	Если Дубли > 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В базе данных обнаружено еще записей с ИНН <%1>, КПП <%2>: %3'"),
		ЮридическоеЛицо.ИНН, ЮридическоеЛицо.КПП, Дубли);
		МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения,,,,"ЕстьДублиЮрЛицПоИНН"));
	КонецЕсли;
	
	Если МассивРезультатовПроверки.Количество() > 0 Тогда
		МассивРезультатовПроверки.Вставить(0, Новый ФорматированнаяСтрока(Символы.ПС));
		НадписьПоясненияНекорректногоИНН = Новый ФорматированнаяСтрока(МассивРезультатовПроверки);
		Элементы.ГруппаОшибки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьФизическоеЛицоНаСервере()
	
	ТекстСообщения = "";
	МассивРезультатовПроверки = Новый Массив;
	Элементы.ГруппаОшибки.Видимость = Ложь;
	
	Если ЗначениеЗаполнено(ФизическоеЛицо.ИНН) Тогда
		
		Если НЕ РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ФизическоеЛицо.ИНН, Ложь, ТекстСообщения) Тогда
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения));  
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;
		
		Дубли = Корреспонденты.ПроверитьДублиФизЛицаПоРегДанным("ИНН", ФизическоеЛицо.ИНН, Объект.Ссылка);
		Если Дубли > 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В базе данных обнаружено еще записей с тем же ИНН: %1'"), Дубли);
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения,,,,"ЕстьДублиФизЛицоИНН"));
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФизическоеЛицо.СтраховойНомерПФР) Тогда
		
		Если НЕ РегламентированныеДанныеКлиентСервер.СтраховойНомерПФРСоответствуетТребованиям(ФизическоеЛицо.СтраховойНомерПФР, ТекстСообщения) Тогда
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения));  
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;
		
		Дубли = Корреспонденты.ПроверитьДублиФизЛицаПоРегДанным("СтраховойНомерПФР", ФизическоеЛицо.СтраховойНомерПФР, Объект.Ссылка);
		Если Дубли > 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В базе данных обнаружено еще записей с тем же СНИЛС: %1'"), Дубли);
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения,,,,"ЕстьДублиФизЛицоСНИЛС"));
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;
		
	КонецЕсли;
	
	Дубли = Корреспонденты.ПроверитьДублиКонтрагентаФизЛица(Объект.Наименование, ФизическоеЛицо.ДатаРождения, Объект.Ссылка);
	Если Дубли > 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В базе данных обнаружено еще записей с теми же ФИО и датой рождения: %1'"), Дубли);
		МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения,,,,"ЕстьДублиФизЛицоФИО"));
	КонецЕсли;
	
	Если МассивРезультатовПроверки.Количество() > 0 Тогда
		МассивРезультатовПроверки.Вставить(0, Новый ФорматированнаяСтрока(Символы.ПС));
		НадписьПоясненияНекорректногоИНН = Новый ФорматированнаяСтрока(МассивРезультатовПроверки);
		Элементы.ГруппаОшибки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьУдостоверениеЛичности()
	
	ТекстСообщения = "";
	
	МассивРезультатовПроверки = Новый Массив;
	
	Элементы.НадписьПоясненияНекорректногоУдостоверения.Подсказка = "";
	
	Если НЕ ПустаяСтрока(ДокументыФизическихЛиц.ВидДокумента) Тогда
		
		Если ЗначениеЗаполнено(ДокументыФизическихЛиц.Серия) Тогда
			
			ДокументыФизическихЛицКлиентСервер.СерияДокументаУказанаПравильно(ДокументыФизическихЛиц.ВидДокумента, ДокументыФизическихЛиц.Серия, ТекстСообщения);
			
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения));
			
			Элементы.НадписьПоясненияНекорректногоУдостоверения.Подсказка = ТекстСообщения;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументыФизическихЛиц.Номер) Тогда
			
			ДокументыФизическихЛицКлиентСервер.НомерДокументаУказанПравильно(ДокументыФизическихЛиц.ВидДокумента, ДокументыФизическихЛиц.Номер, ТекстСообщения);
			
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(" " + ТекстСообщения));
			
			Элементы.НадписьПоясненияНекорректногоУдостоверения.Подсказка = Элементы.НадписьПоясненияНекорректногоУдостоверения.Подсказка + " " + ТекстСообщения;
			
		КонецЕсли;
	КонецЕсли;

	НадписьПоясненияНекорректногоУдостоверения = Новый ФорматированнаяСтрока(МассивРезультатовПроверки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПадежиНаСервере(Исходныйтекст, ПолФЛ, НаименованиеДП, НаименованиеРП)
	
	Корреспонденты.Просклонять(Исходныйтекст, 3, НаименованиеДП, ПолФЛ);
	Корреспонденты.Просклонять(Исходныйтекст, 2, НаименованиеРП, ПолФЛ);

КонецПроцедуры

#Область СлужебныеПроцедурыИФункцииЗаполнениеКонтрагентаПоИНН

&НаКлиенте
Процедура ЗаполнитьПоИНН(Команда)
	
	Если ОтключитьЗаполнениеПоИНН <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ИНН) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Поле ""ИНН"" не заполнено'"));
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Наименование) 
		ИЛИ ЗначениеЗаполнено(Объект.НаименованиеСокращенное)   
		ИЛИ ЗначениеЗаполнено(Объект.КПП)
		Тогда
		ТекстВопроса = НСтр("ru='Перезаполнить текущие реквизиты?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьРеквизитыПоИННЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьЗаполнениеРеквизитовПоИНН();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоИННЗавершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаполнениеРеквизитовПоИНН();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоДаннымЕГРНаКлиенте()

	Если ПустаяСтрока(ПолеПоискаИНННаименование) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСТр("ru='Введите ИНН или Наименование'"),, "ПолеПоискаИНННаименование");
		Возврат;
	КонецЕсли;
	
	Если ОтключитьЗаполнениеПоИНН <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеПоискаИНННаименование = СокрЛП(ПолеПоискаИНННаименование);
	
	Если КорреспондентыКлиентСервер.ЭтоИНН(ПолеПоискаИНННаименование) Тогда
		
		Объект.ИНН = ПолеПоискаИНННаименование;
		
		Если СтрДлина(Объект.ИНН) = 12 Тогда
			Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо");
			ФизическоеЛицо.ИНН = Объект.ИНН; 
			Если НЕ ЗначениеЗаполнено(ФизическоеЛицо.СтранаРегистрации) Тогда
				ФизическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
			КонецЕсли;	
		Иначе	
			Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо");
			ЮридическоеЛицо.ИНН = Объект.ИНН;
			Если НЕ ЗначениеЗаполнено(ЮридическоеЛицо.СтранаРегистрации) Тогда
				ЮридическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
			КонецЕсли;
		КонецЕсли;
		
		ВидКонтрагентаПриИзмененииСервер();
		
		ВыполнитьЗаполнениеРеквизитовПоИНН();
		
	Иначе // Это наименование
		
		ЗаполнитьРеквизитыПоНаименованиюНаКлиенте(ПолеПоискаИНННаименование);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоНаименованиюНаКлиенте(НаименованиеДляПоиска, РеквизитыЗаполнены = Ложь);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтрокаПоиска", НаименованиеДляПоиска);
	ДопПараметры = Новый Структура;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьРеквизитыПоНаименованиюЗавершение", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("ОбщаяФорма.ЗаполнениеРеквизитовКонтрагента", 
		ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоНаименованиюЗавершение(Результат, ДопПараметры) Экспорт

	Если НЕ ЗначениеЗаполнено(Результат) 
		ИЛИ ТипЗнч(Результат) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ИНН = Результат;
	
	Если СтрДлина(Объект.ИНН) = 12 Тогда
		Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо");
		Если НЕ ЗначениеЗаполнено(ФизическоеЛицо.СтранаРегистрации) Тогда
			ФизическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
		КонецЕсли;	
	Иначе	
		Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо");
		Если НЕ ЗначениеЗаполнено(ЮридическоеЛицо.СтранаРегистрации) Тогда
			ЮридическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
		КонецЕсли;
	КонецЕсли;
	
	ВидКонтрагентаПриИзмененииСервер();
	
	ВыполнитьЗаполнениеРеквизитовПоИНН(Истина);
		
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ВключитьЗаполнениеПоИНН()
	ОтключитьЗаполнениеПоИНН = Неопределено;	
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьЗаполнениеРеквизитовПоИНН(ПроверитьИНН = Ложь)
	
	ОписаниеОшибки = "";
	ЗаполнитьРеквизитыПоИНННаСервере(ОписаниеОшибки);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		// Обработка ошибок
		Если ОписаниеОшибки = "НеУказаныПараметрыАутентификации" Тогда
			ТекстВопроса = НСтр("ru='Для автоматического заполнения реквизитов контрагентов
				|необходимо подключиться к Интернет-поддержке пользователей.
				|Подключиться сейчас?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержку", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		ИначеЕсли ОписаниеОшибки = "ЕстьДублиИННКПП" Тогда
				ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В базе данных уже есть контрагент с ИНН %1, КПП %2!
			|Наличие контрагентов с одинаковыми ИНН и КПП может привести 
			|к некорректной работе некоторых механизмов программы.
			|Отказаться от записи?'"), Объект.ИНН, Объект.КПП);
	
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодтвердитьЗаписьДубля", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Да,,КодВозвратаДиалога.Да);
			
		Иначе
			ПоказатьПредупреждение(, ОписаниеОшибки);
		КонецЕсли;
		
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
		// Проверка юридического лица по данным сервиса ИФНС после заполнения реквизитов (мог измениться КПП).
		ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	ЭтотОбъект.ИндексыСПАРКРиски = Неопределено;
	ОбновитьОтображениеИндексыСПАРК();
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодтвердитьЗаписьДубля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
			ПроверитьЮридическоеЛицоНаСервере();
		ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
			ПроверитьФизическоеЛицоНаСервере();
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	ОтказОтЗаписиНаСервере();
	
	Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
		// Проверка юридического лица по данным сервиса ИФНС после заполнения реквизитов (мог измениться КПП).
		ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтказОтЗаписиНаСервере() 
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ИнициализироватьНовыйЭлемент();
		
		ЗначениеВРеквизитФормы(Справочники.ЮридическиеЛица.СоздатьЭлемент(), "ЮридическоеЛицо");
		ЗначениеВРеквизитФормы(Справочники.ФизическиеЛица.СоздатьЭлемент(), "ФизическоеЛицо");
		
		ЗаполнитьЗначенияСвойств(Объект, ЮридическоеЛицо,,"КонтактнаяИнформация");
		ЗаполнитьЗначенияСвойств(Объект, ФизическоеЛицо,,"КонтактнаяИнформация");
		
		Для Каждого Стр Из КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
			Стр.ЗначенияПолей = "";
			Стр.Представление = "";
			Стр.Комментарий = "";
		Конеццикла;
		
		Объект.НаименованиеСокращенное = "";
		Объект.НаименованиеДП = "";
		Объект.НаименованиеРП = "";
		РезультатПроверкиКонтрагента = "";
		
		ОбновитьДанныеКонтрагентаИИнициализироватьРегистры();

		Модифицированность = Ложь;
	Иначе
		Прочитать();
	КонецЕсли;	
	
	Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
		ПроверитьЮридическоеЛицоНаСервере();
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
		ПроверитьФизическоеЛицоНаСервере();
	КонецЕсли;
		
КонецПроцедуры	

&НаКлиенте
Процедура ПодключитьИнтернетПоддержку(Ответ, ДопПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуЗавершение", ЭтотОбъект, ДопПараметры);
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		ВыполнитьЗаполнениеРеквизитовПоИНН();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоИНННаСервере(ОписаниеОшибки = "")
	
	ЭтоЮридическоеЛицо = Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо;
	
	Если ЭтоЮридическоеЛицо Тогда  
		РеквизитыКонтрагента = РаботаСКонтрагентами.СведенияОЮридическомЛицеПоИНН(Объект.ИНН);
	Иначе
		РеквизитыКонтрагента = РаботаСКонтрагентами.РеквизитыПредпринимателяПоИНН(Объект.ИНН);
		РеквизитыКонтрагента.Вставить("КПП", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыКонтрагента.ОписаниеОшибки) Тогда
		ОписаниеОшибки = РеквизитыКонтрагента.ОписаниеОшибки;
		Возврат;
	КонецЕсли; 
	
	Если ЭтоЮридическоеЛицо Тогда  
		Если НЕ ЗначениеЗаполнено(РеквизитыКонтрагента.ЕГРЮЛ) Тогда 
			ОписаниеОшибки = НСтр("ru = 'Не удалось найти данные для заполнения реквизитов по ИНН %1!'");
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, Объект.ИНН); 			
			Возврат;
		КонецЕсли;	
		РеквизитыКонтрагента = РеквизитыКонтрагента.ЕГРЮЛ;
	КонецЕсли;	
	
	Если РеквизитыКонтрагента.Свойство("КодОКВЭД") Тогда
		Макет = ПолучитьОбщийМакет("ОКВЭД2");
		ОбластьКлассификатор = Макет.Область("Классификатор");
		ОбластьСтроки = Макет.НайтиТекст(РеквизитыКонтрагента.КодОКВЭД, , ОбластьКлассификатор, , Истина);
		Если НЕ ОбластьСтроки = Неопределено Тогда
			РеквизитыКонтрагента.Вставить("НаименованиеОКВЭД", Макет.Область(ОбластьСтроки.Верх, 2).Текст);
		КонецЕсли;	
	КонецЕсли;

	
	Если ЭтоЮридическоеЛицо Тогда
		ПроверитьЗаполнитьДаннеЮрФзЛица(РеквизитыКонтрагента, ОписаниеОшибки, ЮридическоеЛицоСсылка, "ЮридическоеЛицо");
		ПроверитьЮридическоеЛицоНаСервере();
	Иначе
		ПроверитьЗаполнитьДаннеЮрФзЛица(РеквизитыКонтрагента, ОписаниеОшибки, ФизическоеЛицоСсылка, "ФизическоеЛицо");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнитьДаннеЮрФзЛица(РеквизитыКонтрагента, ОписаниеОшибки, СсылкаЮрФизЛица, РеквизитФормыОбъект)
	                     
	РезультатПроверки = Корреспонденты.ПроверитьОпределитьКонтрагентаЮрФизЛицо(РеквизитыКонтрагента.ИНН, РеквизитыКонтрагента.КПП, Объект.ЮридическоеФизическоеЛицо, Объект.Ссылка); 
	
	Если НЕ РезультатПроверки.ВидКонтрагента = Объект.ВидКонтрагента И ЗначениеЗаполнено(РезультатПроверки.ЮрФизЛицоСсылка) Тогда
		// Нашли юрлицо или физлицо с ошибкой заполнения
		
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'При попытке заполнения котрагента, имеющего вид ""%1"",
		|в справочнике ""%2"" обнаружен элемент с  ИНН %3.
		|Заполнение реквизитов невозможно! 
		|'"), Объект.ВидКонтрагента, РезультатПроверки.ВидКонтрагента, РеквизитыКонтрагента.ИНН);
		
		Возврат;
	КонецЕсли;
	
	Если РезультатПроверки.Корректен Тогда 
		// проверка прошла успешно, можно заполнять

		ОписаниеОшибки = "";
		
		Если РезультатПроверки.ЕстьКонтрагент = Ложь И ЗначениеЗаполнено(РезультатПроверки.ЮрФизЛицоСсылка) Тогда
			ЗначениеВРеквизитФормы(РезультатПроверки.ЮрФизЛицоСсылка.ПолучитьОбъект(), РеквизитФормыОбъект);
			СсылкаЮрФизЛица 			 		= РезультатПроверки.ЮрФизЛицоСсылка;
			Объект.ЮридическоеФизическоеЛицо 	= РезультатПроверки.ЮрФизЛицоСсылка;
		КонецЕсли; 
		
	ИначеЕсли НЕ РезультатПроверки.ЕстьКонтрагент И ЗначениеЗаполнено(РезультатПроверки.ЮрФизЛицоСсылка) Тогда
		// нашли "свободное" юрлицо с указанными ИНН и КПП надо поменять ссылку и можно заполнять
		
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В базе данных обнаружено еще записей %3 с ИНН %1, КПП %2!
			|Наличие контрагентов с одинаковыми ИНН и КПП может привести 
			|к некорректной работе некоторых механизмов программы.
			|'"), РеквизитыКонтрагента.ИНН, РеквизитыКонтрагента.КПП, РезультатПроверки.ЕстьДанные);
			
		ЗначениеВРеквизитФормы(РезультатПроверки.ЮрФизЛицоСсылка.ПолучитьОбъект(), РеквизитФормыОбъект);
		СсылкаЮрФизЛица 			 		= РезультатПроверки.ЮрФизЛицоСсылка;
		Объект.ЮридическоеФизическоеЛицо 	= РезультатПроверки.ЮрФизЛицоСсылка;
		
	ИначеЕсли Объект.ЮридическоеФизическоеЛицо = РезультатПроверки.ЮрФизЛицоСсылка И Объект.Ссылка = РезультатПроверки.КонтрагентСсылка Тогда
		// есть дубли, надо будет спросить
		ОписаниеОшибки = "ЕстьДублиИННКПП";
	Иначе
		ОписаниеОшибки = "Введены некорретные данные.";
		Возврат;
	КонецЕсли;	
	
	Если РеквизитФормыОбъект = "ЮридическоеЛицо" Тогда 
		Если ЗначениеЗаполнено(РеквизитыКонтрагента.НаименованиеПолноеЕГРЮЛ) Тогда
			РеквизитыКонтрагента.Вставить("НаименованиеПолное", РеквизитыКонтрагента.НаименованиеПолноеЕГРЮЛ); 
		КонецЕсли;
		РеквизитыКонтрагента.Вставить("ОГРН", РеквизитыКонтрагента.РегистрационныйНомер);  
	Иначе	
		РеквизитыКонтрагента.Вставить("ОГРНИП", РеквизитыКонтрагента.РегистрационныйНомер);
		РеквизитыКонтрагента.Вставить("Пол", ?(РеквизитыКонтрагента.Пол = "1", Перечисления.ПолФизическогоЛица.Мужской, Перечисления.ПолФизическогоЛица.Женский));
		
		Если НЕ РеквизитыКонтрагента.СвидетельствоОРегистрации = Неопределено Тогда
			РеквизитыКонтрагента.Вставить("СвидетельствоСерияНомер", РеквизитыКонтрагента.СвидетельствоОРегистрации.Серия + " " + РеквизитыКонтрагента.СвидетельствоОРегистрации.Номер); 
			РеквизитыКонтрагента.Вставить("СвидетельствоДата", РеквизитыКонтрагента.СвидетельствоОРегистрации.Дата);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ФИОФизическихЛиц, РеквизитыКонтрагента);
		Если НЕ ЗначениеЗаполнено(ФИОФизическихЛиц.Период) Тогда
			ФИОФизическихЛиц.Период = РеквизитыКонтрагента.ДатаРегистрации;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ГражданствоФизическихЛиц.Период) Тогда
			ГражданствоФизическихЛиц.Период = РеквизитыКонтрагента.ДатаРегистрации;
		КонецЕсли;
		
		РеквизитыКонтрагента.Вставить("ТипКонтрагента", Справочники.ТипыКонтрагентов.НайтиПоКоду("6"));

	КонецЕсли;	
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект[РеквизитФормыОбъект], РеквизитыКонтрагента);
	ЗаполнитьЗначенияСвойств(Объект, РеквизитыКонтрагента);
	
	Если РеквизитФормыОбъект = "ЮридическоеЛицо" Тогда
		ЗаполнитьЭлементКонтактнойИнформации(Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты, РеквизитыКонтрагента["ЮридическийАдрес"]);
	КонецЕсли;   
	
	Если РеквизитыКонтрагента.Свойство("ДанныеРуководителей") И РеквизитыКонтрагента.ДанныеРуководителей.Свойство("Руководители") Тогда
		ДанныеРуководителейТаблица = РеквизитыКонтрагента.ДанныеРуководителей.Руководители.Скопировать(, "Должность,Фамилия,Имя,Отчество,ДатаЗаписи");
		ДанныеРуководителей = ПоместитьВоВременноеХранилище(ДанныеРуководителейТаблица, УникальныйИдентификатор);
		ДанныеРуководителейЗаполнять = Истина;  
		Если НЕ Параметры.Ключ.Пустая() Тогда 
			// Заполним сейчас, иначе в обработчике "ПослеЗаписиНаСервере"
			ЗаполнитьДанныеРуководителей(Объект.Ссылка);  
		КонецЕсли;
	КонецЕсли;	

	Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
		ПроверитьЮридическоеЛицоНаСервере();
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") И ПравоДоступа("Чтение", Метаданные.Справочники.ФизическиеЛица) Тогда
		ПроверитьФизическоеЛицоНаСервере();
	КонецЕсли;	
	
	Модифицированность = Истина;

КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДанныеРуководителей(СсылкаКонтрагента)

	ДанныеРуководителейТаблица = ПолучитьИзВременногоХранилища(ДанныеРуководителей);
	Справочники.ОтветственныеЛицаКонтрагентов.ЗаполнитьОтветственныхЛиц(СсылкаКонтрагента, ДанныеРуководителейТаблица);
	ДанныеРуководителейЗаполнять = Ложь;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьЭлементКонтактнойИнформации(ВидКонтактнойИнформации, СтруктураДанных)
	
	Если СтруктураДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор  = Новый Структура("Вид", ВидКонтактнойИнформации);
	Строки = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
	ДанныеСтроки = ?(Строки.Количество() = 0, Неопределено, Строки[0]);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеСтроки.Представление = СтруктураДанных.Представление;
	ДанныеСтроки.ЗначенияПолей = СтруктураДанных.КонтактнаяИнформация;
	ДанныеСтроки.Значение = СтруктураДанных.КонтактнаяИнформация;
	ЭтотОбъект[ДанныеСтроки.ИмяРеквизита] = СтруктураДанных.Представление;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ИсторияКПП_ЗавершеноРедактирование(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Объект["КППИстория"].Очистить();
		Для Каждого СтрокаИстории Из РезультатВыбора["ИсторияКПП"] Цикл
			НоваяСтрока = Объект["КППИстория"].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИстории);
		КонецЦикла;
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРеквизитовКонтрагента()

	ЭтоИностранноеФЛ = Ложь;
	Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		
		Элементы.РеквизитыЮридическогоЛица.Видимость = Ложь;   
		Элементы.РеквизитыФизическогоЛица.Видимость = Истина;	
       	Элементы.РеквизитыУчентнойГруппы.Видимость = Ложь;
		Элементы.ГруппаДополнительнаяИнформация.Видимость = Истина;

		Если ПравоДоступа("Просмотр", Метаданные.Справочники.ФизическиеЛица) Тогда 
			
			Элементы.РеквизитыФизическогоЛица.Видимость = Истина;
			
			ЭтоИностранноеФЛ = НЕ (ФизическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") 
			ИЛИ ФизическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка"));
			
			Элементы.ГруппаРегНомераИностранца.Видимость 			= ЭтоИностранноеФЛ;
			Элементы.ФизическоеЛицоНаименованиеЛатиницей.Видимость 	= ЭтоИностранноеФЛ;
			Элементы.ФизическоеЛицоКПП.Видимость 					= ЭтоИностранноеФЛ;
			
			Элементы.ЗаполнитьПоИННФЛ.Видимость = НЕ ОтобразитьЗаполнениеПоДаннымЕГР 
			И НЕ ЭтоИностранноеФЛ
			И ЗначениеЗаполнено(ФизическоеЛицо.ИНН)
			И ЗначениеЗаполнено(ФизическоеЛицо.ОГРНИП)
			И НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ФизЛицо) = Неопределено;
			
			Элементы.ФизическоеЛицоНаименование.РедактированиеТекста = НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ФизЛицо) = Неопределено;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РеквизитыФизическогоЛица", "Видимость", Ложь);
		КонецЕсли;	
		
	ИначеЕсли Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда 
		
		Элементы.РеквизитыФизическогоЛица.Видимость = Ложь;	
		Элементы.РеквизитыЮридическогоЛица.Видимость = Истина;
		Элементы.РеквизитыУчентнойГруппы.Видимость = Ложь; 
		Элементы.ГруппаДополнительнаяИнформация.Видимость = Истина;
		
		ЭтоИностраннаяОрганизация = НЕ (ЮридическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") 
		ИЛИ ЮридическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка"));
		
		Элементы.ГруппаРеквизитыИностраннойОрганизации.Видимость 	=  ЭтоИностраннаяОрганизация;
		Элементы.БюджетныеРеквизиты.Видимость 						= НЕ ЭтоИностраннаяОрганизация;
		Элементы.ПризнакАдминистратораНачислений.Видимость 			= НЕ ЭтоИностраннаяОрганизация;
		Элементы.ЮридическоеЛицоКодОКПО.Видимость 					= НЕ ЭтоИностраннаяОрганизация;
		
		Элементы.ЗаполнитьПоИНН.Видимость = НЕ ОтобразитьЗаполнениеПоДаннымЕГР 
		И НЕ ЭтоИностраннаяОрганизация
		И НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ЮрЛицо) = Неопределено;
		
		Элементы.КнопкаЗаполнитьРеквизитыПоНаименованию.Видимость = НЕ ОтобразитьЗаполнениеПоДаннымЕГР 
		И НЕ ЭтоИностраннаяОрганизация
		И НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ЮрЛицо) = Неопределено;
		
		Элементы.ЮридическоеЛицоНаименование.РедактированиеТекста = НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Перечисления.ЮрФизЛицо.ЮрЛицо) = Неопределено; 
		
	Иначе
		Элементы.РеквизитыФизическогоЛица.Видимость = Ложь;	
		Элементы.РеквизитыЮридическогоЛица.Видимость = Ложь; 
		Элементы.РеквизитыУчентнойГруппы.Видимость = Истина; 
		Элементы.ГруппаДополнительнаяИнформация.Видимость = Ложь;   
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФизическоеЛицоИНН",
		"Видимость", Элементы.РеквизитыФизическогоЛица.Видимость);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФизическоеЛицоКПП",
		"Видимость", Элементы.РеквизитыФизическогоЛица.Видимость И ЭтоИностранноеФЛ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЮридическоеЛицоИНН",
		"Видимость", Элементы.РеквизитыЮридическогоЛица.Видимость);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЮридическоеЛицоКПП",
		"Видимость", Элементы.РеквизитыЮридическогоЛица.Видимость);
	
  	Элементы.ГруппаЗаполнениеПоДаннымЕГР.Видимость = ОтобразитьЗаполнениеПоДаннымЕГР И НЕ Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.УчетнаяГруппа; 
	
КонецПроцедуры // УстановитьВидимостьРеквизитовКонтрагента()

&НаСервере
Процедура ИнициализироватьРегистрыКонтрагентаДляРедактированияВФорме()

	Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		
		// сбросим значения
		ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект,
			"ФИОФизическихЛиц",	Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));
		ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект,
			"ГражданствоФизическихЛиц",	Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));
		
		Если ОбщегоНазначения.СсылкаСуществует(ФизическоеЛицоСсылка) Тогда

			Корреспонденты.ПрочитатьДокументУдостоверяющийЛичностьДляРедактированияВФорме(ЭтотОбъект,
				ФизическоеЛицоСсылка);
			ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект,
				"ФИОФизическихЛиц",	Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));
			ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект,
				"ГражданствоФизическихЛиц",	Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));

		Иначе

			Корреспонденты.ИнициализироватьДокументУдостоверяющийЛичностьДляРедактированияВФорме(ЭтотОбъект,
				ФизическоеЛицоСсылка);

		КонецЕсли;
		
		ЭтоФизическоеЛицо = Истина;
		ГражданствоФизическихЛицЛицоБезГражданства = НЕ ЗначениеЗаполнено(ГражданствоФизическихЛиц.Страна);
		
	Иначе
		Справочники.Контрагенты.ОбнулитьДокументУдостоверящийЛичностьВФорме(ЭтаФорма, ФизическоеЛицоСсылка);
		Справочники.Контрагенты.ОбнулитьЗаписьВФорме(ЭтаФорма,"ФИОФизическихЛиц", ФизическоеЛицоСсылка);
		
		ЭтоФизическоеЛицо = Ложь;
	КонецЕсли;

КонецПроцедуры // ИнициализироватьРегистрыКонтрагентаДляРедактированияВФорме()

&НаСервере
Процедура ОбновитьДанныеКонтрагента()

	Если ЗначениеЗаполнено(Объект.ЮридическоеФизическоеЛицо) И НЕ ОбщегоНазначения.СсылкаСуществует(Объект.ЮридическоеФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		Если ПравоДоступа("Просмотр", Метаданные.Справочники.ФизическиеЛица) Тогда
			ПрочитатьДанныеФизЛица();
		КонецЕсли;	
	ИначеЕсли Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		ПрочитатьДанныеЮрЛица();
	КонецЕсли;   
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда    
		УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ФизическоеЛицо, "КонтактнаяИнформация"); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтактнаяИнформация", "Видимость", Истина);
	ИначеЕсли Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда 
		УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ЮридическоеЛицо, "КонтактнаяИнформация"); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтактнаяИнформация", "Видимость", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтактнаяИнформация", "Видимость", Ложь); 
		Элементы.ГруппаОшибки.Видимость = Ложь;  
		ОбщегоНазначенияклиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЗаполнениеПоДаннымЕГР", "Видимость", Ложь);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	Если НЕ РеквизитыПроверкиКонтрагентов = Неопределено Тогда
		РеквизитыПроверкиКонтрагентов.ЭтоЮридическоеЛицо = НЕ Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.УчетнаяГруппа") 
		И Объект.ВидКонтрагента <> ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо");
	КонецЕсли;	
	
КонецПроцедуры // ОбновитьДанныеКонтрагента()

 // Процедура проверят, есть ли выбранное физическое/юридическое лицо в списке контрагентов.
 // Если нет, то производит заполнение реквизитов из выбранного физического/юридического лица.
 //
&НаСервере
Процедура ОбработатьВыборЮридическогоФизическогоЛица(ВыбранноеЗначение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Контрагенты.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ЮридическоеФизическоеЛицо = &ЮридическоеФизическоеЛицо";
	Запрос.УстановитьПараметр("ЮридическоеФизическоеЛицо", ВыбранноеЗначение);
	Если Запрос.Выполнить().Пустой() Тогда

		Объект.ЮридическоеФизическоеЛицо = ВыбранноеЗначение;
		Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			ЮридическоеЛицоСсылка = Справочники.ЮридическиеЛица.ПустаяСсылка();
		ИначеЕсли Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			ФизическоеЛицоСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();
		КонецЕсли;
		
		ОбновитьРеквизитыЮрФизЛица();
		
	Иначе
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Выбранное %1 лицо уже есть в списке контрагентов.'"),?(ЭтоФизическоеЛицо, "физическое", "юридическое"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры // ОбработатьВыборЮридическогоФизическогоЛица()

&НаСервере
Процедура ОбновитьРеквизитыЮрФизЛица()
	
	ЗаполнитьЗначенияСвойств(Объект, Объект.ЮридическоеФизическоеЛицо,, "Код,Ссылка,КонтактнаяИнформация,Родитель"); 
	
	ОбновитьДанныеКонтрагентаИИнициализироватьРегистры();
	
	УстановитьВидимостьРеквизитовКонтрагента();
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьФИОФизЛица()
	
	ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ФИОФизическихЛиц",  Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));
	
	ФизическоеЛицо.Наименование = ФИОФизическихЛиц.Фамилия + " " + ФИОФизическихЛиц.Имя + " " + ФИОФизическихЛиц.Отчество;
	
	Объект.Наименование = ФизическоеЛицо.Наименование; 
	
КонецПроцедуры		

// Изменение вида контрагента

&НаКлиенте
Процедура ВидКонтрагентаПриИзмененииКлиент()
	
	ВидКонтрагентаПриИзмененииСервер();
	
	Если НЕ ДоступныеВидыКонтрагентов.НайтиПоЗначению(Объект.ВидКонтрагента) = Неопределено Тогда
		Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
			КорреспондентыКлиент.ОбновитьОтображениеПолейВводаГражданства(ЭтаФорма);
			Объект.КПП = "";
			Если ЗначениеЗаполнено(ФизическоеЛицо.ИНН) Тогда
				Объект.ИНН = ФизическоеЛицо.ИНН;
			Иначе
				ФизическоеЛицо.ИНН = Объект.ИНН;
			КонецЕсли;
			Если ЗначениеЗаполнено(ФизическоеЛицо.КПП) Тогда
				Объект.КПП = ФизическоеЛицо.КПП;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ФизическоеЛицо.СтранаРегистрации) Тогда
				ФизическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
			КонецЕсли;	
		ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
			Если ЗначениеЗаполнено(ЮридическоеЛицо.КПП) Тогда
				Объект.КПП = ЮридическоеЛицо.КПП;
			Иначе
				ЮридическоеЛицо.КПП = Объект.КПП;
			КонецЕсли;
			Если ЗначениеЗаполнено(ЮридическоеЛицо.ИНН) Тогда
				Объект.ИНН = ЮридическоеЛицо.ИНН;
			Иначе
				ЮридическоеЛицо.ИНН = Объект.ИНН;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ЮридическоеЛицо.СтранаРегистрации) Тогда
				ЮридическоеЛицо.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
			КонецЕсли;
		Иначе
			// Это учетная группа
			Объект.ЮридическоеФизическоеЛицо = Неопределено;
			Объект.КПП = "";
			Объект.ИНН = "";
		КонецЕсли;
	КонецЕсли;

	ОчиститьОбособленноеПодразделение();
	
	НастроитьДоступностьГоловнойОрганизации();
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентаВСправочнике(ЭтотОбъект);
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	ЭтотОбъект.ИндексыСПАРКРиски = Неопределено;
	ОбновитьОтображениеИндексыСПАРК();
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	
КонецПроцедуры

&НаСервере
Процедура ВидКонтрагентаПриИзмененииСервер()
	
	ОчиститьЮридическоеФизическоеЛицо();
	ПолучитьСсылкуЮридическогоИлиФизическогоЛица();
	ПроверитьКонтактнаяИнформацияИнициализирована();	
	УстановитьВидимостьРеквизитовКонтрагента();
	ОбновитьДанныеКонтрагентаИИнициализироватьРегистры();
	
КонецПроцедуры // ВидКонтрагентаПриИзмененииСервер()

&НаСервере
Процедура ОчиститьЮридическоеФизическоеЛицо()

	ОчиститьЮридическоеФизическоеЛицо = 
		(Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо
			И ТипЗнч(Объект.ЮридическоеФизическоеЛицо) <> Тип("СправочникСсылка.ЮридическиеЛица"))
		Или
		(Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо
			И ТипЗнч(Объект.ЮридическоеФизическоеЛицо) <> Тип("СправочникСсылка.ФизическиеЛица"))
		Или
		(Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.УчетнаяГруппа
			И ТипЗнч(Объект.ЮридическоеФизическоеЛицо) <> Тип("Неопределено"));
		
	Если ОчиститьЮридическоеФизическоеЛицо Тогда
		Объект.ЮридическоеФизическоеЛицо = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСсылкуЮридическогоИлиФизическогоЛица()
	
	Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо 
		И ЮридическоеЛицоСсылка	= Справочники.ЮридическиеЛица.ПустаяСсылка() Тогда

		ЮридическоеЛицоСсылка = Справочники.ЮридическиеЛица.ПолучитьСсылку();

	ИначеЕсли Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо
		И ФизическоеЛицоСсылка = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда

		ФизическоеЛицоСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку();

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКонтактнаяИнформацияИнициализирована()
	
	Если Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо
		И Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект,
			"ПараметрыКонтактнойИнформации") Тогда

		УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, ЮридическоеЛицо, "КонтактнаяИнформация");

	ИначеЕсли Объект.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо
		И Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект,
			"ПараметрыКонтактнойИнформации")  Тогда 			

		УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, ФизическоеЛицо, "КонтактнаяИнформация");

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКонтрагентаИИнициализироватьРегистры()

	ОбновитьДанныеКонтрагента();
	ИнициализироватьРегистрыКонтрагентаДляРедактированияВФорме();
	
	Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
		ПроверитьЮридическоеЛицоНаСервере();
	ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо") Тогда
		ПроверитьФизическоеЛицоНаСервере();
	КонецЕсли;	
	
КонецПроцедуры // ОбновитьДанныеКонтрагентаИИнициализироватьРегистры()

&НаКлиенте
Процедура ПроверитьВидКонтрагентаЮрЛицо(НаименованиеДляПроверки, ЗаполнитьРеквизиты = Истина)
	
	СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Объект.Наименование);

	ПолПоНаименованию = КорреспондентыКлиентСервер.ОпределитьПолПоОтчеству(СтруктураФИО.Отчество);
	
	Если ПолПоНаименованию = Неопределено Тогда
		
		ДействияПриИзмененииНаименованияЮрЛица(ЗаполнитьРеквизиты);
		
	Иначе	
		
		ТекстВопроса = НСтр("ru = 'Вы уверены, что контрагент %1 
		|является ЮРИДИЧЕСКИМ ЛИЦОМ?
		|
		|Изменить вид контагента на ""Физическое лицо""?'");
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, Объект.Наименование);	
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Направление", "Юрлицо_ФизЛицо");
		ДополнительныеПараметры.Вставить("ЗаполнитьРеквизиты", ЗаполнитьРеквизиты);
		ДополнительныеПараметры.Вставить("ФИО", Объект.Наименование);
		ДополнительныеПараметры.Вставить("Пол", ПолПоНаименованию);

		
		ОписаниеОповещенияПроверка = Новый ОписаниеОповещения("ДействияПриПроверкеВидаКонтрагента", ЭтотОбъект, ДополнительныеПараметры);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Изменить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не изменять, все указано верно'"));
		
		ПоказатьВопрос(ОписаниеОповещенияПроверка, ТекстВопроса, Кнопки, 20, КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВидКонтрагентаФизЛицо(НаименованиеДляПроверки, ЗаполнитьРеквизиты = Истина)
	
	СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(НаименованиеДляПроверки);

	ПолПоНаименованию = КорреспондентыКлиентСервер.ОпределитьПолПоОтчеству(СтруктураФИО.Отчество);
	
	Если НЕ ПолПоНаименованию = Неопределено Тогда
		
		ЗаполнитьФИО(ЭтотОбъект);
		ЗапроситьРежимИзмененияФИО(ЭтотОбъект, ФИОФизическихЛиц.Период);
		ПроверитьФизическоеЛицоНаСервере();
		ПроверитьПохожихСотрудников();
		
	Иначе	
		
		ТекстВопроса = НСтр("ru = 'Вы уверены, что контрагент %1 
		|является ФИЗИЧЕСКИМ ЛИЦОМ?
		|
		|Изменить вид контагента на ""Юридическое лицо""?'");
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, Объект.Наименование);	
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Направление", "ФизЛицо_Юрлицо");
		ДополнительныеПараметры.Вставить("ЗаполнитьРеквизиты", ЗаполнитьРеквизиты);
		ДополнительныеПараметры.Вставить("Наименование", НаименованиеДляПроверки);
		
		ОписаниеОповещенияПроверка = Новый ОписаниеОповещения("ДействияПриПроверкеВидаКонтрагента", ЭтотОбъект, ДополнительныеПараметры);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Изменить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не изменять, все указано верно'"));
		
		ПоказатьВопрос(ОписаниеОповещенияПроверка, ТекстВопроса, Кнопки, 20, КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияПриПроверкеВидаКонтрагента(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		
		Если ДополнительныеПараметры.Направление = "Юрлицо_ФизЛицо" Тогда
			ДействияПриИзмененииНаименованияЮрЛица(ДополнительныеПараметры.ЗаполнитьРеквизиты);
		Иначе
			ЗаполнитьФИО(ЭтотОбъект);
			ЗапроситьРежимИзмененияФИО(ЭтотОбъект, ФИОФизическихЛиц.Период);
			ПроверитьФизическоеЛицоНаСервере();
			ПроверитьПохожихСотрудников();
		КонецЕсли;	
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Направление = "Юрлицо_ФизЛицо" Тогда
		
		Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо");
		ВидКонтрагентаПриИзмененииКлиент();
		
		ЭтоФизическоеЛицо = Истина;
		
		ФизическоеЛицо.Наименование = ДополнительныеПараметры.ФИО;
		ЗаполнитьФИО(ЭтотОбъект);
		ПроверитьФизическоеЛицоНаСервере();
		
		ТекущийЭлемент = Элементы.ФизическоеЛицоНаименование;
		
	Иначе
		Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо");
		
		Объект.Наименование = ДополнительныеПараметры.Наименование;

		ВидКонтрагентаПриИзмененииКлиент();
		
		ДействияПриИзмененииНаименованияЮрЛица(ДополнительныеПараметры.ЗаполнитьРеквизиты);
		
		ЭтоФизическоеЛицо = Ложь;

		ТекущийЭлемент = Элементы.ЮридическоеЛицоНаименование;
		
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура ДействияПриИзмененииНаименованияЮрЛица(ЗаполнитьРеквизиты = Истина)
	
	Если  НЕ ЗаполнитьРеквизиты Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ЮридическоеЛицо.НаименованиеПолное) Тогда
		ЮридическоеЛицо.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НаименованиеСокращенное) тогда
		Объект.НаименованиеСокращенное = Объект.Наименование;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОбособленноеПодразделение()
	
	Объект.ОбособленноеПодразделение = Ложь;
	Объект.ГоловнаяОрганизация = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьГоловнуюОрганизацию()
	Если НЕ Объект.ОбособленноеПодразделение Тогда
		Объект.ГоловнаяОрганизация = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьГоловнойОрганизации()
	Элементы["ГоловнаяОрганизация"].Доступность = Объект.ОбособленноеПодразделение;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// данные физ лица

&НаСервере
Процедура ПрочитатьДанныеФизЛица()
	
	Если ЗначениеЗаполнено(Объект.ЮридическоеФизическоеЛицо) Тогда
		
		Если ТипЗнч(Объект.ЮридическоеФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			
			ЗначениеВРеквизитФормы(Объект.ЮридическоеФизическоеЛицо.ПолучитьОбъект(),"ФизическоеЛицо");
			ФизическоеЛицоСсылка = Объект.ЮридическоеФизическоеЛицо;
			
			Если ФизическоеЛицо.ПометкаУдаления Тогда
				ФизическоеЛицо.ПометкаУдаления = Ложь;
			КонецЕсли;	 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПрочитатьДанныеФизЛица()


////////////////////////////////////////////////////////////////////////////////
// ФИО физ лица

&НаСервере
Процедура ЗаписатьФИОФизЛица()
	ОбщегоНазначенияБГУ.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, "ФИОФизическихЛиц", Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));
КонецПроцедуры // ЗаписатьФИОФизЛица()

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьФИО(Форма)
	
	СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Форма.Объект.Наименование);

	Форма.ФизическоеЛицо.Наименование = Форма.Объект.Наименование;
	
	Форма.ФИОФизическихЛиц.Фамилия  	= СтруктураФИО.Фамилия;
	Форма.ФИОФизическихЛиц.Имя 			= СтруктураФИО.Имя;		
	Форма.ФИОФизическихЛиц.Отчество 	= СтруктураФИО.Отчество;
	
	Если НЕ ЗначениеЗаполнено(Форма.ФИОФизическихЛиц.Период) Тогда
		Если ЗначениеЗаполнено(Форма.ФизическоеЛицо.ДатаРождения) Тогда
			Форма.ФИОФизическихЛиц.Период = Форма.ФизическоеЛицо.ДатаРождения;
		Иначе
			Форма.ФИОФизическихЛиц.Период = '19800101';
		КонецЕсли;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Форма.ФИОФизическихЛиц.Отчество) И Не ЗначениеЗаполнено(Форма.ФизическоеЛицо.Пол) Тогда
		Форма.ФизическоеЛицо.Пол = КорреспондентыКлиентСервер.ОпределитьПолПоОтчеству(Форма.ФИОФизическихЛиц.Отчество);
	КонецЕсли;
	
	Форма.Объект.Наименование = Форма.ФизическоеЛицо.Наименование; 
	
	Если ЗначениеЗаполнено(Форма.ФизическоеЛицо.ДатаРегистрации) ИЛИ 
		ЗначениеЗаполнено(Форма.ФизическоеЛицо.СвидетельствоСерияНомер) ИЛИ 
		ЗначениеЗаполнено(Форма.ФизическоеЛицо.СвидетельствоДата) ИЛИ
		ЗначениеЗаполнено(Форма.ФизическоеЛицо.ОГРНИП) Тогда
		Форма.Объект.НаименованиеСокращенное = Форма.ФизическоеЛицо.Наименование;
	КонецЕсли;
	
КонецПроцедуры // ПриИзмененииНаименованияФизическогоЛица()

&НаКлиенте
Процедура ПроверитьПохожихСотрудников()
	
	Если НЕ ЗначениеЗаполнено(Объект.ЮридическоеФизическоеЛицо) И 
		НЕ ПустаяСтрока(ФИОФизическихЛиц.Фамилия) И
		НЕ ПустаяСтрока(ФИОФизическихЛиц.Имя) Тогда
		
		СписокФИО = ПодобратьСписокФизЛиц(ФизическоеЛицоСсылка, ФИОФизическихЛиц.Фамилия, ФИОФизическихЛиц.Имя, ФИОФизическихЛиц.Отчество);
		
		Если СписокФИО.Количество() > 0 Тогда
			
			РезультатВыбора = ОткрытьФорму("Справочник.Сотрудники.Форма.СотрудникиСПохожимиИменами", Новый Структура("ОдинаковыеСотрудники", СписокФИО),
				ЭтотОбъект,,,,Новый ОписаниеОповещения("ОбработкаВыборкаСотрудникаСПохожимИменем", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;			
		
	Иначе
		
		ФИОПриИзменении();
		
	КонецЕсли;		
	
КонецПроцедуры // ПроверитьПохожихСотрудников()

&НаКлиенте
Процедура ОбработкаВыборкаСотрудникаСПохожимИменем(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		ФизическоеЛицоСсылка = РезультатВыбора.ФизическоеЛицо;
		Объект.ЮридическоеФизическоеЛицо = ФизическоеЛицоСсылка;
		Объект.Наименование = Строка(ФизическоеЛицоСсылка);
		ОбновитьДанныеКонтрагентаИИнициализироватьРегистры();
	Иначе
		ФИОПриИзменении();
	КонецЕсли;

КонецПроцедуры


&НаСервереБезКонтекста
Функция ПодобратьСписокФизЛиц(ФизическоеЛицоСсылка, Знач Фамилия, Знач Имя, Знач Отчество)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛица.Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ФизическиеЛица.Ссылка = Контрагенты.ЮридическоеФизическоеЛицо
	|ГДЕ
	|	(НЕ ФизическиеЛица.ЭтоГруппа)
	|	И (ФизическиеЛица.Наименование ПОДОБНО &ФамилияИмяОтчество СПЕЦСИМВОЛ ""~""
	|			ИЛИ ФизическиеЛица.Наименование ПОДОБНО &ИмяОтчествоФамилия СПЕЦСИМВОЛ ""~"")
	|	И ФизическиеЛица.Ссылка <> &ФизическоеЛицоСсылка
	|	И Контрагенты.Ссылка ЕСТЬ NULL ";
	
	Фамилия = ?(ПустаяСтрока(Фамилия), "", Фамилия+"%");
	Имя = ?(ПустаяСтрока(Имя), "", Имя+"%");
	Отчество = ?(ПустаяСтрока(Отчество), "", Отчество+"%");
	
	Запрос.УстановитьПараметр("ФамилияИмяОтчество", Фамилия + Имя + Отчество);
	Запрос.УстановитьПараметр("ИмяОтчествоФамилия", Имя + Отчество + Фамилия);
	Запрос.УстановитьПараметр("ФизическоеЛицоСсылка", ФизическоеЛицоСсылка);
	
	МассивФизлиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СписокФизлиц = Новый СписокЗначений;
	СписокФизлиц.ЗагрузитьЗначения(МассивФизлиц);
	
	Возврат СписокФизЛиц;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// удостоверение личности физ лица

&НаСервере
Процедура ЗаписатьУдостоверениеЛичностиФизЛица()

	Корреспонденты.ЗаписатьДокументУдостоверяющийЛичностьПослеРедактированияВФорме(ЭтаФорма, ФизическоеЛицоСсылка);	

КонецПроцедуры // ЗаписатьУдостоверениеЛичностиФизЛица()

// Устанавливает отметку незаполненного у поля период удостоверения личности
//
&НаКлиенте
Процедура ОбновитьПолеПериодУдостоверениеЛичности()

	Если  НЕ (ЗначениеЗаполнено(ДокументыФизическихЛиц.ВидДокумента) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.Серия) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.Номер) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.КемВыдан) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.ДатаВыдачи) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.КодПодразделения)) Тогда
		
		Элементы.ДокументыФизическихЛицПериод.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ДокументыФизическихЛицПериод.ОтметкаНезаполненного = Ложь;
	Иначе		
		Элементы.ДокументыФизическихЛицПериод.АвтоОтметкаНезаполненного = Истина;
		Если ЗначениеЗаполнено(ДокументыФизическихЛиц.Период) Тогда
			Элементы.ДокументыФизическихЛицПериод.ОтметкаНезаполненного = Ложь;
		Иначе
			Элементы.ДокументыФизическихЛицПериод.ОтметкаНезаполненного = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьУдостоверениеЛичности();
		

КонецПроцедуры // ОбновитьПолеПериодУдостоверениеЛичности()

////////////////////////////////////////////////////////////////////////////////
// данные юр лица

&НаСервере
Процедура ПрочитатьДанныеЮрЛица()
	
	Если ЗначениеЗаполнено(Объект.ЮридическоеФизическоеЛицо) Тогда
		
		Если ТипЗнч(Объект.ЮридическоеФизическоеЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
			ЗначениеВРеквизитФормы(Объект.ЮридическоеФизическоеЛицо.ПолучитьОбъект(),"ЮридическоеЛицо");
			ЮридическоеЛицоСсылка = Объект.ЮридическоеФизическоеЛицо;
			
			Если ЮридическоеЛицо.ПометкаУдаления Тогда
				ЮридическоеЛицо.ПометкаУдаления = Ложь;
			КонецЕсли;	 
			
		КонецЕсли;		
		
	КонецЕсли;	
	
КонецПроцедуры // ПрочитатьДанныеЮрЛица()

// ИнтернетПоддержкаПользователей.СПАРКРиски
&НаКлиенте
Процедура Подключаемый_ОбновитьОтображениеИндексыСПАРК()
	ОбновитьОтображениеИндексыСПАРК();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеИндексыСПАРК()
	ПараметрыОтображения = СПАРКРискиКлиентСервер.ПараметрыОтображенияДанныхСПАРК();
	СПАРКРискиКлиент.ОтобразитьИндексыСПАРК(
	ЭтотОбъект.ИндексыСПАРКРиски,
	Объект,
	Объект.ИНН, // Искать по ИНН
	?(Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо"), 
		ПредопределенноеЗначение("Перечисление.ВидыКонтрагентовСПАРКРиски.ИндивидуальныйПредприниматель"),
		ПредопределенноеЗначение("Перечисление.ВидыКонтрагентовСПАРКРиски.ЮридическоеЛицо")),
	ЭтотОбъект,
	ПараметрыОтображения);
КонецПроцедуры  

&НаКлиенте
Процедура Подключаемый_ОбновитьОтображениеФакторовРискаСПАРК()
	ОбновитьОтображениеФакторовРискаСПАРК();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеФакторовРискаСПАРК()
	ПараметрыОтображения = СПАРКРискиКлиентСервер.ПараметрыОтображенияДанныхСПАРК();
	СПАРКФакторыРискаКлиент.ОтобразитьФакторыРиска(
		ФакторыРискаСПАРК,
		Объект,
		Объект.ИНН,
		ЭтотОбъект,
		ПараметрыОтображения);
КонецПроцедуры
// Конец ИнтернетПоддержкаПользователей.СПАРКРиски   

// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКомандыЭДО()
	ОбменСКонтрагентамиКлиент.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

&НаКлиенте
Процедура ВыбратьИзКлассификатора(ПараметрыФормы)
	
	ПараметрыФормы.Вставить("ТекущийПериод",   		ТекущаяДата());
	ПараметрыФормы.Вставить("ТекущийКод",      		Объект[ПараметрыФормы.ИмяРеквизитаКод]);
	ПараметрыФормы.Вставить("ВернутьВсеРеквизиты",		Истина);
	
	ДополнительныеПараметры = Новый Структура("ИмяРеквизитаКод, ИмяРеквизитаНаименование", ПараметрыФормы.ИмяРеквизитаКод, ПараметрыФормы.ИмяРеквизитаНаименование);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьИзКлассификатораЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы,,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыбратьИзКлассификатораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		Модифицированность = Истина;
		Объект[ДополнительныеПараметры.ИмяРеквизитаКод] = РезультатЗакрытия.Код;
		Объект[ДополнительныеПараметры.ИмяРеквизитаНаименование] = РезультатЗакрытия.Наименование;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция СклоненияПредставления(Представление, ОбъектСсылка) 

	СоответствиеПадежей = Новый Соответствие;
	СоответствиеПадежей.Вставить(1, "Именительный");
	СоответствиеПадежей.Вставить(2, "Родительный");
	СоответствиеПадежей.Вставить(3, "Дательный");
	СоответствиеПадежей.Вставить(4, "Винительный");
	СоответствиеПадежей.Вставить(5, "Творительный");
	СоответствиеПадежей.Вставить(6, "Предложный");  
	
	СклоненияОбъекта = Новый Структура;
	
	Для Каждого Элемент Из СоответствиеПадежей Цикл
		СклоненияОбъекта.Вставить(Элемент.Значение, СклонениеПредставленийОбъектов.ПросклонятьПредставление(Представление, Элемент.Ключ, ОбъектСсылка)); 
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(СклоненияОбъекта);

КонецФункции

#КонецОбласти

#Область Инициализация

ИзмененоФИО = Ложь;

#КонецОбласти
