#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.Организация) Тогда
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.Организация.РедактированиеТекста = Ложь;
	КонецЕсли;
	РегистрыСведений.МетодыРаспределенияКосвенныхЗатратОрганизаций.УстановитьСвойстваЭлементовУчитываемыхКЭКОплатаТруда(ЭтотОбъект);
	УстановитьВидимостьКОСГУОплатаТруда(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьВидимостьКОСГУОплатаТруда(ЭтотОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи); 
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбрабтчикиСобытийЭлементовФормы

&НаКлиенте
Процедура БазаРаспределенияПриИзменении(Элемент)
	УстановитьВидимостьКОСГУОплатаТруда(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьКОСГУОплатаТруда(Форма)
	Видимость = Форма.Запись.БазаРаспределения = ПредопределенноеЗначение("Перечисление.БазыРаспределенияКосвенныхЗатрат.ОплатаТруда");
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ВключатьВБазуОплатаТрудаКЭК211");
	ИменаЭлементов.Добавить("ВключатьВБазуОплатаТрудаКЭК212");
	ИменаЭлементов.Добавить("ВключатьВБазуОплатаТрудаКЭК213");
	ИменаЭлементов.Добавить("ВключатьВБазуОплатаТрудаКЭК214");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Видимость", Видимость);
КонецПроцедуры

#КонецОбласти