#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СуммаДокумента = КапитальныеВложения.Итог("Сумма") + Материалы.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("Объект", ЭтотОбъект);
	РеквизитыДокумента.Вставить("Дата", Дата);
	РеквизитыДокумента.Вставить("Организация", Организация);
	РеквизитыДокумента.Вставить("ИФО", ИФО);
	РеквизитыДокумента.Вставить("Подразделение", Подразделение);
	РеквизитыДокумента.Вставить("СчетВложений", СчетВложений);
	РеквизитыДокумента.Вставить("КФОСписания", КФОСписания);
	РеквизитыДокумента.Вставить("КПССписания", КПССписания);
	Нс = 1;
	Таблицы = Документы.ПереносВложенийВНФА.ПолучитьТаблицы(РеквизитыДокумента, Нс);
	ОстаткиБУ = Таблицы.ОстаткиБУ;
	ТабЧасть  = Таблицы.ТабЧасть;

	СтрокаШаблона = НСтр("ru = 'По объекту ""%1"" списывается больше, чем есть в остатке'");
	Текст = "";
	ИмяСубконтоНФА = "Субконто" + Нс;
	СтруктураПоиска = Новый Структура();
	Для каждого СтрокаТЧ из ТабЧасть Цикл
		СтруктураПоиска.Вставить(ИмяСубконтоНФА, СтрокаТЧ.НФА);
		СтрокиОстатки = ОстаткиБУ.НайтиСтроки(СтруктураПоиска);
		Если СтрокиОстатки.Количество() = 0 Тогда
			Текст = СтрШаблон(СтрокаШаблона, СтрокаТЧ.НФА);
			Продолжить;
		КонецЕсли;	

		ВсегоКоличество = 0;		
		ВсегоСумма = 0;		
		Для каждого СтрокаОстатка из СтрокиОстатки Цикл
			ВсегоКоличество = ВсегоКоличество + СтрокаОстатка.Количество;		
			ВсегоСумма = ВсегоСумма + СтрокаОстатка.Сумма;		
		КонецЦикла;	
		
		Если ВсегоКоличество < СтрокаТЧ.Количество ИЛИ ВсегоСумма < СтрокаТЧ.Сумма Тогда
			Текст = ?(ЗначениеЗаполнено(Текст), Символы.ПС, "") + 
				СтрШаблон(СтрокаШаблона, СтрокаТЧ.НФА);
		КонецЕсли; 
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(Текст) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(Текст);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
