#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура СформироватьДанныеПараметрическойНастройки() Экспорт
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	мПоказателиДляОбработки=БюджетнаяОтчетность.ПолучитьПорядокВычисленияПоказателей(Ссылка,Владелец);
	
	Если мПоказателиДляОбработки=Неопределено Тогда
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось определить порядок вычисления показателей'"));
		
		БюджетнаяОтчетность.ЗаписатьДанныеПараметрическойНастройки(Ссылка, Неопределено);
		
		Возврат;
		
	КонецЕсли;
	
	мПоказателиДляОбработки.Индексы.Добавить("Код");
	
	мДеревоПересчета=БюджетнаяОтчетность.ПолучитьДеревоПересчетаПоказателей(мПоказателиДляОбработки);
	
	СтруктураПараметрики=Новый Структура;
	СтруктураПараметрики.Вставить("мДеревоПересчета"		,мДеревоПересчета);
	СтруктураПараметрики.Вставить("мПоказателиДляОбработки"	,мПоказателиДляОбработки);
	
	БюджетнаяОтчетность.ЗаписатьДанныеПараметрическойНастройки(Ссылка,СтруктураПараметрики);
	
КонецПроцедуры // СформироватьДанныеПараметрическойНастройки()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

// Процедура - обработчик событяи объекта "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка 
		ИЛИ БюджетнаяОтчетность.ЗагрузкаКомплектаОтчетности(ЭтотОбъект) 
		ИЛИ ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ПустыеСтроки = Новый Массив;
	Для Каждого СтрРасчет Из ПроцедурыОбработкиПоказателей Цикл
		Если ПустаяСтрока(СтрРасчет.Процедура) Тогда
			ПустыеСтроки.Вставить(0, СтрРасчет);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрРасчет Из ПустыеСтроки Цикл
		ПроцедурыОбработкиПоказателей.Удалить(СтрРасчет);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка
		И ПланыОбмена.ГлавныйУзел()<>Неопределено Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		//Значит в главном узле загрузили комплект.
		//Очистим кэш формул вычисляемых показателей.
		
		МенеджерЗаписи = РегистрыСведений.ХранилищеПараметрическойНастройки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ПравилоОбработки = ЭтотОбъект.Ссылка;
		
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли