
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = ?(ЗначениеЗаполнено(Параметры.Организация),
		Параметры.Организация, ОбщегоНазначенияБГУ.ТекущаяОрганизация());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Оборудование.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОборудование

&НаКлиенте
Процедура ОборудованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = Оборудование.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ПоказатьОтличияСведений(СтрокаТаблицы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиАудит(Команда)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, "Организация");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Организация");
		Возврат;
	КонецЕсли;
	
	Оборудование.Очистить();
	
	ПровестиАудитНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтличия(Команда)
	
	ТекущиеДанные = Элементы.Оборудование.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьОтличияСведений(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанные(Команда)
	
	ТекущиеДанные = Элементы.Оборудование.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючЗаписи = ИнтеграцияФРМОКлиент.КлючЗаписиМедицинскоеОборудованиеФРМО(
		Организация, ТекущиеДанные.ОсновноеСредство, ТекущиеДанные.ИнвентарныйНомер);
	ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
	ОткрытьФорму("РегистрСведений.МедицинскоеОборудованиеФРМО.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьОтличияСведений(СтрокаТаблицы)
	
	ПараметрыФормы = Новый Структура("Организация,ОсновноеСредство,ИнвентарныйНомер,Заключение", Организация);
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, СтрокаТаблицы);
	
	ОткрытьФорму("РегистрСведений.МедицинскоеОборудованиеФРМО.Форма.ФормаАудитаЗаписи", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПровестиАудитНаСервере()
	
	// Сбор данных
	
	СобытиеОС = Новый Массив;
	СобытиеОС.Добавить(Перечисления.ВидыСобытийОС.ВводВЭксплуатацию);
	СобытиеОС.Добавить(Перечисления.ВидыСобытийОС.Списание);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СобытияОС", СобытиеОС);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МедицинскоеОборудованиеФРМО.ОсновноеСредство КАК ОсновноеСредство,
	|	МедицинскоеОборудованиеФРМО.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	МедицинскоеОборудованиеФРМО.Наименование КАК Наименование,
	|	МедицинскоеОборудованиеФРМО.ТипОборудования КАК ТипОборудования,
	|	МедицинскоеОборудованиеФРМО.РазделИзделия КАК РазделИзделия,
	|	МедицинскоеОборудованиеФРМО.ТипИзделия КАК ТипИзделия,
	|	МедицинскоеОборудованиеФРМО.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	МедицинскоеОборудованиеФРМО.ДатаВыводаИзЭксплуатации КАК ДатаВыводаИзЭксплуатации,
	|	МедицинскоеОборудованиеФРМО.ПричинаВыводаИзЭксплуатации КАК ПричинаВыводаИзЭксплуатации,
	|	МедицинскоеОборудованиеФРМО.Адрес КАК Адрес,
	|	МедицинскоеОборудованиеФРМО.ИнвентарныйНомерКод КАК ИнвентарныйНомерКод,
	|	МедицинскоеОборудованиеФРМО.СерийныйНомер КАК СерийныйНомер,
	|	МедицинскоеОборудованиеФРМО.ДатаВыпуска КАК ДатаВыпуска,
	|	МедицинскоеОборудованиеФРМО.СрокСлужбы КАК СрокСлужбы,
	|	МедицинскоеОборудованиеФРМО.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Оборудование
	|ИЗ
	|	РегистрСведений.МедицинскоеОборудованиеФРМО КАК МедицинскоеОборудованиеФРМО
	|ГДЕ
	|	МедицинскоеОборудованиеФРМО.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК ОсновноеСредство,
	|	КТРУ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_КТРУ
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КТРУ КАК КТРУ
	|		ПО ОсновныеСредства.КодПоКТРУ = КТРУ.Код
	|ГДЕ
	|	ОсновныеСредства.КодПоКТРУ <> """"
	|	И ОсновныеСредства.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ.ОсновноеСредство
	|			ИЗ
	|				ВТ_Оборудование КАК ВТ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КТРУКлассификаторы.Ссылка КАК КТРУ,
	|	КТРУКлассификаторы.Классификатор КАК ТипИзделия
	|ПОМЕСТИТЬ ВТ_РазделыКТРУ
	|ИЗ
	|	Справочник.КТРУ.Классификаторы КАК КТРУКлассификаторы
	|ГДЕ
	|	КТРУКлассификаторы.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ.Ссылка
	|			ИЗ
	|				ВТ_КТРУ КАК ВТ)
	|	И КТРУКлассификаторы.Классификатор ССЫЛКА Справочник.НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам
	|	И КТРУКлассификаторы.Классификатор <> ЗНАЧЕНИЕ(Справочник.НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Оборудование.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_Оборудование.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВТ_Оборудование.Наименование КАК Наименование,
	|	ВТ_Оборудование.ТипОборудования КАК ТипОборудования,
	|	ВТ_Оборудование.РазделИзделия КАК РазделИзделия,
	|	ВТ_Оборудование.ТипИзделия КАК ТипИзделия,
	|	ВТ_Оборудование.Адрес КАК Адрес,
	|	ВТ_Оборудование.ИнвентарныйНомерКод КАК ИнвентарныйНомерКод,
	|	ВТ_Оборудование.СерийныйНомер КАК СерийныйНомер,
	|	ВТ_Оборудование.ДатаВыпуска КАК ДатаВыпуска,
	|	ВТ_Оборудование.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ВТ_Оборудование.ДатаВыводаИзЭксплуатации КАК ДатаВыводаИзЭксплуатации,
	|	ВТ_Оборудование.ПричинаВыводаИзЭксплуатации КАК ПричинаВыводаИзЭксплуатации,
	|	ВТ_Оборудование.СрокСлужбы КАК СрокСлужбы,
	|	ВТ_Оборудование.Количество КАК Количество
	|ИЗ
	|	ВТ_Оборудование КАК ВТ_Оборудование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК ОсновноеСредство,
	|	ОсновныеСредства.НаименованиеПолное КАК Наименование,
	|	ОсновныеСредства.ТипНФА КАК ТипНФА,
	|	ОсновныеСредстваКонтактнаяИнформация.Значение КАК Адрес,
	|	КТРУ.Ссылка КАК КТРУ
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КТРУ КАК КТРУ
	|		ПО ОсновныеСредства.Ссылка = КТРУ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.КонтактнаяИнформация КАК ОсновныеСредстваКонтактнаяИнформация
	|		ПО ОсновныеСредства.Ссылка = ОсновныеСредстваКонтактнаяИнформация.Ссылка
	|			И (ОсновныеСредстваКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестонахожденияОбъектаОС))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Изготовители.КонтактнаяИнформация КАК ИзготовителиКонтактнаяИнформация
	|		ПО ОсновныеСредства.ИзготовительОС = ИзготовителиКонтактнаяИнформация.Ссылка
	|			И (ИзготовителиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресИзготовителя))
	|ГДЕ
	|	ОсновныеСредства.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ.ОсновноеСредство
	|			ИЗ
	|				ВТ_Оборудование КАК ВТ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ВТ_Оборудование КАК ВТ)) КАК РасчетАмортизацииОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентарныеНомераОС.Ссылка КАК ИнвентарныйНомер,
	|	ИнвентарныеНомераОС.Код КАК ИнвентарныйНомерКод,
	|	ИнвентарныеНомераОС.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ИнвентарныеНомераОС.ДатаВыпуска КАК ДатаВыпуска
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|ГДЕ
	|	ИнвентарныеНомераОС.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ.ИнвентарныйНомер
	|			ИЗ
	|				ВТ_Оборудование КАК ВТ
	|			ГДЕ
	|				ВТ.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер,
	|	СобытияОССрезПоследних.Событие КАК Событие,
	|	СобытияОССрезПоследних.ДатаСобытия КАК ДатаСобытия,
	|	СобытияОССрезПоследних.ПричинаСписания КАК ПричинаСписания
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			,
	|			(ОсновноеСредство, ИнвНомер) В
	|					(ВЫБРАТЬ
	|						ВТ.ОсновноеСредство,
	|						ВТ.ИнвентарныйНомер
	|					ИЗ
	|						ВТ_Оборудование КАК ВТ
	|					ГДЕ
	|						ВТ.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка))
	|				И Организация = &Организация
	|				И Событие В (&СобытияОС)) КАК СобытияОССрезПоследних
	|ГДЕ
	|	СобытияОССрезПоследних.ДатаСобытия <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РазделыКТРУ.КТРУ КАК КТРУ,
	|	ВТ_РазделыКТРУ.ТипИзделия КАК ТипИзделия
	|ИЗ
	|	ВТ_РазделыКТРУ КАК ВТ_РазделыКТРУ
	|ИТОГИ ПО
	|	КТРУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Классификатор.Ссылка КАК ТипИзделия,
	|	Классификатор.Раздел КАК РазделИзделия,
	|	Классификатор.Раздел.Родитель КАК Родитель1,
	|	ЕСТЬNULL(Классификатор.Раздел.Родитель.Родитель, ЗНАЧЕНИЕ(Справочник.РазделыНоменклатурнойКлассификацииМедицинскихИзделийПоВидам.ПустаяСсылка)) КАК Родитель2
	|ИЗ
	|	Справочник.НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам.Разделы КАК Классификатор
	|ГДЕ
	|	Классификатор.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ.ТипИзделия
	|			ИЗ
	|				ВТ_РазделыКТРУ КАК ВТ)
	|ИТОГИ ПО
	|	ТипИзделия";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаОборудование			= Результат[3].Выбрать();
	ВыборкаОсновноеСредство		= Результат[4].Выбрать();
	ВыборкаРасчетАмортизации	= Результат[5].Выбрать();
	ВыборкаИнвентарныйНомер		= Результат[6].Выбрать();
	ВыборкаСобытияОС			= Результат[7].Выбрать();
	ВыборкаКТРУ					= Результат[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаРазделыТипов			= Результат[9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СведенияКТРУ = Новый Соответствие;
	Пока ВыборкаКТРУ.Следующий() Цикл
		ВыборкаКТРУКлассификатор = ВыборкаКТРУ.Выбрать();
		Если ВыборкаКТРУКлассификатор.Следующий() Тогда
			СведенияКТРУ.Вставить(ВыборкаКТРУ.КТРУ, ВыборкаКТРУКлассификатор.ТипИзделия);
		КонецЕсли;
	КонецЦикла;
	
	СрокСлужбыОС = Новый Соответствие;
	Пока ВыборкаРасчетАмортизации.Следующий() Цикл
		СрокСлужбыОС.Вставить(
			ВыборкаРасчетАмортизации.ОсновноеСредство,
			Окр(ВыборкаРасчетАмортизации.СрокПолезногоИспользования / 12)
		);
	КонецЦикла;
	
	РазделыТипов = Новый Соответствие;
	Пока ВыборкаРазделыТипов.Следующий() Цикл
		
		ВыборкаРазделыТипа = ВыборкаРазделыТипов.Выбрать();
		
		РазделыВсе = Новый Массив;
		РазделыРодители = Новый Массив;
		Пока ВыборкаРазделыТипа.Следующий() Цикл
			РазделыВсе.Добавить(ВыборкаРазделыТипа.РазделИзделия);
			Если ЗначениеЗаполнено(ВыборкаРазделыТипа.Родитель1) Тогда
				РазделыРодители.Добавить(ВыборкаРазделыТипа.Родитель1);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыборкаРазделыТипа.Родитель2) Тогда
				РазделыРодители.Добавить(ВыборкаРазделыТипа.Родитель2);
			КонецЕсли;
		КонецЦикла;
		
		КрайниеРазделы = Новый Массив;
		Для Каждого Раздел Из РазделыВсе Цикл
			Если РазделыРодители.Найти(Раздел) = Неопределено Тогда
				КрайниеРазделы.Добавить(Раздел);
			КонецЕсли;
		КонецЦикла;
		
		Если КрайниеРазделы.Количество() = 1 Тогда
			РазделыТипов.Вставить(ВыборкаРазделыТипов.ТипИзделия, КрайниеРазделы[0]);
		КонецЕсли;
		
	КонецЦикла;
	
	СведенияОС = Новый Соответствие;
	Пока ВыборкаОсновноеСредство.Следующий() Цикл
		
		ТипИзделия = ?(ЗначениеЗаполнено(ВыборкаОсновноеСредство.КТРУ),
			СведенияКТРУ[ВыборкаОсновноеСредство.КТРУ], Неопределено);
		РазделИзделия = ?(ТипИзделия = Неопределено, Неопределено, РазделыТипов[ТипИзделия]);
		ТипОборудования = ?(ВыборкаОсновноеСредство.ТипНФА = Перечисления.ТипыНФА.Транспорт,
			Перечисления.ТипыМедицинскогоОборудованияФРМО.Автотранспорт,
			?(ТипИзделия = Неопределено, Неопределено, Перечисления.ТипыМедицинскогоОборудованияФРМО.Медицинское));
		АдресФРМО = ?(ЗначениеЗаполнено(ВыборкаОсновноеСредство.Адрес),
			ИнтеграцияФРМО.АдресБГУвФРМО(ВыборкаОсновноеСредство.Адрес).Значение, Неопределено);
		
		Сведения = Новый Структура;
		Сведения.Вставить("Наименование"	, ВыборкаОсновноеСредство.Наименование);
		Сведения.Вставить("ТипОборудования"	, ТипОборудования);
		Сведения.Вставить("ТипИзделия"		, ТипИзделия);
		Сведения.Вставить("РазделИзделия"	, РазделИзделия);
		Сведения.Вставить("Адрес"			, АдресФРМО);
		Сведения.Вставить("СрокСлужбы"		, СрокСлужбыОС[ВыборкаОсновноеСредство.ОсновноеСредство]);
		
		СведенияОС.Вставить(ВыборкаОсновноеСредство.ОсновноеСредство, Сведения);
		
	КонецЦикла;
	
	СведенияОбъекта = Новый Соответствие;
	Пока ВыборкаИнвентарныйНомер.Следующий() Цикл
		
		Сведения = Новый Структура;
		Сведения.Вставить("ИнвентарныйНомерКод"			, СокрЛП(ВыборкаИнвентарныйНомер.ИнвентарныйНомерКод));
		Сведения.Вставить("СерийныйНомер"				, СокрЛП(ВыборкаИнвентарныйНомер.ЗаводскойНомер));
		Сведения.Вставить("ДатаВыпуска"					, ВыборкаИнвентарныйНомер.ДатаВыпуска);
		Сведения.Вставить("ДатаВводаВЭксплуатацию"		, '00010101');
		Сведения.Вставить("ДатаВыводаИзЭксплуатации"	, '00010101');
		Сведения.Вставить("ПричинаВыводаИзЭксплуатации"	, Неопределено);
		Сведения.Вставить("Количество"					, 1);
		
		СведенияОбъекта.Вставить(ВыборкаИнвентарныйНомер.ИнвентарныйНомер, Сведения);
		
	КонецЦикла;
	
	Пока ВыборкаСобытияОС.Следующий() Цикл
		Если ВыборкаСобытияОС.Событие = Перечисления.ВидыСобытийОС.ВводВЭксплуатацию Тогда
			СведенияОбъекта[ВыборкаСобытияОС.ИнвентарныйНомер].ДатаВводаВЭксплуатацию = НачалоДня(ВыборкаСобытияОС.ДатаСобытия);
		ИначеЕсли ВыборкаСобытияОС.Событие = Перечисления.ВидыСобытийОС.Списание Тогда
			СведенияОбъекта[ВыборкаСобытияОС.ИнвентарныйНомер].ДатаВыводаИзЭксплуатации = НачалоДня(ВыборкаСобытияОС.ДатаСобытия);
			Если ЗначениеЗаполнено(ВыборкаСобытияОС.ПричинаСписания) Тогда
				СведенияОбъекта[ВыборкаСобытияОС.ИнвентарныйНомер].ПричинаВыводаИзЭксплуатации = ВыборкаСобытияОС.ПричинаСписания;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Вычисление заключения
	
	Пока ВыборкаОборудование.Следующий() Цикл
		
		Заключение = Новый ТаблицаЗначений;
		Заключение.Колонки.Добавить("ИмяРеквизита");
		Заключение.Колонки.Добавить("ПредставлениеРеквизита");
		Заключение.Колонки.Добавить("ЗначениеФРМО");
		Заключение.Колонки.Добавить("ЗначениеБГУ");
		Заключение.Колонки.Добавить("ПредставлениеФРМО");
		Заключение.Колонки.Добавить("ПредставлениеБГУ");
		
		СведенияТекОС = СведенияОС[ВыборкаОборудование.ОсновноеСредство];
		
		ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОС, "Наименование"		, "Наименование");
		ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОС, "ТипОборудования"	, "Тип оборудования");
		ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОС, "РазделИзделия"		, "Раздел изделия");
		ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОС, "ТипИзделия"			, "Тип изделия");
		ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОС, "СрокСлужбы"			, "Срок службы");
		ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОС, "Адрес"				, "Адрес");
		
		Если ЗначениеЗаполнено(ВыборкаОборудование.ИнвентарныйНомер) Тогда
			
			СведенияТекОбъекта = СведенияОбъекта[ВыборкаОборудование.ИнвентарныйНомер];
			
			ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОбъекта, "ИнвентарныйНомерКод"			, "Инвентарный номер");
			ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОбъекта, "СерийныйНомер"					, "Серийный номер");
			ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОбъекта, "ДатаВыпуска"					, "Дата выпуска");
			ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОбъекта, "ДатаВводаВЭксплуатацию"		, "Дата ввода в эксплуатацию");
			ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОбъекта, "ДатаВыводаИзЭксплуатации"		, "Дата вывода из эксплуатации");
			ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОбъекта, "ПричинаВыводаИзЭксплуатации"	, "Причина вывода из эксплуатации");
			ЗаключениеПоля(Заключение, ВыборкаОборудование, СведенияТекОбъекта, "Количество"					, "Количество");
			
		Иначе
			
			ЗаключениеПоляПустойНомер(Заключение, ВыборкаОборудование, "ИнвентарныйНомерКод", "Инвентарный номер");
			ЗаключениеПоляПустойНомер(Заключение, ВыборкаОборудование, "СерийныйНомер"		, "Серийный номер");
			
		КонецЕсли;
		
		Если Заключение.Количество() > 0 Тогда
			
			НоваяСтрока						= Оборудование.Добавить();
			НоваяСтрока.ОсновноеСредство	= ВыборкаОборудование.ОсновноеСредство;
			НоваяСтрока.ИнвентарныйНомер	= ВыборкаОборудование.ИнвентарныйНомер;
			НоваяСтрока.Отличий				= Заключение.Количество();
			НоваяСтрока.Заключение			= ОбщегоНазначения.ЗначениеВСтрокуXML(Заключение);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаключениеПоля(Заключение, ИсточникФРМО, ИсточникБГУ, ИмяРеквизита, Представление)
	
	ПолеБГУ = ИсточникБГУ[ИмяРеквизита];
	
	Если ПолеБГУ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеФРМО = ИсточникФРМО[ИмяРеквизита];
	
	Если ИмяРеквизита = "Адрес" Тогда
		Если ПустаяСтрока(ПолеФРМО) Тогда
			Возврат;
		Иначе
			ПоляАдресаФРМО = ОбщегоНазначения.JSONВЗначение(ПолеФРМО);
			ПоляАдресаБГУ = ОбщегоНазначения.JSONВЗначение(ПолеБГУ);
			Если ПоляАдресаФРМО["КодОбъекта"] = ПоляАдресаБГУ["КодОбъекта"] Тогда
				Возврат;
			КонецЕсли;
			ПредставлениеФРМО = ПоляАдресаФРМО["Представление"];
			ПредставлениеБГУ  = ПоляАдресаБГУ["Представление"];
		КонецЕсли;
	Иначе
		Если ПолеФРМО = ПолеБГУ Тогда
			Возврат;
		КонецЕсли;
		Если СтрНачинаетсяС(ИмяРеквизита, "Дата") Тогда
			ПредставлениеФРМО = Формат(ПолеФРМО, "ДЛФ=D; ДП=-");
			ПредставлениеБГУ  = Формат(ПолеБГУ, "ДЛФ=D; ДП=-");
		Иначе
			ПредставлениеФРМО = Строка(ПолеФРМО);
			ПредставлениеБГУ  = Строка(ПолеБГУ);
		КонецЕсли;	
	КонецЕсли;
	
	ЗаключениеПоля							= Заключение.Добавить();
	ЗаключениеПоля.ИмяРеквизита				= ИмяРеквизита;
	ЗаключениеПоля.ПредставлениеРеквизита	= Представление;
	ЗаключениеПоля.ЗначениеФРМО				= ПолеФРМО;
	ЗаключениеПоля.ЗначениеБГУ				= ПолеБГУ;
	ЗаключениеПоля.ПредставлениеФРМО		= ПредставлениеФРМО;
	ЗаключениеПоля.ПредставлениеБГУ			= ПредставлениеБГУ;
	
КонецПроцедуры

&НаСервере
Процедура ЗаключениеПоляПустойНомер(Заключение, ИсточникФРМО, ИмяРеквизита, Представление)
	
	ПолеФРМО = ИсточникФРМО[ИмяРеквизита];
	
	Если ИнтеграцияФРМОКлиентСервер.ЭтоПустойНомер(ПолеФРМО) Тогда
		Возврат;
	КонецЕсли;
	
	ПолеБГУ = ИнтеграцияФРМОКлиентСервер.ПустойНомерПоУмолчанию();
	
	ЗаключениеПоля							= Заключение.Добавить();
	ЗаключениеПоля.ИмяРеквизита				= ИмяРеквизита;
	ЗаключениеПоля.ПредставлениеРеквизита	= Представление;
	ЗаключениеПоля.ЗначениеФРМО				= ПолеФРМО;
	ЗаключениеПоля.ЗначениеБГУ				= ПолеБГУ;
	ЗаключениеПоля.ПредставлениеФРМО		= ПолеФРМО;
	ЗаключениеПоля.ПредставлениеБГУ			= ПолеБГУ;
	
КонецПроцедуры

#КонецОбласти
