#Область ПрограммныйИнтерфейс

#Область МодульОбъекта

// Переопределяемая процедура обработки заполнения.
// Вызывается из модуля объекта "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  ДанныеЗаполнения - Данные заполнения, переданные при программном и интерфейсном вызоде процедуры
//  СтандартнаяОбработка - Булево, см. описание процедуры ОбработкаЗаполнения модуля документа
//
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		Объект.Организация = ДанныеЗаполнения.Организация;
		Объект.КассаККМ    = ДанныеЗаполнения.КассаККМ;
		Объект.ОснованиеДляКоррекции = ДанныеЗаполнения;
		Объект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
	ИначеЕсли  ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		Объект.Организация = ДанныеЗаполнения.Организация;
		Объект.КассаККМ    = ДанныеЗаполнения.КассаККМ;
		Объект.ОснованиеДляКоррекции = ДанныеЗаполнения;
		Объект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЭквайринговаяОперация") Тогда 
		Объект.Организация = ДанныеЗаполнения.Организация;
		Объект.КассаККМ    = ДанныеЗаполнения.ФискальныйРегистратор;
		Объект.ОснованиеДляКоррекции = ДанныеЗаполнения;
		Если ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацииЭквайринга.ОплатаПлатежнойКартой Тогда
			Объект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
		ИначеЕсли ДанныеЗаполнения.ВидОперации = Перечисления.ВидыОперацииЭквайринга.ВозвратОплатыПлатежнойКартой Тогда
			Объект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств;
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЧекККМ") Тогда
		Объект.Организация = ДанныеЗаполнения.Организация;
		Объект.КассаККМ    = ДанныеЗаполнения.КассаККМ;
		Объект.ОснованиеДляКоррекции = ДанныеЗаполнения;
		Объект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЧекККМНаВозврат") Тогда 
		Объект.Организация = ДанныеЗаполнения.Организация;
		Объект.КассаККМ    = ДанныеЗаполнения.КассаККМ;
		Объект.ОснованиеДляКоррекции = ДанныеЗаполнения;
		Объект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КассовоеПоступление") Тогда
		Объект.Организация = ДанныеЗаполнения.Организация;
		Объект.КассаККМ    = ДанныеЗаполнения.КассаККМ;
		Объект.ОснованиеДляКоррекции = ДанныеЗаполнения;
		Объект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
	ИначеЕсли  ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КассовоеВыбытие")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаКассовыйРасход") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаКассовыйРасходСокращенная") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаВозврат") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
		Объект.Организация = ДанныеЗаполнения.Организация;
		Объект.КассаККМ    = ДанныеЗаполнения.КассаККМ;
		Объект.ОснованиеДляКоррекции = ДанныеЗаполнения;
		Объект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
		НастройкиОборудования = ПодключаемоеОборудованиеБГУВызовСервера.ПолучитьНастройкиОборудования(РабочееМесто, Объект.Организация);
		Объект.КассаККМ = НастройкиОборудования.ФискальныйРегистратор;
	КонецЕсли;
	
	Объект.НомерЧекаККМ   = 0;
	Объект.ПробитЧек      = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ОснованиеДляКоррекции) Тогда
		ОснованиеДляКоррекцииПриИзменении(Объект);
	КонецЕсли;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая перед записью.
// Вызывается из модуля объекта "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  Отказ, РежимЗаписи, РежимПроведения - см. описание процедуры "ПередЗаписью" модуля документа
//
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Объект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(Объект, РежимЗаписи, РежимПроведения);
	
	Объект.ДополнительныеСвойства.Вставить("ЭтоНовый",    Объект.ЭтоНовый());
	Объект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

// Переопределяемая процедура обработки проведения.
// Вызывается из модуля объекта "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  Отказ, РежимПроведения - см. описание процедуры "ОбработкаПроведения" модуля документа
//
Процедура ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая при копировании.
// Вызывается из модуля объекта "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  ОбъектКопирования - ДокументОбъект.КассовыйЧекКоррекции, копируемый документ
//
Процедура ПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	Объект.НомерЧекаККМ   = 0;
	Объект.ПробитЧек      = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ФормаДокумента

#Область ФормаДокументаОбработчикиСобытийФормы

// Переопределяемая процедура, вызываемая при создании.
// Вызывается из модуля формы документа "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  Форма  - Форма документа КассовыйЧекКоррекции
//  Отказ, СтандартнаяОбработка - см. описание процедуры "ПриСозданииНаСервере" модуля формы документа
//
Процедура ПриСозданииНаСервере(Объект, Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Форма.ИспользоватьПодключаемоеОборудование = Истина;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(Форма);
	// Конец ВерсионированиеОбъектов
	
	Если Форма.Параметры.Ключ.Пустая() Тогда
		Объект.ТипКоррекции = 0;
	КонецЕсли;
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая при чтении.
// Вызывается из модуля формы документа "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  Форма  - Форма документа КассовыйЧекКоррекции
//  ТекущийОбъект - см. описание процедуры "ПриЧтенииНаСервере" модуля формы документа
//
Процедура ПриЧтенииНаСервере(Объект, Форма, ТекущийОбъект) Экспорт
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(Форма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая перед записью на сервере.
// Вызывается из модуля формы документа "КассовыйЧекКоррекции"
// 
// Параметры:
//  Форма  - Форма документа КассовыйЧекКоррекции
//  Отказ, ТекущийОбъект, ПараметрыЗаписи - см. описание процедуры "ПередЗаписьюНаСервере" модуля формы документа
//
Процедура ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Если ТекущийОбъект.Ответственный.Пустая() Тогда
		ТекущийОбъект.Ответственный = Пользователи.ТекущийПользователь()
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФормаДокументаОбработчикиСобытийЭлементовШапки

// Переопределяемая процедура, вызываемая при изменении кассы ККМ.
// Вызывается из модуля формы документа "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//
Процедура КассаККМПриИзменении(Объект) Экспорт
	
	Если ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		Объект.ПодключаемоеОборудование = Объект.КассаККМ.ПодключаемоеОборудование;
		Если ЗначениеЗаполнено(Объект.КассаККМ.Организация) Тогда
			Объект.Организация = Объект.КассаККМ.Организация;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая при изменении основания для коррекции.
// Вызывается из модуля формы документа "КассовыйЧекКоррекции"
// 
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//
Процедура ОснованиеДляКоррекцииПриИзменении(Объект) Экспорт
	
	ТипДокумента = 0;
	КассаККМ = Справочники.ФискальныеРегистраторы.ПустаяСсылка();
	
	Если ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		ТипДокумента = 1;
		КассаККМ = Объект.ОснованиеДляКоррекции.КассаККМ;
		СистемаНалогообложенияБГУ = Объект.ОснованиеДляКоррекции.СистемаНалогообложенияЧекаККМ;
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.ДатаЧекаККМ;
	ИначеЕсли ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		ТипДокумента = 2;
		КассаККМ = Объект.ОснованиеДляКоррекции.КассаККМ;
		СистемаНалогообложенияБГУ = Объект.ОснованиеДляКоррекции.СистемаНалогообложенияЧекаККМ;
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.ДатаЧекаККМ;
	иначеЕсли ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("ДокументСсылка.ЭквайринговаяОперация") Тогда
		ТипДокумента = 3;
		КассаККМ = Объект.ОснованиеДляКоррекции.ФискальныйРегистратор;
		СистемаНалогообложенияБГУ = Объект.ОснованиеДляКоррекции.СистемаНалогообложенияЧекаККМ;
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.ДатаЧекаККМ;
	ИначеЕсли ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("ДокументСсылка.ЧекККМ") Тогда
		ТипДокумента = 5;
		КассаККМ = Объект.ОснованиеДляКоррекции.КассаККМ;
		СистемаНалогообложенияБГУ = Объект.ОснованиеДляКоррекции.СистемаНалогообложенияЧекаККМ;
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.Дата;
	ИначеЕсли ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("ДокументСсылка.ЧекККМНаВозврат") Тогда
		ТипДокумента = 6;
		КассаККМ = Объект.ОснованиеДляКоррекции.КассаККМ;
		СистемаНалогообложенияБГУ = Объект.ОснованиеДляКоррекции.СистемаНалогообложенияЧекаККМ;
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.Дата;
	ИначеЕсли ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("ДокументСсылка.КассовоеПоступление") Тогда
		ТипДокумента = 7;
		КассаККМ = Объект.ОснованиеДляКоррекции.КассаККМ;
		СистемаНалогообложенияБГУ = Объект.ОснованиеДляКоррекции.СистемаНалогообложенияЧекаККМ;
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.ДатаЧекаККМ;
	ИначеЕсли ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("ДокументСсылка.КассовоеВыбытие") Тогда
		ТипДокумента = 8;
		КассаККМ = Объект.ОснованиеДляКоррекции.КассаККМ;
		СистемаНалогообложенияБГУ = Объект.ОснованиеДляКоррекции.СистемаНалогообложенияЧекаККМ;
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.ДатаЧекаККМ;
	ИначеЕсли ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("ДокументСсылка.ЗаявкаНаВозврат") Тогда
		ТипДокумента = 9;
		КассаККМ = Объект.ОснованиеДляКоррекции.КассаККМ;
		СистемаНалогообложенияБГУ = Объект.ОснованиеДляКоррекции.СистемаНалогообложенияЧекаККМ;
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.ДатаЧекаККМ;
	ИначеЕсли ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("ДокументСсылка.ЗаявкаНаКассовыйРасход") Тогда
		ТипДокумента = 10;
		КассаККМ = Объект.ОснованиеДляКоррекции.КассаККМ;
		СистемаНалогообложенияБГУ = Объект.ОснованиеДляКоррекции.СистемаНалогообложенияЧекаККМ;
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.ДатаЧекаККМ;
	ИначеЕсли ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("ДокументСсылка.ЗаявкаНаКассовыйРасходСокращенная") Тогда
		ТипДокумента = 11;
		КассаККМ = Объект.ОснованиеДляКоррекции.КассаККМ;
		СистемаНалогообложенияБГУ = Объект.ОснованиеДляКоррекции.СистемаНалогообложенияЧекаККМ;
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.ДатаЧекаККМ;
	ИначеЕсли ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
		ТипДокумента = 12;
		КассаККМ = Объект.ОснованиеДляКоррекции.КассаККМ;
		СистемаНалогообложенияБГУ = Объект.ОснованиеДляКоррекции.СистемаНалогообложенияЧекаККМ;
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.ДатаЧекаККМ;
	Иначе
		Объект.НомерДокументаОснования = "";
		СистемаНалогообложенияБГУ = Перечисления.ВидыСистемыНалогообложенияЧекаККМ.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипДокумента > 0 Тогда
		Объект.НомерДокументаОснования = Формат(Объект.ОснованиеДляКоррекции.НомерЧекаККМ, "ЧГ=0");
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.ОснованиеДляКоррекции) 
		И НЕ ТипЗнч(Объект.ОснованиеДляКоррекции) = Тип("Строка") Тогда
		
		Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.Дата;
		Объект.Организация = Объект.ОснованиеДляКоррекции.Организация;
		Объект.КассаККМ    = КассаККМ;
		Если ЗначениеЗаполнено(СистемаНалогообложенияБГУ) Тогда
			Если СистемаНалогообложенияБГУ = Перечисления.ВидыСистемыНалогообложенияЧекаККМ.ЕНВД Тогда
				Объект.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ЕНВД;
			ИначеЕсли СистемаНалогообложенияБГУ = Перечисления.ВидыСистемыНалогообложенияЧекаККМ.УСНДоходы Тогда
				Объект.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход;
			ИначеЕсли СистемаНалогообложенияБГУ = Перечисления.ВидыСистемыНалогообложенияЧекаККМ.УСНДоходыМинусРасходы Тогда
				Объект.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход;
			Иначе
				Объект.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН;
			КонецЕсли;	
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.НомерДокументаОснования) Тогда
			Объект.НомерДокументаОснования = Объект.ОснованиеДляКоррекции.Номер;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ДатаДокументаОснования) Тогда
			Объект.ДатаДокументаОснования = Объект.ОснованиеДляКоррекции.Дата;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НомерДокументаОснования) И ЗначениеЗаполнено(Объект.ДатаДокументаОснования) Тогда
		Объект.ПредставлениеОснования = НСтр("ru='Чек №'")+СокрЛП(Объект.НомерДокументаОснования)+НСтр("ru=' от '")+Формат(Объект.ДатаДокументаОснования, "ДФ=dd.MM.yyyy");
	КонецЕсли;	
	
	КассаККМПриИзменении(Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ФормаДокументаСлужебныеПроцедурыИФункции

//Переопределяемая процедура устанавливает правила работы формы документа. 
//
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  Форма  - Форма документа КассовыйЧекКоррекции
//
Процедура УстановитьДоступностьЭлементовИФормы(Объект, Форма) Экспорт
	
КонецПроцедуры

//Переопределяемая процедура проверяет возможность печати чека, при этом подготавливает информацию для печтати. 
//
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//  Отказ - Булево.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудовае, устройство фискализирующее чек
//  ИспользоватьКассуБезПодключенияОборудования - Булево.
//
Процедура ПодготовитьИПроверитьПечатьЧека(Объект,
										  Отказ, 
										  ИдентификаторУстройства, 
										  ИспользоватьКассуБезПодключенияОборудования)	Экспорт
	
	ИдентификаторУстройства = Объект.ПодключаемоеОборудование;
	ИспользоватьКассуБезПодключенияОборудования = НЕ ИдентификаторУстройства.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ;
	
КонецПроцедуры

// Переопределяемая процедура получает данные для отправки по кассиру (ответственному)
//
// Параметры:
//  Объект - ДокументОбъект.КассовыйЧекКоррекции, заполняемый документ
//
Функция ПолучитьРеквизитыКассира(Объект) Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Наименование");
	СтруктураРеквизитов.Вставить("ИНН");
	
	РеквизитыКассир = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ответственный.ФизическоеЛицо, СтруктураРеквизитов);
	
	Возврат РеквизитыКассир;
	
КонецФункции

// Переопределяемая процедура получает доступные системы налогообложения для организации.
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияБПО, Организация по которой получаеются системы налогообложения.
//  МассивСистемНалогообложения - Масссив элементов Перечисление.ТипыСистемНалогообложенияККТ.
//
Процедура ПолучитьДоступныеСистемыНалогообложения(Организация, МассивСистемНалогообложения, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	МассивСистемНалогообложения = ПодключаемоеОборудованиеБГУ.ВидСистемыНалогообложенияБПООрганизации(Организация, ТекущаяДата());
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
