////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Отбор.Свойство("ОбъектФинансовогоВложения", ОбъектФинансовогоВложения);
	
	Элементы.ОбъектФинансовогоВложенияОтбор.Доступность = НЕ ЗначениеЗаполнено(ОбъектФинансовогоВложения);

	Элементы.ОбъектФинансовогоВложения.Видимость = НЕ ЗначениеЗаполнено(ОбъектФинансовогоВложения);
	
	Если ЗначениеЗаполнено(ОбъектФинансовогоВложения) Тогда
		
		Элементы.НоминальныйДержатель.Видимость = ОбъектФинансовогоВложения.ФормаУчастияВКапитале = ПредопределенноеЗначение("Перечисление.ФормыУчастияВКапитале.Акции");
		Элементы.ДатаВыпискиИзРеестраАкционеров.Видимость = ОбъектФинансовогоВложения.ФормаУчастияВКапитале = ПредопределенноеЗначение("Перечисление.ФормыУчастияВКапитале.Акции");

	КонецЕсли;	
	
КонецПроцедуры
