#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеТабличныхДокументов

// Преобразовать строку полей в список значений
Функция ПреобразоватьСтрокуВСписокПолей(СтрокаПолей)
	
	Результат = Новый СписокЗначений;
	ПоследнийЭлемент = Неопределено;
	
	Для Сч = 1 По СтрЧислоСтрок(СтрокаПолей) Цикл
		Стр = СтрПолучитьСтроку(СтрокаПолей, Сч);
		Если Лев(Стр, 1) = Символы.Таб Тогда
			Если ПоследнийЭлемент <> Неопределено Тогда
				ПоследнийЭлемент.Значение = ПоследнийЭлемент.Значение + Символы.ПС + Сред(Стр, 2);
			КонецЕсли;
		Иначе
			Поз = Найти(Стр, "=");
			Если Поз <> 0 Тогда
				ПоследнийЭлемент = Результат.Добавить(Сред(Стр, Поз+1), Лев(Стр, Поз-1));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РазложитьМассивПоТипамОбъектов(МассивОбъектов) Экспорт
	СтруктураТипов = Новый Структура;
	
	Для Каждого Объект Из МассивОбъектов Цикл
		
		Если ТипЗнч(Объект) 	= Тип("ДокументСсылка.РегистрацияОбязательствИСведенийПоДоговорам") Тогда
			Если НЕ СтруктураТипов.Свойство("РегистрацияОбязательствИСведенийПоДоговорам") Тогда
				МассивРОС = Новый Массив;
				СтруктураТипов.Вставить("РегистрацияОбязательствИСведенийПоДоговорам", МассивРОС);
			КонецЕсли;
			СтруктураТипов.РегистрацияОбязательствИСведенийПоДоговорам.Добавить(Объект);
			
		ИначеЕсли ТипЗнч(Объект) 	= Тип("ДокументСсылка.ИсполнениеРасторжениеДоговора") Тогда
			Если НЕ СтруктураТипов.Свойство("ИсполнениеРасторжениеДоговора") Тогда
				МассивИПК = Новый Массив;
				СтруктураТипов.Вставить("ИсполнениеРасторжениеДоговора", МассивИПК);
			КонецЕсли;
			СтруктураТипов.ИсполнениеРасторжениеДоговора.Добавить(Объект);
			
		КонецЕсли;
		
	КонецЦикла;
	Возврат СтруктураТипов;
КонецФункции

Функция ПолучитьСтруктуруХарактеристикОбязательства(ТаблицаХарактеристикОбязательства)
	
	СтруктураХарактеристик = Новый Структура("ГрифСекретности, ДатаОснованияЗаключенияКонтракта, ДатаАукциона, ДатаРегистрацииУполномоченнымОрганом, НаименованиеОснованияЗаключенияКонтракта, НомерОснованияЗаключенияКонтракта, НомерИзвещения, НомерРеестровойЗаписи, СпособРазмещенияЗаказа, СпособРазмещенияЗаказаКод, СтатусИсполненияГК, НаименованиеСудебногоОргана, Периодичность");
	
	СтруктураХарактеристик.Вставить("ЭтоСекретныйДокумент", Ложь); // Для быстрого определения секретности документа
	
	Для каждого СтрокаХарактеристики Из ТаблицаХарактеристикОбязательства Цикл
		Если СтрокаХарактеристики.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.ГрифСекретности Тогда
			СтруктураХарактеристик.ГрифСекретности = СтрокаХарактеристики.ЗначениеХарактеристики;
			СтруктураХарактеристик.ЭтоСекретныйДокумент = (СтруктураХарактеристик.ГрифСекретности <> Перечисления.ПризнакСекретности.НеСекретно 
				                                          И СтруктураХарактеристик.ГрифСекретности <> Перечисления.ПризнакСекретности.ДСП);				
			
		ИначеЕсли СтрокаХарактеристики.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.ДатаОснованияЗаключенияКонтракта Тогда 
			СтруктураХарактеристик.ДатаОснованияЗаключенияКонтракта = СтрокаХарактеристики.ЗначениеХарактеристики;
			
		ИначеЕсли СтрокаХарактеристики.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.ДатаАукциона Тогда 
			СтруктураХарактеристик.ДатаАукциона = СтрокаХарактеристики.ЗначениеХарактеристики;
			
		ИначеЕсли СтрокаХарактеристики.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.ДатаРегистрацииУполномоченнымОрганом Тогда 
			СтруктураХарактеристик.ДатаРегистрацииУполномоченнымОрганом = СтрокаХарактеристики.ЗначениеХарактеристики;
			
		ИначеЕсли СтрокаХарактеристики.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.НаименованиеОснованияЗаключенияКонтракта Тогда 
			СтруктураХарактеристик.НаименованиеОснованияЗаключенияКонтракта = СтрокаХарактеристики.ЗначениеХарактеристики;
			
		ИначеЕсли СтрокаХарактеристики.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.НомерОснованияЗаключенияКонтракта Тогда 
			СтруктураХарактеристик.НомерОснованияЗаключенияКонтракта = СтрокаХарактеристики.ЗначениеХарактеристики;
			
		ИначеЕсли СтрокаХарактеристики.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.НомерИзвещения Тогда 
			СтруктураХарактеристик.НомерИзвещения = СтрокаХарактеристики.ЗначениеХарактеристики;
			
		ИначеЕсли СтрокаХарактеристики.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.НомерРеестровойЗаписи Тогда 
			СтруктураХарактеристик.НомерРеестровойЗаписи = СтрокаХарактеристики.ЗначениеХарактеристики;
			
		ИначеЕсли СтрокаХарактеристики.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.СпособРазмещенияЗаказа Тогда 
			СтруктураХарактеристик.СпособРазмещенияЗаказа = СтрокаХарактеристики.ЗначениеХарактеристики.НаименованиеПолное;
			СтруктураХарактеристик.СпособРазмещенияЗаказаКод = СтрокаХарактеристики.ЗначениеХарактеристики.Код; 
			
		ИначеЕсли СтрокаХарактеристики.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.СтатусИсполненияГК Тогда 
			СтруктураХарактеристик.СтатусИсполненияГК = СтрокаХарактеристики.ЗначениеХарактеристики;
			
		ИначеЕсли СтрокаХарактеристики.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.СудебныйОрган Тогда 
			СтруктураХарактеристик.НаименованиеСудебногоОргана = СтрокаХарактеристики.ЗначениеХарактеристики;
			
		ИначеЕсли СтрокаХарактеристики.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.ПериодичностьИсполненияКонтракта Тогда
			Если СтрокаХарактеристики.ЗначениеХарактеристики = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
				СтруктураХарактеристик.Периодичность = "ежедневно";
			ИначеЕсли СтрокаХарактеристики.ЗначениеХарактеристики = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
				СтруктураХарактеристик.Периодичность = "еженедельно";
	        ИначеЕсли СтрокаХарактеристики.ЗначениеХарактеристики = ПредопределенноеЗначение("Перечисление.Периодичность.Декада") Тогда
				СтруктураХарактеристик.Периодичность = "ежедекадно";
			ИначеЕсли СтрокаХарактеристики.ЗначениеХарактеристики = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
				СтруктураХарактеристик.Периодичность = "ежемесячно";
			ИначеЕсли СтрокаХарактеристики.ЗначениеХарактеристики = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
				СтруктураХарактеристик.Периодичность = "ежеквартально";	
			ИначеЕсли СтрокаХарактеристики.ЗначениеХарактеристики = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
				СтруктураХарактеристик.Периодичность = "ежегодно";
			Иначе	
	            СтруктураХарактеристик.Периодичность = СтрокаХарактеристики.ЗначениеХарактеристики;
			КонецЕсли;	
		ИначеЕсли ЗначениеЗаполнено(СтрокаХарактеристики.ВидХарактеристикиКод) И НЕ СтруктураХарактеристик.Свойство(СтрокаХарактеристики.ВидХарактеристикиКод) Тогда
			СтруктураХарактеристик.Вставить(СтрокаХарактеристики.ВидХарактеристикиКод, СтрокаХарактеристики.ЗначениеХарактеристики);
			
		КонецЕсли; 	
	КонецЦикла; 
	
	Возврат СтруктураХарактеристик;
	
КонецФункции

Функция ПолучитьСтруктуруКонтактнойИнформации(ТаблицаКонтактнойИнформации) Экспорт
	
	СтруктураКИ = Новый Структура("Телефон, Адрес, Страна, КодСтраны, КонтрагентОКТМО");
	
	Для каждого СтрокаКИ Из ТаблицаКонтактнойИнформации Цикл
		Если СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица
			ИЛИ СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты Тогда
			
			Если ЗначениеЗаполнено(СтрокаКИ.Значение) И НЕ УправлениеКонтактнойИнформацией.АдресВведенВСвободнойФорме(СтрокаКИ.Значение) Тогда
				
				СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(СтрокаКИ.Значение);
				КодыАдреса = АдресныйКлассификатор.КодыАдреса(СтрокаКИ.Значение);
				
				СтруктураКИ.Адрес = 
				СведенияОбАдресе.Индекс + ", " + 
				СведенияОбАдресе.Регион + " " + СведенияОбАдресе.РегионСокращение + ", " + СведенияОбАдресе.КодРегиона + ", " +
				?(ЗначениеЗаполнено(СведенияОбАдресе.Город), СведенияОбАдресе.ГородТипПолный + " " + СведенияОбАдресе.Город + ", ", "") +
				?(ЗначениеЗаполнено(СведенияОбАдресе.НаселенныйПункт), СведенияОбАдресе.НаселенныйПунктТипПолный + " " + СведенияОбАдресе.НаселенныйПункт + ", ", "") +
				КодыАдреса.ОКТМО + ", " +
				СведенияОбАдресе.УлицаТипКраткий + " " + СведенияОбАдресе.Улица + ", " + 
				СведенияОбАдресе.Здание.ТипЗдания + " " + СведенияОбАдресе.Здание.Номер + ", " +
				?(ТипЗнч(СведенияОбАдресе.Корпуса) = Тип("Массив") И СведенияОбАдресе.Корпуса.Количество() > 0, СведенияОбАдресе.Корпуса[0].ТипКорпуса + " " + СведенияОбАдресе.Корпуса[0].Номер + ", ", "") +
				?(ТипЗнч(СведенияОбАдресе.Помещения) = Тип("Массив") И СведенияОбАдресе.Помещения.Количество() > 0, СведенияОбАдресе.Помещения[0].ТипПомещения + " " + СведенияОбАдресе.Помещения[0].Номер, "");		 
				
				СтруктураКИ.КодСтраны = СведенияОбАдресе.КодСтраны;
				СтруктураКИ.Страна = СведенияОбАдресе.Страна; 
				СтруктураКИ.КонтрагентОКТМО = КодыАдреса.ОКТМО;
				
			Иначе
				СтруктураКИ.Страна = "РОССИЯ";
				СтруктураКИ.КодСтраны = "643";
				СтруктураКИ.Адрес = СтрокаКИ.Представление;
				СписокПолей = ПреобразоватьСтрокуВСписокПолей(СтрокаКИ.ЗначенияПолей);
			КонецЕсли;
			
		ИначеЕсли СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица
			ИЛИ СтрокаКИ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагенты ТОГДА
			СтруктураКИ.Телефон = СтрокаКИ.Представление;
			
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат СтруктураКИ;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииПечати

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СтруктураТипов = РазложитьМассивПоТипамОбъектов(МассивОбъектов);
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияГК") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияГК", "Сведения о госконтракте", СформироватьПечатнуюФормуСведенияГК(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИнформацияГК") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИнформацияГК", "Информация о контракте (приказ 142н)", СформироватьПечатнуюФормуИнформацияГК(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияОПрекращении") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияОПрекращении", "Сведения о прекращении госконтракта", СформироватьПечатнуюФормуСведенияОПрекращении(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияОПрекращении18н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияОПрекращении18н", "Сведения об исполнении (о расторжении) контракта", СформироватьПечатнуюФормуСведенияОПрекращении18н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, "18н"));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияОПрекращении31н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияОПрекращении31н", "Сведения об исполнении (о расторжении) контракта", СформироватьПечатнуюФормуСведенияОПрекращении18н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, "31н"));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияОПрекращении17н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияОПрекращении17н", "Сведения об исполнении (о расторжении) контракта", СформироватьПечатнуюФормуСведенияОПрекращении18н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, "17н"));

	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИнформацияОбИсполнении") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИнформацияОбИсполнении", "Информация об исполнении (о расторжении) контракта", СформироватьПечатнуюФормуИнформацияОПрекращении(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0531702") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Форма0531702", "Форма 0531702 (Сведения о принятом бюджетном обязательстве)", СформироватьПечатнуюФорму0531702(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0531705") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Форма0531705", "Форма 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство)", СформироватьПечатнуюФорму0531705(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0531706") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Форма0531706", "Форма 0531706 (Заявка на перерегистрацию бюджетного обязательства)", СформироватьПечатнуюФорму0531706(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
		
	// Формы в редакции приказа 151н	
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0531702_151н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Форма0531702_151н", "Форма 0531702 (Сведения о принятом бюджетном обязательстве)", СформироватьПечатнуюФорму0531702_151н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0531705_151н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Форма0531705_151н", "Форма 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство)", СформироватьПечатнуюФорму0531705_151н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0531706_151н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Форма0531706_151н", "Форма 0531706 (Заявка на перерегистрацию бюджетного обязательства)", СформироватьПечатнуюФорму0531706_151н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
		
	// Формы в редакции приказа 140н	
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0531702_140н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Форма0531702_140н", "Форма 0531702 (Сведения о принятом бюджетном обязательстве)", СформироватьПечатнуюФорму0531702_151н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, "ПФ_MXL_Форма0531702_140н"));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0531705_140н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Форма0531705_140н", "Форма 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство)", СформироватьПечатнуюФорму0531705_151н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, "ПФ_MXL_Форма0531705_140н"));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0531706_140н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Форма0531706_140н", "Форма 0531706 (Заявка на перерегистрацию бюджетного обязательства)", СформироватьПечатнуюФорму0531706_151н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, "ПФ_MXL_Форма0531706_140н"));

	// Формы в редакции приказа 18н	
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияГК_18н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияГК_18н", "Сведения о контракте (приказ 18н)", СформироватьПечатнуюФормуСведенияГК_18н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, "18н"));
		
	// Формы в редакции приказа 31н	
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияГК_31н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияГК_31н", "Сведения о контракте (приказ 31н)", СформироватьПечатнуюФормуСведенияГК_18н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, "31н"));	
		
	// Формы в редакции приказа 17н	
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияГК_17н2026") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияГК_17н2026", "Сведения о контракте (с 01.03.2026)", СформироватьПечатнуюФормуСведенияГК_17н2026(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));	
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияГК_17н2025") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияГК_17н2025", "Сведения о контракте (с 01.01.2025)", СформироватьПечатнуюФормуСведенияГК_17н2025(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));	
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияГК_17н") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияГК_17н", "Сведения о контракте (приказ 31н)", СформироватьПечатнуюФормуСведенияГК_18н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, "17н"));	
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияОПрекращении17н2025") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияОПрекращении17н2025", "Сведения об исполнении (о расторжении) контракта", СформироватьПечатнуюФормуСведенияОПрекращении17н2025(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));  
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияОПрекращении17н2026") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияОПрекращении17н2026", "Сведения об исполнении (о расторжении) контракта", СформироватьПечатнуюФормуСведенияОПрекращении17н2026(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));  
		
	// Формы в редакции приказа 221н	
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0506101") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Форма0506101", "Сведения о бюджетном обязательстве (ф. 0506101)", СформироватьПечатнуюФорму0506101(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СведенияБО") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияБО", "Сведения о бюджетном обязательстве", СформироватьПечатнуюФормуСведенияБО(СтруктураТипов, ОбъектыПечати, ПараметрыПечати));
	
	КонецЕсли;
		
КонецПроцедуры // Печать()

// Функция формирует печатную форму сведений о государственном контракте
//
Функция СформироватьПечатнуюФормуСведенияГК(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СведенияГК";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормыСведенияГК(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументСведенияГК(ТабличныйДокумент, ДанныеДляПечати,	ОбъектыПечати);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 

// Функция формирует печатную форму сведений о государственном контракте по пр. от 25.11.2024 № 17н 
// Форма действует с 01.01.2025
//
Функция СформироватьПечатнуюФормуСведенияГК_17н2025(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СведенияГК_17н2025";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормыСведенияГК_17н2025(ПараметрыПечати, СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументСведенияГК_17н2025(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции  

// Функция формирует печатную форму сведений о государственном контракте по пр. от 25.11.2024 № 17н
// в ред. приказа Казначейства России от 12.01.2026 N 1н 
// Форма действует с 01.03.2026
//
Функция СформироватьПечатнуюФормуСведенияГК_17н2026(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СведенияГК_17н2026";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормыСведенияГК_17н2026(ПараметрыПечати, СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументСведенияГК_17н2026(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 


// Функция формирует печатную форму сведений о государственном контракте по пр. от 28.11.2014 № 18н
//
Функция СформироватьПечатнуюФормуСведенияГК_18н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, НомерПриказа = "31н")
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СведенияГК_" + НомерПриказа;
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормыСведенияГК_18н(ПараметрыПечати, СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументСведенияГК_18н(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, НомерПриказа);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 

// Функция формирует печатную форму сведений о государственном контракте
//
Функция СформироватьПечатнуюФормуИнформацияГК(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнформацияГК";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормыСведенияГК(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументИнформацияГК(ТабличныйДокумент, ДанныеДляПечати,	ОбъектыПечати);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 

// Функция формирует печатную форму сведений об исполнении/прекращении госконтракта
//
Функция СформироватьПечатнуюФормуСведенияОПрекращении(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СведенияОПрекращении";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормыСведенияОПрекращении(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументСведенияОПрекращении(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 

// Функция формирует печатную форму сведений об исполнении/прекращении госконтракта
// (приказ казначейства России от 25.11.2024 № 17н).
// Форма применяется с 01.01.2025. 
//
Функция СформироватьПечатнуюФормуСведенияОПрекращении17н2025(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СведенияОПрекращении17н2025";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормыСведенияОПрекращении17н2025(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументСведенияОПрекращении17н2025(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции   

// Функция формирует печатную форму сведений об исполнении/прекращении госконтракта
// (приказ казначейства России от 25.11.2024 № 17н, в ред. приказа Казначейства России от 12.01.2026 N 1н).
// Форма применяется с 01.03.2026. 
//
Функция СформироватьПечатнуюФормуСведенияОПрекращении17н2026(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СведенияОПрекращении17н2026";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормыСведенияОПрекращении17н2026(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументСведенияОПрекращении17н2026(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 


// Функция формирует печатную форму сведений об исполнении/прекращении госконтракта
// (приказ казначейства России от 24.11.2014 № 18н)
//
Функция СформироватьПечатнуюФормуСведенияОПрекращении18н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, НомерПриказа = "31н")
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СведенияОПрекращении" + НомерПриказа;
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормыСведенияОПрекращении18н(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументСведенияОПрекращении18н(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, НомерПриказа);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 

// Функция формирует печатную форму информации об исполнении/расторжении госконтракта
//
Функция СформироватьПечатнуюФормуИнформацияОПрекращении(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнформацияОПрекращении";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормыСведенияОПрекращении(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументИнформацияОПрекращении(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 

// Функция формирует печатную форму 0531702 (Сведения о принятом бюджетном обязательстве)
//
Функция СформироватьПечатнуюФорму0531702(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма0531702";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормы0531702(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументФорма0531702(ТабличныйДокумент, ДанныеДляПечати,	ОбъектыПечати);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 

// Функция формирует печатную форму 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство)
//
Функция СформироватьПечатнуюФорму0531705(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма0531705";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормы0531705(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументФорма0531705(ТабличныйДокумент, ДанныеДляПечати,	ОбъектыПечати);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

// Функция формирует печатную форму 0531706 (Заявка на перерегистрацию бюджетного обязательства)
//
Функция СформироватьПечатнуюФорму0531706(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма0531706";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормы0531706(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументФорма0531706(ТабличныйДокумент, ДанныеДляПечати,	ОбъектыПечати);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

///////////////////////////////////////////////////////////////////////////////
// Формы в редакции приказа 151н

// Функция формирует печатную форму 0531702 (Сведения о принятом бюджетном обязательстве)
//
Функция СформироватьПечатнуюФорму0531702_151н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, ИмяМакета = "ПФ_MXL_Форма0531702_151н")
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма0531702_151н";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормы0531702_151н(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументФорма0531702_151н(ТабличныйДокумент, ДанныеДляПечати,	ОбъектыПечати, ИмяМакета);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 

// Функция формирует печатную форму 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство)
//
Функция СформироватьПечатнуюФорму0531705_151н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, ИмяМакета = "ПФ_MXL_Форма0531705_151н")
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма0531705_151н";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормы0531705_151н(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументФорма0531705_151н(ТабличныйДокумент, ДанныеДляПечати,	ОбъектыПечати, ИмяМакета);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

// Функция формирует печатную форму 0531706 (Заявка на перерегистрацию бюджетного обязательства)
//
Функция СформироватьПечатнуюФорму0531706_151н(СтруктураТипов, ОбъектыПечати, ПараметрыПечати, ИмяМакета = "ПФ_MXL_Форма0531706_151н")
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма0531706_151н";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормы0531706_151н(ПараметрыПечати, СтруктураОбъектов.Значение);
		ЗаполнитьТабличныйДокументФорма0531706_151н(ТабличныйДокумент, ДанныеДляПечати,	ОбъектыПечати, ИмяМакета);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции

///////////////////////////////////////////////////////////////////////////////
// Формы в редакции приказа 221н

// Функция формирует печатную форму 0506101 (Сведения о бюджетном обязательстве)
//
Функция СформироватьПечатнуюФорму0506101(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Форма0506101";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормы0506101(ПараметрыПечати, СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументФорма0506101(ТабличныйДокумент, ДанныеДляПечати,	ОбъектыПечати);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 

// Функция формирует печатную форму Сведения о бюджетном обязательстве
//
Функция СформироватьПечатнуюФормуСведенияБО(СтруктураТипов, ОбъектыПечати, ПараметрыПечати)
	
	ТабличныйДокумент 						= Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб 			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СведенияБО";
	
	НомерТипаДокумента = 0;
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ДанныеДляПечати = РаботаСОбязательствами.ПолучитьДанныеДляПечатнойФормы0506101(ПараметрыПечати, СтруктураОбъектов.Значение);
		
		ЗаполнитьТабличныйДокументФорма0506101(ТабличныйДокумент, ДанныеДляПечати,	ОбъектыПечати, "ПФ_MXL_СведенияБО");
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции 


///////////////////////////////////////////////////////////////////////////////
// Форма 0531702 (Сведения о принятом бюджетном обязательстве)
// Форма 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство)
// Форма 0531706 (Заявка на перерегистрацию бюджетного обязательства)

// Процедура заполняет табличный документ "Форма 0531702 (Сведения о принятом бюджетном обязательстве)"
//
Процедура ЗаполнитьТабличныйДокументФорма0531702(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам.ПФ_MXL_Форма0531702");
	
	ДанныеШапки = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеХарактеристикОбязательства = ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеКонтактнойИнформации = ДанныеДляПечати.КонтактнаяИнформация.Выгрузить();
	ДанныеРасшифровкиОбязательства = ДанныеДляПечати.РасшифровкаОбязательства.Выгрузить();
		
	ПервыйДокумент = Истина;
	Пока ДанныеШапки.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		СтруктураХарактеристик = ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаРасшифровкиОбязательства = ДанныеРасшифровкиОбязательства.НайтиСтроки(СтруктураПоиска);
		
		СтруктураПоиска = Новый Структура("Контрагент", ДанныеШапки.Контрагент);
		СтруктураКонтактнойИнформацииКонтрагента = ПолучитьСтруктуруКонтактнойИнформации(ДанныеКонтактнойИнформации.НайтиСтроки(СтруктураПоиска));
		СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);
		
		СформироватьЗаголовокИРаздел1_2Форм0531702_0531705_0531706(ДанныеШапки, СтруктураДаты, СтруктураКонтактнойИнформацииКонтрагента, Макет, ТабличныйДокумент);
		СформироватьРаздел3Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРаздел4Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРаздел5Форм0531702_0531705_0531706(ТаблицаРасшифровкиОбязательства, ДанныеШапки, СтруктураДаты, Макет, ТабличныйДокумент);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры 

// Процедура заполняет табличный документ "Форма 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство)"
//
Процедура ЗаполнитьТабличныйДокументФорма0531705(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам.ПФ_MXL_Форма0531705");
	
	ДанныеШапки = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеХарактеристикОбязательства = ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеКонтактнойИнформации = ДанныеДляПечати.КонтактнаяИнформация.Выгрузить();
	ДанныеРасшифровкиОбязательства = ДанныеДляПечати.РасшифровкаОбязательства.Выгрузить();
		
	ПервыйДокумент = Истина;
	Пока ДанныеШапки.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		СтруктураХарактеристик = ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаРасшифровкиОбязательства = ДанныеРасшифровкиОбязательства.НайтиСтроки(СтруктураПоиска);
		
		СтруктураПоиска = Новый Структура("Контрагент", ДанныеШапки.Контрагент);
		СтруктураКонтактнойИнформацииКонтрагента = ПолучитьСтруктуруКонтактнойИнформации(ДанныеКонтактнойИнформации.НайтиСтроки(СтруктураПоиска));
		СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);
		
		СформироватьЗаголовокИРаздел1_2Форм0531702_0531705_0531706(ДанныеШапки, СтруктураДаты, СтруктураКонтактнойИнформацииКонтрагента, Макет, ТабличныйДокумент);
		СформироватьРаздел3Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРаздел4Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРаздел5Форм0531702_0531705_0531706(ТаблицаРасшифровкиОбязательства, ДанныеШапки, СтруктураДаты, Макет, ТабличныйДокумент);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры 

// Процедура заполняет табличный документ "Форма 0531706 (Заявка на перерегистрацию бюджетного обязательства)"
//
Процедура ЗаполнитьТабличныйДокументФорма0531706(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам.ПФ_MXL_Форма0531706");
	
	ДанныеШапки = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеХарактеристикОбязательства = ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеКонтактнойИнформации = ДанныеДляПечати.КонтактнаяИнформация.Выгрузить();
	ДанныеРасшифровкиОбязательства = ДанныеДляПечати.РасшифровкаОбязательства.Выгрузить();
		
	ПервыйДокумент = Истина;
	Пока ДанныеШапки.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		СтруктураХарактеристик = ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаРасшифровкиОбязательства = ДанныеРасшифровкиОбязательства.НайтиСтроки(СтруктураПоиска);
		
		СтруктураПоиска = Новый Структура("Контрагент", ДанныеШапки.Контрагент);
		СтруктураКонтактнойИнформацииКонтрагента = ПолучитьСтруктуруКонтактнойИнформации(ДанныеКонтактнойИнформации.НайтиСтроки(СтруктураПоиска));
		СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);
		
		СформироватьЗаголовокИРаздел1_2Форм0531702_0531705_0531706(ДанныеШапки, СтруктураДаты, СтруктураКонтактнойИнформацииКонтрагента, Макет, ТабличныйДокумент);
		СформироватьРаздел3Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРаздел4Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРаздел5Форм0531702_0531705_0531706(ТаблицаРасшифровкиОбязательства, ДанныеШапки, СтруктураДаты, Макет, ТабличныйДокумент);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры 

Процедура СформироватьЗаголовокИРаздел1_2Форм0531702_0531705_0531706(ДанныеШапки, СтруктураДаты, СтруктураКонтактнойИнформацииКонтрагента, Макет, ТабличныйДокумент)
	
	РеквизитыКонтрагентаПоСчету = Новый Структура("КонтрагентБанковскийСчет, КонтрагентНаименованиеБанка, КонтрагентБИКБанка, КонтрагентКорСчетБанка", "СчетНомер", "Банк", "БИК", "КоррСчет");
	ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(ДанныеШапки.СчетКонтрагента, ДанныеШапки.СчетКонтрагента, РеквизитыКонтрагентаПоСчету, , Ложь);	
	
	облЗаголовок = Макет.ПолучитьОбласть("ОсновныеРеквизиты");
	СтруктураОблЗаголовок = Новый Структура("КонтрагентНаименование,НомерДокумента");
	облЗаголовок.Параметры.Заполнить(СтруктураДаты);
	облЗаголовок.Параметры.Заполнить(ДанныеШапки);
	СтруктураОблЗаголовок.КонтрагентНаименование = ДанныеШапки.КонтрагентНаименование;
	облЗаголовок.Параметры.Заполнить(СтруктураКонтактнойИнформацииКонтрагента);
	облЗаголовок.Параметры.Заполнить(РеквизитыКонтрагентаПоСчету);
	СтруктураОблЗаголовок.НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДанныеШапки.Ссылка,ДанныеШапки.НомерДокумента);
	облЗаголовок.Параметры.Заполнить(СтруктураОблЗаголовок);
	ТабличныйДокумент.Вывести(облЗаголовок);
	
КонецПроцедуры

Процедура СформироватьЗаголовокИРаздел1_2Форм0531702_0531705_0531706_151н(ДанныеШапки, СтруктураДаты, ТаблицаКонтрагентов, ДанныеКонтактнойИнформации, Макет, ТабличныйДокумент)
	
	облЗаголовок = Макет.ПолучитьОбласть("ОсновныеРеквизиты");
	
	облЗаголовок.Параметры.Заполнить(СтруктураДаты);
	
	СтруктураОблЗаголовок = Новый Структура("НомерДокумента");
	СтруктураОблЗаголовок.НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДанныеШапки.Ссылка,ДанныеШапки.НомерДокумента);
	
	облЗаголовок.Параметры.Заполнить(ДанныеШапки);
    облЗаголовок.Параметры.Заполнить(СтруктураОблЗаголовок);

	ТабличныйДокумент.Вывести(облЗаголовок);

	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Шапка_Р2"));
	
	Для Каждого СтрКонтр Из ТаблицаКонтрагентов Цикл
		
		СтрокаРаздела2 = Макет.ПолучитьОбласть("Стр_Р2");
		
		РеквизитыКонтрагентаПоСчету = Новый Структура("КонтрагентБанковскийСчет, КонтрагентНаименованиеБанка, КонтрагентБИКБанка, КонтрагентКорСчетБанка", "СчетНомер", "Банк", "БИК", "КоррСчет");
		ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(СтрКонтр.СчетКонтрагента, СтрКонтр.СчетКонтрагента, РеквизитыКонтрагентаПоСчету, , Ложь);	
		
		СтруктураПоиска = Новый Структура("Контрагент", СтрКонтр.Контрагент);
		СтруктураКонтактнойИнформацииКонтрагента = ПолучитьСтруктуруКонтактнойИнформации(ДанныеКонтактнойИнформации.НайтиСтроки(СтруктураПоиска));
		
		СтрокаРаздела2.Параметры.Заполнить(СтрКонтр);
		СтрокаРаздела2.Параметры.Заполнить(СтруктураКонтактнойИнформацииКонтрагента);
		СтрокаРаздела2.Параметры.Заполнить(РеквизитыКонтрагентаПоСчету);
		
		ТабличныйДокумент.Вывести(СтрокаРаздела2);
		
	КонецЦикла;
	
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Разделитель"));

			
КонецПроцедуры

Процедура СформироватьРаздел3Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент)
	
	Если СтруктураХарактеристик.Свойство("НаименованиеСудебногоОргана") И ЗначениеЗаполнено(СтруктураХарактеристик.НаименованиеСудебногоОргана) Тогда
		
		облРаздел3 = Макет.ПолучитьОбласть("Раздел_3");
		облРаздел3.Параметры.Заполнить(СтруктураХарактеристик);
		ТабличныйДокумент.Вывести(облРаздел3);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьРаздел4Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент)
	
	Если СтруктураХарактеристик.Свойство("НомерРеестровойЗаписи") И ЗначениеЗаполнено(СтруктураХарактеристик.НомерРеестровойЗаписи) Тогда
	
		облРаздел4 = Макет.ПолучитьОбласть("РеквизитыГК");
		облРаздел4.Параметры.Заполнить(СтруктураХарактеристик);
		ТабличныйДокумент.Вывести(облРаздел4);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура СформироватьРаздел5Форм0531702_0531705_0531706(ТаблицаРасшифровкиОбязательства, ДанныеШапки, СтруктураДаты, Макет, ТабличныйДокумент)	
	
	НомерСтраницы = 2;
	облРазделитель = Макет.ПолучитьОбласть("Разделитель");
	облРаздел5_1 = Макет.ПолучитьОбласть("Шапка_1_Р5");
	облРаздел5_2 = Макет.ПолучитьОбласть("Шапка_2_Р5");
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	облСтр2Заголовок = Макет.ПолучитьОбласть("Стр_Заголовок");
	СтруктураОблСтр2Заголовок = Новый Структура("НомерДокумента,НомерСтраницы");
	СтруктураОблСтр2Заголовок.НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДанныеШапки.Ссылка,ДанныеШапки.НомерДокумента);
	облСтр2Заголовок.Параметры.Заполнить(СтруктураДаты);
	СтруктураОблСтр2Заголовок.НомерСтраницы = НомерСтраницы;
	облСтр2Заголовок.Параметры.Заполнить(СтруктураОблСтр2Заголовок);
	ТабличныйДокумент.Вывести(облСтр2Заголовок);
	
	облЗаголовок_5 = Макет.ПолучитьОбласть("Заголовок_5");
	ТабличныйДокумент.Вывести(облЗаголовок_5);
		
	ТабличныйДокумент.Вывести(облРаздел5_1);	
	НомерПП = 0;
	МассивСтрок5_2 = Новый Массив;
	Для каждого СтрокаРасшифровки Из ТаблицаРасшифровкиОбязательства Цикл
		НомерПП = НомерПП + 1;
		
		облСтр_1 = Макет.ПолучитьОбласть("Стр_1_Р5");
		облСтр_1.Параметры.Заполнить(СтрокаРасшифровки);
		облСтр_1.Параметры.Заполнить(Новый Структура("НомерПП",НомерПП));
		
		облСтр_2 = Макет.ПолучитьОбласть("Стр_2_Р5");
		облСтр_2.Параметры.Заполнить(СтрокаРасшифровки);
		облСтр_2.Параметры.Заполнить(Новый Структура("НомерПП",НомерПП));
		
		ВыводимыеОбласти = Новый Массив;
		ВыводимыеОбласти.Добавить(облСтр_1);
		ВыводимыеОбласти.Добавить(облРазделитель);
		ВыводимыеОбласти.Добавить(облРаздел5_2);
		Для каждого Строка5_2 Из МассивСтрок5_2 Цикл 
			ВыводимыеОбласти.Добавить(Строка5_2);
		КонецЦикла; 
		ВыводимыеОбласти.Добавить(облСтр_2);
		ВыводимыеОбласти.Добавить(облРаздел5_2);
		
		Если НЕ ТабличныйДокумент.ПроверитьВывод(ВыводимыеОбласти) Тогда
			ТабличныйДокумент.Вывести(облРазделитель);
			ТабличныйДокумент.Вывести(облРаздел5_2);
			Для каждого Строка5_2 Из МассивСтрок5_2 Цикл 
				ТабличныйДокумент.Вывести(Строка5_2);
			КонецЦикла;
			ТабличныйДокумент.Вывести(облРазделитель);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			НомерСтраницы = НомерСтраницы + 1;
			облСтр2Заголовок.Параметры.Заполнить(Новый Структура("НомерСтраницы",НомерСтраницы));
			ТабличныйДокумент.Вывести(облСтр2Заголовок);
			ТабличныйДокумент.Вывести(облРаздел5_1);
			
			МассивСтрок5_2.Очистить();
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(облСтр_1);
		МассивСтрок5_2.Добавить(облСтр_2);
	КонецЦикла; 
	
	Если МассивСтрок5_2.Количество() > 0 Тогда
		ТабличныйДокумент.Вывести(облРазделитель);
		ТабличныйДокумент.Вывести(облРаздел5_2);
		Для каждого Строка5_2 Из МассивСтрок5_2 Цикл 
			ТабличныйДокумент.Вывести(Строка5_2);
		КонецЦикла;
		ТабличныйДокумент.Вывести(облРазделитель);		
		МассивСтрок5_2.Очистить();
	КонецЕсли; 
	
	облПодвал = Макет.ПолучитьОбласть("Подвал");
	облПодвал.Параметры.Заполнить(СтруктураДаты);
	облПодвал.Параметры.Заполнить(ДанныеШапки);
	ТабличныйДокумент.Вывести(облПодвал);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Формы в редакции приказа 151н

// Процедура заполняет табличный документ "Форма 0531702 (Сведения о принятом бюджетном обязательстве)"
//
Процедура ЗаполнитьТабличныйДокументФорма0531702_151н(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ИмяМакета)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам." + ИмяМакета);
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеХарактеристикОбязательства 	= ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеКонтактнойИнформации 			= ДанныеДляПечати.КонтактнаяИнформация.Выгрузить();
	ДанныеРасшифровкиОбязательства 		= ДанныеДляПечати.РасшифровкаОбязательства.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДанныеКонтрагентов 					= ДанныеДляПечати.Контрагенты.Выгрузить();

		
	ПервыйДокумент = Истина;
	Пока ДанныеШапки.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		СтруктураХарактеристик = ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаРасшифровкиОбязательства = ДанныеРасшифровкиОбязательства.Строки.НайтиСтроки(СтруктураПоиска);
		
		ТаблицаКонтрагентов = ДанныеКонтрагентов.НайтиСтроки(СтруктураПоиска);

		СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);
		 
		
		СформироватьЗаголовокИРаздел1_2Форм0531702_0531705_0531706_151н(ДанныеШапки, СтруктураДаты, ТаблицаКонтрагентов, ДанныеКонтактнойИнформации, Макет, ТабличныйДокумент);
		СформироватьРаздел3Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРаздел4Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРаздел5Форм0531702_0531705_0531706_151н(ТаблицаРасшифровкиОбязательства, ДанныеШапки, СтруктураДаты, Макет, ТабличныйДокумент);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры 

// Процедура заполняет табличный документ "Форма 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство)"
//
Процедура ЗаполнитьТабличныйДокументФорма0531705_151н(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ИмяМакета)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам." + ИмяМакета);
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеХарактеристикОбязательства 	= ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеКонтактнойИнформации 			= ДанныеДляПечати.КонтактнаяИнформация.Выгрузить();
	ДанныеРасшифровкиОбязательства 		= ДанныеДляПечати.РасшифровкаОбязательства.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДанныеКонтрагентов 					= ДанныеДляПечати.Контрагенты.Выгрузить();

		
	ПервыйДокумент = Истина;
	Пока ДанныеШапки.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		СтруктураХарактеристик = ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаРасшифровкиОбязательства = ДанныеРасшифровкиОбязательства.Строки.НайтиСтроки(СтруктураПоиска);
		
		ТаблицаКонтрагентов = ДанныеКонтрагентов.НайтиСтроки(СтруктураПоиска);

		СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);
		
		СформироватьЗаголовокИРаздел1_2Форм0531702_0531705_0531706_151н(ДанныеШапки, СтруктураДаты, ТаблицаКонтрагентов, ДанныеКонтактнойИнформации, Макет, ТабличныйДокумент);
		СформироватьРаздел3Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРаздел4Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРаздел5Форм0531702_0531705_0531706_151н(ТаблицаРасшифровкиОбязательства, ДанныеШапки, СтруктураДаты, Макет, ТабличныйДокумент);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры 

// Процедура заполняет табличный документ "Форма 0531706 (Заявка на перерегистрацию бюджетного обязательства)"
//
Процедура ЗаполнитьТабличныйДокументФорма0531706_151н(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ИмяМакета)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам." + ИмяМакета);
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеХарактеристикОбязательства 	= ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеКонтактнойИнформации 			= ДанныеДляПечати.КонтактнаяИнформация.Выгрузить();
	ДанныеРасшифровкиОбязательства 		= ДанныеДляПечати.РасшифровкаОбязательства.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДанныеКонтрагентов 					= ДанныеДляПечати.Контрагенты.Выгрузить();

		
	ПервыйДокумент = Истина;
	Пока ДанныеШапки.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		СтруктураХарактеристик = ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаРасшифровкиОбязательства = ДанныеРасшифровкиОбязательства.Строки.НайтиСтроки(СтруктураПоиска);
		
		ТаблицаКонтрагентов = ДанныеКонтрагентов.НайтиСтроки(СтруктураПоиска);

		СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);
		
		СформироватьЗаголовокИРаздел1_2Форм0531702_0531705_0531706_151н(ДанныеШапки, СтруктураДаты, ТаблицаКонтрагентов, ДанныеКонтактнойИнформации, Макет, ТабличныйДокумент);
		СформироватьРаздел3Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРаздел4Форм0531702_0531705_0531706(СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРаздел5Форм0531702_0531705_0531706_151н(ТаблицаРасшифровкиОбязательства, ДанныеШапки, СтруктураДаты, Макет, ТабличныйДокумент);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры 

Процедура СформироватьРаздел5Форм0531702_0531705_0531706_151н(ТаблицаРасшифровкиОбязательстваПоСсылке, ДанныеШапки, СтруктураДаты, Макет, ТабличныйДокумент)	
	
	НомерСтраницы = 2;
	ОблРазделитель = Макет.ПолучитьОбласть("Разделитель");
	ОблРазделитель2 = Макет.ПолучитьОбласть("Разделитель2");

	ОблРаздел5_1 = Макет.ПолучитьОбласть("Шапка_1_Р5");
	ОблРаздел5_2 = Макет.ПолучитьОбласть("Шапка_2_Р5");
	
	ОблРаздел5_1.Параметры.Заполнить(СтруктураДаты);
	ОблРаздел5_2.Параметры.Заполнить(СтруктураДаты);
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОблСтр2Заголовок = Макет.ПолучитьОбласть("Стр_Заголовок");
	СтруктураОблСтр2Заголовок = Новый Структура("НомерДокумента, НомерСтраницы");
	СтруктураОблСтр2Заголовок.НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДанныеШапки.Ссылка, ДанныеШапки.НомерДокумента);
	ОблСтр2Заголовок.Параметры.Заполнить(СтруктураДаты);
	СтруктураОблСтр2Заголовок.НомерСтраницы = НомерСтраницы;
	ОблСтр2Заголовок.Параметры.Заполнить(СтруктураОблСтр2Заголовок);
	ТабличныйДокумент.Вывести(облСтр2Заголовок);
	
	ОблЗаголовок_5 = Макет.ПолучитьОбласть("Заголовок_5");
	ТабличныйДокумент.Вывести(облЗаголовок_5);
		
	ТабличныйДокумент.Вывести(ОблРаздел5_1);	
	
	НомерПП 		= 0;
	ОбъектФАИП 		= 0;
	КодСтр			= 0;
	МассивСтрок5_2 	= Новый Массив;
	
	Если ТаблицаРасшифровкиОбязательстваПоСсылке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаРасшифровкиОбязательства = ТаблицаРасшифровкиОбязательстваПоСсылке[0];
	
	Для Каждого СтрокаРасшифровкиИтогПоФАИП Из ТаблицаРасшифровкиОбязательства.Строки Цикл
		
		НомерПП = 0;
		
		Для Каждого СтрокаРасшифровки Из СтрокаРасшифровкиИтогПоФАИП.Строки Цикл
			
			НомерПП = НомерПП + 1;
			КодСтр	= КодСтр + 1;
			
			ОблСтр_1 = Макет.ПолучитьОбласть("Стр_1_Р5");
			ОблСтр_1.Параметры.Заполнить(СтрокаРасшифровки);
			ОблСтр_1.Параметры.Заполнить(Новый Структура("НомерПП", НомерПП));
			ОблСтр_1.Параметры.Заполнить(Новый Структура("КодСтр", КодСтр));

			
			Если НомерПП > 1 Тогда
				ОблСтр_1.Параметры.Заполнить(Новый Структура("КодФАИП, НаименованиеОбъектаФАИП", "", ""));
	        КонецЕсли;
			
			ОблСтр_2 = Макет.ПолучитьОбласть("Стр_2_Р5");
			ОблСтр_2.Параметры.Заполнить(СтрокаРасшифровки);
			ОблСтр_2.Параметры.Заполнить(Новый Структура("НомерПП", НомерПП));
			ОблСтр_2.Параметры.Заполнить(Новый Структура("КодСтр", КодСтр));
			
			ВыводимыеОбласти = Новый Массив;
			ВыводимыеОбласти.Добавить(ОблСтр_1);
			ВыводимыеОбласти.Добавить(ОблРазделитель);
			ВыводимыеОбласти.Добавить(ОблРаздел5_2);
			Для каждого Строка5_2 Из МассивСтрок5_2 Цикл 
				ВыводимыеОбласти.Добавить(Строка5_2);
			КонецЦикла; 
			ВыводимыеОбласти.Добавить(ОблСтр_2);
			ВыводимыеОбласти.Добавить(ОблРаздел5_2);
			
			Если НЕ ТабличныйДокумент.ПроверитьВывод(ВыводимыеОбласти) Тогда
				ТабличныйДокумент.Вывести(ОблРазделитель2);
				ТабличныйДокумент.Вывести(ОблРаздел5_2);
				Для каждого Строка5_2 Из МассивСтрок5_2 Цикл 
					ТабличныйДокумент.Вывести(Строка5_2);
				КонецЦикла;
				ТабличныйДокумент.Вывести(ОблРазделитель);
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				НомерСтраницы = НомерСтраницы + 1;
				ОблСтр2Заголовок.Параметры.Заполнить(Новый Структура("НомерСтраницы",НомерСтраницы));
				ТабличныйДокумент.Вывести(ОблСтр2Заголовок);
				ТабличныйДокумент.Вывести(ОблРаздел5_1);
				
				МассивСтрок5_2.Очистить();
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОблСтр_1);
			МассивСтрок5_2.Добавить(ОблСтр_2);
			
		КонецЦикла;	
		
		Если ЗначениеЗаполнено(СтрокаРасшифровкиИтогПоФАИП.КодФАИП) Тогда
			
			КодСтр	= КодСтр + 1;

			ОблСтр_1 = Макет.ПолучитьОбласть("Стр_1_Р5_Итог");
			ОблСтр_1.Параметры.Заполнить(СтрокаРасшифровкиИтогПоФАИП);
			ОблСтр_1.Параметры.Заполнить(Новый Структура("КодСтр", КодСтр));
			
			ОблСтр_2 = Макет.ПолучитьОбласть("Стр_2_Р5_Итог");
			ОблСтр_2.Параметры.Заполнить(СтрокаРасшифровкиИтогПоФАИП);
			ОблСтр_2.Параметры.Заполнить(Новый Структура("КодСтр", КодСтр));
			
			ВыводимыеОбласти = Новый Массив;
			ВыводимыеОбласти.Добавить(ОблСтр_1);
			ВыводимыеОбласти.Добавить(ОблРазделитель);
			ВыводимыеОбласти.Добавить(ОблРаздел5_2);
			Для каждого Строка5_2 Из МассивСтрок5_2 Цикл 
				ВыводимыеОбласти.Добавить(Строка5_2);
			КонецЦикла; 
			ВыводимыеОбласти.Добавить(ОблСтр_2);
			ВыводимыеОбласти.Добавить(ОблРаздел5_2);

            Если НЕ ТабличныйДокумент.ПроверитьВывод(ВыводимыеОбласти) Тогда
				
				ТабличныйДокумент.Вывести(ОблРазделитель2);
				ТабличныйДокумент.Вывести(ОблРаздел5_2);
				Для каждого Строка5_2 Из МассивСтрок5_2 Цикл 
					ТабличныйДокумент.Вывести(Строка5_2);
				КонецЦикла;
				ТабличныйДокумент.Вывести(облРазделитель);
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				НомерСтраницы = НомерСтраницы + 1;
				ОблСтр2Заголовок.Параметры.Заполнить(Новый Структура("НомерСтраницы", НомерСтраницы));
				ТабличныйДокумент.Вывести(ОблСтр2Заголовок);
				ТабличныйДокумент.Вывести(ОблРаздел5_1);
				
				МассивСтрок5_2.Очистить();
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(облСтр_1);
			МассивСтрок5_2.Добавить(облСтр_2);
			
		КонецЕсли
			
	КонецЦикла; 
	
	Если МассивСтрок5_2.Количество() > 0 Тогда
		ТабличныйДокумент.Вывести(ОблРазделитель2);
		ТабличныйДокумент.Вывести(ОблРаздел5_2);
		Для каждого Строка5_2 Из МассивСтрок5_2 Цикл 
			ТабличныйДокумент.Вывести(Строка5_2);
		КонецЦикла;
		ТабличныйДокумент.Вывести(ОблРазделитель);		
		МассивСтрок5_2.Очистить();
	КонецЕсли; 
	
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ОблПодвал.Параметры.Заполнить(СтруктураДаты);
	ОблПодвал.Параметры.Заполнить(ДанныеШапки);
	ТабличныйДокумент.Вывести(ОблПодвал);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// Сведения о государственном контракте

// Процедура заполняет табличный документ "Сведения о ГК"
//
Процедура ЗаполнитьТабличныйДокументСведенияГК(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеБюджет 						= ДанныеДляПечати.РезультатБюджет.Выгрузить();
	ДанныеВнебюджет 					= ДанныеДляПечати.РезультатВнебюджет.Выгрузить();
	ДанныеКонтракта 					= ДанныеДляПечати.ПредметКонтракта.Выгрузить();
	ДанныеХарактеристикОбязательства 	= ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеПоПериодам 					= ДанныеДляПечати.ПериодыГодами.Выгрузить();
	ДанныеКонтактнойИнформации 			= ДанныеДляПечати.КонтактнаяИнформация.Выгрузить();
	ДанныеКонтрагентов					= ДанныеДляПечати.Контрагенты.Выгрузить();
	ДанныеКонтрагентов.Свернуть("Ссылка, Контрагент, КонтрагентНаименование, КонтрагентИНН, КонтрагентКПП");	
	
	ПервыйДокумент = Истина;
	Пока ДанныеШапки.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		ТаблицаБюджет = ДанныеБюджет.НайтиСтроки(СтруктураПоиска);
		ТаблицаВнебюджет = ДанныеВнебюджет.НайтиСтроки(СтруктураПоиска);
		ТаблицаКонтракта = ДанныеКонтракта.НайтиСтроки(СтруктураПоиска);
		ТаблицаПериодов = ДанныеПоПериодам.НайтиСтроки(СтруктураПоиска);
		СтруктураХарактеристик = ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		
		ИмяМакета = ?(СтруктураХарактеристик.ЭтоСекретныйДокумент, "ПФ_MXL_СведенияГКСекретные", "ПФ_MXL_СведенияГК"); 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам." + ИмяМакета);
		
		СформироватьЗаголовокСведенийГК(ДанныеШапки, СтруктураХарактеристик, Макет, ТабличныйДокумент);		
		СформироватьПланФинансированияСведенийГК("Бюджет", ТаблицаБюджет, ТаблицаПериодов, СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьПланФинансированияСведенийГК("Внебюджет", ТаблицаВнебюджет, ТаблицаПериодов, СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРазделПредметКонтракта(ТаблицаКонтракта, Макет, ТабличныйДокумент);
				
		// Контрагенты
		
		облЗаголовокКонтрагент = Макет.ПолучитьОбласть("ЗаголовокКонтрагент");
        ТабличныйДокумент.Вывести(облЗаголовокКонтрагент);

		облСтрокаКонтрагент = Макет.ПолучитьОбласть("СтрокаКонтрагент");
		
		НомерПП = 0;

		Для Каждого СтрКонтрагент Из ДанныеКонтрагентов Цикл
			
			НомерПП = НомерПП + 1;
			
			СтруктураПоиска = Новый Структура("Контрагент", СтрКонтрагент.Контрагент);
			СтруктураКонтактнойИнформацииКонтрагента = ПолучитьСтруктуруКонтактнойИнформации(ДанныеКонтактнойИнформации.НайтиСтроки(СтруктураПоиска));
			
			СтруктураоблЗаголовокКонтрагент = Новый Структура("НомерПП, КонтрагентНаименование, КонтрагентИНН, КонтрагентКПП");
			СтруктураоблЗаголовокКонтрагент.НомерПП					= НомерПП; 
			СтруктураоблЗаголовокКонтрагент.КонтрагентНаименование 	= СтрКонтрагент.КонтрагентНаименование;
			СтруктураоблЗаголовокКонтрагент.КонтрагентИНН 			= СтрКонтрагент.КонтрагентИНН;
			СтруктураоблЗаголовокКонтрагент.КонтрагентКПП 			= СтрКонтрагент.КонтрагентКПП;
			
			облСтрокаКонтрагент.Параметры.Заполнить(СтруктураоблЗаголовокКонтрагент);
			облСтрокаКонтрагент.Параметры.Заполнить(СтруктураКонтактнойИнформацииКонтрагента);
			
			ТабличныйДокумент.Вывести(облСтрокаКонтрагент);
			
		КонецЦикла;

		
		// Подвал
		облПодвал = Макет.ПолучитьОбласть("Подвал");
		СтруктураоблПодвал = Новый Структура("ДатаПодписи, ОргДиректор");
		СтруктураоблПодвал.ДатаПодписи = Формат(ДанныеШапки.ДатаДокумента, "ДФ='«дд» ММММ гггг'") + " г.";
		СтруктураоблПодвал.ОргДиректор = ДанныеШапки.ФИОРуководителя;
		облПодвал.Параметры.Заполнить(СтруктураоблПодвал);
		ТабличныйДокумент.Вывести(облПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры // ЗаполнитьТабличныйДокументСведенияГК()

// Процедура заполняет табличный документ "Сведения о ГК" по пр. от 25.11.2024 № 17н 
// Форма действует с 01.01.2025
//
Процедура ЗаполнитьТабличныйДокументСведенияГК_17н2025(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеБюджет 						= ДанныеДляПечати.РезультатБюджет.Выгрузить();
	ДанныеВнебюджет 					= ДанныеДляПечати.РезультатВнебюджет.Выгрузить();
	ДанныеКонтракта 					= ДанныеДляПечати.ПредметКонтракта.Выгрузить();
	ДанныеХарактеристикОбязательства 	= ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеПоПериодам 					= ДанныеДляПечати.ПериодыГодами.Выгрузить();
	ДанныеКонтактнойИнформации 			= ДанныеДляПечати.КонтактнаяИнформация.Выгрузить();
	ДанныеКонтрагентов					= ДанныеДляПечати.Контрагенты.Выгрузить(); 
	ДанныеБюджетТекГод 					= ДанныеДляПечати.РезультатБюджетТекГод.Выгрузить();
	
	ПервыйДокумент = Истина;
	Пока ДанныеШапки.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска        = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		ТаблицаБюджет          = ДанныеБюджет.НайтиСтроки(СтруктураПоиска);
		ТаблицаВнебюджет       = ДанныеВнебюджет.НайтиСтроки(СтруктураПоиска);
		ТаблицаКонтракта       = ДанныеКонтракта.НайтиСтроки(СтруктураПоиска);
		ТаблицаПериодов        = ДанныеПоПериодам.НайтиСтроки(СтруктураПоиска);
		СтруктураХарактеристик = ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаБюджетТекГод    = ДанныеБюджетТекГод.НайтиСтроки(СтруктураПоиска);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам.ПФ_MXL_СведенияГКСекретные_17н2025");
		
		СформироватьЗаголовокСведенийГК_18н(ДанныеШапки, СтруктураХарактеристик, Макет, ТабличныйДокумент);		
		//СформироватьПланФинансированияСведенийГК("Бюджет", ТаблицаБюджет, ТаблицаПериодов, СтруктураХарактеристик, Макет, ТабличныйДокумент); 
		
		// Бюджетные средства с разбивкой по годам.
		//
		КолонкиСуммПериодов 	= "";
		СоответствиеПериодов 	= Новый Соответствие;
		КоличествоПериодов 		= ТаблицаПериодов.Количество(); 
		ИндексПоГрифу 			= 9;
		Если ИндексПоГрифу > КоличествоПериодов - 1 Тогда
			МаксимальныйИндекс = КоличествоПериодов - 1;
		Иначе
			МаксимальныйИндекс = ИндексПоГрифу;
		КонецЕсли; 
	
		// Заголовок раздела
		облЗаголовокРаздел = Макет.ПолучитьОбласть("ЗаголовокБюджет");
		СтруктураоблЗаголовокРаздел = Новый Структура;
		Для Индекс = 0 По МаксимальныйИндекс Цикл
			СтруктураоблЗаголовокРаздел.Вставить("Год_" + Строка(Индекс + 1), Формат(ТаблицаПериодов[Индекс].Год, "ЧДЦ=0; ЧГ=0"));
			СоответствиеПериодов[ТаблицаПериодов[Индекс].Год] = Строка(Индекс + 1);
		КонецЦикла; 
		Для Индекс = МаксимальныйИндекс + 1 По ИндексПоГрифу Цикл
			СтруктураоблЗаголовокРаздел.Вставить("Год_" + Строка(Индекс + 1), "20__");
		КонецЦикла;
	
		облЗаголовокРаздел.Параметры.Заполнить(СтруктураоблЗаголовокРаздел);
		ТабличныйДокумент.Вывести(облЗаголовокРаздел);
		
		Если ТаблицаБюджет.Количество() = 0 Тогда	
			облСтрокаРаздел = Макет.ПолучитьОбласть("СтрокаБюджет");
			ТабличныйДокумент.Вывести(облСтрокаРаздел);
			облИтогРаздел = Макет.ПолучитьОбласть("ИтогБюджет");
			ТабличныйДокумент.Вывести(облИтогРаздел);
		Иначе 
			
			// Строки раздела
			
			ТаблицаРаздела = Новый ТаблицаЗначений;
			ТаблицаРаздела.Колонки.Добавить("Код");
			ТаблицаРаздела.Колонки.Добавить("КодФАИП");
			ТаблицаРаздела.Колонки.Добавить("НаимФАИП"); 
			ТаблицаРаздела.Колонки.Добавить("ПризнакБезусловности");
			ТаблицаРаздела.Колонки.Добавить("Примечание");
			
			Для Индекс = 0 ПО МаксимальныйИндекс Цикл
				ИмяКолонки = "СуммаГод_" + Строка(Индекс + 1);
				ТаблицаРаздела.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Число"));
				КолонкиСуммПериодов = КолонкиСуммПериодов + ?(ПустаяСтрока(КолонкиСуммПериодов), "", ", ") + ИмяКолонки;
			КонецЦикла; 	
			
			Для Каждого СтрокаДанных Из ТаблицаБюджет Цикл
				СтрокаРаздела = ТаблицаРаздела.Добавить();
				СтрокаРаздела.Код = СтрокаДанных.КБК;
				ЗаполнитьЗначенияСвойств(СтрокаРаздела, СтрокаДанных);
				КолонкаГода = "СуммаГод_" + СоответствиеПериодов[СтрокаДанных.Год];
				СтрокаРаздела[КолонкаГода] = СтрокаДанных.Сумма;
			КонецЦикла; 
			
			ТаблицаРаздела.Свернуть("Код, КодФАИП, НаимФАИП, ПризнакБезусловности, Примечание", КолонкиСуммПериодов);
			
			облСтрокаРаздел = Макет.ПолучитьОбласть("СтрокаБюджет");
			Для Каждого СтрокаРаздела Из ТаблицаРаздела Цикл
				облСтрокаРаздел.Параметры.Заполнить(СтрокаРаздела);
				ТабличныйДокумент.Вывести(облСтрокаРаздел);
			КонецЦикла; 
			
			// Итоги раздела
			облИтогРаздел = Макет.ПолучитьОбласть("ИтогБюджет");
			ТаблицаРаздела.Колонки.Добавить("_Свертка");
			ТаблицаРаздела.Свернуть("_Свертка", КолонкиСуммПериодов);
			облИтогРаздел.Параметры.Заполнить(ТаблицаРаздела[0]);
			ТабличныйДокумент.Вывести(облИтогРаздел);
			
		КонецЕсли;
		
		// Бюджет, текущий финансовый год по месяцам 
		//
		КолонкиСуммПериодов 	= "";
		
		// Заголовок раздела
		облЗаголовокРаздел = Макет.ПолучитьОбласть("ЗаголовокБюджетМесяц");
		ТабличныйДокумент.Вывести(облЗаголовокРаздел);
		
		Если ТаблицаБюджетТекГод.Количество() = 0 Тогда	
			облСтрокаРаздел = Макет.ПолучитьОбласть("СтрокаБюджетМесяц");
			ТабличныйДокумент.Вывести(облСтрокаРаздел);
			облИтогРаздел = Макет.ПолучитьОбласть("ИтогБюджетМесяц");
			ТабличныйДокумент.Вывести(облИтогРаздел);
		Иначе
			
			// Строки раздела
			
			ТаблицаРаздела = Новый ТаблицаЗначений;
			ТаблицаРаздела.Колонки.Добавить("Код");
			ТаблицаРаздела.Колонки.Добавить("КодФАИП");
			ТаблицаРаздела.Колонки.Добавить("НаимФАИП"); 
			ТаблицаРаздела.Колонки.Добавить("ПризнакБезусловности");
			ТаблицаРаздела.Колонки.Добавить("АналитичКод");
			ТаблицаРаздела.Колонки.Добавить("Примечание");
			
			Для Индекс = 1 ПО 12 Цикл
				ИмяКолонки = "Сумма_" + Строка(Индекс);
				ТаблицаРаздела.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Число"));
				КолонкиСуммПериодов = КолонкиСуммПериодов + ?(ПустаяСтрока(КолонкиСуммПериодов), "", ", ") + ИмяКолонки;
			КонецЦикла; 
			
			ТаблицаРаздела.Колонки.Добавить("СуммаГод", Новый ОписаниеТипов("Число")); 
			КолонкиСуммПериодов = КолонкиСуммПериодов + ", СуммаГод";
			
			Для каждого СтрокаДанных Из ТаблицаБюджетТекГод Цикл
				СтрокаРаздела = ТаблицаРаздела.Добавить();
				СтрокаРаздела.Код = СтрокаДанных.КБК;
				ЗаполнитьЗначенияСвойств(СтрокаРаздела, СтрокаДанных);
				КолонкаМесяц = "Сумма_" + Строка(СтрокаДанных.Месяц);
				СтрокаРаздела[КолонкаМесяц] = СтрокаДанных.Сумма;
			КонецЦикла; 
			
			ТаблицаРаздела.Свернуть("Код, КодФАИП, НаимФАИП, ПризнакБезусловности, АналитичКод, Примечание", КолонкиСуммПериодов); 
			
			Для Каждого СтрокаДанных Из ТаблицаРаздела Цикл
				СтрокаДанных.СуммаГод = СтрокаДанных.Сумма_1 + СтрокаДанных.Сумма_2 + СтрокаДанных.Сумма_3 + СтрокаДанных.Сумма_4 + СтрокаДанных.Сумма_5		
				+ СтрокаДанных.Сумма_6 + СтрокаДанных.Сумма_7 + СтрокаДанных.Сумма_8 + СтрокаДанных.Сумма_9 + СтрокаДанных.Сумма_10 + СтрокаДанных.Сумма_11 + СтрокаДанных.Сумма_12;
			КонецЦикла;	
			
			облСтрокаРаздел = Макет.ПолучитьОбласть("СтрокаБюджетМесяц");
			Для Каждого СтрокаРаздела Из ТаблицаРаздела Цикл
				облСтрокаРаздел.Параметры.Заполнить(СтрокаРаздела);
				ТабличныйДокумент.Вывести(облСтрокаРаздел);
			КонецЦикла;   
			
			ТаблицаДляКС = ТаблицаРаздела.Скопировать();
			
			// Итоги раздела
			облИтогРаздел = Макет.ПолучитьОбласть("ИтогБюджетМесяц");
			ТаблицаРаздела.Колонки.Добавить("_Свертка");
			ТаблицаРаздела.Свернуть("_Свертка", КолонкиСуммПериодов);
			облИтогРаздел.Параметры.Заполнить(ТаблицаРаздела[0]);
			ТабличныйДокумент.Вывести(облИтогРаздел); 
			
		КонецЕсли; 
	
		// Казначейское обеспечение  
		// Данных по требуемой аналитике (условное/безусловное) в базе нет.
		// Просто выводим пустую таблицу для ручного заполнения
		облЗаголовокРаздел = Макет.ПолучитьОбласть("ЗаголовокКС");
		ТабличныйДокумент.Вывести(облЗаголовокРаздел); 
		облСтрокаРаздел = Макет.ПолучитьОбласть("СтрокаКС");
		Если ТаблицаБюджетТекГод.Количество() = 0 Тогда
			ТабличныйДокумент.Вывести(облСтрокаРаздел);
		Иначе
			Для Каждого СтрКС Из ТаблицаДляКС Цикл
				ТабличныйДокумент.Вывести(облСтрокаРаздел);	
			КонецЦикла;
		КонецЕсли;
			
		СформироватьПланФинансированияСведенийГК("Внебюджет", ТаблицаВнебюджет, ТаблицаПериодов, СтруктураХарактеристик, Макет, ТабличныйДокумент);  
			
		СформироватьРазделПредметКонтракта(ТаблицаКонтракта, Макет, ТабличныйДокумент);
				
		// Контрагенты
		
		облЗаголовокКонтрагент = Макет.ПолучитьОбласть("ЗаголовокКонтрагент");
        ТабличныйДокумент.Вывести(облЗаголовокКонтрагент);

		облСтрокаКонтрагент = Макет.ПолучитьОбласть("СтрокаКонтрагент");
		
		НомерПП = 0;

		Для Каждого СтрКонтрагент Из ДанныеКонтрагентов Цикл
			
			НомерПП = НомерПП + 1;
			
			СтруктураПоиска = Новый Структура("Контрагент", СтрКонтрагент.Контрагент);
			СтруктураКонтактнойИнформацииКонтрагента = ПолучитьСтруктуруКонтактнойИнформации(ДанныеКонтактнойИнформации.НайтиСтроки(СтруктураПоиска));
			
			СтруктураоблЗаголовокКонтрагент = Новый Структура("НомерПП, КонтрагентНаименование, КонтрагентИНН, КонтрагентКПП");
			СтруктураоблЗаголовокКонтрагент.НомерПП					= НомерПП; 
			СтруктураоблЗаголовокКонтрагент.КонтрагентНаименование 	= СтрКонтрагент.КонтрагентНаименование;
			Если ЗначениеЗаполнено(СтрКонтрагент.КонтрагентНаименованиеСокращенное)
				И НЕ СтрКонтрагент.КонтрагентНаименованиеСокращенное = СтрКонтрагент.КонтрагентНаименование Тогда
				СтруктураоблЗаголовокКонтрагент.КонтрагентНаименование = СтруктураоблЗаголовокКонтрагент.КонтрагентНаименование +
				", " + СтрКонтрагент.КонтрагентНаименованиеСокращенное;
			КонецЕсли;	
			СтруктураоблЗаголовокКонтрагент.КонтрагентИНН 			= СтрКонтрагент.КонтрагентИНН;
			СтруктураоблЗаголовокКонтрагент.КонтрагентКПП 			= СтрКонтрагент.КонтрагентКПП;
			
			облСтрокаКонтрагент.Параметры.Заполнить(СтрКонтрагент);
			облСтрокаКонтрагент.Параметры.Заполнить(СтруктураоблЗаголовокКонтрагент);
			облСтрокаКонтрагент.Параметры.Заполнить(СтруктураКонтактнойИнформацииКонтрагента); 
			
			РеквизитыБанковские = Новый Структура("КонтрагентСчет, КонтрагентБанк, КонтрагентБИК, КонтрагентКорСчет",
			"СчетНомер", "Банк", "БИК", "КоррСчет");  
			ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(СтрКонтрагент.СчетКонтрагента, СтрКонтрагент.СчетКонтрагента, РеквизитыБанковские);
	
			СтруктураРеквизитов = Новый Структура("ТипЛицевогоСчета, Код"); 
    		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрКонтрагент.СчетКонтрагента, СтруктураРеквизитов);
	
			Если СтруктураРеквизитов.ТипЛицевогоСчета = Перечисления.ТипыЛицевыхСчетов.Казначейский Тогда
				РеквизитыБанковские.Вставить("КонтрагентЛС",СтруктураРеквизитов.Код);
			Иначе
				РеквизитыБанковские.Вставить("КонтрагентЛС","");
			КонецЕсли;	
    
			облСтрокаКонтрагент.Параметры.Заполнить(РеквизитыБанковские);			
			
			ТабличныйДокумент.Вывести(облСтрокаКонтрагент);
			
		КонецЦикла;

		
		// Подвал
		облПодвал = Макет.ПолучитьОбласть("Подвал");
		СтруктураоблПодвал = Новый Структура("ДатаПодписи,ОргДиректор");
		СтруктураоблПодвал.ДатаПодписи = Формат(ДанныеШапки.ДатаДокумента, "ДФ='«дд» ММММ гггг'") + " г.";
		СтруктураоблПодвал.ОргДиректор = ДанныеШапки.ФИОРуководителя;
		облПодвал.Параметры.Заполнить(СтруктураоблПодвал);
		ТабличныйДокумент.Вывести(облПодвал);
				
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
	КонецЦикла;	
	
КонецПроцедуры // ЗаполнитьТабличныйДокументСведенияГК()

// Процедура заполняет табличный документ "Сведения о ГК" по пр. от 25.11.2024 № 17н 
// в ред. приказа Казначейства России от 12.01.2026 N 1н 
// Форма действует с 01.03.2026
//
Процедура ЗаполнитьТабличныйДокументСведенияГК_17н2026(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеБюджет 						= ДанныеДляПечати.РезультатБюджет.Выгрузить();
	ДанныеВнебюджет 					= ДанныеДляПечати.РезультатВнебюджет.Выгрузить();
	ДанныеКонтракта 					= ДанныеДляПечати.ПредметКонтракта.Выгрузить();
	ДанныеХарактеристикОбязательства 	= ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеПоПериодам 					= ДанныеДляПечати.ПериодыГодами.Выгрузить();
	ДанныеКонтактнойИнформации 			= ДанныеДляПечати.КонтактнаяИнформация.Выгрузить();
	ДанныеКонтрагентов					= ДанныеДляПечати.Контрагенты.Выгрузить(); 
	ДанныеБюджетТекГод 					= ДанныеДляПечати.РезультатБюджетТекГод.Выгрузить();
	
	ПервыйДокумент = Истина;
	Пока ДанныеШапки.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска        = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		ТаблицаБюджет          = ДанныеБюджет.НайтиСтроки(СтруктураПоиска);
		ТаблицаВнебюджет       = ДанныеВнебюджет.НайтиСтроки(СтруктураПоиска);
		ТаблицаКонтракта       = ДанныеКонтракта.НайтиСтроки(СтруктураПоиска);
		ТаблицаПериодов        = ДанныеПоПериодам.НайтиСтроки(СтруктураПоиска);
		СтруктураХарактеристик = ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаБюджетТекГод    = ДанныеБюджетТекГод.НайтиСтроки(СтруктураПоиска);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам.ПФ_MXL_СведенияГКСекретные_17н2026");
		
		СформироватьЗаголовокСведенийГК_18н(ДанныеШапки, СтруктураХарактеристик, Макет, ТабличныйДокумент);		
		
		// Бюджетные средства с разбивкой по годам.
		//
		ОблЗаголовокРаздел = Макет.ПолучитьОбласть("ЗаголовокБюджет");
		ТабличныйДокумент.Вывести(ОблЗаголовокРаздел);
		ИтогБюджет = Новый Структура("Сумма", 0);
		Для Каждого СтрокаДанных Из ТаблицаБюджет Цикл
			ОблСтрокаРаздел = Макет.ПолучитьОбласть("СтрокаБюджет");
			ОблСтрокаРаздел.Параметры.Заполнить(СтрокаДанных); 
			ТабличныйДокумент.Вывести(ОблСтрокаРаздел);
			ИтогБюджет.Сумма = ИтогБюджет.Сумма + СтрокаДанных.Сумма;
		КонецЦикла; 
		ОблИтогРаздел = Макет.ПолучитьОбласть("ИтогБюджет");
        ОблИтогРаздел.Параметры.Заполнить(ИтогБюджет);
		ТабличныйДокумент.Вывести(ОблИтогРаздел);
		
		// Бюджет, текущий финансовый год по месяцам 
		//
		КолонкиСуммПериодов = "";
		// Заголовок раздела
		ОблЗаголовокРаздел = Макет.ПолучитьОбласть("ЗаголовокБюджетМесяц");
		ТабличныйДокумент.Вывести(облЗаголовокРаздел);
		Если ТаблицаБюджетТекГод.Количество() = 0 Тогда	
			облСтрокаРаздел = Макет.ПолучитьОбласть("СтрокаБюджетМесяц");
			ТабличныйДокумент.Вывести(облСтрокаРаздел);
			облИтогРаздел = Макет.ПолучитьОбласть("ИтогБюджетМесяц");
			ТабличныйДокумент.Вывести(облИтогРаздел);
		Иначе
			// Строки раздела
			ТаблицаРаздела = Новый ТаблицаЗначений;
			ТаблицаРаздела.Колонки.Добавить("Код");
			ТаблицаРаздела.Колонки.Добавить("КодФАИП");
			ТаблицаРаздела.Колонки.Добавить("НаимФАИП"); 
			ТаблицаРаздела.Колонки.Добавить("ПризнакБезусловности");
			ТаблицаРаздела.Колонки.Добавить("АналитичКод");
			ТаблицаРаздела.Колонки.Добавить("Примечание");
			Для Индекс = 1 ПО 12 Цикл
				ИмяКолонки = "Сумма_" + Строка(Индекс);
				ТаблицаРаздела.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Число"));
				КолонкиСуммПериодов = КолонкиСуммПериодов + ?(ПустаяСтрока(КолонкиСуммПериодов), "", ", ") + ИмяКолонки;
			КонецЦикла; 
			ТаблицаРаздела.Колонки.Добавить("СуммаГод", Новый ОписаниеТипов("Число")); 
			КолонкиСуммПериодов = КолонкиСуммПериодов + ", СуммаГод";
			Для каждого СтрокаДанных Из ТаблицаБюджетТекГод Цикл
				СтрокаРаздела = ТаблицаРаздела.Добавить();
				СтрокаРаздела.Код = СтрокаДанных.КБК;
				ЗаполнитьЗначенияСвойств(СтрокаРаздела, СтрокаДанных);
				КолонкаМесяц = "Сумма_" + Строка(СтрокаДанных.Месяц);
				СтрокаРаздела[КолонкаМесяц] = СтрокаДанных.Сумма;
			КонецЦикла; 
			ТаблицаРаздела.Свернуть("Код, КодФАИП, НаимФАИП, ПризнакБезусловности, АналитичКод, Примечание", КолонкиСуммПериодов); 
			Для Каждого СтрокаДанных Из ТаблицаРаздела Цикл
				СтрокаДанных.СуммаГод = СтрокаДанных.Сумма_1 + СтрокаДанных.Сумма_2 + СтрокаДанных.Сумма_3 + СтрокаДанных.Сумма_4 + СтрокаДанных.Сумма_5		
				+ СтрокаДанных.Сумма_6 + СтрокаДанных.Сумма_7 + СтрокаДанных.Сумма_8 + СтрокаДанных.Сумма_9 + СтрокаДанных.Сумма_10 + СтрокаДанных.Сумма_11 + СтрокаДанных.Сумма_12;
			КонецЦикла;	
			облСтрокаРаздел = Макет.ПолучитьОбласть("СтрокаБюджетМесяц");
			Для Каждого СтрокаРаздела Из ТаблицаРаздела Цикл
				облСтрокаРаздел.Параметры.Заполнить(СтрокаРаздела);
				ТабличныйДокумент.Вывести(облСтрокаРаздел);
			КонецЦикла;   
			ТаблицаДляКС = ТаблицаРаздела.Скопировать();
			// Итоги раздела
			облИтогРаздел = Макет.ПолучитьОбласть("ИтогБюджетМесяц");
			ТаблицаРаздела.Колонки.Добавить("_Свертка");
			ТаблицаРаздела.Свернуть("_Свертка", КолонкиСуммПериодов);
			облИтогРаздел.Параметры.Заполнить(ТаблицаРаздела[0]);
			ТабличныйДокумент.Вывести(облИтогРаздел); 
		КонецЕсли; 
				
		// Внебюджет с разбивкой по годам.
		//
		ОблЗаголовокРаздел = Макет.ПолучитьОбласть("ЗаголовокВнебюджет");
		ТабличныйДокумент.Вывести(ОблЗаголовокРаздел);
		Итог = Новый Структура("Сумма", 0);
		Для Каждого СтрокаДанных Из ТаблицаВнебюджет Цикл
			ОблСтрокаРаздел = Макет.ПолучитьОбласть("СтрокаВнебюджет");
			ОблСтрокаРаздел.Параметры.Заполнить(СтрокаДанных); 
			ТабличныйДокумент.Вывести(ОблСтрокаРаздел);
			Итог.Сумма = Итог.Сумма + СтрокаДанных.Сумма;
		КонецЦикла; 
		ОблИтогРаздел = Макет.ПолучитьОбласть("ИтогВнебюджет");
        ОблИтогРаздел.Параметры.Заполнить(Итог);
		ТабличныйДокумент.Вывести(ОблИтогРаздел);
        		
		СформироватьРазделПредметКонтракта(ТаблицаКонтракта, Макет, ТабличныйДокумент);
				
		// Контрагенты
		//	
		облЗаголовокКонтрагент = Макет.ПолучитьОбласть("ЗаголовокКонтрагент");
        ТабличныйДокумент.Вывести(облЗаголовокКонтрагент);
		облСтрокаКонтрагент = Макет.ПолучитьОбласть("СтрокаКонтрагент");
		
		НомерПП = 0;
		Для Каждого СтрКонтрагент Из ДанныеКонтрагентов Цикл
			НомерПП = НомерПП + 1;
			
			СтруктураПоиска = Новый Структура("Контрагент", СтрКонтрагент.Контрагент);
			СтруктураКонтактнойИнформацииКонтрагента = ПолучитьСтруктуруКонтактнойИнформации(ДанныеКонтактнойИнформации.НайтиСтроки(СтруктураПоиска));
			
			СтруктураоблЗаголовокКонтрагент = Новый Структура("НомерПП, КонтрагентНаименование, КонтрагентИНН, КонтрагентКПП");
			СтруктураоблЗаголовокКонтрагент.НомерПП					= НомерПП; 
			СтруктураоблЗаголовокКонтрагент.КонтрагентНаименование 	= СтрКонтрагент.КонтрагентНаименование;
			Если ЗначениеЗаполнено(СтрКонтрагент.КонтрагентНаименованиеСокращенное)
				И НЕ СтрКонтрагент.КонтрагентНаименованиеСокращенное = СтрКонтрагент.КонтрагентНаименование Тогда
				СтруктураоблЗаголовокКонтрагент.КонтрагентНаименование = СтруктураоблЗаголовокКонтрагент.КонтрагентНаименование +
				", " + СтрКонтрагент.КонтрагентНаименованиеСокращенное;
			КонецЕсли;	
			СтруктураоблЗаголовокКонтрагент.КонтрагентИНН 			= СтрКонтрагент.КонтрагентИНН;
			СтруктураоблЗаголовокКонтрагент.КонтрагентКПП 			= СтрКонтрагент.КонтрагентКПП;
			
			облСтрокаКонтрагент.Параметры.Заполнить(СтрКонтрагент);
			облСтрокаКонтрагент.Параметры.Заполнить(СтруктураоблЗаголовокКонтрагент);
			облСтрокаКонтрагент.Параметры.Заполнить(СтруктураКонтактнойИнформацииКонтрагента); 
			
			РеквизитыБанковские = Новый Структура("КонтрагентСчет, КонтрагентБанк, КонтрагентБИК, КонтрагентКорСчет",
			"СчетНомер", "Банк", "БИК", "КоррСчет");  
			ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(СтрКонтрагент.СчетКонтрагента, СтрКонтрагент.СчетКонтрагента, РеквизитыБанковские);
	
			СтруктураРеквизитов = Новый Структура("ТипЛицевогоСчета, Код"); 
    		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрКонтрагент.СчетКонтрагента, СтруктураРеквизитов);
	
			Если СтруктураРеквизитов.ТипЛицевогоСчета = Перечисления.ТипыЛицевыхСчетов.Казначейский Тогда
				РеквизитыБанковские.Вставить("КонтрагентЛС",СтруктураРеквизитов.Код);
			Иначе
				РеквизитыБанковские.Вставить("КонтрагентЛС","");
			КонецЕсли;	
    
			облСтрокаКонтрагент.Параметры.Заполнить(РеквизитыБанковские);			
			
			ТабличныйДокумент.Вывести(облСтрокаКонтрагент);
			
		КонецЦикла;
		
		// Подвал  
		//
		облПодвал = Макет.ПолучитьОбласть("Подвал");
		СтруктураоблПодвал = Новый Структура("ДатаПодписи,ОргДиректор");
		СтруктураоблПодвал.ДатаПодписи = Формат(ДанныеШапки.ДатаДокумента, "ДФ='«дд» ММММ гггг'") + " г.";
		СтруктураоблПодвал.ОргДиректор = ДанныеШапки.ФИОРуководителя;
		облПодвал.Параметры.Заполнить(СтруктураоблПодвал);
		ТабличныйДокумент.Вывести(облПодвал);
				
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
	КонецЦикла;	
	
КонецПроцедуры // ЗаполнитьТабличныйДокументСведенияГК()

Процедура ЗаполнитьТабличныйДокументСведенияГК_18н(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, НомерПриказа)
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеБюджет 						= ДанныеДляПечати.РезультатБюджет.Выгрузить();
	ДанныеВнебюджет 					= ДанныеДляПечати.РезультатВнебюджет.Выгрузить();
	ДанныеКонтракта 					= ДанныеДляПечати.ПредметКонтракта.Выгрузить();
	ДанныеХарактеристикОбязательства 	= ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеПоПериодам 					= ДанныеДляПечати.ПериодыГодами.Выгрузить();
	ДанныеКонтактнойИнформации 			= ДанныеДляПечати.КонтактнаяИнформация.Выгрузить();
	ДанныеКонтрагентов					= ДанныеДляПечати.Контрагенты.Выгрузить();
	
	ПервыйДокумент = Истина;
	Пока ДанныеШапки.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска        = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		ТаблицаБюджет          = ДанныеБюджет.НайтиСтроки(СтруктураПоиска);
		ТаблицаВнебюджет       = ДанныеВнебюджет.НайтиСтроки(СтруктураПоиска);
		ТаблицаКонтракта       = ДанныеКонтракта.НайтиСтроки(СтруктураПоиска);
		ТаблицаПериодов        = ДанныеПоПериодам.НайтиСтроки(СтруктураПоиска);
		СтруктураХарактеристик = ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам.ПФ_MXL_СведенияГКСекретные_" + НомерПриказа);
		
		СформироватьЗаголовокСведенийГК_18н(ДанныеШапки, СтруктураХарактеристик, Макет, ТабличныйДокумент);		
		СформироватьПланФинансированияСведенийГК("Бюджет", ТаблицаБюджет, ТаблицаПериодов, СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьПланФинансированияСведенийГК("Внебюджет", ТаблицаВнебюджет, ТаблицаПериодов, СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРазделПредметКонтракта(ТаблицаКонтракта, Макет, ТабличныйДокумент);
				
		// Контрагенты
		
		облЗаголовокКонтрагент = Макет.ПолучитьОбласть("ЗаголовокКонтрагент");
        ТабличныйДокумент.Вывести(облЗаголовокКонтрагент);

		облСтрокаКонтрагент = Макет.ПолучитьОбласть("СтрокаКонтрагент");
		
		НомерПП = 0;

		Для Каждого СтрКонтрагент Из ДанныеКонтрагентов Цикл
			
			НомерПП = НомерПП + 1;
			
			СтруктураПоиска = Новый Структура("Контрагент", СтрКонтрагент.Контрагент);
			СтруктураКонтактнойИнформацииКонтрагента = ПолучитьСтруктуруКонтактнойИнформации(ДанныеКонтактнойИнформации.НайтиСтроки(СтруктураПоиска));
			
			СтруктураоблЗаголовокКонтрагент = Новый Структура("НомерПП, КонтрагентНаименование, КонтрагентИНН, КонтрагентКПП");
			СтруктураоблЗаголовокКонтрагент.НомерПП					= НомерПП; 
			СтруктураоблЗаголовокКонтрагент.КонтрагентНаименование 	= СтрКонтрагент.КонтрагентНаименование;
			Если ЗначениеЗаполнено(СтрКонтрагент.КонтрагентНаименованиеСокращенное)
				И НЕ СтрКонтрагент.КонтрагентНаименованиеСокращенное = СтрКонтрагент.КонтрагентНаименование Тогда
				СтруктураоблЗаголовокКонтрагент.КонтрагентНаименование = СтруктураоблЗаголовокКонтрагент.КонтрагентНаименование +
				", " + СтрКонтрагент.КонтрагентНаименованиеСокращенное;
			КонецЕсли;	
			СтруктураоблЗаголовокКонтрагент.КонтрагентИНН 			= СтрКонтрагент.КонтрагентИНН;
			СтруктураоблЗаголовокКонтрагент.КонтрагентКПП 			= СтрКонтрагент.КонтрагентКПП;
			
			облСтрокаКонтрагент.Параметры.Заполнить(СтрКонтрагент);
			облСтрокаКонтрагент.Параметры.Заполнить(СтруктураоблЗаголовокКонтрагент);
			облСтрокаКонтрагент.Параметры.Заполнить(СтруктураКонтактнойИнформацииКонтрагента);
			
			ТабличныйДокумент.Вывести(облСтрокаКонтрагент);
			
		КонецЦикла;

		
		// Подвал
		облПодвал = Макет.ПолучитьОбласть("Подвал");
		СтруктураоблПодвал = Новый Структура("ДатаПодписи,ОргДиректор");
		СтруктураоблПодвал.ДатаПодписи = Формат(ДанныеШапки.ДатаДокумента, "ДФ='«дд» ММММ гггг'") + " г.";
		СтруктураоблПодвал.ОргДиректор = ДанныеШапки.ФИОРуководителя;
		облПодвал.Параметры.Заполнить(СтруктураоблПодвал);
		ТабличныйДокумент.Вывести(облПодвал);
		
		Если НомерПриказа = "31н" Тогда
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			облОбратнаяСторона = Макет.ПолучитьОбласть("ОбратнаяСторона");
			ТабличныйДокумент.Вывести(облОбратнаяСторона);
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
	КонецЦикла;	
	
КонецПроцедуры // ЗаполнитьТабличныйДокументСведенияГК()


// Процедура заполняет табличный документ "Информация о ГК" (форма утверждена приказом МФ РФ от 30.12.2013 № 142н)
//
Процедура ЗаполнитьТабличныйДокументИнформацияГК(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеБюджет 						= ДанныеДляПечати.РезультатБюджет.Выгрузить();
	ДанныеВнебюджет 					= ДанныеДляПечати.РезультатВнебюджет.Выгрузить();
	ДанныеКонтракта 					= ДанныеДляПечати.ПредметКонтракта.Выгрузить();
	ДанныеХарактеристикОбязательства 	= ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеПоПериодам 					= ДанныеДляПечати.ПериодыГодами.Выгрузить();
	ДанныеКонтактнойИнформации 			= ДанныеДляПечати.КонтактнаяИнформация.Выгрузить();
	ДанныеКонтрагентов					= ДанныеДляПечати.Контрагенты.Выгрузить();
	ДанныеКонтрагентов.Свернуть("Ссылка, Контрагент, КонтрагентНаименование, КонтрагентИНН, КонтрагентКПП");				
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеШапки.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска 		= Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		ТаблицаБюджет 			= ДанныеБюджет.НайтиСтроки(СтруктураПоиска);
		ТаблицаВнебюджет 		= ДанныеВнебюджет.НайтиСтроки(СтруктураПоиска);
		ТаблицаКонтракта 		= ДанныеКонтракта.НайтиСтроки(СтруктураПоиска);
		ТаблицаПериодов 		= ДанныеПоПериодам.НайтиСтроки(СтруктураПоиска);
		ТаблицаКонтрагентов		= ДанныеКонтрагентов.НайтиСтроки(СтруктураПоиска);
		СтруктураХарактеристик 	= ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
        СтруктураДаты 			= ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);

		ИмяМакета = "ПФ_MXL_СведенияГКСекретные_142н"; 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам." + ИмяМакета);
		
		СформироватьЗаголовокСведенийГК(ДанныеШапки, СтруктураХарактеристик, Макет, ТабличныйДокумент);	
		
		СформироватьПланФинансированияСведенийГК("Бюджет", ТаблицаБюджет, ТаблицаПериодов, СтруктураХарактеристик, Макет, ТабличныйДокумент);
		
		СформироватьПланФинансированияСведенийГК("Внебюджет", ТаблицаВнебюджет, ТаблицаПериодов, СтруктураХарактеристик, Макет, ТабличныйДокумент);
		
		СформироватьРазделПредметКонтракта(ТаблицаКонтракта, Макет, ТабличныйДокумент, Истина);
				
		// Контрагенты
		
		облЗаголовокКонтрагент = Макет.ПолучитьОбласть("ЗаголовокКонтрагент");
        ТабличныйДокумент.Вывести(облЗаголовокКонтрагент);

		облСтрокаКонтрагент = Макет.ПолучитьОбласть("СтрокаКонтрагент");
		
		НомерПП = 0;

		Для Каждого СтрКонтрагент Из ДанныеКонтрагентов Цикл
			
			НомерПП = НомерПП + 1;
			
			СтруктураПоиска = Новый Структура("Контрагент", СтрКонтрагент.Контрагент);
			СтруктураКонтактнойИнформацииКонтрагента = ПолучитьСтруктуруКонтактнойИнформации(ДанныеКонтактнойИнформации.НайтиСтроки(СтруктураПоиска));
			
			СтруктураоблЗаголовокКонтрагент = Новый Структура("НомерПП, КонтрагентНаименование, КонтрагентИНН, КонтрагентКПП");
			СтруктураоблЗаголовокКонтрагент.НомерПП					= НомерПП; 
			СтруктураоблЗаголовокКонтрагент.КонтрагентНаименование 	= СтрКонтрагент.КонтрагентНаименование;
			СтруктураоблЗаголовокКонтрагент.КонтрагентИНН 			= СтрКонтрагент.КонтрагентИНН;
			СтруктураоблЗаголовокКонтрагент.КонтрагентКПП 			= СтрКонтрагент.КонтрагентКПП;
			
			облСтрокаКонтрагент.Параметры.Заполнить(СтруктураоблЗаголовокКонтрагент);
			облСтрокаКонтрагент.Параметры.Заполнить(СтруктураКонтактнойИнформацииКонтрагента);
			
			ТабличныйДокумент.Вывести(облСтрокаКонтрагент);
			
		КонецЦикла;
		
		// Подвал
		облПодвал = Макет.ПолучитьОбласть("Подвал");
		СтруктураоблПодвал = Новый Структура("ДатаПодписи,ОргДиректор");
		СтруктураоблПодвал.ДатаПодписи = Формат(ДанныеШапки.ДатаДокумента, "ДФ='«дд» ММММ гггг'") + " г.";
		СтруктураоблПодвал.ОргДиректор = ДанныеШапки.ФИОРуководителя;
		облПодвал.Параметры.Заполнить(СтруктураоблПодвал);
		облПодвал.Параметры.Заполнить(СтруктураДаты);
		ТабличныйДокумент.Вывести(облПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
		
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры

Процедура СформироватьЗаголовокСведенийГК(ДанныеШапки, СтруктураХарактеристик, Макет, ТабличныйДокумент)
	
	СтруктураОблЗаголовок = Новый Структура("Заголовок, ДатаАукционаСтрока, КодРПБСИмя, СпособРазмещенияЗаказа, СпособРазмещенияЗаказаКод, ДатаАукциона, ДатаДокументаПрописью");
	
	СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);

	
	Если СтруктураХарактеристик.ЭтоСекретныйДокумент Тогда
		ОблЗаголовокСекретный = Макет.ПолучитьОбласть("ГрифСекретности");
		ОблЗаголовокСекретный.Параметры.Заполнить(Новый Структура("ГрифСекретности", СтруктураХарактеристик.ГрифСекретности));
		ТабличныйДокумент.Вывести(ОблЗаголовокСекретный);
		
		ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОблЗаголовок.Параметры.Заполнить(ДанныеШапки);
		СтруктураОблЗаголовок.Заголовок = "Сведения о государственном или муниципальном контракте  
													  |(его изменении), содержащем сведения, составляющие
													  |государственную тайну, заключенном государственным или
													  |муниципальным заказчиком";
		СтруктураОблЗаголовок.ДатаАукционаСтрока = "Дата проведения закрытого аукциона (подведения итогов закрытого конкурса)";
		СтруктураОблЗаголовок.КодРПБСИмя = "Идентифика-" + Символы.ПС + "ционный код";
	Иначе			
		ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОблЗаголовок.Параметры.Заполнить(ДанныеШапки);
		СтруктураОблЗаголовок.Заголовок = "Сведения о государственном или муниципальном контракте  
													  |(его изменении), заключенном государственным или
													  |муниципальным заказчиком";
		СтруктураОблЗаголовок.ДатаАукционаСтрока = "Дата проведения аукциона (подведения итогов конкурса или итогов запроса котировок, или итогов торгов на товарной бирже)";
		СтруктураОблЗаголовок.КодРПБСИмя = "";
	КонецЕсли; 
	
	СтруктураОблЗаголовок.СпособРазмещенияЗаказа 	= СтруктураХарактеристик.СпособРазмещенияЗаказа;
	СтруктураОблЗаголовок.СпособРазмещенияЗаказаКод = СтруктураХарактеристик.СпособРазмещенияЗаказаКод;
	СтруктураОблЗаголовок.ДатаАукциона 				= СтруктураХарактеристик.ДатаАукциона;
	СтруктураОблЗаголовок.ДатаДокументаПрописью 	= Формат(ДанныеШапки.ДатаДокумента, "ДФ='«дд» ММММ гггг'") + " г.";
	
	ОснованиеЗаключенияКонтрактаШапка = "";
	
	Если ЗначениеЗаполнено(ДанныеШапки.ОснованиеИзмененийДата) Тогда
		ОснованиеЗаключенияКонтрактаШапка = Формат(ДанныеШапки.ОснованиеИзмененийДата, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШапки.ОснованиеИзмененийНомер) Тогда
		Если ЗначениеЗаполнено(ОснованиеЗаключенияКонтрактаШапка) Тогда
			ОснованиеЗаключенияКонтрактаШапка =	ОснованиеЗаключенияКонтрактаШапка + ", ";
		КонецЕсли;
		ОснованиеЗаключенияКонтрактаШапка = ОснованиеЗаключенияКонтрактаШапка + "№ " + СокрЛП(ДанныеШапки.ОснованиеИзмененийНомер);
	КонецЕсли;	
		
    Если ЗначениеЗаполнено(ДанныеШапки.ОснованиеИзменений) Тогда
		Если ЗначениеЗаполнено(ОснованиеЗаключенияКонтрактаШапка) Тогда
			ОснованиеЗаключенияКонтрактаШапка =	ОснованиеЗаключенияКонтрактаШапка + ", ";
		КонецЕсли;
		ОснованиеЗаключенияКонтрактаШапка = ОснованиеЗаключенияКонтрактаШапка + СокрЛП(ДанныеШапки.ОснованиеИзменений);
	КонецЕсли;	

	ОснованиеЗаключенияКонтракта = "";
	
	Если ЗначениеЗаполнено(СтруктураХарактеристик.ДатаОснованияЗаключенияКонтракта) Тогда
		ОснованиеЗаключенияКонтракта = Формат(СтруктураХарактеристик.ДатаОснованияЗаключенияКонтракта, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураХарактеристик.НомерОснованияЗаключенияКонтракта) Тогда
		Если ЗначениеЗаполнено(ОснованиеЗаключенияКонтракта) Тогда
			ОснованиеЗаключенияКонтракта =	ОснованиеЗаключенияКонтракта + ", ";
		КонецЕсли;
		ОснованиеЗаключенияКонтракта = ОснованиеЗаключенияКонтракта + "№ " + СокрЛП(СтруктураХарактеристик.НомерОснованияЗаключенияКонтракта);
	КонецЕсли;	
		
    Если ЗначениеЗаполнено(СтруктураХарактеристик.НаименованиеОснованияЗаключенияКонтракта) Тогда
		Если ЗначениеЗаполнено(ОснованиеЗаключенияКонтракта) Тогда
			ОснованиеЗаключенияКонтракта =	ОснованиеЗаключенияКонтракта + ", ";
		КонецЕсли;
		ОснованиеЗаключенияКонтракта = ОснованиеЗаключенияКонтракта + СокрЛП(СтруктураХарактеристик.НаименованиеОснованияЗаключенияКонтракта);
	КонецЕсли;	

	СтруктураОблЗаголовок.Вставить("ОснованиеЗаключенияКонтракта", ?(ЗначениеЗаполнено(ОснованиеЗаключенияКонтрактаШапка), ОснованиеЗаключенияКонтрактаШапка, ОснованиеЗаключенияКонтракта));
		
	СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);

	ОблЗаголовок.Параметры.Заполнить(СтруктураОблЗаголовок);
	ОблЗаголовок.Параметры.Заполнить(СтруктураДаты);

	ТабличныйДокумент.Вывести(ОблЗаголовок);
	
	ОблНомИзв = Макет.ПолучитьОбласть("НомерИзв");
	ОблНомИзв.Параметры.Заполнить(Новый Структура("НомерИзвещения", 			СтруктураХарактеристик.НомерИзвещения)); 
	
	ТабличныйДокумент.Вывести(ОблНомИзв);					
		
	ОблНомРеестр = Макет.ПолучитьОбласть("НомРеестр");
	ОблНомРеестр.Параметры.Заполнить(Новый Структура("НомерРеестровойЗаписи", 	СтруктураХарактеристик.НомерРеестровойЗаписи));
	
	ТабличныйДокумент.Вывести(ОблНомРеестр);
	
КонецПроцедуры


Процедура СформироватьЗаголовокСведенийГК_18н(ДанныеШапки, СтруктураХарактеристик, Макет, ТабличныйДокумент)
	
	
	СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);
	СтруктураДаты.Вставить("ИдентификационныйКодЗаказчика", ДанныеШапки.ПервыйРазрядИКУ + ДанныеШапки.ОрганизацияИНН + ДанныеШапки.ОрганизацияКПП); 
	
	ДокОснования = ДанныеШапки.ДокументыОснования.Выбрать();
	ОснованиеЗаключенияКонтракта = "";
	
	Пока ДокОснования.Следующий() Цикл
		
		ОснованиеЗаключенияКонтракта = ОснованиеЗаключенияКонтракта + ДокОснования.НаименованиеДокОсн + " от " + Формат(ДокОснования.ДатаДокОсн, "ДФ=dd.MM.yyyy") + " № " + ДокОснования.НомерДокОсн + "; ";
		
	КонецЦикла;	
	
	СтруктураХарактеристик.Вставить("ОснованиеЗаключенияКонтракта", ОснованиеЗаключенияКонтракта);
	
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблЗаголовок.Параметры.Заполнить(ДанныеШапки);
	ОблЗаголовок.Параметры.Заполнить(СтруктураХарактеристик);
	ОблЗаголовок.Параметры.Заполнить(СтруктураДаты);

	ТабличныйДокумент.Вывести(ОблЗаголовок);
	
КонецПроцедуры

Процедура СформироватьПланФинансированияСведенийГК(ИмяРаздела, ТаблицаДанных, ТаблицаПериодов, СтруктураХарактеристик, Макет, ТабличныйДокумент)

	КолонкиСуммПериодов 	= "";
	СоответствиеПериодов 	= Новый Соответствие;
	КоличествоПериодов 		= ТаблицаПериодов.Количество(); 
	ИндексПоГрифу 			= 9;
	Если ИндексПоГрифу > КоличествоПериодов - 1 Тогда
		МаксимальныйИндекс = КоличествоПериодов - 1;
	Иначе
		МаксимальныйИндекс = ИндексПоГрифу;
	КонецЕсли; 
	
	// Заголовок раздела
	облЗаголовокРаздел = Макет.ПолучитьОбласть("Заголовок" + ИмяРаздела);
	СтруктураоблЗаголовокРаздел = Новый Структура;
	Для Индекс = 0 По МаксимальныйИндекс Цикл
		СтруктураоблЗаголовокРаздел.Вставить("Год_" + Строка(Индекс + 1), Формат(ТаблицаПериодов[Индекс].Год, "ЧДЦ=0; ЧГ=0"));
		СоответствиеПериодов[ТаблицаПериодов[Индекс].Год] = Строка(Индекс + 1);
	КонецЦикла; 
	Для Индекс = МаксимальныйИндекс + 1 По ИндексПоГрифу Цикл
		СтруктураоблЗаголовокРаздел.Вставить("Год_" + Строка(Индекс + 1), "20__");
	КонецЦикла;
	
	облЗаголовокРаздел.Параметры.Заполнить(СтруктураоблЗаголовокРаздел);
	ТабличныйДокумент.Вывести(облЗаголовокРаздел);
	
	Если ТаблицаДанных.Количество() = 0 Тогда	
		облСтрокаРаздел = Макет.ПолучитьОбласть("Строка" + ИмяРаздела);
		ТабличныйДокумент.Вывести(облСтрокаРаздел);
		облИтогРаздел = Макет.ПолучитьОбласть("Итог" + ИмяРаздела);
		ТабличныйДокумент.Вывести(облИтогРаздел);
		Возврат;
	КонецЕсли; 

	// Строки раздела
	
	ТаблицаРаздела = Новый ТаблицаЗначений;
	ТаблицаРаздела.Колонки.Добавить("Код");
	ТаблицаРаздела.Колонки.Добавить("КодФАИП");
	ТаблицаРаздела.Колонки.Добавить("Примечание");
	
	Для Индекс = 0 ПО МаксимальныйИндекс Цикл
		ИмяКолонки = "СуммаГод_" + Строка(Индекс + 1);
		ТаблицаРаздела.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Число"));
		КолонкиСуммПериодов = КолонкиСуммПериодов + ?(ПустаяСтрока(КолонкиСуммПериодов), "", ", ") + ИмяКолонки;
	КонецЦикла; 	
	
	Для каждого СтрокаДанных Из ТаблицаДанных Цикл
		СтрокаРаздела = ТаблицаРаздела.Добавить();
		СтрокаРаздела.Код = СтрокаДанных.КБК;
		ЗаполнитьЗначенияСвойств(СтрокаРаздела, СтрокаДанных);
		КолонкаГода = "СуммаГод_" + СоответствиеПериодов[СтрокаДанных.Год];
		СтрокаРаздела[КолонкаГода] = СтрокаДанных.Сумма;
	КонецЦикла; 
	
	ТаблицаРаздела.Свернуть("Код, КодФАИП, Примечание", КолонкиСуммПериодов);
	
	облСтрокаРаздел = Макет.ПолучитьОбласть("Строка" + ИмяРаздела);
	Для каждого СтрокаРаздела Из ТаблицаРаздела Цикл
		облСтрокаРаздел.Параметры.Заполнить(СтрокаРаздела);
		ТабличныйДокумент.Вывести(облСтрокаРаздел);
	КонецЦикла; 

	// Итоги раздела
	облИтогРаздел = Макет.ПолучитьОбласть("Итог" + ИмяРаздела);
	ТаблицаРаздела.Колонки.Добавить("_Свертка");
	ТаблицаРаздела.Свернуть("_Свертка", КолонкиСуммПериодов);
	облИтогРаздел.Параметры.Заполнить(ТаблицаРаздела[0]);
	ТабличныйДокумент.Вывести(облИтогРаздел);
	
КонецПроцедуры

Процедура СформироватьРазделПредметКонтракта(ТаблицаКонтракта, Макет, ТабличныйДокумент, УчестьПоЦенеЕдиницы = Ложь)
	
	ОблЗаголовокКонтракт = Макет.ПолучитьОбласть("ЗаголовокПредмет");
	ТабличныйДокумент.Вывести(ОблЗаголовокКонтракт);
	
	облСтрокаКонтракт = Макет.ПолучитьОбласть("СтрокаПредмет");
	НомерПП = 1;
	СуммаКонтрактИтог = 0;
	
	Для каждого СтрокаКонтракта Из ТаблицаКонтракта Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаКонтракта.СтранаИмя) Тогда
			СтрокаКонтракта.СтранаИмя = "Российская Федерация";
			СтрокаКонтракта.СтранаКод = "643";
		КонецЕсли;	 
		облСтрокаКонтракт.Параметры.Заполнить(СтрокаКонтракта);
		облСтрокаКонтракт.Параметры.Заполнить(Новый Структура("НомерПП, Сумма", НомерПП, ?(УчестьПоЦенеЕдиницы И СтрокаКонтракта.Количество = 0, 0, СтрокаКонтракта.Сумма)));
		НомерПП = НомерПП + 1;
		СуммаКонтрактИтог = СуммаКонтрактИтог + СтрокаКонтракта.Сумма;
		ТабличныйДокумент.Вывести(облСтрокаКонтракт);
	КонецЦикла; 
	
	облИтогПредмет = Макет.ПолучитьОбласть("ИтогПредмет");
	облИтогПредмет.Параметры.Заполнить(Новый Структура("Сумма", СуммаКонтрактИтог));
	ТабличныйДокумент.Вывести(облИтогПредмет);
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// Сведения о прекращении госконтракта

// Процедура заполняет табличный документ "Сведения об исполнении/прекращении госконтракта"
//
Процедура ЗаполнитьТабличныйДокументСведенияОПрекращении(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ДанныеШапки = ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеХарактеристикОбязательства = ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеИсполнения = ДанныеДляПечати.Исполнение.Выгрузить();
	
	ПервыйДокумент = Истина;
	Пока ДанныеШапки.Следующий() Цикл
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		СтруктураХарактеристик = ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаИсполнения = ДанныеИсполнения.НайтиСтроки(СтруктураПоиска);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам.ПФ_MXL_СведенияОЗавершенииГК");
		
		СформироватьЗаголовокСведенияОПрекращении(ДанныеШапки, СтруктураХарактеристик, Макет, ТабличныйДокумент);
		СформироватьРазделI_СведенияОПрекращении(ДанныеШапки, ТаблицаИсполнения, Макет, ТабличныйДокумент);
		СформироватьРазделII_СведенияОПрекращении(ДанныеШапки, Макет, ТабличныйДокумент);
		СформироватьПодвалСведенияОПрекращении(ДанныеШапки, СтруктураХарактеристик, Макет, ТабличныйДокумент);
				
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры // ЗаполнитьТабличныйДокументСведенияОПрекращении()

// Процедура заполняет табличный документ "Сведения об исполнении/прекращении госконтракта"
// (приказ казначейства России от 24.11.2014 № 18н)
//
Процедура ЗаполнитьТабличныйДокументСведенияОПрекращении18н(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, НомерПриказа)
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеХарактеристикОбязательства 	= ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеИсполнения 					= ДанныеДляПечати.Исполнение.Выгрузить();
	ДанныеОплаты 						= ДанныеДляПечати.Оплата.Выгрузить();
	Товары                              = ДанныеДляПечати.Товары.Выгрузить();
	Неустойки                           = ДанныеДляПечати.Неустойки.Выгрузить();
	Расторжение                         = ДанныеДляПечати.Расторжение.Выгрузить();
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеШапки.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		
		СтруктураХарактеристик 	= ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаИсполнения 		= ДанныеИсполнения.НайтиСтроки(СтруктураПоиска);
		ТаблицаОплаты 			= ДанныеОплаты.НайтиСтроки(СтруктураПоиска);
		ТаблицаТовары			= Товары.НайтиСтроки(СтруктураПоиска);
		ТаблицаНеустойки		= Неустойки.НайтиСтроки(СтруктураПоиска);
		ТаблицаРасторжение		= Расторжение.НайтиСтроки(СтруктураПоиска);
		
		СтруктураДаты	= ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);
		СтруктураДаты.Вставить("ИдентификационныйКодЗаказчика", ДанныеШапки.ПервыйРазрядИКУ + ДанныеШапки.ЗаказчикИНН + ДанныеШапки.ЗаказчикКПП);  
		
		СтруктураХарактеристик.Вставить("ИсполнительТелефон", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
				ДанныеШапки.ОтвИспФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица));

		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам.ПФ_MXL_СведенияОЗавершенииГК_" + НомерПриказа);
		
		облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		облЗаголовок.Параметры.Заполнить(ДанныеШапки);
		облЗаголовок.Параметры.Заполнить(СтруктураДаты); 
		облЗаголовок.Параметры.Заполнить(СтруктураХарактеристик); 
		ТабличныйДокумент.Вывести(облЗаголовок);
		
		Если ДанныеШапки.ЭтоРасторжение Тогда
			
			Область = Макет.ПолучитьОбласть("Раздел_1_Исп");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Исп");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("Раздел_1_Товар");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Товар");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("Раздел_1_Неустойка");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("ШапкаРаздел_1_Неустойка");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Неустойка");
			ТабличныйДокумент.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("Раздел_2");
			
			Если ТаблицаРасторжение.Количество() > 0 Тогда  
				ДанныеОбласти = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРасторжение[0]);
				ДанныеОбласти.ДокументДатаРасторжения = Формат(ДанныеОбласти.ДокументДатаРасторжения, "ДФ=dd.MM.yyyy");
				Область.Параметры.Заполнить(ДанныеОбласти);
			КонецЕсли;	 
			
			ТабличныйДокумент.Вывести(Область);
			
		Иначе	 
			
			// Исполнение
			
			Область = Макет.ПолучитьОбласть("Раздел_1_Исп");
			ТабличныйДокумент.Вывести(Область);
			
			МаксСтрок = Макс(ТаблицаИсполнения.Количество(), ТаблицаОплаты.Количество());
			
			Для Инд = 0 По МаксСтрок - 1 Цикл
				
				Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Исп");
				
				Если НЕ ТаблицаИсполнения.Количество() < Инд + 1 Тогда
					Область.Параметры.Заполнить(ТаблицаИсполнения[Инд]);
				КонецЕсли;
				
				Если НЕ ТаблицаОплаты.Количество() < Инд + 1 Тогда
					Область.Параметры.Заполнить(ТаблицаОплаты[Инд]);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(Область);
				
			КонецЦикла;	
			
			// Товары
			
			Область = Макет.ПолучитьОбласть("Раздел_1_Товар");
			ТабличныйДокумент.Вывести(Область);
			
			Если ТаблицаТовары.Количество() = 0 Тогда 
				ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("СтрокаРаздел_1_Товар"));
			Иначе
				Для Каждого Стр Из ТаблицаТовары Цикл 
					Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Товар");
					Область.Параметры.Заполнить(Стр);
					Если ЗначениеЗаполнено(Стр.ИзготовительАдрес) И НЕ УправлениеКонтактнойИнформацией.АдресВведенВСвободнойФорме(Стр.ИзготовительАдрес) Тогда
						СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(Стр.ИзготовительАдрес);
						Область.Параметры.Заполнить(Новый Структура("ОКСМИзготовителя", СведенияОбАдресе.КодСтраны));
					КонецЕсли;
					ТабличныйДокумент.Вывести(Область);
				КонецЦикла;
			КонецЕсли;
			
			// Неустойки
			
			Область = Макет.ПолучитьОбласть("Раздел_1_Неустойка");
			ТабличныйДокумент.Вывести(Область);
			
			Если ТаблицаНеустойки.Количество() = 0 Тогда
				ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаРаздел_1_Неустойка"));	
				ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("СтрокаРаздел_1_Неустойка"));
			Иначе
				Для Каждого Стр Из ТаблицаНеустойки Цикл 
					Область = Макет.ПолучитьОбласть("ШапкаРаздел_1_Неустойка");
					Область.Параметры.Заполнить(Стр);
					ТабличныйДокумент.Вывести(Область);
					Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Неустойка");
					Область.Параметры.Заполнить(Стр);
					ТабличныйДокумент.Вывести(Область);
				КонецЦикла;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Раздел_2"));
			
		КонецЕсли; // ДанныеШапки.ЭтоРасторжение
		
		Область = Макет.ПолучитьОбласть("Подвал_1");
		Область.Параметры.Заполнить(ДанныеШапки); 
		Область.Параметры.Заполнить(СтруктураХарактеристик);
		ТабличныйДокумент.Вывести(Область);
		
		Если НомерПриказа = "31н" Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Область = Макет.ПолучитьОбласть("ОбратнаяСторона");
			ТабличныйДокумент.Вывести(Область);
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
		
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры // ЗаполнитьТабличныйДокументСведенияОПрекращении()

// Процедура заполняет табличный документ "Сведения об исполнении/прекращении госконтракта"
// (приказ казначейства России от 25.11.2024 № 17н).
// Форма действует с 01.01.2025
//
Процедура ЗаполнитьТабличныйДокументСведенияОПрекращении17н2025(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеХарактеристикОбязательства 	= ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеИсполнения 					= ДанныеДляПечати.Исполнение.Выгрузить();
	ДанныеОплаты 						= ДанныеДляПечати.Оплата.Выгрузить();
	Товары                              = ДанныеДляПечати.Товары.Выгрузить();
	Неустойки                           = ДанныеДляПечати.Неустойки.Выгрузить();
	Расторжение                         = ДанныеДляПечати.Расторжение.Выгрузить();
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеШапки.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		
		СтруктураХарактеристик 	= ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаИсполнения 		= ДанныеИсполнения.НайтиСтроки(СтруктураПоиска);
		ТаблицаОплаты 			= ДанныеОплаты.НайтиСтроки(СтруктураПоиска);
		ТаблицаТовары			= Товары.НайтиСтроки(СтруктураПоиска);
		ТаблицаНеустойки		= Неустойки.НайтиСтроки(СтруктураПоиска);
		ТаблицаРасторжение		= Расторжение.НайтиСтроки(СтруктураПоиска);
		
		СтруктураДаты	= ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);
		СтруктураДаты.Вставить("ИдентификационныйКодЗаказчика", ДанныеШапки.ПервыйРазрядИКУ + ДанныеШапки.ЗаказчикИНН + ДанныеШапки.ЗаказчикКПП);  
		
		СтруктураХарактеристик.Вставить("ИсполнительТелефон", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
				ДанныеШапки.ОтвИспФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица));

		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам.ПФ_MXL_СведенияОЗавершенииГК_17н2025");
		
		облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		облЗаголовок.Параметры.Заполнить(ДанныеШапки);
		облЗаголовок.Параметры.Заполнить(СтруктураДаты); 
		облЗаголовок.Параметры.Заполнить(СтруктураХарактеристик); 
		ТабличныйДокумент.Вывести(облЗаголовок);
		
		Если ДанныеШапки.ЭтоРасторжение Тогда
			
			Область = Макет.ПолучитьОбласть("Раздел_1_Исп");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Исп");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("Раздел_1_Товар");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Товар");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("Раздел_1_Неустойка");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("ШапкаРаздел_1_Неустойка");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Неустойка");
			ТабличныйДокумент.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("Раздел_2");
			
			Если ТаблицаРасторжение.Количество() > 0 Тогда  
				ДанныеОбласти = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРасторжение[0]);
				ДанныеОбласти.ДокументДатаРасторжения = Формат(ДанныеОбласти.ДокументДатаРасторжения, "ДФ=dd.MM.yyyy");
				Область.Параметры.Заполнить(ДанныеОбласти);
			КонецЕсли;	 
			
			ТабличныйДокумент.Вывести(Область);
			
		Иначе	 
			
			// Исполнение
			
			Область = Макет.ПолучитьОбласть("Раздел_1_Исп");
			ТабличныйДокумент.Вывести(Область);
			
			МаксСтрок = Макс(ТаблицаИсполнения.Количество(), ТаблицаОплаты.Количество());
			
			Для Инд = 0 По МаксСтрок - 1 Цикл
				
				Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Исп");
				
				Если НЕ ТаблицаИсполнения.Количество() < Инд + 1 Тогда
					Область.Параметры.Заполнить(ТаблицаИсполнения[Инд]);
				КонецЕсли;
				
				Если НЕ ТаблицаОплаты.Количество() < Инд + 1 Тогда
					Область.Параметры.Заполнить(ТаблицаОплаты[Инд]);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(Область);
				
			КонецЦикла;	
			
			// Товары
			
			Область = Макет.ПолучитьОбласть("Раздел_1_Товар");
			ТабличныйДокумент.Вывести(Область);
			
			Если ТаблицаТовары.Количество() = 0 Тогда 
				ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("СтрокаРаздел_1_Товар"));
			Иначе
				Для Каждого Стр Из ТаблицаТовары Цикл 
					Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Товар");
					Область.Параметры.Заполнить(Стр);
					Если ЗначениеЗаполнено(Стр.ИзготовительАдрес) И НЕ УправлениеКонтактнойИнформацией.АдресВведенВСвободнойФорме(Стр.ИзготовительАдрес) Тогда
						СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(Стр.ИзготовительАдрес);
						Область.Параметры.Заполнить(Новый Структура("ОКСМИзготовителя", СведенияОбАдресе.КодСтраны));
					КонецЕсли;
					ТабличныйДокумент.Вывести(Область);
				КонецЦикла;
			КонецЕсли;
			
			// Неустойки
			
			Область = Макет.ПолучитьОбласть("Раздел_1_Неустойка");
			ТабличныйДокумент.Вывести(Область);
			
			Если ТаблицаНеустойки.Количество() = 0 Тогда
				ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаРаздел_1_Неустойка"));	
				ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("СтрокаРаздел_1_Неустойка"));
			Иначе
				Для Каждого Стр Из ТаблицаНеустойки Цикл 
					Область = Макет.ПолучитьОбласть("ШапкаРаздел_1_Неустойка");
					Область.Параметры.Заполнить(Стр);
					ТабличныйДокумент.Вывести(Область);
					Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Неустойка");
					Область.Параметры.Заполнить(Стр);
					ТабличныйДокумент.Вывести(Область);
				КонецЦикла;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Раздел_2"));
			
		КонецЕсли; // ДанныеШапки.ЭтоРасторжение
		
		Область = Макет.ПолучитьОбласть("Подвал_1");
		Область.Параметры.Заполнить(ДанныеШапки); 
		Область.Параметры.Заполнить(СтруктураХарактеристик);
		ТабличныйДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
		
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры // ЗаполнитьТабличныйДокументСведенияОПрекращении()

// Процедура заполняет табличный документ "Сведения об исполнении/прекращении госконтракта"
// (приказ казначейства России от 25.11.2024 № 17н, в ред. приказа Казначейства России от 12.01.2026 N 1н).
// Форма действует с 01.03.2025
//
Процедура ЗаполнитьТабличныйДокументСведенияОПрекращении17н2026(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеХарактеристикОбязательства 	= ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеИсполнения 					= ДанныеДляПечати.Исполнение.Выгрузить();
	ДанныеОплаты 						= ДанныеДляПечати.Оплата.Выгрузить();
	Товары                              = ДанныеДляПечати.Товары.Выгрузить();
	Неустойки                           = ДанныеДляПечати.Неустойки.Выгрузить();
	Расторжение                         = ДанныеДляПечати.Расторжение.Выгрузить();
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеШапки.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		
		СтруктураХарактеристик 	= ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаИсполнения 		= ДанныеИсполнения.НайтиСтроки(СтруктураПоиска);
		ТаблицаОплаты 			= ДанныеОплаты.НайтиСтроки(СтруктураПоиска);
		ТаблицаТовары			= Товары.НайтиСтроки(СтруктураПоиска);
		ТаблицаНеустойки		= Неустойки.НайтиСтроки(СтруктураПоиска);
		ТаблицаРасторжение		= Расторжение.НайтиСтроки(СтруктураПоиска);
		
		СтруктураДаты	= ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);
		СтруктураДаты.Вставить("ИдентификационныйКодЗаказчика", ДанныеШапки.ПервыйРазрядИКУ + ДанныеШапки.ЗаказчикИНН + ДанныеШапки.ЗаказчикКПП);  
		СтруктураХарактеристик.Вставить("ИсполнительТелефон", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
				ДанныеШапки.ОтвИспФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица));
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам.ПФ_MXL_СведенияОЗавершенииГК_17н2026");
		
		облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		облЗаголовок.Параметры.Заполнить(ДанныеШапки);
		облЗаголовок.Параметры.Заполнить(СтруктураДаты); 
		облЗаголовок.Параметры.Заполнить(СтруктураХарактеристик); 
		ТабличныйДокумент.Вывести(облЗаголовок);
		
		Если ДанныеШапки.ЭтоРасторжение Тогда
			
			Область = Макет.ПолучитьОбласть("Раздел_1_Исп");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Исп");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("Раздел_1_Товар");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Товар");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("Раздел_1_Неустойка");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("ШапкаРаздел_1_Неустойка");
			ТабличныйДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Неустойка");
			ТабличныйДокумент.Вывести(Область);
			
			Область = Макет.ПолучитьОбласть("Раздел_2");
			Если ТаблицаРасторжение.Количество() > 0 Тогда  
				ДанныеОбласти = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРасторжение[0]);
				ДанныеОбласти.ДокументДатаРасторжения = Формат(ДанныеОбласти.ДокументДатаРасторжения, "ДФ=dd.MM.yyyy");
				Область.Параметры.Заполнить(ДанныеОбласти);
			КонецЕсли;	 
			ТабличныйДокумент.Вывести(Область);
			
		Иначе	 
			
			// Исполнение
			//
			Область = Макет.ПолучитьОбласть("Раздел_1_Исп");
			ТабличныйДокумент.Вывести(Область);
			МаксСтрок = Макс(ТаблицаИсполнения.Количество(), ТаблицаОплаты.Количество());
			Для Инд = 0 По МаксСтрок - 1 Цикл
				Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Исп");
				Если НЕ ТаблицаИсполнения.Количество() < Инд + 1 Тогда
					Область.Параметры.Заполнить(ТаблицаИсполнения[Инд]);
				КонецЕсли;
				Если НЕ ТаблицаОплаты.Количество() < Инд + 1 Тогда
					Область.Параметры.Заполнить(ТаблицаОплаты[Инд]);
				КонецЕсли;
				ТабличныйДокумент.Вывести(Область);
			КонецЦикла;	
			
			// Товары
			//
			Область = Макет.ПолучитьОбласть("Раздел_1_Товар");
			ТабличныйДокумент.Вывести(Область);
			Если ТаблицаТовары.Количество() = 0 Тогда 
				ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("СтрокаРаздел_1_Товар"));
			Иначе
				Для Каждого Стр Из ТаблицаТовары Цикл 
					Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Товар");
					Область.Параметры.Заполнить(Стр);
					Если ЗначениеЗаполнено(Стр.ИзготовительАдрес) И НЕ УправлениеКонтактнойИнформацией.АдресВведенВСвободнойФорме(Стр.ИзготовительАдрес) Тогда
						СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(Стр.ИзготовительАдрес);
						Область.Параметры.Заполнить(Новый Структура("ОКСМИзготовителя", СведенияОбАдресе.КодСтраны));
					КонецЕсли;
					ТабличныйДокумент.Вывести(Область);
				КонецЦикла;
			КонецЕсли;
			
			// Неустойки 
			//
			Область = Макет.ПолучитьОбласть("Раздел_1_Неустойка");
			ТабличныйДокумент.Вывести(Область);
			
			Если ТаблицаНеустойки.Количество() = 0 Тогда
				ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаРаздел_1_Неустойка"));	
				ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("СтрокаРаздел_1_Неустойка"));
			Иначе
				Для Каждого Стр Из ТаблицаНеустойки Цикл 
					Область = Макет.ПолучитьОбласть("ШапкаРаздел_1_Неустойка");
					Область.Параметры.Заполнить(Стр);
					ТабличныйДокумент.Вывести(Область);
					Область = Макет.ПолучитьОбласть("СтрокаРаздел_1_Неустойка");
					Область.Параметры.Заполнить(Стр);
					ТабличныйДокумент.Вывести(Область);
				КонецЦикла;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Раздел_2"));
			
		КонецЕсли; // ДанныеШапки.ЭтоРасторжение
		
		Область = Макет.ПолучитьОбласть("Подвал_1");
		Область.Параметры.Заполнить(ДанныеШапки); 
		Область.Параметры.Заполнить(СтруктураХарактеристик);
		ТабличныйДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
		
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры // ЗаполнитьТабличныйДокументСведенияОПрекращении()



// Процедура заполняет табличный документ "Информация об исполнении (о расторжении) контракта"
//
Процедура ЗаполнитьТабличныйДокументИнформацияОПрекращении(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеХарактеристикОбязательства 	= ДанныеДляПечати.ХарактеристикиОбязательства.Выгрузить();
	ДанныеИсполнения 					= ДанныеДляПечати.Исполнение.Выгрузить();
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеШапки.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		СтруктураХарактеристик = ПолучитьСтруктуруХарактеристикОбязательства(ДанныеХарактеристикОбязательства.НайтиСтроки(СтруктураПоиска));
		ТаблицаИсполнения = ДанныеИсполнения.НайтиСтроки(СтруктураПоиска);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам.ПФ_MXL_СведенияОЗавершенииГК_142н");
		
		СтруктураДаты	= ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);

		облЗаголовокСекретный = Макет.ПолучитьОбласть("ГрифСекретности");
		облЗаголовокСекретный.Параметры.Заполнить(СтруктураХарактеристик);
		ТабличныйДокумент.Вывести(облЗаголовокСекретный);
		
		облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		облЗаголовок.Параметры.Заполнить(ДанныеШапки);
        облЗаголовок.Параметры.Заполнить(СтруктураДаты);
		облЗаголовок.Параметры.Заполнить(СтруктураХарактеристик);
        ТабличныйДокумент.Вывести(облЗаголовок);	
		
		СформироватьРазделI_СведенияОПрекращении(ДанныеШапки, ТаблицаИсполнения, Макет, ТабличныйДокумент);
		
		СформироватьРазделII_СведенияОПрекращении(ДанныеШапки, Макет, ТабличныйДокумент);
		
		облПодвал = Макет.ПолучитьОбласть("Подвал_1");
		облПодвал.Параметры.Заполнить(ДанныеШапки);
        облПодвал.Параметры.Заполнить(СтруктураДаты);
        ТабличныйДокумент.Вывести(облПодвал);	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
		
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры // ЗаполнитьТабличныйДокументСведенияОПрекращении()

Процедура СформироватьЗаголовокСведенияОПрекращении(ДанныеШапки, СтруктураХарактеристик, Макет, ТабличныйДокумент)
	СтруктураоблЗаголовок = Новый Структура("КодРПБСИмя,Заголовок,ДатаДокументаПрописью,НомерРеестровойЗаписи");
	Если СтруктураХарактеристик.ЭтоСекретныйДокумент Тогда
		
		облЗаголовокСекретный = Макет.ПолучитьОбласть("ГрифСекретности");
		облЗаголовокСекретный.Параметры.Заполнить(СтруктураХарактеристик);
		ТабличныйДокумент.Вывести(облЗаголовокСекретный);
		
		облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		облЗаголовок.Параметры.Заполнить(ДанныеШапки);
		СтруктураоблЗаголовок.КодРПБСИмя = "Идентифика-" + Символы.ПС + "ционный код";
		СтруктураоблЗаголовок.Заголовок = "Сведения об исполнении (о расторжении)
													  |государственного или муниципального контракта, содержащего
													  |сведения, составляющие государственную тайну";
		СтруктураоблЗаголовок.ДатаДокументаПрописью = Формат(ДанныеШапки.ДатаДокумента, "ДФ='«дд» ММММ гггг'") + " г.";
		облЗаголовок.Параметры.Заполнить(ДанныеШапки);
		СтруктураоблЗаголовок.НомерРеестровойЗаписи = СтруктураХарактеристик.НомерРеестровойЗаписи;
		
	Иначе
		
		облЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		СтруктураоблЗаголовок.КодРПБСИмя = "";
		СтруктураоблЗаголовок.Заголовок = "Сведения об исполнении (о расторжении)
													  |государственного или муниципального контракта
													  |либо гражданско-правового договора бюджетного
													  |учреждения на поставки товаров, выполнение работ,
													  |оказание услуг, заключенного по итогам
													  |размещения заказа";
		СтруктураоблЗаголовок.ДатаДокументаПрописью = Формат(ДанныеШапки.ДатаДокумента, "ДФ='«дд» ММММ гггг'") + " г.";
		облЗаголовок.Параметры.Заполнить(ДанныеШапки);
		СтруктураоблЗаголовок.НомерРеестровойЗаписи = СтруктураХарактеристик.НомерРеестровойЗаписи;
		
	КонецЕсли;
	облЗаголовок.Параметры.Заполнить(СтруктураоблЗаголовок);
	ТабличныйДокумент.Вывести(облЗаголовок);	
КонецПроцедуры

Процедура СформироватьРазделI_СведенияОПрекращении(ДанныеШапки, ТаблицаИсполнения, Макет, ТабличныйДокумент)
	
	Если ДанныеШапки.ЭтоРасторжение Тогда
		
		облРаздел1 = Макет.ПолучитьОбласть("Раздел_1");
		ТабличныйДокумент.Вывести(облРаздел1);

	Иначе
		облРаздел1 = Макет.ПолучитьОбласть("Раздел_1");
		ТабличныйДокумент.Вывести(облРаздел1);
		
		облСтрокаРаздел1 = Макет.ПолучитьОбласть("СтрокаРаздел_1");
		
		Для каждого СтрокаИсполнения Из ТаблицаИсполнения Цикл
			ТекстОснования = Строка(СтрокаИсполнения.Сумма) + " руб., " + СтрокаИсполнения.ВидПервичногоДокумента;
			Если НЕ ПустаяСтрока(СтрокаИсполнения.НомерПервичногоДокумента) Тогда
				ТекстОснования = ТекстОснования + "№" + СтрокаИсполнения.НомерПервичногоДокумента;				
			КонецЕсли;
			СтруктураоблСтрокаРаздел1 = Новый Структура("Основание,Дата",ТекстОснования,СтрокаИсполнения.ДатаПервичногоДокумента);
			облСтрокаРаздел1.Параметры.Заполнить(СтруктураоблСтрокаРаздел1);
			ТабличныйДокумент.Вывести(облСтрокаРаздел1);
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура СформироватьРазделII_СведенияОПрекращении(ДанныеШапки, Макет, ТабличныйДокумент)
	
	Если ДанныеШапки.ЭтоРасторжение Тогда
		ОснованиеПричинаРасторжения = ДанныеШапки.ОснованиеРасторжения;
		Если НЕ ПустаяСтрока(ДанныеШапки.НомерРасторжения) Тогда
			ОснованиеПричинаРасторжения = ОснованиеПричинаРасторжения + " №" + ДанныеШапки.НомерРасторжения;
		КонецЕсли; 
		Если НЕ ПустаяСтрока(ДанныеШапки.ПричинаРасторжения) Тогда
			Если НЕ ПустаяСтрока(ОснованиеПричинаРасторжения) Тогда
				ОснованиеПричинаРасторжения = ОснованиеПричинаРасторжения + "; ";				
			КонецЕсли; 			
			ОснованиеПричинаРасторжения = ОснованиеПричинаРасторжения + ДанныеШапки.ПричинаРасторжения;
		КонецЕсли; 
		
		облРаздел2 = Макет.ПолучитьОбласть("Раздел_2");
		облРаздел2.Параметры.Заполнить(ДанныеШапки);
		
		облРаздел2.Параметры.ОснованиеПричинаРасторжения = ОснованиеПричинаРасторжения;
		ТабличныйДокумент.Вывести(облРаздел2);
	Иначе
		облРаздел2 = Макет.ПолучитьОбласть("Раздел_2");
		ТабличныйДокумент.Вывести(облРаздел2);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПодвалСведенияОПрекращении(ДанныеШапки, СтруктураХарактеристик, Макет, ТабличныйДокумент)
	
	облПодвал = Макет.ПолучитьОбласть("Подвал_1");
	облПодвал.Параметры.Заполнить(ДанныеШапки);
	СтруктураОблПодвал = Новый Структура("ДатаПодписи,СтрокаРуководитель,Отметка");
	СтруктураОблПодвал.ДатаПодписи = Формат(ДанныеШапки.ДатаДокумента, "ДФ='«дд» ММММ гггг'") + " г.";
	Если СтруктураХарактеристик.ЭтоСекретныйДокумент Тогда
		СтруктураОблПодвал.СтрокаРуководитель = "Руководитель
															  |(иное уполномоченное
															  |лицо)";
		СтруктураОблПодвал.Отметка = "Отметки уполномоченного на ведение реестра контрактов органа о принятии сведений";
	Иначе
		СтруктураОблПодвал.СтрокаРуководитель = "Руководитель
															  |или иное уполномоченное
															  |лицо";
		СтруктураОблПодвал.Отметка = "Отметки органа, уполномоченного на ведение реестра контрактов, о принятии сведений"; 
	КонецЕсли;
	облПодвал.Параметры.Заполнить(СтруктураОблПодвал);
	ТабличныйДокумент.Вывести(облПодвал);
	
	Если НЕ СтруктураХарактеристик.ЭтоСекретныйДокумент Тогда
		облПодвал = Макет.ПолучитьОбласть("Подвал_2");
		ТабличныйДокумент.Вывести(облПодвал);	
	КонецЕсли; 
	
	облПодвал = Макет.ПолучитьОбласть("Подвал_3");
	ТабличныйДокумент.Вывести(облПодвал);	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Формы в редакции приказа 221н

// Процедура заполняет табличный документ "Форма 0506101 (Сведения о бюджетном обязательстве)"
//
Процедура ЗаполнитьТабличныйДокументФорма0506101(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ИмяМакета = "ПФ_MXL_Форма0506101")
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьСведенийПоДоговорамИОбязательствам." + ИмяМакета);
	
	ДанныеШапки 						= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ДанныеКонтрагентов 					= ДанныеДляПечати.Контрагенты.Выгрузить();
	ДанныеРасшифровкиОбязательства 		= ДанныеДляПечати.РасшифровкаОбязательства.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	ПервыйДокумент = Истина;
	
	Пока ДанныеШапки.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		СтруктураПоиска = Новый Структура("Ссылка", ДанныеШапки.Ссылка);
		ТаблицаРасшифровкиОбязательства = ДанныеРасшифровкиОбязательства.Строки.НайтиСтроки(СтруктураПоиска);
		ТаблицаКонтрагентов = ДанныеКонтрагентов.НайтиСтроки(СтруктураПоиска);

		СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(ДанныеШапки.ДатаДокумента);
		СтруктураДаты.Вставить("ТекГод", "20" + СтруктураДаты.Год);
		 
		
		// Шапка документа и раздел 1
		ОблЗаголовок = Макет.ПолучитьОбласть("ОсновныеРеквизиты");
	    ОблЗаголовок.Параметры.Заполнить(СтруктураДаты);
	
		СтруктураОблЗаголовок = Новый Структура("НомерДокумента");
		СтруктураОблЗаголовок.НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДанныеШапки.Ссылка, ДанныеШапки.НомерДокумента);
	
		ОблЗаголовок.Параметры.Заполнить(ДанныеШапки);
    	ОблЗаголовок.Параметры.Заполнить(СтруктураОблЗаголовок);

		ТабличныйДокумент.Вывести(облЗаголовок);

		// Раздел 2 контрагенты
		
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Шапка_Р2"));
	
		Для Каждого СтрКонтр Из ТаблицаКонтрагентов Цикл
			
			СтрокаРаздела2 = Макет.ПолучитьОбласть("Стр_Р2");
			
			РеквизитыКонтрагентаПоСчету = Новый Структура("КонтрагентБанковскийСчет, КонтрагентНаименованиеБанка, КонтрагентБИКБанка, КонтрагентКорСчетБанка, ГородБанка", "СчетНомер", "Банк", "БИК", "КоррСчет", "Город");
			ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(СтрКонтр.СчетКонтрагента, СтрКонтр.СчетКонтрагента, РеквизитыКонтрагентаПоСчету, , Ложь);	
			
			РеквизитыКонтрагентаПоСчету.Вставить("КонтрагентНаименованиеИГородБанка", РеквизитыКонтрагентаПоСчету.КонтрагентНаименованиеБанка + " " + РеквизитыКонтрагентаПоСчету.ГородБанка);
			
			СтрокаРаздела2.Параметры.Заполнить(СтрКонтр);
			СтрокаРаздела2.Параметры.Заполнить(РеквизитыКонтрагентаПоСчету);
			
			ТабличныйДокумент.Вывести(СтрокаРаздела2);
			
		КонецЦикла;
	
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Разделитель"));

		СформироватьРаздел5Форм0531702_0531705_0531706_151н(ТаблицаРасшифровкиОбязательства, ДанныеШапки, СтруктураДаты, Макет, ТабличныйДокумент);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеШапки.Ссылка);
		
	КонецЦикла;	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры 

#КонецОбласти

#КонецОбласти

#КонецЕсли