#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МожноЗагружатьИзНастроек = Истина;
	
	РежимРаботы = "ПоПлатежам";
	
	ОбрабатываемыеСтатусы.Добавить(Перечисления.СтатусыИсполненияДокумента.ВРаботе,,Ложь);
	ОбрабатываемыеСтатусы.Добавить(Перечисления.СтатусыИсполненияДокумента.Подготовлен,,Ложь);
	ОбрабатываемыеСтатусы.Добавить(Перечисления.СтатусыИсполненияДокумента.ОжидаетОтправки,,Ложь);
	ОбрабатываемыеСтатусы.Добавить(Перечисления.СтатусыИсполненияДокумента.ПереданВОбработку,,Ложь);
	ОбрабатываемыеСтатусы.Добавить(Перечисления.СтатусыИсполненияДокумента.НаИсполнении,,Ложь);
	ОбрабатываемыеСтатусы.Добавить(Перечисления.СтатусыИсполненияДокумента.Исполнен,,Ложь);
	ОбрабатываемыеСтатусы.Добавить(Перечисления.СтатусыИсполненияДокумента.Аннулирован,,Ложь);
		
	МинимальныйУровеньСовпадения = 30;
	ОтображатьПанельОтборов = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПлатежиБезНачислений,"Участник",Неопределено,Истина);	 
	
	ОтборПлатежей = "Не распределен";
	ПриИзмененииОтбораПлатежейУстановитьОформление();
	
	ТекСохраненныеНастройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("РаспределениеПлатежейГИСГМП","ЗначенияРеквизитов",Неопределено);
	
	
	
	Если ТипЗнч(ТекСохраненныеНастройки) = Тип("Структура") Тогда
		ТекСохраненныеНастройки.Свойство("МинимальныйУровеньСовпадения",МинимальныйУровеньСовпадения);
		Если ТекСохраненныеНастройки.Свойство("ОбрабатываемыеСтатусыМассив")
			И ТипЗнч(ТекСохраненныеНастройки.ОбрабатываемыеСтатусыМассив) = Тип("Массив") Тогда
			
			КоличествоОтмеченных = 0;
			Для Каждого ЭлМас Из ТекСохраненныеНастройки.ОбрабатываемыеСтатусыМассив Цикл
				СтрЗнач = ОбрабатываемыеСтатусы.НайтиПоЗначению(ЭлМас);
				Если СтрЗнач <> Неопределено Тогда
					СтрЗнач.Пометка = Истина;
					КоличествоОтмеченных = КоличествоОтмеченных + 1;
				КонецЕсли;	
					
			КонецЦикла;
			Если КоличествоОтмеченных>0 Тогда
				ТекСохраненныеНастройки.Свойство("ОбрабатываемыеСтатусыУсловие",ОбрабатываемыеСтатусыУсловие);
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.Участник) Тогда
		
		МожноЗагружатьИзНастроек = Ложь;
		
		СоответствиеУчастников = ГосУслуги.ПолучитьСоответствиеУчастников(Параметры.Участник);
		УчастникПрямогоВзаимодействия = СоответствиеУчастников[Параметры.Участник];
		
		ЗаполнитьТаблицуУчастников();
		ТекущийУчастник = Параметры.Участник;
		
		ЗаполнитьИнформациюОПлатежахУчастников(Ложь);
		
		МассивНайденных = ТаблицаУчастников.НайтиСтроки(Новый Структура("Участник",ТекущийУчастник));
		Если МассивНайденных.Количество() Тогда
			ИнформацияОПлатежах = МассивНайденных[0].Пояснение;
		КонецЕсли;
		
		ТекущееНачисление = Параметры.Начисление;
		ТекущийПлатеж = Параметры.Платеж;
		
		Если ЗначениеЗаполнено(Параметры.Начисление) Тогда
			РежимРаботы = "ПоНачислениям";
			ОбрабатываемыеСтатусыУсловие = Ложь;
		КонецЕсли;
		ПриИзмененииРежимаРаботыУстановитьОформление();
		ПриИзмененииТекущегоУчастника();
		
		Если ЗначениеЗаполнено(ТекущееНачисление) Тогда
			
			РассчитатьДляТекущегоНачисления();


		ИначеЕсли ЗначениеЗаполнено(ТекущийПлатеж) Тогда
			
			РассчитатьДляТекущегоПлатежа();
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ТекСохраненныеНастройки) = Тип("Структура") Тогда
		
		ТекСохраненныеНастройки.Свойство("УчастникПрямогоВзаимодействия",УчастникПрямогоВзаимодействия);
		УчастникПрямогоВзаимодействияПриИзмененииНаСервере();
		ПриИзмененииРежимаРаботыУстановитьОформление();
		
	Иначе
		ПриИзмененииРежимаРаботыУстановитьОформление();
	КонецЕсли;
			
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РаспределенныеПлатежи,"Начисление",Неопределено,Истина);	 
	
	ОтборПлатежейБезНачисления = "Не распределен";
	ПриИзмененииОтборПлатежейБезНачисленияУстановитьОформлениеИОтбор();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	МассивСтатусов = Новый Массив;
	Для Каждого ТекСтатус Из ОбрабатываемыеСтатусы Цикл
		Если ТекСтатус.Пометка Тогда
			МассивСтатусов.Добавить(ТекСтатус.Значение);
		КонецЕсли;
	КонецЦикла;
	
	СохранитьНастройкиОбработки(МинимальныйУровеньСовпадения,ОбрабатываемыеСтатусыУсловие,УчастникПрямогоВзаимодействия,МассивСтатусов);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкиОбработки(МинимальныйУровеньСовпадения,ОбрабатываемыеСтатусыУсловие,УчастникПрямогоВзаимодействия,МассивСтатусов)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("МинимальныйУровеньСовпадения",МинимальныйУровеньСовпадения);
	СтруктураНастроек.Вставить("ОбрабатываемыеСтатусыМассив",МассивСтатусов);
	СтруктураНастроек.Вставить("ОбрабатываемыеСтатусыУсловие",ОбрабатываемыеСтатусыУсловие);
	СтруктураНастроек.Вставить("УчастникПрямогоВзаимодействия",УчастникПрямогоВзаимодействия);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("РаспределениеПлатежейГИСГМП","ЗначенияРеквизитов",СтруктураНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УчастникПрямогоВзаимодействияПриИзменении(Элемент)
	УчастникПрямогоВзаимодействияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураОтборУсловие = ЗначениеЗаполнено(НоменклатураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодОтборУсловие = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыВариантовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.ГруппаПоПлатежам Тогда
		РежимРаботы = "ПоПлатежам";
	Иначе
		РежимРаботы = "ПоНачислениям";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПлатежиНажатие(Элемент)
	РежимРаботы = "ПоПлатежам";
	ПриИзмененииРежимаРаботы();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНачисленияНажатие(Элемент)
	РежимРаботы = "ПоНачислениям";
	ПриИзмененииРежимаРаботы();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБезНачисленияНажатие(Элемент)
	РежимРаботы = "БезНачисления";
	ПриИзмененииРежимаРаботы();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПраваяПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПоказатьРаспределенныеПлатежи(ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура МинимальныйПроцентПриИзменении(Элемент)
	
	ПриИзмененииМинимальногоПроцента();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииМинимальногоПроцента()
		
	Если РежимРаботы = "ПоПлатежам" Тогда
		Если ЭтоАдресВременногоХранилища(АдресТаблицыНачислений) = Ложь Тогда
			Возврат;
		КонецЕсли;
		ТабНачислений = ПолучитьИзВременногоХранилища(АдресТаблицыНачислений);
		МассивДокументов = Новый Массив;
		Для Каждого СтрТЧ Из ТабНачислений Цикл
			Если СтрТЧ.ТекущийПроцентСовпадения>=МинимальныйУровеньСовпадения Тогда
				МассивДокументов.Добавить(СтрТЧ.Квитанция);
			КонецЕсли;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДССписокКвитанций,"Квитанция",МассивДокументов,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		
	Иначе
		Если ЭтоАдресВременногоХранилища(АдресТаблицыПлатежей) = Ложь Тогда
			Возврат;
		КонецЕсли;
		ТабПлатежи = ПолучитьИзВременногоХранилища(АдресТаблицыПлатежей);
		
		МассивДокументов = Новый Массив;
		Для Каждого СтрТЧ Из ТабПлатежи Цикл
			Если СтрТЧ.ТекущийПроцентСовпадения>=МинимальныйУровеньСовпадения Тогда
				МассивДокументов.Добавить(СтрТЧ.ПлатежСсылка);
			КонецЕсли;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСТаблицаПлатежи,"ПлатежСсылка",МассивДокументов,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБПНеРаспределенНажатие(Элемент)
	ОтборПлатежейБезНачисления = "Не распределен";
	ПриИзмененииОтборПлатежейБезНачисленияУстановитьОформлениеИОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБПБезНачисленияНажатие(Элемент)
	ОтборПлатежейБезНачисления = "Без начисления";
	ПриИзмененииОтборПлатежейБезНачисленияУстановитьОформлениеИОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияБПВсеНажатие(Элемент)
	ОтборПлатежейБезНачисления = "";
	ПриИзмененииОтборПлатежейБезНачисленияУстановитьОформлениеИОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОснНеРаспределенНажатие(Элемент)
	Если ОтборПлатежей = "Не распределен" Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПлатежей = "Не распределен";
	
	ПриИзмененииОтбораПлатежейНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОснБезНачисленияНажатие(Элемент)
	Если ОтборПлатежей = "Без начисления" Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПлатежей = "Без начисления";
	
	ПриИзмененииОтбораПлатежейНаСервере();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаУчастников

&НаКлиенте
Процедура ТаблицаУчастниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ТаблицаУчастников.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияОПлатежах = ТекДанные.Пояснение;
	ТекущийУчастник = ТекДанные.Участник;	
	
	ПриВыбореУчастника();

КонецПроцедуры

&НаСервере
Процедура ПриВыбореУчастника()
	
	ОчиститьНастройкиДС(Истина);
	ПриИзмененииТекущегоУчастника();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаУчастников1

&НаКлиенте
Процедура ТаблицаУчастников1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ТаблицаУчастников1.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияОПлатежах = ТекДанные.Пояснение;
	ТекущийУчастник = ТекДанные.Участник;	
	
	ПриВыбореУчастника();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокКвитанцийОсн

&НаКлиенте
Процедура ДССписокКвитанцийОснВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ДССписокКвитанцийОсн.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущееНачисление = ТекДанные.Квитанция Тогда
		Возврат;
	КонецЕсли;
			
	РассчитатьПодходящиеПлатежиДляНачисленияДС(ТекДанные);
	
	ПоказатьРаспределенныеПлатежи();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРаспределенныеПлатежи(Знач ТекущаяСтраница = Неопределено)
	
	Если ТекущаяСтраница = Неопределено Тогда
		ТекСтраница = Элементы.ГруппаСтраницыПравая.ТекущаяСтраница;		
	Иначе 
		ТекСтраница = ТекущаяСтраница;
	КонецЕсли;
	
	Если ТекСтраница <> Элементы.ГруппаРаспределенныеПлатежи Тогда
		Возврат;
	КонецЕсли;
		
	ТекНачисление = Неопределено;
	Если РежимРаботы = "ПоНачислениям" Тогда
		ТекНачисление = ТекущееНачисление;		
	Иначе
		ТекДанные = Элементы.ДССписокКвитанцийДоп.ТекущиеДанные;
		Если ТекДанные <> Неопределено Тогда
			ТекНачисление = ТекДанные.Квитанция;
		КонецЕсли;
	КонецЕсли;
	
	НачислениеДляОтбора = ТекНачисление;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(РаспределенныеПлатежи,"Начисление",НачислениеДляОтбора,Истина);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДССписокКвитанцийПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Начисления = Строки.ПолучитьКлючи();
	
	Если Начисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ТабНачислния = Неопределено;
	ЗаполнятьПроцент = Ложь;
	ПерваяСтрока = Истина;
	
	Для Каждого СтрТЧ Из Строки Цикл
		
		ТекДанные = СтрТЧ.Значение.Данные;
		
		Если ПерваяСтрока Тогда	
			Если ЭтоАдресВременногоХранилища(ТекДанные.АдресТаблицыНачислений) Тогда
				ТабНачислния = ПолучитьИзВременногоХранилища(ТекДанные.АдресТаблицыНачислений);
				ЗаполнятьПроцент = Истина;
			КонецЕсли;
			ПерваяСтрока = Ложь;
		КонецЕсли;
			
		Если ЗаполнятьПроцент Тогда
			СтрокаТаблицы = ТабНачислния.Найти(ТекДанные.Квитанция,"Квитанция");
			Если СтрокаТаблицы <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТекДанные,СтрокаТаблицы); 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаПлатежиДоп


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДСТаблицаПлатежиОсн

&НаСервереБезКонтекста
Процедура ДСТаблицаПлатежиПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	//Если СтрТЧ.КБК = "0" Тогда
	//	СтрТЧ.КБК = "";
	//КонецЕсли;
	//Если СтрТЧ.ОКТМО = "0" Тогда
	//	СтрТЧ.ОКТМО = "";
	//КонецЕсли;
	//Если СтрТЧ.ИдентификаторПлательщика = "0" Тогда
	//	СтрТЧ.ИдентификаторПлательщика = "";
	//КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(СтрТЧ.УИН)
	//	ИЛИ СтрТЧ.УИН = "0" Тогда
	//	СтрТЧ.Вид = "Авансовый";
	//КонецЕсли;
	
	КЭШДанных = Новый Соответствие;
	
	ТабПлатежи = Неопределено;
	ЗаполнятьПроцент = Ложь;
	ПерваяСтрока = Истина;
	
	Для Каждого СтрТЧ Из Строки Цикл
		
		ТекДанные = СтрТЧ.Значение.Данные;
		ДлинаИдентификатора = СтрДлина(ТекДанные.ИдентификаторПлательщика);
		
		Если ПерваяСтрока Тогда	
			Если ЭтоАдресВременногоХранилища(ТекДанные.АдресТаблицыПлатежей) Тогда
				ТабПлатежи = ПолучитьИзВременногоХранилища(ТекДанные.АдресТаблицыПлатежей);
				ЗаполнятьПроцент = Истина;
			КонецЕсли;
			ПерваяСтрока = Ложь;
		КонецЕсли;
	
		ИдентификаторДляРасчета = "";
		
		Если ДлинаИдентификатора = 22 Тогда
			
			ИдентификаторДляРасчета = ТекДанные.ИдентификаторПлательщика;
			
		ИначеЕсли ДлинаИдентификатора = 20
			ИЛИ ДлинаИдентификатора = 15
			ИЛИ ДлинаИдентификатора = 13 Тогда
			//юр.лицо, ИП  по форматам 1.6
			ИдентификаторДляРасчета = Лев(ТекДанные.ИдентификаторПлательщика,1) + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Сред(ТекДанные.ИдентификаторПлательщика,2),"21","0");
			
		ИначеЕсли ДлинаИдентификатора = 25 Тогда
			//физ.лицо по форматам 1.6
			ИдентификаторДляРасчета = "1" + Сред(ТекДанные.ИдентификаторПлательщика,1,2) + Сред(ТекДанные.ИдентификаторПлательщика,4,19);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИдентификаторДляРасчета) Тогда
			ДанныеВКэше = КЭШДанных[ИдентификаторДляРасчета];
			Если ДанныеВКэше = Неопределено Тогда
				ДанныеВКэше = ПолучитьДанныеПлательщикаПоИдентификатору(ИдентификаторДляРасчета);
				КЭШДанных.Вставить(ИдентификаторДляРасчета,ДанныеВКэше);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ТекДанные, ДанныеВКэше);
		КонецЕсли;
		
		Если ЗаполнятьПроцент Тогда
			СтрокаПлатежа = ТабПлатежи.Найти(ТекДанные.ПлатежСсылка,"ПлатежСсылка");
			Если СтрокаПлатежа <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТекДанные,СтрокаПлатежа);
				//ТекДанные.ТекущийПроцентСовпадения = СтрокаПлатежа.ТекущийПроцентСовпадения;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДСТаблицаПлатежиОснВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ДСТаблицаПлатежиОсн.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийПлатеж = ТекДанные.ПлатежСсылка Тогда
		Возврат;
	КонецЕсли;
			
	РассчитатьПодходящиеНачисленияДляПлатежаДС(ТекДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДССписокКвитанцийДоп

&НаКлиенте
Процедура ДССписокКвитанцийДопПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПриАктивизацииНачисленияДоп",0.3,Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиПодходящие(Команда)	
	ТекДанные = Элементы.ДССписокКвитанцийОсн.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьПодходящиеПлатежиДляНачисленияДС(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура НайтиНачисления(Команда)
	
	ТекДанные = Элементы.ДСТаблицаПлатежиОсн.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьПодходящиеНачисленияДляПлатежаДС(ТекДанные);
		
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПодходящие(Команда)
	РассчитатьПодходящиеНачисленияИПлатежи();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	Если РежимРаботы = "БезНачисления" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьНачисления();
	ЗаполнитьПлатежи();
	
	Если Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаПоНачислениям Тогда
		
		РассчитатьДляТекущегоНачисления();
		
	ИначеЕсли Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаПоПлатежам Тогда
		
		РассчитатьДляТекущегоПлатежа();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	Если РежимРаботы = "ПоНачислениям" Тогда
		Элементы.ДССписокКвитанцийОсн.Обновить();
		Элементы.ДСТаблицаПлатежиДоп.Обновить();
	ИначеЕсли РежимРаботы = "ПоПлатежам" Тогда
		Элементы.ДССписокКвитанцийДоп.Обновить();
		Элементы.ДСТаблицаПлатежиОсн.Обновить();
	КонецЕсли;
	ОбновитьОтборыДСКвитанций();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПлатежОсн(Команда)
	ТекДанные = Элементы.ДСТаблицаПлатежиОсн.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ТекДанные.ПлатежСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНачислениеОсн(Команда)
	ТекДанные = Элементы.ДССписокКвитанцийОсн.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ТекДанные.Квитанция);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПлатежиПоНачислению(Команда)
	ТекДанные = Элементы.ДССписокКвитанцийДоп.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТекущееНачисление = ТекДанные.Квитанция;
	
	РежимРаботы = "ПоНачислениям";
	
	Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаПоНачислениям;
	
	ПоказатьПлатежиПоНачислениюНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПоказатьПлатежиПоНачислениюНаСервере()
	
	КБК = "";
	ОКТМО = "";
	Плательщик = "";
	УИН = "";
	ОКТМО = "";
	БИКБанка = "";
	СчетПолучателя = "";
	СуммаДокумента = "";
	
	ОчиститьНастройкиДС(Ложь);
	ПриИзмененииРежимаРаботыУстановитьОформление();
	ОбновитьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПараметры(Команда)
	ОтображатьПанельОтборов = НЕ Элементы.ОтображениеПанелиОтборов.Пометка;
	ИзменитьОтборажениеПанелиОтборовНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьБезНачисления(Команда)
	
	МассивДокументов = ПолучитьВыделенныеДокументы();
	
	ТребуетсяОбновление = Ложь;
	РаспределитьБезНачисленияНаСервере(МассивДокументов,ТребуетсяОбновление);
	
	Если ТребуетсяОбновление Тогда
		Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
			ТипТаблицы = Тип("ДокументСсылка.ПлатежВОплатуГосуслуг");
		Иначе
			ТипТаблицы = Тип("ДокументСсылка.ПлатежПодведомственному");
		КонецЕсли;
		
		Элементы.ПлатежиБезНачислений.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРаспределениеБезНачисления(Команда)
	МассивДокументов = ПолучитьВыделенныеДокументы();
	
	ТребуетсяОбновление = Ложь;
	ОтменитьРаспределениеБезНачислений(МассивДокументов,ТребуетсяОбновление);
	
	Если ТребуетсяОбновление Тогда
		Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
			ТипТаблицы = Тип("ДокументСсылка.ПлатежВОплатуГосуслуг");
		Иначе
			ТипТаблицы = Тип("ДокументСсылка.ПлатежПодведомственному");
		КонецЕсли;
		
		Элементы.ПлатежиБезНачислений.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСНачислением(Команда)
	
	Если РежимРаботы = "ПоНачислениям" Тогда
		ТекНачисление = ТекущееНачисление;
		
		ТекДанные = Элементы.ДСТаблицаПлатежиДоп.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ТекПлатеж = ТекДанные.ПлатежСсылка;
	Иначе
		ТекДанные = Элементы.ДССписокКвитанцийДоп.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ТекНачисление = ТекДанные.Квитанция;
		
		ТекПлатеж = ТекущийПлатеж;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекНачисление)
		И ЗначениеЗаполнено(ТекПлатеж) Тогда
		СтрокаУчастника = Неопределено;
		Для Каждого СтрТЧ Из ТаблицаУчастников Цикл
			Если СтрТЧ.Участник = ТекущийУчастник Тогда
				СтрокаУчастника = СтрТЧ;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ИзменилсяСтатус = Ложь;
		РаспределитьПлатежСНачислением(ТекПлатеж,ТекНачисление,ТекущийУчастник,СтрокаУчастника.КоличествоНераспределенныхПлатежей,СтрокаУчастника.СуммаНераспределенных,СтрокаУчастника.Пояснение,ИзменилсяСтатус);
		ИнформацияОПлатежах = СтрокаУчастника.Пояснение;
		
		Если ИзменилсяСтатус Тогда
			ОповеститьОбИзменении(ТекНачисление);
			Оповестить("ОбновитьСтатус_ПлатежноРасчетныйДокумент",,ТекНачисление);
		КонецЕсли;
		
		Если ОтображатьПанельОтборов Тогда
			Элементы.РаспределенныеПлатежи.Обновить();
		КонецЕсли;
		
		Если РежимРаботы = "ПоНачислениям" Тогда
			Элементы.ДССписокКвитанцийОсн.Обновить();
			Элементы.ДСТаблицаПлатежиДоп.Обновить();
		Иначе
			Элементы.ДССписокКвитанцийДоп.Обновить();
			Элементы.ДСТаблицаПлатежиОсн.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРаспределение(Команда)
	ТекДанные = Элементы.РаспределенныеПлатежи.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьРаспределениеНаСервере(ТекДанные.Платеж);
	Элементы.РаспределенныеПлатежи.Обновить();
	Если РежимРаботы = "ПоНачислениям" Тогда
		Элементы.ДССписокКвитанцийОсн.Обновить();
		Элементы.ДСТаблицаПлатежиДоп.Обновить();
	Иначе
		Элементы.ДССписокКвитанцийДоп.Обновить();
		Элементы.ДСТаблицаПлатежиОсн.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьОтборыДСКвитанций()
	
	МассивСтатусов = Новый Массив;
	Для Каждого СтрСтатуса Из ОбрабатываемыеСтатусы Цикл
		Если СтрСтатуса.Пометка Тогда
			МассивСтатусов.Добавить(СтрСтатуса.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"Статусы",МассивСтатусов,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"УчитыватьСтатусы",ОбрабатываемыеСтатусыУсловие,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"УчитыватьНоменклатуру",НоменклатураОтборУсловие,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"Номенклатура",НоменклатураОтбор,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"УчитыватьПлательщика",ПлательщикОтборУсловие,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"Плательщик",ПлательщикОтбор,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"УчитыватьПериод",ПериодОтборУсловие,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"ДатаНачала",ПериодОтбор.ДатаНачала,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"ДатаОкончания",ПериодОтбор.ДатаОкончания,Истина);
КонецПроцедуры

&НаСервере
Процедура РассчитатьДляТекущегоПлатежа()
	
	Перем Выборка, Запрос, ТекстЗапроса;
	
	Элементы.ДСТаблицаПлатежиОсн.ТекущаяСтрока = ТекущийПлатеж;
	Если Элементы.ДСТаблицаПлатежиОсн.ТекущаяСтрока <> Неопределено Тогда
		
		Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
			ТекстЗапроса =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Док.Ссылка КАК ПлатежСсылка,
				|	Док.СуммаДокумента КАК СуммаДокумента,
				|	ВЫБОР
				|		КОГДА Док.КодБКПлатежа = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ Док.КодБКПлатежа
				|	КОНЕЦ КАК КБК,
				|	ВЫБОР
				|		КОГДА Док.КодОКАТО = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ Док.КодОКАТО
				|	КОНЕЦ КАК ОКТМО,
				|	ВЫБОР
				|		КОГДА Док.ИдентификаторПлательщика = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ Док.ИдентификаторПлательщика
				|	КОНЕЦ КАК ИдентификаторПлательщика,
				|	Док.НазначениеПлатежа КАК НазначениеПлатежа,
				|	Док.Плательщик КАК Плательщик,
				|	"""" КАК ПлательщикНаименование,
				|	Док.УникальныйИдентификаторНачисления КАК УИН,
				|	Док.СчетПолучателя КАК СчетПолучателя,
				|	Док.БИКБанкаПолучателя КАК БИКБанка,
				|	Док.Дата КАК Дата
				|ИЗ
				|	Документ.ПлатежВОплатуГосуслуг КАК Док
				|ГДЕ
				|	Док.Ссылка = &Платеж";
					
		Иначе
			
			ТекстЗапроса =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Док.Ссылка КАК ПлатежСсылка,
				|	Док.СуммаДокумента КАК СуммаДокумента,
				|	ВЫБОР
				|		КОГДА Док.КодБКПлатежа = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ Док.КодБКПлатежа
				|	КОНЕЦ КАК КБК,
				|	ВЫБОР
				|		КОГДА Док.КодОКАТО = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ Док.КодОКАТО
				|	КОНЕЦ КАК ОКТМО,
				|	ВЫБОР
				|		КОГДА Док.ИдентификаторПлательщика = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ Док.ИдентификаторПлательщика
				|	КОНЕЦ КАК ИдентификаторПлательщика,
				|	Док.НазначениеПлатежа КАК НазначениеПлатежа,
				|	"""" КАК Плательщик,
				|	Док.ПлательщикНаименование КАК ПлательщикНаименование,
				|	Док.УникальныйИдентификаторНачисления КАК УИН,
				|	Док.СчетПолучателя КАК СчетПолучателя,
				|	Док.БИКБанкаПолучателя КАК БИКБанка,
				|	Док.Дата КАК Дата
				|ИЗ
				|	Документ.ПлатежПодведомственному КАК Док
				|ГДЕ
				|	Док.Ссылка = &Платеж";
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		
		Запрос.УстановитьПараметр("Платеж",ТекущийПлатеж);
				
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			РассчитатьПодходящиеНачисленияДляПлатежаДС(Выборка);	
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РассчитатьДляТекущегоНачисления()
	
	Перем Выборка, Запрос, ТекстЗапроса;
	
	Элементы.ДССписокКвитанцийОсн.ТекущаяСтрока = ТекущееНачисление;
	Если Элементы.ДССписокКвитанцийОсн.ТекущаяСтрока <> Неопределено Тогда
		
		Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
			ТекстЗапроса = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Док.Ссылка КАК Квитанция,
				|	Док.Дата КАК Дата,
				|	Док.НазначениеПлатежа КАК НазначениеПлатежа,
				|	Док.Номенклатура КАК Номенклатура,
				|	Док.Плательщик КАК Плательщик,
				|	Док.Плательщик.Наименование КАК ПлательщикСтрокой,
				|	Док.УникальныйИдентификаторНачисления КАК УИН,
				|	Док.СуммаДокумента КАК СуммаКОплате,
				|	Док.ЕдиныйИдентификаторПлательщика КАК ЕдиныйИдентификаторПлательщика,
				|	Док.АльтернативныйИдентификаторПлательщика КАК АльтернативныйИдентификаторПлательщика,
				|	Док.ОсновнойИдентификаторПлательщика КАК ОсновнойИдентификаторПлательщика,
				|	Док.ДополнительныйИдентификаторПлательщика КАК ДополнительныйИдентификаторПлательщика,
				|	Док.КодБКПлатежа КАК КБК,
				|	Док.КодОКАТО КАК ОКТМО,
				|	Док.ПолучательБИКБанка КАК БИКБанка,
				|	Док.ПолучательБанковскийСчет КАК СчетПолучателя,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(СтатусыКвитированияНачислений.СтатусКвитирования, 0) <> 0
				|			ТОГДА ЕСТЬNULL(СтатусыКвитированияНачислений.ОстатокЗадолженности, 0)
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК ОстатокЗадолженностиФакт,
				|	ЕСТЬNULL(СуммаПлатежейПоНачислениям.СуммаПлатежей,0) КАК СуммаОплаты
				|ИЗ
				|	Документ.КвитанцияНаОплатуГосуслуг КАК Док
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКвитированияНачислений КАК СтатусыКвитированияНачислений
				|		ПО Док.Ссылка = СтатусыКвитированияНачислений.Начисление
				|		И СтатусыКвитированияНачислений.Начисление = &Начисление 
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СуммаПлатежейПоНачислениям КАК СуммаПлатежейПоНачислениям
				|		ПО Док.Ссылка = СуммаПлатежейПоНачислениям.Начисление
				|		И СуммаПлатежейПоНачислениям.Начисление = &Начисление
				|ГДЕ
				|	Док.Ссылка = &Начисление";
		Иначе
			ТекстЗапроса = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Док.Ссылка КАК Квитанция,
				|	Док.Дата КАК Дата,
				|	Док.НазначениеПлатежа КАК НазначениеПлатежа,
				|	Док.НаименованиеУслуги КАК Номенклатура,
				|	НЕОПРЕДЕЛЕНО КАК Плательщик,
				|	Док.ПлательщикНаименование КАК ПлательщикСтрокой,
				|	Док.УникальныйИдентификаторНачисления КАК УИН,
				|	Док.СуммаДокумента КАК СуммаКОплате,
				|	Док.Получатель КАК Получатель,
				|	Док.ЕдиныйИдентификаторПлательщика КАК ЕдиныйИдентификаторПлательщика,
				|	Док.АльтернативныйИдентификаторПлательщика КАК АльтернативныйИдентификаторПлательщика,
				|	Док.ОсновнойИдентификаторПлательщика КАК ОсновнойИдентификаторПлательщика,
				|	Док.ДополнительныйИдентификаторПлательщика КАК ДополнительныйИдентификаторПлательщика,
				|	Док.КодБКПлатежа КАК КБК,
				|	Док.КодОКАТО КАК ОКТМО,
				|	Док.ПолучательБИКБанка КАК БИКБанка,
				|	Док.ПолучательБанковскийСчет КАК СчетПолучателя,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(СтатусыКвитированияНачислений.СтатусКвитирования, 0) <> 0
				|			ТОГДА ЕСТЬNULL(СтатусыКвитированияНачислений.ОстатокЗадолженности, 0)
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК ОстатокЗадолженностиФакт,
				|	ЕСТЬNULL(СуммаПлатежейПоНачислениям.СуммаПлатежей,0) КАК СуммаОплаты
				|ИЗ
				|	Документ.НачислениеОтПодведомственного КАК Док
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКвитированияНачислений КАК СтатусыКвитированияНачислений
				|		ПО Док.Ссылка = СтатусыКвитированияНачислений.Начисление
				|		И СтатусыКвитированияНачислений.Начисление = &Начисление
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СуммаПлатежейПоНачислениям КАК СуммаПлатежейПоНачислениям
				|		ПО Док.Ссылка = СуммаПлатежейПоНачислениям.Начисление
				|		И СуммаПлатежейПоНачислениям.Начисление = &Начисление
				|ГДЕ
				|	Док.Ссылка = &Начисление";
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		
		Запрос.УстановитьПараметр("Начисление",ТекущееНачисление);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			РассчитатьПодходящиеПлатежиДляНачисленияДС(Выборка);	
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПриАктивизацииНачисленияДоп()
	
	ПоказатьРаспределенныеПлатежи();
	
КонецПроцедуры

&НаСервере
Процедура УчастникПрямогоВзаимодействияПриИзмененииНаСервере()
		
	ЗаполнитьТаблицуУчастников();
	ЗаполнитьИнформациюОПлатежахУчастников(Истина);
	
	ПриВыбореУчастника();	
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОПлатежахУчастников(УстанавливатьТекущегоУчастника = Истина)
	Если УстанавливатьТекущегоУчастника Тогда
		ТекущийУчастник = Неопределено;
	КонецЕсли;
	
	мМассивУчастниковОрганизаций = Новый Массив;
	мМассивУчастниковКонтрагентов = Новый Массив;
	
	ТипОрганизация = Тип("СправочникСсылка.Организации");
	Для Каждого СтрТЧ Из ТаблицаУчастников Цикл
		Если ТипЗнч(СтрТЧ.Участник) = ТипОрганизация Тогда
			мМассивУчастниковОрганизаций.Добавить(СтрТЧ.Участник);
		Иначе
			мМассивУчастниковКонтрагентов.Добавить(СтрТЧ.Участник);
		КонецЕсли;
	КонецЦикла;		 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивУчастниковОрганизаций",мМассивУчастниковОрганизаций);
	Запрос.УстановитьПараметр("МассивУчастниковКонтрагентов",мМассивУчастниковКонтрагентов);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(ДокументПлатежВОплатуГосуслуг.Ссылка) КАК КолДок,
		|	СУММА(ЕСТЬNULL(ДокументПлатежВОплатуГосуслуг.СуммаДокумента, 0)) КАК СумДок,
		|	ДокументПлатежВОплатуГосуслуг.Организация КАК Участник
		|ИЗ
		|	Документ.ПлатежВОплатуГосуслуг КАК ДокументПлатежВОплатуГосуслуг
		|ГДЕ
		|	ДокументПлатежВОплатуГосуслуг.БанковскийИдентификаторПлатежаЗаполнен
		|	И ДокументПлатежВОплатуГосуслуг.Организация В(&МассивУчастниковОрганизаций)
		|	И ДокументПлатежВОплатуГосуслуг.ПометкаУдаления = ЛОЖЬ
		|	И НЕ ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.СоответствиеНачисленийИПлатежей КАК РС
		|				ГДЕ
		|					РС.Платеж = ДокументПлатежВОплатуГосуслуг.Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументПлатежВОплатуГосуслуг.Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ПлатежПодведомственному.Ссылка),
		|	СУММА(ЕСТЬNULL(ПлатежПодведомственному.СуммаДокумента, 0)),
		|	ПлатежПодведомственному.Получатель
		|ИЗ
		|	Документ.ПлатежПодведомственному КАК ПлатежПодведомственному
		|ГДЕ
		|	ПлатежПодведомственному.БанковскийИдентификаторПлатежаЗаполнен
		|	И ПлатежПодведомственному.Получатель В(&МассивУчастниковКонтрагентов)
		|	И ПлатежПодведомственному.ПометкаУдаления = ЛОЖЬ
		|	И НЕ ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.СоответствиеНачисленийИПлатежей КАК РС
		|				ГДЕ
		|					РС.Платеж = ПлатежПодведомственному.Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлатежПодведомственному.Получатель";
	
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеОПлатежах = РезультатЗапроса.Выгрузить();
	ДанныеОПлатежах.Индексы.Добавить("Участник");
	
	КоличествоУчастников = ТаблицаУчастников.Количество();
	
	Для Каждого СтрТЧ Из ТаблицаУчастников Цикл
		НайденныеСтроки = ДанныеОПлатежах.НайтиСтроки(Новый Структура("Участник",СтрТЧ.Участник));
		Если НайденныеСтроки.Количество() Тогда
				
			СтрТЧ.КоличествоНераспределенныхПлатежей = НайденныеСтроки[0].КолДок;
			СтрТЧ.СуммаНераспределенных = НайденныеСтроки[0].СумДок;
			Если ЗначениеЗаполнено(СтрТЧ.КоличествоНераспределенныхПлатежей) Тогда
				ТекстПояснения = Нстр("ru='%1 шт. на %2 р.'");
				ТекстПояснения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПояснения,СтрТЧ.КоличествоНераспределенныхПлатежей,СтрТЧ.СуммаНераспределенных);
				СтрТЧ.Пояснение = ТекстПояснения;
				
				Если УстанавливатьТекущегоУчастника 
					И НЕ ЗначениеЗаполнено(ТекущийУчастник)
					И ЗначениеЗаполнено(СтрТЧ.КоличествоНераспределенныхПлатежей) Тогда
					ТекущийУчастник = СтрТЧ.Участник;
					ИнформацияОПлатежах = СтрТЧ.Пояснение;
					
					Если КоличествоУчастников>1 Тогда
						ДанныеПоУчастнику = Строка(ТекущийУчастник);
					Иначе
						ДанныеПоУчастнику = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				СтрТЧ.Пояснение = Нстр("ru='Нет'");
			КонецЕсли;
		Иначе
			СтрТЧ.Пояснение = Нстр("ru='Нет'");
		КонецЕсли;
	КонецЦикла;
	
	Если УстанавливатьТекущегоУчастника Тогда
		Если НЕ ЗначениеЗаполнено(ТекущийУчастник) Тогда
			ТекущийУчастник = ТаблицаУчастников[0].Участник;
			ИнформацияОПлатежах = ТаблицаУчастников[0].Пояснение;
						
			Если КоличествоУчастников>1 Тогда
				ДанныеПоУчастнику = Строка(ТекущийУчастник);
			Иначе
				ДанныеПоУчастнику = "";
			КонецЕсли;
		КонецЕсли;
	Иначе
		СтрокиУчастников = ТаблицаУчастников.НайтиСтроки(Новый Структура("Участник",ТекущийУчастник));
		Если СтрокиУчастников.Количество() Тогда
			ИнформацияОПлатежах = СтрокиУчастников[0].Пояснение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуУчастников()
	
	ТаблицаУчастников.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаОрганизацийДляГИСГМП_УНП.Организация КАК Организация,
		|	НастройкаОрганизацийДляГИСГМП_УНП.Подведомственный КАК Подведомственный,
		|	НастройкаОрганизацийДляГИСГМП_УНП.ВерсияФорматов КАК ВерсияФорматов,
		|	ВЫБОР
		|		КОГДА НастройкаОрганизацийДляГИСГМП_УНП.Подведомственный = НЕОПРЕДЕЛЕНО
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ПорядокУчастников
		|ИЗ
		|	РегистрСведений.НастройкаОрганизацийДляГИСГМП_УНП КАК НастройкаОрганизацийДляГИСГМП_УНП
		|ГДЕ
		|	НастройкаОрганизацийДляГИСГМП_УНП.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокУчастников,
		|	НастройкаОрганизацийДляГИСГМП_УНП.Подведомственный.Наименование
		|";
		
	Запрос.УстановитьПараметр("Организация", УчастникПрямогоВзаимодействия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	ГлавныйУчастник = ТаблицаУчастников.Добавить();
	ГлавныйУчастник.Участник = УчастникПрямогоВзаимодействия;
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ПорядокУчастников = 1 Тогда
			//Ничего не делаем
		Иначе
			Подвед = ТаблицаУчастников.Добавить();
			Подвед.Участник = ВыборкаДетальныеЗаписи.Подведомственный;
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаУчастников.Количество() = 1 Тогда
		//в таблице только этот участник, смысла показывать таблицу нет
		Элементы.ТаблицаУчастников.Видимость = Ложь;
	Иначе
		Элементы.ТаблицаУчастников.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачисления()
	
	МассивСтатусов = Новый Массив;
	Для Каждого СтрСтатуса Из ОбрабатываемыеСтатусы Цикл
		Если СтрСтатуса.Пометка Тогда
			МассивСтатусов.Добавить(СтрСтатуса.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = ПолучитьТекстЗапросаДСНачисления();
	
	ДССписокКвитанций.ТекстЗапроса = ТекстЗапроса;
	
	Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
		
		Если ДССписокКвитанций.ОсновнаяТаблица <> "Документ.КвитанцияНаОплатуГосуслуг" Тогда
		
			ТекстЗапроса = ПолучитьТекстЗапросаДСНачисления();		
			ДССписокКвитанций.ТекстЗапроса = ТекстЗапроса;
		
			ДССписокКвитанций.ОсновнаяТаблица = "Документ.КвитанцияНаОплатуГосуслуг";
			ДССписокКвитанций.ДинамическоеСчитываниеДанных = Истина;
			
			Элементы.ДССписокКвитанцийОснУчащийся.Видимость = Истина;
			Элементы.ДССписокКвитанцийОснДоговор.Видимость = Истина;
			Элементы.ДССписокКвитанцийДопУчащийся.Видимость = Истина;
			Элементы.ДССписокКвитанцийДопДоговор.Видимость = Истина;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"ТекущийУчастникОрганизация",ТекущийУчастник,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"ТекущийУчастникКонтрагент",Неопределено,Истина);
		
	Иначе
		
		Если ДССписокКвитанций.ОсновнаяТаблица <> "Документ.НачислениеОтПодведомственного" Тогда
			
			ТекстЗапроса = ПолучитьТекстЗапросаДСНачисления();
			ДССписокКвитанций.ТекстЗапроса = ТекстЗапроса;
			
			ДССписокКвитанций.ОсновнаяТаблица = "Документ.НачислениеОтПодведомственного";
			ДССписокКвитанций.ДинамическоеСчитываниеДанных = Истина;
			
			Элементы.ДССписокКвитанцийОснУчащийся.Видимость = Ложь;
			Элементы.ДССписокКвитанцийОснДоговор.Видимость = Ложь;
			Элементы.ДССписокКвитанцийДопУчащийся.Видимость = Ложь;
			Элементы.ДССписокКвитанцийДопДоговор.Видимость = Ложь;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"ТекущийУчастникОрганизация",Неопределено,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"ТекущийУчастникКонтрагент",ТекущийУчастник,Истина);		

	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"Статусы",МассивСтатусов,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"УчитыватьСтатусы",ОбрабатываемыеСтатусыУсловие,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"УчитыватьНоменклатуру",НоменклатураОтборУсловие,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"Номенклатура",НоменклатураОтбор,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"УчитыватьПлательщика",ПлательщикОтборУсловие,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"Плательщик",ПлательщикОтбор,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"УчитыватьПериод",ПериодОтборУсловие,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"ДатаНачала",ПериодОтбор.ДатаНачала,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"ДатаОкончания",ПериодОтбор.ДатаНачала,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"Участник",УчастникПрямогоВзаимодействия,Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"ТекущаяКвитанция",Неопределено,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"МаксимальныйПроцент",0,Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"АдресТаблицыНачислений","",Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДССписокКвитанций,"Квитанция",Новый Массив,ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
	
	Поля = Новый Массив;
	Поля.Добавить("СуммаВозвратов");
   	Поля.Добавить("ТекущийПроцентСовпадения");
	Поля.Добавить("МаксимальныйПроцентСовпадения");
	ДССписокКвитанций.УстановитьОграниченияИспользованияВГруппировке(Поля);
	ДССписокКвитанций.УстановитьОграниченияИспользованияВОтборе(Поля);
	ДССписокКвитанций.УстановитьОграниченияИспользованияВПорядке(Поля);
						
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапросаДСНачисления()
	
	Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Док.Ссылка КАК Квитанция,
		|	Док.Номер КАК Номер,
		|	Док.Дата КАК Дата,
		|	Док.НазначениеПлатежа КАК НазначениеПлатежа,
		|	Док.Номенклатура КАК Номенклатура,
		|	Док.Организация КАК Организация,
		|	Док.Плательщик КАК Плательщик,
		|	Док.Плательщик.Наименование КАК ПлательщикСтрокой,
		|	Док.УникальныйИдентификаторНачисления КАК УИН,
		|	ВЫБОР
		|		КОГДА Док.ВидКвитанции <= 1
		|			ТОГДА ""Нов.""
		|		КОГДА Док.ВидКвитанции = 2
		|			ТОГДА ""Изм.""
		|		КОГДА Док.ВидКвитанции = 3
		|			ТОГДА ""Аннул.""
		|		ИНАЧЕ ""Деаннул.""
		|	КОНЕЦ КАК ВидКвитанции,
		|	Док.СуммаДокумента КАК СуммаКОплате,
		|	Док.Организация КАК Получатель,
		|	Док.ЕдиныйИдентификаторПлательщика КАК ЕдиныйИдентификаторПлательщика,
		|	Док.АльтернативныйИдентификаторПлательщика КАК АльтернативныйИдентификаторПлательщика,
		|	Док.ОсновнойИдентификаторПлательщика КАК ОсновнойИдентификаторПлательщика,
		|	Док.ДополнительныйИдентификаторПлательщика КАК ДополнительныйИдентификаторПлательщика,
		|	Док.КодБКПлатежа КАК КБК,
		|	Док.КодОКАТО КАК ОКТМО,
		|	Док.ПолучательБИКБанка КАК БИКБанка,
		|	Док.ПолучательБанковскийСчет КАК СчетПолучателя,
		|	Док.Учащийся КАК Учащийся,
		|	Док.Договор КАК Договор,
		|	ЕСТЬNULL(СостояниеПлатежноРасчетныхДокументов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИсполненияДокумента.ВРаботе)) КАК Статус,
		|	ЕСТЬNULL(СтатусыКвитированияНачислений.СтатусКвитирования, 0) КАК СтатусКвитирования,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтатусыКвитированияНачислений.СтатусКвитирования, 0) <> 0
		|			ТОГДА ЕСТЬNULL(СтатусыКвитированияНачислений.ОстатокЗадолженности, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстатокЗадолженностиФакт,
		|	0 КАК ОстатокЗадолженностиРасчет,
		|	ЕСТЬNULL(СуммаПлатежейПоНачислениям.СуммаПлатежей,0) КАК СуммаОплаты,
		|	0 КАК СуммаВозвратов,
		|	ВЫБОР
		|		КОГДА Док.Ссылка = &ТекущаяКвитанция
		|			ТОГДА &МаксимальныйПроцент
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК МаксимальныйПроцентСовпадения,
		|	ИСТИНА КАК Показывать,
		|	0 КАК ТекущийПроцентСовпадения,
		|	&АдресТаблицыНачислений КАК АдресТаблицыНачислений,
		|	0 КАК ПолеСортировки
		|ИЗ
		|	Документ.КвитанцияНаОплатуГосуслуг КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеПлатежноРасчетныхДокументов КАК СостояниеПлатежноРасчетныхДокументов
		|		ПО Док.Ссылка = СостояниеПлатежноРасчетныхДокументов.ПлатежноРасчетныйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКвитированияНачислений КАК СтатусыКвитированияНачислений
		|		ПО Док.Ссылка = СтатусыКвитированияНачислений.Начисление
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СуммаПлатежейПоНачислениям КАК СуммаПлатежейПоНачислениям
		|		ПО Док.Ссылка = СуммаПлатежейПоНачислениям.Начисление
		|ГДЕ
		|	Док.Организация = &ТекущийУчастникОрганизация
		|	И Док.ПометкаУдаления = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА &УчитыватьНоменклатуру
		|				ТОГДА Док.Номенклатура = &Номенклатура
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &УчитыватьПериод
		|				ТОГДА Док.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &УчитыватьПлательщика
		|				ТОГДА Док.Плательщик = &Плательщик
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &УчитыватьСтатусы
		|				ТОГДА СостояниеПлатежноРасчетныхДокументов.Статус В (&Статусы)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Док.Ссылка КАК Квитанция,
		|	Док.Номер КАК Номер,
		|	Док.Дата КАК Дата,
		|	Док.НазначениеПлатежа КАК НазначениеПлатежа,
		|	Док.НаименованиеУслуги КАК Номенклатура,
		|	Док.Организация КАК Организация,
		|	НЕОПРЕДЕЛЕНО КАК Плательщик,
		|	Док.ПлательщикНаименование КАК ПлательщикСтрокой,
		|	Док.УникальныйИдентификаторНачисления КАК УИН,
		|	ВЫБОР
		|		КОГДА Док.ВидКвитанции <= 1
		|			ТОГДА ""Нов.""
		|		КОГДА Док.ВидКвитанции = 2
		|			ТОГДА ""Изм.""
		|		КОГДА Док.ВидКвитанции = 3
		|			ТОГДА ""Аннул.""
		|		ИНАЧЕ ""Деаннул.""
		|	КОНЕЦ КАК ВидКвитанции,
		|	Док.СуммаДокумента КАК СуммаКОплате,
		|	Док.Получатель КАК Получатель,
		|	Док.ЕдиныйИдентификаторПлательщика КАК ЕдиныйИдентификаторПлательщика,
		|	Док.АльтернативныйИдентификаторПлательщика КАК АльтернативныйИдентификаторПлательщика,
		|	Док.ОсновнойИдентификаторПлательщика КАК ОсновнойИдентификаторПлательщика,
		|	Док.ДополнительныйИдентификаторПлательщика КАК ДополнительныйИдентификаторПлательщика,
		|	Док.КодБКПлатежа КАК КБК,
		|	Док.КодОКАТО КАК ОКТМО,
		|	Док.ПолучательБИКБанка КАК БИКБанка,
		|	Док.ПолучательБанковскийСчет КАК СчетПолучателя,
		|	НЕОПРЕДЕЛЕНО КАК Учащийся,
		|	НЕОПРЕДЕЛЕНО КАК Договор,
		|	ЕСТЬNULL(СостояниеПлатежноРасчетныхДокументов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИсполненияДокумента.ВРаботе)) КАК Статус,
		|	ЕСТЬNULL(СтатусыКвитированияНачислений.СтатусКвитирования, 0) КАК СтатусКвитирования,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СтатусыКвитированияНачислений.СтатусКвитирования, 0) <> 0
		|			ТОГДА ЕСТЬNULL(СтатусыКвитированияНачислений.ОстатокЗадолженности, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстатокЗадолженностиФакт,
		|	0 КАК ОстатокЗадолженностиРасчет,
		|	ЕСТЬNULL(СуммаПлатежейПоНачислениям.СуммаПлатежей,0) КАК СуммаОплаты,
		|	0 КАК СуммаВозвратов,
		|	ВЫБОР
		|		КОГДА Док.Ссылка = &ТекущаяКвитанция
		|			ТОГДА &МаксимальныйПроцент
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК МаксимальныйПроцентСовпадения,
		|	ИСТИНА КАК Показывать,
		|	0 КАК ТекущийПроцентСовпадения,
		|	&АдресТаблицыНачислений КАК АдресТаблицыНачислений,
		|	0 КАК ПолеСортировки
		|ИЗ
		|	Документ.НачислениеОтПодведомственного КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеПлатежноРасчетныхДокументов КАК СостояниеПлатежноРасчетныхДокументов
		|		ПО Док.Ссылка = СостояниеПлатежноРасчетныхДокументов.ПлатежноРасчетныйДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыКвитированияНачислений КАК СтатусыКвитированияНачислений
		|		ПО Док.Ссылка = СтатусыКвитированияНачислений.Начисление
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СуммаПлатежейПоНачислениям КАК СуммаПлатежейПоНачислениям
		|		ПО Док.Ссылка = СуммаПлатежейПоНачислениям.Начисление
		|ГДЕ
		|	Док.Получатель = &ТекущийУчастникКонтрагент
		|	И Док.ПометкаУдаления = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА &УчитыватьПериод
		|				ТОГДА Док.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &УчитыватьСтатусы
		|				ТОГДА СостояниеПлатежноРасчетныхДокументов.Статус В (&Статусы)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПлатежи()
	
	ТекстЗапроса = ПолучитьТекстЗапросаДСПлатежи();
	
	Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
		
		Если ДСТаблицаПлатежи.ОсновнаяТаблица <> "Документ.ПлатежВОплатуГосуслуг" Тогда
			ТекстЗапроса = ПолучитьТекстЗапросаДСПлатежи();
			ДСТаблицаПлатежи.ТекстЗапроса = ТекстЗапроса;
			ДСТаблицаПлатежи.ОсновнаяТаблица = "Документ.ПлатежВОплатуГосуслуг";
			ДСТаблицаПлатежи.ДинамическоеСчитываниеДанных = Истина;
		КонецЕсли;
				
	Иначе
		
		Если ДСТаблицаПлатежи.ОсновнаяТаблица <> "Документ.ПлатежПодведомственному" Тогда
			ТекстЗапроса = ПолучитьТекстЗапросаДСПлатежи();
			ДСТаблицаПлатежи.ТекстЗапроса = ТекстЗапроса;
			ДСТаблицаПлатежи.ОсновнаяТаблица = "Документ.ПлатежПодведомственному";
			ДСТаблицаПлатежи.ДинамическоеСчитываниеДанных = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"ТекущийПлатеж",Неопределено,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"МаксимальныйПроцент",0,Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"Участник",ТекущийУчастник,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"ОтборПлатежей",ОтборПлатежей,Истина);
    ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"АдресТаблицыПлатежей","",Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСТаблицаПлатежи,"ПлатежСсылка",Новый Массив,ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
	
	Поля = Новый Массив;
	Поля.Добавить("ИННПлательщика");
	Поля.Добавить("КПППлательщика");
	Поля.Добавить("ВидДокументаПлательщика");
	Поля.Добавить("ТипПлательщика");
	Поля.Добавить("НомерДокументаПлательщика");
   	Поля.Добавить("ТекущийПроцентСовпадения");
	Поля.Добавить("МаксимальныйПроцентСовпадения");
	ДСТаблицаПлатежи.УстановитьОграниченияИспользованияВГруппировке(Поля);
	ДСТаблицаПлатежи.УстановитьОграниченияИспользованияВОтборе(Поля);
	ДСТаблицаПлатежи.УстановитьОграниченияИспользованияВПорядке(Поля);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапросаДСПлатежи()
	
	Перем ТекстЗапроса;
	
	Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Док.Ссылка КАК ПлатежСсылка,
		|	Док.СуммаДокумента КАК СуммаДокумента,
		|	ВЫБОР
		|		КОГДА Док.КодБКПлатежа = ""0""
		|			ТОГДА """"
		|		ИНАЧЕ Док.КодБКПлатежа
		|	КОНЕЦ КАК КБК,
		|	ВЫБОР
		|		КОГДА Док.КодОКАТО = ""0""
		|			ТОГДА """"
		|		ИНАЧЕ Док.КодОКАТО
		|	КОНЕЦ КАК ОКТМО,
		|	ВЫБОР
		|		КОГДА Док.ИдентификаторПлательщика = ""0""
		|			ТОГДА """"
		|		ИНАЧЕ Док.ИдентификаторПлательщика
		|	КОНЕЦ КАК ИдентификаторПлательщика,
		|	Док.НазначениеПлатежа КАК НазначениеПлатежа,
		|	Док.Плательщик КАК Плательщик,
		|	"""" КАК ПлательщикНаименование,
		|	Док.УникальныйИдентификаторНачисления КАК УИН,
		|	Док.СчетПолучателя КАК СчетПолучателя,
		|	Док.БИКБанкаПолучателя КАК БИКБанка,
		|	Док.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА Док.УникальныйИдентификаторНачисления В (""0"", """")
		|			ТОГДА ""Авансовый""
		|		ИНАЧЕ ""По начислению""
		|	КОНЕЦ КАК Вид,
		|	Док.Номер КАК Номер,
		|	Док.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
		|	&ОтборПлатежей КАК ДанныеРаспределения,
		|	Неопределено КАК ТипПлательщика,
		|	Выразить("""" КАК Строка(50)) КАК ВидДокументаПлательщика,
		|	Выразить("""" КАК Строка(20)) КАК НомерДокументаПлательщика,
		|	Выразить("""" КАК Строка(12)) КАК ИННПлательщика,
		|	Выразить("""" КАК Строка(9)) КАК КПППлательщика,
		|	ВЫБОР
		|		КОГДА Док.Ссылка = &ТекущийПлатеж
		|			ТОГДА &МаксимальныйПроцент
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК МаксимальныйПроцентСовпадения,
		|	ИСТИНА КАК Показывать,
		|	0 КАК ТекущийПроцентСовпадения,
		|	&АдресТаблицыПлатежей КАК АдресТаблицыПлатежей,
		|	0 КАК ПолеСортировки
		|ИЗ
		|	Документ.ПлатежВОплатуГосуслуг КАК Док
		|ГДЕ
		|";
		
		Если ОтборПлатежей = "Не распределен" Тогда
			ТекстЗапроса = ТекстЗапроса + 
			"НЕ ИСТИНА В
			|				(ВЫБРАТЬ ПЕРВЫЕ 1
			|					ИСТИНА
			|				ИЗ
			|					РегистрСведений.СоответствиеНачисленийИПлатежей КАК РС
			|				ГДЕ
			|					РС.Платеж = Док.Ссылка)
			|";
			
		Иначе
			ТекстЗапроса = ТекстЗапроса + 
			"ИСТИНА В
			|				(ВЫБРАТЬ ПЕРВЫЕ 1
			|					ИСТИНА
			|				ИЗ
			|					РегистрСведений.СоответствиеНачисленийИПлатежей КАК РС
			|				ГДЕ
			|					РС.Платеж = Док.Ссылка И РС.Начисление = ЗНАЧЕНИЕ(Документ.КвитанцияНаОплатуГосуслуг.ПустаяСсылка))
			|";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса +
		"И Док.БанковскийИдентификаторПлатежаЗаполнен
		|	И Док.Организация = &Участник
		|	И Док.ПометкаУдаления = ЛОЖЬ";
				
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Док.Ссылка КАК ПлатежСсылка,
		|	Док.СуммаДокумента КАК СуммаДокумента,
		|	ВЫБОР
		|		КОГДА Док.КодБКПлатежа = ""0""
		|			ТОГДА """"
		|		ИНАЧЕ Док.КодБКПлатежа
		|	КОНЕЦ КАК КБК,
		|	ВЫБОР
		|		КОГДА Док.КодОКАТО = ""0""
		|			ТОГДА """"
		|		ИНАЧЕ Док.КодОКАТО
		|	КОНЕЦ КАК ОКТМО,
		|	ВЫБОР
		|		КОГДА Док.ИдентификаторПлательщика = ""0""
		|			ТОГДА """"
		|		ИНАЧЕ Док.ИдентификаторПлательщика
		|	КОНЕЦ КАК ИдентификаторПлательщика,
		|	Док.НазначениеПлатежа КАК НазначениеПлатежа,
		|	"""" КАК Плательщик,
		|	Док.ПлательщикНаименование КАК ПлательщикНаименование,
		|	Док.УникальныйИдентификаторНачисления КАК УИН,
		|	Док.СчетПолучателя КАК СчетПолучателя,
		|	Док.БИКБанкаПолучателя КАК БИКБанка,
		|	Док.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА Док.УникальныйИдентификаторНачисления В (""0"", """")
		|			ТОГДА ""Авансовый""
		|		ИНАЧЕ ""По начислению""
		|	КОНЕЦ КАК Вид,
		|	Док.Номер КАК Номер,
		|	Док.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента,
		|	&ОтборПлатежей КАК ДанныеРаспределения,
		|	Неопределено КАК ТипПлательщика,
		|	Выразить("""" КАК Строка(50)) КАК ВидДокументаПлательщика,
		|	Выразить("""" КАК Строка(20)) КАК НомерДокументаПлательщика,
		|	Выразить("""" КАК Строка(12)) КАК ИННПлательщика,
		|	Выразить("""" КАК Строка(9)) КАК КПППлательщика,
		|	ВЫБОР
		|		КОГДА Док.Ссылка = &ТекущийПлатеж
		|			ТОГДА &МаксимальныйПроцент
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК МаксимальныйПроцентСовпадения,
		|	ИСТИНА КАК Показывать,
		|	0 КАК ТекущийПроцентСовпадения,
		|	&АдресТаблицыПлатежей КАК АдресТаблицыПлатежей,
		|	0 КАК ПолеСортировки
		|ИЗ
		|	Документ.ПлатежПодведомственному КАК Док
		|ГДЕ
		|";
		
		Если ОтборПлатежей = "Не распределен" Тогда
			ТекстЗапроса = ТекстЗапроса + 
			"НЕ ИСТИНА В
			|				(ВЫБРАТЬ ПЕРВЫЕ 1
			|					ИСТИНА
			|				ИЗ
			|					РегистрСведений.СоответствиеНачисленийИПлатежей КАК РС
			|				ГДЕ
			|					РС.Платеж = Док.Ссылка)
			|";
			
		Иначе
			ТекстЗапроса = ТекстЗапроса + 
			"ИСТИНА В
			|				(ВЫБРАТЬ ПЕРВЫЕ 1
			|					ИСТИНА
			|				ИЗ
			|					РегистрСведений.СоответствиеНачисленийИПлатежей КАК РС
			|				ГДЕ
			|					РС.Платеж = Док.Ссылка И РС.Начисление = ЗНАЧЕНИЕ(Документ.НачислениеОтПодведомственного.ПустаяСсылка))
			|";
			
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса +
		"И Док.БанковскийИдентификаторПлатежаЗаполнен
		|	И Док.Получатель = &Участник
		|	И Док.ПометкаУдаления = ЛОЖЬ";
				
	КонецЕсли;
	
	Возврат ТекстЗапроса;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПлательщикаПоИдентификатору(ИдентификаторПлательщика)
	//перенести в общий модуль
	СтруктураРезультата = Новый Структура("ТипПлательщика,ВидДокументаПлательщика,ИННПлательщика,КПППлательщика,НомерДокументаПлательщика");
	Если СтрДлина(ИдентификаторПлательщика) = 22 Тогда
		//заполним реквизиты документа плательщика по идентификатору ГИС ГМП 2.1
		
		СоответствиеПлательщиков = Новый Соответствие;
		СоответствиеПлательщиков.Вставить("1",Перечисления.ТипыПлательщиковГИСГМП.ФизЛицо);
		СоответствиеПлательщиков.Вставить("2",Перечисления.ТипыПлательщиковГИСГМП.ЮрЛицоРезидентРФ);
		СоответствиеПлательщиков.Вставить("3",Перечисления.ТипыПлательщиковГИСГМП.ЮрЛицоНерезидентРФ);
		СоответствиеПлательщиков.Вставить("4",Перечисления.ТипыПлательщиковГИСГМП.ИП);
		
		СтруктураРезультата.ТипПлательщика = СоответствиеПлательщиков[Лев(ИдентификаторПлательщика,1)];
		
		Если СтруктураРезультата.ТипПлательщика = Перечисления.ТипыПлательщиковГИСГМП.ФизЛицо Тогда
			//это физ. лицо
			
			ВидыДокументов = Новый Соответствие;
			ВидыДокументов.Вставить("01","Паспорт РФ");
			ВидыДокументов.Вставить("02","Свидетельство о рождении");
			ВидыДокументов.Вставить("03","Паспорт (уд.личности) моряка");
			ВидыДокументов.Вставить("04","Уд.личности военнослужащего");
			ВидыДокументов.Вставить("05","Военный билет");
			ВидыДокументов.Вставить("06","Временное уд.личности гражданина РФ");
			ВидыДокументов.Вставить("07","Справка об освобождении из мест лишения свободы");
			ВидыДокументов.Вставить("08","Паспорт иностранного гражданина");
			ВидыДокументов.Вставить("09","Вид на жительство ");
			ВидыДокументов.Вставить("10","РВП");
			ВидыДокументов.Вставить("11","Удостоверение беженца");
			ВидыДокументов.Вставить("12","Миграционная карта");
			ВидыДокументов.Вставить("13","Паспорт гражданина СССР");
			ВидыДокументов.Вставить("14","CНИЛС");
			ВидыДокументов.Вставить("15","Уд.личности гражданина РФ");
			ВидыДокументов.Вставить("21","ИНН физ.лица");
			ВидыДокументов.Вставить("22","Водительское удостоверение");
			ВидыДокументов.Вставить("24","Свидетельство о регистрации т.с. в МВД РФ");
			ВидыДокументов.Вставить("25","Охотничий билет");
			ВидыДокументов.Вставить("26","Разрешение на хранение и ношение охот. оружия");
			ВидыДокументов.Вставить("28","Загран.паспорт РФ");
			ВидыДокументов.Вставить("29","Свид-во о предоставлении врем. убежища на тер. РФ");
			ВидыДокументов.Вставить("30","Свид-во о рассмотрении ход-ва по существу");
			
			КодДокумента = Сред(ИдентификаторПлательщика,2,2);
			СтруктураРезультата.ВидДокументаПлательщика = ВидыДокументов[КодДокумента];
			
			Для Инд = 4 По 22 Цикл
				ТекСимвол = Сред(ИдентификаторПлательщика,Инд,1);
				Если ТекСимвол <>"0" Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			СтруктураРезультата.НомерДокументаПлательщика = Сред(ИдентификаторПлательщика,Инд);
			
		ИначеЕсли СтруктураРезультата.ТипПлательщика = Перечисления.ТипыПлательщиковГИСГМП.ЮрЛицоРезидентРФ Тогда
			//это юр. лицо резидент
			СтруктураРезультата.ИННПлательщика = Сред(ИдентификаторПлательщика,4,10);
			СтруктураРезультата.КПППлательщика = Сред(ИдентификаторПлательщика,14,9);
			СтруктураРезультата.ВидДокументаПлательщика = "ИНН/КПП";
			
		ИначеЕсли СтруктураРезультата.ТипПлательщика = Перечисления.ТипыПлательщиковГИСГМП.ЮрЛицоНерезидентРФ Тогда
			//это юр. лицо нерезидент
			
			Если Сред(ИдентификаторПлательщика,4,5) = "00000" Тогда
				СтруктураРезультата.ИННПлательщика = Сред(ИдентификаторПлательщика,9,5);
				СтруктураРезультата.ВидДокументаПлательщика = "КИО/КПП";
			Иначе			
				СтруктураРезультата.ИННПлательщика = Сред(ИдентификаторПлательщика,4,10);
				СтруктураРезультата.ВидДокументаПлательщика = "ИНН/КПП";
			КонецЕсли;
		
			СтруктураРезультата.КПППлательщика = Сред(ИдентификаторПлательщика,14,9);
			
			
		ИначеЕсли СтруктураРезультата.ТипПлательщика = Перечисления.ТипыПлательщиковГИСГМП.ИП Тогда
			//это ИП
			СтруктураРезультата.ВидДокументаПлательщика = "ИНН физ.лица";
			СтруктураРезультата.ИННПлательщика = Сред(ИдентификаторПлательщика,11,12);
		Иначе
			//такого быть не может по форматам
			
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаСервере
Процедура РассчитатьПодходящиеНачисленияИПлатежи(ПоТекущемуНачислению = Ложь)
	
	//Для сопоставления платежей проверяем реквизиты:
	//УИН 30
	//Плательщик 20
	//Счет 10
	//БИК  10
	//КБК  10
	//ОКТМО 10
	//Сумма = 20
	//Сумма < 5
	//Ид.Плательщика = 10
	//дата платежа - что он не раньше, чем за месяц до начисления - чтобы для новых начислений не показывать старые платежи
	
	//записывать в отдельную таблицу начисление - платеж - процент соответствия, если он больше 0
		
	ТабНачисления = ПолучитьТаблицуКвитанцийИзДС();	
	ТабПлатежи = ПолучитьТаблицуПлатежейИзДС();
		
	ТабНачисления.Колонки.Добавить("ДатаДляСоединения",Новый ОписаниеТипов("Дата"));
	ДляРасчета = 86400*30;
	
	МассивКвитанций = ТабНачисления.ВыгрузитьКолонку("Квитанция");
	
	Для Каждого СтрТЧ Из ТабНачисления Цикл
		СтрТЧ.ДатаДляСоединения = СтрТЧ.Дата - ДляРасчета;		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Начисления",ТабНачисления);
	Запрос.УстановитьПараметр("Платежи",ТабПлатежи);
	Запрос.УстановитьПараметр("ПустойКонтрагент",Справочники.Контрагенты.ПустаяСсылка());
	
	СоответствиеДляДокументов = Новый Соответствие;
	
	Если Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаПоНачислениям Тогда
		ТабНачисления.Колонки.Добавить("МаксимальныйПроцентСовпадения",Новый ОписаниеТипов("Число"));
		ПолеГруппировки = "ТабНачисления.Квитанция";
		
		Для Каждого СтрТЧ Из ТабНачисления Цикл
			СоответствиеДляДокументов.Вставить(СтрТЧ.Квитанция,СтрТЧ);
		КонецЦикла;
	
	Иначе
		ТабПлатежи.Колонки.Добавить("МаксимальныйПроцентСовпадения",Новый ОписаниеТипов("Число"));	
		ПолеГруппировки = "ТабПлатежи.ПлатежСсылка";
		
		Для Каждого СтрТЧ Из ТабПлатежи Цикл
			СоответствиеДляДокументов.Вставить(СтрТЧ.ПлатежСсылка,СтрТЧ);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Квитанция КАК Квитанция,
		|	Начисления.СчетПолучателя КАК СчетПолучателя,
		|	Начисления.БИКБанка КАК БИКБанка,
		|	Начисления.КБК КАК КБК,
		|	Начисления.ОКТМО КАК ОКТМО,
		|	Начисления.Плательщик КАК Плательщик,
		|	Начисления.ПлательщикСтрокой КАК ПлательщикСтрокой,
		|	Начисления.ОсновнойИдентификаторПлательщика КАК ОсновнойИдентификаторПлательщика,
		|	Начисления.ДополнительныйИдентификаторПлательщика КАК ДополнительныйИдентификаторПлательщика,
		|	Начисления.ЕдиныйИдентификаторПлательщика КАК ЕдиныйИдентификаторПлательщика,
		|	Начисления.АльтернативныйИдентификаторПлательщика КАК АльтернативныйИдентификаторПлательщика,
		|	Начисления.УИН КАК УИН,
		|	Начисления.СуммаКОплате КАК СуммаКОплате,
		|	Начисления.СуммаОплаты КАК СуммаОплаты,
		|	Начисления.Дата КАК Дата,
		|	Начисления.ДатаДляСоединения КАК ДатаДляСоединения
		|ПОМЕСТИТЬ ТабНачисления
		|ИЗ
		|	&Начисления КАК Начисления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДатаДляСоединения	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Платежи.ПлатежСсылка КАК ПлатежСсылка,
		|	Платежи.СчетПолучателя КАК СчетПолучателя,
		|	Платежи.БИКБанка КАК БИКБанка,
		|	Платежи.КБК КАК КБК,
		|	Платежи.ОКТМО КАК ОКТМО,
		|	Платежи.НазначениеПлатежа КАК НазначениеПлатежа,
		|	Платежи.Плательщик КАК Плательщик,
		|	Платежи.ИдентификаторПлательщика КАК ИдентификаторПлательщика,
		|	Платежи.УИН КАК УИН,
		|	Платежи.СуммаДокумента КАК СуммаДокумента,
		|	Платежи.Дата КАК Дата
		|ПОМЕСТИТЬ ТабПлатежи
		|ИЗ
		|	&Платежи КАК Платежи
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Дата		
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ПолеГруппировки КАК ДокГруппировки,
		|	МАКСИМУМ(0 + ВЫБОР
		|			КОГДА ТабНачисления.СчетПолучателя = ТабПлатежи.СчетПолучателя
		|				ТОГДА 10
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ТабНачисления.КБК = ТабПлатежи.КБК
		|				ТОГДА 10
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ТабНачисления.ОКТМО = ТабПлатежи.ОКТМО
		|				ТОГДА 10
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ТабНачисления.Плательщик = ТабПлатежи.Плательщик 
		|					И ТабНачисления.Плательщик <> &ПустойКонтрагент
		|				ТОГДА 20
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ТабНачисления.БИКБанка = ТабПлатежи.БИКБанка
		|				ТОГДА 10
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ТабПлатежи.НазначениеПлатежа ПОДОБНО ""%"" + ТабНачисления.ПлательщикСтрокой + ""%""
		|				ТОГДА 20
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ТабНачисления.УИН = ТабПлатежи.УИН
		|				ТОГДА 30
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ТабПлатежи.Плательщик = &ПустойКонтрагент
		|				ТОГДА ВЫБОР
		|						КОГДА ТабПлатежи.ИдентификаторПлательщика <> """"
		|								И ТабПлатежи.ИдентификаторПлательщика В (ТабНачисления.ОсновнойИдентификаторПлательщика, ТабНачисления.ДополнительныйИдентификаторПлательщика, ТабНачисления.ЕдиныйИдентификаторПлательщика, ТабНачисления.АльтернативныйИдентификаторПлательщика)
		|							ТОГДА 20
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА ТабНачисления.СуммаКОплате - ТабНачисления.СуммаОплаты = ТабПлатежи.СуммаДокумента
		|				ТОГДА 20
		|			КОГДА ТабНачисления.СуммаКОплате - ТабНачисления.СуммаОплаты > ТабПлатежи.СуммаДокумента
		|				ТОГДА 5
		|			КОГДА ТабНачисления.СуммаКОплате - ТабНачисления.СуммаОплаты < ТабПлатежи.СуммаДокумента
		|				ТОГДА -10
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПроцентСовпадения
		|ИЗ
		|	ТабНачисления КАК ТабНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабПлатежи КАК ТабПлатежи
		|		ПО ТабНачисления.ДатаДляСоединения <= ТабПлатежи.Дата
		|	СГРУППИРОВАТЬ ПО
		|		&ПолеГруппировки";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ПолеГруппировки",ПолеГруппировки);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		ТекСтрТЧ = СоответствиеДляДокументов[Выборка.ДокГруппировки];
		ТекСтрТЧ.МаксимальныйПроцентСовпадения = Выборка.ПроцентСовпадения;
		
	КонецЦикла;
	
	//тут выполняется сортировка по полю Максимальный процент совпадения
	Если Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаПоНачислениям Тогда
		
		ТабНачисления.Сортировать("МаксимальныйПроцентСовпадения Убыв,Дата Убыв");
		
		Инд = 0;
		ОграничиватьКолДок = 200;
		МассивТекстов = Новый Массив;
		МассивОтборовДокументов = Новый Массив;
		
		Для Каждого СтрТЧ Из ТабНачисления Цикл			
			МассивТекстов.Добавить("Когда Док.Ссылка = &Ссылка"+Инд+" Тогда "+Инд);
			МассивОтборовДокументов.Добавить(СтрТЧ.Квитанция);
			Инд = Инд + 1;
			Если Инд = ОграничиватьКолДок Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ТекстСортировки = "";
		Если МассивТекстов.Количество()>1 Тогда
			МассивТекстов.Вставить(0,"Выбор ");
			МассивТекстов.Добавить("Иначе 1000 Конец КАК ПолеСортировки");
			ТекстСортировки = СтрСоединить(МассивТекстов,Символы.ПС);
		КонецЕсли;
		
		ТекстЗапросаДС = ПолучитьТекстЗапросаДСНачисления();
		
		Если ЗначениеЗаполнено(ТекстСортировки) Тогда
			ТекстЗапросаДС = СтрЗаменить(ТекстЗапросаДС,"0 КАК ПолеСортировки",ТекстСортировки);
		КонецЕсли;	
		ДССписокКвитанций.ТекстЗапроса = ТекстЗапросаДС;
		
		Для Инд = 0 По МассивОтборовДокументов.Количество()-1 Цикл
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"Ссылка"+Инд,МассивОтборовДокументов[Инд],Истина);
		КонецЦикла;
		
		ДССписокКвитанций.Порядок.Элементы.Очистить();
		
		Если ЗначениеЗаполнено(ТекстСортировки) Тогда
			ПолеПорядка = ДССписокКвитанций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ПолеПорядка.Поле = Новый ПолеКомпоновкиДанных("ПолеСортировки");
			ПолеПорядка.Использование = Истина;
			ПолеПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		КонецЕсли;
		
		ПолеПорядка = ДССписокКвитанций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПолеПорядка.Поле = Новый ПолеКомпоновкиДанных("Дата");
		ПолеПорядка.Использование = Истина;
		ПолеПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
					
		МаксимальноеЗначение = 0;
		ТекущееНачисление = Неопределено;
		Если МассивОтборовДокументов.Количество() Тогда
			Элементы.ДССписокКвитанцийОсн.ТекущаяСтрока = МассивОтборовДокументов[0];
			ТекущееНачисление = МассивОтборовДокументов[0];
			МаксимальноеЗначение = ТабНачисления[0].МаксимальныйПроцентСовпадения;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"ТекущееНачисление",ТекущееНачисление,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"МаксимальныйПроцент",МаксимальноеЗначение,Истина);
		
		ТабНачисленияДляДС = ТабНачисления.Скопировать(,"Квитанция,МаксимальныйПроцентСовпадения");
		ТабНачисленияДляДС.Индексы.Добавить("Квитанция");
		АдресТаблицыНачислений = ПоместитьВоВременноеХранилище(ТабНачисленияДляДС,УникальныйИдентификатор);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"АдресТаблицыНачислений",АдресТаблицыНачислений,Истина);
	
		Если МассивОтборовДокументов.Количество() Тогда
			РассчитатьПодходящиеПлатежиДляНачисленияДС(ТабНачисления[0]);
		КонецЕсли;
	Иначе
		
		ТабПлатежи.Сортировать("МаксимальныйПроцентСовпадения Убыв,Дата Убыв");
		
		Инд = 0;
		ОграничиватьКолДок = 200;
		МассивТекстов = Новый Массив;
		МассивОтборовДокументов = Новый Массив;
		
		Для Каждого СтрТЧ Из ТабПлатежи Цикл			
			МассивТекстов.Добавить("Когда Док.Ссылка = &Ссылка"+Инд+" Тогда "+Инд);
			МассивОтборовДокументов.Добавить(СтрТЧ.ПлатежСсылка);
			Инд = Инд + 1;
			Если Инд = ОграничиватьКолДок Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ТекстСортировки = "";
		Если МассивТекстов.Количество()>1 Тогда
			МассивТекстов.Вставить(0,"Выбор ");
			МассивТекстов.Добавить("Иначе 1000 Конец КАК ПолеСортировки");
			ТекстСортировки = СтрСоединить(МассивТекстов,Символы.ПС);
		КонецЕсли;
		
		ТекстЗапросаДС = ПолучитьТекстЗапросаДСПлатежи();
		
		Если ЗначениеЗаполнено(ТекстСортировки) Тогда
			ТекстЗапросаДС = СтрЗаменить(ТекстЗапросаДС,"0 КАК ПолеСортировки",ТекстСортировки);
		КонецЕсли;	
		ДСТаблицаПлатежи.ТекстЗапроса = ТекстЗапросаДС;
		
		Для Инд = 0 По МассивОтборовДокументов.Количество()-1 Цикл
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"Ссылка"+Инд,МассивОтборовДокументов[Инд],Истина);
		КонецЦикла;
		
		ДСТаблицаПлатежи.Порядок.Элементы.Очистить();
		
		Если ЗначениеЗаполнено(ТекстСортировки) Тогда
			ПолеПорядка = ДСТаблицаПлатежи.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ПолеПорядка.Поле = Новый ПолеКомпоновкиДанных("ПолеСортировки");
			ПолеПорядка.Использование = Истина;
			ПолеПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		КонецЕсли;
		
		ПолеПорядка = ДСТаблицаПлатежи.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПолеПорядка.Поле = Новый ПолеКомпоновкиДанных("Дата");
		ПолеПорядка.Использование = Истина;
		ПолеПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
					
		МаксимальноеЗначение = 0;
		ТекущийПлатеж = Неопределено;
		Если МассивОтборовДокументов.Количество() Тогда
			Элементы.ДСТаблицаПлатежиОсн.ТекущаяСтрока = МассивОтборовДокументов[0];
			ТекущийПлатеж = МассивОтборовДокументов[0];
			МаксимальноеЗначение = ТабПлатежи[0].МаксимальныйПроцентСовпадения;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"ТекущийПлатеж",ТекущийПлатеж,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"МаксимальныйПроцент",МаксимальноеЗначение,Истина);
		
		ТабПлатежиДляДС = ТабПлатежи.Скопировать(,"ПлатежСсылка,МаксимальныйПроцентСовпадения");
		ТабПлатежиДляДС.Индексы.Добавить("ПлатежСсылка");
		АдресТаблицыПлатежей = ПоместитьВоВременноеХранилище(ТабПлатежиДляДС,УникальныйИдентификатор);
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"АдресТаблицыПлатежей",АдресТаблицыПлатежей,Истина);
	
		Если МассивОтборовДокументов.Количество() Тогда
			РассчитатьПодходящиеНачисленияДляПлатежаДС(ТабПлатежи[0]);
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры


&НаСервере
Процедура РассчитатьПодходящиеПлатежиДляНачисленияДС(СтрНачисления)
	
	ПлательщикСтрока = ВРег(СтрНачисления.ПлательщикСтрокой);
	
	ТекущееНачисление = СтрНачисления.Квитанция;
	
	КБК = СтрНачисления.КБК;
	ОКТМО = СтрНачисления.ОКТМО;
	Плательщик = СтрНачисления.Плательщик;
	УИН = СтрНачисления.УИН;
	ОКТМО = СтрНачисления.ОКТМО;
	БИКБанка = СтрНачисления.БИКБанка;
	СчетПолучателя = СтрНачисления.СчетПолучателя;
	СуммаДокумента = СтрНачисления.СуммаКОплате;	
	
	МаксимальноеЗначение = -100;
	
	ОстатокЗадолженности = СтрНачисления.СуммаКОплате - СтрНачисления.СуммаОплаты;
	
	ТекТаблицаПлатежи = ПолучитьТаблицуПлатежейИзДС();	
	
	Для Каждого СтрПлатежа Из ТекТаблицаПлатежи Цикл
		ТекНазначениеПлатежа = ВРег(СтрПлатежа.НазначениеПлатежа);
		ТекПроцент = 0;
		Если ЗначениеЗаполнено(СтрПлатежа.УИН) Тогда
			Если СтрПлатежа.УИН = СтрНачисления.УИН Тогда
				ТекПроцент = ТекПроцент + 30;
			КонецЕсли;
		КонецЕсли;
		
		//в назначении платежа может быть указан плательщик
		Если СтрНайти(ТекНазначениеПлатежа,ПлательщикСтрока)> 0 Тогда
			ТекПроцент = ТекПроцент + 20;
		КонецЕсли;
		
		Если СтрПлатежа.СчетПолучателя = СтрНачисления.СчетПолучателя Тогда
			ТекПроцент = ТекПроцент + 10;
		КонецЕсли;
		
		Если СтрПлатежа.БИКБанка = СтрНачисления.БИКБанка Тогда
			ТекПроцент = ТекПроцент + 10;
		КонецЕсли;
		
		Если СтрПлатежа.КБК = СтрНачисления.КБК Тогда
			ТекПроцент = ТекПроцент + 10;
		КонецЕсли;
		
		Если СтрПлатежа.ОКТМО = СтрНачисления.ОКТМО Тогда
			ТекПроцент = ТекПроцент + 10;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрПлатежа.Плательщик) Тогда
			Если СтрПлатежа.Плательщик = СтрНачисления.Плательщик Тогда
				ТекПроцент = ТекПроцент + 20;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СтрПлатежа.ИдентификаторПлательщика) Тогда
			Если СтрПлатежа.ИдентификаторПлательщика = СтрНачисления.ОсновнойИдентификаторПлательщика
				ИЛИ СтрПлатежа.ИдентификаторПлательщика = СтрНачисления.ДополнительныйИдентификаторПлательщика
				ИЛИ СтрПлатежа.ИдентификаторПлательщика = СтрНачисления.ЕдиныйИдентификаторПлательщика
				ИЛИ СтрПлатежа.ИдентификаторПлательщика = СтрНачисления.АльтернативныйИдентификаторПлательщика Тогда
				ТекПроцент = ТекПроцент + 20;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрПлатежа.СуммаДокумента = ОстатокЗадолженности Тогда
			ТекПроцент = ТекПроцент + 20;
		ИначеЕсли ТекПроцент>0
			И СтрПлатежа.СуммаДокумента < ОстатокЗадолженности Тогда
			//если совпали другие реквизиты и сумма платежа меньше суммы начисления, то добавим процент совпадения
			ТекПроцент = ТекПроцент + 5;
		ИначеЕсли ТекПроцент>0
			И СтрПлатежа.СуммаДокумента > ОстатокЗадолженности Тогда
			ТекПроцент = ТекПроцент - 10;
		КонецЕсли;
		
		//если дата платежа больше или равна даты начисленяи, то он считается подходящим, + 10
		//если дата платежа, меньше даты начисленяи на 30 дней, то процент совпадения не меняем,
		//иначе считатем, что это старые платежи, и уменьшим процент совпадения на 40
		
		Если СтрПлатежа.Дата >= СтрНачисления.Дата Тогда
			
		ИначеЕсли ЗначениеЗаполнено(СтрПлатежа.УИН) 
			И СтрПлатежа.УИН = СтрНачисления.УИН Тогда
			//Ничего не делаем
		Иначе
			Если (СтрНачисления.Дата - СтрПлатежа.Дата)/86400 > 30 Тогда
				ТекПроцент = ТекПроцент - 40;
			КонецЕсли;
		КонецЕсли;		
		
		СтрПлатежа.ТекущийПроцентСовпадения = ТекПроцент;
		
		Если ТекПроцент<МинимальныйУровеньСовпадения Тогда
			СтрПлатежа.Показывать = Ложь;
		Иначе
			СтрПлатежа.Показывать = Истина;
		КонецЕсли;
		
		МаксимальноеЗначение = Макс(МаксимальноеЗначение,ТекПроцент);
	КонецЦикла;
	
	ТекТаблицаПлатежи.Сортировать("ТекущийПроцентСовпадения Убыв,Дата Убыв");
	
	ТекущееНачисление = СтрНачисления.Квитанция;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"ТекущаяКвитанция",ТекущееНачисление,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"МаксимальныйПроцент",МаксимальноеЗначение,Истина);	
	
	Инд = 0;
	ОграничиватьКолДок = 100;
	МассивТекстов = Новый Массив;
	МассивОтборовДокументов = Новый Массив;
	Для Каждого СтрТЧ Из ТекТаблицаПлатежи Цикл
		Если СтрТЧ.Показывать Тогда
			МассивТекстов.Добавить("Когда Док.Ссылка = &Ссылка"+Инд+" Тогда "+Инд);
			МассивОтборовДокументов.Добавить(СтрТЧ.ПлатежСсылка);
			Инд = Инд + 1;
			Если Инд = ОграничиватьКолДок Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	ТекстСортировки = "";
	Если МассивТекстов.Количество()>1 Тогда
		МассивТекстов.Вставить(0,"Выбор ");
		МассивТекстов.Добавить("Иначе 1000 Конец КАК ПолеСортировки");
		ТекстСортировки = СтрСоединить(МассивТекстов,Символы.ПС);
	КонецЕсли;
	
	ТекстЗапросаДС = ПолучитьТекстЗапросаДСПлатежи();
	
	Если ЗначениеЗаполнено(ТекстСортировки) Тогда
		ТекстЗапросаДС = СтрЗаменить(ТекстЗапросаДС,"0 КАК ПолеСортировки",ТекстСортировки);
	КонецЕсли;	
	ДСТаблицаПлатежи.ТекстЗапроса = ТекстЗапросаДС;
	
	Для Инд = 0 По МассивОтборовДокументов.Количество()-1 Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"Ссылка"+Инд,МассивОтборовДокументов[Инд],Истина);
	КонецЦикла;
	
	ДСТаблицаПлатежи.Порядок.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(ТекстСортировки) Тогда
		ПолеПорядка = ДСТаблицаПлатежи.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПолеПорядка.Поле = Новый ПолеКомпоновкиДанных("ПолеСортировки");
		ПолеПорядка.Использование = Истина;
		ПолеПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	КонецЕсли;
	
	ПолеПорядка = ДСТаблицаПлатежи.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ПолеПорядка.Поле = Новый ПолеКомпоновкиДанных("Дата");
	ПолеПорядка.Использование = Истина;
	ПолеПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	
	ТабПлатежиДляОтбора = ТекТаблицаПлатежи.Скопировать(Новый Структура("Показывать",Истина),"ПлатежСсылка");
	ВыводимыеПлатежи = ТабПлатежиДляОтбора.ВыгрузитьКолонку("ПлатежСсылка");
	ТабПлатежи = ТекТаблицаПлатежи.Скопировать(,"ПлатежСсылка,ТекущийПроцентСовпадения");
	ТабПлатежи.Индексы.Добавить("ПлатежСсылка");
	АдресТаблицыПлатежей = ПоместитьВоВременноеХранилище(ТабПлатежи,УникальныйИдентификатор);
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"АдресТаблицыПлатежей",АдресТаблицыПлатежей,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСТаблицаПлатежи,"ПлатежСсылка",ВыводимыеПлатежи,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	
	Если МассивОтборовДокументов.Количество() Тогда
		Элементы.ДСТаблицаПлатежиДоп.ТекущаяСтрока = МассивОтборовДокументов[0];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПлатежейИзДС()
	
	Перем ДетальныеЗаписи, КомпоновщикМакета, КомпоновщикНастроек, МакетКомпоновкиДанных, МассивПолей, НастройкиСхемы, ПолеОтчет, ПроцессорВыводаРезультатаОтчета, ПроцессорКомпоновкиДанных, Схема, ТекПоле, ТекТаблицаПлатежи;
	
	Схема = Элементы.ДСТаблицаПлатежиДоп.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиСхемы = Элементы.ДСТаблицаПлатежиДоп.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиСхемы);
	КомпоновщикНастроек.Восстановить();
	
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	
	//отключить отбор по ссылке
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КомпоновщикНастроек.Настройки.Отбор,"ПлатежСсылка",Новый Массив,ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
	
	ДетальныеЗаписи = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ДетальныеЗаписи.Имя = "ДетальныеЗаписи";
	ДетальныеЗаписи.Использование = Истина;
	
	МассивПолей = СтрРазделить("НазначениеПлатежа,УИН,СчетПолучателя,БИКБанка,КБК,ОКТМО,Плательщик,ИдентификаторПлательщика,СуммаДокумента,Дата,ТекущийПроцентСовпадения,Показывать,ПлатежСсылка",",");
	Для Каждого ТекПоле Из МассивПолей Цикл
		ПолеОтчет = ДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеОтчет.Поле = Новый ПолеКомпоновкиДанных(ТекПоле);
		ПолеОтчет.Использование = Истина; 
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(Схема, КомпоновщикНастроек.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	ПроцессорВыводаРезультатаОтчета = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТекТаблицаПлатежи = ПроцессорВыводаРезультатаОтчета.Вывести(ПроцессорКомпоновкиДанных);
	Возврат ТекТаблицаПлатежи;

КонецФункции

&НаСервере
Процедура ПриИзмененииТекущегоУчастника()
	
	Если ТаблицаУчастников.Количество()>1 Тогда
		ДанныеПоУчастнику = Строка(ТекущийУчастник);
	Иначе
		ДанныеПоУчастнику = "";
	КонецЕсли;
			
	Если РежимРаботы <> "БезНачисления" Тогда
		ЗаполнитьНачисления();
		ЗаполнитьПлатежи();
	КонецЕсли;	
	ЗаполнитьПлатежиБезНачислений();//всегда
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНастройкиДС(ОчищатьТекущееНачисление = Истина)
	
	Если ОчищатьТекущееНачисление = Истина Тогда
		ТекущееНачисление = Неопределено;
	КонецЕсли;
	ТекущийПлатеж = Неопределено;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"АдресТаблицыНачислений","",Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"АдресТаблицыПлатежей","",Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДССписокКвитанций,"Квитанция",Новый Массив,ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДСТаблицаПлатежи,"ПлатежСсылка",Новый Массив,ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлатежиБезНачислений()
	
	Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
		
		Если ПлатежиБезНачислений.ОсновнаяТаблица <> "Документ.ПлатежВОплатуГосуслуг" Тогда
		
			ТекстЗапроса = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДокументПлатежВОплатуГосуслуг.Ссылка КАК ПлатежСсылка,
				|	ДокументПлатежВОплатуГосуслуг.СуммаДокумента КАК СуммаДокумента,
				|	ВЫБОР
				|		КОГДА ДокументПлатежВОплатуГосуслуг.КодБКПлатежа = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ ДокументПлатежВОплатуГосуслуг.КодБКПлатежа
				|	КОНЕЦ КАК КБК,
				|	ВЫБОР
				|		КОГДА ДокументПлатежВОплатуГосуслуг.КодОКАТО = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ ДокументПлатежВОплатуГосуслуг.КодОКАТО
				|	КОНЕЦ КАК ОКТМО,
				|	ВЫБОР
				|		КОГДА ДокументПлатежВОплатуГосуслуг.ИдентификаторПлательщика = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ ДокументПлатежВОплатуГосуслуг.ИдентификаторПлательщика
				|	КОНЕЦ КАК ИдентификаторПлательщика,
				|	ДокументПлатежВОплатуГосуслуг.НазначениеПлатежа КАК НазначениеПлатежа,
				|	ДокументПлатежВОплатуГосуслуг.Плательщик КАК Плательщик,
				|	ВЫБОР
				|		КОГДА ДокументПлатежВОплатуГосуслуг.УникальныйИдентификаторНачисления = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ ДокументПлатежВОплатуГосуслуг.УникальныйИдентификаторНачисления
				|	КОНЕЦ КАК УИН,
				|	ДокументПлатежВОплатуГосуслуг.СчетПолучателя КАК СчетПолучателя,
				|	ДокументПлатежВОплатуГосуслуг.БИКБанкаПолучателя КАК БИКБанка,
				|	ДокументПлатежВОплатуГосуслуг.Дата КАК Дата,
				|	ВЫБОР
				|		КОГДА ДокументПлатежВОплатуГосуслуг.УникальныйИдентификаторНачисления В (""0"", """")
				|			ТОГДА ""Авансовый""
				|		ИНАЧЕ ""По начислению""
				|	КОНЕЦ КАК Вид,
				|	ДокументПлатежВОплатуГосуслуг.Номер КАК Номер,
				|	ВЫБОР
				|		КОГДА СоответствиеНачисленийИПлатежей.Начисление ЕСТЬ NULL
				|			ТОГДА ""Не распределен""
				|		КОГДА СоответствиеНачисленийИПлатежей.Начисление = ЗНАЧЕНИЕ(Документ.КвитанцияНаОплатуГосуслуг.ПустаяСсылка)
				|			ТОГДА ""Без начисления""
				|		ИНАЧЕ СоответствиеНачисленийИПлатежей.Начисление
				|	КОНЕЦ КАК Начисление,
				|	ДокументПлатежВОплатуГосуслуг.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента
				|ИЗ
				|	Документ.ПлатежВОплатуГосуслуг КАК ДокументПлатежВОплатуГосуслуг
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНачисленийИПлатежей КАК СоответствиеНачисленийИПлатежей
				|		ПО (СоответствиеНачисленийИПлатежей.Платеж = ДокументПлатежВОплатуГосуслуг.Ссылка)
				|ГДЕ
				|	ЕСТЬNULL(СоответствиеНачисленийИПлатежей.Начисление, ЗНАЧЕНИЕ(Документ.КвитанцияНаОплатуГосуслуг.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.КвитанцияНаОплатуГосуслуг.ПустаяСсылка)
				|	И ДокументПлатежВОплатуГосуслуг.БанковскийИдентификаторПлатежаЗаполнен
				|	И ДокументПлатежВОплатуГосуслуг.Организация = &Участник
				|	И ДокументПлатежВОплатуГосуслуг.ПометкаУдаления = ЛОЖЬ";
			
			ПлатежиБезНачислений.ТекстЗапроса = ТекстЗапроса;
			ПлатежиБезНачислений.ОсновнаяТаблица = "Документ.ПлатежВОплатуГосуслуг";
			ПлатежиБезНачислений.ДинамическоеСчитываниеДанных = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Если ПлатежиБезНачислений.ОсновнаяТаблица <> "Документ.ПлатежПодведомственному" Тогда
			ТекстЗапроса = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ПлатежПодведомственному.Ссылка КАК ПлатежСсылка,
				|	ПлатежПодведомственному.СуммаДокумента КАК СуммаДокумента,
				|	ВЫБОР
				|		КОГДА ПлатежПодведомственному.КодБКПлатежа = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ ПлатежПодведомственному.КодБКПлатежа
				|	КОНЕЦ КАК КБК,
				|	ВЫБОР
				|		КОГДА ПлатежПодведомственному.КодОКАТО = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ ПлатежПодведомственному.КодОКАТО
				|	КОНЕЦ КАК ОКТМО,
				|	ВЫБОР
				|		КОГДА ПлатежПодведомственному.ИдентификаторПлательщика = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ ПлатежПодведомственному.ИдентификаторПлательщика
				|	КОНЕЦ КАК ИдентификаторПлательщика,
				|	ПлатежПодведомственному.ПлательщикНаименование КАК Плательщик,
				|	ПлатежПодведомственному.НазначениеПлатежа КАК НазначениеПлатежа,
				|	ВЫБОР
				|		КОГДА ПлатежПодведомственному.УникальныйИдентификаторНачисления = ""0""
				|			ТОГДА """"
				|		ИНАЧЕ ПлатежПодведомственному.УникальныйИдентификаторНачисления
				|	КОНЕЦ КАК УИН,
				|	ПлатежПодведомственному.СчетПолучателя КАК СчетПолучателя,
				|	ПлатежПодведомственному.БИКБанкаПолучателя КАК БИКБанка,
				|	ПлатежПодведомственному.Дата КАК Дата,
				|	ВЫБОР
				|		КОГДА ПлатежПодведомственному.УникальныйИдентификаторНачисления В (""0"", """")
				|			ТОГДА ""Авансовый""
				|		ИНАЧЕ ""По начислению""
				|	КОНЕЦ КАК Вид,
				|	ПлатежПодведомственному.Номер КАК Номер,
				|	ВЫБОР
				|		КОГДА СоответствиеНачисленийИПлатежей.Начисление ЕСТЬ NULL
				|			ТОГДА ""Не распределен""
				|		КОГДА СоответствиеНачисленийИПлатежей.Начисление = ЗНАЧЕНИЕ(Документ.НачислениеОтПодведомственного.ПустаяСсылка)
				|			ТОГДА ""Без начисления""
				|		ИНАЧЕ СоответствиеНачисленийИПлатежей.Начисление
				|	КОНЕЦ КАК Начисление,
				|	ПлатежПодведомственному.НомерПлатежногоДокумента КАК НомерПлатежногоДокумента
				|ИЗ
				|	Документ.ПлатежПодведомственному КАК ПлатежПодведомственному
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНачисленийИПлатежей КАК СоответствиеНачисленийИПлатежей
				|		ПО (СоответствиеНачисленийИПлатежей.Платеж = ПлатежПодведомственному.Ссылка)
				|ГДЕ
				|	ЕСТЬNULL(СоответствиеНачисленийИПлатежей.Начисление, ЗНАЧЕНИЕ(Документ.НачислениеОтПодведомственного.ПустаяСсылка)) = ЗНАЧЕНИЕ(Документ.НачислениеОтПодведомственного.ПустаяСсылка)
				|	И ПлатежПодведомственному.БанковскийИдентификаторПлатежаЗаполнен
				|	И ПлатежПодведомственному.Получатель = &Участник
				|	И ПлатежПодведомственному.ПометкаУдаления = ЛОЖЬ";
			
			ПлатежиБезНачислений.ТекстЗапроса = ТекстЗапроса;
			ПлатежиБезНачислений.ОсновнаяТаблица = "Документ.ПлатежПодведомственному";
			ПлатежиБезНачислений.ДинамическоеСчитываниеДанных = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПлатежиБезНачислений,"Участник",ТекущийУчастник,Истина);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПодходящиеНачисленияДляПлатежаДС(Знач СтрПлатежа)
	
	//для условного оформления
	ТекущийПлатеж = СтрПлатежа.ПлатежСсылка;
	
	КБК = СтрПлатежа.КБК;
	ОКТМО = СтрПлатежа.ОКТМО;
	Плательщик = СтрПлатежа.Плательщик;
	УИН = СтрПлатежа.УИН;
	ОКТМО = СтрПлатежа.ОКТМО;
	БИКБанка = СтрПлатежа.БИКБанка;
	СчетПолучателя = СтрПлатежа.СчетПолучателя;
	СуммаДокумента = СтрПлатежа.СуммаДокумента;
	
	ТекНазначениеПлатежа = ВРег(СтрПлатежа.НазначениеПлатежа);
	МаксимальноеЗначение = -100;
	
	ТекСписокКвитанций = ПолучитьТаблицуКвитанцийИзДС();
		
	Для Каждого СтрНачисления Из ТекСписокКвитанций Цикл

		ТекПроцент = 0;
		
		ПлательщикСтрока = СтрНачисления.ПлательщикСтрокой;
		
		Если ЗначениеЗаполнено(СтрПлатежа.УИН) Тогда
			Если СтрПлатежа.УИН = СтрНачисления.УИН Тогда
				ТекПроцент = ТекПроцент + 30;
			КонецЕсли;
		КонецЕсли;
		//в назначении платежа указан плательщик
		Если СтрНайти(ТекНазначениеПлатежа,ПлательщикСтрока)> 0 Тогда
			ТекПроцент = ТекПроцент + 20;
		КонецЕсли;
		
		Если СтрПлатежа.СчетПолучателя = СтрНачисления.СчетПолучателя Тогда
			ТекПроцент = ТекПроцент + 10;
		КонецЕсли;
		
		Если СтрПлатежа.БИКБанка = СтрНачисления.БИКБанка Тогда
			ТекПроцент = ТекПроцент + 10;
		КонецЕсли;
		
		Если СтрПлатежа.КБК = СтрНачисления.КБК Тогда
			ТекПроцент = ТекПроцент + 10;
		КонецЕсли;
		
		Если СтрПлатежа.ОКТМО = СтрНачисления.ОКТМО Тогда
			ТекПроцент = ТекПроцент + 10;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрПлатежа.Плательщик) Тогда
			Если СтрПлатежа.Плательщик = СтрНачисления.Плательщик Тогда
				ТекПроцент = ТекПроцент + 20;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СтрПлатежа.ИдентификаторПлательщика) Тогда
			Если СтрПлатежа.ИдентификаторПлательщика = СтрНачисления.ОсновнойИдентификаторПлательщика
				ИЛИ СтрПлатежа.ИдентификаторПлательщика = СтрНачисления.ДополнительныйИдентификаторПлательщика
				ИЛИ СтрПлатежа.ИдентификаторПлательщика = СтрНачисления.ЕдиныйИдентификаторПлательщика
				ИЛИ СтрПлатежа.ИдентификаторПлательщика = СтрНачисления.АльтернативныйИдентификаторПлательщика Тогда
				ТекПроцент = ТекПроцент + 20;
			КонецЕсли;
		КонецЕсли;
				
		СуммаЗадолженности = СтрНачисления.СуммаКОплате - СтрНачисления.СуммаОплаты;
		Если СтрПлатежа.СуммаДокумента = СуммаЗадолженности Тогда
			ТекПроцент = ТекПроцент + 20;
		ИначеЕсли ТекПроцент>0
			И СтрПлатежа.СуммаДокумента < СуммаЗадолженности Тогда
			//если совпали другие реквизиты и сумма платежа меньше суммы начисления, то добавим процент совпадения
			ТекПроцент = ТекПроцент + 5;
		ИначеЕсли ТекПроцент>0
			И СтрПлатежа.СуммаДокумента > СуммаЗадолженности Тогда
			ТекПроцент = ТекПроцент - 10;
		КонецЕсли;
		
		//если дата платежа больше или равна даты начисленяи, то он считается подходящим, + 10
		//если дата платежа, меньше даты начисленяи на 30 дней, то процент совпадения не меняем,
		//иначе считатем, что это старые платежи, и уменьшим процент совпадения на 40
		Если СтрПлатежа.Дата >= СтрНачисления.Дата Тогда
			//ТекПроцент = ТекПроцент + 10;
		ИначеЕсли ЗначениеЗаполнено(СтрПлатежа.УИН) 
			И СтрПлатежа.УИН = СтрНачисления.УИН Тогда
			//если совпадают УИН, не штрафуем, не зависимо от даты
		Иначе
			Если (СтрНачисления.Дата - СтрПлатежа.Дата)/86400 > 30 Тогда
				ТекПроцент = ТекПроцент - 40;
			КонецЕсли;
		КонецЕсли;
		
		СтрНачисления.ТекущийПроцентСовпадения = ТекПроцент;
		
		Если ТекПроцент<МинимальныйУровеньСовпадения Тогда
			СтрНачисления.Показывать = Ложь;
		Иначе
			СтрНачисления.Показывать = Истина;
		КонецЕсли;
		МаксимальноеЗначение = Макс(МаксимальноеЗначение,ТекПроцент);
	КонецЦикла;
	
	ТекСписокКвитанций.Сортировать("ТекущийПроцентСовпадения Убыв,Дата Убыв");
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"ТекущийПлатеж",ТекущийПлатеж,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДСТаблицаПлатежи,"МаксимальныйПроцент",МаксимальноеЗначение,Истина);
	
	Инд = 0;
	ОграничиватьКолДок = 100;
	МассивТекстов = Новый Массив;
	МассивОтборовДокументов = Новый Массив;
	
	Для Каждого СтрТЧ Из ТекСписокКвитанций Цикл
		Если СтрТЧ.Показывать Тогда
			МассивТекстов.Добавить("Когда Док.Ссылка = &Ссылка"+Инд+" Тогда "+Инд);
			МассивОтборовДокументов.Добавить(СтрТЧ.Квитанция);
			Инд = Инд + 1;
			Если Инд = ОграничиватьКолДок Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	ТекстСортировки = "";
	Если МассивТекстов.Количество()>1 Тогда
		МассивТекстов.Вставить(0,"Выбор ");
		МассивТекстов.Добавить("Иначе 1000 Конец КАК ПолеСортировки");
		ТекстСортировки = СтрСоединить(МассивТекстов,Символы.ПС);
	КонецЕсли;
	
	ТекстЗапросаДС = ПолучитьТекстЗапросаДСНачисления();
	
	Если ЗначениеЗаполнено(ТекстСортировки) Тогда
		ТекстЗапросаДС = СтрЗаменить(ТекстЗапросаДС,"0 КАК ПолеСортировки",ТекстСортировки);
	КонецЕсли;	
	ДССписокКвитанций.ТекстЗапроса = ТекстЗапросаДС;
	
	Для Инд = 0 По МассивОтборовДокументов.Количество()-1 Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"Ссылка"+Инд,МассивОтборовДокументов[Инд],Истина);
	КонецЦикла;
	
	ДССписокКвитанций.Порядок.Элементы.Очистить();
	
	Если ЗначениеЗаполнено(ТекстСортировки) Тогда
		ПолеПорядка = ДССписокКвитанций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПолеПорядка.Поле = Новый ПолеКомпоновкиДанных("ПолеСортировки");
		ПолеПорядка.Использование = Истина;
		ПолеПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
	КонецЕсли;
	
	ПолеПорядка = ДССписокКвитанций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ПолеПорядка.Поле = Новый ПолеКомпоновкиДанных("Дата");
	ПолеПорядка.Использование = Истина;
	ПолеПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	
	ТабНачисленияДляОтбора = ТекСписокКвитанций.Скопировать(Новый Структура("Показывать",Истина),"Квитанция");
	ВыводимыеДокументы = ТабНачисленияДляОтбора.ВыгрузитьКолонку("Квитанция");
	ТабНачисления = ТекСписокКвитанций.Скопировать(,"Квитанция,ТекущийПроцентСовпадения");
	ТабНачисления.Индексы.Добавить("Квитанция");
	АдресТаблицыНачислений = ПоместитьВоВременноеХранилище(ТабНачисления,УникальныйИдентификатор);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ДССписокКвитанций,"АдресТаблицыНачислений",АдресТаблицыНачислений,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ДССписокКвитанций,"Квитанция",ВыводимыеДокументы,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	
	Если МассивОтборовДокументов.Количество() Тогда
		Элементы.ДССписокКвитанцийДоп.ТекущаяСтрока = МассивОтборовДокументов[0];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуКвитанцийИзДС()
	
	Перем ДетальныеЗаписи, КомпоновщикМакета, КомпоновщикНастроек, МакетКомпоновкиДанных, МассивПолей, НастройкиСхемы, ПолеОтчет, ПроцессорВыводаРезультатаОтчета, ПроцессорКомпоновкиДанных, Схема, ТекПоле, ТекСписокКвитанций;
	
	Схема = Элементы.ДССписокКвитанцийДоп.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиСхемы = Элементы.ДССписокКвитанцийДоп.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиСхемы);
	КомпоновщикНастроек.Восстановить();
	
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	
	//отключить отбор по ссылке
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КомпоновщикНастроек.Настройки.Отбор,"Квитанция",Новый Массив,ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
	
	ДетальныеЗаписи = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ДетальныеЗаписи.Имя = "ДетальныеЗаписи";
	ДетальныеЗаписи.Использование = Истина;
	
	МассивПолей = СтрРазделить("НазначениеПлатежа,УИН,СчетПолучателя,БИКБанка,КБК,ОКТМО,Плательщик,ПлательщикСтрокой,ОсновнойИдентификаторПлательщика,ДополнительныйИдентификаторПлательщика,ЕдиныйИдентификаторПлательщика,АльтернативныйИдентификаторПлательщика,СуммаКОплате,СуммаОплаты,Дата,ТекущийПроцентСовпадения,Показывать,Квитанция",",");
	Для Каждого ТекПоле Из МассивПолей Цикл
		ПолеОтчет = ДетальныеЗаписи.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеОтчет.Поле = Новый ПолеКомпоновкиДанных(ТекПоле);
		ПолеОтчет.Использование = Истина; 
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(Схема, КомпоновщикНастроек.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	ПроцессорВыводаРезультатаОтчета = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТекСписокКвитанций = ПроцессорВыводаРезультатаОтчета.Вывести(ПроцессорКомпоновкиДанных);
	Возврат ТекСписокКвитанций;

КонецФункции

&НаСервере
Процедура ПриИзмененииРежимаРаботы()
	
	КБК = "";
	ОКТМО = "";
	Плательщик = "";
	УИН = "";
	ОКТМО = "";
	БИКБанка = "";
	СчетПолучателя = "";
	СуммаДокумента = "";
	
	ОчиститьНастройкиДС(Истина);
	
	ПриИзмененииРежимаРаботыУстановитьОформление();
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииРежимаРаботыУстановитьОформление()
	
	
	Элементы.ДекорацияПлатежи.ЦветФона = ?(РежимРаботы = "ПоПлатежам",ЦветаСтиля.ФонУправляющегоПоля,ЦветаСтиля.ЦветФонаФормы);
	Элементы.ДекорацияНачисления.ЦветФона = ?(РежимРаботы = "ПоНачислениям",ЦветаСтиля.ФонУправляющегоПоля,ЦветаСтиля.ЦветФонаФормы);
	Элементы.ДекорацияБезНачисления.ЦветФона = ?(РежимРаботы = "БезНачисления",ЦветаСтиля.ФонУправляющегоПоля,ЦветаСтиля.ЦветФонаФормы);
	
	
	Если РежимРаботы = "ПоПлатежам" Тогда
		Элементы.ГруппаСтраницыРазделов.ТекущаяСтраница = Элементы.ГруппаРазделыРаспределения;
		Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаПоПлатежам;
	ИначеЕсли РежимРаботы = "ПоНачислениям" Тогда
		Элементы.ГруппаСтраницыРазделов.ТекущаяСтраница = Элементы.ГруппаРазделыРаспределения;
		Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаПоНачислениям;
	Иначе
		Элементы.ГруппаСтраницыРазделов.ТекущаяСтраница = Элементы.ГруппаРазделБезНачислений;
		Элементы.ГруппаСтраницыВариантов.ТекущаяСтраница = Элементы.ГруппаБезНачисления;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура РаспределитьПлатежСНачислением(ТекПлатеж,ТекНачисление,ТекущийУчастник,КоличествоНераспределенныхПлатежей,СуммаНераспределенных,ТекстПояснения,ИзменилсяСтатус)
	
	НастройкиУчастника = БиблиотекаФункцийОбмена.ПолучитьНастройкиОрганизации(ТекущийУчастник);
	ТребуетсяКвитирование = 0; //0 - нет, 1 - Да, 2 - запрос отправлен, 3 - квитирование выполнено
	Если СтрНачинаетсяС(СокрЛП(НастройкиУчастника.ВерсияФорматов), "2") Тогда
		//для обмена по форматам 2.1 и выше устанавливаем признак, что требуется квитирование
		ТребуетсяКвитирование = 1; //0 - нет, 1 - Да, 2 - запрос отправлен, 3 - квитирование выполнено
	КонецЕсли;
		
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КвитанцияНаОплатуГосуслуг.Номенклатура КАК Номенклатура,
			|	КвитанцияНаОплатуГосуслуг.Плательщик КАК Плательщик,
			|	КвитанцияНаОплатуГосуслуг.Учащийся КАК Учащийся,
			|	КвитанцияНаОплатуГосуслуг.Договор КАК Договор,
			|	КвитанцияНаОплатуГосуслуг.КодБКПлатежа КАК КодБКПлатежа,
			|	КвитанцияНаОплатуГосуслуг.КодОКАТО КАК КодОКАТО,
			|	КвитанцияНаОплатуГосуслуг.СуммаДокумента КАК СуммаДокумента,
			|	КвитанцияНаОплатуГосуслуг.УникальныйИдентификаторНачисления КАК УИН
			|ИЗ
			|	Документ.КвитанцияНаОплатуГосуслуг КАК КвитанцияНаОплатуГосуслуг
			|ГДЕ
			|	КвитанцияНаОплатуГосуслуг.Ссылка = &Начисление
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПлатежВОплатуГосуслуг.Плательщик КАК Плательщик,
			|	ПлатежВОплатуГосуслуг.Договор КАК Договор,
			|	ПлатежВОплатуГосуслуг.Учащийся КАК Учащийся,
			|	ПлатежВОплатуГосуслуг.Номенклатура КАК Номенклатура,
			|	ПлатежВОплатуГосуслуг.КодБКПлатежа КАК КодБКПлатежа,
			|	ПлатежВОплатуГосуслуг.КодОКАТО КАК КодОКАТО,
			|	ПлатежВОплатуГосуслуг.БанковскийИдентификаторПлатежа КАК БанковскийИдентификаторПлатежа,
			|	ПлатежВОплатуГосуслуг.Ссылка КАК Ссылка,
			|	ПлатежВОплатуГосуслуг.СуммаДокумента КАК СуммаДокумента,
			|	ПлатежВОплатуГосуслуг.УникальныйИдентификаторНачисления КАК УИН
			|ИЗ
			|	Документ.ПлатежВОплатуГосуслуг КАК ПлатежВОплатуГосуслуг
			|ГДЕ
			|	ПлатежВОплатуГосуслуг.Ссылка = &Платеж";
	Иначе
	    Запрос.Текст = 
			"ВЫБРАТЬ
			|	НачислениеОтПодведомственного.НаименованиеУслуги КАК НаименованиеУслуги,
			|	НачислениеОтПодведомственного.ПлательщикНаименование КАК ПлательщикНаименование,
			|	НачислениеОтПодведомственного.КодБКПлатежа КАК КодБКПлатежа,
			|	НачислениеОтПодведомственного.КодОКАТО КАК КодОКАТО,
			|	НачислениеОтПодведомственного.СуммаДокумента КАК СуммаДокумента,
			|	НачислениеОтПодведомственного.УникальныйИдентификаторНачисления КАК УИН
			|ИЗ
			|	Документ.НачислениеОтПодведомственного КАК НачислениеОтПодведомственного
			|ГДЕ
			|	НачислениеОтПодведомственного.Ссылка = &Начисление
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПлатежПодведомственному.ПлательщикНаименование КАК ПлательщикНаименование,
			|	ПлатежПодведомственному.НаименованиеУслуги КАК НаименованиеУслуги,
			|	ПлатежПодведомственному.КодБКПлатежа КАК КодБКПлатежа,
			|	ПлатежПодведомственному.КодОКАТО КАК КодОКАТО,
			|	ПлатежПодведомственному.БанковскийИдентификаторПлатежа КАК БанковскийИдентификаторПлатежа,
			|	ПлатежПодведомственному.Ссылка КАК Ссылка,
			|	ПлатежПодведомственному.СуммаДокумента КАК СуммаДокумента,
			|	ПлатежПодведомственному.УникальныйИдентификаторНачисления КАК УИН
			|ИЗ
			|	Документ.ПлатежПодведомственному КАК ПлатежПодведомственному
			|ГДЕ
			|	ПлатежПодведомственному.Ссылка = &Платеж";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Платеж", ТекПлатеж);
	Запрос.УстановитьПараметр("Начисление", ТекНачисление);

	Результаты = Запрос.ВыполнитьПакет();

	РезультатНачисления = Результаты[0].Выгрузить();
    ДанныеПоНачислению = РезультатНачисления[0];
	
	РезультатПлатеж = Результаты[1].Выгрузить();
	ДанныеПоПлатежу = РезультатПлатеж[0];
		
	Запись = РегистрыСведений.СоответствиеНачисленийИПлатежей.СоздатьМенеджерЗаписи();
	Запись.Платеж = ТекПлатеж;
	Запись.Начисление = ТекНачисление;
	
	Если НЕ ЗначениеЗаполнено(ДанныеПоПлатежу.УИН)
		ИЛИ СокрЛП(ДанныеПоПлатежу.УИН) = "0"
		ИЛИ ДанныеПоПлатежу.УИН<>ДанныеПоНачислению.УИН Тогда
		//Ставим признак только если у платежа не указан УИН, или УИН в начислении и платеже отличается
		Запись.ТребуетсяКвитирование = ТребуетсяКвитирование;//если платеж с начислением распределены вручную, значит позднее их надо сквитировать в ГИС ГМП
	КонецЕсли;
	
	Запись.БанковскийИдентификаторПлатежаЗаполнен = ЗначениеЗаполнено(ДанныеПоПлатежу.БанковскийИдентификаторПлатежа);
	Запись.Записать();
	
	СтрокаРеквизитов = "";
	Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
		Если НЕ ЗначениеЗаполнено(ДанныеПоПлатежу.Плательщик) И ЗначениеЗаполнено(ДанныеПоНачислению.Плательщик) Тогда
			СтрокаРеквизитов = СтрокаРеквизитов + "Плательщик";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДанныеПоПлатежу.Номенклатура) И ЗначениеЗаполнено(ДанныеПоНачислению.Номенклатура) Тогда
			СтрокаРеквизитов = СтрокаРеквизитов +?(СтрокаРеквизитов="","",", ")+ "Номенклатура";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеПоПлатежу.Договор) И ЗначениеЗаполнено(ДанныеПоНачислению.Договор) Тогда
			СтрокаРеквизитов = СтрокаРеквизитов +?(СтрокаРеквизитов="","",", ")+ "Договор";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеПоПлатежу.Учащийся) И ЗначениеЗаполнено(ДанныеПоНачислению.Учащийся) Тогда
			СтрокаРеквизитов = СтрокаРеквизитов +?(СтрокаРеквизитов="","",", ")+ "Учащийся";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеПоПлатежу.КодБКПлатежа) И ЗначениеЗаполнено(ДанныеПоНачислению.КодБКПлатежа) Тогда
			СтрокаРеквизитов = СтрокаРеквизитов +?(СтрокаРеквизитов="","",", ")+ "КодБКПлатежа";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДанныеПоПлатежу.КодОКАТО) И ЗначениеЗаполнено(ДанныеПоНачислению.КодОКАТО) Тогда
			СтрокаРеквизитов = СтрокаРеквизитов +?(СтрокаРеквизитов="","",", ")+ "КодОКАТО";
		КонецЕсли;
	Иначе
		СтрокаРеквизитов = СтрокаРеквизитов + "ПлательщикНаименование, НаименованиеУслуги";

		Если НЕ ЗначениеЗаполнено(ДанныеПоПлатежу.КодБКПлатежа) И ЗначениеЗаполнено(ДанныеПоНачислению.КодБКПлатежа) Тогда
			СтрокаРеквизитов = СтрокаРеквизитов +?(СтрокаРеквизитов="","",", ")+ "КодБКПлатежа";
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДанныеПоПлатежу.КодОКАТО) И ЗначениеЗаполнено(ДанныеПоНачислению.КодОКАТО) Тогда
			СтрокаРеквизитов = СтрокаРеквизитов +?(СтрокаРеквизитов="","",", ")+ "КодОКАТО";
		КонецЕсли;

	КонецЕсли;
		
	Если ЗначениеЗаполнено(СтрокаРеквизитов) Тогда
		ПлатежОбъект = ТекПлатеж.ПолучитьОбъект();
		Попытка
		    ПлатежОбъект.Заблокировать();
			
			ЗаполнитьЗначенияСвойств(ПлатежОбъект,ДанныеПоНачислению,СтрокаРеквизитов);
		
			ПлатежОбъект.Записать();
		Исключение
		    Текст = "ru = 'Не удалось обновить реквизиты платежа по реквизитам начисления.'";
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр(Текст)+ " """ + ПлатежОбъект + """!
		           |"+ ОписаниеОшибки());
		КонецПопытки;
        
		
	КонецЕсли;	  
		
	СуммаПлатежей = ПолучитьСуммуПлатежейПоНачислению(ТекНачисление);
	
	ИзменилсяСтатус = Ложь;
	Если СуммаПлатежей >= ДанныеПоНачислению.СуммаДокумента
		И ДанныеПоНачислению.СуммаДокумента <> 0 Тогда
		СтруктураРекв = ПлатежноРасчетныеДокументы.ПолучитьСостояниеЗаявки(ТекНачисление);
		//Изменяем статус начисления на Исполнен только при текущем статусе = НаИсполнении,
		//т.к. прочие статусы: В работе, Подготовлен, Аннулирован и др. означают, что работа с документом не завершена,
		//и он должен быть отправлен в ГИС ГМП.
		//После успешной отправки документа, если платежи получены на полную сумму, ему автоматически будет установлен статус Исполнен.
		Если СтруктураРекв.Статус = Перечисления.СтатусыИсполненияДокумента.НаИсполнении Тогда
			СтруктураРекв.Вставить("ПлатежноРасчетныйДокумент",ТекНачисление);
			СтруктураРекв.Вставить("Статус",Перечисления.СтатусыИсполненияДокумента.Исполнен);
			ПлатежноРасчетныеДокументы.ЗарегестрироватьИсполнениеЗаявки(СтруктураРекв);
			ИзменилсяСтатус = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьДанныеОПлатежахУчастника(КоличествоНераспределенныхПлатежей, СуммаНераспределенных, ТекстПояснения, ТекущийУчастник);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьДанныеОПлатежахУчастника(КоличествоНераспределенныхПлатежей, СуммаНераспределенных, ТекстПояснения, ТекущийУчастник)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Участник",ТекущийУчастник);
	
	Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(ДокументПлатежВОплатуГосуслуг.Ссылка) КАК КолДок,
		|	СУММА(ЕСТЬNULL(ДокументПлатежВОплатуГосуслуг.СуммаДокумента, 0)) КАК СумДок,
		|	ДокументПлатежВОплатуГосуслуг.Организация КАК Участник
		|ИЗ
		|	Документ.ПлатежВОплатуГосуслуг КАК ДокументПлатежВОплатуГосуслуг
		|ГДЕ
		|	ДокументПлатежВОплатуГосуслуг.Организация = &Участник
		|	И ДокументПлатежВОплатуГосуслуг.БанковскийИдентификаторПлатежаЗаполнен
		|	И ДокументПлатежВОплатуГосуслуг.ПометкаУдаления = ЛОЖЬ
		|	И НЕ ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.СоответствиеНачисленийИПлатежей КАК РС
		|				ГДЕ
		|					РС.Платеж = ДокументПлатежВОплатуГосуслуг.Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументПлатежВОплатуГосуслуг.Организация";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(ПлатежПодведомственному.Ссылка) КАК КолДок,
		|	СУММА(ЕСТЬNULL(ПлатежПодведомственному.СуммаДокумента, 0)) КАК СумДок,
		|	ПлатежПодведомственному.Получатель КАК Участник
		|ИЗ
		|	Документ.ПлатежПодведомственному КАК ПлатежПодведомственному
		|ГДЕ
		|	ПлатежПодведомственному.Получатель = &Участник
		|	И ПлатежПодведомственному.БанковскийИдентификаторПлатежаЗаполнен
		|	И ПлатежПодведомственному.ПометкаУдаления = ЛОЖЬ
		|	И НЕ ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.СоответствиеНачисленийИПлатежей КАК РС
		|				ГДЕ
		|					РС.Платеж = ПлатежПодведомственному.Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлатежПодведомственному.Получатель";
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КоличествоНераспределенныхПлатежей = Выборка.КолДок;
		СуммаНераспределенных = Выборка.СумДок;	
	Иначе
		КоличествоНераспределенныхПлатежей = 0;
		СуммаНераспределенных = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КоличествоНераспределенныхПлатежей) Тогда
		ТекстПояснения = Нстр("ru='%1 шт. на %2 р.'");
		ТекстПояснения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПояснения,КоличествоНераспределенныхПлатежей,СуммаНераспределенных);				
	Иначе
		ТекстПояснения = Нстр("ru='Нет'");
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСуммуПлатежейПоНачислению(ТекНачисление)
	
	СуммаПлатежей = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СуммаПлатежейПоНачислениям.СуммаПлатежей КАК СуммаПлатежей
		|ИЗ
		|	РегистрСведений.СуммаПлатежейПоНачислениям КАК СуммаПлатежейПоНачислениям
		|ГДЕ
		|	СуммаПлатежейПоНачислениям.Начисление = &Начисление";

	Запрос.УстановитьПараметр("Начисление", ТекНачисление);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		СуммаПлатежей = Выборка.СуммаПлатежей;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СуммаПлатежей) Тогда
		//может быть Null
		СуммаПлатежей = 0;
	КонецЕсли;
	
	Возврат СуммаПлатежей;
	
КонецФункции

&НаСервере
Процедура ИзменитьОтборажениеПанелиОтборовНаСервере()
	
	Элементы.ОтображениеПанелиОтборов.Пометка = ОтображатьПанельОтборов;
	Элементы.ГруппаПравая.Видимость = ОтображатьПанельОтборов;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьРаспределениеНаСервере(ТекПлатеж)
	Запись = РегистрыСведений.СоответствиеНачисленийИПлатежей.СоздатьМенеджерЗаписи();
	Запись.Платеж = ТекПлатеж;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Запись.Удалить();
			
		ЗаполнитьИнформациюОПлатежахУчастников(Ложь);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьБезНачисленияНаСервере(МассивДокументов,ТребуетсяОбновление)
	
	СоответстиеТипов = Новый Соответствие;
	СоответстиеТипов.Вставить(Тип("ДокументСсылка.ПлатежВОплатуГосуслуг"),Документы.КвитанцияНаОплатуГосуслуг.ПустаяСсылка());
	СоответстиеТипов.Вставить(Тип("ДокументСсылка.ПлатежПодведомственному"),Документы.НачислениеОтПодведомственного.ПустаяСсылка());
	
	Для Каждого ТекДок Из МассивДокументов Цикл
		ЗаписьРС = РегистрыСведений.СоответствиеНачисленийИПлатежей.СоздатьМенеджерЗаписи();
		ЗаписьРС.Платеж = ТекДок;
		ЗаписьРС.Прочитать();
		ЕстьИзменения = Ложь;
		
		ЗначениеДляНачисления = СоответстиеТипов[ТипЗнч(ТекДок)];
		Если ЗаписьРС.Выбран() Тогда
			Если ЗаписьРС.Начисление <> ЗначениеДляНачисления Тогда
				ЗаписьРС.Начисление = ЗначениеДляНачисления;
				ЗаписьРС.ТребуетсяКвитирование = 0;//0-нет
				ЕстьИзменения = Истина;
			КонецЕсли;
		Иначе
			ЗаписьРС.Платеж = ТекДок;
			ЗаписьРС.Начисление = ЗначениеДляНачисления;
			ЕстьИзменения = Истина
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			ЗаписьРС.БанковскийИдентификаторПлатежаЗаполнен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДок,"БанковскийИдентификаторПлатежаЗаполнен");
			ЗаписьРС.Записать();
			ТребуетсяОбновление = Истина
		КонецЕсли;
	КонецЦикла;
	
	Если ТребуетсяОбновление Тогда
		ЗаполнитьИнформациюОПлатежахУчастников(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьРаспределениеБезНачислений(МассивДокументов,ТребуетсяОбновление)
	
	СоответстиеТипов = Новый Соответствие;
	СоответстиеТипов.Вставить(Тип("ДокументСсылка.ПлатежВОплатуГосуслуг"),Документы.КвитанцияНаОплатуГосуслуг.ПустаяСсылка());
	СоответстиеТипов.Вставить(Тип("ДокументСсылка.ПлатежПодведомственному"),Документы.НачислениеОтПодведомственного.ПустаяСсылка());
	
	Для Каждого ТекДок Из МассивДокументов Цикл
		ЗаписьРС = РегистрыСведений.СоответствиеНачисленийИПлатежей.СоздатьМенеджерЗаписи();
		ЗаписьРС.Платеж = ТекДок;
		ЗаписьРС.Прочитать();
		Если ЗаписьРС.Выбран() Тогда
			Если ЗаписьРС.Начисление = СоответстиеТипов[ТипЗнч(ТекДок)] Тогда
				ЗаписьРС.Удалить();
				ТребуетсяОбновление = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ТребуетсяОбновление Тогда
		ЗаполнитьИнформациюОПлатежахУчастников(Ложь);
	КонецЕсли;
	//Элементы.ПлатежиБезНачислений.Обновить();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВыделенныеДокументы()
	МассивДокументов = Новый Массив;
	
	Если ТипЗнч(ТекущийУчастник) = Тип("СправочникСсылка.Организации") Тогда
		ПроверяемыйТип = Тип("ДокументСсылка.ПлатежВОплатуГосуслуг");
	Иначе
		ПроверяемыйТип = Тип("ДокументСсылка.ПлатежПодведомственному");
	КонецЕсли;
	Для Каждого СтрТЧ Из Элементы.ПлатежиБезНачислений.ВыделенныеСтроки Цикл
		Если ТипЗнч(СтрТЧ) = ПроверяемыйТип Тогда
			МассивДокументов.Добавить(СтрТЧ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииОтборПлатежейБезНачисленияУстановитьОформлениеИОтбор()
	
	Элементы.ДекорацияБПНеРаспределен.ЦветФона = ?(ОтборПлатежейБезНачисления = "Не распределен",ЦветаСтиля.ФонУправляющегоПоля,ЦветаСтиля.ЦветФонаФормы);
	Элементы.ДекорацияБПБезНачисления.ЦветФона = ?(ОтборПлатежейБезНачисления = "Без начисления",ЦветаСтиля.ФонУправляющегоПоля,ЦветаСтиля.ЦветФонаФормы);
	Элементы.ДекорацияБПВсе.ЦветФона = ?(ОтборПлатежейБезНачисления = "",ЦветаСтиля.ФонУправляющегоПоля,ЦветаСтиля.ЦветФонаФормы);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПлатежиБезНачислений,"Начисление",ОтборПлатежейБезНачисления,,,ЗначениеЗаполнено(ОтборПлатежейБезНачисления));

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОтбораПлатежейУстановитьОформление()
	
	Элементы.ДекорацияОснНеРаспределен.ЦветФона = ?(ОтборПлатежей = "Не распределен",ЦветаСтиля.ФонУправляющегоПоля,ЦветаСтиля.ЦветФонаФормы);
	Элементы.ДекорацияОснБезНачисления.ЦветФона = ?(ОтборПлатежей = "Без начисления",ЦветаСтиля.ФонУправляющегоПоля,ЦветаСтиля.ЦветФонаФормы);
	Элементы.ДекорацияДопНеРаспределен.ЦветФона = ?(ОтборПлатежей = "Не распределен",ЦветаСтиля.ФонУправляющегоПоля,ЦветаСтиля.ЦветФонаФормы);
	Элементы.ДекорацияДопБезНачисления.ЦветФона = ?(ОтборПлатежей = "Без начисления",ЦветаСтиля.ФонУправляющегоПоля,ЦветаСтиля.ЦветФонаФормы);

	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОтбораПлатежейНаСервере()
	ПриИзмененииОтбораПлатежейУстановитьОформление();
	ОбновитьНаСервере();
КонецПроцедуры



#КонецОбласти






