
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("Версия") Тогда
		ВерсияФормата 		= Параметры.Версия;
	КонецЕсли; 
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	Иначе
		Организация = ПараметрыСеанса.ТекущаяОрганизация;
	КонецЕсли;
	
	ЗаполнитьСписокВерсийФормата();
	
	пТолькоПросмотр = Истина;		
	
	ОбновитьДатуУтверждения();
	ЗаполнитьДанныеРегистра();
	ЗаполнитьТаблицыРегистраРеквизитовАналитик();

	УстановитьУсловноеОформление();                                                                                 	
                                                                                                                                   
	Легенда = НСтр("ru='""ВОст"" - выгружать в остатках, ""ПустОст"" - допустимость пустых значений в остатках, ""ВОб"" - выгружать в оборотах, ""ПустОб"" - допустимость пустых значений в оборотах'"); 
	Легенда2 = НСтр("ru='""В"" - выгружать, ""О"" - обязательность'"); 	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ОбновитьОтображениеСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)	
	ОбновитьОтображениеСтраниц();	
КонецПроцедуры
 
&НаКлиенте
Процедура ВерсияФорматаПриИзменении(Элемент)
	ОбновитьОтображениеПриИзменении();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте                                                                         
Процедура СвернутьВсе(Команда)      

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаАналитикиПоСчетам Тогда

		СвернутьВсеСлужебный(ДеревоСчетов.ПолучитьЭлементы(), "ДеревоСчетов");		
		Для Каждого текСтрока Из ДеревоСчетов.ПолучитьЭлементы() Цикл
			Элементы.ДеревоСчетов.Свернуть(текСтрока.ПолучитьИдентификатор());
		КонецЦикла;
		
	Иначе
		СвернутьВсеСлужебный(РеквизитыАналитик.ПолучитьЭлементы(), "РеквизитыАналитик");		
		Для Каждого текСтрока Из РеквизитыАналитик.ПолучитьЭлементы() Цикл
			Элементы.РеквизитыАналитик.Свернуть(текСтрока.ПолучитьИдентификатор());
		КонецЦикла;   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаАналитикиПоСчетам Тогда
		РазвернутьВсеСлужебный(ДеревоСчетов.ПолучитьЭлементы(), "ДеревоСчетов");		
	Иначе		
		РазвернутьВсеСлужебный(РеквизитыАналитик.ПолучитьЭлементы(), "РеквизитыАналитик"); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьОтображениеПриИзменении()
	ОбновитьДатуУтверждения();
	ЗаполнитьДанныеРегистра();
	ЗаполнитьТаблицыРегистраРеквизитовАналитик();
	ОбновитьОтображениеСтраниц();	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьУсловноеОформление()    
	
	УсловноеОформление.Элементы.Очистить();

// пустые аналитики
	
#Область ДоступностьПустыхАналитик	

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.Представление1");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловногоОформления.Использование = Истина;		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках1");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах1");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПолныеПрава1");
	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.Представление2");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловногоОформления.Использование = Истина;		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках2");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах2");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПолныеПрава2");
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.Представление3");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловногоОформления.Использование = Истина;	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках3");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах3");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПолныеПрава3");
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.Представление4");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловногоОформления.Использование = Истина;		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках4");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах4");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПолныеПрава4");
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.Представление5");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках5");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах5");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПолныеПрава5");
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.Представление6");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементУсловногоОформления.Использование = Истина;	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках6");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах6");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПолныеПрава6");
	
#КонецОбласти

// флажки		
 
#Область ДоступностьГруппыАналитикиДляРедактирования

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);  	
	ГруппаОтбораИли =  ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;	
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.Представление1");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;	
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.ПолныеПрава1");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках1"); 
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах1"); 
	ЭлементУсловногоОформления.Использование = Истина;  

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);  	
	ГруппаОтбораИли =  ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;	
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.Представление2");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;	
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.ПолныеПрава2");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках2"); 
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах2"); 
	ЭлементУсловногоОформления.Использование = Истина;  

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);  	
	ГруппаОтбораИли =  ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;	
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.Представление3");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;	
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.ПолныеПрава3");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках3"); 
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах3"); 
	ЭлементУсловногоОформления.Использование = Истина;  

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);  	
	ГруппаОтбораИли =  ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;	
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.Представление4");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;	
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.ПолныеПрава4");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках4"); 
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах4"); 
	ЭлементУсловногоОформления.Использование = Истина;  

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);  	
	ГруппаОтбораИли =  ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;	
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.Представление5");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;	
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.ПолныеПрава5");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках5"); 
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах5"); 
	ЭлементУсловногоОформления.Использование = Истина;  

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);  	
	ГруппаОтбораИли =  ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;	
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.Представление6");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;	
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.ПолныеПрава6");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках6"); 
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах6");  
	ЭлементУсловногоОформления.Использование = Истина;       
	
#КонецОбласти

// цвет	

#Область ВыделениеЯчейкиСНедоступнымиФлагами

	пЦвет = ЦветаСтиля.ЦветФонаШапкиТаблицы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", пЦвет); 	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.ПолныеПрава1");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено; 
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПредставление1");	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках1");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах1");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПолныеПрава1");
	ЭлементУсловногоОформления.Использование = Истина;
	
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", пЦвет); 	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.ПолныеПрава2");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено; 
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПредставление2");	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках2");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах2");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПолныеПрава2");
	ЭлементУсловногоОформления.Использование = Истина;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", пЦвет); 	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.ПолныеПрава3");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено; 
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПредставление3");		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках3");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах3");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПолныеПрава3");
	ЭлементУсловногоОформления.Использование = Истина;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", пЦвет); 	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.ПолныеПрава4");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено; 
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПредставление4");		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках4");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах4");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПолныеПрава4");
	ЭлементУсловногоОформления.Использование = Истина;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", пЦвет); 	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.ПолныеПрава5");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено; 
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПредставление5");		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах5");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПолныеПрава5");
	ЭлементУсловногоОформления.Использование = Истина;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", пЦвет); 	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоСчетов.ПолныеПрава6");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено; 
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПредставление6");	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОстатках6");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовВОборотах6");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДеревоСчетовПолныеПрава6");
	ЭлементУсловногоОформления.Использование = Истина;

#КонецОбласти

#Область Реквизиты

// Используется

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();  	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("РеквизитыАналитик.ПолныеПрава");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("РеквизитыАналитикИспользуется");	
	                                                
	ЭлементУсловногоОформления.Использование = Истина;  

// Обязательный
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();  	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	ГруппаОтбораИли =  ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;		
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("РеквизитыАналитик.Используется");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;		
	ОтборЭлемента = ГруппаОтбораИли.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("РеквизитыАналитик.ПолныеПрава");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("РеквизитыАналитикОбязательный");	
	ЭлементУсловногоОформления.Использование = Истина; 
	
// Шрифт	

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();  	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина)); 	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("РеквизитыАналитик.Реквизит");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("РеквизитыАналитик");	
	ЭлементУсловногоОформления.Использование = Истина;
	
// Цвет	
	пЦвет = ЦветаСтиля.ЦветФонаШапкиТаблицы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", пЦвет); 	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("РеквизитыАналитик.ПолныеПрава");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Заполнено;		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("РеквизитыАналитик");	 
	ЭлементУсловногоОформления.Использование = Истина;
	
#КонецОбласти	

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсеСлужебный(Ветка, ИмяЭлемента)
	
	Для Каждого текСтрока Из Ветка Цикл
		
		Если Не текСтрока.ПолучитьЭлементы().Количество() = 0 Тогда
			
			РазвернутьВсеСлужебный(текСтрока.ПолучитьЭлементы(), ИмяЭлемента);
			
		КонецЕсли;
		
		Элементы[ИмяЭлемента].Развернуть(текСтрока.ПолучитьИдентификатор(), Истина);
		
	КонецЦикла;			
			
КонецПроцедуры		

&НаКлиенте
Процедура СвернутьВсеСлужебный(Ветка, ИмяЭлемента);
	
	Для Каждого текСтрока Из Ветка Цикл     
		
		Если Не текСтрока.ПолучитьЭлементы().Количество() = 0 Тогда
			
			СвернутьВсеСлужебный(текСтрока.ПолучитьЭлементы(), ИмяЭлемента);
			
		КонецЕсли;
		
		Элементы[ИмяЭлемента].Свернуть(текСтрока.ПолучитьИдентификатор());   
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокВерсийФормата()
	
	Элементы.ВерсияФормата.СписокВыбора.Очистить(); 
	ВерсияФормата = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиВыгрузкиАналитикМСД.Версия КАК Версия
		|ПОМЕСТИТЬ ВТ_ВерсииРегистра
		|ИЗ
		|	РегистрСведений.НастройкиВыгрузкиАналитикМСД КАК НастройкиВыгрузкиАналитикМСД
		|ГДЕ
		|	НастройкиВыгрузкиАналитикМСД.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкиВыгрузкиАналитикМСД.Версия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыВерсийЕФСрезПоследних.Версия КАК Версия,
		|	СтатусыВерсийЕФСрезПоследних.Статус = &СтатусУтвержден КАК Утвержден
		|ИЗ
		|	РегистрСведений.СтатусыВерсийЕФ.СрезПоследних(
		|			,
		|			Версия В
		|					(ВЫБРАТЬ
		|						ВТ_ВерсииРегистра.Версия КАК Версия
		|					ИЗ
		|						ВТ_ВерсииРегистра КАК ВТ_ВерсииРегистра)
		|				И Организация = &Организация) КАК СтатусыВерсийЕФСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Утвержден УБЫВ,
		|	СтатусыВерсийЕФСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("СтатусУтвержден", Перечисления.СтатусыВерсийЕФ.Утвержден);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	НеобходимоЗаполнениеВерсии = НЕ ЗначениеЗаполнено(ВерсияФормата);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Если НеобходимоЗаполнениеВерсии Тогда
			ВерсияФормата = ВыборкаДетальныеЗаписи.Версия;
			НеобходимоЗаполнениеВерсии = Ложь;
		КонецЕсли;			
		Элементы.ВерсияФормата.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Версия);		            
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДатуУтверждения()
	
	ДатаУтверждения = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыВерсийЕФСрезПоследних.ДатаУтверждения КАК ДатаУтверждения
		|ИЗ
		|	РегистрСведений.СтатусыВерсийЕФ.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И Версия = &ВерсияФормата) КАК СтатусыВерсийЕФСрезПоследних";
	
	Запрос.УстановитьПараметр("ВерсияФормата", ВерсияФормата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДатаУтверждения = ВыборкаДетальныеЗаписи.ДатаУтверждения;
	КонецЕсли;
		
КонецПроцедуры	

#Область АналитикаПоСчетам

&НаСервере
Процедура СформироватьДеревоСчетов()

#Область Запрос
	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	АРТ_НастройкиВыгрузкиАналитик.Версия КАК Версия,
						  |	АРТ_НастройкиВыгрузкиАналитик.Организация КАК Организация,
						  |	АРТ_НастройкиВыгрузкиАналитик.Счет КАК Счет,
						  |	АРТ_НастройкиВыгрузкиАналитик.Аналитика1 КАК Аналитика1,
						  |	АРТ_НастройкиВыгрузкиАналитик.Аналитика2 КАК Аналитика2,
						  |	АРТ_НастройкиВыгрузкиАналитик.Аналитика3 КАК Аналитика3,
						  |	АРТ_НастройкиВыгрузкиАналитик.Аналитика4 КАК Аналитика4,
						  |	АРТ_НастройкиВыгрузкиАналитик.Аналитика5 КАК Аналитика5,
						  |	АРТ_НастройкиВыгрузкиАналитик.Аналитика6 КАК Аналитика6,
						  |	АРТ_НастройкиВыгрузкиАналитик.ДопускаетсяПустоеЗначениеВОстатках1 КАК ДопускаетсяПустоеЗначениеВОстатках1,
						  |	АРТ_НастройкиВыгрузкиАналитик.ДопускаетсяПустоеЗначениеВОстатках2 КАК ДопускаетсяПустоеЗначениеВОстатках2,
						  |	АРТ_НастройкиВыгрузкиАналитик.ДопускаетсяПустоеЗначениеВОстатках3 КАК ДопускаетсяПустоеЗначениеВОстатках3,
						  |	АРТ_НастройкиВыгрузкиАналитик.ДопускаетсяПустоеЗначениеВОстатках4 КАК ДопускаетсяПустоеЗначениеВОстатках4,
						  |	АРТ_НастройкиВыгрузкиАналитик.ДопускаетсяПустоеЗначениеВОстатках5 КАК ДопускаетсяПустоеЗначениеВОстатках5,
						  |	АРТ_НастройкиВыгрузкиАналитик.ДопускаетсяПустоеЗначениеВОстатках6 КАК ДопускаетсяПустоеЗначениеВОстатках6,
						  |	АРТ_НастройкиВыгрузкиАналитик.ДопускаетсяПустоеЗначениеВОборотах1 КАК ДопускаетсяПустоеЗначениеВОборотах1,
						  |	АРТ_НастройкиВыгрузкиАналитик.ДопускаетсяПустоеЗначениеВОборотах2 КАК ДопускаетсяПустоеЗначениеВОборотах2,
						  |	АРТ_НастройкиВыгрузкиАналитик.ДопускаетсяПустоеЗначениеВОборотах3 КАК ДопускаетсяПустоеЗначениеВОборотах3,
						  |	АРТ_НастройкиВыгрузкиАналитик.ДопускаетсяПустоеЗначениеВОборотах4 КАК ДопускаетсяПустоеЗначениеВОборотах4,
						  |	АРТ_НастройкиВыгрузкиАналитик.ДопускаетсяПустоеЗначениеВОборотах5 КАК ДопускаетсяПустоеЗначениеВОборотах5,
						  |	АРТ_НастройкиВыгрузкиАналитик.ДопускаетсяПустоеЗначениеВОборотах6 КАК ДопускаетсяПустоеЗначениеВОборотах6,
						  |	АРТ_НастройкиВыгрузкиАналитик.ВОстатках1 КАК ВОстатках1,
						  |	АРТ_НастройкиВыгрузкиАналитик.ВОстатках2 КАК ВОстатках2,
						  |	АРТ_НастройкиВыгрузкиАналитик.ВОстатках3 КАК ВОстатках3,
						  |	АРТ_НастройкиВыгрузкиАналитик.ВОстатках4 КАК ВОстатках4,
						  |	АРТ_НастройкиВыгрузкиАналитик.ВОстатках5 КАК ВОстатках5,
						  |	АРТ_НастройкиВыгрузкиАналитик.ВОстатках6 КАК ВОстатках6,
						  |	АРТ_НастройкиВыгрузкиАналитик.ВОборотах1 КАК ВОборотах1,
						  |	АРТ_НастройкиВыгрузкиАналитик.ВОборотах2 КАК ВОборотах2,
						  |	АРТ_НастройкиВыгрузкиАналитик.ВОборотах3 КАК ВОборотах3,
						  |	АРТ_НастройкиВыгрузкиАналитик.ВОборотах4 КАК ВОборотах4,
						  |	АРТ_НастройкиВыгрузкиАналитик.ВОборотах5 КАК ВОборотах5,
						  |	АРТ_НастройкиВыгрузкиАналитик.ВОборотах6 КАК ВОборотах6,
						  |	АРТ_НастройкиВыгрузкиАналитик.ПолныеПрава1 КАК ПолныеПрава1,
						  |	АРТ_НастройкиВыгрузкиАналитик.ПолныеПрава2 КАК ПолныеПрава2,
						  |	АРТ_НастройкиВыгрузкиАналитик.ПолныеПрава3 КАК ПолныеПрава3,
						  |	АРТ_НастройкиВыгрузкиАналитик.ПолныеПрава4 КАК ПолныеПрава4,
						  |	АРТ_НастройкиВыгрузкиАналитик.ПолныеПрава5 КАК ПолныеПрава5,
						  |	АРТ_НастройкиВыгрузкиАналитик.ПолныеПрава6 КАК ПолныеПрава6,
	                      |	АРТ_НастройкиВыгрузкиАналитик.Валютный КАК Валютный,
	                      |	АРТ_НастройкиВыгрузкиАналитик.УчетПоКПС КАК УчетПоКПС,
	                      |	АРТ_НастройкиВыгрузкиАналитик.УчетПоКЭК КАК УчетПоКЭК
						  |ПОМЕСТИТЬ ВТДанныеРегистра
						  |ИЗ
						  |	&ДанныеРегистра КАК АРТ_НастройкиВыгрузкиАналитик
						  |
						  |ИНДЕКСИРОВАТЬ ПО
						  |	Счет
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ
						  |	ВТДанныеРегистра.Организация КАК Организация,
						  |	ЕПСБУ.Ссылка КАК Счет,
						  |	ЕПСБУ.Родитель КАК тРодитель,
						  |	ЕПСБУ.Порядок КАК Порядок,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Счет, """") КАК Счет_Строкой,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика1, """") КАК Аналитика1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика2, """") КАК Аналитика2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика3, """") КАК Аналитика3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика4, """") КАК Аналитика4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика5, """") КАК Аналитика5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика6, """") КАК Аналитика6,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОстатках1, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОстатках1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОстатках2, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОстатках2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОстатках3, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОстатках3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОстатках4, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОстатках4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОстатках5, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОстатках5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОстатках6, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОстатках6,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОборотах1, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОборотах1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОборотах2, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОборотах2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОборотах3, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОборотах3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОборотах4, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОборотах4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОборотах5, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОборотах5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОборотах6, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОборотах6,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОстатках1, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОстатках1_1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОстатках2, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОстатках1_2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОстатках3, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОстатках1_3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОстатках4, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОстатках1_4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОстатках5, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОстатках1_5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОстатках6, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОстатках1_6,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОборотах1, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОборотах1_1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОборотах2, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОборотах1_2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОборотах3, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОборотах1_3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОборотах4, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОборотах1_4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОборотах5, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОборотах1_5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ДопускаетсяПустоеЗначениеВОборотах6, ЛОЖЬ) КАК ДопускаетсяПустоеЗначениеВОборотах1_6,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОстатках1, ЛОЖЬ) КАК ВОстатках1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОстатках2, ЛОЖЬ) КАК ВОстатках2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОстатках3, ЛОЖЬ) КАК ВОстатках3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОстатках4, ЛОЖЬ) КАК ВОстатках4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОстатках5, ЛОЖЬ) КАК ВОстатках5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОстатках6, ЛОЖЬ) КАК ВОстатках6,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОборотах1, ЛОЖЬ) КАК ВОборотах1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОборотах2, ЛОЖЬ) КАК ВОборотах2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОборотах3, ЛОЖЬ) КАК ВОборотах3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОборотах4, ЛОЖЬ) КАК ВОборотах4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОборотах5, ЛОЖЬ) КАК ВОборотах5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОборотах6, ЛОЖЬ) КАК ВОборотах6,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ПолныеПрава1, ЛОЖЬ) КАК ПолныеПрава1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ПолныеПрава2, ЛОЖЬ) КАК ПолныеПрава2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ПолныеПрава3, ЛОЖЬ) КАК ПолныеПрава3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ПолныеПрава4, ЛОЖЬ) КАК ПолныеПрава4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ПолныеПрава5, ЛОЖЬ) КАК ПолныеПрава5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ПолныеПрава6, ЛОЖЬ) КАК ПолныеПрава6,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОстатках1, ЛОЖЬ) КАК ВОстатках1_1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОстатках2, ЛОЖЬ) КАК ВОстатках1_2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОстатках3, ЛОЖЬ) КАК ВОстатках1_3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОстатках4, ЛОЖЬ) КАК ВОстатках1_4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОстатках5, ЛОЖЬ) КАК ВОстатках1_5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОстатках6, ЛОЖЬ) КАК ВОстатках1_6,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОборотах1, ЛОЖЬ) КАК ВОборотах1_1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОборотах2, ЛОЖЬ) КАК ВОборотах1_2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОборотах3, ЛОЖЬ) КАК ВОборотах1_3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОборотах4, ЛОЖЬ) КАК ВОборотах1_4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОборотах5, ЛОЖЬ) КАК ВОборотах1_5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ВОборотах6, ЛОЖЬ) КАК ВОборотах1_6,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ПолныеПрава1, ЛОЖЬ) КАК ПолныеПрава1_1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ПолныеПрава2, ЛОЖЬ) КАК ПолныеПрава1_2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ПолныеПрава3, ЛОЖЬ) КАК ПолныеПрава1_3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ПолныеПрава4, ЛОЖЬ) КАК ПолныеПрава1_4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ПолныеПрава5, ЛОЖЬ) КАК ПолныеПрава1_5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.ПолныеПрава6, ЛОЖЬ) КАК ПолныеПрава1_6,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика1, """") КАК Представление1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика2, """") КАК Представление2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика3, """") КАК Представление3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика4, """") КАК Представление4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика5, """") КАК Представление5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика6, """") КАК Представление6,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика1, """") КАК Представление1_1,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика2, """") КАК Представление1_2,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика3, """") КАК Представление1_3,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика4, """") КАК Представление1_4,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика5, """") КАК Представление1_5,
						  |	ЕСТЬNULL(ВТДанныеРегистра.Аналитика6, """") КАК Представление1_6,
						  |	ВТДанныеРегистра.Валютный КАК Валютный,
	                      |	ВТДанныеРегистра.УчетПоКПС КАК УчетПоКПС,
	                      |	ВТДанныеРегистра.УчетПоКЭК КАК УчетПоКЭК
						  |ИЗ
						  |	ПланСчетов.ЕПСБУ КАК ЕПСБУ
						  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеРегистра КАК ВТДанныеРегистра
						  |		ПО ЕПСБУ.Код = ВТДанныеРегистра.Счет
						  |ГДЕ
						  |	ЕПСБУ.ДатаНачалаДействия <= &Дата
						  |	И НЕ(НЕ ЕПСБУ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
						  |				И ЕПСБУ.ДатаОкончанияДействия < &Дата)
						  |
						  |УПОРЯДОЧИТЬ ПО
						  |	Порядок
						  |ИТОГИ
						  |	МАКСИМУМ(ДопускаетсяПустоеЗначениеВОстатках1),
						  |	МАКСИМУМ(ДопускаетсяПустоеЗначениеВОстатках2),
						  |	МАКСИМУМ(ДопускаетсяПустоеЗначениеВОстатках3),
						  |	МАКСИМУМ(ДопускаетсяПустоеЗначениеВОстатках4),
						  |	МАКСИМУМ(ДопускаетсяПустоеЗначениеВОстатках5),
						  |	МАКСИМУМ(ДопускаетсяПустоеЗначениеВОстатках6),
						  |	МАКСИМУМ(ДопускаетсяПустоеЗначениеВОборотах1),
						  |	МАКСИМУМ(ДопускаетсяПустоеЗначениеВОборотах2),
						  |	МАКСИМУМ(ДопускаетсяПустоеЗначениеВОборотах3),
						  |	МАКСИМУМ(ДопускаетсяПустоеЗначениеВОборотах4),
						  |	МАКСИМУМ(ДопускаетсяПустоеЗначениеВОборотах5),
						  |	МАКСИМУМ(ДопускаетсяПустоеЗначениеВОборотах6),
						  |	МАКСИМУМ(ВОстатках1),
						  |	МАКСИМУМ(ВОстатках2),
						  |	МАКСИМУМ(ВОстатках3),
						  |	МАКСИМУМ(ВОстатках4),
						  |	МАКСИМУМ(ВОстатках5),
						  |	МАКСИМУМ(ВОстатках6),
						  |	МАКСИМУМ(ВОборотах1),
						  |	МАКСИМУМ(ВОборотах2),
						  |	МАКСИМУМ(ВОборотах3),
						  |	МАКСИМУМ(ВОборотах4),
						  |	МАКСИМУМ(ВОборотах5),
						  |	МАКСИМУМ(ВОборотах6),
						  |	МАКСИМУМ(ПолныеПрава1),
						  |	МАКСИМУМ(ПолныеПрава2),
						  |	МАКСИМУМ(ПолныеПрава3),
						  |	МАКСИМУМ(ПолныеПрава4),
						  |	МАКСИМУМ(ПолныеПрава5),
						  |	МАКСИМУМ(ПолныеПрава6),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВОстатках1_1),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВОстатках1_2),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВОстатках1_3),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВОстатках1_4),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВОстатках1_5),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВОстатках1_6),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВОборотах1_1),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВОборотах1_2),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВОборотах1_3),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВОборотах1_4),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВОборотах1_5),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВОборотах1_6),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолныеПрава1_1),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолныеПрава1_2),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолныеПрава1_3),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолныеПрава1_4),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолныеПрава1_5),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолныеПрава1_6),
						  |	МАКСИМУМ(Представление1),
						  |	МАКСИМУМ(Представление2),
						  |	МАКСИМУМ(Представление3),
						  |	МАКСИМУМ(Представление4),
						  |	МАКСИМУМ(Представление5),
						  |	МАКСИМУМ(Представление6),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Представление1_1),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Представление1_2),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Представление1_3),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Представление1_4),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Представление1_5),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Представление1_6),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДопускаетсяПустоеЗначениеВОстатках1_1),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДопускаетсяПустоеЗначениеВОстатках1_2),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДопускаетсяПустоеЗначениеВОстатках1_3),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДопускаетсяПустоеЗначениеВОстатках1_4),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДопускаетсяПустоеЗначениеВОстатках1_5),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДопускаетсяПустоеЗначениеВОстатках1_6),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДопускаетсяПустоеЗначениеВОборотах1_1),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДопускаетсяПустоеЗначениеВОборотах1_2),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДопускаетсяПустоеЗначениеВОборотах1_3),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДопускаетсяПустоеЗначениеВОборотах1_4),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДопускаетсяПустоеЗначениеВОборотах1_5),
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДопускаетсяПустоеЗначениеВОборотах1_6),
	                      |	МАКСИМУМ(Валютный),
	                      |	МАКСИМУМ(УчетПоКПС),
	                      |	МАКСИМУМ(УчетПоКЭК)
						  |ПО
						  |	Счет ИЕРАРХИЯ");
#КонецОбласти
     
	
	Запрос.УстановитьПараметр("ДанныеРегистра", ДанныеРегистра.Выгрузить()); 
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());

	
	тДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	новДерево = РеквизитФормыВЗначение("ДеревоСчетов");
	новДерево.Строки.Очистить();    
	Для Каждого текСтрока Из тДерево.Строки Цикл  
		
		новСтрока = новДерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(новСтрока, текСтрока,,"ДопускаетсяПустоеЗначениеВОстатках1,ДопускаетсяПустоеЗначениеВОстатках2,ДопускаетсяПустоеЗначениеВОстатках3,ДопускаетсяПустоеЗначениеВОстатках4,ДопускаетсяПустоеЗначениеВОстатках5,ДопускаетсяПустоеЗначениеВОстатках6,
															|ДопускаетсяПустоеЗначениеВОборотах1,ДопускаетсяПустоеЗначениеВОборотах2,ДопускаетсяПустоеЗначениеВОборотах3,ДопускаетсяПустоеЗначениеВОборотах4,ДопускаетсяПустоеЗначениеВОборотах5,ДопускаетсяПустоеЗначениеВОборотах6,		
															|ВОстатках1,ВОстатках2,ВОстатках3,ВОстатках4,ВОстатках5,ВОстатках6,
															|ВОборотах1,ВОборотах2,ВОборотах3,ВОборотах4,ВОборотах5,ВОборотах6, 																				
															|ПолныеПрава1,ПолныеПрава2,ПолныеПрава3,ПолныеПрава4,ПолныеПрава5,ПолныеПрава6,															
															|Представление1,Представление2,Представление3,Представление4,Представление5,Представление6");
				Для НН = 1 По 6 Цикл

					Если текСтрока["Представление1_" + НН] = 1 Тогда
						новСтрока["Представление" + НН] = текСтрока["Представление" + НН]; 
						
						Если текСтрока["ДопускаетсяПустоеЗначениеВОстатках1_" + НН] = 1 Тогда
							новСтрока["ДопускаетсяПустоеЗначениеВОстатках" + НН] = текСтрока["ДопускаетсяПустоеЗначениеВОстатках" + НН];
						Иначе
							новСтрока["ДопускаетсяПустоеЗначениеВОстатках" + НН] = 2;					
						КонецЕсли;  
						Если текСтрока["ДопускаетсяПустоеЗначениеВОборотах1_" + НН] = 1 Тогда
							новСтрока["ДопускаетсяПустоеЗначениеВОборотах" + НН] = текСтрока["ДопускаетсяПустоеЗначениеВОборотах" + НН];
						Иначе
							новСтрока["ДопускаетсяПустоеЗначениеВОборотах" + НН] = 2;					
						КонецЕсли;
						
						Если текСтрока["ВОстатках1_" + НН] = 1 Тогда
							новСтрока["ВОстатках" + НН] = текСтрока["ВОстатках" + НН];
						Иначе
							новСтрока["ВОстатках" + НН] = 2;					
						КонецЕсли;
						
						Если текСтрока["ВОборотах1_" + НН] = 1 Тогда
							новСтрока["ВОборотах" + НН] = текСтрока["ВОборотах" + НН];
						Иначе
							новСтрока["ВОборотах" + НН] = 2;					
						КонецЕсли;							
						
						Если Не ПустаяСтрока(текСтрока["Представление" + НН]) И новСтрока["ВОстатках" + НН] = 0 Тогда
							новСтрока["ДопускаетсяПустоеЗначениеВОстатках" + НН] = 1;
						КонецЕсли;								

						Если Не ПустаяСтрока(текСтрока["Представление" + НН]) И новСтрока["ВОборотах" + НН] = 0 Тогда
							новСтрока["ДопускаетсяПустоеЗначениеВОборотах" + НН] = 1;
						КонецЕсли;
						
						Если текСтрока["ПолныеПрава1_" + НН] = 1 Тогда
							новСтрока["ПолныеПрава" + НН] = текСтрока["ПолныеПрава" + НН];
						Иначе
							новСтрока["ПолныеПрава" + НН] = 2;					
						КонецЕсли;
						
					КонецЕсли;
			
			КонецЦикла;
        Если Не (текСтрока.Строки.Количество() = 1 И ЗначениеЗаполнено(текСтрока.Строки[0].Счет_Строкой)) Тогда
			ЗаполнитьВетку(новСтрока, текСтрока);   
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(новДерево, "ДеревоСчетов");
	
	
КонецПроцедуры                         

&НаСервере
Процедура ЗаполнитьВетку(новВетка, Ветка)
	
	Для Каждого текСтрока Из Ветка.Строки Цикл
		
		Если текСтрока.Счет = Ветка.Счет И текСтрока.тРодитель = Ветка.тРодитель И Не ЗначениеЗаполнено(текСтрока.Счет_Строкой) Тогда 
			Продолжить;
		КонецЕсли;
			
		новСтрока = новВетка.Строки.Добавить();   

		ЗаполнитьЗначенияСвойств(новСтрока, текСтрока,,"ДопускаетсяПустоеЗначениеВОстатках1,ДопускаетсяПустоеЗначениеВОстатках2,ДопускаетсяПустоеЗначениеВОстатках3,ДопускаетсяПустоеЗначениеВОстатках4,ДопускаетсяПустоеЗначениеВОстатках5,ДопускаетсяПустоеЗначениеВОстатках6,
															|ДопускаетсяПустоеЗначениеВОборотах1,ДопускаетсяПустоеЗначениеВОборотах2,ДопускаетсяПустоеЗначениеВОборотах3,ДопускаетсяПустоеЗначениеВОборотах4,ДопускаетсяПустоеЗначениеВОборотах5,ДопускаетсяПустоеЗначениеВОборотах6,
															|ВОстатках1,ВОстатках2,ВОстатках3,ВОстатках4,ВОстатках5,ВОстатках6,
															|ВОборотах1,ВОборотах2,ВОборотах3,ВОборотах4,ВОборотах5,ВОборотах6, 
															|ПолныеПрава1,ПолныеПрава2,ПолныеПрава3,ПолныеПрава4,ПолныеПрава5,ПолныеПрава6,																														
															|Представление1,Представление2,Представление3,Представление4,Представление5,Представление6");
			
			Для НН = 1 По 6 Цикл
				
				
				Если текСтрока["Представление1_" + НН] = 1 Тогда
					новСтрока["Представление" + НН] = текСтрока["Представление" + НН];
					
					Если текСтрока["ДопускаетсяПустоеЗначениеВОстатках1_" + НН] = 1 Тогда
						новСтрока["ДопускаетсяПустоеЗначениеВОстатках" + НН] = текСтрока["ДопускаетсяПустоеЗначениеВОстатках" + НН];
					Иначе
						новСтрока["ДопускаетсяПустоеЗначениеВОстатках" + НН] = 2;					
					КонецЕсли;    

					Если текСтрока["ДопускаетсяПустоеЗначениеВОборотах1_" + НН] = 1 Тогда
						новСтрока["ДопускаетсяПустоеЗначениеВОборотах" + НН] = текСтрока["ДопускаетсяПустоеЗначениеВОборотах" + НН];
					Иначе
						новСтрока["ДопускаетсяПустоеЗначениеВОборотах" + НН] = 2;					
					КонецЕсли;   
					
					Если текСтрока["ВОстатках1_" + НН] = 1 Тогда
						новСтрока["ВОстатках" + НН] = текСтрока["ВОстатках" + НН];
					Иначе
						новСтрока["ВОстатках" + НН] = 2;					
					КонецЕсли;
					
					Если текСтрока["ВОборотах1_" + НН] = 1 Тогда
						новСтрока["ВОборотах" + НН] = текСтрока["ВОборотах" + НН];
					Иначе
						новСтрока["ВОборотах" + НН] = 2;					
					КонецЕсли;									
					
					Если Не ПустаяСтрока(текСтрока["Представление" + НН]) И новСтрока["ВОстатках" + НН] = 0 Тогда
						новСтрока["ДопускаетсяПустоеЗначениеВОстатках" + НН] = 1;
					КонецЕсли;								

					Если Не ПустаяСтрока(текСтрока["Представление" + НН]) И новСтрока["ВОборотах" + НН] = 0 Тогда
						новСтрока["ДопускаетсяПустоеЗначениеВОборотах" + НН] = 1;
					КонецЕсли;	
					
					Если текСтрока["ПолныеПрава1_" + НН] = 1 Тогда
						новСтрока["ПолныеПрава" + НН] = текСтрока["ПолныеПрава" + НН];
					Иначе
						новСтрока["ПолныеПрава" + НН] = 2;					
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;	
        Если Не (текСтрока.Строки.Количество() = 1 И ЗначениеЗаполнено(текСтрока.Строки[0].Счет_Строкой)) Тогда
			ЗаполнитьВетку(новСтрока, текСтрока);   
		КонецЕсли;
		
	КонецЦикла;                                      
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеРегистра()    
		
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	НастройкиВыгрузкиАналитикМСД.Версия КАК Версия,
	                      |	НастройкиВыгрузкиАналитикМСД.Организация КАК Организация,
	                      |	НастройкиВыгрузкиАналитикМСД.Счет КАК Счет,
	                      |	ЕСТЬNULL(АналитикиМСД.Представление, НастройкиВыгрузкиАналитикМСД.Аналитика1) КАК Аналитика1,
	                      |	ЕСТЬNULL(АналитикиМСД1.Представление, НастройкиВыгрузкиАналитикМСД.Аналитика2) КАК Аналитика2,
	                      |	ЕСТЬNULL(АналитикиМСД2.Представление, НастройкиВыгрузкиАналитикМСД.Аналитика3) КАК Аналитика3,
	                      |	ЕСТЬNULL(АналитикиМСД3.Представление, НастройкиВыгрузкиАналитикМСД.Аналитика4) КАК Аналитика4,
	                      |	ЕСТЬNULL(АналитикиМСД4.Представление, НастройкиВыгрузкиАналитикМСД.Аналитика5) КАК Аналитика5,
	                      |	ЕСТЬNULL(АналитикиМСД5.Представление, НастройкиВыгрузкиАналитикМСД.Аналитика6) КАК Аналитика6,
	                      |	НастройкиВыгрузкиАналитикМСД.ВОстатках1 КАК ВОстатках1,
	                      |	НастройкиВыгрузкиАналитикМСД.ВОстатках2 КАК ВОстатках2,
	                      |	НастройкиВыгрузкиАналитикМСД.ВОстатках3 КАК ВОстатках3,
	                      |	НастройкиВыгрузкиАналитикМСД.ВОстатках4 КАК ВОстатках4,
	                      |	НастройкиВыгрузкиАналитикМСД.ВОстатках5 КАК ВОстатках5,
	                      |	НастройкиВыгрузкиАналитикМСД.ВОстатках6 КАК ВОстатках6,
	                      |	НастройкиВыгрузкиАналитикМСД.ВОборотах1 КАК ВОборотах1,
	                      |	НастройкиВыгрузкиАналитикМСД.ВОборотах2 КАК ВОборотах2,
	                      |	НастройкиВыгрузкиАналитикМСД.ВОборотах3 КАК ВОборотах3,
	                      |	НастройкиВыгрузкиАналитикМСД.ВОборотах4 КАК ВОборотах4,
	                      |	НастройкиВыгрузкиАналитикМСД.ВОборотах5 КАК ВОборотах5,
	                      |	НастройкиВыгрузкиАналитикМСД.ВОборотах6 КАК ВОборотах6,
	                      |	НастройкиВыгрузкиАналитикМСД.ПолныеПрава1 КАК ПолныеПрава1,
	                      |	НастройкиВыгрузкиАналитикМСД.ПолныеПрава2 КАК ПолныеПрава2,
	                      |	НастройкиВыгрузкиАналитикМСД.ПолныеПрава3 КАК ПолныеПрава3,
	                      |	НастройкиВыгрузкиАналитикМСД.ПолныеПрава4 КАК ПолныеПрава4,
	                      |	НастройкиВыгрузкиАналитикМСД.ПолныеПрава5 КАК ПолныеПрава5,
	                      |	НастройкиВыгрузкиАналитикМСД.ПолныеПрава6 КАК ПолныеПрава6,
	                      |	НастройкиВыгрузкиАналитикМСД.Валютный КАК Валютный,
	                      |	НастройкиВыгрузкиАналитикМСД.УчетПоКПС КАК УчетПоКПС,
	                      |	НастройкиВыгрузкиАналитикМСД.УчетПоКЭК КАК УчетПоКЭК,
	                      |	НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках1 КАК ДопускаетсяПустоеЗначениеВОстатках1,
	                      |	НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках2 КАК ДопускаетсяПустоеЗначениеВОстатках2,
	                      |	НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках3 КАК ДопускаетсяПустоеЗначениеВОстатках3,
	                      |	НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках4 КАК ДопускаетсяПустоеЗначениеВОстатках4,
	                      |	НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках5 КАК ДопускаетсяПустоеЗначениеВОстатках5,
	                      |	НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках6 КАК ДопускаетсяПустоеЗначениеВОстатках6,
	                      |	НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах1 КАК ДопускаетсяПустоеЗначениеВОборотах1,
	                      |	НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах2 КАК ДопускаетсяПустоеЗначениеВОборотах2,
	                      |	НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах3 КАК ДопускаетсяПустоеЗначениеВОборотах3,
	                      |	НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах4 КАК ДопускаетсяПустоеЗначениеВОборотах4,
	                      |	НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах5 КАК ДопускаетсяПустоеЗначениеВОборотах5,
	                      |	НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах6 КАК ДопускаетсяПустоеЗначениеВОборотах6
	                      |ИЗ
	                      |	РегистрСведений.НастройкиВыгрузкиАналитикМСД КАК НастройкиВыгрузкиАналитикМСД
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикиМСД КАК АналитикиМСД
	                      |		ПО НастройкиВыгрузкиАналитикМСД.Аналитика1 = АналитикиМСД.ИмяАналитики
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикиМСД КАК АналитикиМСД1
	                      |		ПО НастройкиВыгрузкиАналитикМСД.Аналитика2 = АналитикиМСД1.ИмяАналитики
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикиМСД КАК АналитикиМСД2
	                      |		ПО НастройкиВыгрузкиАналитикМСД.Аналитика3 = АналитикиМСД2.ИмяАналитики
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикиМСД КАК АналитикиМСД3
	                      |		ПО НастройкиВыгрузкиАналитикМСД.Аналитика4 = АналитикиМСД3.ИмяАналитики
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикиМСД КАК АналитикиМСД4
	                      |		ПО НастройкиВыгрузкиАналитикМСД.Аналитика5 = АналитикиМСД4.ИмяАналитики
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикиМСД КАК АналитикиМСД5
	                      |		ПО НастройкиВыгрузкиАналитикМСД.Аналитика6 = АналитикиМСД5.ИмяАналитики
	                      |ГДЕ
	                      |	НастройкиВыгрузкиАналитикМСД.Версия = &ВерсияФормата
	                      |	И НастройкиВыгрузкиАналитикМСД.Организация = &Организация");  
	
	Запрос.УстановитьПараметр("ВерсияФормата", ВерсияФормата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ДанныеРегистра.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры  

#КонецОбласти

#Область РеквизитыАналитик

&НаСервере
Процедура ЗаполнитьТаблицыРегистраРеквизитовАналитик()
	
	ДанныеРегистраРеквизитыАналитик.Очистить();  
	ВыборкаРегистров = ПолучитьВыборкуРегистровИРеквизитов();
	Пока ВыборкаРегистров.Следующий() Цикл		
		Выборка = ВыборкаРегистров.Выбрать();
		Пока Выборка.Следующий() Цикл  
			новСтрока = ДанныеРегистраРеквизитыАналитик.Добавить();
			ЗаполнитьЗначенияСвойств(новСтрока, Выборка);			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры     

&НаСервере
Функция ПолучитьВыборкуРегистровИРеквизитов() 
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиРеквизитовАналитикМСД.Организация КАК Организация,
	|	НастройкиРеквизитовАналитикМСД.Аналитика КАК Аналитика,
	|	ЕСТЬNULL(АналитикиМСД.Представление, НастройкиРеквизитовАналитикМСД.Аналитика) КАК Представление,
	|	НастройкиРеквизитовАналитикМСД.Реквизит КАК Реквизит,
	|	НастройкиРеквизитовАналитикМСД.Используется КАК Используется,
	|	НастройкиРеквизитовАналитикМСД.Обязательный КАК Обязательный,
	|	НастройкиРеквизитовАналитикМСД.ПолныеПрава КАК ПолныеПрава,
	|	ЕСТЬNULL(РеквизитыАналитикМСД.Представление, НастройкиРеквизитовАналитикМСД.Реквизит) КАК ПредставлениеРеквизита,
	|	НастройкиРеквизитовАналитикМСД.Версия КАК Версия
	|ИЗ
	|	РегистрСведений.НастройкиРеквизитовАналитикМСД КАК НастройкиРеквизитовАналитикМСД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикиМСД КАК АналитикиМСД
	|		ПО НастройкиРеквизитовАналитикМСД.Аналитика = АналитикиМСД.ИмяАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыАналитикМСД КАК РеквизитыАналитикМСД
	|		ПО НастройкиРеквизитовАналитикМСД.Аналитика = РеквизитыАналитикМСД.ИмяАналитики
	|			И НастройкиРеквизитовАналитикМСД.Реквизит = РеквизитыАналитикМСД.ИмяРеквизита
	|ГДЕ
	|	НастройкиРеквизитовАналитикМСД.Версия = &ВерсияФормата
	|	И НастройкиРеквизитовАналитикМСД.Организация = &Организация
	|ИТОГИ ПО
	|	Аналитика"); 
	
	Запрос.УстановитьПараметр("ВерсияФормата", ВерсияФормата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ВыборкаАналитики = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
	
	Возврат ВыборкаАналитики;
	
КонецФункции  

&НаСервере
Процедура СформироватьДеревоРеквизитовАналитик()   
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиРеквизитовАналитик.Организация КАК Организация,
	                      |	НастройкиРеквизитовАналитик.Аналитика КАК Аналитика,
	                      |	НастройкиРеквизитовАналитик.Представление КАК Представление,
	                      |	НастройкиРеквизитовАналитик.Реквизит КАК Реквизит,
	                      |	НастройкиРеквизитовАналитик.ПредставлениеРеквизита КАК ПредставлениеРеквизита,
	                      |	НастройкиРеквизитовАналитик.Используется КАК Используется,
	                      |	НастройкиРеквизитовАналитик.Используется КАК Используется1,
	                      |	НастройкиРеквизитовАналитик.Обязательный КАК Обязательный,
	                      |	НастройкиРеквизитовАналитик.Обязательный КАК Обязательный1,
	                      |	НастройкиРеквизитовАналитик.ПолныеПрава КАК ПолныеПрава,
	                      |	НастройкиРеквизитовАналитик.ПолныеПрава КАК ПолныеПрава1
	                      |ПОМЕСТИТЬ ВТ_ДанныеРегистра
	                      |ИЗ
	                      |	&ДанныеРегистраРеквизитыАналитик КАК НастройкиРеквизитовАналитик
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	НастройкиРеквизитовАналитик.Организация КАК Организация,
	                      |	НастройкиРеквизитовАналитик.Аналитика КАК Аналитика,
	                      |	НастройкиРеквизитовАналитик.Представление КАК Представление,
	                      |	НастройкиРеквизитовАналитик.Реквизит КАК Реквизит,
	                      |	НастройкиРеквизитовАналитик.ПредставлениеРеквизита КАК ПредставлениеРеквизита,
	                      |	НастройкиРеквизитовАналитик.Используется КАК Используется,
	                      |	НастройкиРеквизитовАналитик.Используется КАК Используется1,
	                      |	НастройкиРеквизитовАналитик.Обязательный КАК Обязательный,
	                      |	НастройкиРеквизитовАналитик.Обязательный КАК Обязательный1,
	                      |	НастройкиРеквизитовАналитик.ПолныеПрава КАК ПолныеПрава,
	                      |	НастройкиРеквизитовАналитик.ПолныеПрава КАК ПолныеПрава1
	                      |ИЗ
	                      |	ВТ_ДанныеРегистра КАК НастройкиРеквизитовАналитик
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Представление,
	                      |	ПредставлениеРеквизита
	                      |ИТОГИ
	                      |	МАКСИМУМ(Представление),
	                      |	МАКСИМУМ(Используется),
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Используется1),
	                      |	МАКСИМУМ(Обязательный),
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Обязательный1),
	                      |	МАКСИМУМ(ПолныеПрава),
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолныеПрава1)
	                      |ПО
	                      |	Аналитика"); 
	
	Запрос.УстановитьПараметр("ДанныеРегистраРеквизитыАналитик", ДанныеРегистраРеквизитыАналитик.Выгрузить());     
	
	ВыборкаАналитик = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	пРезультат = РеквизитФормыВЗначение("РеквизитыАналитик");
	пРезультат.Строки.Очистить();
	
	Пока ВыборкаАналитик.Следующий() Цикл
		новСтрока = пРезультат.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(новСтрока, ВыборкаАналитик,, "Используется, Обязательный"); 
		новСтрока.ПредставлениеАналитики = ВыборкаАналитик.Представление;
		Если ВыборкаАналитик.Используется1 = 2 Тогда
			новСтрока.Используется = 2;
		Иначе
			новСтрока.Используется = ?(ВыборкаАналитик.Используется, 1, 0);
		КонецЕсли;
			
		Если ВыборкаАналитик.Обязательный1 = 2 Тогда
			новСтрока.Обязательный = 2;
		Иначе
			новСтрока.Обязательный = ?(ВыборкаАналитик.Обязательный, 1, 0);
		КонецЕсли;                     		
		
		Если ВыборкаАналитик.ПолныеПрава1 = 2 Тогда
			новСтрока.ПолныеПрава = 2;
		Иначе
			новСтрока.ПолныеПрава = ?(ВыборкаАналитик.ПолныеПрава, 1, 0);
		КонецЕсли;                                                            
		
		новСтрока.ПолеПоиска = ВыборкаАналитик.Аналитика;
		
		Выборка = ВыборкаАналитик.Выбрать();
		Пока Выборка.Следующий() Цикл 
			
			пНовСтрока = новСтрока.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(пНовСтрока, Выборка,, "Используется, Обязательный"); 
			пНовСтрока.ПредставлениеАналитики 	= Выборка.ПредставлениеРеквизита;
			пНовСтрока.Используется = ?(Выборка.Используется, 1, 0);
			пНовСтрока.Обязательный = ?(Выборка.Обязательный, 1, 0);  						
			пНовСтрока.ПолныеПрава 	= ?(Выборка.ПолныеПрава, 1, 0); 
			пНовСтрока.ПолеПоиска 	= Выборка.Аналитика + Выборка.Реквизит;
			
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(пРезультат, "РеквизитыАналитик");
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбновитьОтображениеСтраниц()
	
	МодульОбщегоНазначенияКлиентСервер =  ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаАналитикиПоСчетам Тогда
	
		ТекСтрока = Элементы.ДеревоСчетов.ТекущиеДанные;
		
		Если Не ТекСтрока = Неопределено Тогда
			текСчет = ТекСтрока.Счет;
		Иначе
			текСчет = Неопределено;
		КонецЕсли;
		
		СформироватьДеревоСчетов();
		
		ТекущаяСтрока = 0;
		Если ЗначениеЗаполнено(текСчет) Тогда
			МодульОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("Счет", ТекущаяСтрока, ДеревоСчетов.ПолучитьЭлементы(), текСчет, Ложь); 
		КонецЕсли;
		
		Элементы.ДеревоСчетов.ТекущаяСтрока = ТекущаяСтрока;      
		Если пТолькоПросмотр Тогда                        
			Элементы.ДеревоСчетов.ТолькоПросмотр = Истина;
		Иначе
			Элементы.ДеревоСчетов.ТолькоПросмотр = Ложь;
		КонецЕсли;	
	Иначе 
		текСтрока = Элементы.РеквизитыАналитик.ТекущиеДанные;
		
		Если Не текСтрока = Неопределено Тогда
			ПолеПоиска = текСтрока.ПолеПоиска;
		Иначе
			ПолеПоиска = Неопределено;
		КонецЕсли; 
		
		СформироватьДеревоРеквизитовАналитик();
		
		ТекущаяСтрока = 0;
		Если ЗначениеЗаполнено(ПолеПоиска) Тогда
			МодульОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("ПолеПоиска", ТекущаяСтрока, РеквизитыАналитик.ПолучитьЭлементы(), ПолеПоиска, Ложь); 
		КонецЕсли;		
		Элементы.РеквизитыАналитик.ТекущаяСтрока = ТекущаяСтрока; 
		
		Если пТолькоПросмотр Тогда                        
			Элементы.РеквизитыАналитик.ТолькоПросмотр = Истина;    
		Иначе
			Элементы.РеквизитыАналитик.ТолькоПросмотр = Ложь;
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент) 
	ЗаполнитьСписокВерсийФормата();
	ОбновитьОтображениеПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАктуальность(Команда)
	ОткрытьФорму("Обработка.ЗагрузкаТаксономии.Форма.Форма", Новый Структура("ТипФормы, Организация", "Таксономия", Организация));		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПечатьКСНаСервере(Организация, ВерсияФормата)	
	Возврат Справочники.КонтрольныеСоотношенияМСД.НапечататьКСВерсииЕФ(Организация, ВерсияФормата);	
КонецФункции

&НаКлиенте
Процедура ПечатьКС(Команда)
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	ТабличныйДокумент = ПечатьКСНаСервере(Организация, ВерсияФормата); 
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПечатьКС");
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "ПечатьКС");
    ПечатнаяФорма.СинонимМакета = "Контрольные соотношения";
    ПечатнаяФорма.ТабличныйДокумент = ТабличныйДокумент;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
КонецПроцедуры

#КонецОбласти

#КонецОбласти