
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОтчета = Параметры.ВидОтчета;
	ПравилоЗаполнения = Параметры.ПравилоЗаполнения;
	Событие = Параметры.Событие;
	
	Если Параметры.Свойство("РеквизитыДокумента") И ЗначениеЗаполнено(Параметры.РеквизитыДокумента) Тогда
		
		РеквизитыДокумента = Параметры.РеквизитыДокумента;
		
		Если ТипЗнч(РеквизитыДокумента) = Тип("Структура") Тогда
			
			Значение = Неопределено;
			Если РеквизитыДокумента.Свойство("ВидОтчета", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.ВидыОтчетов") Тогда
				
				ВидОтчета = Значение;
				
			КонецЕсли;
			
			Значение = Неопределено;
			Если РеквизитыДокумента.Свойство("ПравилоЗаполнения", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.ПравилаЗаполнения") Тогда
				
				ПравилоЗаполнения = Значение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыМетода = Неопределено;
	
	Если Событие = "СохранениеПараметраОбработки" Тогда
		
		АдресПараметров = Параметры.АдресПараметров;
		Если НЕ ПустаяСтрока(АдресПараметров) Тогда
			
			ПараметрыМетода = ПолучитьИзВременногоХранилища(АдресПараметров);
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыМетода = Справочники.ПравилаЗаполнения.ПолучитьПараметрыМетода(ПравилоЗаполнения, Параметры.ИмяМетода, Параметры.ИндексМетода);
		
	КонецЕсли;
	
	// Заполнение групп расчета
	ТаблицаАналитикиВидаОтчета = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикПоГруппамРаскрытия(ВидОтчета);
	Если ТипЗнч(ТаблицаАналитикиВидаОтчета) = Тип("ТаблицаЗначений") Тогда
		ТаблицаАналитики = ТаблицаАналитикиВидаОтчета.Скопировать();
		ТаблицаАналитики.Свернуть("ГруппаРаскрытия,КодГруппыРаскрытия");
		ТаблицаАналитики.Сортировать("КодГруппыРаскрытия");
	Иначе
		ТаблицаАналитики = Новый ТаблицаЗначений;
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ТаблицаАналитики Цикл
		
		РазделыОтчета.Добавить(СтрокаТаблицы.ГруппаРаскрытия);
		
	КонецЦикла;
	
	// Восстановление сохраненных параметров
	Если ПараметрыМетода <> Неопределено Тогда
		
		МассивГруппРаскрытия = Неопределено;
		
		Если ТипЗнч(ПараметрыМетода) = Тип("Структура") Тогда
			
			МассивГруппРаскрытия = Неопределено;
			ПараметрыМетода.Свойство("МассивГруппРаскрытия", МассивГруппРаскрытия);
			
		КонецЕсли;
		
		Если ТипЗнч(МассивГруппРаскрытия) = Тип("Массив") Тогда
			
			Для каждого ЭлементСписка Из РазделыОтчета Цикл
				
				Если МассивГруппРаскрытия.Найти(ЭлементСписка.Значение) <> Неопределено Тогда
					
					ЭлементСписка.Пометка = Истина;
					
				Иначе
					
					ЭлементСписка.Пометка = Ложь;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	ЗаполнениеОтчетностиКлиент.СохранениеПередЗакрытием(ЭтаФорма,Событие,"МетодыОбработкиДанныхОтчетности");

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	СтруктураВозврата = СохранитьПараметры();
	
	Если ТипЗнч(СтруктураВозврата) = Тип("Структура") Тогда
		
		Модифицированность = Ложь;
		
		Закрыть(СтруктураВозврата);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось сохранить параметры'"));
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ПодготовитьСтруктуруВозврата() Экспорт
	
	Возврат СохранитьПараметры(); 
	
КонецФункции

&НаКлиенте
Функция СохранитьПараметры()
	
	СтруктураВозврата = Новый Структура("АдресПараметров, ПредставлениеПараметров","","");
	
	Если ПустаяСтрока(АдресПараметров) Тогда
		АдресДляСохранения = ЭтаФорма.ВладелецФормы.УникальныйИдентификатор;
	Иначе
		АдресДляСохранения = АдресПараметров;
	КонецЕсли;
	
	Если СохранитьПараметрыНаСервере(АдресДляСохранения) Тогда
		
		СтруктураВозврата.АдресПараметров = АдресПараметров;
		СтруктураВозврата.ПредставлениеПараметров = ПредставлениеПараметров;
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СохранитьПараметрыНаСервере(Знач АдресДляСохранения)
	
	Если ПроверитьЗаполнение() Тогда
		
		СтруктураПараметров = Новый Структура;
		
		МассивГруппРаскрытия = Новый Массив;
		Для каждого ЭлементСписка Из РазделыОтчета Цикл
			
			Если ЭлементСписка.Пометка Тогда
				
				МассивГруппРаскрытия.Добавить(ЭлементСписка.Значение);
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураПараметров.Вставить("МассивГруппРаскрытия", МассивГруппРаскрытия);
		
		ПредставлениеПараметров(МассивГруппРаскрытия);
		
		АдресПараметров = ПоместитьВоВременноеХранилище(СтруктураПараметров , АдресДляСохранения);
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПредставлениеПараметров(МассивГруппРаскрытия)
	
	ПредставлениеПараметров = "";
	
	Для каждого ЭлементМассива Из МассивГруппРаскрытия Цикл
		
		КодГруппы =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементМассива,"Код");
		ПредставлениеПараметров = ПредставлениеПараметров + ?(ПустаяСтрока(ПредставлениеПараметров), "", ",") + КодГруппы;
		
	КонецЦикла;
	
КонецПроцедуры


