
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоответствиеОтборов = Новый Соответствие;
	СоответствиеОтборов.Вставить("Владелец","Подстатья");
	СоответствиеОтборов.Вставить("Бюджет"  ,"Бюджет");
	
	НедоступныеЭлементыБыстрогоОтбора = Новый Соответствие;
    НедоступныеЭлементыБыстрогоОтбора.Вставить("Владелец"	,"Подстатья");
	
	БюджетнаяКлассификация.ПриСозданииНаСервереФормыСписка(ЭтаФорма, Отказ, СоответствиеОтборов, НедоступныеЭлементыБыстрогоОтбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодстатьяПриИзменении(Элемент)
	БюджетнаяКлассификацияКлиентСервер.УстановитьОтборПоВладельцу(ЭтаФорма,Подстатья);
КонецПроцедуры

&НаКлиенте
Процедура БюджетОтборПриИзменении(Элемент)
	БюджетнаяКлассификацияКлиентСервер.УстановитьОтборПоБюджету(ЭтаФорма,Бюджет);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	БюджетнаяКлассификацияКлиентСервер.ПриОбновленииСоставаПользовательскихНастроек(СтандартнаяОбработка, ЭтотОбъект,,,"Подстатья");
	
КонецПроцедуры

#КонецОбласти
