#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьПроводки");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет данными регистр сведений КорректныеКорреспонденцииСчетов
//
// Параметры:
//  УдалитьВсеСуществующие - Булево. Если Истина, то все существующие записи регистра 
//   будут удалены перед заполнением
//  ДанныеФайла - ХранилищеЗначения. Если не указано, то проводки берутся из шаблона
//
// Возвращает Истина, если файлы успешно загружены
//
Функция ЗаполнитьПроводки(УдалитьВсеСуществующие = Ложь, ДанныеФайла = "", ЗаполненоПроводок = 0) Экспорт
	
	ЗаполненоПроводок = 0;
	НаборЗаписей = РегистрыСведений.КорректныеКорреспонденцииСчетов.СоздатьНаборЗаписей();
	
	Если Не(УдалитьВсеСуществующие) Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	КорректныеКорреспонденцииСчетов.СчетДт,
			|	КорректныеКорреспонденцииСчетов.СчетКт,
			|	КорректныеКорреспонденцииСчетов.Комментарий
			|ИЗ
			|	РегистрСведений.КорректныеКорреспонденцииСчетов КАК КорректныеКорреспонденцииСчетов");
		СуществующиеЗаписи = Запрос.Выполнить().Выгрузить();
		СуществующиеЗаписи.Индексы.Добавить("СчетДт, СчетКт");
		
	Иначе
		СуществующиеЗаписи = Новый ТаблицаЗначений;
		СуществующиеЗаписи.Колонки.Добавить("СчетДт");
		СуществующиеЗаписи.Колонки.Добавить("СчетКт");
	КонецЕсли;
	
	СчетаПоКодам = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.Код КАК Код,
	|	ЕПСБУ.ДатаНачалаДействия КАК ДатаНачалаДействия
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	ВыборкаКод = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаКод.Следующий() Цикл
		КлючСчета = ВыборкаКод.Код + ":" + Формат(ВыборкаКод.ДатаНачалаДействия, "ДФ=yyyyMMdd; ДП=00010101");
		СчетаПоКодам.Вставить(КлючСчета, ВыборкаКод.Ссылка);
	КонецЦикла;
	
	ИсточникМакет = ПустаяСтрока(ДанныеФайла);
	
	Если ИсточникМакет Тогда
		Макет = РегистрыСведений.КорректныеКорреспонденцииСчетов.ПолучитьМакет("Корреспонденции");
	Иначе
		Попытка 
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("mxl");
			ДвоичныеДанные = ДанныеФайла.Получить();
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			Макет = Новый ТабличныйДокумент;
			Макет.Прочитать(ИмяВременногоФайла);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение загрузки корректных корреспонденций'"),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
		
	Попытка 
		КоличествоСтрок = Макет.ВысотаТаблицы;
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение загрузки корректных корреспонденций'"),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	
	ДобавленныеЗаписи = Новый ТаблицаЗначений;
	ДобавленныеЗаписи.Колонки.Добавить("СчетДт", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ДобавленныеЗаписи.Колонки.Добавить("СчетКт", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ДобавленныеЗаписи.Индексы.Добавить("СчетДт, СчетКт");
	
	ИндексЗаписи = -1;
	
	Для й = 1 По КоличествоСтрок Цикл 
		
		СчетДтСтрока = "";
		СчетКтСтрока = "";
		Комментарий  = "";
		
		СчетДтСтрока = ПолучитьКлючСчета(Макет.Область("R" + Формат(й,"ЧРГ=; ЧГ=0") + "C1").Текст,
		Макет.Область("R" + Формат(й,"ЧРГ=; ЧГ=0") + "C2").Текст);
		
		СчетКтСтрока = ПолучитьКлючСчета(Макет.Область("R" + Формат(й,"ЧРГ=; ЧГ=0") + "C3").Текст,
		Макет.Область("R" + Формат(й,"ЧРГ=; ЧГ=0") + "C4").Текст);

		Комментарий = Макет.Область("R" + Формат(й,"ЧРГ=; ЧГ=0") + "C5").Текст;
		
		СчетДт = СчетаПоКодам.Получить(СчетДтСтрока);
		СчетКт = СчетаПоКодам.Получить(СчетКтСтрока);
		
		Если ЗначениеЗаполнено(СчетДтСтрока) И (СчетДт = Неопределено) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка при заполнении корректных корреспонденций счетов: счет дебета %1 не найден.'"), СчетДтСтрока));
			Продолжить;
		ИначеЕсли ЗначениеЗаполнено(СчетКтСтрока) И (СчетКт = Неопределено) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка при заполнении корректных корреспонденций счетов: счет кредита %1 не найден.'"), СчетКтСтрока));
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("СчетДт, СчетКт", СчетДт, СчетКт);
		НетВСуществующихЗаписях = СуществующиеЗаписи.НайтиСтроки(Отбор).Количество() = 0;

		Если УдалитьВсеСуществующие ИЛИ НетВСуществующихЗаписях Тогда
			Если ДобавленныеЗаписи.НайтиСтроки(Новый Структура("СчетДт, СчетКт", СчетДт, СчетКт)).Количество() = 0 Тогда
				НоваяЗаписьТаб = ДобавленныеЗаписи.Добавить();
				НоваяЗаписьТаб.СчетДт = СчетДт;
				НоваяЗаписьТаб.СчетКт = СчетКт;
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, НоваяЗаписьТаб);
				НоваяЗапись.Комментарий = Комментарий;
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
	
	ЗаполненоПроводок = НаборЗаписей.Количество();
		
	НаборЗаписей.Записать(УдалитьВсеСуществующие);
	
	Возврат Истина;
	
КонецФункции

// Сохраняет проводки из регистра сведений в файл.
//
Процедура СохранитьПроводкиВФайл(ИмяФайла) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректныеКорреспонденцииСчетов.СчетДт.Код КАК Дт,
	|	КорректныеКорреспонденцииСчетов.СчетДт.ДатаНачалаДействия КАК ДатаДт,
	|	КорректныеКорреспонденцииСчетов.СчетКт.Код КАК Кт,
	|	КорректныеКорреспонденцииСчетов.СчетКт.ДатаНачалаДействия КАК ДатаКт,
	|	КорректныеКорреспонденцииСчетов.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.КорректныеКорреспонденцииСчетов КАК КорректныеКорреспонденцииСчетов
	|
	|УПОРЯДОЧИТЬ ПО
	|	КорректныеКорреспонденцииСчетов.СчетДт.Забалансовый,
	|	ПОДСТРОКА(КорректныеКорреспонденцииСчетов.СчетДт.Код,1,6),
	|	ПОДСТРОКА(КорректныеКорреспонденцииСчетов.СчетКт.Код,1,6),
	|	КорректныеКорреспонденцииСчетов.СчетДт.ДатаНачалаДействия,
	|	КорректныеКорреспонденцииСчетов.СчетКт.ДатаНачалаДействия";
	
	ТаблицаПроводок = Запрос.Выполнить().Выбрать();
	
	Выгрузка = Новый ТабличныйДокумент;
	
	Макет = РегистрыСведений.КорректныеКорреспонденцииСчетов.ПолучитьМакет("МакетФайла").ПолучитьОбласть("R1C1:R1C5"); 
	
	Пока ТаблицаПроводок.Следующий() Цикл
		
		Макет.Параметры.Заполнить(ТаблицаПроводок);
		
		Выгрузка.Вывести(Макет);
		
	КонецЦикла;
	
	Выгрузка.Записать(ИмяФайла);
	
КонецПроцедуры

Функция ПолучитьКлючСчета(Счет, ДатаСчета)
	
	Если ПустаяСтрока(ДатаСчета) Тогда
		КлючДата = "00010101";
	Иначе
		МассивДаты = СтрРазделить(ДатаСчета, ".");
		Если МассивДаты.Количество() = 3 Тогда
			КлючДата = МассивДаты[2] + МассивДаты[1] + МассивДаты[0];
		Иначе
			КлючДата = "00010101";
		КонецЕсли;
	КонецЕсли;	
	
	Возврат  Счет + ":" + КлючДата;
	
КонецФункции

Функция ПредставлениеСчетаИДаты(КодСчета, ДатаНачала)
	
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		Возврат КодСчета+ ":" + Формат(ДатаНачала, "ДФ=yyyyMMdd; ДП=00010101");
	Иначе
		Возврат КодСчета;
	КонецЕсли;	
	
КонецФункции	

#КонецОбласти

#КонецЕсли
