#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	Если НЕ ЭтоГруппа И НЕ БухгалтерскийУчет.СчетВИерархии(СчетУчета, "205.00,209.00,401.10,210.05") Тогда
		ВызватьИсключение НСтр("ru = 'Счет учета должен быть в группе 205.00, 209.00, 401.10 или равен 210.05'");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
