#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаСвойствРазделовУчета.Загрузить(Обработки.ПомощникВводаНачальныхОстатков.ПолучитьТаблицуСвойствРазделовУчета());
	
	ОбщегоНазначенияБГУ.УстановитьОтборСпискаПоОрганизации(ЭтотОбъект);
	
	Параметры.Отбор.Свойство("РазделУчета", ОтборРазделУчета);
	Элементы.РазделУчета.Видимость = НЕ ЗначениеЗаполнено(ОтборРазделУчета);
	
	Если Не ЗначениеЗаполнено(ОтборРазделУчета) И Параметры.Отбор.Свойство("РазделыУчета") Тогда
		Элементы.ОтборРазделУчета.Видимость = Ложь;
		Элементы.ОтборСчет.Видимость = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "РазделУчета",
			Параметры.Отбор["РазделыУчета"], ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Дата") И ЗначениеЗаполнено(Параметры.Отбор.Дата) Тогда
		// Заменяем условие точного равенства даты и времени
		// на условие принадлежности интервалу целого дня суток.
		
		Элементы["Список"].Период.ДатаНачала	= НачалоДня(Параметры.Отбор.Дата);
		Элементы["Список"].Период.ДатаОкончания	= КонецДня(Параметры.Отбор.Дата);
		
		Заголовок = Заголовок + " - " + Формат(Параметры.Отбор.Дата, "ДЛФ=ДД");
		Параметры.Отбор.Удалить("Дата");
		
	КонецЕсли;
	
	// Отбор по Счету проводки:
	ОтборСчет = Неопределено;
	Параметры.Отбор.Свойство("СчетПроводки", ОтборСчет);
	ПараметрСчет = Список.Параметры.Элементы.Найти("СчетПроводки");
	ПараметрСчет.Значение = ОтборСчет;
	ПараметрСчет.Использование = Истина;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КомандыФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ОтборСчет) Тогда
		ОтобратьПоСчету();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОбщегоНазначенияБГУКлиентСервер.ИзменитьОтборСпискаПоОрганизации(Список,, Параметр);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборРазделУчетаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "РазделУчета", ?(ЗначениеЗаполнено(ОтборРазделУчета), ОтборРазделУчета, Неопределено),,, ЗначениеЗаполнено(ОтборРазделУчета));
	
	Элементы.РазделУчета.Видимость = НЕ ЗначениеЗаполнено(ОтборРазделУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетПриИзменении(Элемент)
	
	ОтобратьПоСчету();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ОтборРазделУчета) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Поиск = Новый Структура("РазделУчета", ОтборРазделУчета);
	
	МассивСтрок = ТаблицаСвойствРазделовУчета.НайтиСтроки(Поиск);
	
	Если МассивСтрок.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = МассивСтрок[0];
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОграниченияСписокСчетов", СтрокаТаблицы["МассивСсылок"]);
	
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.СписокВыбор(ЭтотОбъект, Поле, ВыбраннаяСтрока, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Не Копирование Тогда
		Отказ = Истина;
		
		ПараметрыЗаполнения = Новый Структура();
		Если ЗначениеЗаполнено(ОтборРазделУчета) Тогда
			ПараметрыЗаполнения.Вставить("РазделУчета", ОтборРазделУчета);
		КонецЕсли;
		Если ЗначениеЗаполнено(ОтборСчет) Тогда
			ПараметрыЗаполнения.Вставить("Счет", ОтборСчет);
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
		ОткрытьФорму("Документ.ВводНачальныхОстатков.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтобратьПоСчету()
	
	// Настраиваем реквизит формы:
	ПараметрСчет = Список.Параметры.Элементы.Найти("СчетПроводки");
	ПараметрСчет.Значение = ОтборСчет;
	ПараметрСчет.Использование = Истина;
	
	// Обновляем список:
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ТиповыеОперации

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти
