#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем


// Регистры учета

Функция ЭтоРегистрУчета() Экспорт
	Возврат Истина;
КонецФункции	

Процедура СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета) Экспорт
	
	ПараметрОрганизация = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	Если НЕ ПараметрОрганизация = Неопределено Тогда
		Организация = ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрОрганизация.ИдентификаторПользовательскойНастройки);
		Если НЕ Организация = Неопределено Тогда
			СвойстваРегистраУчета.Вставить("Организация", Организация.Значение);
		КонецЕсли;
	КонецЕсли;

	ПараметрПериод = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если НЕ ПараметрПериод = Неопределено Тогда
		Период = ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрПериод.ИдентификаторПользовательскойНастройки);
		Если НЕ Период = Неопределено Тогда
			Если ТипЗнч(Период.Значение) = Тип("Дата") Тогда
				СвойстваРегистраУчета.Вставить("КонецПериода", 	Период.Значение);
				СвойстваРегистраУчета.Вставить("НачалоПериода", 	Период.Значение);
			Иначе
				СвойстваРегистраУчета.Вставить("КонецПериода", 	Период.Значение.Дата);
				СвойстваРегистраУчета.Вставить("НачалоПериода", 	Период.Значение.Дата);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрПодразделение = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Подразделение"));
	Если НЕ ПараметрПодразделение = Неопределено Тогда
		Подразделение = ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрПодразделение.ИдентификаторПользовательскойНастройки);
		Если НЕ Подразделение = Неопределено Тогда
			СвойстваРегистраУчета.Вставить("Подразделение", Подразделение.Значение);
		КонецЕсли;
	КонецЕсли;
	
	НастройкиОтчета = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	Сотрудник = РегистрыУчета.НайтиВОтбореРекурсивно(НастройкиОтчета.Отбор, "Сотрудник");
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ДополнениеИмени = "";
		ОбеспечениеСотрудникаИмуществом = УправлениеНФА.ОбеспечениеСотрудникаИмуществом(Сотрудник);
		Если ЗначениеЗаполнено(ОбеспечениеСотрудникаИмуществом) Тогда
			НомерКарточки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбеспечениеСотрудникаИмуществом, "НомерКарточки");
			ДополнениеИмени = " № " + НомерКарточки;
		КонецЕсли;
		НачалоПериодаРег = Неопределено;
		КонецПериодаРег = Неопределено;
		Если СвойстваРегистраУчета.Свойство("НачалоПериода", НачалоПериодаРег) И СвойстваРегистраУчета.Свойство("КонецПериода", КонецПериодаРег) Тогда 
			ДополнениеИмени = ДополнениеИмени + СтандартныеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(НачалоПериодаРег, КонецПериодаРег);
		КонецЕсли;
		ДополнениеИмени = ДополнениеИмени + " " + Строка(Сотрудник);
		СвойстваРегистраУчета.Вставить("ДополнениеИмени", ДополнениеИмени);
		СвойстваРегистраУчета.Вставить("НеДополнятьИмяАвтоматически", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Регистры учета

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = 'Карточка учета имущества в личном пользовании'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#КонецЕсли
