////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>.
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Дополнительные настройки формата.

Функция ПолучитьПредставлениеЗначения(СтрокаДополнительныхНастроек) Экспорт 
	
	Если Не СтрокаДополнительныхНастроек.ВыбиратьИзСписка Тогда 
		Возврат Строка(СтрокаДополнительныхНастроек.Значение);
	КонецЕсли;	
	
	НайденноеЗначение = СтрокаДополнительныхНастроек.СписокВыбора.НайтиПоЗначению(СтрокаДополнительныхНастроек.Значение);
	
	Если НайденноеЗначение = Неопределено Тогда 
		Возврат Строка(СтрокаДополнительныхНастроек.Значение);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НайденноеЗначение.Представление) Тогда 
		Возврат Строка(СтрокаДополнительныхНастроек.Значение);
	КонецЕсли;
	
	Возврат НайденноеЗначение.Представление;
	
КонецФункции

Процедура ПрочитатьЗначенияИзХранилища(ТаблицаДопНастроек) Экспорт 
	
	#Если ВебКлиент Тогда 
		
		ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПрочитатьЗначенияИзХранилища(ТаблицаДопНастроек);
				
		Возврат;
	#КонецЕсли

	
	Для Каждого СтрокаДопНастроек из ТаблицаДопНастроек Цикл 
		
		ИсходныеДанныеСтроки = Новый Структура("ТипЗначенияХранилище,СписокВыбораХранилище,ЗначениеПоУмолчаниюХранилище,СохраненноеЗначениеХранилище,ЗначениеХранилище");
		ИтоговыеДанныеСтроки = Новый Структура("ТипЗначения,СписокВыбора,ЗначениеПоУмолчанию,СохраненноеЗначение,Значение");
		
		ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтроки, СтрокаДопНастроек);
		
		ИтоговыеДанныеСтроки.ТипЗначения = БюджетнаяОтчетностьКлиентСервер.ПрочитатьЗначениеИзXML(ИсходныеДанныеСтроки.ТипЗначенияХранилище);
		ИтоговыеДанныеСтроки.СписокВыбора = БюджетнаяОтчетностьКлиентСервер.ПрочитатьЗначениеИзXML(ИсходныеДанныеСтроки.СписокВыбораХранилище);
		ИтоговыеДанныеСтроки.ЗначениеПоУмолчанию = БюджетнаяОтчетностьКлиентСервер.ПрочитатьЗначениеИзXML(ИсходныеДанныеСтроки.ЗначениеПоУмолчаниюХранилище);
		ИтоговыеДанныеСтроки.СохраненноеЗначение = БюджетнаяОтчетностьКлиентСервер.ПрочитатьЗначениеИзXML(ИсходныеДанныеСтроки.СохраненноеЗначениеХранилище);
		ИтоговыеДанныеСтроки.Значение = БюджетнаяОтчетностьКлиентСервер.ПрочитатьЗначениеИзXML(ИсходныеДанныеСтроки.ЗначениеХранилище);	
		
		ЗаполнитьЗначенияСвойств(СтрокаДопНастроек, ИтоговыеДанныеСтроки);
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПоместитьЗначенияВХранилища(ТаблицаДопНастроек) Экспорт
	
	#Если ВебКлиент Тогда 
		
		ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПоместитьЗначенияВХранилища(ТаблицаДопНастроек);
		
	#Иначе
		
		
		Для Каждого СтрокаДопНастроек из ТаблицаДопНастроек Цикл 
			
			ИсходныеДанныеСтроки = Новый Структура("ТипЗначения,СписокВыбора,ЗначениеПоУмолчанию,СохраненноеЗначение,Значение");
			ИтоговыеДанныеСтроки =  Новый Структура("ТипЗначенияХранилище,СписокВыбораХранилище,ЗначениеПоУмолчаниюХранилище,СохраненноеЗначениеХранилище,ЗначениеХранилище");
			
			ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтроки, СтрокаДопНастроек);
			
			ИтоговыеДанныеСтроки.ТипЗначенияХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ИсходныеДанныеСтроки.ТипЗначения); 
			ИтоговыеДанныеСтроки.СписокВыбораХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ИсходныеДанныеСтроки.СписокВыбора); 
			ИтоговыеДанныеСтроки.ЗначениеПоУмолчаниюХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ИсходныеДанныеСтроки.ЗначениеПоУмолчанию); 
			ИтоговыеДанныеСтроки.СохраненноеЗначениеХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ИсходныеДанныеСтроки.СохраненноеЗначение);
			ИтоговыеДанныеСтроки.ЗначениеХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ИсходныеДанныеСтроки.Значение);
			
			ЗаполнитьЗначенияСвойств(СтрокаДопНастроек, ИтоговыеДанныеСтроки);
			
		КонецЦикла;
		
	#КонецЕсли
	
КонецПроцедуры	

// Дополнительные настройки формата.
////////////////////////////////////////////////////////////////////////////////
// получение уникального имени файла.

Функция ПолучитьШаблонУникальногоИмениФайла(ПутьФайла, ЭтоКаталог = Ложь) Экспорт
	// Добавляет "%1" к имени файла перед расширением "c:\temp\test.txt" -> "c:\temp\test%1.txt".
	// В случае каталога "%1" добавляется к имени последней папки.
	
	Если Найти(ПутьФайла,"%1") <> 0 Тогда 
		Возврат ПутьФайла; 
	КонецЕсли;
	
	Результат = "";
		
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПутьФайла, ЭтоКаталог);
	
	Результат = СтруктураИмениФайла.Путь;
	Результат = Результат + СтруктураИмениФайла.ИмяБезРасширения;
	Результат = Результат + "%1";
	Если Не ЭтоКаталог Тогда
		Результат = Результат + СтруктураИмениФайла.Расширение;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции	

Функция ПолучитьУникальноеИмяФайла(ШаблонПутиФайла, Итератор = 0) Экспорт 
	
	//используются асинхронные вызовы применять на клиенте осознано 
	//асинхронный аналог тут: ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиент
	
	Если Найти(ШаблонПутиФайла,"%1") = 0 Тогда 
		Возврат ШаблонПутиФайла; 
	КонецЕсли;	
	
	ПодставляемоеЗначение = "";
	Если Итератор > 0 Тогда 
		ПодставляемоеЗначение = "("+Итератор+")";
	КонецЕсли;
	
	ПроверяемыйПуть = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПутиФайла,ПодставляемоеЗначение);
	
	Файл = Новый Файл(ПроверяемыйПуть);
	Если Файл.Существует() Тогда 
		Возврат ПолучитьУникальноеИмяФайла(ШаблонПутиФайла, Итератор+1);
	Иначе 
		Возврат ПроверяемыйПуть;
	КонецЕсли;	
	
КонецФункции

// Получение уникального имени файла.
////////////////////////////////////////////////////////////////////////////////
// Прочее

Функция ИспользоватьЭПДляСпособаВыгрузки(СпособВыгрузки) Экспорт 
	
	МассивИспользующихСпособов = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиентСерверПереопределяемый.ПолучитьСписокСпособовВыгрузкиДляРаботыСЭЦП();
	Возврат МассивИспользующихСпособов.Найти(СпособВыгрузки) <> Неопределено;	
	
КонецФункции	

Функция ПолучитьПустуюСтруктуруПараметров(ИмяСтруктуры) Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	Если ИмяСтруктуры = "МассивОписанийСертификатов" Тогда
		
		СтруктураПараметров.Вставить("Сертификат"); // двоичные данные
		СтруктураПараметров.Вставить("Комментарий","");
		СтруктураПараметров.Вставить("Пароль","");
		СтруктураПараметров.Вставить("КомуВыданСертификат","");
		СтруктураПараметров.Вставить("Отпечаток","");
		СтруктураПараметров.Вставить("ДатаПодписи",Дата(1,1,1));
		СтруктураПараметров.Вставить("УстановившийПодпись");
		СтруктураПараметров.Вставить("СертификатСсылка");
		СтруктураПараметров.Вставить("ПутиПодписей", Новый Массив);
		
	ИначеЕсли ИмяСтруктуры = "МассивСформированныхПодписей" Тогда
		
		СтруктураПараметров.Вставить("ОписаниеСертификата");
		СтруктураПараметров.Вставить("НоваяПодписьДвоичныеДанные"); // двоичные данные
		СтруктураПараметров.Вставить("ИмяФайлаПодписи","");
		СтруктураПараметров.Вставить("ПолныйПутьФайлаПодписи","");
		СтруктураПараметров.Вставить("ОтносительныйПутьФайлаПодписи","");
		
	ИначеЕсли ИмяСтруктуры = "ФайлыДляСозданияПодписей" Тогда
		
		СтруктураПараметров.Вставить("Группа","");
		СтруктураПараметров.Вставить("Путь","");
		СтруктураПараметров.Вставить("Имя","");
		СтруктураПараметров.Вставить("ИмяБезРасширения","");
		СтруктураПараметров.Вставить("ПолноеИмя","");
		СтруктураПараметров.Вставить("ДанныеФайла"); // двоичные данные
		СтруктураПараметров.Вставить("МассивСформированныхПодписей", Новый Массив);
		
	ИначеЕсли ИмяСтруктуры = "ПутиПодписей" Тогда	
		
		СтруктураПараметров.Вставить("Группа");
		СтруктураПараметров.Вставить("ОтносительныйПутьФайлаПодписи");

	КонецЕсли;
	
	Возврат СтруктураПараметров;
КонецФункции