#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Организация") Тогда
		ОтборОрганизация = Параметры.Отбор.Организация;
		УстановитьОтборСписка("Организация", ОтборОрганизация);
	Иначе
		ОбщегоНазначенияБГУ.УстановитьОтборСпискаПоОрганизации(ЭтаФорма,"Список","Организация",ОтборОрганизация);
	КонецЕсли;
	
	УстановитьУсловноеОформление();
		
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтотОбъект, Элементы.ИнформационныеСсылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтборСписка("Актуальность", ОтборАктуальность, (ОтборАктуальность = 0));
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	УстановитьОтборСписка("Организация", ОтборОрганизация);
КонецПроцедуры

&НаКлиенте
Процедура ОтборАктуальностьПриИзменении(Элемент)
	УстановитьОтборСписка("Актуальность", ОтборАктуальность, (ОтборАктуальность = 0));
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборСписка(ПолеОтбора, ЗначениеОтбора, Использование = Неопределено)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
	Список.Отбор, 
	ПолеОтбора, 
	ЗначениеОтбора, 
	ВидСравненияКомпоновкиДанных.Равно, 
	, 
	?(Использование = Неопределено, ЗначениеЗаполнено(ЗначениеОтбора), Использование));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
 	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Актуальность");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(128, 128, 128));
    Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,,Истина));

КонецПроцедуры

#КонецОбласти
