////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ИзменитьНаименованиеДопКлассификации(ДопКлассификация)
	РегистрыСведений.ХарактеристикиДополнительнойБюджетнойКлассификации.ИзменитьНаименованиеДопКлассификации(ДопКлассификация);		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ Список

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	ДопКлассификация = Элементы.Список.ТекущиеДанные.ДополнительнаяБюджетнаяКлассификация;
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Если ЗначениеЗаполнено(ДопКлассификация) Тогда
		ИзменитьНаименованиеДопКлассификации(ДопКлассификация);
	КонецЕсли;
	
	ДопКлассификация = "";
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

