&НаКлиенте
Перем НеПроверятьОтражениеВУчете;
&НаКлиенте
Перем ТребуетсяЗаполнитьВсеДанныеСтрокиПослеИзмененияОС;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	Если Параметры.Ключ.Пустая() Тогда 
		ПодготовитьФормуНаСервере();
		Если Не ЗначениеЗаполнено(Объект.Руководитель) Тогда
			Подписанты = Новый Структура;
			Подписанты.Вставить("Руководитель", ЗаполнениеРеквизитовОбъектов.СтруктураПодписанта("Руководитель", Объект.ПодразделениеОтправитель));
			ЗаполнениеРеквизитовОбъектов.ЗаполнитьПодписантов(Объект, Подписанты);
		КонецЕсли;
	КонецЕсли;
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);

	ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448();
	ЭлектронныеДокументыБГУ.ЗаполнитьСостояниеЭДОАктаПоФорме0510448(Объект.Ссылка, Элементы.ДекорацияСостояниеЭДОАкты);
	
	ВидимостьЭлементовЭДО = ЭлектронныеДокументыБГУ.ВидимостьЭлементовЭДО(Объект.Контрагент, Объект.Организация);
	ВидимостьЭлементовЭДОДляЭДПоставщика = ВидимостьЭлементовЭДОДляДокумента();
	ВидимостьЭлементовЭДОАкта448 = ВидимостьЭлементовЭДОАкта448();
	УстановитьВидимостьЭлементовЭДО(ЭтаФорма, ВидимостьЭлементовЭДО, ВидимостьЭлементовЭДОДляЭДПоставщика, ВидимостьЭлементовЭДОАкта448);
	ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере();
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервчиныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервчиныхДокументов 
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	УстановитьВидимостьЭлементовФормы_КарточкаКапвложений(ЭтотОбъект);
	ПервичныеДокументыБГУ.ПриСозданииНаСервере(ЭтотОбъект, Истина);
	
	ЗаполнитьСписокВидовИмущества("ВидИмущества", ЭтотОбъект);
	ЗаполнитьСписокВидовИмущества("ОсновныеСредстваВидИмущества", ЭтотОбъект, Ложь);

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НеПроверятьОтражениеВУчете <> Истина
		И ДоступнаВидимостьПараметровАмортизации(ЭтотОбъект) Тогда
		
		Ошибки = Неопределено;
		Для Каждого ТекущиеДанные Из Объект.ОсновныеСредства Цикл
			ПроверитьВыбранныйСпособПогашенияСтоимости(ЭтотОбъект, ТекущиеДанные, Ошибки);
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		
		Если Отказ Тогда
			
			ТекстВопроса = НСтр("ru = 'В некоторых строках документа установлены неверные параметры начисления амортизации.
				|Рекомендуется установить правильные параметры амортизации автоматически.'");
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(КодВозвратаДиалога.Да		, НСтр("ru='Установить рекомендуемые параметры'"));
			Кнопки.Добавить(КодВозвратаДиалога.Отмена	, НСтр("ru='Продолжить редактирование документа'"));
			Кнопки.Добавить(КодВозвратаДиалога.Нет		, НСтр("ru='Не изменять параметры'"));
			Ответ = Неопределено;
			
			ДополнительныеПараметры = Новый Структура("Отказ, ПараметрыЗаписи", Отказ, ПараметрыЗаписи);
			ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
			ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, Кнопки,,
				КодВозвратаДиалога.Отмена, НСтр("ru='Установлены неверные параметры начисления амортизации'"));
			Возврат;
			
		КонецЕслИ;
		
	КонецЕсли;
	
	НеПроверятьОтражениеВУчете = Неопределено;
	
	ЭтоПриобретениеИлиИзготовление =
			УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(Объект.ВидПоступления);
	
	Если ЭтоПриобретениеИлиИзготовление 
			И Объект.МЦСДрагоценнымиМатериалами.Количество() > 0 Тогда
			
		Отказ = Ложь;
		ПроверитьКоличествоПринятихКУчетуДрагМатериаловКапвложения(Отказ);
		
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.ВидМежотчетногоПериода = ?(Объект.Дата = КонецГода(Объект.Дата) И ОтразитьВМежотчетномПериоде,
		ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"),
		ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка"));
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		// установить рекомендуемые параметры, потом записывать
		
		Для Каждого ТекущаяСтрока Из Объект.ОсновныеСредства Цикл
			УстановитьРекомедуемыеОтражениеВУчетеВСтроке(ЭтотОбъект, ТекущаяСтрока);
		КонецЦикла;
		
	ИначеЕсли РезультатВопроса <> КодВозвратаДиалога.Нет Тогда
		
		// ничего не менять и не записывать
		НеПроверятьОтражениеВУчете = Неопределено;
		Возврат;
		
	КонецЕсли;
	НеПроверятьОтражениеВУчете = Истина;
	
	Записать(ДополнительныеПараметры.ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	МассивВО = Новый Массив;
	МассивВО.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление"));
	МассивВО.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение"));
	Если МассивВО.Найти(Объект.ВидПоступления) <> Неопределено Тогда  	
		УправлениеОсновнымиСредствами.ПроверитьСуммыОбъектовИКапвложений(
			ТекущийОбъект.ОсновныеСредства.Итог("Сумма"), ТекущийОбъект.СуммаВложений,
			ТекущийОбъект.СчетКредита, Объект.Ссылка, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;	

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом   
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимостьДанныхДрагМатериалов();
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	Оповестить("ДокументыПоУчетуОСИзменение");
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ЗаполнитьДополнительныеРеквизитыФормы();
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОС(ЭтаФорма);
	ОбновитьТекстОтражениеВУчетеВсехСтрокТаблицыОС(ЭтаФорма);
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТВоВсехСтроках(ЭтотОбъект, "ОсновныеСредства", Ложь);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеОбщихРеквизитовШапки(ШаблонНезаполненногоПоля, Ошибки)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.Организация",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонНезаполненногоПоля, "Организация"),);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ВидПоступления) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ВидПоступления",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонНезаполненногоПоля, "Вид поступления"),);
	КонецЕсли;
	Если НЕ Объект.ВидИмуществаВТабличнойЧасти И Не ЗначениеЗаполнено(Объект.ВидИмущества) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ВидИмущества",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонНезаполненногоПоля, "Вид имущества"),);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО
		И Не ЗначениеЗаполнено(Объект.ИФО) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ИФО",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонНезаполненногоПоля, "ИФО"),);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.КФО) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КФО",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонНезаполненногоПоля, "КФО"),);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ЦМО) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ЦМО",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонНезаполненногоПоля, "МОЛ/Место хранения (получатель)"),);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеРеквизитовШапкиПриПриобретении(ШаблонНезаполненногоПоля, Ошибки)
	
	Если Не ЗначениеЗаполнено(Объект.ВнеоборотныйАктив) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"Объект.ВнеоборотныйАктив",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонНезаполненногоПоля, "Объект вложений"),);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.СчетКредита) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.СчетКредита",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонНезаполненногоПоля, "Счет вложений"),);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ВнеоборотныйАктив) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"Объект.ВнеоборотныйАктив",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонНезаполненногоПоля, "Объект вложений"),);
	КонецЕсли;                      
	
	Если НЕ Объект.ПоступлениеБиблиотечногоФонда 
		И Объект.ВидПоступления <> Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление Тогда
		Если Не ЗначениеЗаполнено(Объект.Количество) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.Количество",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонНезаполненногоПоля, "Количество вложений"),);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Перем Ошибки;
	// Проверка заполнения реквизитов выполняется программно для
	// более корректного вывода сообщений об ошибках заполнения
	
	ШаблонНезаполненногоПоля = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "%1");
	
	ПроверитьЗаполнениеОбщихРеквизитовШапки(ШаблонНезаполненногоПоля, Ошибки);
	
	Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(Объект.ВидПоступления) Тогда
		ПроверитьЗаполнениеРеквизитовШапкиПриПриобретении(ШаблонНезаполненногоПоля, Ошибки);
	КонецЕсли;
	
	Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПоступлениеИзПользования(Объект.ВидПоступления)
		И НЕ Объект.ПередачаЧастейОбъектов Тогда
		Если Не ЗначениеЗаполнено(Объект.ЦМООтправитель) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ЦМООтправитель",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНезаполненногоПоля,
					"МОЛ/Место хранения (отправитель)"),);
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ОсновныеСредства.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ОсновныеСредства",
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список", "Заполнение",,,
			"Основные средства"),);
	КонецЕсли;
	
	// если есть ошибки заполнения шапки, то проверять заполнение таблицы не имеет смысла
	Если ЗначениеЗаполнено(Ошибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	ЭтоПоступлениеИзПользования = УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПоступлениеИзПользования(
		Объект.ВидПоступления);
	ПараметрыПроверки = УправлениеОсновнымиСредствамиКлиентСервер.ПараметрыПроверкиДанныхСтрокиПринятияКУчетуПриПроведении();
	ПроверитьИнвентарныйНомер = (Объект.ВидПоступления <> Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАЗабаланс
		И НЕ Объект.ПоступлениеБиблиотечногоФонда);
//	ПараметрыПроверки.Вставить("ВидИмущества", Объект.ВидИмущества);
	ПараметрыПроверки.Вставить("ГруппаОшибок", "Основные средства");
	ПараметрыПроверки.Вставить("ПроверитьИнвентарныйНомер", ПроверитьИнвентарныйНомер);
	
	Для каждого ТекущаяСтрока Из Объект.ОсновныеСредства Цикл
		Если Объект.ВидИмуществаВТабличнойЧасти Тогда
			ПараметрыПроверки.Вставить("ВидИмущества", 
				?(Объект.ВидИмуществаВТабличнойЧасти, ТекущаяСтрока.ВидИмущества, Объект.ВидИмущества));
		КонецЕсли;	
		
		ПроверятьНомерИнвКарточки = НЕ ЭтоПоступлениеИзПользования И ТекущаяСтрока.СоздатьИнвентарнуюКарточку;
		ПараметрыПроверки.Вставить("ПроверятьНомерИнвКарточки", ПроверятьНомерИнвКарточки);
		ПараметрыПроверки.Вставить("НомерСтроки", ТекущаяСтрока.НомерСтроки);
		УправлениеОсновнымиСредствамиКлиентСервер.ДанныеСтрокиПринятияКУчетуГотовыКПроведению(
			ТекущаяСтрока, ПараметрыПроверки, Ошибки);
		
		ПроверитьЗаполнениеСтроки(ТекущаяСтрока, ЭтотОбъект, Ошибки, Ложь);
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	Если Отказ Тогда
		ПроверяемыеРеквизиты.Очистить();
	КонецЕсли;
	
	ПрослеживаемостьБГУ.КонтрольЗаполненияСведенийПрослеживаемости(ЭтотОбъект, "ОсновныеСредства", Отказ);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ОсновныеСредства.Форма.ГрупповойВвод" Тогда
		ОбработкаГрупповогоВводаОССервер(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ДобавлениеСпискаДМ.Форма.Форма" Тогда
		ОбработкаДобавленияДМДляОбъектаНаСервере(ВыбранноеЗначение, ЭтаФорма.ВариантВводаДанныхДМ);
		УстановитьВидимостьДанныхДрагМатериалов();
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ДрагМатериалыВОбъектахНФАПоТехДокументации.Форма.ФормаВыбора" Тогда
		ТекДанные = Элементы.СписокНФАДокументаОснования.ТекущиеДанные;
		Если НЕ ТекДанные = Неопределено Тогда
			ДобавитьДрагМатериалыОбъектаПоТехДокументации(ВыбранноеЗначение, ТекДанные.ОсновноеСредство, ТекДанные.ИнвентарныйНомер, ТекДанные.Количество);
		КонецЕсли;
	ИначеЕсли ПрослеживаемостьФормыБГУКлиент.СобытиеВыборПодбораРНПТ(ИсточникВыбора) Тогда
		ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.СведенияЭлектронногоАктаОПриемеПередачеНФА" Тогда
		ОбработатьВыборСведенийЭлектронногоАктаОПриемеПередаче(ВыбранноеЗначение);
	КонецЕсли;

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьКомиссии();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами"
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "ОбновитьСостояниеЭДАктов" Тогда
		ОбновитьСостояниеЭДОАктаПоФорме0510448НаКлиенте();
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".
		
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьДрагМатериалы" Тогда
		ЗаполнитьОбъектыСДрагМатериалами();
		ЗаполнитьКлючиСтрокДрагМатериалов();
	КонецЕсли;	
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	УправлениеОсновнымиСредствамиКлиентСервер.ОчиститьРасчетныеДанныеКапвложений(ЭтотОбъект);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ОтразитьВМежотчетномПериоде", ОтразитьВМежотчетномПериоде);
	БухгалтерскийУчетКлиент.ОчиститьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
		 Или ЭтотОбъект.КэшПараметров.Локальные.ОтразитьВМежотчетномПериоде <> ОтразитьВМежотчетномПериоде Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		ПересчитатьОставшийсяСрокИспользованияПриИзмененииДаты();
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
		Или ЭтотОбъект.КэшПараметров.Локальные.ОтразитьВМежотчетномПериоде <> ОтразитьВМежотчетномПериоде Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
		ОтражатьВНалоговомУчете =
			УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВНалоговомУчетеПринятиеКУчету(Объект);
		ОтражатьВУСНДоходыМинусРасходы =
			УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВУСНДоходыМинусРасходыПринятиеКУчету(Объект);
		
		УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
		
	КонецЕсли;
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьДатаСПереходомНачалаПрослеживаемости
		Или (ВедетсяУчетПрослеживаемыхТоваров И Не ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня) Тогда
		ВедетсяУчетПрослеживаемыхТоваров = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);
		УстановитьДопустимыеКодыОперацийПрослеживаемости(ЭтотОбъект);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьТаблицуСчетовУчетаОС(Объект.Дата, Объект.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
	УстановитьДоступностьДоговора(ЭтаФорма, Объект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	ЗаполнениеРеквизитовОбъектов.ЗаполнитьПодписанта(Объект, "Руководитель", "Руководитель", Объект.ПодразделениеОтправитель);
	
	ОтражатьВНалоговомУчете =
		УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВНалоговомУчетеПринятиеКУчету(Объект);
	ОтражатьВУСНДоходыМинусРасходы =
		УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВУСНДоходыМинусРасходыПринятиеКУчету(Объект);
	
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
	ЗаполнитьТаблицуСчетовУчетаОС(Объект.Дата, Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПоступленияПриИзменении(Элемент)

	ПриИзмененииВидПоступления(ЭтотОбъект);
	ВидПоступленияПриИзмененииНаСервере();
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	ОбновитьАналитикуОперацииПоДрагМатериалам();
	
КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзменении(Элемент)
	
	ОбнулитьСуммыВложений();
	
	ОтражатьВНалоговомУчете =
		УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВНалоговомУчетеПринятиеКУчету(Объект);
	ОтражатьВУСНДоходыМинусРасходы =
		УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВУСНДоходыМинусРасходыПринятиеКУчету(Объект);
	
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетКредитаПриИзменении(Элемент)
	Перем Ошибки;
	
	ОбнулитьСуммыВложений();
	
	ОпределитьНаличиеДоговораВложения();
	
	СчетВложенийСоответствуетВидуИмущества(ЭтаФорма, Ошибки);
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнеоборотныйАктивПриИзменении(Элемент)
	
	ОбнулитьСуммыВложений();
	
	ВнеоборотныйАктивПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВнеоборотныйАктивПриИзмененииНаСервере()
	
	ДанныеОбъектаВложений = УправлениеОсновнымиСредствами.ДанныеОбъектаОС(Объект.ВнеоборотныйАктив, Объект.Ссылка);
	Объект.СчетКредита = ДанныеОбъектаВложений.СчетВложений;
	
	ОбъектВложений_ВидНФА = ДанныеОбъектаВложений.ВидНФА;
	
	Если ЗаполненыОбязательныеРеквизитыДляРасчетаСуммыВложений(ЭтаФорма) Тогда
		РассчитатьСуммуВложенийНаСервере();
	КонецЕсли;
	УстановитьЕстьПрослеживаемыеТовары();
	УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
	ЗаполнитьМЦВнеоборотногоАктиваСДрагМатериалами(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	РассчитатьЦенуЕдиницыВложений(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьДоступностьДоговора(ЭтаФорма, Объект);
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПоступленияПриИзменении(Элемент)
	
	ТекущийКурсВалюты = ПолучитьКурсВалюты(Объект.ВалютаПоступления, Объект.Дата);
	Объект.Курс = ТекущийКурсВалюты.Курс;
	Объект.Кратность = ТекущийКурсВалюты.Кратность;
	ПересчитатьВалютнуюСуммуВоВсехСтроках();
	
	УстановитьВидимостьСуммВВалюте(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОС(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИмуществаПриИзменении(Элемент)
	Перем Ошибки;
	
	УстановитьПоДокументуВозможенУчетПрослеживаемыхТоваров(ЭтотОбъект);
	УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
	
	СчетВложенийСоответствуетВидуИмущества(ЭтаФорма, Ошибки);
	Для Каждого СтрокаОС Из Объект.ОсновныеСредства Цикл
		СчетУчетаОССоответствуетВидуИмущества(ЭтаФорма, СтрокаОС, Ошибки);
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаДрагМатериалы" Тогда
		ЗаполнитьОбъектыСДрагМатериалами();
		ЗаполнитьМЦВнеоборотногоАктиваСДрагМатериалами();
		ЗаполнитьКлючиСтрокДрагМатериалов();
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаДополнительно" Тогда
		ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора",,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	ВведенНаОснованииЭДП = Ложь;
	ЭлектронныеДокументыБГУКлиент.ОткрытьДокументОснованиеПоСсылкеСостояниеЭДО(ЭтаФорма, Объект.Ссылка,
		СтандартнаяОбработка, ВведенНаОснованииЭДП, Объект.ДокументОснование);
	
	Если Не ВведенНаОснованииЭДП Тогда
		// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
		// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
			ЗаполнитьПоДокументуОснованию(Объект.ДокументОснование);
		ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ИнвентаризационнаяОписьНФА") Тогда
			СсылкаЦелевогоДокумента = Неопределено;
			Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
				СсылкаЦелевогоДокумента = Объект.Ссылка;
			КонецЕсли;	
			ДопПараметры = Новый Структура("СсылкаЦелевогоДокумента", СсылкаЦелевогоДокумента);
			Оповещение = Новый ОписаниеОповещения("ДокументОснованиеПриИзменении_Завершение", ЭтотОбъект, ДопПараметры);
			УправлениеОсновнымиСредствамиКлиент.ВвестиЦелевойДокументНаОсновании(
				Объект.ДокументОснование, ЭтотОбъект, Оповещение, "ПринятиеКУчетуОбъектовОС");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВМежотчетномПериодеПриИзменении(Элемент)
	
	Если ОтразитьВМежотчетномПериоде Тогда
		Объект.Дата = КонецГода(Объект.Дата);
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"));
	Иначе
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка"));
	КонецЕсли;
	
	ОтразитьВМежотчетномПериодеПриИзмененииНаСервере();
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьВМежотчетномПериодеПриИзмененииНаСервере()
	
	// Может измениться дата определения параметров учетной политики.
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтражатьВПрослеживаемостиПриИзменении(Элемент)
	УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПрослеживаемыйТоварНажатие(Элемент)
	ПрослеживаемостьФормыБГУКлиент.ПоказатьПредупреждениеПрослеживаемыйТовар();
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйДокументПриИзменении(Элемент)
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВКарточкеКапвложенийПриИзменении(Элемент)
	УстановитьВидимостьЭлементовФормы_КарточкаКапвложений(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеБиблиотечногоФондаПриИзменении(Элемент)
	УправлениеОсновнымиСредствамиКлиент.ОчиститьКоличествоВТЧДляБиблиотечногоФонда(Объект.ОсновныеСредства);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередачаЧастейОбъектовПриИзменении(Элемент)
	Если Объект.ПередачаЧастейОбъектов Тогда
		ОчиститьКоличествоВТабЧасти(ЭтотОбъект);
	КонецЕсли;	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВидИмуществаВТабличнойЧастиПриИзменении(Элемент)
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСостояниеЭДОАктыОПриемеПередачеНФАНажатие(Элемент)

	ЭлектронныеДокументыБГУКлиент.ОткрытьСостояниеЭДОАктамиОПриемеПередачеНФА(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваНаименованиеГТНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора",,Элемент);
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтотОбъект.Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);

КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперации()
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере()
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_КапитальныеВложения

&НаКлиенте
Процедура КапитальныеВложенияКПСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КапитальныеВложенияКПСОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛожЬ;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОсновныеСредства

&НаКлиенте
Процедура ОсновныеСредстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТребуетсяЗаполнитьВсеДанныеСтрокиПослеИзмененияОС = НоваяСтрока;
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.ИдентификаторСтроки = "";
		ТекущиеДанные.РНПТ = "";
	КонецЕсли;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(
			Объект.ВидПоступления) Тогда
			
			Если ЗначениеЗаполнено(ОбъектВложений_ВидНФА)
				И ОбъектВложений_ВидНФА <> ПредопределенноеЗначение(
				"Перечисление.ВидыНФА.КапВложения") Тогда
				
				ТекущиеДанные.ОсновноеСредство = Объект.ВнеоборотныйАктив;
				ОсновноеСредствоПриИзмененииНаСервере(ТекущиеДанные.ПолучитьИдентификатор(),
					ТребуетсяЗаполнитьВсеДанныеСтрокиПослеИзмененияОС);
				
				ТекущиеДанные.КПС = ?(Объект.КапитальныеВложения.Количество() = 0, Неопределено,
					Объект.КапитальныеВложения[0].КПС);
				
			КонецЕсли;
			
			Если НЕ Объект.ПередачаЧастейОбъектов Тогда
				Если ПервоначальнаяСтоимостьЕдиницы < ПервыйПределОС Тогда
					// ОС до 3000 обычно учитываются без инв. номеров,
					// значит можно ввести все количество в одну строку
					Если Объект.ОсновныеСредства.Количество() > 1 Тогда
						// вероятно, все таки будут указаны инв. номера
						ТекущиеДанные.Количество = 1;
					Иначе                                                                                  
						ТекущиеДанные.Количество = Объект.Количество;
					КонецЕсли;
				Иначе
					// будут указаны инв номера
					ТекущиеДанные.Количество = 1;
				КонецЕсли;
			КонецЕсли;
			
			ПересчитатьСуммыТекущейСтроки(ЭтотОбъект, ТекущиеДанные);
			
		КонецЕсли;
		
		Если Объект.ВидПоступления = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21") Тогда
			
			ТекущиеДанные.ПорядокПогашенияСтоимости = ПредопределенноеЗначение(
				"Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию");
			
		КонецЕсли;
		
		// пробуем найти этот объект в ранее введенных строках
		// если найдется, то заполнить отражение в учете из этой строки
		Если НЕ ЗаполнитьОтражениеВУчетеИзРанееВведеннойСтроки(ТекущиеДанные) Тогда
			УстановитьРекомедуемыеОтражениеВУчетеВСтроке(ЭтотОбъект, ТекущиеДанные);
		КонецЕсли;
			
		ОбновитьТекстЗаголовковВСтрокеТаблицыОС(ТекущиеДанные, Строка(Объект.ВалютаПоступления),
			Строка(ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета));
		ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(ЭтотОбъект, ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьПараметрыСтрокиВоВсеСвязанныеСтроки(Элементы.ОсновныеСредства.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ОсновныеСредстваОтражениеВУчете"
		Или Поле.Имя = "ОсновныеСредстваОтражениеВУчетеЕстьОшибка"Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуНастройкиОтраженияВУчете();
	КонецЕсли;
	
	Если Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение")
		Или Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление") Тогда
		ПрослеживаемостьФормыБГУКлиент.ОсновныеСредстваВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка);
	Иначе
		Если Поле.Имя = "ОсновныеСредстваРНПТ" Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыПодбораРНПТ = ПрослеживаемостьФормыБГУКлиент.ПараметрыОткрытияФормыПодбораРНПТ("ОсновныеСредства");
			ПараметрыПодбораРНПТ.ИмяКолонкиНоменклатура = "ОсновноеСредство";
			ПараметрыПодбораРНПТ.ПредставлениеКолонкиНоменклатура = НСтр("ru = 'Основное средство'");
			ПараметрыПодбораРНПТ.ПроверятьПризнакПрослеживаемыйТовар = Ложь;
			ПараметрыПодбораРНПТ.ПрослеживаемыйТовар = Элементы.ОсновныеСредства.ТекущиеДанные.ПрослеживаемыйТовар;
			ПараметрыПодбораРНПТ.ИмяФормыПодбора = "ФормаПодбораРНПТДляОС";
			ПрослеживаемостьФормыБГУКлиент.ОткрытьФормуПодбораРНПТ(ЭтотОбъект, ПараметрыПодбораРНПТ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОсновноеСредствоПриИзмененииНаСервере(ТекущиеДанные.ПолучитьИдентификатор(),
		ТребуетсяЗаполнитьВсеДанныеСтрокиПослеИзмененияОС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТребуетсяЗаполнитьВсеДанныеСтрокиПослеИзмененияОС <> Истина Тогда
		ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено И ВыбранноеЗначение <> ТекущиеДанные.ОсновноеСредство Тогда
			ТребуетсяЗаполнитьВсеДанныеСтрокиПослеИзмененияОС = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОсновноеСредствоПриИзмененииНаСервере(Знач ИдентификаторСтроки, Знач ЗаполнитьВсеДанныеСтрокиПослеИзмененияОС, Знач ВызовПодбор = Ложь)
	
	ТекущаяСтрока = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ДанныеЗаполнены = Ложь;
	
	Если ЗаполнитьВсеДанныеСтрокиПослеИзмененияОС = Истина Тогда
		
		Для Каждого ТекСтрока Из Объект.ОсновныеСредства Цикл
			
			Если ТекСтрока.ОсновноеСредство = ТекущаяСтрока.ОсновноеСредство
				И ТекСтрока.ПолучитьИдентификатор() <> ИдентификаторСтроки Тогда
				
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ТекСтрока, "СчетУчетаОС, ВидНФА, ТипНФА, ГрупповойУчет, ПрослеживаемыйТовар, СтранаПроисхождения");
				
				ЗаполнитьСтрокуИзДругойСтроки(ТекущаяСтрока, ТекСтрока, ОтражатьВНалоговомУчете, ОтражатьВУСНДоходыМинусРасходы);
				ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(ЭтотОбъект, ТекСтрока);
				
				ДанныеЗаполнены = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ДанныеЗаполнены Тогда
		
		ДанныеОбъектаОС = УправлениеОсновнымиСредствами.ДанныеОбъектаОС(ТекущаяСтрока.ОсновноеСредство, Объект.Ссылка);
		ТекущаяСтрока.ВидНФА		= ДанныеОбъектаОС.ВидНФА;
		ТекущаяСтрока.ТипНФА		= ДанныеОбъектаОС.ТипНФА;
		ТекущаяСтрока.ГрупповойУчет	= ДанныеОбъектаОС.ГрупповойУчет;
		ТекущаяСтрока.СчетУчетаОС	= ДанныеОбъектаОС.СчетУчета;
		ТекущаяСтрока.КПС			= ДанныеОбъектаОС.КПС;
		
		Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(Объект.ВидПоступления) Тогда
			// Признак прослеживаемости не может отличаться от признака у объекта вложения
			ТекущаяСтрока.ПрослеживаемыйТовар = ЕстьПрослеживаемыеТовары;
		Иначе
			ТекущаяСтрока.ПрослеживаемыйТовар = ПрослеживаемостьБГУ.ПрослеживаемоеОсновноеСредство(ТекущаяСтрока.ОсновноеСредство, Объект);
		КонецЕсли;
		ТекущаяСтрока.СтранаПроисхождения = ДанныеОбъектаОС.СтранаПроисхождения;
		
		Если Объект.ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзАрендыОперУчет
			Или Объект.ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользованияОперУчет
			Или Объект.ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21 Тогда
			
			ТекущаяСтрока.СчетУчетаОС = УправлениеОсновнымиСредствамиПовтИсп.ЗабалансовыйСчетОС(ДанныеОбъектаОС.СчетУчета);
			
		КонецЕсли;
		
		ТекущаяСтрока.НомерИнвентарнойКарточки	 = "";
		ТекущаяСтрока.СоздатьИнвентарнуюКарточку = Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.СрокПолезногоИспользования) Тогда
		УправлениеОсновнымиСредствами.УстановитьСрокПолезногоИспользованияВСтрокеТЧ(
			ТекущаяСтрока, "ПринятиеКУчетуОбъектовОС");
	КонецЕсли;
	
	Если УправлениеОсновнымиСредствамиКлиентСервер.ПризнакЕстьПрослеживаемыеТоварыВТабличнойЧасти(Объект.ВидПоступления) Тогда
		УстановитьЕстьПрослеживаемыеТовары();
		УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
	КонецЕсли;
	УстановитьРекомедуемыеОтражениеВУчетеВСтроке(ЭтотОбъект, ТекущаяСтрока);
	ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(ЭтотОбъект, ТекущаяСтрока);
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.СчетУчетаОС) Тогда
		ЗаполнитьДанныеСчетаВСтроке(ТекущаяСтрока);
	КонецЕсли;
	
	Если Не ВызовПодбор Тогда
		АвтозаполнениеКПСПоСчетуВСтроке(ТекущаяСтрока, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваИнвентарныйНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ЭтоПервый = Истина;
	
	ВидыПоступленийСо106 = Новый Массив;
	ВидыПоступленийСо106.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление"));
	ВидыПоступленийСо106.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение"));
	ЗаполнятьСуммы = (ВидыПоступленийСо106.Найти(Объект.ВидПоступления) <> Неопределено);
	
	Для Каждого ИнвентарныйНомер Из ВыбранноеЗначение Цикл
		Если ЭтоПервый Тогда
			ЗаполняемаяСтрока = ТекущиеДанные;
			ЭтоПервый = Ложь;
		Иначе
			ЗаполняемаяСтрока = Объект.ОсновныеСредства.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаполняемаяСтрока, ТекущиеДанные);
			ЗаполняемаяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
		КонецЕсли;
		ЗаполняемаяСтрока.ИнвентарныйНомер = ИнвентарныйНомер;
		Если НЕ Объект.ПередачаЧастейОбъектов Тогда
			ЗаполняемаяСтрока.Количество = 1;
		КонецЕсли;	
		Если ЗаполнятьСуммы И ЗначениеЗаполнено(ПервоначальнаяСтоимостьЕдиницы) Тогда
			ЗаполняемаяСтрока.Сумма   = ПервоначальнаяСтоимостьЕдиницы;
			ЗаполняемаяСтрока.СуммаНУ = ПервоначальнаяСтоимостьЕдиницыНУ;
		КонецЕсли;	
	КонецЦикла;
	
	СведенияОбъектаОС = Новый Структура("ОсновноеСредство, ИнвНомер",
		ТекущиеДанные.ОсновноеСредство, ТекущиеДанные.ИнвентарныйНомер);
	
	ИнвентарныйНомерОбъектаСДрагМатериаламиПриИзмененииНаСервере(СведенияОбъектаОС);
	ОбновитьАналитикуОперацииПоДрагМатериалам();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваИнвентарныйНомерПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ИзмененныйОбъект = ТекущиеДанные.ОсновноеСредство;
	ИнвНомерИзмененногоОбъекта = ТекущиеДанные.ИнвентарныйНомер;
	СведенияОбъектаОС = Новый Структура("ОсновноеСредство, ИнвНомер", 
		ИзмененныйОбъект, ИнвНомерИзмененногоОбъекта);
	
	ИнвентарныйНомерОбъектаСДрагМатериаламиПриИзмененииНаСервере(СведенияОбъектаОС);
   	ОбновитьАналитикуОперацииПоДрагМатериалам();
                          
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСчетОСПриИзменении(Элемент)
	Перем Ошибки;
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Отказ = Ложь;
	СчетУчетаОССоответствуетВидуИмущества(ЭтаФорма, ТекущиеДанные, Ошибки);
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	Если Не Отказ Тогда
		УстановитьРекомедуемыеОтражениеВУчетеВСтроке(ЭтотОбъект, ТекущиеДанные);
		ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(ЭтотОбъект, ТекущиеДанные);
		АвтозаполнениеКПСПоСчетуВСтроке(ТекущиеДанные, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСчетОСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораРабочегоСчета(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСчетОСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДанныеСтроки = Элементы.ОсновныеСредства.ТекущиеДанные;
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(ВыбранноеЗначение, ДанныеСтроки.КПС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваКПСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораРабочегоСчета(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваКПСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ДанныеСтроки = Элементы.ОсновныеСредства.ТекущиеДанные;
		ДанныеСтроки.СчетУчетаОС = ВыбранноеЗначение.Счет;
		ДанныеСтроки.КПС = ВыбранноеЗначение.КПС;
		ВыбранноеЗначение = ВыбранноеЗначение.КПС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваДатаВводаВЭксплуатациюПриИзменении(Элемент)
	
	УстановитьОставшийсяСрокИспользования(Элементы.ОсновныеСредства.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСрокПолезногоИспользованияПриИзменении(Элемент)
	
	УстановитьОставшийсяСрокИспользования(Элементы.ОсновныеСредства.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтражатьВНалоговомУчете
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.СуммаНУ)
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.СуммаНеУчитываетсяНУ)
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.СуммаЕНВД) Тогда
		ТекущиеДанные.СуммаНУ = ТекущиеДанные.Сумма;
	КонецЕсли;
	
	ПересчитатьВалютнуюСуммуВСтроке(ЭтотОбъект, ТекущиеДанные);
	
	УстановитьРекомедуемыеОтражениеВУчетеВСтроке(ЭтотОбъект, ТекущиеДанные);
	ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(Объект.ВидПоступления) Тогда
		ПересчитатьСуммыТекущейСтроки(ЭтотОбъект, ТекущиеДанные);
	КонецЕсли;
	
	УстановитьРекомедуемыеОтражениеВУчетеВСтроке(ЭтотОбъект, ТекущиеДанные);
	ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОтражениеВУчетеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуНастройкиОтраженияВУчете();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПередУдалением(Элемент, Отказ)
	
	ОбъектНаУдаление = Элементы.ОсновныеСредства.ТекущиеДанные.ОсновноеСредство;
	ИнвНомерОбъектаНаУдаление = Элементы.ОсновныеСредства.ТекущиеДанные.ИнвентарныйНомер;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбъектНФА", ОбъектНаУдаление);
	ПараметрыОтбора.Вставить("ИнвНомер", ИнвНомерОбъектаНаУдаление);
	НайденныеСтроки = Объект.ДрагоценныеМатериалы.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()<>0 Тогда
		режим = РежимДиалогаВопрос.ДаНет;
		ПараметрыОповещения = Новый Структура("НайденныеСтроки", НайденныеСтроки);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОДрагМатериалах", ЭтотОбъект, ПараметрыОповещения);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Удалить данные о содержании драгоценных материалов в удаленном объекте НФА ("+
						СокрЛП(ОбъектНаУдаление)+") на закладке ""Драгоценные материалы""?'"), Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСоздатьИнвентарнуюКарточкуПриИзменении(Элемент)
	
	УправлениеОсновнымиСредствамиКлиент.ПолучитьНомерИнвентарнойКарточи(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваРНПТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПодбора = ПрослеживаемостьФормыБГУКлиент.ПараметрыОткрытияФормыПодбораРНПТ("ОсновныеСредства");
	ПараметрыПодбора.ЭтоПоступление = Ложь;
	ПараметрыПодбора.ТекущийДокумент = Объект.Ссылка;
	ПараметрыПодбора.Период = Объект.Дата;
	ПараметрыПодбора.ВнеоборотныйАктив = Объект.ВнеоборотныйАктив;
	ПараметрыПодбора.Организация = Объект.Организация;
	ПараметрыПодбора.ИмяКолонкиНоменклатура = "ОсновноеСредство";
	ПараметрыПодбора.ПредставлениеКолонкиНоменклатура = НСтр("ru = 'Основное средство'");
	Если Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение")
		Или Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление") Тогда
		ПараметрыПодбора.ИмяФормыПодбора = "ФормаПодбораРНПТДляОС";
	КонецЕсли;
	
	ПрослеживаемостьФормыБГУКлиент.ОткрытьФормуПодбораРНПТ(ЭтотОбъект, ПараметрыПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваРНПТОчистка(Элемент, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти.ПрослеживаемыйТовар Тогда
		УдалитьСтрокиРНПТ(СтрокаТабличнойЧасти.ИдентификаторСтроки);
	КонецЕсли;
	
	ПрослеживаемостьФормыБГУКлиентСервер.ОчиститьПредставлениеРНПТ(ЭтотОбъект, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваВидИмуществаПриИзменении(Элемент)
	Перем Ошибки;
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СчетУчетаОССоответствуетВидуИмущества(ЭтотОбъект, ТекущиеДанные, Ошибки);
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ОсновноеСредство)
		И Не ЗначениеЗаполнено(ТекущиеДанные.СчетУчетаОС) Тогда
		ОсновныеСредстваВидИмуществаПриИзмененииСервер(ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокНФАДокументаОснования

&НаКлиенте
Процедура СписокНФАДокументаОснованияПриАктивизацииСтроки(Элемент)
	
	Если (Элемент.ТекущиеДанные <> Неопределено) И (ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА) Тогда
		ПодключитьОбработчикОжидания("ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНФАДокументаОснованияПриАктивизацииЯчейки(Элемент)
	Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущаяКолонкаТаблицы = Элементы.СписокНФАДокументаОснования.ТекущийЭлемент;

	Если ТекущаяКолонкаТаблицы.Имя = "СписокНФАДокументаОснованияТехДокументацияИнфо" Тогда
		ТекСтрока = Элементы.СписокНФАДокументаОснования.ТекущиеДанные;
		ТехДокументация = ТекСтрока.ТехДокументация;
		ОбъектНФА = ТекСтрока.ОсновноеСредство;
		ОткрытьФормуСведенийОСодержанииДрагМатериаловПоТехДокументации(ОбъектНФА, ТехДокументация);
		Элементы.СписокНФАДокументаОснования.ТекущийЭлемент = Элементы.СписокНФАДокументаОснованияОсновноеСредство;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставКомиссии

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	УстановитьДоступностьКомиссии();
	
	Если Не ЗначениеЗаполнено(Объект.Комиссия) Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = ОбщегоНазначенияБГУКлиент.СтруктураПараметровВыбораКомисии(ЭтотОбъект);
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Объект.Комиссия, ДопПараметры, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ОбработатьПодборКомиссии(ЭтотОбъект, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииОтсутствуетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии1.ТекущиеДанные;
	Если Не ТекущиеДанные.Отсутствует Тогда
		ТекущиеДанные.ПричинаОтсутствия = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии1.ТекущиеДанные;
	ТекущиеДанные.Отсутствует = Не ПустаяСтрока(ТекущиеДанные.ПричинаОтсутствия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1СотрудникОбработкаВыбора(
	Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Элементы.СоставКомиссии1.ТекущиеДанные.Сотрудник Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1СотрудникПриИзменении(Элемент)                 
	УправлениеОсновнымиСредствамиКлиент.ЗаполнитьДанныеЧленаКомиссии(
		Элементы.СоставКомиссии1.ТекущиеДанные, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПредседательОбработкаВыбора(
	Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Объект.Председатель Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПредседательПриИзменении(Элемент)
	УправлениеОсновнымиСредствамиКлиент.ЗаполнитьДанныеЧленаКомиссии(
		Объект, Объект.Дата, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи

&НаКлиенте
Процедура ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачиИмяФайла" Тогда
		УправлениеНФАКлиент.ОткрытьЭлектронныйДокументПриложенияИзФайла(
			ВыбраннаяСтрока, 
			ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи, 
			УникальныйИдентификатор);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ГрупповойВвод(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВызовИзДокумента",Истина);
	ПараметрыФормы.Вставить("Организация",Объект.Организация);
	ПараметрыФормы.Вставить("ПервоначальнаяСтоимость",ПервоначальнаяСтоимостьЕдиницы);
	ПараметрыФормы.Вставить("КоличествоСоздаваемыхОбъектов",Объект.Количество);
	ПараметрыФормы.Вставить("КФО",Объект.КФО);
	ПараметрыФормы.Вставить("СчетУчета",);
	ПараметрыФормы.Вставить("КПС", ?(Объект.КапитальныеВложения.Количество() = 0, Неопределено,
		Объект.КапитальныеВложения[0].КПС));
	ПараметрыФормы.Вставить("ВидИмущества", Объект.ВидИмущества);
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеФормыГрупповогоВводаОС");
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ГрупповойВвод", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	ОбщегоНазначенияБГУКлиент.ОткрытьПодборКомиссии(Элементы.СоставКомиссии, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	
	ИменаРеквизитов = ОбщегоНазначенияБГУКлиент.СтруктураИменРеквизитовВыбораПредседателяКомиссии();
	ОбщегоНазначенияБГУКлиент.НачатьВыборПредседателяКомиссии(ЭтотОбъект, ИменаРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуВложений(Команда)
	
	Перем Ошибки;
	
	Если ЗаполненыОбязательныеРеквизитыДляРасчетаСуммыВложений(ЭтаФорма, Ошибки) Тогда
		РассчитатьСуммуВложенийНаСервере();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦМООтправитель(Команда)
	Объект.ЦМООтправитель = Объект.ЦМО;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодразделениеОтправитель(Команда)
	Объект.ПодразделениеОтправитель = Объект.Подразделение;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПодборОС(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборВложений(Команда)
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект, ПараметрыПодбораКапвложения());
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтражениеВУчетеСтрок(Команда)
	ОткрытьФормуНастройкиОтраженияВУчете();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРеквизитыСтрок(Команда)
	Реквизиты = Новый Структура;
	Если Объект.ВидИмуществаВТабличнойЧасти Тогда
		Реквизиты.Вставить("ВидИмущества", Новый Структура);
		Реквизиты.ВидИмущества.Вставить("СписокВыбора", СписокВидовИмущества(Ложь));
	КонецЕсли;	

	Реквизиты.Вставить("КПС", Новый Структура);
	Реквизиты.КПС.Вставить("Дата", Объект.Дата);
	Реквизиты.КПС.Вставить("Организация", Объект.Организация);
	Реквизиты.КПС.Вставить("ИФО", Объект.ИФО);
	
	Реквизиты.Вставить("СчетУчетаОС", Новый Структура);
	Если Объект.ВидИмуществаВТабличнойЧасти Тогда
		КодыСчетовДляОтбора = КодыСчетовДляОтбора(Объект.ВидПоступления);
	Иначе
		КодыСчетовДляОтбора = КодыСчетовДляОтбора(Объект.ВидПоступления, Объект.ВидИмущества);
	КонецЕсли;
	Реквизиты.СчетУчетаОС.Вставить("Счета", КодыСчетовДляОтбора);
	Реквизиты.СчетУчетаОС.Вставить("ВИерархии", Истина);
	Реквизиты.СчетУчетаОС.Вставить("Дата", Объект.Дата);

	Реквизиты.Вставить("Количество");
	Реквизиты.Вставить("Сумма");

	Если ДоступнаВидимостьПараметровАмортизации(ЭтотОбъект) Тогда
		Реквизиты.Вставить("СрокПолезногоИспользования");
	КонецЕсли;
	Если ДоступнаВидимостьПереданнойАмортизации(ЭтотОбъект) Тогда
		Реквизиты.Вставить("СуммаАмортизации");
	КонецЕсли;
	Если ДоступнаВидимостьДатаВводаВэксплуатацию(ЭтотОбъект) Тогда
		Реквизиты.Вставить("ДатаВводаВЭксплуатацию");
	КонецЕсли;
	Если ДоступнаВидимостьПринятияКУчету(ЭтотОбъект) Тогда
		Реквизиты.Вставить("ПринятиеКУчетуОдновременноСВводомВЭксплуатацию");
	КонецЕсли;
	Если ДоступнаВидимостьСоздатьИнвентарнуюКарточку(ЭтотОбъект) Тогда
		Реквизиты.Вставить("СоздатьИнвентарнуюКарточку");
	КонецЕсли;

	Если ВозможныГарантийныеОбязательства(Объект.ВидПоступления) Тогда
		Реквизиты.Вставить("НаименованиеГТ", Новый Структура);
		Реквизиты.НаименованиеГТ.Вставить("ТипыДляВыбора", 
			Новый ОписаниеТипов("Строка, СправочникСсылка.ВидыПервичныхДокументов"));
		Реквизиты.НаименованиеГТ.Вставить("СинонимДляВыбора", НСтр("ru = 'Вид документа гарантии'")); 

		Реквизиты.Вставить("НомерГТ");
		Реквизиты.Вставить("ДатаГТ");
		Реквизиты.Вставить("СрокДействияГТ");
	КонецЕсли;	
	
	ОповещениеОЗаверщенииИзменения = Новый ОписаниеОповещения("ИзменитьРеквизитыСтрокЗавершение", ЭтотОбъект);
	
	УправлениеНФАКлиент.ИзменитьРеквизитыСтрокТЧ(ЭтотОбъект, 
	"ПринятиеКУчетуОбъектовОС", "ОсновныеСредства", "ОсновныеСредства", Реквизиты, ОповещениеОЗаверщенииИзменения);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРеквизитыСтрокЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ТекСтрока Из Объект.ОсновныеСредства Цикл
		УстановитьОставшийсяСрокИспользования(ТекСтрока);
		УправлениеОсновнымиСредствамиКлиент.ПолучитьНомерИнвентарнойКарточи(
			ЭтотОбъект, Объект.ОсновныеСредства.Индекс(ТекСтрока));
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСписокДМДляОбъекта(Команда)
	
	Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не выбран объект НФА!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,
			Объект.Ссылка, "СписокНФАДокументаОснования", "Объект");
	Иначе
		Если Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки.Количество() = 1 Тогда
			УчетДрагМатериаловКлиент.ОткрытьДобавлениеСпискомДМ(ЭтаФорма, Объект,
				Элементы.СписокНФАДокументаОснования.ТекущиеДанные.ОсновноеСредство,
				Элементы.СписокНФАДокументаОснования.ТекущиеДанные.ИнвентарныйНомер, 
			Элементы.СписокНФАДокументаОснования.ТекущиеДанные.Количество, "Изделия");
			
			ЭтаФорма.ВариантВводаДанныхДМ = 1;
		Иначе
			МассивВыделенныеСтроки = Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки;
			
			АдресТаблицыОбъектовНФА = ПоместитьТаблицуОбъектовНФАДляДМВХранилище(МассивВыделенныеСтроки);
			
			УчетДрагМатериаловКлиент.ОткрытьДобавлениеСпискомДМДляПеречняОбъектов(ЭтаФорма, Объект,
				АдресТаблицыОбъектовНФА, "Изделия"); 
			
			ЭтаФорма.ВариантВводаДанныхДМ = 2;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимОтбораДМПоОбъекту(Команда)
	
	ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА = НЕ ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА;
	УстановитьВидимостьДанныхДрагМатериалов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВСписокДрагМатериалыПоТехДокументации(Команда)
	Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не выбран объект НФА!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, Объект.Ссылка,
			"СписокНФАДокументаОснования", "Объект");
	Иначе
		ОткрытьФорму("Справочник.ДрагМатериалыВОбъектахНФАПоТехДокументации.Форма.ФормаВыбора", , ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокДрагМатериалыПоТехДокументации(Команда)
	ЗаполнитьСписокДрагМатериалыПоТехДокументацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСведенияПоЭлектронномуАктуОПриемеПередаче(Команда)
	ЗаполнитьСведенияПоЭлектронномуАктуОПриемеПередачеНаСервере();
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСведенияПоЭлектронномуДокументуПоставщика(Команда)
	ЗаполнитьСведенияПоЭлектронномуДокументуПоставщикаНаСервере();
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьОбъектыОдногоНФА(Команда)
	
	Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не выбран объект НФА!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,
			Объект.Ссылка, "СписокНФАДокументаОснования", "Объект");
	Иначе
		Если Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки.Количество() = 1 Тогда
			ТекущийЭлементСправочникаНФА = Элементы.СписокНФАДокументаОснования.ТекущиеДанные.ОсновноеСредство;
			
			Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки.Очистить();
			Для Каждого ТекСтрока Из ЭтаФорма.ОбъектыНФАСДрагМатериалами Цикл
				Если ТекСтрока.ОсновноеСредство = ТекущийЭлементСправочникаНФА Тогда
					Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки.Добавить(ТекСтрока.ПолучитьИдентификатор());
				КонецЕсли;
			КонецЦикла;
				
		Иначе
			ТекстОшибки = НСтр("ru='Следует выбрать один объект НФА!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,
				Объект.Ссылка, "СписокНФАДокументаОснования", "Объект");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокДМДляСписания(Команда)
	
	ТекущиеДанные = Элементы.СписокНФАДокументаОснования.ТекущиеДанные; 
	Если ТекущиеДанные = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не выбран объект НФА!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,
			Объект.Ссылка, "СписокНФАДокументаОснования", "Объект");
	Иначе
        ВыбранныйОбъектНФА = Новый Структура;
		ВыбранныйОбъектНФА.Вставить("ОсновноеСредство", ТекущиеДанные.ОсновноеСредство);
		ВыбранныйОбъектНФА.Вставить("ИнвентарныйНомер", ТекущиеДанные.ИнвентарныйНомер);
		
		ЗаполнитьСписокДМДляСписанияНаСервере(ВыбранныйОбъектНФА);
		ЗаполнитьКлючиСтрокДрагМатериалов();
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоместитьРНПТВХранилище(Адрес, ДополнительныеПараметры) Экспорт
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ПоместитьРНПТВХранилищеНаСервере(Адрес, ДополнительныеПараметры.ИдентификаторСтроки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоместитьРНПТВХранилищеНаСервере(Адрес, ИдентификаторСтроки)
	
	ТаблицаРНПТ = Объект.СведенияПрослеживаемости.Выгрузить(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	ПоместитьВоВременноеХранилище(ТаблицаРНПТ, Адрес);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение)
	
	СтрокаТабличнойЧасти = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
			СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
		ОбработкаВыбораРНПТННаСервере(СтрокаТабличнойЧасти.ИдентификаторСтроки, ВыбранноеЗначение, СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораРНПТННаСервере(Знач ИдентификаторСтроки, Знач ВыбранноеЗначение, Знач ИдентификаторСтрокиВнутр)
	
	СтрокаТабличнойЧасти = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдентификаторСтрокиВнутр);
	ПрослеживаемостьФормыБГУ.ОбработкаВыбораРНПТН(ЭтотОбъект, ИдентификаторСтроки, ВыбранноеЗначение);
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТ(ЭтаФорма, СтрокаТабличнойЧасти, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиРНПТ(Знач ИдентификаторСтроки)
	ПрослеживаемостьБГУ.УдалитьСтрокиРНПТ(Объект, ИдентификаторСтроки);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_Прослеживаемость(Форма)
	
	ВидимостьПрослеживаемыйТовар = Ложь;
	ВидимостьОтражатьВПрослеживаемости = Ложь;
	ВидимостьКодОперацииПрослеживаемости = Ложь;
	ВидимостьСтранаПроисхождения = Ложь;
	ВидимостьРНПТ = Ложь;
	Если Форма.ВедетсяУчетПрослеживаемыхТоваров И Форма.ПоДокументуВозможенУчетПрослеживаемыхТоваров И Форма.ЕстьПрослеживаемыеТовары Тогда 
		Если УправлениеОсновнымиСредствамиКлиентСервер.ПризнакЕстьПрослеживаемыеТоварыВШапке(Форма.Объект.ВидПоступления) Тогда
			ВидимостьПрослеживаемыйТовар = Истина;
			ВидимостьСтранаПроисхождения = Истина;
			ВидимостьРНПТ = Истина;
		ИначеЕсли УправлениеОсновнымиСредствамиКлиентСервер.ПризнакЕстьПрослеживаемыеТоварыВТабличнойЧасти(Форма.Объект.ВидПоступления) Тогда
			ВидимостьПрослеживаемыйТовар = Истина;
			ВидимостьОтражатьВПрослеживаемости = Истина;
			ВидимостьКодОперацииПрослеживаемости = Форма.Объект.ОтражатьВПрослеживаемости;
			ВидимостьСтранаПроисхождения = Форма.Объект.ОтражатьВПрослеживаемости;
			ВидимостьРНПТ = Форма.Объект.ОтражатьВПрослеживаемости;
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ПрослеживаемыйТовар",
		"Видимость", ВидимостьПрослеживаемыйТовар);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ОсновныеСредстваПрослеживаемыйТовар",
		"Видимость", ВидимостьПрослеживаемыйТовар);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ОтражатьВПрослеживаемости",
		"Видимость", ВидимостьОтражатьВПрослеживаемости);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "КодОперацииПрослеживаемости",
		"Видимость", ВидимостьКодОперацииПрослеживаемости);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ОсновныеСредстваСтранаПроисхождения",
		"Видимость", ВидимостьСтранаПроисхождения);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ОсновныеСредстваРНПТ",
		"Видимость", ВидимостьРНПТ);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПоДокументуВозможенУчетПрослеживаемыхТоваров(Форма)
	
	ВидПоступления = Форма.Объект.ВидПоступления;
	ВидИмущества = Форма.Объект.ВидИмущества;
	ЭтоДопустимыйВидПоступления = ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление")
		Или ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение")
		Или ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс")
		Или ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21")
		Или ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАЗабаланс");
	ЭтоДопустимыйВидИмущества = ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное")
		Или ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ИноеДвижимое");
	Форма.ПоДокументуВозможенУчетПрослеживаемыхТоваров = ЭтоДопустимыйВидПоступления И ЭтоДопустимыйВидИмущества;
	
КонецПроцедуры

&НаСервере
Функция УстановитьЕстьПрослеживаемыеТовары()
	
	ЕстьПрослеживаемыеТовары = Документы.ПринятиеКУчетуОбъектовОС.ЕстьПрослеживаемыеТовары(Объект);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
	//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДопустимыеКодыОперацийПрослеживаемости(Форма)
	
	Если Не Форма.ВедетсяУчетПрослеживаемыхТоваров Тогда
		Возврат;
	КонецЕсли;
	
	ВидыОперацийПрослеживаемости = ПрослеживаемостьБГУКлиентСервер.ВидыОперацийПрослеживаемости();
	ВидыОперацийПрослеживаемости.ПрочееПоступление = Истина;
	ДанныеВыбора = ПрослеживаемостьБГУКлиентСервер.КодыОперацийПрослеживаемости(ВидыОперацийПрослеживаемости);
	Форма.Элементы.КодОперацииПрослеживаемости.СписокВыбора.ЗагрузитьЗначения(ДанныеВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ОтражатьВНалоговомУчете =
		УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВНалоговомУчетеПринятиеКУчету(Объект);
	ОтражатьВУСНДоходыМинусРасходы =
		УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВУСНДоходыМинусРасходыПринятиеКУчету(Объект);
		
	ЭтоПриобретениеИлиИзготовление =
		УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(Объект.ВидПоступления);
	ВедетсяУчетДрагМатериаловВКапвожениях = 
			УчетДрагМатериалов.ПолучитьКонстантуВестиУчетДрагМатериаловВМЦКапвложений() ИЛИ (Объект.МЦСДрагоценнымиМатериалами.Количество() > 0 И ЭтоПриобретениеИлиИзготовление);	
		
	ВалютаРубли = ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета;
	ПервыйПределОС = УправлениеОсновнымиСредствамиКлиентСервер.ПолучитьПределыОС().ПервыйПределОС;
	ВедетсяУчетПрослеживаемыхТоваров = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);
	УстановитьПоДокументуВозможенУчетПрослеживаемыхТоваров(ЭтотОбъект);
	УстановитьЕстьПрослеживаемыеТовары();
	
	ЗаполнитьДополнительныеРеквизитыФормы();
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОС(ЭтаФорма);
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТВоВсехСтроках(ЭтотОбъект, "ОсновныеСредства", Ложь);
	УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
	УстановитьДопустимыеКодыОперацийПрослеживаемости(ЭтотОбъект);
	
	УстановитьВидимостьЭлементов(ЭтаФорма);
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	УстановитьВидимостьСуммВВалюте(ЭтаФорма);
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
	УстановитьДоступностьДоговора(ЭтаФорма, Объект);
	УстановитьДоступностьКоличества(ЭтотОбъект);
	РассчитатьЦенуЕдиницыВложений(ЭтотОбъект);
	
	БухгалтерскийУчетКлиентСервер.УстановитьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	ОпределитьНаличиеДоговораВложения();
	
	ЗаполнитьТаблицуСчетовУчетаОС(Объект.Дата, Объект.Организация);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации(Форма, Объект)
	
	СвязанныеРеквизиты = Новый Массив;
	СвязанныеРеквизиты.Добавить("Подразделение");
	СвязанныеРеквизиты.Добавить("ПодразделениеОтправитель");
	СвязанныеРеквизиты.Добавить("ЦМО");
	СвязанныеРеквизиты.Добавить("ЦМООтправитель");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы,
		СвязанныеРеквизиты, "Доступность", ЗначениеЗаполнено(Объект.Организация));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоговора(Форма, Объект)
	
	ДоступностьДоговора = ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "Договор", "Доступность", ДоступностьДоговора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыФормы()
	
	// Реквизиты формы.
	ОбъектВложений_ВидНФА = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВнеоборотныйАктив, "ВидНФА");
	
	// Добавленные колонки таблицы ОС.
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		Объект.ОсновныеСредства.Выгрузить(,"ОсновноеСредство").ВыгрузитьКолонку("ОсновноеСредство"),
		"ВидНФА,ТипНФА,ГрупповойУчет");
	
	Для Каждого ТекущаяСтрока Из Объект.ОсновныеСредства Цикл
		ЗначенияРеквизитовОС = ЗначенияРеквизитов[ТекущаяСтрока.ОсновноеСредство];
		Если ЗначенияРеквизитовОС <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ЗначенияРеквизитовОС, "ВидНФА,ТипНФА,ГрупповойУчет");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыОС(Форма)
	
	Объект = Форма.Объект;
	ПредставлениеВалюты = Строка(Объект.ВалютаПоступления);
	ПредставлениеВалютыРеглУчета = Строка(Форма.КэшПараметров.ВалютаРегламентированногоУчета);
	
	Для Каждого ТекущаяСтрока Из Объект.ОсновныеСредства Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыОС(ТекущаяСтрока, ПредставлениеВалюты, ПредставлениеВалютыРеглУчета);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыОС(ТекущаяСтрока, ПредставлениеВалюты, ПредставлениеВалютыРеглУчета)
	
	ТекущаяСтрока.ЗаголовокСумма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сумма (%1):'"), ПредставлениеВалютыРеглУчета);
	ТекущаяСтрока.ЗаголовокСуммаВВалюте = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сумма (%1):'"), ПредставлениеВалюты);
	
	ТекущаяСтрока.ЗаголовокСуммаНУ              = НСтр("ru = 'Сумма:'");
	ТекущаяСтрока.ЗаголовокСуммаНеУчитываетсяНУ = НСтр("ru = 'Не уч.:'");
	ТекущаяСтрока.ЗаголовокСуммаЕНВД            = НСтр("ru = 'ЕНВД:'");
	
	ТекущаяСтрока.ЗаголовокСуммаАмортизации						= НСтр("ru = 'сумма амортизации:'");
	ТекущаяСтрока.ЗаголовокСуммаОбесценения						= НСтр("ru = 'сумма обесценения:'");
	ТекущаяСтрока.ЗаголовокДатаВводаВЭксплуатацию				= НСтр("ru = 'дата ввода в экспл.:'");
	ТекущаяСтрока.ЗаголовокОставшийсяСрокПолезногоИспользования	= НСтр("ru = 'оставшийся срок исп.:'");

	ТекущаяСтрока.ЗаголовокВидГТ = НСтр("ru = 'вид документа:'");
	ТекущаяСтрока.ЗаголовокНомерДатаГТ = НСтр("ru = 'номер / дата / срок действия:'");
	
	ТекущаяСтрока.НадписьВвестиВЭксплуатацию = НСтр("ru = ' ввести в эксплуатацию'");
	ТекущаяСтрока.НадписьСоздатьИнвКарточку = НСтр("ru =' создать'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстОтражениеВУчетеВсехСтрокТаблицыОС(Форма)
	
	Объект = Форма.Объект;
	
	Для каждого ТекущаяСтрока Из Объект.ОсновныеСредства Цикл
		ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(Форма, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(Форма, ТекущаяСтрока)
	
	Перем ПогашениеСтоимостиНУ;
	Перем ПогашениеСтоимостиУСН;
	
	Если ТекущаяСтрока.ПорядокПогашенияСтоимости = ПредопределенноеЗначение(
		"Перечисление.ПорядокПогашенияСтоимостиОС.СтоимостьНеПогашается") Тогда
		ПогашениеСтоимостиБУ = НСтр("ru= 'Стоимость не погашается'");
	ИначеЕсли ТекущаяСтрока.ПорядокПогашенияСтоимости = ПредопределенноеЗначение(
		"Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию") Тогда
		ПогашениеСтоимостиБУ = НСтр("ru= 'Списание при вводе в эксплуатацию'");
	ИначеЕсли ТекущаяСтрока.ПорядокПогашенияСтоимости = ПредопределенноеЗначение(
		"Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации") Тогда
		Если ТекущаяСтрока.СпособНачисленияАмортизации = ПредопределенноеЗначение(
			"Перечисление.СпособНачисленияАмортизации.Линейный") Тогда
			ПогашениеСтоимостиБУ = НСтр("ru = 'Начисление амортизации линейным методом'");
		ИначеЕсли ТекущаяСтрока.СпособНачисленияАмортизации = ПредопределенноеЗначение(
			"Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию") Тогда
			ПогашениеСтоимостиБУ = НСтр("ru = 'Начисление 100% амортизации при вводе в эксплуатацию'");
		ИначеЕсли ТекущаяСтрока.СпособНачисленияАмортизации = ПредопределенноеЗначение(
			"Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка") Тогда
			ПогашениеСтоимостиБУ = НСтр("ru = 'Начисление амортизации методом уменьшаемого остатка'");
		ИначеЕсли ТекущаяСтрока.СпособНачисленияАмортизации = ПредопределенноеЗначение(
			"Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции") Тогда
			ПогашениеСтоимостиБУ = НСтр("ru = 'Начисление амортизации пропорционально объему продукции (работ)'");
		Иначе
			ПогашениеСтоимостиБУ = НСтр("ru = 'Начисление амортизации'");
		КонецЕсли;
	Иначе	
		ПогашениеСтоимостиБУ = НСтр("ru = '<...>'");		
	КонецЕсли;
	
	ПогашениеСтоимостиНУ = НСтр("ru = '<...>'");
	Если ТекущаяСтрока.ПорядокВключенияСтоимостиВСоставРасходовНУ = ПредопределенноеЗначение(
		"Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.СтоимостьНеВключаетсяВРасходы") Тогда
		ПогашениеСтоимостиНУ = НСтр("ru = 'Не включать в расходы'");
	ИначеЕсли ТекущаяСтрока.ПорядокВключенияСтоимостиВСоставРасходовНУ = ПредопределенноеЗначение(
		"Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.ВключениеВРасходыПриПринятииКУчету") Тогда
		ПогашениеСтоимостиНУ = НСтр("ru = 'Включить в расходы при вводе в эксплуатацию'");
	ИначеЕсли ТекущаяСтрока.ПорядокВключенияСтоимостиВСоставРасходовНУ = ПредопределенноеЗначение(
		"Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации") Тогда
		ПогашениеСтоимостиНУ = НСтр("ru = 'Начисление амортизации'");
	КонецЕсли;
	
	ПогашениеСтоимостиУСН = НСтр("ru = '<...>'");
	Если ТекущаяСтрока.ПорядокВключенияСтоимостиВСоставРасходовУСН = ПредопределенноеЗначение(
		"Перечисление.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.НеВключатьВСоставРасходов") Тогда
		ПогашениеСтоимостиУСН = НСтр("ru = 'Не включать в расходы'");
	ИначеЕсли ТекущаяСтрока.ПорядокВключенияСтоимостиВСоставРасходовУСН = ПредопределенноеЗначение(
		"Перечисление.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставМатериальныхРасходов") Тогда
		ПогашениеСтоимостиУСН = НСтр("ru = 'Включить в материальные расходы'");
	ИначеЕсли ТекущаяСтрока.ПорядокВключенияСтоимостиВСоставРасходовУСН = ПредопределенноеЗначение(
		"Перечисление.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставРасходовНаОСиНМА") Тогда
		ПогашениеСтоимостиУСН = НСтр("ru = 'Включить в расходы на ОС (НМА)'");
	КонецЕсли;
	
	Если Форма.ОтражатьВНалоговомУчете Тогда
		
		ШаблонСтроки = НСтр("ru = 'БУ: %1
		|НУ: %2'");
		
		ТекущаяСтрока.ОтражениеВУчете = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСтроки, ПогашениеСтоимостиБУ, ПогашениеСтоимостиНУ);
		
	ИначеЕсли Форма.ОтражатьВУСНДоходыМинусРасходы Тогда
		
		ШаблонСтроки = НСтр("ru = 'БУ: %1
		|УСН: %2'");
		
		ТекущаяСтрока.ОтражениеВУчете = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСтроки, ПогашениеСтоимостиБУ, ПогашениеСтоимостиУСН);
		
	Иначе
		
		ШаблонСтроки = НСтр("ru = '%1'");
		
		ТекущаяСтрока.ОтражениеВУчете = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСтроки, ПогашениеСтоимостиБУ);
		
	КонецЕсли;
	
	ПроверитьЗаполнениеСтроки(ТекущаяСтрока, Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКоличества(Форма)
	
	Форма.Элементы.Количество.ТолькоПросмотр =
		Форма.Объект.ВидПоступления <> ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОсновныеСредстваИтогСуммаВВалюте", "Видимость", Форма.КэшПараметров.ИспользоватьВалютныйУчет);
	
	ЭтоПриобретениеИлиИзготовление =
		УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(Объект.ВидПоступления);
	ЭтоПоступлениеИзПользования = 
		УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПоступлениеИзПользования(Объект.ВидПоступления);
		
	ВО_Приобретение = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение");	
	ВО_ПоступлениеНФАБаланс = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс");	
	ВО_ПоступлениеНФАЗабаланс = 
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАЗабаланс");	
	ВО_ПринятиеКУчетуИзготовление = 
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление");	
	
	ВидимыеЭлементы = Новый Массив;
	ВидимыеЭлементы.Добавить("ЗаполнитьЦМООтправитель");
	ВидимыеЭлементы.Добавить("ЗаполнитьПодразделениеОтправитель");
	ВидимыеЭлементы.Добавить("ЦМООтправитель");
	ВидимыеЭлементы.Добавить("ПодразделениеОтправитель");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ВидимыеЭлементы,
		"Видимость", ЭтоПоступлениеИзПользования И НЕ Объект.ПередачаЧастейОбъектов);	
		
	ТекЭлементы = Новый Массив;
	ТекЭлементы.Добавить("ПередачаЧастейОбъектов");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ТекЭлементы,
		"Видимость", ЭтоПоступлениеИзПользования);	
		
	Элементы.СтраницаКапитальныеВложения.Видимость = ЭтоПриобретениеИлиИзготовление;
	
	ДоступноПринятиеКУчету = ДоступнаВидимостьПринятияКУчету(Форма);
	ЭлементыПринятияКУчету = Новый Массив;
	ЭлементыПринятияКУчету.Добавить(
		"ОсновныеСредстваПринятиеКУчетуОдновременноСВводомВЭксплуатацию");
	ЭлементыПринятияКУчету.Добавить("ОсновныеСредстваНадписьВвестиВЭксплуатацию");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыПринятияКУчету, "Видимость", ДоступноПринятиеКУчету);
	
	ДоступнаВидимостьПараметровАмортизации = ДоступнаВидимостьПараметровАмортизации(Форма);
	
	ДоступнаНастройкаПараметровАмортизации = ЭтоПриобретениеИлиИзготовление
		Или Объект.ВидПоступления = ВО_ПоступлениеНФАБаланс;
		
	ЭлементыАмортизации = Новый Массив;
	ЭлементыАмортизации.Добавить("ОсновныеСредстваПорядокПогашенияСтоимости");
	ЭлементыАмортизации.Добавить("ОсновныеСредстваСпособНачисленияАмортизации");
	ЭлементыАмортизации.Добавить("ОсновныеСредстваНачислятьАмортизацию");
	ЭлементыАмортизации.Добавить("ОсновныеСредстваСчетУчетаЗатрат");
	ЭлементыАмортизации.Добавить("ОсновныеСредстваКЭКЗатрат");
	ЭлементыАмортизации.Добавить("ОсновныеСредстваКПСЗатрат");
	ЭлементыАмортизации.Добавить("ОсновныеСредстваПодразделениеЗатрат");
	ЭлементыАмортизации.Добавить("ОсновныеСредстваСубконтоЗатрат1");
	ЭлементыАмортизации.Добавить("ОсновныеСредстваСубконтоЗатрат2");
	ЭлементыАмортизации.Добавить("ОсновныеСредстваСубконтоЗатрат3");
	
	Если ДоступнаВидимостьПараметровАмортизации Тогда
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
			ЭлементыАмортизации, "Доступность", ДоступнаНастройкаПараметровАмортизации);
	КонецЕсли;

	ЭлементыАмортизации.Добавить("ОсновныеСредстваСрокПолезногоИспользования");
	ЭлементыАмортизации.Добавить("ОсновныеСредстваОтражениеВУчете");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыАмортизации, "Видимость", ДоступнаВидимостьПараметровАмортизации
			ИЛИ Форма.Объект.ВидПоступления = ВО_ПоступлениеНФАЗабаланс);
	
	ЭлементыФормы = Новый Массив;
	ЭлементыФормы.Добавить("ОсновныеСредстваОтражениеВУчетеЕстьОшибка");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыФормы, "Видимость", ДоступнаВидимостьПараметровАмортизации);
	
	ВозможнаПереданнаяАмортизация = ДоступнаВидимостьПереданнойАмортизации(Форма);
	ЭлементыПереданнойАмортизации = Новый Массив;
	ЭлементыПереданнойАмортизации.Добавить("ОсновныеСредстваСуммаАмортизации");
	ЭлементыПереданнойАмортизации.Добавить("ОсновныеСредстваЗаголовокСуммаАмортизации");
	ЭлементыПереданнойАмортизации.Добавить("ОсновныеСредстваСуммаОбесценения");
	ЭлементыПереданнойАмортизации.Добавить("ОсновныеСредстваЗаголовокСуммаОбесценения");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыПереданнойАмортизации, "Видимость", ВозможнаПереданнаяАмортизация);
	
	ВозможнаДатаВводаВЭксплуатацию = ДоступнаВидимостьДатаВводаВэксплуатацию(Форма);
	ЭлементыПереданнойАмортизации = Новый Массив;
	ЭлементыПереданнойАмортизации.Добавить("ОсновныеСредстваДатаВводаВЭксплуатацию");
	ЭлементыПереданнойАмортизации.Добавить("ОсновныеСредстваОставшийсяСрокПолезногоИспользования");
	ЭлементыПереданнойАмортизации.Добавить("ОсновныеСредстваЗаголовокДатаВводаВЭксплуатацию");
	ЭлементыПереданнойАмортизации.Добавить("ОсновныеСредстваЗаголовокОставшийсяСрокПолезногоИспользования");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыПереданнойАмортизации, "Видимость", ВозможнаДатаВводаВЭксплуатацию);
	
	ДоступнаИнвКарточка = ДоступнаВидимостьСоздатьИнвентарнуюКарточку(Форма);
	ЭлементыИнвКарточки = Новый Массив;
	ЭлементыИнвКарточки.Добавить("ОсновныеСредстваСоздатьИнвентарнуюКарточку");
	ЭлементыИнвКарточки.Добавить("ОсновныеСредстваНадписьСоздатьИнвКарточку");
	ЭлементыИнвКарточки.Добавить("ОсновныеСредстваНомерИнвентарнойКарточки");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыИнвКарточки, "Видимость", ДоступнаИнвКарточка);
	
	ТекЭлементы = Новый Массив;
	ТекЭлементы.Добавить("Количество");
	ТекЭлементы.Добавить("ОсновныеСредстваКоличество");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ТекЭлементы,
		"Видимость", НЕ Объект.ПоступлениеБиблиотечногоФонда И НЕ Объект.ПередачаЧастейОбъектов);
		
	ТекЭлементы = Новый Массив;
	ТекЭлементы.Добавить("ВидИмуществаВТабличнойЧасти");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ТекЭлементы,
		"Видимость", НЕ ЭтоПриобретениеИлиИзготовление);
	Если Элементы.ВидИмуществаВТабличнойЧасти.Видимость Тогда
		Элементы.ВидИмущества.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ГруппаВидИмущества.СквозноеВыравнивание = СквозноеВыравнивание.НеИспользовать;		
	Иначе
		Элементы.ВидИмущества.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
		Элементы.ГруппаВидИмущества.СквозноеВыравнивание = СквозноеВыравнивание.Авто;		
	КонецЕсли;	
		
	ТекЭлементы = Новый Массив;
	ТекЭлементы.Добавить("ВидИмущества");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ТекЭлементы,
		"Видимость", НЕ Объект.ВидИмуществаВТабличнойЧасти);
		
	ТекЭлементы = Новый Массив;
	ТекЭлементы.Добавить("ОсновныеСредстваВидИмущества");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ТекЭлементы,
		"Видимость", Объект.ВидИмуществаВТабличнойЧасти);
		
	ЭтоИзготовление = Объект.ВидПоступления = ВО_ПринятиеКУчетуИзготовление;
	Элементы.Количество.АвтоОтметкаНезаполненного = НЕ ЭтоИзготовление;
	Элементы.Количество.ОтметкаНезаполненного = НЕ ЭтоИзготовление;

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ОсновныеСредстваГТ");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		МассивЭлементов, "Видимость", ВозможныГарантийныеОбязательства(Объект.ВидПоступления));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДрагоценныеМатериалыГруппаКомандыЗаполнить", "Видимость", ЭтоПриобретениеИлиИзготовление 
								И Форма.ВедетсяУчетДрагМатериаловВКапвожениях);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДрагоценныеМатериалыЗаполнитьСписокДрагМатериалыПоТехДокументации", "Видимость", НЕ (ЭтоПриобретениеИлиИзготовление 
								И Форма.ВедетсяУчетДрагМатериаловВКапвожениях));							
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаСписанияМЦСДрагМатериалами", "Видимость", ЭтоПриобретениеИлиИзготовление 
								И Форма.ВедетсяУчетДрагМатериаловВКапвожениях);	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "АналитикаОперацииСДрагМатериалами", "Видимость", Объект.ВидПоступления = ВО_ПоступлениеНФАБаланс);					
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДоступнаВидимостьПараметровАмортизации(Форма)
	
	Возврат УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(Форма.Объект.ВидПоступления)
		Или Форма.Объект.ВидПоступления = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс")
		Или Форма.Объект.ВидПоступления = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДоступнаВидимостьПереданнойАмортизации(Форма)
	
	Возврат Форма.Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс")
		Или Форма.Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДоступнаВидимостьДатаВводаВэксплуатацию(Форма)
	
	Возврат Форма.Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс")
		Или Форма.Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДоступнаВидимостьПринятияКУчету(Форма)
	
	Возврат УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(Форма.Объект.ВидПоступления)
		Или Форма.Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДоступнаВидимостьСоздатьИнвентарнуюКарточку(Форма)
	
	Возврат(Не УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПоступлениеИзПользования(Форма.Объект.ВидПоступления));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьСуммВВалюте(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ВидимостьСуммВВалюте = (Объект.ВалютаПоступления <> Форма.КэшПараметров.ВалютаРегламентированногоУчета);
	
	ЭлементыСуммВВалюте = Новый Массив;
	ЭлементыСуммВВалюте.Добавить("ОсновныеСредстваЗаголовокСуммаВВалюте");
	ЭлементыСуммВВалюте.Добавить("ОсновныеСредстваСуммаВВалюте");
	
	// Заголовок строки для суммы в рублях тоже нет смысла показывать, если документ в рублях.
	ЭлементыСуммВВалюте.Добавить("ОсновныеСредстваЗаголовокСумма");
	
	// Итоги в валюте в подвале формы.
	ЭлементыСуммВВалюте.Добавить("ГруппаИтогоСуммаВВалюте");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыСуммВВалюте, "Видимость", ВидимостьСуммВВалюте);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовНалоговогоУчета(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ВидимостьЭлементовНалоговогоУчета = Форма.ОтражатьВНалоговомУчете;
	
	// Шапка.
	РеквизитыНУ = Новый Массив;
	РеквизитыНУ.Добавить("СуммаВложенийНУ");
	РеквизитыНУ.Добавить("ПервоначальнаяСтоимостьЕдиницыНУ");
	РеквизитыНУ.Добавить("РасходыНеУчитываетсяНУ");
	РеквизитыНУ.Добавить("РасходыЕНВД");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		РеквизитыНУ, "Видимость", ВидимостьЭлементовНалоговогоУчета);
	
	// Таблица кап.вложений.
	РеквизитыНУ = Новый Массив;
	РеквизитыНУ.Добавить("КапитальныеВложенияСуммаНУ");
	РеквизитыНУ.Добавить("КапитальныеВложенияСуммаНеУчитываетсяНУ");
	РеквизитыНУ.Добавить("КапитальныеВложенияСуммаЕНВД");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		РеквизитыНУ, "Видимость", ВидимостьЭлементовНалоговогоУчета
			И (НалоговыйУчетПовтИспВызовСервера.ВедетсяУчетКапВложенийНУПоКПС(Объект.Дата) ИЛИ НалоговыйУчетПовтИспВызовСервера.ВедетсяУчетКапВложенийНУПоЦМО(Объект.Дата)));
	
	// Таблица объектов ОС, НМА, НПА.
	РеквизитыНУ = Новый Массив;
	РеквизитыНУ.Добавить("ОсновныеСредстваСуммаНУ");
	РеквизитыНУ.Добавить("ОсновныеСредстваСуммаНеУчитываетсяНУ");
	РеквизитыНУ.Добавить("ОсновныеСредстваСуммаЕНВД");
	РеквизитыНУ.Добавить("ОсновныеСредстваЗаголовокСуммаНУ");
	РеквизитыНУ.Добавить("ОсновныеСредстваЗаголовокСуммаНеУчитываетсяНУ");
	РеквизитыНУ.Добавить("ОсновныеСредстваЗаголовокСуммаЕНВД");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		РеквизитыНУ, "Видимость", ВидимостьЭлементовНалоговогоУчета);
	
	ОбновитьТекстОтражениеВУчетеВсехСтрокТаблицыОС(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораРабочегоСчета(Элемент, СтандартнаяОбработка) 
	ТекВидИмущества = Объект.ВидИмущества;
	Если Объект.ВидИмуществаВТабличнойЧасти Тогда
		ТекВидИмущества = Элементы.ОсновныеСредства.ТекущиеДанные.ВидИмущества;
	КонецЕсли;	
	КодыСчетовДляОтбора = КодыСчетовДляОтбора(Объект.ВидПоступления, ТекВидИмущества);
	
	Если Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс") Тогда
		ДанныеСтроки = Элементы.ОсновныеСредства.ТекущиеДанные;
		НачальноеЗначение = Новый Структура("Счет,КПС,КФО", ДанныеСтроки.СчетУчетаОС, ДанныеСтроки.КПС, Объект.КФО);
		
		ОграниченияСписокСчетов = СтрРазделить(КодыСчетовДляОтбора, ",");
		
		НаДату = ?(ОтразитьВМежотчетномПериоде, Объект.Дата + 1, Объект.Дата);
		БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, СтандартнаяОбработка, НачальноеЗначение,
			Объект.Организация, Объект.ИФО, ОграниченияСписокСчетов, Объект.КФО,, НаДату);
	Иначе
		ПараметрСчета = Новый ПараметрВыбора("ОграниченияСчета", КодыСчетовДляОтбора);
		ПараметрСубконто = Новый ПараметрВыбора("ОграничениеПоСубконто", 
			ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства"));
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ПараметрСчета);
		МассивПараметров.Добавить(ПараметрСубконто);
		ТекПараметры = Новый ФиксированныйМассив(МассивПараметров);
		Элемент.ПараметрыВыбора = ТекПараметры;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКомиссиюВДокумент(Результат, ДопПараметры) Экспорт
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Результат, ДопПараметры, Объект);
КонецПроцедуры

// Капитальные вложения

&НаКлиенте
Процедура ОбнулитьСуммыВложений()
	
	Объект.СуммаВложений				= 0;
	Объект.СуммаВложенийНУ				= 0;
	Объект.РасходыНеУчитываетсяНУ		= 0;
	Объект.РасходыЕНВД					= 0;
	Объект.Количество					= 0;
	
	ПервоначальнаяСтоимостьЕдиницы		= 0;
	ПервоначальнаяСтоимостьЕдиницыНУ	= 0;
	
	Объект.КапитальныеВложения.Очистить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполненыОбязательныеРеквизитыДляРасчетаСуммыВложений(Форма, Ошибки = Неопределено)
	
	Объект = Форма.Объект;
	
	РеквизитыДляПроверки = Новый Структура;
	РеквизитыДляПроверки.Вставить("Организация", "Организация");
	Если Форма.КэшПараметров.ИспользоватьУчетПоИФО Тогда
		РеквизитыДляПроверки.Вставить("ИФО", "ИФО");
	КонецЕсли;
	РеквизитыДляПроверки.Вставить("КФО", "КФО");
	РеквизитыДляПроверки.Вставить("ВнеоборотныйАктив", "Объект вложений");
	
	Отказ = ОбщегоНазначенияБГУКлиентСервер.ПроверитьЗаполнениеРеквизитов(РеквизитыДляПроверки, Объект, Ложь, Ошибки);
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура РассчитатьСуммуВложенийНаСервере()
	
	УправлениеОсновнымиСредствами.ЗаполнитьКапитальныеВложенияПоОстаткам(Объект);
	
	ОпределитьНаличиеДоговораВложения();
	
	РассчитатьЦенуЕдиницыВложений(ЭтотОбъект);
	
	Для каждого СтрокаТабЧасти Из Объект.ОсновныеСредства Цикл
		ПересчитатьСуммыТекущейСтроки(ЭтотОбъект, СтрокаТабЧасти);
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Объект.ВидИмущества) И ЗначениеЗаполнено(Объект.СчетКредита) Тогда
		Объект.ВидИмущества = УправлениеОсновнымиСредствамиКлиентСервер.ВидИмуществаПоСчетуУчета(Объект.СчетКредита);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьЦенуЕдиницыВложений(Форма)
	
	Объект = Форма.Объект;
	
	Форма.ПервоначальнаяСтоимостьЕдиницы = Объект.СуммаВложений /
		?(Объект.Количество = 0, 1, Объект.Количество);
	Форма.ПервоначальнаяСтоимостьЕдиницыНУ = Объект.СуммаВложенийНУ /
		?(Объект.Количество = 0, 1, Объект.Количество);
	
КонецПроцедуры

// Основные средства

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСтрокуИзДругойСтроки(Получатель, Источник, НУ, УСН)
	
	ЗаполнитьЗначенияСвойств(Получатель, Источник,
		"Сумма," +
		"СчетУчетаОС,КПС,СрокПолезногоИспользования,ПорядокПогашенияСтоимости," +
		"СпособНачисленияАмортизации,НачислятьАмортизацию,СчетУчетаЗатрат," +
		"КПСЗатрат,КЭКЗатрат,ПодразделениеЗатрат,СубконтоЗатрат1,СубконтоЗатрат2,СубконтоЗатрат3," +
		"СуммаВВалюте,ОтражениеВУчетеБУЗаполненоНекорректно,ОтражениеВУчете,"+
		"НомерИнвентарнойКарточки,СоздатьИнвентарнуюКарточку," +
		"НаименованиеГТ, НомерГТ, ДатаГТ, СрокДействияГТ");
		
	Если НУ Тогда
		ЗаполнитьЗначенияСвойств(Получатель, Источник,
			"СуммаНУ," +
			"ПорядокВключенияСтоимостиВСоставРасходовНУ,НачислятьАмортизациюНУ,СрокПолезногоИспользованияНУ," +
			"СпециальныйКоэффициентНУ,ПроцентКапитальныхВложенийВключаемыхВРасходыНУ," +
			"СчетУчетаЗатратПоАмортизационнойПремии,СубконтоПоАмортизационнойПремии1," +
			"СубконтоПоАмортизационнойПремии2,СубконтоПоАмортизационнойПремии3," +
			"ПодразделениеПоАмортизационнойПремии,СтатьяПрочихРасходов,ОтражениеВУчетеНУЗаполненоНекорректно");
	КонецЕсли;
	
	Если УСН Тогда
		ЗаполнитьЗначенияСвойств(Получатель, Источник,
			"ПорядокВключенияСтоимостиВСоставРасходовУСН,СрокПолезногоИспользованияУСН");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьСуммыТекущейСтроки(Форма, ТекущиеДанные)
	
	Объект = Форма.Объект;
	
	Если ТекущиеДанные.Количество = Объект.Количество
		ИЛИ Объект.ПоступлениеБиблиотечногоФонда Тогда
		ТекущиеДанные.Сумма                = Объект.СуммаВложений;
		ТекущиеДанные.СуммаНУ              = Объект.СуммаВложенийНУ;
		ТекущиеДанные.СуммаНеУчитываетсяНУ = Объект.РасходыНеУчитываетсяНУ;
		ТекущиеДанные.СуммаЕНВД            = Объект.РасходыЕНВД;
		ТекущиеДанные.СуммаАмортизации     = Объект.СуммаАмортизацииВложений;
		ТекущиеДанные.СуммаОбесценения     = Объект.СуммаОбесцененияВложений;
	Иначе
		ТекущиеДанные.Сумма = ТекущиеДанные.Количество * Форма.ПервоначальнаяСтоимостьЕдиницы;
		Если Объект.Количество <> 0 Тогда
			ТекущиеДанные.СуммаАмортизации = ТекущиеДанные.Количество * Объект.СуммаАмортизацииВложений / Объект.Количество;
			ТекущиеДанные.СуммаОбесценения = ТекущиеДанные.Количество * Объект.СуммаОбесцененияВложений / Объект.Количество;
		Иначе
			ТекущиеДанные.СуммаАмортизации = 0;
			ТекущиеДанные.СуммаОбесценения = 0;
		КонецЕсли;
		ТекущиеДанные.СуммаНУ =
			ТекущиеДанные.Количество * Форма.ПервоначальнаяСтоимостьЕдиницыНУ;
		Если Объект.Количество <> 0 Тогда
			ТекущиеДанные.СуммаНеУчитываетсяНУ =
				ТекущиеДанные.Количество * Объект.РасходыНеУчитываетсяНУ / Объект.Количество;
			ТекущиеДанные.СуммаЕНВД =
				ТекущиеДанные.Количество * Объект.РасходыЕНВД / Объект.Количество;
		КонецЕсли;
	КонецЕсли;
	
	ПересчитатьВалютнуюСуммуВСтроке(Форма, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиОтраженияВУчете()
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИменаРеквизитов = "ПорядокПогашенияСтоимости"
		+ ",СпособНачисленияАмортизации"
		+ ",СрокПолезногоИспользования"
		+ ",НачислятьАмортизацию"
		+ ",ПринятиеКУчетуОдновременноСВводомВЭксплуатацию"
		+ ",СчетУчетаЗатрат"
		+ ",КЭКЗатрат"
		+ ",КПСЗатрат"
		+ ",ПодразделениеЗатрат"
		+ ",СубконтоЗатрат1"
		+ ",СубконтоЗатрат2"
		+ ",СубконтоЗатрат3"
		+ ",ПорядокВключенияСтоимостиВСоставРасходовНУ"
		+ ",НачислятьАмортизациюНУ"
		+ ",СрокПолезногоИспользованияНУ"
		+ ",СпециальныйКоэффициентНУ"
		+ ",ПроцентКапитальныхВложенийВключаемыхВРасходыНУ"
		+ ",СчетУчетаЗатратПоАмортизационнойПремии"
		+ ",СубконтоПоАмортизационнойПремии1"
		+ ",СубконтоПоАмортизационнойПремии2"
		+ ",СубконтоПоАмортизационнойПремии3"
		+ ",ПодразделениеПоАмортизационнойПремии"
		+ ",СтатьяПрочихРасходов"
		+ ",ПорядокВключенияСтоимостиВСоставРасходовУСН"
		+ ",СрокПолезногоИспользованияУСН"
		+ ",КоэффициентУскорения"
		+ ",ПараметрВыработки"
		+ ",ПредполагаемыйОбъемВыработки"
		+ ",СчетУчетаОС";
	
	ДанныеТекущейСтроки = Новый Структура(ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(ДанныеТекущейСтроки, ТекущиеДанные);
	
	ПараметрыТекущейСтроки = Новый Структура;
	ПараметрыТекущейСтроки.Вставить("СписокРеквизитовСтрокиДокумента", ИменаРеквизитов);
	ПараметрыТекущейСтроки.Вставить("ОсновноеСредство", ТекущиеДанные.ОсновноеСредство);
	ПараметрыТекущейСтроки.Вставить("ИнвентарныйНомер", ТекущиеДанные.ИнвентарныйНомер);
	ПараметрыТекущейСтроки.Вставить("ПараметрыСтроки", ДанныеТекущейСтроки);
	ПараметрыТекущейСтроки.Вставить("ИспользоватьУчетПоПодразделениям", ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоПодразделениям);
	ПараметрыТекущейСтроки.Вставить("Дата", Объект.Дата);
	ПараметрыТекущейСтроки.Вставить("Организация", Объект.Организация);
	ПараметрыТекущейСтроки.Вставить("ИФО", Объект.ИФО);
	ПараметрыТекущейСтроки.Вставить("ОтражатьВНалоговомУчете", ОтражатьВНалоговомУчете);
	ПараметрыТекущейСтроки.Вставить("ОтражатьВУСНДоходыМинусРасходы", ОтражатьВУСНДоходыМинусРасходы);
	ПараметрыТекущейСтроки.Вставить("ПроверятьЗаполнениеСчетаУчетаЗатрат",
		ПроверятьЗаполнениеСчетаУчетаЗатрат(Объект.ВидПоступления));
	
	ОткрытьФорму("Документ.ПринятиеКУчетуОбъектовОС.Форма.ФормаНастройкаОтраженияВУчете",
		ПараметрыТекущейСтроки,
		ЭтотОбъект,,,,Новый ОписаниеОповещения("ОкончаниеНастройкиОтраженияВУчете", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеНастройкиОтраженияВУчете(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТолькоПросмотр = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ВыделенныеСтроки = Элементы.ОсновныеСредства.ВыделенныеСтроки;
		Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
			
			ТекущиеДанные = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдентификаторСтроки);
			
			Если ТекущиеДанные <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат);
				УстановитьОставшийсяСрокИспользования(ТекущиеДанные);
			КонецЕсли;
			
			ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(ЭтотОбъект, ТекущиеДанные);
			
			УстановитьПараметрыСтрокиВоВсеСвязанныеСтроки(ТекущиеДанные, ВыделенныеСтроки);
			
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыСтрокиВоВсеСвязанныеСтроки(ТекущиеДанные, ВыделенныеСтроки = Неопределено)
	
	Для Каждого ТекСтрока Из Объект.ОсновныеСредства Цикл
		
		// При большом количестве строк в табличной части, это сильно уменьшает количество итераций.
		// Производительность значительно увеличивается.
		Если ВыделенныеСтроки <> Неопределено Тогда
			Если ВыделенныеСтроки.Найти(ТекСтрока.ПолучитьИдентификатор()) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	
		
		Если ТекСтрока <> ТекущиеДанные
			И ТекСтрока.ОсновноеСредство = ТекущиеДанные.ОсновноеСредство И ЗначениеЗаполнено(ТекСтрока.ОсновноеСредство) Тогда
			
			ЗаполнитьСтрокуИзДругойСтроки(ТекСтрока, ТекущиеДанные, ОтражатьВНалоговомУчете, ОтражатьВУСНДоходыМинусРасходы);
			ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(ЭтотОбъект, ТекущиеДанные);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьОтражениеВУчетеИзРанееВведеннойСтроки(ТекущиеДанные)
	Результат = Ложь;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ОсновноеСредство) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого СтрокаДокумента Из Объект.ОсновныеСредства Цикл
		
		Если СтрокаДокумента <> ТекущиеДанные Тогда
			Если СтрокаДокумента.ОсновноеСредство = ТекущиеДанные.ОсновноеСредство Тогда
				ЗаполнитьСтрокуИзДругойСтроки(ТекущиеДанные, СтрокаДокумента, ОтражатьВНалоговомУчете, ОтражатьВУСНДоходыМинусРасходы);
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура УстановитьОставшийсяСрокИспользования(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОставшийсяСрокИспользования = 
		УправлениеОсновнымиСредствамиКлиентСервер.ОставшийсяСрокПолезногоИспользования(
			ТекущиеДанные.ДатаВводаВЭксплуатацию,
			ТекущиеДанные.СрокПолезногоИспользования,
			Объект.Дата);
	ТекущиеДанные.ОставшийсяСрокПолезногоИспользования = 
		?(ОставшийсяСрокИспользования < 0, 0, ОставшийсяСрокИспользования);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОставшийсяСрокИспользованияПриИзмененииДаты()
	
	ЗаданаДатаВводаВЭксплуатацию = Ложь;
	Для каждого ТекущаяСтрока Из Объект.ОсновныеСредства Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.ДатаВводаВЭксплуатацию) Тогда
			ЗаданаДатаВводаВЭксплуатацию = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗаданаДатаВводаВЭксплуатацию Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'В некоторых строках документа указана ""Дата ввода в эксплуатацию"".
                         |После изменения даты рекомендуется пересчитать оставшийся срок полезного использования
                         |в строках документа.
                         |Пересчитать оставшийся срок полезного использования?'");
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения(
		"ПересчитатьОставшийсяСрокИспользованияПриИзмененииДатыЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса,
		РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОставшийсяСрокИспользованияПриИзмененииДатыЗавершение(РезультатВопроса,
	ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Для каждого ТекущаяСтрока Из Объект.ОсновныеСредства Цикл
			УстановитьОставшийсяСрокИспользования(ТекущаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьВалютнуюСуммуВСтроке(Форма, ТекущаяСтрока)
	
	Объект = Форма.Объект;
	
	Если Форма.КэшПараметров.ИспользоватьВалютныйУчет
		И Объект.ВалютаПоступления <> Форма.КэшПараметров.ВалютаРегламентированногоУчета Тогда
		
		ТекущаяСтрока.СуммаВВалюте = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
			ТекущаяСтрока.Сумма,
			Новый Структура("Валюта, Курс, Кратность",
				Форма.КэшПараметров.ВалютаРегламентированногоУчета, 1, 1),
			Новый Структура("Валюта, Курс, Кратность",
				Объект.ВалютаПоступления, Объект.Курс, Объект.Кратность));
		
	Иначе
		ТекущаяСтрока.СуммаВВалюте = ТекущаяСтрока.Сумма;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВалютнуюСуммуВоВсехСтроках()
	
	Для каждого ТекущаяСтрока Из Объект.ОсновныеСредства Цикл
		ПересчитатьВалютнуюСуммуВСтроке(ЭтотОбъект, ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КодыСчетовДляОтбора(ВидПоступления, ВидИмущества = Неопределено)
	Если ВидИмущества = Неопределено Тогда
		Если ВидПоступления
			= ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАЗабаланс") Тогда
			
			КодыСчетов = "01.10,01.20,01.30,02.10,02.20,02.30,02.3";
		ИначеЕсли ВидПоступления
			= ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21") Тогда
			
			КодыСчетов = "21.20,21.30";
		ИначеЕсли УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПоступлениеИзПользования(
			ВидПоступления) Тогда
			
			КодыСчетов = "101.10,101.20,101.30,101.40,111.60,101.90";
		Иначе
			КодыСчетов = "101.10,101.20,101.30,101.40,
			|102.10,102.20,102.30,102.40, 
			|103.10,103.20,103.30,103.40,
			|111.60,
			|101.90,102.90,103.90";
		КонецЕсли;
	Иначе	
		Если ВидПоступления
			= ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАЗабаланс") Тогда
			
			Если ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.НедвижимоеИмущество") Тогда
				КодыСчетов = "01.10,02.10,02.3" + ",01.11,01.12,02.1";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное") Тогда
				КодыСчетов = "01.20,02.20,02.3" + ",01.21,01.22,02.1";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ИноеДвижимое") Тогда
				КодыСчетов = "01.30,02.30,02.3" + ",01.31,01.32,02.1";
			КонецЕсли;
			
		ИначеЕсли ВидПоступления
			= ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21") Тогда
			
			Если ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное") Тогда
				КодыСчетов = "21.20";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ИноеДвижимое") Тогда
				КодыСчетов = "21.30";
			КонецЕсли;
			
		ИначеЕсли УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПоступлениеИзПользования(
			ВидПоступления) Тогда
			
			Если ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.НедвижимоеИмущество") Тогда
				КодыСчетов = "101.10";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное") Тогда
				КодыСчетов = "101.20";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ИноеДвижимое") Тогда
				КодыСчетов = "101.30";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Лизинг") Тогда
				КодыСчетов = "101.40";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ПраваПользованияНМА") Тогда
				КодыСчетов = "111.60";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ВКонцессии") Тогда
				КодыСчетов = "101.90";
			КонецЕсли;
			
		Иначе
			Если ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.НедвижимоеИмущество") Тогда
				КодыСчетов = "101.10,102.10,103.10";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное") Тогда
				КодыСчетов = "101.20,102.20,103.20";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ИноеДвижимое") Тогда
				КодыСчетов = "101.30,102.30,103.30";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Лизинг") Тогда
				КодыСчетов = "101.40,102.40,103.40";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ПраваПользованияНМА") Тогда
				КодыСчетов = "111.60";
			ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ВКонцессии") Тогда
				КодыСчетов = "101.90,102.90,103.90";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(КодыСчетов) Тогда
		// Такого счета нет. В результате откроется пустой список счетов. Иначе можно выбрать любой счет
		КодыСчетов = "ХХ.ХХ";
	КонецЕсли;	 
	
	Возврат КодыСчетов;
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуИзГрупповогоВводаОС(Строка, ДанныеПрослеживаемостиОС, ИнвНомер = Неопределено)
	НоваяСтрока = Объект.ОсновныеСредства.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	НоваяСтрока.СчетУчетаОС = Строка.СчетУчета;
	НоваяСтрока.Сумма = Строка.ПервоначальнаяСтоимость;
	Если НЕ Объект.ПередачаЧастейОбъектов Тогда
		НоваяСтрока.Количество = 1;
	КонецЕсли;			                                                                  
	
	Если ИнвНомер <> Неопределено Тогда
		НоваяСтрока.ИнвентарныйНомер = ИнвНомер;
	КонецЕсли;	
	
	ДанныеПрослеживаемости = ДанныеПрослеживаемостиОС.Получить(Строка.ОсновноеСредство);
	Если ДанныеПрослеживаемости <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеПрослеживаемости);
	КонецЕсли;
	
	УправлениеОсновнымиСредствами.УстановитьСрокПолезногоИспользованияВСтрокеТЧ(
		НоваяСтрока, "ПринятиеКУчетуОбъектовОС");
	УстановитьРекомедуемыеОтражениеВУчетеВСтроке(ЭтотОбъект, НоваяСтрока);
	
	ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(ЭтотОбъект, НоваяСтрока);
	ОбновитьТекстЗаголовковВСтрокеТаблицыОС(НоваяСтрока, Строка(Объект.ВалютаПоступления),
		Строка(ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета));
КонецПроцедуры	

&НаСервере
Процедура ОбработкаГрупповогоВводаОССервер(ВыбранноеЗначение)
	
	ТаблицаСозданныхОС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение);
	ДобавленныеОС = ТаблицаСозданныхОС.ВыгрузитьКолонку("ОсновноеСредство");
	ДанныеПрослеживаемостиОС = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ДобавленныеОС, "ПрослеживаемыйТовар, СтранаПроисхождения");
	Для Каждого Строка Из ТаблицаСозданныхОС Цикл  
		Если ТипЗнч(Строка.ИнвентарныйНомер) = Тип("Массив") И Строка.ИнвентарныйНомер.Количество() > 0 Тогда  
			Для каждого ИнвНомер из Строка.ИнвентарныйНомер Цикл
				ЗаполнитьСтрокуИзГрупповогоВводаОС(Строка, ДанныеПрослеживаемостиОС, ИнвНомер);
			КонецЦикла;	
		Иначе
			ЗаполнитьСтрокуИзГрупповогоВводаОС(Строка, ДанныеПрослеживаемостиОС);
		КонецЕсли;	
	КонецЦикла;
	
	Если УправлениеОсновнымиСредствамиКлиентСервер.ПризнакЕстьПрослеживаемыеТоварыВТабличнойЧасти(Объект.ВидПоступления) Тогда
		УстановитьЕстьПрослеживаемыеТовары();
		УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ВидПоступления", "Вид поступления");
	Если НЕ Объект.ВидИмуществаВТабличнойЧасти Тогда
		СтруктураРеквизитов.Вставить("ВидИмущества", "Вид имущества");
	КонецЕсли;
	СтруктураРеквизитов.Вставить("Организация", "Организация");
	Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО Тогда
		СтруктураРеквизитов.Вставить("ИФО", "ИФО");
	КонецЕсли;
	Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПоступлениеИзПользования(Объект.ВидПоступления)
		И НЕ Объект.ПередачаЧастейОбъектов Тогда
		СтруктураРеквизитов.Вставить("ЦМООтправитель", "МОЛ/Место хранения (отправитель)");
		СтруктураРеквизитов.Вставить("Контрагент", "Контрагент");
	КонецЕсли;
	//
	Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(Объект.ВидПоступления) Тогда
//		СтруктураРеквизитов.Вставить("ВнеоборотныйАктив", "Объект вложений");
//		СтруктураРеквизитов.Вставить("СчетКредита", "Счет объекта вложений");
		Если Объект.ВидПоступления
			= ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление") Тогда
			СтруктураРеквизитов.Вставить("Количество", "Количество");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт
	
	ПрекращениеДоговора = Ложь;
	ПараметрыПодбора.Вставить("ВидРаспоряжения", Неопределено);
	
	Если Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс") Тогда
		ПараметрыПодбора.ВидРаспоряжения = "ПринятиеКУчету";
		ПараметрыПодбора.Отбор.Вставить("Счет", "101.00,102.00,103.00");
	ИначеЕсли Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАЗабаланс") Тогда
		ПараметрыПодбора.ВидРаспоряжения = "ПринятиеКУчету";
	ИначеЕсли Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21") Тогда
		ПараметрыПодбора.ВидРаспоряжения = "ПринятиеКУчету";
	ИначеЕсли Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение")
		Или Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление") Тогда
		ПараметрыПодбора.ВидРаспоряжения = "ПринятиеКУчету";
		ПараметрыПодбора.Отбор.Вставить("Счет", "101.00,102.00,111.60");
	ИначеЕсли Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды") Тогда
		ПараметрыПодбора.ВидРаспоряжения = ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.ПереданоВАренду");
		ПараметрыПодбора.Вставить("ЕстьОстатки", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаБалансе"));
		ПараметрыПодбора.Отбор.Вставить("Счет", СчетПоДоговоруИВидуИмущества("25"));
		ПрекращениеДоговора = Истина;
	ИначеЕсли Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАрендыОперУчет") Тогда
		ПараметрыПодбора.ВидРаспоряжения = ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.ПереданоВАренду");
		ПараметрыПодбора.Вставить("ЕстьОстатки", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.ОперативныйУчет"));
		ПараметрыПодбора.Отбор.Вставить("Счет", СчетПоДоговоруИВидуИмущества("25"));
		ПрекращениеДоговора = Истина;
	ИначеЕсли Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользования") Тогда
		ПараметрыПодбора.ВидРаспоряжения = ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.ПереданоВПользование");
		ПараметрыПодбора.Вставить("ЕстьОстатки", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаБалансе"));
		ПараметрыПодбора.Отбор.Вставить("Счет", СчетПоДоговоруИВидуИмущества("26"));
		ПрекращениеДоговора = Истина;
	ИначеЕсли Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользованияОперУчет") Тогда
		ПараметрыПодбора.ВидРаспоряжения = ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.ПереданоВПользование");
		ПараметрыПодбора.Вставить("ЕстьОстатки", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.ОперативныйУчет"));
		ПараметрыПодбора.Отбор.Вставить("Счет", СчетПоДоговоруИВидуИмущества("26"));
		ПрекращениеДоговора = Истина;
	ИначеЕсли Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзУправления") Тогда
		ПараметрыПодбора.ВидРаспоряжения = ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.ПереданоВУправление");
		ПараметрыПодбора.Вставить("ЕстьОстатки", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаБалансе"));
		ПараметрыПодбора.Отбор.Вставить("Счет", СчетПоДоговоруИВидуИмущества("24"));
		ПрекращениеДоговора = Истина;
	ИначеЕсли Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзУправленияОперУчет") Тогда
		ПараметрыПодбора.ВидРаспоряжения = ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.ПереданоВУправление");
		ПараметрыПодбора.Вставить("ЕстьОстатки", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.ОперативныйУчет"));
		ПараметрыПодбора.Отбор.Вставить("Счет", СчетПоДоговоруИВидуИмущества("24"));
		ПрекращениеДоговора = Истина;
	КонецЕсли;
	
	Если ПараметрыПодбора.Свойство("ЕстьОстатки") Тогда
		ПараметрыПодбора.Вставить("СкрытьКолонки", "СчетУчета");
	КонецЕсли;
	
	ПараметрыПодбора.Отбор.Вставить("Организация", Объект.Организация);
	
	Если ПрекращениеДоговора Тогда	
		ПараметрыПодбора.Отбор.Вставить("ИФО", Объект.ИФО);
		ПараметрыПодбора.Отбор.Вставить("КФО", Объект.КФО);
		Если НЕ Объект.ПередачаЧастейОбъектов Тогда
			ПараметрыПодбора.Отбор.Вставить("ЦМО", Объект.ЦМООтправитель);
		КонецЕсли;	
		ПараметрыПодбора.Отбор.Вставить("Контрагент", Объект.Контрагент);
	КонецЕсли;
	
	Если ПараметрыПодбора.ВидРаспоряжения = "ПринятиеКУчету" Тогда
		СписокНФА = Новый Массив;
		СписокНФА.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНФА.ОС"));
		СписокНФА.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНФА.НМА"));
		СписокНФА.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНФА.НПА"));
		ПараметрыПодбора.Отбор.Вставить("ВидНФА", СписокНФА);
	КонецЕсли;
	
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("КолонкиКорзины", Новый Структура("СчетУчета", "СчетУчетаОС"));
	
КонецПроцедуры

&НаКлиенте
Функция СчетПоДоговоруИВидуИмущества(Счет)
	
	Если Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.НедвижимоеИмущество") Тогда
		ПолныйСчет = Счет + ".10";
	ИначеЕсли Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное") Тогда
		ПолныйСчет = Счет + ".20";
	ИначеЕсли Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ИноеДвижимое") Тогда
		ПолныйСчет = Счет + ".30";
	Иначе
		ПолныйСчет = Счет;
	КонецЕсли;
	
	Возврат ПолныйСчет;
	
КонецФункции

&НаКлиенте
Процедура ПодборПоОстаткамЗавершение(Результат, ПараметрыПодбора) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЭтоПодборКапвложения = Ложь;
		Если ПараметрыПодбора.Свойство("ЭтоПодборКапвложения", ЭтоПодборКапвложения) И ЭтоПодборКапвложения Тогда
			ОбработкаВыбораПодбораОССервер(Результат, Истина);
			
			Если ЗначениеЗаполнено(Объект.ВнеоборотныйАктив) Тогда
				ОбнулитьСуммыВложений();
				ВнеоборотныйАктивПриИзмененииНаСервере();
			КонецЕсли;	
		Иначе	 	
			ОбработкаВыбораПодбораОССервер(Результат);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыПодбораКапвложения() Экспорт
	
	ПараметрыПодбора = Новый Структура("Отбор", Новый Структура);
	ПараметрыПодбора.Отбор.Вставить("Организация", Объект.Организация);
	ПараметрыПодбора.Отбор.Вставить("ИФО", Объект.ИФО);
	ПараметрыПодбора.Отбор.Вставить("КФО", Объект.КФО);
	ПараметрыПодбора.Отбор.Вставить("Счет", КодыСчетовКапвложений());
	
	ПараметрыПодбора.Вставить("ВидРаспоряжения", "Вложения");
	ПараметрыПодбора.Вставить("КолонкиКорзины", Новый Структура("Цена", "СтоимостьЕдиницы"));
	ПараметрыПодбора.Вставить("ЭтоПодборКапвложения", Истина);
	
	Возврат ПараметрыПодбора;
КонецФункции

&НаСервере
Функция ПоместитьОСВХранилище()
	
	ТаблицаОС = Объект.ОсновныеСредства.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);
	
КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодбораОССервер(Знач ВыбранноеЗначение, ЭтоПодборКапвложения = Ложь)
	
	Если ЭтоПодборКапвложения Тогда
		ТаблицаОС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресОСВХранилище);
		КолСтрок = ТаблицаОС.Количество();
		Если КолСтрок = 0 Тогда
			Возврат;
		ИначеЕсли КолСтрок > 1 Тогда
			ТекстСообщения = НСтр(
				"ru = 'В подборе выбрано больше одного объекта капвложений. Подбирать следует один объект.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;	
		
		Объект.ВнеоборотныйАктив = ТаблицаОС[0].ОсновноеСредство;
		
	Иначе	
		ТаблицаОС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресОСВХранилище);
		
		ИсходныеДанные = Объект.ОсновныеСредства.Выгрузить();
		ИсходныеДанные.Индексы.Добавить("ОсновноеСредство");
		СчетаУчетаОСДляАвтоЗаполненияКПС = Новый Массив;
		СтрокиДляАвтоЗаполненияКПС = Новый Массив;
		
		Объект.ОсновныеСредства.Очистить();
		Для каждого СтрокаТаблицыОС Из ТаблицаОС Цикл
			
			ЭлементКоллекции = Объект.ОсновныеСредства.Добавить();
			ЭтоЗаполнениеНовойСтроки = Истина;
			ЗаполнитьЗначенияСвойств(ЭлементКоллекции, СтрокаТаблицыОС);
			ОбновитьТекстЗаголовковВСтрокеТаблицыОС(ЭлементКоллекции, Строка(Объект.ВалютаПоступления),
				Строка(ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета));
			
			СтруктураПоискаСтроки = Новый Структура("ОсновноеСредство, ИнвентарныйНомер",
				СтрокаТаблицыОС.ОсновноеСредство, СтрокаТаблицыОС.ИнвентарныйНомер);
			
			СтрокиИсходныхДанных = ИсходныеДанные.НайтиСтроки(СтруктураПоискаСтроки);
			Если СтрокиИсходныхДанных.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(ЭлементКоллекции, СтрокиИсходныхДанных[0], "СчетУчетаОС, ВидНФА, ТипНФА, ГрупповойУчет");
				ЗаполнитьСтрокуИзДругойСтроки(ЭлементКоллекции, СтрокиИсходныхДанных[0],
					ОтражатьВНалоговомУчете, ОтражатьВУСНДоходыМинусРасходы);
				ЗаполнитьЗначенияСвойств(ЭлементКоллекции, СтрокиИсходныхДанных[0]);
				ЭтоЗаполнениеНовойСтроки = Ложь;
			КонецЕсли;
			
			Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(Объект.ВидПоступления) Тогда
				ПересчитатьСуммыТекущейСтроки(ЭтотОбъект, ЭлементКоллекции);
			КонецЕсли;
			ОсновноеСредствоПриИзмененииНаСервере(ЭлементКоллекции.ПолучитьИдентификатор(), ЭтоЗаполнениеНовойСтроки, Истина);
			ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(ЭтотОбъект, ЭлементКоллекции);
			
			Если ЗначениеЗаполнено(ЭлементКоллекции.СчетУчетаОС) И Не ЗначениеЗаполнено(ЭлементКоллекции.КПС) Тогда
				СчетаУчетаОСДляАвтоЗаполненияКПС.Добавить(ЭлементКоллекции.СчетУчетаОС);
				СтрокиДляАвтоЗаполненияКПС.Добавить(ЭлементКоллекции);
			КонецЕсли;
		КонецЦикла;
		
		Если ТаблицаОС.Количество() > 0 Тогда
			ИнвентарныйНомерОбъектаСДрагМатериаламиПриИзмененииНаСервере(ТаблицаОС);
			ОбновитьАналитикуОперацииПоДрагМатериалам();
		КонецЕсли;
		
		Если ЭтотОбъект.КэшПараметров.КонтролироватьОперацииНаСоответствиеРПС И СтрокиДляАвтоЗаполненияКПС.Количество() Тогда
			
			ЗначенияЗаполнения = УправлениеНФА.ЗначенияКПСКФОПоУмолчаниюДляСчетов(
			Объект.Организация,
			Объект.ИФО,
			СчетаУчетаОСДляАвтоЗаполненияКПС,
			Объект.Дата,
			Объект.КФО);
			
			Для Каждого СтрокаЗаполненияКПС Из СтрокиДляАвтоЗаполненияКПС Цикл
				ЗначенияЗаполненияПоСчету = ЗначенияЗаполнения.Получить(СтрокаЗаполненияКПС.СчетУчетаОС);
				Если ЗначенияЗаполненияПоСчету <> Неопределено Тогда
					СтрокаЗаполненияКПС.КПС = ЗначенияЗаполненияПоСчету.КПС;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Проверка заполнения

&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьЗаполнениеСтроки(ТекущаяСтрока, Форма, Ошибки = Неопределено, НеЗаполнятьОшибки = Истина)
	
	Объект = Форма.Объект;
	
	// Подготовка параметров проверки строки
	ПараметрыПроверки = УправлениеОсновнымиСредствамиКлиентСервер.ПараметрыПроверкиДанныхСтрокиПринятияКУчету();
	ПараметрыПроверки.НеЗаполнятьОшибки = НеЗаполнятьОшибки;
	ПараметрыПроверки.Объект = Объект;
	ПараметрыПроверки.УчетПоПодразделениям = Форма.КэшПараметров.ИспользоватьУчетПоПодразделениям;
	ПараметрыПроверки.ИндексСтроки = ТекущаяСтрока.НомерСтроки - 1;
	ПараметрыПроверки.НомерСтроки = ТекущаяСтрока.НомерСтроки;
	ПараметрыПроверки.ПроверятьЗаполнениеСчетаУчетаЗатрат = ПроверятьЗаполнениеСчетаУчетаЗатрат(Объект.ВидПоступления);
	ПараметрыПроверки.ОтражатьВНалоговомУчете = Форма.ОтражатьВНалоговомУчете;
	ПараметрыПроверки.ОтражатьВУСНДоходыМинусРасходы = Форма.ОтражатьВУСНДоходыМинусРасходы;
	ПараметрыПроверки.ПроверятьКоличествоВТабЧасти = НЕ Объект.ПередачаЧастейОбъектов;
	
	// проверка строки
	Отказ = Не УправлениеОсновнымиСредствамиКлиентСервер.ДанныеСтрокиПринятияКУчетуЗаполненыКорректно(ТекущаяСтрока,
		ПараметрыПроверки, Ошибки);
	
	// обработка результатов проверки
	
	ТекущаяСтрока.ОтражениеВУчетеБУЗаполненоНекорректно  = ПараметрыПроверки.ОтражениеВУчетеБУЗаполненоНекорректно;
	ТекущаяСтрока.ОтражениеВУчетеНУЗаполненоНекорректно  = ПараметрыПроверки.ОтражениеВУчетеНУЗаполненоНекорректно;
	ТекущаяСтрока.ОтражениеВУчетеУСНЗаполненоНекорректно = ПараметрыПроверки.ОтражениеВУчетеУСНЗаполненоНекорректно;
	
	Если Отказ Тогда
		ТекущаяСтрока.ОтражениеВУчетеЕстьОшибка = -1;
	Иначе
		ПроверитьВыбранныйСпособПогашенияСтоимости(Форма, ТекущаяСтрока);
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СчетВложенийСоответствуетВидуИмущества(Форма, Ошибки = Неопределено)
	
	ТекстОшибки = НСтр("ru = 'Счет вложений не соответствует выбранному виду имущества'");
	
	ПараметрыОшибки = Новый Структура;
	ПараметрыОшибки.Вставить("ПолеОшибки",	"Объект.СчетКредита");
	ПараметрыОшибки.Вставить("ТекстОшибки",	ТекстОшибки);
	
	Объект = Форма.Объект;
	
	Соответствует = УправлениеОсновнымиСредствамиКлиентСервер.СчетСоответствуетВидуИмущества(
		Объект.СчетКредита, Объект.ВидИмущества, Ошибки, ПараметрыОшибки);
	
	Возврат Соответствует;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СчетУчетаОССоответствуетВидуИмущества(Форма, ТекущаяСтрока, Ошибки = Неопределено)
	
	Объект = Форма.Объект;
	Если Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАЗабаланс") Тогда
		// для забаланосовых счетов 01 и 02 не проверяем
		Возврат Истина;
	КонецЕсли;
	
	ШаблонТекстаОшибки = НСтр("ru = 'Счет учета объекта ОС, НМА, НПА в строке %1 не соответствует выбранному виду имущества.'");
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, ТекущаяСтрока.НомерСтроки);
	
	ПараметрыОшибки = Новый Структура;
	ПараметрыОшибки.Вставить("ПолеОшибки",		"Объект.ОсновныеСредства[%1].СчетУчетаОС");
	ПараметрыОшибки.Вставить("ТекстОшибки",		ТекстОшибки);
	ПараметрыОшибки.Вставить("ГруппаОшибок",	"Объект.ОсновныеСредства");
	ПараметрыОшибки.Вставить("НомерСтроки",		ТекущаяСтрока.НомерСтроки);
	ПараметрыОшибки.Вставить("ИндексСтроки",	ТекущаяСтрока.ПолучитьИдентификатор());

	ТекВидИмущества = Объект.ВидИмущества;
	Если Объект.ВидИмуществаВТабличнойЧасти Тогда
		ТекВидИмущества = ТекущаяСтрока.ВидИмущества;
	КонецЕсли;
	Соответствует = УправлениеОсновнымиСредствамиКлиентСервер.СчетСоответствуетВидуИмущества(
		ТекущаяСтрока.СчетУчетаОС, ТекВидИмущества, Ошибки, ПараметрыОшибки);
			
	Возврат Соответствует;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПроверятьЗаполнениеСчетаУчетаЗатрат(ВидПоступления)
	
	Возврат УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(ВидПоступления)
		Или ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьВыбранныйСпособПогашенияСтоимости(Форма, ТекущаяСтрока, Ошибки = Неопределено)
	
	Объект = Форма.Объект;
	РекомендуемыйПорядок = РекомендуемыйПорядокПогашенияСтоимости(Форма, ТекущаяСтрока);
	
	Если РекомендуемыйПорядок.ПорядокПогашенияСтоимости = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РекомендуемыйПорядок.ПорядокПогашенияСтоимости <> ТекущаяСтрока.ПорядокПогашенияСтоимости
		Или РекомендуемыйПорядок.ДопустимыеСпособыНачисленияАмортизации.Найти(ТекущаяСтрока.СпособНачисленияАмортизации) = Неопределено
		Или (РекомендуемыйПорядок.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию <> Неопределено
			И РекомендуемыйПорядок.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию
			<> ТекущаяСтрока.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию) Тогда
		
		ТекущаяСтрока.ОтражениеВУчетеЕстьОшибка = 0;
		
		ИндексСтроки = ТекущаяСтрока.НомерСтроки - 1;
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"Объект.ОсновныеСредства[%1].ОтражениеВУчетеЕстьОшибка",
			РекомендуемыйПорядок.ПояснениеУказанногоПорядка,"Объект.ОсновныеСредства",
			ИндексСтроки, РекомендуемыйПорядок.ПояснениеУказанногоПорядка);
	Иначе
		ТекущаяСтрока.ОтражениеВУчетеЕстьОшибка = -1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРекомедуемыеОтражениеВУчетеВСтроке(Форма, ТекущаяСтрока)
	
	Если ТекущаяСтрока.ОтражениеВУчетеЕстьОшибка = 0 Тогда
		
		РекомендуемыйПорядок = РекомендуемыйПорядокПогашенияСтоимости(Форма, ТекущаяСтрока);
		
		ТекущаяСтрока.ПорядокПогашенияСтоимости = РекомендуемыйПорядок.ПорядокПогашенияСтоимости;
		ТекущаяСтрока.СпособНачисленияАмортизации = РекомендуемыйПорядок.СпособНачисленияАмортизации;
		
		ВвестиВЭксплуатацию = РекомендуемыйПорядок.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию;
		Если ВвестиВЭксплуатацию <> Неопределено Тогда
			ТекущаяСтрока.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию = ВвестиВЭксплуатацию;
		КонецЕсли;
		
		Если РекомендуемыйПорядок.ПорядокПогашенияСтоимости = ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации")
			И РекомендуемыйПорядок.СпособНачисленияАмортизации = ПредопределенноеЗначение("Перечисление.СпособНачисленияАмортизации.Линейный") Тогда
			ТекущаяСтрока.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию = Истина;
			ТекущаяСтрока.НачислятьАмортизацию = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РекомендуемыйПорядокПогашенияСтоимости(Форма, ТекущаяСтрока)
	
	Возврат УправлениеОсновнымиСредствамиКлиентСервер.РекомендуемыйПорядокПогашенияСтоимости(
		ТекущаяСтрока.ВидНФА,
		ТекущаяСтрока.ТипНФА,
		?(ТекущаяСтрока.Количество = 0, 0, ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество),
		Форма.Объект.Дата,
		Форма.Объект.ВидИмущества,
		ТекущаяСтрока.СрокПолезногоИспользования);
	
КонецФункции

// Прочие

&НаСервереБезКонтекста
Функция ПолучитьКурсВалюты(Валюта, Дата)
	
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, Дата);
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьКомиссии()
	
	ЕстьКомиссия = ЗначениеЗаполнено(Объект.Комиссия);
	
	Элементы.ГруппаПриказОНазначенииКомиссии.ТолькоПросмотр = ЕстьКомиссия;
	//Элементы.ГруппаПредседательКомиссии.ТолькоПросмотр = ЕстьКомиссия;
	Элементы.Председатель.Видимость = ЕстьКомиссия;
	Элементы.ВыбратьПредседателяКомиссии.Видимость = Не ЕстьКомиссия;
	Элементы.СоставКомиссии.Видимость = Не ЕстьКомиссия;
	Элементы.СоставКомиссии1.Видимость = ЕстьКомиссия;
	
КонецПроцедуры

#Область УчетДрагМатериалов

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитовДМ() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыДобавленияДМ(ПараметрыПодбора) Экспорт
	
	Если (Объект.ДрагоценныеМатериалы.Количество() > 0)И(ПараметрыПодбора.ВариантВводаДанных < 2) Тогда
		ПараметрыПодбора.Вставить("АдресДМВХранилище", ПоместитьДМВХранилище(ПараметрыПодбора));
	Иначе
		ПараметрыПодбора.Вставить("АдресДМВХранилище", "");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДМВХранилище(ПараметрыПодбора)
	
	МассивСтрок = ПолучитьСписокДМОбъектаНФА(ПараметрыПодбора);
	
	ТаблицаНФА = Объект.ДрагоценныеМатериалы.Выгрузить(МассивСтрок,
		"ОбъектНФА, ИнвНомер, ВидДрагМатериала, МассаДМ, КоличествоДМ, ЕдИзм");
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаНФА);
	
КонецФункции

&НаСервере
Функция ПолучитьСписокДМОбъектаНФА(ПараметрыПодбора)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбъектНФА", ПараметрыПодбора.ОбъектНФА);
	ПараметрыОтбора.Вставить("ИнвНомер", ПараметрыПодбора.ИнвНомер);
	НайденныеСтроки = Объект.ДрагоценныеМатериалы.НайтиСтроки(ПараметрыОтбора);
	
	Возврат НайденныеСтроки;
	
КонецФункции

&НаСервере
Процедура ОбработкаДобавленияДМДляОбъектаНаСервере(Знач ВыбранноеЗначение, ВариантВводаДанныхДМ = 1)
	
	Если ВариантВводаДанныхДМ = 2 Тогда
		ДобавленныеСтроки = УчетДрагМатериалов.ОбработатьДобавлениеДМДляОбъектов(
			Объект.ДрагоценныеМатериалы, ВыбранноеЗначение, , "ОбъектНФА,ИнвНомер,ВидДрагМатериала");
	Иначе
		ДобавленныеСтроки = УчетДрагМатериалов.ОбработатьДобавлениеДМДляОбъекта(
			Объект.ДрагоценныеМатериалы, ВыбранноеЗначение, , "ОбъектНФА,ИнвНомер,ВидДрагМатериала");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	
	Для Каждого ТекСтрока Из Объект.ДрагоценныеМатериалы Цикл
		ТекСтрока.КлючСтроки = УчетДрагМатериаловКлиент.ПолучитьКлючСтроки(ТекСтрока.ОбъектНФА, ТекСтрока.ИнвНомер);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектыСДрагМатериалами()
	
	ТаблицаВсехОбъектов = Объект.ОсновныеСредства.Выгрузить(,
		"СчетУчетаОС, ОсновноеСредство, ИнвентарныйНомер, Количество");
	
	ТаблицаОбъектовОС = Новый ТаблицаЗначений;
	ТаблицаОбъектовОС.Колонки.Добавить("КлючСтроки",Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектовОС.Колонки.Добавить("ОсновноеСредство",Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТаблицаОбъектовОС.Колонки.Добавить("ИнвентарныйНомер",Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	ТаблицаОбъектовОС.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	
	МассивСчетовОС = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляОС();
	
	Для Каждого ТекСтрока Из ТаблицаВсехОбъектов Цикл
		Если МассивСчетовОС.Найти(ТекСтрока.СчетУчетаОС)<>Неопределено Тогда
			НоваяСтрока = ТаблицаОбъектовОС.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			НоваяСтрока.КлючСтроки = УчетДрагМатериалов.ПолучитьКлючСтроки(ТекСтрока.ОсновноеСредство,
				ТекСтрока.ИнвентарныйНомер); 
		КонецЕсли;
	КонецЦикла;

	УчетДрагМатериалов.ЗаполнитьДляМЗДанныеОТехДокументации(ТаблицаОбъектовОС, "ОС");
	
	ОбъектыНФАСДрагМатериалами.Загрузить(ТаблицаОбъектовОС);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДанныхДрагМатериалов()
	Если ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Истина;
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
		
		Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные <> Неопределено Тогда
			ОтборДрагМатериаловДляОбъекта(Элементы.СписокНФАДокументаОснования.ТекущиеДанные.КлючСтроки);
		КонецЕсли;
	Иначе
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Ложь;
		Элементы.ДрагоценныеМатериалы.ОтборСтрок = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборДрагМатериаловДляОбъекта(КлючСтроки)
	
	Элементы.ДрагоценныеМатериалы.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСтроки",КлючСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлючиСтрокДрагМатериалов()
	
	Если ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТаблицаОбъектовНФАДляДМВХранилище(ВыделенныеСтрокиТЧ)
	
	ТаблицаНФА = Новый ТаблицаЗначений;
	ТаблицаНФА.Колонки.Добавить("ОбъектНФА", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТаблицаНФА.Колонки.Добавить("ИнвНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	ТаблицаНФА.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для Каждого ИдСтроки Из ВыделенныеСтрокиТЧ Цикл
		СтрокаТЧ = ЭтаФорма.ОбъектыНФАСДрагМатериалами.НайтиПоИдентификатору(ИдСтроки);
		НоваяСтрока = ТаблицаНФА.Добавить();
		НоваяСтрока.ОбъектНФА = СтрокаТЧ.ОсновноеСредство;
		НоваяСтрока.ИнвНомер = СтрокаТЧ.ИнвентарныйНомер;
		НоваяСтрока.Количество = СтрокаТЧ.Количество;
	КонецЦикла;
	
	Возврат ТаблицаНФА;
	
КонецФункции

&НаСервере
Функция ПоместитьТаблицуОбъектовНФАДляДМВХранилище(ВыделенныеСтрокиТЧ)
	
	ТаблицаНФА = ТаблицаОбъектовНФАДляДМВХранилище(ВыделенныеСтрокиТЧ);
	ТаблицаДМ = ПодготовитьДанныеОДрагМатериалах(ВыделенныеСтрокиТЧ); 
	
	Массив = Новый Массив;
	Массив.Добавить(ТаблицаНФА);
	Массив.Добавить(ТаблицаДМ);
	
	Возврат ПоместитьВоВременноеХранилище(Массив);
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеОДрагМатериалах(ВыделенныеСтроки) 
	
	ВыбранныеНФА = ТаблицаОбъектовНФАДляДМВХранилище(ВыделенныеСтроки);
	
	ТаблицаДМ = Объект.ДрагоценныеМатериалы.Выгрузить();
	
	Результат = УчетДрагМатериалов.ЕдиныйСписокДрагМатериаловДляНесколькихОбъектовНФА(ТаблицаДМ, ВыбранныеНФА);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаОДрагМатериалах(Результат, Параметры) Экспорт
	
	ОбновитьАналитикуОперацииПоДрагМатериалам();
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Параметры.НайденныеСтроки Цикл
		Объект.ДрагоценныеМатериалы.Удалить(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА()
	
	Элемент = Элементы.СписокНФАДокументаОснования;
	ОтборДрагМатериаловДляОбъекта(Элемент.ТекущиеДанные.КлючСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДрагМатериалыОбъектаПоТехДокументации(ВыбранныйОбъектНФА, ОбъектНФА, ИнвНомер, Количество)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.ВидДрагМатериала КАК ВидДрагМатериала,
	               |	СУММА(ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.МассаДМ * &Количество) КАК МассаДМ,
	               |	СУММА(ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.КоличествоДМ * &Количество) КАК КоличествоДМ,
	               |	ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.ЕдИзм КАК ЕдИзм
	               |ИЗ
	               |	Справочник.ДрагМатериалыВОбъектахНФАПоТехДокументации.ДрагМатериалы КАК ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы
	               |ГДЕ
	               |	ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.ВидДрагМатериала,
	               |	ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.ЕдИзм";

	Запрос.УстановитьПараметр("Ссылка", ВыбранныйОбъектНФА);
	Запрос.УстановитьПараметр("Количество", Количество);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ДрагоценныеМатериалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ОбъектНФА = ОбъектНФА;
		НоваяСтрока.ИнвНомер = ИнвНомер;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДрагМатериалыПоТехДокументацииНаСервере()
	ТаблицаНФА = ОбъектыНФАСДрагМатериалами.Выгрузить();
	УчетДрагМатериалов.ЗаполнитьДляМЗДанныеОСодержанииДрагМатериаловТехДокументации(ТаблицаНФА, "ОС");
	Объект.ДрагоценныеМатериалы.Загрузить(ТаблицаНФА);
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьФормуСведенийОСодержанииДрагМатериаловПоТехДокументации(ОбъектНФА, ТехДокументация)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(ТехДокументация) Тогда
		ПараметрыФормы.Вставить("Ключ", ТехДокументация);
	Иначе
		ПараметрыФормы.Вставить("ОбъектНФА", ОбъектНФА);
	КонецЕсли;	
	ОткрытьФорму("Справочник.ДрагМатериалыВОбъектахНФАПоТехДокументации.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМЦВнеоборотногоАктиваСДрагМатериалами(ПерезаполнитьТЧ = Ложь)
	
	Если ПерезаполнитьТЧ Тогда
		Объект.МЦСДрагоценнымиМатериалами.Очистить();
	КонецЕсли;
	
	ЭтоПриобретениеИлиИзготовление =
		УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(Объект.ВидПоступления);
	
	Если Объект.МЦСДрагоценнымиМатериалами.Количество() = 0
						И ВедетсяУчетДрагМатериаловВКапвожениях И ЭтоПриобретениеИлиИзготовление Тогда
		
		ТаблицаОбъектовОС = УчетДрагМатериалов.ПолучитьСписокОстатковМЦ(Объект.Дата, Объект.Организация, Объект.ВнеоборотныйАктив);
		ТаблицаОбъектовОС.Колонки.КоличествоОстаток.Имя = "Количество";
		ТаблицаОбъектовОС.Колонки.Добавить("КоличествоВсего", Новый ОписаниеТипов("Число"));
		
		Для Каждого ТекСтрока Из ТаблицаОбъектовОС Цикл
			ТекСтрока.КоличествоВсего = ТекСтрока.Количество;
		КонецЦикла;

		Объект.МЦСДрагоценнымиМатериалами.Загрузить(ТаблицаОбъектовОС);
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДМДляСписанияНаСервере(ВыбранныйОбъектНФА)
	
	ПараметрыПолученияОстатков = УправлениеОсновнымиСредствами.СтруктураПараметровПолученияОстатков(Объект, ДатыПроведенияДокументов.ДатаПроведения);
	
	Если Не ЗначениеЗаполнено(ПараметрыПолученияОстатков.Ссылка) Тогда
		ПериодОстатков = Новый Граница(ПараметрыПолученияОстатков.Период, ВидГраницы.Включая);
	Иначе
		ПериодОстатков = Новый Граница(ПараметрыПолученияОстатков.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
	Капвложение = Объект.ВнеоборотныйАктив;
	
	ЗаполнитьДМДляСписанияНаСервере(ПериодОстатков, Капвложение, ВыбранныйОбъектНФА);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДМДляСписанияНаСервере(ПериодОстатков, Капвложение, ВыбранныйОбъектНФА)
	
	ТаблицаСписанияОбъектов = Объект.МЦСДрагоценнымиМатериалами.Выгрузить(, "ОбъектМЦ,Количество");
	ТаблицаСписанияОбъектов.Колонки.ОбъектМЦ.Имя = "ОбъектНФА";
	
	ОстаткиДМ = УчетДрагМатериалов.ЗаполнитьДМДляСписанияМатериальныхЦенностей(Объект.Организация, 
		Капвложение, ТаблицаСписанияОбъектов, ПериодОстатков);		
	
	ОсновноеСредство = ВыбранныйОбъектНФА.ОсновноеСредство;
	ИнвентарныйНомер = ВыбранныйОбъектНФА.ИнвентарныйНомер;
	
	Если ОстаткиДМ.Количество() > 0 Тогда
		Объект.ДрагоценныеМатериалы.Загрузить(ОстаткиДМ);
		Для Каждого Строка Из Объект.ДрагоценныеМатериалы Цикл  
			Строка.ОбъектНФА = ОсновноеСредство;
			Строка.ИнвНомер = ИнвентарныйНомер; 
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьАналитикуОперацииПоДрагМатериалам() 
	
	Если Объект.ВидПоступления <> Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс 
			ИЛИ Объект.ОсновныеСредства.Количество() = 0 Тогда
		Объект.АналитикаОперацииСДрагМатериалами = 
			Объект.АналитикаОперацииСДрагМатериалами = ПредопределенноеЗначение("Перечисление.ТипыАналитикиОперацииСДрагМатериалами.ПустаяСсылка");
		Возврат;
	КонецЕсли;
	
	ТЗИнвНомеров = Объект.ОсновныеСредства.Выгрузить(,"ИнвентарныйНомер");
	МассивИнв = ТЗИнвНомеров.ВыгрузитьКолонку("ИнвентарныйНомер");
	СоответствиеРеквизитовИнвНомеров = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивИнв, "ИнвентарныйНомерЗаимствуется");
	
	Для Каждого ТекСтрока Из МассивИнв Цикл
		ИнвНомерЗаимстувуется = ?(СоответствиеРеквизитовИнвНомеров.Получить(ТекСтрока) <> Неопределено,
			СоответствиеРеквизитовИнвНомеров.Получить(ТекСтрока), Ложь);
		Если ЗначениеЗаполнено(ТекСтрока) И ИнвНомерЗаимстувуется Тогда
			Объект.АналитикаОперацииСДрагМатериалами = ПредопределенноеЗначение("Перечисление.ТипыАналитикиОперацииСДрагМатериалами.ВыходИзГрупповогоИнвентарногоУчета");
			Возврат;
		КонецЕсли;
	КонецЦикла;	
	Объект.АналитикаОперацииСДрагМатериалами = Объект.АналитикаОперацииСДрагМатериалами = ПредопределенноеЗначение("Перечисление.ТипыАналитикиОперацииСДрагМатериалами.ПустаяСсылка");
	
КонецПроцедуры

&НаСервере
Процедура ИнвентарныйНомерОбъектаСДрагМатериаламиПриИзмененииНаСервере(ИзмененныеИнвНомераОбъектовОС)
	
	Если Объект.ВидПоступления <> Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ИзмененныеИнвНомераОбъектовОС) = Тип("Структура") Тогда
		
		ИзмененныйОбъект = ИзмененныеИнвНомераОбъектовОС.ОсновноеСредство;
		ИнвНомерИзмененногоОбъекта = ИзмененныеИнвНомераОбъектовОС.ИнвНомер;
		
		Если ЗначениеЗаполнено(ИнвНомерИзмененногоОбъекта) И ИнвНомерИзмененногоОбъекта.ИнвентарныйНомерЗаимствуется Тогда

			ТаблицаОбъектовСИзмИнвентарнымиНомерами = Новый ТаблицаЗначений; 
			ТаблицаОбъектовСИзмИнвентарнымиНомерами.Колонки.Добавить("ОбъектНФА", Тип("СправочникСсылка.ОсновныеСредства"));
			ТаблицаОбъектовСИзмИнвентарнымиНомерами.Колонки.Добавить("ИнвНомер", Тип("СправочникСсылка.ИнвентарныеНомераОС"));
			
			НоваяСтрокаТЗ = ТаблицаОбъектовСИзмИнвентарнымиНомерами.Добавить();
			НоваяСтрокаТЗ.ОбъектНФА = ИзмененныйОбъект;
			НоваяСтрокаТЗ.ИнвНомер = ИнвНомерИзмененногоОбъекта;
			
			ДанныеДМОбъектов = УчетДрагМатериалов.ЗаполнитьДМДляПринятияКУчетуОбъектовВышедшихИзГрупповогоУчета(Объект.Организация, ТаблицаОбъектовСИзмИнвентарнымиНомерами);
		Иначе
			Возврат;
		КонецЕсли;

	ИначеЕсли ТипЗнч(ИзмененныеИнвНомераОбъектовОС) = Тип("ТаблицаЗначений") тогда
		
		ИзмененныеИнвНомераОбъектовОС.Колонки.ОсновноеСредство.Имя = "ОбъектНФА";
		ИзмененныеИнвНомераОбъектовОС.Колонки.ИнвентарныйНомер.Имя = "ИнвНомер";
		
		ДанныеДМОбъектов = УчетДрагМатериалов.ЗаполнитьДМДляПринятияКУчетуОбъектовВышедшихИзГрупповогоУчета(Объект.Организация, ИзмененныеИнвНомераОбъектовОС);
	Иначе
		Возврат;		
	КонецЕсли;
	
	ТекущийОбъектНФА = "";
	
	Для Каждого ТекСтрока Из ДанныеДМОбъектов Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ОбъектНФА", ТекСтрока.ОбъектНФА); 
		ПараметрыОтбора.Вставить("ИнвНомер", ТекСтрока.ИнвНомер);
		
		НайденныеСтроки = Объект.ДрагоценныеМатериалы.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 
			ИЛИ ТекущийОбъектНФА = ТекСтрока.ОбъектНФА Тогда
			
			НоваяСтрока = Объект.ДрагоценныеМатериалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока); 
			НоваяСтрока.ОбъектНФА 	= ТекСтрока.ОбъектНФА;
			НоваяСтрока.ИнвНомер 	= ТекСтрока.ИнвНомер;
			НоваяСтрока.КлючСтроки 	= УчетДрагМатериалов.ПолучитьКлючСтроки(ТекСтрока.ОбъектНФА, ТекСтрока.ИнвНомер); 
			
			Если ТекущийОбъектНФА <> ТекСтрока.ОбъектНФА Тогда
				ТекущийОбъектНФА = ТекСтрока.ОбъектНФА;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Проверка заполнения драг материалов
&НаСервере
Процедура  ПроверитьКоличествоПринятихКУчетуДрагМатериаловКапвложения(Отказ)
	
	ПринимаемыеДрагМатериалы = Объект.ДрагоценныеМатериалы.Выгрузить(,"ВидДрагМатериала,МассаДМ,КоличествоДМ");
	ПринимаемыеДрагМатериалы.Свернуть("ВидДрагМатериала","МассаДМ,КоличествоДМ");
	
	ПараметрыПолученияОстатков = УправлениеОсновнымиСредствами.СтруктураПараметровПолученияОстатков(Объект, ДатыПроведенияДокументов.ДатаПроведения);
	
	Если Не ЗначениеЗаполнено(ПараметрыПолученияОстатков.Ссылка) Тогда
		ПериодОстатков = Новый Граница(ПараметрыПолученияОстатков.Период, ВидГраницы.Включая);
	Иначе
		ПериодОстатков = Новый Граница(ПараметрыПолученияОстатков.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;

	ТаблицаСписанияОбъектов = Объект.МЦСДрагоценнымиМатериалами.Выгрузить(, "ОбъектМЦ,Количество");
	ТаблицаСписанияОбъектов.Колонки.ОбъектМЦ.Имя = "ОбъектНФА";
	
	ДрагМатериалыКапвложения = УчетДрагМатериалов.ЗаполнитьДМДляСписанияМатериальныхЦенностей(Объект.Организация, 
		Объект.ВнеоборотныйАктив, ТаблицаСписанияОбъектов, ПериодОстатков);		
	  
	Для Каждого Строка Из ПринимаемыеДрагМатериалы Цикл
			
		НайденнаяСтрока = ДрагМатериалыКапвложения.Найти(Строка.ВидДрагМатериала,"ВидДрагМатериала");
		
		Если НайденнаяСтрока = Неопределено ИЛИ НайденнаяСтрока.МассаДМ <> Строка.МассаДМ 
					ИЛИ Строка.КоличествоДМ <> НайденнаяСтрока.КоличествоДМ Тогда
					
			ТекстОшибки = СтрШаблон(Нстр("ru='Количество принимаемого к учету ""%1"" не совпадает с количеством ""%1"" в материальных ценностях капитального вложения.'"),
				Строка.ВидДрагМатериала);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.ДрагоценныеМатериалы");		
					
			Если Не Отказ Тогда		
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ВидимостьЭлементовЭДОДляДокумента()
	Результат = Ложь;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЭДО(Форма, ВидимостьЭлементовЭДО, ВидимостьЭлементовЭДОДляЭДПоставщика, ВидимостьЭлементовЭДОАкта448)
	
	Объект = Форма.Объект;
	
	Если ВидимостьЭлементовЭДОДляЭДПоставщика Тогда
		ВидимостьЭлементовЭДО = Истина;
		Форма.Элементы.ДекорацияСостояниеЭДО.Заголовок = НСтр("ru='Отражение ЭД в учете'");
	Конецесли;
	
	ЭтоВозвратНФА = Ложь;
	Если Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды")
		ИЛИ Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАрендыОперУчет")
		ИЛИ Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользования")
		ИЛИ Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользованияОперУчет")
		ИЛИ Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзУправления")
		ИЛИ Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзУправленияОперУчет") Тогда
		ЭтоВозвратНФА = Истина;
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДекорацияСостояниеЭДО", "Видимость", ВидимостьЭлементовЭДО);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ОсновныеСредстваЗаполнитьСведенияПоЭлектронномуАктуОПриемеПередаче", "Видимость", ВидимостьЭлементовЭДОАкта448 И НЕ ЭтоВозвратНФА);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ОсновныеСредстваЗаполнитьСведенияПоЭлектронномуДокументуПоставщика", "Видимость", ВидимостьЭлементовЭДОДляЭДПоставщика);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ОсновныеСредстваПодборОС", "Видимость", НЕ ВидимостьЭлементовЭДОАкта448);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"НадписьДопСведенияЭлектронногоАктаПоФорме0510448", "Видимость", ВидимостьЭлементовЭДОАкта448);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи", "Видимость", ВидимостьЭлементовЭДОАкта448);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Таблица "Инвентарные объекты" (ИнвентарныеОбъекты).
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОсновныеСредстваОтражениеВУчете.Имя);
	ГруппаИли = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор,, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"Объект.ОсновныеСредства.ОтражениеВУчетеБУЗаполненоНекорректно", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"Объект.ОсновныеСредства.ОтражениеВУчетеНУЗаполненоНекорректно", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли,
		"Объект.ОсновныеСредства.ОтражениеВУчетеУСНЗаполненоНекорректно", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненныйРеквизит);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОсновныеСредстваОтражениеВУчетеЕстьОшибка.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОсновныеСредства.ОтражениеВУчетеЕстьОшибка", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Отображать", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОсновныеСредстваНомерИнвентарнойКарточки.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОсновныеСредства.СоздатьИнвентарнуюКарточку", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОсновныеСредства.НомерИнвентарнойКарточки", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОсновныеСредстваНомерИнвентарнойКарточки.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОсновныеСредства.СоздатьИнвентарнуюКарточку", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьНаличиеДоговораВложения()
	
	Элементы.КапитальныеВложенияДоговор.Видимость = ?(ЗначениеЗаполнено(Объект.СчетКредита),
		БухгалтерскийУчетПовтИсп.ЕстьСубконтоСчета(Объект.СчетКредита, ПланыВидовХарактеристик.ВидыСубконто.Договоры),
		Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументуОснованию(ДокументОснование)
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
		
		Если (Объект.ОсновныеСредства.Количество() > 0) Тогда
			Возврат;
		КонецЕсли;	
		
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ДокументОбъект.ЗаполнитьПоЭлектронномуДокументуПоставщика(ДокументОснование);
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоДокументуОснованию()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_КарточкаКапвложений(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "КарточкаКапвложений",
		"Видимость", Форма.Объект.ОтразитьВКарточкеКапвложений);
КонецПроцедуры	

&НаСервере
Функция ВидимостьЭлементовЭДОАкта448()
	Результат = Ложь;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий") Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьСведенияПоЭлектронномуАктуОПриемеПередачеНаСервере()
	
	ИспользуетсяДата = Истина;
	ИспользуетсяКФО = Истина;
	ИспользуетсяКПС = Истина;
	
	ЗагружатьСведенияОШтрихкодахОбъектовНФА = ЭлектронныеДокументыБГУ.ЗагружатьСведенияОШтрихкодахОбъектовНФА(Объект.Организация);
	ТаблицаШтрихкодовОСАкта = ЭлектронныеДокументыБГУ.ПустаяТаблицаШтрихкодовОСАкта();
	
	Объект.ДрагоценныеМатериалы.Очистить();
	
	УбратьПризнакИмуществаКазныУПолученныхОбъектовОС();
	
	ШаблонФормированияИнвНомеров = ПолучитьШаблонИнвНомера(Объект.Организация, Объект.Дата, ИспользуетсяДата, ИспользуетсяКФО, ИспользуетсяКПС);
	
	СведенияПоИнвентарнымОбъектамОтправителя = СведенияПоИнвентарнымОбъектамОтправителя(Объект.ДокументОснование);
	
	GUIDИнвентарныеНомераОтправителя = Новый Массив;
	Для Каждого ТекСтрока Из СведенияПоИнвентарнымОбъектамОтправителя Цикл
		GUIDИнвентарныеНомераОтправителя.Добавить(ТекСтрока.GUIDИнвентарногоНомераУОтправителя);
	КонецЦикла;
	ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя = 
		ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя(Объект.Организация, GUIDИнвентарныеНомераОтправителя, Объект.ДокументОснование);
		
	ИнвентарныеНомераОрганизацииПоИнвентарнымНомерамОтправителя = ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя[0].Выгрузить();
	ОбремененияПоИнвентарнымНомерамОтправителя = ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя[1].Выгрузить();
	СвязанныеКонтрагенты = ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя[2].Выгрузить();
	СведенияОСодержанииДрагМатериалов = ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя[3].Выгрузить();
	СведенияПТС = ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя[4].Выгрузить();
	СведенияКадастровогоУчета = ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя[5].Выгрузить();
	СведенияОШтрихкодах = ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя[6].Выгрузить();
		
	ИнвентарныйНомерДата = Объект.Дата;
	ИнвентарныйНомерКФО = Объект.КФО;
	ИФО = Объект.ИФО;
	
	Для Каждого ТекСтрока Из СведенияПоИнвентарнымОбъектамОтправителя Цикл
		ТекНФА = Справочники.ОсновныеСредства.ПустаяСсылка();
		ИнвентарныйНомерКПС = Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка();
		СчетУчета = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ИдентификаторСтроки", ТекСтрока.ИдентификаторСтроки);
		НайденныеСтроки = Объект.ОсновныеСредства.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			ТекНФА = НайденныеСтроки[0].ОсновноеСредство;
			ИнвентарныйНомерКПС = НайденныеСтроки[0].КПС;
			СчетУчета = НайденныеСтроки[0].СчетУчетаОС;
		КонецЕсли;

		РеестровыйНомер = ТекСтрока.РеестровыйНомер;
		ЗаводскойНомер = ТекСтрока.ЗаводскойНомер;
		НомерПаспорта = ТекСтрока.НомерПаспорта;
		ИнойНомер = ТекСтрока.ИнойНомер;
		ДатаВыпуска = ТекСтрока.ДатаВыпуска;
		ИнвентарныйНомерУОтправителя = ТекСтрока.ИнвентарныйНомерУОтправителя;
		GUIDИнвентарногоНомераУОтправителя = ТекСтрока.GUIDИнвентарногоНомераУОтправителя;
		
		НовыйИнвНомерСсылка = Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
		Если ЗначениеЗаполнено(GUIDИнвентарногоНомераУОтправителя) Тогда
			ПараметрыОтбораИнвНомера = Новый Структура;
			ПараметрыОтбораИнвНомера.Вставить("GUIDИнвентарногоНомераУОтправителя", GUIDИнвентарногоНомераУОтправителя);
			НайденныеСтрокиИнвНомера = ИнвентарныеНомераОрганизацииПоИнвентарнымНомерамОтправителя.НайтиСтроки(ПараметрыОтбораИнвНомера);
			Если НайденныеСтрокиИнвНомера.Количество()>0 Тогда
				НовыйИнвНомерСсылка = НайденныеСтрокиИнвНомера[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НовыйИнвНомерСсылка) Тогда
			
			ПараметрыИнвНомера = Новый Структура;
			ПараметрыИнвНомера.Вставить("Дата"				, ИнвентарныйНомерДата);
			ПараметрыИнвНомера.Вставить("КФО"				, ИнвентарныйНомерКФО);
			ПараметрыИнвНомера.Вставить("КПС"				, ИнвентарныйНомерКПС);
			ПараметрыИнвНомера.Вставить("СчетУчета"			, СчетУчета);
			ПараметрыИнвНомера.Вставить("ИФО"				, ИФО);
			ПараметрыИнвНомера.Вставить("ОсновноеСредство"	, ТекНФА);
			
			ПараметрыИнвНомера.Вставить("ИнвентарныйНомерУОтправителя"	, ИнвентарныйНомерУОтправителя);
			ПараметрыИнвНомера.Вставить("GUIDИнвентарногоНомераУОтправителя"	, GUIDИнвентарногоНомераУОтправителя);
			
			ПараметрыИнвНомера.Вставить("РеестровыйНомер"	, РеестровыйНомер);
			ПараметрыИнвНомера.Вставить("ЗаводскойНомер"	, ЗаводскойНомер);
			ПараметрыИнвНомера.Вставить("НомерПаспорта"	, НомерПаспорта);
			ПараметрыИнвНомера.Вставить("ИнойНомер"	, ИнойНомер);
			ПараметрыИнвНомера.Вставить("ДатаВыпуска"	, ДатаВыпуска);
			
			Отказ = Ложь;
			
			//Обременения по инвентарному номеру
			НайденныеСтрокиОбременений = ОбремененияПоИнвентарнымНомерамОтправителя.НайтиСтроки(ПараметрыОтбораИнвНомера);
			
			НовыйИнвНомерСсылка = СоздатьНовыйИнвентарныйНомер(Объект.Организация, ТекНФА, ПараметрыИнвНомера, ШаблонФормированияИнвНомеров, НайденныеСтрокиОбременений, СвязанныеКонтрагенты, Отказ);
		КонецЕсли;	

		НайденныеСтроки[0].ИнвентарныйНомер = НовыйИнвНомерСсылка;
		
		//Заполнение сведений о содержании драгоценных материалов
		НайденныеСтрокиИнвНомераДМ = СведенияОСодержанииДрагМатериалов.НайтиСтроки(ПараметрыОтбораИнвНомера);
		Для Каждого ТекДрагМатериал Из НайденныеСтрокиИнвНомераДМ Цикл
			НоваяСтрокаДМ = Объект.ДрагоценныеМатериалы.Добавить();
			
			ВидДрагМатериала = ЭлектронныеДокументыБГУ.ВидДрагМатериала(ТекДрагМатериал.КодВидаДрагоценногоМатериала, ТекДрагМатериал.ПолноеНаимВидаДрагоценногоМатериала);
			ЕдИзм = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(ТекДрагМатериал.ЕдИзмКод);
			
			НоваяСтрокаДМ.ОбъектНФА = ТекНФА;
			НоваяСтрокаДМ.ИнвНомер = НовыйИнвНомерСсылка;
			НоваяСтрокаДМ.ВидДрагМатериала = ВидДрагМатериала;
			НоваяСтрокаДМ.МассаДМ = ТекДрагМатериал.МассаДМ;
			НоваяСтрокаДМ.КоличествоДМ = ТекДрагМатериал.КоличествоДМ;
			НоваяСтрокаДМ.ЕдИзм = ЕдИзм;
		КонецЦикла;
		
		//Заполнение сведений ПТС
		НайденныеСтрокиИнвНомераПТС = СведенияПТС.НайтиСтроки(ПараметрыОтбораИнвНомера);
		Для Каждого ТекДанныеПТС Из НайденныеСтрокиИнвНомераПТС Цикл
			НаборЗаписей = РегистрыСведений.ПаспортаТранспортныхСредств.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
			НаборЗаписей.Отбор.ОсновноеСредство.Установить(ТекНФА);
			НаборЗаписей.Отбор.ИнвентарныйНомер.Установить(НовыйИнвНомерСсылка);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись = РегистрыСведений.ПаспортаТранспортныхСредств.СоздатьМенеджерЗаписи();
				НоваяЗапись.Организация = Объект.Организация;
				НоваяЗапись.ОсновноеСредство = ТекНФА;
				НоваяЗапись.ИнвентарныйНомер = НовыйИнвНомерСсылка;
				
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекДанныеПТС);
				НоваяЗапись.ДвигательМодель = ТекДанныеПТС.МодельДвигателя;
				НоваяЗапись.ДвигательНомер = ТекДанныеПТС.НомерДвигателя;
				НоваяЗапись.Период = '19800101';
				НоваяЗапись.Записать(Ложь);
			КонецЕсли;	
		КонецЦикла;

		//Заполнение сведений кадастрового учета
		НайденныеСтрокиИнвНомераКадастра = СведенияКадастровогоУчета.НайтиСтроки(ПараметрыОтбораИнвНомера);
		Для Каждого ТекДанныеКадастра Из НайденныеСтрокиИнвНомераКадастра Цикл
			НаборЗаписей = РегистрыСведений.СведенияКадастровогоУчета.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
			НаборЗаписей.Отбор.ОсновноеСредство.Установить(ТекНФА);
			НаборЗаписей.Отбор.ИнвентарныйНомер.Установить(НовыйИнвНомерСсылка);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись = РегистрыСведений.СведенияКадастровогоУчета.СоздатьМенеджерЗаписи();
				НоваяЗапись.Организация = Объект.Организация;
				НоваяЗапись.ОсновноеСредство = ТекНФА;
				НоваяЗапись.ИнвентарныйНомер = НовыйИнвНомерСсылка;
				
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекДанныеКадастра);
				НоваяЗапись.КадастровыйНомерЗемлиНедвижимости = ТекДанныеКадастра.КадастровыйНомерЗемли;
				НоваяЗапись.Период = '19800101';
				НоваяЗапись.Записать(Ложь);
			КонецЕсли;	
		КонецЦикла;
		
	КонецЦикла;

	//Загрузка сведений о штрихкодах
	Если ЗагружатьСведенияОШтрихкодахОбъектовНФА Тогда
		Для Каждого ТекСтрока Из Объект.ОсновныеСредства Цикл
			ОбъектНФА = ТекСтрока.ОсновноеСредство;
			ИнвНомер = ТекСтрока.ИнвентарныйНомер;
			GUIDНоменклатурыОтправителя = "";
			GUIDИнвентарногоНомераУОтправителя = "";
			Если ЗначениеЗаполнено(ОбъектНФА) Тогда
				РеквизитыНФА = "GUIDНоменклатурыОтправителя";
				ЗначенияРеквизитовНФА = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектНФА, РеквизитыНФА);
				GUIDНоменклатурыОтправителя = ЗначенияРеквизитовНФА.GUIDНоменклатурыОтправителя;
			КонецЕсли;	
			Если ЗначениеЗаполнено(ИнвНомер) Тогда
				РеквизитыИнвНомер = "GUIDИнвентарногоНомераУОтправителя";
				ЗначенияРеквизитовИнвНомер = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИнвНомер, РеквизитыИнвНомер);
				GUIDИнвентарногоНомераУОтправителя = ЗначенияРеквизитовИнвНомер.GUIDИнвентарногоНомераУОтправителя;
			КонецЕсли;
			Если ЗначениеЗаполнено(GUIDНоменклатурыОтправителя) И ЗначениеЗаполнено(GUIDИнвентарногоНомераУОтправителя) Тогда
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("GUIDНоменклатурыУОтправителя", GUIDНоменклатурыОтправителя);
				ПараметрыОтбора.Вставить("GUIDИнвентарногоНомераУОтправителя", GUIDИнвентарногоНомераУОтправителя);
				НайденныеСтроки = СведенияОШтрихкодах.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество()>0 Тогда
					Для Каждого ТекСведенияШК Из НайденныеСтроки Цикл
						НоваяСтрока = ТаблицаШтрихкодовОСАкта.Добавить();
						НоваяСтрока.ОбъектНФА = ТекСтрока.ОсновноеСредство;
						НоваяСтрока.ИнвНомер = ТекСтрока.ИнвентарныйНомер;
						НоваяСтрока.GUIDНоменклатуры = GUIDНоменклатурыОтправителя;
						НоваяСтрока.GUIDИнвентарногоНомера = GUIDИнвентарногоНомераУОтправителя;
						НоваяСтрока.НаименованиеТипаШтрихкода = ТекСведенияШК.НаименованиеТипаШтрихкода;
						НоваяСтрока.ЗначениеШтрихкода = ТекСведенияШК.ЗначениеШтрихкода;
					КонецЦикла;	
				КонецЕсли;	
			ИначеЕсли ЗначениеЗаполнено(GUIDНоменклатурыОтправителя) И НЕ ЗначениеЗаполнено(GUIDИнвентарногоНомераУОтправителя) Тогда
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("GUIDНоменклатурыУОтправителя", GUIDНоменклатурыОтправителя);
				НайденныеСтроки = СведенияОШтрихкодах.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество()>0 Тогда
					Для Каждого ТекСведенияШК Из НайденныеСтроки Цикл
						НоваяСтрока = ТаблицаШтрихкодовОСАкта.Добавить();
						НоваяСтрока.ОбъектНФА = ТекСтрока.ОсновноеСредство;
						НоваяСтрока.ИнвНомер = ТекСтрока.ИнвентарныйНомер;
						НоваяСтрока.GUIDНоменклатуры = GUIDНоменклатурыОтправителя;
						НоваяСтрока.GUIDИнвентарногоНомера = "";
						НоваяСтрока.НаименованиеТипаШтрихкода = ТекСведенияШК.НаименованиеТипаШтрихкода;
						НоваяСтрока.ЗначениеШтрихкода = ТекСведенияШК.ЗначениеШтрихкода;
					КонецЦикла;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		
		Для Каждого ТекСтрока Из ТаблицаШтрихкодовОСАкта Цикл
			Штрихкод = ТекСтрока.ЗначениеШтрихкода;
			Если ЗначениеЗаполнено(Штрихкод) Тогда
				ДанныеШКОС = РегистрыСведений.Штрихкоды.НайтиОбъектПоШтрихкоду(Штрихкод);
				Если ЗначениеЗаполнено(ДанныеШКОС.ОсновноеСредство) Тогда
					Если НЕ (ТекСтрока.ОбъектНФА = ДанныеШКОС.ОсновноеСредство) И НЕ (ТекСтрока.ИнвНомер = ДанныеШКОС.ИнвентарныйНомер) Тогда
						ШаблонСообщения = НСтр("ru = 'Штрихкод ""%1"" для ""%2"" (инв. № %3) уже есть в базе для ""%4"" (инв. № %5).'");
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
							Штрихкод, ТекСтрока.ОбъектНФА, ТекСтрока.ИнвНомер, ДанныеШКОС.ОсновноеСредство, ДанныеШКОС.ИнвентарныйНомер);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;	
				Иначе
					ТекстСообщения = "";
					ЭлектронныеДокументыБГУ.ЗаписатьНовыйШтрихкодОС(ТекСтрока, Объект.Ссылка, ТекстСообщения);
					Если ЗначениеЗаполнено(ТекстСообщения) Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УбратьПризнакИмуществаКазныУПолученныхОбъектовОС()
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ТекСтрока Из Объект.ОсновныеСредства Цикл
		ТекОС = ТекСтрока.ОсновноеСредство;
		Если ЗначениеЗаполнено(ТекОС) Тогда
			Если ТекОС.ИмуществоКазны Тогда
				ТекОСОбъект = ТекОС.ПолучитьОбъект();
				ТекОСОбъект.ИмуществоКазны = Ложь;
				ТекОСОбъект.Записать();
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьШаблонИнвНомера(Организация, Дата, ИспользуетсяДата, ИспользуетсяКФО, ИспользуетсяКПС)
	
	НаДату = ?(ЗначениеЗаполнено(Дата), Дата, Неопределено);
	Шаблон = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Организация, НаДату).ШаблонИнвентарныхНомеров;
	
	УстановитьПризнакиИспользованияПараметровШаблона(Шаблон, ИспользуетсяДата, ИспользуетсяКФО, ИспользуетсяКПС);
	
	Возврат Шаблон;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьПризнакиИспользованияПараметровШаблона(Шаблон, ИспользуетсяДата, ИспользуетсяКФО, ИспользуетсяКПС)
	
	Если ЗначениеЗаполнено(Шаблон) Тогда
		
		ИспользуемыеРеквизиты = Новый Массив;
		Формула = Справочники.ШаблоныНомеровНФА.ФормулаПрефикса(Шаблон.ВидШаблона, Шаблон.СоставШаблона.Выгрузить());
		Справочники.ШаблоныНомеровНФА.ПолнаяФормулаПрефикса(Формула, ИспользуемыеРеквизиты);
		
		ИспользуетсяДата	= (ИспользуемыеРеквизиты.Найти("ДАТА")	<> Неопределено);
		ИспользуетсяКФО		= (ИспользуемыеРеквизиты.Найти("КФО")	<> Неопределено);
		ИспользуетсяКПС		= (ИспользуемыеРеквизиты.Найти("КПС")	<> Неопределено);
		
	Иначе
		
		ИспользуетсяДата	= Ложь;
		ИспользуетсяКФО		= Ложь;
		ИспользуетсяКПС		= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьНовыйИнвентарныйНомер(Организация, НоваяСсылка, ДанныеИнвентарногоНомера, ШаблонФормированияИнвНомеров, НайденныеСтрокиОбременений, СвязанныеКонтрагенты, Отказ)

	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ШаблонФормированияИнвНомеров) Тогда
		Формула = Справочники.ШаблоныНомеровНФА.ФормулаПрефикса(ШаблонФормированияИнвНомеров.ВидШаблона,
			ШаблонФормированияИнвНомеров.СоставШаблона.Выгрузить());
		Формула = Справочники.ШаблоныНомеровНФА.ПолнаяФормулаПрефикса(Формула);
		Префикс = Справочники.ШаблоныНомеровНФА.ПрефиксНомера(Формула, ДанныеИнвентарногоНомера);
		
		ДанныеИнвентарногоНомера.Вставить("Префикс"				, Префикс);
		ДанныеИнвентарногоНомера.Вставить("ДлинаНомера"			, ШаблонФормированияИнвНомеров.ДлинаНомера);
		ДанныеИнвентарногоНомера.Вставить("БезУчетаПрефикса"	, ШаблонФормированияИнвНомеров.БезУчетаПрефикса);
		
		ПоследнийНомер = Справочники.ИнвентарныеНомераОС.ПоследнийНомер(Организация, ДанныеИнвентарногоНомера);
	Иначе
		Префикс = "";
		ДанныеИнвентарногоНомера.Вставить("Префикс"				, Префикс);
		ПоследнийНомер = Справочники.ИнвентарныеНомераОС.ПоследнийНомер(Организация, );
		ДлинаНомера = СтрДлина(ПоследнийНомер);
		ДанныеИнвентарногоНомера.Вставить("ДлинаНомера"			, ДлинаНомера);
		ДанныеИнвентарногоНомера.Вставить("БезУчетаПрефикса"	, Истина);
		
		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПоследнийНомер) Тогда
			ДлинаПоследнегоНомера = СтрДлина(ПоследнийНомер);
			Для н = 1 По ДлинаПоследнегоНомера Цикл
				ВременныйПоследнийНомер = Прав(ПоследнийНомер, н);
				Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ВременныйПоследнийНомер) Тогда
					Префикс = Лев(ПоследнийНомер, ДлинаПоследнегоНомера - н + 1);
					ПоследнийНомер = Прав(ПоследнийНомер, н - 1);
					ДанныеИнвентарногоНомера.БезУчетаПрефикса = Ложь;
					ДанныеИнвентарногоНомера.Префикс = Префикс;
					ДанныеИнвентарногоНомера.ДлинаНомера = СтрДлина(ПоследнийНомер);
					
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
		
	КонецЕсли;
	ПорядковыйНомер = ?(ЗначениеЗаполнено(ПоследнийНомер), Число(ПоследнийНомер), 0) + 1;
	
	ДанныеИнвентарногоНомера.Вставить("ПорядковыйНомер", ПорядковыйНомер);

	ИнвНомерКод = ДанныеИнвентарногоНомера.Префикс + Формат(
		ДанныеИнвентарногоНомера.ПорядковыйНомер, "ЧВН=; ЧГ=; ЧЦ=" + ДанныеИнвентарногоНомера.ДлинаНомера);
		
	НовыйОбъектИнвНомер = Справочники.ИнвентарныеНомераОС.СоздатьЭлемент();
	НовыйОбъектИнвНомер.Владелец		= Организация;
	НовыйОбъектИнвНомер.ОС				= НоваяСсылка;
	НовыйОбъектИнвНомер.Код				= ИнвНомерКод;
	НовыйОбъектИнвНомер.ЗаводскойНомер	= ДанныеИнвентарногоНомера.ЗаводскойНомер;
	НовыйОбъектИнвНомер.РеестровыйНомер	= ДанныеИнвентарногоНомера.РеестровыйНомер;
	НовыйОбъектИнвНомер.НомерПаспорта	= ДанныеИнвентарногоНомера.НомерПаспорта;
	НовыйОбъектИнвНомер.ИнойНомер	= ДанныеИнвентарногоНомера.ИнойНомер;
	НовыйОбъектИнвНомер.ДатаВыпуска	= ДанныеИнвентарногоНомера.ДатаВыпуска;
	НовыйОбъектИнвНомер.ИнвентарныйНомерУОтправителя = ДанныеИнвентарногоНомера.ИнвентарныйНомерУОтправителя;
	НовыйОбъектИнвНомер.GUIDИнвентарногоНомераУОтправителя = ДанныеИнвентарногоНомера.GUIDИнвентарногоНомераУОтправителя;
	
	Для Каждого ТекСтрока Из НайденныеСтрокиОбременений Цикл
		КонтрагентОбременения = Справочники.Контрагенты.ПустаяСсылка();
		
		НоваяСтрокаОбременения = НовыйОбъектИнвНомер.Обременения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаОбременения, ТекСтрока);

		ПараметрыОтбораКонтрагента = Новый Структура;
		ПараметрыОтбораКонтрагента.Вставить("GUIDКонтрагента", ТекСтрока.GUIDКонтрагента);
		НайденныеСтрокиКонтрагента = СвязанныеКонтрагенты.НайтиСтроки(ПараметрыОтбораКонтрагента);
		Если НайденныеСтрокиКонтрагента.Количество()>0 Тогда
			ДанныеКонтрагентаИНН = НайденныеСтрокиКонтрагента[0].ИНН;
			ДанныеКонтрагентаКПП = НайденныеСтрокиКонтрагента[0].КПП;
			ПолноеНаименование = НайденныеСтрокиКонтрагента[0].НаименованиеКонтрагента;
			
			ЭлектронныеДокументыБГУ.СсылкаНаОбъектПоИННКПП("Контрагенты", ДанныеКонтрагентаИНН, ДанныеКонтрагентаКПП, КонтрагентОбременения);
			Если НЕ ЗначениеЗаполнено(КонтрагентОбременения) Тогда
				//Создание нового контрагента
				ИНН = ДанныеКонтрагентаИНН;
				КПП = ДанныеКонтрагентаКПП;
				РеквизитыКонтрагента = Новый Структура;
				РеквизитыКонтрагента.Вставить("ИНН", ИНН);
				РеквизитыКонтрагента.Вставить("КПП", КПП);
				РеквизитыКонтрагента.Вставить("Наименование", ПолноеНаименование);
				
				Если СтрДлина(ИНН) = 12 Тогда
					НаименованиеБезИП = ПолноеНаименование;
					Если Лев(ПолноеНаименование, 2) = "ИП" Тогда
						НаименованиеБезИП = Сред(ПолноеНаименование, 3);
					Иначе
						ПризнакИП = "Индивидуальный предприниматель";
						ПозИП = СтрНайти(ПолноеНаименование, ПризнакИП);
						Если ПозИП > 0 Тогда
							НаименованиеБезИП = Сред(ПолноеНаименование, СтрДлина(ПризнакИП)+1);
						КонецЕсли;
					КонецЕсли;
					ФИОПоОтдельности = ЭлектронныеДокументыБГУ.ФИОПоОтдельности(НаименованиеБезИП);
					РеквизитыКонтрагента.Вставить("Фамилия", ФИОПоОтдельности.Фамилия);
					РеквизитыКонтрагента.Вставить("Имя", ФИОПоОтдельности.Имя);
					РеквизитыКонтрагента.Вставить("Отчество", ФИОПоОтдельности.Отчество);
				КонецЕсли;	
				
				ЭлектронныеДокументыБГУ.СоздатьКонтрагентаПоРеквизитам(РеквизитыКонтрагента, КонтрагентОбременения);
				
			КонецЕсли;	
		КонецЕсли;
		
		НоваяСтрокаОбременения.Контрагент = КонтрагентОбременения;
	КонецЦикла;	
	
	ЗаписатьОбъект(НовыйОбъектИнвНомер, Отказ);
	
	Возврат НовыйОбъектИнвНомер.Ссылка;
	
КонецФункции	

&НаСервере
Процедура ЗаписатьОбъект(ЗаписываемыйОбъект, Отказ)
	
	Попытка
		ЗаписываемыйОбъект.Записать();
	Исключение
		ОписаниеОшибки = ИнформацияОбОшибке();
		
		ОтменитьТранзакцию();
		
		МетаданныеОбъекта = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ЗаписываемыйОбъект)));
		
		ЗаписьЖурналаРегистрации("Групповое создание инвентарных номеров по данным акта о приеме-передаче НФА.Запись",
								УровеньЖурналаРегистрации.Ошибка,
								МетаданныеОбъекта,
								,
								ПодробноеПредставлениеОшибки(ОписаниеОшибки));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ОписаниеОшибки));
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция СведенияПоИнвентарнымОбъектамОтправителя(ДокументАктОПриемеПередаче)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеНФА.НФА КАК НФА,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеНФА.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеНФА.GUIDНоменклатурыУОтправителя КАК GUIDНоменклатурыУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеНФА.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОбОбъектахНФА.РеестровыйНомер КАК РеестровыйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОбОбъектахНФА.ЗаводскойНомер КАК ЗаводскойНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОбОбъектахНФА.НомерПаспорта КАК НомерПаспорта,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОбОбъектахНФА.ИнойНомер КАК ИнойНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОбОбъектахНФА.ДатаВыпуска КАК ДатаВыпуска,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОбОбъектахНФА.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.ПереданныеНФА КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеНФА
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.СведенияОбОбъектахНФА КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОбОбъектахНФА
	               |		ПО ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеНФА.GUIDНоменклатурыУОтправителя = ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОбОбъектахНФА.GUIDНоменклатурыУОтправителя
	               |			И ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеНФА.ИнвентарныйНомерУОтправителя = ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОбОбъектахНФА.ИнвентарныйНомерУОтправителя
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеНФА.Ссылка = &Ссылка
	               |	И ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеНФА.ЕстьИнвентарныйНомерУОтправителя = ИСТИНА
	               |	И ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОбОбъектахНФА.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументАктОПриемеПередаче);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя(Организация, GUIDИнвентарныхНомеровУОтправителя, ЭлектронныйАктОПриемеПередаче)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнвентарныеНомераОС.Ссылка КАК Ссылка,
	               |	ИнвентарныеНомераОС.ОС КАК ОС,
	               |	ИнвентарныеНомераОС.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя
	               |ИЗ
	               |	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	               |ГДЕ
	               |	ИнвентарныеНомераОС.GUIDИнвентарногоНомераУОтправителя В(&GUIDИнвентарныхНомеровУОтправителя)
	               |	И ИнвентарныеНомераОС.Владелец = &Организация
	               |	И ИнвентарныеНомераОС.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.НаименованиеЧасти КАК НаименованиеЧасти,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.РазмерЧасти КАК РазмерЧасти,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ВидОбременения КАК ВидОбременения,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДатаНачала КАК ДатаНачала,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДатаОкончания КАК ДатаОкончания,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДокументРегистрацииДата КАК ДокументРегистрацииДата,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДокументРегистрацииНомер КАК ДокументРегистрацииНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДокументОбремененияВид КАК ДокументОбремененияВид,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДокументОбремененияДата КАК ДокументОбремененияДата,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДокументОбремененияНомер КАК ДокументОбремененияНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.Контрагент КАК Контрагент,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ЕдИзмКод КАК ЕдИзмКод,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ЕдИзмНаим КАК ЕдИзмНаим,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.GUIDКонтрагента КАК GUIDКонтрагента
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.ОбремененияПоИнвентарнымОбъектамНФА КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.Ссылка = &ЭлектронныйАктОПриемеПередаче
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.GUIDКонтрагента КАК GUIDКонтрагента,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.ИНН КАК ИНН,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.КПП КАК КПП,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.ОГРН КАК ОГРН,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.ОГРНИП КАК ОГРНИП,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.НаименованиеКонтрагента КАК НаименованиеКонтрагента
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.СвязанныеКонтрагенты КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.Ссылка = &ЭлектронныйАктОПриемеПередаче
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.НаименованиеНФА КАК НаименованиеНФА,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.GUIDНоменклатурыУОтправителя КАК GUIDНоменклатурыУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.КодВидаДрагоценногоМатериала КАК КодВидаДрагоценногоМатериала,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.ПолноеНаимВидаДрагоценногоМатериала КАК ПолноеНаимВидаДрагоценногоМатериала,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.ЕдИзмКод КАК ЕдИзмКод,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.ЕдИзмНаим КАК ЕдИзмНаим,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.МассаДМ КАК МассаДМ,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.КоличествоДМ КАК КоличествоДМ
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.СведенияОСодержанииДрагМатериалов КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.Ссылка = &ЭлектронныйАктОПриемеПередаче
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НаименованиеНФА КАК НаименованиеНФА,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.GUIDНоменклатурыУОтправителя КАК GUIDНоменклатурыУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.СерияНомер КАК СерияНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.ИдентификационныйНомер КАК ИдентификационныйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Марка КАК Марка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Модель КАК Модель,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Тип КАК Тип,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.МодельДвигателя КАК МодельДвигателя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НомерДвигателя КАК НомерДвигателя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НомерШасси КАК НомерШасси,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НомерКузова КАК НомерКузова,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.ЭкологическийКласс КАК ЭкологическийКласс,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Масса КАК Масса,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.ГаражныйНомер КАК ГаражныйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Грузоподъемность КАК Грузоподъемность,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Колонна КАК Колонна,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.РегистрационныйЗнак КАК РегистрационныйЗнак
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.СведенияПаспортаТранспортногоСредства КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Ссылка = &ЭлектронныйАктОПриемеПередаче
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.НаименованиеНФА КАК НаименованиеНФА,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.GUIDНоменклатурыУОтправителя КАК GUIDНоменклатурыУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КадастроваяСтоимость КАК КадастроваяСтоимость,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КадастровыйНомер КАК КадастровыйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КадастровыйНомерЗемли КАК КадастровыйНомерЗемли,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КадастровыйНомерЗдания КАК КадастровыйНомерЗдания,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.УсловныйНомер КАК УсловныйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КоличествоЭтажей КАК КоличествоЭтажей,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ОбщаяПлощадь КАК ОбщаяПлощадь,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ОбщийОбъем КАК ОбщийОбъем,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ПодземныйОбъем КАК ПодземныйОбъем,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ЭтоПомещение КАК ЭтоПомещение,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ВидОбъектаНедвижимости КАК ВидОбъектаНедвижимости
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.СведенияКадастровогоУчета КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.Ссылка = &ЭлектронныйАктОПриемеПередаче
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеШтрихкодыНФА.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеШтрихкодыНФА.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеШтрихкодыНФА.GUIDНоменклатурыУОтправителя КАК GUIDНоменклатурыУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеШтрихкодыНФА.НаименованиеНФА КАК НаименованиеНФА,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеШтрихкодыНФА.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеШтрихкодыНФА.ТипСправочника КАК ТипСправочника,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеШтрихкодыНФА.НаименованиеТипаШтрихкода КАК НаименованиеТипаШтрихкода,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеШтрихкодыНФА.ЗначениеШтрихкода КАК ЗначениеШтрихкода
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.ПереданныеШтрихкодыНФА КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеШтрихкодыНФА
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийПереданныеШтрихкодыНФА.Ссылка = &ЭлектронныйАктОПриемеПередаче";
	Запрос.УстановитьПараметр("GUIDИнвентарныхНомеровУОтправителя", GUIDИнвентарныхНомеровУОтправителя);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЭлектронныйАктОПриемеПередаче", ЭлектронныйАктОПриемеПередаче);

	Возврат Запрос.ВыполнитьПакет();

КонецФункции

&НаСервере
Процедура ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ТекстСведений = "")
	ЭлектронныеДокументыБГУ.ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ЭтотОбъект, ТекстСведений);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСведенийЭлектронногоАктаОПриемеПередаче(ДанныеДляАкта)
	КоличествоФайлов = ДанныеДляАкта.КоличествоФайлов;
	
	ТекстСведений = ЭлектронныеДокументыБГУКлиент.ТекстПриложеноФайлов(КоличествоФайлов);

	ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ТекстСведений);
КонецПроцедуры	

&НаСервере
Функция НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448()
	Возврат ЭлектронныеДокументыБГУ.НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448();
КонецФункции

&НаКлиенте
Процедура НадписьДопСведенияЭлектронногоАктаПоФорме0510448Нажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Параметры.Ключ.Пустая() Тогда
		ТекстОшибки = НСтр("ru='Необходимо записать документ для заполнение сведений электронного акта о приеме-передаче НФА.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		
		Возврат;
	КонецЕсли;
	
	ПараметрыДопСведений = НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448();
	
	ПараметрыДопСведений.Ссылка = Объект.Ссылка;
	ПараметрыДопСведений.ДатаСведений = Объект.Дата;
	ПараметрыДопСведений.Организация = Объект.Организация;
	
	ЭлектронныеДокументыБГУКлиент.ОткрытьФормуДопСведенийДляЭлектронногоАктаПоФорме0510448(ЭтотОбъект, Объект, ПараметрыДопСведений);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияПоЭлектронномуДокументуПоставщикаНаСервере()
	
	ИспользуетсяДата = Истина;
	ИспользуетсяКФО = Истина;
	ИспользуетсяКПС = Истина;
	
	Объект.ДрагоценныеМатериалы.Очистить();
	
	ШаблонФормированияИнвНомеров = ПолучитьШаблонИнвНомера(Объект.Организация, Объект.Дата, ИспользуетсяДата, ИспользуетсяКФО, ИспользуетсяКПС);
	
	СведенияПоИнвентарнымОбъектамОтправителя = СведенияПоИнвентарнымОбъектамОтправителяИзЭДП(Объект.ДокументОснование);
	
	GUIDИнвентарныеНомераОтправителя = Новый Массив;
	Для Каждого ТекСтрока Из СведенияПоИнвентарнымОбъектамОтправителя Цикл
		GUIDИнвентарныеНомераОтправителя.Добавить(ТекСтрока.GUIDИнвентарногоНомераУОтправителя);
	КонецЦикла;
	ДанныеЭлектронногоДокументаПоставщикаПоИнвентарнымНомерамОтправителя = 
		ДанныеЭлектронногоДокументаПоставщикаПоИнвентарнымНомерамОтправителя(Объект.Организация, GUIDИнвентарныеНомераОтправителя, Объект.ДокументОснование);
		
	ИнвентарныеНомераОрганизацииПоИнвентарнымНомерамОтправителя = ДанныеЭлектронногоДокументаПоставщикаПоИнвентарнымНомерамОтправителя[0].Выгрузить();
	ОбремененияПоИнвентарнымНомерамОтправителя = Новый ТаблицаЗначений;
	СвязанныеКонтрагенты = Новый ТаблицаЗначений;
	СведенияОСодержанииДрагМатериалов = Новый ТаблицаЗначений;
	СведенияПТС = Новый ТаблицаЗначений;
	СведенияКадастровогоУчета = Новый ТаблицаЗначений;
		
	ИнвентарныйНомерДата = Объект.Дата;
	ИнвентарныйНомерКФО = Объект.КФО;
	ИФО = Объект.ИФО;
	
	Для Каждого ТекСтрока Из СведенияПоИнвентарнымОбъектамОтправителя Цикл
		ТекНФА = Справочники.ОсновныеСредства.ПустаяСсылка();
		ИнвентарныйНомерКПС = Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка();
		СчетУчета = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ИдентификаторСтроки", ТекСтрока.ИдентификаторСтроки);
		НайденныеСтроки = Объект.ОсновныеСредства.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			ТекНФА = НайденныеСтроки[0].ОсновноеСредство;
			ИнвентарныйНомерКПС = НайденныеСтроки[0].КПС;
			СчетУчета = НайденныеСтроки[0].СчетУчетаОС;
		КонецЕсли;

		РеестровыйНомер = ТекСтрока.РеестровыйНомер;
		ЗаводскойНомер = ТекСтрока.ЗаводскойНомер;
		НомерПаспорта = ТекСтрока.НомерПаспорта;
		ИнойНомер = ТекСтрока.ИнойНомер;
		ДатаВыпуска = ТекСтрока.ДатаВыпуска;
		ИнвентарныйНомерУОтправителя = ТекСтрока.ИнвентарныйНомерУОтправителя;
		GUIDИнвентарногоНомераУОтправителя = ТекСтрока.GUIDИнвентарногоНомераУОтправителя;
		
		НовыйИнвНомерСсылка = Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
		Если ЗначениеЗаполнено(GUIDИнвентарногоНомераУОтправителя) Тогда
			ПараметрыОтбораИнвНомера = Новый Структура;
			ПараметрыОтбораИнвНомера.Вставить("GUIDИнвентарногоНомераУОтправителя", GUIDИнвентарногоНомераУОтправителя);
			НайденныеСтрокиИнвНомера = ИнвентарныеНомераОрганизацииПоИнвентарнымНомерамОтправителя.НайтиСтроки(ПараметрыОтбораИнвНомера);
			Если НайденныеСтрокиИнвНомера.Количество()>0 Тогда
				НовыйИнвНомерСсылка = НайденныеСтрокиИнвНомера[0].Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НовыйИнвНомерСсылка) Тогда
			
			ПараметрыИнвНомера = Новый Структура;
			ПараметрыИнвНомера.Вставить("Дата"				, ИнвентарныйНомерДата);
			ПараметрыИнвНомера.Вставить("КФО"				, ИнвентарныйНомерКФО);
			ПараметрыИнвНомера.Вставить("КПС"				, ИнвентарныйНомерКПС);
			ПараметрыИнвНомера.Вставить("СчетУчета"			, СчетУчета);
			ПараметрыИнвНомера.Вставить("ИФО"				, ИФО);
			ПараметрыИнвНомера.Вставить("ОсновноеСредство"	, ТекНФА);
			
			ПараметрыИнвНомера.Вставить("ИнвентарныйНомерУОтправителя"	, ИнвентарныйНомерУОтправителя);
			ПараметрыИнвНомера.Вставить("GUIDИнвентарногоНомераУОтправителя"	, GUIDИнвентарногоНомераУОтправителя);
			
			ПараметрыИнвНомера.Вставить("РеестровыйНомер"	, РеестровыйНомер);
			ПараметрыИнвНомера.Вставить("ЗаводскойНомер"	, ЗаводскойНомер);
			ПараметрыИнвНомера.Вставить("НомерПаспорта"	, НомерПаспорта);
			ПараметрыИнвНомера.Вставить("ИнойНомер"	, ИнойНомер);
			ПараметрыИнвНомера.Вставить("ДатаВыпуска"	, ДатаВыпуска);
			
			Отказ = Ложь;
			
			//Обременения по инвентарному номеру
			НайденныеСтрокиОбременений = Новый Массив;
			
			НовыйИнвНомерСсылка = СоздатьНовыйИнвентарныйНомер(Объект.Организация, ТекНФА, ПараметрыИнвНомера, ШаблонФормированияИнвНомеров, НайденныеСтрокиОбременений, СвязанныеКонтрагенты, Отказ);
		КонецЕсли;	

		НайденныеСтроки[0].ИнвентарныйНомер = НовыйИнвНомерСсылка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СведенияПоИнвентарнымОбъектамОтправителяИзЭДП(ЭлектронныйДокументПоставщика)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлектронныйДокументПоставщикаСписокНоменклатуры.Номенклатура КАК НФА,
	               |	ЭлектронныйДокументПоставщикаСписокНоменклатуры.ИнвентарныйНомер КАК ИнвентарныйНомерУОтправителя,
	               |	ВЫРАЗИТЬ(ЭлектронныйДокументПоставщикаСписокНоменклатуры.Номенклатура КАК Справочник.ОсновныеСредства).GUIDНоменклатурыОтправителя КАК GUIDНоменклатурыУОтправителя,
	               |	ЭлектронныйДокументПоставщикаСписокНоменклатуры.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	"""" КАК РеестровыйНомер,
	               |	"""" КАК ЗаводскойНомер,
	               |	"""" КАК НомерПаспорта,
	               |	"""" КАК ИнойНомер,
	               |	&ПустаяДата КАК ДатаВыпуска,
	               |	ЭлектронныйДокументПоставщикаСписокНоменклатуры.GUIDИнвентарногоНомера КАК GUIDИнвентарногоНомераУОтправителя
	               |ИЗ
	               |	Документ.ЭлектронныйДокументПоставщика.СписокНоменклатуры КАК ЭлектронныйДокументПоставщикаСписокНоменклатуры
	               |ГДЕ
	               |	ЭлектронныйДокументПоставщикаСписокНоменклатуры.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЭлектронныйДокументПоставщика);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ДанныеЭлектронногоДокументаПоставщикаПоИнвентарнымНомерамОтправителя(Организация, GUIDИнвентарныхНомеровУОтправителя, ЭлектронныйАктОПриемеПередаче)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнвентарныеНомераОС.Ссылка КАК Ссылка,
	               |	ИнвентарныеНомераОС.ОС КАК ОС,
	               |	ИнвентарныеНомераОС.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя
	               |ИЗ
	               |	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	               |ГДЕ
	               |	ИнвентарныеНомераОС.GUIDИнвентарногоНомераУОтправителя В(&GUIDИнвентарныхНомеровУОтправителя)
	               |	И ИнвентарныеНомераОС.Владелец = &Организация
	               |	И ИнвентарныеНомераОС.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.НаименованиеЧасти КАК НаименованиеЧасти,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.РазмерЧасти КАК РазмерЧасти,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ВидОбременения КАК ВидОбременения,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДатаНачала КАК ДатаНачала,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДатаОкончания КАК ДатаОкончания,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДокументРегистрацииДата КАК ДокументРегистрацииДата,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДокументРегистрацииНомер КАК ДокументРегистрацииНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДокументОбремененияВид КАК ДокументОбремененияВид,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДокументОбремененияДата КАК ДокументОбремененияДата,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ДокументОбремененияНомер КАК ДокументОбремененияНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.Контрагент КАК Контрагент,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ЕдИзмКод КАК ЕдИзмКод,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.ЕдИзмНаим КАК ЕдИзмНаим,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.GUIDКонтрагента КАК GUIDКонтрагента
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.ОбремененияПоИнвентарнымОбъектамНФА КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийОбремененияПоИнвентарнымОбъектамНФА.Ссылка = &ЭлектронныйАктОПриемеПередаче
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.GUIDКонтрагента КАК GUIDКонтрагента,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.ИНН КАК ИНН,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.КПП КАК КПП,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.ОГРН КАК ОГРН,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.ОГРНИП КАК ОГРНИП,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.НаименованиеКонтрагента КАК НаименованиеКонтрагента
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.СвязанныеКонтрагенты КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСвязанныеКонтрагенты.Ссылка = &ЭлектронныйАктОПриемеПередаче
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.НаименованиеНФА КАК НаименованиеНФА,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.GUIDНоменклатурыУОтправителя КАК GUIDНоменклатурыУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.КодВидаДрагоценногоМатериала КАК КодВидаДрагоценногоМатериала,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.ПолноеНаимВидаДрагоценногоМатериала КАК ПолноеНаимВидаДрагоценногоМатериала,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.ЕдИзмКод КАК ЕдИзмКод,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.ЕдИзмНаим КАК ЕдИзмНаим,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.МассаДМ КАК МассаДМ,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.КоличествоДМ КАК КоличествоДМ
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.СведенияОСодержанииДрагМатериалов КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.Ссылка = &ЭлектронныйАктОПриемеПередаче
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НаименованиеНФА КАК НаименованиеНФА,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.GUIDНоменклатурыУОтправителя КАК GUIDНоменклатурыУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.СерияНомер КАК СерияНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.ИдентификационныйНомер КАК ИдентификационныйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Марка КАК Марка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Модель КАК Модель,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Тип КАК Тип,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.МодельДвигателя КАК МодельДвигателя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НомерДвигателя КАК НомерДвигателя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НомерШасси КАК НомерШасси,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НомерКузова КАК НомерКузова,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.ЭкологическийКласс КАК ЭкологическийКласс,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Масса КАК Масса,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.ГаражныйНомер КАК ГаражныйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Грузоподъемность КАК Грузоподъемность,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Колонна КАК Колонна,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.РегистрационныйЗнак КАК РегистрационныйЗнак
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.СведенияПаспортаТранспортногоСредства КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Ссылка = &ЭлектронныйАктОПриемеПередаче
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.НаименованиеНФА КАК НаименованиеНФА,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.GUIDНоменклатурыУОтправителя КАК GUIDНоменклатурыУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КадастроваяСтоимость КАК КадастроваяСтоимость,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КадастровыйНомер КАК КадастровыйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КадастровыйНомерЗемли КАК КадастровыйНомерЗемли,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КадастровыйНомерЗдания КАК КадастровыйНомерЗдания,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.УсловныйНомер КАК УсловныйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КоличествоЭтажей КАК КоличествоЭтажей,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ОбщаяПлощадь КАК ОбщаяПлощадь,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ОбщийОбъем КАК ОбщийОбъем,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ПодземныйОбъем КАК ПодземныйОбъем,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ЭтоПомещение КАК ЭтоПомещение
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.СведенияКадастровогоУчета КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.Ссылка = &ЭлектронныйАктОПриемеПередаче";
	Запрос.УстановитьПараметр("GUIDИнвентарныхНомеровУОтправителя", GUIDИнвентарныхНомеровУОтправителя);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЭлектронныйАктОПриемеПередаче", ЭлектронныйАктОПриемеПередаче);

	Возврат Запрос.ВыполнитьПакет();

КонецФункции

&НаСервере
Процедура ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи()

	УправлениеНФА.ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи(Объект, ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи);
	
КонецПроцедуры

&НаСервере
Процедура ВидПоступленияПриИзмененииНаСервере()
	
	ОтражатьВНалоговомУчете =
		УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВНалоговомУчетеПринятиеКУчету(Объект);
	ОтражатьВУСНДоходыМинусРасходы =
		УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВУСНДоходыМинусРасходыПринятиеКУчету(Объект);
	УстановитьЕстьПрослеживаемыеТовары();
	УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
	ЗаполнитьМЦВнеоборотногоАктиваСДрагМатериалами(Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииВидПоступления(Форма)
	Объект = Форма.Объект;
	ЭтоПоступлениеИзПользования = 
		УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПоступлениеИзПользования(Объект.ВидПоступления);
	Если НЕ ЭтоПоступлениеИзПользования И Объект.ПередачаЧастейОбъектов Тогда
		Объект.ПередачаЧастейОбъектов = Ложь;
	КонецЕсли;	
	
	ЭтоПриобретениеИлиИзготовление =
		УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(Объект.ВидПоступления);
	Если ЭтоПриобретениеИлиИзготовление И Объект.ВидИмуществаВТабличнойЧасти Тогда
		Объект.ВидИмуществаВТабличнойЧасти = Ложь;
	КонецЕсли;	
	
	УстановитьПоДокументуВозможенУчетПрослеживаемыхТоваров(Форма);
	УстановитьВидимостьЭлементов(Форма);
	УстановитьВидимостьЭлементовНалоговогоУчета(Форма);
	УстановитьДоступностьКоличества(Форма);
КонецПроцедуры	

//*****************************

&НаКлиенте
Процедура ДокументОснованиеПриИзменении_Завершение(Результат, Параметры) Экспорт                     
	СсылкаЦелевогоДокумента = Неопределено;
	Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("СсылкаЦелевогоДокумента") Тогда
		СсылкаЦелевогоДокумента = Параметры.СсылкаЦелевогоДокумента;
	КонецЕсли;	
	ВвестиНаОсновании_ИнвентаризационнаяОписьНФА(Объект.ДокументОснование, Результат, СсылкаЦелевогоДокумента);

	ПриИзмененииВидПоступления(ЭтотОбъект);
	ВидПоступленияПриИзмененииНаСервере();
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОС(ЭтотОбъект);
КонецПроцедуры	

&НаСервере
Процедура ВвестиНаОсновании_ИнвентаризационнаяОписьНФА(ДокОснование, Разделитель, СсылкаЦелевогоДокумента)
	ТекОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.ПринятиеКУчетуОбъектовОС"));
	ДанныеЗаполнения = Новый Структура("ДокументОснование, Разделитель, ВводНаОсновании, СсылкаЦелевогоДокумента", 
		ДокОснование, Разделитель, Истина, СсылкаЦелевогоДокумента);
	ТекОбъект.Заполнить(ДанныеЗаполнения);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
КонецПроцедуры	

&НаСервереБезКонтекста
Функция КодыСчетовКапвложений()
	Возврат ПланыСчетов.ЕПСБУ.КодыСчетовПоМаскеИСубконто("ОсновныеСредства", "106%", "106.5%");
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьКоличествоВТабЧасти(Форма)
	Для каждого ТекСтрока из Форма.Объект.ОсновныеСредства Цикл
		Если ТекСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		ТекСтрока.Количество = 0;
	КонецЦикла;	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Функция СписокВидовИмущества(ВШапке = Истина)
	Результат = Новый СписокЗначений();
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыИмущества.НедвижимоеИмущество"), 
		НСтр("ru = '10 - Недвижимое имущество'"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыИмущества.ДвижимоеОсобоЦенное"), 
		НСтр("ru = '20 - Особо ценное движимое имущество'"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыИмущества.ИноеДвижимое"), 
		НСтр("ru = '30 - Иное движимое имущество'"));
	Если ВШапке Тогда		
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыИмущества.Лизинг"), 
			НСтр("ru = '40 - Предметы лизинга (устарел)'"));
	КонецЕсли;		
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыИмущества.ПраваПользованияНМА"), 
		НСтр("ru = '60 - Права пользования НМА'"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыИмущества.ВКонцессии"), 
		НСтр("ru = '90 - Имущество в концессии'"));
		
	Возврат Результат;	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокВидовИмущества(ИмяПоля, Форма, ВШапке = Истина)
	ВидыИмущества = СписокВидовИмущества(ВШапке); 
	
	Элементы = Форма.Элементы;
	Элементы[ИмяПоля].СписокВыбора.Очистить();
	Для каждого ТекВидИмущества из ВидыИмущества Цикл
		Элементы[ИмяПоля].СписокВыбора.Добавить(ТекВидИмущества.Значение, ТекВидИмущества.Представление);
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьСостояниеЭДОАктаПоФорме0510448НаКлиенте()
	ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере()
	ЭлектронныеДокументыБГУ.ЗаполнитьСостояниеЭДОАктаПоФорме0510448(Объект.Ссылка, Элементы.ДекорацияСостояниеЭДОАкты);
	Если Элементы.ДекорацияСостояниеЭДОАкты.Заголовок = "Не начат" Тогда
		ВидимостьЭДОАктами = Ложь;
	Иначе		
		ВидимостьЭДОАктами = Истина;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаСостояниеЭДОБГУ", "Видимость", ВидимостьЭДОАктами);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияЭДОУПД", "Видимость", НЕ ВидимостьЭДОАктами);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияСостояниеЭДО", "Видимость", НЕ ВидимостьЭДОАктами);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВозможныГарантийныеОбязательства(ВидОперации)
	Возврат Документы.ПринятиеКУчетуОбъектовОС.ВозможныГарантийныеОбязательства(ВидОперации);
КонецФункции	

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСчетаВСтроке(ТекущаяСтрока)
	
	Если ТекущаяСтрока.ВидНФА = Перечисления.ВидыНФА.ОС Тогда
		Если Объект.ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс
			ИЛИ Объект.ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление
			ИЛИ Объект.ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение Тогда
			
			Отбор = Новый Структура("ТипНФА, ВидИмущества",
				ТекущаяСтрока.ТипНФА, ?(Объект.ВидИмуществаВТабличнойЧасти, ТекущаяСтрока.ВидИмущества, Объект.ВидИмущества));
			
			СчетаСтроки = ТаблицаСчетовУчетаОС.НайтиСтроки(Отбор);
			
			Если СчетаСтроки.Количество() Тогда
				ТекущаяСтрока.СчетУчетаОС = СчетаСтроки[0].Счет;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОсновныеСредстваВидИмуществаПриИзмененииСервер(ИдентификаторСтроки)

	ТекущаяСтрока = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗаполнитьДанныеСчетаВСтроке(ТекущаяСтрока);

	Если ЗначениеЗаполнено(ТекущаяСтрока.СчетУчетаОС) Тогда
		АвтозаполнениеКПСПоСчетуВСтроке(ТекущаяСтрока, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСчетовУчетаОС(Дата, Организация)
	
	ТаблицаСчетовУчетаОС.Загрузить(УправлениеОсновнымиСредствами.СчетаГруппыОСПоТипамНФА(Дата, Организация));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура АвтозаполнениеКПСПоСчетуВСтроке(Строка, Форма)
	
	Если Форма.КэшПараметров.КонтролироватьОперацииНаСоответствиеРПС
		И Строка <> Неопределено И ЗначениеЗаполнено(Строка.СчетУчетаОС) Тогда
		
		ЗначенияАвтозаполнения = УправлениеНФАВызовСервера.ЗначенияКПСКФОПоУмолчаниюДляСчета(
		Форма.Объект.Организация,
		Форма.Объект.ИФО,
		Строка.СчетУчетаОС,
		Форма.Объект.Дата,
		Форма.Объект.КФО);
		
		Если ЗначенияАвтозаполнения <> Неопределено Тогда
			Строка.КПС = ЗначенияАвтозаполнения.КПС;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокНФАДокументаОснования

&НаКлиенте
Процедура МЦСДрагоценнымиМатериаламиКоличествоМЦПриИзменении(Элемент)
	
	ТекДанные = Элементы.МЦСДрагоценнымиМатериалами.ТекущиеДанные;
	
	Если ТекДанные.Количество > ТекДанные.КоличествоВсего Тогда
		ТекДанные.Количество = ТекДанные.КоличествоВсего;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
