
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ПрочитатьРежимыЗаполненияДанных();
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ТекущаяДатаСеанса();
		Объект.СрокДействия = КонецДня(ТекущаяДатаСеанса());
		Объект.ДатаВыездаТС = ТекущаяДатаСеанса();
        Объект.ДатаВозвращенияТС = КонецДня(ТекущаяДатаСеанса());

		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Объект.НомерСмены = УчетГСМ.НомерСменыДляПутевогоЛиста(Объект.Ссылка, Объект.ТранспортноеСредство, Объект.Дата) + 1;
		КонецЕсли;	
		
		//заполнение показаний спидометра при выезде
		Если ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ ИЛИ ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ Тогда
			Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда 
				ЗаполнитьДанныеОПоказанияхСпидометра();
			КонецЕсли;	
			
			//очистка данных спидометра (одометра) при возвращении
			ОчиститьДанныеСпидометраПриВозвращении();
		КонецЕсли;
		
		//заполнение остатков горючего
		Если ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ ИЛИ ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ Тогда
			Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда 
				ЗаполнитьДанныеОбОстаткахГорючего();
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаполнитьДанныеМедосмотраДокумена();
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;	
	ЗаполнитьСписокВыбораВодителя();
	УстановитьСвойстваЭлементовНовыхРеквизитовФормы(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования.ВидПеревозки) Тогда
			Объект.ВидПеревозки = УчетГСМ.ДанныеСведенийОПеревозкеПоУмолчанию();
		КонецЕсли;
	КонецЕсли;	
	
	ПоказатьКоличествоВремени();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	СоздатьКнопкуДляАдреса(ЭтаФорма,"АдресПодачи",Элементы.ГруппаАдресПодачи);
	СоздатьКнопкуДляВидаПеревозки(ЭтаФорма,"ВидПеревозки",Элементы.ГруппаВидПеревозки);
	ПоказатьДанныеСпидометра();
	
	ЗаполнитьТекстПроТаксировку(); 
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 
	
	УстановитьВидимостьЭлементовМедосмотра();
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	СуммаОплатыИтого = Объект.РасчетЗаработнойПлатыЗаКилометраж + Объект.РасчетЗаработнойПлатыЗаЧасы;
	
	ПерерасчетРасходаЭкономииПерерасходаПоСтрокам();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПроверитьДатуМедЛицензий() Тогда
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Выбранная медицинская лицензия не действует на дату путевого листа.
								|Следует выбрать действующую лицензию или очистить значение реквизита.'"));
		Отказ = Истина;
	КонецЕсли;
   
	УстановитьСрокДействияПоУмолчанию();
	
	Для Каждого ТекСтрока Из Объект.МаршрутДвижения Цикл
		ТекСтрока.ВремяПростоя = УчетВремениКлиентСервер.ЧислоИзСтроки(ТекСтрока.ВремяПростояСтр);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_Таксировка"
			И Параметр.ДокументыОснования.Найти(Объект.Ссылка) <> Неопределено Тогда
		ЗаполнитьТекстПроТаксировку();
		ПоказатьДанныеСпидометра();
	
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыМаршруты(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыДвижениеГорючего(ЭтаФорма);
	ПоказатьКоличествоВремени();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПоказатьКоличествоВремени();
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ПерерасчетРасходаЭкономииПерерасходаПоСтрокам();

	ПроверитьДанныеПутевогоЛиста();
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		Объект.ТранспортноеСредство = ВыбранноеЗначение;
		ТранспортноеСредствоПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	СрокДействияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	
	ТранспортноеСредствоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура("Организация", Объект.Организация);
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца, РежимВыбора, ЗакрыватьПриВыборе, МножественныйВыбор, ТолькоАгрегаты, ТекущаяСтрока",
		Отбор, Истина, Истина, Истина, Ложь, Ложь, Объект.ТранспортноеСредство);
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаВыбораТранспортногоСредства", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьСрокДействияПоУмолчанию();
	УстановитьСвойстваЭлементовНовыхРеквизитовФормы(ЭтотОбъект);	
	ПриИзмененииДатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НадписьТаксировкаНажатие(Элемент, СтандартнаяОбработка)
	УчетГСМКлиент.ТаксировкаНажатие(ДокументТаксировка,ЭтаФорма,СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ВРаспоряжениеНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВРаспоряжениеНаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
		СписокСотрудников = ВыбранноеЗначение;
		СтрокаВРаспоряжениеНаименование = Объект.ВРаспоряжениеНаименование;
		Для н = 1 По ВыбранноеЗначение.Количество() Цикл
			СтрокаВРаспоряжениеНаименование = СтрокаВРаспоряжениеНаименование + ?(СокрЛП(СтрокаВРаспоряжениеНаименование) = "","",", ")+ КорреспондентыКлиентСервер.ФИО(Строка(ВыбранноеЗначение[н-1]), Ложь);
		КонецЦикла;	
		ВыбранноеЗначение = СтрокаВРаспоряжениеНаименование;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВРаспоряжениеОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВРаспоряжениеОрганизацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
		СтрокаКонтрагентов = Объект.ВРаспоряжениеОрганизация;
		Для н = 1 По ВыбранноеЗначение.Количество() Цикл
			СтруктураДанных = ПолучитьНаименованиеКонтрагента(ВыбранноеЗначение[н-1], Объект.Дата);
			СтрокаКонтрагентов = СтрокаКонтрагентов + ?(СокрЛП(СтрокаКонтрагентов) = "","",", ")+ ?(ЗначениеЗаполнено(СтруктураДанных.НаименованиеСокращенное),СтруктураДанных.НаименованиеСокращенное,СтруктураДанных.НаименованиеПолное);
		КонецЦикла;	
		ВыбранноеЗначение = СтрокаКонтрагентов;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗаработнойПлатыЗаКилометражПриИзменении(Элемент)
	СуммаОплатыИтого = Объект.РасчетЗаработнойПлатыЗаКилометраж + Объект.РасчетЗаработнойПлатыЗаЧасы;
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗаработнойПлатыЗаЧасыПриИзменении(Элемент)
	СуммаОплатыИтого = Объект.РасчетЗаработнойПлатыЗаКилометраж + Объект.РасчетЗаработнойПлатыЗаЧасы;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияСпидометраПриВозвращенииПриИзменении(Элемент)
	РассчитатьРезультатПробегРаботы();
КонецПроцедуры

&НаКлиенте
Процедура ВремяВозвращенияПриИзменении(Элемент)
	
	РассчитатьРезультатЧасыРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяВыездаПриИзменении(Элемент)
	
	РассчитатьРезультатЧасыРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозвращенияТСПриИзменении(Элемент)
	
	РассчитатьРезультатЧасыРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыездаТСПриИзменении(Элемент)
	
	РассчитатьРезультатЧасыРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатРаботыТСВсегоПробегПриИзменении(Элемент)
	Если Объект.РезультатРаботыТСВсегоПробег > 0 Тогда
		Объект.ПоказанияСпидометраПриВозвращении = Объект.ПоказанияСпидометраПриВыезде + Объект.РезультатРаботыТСВсегоПробег;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура ДокументПолученПриИзменении(Элемент)
	Если Объект.ДокументПолучен Тогда
		Объект.ДатаПолученияБухгалтером = ОбщегоНазначенияКлиент.ДатаСеанса();
		Объект.ДокументПринялБухгалтер = ПользователиКлиентСервер.ТекущийПользователь();
	Иначе
		Объект.ДатаПолученияБухгалтером = "";
		Объект.ДокументПринялБухгалтер = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПринимающийТСДиспетчерНарядчикПриИзменении(Элемент)
	Объект.ДатаПолученияДиспетчером = ОбщегоНазначенияКлиент.ДатаСеанса();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОВидахСообщенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВидыСообщенияПриПеревозке = Новый СписокЗначений;
	ВидыСообщенияПриПеревозке.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСообщения.Городское"));
	ВидыСообщенияПриПеревозке.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСообщения.Пригородное"));
	ВидыСообщенияПриПеревозке.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСообщения.Междугородное"));
	
	ОповещениеПослеВыбораВидаСообщения = Новый ОписаниеОповещения("ЗаполнитьРезультатВыбораВидовСообщения", ЭтотОбъект);

	ВидыСообщенияПриПеревозке.ПоказатьОтметкуЭлементов(ОповещениеПослеВыбораВидаСообщения, "Выберите виды сообщения");
КонецПроцедуры

&НаКлиенте
Процедура ПростойНеУчитываемыйВРезультатахРаботыТСПриИзменении(Элемент)
	РассчитатьРезультатЧасыРаботы();	
КонецПроцедуры

&НаКлиенте
Процедура СторонняяОрганизацияПроводитПредрейсовыйМедосмотрПриИзменении(Элемент)
	
	ИзменитьРеквизитыПредрейсовогоМедосмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура СторонняяОрганизацияПроводитПослерейсовыйМедосмотрПриИзменении(Элемент)
	
	ИзменитьРеквизитыПослерейсовогоМедосмотра();
	
КонецПроцедуры    

&НаКлиенте
Процедура ОрганизацияПроводящаяПредрейсовыйМедосмотрПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр)Тогда  
				
		ЛицензияОрганизации = ЛицензияМедОрганизации(Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр,Объект.Дата);  
		Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр = ЛицензияОрганизации; 
		
	КонецЕсли;
                                                                                    
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПроводящаяПослерейсовыйМедосмотрПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр) Тогда 
				
		ЛицензияОрганизации = ЛицензияМедОрганизации(Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр,Объект.СрокДействия);
		Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
             
КонецПроцедуры

&НаКлиенте
Процедура ЛицоДопускающееВодителяПоСостояниюЗдоровьяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Объект.Организация,Объект.Дата);
		Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровьяПриИзменении(Элемент)
		
	Если НЕ ЗначениеЗаполнено(Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Объект.Организация,Объект.СрокДействия);
		Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровьяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр,Объект.Дата);
		Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровьяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр,Объект.СрокДействия);
		Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборМедЛицензииОрганизации(Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр, "Контрагент", "Предрейсовый");
	
КонецПроцедуры     

&НаКлиенте
Процедура ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборМедЛицензииОрганизации(Объект.Организация, "Организация", "Предрейсовый");
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборМедЛицензииОрганизации(Объект.Организация, "Организация", "Послерейсовый");
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборМедЛицензииОрганизации(Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр, "Контрагент", "Послерейсовый");
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОбратныйМаршрут(Команда)
	ТекущаяСтрока = Элементы.МаршрутДвижения.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		НоваяСтрока = Объект.МаршрутДвижения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока, , 
			"Примечание, МаршрутДвижения");
		ДанныеМаршрута = ПолучитьДанныеМаршрутаДвижения(ТекущаяСтрока.МаршрутДвижения);
		НоваяСтрока.МаршрутДвижения = ДанныеМаршрута.ОбратныйМаршрутДвижения;
		
		Если ЗначениеЗаполнено(ДанныеМаршрута.ОбратныйМаршрутДвижения) Тогда
			ДанныеОбратногоМаршрута = ПолучитьДанныеМаршрутаДвижения(ДанныеМаршрута.ОбратныйМаршрутДвижения);
			ПротяженностьОбратногоМаршрута = ДанныеОбратногоМаршрута.Протяженность;
			Если ПротяженностьОбратногоМаршрута > 0 Тогда
				НоваяСтрока.ПройденоКилометров = ПротяженностьОбратногоМаршрута;	
			КонецЕсли;	
		Иначе
			НоваяСтрока.ПройденоКилометров = ТекущаяСтрока.ПройденоКилометров;
		КонецЕсли;
		
		НоваяСтрока.МестоОтправления = ТекущаяСтрока.МестоНазначения;
		НоваяСтрока.МестоНазначения = ТекущаяСтрока.МестоОтправления;
		НоваяСтрока.ВремяВыезда = ТекущаяСтрока.ВремяВозвращения;
		Если Значениезаполнено(ТекущаяСтрока.ВремяВозвращения) И Значениезаполнено(ТекущаяСтрока.ВремяВыезда) Тогда
			НоваяСтрока.ВремяВозвращения = ТекущаяСтрока.ВремяВозвращения + (ТекущаяСтрока.ВремяВозвращения - ТекущаяСтрока.ВремяВыезда);
		Иначе
			НоваяСтрока.ВремяВозвращения = "";
		КонецЕсли;	
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбран маршрут из списка! Операция не выполнена.'");
		Сообщение.Сообщить();
	КонецЕсли;
	
	МаршрутДвиженияРассчитатьПройденоКилометров();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПослерейсовыйМедосмотр(Команда)
	
	Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр 	= Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр;
	Объект.ЗаполнятьОтметкуОПослерейсовомМедосмотре				= Объект.ЗаполнятьОтметкуОПредрейсовомМедосмотре;
	
	Если Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр Тогда 
		
		Объект.СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья 	= Объект.СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья;
		Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр 						= Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр;
		Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр			 	= Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр;

	Иначе 
		
		Объект.ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья = Объект.ЛицоДопускающееВодителяПоСостояниюЗдоровья;
		Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр  = Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр;
				
	КонецЕсли;
	
	ИзменитьРеквизитыПослерейсовогоМедосмотра();
		
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМаршрутДвижения

&НаКлиенте
Процедура МаршрутДвиженияКодЗаказчикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутДвиженияКодЗаказчикаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
		СтруктураДанных = ПолучитьНаименованиеКонтрагента(ВыбранноеЗначение, Объект.Дата);
		ТекущиеДанные = Элементы.МаршрутДвижения.ТекущиеДанные;

		ВыбранноеЗначение = СтруктураДанных.Код;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МаршрутДвиженияКонтрагентПриИзменении(Элемент)
	ТекущиеДанные = Элементы.МаршрутДвижения.ТекущиеДанные;
	ТекущийКонтрагент = ТекущиеДанные.Контрагент;
	Если ЗначениеЗаполнено(ТекущийКонтрагент) Тогда
		СтруктураДанных = ПолучитьНаименованиеКонтрагента(ТекущийКонтрагент, Объект.Дата);

		ТекущиеДанные.КодЗаказчика = СтруктураДанных.Код;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МаршрутДвиженияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.МаршрутДвижения.ТекущиеДанные;
	ОбновитьТекстЗаголовковВСтрокеТаблицыМаршруты(ТекущиеДанные);
	МаршрутДвиженияРассчитатьПродолжительностьПростояТС();
	МаршрутДвиженияРассчитатьПройденоКилометров();
КонецПроцедуры

&НаКлиенте
Процедура МаршрутДвиженияПослеУдаления(Элемент)
	МаршрутДвиженияРассчитатьПродолжительностьПростояТС();
	МаршрутДвиженияРассчитатьПройденоКилометров();
КонецПроцедуры

&НаКлиенте
Процедура МаршрутДвиженияМаршрутДвиженияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.МаршрутДвижения.ТекущиеДанные;

	Если ЗначениеЗаполнено(ТекущиеДанные.МаршрутДвижения) Тогда
		СтруктураДанных = ПолучитьДанныеМаршрутаДвижения(ТекущиеДанные.МаршрутДвижения);
			
		ТекущиеДанные.МестоОтправления = СтруктураДанных.МестоОтправления;
		ТекущиеДанные.МестоНазначения = СтруктураДанных.МестоНазначения;
		
		ТекущиеДанные.ПройденоКилометров = СтруктураДанных.Протяженность;
	КонецЕсли;
	
	МаршрутДвиженияРассчитатьПродолжительностьПростояТС();
	МаршрутДвиженияРассчитатьПройденоКилометров();
КонецПроцедуры

&НаКлиенте
Процедура МаршрутДвиженияПройденоКилометровПриИзменении(Элемент)
	МаршрутДвиженияРассчитатьПройденоКилометров();
КонецПроцедуры

&НаКлиенте
Процедура МаршрутДвиженияВремяПростояСтрПриИзменении(Элемент)
	ТекущиеДанные = Элементы.МаршрутДвижения.ТекущиеДанные;

	Если Не УчетВремениКлиентСервер.ПроверитьФормат(ТекущиеДанные.ВремяПростояСтр) Тогда
		ТекущиеДанные.ВремяПростояСтр = "";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Продолжительность простоя не соответствует формату ЧЧ:мм для строки %1.'"), ТекущиеДанные.НомерСтроки);
		Сообщение.Сообщить();
	КонецЕсли;
	
	ТекущиеДанные.ВремяПростоя = УчетВремениКлиентСервер.ЧислоИзСтроки(ТекущиеДанные.ВремяПростояСтр);
	
	МаршрутДвиженияРассчитатьПродолжительностьПростояТС();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДвижениеГорючего

&НаКлиенте
Процедура ДвижениеГорючегоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ДвижениеГорючего.ТекущиеДанные;
	ОбновитьТекстЗаголовковВСтрокеТаблицыДвижениеГорючего(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеГорючегоВидГСМПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвижениеГорючего.ТекущиеДанные;
	СтруктураДанных = ПолучитьДанныеВидаГСМ(ТекущиеДанные.ВидГСМ);
	ТекущиеДанные.ЕдиницаИзмеренияГорючего = СтруктураДанных.ЕдиницаИзмерения;
	ТекущиеДанные.МаркаГорючего = СтруктураДанных.МаркаГорючего;
	ТекущиеДанные.КодМаркиГорючего = СтруктураДанных.КодМаркиГорючего;
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеГорючегоВыданоГорючееПриИзменении(Элемент)
	ПерерасчетРасходаГорючегоПоСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеГорючегоОстатокГорючегоПриВыездеПриИзменении(Элемент)
	ПерерасчетРасходаГорючегоПоСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеГорючегоОстатокГорючегоПриВозвращенииПриИзменении(Элемент)
	ПерерасчетРасходаГорючегоПоСтроке(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеГорючегоНормативныйРасходГорючегоПриИзменении(Элемент)
	ПерерасчетРасходаГорючегоПоСтроке(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеГорючегоФактическийРасходГорючегоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвижениеГорючего.ТекущиеДанные;
	ПерерасчетРасходаЭкономииПерерасходаПоСтроке(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаСервере
Процедура УстановитьНомераТС()
	Объект.РегистрационныйНомернойЗнак = УчетГСМ.ПолучитьГосударственныйНомернойЗнакТС(Объект.ТранспортноеСредство); 
	Объект.ГаражныйНомер = УчетГСМ.ПолучитьГаражныйНомерТС(Объект.ТранспортноеСредство);
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьСрокДействияПоУмолчанию()
	Если (КонецДня(Объект.Дата) > КонецДня(Объект.СрокДействия))ИЛИ(Объект.СрокДействия = Дата(1,1,1)) Тогда
		Объект.СрокДействия = КонецДня(Объект.Дата);
		Объект.ДатаВозвращенияТС = КонецДня(Объект.СрокДействия);
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ПрочитатьРежимыЗаполненияДанных()
	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект.Ссылка));
	СтруктураРежимовЗаполнения = УчетГСМ.РежимыНастроекЗаполненияДокумента(Объект.Организация, Перечисления.ВидыОбъектовРасходаГСМ.ТранспортныеСредства, ИдентификаторДокумента, Объект.ТранспортноеСредство);
	ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ = СтруктураРежимовЗаполнения.ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ;
	ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ = СтруктураРежимовЗаполнения.ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ;
	ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ = СтруктураРежимовЗаполнения.ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ;
	ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ = СтруктураРежимовЗаполнения.ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ;
	ЗаполнятьРеквизитВодительПринял = СтруктураРежимовЗаполнения.ЗаполнятьРеквизитВодительПринял;
	ЗаполнятьРеквизитВодительСдал = СтруктураРежимовЗаполнения.ЗаполнятьРеквизитВодительСдал;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиЗаполненияДокумента(ОсновноеСредство)
	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект.Ссылка));
	ТаблицаНастроек = УчетГСМ.ДанныеНастроекЗаполненияДокумента(Объект.Организация, Перечисления.ВидыОбъектовРасходаГСМ.ТранспортныеСредства, ИдентификаторДокумента, ОсновноеСредство);
	
	Для Каждого ТекСтрока Из ТаблицаНастроек Цикл
		ЗаполнятьРеквизитВодительПринял = ТекСтрока.ЗаполнятьРеквизитВодительПринял;
		ЗаполнятьРеквизитВодительСдал = ТекСтрока.ЗаполнятьРеквизитВодительСдал;
		ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ = ТекСтрока.ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ;
		ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ = ТекСтрока.ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ;
		ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ = ТекСтрока.ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ;
		ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ = ТекСтрока.ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ;
		
		Объект.Водитель = ТекСтрока.Водитель;
		
		Если ЗаполнятьРеквизитВодительПринял Тогда
			Объект.ВодительПринялТС = ТекСтрока.Водитель;
		КонецЕсли;
		
		Если ЗаполнятьРеквизитВодительСдал Тогда
			Объект.ВодительСдалТС = ТекСтрока.Водитель;
		КонецЕсли;
		
		Объект.АдресПодачи = ТекСтрока.АдресПодачи;
		Объект.ЛицензионнаяКарточка = ТекСтрока.ЛицензионнаяКарточка;
		Объект.ВРаспоряжениеНаименование = ТекСтрока.ВРаспоряжениеНаименование;
		Объект.ВРаспоряжениеОрганизация = ТекСтрока.ВРаспоряжениеОрганизация;
		
		Объект.ВыездРазрешилМеханик = ТекСтрока.МеханикПриВыезде;
		Объект.ПринялТСМеханик = ТекСтрока.МеханикПриВозвращении;
		Объект.ВыпускающийТСДиспетчерНарядчик = ТекСтрока.ДиспетчерПриВыезде;
		Объект.ПринимающийТСДиспетчерНарядчик = ТекСтрока.ДиспетчерПриВозвращении;
		Если НЕ ЗначениеЗаполнено(Объект.ВидПеревозки) Тогда
			Объект.ВидПеревозки = ТекСтрока.ВидПеревозки;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.СведенияОВидахСообщения) Тогда
			Объект.СведенияОВидахСообщения = ТекСтрока.СведенияОВидахСообщения;
			Если НЕ ЗначениеЗаполнено(ТекСтрока.СведенияОВидахСообщения) Тогда
				Объект.СведенияОВидахСообщения = СокрЛП(ТекСтрока.ВидСообщения);
			КонецЕсли;	
		КонецЕсли;
		
		Прервать;
	КонецЦикла;	
	
	НастройкиГорючего = УчетГСМ.ДанныеНастроекГорючегоТС(Объект.Организация, ОсновноеСредство);
	
	Для Каждого ТекСтрока Из НастройкиГорючего Цикл
		ПараметрыОтбора = Новый Структура("ВидГСМ");
		ПараметрыОтбора.Вставить("ВидГСМ", ТекСтрока.МаркаГорючего); 
		СтрокиНайденые = Объект.ДвижениеГорючего.НайтиСтроки(ПараметрыОтбора);
		Если СтрокиНайденые.Количество() = 0 Тогда
			НоваяСтрока = Объект.ДвижениеГорючего.Добавить();
			НоваяСтрока.ВидГСМ = ТекСтрока.МаркаГорючего;
			Если ЗначениеЗаполнено(ТекСтрока.МаркаГорючего) Тогда
				НоваяСтрока.МаркаГорючего = ТекСтрока.МаркаГорючего.МаркаГорючего;
				НоваяСтрока.КодМаркиГорючего = ТекСтрока.МаркаГорючего.КодМаркиГорючего;
				НоваяСтрока.ЕдиницаИзмеренияГорючего = ТекСтрока.МаркаГорючего.ЕдиницаИзмерения;
			КонецЕсли;
		Иначе
			Для Каждого ТекСтрокаНайденная Из СтрокиНайденые Цикл
				ТекСтрокаНайденная.ВидГСМ = ТекСтрока.МаркаГорючего;
				ТекСтрокаНайденная.МаркаГорючего = ТекСтрока.МаркаГорючего.МаркаГорючего;
				ТекСтрокаНайденная.КодМаркиГорючего = ТекСтрока.МаркаГорючего.КодМаркиГорючего;
				ТекСтрокаНайденная.ЕдиницаИзмеренияГорючего = ТекСтрока.МаркаГорючего.ЕдиницаИзмерения;
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;
	ОбновитьТекстЗаголовковВсехСтрокТаблицыДвижениеГорючего(ЭтаФорма);
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТекстПроТаксировку()
	УчетГСМ.ЗаполнитьТекстПроТаксировку(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	ВодительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВодительПриИзмененииНаСервере()
	Если ЗаполнятьРеквизитВодительПринял Тогда
		Объект.ВодительПринялТС = Объект.Водитель;
	КонецЕсли;
		
	Если ЗаполнятьРеквизитВодительСдал Тогда
		Объект.ВодительСдалТС = Объект.Водитель;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНажатияКнопкиЗаполненияАдреса(КомандаФормы)
	
	Элемент = ЭтаФорма.Элементы.Найти(КомандаФормы.Имя);
	СписокАдресов = СписокЧастоПосещаемыхАдресовТС(Объект.Организация, Объект.ТранспортноеСредство);
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораАдреса", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ЭтаФорма.ПоказатьВыборИзМеню(Оповещение, СписокАдресов, Элемент);
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьПослеВыбораАдреса(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизита = Сред(ДополнительныеПараметры.Элемент.Имя,10);
	Объект[ИмяРеквизита] = УчетГСМКлиент.ПодготовитьСтрокуАдреса(ВыбранныйЭлемент); 
	
КонецПроцедуры	

&НаКлиенте
Процедура МаршрутДвиженияМестоОтправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СписокАдресов = СписокЧастоПосещаемыхАдресовТС(Объект.Организация, Объект.ТранспортноеСредство);
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораАдресаМестаОтправления", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ЭтаФорма.ПоказатьВыборИзМеню(Оповещение, СписокАдресов, Элементы.МаршрутДвижения);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораАдресаМестаОтправления(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.МаршрутДвижения.ТекущиеДанные.МестоОтправления = УчетГСМКлиент.ПодготовитьСтрокуАдреса(ВыбранныйЭлемент);
	
КонецПроцедуры	

&НаКлиенте
Процедура МаршрутДвиженияМестоНазначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СписокАдресов = СписокЧастоПосещаемыхАдресовТС(Объект.Организация, Объект.ТранспортноеСредство);
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораАдресаМестаНазначения", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ЭтаФорма.ПоказатьВыборИзМеню(Оповещение, СписокАдресов, Элементы.МаршрутДвижения);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораАдресаМестаНазначения(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.МаршрутДвижения.ТекущиеДанные.МестоНазначения = УчетГСМКлиент.ПодготовитьСтрокуАдреса(ВыбранныйЭлемент);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасчетныеПоказанияСпидометраПриВыезде()
	ДанныеСпидометра = УчетГСМ.ПоказанияСпидометраРасчетные(Объект.Ссылка, Истина);
	
	Возврат ДанныеСпидометра.ПриВыезде;
КонецФункции	

&НаСервере
Функция ПолучитьРасчетныеПоказанияСпидометраПриВозвращении() 
	ДанныеСпидометра = УчетГСМ.ПоказанияСпидометраРасчетные(Объект.Ссылка, Истина);
	
	Возврат ДанныеСпидометра.ПриВозвращении;
КонецФункции	

&НаСервере
Процедура ПоказатьДанныеСпидометра()
	Элементы.ПоказанияСпидометраПриВыездеРасчетные.Заголовок = НСтр("ru='по таксировке: '") + ПолучитьРасчетныеПоказанияСпидометраПриВыезде() + НСтр("ru=' км'");
	Элементы.ПоказанияСпидометраПриВозвращенииРасчетные.Заголовок = НСтр("ru='по таксировке: '") + ПолучитьРасчетныеПоказанияСпидометраПриВозвращении()+ НСтр("ru=' км'");
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДанныеТаксировкиОГорючемПриВозвращении(ПутевойЛистТС)
	
	ДанныеГорючего = УчетГСМ.ДвиженияГорючегоРасчетные(ПутевойЛистТС);
	
	Для каждого ТекСтрока Из ДанныеГорючего Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ВидГСМ) Тогда
			Если ТекСтрока.ВидГСМ.ТипГСМ = Перечисления.ТипыГСМ.Горючее Тогда
				ПараметрыОтбора = Новый Структура("ВидГСМ");
				ПараметрыОтбора.Вставить("ВидГСМ", ТекСтрока.ВидГСМ); 
				СтрокиНайденые = Объект.ДвижениеГорючего.НайтиСтроки(ПараметрыОтбора);
				Если СтрокиНайденые.Количество() = 0 Тогда
					НоваяСтрока = Объект.ДвижениеГорючего.Добавить();
					НоваяСтрока.ВидГСМ = ТекСтрока.ВидГСМ;
					НоваяСтрока.МаркаГорючего = ТекСтрока.ВидГСМ.МаркаГорючего;
					НоваяСтрока.КодМаркиГорючего = ТекСтрока.ВидГСМ.КодМаркиГорючего;
					НоваяСтрока.ЕдиницаИзмеренияГорючего = ТекСтрока.ВидГСМ.ЕдиницаИзмерения;
					НоваяСтрока.ОстатокГорючегоПриВыезде = ТекСтрока.ОстатокГорючегоПриВозвращении;
				Иначе
					Для Каждого ТекСтрокаНайденная Из СтрокиНайденые Цикл
						ТекСтрокаНайденная.ВидГСМ = ТекСтрока.ВидГСМ;
						ТекСтрокаНайденная.МаркаГорючего = ТекСтрока.ВидГСМ.МаркаГорючего;
						ТекСтрокаНайденная.КодМаркиГорючего = ТекСтрока.ВидГСМ.КодМаркиГорючего;
						ТекСтрокаНайденная.ЕдиницаИзмеренияГорючего = ТекСтрока.ВидГСМ.ЕдиницаИзмерения;
						ТекСтрокаНайденная.ОстатокГорючегоПриВыезде = ТекСтрока.ОстатокГорючегоПриВозвращении;
					КонецЦикла;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкуДляАдреса(Форма, ИмяРеквизита, ГруппаРеквизита)
	
	ИмяКоманды = "Заполнить" + ИмяРеквизита;  
	Команда = Форма.Команды.Добавить(ИмяКоманды);
	Команда.Отображение = ОтображениеКнопки.Картинка;
	Команда.Действие = "ОбработкаНажатияКнопкиЗаполненияАдреса";
	
	Элемент = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаРеквизита);
	Элемент.ИмяКоманды = ИмяКоманды;
	
	Элемент.Заголовок = НСтр("ru = 'Заполнить'");
	Команда.Подсказка = НСтр("ru = 'Заполнить адрес'");
	Команда.Картинка = БиблиотекаКартинок.ПереместитьВлево;
	Команда.ИзменяетСохраняемыеДанные = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОПоказанияхСпидометра()
	
	ПредыдущийПутевойЛист = УчетГСМ.НайтиПредыдущийПутевойЛист(Объект.Ссылка, Объект.ТранспортноеСредство, Объект.Дата);
				
	ДанныеСпидометра = УчетГСМ.ПоказанияСпидометраПоПутевомуЛисту(ПредыдущийПутевойЛист);
	
	Если ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ Тогда
		ДанныеСпидометра = УчетГСМ.ПоказанияСпидометраРасчетные(ПредыдущийПутевойЛист);
		Объект.ПоказанияСпидометраПриВыезде = ДанныеСпидометра;
	ИначеЕсли ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ Тогда
		Объект.ПоказанияСпидометраПриВыезде = ДанныеСпидометра;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДанныеОбОстаткахГорючего()
	
	Если НЕ ЗначениеЗаполнено(ПредыдущийПутевойЛист) Тогда
		ПредыдущийПутевойЛист = УчетГСМ.НайтиПредыдущийПутевойЛист(Объект.Ссылка, Объект.ТранспортноеСредство, Объект.Дата);
	КонецЕсли;
				
	ДанныеГорючего = УчетГСМ.ОстаткиГорючегоПоПутевомуЛисту(ПредыдущийПутевойЛист);
	
	Если ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ Тогда
		ЗаполнитьДанныеТаксировкиОГорючемПриВозвращении(ПредыдущийПутевойЛист);
	ИначеЕсли ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ Тогда
		Объект.ДвижениеГорючего.Очистить();
		Для Каждого ТекСтрока Из ДанныеГорючего Цикл
			НоваяСтрока = Объект.ДвижениеГорючего.Добавить();
			
			НоваяСтрока.ВидГСМ = ТекСтрока.ВидГСМ;
			Если ЗначениеЗаполнено(ТекСтрока.ЕдиницаИзмерения) Тогда
				НоваяСтрока.ЕдиницаИзмеренияГорючего = ТекСтрока.ЕдиницаИзмерения;
			Иначе	
				Если ЗначениеЗаполнено(ТекСтрока.ВидГСМ) Тогда
					НоваяСтрока.ЕдиницаИзмеренияГорючего = ТекСтрока.ВидГСМ.ЕдиницаИзмерения;
				КонецЕсли;
			КонецЕсли;	
			НоваяСтрока.МаркаГорючего = ТекСтрока.МаркаГСМ;
			НоваяСтрока.КодМаркиГорючего = ТекСтрока.КодМаркиГСМ;
			НоваяСтрока.ОстатокГорючегоПриВыезде = ТекСтрока.ОстатокГСМ;
		КонецЦикла;	
		ОбновитьТекстЗаголовковВсехСтрокТаблицыДвижениеГорючего(ЭтаФорма);
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыМаршруты(Форма)

	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.МаршрутДвижения Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыМаршруты(ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыМаршруты(ТекущаяСтрока)

	ТекущаяСтрока.КонтрагентЗаголовок = НСтр("ru = 'контрагент:'");
	ТекущаяСтрока.КодЗаказчикаЗаголовок = НСтр("ru = 'код:'");
	ТекущаяСтрока.МестоОтправленияЗаголовок = НСтр("ru = 'отправление:'");
	ТекущаяСтрока.МестоНазначенияЗаголовок = НСтр("ru = 'назначение:'");
	ТекущаяСтрока.ВремяВыездаЗаголовок = НСтр("ru = 'выезд:'");
	ТекущаяСтрока.ВремяВозвращенияЗаголовок = НСтр("ru = 'возвращение:'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыДвижениеГорючего(Форма)

	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.ДвижениеГорючего Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыДвижениеГорючего(ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыДвижениеГорючего(ТекущаяСтрока)

	ТекущаяСтрока.ВидГСМЗаголовок = НСтр("ru = 'вид ГСМ:'");
	ТекущаяСтрока.ЕдИзмЗаголовок = НСтр("ru = 'ед.изм.:'");
	ТекущаяСтрока.МаркаГорючегоЗаголовок = НСтр("ru = 'марка:'");
	ТекущаяСтрока.КодМаркиГорючегоЗаголовок = НСтр("ru = 'код марки:'");
	ТекущаяСтрока.ВыданоЗаголовок = НСтр("ru = 'количество:'");
	ТекущаяСтрока.НомерЗаправочногоЛистаЗаголовок = НСтр("ru = '№ зап.листа:'");
	ТекущаяСтрока.ОстатокПриВыездеЗаголовок = НСтр("ru = 'при выезде:'");
	ТекущаяСтрока.ОстатокПриВозвращенииЗаголовок = НСтр("ru = 'при возвращении:'");
	ТекущаяСтрока.НормативныйРасходЗаголовок = НСтр("ru = 'нормативный:'");
	ТекущаяСтрока.ФактическийРасходЗаголовок = НСтр("ru = 'фактический:'");
	ТекущаяСтрока.ЭкономияЗаголовок = НСтр("ru = 'экономия:'");
	ТекущаяСтрока.ПерерасходЗаголовок = НСтр("ru = 'перерасход:'");
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыМаршруты(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыДвижениеГорючего(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеСпидометраПриВозвращении()
	
	Объект.ПоказанияСпидометраПриВозвращении = 0;
	
КонецПроцедуры	

&НаСервере
Процедура ТранспортноеСредствоПриИзмененииНаСервере()
	
	УстановитьНомераТС();
	ЗаполнитьНастройкиЗаполненияДокумента(Объект.ТранспортноеСредство);
	Объект.НомерСмены = УчетГСМ.НомерСменыДляПутевогоЛиста(Объект.Ссылка, Объект.ТранспортноеСредство, Объект.Дата) + 1;
		
	//заполнение показаний спидометра при выезде
	Если ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ ИЛИ ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ Тогда
		Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда 
			ЗаполнитьДанныеОПоказанияхСпидометра();
		КонецЕсли;	
	КонецЕсли;
	
	//заполнение остатков горючего
	Если ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ ИЛИ ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ Тогда
		Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда 
			ЗаполнитьДанныеОбОстаткахГорючего();
		КонецЕсли;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Объект.ВидПеревозки) Тогда
		Объект.ВидПеревозки = УчетГСМ.ДанныеСведенийОПеревозкеПоУмолчанию();
	КонецЕсли;
	
	ЗаполнитьСписокВыбораВодителя();
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыДвижениеГорючего(ЭтаФорма);
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьДанныеВидаГСМ(ВидГСМ)
	Возврат УчетГСМ.ПолучитьДанныеВидаГСМ(ВидГСМ);
КонецФункции

&НаСервере
Функция ПолучитьНаименованиеКонтрагента(Заказчик, НаДату)
	Возврат УчетГСМ.ПолучитьНаименованиеКонтрагента(Заказчик, НаДату);
КонецФункции
	
&НаСервере
Функция СписокЧастоПосещаемыхАдресовТС(Организация, ТС)
	Возврат УчетГСМ.СписокЧастоПосещаемыхАдресовТС(Организация, ТС);
КонецФункции

&НаКлиенте
Процедура ПерерасчетРасходаГорючегоПоСтроке(РасчетФактическогоРасхода = Ложь)
	ТекущиеДанные = Элементы.ДвижениеГорючего.ТекущиеДанные;
	
	Если РасчетФактическогоРасхода Тогда
		ФактическийРасход = ТекущиеДанные.ОстатокГорючегоПриВыезде + ТекущиеДанные.ВыданоГорючее - ТекущиеДанные.ОстатокГорючегоПриВозвращении;
		Если ФактическийРасход < 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Фактический расход горючего меньше нуля. Возможно в исходных данных о расходе горючего ошибка.'");
			Сообщение.Сообщить();
			
			Возврат;
		КонецЕсли;	
		ТекущиеДанные.ФактическийРасходГорючего = ФактическийРасход;
		
		ПерерасчетРасходаЭкономииПерерасходаПоСтроке(ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ПерерасчетРасходаЭкономииПерерасходаПоСтрокам()
	Для Каждого ТекСтрока Из Объект.ДвижениеГорючего Цикл
		ПерерасчетРасходаЭкономииПерерасходаПоСтроке(ТекСтрока);
	КонецЦикла;	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ПерерасчетРасходаЭкономииПерерасходаПоСтроке(ТекущиеДанныеСтроки)
	Если ТекущиеДанныеСтроки.НормативныйРасходГорючего <> 0 Тогда
		ЭкономияПерерасход = ТекущиеДанныеСтроки.НормативныйРасходГорючего - ТекущиеДанныеСтроки.ФактическийРасходГорючего;
		
		Если ЭкономияПерерасход < 0 Тогда
			ТекущиеДанныеСтроки.Перерасход = (-1)*ЭкономияПерерасход;
			ТекущиеДанныеСтроки.Экономия = 0;
		Иначе
			ТекущиеДанныеСтроки.Экономия = ЭкономияПерерасход;
			ТекущиеДанныеСтроки.Перерасход = 0;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДатыНаСервере()
	
	Объект.НомерСмены = УчетГСМ.НомерСменыДляПутевогоЛиста(Объект.Ссылка, Объект.ТранспортноеСредство, Объект.Дата) + 1;
	
	Объект.ДатаВыездаТС = Объект.Дата;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВодителя()
	Если НЕ ЗначениеЗаполнено(Объект.ТранспортноеСредство)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли;	
	ТаблицаВодителей = УчетГСМ.ДанныеНастроекВодителиТС(Объект.Организация, Объект.ТранспортноеСредство);
	Элементы.Водитель.СписокВыбора.Очистить();
	Для каждого ТекСтрока Из ТаблицаВодителей Цикл
		Элементы.Водитель.СписокВыбора.Добавить(ТекСтрока.Водитель);
	КонецЦикла;
КонецПроцедуры		

&НаСервере
Процедура СрокДействияПриИзмененииНаСервере()
	Объект.ДатаВозвращенияТС = КонецДня(Объект.СрокДействия);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеМаршрутаДвижения(МаршрутДвижения)
	Результат = Новый Структура;
	
	Результат = УчетГСМ.ПолучитьДанныеМаршрутаДвижения(МаршрутДвижения);	
	
	Возврат Результат;
КонецФункции

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура МаршрутДвиженияРассчитатьПройденоКилометров()
	Объект.РезультатРаботыТСВсегоПробег = Объект.МаршрутДвижения.Итог("ПройденоКилометров");
	Если Объект.РезультатРаботыТСВсегоПробег >= 0 Тогда
		Объект.ПоказанияСпидометраПриВозвращении = Объект.ПоказанияСпидометраПриВыезде + Объект.РезультатРаботыТСВсегоПробег;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МаршрутДвиженияРассчитатьПродолжительностьПростояТС()
	ВсегоПростойТС = 0;
	Для Каждого ТекСтрока Из Объект.МаршрутДвижения Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ВремяПростоя) Тогда
			ПростойЧасов = ТекСтрока.ВремяПростоя / 3600;
			
			ВсегоПростойТС = ВсегоПростойТС + ПростойЧасов;
		КонецЕсли;
	КонецЦикла;	
	Объект.ПростойВсегоНеУчитываемыйВРезультатахРаботыТС = ВсегоПростойТС;
	РассчитатьРезультатЧасыРаботы();
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьРезультатЧасыРаботы()
	
	Если ЗначениеЗаполнено(Объект.ДатаВозвращенияТС)
		И ЗначениеЗаполнено(Объект.ДатаВыездаТС)
		И ЗначениеЗаполнено(Объект.ВремяВозвращенияТС)
		И ЗначениеЗаполнено(Объект.ВремяВыездаТС) Тогда
		
		НачалоПериодаДатаСтр = Формат(Объект.ДатаВыездаТС, "ДФ=""ггггММдд""");
		НачалоПериодаВремяСтр = Формат(Объект.ВремяВыездаТС, "ДФ=""ЧЧммсс""");
		НачалоПериода = Дата(НачалоПериодаДатаСтр + НачалоПериодаВремяСтр);
		
		КонецПериодаДатаСтр = Формат(Объект.ДатаВозвращенияТС, "ДФ=""ггггММдд""");
		КонецПериодаВремяСтр = Формат(Объект.ВремяВозвращенияТС, "ДФ=""ЧЧммсс""");
		КонецПериода = Дата(КонецПериодаДатаСтр + КонецПериодаВремяСтр);
		
		РазностьДат = КонецПериода - НачалоПериода;
		РазностьДатЧасов = РазностьДат / 3600 - Объект.ПростойВсегоНеУчитываемыйВРезультатахРаботыТС;
		
		Объект.РезультатРаботыТСВсегоВремя = Окр(РазностьДатЧасов, 2, РежимОкругления.Окр15как10);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура РассчитатьРезультатПробегРаботы()
	Объект.РезультатРаботыТСВсегоПробег = Объект.ПоказанияСпидометраПриВозвращении - Объект.ПоказанияСпидометраПриВыезде;
	Если Объект.РезультатРаботыТСВсегоПробег < 0 Тогда
		Объект.РезультатРаботыТСВсегоПробег = 0;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверитьДанныеПутевогоЛиста()
	Если НачалоДня(Объект.Дата) >= Дата(2021,1,1) Тогда
		Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
			МодельТС = МодельТС();
			Если НЕ ЗначениеЗаполнено(МодельТС) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru='Не заполнена модель транспортного средства в сведениях паспорта. 
					|Чтобы заполненить эти сведения для соответствующего элемента справочника ""Основные средства"" (реквизит ""Транспортное средство"")
					|следует перейти по ссылке для реквизита ""Паспорт транспортного средства"" на закладке ""Инвентарный объект"".'");
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция МодельТС()
	Возврат УчетГСМ.ПолучитьМодельТС(Объект.ТранспортноеСредство);
КонецФункции	

&НаСервере
Процедура ПоказатьКоличествоВремени()
	Для Каждого ТекСтрока Из Объект.МаршрутДвижения Цикл
		ТекСтрока.ВремяПростояСтр = УчетВремениКлиентСервер.ЧислоВСтроку(ТекСтрока.ВремяПростоя);
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовНовыхРеквизитовФормы(Форма)
	Объект = Форма.Объект;

	Если Объект.Дата < Дата('2023.03.01') Тогда
		ВидимостьРеквизитов2023 = Ложь;
	Иначе
		ВидимостьРеквизитов2023 = Истина;
	КонецЕсли;	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СведенияОПеревозке", "Видимость", НЕ ВидимостьРеквизитов2023);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаВидПеревозки", "Видимость", ВидимостьРеквизитов2023);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СведенияОВидахСообщения", "Видимость", ВидимостьРеквизитов2023);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ВидСообщения", "Видимость", ВидимостьРеквизитов2023);
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкуДляВидаПеревозки(Форма, ИмяРеквизита, ГруппаРеквизита)
	
	ИмяКоманды = "Заполнить" + ИмяРеквизита;  
	Команда = Форма.Команды.Добавить(ИмяКоманды);
	Команда.Отображение = ОтображениеКнопки.Картинка;
	Команда.Действие = "ОбработкаНажатияКнопкиЗаполненияВидаПеревозки";
	
	Элемент = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаРеквизита);
	Элемент.ИмяКоманды = ИмяКоманды;
	
	Элемент.Заголовок = НСтр("ru = 'Заполнить'");
	Команда.Подсказка = НСтр("ru = 'Заполнить вид перевозки'");
	Команда.Картинка = БиблиотекаКартинок.ПереместитьВлево;
	Команда.ИзменяетСохраняемыеДанные = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНажатияКнопкиЗаполненияВидаПеревозки(КомандаФормы)
	
	Элемент = ЭтаФорма.Элементы.Найти(КомандаФормы.Имя);
	СписокВидыПеревоок = УчетГСМКлиент.СписокВидыПеревозок();
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораВидаПеревозки", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ЭтаФорма.ПоказатьВыборИзМеню(Оповещение, СписокВидыПеревоок, Элемент);
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьПослеВыбораВидаПеревозки(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизита = Сред(ДополнительныеПараметры.Элемент.Имя,10);
	Объект[ИмяРеквизита] = ВыбранныйЭлемент; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРезультатВыбораВидовСообщения(Элементы, Параметры) Экспорт
	Результат = "";
	ПероеЗначение = Истина;
	Если НЕ Элементы = Неопределено Тогда
		Для Каждого ВыбранныйВидСообщения Из Элементы Цикл
			Если ВыбранныйВидСообщения.Пометка Тогда
				Если ПероеЗначение Тогда
					НовыйРезультат = СтрШаблон("%1", СокрЛП(ВыбранныйВидСообщения.Значение));
					
					ПероеЗначение = Ложь;
				Иначе	
					НовыйРезультат = СтрШаблон("%1, %2", Результат, СокрЛП(ВыбранныйВидСообщения.Значение));
				КонецЕсли;
				Результат = НовыйРезультат;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.СведенияОВидахСообщения = Результат;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимостьЭлементовМедосмотра()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОрганизацияПроводящаяПредрейсовыйМедосмотр", "Видимость", Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья", "Видимость", Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицоДопускающееВодителяПоСостояниюЗдоровья", "Видимость", НЕ Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр", "Видимость", Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр", "Видимость", НЕ Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОрганизацияПроводящаяПослерейсовыйМедосмотр", "Видимость", Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр); 
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья", "Видимость", Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр); 
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья", "Видимость", НЕ Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр", "Видимость", Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр", "Видимость", НЕ Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр);	
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРеквизитыПредрейсовогоМедосмотра()
	
	Если Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр Тогда
		
		Объект.ЛицоДопускающееВодителяПоСостояниюЗдоровья 			= Неопределено;
		Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр 	= Неопределено;
		
	Иначе

		Объект.СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья 	= Неопределено;
		Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр 			= Неопределено;
		Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр 	= Неопределено;
		
	КонецЕсли; 
	
	УстановитьВидимостьЭлементовМедосмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРеквизитыПослерейсовогоМедосмотра()
	
	Если Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр Тогда
		
		Объект.ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья = Неопределено; 
		Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр 	= Неопределено;
		
	Иначе

		Объект.СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья 	= Неопределено; 
		Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр 						= Неопределено; 
		Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр				= Неопределено;
						
	КонецЕсли;  
	
	УстановитьВидимостьЭлементовМедосмотра();
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ЛицензияМедОрганизации(Организация, ДатаДокумента)
	
	МетаданныеОрганизации = Метаданные.НайтиПоТипу(ТипЗнч(Организация));
	
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛицензииНаПроведениеМедосмотров.Ссылка КАК Ссылка
	               |ИЗ
	               |	&Справочник КАК ЛицензииНаПроведениеМедосмотров
	               |ГДЕ
	               |	ЛицензииНаПроведениеМедосмотров.Владелец = &Владелец
				   |	И ЛицензииНаПроведениеМедосмотров.ДатаНачала <= &ДатаДокумента
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛицензииНаПроведениеМедосмотров.ДатаНачала УБЫВ"; 
	
	Если МетаданныеОрганизации.Имя = "Организации" Тогда
		
		СправочникЛицензий = "Справочник.ЛицензииНаПроведениеМедосмотровОрганизаций";
		
	ИначеЕсли МетаданныеОрганизации.Имя = "Контрагенты" Тогда
		
		СправочникЛицензий = "Справочник.ЛицензииНаПроведениеМедосмотровКонтрагентов";	

	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(Текст,"&Справочник", СправочникЛицензий);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса; 
	Запрос.УстановитьПараметр("Владелец", Организация);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из Результат Цикл 
		Возврат ТекСтрока.Ссылка;
	КонецЦикла;

КонецФункции  

&НаСервере
Функция ПроверитьДатуМедЛицензий()
	
	Если Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр Тогда
		ОбъектПредрейсовойЛицензии = Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр;
	Иначе
		ОбъектПредрейсовойЛицензии 	= Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр;
	КонецЕсли;
	
	Если Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр Тогда
		ОбъектПослерейсовойЛицензии = Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр;
	Иначе
		ОбъектПослерейсовойЛицензии = Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр;
	КонецЕсли;
	
	ЛицензияНедействительна = Ложь;
	
	Если ЗначениеЗаполнено(ОбъектПредрейсовойЛицензии) Тогда
		
		Если НачалоДня(ОбъектПредрейсовойЛицензии.ДатаНачала) > Объект.Дата Тогда
		 	ЛицензияНедействительна = Истина;
		ИначеЕсли КонецДня(ОбъектПредрейсовойЛицензии.ДатаОкончания) < Объект.Дата И НЕ ОбъектПредрейсовойЛицензии.ДатаОкончания = Дата(1,1,1) Тогда 
			ЛицензияНедействительна = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектПослерейсовойЛицензии) Тогда
		
		Если НачалоДня(ОбъектПослерейсовойЛицензии.ДатаНачала) > Объект.СрокДействия Тогда
		 	ЛицензияНедействительна = Истина;
		ИначеЕсли КонецДня(ОбъектПослерейсовойЛицензии.ДатаОкончания) < Объект.СрокДействия И НЕ ОбъектПослерейсовойЛицензии.ДатаОкончания = Дата(1,1,1) Тогда 
			ЛицензияНедействительна = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЛицензияНедействительна;

КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеМедосмотраДокумена()
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли; 
	
	ТаблицаНастроекМедосмотра = УчетГСМ.ДанныеНастроекЗаполненияМедосмотраДокумента(Объект.Организация);
	
	Для Каждого ТекСтрока Из ТаблицаНастроекМедосмотра Цикл
		
		Объект.ЛицоДопускающееВодителяПоСостояниюЗдоровья 						= ТекСтрока.ЛицоДопускающееВодителяПоСостояниюЗдоровья;
		Объект.ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья 			= ТекСтрока.ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья;
		Объект.ЗаполнятьОтметкуОПослерейсовомМедосмотре 						= ТекСтрока.ЗаполнятьОтметкуОПослерейсовомМедосмотре;
		Объект.ЗаполнятьОтметкуОПредрейсовомМедосмотре 							= ТекСтрока.ЗаполнятьОтметкуОПредрейсовомМедосмотре;
		Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр 						= ТекСтрока.ОрганизацияПроводящаяПослерейсовыйМедосмотр;
		Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр 						= ТекСтрока.ОрганизацияПроводящаяПредрейсовыйМедосмотр;
		Объект.СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья 				= ТекСтрока.СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья;
		Объект.СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья 	= ТекСтрока.СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья;
		Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр 				= ТекСтрока.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр;
		Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр 				= ТекСтрока.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр;  
		Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр 				= ТекСтрока.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр;
		Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр 				= ТекСтрока.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр;
	    Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр				= ТекСтрока.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр;
		Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр				= ТекСтрока.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборМедЛицензииОрганизации(ПроводящаяОрганизация, ТипОрганизации, ТипМедосмотра)
 
	ДополнительныеПараметры = Новый Структура("ТипОрганизации, ТипМедосмотра", ТипОрганизации, ТипМедосмотра);
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьМедицинскуюЛицензиюПослеВыбора",ЭтотОбъект, ДополнительныеПараметры);
	
	СтруктураОтбора = Новый Структура; 
	СтруктураОтбора.Вставить("Владелец", ПроводящаяОрганизация);
	
	Если ТипМедосмотра = "Предрейсовый" Тогда
		ДатаДокумента = Объект.Дата;	
	ИначеЕсли  ТипМедосмотра = "Послерейсовый" Тогда
		ДатаДокумента = Объект.СрокДействия; 
	Иначе
		Возврат;
	КонецЕсли;  
		
	ДополнительныеПараметры.Вставить("ДатаДокумента", ДатаДокумента);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	ПараметрыФормы.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Если ТипОрганизации = "Контрагент" Тогда
		НаименованиеСправочникаЛицензий = "ЛицензииНаПроведениеМедосмотровКонтрагентов";	
	ИначеЕсли ТипОрганизации = "Организация" Тогда
		НаименованиеСправочникаЛицензий = "ЛицензииНаПроведениеМедосмотровОрганизаций";
	Иначе
		Возврат;
	КонецЕсли;

	ОткрытьФорму(
	"Справочник." + НаименованиеСправочникаЛицензий + ".ФормаВыбора", ПараметрыФормы,
	,,,,Оповещение,
	);
 
 КонецПроцедуры
 
&НаКлиенте
Процедура ЗаполнитьМедицинскуюЛицензиюПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТипОрганизации = "Контрагент" И ДополнительныеПараметры.ТипМедосмотра = "Предрейсовый" Тогда
		
		  Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр = Результат;
		
	ИначеЕсли ДополнительныеПараметры.ТипОрганизации = "Контрагент" И ДополнительныеПараметры.ТипМедосмотра = "Послерейсовый" Тогда
		
		  Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр = Результат;
		
	ИначеЕсли ДополнительныеПараметры.ТипОрганизации = "Организация" И ДополнительныеПараметры.ТипМедосмотра = "Предрейсовый" Тогда

		  Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр = Результат;
		
	ИначеЕсли ДополнительныеПараметры.ТипОрганизации = "Организация" И ДополнительныеПараметры.ТипМедосмотра = "Послерейсовый" Тогда

		  Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр = Результат;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры 

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти  

