// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Перем ПроверкаКонтрагентовПараметрыОбработчикаОжидания Экспорт;
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереДокумент(ЭтотОбъект, Параметры);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	
	// МаркировкаПродукции
	ИспользуетсявМаркировкаОбъемноСортовогоУчета = ЭлектронныеДокументыБГУ.ИспользованиеОбъемноСортовойУчетМаркированныхТоваров(Объект.Организация);
	
	ЭлектронныеДокументыБГУ.ИнициализироватьФормуМаркировкаУпаковки(
		ЭтаФорма,
		"СоставНФА",
		"СоставНФАЕдиницаИзмерения",
		"СтраницаМаркируемыеУпаковки");
	ЭлектронныеДокументыБГУ.ЗаполнитьРеквизитыМаркировки(Объект, "СоставНФА");
	ЭлектронныеДокументыБГУ.ДобавитьУсловноеОформление_КолонкаМаркируемыйТовар(ЭтаФорма, "СоставНФА", ИспользуетсявМаркировкаОбъемноСортовогоУчета);
	// Конец МаркировкаПродукции
	
	УстановитьВидимостьЭлементовЭДО(ЭтаФорма);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 
	
	ИнициализироватьФормуСервер();
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДоступностьДатыВыставления();
	ДоступностьКорректируемогоПериода();
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами"
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	//---
	// Документы остатков НДС
	//---
	ДокументыОстатковНДС_НастроитьФормуСервер();
	
	Если Не ЭтотОбъект.Параметры.Свойство("ТолькоПросмотр") Тогда
		ДиагностироватьЦепочкуДокументовСчетовФактур();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереДокумент(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// МаркировкаПродукции
	ЭлектронныеДокументыБГУ.СохранитьКодыМаркировки(Объект.СоставНФА, ТекущийОбъект);
	// Конец МаркировкаПродукции
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
	// МаркировкаПродукции
	ЭлектронныеДокументыБГУ.КэшироватьРеквизитыМаркировки(Объект.СоставНФА, ПараметрыЗаписи);
	// Конец МаркировкаПродукции
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ДиагностироватьЦепочкуДокументовСчетовФактур();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;

	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".    
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// МаркировкаПродукции
	ЭлектронныеДокументыБГУ.ВосстановитьРеквизитыМаркировки(Объект.СоставНФА, ПараметрыЗаписи);
	// Конец МаркировкаПродукции
	
	// Прослеживаемость
	НастроитьФормуПрослеживаемостьСервер();
	// Конец Прослеживаемость
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	
	Если ЗначениеЗаполнено(Объект.ДокументКорректировки) Тогда
		ДокументыОснования = Новый Массив;
		ДокументыОснования.Добавить(Объект.ДокументКорректировки);
		ПараметрыЗаписи.Вставить("ДокументыОснования", ДокументыОснования);
	КонецЕсли;
	Оповестить("Запись_КорректировочныйСчетФактураВыданный", ПараметрыЗаписи, Объект.Ссылка);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтаФорма, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	ОбновитьНомерДляПечатиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПодразделениеПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ЗаполнитьНаОснованииКлиент(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументКорректировкиПриИзменении(Элемент)
	
	ЗаполнитьНаОснованииКлиент(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентовВДокументе(ЭтотОбъект, Элементы.Контрагент);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
	КонтрагентПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ПриИзмененииКлючевыхРеквизитовСостояниеЭДО();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("Организация, Контрагент", Объект.Организация, Объект.Контрагент);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Справочник.Договоры.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокДокументовОснования = Новый СписокЗначений;
	СписокДокументовОснования.Добавить("СчетФактураВыданный","Счет-фактура выданный");
	СписокДокументовОснования.Добавить("КорректировочныйСчетФактураВыданный","Корректировочный счет-фактура выданный");
	СписокДокументовОснования.Добавить("ИсправительныйСчетФактураВыданный","Исправительный счет-фактура выданный");
	
	ДополнительныеПараметры = Новый Структура("Элемент", Элемент);
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ДокументОснованиеВыбранТипДокумента", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВыборИзСписка(ОписаниеОповещенияВыбор, СписокДокументовОснования, Элемент)
	
КонецПроцедуры
&НаКлиенте
Процедура ДокументОснованиеВыбранТипДокумента(РезультатВыбора, ОписаниеОповещения) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидДокументаСтрокой = РезультатВыбора.Значение;
	
	ЭлементВладелец = ОписаниеОповещения["Элемент"];
	
	Отбор = Новый Структура("Организация", Объект.Организация);
	Если ЗначениеЗаполнено(Объект.Контрагент) тогда
		Отбор.Вставить("Контрагент",Объект.Контрагент);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Договор) тогда
		Отбор.Вставить("Договор",Объект.Договор);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ПараметрыФормы.Вставить("ТекущаяСтрока",Объект.ДокументОснование);
	
	ДобавитьПредустановленныйОтборСИсключениемСсылки(ПараметрыФормы, Объект.Ссылка);
	
	ОткрытьФорму("Документ." + ВидДокументаСтрокой + ".ФормаВыбора", ПараметрыФормы, ЭлементВладелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантРегистрацииПриИзменении(Элемент)
	ДоступностьКорректируемогоПериода();
КонецПроцедуры

&НаКлиенте
Процедура ВыставленПриИзменении(Элемент)
	
	Объект.ДатаВыставления = ?(Объект.Выставлен, ПолучитьДатуСеанса(),Дата("00010101"));
	
	ДоступностьДатыВыставления();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьПредустановленныйОтборСИсключениемСсылки(ПараметрыФормы, Ссылка)
	
	УчетНДС.ДобавитьПредустановленныйОтборСИсключениемСсылки(ПараметрыФормы, Ссылка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставНФА

&НаКлиенте
Процедура СоставНФАВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// МаркировкаПродукции
	Если Поле.Имя = "СоставНФАМаркируемыеУпаковки" Тогда
		ЭлектронныеДокументыБГУКлиент.МаркируемыеУпаковкиВыбор(ЭтаФорма, СтандартнаяОбработка, "СоставНФА");
	КонецЕсли;
	// Конец МаркировкаПродукции
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАНФАПриИзменении(Элемент)
	
	ТекДанные = Элементы["СоставНФА"].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	НФА = ТекДанные["НФА"];
	
	Если ЗначениеЗаполнено(НФА) Тогда
		ТекДанные.ПрослеживаемыйТовар = Ложь;
		Если ТипЗнч(НФА) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			СвойстваНоменклатуры = УправлениеМатериальнымиЗапасамиВызовСервера.ПолучитьСвойстваНоменклатуры(НФА, Объект.Дата, Объект["ПричинаНалогообложения"]);
			ЗаполнитьЗначенияСвойств(ТекДанные, СвойстваНоменклатуры, "СтавкаНДС, ЕдиницаИзмерения");
			ТекДанные.КодВидаТовара = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СвойстваНоменклатуры, "КодВидаТовара", "");
			ТекДанные.ПрослеживаемыйТовар = ?(ВедетсяУчетПрослеживаемыхТоваров, СвойстваНоменклатуры.ПрослеживаемыйТовар, Ложь);
			
		ИначеЕсли ТипЗнч(НФА)= Тип("СправочникСсылка.ОсновныеСредства") Тогда
			ЗаполнитьДанныеПоОСВСтрокеСервер(ТекДанные.ПолучитьИдентификатор());
		КонецЕсли;
		
		// МаркировкаПродукции
		ЭлектронныеДокументыБГУКлиент.УстановитьПризнакМаркируемыйТовар(ТекДанные, "НФА");
		// Конец МаркировкаПродукции
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАПриИзменении(Элемент)
	
	Если ВедетсяУчетПрослеживаемыхТоваров Тогда
		РассчитатьПрослеживаемыеТовары();
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"СоставНФАПрослеживаемыйТовар",
			"Видимость",
			ЕстьПрослеживаемыеТовары);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоставНФАКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура СоставНФАКоличествоДоИзмененияПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАЦенаПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура СоставНФАЦенаДоИзмененияПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАСуммаПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура СоставНФАСуммаДоИзмененияПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАСуммаНДСПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура СоставНФАСуммаНДСДоИзмененияПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАВсегоПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура СоставНФАВсегоДоИзмененияПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАВсегоДоИзменения1ПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАВсего1ПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАСтавкаНДСДоИзмененияПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАСтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАСуммаАкцизаДоИзмененияПриИзменении(Элемент)
	
	УчетНДСКлиентСервер.ЗаполнитьУвеличениеУменьшение(Элементы.СоставНФА.ТекущиеДанные, "СуммаАкциза");
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАСуммаАкцизаПриИзменении(Элемент)
	
	УчетНДСКлиентСервер.ЗаполнитьУвеличениеУменьшение(Элементы.СоставНФА.ТекущиеДанные, "СуммаАкциза");
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНФАКомиссионнаяТорговляПриИзменении(Элемент)
	
	РассчитатьСуммыВСтрокеКомиссия(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьДокументДоплаты(Команда)
	
	СписокДокументов = ПодобратьДокументыДоплаты();
	
	Если СписокДокументов.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Не удалось подобрать подходящие документы доплаты'"), 20);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПодобратьДокументДоплаты_Выбор", ЭтотОбъект);
	
	ПоказатьВыборИзСписка(ОписаниеОповещенияВыбор, СписокДокументов, Элементы["ПодобратьДокументДоплаты"]);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФормуСервер()
	
	ИнициализироватьНастройкиЭлементовКолонок();
	
	УчетНДСКлиентСервер.ЗаполнитьСписокКодовВидовОпераций(
		Элементы["КодВидаОперации"].СписокВыбора,
		"ВыставленныеСчетаФактуры",
		Объект["Дата"]);
		
	УчетНДСКлиентСервер.ЗаполнитьСписокКодовВидовОпераций(
		Элементы["КодВидаОперацииКомиссия"].СписокВыбора,
		"ВыставленныеСчетаФактуры",
		Объект["Дата"]);
	
	ДопЛист = Перечисления.ВариантыРегистрацииДляКорректирующихСФ.ВДопЛистахКнигПродажПокупок;
	
	КодВидаТовараИспользуется = УчетНДСПовтИсп.КодВидаТовараИспользуется(Объект["ПричинаНалогообложения"]);
	Элементы["СоставНФАКодВидаТовара"].Видимость = КодВидаТовараИспользуется;
	
	НастроитьФормуСервер_ПоПричинеНалогообложения();
	
	ОбновитьНомерДляПечатиСервер();
	
	ЗаполнитьТиповуюОперациюПриВводеНаОсновании();
	
	НастроитьВидимостьКолонкиСодержаниеУслуги();
	
	//---
	// Документы остатков НДС
	//---
	ДокументыОстатковНДС_НастроитьФормуСервер();
	
	УстановитьУсловноеОформление();
	
	// Прослеживаемость
	НастроитьФормуПрослеживаемостьСервер();
	// Конец Прослеживаемость
	
	ДиагностироватьЦепочкуДокументовСчетовФактур();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТиповуюОперациюПриВводеНаОсновании()
	
	Перем Основание;
	
	Если Константы.ФормированиеПроводокОбособленноОтДокумента.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Основание", Основание);
	
	Если Объект.Ссылка.Пустая() И ТипЗнч(Основание) = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12") Тогда
		НоваяТиповаяОперация = Документы.КорректировочныйСчетФактураВыданный.ЗаполнитьНаОснованииНакладнаяНаРеализациюТорг12_ТиповаяОперация(Основание);
		
		УчетНДС.ЗаполнитьТиповуюОперациюПриВводеНаОсновании(ЭтаФорма, НоваяТиповаяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//---
	// 1. Надпись А (до изменения)
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = "Надпись А (до изменения)";

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставНФА.НомерСтроки");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='А (до изменения)'"));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СоставНФАНадписьА");


	//---
	// 2. Надпись Б (после изменения)
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = "Надпись Б (после изменения)";

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставНФА.НомерСтроки");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Б (после изменения)'"));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СоставНФАНадписьБ");

	
	//---
	// 3. Надпись В (увеличение)
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = "Надпись В (увеличение)";

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставНФА.НомерСтроки");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='В (увеличение)'"));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СоставНФАНадписьВ");


	//---
	// 4. Надпись Г (уменьшение)
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = "Надпись Г (уменьшение)";

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СоставНФА.НомерСтроки");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='Г (уменьшение)'"));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СоставНФАНадписьГ");
	
	//---
	// 5.Заполненный реквизит "Документ основание" устанавливает реквизиты табличной части "Комиссионная торговля" в значение только просмотр
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Заполненный реквизит ""Документ основание"" устанавливает реквизиты табличной части ""Комиссионная торговля"" в значение только просмотр");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДокументОснование");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Условие.ПравоеЗначение = Неопределено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СоставНФАКомиссионнаяТорговля");
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьНастройкиЭлементовКолонок()
	
	КоллекцияСкрываемых = Новый Соответствие();
	
	СкрываемыеЭлементы = Новый Массив();
	СкрываемыеЭлементы.Добавить("СоставНФАЕдиницаИзмерения");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаКоличество");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаЦена");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаСумма");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаВсего");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаСуммаАкциза");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиСумма");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиВсего");
	СкрываемыеЭлементы.Добавить("КодВидаОперацииКомиссия");
	СкрываемыеЭлементы.Добавить("Комитент");
	СкрываемыеЭлементы.Добавить("ГруппаСчетаФактурыОтКомиссионера");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаКомиссия");
	КоллекцияСкрываемых.Вставить(Перечисления.ПричиныНалогообложенияНДС.АвансПолученный, СкрываемыеЭлементы);
	
	СкрываемыеЭлементы = Новый Массив();
	СкрываемыеЭлементы.Добавить("СоставНФАЕдиницаИзмерения");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаКоличество");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаЦена");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаСтавкаНДС");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаСуммаНДС");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаВсего");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаСуммаАкциза");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиНДС");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиВсего");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаВсегоАванс");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиВсегоАванс");
	СкрываемыеЭлементы.Добавить("КодВидаОперацииКомиссия");
	СкрываемыеЭлементы.Добавить("Комитент");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаКомиссия");
	СкрываемыеЭлементы.Добавить("ГруппаСчетаФактурыОтКомиссионера");
	КоллекцияСкрываемых.Вставить(Перечисления.ПричиныНалогообложенияНДС.АвансПолученныйЛом, СкрываемыеЭлементы);
	
	СкрываемыеЭлементы = Новый Массив();
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаСтавкаНДС");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаСуммаНДС");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаВсего");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаСуммаАкциза");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиНДС");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиВсего");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаВсегоАванс");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиВсегоАванс");
	СкрываемыеЭлементы.Добавить("КодВидаОперацииКомиссия");
	СкрываемыеЭлементы.Добавить("Комитент");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаКомиссия");
	СкрываемыеЭлементы.Добавить("ГруппаСчетаФактурыОтКомиссионера");
	КоллекцияСкрываемых.Вставить(Перечисления.ПричиныНалогообложенияНДС.РеализацияЛом, СкрываемыеЭлементы);
	
	СкрываемыеЭлементы = Новый Массив();
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаВсегоАванс");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиВсегоАванс");
	СкрываемыеЭлементы.Добавить("КодВидаОперацииКомиссия");
	СкрываемыеЭлементы.Добавить("Комитент");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаКомиссия");
	СкрываемыеЭлементы.Добавить("ГруппаСчетаФактурыОтКомиссионера");
	КоллекцияСкрываемых.Вставить(Перечисления.ПричиныНалогообложенияНДС.ПустаяСсылка(), СкрываемыеЭлементы);
	
	СкрываемыеЭлементы = Новый Массив();
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаВсегоАванс");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиВсегоАванс");
	СкрываемыеЭлементы.Добавить("Комитент");
	СкрываемыеЭлементы.Добавить("ГруппаСчетаФактурыОтКомиссионера");
	КоллекцияСкрываемых.Вставить(Перечисления.ПричиныНалогообложенияНДС.Реализация, СкрываемыеЭлементы);
	
	СкрываемыеЭлементы = Новый Массив();
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаВсегоАванс");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиВсегоАванс");
	СкрываемыеЭлементы.Добавить("ГруппаСчетаФактурыОтКомиссионера");
	КоллекцияСкрываемых.Вставить(Перечисления.ПричиныНалогообложенияНДС.АвансПолученныйКомиссионером, СкрываемыеЭлементы);
	
	СкрываемыеЭлементы = Новый Массив();
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаВсегоАванс");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиВсегоАванс");
	СкрываемыеЭлементы.Добавить("КодВидаОперацииКомиссия");
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаКомиссия");
	СкрываемыеЭлементы.Добавить("Комитент");
	КоллекцияСкрываемых.Вставить(Перечисления.ПричиныНалогообложенияНДС.СчетФактураКомитентаНаРеализацию, СкрываемыеЭлементы);
	
	СкрываемыеЭлементы = Новый Массив();
	СкрываемыеЭлементы.Добавить("СоставНФАГруппаВсегоАванс");
	СкрываемыеЭлементы.Добавить("ГруппаИтогиВсегоАванс");
	СкрываемыеЭлементы.Добавить("Комитент");
	СкрываемыеЭлементы.Добавить("ГруппаСчетаФактурыОтКомиссионера");
	КоллекцияСкрываемых.Вставить(Перечисления.ПричиныНалогообложенияНДС.СчетФактураКомиссионераНаПокупку, СкрываемыеЭлементы);
	
	УчетНДС.ИнициализироватьНастройкиЭлементовКолонок(ЭтаФорма, КоллекцияСкрываемых);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСервер_ПоПричинеНалогообложения()
	
	УчетНДС.НастроитьФорму_ВидимостьКолонок(ЭтаФорма);
	
	Элементы["ГруппаДокументДоплаты"].Видимость = (Объект.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.АвансПолученный);
	
	ЭтоНалоговыйАгент = УчетНДСПовтИсп.НалоговыйАгент(Объект.ПричинаНалогообложения);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСервер_ПоКонтрагенту()
	
	УстановитьВидимостьЭлементовЭДО(ЭтаФорма);
	
	ПриИзмененииКлючевыхРеквизитовСостояниеЭДО();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммыВСтроке(Элемент)
	
	Перем ИмяИзмененногоПоля;
	
	ТекДанные = Элементы["СоставНФА"].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяЭлемента = Элемент.Имя;
	
	// Колонки, не относящиеся к НДС:
	Если ИмяЭлемента = "СоставНФАКоличество" ИЛИ ИмяЭлемента = "СоставНФАЦена" Тогда
		ТекДанные["Сумма"]	= ТекДанные["Количество"] * ТекДанные["Цена"];
		ИмяИзмененногоПоля	= "Сумма";
		ИмяПоляСумма		= "Сумма";
		ИмяПоляСуммаНДС		= "СуммаНДС";
		ИмяПоляВсего		= "Всего";
		ИмяПоляСтавкаНДС	= "СтавкаНДС";
	ИначеЕсли ИмяЭлемента = "СоставНФАКоличествоДоИзменения" ИЛИ ИмяЭлемента = "СоставНФАЦенаДоИзменения" Тогда
		ТекДанные["СуммаДоИзменения"]	= ТекДанные["КоличествоДоИзменения"] * ТекДанные["ЦенаДоИзменения"];
		ИмяИзмененногоПоля	= "СуммаДоИзменения";
		ИмяПоляСумма		= "СуммаДоИзменения";
		ИмяПоляСуммаНДС		= "СуммаНДСДоИзменения";
		ИмяПоляВсего		= "ВсегоДоИзменения";
		ИмяПоляСтавкаНДС	= "СтавкаНДС";
		
	// Колонки, относящиеся к НДС:
	ИначеЕсли ИмяЭлемента = "СоставНФАСумма" Тогда
		ИмяИзмененногоПоля	= "Сумма";
		ИмяПоляСумма		= "Сумма";
		ИмяПоляСуммаНДС		= "СуммаНДС";
		ИмяПоляВсего		= "Всего";
		ИмяПоляСтавкаНДС	= "СтавкаНДС";
	ИначеЕсли ИмяЭлемента = "СоставНФАСуммаДоИзменения" Тогда
		ИмяИзмененногоПоля	= "СуммаДоИзменения";
		ИмяПоляСумма		= "СуммаДоИзменения";
		ИмяПоляСуммаНДС		= "СуммаНДСДоИзменения";
		ИмяПоляВсего		= "ВсегоДоИзменения";
		ИмяПоляСтавкаНДС	= "СтавкаНДС";
		
	ИначеЕсли ИмяЭлемента = "СоставНФАСуммаНДС" Тогда
		ИмяИзмененногоПоля	= "СуммаНДС";
		ИмяПоляСумма		= "Сумма";
		ИмяПоляСуммаНДС		= "СуммаНДС";
		ИмяПоляВсего		= "Всего";
		ИмяПоляСтавкаНДС	= "СтавкаНДС";
	ИначеЕсли ИмяЭлемента = "СоставНФАСуммаНДСДоИзменения" Тогда
		ИмяИзмененногоПоля	= "СуммаНДСДоИзменения";
		ИмяПоляСумма		= "СуммаДоИзменения";
		ИмяПоляСуммаНДС		= "СуммаНДСДоИзменения";
		ИмяПоляВсего		= "ВсегоДоИзменения";
		ИмяПоляСтавкаНДС	= "СтавкаНДС";
		
	ИначеЕсли	ИмяЭлемента = "СоставНФАВсего" ИЛИ ИмяЭлемента = "СоставНФАВсегоАванс" Тогда
		ИмяИзмененногоПоля	= "Всего";
		ИмяПоляСумма		= "Сумма";
		ИмяПоляСуммаНДС		= "СуммаНДС";
		ИмяПоляВсего		= "Всего";
		ИмяПоляСтавкаНДС	= "СтавкаНДС";
	ИначеЕсли	ИмяЭлемента = "СоставНФАВсегоДоИзменения" ИЛИ ИмяЭлемента = "СоставНФАВсегоДоИзмененияАванс" Тогда
		ИмяИзмененногоПоля	= "ВсегоДоИзменения";
		ИмяПоляСумма		= "СуммаДоИзменения";
		ИмяПоляСуммаНДС		= "СуммаНДСДоИзменения";
		ИмяПоляВсего		= "ВсегоДоИзменения";
		ИмяПоляСтавкаНДС	= "СтавкаНДС";
		
	ИначеЕсли ИмяЭлемента = "СоставНФАСтавкаНДС" Тогда
		ИмяИзмененногоПоля	= "СтавкаНДС";
		ИмяПоляСумма		= "Сумма";
		ИмяПоляСуммаНДС		= "СуммаНДС";
		ИмяПоляВсего		= "Всего";
		ИмяПоляСтавкаНДС	= "СтавкаНДС";
	ИначеЕсли ИмяЭлемента = "СоставНФАСтавкаНДСДоИзменения" Тогда
		ИмяИзмененногоПоля	= "СтавкаНДСДоИзменения";
		ИмяПоляСумма		= "СуммаДоИзменения";
		ИмяПоляСуммаНДС		= "СуммаНДСДоИзменения";
		ИмяПоляВсего		= "ВсегоДоИзменения";
		ИмяПоляСтавкаНДС	= "СтавкаНДСДоИзменения";
	КонецЕсли;
	
	СтруктураИменПолей = Новый Структура();
	СтруктураИменПолей.Вставить("Сумма",		ИмяПоляСумма);
	СтруктураИменПолей.Вставить("СуммаНДС",		ИмяПоляСуммаНДС);
	СтруктураИменПолей.Вставить("Всего",		ИмяПоляВсего);
	СтруктураИменПолей.Вставить("СтавкаНДС",	ИмяПоляСтавкаНДС);
	УчетНДСКлиентСервер.РассчитатьСуммы(ТекДанные, ИмяИзмененногоПоля, СтруктураИменПолей, ЭтоАванс, ЭтоНалоговыйАгент);
	
	УчетНДСКлиентСервер.ЗаполнитьУвеличениеУменьшение(ТекДанные, "Сумма");
	УчетНДСКлиентСервер.ЗаполнитьУвеличениеУменьшение(ТекДанные, "СуммаНДС");
	УчетНДСКлиентСервер.ЗаполнитьУвеличениеУменьшение(ТекДанные, "Всего");
	
	Если ТекДанные.КомиссионнаяТорговля Тогда
		УчетНДСКлиентСервер.ЗаполнитьУвеличениеУменьшение(ТекДанные, "СуммаНДС", "СуммаНДСПоКомиссии");
		УчетНДСКлиентСервер.ЗаполнитьУвеличениеУменьшение(ТекДанные, "Всего", "ВсегоПоКомиссии");
	КонецЕсли;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьДатуСеанса() 
	Возврат ТекущаяДатаСеанса();
КонецФункции	

&НаКлиенте
Процедура ДоступностьДатыВыставления()
	Элементы.ГруппаДатаВидВыставления.Доступность = Объект.Выставлен;
КонецПРоцедуры	

&НаКлиенте
Процедура ДоступностьКорректируемогоПериода()
	Элементы.КорректируемыйПериод.Доступность = Объект.ВариантРегистрации = ДопЛист;
КонецПРОцедуры


&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
	 ИЛИ (Объект.ВалютаДокумента <> ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета
	 	И НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня) Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьВалютаДляКонтроляКурса);
		
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		
		УчетНДСКлиентСервер.ЗаполнитьСписокКодовВидовОпераций(
			Элементы["КодВидаОперации"].СписокВыбора,
			"ВыставленныеСчетаФактуры",
			Объект["Дата"]);
		
		УчетНДСКлиентСервер.ЗаполнитьСписокКодовВидовОпераций(
			Элементы["КодВидаОперацииКомиссия"].СписокВыбора,
			"ВыставленныеСчетаФактуры",
			Объект["Дата"]);
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентовВДокументе(ЭтотОбъект, Объект.Дата);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
	Документы.КорректировочныйСчетФактураВыданный.ЗаполнитьРеквизитыСторонСделки(Объект);
	
	УстановитьОтветственныхЛицСервер();
	
	ОбновитьНомерДляПечатиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Объект.Договор = "";
	Объект.ДокументОснование = "";
	Объект.ИсправляемыйДокумент = "";
	Объект.ДатаПервичногоДокумента = "";
	Объект.НомерПервичногоДокумента = "";
	
	Объект.СоставНФА.Очистить();
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	ПриИзмененииКлючевыхРеквизитовСостояниеЭДО();	
	
	Документы.КорректировочныйСчетФактураВыданный.ЗаполнитьРеквизитыСторонСделки(Объект);
	
	УстановитьОтветственныхЛицСервер();
	
	ОбновитьНомерДляПечатиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииСервер()
	
	Документы.КорректировочныйСчетФактураВыданный.ЗаполнитьРеквизитыСторонСделки(Объект);
	
	УстановитьОтветственныхЛицСервер();
	
	ОбновитьНомерДляПечатиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииСервер()
	
	НастроитьФормуСервер_ПоКонтрагенту();
	
	Документы.КорректировочныйСчетФактураВыданный.ЗаполнитьРеквизитыСторонСделки(Объект);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьНаОснованииКлиент(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	
	НовоеЗначение = Объект[ИмяЭлемента];
	
	Если ЗначениеЗаполнено(НовоеЗначение) Тогда
		
		ТекстВопроса = НСтр("ru='Заполнить на основании указанного документа?'");
		
		ДополнительныеПараметры = Новый Структура("ИмяЭлемента", ИмяЭлемента);
		
		ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ЗаполнитьНаОснованииКлиент_Выбор", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещенияВыбор, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет);
		
	Иначе
		ДиагностироватьЦепочкуДокументовСчетовФактур();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаОснованииКлиент_Выбор(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьНаОснованииСервер(ДополнительныеПараметры);
		
	Иначе
		ДиагностироватьЦепочкуДокументовСчетовФактур();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаОснованииСервер(ДополнительныеПараметры)
	
	Перем ОписаниеОшибки, ДопПараметры;
	
	Если ЗначениеЗаполнено(Объект.ДокументКорректировки) Тогда
		
		ТипДокументаКорректировки = ТипЗнч(Объект.ДокументКорректировки);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДокументКорректировки) И НЕ ТипДокументаКорректировки = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		
		Основание = Объект.ДокументКорректировки;
		
		Если ДополнительныеПараметры.ИмяЭлемента = "ДокументОснование" Тогда
			ДопПараметры = "ТолькоДозаполнитьПоСчетуФактуре";
		КонецЕсли;
	Иначе
		Основание = Объект.ДокументОснование;
	КонецЕсли;
	
	Если Не Документы.КорректировочныйСчетФактураВыданный.ЗаполнитьНаОсновании(Основание, Объект, ОписаниеОшибки, ДопПараметры) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		
		ДиагностироватьЦепочкуДокументовСчетовФактур();
		
		Возврат;
	КонецЕсли;
	
	НастроитьФормуСервер_ПоПричинеНалогообложения();
	
	НастроитьФормуСервер_ПоКонтрагенту();
	
	НастроитьВидимостьКолонкиСодержаниеУслуги();
	
	// МаркировкаПродукции
	ЭлектронныеДокументыБГУ.ЗаполнитьРеквизитыМаркировки(Объект, "СоставНФА");
	// Конец МаркировкаПродукции
	
	// Прослеживаемость
	НастроитьФормуПрослеживаемостьСервер();
	// Конец Прослеживаемость
	
	ДиагностироватьЦепочкуДокументовСчетовФактур();
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьОтветственныхЛицСервер()
	
	Документы.КорректировочныйСчетФактураВыданный.УстановитьОтветственныхЛиц(Объект);
	
КонецПроцедуры


&НаКлиенте
Процедура ПодобратьДокументДоплаты_Выбор(РезультатВыбора, ОписаниеОповещения) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект["ДокументДоплаты"] = РезультатВыбора.Значение;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПодобратьДокументыДоплаты()
	
	Возврат Документы.КорректировочныйСчетФактураВыданный.ПодобратьДокументыДоплаты(Объект);
	
КонецФункции


&НаСервере
Процедура ОбновитьНомерДляПечатиСервер()
	
	НомерСФ = УчетНДС.ОпределитьПоОбъектуНомерСФДляВыводаВРегистрыУчета(Объект);
	
	НомерДляПечати = НомерСФ["НомерКСФ"];
	
	НовВидимость = НЕ (НомерДляПечати = Объект.Номер);
	
	Элементы["НомерДляПечати"].Видимость = НовВидимость;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьКолонкиСодержаниеУслуги()
	
	// Настройка видимости выполняется аналогично форме документа СчетФактураВыданный
	
	НовВидимость = Ложь;
	
	ПервоначальныйСчетФактура = УчетНДС.ПолучитьПервоначальныйСчетФактуруВыданный(Объект.ИсправляемыйДокумент);
	
	Если ЗначениеЗаполнено(ПервоначальныйСчетФактура) Тогда
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПервоначальныйСчетФактура, "ДокументОснование");
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			ТипОснования = ТипЗнч(ДокументОснование);
			
			НовВидимость = (ТипОснования = Тип("ДокументСсылка.АктОбОказанииУслуг")
				Или ТипОснования = Тип("ДокументСсылка.НачислениеАмортизацииПравПользованияОС")
				Или ТипОснования = Тип("ДокументСсылка.СписаниеДоходовБудущихПериодов"));
		КонецЕсли;
	КонецЕсли;
	
	Элементы.СоставНФАСодержаниеУслуги.Видимость = НовВидимость;
	
КонецПроцедуры

// Прослеживаемость
&НаСервере
Процедура НастроитьФормуПрослеживаемостьСервер()
	
	ПрослеживаемостьФормыБГУ.НастроитьФормуИКолонкуПрослеживаемыйТовар(ЭтаФорма, Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПрослеживаемыеТовары()

	ЕстьПрослеживаемыеТовары = Объект.СоставНФА.НайтиСтроки(Новый Структура("ПрослеживаемыйТовар", Истина)).Количество();

КонецПроцедуры
// Конец Прослеживаемость

&НаСервере
Процедура ЗаполнитьДанныеПоОСВСтрокеСервер(ИдентификаторСтроки)
	
	ТекДанные = Объект.СоставНФА.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекДанные.ПрослеживаемыйТовар = ?(ВедетсяУчетПрослеживаемыхТоваров, ПрослеживаемостьБГУ.ПрослеживаемоеОсновноеСредство(ТекДанные.НФА, Объект), Ложь);

КонецПроцедуры
// Конец Прослеживаемость

//---
// Документы остатков НДС
//---

&НаСервере
Процедура ДокументыОстатковНДС_НастроитьФормуСервер()
	
	УчетНДС.ДокументыОстатковНДС_НастроитьФормуСервер(ЭтаФорма);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ДокументыОстатковНДС_НажатиеКнопкиПоказать(ДекорацияФормы) Экспорт
	
	УчетНДСКлиент.ДокументыОстатковНДС_НажатиеКнопкиПоказать(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОстатковНДС_ВыбранДокументВводаОстатковНДС(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	УчетНДСКлиент.ДокументыОстатковНДС_ВыбранДокументВводаОстатковНДС(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОстатковНДС_ПодтвердитьСбросФлажка(Команда)
	
	УчетНДСКлиент.ДокументыОстатковНДС_ПодтвердитьСбросФлажка(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОстатковНДС_ПодтвердитьСбросФлажка_Выбор(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	УчетНДСКлиент.ДокументыОстатковНДС_ПодтвердитьСбросФлажка_Выбор(ЭтаФорма, РезультатВыбора);
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ЭДОСКонтрагентами

&НаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЭДО(Форма)
	
	Объект = Форма.Объект;
	
	ВидимостьЭлементовЭДО = ЭлектронныеДокументыБГУ.ВидимостьЭлементовЭДО(Объект.Контрагент, Объект.Организация);
	
	ВидимостьЭлементовМаркировки = ЭлектронныеДокументыБГУ.ОпределитьВидимостьЭлементовМаркировки(Объект);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДекорацияСостояниеЭДО", "Видимость", ВидимостьЭлементовЭДО);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СоставНФАМаркируемыеУпаковки,СтраницаМаркируемыеУпаковки,ГруппаДополнительныеСведенияОМаркированныхТоварах", "Видимость", ВидимостьЭлементовМаркировки);
	
	ВидимостьЭлементовМаркировкиОбъемноСортовогоУчета = ЭлектронныеДокументыБГУ.ИспользованиеОбъемноСортовойУчетМаркированныхТоваров(Объект.Организация);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СоставНФАГруппаСведенияОбъемноСортовогоУчета", "Видимость", ВидимостьЭлементовМаркировкиОбъемноСортовогоУчета);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевыхРеквизитовСостояниеЭДО()
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ПараметрыПриИзменении = ОбменСКонтрагентами.ПараметрыПриИзмененииКлючевыхРеквизитовЭДО();
	
	ПараметрыПриИзменении.Форма                 = ЭтотОбъект;
	ПараметрыПриИзменении.ДокументСсылка        = Объект.Ссылка;
	ПараметрыПриИзменении.ДокументОбъект        = РеквизитФормыВЗначение("Объект");
	ПараметрыПриИзменении.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПриИзменении.ГруппаСостояниеЭДО    = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриИзмененииКлючевыхРеквизитовЭДО(ПараметрыПриИзменении);
	
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура РассчитатьСуммыВСтрокеКомиссия(Элемент)
	
	ТекДанные = Элементы["СоставНФА"].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.КомиссионнаяТорговля Тогда
		ТекДанные.СуммаНДСПоКомиссииУвеличение = ТекДанные.СуммаНДСУвеличение;
		ТекДанные.СуммаНДСПоКомиссииУменьшение = ТекДанные.СуммаНДСУменьшение;
		ТекДанные.ВсегоПоКомиссииУвеличение = ТекДанные.ВсегоУвеличение;
		ТекДанные.ВсегоПоКомиссииУменьшение = ТекДанные.ВсегоУменьшение;
	Иначе
		ТекДанные.СуммаНДСПоКомиссииУвеличение = 0;
		ТекДанные.СуммаНДСПоКомиссииУменьшение = 0;
		ТекДанные.ВсегоПоКомиссииУвеличение = 0;
		ТекДанные.ВсегоПоКомиссииУменьшение = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДиагностироватьЦепочкуДокументовСчетовФактур()
	
	УчетНДС.ДиагностироватьЦепочкуДокументовСчетовФактур(ЭтотОбъект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ТиповыеОперации
&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 
#КонецОбласти

#Область СтандартныеПодсистемыРаботаСКонтрагентами
// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Процедура Подключаемый_ПоказатьПредложениеИспользоватьПроверкуКонтрагентов()
	ПроверкаКонтрагентовКлиент.ПредложитьВключитьПроверкуКонтрагентов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Процедура Подключаемый_ОбработатьРезультатПроверкиКонтрагентов()
	ПроверкаКонтрагентовКлиент.ОбработатьРезультатПроверкиКонтрагентовВДокументе(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаСервере
Процедура ОтобразитьРезультатПроверкиКонтрагента() Экспорт
	ПроверкаКонтрагентов.ОтобразитьРезультатПроверкиКонтрагентаВДокументе(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаСервере
Процедура ПроверитьКонтрагентовФоновоеЗадание(ПараметрыФоновогоЗадания) Экспорт
	ПроверкаКонтрагентов.ПроверитьКонтрагентовВДокументеФоновоеЗадание(ЭтотОбъект, ПараметрыФоновогоЗадания);
КонецПроцедуры

#КонецОбласти

#Область МаркировкаПродукции

// МаркировкаПродукции
&НаКлиенте
Процедура Подключаемый_КолонкаМаркируемыеУпаковки_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЭлектронныеДокументыБГУКлиент.МаркируемыеУпаковкиНачалоВыбора(ЭтаФорма, СтандартнаяОбработка, "СоставНФА", "НФА");
	
КонецПроцедуры

// Конец МаркировкаПродукции

#КонецОбласти
