#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"				, ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента"		, "Принятие к учету групп объектов ИК (ОС-1б)");
	Запрос.УстановитьПараметр("УчетПоПодразделениям", УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетИКПоПодразделениям());
	
	ТаблицыЗапроса = Новый Массив;
	
	ТаблицыЗапроса.Добавить("МестонахождениеОС");
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ПринятиеКУчетуИКОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка) КАК ЦМО,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету) КАК Состояние,
	|	&Ссылка КАК Регистратор,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата КАК Период,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.ПринятиеКУчетуИК.ОсновныеСредства КАК ПринятиеКУчетуИКОсновныеСредства
	|ГДЕ
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуИКОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.Поступление)";
	
	ТаблицыЗапроса.Добавить("СобытияОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	СобытияОС.ОсновноеСредство,
	|	СобытияОС.Организация,
	|	СобытияОС.ИнвНомер,
	|	СобытияОС.Событие,
	|	СобытияОС.ДатаСобытия,
	|	СобытияОС.НазваниеДокумента,
	|	СобытияОС.НомерДокумента,
	|	СобытияОС.ДатаДокумента,
	|	СобытияОС.Регистратор,
	|	СобытияОС.Период
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|		ПринятиеКУчетуИКОсновныеСредства.Ссылка.Организация КАК Организация,
	|		ПринятиеКУчетуИКОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|		ВЫБОР
	|			КОГДА ПринятиеКУчетуИКОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.Поступление)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|			КОГДА ПринятиеКУчетуИКОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ВозвратАренда)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВозвратИзАренды)
	|			КОГДА ПринятиеКУчетуИКОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ВозвратБезвозмездноеПользование)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВозвратИзБезвозмездногоПользования)
	|		КОНЕЦ КАК Событие,
	|		ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата КАК ДатаСобытия,
	|		&ИмяДокумента КАК НазваниеДокумента,
	|		ПринятиеКУчетуИКОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|		ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|		&Ссылка КАК Регистратор,
	|		ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата КАК Период
	|	ИЗ
	|		Документ.ПринятиеКУчетуИК.ОсновныеСредства КАК ПринятиеКУчетуИКОсновныеСредства
	|	ГДЕ
	|		ПринятиеКУчетуИКОсновныеСредства.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство,
	|		ПринятиеКУчетуИКОсновныеСредства.Ссылка.Организация,
	|		ПринятиеКУчетуИКОсновныеСредства.ИнвентарныйНомер,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию),
	|		ВЫБОР
	|			КОГДА ПринятиеКУчетуИКОсновныеСредства.ДатаВводаВЭксплуатацию = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата
	|			ИНАЧЕ ПринятиеКУчетуИКОсновныеСредства.ДатаВводаВЭксплуатацию
	|		КОНЕЦ,
	|		&ИмяДокумента,
	|		ПринятиеКУчетуИКОсновныеСредства.Ссылка.Номер,
	|		ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата,
	|		&Ссылка,
	|		ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата
	|	ИЗ
	|		Документ.ПринятиеКУчетуИК.ОсновныеСредства КАК ПринятиеКУчетуИКОсновныеСредства
	|	ГДЕ
	|		ПринятиеКУчетуИКОсновныеСредства.Ссылка = &Ссылка
	|		И ПринятиеКУчетуИКОсновныеСредства.ДатаВводаВЭксплуатацию <> ДАТАВРЕМЯ(1, 1, 1)
	|		И ПринятиеКУчетуИКОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.Поступление)) КАК СобытияОС";
	
	ТаблицыЗапроса.Добавить("НачислениеАмортизацииОСБухгалтерскийУчет");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуИК.Организация КАК Организация,
	|	ПринятиеКУчетуИК.НачислятьАмортизацию,
	|	&Ссылка КАК Регистратор,
	|	ПринятиеКУчетуИК.Дата КАК Период
	|ИЗ
	|	Документ.ПринятиеКУчетуИК.ОсновныеСредства КАК ПринятиеКУчетуИКОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуИК КАК ПринятиеКУчетуИК
	|		ПО ПринятиеКУчетуИКОсновныеСредства.Ссылка = ПринятиеКУчетуИК.Ссылка
	|ГДЕ
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуИК.Ссылка = &Ссылка
	|	И ПринятиеКУчетуИК.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.Поступление)
	|	И ПринятиеКУчетуИК.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|	И ПринятиеКУчетуИК.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)";
	
	ТаблицыЗапроса.Добавить("ПараметрыАмортизацииОСБухгалтерскийУчет");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуИК.Организация КАК Организация,
	|	&Ссылка КАК Регистратор,
	|	ПринятиеКУчетуИК.Дата КАК Период,
	|	ПринятиеКУчетуИК.СпособНачисленияАмортизации,
	|	ПринятиеКУчетуИК.ПорядокПогашенияСтоимости
	|ИЗ
	|	Документ.ПринятиеКУчетуИК.ОсновныеСредства КАК ПринятиеКУчетуИКОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуИК КАК ПринятиеКУчетуИК
	|		ПО ПринятиеКУчетуИКОсновныеСредства.Ссылка = ПринятиеКУчетуИК.Ссылка
	|ГДЕ
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуИК.Ссылка = &Ссылка
	|	И ПринятиеКУчетуИК.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.Поступление)";
	
	ТаблицыЗапроса.Добавить("АмортизацияОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	&Ссылка КАК Регистратор,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата КАК Период,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.СчетУчетаЗатрат,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.КЭКЗатрат КАК КЭК,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.СубконтоЗатрат1 КАК Субконто1,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.СубконтоЗатрат2 КАК Субконто2,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.СубконтоЗатрат3 КАК Субконто3,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.КПСЗатрат КАК КПС,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.ПодразделениеЗатрат КАК Подразделение,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Организация КАК Организация
	|ИЗ
	|	Документ.ПринятиеКУчетуИК.ОсновныеСредства КАК ПринятиеКУчетуИКОсновныеСредства
	|ГДЕ
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуИКОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.Поступление)
	|	И (ПринятиеКУчетуИКОсновныеСредства.Ссылка.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|			ИЛИ ПринятиеКУчетуИКОсновныеСредства.Ссылка.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию))";
	
	ТаблицыЗапроса.Добавить("РасчетАмортизацииОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	&Ссылка КАК Регистратор,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата КАК Период,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.СрокПолезногоИспользования,
	|	ПринятиеКУчетуИКОсновныеСредства.ОставшийсяСрокПолезногоИспользования КАК СрокИспользованияДляВычисленияАмортизации,
	|	СУММА(ПринятиеКУчетуИКОсновныеСредства.Сумма - ПринятиеКУчетуИКОсновныеСредства.СуммаАмортизации) КАК СтоимостьДляВычисленияАмортизации,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Организация КАК Организация
	|ИЗ
	|	Документ.ПринятиеКУчетуИК.ОсновныеСредства КАК ПринятиеКУчетуИКОсновныеСредства
	|ГДЕ
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуИКОсновныеСредства.НомерСтроки = 1
	|	И ПринятиеКУчетуИКОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.Поступление)
	|	И (ПринятиеКУчетуИКОсновныеСредства.Ссылка.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|			ИЛИ ПринятиеКУчетуИКОсновныеСредства.Ссылка.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.СрокПолезногоИспользования,
	|	ПринятиеКУчетуИКОсновныеСредства.ОставшийсяСрокПолезногоИспользования,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Организация";
	
	ТаблицыЗапроса.Добавить("СтоимостьОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +	
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата КАК Период,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Организация,
	|	ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство,
	|	ПринятиеКУчетуИКОсновныеСредства.ИнвентарныйНомер,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.ЦМО,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ПринятиеКУчетуИКОсновныеСредства.Ссылка.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	СУММА(ПринятиеКУчетуИКОсновныеСредства.Сумма) КАК Стоимость,
	|	СУММА(ПринятиеКУчетуИКОсновныеСредства.Количество) КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету) КАК Событие,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.ПринятиеКУчетуИК.ОсновныеСредства КАК ПринятиеКУчетуИКОсновныеСредства
	|ГДЕ
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуИКОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.Поступление)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата,
	|	ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство,
	|	ПринятиеКУчетуИКОсновныеСредства.ИнвентарныйНомер,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.ЦМО,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Подразделение,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Организация,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Номер,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ПринятиеКУчетуИКОсновныеСредства.СуммаАмортизации) <> 0
	|		ИЛИ СУММА(ПринятиеКУчетуИКОсновныеСредства.Количество) <> 0)";
	
	ТаблицыЗапроса.Добавить("АмортизацияОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +	
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата КАК Период,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Организация,
	|	ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство,
	|	ПринятиеКУчетуИКОсновныеСредства.ИнвентарныйНомер,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Подразделение,
	|	СУММА(ПринятиеКУчетуИКОсновныеСредства.СуммаАмортизации) КАК СуммаАмортизации
	|ИЗ
	|	Документ.ПринятиеКУчетуИК.ОсновныеСредства КАК ПринятиеКУчетуИКОсновныеСредства
	|ГДЕ
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуИКОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.Поступление)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Дата,
	|	ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство,
	|	ПринятиеКУчетуИКОсновныеСредства.ИнвентарныйНомер,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Подразделение,
	|	ПринятиеКУчетуИКОсновныеСредства.Ссылка.Организация
	|
	|ИМЕЮЩИЕ
	|	СУММА(ПринятиеКУчетуИКОсновныеСредства.СуммаАмортизации) <> 0";
	
	ТаблицыЗапроса.Добавить("СтоимостьОбъектовОСПоКонтрагентам");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ВозвратАренда)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование)
	|	КОНЕЦ КАК ВидРаспоряжения,
	|	ОсновныеСредства.Ссылка.Дата КАК Период,
	|	ОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ОсновныеСредства.Ссылка.Контрагент КАК Контрагент,
	|	ОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ОсновныеСредства.Сумма КАК Стоимость,
	|	ОсновныеСредства.Количество КАК Количество
	|ИЗ
	|	Документ.ПринятиеКУчетуИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|	И (ОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ВозвратАренда)
	|			ИЛИ ОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ВозвратБезвозмездноеПользование))
	|	И ОсновныеСредства.Сумма <> 0";
	
	Результат = Запрос.ВыполнитьПакет();

	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, ТаблицыЗапроса);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуИК";
	КомандаПечати.Идентификатор		= "ОС1б";
	КомандаПечати.Представление		= НСтр("ru = 'Акт о приеме - передаче групп объектов ОС (ОС-1б)'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Перем ТабличныйДокумент1, ТабличныйДокумент2, ТабличныйДокумент3, ТабличныйДокумент4;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОС1б") Тогда
		
		ПодготовитьОС1(МассивОбъектов, ОбъектыПечати, ТабличныйДокумент1, ТабличныйДокумент2, ТабличныйДокумент3, ТабличныйДокумент4);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС1б","ОС-1б", ТабличныйДокумент1);
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС1б_2","ОС-1б (стр. 2)", ТабличныйДокумент2);
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС1б_3","ОС-1б (стр. 3)", ТабличныйДокумент3);
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС1б_4","ОС-1б (стр. 4)", ТабличныйДокумент4);
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьОС1(МассивОбъектов, ОбъектыПечати, ТабличныйДокумент1, ТабличныйДокумент2, ТабличныйДокумент3, ТабличныйДокумент4)
    ТабличныйДокумент1 = Новый ТабличныйДокумент;
	ТабличныйДокумент2 = Новый ТабличныйДокумент;
	ТабличныйДокумент3 = Новый ТабличныйДокумент;
	ТабличныйДокумент4 = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПринятиеКУчетуИК.Ссылка КАК Ссылка,
	               |	ПринятиеКУчетуИК.Номер КАК пНомер,
	               |	ПринятиеКУчетуИК.Дата КАК пДата,
	               |	ПринятиеКУчетуИК.Организация,
	               |	ПринятиеКУчетуИК.Организация.НаименованиеПолное КАК НаимПолучателя,
	               |	ПринятиеКУчетуИК.Организация.КодОКПО КАК КодОКПОПолучателя,
	               |	ПринятиеКУчетуИК.ОснованиеДляАкта,
	               |	ПринятиеКУчетуИК.НомерОснованияДляАкта,
	               |	ПринятиеКУчетуИК.ДатаОснованияДляАкта,
	               |	ПринятиеКУчетуИК.Дата КАК ДатаАктаВВода,
	               |	ПринятиеКУчетуИК.ОсновныеСредства.(
	               |		Ссылка,
	               |		НомерСтроки КАК НомСтр,
	               |		ВЫБОР
	               |			КОГДА ПринятиеКУчетуИК.ОсновныеСредства.ОсновноеСредство.НаименованиеПолное <> """"
	               |				ТОГДА ПринятиеКУчетуИК.ОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	               |			ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ПринятиеКУчетуИК.ОсновныеСредства.ОсновноеСредство)
	               |		КОНЕЦ КАК НаимОс,
	               |		ИнвентарныйНомер КАК ИнвНомер,
	               |		ИнвентарныйНомер.ЗаводскойНомер КАК пЗавНомер,
	               |		ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска,
	               |		Количество,
	               |		Сумма КАК пЦенаПродажи,
	               |		Сумма КАК пНачСтоимость,
	               |		СуммаАмортизации КАК НачАмортизация,
	               |		ДатаВводаВЭксплуатацию КАК ДатаВвода,
	               |		ОставшийсяСрокПолезногоИспользования КАК СрокПолезнИспПриПост,
	               |		ОсновноеСредство.НаименованиеПолное,
	               |		Ссылка.СпособНачисленияАмортизации КАК СпособАморт,
	               |		ОсновноеСредство.АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	               |		ОсновноеСредство
	               |	),
	               |	ПринятиеКУчетуИК.СоставКомиссии.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		ДолжностьЧленаКомиссии,
	               |		ФамилияЧленаКомиссии,
	               |		ИмяЧленаКомиссии,
	               |		ОтчествоЧленаКомиссии
	               |	),
	               |	ПринятиеКУчетуИК.ДолжностьПредседателяКомиссии,
	               |	ПринятиеКУчетуИК.ФамилияПредседателяКомиссии,
	               |	ПринятиеКУчетуИК.ИмяПредседателяКомиссии,
	               |	ПринятиеКУчетуИК.ОтчествоПредседателяКомиссии,
	               |	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК МОЛ,
	               |	ПринятиеКУчетуИК.Приложение КАК ТекстПриложения,
	               |	"""" КАК ТабНомМОЛ,
	               |	ПринятиеКУчетуИК.РеквизитыЛицевогоСчета,
	               |	ПринятиеКУчетуИК.Подразделение КАК ПодрПолучателя,
	               |	ПринятиеКУчетуИК.РеквизитыЛицевогоСчета.Владелец КАК ЛицевойСчет
	               |ИЗ
	               |	Документ.ПринятиеКУчетуИК КАК ПринятиеКУчетуИК
	               |ГДЕ
	               |	ПринятиеКУчетуИК.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	пДата,
	               |	пНомер,
	               |	НомСтр";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	УстановитьПривилегированныйРежим(Истина);
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ОС_1б");
	ОбластьШапка1 		= Макет.ПолучитьОбласть("Шапка1");
	ОбластьШапка2		= Макет.ПолучитьОбласть("Шапка2");
	ОбластьСтрока2 		= Макет.ПолучитьОбласть("Строка2");
	ОбластьСтрока2П 	= Макет.ПолучитьОбласть("Строка2П");
	ОбластьПодвал2_1 	= Макет.ПолучитьОбласть("Подвал2_1");
	ОбластьКомиссия 	= Макет.ПолучитьОбласть("Комиссия");
	ОбластьПодвал2_2	= Макет.ПолучитьОбласть("Подвал2_2");
	ОбластьШапка3 		= Макет.ПолучитьОбласть("Шапка3");
	ОбластьСтрока3 		= Макет.ПолучитьОбласть("Строка3");
	ОбластьСтрока3П 	= Макет.ПолучитьОбласть("Строка3П");
	ОбластьПодвал3 		= Макет.ПолучитьОбласть("Подвал3");
	ОбластьШапка4 		= Макет.ПолучитьОбласть("Шапка4");
	ОбластьСтрока4 		= Макет.ПолучитьОбласть("Строка4");
	ОбластьПодвал4 		= Макет.ПолучитьОбласть("Подвал4");
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент1.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент2 = Новый ТабличныйДокумент;
			ТабличныйДокумент3 = Новый ТабличныйДокумент;
			ТабличныйДокумент4 = Новый ТабличныйДокумент;
			//ТабличныйДокумент2.ВывестиГоризонтальныйРазделительСтраниц();
			//ТабличныйДокумент3.ВывестиГоризонтальныйРазделительСтраниц();
			//ТабличныйДокумент4.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
    	НомерСтрокиНачало1 = ТабличныйДокумент1.ВысотаТаблицы + 1;
		//НомерСтрокиНачало2 = ТабличныйДокумент2.ВысотаТаблицы + 1;
		//НомерСтрокиНачало3 = ТабличныйДокумент3.ВысотаТаблицы + 1;
		//НомерСтрокиНачало4 = ТабличныйДокумент4.ВысотаТаблицы + 1;
		
		// подготовим нижнюю часть второй страницы. чтобы проверять что она полностью умещается
		МассивСтр2 = Новый Массив;
		
		МассивСтр2.Добавить(ОбластьПодвал2_1);	
		СтруктураОбластьКомиссия = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии");
		СтруктураОбластьКомиссия.пСтатусЧленаКомиссии		= "Председатель комиссии";
		СтруктураОбластьКомиссия.пДолжностьЧленаКомиссии	= ВыборкаШапка.ДолжностьПредседателяКомиссии;
		СтруктураОбластьКомиссия.пЧленКомиссии				= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
																											ВыборкаШапка.ФамилияПредседателяКомиссии,
																											ВыборкаШапка.ИмяПредседателяКомиссии,
																											ВыборкаШапка.ОтчествоПредседателяКомиссии));
		ОбластьКомиссия.Параметры.Заполнить(СтруктураОбластьКомиссия);																									
		МассивСтр2.Добавить(ОбластьКомиссия);	
		пСтатусЧленаКомиссии = "Члены комиссии";
		ВыборкаКомиссия = ВыборкаШапка.СоставКомиссии.Выбрать();
		Пока ВыборкаКомиссия.Следующий() Цикл
			ОбластьКомиссия 	= Макет.ПолучитьОбласть("Комиссия");
			СтруктураОбластьКомиссия = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии");
			СтруктураОбластьКомиссия.пСтатусЧленаКомиссии		= пСтатусЧленаКомиссии;
			СтруктураОбластьКомиссия.пДолжностьЧленаКомиссии	= ВыборкаКомиссия.ДолжностьЧленаКомиссии;
			СтруктураОбластьКомиссия.пЧленКомиссии				= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
																											ВыборкаКомиссия.ФамилияЧленаКомиссии,
																											ВыборкаКомиссия.ИмяЧленаКомиссии,
																											ВыборкаКомиссия.ОтчествоЧленаКомиссии));
			ОбластьКомиссия.Параметры.Заполнить(СтруктураОбластьКомиссия);
			МассивСтр2.Добавить(ОбластьКомиссия);
			пСтатусЧленаКомиссии = "";
		КонецЦикла;
		
		ОбластьПодвал2_2.Параметры.Заполнить(ВыборкаШапка);
		МассивСтр2.Добавить(ОбластьПодвал2_2);
		
		
		
		// --------------- 1 страница------------------
		
		ОбластьШапка1.Параметры.Заполнить(ВыборкаШапка);
		Руководитель = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(ВыборкаШапка.Организация, 
																					Перечисления.ОтветственныеЛицаОрганизаций.Руководитель,
																					ВыборкаШапка.пДата);
		РуководительФИО = Справочники.Сотрудники.ФамилияИО(Руководитель.ОтветственноеЛицоСсылка, Истина, ВыборкаШапка.пДата);
		СтруктураОбластьШапка1 = Новый Структура("РукДолжнПолучателя,РукПолучателя,АдресПолучателя,РеквПолучателя,пНомер");
		СтруктураОбластьШапка1.РукДолжнПолучателя 	= Руководитель.ДолжностьПредставление;
		СтруктураОбластьШапка1.РукПолучателя		= РуководительФИО;
																						
		АдресПолучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаШапка.Организация,
															Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ТелефонПолучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаШапка.Организация,
															Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		СтруктураОбластьШапка1.АдресПолучателя = АдресПолучателя + " тел.: " + ТелефонПолучателя;
		
		РеквПолучателя = "";
		Если ЗначениеЗаполнено(ВыборкаШапка.РеквизитыЛицевогоСчета) Тогда
			РеквизитыПлательщика = Новый Структура("НомерСчетаПлательщика, НаименованиеБанкаПлательщика, БикБанкаПлательщика, СчетБанкаПлательщика",
													"СчетНомер", "Банк", "БИК", "КоррСчет");
			ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(ВыборкаШапка.ЛицевойСчет,
																					ВыборкаШапка.РеквизитыЛицевогоСчета,	
																					РеквизитыПлательщика);
			ПлательщикБанковскийСчет 	= РеквизитыПлательщика.НомерСчетаПлательщика;
			ПлательщикНаименованиеБанка = РеквизитыПлательщика.НаименованиеБанкаПлательщика;
			ПлательщикБИКБанка 			= РеквизитыПлательщика.БикБанкаПлательщика;
			ПлательщикКорСчетБанка 		= РеквизитыПлательщика.СчетБанкаПлательщика;
			
			РеквПолучателя = "счет № " + ПлательщикБанковскийСчет + " в " + ПлательщикНаименованиеБанка 
							+ ", БИК " + ПлательщикБИКБанка + ", кор.счет " + ПлательщикКорСчетБанка;
		КонецЕсли;
		СтруктураОбластьШапка1.РеквПолучателя = РеквПолучателя;
		СтруктураОбластьШапка1.пНомер = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаШапка.Ссылка,ВыборкаШапка.пНомер);
		ОбластьШапка1.Параметры.Заполнить(СтруктураОбластьШапка1);
		ТабличныйДокумент1.Вывести(ОбластьШапка1);
		
		// --------------- 2,3,4 страница------------------
		ТабличныйДокумент2.Вывести(ОбластьШапка2);
		ТабличныйДокумент3.Вывести(ОбластьШапка3);
		ТабличныйДокумент4.Вывести(ОбластьШапка4);
		
		
		ВыборкаСтроки = ВыборкаШапка.ОсновныеСредства.Выбрать();
		КоличествоСтрок = ВыборкаСтроки.Количество();
		
		ИтогЦенаПродажи		= 0;
		ИтогНачСтоимость	= 0;
		
		Пока ВыборкаСтроки.Следующий() Цикл
			
			ОбластьСтрока2.Параметры.Заполнить(ВыборкаСтроки);

			Если ЗначениеЗаполнено(ВыборкаСтроки.АмортизационнаяГруппа) Тогда
				СтруктураОбластьСтрока2 = Новый Структура;
				СтруктураОбластьСтрока2.Вставить("НомерАмортГруппы", Перечисления.АмортизационныеГруппы.Индекс(ВыборкаСтроки.АмортизационнаяГруппа)+1);
				ОбластьСтрока2.Параметры.Заполнить(СтруктураОбластьСтрока2);	
			КонецЕсли;
			ОбластьСтрока3.Параметры.Заполнить(ВыборкаСтроки);
			ОбластьСтрока4.Параметры.Заполнить(ВыборкаСтроки);
			Если ВыборкаСтроки.НомСтр = КоличествоСтрок Тогда
				// проверим вывод строки и полного подвала
				МассивСтр2.Добавить(ОбластьСтрока2);
				Если Не ТабличныйДокумент2.ПроверитьВывод(МассивСтр2) Тогда
					
					ТабличныйДокумент2.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент3.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент4.ВывестиГоризонтальныйРазделительСтраниц();
					
					ТабличныйДокумент2.Вывести(ОбластьШапка2);
					ТабличныйДокумент3.Вывести(ОбластьШапка3);
					ТабличныйДокумент4.Вывести(ОбластьШапка4);
					
				КонецЕсли;
				МассивСтр2.Удалить(МассивСтр2.ВГраница());
			
			ИначеЕсли НЕ ТабличныйДокумент2.ПроверитьВывод(ОбластьСтрока2) Тогда
				ТабличныйДокумент2.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент3.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент4.ВывестиГоризонтальныйРазделительСтраниц();
				
				ТабличныйДокумент2.Вывести(ОбластьШапка2);
				ТабличныйДокумент3.Вывести(ОбластьШапка3);
				ТабличныйДокумент4.Вывести(ОбластьШапка4);
				
			КонецЕсли;
			ТабличныйДокумент2.Вывести(ОбластьСтрока2);
			ТабличныйДокумент3.Вывести(ОбластьСтрока3);
			ТабличныйДокумент4.Вывести(ОбластьСтрока4);
			
		КонецЦикла;
		
		Для каждого ТекСтрМассива Из МассивСтр2 Цикл
		
			ТабличныйДокумент2.Вывести(ТекСтрМассива);	
		
		КонецЦикла; 
		
		ТабличныйДокумент3.Вывести(ОбластьПодвал3);
		
		
		МОЛ = ВыборкаШапка.МОЛ;
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", МОЛ, ВыборкаШапка.пДата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураОбластьПодвал4 = Новый Структура("ДолжностьМОЛ,ФИОМОЛ,ТабНомМОЛ,ГлавБухПолучателя");
		СтруктураОбластьПодвал4.ДолжностьМОЛ	= ДанныеСотрудника.Должность;
		СтруктураОбластьПодвал4.ФИОМОЛ			= КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника);
		СтруктураОбластьПодвал4.ТабНомМОЛ		= ВыборкаШапка.ТабНомМОЛ;
		
		ГлБухгалтер = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(ВыборкаШапка.Организация,
																					Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер,
																					ВыборкаШапка.пДата);
		ГлБухгалтерФИО = Справочники.Сотрудники.ФамилияИО(ГлБухгалтер.ОтветственноеЛицоСсылка, Истина, ВыборкаШапка.пДата);											
		СтруктураОбластьПодвал4.ГлавБухПолучателя	= ГлБухгалтерФИО;
		ОбластьПодвал4.Параметры.Заполнить(СтруктураОбластьПодвал4);
		ТабличныйДокумент4.Вывести(ОбластьПодвал4);
		
		ТабличныйДокумент1.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокумент1.Вывести(ТабличныйДокумент2);
		ТабличныйДокумент1.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокумент1.Вывести(ТабличныйДокумент3);
		ТабличныйДокумент1.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокумент1.Вывести(ТабличныйДокумент4);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент1, 
		                                               НомерСтрокиНачало1, ОбъектыПечати, ВыборкаШапка.Ссылка);
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент2, 
		//											   НомерСтрокиНачало2, ОбъектыПечати, ВыборкаШапка.Ссылка);
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент3, 
		//											   НомерСтрокиНачало3, ОбъектыПечати, ВыборкаШапка.Ссылка);
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент4, 
		//											   НомерСтрокиНачало4, ОбъектыПечати, ВыборкаШапка.Ссылка);
	КонецЦикла;
		
					   
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
