#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидПоступления = Перечисления.ВидыОперацийИК.Поступление Тогда
		Отказ = ОсновноеСредствоУжеПринятоКУчету();
	Иначе
		Отказ = ОсновноеСредствоУжеВозвращено();
	КонецЕсли;
	Если Отказ Тогда 
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		ИЛИ НЕ БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("108.00").УчетПоПодразделениям Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Подразделение");
	КонецЕсли;
	
	Если ВидПоступления = Перечисления.ВидыОперацийИК.ВозвратАренда
		ИЛИ ВидПоступления = Перечисления.ВидыОперацийИК.ВозвратБезвозмездноеПользование Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПервоначальнаяСтоимость");
		МассивНепроверяемыхРеквизитов.Добавить("Количество");
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользования");
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокПогашенияСтоимости");
		СтоимостьНеПогашается = Истина;
		
	Иначе
		УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(Организация, Дата);
		Если НЕ УчетнаяПолитика.НачислятьАмортизациюИмуществаКазны Тогда
			МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользования");
		КонецЕсли;
		СтоимостьНеПогашается = Ложь;
		
	КонецЕсли;
	УправлениеОсновнымиСредствами.ДобавитьНепроверяемыеРеквизитыСчетаЗатрат(СтоимостьНеПогашается,
		ПорядокПогашенияСтоимости, СчетУчетаЗатрат, МассивНепроверяемыхРеквизитов);

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	УправлениеОсновнымиСредствами.ОчиститьНеиспользуемыеРеквизитыПринятияКУчету(ПорядокПогашенияСтоимости, СпособНачисленияАмортизации, НачислятьАмортизацию, СчетУчетаЗатрат,
														КЭКЗатрат, КПСЗатрат, ПодразделениеЗатрат, СубконтоЗатрат1, СубконтоЗатрат2, СубконтоЗатрат3);
	
	СуммаДокумента = ОсновныеСредства.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Перем Основание;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("Основание", Основание);
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ИнвентаризацияИК") Тогда
			СтандартнаяОбработка = Ложь;
			Документы.ИнвентаризацияИК.ВводНаОсновании_ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ОсновноеСредствоУжеПринятоКУчету()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОсДокумента.НомерСтроки,
	               |	ОсДокумента.ОсновноеСредство,
	               |	ОсДокумента.ИнвентарныйНомер
	               |ПОМЕСТИТЬ ОСДокумента
	               |ИЗ
	               |	&ОСДокумента КАК ОсДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СобытияОС.Событие,
	               |	СобытияОС.ДатаСобытия,
	               |	ВЫБОР
	               |		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	               |			ТОГДА 1
	               |		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК Поле1,
	               |	СобытияОС.ОсновноеСредство,
	               |	СобытияОС.ИнвНомер,
	               |	СобытияОС.Регистратор,
	               |	ПРЕДСТАВЛЕНИЕ(СобытияОС.Регистратор) КАК ПредставлениеРегистратора
	               |ПОМЕСТИТЬ СобытияОС
	               |ИЗ
	               |	РегистрСведений.СобытияОС КАК СобытияОС
	               |ГДЕ
	               |	СобытияОС.Организация = &Организация
	               |	И (СобытияОС.ОсновноеСредство, СобытияОС.ИнвНомер) В
	               |			(ВЫБРАТЬ
	               |				ОСДокумента.ОсновноеСредство,
	               |				ОСДокумента.ИнвентарныйНомер
	               |			ИЗ
	               |				ОСДокумента КАК ОСДокумента)";
	Если ЭтотОбъект.ЭтоНовый() Тогда
		Запрос.Текст = Запрос.Текст + "
	               |	И СобытияОС.Период <= &Период";
		Запрос.УстановитьПараметр("Период", 		КонецДня(Дата));
	Иначе
		Запрос.Текст = Запрос.Текст + "
	               |	И СобытияОС.МоментВремени <= &МоментВремени
	               |	И СобытияОС.Регистратор <> &Регистратор";
		Запрос.УстановитьПараметр("МоментВремени",	МоментВремени());
		Запрос.УстановитьПараметр("Регистратор",	Ссылка);
	КонецЕсли;	
	Запрос.Текст = Запрос.Текст + "
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОСДокумента.НомерСтроки,
	               |	ОСДокумента.ОсновноеСредство,
	               |	ОСДокумента.ИнвентарныйНомер,
	               |	ПРЕДСТАВЛЕНИЕ(СобытияОС.Событие) КАК Событие,
	               |	СобытияОС.ДатаСобытия,
	               |	СобытияОС.Поле1,
	               |	СобытияОС.Регистратор,
	               |	СобытияОС.ПредставлениеРегистратора
	               |ИЗ
	               |	ОСДокумента КАК ОСДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СобытияОС.Событие КАК Событие,
	               |			СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	               |			СобытияОС.ИнвНомер КАК ИнвНомер,
	               |			СобытияОС.Поле1 КАК Поле1,
	               |			СобытияОС.ДатаСобытия КАК ДатаСобытия,
	               |			СобытияОС.Регистратор КАК Регистратор,
	               |			СобытияОС.ПредставлениеРегистратора КАК ПредставлениеРегистратора
	               |		ИЗ
	               |			СобытияОС КАК СобытияОС
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	               |					СобытияОС.ИнвНомер КАК ИнвНомер,
	               |					СобытияОС.Поле1 КАК Поле1,
	               |					СобытияОС.ДатаСобытия КАК ДатаСобытия,
	               |					МАКСИМУМ(СобытияОС.Регистратор) КАК Регистратор
	               |				ИЗ
	               |					СобытияОС КАК СобытияОС
	               |						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |							СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	               |							СобытияОС.ИнвНомер КАК ИнвНомер,
	               |							СобытияОС.Поле1 КАК Поле1,
	               |							МАКСИМУМ(СобытияОС.ДатаСобытия) КАК ДатаСобытия
	               |						ИЗ
	               |							СобытияОС КАК СобытияОС
	               |								ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |									СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	               |									СобытияОС.ИнвНомер КАК ИнвНомер,
	               |									МИНИМУМ(СобытияОС.Поле1) КАК Поле1
	               |								ИЗ
	               |									СобытияОС КАК СобытияОС
	               |								
	               |								СГРУППИРОВАТЬ ПО
	               |									СобытияОС.ОсновноеСредство,
	               |									СобытияОС.ИнвНомер) КАК СобытияОС1
	               |								ПО СобытияОС.ОсновноеСредство = СобытияОС1.ОсновноеСредство
	               |									И СобытияОС.ИнвНомер = СобытияОС1.ИнвНомер
	               |									И СобытияОС.Поле1 = СобытияОС1.Поле1
	               |						
	               |						СГРУППИРОВАТЬ ПО
	               |							СобытияОС.ОсновноеСредство,
	               |							СобытияОС.ИнвНомер,
	               |							СобытияОС.Поле1) КАК СобытияОС1
	               |						ПО СобытияОС.ОсновноеСредство = СобытияОС1.ОсновноеСредство
	               |							И СобытияОС.ИнвНомер = СобытияОС1.ИнвНомер
	               |							И СобытияОС.Поле1 = СобытияОС1.Поле1
	               |							И СобытияОС.ДатаСобытия = СобытияОС1.ДатаСобытия
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					СобытияОС.ОсновноеСредство,
	               |					СобытияОС.ИнвНомер,
	               |					СобытияОС.Поле1,
	               |					СобытияОС.ДатаСобытия) КАК СобытияОС1
	               |				ПО СобытияОС.ОсновноеСредство = СобытияОС1.ОсновноеСредство
	               |					И СобытияОС.ИнвНомер = СобытияОС1.ИнвНомер
	               |					И СобытияОС.Поле1 = СобытияОС1.Поле1
	               |					И СобытияОС.ДатаСобытия = СобытияОС1.ДатаСобытия
	               |					И СобытияОС.Регистратор = СобытияОС1.Регистратор) КАК СобытияОС
	               |		ПО ОСДокумента.ОсновноеСредство = СобытияОС.ОсновноеСредство
	               |			И ОСДокумента.ИнвентарныйНомер = СобытияОС.ИнвНомер";
	
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ОСДокумента",		ОсновныеСредства.Выгрузить());
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.ИнвентарныйНомер) Тогда
				ТекстСообщения = НСтр("ru='Строка [НомерСтроки]. По выбранному инвентарному номеру уже произведено [ВидСобытияОС] документом [Регистратор]'");
				ВставляемыеПараметры = Новый Структура("ВидСобытияОС, Регистратор, НомерСтроки", Выборка.Событие, Выборка.ПредставлениеРегистратора, Выборка.НомерСтроки);
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстСообщения, ВставляемыеПараметры);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновныеСредства["+(Выборка.НомерСтроки-1)+"].ИнвентарныйНомер");
			Иначе
				ТекстСообщения = НСтр("ru='Строка [НомерСтроки]. По выбранному объекту уже произведено [ВидСобытияОС] документом [Регистратор]'");
				ВставляемыеПараметры = Новый Структура("ВидСобытияОС, Регистратор, НомерСтроки", Выборка.Событие, Выборка.ПредставлениеРегистратора, Выборка.НомерСтроки);
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстСообщения, ВставляемыеПараметры);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновныеСредства["+(Выборка.НомерСтроки-1)+"].ОсновноеСредство");
			КонецЕсли;
		КонецЦикла;
		Возврат Истина;
	КонецЕсли;
				
КонецФункции

Функция ОсновноеСредствоУжеВозвращено()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПринятиеКУчетуИКОсновныеСредства.НомерСтроки,
	               |	ПринятиеКУчетуИКОсновныеСредства.ОсновноеСредство,
	               |	ПринятиеКУчетуИКОсновныеСредства.ИнвентарныйНомер
	               |ПОМЕСТИТЬ ОСДокумента
	               |ИЗ
	               |	&ОСДокумента КАК ПринятиеКУчетуИКОсновныеСредства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СобытияОС.Период,
	               |	СобытияОС.Событие,
	               |	СобытияОС.ОсновноеСредство,
	               |	СобытияОС.ИнвНомер
	               |ПОМЕСТИТЬ ВсеСобытия
	               |ИЗ
	               |	РегистрСведений.СобытияОС КАК СобытияОС
	               |ГДЕ
	               |	СобытияОС.Организация = &Организация
	               |	И (СобытияОС.ОсновноеСредство, СобытияОС.ИнвНомер) В
	               |			(ВЫБРАТЬ
	               |				ОсДокумента.ОсновноеСредство,
	               |				ОсДокумента.ИнвентарныйНомер
	               |			ИЗ
	               |				ОСДокумента КАК ОсДокумента)
	               |	И СобытияОС.ДатаСобытия <= &Период
	               |	И СобытияОС.Событие В (&СобытиеПередача, &СобытиеВозврат)
	               |	И СобытияОС.Регистратор <> &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОСДокумента.НомерСтроки,
	               |	ОСДокумента.ОсновноеСредство,
	               |	ОСДокумента.ИнвентарныйНомер,
	               |	ОСДокумента.ДатаПередачи,
	               |	ОСДокумента.ДатаВозврата,
	               |	ИнвентарныеНомераОС.Представление КАК ПредставлениеИнвНомер,
	               |	ОсновныеСредства.Представление КАК ПредставлениеОС
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ОСДокумента.НомерСтроки КАК НомерСтроки,
	               |		ОСДокумента.ОсновноеСредство КАК ОсновноеСредство,
	               |		ОСДокумента.ИнвентарныйНомер КАК ИнвентарныйНомер,
	               |		Передачи.Период КАК ДатаПередачи,
	               |		Передачи.Период1 КАК ДатаВозврата
	               |	ИЗ
	               |		ОСДокумента КАК ОСДокумента
	               |			Левое СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				Передача.ОсновноеСредство КАК ОсновноеСредство,
	               |				Передача.ИнвНомер КАК ИнвНомер,
	               |				Передача.Период КАК Период,
	               |				Возврат.Период КАК Период1
	               |			ИЗ
	               |				(ВЫБРАТЬ
	               |					ВсеСобытия.ОсновноеСредство КАК ОсновноеСредство,
	               |					ВсеСобытия.ИнвНомер КАК ИнвНомер,
	               |					МАКСИМУМ(ВсеСобытия.Период) КАК Период
	               |				ИЗ
	               |					ВсеСобытия КАК ВсеСобытия
	               |				ГДЕ
	               |					ВсеСобытия.Событие = &СобытиеПередача
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ВсеСобытия.ОсновноеСредство,
	               |					ВсеСобытия.ИнвНомер) КАК Передача
	               |					ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |						МАКСИМУМ(ВсеСобытия.Период) КАК Период,
	               |						ВсеСобытия.ОсновноеСредство КАК ОсновноеСредство,
	               |						ВсеСобытия.ИнвНомер КАК ИнвНомер
	               |					ИЗ
	               |						ВсеСобытия КАК ВсеСобытия
	               |					ГДЕ
	               |						ВсеСобытия.Событие = &СобытиеВозврат
	               |					
	               |					СГРУППИРОВАТЬ ПО
	               |						ВсеСобытия.ОсновноеСредство,
	               |						ВсеСобытия.ИнвНомер) КАК Возврат
	               |					ПО Передача.ОсновноеСредство = Возврат.ОсновноеСредство
	               |						И Передача.ИнвНомер = Возврат.ИнвНомер
	               |						И Передача.Период < Возврат.Период
	               |			ГДЕ
	               |				Передача.Период ЕСТЬ НЕ NULL ) КАК Передачи
	               |			ПО ОСДокумента.ОсновноеСредство = Передачи.ОсновноеСредство
	               |				И ОСДокумента.ИнвентарныйНомер = Передачи.ИнвНомер) КАК ОСДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	               |		ПО ОСДокумента.ОсновноеСредство = ОсновныеСредства.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	               |		ПО ОСДокумента.ИнвентарныйНомер = ИнвентарныеНомераОС.Ссылка
	               |			И ОСДокумента.ОсновноеСредство = ИнвентарныеНомераОС.ОС";
	Запрос.УстановитьПараметр("Период", 			?(Ссылка.Пустая(), КонецДня(Дата), Дата));
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("ОСДокумента",		ОсновныеСредства.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Если ВидПоступления = Перечисления.ВидыОперацийИК.ВозвратАренда Тогда
		Запрос.УстановитьПараметр("СобытиеПередача",	Перечисления.ВидыСобытийОС.СдачаВАренду);
		Запрос.УстановитьПараметр("СобытиеВозврат", 	Перечисления.ВидыСобытийОС.ВозвратИзАренды);
		ТекстСообщения1 = НСтр("ru='Строка [НомерСтроки]. Основное средство [ОС], инв. № [ИнвНом] не было передано в аренду'");
		ТекстСообщения2 = НСтр("ru='Строка [НомерСтроки]. Основное средство [ОС], инв. № [ИнвНом] уже возвращено из аренды'");
	ИначеЕсли ВидПоступления = Перечисления.ВидыОперацийИК.ВозвратБезвозмездноеПользование Тогда
		Запрос.УстановитьПараметр("СобытиеПередача", 	Перечисления.ВидыСобытийОС.ПередачаВБезвозмездноеПользование);
		Запрос.УстановитьПараметр("СобытиеВозврат", 	Перечисления.ВидыСобытийОС.ВозвратИзБезвозмездногоПользования);
		ТекстСообщения1 = НСтр("ru='Строка [НомерСтроки]. Основное средство [ОС], инв. № [ИнвНом] не было передано в безвозмездное пользование'");
		ТекстСообщения2 = НСтр("ru='Строка [НомерСтроки]. Основное средство [ОС], инв. № [ИнвНом] уже возвращено из безвозмездного пользоваения'");
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.ДатаПередачи) Тогда
			ПараметрыСообщения = Новый Структура("НомерСтроки, ОС, ИнвНом", Выборка.НомерСтроки, Выборка.ПредставлениеОС, Выборка.ПредставлениеИнвНомер);
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстСообщения1, ПараметрыСообщения),,
																"Объект.ОсновныеСредства["+(Выборка.НомерСтроки-1)+"].ОсновноеСредство");
			Результат = Истина;
		ИначеЕсли ЗначениеЗаполнено(Выборка.ДАтаВозврата) Тогда
			ПараметрыСообщения = Новый Структура("НомерСтроки, ОС, ИнвНом", Выборка.НомерСтроки, Выборка.ПредставлениеОС, Выборка.ПредставлениеИнвНомер);
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстСообщения2, ПараметрыСообщения,,
																"Объект.ОсновныеСредства["+(Выборка.НомерСтроки-1)+"].ОсновноеСредство"));
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

#КонецЕсли