
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
	Данные = ЗаписьОбъект.Макет.Получить();
	
	Если ТипЗнч(Данные) <> Тип("ТаблицаЗначений") Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого КолонкаИсходнойТаблицы из Данные.Колонки Цикл 
		
		ОписаниеКолонки = КолонкиТаблицы.Добавить();
		ОписаниеКолонки.ИмяКолонки = КолонкаИсходнойТаблицы.Имя;
		ОписаниеКолонки.ТипЗначения = КолонкаИсходнойТаблицы.ТипЗначения;
		
	КонецЦикла;	
	
	ОбновитьКолонкиИзОписания();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Данные, ТаблицаДанных);
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Макет = Новый ХранилищеЗначения(ТаблицаДанных.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	//Задвоение имен
	КоллекцияДляПроверки = КолонкиТаблицы.Выгрузить();
	КоллекцияДляПроверки.Колонки.Добавить("Счетчик");
	КоллекцияДляПроверки.ЗаполнитьЗначения(1,"Счетчик");
	КоллекцияДляПроверки.Свернуть("ИмяКолонки","Счетчик");
	
	Для Каждого СтрокаКоллнецииДляПроверки из КоллекцияДляПроверки Цикл 
		Если СтрокаКоллнецииДляПроверки.Счетчик = 1 Тогда 
			Продолжить;
		КонецЕсли;	
		
		Отказ = Истина;
		ЗадвоенныеСтроки = КолонкиТаблицы.НайтиСтроки(Новый Структура("ИмяКолонки",СтрокаКоллнецииДляПроверки.ИмяКолонки));
		
		Для Каждого ЗадвоеннаяСтрока из ЗадвоенныеСтроки Цикл 
			
			Шаблон = НСтр(
			"ru = 'Существует несколько колонок с одинаковым именем ""%1"".'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,СтрокаКоллнецииДляПроверки.ИмяКолонки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("КолонкиТаблицы",КолонкиТаблицы.Индекс(ЗадвоеннаяСтрока)+1,"ИмяКолонки"));
			
		КонецЦикла;
		
	КонецЦикла;	
	
	//соответствие требованиям к именам переменных
	Для Каждого ОписаниеКолонки из КолонкиТаблицы Цикл 
		РезультатПроверки = БюджетнаяОтчетностьКлиентСервер.СтрокаСоответствуетТребованиямКИменамПеременных(ОписаниеКолонки.ИмяКолонки);
		
		Если РезультатПроверки.Результат Тогда 
			Продолжить;
		КонецЕсли;
		Отказ = Истина;
		
		Шаблон = НСтр(
		"ru = 'Имя колонки не соответствует требованиям к именам переменных. 
		|Причина: %1'");
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,РезультатПроверки.Причина);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,,
		ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("КолонкиТаблицы",КолонкиТаблицы.Индекс(ОписаниеКолонки)+1,"ИмяКолонки"));
		
		
	КонецЦикла;
	
	//заполнен тип значения
	Для Каждого ОписаниеКолонки из КолонкиТаблицы Цикл 
		
		Если ЗначениеЗаполнено(ОписаниеКолонки.ТипЗначения.Типы()) Тогда 
			Продолжить;
		КонецЕсли;	
		
		Отказ = Истина;
		
		Шаблон = НСтр(
		"ru = 'Для колонки ""%1"" не заполнен тип значения.'");
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ОписаниеКолонки.ИмяКолонки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,,
		ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("КолонкиТаблицы",КолонкиТаблицы.Индекс(ОписаниеКолонки)+1,"ТипЗначения"));
		
	КонецЦикла;	
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаСтраницаСтроки Тогда 
		
		Если Не ПроверитьЗаполнение() Тогда 
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаКолонки;
			Возврат;
		КонецЕсли;	
		
		
		ОбновитьКолонкиИзОписания();
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОбновитьКолонкиИзОписания()
	
	//удаялем страые элементы 
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого ЭлементФормы из Элементы Цикл 
		
		Если Лев(ЭлементФормы.Имя,20) <> "ТаблицаДанныхКолонка" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ЭлементФормы.Вид <> ВидПоляФормы.ПолеВвода Тогда 
			Продолжить;
		КонецЕсли;
		
		УдаляемыеЭлементы.Добавить(ЭлементФормы);
		
	КонецЦикла;	
	Для Каждого ЭлементФормы из УдаляемыеЭлементы Цикл 
		Элементы.Удалить(ЭлементФормы);
	КонецЦикла;	
	
	//Разбираемся с реквизитами 
	ТекущиеКолонки = ПолучитьРеквизиты("ТаблицаДанных");
	
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;
	
	Для Каждого ТекущаяКолонка из ТекущиеКолонки Цикл 
		
		УдаляемыеРеквизиты.Добавить(ТекущаяКолонка.Путь+"."+ТекущаяКолонка.Имя);
		
	КонецЦикла; 	
	
	ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ТекущиеКолонки);
	Для Каждого ОписаниеКолонки из КолонкиТаблицы Цикл
		
		СоздатьНовую = Истина;
		Для Каждого ПроверяемаяКолонка из ТекущиеКолонки Цикл 
			
			Если ПроверяемаяКолонка.Имя <> ОписаниеКолонки.ИмяКолонки Тогда
				Продолжить; 
				//это не так колонка
			ИначеЕсли не ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(ПроверяемаяКолонка.ТипЗначения.Типы(), ОписаниеКолонки.ТипЗначения.Типы())
				Или ПроверяемаяКолонка.ТипЗначения.КвалификаторыДаты <> ОписаниеКолонки.ТипЗначения.КвалификаторыДаты
				Или ПроверяемаяКолонка.ТипЗначения.КвалификаторыДвоичныхДанных <> ОписаниеКолонки.ТипЗначения.КвалификаторыДвоичныхДанных 
				Или ПроверяемаяКолонка.ТипЗначения.КвалификаторыСтроки <> ОписаниеКолонки.ТипЗначения.КвалификаторыСтроки 
				Или ПроверяемаяКолонка.ТипЗначения.КвалификаторыЧисла <> ОписаниеКолонки.ТипЗначения.КвалификаторыЧисла Тогда 
				
				ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(УдаляемыеРеквизиты,ПроверяемаяКолонка.Путь+"."+ПроверяемаяКолонка.Имя);
				//поменялся тип пересоздаем
			Иначе 
				
				ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(УдаляемыеРеквизиты,ПроверяемаяКолонка.Путь+"."+ПроверяемаяКолонка.Имя);
				СоздатьНовую = Ложь;
				//Оставляем как есть
			КонецЕсли;	
				
				
		КонецЦикла;	
		
		Если СоздатьНовую Тогда 
			
			НовыйРеквизит = Новый РеквизитФормы(ОписаниеКолонки.ИмяКолонки, ОписаниеКолонки.ТипЗначения, "ТаблицаДанных",, Истина);
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты,УдаляемыеРеквизиты);
	
	//Создаем новые элементы
	ТекущиеКолонки = ПолучитьРеквизиты("ТаблицаДанных");
	
	Для Каждого КолонкаДанных из ТекущиеКолонки Цикл 
		
		НовыйЭлемент = Элементы.Вставить("ТаблицаДанныхКолонка"+КолонкаДанных.Имя, Тип("ПолеФормы"), Элементы.ТаблицаДанных);
		НовыйЭлемент.ПутьКДанным = "ТаблицаДанных."+КолонкаДанных.Имя;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
	КонецЦикла;	
	
	
	//выбираем страницу по наличию колонок
	Если ЗначениеЗаполнено(ТекущиеКолонки) Тогда 
		Элементы.ГруппаСтраницыСтрок.ТекущаяСтраница = Элементы.ГруппаСтраницаОсновная;
	Иначе 
		Элементы.ГруппаСтраницыСтрок.ТекущаяСтраница = Элементы.ГруппаСтраницаПустаяТаблица;
	КонецЕсли;	
	
КонецПроцедуры	

