#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

Функция СчетаТекущегоГода(ОбрабатыватьСчетаПлановыхПериодов, НаДату) Экспорт
	
	Если ОбрабатыватьСчетаПлановыхПериодов Тогда
		
		Возврат БухгалтерскийУчет.СписокСчетов("501.10,502.10,503.10,504.10,506.10,507.10,508.10,501.20,502.20,503.20,504.20,506.20,507.20,508.20,501.30,502.30,503.30,504.30,506.30,507.30,508.30,501.40,502.40,503.40,504.40,506.40,507.40,508.40,ПОФ", НаДату);
	
	Иначе	

		Возврат БухгалтерскийУчет.СписокСчетов("501.10,502.10,503.10,504.10,506.10,507.10,508.10,ПОФ",  НаДату);
	
	КонецЕсли
	
КонецФункции // СчетаТекущегоГода() 

Функция СчетаОбязательств(ОбрабатыватьСчетаПлановыхПериодов, НаДату) Экспорт
	
	Если ОбрабатыватьСчетаПлановыхПериодов Тогда
		
		Возврат БухгалтерскийУчет.СписокСчетов("502.10,502.20,502.30,502.40", НаДату);
	
	Иначе	

		Возврат БухгалтерскийУчет.СписокСчетов("502.10",  НаДату);
	
	КонецЕсли
	
КонецФункции

Функция СчетаПлановогоПериода(ФинансовыйГод) Экспорт
	
	НаДату = Дата(Год(ФинансовыйГод) + 1, 1,1);
		
	Возврат БухгалтерскийУчет.СписокСчетов("501.20,503.20,504.20,506.20,507.20,508.20,501.30,503.30,504.30,506.30,507.30,508.30,501.40,503.40,504.40,506.40,507.40,508.40", НаДату);

КонецФункции

Функция СчетаПерегистраци(ФинансовыйГод) Экспорт
	
	НаДату = Дата(Год(ФинансовыйГод) + 1, 1,1);
		
	Возврат БухгалтерскийУчет.СписокСчетов("501.10,503.10,504.10,506.10,507.10,508.10,501.20,503.20,504.20,506.20,507.20,508.20,501.30,503.30,504.30,506.30,507.30,508.30", НаДату);

КонецФункции

Функция СоответствиеСчетов(СчетаКлючи, СчетаЗначения) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Счет
	|ПОМЕСТИТЬ СчетаКлючи
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&СчетаКлючи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Счет
	|ПОМЕСТИТЬ СчетаЗначения
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&СчетаЗначения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаКлючи.Счет КАК СчетКлюч,
	|	СчетаЗначения.Счет КАК СчетЗначение
	|ИЗ
	|	СчетаКлючи КАК СчетаКлючи
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаЗначения КАК СчетаЗначения
	|		ПО (ПОДСТРОКА(СчетаКлючи.Счет.Код, 1, 4) + ВЫБОР
	|				КОГДА ПОДСТРОКА(СчетаКлючи.Счет.Код, 5, 1) = ""2""
	|					ТОГДА ""1""
	|				КОГДА ПОДСТРОКА(СчетаКлючи.Счет.Код, 5, 1) = ""3""
	|					ТОГДА ""2""
	|				КОГДА ПОДСТРОКА(СчетаКлючи.Счет.Код, 5, 1) = ""4""
	|					ТОГДА ""3""
	|				ИНАЧЕ ""0""
	|			КОНЕЦ + ПОДСТРОКА(СчетаКлючи.Счет.Код, 6, 1) = СчетаЗначения.Счет.Код)");
	
	Запрос.УстановитьПараметр("СчетаКлючи", СчетаКлючи);
	Запрос.УстановитьПараметр("СчетаЗначения", СчетаЗначения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СоответствиеСчетов = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		  СоответствиеСчетов.Вставить(Выборка.СчетКлюч, Выборка.СчетЗначение);
		
	КонецЦикла;	

	Возврат СоответствиеСчетов; 

КонецФункции

	
Функция ВыполнитьПроведение(ДокументОбъект, ТиповаяОперация, ДополнительныеРеквизиты, Отказ) Экспорт

КонецФункции	

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
