#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет регистр данными из макета (табличного документа).
//
// Параметры:
//  ИмяМакета - ТабличныйДокумент, либо Строка - имя макета, поставляемого в составе конфигурации.
// 
// Возвращаемое значение:
//  Количество загруженных записей регистра.
//
Функция ЗагрузитьИзМакета(ИмяМакета) Экспорт
	
	Если ТипЗнч(ИмяМакета) = Тип("ТабличныйДокумент") Тогда
		Макет = ИмяМакета;
	Иначе
		Макет = ПолучитьМакет(ИмяМакета);
	КонецЕсли;
	
	ОбластьПериод = Макет.ПолучитьОбласть("Период");
	ОбластьВидНалогаИлиПлатежа = Макет.ПолучитьОбласть("ВидНалогаИлиПлатежа");
	ОбластьСрокИсполнения = Макет.ПолучитьОбласть("СрокИсполнения");
	ОбластьСрокИсполнения2 = Макет.ПолучитьОбласть("СрокИсполнения2");
	ОбластьСрокИсполнения3 = Макет.ПолучитьОбласть("СрокИсполнения3");
	
	НаборЗаписей = РегистрыСведений.ПредельныеСрокиИсполненияПоПлатежамВБюджеты.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	СуществующиеЗаписи = НаборЗаписей.Выгрузить();
	КоличествоЗаписейДо = НаборЗаписей.Количество();
	
	НомерСтроки = 1;
	
	Пока (Истина) Цикл
		
		ПериодТекст = ОбластьПериод.Область(НомерСтроки, 1).Текст;
		ВидНалогаИлиПлатежаТекст = СокрЛП(ОбластьВидНалогаИлиПлатежа.Область(НомерСтроки, 1).Текст);
		СрокИсполненияТекст = ОбластьСрокИсполнения.Область(НомерСтроки, 1).Текст;
		СрокИсполнения2Текст = ОбластьСрокИсполнения2.Область(НомерСтроки, 1).Текст;
		СрокИсполнения3Текст = ОбластьСрокИсполнения3.Область(НомерСтроки, 1).Текст;
		Если НЕ ЗначениеЗаполнено(ПериодТекст)
			ИЛИ НЕ ЗначениеЗаполнено(ВидНалогаИлиПлатежаТекст)
			ИЛИ НЕ ЗначениеЗаполнено(СрокИсполненияТекст) Тогда
			Прервать;
		КонецЕсли;
		
		Период = Дата( Сред(ПериодТекст, 7, 4), // Год.
					Сред(ПериодТекст, 4, 2), // Месяц.
					Сред(ПериодТекст, 1, 2) ); // День.
		
		СрокИсполнения = Дата( Сред(СрокИсполненияТекст, 7, 4), // Год.
					Сред(СрокИсполненияТекст, 4, 2), // Месяц.
					Сред(СрокИсполненияТекст, 1, 2) ); // День.
		
		Если ЗначениеЗаполнено(СрокИсполнения2Текст) Тогда
			СрокИсполнения2 = Дата( Сред(СрокИсполнения2Текст, 7, 4), // Год.
						Сред(СрокИсполнения2Текст, 4, 2), // Месяц.
						Сред(СрокИсполнения2Текст, 1, 2) ); // День.
		Иначе
			СрокИсполнения2 = Дата(1, 1, 1);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СрокИсполнения3Текст) Тогда
			СрокИсполнения3 = Дата( Сред(СрокИсполнения3Текст, 7, 4), // Год.
						Сред(СрокИсполнения3Текст, 4, 2), // Месяц.
						Сред(СрокИсполнения3Текст, 1, 2) ); // День.
		Иначе
			СрокИсполнения2 = Дата(1, 1, 1);
		КонецЕсли;
		
		ЭтоНастройкаДляГруппыНалоговИПлатежей = (Прав(ВидНалогаИлиПлатежаТекст, 1) = "*");
		Если ЭтоНастройкаДляГруппыНалоговИПлатежей Тогда
			
			Выборка = Справочники.ВидыНалоговИПлатежей.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ШаблонИмени = Лев(ВидНалогаИлиПлатежаТекст, СтрДлина(ВидНалогаИлиПлатежаТекст) - 1); // Убираем финальную звездочку (*).
				Если Лев(Выборка.ИмяПредопределенныхДанных, СтрДлина(ШаблонИмени)) = ШаблонИмени Тогда
					ДобавитьЗаписьВРегистрНастроек(НаборЗаписей, СуществующиеЗаписи,
						Период, Выборка.Ссылка, СрокИсполнения, СрокИсполнения2, СрокИсполнения3)
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе // Определяем по имени предопределенного.
			ВидНалогаИлиПлатежа = Справочники.ВидыНалоговИПлатежей[ВидНалогаИлиПлатежаТекст];
			ДобавитьЗаписьВРегистрНастроек(НаборЗаписей, СуществующиеЗаписи,
				Период, ВидНалогаИлиПлатежа, СрокИсполнения, СрокИсполнения2, СрокИсполнения3)
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	КоличествоЗаписейПосле = НаборЗаписей.Количество();
	
	Возврат КоличествоЗаписейПосле - КоличествоЗаписейДо;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗаписьВРегистрНастроек(НаборЗаписей, СуществующиеЗаписи, Период, ВидНалогаИлиПлатежа, СрокИсполнения, СрокИсполнения2, СрокИсполнения3)
	
	Отбор = Новый Структура("Период, ВидНалогаИлиПлатежа", Период, ВидНалогаИлиПлатежа);
	НетВСуществующихЗаписях = СуществующиеЗаписи.НайтиСтроки(Отбор).Количество() = 0;
	
	Если НетВСуществующихЗаписях Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = Период;
		НоваяЗапись.ВидНалогаИлиПлатежа = ВидНалогаИлиПлатежа;
		НоваяЗапись.СрокИсполнения  = СрокИсполнения;
		НоваяЗапись.СрокИсполнения2 = СрокИсполнения2;
		НоваяЗапись.СрокИсполнения3 = СрокИсполнения3;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли