
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрыВыполненияКоманды.Источник.Модифицированность Тогда
		ТекстСообщения = НСтр("ru = 'Перед обменом необходимо записать данные'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Запись = ПараметрыВыполненияКоманды.Источник.Запись;
	ПараметрыФормы = Новый Структура("Организация,ОсновноеСредство,ИнвентарныйНомер");
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Запись);
	
	ОткрытьФорму("Обработка.ОбменФРМО.Форма.ФормаОбмена", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
