
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Студенты.Ссылка,
	               |	Студенты.ВАрхиве
	               |ИЗ
	               |	Справочник.Студенты КАК Студенты
	               |ГДЕ
	               |	Студенты.Ссылка В(&МассивСтудентов)";
	Запрос.Текст = ТекстЗапроса; 
	Запрос.УстановитьПараметр("МассивСтудентов", Параметры.МассивСтудентов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВАрхиве Тогда
			
			НоваяСтрока = ТаблицаИзАрхива.Добавить();
			НоваяСтрока.Студент = Выборка.Ссылка;
			
		Иначе
			
			НоваяСтрока = ТаблицаВАрхив.Добавить();
			НоваяСтрока.Студент = Выборка.Ссылка;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Элементы.ТаблицаВАрхив.Видимость = (ТаблицаВАрхив.Количество() > 0);
	Элементы.ТаблицаИзАрхива.Видимость = (ТаблицаИзАрхива.Количество() > 0);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоместитьИзвлечь(Команда)
	
	ПоместитьИзвлечьСервер();
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоместитьИзвлечьСервер()
	
	НачатьТранзакцию();
	Попытка
	
		Для каждого СтрокаСтудента Из ТаблицаВАрхив Цикл
			
			СтудентОбъект = СтрокаСтудента.Студент.ПолучитьОбъект();
			СтудентОбъект.ВАрхиве = Истина;
			СтудентОбъект.Записать();
			
		КонецЦикла; 
		
		Для каждого СтрокаСтудента Из ТаблицаИзАрхива Цикл
			
			СтудентОбъект = СтрокаСтудента.Студент.ПолучитьОбъект();
			СтудентОбъект.ВАрхиве = Ложь;
			СтудентОбъект.Записать();
			
		КонецЦикла; 
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось выполнить операцию по причине:
			|%1'"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Работа с архивом студентов'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти