#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ВывестиЗаголовокОтчета(ДокументРезультат, Настройки);
	
	// вывод отчета
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Ложь);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	// подпись
	
	ВывестиПодвалОтчета(ДокументРезультат, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиПодвалОтчета(Результат, Настройки)
	
	Подписи.Очистить();
	ПараметрВыводитьПодвал = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьПодвал"));
	ВыводитьПодвал = ПараметрВыводитьПодвал <> Неопределено
		И ПараметрВыводитьПодвал.Использование = Истина И ПараметрВыводитьПодвал.Значение = Истина;
	Если ВыводитьПодвал Тогда
		ПараметрИсполнитель = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Исполнитель"));
		ВыбранИсполнитель = ПараметрИсполнитель <> Неопределено И ПараметрИсполнитель.Использование;
		ПараметрГлавныйБухгалтер = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ГлавныйБухгалтер"));  	
		ВыбранГлБухгалтер = ПараметрГлавныйБухгалтер <> Неопределено И ПараметрГлавныйБухгалтер.Использование;
		ПараметрРуководитель = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Руководитель"));  	
		ВыбранРуководитель = ПараметрРуководитель <> Неопределено И ПараметрРуководитель.Использование;
		Если ВыбранИсполнитель Или ВыбранГлБухгалтер Или ВыбранРуководитель Тогда
			СтрокаПодписи = Подписи.Добавить();
			СтрокаПодписи = Подписи.Добавить();
			Если ВыбранИсполнитель Тогда
				СтрокаПодписи.Сотрудник = ПараметрИсполнитель.Значение;
				СтрокаПодписи.Выводить = ПараметрИсполнитель.Использование;
			КонецЕсли;
			СтрокаПодписи = Подписи.Добавить();
			Если ВыбранГлБухгалтер Тогда
				СтрокаПодписи.Сотрудник = ПараметрГлавныйБухгалтер.Значение;
				СтрокаПодписи.Выводить = ПараметрГлавныйБухгалтер.Использование;
			КонецЕсли;
			СтрокаПодписи = Подписи.Добавить();
			Если ВыбранРуководитель Тогда
				СтрокаПодписи.Сотрудник = ПараметрРуководитель.Значение;
				СтрокаПодписи.Выводить = ПараметрРуководитель.Использование;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ВыводитьПодвал Тогда
		СтандартныеОтчеты.ВывестиПодвалОтчета(ЭтотОбъект, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиЗаголовокОтчета(Результат, Настройки)
	
	ПараметрПериод = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Значение;
	
	ЗначениеПоляОрганизация = Неопределено;
	ПрочитатьЗначениеОтбораОрганизация(Настройки.Отбор, ЗначениеПоляОрганизация);
	
	МакетЗаголовка = УправлениеПечатью.МакетПечатнойФормы("Отчет.СтоимостьПитания.ПФ_MXL_ЗаголовокОтчета");
	ОбластьЗаголовка = МакетЗаголовка.ПолучитьОбласть("Заголовок");
	Если ТипЗнч(ЗначениеПоляОрганизация) = Тип("СправочникСсылка.Организации") Тогда
		ОбластьЗаголовка.Параметры.НаименованиеОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеПоляОрганизация, "НаименованиеПолное");
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрПериод) Тогда
		ОбластьЗаголовка.Параметры.ПериодСтр = ПредставлениеПериода(ПараметрПериод.ДатаНачала, ПараметрПериод.ДатаОкончания);
	КонецЕсли;
	Результат.Вывести(ОбластьЗаголовка);
	
	ОбластьЗаголовокОтбора = МакетЗаголовка.ПолучитьОбласть("ЗаголовокОтбора");
	ОбластьСтрокаОтбора = МакетЗаголовка.ПолучитьОбласть("СтрокаОтбора");
	
	ВывелиЗаголовокОтбора = Ложь;
	Для каждого ТекСтрОтбора Из Настройки.Отбор.Элементы Цикл
	
		Если ТипЗнч(ТекСтрОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ТекСтрОтбора.Использование Тогда
			Если ЗначениеЗаполнено(ТекСтрОтбора.ИдентификаторПользовательскойНастройки) 
				И ТекСтрОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВывелиЗаголовокОтбора Тогда
				СтрОтбора = ОбластьСтрокаОтбора;
			Иначе
				СтрОтбора = ОбластьЗаголовокОтбора;
				ВывелиЗаголовокОтбора = Истина;
			КонецЕсли;
			СтрОтбора.Параметры.ОтборСтр = Строка(ТекСтрОтбора.ЛевоеЗначение)+" "+Строка(ТекСтрОтбора.ВидСравнения)+" "+Строка(ТекСтрОтбора.ПравоеЗначение);
			Результат.Вывести(СтрОтбора);
		КонецЕсли;
	
	КонецЦикла;
	
	Если ВывелиЗаголовокОтбора Тогда
		Результат.Вывести(МакетЗаголовка.ПолучитьОбласть("ПустаяСтрока"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьЗначениеОтбораОрганизация(Отбор, ЗначениеПоляОрганизация)

	Для каждого ЭлементОтбора Из Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация")
				И ЗначениеЗаполнено(ЭлементОтбора.ИдентификаторПользовательскойНастройки) Тогда
				
				Если ЭлементОтбора.Использование = Истина Тогда
					ЗначениеПоляОрганизация = ЭлементОтбора.ПравоеЗначение;
				Иначе
					ЗначениеПоляОрганизация = Справочники.Организации.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
		Иначе
			ПрочитатьЗначениеОтбораОрганизация(ЭлементОтбора, ЗначениеПоляОрганизация);
		КонецЕсли;
		
		Если ЗначениеПоляОрганизация <> Неопределено Тогда
			Возврат;
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры // ПолучитьЗначениеОтбораОрганизация()

#КонецОбласти

#КонецЕсли