#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Перем Запрос, ТекстЗапроса;
   Перем Результат, ТаблицыДвижений;
   
   Запрос = Новый Запрос;
   ТекстЗапроса = "ВЫБРАТЬ
                  |	Начисления.Ссылка.Дата КАК Период,
                  |	Начисления.Ссылка.ПериодНачисления КАК ПериодНачисления,
                  |	Начисления.Ссылка.Организация,
                  |	Начисления.Ссылка.Факультет КАК Факультет,
                  |	Начисления.Студент,
                  |	Начисления.Контрагент,
                  |	Начисления.ДоговорКонтрагента,
                  |	Начисления.Ссылка.ВалютаДокумента КАК ВалютаВзаиморасчетов,
                  |	СУММА(Начисления.Сумма + ВЫБОР
                  |			КОГДА Начисления.Ссылка.СуммаВключаетНДС
                  |				ТОГДА 0
                  |			ИНАЧЕ Начисления.СуммаНДС
                  |		КОНЕЦ) КАК СуммаВзаиморасчетов,
                  |	СУММА((Начисления.Сумма + ВЫБОР
                  |			КОГДА Начисления.Ссылка.СуммаВключаетНДС
                  |				ТОГДА 0
                  |			ИНАЧЕ Начисления.СуммаНДС
                  |		КОНЕЦ) * Начисления.Ссылка.Курс / Начисления.Ссылка.Кратность) КАК СуммаРегл,
                  |	Начисления.Ссылка.Номер КАК НомерПервичногоДокумента,
                  |	Начисления.Ссылка.Дата КАК ДатаПервичногоДокумента,
                  |	""Начисление за услуги образования"" КАК ВидПервичногоДокумента
                  |ИЗ
                  |	Документ.НачислениеЗаУслугиОбразования.Начисления КАК Начисления
                  |ГДЕ
                  |	Начисления.Ссылка = &Ссылка
                  |
                  |СГРУППИРОВАТЬ ПО
                  |	Начисления.Ссылка.Дата,
                  |	Начисления.Студент,
                  |	Начисления.Ссылка.ПериодНачисления,
                  |	Начисления.Ссылка.Факультет,
                  |	Начисления.Контрагент,
                  |	Начисления.ДоговорКонтрагента,
                  |	Начисления.Ссылка.Номер,
                  |	Начисления.Ссылка.ВалютаДокумента,
                  |	Начисления.Ссылка.Организация,
                  |	Начисления.Ссылка.Дата
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  |	НачисленияФактические.Ссылка КАК Регистратор,
                  |	НачисленияФактические.Ссылка.ПериодНачисления КАК Период,
                  |	НачисленияФактические.Ссылка.Факультет,
                  |	НачисленияФактические.Студент,
                  |	НачисленияФактические.ПериодНачисленияНачало,
                  |	НачисленияФактические.ПериодНачисленияКонец,
                  |	НачисленияФактические.Контрагент,
                  |	НачисленияФактические.ДоговорКонтрагента,
                  |	НачисленияФактические.СтавкаОплаты,
                  |	НачисленияФактические.Льгота,
                  |	НачисленияФактические.Сумма,
                  |	НачисленияФактические.СтавкаНДС,
                  |	НачисленияФактические.СуммаНДС,
                  |	НачисленияФактические.ПорядокВыпискиСФ
                  |ИЗ
                  |	Документ.НачислениеЗаУслугиОбразования.Начисления КАК НачисленияФактические
                  |ГДЕ
                  |	НачисленияФактические.Ссылка = &Ссылка";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	   
	Результат = Запрос.ВыполнитьПакет();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("РасчетыСоСтудентами", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("НачисленияФактическиеОбразование", Результат[1].Выгрузить());
	
	УчетНДСРаздельный.ДобавитьДвиженияНеоблагаемыеНДСОперации(ДополнительныеСвойства.ТаблицыДляДвижений, ДокументСсылка);
	
КонецПроцедуры

// Подготовить таблицу расчетов по документу (в унифицированном формате) для источника данных ТаблицаРасчетовСЗачетомАвансов.
// 
// Параметры:
//  Документ - ДокументОбъект.НачислениеЗаУслугиОбразования
//  Параметры - Структура - Параметры 
//  Отказ - Булево
// 
// Возвращаемое значение:
//  см. УчетРасчетов.ПустаяТаблицаРасчетовПоДокументу
Функция ПодготовитьТаблицуРасчетовПоДокументу(Документ, Параметры, Отказ) Экспорт
	
	ТаблицаРасчетов = УчетРасчетов.ПустаяТаблицаРасчетовПоДокументу();
	
	Запрос = Новый Запрос;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Начисления",
		"ИФО,КФО,КПС,КЭК,Факультет,Контрагент,ДоговорКонтрагента,
		|ВалютаДокумента,ОстатокДБП,ОстатокДБПВВалюте,УчитыватьНДС,СуммаВключаетНДС,СуммаНДС,Сумма",
		Документ, Параметры);
	
	Если Документ.ВидОперации = Перечисления.ВидыОперацийНачисленияУчащимся.ПоКраткосрочнымДоговорам Тогда
		
		// Исключение из общего принципа - для начислений по краткосрочным договорам (образование),
		// КФО, КПС и КЭК берем из параметров источника данных (реквизитов типовой операции),
		// несмотря на то, что одноименные реквизиты есть в табличной части.
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	Начисления.ИФО КАК ИФО,
		|	&ПараметрКФО КАК КФО,
		|	&ПараметрКПС КАК КПС,
		|	&ПараметрКЭК КАК КЭК,
		|	Начисления.Факультет КАК Подразделение,
		|	Начисления.Контрагент КАК Контрагент,
		|	Начисления.ДоговорКонтрагента КАК Договор,
		|	Начисления.ВалютаДокумента КАК Валюта,
		|	Начисления.СуммаНДС КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА Начисления.УчитыватьНДС
		|				И НЕ Начисления.СуммаВключаетНДС
		|			ТОГДА Начисления.Сумма + Начисления.СуммаНДС
		|		ИНАЧЕ Начисления.Сумма
		|	КОНЕЦ КАК СуммаРасчетов
		|ИЗ
		|	ТаблицаНачисления КАК Начисления";
		Запрос.УстановитьПараметр("ПараметрКФО", Параметры.КФО);
		Запрос.УстановитьПараметр("ПараметрКПС", Параметры.КПС);
		Запрос.УстановитьПараметр("ПараметрКЭК", Параметры.КЭКРасчетов);
		
	Иначе // ПоДолгосрочнымДоговорам
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	Начисления.ИФО КАК ИФО,
		|	Начисления.КФО КАК КФО,
		|	Начисления.КПС КАК КПС,
		|	Начисления.КЭК КАК КЭК,
		|	Начисления.Факультет КАК Подразделение,
		|	Начисления.Контрагент КАК Контрагент,
		|	Начисления.ДоговорКонтрагента КАК Договор,
		|	Начисления.ВалютаДокумента КАК Валюта,
		|	Начисления.ОстатокДБП КАК ОстатокДБП,
		|	Начисления.ОстатокДБПВВалюте КАК ОстатокДБПВВалюте,
		|	Начисления.СуммаНДС КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА Начисления.УчитыватьНДС
		|				И НЕ Начисления.СуммаВключаетНДС
		|			ТОГДА Начисления.Сумма + Начисления.СуммаНДС
		|		ИНАЧЕ Начисления.Сумма
		|	КОНЕЦ КАК СуммаРасчетов
		|ИЗ
		|	ТаблицаНачисления КАК Начисления";
		
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Начисления.Факультет", "ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)");
	КонецЕсли;
	
	Если Параметры.ПоВсемКФО Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Начисления.КФО",
			"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
	КонецЕсли;
	Если Параметры.ПоВсемКПС Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Начисления.КПС",
			"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
	КонецЕсли;
	
	РасчетыПоУслугамРаботам = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДокумента Из РасчетыПоУслугамРаботам Цикл
		
		НоваяСтрока = ТаблицаРасчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
		
		НоваяСтрока.ЭтоПоступление = Ложь;
		
		НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(НоваяСтрока.КЭК,
			?(Параметры.Свойство("СчетРасчетов") И ЗначениеЗаполнено(Параметры.СчетРасчетов), Параметры.СчетРасчетов, "205.00"), ,
			Документ.Дата, Документ.Организация, СтрокаДокумента.ИФО);
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.СчетРасчетов) Тогда
			ТекстОшибки = НСтр("ru='Невозможно определить счет расчетов с контрагентом по КЭК ""%1"".
				|Проверьте настройки соответствия аналитических счетов КЭК.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				НоваяСтрока.КЭК);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,
				Документ.Ссылка, , "Объект", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРасчетов.Свернуть("ЭтоПоступление,ИФО,КФО,КПС,КЭК,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта",
		"СуммаНДС,СуммаРасчетов");
	
	ИспользуетсяСчетАП = (Документ.Дата >= УчетРасчетов.ДатаПереходаНаЗабалансовыйСчетАП(Документ.Организация));
	Если НЕ ИспользуетсяСчетАП Тогда
		// Не нужно зачитывать аванс, только долги по документам расчетов - до перевода авансов на счет АП.
		// Авансы по счету АП зачитываются в обычном порядке.
		ТаблицаРасчетов.Колонки.Добавить("СчетАвансов", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		Для Каждого СтрокаРасчетов Из ТаблицаРасчетов Цикл
			СтрокаРасчетов.СчетАвансов = СтрокаРасчетов.СчетРасчетов;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

// Подготовить таблицу документа (в унифицированном формате) для источника данных РеализацияУслугРабот.
// 
// Параметры:
//  Документ - ДокументОбъект.НачислениеЗаУслугиОбразования
//  Параметры - Структура - Параметры 
// 
// Возвращаемое значение:
//  см. УчетРасчетов.ПустаяТаблицаРеализацияУслугРаботПоДокументу
Функция ПодготовитьТаблицуРеализацияУслугРаботПоДокументу(Документ, Параметры) Экспорт
	
	ТаблицаРеализацияУслугРабот = УчетРасчетов.ПустаяТаблицаРеализацияУслугРаботПоДокументу();
	
	Запрос = Новый Запрос;
	
	МетаданныеДокумента = Документ.Метаданные();
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Начисления",
		"НомерСтроки,ИФО,КФО,КПС,КЭК,Факультет,Контрагент,ДоговорКонтрагента,ВалютаДокумента,ОстатокДБП,ОстатокДБПВВалюте,
		|Номенклатура,Количество,Сумма,СтавкаНДС,СуммаНДС,УчитыватьНДС,СуммаВключаетНДС,
		|СчетДБП,СчетДоходов,СубконтоДоходов1,СубконтоДоходов2,СубконтоДоходов3,ВидДеятельностиНУ,СчетДоходовНУ,СтатьяПрочихДоходовНУ,
		|ОтразитьВГрафикеИсполненияДоговора",
		Документ, Параметры);
	
	Если Документ.ВидОперации = Перечисления.ВидыОперацийНачисленияУчащимся.ПоКраткосрочнымДоговорам Тогда
		
		// Исключение из общего принципа - для начислений по краткосрочным договорам (образование),
		// КФО, КПС и КЭК берем из параметров источника данных (реквизитов типовой операции),
		// несмотря на то, что одноименные реквизиты есть в табличной части.
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""Начисления"" КАК ИмяСписка,
		|	""Начисления"" КАК СинонимСписка,
		|	Начисления.НомерСтроки КАК НомерСтроки,
		|	Начисления.ИФО КАК ИФО,
		|	&ПараметрКФО КАК КФО,
		|	&ПараметрКПС КАК КПС,
		|	&ПараметрКЭК КАК КЭК,
		|	Начисления.Факультет КАК Подразделение,
		|	Начисления.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Начисления.Номенклатура КАК Справочник.Номенклатура).НаименованиеПолное КАК СТРОКА(254)) КАК Содержание,
		|	Начисления.Контрагент КАК Контрагент,
		|	Начисления.ДоговорКонтрагента КАК Договор,
		|	ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка) КАК СчетДБП,
		|	&ПараметрСчетДоходов КАК СчетДоходов,
		|	&ПараметрСубконтоДоходов1 КАК СубконтоДоходов1,
		|	&ПараметрСубконтоДоходов2 КАК СубконтоДоходов2,
		|	&ПараметрСубконтоДоходов3 КАК СубконтоДоходов3,
		|	&ПараметрВидДеятельностиНУ КАК ВидДеятельностиНУ,
		|	&ПараметрСчетДоходовНУ КАК СчетДоходовНУ,
		|	&ПараметрСтатьяПрочихДоходовНУ КАК СтатьяПрочихДоходовНУ,
		|	Начисления.ОтразитьВГрафикеИсполненияДоговора КАК ОтразитьВГрафикеИсполненияДоговора,
		|	Начисления.ВалютаДокумента КАК Валюта,
		|	0 КАК Количество,
		|	ВЫБОР
		|		КОГДА Начисления.УчитыватьНДС
		|				И НЕ Начисления.СуммаВключаетНДС
		|			ТОГДА Начисления.Сумма + Начисления.СуммаНДС
		|		ИНАЧЕ Начисления.Сумма
		|	КОНЕЦ КАК Сумма,
		|	Начисления.СтавкаНДС КАК СтавкаНДС,
		|	Начисления.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	ТаблицаНачисления КАК Начисления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		Запрос.УстановитьПараметр("ПараметрКФО", Параметры.КФО);
		Запрос.УстановитьПараметр("ПараметрКПС", Параметры.КПС);
		Запрос.УстановитьПараметр("ПараметрКЭК", Параметры.КЭК);
		Запрос.УстановитьПараметр("ПараметрСчетДоходов", Параметры.СчетДоходов);
		Запрос.УстановитьПараметр("ПараметрСубконтоДоходов1", Параметры.СубконтоДоходов1);
		Запрос.УстановитьПараметр("ПараметрСубконтоДоходов2", Параметры.СубконтоДоходов2);
		Запрос.УстановитьПараметр("ПараметрСубконтоДоходов3", Параметры.СубконтоДоходов3);
		
		// Налоговый учет по налогу на прибыль.
		Запрос.УстановитьПараметр("ПараметрВидДеятельностиНУ",
			?(Параметры.Свойство("ВидДеятельностиНУ") И ЗначениеЗаполнено(Параметры.ВидДеятельностиНУ), Параметры.ВидДеятельностиНУ,
			Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения) ); // Значение по умолчанию.
		Запрос.УстановитьПараметр("ПараметрСчетДоходовНУ",
			?(Параметры.Свойство("СчетДоходовНУ") И ЗначениеЗаполнено(Параметры.СчетДоходовНУ), Параметры.СчетДоходовНУ,
			БухгалтерскийУчет.СчетПоКоду("Н90.01", Документ.Дата, Документ.Организация)) ); // Значение по умолчанию.
		Запрос.УстановитьПараметр("ПараметрСтатьяПрочихДоходовНУ",
			?(Параметры.Свойство("СтатьяПрочихДоходовНУ") И ЗначениеЗаполнено(Параметры.СтатьяПрочихДоходовНУ), Параметры.СтатьяПрочихДоходовНУ,
			Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка()) ); // Значение по умолчанию.
		
	Иначе // ПоДолгосрочнымДоговорам
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""Начисления"" КАК ИмяСписка,
		|	""Начисления"" КАК СинонимСписка,
		|	Начисления.НомерСтроки КАК НомерСтроки,
		|	Начисления.ИФО КАК ИФО,
		|	Начисления.КФО КАК КФО,
		|	Начисления.КПС КАК КПС,
		|	Начисления.КЭК КАК КЭК,
		|	Начисления.Факультет КАК Подразделение,
		|	Начисления.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Начисления.Номенклатура КАК Справочник.Номенклатура).НаименованиеПолное КАК СТРОКА(254)) КАК Содержание,
		|	Начисления.Контрагент КАК Контрагент,
		|	Начисления.ДоговорКонтрагента КАК Договор,
		|	Начисления.СчетДБП КАК СчетДБП,
		|	Начисления.ОстатокДБП КАК ОстатокДБП,
		|	Начисления.ОстатокДБПВВалюте КАК ОстатокДБПВВалюте,
		|	Начисления.СчетДоходов КАК СчетДоходов,
		|	Начисления.СубконтоДоходов1 КАК СубконтоДоходов1,
		|	Начисления.СубконтоДоходов2 КАК СубконтоДоходов2,
		|	Начисления.СубконтоДоходов3 КАК СубконтоДоходов3,
		|	Начисления.ВидДеятельностиНУ КАК ВидДеятельностиНУ,
		|	Начисления.СчетДоходовНУ КАК СчетДоходовНУ,
		|	Начисления.СтатьяПрочихДоходовНУ КАК СтатьяПрочихДоходовНУ,
		|	Начисления.ОтразитьВГрафикеИсполненияДоговора КАК ОтразитьВГрафикеИсполненияДоговора,
		|	Начисления.ВалютаДокумента КАК Валюта,
		|	0 КАК Количество,
		|	ВЫБОР
		|		КОГДА Начисления.УчитыватьНДС
		|				И НЕ Начисления.СуммаВключаетНДС
		|			ТОГДА Начисления.Сумма + Начисления.СуммаНДС
		|		ИНАЧЕ Начисления.Сумма
		|	КОНЕЦ КАК Сумма,
		|	Начисления.СтавкаНДС КАК СтавкаНДС,
		|	Начисления.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	ТаблицаНачисления КАК Начисления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Начисления.Факультет", "ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)");
	КонецЕсли;
	
	РеализацияУслугРабот = Запрос.Выполнить().Выгрузить();
	
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ЭтоДолгосрочныйДоговор = (Документ.ВидОперации = Перечисления.ВидыОперацийНачисленияУчащимся.ПоДолгосрочнымДоговорам);
	
	Для Каждого СтрокаДокумента Из РеализацияУслугРабот Цикл
		
		НоваяСтрока = ТаблицаРеализацияУслугРабот.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
		
		НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(НоваяСтрока.КЭК,
			?(Параметры.Свойство("СчетРасчетов") И ЗначениеЗаполнено(Параметры.СчетРасчетов), Параметры.СчетРасчетов, "205.00"), ,
			Документ.Дата, Документ.Организация, СтрокаДокумента.ИФО);
		Если Не ЗначениеЗаполнено(НоваяСтрока.СчетРасчетов) Тогда // По умолчанию - 205.31.
			НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("205.31", Документ.Дата, Документ.Организация);
		КонецЕсли;
		
		НоваяСтрока.ВидОперацииДБП = ?(ЭтоДолгосрочныйДоговор, Перечисления.ВидыОперацийНачисленияДБП.ДолгосрочныйДоговорОбразование, Перечисления.ВидыОперацийНачисленияДБП.ПустаяСсылка());
		
		Если ЭтоДолгосрочныйДоговор
			И ИспользоватьВалютныйУчет 
			И ЗначениеЗаполнено(НоваяСтрока.Валюта)
			И НоваяСтрока.Валюта <> ВалютаРегламентированногоУчета Тогда
			КурсПересчета = ?(СтрокаДокумента.ОстатокДБПВВалюте = 0, 1, СтрокаДокумента.ОстатокДБП / СтрокаДокумента.ОстатокДБПВВалюте);
			НоваяСтрока.СуммаРубПоКурсуДБП = НоваяСтрока.Сумма * КурсПересчета;
		Иначе
			НоваяСтрока.СуммаРубПоКурсуДБП = НоваяСтрока.Сумма;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаРеализацияУслугРабот;
	
КонецФункции

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.НачислениеЗаУслугиОбразования";
	КомандаПечати.Идентификатор = "АктОбОказанииУслуг";
	КомандаПечати.Представление = Нстр("ru='Акт об оказании услуг'");
	КомандаПечати.Порядок = 100;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.НачислениеЗаУслугиОбразования";
	КомандаПечати.Идентификатор = "ПФ_MXL_ВедомостьНачислений";
	КомандаПечати.Представление = Нстр("ru='Ведомость начислений'");
	КомандаПечати.Порядок = 101;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ВедомостьНачислений") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ВедомостьНачислений",
			"Ведомость начислений",
			ПечатьВедомостиПоРасчетамСУчащимися(МассивОбъектов, ОбъектыПечати));
	
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктОбОказанииУслуг") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"АктОбОказанииУслуг",
															"Акт об оказании услуг",
															ПечатьАктаОбОказанииУслуг(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьВедомостиПоРасчетамСУчащимися(МассивОбъектов, ОбъектыПечати)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НачислениеЗаУслугиОбразования.ПФ_MXL_ВедомостьНачислений");
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги 	= Макет.ПолучитьОбласть("Итоги");
	ОбластьПодвал 	= Макет.ПолучитьОбласть("Подвал");
	
	МассивДляПроверки = Новый Массив;
	МассивДляПроверки.Добавить(ОбластьИтоги);
	МассивДляПроверки.Добавить(ОбластьПодвал);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокНачисления.Ссылка КАК ДокументОснование,
	|	ДокНачисления.Организация КАК Организация,
	|	ДокНачисления.Факультет.Представление КАК пФакультет,
	|	ВЫБОР
	|		КОГДА ДокНачисления.Организация.НаименованиеПолное = """"
	|			ТОГДА ДокНачисления.Организация.Наименование
	|		ИНАЧЕ ДокНачисления.Организация.НаименованиеПолное
	|	КОНЕЦ + "" ИНН "" + ДокНачисления.Организация.ИНН + "" КПП "" + ДокНачисления.Организация.КПП КАК пНаименованиеОрганизации,
	|	ТабЧасть.Студент.Представление КАК пСтудент,
	|	ДокНачисления.Дата КАК пДата,
	|	ТабЧасть.ДоговорКонтрагента.Представление КАК пДоговор,
	|	ДокНачисления.Номенклатура.Представление КАК пНаименование,
	|	ДокНачисления.Номенклатура.ЕдиницаИзмерения.Представление КАК пЕдИзм,
	|	ТабЧасть.Сумма КАК пЦена,
	|	ТабЧасть.Сумма КАК пСумма,
	|	ТабЧасть.СуммаНДС КАК пИтогНДС,
	|	ВЫБОР
	|		КОГДА ДокНачисления.СуммаВключаетНДС
	|			ТОГДА ТабЧасть.Сумма
	|		ИНАЧЕ ТабЧасть.Сумма + ТабЧасть.СуммаНДС
	|	КОНЕЦ КАК пИтогСумма,
	|	ВЫБОР
	|		КОГДА ДокНачисления.СуммаВключаетНДС
	|			ТОГДА ТабЧасть.Сумма
	|		ИНАЧЕ ТабЧасть.Сумма + ТабЧасть.СуммаНДС
	|	КОНЕЦ КАК пИтогВсего,
	|	ДокНачисления.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДокНачисления.ВалютаДокумента КАК ВалютаДокумента,
	|	ДокНачисления.Номер КАК НомерНачисления,
	|	ДокНачисления.Ссылка КАК Начисление,
	|	ТабЧасть.НомерСтроки КАК НомСтр,
	|	ДокНачисления.ВалютаДокумента.Представление КАК пВалюта,
	|	ДокНачисления.Руководитель КАК Руководитель
	|ПОМЕСТИТЬ ТабПечать
	|ИЗ
	|	Документ.НачислениеЗаУслугиОбразования КАК ДокНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗаУслугиОбразования.Начисления КАК ТабЧасть
	|		ПО ДокНачисления.Ссылка = ТабЧасть.Ссылка
	|ГДЕ
	|	ДокНачисления.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабПечать.ДокументОснование КАК ДокументОснование,
	|	ТабПечать.Организация КАК Организация,
	|	ТабПечать.пФакультет КАК пФакультет,
	|	ТабПечать.пНаименованиеОрганизации КАК пНаименованиеОрганизации,
	|	ТабПечать.пСтудент КАК пСтудент,
	|	ТабПечать.пДата КАК пДата,
	|	ТабПечать.пДоговор КАК пДоговор,
	|	ТабПечать.пНаименование КАК пНаименование,
	|	ТабПечать.пЕдИзм КАК пЕдИзм,
	|	СУММА(ЕСТЬNULL(ТабПечать.пЦена, 0)) КАК пЦена,
	|	СУММА(ЕСТЬNULL(ТабПечать.пСумма, 0)) КАК пСумма,
	|	СУММА(ЕСТЬNULL(ТабПечать.пИтогНДС, 0)) КАК пИтогНДС,
	|	СУММА(ЕСТЬNULL(ТабПечать.пИтогСумма, 0)) КАК пИтогСумма,
	|	СУММА(ЕСТЬNULL(ТабПечать.пИтогВсего, 0)) КАК пИтогВсего,
	|	ТабПечать.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ТабПечать.ВалютаДокумента КАК ВалютаДокумента,
	|	ТабПечать.НомерНачисления КАК НомерНачисления,
	|	ТабПечать.Начисление КАК Начисление,
	|	ТабПечать.пВалюта КАК пВалюта,
	|	ТабПечать.Руководитель КАК Руководитель,
	|	ТабПечать.НомСтр КАК НомСтр
	|ИЗ
	|	ТабПечать КАК ТабПечать
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабПечать.ДокументОснование,
	|	ТабПечать.Организация,
	|	ТабПечать.пФакультет,
	|	ТабПечать.пНаименованиеОрганизации,
	|	ТабПечать.пСтудент,
	|	ТабПечать.пДата,
	|	ТабПечать.пДоговор,
	|	ТабПечать.пНаименование,
	|	ТабПечать.пЕдИзм,
	|	ТабПечать.СуммаВключаетНДС,
	|	ТабПечать.ВалютаДокумента,
	|	ТабПечать.НомерНачисления,
	|	ТабПечать.Начисление,
	|	ТабПечать.пВалюта,
	|	ТабПечать.Руководитель,
	|	ТабПечать.НомСтр
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомСтр
	|ИТОГИ ПО
	|	ДокументОснование";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		
	ВыборкаОснование = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаОснование.Следующий() Цикл
		
		ЗапомнитьНачалоОбласти = Истина;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		Если ЗапомнитьНачалоОбласти Тогда
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			ЗапомнитьНачалоОбласти = Ложь;
		КонецЕсли;
		
		ПерваяСтрока = Истина;
		СтруктураОбластьПодвал = Новый Структура("пТекстНДС,пИтогВсегоПрописью,пИтогНДСПрописью,РуководительДолжность,РуководительФИО");
		ДанныеРуководителя = Новый Структура("СсылкаНаОбъект, Период, Должность");
		
		ВыборкаСтроки = ВыборкаОснование.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			
			Если ПерваяСтрока Тогда
				
				ОбластьШапка.Параметры.Заполнить(ВыборкаСтроки);
				
				АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаСтроки.Организация,
					Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
				ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаСтроки.Организация,
					Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
					
				СтруктураОбластьШапка = Новый Структура("пАдресТелефон,пДата,пНомер");
				СтруктураОбластьШапка.пАдресТелефон = АдресОрганизации
					+ ?(ПустаяСтрока(ТелефонОрганизации), "", ", тел.:"+ТелефонОрганизации);
				
				СтруктураОбластьШапка.пДата	= Формат(ВыборкаСтроки.пДата, "ДЛФ=DD");		
				СтруктураОбластьШапка.пНомер = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаСтроки.Начисление,ВыборкаСтроки.НомерНачисления) + "/" + ВыборкаСтроки.НомСтр;
				ОбластьШапка.Параметры.Заполнить(СтруктураОбластьШапка);
				ТабличныйДокумент.Вывести(ОбластьШапка);
				
				СтруктураОбластьПодвал.пТекстНДС = ?(ВыборкаСтроки.СуммаВключаетНДС, "В том числе НДС", "Итого НДС");
				ДанныеРуководителя.СсылкаНаОбъект = ВыборкаСтроки.Руководитель;
				ДанныеРуководителя.Период = ВыборкаСтроки.пДата;
				
			КонецЕсли;	
			ПерваяСтрока = Ложь;
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ОбластьИтоги.Параметры.Заполнить(СтруктураОбластьПодвал);
		ОбластьИтоги.Параметры.Заполнить(ВыборкаОснование);
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		СтруктураОбластьПодвал.пИтогВсегоПрописью 	= ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(ВыборкаОснование.пИтогВсего, ВыборкаСтроки.ВалютаДокумента);
		СтруктураОбластьПодвал.пИтогНДСПрописью 	= ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(ВыборкаОснование.пИтогНДС, ВыборкаСтроки.ВалютаДокумента);
				
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеРуководителя);
		СтруктураОбластьПодвал.РуководительДолжность = ДанныеРуководителя.Должность;
		СтруктураОбластьПодвал.РуководительФИО = Справочники.Сотрудники.ФамилияИО(ДанныеРуководителя.СсылкаНаОбъект, Истина, ДанныеРуководителя.Период);
		
		ОбластьПодвал.Параметры.Заполнить(СтруктураОбластьПодвал);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
			
		// В табличном документе зададим имя области, в которую был выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаОснование.ДокументОснование);
		
	КонецЦикла;		
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьАктаОбОказанииУслуг(МассивОбъектов, ОбъектыПечати)
	
	Если МассивОбъектов.Количество() > 0
		И ТипЗнч(МассивОбъектов[0]) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СчетФактураВыданный.ДокументОснование
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Ссылка В(&МассивОбъектов)";
		Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		
		МассивОбъектовДляЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументОснование");
		
	Иначе
		МассивОбъектовДляЗапроса = МассивОбъектов;
	КонецЕсли;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_АктВыполненныхУслуг");
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги 	= Макет.ПолучитьОбласть("Итоги");
	ОбластьПодвал 	= Макет.ПолучитьОбласть("Подвал");
	
	МассивДляПроверки = Новый Массив;
	МассивДляПроверки.Добавить(ОбластьИтоги);
	МассивДляПроверки.Добавить(ОбластьПодвал);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокНачисления.Ссылка КАК ДокументОснование,
	|	ДокНачисления.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДокНачисления.Организация.НаименованиеПолное = """"
	|			ТОГДА ДокНачисления.Организация.Наименование
	|		ИНАЧЕ ДокНачисления.Организация.НаименованиеПолное
	|	КОНЕЦ + "" ИНН "" + ДокНачисления.Организация.ИНН + "" КПП "" + ДокНачисления.Организация.КПП КАК пНаименованиеОрганизации,
	|	ВЫБОР
	|		КОГДА ТабЧасть.ПорядокВыпискиСФ = ЗНАЧЕНИЕ(Перечисление.ПорядокВыпискиСФЗаУслуги.Сводно)
	|			ТОГДА КонтрагентСводнаяСчетФактураУслугиОбразования.Значение
	|		ИНАЧЕ ТабЧасть.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ДокНачисления.Дата КАК пДата,
	|	ТабЧасть.ДоговорКонтрагента.Представление КАК пДоговор,
	|	1 КАК пНом,
	|	ДокНачисления.Номенклатура.Представление КАК пНаименование,
	|	ДокНачисления.Номенклатура.ЕдиницаИзмерения.Представление КАК пЕдИзм,
	|	1 КАК пКоличество,
	|	ТабЧасть.Сумма КАК пЦена,
	|	ТабЧасть.Сумма КАК пСумма,
	|	ТабЧасть.СуммаНДС КАК пИтогНДС,
	|	ВЫБОР
	|		КОГДА ДокНачисления.СуммаВключаетНДС
	|			ТОГДА ТабЧасть.Сумма
	|		ИНАЧЕ ТабЧасть.Сумма + ТабЧасть.СуммаНДС
	|	КОНЕЦ КАК пИтогСумма,
	|	ВЫБОР
	|		КОГДА ДокНачисления.СуммаВключаетНДС
	|			ТОГДА ТабЧасть.Сумма
	|		ИНАЧЕ ТабЧасть.Сумма + ТабЧасть.СуммаНДС
	|	КОНЕЦ КАК пИтогВсего,
	|	ДокНачисления.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДокНачисления.ВалютаДокумента КАК ВалютаДокумента,
	|	ДокНачисления.Номер КАК НомерНачисления,
	|	ДокНачисления.Ссылка КАК Начисление,
	|	"""" КАК НомерСФ,
	|	"""" КАК СФСсылка,
	|	ТабЧасть.НомерСтроки КАК НомСтр,
	|	ДокНачисления.ВалютаДокумента.Представление КАК пВалюта,
	|	ДокНачисления.Руководитель КАК Руководитель,
	|	ТабЧасть.ОформлятьЭД КАК ОформлятьЭД,
	|	ТабЧасть.ИдентификаторЭД КАК ИдентификаторЭД
	|ПОМЕСТИТЬ ТабПечать
	|ИЗ
	|	Документ.НачислениеЗаУслугиОбразования КАК ДокНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НачислениеЗаУслугиОбразования.Начисления КАК ТабЧасть
	|		ПО ДокНачисления.Ссылка = ТабЧасть.Ссылка,
	|	Константа.КонтрагентСводнаяСчетФактураУслугиОбразования КАК КонтрагентСводнаяСчетФактураУслугиОбразования
	|ГДЕ
	|	ДокНачисления.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабПечать.ДокументОснование КАК ДокументОснование,
	|	ТабПечать.Организация КАК Организация,
	|	ТабПечать.пНаименованиеОрганизации КАК пНаименованиеОрганизации,
	|	ТабПечать.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТабПечать.Контрагент.ВидКонтрагента ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ТабПечать.Контрагент.НаименованиеСокращенное = """"
	|						ТОГДА ВЫБОР
	|								КОГДА ТабПечать.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|										И НЕ ТабПечать.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|									ТОГДА ТабПечать.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|								ИНАЧЕ ТабПечать.Контрагент.Наименование
	|							КОНЕЦ
	|					ИНАЧЕ ТабПечать.Контрагент.НаименованиеСокращенное
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	ТабПечать.Контрагент.ИНН КАК КонтрагентИНН,
	|	ТабПечать.Контрагент.КПП КАК КонтрагентКПП,
	|	ТабПечать.пДата КАК пДата,
	|	ТабПечать.пДоговор КАК пДоговор,
	|	ТабПечать.пНом КАК пНом,
	|	ТабПечать.пНаименование КАК пНаименование,
	|	ТабПечать.пЕдИзм КАК пЕдИзм,
	|	ТабПечать.пКоличество КАК пКоличество,
	|	СУММА(ЕстьNull(ТабПечать.пЦена,0)) КАК пЦена,
	|	СУММА(ЕстьNull(ТабПечать.пСумма,0)) КАК пСумма,
	|	СУММА(ЕстьNull(ТабПечать.пИтогНДС,0)) КАК пИтогНДС,
	|	СУММА(ЕстьNull(ТабПечать.пИтогСумма,0)) КАК пИтогСумма,
	|	СУММА(ЕстьNull(ТабПечать.пИтогВсего,0)) КАК пИтогВсего,
	|	ТабПечать.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ТабПечать.ВалютаДокумента КАК ВалютаДокумента,
	|	ТабПечать.НомерНачисления КАК НомерНачисления,
	|	ТабПечать.Начисление КАК Начисление,
	|	ТабПечать.НомерСФ КАК НомерСФ,
	|	ТабПечать.СФСсылка КАК СФСсылка,
	|	ТабПечать.пВалюта КАК пВалюта,
	|	ТабПечать.Руководитель КАК Руководитель,
	|	ТабПечать.НомСтр КАК НомСтр,
	|	ЕстьNull(ТабПечать.ОформлятьЭД, Ложь) КАК ОформлятьЭД,
	|	ТабПечать.ИдентификаторЭД КАК ИдентификаторЭД
	|ИЗ
	|	ТабПечать КАК ТабПечать
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабПечать.ДокументОснование,
	|	ТабПечать.Организация,
	|	ТабПечать.пНаименованиеОрганизации,
	|	ТабПечать.Контрагент,
	|	ВЫБОР
	|		КОГДА ТабПечать.Контрагент.ВидКонтрагента ЕСТЬ НЕ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ТабПечать.Контрагент.НаименованиеСокращенное = """"
	|						ТОГДА ВЫБОР
	|								КОГДА ТабПечать.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|										И НЕ ТабПечать.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|									ТОГДА ТабПечать.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|								ИНАЧЕ ТабПечать.Контрагент.Наименование
	|							КОНЕЦ
	|					ИНАЧЕ ТабПечать.Контрагент.НаименованиеСокращенное
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ТабПечать.Контрагент.ИНН,
	|	ТабПечать.Контрагент.КПП,
	|	ТабПечать.пДата,
	|	ТабПечать.пДоговор,
	|	ТабПечать.пНом,
	|	ТабПечать.пНаименование,
	|	ТабПечать.пЕдИзм,
	|	ТабПечать.пКоличество,
	|	ТабПечать.СуммаВключаетНДС,
	|	ТабПечать.ВалютаДокумента,
	|	ТабПечать.НомерНачисления,
	|	ТабПечать.Начисление,
	|	ТабПечать.НомерСФ,
	|	ТабПечать.СФСсылка,
	|	ТабПечать.пВалюта,
	|	ТабПечать.Руководитель,
	|	ТабПечать.НомСтр,
	|	ТабПечать.ОформлятьЭД,
	|	ТабПечать.ИдентификаторЭД
	|ИТОГИ ПО
	|	ДокументОснование";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектовДляЗапроса);
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	
	ВыборкаОснование = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаОснование.Следующий() Цикл
		
		ВыборкаШапка = ВыборкаОснование.Выбрать();
		ЗапомнитьНачалоОбласти = Истина;
	
		Пока ВыборкаШапка.Следующий() Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			Если ВыборкаШапка.ОформлятьЭД Тогда
				//Электронные акты
				Продолжить;
			КонецЕсли;	
			
			ПервыйДокумент = Ложь;
			Если ЗапомнитьНачалоОбласти Тогда
				НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				ЗапомнитьНачалоОбласти = Ложь;
			КонецЕсли;
			
			ОбластьШапка.Параметры.Заполнить(ВыборкаШапка);
			
			АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаШапка.Организация,
				Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаШапка.Организация,
				Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
				
			СтруктураОбластьШапка = Новый Структура("пАдресТелефон,пЗаказчик,пДата,пНомер");
			СтруктураОбластьШапка.пАдресТелефон = АдресОрганизации
				+ ?(ПустаяСтрока(ТелефонОрганизации), "", ", тел.:"+ТелефонОрганизации);
			
			СтруктураОбластьШапка.пЗаказчик = ВыборкаШапка.КонтрагентНаименование
			+ ?(ПустаяСтрока(ВыборкаШапка.КонтрагентИНН), "", " ИНН " + ВыборкаШапка.КонтрагентИНН)
			+ ?(ПустаяСтрока(ВыборкаШапка.КонтрагентКПП), "", " КПП " + ВыборкаШапка.КонтрагентКПП);
			
			СтруктураОбластьШапка.пДата	= Формат(ВыборкаШапка.пДата, "ДЛФ=DD");		
			СтруктураОбластьШапка.пНомер = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаШапка.Начисление,ВыборкаШапка.НомерНачисления) + "/" + ВыборкаШапка.НомСтр;
			ОбластьШапка.Параметры.Заполнить(СтруктураОбластьШапка);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаШапка);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ОбластьИтоги.Параметры.Заполнить(Новый Структура("пТекстНДС",?(ВыборкаШапка.СуммаВключаетНДС, "В том числе НДС", "Итого НДС")));
			ОбластьИтоги.Параметры.Заполнить(ВыборкаШапка);
			
			ТабличныйДокумент.Вывести(ОбластьИтоги);
			СтруктураОбластьПодвал = Новый Структура("пИтогВсегоПрописью,пИтогНДСПрописью,РуководительДолжность,РуководительФИО");
			СтруктураОбластьПодвал.пИтогВсегоПрописью 	= ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(ВыборкаШапка.пИтогВсего, ВыборкаШапка.ВалютаДокумента);
			СтруктураОбластьПодвал.пИтогНДСПрописью 	= ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(ВыборкаШапка.пИтогНДС, ВыборкаШапка.ВалютаДокумента);
			
			ДанныеРуководителя = Новый Структура("СсылкаНаОбъект, Период, Должность", ВыборкаШапка.Руководитель, ВыборкаШапка.пДата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеРуководителя);
			СтруктураОбластьПодвал.РуководительДолжность = ДанныеРуководителя.Должность;
			СтруктураОбластьПодвал.РуководительФИО = Справочники.Сотрудники.ФамилияИО(ВыборкаШапка.Руководитель, Истина, ВыборкаШапка.пДата);
			
			ОбластьПодвал.Параметры.Заполнить(СтруктураОбластьПодвал);
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
		КонецЦикла;
		
		// В табличном документе зададим имя области, в которую был выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаОснование.ДокументОснование);
		
	КонецЦикла;		
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДокумента

Функция ЗаполнитьНаОсновании(Знач Основание, Объект, ОписаниеОшибки = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнен документ основания.'");
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаДоходовБудущихПериодовОбразование") Тогда
		
		Объект.ДокументОснование = Основание;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КорректировкаДоходовБудущихПериодовОбразование.Ссылка КАК Ссылка,
		|	КорректировкаДоходовБудущихПериодовОбразование.Дата КАК Дата,
		|	КорректировкаДоходовБудущихПериодовОбразование.Организация КАК Организация,
		|	КорректировкаДоходовБудущихПериодовОбразование.ИФО КАК ИФО,
		|	КорректировкаДоходовБудущихПериодовОбразование.Студент КАК Студент,
		|	КорректировкаДоходовБудущихПериодовОбразование.Контрагент КАК Контрагент,
		|	КорректировкаДоходовБудущихПериодовОбразование.Договор КАК ДоговорКонтрагента,
		|	КорректировкаДоходовБудущихПериодовОбразование.СпособПризнанияДоходов КАК СпособПризнанияДоходов,
		|	КорректировкаДоходовБудущихПериодовОбразование.ДатаНачалаСписания КАК ДатаНачалаСписания,
		|	КорректировкаДоходовБудущихПериодовОбразование.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
		|	КорректировкаДоходовБудущихПериодовОбразование.СчетДоходов КАК СчетДоходов,
		|	КорректировкаДоходовБудущихПериодовОбразование.СубконтоДоходов1 КАК СубконтоДоходов1,
		|	КорректировкаДоходовБудущихПериодовОбразование.СубконтоДоходов2 КАК СубконтоДоходов2,
		|	КорректировкаДоходовБудущихПериодовОбразование.СубконтоДоходов3 КАК СубконтоДоходов3,
		|	КорректировкаДоходовБудущихПериодовОбразование.ВидДеятельностиНУ КАК ВидДеятельностиНУ,
		|	КорректировкаДоходовБудущихПериодовОбразование.СчетДоходовНУ КАК СчетДоходовНУ,
		|	КорректировкаДоходовБудущихПериодовОбразование.СтатьяПрочихДоходовНУ КАК СтатьяПрочихДоходовНУ,
		|	КорректировкаДоходовБудущихПериодовОбразование.ВидДеятельностиУСН КАК ВидДеятельностиУСН
		|ИЗ
		|	Документ.КорректировкаДоходовБудущихПериодовОбразование КАК КорректировкаДоходовБудущихПериодовОбразование
		|ГДЕ
		|	КорректировкаДоходовБудущихПериодовОбразование.Ссылка = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыБудущихПериодов.Ссылка.Студент КАК Студент,
		|	ДоходыБудущихПериодов.Ссылка.Контрагент КАК Контрагент,
		|	ДоходыБудущихПериодов.Ссылка.Договор КАК ДоговорКонтрагента,
		|	ДоходыБудущихПериодов.Номенклатура КАК Номенклатура,
		|	ДоходыБудущихПериодов.Номенклатура.СтавкаНДС КАК СтавкаНДС,
		|	ДоходыБудущихПериодов.СчетДБП КАК СчетДБП,
		|	ДоходыБудущихПериодов.КФО КАК КФО,
		|	ДоходыБудущихПериодов.КПС КАК КПС,
		|	ДоходыБудущихПериодов.КЭК КАК КЭК,
		|	ДоходыБудущихПериодов.Подразделение КАК Подразделение,
		|	ДоходыБудущихПериодов.ОстатокДБП + ДоходыБудущихПериодов.Всего КАК Сумма
		|ИЗ
		|	Документ.КорректировкаДоходовБудущихПериодовОбразование.ДоходыБудущихПериодов КАК ДоходыБудущихПериодов
		|ГДЕ
		|	ДоходыБудущихПериодов.Ссылка = &Основание
		|	И ДоходыБудущихПериодов.ОстатокДБП + ДоходыБудущихПериодов.Всего <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоходыБудущихПериодов.НомерСтроки";
		Запрос.УстановитьПараметр("Основание", Основание);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		Шапка      = РезультатЗапроса[0].Выгрузить();
		Начисления = РезультатЗапроса[1].Выгрузить();
		
		ЗаполнитьЗначенияСвойств(Объект, Шапка[0], "Дата,Организация,ИФО");
		Объект.ВидОперации = Перечисления.ВидыОперацийНачисленияУчащимся.ПоДолгосрочнымДоговорам;
		
		Если Начисления.Количество() = 0 Тогда
			// Не обнаружено остатков доходов будущих периодов для отражения в доходах текущего периода.
			Возврат Истина;
		КонецЕсли;
		
		Начисления.Свернуть("Студент,Контрагент,ДоговорКонтрагента,Номенклатура,СтавкаНДС,СчетДБП,КФО,КПС,КЭК,Подразделение", "Сумма");
		// Заполняем из первой строки. Разная аналитика (Номенклатура) по одному договору обучения не рекомендуется.
		// Разная аналитика (КФО, КПС, КЭК) по одному договору обучения не поддерживается (нет необходимости).
		Объект.Факультет = Начисления[0].Подразделение;
		
		НачислениеЗаПоследнийМесяц = Объект.Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НачислениеЗаПоследнийМесяц, Начисления[0]);
		ЗаполнитьЗначенияСвойств(НачислениеЗаПоследнийМесяц, Шапка[0],
			"СпособПризнанияДоходов,ДатаНачалаСписания,ДатаОкончанияСписания,
			|СчетДоходов,СубконтоДоходов1,СубконтоДоходов2,СубконтоДоходов3,
			|ВидДеятельностиНУ,СчетДоходовНУ,СтатьяПрочихДоходовНУ");
		
		НачислениеЗаПоследнийМесяц.Коэффициент = 1;
		НачислениеЗаПоследнийМесяц.КоэффициентЧислитель = 1;
		НачислениеЗаПоследнийМесяц.КоэффициентЗнаменатель = 1;
		
		Если ЗначениеЗаполнено(НачислениеЗаПоследнийМесяц.СтавкаНДС)
			И НачислениеЗаПоследнийМесяц.СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
			Объект.УчитыватьНДС = Истина;
			Объект.СуммаВключаетНДС = Истина;
			СтруктураПараметров = Новый Структура("Сумма, СтавкаНДС", НачислениеЗаПоследнийМесяц.Сумма, НачислениеЗаПоследнийМесяц.СтавкаНДС);
			НачислениеЗаПоследнийМесяц.СуммаНДС = УправлениеНФАКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтруктураПараметров, Объект.СуммаВключаетНДС);
		КонецЕсли;
		
		НачислениеЗаПоследнийМесяц.ОтразитьВГрафикеИсполненияДоговора = Перечисления.СтатусыДокументовКонтрольИсполненияДоговоров.ОтразитьСейчас;
		
		// Налоговый учет.
		Если НалоговыйУчетКлиентСервер.ОтражатьВНалоговомУчете(Объект.Организация, Объект.Дата, НачислениеЗаПоследнийМесяц.КФО) Тогда
			
			Если НЕ ЗначениеЗаполнено(НачислениеЗаПоследнийМесяц.ВидДеятельностиНУ) Тогда
				// По умолчанию - основная система налогообложения.
				НачислениеЗаПоследнийМесяц.ВидДеятельностиНУ = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НачислениеЗаПоследнийМесяц.СчетДоходовНУ) Тогда
				// По умолчанию - доходы от обычных видов деятельности.
				НачислениеЗаПоследнийМесяц.СчетДоходовНУ = БухгалтерскийУчет.СчетПоКоду("Н90.01", Объект.Дата);
			КонецЕсли;
			
			Если НЕ БухгалтерскийУчет.СчетВИерархии(НачислениеЗаПоследнийМесяц.СчетДоходовНУ, "Н91.01") Тогда
				НачислениеЗаПоследнийМесяц.СтатьяПрочихДоходовНУ = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
		НачислениеЗаПоследнийМесяц.ОстатокДБП = НачислениеЗаПоследнийМесяц.Сумма;
		Объект.СуммаДокумента = НачислениеЗаПоследнийМесяц.Сумма;
		
		Объект.Номенклатура = Начисления[0].Номенклатура;
		
		// ПорядокВыпискиСФ определяем по данным регистра ПлательщикиПоДоговоруОбразование.
		Отбор = Новый Структура("Организация,Студент,Договор,Контрагент",
			Объект.Организация,
			НачислениеЗаПоследнийМесяц.Студент,
			НачислениеЗаПоследнийМесяц.ДоговорКонтрагента,
			НачислениеЗаПоследнийМесяц.Контрагент);
		Сведения = РегистрыСведений.ПлательщикиПоДоговоруОбразование.ПолучитьПоследнее(КонецДня(Объект.Дата), Отбор);
		НачислениеЗаПоследнийМесяц.ПорядокВыпискиСФ = Сведения.ПорядокВыпискиСФ;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
