#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		
		// удаляем ИФО	
		Запрос = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;				
		
		// модифицируем текст запроса
		Запрос = СтрЗаменить(Запрос, "ЕПСБУОстатки.ИФО", "ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");
		Запрос = СтрЗаменить(Запрос, "(ИФО).*,", "");
		
		СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = Запрос;
		
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
		
		Запрос = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;				
		
		Запрос = СтрЗаменить(Запрос, "СтоимостьОбъектовОСОстаткиИОбороты.Подразделение", "ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)");
		Запрос = СтрЗаменить(Запрос, "(Подразделение).*,", "");				
		
		СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = Запрос;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
