
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	Иначе
		Организация = ПараметрыСеанса.ТекущаяОрганизация;
	КонецЕсли;
	
	ОбновитьОтображение();
	УстановитьВидимость();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьАктуальностьСверки();
	ПодключитьОбработчикОжидания("ПроверитьАктуальностьСверки", 5);
	
	ФормаПакетыДанных = ПолучитьФорму("Документ.ПакетыДанныхДляМСД.ФормаСписка");
	Если НЕ ФормаПакетыДанных.Открыта() Тогда
		ПолучитьУведомлениеПользователя();
		ПодключитьОбработчикОжидания("ПолучитьУведомлениеПользователя", 60);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
    ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Периодичность", ПредопределенноеЗначение("Перечисление.ПериодичностьМСД.Год"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("ОтображатьСписком", Истина);  
	
	ОткрытьФорму("Справочник.ПериодыМСД.ФормаВыбора", ПараметрыФормы, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ГодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ТекущийГод = ВыбранноеЗначение;
		ОбновитьОтображение(ТекущийГод);
	КонецЕсли;  
	
КонецПроцедуры  

&НаКлиенте
Процедура ВидДанныхПриИзменении(Элемент)	
	ОбновитьОтображение(ТекущийГод); 	
КонецПроцедуры

&НаКлиенте
Процедура УчетСдвигаПриИзменении(Элемент)
	ОбновитьОтображение(ТекущийГод);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьОтображение();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьАктуальностьСверки()
	ПроверитьАктуальностьСверкиНаСервере();	
КонецПроцедуры	

&НаСервере
Процедура ПроверитьАктуальностьСверкиНаСервере()	
	
	ПараметрыСверки = Новый Структура("ДополнительныеДанные", Год(ТекущаяДатаСеанса()));
	РезультатСтруктура = МодульСбораДанных.ПолучитьСведенияОСверкеСроков(ПараметрыСверки);
	ЗаполнитьЗаголовокКоманды(РезультатСтруктура);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображение(ВыбранныйГод = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПериодыМСД.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТТекущийГод
		|ИЗ
		|	Справочник.ПериодыМСД КАК ПериодыМСД
		|ГДЕ
		|	(ПериодыМСД.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьМСД.Год)
		|				И ПериодыМСД.ДатаНачала = &ДатаНачала
		|				И ПериодыМСД.ПометкаУдаления = ЛОЖЬ
		|				И &ВыбранныйГод = НЕОПРЕДЕЛЕНО
		|			ИЛИ ПериодыМСД.Ссылка = &ВыбранныйГод)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ПериодыМСД.Родитель.Периодичность = ЗНАЧЕНИЕ(Перечисление.ПериодичностьМСД.Месяц)
		|			ТОГДА ПериодыМСД.Родитель.ДатаНачала
		|	КОНЕЦ КАК РодительДатаНачала,
		|	ПериодыМСД.Ссылка КАК Период,
		|	ПериодыМСД.ДатаНачала КАК ДатаНачала,
		|	ЕСТЬNULL(КОНЕЦПЕРИОДА(СведенияОСрокахПредоставленияДанныхМСД.Срок, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1)) КАК Срок
		|ИЗ
		|	Справочник.ПериодыМСД КАК ПериодыМСД
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСрокахПредоставленияДанныхМСД КАК СведенияОСрокахПредоставленияДанныхМСД
		|		ПО (СведенияОСрокахПредоставленияДанныхМСД.ПериодДанных = ПериодыМСД.Ссылка)
		|ГДЕ
		|	ПериодыМСД.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ВТТекущийГод.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТТекущийГод КАК ВТТекущийГод)
		|	И ПериодыМСД.Периодичность В (&Периодичность)
		|	И ПериодыМСД.ПометкаУдаления = ЛОЖЬ
		|	И СведенияОСрокахПредоставленияДанныхМСД.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодыМСД.ДатаОкончания
		|ИТОГИ ПО
		|	РодительДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТекущийГод.Ссылка КАК Год
		|ИЗ
		|	ВТТекущийГод КАК ВТТекущийГод";             
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ВыбранныйГод", ВыбранныйГод); 
	Запрос.УстановитьПараметр("Организация", Организация); 
	
	МассивПериодичность = Новый Массив;
	Если ВидДанных = 0 Тогда 
		МассивПериодичность.Добавить(Перечисления.ПериодичностьМСД.Месяц);
	Иначе
	    МассивПериодичность.Добавить(Перечисления.ПериодичностьМСД.ПроизвольныйПериод);
		МассивПериодичность.Добавить(Перечисления.ПериодичностьМСД.Декада);
	КонецЕсли;	
	Запрос.УстановитьПараметр("Периодичность", МассивПериодичность);

	
	Пакет = Запрос.ВыполнитьПакет();
	
	СрокиПолугодие1.Очистить();
	СрокиПолугодие2.Очистить();
	РезРодитель = Пакет[1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	МаксПериодов = 0;
	Номер = 0;
	СдвигАвтоформированияСекунды = СдвигАвтоформирования * 60 * 60;
	
	Для Каждого СтрРодитель Из РезРодитель.Строки Цикл
		Номер = Номер + 1;
		ТекТаблица = ?(Номер < 7, СрокиПолугодие1, СрокиПолугодие2);
		
		Если ВидДанных = 0 Тогда   
			
			Для Каждого Рез Из СтрРодитель.Строки Цикл  
				Если ЗначениеЗаполнено(Рез.Срок) Тогда
					ТекТаблица = ?(Номер < 7, СрокиПолугодие1, СрокиПолугодие2);
					Если ТекТаблица.Количество() = 0 Тогда
						Доб = ТекТаблица.Добавить();
					Иначе
						Доб = ТекТаблица[0]; 
					КонецЕсли;
					ИмяКолонки = Формат(Рез.ДатаНачала,НСтр("ru='ДФ=''ММММ'''")); 
					Если Доб.Свойство(ИмяКолонки) Тогда
						ФорматСрок = ?(УчетСдвига, Формат(Рез.Срок + СдвигАвтоформированияСекунды,НСтр("ru='ДФ=''dd.MM.yyyy HH:mm'''")),Формат(Рез.Срок,"ДЛФ=D"));
						Доб[ИмяКолонки] = ФорматСрок;
					КонецЕсли;
				КонецЕсли;
				Номер = Номер + 1;
			КонецЦикла;
		Иначе                            
			
			ТекПериодов = СтрРодитель.Строки.Количество();
			
			НеЗаполнено = Истина;
			Для Каждого Рез Из СтрРодитель.Строки Цикл
				Если ЗначениеЗаполнено(Рез.Срок) Тогда
					НеЗаполнено = Ложь;
				КонецЕсли;
			КонецЦикла; 
			Если НеЗаполнено Тогда
				Продолжить;
			КонецЕсли;
			
			Если МаксПериодов < ТекПериодов Тогда
				МаксПериодов = ТекПериодов;
			КонецЕсли; 
			
			Пока ТекТаблица.Количество() <> МаксПериодов Цикл
				ТекТаблица.Добавить();
			КонецЦикла;
			
			ИмяКолонки = Формат(СтрРодитель.РодительДатаНачала,НСтр("ru='ДФ=''ММММ'''"));
			НомерСтроки = 0;
			Для Каждого Рез Из СтрРодитель.Строки Цикл 
				ФорматСрок = ?(УчетСдвига, Формат(Рез.Срок + СдвигАвтоформированияСекунды,НСтр("ru='ДФ=''dd.MM.yyyy HH:mm'''")),Формат(Рез.Срок,"ДЛФ=D"));
				Значение = Строка(Рез.Период) + ": " + ФорматСрок;
				ТекТаблица[НомерСтроки][ИмяКолонки] = Значение;
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;                            
	
	Если Не ЗначениеЗаполнено(ВыбранныйГод) Тогда
		Рез = Пакет[2].Выбрать();
		Пока Рез.Следующий() Цикл
			ТекущийГод = Рез.Год;
		КонецЦикла;                                  
	КонецЕсли;

КонецПроцедуры
	
&НаКлиенте
Процедура ПроверитьАктуальность(Команда)
	ОткрытьФорму("Обработка.ЗагрузкаТаксономии.Форма.Форма", Новый Структура("ТипФормы, Организация, Год", 
					"СрокиПредоставления", Организация, ПолучитьГодСсылки(ТекущийГод)));	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГодСсылки(ГодСсылка)
	Возврат Год(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГодСсылка, "ДатаНачала"));
КонецФункции
	
&НаСервере 
Процедура ЗаполнитьЗаголовокКоманды(РезультатСтруктура)
	
	Если НЕ РезультатСтруктура = Неопределено Тогда
		Элементы.ДекорацияСрок.Заголовок = РезультатСтруктура.АктуальностьНадпись;
		Элементы.ДекорацияСрок.ЦветТекста = РезультатСтруктура.ЦветНадписи;		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимость()
		
	СдвигАвтоформирования = Константы.СдвигАвтоформированияДанныхДляМСД.Получить(); 
	Элементы.ГруппаСдвиг.Видимость = ЗначениеЗаполнено(СдвигАвтоформирования);
	Элементы.ДекорацияСдвиг.Заголовок = СтрШаблон(Элементы.ДекорацияСдвиг.Заголовок, СдвигАвтоформирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеОповещения(ДополнительныеПараметры) Экспорт
 	ОткрытьФорму("Документ.ПакетыДанныхДляМСД.ФормаСписка");
КонецПроцедуры 

&НаКлиенте
Процедура ПолучитьУведомлениеПользователя()
	
	МассивРезультат = ПолучитьУведомлениеПользователяНаСервере(); 
	
	Для каждого СтрокаМассива Из МассивРезультат Цикл
		ВыводитьОповещение = Истина;
		Если НЕ ХранилищеСравненияОповещений.НайтиПоЗначению(СтрокаМассива.ИдентификаторСтроки) = Неопределено Тогда
			ВыводитьОповещение = Ложь;	
		КонецЕсли;	
		
		Если ВыводитьОповещение = Истина Тогда
			Описание = Новый ОписаниеОповещения("ОткрытиеОповещения", ЭтотОбъект);	
			ПоказатьОповещениеПользователя(СтрШаблон(НСтр("ru='Отчетный период: %1'"), СтрокаМассива.ПериодДанных),
									      Описание,
			                              СтрокаМассива.Результат,
									      БиблиотекаКартинок.Оповещения,
									      СтатусОповещенияПользователя.Важное,
								          СтрокаМассива.ПериодДанных);
			ХранилищеСравненияОповещений.Добавить(СтрокаМассива.ИдентификаторСтроки);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьУведомлениеПользователяНаСервере()
	Возврат МодульСбораДанных.УведомлениеПользователя();
КонецФункции  

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбновитьОтображение();
КонецПроцедуры

#КонецОбласти 

