
&НаКлиенте
Процедура ВыполнитьЗамену(Команда)
	
	СписокДок = ВыполнитьЗаменуНаСервере(Организация);
	
	СписокДокументов.ЗагрузитьЗначения(СписокДок);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Замена выполнена!'"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьЗаменуНаСервере(Организация)

	КЭК410 = Справочники.КОСГУ.НайтиПоКоду("410");
	КЭК411 = Справочники.КОСГУ.НайтиПоКоду("411");
	КЭК420 = Справочники.КОСГУ.НайтиПоКоду("420");
	КЭК421 = Справочники.КОСГУ.НайтиПоКоду("421");
	
	СтарыйКЭК = Новый Массив;
	СтарыйКЭК.Добавить(КЭК410);
	СтарыйКЭК.Добавить(КЭК420);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПериодНачало", '20180101');
	Запрос.УстановитьПараметр("Счет"		, БухгалтерскийУчет.СписокСчетов("104.00"));
	Запрос.УстановитьПараметр("СтарыйКЭК"	, СтарыйКЭК);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Движения.Регистратор КАК Регистратор,
	|	Движения.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Движения.СчетКт В (&Счет)
	|			ТОГДА ""Кт""
	|		ИНАЧЕ ""Дт""
	|	КОНЕЦ КАК Сторона
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК Движения
	|ГДЕ
	|	Движения.Период >= &ПериодНачало
	|	И Движения.Организация = &Организация
	|	И (Движения.СчетДт В (&Счет)
	|				И Движения.КЭКДт В (&СтарыйКЭК)
	|			ИЛИ Движения.СчетКт В (&Счет)
	|				И Движения.КЭККт В (&СтарыйКЭК))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Движения.Период
	|ИТОГИ ПО
	|	Регистратор";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Движения.Организация = &Организация", ""); 
	КонецЕсли;
	
	ВыборкаДок = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	СписокДок = Новый Массив;
	
	Пока ВыборкаДок.Следующий() Цикл
		
		НаборЗаписей = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДок.Регистратор);
		НаборЗаписей.Прочитать();
		
		Выборка = ВыборкаДок.Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = НаборЗаписей[Выборка.НомерСтроки-1];
			НовыйКЭК = ?(Запись["КЭК" + Выборка.Сторона] = КЭК410, КЭК411, КЭК421);
			Запись["КЭК" + Выборка.Сторона] = НовыйКЭК;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		СписокДок.Добавить(ВыборкаДок.Регистратор);
		
	КонецЦикла;
	
	Возврат СписокДок;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьПроводки(Команда)
	
	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ДокументОснование", ТекущиеДанные.Значение);
	ОткрытьФорму("Обработка.ФормированиеБухгалтерскихПроводок.Форма.Форма", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(, СписокДокументов[ВыбраннаяСтрока].Значение);
	
КонецПроцедуры
