////////////////////////////////////////////////////////////////////////////////
// БУХГАЛТЕРСКИЙ УЧЕТ, КЛИЕНТСКИЕ ПРОЦЕДУРЫ И ФУНКЦИИ                         //
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ОчиститьФлагОтразитьВМежотчетномПериоде(Форма) Экспорт

	Если Форма.Объект.Дата <> КонецГода(Форма.Объект.Дата)
		И Форма.ОтразитьВМежотчетномПериоде Тогда
		
		Форма.ОтразитьВМежотчетномПериоде = Ложь;
		УстановитьЗначениеВидаМежотчетногоПериода(Форма, Неопределено);
		ПоказатьОповещениеПользователя(НСтр("ru = 'Отражение в межотчетном периоде'"),,
			НСтр("ru = 'Отразить в межотчетном периоде можно только операции последней секунды года.
				|Признак ""Отразить в межотчетном периоде"" выключен.'"));
		
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЗначениеВидаМежотчетногоПериода(Форма, ВидМежотчетногоПериода) Экспорт

	Форма.Объект.ВидМежотчетногоПериода = ?(Форма.ОтразитьВМежотчетномПериоде, ВидМежотчетногоПериода,
		ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидМежотчетногоПериода",
		"Видимость", Форма.ОтразитьВМежотчетномПериоде);  
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ФинансовыйГод",
		"Видимость", Форма.ОтразитьВМежотчетномПериоде);

КонецПроцедуры

// Используется для открытия формы выбора справочника КПС с установленным отбором.
// Установка отбора призводится по данным учетной политики организации,
// счету или списку переданных ограничений вида.
// В случае передачи нескольких критериев отбора, результирующий отбор 
// устанавливается как пересечение множеств отборов, полученных по всем переданным
// критериям.
// 
// Параметры
//  Элемент - элемент формы - элемент владелец формы выбора.
//  Организация - СправочникСсылка.Организации.
//  ИФО - СправочникСсылка.ИсточникиФинансовогоОбеспечения.
//  КФО - Перечислениессылка.КВД.
//  ОграниченияКПС - ПланСчетовСсылка, ПеречислениеСсылка.ВидыКБК, СписокЗначений,
//                 содержащий значения указанных типов.
//  НаДату - Дата - дата, по состоянию на которую действуют выбираемые значения КПС.
//                Если значение не указано используется текущая дата сеанса. 
//  
// Устанавливаемые поля:
//  СтандартнаяОбработка - булево - устанавливается в значение ЛОЖЬ.
//
Процедура ОткрытьФормуВыбораКПС(Элемент, 
								СтандартнаяОбработка,
								НачальноеЗначениеВыбора,
								Организация = Неопределено, 
								ИФО = Неопределено, 
								КФО = Неопределено, 
								ОграниченияКПС = Неопределено, 
								НаДату = Неопределено,
								ГруппаОтбораПоВР = Неопределено,
								ОписаниеОповещенияОЗакрытии = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ДополнительныйОтбор", Новый Структура);
	
	ПараметрыФормы.Вставить("ТекущаяСтрока", НачальноеЗначениеВыбора);
	
	Если НЕ НаДату = Неопределено Тогда 
		ПараметрыФормы.ДополнительныйОтбор.Вставить("НаДату", НаДату);
	КонецЕсли;	
	
	ОграниченияУчетнойПолитики = Новый Структура;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ОграниченияУчетнойПолитики.Вставить("Организация", Организация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИФО) Тогда
		ОграниченияУчетнойПолитики.Вставить("ИФО", ИФО);
	КонецЕсли;

	Если ЗначениеЗаполнено(КФО) Тогда
		ОграниченияУчетнойПолитики.Вставить("КФО", КФО);
	КонецЕсли;
	
	Если НЕ ОграниченияУчетнойПолитики.Количество() = 0 Тогда
		ОграниченияУчетнойПолитики.Вставить("НаДату", НаДату);
		ПараметрыФормы.ДополнительныйОтбор.Вставить("ОграниченияУчетнойПолитики", ОграниченияУчетнойПолитики);
	КонецЕсли;
	
	Если НЕ ОграниченияКПС = Неопределено Тогда
		ПараметрыФормы.ДополнительныйОтбор.Вставить("ОграниченияКПС", ОграниченияКПС);
	КонецЕсли;
	
 	Если НЕ ГруппаОтбораПоВР = Неопределено Тогда
		ПараметрыФормы.ДополнительныйОтбор.Вставить("ГруппаОтбораПоВР", ГруппаОтбораПоВР);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.КлассификационныеПризнакиСчетов.ФормаВыбора", ПараметрыФормы, Элемент,,,,ОписаниеОповещенияОЗакрытии);	
		
КонецПроцедуры	

// Используется для открытия формы выбора полного рабочего счета с установленным отбором.
// Установка отбора призводится по данным учетной политики организации,
// счету или списку переданных ограничений.
// В случае передачи нескольких критериев отбора, результирующий отбор 
// устанавливается как пересечение множеств отборов, полученных по всем переданным
// критериям.
// 
// Параметры
//  Элемент - элемент формы - элемент владелец формы выбора.
//  Организация - СправочникСсылка.Организации.
//  ИФО - СправочникСсылка.ИсточникиФинансовогоОбеспечения.
//  Счет - ПланСчетовСсылка, коллекции значений - СписокЗначений, Массив, содержащие значения
//         типа ПланСчетовСсылка.
//  КФО - Перечислениессылка.КВД.
//  ОграниченияКПС - ПеречислениеСсылка.ВидыКБК, коллекции значений - СписокЗначений, Массив 
//                 содержащий значения типа ПеречислениеСсылка.ВидыКБК.
//  НаДату - Дата - дата, по состоянию на которую действуют выбираемые значения рабочего ПС.
//                Если значение не указано используется текущая дата сеанса. 
//  НачальноеЗначениеВыбора - Структура, содержит значения для заполнения свойств ключа записи
//                            регистра Рабочие счета для позиционирования в списке
//                            Имена элементов структуры:
//                            "КФО" 
//                            "Счет"
//                            "КПС"
//  
// Устанавливаемые поля:
//  СтандартнаяОбработка - булево - устанавливается в значение ЛОЖЬ.
//
Процедура ОткрытьФормуВыбораРабочегоСчета(	Элемент, 
											СтандартнаяОбработка,
											НачальноеЗначениеВыбора = Неопределено,
											Организация = Неопределено, 
											ИФО = Неопределено,
											Счет = Неопределено,
                                			КФО = Неопределено, 
											ОграниченияКПС = Неопределено, 
											НаДату = Неопределено,
											КорреспонденцииСчетов = Неопределено,
											ОграничениеПоСубконто = Неопределено) Экспорт
	Перем КорреспонденцияДт;
	Перем КорреспонденцияКт;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ДополнительныйОтбор", Новый Структура);
	
	Если ТипЗнч(НачальноеЗначениеВыбора) = Тип("Структура") Тогда
		ПараметрыФормы.ДополнительныйОтбор.Вставить("ТекущаяСтрока", НачальноеЗначениеВыбора);
	Иначе
		ПараметрыФормы.ДополнительныйОтбор.Вставить("ТекущаяСтрока", Новый Структура);
	КонецЕсли;	
	
	Если НЕ НаДату = Неопределено Тогда 
		ПараметрыФормы.ДополнительныйОтбор.Вставить("НаДату", НаДату);
	КонецЕсли;	
	
	Если НЕ Счет = Неопределено Тогда 
		ПараметрыФормы.ДополнительныйОтбор.Вставить("Счет", Счет);
	КонецЕсли;
	
	ОграниченияУчетнойПолитики = Новый Структура;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ОграниченияУчетнойПолитики.Вставить("Организация", Организация);
		ПараметрыФормы.ДополнительныйОтбор.ТекущаяСтрока.Вставить("Организация", Организация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИФО) Тогда
		ОграниченияУчетнойПолитики.Вставить("ИФО", ИФО);
		ПараметрыФормы.ДополнительныйОтбор.ТекущаяСтрока.Вставить("ИФО", ИФО); 
	ИначеЕсли НЕ ПолучитьФункциональнуюОпциюИнтерфейса("ИспользоватьУчетПоИФО") Тогда
		// Для ситуации, когда учет по ИФО велся, но потом был отключен.
		// ИФО в списке рабочих счетов очистить нельзя, поэтому установим фильтр
		ОграниченияУчетнойПолитики.Вставить("ИФО", ПредопределенноеЗначение("Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка"));
		ПараметрыФормы.ДополнительныйОтбор.ТекущаяСтрока.Вставить("ИФО", ПредопределенноеЗначение("Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка")); 
	КонецЕсли;

	Если ЗначениеЗаполнено(КФО) Тогда
		ОграниченияУчетнойПолитики.Вставить("КФО", КФО);
	КонецЕсли;
	
	Если НЕ ОграниченияУчетнойПолитики.Количество() = 0 Тогда
		ПараметрыФормы.ДополнительныйОтбор.Вставить("ОграниченияУчетнойПолитики", ОграниченияУчетнойПолитики);
	КонецЕсли;
	
	Если НЕ ОграниченияКПС = Неопределено Тогда
		 ПараметрыФормы.ДополнительныйОтбор.Вставить("ОграниченияКПС", ОграниченияКПС);
	КонецЕсли;
	 
	Если ТипЗнч(КорреспонденцииСчетов) = Тип("Структура") Тогда
		КорреспонденцииСчетов.Свойство("КорреспонденцияДт", КорреспонденцияДт);
		КорреспонденцииСчетов.Свойство("КорреспонденцияКт", КорреспонденцияКт);
		Если ЗначениеЗаполнено(КорреспонденцияДт) Тогда
			ПараметрыФормы.Вставить("КорреспонденцияДт", КорреспонденцияДт);
		КонецЕсли;
		Если ЗначениеЗаполнено(КорреспонденцияКт) Тогда
			ПараметрыФормы.Вставить("КорреспонденцияКт", КорреспонденцияКт);
		КонецЕсли;
	КонецЕсли;
	
	Если ОграничениеПоСубконто <> Неопределено Тогда
		ПараметрыФормы.Вставить("ОграничениеПоСубконто", ОграничениеПоСубконто);
	КонецЕсли;
	
	ОткрытьФорму("ПланСчетов.ЕПСБУ.Форма.ФормаВыбораРабочегоСчета", ПараметрыФормы, Элемент);	
		
КонецПроцедуры	

// Используется для установки значений структурных частей номера счета после 
// выбора в форме "ФормаВыбораРабочегоСчета"
//
// Параметры
//  ВыбранноеЗначение - структура - содержит сформированные в форме "ФормаВыбораРабочегоСчета"
//                      значения структурных частей номера счета.
//                      Ключи структуры:
//							КПС, 
//							КФО, 
//							Счет, 
//							КОСГУДт, 
//							КОСГУКт
//                      В зависимости от типа счета могут присутствовать не все структурные части,
//                      Например, для забалансовых счетов будет только ключ "Счет".
//                      КОСГУ определяется в зависимости от учетной политики и свойств счета,
//                      присутствуют только для счетов, у которых в настройке установлены значения КОСГУ
//                      по дебету и кредиту, если в учетной политике установлена классификация КЭК
//                      "произвольная" возвращается КОСГУ 000
//  
// Устанавливаемые поля:
//  ВыбранноеЗначение - устанавливается в значение Счет.
//  КПС, КФО, Счет, КОСГУДт, КОСГУКт - устанавливаются при необходимости значения структурных частей счета 
//
Процедура ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
										КПС = Неопределено, 
										КФО = Неопределено,
										КОСГУДт = Неопределено, 
										КОСГУКт = Неопределено) Экспорт
	
	Перем Счет;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		 ВыбранноеЗначение.Свойство("Счет", 	Счет);
		 ВыбранноеЗначение.Свойство("КПС",  	КПС);
		 		 ВыбранноеЗначение.Свойство("КОСГУДт", 	КОСГУДт);
		 ВыбранноеЗначение.Свойство("КОСГУКт", 	КОСГУКт);
		 
		 Если ВыбранноеЗначение.Свойство("КФО") Тогда
			 КФО = ВыбранноеЗначение.КФО;
         КонецЕсли;
		 
		 ВыбранноеЗначение = Счет;
		 
	КонецЕсли;	 
	
КонецПроцедуры	

// Используется для открытия формы выбора КЭК с установленным отбором.
// Установка отбора призводится по данным учетной политики организации,
// или (и) счету.
// Если для счета установлено значение КЭК по умолчанию - список ограничивается 
// выбором только этого значения. Если для счета установлен в регистре "КЭК счетов"
// список допустимых значений - ограничения устанавливаются по списку. Если для счета
// ограничений не установлено - для выбора выдается весь список КЭК.
// 
// Параметры
//  Элемент - элемент формы - элемент владелец формы выбора.
//  Организация - СправочникСсылка.Организации.
//  ИФО - СправочникСсылка.ИсточникиФинансовогоОбеспечения.
//  Счет - ПланСчетовСсылка, коллекции значений - СписокЗначений, Массив, содержащие значения
//         типа ПланСчетовСсылка.
//  КФО - Перечислениессылка.КВД.
//  Счет - ПланСчетовСсылка, Строка, счет или код счета, для которого определяются 
//                 допустимые значения КЭК. Если счет не указан - отбор не устанавливается.
//  НаДату - Дата - дата, по состоянию на которую определяется учетная политика.
//                Если значение не указано используется текущая дата сеанса. 
//  НачальноеЗначениеВыбора - СправочникСсылка.КОСГУ
//  ДК - Строка, принимает значения "Дт", "Кт". 
//  ОграниченияКЭК - коллекции значений - СписокЗначений, Массив, содержащие значения
//  				 типа справчоникссылка.КОСГУ 
//  ВСпискеОграниченияКЭК	 	- флаг использования параметра "ОграниченияКЭК"
//								принимает: значение "истина" - выводятся только занчения 
//								из переданных в параметре "ОграниченияКЭК",
//								значение "ложь" - выводятся занчения 
//								все кроме переданных в параметре "ОграниченияКЭК"
//  Группа справочника	- отбор элементов по группе
//
// Устанавливаемые поля:
//  СтандартнаяОбработка - булево - устанавливается в значение ЛОЖЬ.
//
Процедура ОткрытьФормуВыбораКЭК(Элемент, 
								СтандартнаяОбработка,
								НачальноеЗначениеВыбора = Неопределено,
								Организация = Неопределено, 
								ИФО = Неопределено,
								КФО = Неопределено, 
                                Счет = Неопределено,
								НаДату = Неопределено,
								ДК = "",
								ОграниченияКЭК	= Неопределено,
								ВСпискеОграниченияКЭК = истина,
								ГруппаОтбора = неопределено,
								КПС = Неопределено,
								ВИЕРАРХИИ = ЛОЖЬ,
								МЕЖОТЧЕТНЫЙПЕРИОД = ЛОЖЬ) Экспорт
								
	СтандартнаяОбработка = Ложь;  
	
	ПараметрыФормы = ПолучитьПараметрыВыбораКОСГУ(
								НачальноеЗначениеВыбора,
								Организация, 
								ИФО,
								КФО, 
                                Счет,
								НаДату,
								ДК,
								ОграниченияКЭК,
								ВСпискеОграниченияКЭК,
								ГруппаОтбора,
								КПС,
								ВИЕРАРХИИ,
								МЕЖОТЧЕТНЫЙПЕРИОД);
		
	ОткрытьФорму("Справочник.КОСГУ.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры  

Функция ПолучитьПараметрыВыбораКОСГУ(НачальноеЗначениеВыбора = Неопределено,
								     Организация = Неопределено, 
								     ИФО = Неопределено,
								     КФО = Неопределено, 
                                     Счет = Неопределено,
								     НаДату = Неопределено,
								     ДК = "",
								     ОграниченияКЭК	= Неопределено,
								     ВСпискеОграниченияКЭК = истина,
								     ГруппаОтбора = неопределено,
								     КПС = Неопределено,
								     ВИЕРАРХИИ = ЛОЖЬ,
								     МЕЖОТЧЕТНЫЙПЕРИОД = ЛОЖЬ) Экспорт
	
	ПараметрыВыбораКОСГУ = Новый Структура("ДополнительныйОтбор", Новый Структура);
	
	ПараметрыВыбораКОСГУ.Вставить("ТекущаяСтрока", НачальноеЗначениеВыбора);
	
	ПараметрыВыбораКОСГУ.Вставить("ПоказатьСкрытыеКоды", МЕЖОТЧЕТНЫЙПЕРИОД);
		
	Если НЕ НаДату = Неопределено Тогда 
		ПараметрыВыбораКОСГУ.ДополнительныйОтбор.Вставить("НаДату", НаДату);
	КонецЕсли;	
	
	Если НЕ Счет = Неопределено Тогда 
		ПараметрыВыбораКОСГУ.ДополнительныйОтбор.Вставить("Счет", Счет);
		ПараметрыВыбораКОСГУ.ДополнительныйОтбор.Вставить("ДК", 	ДК);
	КонецЕсли;
	
	Если НЕ ОграниченияКЭК = Неопределено Тогда 
		ПараметрыВыбораКОСГУ.ДополнительныйОтбор.Вставить("ОграниченияКЭК", ОграниченияКЭК);
		ПараметрыВыбораКОСГУ.ДополнительныйОтбор.Вставить("ВСпискеОграниченияКЭК", ВСпискеОграниченияКЭК);
	КонецЕсли;	
	
	Если НЕ ГруппаОтбора = Неопределено Тогда 
		ПараметрыВыбораКОСГУ.ДополнительныйОтбор.Вставить("ГруппаОтбора", ГруппаОтбора);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(КПС) Тогда
		ПараметрыВыбораКОСГУ.ДополнительныйОтбор.Вставить("КПС", КПС);
	КонецЕсли;
	
	ПараметрыВыбораКОСГУ.ДополнительныйОтбор.Вставить("ВИЕРАРХИИ", ВИЕРАРХИИ);
	
	ОграниченияУчетнойПолитики = Новый Структура;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ОграниченияУчетнойПолитики.Вставить("Организация", Организация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИФО) Тогда
		ОграниченияУчетнойПолитики.Вставить("ИФО", ИФО);
	КонецЕсли;

	Если ЗначениеЗаполнено(КФО) Тогда
		ОграниченияУчетнойПолитики.Вставить("КФО", КФО);
	КонецЕсли;
	
	Если НЕ ОграниченияУчетнойПолитики.Количество() = 0 Тогда
		ПараметрыВыбораКОСГУ.ДополнительныйОтбор.Вставить("ОграниченияУчетнойПолитики", ОграниченияУчетнойПолитики);
	КонецЕсли; 
	
	Возврат ПараметрыВыбораКОСГУ;
	
КонецФункции	

// Используется для очистки реквизитов КПС в проводках, если по учетной политике они не соответствуют вновь выбранному КФО.
//
// Параметры
//  Организация - СправочникСсылка.Организации
//	ИФО			- СправочникСсылка.ИсточникиФинансовогоОбеспечения
//	КФО			- СправочникСсылка.КлассификационныеПризнакиСчетов
//	НаДату		- Дата
// устанавливаемые в процедуре значения
//	КПСДт		- СправочникСсылка.КлассификационныеПризнакиСчетов - КПС дебета проводки
//	КПСКт		- СправочникСсылка.КлассификационныеПризнакиСчетов - КПС кредита проводки
//
Процедура ОбработатьВыборКФО(Организация,
							 ИФО = Неопределено,
							 КФО,
							 НаДату = Неопределено,
							 КПСДт = Неопределено,
							 КПСКт = Неопределено) Экспорт
	ИспользуемыеКПС = БухгалтерскийУчетВызовСервераПовтИсп.КПСПоУчетнойПолитике(Организация, ИФО, КФО, НаДату);
	Если ЗначениеЗаполнено(КПСДт) И ИспользуемыеКПС.Найти(КПСДт) = Неопределено Тогда
		КПСДт = ПредопределенноеЗначение("Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка");
	КонецЕсли;
	Если ЗначениеЗаполнено(КПСКт) И ИспользуемыеКПС.Найти(КПСКт) = Неопределено Тогда
		КПСКт = ПредопределенноеЗначение("Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка");
	КонецЕсли;

КонецПроцедуры

// Вызывается из события ПриНачалеВыбораЗначения элемента формы содержащего субконто
// Для передачи параметров используется структура, возвращаемая функцией "ИнициализироватьСтруктуруНачалаВыбораСубконто"
//
Процедура ПриНачалеВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, Параметры) Экспорт
	
	НомерСубконто			= Параметры.НомерСубконто;
	МаксКоличествоСубконто	= БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьМаксКоличествоСубконто();
	
	Если НомерСубконто < 1 ИЛИ НомерСубконто > МаксКоличествоСубконто Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Параметры["Счет"]);
	ДопустимыеТипыЗначенияСубконто = ДанныеСчета["ВидСубконто"+НомерСубконто+"ТипЗначения"];
	
	Параметры.Вставить("ЭлементСубконто",		Элемент);
	Параметры.Вставить("СтандартнаяОбработка",	СтандартнаяОбработка);
	Параметры.Вставить("ВидСубконто", ДанныеСчета["ВидСубконто"+НомерСубконто]);
	
	Если ДопустимыеТипыЗначенияСубконто = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
	Иначе
		Если ДопустимыеТипыЗначенияСубконто.Типы().Количество()=1 Тогда
			ТипЗначения = ДопустимыеТипыЗначенияСубконто.Типы()[0];
			ПриНачалеВыбораСубконто_ОткрытьФормуВыбора(ТипЗначения, СтандартнаяОбработка, Параметры);
		Иначе
			СтандартнаяОбработка = Ложь;
			
			СписокТипов = Новый СписокЗначений;
			СписокТипов.ЗагрузитьЗначения(ДопустимыеТипыЗначенияСубконто.Типы());
			СписокТипов.СортироватьПоЗначению();
			ТекущийЭлементСписка = СписокТипов.НайтиПоЗначению(ТипЗнч(Параметры["Субконто"+НомерСубконто]));
			
			ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПриНачалеВыбораСубконто_ОбработкаВыбораТипаСубконто", ЭтотОбъект, Параметры);
			СписокТипов.ПоказатьВыборЭлемента(ОписаниеОповещенияОЗакрытии, НСтр("ru='Выбор типа данных'"), ТекущийЭлементСписка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОкончаниеВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, Параметры) Экспорт
	
	Перем ТекущееЗначение;
	Перем Организация;
	Перем НомерСубконто;
	Перем Счет;
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Организация",   Организация);
	Параметры.Свойство("НомерСубконто", НомерСубконто);
	Параметры.Свойство("Счет",          Счет);
	
	Если ТипЗнч(НомерСубконто) = Тип("Число") Тогда
		Параметры.Свойство("Субконто" + НомерСубконто, ТекущееЗначение);
	КонецЕсли;
	
	Если ТекущееЗначение <> Неопределено Тогда
		ТипЗначения = ТипЗнч(ТекущееЗначение);
	Иначе
		// определяем тип значения по счету
		ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
		ДопустимыеТипыЗначенияСубконто = ДанныеСчета["ВидСубконто"+НомерСубконто+"ТипЗначения"];
		Если ДопустимыеТипыЗначенияСубконто.Типы().Количество() > 1 Тогда
			Возврат;
		КонецЕсли;
		ТипЗначения = ДопустимыеТипыЗначенияСубконто.Типы()[0];
	КонецЕсли;
	
	
	ПолноеИмяТипа = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ПараметрыБГУ_ИменаТипов.Получить(ТипЗначения);
	Если ПолноеИмяТипа = Неопределено Тогда
		// не известный тип, используем стандартную обработку
		Возврат;
	КонецЕсли;
	ПараметрыВыбора = Новый Структура("СтрокаПоиска, Отбор", Текст, Новый Структура);
	
	ЗаполнитьОтборВыбораСубконто(Параметры, ПараметрыВыбора, ПолноеИмяТипа, ТипЗначения);
	
	ДанныеВыбора = ПолучитьДанныеВыбора(ТипЗначения, ПараметрыВыбора);
	СтандартнаяОбработка = Ложь
	
КонецПроцедуры

// Вызывается из события ПриНачалеВыбораЗначения элемента формы содержащего субконто (отказ от модальности)
Процедура ПриНачалеВыбораСубконто_ОбработкаВыбораТипаСубконто(ВыбранныйТип, Параметры) Экспорт
	
	Если ВыбранныйТип = Неопределено Тогда
		ТипЗначения = Неопределено;
	Иначе
		ТипЗначения = ВыбранныйТип.Значение;
	КонецЕсли;
	
	Если ТипЗначения = Неопределено ИЛИ ТипЗначения = Тип("Неопределено") Тогда
		Возврат;
	Иначе
		ПриНачалеВыбораСубконто_ОткрытьФормуВыбора(ТипЗначения, Параметры["СтандартнаяОбработка"], Параметры)
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из события ПриНачалеВыбораЗначения элемента формы содержащего субконто (отказ от модальности)
Процедура ПриНачалеВыбораСубконто_ОткрытьФормуВыбора(ТипЗначения, СтандартнаяОбработка, Параметры)
	
	ПолноеИмяТипа = ПолноеИмяПоТипуЗначения(ТипЗначения);
	Если Не ЗначениеЗаполнено(ПолноеИмяТипа) Тогда
		// Используется стандартное открытие формы выбора
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	
	Элемент         = Параметры["ЭлементСубконто"];
	НомерСубконто   = Параметры["НомерСубконто"];
	ТекущееСубконто = Параметры["Субконто" + НомерСубконто];
	Счет            = Параметры["Счет"];
	Организация     = Параметры["Организация"];
	
	ИмяОткрываемойФормы = ПолноеИмяТипа + ".ФормаВыбора";
	ПараметрыФормы = Новый Структура("Отбор, РежимВыбора", Новый Структура, Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока", ТекущееСубконто);
	
	ЗаполнитьОтборВыбораСубконто(Параметры, ПараметрыФормы, ПолноеИмяТипа, ТипЗначения);
	
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, Элемент);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ЗаполнитьОтборВыбораСубконто(Знач Параметры, Знач ПараметрыФормы, Знач ПолноеИмяТипа, ТипЗначения)
	
	Перем Организация;
	Перем Счет;
	Перем НомерСубконто;
	Перем ВидСубконто;
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Счет", Счет);
	Параметры.Свойство("НомерСубконто", НомерСубконто);
	Параметры.Свойство("ВидСубконто", ВидСубконто);
	
	Если Не ЗначениеЗаполнено(Счет)
		ИЛИ Не ЗначениеЗаполнено(НомерСубконто) Тогда
		Возврат;
	КонецЕсли;
	
	МаксКоличествоСубконто = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьМаксКоличествоСубконто();
	
	Если НомерСубконто > МаксКоличествоСубконто Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрРазделить(ПолноеИмяТипа, ".")[0] = "Документ" Тогда
		ПараметрыФормы.Отбор.Вставить("Организация", Организация);
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.РазделыЛицевыхСчетов") Тогда
		// Особый случай. Разделы подчинены справочнику ЛицевыеСчета,
		// а он, в свою очередь, справочнику Организации.
		ПараметрыФормы.Отбор.Вставить("Организация", Организация);
	ИначеЕсли ПолноеИмяТипа	= "Справочник.Субконто" Тогда
		ПараметрыФормы.Отбор.Вставить("Владелец", ВидСубконто); 
	Иначе
		
		ПодчиненныеСправочники = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ПараметрыБГУ_ПодчиненныеСправочники;
		ТекПодчиненныйСправочник = ПодчиненныеСправочники.Получить(ТипЗначения);
		Если ТекПодчиненныйСправочник <> Неопределено Тогда
			
			Для каждого РеквизитОтбора Из ТекПодчиненныйСправочник Цикл
				
				Для каждого ОписаниеРеквизитаОтбора Из РеквизитОтбора Цикл
					
					Для каждого ТипРеквизитаОтбора Из ОписаниеРеквизитаОтбора.Значение Цикл
						
						Если ТипРеквизитаОтбора = Тип("СправочникСсылка.Организации") Тогда
							ПараметрыФормы.Отбор.Вставить(ОписаниеРеквизитаОтбора.Ключ, Организация);
						Иначе
							
							ЗначениеОтбора = ПолучитьСубконтоНужногоТипа(Параметры, НомерСубконто, 
								ТипРеквизитаОтбора, Счет, МаксКоличествоСубконто);
							Если ЗначениеОтбора <> Неопределено Тогда
								ПараметрыФормы.Отбор.Вставить(ОписаниеРеквизитаОтбора.Ключ, ЗначениеОтбора);
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Дополнительная обработка договоров
	
	Если ТипЗначения = Тип("СправочникСсылка.Договоры") Тогда
		ЗначениеОтбора = ПолучитьСубконтоНужногоТипа(Параметры, НомерСубконто, 
		Тип("СправочникСсылка.Контрагенты"), Счет, МаксКоличествоСубконто);
		Если ЗначениеОтбора <> Неопределено Тогда
			ПараметрыФормы.Отбор.Вставить("Контрагент", ЗначениеОтбора);
		КонецЕсли;
	КонецЕсли;
	
	// Дополнительная обработка ДополнительнаяБюджетнаяКлассификация
	
	Если ТипЗначения = Тип("СправочникСсылка.ДополнительнаяБюджетнаяКлассификация") Тогда
		
		Если Параметры.Свойство("КПС") Тогда
			ПараметрыФормы.Вставить("КПС", Параметры.КПС);
		КонецЕсли;
		Если Параметры.Свойство("КЭК") Тогда
			ПараметрыФормы.Вставить("КЭК", Параметры.КЭК);
		КонецЕсли;
	
	КонецЕсли;
	
	// Дополнительная обработка РасходыУСН
	
	Если ТипЗначения = Тип("СправочникСсылка.РасходыУСН") Тогда
		ПараметрыФормы.Отбор.Вставить("Счет",      Параметры.Счет);
		ПараметрыФормы.Отбор.Вставить("Субконто1", Параметры.Субконто1);
	КонецЕсли;

	// Дополнительная обработка НалогиИПлатежиОрганизации
	
	Если ТипЗначения = Тип("СправочникСсылка.НалогиИПлатежиОрганизации") Тогда
		ПараметрыФормы.Отбор.Вставить("ВидНалогаИлиПлатежа", Параметры.Субконто1);
	КонецЕсли;

КонецПроцедуры

// Функция возвращает структуру для передачи параметров в процедуру "ПриНачалеВыбораСубконто"
//
Функция ИнициализироватьСтруктуруНачалаВыбораСубконто(НомерСубконто=0,
		Организация=Неопределено, КФО=Неопределено, КПС=Неопределено, КЭК=Неопределено,
		Счет=Неопределено, Субконто1=Неопределено, Субконто2=Неопределено, Субконто3=Неопределено) Экспорт

	СтруктураНачалаВыбораСубконто = Новый Структура;
	СтруктураНачалаВыбораСубконто.Вставить("НомерСубконто", НомерСубконто);
	СтруктураНачалаВыбораСубконто.Вставить("Организация", 	Организация);
	СтруктураНачалаВыбораСубконто.Вставить("КФО", 			КФО);
	СтруктураНачалаВыбораСубконто.Вставить("КПС", 			КПС);
	СтруктураНачалаВыбораСубконто.Вставить("КЭК", 			КЭК);
	СтруктураНачалаВыбораСубконто.Вставить("Счет", 			Счет);
	СтруктураНачалаВыбораСубконто.Вставить("Субконто1", 	Субконто1);
	СтруктураНачалаВыбораСубконто.Вставить("Субконто2", 	Субконто2);
	СтруктураНачалаВыбораСубконто.Вставить("Субконто3", 	Субконто3);
	
	Возврат СтруктураНачалаВыбораСубконто;

КонецФункции // ИнициализироватьСтруктуруНачалаВыбораСубконто()

// Функция проверяет возможность использования счета в проводках.
//
// Параметры:
//  Счет     - Проверяемый счет.
//  Сообщать - признак вывода сообщений.
//
// Возвращаемое значение:
//  Булево - возможность использования счета в проводках
//  
//
Функция СчетМожноИспользоватьВПроводках(Счет, Сообщать = Истина) Экспорт

	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
	Если ТипЗнч(Счет) <> Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
		Возврат Ложь; // Неправильный тип
	КонецЕсли;

	Если Счет.Пустая() Тогда
		Возврат Истина; // Пустая ссылка может использоваться
	КонецЕсли;

	Если ДанныеСчета.ЗапретитьИспользоватьВПроводках ИЛИ ДанныеСчета.ЭлементГруппа Тогда

		Если Сообщать Тогда
			ПоказатьПредупреждение(, "Счет " + СокрЛП(ДанныеСчета.Код)+" """ + ДанныеСчета.Наименование + """ нельзя использовать в проводках.");
		КонецЕсли;

		Возврат Ложь; // Счет использовать в проводках нельзя

	КонецЕсли;

	Возврат Истина; // Счет можно использовать в проводках 

КонецФункции // СчетМожноИспользоватьВПроводках()

Процедура ОткрытьФормуВыбораСчетаСПараметрамиЭлементаФормы(Форма, ЭлементФормыСчетУчета, РеквизитСчетУчета, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("КодТекущейСтроки", РеквизитСчетУчета);  
	ПараметрыОткрытияФормы.Вставить("Отбор", Новый Структура); 
	
	Для Каждого ПараметрВыбораСчета Из ЭлементФормыСчетУчета.ПараметрыВыбора Цикл 
		ПозицияТочки = СтрНайти(ПараметрВыбораСчета.Имя, ".");
		Если ПозицияТочки > 0 Тогда
			Если СтрНайти(ПараметрВыбораСчета.Имя, "Отбор") > 0 Тогда
				ИмяПоля = Сред(ПараметрВыбораСчета.Имя, ПозицияТочки + 1);
				ИмяСтуктуры = ПараметрыОткрытияФормы.Отбор;
			Иначе
				Продолжить;
			КонецЕсли;
		Иначе
			ИмяПоля = ПараметрВыбораСчета.Имя;
			ИмяСтуктуры = ПараметрыОткрытияФормы;
        КонецЕсли;
		ИмяСтуктуры.Вставить(ИмяПоля, ПараметрВыбораСчета.Значение);
	КонецЦикла;
	
	Для Каждого СвязьПараметровВыбора Из ЭлементФормыСчетУчета.СвязиПараметровВыбора Цикл
		ПозицияТочки = СтрНайти(СвязьПараметровВыбора.Имя, ".");
		Если ПозицияТочки > 0 Тогда
			Если СтрНайти(СвязьПараметровВыбора.Имя, "Отбор") > 0 Тогда
				ИмяПоля = Сред(ПараметрВыбораСчета.Имя, ПозицияТочки + 1);
				ИмяСтуктуры = ПараметрыОткрытияФормы.Отбор;
			Иначе
				Продолжить;
			КонецЕсли;
		Иначе
			ИмяПоля = СвязьПараметровВыбора.Имя;
			ИмяСтуктуры = ПараметрыОткрытияФормы;
		КонецЕсли;
		ИмяСтуктуры.Вставить(ИмяПоля, Форма.Объект[СтрЗаменить(СвязьПараметровВыбора.ПутьКДанным, "Объект.", "")]);
	КонецЦикла;
	
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыОткрытияФормы, ЭлементФормыСчетУчета); 
	
КонецПроцедуры

Процедура ПоказатьФормуВыбораТипаЦеныВалютыНДС(Форма, СтандартнаяОбработка, ИсходноеОписаниеОповещения = Неопределено, ИменаРеквизитов = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	
	Объект = Форма.Объект;
	ТипСсылки = ТипЗнч(Объект.Ссылка);
	
	ПоказыватьУчитыватьНДС = ТипСсылки = Тип("ДокументСсылка.НачислениеДоходов")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.НачислениеЗаУслугиОбразования")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.НачислениеСтудентамЗаПрочиеУслуги");
	
	ПоказыватьПринятьНДСКВычету = ((ТипСсылки = Тип("ДокументСсылка.ПоступлениеМЗ")
			ИЛИ ТипСсылки = Тип("ДокументСсылка.ПоступлениеМЗВПути")
			ИЛИ ТипСсылки = Тип("ДокументСсылка.ПоступлениеОС")
			ИЛИ ТипСсылки = Тип("ДокументСсылка.ПоступлениеОСВПути")
			ИЛИ ТипСсылки = Тип("ДокументСсылка.ПоступлениеУслугРабот")
			ИЛИ ТипСсылки = Тип("ДокументСсылка.ОтчетКомиссионера")
			ИЛИ ТипСсылки = Тип("ДокументСсылка.ПоступлениеУслугРаботПоСчетамУчетаЗатрат"))
			И Не Объект.ПринятьНДСКВычетуУказываетсяВСтроках)
		ИЛИ ТипСсылки = Тип("ДокументСсылка.ПринятиеКУчетуПравПользованияОС");
	
	ЕстьРеквизитыКурсКратность = ТипСсылки = Тип("ДокументСсылка.НачислениеЗаУслугиОбразования")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.НачислениеСтудентамЗаПрочиеУслуги")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.СчетНаОплату")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.ПоступлениеУслугРаботПоСчетамУчетаЗатрат");
		
	Если ТипСсылки = Тип("ДокументСсылка.НачислениеДоходов")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.НачислениеЗаУслугиОбразования")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.НачислениеСтудентамЗаПрочиеУслуги") Тогда
		ПоказыватьВалюту = Истина;
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.НачислениеДоходовБудущихПериодов") Тогда
		ПоказыватьВалюту = Истина;
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ПринятиеКУчетуПравПользованияОС") Тогда
		ПоказыватьВалюту = Истина;
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.АвансовыйОтчет")
		Или ТипСсылки = Тип("ДокументСсылка.ОтчетОРасходахПодотчетногоЛица") Тогда
		ПоказыватьВалюту = Ложь;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "КэшПараметров") Тогда
		ПоказыватьВалюту = Форма.КэшПараметров.ИспользоватьВалютныйУчет;
	Иначе
		ПоказыватьВалюту = Форма.ИспользоватьВалютныйУчет;
	КонецЕсли;
	
	Если ТипСсылки = Тип("ДокументСсылка.ПоступлениеМЗ") Тогда
		ПоказыватьНДС = ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(Форма,
			"ВДокументеВозможенУчетНДС", Ложь);
		ПоказыватьПринятьНДСКВычету = ПоказыватьНДС;
	Иначе
		ПоказыватьНДС = Истина;
	КонецЕсли;
	
	ЕстьТипЦены = ТипСсылки = Тип("ДокументСсылка.СчетНаОплату")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.АктОбОказанииУслуг")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.НакладнаяНаОтпускМ15")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.НачислениеДоходов")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.НачислениеДоходовБудущихПериодов")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.ЗаявлениеНаВозвратПоЧекуККМ")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.ЧекККМИсправительный")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.ЧекККМ")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.ЧекККМНаВозврат");
	
	ПараметрыФормы = Новый Структура("ВалютаДокумента, СуммаВключаетНДС");
	Если ПоказыватьУчитыватьНДС Тогда
		ПараметрыФормы.Вставить("УчитыватьНДС");
		ПараметрыФормы.Вставить("ПоказыватьУчитыватьНДС", ПоказыватьУчитыватьНДС);
	КонецЕсли;
	Если ПоказыватьПринятьНДСКВычету Тогда
		ПараметрыФормы.Вставить("ПринятьНДСКВычету");
		ПараметрыФормы.Вставить("ПоказыватьПринятьНДСКВычету", ПоказыватьПринятьНДСКВычету);
	КонецЕсли;
	
	Если ЕстьРеквизитыКурсКратность Тогда
		ПараметрыФормы.Вставить("Курс");
		ПараметрыФормы.Вставить("Кратность");
		ПараметрыФормы.Вставить("ДатаУстановкиКурсаИКратности", Объект.Дата);
	КонецЕсли;
	
	Если ЕстьТипЦены Тогда
		ПараметрыФормы.Вставить("ТипЦены");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, Объект);
	
	Если ТипЗнч(ИменаРеквизитов) = Тип("Структура") Тогда
		Для Каждого Элемент Из ИменаРеквизитов Цикл
			ИмяРеквизитаОбщейФормы = Элемент.Ключ;
			ИмяРеквизитаОбъекта = Элемент.Значение;
			
			ПараметрыФормы.Вставить(ИмяРеквизитаОбщейФормы, Объект[ИмяРеквизитаОбъекта]);
		КонецЦикла;
	КонецЕсли;
	
	Если ТипСсылки = Тип("ДокументСсылка.НачислениеЗаУслугиОбразования")
	 ИЛИ ТипСсылки = Тип("ДокументСсылка.НачислениеСтудентамЗаПрочиеУслуги") Тогда
		ПараметрыФормы.Вставить("УчитыватьНДС", Объект.УчитыватьНДС);
		Если Объект.Начисления.Количество() > 0 Тогда
			Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийНачисленияУчащимся.ПоКраткосрочнымДоговорам") Тогда
				ПараметрыФормы.Вставить("ПредупреждениеПриРедактированииВалюты", 
					НСТР("ru = 'При изменении валюты из списка начислений будут удалены строки, в которых указана ставка в другой валюте.'"));
			ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийНачисленияУчащимся.ПоДолгосрочнымДоговорам") Тогда
				ПараметрыФормы.Вставить("ПредупреждениеПриРедактированииВалюты", 
					НСТР("ru = 'При изменении валюты из списка начислений будут удалены все строки.'"));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	ПараметрыФормы.Вставить("ПоказыватьНДС", ПоказыватьНДС);
	ПараметрыФормы.Вставить("ПоказыватьВалюту", ПоказыватьВалюту);
	ПараметрыФормы.Вставить("ПоказыватьКурсВалюты", ЕстьРеквизитыКурсКратность);
	ПараметрыФормы.Вставить("ПоказыватьТипЦены", ЕстьТипЦены);
	
	ДополнительныеПараметры = Новый Структура("ОписаниеОповещения", ИсходноеОписаниеОповещения);
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("ИменаРеквизитов", ИменаРеквизитов);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыЦеныНДСВалюта", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.ФормаЦеныНДСВалюта", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения);

КонецПроцедуры

Процедура ПослеЗакрытияФормыЦеныНДСВалюта(Результат, ДополнительныеПарамеры) Экспорт

	Если Результат = Неопределено ИЛИ ТипЗнч(Результат) = Тип("КодВозвратаДиалога") Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПарамеры.Форма;
	Объект = Форма.Объект;
	ОписаниеОповещения = ДополнительныеПарамеры.ОписаниеОповещения;
	
	ЗаполнитьЗначенияСвойств(Объект, Результат);
	
	ИменаРеквизитов = ДополнительныеПарамеры.ИменаРеквизитов;
	Если ТипЗнч(ИменаРеквизитов) = Тип("Структура") Тогда
		Для Каждого Элемент Из ИменаРеквизитов Цикл
			ИмяРеквизитаОбщейФормы = Элемент.Ключ;
			ИмяРеквизитаОбъекта = Элемент.Значение;
			
			Объект[ИмяРеквизитаОбъекта] = Результат[ИмяРеквизитаОбщейФормы];
		КонецЦикла;
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
	
	Если ОписаниеОповещения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Результат);
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьОтборСчетовНаДату(Список, НаДату, Использование) Экспорт
	
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(Список.Отбор.Элементы, "Отбор на дату");
	
	Если Не Использование Тогда 
		Если ГруппаОтбора <> Неопределено Тогда
			ГруппаОтбора.Использование = Ложь;
		КонецЕсли;
		Возврат;
	КонецЕсли;
		
	Если ГруппаОтбора = Неопределено Тогда	
		
		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, "Отбор на дату",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		ГруппаОтбора2 = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаОтбора.Элементы, "Отбор по дате окончания",
			ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора	, "ДатаНачалаДействия"		, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, НаДату);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора2, "ДатаОкончанияДействия"	, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, НаДату);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора2, "ДатаОкончанияДействия"	, ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ДатаНачалаДействия"		, НаДату);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ДатаОкончанияДействия"	, НаДату);		
		
	КонецЕсли;
	
	ГруппаОтбора.Использование = Истина;
	
КонецПроцедуры

Процедура ПроверитьОчиститьКЭК(КПС, КЭК) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КЭК) ИЛИ НЕ ЗначениеЗаполнено(КПС) Тогда
		Возврат;
	КонецЕсли;
	
	ДопустимыеКЭК = БухгалтерскийУчетВызовСервера.ДопустимыеКЭКПоКПС(КПС);  
	
	Если ДопустимыеКЭК.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопустимыеКЭК.Найти(КЭК) = Неопределено Тогда
		КЭК = ПредопределенноеЗначение("Справочник.КОСГУ.ПустаяСсылка");
	КонецЕсли;	
	
КонецПроцедуры

// Функция возвращает специфический текст причины задолженности по коду и КФО, для случая различных текстов причины образования задолженности.
//
Функция СоответсвиеПричиныЗадолженностиПоКодуКФО(ИсходныйТекст, Код, КФО) Экспорт
	
	НовыйТекстПричины = ИсходныйТекст;
	
	// Соответствие для причины с кодом 89 и 05.
	Если Код = "89"
		ИЛИ Код = "05" Тогда
		
		Если Код = "89" Тогда 
			ТекстПричиныКФО_0503169 = НСтр("ru = 'иные причины возникновения просроченной дебиторской задолженности (дополнительная информация раскрывается в Таблице N 14 Пояснительной записки (ф. 0503160)'");
			ТекстПричиныКФО_0503769 = НСтр("ru = 'иные причины возникновения просроченной дебиторской задолженности (дополнительная информация раскрывается в Таблице N 10 Пояснительной записки к Балансу учреждения (ф. 0503760)'");
		ИначеЕсли Код = "05" Тогда
			ТекстПричиныКФО_0503169 = НСтр("ru = 'иные причины возникновения просроченной кредиторской задолженности (дополнительная информация раскрывается в Таблице N 14 Пояснительной записки (ф. 0503160)'");
			ТекстПричиныКФО_0503769 = НСтр("ru = 'иные причины возникновения просроченной кредиторской задолженности (дополнительная информация раскрывается в Таблице N 10 Пояснительной записки к Балансу учреждения (ф. 0503760)'");
		КонецЕсли;
		
		Если КФО = ПредопределенноеЗначение("Перечисление.КВД.Бюджет") Тогда
			НовыйТекстПричины = ТекстПричиныКФО_0503169;
		ИначеЕсли КФО = ПредопределенноеЗначение("Перечисление.КВД.Внебюджет") Тогда
			НовыйТекстПричины = ТекстПричиныКФО_0503769;
		ИначеЕсли КФО = ПредопределенноеЗначение("Перечисление.КВД.СубсидииНаГосзадание") Тогда
			НовыйТекстПричины = ТекстПричиныКФО_0503769;
		ИначеЕсли КФО = ПредопределенноеЗначение("Перечисление.КВД.СубсидииНаИныеЦели") Тогда
			НовыйТекстПричины = ТекстПричиныКФО_0503769;
		ИначеЕсли КФО = ПредопределенноеЗначение("Перечисление.КВД.БюджетныеИнвестиции") Тогда
			НовыйТекстПричины = ТекстПричиныКФО_0503769;
		ИначеЕсли КФО = ПредопределенноеЗначение("Перечисление.КВД.СредстваОМС") Тогда
			НовыйТекстПричины = ТекстПричиныКФО_0503769;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НовыйТекстПричины;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Осуществляет поиск элемента нужного типа, для установки отбора при начале выбора значения субконто
//
Функция ПолучитьСубконтоНужногоТипа(Параметры, ТекНомерСубконто, Тип, Счет, МаксКоличествоСубконто)
	Перем ПроверяемоеСубконто;
	
	Для Индекс = 1 По МаксКоличествоСубконто Цикл
		
		Если Индекс = ТекНомерСубконто Тогда
			Продолжить;
		КонецЕсли;
		
		Параметры.Свойство("Субконто"+Индекс, ПроверяемоеСубконто);
		Если ТипЗнч(ПроверяемоеСубконто) = Тип Тогда
			Возврат ПроверяемоеСубконто;
		КонецЕсли;
		
	КонецЦикла;
	
	// если поиск по элементам не удался, то пробуем поиск по субконто счета
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	Для Индекс = 1 По МаксКоличествоСубконто Цикл
		
		Если Индекс = ТекНомерСубконто Тогда
			Продолжить;
		КонецЕсли;
		
		Параметры.Свойство("Субконто"+Индекс);
		Если ДанныеСчета["ВидСубконто"+Индекс]<>Неопределено Тогда
			Если ДанныеСчета["ВидСубконто"+Индекс+"ТипЗначения"].СодержитТип(Тип) Тогда
				Возврат Параметры["Субконто"+Индекс];
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла; 
	
	Возврат Неопределено;

КонецФункции

Функция ПолноеИмяПоТипуЗначения(ТипЗначения) Экспорт
	
	ТипыБГУ = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ПараметрыБГУ_ИменаТипов;
	
	ПолноеИмяТипа = ТипыБГУ.Получить(ТипЗначения);
	Если ПолноеИмяТипа = Неопределено Тогда
		ПолноеИмяТипа = ОбщегоНазначенияБГУВызовСервера.ВернутьСтрокуТипаПоТипу(ТипЗначения, "ПолноеИмя");
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(ПолноеИмяТипа), ПолноеИмяТипа, "");
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

Процедура СпособЗачетаАвансаПриИзменении(Элемент, Форма) Экспорт
	
	УчетРасчетовКлиент.СпособЗачетаАвансаПриИзменении(Элемент, Форма);
	
КонецПроцедуры

Функция РазрешитьЗаполнениеТаблицыАвансы(Форма, Объект) Экспорт

	ТекстПредупреждения = "";
	Если Объект.Ссылка.Пустая()
		ИЛИ Форма.Модифицированность Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Перед заполнением таблицы авансов следует записать документ'");
		
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстПредупреждения) Тогда
		Возврат Истина;
	Иначе
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Процедура ДокументАвансаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Форма, Объект) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Параметры = Новый Структура;
	Параметры.Вставить("Организация", Объект.Организация);
	Параметры.Вставить("Контрагент", Объект.Контрагент);
	Параметры.Вставить("Договор", Объект.Договор);
	Параметры.Вставить("РежимВыбора", Истина);
	Если Объект.Ссылка.Пустая() Тогда
		Параметры.Вставить("Период", КонецДня(Объект.Дата));
	Иначе
		Параметры.Вставить("Период", Объект.Ссылка);
	КонецЕсли;
	
	Форма.ДополнитьПараметрыВыбораДокументаАвансов(Параметры);

	ОткрытьФорму("Обработка.ПодборДокументовАвансов.Форма", Параметры, Элемент);

КонецПроцедуры

Процедура ДокументАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, Форма, Объект) Экспорт

	УчетРасчетовКлиент.ДокументАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, Форма, Объект);

КонецПроцедуры

#КонецОбласти
