
/////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ

&НаСервере
Процедура ЗаписатьНастройки()

	Константы.РедактированиеОтчетаВПростойТаблицеУправляемыйРежим.Установить(РедактироватьВПростойТаблице);
	Если Константы.ВыполняетсяЗагрузкаКомплектаОтчетности.Получить()<>ВыполняетсяЗагрузкаКомплектаОтчетности Тогда
		Константы.ВыполняетсяЗагрузкаКомплектаОтчетности.Установить(ВыполняетсяЗагрузкаКомплектаОтчетности);
	КонецЕсли;
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры // ЗаписатьКонстанту()

&НаСервере
Процедура ПрочитатьНастройки()

	РедактироватьВПростойТаблице = Константы.РедактированиеОтчетаВПростойТаблицеУправляемыйРежим.Получить();
	ВыполняетсяЗагрузкаКомплектаОтчетности = Константы.ВыполняетсяЗагрузкаКомплектаОтчетности.Получить();
КонецПроцедуры


//////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьНастройки();
	//Флаг можно только снять.
	//Флаг установливается при загрузке комплекта, и может остаться установленным
	//если сеанс загрузки комплекта был прерван.
	Элементы.ВыполняетсяЗагрузкаКомплектаОтчетности.ТолькоПросмотр = НЕ ВыполняетсяЗагрузкаКомплектаОтчетности;
КонецПроцедуры


//////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНастройки();
	Закрыть();
КонецПроцедуры
