
//////////////////////////////////////////////////////////////////////////////////////
// БУХГАЛТЕРСКИЙ УЧЕТ, ПРОЦЕДУРЫ И ФУНКЦИИ ПОВТОРНОГО ИСПОЛЬЗОВАНИЯ НА ВРЕМЯ ВЫЗОВА //
//////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Дата проведения документа, установленная пользователем.
// Если дата не заполнена или документа нет в определяемом типе ДокументыСОтдельнойДатойПроведения, возвращается пустая дата.
// 
// Параметры:
//  Ссылка - ОпределяемыйТип.ДокументыСОтдельнойДатойПроведения
// 
// Возвращаемое значение:
//  Дата 
Функция УстановленнаяДатаПроведения(Ссылка) Экспорт
	Возврат РегистрыСведений.ДатыПроведенияДокументов.УстановленнаяДатаПроведения(Ссылка);
КонецФункции

#КонецОбласти
