////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ПолучитьДоступныеПериоды(Родитель)
	
	Возврат Справочники.Периоды.ОпределитьДочерниеПериоды(Родитель.Периодичность);
	
КонецФункции
 
&НаКлиенте
Процедура УстановитьТолькоПросмотрПроизвольногоПериода()
	
	Элементы.Наименование.ТолькоПросмотр  = Не Объект.Произвольный;
	Элементы.ДатаОкончания.ТолькоПросмотр = Не Объект.Произвольный;
	Элементы.Произвольный.ТолькоПросмотр  = ЗначениеЗаполнено(Объект.Родитель);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьЗначенияРеквизитов(РеквизитыОбъекта)
	
	Справочники.Периоды.ЗаполнитьРеквизитыОбъекта(РеквизитыОбъекта);
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработатьИзменениеПараметров()
	
	РеквизитыОбъекта = Новый Структура;
	РеквизитыОбъекта.Вставить("Периодичность", 	Объект.Периодичность);
	РеквизитыОбъекта.Вставить("Произвольный", 	Объект.Произвольный);
	РеквизитыОбъекта.Вставить("Наименование", 	Объект.Наименование);                    
	РеквизитыОбъекта.Вставить("ДатаОкончания", 	Объект.ДатаОкончания);                    
	РеквизитыОбъекта.Вставить("ДатаНачала", 	Объект.ДатаНачала);
	РеквизитыОбъекта.Вставить("Родитель", 		Объект.Родитель);
	РеквизитыОбъекта.Вставить("Ссылка", 		Объект.Ссылка);
	
	ПолучитьЗначенияРеквизитов(РеквизитыОбъекта);
	
	ЗаполнитьЗначенияСвойств(Объект, РеквизитыОбъекта);
	
	УстановитьТолькоПросмотрПроизвольногоПериода();

КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступныеЗначенияПериодичности(Знач ЭлементФормы, Знач ОбъектРодитель)

	ЭлементФормы.СписокВыбора.Очистить();
	СписокДоступных = ПолучитьДоступныеПериоды(ОбъектРодитель);
	Для Каждого Элемент Из СписокДоступных Цикл
		ЭлементФормы.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
	КонецЦикла;

КонецПроцедуры // УстановитьДоступныеЗначенияПериодичности()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Если ЗначениеЗаполнено(Объект.Родитель) Тогда
			Объект.Произвольный = Объект.Родитель.Произвольный;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступныеЗначенияПериодичности(Элементы.Периодичность, Объект.Родитель);
	

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТолькоПросмотрПроизвольногоПериода();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ПроизвольныйПриИзменении(Элемент)
	
	УстановитьТолькоПросмотрПроизвольногоПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ОбработатьИзменениеПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	 ОбработатьИзменениеПараметров();

КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	УстановитьДоступныеЗначенияПериодичности(Элементы.Периодичность, Объект.Родитель);
КонецПроцедуры

