#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПутевойЛист3спец";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0345002_390";
	КомандаПечати.Представление		= НСтр("ru = 'Путевой лист специального автомобиля (пр. № 390 от 28.09.2022)'");
	КомандаПечати.Порядок			= 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПутевойЛист3спец";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0345002_368";
	КомандаПечати.Представление		= НСтр("ru = 'Путевой лист специального автомобиля (пр. № 368 от 11.09.2020)'");
	КомандаПечати.Порядок			= 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПутевойЛист3спец";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0345002_152";
	КомандаПечати.Представление		= НСтр("ru = 'Путевой лист специального автомобиля (пр. № 152 от 18.09.2008)'");
	КомандаПечати.Порядок			= 3;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПутевойЛист3спец";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0345002";
	КомандаПечати.Представление		= НСтр("ru = 'Путевой лист специального автомобиля (ф. 3 спец)'");
	КомандаПечати.Порядок			= 4;

КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0345002_390") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0345002_390", "Путевой лист специального автомобиля (пр. № 390 от 28.09.2022)", ПечатьПутевогоЛиста390ПриказМинтранса(МассивОбъектов, ОбъектыПечати));

	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0345002_368") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0345002_368", "Путевой лист специального автомобиля (пр. № 368 от 11.09.2020)", ПечатьПутевогоЛиста368ПриказМинтранса(МассивОбъектов, ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0345002_152") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0345002_152", "Путевой лист специального автомобиля (пр. № 152 от 18.09.2008)", ПечатьПутевогоЛиста152ПриказМинтранса(МассивОбъектов, ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0345002") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0345002", "Путевой лист специального автомобиля (ф. 3 спец)", ПечатьПутевогоЛиста(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Функция формирует печатные формы документов
//
// Параметры
//  МассивОбъктов  - Массив - Массив ссылок на объекты которые нужно распечатать
//  ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//
// Возвращаемое значение:
//   ТабличныйДокумент   - Результирующая таблица, содржащая печатный формы документов
//
Функция ПечатьПутевогоЛиста(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ПутевойЛист3спец";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист3спец.ПФ_MXL_Форма0345002");
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ПутевойЛист3спец.Ссылка КАК Ссылка,
	|	ПутевойЛист3спец.Номер КАК НомерПутевогоЛиста,
	|	ПутевойЛист3спец.Дата КАК ДатаПутевогоЛиста,
	|	ПутевойЛист3спец.СерияПутевогоЛиста КАК СерияПутевогоЛиста,
	|	ПутевойЛист3спец.Организация,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).ОГРН КАК ОГРН,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).НаименованиеСокращенное КАК СокращенноеНаименованиеОрганизации,
	|	ПутевойЛист3спец.СрокДействия,
	|	ПутевойЛист3спец.ТранспортноеСредство,
	|	ПутевойЛист3спец.Водитель,
	|	ПутевойЛист3спец.ЛицензионнаяКарточка,
	|	ПутевойЛист3спец.Комментарий,
	|	ПутевойЛист3спец.ВремяВыездаТС,
	|	ПутевойЛист3спец.ВремяВозвращенияТС,
	|	ПутевойЛист3спец.ВыпускающийТСДиспетчер,
	|	ПутевойЛист3спец.ЛицоДопускающееВодителяПоСостояниюЗдоровья,
	|	ПутевойЛист3спец.ОсобыеОтметки,
	|	ПутевойЛист3спец.ВодительПринялТС,
	|	ПутевойЛист3спец.ВодительСдалТС,
	|	ПутевойЛист3спец.ПоказанияСпидометраПриВыезде,
	|	ПутевойЛист3спец.ВыездРазрешилМеханик,
	|	ПутевойЛист3спец.ПоказанияСпидометраПриВозвращении,
	|	ПутевойЛист3спец.ПринялТСМеханик,
	|	ПутевойЛист3спец.РасчетЗаработнойПлаты,
	|	ПутевойЛист3спец.ТаксировщикПутевогоЛиста,
	|	ПутевойЛист3спец.НулевойПробегПриВыезде,
	|	ПутевойЛист3спец.НулевойПробегПриВозвращении,
	|	ПутевойЛист3спец.ВремяВыездаТСФактическое,
	|	ПутевойЛист3спец.ВремяВозвращенияТСФактическое,
	|	ПутевойЛист3спец.ПриВозвращенииТСНеисправно,
	|	ПутевойЛист3спец.РежимРаботы,
	|	ПутевойЛист3спец.ВыдатьГорючего,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).КодОКПО КАК КодОКПО,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).НаименованиеПолное КАК НаименованиеОрганизации,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.ЛицензионнаяКарточка КАК Справочник.ЛицензионныеКарточки).РегистрационныйНомер КАК РегистрационныйНомерЛК,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.ЛицензионнаяКарточка КАК Справочник.ЛицензионныеКарточки).СерияКарточки КАК СерияЛК,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.ЛицензионнаяКарточка КАК Справочник.ЛицензионныеКарточки).НомерКарточки КАК НомерЛК,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Водитель КАК Справочник.Сотрудники).Код КАК ТабельныйНомер,
	|	ПутевойЛист3спец.РегистрационныйНомернойЗнак КАК ГосударственныйНомернойЗнак,
	|	ПутевойЛист3спец.ГаражныйНомер,
	|	ПутевойЛист3спец.Бригада,
	|	ПутевойЛист3спец.Колонна,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).НаименованиеСокращенное КАК ОрганизацияСокращенно,
	|	ПутевойЛист3спец.ЗаданиеВодителю.(
	|		Ссылка,
	|		НомерСтроки,
	|		НаименованиеЗаказчика,
	|		АдресЗаказчика,
	|		ВремяПрибытия,
	|		ВремяУбытия,
	|		КоличествоЧасов,
	|		КоличествоЕздок,
	|		ВидРаботы
	|	),
	|	ПутевойЛист3спец.ДвижениеГорючего.(
	|		Ссылка,
	|		НомерСтроки,
	|		МаркаГорючего,
	|		КодМаркиГорючего,
	|		ВыданоГорючее,
	|		ОстатокГорючегоПриВыезде,
	|		ОстатокГорючегоПриВозвращении,
	|		СданоГорючее,
	|		КоэффициентИзмененияНормы,
	|		ВремяРаботыСпецоборудования,
	|		ВремяРаботыДвигателя
	|	),
	|	ПутевойЛист3спец.ВыданныеТалоныНаГорючее.(
	|		Ссылка,
	|		НомерСтроки,
	|		ДенежныйДокумент
	|	),
	|	ПутевойЛист3спец.ОтветственныеЗаГруз.(
	|		Ссылка,
	|		НомерСтроки,
	|		ФИООтветственного,
	|		ДолжностьОтветственного,
	|		ФИООтветственногоОтЗаказчика,
	|		ДолжностьОтветственногоОтЗаказчика
	|	),
	|	ПутевойЛист3спец.Такелажники.(
	|		Ссылка,
	|		НомерСтроки,
	|		ФамилияИнициалыТакелажника,
	|		НомерУдостоверения
	|	),
	|	ПутевойЛист3спец.Прицепы.(
	|		Ссылка,
	|		НомерСтроки,
	|		Прицеп,
	|		ГаражныйНомер,
	|		РегистрационныйНомернойЗнак
	|	)
	|ИЗ
	|	Документ.ПутевойЛист3спец КАК ПутевойЛист3спец
	|ГДЕ
	|	ПутевойЛист3спец.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПутевогоЛиста,
	|	НомерПутевогоЛиста,
	|	СерияПутевогоЛиста";	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДокументов = Результат.Выбрать();

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПФ_MXL_Форма0345002";
	ТабличныйДокумент.Автомасштаб = Истина;
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураДанных = Новый Структура;
		Для Каждого Колонка ИЗ Результат.Колонки Цикл
			СтруктураДанных.Вставить(Колонка.Имя, ВыборкаДокументов[Колонка.Имя]);	
		КонецЦикла;
		
		//---изменение представления данных в печатной форме----------------
		АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
															
		СтруктураДанных.Вставить("НаименованиеОрганизации", СтруктураДанных.НаименованиеОрганизации);
		СтруктураДанных.Вставить("СокращенноеНаименованиеОрганизации", СтруктураДанных.СокращенноеНаименованиеОрганизации);
		СтруктураДанных.Вставить("ОГРН", СтруктураДанных.ОГРН);
		СтруктураДанных.Вставить("АдресОрганизации", АдресОрганизации);
		СтруктураДанных.Вставить("ТелефонОрганизации", ТелефонОрганизации);
		
		СтруктураДанных.Вставить("ОрганизацияСокращенно", СтруктураДанных.ОрганизацияСокращенно);
	
		СтруктураДанных.Вставить("СрокДействияПутевогоЛиста", 	УчетГСМ.СрокДействияПутевогоЛиста(СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия));
		СтруктураДанных.Вставить("ОтСрокДействияПутевогоЛиста", 	УчетГСМ.СрокДействияПутевогоЛиста(СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия, Истина));
		
		СтруктураДанных.Вставить("МаркаАвтомобиля", 	УчетГСМ.ПолучитьМаркуТС(СтруктураДанных.ТранспортноеСредство));	
		
		СтруктураДанных.Вставить("ЧислоВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ЧЧ:мм"""));	       //
		
		СтруктураДанных.Вставить("ВремяВыездаФактическое", Формат(ВыборкаДокументов.ВремяВыездаТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		СтруктураДанных.Вставить("ЧислоВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ЧЧ:мм"""));	//
		
		СтруктураДанных.Вставить("ВремяВозвращенияФактическое", Формат(ВыборкаДокументов.ВремяВозвращенияТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		//выдать горючего прописью
		КоличествоЛитровГСМ = "";
		ДробнаяЧасть = ВыборкаДокументов.ВыдатьГорючего - Цел(ВыборкаДокументов.ВыдатьГорючего);
		Если (ВыборкаДокументов.ВыдатьГорючего<>0) И (ДробнаяЧасть = 0) Тогда
			ПараметрыПрописи = ",,,,,,,,0";
			КоличествоЛитровГСМ = ЧислоПрописью(ВыборкаДокументов.ВыдатьГорючего,,ПараметрыПрописи);
		ИначеЕсли (ВыборкаДокументов.ВыдатьГорючего<>0) И (ДробнаяЧасть > 0) Тогда
			ПараметрыПрописи = "целая, целых, целых, ж, сотая, сотых, сотых, м, 2";
			КоличествоЛитровГСМ = ЧислоПрописью(ВыборкаДокументов.ВыдатьГорючего,,ПараметрыПрописи);
		КонецЕсли;	
		СтруктураДанных.Вставить("ВыдатьГорючегоПрописью", КоличествоЛитровГСМ);	
		
		//Движение горючего
		ВыборкаГорючее = ВыборкаДокументов.ДвижениеГорючего.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаГорючее.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Горючего", ВыборкаГорючее.МаркаГорючего);
			СтруктураДанных.Вставить("КодМарки"+НомерСтроки+"Горючего", ВыборкаГорючее.КодМаркиГорючего);
			СтруктураДанных.Вставить("Выдано"+НомерСтроки+"Горючего", ВыборкаГорючее.ВыданоГорючее);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВыезде", ВыборкаГорючее.ОстатокГорючегоПриВыезде);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВозвращении", ВыборкаГорючее.ОстатокГорючегоПриВозвращении);
			СтруктураДанных.Вставить("Сдано"+НомерСтроки+"Горючего", ВыборкаГорючее.СданоГорючее);
			СтруктураДанных.Вставить("Коэффициент"+НомерСтроки+"Горючего", ВыборкаГорючее.КоэффициентИзмененияНормы);
			СтруктураДанных.Вставить("ВремяРаботы"+НомерСтроки+"Спецоборудования", УчетВремениКлиентСервер.ЧислоВСтроку(ВыборкаГорючее.ВремяРаботыСпецоборудования));
			СтруктураДанных.Вставить("ВремяРаботы"+НомерСтроки+"Двигателя", УчетВремениКлиентСервер.ЧислоВСтроку(ВыборкаГорючее.ВремяРаботыДвигателя)); 
		КонецЦикла;
		
		//Талоны на топливо
		ВыданыТалоныНаТопливо = Ложь;
		ТалоныНаТопливо = "";
		ВыборкаТалоны = ВыборкаДокументов.ВыданныеТалоныНаГорючее.Выбрать();
		
		Пока ВыборкаТалоны.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаТалоны.ДенежныйДокумент) Тогда
				ТалоныНаТопливо = ТалоныНаТопливо + СокрЛП(ВыборкаТалоны.ДенежныйДокумент.Серия)+" "+СокрЛП(ВыборкаТалоны.ДенежныйДокумент.Номер)+"; ";
				
				ВыданыТалоныНаТопливо = Истина;
			КонецЕсли;
		КонецЦикла;
		СтруктураДанных.Вставить("ТалоныНаТопливо", ТалоныНаТопливо);
		
		//Задание водителю
		ВыборкаЗадания = ВыборкаДокументов.ЗаданиеВодителю.Выбрать();
		
		НомерСтроки = 0;
		КоличествоСтрокВЗадании = 0;
		Пока ВыборкаЗадания.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 2 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Заказчик"+НомерСтроки+"НаименованиеАдрес", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика)+", "+СокрЛП(ВыборкаЗадания.АдресЗаказчика));
			СтруктураДанных.Вставить("Время"+НомерСтроки+"Прибытие", Формат(ВыборкаЗадания.ВремяПрибытия,"ДФ=""ЧЧ:мм"""));
			СтруктураДанных.Вставить("Время"+НомерСтроки+"Убытие", Формат(ВыборкаЗадания.ВремяУбытия,"ДФ=""ЧЧ:мм"""));
			СтруктураДанных.Вставить("Время"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоЧасов);
			СтруктураДанных.Вставить("Ездки"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоЕздок);
			СтруктураДанных.Вставить("Вид"+НомерСтроки+"Работы", СокрЛП(ВыборкаЗадания.ВидРаботы));
			
			СтруктураДанных.Вставить("Заказчик"+НомерСтроки+"Наименование", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика));
			
			КоличествоСтрокВЗадании = КоличествоСтрокВЗадании + 1;
		КонецЦикла;
		
		//Прицепы
		ВыборкаПрицепы = ВыборкаДокументов.Прицепы.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаПрицепы.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Прицепа", УчетГСМ.ПолучитьМаркуТС(ВыборкаПрицепы.Прицеп));
			СтруктураДанных.Вставить("ГосНомер"+НомерСтроки+"Прицепа", ВыборкаПрицепы.РегистрационныйНомернойЗнак);
			СтруктураДанных.Вставить("ГаражныйНомер"+НомерСтроки+"Прицепа", ВыборкаПрицепы.ГаражныйНомер);
		КонецЦикла;
		
		//Ответственные за безопасность груза
		ВыборкаОтветственнных = ВыборкаДокументов.ОтветственныеЗаГруз.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаОтветственнных.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 2 Тогда
				Прервать;
			КонецЕсли;
		
			СтруктураДанных.Вставить("ДолжностьФИООтветственного"+НомерСтроки+"ЗаГруз", СокрЛП(ВыборкаОтветственнных.ДолжностьОтветственного)+", "+СокрЛП(ВыборкаОтветственнных.ФИООтветственного));
			
			СтруктураДанных.Вставить("ДолжностьФИООтветственногоОтЗаказчика"+НомерСтроки+"ЗаГруз", СокрЛП(ВыборкаОтветственнных.ДолжностьОтветственногоОтЗаказчика)+", "+СокрЛП(ВыборкаОтветственнных.ФИООтветственногоОтЗаказчика));
		КонецЦикла;
		
		//Такелажники
		ВыборкаТакелажники = ВыборкаДокументов.Такелажники.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаТакелажники.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 2 Тогда
				Прервать;
			КонецЕсли;
		
			СтруктураДанных.Вставить("Такелажник"+НомерСтроки+"ФамилияИнициалы", СокрЛП(ВыборкаТакелажники.ФамилияИнициалыТакелажника));
			СтруктураДанных.Вставить("Такелажник"+НомерСтроки+"НомерУдостоверения", СокрЛП(ВыборкаТакелажники.НомерУдостоверения));
		КонецЦикла;
		
	
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВыпускающийТСДиспетчер, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ДиспетчерВыпустилИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.ЛицоДопускающееВодителяПоСостояниюЗдоровья, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ДолжностьМедРаботника", ДанныеСотрудника.Должность);
		СтруктураДанных.Вставить("МедРаботник", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВыездРазрешилМеханик, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("МеханикВыпустилТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ПринялТСМеханик, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("МеханикПринялТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВодительПринялТС, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ВодительПринялТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВодительСдалТС, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ВодительСдалТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ТаксировщикПутевогоЛиста, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("Таксировщик", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		СтруктураДанных.Вставить("СтандартнаяКарточка", 	"стандартная, ");
		СтруктураДанных.Вставить("ОграниченнаяКарточка", 	"ограниченная");
		
		//вывод областей табличного документа
		ДанныеВодителя = УчетГСМ.ПолучитьДанныеВодителя(СтруктураДанных.Водитель, СтруктураДанных.ДатаПутевогоЛиста);
		
		ДанныеСотрудника = Справочники.Сотрудники.ДанныеСотрудника(СтруктураДанных.Водитель, "Фамилия, Имя, Отчество", СтруктураДанных.ДатаПутевогоЛиста);
		СтруктураДанных.Водитель = ДанныеСотрудника.Фамилия + " " + ДанныеСотрудника.Имя + " " + ДанныеСотрудника.Отчество;
			
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Заполнить(СтруктураДанных);
		Область.Параметры.Заполнить(ДанныеВодителя);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(Область, "НомерПутевогоЛиста", СтруктураДанных.НомерПутевогоЛиста, СтруктураДанных.Ссылка, Неопределено, Истина);
		
		ТабличныйДокумент.Вывести(Область);
		
		ЗачеркнутыйШрифт = Новый Шрифт("Arial",9,,,,Истина);
		Если ЗначениеЗаполнено(СтруктураДанных.ЛицензионнаяКарточка) Тогда
			Если СтруктураДанных.ЛицензионнаяКарточка.ОграниченнаяКарточка Тогда
				ТабличныйДокумент.Область("СтандартнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
			Иначе
				ТабличныйДокумент.Область("ОграниченнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
			КонецЕсли;
		Иначе
			ТабличныйДокумент.Область("СтандартнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
			ТабличныйДокумент.Область("ОграниченнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
		КонецЕсли;	
		
		Область = Макет.ПолучитьОбласть("РаботаВодителяТСДвижениеГорючего");
		Область.Параметры.Заполнить(СтруктураДанных);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(Область, "НомерПутевогоЛиста", СтруктураДанных.НомерПутевогоЛиста, СтруктураДанных.Ссылка, Неопределено, Истина);

		ТабличныйДокумент.Вывести(Область);
		
		Если КоличествоСтрокВЗадании > 0 Тогда
			Если ЗначениеЗаполнено(СокрЛП(СтруктураДанных.ОсобыеОтметки)) Тогда
				Область = Макет.ПолучитьОбласть("ЗаданиеВодителюОтметкиЗаполнены");
			Иначе
				Область = Макет.ПолучитьОбласть("ЗаданиеВодителюЗаполненоОтметкиПусты");
			КонецЕсли;	
		Иначе
			Область = Макет.ПолучитьОбласть("ЗаданиеВодителюПустое");
		КонецЕсли;	
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
	
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Оборотная сторона
		
		Область = Макет.ПолучитьОбласть("ЗаголовокОборотнойСтороны");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ВыполнениеЗадания");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ОтветственныеЗаГрузИТакелажники");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("РезультатРаботыТС");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
КонецФункции	

// Функция формирует печатные формы документов
//
// Параметры
//  МассивОбъктов  - Массив - Массив ссылок на объекты которые нужно распечатать
//  ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//
// Возвращаемое значение:
//   ТабличныйДокумент   - Результирующая таблица, содржащая печатный формы документов
//
Функция ПечатьПутевогоЛиста152ПриказМинтранса(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ПутевойЛист3спец";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист3спец.ПФ_MXL_Форма0345002_152");
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ПутевойЛист3спец.Ссылка КАК Ссылка,
	|	ПутевойЛист3спец.Номер КАК НомерПутевогоЛиста,
	|	ПутевойЛист3спец.Дата КАК ДатаПутевогоЛиста,
	|	ПутевойЛист3спец.СерияПутевогоЛиста КАК СерияПутевогоЛиста,
	|	ПутевойЛист3спец.Организация,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).ОГРН КАК ОГРН,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).НаименованиеСокращенное КАК СокращенноеНаименованиеОрганизации,
	|	ПутевойЛист3спец.СрокДействия,
	|	ПутевойЛист3спец.ТранспортноеСредство,
	|	ПутевойЛист3спец.Водитель,
	|	ПутевойЛист3спец.ЛицензионнаяКарточка,
	|	ПутевойЛист3спец.Комментарий,
	|	ПутевойЛист3спец.ВремяВыездаТС,
	|	ПутевойЛист3спец.ВремяВозвращенияТС,
	|	ПутевойЛист3спец.ВыпускающийТСДиспетчер,
	|	ПутевойЛист3спец.ЛицоДопускающееВодителяПоСостояниюЗдоровья,
	|	ПутевойЛист3спец.ОсобыеОтметки,
	|	ПутевойЛист3спец.ВодительПринялТС,
	|	ПутевойЛист3спец.ВодительСдалТС,
	|	ПутевойЛист3спец.ПоказанияСпидометраПриВыезде,
	|	ПутевойЛист3спец.ВыездРазрешилМеханик,
	|	ПутевойЛист3спец.ПоказанияСпидометраПриВозвращении,
	|	ПутевойЛист3спец.ПринялТСМеханик,
	|	ПутевойЛист3спец.РасчетЗаработнойПлаты,
	|	ПутевойЛист3спец.ТаксировщикПутевогоЛиста,
	|	ПутевойЛист3спец.НулевойПробегПриВыезде,
	|	ПутевойЛист3спец.НулевойПробегПриВозвращении,
	|	ПутевойЛист3спец.ВремяВыездаТСФактическое,
	|	ПутевойЛист3спец.ВремяВозвращенияТСФактическое,
	|	ПутевойЛист3спец.ПриВозвращенииТСНеисправно,
	|	ПутевойЛист3спец.РежимРаботы,
	|	ПутевойЛист3спец.ВыдатьГорючего,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).КодОКПО КАК КодОКПО,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).НаименованиеПолное КАК НаименованиеОрганизации,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.ЛицензионнаяКарточка КАК Справочник.ЛицензионныеКарточки).РегистрационныйНомер КАК РегистрационныйНомерЛК,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.ЛицензионнаяКарточка КАК Справочник.ЛицензионныеКарточки).СерияКарточки КАК СерияЛК,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.ЛицензионнаяКарточка КАК Справочник.ЛицензионныеКарточки).НомерКарточки КАК НомерЛК,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Водитель КАК Справочник.Сотрудники).Код КАК ТабельныйНомер,
	|	ПутевойЛист3спец.РегистрационныйНомернойЗнак КАК ГосударственныйНомернойЗнак,
	|	ПутевойЛист3спец.ГаражныйНомер,
	|	ПутевойЛист3спец.Бригада,
	|	ПутевойЛист3спец.Колонна,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).НаименованиеСокращенное КАК ОрганизацияСокращенно,
	|	ПутевойЛист3спец.ЗаданиеВодителю.(
	|		Ссылка,
	|		НомерСтроки,
	|		НаименованиеЗаказчика,
	|		АдресЗаказчика,
	|		ВремяПрибытия,
	|		ВремяУбытия,
	|		КоличествоЧасов,
	|		КоличествоЕздок,
	|		ВидРаботы
	|	),
	|	ПутевойЛист3спец.ДвижениеГорючего.(
	|		Ссылка,
	|		НомерСтроки,
	|		МаркаГорючего,
	|		КодМаркиГорючего,
	|		ВыданоГорючее,
	|		ОстатокГорючегоПриВыезде,
	|		ОстатокГорючегоПриВозвращении,
	|		СданоГорючее,
	|		КоэффициентИзмененияНормы,
	|		ВремяРаботыСпецоборудования,
	|		ВремяРаботыДвигателя
	|	),
	|	ПутевойЛист3спец.ВыданныеТалоныНаГорючее.(
	|		Ссылка,
	|		НомерСтроки,
	|		ДенежныйДокумент
	|	),
	|	ПутевойЛист3спец.ОтветственныеЗаГруз.(
	|		Ссылка,
	|		НомерСтроки,
	|		ФИООтветственного,
	|		ДолжностьОтветственного,
	|		ФИООтветственногоОтЗаказчика,
	|		ДолжностьОтветственногоОтЗаказчика
	|	),
	|	ПутевойЛист3спец.Такелажники.(
	|		Ссылка,
	|		НомерСтроки,
	|		ФамилияИнициалыТакелажника,
	|		НомерУдостоверения
	|	),
	|	ПутевойЛист3спец.Прицепы.(
	|		Ссылка,
	|		НомерСтроки,
	|		Прицеп,
	|		ГаражныйНомер,
	|		РегистрационныйНомернойЗнак
	|	)
	|ИЗ
	|	Документ.ПутевойЛист3спец КАК ПутевойЛист3спец
	|ГДЕ
	|	ПутевойЛист3спец.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПутевогоЛиста,
	|	НомерПутевогоЛиста,
	|	СерияПутевогоЛиста";	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДокументов = Результат.Выбрать();

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПФ_MXL_Форма0345002";
	ТабличныйДокумент.Автомасштаб = Истина;
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураДанных = Новый Структура;
		Для Каждого Колонка ИЗ Результат.Колонки Цикл
			СтруктураДанных.Вставить(Колонка.Имя, ВыборкаДокументов[Колонка.Имя]);	
		КонецЦикла;
		
		//---изменение представления данных в печатной форме----------------
		АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
															
		СтруктураДанных.Вставить("НаименованиеОрганизации", СтруктураДанных.НаименованиеОрганизации);
		СтруктураДанных.Вставить("СокращенноеНаименованиеОрганизации", СтруктураДанных.СокращенноеНаименованиеОрганизации);
		СтруктураДанных.Вставить("ОГРН", СтруктураДанных.ОГРН);
		СтруктураДанных.Вставить("АдресОрганизации", АдресОрганизации);
		СтруктураДанных.Вставить("ТелефонОрганизации", ТелефонОрганизации);
		
		СтруктураДанных.Вставить("ОрганизацияСокращенно", СтруктураДанных.ОрганизацияСокращенно);
	
		СтруктураДанных.Вставить("СрокДействияПутевогоЛиста", 	УчетГСМ.СрокДействияПутевогоЛиста(СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия));
		СтруктураДанных.Вставить("ОтСрокДействияПутевогоЛиста", 	УчетГСМ.СрокДействияПутевогоЛиста(СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия, Истина));
		
		СтруктураДанных.Вставить("МаркаАвтомобиля", 	УчетГСМ.ПолучитьМаркуТС(СтруктураДанных.ТранспортноеСредство));	
		
		СтруктураДанных.Вставить("ЧислоВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	       //
		
		СтруктураДанных.Вставить("ВремяВыездаФактическое", Формат(ВыборкаДокументов.ВремяВыездаТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		СтруктураДанных.Вставить("ЧислоВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	//
		
		СтруктураДанных.Вставить("ВремяВозвращенияФактическое", Формат(ВыборкаДокументов.ВремяВозвращенияТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		//выдать горючего прописью
		КоличествоЛитровГСМ = "";
		ДробнаяЧасть = ВыборкаДокументов.ВыдатьГорючего - Цел(ВыборкаДокументов.ВыдатьГорючего);
		Если (ВыборкаДокументов.ВыдатьГорючего<>0) И (ДробнаяЧасть = 0) Тогда
			ПараметрыПрописи = ",,,,,,,,0";
			КоличествоЛитровГСМ = ЧислоПрописью(ВыборкаДокументов.ВыдатьГорючего,,ПараметрыПрописи);
		ИначеЕсли (ВыборкаДокументов.ВыдатьГорючего<>0) И (ДробнаяЧасть > 0) Тогда
			ПараметрыПрописи = "целая, целых, целых, ж, сотая, сотых, сотых, м, 2";
			КоличествоЛитровГСМ = ЧислоПрописью(ВыборкаДокументов.ВыдатьГорючего,,ПараметрыПрописи);
		КонецЕсли;	
		СтруктураДанных.Вставить("ВыдатьГорючегоПрописью", КоличествоЛитровГСМ);	
		
		//Движение горючего
		ВыборкаГорючее = ВыборкаДокументов.ДвижениеГорючего.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаГорючее.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Горючего", ВыборкаГорючее.МаркаГорючего);
			СтруктураДанных.Вставить("КодМарки"+НомерСтроки+"Горючего", ВыборкаГорючее.КодМаркиГорючего);
			СтруктураДанных.Вставить("Выдано"+НомерСтроки+"Горючего", ВыборкаГорючее.ВыданоГорючее);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВыезде", ВыборкаГорючее.ОстатокГорючегоПриВыезде);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВозвращении", ВыборкаГорючее.ОстатокГорючегоПриВозвращении);
			СтруктураДанных.Вставить("Сдано"+НомерСтроки+"Горючего", ВыборкаГорючее.СданоГорючее);
			СтруктураДанных.Вставить("Коэффициент"+НомерСтроки+"Горючего", ВыборкаГорючее.КоэффициентИзмененияНормы);
			СтруктураДанных.Вставить("ВремяРаботы"+НомерСтроки+"Спецоборудования", УчетВремениКлиентСервер.ЧислоВСтроку(ВыборкаГорючее.ВремяРаботыСпецоборудования));
			СтруктураДанных.Вставить("ВремяРаботы"+НомерСтроки+"Двигателя", УчетВремениКлиентСервер.ЧислоВСтроку(ВыборкаГорючее.ВремяРаботыДвигателя)); 
		КонецЦикла;
		
		//Талоны на топливо
		ВыданыТалоныНаТопливо = Ложь;
		ТалоныНаТопливо = "";
		ВыборкаТалоны = ВыборкаДокументов.ВыданныеТалоныНаГорючее.Выбрать();
		
		Пока ВыборкаТалоны.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаТалоны.ДенежныйДокумент) Тогда
				ТалоныНаТопливо = ТалоныНаТопливо + СокрЛП(ВыборкаТалоны.ДенежныйДокумент.Серия)+" "+СокрЛП(ВыборкаТалоны.ДенежныйДокумент.Номер)+"; ";
				
				ВыданыТалоныНаТопливо = Истина;
			КонецЕсли;
		КонецЦикла;
		СтруктураДанных.Вставить("ТалоныНаТопливо", ТалоныНаТопливо);
		
		//Задание водителю
		ВыборкаЗадания = ВыборкаДокументов.ЗаданиеВодителю.Выбрать();
		
		НомерСтроки = 0;
		КоличествоСтрокВЗадании = 0;
		Пока ВыборкаЗадания.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 2 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Заказчик"+НомерСтроки+"НаименованиеАдрес", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика)+", "+СокрЛП(ВыборкаЗадания.АдресЗаказчика));
			СтруктураДанных.Вставить("Время"+НомерСтроки+"Прибытие", Формат(ВыборкаЗадания.ВремяПрибытия,"ДФ=""ЧЧ:мм"""));
			СтруктураДанных.Вставить("Время"+НомерСтроки+"Убытие", Формат(ВыборкаЗадания.ВремяУбытия,"ДФ=""ЧЧ:мм"""));
			СтруктураДанных.Вставить("Время"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоЧасов);
			СтруктураДанных.Вставить("Ездки"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоЕздок);
			СтруктураДанных.Вставить("Вид"+НомерСтроки+"Работы", СокрЛП(ВыборкаЗадания.ВидРаботы));
			
			СтруктураДанных.Вставить("Заказчик"+НомерСтроки+"Наименование", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика));
			
			КоличествоСтрокВЗадании = КоличествоСтрокВЗадании + 1;
		КонецЦикла;
		
		//Прицепы
		ВыборкаПрицепы = ВыборкаДокументов.Прицепы.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаПрицепы.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Прицепа", УчетГСМ.ПолучитьМаркуТС(ВыборкаПрицепы.Прицеп));
			СтруктураДанных.Вставить("ГосНомер"+НомерСтроки+"Прицепа", ВыборкаПрицепы.РегистрационныйНомернойЗнак);
			СтруктураДанных.Вставить("ГаражныйНомер"+НомерСтроки+"Прицепа", ВыборкаПрицепы.ГаражныйНомер);
		КонецЦикла;
		
		//Ответственные за безопасность груза
		ВыборкаОтветственнных = ВыборкаДокументов.ОтветственныеЗаГруз.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаОтветственнных.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 2 Тогда
				Прервать;
			КонецЕсли;
		
			СтруктураДанных.Вставить("ДолжностьФИООтветственного"+НомерСтроки+"ЗаГруз", СокрЛП(ВыборкаОтветственнных.ДолжностьОтветственного)+", "+СокрЛП(ВыборкаОтветственнных.ФИООтветственного));
			
			СтруктураДанных.Вставить("ДолжностьФИООтветственногоОтЗаказчика"+НомерСтроки+"ЗаГруз", СокрЛП(ВыборкаОтветственнных.ДолжностьОтветственногоОтЗаказчика)+", "+СокрЛП(ВыборкаОтветственнных.ФИООтветственногоОтЗаказчика));
		КонецЦикла;
		
		//Такелажники
		ВыборкаТакелажники = ВыборкаДокументов.Такелажники.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаТакелажники.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 2 Тогда
				Прервать;
			КонецЕсли;
		
			СтруктураДанных.Вставить("Такелажник"+НомерСтроки+"ФамилияИнициалы", СокрЛП(ВыборкаТакелажники.ФамилияИнициалыТакелажника));
			СтруктураДанных.Вставить("Такелажник"+НомерСтроки+"НомерУдостоверения", СокрЛП(ВыборкаТакелажники.НомерУдостоверения));
		КонецЦикла;
		
	
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВыпускающийТСДиспетчер, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ДиспетчерВыпустилИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.ЛицоДопускающееВодителяПоСостояниюЗдоровья, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ДолжностьМедРаботника", ДанныеСотрудника.Должность);
		СтруктураДанных.Вставить("МедРаботник", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВыездРазрешилМеханик, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("МеханикВыпустилТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ПринялТСМеханик, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("МеханикПринялТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВодительПринялТС, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ВодительПринялТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВодительСдалТС, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ВодительСдалТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ТаксировщикПутевогоЛиста, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("Таксировщик", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		СтруктураДанных.Вставить("СтандартнаяКарточка", 	"стандартная, ");
		СтруктураДанных.Вставить("ОграниченнаяКарточка", 	"ограниченная");
		
		//вывод областей табличного документа
		ДанныеВодителя = УчетГСМ.ПолучитьДанныеВодителя(СтруктураДанных.Водитель, СтруктураДанных.ДатаПутевогоЛиста);
		
		ДанныеСотрудника = Справочники.Сотрудники.ДанныеСотрудника(СтруктураДанных.Водитель, "Фамилия, Имя, Отчество", СтруктураДанных.ДатаПутевогоЛиста);
		СтруктураДанных.Водитель = ДанныеСотрудника.Фамилия + " " + ДанныеСотрудника.Имя + " " + ДанныеСотрудника.Отчество;
			
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Заполнить(СтруктураДанных);
		Область.Параметры.Заполнить(ДанныеВодителя);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(Область, "НомерПутевогоЛиста", СтруктураДанных.НомерПутевогоЛиста, СтруктураДанных.Ссылка, Неопределено, Истина);
		
		ТабличныйДокумент.Вывести(Область);
		
		ЗачеркнутыйШрифт = Новый Шрифт("Arial",9,,,,Истина);
		Если ЗначениеЗаполнено(СтруктураДанных.ЛицензионнаяКарточка) Тогда
			Если СтруктураДанных.ЛицензионнаяКарточка.ОграниченнаяКарточка Тогда
				ТабличныйДокумент.Область("СтандартнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
			Иначе
				ТабличныйДокумент.Область("ОграниченнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
			КонецЕсли;
		Иначе
			ТабличныйДокумент.Область("СтандартнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
			ТабличныйДокумент.Область("ОграниченнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
		КонецЕсли;	
		
		Область = Макет.ПолучитьОбласть("РаботаВодителяТСДвижениеГорючего");
		Область.Параметры.Заполнить(СтруктураДанных);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(Область, "НомерПутевогоЛиста", СтруктураДанных.НомерПутевогоЛиста, СтруктураДанных.Ссылка, Неопределено, Истина);

		ТабличныйДокумент.Вывести(Область);
		
		Если КоличествоСтрокВЗадании > 0 Тогда
			Если ЗначениеЗаполнено(СокрЛП(СтруктураДанных.ОсобыеОтметки)) Тогда
				Область = Макет.ПолучитьОбласть("ЗаданиеВодителюОтметкиЗаполнены");
			Иначе
				Область = Макет.ПолучитьОбласть("ЗаданиеВодителюЗаполненоОтметкиПусты");
			КонецЕсли;	
		Иначе
			Область = Макет.ПолучитьОбласть("ЗаданиеВодителюПустое");
		КонецЕсли;	
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
	
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Оборотная сторона
		
		Область = Макет.ПолучитьОбласть("ЗаголовокОборотнойСтороны");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ВыполнениеЗадания");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ОтветственныеЗаГрузИТакелажники");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("РезультатРаботыТС");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
КонецФункции	

// Функция формирует печатные формы документов
//
// Параметры
//  МассивОбъктов  - Массив - Массив ссылок на объекты которые нужно распечатать
//  ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//
// Возвращаемое значение:
//   ТабличныйДокумент   - Результирующая таблица, содржащая печатный формы документов
//
Функция ПечатьПутевогоЛиста368ПриказМинтранса(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ПутевойЛист3спец";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист3спец.ПФ_MXL_Форма0345002_368");
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ПутевойЛист3спец.Ссылка КАК Ссылка,
	|	ПутевойЛист3спец.Номер КАК НомерПутевогоЛиста,
	|	ПутевойЛист3спец.Дата КАК ДатаПутевогоЛиста,
	|	ПутевойЛист3спец.СерияПутевогоЛиста КАК СерияПутевогоЛиста,
	|	ПутевойЛист3спец.Организация,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).ОГРН КАК ОГРН,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).НаименованиеСокращенное КАК СокращенноеНаименованиеОрганизации,
	|	ПутевойЛист3спец.СрокДействия,
	|	ПутевойЛист3спец.ТранспортноеСредство,
	|	ПутевойЛист3спец.Водитель,
	|	ПутевойЛист3спец.ЛицензионнаяКарточка,
	|	ПутевойЛист3спец.Комментарий,
	|	ПутевойЛист3спец.ВремяВыездаТС,
	|	ПутевойЛист3спец.ВремяВозвращенияТС,
	|	ПутевойЛист3спец.ВыпускающийТСДиспетчер,
	|	ПутевойЛист3спец.ЛицоДопускающееВодителяПоСостояниюЗдоровья,
	|	ПутевойЛист3спец.ОсобыеОтметки,
	|	ПутевойЛист3спец.ВодительПринялТС,
	|	ПутевойЛист3спец.ВодительСдалТС,
	|	ПутевойЛист3спец.ПоказанияСпидометраПриВыезде,
	|	ПутевойЛист3спец.ВыездРазрешилМеханик,
	|	ПутевойЛист3спец.ПоказанияСпидометраПриВозвращении,
	|	ПутевойЛист3спец.ПринялТСМеханик,
	|	ПутевойЛист3спец.РасчетЗаработнойПлаты,
	|	ПутевойЛист3спец.ТаксировщикПутевогоЛиста,
	|	ПутевойЛист3спец.НулевойПробегПриВыезде,
	|	ПутевойЛист3спец.НулевойПробегПриВозвращении,
	|	ПутевойЛист3спец.ВремяВыездаТСФактическое,
	|	ПутевойЛист3спец.ВремяВозвращенияТСФактическое,
	|	ПутевойЛист3спец.ПриВозвращенииТСНеисправно,
	|	ПутевойЛист3спец.РежимРаботы,
	|	ПутевойЛист3спец.ВыдатьГорючего,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).КодОКПО КАК КодОКПО,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).НаименованиеПолное КАК НаименованиеОрганизации,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.ЛицензионнаяКарточка КАК Справочник.ЛицензионныеКарточки).РегистрационныйНомер КАК РегистрационныйНомерЛК,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.ЛицензионнаяКарточка КАК Справочник.ЛицензионныеКарточки).СерияКарточки КАК СерияЛК,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.ЛицензионнаяКарточка КАК Справочник.ЛицензионныеКарточки).НомерКарточки КАК НомерЛК,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Водитель КАК Справочник.Сотрудники).Код КАК ТабельныйНомер,
	|	ПутевойЛист3спец.РегистрационныйНомернойЗнак КАК ГосударственныйНомернойЗнак,
	|	ПутевойЛист3спец.ГаражныйНомер,
	|	ПутевойЛист3спец.Бригада,
	|	ПутевойЛист3спец.Колонна,
	|	ПутевойЛист3спец.СведенияОПеревозке,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).НаименованиеСокращенное КАК ОрганизацияСокращенно,
	|	ПутевойЛист3спец.ЗаданиеВодителю.(
	|		Ссылка,
	|		НомерСтроки,
	|		НаименованиеЗаказчика,
	|		АдресЗаказчика,
	|		ВремяПрибытия,
	|		ВремяУбытия,
	|		КоличествоЧасов,
	|		КоличествоЕздок,
	|		ВидРаботы
	|	),
	|	ПутевойЛист3спец.ДвижениеГорючего.(
	|		Ссылка,
	|		НомерСтроки,
	|		МаркаГорючего,
	|		КодМаркиГорючего,
	|		ВыданоГорючее,
	|		ОстатокГорючегоПриВыезде,
	|		ОстатокГорючегоПриВозвращении,
	|		СданоГорючее,
	|		КоэффициентИзмененияНормы,
	|		ВремяРаботыСпецоборудования,
	|		ВремяРаботыДвигателя
	|	),
	|	ПутевойЛист3спец.ВыданныеТалоныНаГорючее.(
	|		Ссылка,
	|		НомерСтроки,
	|		ДенежныйДокумент
	|	),
	|	ПутевойЛист3спец.ОтветственныеЗаГруз.(
	|		Ссылка,
	|		НомерСтроки,
	|		ФИООтветственного,
	|		ДолжностьОтветственного,
	|		ФИООтветственногоОтЗаказчика,
	|		ДолжностьОтветственногоОтЗаказчика
	|	),
	|	ПутевойЛист3спец.Такелажники.(
	|		Ссылка,
	|		НомерСтроки,
	|		ФамилияИнициалыТакелажника,
	|		НомерУдостоверения
	|	),
	|	ПутевойЛист3спец.Прицепы.(
	|		Ссылка,
	|		НомерСтроки,
	|		Прицеп,
	|		ГаражныйНомер,
	|		РегистрационныйНомернойЗнак
	|	)
	|ИЗ
	|	Документ.ПутевойЛист3спец КАК ПутевойЛист3спец
	|ГДЕ
	|	ПутевойЛист3спец.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПутевогоЛиста,
	|	НомерПутевогоЛиста,
	|	СерияПутевогоЛиста";	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДокументов = Результат.Выбрать();

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПФ_MXL_Форма0345002";
	ТабличныйДокумент.Автомасштаб = Истина;
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураДанных = Новый Структура;
		Для Каждого Колонка ИЗ Результат.Колонки Цикл
			СтруктураДанных.Вставить(Колонка.Имя, ВыборкаДокументов[Колонка.Имя]);	
		КонецЦикла;
		
		//---изменение представления данных в печатной форме----------------
		АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
															
		СтруктураДанных.Вставить("НаименованиеОрганизации", СтруктураДанных.НаименованиеОрганизации);
		СтруктураДанных.Вставить("СокращенноеНаименованиеОрганизации", СтруктураДанных.СокращенноеНаименованиеОрганизации);
		СтруктураДанных.Вставить("ОГРН", СтруктураДанных.ОГРН);
		СтруктураДанных.Вставить("АдресОрганизации", АдресОрганизации);
		СтруктураДанных.Вставить("ТелефонОрганизации", ТелефонОрганизации);
		
		СтруктураДанных.Вставить("ОрганизацияСокращенно", СтруктураДанных.ОрганизацияСокращенно);
	
		СтруктураДанных.Вставить("СрокДействияПутевогоЛиста", 	УчетГСМ.СрокДействияПутевогоЛиста(СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия));
		СтруктураДанных.Вставить("ОтСрокДействияПутевогоЛиста", 	УчетГСМ.СрокДействияПутевогоЛиста(СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия, Истина));
		
		СтруктураДанных.Вставить("МаркаАвтомобиля", 	УчетГСМ.ПолучитьМаркуИМодельТС(СтруктураДанных.ТранспортноеСредство));
		СтруктураДанных.Вставить("СведенияОПеревозке", СтруктураДанных.СведенияОПеревозке);
		
		СтруктураДанных.Вставить("ЧислоВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	       //
		
		СтруктураДанных.Вставить("ВремяВыездаФактическое", Формат(ВыборкаДокументов.ВремяВыездаТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		СтруктураДанных.Вставить("ЧислоВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	//
		
		СтруктураДанных.Вставить("ВремяВозвращенияФактическое", Формат(ВыборкаДокументов.ВремяВозвращенияТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		//выдать горючего прописью
		КоличествоЛитровГСМ = "";
		ДробнаяЧасть = ВыборкаДокументов.ВыдатьГорючего - Цел(ВыборкаДокументов.ВыдатьГорючего);
		Если (ВыборкаДокументов.ВыдатьГорючего<>0) И (ДробнаяЧасть = 0) Тогда
			ПараметрыПрописи = ",,,,,,,,0";
			КоличествоЛитровГСМ = ЧислоПрописью(ВыборкаДокументов.ВыдатьГорючего,,ПараметрыПрописи);
		ИначеЕсли (ВыборкаДокументов.ВыдатьГорючего<>0) И (ДробнаяЧасть > 0) Тогда
			ПараметрыПрописи = "целая, целых, целых, ж, сотая, сотых, сотых, м, 2";
			КоличествоЛитровГСМ = ЧислоПрописью(ВыборкаДокументов.ВыдатьГорючего,,ПараметрыПрописи);
		КонецЕсли;	
		СтруктураДанных.Вставить("ВыдатьГорючегоПрописью", КоличествоЛитровГСМ);	
		
		//Движение горючего
		ВыборкаГорючее = ВыборкаДокументов.ДвижениеГорючего.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаГорючее.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Горючего", ВыборкаГорючее.МаркаГорючего);
			СтруктураДанных.Вставить("КодМарки"+НомерСтроки+"Горючего", ВыборкаГорючее.КодМаркиГорючего);
			СтруктураДанных.Вставить("Выдано"+НомерСтроки+"Горючего", ВыборкаГорючее.ВыданоГорючее);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВыезде", ВыборкаГорючее.ОстатокГорючегоПриВыезде);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВозвращении", ВыборкаГорючее.ОстатокГорючегоПриВозвращении);
			СтруктураДанных.Вставить("Сдано"+НомерСтроки+"Горючего", ВыборкаГорючее.СданоГорючее);
			СтруктураДанных.Вставить("Коэффициент"+НомерСтроки+"Горючего", ВыборкаГорючее.КоэффициентИзмененияНормы);
			СтруктураДанных.Вставить("ВремяРаботы"+НомерСтроки+"Спецоборудования", УчетВремениКлиентСервер.ЧислоВСтроку(ВыборкаГорючее.ВремяРаботыСпецоборудования));
			СтруктураДанных.Вставить("ВремяРаботы"+НомерСтроки+"Двигателя", УчетВремениКлиентСервер.ЧислоВСтроку(ВыборкаГорючее.ВремяРаботыДвигателя)); 
		КонецЦикла;
		
		//Талоны на топливо
		ВыданыТалоныНаТопливо = Ложь;
		ТалоныНаТопливо = "";
		ВыборкаТалоны = ВыборкаДокументов.ВыданныеТалоныНаГорючее.Выбрать();
		
		Пока ВыборкаТалоны.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаТалоны.ДенежныйДокумент) Тогда
				ТалоныНаТопливо = ТалоныНаТопливо + СокрЛП(ВыборкаТалоны.ДенежныйДокумент.Серия)+" "+СокрЛП(ВыборкаТалоны.ДенежныйДокумент.Номер)+"; ";
				
				ВыданыТалоныНаТопливо = Истина;
			КонецЕсли;
		КонецЦикла;
		СтруктураДанных.Вставить("ТалоныНаТопливо", ТалоныНаТопливо);
		
		//Задание водителю
		ВыборкаЗадания = ВыборкаДокументов.ЗаданиеВодителю.Выбрать();
		
		НомерСтроки = 0;
		КоличествоСтрокВЗадании = 0;
		Пока ВыборкаЗадания.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 2 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Заказчик"+НомерСтроки+"НаименованиеАдрес", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика)+", "+СокрЛП(ВыборкаЗадания.АдресЗаказчика));
			СтруктураДанных.Вставить("Время"+НомерСтроки+"Прибытие", Формат(ВыборкаЗадания.ВремяПрибытия,"ДФ=""ЧЧ:мм"""));
			СтруктураДанных.Вставить("Время"+НомерСтроки+"Убытие", Формат(ВыборкаЗадания.ВремяУбытия,"ДФ=""ЧЧ:мм"""));
			СтруктураДанных.Вставить("Время"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоЧасов);
			СтруктураДанных.Вставить("Ездки"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоЕздок);
			СтруктураДанных.Вставить("Вид"+НомерСтроки+"Работы", СокрЛП(ВыборкаЗадания.ВидРаботы));
			
			СтруктураДанных.Вставить("Заказчик"+НомерСтроки+"Наименование", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика));
			
			КоличествоСтрокВЗадании = КоличествоСтрокВЗадании + 1;
		КонецЦикла;
		
		//Прицепы
		ВыборкаПрицепы = ВыборкаДокументов.Прицепы.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаПрицепы.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Прицепа", УчетГСМ.ПолучитьМаркуИМодельТС(ВыборкаПрицепы.Прицеп));
			СтруктураДанных.Вставить("ГосНомер"+НомерСтроки+"Прицепа", ВыборкаПрицепы.РегистрационныйНомернойЗнак);
			СтруктураДанных.Вставить("ГаражныйНомер"+НомерСтроки+"Прицепа", ВыборкаПрицепы.ГаражныйНомер);
		КонецЦикла;
		
		//Ответственные за безопасность груза
		ВыборкаОтветственнных = ВыборкаДокументов.ОтветственныеЗаГруз.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаОтветственнных.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 2 Тогда
				Прервать;
			КонецЕсли;
		
			СтруктураДанных.Вставить("ДолжностьФИООтветственного"+НомерСтроки+"ЗаГруз", СокрЛП(ВыборкаОтветственнных.ДолжностьОтветственного)+", "+СокрЛП(ВыборкаОтветственнных.ФИООтветственного));
			
			СтруктураДанных.Вставить("ДолжностьФИООтветственногоОтЗаказчика"+НомерСтроки+"ЗаГруз", СокрЛП(ВыборкаОтветственнных.ДолжностьОтветственногоОтЗаказчика)+", "+СокрЛП(ВыборкаОтветственнных.ФИООтветственногоОтЗаказчика));
		КонецЦикла;
		
		//Такелажники
		ВыборкаТакелажники = ВыборкаДокументов.Такелажники.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаТакелажники.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 2 Тогда
				Прервать;
			КонецЕсли;
		
			СтруктураДанных.Вставить("Такелажник"+НомерСтроки+"ФамилияИнициалы", СокрЛП(ВыборкаТакелажники.ФамилияИнициалыТакелажника));
			СтруктураДанных.Вставить("Такелажник"+НомерСтроки+"НомерУдостоверения", СокрЛП(ВыборкаТакелажники.НомерУдостоверения));
		КонецЦикла;
		
	
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВыпускающийТСДиспетчер, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ДиспетчерВыпустилИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.ЛицоДопускающееВодителяПоСостояниюЗдоровья, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ДолжностьМедРаботника", ДанныеСотрудника.Должность);
		СтруктураДанных.Вставить("МедРаботник", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВыездРазрешилМеханик, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("МеханикВыпустилТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ПринялТСМеханик, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("МеханикПринялТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВодительПринялТС, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ВодительПринялТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВодительСдалТС, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ВодительСдалТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ТаксировщикПутевогоЛиста, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("Таксировщик", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		СтруктураДанных.Вставить("СтандартнаяКарточка", 	"стандартная, ");
		СтруктураДанных.Вставить("ОграниченнаяКарточка", 	"ограниченная");
		
		//вывод областей табличного документа
		ДанныеВодителя = УчетГСМ.ПолучитьДанныеВодителя(СтруктураДанных.Водитель, СтруктураДанных.ДатаПутевогоЛиста);
		
		ДанныеСотрудника = Справочники.Сотрудники.ДанныеСотрудника(СтруктураДанных.Водитель, "Фамилия, Имя, Отчество", СтруктураДанных.ДатаПутевогоЛиста);
		СтруктураДанных.Водитель = ДанныеСотрудника.Фамилия + " " + ДанныеСотрудника.Имя + " " + ДанныеСотрудника.Отчество;
			
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Заполнить(СтруктураДанных);
		Область.Параметры.Заполнить(ДанныеВодителя);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(Область, "НомерПутевогоЛиста", СтруктураДанных.НомерПутевогоЛиста, СтруктураДанных.Ссылка, Неопределено, Истина);
		
		ТабличныйДокумент.Вывести(Область);
		
		ЗачеркнутыйШрифт = Новый Шрифт("Arial",9,,,,Истина);
		Если ЗначениеЗаполнено(СтруктураДанных.ЛицензионнаяКарточка) Тогда
			Если СтруктураДанных.ЛицензионнаяКарточка.ОграниченнаяКарточка Тогда
				ТабличныйДокумент.Область("СтандартнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
			Иначе
				ТабличныйДокумент.Область("ОграниченнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
			КонецЕсли;
		Иначе
			ТабличныйДокумент.Область("СтандартнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
			ТабличныйДокумент.Область("ОграниченнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
		КонецЕсли;	
		
		Область = Макет.ПолучитьОбласть("РаботаВодителяТСДвижениеГорючего");
		Область.Параметры.Заполнить(СтруктураДанных);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(Область, "НомерПутевогоЛиста", СтруктураДанных.НомерПутевогоЛиста, СтруктураДанных.Ссылка, Неопределено, Истина);

		ТабличныйДокумент.Вывести(Область);
		
		Если КоличествоСтрокВЗадании > 0 Тогда
			Если ЗначениеЗаполнено(СокрЛП(СтруктураДанных.ОсобыеОтметки)) Тогда
				Область = Макет.ПолучитьОбласть("ЗаданиеВодителюОтметкиЗаполнены");
			Иначе
				Область = Макет.ПолучитьОбласть("ЗаданиеВодителюЗаполненоОтметкиПусты");
			КонецЕсли;	
		Иначе
			Область = Макет.ПолучитьОбласть("ЗаданиеВодителюПустое");
		КонецЕсли;	
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
	
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Оборотная сторона
		
		Область = Макет.ПолучитьОбласть("ЗаголовокОборотнойСтороны");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ВыполнениеЗадания");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ОтветственныеЗаГрузИТакелажники");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("РезультатРаботыТС");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
КонецФункции	

// Функция формирует печатные формы документов
//
// Параметры
//  МассивОбъктов  - Массив - Массив ссылок на объекты которые нужно распечатать
//  ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//
// Возвращаемое значение:
//   ТабличныйДокумент   - Результирующая таблица, содржащая печатный формы документов
//
Функция ПечатьПутевогоЛиста390ПриказМинтранса(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ПутевойЛист3спец";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист3спец.ПФ_MXL_Форма0345002_390");
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ПутевойЛист3спец.Ссылка КАК Ссылка,
	|	ПутевойЛист3спец.Номер КАК НомерПутевогоЛиста,
	|	ПутевойЛист3спец.Дата КАК ДатаПутевогоЛиста,
	|	ПутевойЛист3спец.СерияПутевогоЛиста КАК СерияПутевогоЛиста,
	|	ПутевойЛист3спец.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).ОГРН КАК ОГРН,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).НаименованиеСокращенное КАК СокращенноеНаименованиеОрганизации,
	|	ПутевойЛист3спец.СрокДействия КАК СрокДействия,
	|	ПутевойЛист3спец.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ПутевойЛист3спец.Водитель КАК Водитель,
	|	ПутевойЛист3спец.ЛицензионнаяКарточка КАК ЛицензионнаяКарточка,
	|	ПутевойЛист3спец.Комментарий КАК Комментарий,
	|	ПутевойЛист3спец.ВремяВыездаТС КАК ВремяВыездаТС,
	|	ПутевойЛист3спец.ВремяВозвращенияТС КАК ВремяВозвращенияТС,
	|	ПутевойЛист3спец.ВыпускающийТСДиспетчер КАК ВыпускающийТСДиспетчер,
	|	ПутевойЛист3спец.ЛицоДопускающееВодителяПоСостояниюЗдоровья КАК ЛицоДопускающееВодителяПоСостояниюЗдоровья,
	|	ПутевойЛист3спец.ОсобыеОтметки КАК ОсобыеОтметки,
	|	ПутевойЛист3спец.ВодительПринялТС КАК ВодительПринялТС,
	|	ПутевойЛист3спец.ВодительСдалТС КАК ВодительСдалТС,
	|	ПутевойЛист3спец.ПоказанияСпидометраПриВыезде КАК ПоказанияСпидометраПриВыезде,
	|	ПутевойЛист3спец.ВыездРазрешилМеханик КАК ВыездРазрешилМеханик,
	|	ПутевойЛист3спец.ПоказанияСпидометраПриВозвращении КАК ПоказанияСпидометраПриВозвращении,
	|	ПутевойЛист3спец.ПринялТСМеханик КАК ПринялТСМеханик,
	|	ПутевойЛист3спец.РасчетЗаработнойПлаты КАК РасчетЗаработнойПлаты,
	|	ПутевойЛист3спец.ТаксировщикПутевогоЛиста КАК ТаксировщикПутевогоЛиста,
	|	ПутевойЛист3спец.НулевойПробегПриВыезде КАК НулевойПробегПриВыезде,
	|	ПутевойЛист3спец.НулевойПробегПриВозвращении КАК НулевойПробегПриВозвращении,
	|	ПутевойЛист3спец.ВремяВыездаТСФактическое КАК ВремяВыездаТСФактическое,
	|	ПутевойЛист3спец.ВремяВозвращенияТСФактическое КАК ВремяВозвращенияТСФактическое,
	|	ПутевойЛист3спец.ПриВозвращенииТСНеисправно КАК ПриВозвращенииТСНеисправно,
	|	ПутевойЛист3спец.РежимРаботы КАК РежимРаботы,
	|	ПутевойЛист3спец.ВыдатьГорючего КАК ВыдатьГорючего,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).КодОКПО КАК КодОКПО,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).НаименованиеПолное КАК НаименованиеОрганизации,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.ЛицензионнаяКарточка КАК Справочник.ЛицензионныеКарточки).РегистрационныйНомер КАК РегистрационныйНомерЛК,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.ЛицензионнаяКарточка КАК Справочник.ЛицензионныеКарточки).СерияКарточки КАК СерияЛК,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.ЛицензионнаяКарточка КАК Справочник.ЛицензионныеКарточки).НомерКарточки КАК НомерЛК,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Водитель КАК Справочник.Сотрудники).Код КАК ТабельныйНомер,
	|	ПутевойЛист3спец.РегистрационныйНомернойЗнак КАК ГосударственныйНомернойЗнак,
	|	ПутевойЛист3спец.ГаражныйНомер КАК ГаражныйНомер,
	|	ПутевойЛист3спец.Бригада КАК Бригада,
	|	ПутевойЛист3спец.Колонна КАК Колонна,
	|	ПутевойЛист3спец.СведенияОПеревозке КАК СведенияОПеревозке,
	|	ВЫРАЗИТЬ(ПутевойЛист3спец.Организация КАК Справочник.Организации).НаименованиеСокращенное КАК ОрганизацияСокращенно,
	|	ПутевойЛист3спец.ВидПеревозки КАК ВидПеревозки,
	|	ПутевойЛист3спец.ВидСообщения КАК ВидСообщения,
	|	ПутевойЛист3спец.СведенияОВидахСообщения КАК СведенияОВидахСообщения,
	|	ПутевойЛист3спец.ЗаполнятьОтметкуОПредрейсовомМедосмотре КАК ЗаполнятьОтметкуОПредрейсовомМедосмотре,
	|	ВЫБОР
	|		КОГДА ПутевойЛист3спец.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр
	|			ТОГДА ПутевойЛист3спец.СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья
	|		ИНАЧЕ ПутевойЛист3спец.ЛицоДопускающееВодителяПоСостояниюЗдоровья
	|	КОНЕЦ КАК ПроведшийПредрейсовыйМедосмотр,
	|	ВЫБОР
	|		КОГДА ПутевойЛист3спец.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр
	|			ТОГДА ПутевойЛист3спец.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр
	|		ИНАЧЕ ПутевойЛист3спец.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр
	|	КОНЕЦ КАК ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр,
	|	ПутевойЛист3спец.ЗаполнятьОтметкуОПослерейсовомМедосмотре КАК ЗаполнятьОтметкуОПослерейсовомМедосмотре,
	|	ВЫБОР
	|		КОГДА ПутевойЛист3спец.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр
	|			ТОГДА ПутевойЛист3спец.СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья
	|		ИНАЧЕ ПутевойЛист3спец.ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья
	|	КОНЕЦ КАК ПроведшийПослерейсовыйМедосмотр,
	|	ВЫБОР
	|		КОГДА ПутевойЛист3спец.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр
	|			ТОГДА ПутевойЛист3спец.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр
	|		ИНАЧЕ ПутевойЛист3спец.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр
	|	КОНЕЦ КАК ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр,
	|	ПутевойЛист3спец.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр КАК СторонняяОрганизацияПроводитПредрейсовыйМедосмотр,
	|	ПутевойЛист3спец.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр КАК СторонняяОрганизацияПроводитПослерейсовыйМедосмотр,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ПутевойЛист3спец.ОрганизацияПроводящаяПредрейсовыйМедосмотр КАК Справочник.Контрагенты).НаименованиеСокращенное = """"
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ВЫРАЗИТЬ(ПутевойЛист3спец.ОрганизацияПроводящаяПредрейсовыйМедосмотр КАК Справочник.Контрагенты).ЮридическоеФизическоеЛицо)
	|		ИНАЧЕ ВЫРАЗИТЬ(ПутевойЛист3спец.ОрганизацияПроводящаяПредрейсовыйМедосмотр КАК Справочник.Контрагенты).НаименованиеСокращенное
	|	КОНЕЦ КАК ОрганизацияПроводящаяПредрейсовыйМедосмотр,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ПутевойЛист3спец.ОрганизацияПроводящаяПослерейсовыйМедосмотр КАК Справочник.Контрагенты).НаименованиеСокращенное = """"
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ВЫРАЗИТЬ(ПутевойЛист3спец.ОрганизацияПроводящаяПослерейсовыйМедосмотр КАК Справочник.Контрагенты).ЮридическоеФизическоеЛицо)
	|		ИНАЧЕ ВЫРАЗИТЬ(ПутевойЛист3спец.ОрганизацияПроводящаяПослерейсовыйМедосмотр КАК Справочник.Контрагенты).НаименованиеСокращенное
	|	КОНЕЦ КАК ОрганизацияПроводящаяПослерейсовыйМедосмотр,
	|	ПутевойЛист3спец.ЗаданиеВодителю.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		НаименованиеЗаказчика КАК НаименованиеЗаказчика,
	|		АдресЗаказчика КАК АдресЗаказчика,
	|		ВремяПрибытия КАК ВремяПрибытия,
	|		ВремяУбытия КАК ВремяУбытия,
	|		КоличествоЧасов КАК КоличествоЧасов,
	|		КоличествоЕздок КАК КоличествоЕздок,
	|		ВидРаботы КАК ВидРаботы
	|	) КАК ЗаданиеВодителю,
	|	ПутевойЛист3спец.ДвижениеГорючего.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		МаркаГорючего КАК МаркаГорючего,
	|		КодМаркиГорючего КАК КодМаркиГорючего,
	|		ВыданоГорючее КАК ВыданоГорючее,
	|		ОстатокГорючегоПриВыезде КАК ОстатокГорючегоПриВыезде,
	|		ОстатокГорючегоПриВозвращении КАК ОстатокГорючегоПриВозвращении,
	|		СданоГорючее КАК СданоГорючее,
	|		КоэффициентИзмененияНормы КАК КоэффициентИзмененияНормы,
	|		ВремяРаботыСпецоборудования КАК ВремяРаботыСпецоборудования,
	|		ВремяРаботыДвигателя КАК ВремяРаботыДвигателя
	|	) КАК ДвижениеГорючего,
	|	ПутевойЛист3спец.ВыданныеТалоныНаГорючее.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ДенежныйДокумент КАК ДенежныйДокумент
	|	) КАК ВыданныеТалоныНаГорючее,
	|	ПутевойЛист3спец.ОтветственныеЗаГруз.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ФИООтветственного КАК ФИООтветственного,
	|		ДолжностьОтветственного КАК ДолжностьОтветственного,
	|		ФИООтветственногоОтЗаказчика КАК ФИООтветственногоОтЗаказчика,
	|		ДолжностьОтветственногоОтЗаказчика КАК ДолжностьОтветственногоОтЗаказчика
	|	) КАК ОтветственныеЗаГруз,
	|	ПутевойЛист3спец.Такелажники.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ФамилияИнициалыТакелажника КАК ФамилияИнициалыТакелажника,
	|		НомерУдостоверения КАК НомерУдостоверения
	|	) КАК Такелажники,
	|	ПутевойЛист3спец.Прицепы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Прицеп КАК Прицеп,
	|		ГаражныйНомер КАК ГаражныйНомер,
	|		РегистрационныйНомернойЗнак КАК РегистрационныйНомернойЗнак
	|	) КАК Прицепы
	|ИЗ
	|	Документ.ПутевойЛист3спец КАК ПутевойЛист3спец
	|ГДЕ
	|	ПутевойЛист3спец.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПутевогоЛиста,
	|	НомерПутевогоЛиста,
	|	СерияПутевогоЛиста";	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДокументов = Результат.Выбрать();

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПФ_MXL_Форма0345002";
	ТабличныйДокумент.Автомасштаб = Истина;
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураДанных = Новый Структура;
		Для Каждого Колонка ИЗ Результат.Колонки Цикл
			СтруктураДанных.Вставить(Колонка.Имя, ВыборкаДокументов[Колонка.Имя]);	
		КонецЦикла;
		
		//---изменение представления данных в печатной форме----------------
		АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
															
		СтруктураДанных.Вставить("НаименованиеОрганизации", СтруктураДанных.НаименованиеОрганизации);
		СтруктураДанных.Вставить("СокращенноеНаименованиеОрганизации", СтруктураДанных.СокращенноеНаименованиеОрганизации);
		СтруктураДанных.Вставить("ОГРН", СтруктураДанных.ОГРН);
		СтруктураДанных.Вставить("АдресОрганизации", АдресОрганизации);
		СтруктураДанных.Вставить("ТелефонОрганизации", ТелефонОрганизации);
		
		СтруктураДанных.Вставить("ОрганизацияСокращенно", СтруктураДанных.ОрганизацияСокращенно);
	
		СтруктураДанных.Вставить("СрокДействияПутевогоЛиста", 	УчетГСМ.СрокДействияПутевогоЛиста(СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия));
		СтруктураДанных.Вставить("ОтСрокДействияПутевогоЛиста", 	УчетГСМ.СрокДействияПутевогоЛиста(СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия, Истина));
		
		ТипТС = УчетГСМ.ПолучитьТипТС(СтруктураДанных.ТранспортноеСредство);
		Если ЗначениеЗаполнено(ТипТС) Тогда
			СтруктураДанных.Вставить("РеквизитыТС", "Тип, марка, модель автомобиля");
			СтруктураДанных.Вставить("МаркаАвтомобиля", 	УчетГСМ.ПолучитьТипМаркуИМодельТС(СтруктураДанных.ТранспортноеСредство));
		Иначе	
			СтруктураДанных.Вставить("РеквизитыТС", "Марка, модель автомобиля");
			СтруктураДанных.Вставить("МаркаАвтомобиля", 	УчетГСМ.ПолучитьМаркуИМодельТС(СтруктураДанных.ТранспортноеСредство));
		КонецЕсли;
		
		СтруктураДанных.Вставить("ВидПеревозки", СтруктураДанных.ВидПеревозки);
		Если ЗначениеЗаполнено(СтруктураДанных.СведенияОВидахСообщения) Тогда
			СтруктураДанных.Вставить("ВидСообщения", СтруктураДанных.СведенияОВидахСообщения);
		Иначе	
			СтруктураДанных.Вставить("ВидСообщения", СтруктураДанных.ВидСообщения);
		КонецЕсли;
		
		РезультатПредрейсовогоМедосмотра = "";
		Если ВыборкаДокументов.ЗаполнятьОтметкуОПредрейсовомМедосмотре Тогда
			РезультатПредрейсовогоМедосмотра = НСтр("ru = 'прошел предрейсовый медицинский осмотр, к исполнению трудовых обязанностей допущен'");
		КонецЕсли;
		СтруктураДанных.Вставить("РезультатПредрейсовогоМедосмотра", РезультатПредрейсовогоМедосмотра);
		 
		ПредрейсовыйРазделитель = ?(ЗначениеЗаполнено(СтруктураДанных.ПроведшийПредрейсовыйМедосмотр),",", "");
		Если ВыборкаДокументов.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр Тогда
			
			РеквизитыПредрейовыхМедРаботников = Новый Структура("Фамилия, Имя, Отчество, Должность");
			ЗначениеПредрейсовыхРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанных.ПроведшийПредрейсовыйМедосмотр,РеквизитыПредрейовыхМедРаботников);
			
			ДанныеСтороннегоСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество",
													СтруктураДанных.ПроведшийПредрейсовыйМедосмотр,
													СтруктураДанных.ДатаПутевогоЛиста,
													ЗначениеПредрейсовыхРеквизитов.Фамилия,
													ЗначениеПредрейсовыхРеквизитов.Имя,
													ЗначениеПредрейсовыхРеквизитов.Отчество);
			СтруктураДанных.Вставить("ФИОПредрейсовогоМедработника", КорреспондентыКлиентСервер.ФИО(ДанныеСтороннегоСотрудника, Истина));
			
			Если ЗначениеЗаполнено(ЗначениеПредрейсовыхРеквизитов.Должность) Тогда 
				СтруктураДанных.Вставить("ДолжностьПредрейсовогоМедработника", ТРег(ЗначениеПредрейсовыхРеквизитов.Должность) + ПредрейсовыйРазделитель);
			КонецЕсли;
			
		Иначе 
			
			ДанныеПредрейсовогоСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
															СтруктураДанных.ПроведшийПредрейсовыйМедосмотр, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеПредрейсовогоСотрудника, Истина);
			СтруктураДанных.Вставить("ФИОПредрейсовогоМедработника", КорреспондентыКлиентСервер.ФИО(ДанныеПредрейсовогоСотрудника, Истина));
			
			Если ЗначениеЗаполнено(ДанныеПредрейсовогоСотрудника.Должность) Тогда
				СтруктураДанных.Вставить("ДолжностьПредрейсовогоМедработника", ТРег(ДанныеПредрейсовогоСотрудника.Должность) + ПредрейсовыйРазделитель);  
			КонецЕсли;
			
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(СтруктураДанных.СокращенноеНаименованиеОрганизации) Тогда				
			НаименованиеОрганизацииДокумента = СтруктураДанных.СокращенноеНаименованиеОрганизации;			
		Иначе
			НаименованиеОрганизацииДокумента = СтруктураДанных.НаименованиеОрганизации;
		КонецЕсли;
		
		ПредрейсоваяОрганизация = "";
		Если ЗначениеЗаполнено(СтруктураДанных.ОрганизацияПроводящаяПредрейсовыйМедосмотр) Тогда
			ПредрейсоваяОрганизация = СтруктураДанных.ОрганизацияПроводящаяПредрейсовыйМедосмотр;
		ИначеЕсли ЗначениеЗаполнено(СтруктураДанных.ПроведшийПредрейсовыйМедосмотр) 
								ИЛИ ЗначениеЗаполнено(СтруктураДанных.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр) Тогда
			ПредрейсоваяОрганизация = НаименованиеОрганизацииДокумента;					
		КонецЕсли;
		СтруктураДанных.Вставить("НаименованиеПредрейсовойМедорганизации", ПредрейсоваяОрганизация);
		
		СтруктураДанных.Вставить("ДанныеМедЛицензииПредрейсовогоМедосмотра", УчетГСМ.ПолучитьПредставлениеЛицензииНаПроведениеМедосмотров(СтруктураДанных.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр)); 
		
		РезультатПослерейсовогоМедосмотра = "";
		Если ВыборкаДокументов.ЗаполнятьОтметкуОПослерейсовомМедосмотре Тогда
			РезультатПослерейсовогоМедосмотра = НСтр("ru = 'прошел послерейсовый медицинский осмотр'");
		КонецЕсли;
		СтруктураДанных.Вставить("РезультатПослерейсовогоМедосмотра", РезультатПослерейсовогоМедосмотра);
		
		ПослерейсовыйРазделитель = ?(ЗначениеЗаполнено(СтруктураДанных.ПроведшийПослерейсовыйМедосмотр),",", "");
		Если ВыборкаДокументов.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр Тогда
			
			РеквизитыПослерейсовыхМедРаботников = Новый Структура("Фамилия, Имя, Отчество, Должность");
			ЗначениеПослерейсовыхРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанных.ПроведшийПослерейсовыйМедосмотр,РеквизитыПослерейсовыхМедРаботников);

			ДанныеСтороннегоСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество",
													СтруктураДанных.ПроведшийПослерейсовыйМедосмотр,
													СтруктураДанных.ДатаПутевогоЛиста,
													ЗначениеПослерейсовыхРеквизитов.Фамилия,
													ЗначениеПослерейсовыхРеквизитов.Имя,
													ЗначениеПослерейсовыхРеквизитов.Отчество);
			СтруктураДанных.Вставить("ФИОПослерейсовогоМедработника", КорреспондентыКлиентСервер.ФИО(ДанныеСтороннегоСотрудника, Истина));
			
			Если ЗначениеЗаполнено(ЗначениеПослерейсовыхРеквизитов.Должность) Тогда
				СтруктураДанных.Вставить("ДолжностьПослерейсовогоМедработника", ТРег(ЗначениеПослерейсовыхРеквизитов.Должность) + ПослерейсовыйРазделитель);
			КонецЕсли;
			
		Иначе

			ДанныеПослерейсовогоСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
															СтруктураДанных.ПроведшийПослерейсовыйМедосмотр, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеПослерейсовогоСотрудника, Истина);
			СтруктураДанных.Вставить("ФИОПослерейсовогоМедработника", КорреспондентыКлиентСервер.ФИО(ДанныеПослерейсовогоСотрудника, Истина));
			
			Если ЗначениеЗаполнено(ДанныеПослерейсовогоСотрудника.Должность) Тогда
				СтруктураДанных.Вставить("ДолжностьПослерейсовогоМедработника", ТРег(ДанныеПослерейсовогоСотрудника.Должность) + ПослерейсовыйРазделитель);
			КонецЕсли;
			
		КонецЕсли;
		
		ПослерейсоваяОрганизация = "";
		Если ЗначениеЗаполнено(СтруктураДанных.ОрганизацияПроводящаяПослерейсовыйМедосмотр) Тогда
			ПослерейсоваяОрганизация = СтруктураДанных.ОрганизацияПроводящаяПослерейсовыйМедосмотр;
		ИначеЕсли ЗначениеЗаполнено(СтруктураДанных.ПроведшийПослерейсовыйМедосмотр)
						ИЛИ ЗначениеЗаполнено(СтруктураДанных.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр) Тогда
			ПослерейсоваяОрганизация = НаименованиеОрганизацииДокумента;	
		КонецЕсли;
		СтруктураДанных.Вставить("НаименованиеПослерейсовойМедорганизации", ПослерейсоваяОрганизация);
		
		СтруктураДанных.Вставить("ДанныеМедЛицензииПослерейсовогоМедосмотра", УчетГСМ.ПолучитьПредставлениеЛицензииНаПроведениеМедосмотров(СтруктураДанных.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр));
		
		СтруктураДанных.Вставить("ЧислоВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	       //
		
		СтруктураДанных.Вставить("ВремяВыездаФактическое", Формат(ВыборкаДокументов.ВремяВыездаТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		СтруктураДанных.Вставить("ЧислоВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	//
		
		СтруктураДанных.Вставить("ВремяВозвращенияФактическое", Формат(ВыборкаДокументов.ВремяВозвращенияТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		//выдать горючего прописью
		КоличествоЛитровГСМ = "";
		ДробнаяЧасть = ВыборкаДокументов.ВыдатьГорючего - Цел(ВыборкаДокументов.ВыдатьГорючего);
		Если (ВыборкаДокументов.ВыдатьГорючего<>0) И (ДробнаяЧасть = 0) Тогда
			ПараметрыПрописи = ",,,,,,,,0";
			КоличествоЛитровГСМ = ЧислоПрописью(ВыборкаДокументов.ВыдатьГорючего,,ПараметрыПрописи);
		ИначеЕсли (ВыборкаДокументов.ВыдатьГорючего<>0) И (ДробнаяЧасть > 0) Тогда
			ПараметрыПрописи = "целая, целых, целых, ж, сотая, сотых, сотых, м, 2";
			КоличествоЛитровГСМ = ЧислоПрописью(ВыборкаДокументов.ВыдатьГорючего,,ПараметрыПрописи);
		КонецЕсли;	
		СтруктураДанных.Вставить("ВыдатьГорючегоПрописью", КоличествоЛитровГСМ);	
		
		//Движение горючего
		ВыборкаГорючее = ВыборкаДокументов.ДвижениеГорючего.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаГорючее.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Горючего", ВыборкаГорючее.МаркаГорючего);
			СтруктураДанных.Вставить("КодМарки"+НомерСтроки+"Горючего", ВыборкаГорючее.КодМаркиГорючего);
			СтруктураДанных.Вставить("Выдано"+НомерСтроки+"Горючего", ВыборкаГорючее.ВыданоГорючее);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВыезде", ВыборкаГорючее.ОстатокГорючегоПриВыезде);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВозвращении", ВыборкаГорючее.ОстатокГорючегоПриВозвращении);
			СтруктураДанных.Вставить("Сдано"+НомерСтроки+"Горючего", ВыборкаГорючее.СданоГорючее);
			СтруктураДанных.Вставить("Коэффициент"+НомерСтроки+"Горючего", ВыборкаГорючее.КоэффициентИзмененияНормы);
			СтруктураДанных.Вставить("ВремяРаботы"+НомерСтроки+"Спецоборудования", УчетВремениКлиентСервер.ЧислоВСтроку(ВыборкаГорючее.ВремяРаботыСпецоборудования));
			СтруктураДанных.Вставить("ВремяРаботы"+НомерСтроки+"Двигателя", УчетВремениКлиентСервер.ЧислоВСтроку(ВыборкаГорючее.ВремяРаботыДвигателя)); 
		КонецЦикла;
		
		//Талоны на топливо
		ВыданыТалоныНаТопливо = Ложь;
		ТалоныНаТопливо = "";
		ВыборкаТалоны = ВыборкаДокументов.ВыданныеТалоныНаГорючее.Выбрать();
		
		Пока ВыборкаТалоны.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаТалоны.ДенежныйДокумент) Тогда
				ТалоныНаТопливо = ТалоныНаТопливо + СокрЛП(ВыборкаТалоны.ДенежныйДокумент.Серия)+" "+СокрЛП(ВыборкаТалоны.ДенежныйДокумент.Номер)+"; ";
				
				ВыданыТалоныНаТопливо = Истина;
			КонецЕсли;
		КонецЦикла;
		СтруктураДанных.Вставить("ТалоныНаТопливо", ТалоныНаТопливо);
		
		//Задание водителю
		ВыборкаЗадания = ВыборкаДокументов.ЗаданиеВодителю.Выбрать();
		
		НомерСтроки = 0;
		КоличествоСтрокВЗадании = 0;
		Пока ВыборкаЗадания.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 2 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Заказчик"+НомерСтроки+"НаименованиеАдрес", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика)+", "+СокрЛП(ВыборкаЗадания.АдресЗаказчика));
			СтруктураДанных.Вставить("Время"+НомерСтроки+"Прибытие", Формат(ВыборкаЗадания.ВремяПрибытия,"ДФ=""ЧЧ:мм"""));
			СтруктураДанных.Вставить("Время"+НомерСтроки+"Убытие", Формат(ВыборкаЗадания.ВремяУбытия,"ДФ=""ЧЧ:мм"""));
			СтруктураДанных.Вставить("Время"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоЧасов);
			СтруктураДанных.Вставить("Ездки"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоЕздок);
			СтруктураДанных.Вставить("Вид"+НомерСтроки+"Работы", СокрЛП(ВыборкаЗадания.ВидРаботы));
			
			СтруктураДанных.Вставить("Заказчик"+НомерСтроки+"Наименование", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика));
			
			КоличествоСтрокВЗадании = КоличествоСтрокВЗадании + 1;
		КонецЦикла;
		
		//Прицепы
		ВыборкаПрицепы = ВыборкаДокументов.Прицепы.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаПрицепы.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Прицепа", УчетГСМ.ПолучитьМаркуИМодельТС(ВыборкаПрицепы.Прицеп));
			СтруктураДанных.Вставить("ГосНомер"+НомерСтроки+"Прицепа", ВыборкаПрицепы.РегистрационныйНомернойЗнак);
			СтруктураДанных.Вставить("ГаражныйНомер"+НомерСтроки+"Прицепа", ВыборкаПрицепы.ГаражныйНомер);
		КонецЦикла;
		
		//Ответственные за безопасность груза
		ВыборкаОтветственнных = ВыборкаДокументов.ОтветственныеЗаГруз.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаОтветственнных.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 2 Тогда
				Прервать;
			КонецЕсли;
		
			СтруктураДанных.Вставить("ДолжностьФИООтветственного"+НомерСтроки+"ЗаГруз", СокрЛП(ВыборкаОтветственнных.ДолжностьОтветственного)+", "+СокрЛП(ВыборкаОтветственнных.ФИООтветственного));
			
			СтруктураДанных.Вставить("ДолжностьФИООтветственногоОтЗаказчика"+НомерСтроки+"ЗаГруз", СокрЛП(ВыборкаОтветственнных.ДолжностьОтветственногоОтЗаказчика)+", "+СокрЛП(ВыборкаОтветственнных.ФИООтветственногоОтЗаказчика));
		КонецЦикла;
		
		//Такелажники
		ВыборкаТакелажники = ВыборкаДокументов.Такелажники.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаТакелажники.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 2 Тогда
				Прервать;
			КонецЕсли;
		
			СтруктураДанных.Вставить("Такелажник"+НомерСтроки+"ФамилияИнициалы", СокрЛП(ВыборкаТакелажники.ФамилияИнициалыТакелажника));
			СтруктураДанных.Вставить("Такелажник"+НомерСтроки+"НомерУдостоверения", СокрЛП(ВыборкаТакелажники.НомерУдостоверения));
		КонецЦикла;
		
	
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВыпускающийТСДиспетчер, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ДиспетчерВыпустилИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.ЛицоДопускающееВодителяПоСостояниюЗдоровья, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ДолжностьМедРаботника", ДанныеСотрудника.Должность);
		СтруктураДанных.Вставить("МедРаботник", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВыездРазрешилМеханик, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("МеханикВыпустилТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ПринялТСМеханик, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("МеханикПринялТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВодительПринялТС, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ВодительПринялТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ВодительСдалТС, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ВодительСдалТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ТаксировщикПутевогоЛиста, СтруктураДанных.ДатаПутевогоЛиста);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("Таксировщик", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		СтруктураДанных.Вставить("СтандартнаяКарточка", 	"стандартная, ");
		СтруктураДанных.Вставить("ОграниченнаяКарточка", 	"ограниченная");
		
		//вывод областей табличного документа
		ДанныеВодителя = УчетГСМ.ПолучитьДанныеВодителя(СтруктураДанных.Водитель, СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия);
		
		ДанныеСотрудника = Справочники.Сотрудники.ДанныеСотрудника(СтруктураДанных.Водитель, "Фамилия, Имя, Отчество", СтруктураДанных.ДатаПутевогоЛиста);
		СтруктураДанных.Водитель = ДанныеСотрудника.Фамилия + " " + ДанныеСотрудника.Имя + " " + ДанныеСотрудника.Отчество;
			
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Заполнить(СтруктураДанных);
		Область.Параметры.Заполнить(ДанныеВодителя);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(Область, "НомерПутевогоЛиста", СтруктураДанных.НомерПутевогоЛиста, СтруктураДанных.Ссылка, Неопределено, Истина);
		
		ТабличныйДокумент.Вывести(Область);
		
		ЗачеркнутыйШрифт = Новый Шрифт("Arial",9,,,,Истина);
		Если ЗначениеЗаполнено(СтруктураДанных.ЛицензионнаяКарточка) Тогда
			Если СтруктураДанных.ЛицензионнаяКарточка.ОграниченнаяКарточка Тогда
				ТабличныйДокумент.Область("СтандартнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
			Иначе
				ТабличныйДокумент.Область("ОграниченнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
			КонецЕсли;
		Иначе
			ТабличныйДокумент.Область("СтандартнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
			ТабличныйДокумент.Область("ОграниченнаяКарточка").Шрифт = ЗачеркнутыйШрифт;
		КонецЕсли;	
		
		Область = Макет.ПолучитьОбласть("РаботаВодителяТСДвижениеГорючего");
		Область.Параметры.Заполнить(СтруктураДанных);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(Область, "НомерПутевогоЛиста", СтруктураДанных.НомерПутевогоЛиста, СтруктураДанных.Ссылка, Неопределено, Истина);

		ТабличныйДокумент.Вывести(Область);
		
		Если КоличествоСтрокВЗадании > 0 Тогда
			Если ЗначениеЗаполнено(СокрЛП(СтруктураДанных.ОсобыеОтметки)) Тогда
				Область = Макет.ПолучитьОбласть("ЗаданиеВодителюОтметкиЗаполнены");
			Иначе
				Область = Макет.ПолучитьОбласть("ЗаданиеВодителюЗаполненоОтметкиПусты");
			КонецЕсли;	
		Иначе
			Область = Макет.ПолучитьОбласть("ЗаданиеВодителюПустое");
		КонецЕсли;	
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
	
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Оборотная сторона
		
		Область = Макет.ПолучитьОбласть("ЗаголовокОборотнойСтороны");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ВыполнениеЗадания");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ОтветственныеЗаГрузИТакелажники");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("РезультатРаботыТС");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
КонецФункции	

#КонецОбласти

#КонецЕсли
