////////////////////////////////////////////////////////////////////////////////
// Менеджер обмена через универсальный формат (БГУ2-Касса от 08.04.2026 17:41:31)
//
////////////////////////////////////////////////////////////////////////////////
#Область СлужебныйПрограммныйИнтерфейс
#Область ПроцедурыКонвертации
// Процедура, выполняемая перед началом конвертации данных.
//
// Параметры:
//  КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//
Процедура ПередКонвертацией(КомпонентыОбмена) Экспорт
	Если КомпонентыОбмена.НаправлениеОбмена = "Получение" Тогда
		ТипЦены									= КомпонентыОбмена.УзелКорреспондента.ТипЦены; 
		СтатьяАналитикиОплаты					= Справочники.СтатьиАналитикиОплатыЧекаККМ.ПустаяСсылка();
		ВыгружатьЧекиКакОтчетОРозничныхПродажах	= КомпонентыОбмена.УзелКорреспондента.ВыгружатьЧекиКакОтчетОРозничныхПродажах;
		
		КомпонентыОбмена.ПараметрыКонвертации.Вставить("ТипЦены",									ТипЦены);
		КомпонентыОбмена.ПараметрыКонвертации.Вставить("СтатьяАналитикиОплаты",						СтатьяАналитикиОплаты);
		КомпонентыОбмена.ПараметрыКонвертации.Вставить("ВыгружатьЧекиКакОтчетОРозничныхПродажах",	ВыгружатьЧекиКакОтчетОРозничныхПродажах);
		
		ЗаполнитьЗначенияСтавокНДС(КомпонентыОбмена);
	Иначе
		ДатаНачалаВыгрузкиДокументов	= КомпонентыОбмена.УзелКорреспондента.ДатаНачалаВыгрузкиДокументов;
		ОтправлятьГруппыПрейскурант		= КомпонентыОбмена.УзелКорреспондента.ОтправлятьГруппыПрейскурант;
		ТипЦены							= КомпонентыОбмена.УзелКорреспондента.ТипЦены;
		ТЗЦМОСлужебные					= КомпонентыОбмена.УзелКорреспондента.ЦМОСлужебные;
		
		МассивЦМО = Новый Массив;
		
		Для Каждого СтрокаТаблицы Из ТЗЦМОСлужебные Цикл
			МассивЦМО.Добавить(СтрокаТаблицы.ЦМО);
		КонецЦикла;
		
		КомпонентыОбмена.ПараметрыКонвертации.Вставить("ДатаНачалаВыгрузкиДокументов",	ДатаНачалаВыгрузкиДокументов);
		КомпонентыОбмена.ПараметрыКонвертации.Вставить("ОтправлятьГруппыПрейскурант",	ОтправлятьГруппыПрейскурант);
		КомпонентыОбмена.ПараметрыКонвертации.Вставить("ТипЦены",						ТипЦены);
		КомпонентыОбмена.ПараметрыКонвертации.Вставить("МассивЦМО",						МассивЦМО);
	
	КонецЕсли;
КонецПроцедуры

// Процедура, выполняемая после выполнения конвертации данных.
//
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//
Процедура ПослеКонвертации(КомпонентыОбмена) Экспорт
	Если КомпонентыОбмена.НаправлениеОбмена = "Отправка" 
		И НЕ ЗначениеЗаполнено(КомпонентыОбмена.УзелКорреспондента.НомерОтправленного) 
		И КомпонентыОбмена.УзелКорреспондента.ВыгружатьОстатки Тогда
		
		ВыгрузитьОстатки(КомпонентыОбмена);
			
	КонецЕсли;
	
	Если КомпонентыОбмена.НаправлениеОбмена = "Отправка" 
		И КомпонентыОбмена.УзелКорреспондента.ВыгружатьОстаткиРегулярно Тогда
		
		ВыгрузитьИнформативныеОстатки(КомпонентыОбмена);
			
	КонецЕсли;
КонецПроцедуры

// Процедура, выполняемая перед началом отложенного заполнения объектов.
//
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//
Процедура ПередОтложеннымЗаполнением(КомпонентыОбмена) Экспорт
КонецПроцедуры

// Процедура, выполняемая при получении удаления объекта.
//
// Параметры:
//   КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//   УдаляемыйОбъект - Удаляемый объект данных
//
Процедура ПередОбработкойУдаляемогоОбъекта(КомпонентыОбмена, УдаляемыйОбъект) Экспорт
КонецПроцедуры

#КонецОбласти
// Возвращает версию формата менеджера обмена.
//
// Возвращаемое значение:
//  Строка - номер версии.
//   1 - базовые возможности
//   2 - расширенные возможности конвертации свойств табличных частей и общих составных свойств. Для БСП 2.4.1 и выше
//   3 - предусмотрен обход только заголовков при инициализации ПКС.
Функция ВерсияФорматаМенеджераОбмена() Экспорт
	Возврат "2";
КонецФункции

// Заполняет таблицу правил обработки данных.
//
// Параметры:
//  НаправлениеОбмена      - Строка - "Отправка" либо "Получение".
//  ПравилаОбработкиДанных - см. ОбменДаннымиXDTOСервер.ТаблицаПравилОбработкиДанных
// 
Процедура ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных) Экспорт
	Если НаправлениеОбмена = "Отправка" Тогда
		Если ПравилаОбработкиДанных.Колонки.Найти("ОчисткаДанных") = Неопределено Тогда
			ПравилаОбработкиДанных.Колонки.Добавить("ОчисткаДанных");
		КонецЕсли;
		ДобавитьПОД_Документ_АктПриемкиМ7(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ПоступлениеМЗ(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ТребованиеНакладная0315006(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_УстановкаЦенНоменклатуры(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_Номенклатура_Отправка(ПравилаОбработкиДанных);
	ИначеЕсли НаправлениеОбмена = "Получение" Тогда
		ДобавитьПОД_Документ_ОтчетОРозничныхПродажах(ПравилаОбработкиДанных);
		ДобавитьПОД_Документ_ЧекККМ(ПравилаОбработкиДанных);
	КонецЕсли;
КонецПроцедуры
// Заполняет таблицу правил конвертации объектов.
//
// Параметры:
//  НаправлениеОбмена  - Строка - "Отправка" либо "Получение".
//  ПравилаКонвертации - ТаблицаЗначений - таблица значений, в которую будут добавлены правила.
// 
Процедура ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт
	Если НаправлениеОбмена = "Отправка" Тогда
		ДобавитьПКО_Документ_АктПриемкиМ7_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Документ_ОстаткиТоварыВТорговыхТочках_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Документ_ПоступлениеМЗ_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Документ_ТребованиеНакладная0315006_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Документ_УстановкаЦенНоменклатуры_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ИнформативныеОстатки_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_Контрагенты_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_МестаХранения_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_МестаХраненияГруппа_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_НоменклатураГруппа(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ПрейскурантНоменклатура_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_СтавкиНДС_Отправка(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ШтрихкодыНоменклатуры_Отправка(ПравилаКонвертации);
	ИначеЕсли НаправлениеОбмена = "Получение" Тогда
		ДобавитьПКО_Документ_ОтчетОРозничныхПродажах_Получение(ПравилаКонвертации);
		ДобавитьПКО_Документ_ЧекККМ_Получение(ПравилаКонвертации);
		ДобавитьПКО_Документ_ЧекККМНаВозврат_Получение(ПравилаКонвертации);
		ДобавитьПКО_Справочник_КассыККМ(ПравилаКонвертации);
		ДобавитьПКО_Справочник_ПрейскурантНоменклатура_Получение(ПравилаКонвертации);
	КонецЕсли;
	ДобавитьПКО_Справочник_Валюты(ПравилаКонвертации);
	ДобавитьПКО_Справочник_ЕдиницыИзмерения(ПравилаКонвертации);
	ДобавитьПКО_Справочник_Организации(ПравилаКонвертации);
	ДобавитьПКО_Справочник_Пользователи(ПравилаКонвертации);
	ДобавитьПКО_Справочник_СтраныМира(ПравилаКонвертации);
	ДобавитьПКО_Справочник_ТипыЦен(ПравилаКонвертации);
КонецПроцедуры
#Область ПКПД
// Заполняет таблицу правил конвертации предопределенных данных.
//
// Параметры:
//  НаправлениеОбмена - Строка - "Отправка" либо "Получение".
//  ПравилаКонвертации - ТаблицаЗначений - таблица значений, в которую будут добавлены правила. 
Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации) Экспорт

	Если НаправлениеОбмена = "Отправка" Тогда
		// Перечисление_ЮрФизЛицо.
		ПравилоКонвертации           = ПравилаКонвертации.Добавить();
		ПравилоКонвертации.ИмяПКПД   = "Перечисление_ЮрФизЛицо";
		ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.ЮрФизЛицо;
		ПравилоКонвертации.ТипXDTO   = "ЮридическоеФизическоеЛицо";
	
		ЗначенияДляОтправки = Новый Соответствие;
		ЗначенияДляОтправки.Вставить(Перечисления.ЮрФизЛицо.ФизЛицо, "ФизическоеЛицо");
		ЗначенияДляОтправки.Вставить(Перечисления.ЮрФизЛицо.ЮрЛицо, "ЮридическоеЛицо");
		ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	КонецЕсли;
	// Перечисление_СтавкиНДС.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_СтавкиНДС";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.СтавкиНДС;
	ПравилоКонвертации.ТипXDTO   = "СтавкиНДС";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.БезНДС, "БезНДС");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС0, "НДС0");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС10, "НДС10");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС10_110, "НДС10_110");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС18, "НДС18");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС18_118, "НДС18_118");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС20, "НДС20");
	ЗначенияДляОтправки.Вставить(Перечисления.СтавкиНДС.НДС20_120, "НДС20_120");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("БезНДС", Перечисления.СтавкиНДС.БезНДС);
	ЗначенияДляПолучения.Вставить("НДС0", Перечисления.СтавкиНДС.НДС0);
	ЗначенияДляПолучения.Вставить("НДС10", Перечисления.СтавкиНДС.НДС10);
	ЗначенияДляПолучения.Вставить("НДС10_110", Перечисления.СтавкиНДС.НДС10_110);
	ЗначенияДляПолучения.Вставить("НДС18", Перечисления.СтавкиНДС.НДС18);
	ЗначенияДляПолучения.Вставить("НДС18_118", Перечисления.СтавкиНДС.НДС18_118);
	ЗначенияДляПолучения.Вставить("НДС20", Перечисления.СтавкиНДС.НДС20);
	ЗначенияДляПолучения.Вставить("НДС20_120", Перечисления.СтавкиНДС.НДС20_120);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

КонецПроцедуры
#КонецОбласти

#Область ПараметрыКонвертации
// Заполняет параметры конвертации.
//
// Параметры:
//  ПараметрыКонвертации - Структура - структура, в которую добавляются параметры конвертации:
//                         Ключ - имя параметра, значение - значение параметра, по умолчанию - Неопределено.
//
Процедура ЗаполнитьПараметрыКонвертации(ПараметрыКонвертации) Экспорт
	ПараметрыКонвертации.Вставить("ТипЦены");
	ПараметрыКонвертации.Вставить("ДатаНачалаПериодаВыгрузкиДокументов");
	ПараметрыКонвертации.Вставить("СтатьяАналитикиОплаты");
	ПараметрыКонвертации.Вставить("ОтправлятьГруппыПрейскурант");
	ПараметрыКонвертации.Вставить("ВыгружатьЧекиКакОтчетОРозничныхПродажах");
	ПараметрыКонвертации.Вставить("ЗначенияСтавокНДС");
КонецПроцедуры

#КонецОбласти
// Процедура-обертка, выполняет запуск указанной в параметрах процедуры модуля менеджера обмена через формат.
//
// Параметры:
//  ИмяПроцедуры - Строка - имя процедуры этого модуля.
//  Параметры - Структура:
//    * ОбъектОбработки - Произвольный
//    * ИспользованиеПКО - Структура
//    * КомпонентыОбмена - см. ОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//    * ДанныеИБ - СправочникОбъект
//               - ДокументОбъект
//               - и т.п.
//    * ПолученныеДанные - СправочникОбъект
//                       - ДокументОбъект
//                       - и т.п.
//    * КонвертацияСвойств - ТаблицаЗначений
//    * ДанныеXDTO - см. ОбменДаннымиXDTOСервер.ДанныеXDTOИзДанныхИБ
//    * СтекВыгрузки - Массив из Произвольный
//
Процедура ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры) Экспорт
	Если ИмяПроцедуры = "ПОД_Документ_ОтчетОРозничныхПродажах_ПриОбработке" Тогда 
		ПОД_Документ_ОтчетОРозничныхПродажах_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Документ_ЧекККМ_ПриОбработке" Тогда 
		ПОД_Документ_ЧекККМ_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПОД_Справочник_Номенклатура_Отправка_ПриОбработке" Тогда 
		ПОД_Справочник_Номенклатура_Отправка_ПриОбработке(
			Параметры.ОбъектОбработки, Параметры.ИспользованиеПКО, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_АктПриемкиМ7_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Документ_АктПриемкиМ7_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ОстаткиТоварыВТорговыхТочках_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ОстаткиТоварыВТорговыхТочках_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПриКонвертацииДанныхXDTO" Тогда 
		ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ПоступлениеМЗ_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ПоступлениеМЗ_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ТребованиеНакладная0315006_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Документ_ТребованиеНакладная0315006_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_УстановкаЦенНоменклатуры_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Документ_УстановкаЦенНоменклатуры_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ЧекККМ_Получение_ПриКонвертацииДанныхXDTO" Тогда 
		ПКО_Документ_ЧекККМ_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ЧекККМ_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Документ_ЧекККМ_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ЧекККМНаВозврат_Получение_ПриКонвертацииДанныхXDTO" Тогда 
		ПКО_Документ_ЧекККМНаВозврат_Получение_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Документ_ЧекККМНаВозврат_Получение_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Документ_ЧекККМНаВозврат_Получение_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_Валюты_ПриКонвертацииДанныхXDTO" Тогда 
		ПКО_Справочник_Валюты_ПриКонвертацииДанныхXDTO(
			Параметры.ДанныеXDTO, Параметры.ПолученныеДанные, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_Валюты_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Справочник_Валюты_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ЕдиницыИзмерения_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_ЕдиницыИзмерения_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ЕдиницыИзмерения_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Справочник_ЕдиницыИзмерения_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_Организации_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_Организации_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ПрейскурантНоменклатура_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_ПрейскурантНоменклатура_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ШтрихкодыНоменклатуры_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_ШтрихкодыНоменклатуры_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_ИнформативныеОстатки_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_ИнформативныеОстатки_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_СтавкиНДС_Отправка_ПриОтправкеДанных" Тогда 
		ПКО_Справочник_СтавкиНДС_Отправка_ПриОтправкеДанных(
			Параметры.ДанныеИБ, Параметры.ДанныеXDTO, Параметры.КомпонентыОбмена, Параметры.СтекВыгрузки);
	ИначеЕсли ИмяПроцедуры = "ПКО_Справочник_СтраныМира_ПередЗаписьюПолученныхДанных" Тогда 
		ПКО_Справочник_СтраныМира_ПередЗаписьюПолученныхДанных(
			Параметры.ПолученныеДанные, Параметры.ДанныеИБ, Параметры.КонвертацияСвойств, Параметры.КомпонентыОбмена);
	ИначеЕсли ИмяПроцедуры = "ОтложеннаяОбработка_ЧекККМ" Тогда 
		ОтложеннаяОбработка_ЧекККМ(
			Параметры.Объект, Параметры.КомпонентыОбмена.ПараметрыКонвертации, Параметры.ОбъектМодифицирован);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Функция Подключаемый_ИдентификаторМодуля() Экспорт
	Возврат "8a57e8ff-6d8f-47f0-9db6-226393d927bd";
КонецФункции
#Область ПОД
Процедура ДобавитьПОД_Документ_АктПриемкиМ7(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_АктПриемкиМ7";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.АктПриемкиМ7;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_АктПриемкиМ7_Отправка");
КонецПроцедуры

Процедура ДобавитьПОД_Документ_ОтчетОРозничныхПродажах(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_ОтчетОРозничныхПродажах";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Документ.ОтчетОРозничныхПродажах";
	ПравилоОбработки.ПриОбработке            = "ПОД_Документ_ОтчетОРозничныхПродажах_ПриОбработке";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ОтчетОРозничныхПродажах_Получение");
КонецПроцедуры

Процедура ДобавитьПОД_Документ_ПоступлениеМЗ(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_ПоступлениеМЗ";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ПоступлениеМЗ;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ПоступлениеМЗ_Отправка");
КонецПроцедуры

Процедура ДобавитьПОД_Документ_ТребованиеНакладная0315006(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_ТребованиеНакладная0315006";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ТребованиеНакладная0315006;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ТребованиеНакладная0315006_Отправка");
КонецПроцедуры

Процедура ДобавитьПОД_Документ_УстановкаЦенНоменклатуры(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_УстановкаЦенНоменклатуры";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.УстановкаЦенНоменклатуры;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_УстановкаЦенНоменклатуры_Отправка");
КонецПроцедуры

Процедура ДобавитьПОД_Документ_ЧекККМ(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_ЧекККМ";
	ПравилоОбработки.ОбъектВыборкиФормат     = "Документ.ЧекККМ";
	ПравилоОбработки.ПриОбработке            = "ПОД_Документ_ЧекККМ_ПриОбработке";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ЧекККМ_Получение");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ЧекККМНаВозврат_Получение");
КонецПроцедуры

Процедура ДобавитьПОД_Справочник_Номенклатура_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_Номенклатура_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.Прейскурант;
	ПравилоОбработки.ПриОбработке            = "ПОД_Справочник_Номенклатура_Отправка_ПриОбработке";
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_НоменклатураГруппа");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ПрейскурантНоменклатура_Отправка");
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ШтрихкодыНоменклатуры_Отправка");
КонецПроцедуры


#КонецОбласти
#Область ПКО
Процедура ДобавитьПКО_Документ_АктПриемкиМ7_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_АктПриемкиМ7_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.АктПриемкиМ7;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ПоступлениеТоваровУслуг";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_АктПриемкиМ7_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "",               "Валюта", 1, "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "",               "ВалютаВзаиморасчетов", 1, "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "",               "ВидОперации", 1);
	ДобавитьПКС(СвойстваШапки, "Дата",           "Дата");
	ДобавитьПКС(СвойстваШапки, "Контрагент",     "Контрагент", , "Справочник_Контрагенты_Отправка");
	ДобавитьПКС(СвойстваШапки, "Номер",          "Номер");
	ДобавитьПКС(СвойстваШапки, "Организация",    "Организация", , "Справочник_Организации");
	ДобавитьПКС(СвойстваШапки, "СуммаДокумента", "Сумма");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмерения", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_ПрейскурантНоменклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Цена", 1);

КонецПроцедуры

Процедура ДобавитьПКО_Документ_ОстаткиТоварыВТорговыхТочках_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ОстаткиТоварыВТорговыхТочках_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Неопределено;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ПоступлениеТоваровУслуг";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ОстаткиТоварыВТорговыхТочках_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "", "Валюта", 1, "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "", "ВалютаВзаиморасчетов", 1, "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "", "ВидОперации", 1);
	ДобавитьПКС(СвойстваШапки, "", "Дата");
	ДобавитьПКС(СвойстваШапки, "", "Контрагент");
	ДобавитьПКС(СвойстваШапки, "", "Номер");
	ДобавитьПКС(СвойстваШапки, "", "Организация", , "Справочник_Организации");
	ДобавитьПКС(СвойстваШапки, "", "Сумма");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмерения", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_ПрейскурантНоменклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Цена", 1);

КонецПроцедуры

Процедура ДобавитьПКО_Документ_ОтчетОРозничныхПродажах_Получение(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Документ_ОтчетОРозничныхПродажах_Получение";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Документы.ОтчетПоКассовойСмене;
	ПравилоКонвертации.ОбъектФормата                      = "Документ.ОтчетОРозничныхПродажах";
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO           = "ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных       = "ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации               = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",          "Дата");
	ДобавитьПКС(СвойстваШапки, "КассоваяСмена", "КассоваяСмена");
	ДобавитьПКС(СвойстваШапки, "Комментарий",   "Комментарий");
	ДобавитьПКС(СвойстваШапки, "Номер",         "Номер");
	ДобавитьПКС(СвойстваШапки, "Организация",   "Организация", , "Справочник_Организации");
	ДобавитьПКС(СвойстваШапки, "Ответственный", "Ответственный", , "Справочник_Пользователи");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ОплатаПлатежнымиКартами", "ОплатаПлатежнымиКартами");
	ДобавитьПКС(СвойстваТЧ, "Сумма", "СуммаОплаты");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ВозвратТовары",           "");
	ДобавитьПКС(СвойстваТЧ, "Количество",   "", 1);
	ДобавитьПКС(СвойстваТЧ, "Номенклатура", "", 1, "Справочник_ПрейскурантНоменклатура_Получение");
	ДобавитьПКС(СвойстваТЧ, "СтавкаНДС",    "", 1);
	ДобавитьПКС(СвойстваТЧ, "Сумма",        "", 1);
	ДобавитьПКС(СвойстваТЧ, "СуммаНДС",     "", 1);
	ДобавитьПКС(СвойстваТЧ, "Цена",         "", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ПродажиРаботыУслуги",     "");
	ДобавитьПКС(СвойстваТЧ, "Количество",   "", 1);
	ДобавитьПКС(СвойстваТЧ, "Номенклатура", "", 1, "Справочник_ПрейскурантНоменклатура_Получение");
	ДобавитьПКС(СвойстваТЧ, "СтавкаНДС",    "", 1);
	ДобавитьПКС(СвойстваТЧ, "Сумма",        "", 1);
	ДобавитьПКС(СвойстваТЧ, "СуммаНДС",     "", 1);
	ДобавитьПКС(СвойстваТЧ, "Цена",         "", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ПродажиТовары",           "");
	ДобавитьПКС(СвойстваТЧ, "Количество",   "", 1);
	ДобавитьПКС(СвойстваТЧ, "Номенклатура", "", 1, "Справочник_ПрейскурантНоменклатура_Получение");
	ДобавитьПКС(СвойстваТЧ, "СтавкаНДС",    "", 1);
	ДобавитьПКС(СвойстваТЧ, "Сумма",        "", 1);
	ДобавитьПКС(СвойстваТЧ, "СуммаНДС",     "", 1);
	ДобавитьПКС(СвойстваТЧ, "Цена",         "", 1);

	ПравилоКонвертации.ПоляПоиска.Добавить("Дата,Номер");
КонецПроцедуры

Процедура ДобавитьПКО_Документ_ПоступлениеМЗ_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ПоступлениеМЗ_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ПоступлениеМЗ;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ПоступлениеТоваровУслуг";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ПоступлениеМЗ_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "ВалютаДокумента", "Валюта", , "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "ВалютаДокумента", "ВалютаВзаиморасчетов", , "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "",                "ВидОперации", 1);
	ДобавитьПКС(СвойстваШапки, "Дата",            "Дата");
	ДобавитьПКС(СвойстваШапки, "Контрагент",      "Контрагент", , "Справочник_Контрагенты_Отправка");
	ДобавитьПКС(СвойстваШапки, "Номер",           "Номер");
	ДобавитьПКС(СвойстваШапки, "Организация",     "Организация", , "Справочник_Организации");
	ДобавитьПКС(СвойстваШапки, "СуммаДокумента",  "Сумма");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмерения", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_ПрейскурантНоменклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Цена", 1);

КонецПроцедуры

Процедура ДобавитьПКО_Документ_ТребованиеНакладная0315006_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_ТребованиеНакладная0315006_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ТребованиеНакладная0315006;
	ПравилоКонвертации.ОбъектФормата     = "Документ.ПоступлениеТоваровУслуг";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ТребованиеНакладная0315006_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "",            "Валюта", 1, "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "",            "ВалютаВзаиморасчетов", 1, "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "",            "ВидОперации", 1);
	ДобавитьПКС(СвойстваШапки, "Дата",        "Дата");
	ДобавитьПКС(СвойстваШапки, "",            "Контрагент", 1);
	ДобавитьПКС(СвойстваШапки, "Номер",       "Номер");
	ДобавитьПКС(СвойстваШапки, "Организация", "Организация", , "Справочник_Организации");
	ДобавитьПКС(СвойстваШапки, "",            "Сумма", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмерения", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_ПрейскурантНоменклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Цена", 1);

КонецПроцедуры

Процедура ДобавитьПКО_Документ_УстановкаЦенНоменклатуры_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_УстановкаЦенНоменклатуры_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.УстановкаЦенНоменклатуры;
	ПравилоКонвертации.ОбъектФормата     = "Документ.УстановкаЦенНоменклатуры";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_УстановкаЦенНоменклатуры_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",          "Дата");
	ДобавитьПКС(СвойстваШапки, "Комментарий",   "Комментарий");
	ДобавитьПКС(СвойстваШапки, "Номер",         "Номер");
	ДобавитьПКС(СвойстваШапки, "Ответственный", "Ответственный", , "Справочник_Пользователи");
	ДобавитьПКС(СвойстваШапки, "ТипЦен",        "ТипЦен", , "Справочник_ТипыЦен");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_ПрейскурантНоменклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "Цена", 1);

КонецПроцедуры

Процедура ДобавитьПКО_Документ_ЧекККМ_Получение(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Документ_ЧекККМ_Получение";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Документы.ЧекККМ;
	ПравилоКонвертации.ОбъектФормата                      = "Документ.ЧекККМ";
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO           = "ПКО_Документ_ЧекККМ_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных       = "ПКО_Документ_ЧекККМ_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ПослеЗагрузкиВсехДанных            = "ОтложеннаяОбработка_ЧекККМ";
	ПравилоКонвертации.ВариантИдентификации               = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",           "Дата");
	ДобавитьПКС(СвойстваШапки, "КассаККМ",       "КассаККМ", , "Справочник_КассыККМ");
	ДобавитьПКС(СвойстваШапки, "НомерСменыККМ",  "НомерКассовойСмены");
	ДобавитьПКС(СвойстваШапки, "НомерЧекаККМ",   "НомерЧекаФР");
	ДобавитьПКС(СвойстваШапки, "СуммаДокумента", "Сумма");
	ДобавитьПКС(СвойстваШапки, "ФормаОплаты",    "", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ТоварыРаботыУслуги", "");
	ДобавитьПКС(СвойстваТЧ, "Количество",   "", 1);
	ДобавитьПКС(СвойстваТЧ, "Номенклатура", "", 1, "Справочник_ПрейскурантНоменклатура_Получение");
	ДобавитьПКС(СвойстваТЧ, "Содержание",   "", 1);
	ДобавитьПКС(СвойстваТЧ, "СтавкаНДС",    "", 1);
	ДобавитьПКС(СвойстваТЧ, "Сумма",        "", 1);
	ДобавитьПКС(СвойстваТЧ, "СуммаНДС",     "", 1);
	ДобавитьПКС(СвойстваТЧ, "Цена",         "", 1);

	ПравилоКонвертации.ПоляПоиска.Добавить("КассаККМ,НомерСменыККМ,НомерЧекаККМ");
КонецПроцедуры

Процедура ДобавитьПКО_Документ_ЧекККМНаВозврат_Получение(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Документ_ЧекККМНаВозврат_Получение";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Документы.ЧекККМНаВозврат;
	ПравилоКонвертации.ОбъектФормата                      = "Документ.ЧекККМ";
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO           = "ПКО_Документ_ЧекККМНаВозврат_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных       = "ПКО_Документ_ЧекККМНаВозврат_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ПослеЗагрузкиВсехДанных            = "ОтложеннаяОбработка_ЧекККМ";
	ПравилоКонвертации.ВариантИдентификации               = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",           "Дата");
	ДобавитьПКС(СвойстваШапки, "КассаККМ",       "КассаККМ", , "Справочник_КассыККМ");
	ДобавитьПКС(СвойстваШапки, "НомерСменыККМ",  "НомерКассовойСмены");
	ДобавитьПКС(СвойстваШапки, "НомерЧекаККМ",   "НомерЧекаФР");
	ДобавитьПКС(СвойстваШапки, "СуммаДокумента", "Сумма");
	ДобавитьПКС(СвойстваШапки, "ФормаОплаты",    "", 1);
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ТоварыРаботыУслуги", "");
	ДобавитьПКС(СвойстваТЧ, "Количество",   "", 1);
	ДобавитьПКС(СвойстваТЧ, "Номенклатура", "", 1, "Справочник_ПрейскурантНоменклатура_Получение");
	ДобавитьПКС(СвойстваТЧ, "Содержание",   "", 1);
	ДобавитьПКС(СвойстваТЧ, "СтавкаНДС",    "", 1);
	ДобавитьПКС(СвойстваТЧ, "Сумма",        "", 1);
	ДобавитьПКС(СвойстваТЧ, "СуммаНДС",     "", 1);
	ДобавитьПКС(СвойстваТЧ, "Цена",         "", 1);

	ПравилоКонвертации.ПоляПоиска.Добавить("Дата,КассаККМ,НомерСменыККМ,НомерЧекаККМ");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Валюты(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Справочник_Валюты";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Справочники.Валюты;
	ПравилоКонвертации.ОбъектФормата                      = "Справочник.Валюты";
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO           = "ПКО_Справочник_Валюты_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных       = "ПКО_Справочник_Валюты_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации               = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "ЗагружаетсяИзИнтернета", "ЗагружаетсяИзИнтернета");
	ДобавитьПКС(СвойстваШапки, "Код",                    "Код");
	ДобавитьПКС(СвойстваШапки, "Наименование",           "Наименование");
	ДобавитьПКС(СвойстваШапки, "НаименованиеПолное",     "НаименованиеПолное");
	ДобавитьПКС(СвойстваШапки, "Наценка",                "Наценка");
	ДобавитьПКС(СвойстваШапки, "ОсновнаяВалюта",         "ОсновнаяВалюта", , "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "СпособУстановкиКурса",   "");
	ПравилоКонвертации.ПоляПоиска.Добавить("Код,Наименование");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_ЕдиницыИзмерения(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Справочник_ЕдиницыИзмерения";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Справочники.КлассификаторЕдиницИзмерения;
	ПравилоКонвертации.ОбъектФормата                      = "Справочник.ЕдиницыИзмерения";
	ПравилоКонвертации.ПриОтправкеДанных                  = "ПКО_Справочник_ЕдиницыИзмерения_ПриОтправкеДанных";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных       = "ПКО_Справочник_ЕдиницыИзмерения_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации               = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Код",                "Код");
	ДобавитьПКС(СвойстваШапки, "Наименование",       "Наименование");
	ДобавитьПКС(СвойстваШапки, "НаименованиеПолное", "НаименованиеПолное");
	ПравилоКонвертации.ПоляПоиска.Добавить("Код");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_КассыККМ(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Справочник_КассыККМ";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Справочники.ФискальныеРегистраторы;
	ПравилоКонвертации.ОбъектФормата                      = "Справочник.КассыККМ";
	ПравилоКонвертации.ВариантИдентификации               = "ПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "СерийныйНомер", "РегистрационныйНомер");
	ПравилоКонвертации.ПоляПоиска.Добавить("СерийныйНомер");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Контрагенты_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_Контрагенты_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.Контрагенты;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.Контрагенты";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "ВидКонтрагента", "ЮридическоеФизическоеЛицо");
	ДобавитьПКС(СвойстваШапки, "ИНН",            "ИНН");
	ДобавитьПКС(СвойстваШапки, "КПП",            "КПП");
	ДобавитьПКС(СвойстваШапки, "Наименование",   "Наименование");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_НоменклатураГруппа(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_НоменклатураГруппа";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.Прейскурант;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.НоменклатураГруппа";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Код",          "КодВПрограмме");
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");
	ДобавитьПКС(СвойстваШапки, "Родитель",     "Группа", , "Справочник_НоменклатураГруппа");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Организации(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Справочник_Организации";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Справочники.Организации;
	ПравилоКонвертации.ОбъектФормата                      = "Справочник.Организации";
	ПравилоКонвертации.ПриОтправкеДанных                  = "ПКО_Справочник_Организации_ПриОтправкеДанных";
	ПравилоКонвертации.ВариантИдентификации               = "ПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "ГоловнаяОрганизация",     "ГоловнаяОрганизация", , "Справочник_Организации");
	ДобавитьПКС(СвойстваШапки, "ИНН",                     "ИНН");
	ДобавитьПКС(СвойстваШапки, "КодОКПО",                 "ОКПО");
	ДобавитьПКС(СвойстваШапки, "КПП",                     "КПП");
	ДобавитьПКС(СвойстваШапки, "Наименование",            "Наименование");
	ДобавитьПКС(СвойстваШапки, "НаименованиеПолное",      "НаименованиеПолное");
	ДобавитьПКС(СвойстваШапки, "НаименованиеСокращенное", "НаименованиеСокращенное");
	ДобавитьПКС(СвойстваШапки, "ОГРН",                    "ОГРН");
	ДобавитьПКС(СвойстваШапки, "Префикс",                 "Префикс");
	ДобавитьПКС(СвойстваШапки, "СвидетельствоДатаВыдачи", "СвидетельствоДатаВыдачи");
	ДобавитьПКС(СвойстваШапки, "СвидетельствоСерияНомер", "СвидетельствоСерияНомер");
	ДобавитьПКС(СвойстваШапки, "",                        "ЮридическоеФизическоеЛицо", 1);
	ПравилоКонвертации.ПоляПоиска.Добавить("ИНН,КПП");
	ПравилоКонвертации.ПоляПоиска.Добавить("НаименованиеПолное");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_Пользователи(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Справочник_Пользователи";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Справочники.Пользователи;
	ПравилоКонвертации.ОбъектФормата                      = "Справочник.Пользователи";
	ПравилоКонвертации.ВариантИдентификации               = "ПоУникальномуИдентификатору";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_ПрейскурантНоменклатура_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_ПрейскурантНоменклатура_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.Прейскурант;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.Номенклатура";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_ПрейскурантНоменклатура_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Артикул",      "Артикул");
	ДобавитьПКС(СвойстваШапки, "",             "Группа", 1, "Справочник_НоменклатураГруппа");
	ДобавитьПКС(СвойстваШапки, "",             "ЕдиницаИзмерения", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваШапки, "Код",          "КодВПрограмме");
	ДобавитьПКС(СвойстваШапки, "Наименование", "НаименованиеПолное");
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование", 1);
	ДобавитьПКС(СвойстваШапки, "",             "СтавкаНДС", 1);
	ДобавитьПКС(СвойстваШапки, "",             "ТипНоменклатуры", 1);
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_ПрейскурантНоменклатура_Получение(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Справочник_ПрейскурантНоменклатура_Получение";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Справочники.Прейскурант;
	ПравилоКонвертации.ОбъектФормата                      = "Справочник.Номенклатура";
	ПравилоКонвертации.ВариантИдентификации               = "ПоУникальномуИдентификатору";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Артикул",      "Артикул");
	ДобавитьПКС(СвойстваШапки, "Код",          "КодВПрограмме");
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");
	ДобавитьПКС(СвойстваШапки, "Родитель",     "Группа", , "Справочник_НоменклатураГруппа");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_ТипыЦен(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Справочник_ТипыЦен";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Справочники.ТипыЦенНоменклатуры;
	ПравилоКонвертации.ОбъектФормата                      = "Справочник.ТипыЦен";
	ПравилоКонвертации.ВариантИдентификации               = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "ВалютаЦены",      "ВалютаЦены", , "Справочник_Валюты");
	ДобавитьПКС(СвойстваШапки, "Наименование",    "Наименование");
	ДобавитьПКС(СвойстваШапки, "ЦенаВключаетНДС", "ЦенаВключаетНДС");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_ШтрихкодыНоменклатуры_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_ШтрихкодыНоменклатуры_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.Прейскурант;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.ШтрихкодыНоменклатуры";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_ШтрихкодыНоменклатуры_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Ссылка",   "НоменклатураОтбор", , "Справочник_ПрейскурантНоменклатура_Отправка");
	ДобавитьПКС(СвойстваШапки, "Штрихкод", "Штрихкод");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_ИнформативныеОстатки_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_ИнформативныеОстатки_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Неопределено;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.ИнформативныеОстатки";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_ИнформативныеОстатки_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "", "Дата", 1);
	ДобавитьПКС(СвойстваШапки, "", "Комментарий", 1);
	ДобавитьПКС(СвойстваШапки, "", "Склад", 1, "Справочник_МестаХранения_Отправка");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
	ДобавитьПКС(СвойстваТЧ, "", "КоличествоНаСкладе", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_ПрейскурантНоменклатура_Отправка");

КонецПроцедуры

Процедура ДобавитьПКО_Справочник_МестаХранения_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_МестаХранения_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.МестаХранения;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.Склады";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");
	ДобавитьПКС(СвойстваШапки, "Родитель",     "СкладГруппа", , "Справочник_МестаХраненияГруппа_Отправка");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_МестаХраненияГруппа_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_МестаХраненияГруппа_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Справочники.МестаХранения;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.СкладыГруппа";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Наименование", "Наименование");
	ДобавитьПКС(СвойстваШапки, "Родитель",     "Группа", , "Справочник_МестаХраненияГруппа_Отправка");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_СтавкиНДС_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Справочник_СтавкиНДС_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Неопределено;
	ПравилоКонвертации.ОбъектФормата     = "Справочник.СтавкиНДС";
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Справочник_СтавкиНДС_Отправка_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "", "ВидСтавки", 1);
	ДобавитьПКС(СвойстваШапки, "", "НеОблагается", 1);
	ДобавитьПКС(СвойстваШапки, "", "РасчетнаяСтавка", 1);
	ДобавитьПКС(СвойстваШапки, "", "Ставка", 1);
	ДобавитьПКС(СвойстваШапки, "", "Страна", 1, "Справочник_СтраныМира");
КонецПроцедуры

Процедура ДобавитьПКО_Справочник_СтраныМира(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Справочник_СтраныМира";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Справочники.СтраныМира;
	ПравилоКонвертации.ОбъектФормата                      = "Справочник.СтраныМира";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных       = "ПКО_Справочник_СтраныМира_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ВариантИдентификации               = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Код",                "Код");
	ДобавитьПКС(СвойстваШапки, "КодАльфа2",          "КодАльфа2");
	ДобавитьПКС(СвойстваШапки, "КодАльфа3",          "КодАльфа3");
	ДобавитьПКС(СвойстваШапки, "Наименование",       "Наименование");
	ДобавитьПКС(СвойстваШапки, "НаименованиеПолное", "НаименованиеПолное");
	ПравилоКонвертации.ПоляПоиска.Добавить("Код");
	ПравилоКонвертации.ПоляПоиска.Добавить("Наименование");
КонецПроцедуры


#КонецОбласти


Функция ДобавитьПКТЧ(ПравилоКонвертации, ИмяТЧКонфигурации, ИмяТЧФормата, ПространствоИмен = "")
	
	Если ПравилоКонвертации.СвойстваТабличныхЧастей.Колонки.Количество() = 0 Тогда
		ОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	КонецЕсли;
	
	КонвертацияТабличнойЧасти                = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
	КонвертацияТабличнойЧасти.ТЧКонфигурации = ИмяТЧКонфигурации;
	КонвертацияТабличнойЧасти.ТЧФормата      = ИмяТЧФормата;
	КонвертацияТабличнойЧасти.Свойства       = ОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	КонвертацияТабличнойЧасти.ПространствоИмен = ПространствоИмен;
	Возврат КонвертацияТабличнойЧасти.Свойства;
КонецФункции

Процедура ДобавитьПКС(РодительПКС, СвойствоКонфигурации, СвойствоФормата, ИспользуетсяАлгоритмКонвертации = 0, 
		ПравилоКонвертацииСвойства = "", ПространствоИмен = "")
	НоваяСтрока                                 = РодительПКС.Добавить();
	НоваяСтрока.СвойствоКонфигурации            = СвойствоКонфигурации;
	НоваяСтрока.СвойствоФормата                 = СвойствоФормата;
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
	НоваяСтрока.ПравилоКонвертацииСвойства      = ПравилоКонвертацииСвойства;
	НоваяСтрока.ПространствоИмен                = ПространствоИмен;
КонецПроцедуры

#Область ОбработчикиКонвертации
Процедура ПОД_Документ_ОтчетОРозничныхПродажах_ПриОбработке(ДанныеXDTO, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Документ_ОтчетОРозничныхПродажах_Получение = КомпонентыОбмена.УзелКорреспондента.ВыгружатьЧекиКакОтчетОРозничныхПродажах;
КонецПроцедуры
Процедура ПОД_Документ_ЧекККМ_ПриОбработке(ДанныеXDTO, ИспользованиеПКО, КомпонентыОбмена)
	ЗагрузитьОбъект = Истина;
	ИспользованиеПКО.Документ_ЧекККМ_Получение = Ложь;
	ИспользованиеПКО.Документ_ЧекККМНаВозврат_Получение = Ложь;
	
	Если ДанныеXDTO.Свойство("Отменен") Тогда
		Если ДанныеXDTO.Отменен Или КомпонентыОбмена.УзелКорреспондента.ВыгружатьЧекиКакОтчетОРозничныхПродажах Тогда
			ЗагрузитьОбъект = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеXDTO.Свойство("ТоварыПродажа") Или ДанныеXDTO.Свойство("Услуги") Тогда
		ИспользованиеПКО.Документ_ЧекККМ_Получение = ЗагрузитьОбъект;
	КонецЕсли;
	
	Если ДанныеXDTO.Свойство("ТоварыВозвратПродажи") Тогда
		ИспользованиеПКО.Документ_ЧекККМНаВозврат_Получение = ЗагрузитьОбъект;
	КонецЕсли;
КонецПроцедуры
Процедура ПОД_Справочник_Номенклатура_Отправка_ПриОбработке(ДанныеИБ, ИспользованиеПКО, КомпонентыОбмена)
	ИспользованиеПКО.Справочник_ПрейскурантНоменклатура_Отправка = Ложь;
	ИспользованиеПКО.Справочник_НоменклатураГруппа = Ложь;
	ИспользованиеПКО.Справочник_ШтрихкодыНоменклатуры_Отправка = Ложь;
	
	Если Не ДанныеИБ.ЭтоГруппа Тогда
		ИспользованиеПКО.Справочник_ПрейскурантНоменклатура_Отправка = Истина;
		Если ЗначениеЗаполнено(ДанныеИБ.Штрихкод) Тогда
			ИспользованиеПКО.Справочник_ШтрихкодыНоменклатуры_Отправка = Истина;
		КонецЕсли;
	Иначе
		ИспользованиеПКО.Справочник_НоменклатураГруппа = Истина;
	КонецЕсли;
КонецПроцедуры
Процедура ПКО_Документ_АктПриемкиМ7_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	Прейскурант.Ссылка КАК Номенклатура,
					|	ВЫБОР КОГДА АктПриемкиМ7Материалы.Количество = 0 ТОГДА
					|		1
					|	ИНАЧЕ
					|		АктПриемкиМ7Материалы.Количество
					|	КОНЕЦ КАК Количество,
					|	АктПриемкиМ7Материалы.Цена КАК Цена,
					|	АктПриемкиМ7Материалы.Сумма КАК Сумма,
					|	АктПриемкиМ7Материалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
					|ИЗ
					|	Справочник.Прейскурант КАК Прейскурант
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктПриемкиМ7.Материалы КАК АктПриемкиМ7Материалы
					|		ПО (АктПриемкиМ7Материалы.Номенклатура = Прейскурант.Номенклатура)
					|			И (АктПриемкиМ7Материалы.Ссылка.Организация = Прейскурант.Организация)
					|ГДЕ
					|	АктПриемкиМ7Материалы.Ссылка = &Ссылка
					|	И НЕ Прейскурант.СнятаСПродажи";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	Товары = Запрос.Выполнить().Выгрузить(); 
	
	ДанныеXDTO.Вставить("ВидОперации",			"ПокупкаУПоставщика");
	ДанныеXDTO.Вставить("Валюта",				Валюта);
	ДанныеXDTO.Вставить("ВалютаВзаиморасчетов", Валюта);
	ДанныеXDTO.Вставить("Товары",				Товары);
	
	ДанныеИБ.ДополнительныеСвойства.Вставить("ИННОрганизации", ДанныеИБ.Организация.ИНН);
КонецПроцедуры
Процедура ПКО_Документ_ОстаткиТоварыВТорговыхТочках_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ДанныеXDTO.Вставить("ВидОперации",			"ПокупкаУПоставщика");
	ДанныеXDTO.Вставить("Валюта",				Валюта);
	ДанныеXDTO.Вставить("ВалютаВзаиморасчетов", Валюта);
	ДанныеXDTO.Вставить("Товары",				ДанныеИБ.Товары);
	
	ДанныеИБ.ДополнительныеСвойства.Вставить("ИННОрганизации", ДанныеИБ.Организация.ИНН);
КонецПроцедуры
Процедура ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	СписокСтатьиАО = Новый СписокЗначений;
	
	МассивСтрокПродажиТовары = Новый Массив;
	МассивСтрокПродажиРаботыУслуги = Новый Массив;
	МассивСтрокВозвратТовары = Новый Массив;
	
	ПравилаЗаполнения = Новый Соответствие;
	ПравилаЗаполнения.Вставить("Цена", "Цена");
	ПравилаЗаполнения.Вставить("СуммаНДС", "СуммаНДС");
	ПравилаЗаполнения.Вставить("Сумма", "Сумма");
	ПравилаЗаполнения.Вставить("СтавкаНДС", "СтавкаНДСXDTO");
	ПравилаЗаполнения.Вставить("Номенклатура", "Номенклатура");
	ПравилаЗаполнения.Вставить("Количество", "Количество");
	
	//ПродажиТовары
	Если ДанныеXDTO.Свойство("ТоварыПродажа")
		И ЗначениеЗаполнено(ДанныеXDTO.ТоварыПродажа) Тогда
		
		Для Каждого СтрокаТЧ Из ДанныеXDTO.ТоварыПродажа Цикл
			
			СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(СтрокаТЧ, ПравилаЗаполнения);
			Если СтруктураДанныхСтроки.Свойство("СтавкаНДСXDTO") Тогда
				СтруктураДанныхСтроки.Вставить("СтавкаНДС", СтавкаНДСПоЗначениюXDTO(КомпонентыОбмена, СтруктураДанныхСтроки.СтавкаНДСXDTO));
			КонецЕсли;
			
			СтруктураДанныхСтроки.Вставить("Всего", 0);
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("СуммаВключаетНДС", ДанныеXDTO.СуммаВключаетНДС);
			ПараметрыРасчета.Вставить("РассчитыватьЦену", Истина);
			УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтруктураДанныхСтроки, "СУММАНДС", ПараметрыРасчета);
			
			СтруктураДанныхСтроки.Вставить("ЭтоРозничныйПокупатель", Истина);
			
			МассивСтрокПродажиТовары.Добавить(СтруктураДанныхСтроки);
		КонецЦикла;
	КонецЕсли;
	
	Если МассивСтрокПродажиТовары.Количество() > 0 Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("ПродажиТовары", МассивСтрокПродажиТовары);
	КонецЕсли;
	
	//ПродажиРаботыУслуги
	Если ДанныеXDTO.Свойство("Услуги")
		И ЗначениеЗаполнено(ДанныеXDTO.Услуги) Тогда
		
		Для Каждого СтрокаТЧ ИЗ ДанныеXDTO.Услуги Цикл
			
			СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(СтрокаТЧ, ПравилаЗаполнения);
			Если СтруктураДанныхСтроки.Свойство("СтавкаНДСXDTO") Тогда
				СтруктураДанныхСтроки.Вставить("СтавкаНДС", СтавкаНДСПоЗначениюXDTO(КомпонентыОбмена, СтруктураДанныхСтроки.СтавкаНДСXDTO));
			КонецЕсли;
			
			СтруктураДанныхСтроки.Вставить("Всего", 0);
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("СуммаВключаетНДС", ДанныеXDTO.СуммаВключаетНДС);
			ПараметрыРасчета.Вставить("РассчитыватьЦену", Истина);
			УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтруктураДанныхСтроки, "СУММАНДС", ПараметрыРасчета);
			
			СтруктураДанныхСтроки.Вставить("ЭтоРозничныйПокупатель", Истина);
			
			МассивСтрокПродажиРаботыУслуги.Добавить(СтруктураДанныхСтроки);
		КонецЦикла;
	КонецЕсли;
	
	Если МассивСтрокПродажиРаботыУслуги.Количество() > 0 Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("ПродажиРаботыУслуги", МассивСтрокПродажиРаботыУслуги);
	КонецЕсли;
	
	//ВозвратТовары
	Если ДанныеXDTO.Свойство("ТоварыВозвратПродажи")
		И ЗначениеЗаполнено(ДанныеXDTO.ТоварыВозвратПродажи) Тогда
		
		Для Каждого СтрокаТЧ ИЗ ДанныеXDTO.ТоварыВозвратПродажи Цикл
			
			СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(СтрокаТЧ, ПравилаЗаполнения);
			Если СтруктураДанныхСтроки.Свойство("СтавкаНДСXDTO") Тогда
				СтруктураДанныхСтроки.Вставить("СтавкаНДС", СтавкаНДСПоЗначениюXDTO(КомпонентыОбмена, СтруктураДанныхСтроки.СтавкаНДСXDTO));
			КонецЕсли;
			
			СтруктураДанныхСтроки.Вставить("Всего", 0);
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("СуммаВключаетНДС", ДанныеXDTO.СуммаВключаетНДС);
			ПараметрыРасчета.Вставить("РассчитыватьЦену", Истина);
			УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтруктураДанныхСтроки, "СУММАНДС", ПараметрыРасчета);
			
			СтруктураДанныхСтроки.Вставить("ЭтоРозничныйПокупатель", Истина);
			
			МассивСтрокВозвратТовары.Добавить(СтруктураДанныхСтроки);
		КонецЦикла;
	КонецЕсли;
	
	Если МассивСтрокВозвратТовары.Количество() > 0 Тогда
		ПолученныеДанные.ДополнительныеСвойства.Вставить("ВозвратТовары", МассивСтрокВозвратТовары);
	КонецЕсли;
	
	ПолученныеДанные.Комментарий = "Загружен из 1С:Касса\" + ПолученныеДанные.Комментарий;
КонецПроцедуры
Процедура ПКО_Документ_ОтчетОРозничныхПродажах_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	КассыККМ = КомпонентыОбмена.УзелКорреспондента.КассыККМ;
	КассаККМ = Справочники.ФискальныеРегистраторы.ПустаяСсылка();
	ПараметрыДоговораЭквайринга = Справочники.ПараметрыДоговораЭквайринга.ПустаяСсылка();
	ПроцентКомиссии = 0;
	ВидПлатежнойКарты = Справочники.ВидыПлатежныхКарт.ПустаяСсылка();
		
	Если ЗначениеЗаполнено(ПолученныеДанные.Организация) Тогда
		Для Каждого СтрокаКассыККМ Из КассыККМ Цикл
			Если СтрокаКассыККМ.КассаККМ.Организация = ПолученныеДанные.Организация Тогда
				КассаККМ = СтрокаКассыККМ.КассаККМ;
				ПараметрыДоговораЭквайринга = СтрокаКассыККМ.ПараметрыДоговораЭквайринга;
				Прервать;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
	Отбор = Новый Структура("ОсновнойВид", Истина);
	СтрокиТарифы = ПараметрыДоговораЭквайринга.ТарифыЗаРасчетноеОбслуживание.НайтиСтроки(Отбор);
	
	СтатьяАналитикиОплаты = Справочники.СтатьиАналитикиОплатыЧекаККМ.ПустаяСсылка();
	Если ПолученныеДанные.ПродажиТовары.Количество() > 0 Тогда
		СтатьяАналитикиОплаты = ПолученныеДанные.ПродажиТовары[0].Номенклатура.ОсновнаяСтатьяАналитикиОплаты;
	ИначеЕсли ПолученныеДанные.ПродажиРаботыУслуги.Количество() > 0 Тогда
		СтатьяАналитикиОплаты = ПолученныеДанные.ПродажиРаботыУслуги[0].Номенклатура.ОсновнаяСтатьяАналитикиОплаты;
	ИначеЕсли ПолученныеДанные.ВозвратТовары.Количество() > 0 Тогда
		СтатьяАналитикиОплаты = ПолученныеДанные.ВозвратТовары[0].Номенклатура.ОсновнаяСтатьяАналитикиОплаты;
	КонецЕсли;
		
	ПолученныеДанные.ОплатаПлатежнымиКартами.Свернуть("ВидОперации", "Сумма"); 
	
	Для Каждого СтрокаТЧ ИЗ ПолученныеДанные.ОплатаПлатежнымиКартами Цикл
	
		Если СтрокиТарифы.Количество() > 0 Тогда 
			СтрокаТЧ.ВидПлатежнойКарты		= СтрокиТарифы[0].ВидПлатежнойКарты;
			ПроцентКомиссии = СтрокиТарифы[0].ПроцентТорговойУступки; 
		КонецЕсли;
	
		СтрокаТЧ.ВидОперации 					= Перечисления.ВидыОперацийЧекККМ.Продажа;
		СтрокаТЧ.СтатьяАналитикиОплаты          = СтатьяАналитикиОплаты;
		СтрокаТЧ.СистемаНалогообложенияЧекаККМ	= КассаККМ.СистемаНалогообложенияЧекаККМ;
		СтрокаТЧ.ПараметрыДоговораЭквайринга	= ПараметрыДоговораЭквайринга;
		СтрокаТЧ.ВидПлатежнойКарты				= ВидПлатежнойКарты;
		СтрокаТЧ.ПроцентКомиссии				= ПроцентКомиссии;
		СтрокаТЧ.СуммаКомиссии					= СтрокаТЧ.Сумма*ПроцентКомиссии/100;
		СтрокаТЧ.Контрагент						= КассаККМ.КонтрагентДляРозничныхПродаж;
		СтрокаТЧ.Договор						= КассаККМ.ДоговорДляРозничныхПродаж;
		
		Если ПараметрыДоговораЭквайринга.Терминалы.Количество() > 0 Тогда
			СтрокаТЧ.ЭквайринговыйТерминал = ПараметрыДоговораЭквайринга.Терминалы[0].ЭквайринговыйТерминал;
		КонецЕсли;
		
		СтрокаТЧ.ЭтоРозничныйПокупатель			= Истина;
		
	КонецЦикла;
	
	ИтогПродажиТовары			= ПолученныеДанные.ПродажиТовары.Итог("Сумма");
	ИтогПродажиРаботыУслуги		= ПолученныеДанные.ПродажиРаботыУслуги.Итог("Сумма");
	ИтогОплатаПлатежнымиКартами	= ПолученныеДанные.ОплатаПлатежнымиКартами.Итог("Сумма");
	
	СуммаОплатаНаличными = ИтогПродажиТовары + ИтогПродажиРаботыУслуги - ИтогОплатаПлатежнымиКартами; 
	
	Если ДанныеИБ = Неопределено Тогда
		НоваяСтрока = ПолученныеДанные.ОплатаНаличными.Добавить();
	Иначе
		ДанныеИБ.ОплатаНаличными.Очистить();
		НоваяСтрока = ДанныеИБ.ОплатаНаличными.Добавить();
	КонецЕсли;
	НоваяСтрока.ВидОперации 					= Перечисления.ВидыОперацийЧекККМ.Продажа;
	НоваяСтрока.СтатьяАналитикиОплаты 			= СтатьяАналитикиОплаты;
	НоваяСтрока.СистемаНалогообложенияЧекаККМ	= КассаККМ.СистемаНалогообложенияЧекаККМ;
	НоваяСтрока.Сумма                           = СуммаОплатаНаличными;
	НоваяСтрока.Контрагент						= КассаККМ.КонтрагентДляРозничныхПродаж;
	НоваяСтрока.Договор							= КассаККМ.ДоговорДляРозничныхПродаж;
	НоваяСтрока.ЭтоРозничныйПокупатель 			= Истина;
	
	ПолученныеДанные.КассаККМ = КассаККМ;
	ПолученныеДанные.СуммаДокумента = СуммаОплатаНаличными;
	ПолученныеДанные.СуммаПродажНаличнымиРозничнымПокупателям = СуммаОплатаНаличными;
КонецПроцедуры
Процедура ПКО_Документ_ПоступлениеМЗ_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Прейскурант.Ссылка КАК Номенклатура,
	               |	ПоступлениеМЗМатериалы.Количество КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ПоступлениеМЗМатериалы.Количество, 0) = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПоступлениеМЗМатериалы.Всего / ПоступлениеМЗМатериалы.Количество
	               |	КОНЕЦ КАК Цена,
	               |	ПоступлениеМЗМатериалы.Сумма КАК Сумма,
	               |	ПоступлениеМЗМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ИЗ
	               |	Справочник.Прейскурант КАК Прейскурант
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	               |		ПО (ПоступлениеМЗМатериалы.Номенклатура = Прейскурант.Номенклатура)
	               |			И (ПоступлениеМЗМатериалы.Ссылка.Организация = Прейскурант.Организация)
	               |ГДЕ
	               |	ПоступлениеМЗМатериалы.Ссылка = &Ссылка
	               |	И НЕ Прейскурант.СнятаСПродажи";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	Товары = Запрос.Выполнить().Выгрузить(); 
	
	ДанныеXDTO.Вставить("ВидОперации",			"ПокупкаУПоставщика");
	ДанныеXDTO.Вставить("Товары",				Товары);
	
	ДанныеИБ.ДополнительныеСвойства.Вставить("ИННОрганизации", ДанныеИБ.Организация.ИНН);
КонецПроцедуры
Процедура ПКО_Документ_ТребованиеНакладная0315006_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ВидыПеремещенияВНТТ = Новый Массив;
	ВидыПеремещенияВНТТ.Добавить(Перечисления.ВидыПеремещенияМЗ.ВозвратИзНТТ);
	ВидыПеремещенияВНТТ.Добавить(Перечисления.ВидыПеремещенияМЗ.ПеремещениеВНТТ);
	ВидыПеремещенияВНТТ.Добавить(Перечисления.ВидыПеремещенияМЗ.ПеремещениеМеждуНТТ);
	
	Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЖурналПроводокЕПСБУДвиженияССубконто.Организация КАК Организация,
		               |	ВЫБОР
		               |		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.Номенклатура
		               |			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.Номенклатура)
		               |		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.Номенклатура
		               |			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Номенклатура)
		               |		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.Номенклатура
		               |			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Номенклатура)
		               |	КОНЕЦ КАК Номенклатура,
		               |	СУММА(ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт, 1)) КАК Количество,
		               |	СУММА(ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма, 0) / ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт, 1)) КАК Цена,
		               |	СУММА(ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма, 0)) КАК Сумма,
		               |	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКт
		               |ПОМЕСТИТЬ ВТ_Товары
		               |ИЗ
		               |	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(, , Регистратор = &Ссылка, , ) КАК ЖурналПроводокЕПСБУДвиженияССубконто
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЖурналПроводокЕПСБУДвиженияССубконто.Организация,
		               |	ВЫБОР
		               |		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.Номенклатура
		               |			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.Номенклатура)
		               |		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.Номенклатура
		               |			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Номенклатура)
		               |		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.Номенклатура
		               |			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Номенклатура)
		               |	КОНЕЦ,
		               |	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Прейскурант.Ссылка КАК Номенклатура,
		               |	Прейскурант.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		               |	ТребованиеНакладная0315006Материалы.Количество КАК Количество,
		               |	ВЫБОР
		               |		КОГДА ТребованиеНакладная0315006Материалы.Ссылка.ВидПеремещения В (&ВидыПеремещенияВНТТ)
		               |			ТОГДА ТребованиеНакладная0315006Материалы.ЦенаПередачи
		               |		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Товары.Цена КАК ЧИСЛО(15, 2))
		               |	КОНЕЦ КАК Цена,
		               |	ВЫБОР
		               |		КОГДА ТребованиеНакладная0315006Материалы.Ссылка.ВидПеремещения В (&ВидыПеремещенияВНТТ)
		               |			ТОГДА ТребованиеНакладная0315006Материалы.СуммаПередачи
		               |		ИНАЧЕ ВЫРАЗИТЬ(ВТ_Товары.Сумма КАК ЧИСЛО(15, 5))
		               |	КОНЕЦ КАК Сумма
		               |ИЗ
		               |	Документ.ТребованиеНакладная0315006.Материалы КАК ТребованиеНакладная0315006Материалы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Прейскурант КАК Прейскурант
		               |		ПО ТребованиеНакладная0315006Материалы.Ссылка.Организация = Прейскурант.Организация
		               |			И ТребованиеНакладная0315006Материалы.Номенклатура = Прейскурант.Номенклатура
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
		               |		ПО ТребованиеНакладная0315006Материалы.СчетУчета = ВТ_Товары.СчетКт
		               |			И ТребованиеНакладная0315006Материалы.Номенклатура = ВТ_Товары.Номенклатура
		               |ГДЕ
		               |	Прейскурант.СнятаСПродажи = ЛОЖЬ
		               |	И ТребованиеНакладная0315006Материалы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	Запрос.УстановитьПараметр("ВидыПеремещенияВНТТ", ВидыПеремещенияВНТТ);
	
	Товары = Запрос.Выполнить().Выгрузить(); 
	
	ДанныеXDTO.Вставить("ВидОперации",			"ПокупкаУПоставщика");
	ДанныеXDTO.Вставить("Валюта",				Валюта);
	ДанныеXDTO.Вставить("ВалютаВзаиморасчетов", Валюта);
	ДанныеXDTO.Вставить("Сумма",				Товары.Итог("Сумма"));
	ДанныеXDTO.Вставить("Товары",				Товары);
	
	ДанныеИБ.ДополнительныеСвойства.Вставить("ИННОрганизации", ДанныеИБ.Организация.ИНН);
	
	Контрагент = Новый Структура("Наименование, ИНН, КПП, ЮридическоеФизическоеЛицо", ДанныеИБ.ЦМОПолучатель.Наименование, "", "", "ФизическоеЛицо");
	
	ДанныеXDTO.КлючевыеСвойства.Вставить("Контрагент", Контрагент);
КонецПроцедуры
Процедура ПКО_Документ_УстановкаЦенНоменклатуры_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Прейскурант.Ссылка КАК Номенклатура,
	               |	УстановкаЦенНоменклатурыМатериалы.Цена КАК Цена
	               |ИЗ
	               |	Документ.УстановкаЦенНоменклатуры.Материалы КАК УстановкаЦенНоменклатурыМатериалы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Прейскурант КАК Прейскурант
	               |		ПО УстановкаЦенНоменклатурыМатериалы.Номенклатура = Прейскурант.Номенклатура
	               |			И УстановкаЦенНоменклатурыМатериалы.Ссылка.Организация = Прейскурант.Организация
	               |ГДЕ
	               |	УстановкаЦенНоменклатурыМатериалы.Ссылка = &Ссылка
	               |	И НЕ Прейскурант.СнятаСПродажи";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	Товары = Запрос.Выполнить().Выгрузить(); 
	
	ДанныеXDTO.Вставить("Товары", Товары);
КонецПроцедуры
Процедура ПКО_Документ_ЧекККМ_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	МассивСтрокТовары = Новый Массив;
	ОплатаПлатежнойКартой = 0;
	
	ПравилаЗаполнения = Новый Соответствие;
	ПравилаЗаполнения.Вставить("Номенклатура", "Номенклатура");
	ПравилаЗаполнения.Вставить("Количество", "Количество");
	ПравилаЗаполнения.Вставить("Цена", "Цена");
	ПравилаЗаполнения.Вставить("Сумма", "Сумма");
	ПравилаЗаполнения.Вставить("СтавкаНДС", "СтавкаНДСXDTO");
	ПравилаЗаполнения.Вставить("СуммаНДС", "СуммаНДС");
	ПравилаЗаполнения.Вставить("Содержание", "Содержание");
	
	Если ДанныеXDTO.Свойство("Услуги") Тогда
		Для Каждого СтрокаТЧ Из ДанныеXDTO.Услуги Цикл
			СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(СтрокаТЧ, ПравилаЗаполнения);
			Если СтруктураДанныхСтроки.Свойство("СтавкаНДСXDTO") Тогда
				СтруктураДанныхСтроки.Вставить("СтавкаНДС", СтавкаНДСПоЗначениюXDTO(КомпонентыОбмена, СтруктураДанныхСтроки.СтавкаНДСXDTO));
			КонецЕсли;
			МассивСтрокТовары.Добавить(СтруктураДанныхСтроки);
		КонецЦикла;
	КонецЕсли;
	
	Если ДанныеXDTO.Свойство("ТоварыПродажа") Тогда
		Для Каждого СтрокаТЧ Из ДанныеXDTO.ТоварыПродажа Цикл
			СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(СтрокаТЧ, ПравилаЗаполнения);
			Если СтруктураДанныхСтроки.Свойство("СтавкаНДСXDTO") Тогда
				СтруктураДанныхСтроки.Вставить("СтавкаНДС", СтавкаНДСПоЗначениюXDTO(КомпонентыОбмена, СтруктураДанныхСтроки.СтавкаНДСXDTO));
			КонецЕсли;
			МассивСтрокТовары.Добавить(СтруктураДанныхСтроки);	
		КонецЦикла;
	КонецЕсли;
	
	ПолученныеДанные.ФормаОплаты = 0;
	Если ДанныеXDTO.Свойство("ОплатаПлатежнымиКартами") Тогда
		ОплатаПлатежнойКартой = ДанныеXDTO.ОплатаПлатежнымиКартами.Итог("СуммаОплаты");
		ПолученныеДанные.ФормаОплаты = 1; 
	ИначеЕсли ДанныеXDTO.Свойство("ОплатыККМ") Тогда 
		Для Каждого ТекСтрокаОплатыККМ Из ДанныеXDTO.ОплатыККМ Цикл
			Если ТекСтрокаОплатыККМ.ТипОплаты.Значение = "Электронно" Тогда 
				ПолученныеДанные.ФормаОплаты = 1;
				ОплатаПлатежнойКартой = ТекСтрокаОплатыККМ.Сумма;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
			
	ПолученныеДанные.ДополнительныеСвойства.Вставить("ТоварыРаботыУслуги", МассивСтрокТовары);
	ПолученныеДанные.ДополнительныеСвойства.Вставить("ОплатаПлатежнойКартой", ОплатаПлатежнойКартой);
КонецПроцедуры
Процедура ПКО_Документ_ЧекККМ_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	КассыККМ = КомпонентыОбмена.УзелКорреспондента.КассыККМ; 
	ПроцентКомиссии = 0;
	ВидПлатежнойКарты = Справочники.ВидыПлатежныхКарт.ПустаяСсылка();
	
	ИскомаяСтрока = КассыККМ.Найти(ПолученныеДанные.КассаККМ, "КассаККМ"); 
	ПараметрыДоговораЭквайринга = ?(ИскомаяСтрока <> Неопределено,ИскомаяСтрока.ПараметрыДоговораЭквайринга,Справочники.ПараметрыДоговораЭквайринга.ПустаяСсылка()); 
	
	Если ЗначениеЗаполнено(ПолученныеДанные.КассаККМ) Тогда
		ПолученныеДанные.Организация						= ПолученныеДанные.КассаККМ.Организация;
		ПолученныеДанные.Контрагент							= ПолученныеДанные.КассаККМ.КонтрагентДляРозничныхПродаж;
		ПолученныеДанные.ПараметрыДоговораПлатежногоАгента	= ПараметрыДоговораЭквайринга;
		ПолученныеДанные.СистемаНалогообложенияЧекаККМ		= ПолученныеДанные.КассаККМ.СистемаНалогообложенияЧекаККМ;
		ПолученныеДанные.СуммаВключаетНДС					= ПолученныеДанные.КассаККМ.СуммаВключаетНДС;
		ПолученныеДанные.ТипЦены							= ПолученныеДанные.КассаККМ.ТипЦены;
	КонецЕсли;
	
	ПолученныеДанные.Проведен                           = Истина;
	ПолученныеДанные.Комментарий						= "Загружен из " + КомпонентыОбмена.УзелКорреспондента.Наименование + "\";
	ПолученныеДанные.ПризнакСпособаРасчетаЧекаККМ       = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	ПолученныеДанные.СтатусЧекаККМ						= Перечисления.СтатусыЧековККМ.Пробитый;
	ПолученныеДанные.ТипРасчета							= Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
	ПолученныеДанные.ЭтоРозничныйПокупатель				= Истина;
	
	Для Каждого СтрокаТЧ ИЗ ПолученныеДанные.ТоварыРаботыУслуги Цикл
		СтрокаТЧ.КлючСвязи = 1;
		СтрокаТЧ.ЦенаБезСкидок = СтрокаТЧ.Цена;
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("СуммаВключаетНДС", ПолученныеДанные.КассаККМ.СуммаВключаетНДС);
		ПараметрыРасчета.Вставить("РассчитыватьЦену", Ложь);
		УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, "СУММАНДС", ПараметрыРасчета);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПолученныеДанные.ДополнительныеСвойства.ОплатаПлатежнойКартой) ИЛИ ПолученныеДанные.ФормаОплаты = 1 Тогда
		
		Отбор = Новый Структура("ОсновнойВид", Истина);
		СтрокиТарифы = ПараметрыДоговораЭквайринга.ТарифыЗаРасчетноеОбслуживание.НайтиСтроки(Отбор);
		Если СтрокиТарифы.Количество() > 0 Тогда 
			ВидПлатежнойКарты = СтрокиТарифы[0].ВидПлатежнойКарты;
			ПроцентКомиссии = СтрокиТарифы[0].ПроцентТорговойУступки; 
		КонецЕсли;	
	
		Если ПараметрыДоговораЭквайринга.Терминалы.Количество() > 0 Тогда
			ЭквайринговыйТерминал = ПараметрыДоговораЭквайринга.Терминалы[0].ЭквайринговыйТерминал;
		КонецЕсли;
		
		Оплата = ПолученныеДанные.Оплата.Добавить();	
		Оплата.ТипОплаты					= Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта;
		Оплата.ЭквайринговыйТерминал		= ЭквайринговыйТерминал;
		Оплата.Сумма						= ПолученныеДанные.СуммаДокумента;
		Оплата.ПроцентКомиссии				= ПроцентКомиссии;
		Оплата.СуммаКомиссии				= ПолученныеДанные.СуммаДокумента * ПроцентКомиссии / 100;
		Оплата.ДанныеПереданыВБанк			= Истина;
		Оплата.ПараметрыДоговораЭквайринга	= ПараметрыДоговораЭквайринга;
		Оплата.ВидПлатежнойКарты			= ВидПлатежнойКарты;
		Оплата.КлючСвязиОплаты				= 1;
	Иначе
		Оплата = ПолученныеДанные.Оплата.Добавить();	
		Оплата.ТипОплаты					= Перечисления.ТипыОплатЧекаККМ.Наличные;
		Оплата.Сумма						= ПолученныеДанные.СуммаДокумента;
		Оплата.ДанныеПереданыВБанк			= Ложь;
		Оплата.КлючСвязиОплаты				= 1;
	КонецЕсли;
	
	Если ДанныеИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заменяем свойства, которые получили из XDTO
	ЗаполнитьСвойстваШапкиОбъекта(КонвертацияСвойств, ПолученныеДанные, ДанныеИБ);
	
	//ТоварыРаботыУслуги
	ДанныеИБ.ТоварыРаботыУслуги.Загрузить(ПолученныеДанные.ТоварыРаботыУслуги.Выгрузить());
	
	//Оплата
	ДанныеИБ.Оплата.Загрузить(ПолученныеДанные.Оплата.Выгрузить());
КонецПроцедуры
Процедура ПКО_Документ_ЧекККМНаВозврат_Получение_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	МассивСтрокТовары = Новый Массив;
	ОплатаПлатежнойКартой = 0;
	
	ПравилаЗаполнения = Новый Соответствие;
	ПравилаЗаполнения.Вставить("Номенклатура", "Номенклатура");
	ПравилаЗаполнения.Вставить("Количество", "Количество");
	ПравилаЗаполнения.Вставить("Цена", "Цена");
	ПравилаЗаполнения.Вставить("Сумма", "Сумма");
	ПравилаЗаполнения.Вставить("СтавкаНДС", "СтавкаНДСXDTO");
	ПравилаЗаполнения.Вставить("СуммаНДС", "СуммаНДС");
	ПравилаЗаполнения.Вставить("Содержание", "Содержание");
	
	Если ДанныеXDTO.Свойство("ТоварыВозвратПродажи") Тогда
		Для Каждого СтрокаТЧ Из ДанныеXDTO.ТоварыВозвратПродажи Цикл
			СтруктураДанныхСтроки = ДанныеКоллекцииВВидеСтруктуры(СтрокаТЧ, ПравилаЗаполнения);
			
			Если СтруктураДанныхСтроки.Свойство("СтавкаНДСXDTO") Тогда
				СтруктураДанныхСтроки.Вставить("СтавкаНДС", СтавкаНДСПоЗначениюXDTO(КомпонентыОбмена, СтруктураДанныхСтроки.СтавкаНДСXDTO));
			КонецЕсли;
			
			МассивСтрокТовары.Добавить(СтруктураДанныхСтроки);	
		КонецЦикла;
	КонецЕсли;
	
	ПолученныеДанные.ФормаОплаты = 0;
	Если ДанныеXDTO.Свойство("ОплатаПлатежнымиКартами") Тогда
		ОплатаПлатежнойКартой = ДанныеXDTO.ОплатаПлатежнымиКартами.Итог("СуммаОплаты");
		ПолученныеДанные.ФормаОплаты = 1; 
	ИначеЕсли ДанныеXDTO.Свойство("ОплатыККМ") Тогда 
		Для Каждого ТекСтрокаОплатыККМ Из ДанныеXDTO.ОплатыККМ Цикл
			Если ТекСтрокаОплатыККМ.ТипОплаты.Значение = "Электронно" Тогда 
				ПолученныеДанные.ФормаОплаты = 1;
				ОплатаПлатежнойКартой = ТекСтрокаОплатыККМ.Сумма;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
			
	ПолученныеДанные.ДополнительныеСвойства.Вставить("ТоварыРаботыУслуги", МассивСтрокТовары);
	ПолученныеДанные.ДополнительныеСвойства.Вставить("ОплатаПлатежнойКартой", ОплатаПлатежнойКартой);
КонецПроцедуры
Процедура ПКО_Документ_ЧекККМНаВозврат_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	КассыККМ = КомпонентыОбмена.УзелКорреспондента.КассыККМ; 
	ПроцентКомиссии = 0;
	ВидПлатежнойКарты = Справочники.ВидыПлатежныхКарт.ПустаяСсылка();
	
	ИскомаяСтрока = КассыККМ.Найти(ПолученныеДанные.КассаККМ, "КассаККМ"); 
	ПараметрыДоговораЭквайринга = ?(ИскомаяСтрока <> Неопределено,ИскомаяСтрока.ПараметрыДоговораЭквайринга,Справочники.ПараметрыДоговораЭквайринга.ПустаяСсылка()); 
	
	Если ЗначениеЗаполнено(ПолученныеДанные.КассаККМ) Тогда
		ПолученныеДанные.Организация						= ПолученныеДанные.КассаККМ.Организация;
		ПолученныеДанные.Контрагент							= ПолученныеДанные.КассаККМ.КонтрагентДляРозничныхПродаж;
		ПолученныеДанные.ПараметрыДоговораПлатежногоАгента	= ПараметрыДоговораЭквайринга;
		ПолученныеДанные.СистемаНалогообложенияЧекаККМ		= ПолученныеДанные.КассаККМ.СистемаНалогообложенияЧекаККМ;
		ПолученныеДанные.СуммаВключаетНДС					= ПолученныеДанные.КассаККМ.СуммаВключаетНДС;
		ПолученныеДанные.ТипЦены							= ПолученныеДанные.КассаККМ.ТипЦены;
	КонецЕсли;
	
	ПолученныеДанные.Проведен                           = Истина;
	ПолученныеДанные.Комментарий						= "Загружен из " + КомпонентыОбмена.УзелКорреспондента.Наименование + "\";
	ПолученныеДанные.ПризнакСпособаРасчетаЧекаККМ       = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	ПолученныеДанные.СтатусЧекаККМ						= Перечисления.СтатусыЧековККМ.Пробитый;
	ПолученныеДанные.ТипРасчета							= Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств;
	ПолученныеДанные.ЭтоРозничныйПокупатель				= Истина;
	
	Для Каждого СтрокаТЧ ИЗ ПолученныеДанные.ТоварыРаботыУслуги Цикл
		СтрокаТЧ.КлючСвязи = 1;
		СтрокаТЧ.ЦенаБезСкидок = СтрокаТЧ.Цена;
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("СуммаВключаетНДС", ПолученныеДанные.КассаККМ.СуммаВключаетНДС);
		ПараметрыРасчета.Вставить("РассчитыватьЦену", Ложь);
		УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, "СУММАНДС", ПараметрыРасчета);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПолученныеДанные.ДополнительныеСвойства.ОплатаПлатежнойКартой) Тогда
		Отбор = Новый Структура("ОсновнойВид", Истина);
		СтрокиТарифы = ПараметрыДоговораЭквайринга.ТарифыЗаРасчетноеОбслуживание.НайтиСтроки(Отбор);
		Если СтрокиТарифы.Количество() > 0 Тогда 
			ВидПлатежнойКарты = СтрокиТарифы[0].ВидПлатежнойКарты;
			ПроцентКомиссии = СтрокиТарифы[0].ПроцентТорговойУступки; 
		КонецЕсли;	
	
		Если ПараметрыДоговораЭквайринга.Терминалы.Количество() > 0 Тогда
			ЭквайринговыйТерминал = ПараметрыДоговораЭквайринга.Терминалы[0].ЭквайринговыйТерминал;
		КонецЕсли;
		
		Оплата = ПолученныеДанные.Оплата.Добавить();	
		Оплата.ТипОплаты					= Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта;
		Оплата.ЭквайринговыйТерминал		= ЭквайринговыйТерминал;
		Оплата.Сумма						= ПолученныеДанные.СуммаДокумента;
		Оплата.ПроцентКомиссии				= ПроцентКомиссии;
		Оплата.СуммаКомиссии				= -(ПолученныеДанные.СуммаДокумента * ПроцентКомиссии / 100);
		Оплата.ДанныеПереданыВБанк			= Истина;
		Оплата.ПараметрыДоговораЭквайринга	= ПараметрыДоговораЭквайринга;
		Оплата.ВидПлатежнойКарты			= ВидПлатежнойКарты;
		Оплата.КлючСвязиОплаты				= 1;
	Иначе
		Оплата = ПолученныеДанные.Оплата.Добавить();	
		Оплата.ТипОплаты					= Перечисления.ТипыОплатЧекаККМ.Наличные;
		Оплата.Сумма						= ПолученныеДанные.СуммаДокумента;
		Оплата.ДанныеПереданыВБанк			= Ложь;
		Оплата.КлючСвязиОплаты				= 1;
	КонецЕсли;
	
	
	Если ДанныеИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заменяем свойства, которые получили из XDTO
	ЗаполнитьСвойстваШапкиОбъекта(КонвертацияСвойств, ПолученныеДанные, ДанныеИБ);
	
	//ТоварыРаботыУслуги
	ДанныеИБ.ТоварыРаботыУслуги.Загрузить(ПолученныеДанные.ТоварыРаботыУслуги.Выгрузить());
	
	//Оплата
	ДанныеИБ.Оплата.Загрузить(ПолученныеДанные.Оплата.Выгрузить());
КонецПроцедуры
Процедура ПКО_Справочник_Валюты_ПриКонвертацииДанныхXDTO(ДанныеXDTO, ПолученныеДанные, КомпонентыОбмена)
	ПолученныеДанные.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;
КонецПроцедуры
Процедура ПКО_Справочник_Валюты_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если ДанныеИБ <> Неопределено
		И ЗначениеЗаполнено(ДанныеИБ.СпособУстановкиКурса) Тогда
		ПолученныеДанные.СпособУстановкиКурса = ДанныеИБ.СпособУстановкиКурса;
	КонецЕсли;
КонецПроцедуры
Процедура ПКО_Справочник_ЕдиницыИзмерения_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если НЕ ЗначениеЗаполнено(ДанныеИБ.Код) Тогда
	
		Код = ДанныеИБ.МеждународноеСокращение;
		Если Не ЗначениеЗаполнено(Код) Тогда
			Код = ДанныеИБ.Наименование;
		КонецЕсли;
		
		Код = Лев(Код, 4);
		
		Если СтекВыгрузки.Количество() = 1 Тогда
			ДанныеXDTO.КлючевыеСвойства.Вставить("Код", Код);
		Иначе
			ДанныеXDTO.Вставить("Код", Код);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Процедура ПКО_Справочник_ЕдиницыИзмерения_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	ДанныеДляЗаписиВИБ = ?(ДанныеИБ = Неопределено, ПолученныеДанные, ДанныеИБ);
КонецПроцедуры
Процедура ПКО_Справочник_Организации_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	ДанныеXDTO.Вставить("ЮридическоеФизическоеЛицо", "ЮридическоеЛицо");
КонецПроцедуры
Процедура ПКО_Справочник_ПрейскурантНоменклатура_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	ОтправлятьГруппыПрейскурант = КомпонентыОбмена.ПараметрыКонвертации.ОтправлятьГруппыПрейскурант;
	
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеИБ.ЭтоГруппа Тогда
		Если ЗначениеЗаполнено(ДанныеИБ.Номенклатура.НаименованиеДляЧекаККМ) Тогда
			ДанныеXDTO.КлючевыеСвойства.Наименование = ДанныеИБ.Номенклатура.НаименованиеДляЧекаККМ;
		КонецЕсли;
		Если РозничныеПродажиБГУ.ТипНоменклатуры(ДанныеИБ.Номенклатура) = 3 Тогда
			ДанныеXDTO.Вставить("ТипНоменклатуры",	"Товар");
		Иначе
			ДанныеXDTO.Вставить("ТипНоменклатуры",	"Услуга");
		КонецЕсли;
		ДанныеXDTO.Вставить("ЕдиницаИзмерения",			ДанныеИБ.Номенклатура.ЕдиницаИзмерения);
	    
	    СтавкаНДСНоменклатуры = ДанныеИБ.Номенклатура.СтавкаНДС;
		ДанныеXDTO.Вставить("СтавкаНДС", СтавкаНДСВXDTO(СтавкаНДСНоменклатуры, КомпонентыОбмена));
	
		Если ОтправлятьГруппыПрейскурант Тогда 
			ДанныеXDTO.КлючевыеСвойства.Вставить("Группа", ДанныеИБ.Родитель);
		КонецЕсли; 
	Иначе	
		ДанныеXDTO.Вставить("ТипНоменклатуры", "");
		ДанныеXDTO.Вставить("НаименованиеПолное", "");
	КонецЕсли;
КонецПроцедуры
Процедура ПКО_Справочник_ШтрихкодыНоменклатуры_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Штрихкоды = Новый ТаблицаЗначений;
	Штрихкоды.Колонки.Добавить("Номенклатура");
	Штрихкоды.Колонки.Добавить("Штрихкод");
	
	СтрокаШК = Штрихкоды.Добавить();
	СтрокаШК.Штрихкод		= ДанныеXDTO.Штрихкод;
	СтрокаШК.Номенклатура	= ДанныеXDTO.НоменклатураОтбор;
			
	ДанныеXDTO.Вставить("Записи", Штрихкоды);
КонецПроцедуры
Процедура ПКО_Справочник_ИнформативныеОстатки_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	ДанныеXDTO.КлючевыеСвойства.Склад = ДанныеИБ.Склад;
	
	ДанныеXDTO.Вставить("Организация",			ДанныеИБ.Организация);
	ДанныеXDTO.Вставить("Дата",					ДанныеИБ.Дата);
	ДанныеXDTO.Вставить("Товары",				ДанныеИБ.Товары);
	ДанныеXDTO.Вставить("Комментарий",			ДанныеИБ.Комментарий);
КонецПроцедуры
Процедура ПКО_Справочник_СтавкиНДС_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	ДанныеXDTO.КлючевыеСвойства.Вставить("ВидСтавки", ВидыСтавокНДСXDTO(ДанныеИБ));
	ДанныеXDTO.КлючевыеСвойства.Вставить("Страна",  Справочники.СтраныМира.Россия);
	ДанныеXDTO.КлючевыеСвойства.Вставить("НеОблагается",  ДанныеИБ = Перечисления.СтавкиНДС.БезНДС);
	ДанныеXDTO.КлючевыеСвойства.Вставить("РасчетнаяСтавка",  ЭтоРасчетнаяСтавкаНДС(ДанныеИБ));
	ДанныеXDTO.КлючевыеСвойства.Вставить("Ставка",  УчетНДСКлиентСервер.ЗначениеСтавкиНДС(ДанныеИБ));
КонецПроцедуры
Процедура ПКО_Справочник_СтраныМира_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если ДанныеИБ = Неопределено
		И ЗначениеЗаполнено(ПолученныеДанные.Код) Тогда
		
		ДанныеСтраны = УправлениеКонтактнойИнформацией.ДанныеКлассификатораСтранМираПоКоду(ПолученныеДанные.Код);
		Если ДанныеСтраны <> Неопределено Тогда
			ПолученныеДанные.УчастникЕАЭС = ДанныеСтраны.УчастникЕАЭС;
			ЗаполнитьРеквизитыИзДанныхИБ(ПолученныеДанные, ДанныеСтраны, "Наименование,НаименованиеПолное,КодАльфа2,КодАльфа3,МеждународноеНаименование");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заменяем свойства, которые получили из XDTO.
	ЗаполнитьНеПустыеСвойстваШапкиОбъекта(КонвертацияСвойств, ПолученныеДанные, ДанныеИБ);
	
	ПолученныеДанные = Неопределено;
КонецПроцедуры

#КонецОбласти
#Область Алгоритмы

Функция ВерсияФорматаЧислом(СтрокаВерсии)
	Если Не ЗначениеЗаполнено(СтрокаВерсии) Или СтрокаВерсии = "1.0.beta" Тогда
		Возврат 0;
	КонецЕсли;
	
	ВерсияФорматаЧислом = 0;
	
	РазрядыВерсии = СтрРазделить(СтрокаВерсии, ".");
	Если РазрядыВерсии.Количество() <> 2 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Неправильный формат параметра СтрокаВерсии1: %1'"), СтрокаВерсии);
	КонецЕсли;
	
	МножительРазряда = 10000;
	Для ИндексРазрядаОбратный = 0 По 1 Цикл
		ВерсияФорматаЧислом = ВерсияФорматаЧислом + Число(РазрядыВерсии[ИндексРазрядаОбратный])*МножительРазряда;
		МножительРазряда = МножительРазряда / 100;
	КонецЦикла;
	Возврат ВерсияФорматаЧислом;
КонецФункции
Функция ВидСтавкиНДСXDTO(СтавкаНДС)
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Возврат Перечисления.ВидыСтавокНДС.БезНДС;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат Перечисления.ВидыСтавокНДС.БезНДС;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС22_122 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ОбщаяУСН;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ПониженнаяУСН;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС7_107 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ОбщаяУСН;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5_105 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ПониженнаяУСН;
	Иначе
		Возврат Перечисления.ВидыСтавокНДС.ПустаяСсылка();
	КонецЕсли;
КонецФункции
Функция ВидыСтавокНДСXDTO(СтавкаНДС)
	ВидСтавкиНДС = ВидСтавкиНДСXDTO(СтавкаНДС);
	
	Если ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.Общая
		Или ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ОбщаяУСН
		Или ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.ПониженнаяУСН Тогда
		Возврат "Общая";
	ИначеЕсли  ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.БезНДС Тогда
		Возврат "БезНДС";
	КонецЕсли;
	
	Возврат "Общая";
КонецФункции
Процедура ВыгрузитьИнформативныеОстатки(КомпонентыОбмена) Экспорт
	ПравилоОбработки = КомпонентыОбмена.ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя = "Справочник_ИнформативныеОстатки_Отправка";
	ПравилоОбработки.ОчисткаДанных = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ИнформативныеОстатки_Отправка");
	
	ТЗ_Товары = Новый ТаблицаЗначений;
	ТЗ_Товары.Колонки.Добавить("Номенклатура");
	ТЗ_Товары.Колонки.Добавить("КоличествоНаСкладе");
	
	МассивЦМО = КомпонентыОбмена.ПараметрыКонвертации.МассивЦМО;
	
	МассивВыборки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаВводаОстатков",	Новый Граница(ТекущаяДатаСеанса(), ВидГраницы.Включая));
	Запрос.Текст = "ВЫБРАТЬ
	               |	Прейскурант.Ссылка КАК Номенклатура,
	               |	СУММА(ТоварыВТорговыхТочкахОстатки.КоличествоОстаток) КАК КоличествоНаСкладе,
	               |	ТоварыВТорговыхТочкахОстатки.Организация КАК Организация,
	               |	ТоварыВТорговыхТочкахОстатки.ЦМО.МестоХранения КАК МестоХранения
	               |ИЗ
	               |	РегистрНакопления.ТоварыВТорговыхТочках.Остатки(%ПараметрыВТ%) КАК ТоварыВТорговыхТочкахОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Прейскурант КАК Прейскурант
	               |		ПО ТоварыВТорговыхТочкахОстатки.Номенклатура = Прейскурант.Номенклатура
	               |			И ТоварыВТорговыхТочкахОстатки.Организация = Прейскурант.Организация
	               |ГДЕ
	               |	НЕ Прейскурант.СнятаСПродажи
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыВТорговыхТочкахОстатки.Организация,
	               |	ТоварыВТорговыхТочкахОстатки.ЦМО.МестоХранения,
	               |	Прейскурант.Ссылка
	               |ИТОГИ ПО
	               |	Организация,
	               |	МестоХранения";
	
	Если ЗначениеЗаполнено(МассивЦМО) Тогда
		Запрос.УстановитьПараметр("МассивЦМО", МассивЦМО);
		ПараметрыВТ = "&ДатаВводаОстатков, ЦМО В (&МассивЦМО)";
	Иначе
		ПараметрыВТ = "&ДатаВводаОстатков";
	КонецЕсли;
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ПараметрыВТ%", ПараметрыВТ);
		
	ВыборкаПоОрг = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Пока ВыборкаПоОрг.Следующий() Цикл
		
		ВыборкаПоМестХранения = ВыборкаПоОрг.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоМестХранения.Следующий() Цикл
			
			Склад = ВыборкаПоМестХранения.МестоХранения;
			
			Если Не ЗначениеЗаполнено(Склад) Тогда
				Продолжить;
			КонецЕсли;
				
			ВыборкаДетальная = ВыборкаПоМестХранения.Выбрать();
			
			Пока ВыборкаДетальная.Следующий() Цикл
				
				НоваяСтрока = ТЗ_Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальная);
				
			КонецЦикла;
			
			ДанныеИБ = Новый Структура();
			ДанныеИБ.Вставить("Дата",			ТекущаяДатаСеанса());
			ДанныеИБ.Вставить("Организация",	ВыборкаПоМестХранения.Организация);
			ДанныеИБ.Вставить("Склад",			Склад);
			ДанныеИБ.Вставить("Товары",			ТЗ_Товары);
			
			Если ТЗ_Товары.Количество() Тогда
				ДанныеИБ.Вставить("Комментарий",	Неопределено);
			Иначе
				ДанныеИБ.Вставить("Комментарий",	"ОчиститьТабличнуюЧастьТовары");
			КонецЕсли;
			
			ОбменДаннымиXDTOСервер.ВыгрузкаОбъектаВыборки(КомпонентыОбмена, ДанныеИБ, ПравилоОбработки);
	
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
Процедура ВыгрузитьОстатки(КомпонентыОбмена) Экспорт
	ДатаВводаОстатков	= НачалоДня(КомпонентыОбмена.ПараметрыКонвертации.ДатаНачалаВыгрузкиДокументов)-1;
	МассивЦМО			= КомпонентыОбмена.ПараметрыКонвертации.МассивЦМО;
	ТипЦены				= КомпонентыОбмена.ПараметрыКонвертации.ТипЦены;
	
	МассивВыборки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаВводаОстатков",	Новый Граница(ДатаВводаОстатков, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ТипЦены",			ТипЦены);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Прейскурант.Ссылка КАК Номенклатура,
	               |	ТоварыВТорговыхТочкахОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ТоварыВТорговыхТочкахОстатки.КоличествоОстаток КАК Количество,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	               |	ТоварыВТорговыхТочкахОстатки.КоличествоОстаток * ЦеныНоменклатурыСрезПоследних.Цена КАК Сумма,
	               |	ТоварыВТорговыхТочкахОстатки.Организация КАК Организация
	               |ИЗ
	               |	РегистрНакопления.ТоварыВТорговыхТочках.Остатки(%ПараметрыВТ%) КАК ТоварыВТорговыхТочкахОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Прейскурант КАК Прейскурант
	               |		ПО ТоварыВТорговыхТочкахОстатки.Номенклатура = Прейскурант.Номенклатура
	               |			И ТоварыВТорговыхТочкахОстатки.Организация = Прейскурант.Организация
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаВводаОстатков, ТипЦен = &ТипЦены) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТоварыВТорговыхТочкахОстатки.Организация = ЦеныНоменклатурыСрезПоследних.Организация
	               |			И ТоварыВТорговыхТочкахОстатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |ГДЕ
	               |	НЕ Прейскурант.СнятаСПродажи";
	
	Если ЗначениеЗаполнено(МассивЦМО) Тогда
		Запрос.УстановитьПараметр("МассивЦМО", МассивЦМО);
		ПараметрыВТ = "&ДатаВводаОстатков, ЦМО В (&МассивЦМО)";
	Иначе
		ПараметрыВТ = "&ДатаВводаОстатков";
	КонецЕсли;
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ПараметрыВТ%", ПараметрыВТ);
		
	ТЗ_Товары = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ_Товары.Количество() > 0 Тогда
		
		Организация = ТЗ_Товары[0].Организация;	
		Контрагент = Новый Структура("Наименование, ИНН, КПП, ЮридическоеФизическоеЛицо", Организация.Наименование, Организация.ИНН, Организация.КПП, "ЮридическоеЛицо");
		
		ДанныеИБ = Новый Структура("Дата, Номер, Организация, Контрагент, Сумма, Товары");
		ДанныеИБ.Дата			= ДатаВводаОстатков;
		ДанныеИБ.Номер			= Формат(1, "ЧГ=");
		ДанныеИБ.Организация	= Организация;
		ДанныеИБ.Контрагент		= Контрагент;
		ДанныеИБ.Сумма			= ТЗ_Товары.Итог("Сумма");
		ДанныеИБ.Товары			= ТЗ_Товары;
		
		
		ДанныеИБ.Вставить("ДополнительныеСвойства", Новый Структура);
		
		ПравилоОбработки = КомпонентыОбмена.ПравилаОбработкиДанных.Добавить();
		ПравилоОбработки.Имя = "Документ_ОстаткиТоварыВТорговыхТочках_Отправка";
		ПравилоОбработки.ОчисткаДанных = Ложь;
		ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ОстаткиТоварыВТорговыхТочках_Отправка");
			
		ОбменДаннымиXDTOСервер.ВыгрузкаОбъектаВыборки(КомпонентыОбмена, ДанныеИБ, ПравилоОбработки);
	КонецЕсли;
КонецПроцедуры
Функция ДанныеКоллекцииВВидеСтруктуры(Источник, ПравилаЗаполнения)
	Результат = Новый Структура;
	
	Для Каждого ПравилоЗаполнения Из ПравилаЗаполнения Цикл
	
		СтруктураДляПереносаЗначения = Новый Структура(ПравилоЗаполнения.Ключ, Неопределено);
		ЗаполнитьЗначенияСвойств(СтруктураДляПереносаЗначения, Источник);
		
		Значение = СтруктураДляПереносаЗначения[ПравилоЗаполнения.Ключ];
		Если Значение <> Неопределено Тогда
			Результат.Вставить(ПравилоЗаполнения.Значение, Значение);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Результат
КонецФункции
Процедура ЗаполнитьЗначенияСтавокНДС(КомпонентыОбмена)
	ЗначенияСтавокНДС = Новый ТаблицаЗначений;
	ЗначенияСтавокНДС.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ЗначенияСтавокНДС.Колонки.Добавить("Ставка", Новый ОписаниеТипов("Число"));
	ЗначенияСтавокНДС.Колонки.Добавить("РасчетнаяСтавка", Новый ОписаниеТипов("Булево"));
	
	Для Каждого МетаданныеПеречисления Из Метаданные.Перечисления.СтавкиНДС.ЗначенияПеречисления Цикл
		                      
		СтрокаСтавки = ЗначенияСтавокНДС.Добавить();
		СтрокаСтавки.СтавкаНДС = Перечисления.СтавкиНДС[МетаданныеПеречисления.Имя];
		СтрокаСтавки.Ставка = УчетНДСКлиентСервер.ЗначениеСтавкиНДС(СтрокаСтавки.СтавкаНДС);
		СтрокаСтавки.РасчетнаяСтавка = ЭтоРасчетнаяСтавкаНДС(СтрокаСтавки.СтавкаНДС);
	
	КонецЦикла;
	
	КомпонентыОбмена.ПараметрыКонвертации.ЗначенияСтавокНДС = ЗначенияСтавокНДС;
КонецПроцедуры
Процедура ЗаполнитьНеПустыеСвойстваШапкиОбъекта(КонвертацияСвойств, ПолученныеДанные, ДанныеИБ, МассивИсключений = Неопределено)
	Для Каждого СвойствоОбъекта Из КонвертацияСвойств Цикл
		СвойствоИБ = СвойствоОбъекта.СвойствоКонфигурации;
		Если СокрЛП(СвойствоИБ) = "" Тогда
			Продолжить;
		КонецЕсли;
		Если МассивИсключений <> Неопределено И МассивИсключений.Найти(СвойствоИБ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПолученныеДанные[СвойствоИБ]) Тогда
			ДанныеИБ[СвойствоИБ] = ПолученныеДанные[СвойствоИБ];
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
Процедура ЗаполнитьРеквизитыИзДанныхИБ(ПолученныеДанные, ДанныеИБ, СтрокаРеквизиты)
	Реквизиты = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаРеквизиты, ",", Истина, Истина);
	Для Каждого Реквизит Из Реквизиты Цикл
		ЗначенияПриемник = Новый Структура(Реквизит);
		ЗаполнитьЗначенияСвойств(ЗначенияПриемник, ПолученныеДанные);
		
		ЗначенияИсточник = Новый Структура(Реквизит);
		ЗаполнитьЗначенияСвойств(ЗначенияИсточник, ДанныеИБ);
		
		Если Не ЗначениеЗаполнено(ЗначенияПриемник[Реквизит])
			И ЗначениеЗаполнено(ЗначенияИсточник[Реквизит]) Тогда
			ЗаполнитьЗначенияСвойств(ПолученныеДанные, ЗначенияИсточник);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
Процедура ЗаполнитьСвойстваШапкиОбъекта(КонвертацияСвойств, ПолученныеДанные, ДанныеИБ, МассивИсключений = Неопределено)
	Для Каждого СвойствоОбъекта Из КонвертацияСвойств Цикл
		СвойствоИБ = СвойствоОбъекта.СвойствоКонфигурации;
		Если СокрЛП(СвойствоИБ) = "" Тогда
			Продолжить;
		КонецЕсли;
		Если МассивИсключений <> Неопределено И МассивИсключений.Найти(СвойствоИБ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДанныеИБ[СвойствоИБ] = ПолученныеДанные[СвойствоИБ];
	КонецЦикла;
КонецПроцедуры
Процедура ЗаполнитьТабличнуюЧастьОбъектаНачальнымиДанными(ТабличнаяЧастьОбъектаПослеОбработки, ТабличнаяЧастьОбъектаДоОбработки, КлючевыеПоля = "", КолонкиДляВключения = "", КолонкиДляИсключения = "")
	ОбменДаннымиXDTOСервер.ЗаполнитьТабличнуюЧастьОбъектаНачальнымиДанными(
		ТабличнаяЧастьОбъектаПослеОбработки, 
		ТабличнаяЧастьОбъектаДоОбработки,
		КлючевыеПоля, 
		КолонкиДляВключения, 
		КолонкиДляИсключения);
КонецПроцедуры
Функция ЗначениеИзСвойствXDTO(ДанныеXDTO, ИмяСвойства, ЗначениеПоУмолчанию)
	Если Не ДанныеXDTO.Свойство(ИмяСвойства)
		Или Не ЗначениеЗаполнено(ДанныеXDTO[ИмяСвойства]) Тогда
		Возврат ЗначениеПоУмолчанию; 
	КонецЕсли;
	
	Возврат ДанныеXDTO[ИмяСвойства];
КонецФункции
Функция ЗначениеСтавкиНДСПоXDTO(КомпонентыОбмена, СтавкаНДСXDTO)
	Если Не ЗначениеЗаполнено(СтавкаНДСXDTO) Тогда
		Возврат Перечисления.СтавкиНДС.ПустаяСсылка();
	КонецЕсли; 
	
	Ставка = ЗначениеИзСвойствXDTO(СтавкаНДСXDTO, "Ставка", 0);
	РасчетнаяСтавка = ЗначениеИзСвойствXDTO(СтавкаНДСXDTO, "РасчетнаяСтавка", Ложь);
	НеОблагается = ЗначениеИзСвойствXDTO(СтавкаНДСXDTO, "НеОблагается", Ложь);
	
	Если Не ЗначениеЗаполнено(Ставка) Тогда
		Возврат ?(НеОблагается, Перечисления.СтавкиНДС.БезНДС, Перечисления.СтавкиНДС.НДС0);
	КонецЕсли;  
	
	ЗначенияСтавокНДС = КомпонентыОбмена.ПараметрыКонвертации.ЗначенияСтавокНДС;
	
	ОтборСтавок = Новый Структура();
	ОтборСтавок.Вставить("Ставка", Ставка);
	ОтборСтавок.Вставить("РасчетнаяСтавка", РасчетнаяСтавка);
	
	ПодходящиеСтавки = ЗначенияСтавокНДС.НайтиСтроки(ОтборСтавок);
	
	Если Не ЗначениеЗаполнено(ПодходящиеСтавки) Тогда
		Возврат Перечисления.СтавкиНДС.ПустаяСсылка();
	Иначе
		Возврат ПодходящиеСтавки[0].СтавкаНДС;
	КонецЕсли;
КонецФункции
Процедура ОтложеннаяОбработка_ЧекККМ(Объект, ПараметрыКонвертации, ОбъектМодифицирован)
	ВсегоОплачено = Объект.Оплата[0].Сумма;
	ВсегоКомиссияБанка = Объект.Оплата[0].СуммаКомиссии;
	ПроцентБанка = Объект.Оплата[0].ПроцентКомиссии; 
	Для каждого ТекТоварУслуга Из Объект.ТоварыРаботыУслуги Цикл
		Если ВсегоОплачено = 0 Тогда 
			Прервать;
		КонецЕсли;
		
		НоваяСтрока = Объект.РасшифровкаОплаты.Добавить();
		НоваяСтрока.КлючСвязиОплаты = 1;
		НоваяСтрока.СтатьяАналитикиОплаты = ТекТоварУслуга.Номенклатура.ОсновнаяСтатьяАналитикиОплаты;
		
		ПолноеПогашение = Истина;
		Если ВсегоОплачено < ТекТоварУслуга.Всего Тогда
			ПолноеПогашение = Ложь;
		КонецЕсли;	
		
		НоваяСтрока.Сумма = ?(ПолноеПогашение, ТекТоварУслуга.Всего, ВсегоОплачено);
		Если ВсегоКомиссияБанка > 0 Тогда
			НоваяСтрока.СуммаКомиссии = Окр(НоваяСтрока.Сумма * ПроцентБанка / 100, 2);	
			
			Если НЕ ПолноеПогашение Тогда
				НоваяСтрока.СуммаКомиссии = ВсегоКомиссияБанка;
			КонецЕсли;	
			
			ВсегоКомиссияБанка = ВсегоКомиссияБанка - НоваяСтрока.СуммаКомиссии;
		Конецесли;	
		
		ВсегоОплачено = ВсегоОплачено - НоваяСтрока.Сумма;
	КонецЦикла;
КонецПроцедуры
Функция СтавкаНДСВXDTO(СтавкаНДС, КомпонентыОбмена)
	Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПКО = Новый Структура;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда
		ИмяПКО = "Перечисление_СтавкиНДС";
	Иначе
		ИмяПКО = "Справочник_СтавкиНДС_Отправка";
	КонецЕсли;
	    
	СтруктураПКО.Вставить("ИмяПКО", ИмяПКО);
	СтруктураПКО.Вставить("Значение", СтавкаНДС);
	
	Возврат СтруктураПКО;
КонецФункции
Функция СтавкаНДСПоЗначениюXDTO(КомпонентыОбмена, СтавкаНДСXDTO)
	Если Не ЗначениеЗаполнено(СтавкаНДСXDTO) Тогда
		Возврат Перечисления.СтавкиНДС.ПустаяСсылка();
	КонецЕсли;   
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда
		
		ПКПД_СтавкиНДС = КомпонентыОбмена.ПравилаКонвертацииПредопределенныхДанных.Найти("Перечисление_СтавкиНДС", "ИмяПКПД");
		Возврат ПКПД_СтавкиНДС.КонвертацииЗначенийПриПолучении.Получить(СтавкаНДСXDTO.Значение);
	
	Иначе
	
		Возврат ЗначениеСтавкиНДСПоXDTO(КомпонентыОбмена, СтавкаНДСXDTO);
			
	КонецЕсли;
КонецФункции
Функция ЭтоРасчетнаяСтавкаНДС(СтавкаНДС)
	Если ТипЗнч(СтавкаНДС) <> Тип("ПеречислениеСсылка.СтавкиНДС")
		Или Не ЗначениеЗаполнено(СтавкаНДС) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118
		Или СтавкаНДС = Перечисления.СтавкиНДС.НДС5_105
		Или СтавкаНДС = Перечисления.СтавкиНДС.НДС7_107
		Или СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110
		Или СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120
		Или СтавкаНДС = Перечисления.СтавкиНДС.НДС22_122;
КонецФункции

#КонецОбласти
#КонецОбласти
