#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПроверитьДублиСотрудников(СправочникОбъект, Отказ) Экспорт
	
	КолонкиДублей = "Сотрудник";
	
	ТаблицаДублиСтрок = ОбщегоНазначенияБГУ.НайтиДублиСтрок(СправочникОбъект.СписокЛиц, КолонкиДублей);
	
	Если ТаблицаДублиСтрок.Количество() > 0 Тогда
		Отказ = Истина;
		
		ПараметрыВывода = Новый Структура();
		ПараметрыВывода.Вставить("ТаблицаИмя",				"СписокЛиц");
		ПараметрыВывода.Вставить("ТаблицаПредставление",	НСтр("ru='Список лиц'"));
		ПараметрыВывода.Вставить("ОбъектСсылка",			СправочникОбъект["Ссылка"]);
		
		ОбщегоНазначенияБГУ.ВывестиСообщенияОДубляхСтрок(ТаблицаДублиСтрок, ПараметрыВывода);
	КонецЕсли;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли