
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.УстановитьДоступностьРедактированияСтрокВДокументахНФА(ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Объект.Руководитель) Тогда
			УстановитьРуководителя(Объект);
		КонецЕсли;
		
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства   
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриЧтенииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ); 
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1Сдокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	ПодготовитьФормуНаСервере();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Тогда
		ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата);
КонецПроцедуры

// Файлы сотрудников
&НаКлиенте
Процедура НадписьФайлНеВыбранНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФайлСотрудника) Тогда
		ОповещениеФайла = Новый ОписаниеОповещения("ОбработатьВыборФайлаСотрудника", ЭтотОбъект);
		РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(Объект.Ссылка, Элементы.ФайлСотрудника, ,ОповещениеФайла);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьУдалитьФайлНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Или Не ЗначениеЗаполнено(ФайлСотрудника) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрепитьФайлСотрудникаНаСервере();
	
КонецПроцедуры
// Конец Файлы сотрудников

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	КомиссияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Если РешениеСотрудникаМодифицированность
		И ЗначениеЗаполнено(ВыбранныйСотрудник)
		И ВыбранныйСотрудник <> Сотрудник Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Сотрудник", ВыбранныйСотрудник);
		ДопПараметры.Вставить("РезультатыГолосования", Новый Массив);
		Для Каждого СтрокаОС Из Объект.Материалы Цикл
			Если ЗначениеЗаполнено(СтрокаОС.РешениеСотрудникаПоРезолюции) Тогда
				РезультатГолосования = Новый Структура("ИдентификаторСтроки,РешениеСотрудникаПоРезолюции",
					СтрокаОС.ИдентификаторСтроки, СтрокаОС.РешениеСотрудникаПоРезолюции);
				ДопПараметры.РезультатыГолосования.Добавить(РезультатГолосования);
			КонецЕсли;
		КонецЦикла;
		
		Оповещение = Новый ОписаниеОповещения("ВопросСохранитьРезультатыГолосованияЗавершение", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Сохранить результаты голосования члена комиссии ""%1""?'"), ВыбранныйСотрудник);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	СотрудникПриИзмененииНаСервере();
	
	ВыбранныйСотрудник = Сотрудник;
	
	РешениеСотрудникаМодифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтборПрисутствующих = Новый Структура("Отсутствует", Ложь);
	ПрисутствующиеЧленыКомиссии = Объект.СоставКомиссии.НайтиСтроки(ОтборПрисутствующих);
	
	// Выбирается из присутствующих членов комиссии.
	Элемент.СписокВыбора.Очистить();
	Для Каждого ЧленКомиссии Из ПрисутствующиеЧленыКомиссии Цикл
		Элемент.СписокВыбора.Добавить(ЧленКомиссии.Сотрудник);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	УстановитьРуководителя(Объект);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОрганизацияПриИзменении(Элемент)
	
	МассивИменТЧ = Новый Массив;
	
	Для Каждого Имя Из СписокИменТабличныхЧастей Цикл
		Если Объект[Имя.Значение].Количество() Тогда
			МассивИменТЧ.Добавить(Имя.Значение);
		КонецЕсли;
	КонецЦикла;
		
	Если МассивИменТЧ.Количество() И Ждать СогласиеПользователяНаОчисткуТЧ() Тогда
		ОрганизацияПриИзмененииНаСервере(МассивИменТЧ);
	Иначе
		ОрганизацияПриИзмененииНаСервере(Новый Массив);
	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	ЗаполнитьЗабалансовыйСчет(ЭтотОбъект);
	ЗабалансовыйСчетПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗабалансовыйСчетПриИзменении(Элемент)
	
	ПрочитатьСвойстваЗабалансовогоСчета();
	УстановитьВидимостьЭлементовФормы_ЗабалансовыйСчет(ЭтотОбъект);
	УстановитьЗаголовокСубконтоЗабалансовогоСчета(ЭтотОбъект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Если ОбщегоНазначенияБГУКлиентСервер.ЗапрещеноДобавлениеСтрокВДокументыНФА(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		УстановитьЗаголовкиДинамическихКолонокСтроки(ТекущиеДанные);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МатериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.РешениеСотрудникаПоРезолюцииВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыРешениеСотрудникаПоРезолюцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	ТекущиеДанные.РешениеСотрудникаПоРезолюции = ВыбранноеЗначение;
	
	РешениеСотрудникаМодифицированность = Истина;
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		ЗаполнитьДанныеНоменклатурыВСтроке(ТекущиеДанные.ПолучитьИдентификатор(), Истина);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.АвтоПодборСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Счет105(ЭтотОбъект), Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Счет105(ЭтотОбъект), Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОкончаниеВводаТекстаСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Счет105(ЭтотОбъект), Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Счет105(ЭтотОбъект), Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКФООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Счет105(ЭтотОбъект), Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьСтоимостьОС(Команда)
	РассчитатьСуммыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаПриИзменении(Элемент)
	РассчитатьДопКолонкиПоСтроке(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаАмортизацииПриИзменении(Элемент)
	РассчитатьДопКолонкиПоСтроке(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаОбесцененияПриИзменении(Элемент)
	РассчитатьДопКолонкиПоСтроке(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииПриИзменении(Элемент)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииОтсутствуетПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииФлагаОтсутствуетЧленКомиссии(
		ОбщегоНазначенияБГУКлиентСервер.ПараметрыВыбораФайлаОсобогоМненияСотрудника(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииПричиныОтсутствияЧленаКомиссии(
		ОбщегоНазначенияБГУКлиентСервер.ПараметрыВыбораФайлаОсобогоМненияСотрудника(ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.СоставКомиссииВыборПоляУправленияФайлом(
		ОбщегоНазначенияБГУКлиентСервер.ПараметрыВыбораФайлаОсобогоМненияСотрудника(ЭтотОбъект),
		Поле,
		СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииФайлОсобогоМненияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.ВыбратьФайлОсобогоМненияСотрудника(
		ОбщегоНазначенияБГУКлиентСервер.ПараметрыВыбораФайлаОсобогоМненияСотрудника(ЭтотОбъект),
		СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииФайлОсобогоМненияОчистка(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.ЗапроситьУдалениеФайлаЧленаКомиссии(
		ОбщегоНазначенияБГУКлиентСервер.ПараметрыВыбораФайлаОсобогоМненияСотрудника(ЭтотОбъект),
		СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	Если НомерЗабалансовогоСубконтоОС = 0 Тогда
		ПараметрыПодбора = Новый Структура("ПараметрыТчДокумента", Неопределено);
		Если Объект.Материалы.Количество() Тогда
			ПоместитьМатериалыВХранилищеНаСервере(ПараметрыПодбора)
		КонецЕсли;
		
		УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборМатериаловРасширенный(
		ЭтотОбъект,
		Объект,
		,
		ДополнитьСтруктуруПодбора(),
		ПараметрыПодбора.ПараметрыТчДокумента);
	Иначе
		ПараметрыПодбора = Новый Структура;
		ПараметрыПодбора.Вставить("ИФО"				, Объект.ИФО);
		ПараметрыПодбора.Вставить("Счет"			, Объект.ЗабалансовыйСчет);
		ПараметрыПодбора.Вставить("ВидРаспоряжения", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаХранении"));
		ПараметрыПодбора.Вставить("КолонкиКорзины", Новый Структура("Цена", "СтоимостьЕдиницы"));
		УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтотОбъект, Объект, ПараметрыПодбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьРезультатыГолосования(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Сотрудник", Сотрудник);
	ДопПараметры.Вставить("РезультатыГолосования", Новый Массив);
	Для Каждого СтрокаОС Из Объект.Материалы Цикл
		Если ЗначениеЗаполнено(СтрокаОС.РешениеСотрудникаПоРезолюции) Тогда
			РезультатГолосования = Новый Структура("ИдентификаторСтроки,РешениеСотрудникаПоРезолюции",
				СтрокаОС.ИдентификаторСтроки, СтрокаОС.РешениеСотрудникаПоРезолюции);
			ДопПараметры.РезультатыГолосования.Добавить(РезультатГолосования);
		КонецЕсли;
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("ВопросСохранитьРезультатыГолосованияЗавершение", ЭтотОбъект, ДопПараметры);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Сохранить результаты голосования члена комиссии ""%1""?'"), Сотрудник);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЗаВоВсехСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("За", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеПротивВоВсехСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("Против", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЗаВВыделенныхСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("За", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеПротивВВыделенныхСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("Против", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЕдиногласноЗаВоВсехСтроках(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ был изменен. Сначала следует записать документ!'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросУстановитьРешениеЕдиногласноЗавершение", ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.За"));
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Будет установлено и сохранено решение %1 для всех присутствующих членов комиссии по всем строкам документа.
			|Все предыдущие результаты голосования по документу будут перезаписаны.'"), "За");
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = ' Проведение документа будет отменено.'");
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ru = ' Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЕдиногласноПротивВоВсехСтроках(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ был изменен. Сначала следует записать документ!'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросУстановитьРешениеЕдиногласноЗавершение", ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.Против"));
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Будет установлено и сохранено решение %1 для всех присутствующих членов комиссии по всем строкам документа.
			|Все предыдущие результаты голосования по документу будут перезаписаны.'"), "Против");
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = ' Проведение документа будет отменено.'");
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ru = ' Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыТЧ(Команда)
	Реквизиты = Новый Структура(
		"СправедливаяСтоимость, ОпределенаОценщиком, ОценкаНомер, ОценкаДата, МетодРыночныхЦен");
	
	УправлениеНФАКлиент.ИзменитьРеквизитыСтрокТЧ(ЭтотОбъект,
		"РешениеОбОценкеИмуществаМЗ",
		"Материалы",
		"Материалы",
		Реквизиты);
КонецПроцедуры
// Конец ИнтеграцияС1Сдокументооборотом 

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьИменаТабличныхЧастей()
	
	Для Каждого ТабличнаяЧасть Из Метаданные.Документы.РешениеОбОценкеИмуществаМЗ.ТабличныеЧасти Цикл
		Если ТабличнаяЧасть.Имя = "ДополнительныеРеквизиты" Тогда
			Продолжить;
		КонецЕсли;
		СписокИменТабличныхЧастей.Добавить(ТабличнаяЧасть.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Асинх Функция СогласиеПользователяНаОчисткуТЧ()
	
	ТекстВопроса = НСтр("ru = 'Табличные части документа будетут очищены'");
	Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаСервере
Процедура РассчитатьСуммыНаСервере(МассивСтрок = Неопределено)
	
	Запрос = Новый Запрос;
	Если МассивСтрок = Неопределено Тогда
		Запрос.УстановитьПараметр("ТаблицаОС", Объект.Материалы.Выгрузить(, "НомерСтроки,ИнвентарныйНомер,СубконтоЗабалансовыйСчет1,СубконтоЗабалансовыйСчет2,СубконтоЗабалансовыйСчет3"));
	Иначе
		Запрос.УстановитьПараметр("ТаблицаОС", Объект.Материалы.Выгрузить(МассивСтрок, "НомерСтроки,ИнвентарныйНомер,СубконтоЗабалансовыйСчет1,СубконтоЗабалансовыйСчет2,СубконтоЗабалансовыйСчет3"));
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("ТекущийДокумент", Объект.Ссылка);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Т.СубконтоЗабалансовыйСчет1 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ВЫРАЗИТЬ(Т.СубконтоЗабалансовыйСчет1 КАК Справочник.ОсновныеСредства)
	|		КОГДА Т.СубконтоЗабалансовыйСчет2 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ВЫРАЗИТЬ(Т.СубконтоЗабалансовыйСчет2 КАК Справочник.ОсновныеСредства)
	|		КОГДА Т.СубконтоЗабалансовыйСчет3 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА ВЫРАЗИТЬ(Т.СубконтоЗабалансовыйСчет3 КАК Справочник.ОсновныеСредства)
	|	КОНЕЦ КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА Т.СубконтоЗабалансовыйСчет1 ССЫЛКА Справочник.ЦМО
	|			ТОГДА ВЫРАЗИТЬ(Т.СубконтоЗабалансовыйСчет1 КАК Справочник.ЦМО)
	|		КОГДА Т.СубконтоЗабалансовыйСчет2 ССЫЛКА Справочник.ЦМО
	|			ТОГДА ВЫРАЗИТЬ(Т.СубконтоЗабалансовыйСчет2 КАК Справочник.ЦМО)
	|		КОГДА Т.СубконтоЗабалансовыйСчет3 ССЫЛКА Справочник.ЦМО
	|			ТОГДА ВЫРАЗИТЬ(Т.СубконтоЗабалансовыйСчет3 КАК Справочник.ЦМО)
	|	КОНЕЦ КАК ЦМО,
	|	Т.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	Т.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_ТаблицаОС
	|ИЗ
	|	&ТаблицаОС КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСтоимостиОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаСтоимостиОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СУММА(ТаблицаСтоимостиОС.БалансоваяСтоимость) КАК БалансоваяСтоимость,
	|	СУММА(ТаблицаСтоимостиОС.СуммаАмортизации) КАК СуммаАмортизации,
	|	СУММА(ТаблицаСтоимостиОС.СуммаОбесценения) КАК СуммаОбесценения
	|ПОМЕСТИТЬ ВТ_СтоимостиОС
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтоимостьОбъектовОС.ОсновноеСредство КАК ОсновноеСредство,
	|		СтоимостьОбъектовОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|		СтоимостьОбъектовОС.Стоимость КАК БалансоваяСтоимость,
	|		0 КАК СуммаАмортизации,
	|		0 КАК СуммаОбесценения
	|	ИЗ
	|		РегистрНакопления.СтоимостьОбъектовОС КАК СтоимостьОбъектовОС
	|	ГДЕ
	|		СтоимостьОбъектовОС.Организация = &Организация
	|		И СтоимостьОбъектовОС.ВидРаспоряжения В (ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе), ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет))
	|		И СтоимостьОбъектовОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
	|		И СтоимостьОбъектовОС.Активность
	|		И СтоимостьОбъектовОС.Период <= &Период
	|		И (СтоимостьОбъектовОС.ОсновноеСредство, СтоимостьОбъектовОС.ИнвентарныйНомер, СтоимостьОбъектовОС.ЦМО) В
	|				(ВЫБРАТЬ
	|					ВТ_ТаблицаОС.ОсновноеСредство,
	|					ВТ_ТаблицаОС.ИнвентарныйНомер,
	|					ВТ_ТаблицаОС.ЦМО
	|				ИЗ
	|					ВТ_ТаблицаОС)
	|		И СтоимостьОбъектовОС.Регистратор <> &ТекущийДокумент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АмортизацияОбъектовОС.ОсновноеСредство,
	|		АмортизацияОбъектовОС.ИнвентарныйНомер,
	|		0,
	|		АмортизацияОбъектовОС.СуммаАмортизации,
	|		АмортизацияОбъектовОС.СуммаОбесценения
	|	ИЗ
	|		РегистрНакопления.АмортизацияОбъектовОС КАК АмортизацияОбъектовОС
	|	ГДЕ
	|		АмортизацияОбъектовОС.Организация = &Организация
	|		И АмортизацияОбъектовОС.ЭтоСписание
	|		И АмортизацияОбъектовОС.Активность
	|		И АмортизацияОбъектовОС.Период <= &Период
	|		И (АмортизацияОбъектовОС.ОсновноеСредство, АмортизацияОбъектовОС.ИнвентарныйНомер) В
	|				(ВЫБРАТЬ
	|					ВТ_ТаблицаОС.ОсновноеСредство,
	|					ВТ_ТаблицаОС.ИнвентарныйНомер
	|				ИЗ
	|					ВТ_ТаблицаОС)
	|		И АмортизацияОбъектовОС.Регистратор <> &ТекущийДокумент) КАК ТаблицаСтоимостиОС
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСтоимостиОС.ОсновноеСредство,
	|	ТаблицаСтоимостиОС.ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаОС.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВТ_СтоимостиОС.БалансоваяСтоимость, 0) КАК Сумма,
	|	ЕСТЬNULL(ВТ_СтоимостиОС.СуммаОбесценения, 0) КАК СуммаОбесценения,
	|	ЕСТЬNULL(ВТ_СтоимостиОС.СуммаАмортизации, 0) КАК СуммаАмортизации
	|ИЗ
	|	ВТ_ТаблицаОС КАК ВТ_ТаблицаОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостиОС КАК ВТ_СтоимостиОС
	|		ПО ВТ_ТаблицаОС.ОсновноеСредство = ВТ_СтоимостиОС.ОсновноеСредство
	|			И ВТ_ТаблицаОС.ИнвентарныйНомер = ВТ_СтоимостиОС.ИнвентарныйНомер
	|ГДЕ
	|	ЕСТЬNULL(ВТ_СтоимостиОС.БалансоваяСтоимость, 0) > 0"
	;
	
	ВыборкаСтоимостиОС = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСтоимостиОС.Следующий() Цикл
		ТекущаяСтрока = Объект.Материалы[ВыборкаСтоимостиОС.НомерСтроки-1];
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ВыборкаСтоимостиОС, "Сумма,СуммаОбесценения,СуммаАмортизации");
		РассчитатьДопКолонкиПоСтроке(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере(МассивИменТЧ)
	
	Если Объект.Организация <> ЭтотОбъект.КэшПараметров.Организация Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.ВидОперации) Тогда
			Объект.ВидОперации = Перечисления.ВидыОперацийРешениеОбОценкеМЗ.ПустаяСсылка();
			Объект.ЗабалансовыйСчет = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
		КонецЕсли;
		
		УстановитьДоступностьЭлементовФормы_ПоОперации(ЭтотОбъект);
		ЗаполнитьКЭШПараметровФормыЛокальныеСчета();
		ЗаполнитьЗабалансовыйСчет(ЭтотОбъект);
		ПрочитатьСвойстваЗабалансовогоСчета();
		УстановитьВидимостьЭлементовФормы_ЗабалансовыйСчет(ЭтотОбъект);
		УстановитьЗаголовокСубконтоЗабалансовогоСчета(ЭтотОбъект);
		ОчиститьТабличныеЧасти(МассивИменТЧ);
		
		УстановитьРуководителя(Объект);
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ТребуетсяВызовСервера = ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
		Или УправлениеМатериальнымиЗапасамиКлиентСервер.ИзменилосьПрименениеДетальногоКЭК340и440(
			ЭтотОбъект.КэшПараметров.Дата,
			ЭтотОбъект.КэшПараметров.Организация,
			Объект.Дата,
			Объект.Организация);
	
	Если ТребуетсяВызовСервера Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()

	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	КонецЕсли;
	
	ЗаполнитьКЭШПараметровФормыЛокальныеСчета();
	НужноПерезаполнениеСчета = Истина;
	Для Каждого СчетКЭШ Из ЭтотОбъект.КэшПараметров.Локальные Цикл
		Если СчетКЭШ.Значение = Объект.ЗабалансовыйСчет Тогда
			НужноПерезаполнениеСчета = Ложь;
		КонецЕсли;
	КонецЦикла;
	Если НужноПерезаполнениеСчета Тогда
		ЗаполнитьЗабалансовыйСчет(ЭтотОбъект);
		ПрочитатьСвойстваЗабалансовогоСчета();
		УстановитьВидимостьЭлементовФормы_ЗабалансовыйСчет(ЭтотОбъект);
		УстановитьЗаголовокСубконтоЗабалансовогоСчета(ЭтотОбъект);
	КонецЕсли;

	УправлениеМатериальнымиЗапасами.ОбработатьИзменениеПримененияДетальногоКЭК340и440(ЭтотОбъект,
		ЭтотОбъект.КэшПараметров.Дата,
		ЭтотОбъект.КэшПараметров.Организация);

КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличныеЧасти(МассивИменТЧ)
	
	Для Каждого ИмяТЧ Из МассивИменТЧ Цикл
		Объект[ИмяТЧ].Очистить();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРуководителя(Объект)

	НовыйРуководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации("Руководитель",
		Объект.Организация, Объект.Дата, Объект.Подразделение);
	
	Если ЗначениеЗаполнено(НовыйРуководитель.ОтветственноеЛицоСсылка) 
		И Объект.Руководитель <> НовыйРуководитель.ОтветственноеЛицоСсылка Тогда
		Объект.Руководитель = НовыйРуководитель.ОтветственноеЛицоСсылка;
		#Если НаКлиенте Тогда
		ПоказатьОповещениеПользователя(,,НСтр("ru = 'Установлено новое значение поля ""Руководитель""'"));			
		#КонецЕсли
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	
	ТаблицаПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	
	Если ТаблицаПодбора.Количество() Тогда
		ВтМатериалы = Объект.Материалы.Выгрузить();
		УправлениеМатериальнымиЗапасами.ЗаполнитьТаблицуИзПодбораМатериалов(ВтМатериалы, ТаблицаПодбора);
		
		СуммыНоменклатуры = СтоимостьНоменклатуры(ТаблицаПодбора);
		СуммыНоменклатуры.Индексы.Добавить("Номенклатура, КФО");
		Отбор = Новый Структура("Номенклатура, КФО");
		
		Для Каждого СтрокаМатериалы Из ВтМатериалы Цикл
			Если СтрокаМатериалы.НоваяСтрока Тогда
				ЗаполнитьЗначенияСвойств(Отбор, СтрокаМатериалы);
				Остатки = СуммыНоменклатуры.НайтиСтроки(Отбор);
				Если Остатки.Количество() И Остатки[0].Количество <> 0 Тогда
					ЗаполнитьЗначенияСвойств(СтрокаМатериалы, Остатки[0], "СчетУчета, КПС, КЭК");
					Если СтрокаМатериалы.Количество = Остатки[0].Количество Тогда
						СтрокаМатериалы.Сумма = Остатки[0].Сумма;
					Иначе
						СтрокаМатериалы.Сумма = СтрокаМатериалы.Количество * Остатки[0].Сумма / Остатки[0].Количество;
					КонецЕсли;
				КонецЕсли;
				СтрокаМатериалы.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			УстановитьЗаголовкиДинамическихКолонокСтроки(СтрокаМатериалы);
		КонецЦикла;
		
		Объект.Материалы.Загрузить(ВтМатериалы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СтоимостьНоменклатуры(ТаблицаНоменклатуры)

	ПараметрыСтоимости = УправлениеМатериальнымиЗапасами.СтоимостьСписанияНеактивовНаЗабалансе_Параметры(Объект);
	ПараметрыСтоимости.СчетУчетаЗабаланс
		= ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(ЭтотОбъект, "Счет024");
	ПараметрыСтоимости.СчетаУчетаБаланс
		= БухгалтерскийУчет.СписокСчетов("105.00, 113.00", Объект.Дата, Ложь, Объект.Организация);
	ПараметрыСтоимости.ТаблицаНоменклатуры = ТаблицаНоменклатуры;
	
	Возврат УправлениеМатериальнымиЗапасами.СтоимостьСписанияНеактивовНаЗабалансе(ПараметрыСтоимости);
	
КонецФункции

&НаКлиенте
Функция ДополнитьСтруктуруПодбора()
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("СчетУчета",              ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(ЭтотОбъект, "Счет024"));
	ПараметрыПодбора.Вставить("Подразделение",			Объект.Подразделение);
	ПараметрыПодбора.Вставить("ПоказыватьОстатки",		Истина);
	ПараметрыПодбора.Вставить("ПоказыватьСчетУчета",	Истина);
	ТипыНоменклатуры = Новый СписокЗначений;
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БиологическиеАктивы"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Блюдо"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ГСМ"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Медикаменты"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МолоднякИЖивотныеНаОткорме"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МягкийИнвентарь"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Посуда"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПродуктыПитания"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Стройматериалы"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Оборудование"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БСО"));
	ПараметрыПодбора.Вставить("ТипыНоменклатуры",		ТипыНоменклатуры);
	ПараметрыПодбора.Вставить("ИмяТаблицы",				"Материалы");
	Возврат ПараметрыПодбора;

КонецФункции

&НаСервере
Процедура УстановитьДанныеДинамическихКолонок()

	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеДинамическихКолонокТаблицыМатериалы(
		ЭтотОбъект, Объект, "Материалы");
	УстановитьЗаголовкиДинамическихКолонок(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиДинамическихКолонок(Форма)
	Для Каждого Строка Из Форма.Объект.Материалы Цикл
		УстановитьЗаголовкиДинамическихКолонокСтроки(Строка);
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиДинамическихКолонокСтроки(Строка)
	ЗаголовкиСтроки = Новый Структура;
	ЗаголовкиСтроки.Вставить("ЗаголовокМетодРыночныхЦен", НСтр("ru = 'Метод рыночных цен'"));
	ЗаголовкиСтроки.Вставить("ЗаголовокОтчетОценщика", НСтр("ru = 'Отчет оценщика №'"));
	ЗаголовкиСтроки.Вставить("ЗаголовокОтчетОценщикаДата", НСтр("ru = 'от'"));
	ЗаполнитьЗначенияСвойств(Строка, ЗаголовкиСтроки);
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЗаполнитьКЭШПараметровФормыЛокальныеСчета();
	УстановитьДанныеДинамическихКолонок();
	РаботаСФайламиБГУ.ЗаполнитьФайлыСотрудниковВТаблице(
	ОбщегоНазначенияБГУКлиентСервер.ПараметрыВыбораФайлаОсобогоМненияСотрудника(ЭтотОбъект));
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	УстановитьДоступностьЭлементовФормы_ПоОперации(ЭтотОбъект);
	ПрочитатьСвойстваЗабалансовогоСчета();
	УстановитьЗаголовокСубконтоЗабалансовогоСчета(ЭтотОбъект);
	УстановитьВидимостьЭлементовФормы_ЗабалансовыйСчет(ЭтотОбъект);
	РассчитатьДопКолонкиВоВсехСтроках(Объект.Материалы);
	
	ПолучитьИменаТабличныхЧастей();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКЭШПараметровФормыЛокальныеСчета()
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаСчета = Объект.Дата;
	Иначе
		ДатаСчета = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет105",
		БухгалтерскийУчет.СчетПоКоду("105.00", ДатаСчета, Объект.Организация));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет024",
		БухгалтерскийУчет.СчетПоКоду("02.4", ДатаСчета, Объект.Организация));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет023",
		БухгалтерскийУчет.СчетПоКоду("02.3", ДатаСчета, Объект.Организация));
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Счет105(Форма)
	Возврат ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(
		Форма,
		"Счет105",
		ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка"));
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьСвойстваЗабалансовогоСчета(Форма)
	
	Форма.НомерЗабалансовогоСубконтоЦМО = 0;
	Форма.НомерЗабалансовогоСубконтоДоп = 0;
	Форма.НомерЗабалансовогоСубконтоОС = 0;
	Форма.ЗаголовокЗабалансовогоСубконтоДоп = "";
	Форма.ВидСубконтоЗабалансовогоСубконтоДоп = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗабалансовыйСчет(Форма)
	
	Если Форма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРешениеОбОценкеМЗ.МатериальныеЗапасы") Тогда
		Форма.Объект.ЗабалансовыйСчет = ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(
		Форма,
		"Счет024",
		ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка"));
	ИначеЕсли Форма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРешениеОбОценкеМЗ.ОсновныеСредства") Тогда
		Форма.Объект.ЗабалансовыйСчет = ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(
		Форма,
		"Счет023",
		ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСвойстваЗабалансовогоСчета()
	
	ОчиститьСвойстваЗабалансовогоСчета(ЭтотОбъект);
	Если ЗначениеЗаполнено(Объект.ЗабалансовыйСчет)
		И Объект.ВидОперации = Перечисления.ВидыОперацийРешениеОбОценкеМЗ.ОсновныеСредства Тогда
		
		СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Объект.ЗабалансовыйСчет);
		Для Номер = 1 По СвойстваСчета.КоличествоСубконто Цикл
			Если СвойстваСчета["ВидСубконто" + Номер] = ПланыВидовХарактеристик.ВидыСубконто.ЦМО Тогда
				НомерЗабалансовогоСубконтоЦМО = Номер;
			ИначеЕсли СвойстваСчета["ВидСубконто" + Номер] = ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства Тогда
				НомерЗабалансовогоСубконтоОС = Номер;
			ИначеЕсли СвойстваСчета["ВидСубконто" + Номер] <> ПланыВидовХарактеристик.ВидыСубконто.Номенклатура Тогда
				НомерЗабалансовогоСубконтоДоп = Номер;
				ЗаголовокЗабалансовогоСубконтоДоп = СвойстваСчета["ВидСубконто" + Номер + "Наименование"];
				ВидСубконтоЗабалансовогоСубконтоДоп = СвойстваСчета["ВидСубконто" + Номер];
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокСубконтоЗабалансовогоСчета(Форма)
	Если ЗначениеЗаполнено(Форма.ЗаголовокЗабалансовогоСубконтоДоп) Тогда
		ТекстЗаголовка = СтрШаблон(НСтр("ru = '(заб) %1'"), Форма.ЗаголовокЗабалансовогоСубконтоДоп);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"МатериалыСубконтоЗабалансовыйСчет" + Форма.НомерЗабалансовогоСубконтоДоп,
			"Заголовок",
			ТекстЗаголовка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоЦМО) Тогда
		ТекстЗаголовка = НСтр("ru = '(заб) ЦМО'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"МатериалыСубконтоЗабалансовыйСчет" + Форма.НомерЗабалансовогоСубконтоЦМО,
			"Заголовок",
			ТекстЗаголовка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоОС) Тогда
		ТекстЗаголовка = НСтр("ru = '(заб) ОС'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"МатериалыСубконтоЗабалансовыйСчет" + Форма.НомерЗабалансовогоСубконтоОС,
			"Заголовок",
			ТекстЗаголовка);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовФормы_ПоОперации(Форма)
	
	ДоступностьПоля = ЗначениеЗаполнено(Форма.Объект.Организация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Форма.Элементы,
	"ВидОперации",
	"Доступность",
	ДоступностьПоля);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_ЗабалансовыйСчет(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ВидимостьЗабалансовыхСубконто = Новый Массив(3);
	Для Индекс = 0 По 2 Цикл
		ВидимостьЗабалансовыхСубконто[Индекс] = Ложь;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоДоп) Тогда
		ВидимостьЗабалансовыхСубконто[Форма.НомерЗабалансовогоСубконтоДоп - 1] = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоЦМО) Тогда
		ВидимостьЗабалансовыхСубконто[Форма.НомерЗабалансовогоСубконтоЦМО - 1] = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоОС) Тогда
		ВидимостьЗабалансовыхСубконто[Форма.НомерЗабалансовогоСубконтоОС - 1] = Истина;
	КонецЕсли;
	
	Для Номер = 1 По ВидимостьЗабалансовыхСубконто.Количество() Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"МатериалыСубконтоЗабалансовыйСчет" + Номер,
		"Видимость",
		ВидимостьЗабалансовыхСубконто[Номер - 1]);
	КонецЦикла;
	
	МассивЭлементовОС = Новый Массив;
	МассивЭлементовОС.Добавить("МатериалыИнвентарныйНомер");
	МассивЭлементовОС.Добавить("МатериалыСуммаАмортизации");
	МассивЭлементовОС.Добавить("МатериалыСуммаОбесценения");
	МассивЭлементовОС.Добавить("МатериалыОстаточнаяСтоимость"); 
	МассивЭлементовОС.Добавить("МатериалыКомандаРассчитатьСтоимостьОС");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(
	Элементы,
	МассивЭлементовОС,
	"Видимость",
	ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоОС));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы,
	"МатериалыСрокЭксплуатации",
	"Видимость",
	НЕ ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоОС));

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНоменклатурыВСтроке(ИдентификаторСтроки, Знач ЗаполнятьСчет)
	
	ТекущиеДанные = Объект.Материалы.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, ТекущиеДанные, ЗаполнятьСчет);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДанныеСчетаВСтроке(Форма, Строка, ЗаполнятьСчет)
	
	ПараметрыОбработки = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(Форма, Строка);
	ПараметрыОбработки.ЗаполнятьСчет = ЗаполнятьСчет;
	ПараметрыОбработки.ДтКт          = "Дт";
	
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеСчетаУчетаВСтроке(Строка, ПараметрыОбработки);
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
	РаботаСФайламиБГУ.ПолучитьФайлСотрудника(Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеСпискаМатериалов(ЭтотОбъект, "Материалы");
	УстановитьУсловноеОформлениеЭлементовСпискаВыбора(Элементы.МатериалыОпределенаОценщиком);
	
	// Решение сотрудника.
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыРешениеСотрудникаПоРезолюции.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.РешениеСотрудникаПоРезолюции", ВидСравненияКомпоновкиДанных.Равно,
			Перечисления.РезультатыГолосованияЧленовКомиссии.За);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыРешениеСотрудникаПоРезолюции.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.РешениеСотрудникаПоРезолюции", ВидСравненияКомпоновкиДанных.Равно,
			Перечисления.РезультатыГолосованияЧленовКомиссии.Против);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи);
	
	// Определение стоимости

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыЗаголовокМетодРыночныхЦен.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыМетодРыночныхЦен.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.ОпределенаОценщиком", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыЗаголовокОтчетОценщика.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыОценкаНомер.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыЗаголовокОтчетОценщикаДата.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыОценкаДата.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.ОпределенаОценщиком", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	ОбщегоНазначенияБГУ.УстановитьУсловноеОформлениеКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеЭлементовСпискаВыбора(Элемент)
	
	Для Каждого ЭлементСписка Из Элемент.СписокВыбора Цикл
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элемент.Имя);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, Элемент.ПутьКДанным,
			ВидСравненияКомпоновкиДанных.Равно, ЭлементСписка.Значение);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", ЭлементСписка.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	//Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО Тогда
	//	СтруктураРеквизитов.Вставить("ИФО");
	//КонецЕсли;
	//Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоПодразделениям Тогда
	//	Если Элементы.Подразделение.ОтметкаНезаполненного Тогда
	//		СтруктураРеквизитов.Вставить("Подразделение");
	//	КонецЕсли;
	//КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт
	
	ПараметрыПодбора.Отбор.Вставить("Организация"	, Объект.Организация);
	ПараметрыПодбора.Отбор.Вставить("ИФО"			, Объект.ИФО);
	ПараметрыПодбора.Отбор.Вставить("Подразделение"	, Объект.Подразделение);
	
	ПараметрыПодбора.Вставить("ВидРаспоряжения", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаБалансе"));
	ПараметрыПодбора.Вставить("НужнаАмортизация", Истина);
	
	Если Объект.Материалы.Количество() > 0 Тогда
		ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("СкрытьКолонки", "КФО,КПС,СчетУчета,ЦМО");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьДопКолонкиПоСтроке(ТекСтрока)
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока.ОстаточнаяСтоимость = ТекСтрока.Сумма - ТекСтрока.СуммаАмортизации - ТекСтрока.СуммаОбесценения;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьДопКолонкиВоВсехСтроках(ТабЧасть)
	
	Для Каждого ТекСтрока из ТабЧасть Цикл
		РассчитатьДопКолонкиПоСтроке(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоОстаткамЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработкаВыбораПодбораОсновныхСредствНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодбораОсновныхСредствНаСервере(Знач ВыбранноеЗначение)
	
	ТаблицаОС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресОСВХранилище);
	МассивДобавленныхСтрок = Новый Массив;
	Для Каждого СтрокаОС Из ТаблицаОС Цикл
		НоваяСтрока = Объект.Материалы.Добавить();
		НоваяСтрока["СубконтоЗабалансовыйСчет" + НомерЗабалансовогоСубконтоОС] = СтрокаОС.ОсновноеСредство;
		Если ЗначениеЗаполнено(НомерЗабалансовогоСубконтоЦМО) Тогда
			НоваяСтрока["СубконтоЗабалансовыйСчет" + НомерЗабалансовогоСубконтоЦМО] = СтрокаОС.ЦМО;
		КонецЕсли;
		Если ЗначениеЗаполнено(НомерЗабалансовогоСубконтоДоп) Тогда
			Если ВидСубконтоЗабалансовогоСубконтоДоп = ПланыВидовХарактеристик.ВидыСубконто.Договоры Тогда
				НоваяСтрока["СубконтоЗабалансовыйСчет" + НомерЗабалансовогоСубконтоДоп] = СтрокаОС.Договор;
			ИначеЕсли ВидСубконтоЗабалансовогоСубконтоДоп = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты Тогда
				НоваяСтрока["СубконтоЗабалансовыйСчет" + НомерЗабалансовогоСубконтоДоп] = СтрокаОС.Контрагент;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока.Сумма = СтрокаОС.Сумма;
		НоваяСтрока.Количество = СтрокаОС.Количество;
		НоваяСтрока.ИнвентарныйНомер = СтрокаОС.ИнвентарныйНомер;
		НоваяСтрока.ЦМО = СтрокаОС.ЦМО;
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		МассивДобавленныхСтрок.Добавить(НоваяСтрока);
	КонецЦикла;
	
	РассчитатьСуммыНаСервере(МассивДобавленныхСтрок);
	РассчитатьДопКолонкиВоВсехСтроках(Объект.Материалы);

КонецПроцедуры

&НаСервере
Функция ПоместитьОСВХранилище()
	
	ТаблицаОС = Объект.Материалы.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);
	
КонецФункции

&НаСервере
Процедура ПоместитьМатериалыВХранилищеНаСервере(ПараметрыПодбора)
	
	ПараметрыПодбора.ПараметрыТчДокумента = Новый Структура("АдресТчВХранилище");
	КолонкиРеквизитов = УправлениеМатериальнымиЗапасами.КолонкиПодбораДляВыгрузкиТабличнойЧасти(ЭтотОбъект.ПолучитьРеквизиты("Объект.Материалы"));
	ТаблицаМатериалы = Объект.Материалы.Выгрузить(,КолонкиРеквизитов);
	ПараметрыПодбора.ПараметрыТчДокумента.АдресТчВХранилище = ПоместитьВоВременноеХранилище(ТаблицаМатериалы, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура КомиссияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ЗаполнитьСоставКомиссии(ЭтотОбъект);
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.КомиссияПриИзмененииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьРезультатыГолосованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьРезультатыГолосованияНаСервере(ДополнительныеПараметры.Сотрудник, ДополнительныеПараметры.РезультатыГолосования);
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРезультатыГолосованияНаСервере(ЧленКомиссии, РезультатыГолосования)
	
	ОбщегоНазначенияБГУ.СохранитьРезультатыГолосованияНаСервере(Объект, ЧленКомиссии, РезультатыГолосования);
	РешениеСотрудникаМодифицированность = Ложь;
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУстановитьРешениеЕдиногласноЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		УстановитьРешениеЕдиногласноНаСервере(ДополнительныеПараметры);
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Ложь; // При любом ответе сбрасываем признак модифицированности.
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРешениеЕдиногласноНаСервере(РезультатГолосования)
	
	ОбщегоНазначенияБГУ.УстановитьРешениеЕдиногласноНаСервере(Объект, "Материалы", РезультатГолосования);
	РешениеСотрудникаМодифицированность = Ложь;
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеВСтрокахДокумента(РешениеСотрудника, ВоВсехСтроках = Истина)
	
	РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.ПустаяСсылка");
	Если РешениеСотрудника = "За" Тогда
		РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.За");
	ИначеЕсли РешениеСотрудника = "Против" Тогда
		РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.Против");
	КонецЕсли;
	
	Если ВоВсехСтроках Тогда
		Для Каждого СтрокаДокумента Из Объект.Материалы Цикл
			СтрокаДокумента.РешениеСотрудникаПоРезолюции = РешениеСотрудникаПоРезолюции;
		КонецЦикла;
	Иначе
		Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.Материалы.ВыделенныеСтроки Цикл
			СтрокаДокумента = Объект.Материалы.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
			СтрокаДокумента.РешениеСотрудникаПоРезолюции = РешениеСотрудникаПоРезолюции;
		КонецЦикла;
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Истина;
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СохранитьРезультатыГолосования", "Доступность",
			ЗначениеЗаполнено(Форма.Сотрудник) И Форма.РешениеСотрудникаМодифицированность);
	
КонецПроцедуры

// Файлы сотрудников

&НаКлиенте
Процедура ОбработатьВыборФайлаСотрудника(ЗначениеВыбора, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		ОбработатьВыборФайлаСотрудникаНаСервере(ЗначениеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборФайлаСотрудникаНаСервере(ЗначениеВыбора)
	
	РаботаСФайламиБГУ.ОбработатьВыборФайлаСотрудника(ЗначениеВыбора, Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОткрепитьФайлСотрудникаНаСервере()
	
	РаботаСФайламиБГУ.ОткрепитьФайлСотрудника(ФайлСотрудника, Сотрудник, ЭтотОбъект);
	
КонецПроцедуры
// Конец Файлы сотрудников
	
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтотОбъект.Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
