#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Процедура ОчиститьПодразделение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтоимостьОбъектовОС.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС КАК СтоимостьОбъектовОС
	|ГДЕ
	|	СтоимостьОбъектовОС.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И СтоимостьОбъектовОС.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтоимостьОбъектовОСПоКонтрагентам.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам КАК СтоимостьОбъектовОСПоКонтрагентам
	|ГДЕ
	|	СтоимостьОбъектовОСПоКонтрагентам.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И СтоимостьОбъектовОСПоКонтрагентам.Активность";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Сч = 0 По 1 Цикл
		
		ИмяРегистра = ?(Сч = 0, "СтоимостьОбъектовОС", "СтоимостьОбъектовОСПоКонтрагентам");
		
		Выборка = Результат[Сч].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			НаборЗаписей.Прочитать();
			
			Для Каждого Запись Из НаборЗаписей Цикл
				Запись.Подразделение = Справочники.Подразделения.ПустаяСсылка();
			КонецЦикла; 
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьПодразделениеПоСчетам(Счета) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Счета_СтоимостьОС
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В (&СчетаДляРН_СтоимостьОС)
	|	И ЕПСБУ.Ссылка В (&Счета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Счета_СтоимостьОСпоКонтрагентам
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В (&СчетаДляРН_СтоимостьОСпоКонтрагентам)
	|	И ЕПСБУ.Ссылка В (&Счета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЕПСБУОбороты.Регистратор КАК Регистратор,
	|	ИСТИНА КАК ЭтоСобственныеОС,
	|	ЕПСБУОбороты.Субконто1 КАК ОсновноеСредство
	|ПОМЕСТИТЬ ДанныеБУ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(,, Регистратор, Счет В
	|		(ВЫБРАТЬ
	|			Таб.Ссылка
	|		ИЗ
	|			Счета_СтоимостьОС КАК Таб), &СубконтоОС,,,) КАК ЕПСБУОбороты
	|ГДЕ
	|	ЕПСБУОбороты.СуммаОборотДт <> 0
	|	ИЛИ ЕПСБУОбороты.СуммаОборотКт <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕПСБУОбороты.Регистратор,
	|	ЛОЖЬ,
	|	ЕПСБУОбороты.Субконто1
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(,, Регистратор, Счет В
	|		(ВЫБРАТЬ
	|			Таб.Ссылка
	|		ИЗ
	|			Счета_СтоимостьОСпоКонтрагентам КАК Таб), &СубконтоОС,,,) КАК ЕПСБУОбороты
	|ГДЕ
	|	ЕПСБУОбороты.СуммаОборотДт <> 0
	|	ИЛИ ЕПСБУОбороты.СуммаОборотКт <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОС.Регистратор КАК Регистратор,
	|	СтоимостьОбъектовОС.ОсновноеСредство КАК ОсновноеСредство
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС КАК СтоимостьОбъектовОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеБУ КАК ДанныеБУ
	|		ПО ДанныеБУ.Регистратор = СтоимостьОбъектовОС.Регистратор
	|		И ДанныеБУ.ОсновноеСредство = СтоимостьОбъектовОС.ОсновноеСредство
	|		И ДанныеБУ.ЭтоСобственныеОС
	|ГДЕ
	|	СтоимостьОбъектовОС.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОбъектовОС.Регистратор,
	|	СтоимостьОбъектовОС.ОсновноеСредство
	|ИТОГИ
	|ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОС.Регистратор КАК Регистратор,
	|	СтоимостьОбъектовОС.ОсновноеСредство КАК ОсновноеСредство
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам КАК СтоимостьОбъектовОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеБУ КАК ДанныеБУ
	|		ПО ДанныеБУ.Регистратор = СтоимостьОбъектовОС.Регистратор
	|		И ДанныеБУ.ОсновноеСредство = СтоимостьОбъектовОС.ОсновноеСредство
	|		И НЕ ДанныеБУ.ЭтоСобственныеОС
	|ГДЕ
	|	СтоимостьОбъектовОС.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОбъектовОС.Регистратор,
	|	СтоимостьОбъектовОС.ОсновноеСредство
	|ИТОГИ
	|ПО
	|	Регистратор";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Счета", Счета);

	ГруппыУчетаПоПодразделениям = ПланыСчетов.ЕПСБУ.ГруппыУчетаПоПодразделениям();
	СчетаДляРН_СтоимостьОС = Новый Массив;
	ГруппыСчетовДляРН_СтоимостьОбъектовОС = Новый Массив;
	ГруппыСчетовДляРН_СтоимостьОбъектовОС.Добавить("ОС");
	ГруппыСчетовДляРН_СтоимостьОбъектовОС.Добавить("НПА");
	ГруппыСчетовДляРН_СтоимостьОбъектовОС.Добавить("ИК");
	Для каждого Группа из ГруппыСчетовДляРН_СтоимостьОбъектовОС Цикл
		ТекСтрока = ГруппыУчетаПоПодразделениям.Найти(Группа, "Имя");
		Если ТекСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		Для каждого ТекСчет из ТекСтрока.Счета Цикл
			СчетаДляРН_СтоимостьОС.Добавить(ТекСчет);
		КонецЦикла;	
	КонецЦикла;
	Запрос.УстановитьПараметр("СчетаДляРН_СтоимостьОС", СчетаДляРН_СтоимостьОС);
	Запрос.УстановитьПараметр("СубконтоОС", ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	
	СчетаДляРН_СтоимостьОСпоКонтрагентам = БухгалтерскийУчет.СписокСчетов("02, 01, 24, 25, 26, 27");
	Запрос.УстановитьПараметр("СчетаДляРН_СтоимостьОСпоКонтрагентам", СчетаДляРН_СтоимостьОСпоКонтрагентам);
	Результат = Запрос.ВыполнитьПакет();
	
	Для Сч = 3 По 4 Цикл
		ИмяРегистра = ?(Сч = 3, "СтоимостьОбъектовОС", "СтоимостьОбъектовОСПоКонтрагентам");
		Дерево = Результат[Сч].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		Для каждого СтрокаРегистратор из Дерево.Строки Цикл
			НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(СтрокаРегистратор.Регистратор);
			НаборЗаписей.Прочитать();
			
			ЕстьЗапись = Ложь;
			Для Каждого Запись Из НаборЗаписей Цикл
				Если СтрокаРегистратор.Строки.Найти(
					Запись.ОсновноеСредство, "ОсновноеСредство", Ложь) = Неопределено Тогда
					Продолжить;
				КонецЕсли;	
				
				Запись.Подразделение = Справочники.Подразделения.ПустаяСсылка();
				ЕстьЗапись = Истина;
			КонецЦикла; 
			
			Если ЕстьЗапись Тогда
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Устарела.
// Процедура используется в правилах переноса БГУ1-БГУ2
//
Процедура ДобавитьДвиженияПоОперативномуУчету(ДокументСсылка) Экспорт
	
	ДополнительныеСвойства = Новый Структура("ТаблицыДляДвижений", Новый Структура);
	ИмяДокумента = ДокументСсылка.Метаданные().Имя;
	Документы[ИмяДокумента].ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства);
	
	Таблица = Неопределено;
	ДополнительныеСвойства.ТаблицыДляДвижений.Свойство("СтоимостьОбъектовОС", Таблица);
	Если Таблица = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиПо21 = Таблица.НайтиСтроки(Новый Структура("ВидРаспоряжения", Перечисления.ВидыРаспоряженияОС.ОперативныйУчет));
	Если СтрокиПо21.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыНакопления.СтоимостьОбъектовОС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписей.Прочитать();
	
	СтарыеЗаписи = Новый Массив;
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись.ВидРаспоряжения = Перечисления.ВидыРаспоряженияОС.ОперативныйУчет Тогда
			СтарыеЗаписи.Добавить(Запись);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтараяЗапись Из СтарыеЗаписи Цикл
		НаборЗаписей.Удалить(СтараяЗапись);
	КонецЦикла;
	
	Период = Неопределено;
	Для Каждого Строка21 Из СтрокиПо21 Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Строка21);
		Если Не ЗначениеЗаполнено(НоваяЗапись.Период) Тогда
			Если Период = Неопределено Тогда
				Период = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Дата");
			КонецЕсли;
			НоваяЗапись.Период = Период;
		КонецЕсли;
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	// Регистрация данных к обработке не производится. Все данные выбираются в обработчике
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтоимостьОбъектовОС.Регистратор КАК Регистратор,
	|	ВЫРАЗИТЬ(СтоимостьОбъектовОС.Регистратор КАК Документ.ПринятиеКУчетуОбъектовОС).ВидПоступления КАК ВидПоступления
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС КАК СтоимостьОбъектовОС
	|ГДЕ
	|	СтоимостьОбъектовОС.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОбъектовОС
	|	И СтоимостьОбъектовОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтоимостьОбъектовОС.Регистратор,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс)
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС КАК СтоимостьОбъектовОС
	|ГДЕ
	|	СтоимостьОбъектовОС.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОбъектовИК
	|	И СтоимостьОбъектовОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтоимостьОбъектовОС.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС КАК СтоимостьОбъектовОС
	|ГДЕ
	|	СтоимостьОбъектовОС.Регистратор ССЫЛКА Документ.НакладнаяНаВнутреннееПеремещениеОС2
	|	И СтоимостьОбъектовОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтоимостьОбъектовОС.Регистратор
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС КАК СтоимостьОбъектовОС
	|ГДЕ
	|	СтоимостьОбъектовОС.Регистратор ССЫЛКА Документ.ВнутреннееПеремещениеИК
	|	И СтоимостьОбъектовОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПустаяСсылка)";
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Принятие к учету ОС, НМА, НПА и ИК
	
	Выборка = Результат[0].Выбрать();
	
	ОперацииПоступления = Новый Массив;
	ОперацииПоступления.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение);
	ОперацииПоступления.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление);
	ОперацииПоступления.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс);
	ОперацииПоступления.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21);
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыНакопления.СтоимостьОбъектовОС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		
		ЭтоПоступление = (ОперацииПоступления.Найти(Выборка.ВидПоступления) <> Неопределено);
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Не ЗначениеЗаполнено(Запись.Событие) Тогда
				Если ЭтоПоступление Тогда
					Запись.Событие = ?(Запись.ВидДвижения = ВидДвиженияНакопления.Приход,
						Перечисления.ВидыСобытийОС.ПринятиеКУчету, Перечисления.ВидыСобытийОС.Списание);
				Иначе
					Запись.Событие = Перечисления.ВидыСобытийОС.ВнутреннееПеремещение;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
	КонецЦикла;
	
	// Внутреннее перемещение ОС, НМА, НПА и ИК
	
	Выборка = Результат[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыНакопления.СтоимостьОбъектовОС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Не ЗначениеЗаполнено(Запись.Событие)Тогда
				Запись.Событие = Перечисления.ВидыСобытийОС.ВнутреннееПеремещение;
			КонецЕсли;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры


Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию2(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктКонсервацииРасконсервации.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.АктКонсервацииРасконсервации КАК АктКонсервацииРасконсервации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОбъектовОС КАК СтоимостьОбъектовОС
	|		ПО АктКонсервацииРасконсервации.Ссылка = СтоимостьОбъектовОС.Регистратор
	|			И (СтоимостьОбъектовОС.НомерСтроки = 1)
	|ГДЕ
	|	(ВЫРАЗИТЬ(АктКонсервацииРасконсервации.Причина КАК СТРОКА(100))) <> """"
	|	И СтоимостьОбъектовОС.Причина = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонсервацияОС.Ссылка
	|ИЗ
	|	Документ.КонсервацияОС КАК КонсервацияОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОбъектовОС КАК СтоимостьОбъектовОС
	|		ПО КонсервацияОС.Ссылка = СтоимостьОбъектовОС.Регистратор
	|			И (СтоимостьОбъектовОС.НомерСтроки = 1)
	|ГДЕ
	|	(ВЫРАЗИТЬ(КонсервацияОС.Причина КАК СТРОКА(100))) <> """"
	|	И СтоимостьОбъектовОС.Причина = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонсервацияИК.Ссылка
	|ИЗ
	|	Документ.КонсервацияИК КАК КонсервацияИК
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОбъектовОС КАК СтоимостьОбъектовОС
	|		ПО КонсервацияИК.Ссылка = СтоимостьОбъектовОС.Регистратор
	|			И (СтоимостьОбъектовОС.НомерСтроки = 1)
	|ГДЕ
	|	(ВЫРАЗИТЬ(КонсервацияИК.Причина КАК СТРОКА(100))) <> """"
	|	И СтоимостьОбъектовОС.Причина = """"";
	
	Данные = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Данные, "РегистрНакопления.СтоимостьОбъектовОС");
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию2(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.СтоимостьОбъектовОС";
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьРегистраторыРегистраДляОбработки(Параметры.Очередь,, ПолноеИмяРегистра);
	
	Регистры = Новый Массив;
	Регистры.Добавить(ПолноеИмяРегистра);
	
	Пока Выборка.Следующий() Цикл
		
		ПроведениеСервер.ОтразитьДвиженияДокументаПоРегистрамОтложенно(Выборка.Регистратор, Регистры);
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли