
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Организация", ОтборОрганизация);
	Параметры.Свойство("ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения);
	Параметры.Свойство("НаДату", ДатаСреза);
	
	Если Не ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ОтборОрганизация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаСреза) Тогда
		ДатаСреза = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	
	ОтборВозрастНаДату = НачалоДня(ТекущаяДатаСеанса());
	
	РежимИзмененияПараметровКоменсации = "ИзменениеПараметров";
	УстановитьЗаголовки(ЭтотОбъект);
	УстановитьВидимостьЭлементовИзмененияПараметровКомпенсации(ЭтотОбъект);
	УстановитьДоступностьОтборовПоПериоду(ЭтотОбъект);
	УстановитьСвернутыйЗаголовокГруппыОтборПериод(ЭтотОбъект);
	УстановитьТолькоПросмотрКолонокИзмененияПараметровКомпенсации(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтотОбъект.ПодключитьОбработчикОжидания("ФормаОткрыта", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВопросОбОчисткеТЧ(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбработкаВидимостиЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДетскогоУчрежденияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВопросОбОчисткеТЧ(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДетскогоУчрежденияОснПриИзменении(Элемент)
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	ЗаполнитьЗначениями(Элемент.Имя, ТекущаяТЧ);
КонецПроцедуры

&НаКлиенте
Процедура СтавкаОплатыОснПриИзменении(Элемент)
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	ЗаполнитьЗначениями(Элемент.Имя, ТекущаяТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЛьготаОснПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Льгота) Тогда
		ЛьготаПустоеЗначение = Ложь;
	КонецЕсли;	
	
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	ЗаполнитьЗначениями(Элемент.Имя, ТекущаяТЧ);
	ЗаполнитьЗначениями("ЛьготаПустоеЗначение", ТекущаяТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЛьготаПустоеЗначение_ОснПриИзменении(Элемент)
	
	Если ЛьготаПустоеЗначение = Истина Тогда
		Льгота = Неопределено;
	КонецЕсли;
	
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	ЗаполнитьЗначениями(Элемент.Имя, ТекущаяТЧ);
	ЗаполнитьЗначениями("Льгота_Осн", ТекущаяТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура АктуальностьОснПриИзменении(Элемент)
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	ЗаполнитьЗначениями(Элемент.Имя, ТекущаяТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДетскогоУчрежденияДопПриИзменении(Элемент)
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	ЗаполнитьЗначениями(Элемент.Имя, ТекущаяТЧ);
КонецПроцедуры

&НаКлиенте
Процедура СтавкаОплатыДопПриИзменении(Элемент)
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	ЗаполнитьЗначениями(Элемент.Имя, ТекущаяТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ЛьготаДопПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Льгота) Тогда
		ЛьготаПустоеЗначение = Ложь;
	КонецЕсли;	
	
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	ЗаполнитьЗначениями(Элемент.Имя, ТекущаяТЧ);
	ЗаполнитьЗначениями("ЛьготаПустоеЗначение", ТекущаяТЧ);

КонецПроцедуры

&НаКлиенте
Процедура ЛьготаПустоеЗначение_ДопПриИзменении(Элемент)
	
	Если ЛьготаПустоеЗначение = Истина Тогда
		Льгота = Неопределено;
	КонецЕсли;
	
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	ЗаполнитьЗначениями(Элемент.Имя, ТекущаяТЧ);
	ЗаполнитьЗначениями("Льгота_Доп", ТекущаяТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура АктуальностьДопПриИзменении(Элемент)
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	ЗаполнитьЗначениями(Элемент.Имя, ТекущаяТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ДатаВступленияВСилу1ПриИзменении(Элемент)
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	ЗаполнитьЗначениями(Элемент.Имя, ТекущаяТЧ);
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	ВыбратьРежимРаботы();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаКомпенсацииПриИзменении(Элемент)
	Если ЗначениеЗаполнено(СтавкаКомпенсацииНовая) Тогда
		ЗаполнитьКолонкуЗначениями("ПараметрыКомпенсацииПоДетям", "СтавкаКомпенсацииНовая", СтавкаКомпенсацииНовая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКомпенсацииДатаНачалаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ДатаНачалаНовая) Тогда
		ЗаполнитьКолонкуЗначениями("ПараметрыКомпенсацииПоДетям", "ДатаНачалаНовая", ДатаНачалаНовая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКомпенсацииДатаОкончанияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ДатаОкончанияНовая) Тогда
		ЗаполнитьКолонкуЗначениями("ПараметрыКомпенсацииПоДетям", "ДатаОкончанияНовая", ДатаОкончанияНовая);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборНастройкаКомпенсацииПриИзменении(Элемент)
	ИспользоватьОтборТекущаяНастройкаКомпенсации = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтавкаКомпенсацииПриИзменении(Элемент)
	ИспользоватьОтборТекущаяСтавкаКомпенсации = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаНачалаПриИзменении(Элемент)
	ИспользоватьОтборДатаНачала = ЗначениеЗаполнено(ОтборДатаНачала);
	УстановитьСвернутыйЗаголовокГруппыОтборПериод(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаОкончанияПриИзменении(Элемент)
	ИспользоватьОтборДатаОкончания = Истина;
	УстановитьСвернутыйЗаголовокГруппыОтборПериод(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РежимИзмененияПараметровКоменсацииПриИзменении(Элемент)
	УстановитьВидимостьЭлементовИзмененияПараметровКомпенсации(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКомпенсацииНовая1ПриИзменении(Элемент)
	ПриИзмененииНовогоПараметраКомпенсации(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкуКомпенсацииПриИзменении(Элемент)
	ПриИзмененииНовогоПараметраКомпенсации(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СтавкаКомпенсацииНовая1ПриИзменении(Элемент)
	ПриИзмененииНовогоПараметраКомпенсации(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтавкуКомпенсацииПриИзменении(Элемент)
	ПриИзмененииНовогоПараметраКомпенсации(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаНовая1ПриИзменении(Элемент)
	ПриИзмененииНовогоПараметраКомпенсации(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуНачалаПриИзменении(Элемент)
	ПриИзмененииНовогоПараметраКомпенсации(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияНовая1ПриИзменении(Элемент)
	ПриИзмененииНовогоПараметраКомпенсации(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуОкончанияПриИзменении(Элемент)
	ПриИзмененииНовогоПараметраКомпенсации(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтбораКомпенсацииПоПериодуПриИзменении(Элемент)
	УстановитьДоступностьОтборовПоПериоду(ЭтотОбъект);
	УстановитьСвернутыйЗаголовокГруппыОтборПериод(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтбораКомпенсацииПоПериоду1ПриИзменении(Элемент)
	УстановитьДоступностьОтборовПоПериоду(ЭтотОбъект);
	УстановитьСвернутыйЗаголовокГруппыОтборПериод(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтбораКомпенсацииПоПериоду3ПриИзменении(Элемент)
	УстановитьДоступностьОтборовПоПериоду(ЭтотОбъект);
	УстановитьСвернутыйЗаголовокГруппыОтборПериод(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДатаСрезаПриИзменении(Элемент)
	УстановитьСвернутыйЗаголовокГруппыОтборПериод(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборДатаНачалаПриИзменении(Элемент)
	УстановитьСвернутыйЗаголовокГруппыОтборПериод(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборДатаОкончанияПриИзменении(Элемент)
	УстановитьСвернутыйЗаголовокГруппыОтборПериод(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяВидПриказаПриИзменении(Элемент)
	
	УстановитьВидимостьПоВидуПриказа();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставГруппДДУ

&НаКлиенте
Процедура СоставГруппДДУПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.СоставГруппДДУ.ТекущиеДанные;
		УстановитьЗаголовкиВСтроке(ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставГруппДДУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДобавитьСтрокуСоставаГруппВыборИзСправочника("СоставГруппДДУ", ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура СоставГруппДДУРебенокПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставГруппДДУ.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Ребенок) Тогда
		ЗаполнитьСоставГрупп("СоставГруппДДУ", ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставГруппДДУДополнительныеУслуги

&НаКлиенте
Процедура СоставГруппДДУДополнительныеУслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.СоставГруппДДУДополнительныеУслуги.ТекущиеДанные;
		УстановитьЗаголовкиВСтроке(ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставГруппДДУДополнительныеУслугиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДобавитьСтрокуСоставаГруппВыборИзСправочника("СоставГруппДДУДополнительныеУслуги", ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура СоставГруппДДУДополнительныеУслугиРебенокПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставГруппДДУДополнительныеУслуги.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Ребенок) Тогда
		ЗаполнитьСоставГрупп("СоставГруппДДУДополнительныеУслуги", ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыКомпенсацииПоДетям

&НаКлиенте
Процедура ПараметрыКомпенсацииПоДетямОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		НоваяСтрока = ПараметрыКомпенсацииПоДетям.Добавить();
		НоваяСтрока.Пометка = Истина;
		УстановитьЗаголовкиВСтроке(НоваяСтрока);
		НоваяСтрока.Ребенок = ВыбранноеЗначение;
		ЗаполнитьПараметрыКомпенсации(НоваяСтрока.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКомпенсацииПоДетямРебенокПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПараметрыКомпенсацииПоДетям.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Ребенок) Тогда
		ЗаполнитьПараметрыКомпенсации(ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыКомпенсацииПоДетямПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.ПараметрыКомпенсацииПоДетям.ТекущиеДанные;
		УстановитьЗаголовкиВСтроке(ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметрыПлательщиков

&НаКлиенте
Процедура ПараметрыПлательщиковОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		НоваяСтрока = ПараметрыПлательщиков.Добавить();
		УстановитьЗаголовкиВСтроке(НоваяСтрока);
		НоваяСтрока.Ребенок = ВыбранноеЗначение;
		НоваяСтрока.Организация = ОтборОрганизация;
		ЗаполнитьПараметрыПлательщиков(ВыбранноеЗначение, Ложь, НоваяСтрока.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПлательщиковПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.ПараметрыПлательщиков.ТекущиеДанные;
		УстановитьЗаголовкиВСтроке(ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПлательщиковРебенокПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыПлательщиков.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Ребенок) Тогда
		ЗаполнитьПараметрыПлательщиков(ТекущиеДанные.Ребенок, Ложь, ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПлательщиковПлательщикНовыйПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыПлательщиков.ТекущиеДанные;
	УстановитьПризнакиПризаполненииПлательщиков(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПлательщиковСчетПлательщикаНовыйПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПараметрыПлательщиков.ТекущиеДанные;
	УстановитьПризнакиПризаполненииПлательщиков(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыбытиеДетей

&НаКлиенте
Процедура ВыбытиеДетейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ЗаполнитьВыбытиеДетей(ВыбранноеЗначение, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбытиеДетейРебенокПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВыбытиеДетей.ТекущиеДанные;
	ИндексСтроки = ВыбытиеДетей.Индекс(ТекущиеДанные);
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Ребенок) Тогда
		ЗаполнитьВыбытиеДетей(ТекущиеДанные.Ребенок, Ложь, ИндексСтроки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Если РежимРаботыПомощника = РежимИзменениеПараметровОсновнойПрограммы() Тогда
		ЗаполнитьСоставГрупп("СоставГруппДДУ");
	ИначеЕсли РежимРаботыПомощника = РежимИзменениеПараметровДополнительнойПрограммы() Тогда
		ЗаполнитьСоставГрупп("СоставГруппДДУДополнительныеУслуги");
	ИначеЕсли РежимРаботыПомощника = РежимИзменениеПараметровКомпенсации() Тогда
		ЗаполнитьПараметрыКомпенсации();
	ИначеЕсли РежимРаботыПомощника = РежимВыбытиеДетей() Тогда
		ЗаполнитьВыбытиеДетей();
	ИначеЕсли РежимРаботыПомощника = РежимВыбытиеДетейСЗачислениемВУчащихся() Тогда
		ЗаполнитьВыбытиеДетей();
	ИначеЕсли РежимРаботыПомощника = РежимИзменениеПараметровПлательщиков() Тогда
		ЗаполнитьПараметрыПлательщиков();	
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не известный режим: %1'"), РежимРаботыПомощника);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("Организация", ОтборОрганизация);
	ПараметрыФормы.Вставить("ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения);
	ПараметрыФормы.Вставить("НаДату", НачалоДня(ДатаСреза));
	
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	Если РежимРаботыПомощника = РежимИзменениеПараметровДополнительнойПрограммы() Тогда
		ОткрытьФорму("Справочник.Дети.Форма.ФормаВыбораДопУслуги", ПараметрыФормы, Элементы[ТекущаяТЧ]);
	Иначе
		ОткрытьФорму("Справочник.Дети.Форма.ФормаВыбора", ПараметрыФормы, Элементы[ТекущаяТЧ]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборРежимаРаботы(Команда)
	ВыбратьРежимРаботы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	ИзменитьПометки(ОпределитьТекущуюТаблицу(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	ИзменитьПометки(ОпределитьТекущуюТаблицу(), Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиВыделенныеСтроки(Команда)
	ИзменитьПометки(ОпределитьТекущуюТаблицу(), Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиВыделенныеСтроки(Команда)
	ИзменитьПометки(ОпределитьТекущуюТаблицу(), Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	Отказ = Ложь;
	
	ТекущаяТЧ = ОпределитьТекущуюТаблицу();
	
	Если ЭтотОбъект[ТекущаяТЧ].Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить табличную часть для изменений'"));
		Возврат;
	КонецЕсли;

	Если НЕ ОбязательныеРеквизитыЗаполнены() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатОбработки = Новый Массив;
	
	Если РежимРаботыПомощника = РежимИзменениеПараметровОсновнойПрограммы() Тогда
		ИзменитьСоставГрупп("СоставГруппДДУ", Отказ, РезультатОбработки);
	ИначеЕсли РежимРаботыПомощника = РежимИзменениеПараметровДополнительнойПрограммы() Тогда
		ИзменитьСоставГрупп("СоставГруппДДУДополнительныеУслуги", Отказ, РезультатОбработки);
	ИначеЕсли РежимРаботыПомощника = РежимИзменениеПараметровКомпенсации() Тогда
		ИзменитьПараметрыКомпенсации(Отказ, РезультатОбработки);
	ИначеЕсли РежимРаботыПомощника = РежимИзменениеПараметровПлательщиков() Тогда
		ИзменитьПараметрыПлательщиков(Отказ, РезультатОбработки);	
	ИначеЕсли РежимРаботыПомощника = РежимВыбытиеДетей() Тогда
		ОформитьВыбытиеДетей(Ложь, Отказ, РезультатОбработки);
	ИначеЕсли РежимРаботыПомощника = РежимВыбытиеДетейСЗачислениемВУчащихся() Тогда
		Если НЕ ОбязательныеРеквизитыУчащиесяЗаполнены() Тогда
			Возврат;
		КонецЕсли;				
		ОформитьВыбытиеДетей(Истина, Отказ, РезультатОбработки);
	Иначе
		ВызватьИсключение ТекстНеПравильныйРежимРаботыПомощника();
	КонецЕсли;
	
	Если Отказ Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не удалось записать изменения по причине:
			|%1'"), СтрСоединить(РезультатОбработки)));
		ПоказатьПредупреждение(, НСтр("ru = 'При выполнении возникли ошибки'"), , "Ошибка");
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru='Изменены параметры детей'"), ,
			НСтр("ru='Изменения учетных параметров детей успешно записаны'"),
			БиблиотекаКартинок.Обновлено);
		Оповестить("ИзменениеСоставаГруппДДУДополнительныеУслуги");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	Оповещение = Новый ОписаниеОповещения("ОбработатьВводДатыСреза", ЭтотОбъект);
	ПоказатьВводДаты(Оповещение, ДатаСреза, НСтр("ru='Введите дату'"), ЧастиДаты.Дата);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьУспешные(Команда)
	УдалитьСтроки(ОпределитьТекущуюТаблицу(), ВариантУдаленияУспешные());
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОшибочные(Команда)
	УдалитьСтроки(ОпределитьТекущуюТаблицу(), ВариантУдаленияОшибочные());
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыделенныеСтроки(Команда)
	УдалитьСтроки(ОпределитьТекущуюТаблицу(), ВариантУдаленияВыделенныеСтроки());
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	УдалитьСтроки(ОпределитьТекущуюТаблицу(), ВариантУдаленияВсе());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ВыборРежимаРаботы(РежимРаботы, ДополнительныеПараметры) Экспорт
	РежимРаботыПомощника = ?(РежимРаботы = Неопределено, РежимРаботыПомощника, РежимРаботы);
	
	Если НЕ ЗначениеЗаполнено(РежимРаботыПомощника) Тогда
		УстановитьДоступностьОтборов(Ложь);
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЗаставка;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияРежимРаботы",
			"Видимость", Ложь);

		Возврат;
	КонецЕсли;
	
	Если РежимРаботыПомощника = РежимИзменениеПараметровОсновнойПрограммы() Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСоставГруппДДУ;
		ЗаголовокРежимаРаботы = НСтр("ru='Изменение параметров по основной образовательной программе'");
		Актуальность = Истина;
	ИначеЕсли РежимРаботыПомощника = РежимИзменениеПараметровДополнительнойПрограммы() Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСоставГруппДДУДопУслуги;
		ЗаголовокРежимаРаботы = НСтр("ru='Изменение параметров по дополнительным образовательным программам'");
		Актуальность = Истина;
	ИначеЕсли РежимРаботыПомощника = РежимИзменениеПараметровКомпенсации() Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПараметрыКомпенсации;
		ЗаголовокРежимаРаботы = НСтр("ru='Изменение параметров компенсации'");
		Актуальность = Ложь;
	ИначеЕсли РежимРаботыПомощника = РежимВыбытиеДетей() Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыбытиеИзУчреждения;
		ЗаголовокРежимаРаботы = НСтр("ru='Выбытие детей из дошкольного учреждения'");
		Элементы.ГруппаЗачислениеУчащихся.Видимость = Ложь;
		Элементы.ВыбытиеДетейСтудент.Видимость = Ложь;
		Элементы.ПриказОбразование.Видимость = Ложь;
		Актуальность = Ложь;
	ИначеЕсли РежимРаботыПомощника = РежимВыбытиеДетейСЗачислениемВУчащихся() Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыбытиеИзУчреждения;
		ЗаголовокРежимаРаботы = НСтр("ru='Выбытие детей из дошкольного учреждения с зачислением учащихся'");
		Элементы.ГруппаЗачислениеУчащихся.Видимость = Истина;
		Элементы.ВыбытиеДетейСтудент.Видимость = Истина;
		Элементы.ПриказОбразование.Видимость = Истина;
		УстановитьВидимостьПоВидуПриказа();
		Актуальность = Ложь;	
	ИначеЕсли РежимРаботыПомощника = РежимИзменениеПараметровПлательщиков() Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПараметрыПлательщиков;
		ЗаголовокРежимаРаботы = НСтр("ru='Изменение параметров плательщиков'");
		Актуальность = Ложь;	
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не известный режим: %1'"), РежимРаботыПомощника);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияРежимРаботы",
		"Видимость", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияРежимРаботы", "Заголовок",
		СтрШаблон(НСтр("ru = 'Режим работы: %1'"), ЗаголовокРежимаРаботы));
	УстановитьДоступностьОтборов(Истина);
	ОбработкаВидимостиЭлементов();
	ОчиститьРеквизиты();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьОтборов(ЗначениеОтбора)
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		СтрРазделить("ОтборГруппаДетскогоУчреждения,ОтборОрганизация,ОтборГруппаСправочникДети,ОтборСтавкаОплаты,ГруппаОтборВозрастРебенка", ","),
		"Доступность",
		ЗначениеОтбора);
КонецПроцедуры

&НаКлиенте
Процедура ОтветВопросаОбОчисткеТЧ(Ответ, ДопПараметры) Экспорт
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	Если ДопПараметры.Владелец.Имя = "ОтборОрганизация" Тогда
		ИмяФормыВыбора = "Справочник.Организации.ФормаВыбора";
	ИначеЕсли ДопПараметры.Владелец.Имя = "ОтборГруппаДетскогоУчреждения" Тогда
		ИмяФормыВыбора = "Справочник.ГруппыДетскогоУчреждения.ФормаВыбора";
		ПараметрыФормы.Вставить("Владелец", ОтборОрганизация);
	Иначе
		Возврат;
	КонецЕсли;
	
	ДопПараметры.ТекущаяТЧ.Очистить();
	
	ОткрытьФорму(ИмяФормыВыбора, ПараметрыФормы, ДопПараметры.Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводДатыСреза(Дата, Параметры) Экспорт
	Если Дата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСреза = НачалоДня(Дата);
	УстановитьЗаголовки(ЭтотОбъект);
	УстановитьСвернутыйЗаголовокГруппыОтборПериод(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПриИзмененииНовогоПараметраКомпенсации(Элемент)

	ИмяЭлемента = Элемент.Имя;
	
	Если ИмяЭлемента = "НастройкаКомпенсацииНовая1" Тогда
		УстановитьНастройкуКомпенсации = Истина;
		ИмяЭлемента = "УстановитьНастройкуКомпенсации";
	ИначеЕсли ИмяЭлемента = "СтавкаКомпенсацииНовая1" Тогда
		УстановитьСтавкуКомпенсации = Истина;
		ИмяЭлемента = "УстановитьСтавкуКомпенсации";
	ИначеЕсли ИмяЭлемента = "ДатаНачалаНовая1" Тогда
		УстановитьДатуНачала = ЗначениеЗаполнено(ДатаНачалаНовая);
		ИмяЭлемента = "УстановитьДатуНачала";
	ИначеЕсли ИмяЭлемента = "ДатаОкончанияНовая1" Тогда
		УстановитьДатуОкончания = Истина;
		ИмяЭлемента = "УстановитьДатуОкончания";
	КонецЕсли;
	
	Если ИмяЭлемента = "УстановитьНастройкуКомпенсации" Тогда
		ЗаполнитьКолонкуЗначениями("ПараметрыКомпенсацииПоДетям", "НастройкаКомпенсации", НастройкаКомпенсацииНовая, УстановитьНастройкуКомпенсации);
	ИначеЕсли ИмяЭлемента = "УстановитьСтавкуКомпенсации" Тогда
		ЗаполнитьКолонкуЗначениями("ПараметрыКомпенсацииПоДетям", "СтавкаКомпенсацииНовая", СтавкаКомпенсацииНовая, УстановитьСтавкуКомпенсации);
	ИначеЕсли ИмяЭлемента = "УстановитьДатуНачала" Тогда
		ЗаполнитьКолонкуЗначениями("ПараметрыКомпенсацииПоДетям", "ДатаНачалаНовая", ДатаНачалаНовая, УстановитьДатуНачала);
	ИначеЕсли ИмяЭлемента = "УстановитьДатуОкончания" Тогда
		ЗаполнитьКолонкуЗначениями("ПараметрыКомпенсацииПоДетям", "ДатаОкончанияНовая", ДатаОкончанияНовая, УстановитьДатуОкончания);
	КонецЕсли;
	
	УстановитьТолькоПросмотрКолонокИзмененияПараметровКомпенсации(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТолькоПросмотрКолонокИзмененияПараметровКомпенсации(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ПараметрыКомпенсацииПоДетямСтавкаКомпенсацииНовая",
		"ТолькоПросмотр", НЕ Форма.УстановитьСтавкуКомпенсации);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ПараметрыКомпенсацииПоДетямДатаНачалаНовая",
		"ТолькоПросмотр", НЕ Форма.УстановитьДатуНачала);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ПараметрыКомпенсацииПоДетямДатаОкончанияНовая",
		"ТолькоПросмотр", НЕ Форма.УстановитьДатуОкончания);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвернутыйЗаголовокГруппыОтборПериод(Форма)
	
	Если ВариантОтбораКомпенсацииПоПериодуНаДату(Форма) Тогда
		СвернутыйЗаголовок = СтрШаблон(НСтр("ru = 'на %1'"), Формат(Форма.ДатаСреза, "ДЛФ=DD;"));
	ИначеЕсли ВариантОтбораКомпенсацииПоПериодуТочноеСоответствие(Форма) Тогда
		СоставЗаголовка = Новый Массив;
		Если Форма.ИспользоватьОтборДатаНачала Тогда
			Шаблон = НСтр("ru = 'дата начала: %1'");
			Если ЗначениеЗаполнено(Форма.ОтборДатаНачала) Тогда
				ТекстДата = Формат(Форма.ОтборДатаНачала, "ДЛФ=D;");
			Иначе
				ТекстДата = НСтр("ru = 'не указана'");
			КонецЕсли;
			СоставЗаголовка.Добавить(СтрШаблон(Шаблон, ТекстДата));
		КонецЕсли;
		Если Форма.ИспользоватьОтборДатаОкончания Тогда
			Шаблон = НСтр("ru = 'дата окончания: %1'");
			Если ЗначениеЗаполнено(Форма.ОтборДатаОкончания) Тогда
				ТекстДата = Формат(Форма.ОтборДатаОкончания, "ДЛФ=D;");
			Иначе
				ТекстДата = НСтр("ru = 'без ограничения'");
			КонецЕсли;
			СоставЗаголовка.Добавить(СтрШаблон(Шаблон, ТекстДата));
		КонецЕсли;
		СвернутыйЗаголовок = СтрСоединить(СоставЗаголовка, ", ");
	ИначеЕсли ВариантОтбораКомпенсацииПоПериодуВсеПериоды(Форма) Тогда
		СвернутыйЗаголовок = НСтр("ru = 'Выводятся записи всех периодов'");
	Иначе
		ВызватьИсключение НСтр("ru = 'Не известный вариант отбора компенсации по периоду'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"Группа17",
		"ЗаголовокСвернутогоОтображения",
		СтрШаблон(НСтр("ru = '%1: %2'"),
			ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Форма.Элементы, "Группа17", "Заголовок"),
			СвернутыйЗаголовок));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьОтборовПоПериоду(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДатаСреза",
		"Доступность",
		ВариантОтбораКомпенсацииПоПериодуНаДату(Форма));
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ИспользоватьОтборДатаНачала");
	ИменаЭлементов.Добавить("ОтборДатаНачала");
	ИменаЭлементов.Добавить("ИспользоватьОтборДатаОкончания");
	ИменаЭлементов.Добавить("ОтборДатаОкончания");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Форма.Элементы,
		ИменаЭлементов,
		"Доступность",
		ВариантОтбораКомпенсацииПоПериодуТочноеСоответствие(Форма));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовИзмененияПараметровКомпенсации(Форма)
	
	ИменаЭлементовДобавления = Новый Массив;
	ИменаЭлементовДобавления.Добавить("НастройкаКомпенсацииНовая");
	ИменаЭлементовДобавления.Добавить("СтавкаКомпенсацииНовая");
	ИменаЭлементовДобавления.Добавить("ДатаНачалаНовая");
	ИменаЭлементовДобавления.Добавить("ДатаОкончанияНовая");
	
	ИменаЭлементовИзменения = Новый Массив;
	ИменаЭлементовИзменения.Добавить("НастройкаКомпенсацииНовая1");
	ИменаЭлементовИзменения.Добавить("УстановитьНастройкуКомпенсации");
	ИменаЭлементовИзменения.Добавить("СтавкаКомпенсацииНовая1");
	ИменаЭлементовИзменения.Добавить("УстановитьСтавкуКомпенсации");
	ИменаЭлементовИзменения.Добавить("ДатаНачалаНовая1");
	ИменаЭлементовИзменения.Добавить("УстановитьДатуНачала");
	ИменаЭлементовИзменения.Добавить("ДатаОкончанияНовая1");
	ИменаЭлементовИзменения.Добавить("УстановитьДатуОкончания");
	
	ЭтоИзменениеПараметров = ВыбранРежимИзменениеПараметровКомпенсации(Форма);
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Форма.Элементы,
		ИменаЭлементовДобавления,
		"Видимость",
		Не ЭтоИзменениеПараметров);
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Форма.Элементы,
		ИменаЭлементовИзменения,
		"Видимость",
		ЭтоИзменениеПараметров);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВыбранРежимИзменениеПараметровКомпенсации(Форма)
	Возврат Форма.РежимИзмененияПараметровКоменсации = "ИзменениеПараметров";
КонецФункции

&НаСервере
Процедура ИзменитьПометки(ИмяТЧ, ЗначениеФлажка, ТолькоВыделенныеСтроки = Ложь)
	Если ТолькоВыделенныеСтроки Тогда
		Для Каждого Идентификатор Из Элементы[ИмяТЧ].ВыделенныеСтроки Цикл
			ЭтотОбъект[ИмяТЧ].НайтиПоИдентификатору(Идентификатор).Пометка = ЗначениеФлажка;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ЭтотОбъект[ИмяТЧ] Цикл
			Строка.Пометка = ЗначениеФлажка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроки(ИмяТЧ, ВариантУдаления)
	
	ТекущаяТаблица = ЭтотОбъект[ИмяТЧ];
	
	Если ВариантУдаления = ВариантУдаленияВсе() Тогда
		ТекущаяТаблица.Очистить();
	Иначе
		
		Если ВариантУдаления = ВариантУдаленияВыделенныеСтроки() Тогда
			УдаляемыеСтроки = Новый Массив;
			Для Каждого Идентификатор Из Элементы[ИмяТЧ].ВыделенныеСтроки Цикл
				УдаляемыеСтроки.Добавить(ТекущаяТаблица.НайтиПоИдентификатору(Идентификатор));
			КонецЦикла;
		Иначе
			Если ВариантУдаления = ВариантУдаленияУспешные() Тогда
				Отбор = Новый Структура("СтрокаОбработана", Истина);
			Иначе
				Отбор = Новый Структура("ОшибкаОбработки", Истина);
			КонецЕсли;
			УдаляемыеСтроки = ТекущаяТаблица.НайтиСтроки(Отбор);
		КонецЕсли;
		
		Для Каждого Строка Из УдаляемыеСтроки Цикл
			ТекущаяТаблица.Удалить(Строка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВариантУдаленияУспешные()
	Возврат "Успешные";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВариантУдаленияОшибочные()
	Возврат "Ошибочные";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВариантУдаленияВыделенныеСтроки()
	Возврат "ВыделенныеСтроки";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВариантУдаленияВсе()
	Возврат "Все";
КонецФункции

&НаКлиенте
Процедура ВопросОбОчисткеТЧ(Элемент, СтандартнаяОбработка)
	ТекущаяТЧ = ЭтотОбъект[ОпределитьТекущуюТаблицу()];
	Если (ТекущаяТЧ <> Неопределено) И (ТекущаяТЧ.Количество() > 0) Тогда
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ОтветВопросаОбОчисткеТЧ",
			ЭтотОбъект,
			Новый Структура("ТекущаяТЧ, Владелец", ТекущаяТЧ, Элемент));
		ПоказатьВопрос(Оповещение,
			НСтр("ru = 'Таблица будет очищена.
				|Продолжить?'"),
			РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РежимИзменениеПараметровОсновнойПрограммы()
	Возврат "ПараметрыОсновнойПрограммы";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимИзменениеПараметровДополнительнойПрограммы()
	Возврат "ПараметрыДополнительнойПрограммы";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимИзменениеПараметровКомпенсации()
	Возврат "ПараметрыКомпенсации";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимИзменениеПараметровПлательщиков()
	Возврат "ПараметрыПлательщиков";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимВыбытиеДетей()
	Возврат "ВыбытиеДетей";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимВыбытиеДетейСЗачислениемВУчащихся()
	Возврат "ВыбытиеДетейСЗачислениемВУчащихся";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиВСтроке(Строка)
	Строка.ЗаголовокРеквизиты      = НСтр("ru = 'Старые параметры'");
	Строка.ЗаголовокРеквизитыНовые = НСтр("ru = 'Новые параметры'");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуСоставаГруппВыборИзСправочника(ИмяТЧ, ВыбранноеЗначение)

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
		И ВыбранноеЗначение.Свойство("Ребенок") Тогда
		
		Ребенок = ВыбранноеЗначение.Ребенок;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Дети") Тогда
		Ребенок = ВыбранноеЗначение;
	Иначе
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ЭтотОбъект[ИмяТЧ].Добавить();
	НоваяСтрока.Пометка = Истина;
	УстановитьЗаголовкиВСтроке(НоваяСтрока);
	НоваяСтрока.Ребенок = Ребенок;
	ЗаполнитьСоставГрупп(ИмяТЧ, НоваяСтрока.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Функция ДанныеДляЗаполненияСоставаГруппДДУ(ИмяТЧ, Ребенок)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Дети.Ссылка КАК Ребенок,
	|	Дети.Код КАК ЛицевойСчет,
	|	Дети.Контрагент КАК Контрагент,
	|	СоставГруппДДУ.ГруппаДетскогоУчреждения КАК ГруппаДетскогоУчреждения,
	|	СоставГруппДДУ.Льгота КАК Льгота,
	|	СоставГруппДДУ.СтавкаОплаты КАК СтавкаОплаты,
	|	СоставГруппДДУ.Договор КАК ДоговорКонтрагента,
	|	СоставГруппДДУ.Актуальность КАК Актуальность,
	|	&НоваяГруппа КАК ГруппаДетскогоУчрежденияНовый,
	|	&НоваяЛьгота КАК ЛьготаНовый,
	|	&НоваяСтавка КАК СтавкаОплатыНовый,
	|	&НоваяАктуальность КАК АктуальностьНовый,
	|	Дети.Организация КАК Организация
	|ИЗ
	|	Справочник.Дети КАК Дети
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппДДУ.СрезПоследних(&НаДату,) КАК СоставГруппДДУ
	|		ПО Дети.Ссылка = СоставГруппДДУ.Ребенок
	|ГДЕ
	|	&Условия";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"РегистрСведений.СоставГруппДДУ.",
		"РегистрСведений." + ИмяТЧ + ".");

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НаДату",            НачалоДня(ДатаСреза));
	Запрос.УстановитьПараметр("НоваяГруппа",       ГруппаДетскогоУчреждения);
	Запрос.УстановитьПараметр("НоваяЛьгота",       Льгота);
	Запрос.УстановитьПараметр("НоваяСтавка",       СтавкаОплаты);
	Запрос.УстановитьПараметр("НоваяАктуальность", Актуальность);

	Условия = Новый Массив;
	Условия.Добавить("(Дети.ДатаВыбытия = ДАТАВРЕМЯ(1,1,1,0,0,0) ИЛИ Дети.ДатаВыбытия > &НаДату)");
	Условия.Добавить("СоставГруппДДУ.Актуальность");
	
	Если Ребенок <> Неопределено И ТипЗнч(Ребенок) = Тип("СправочникСсылка.Дети") Тогда
		Условия.Добавить("Дети.Ссылка = &Ребенок");
		Запрос.УстановитьПараметр("Ребенок", Ребенок);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения) Тогда
		Условия.Добавить("СоставГруппДДУ.ГруппаДетскогоУчреждения = &ГруппаДетскогоУчреждения");
		Запрос.УстановитьПараметр("ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		Условия.Добавить("Дети.Организация = &Организация");
		Запрос.УстановитьПараметр("Организация", ОтборОрганизация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборГруппаСправочникДети) Тогда
		Условия.Добавить("Дети.Родитель = &ГруппаСправочникДети");
		Запрос.УстановитьПараметр("ГруппаСправочникДети", ОтборГруппаСправочникДети);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборСтавкаОплаты) Тогда
		Условия.Добавить("СоставГруппДДУ.СтавкаОплаты = &СтавкаОплаты");
		Запрос.УстановитьПараметр("СтавкаОплаты", ОтборСтавкаОплаты);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборВозраст) Тогда
		
		Условия.Добавить("Дети.Контрагент.ЮридическоеФизическоеЛицо.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)");
		ТекстУсловияВозраст = "ВЫБОР
			|КОГДА ДЕНЬГОДА(ДОБАВИТЬКДАТЕ(Дети.Контрагент.ЮридическоеФизическоеЛицо.ДатаРождения, ДЕНЬ, РАЗНОСТЬДАТ(Дети.Контрагент.ЮридическоеФизическоеЛицо.ДатаРождения, &НаДату, ДЕНЬ))) 
			|+ (ДЕНЬГОДА(КОНЕЦПЕРИОДА(Дети.Контрагент.ЮридическоеФизическоеЛицо.ДатаРождения, ГОД)) 
			|- ДЕНЬГОДА(Дети.Контрагент.ЮридическоеФизическоеЛицо.ДатаРождения)) >= ДЕНЬГОДА(КОНЕЦПЕРИОДА(&НаДату, ГОД))
			|	ТОГДА РАЗНОСТЬДАТ(Дети.Контрагент.ЮридическоеФизическоеЛицо.ДатаРождения, &НаДату, ГОД)
			|ИНАЧЕ РАЗНОСТЬДАТ(Дети.Контрагент.ЮридическоеФизическоеЛицо.ДатаРождения, &НаДату, ГОД) - 1
			|КОНЕЦ %СпособСравнения% &ОтборВозраст";
		
		ЭлементСпособСравнения = Элементы.ОтборВозрастСравнение.СписокВыбора.НайтиПоЗначению(ОтборВозрастСравнение);
		ТекстСпособСравнения = "=";
		Если ЭлементСпособСравнения <> Неопределено Тогда
			ТекстСпособСравнения = ЭлементСпособСравнения.Представление;
		КонецЕсли;	
			
		ТекстУсловияВозраст = СтрЗаменить(ТекстУсловияВозраст, "%СпособСравнения%", ТекстСпособСравнения); 
		
		Условия.Добавить(ТекстУсловияВозраст);
		Запрос.УстановитьПараметр("ОтборВозраст", ОтборВозраст);
	КонецЕсли;	
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условия", СтрСоединить(Условия, " И "));

	Выборка = Запрос.Выполнить().Выбрать();

	Возврат Выборка;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСоставГрупп(ИмяТЧ, ИдентификаторСтроки = Неопределено)
	
	ЗаполняемаяТаблица = ЭтотОбъект[ИмяТЧ];
	Если ИдентификаторСтроки <> Неопределено Тогда
		ТекущаяСтрока = ЗаполняемаяТаблица.НайтиПоИдентификатору(ИдентификаторСтроки);
		Ребенок = ТекущаяСтрока.Ребенок;
	Иначе
		ТекущаяСтрока = Неопределено;
		Ребенок = Неопределено;
		ЗаполняемаяТаблица.Очистить();
	КонецЕсли;
	
	Выборка = ДанныеДляЗаполненияСоставаГруппДДУ(ИмяТЧ, Ребенок);
	
	Если ТекущаяСтрока = Неопределено Тогда
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЗаполняемаяТаблица.Добавить();
			НоваяСтрока.Пометка = Истина;
			УстановитьЗаголовкиВСтроке(НоваяСтрока);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
	Иначе
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПлательщиков(Ребенок = Неопределено, ОчищатьТЧ = Истина, ИдентификаторСтроки = Неопределено)
	
	Если ОчищатьТЧ Тогда
		ПараметрыПлательщиков.Очистить();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения) Тогда
		// Базовый текст запроса.
		// Впоследствии условия подставляются кодом.
		ЗапросТекст =
		"ВЫБРАТЬ
		|	Дети.Ссылка КАК Ребенок,
		|	Дети.Код КАК ЛицевойСчет,
		|	Дети.Организация КАК Организация,
		|	ЛОЖЬ КАК Пометка,
		|	ПлательщикиПоУслугамДДУСрезПоследних.Плательщик КАК Плательщик,
		|	ПлательщикиПоУслугамДДУСрезПоследних.СчетПлательщика КАК СчетПлательщика,
		|	&НаДату КАК ДатаНачала
		|ИЗ
		|	Справочник.Дети КАК Дети
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлательщикиПоУслугамДДУ.СрезПоследних(&НаДату, ) КАК ПлательщикиПоУслугамДДУСрезПоследних
		|		ПО Дети.Ссылка = ПлательщикиПоУслугамДДУСрезПоследних.Ребенок
		|			И Дети.Организация = ПлательщикиПоУслугамДДУСрезПоследних.Организация
		|ГДЕ
		|	(Дети.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ Дети.ДатаВыбытия > &НаДату)";
		
		// Модификация текста запроса
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ЗапросТекст);
		ПервыйЗапрос = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
		
		Если Ребенок <> Неопределено И ТипЗнч(Ребенок) = Тип("СправочникСсылка.Дети") Тогда
			ПервыйЗапрос.Отбор.Добавить("Дети.Ссылка = &Ребенок");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
			ПервыйЗапрос.Отбор.Добавить("Дети.Организация = &Организация");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтборГруппаСправочникДети) Тогда
			ПервыйЗапрос.Отбор.Добавить("Дети.Родитель = &ГруппаСправочникДети");
		КонецЕсли;
		
		ЗапросТекст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Иначе
		// Базовый текст запроса.
		// Впоследствии условия подставляются кодом.
		ЗапросТекст =
		"ВЫБРАТЬ
		|	Дети.Ребенок КАК Ребенок,
		|	Дети.Ребенок.Код КАК ЛицевойСчет,
		|	Дети.Ребенок.Организация КАК Организация,
		|	ЛОЖЬ КАК Пометка,
		|	ПлательщикиПоУслугамДДУСрезПоследних.Плательщик КАК Плательщик,
		|	ПлательщикиПоУслугамДДУСрезПоследних.СчетПлательщика КАК СчетПлательщика,
		|	&НаДату КАК ДатаНачала
		|ИЗ
		|	(ВЫБРАТЬ
		|		СоставГруппДДУ.Ребенок КАК Ребенок,
		|		СоставГруппДДУ.Льгота КАК Льгота,
		|		СоставГруппДДУ.СтавкаОплаты КАК СтавкаОплаты,
		|		СоставГруппДДУ.Договор КАК Договор,
		|		СоставГруппДДУ.Актуальность КАК Актуальность
		|	ИЗ
		|		РегистрСведений.СоставГруппДДУ.СрезПоследних(&НаДату, ) КАК СоставГруппДДУ
		|	ГДЕ
		|		СоставГруппДДУ.ГруппаДетскогоУчреждения = &ГруппаДетскогоУчреждения
		|		И СоставГруппДДУ.Актуальность = ИСТИНА
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СоставГруппДДУДопУслуги.Ребенок,
		|		СоставГруппДДУДопУслуги.Льгота,
		|		СоставГруппДДУДопУслуги.СтавкаОплаты,
		|		СоставГруппДДУДопУслуги.Договор,
		|		СоставГруппДДУДопУслуги.Актуальность
		|	ИЗ
		|		РегистрСведений.СоставГруппДДУДополнительныеУслуги.СрезПоследних(&НаДату, ) КАК СоставГруппДДУДопУслуги
		|	ГДЕ
		|		СоставГруппДДУДопУслуги.ГруппаДетскогоУчреждения = &ГруппаДетскогоУчреждения
		|		И НЕ ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА КАК Поле1
		|					ИЗ
		|						РегистрСведений.СоставГруппДДУ КАК Т
		|					ГДЕ
		|						Т.Ребенок = СоставГруппДДУДопУслуги.Ребенок)
		|		И СоставГруппДДУДопУслуги.Актуальность = ИСТИНА) КАК Дети
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлательщикиПоУслугамДДУ.СрезПоследних(&НаДату, ) КАК ПлательщикиПоУслугамДДУСрезПоследних
		|		ПО Дети.Ребенок = ПлательщикиПоУслугамДДУСрезПоследних.Ребенок
		|			И Дети.Ребенок.Организация = ПлательщикиПоУслугамДДУСрезПоследних.Организация
		|ГДЕ
		|	(Дети.Ребенок.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ Дети.Ребенок.ДатаВыбытия > &НаДату)";
		
		// Модификация текста запроса
	
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ЗапросТекст);
		ПервыйЗапрос = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
		
		Если Ребенок <> Неопределено И ТипЗнч(Ребенок) = Тип("СправочникСсылка.Дети") Тогда
			ПервыйЗапросПодзапроса = ПервыйЗапрос.Источники[0].Источник.Запрос.Операторы[0];
			ВторойЗапросПодзапроса = ПервыйЗапрос.Источники[0].Источник.Запрос.Операторы[1];
			
			ПервыйЗапросПодзапроса.Отбор.Добавить("СоставГруппДДУ.Ребенок = &Ребенок");
			ВторойЗапросПодзапроса.Отбор.Добавить("СоставГруппДДУДопУслуги.Ребенок = &Ребенок");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
			ПервыйЗапрос.Отбор.Добавить("Дети.Ребенок.Организация = &Организация");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтборГруппаСправочникДети) Тогда
			ПервыйЗапрос.Отбор.Добавить("Дети.Ребенок.Родитель = &ГруппаСправочникДети");
		КонецЕсли;
		
		ЗапросТекст = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	// Выполнение запроса
	
	Запрос = Новый Запрос(ЗапросТекст);
	
	Запрос.УстановитьПараметр("НаДату",                   НачалоДня(ДатаСреза));
	Запрос.УстановитьПараметр("ДатаВыбытия",              ?(ЗначениеЗаполнено(ДатаВступленияВСилу), ДатаВступленияВСилу, Дата(1, 1, 1)));
	Запрос.УстановитьПараметр("ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения);
	Запрос.УстановитьПараметр("Организация",              ОтборОрганизация);
	Запрос.УстановитьПараметр("ГруппаСправочникДети", 	  ОтборГруппаСправочникДети);
	Запрос.УстановитьПараметр("Ребенок",                  Ребенок);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Ребенок = Неопределено Тогда
		Для Каждого СтрокаРезультат Из Результат Цикл
			НоваяСтрока = ПараметрыПлательщиков.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультат);
			УстановитьЗаголовкиВСтроке(НоваяСтрока);
		КонецЦикла;
	ИначеЕсли ИдентификаторСтроки <> Неопределено Тогда
		Если Результат.Количество() > 0 Тогда
			Стр = ПараметрыПлательщиков.НайтиПоИдентификатору(ИдентификаторСтроки);
			ЗаполнитьЗначенияСвойств(Стр, Результат[0]);
		КонецЕсли;
	Иначе
		Если Результат.Количество() > 0 Тогда
			Стр = ПараметрыПлательщиков.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, Результат[0]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыКомпенсации(ИдентификаторСтроки = Неопределено)

	Если ИдентификаторСтроки <> Неопределено Тогда
		ТекущаяСтрока = ПараметрыКомпенсацииПоДетям.НайтиПоИдентификатору(ИдентификаторСтроки);
		Ребенок = ТекущаяСтрока.Ребенок;
	Иначе
		ТекущаяСтрока = Неопределено;
		Ребенок = Неопределено;
		ПараметрыКомпенсацииПоДетям.Очистить();
	КонецЕсли;
	
	Запрос = ЗапросПараметрыКомпенсации(Ребенок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ТекущаяСтрока = Неопределено Тогда
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ПараметрыКомпенсацииПоДетям.Добавить();
			НоваяСтрока.Пометка = Истина;
			УстановитьЗаголовкиВСтроке(НоваяСтрока);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
	Иначе
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаПараметрыКомпенсацииВсеПериоды()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Дети.Ссылка КАК Ребенок,
	|	Дети.Код КАК ЛицевойСчет,
	|	Дети.Организация КАК Организация,
	|	СоставГруппДДУ.Договор КАК ДоговорКонтрагента,
	|	ПараметрыКомпенсации.НастройкаКомпенсации КАК НастройкаКомпенсации,
	|	ПараметрыКомпенсации.Ставка КАК СтавкаКомпенсации,
	|	ПараметрыКомпенсации.ДатаНачала КАК ДатаНачала,
	|	ПараметрыКомпенсации.ДатаОкончания КАК ДатаОкончания
	|{ВЫБРАТЬ
	|	Ребенок,
	|	ЛицевойСчет,
	|	Организация,
	|	ДоговорКонтрагента,
	|	НастройкаКомпенсации,
	|	СтавкаКомпенсации,
	|	ДатаНачала,
	|	ДатаОкончания}
	|ИЗ
	|	Справочник.Дети КАК Дети
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппДДУ.СрезПоследних(&НаДату, ) КАК СоставГруппДДУ
	|	ПО Дети.Ссылка = СоставГруппДДУ.Ребенок
	|	{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКомпенсацииРодительскойПлатыПоДетям КАК ПараметрыКомпенсации
	|	ПО Дети.Ссылка = ПараметрыКомпенсации.Ребенок
	|	И Дети.Организация = ПараметрыКомпенсации.Организация
	|	И ПараметрыКомпенсации.НастройкаКомпенсации = &НастройкаКомпенсации}
	|ГДЕ
	|	СоставГруппДДУ.Актуальность
	|{ГДЕ
	|	Дети.Организация КАК ОтборОрганизация,
	|	Дети.Родитель КАК ОтборГруппаСправочникДети,
	|	СоставГруппДДУ.ГруппаДетскогоУчреждения КАК ОтборГруппаДетскогоУчреждения,
	|	ПараметрыКомпенсации.НастройкаКомпенсации КАК ОтборНастройкаКомпенсации,
	|	Дети.Ссылка КАК ОтборРебенок,
	|	ПараметрыКомпенсации.Ставка КАК ОтборСтавкаКомпенсации,
	|	ПараметрыКомпенсации.ДатаНачала КАК ОтборДатаНачала,
	|	ПараметрыКомпенсации.ДатаОкончания КАК ОтборДатаОкончания,
	|	(ПараметрыКомпенсации.ДатаНачала < &ОтборДействуетНаДату
	|		И (ПараметрыКомпенсации.ДатаОкончания = ДАТАВРЕМЯ(1,1,1)
	|			ИЛИ ПараметрыКомпенсации.ДатаОкончания >= &ОтборДействуетНаДату)) КАК ИспользоватьОтборНаДату}
	|";
	
	Возврат ТекстЗапроса;
КонецФункции

&НаСервере
Функция ТекстЗапросаПараметрыКомпенсации()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПараметрыКомпенсации.Ребенок,
	|	ПараметрыКомпенсации.Организация,
	|	ПараметрыКомпенсации.НастройкаКомпенсации КАК НастройкаКомпенсации,
	|	ПараметрыКомпенсации.Ставка КАК СтавкаКомпенсации,
	|	ПараметрыКомпенсации.ДатаНачала КАК ДатаНачала,
	|	ПараметрыКомпенсации.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ПараметрыКомпенсации
	|ИЗ
	|	РегистрСведений.ПараметрыКомпенсацииРодительскойПлатыПоДетям КАК ПараметрыКомпенсации
	|{ГДЕ
	|	ПараметрыКомпенсации.Организация КАК ОтборОрганизация,
	|	ПараметрыКомпенсации.Ребенок КАК ОтборРебенок,
	|	ПараметрыКомпенсации.НастройкаКомпенсации КАК ОтборНастройкаКомпенсации,
	|	ПараметрыКомпенсации.Ставка КАК ОтборСтавкаКомпенсации,
	|	ПараметрыКомпенсации.ДатаНачала КАК ОтборДатаНачала,
	|	ПараметрыКомпенсации.ДатаОкончания КАК ОтборДатаОкончания,
	|	(ПараметрыКомпенсации.ДатаНачала < &ОтборДействуетНаДату
	|		И (ПараметрыКомпенсации.ДатаОкончания = ДАТАВРЕМЯ(1,1,1)
	|			ИЛИ ПараметрыКомпенсации.ДатаОкончания >= &ОтборДействуетНаДату)) КАК ИспользоватьОтборНаДату}
	|;
	|ВЫБРАТЬ
	|	МаксПараметрыКомпенсации.Ребенок,
	|	МаксПараметрыКомпенсации.Организация,
	|	МаксПараметрыКомпенсации.НастройкаКомпенсации КАК НастройкаКомпенсации,
	|	ПараметрыКомпенсации.СтавкаКомпенсации КАК СтавкаКомпенсации,
	|	МаксПараметрыКомпенсации.МаксимальнаяДатаНачала КАК ДатаНачала,
	|	ПараметрыКомпенсации.ДатаОкончания
	|ПОМЕСТИТЬ ПараметрыКомпенсацииСрезПоследних
	|ИЗ (ВЫБРАТЬ
	|		ПараметрыКомпенсации.Ребенок,
	|		ПараметрыКомпенсации.Организация,
	|		ПараметрыКомпенсации.НастройкаКомпенсации КАК НастройкаКомпенсации,
	|		МАКСИМУМ(ПараметрыКомпенсации.ДатаНачала) КАК МаксимальнаяДатаНачала
	|	ИЗ
	|		ПараметрыКомпенсации
	|	СГРУППИРОВАТЬ ПО
	|		ПараметрыКомпенсации.Ребенок,
	|		ПараметрыКомпенсации.Организация,
	|		ПараметрыКомпенсации.НастройкаКомпенсации) КАК МаксПараметрыКомпенсации
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыКомпенсации КАК ПараметрыКомпенсации
	|	ПО 
	|	МаксПараметрыКомпенсации.Ребенок = ПараметрыКомпенсации.Ребенок
	|	И МаксПараметрыКомпенсации.Организация = МаксПараметрыКомпенсации.Организация
	|	И МаксПараметрыКомпенсации.НастройкаКомпенсации = ПараметрыКомпенсации.НастройкаКомпенсации
	|	И МаксПараметрыКомпенсации.МаксимальнаяДатаНачала = ПараметрыКомпенсации.ДатаНачала
	|;
	|ВЫБРАТЬ
	|	Дети.Ссылка КАК Ребенок,
	|	Дети.Код КАК ЛицевойСчет,
	|	Дети.Организация КАК Организация,
	|	СоставГруппДДУ.Договор КАК ДоговорКонтрагента,
	|	ПараметрыКомпенсации.НастройкаКомпенсации КАК НастройкаКомпенсации,
	|	ПараметрыКомпенсации.СтавкаКомпенсации КАК СтавкаКомпенсации,
	|	ПараметрыКомпенсации.ДатаНачала КАК ДатаНачала,
	|	ПараметрыКомпенсации.ДатаОкончания КАК ДатаОкончания
	|{ВЫБРАТЬ
	|	Ребенок,
	|	ЛицевойСчет,
	|	Организация,
	|	ДоговорКонтрагента,
	|	НастройкаКомпенсации,
	|	СтавкаКомпенсации,
	|	ДатаНачала,
	|	ДатаОкончания}
	|ИЗ
	|	Справочник.Дети КАК Дети
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппДДУ.СрезПоследних(&НаДату, ) КАК СоставГруппДДУ
	|	ПО Дети.Ссылка = СоставГруппДДУ.Ребенок
	|	{ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыКомпенсацииСрезПоследних КАК ПараметрыКомпенсации
	|	ПО Дети.Ссылка = ПараметрыКомпенсации.Ребенок
	|	И Дети.Организация = ПараметрыКомпенсации.Организация}
	|ГДЕ
	|	СоставГруппДДУ.Актуальность
	|{ГДЕ
	|	Дети.Организация КАК ОтборОрганизация,
	|	Дети.Родитель КАК ОтборГруппаСправочникДети,
	|	СоставГруппДДУ.ГруппаДетскогоУчреждения КАК ОтборГруппаДетскогоУчреждения,
	|	ПараметрыКомпенсации.НастройкаКомпенсации КАК ОтборНастройкаКомпенсации,
	|	Дети.Ссылка КАК ОтборРебенок}
	|";
	
	Возврат ТекстЗапроса;
КонецФункции

&НаСервере
Функция ЗапросПараметрыКомпенсации(Ребенок = Неопределено)
	
	Если ИспользоватьОтборТекущаяНастройкаКомпенсации
		И ВариантОтбораКомпенсацииПоПериодуВсеПериоды(ЭтотОбъект) Тогда
		ТекстЗапроса = ТекстЗапросаПараметрыКомпенсацииВсеПериоды();
	Иначе
		ТекстЗапроса = ТекстЗапросаПараметрыКомпенсации();
	КонецЕсли;
	
	ПостроительЗапроса = Новый ПостроительЗапроса(ТекстЗапроса);
	
	ПолучатьТекущуюНастройку = ИспользоватьОтборТекущаяНастройкаКомпенсации
		ИЛИ ЗначениеЗаполнено(НастройкаКомпенсацииНовая);
	
	Если НЕ ПолучатьТекущуюНастройку Тогда
		УдалитьВыбранноеПоле(ПостроительЗапроса, "НастройкаКомпенсации");
		УдалитьВыбранноеПоле(ПостроительЗапроса, "СтавкаКомпенсации");
		УдалитьВыбранноеПоле(ПостроительЗапроса, "ДатаНачала");
		УдалитьВыбранноеПоле(ПостроительЗапроса, "ДатаОкончания");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		УстановитьЭлементОтбора(ПостроительЗапроса, "ОтборОрганизация", ОтборОрганизация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения) Тогда
		УстановитьЭлементОтбора(ПостроительЗапроса, "ОтборГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ребенок) Тогда
		УстановитьЭлементОтбора(ПостроительЗапроса, "ОтборРебенок", Ребенок);
	КонецЕсли;
	
	Если ИспользоватьОтборТекущаяНастройкаКомпенсации Тогда
		УстановитьОтборПоТекущейНастройкеКомпенсации(ПостроительЗапроса);
	КонецЕсли;
	
	Запрос = ПостроительЗапроса.ПолучитьЗапрос();
	Запрос.УстановитьПараметр("НаДату", НачалоДня(ДатаСреза));
	Если ИспользоватьОтборТекущаяНастройкаКомпенсации Тогда
		Запрос.УстановитьПараметр("НастройкаКомпенсации", ОтборНастройкаКомпенсации);
	Иначе
		Запрос.УстановитьПараметр("НастройкаКомпенсации", НастройкаКомпенсацииНовая);
	КонецЕсли;
	Если ВариантОтбораКомпенсацииПоПериодуНаДату(ЭтотОбъект) Тогда
		Запрос.УстановитьПараметр("ОтборДействуетНаДату", ДатаСреза);
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

&НаСервере
Процедура УдалитьВыбранноеПоле(ПостроительЗапроса, ИмяПоля)
	ПостроительЗапроса.ВыбранныеПоля.Удалить(ПостроительЗапроса.ВыбранныеПоля.Найти(ИмяПоля));
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоТекущейНастройкеКомпенсации(ПостроительЗапроса)
	
	УстановитьЭлементОтбора(ПостроительЗапроса, "ОтборНастройкаКомпенсации", ОтборНастройкаКомпенсации);
	Если ИспользоватьОтборТекущаяСтавкаКомпенсации Тогда
		УстановитьЭлементОтбора(ПостроительЗапроса, "ОтборСтавкаКомпенсации", ОтборСтавкаКомпенсации);
	КонецЕсли;
	Если ВариантОтбораКомпенсацииПоПериодуТочноеСоответствие(ЭтотОбъект) Тогда
		Если ИспользоватьОтборДатаНачала Тогда
			УстановитьЭлементОтбора(ПостроительЗапроса, "ОтборДатаНачала", ОтборДатаНачала);
		КонецЕсли;
		Если ИспользоватьОтборДатаОкончания Тогда
			УстановитьЭлементОтбора(ПостроительЗапроса, "ОтборДатаОкончания", ОтборДатаОкончания);
		КонецЕсли;
	ИначеЕсли ВариантОтбораКомпенсацииПоПериодуНаДату(ЭтотОбъект) Тогда
		УстановитьЭлементОтбора(ПостроительЗапроса, "ИспользоватьОтборНаДату", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭлементОтбора(ПостроительЗапроса, ИмяПоля, Значение)
	
	ЭлементОтбора = ПостроительЗапроса.Отбор.Добавить(ИмяПоля);
	ЭлементОтбора.ВидСравнения  = ВидСравнения.Равно;
	ЭлементОтбора.Значение      = Значение;
	ЭлементОтбора.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыбытиеДетей(Ребенок = Неопределено, ОчищатьТЧ = Истина, ТекущаяСтрока = Неопределено)
	
	Если ОчищатьТЧ Тогда
		ВыбытиеДетей.Очистить();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения) Тогда
		// Базовый текст запроса.
		// Впоследствии условия подставляются кодом.
		ЗапросТекст =
		"ВЫБРАТЬ
		|	Дети.Ссылка КАК Ребенок,
		|	Дети.Код КАК ЛицевойСчет,
		|	Дети.Организация КАК Организация,
		|	СоставГруппДДУ.Договор КАК ДоговорКонтрагента,
		|	Дети.ДатаПриема КАК ДатаПриема,
		|	ВЫБОР
		|		КОГДА Дети.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА &ДатаВыбытия
		|		ИНАЧЕ Дети.ДатаВыбытия
		|	КОНЕЦ КАК ДатаВыбытия,
		|	ИСТИНА КАК Пометка
		|ИЗ
		|	Справочник.Дети КАК Дети
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппДДУ.СрезПоследних(&НаДату, ) КАК СоставГруппДДУ
		|		ПО Дети.Ссылка = СоставГруппДДУ.Ребенок
		|ГДЕ
		|	(Дети.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ Дети.ДатаВыбытия > &НаДату)";
		
		// Модификация текста запроса
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ЗапросТекст);
		ПервыйЗапрос = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
		
		Если Ребенок <> Неопределено И ТипЗнч(Ребенок) = Тип("СправочникСсылка.Дети") Тогда
			ПервыйЗапрос.Отбор.Добавить("Дети.Ссылка = &Ребенок");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
			ПервыйЗапрос.Отбор.Добавить("Дети.Организация = &Организация");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтборГруппаСправочникДети) Тогда
			ПервыйЗапрос.Отбор.Добавить("Дети.Родитель = &ГруппаСправочникДети");
		КонецЕсли;
		
		ЗапросТекст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Иначе
		// Базовый текст запроса.
		// Впоследствии условия подставляются кодом.
		ЗапросТекст =
		"ВЫБРАТЬ
		|	Дети.Ребенок КАК Ребенок,
		|	Дети.Ребенок.Код КАК ЛицевойСчет,
		|	Дети.Ребенок.Организация КАК Организация,
		|	Дети.Договор КАК ДоговорКонтрагента,
		|	Дети.Ребенок.ДатаПриема КАК ДатаПриема,
		|	ВЫБОР
		|		КОГДА Дети.Ребенок.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА &ДатаВыбытия
		|		ИНАЧЕ Дети.Ребенок.ДатаВыбытия
		|	КОНЕЦ КАК ДатаВыбытия,
		|	ИСТИНА КАК Пометка
		|ИЗ
		|	(ВЫБРАТЬ
		|		СоставГруппДДУ.Ребенок КАК Ребенок,
		|		СоставГруппДДУ.Льгота КАК Льгота,
		|		СоставГруппДДУ.СтавкаОплаты КАК СтавкаОплаты,
		|		СоставГруппДДУ.Договор КАК Договор,
		|		СоставГруппДДУ.Актуальность КАК Актуальность
		|	ИЗ
		|		РегистрСведений.СоставГруппДДУ.СрезПоследних(&НаДату, ) КАК СоставГруппДДУ
		|	ГДЕ
		|		СоставГруппДДУ.ГруппаДетскогоУчреждения = &ГруппаДетскогоУчреждения
		|		И СоставГруппДДУ.Актуальность = ИСТИНА
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СоставГруппДДУДопУслуги.Ребенок,
		|		СоставГруппДДУДопУслуги.Льгота,
		|		СоставГруппДДУДопУслуги.СтавкаОплаты,
		|		СоставГруппДДУДопУслуги.Договор,
		|		СоставГруппДДУДопУслуги.Актуальность
		|	ИЗ
		|		РегистрСведений.СоставГруппДДУДополнительныеУслуги.СрезПоследних(&НаДату, ) КАК СоставГруппДДУДопУслуги
		|	ГДЕ
		|		СоставГруппДДУДопУслуги.ГруппаДетскогоУчреждения = &ГруппаДетскогоУчреждения
		|		И НЕ ИСТИНА В
		|					(ВЫБРАТЬ ПЕРВЫЕ 1
		|						ИСТИНА КАК Поле1
		|					ИЗ
		|						РегистрСведений.СоставГруппДДУ КАК Т
		|					ГДЕ
		|						Т.Ребенок = СоставГруппДДУДопУслуги.Ребенок)
		|		И СоставГруппДДУДопУслуги.Актуальность = ИСТИНА) КАК Дети
		|ГДЕ
		|	(Дети.Ребенок.ДатаВыбытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ Дети.Ребенок.ДатаВыбытия > &НаДату)";
		
		// Модификация текста запроса
	
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ЗапросТекст);
		ПервыйЗапрос = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
		
		Если Ребенок <> Неопределено И ТипЗнч(Ребенок) = Тип("СправочникСсылка.Дети") Тогда
			ПервыйЗапросПодзапроса = ПервыйЗапрос.Источники[0].Источник.Запрос.Операторы[0];
			ВторойЗапросПодзапроса = ПервыйЗапрос.Источники[0].Источник.Запрос.Операторы[1];
			
			ПервыйЗапросПодзапроса.Отбор.Добавить("СоставГруппДДУ.Ребенок = &Ребенок");
			ВторойЗапросПодзапроса.Отбор.Добавить("СоставГруппДДУДопУслуги.Ребенок = &Ребенок");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
			ПервыйЗапрос.Отбор.Добавить("Дети.Ребенок.Организация = &Организация");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтборГруппаСправочникДети) Тогда
			ПервыйЗапрос.Отбор.Добавить("Дети.Ребенок.Родитель = &ГруппаСправочникДети");
		КонецЕсли;
		
		ЗапросТекст = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	// Выполнение запроса
	
	Запрос = Новый Запрос(ЗапросТекст);
	
	Запрос.УстановитьПараметр("НаДату",                   НачалоДня(ДатаСреза));
	Запрос.УстановитьПараметр("ДатаВыбытия",              ?(ЗначениеЗаполнено(ДатаВступленияВСилу), ДатаВступленияВСилу, Дата(1, 1, 1)));
	Запрос.УстановитьПараметр("ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения);
	Запрос.УстановитьПараметр("Организация",              ОтборОрганизация);
	Запрос.УстановитьПараметр("ГруппаСправочникДети", 	  ОтборГруппаСправочникДети);
	Запрос.УстановитьПараметр("Ребенок",                  Ребенок);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Ребенок = Неопределено Тогда
		Для Каждого НоваяСтрока Из Результат Цикл
			ЗаполнитьЗначенияСвойств(ВыбытиеДетей.Добавить(), НоваяСтрока);
		КонецЦикла;
	ИначеЕсли ТекущаяСтрока <> Неопределено Тогда
		Если Результат.Количество() > 0 Тогда
			Стр = ВыбытиеДетей[ТекущаяСтрока];
			ЗаполнитьЗначенияСвойств(Стр, Результат[0]);
		КонецЕсли;
	Иначе
		Если Результат.Количество() > 0 Тогда
			Стр = ВыбытиеДетей.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, Результат[0]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРежимРаботы()
	Оповещение = Новый ОписаниеОповещения("ВыборРежимаРаботы", ЭтотОбъект);
	ПараметрыВыбораРежима = Новый Структура("РежимРаботы", РежимРаботыПомощника);
	ОткрытьФорму("Обработка.ПомощникГрупповогоИзмененияУчетныхПараметровДетей.Форма.ФормаРежимаРаботы",
		ПараметрыВыбораРежима,
		ЭтотОбъект, , , ,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ФормаОткрыта()
	Если ЭтотОбъект.Открыта() Тогда
		ВыбратьРежимРаботы();
	Иначе
		ЭтотОбъект.ПодключитьОбработчикОжидания("ФормаОткрыта", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ОпределитьТекущуюТаблицу()
	Если РежимРаботыПомощника = РежимИзменениеПараметровОсновнойПрограммы() Тогда
		Возврат "СоставГруппДДУ";
	ИначеЕсли РежимРаботыПомощника = РежимИзменениеПараметровДополнительнойПрограммы() Тогда
		Возврат "СоставГруппДДУДополнительныеУслуги";
	ИначеЕсли РежимРаботыПомощника = РежимИзменениеПараметровКомпенсации() Тогда
		Возврат "ПараметрыКомпенсацииПоДетям";
	ИначеЕсли РежимРаботыПомощника = РежимВыбытиеДетей() Тогда
		Возврат "ВыбытиеДетей";
	ИначеЕсли РежимРаботыПомощника = РежимВыбытиеДетейСЗачислениемВУчащихся() Тогда
		Возврат "ВыбытиеДетей";	
	ИначеЕсли РежимРаботыПомощника = РежимИзменениеПараметровПлательщиков() Тогда
		Возврат "ПараметрыПлательщиков";	
	Иначе
		ВызватьИсключение ТекстНеПравильныйРежимРаботыПомощника();
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ТекстНеПравильныйРежимРаботыПомощника()
	Возврат СтрШаблон(НСтр("ru = 'Не правильный режим работы помощника: %1'"), РежимРаботыПомощника);
КонецФункции

&НаКлиенте
Процедура ОбработкаВидимостиЭлементов()
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		СтрРазделить("СоставГруппДДУОрганизация,"
				   + "СоставГруппДДУДополнительныеУслугиОрганизация,"
				   + "ПараметрыКомпенсацииПоДетямОрганизация,"
				   + "ВыбытиеДетейОрганизация", ","),
		"Видимость",
		Не ЗначениеЗаполнено(ОтборОрганизация));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗначениями(ИмяЭлемента, ИмяТаблицы)
	
	ПозицияПодчеркивания = СтрНайти(ИмяЭлемента, "_");
	
	Если ПозицияПодчеркивания > 0 Тогда
		Элемент = Лев(ИмяЭлемента, ПозицияПодчеркивания - 1);
	Иначе
		Элемент = ИмяЭлемента;
	КонецЕсли;
	
	Если Элемент = "ДатаВыбытия" Тогда
		ЗначениеЗаполнения = ДатаВступленияВСилу;
	Иначе
		ЗначениеЗаполнения = ЭтотОбъект[Элемент];
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеЗаполнения) И Элемент <> "Льгота" Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент <> "ДатаВыбытия" Тогда
		Элемент = Элемент + "Новый";
	КонецЕсли;
	
	ЗаполнитьКолонкуЗначениями(ИмяТаблицы, Элемент, ЗначениеЗаполнения);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКолонкуЗначениями(ИмяТаблицы, ИмяКолонки, ЗначениеЗаполнения, УстанавливатьЗначение = Истина)
	
	Если ЭтотОбъект[ИмяТаблицы].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если УстанавливатьЗначение Тогда
		НовоеЗначение = ЗначениеЗаполнения;
	Иначе
		ТипНовогоЗначения = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(ЗначениеЗаполнения)));
		НовоеЗначение = ТипНовогоЗначения.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
	Для Каждого Строка Из ЭтотОбъект[ИмяТаблицы] Цикл
		Строка[ИмяКолонки] = НовоеЗначение;
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовки(Форма)
	ЗаголовокКнопки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Заполнить на %1'"),
		Формат(Форма.ДатаСреза, "ДЛФ=D"));
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы,
		СтрРазделить("СоставГруппДДУЗаполнить,"
				   + "СоставГруппДДУДополнительныеУслугиЗаполнить,"
				   + "ПараметрыКомпенсацииПоДетямЗаполнить,"
				   + "ВыбытиеДетейЗаполнить", ","),
		"Заголовок",
		ЗаголовокКнопки);
КонецПроцедуры

&НаКлиенте
Функция ОбязательныеРеквизитыЗаполнены()
	
	Если РежимРаботыПомощника = РежимИзменениеПараметровКомпенсации() Тогда
		Возврат ОбязательныеРеквизитыКомпенсацииЗаполнены();
	Иначе
		Возврат ДатаВступленияВСилуЗаполнена();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ДатаВступленияВСилуЗаполнена()
	
	Если ЗначениеЗаполнено(ДатаВступленияВСилу) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если РежимРаботыПомощника = РежимВыбытиеДетей() Тогда
		ПредставлениеРеквизита = НСтр("ru='Дата выбытия'");
	Иначе
		ПредставлениеРеквизита = НСтр("ru='Дата начала действия'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(
		ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , ПредставлениеРеквизита), ,
		"ДатаВступленияВСилу");
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ОбязательныеРеквизитыКомпенсацииЗаполнены()


	Если ВыбранРежимИзменениеПараметровКомпенсации(ЭтотОбъект)
		И НетОтмеченныхПараметровДляИзмененияКомпенсации() Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не отмечены изменяемые параметры'"));
		Возврат Ложь;
	КонецЕсли;

	ОбязательныеРеквизитыКомпенсации = Новый Массив;
	Если ВыбранРежимИзменениеПараметровКомпенсации(ЭтотОбъект) Тогда
		Если УстановитьДатуНачала Тогда
			ОбязательныеРеквизитыКомпенсации.Добавить(Новый Структура("Имя, Синоним", "ДатаНачалаНовая", НСтр("ru = 'Дата начала'")));
		КонецЕсли;
	Иначе
		ОбязательныеРеквизитыКомпенсации.Добавить(Новый Структура("Имя, Синоним", "ДатаНачалаНовая", НСтр("ru = 'Дата начала'")));
	КонецЕсли;

	ЕстьНезаполненныеРеквизиты = Ложь;
	
	Для Каждого ОбязательныйРеквизит Из ОбязательныеРеквизитыКомпенсации Цикл
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект[ОбязательныйРеквизит.Имя]) Тогда
	
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , ОбязательныйРеквизит.Синоним), ,
				ОбязательныйРеквизит.Имя,
				,
				ЕстьНезаполненныеРеквизиты);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Не ЕстьНезаполненныеРеквизиты;

КонецФункции

&НаКлиенте
Функция ОбязательныеРеквизитыУчащиесяЗаполнены()
	
	Если ЗначениеЗаполнено(ОтборОрганизация)
		И ЗначениеЗаполнено(УчащиесяВидПриказа)
		И ЗначениеЗаполнено(УчащиесяФакультет)
		И ЗначениеЗаполнено(УчащиесяДатаНачалаДействия) Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , НСтр("ru='Организация'")), ,
		"ОтборОрганизация");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , НСтр("ru='Группа зачисление учащихся'")), ,
		"ГруппаЗачислениеУчащихся");
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция НетОтмеченныхПараметровДляИзмененияКомпенсации()
	
	Возврат НЕ (УстановитьНастройкуКомпенсации
		Или УстановитьСтавкуКомпенсации
		Или УстановитьДатуНачала
		Или УстановитьДатуОкончания);
	
КонецФункции

&НаСервере
Процедура ОчиститьРеквизиты()
	ВыбытиеДетей.Очистить();
	ПараметрыКомпенсацииПоДетям.Очистить();
	СоставГруппДДУ.Очистить();
	СоставГруппДДУДополнительныеУслуги.Очистить();
	ГруппаДетскогоУчреждения = Справочники.ГруппыДетскогоУчреждения.ПустаяСсылка();
	ДатаВступленияВСилу = '00010101';
	Льгота = Справочники.ЛьготыСтудентов.ПустаяСсылка();
	ИспользоватьОтборТекущаяНастройкаКомпенсации = Ложь;
	ОтборНастройкаКомпенсации = Справочники.НастройкиРасчетовПоРодительскойПлате.ПустаяСсылка();
	СтавкаОплаты = Справочники.СтавкиОплатыОбразование.ПустаяСсылка();
КонецПроцедуры

&НаСервере
Процедура ОформитьВыбытиеДетей(ЗачислениеУчащихся, Отказ, РезультатОбработки)
	
	Для Каждого Стр Из ВыбытиеДетей Цикл
		Если Стр.Пометка И НЕ Стр.СтрокаОбработана И ЗначениеЗаполнено(Стр.ДатаВыбытия) Тогда
			
			Если ОформитьВыбытиеРебенка(Стр, РезультатОбработки) Тогда
				Стр.СтрокаОбработана = Истина;
				Стр.ОшибкаОбработки = Истина;
				Стр.Пометка = Ложь;
				
				Если ЗачислениеУчащихся Тогда
					ОформитьЗачислениеУчащегося(Стр, РезультатОбработки);
				КонецЕсли;
				
			Иначе
				Стр.ОшибкаОбработки = Истина;
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЗачислениеУчащихся Тогда
		ДокументПриказОбразование = ОФормитьПриказОбразование(Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОформитьВыбытиеРебенка(Стр, РезультатОбработки)
	
	Результат = Истина;
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.Дети");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Стр.Ребенок);
		Блокировка.Заблокировать();
		
		РебенокОбъект = Стр.Ребенок.ПолучитьОбъект();
		РебенокОбъект.Заблокировать();
		РебенокОбъект.ДатаВыбытия = ДатаВступленияВСилу;
		РебенокОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат = Ложь;
		
		РезультатОбработки.Добавить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(
			СтрШаблон(НСтр("ru = 'Не удалось оформить выбытие ""%1"" по причине: %2'"),
				Стр.Ребенок,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())),
			Стр.Ребенок.Метаданные(),
			Стр.Ребенок);
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ОФормитьПриказОбразование(Отказ)
	
	ПриказОбразованиеОбъект = Документы.ПриказОбразование.СоздатьДокумент();
	
	ПриказОбразованиеОбъект.Дата = УчащиесяДатаНачалаДействия;
	ПриказОбразованиеОбъект.Организация = ОтборОрганизация;
	ПриказОбразованиеОбъект.ВидПриказа = УчащиесяВидПриказа;
	ПриказОбразованиеОбъект.Факультет = УчащиесяФакультет;
	ПриказОбразованиеОбъект.ДатаНачалаДействия = УчащиесяДатаНачалаДействия;
	ПриказОбразованиеОбъект.ДатаОкончанияДействия = УчащиесяДатаОкончанияДействия;
	
	ДопУслуга = ЭтоПриказНаДопУслугу(УчащиесяВидПриказа);
	
	Для Каждого Стр Из ВыбытиеДетей Цикл
		Если ЗначениеЗаполнено(Стр.Студент) Тогда
			
			Если ДопУслуга Тогда
				НоваяСтрока = ПриказОбразованиеОбъект.СтудентыДопУслуги.Добавить();
				НоваяСтрока.Студент = Стр.Студент;
				НоваяСтрока.НачалоНачисления = УчащиесяДатаНачалаДействия;
				НоваяСтрока.ОкончаниеНачисления = УчащиесяДатаОкончанияДействия;
			Иначе
				НоваяСтрока = ПриказОбразованиеОбъект.Студенты.Добавить();
				НоваяСтрока.Студент = Стр.Студент;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	ПриказОбразованиеОбъект.Записать();
	
	ПриказОбразование = ПриказОбразованиеОбъект.Ссылка;
	
КонецФункции

&НаСервере
Функция ОформитьЗачислениеУчащегося(Стр, РезультатОбработки)
	
	Результат = Истина;
	
	НачатьТранзакцию();
	Попытка
		
		СвойстваРебенок = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Стр.Ребенок, "Наименование, Контрагент");
		
		СтудентОбъект = Справочники.Студенты.СоздатьЭлемент();
		
		СтудентОбъект.Организация = ОтборОрганизация;
		СтудентОбъект.Наименование = СвойстваРебенок.Наименование;
		СтудентОбъект.Контрагент = СвойстваРебенок.Контрагент;		
		
		СтудентОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		Стр.Студент = СтудентОбъект.Ссылка;
		
	Исключение
		ОтменитьТранзакцию();
		Результат = Ложь;
		
		РезультатОбработки.Добавить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(
			СтрШаблон(НСтр("ru = 'Не удалось создать элемент справочника ""Учащиеся"" для ""%1"" по причине: %2'"),
				Стр.Ребенок,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())),
			Стр.Ребенок.Метаданные(),
			Стр.Ребенок);
	КонецПопытки;
	
	Возврат Результат;

КонецФункции	

&НаСервере
Функция РекизитыИзменились(Строка, Реквизиты)
	
	Для Каждого ИмяРеквизита Из СтрРазделить(Реквизиты, ",") Цикл
		Если Строка[СокрЛП(ИмяРеквизита)] <> Строка[СокрЛП(ИмяРеквизита) + "Новый"] Тогда
			Возврат Истина;
		КонецЕсли;
		Если ИмяРеквизита = "Льгота" И Строка["ЛьготаПустоеЗначениеНовый"] = Истина Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ИзменитьСоставГрупп(ИмяТЧ, Отказ, РезультатОбработки)

	ТаблицаНабора = ЭтотОбъект[ИмяТЧ];
	Для Каждого Стр Из ТаблицаНабора Цикл
		Если НЕ Стр.Пометка
			ИЛИ Стр.СтрокаОбработана
			ИЛИ НЕ РекизитыИзменились(Стр, "ГруппаДетскогоУчреждения, СтавкаОплаты, Льгота, Актуальность") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗаписатьИзменениеСоставаГруппРебенка(ИмяТЧ, Стр, РезультатОбработки) Тогда
			Стр.СтрокаОбработана = Истина;
			Стр.ОшибкаОбработки = Ложь;
		Иначе
			Стр.ОшибкаОбработки = Истина;
			Отказ = Истина;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьИзменениеСоставаГруппРебенка(ИмяТЧ, Строка, РезультатОбработки)
	
	Результат = Истина;
	
	НаборЗаписей = РегистрыСведений[ИмяТЧ].СоздатьНаборЗаписей();
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.Дети");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Строка.Ребенок);
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений." + ИмяТЧ);
		ЭлементБлокировки.УстановитьЗначение("Ребенок", Строка.Ребенок);
		Блокировка.Заблокировать();
	
		РебенокОбъект = Строка.Ребенок.ПолучитьОбъект();
		РебенокОбъект.Заблокировать();
		
		Если ТребуетсяЗавершитьАктуальностьТекущейЗаписи(Строка, ИмяТЧ) Тогда
			ЗавершитьАктуальностьТекущейЗаписи(НаборЗаписей, Строка, ИмяТЧ);
		КонецЕсли;
		
		ДобавитьЗаписьГруппыДДУ(НаборЗаписей, Строка);
	
		НаборЗаписей.Записать(Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат = Ложь;
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось записать изменение группы ребенка %1 по причине: %2'"),
				Строка.Ребенок,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРеистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений[ИмяТЧ],
			Строка.Ребенок,
			ТекстОшибки);
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(ТекстОшибки, ОбъектМетаданных, Данные = Неопределено)
	ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРеистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		ОбъектМетаданных,
		Данные,
		ТекстОшибки);
КонецПроцедуры

&НаСервере
Функция ИмяСобытияЖурналаРеистрации()
	Возврат НСтр("ru = 'Групповое изменение параметров детей'", ОбщегоНазначения.КодОсновногоЯзыка());
КонецФункции

&НаСервере
Функция ТребуетсяЗавершитьАктуальностьТекущейЗаписи(Строка, ИмяТЧ)
	Если ИмяТЧ = "СоставГруппДДУ" Тогда
		ТребуетсяЗавершитьАктуальностьТекущейЗаписи = Актуальность
			И ЗначениеЗаполнено(Строка.ГруппаДетскогоУчреждения);
	Иначе
		// только при изменении группы  
		ТребуетсяЗавершитьАктуальностьТекущейЗаписи = Актуальность
			И ЗначениеЗаполнено(Строка.ГруппаДетскогоУчреждения)
			И ЗначениеЗаполнено(Строка.ГруппаДетскогоУчрежденияНовый)
			И Строка.ГруппаДетскогоУчреждения <> Строка.ГруппаДетскогоУчрежденияНовый;
	КонецЕсли;
	
	Возврат ТребуетсяЗавершитьАктуальностьТекущейЗаписи;	
КонецФункции

&НаСервере
Процедура ЗавершитьАктуальностьТекущейЗаписи(НаборЗаписей, Строка, ИмяТЧ)
	Запись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, Строка);
	Запись.Актуальность = Ложь;
	Запись.Период = ?(ИмяТЧ = "СоставГруппДДУ",
		ДатаВступленияВСилу - 86400,
		ДатаВступленияВСилу);
	Запись.Договор = Строка.ДоговорКонтрагента;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьГруппыДДУ(НаборЗаписей, Строка)
	Запись = НаборЗаписей.Добавить();
	Запись.Период  = ДатаВступленияВСилу;
	Запись.Ребенок = Строка.Ребенок;
	Запись.ГруппаДетскогоУчреждения = ?(ЗначениеЗаполнено(Строка.ГруппаДетскогоУчрежденияНовый),
		Строка.ГруппаДетскогоУчрежденияНовый,
		Строка.ГруппаДетскогоУчреждения);
	Запись.СтавкаОплаты = ?(ЗначениеЗаполнено(Строка.СтавкаОплатыНовый),
		Строка.СтавкаОплатыНовый,
		Строка.СтавкаОплаты);
		
	Запись.Льгота = ?(ЗначениеЗаполнено(Строка.ЛьготаНовый) ИЛИ Строка.ЛьготаПустоеЗначениеНовый,
		Строка.ЛьготаНовый,
		Строка.Льгота);
	Запись.Договор      = Строка.ДоговорКонтрагента;
	Запись.Актуальность = Строка.АктуальностьНовый;
КонецПроцедуры

&НаСервере
Процедура ИзменитьПараметрыКомпенсации(Отказ, РезультатОбработки)

	НовыеПараметрыКомпенсации = НовыеЗначенияПараметровКомпенсации();

	Для Каждого СтрокаКомпенсации Из ПараметрыКомпенсацииПоДетям Цикл
		
		Если НЕ СтрокаКомпенсации.Пометка ИЛИ СтрокаКомпенсации.СтрокаОбработана Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыбранРежимИзменениеПараметровКомпенсации(ЭтотОбъект) Тогда
			
			Отбор = Новый Структура("Организация, Ребенок, НастройкаКомпенсации, ДатаНачала, ДатаОкончания");
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаКомпенсации);
			Отбор.Организация = ОтборОрганизация;
			
			РезультатУспех = ИзменитьСуществующуюЗаписьПараметровКомпенсацииРебенка(Отбор,
				НовыеПараметрыКомпенсации,
				РезультатОбработки);
				
		Иначе
		
			РезультатУспех = ИзменитьПараметрыКомпенсацииРебенка(СтрокаКомпенсации.Организация,
				СтрокаКомпенсации.Ребенок,
				НовыеПараметрыКомпенсации,
				РезультатОбработки);
		
		КонецЕсли;
			
		Если РезультатУспех Тогда
			СтрокаКомпенсации.СтрокаОбработана = Истина;
			СтрокаКомпенсации.ОшибкаОбработки = Ложь;
		Иначе
			СтрокаКомпенсации.ОшибкаОбработки = Истина;
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НовыеЗначенияПараметровКомпенсации()
	
	Результат = Новый Структура;
	
	ЭтоДобавление = НЕ ВыбранРежимИзменениеПараметровКомпенсации(ЭтотОбъект);
	
	Если УстановитьНастройкуКомпенсации Или ЭтоДобавление Тогда
		Результат.Вставить("НастройкаКомпенсации", НастройкаКомпенсацииНовая);
	КонецЕсли;
	Если УстановитьСтавкуКомпенсации Или ЭтоДобавление Тогда
		Результат.Вставить("Ставка", СтавкаКомпенсацииНовая);
	КонецЕсли;
	Если УстановитьДатуНачала Или ЭтоДобавление Тогда
		Результат.Вставить("ДатаНачала", ДатаНачалаНовая);
	КонецЕсли;
	Если УстановитьДатуОкончания Или ЭтоДобавление Тогда
		Результат.Вставить("ДатаОкончания", ДатаОкончанияНовая);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ИзменитьСуществующуюЗаписьПараметровКомпенсацииРебенка(Отбор, НовыеПараметры, РезультатОбработки)
	
	НачатьТранзакцию();
	Попытка
		
		УстановитьБлокировкуПараметровКомпенсации(Отбор.Ребенок);
		
		МенеджерЗаписи = РегистрыСведений.ПараметрыКомпенсацииРодительскойПлатыПоДетям.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Отбор);
		МенеджерЗаписи.Прочитать();
		
		Если НЕ МенеджерЗаписи.Выбран() Тогда
			ВызватьИсключение НСтр("ru = 'Ошибка чтения записи'");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, НовыеПараметры);
		
		МенеджерЗаписи.Записать(Истина);
		Результат = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось изменить параметры компенсации ребенка ""%1"" по причине: %2'"),
			Отбор.Ребенок, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(ТекстОшибки, Отбор.Ребенок.Метаданные(), Отбор.Ребенок);
		РезультатОбработки.Добавить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ИзменитьПараметрыКомпенсацииРебенка(Организация, Ребенок, НовыеПараметрыКомпенсации, РезультатОбработки)
	
	Результат = Истина; 
	НачатьТранзакцию();
	Попытка
		
		УстановитьБлокировкуПараметровКомпенсации(Ребенок);
		
		НаборЗаписей = РегистрыСведений.ПараметрыКомпенсацииРодительскойПлатыПоДетям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Отбор.Ребенок.Установить(Ребенок);
		НаборЗаписей.Прочитать();
		
		ВставитьСтрокуКомпенсацииВНабор(НаборЗаписей, НовыеПараметрыКомпенсации);
		
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось изменить параметры компенсации ребенка ""%1"" по причине: %2'"),
			Ребенок, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписатьИнформациюОбОшибкеВЖурналРегистрации(ТекстОшибки, Ребенок.Метаданные(), Ребенок);
		РезультатОбработки.Добавить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьБлокировкуПараметровКомпенсации(Ребенок)
	
	Блокировка = Новый БлокировкаДанных();
	ЭлементБлокировки = Блокировка.Добавить("Справочник.Дети");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", Ребенок);
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПараметрыКомпенсацииРодительскойПлатыПоДетям");
	ЭлементБлокировки.УстановитьЗначение("Ребенок", Ребенок);
	Блокировка.Заблокировать();
	
	РебенокОбъект = Ребенок.ПолучитьОбъект();
	РебенокОбъект.Заблокировать();
	
КонецПроцедуры

&НаСервере
Процедура ВставитьСтрокуКомпенсацииВНабор(НаборЗаписей, НовыеПараметрыКомпенсации)
	
	ВсеЗаписи = НаборЗаписей.Выгрузить();
	СтрокиПоНастройкеКомпенсации = ВсеЗаписи.НайтиСтроки(Новый Структура("НастройкаКомпенсации", НовыеПараметрыКомпенсации.НастройкаКомпенсации));
	ЗаписиПоНастройкеКомпенсации = ВсеЗаписи.Скопировать(СтрокиПоНастройкеКомпенсации);
	ЗаписиПоНастройкеКомпенсации.Колонки.Добавить("ЭтоНоваяСтрока", Новый ОписаниеТипов("Булево"));
	
	НоваяСтрока = ЗаписиПоНастройкеКомпенсации.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыеПараметрыКомпенсации);
	НоваяСтрока.Ребенок = НаборЗаписей.Отбор.Ребенок.Значение;
	НоваяСтрока.Организация = НаборЗаписей.Отбор.Организация.Значение;
	НоваяСтрока.ЭтоНоваяСтрока = Истина;
	
	ЗаписиПоНастройкеКомпенсации.Сортировать("ДатаНачала");

	ИндексНовойСтроки = ЗаписиПоНастройкеКомпенсации.Индекс(НоваяСтрока);
	
	СтрокиКУдалению = Новый Массив;
	
	Если ИндексНовойСтроки > 0 Тогда
		ПредыдущаяСтрока = ЗаписиПоНастройкеКомпенсации[ИндексНовойСтроки - 1];
		Если Не ЗначениеЗаполнено(ПредыдущаяСтрока.ДатаОкончания)
			Или ПредыдущаяСтрока.ДатаОкончания >= НоваяСтрока.ДатаНачала Тогда
			
			ПредыдущаяСтрока.ДатаОкончания = НоваяСтрока.ДатаНачала - 1;
			Если ПредыдущаяСтрока.ДатаОкончания < ПредыдущаяСтрока.ДатаНачала Тогда
				СтрокиКУдалению.Добавить(ПредыдущаяСтрока);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Для ИндексПоследующих = ИндексНовойСтроки + 1 По ЗаписиПоНастройкеКомпенсации.Количество() - 1 Цикл
		
		СледующаяСтрока = ЗаписиПоНастройкеКомпенсации[ИндексПоследующих];
		Если Не ЗначениеЗаполнено(НоваяСтрока.ДатаОкончания)
			ИЛИ (СледующаяСтрока.ДатаОкончания <= НоваяСтрока.ДатаОкончания) Тогда
			СтрокиКУдалению.Добавить(СледующаяСтрока);
		ИначеЕсли СледующаяСтрока.ДатаНачала > НоваяСтрока.ДатаОкончания Тогда
			Прервать;
		Иначе
			СледующаяСтрока.ДатаНачала = КонецДня(НоваяСтрока.ДатаОкончания) + 1;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока Из СтрокиКУдалению Цикл
		ЗаписиПоНастройкеКомпенсации.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	Для Каждого СтрокаПоНастройке Из СтрокиПоНастройкеКомпенсации Цикл
		ВсеЗаписи.Удалить(СтрокаПоНастройке);
	КонецЦикла;
	
	Для Каждого НоваяСтрокаПоНастройке Из ЗаписиПоНастройкеКомпенсации Цикл
		ЗаполнитьЗначенияСвойств(ВсеЗаписи.Добавить(), НоваяСтрокаПоНастройке);
	КонецЦикла;
	
	НаборЗаписей.Загрузить(ВсеЗаписи);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВариантОтбораКомпенсацииПоПериодуНаДату(Форма)
	Возврат Форма.ВариантОтбораКомпенсацииПоПериоду = 0;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВариантОтбораКомпенсацииПоПериодуТочноеСоответствие(Форма)
	Возврат Форма.ВариантОтбораКомпенсацииПоПериоду = 1;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВариантОтбораКомпенсацииПоПериодуВсеПериоды(Форма)
	Возврат Форма.ВариантОтбораКомпенсацииПоПериоду = 2;
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоПриказНаДопУслугу(ВидПриказа)
	Возврат (ВидПриказа.УправлениеДополнительнойУслугой = 1);
КонецФункции

&НаСервере
Процедура УстановитьВидимостьПоВидуПриказа()
	
	ДопУслуга = ЭтоПриказНаДопУслугу(УчащиесяВидПриказа);
	
	Элементы.УчащиесяДатаОкончанияДействия.Видимость = ДопУслуга;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнакиПризаполненииПлательщиков(ТекущиеДанные)
	
	ТекущиеДанные.Пометка = Истина;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ДатаНачалаНовый) Тогда
		ТекущиеДанные.ДатаНачалаНовый = ДатаВступленияВСилу;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПараметрыПлательщиков(Отказ, РезультатОбработки)

	Для Каждого Стр Из ПараметрыПлательщиков Цикл
		Если НЕ Стр.Пометка
			ИЛИ Стр.СтрокаОбработана
			ИЛИ НЕ РекизитыИзменились(Стр, "Плательщик, СчетПлательщика, ДатаНачала") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗаписатьИзменениеПараметровПлательщиков(Стр, РезультатОбработки) Тогда
			Стр.СтрокаОбработана = Истина;
			Стр.ОшибкаОбработки = Ложь;
			Стр.Пометка = Ложь;
		Иначе
			Стр.ОшибкаОбработки = Истина;
			Отказ = Истина;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьИзменениеПараметровПлательщиков(Строка, РезультатОбработки)
	
	Результат = Истина;
	
	НаборЗаписей = РегистрыСведений.ПлательщикиПоУслугамДДУ.СоздатьНаборЗаписей();
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.Дети");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Строка.Ребенок);
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПлательщикиПоУслугамДДУ");
		ЭлементБлокировки.УстановитьЗначение("Организация", Строка.Организация);
		ЭлементБлокировки.УстановитьЗначение("Ребенок", Строка.Ребенок);
		Блокировка.Заблокировать();
	
		РебенокОбъект = Строка.Ребенок.ПолучитьОбъект();
		РебенокОбъект.Заблокировать();
		
		//ДобавитьЗаписьГруппыДДУ(НаборЗаписей, Строка);
		Запись = НаборЗаписей.Добавить();
		Запись.Период  = Строка.ДатаНачалаНовый;
		Запись.Организация = Строка.Организация;
		Запись.Ребенок = Строка.Ребенок;
		Запись.Плательщик = Строка.ПлательщикНовый;
		Запись.СчетПлательщика = Строка.СчетПлательщикаНовый;
		
		НаборЗаписей.Записать(Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Результат = Ложь;
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось записать плательщика по ребенку %1 по причине: %2'"),
				Строка.Ребенок,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ИмяСобытияЖурналаРеистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ПлательщикиПоУслугамДДУ,
			Строка.Ребенок,
			ТекстОшибки);
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

#КонецОбласти
