#Область ОписаниеПеременных

&НаКлиенте
Перем ВыборБСООбработан; // Булево

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	ЗаполнитьДлиныНомеров();
	
	Если Параметры.Ключ.Пустая() Тогда 
		Если Не ЗначениеЗаполнено(Объект.Руководитель) Тогда
			УстановитьРуководителя(Объект);
		КонецЕсли; 
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	Элементы.Подразделение.АвтоОтметкаНезаполненного = ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоПодразделениям
		И ЗначениеЗаполнено(Объект.СчетУчета)
		И БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Объект.СчетУчета).УчетПоПодразделениям
		И Не БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Объект.СчетУчета).РазрешитьНеУказыватьПодразделение;
	
	ПервичныеДокументыБГУ.ПриСозданииНаСервере(ЭтотОбъект);
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтотОбъект, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриЧтенииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	ПодготовитьФормуНаСервере();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства  
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
		
	// Вид межотчетного периода необходимо очистить, если дата <> конец года.
	// После очистки реквизита выбранная типовая операция может оказаться недопустимой
	ОбщегоНазначенияБГУ.ОчиститьВидМежотчетногоПериода(ТекущийОбъект, Объект);
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом 
	
	ОбщегоНазначенияБГУ.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "ДатыПроведенияДокументов", Новый Структура("Документ", ДокументСсылка),,,Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации();
	ВыборБСООбработан = Ложь;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ЗаполнитьДлиныНомеров();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") И ЭтоАдресВременногоХранилища(ВыбранноеЗначение) Тогда
		ЗагрузитьТЧИзХранилища(ВыбранноеЗначение);	
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ПостоянноДействующиеКомиссии.Форма.ФормаВыбора" Тогда
		УправлениеМатериальнымиЗапасамиКлиент.УстановитьКомиссиюВДокументМЗ(ВыбранноеЗначение, Объект, ЭтотОбъект, Объект.НомерПриказа, Объект.ДатаПриказа);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	УстановитьРуководителя(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВМежотчетномПериодеПриИзменении(Элемент)
	Если ОтразитьВМежотчетномПериоде Тогда
		Объект.Дата = КонецГода(Объект.Дата);
		ОбщегоНазначенияБГУКлиент.УстановитьЗаголовокРеквизитаДатаПроведения(ЭтотОбъект, Объект);
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"));
	Иначе
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка"));
	КонецЕсли;
	
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйДокументПриИзменении(Элемент)
	ПервичныйДокументПриИзмененииНаСервере();
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Если РешениеСотрудникаМодифицированность
		И ЗначениеЗаполнено(ВыбранныйСотрудник)
		И ВыбранныйСотрудник <> Сотрудник Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Сотрудник", ВыбранныйСотрудник);
		ДопПараметры.Вставить("РезультатыГолосования", Новый Массив);
		Для Каждого СтрокаОС Из Объект.СоставБСО Цикл
			Если ЗначениеЗаполнено(СтрокаОС.РешениеСотрудникаПоРезолюции) Тогда
				РезультатГолосования = Новый Структура("ИдентификаторСтроки,РешениеСотрудникаПоРезолюции",
					СтрокаОС.ИдентификаторСтроки, СтрокаОС.РешениеСотрудникаПоРезолюции);
				ДопПараметры.РезультатыГолосования.Добавить(РезультатГолосования);
			КонецЕсли;
		КонецЦикла;
		
		Оповещение = Новый ОписаниеОповещения("ВопросСохранитьРезультатыГолосованияЗавершение", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Сохранить результаты голосования члена комиссии ""%1""?'"), ВыбранныйСотрудник);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	СотрудникПриИзмененииНаСервере();
	
	ВыбранныйСотрудник = Сотрудник;
	
	РешениеСотрудникаМодифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОтборПрисутствующих = Новый Структура("Отсутствует", Ложь);
	ПрисутствующиеЧленыКомиссии = Объект.СоставКомиссии.НайтиСтроки(ОтборПрисутствующих);
	
	// Выбирается из присутствующих членов комиссии.
	Элемент.СписокВыбора.Очистить();
	Для Каждого ЧленКомиссии Из ПрисутствующиеЧленыКомиссии Цикл
		Элемент.СписокВыбора.Добавить(ЧленКомиссии.Сотрудник);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	КомиссияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НадписьФайлНеВыбранНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФайлСотрудника) Тогда
		ОповещениеФайла = Новый ОписаниеОповещения("ОбработатьВыборФайлаСотрудника", ЭтотОбъект);
		РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(Объект.Ссылка, Элементы.ФайлСотрудника, ,ОповещениеФайла);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьУдалитьФайлНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Или Не ЗначениеЗаполнено(ФайлСотрудника) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрепитьФайлСотрудникаНаСервере();
	
КонецПроцедуры

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтотОбъект.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);	

КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперации()
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере()
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставБСО

&НаКлиенте
Процедура СоставБСОПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	УстановитьМаскуПолейПорядковогоНомера(ТекущиеДанные.ДлинаНомера);
	Если НоваяСтрока Тогда
		ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура  СоставБСООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ПричиныСписанияНФА") Тогда
		ЭтоАктОСписании0510461 = ПервичныеДокументыБГУКлиентСервер.ВыбранУказанныйПервичныйДокумент(
			Объект.ПервичныйДокумент, "АктОСписанииБСО0510461_157н");
		ИмяКолонки = ?(ЭтоАктОСписании0510461, "ПричинаСписанияСсылка", "ПричинаСписания");

		МассивСтрок = Элементы.СоставБСО.ВыделенныеСтроки;
		Для Каждого ЭлМас Из МассивСтрок Цикл
			ТекСтр = Объект.СоставБСО.НайтиПоИдентификатору(ЭлМас);
			Если ТекСтр <> Неопределено Тогда
				ТекСтр[ИмяКолонки] = ВыбранноеЗначение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставБСОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.РешениеСотрудникаПоРезолюцииВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СоставБСОНомерНачальныйПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставБСО.ТекущиеДанные;
	УправлениеМатериальнымиЗапасамиКлиент.ОтформатироватьВведенныйНомерБСО(ТекущиеДанные, "НомерНачальный", Истина);
КонецПроцедуры

&НаКлиенте
Процедура СоставБСОНомерКонечныйПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставБСО.ТекущиеДанные;
	УправлениеМатериальнымиЗапасамиКлиент.ОтформатироватьВведенныйНомерБСО(ТекущиеДанные, "НомерКонечный", Истина);
КонецПроцедуры

&НаКлиенте
Процедура СоставБСОКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставБСО.ТекущиеДанные;
	УправлениеМатериальнымиЗапасамиКлиент.ЗаполнитьНомерКонечныйПоНомеруНачальномуИКоличеству(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СоставБСОБСОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.БСО.ФормаВыбора", Новый Структура("ТребуемыеДанные", "ДлинаНомера"), Элемент);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СоставБСОБСОПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СоставБСО.ТекущиеДанные;
	Если Не ВыборБСООбработан Тогда
		ТекущиеДанные.ДлинаНомера =  ПолучитьДлинуНомера(ТекущиеДанные.БСО);
	КонецЕсли;
	УстановитьМаскуПолейПорядковогоНомера(ТекущиеДанные.ДлинаНомера);
	ВыборБСООбработан = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СоставБСОБСООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработатьВыборБСО(ВыбранноеЗначение, Элементы.СоставБСО.ТекущиеДанные, ВыборБСООбработан);
КонецПроцедуры

&НаКлиенте
Процедура СоставБСОРешениеСотрудникаПоРезолюцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СоставБСО.ТекущиеДанные;
	ТекущиеДанные.РешениеСотрудникаПоРезолюции = ВыбранноеЗначение;
	
	РешениеСотрудникаМодифицированность = Истина;
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СоставБСОПричинаСписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.ПричиныСписанияНФА.ФормаВыбора", , Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		НоваяСтрока = Объект.СоставКомиссии.Добавить();
		ВыбранноеЗначение.Свойство("Должность", НоваяСтрока.ДолжностьЧленаКомиссии);
		ВыбранноеЗначение.Свойство("Фамилия", 	НоваяСтрока.ФамилияЧленаКомиссии);
		ВыбранноеЗначение.Свойство("Имя", 		НоваяСтрока.ИмяЧленаКомиссии);
		ВыбранноеЗначение.Свойство("Отчество",	НоваяСтрока.ОтчествоЧленаКомиссии);
		
		СтандартнаяОбработка = Ложь;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии1
 
&НаКлиенте
Процедура СоставКомиссии1ПриИзменении(Элемент)
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1ОтсутствуетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии1.ТекущиеДанные;
	Если Не ТекущиеДанные.Отсутствует Тогда
		ТекущиеДанные.ПричинаОтсутствия = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1ПричинаОтсутствияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии1.ТекущиеДанные;
	ТекущиеДанные.Отсутствует = Не ПустаяСтрока(ТекущиеДанные.ПричинаОтсутствия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1ПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора",, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подобрать(Команда)
	ОтборПодбора = УправлениеМатериальнымиЗапасамиКлиент.ПолучитьСтруктуруПараметровПодбораБСО();
	ОтборПодбора.Организация	= Объект.Организация;
	ОтборПодбора.ЦМО			= Объект.ЦМО;
	ОтборПодбора.КФО			= Объект.КФО;
	ОтборПодбора.ИФО			= Объект.ИФО;
	ОтборПодбора.СчетУчета		= Объект.СчетУчета;
	УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборБСО(	ЭтотОбъект, ПоместитьТЧВХранилище(), ОтборПодбора);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПричинуСписания(Команда)
	ОткрытьФорму("Справочник.ПричиныСписанияНФА.ФормаВыбора",,Элементы.СоставБСО);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПриказ(Команда)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", Объект.Организация));
		ОткрытьФорму("Справочник.ПостоянноДействующиеКомиссии.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);	
	Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Сначала необходимо выбрать организацию'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателя(Команда)
	ИменаРеквизитов = ОбщегоНазначенияБГУКлиент.СтруктураИменРеквизитовВыбораПредседателяКомиссии(
		"ДолжностьПредседательКомиссии", "ФамилияПредседательКомиссии", "ИмяПредседательКомиссии",
		"ОтчествоПредседательКомиссии");
		
	ОбщегоНазначенияБГУКлиент.НачатьВыборПредседателяКомиссии(ЭтотОбъект, ИменаРеквизитов);
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьКомиссию(Команда)
	ПараметрыФормы = Новый Структура(	"ТребуемыеДанные, Отбор, ЗакрыватьПриВыборе",
										"Фамилия, Имя, Отчество, Должность",
										Новый Структура("Владелец", Объект.Организация),
										Ложь);
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Элементы.СоставКомиссии);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьРезультатыГолосования(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Сотрудник", Сотрудник);
	ДопПараметры.Вставить("РезультатыГолосования", Новый Массив);
	Для Каждого Строка Из Объект.СоставБСО Цикл
		Если ЗначениеЗаполнено(Строка.РешениеСотрудникаПоРезолюции) Тогда
			РезультатГолосования = Новый Структура("ИдентификаторСтроки,РешениеСотрудникаПоРезолюции",
				Строка.ИдентификаторСтроки, Строка.РешениеСотрудникаПоРезолюции);
			ДопПараметры.РезультатыГолосования.Добавить(РезультатГолосования);
		КонецЕсли;
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("ВопросСохранитьРезультатыГолосованияЗавершение", ЭтотОбъект, ДопПараметры);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Сохранить результаты голосования члена комиссии ""%1""?'"), Сотрудник);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЗаВоВсехСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("За", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеПротивВоВсехСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("Против", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЗаВВыделенныхСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("За", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеПротивВВыделенныхСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("Против", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЕдиногласноЗаВоВсехСтроках(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ был изменен. Сначала следует записать документ!'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросУстановитьРешениеЕдиногласноЗавершение", ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.За"));
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Будет установлено и сохранено решение %1 для всех присутствующих членов комиссии по всем строкам документа.
			|Все предыдущие результаты голосования по документу будут перезаписаны.'"), "За");
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = ' Проведение документа будет отменено.'");
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ru = ' Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЕдиногласноПротивВоВсехСтроках(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ был изменен. Сначала следует записать документ!'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросУстановитьРешениеЕдиногласноЗавершение", ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.Против"));
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Будет установлено и сохранено решение %1 для всех присутствующих членов комиссии по всем строкам документа.
			|Все предыдущие результаты голосования по документу будут перезаписаны.'"), "Против");
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = ' Проведение документа будет отменено.'");
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ru = ' Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПервичныйДокументПриИзмененииНаСервере()
	
	Если ПервичныеДокументыБГУКлиентСервер.ВыбранУказанныйПервичныйДокумент(Объект.ПервичныйДокумент,
			"АктОСписанииБСО0510461_157н")
			И Объект.СоставБСО.Количество() > 0 Тогда
		// Если документ был заполнен ранее, в нем не заполнен идентификатор строки.
		ПроверитьЗаполнениеИдентификатораСтроки();
	КонецЕсли;
	
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	ОбщегоНазначенияБГУ.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	// Решение сотрудника.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.СоставБСОРешениеСотрудникаПоРезолюции.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.СоставБСО.РешениеСотрудникаПоРезолюции", ВидСравненияКомпоновкиДанных.Равно,
			Перечисления.РезультатыГолосованияЧленовКомиссии.За);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.СоставБСОРешениеСотрудникаПоРезолюции.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.СоставБСО.РешениеСотрудникаПоРезолюции", ВидСравненияКомпоновкиДанных.Равно,
			Перечисления.РезультатыГолосованияЧленовКомиссии.Против);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи);

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт

	БухгалтерскийУчетКлиент.ОчиститьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	УстановитьРуководителя(Объект);
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	БухгалтерскийУчетКлиентСервер.УстановитьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРуководителя(Объект)

	НовыйРуководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации("Руководитель",
		Объект.Организация, Объект.Дата, Объект.Подразделение);
	
	Если ЗначениеЗаполнено(НовыйРуководитель.ОтветственноеЛицоСсылка) 
		И Объект.Руководитель <> НовыйРуководитель.ОтветственноеЛицоСсылка Тогда
		Объект.Руководитель = НовыйРуководитель.ОтветственноеЛицоСсылка;
		#Если НаКлиенте Тогда
		ПоказатьОповещениеПользователя(,,НСтр("ru = 'Установлено новое значение поля ""Руководитель""'"));
		#КонецЕсли
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации()

	Элементы.ЦМО.Доступность			= ЗначениеЗаполнено(Объект.Организация);
	Элементы.Подразделение.Доступность	= ЗначениеЗаполнено(Объект.Организация);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьМаскуПолейПорядковогоНомера(ДлинаНомера)

	#Если НЕ ВебКлиент Тогда
	УправлениеМатериальнымиЗапасамиКлиент.УстановитьМаскуПолейПорядковогоНомера(ДлинаНомера,
																				Элементы.СоставБСОНомерНачальный,
																				Элементы.СоставБСОНомерКонечный);
	#КонецЕсли
																				
КонецПроцедуры // УстановитьМаскуПолейПорядковогоНомера()

&НаСервере
Процедура ЗаполнитьДлиныНомеров()

	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Объект.СоставБСО.Выгрузить().ВыгрузитьКолонку("БСО"), "ДлинаНомера");
	Для каждого ТекСтр Из Объект.СоставБСО Цикл
		ТекБСО = ЗначенияРеквизитов[ТекСтр.БСО];
		Если ТекБСО <> Неопределено Тогда
			ТекСтр.ДлинаНомера = ТекБСО.ДлинаНомера;
		КонецЕсли;
	КонецЦикла; 	

КонецПроцедуры // ЗаполнитьДлиныНомеров()

&НаСервере
Функция ПоместитьТЧВХранилище()

	Возврат ПоместитьВоВременноеХранилище(Объект.СоставБСО.Выгрузить(), УникальныйИдентификатор);	

КонецФункции // ПоместитьТоварыВХранилище()

&НаСервере
Процедура ЗагрузитьТЧИзХранилища(АдресВременногоХранилища)

	Объект.СоставБСО.Загрузить(ПолучитьИзВременногоХранилища(АдресВременногоХранилища));
	Для каждого Строка Из Объект.СоставБСО Цикл
		
		Если Не ЗначениеЗаполнено(Строка.ИдентификаторСтроки) Тогда
			Строка.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	
	КонецЦикла;

	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии

КонецПроцедуры // ЗагрузитьТЧИзХранилища()

&НаСервереБезКонтекста 
Функция ПолучитьДлинуНомера(ТекБСО)
	Возврат  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекБСО, "ДлинаНомера");
КонецФункции

// Файлы сотрудников

&НаКлиенте
Процедура ОбработатьВыборФайлаСотрудника(ЗначениеВыбора, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		ОбработатьВыборФайлаСотрудникаНаСервере(ЗначениеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборФайлаСотрудникаНаСервере(ЗначениеВыбора)
	
	РаботаСФайламиБГУ.ОбработатьВыборФайлаСотрудника(ЗначениеВыбора, Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОткрепитьФайлСотрудникаНаСервере()
	
	РаботаСФайламиБГУ.ОткрепитьФайлСотрудника(ФайлСотрудника, Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

// Конец Файлы сотрудников

&НаСервере
Процедура КомиссияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ЗаполнитьСоставКомиссии(ЭтотОбъект);
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.КомиссияПриИзмененииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
	РаботаСФайламиБГУ.ПолучитьФайлСотрудника(Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьРезультатыГолосованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьРезультатыГолосованияНаСервере(ДополнительныеПараметры.Сотрудник, ДополнительныеПараметры.РезультатыГолосования);
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Ложь; // При любом ответе сбрасываем признак модифицированности.
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРезультатыГолосованияНаСервере(ЧленКомиссии, РезультатыГолосования)
	
	ОбщегоНазначенияБГУ.СохранитьРезультатыГолосованияНаСервере(Объект, ЧленКомиссии, РезультатыГолосования);
	РешениеСотрудникаМодифицированность = Ложь;
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУстановитьРешениеЕдиногласноЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		УстановитьРешениеЕдиногласноНаСервере(ДополнительныеПараметры);
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Ложь; // При любом ответе сбрасываем признак модифицированности.
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРешениеЕдиногласноНаСервере(РезультатГолосования)
	
	ОбщегоНазначенияБГУ.УстановитьРешениеЕдиногласноНаСервере(Объект, "СоставБСО", РезультатГолосования);
	РешениеСотрудникаМодифицированность = Ложь;
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеВСтрокахДокумента(РешениеСотрудника, ВоВсехСтроках = Истина)
	
	РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.ПустаяСсылка");
	Если РешениеСотрудника = "За" Тогда
		РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.За");
	ИначеЕсли РешениеСотрудника = "Против" Тогда
		РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.Против");
	КонецЕсли;
	
	Если ВоВсехСтроках Тогда
		Для Каждого СтрокаДокумента Из Объект.СоставБСО Цикл
			СтрокаДокумента.РешениеСотрудникаПоРезолюции = РешениеСотрудникаПоРезолюции;
		КонецЦикла;
	Иначе
		Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.СоставБСО.ВыделенныеСтроки Цикл
			СтрокаДокумента = Объект.СоставБСО.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
			СтрокаДокумента.РешениеСотрудникаПоРезолюции = РешениеСотрудникаПоРезолюции;
		КонецЦикла;
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Истина;
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СохранитьРезультатыГолосования", "Доступность",
			ЗначениеЗаполнено(Форма.Сотрудник) И Форма.РешениеСотрудникаМодифицированность);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеИдентификатораСтроки()

	Для каждого Строка Из Объект.СоставБСО Цикл
		Если Не ЗначениеЗаполнено(Строка.ИдентификаторСтроки) Тогда
			Строка.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоАктОСписании0510461 = ПервичныеДокументыБГУКлиентСервер.ВыбранУказанныйПервичныйДокумент(
		Объект.ПервичныйДокумент, "АктОСписанииБСО0510461_157н");
	
	// Элементы только акта списания 0510461
	Элементы61н = Новый Массив;
	Элементы61н.Добавить("ТребуетсяУтилизация");
	Элементы61н.Добавить("НадписьГолосование");
	Элементы61н.Добавить("Сотрудник");
	Элементы61н.Добавить("СохранитьРезультатыГолосования");
	Элементы61н.Добавить("НадписьФайл");
	Элементы61н.Добавить("СоставБСОУстановитьРешениеЗаВоВсехСтроках");
	Элементы61н.Добавить("СоставБСОУстановитьРешениеПротивВоВсехСтроках");
	Элементы61н.Добавить("СоставБСОУстановитьРешениеЗаВВыделенныхСтроках");
	Элементы61н.Добавить("СоставБСОУстановитьРешениеПротивВВыделенныхСтроках");
	Элементы61н.Добавить("СоставБСОПричинаСписанияСсылка");
	Элементы61н.Добавить("Комиссия");
	Элементы61н.Добавить("ГруппаИндикаторКворумаПрисутствия");
	Элементы61н.Добавить("ГруппаКомиссия61н");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, Элементы61н,
		"Видимость", ЭтоАктОСписании0510461);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФайлСотрудника",
		"Видимость", ЭтоАктОСписании0510461 И ЗначениеЗаполнено(Форма.ФайлСотрудника));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьУдалитьФайл",
		"Видимость", ЭтоАктОСписании0510461 И ЗначениеЗаполнено(Форма.ФайлСотрудника));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьФайлНеВыбран",
		"Видимость", ЭтоАктОСписании0510461 И Не ЗначениеЗаполнено(Форма.ФайлСотрудника));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставБСОРешениеСотрудникаПоРезолюции",
		"Видимость", ЭтоАктОСписании0510461 И ЗначениеЗаполнено(Форма.ВыбранныйСотрудник));
	
	// Элементы акта списания 0504816
	Элементы52н = Новый Массив;
	Элементы52н.Добавить("СоставКомиссии");
	Элементы52н.Добавить("НомерПриказа");
	Элементы52н.Добавить("ДатаПриказа");
	Элементы52н.Добавить("ВыбратьПриказ");
	Элементы52н.Добавить("ДолжностьПредседательКомиссии");
	Элементы52н.Добавить("ФамилияПредседательКомиссии");
	Элементы52н.Добавить("ИмяПредседательКомиссии");
	Элементы52н.Добавить("ОтчествоПредседательКомиссии");
	Элементы52н.Добавить("ВыбратьПредседателя");
	Элементы52н.Добавить("ЗаключениеКомиссии");
	Элементы52н.Добавить("СоставБСОПричинаСписания");
	Элементы52н.Добавить("СоставБСОДатаУничтожения");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, Элементы52н,
		"Видимость", Не ЭтоАктОСписании0510461);
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

