
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.РазделениеВключено() 
		И НЕ ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"Тип", Тип("ДокументСсылка.ЗакрытиеГода"), , , Ложь,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	ОбщегоНазначенияБГУ.УстановитьОтборСпискаПоОрганизации(ЭтотОбъект);
	
	Элементы.КнопкаПроводки.Пометка = Ложь;
	Элементы.ЖурналПроводок.Видимость = Элементы.КнопкаПроводки.Пометка;
	
	Если НЕ (РольДоступна(Метаданные.Роли.ДобавлениеИзменениеРегламентныхОпераций)
			ИЛИ РольДоступна(Метаданные.Роли.ПолныеПрава)) Тогда
		Элементы.Список.ИзменятьПорядокСтрок = Ложь;
		Элементы.Список.ИзменятьСоставСтрок  = Ложь;
		ОбщегоНазначенияБГУ.УстановитьНевидимыеКомандыЖурнала(Элементы, "Список");
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КомандыФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ИнтеграцияС1САрхивом  
	ПараметрыРазмещения = ОбменСАрхивом.ПараметрыРазмещенияЭлементов();
	ПараметрыРазмещения.ИмяСписка = "Список";
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец ИнтеграцияС1САрхивом
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДокументыПоЗакрытиюМесяцаИзменение" Тогда
		Элементы.Список.Обновить();
	ИначеЕсли ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОбщегоНазначенияБГУКлиентСервер.ИзменитьОтборСпискаПоОрганизации(Список, , Параметр);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если Элементы.КнопкаПроводки.Пометка Тогда
		ПодключитьОбработчикОжидания("ПроверкаНеобходимостиЗаполнения", 0.4, Истина);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если Элементы.КнопкаПроводки.Пометка Тогда
		ПодключитьОбработчикОжидания("ПроверкаНеобходимостиЗаполнения", 0.4, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ОбщегоНазначенияБГУКлиент.НачатьЗамерВремениДобавление(Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ОбщегоНазначенияБГУКлиент.НачатьЗамерВремениОткрытие(Элемент);
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	ОбщегоНазначенияБГУ.ВосстановитьОтборСписка(Список, Настройки, "Организация");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.СписокВыбор(ЭтотОбъект, Поле, ВыбраннаяСтрока, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ЖурналПроводок

&НаКлиенте
Процедура ЖурналПроводокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ОткрытьРегистраторТекущейСтроки(
		ЖурналПроводок.НайтиПоИдентификатору(ВыбраннаяСтрока));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьПроводки(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ТипДокумента = ТипЗнч(ТекущиеДанные.Ссылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.ЗакрытиеГодаТехнологическоеГрупповое") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ТекущиеДанные.Ссылка);
		ОткрытьФорму("Документ.ЗакрытиеГодаТехнологическоеГрупповое.Форма.ФормаБухгалтерскойОперации", ПараметрыФормы, ЭтотОбъект);
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ФормированиеОстатковПоРасчетам") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ТекущиеДанные.Ссылка);
		ОткрытьФорму("Документ.ФормированиеОстатковПоРасчетам.Форма.ФормаБухгалтерскойОперации", ПараметрыФормы, ЭтотОбъект);
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗакрытиеОстатковПоЖурналамСлужебный") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ТекущиеДанные.Ссылка);
		ОткрытьФорму("Документ.ЗакрытиеОстатковПоЖурналамСлужебный.Форма.ФормаБухгалтерскойОперации", ПараметрыФормы, ЭтотОбъект);
	Иначе
		ПараметрыФормы = Новый Структура("ДокументОснование", ТекущиеДанные.Ссылка);
		ОткрытьФорму("Обработка.ФормированиеБухгалтерскихПроводок.Форма.Форма", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Проводки(Команда)
	Элементы.КнопкаПроводки.Пометка = НЕ Элементы.КнопкаПроводки.Пометка;
	Элементы.ЖурналПроводок.Видимость = Элементы.КнопкаПроводки.Пометка;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборЖурналаПроводок(Знач Ссылка)
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ИзменениеПараметровАмортизации") 
		ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗакрытиеГодаТехнологическоеГрупповое")
		ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.ИнвентаризацияОС") Тогда
		Ссылка = Неопределено;
	КонецЕсли;
	Проводки = РеквизитФормыВЗначение("ЖурналПроводок");
	Проводки.Отбор.Регистратор.Значение = Ссылка;
	Проводки.Отбор.Регистратор.Использование = Истина;
	Проводки.Прочитать();
	ЗначениеВРеквизитФормы(Проводки,"ЖурналПроводок");
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаНеобходимостиЗаполнения()
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Если Элементы.Список.ТекущиеДанные.Свойство("Ссылка") Тогда
			УстановитьОтборЖурналаПроводок(Элементы.Список.ТекущиеДанные.Ссылка);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	УстановитьОтборЖурналаПроводок(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыПодсистемыИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти
