#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеДоходовБудущихПериодов") Тогда
		
		ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
			"Организация,ИФО,КФО,КПС,КЭК,Подразделение,Контрагент,Договор,ВалютаДокумента,СуммаВключаетНДС,ТипЦены,ВидОперации");
		
		Если ДанныеОснования.ВидОперации = Перечисления.ВидыОперацийНачисленияДБП.ПередачаВБезвозмездноеПользование Тогда
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='В документе %1 установлен вид операции ""%2"". В этом случае оплата по договору не взимается.'"),
					ДанныеЗаполнения,
					ДанныеОснования.ВидОперации);
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеОснования);
		КОСГУ = ДанныеОснования.КЭК;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УслугиИРаботы.Ссылка КАК Ссылка,
		|	УслугиИРаботы.НомерСтроки КАК НомерСтроки,
		|	УслугиИРаботы.Номенклатура КАК Номенклатура,
		|	УслугиИРаботы.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
		|	УслугиИРаботы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	УслугиИРаботы.Количество КАК Количество,
		|	УслугиИРаботы.Цена КАК Цена,
		|	УслугиИРаботы.ЦенаСправедливая КАК ЦенаСправедливая,
		|	УслугиИРаботы.Сумма КАК Сумма,
		|	УслугиИРаботы.СуммаСправедливая КАК СуммаСправедливая,
		|	УслугиИРаботы.СтавкаНДС КАК СтавкаНДС,
		|	УслугиИРаботы.СуммаНДС КАК СуммаНДС,
		|	УслугиИРаботы.СуммаНДССправедливая КАК СуммаНДССправедливая,
		|	УслугиИРаботы.Всего КАК Всего,
		|	УслугиИРаботы.ВсегоСправедливая КАК ВсегоСправедливая
		|ИЗ
		|	Документ.НачислениеДоходовБудущихПериодов.УслугиИРаботы КАК УслугиИРаботы
		|ГДЕ
		|	УслугиИРаботы.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		УслугиИРаботыОснования = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаОснования Из УслугиИРаботыОснования Цикл
			
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОснования, "Номенклатура,СтавкаНДС");
			НоваяСтрока.Содержание = СтрокаОснования.НоменклатураНаименованиеПолное;
			
			// В документе "Начисление доходов будущих периодов" указана полная стоимость по договору, за весь период действия.
			// В счете на оплату суммы заполняем из расчета за одну единицу номенклатуры оказываемых услуг.
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = СтрокаОснования.Цена;
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
			УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(НоваяСтрока, "Цена", ПараметрыРасчета);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(СсылочныйИдентификаторСервисаПриемаПлатежей) Тогда
		СсылочныйИдентификаторСервисаПриемаПлатежей = ИнтеграцияССервисомПриемаПлатежейБГУ.СсылочныйИдентификатор();
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ ПрименяетсяФорматЗначенийФНС Тогда
		Для Каждого СтрокаТЧ Из Услуги Цикл
			СтрокаТЧ.Цена = Окр(СтрокаТЧ.Цена, 2);
		КонецЦикла;	
		Для Каждого СтрокаТЧ Из Материалы Цикл
			СтрокаТЧ.Цена = Окр(СтрокаТЧ.Цена, 2);
		КонецЦикла;	
		Для Каждого СтрокаТЧ Из ОсновныеСредства Цикл
			СтрокаТЧ.Цена = Окр(СтрокаТЧ.Цена, 2);
		КонецЦикла;	
		Для Каждого СтрокаТЧ Из ВозвратнаяТара Цикл
			СтрокаТЧ.Цена = Окр(СтрокаТЧ.Цена, 2);
		КонецЦикла;	
	КонецЕсли;	
	
	СуммаДокумента = Услуги.Итог("Всего") + Материалы.Итог("Всего") + ОсновныеСредства.Итог("Всего") + ВозвратнаяТара.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли