
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.ДополнительныеПараметры.Свойство("ДатаДокумента", НаДату);			
	НаДатуИспользование = ЗначениеЗаполнено(НаДату); 
	
	УстановитьОтборНаДату(ЭтотОбъект);
	 		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура НаДатуИспользованиеПриИзменении(Элемент)
	
	ОбработатьИзменениеНаДату(Элемент);
	
КонецПроцедуры 

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	
	ОбработатьИзменениеНаДату(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьИзменениеНаДату(Элемент)
	
	Если Элемент.Имя = "НаДатуИспользование" И Не ЗначениеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДата();
		
	ИначеЕсли Элемент.Имя = "НаДату" Тогда
		НаДатуИспользование = ЗначениеЗаполнено(НаДату);
		
	КонецЕсли;
	
	УстановитьОтборНаДату(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборНаДату(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "НаДатуИспользование", Форма.НаДатуИспользование, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "НаДату", Форма.НаДату, Истина);
	
КонецПроцедуры

#КонецОбласти
