#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(Родитель) Тогда
		Возврат;
	КонецЕсли;
	
	ВладелецОбъекта = ЭтотОбъект.Владелец;
	ВладелецРодителя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Родитель,"Владелец");
	
	Если ВладелецОбъекта <> ВладелецРодителя Тогда
		Отказ = Истина;
		
		ТекстСообщения = НСтр("ru='Факультет ""%1"" перемещаемой группы ""%2"" не соответствует факультету родительской папки ""%3""!'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ВладелецОбъекта, ЭтотОбъект, ВладелецРодителя);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.Ссылка, , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли