////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПолучитьПользовательскиеФункции() Экспорт
	
	ТаблицаФункций = Новый Массив;
	
	ТаблицаФункций.Добавить("РеестрИмущества.ЗначениеРеквизита(Ссылка, ИмяРеквизита)");
	ТаблицаФункций.Добавить("РеестрИмущества.ЗначениеДополнительногоРеквизита(Ссылка, ИмяРеквизита)");
	ТаблицаФункций.Добавить("РеестрИмущества.ЗначениеРеквизитаОбъектаУчета(ОбъектУчета, ИмяРеквизита, <НаДату>)");
	ТаблицаФункций.Добавить("РеестрИмущества.КонтактнаяИнформация(Ссылка, <Вид>, <Тип>)");
	ТаблицаФункций.Добавить("РеестрИмущества.ПредставлениеАдреса(Адрес)");
	ТаблицаФункций.Добавить("РеестрИмущества.ОтветственноеЛицоОрганизации(Организация, <ЧастьФИО>, <НаДату>, <ВидОтветственногоЛица>)");
	ТаблицаФункций.Добавить("РеестрИмущества.ИнвентарныйНомерОбъекта(ОсновноеСредство)");
	ТаблицаФункций.Добавить("РеестрИмущества.ИнвентарныеНомера(ОсновноеСредство)");
	ТаблицаФункций.Добавить("РеестрИмущества.ПолучитьТекущуюДату()");
	ТаблицаФункций.Добавить("РеестрИмущества.ЗначениеСоответствуетМаске(Значение, Маска)");
	ТаблицаФункций.Добавить("РеестрИмущества.СведенияКадастровогоУчета(ОсновноеСредство, ИмяРеквизита, <НаДату>)");
	ТаблицаФункций.Добавить("РеестрИмущества.СведенияРеестровогоУчетаИмущества(ОбъектУчета, ИмяРеквизита)");
	ТаблицаФункций.Добавить("РеестрИмущества.СведенияПТС(ОсновноеСредство, ИмяРеквизита, <НаДату>)");
	ТаблицаФункций.Добавить("РеестрИмущества.ЗначениеКлассификатора(Код, <Отбор>)");
	ТаблицаФункций.Добавить("РеестрИмущества.Содержит(Строка, ПодстрокаПоиска)");
	ТаблицаФункций.Добавить("РеестрИмущества.ОбъектВИерархии(Объект, Группа)");
	ТаблицаФункций.Добавить("РеестрИмущества.СведенияУчастияВКапитале(ОбъектФинансовогоВложения, Сведение, <НаДату>)");
	ТаблицаФункций.Добавить("РеестрИмущества.УчетнаяПолитикаОрганизации(Организация, ИмяРеквизита, <НаДату>)");
	ТаблицаФункций.Добавить("РеестрИмущества.ОстаточнаяСтоимость(ОсновноеСредство, <НаДату>)");
	ТаблицаФункций.Добавить("РеестрИмущества.ПакетыАкций(Акция, <НаДату>, <Выражение1 [КАК ИмяКолонки1][, Выражение2 [КАК ИмяКолонки2],...]>)");
	ТаблицаФункций.Добавить("РеестрИмущества.ДанныеКонтрагента(Контрагент, Поле, <НаДату>)");	
	ТаблицаФункций.Добавить("РеестрИмущества.НайтиКонтрагентаПоОГРН(ОГРН)");	
	ТаблицаФункций.Добавить("РеестрИмущества.ДанныеОбъектаОС(ОсновноеСредство, ИмяРеквизита, <НаДату>");
	ТаблицаФункций.Добавить("РеестрИмущества.СтрокаВЧисло(Строка)");
	
	Возврат ТаблицаФункций;
	
КонецФункции


Функция ЗначениеРеквизита(Элемент, ИмяРеквизита) Экспорт
	
	Возврат ?(ЗначениеЗаполнено(Элемент), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент, ИмяРеквизита), Null);
	
КонецФункции

Функция ЗначениеДополнительногоРеквизита(Ссылка, ИмяРеквизита) Экспорт
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Null;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДополнительныеРеквизиты.Значение
	|ИЗ
	|	%1.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	ДополнительныеРеквизиты.Ссылка = &Ссылка
	|	И ДополнительныеРеквизиты.Свойство = &Реквизит";
	
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ОбщегоНазначенияБГУ.ВернутьСтрокуТипаПоТипу(ТипЗнч(Ссылка), "Запрос"));				   
				   		
	Попытка
		Реквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения[ИмяРеквизита];
	Исключение
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Свойство", "Свойство.Наименование");
		Реквизит = ИмяРеквизита;
	КонецПопытки;
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Реквизит", Реквизит);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат Null;
	КонецЕсли;
	
КонецФункции

Функция ЗначениеРеквизитаОбъектаУчета(ОбъектУчета, ИмяРеквизита, НаДату = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ОбъектУчета) Тогда
		Возврат Null;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СведенияОбОбъектеИмуществаСрезПоследних.Значение
	               |ИЗ
	               |	РегистрСведений.СведенияОбОбъектеИмущества.СрезПоследних(
	               |			&Период,
	               |			ОбъектУчетаИмущества = &ОбъектУчета
	               |				И РеквизитСведений.ИмяДляФормулы = &ИмяРеквизита
	               |				И ИдентификаторСтрокиТабличнойЧасти = """") КАК СведенияОбОбъектеИмуществаСрезПоследних";
				   
	Если ТипЗнч(ОбъектУчета) = Тип("Строка") И СтрДлина(ОбъектУчета) = 36 Тогда // Считаем что это идентификатор
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".ОбъектУчета", ".Идентификатор");
	КонецЕсли;				   
				   
	Запрос = Новый Запрос(ТекстЗапроса);			   
	Запрос.УстановитьПараметр("Период",			ОпределитьДату(НаДату));
	Запрос.УстановитьПараметр("ОбъектУчета",	ОбъектУчета);
	Запрос.УстановитьПараметр("ИмяРеквизита",	ИмяРеквизита);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Значение, Null);
	
КонецФункции

Функция КонтактнаяИнформация(Ссылка, Вид = Неопределено, Тип = "Адрес") Экспорт
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
	|ИЗ
	|	%1.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Ссылка
	|	И КонтактнаяИнформация.Тип = &Тип";
				   
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ОбщегоНазначенияБГУ.ВернутьСтрокуТипаПоТипу(ТипЗнч(Ссылка), "Запрос"));
	
	Если Вид <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + " И КонтактнаяИнформация.Вид = &Вид";
		Запрос.УстановитьПараметр("Вид", Вид);
	КонецЕсли;
	
	Если Тип <> "Адрес" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".ЗначенияПолей", ".Представление");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации[Тип]);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначенияПолей;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеАдреса(Значение) Экспорт
	
	Возврат РеестрИмуществаСервер.ПредставлениеАдреса(Значение);
	
КонецФункции

Функция ОтветственноеЛицоОрганизации(Организация, Знач ЧастьФИО = "", НаДату = Неопределено, Знач ВидОтветственногоЛица = Неопределено) Экспорт
	
	Если ВидОтветственногоЛица = Неопределено Тогда
		ВидОтветственногоЛица = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель;
	КонецЕсли;
	
	Если ЧастьФИО = "" Тогда
		ЧастьФИО = "ФИО";
	КонецЕсли;
	
	ОтветственноеЛицо = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(ВидОтветственногоЛица, Организация, НаДату);
	
	Значение = "";
	ОтветственноеЛицо.Свойство("ОтветственноеЛицо" + ЧастьФИО, Значение);
	
	Возврат Значение;	
	
КонецФункции

Функция ИнвентарныйНомерОбъекта(ОсновноеСредство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвНомер
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(, ОсновноеСредство = &ОсновноеСредство) КАК СобытияОССрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИнвентарныйНомер = Выборка.ИнвНомер;
	Иначе
		ИнвентарныйНомер = Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ИнвентарныйНомер;
	
КонецФункции

Функция ИнвентарныеНомера(ОсновноеСредство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОС", ОсновноеСредство);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнвентарныеНомераОС.Код
	               |ИЗ
	               |	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	               |ГДЕ
	               |	ИнвентарныеНомераОС.ОС = &ОС
	               |	И НЕ ИнвентарныеНомераОС.ПометкаУдаления";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = "";
	
	Пока Выборка.Следующий() Цикл
		Результат = Результат + ?(Результат = "", "",",") + СокрП(Выборка.Код);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьТекущуюДату() Экспорт
	
	Возврат ТекущаяДата();
	
КонецФункции

Функция ЗначениеСоответствуетМаске(Значение, Маска) Экспорт
	
	Попытка

		УстановитьБезопасныйРежим(Ложь);	
		RegExp = Новый COMОбъект("VBScript.RegExp");
		УстановитьБезопасныйРежим(Истина);		
		RegExp.Pattern = Маска;	
		
		Возврат RegExp.Test(Значение);
		
	Исключение
		Возврат Истина;
	КонецПопытки;
	
КонецФункции

Функция СведенияКадастровогоУчета(ОсновноеСредство, ИмяРеквизита, Период) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РегистрСведений.%1 КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних%2 КАК РегистрСведений
	|ГДЕ
	|	РегистрСведений.ОсновноеСредство = &ОсновноеСредство";
				   
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяРеквизита, ?(ЗначениеЗаполнено(Период), "(&Период,)", ""));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	Запрос.УстановитьПараметр("Период", Период);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначениеРеквизита;
	Иначе
		Возврат Null;
	КонецЕсли;	
	
КонецФункции

Функция СведенияРеестровогоУчетаИмущества(ОбъектУчета, ИмяРеквизита) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РегистрСведений.%1 КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.СведенияРеестровогоУчетаИмущества КАК РегистрСведений
	|ГДЕ
	|	РегистрСведений.ОбъектУчетаИмущества.ОбъектУчета = &ОбъектУчета";
	
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяРеквизита);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОбъектУчета", ОбъектУчета);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначениеРеквизита;
	Иначе
		Возврат Null;
	КонецЕсли;	
	
КонецФункции

Функция СведенияПТС(ОсновноеСредство, ИмяРеквизита, Период) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РегистрСведений.%1 КАК ЗначениеРеквизита
	|ИЗ
	|	РегистрСведений.ПаспортаТранспортныхСредств.СрезПоследних%2 КАК РегистрСведений
	|ГДЕ
	|	РегистрСведений.ОсновноеСредство = &ОсновноеСредство";
	
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяРеквизита, ?(ЗначениеЗаполнено(Период), "(&Период,)", ""));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	Запрос.УстановитьПараметр("Период", Период);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначениеРеквизита;
	Иначе
		Возврат Null;
	КонецЕсли;
	
КонецФункции

Функция ЗначениеКлассификатора(Код, Отбор = "") Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Код", Код);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОсновнаяТаблица.Ссылка
	               |ИЗ
	               |	Справочник.ЗначенияРеквизитовСведенийОбИмуществе КАК ОсновнаяТаблица
	               |ГДЕ
	               |	ОсновнаяТаблица.Код = &Код";
				   
	Если ЗначениеЗаполнено(Отбор) И ОбщегоНазначенияБГУКлиентСервер.ЭтоСтрокаXML(Отбор) Тогда
		СтруктураОтборов = ОбщегоНазначения.ЗначениеИзСтрокиXML(Отбор);
		Справочники.ЗначенияРеквизитовСведенийОбИмуществе.УсловияЗапросаПоОтборам(Запрос, СтруктураОтборов);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Null;	
	
КонецФункции

Функция Содержит(Строка, ПодстрокаПоиска) Экспорт
	
	Возврат Найти(Строка, ПодстрокаПоиска) > 0;
	
КонецФункции

Функция ОбъектВИерархии(Объект, Группа) Экспорт
	
	Возврат БухгалтерскиеОперации.ОбъектВИерархии(Объект, Группа);	
	
КонецФункции

Функция СведенияУчастияВКапитале(ОбъектФинансовогоВложения, Сведение, НаДату = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.ДолиУчастияВКапитале.СрезПоследних(&Период, ОбъектФинансовогоВложения = &ОбъектФинансовогоВложения) КАК Сведения";
				   
	Запрос.УстановитьПараметр("Период", ОпределитьДату(НаДату));
	Запрос.УстановитьПараметр("ОбъектФинансовогоВложения", ОбъектФинансовогоВложения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Попытка
			Результат = Выборка[Сведение];
		Исключение
			Результат = Null;
		КонецПопытки;
	Иначе
		Результат = Null;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция УчетнаяПолитикаОрганизации(Организация, ИмяРеквизита, НаДату = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Период, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних";
				   
	Запрос.УстановитьПараметр("Период", ОпределитьДату(НаДату));  
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Попытка
			Результат = Выборка[ИмяРеквизита];
		Исключение
			Результат = Null;
		КонецПопытки;
	Иначе
		Результат = Null;
	КонецЕсли;	
	
	Возврат Результат;	
	
КонецФункции

Функция ОстаточнаяСтоимость(ОсновноеСредство, НаДату = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.СуммаОстаток КАК Остаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет В ИЕРАРХИИ (&Счета), &Субконто, Субконто1 = &ОС) КАК Остатки";
	
	Запрос.УстановитьПараметр("Период"		, ОпределитьДату(НаДату));
	Запрос.УстановитьПараметр("Субконто"	, ОбщегоНазначенияБГУ.Массив(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства));
	Запрос.УстановитьПараметр("ОС"			, ОсновноеСредство);
	Запрос.УстановитьПараметр("Счета"		, БухгалтерскийУчет.СписокСчетов("101.00,104.00", Истина));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = ?(Выборка.Следующий(), Выборка.Остаток, 0);
	
	Возврат Результат;
	
КонецФункции

Функция ПакетыАкций(Акция, НаДату = Неопределено, СписокКолонок = "") Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПакетыАкцийСрезПоследних.ВыпускАкций.Наименование КАК Наименование,
	               |	ПакетыАкцийСрезПоследних.ВыпускАкций.ДатаВыпуска КАК ДатаВыпуска,
	               |	ПакетыАкцийСрезПоследних.ВыпускАкций.КатегорияАкций КАК КатегорияАкций,
	               |	ПакетыАкцийСрезПоследних.ВыпускАкций.НоминальнаяСтоимость КАК НоминальнаяСтоимость,
	               |	ПакетыАкцийСрезПоследних.Количество КАК Количество
	               |ИЗ
	               |	РегистрСведений.ПакетыАкций.СрезПоследних(&Период, ОбъектФинансовогоВложения = &Акция) КАК ПакетыАкцийСрезПоследних";
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СхемаКомпоновки.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.ИсточникДанных = "ИсточникДанных1";
	НаборДанных.Имя = "ИсточникДанных1";
	НаборДанных.Запрос = ТекстЗапроса;
	
	Настройки = СхемаКомпоновки.НастройкиПоУмолчанию;
	
	//Настройки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Группировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Группировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));		
	
	БюджетнаяОтчетность.УстановитьПараметрСхемыКомпоновкиДанных(СхемаКомпоновки, "Период",	ОпределитьДату(НаДату));
	БюджетнаяОтчетность.УстановитьПараметрСхемыКомпоновкиДанных(СхемаКомпоновки, "Акция",	Акция);
		
	Если ПустаяСтрока(СписокКолонок) Тогда
		Колонки = ОбщегоНазначенияБГУ.Массив("Наименование","ДатаВыпуска","КатегорияАкций","НоминальнаяСтоимость","Количество");
	Иначе
		//Колонки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокКолонок, "," + Символы.ПС);
		  Колонки = ПолучитьЗначенияПеречисления(СписокКолонок);
	КонецЕсли;
	
	Для Каждого Колонка Из Колонки Цикл
		
		ВычисляемоеПоле = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВРег(Колонка), "КАК");
		
		ИмяПоля = ?(ВычисляемоеПоле.Количество() > 1, СокрЛП(ВычисляемоеПоле[1]), СокрЛП(ВычисляемоеПоле[0]));
		
		Если ВычисляемоеПоле.Количество() > 1 Тогда
			Формула = СокрЛП(ВычисляемоеПоле[0]);
			ОбщийМодульСКД.ДобавитьВычисляемоеПолеКомпоновкиДанных(СхемаКомпоновки, ИмяПоля, Формула);
		КонецЕсли;			
		
		//ОбщийМодульСКД.ДобавитьПолеГруппировкиКомпоновкиДанных(Группировка, ИмяПоля);
		ОбщийМодульСКД.ДобавитьВыбранноеПолеКомпоновкиДанных(Настройки.Выбор, ИмяПоля);
		
	КонецЦикла;
		
	//ВнешниеНаборыДанных = Новый Структура("ДанныеДокумента", Таблица);
	
	//ОбщегоНазначения.ЗначениеВСтрокуXML(СхемаКомпоновки);
	//МакетКомпоновки = ПолучитьИзВременногоХранилища(Форма["СлужебноеПоле_АдресМакетаКомпоновки" + ИмяПоляФункции]);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,, Истина); 
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
	Возврат Результат;
	
КонецФункции

Функция ДанныеКонтрагента(Ссылка, Поле, НаДату = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Null;
	КонецЕсли;
	
	ТекстЗапроса =	"ВЫБРАТЬ
	              	|	Контрагенты.ЮридическоеФизическоеЛицо.Ссылка КАК Ссылка,
	              	|	Контрагенты.ЮридическоеФизическоеЛицо.ИНН КАК ИНН,
	              	|	ЕСТЬNULL(Контрагенты.ЮридическоеФизическоеЛицо.КПП, """") КАК КПП,
	              	|	ЕСТЬNULL(Контрагенты.ЮридическоеФизическоеЛицо.ОГРН, """") КАК ОГРН,
	              	|	ЕСТЬNULL(Контрагенты.ЮридическоеФизическоеЛицо.КодОКПО, """") КАК ОКПО,
	              	|	ВЫБОР
	              	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	              	|			ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.Наименование
	              	|		ИНАЧЕ ВЫБОР
	              	|				КОГДА Контрагенты.ЮридическоеФизическоеЛицо.НаименованиеПолное ПОДОБНО """"
	              	|					ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.Наименование
	              	|				ИНАЧЕ Контрагенты.ЮридическоеФизическоеЛицо.НаименованиеПолное
	              	|			КОНЕЦ
	              	|	КОНЕЦ КАК Наименование,
	              	|	ВЫБОР
	              	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	              	|			ТОГДА ИСТИНА
	              	|		ИНАЧЕ ЛОЖЬ
	              	|	КОНЕЦ КАК ЭтоФизЛицо,
	              	|	ВЫБОР
	              	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	              	|				И ЕСТЬNULL(ГражданствоФизическихЛицСрезПоследних.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	              	|			ТОГДА ИСТИНА
	              	|		ИНАЧЕ ЛОЖЬ
	              	|	КОНЕЦ КАК ЭтоИностранноеФизЛицо,
	              	|	ВЫБОР
	              	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	              	|				И ЕСТЬNULL(ГражданствоФизическихЛицСрезПоследних.Страна, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	              	|			ТОГДА ИСТИНА
	              	|		ИНАЧЕ ЛОЖЬ
	              	|	КОНЕЦ КАК ЭтоНеИностранноеФизЛицо,
	              	|	ВЫБОР
	              	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	              	|			ТОГДА ИСТИНА
	              	|		ИНАЧЕ ЛОЖЬ
	              	|	КОНЕЦ КАК ЭтоОрганизация,
		            |  	ВЫБОР
					|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
					|				И (Контрагенты.ЮридическоеФизическоеЛицо.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
					|					ИЛИ Контрагенты.ЮридическоеФизическоеЛицо.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
					|			ТОГДА ИСТИНА
					|		ИНАЧЕ ЛОЖЬ
					|	КОНЕЦ КАК ЭтоНеИностраннаяОрганизация,
					|  	ВЫБОР
					|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
					|				И НЕ (Контрагенты.ЮридическоеФизическоеЛицо.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
					|					ИЛИ Контрагенты.ЮридическоеФизическоеЛицо.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
					|			ТОГДА ИСТИНА
					|		ИНАЧЕ ЛОЖЬ
					|	КОНЕЦ КАК ЭтоИностраннаяОрганизация
	              	|ПОМЕСТИТЬ Контрагент
	              	|ИЗ
	              	|	Справочник.Контрагенты КАК Контрагенты
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(&Период, ФизическоеЛицо = &ФизЛицо) КАК ГражданствоФизическихЛицСрезПоследних
	              	|		ПО Контрагенты.ЮридическоеФизическоеЛицо = ГражданствоФизическихЛицСрезПоследних.ФизическоеЛицо
	              	|ГДЕ
	              	|	Контрагенты.Ссылка = &Ссылка
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	Контрагент.Ссылка КАК Значение
	              	|ИЗ
	              	|	Контрагент КАК Контрагент";
					
					//|	" + Поле + " КАК Значение
					//|	Контрагент.Ссылка КАК Значение
				   
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Контрагент.Ссылка КАК Значение", Поле + " КАК Значение");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", ОпределитьДату(НаДату));
	Запрос.УстановитьПараметр("ФизЛицо", Ссылка.ЮридическоеФизическоеЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат Null;
	
КонецФункции

Функция НайтиКонтрагентаПоОГРН(ОГРН) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЮридическоеФизическоеЛицо.ОГРН = &ОГРН
		|	И НЕ Контрагенты.ПометкаУдаления";

	Запрос.УстановитьПараметр("ОГРН", ОГРН);
	Выборка = Запрос.Выполнить().Выбрать();

	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.Контрагенты.ПустаяСсылка());

КонецФункции

Функция СтрокаВЧисло(Значение) Экспорт
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	Возврат ТипЧисло.ПривестиЗначение(Значение);
	
КонецФункции

Функция ДанныеОбъектаОС(ОсновноеСредство, ИмяРеквизита, Период = Неопределено) Экспорт
	
	Данные = УправлениеОсновнымиСредствами.ДанныеОбъектаОС(ОсновноеСредство, Период);
	
	Результат = Неопределено;
	Данные.Свойство(ИмяРеквизита, Результат);
	
	Возврат Результат;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ОпределитьДату(РасчетнаяДата)
	
	Если Не ЗначениеЗаполнено(РасчетнаяДата) Тогда
		#Если Клиент Тогда
			Результат = ТекущаяДата();
		#Иначе
			Результат = ТекущаяДатаСеанса();
		#КонецЕсли
	Иначе
		Результат = РасчетнаяДата;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЗначенияПеречисления(Текст, Разделитель = ",")
	
	Результат = Новый Массив;
	
	ДлинаОбщая = СтрДлина(Текст);
	Значение = "";
	Сч = 1;
	СчСкобок = 0;
	КавычкиЗакрыты = Истина;
	Пока Сч <= ДлинаОбщая Цикл
		Символ = Сред(Текст, Сч, 1);
		Если Символ = "(" Тогда
			СчСкобок = СчСкобок + 1;
		ИначеЕсли Символ = ")" Тогда
			СчСкобок = СчСкобок - 1;
		ИначеЕсли Символ = """" Тогда
			КавычкиЗакрыты = Не КавычкиЗакрыты;
		ИначеЕсли Символ = "," Тогда
			Если КавычкиЗакрыты И СчСкобок = 0 Тогда
				Результат.Добавить(СокрЛП(Значение));
				Значение = "";
				Символ = "";						
			КонецЕсли;
		КонецЕсли;
		Значение = Значение + Символ; 
		Сч = Сч + 1;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Результат.Добавить(СокрЛП(Значение));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// УСТАРЕВШИЕ ФУНКЦИИ

// Использовать КонтактнаяИнформация
Функция ПолучитьКонтактнуюИнформацию(Ссылка, Вид = Неопределено, Тип = "Адрес") Экспорт
	
	Возврат КонтактнаяИнформация(Ссылка, Вид, Тип);
	
КонецФункции

// Использовать ПакетыАкций
Функция ПолучитьПакетыАкций(Акция, НаДату = Неопределено, СписокКолонок = "") Экспорт
	
	Возврат ПакетыАкций(Акция, НаДату, СписокКолонок);
	
КонецФункции

// Использовать ЗначениеРеквизитаОбъектаУчета
Функция ПолучитьЗначениеРеквизитаОбъектаУчета(ОбъектУчета, ИмяРеквизита, НаДату = Неопределено) Экспорт
	
	Возврат ЗначениеРеквизитаОбъектаУчета(ОбъектУчета, ИмяРеквизита, НаДату);
	
КонецФункции

// Использовать ЗначениеКлассификатора
Функция ЗначениеСправочникаАСУФИ(Отбор = "", Код) Экспорт
		
	ЗначениеКлассификатора(Код, Отбор);
	
КонецФункции

// Использовать ЗначениеДополнительногоРеквизита
Функция ПолучитьЗначениеДополнительногоРеквизита(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ЗначениеДополнительногоРеквизита(Ссылка, ИмяРеквизита);
	
КонецФункции

// Использовать ДанныеОбъектаОС со знаением "СчетУчета"
Функция СчетУчетаОС(ОсновноеСредство, Период = Неопределено) Экспорт
	
	УправлениеОсновнымиСредствами.СчетУчетаОС(ОсновноеСредство, Период);
	
КонецФункции
