
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Событие = Параметры.Событие;
	РеквизитыДокумента = Параметры.РеквизитыДокумента;
	АдресДополнительный = Параметры.ДополнительныеРеквизиты;
	АдресДополнительныхРеквизитов = ПоместитьВоВременноеХранилище(Параметры.ДополнительныеРеквизиты);
	АдресСохраненныхНастроек = Параметры.АдресСохраненныхНастроек;
	
	Если ТипЗнч(РеквизитыДокумента) = Тип("Структура") Тогда
		
		ОтчетныйДокумент = Неопределено;
		Значение = Неопределено;
		Если РеквизитыДокумента.Свойство("ОтчетныйДокумент", Значение) И ТипЗнч(Значение) = Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет") И ЗначениеЗаполнено(Значение) Тогда
			ОтчетныйДокумент = Значение;
		КонецЕсли;
		
		Значение = Неопределено;
		Если РеквизитыДокумента.Свойство("Организация", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.Организации") Тогда
			Организация = Значение;
		КонецЕсли;
		
		Значение = Неопределено;
		Если РеквизитыДокумента.Свойство("ВидОтчета", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.ВидыОтчетов") Тогда
			ВидОтчета = Значение;
		КонецЕсли;
		
		Значение = Неопределено;
		Если РеквизитыДокумента.Свойство("ИФО", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			ИФО = Значение;
		КонецЕсли;
		
		Значение = Неопределено;
		Если РеквизитыДокумента.Свойство("ПараметрКоманды", Значение) Тогда 
			Если ТипЗнч(Значение) = Тип("СправочникСсылка.ПравилаЗаполнения") Тогда
				ПравилоЗаполнения = Значение;
				ВидОтчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоЗаполнения,"Владелец");
			ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.ОбластиЗаполнения") Тогда
				ПравилоЗаполнения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Значение, "Владелец");
				ВидОтчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоЗаполнения,"Владелец");
			КонецЕсли;
		ИначеЕсли РеквизитыДокумента.Свойство("ПравилоЗаполнения", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.ПравилаЗаполнения") Тогда
			ПравилоЗаполнения = Значение;
			ВидОтчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоЗаполнения,"Владелец");
		КонецЕсли;
		
		СтруктураПериода = Новый Структура; 
		Значение = Неопределено;
		Если РеквизитыДокумента.Свойство("ПериодОтчета", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.Периоды") Тогда
			
			СтруктураПериода.Вставить("ДатаНачала", НачалоГода(Значение.ДатаНачала));
			СтруктураПериода.Вставить("ДатаОкончания", Значение.ДатаОкончания);
			
		Иначе
			
			СтруктураПериода.Вставить("ДатаНачала", НачалоГода(ТекущаяДатаСеанса()));
			СтруктураПериода.Вставить("ДатаОкончания", ТекущаяДатаСеанса());
			
		КонецЕсли;
		
		АдресПараметровПериода = ЗаполнитьПериодОтчета(СтруктураПериода, ПравилоЗаполнения);
		
		НастроитьВидимостьЭлементов();
		
	КонецЕсли;
	
	НастроитьКомпоновщикНастроек(НЕ ЗначениеЗаполнено(ПравилоЗаполнения));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ЗагрузитьНастройкиНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ДатаНачала > ДатаОкончания Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Дата начала отчетного периода %1 не может быть больше даты окончания %2'"),
									Формат(ДатаНачала,"ДЛФ=D"), 
									Формат(ДатаОкончания,"ДЛФ=D"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ДатаНачала");
		
	КонецЕсли;
	
	Если РежимВводаПериода = "МоментВремени" Тогда
		ПроверяемыеРеквизиты.Добавить("ДокументМоментаВремени");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	АдресПараметровПериода = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	АдресПараметровПериода = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилоЗаполненияПриИзменении(Элемент)
	
	НастроитьКомпоновщикНастроек();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Компоновщик настроек

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборЛевоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(
			Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока);
	
	ИмяПоля = Строка(Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные.ЛевоеЗначение);
	
	Если Не(ПустаяСтрока(ИмяПоля) ИЛИ Найти(ЗапрещенныеПоля, ИмяПоля) = 0) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии
		ИЛИ ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
		ИЛИ ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии
		ИЛИ ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии
		ИЛИ ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
		ИЛИ ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		ИспользоватьСписок = Истина;
	иначе 
		ИспользоватьСписок = Ложь;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПолеИсточника", ИмяПоля);
	ПараметрыФормы.Вставить("АдресКомпоновщикаНастроек", АдресКомпоновщикаНастроек);
	ПараметрыФормы.Вставить("ВидНастроек", "НастройкиОтбор");
	ПараметрыФормы.Вставить("ОграниченияПолей", ЗапрещенныеПоля);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяФормы","Справочник.ОбластиЗаполнения.Форма.ФормаВыбораДоступныхПолей"); 
	ДополнительныеПараметры.Вставить("ПараметрыФормы",ПараметрыФормы);
	ДополнительныеПараметры.Вставить("ВладелецФормы",ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПервичнаяПроверка","Результат <> Неопределено");
	ДополнительныеПараметры.Вставить("ОбработкаРезультата", Новый ОписаниеОповещения("ПослеЗакрытияДочернейФормы",ЭтаФорма,ДополнительныеПараметры));
	
	
	ДополнительныеПараметры.Вставить("Настройки",КомпоновщикНастроек.ПолучитьНастройки());
	ДополнительныеПараметры.Вставить("ЭлементОтбора",ЭлементОтбора);
	ДополнительныеПараметры.Вставить("ИспользоватьСписок",ИспользоватьСписок);
	
	БюджетнаяОтчетностьКлиент.ОткрытьФормуСПростойОбработкой(ДополнительныеПараметры);
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборВидСравненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПолеОтбора = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные.ЛевоеЗначение;
	
	МассивВидовСравнения = СоответствиеВариантовВыбора.Получить(ПолеОтбора);
	
	Если ТипЗнч(МассивВидовСравнения) = Тип("Массив") Тогда		
		Элементы.КомпоновщикНастроекНастройкиОтборВидСравнения.СписокВыбора.ЗагрузитьЗначения(МассивВидовСравнения);
	Иначе
		Элементы.КомпоновщикНастроекНастройкиОтборВидСравнения.СписокВыбора.ЗагрузитьЗначения(Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПередНачаломИзменения(Элемент, Отказ)
	
	ИмяПоля = Строка(Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные.ЛевоеЗначение);
	
	Если Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущийЭлемент.Имя = "КомпоновщикНастроекНастройкиОтборЛевоеЗначение" Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ИмяПоля) И Найти(ЗапрещенныеПоля, ИмяПоля) <> 0 И Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущийЭлемент.Имя = "КомпоновщикНастроекНастройкиОтборИспользование" Тогда
		ТекДанные = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные;
		Если ТекДанные.Использование = Истина Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборЛевоеЗначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Новый ПолеКомпоновкиДанных("Организация"), "Организация");
	ДанныеВыбора.Добавить(Новый ПолеКомпоновкиДанных("ИФО"));
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДанные = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные;
		
	Если ТекДанные = Неопределено Тогда		
		Возврат;
	КонецЕсли;
	
	ИмяПараметра = Строка(ТекДанные.ЛевоеЗначение);
	Если НЕ СтруктураПараметровВыбораДокументов.Свойство(ИмяПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура("КодВидаОтчета,МножественныйВыборДокументов",СтруктураПараметровВыбораДокументов[ИмяПараметра],Ложь);
		СтруктураПараметров = Новый Структура;
		ПараметрыФормы.Вставить("ПравилоЗаполнения",ПравилоЗаполнения);
		Для Каждого СтрТЧ Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ТипЗнч(СтрТЧ) <> Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			Если Строка(СтрТЧ.ЛевоеЗначение) = ИмяПараметра Тогда
				Продолжить;
			КонецЕсли;
			Если СтрТЧ.ВидСравнения <> ВидСравненияКомпоновкиДанных.Равно Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрТЧ.ПравоеЗначение) Тогда
				Продолжить;
			КонецЕсли;
			СтруктураПараметров.Вставить(Строка(СтрТЧ.ЛевоеЗначение),СтрТЧ.ПравоеЗначение);
		КонецЦикла;
		ПараметрыФормы.Вставить("СтруктураПараметров",СтруктураПараметров);
		
		ОткрытьФорму("Документ.УниверсальныйРегламентированныйОтчет.ФормаВыбора",ПараметрыФормы,Элемент);
		
	Иначе
		СтандартнаяОбработка = Ложь;
		ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
		ВыбранныеОтчеты = Неопределено;
		Для Каждого ТекЭлемент Из ЭлементыОтбора Цикл
			Если ТекЭлемент.ЛевоеЗначение = ТекДанные.ЛевоеЗначение Тогда
				ВыбранныеОтчеты = ТекЭлемент.ПравоеЗначение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура("КодВидаОтчета,ВыбранныеОтчеты,МножественныйВыборДокументов",СтруктураПараметровВыбораДокументов[ИмяПараметра],ВыбранныеОтчеты,Истина);
		СтруктураПараметров = Новый Структура;
		ПараметрыФормы.Вставить("ПравилоЗаполнения",ПравилоЗаполнения);
		Для Каждого СтрТЧ Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ТипЗнч(СтрТЧ) <> Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			Если Строка(СтрТЧ.ЛевоеЗначение) = ИмяПараметра Тогда
				Продолжить;
			КонецЕсли;
			Если СтрТЧ.ВидСравнения <> ВидСравненияКомпоновкиДанных.Равно Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрТЧ.ПравоеЗначение) Тогда
				Продолжить;
			КонецЕсли;
			СтруктураПараметров.Вставить(Строка(СтрТЧ.ЛевоеЗначение),СтрТЧ.ПравоеЗначение);
		КонецЦикла;
		ПараметрыФормы.Вставить("СтруктураПараметров",СтруктураПараметров);
		ОткрытьФорму("Документ.УниверсальныйРегламентированныйОтчет.ФормаВыбора",ПараметрыФормы,Элемент);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПравоеЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.ЗагрузитьЗначения(ВыбранноеЗначение);
		ВыбранноеЗначение = СписокЗначений;
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВводПериода(Команда)
	
	Если ДатаНачала > ДатаОкончания Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата начала должна быть меньше или равна дате окончания периода'"));
		Возврат;
		
	КонецЕсли;
	
	НП = Новый ДиалогРедактированияСтандартногоПериода;
	
	НП.Период.ДатаНачала = ДатаНачала;
	НП.Период.ДатаОкончания = ДатаОкончания;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПериода",ЭтотОбъект);
	НП.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПериода(Период,ДополнительныеПараметры) Экспорт
	Если Период <> Неопределено Тогда
		ДатаНачала    = Период.ДатаНачала;
		ДатаОкончания = Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		Если ВладелецФормы = Неопределено Тогда
			УникальныйИдентификаторВладельца = Неопределено;
		Иначе
			УникальныйИдентификаторВладельца = ВладелецФормы.УникальныйИдентификатор;
		КонецЕсли;
		
		РезультатРедактирования = ПолучитьСтруктуруПараметров(УникальныйИдентификаторВладельца);
		
		Закрыть(РезультатРедактирования);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	
	СтруктураСохранения = ПолучитьНастройкиДляСохранения();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПравилоЗаполнения", ПравилоЗаполнения);
	
	ОткрытьФорму("Обработка.ОбработкаДанныхОтчетности.Форма.ФормаНастроек", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	ОткрытьФорму("Обработка.ОбработкаДанныхОтчетности.Форма.ФормаНастроек", ПолучитьНастройкиДляСохранения(), ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПолучитьНастройкиДляСохранения()
	
	СтруктураНастроек = Новый Структура;
	
	ПредставлениеНастроек = "";
	
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		СтруктураНастроек.Вставить("ДатаНачала", ДатаНачала);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		СтруктураНастроек.Вставить("ДатаОкончания", ДатаОкончания);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтчетнаяДата) Тогда
		СтруктураНастроек.Вставить("ОтчетнаяДата", ОтчетнаяДата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументМоментаВремени) Тогда
		СтруктураНастроек.Вставить("ДокументМоментаВремени", ДокументМоментаВремени);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачала) ИЛИ ЗначениеЗаполнено(ДатаОкончания) Тогда
		
		ПредставлениеНастроек = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Период с %1 по %2'"),
					Формат(ДатаНачала, "ДФ=dd.MM.yyyy"), Формат(ДатаОкончания, "ДФ=dd.MM.yyyy"));
					
	ИначеЕсли ЗначениеЗаполнено(ОтчетнаяДата) Тогда
		
		ПредставлениеНастроек = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Отчетная дата %1'"),
					Формат(ОтчетнаяДата, "ДФ=dd.MM.yyyy"));
					
			СтруктураНастроек.Вставить("ОтчетнаяДата", ОтчетнаяДата);
			
	КонецЕсли;
	
	НастройкиОтбора = КомпоновщикНастроек.ПолучитьНастройки().Отбор;
	СтруктураНастроек.Вставить("ОтборСКД", ПреобразоватьОтбор(НастройкиОтбора));
	
	Если НастройкиОтбора.Элементы.Количество() <> 0 Тогда
		
		ПредставлениеОтбора = НСтр("ru = 'Отбор: %1'");
		ТекстОтбора = "";
		Для каждого ЭлементОтбора Из НастройкиОтбора.Элементы Цикл
			
			Если ЭлементОтбора.Использование Тогда
				
				ТекстОтбора = ТекстОтбора + ?(ПустаяСтрока(ТекстОтбора), "", ", ") +
						ЭлементОтбора.ЛевоеЗначение + " " + Строка(ЭлементОтбора.ВидСравнения) + 
						" " + Строка(ЭлементОтбора.ПравоеЗначение);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(ТекстОтбора) Тогда
			
			ПредставлениеНастроек = ПредставлениеНастроек + ?(ПустаяСтрока(ПредставлениеНастроек), "", ", ") +
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ПредставлениеОтбора, ТекстОтбора);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", ПредставлениеНастроек);
	Результат.Вставить("ПравилоЗаполнения", ПравилоЗаполнения);
	Результат.Вставить("АдресНастроек", ПоместитьВоВременноеХранилище(СтруктураНастроек, УникальныйИдентификатор));
	Результат.Вставить("СохранениеНастройки", Истина);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьПоляИнтерактивногоОтбора()
	
	ИнтерактивныйОтбор = Новый ТаблицаЗначений;
	ИнтерактивныйОтбор.Колонки.Добавить("Псевдоним");
	ИнтерактивныйОтбор.Колонки.Добавить("Синоним");
	ИнтерактивныйОтбор.Колонки.Добавить("ТипДанных");
	ИнтерактивныйОтбор.Колонки.Добавить("ТипЗначенияПараметра");
	ИнтерактивныйОтбор.Колонки.Добавить("Значение");
	ИнтерактивныйОтбор.Колонки.Добавить("ДополнительныйПараметр");
	ИнтерактивныйОтбор.Колонки.Добавить("Владелец");
	ИнтерактивныйОтбор.Колонки.Добавить("СохранятьЭлементОтбора", Новый ОписаниеТипов("Булево"));
	ИнтерактивныйОтбор.Колонки.Добавить("ЗадаетсяСпискомЗначений", Новый ОписаниеТипов("Булево"));
	
	Стр = ИнтерактивныйОтбор.Добавить();
	Стр.Псевдоним = "Организация";
	Стр.Синоним   = НСтр("ru = 'Организация'");
	Стр.ТипДанных = "Справочник.Организации";
	Стр.ТипЗначенияПараметра = Тип("СправочникСсылка.Организации");
	Стр.Значение = Организация;
	Стр.ДополнительныйПараметр = Ложь;
	Стр.СохранятьЭлементОтбора = Истина;
	
	СтрокаОписания = ТаблицаОписанияПараметров.Добавить();
	СтрокаОписания.ИмяПараметра = Стр.Псевдоним;
	СтрокаОписания.ПредставлениеПараметра = Стр.Синоним;
	СтрокаОписания.ОписаниеПараметра = НСтр("ru='Отбор по организации, данными по которой должен быть заполнен отчет.'");
	
	Если БюджетнаяОтчетностьСервер.ИспользоватьУчетПоИФО() Тогда
		Стр = ИнтерактивныйОтбор.Добавить();
		Стр.Псевдоним = "ИФО";
		Стр.Синоним   = НСтр("ru = 'ИФО'");
		Стр.ТипДанных = "Справочник.ИсточникиФинансовогоОбеспечения";
		Стр.ТипЗначенияПараметра = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения");
		Стр.Значение = ИФО;
		Стр.ДополнительныйПараметр = Ложь;
		Стр.СохранятьЭлементОтбора = Истина;
		
		СтрокаОписания = ТаблицаОписанияПараметров.Добавить();
		СтрокаОписания.ИмяПараметра = Стр.Псевдоним;
		СтрокаОписания.ПредставлениеПараметра = Стр.Синоним;
		СтрокаОписания.ОписаниеПараметра = НСтр("ru='Отбор по ИФО, данными по которому должен быть заполнен отчет.'");
	КонецЕсли;
	
	Возврат ИнтерактивныйОтбор;
	
КонецФункции

&НаСервере
Процедура ПодготовитьДополнительныйОтбор(Знач ПоляОтбора)

	ТекстЗапроса = "";
	
	Для Каждого Поле Из ПоляОтбора Цикл
		ТекстЗапроса = ТекстЗапроса 
						+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(",
						|	ВЫРАЗИТЬ(НЕОПРЕДЕЛЕНО КАК %1) КАК %2",
						Поле.ТипДанных,
						Поле.Псевдоним);
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|" + Сред(ТекстЗапроса,2);
	
		НастроитьСхемуИКомпоновщик(ТекстЗапроса, ПоляОтбора);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НастроитьСхемуИКомпоновщик(Знач ТекстЗапроса, Знач ПоляОтбора)
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
	
	Набор					= СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	Набор.Имя				= "ИсточникПолейОтбора";
	Набор.ИсточникДанных	= БюджетнаяОтчетность.ИмяЛокальногоИсточникаДанных(СхемаКомпоновки);
	Набор.Запрос			= ТекстЗапроса;
	Набор.АвтоЗаполнениеДоступныхПолей = Истина;
	
	// Заполнение полей источника
	Для Каждого ПолеЗапроса Из ПоляОтбора Цикл
		
		ПолеНабораДанных				= Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабораДанных.Поле 			= ПолеЗапроса.Псевдоним;
		ПолеНабораДанных.ПутьКДанным	= ПолеЗапроса.Псевдоним;
		ПолеНабораДанных.Заголовок		= ПолеЗапроса.Синоним;
		
		Если ПолеЗапроса.ТипДанных = "Справочник.РазделыЛицевыхСчетов" Тогда
			
			СвязиПараметровВыбора = ПолеНабораДанных.ПараметрыРедактирования.Элементы.Найти("СвязиПараметровВыбора");
			
			СвязиПараметровВыбора.Использование = Истина;
			
			Связь = СвязиПараметровВыбора.Значение.Добавить();
			Связь.Имя = "Отбор.Организация";
			Связь.Поле = Новый ПолеКомпоновкиДанных("Организация");
			Связь.ИзменениеЗначения = РежимИзмененияСвязанногоЗначения.Очищать;
			
		ИначеЕсли ПолеЗапроса.ТипДанных = "Справочник.Субконто" И ЗначениеЗаполнено(ПолеЗапроса.Владелец) Тогда
			
			ПараметрыВыбораСКД = ПолеНабораДанных.ПараметрыРедактирования.Элементы.Найти("ПараметрыВыбора");
			
			ПараметрыВыбораСКД.Использование = Истина;
			
			ПараметрСКД = ПараметрыВыбораСКД.Значение.Добавить();
			ПараметрСКД.Имя = "Отбор.Владелец";
			ПараметрСКД.Значение = ПолеЗапроса.Владелец;
			
		КонецЕсли;
		
	КонецЦикла;
	
	АдресСхемыКомпоновкиОтбор = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиОтбор);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	Для Каждого ПолеЗапроса Из ПоляОтбора Цикл
		
		ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеЗапроса.Псевдоним);
		ЭлементОтбора.Использование = ЗначениеЗаполнено(ПолеЗапроса.Значение);
		ЭлементОтбора.ПравоеЗначение = ПолеЗапроса.Значение;
		
		
		// Для полей отбора с возможностью указания списка предполагается, 
		// что отбор должен выполняться только в сулчае, если список заполнен.
		Если ПолеЗапроса.ЗадаетсяСпискомЗначений Тогда
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Если НЕ ЗначениеЗаполнено(ПолеЗапроса.Значение)	Тогда
				ЭлементОтбора.Использование = Ложь;
				ЭлементОтбора.ПравоеЗначение = Неопределено;
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;
	
	АдресКомпоновщикаНастроек = ЗаполнениеОтчетностиСервер.СохранитьКомпоновщикНастроек(КомпоновщикНастроек, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметров(УникальныйИдентификаторВладельцаФормы)
	
	Если ЭтоАдресВременногоХранилища(АдресТаблицыПолей) Тогда
		ТаблицаПолей = ПолучитьИзВременногоХранилища(АдресТаблицыПолей);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаПолей = ПолучитьИзВременногоХранилища(АдресТаблицыПолей);
	
	НастройкиКомпоновщика = КомпоновщикНастроек.ПолучитьНастройки();
	
	СтруктураПериода = Новый Структура;
	СтруктураПериода.Вставить("ДатаНачала", ДатаНачала);
	СтруктураПериода.Вставить("ДатаОкончания", ДатаОкончания);
	СтруктураПериода.Вставить("ОтчетнаяДата", ОтчетнаяДата);
	СтруктураПериода.Вставить("ДокументМоментаВремени", ДокументМоментаВремени);
	СтруктураПериода.Вставить("ДополнительныйПериод1",Неопределено);
	СтруктураПериода.Вставить("ДополнительныйПериод2",Неопределено);
	
	ЗаполнитьПериодОтчета(СтруктураПериода, ПравилоЗаполнения);
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ПравилоЗаполнения", ПравилоЗаполнения);
	СтруктураПараметров.Вставить("НачалоПериода", СтруктураПериода.ДатаНачала);
	СтруктураПараметров.Вставить("КонецПериода", СтруктураПериода.ДатаОкончания);
	
	СтруктураПараметров.Вставить("ДополнительныйПериод1", СтруктураПериода.ДополнительныйПериод1);
	СтруктураПараметров.Вставить("ДополнительныйПериод2", СтруктураПериода.ДополнительныйПериод2);
	
	СтруктураПараметров.Вставить("ДокументМоментаВремени", ДокументМоментаВремени);
	СтруктураПараметров.Вставить("ОтчетнаяДата", ОтчетнаяДата);
	СтруктураПараметров.Вставить("ОтборСКД", ПреобразоватьОтбор(НастройкиКомпоновщика.Отбор));
	
	ДополнительныеДействия = Новый Структура;
	Если ТипЗнч(ДобавленныеРеквизиты) = Тип("ФиксированныйМассив") Тогда
		Для Каждого ЭлМас Из ДобавленныеРеквизиты Цикл
			ДополнительныеДействия.Вставить(ЭлМас,ЭтотОбъект[ЭлМас]);	
		КонецЦикла;
	КонецЕсли;
	СтруктураПараметров.Вставить("ДополнительныеДействия",ДополнительныеДействия);
	
	ЗаполнитьСтруктуруДопПараметров(СтруктураПараметров, НастройкиКомпоновщика, ТаблицаПолей);
	
	АдресРезультатаРедактирования = ПоместитьВоВременноеХранилище(СтруктураПараметров, УникальныйИдентификаторВладельцаФормы);
	
	Если Событие = "Проверка" Тогда
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ПравилоЗаполнения, "НастройкиПроверки", СтруктураПараметров);
		
	КонецЕсли;
	
	Возврат Новый Структура("АдресПараметров", АдресРезультатаРедактирования);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтруктуруДопПараметров(СтруктураПараметров, НастройкиКомпоновщика, ТаблицаПолей)
	
	СтруктураДополнительныхПараметров = Новый Структура;
	
	МассивВидовСравненияЗапрос = Новый Массив;
	МассивВидовСравненияЗапрос.Добавить(ВидСравненияКомпоновкиДанных.ВИерархии);
	МассивВидовСравненияЗапрос.Добавить(ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
	МассивВидовСравненияЗапрос.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
	МассивВидовСравненияЗапрос.Добавить(ВидСравненияКомпоновкиДанных.НеВИерархии);
	МассивВидовСравненияЗапрос.Добавить(ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии);
	МассивВидовСравненияЗапрос.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
	
	Для каждого ЭлементОтбора Из НастройкиКомпоновщика.Отбор.Элементы Цикл
		
		СтруктураЭлементаОтбора = Новый Структура("Использование,ЛевоеЗначение,ВидСравнения,ПравоеЗначение");
		ЗаполнитьЗначенияСвойств(СтруктураЭлементаОтбора, ЭлементОтбора);
		
		ИмяПоля = Строка(ЭлементОтбора.ЛевоеЗначение);
		Поз = Найти(ИмяПоля, ".");
		Если Поз = 0 Тогда
			ИмяРодителя = ИмяПоля;
			СохранятьЭлементОтбора = Ложь;
		Иначе
			ИмяРодителя = Лев(ИмяПоля, Поз - 1);
			СохранятьЭлементОтбора = Истина;
		КонецЕсли;
		
		ТипЗначенияСтрока = Неопределено;
		ТипЗначенияПараметра = Неопределено;
		
		СтрокаТаблицыПолей = ТаблицаПолей.Найти(ИмяПоля, "Псевдоним");
		Если СтрокаТаблицыПолей <> Неопределено Тогда
			
			ТипЗначенияСтрока = СтрокаТаблицыПолей.ТипДанных;
			ТипЗначенияПараметра = СтрокаТаблицыПолей.ТипЗначенияПараметра;
			
			Если СтрокаТаблицыПолей.ДополнительныйПараметр Тогда
				ТекСтруктура = СтруктураДополнительныхПараметров;
			Иначе
				ТекСтруктура = СтруктураПараметров;
			КонецЕсли;
			
		Иначе
			
			СтрокаТаблицыПолей = ТаблицаПолей.Найти(ИмяРодителя, "Псевдоним");
			Если СтрокаТаблицыПолей <> Неопределено Тогда
				ДоступноеПолеКомпоновки = НастройкиКомпоновщика.Отбор.ДоступныеПоляОтбора.НайтиПоле(ЭлементОтбора.ЛевоеЗначение);
				Если ДоступноеПолеКомпоновки <> Неопределено Тогда
					ТипЗначенияСтрока = ЗаполнениеОтчетности.ВернутьСтрокуТипаПоТипу(ДоступноеПолеКомпоновки.ТипЗначения.Типы()[0], "Запрос");
					ТипЗначенияПараметра = ДоступноеПолеКомпоновки.ТипЗначения;
				КонецЕсли;
			КонецЕсли;
			
			ТекСтруктура = СтруктураПараметров;
			
		КонецЕсли;
		
		Если НЕ ЭлементОтбора.Использование Тогда
			
			Если СтрокаТаблицыПолей <> Неопределено Тогда
				СтруктураЭлементаОтбора.ПравоеЗначение = СтрокаТаблицыПолей.Значение;
			Иначе
				СтруктураЭлементаОтбора.ПравоеЗначение = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
		Если МассивВидовСравненияЗапрос.Найти(ЭлементОтбора.ВидСравнения) <> Неопределено Тогда
			
			СписокЗначений = Новый СписокЗначений;
			ПустоеЗначение = Неопределено;
			Если ТипЗнч(СтрокаТаблицыПолей.ТипЗначенияПараметра) = Тип("Тип") И ЗначениеЗаполнено(СтрокаТаблицыПолей.ТипЗначенияПараметра) Тогда
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(СтрокаТаблицыПолей.ТипЗначенияПараметра);
				ТипЗначения = Новый ОписаниеТипов(МассивТипов);
				СписокЗначений.ТипЗначения = ТипЗначения;
				ПустоеЗначение = ТипЗначения.ПривестиЗначение(Неопределено);
			КонецЕсли;
			МассивЗначений = ПолучитьЗначениеЗапросом(ТипЗначенияСтрока, ИмяПоля, ЭлементОтбора.ВидСравнения, ЭлементОтбора.ПравоеЗначение);
			Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно И ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение) Тогда
				МассивЗначений.Добавить(ПустоеЗначение);
			КонецЕсли;
			СписокЗначений.ЗагрузитьЗначения(МассивЗначений);
			
			СтруктураЭлементаОтбора.Вставить("СписокЗначений", СписокЗначений);
			
		КонецЕсли;
		
		ТекСтруктура.Вставить(ИмяРодителя, СтруктураЭлементаОтбора);
		
	КонецЦикла;
	
	СтруктураПараметров.Вставить("ДополнительныеПараметры", СтруктураДополнительныхПараметров);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьЗначениеЗапросом(Знач ТипЗначенияСтрока, Знач ИмяПоля, Знач ВидСравненияОтбор, Знач ПравоеЗначение)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Таблица.Ссылка КАК Ссылка
		|{ВЫБРАТЬ
		|	Ссылка.* КАК Ссылка}
		|ИЗ
		|	%1 КАК Таблица
		|{ГДЕ
		|	Таблица.Ссылка.* КАК %2}";
		
	ТекстЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗапроса, ТипЗначенияСтрока, ИмяПоля);
	
	Схема = Новый СхемаКомпоновкиДанных;
	
	ИсточникСхемы = Схема.ИсточникиДанных.Добавить();
	ИсточникСхемы.Имя = "ИсточникДанных1";
	ИсточникСхемы.ТипИсточникаДанных = "Local";
	
	Набор 			 	 = Схема.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	Набор.Имя 		 	 = "Набор1";
	Набор.ИсточникДанных = ИсточникСхемы.Имя;
	Набор.Запрос = ТекстЗапроса;
	
	Поле = Набор.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	Поле.Поле = "Ссылка";
	Поле.ПутьКДанным = "Ссылка";
	
	КомпоновщикНастроекВрем = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	ИсточникКомпоновщикаВрем = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема);
	
	КомпоновщикНастроекВрем.Инициализировать(ИсточникКомпоновщикаВрем);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КомпоновщикНастроекВрем.Настройки.Отбор,
									ИмяПоля,
									ПравоеЗначение,
									ВидСравненияОтбор,
									,
									Истина);
	
	ГруппировкаВрем = КомпоновщикНастроекВрем.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаВрем.ПоляГруппировки.Элементы.Добавить(Тип("АвтоПолеГруппировкиКомпоновкиДанных"));
	ГруппировкаВрем.Использование = Истина;
	
	ПолеВыбор = ГруппировкаВрем.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ПолеВыбор.Использование = Истина;
	ПолеВыбор.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, КомпоновщикНастроекВрем.ПолучитьНастройки(), , ,
				Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"),Истина);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,,Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаДанных);
	
	ТаблицаДанных = ПроцессорВывода.Вывести(ПроцессорКомпоновки,Истина);
	
	ЗаполнениеОтчетностиСервер.СкопироватьНастройкиКомпоновкиДанных(Схема.ВариантыНастроек.Основной.Настройки, КомпоновщикНастроекВрем.ПолучитьНастройки());
	
	Возврат ТаблицаДанных.ВыгрузитьКолонку("Ссылка");
	
КонецФункции


&НаСервере
Процедура ВосстановитьСохраненныеНастройки(СохраненныеНастройки, ТаблицаПолей, СоответствиеПолейИДопРеквизитов)
	
	Если ТипЗнч(СохраненныеНастройки) = Тип("Структура") Тогда
		
		Значение = Неопределено;
		Если СохраненныеНастройки.Свойство("НачалоПериода", Значение) Тогда
			СохраненнаяДатаНачала = ПолучитьДатуИзПараметраЗапроса(Значение);
			
			Если СохраненнаяДатаНачала <> НачалоГода(СохраненнаяДатаНачала)
				И Год(СохраненнаяДатаНачала) = Год(ДатаОкончания) Тогда
				ДатаНачала = СохраненнаяДатаНачала;
			КонецЕсли;
		КонецЕсли;
		
		Значение = Неопределено;
		Если СохраненныеНастройки.Свойство("ОкончаниеПериода", Значение) ИЛИ СохраненныеНастройки.Свойство("КонецПериода", Значение) Тогда
			ДатаОкончания = ПолучитьДатуИзПараметраЗапроса(Значение);
		КонецЕсли;
		
		Значение = Неопределено;
		Если СохраненныеНастройки.Свойство("ОтчетнаяДата", Значение) И ТипЗнч(Значение) = Тип("Дата") Тогда
			
			ОтчетнаяДата = Значение;
			
			Если ЗначениеЗаполнено(ОтчетнаяДата) Тогда
				
				СтруктураПериода = Новый Структура;
				СтруктураПериода.Вставить("ДатаНачала", ДатаНачала);
				СтруктураПериода.Вставить("ДатаОкончания", ДатаОкончания);
				СтруктураПериода.Вставить("ОтчетнаяДата", ОтчетнаяДата);
				
				ДокМомента = Неопределено;
				Если СохраненныеНастройки.Свойство("ДокументМоментаВремени", ДокМомента) Тогда
					СтруктураПериода.Вставить("ДокументМоментаВремени", ДокМомента);
				КонецЕсли;
				
				ЗаполнитьПериодОтчета(СтруктураПериода, ПравилоЗаполнения);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Значение = Неопределено;
		Если СохраненныеНастройки.Свойство("ОтборСКД", Значение) Тогда
						
			Если ТипЗнч(Значение) = Тип("Строка") И Не ПустаяСтрока(Значение) Тогда
				ОтборСКД = ПреобразоватьОтбор(Значение);
			Иначе
				ОтборСКД = Значение;
			КонецЕсли;
						
			Если ТипЗнч(ОтборСКД) = Тип("ОтборКомпоновкиДанных") И ЗначениеЗаполнено(ОтборСКД.Элементы) Тогда
				
				МассивЭлементовДопРеквизитов = Новый Массив;
				//удалим сохраненные значения отборов доп.реквизитов, чтобы они брались из документа
				Для Каждого ТекЭлементОтбора Из ОтборСКД.Элементы Цикл
					Если ТипЗнч(ТекЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
						ИмяЭлемента = Строка(ТекЭлементОтбора.ЛевоеЗначение);
						Если СоответствиеПолейИДопРеквизитов[ИмяЭлемента] <> Неопределено Тогда
							МассивЭлементовДопРеквизитов.Добавить(ТекЭлементОтбора);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого ЭлМас Из МассивЭлементовДопРеквизитов Цикл
					ОтборСКД.Элементы.Удалить(ЭлМас);	
				КонецЦикла;
				
				НастройкиКомпоновшика = КомпоновщикНастроек.ПолучитьНастройки();
				
				Если ПроверитьДоступностьЭлементотвОтбора(НастройкиКомпоновшика, ОтборСКД.Элементы) Тогда
					
					ВосстановитьОтбор(КомпоновщикНастроек.Настройки.Отбор.Элементы, ОтборСКД.Элементы);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Значение = Неопределено;
		Если СохраненныеНастройки.Свойство("ДополнительныеДействия",Значение) Тогда
			Если ТипЗнч(Значение) = Тип("Структура") Тогда
				//если есть сохраненные настройки действий, восстановим
				//при этом проверим, что на форме есть такие реквизиты
				Для Каждого КлючИЗначение Из Значение Цикл
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект,КлючИЗначение.Ключ) Тогда
						ЭтотОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьОтбор(КоллекцияЭлементовОтбора, Знач КоллекцияЭлементовСохраненногоОтбора)
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементовОтбора Цикл
		
		ЭлементСохраненногоОтбора = НайтиЭлементОтбора(КоллекцияЭлементовСохраненногоОтбора, ЭлементОтбора.ЛевоеЗначение);
		
		Если ТипЗнч(ЭлементСохраненногоОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			ЗаполнитьЗначенияСвойств(ЭлементОтбора, ЭлементСохраненногоОтбора);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиЭлементОтбора(КоллекцияЭлементовОтбора, ПолеКомпоновки)
	
	ИмяПоля = Строка(ПолеКомпоновки);
	
	Для каждого ЭлементКоллекции Из КоллекцияЭлементовОтбора Цикл
		
		ИмяЭлемента = Строка(ЭлементКоллекции.ЛевоеЗначение);
		Поз = Найти(ИмяЭлемента, ".");
		Если Поз <> 0 Тогда
			ИмяЭлемента = Лев(ИмяЭлемента, Поз - 1);
		КонецЕсли;
		
		Если ИмяЭлемента = ИмяПоля Тогда
			
			Возврат ЭлементКоллекции;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПроверитьДоступностьЭлементотвОтбора(Знач НастройкиКомпоновщика,Знач КоллекцияЭлементовОтбора)
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементовОтбора Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			Если НЕ ПроверитьДоступностьЭлементотвОтбора(НастройкиКомпоновщика, ЭлементОтбора.Элементы) Тогда
				
				Возврат Ложь;
				
			КонецЕсли;
			
		Иначе
			
			ЛевоеЗначение = ЭлементОтбора.ЛевоеЗначение;
			
			Если НастройкиКомпоновщика.ДоступныеПоляОтбора.НайтиПоле(ЛевоеЗначение) = Неопределено Тогда
				
				Возврат Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция НастроитьКомпоновщикНастроек(ВосстанавливатьПравилоИзНастроек = Ложь)
	
	СохраненнаяНастройка = Неопределено;
	ЭтоНастройкаПравилаЗаполнения = Ложь;
	
	Если ЭтоАдресВременногоХранилища(АдресСохраненныхНастроек) Тогда
		СохраненныеНастройкиВрем = ПолучитьИзВременногоХранилища(АдресСохраненныхНастроек);
		Если ТипЗнч(СохраненныеНастройкиВрем) = Тип("Структура") И ЗначениеЗаполнено(СохраненныеНастройкиВрем) Тогда
			СохраненныеНастройки = СохраненныеНастройкиВрем;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ОтчетныйДокумент) Тогда
		СохраненныеНастройки = ОтчетныйДокумент.ПолучитьОбъект().ПолучитьДанныеРасчетов();
	ИначеЕсли ЗначениеЗаполнено(ПравилоЗаполнения) Тогда
		ЭтоНастройкаПравилаЗаполнения = Истина;
		СохраненныеНастройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ПравилоЗаполнения,"НастройкиПроверки");
	КонецЕсли;
	
	// Переопределение правила заполнения из сохраненных настроек
	Значение = Неопределено;
	Если ВосстанавливатьПравилоИзНастроек
			И ТипЗнч(СохраненныеНастройки) = Тип("Структура") 
			И СохраненныеНастройки.Свойство("ПравилоЗаполнения", Значение)
			И ТипЗнч(Значение) = Тип("СправочникСсылка.ПравилаЗаполнения")
			И ЗначениеЗаполнено(Значение) Тогда
		
		ПравилоЗаполнения = Значение;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПравилоЗаполнения) И ЗначениеЗаполнено(ВидОтчета) Тогда
		ПравилоЗаполнения = РегистрыСведений.ОсновныеПравилаЗаполнения.ПолучитьОсновноеПравило(ВидОтчета);
	КонецЕсли;
	
	ТаблицаПолей = ПолучитьПоляИнтерактивногоОтбора();
	
	Если ЭтоАдресВременногоХранилища(АдресДополнительныхРеквизитов) Тогда
		
		ДополнительныеРеквизиты = ПолучитьИзВременногоХранилища(АдресДополнительныхРеквизитов);
		
	КонецЕсли;
	
	СоответствиеПолейИДопРеквизитов = Неопределено;
	ЗаполнитьТаблицуПолей(ТаблицаПолей, ДополнительныеРеквизиты, ЗапрещенныеПоля, СоответствиеПолейИДопРеквизитов);
	ЗаполнитьСоответствиеВариантовВыбора(ТаблицаПолей);
	
	НужноВосстанавливатьНастройки = Ложь;
	
	Если ЭтоНастройкаПравилаЗаполнения
		И НЕ (ЗначениеЗаполнено(Организация) 
			ИЛИ ЗначениеЗаполнено(ИФО)) Тогда
		НужноВосстанавливатьНастройки = Истина;		
	ИначеЕсли НЕ ЭтоНастройкаПравилаЗаполнения Тогда
		НужноВосстанавливатьНастройки = Истина;	
	КонецЕсли;
	
	Если НужноВосстанавливатьНастройки Тогда
		ВосстановитьСохраненныеНастройки(СохраненныеНастройки, ТаблицаПолей, СоответствиеПолейИДопРеквизитов);
	КонецЕсли;
	
	//
	//выполним инициализацию используемых областей заполнения,
	//при инициализации будет заполнена СхемаКомпоновки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбластиЗаполнения.Ссылка,
		|	ОбластиЗаполнения.Инициализирована
		|ИЗ
		|	Справочник.ОбластиЗаполнения КАК ОбластиЗаполнения
		|ГДЕ
		|	ОбластиЗаполнения.Отключено = ЛОЖЬ
		|	И ОбластиЗаполнения.Владелец = &ПравилоЗаполнения";
	
	Запрос.УстановитьПараметр("ПравилоЗаполнения", ПравилоЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ВыборкаДетальныеЗаписи.Инициализирована Тогда
			ЗаполнениеОтчетностиТолькоСервер.ИнициализироватьИПроверитьОбластьЗаполнения(ВыборкаДетальныеЗаписи.Ссылка,Истина);
		КонецЕсли;
	КонецЦикла;
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбластиЗаполнения.СхемаКомпоновки
		|ИЗ
		|	Справочник.ОбластиЗаполнения КАК ОбластиЗаполнения
		|ГДЕ
		|	ОбластиЗаполнения.Отключено = ЛОЖЬ
		|	И ОбластиЗаполнения.Владелец = &ПравилоЗаполнения";
	
	Запрос.УстановитьПараметр("ПравилоЗаполнения", ПравилоЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураКодов = Новый Структура;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Схема = ВыборкаДетальныеЗаписи.СхемаКомпоновки.Получить();
		СоответствиеДанных = Новый Соответствие;
		Для Каждого ТекПараметр Из Схема.Параметры Цикл
			Если Лев(ТекПараметр.Имя,13)= "КодВидаОтчета" Тогда	
				ИмяНабора = Сред(ТекПараметр.Имя,15);
				КодВидаОтчета = ТекПараметр.Значение;
				
				ТекНастройка = СоответствиеДанных.Получить(ИмяНабора);
				Если ТекНастройка=Неопределено Тогда
					ТекНастройка = Новый Структура;
				КонецЕсли;
				ТекНастройка.Вставить("КодВидаОтчета",КодВидаОтчета);
				СоответствиеДанных.Вставить(ИмяНабора,ТекНастройка);
			ИначеЕсли Лев(ТекПараметр.Имя,27)= "ПараметрДляВыбораДокументов" Тогда	
				ИмяНабора = Сред(ТекПараметр.Имя,29);
				ИмяПараметраДляДокументов = ТекПараметр.Значение;
				
				ТекНастройка = СоответствиеДанных.Получить(ИмяНабора);
				Если ТекНастройка=Неопределено Тогда
					ТекНастройка = Новый Структура;
				КонецЕсли;
				
				ТекНастройка.Вставить("ИмяПараметраДляДокументов",ИмяПараметраДляДокументов);
						
				ТекПараметрДокументов = Схема.Параметры.Найти(ИмяПараметраДляДокументов);
				
				Если ТекПараметрДокументов <>Неопределено Тогда
					ТекНастройка.Вставить("ЗначениеПараметраДляДокументов",ТекПараметрДокументов.Значение);
				КонецЕсли;
				
				СоответствиеДанных.Вставить(ИмяНабора,ТекНастройка);
								
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из СоответствиеДанных Цикл
			Если СтруктураКодов.Свойство(КлючИЗначение.Значение.ИмяПараметраДляДокументов) Тогда
				ТекЗначение = СтруктураКодов[КлючИЗначение.Значение.ИмяПараметраДляДокументов];
			Иначе
				ТекЗначение = Новый Массив;
			КонецЕсли;
			Если ТекЗначение.Найти(КлючИЗначение.Значение.КодВидаОтчета) = Неопределено Тогда
				ТекЗначение.Добавить(КлючИЗначение.Значение.КодВидаОтчета);
			КонецЕсли;
			СтруктураКодов.Вставить(КлючИЗначение.Значение.ИмяПараметраДляДокументов,ТекЗначение);
		КонецЦикла;
	КонецЦикла;
		
	СтруктураПараметровВыбораДокументов = Новый ФиксированнаяСтруктура(СтруктураКодов);
КонецФункции

&НаСервере
Процедура ЗаполнитьСоответствиеВариантовВыбора(ТаблицаПолей)
	
	Если ТипЗнч(ПравилоЗаполнения) = Тип("СправочникСсылка.ПравилаЗаполнения") Тогда
		
		СоответствиеВариантовВыбораВрем = Новый Соответствие;
		Для каждого СтрокаТаблицы Из ТаблицаПолей Цикл
			
			Если СтрокаТаблицы.СохранятьЭлементОтбора Тогда
				Продолжить;
			КонецЕсли;
			
			МассивВидовСравнения = Новый Массив;
			
			Если СтрокаТаблицы.ЗадаетсяСпискомЗначений Тогда
				
				МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);	
				
			Иначе
				МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.Равно);
			
				Если НЕ ЗаполнениеОтчетности.ЭтоПримитивныйТип(СтрокаТаблицы.ТипЗначенияПараметра)
					И СтрокаТаблицы.ТипЗначенияПараметра <> Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет") Тогда
					МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеРавно);
				КонецЕсли;
				
				Если НЕ СтрокаТаблицы.ДополнительныйПараметр И (СтрокаТаблицы.ТипЗначенияПараметра = Тип("Число") ИЛИ СтрокаТаблицы.ТипЗначенияПараметра = Тип("Дата")) Тогда
					
					МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.Меньше);
					МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
					МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.Больше);
					МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
					
				ИначеЕсли НЕ СтрокаТаблицы.ДополнительныйПараметр И НЕ ЗаполнениеОтчетности.ЭтоПримитивныйТип(СтрокаТаблицы.ТипЗначенияПараметра) Тогда
					
					МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
					МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеВСписке);
					МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВИерархии);
					МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеВИерархии);
					МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
					МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии);
					
				ИначеЕсли СтрокаТаблицы.ТипЗначенияПараметра = Тип("ДокументСсылка.УниверсальныйРегламентированныйОтчет") Тогда
					
					МассивВидовСравнения.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
					
				КонецЕсли;
				
			КонецЕсли;	
			
			СоответствиеВариантовВыбораВрем.Вставить(Новый ПолеКомпоновкиДанных(СтрокаТаблицы.Псевдоним), МассивВидовСравнения);
			
		КонецЦикла;
		
		СоответствиеВариантовВыбора = Новый ФиксированноеСоответствие(СоответствиеВариантовВыбораВрем);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПолей(ТаблицаПолей, ДополнительныеРеквизиты, ЗапрещенныеПоля,СоответствиеПолейИДопРеквизитов)
	
	СтруктураЗначенийДополнительныхРеквизитов = ЗаполнениеОтчетностиСервер.ПодготовитьСтруктуруПараметров(ОтчетныйДокумент, ВидОтчета, ПравилоЗаполнения, , ДополнительныеРеквизиты, СоответствиеПолейИДопРеквизитов);
		
	ЗапрещенныеПоля = "ПараметрыДанных,СистемныеПоля";
	
	Если ТипЗнч(ПравилоЗаполнения) = Тип("СправочникСсылка.ПравилаЗаполнения") Тогда
		
		ТаблицаОбщихПараметров = Справочники.ПравилаЗаполнения.ПолучитьОбщиеПараметры(ПравилоЗаполнения, Истина);
		Для каждого СтрокаТаблицы Из ТаблицаОбщихПараметров Цикл
			
			Если ТипЗнч(СтрокаТаблицы.ЗначениеПараметра) <> Тип("Неопределено") Тогда
				
				ТипЗначенияПараметра = ТипЗнч(СтрокаТаблицы.ЗначениеПараметра);
				ТипДанных = ЗаполнениеОтчетности.ВернутьСтрокуТипаПоТипу(ТипЗначенияПараметра, "Запрос");
				
				НоваяСтрока = ТаблицаПолей.Добавить();
				НоваяСтрока.Псевдоним = СокрЛП(СтрокаТаблицы.ИмяПараметра);
				
				ЗапрещенныеПоля = ЗапрещенныеПоля + ?(ПустаяСтрока(ЗапрещенныеПоля), "", ",") + НоваяСтрока.Псевдоним;
				
				ПредставлениеПараметра = СокрЛП(СтрокаТаблицы.ПредставлениеПараметра);
				
				Синоним = ?(ЗначениеЗаполнено(ПредставлениеПараметра),ПредставлениеПараметра,БюджетнаяОтчетностьКлиентСервер.Синоним(СтрокаТаблицы.ИмяПараметра));
				НоваяСтрока.Синоним = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1'"), Синоним);
				НоваяСтрока.ТипДанных = ЗаполнениеОтчетности.ВернутьСтрокуТипаПоТипу(ТипЗначенияПараметра, "Запрос");
				НоваяСтрока.ТипЗначенияПараметра = ТипЗначенияПараметра;
				Если ЗначениеЗаполнено(СтрокаТаблицы.ВидАналитики) Тогда
					НоваяСтрока.Владелец = БюджетнаяОтчетностьСервер.ПолучитьВладельцаСубконтоДляАналитики(СтрокаТаблицы.ВидАналитики);
				Иначе
					НоваяСтрока.Владелец = Неопределено;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.ОписаниеПараметра) Тогда
					СтрокаОписания = ТаблицаОписанияПараметров.Добавить();
					СтрокаОписания.ИмяПараметра = НоваяСтрока.Псевдоним;
					СтрокаОписания.ПредставлениеПараметра = НоваяСтрока.Синоним;
					СтрокаОписания.ОписаниеПараметра = СтрокаТаблицы.ОписаниеПараметра;
					СтрокаОписания.ЗначениеПоУмолчаниюПараметра = СтрокаТаблицы.ЗначениеПараметра;
				КонецЕсли;
				
				
				Значение = Неопределено;
				Если СтруктураЗначенийДополнительныхРеквизитов.Свойство(СтрокаТаблицы.ИмяПараметра, Значение) И ЗначениеЗаполнено(Значение) Тогда
					НоваяСтрока.Значение = Значение;
				Иначе
					НоваяСтрока.Значение = СтрокаТаблицы.ЗначениеПараметра;
				КонецЕсли;
				НоваяСтрока.ДополнительныйПараметр = Истина;
				
				Если СтрокаТаблицы.ЗадаетсяСпискомЗначений И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВидАналитики) Тогда
					НоваяСтрока.ЗадаетсяСпискомЗначений = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТаблицаПолей.Количество() <> 0 Тогда
			
			АдресТаблицыПолей = ПоместитьВоВременноеХранилище(ТаблицаПолей, УникальныйИдентификатор);
			
			ПодготовитьДополнительныйОтбор(ТаблицаПолей);
			
		КонецЕсли;
			
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПериодОтчета(СтруктураПериода, ПравилоЗаполнения)
	
	ПараметрыПериода = Неопределено;
	ОбработкаДанныхОтчетности = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	ТекстОшибки = "";
	Если ОбработкаДанныхОтчетности.ВычислитьПериодОтчета(ПравилоЗаполнения, СтруктураПериода, ПараметрыПериода, ТекстОшибки) Тогда
		
		ДатаНачала = ПолучитьДатуИзПараметраЗапроса(СтруктураПериода.ДатаНачала);
		ДатаОкончания = ПолучитьДатуИзПараметраЗапроса(СтруктураПериода.ДатаОкончания);
		ОтчетнаяДата = СтруктураПериода.ОтчетнаяДата;
		ДокументМоментаВремени = СтруктураПериода.ДокументМоментаВремени;
		РежимВводаПериода = ПараметрыПериода.РежимВводаПериода;
		
	Иначе
		
		Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При вычислении периода возникли ошибки: %1'") ,ТекстОшибки));
		КонецЕсли;
		
		СтруктураПериода.ДатаНачала = НачалоДня(СтруктураПериода.ДатаНачала);
		СтруктураПериода.ДатаОкончания = КонецДня(СтруктураПериода.ДатаОкончания);
		
		ДатаНачала = СтруктураПериода.ДатаНачала;
		ДатаОкончания = СтруктураПериода.ДатаОкончания;
		
	КонецЕсли;
	
	Если ПараметрыПериода <> Неопределено Тогда
		
		Возврат ПоместитьВоВременноеХранилище(ПараметрыПериода, УникальныйИдентификатор);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура НастроитьВидимостьЭлементов()
	
	Если ЭтоАдресВременногоХранилища(АдресПараметровПериода) Тогда
		
		ПараметрыПериода = ПолучитьИзВременногоХранилища(АдресПараметровПериода);
		ВводНачалаИОкончания = ПараметрыПериода.РежимВводаПериода = "НачалоИОкончание";
		ТекстПояснений = ПараметрыПериода.ТекстПояснений;
		
	Иначе
		
		ВводНачалаИОкончания = Истина;
		ТекстПояснений = "";
		
	КонецЕсли;
	
	Элементы.ВводПериода.Видимость = ВводНачалаИОкончания;
	Элементы.ВводОтчетнойДаты.Видимость = Не ВводНачалаИОкончания;
	Элементы.ТекстПояснений.Видимость = Не ПустаяСтрока(ТекстПояснений);
	Если Не ВводНачалаИОкончания Тогда
		Если ПараметрыПериода.РежимВводаПериода = "МоментВремени" Тогда
			Элементы.ДокументМоментаВремени.Видимость = Истина;
			Элементы.ГруппаОтчетнаяДата.Видимость = Ложь;
		Иначе
			Элементы.ДокументМоментаВремени.Видимость = Ложь;
			Элементы.ГруппаОтчетнаяДата.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
	СоздатьРеквизитыДляДополнительныхДействий();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизитыДляДополнительныхДействий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаЗаполненияДополнительнаяОбработкаДанных.МетодОбработки КАК МетодОбработки,
		|	ПравилаЗаполненияДополнительнаяОбработкаДанных.НаименованиеВИнтерфейсе КАК НаименованиеВИнтерфейсе,
		|	ПравилаЗаполненияДополнительнаяОбработкаДанных.НомерСтроки КАК НомерСтроки,
		|	ПравилаЗаполненияДополнительнаяОбработкаДанных.ВыполнятьПриЗаполнении КАК ВыполнятьПриЗаполнении,
		|	ПравилаЗаполненияДополнительнаяОбработкаДанных.ТекстПодсказки КАК ТекстПодсказки
		|ИЗ
		|	Справочник.ПравилаЗаполнения.ДополнительнаяОбработкаДанных КАК ПравилаЗаполненияДополнительнаяОбработкаДанных
		|ГДЕ
		|	ПравилаЗаполненияДополнительнаяОбработкаДанных.Ссылка = &Ссылка
		|	И ПравилаЗаполненияДополнительнаяОбработкаДанных.ИзменяетсяВНастройкеЗаполнения = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПравилаЗаполненияДополнительнаяОбработкаДанных.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ПравилоЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбработкаДанныхОтчетности = Обработки.ОбработкаДанныхОтчетности.Создать();
	ТаблицаМетодов = ОбработкаДанныхОтчетности.ПолучитьМетодыДополнительнойОбработки();
	
	МассивИменДобавляемыхРеквизитов = Новый Массив;
	МассивДобавляемыхРеквизитов = Новый Массив;
	ТипБулево = Новый ОписаниеТипов("Булево");
	ЗначенияРеквизитовПоУмолчанию = Новый Структура;
	ПодсказкиРеквизитов = Новый Структура;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИмяРеквизита = ВыборкаДетальныеЗаписи.МетодОбработки + "_" + ВыборкаДетальныеЗаписи.НомерСтроки;
		НаименованиеРеквизита = "";
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НаименованиеВИнтерфейсе) Тогда
			НаименованиеРеквизита = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1'"),ВыборкаДетальныеЗаписи.НаименованиеВИнтерфейсе);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НаименованиеРеквизита) Тогда
			СтрокаТаблицыМетодов = ТаблицаМетодов.Найти(ВыборкаДетальныеЗаписи.МетодОбработки, "ИмяМетода");
			Если СтрокаТаблицыМетодов = Неопределено Тогда
				НаименованиеРеквизита = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1'"),ВыборкаДетальныеЗаписи.МетодОбработки);
			Иначе
				НаименованиеРеквизита = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1'"),СтрокаТаблицыМетодов.Представление);
			КонецЕсли;
		КонецЕсли;
		
		МассивИменДобавляемыхРеквизитов.Добавить(ИмяРеквизита);
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизита,ТипБулево,"",НаименованиеРеквизита,Ложь));
		ЗначенияРеквизитовПоУмолчанию.Вставить(ИмяРеквизита,ВыборкаДетальныеЗаписи.ВыполнятьПриЗаполнении);
		
		ПодсказкиРеквизитов.Вставить(ИмяРеквизита,СокрЛП(ВыборкаДетальныеЗаписи.ТекстПодсказки));
	КонецЦикла;
	
	ДобавленныеРеквизиты = Новый ФиксированныйМассив(МассивИменДобавляемыхРеквизитов);
	
	Если МассивДобавляемыхРеквизитов.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;
	
	ЭтотОбъект.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ЗначенияРеквизитовПоУмолчанию);
	
	Для Каждого ЭлМас Из МассивИменДобавляемыхРеквизитов Цикл
		ТекЭлемент = ЭтотОбъект.Элементы.Добавить(ЭлМас,Тип("ПолеФормы"),ЭтотОбъект.Элементы.ДополнительныеДействия);
		ТекЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		ТекЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		ТекЭлемент.ПутьКДанным = ЭлМас;
		ТекЭлемент.Подсказка = ПодсказкиРеквизитов[ЭлМас];
		ТекЭлемент.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПреобразоватьОтбор(Значение)
	
	Результат = Неопределено;
	
	Если ТипЗнч(Значение) = Тип("ОтборКомпоновкиДанных") Тогда
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение);
		Результат = ЗаписьXML.Закрыть();
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") И Не ПустаяСтрока(Значение) Тогда
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Значение);
		Результат = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		ЧтениеXML.Закрыть();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьНастройкиНаСервере(СтруктураНастроек)
	
	Если ТипЗнч(СтруктураНастроек) = Тип("ФиксированнаяСтруктура") Тогда
		
		Значение = Неопределено;
		Если СтруктураНастроек.Свойство("ДатаНачала", Значение) И ТипЗнч(Значение) = Тип("Дата") Тогда
			ДатаНачала = Значение;
		КонецЕсли;
		
		Значение = Неопределено;
		Если СтруктураНастроек.Свойство("ДатаОкончания", Значение) И ТипЗнч(Значение) = Тип("Дата") Тогда
			ДатаОкончания = Значение;
		КонецЕсли;
		
		Значение = Неопределено;
		Если СтруктураНастроек.Свойство("ОтчетнаяДата", Значение) И ТипЗнч(Значение) = Тип("Дата") Тогда
			ОтчетнаяДата = Значение;
		КонецЕсли;
		
		Значение = Неопределено;
		Если СтруктураНастроек.Свойство("ДокументМоментаВремени", Значение) И ЗначениеЗаполнено(Значение) Тогда
			ДокументМоментаВремени = Значение;
		КонецЕсли;
		
		Значение = Неопределено;
		Если СтруктураНастроек.Свойство("ОтборСКД", Значение) И ТипЗнч(Значение) = Тип("Строка") И Не ПустаяСтрока(Значение) Тогда
			
			НастройкиКомпоновшика = КомпоновщикНастроек.ПолучитьНастройки();
			
			ОтборСКД = ПреобразоватьОтбор(Значение);
			
			Если ТипЗнч(ОтборСКД) = Тип("ОтборКомпоновкиДанных") Тогда
				
				ВосстановитьОтбор(КомпоновщикНастроек.Настройки.Отбор.Элементы, ОтборСКД.Элементы);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуИзПараметраЗапроса(Знач Значение)

	Перем ДатаПараметра;
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		ДатаПараметра = Значение;
	ИначеЕсли ТипЗнч(Значение) = Тип("Граница") Тогда
		//
		Если ТипЗнч(Значение.Значение) = Тип("МоментВремениСУточнениемПериода") Тогда
			ДатаПараметра = Значение.Значение.Дата;
		Иначе
			ДатаПараметра = Значение.Значение;
		КонецЕсли;
		//
	ИначеЕсли ТипЗнч(Значение) = Тип("МоментВремени") Тогда
		ДатаПараметра = Значение.Дата;
	Иначе
		ДатаПараметра = '00010101';
	КонецЕсли;
	
	Возврат ДатаПараметра

КонецФункции // ПолучитьДатуИзПараметраЗапроса()

&НаКлиенте
Процедура ПослеЗакрытияДочернейФормы(Результат, ДополнительныеПараметры) Экспорт 
	
	ДополнительныеПараметры.ЭлементОтбора.ЛевоеЗначение = Результат;
	ДоступноеПоле = ДополнительныеПараметры.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(Результат);
	
	Если ДоступноеПоле <> Неопределено Тогда
		Если ДополнительныеПараметры.ИспользоватьСписок Тогда
			
			ПравоеЗначение = Новый СписокЗначений;
			ПравоеЗначение.ТипЗначения = ДоступноеПоле.ТипЗначения;
			
			Для каждого Элемент Из ДополнительныеПараметры.ЭлементОтбора.ПравоеЗначение Цикл
				НовоеЗначение = ДоступноеПоле.ТипЗначения.ПривестиЗначение(Элемент.Значение);
				Если НовоеЗначение <> Неопределено Тогда 
					ПравоеЗначение.Добавить(НовоеЗначение);
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			ДополнительныеПараметры.ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ПравоеЗначение = ДоступноеПоле.ТипЗначения.ПривестиЗначение();
			
		КонецЕсли;
		
		ДополнительныеПараметры.ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("УстановитьОписаниеПараметра",0.2,Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОписаниеПараметра() Экспорт
	
	ОписаниеПараметра = "";
	ПараметрЗаголовок = "";
	ПараметрЗначениеПоУмолчанию = "";
	
	ТекДанные = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ИмяТекущегоПараметра = "";
		Возврат;
	КонецЕсли;
	
	ИмяПараметра = Строка(ТекДанные.ЛевоеЗначение);
	Если НЕ ЗначениеЗаполнено(ИмяПараметра) ИЛИ ИмяТекущегоПараметра = ИмяПараметра Тогда
		ИмяТекущегоПараметра = "";
		Возврат;
	КонецЕсли;
	
	ИмяТекущегоПараметра = ИмяПараметра;
	
	ПараметрыПоиска = Новый Структура("ИмяПараметра", ИмяПараметра);
	НайденныеСтроки = ТаблицаОписанияПараметров.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		ПараметрЗаголовок = НайденныеСтроки[0].ПредставлениеПараметра;
		ОписаниеПараметра = НайденныеСтроки[0].ОписаниеПараметра;
		ОписаниеПараметра = СтрЗаменить(ОписаниеПараметра,Символ(182),Символы.ПС);
		Если ЗначениеЗаполнено(НайденныеСтроки[0].ЗначениеПоУмолчаниюПараметра) Тогда
			ШаблонЗначениеПоУмолчанию = НСтр("ru = 'Значение по умолчанию: %1'");
			ПараметрЗначениеПоУмолчанию = СтрШаблон(ШаблонЗначениеПоУмолчанию, НайденныеСтроки[0].ЗначениеПоУмолчаниюПараметра);					
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


