#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	УчетНДСРаздельный.ДобавитьДвиженияНеоблагаемыеНДСОперации(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, ДокументСсылка);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ОтчетОРозничныхПродажах";
	КомандаПечати.Идентификатор		= "ОтчетККМ0330106";
	КомандаПечати.Представление		= НСтр("ru = 'Справка-отчет кассира-операциониста'");
	КомандаПечати.Порядок			= 1;
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОтчетККМ0330106") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОтчетККМ0330106","Справка-отчет кассира-операциониста",ПечатьОтчетККМ(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
		
КонецПроцедуры // Печать()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьОтчетККМ(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетОРозничныхПродажах.ПФ_MXL_ОтчетККМ");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока    = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог      = Макет.ПолучитьОбласть("Итог");
	ОбластьПодвал    = Макет.ПолучитьОбласть("Подвал");
	ОбластьОборот    = Макет.ПолучитьОбласть("Оборот");
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ОтчетОРозничныхПродажах.Организация,
	               |	ОтчетОРозничныхПродажах.НомерПервичногоДокумента КАК НомерДокумента,
	               |	ОтчетОРозничныхПродажах.ДатаПервичногоДокумента КАК ДатаДокумента,
	               |	ОтчетОРозничныхПродажах.Номер,
	               |	ОтчетОРозничныхПродажах.Дата,
	               |	ОтчетОРозничныхПродажах.Организация.ИНН КАК ИНН,
	               |	ОтчетОРозничныхПродажах.Организация.КодОКПО КАК ОКПО,
	               |	ПРЕДСТАВЛЕНИЕ(ОтчетОРозничныхПродажах.Подразделение) КАК ПодразделениеПредставление,
	               |	ВЫБОР
	               |		КОГДА ОтчетОРозничныхПродажах.Организация.НаименованиеПолное = """"
	               |			ТОГДА ОтчетОРозничныхПродажах.Организация.Наименование
	               |		ИНАЧЕ ОтчетОРозничныхПродажах.Организация.НаименованиеПолное
	               |	КОНЕЦ КАК ОрганизацияНаименование,
	               |	ОтчетОРозничныхПродажах.СуммаДокумента КАК Итого,
	               |	ОтчетОРозничныхПродажах.Руководитель КАК Руководитель,
	               |	ОтчетОРозничныхПродажах.СтаршийКассир КАК СтаршийКассир,
	               |	ОтчетОРозничныхПродажах.КассирОперационист КАК КассирОперационист,
	               |	ОтчетОРозничныхПродажах.Ссылка
	               |ИЗ
	               |	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	               |ГДЕ
	               |	ОтчетОРозничныхПродажах.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаДокумента,
	               |	НомерДокумента";
				   
	Запрос = Новый Запрос(ТекстЗапроса);			   
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать();
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
    	НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
	
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаШапка);
		ПараметрыЗаголовка = Новый Структура("ОрганизацияПредставление",
											СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСТР("ru = '%1, адрес: %2, тел.: %3'"),
											ВыборкаШапка.ОрганизацияНаименование,
											УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаШапка.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации),
											УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаШапка.Организация, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации)));
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыЗаголовка);
														
		ТабДокумент.Вывести(ОбластьЗаголовок);													
		ТабДокумент.Вывести(ОбластьШапка);													
	
		ОбластьСтрока.Параметры.Заполнить(ВыборкаШапка);
		ТабДокумент.Вывести(ОбластьСтрока);													
	
		ОбластьИтог.Параметры.Заполнить(ВыборкаШапка);
		ОбластьИтог.Параметры.СуммаВыручкиПрописью = ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(ВыборкаШапка.Итого, Константы.ВалютаРегламентированногоУчета.Получить());
		ТабДокумент.Вывести(ОбластьИтог);	
		ТабДокумент.Вывести(ОбластьПодвал);	
		
		ОтветственныеЛица = Новый Массив;
		ОтветственныеЛица.Добавить(ВыборкаШапка.СтаршийКассир);
		ОтветственныеЛица.Добавить(ВыборкаШапка.КассирОперационист);
		ОтветственныеЛица.Добавить(ВыборкаШапка.Руководитель);
		
		ДанныеСотрудников = Справочники.Сотрудники.ПолучитьДанныеСотрудников(ОтветственныеЛица, "Фамилия, Имя, Отчество, Должность", ВыборкаШапка.Дата);
		
		СтруктураПараметров = Новый Структура("ФИОСтаршийКассир, ФИОРуководитель, ДолжностьРуководитель, ФИОКассирОперационист", "", "", "", "");
		
		Если ЗначениеЗаполнено(ВыборкаШапка.СтаршийКассир) Тогда
			ДанныеСотрудника = ДанныеСотрудников.Найти(ВыборкаШапка.СтаршийКассир, "Ссылка");
	    	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество", ДанныеСотрудника.Фамилия, ДанныеСотрудника.Имя, ДанныеСотрудника.Отчество);
			СтруктураПараметров.ФИОСтаршийКассир = КорреспондентыКлиентСервер.ФИО(СтруктураФИО, Истина);
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаШапка.КассирОперационист) Тогда
			ДанныеСотрудника = ДанныеСотрудников.Найти(ВыборкаШапка.КассирОперационист, "Ссылка");
	    	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество", ДанныеСотрудника.Фамилия, ДанныеСотрудника.Имя, ДанныеСотрудника.Отчество);
			СтруктураПараметров.ФИОКассирОперационист = КорреспондентыКлиентСервер.ФИО(СтруктураФИО, Истина);
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаШапка.Руководитель) Тогда
			ДанныеСотрудника = ДанныеСотрудников.Найти(ВыборкаШапка.Руководитель, "Ссылка");
	    	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество", ДанныеСотрудника.Фамилия, ДанныеСотрудника.Имя, ДанныеСотрудника.Отчество);
			СтруктураПараметров.ФИОРуководитель = КорреспондентыКлиентСервер.ФИО(СтруктураФИО, Истина);
			СтруктураПараметров.ДолжностьРуководитель = ДанныеСотрудника.Должность;
		КонецЕсли;
		
		ОбластьОборот.Параметры.Заполнить(СтруктураПараметров);
		ТабДокумент.Вывести(ОбластьОборот);	
	
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
	КонецЦикла; 
	
	Возврат ТабДокумент;
КонецФункции	

#КонецОбласти

#КонецЕсли
