&НаСервере
Перем ОбработкаОбъект;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) И ТипЗнч(Параметры.ЗначениеКопирования) = ТипЗнч(Объект.Ссылка) Тогда
		ОбъектОтбора = Параметры.ЗначениеКопирования;  //скопируем значения источника
	Иначе
		ОбъектОтбора = Объект.Ссылка;
	КонецЕсли;
	
	ПрочитатьЗаполнитьХарактеристикиИЗначения(ОбъектОтбора);
	
	Элементы.ХарактеристикиИЗначения.ТолькоПросмотр = НЕ ПравоДоступа("Изменение", Метаданные.Справочники.ДополнительнаяБюджетнаяКлассификация);
	
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы") Тогда
		ТолькоПросмотр = Истина;
		Элементы.ХарактеристикиИЗначения.ТолькоПросмотр = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбработкаОбъект = ПолучитьОбработкуОбъект();
	
	ОбработкаОбъект.НайтиДобавитьДопКлассификацию(Истина);
		
	ТекущийОбъект.Наименование =  ОбработкаОбъект.СформироватьНаименование();

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Передача ссылки для впервые записанного элемента.
	ОбработкаОбъект.ОбъектОтбораЗначений = ТекущийОбъект.Ссылка;

	Отказ = НЕ ОбработкаОбъект.ЗаписатьЗначенияХарактеристик();
	
	ПоместитьОбработкуОбъект();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыХарактеристикиИЗначения

&НаКлиенте
Процедура ХарактеристикиИЗначенияХарактеристикиИЗначенияЗначениеПриИзменении(Элемент)
	ХарактеристикиИЗначенияХарактеристикиИЗначенияПриИзмененииНаСервере(Элементы.ХарактеристикиИЗначения.ТекущаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура перезаполняет таблицу видов доп.классификаторов и значений.
//
// Параметры:
//  ОбъектОтбора - ссылка на справочник ДополнительнаяБюджетнаяКлассификация, 
//  значения свойств которого надо прочитать.
//
&НаСервере
Процедура ПрочитатьЗаполнитьХарактеристикиИЗначения(ОбъектОтбора)

    ОбработкаОбъект = ПолучитьОбработкуОбъект();
	ОбработкаОбъект.ОбъектОтбораЗначений = ОбъектОтбора;
	ОбработкаОбъект.ПрочитатьЗаполнитьХарактеристикиИЗначения();
	ПоместитьОбработкуОбъект();

КонецПроцедуры

&НаСервере
Функция ПолучитьОбработкуОбъект()
	Возврат РеквизитФормыВЗначение("ХарактеристикиИЗначения");	
КонецФункции

&НаСервере
Функция ПоместитьОбработкуОбъект()
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"ХарактеристикиИЗначения");
	ОбработкаОбъект = Неопределено;
КонецФункции

&НаСервере
Процедура ХарактеристикиИЗначенияХарактеристикиИЗначенияПриИзмененииНаСервере(Идентификатор)
	
	ОбработкаОбъект = ПолучитьОбработкуОбъект();
	ТекДанные = ХарактеристикиИЗначения.ХарактеристикиИЗначения.НайтиПоИдентификатору(Идентификатор);
	ТекДанные.ЗначениеДетализируемойБК = ТекДанные.Значение.ДетализируемыйКодБК;
	ТекДанные.Наименование = ТекДанные.Значение.Наименование;
	Объект.Наименование =  ОбработкаОбъект.СформироватьНаименование();

КонецПроцедуры

#КонецОбласти


