/////////////////////////////////////////////////////////////////////////////////
// БУХГАЛТЕРСКИЕ ОПЕРАЦИИ, КЛИЕНТСКИЕ ПРОЦЕДУРЫ И ФУНКЦИИ                      //
/////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПараметрыОткрытияНовогоДокумента() Экспорт

	Параметры = Новый Структура("ТиповаяОперация, ЗначенияДопРеквизитов, ЗначенияДопКолонок,"
		+ "НеПроверятьПраваТиповойОперации, НеПересчитыватьКурсПриВводе");
	Параметры.НеПроверятьПраваТиповойОперации = Ложь;
	Параметры.НеПересчитыватьКурсПриВводе     = Ложь;
	
	Возврат Параметры;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Оповещает пользователя об изменении типовой операции.
// Вызывается из процедуры-обработчика изменения ключевого реквизита типовой операции после
// вызова БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения - форма, из которой происходит вызов
//
Процедура ПриИзмененииКлючевогоРеквизита(Форма) Экспорт
	Если Форма.БухгалтерскиеОперации_ИзмениласьТиповаяОперация = БухгалтерскиеОперацииКлиентСервер.ПризнакИзмененияТиповойОперации_Изменена() Тогда
		ТекстОповещения = НСтр("ru = 'Изменилась типовая операция'");
	ИначеЕсли Форма.БухгалтерскиеОперации_ИзмениласьТиповаяОперация = БухгалтерскиеОперацииКлиентСервер.ПризнакИзмененияТиповойОперации_Очищена() Тогда
		ТекстОповещения = НСтр("ru = 'Очищена типовая операция'");
	ИначеЕсли Форма.БухгалтерскиеОперации_ИзмениласьТиповаяОперация = БухгалтерскиеОперацииКлиентСервер.ПризнакИзмененияТиповойОперации_Установлена() Тогда
		ТекстОповещения = НСтр("ru = 'Установлена типовая операция'");
	Иначе
		Возврат;
	КонецЕсли;
	Форма.БухгалтерскиеОперации_ИзмениласьТиповаяОперация = БухгалтерскиеОперацииКлиентСервер.ПризнакИзмененияТиповойОперации_БезИзменения();
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Изменение типовой операции'"), , ТекстОповещения, , , Форма.УникальныйИдентификатор);
	
	Если ОбщегоНазначенияБГУКлиентСервер.ЗапрещеноДобавлениеСтрокВДокументыНФА(Форма) Тогда
		ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(Форма);
	КонецЕсли;
КонецПроцедуры

Процедура ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Производит проверку заполнения типовой операции и доп. реквизитов.
//
// Параметры
// стандартные параметры обработчика ПередЗаписью
//  Отказ  - Булево -
//  ПараметрыЗаписи - ПараметрыЗаписиДокумента
//
//  Форма  - УправляемаяФорма - для доступа к реквизитам операции
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи, Форма) Экспорт

	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		
		Если БухгалтерскиеОперацииКлиентСервер.ПроверятьЗаполнениеДополнительныхРеквизитов(Форма.Объект)
				И НЕ БухгалтерскиеОперацииКлиентСервер.ОбязательныеРеквизитыЗаполнены(Форма) Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если Не Отказ Тогда
			Форма["БухгалтерскиеОперации_УИДЗамераПроизводительности"] =
				ОценкаПроизводительностиКлиент.ЗамерВремени();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

Процедура ПослеЗаписи(ПараметрыЗаписи, Форма) Экспорт
	Если Форма["Объект"].Проведен Тогда
		
		КлючеваяОперация = ОбщегоНазначенияБГУКлиентСервер.ИмяКлючевойОперации(Форма.Объект.Ссылка, "Проведение");
		ОценкаПроизводительностиКлиент.УстановитьКлючевуюОперациюЗамера(
			Форма["БухгалтерскиеОперации_УИДЗамераПроизводительности"], КлючеваяОперация);
			
		Оповестить("ДокументПроведен", Форма["Объект"].Ссылка);
	Иначе
		Оповестить("ДокументНеПроведен", Форма["Объект"].Ссылка);
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии(Форма) Экспорт

	Если Форма.СписокЭлементовСКонфликтамиИмен.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// обрабатываем конфликты имен реквизитов

	ЖирныйШрифт = Новый Шрифт(,,Истина);
	
	ЧастиПредупреждения = Новый Массив;
	ЧастиПредупреждения.Добавить(
		НСтр("ru = 'Обнаружены ошибки в настройке следующих дополнительных колонок документа:
			|
			|'"));
	ПерваяПричина = Истина;
	Для каждого Конфликт Из Форма.СписокЭлементовСКонфликтамиИмен Цикл
	
		СоставИмени = СтрРазделить(Конфликт.Значение, ".");
		Если СоставИмени[0] <> "Объект" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПерваяПричина Тогда
			ЧастиПредупреждения.Добавить(";" + Символы.ПС);
		КонецЕсли;
		ПерваяПричина = Ложь;
		
		ЧастиПредупреждения.Добавить(
			НСтр("ru = ' - табличная часть ""'"));
		ЧастиПредупреждения.Добавить(Новый ФорматированнаяСтрока(СоставИмени[1], ЖирныйШрифт));
		ЧастиПредупреждения.Добавить(
			НСтр("ru = '"", добавленный реквизит ""'"));
		ЧастиПредупреждения.Добавить(Новый ФорматированнаяСтрока(СоставИмени[2], ЖирныйШрифт));
		
	КонецЦикла;
	
	ЧастиПредупреждения.Добавить(
		НСтр("ru = '.
			|
			|Редактирование документа запрещено. Чтобы исправить ошибку следует
			|перейти в справочник ""'"));
	ЧастиПредупреждения.Добавить(Новый ФорматированнаяСтрока(
		НСтр("ru = 'Дополнительные табличный части документа'"),,,,
		"e1cib/list/Справочник.ДополнительныеТабличныеЧастиДокументов"));
	ЧастиПредупреждения.Добавить(
		НСтр("ru = '""
		|и исправить поле ""Имя"" в перечисленных колонках.
		|После исправления, возможно, потребуется дополнительная настройка
		|'"));
	ЧастиПредупреждения.Добавить(Новый ФорматированнаяСтрока(
		НСтр("ru = 'типовых операций'"),,,,"e1cib/list/Справочник.ТиповыеОперации"));
	ЧастиПредупреждения.Добавить(НСтр("ru = ', в которых использованы указанные дополнительные колонки.'"));
	
	ТекстПредупреждения = Новый ФорматированнаяСтрока(ЧастиПредупреждения);
	
	ПоказатьПредупреждение(,ТекстПредупреждения,,НСтр("ru = 'Конфликт имен дополнительных колонок документа'"));
	
КонецПроцедуры

// Обновляет курс валюты и кратность на форме
// Параметры
// Форма - УправляемаяФорма
// Объект - ЭлементыФормыСтруктура - документ-объект в форме
//
Процедура ОбновитьКурсВалюты(Форма, Объект) Экспорт
	
	ДатаКурса = Объект.Дата;
	Валюта=Неопределено;
	Если НЕ Объект.Свойство("ВалютаДокумента", Валюта) Тогда
		Возврат;
	КонецЕсли;
	
	КурсКратность = БухгалтерскиеОперацииВызовСервера.ПолучитьКурсВалюты(Валюта, ДатаКурса);
	Форма[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФормыПоИмениДляФормулы(
			Форма,
			"Курс")]
		= КурсКратность.Курс;
	Форма[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФормыПоИмениДляФормулы(
			Форма,
			"Кратность")]
		= КурсКратность.Кратность;
	
КонецПроцедуры

Процедура ПоказатьОповещениеПриИзмененииКурсаВалюты(ИзмениласьДата, ИзмениласьВалюта) Экспорт
	
	Если ИзмениласьДата = Истина Тогда
		ТекстОповещения = НСтр("ru = 'При изменении даты был изменен курс валюты'");
	ИначеЕсли ИзмениласьВалюта = Истина Тогда
		ТекстОповещения = НСтр("ru = 'При изменении валюты был изменен курс валюты'");
	Иначе
		Возврат;
	КонецЕсли;	
	
	ТекстЗаголовка = НСтр("ru = 'Изменен курс валюты'");
	
	ПоказатьОповещениеПользователя(ТекстЗаголовка,, ТекстОповещения, БиблиотекаКартинок.Информация32);
	
	ИзмениласьДата   = Ложь;
	ИзмениласьВалюта = Ложь;

КонецПроцедуры

// Процедура открывает обработку ФормированиеБухгалтерскихПроводок.
//
Процедура КомандаОткрытьОперацию(Объект, ПолеДляРеквизитов=Неопределено) Экспорт

	Если БухгалтерскиеОперацииВызовСервера.ЭтоСсылка(ТипЗнч(Объект)) Тогда
		ПараметрыФормы = Новый Структура("ДокументОснование", Объект);
		ОткрытьФорму("Обработка.ФормированиеБухгалтерскихПроводок.Форма.Форма", ПараметрыФормы,,Объект.Ссылка);
	ИначеЕсли ПолеДляРеквизитов = Неопределено Тогда
		ПараметрыФормы = Новый Структура("ДокументОснование", Объект.Ссылка);
		ОткрытьФорму("Обработка.ФормированиеБухгалтерскихПроводок.Форма.Форма", ПараметрыФормы,,Объект.Ссылка); 
	Иначе
		
		Ссылка = Объект.Ссылка;
		Если Объект.Проведен Тогда
			ПараметрыФормы = Новый Структура("ДокументОснование", Ссылка);
			ОткрытьФорму("Обработка.ФормированиеБухгалтерскихПроводок.Форма.Форма", ПараметрыФормы,,Объект.Ссылка); 
		Иначе
			Форма = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(ПолеДляРеквизитов, Тип("ФормаКлиентскогоПриложения"));
			ЗначенияДопРеквизитов = ДополнительныеРеквизитыИзФормы(Форма);;
			
			ПараметрыФормы = Новый Структура("ДокументОбъект, ТиповаяОперация, ЗначенияДопРеквизитов");
			ПараметрыФормы.ДокументОбъект        = Объект;
			ПараметрыФормы.ТиповаяОперация       = Форма[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитыФормыТиповаяОперацияФактическое(Форма)];
			ПараметрыФормы.ЗначенияДопРеквизитов = ЗначенияДопРеквизитов;
			
			ОткрытьФорму("Обработка.ФормированиеБухгалтерскихПроводок.Форма.Форма", ПараметрыФормы,,Объект.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Очищает связанные субконто: "Денежные документы" при изменении "Виды денежных документов",
// "Договоры" при изменении "Контрагенты".
// При изменении субконто "Контрагенты" может одновременно изменить КЭК, если установлен параметр УстанавливатьКЭК.
//
// Параметры:
//  Элемент					 - ЭлементФормы - элемент, из события ПриИзменении которого вызвана процедура.
//  ПрефиксСубконтоДанных	 - Строка       - переопределение имени реквизита, содержащего Субконто.
//  СтруктураИменСубконто	 - Структура    - должна содержать ключи:
//   * НомерСубконто         - Число  - номер измененного субконто
//   * ИмяРеквизитаСубконто  - Строка - имя реквизита изменного субконто
//   * ИмяРеквизитаСубконто1 - Строка - имя реквизита, содержащего Субконто1
//   * ИмяРеквизитаСубконто2 - Строка - имя реквизита, содержащего Субконто2
//   * ИмяРеквизитаСубконто3 - Строка - имя реквизита, содержащего Субконто3
//  УстанавливатьКЭК		 - Булево       - Если Истина, то будет установлен реквизит "КЭКДт" или "КЭККт".
//
Процедура СубконтоПриИзменении(Элемент, Знач ПрефиксСубконтоДанных = "", Знач СтруктураИменСубконто = Неопределено, УстанавливатьКЭК = Ложь, ВводОстатков = Ложь) Экспорт
	
	Таблица = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(Элемент, Тип("ТаблицаФормы"));
	Форма = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(Элемент, Тип("ФормаКлиентскогоПриложения"));
	
	Если ТипЗнч(СтруктураИменСубконто) = Тип("Структура") Тогда
		ИспользуемаяСтруктураИменСубконто = СтруктураИменСубконто;
	Иначе
		НомерСубконто = Прав(Элемент.Имя,1);
		
		Если НЕ ПустаяСтрока(ПрефиксСубконтоДанных) Тогда
			ПрефиксСубконто = ПрефиксСубконтоДанных;
		Иначе
			ДтКт = Лев(Прав(Элемент.Имя,3),2);
			ПрефиксСубконто = "Субконто"+ДтКт;
		КонецЕсли;
		
		ИспользуемаяСтруктураИменСубконто = Новый Структура();
		ИспользуемаяСтруктураИменСубконто.Вставить("НомерСубконто",			НомерСубконто);
		ИспользуемаяСтруктураИменСубконто.Вставить("ИмяРеквизитаСубконто",	ПрефиксСубконто + Строка(НомерСубконто));
		ИспользуемаяСтруктураИменСубконто.Вставить("ИмяРеквизитаСубконто1",	ПрефиксСубконто + "1");
		ИспользуемаяСтруктураИменСубконто.Вставить("ИмяРеквизитаСубконто2",	ПрефиксСубконто + "2");
		ИспользуемаяСтруктураИменСубконто.Вставить("ИмяРеквизитаСубконто3",	ПрефиксСубконто + "3");
	КонецЕсли;
	
	ТекущиеДанные = Таблица.ТекущиеДанные;
	
	НомерСубконто		= ИспользуемаяСтруктураИменСубконто["НомерСубконто"];
	ВыбранноеЗначение	= ТекущиеДанные[ИспользуемаяСтруктураИменСубконто["ИмяРеквизитаСубконто"]];
	
	ТипЗначения = ТипЗнч(ВыбранноеЗначение);
	
	Если ТипЗначения = Тип("СправочникСсылка.ВидыДенежныхДокументов") Тогда
		
		Для Счетчик=Число(НомерСубконто) По 3 Цикл
			ИмяРеквизитаСубконто = ИспользуемаяСтруктураИменСубконто["ИмяРеквизитаСубконто" + Строка(Счетчик)];
			Если ТипЗнч(ТекущиеДанные[ИмяРеквизитаСубконто]) = Тип("СправочникСсылка.ДенежныеДокументы") Тогда
				
				
				Если БухгалтерскиеОперацииВызовСервера.ВладелецОбъекта(
									ТекущиеДанные[ИмяРеквизитаСубконто])<> ВыбранноеЗначение Тогда
					ТекущиеДанные[ИмяРеквизитаСубконто] = "";
				КонецЕсли;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Для Счетчик=Число(НомерСубконто) По 3 Цикл
			ИмяРеквизитаСубконто = ИспользуемаяСтруктураИменСубконто["ИмяРеквизитаСубконто" + Строка(Счетчик)];
			Если ТипЗнч(ТекущиеДанные[ИмяРеквизитаСубконто]) = Тип("СправочникСсылка.Договоры") Тогда
				
				Если БухгалтерскиеОперацииВызовСервера.КонтрагентОбъекта(
									ТекущиеДанные[ИмяРеквизитаСубконто]) <> ВыбранноеЗначение Тогда
					ТекущиеДанные[ИмяРеквизитаСубконто] = "";
				КонецЕсли;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если УстанавливатьКЭК
		И (ТипЗначения = Тип("СправочникСсылка.Контрагенты") ИЛИ  ТипЗначения = Тип("СправочникСсылка.Номенклатура"))
		И ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		
		ПараметрыКЭК = БухгалтерскийУчетКлиентСервер.ПараметрыРасчетаКЭКПроводки();
		ПараметрыКЭК.Дата = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Объект, "Дата", '0001.01.01' );
		ПараметрыКЭК.ИФО = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Объект, "ИФО");
		ПараметрыКЭК.КФО = ТекущиеДанные.КФО;
		ПараметрыКЭК.Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Объект, "Организация");
		ПараметрыКЭК.Субконто1 = ТекущиеДанные[ИспользуемаяСтруктураИменСубконто["ИмяРеквизитаСубконто1"]];
		ПараметрыКЭК.Субконто2 = ТекущиеДанные[ИспользуемаяСтруктураИменСубконто["ИмяРеквизитаСубконто2"]];
		ПараметрыКЭК.Субконто3 = ТекущиеДанные[ИспользуемаяСтруктураИменСубконто["ИмяРеквизитаСубконто3"]];
		ПараметрыКЭК.Счет = ТекущиеДанные["Счет" + ДтКт];
		ПараметрыКЭК.ДтКт = ДтКт;
		ПараметрыКЭК.ВводОстатков = ВводОстатков;
		
		КЭКПроводки = БухгалтерскийУчетВызовСервера.КЭКПроводки(ПараметрыКЭК);
		Если ЗначениеЗаполнено(КЭКПроводки) Тогда
			ТекущиеДанные["КЭК" + ДтКт] = КЭКПроводки;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СубконтоПриИзмененииСпр(Элемент, СтруктураСчета, НомерСубконто) Экспорт
	
	ВыбранноеЗначение = СтруктураСчета["Субконто"+НомерСубконто];
	
	ТипЗначения = ТипЗнч(ВыбранноеЗначение);
	
	Если ТипЗначения = Тип("СправочникСсылка.ВидыДенежныхДокументов") Тогда
		
		Для Счетчик=Число(НомерСубконто) По 3 Цикл
			Если ТипЗнч(СтруктураСчета["Субконто"+Счетчик]) = Тип("СправочникСсылка.ДенежныеДокументы") Тогда
				
				
				Если БухгалтерскиеОперацииВызовСервера.ВладелецОбъекта(
									СтруктураСчета["Субконто"+Счетчик])<> ВыбранноеЗначение Тогда
					СтруктураСчета["Субконто"+Счетчик] = "";
				КонецЕсли;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Для Счетчик=Число(НомерСубконто) По 3 Цикл
			Если ТипЗнч(СтруктураСчета["Субконто"+Счетчик]) = Тип("СправочникСсылка.Договоры") Тогда
				
				Если БухгалтерскиеОперацииВызовСервера.КонтрагентОбъекта(
									СтруктураСчета["Субконто"+Счетчик]) <> ВыбранноеЗначение Тогда
					СтруктураСчета["Субконто"+Счетчик] = "";
				КонецЕсли;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

// Процедура производит выбор значений субконто из элементов формы. Устанавливает для выбора необходимые отборы
//
// Элемент - элемент формы, из которого производится выбор
// ДанныеВыбора - второй параметр события "НачалоВыбора" элемента формы
// СтандартнаяОбработка - Булево. Третий параметр события "НачалоВыбора" элемента формы
// Организация - СправочникСсылка.Организации.
// ТекущееЗначение - Текущее значени параметра "Элемент"
// ТекущийСчет - ПланыСчетовСсылка.ЕПСБУ. Может быть пустым, только для документа "ОперацияБух" и обработки "ФормированиеБухгалтерскихПроводок".
//				Для всех остальных объектов, следует указывать.
//  ПрефиксСубконтоДанных - Строка. Префикс имени реквизита объекта, хранящего субконто. Например, для имени реквизита СубконтоСчетУчета1, префикс - "СубконтоСчетУчета".
//
Процедура СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Организация, ТекущееЗначение=Неопределено, ТекущийСчет = Неопределено, ПрефиксСубконтоДанных = Неопределено, СтруктураВыбораСубконто = Неопределено) Экспорт

	Если Найти(ВРЕГ(Элемент.Имя), ВРЕГ("Подразделение"))>0 Тогда
		ПараметрыФормы = Новый Структура("Отбор, ТекущаяСтрока",
										 Новый Структура("Владелец", Организация),
										 ТекущееЗначение);
		ОткрытьФорму("Справочник.Подразделения.ФормаВыбора", ПараметрыФормы, Элемент);
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли Найти(ВРЕГ(Элемент.Имя), ВРЕГ("Субконто"))>0 Тогда
		Форма = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(Элемент, Тип("ФормаКлиентскогоПриложения"));
		Таблица = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(Элемент, Тип("ТаблицаФормы"));
		
		ТекущиеДанные = ?(Таблица <> Неопределено, Таблица.ТекущиеДанные, Форма.Объект);
		
		НомерСубконто = Прав(Элемент.Имя,1);
		Если ПрефиксСубконтоДанных = Неопределено Тогда
			ДтКт = Лев(Прав(Элемент.Имя,3),2);
			ПрефиксСубконто = "Субконто" + ДтКт;
		Иначе
			ДтКт = Сред(ПрефиксСубконтоДанных, Найти(ВРЕГ(ПрефиксСубконтоДанных), "СУБКОНТО")+8, 2);
			ПрефиксСубконто = ПрефиксСубконтоДанных;
		КонецЕсли;
		
		Если СтруктураВыбораСубконто = Неопределено Тогда
			СтруктураВыбораСубконто = БухгалтерскийУчетКлиент.ИнициализироватьСтруктуруНачалаВыбораСубконто();
			
			СтруктураВыбораСубконто.Организация 	= Организация;
			
			СтруктураВыбораСубконто.КФО				= ТекущиеДанные.КФО;
			
			Если ТекущийСчет = Неопределено Тогда
				СтруктураВыбораСубконто.Счет 		= ТекущиеДанные["Счет"+ДтКт];
			Иначе
				СтруктураВыбораСубконто.Счет 		= ТекущийСчет;
			КонецЕсли;	
			
			Попытка
				СтруктураВыбораСубконто.КПС			= ТекущиеДанные["КПС"+ДтКт];
				СтруктураВыбораСубконто.КЭК			= ТекущиеДанные["КЭК"+ДтКт];
			Исключение
				// в документе нет нужных реквизитов
			КонецПопытки;
			
			СтруктураВыбораСубконто.Субконто1 		= ТекущиеДанные[ПрефиксСубконто + "1"];
			СтруктураВыбораСубконто.Субконто2 		= ТекущиеДанные[ПрефиксСубконто + "2"];
			СтруктураВыбораСубконто.Субконто3 		= ТекущиеДанные[ПрефиксСубконто + "3"];
			СтруктураВыбораСубконто.НомерСубконто 	= Число(НомерСубконто);
		КонецЕсли;
		
		БухгалтерскийУчетКлиент.ПриНачалеВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, СтруктураВыбораСубконто);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура производит выбор значений субконто из элементов формы. Устанавливает для выбора необходимые отборы. 
// Используется в справочнике Основные средства.
//
// Элемент - элемент формы, из которого производится выбор
// ДанныеВыбора - второй параметр события "НачалоВыбора" элемента формы
// СтандартнаяОбработка - Булево. Третий параметр события "НачалоВыбора" элемента формы
// Организация - СправочникСсылка.Организации.
// СтруктураСчета - Структура, содержащая ключи "Счет", "Субконто1", "Субконто2", "Субконто3"
// НомерСубконто - число - номер субконто.
Процедура СубконтоНачалоВыбораСпр(Элемент, ДанныеВыбора, СтандартнаяОбработка,
								Организация, 
								СтруктураСчета,
								НомерСубконто) Экспорт
								
	ТекущееЗначение = СтруктураСчета["Субконто"+НомерСубконто];								

	Если Найти(Элемент.Имя, "Подразделение")>0 Тогда
		ПараметрыФормы = Новый Структура("Отбор, ТекущаяСтрока",
										 Новый Структура("Владелец", Организация),
										 ТекущееЗначение);
		ОткрытьФорму("Справочник.Подразделения.ФормаВыбора", ПараметрыФормы, Элемент);
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли Найти(Элемент.Имя, "Субконто")>0 Тогда
		
		СтруктураВыбораСубконто = БухгалтерскийУчетКлиент.ИнициализироватьСтруктуруНачалаВыбораСубконто();
		СтруктураВыбораСубконто.Организация 	= Организация;
		СтруктураВыбораСубконто.Счет 			= СтруктураСчета.Счет;
		СтруктураВыбораСубконто.Субконто1 		= СтруктураСчета.Субконто1;
		СтруктураВыбораСубконто.Субконто2 		= СтруктураСчета.Субконто2;
		СтруктураВыбораСубконто.Субконто3 		= СтруктураСчета.Субконто3;
		СтруктураВыбораСубконто.НомерСубконто 	= Число(НомерСубконто);
		БухгалтерскийУчетКлиент.ПриНачалеВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, СтруктураВыбораСубконто);
		
	КонецЕсли;

КонецПроцедуры

Процедура СубконтоАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка, Организация, ТекущееЗначение, ТекущийСчет = Неопределено, ПрефиксСубконтоДанных = Неопределено) Экспорт
	
	ПараметрыВыбора = Новый Структура;
	ДанныеВыбора = ПолучитьДанныеВыбора(ТипЗнч(ТекущееЗначение), ПараметрыВыбора);	

КонецПроцедуры

// ПРОЦЕДУРЫ, ВЫЗЫВАЕМЫЕ ИЗ ПОДКЛЮЧАЕМЫХ ОБРАБОТЧИКОВ ДЛЯ РЕКВИЗИТОВ ОПЕРАЦИИ

Процедура ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма) Экспорт
	
КонецПроцедуры

Процедура ДопРеквизитИзменение(Элемент, Форма, Объект = Неопределено, ПутьКДанным = "") Экспорт
	
	Если Не ПустаяСтрока(ПутьКДанным) Тогда
		ИмяРеквизитаФормы = ПутьКДанным;
	Иначе
		ОписаниеРеквизита = БухгалтерскиеОперацииКлиентСервер.СтрокаРеквизитаПоИмениЭлемента(Форма, Элемент.Имя);
		Если ОписаниеРеквизита = Неопределено Тогда
			ИмяРеквизитаФормы = "";
		Иначе
			ИмяРеквизитаФормы = ОписаниеРеквизита.ИмяРеквизита;
		КонецЕсли;
	КонецЕсли;
	Если ПустаяСтрока(ИмяРеквизитаФормы) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяРеквизитаФормы = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФлажокИсправлениеОшибокПрошлыхЛет() Тогда
		БухгалтерскиеОперацииКлиентСервер.УстановитьЗначениеПоУмолчаниюИсправленияОшибок(Форма);
		БухгалтерскиеОперацииКлиентСервер.ОбновитьВидимостьОбязательныхЭлементов(Форма);
	ИначеЕсли ИмяРеквизитаФормы = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаПереключательВыявительОшибкиПрошлыхЛет() Тогда
		БухгалтерскиеОперацииКлиентСервер.ОбновитьВидимостьОбязательныхЭлементов(Форма);
	Иначе
		БухгалтерскиеОперацииКлиентСервер.УстановитьСвойстваЗависимыхЭлементов(Форма, Объект, ИмяРеквизитаФормы);
	КонецЕсли;

	БухгалтерскиеОперацииКлиентСервер.УстановитьВидимостьЭлементов(Форма);
	
КонецПроцедуры

Процедура ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, Форма) Экспорт



КонецПроцедуры

Функция ЗапроситьРазрешениеРедактированияРеквизитовТиповыхОпераций(МассивРазрешенныхРеквизитов = Неопределено) Экспорт

	МассивРазрешенныхРеквизитов = Новый Массив;
	МассивРазрешенныхРеквизитов.Добавить("ИмяДляФормулы");		
	МассивРазрешенныхРеквизитов.Добавить("РеквизитПроводки");
	
	Возврат Истина;

КонецФункции // ЗапроситьРазрешениеРедактированияРеквизитовТиповыхОпераций()

Процедура КомандаУправлениеТиповымиОперациями(Форма, Команда) Экспорт

	Если Команда.Имя = "ТиповыеОперации_УправлениеТиповымиОперациями_УстановитьОперациюПоУмолчаниюВсем"
		ИЛИ Команда.Имя = "ТиповыеОперации_УправлениеТиповымиОперациями_УстановитьОперациюПоУмолчанию" Тогда
		
		УстанавливатьВсем = Команда.Имя = "ТиповыеОперации_УправлениеТиповымиОперациями_УстановитьОперациюПоУмолчаниюВсем";
		УстановитьТиповуюОперациюПоУмолчаниюИзФормы(Форма, УстанавливатьВсем);
		
	ИначеЕсли Команда.Имя = "ТиповыеОперации_УправлениеТиповымиОперациями_УстановитьРеквизитыПоУмолчанию" Тогда
		
		УстановитьРеквизитыОперацииПоУмолчаниюИзФормы(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыВыбораЗначенийЗаданногоТипа(ТипЗначения) Экспорт

	Если ЭтоПримитивныйТип(ТипЗначения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Если ТипЗначения = Тип("СправочникСсылка.БанковскиеКарты") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.БанковскиеКарты.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.БСО") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.БСО.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ВидыДенежныхДокументов") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ВидыДенежныхДокументов.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ВидыЗатрат") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ВидыЗатрат.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ВидыНалоговИПлатежей") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ВидыНалоговИПлатежей.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ВидыПервичныхДокументов") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ВидыПервичныхДокументов.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ВидыЦелевыхСредств") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ВидыЦелевыхСредств.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ДенежныеДокументы") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ДенежныеДокументы.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Договоры") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.Договоры.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ДополнительнаяБюджетнаяКлассификация") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ДополнительнаяБюджетнаяКлассификация.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ДрагМеталлы") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ДрагМеталлы.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ИсточникиСредств") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ИсточникиСредств.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ИсточникиФинансовогоОбеспечения.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.КлассификационныеПризнакиСчетов") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.КлассификационныеПризнакиСчетов.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Контрагенты") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.Контрагенты.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.КОСГУ") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.КОСГУ.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ЛицевыеСчета") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ЛицевыеСчета.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Мероприятия") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.Мероприятия.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.МестаХранения") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.МестаХранения.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.НалогиИПлатежиОрганизации") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.НалогиИПлатежиОрганизации.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.НаправленияДеятельности") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.НаправленияДеятельности.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Номенклатура") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.Номенклатура.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.НомераГТД") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.НомераГТД.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ОсновныеСредства.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Подразделения") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.Подразделения.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ПрочиеДоходыИРасходы") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ПрочиеДоходыИРасходы.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.РазделыЛицевыхСчетов") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.РазделыЛицевыхСчетов.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.РасходыБудущихПериодов") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.РасходыБудущихПериодов.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.РеквизитыЛицевыхСчетов") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.РеквизитыЛицевыхСчетов.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.СерииБСО") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.СерииБСО.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Студенты") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.Студенты.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Субконто") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.Субконто.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Субсидии") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.Субсидии.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ФизическиеЛица.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ЦМО") Тогда
		Результат.Вставить("ФормаВыбора", "Справочник.ЦМО.ФормаВыбора");
		
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.АвансовыйОтчет.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.АктОбОказанииУслуг") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.АктОбОказанииУслуг.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ВводНачальныхОстатков") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ВводНачальныхОстатков.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ЗаявкаНаКассовыйРасход") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ЗаявкаНаКассовыйРасход.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ЗаявкаНаКассовыйРасходСокращенная") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ЗаявкаНаКассовыйРасходСокращенная.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ЗаявкаНаНаличные") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ЗаявкаНаНаличные.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ИзвещениеИсходящее") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ИзвещениеИсходящее.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.КассовоеВыбытие") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.КассовоеВыбытие.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.КассовоеПоступление") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.КассовоеПоступление.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.НакладнаяНаОтпускМ15") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.НакладнаяНаОтпускМ15.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.НакладнаяНаРеализациюТорг12.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ОперацияБух") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ОперацияБух.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПередачаГруппОбъектовОС") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ПередачаГруппОбъектовОС.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПередачаЗдания") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ПередачаЗдания.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПередачаОбъектаОС") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ПередачаОбъектаОС.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ПлатежноеПоручение.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПоступлениеМЗ") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ПоступлениеМЗ.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПоступлениеМЗВПути") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ПоступлениеМЗВПути.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПоступлениеОС") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ПоступлениеОС.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПоступлениеОСВПути") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ПоступлениеОСВПути.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПоступлениеУслугРабот") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ПоступлениеУслугРабот.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ПриходныйКассовыйОрдер.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПриходныйОрдерФондовый") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.ПриходныйОрдерФондовый.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.РасходныйКассовыйОрдер.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.СчетФактураВыданный.ФормаВыбора");
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		Результат.Вставить("ФормаВыбора", "Документ.СчетФактураПолученный.ФормаВыбора");
		
	ИначеЕсли ТипЗначения = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
		Результат.Вставить("ФормаВыбора", "ПланСчетов.ЕПСБУ.ФормаВыбора");
	//ИначеЕсли ТипЗначения = Тип("ДокументСсылка.") Тогда
	//	Результат.Вставить("ФормаВыбора", "Документ..ФормаВыбора");
	//ИначеЕсли ТипЗначения = Тип("ДокументСсылка.") Тогда
	//	Результат.Вставить("ФормаВыбора", "Документ..ФормаВыбора");
	//ИначеЕсли ТипЗначения = Тип("СправочникСсылка.") Тогда
	//	Результат.Вставить("ФормаВыбора", "Справочник..ФормаВыбора");
	//ИначеЕсли ТипЗначения = Тип("СправочникСсылка.") Тогда
	//	Результат.Вставить("ФормаВыбора", "Справочник..ФормаВыбора");
	//ИначеЕсли ТипЗначения = Тип("СправочникСсылка.") Тогда
	//	Результат.Вставить("ФормаВыбора", "Справочник..ФормаВыбора");
		
		
		
		
		
	//ИначеЕсли ТипЗначения = Тип("СправочникСсылка.КлассификационныеПризнакиСчетов") Тогда
	//	Возврат Новый Структура("ФормаВыбора", "Справочник.КлассификационныеПризнакиСчетов.ФормаВыбора");
	//ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ЦМО") Тогда
	//	Возврат Новый Структура("ФормаВыбора", "Справочник.ЦМО.ФормаВыбора");
	КонецЕсли;
//	ИмяТипаСтрокой = Строка();

	Параметры = ТребуемыеПараметрыПриВыбореЗначенийЗаданногоТипа(ТипЗначения);
	Если Параметры <> Неопределено Тогда
		Результат.Вставить("Параметры", Параметры);
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ТребуемыеПараметрыПриВыбореЗначенийЗаданногоТипа(ТипЗначения) Экспорт

	Если ЭтоПримитивныйТип(ТипЗначения) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗначения = Тип("СправочникСсылка.БанковскиеКарты") Тогда
		Возврат Новый Структура("Владелец", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ДенежныеДокументы") Тогда
		Возврат Новый Структура("Владелец", Тип("СправочникСсылка.ВидыДенежныхДокументов"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Договоры") Тогда
		Возврат Новый Структура("Организация, Контрагент", Тип("СправочникСсылка.Организации"), Тип("СправочникСсылка.Контрагенты"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ЛицевыеСчета") Тогда
		Возврат Новый Структура("Владелец", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.МестаХранения") Тогда
		Возврат Новый Структура("Владелец", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.НалогиИПлатежиОрганизации") Тогда
		Возврат Новый Структура("Владелец", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Подразделения") Тогда
		Возврат Новый Структура("Владелец", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.РазделыЛицевыхСчетов") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.РеквизитыЛицевыхСчетов") Тогда
		Возврат Новый Структура("Владелец", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.СерииБСО") Тогда
		Возврат Новый Структура("Владелец", Тип("СправочникСсылка.БСО"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Студенты") Тогда
		Возврат Новый Структура("Организация, Контрагент", Тип("СправочникСсылка.Организации"), Тип("СправочникСсылка.Контрагенты"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.Субконто") Тогда
		Возврат Новый Структура("Владелец", Тип("ПланВидовХарактеристикСсылка.ВидыСубконто"));
	ИначеЕсли ТипЗначения = Тип("СправочникСсылка.ЦМО") Тогда
		Возврат Новый Структура("Владелец", Тип("СправочникСсылка.Организации"));
		
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.АктОбОказанииУслуг") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ВводНачальныхОстатков") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ЗаявкаНаКассовыйРасход") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ЗаявкаНаКассовыйРасходСокращенная") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ЗаявкаНаНаличные") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ИзвещениеИсходящее") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.КассовоеВыбытие") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.КассовоеПоступление") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.НакладнаяНаОтпускМ15") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ОперацияБух") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПередачаГруппОбъектовОС") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПередачаЗдания") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПередачаОбъектаОС") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПоступлениеМЗ") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПоступлениеМЗВПути") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПоступлениеОС") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПоступлениеОСВПути") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПоступлениеУслугРабот") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.ПриходныйОрдерФондовый") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
	ИначеЕсли ТипЗначения = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		Возврат Новый Структура("Организация", Тип("СправочникСсылка.Организации"));
		
		
		
	КонецЕсли;
	

КонецФункции // ТребуемыеПараметрыПриВыбореЗначенийЗаданногоТипа()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьТиповуюОперациюПоУмолчаниюИзФормы(Форма, УстанавливатьВсем)
	
	РеквизитТиповаяОперация = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитыФормыТиповаяОперацияФактическое(Форма);
	ТиповаяОперация = Форма[РеквизитТиповаяОперация];
	
	Если Не ЗначениеЗаполнено(ТиповаяОперация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана типовая операция'"),, РеквизитТиповаяОперация);
		Возврат;
	КонецЕсли;
	
	БухгалтерскиеОперацииВызовСервера.УстановитьОперациюПоУмолчанию(ТиповаяОперация, УстанавливатьВсем);
	
	Если УстанавливатьВсем Тогда
		ПредставлениеПользователей = НСтр("ru = 'все пользователи'");
	Иначе
		ПредставлениеПользователей = НСтр("ru = 'текущий пользователь'");
	КонецЕсли;
	ТекстОповещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Установлена типовая операция по умолчанию (%1)'"),
		ПредставлениеПользователей);
	ПоказатьОповещениеПользователя(НСтр("ru = 'Типовые операции'"),
		ПолучитьНавигационнуюСсылку(ТиповаяОперация),
		ТекстОповещения,
		БиблиотекаКартинок.Информация32);
	ОповеститьОбИзменении(ТиповаяОперация);
	
КонецПроцедуры

Процедура УстановитьРеквизитыОперацииПоУмолчаниюИзФормы(Форма)

	РеквизитТиповаяОперация = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитыФормыТиповаяОперацияФактическое(Форма);
	ТиповаяОперация = Форма[РеквизитТиповаяОперация];
	
	Если Не ЗначениеЗаполнено(ТиповаяОперация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана типовая операция'"),, РеквизитТиповаяОперация);
		Возврат;
	КонецЕсли;
	
	ЗначенияДополнительныхРеквизитов = ДополнительныеРеквизитыИзФормы(Форма);
	Организация 	= Форма.Объект.Организация;
	
	Параметры = Новый Структура("ТиповаяОперация, ЗначенияДополнительныхРеквизитов, Пользователь,"
		+ "Организация, ДляТекущегоПользователя");
	Параметры.ТиповаяОперация                  = ТиповаяОперация;
	Параметры.ЗначенияДополнительныхРеквизитов = ЗначенияДополнительныхРеквизитов;
	Параметры.Организация                      = Организация;
	Параметры.ДляТекущегоПользователя          = Истина;
	Параметры.Пользователь                     = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	
	БухгалтерскиеОперацииВызовСервера.УстановитьРеквизитыОперацииПоУмолчаниюИзФормы(Параметры);
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Типовые операции'"),
		ПолучитьНавигационнуюСсылку(ТиповаяОперация),
		НСтр("ru = 'Установлены реквизиты по умолчанию для типовой операции (текущий пользователь)'"),
		БиблиотекаКартинок.Информация32);
	ОповеститьОбИзменении(ТиповаяОперация);

КонецПроцедуры

Функция ДополнительныеРеквизитыИзФормы(Форма)

	ЗначенияДопРеквизитов = Новый Структура;
	Для Каждого ТекДопРеквизит Из Форма["БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"] Цикл
		Если НЕ ТекДопРеквизит.ЭтоГруппа И НЕ ЗначениеЗаполнено(ТекДопРеквизит.ИмяТаблицы)
			И ЗначениеЗаполнено(ТекДопРеквизит.ИмяДляФормулы)
			И ЗначениеЗаполнено(ТекДопРеквизит.ИмяРеквизита) Тогда
			
			ЗначенияДопРеквизитов.Вставить(ТекДопРеквизит.ИмяДляФормулы, Форма[ТекДопРеквизит.ИмяРеквизита]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначенияДопРеквизитов;

КонецФункции

Функция ЭтоПримитивныйТип(ТипЗначения)

	Возврат	ТипЗначения = Тип("Строка")
			ИЛИ ТипЗначения = Тип("Дата")
			ИЛИ ТипЗначения = Тип("Булево")
			ИЛИ ТипЗначения = Тип("Число");

КонецФункции // ЭтоПримитивныйТип()

#КонецОбласти
