
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаРабот = Параметры.ДатаРабот;
	ИдентификаторФормулыРасчета = Параметры.ИдентификаторФормулыРасчета;
	КоличествоОбработанныхМЦ = Параметры.КоличествоОбработанныхМЦ;
	ПоказанияСчетчикаНаНачало = Параметры.ПоказанияСчетчикаНаНачало;
	ПоказанияСчетчикаНаКонец = Параметры.ПоказанияСчетчикаНаКонец;
	ПоказанияСчетчика = Параметры.ПоказанияСчетчика;
	ПродолжительностьРаботы = Параметры.ПродолжительностьРаботы;
	ПродолжительностьРаботыСтр = Параметры.ПродолжительностьРаботыСтр;
	ЕдиницаИзмеренияРаботы = Параметры.ЕдиницаИзмеренияРаботы;
	
	ИдентификаторФормулыРасчетаПриОткрытии = ИдентификаторФормулыРасчета;
	
	Если ИдентификаторФормулыРасчета = 0 Тогда
		ИдентификаторФормулыРасчета = 1;
	КонецЕсли;	
		
	УстановитьВидимостьЭлементов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидПоказателяРасчета = Элементы.ВидПоказателяРасчета.СписокВыбора[ИдентификаторФормулыРасчета-1].Значение;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность И НЕ ПеренестиВДокумент Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
			НСтр("ru = 'Данные были изменены. Сохранить изменения?'"),
			РежимДиалогаВопрос.ДаНетОтмена, ,КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗавершитьРедактирование();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ФормаВводаПоказателейРасчетаДляАгрегата_Закрыть" И Источник = ВладелецФормы Тогда
		// Сообщение от основной формы документа при нажатии там Esc.
		// Сбрасываем флаг модифицированности и закрываем форму редактирования строки без вопросов.
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если ПеренестиВДокумент Тогда
		Результат = Новый Структура("ИдентификаторФормулыРасчета, ПродолжительностьРаботы, ПродолжительностьРаботыСтр, КоличествоОбработанныхМЦ,
			|ПоказанияСчетчикаНаНачало, ПоказанияСчетчикаНаКонец, ПоказанияСчетчика, ЕдиницаИзмеренияРаботы");
		ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
			
		ОповеститьОВыборе(Результат);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидПоказателяРасчетаПриИзменении(Элемент)
	Если ВидПоказателяРасчета = Элементы.ВидПоказателяРасчета.СписокВыбора[0].Значение Тогда
		ИдентификаторФормулыРасчета = 1;
	ИначеЕсли ВидПоказателяРасчета = Элементы.ВидПоказателяРасчета.СписокВыбора[1].Значение Тогда
		ИдентификаторФормулыРасчета = 2;
	ИначеЕсли ВидПоказателяРасчета = Элементы.ВидПоказателяРасчета.СписокВыбора[2].Значение Тогда
		ИдентификаторФормулыРасчета = 3;
	КонецЕсли;
	
	УстановитьВидимостьЭлементов(ЭтаФорма);
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияСчетчикаНаНачалоПриИзменении(Элемент)
	ПерерасчетПоказанийСчетчика();
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияСчетчикаНаКонецПриИзменении(Элемент)
	ПерерасчетПоказанийСчетчика();
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияСчетчикаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПродолжительностьРаботыСтрПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоОбработанныхМЦПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияРаботыПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ПеренестиВДокумент = Истина;
	ЗавершитьРедактирование();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Идентификатор = Форма.ИдентификаторФормулыРасчета;	
	
	Если Идентификатор = 1 Тогда
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаПродолжительностьРаботы", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаКоличествоМЦ", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаПоСчетчику", "Видимость", Ложь);
	ИначеЕсли Идентификатор = 2 Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаПродолжительностьРаботы", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаКоличествоМЦ", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаПоСчетчику", "Видимость", Ложь);
	ИначеЕсли Идентификатор = 3 Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаПродолжительностьРаботы", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаКоличествоМЦ", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаПоСчетчику", "Видимость", Истина);
	КонецЕсли;	
		
КонецПроцедуры	

&НаКлиенте
Процедура ПерерасчетПоказанийСчетчика()
	Если ПоказанияСчетчикаНаКонец > 0 Тогда
		ПоказанияСчетчика = ПоказанияСчетчикаНаКонец - ПоказанияСчетчикаНаНачало;
	КонецЕсли;	
	
	Модифицированность = Истина;
КонецПроцедуры	

&НаКлиенте
Процедура ЗавершитьРедактирование()
	
	Если Модифицированность = Истина Тогда
		
		Модифицированность = Ложь;
	
		ПродолжительностьРаботы = УчетВремениКлиентСервер.ЧислоИзСтроки(ПродолжительностьРаботыСтр);
		
		Результат = Новый Структура("ИдентификаторФормулыРасчета, ПродолжительностьРаботы, ПродолжительностьРаботыСтр, КоличествоОбработанныхМЦ,
			|ПоказанияСчетчикаНаНачало, ПоказанияСчетчикаНаКонец, ПоказанияСчетчика, ЕдиницаИзмеренияРаботы");
		ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма);
		ПеренестиВДокумент = Истина;		
		Закрыть(Результат);
	Иначе
		ПеренестиВДокумент = Ложь;		
		Закрыть();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
