////////////////////////////////////////////////////////////////////////////////
// ЗАГРУЗКА БЮДЖЕТНЫХ КЛАССИФИКАТОРОВ
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция СобытиеЖурналаРегистрации() Экспорт
	Возврат НСтр("ru = 'Бюджетная классификация.Загрузка бюджетных классификаторов'");
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПОДГОТОВКА ДАННЫХ ДЛЯ ЗАГРУЗКИ
//

// Создает временную таблицу данных бюджетного классификатора. Для простых
// классификаторов - собственно выборку из таблицы справочника,
// для сложных (КД, КИФ, ЦС) - выборку из нескольких таблиц.
// Поля выборки
//			Ссылка
//			Код
//			Наименование
//			НомерСтроки
//			Бюджет
//			ДатаНачалаДействия
//			ДатаОкончанияДействия
//			ЕстьПериод
//
// Параметры:
//
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - в который будет помещена
//                  таблица ДанныеИБ.
//
//  URIТипаСвязи - Строка - URI типа связи, используемый при загрузке или выгрузке
//                  файлов в формате 1С. Идентифицирует нужный классификатор.
//
Процедура СформироватьВременнуюТаблицуДанныхИБ(Знач МенеджерВременныхТаблиц, Знач URIТипаСвязи, ЭтоТест = Ложь) Экспорт
	
	СвойстваКлассификатора = ЗагрузкаБюджетныхКлассификаторовПовтИсп.ПолучитьСвойстваКлассификатора(URIТипаСвязи);
	
	Если СвойстваКлассификатора.ОбработчикПолученияДанных = Неопределено Тогда
		ПолучитьВременнуюТаблицуДанныхИБСтандартно(МенеджерВременныхТаблиц, СвойстваКлассификатора);
	Иначе
		СвойстваКлассификатора.ОбработчикПолученияДанных.ПолучитьВременнуюТаблицуДанныхИБ(МенеджерВременныхТаблиц);
	КонецЕсли;
	
КонецПроцедуры

// Создает временные таблицы: ДанныеДляОбновления, ДанныеКонфликтные,
// ДанныеДляСоздания и ДанныеДляДеактулизации, используя содержащиеся
// в передаваемом менеджере временных таблиц таблицы ДанныеФайла и ДанныеИБ
// (уничтожаются).
// Таблицу ДанныеИБ можно создать функцией
// СформироватьВременнуюТаблицуДанныхИБ().
// Таблица ДанныеФайла должна содержать поля: Код, КодРодителя,
// ДатаНачалаДействия, ДатаОкончанияДействия, Наименование, Бюджет (ссылка),
// Уровень. Если какие-то поля в классификаторе не используются, эти поля
// должны содержать пустые значения.
//
// Параметры:
//
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц. Менеджер, в котором уже
//  созданы таблицы ДанныеФайла и ДанныеИБ.
//
Процедура СформироватьВременныеТаблицыОбработкиЭлементов(Знач МенеджерВременныхТаблиц, ЭтоТест = Ложь) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ДанныеИБ.Ссылка,
		|	ДанныеИБ1.Ссылка КАК РодительСсылка,
		|	ДанныеИБ.НомерСтроки,
		|	ДанныеФайла.Код КАК Код,
		|	ДанныеФайла.КодРодителя КАК КодРодителя,
		|	ПОДСТРОКА(ДанныеФайла.Наименование, 1, 1000) КАК Наименование1,
		|	ПОДСТРОКА(ДанныеФайла.Наименование, 1001, 1000) КАК Наименование2,
		|	ПОДСТРОКА(ДанныеФайла.Наименование, 2001, 1000) КАК Наименование3,
		|	ДанныеФайла.ДатаНачалаДействия,
		|	ДанныеФайла.ДатаОкончанияДействия,
		|	ДанныеФайла.Бюджет,
		|	ДанныеФайла.Уровень,
		|	1
		|ПОМЕСТИТЬ ДанныеДляОбновленияПредв
		|ИЗ
		|	ДанныеИБ КАК ДанныеИБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеФайла КАК ДанныеФайла
		|			ЛЕВОЕ СОЕДИНЕНИЕ ДанныеИБ КАК ДанныеИБ1
		|			ПО ДанныеФайла.КодРодителя = ДанныеИБ1.Код
		|				И (ДанныеИБ1.ДатаНачалаДействия = ДанныеФайла.ДатаНачалаДействия)
		|				И (ДанныеИБ1.ДатаОкончанияДействия = ДанныеФайла.ДатаОкончанияДействия
		|					ИЛИ ДанныеИБ1.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ ДанныеФайла.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
		|				И (ДанныеИБ1.Бюджет = ДанныеФайла.Бюджет)
		|		ПО ДанныеИБ.Код = ДанныеФайла.Код
		|			И ДанныеИБ.ДатаНачалаДействия = ДанныеФайла.ДатаНачалаДействия
		|			И (ДанныеИБ.ДатаОкончанияДействия = ДанныеФайла.ДатаОкончанияДействия
		|				ИЛИ ДанныеИБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ДанныеФайла.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
		|			И ДанныеИБ.Бюджет = ДанныеФайла.Бюджет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеИБ.Ссылка,
		|	ДанныеИБ1.Ссылка,
		|	ДанныеИБ.НомерСтроки,
		|	ДанныеФайла.Код,
		|	ДанныеФайла.КодРодителя,
		|	ПОДСТРОКА(ДанныеФайла.Наименование, 1, 1000) КАК Наименование1,
		|	ПОДСТРОКА(ДанныеФайла.Наименование, 1001, 1000) КАК Наименование2,
		|	ПОДСТРОКА(ДанныеФайла.Наименование, 2001, 1000) КАК Наименование3,
		|	ДанныеФайла.ДатаНачалаДействия,
		|	ДанныеФайла.ДатаОкончанияДействия,
		|	ДанныеФайла.Бюджет,
		|	ДанныеФайла.Уровень,
		|	КОЛИЧЕСТВО(ДанныеФайла.Код)
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеИБ.Ссылка КАК Ссылка,
		|		ДанныеИБ.НомерСтроки КАК НомерСтроки,
		|		ДанныеИБ.Код КАК Код,
		|		ДанныеИБ.Бюджет КАК Бюджет,
		|		ДанныеИБ.ДатаНачалаДействия КАК ДатаНачалаДействия
		|	ИЗ
		|		ДанныеИБ КАК ДанныеИБ
		|			ЛЕВОЕ СОЕДИНЕНИЕ ДанныеИБ КАК ДанныеИБ1
		|			ПО ДанныеИБ.Код = ДанныеИБ1.Код
		|				И ДанныеИБ.Бюджет = ДанныеИБ1.Бюджет
		|				И (ДанныеИБ.Ссылка <> ДанныеИБ.Ссылка)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДанныеИБ.Бюджет,
		|		ДанныеИБ.Ссылка,
		|		ДанныеИБ.Код,
		|		ДанныеИБ.НомерСтроки,
		|		ДанныеИБ.ДатаНачалаДействия
		|	
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(ДанныеИБ1.Ссылка) = 1) КАК ДанныеИБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеФайла КАК ДанныеФайла
		|			ЛЕВОЕ СОЕДИНЕНИЕ ДанныеИБ КАК ДанныеИБ1
		|			ПО ДанныеФайла.КодРодителя = ДанныеИБ1.Код
		|				И (ДанныеИБ1.ДатаНачалаДействия = ДанныеФайла.ДатаНачалаДействия)
		|				И (ДанныеИБ1.ДатаОкончанияДействия = ДанныеФайла.ДатаОкончанияДействия
		|					ИЛИ ДанныеИБ1.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ ДанныеФайла.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
		|				И (ДанныеИБ1.Бюджет = ДанныеФайла.Бюджет)
		|		ПО ДанныеИБ.Код = ДанныеФайла.Код
		|			И ДанныеИБ.Бюджет = ДанныеФайла.Бюджет
		|			И ДанныеИБ.ДатаНачалаДействия <> ДанныеФайла.ДатаНачалаДействия
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеИБ.Ссылка,
		|	ДанныеИБ1.Ссылка,
		|	ДанныеИБ.НомерСтроки,
		|	ДанныеФайла.Код,
		|	ДанныеФайла.КодРодителя,
		|	ПОДСТРОКА(ДанныеФайла.Наименование, 1, 1000),
		|	ПОДСТРОКА(ДанныеФайла.Наименование, 1001, 1000),
		|	ПОДСТРОКА(ДанныеФайла.Наименование, 2001, 1000),
		|	ДанныеФайла.ДатаНачалаДействия,
		|	ДанныеФайла.ДатаОкончанияДействия,
		|	ДанныеФайла.Бюджет,
		|	ДанныеФайла.Уровень
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ДанныеФайла.Код) = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДляОбновленияПредв.Ссылка,	
		|	ДанныеДляОбновленияПредв.РодительСсылка,	
		|	ДанныеДляОбновленияПредв.НомерСтроки,	
		|	ДанныеДляОбновленияПредв.Код,	
		|	ДанныеДляОбновленияПредв.КодРодителя,	
		|	ДанныеДляОбновленияПредв.Наименование1, 
		|	ДанныеДляОбновленияПредв.Наименование2,
		|	ДанныеДляОбновленияПредв.Наименование3,	
		|	ДанныеДляОбновленияПредв.ДатаНачалаДействия,	
		|	ДанныеДляОбновленияПредв.ДатаОкончанияДействия,	
		|	ДанныеДляОбновленияПредв.Бюджет,	
		|	ДанныеДляОбновленияПредв.Уровень
		|ПОМЕСТИТЬ ДанныеДляОбновления
		|ИЗ
		|   ДанныеДляОбновленияПредв КАК ДанныеДляОбновленияПредв
		|ГДЕ
		|   (ДанныеДляОбновленияПредв.Ссылка <> ДанныеДляОбновленияПредв.РодительСсылка ИЛИ НЕ ДанныеДляОбновленияПредв.НомерСтроки Есть NULL)  
		|   ИЛИ ДанныеДляОбновленияПредв.РодительСсылка ЕСТЬ NULL
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДанныеДляОбновленияПредв
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеФайла.Код КАК Код,
		|	ДанныеФайла.КодРодителя КАК КодРодителя,
		|	ДанныеФайла.ДатаНачалаДействия,
		|	ДанныеФайла.ДатаОкончанияДействия,
		|	ДанныеФайла.Наименование,
		|	ДанныеФайла.Бюджет,
		|	ДанныеФайла.Уровень
		|ПОМЕСТИТЬ ДанныеФайлаНесоединенные
		|ИЗ
		|	ДанныеФайла КАК ДанныеФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДляОбновления КАК ДанныеДляОбновления
		|		ПО ДанныеФайла.Код = ДанныеДляОбновления.Код
		|           И ДанныеФайла.КодРодителя = ДанныеДляОбновления.КодРодителя
		|			И ДанныеФайла.ДатаНачалаДействия = ДанныеДляОбновления.ДатаНачалаДействия
		|			И ДанныеФайла.ДатаОкончанияДействия = ДанныеДляОбновления.ДатаОкончанияДействия
		|			И ДанныеФайла.Бюджет = ДанныеДляОбновления.Бюджет
		|ГДЕ
		|	ДанныеДляОбновления.Код ЕСТЬ NULL 
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеФайла.Бюджет
		|ПОМЕСТИТЬ ДанныеФайлаБюджеты
		|ИЗ
		|	ДанныеФайла КАК ДанныеФайла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДанныеФайла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИБ.Ссылка,
		|	ДанныеИБ.Код КАК Код,
		|	ДанныеИБ.Наименование,
		|	ДанныеИБ.НомерСтроки,
		|	ДанныеИБ.Бюджет,
		|	ДанныеИБ.ДатаНачалаДействия,
		|	ДанныеИБ.ДатаОкончанияДействия,
		|	ДанныеФайлаНесоединенные.ДатаНачалаДействия КАК ДатаНачалаДействияФайл,
		|	ДанныеФайлаНесоединенные.ДатаОкончанияДействия КАК ДатаОкончанияДействияФайл,
		|	ДанныеФайлаНесоединенные.Уровень КАК Уровень
		|ПОМЕСТИТЬ ДанныеКонфликтные
		|ИЗ
		|	ДанныеИБ КАК ДанныеИБ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеФайлаНесоединенные КАК ДанныеФайлаНесоединенные
		|		ПО ДанныеИБ.Код = ДанныеФайлаНесоединенные.Код
		|			И ДанныеИБ.Бюджет = ДанныеФайлаНесоединенные.Бюджет
		|			И (ДанныеИБ.ДатаНачалаДействия < ВЫБОР
		|				КОГДА ДанныеФайлаНесоединенные.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ДАТАВРЕМЯ(2999, 1, 1)
		|				ИНАЧЕ ДанныеФайлаНесоединенные.ДатаОкончанияДействия
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ДанныеИБ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ДАТАВРЕМЯ(2999, 1, 1)
		|				ИНАЧЕ ДанныеИБ.ДатаОкончанияДействия
		|			КОНЕЦ > ДанныеФайлаНесоединенные.ДатаНачалаДействия)
		|			И НЕ(ДанныеИБ.ДатаНачалаДействия = ДанныеФайлаНесоединенные.ДатаНачалаДействия
		|				И ДанныеИБ.ДатаОкончанияДействия = ДанныеФайлаНесоединенные.ДатаОкончанияДействия)
		|ГДЕ
		|	(НЕ ДанныеИБ.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеДляОбновления.Ссылка
		|				ИЗ
		|					ДанныеДляОбновления))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеФайлаНесоединенные.Код,
		|	ДанныеФайлаНесоединенные.КодРодителя,
		|	ДанныеФайлаНесоединенные.ДатаНачалаДействия,
		|	ДанныеФайлаНесоединенные.ДатаОкончанияДействия,
		|	ДанныеФайлаНесоединенные.Наименование,
		|	ДанныеФайлаНесоединенные.Бюджет,
		|	ДанныеФайлаНесоединенные.Уровень
		|ПОМЕСТИТЬ ДанныеДляСоздания
		|ИЗ
		|	ДанныеФайлаНесоединенные КАК ДанныеФайлаНесоединенные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКонфликтные КАК ДанныеКонфликтные
		|		ПО ДанныеФайлаНесоединенные.Код = ДанныеКонфликтные.Код
		|			И ДанныеФайлаНесоединенные.Бюджет = ДанныеКонфликтные.Бюджет
		|			И ДанныеФайлаНесоединенные.ДатаНачалаДействия = ДанныеКонфликтные.ДатаНачалаДействияФайл
		|			И ДанныеФайлаНесоединенные.ДатаОкончанияДействия = ДанныеКонфликтные.ДатаОкончанияДействияФайл
		|			
		|ГДЕ
		|	ДанныеКонфликтные.Код ЕСТЬ NULL   
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДляСоздания.Код КАК Код,
		|	ДанныеДляСоздания.Бюджет КАК Бюджет,
		|	МИНИМУМ(ДанныеДляСоздания.ДатаНачалаДействия) КАК ДатаНачалаДействия
		|ПОМЕСТИТЬ ДанныеДляСозданияБюджеты
		|ИЗ
		|	ДанныеДляСоздания КАК ДанныеДляСоздания
		|		
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДляСоздания.Код,
		|	ДанныеДляСоздания.Бюджет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеИБ.Ссылка,
		|	ДанныеИБ.Код,
		|	ДанныеИБ.Бюджет,
		|	ДанныеИБ.ДатаНачалаДействия,
		|	ДанныеИБ.ДатаОкончанияДействия
		|ПОМЕСТИТЬ ДанныеДляДеактуализацииПредвИндекс
		|ИЗ
		|	ДанныеИБ КАК ДанныеИБ
		|ГДЕ
		|	ДанныеИБ.ДатаНачалаДействия <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ДанныеИБ.Бюджет В
		|			(ВЫБРАТЬ
		|				ДанныеФайлаБюджеты.Бюджет
		|			ИЗ
		|				ДанныеФайлаБюджеты)
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДляДеактуализацииПредв.Ссылка,
		|	ДанныеДляДеактуализацииПредв.Код,
		|	ДанныеДляДеактуализацииПредв.Бюджет,
		|	ДанныеДляДеактуализацииПредв.ДатаНачалаДействия,
		|	ДанныеДляДеактуализацииПредв.ДатаОкончанияДействия
		|ПОМЕСТИТЬ ДанныеДляДеактуализацииПредвКонечная
		|ИЗ
		|	ДанныеДляДеактуализацииПредвИндекс КАК ДанныеДляДеактуализацииПредв
		|ГДЕ
		|	НЕ ДанныеДляДеактуализацииПредв.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеДляОбновления.Ссылка
		|				ИЗ
		|					ДанныеДляОбновления)
		|	И НЕ ДанныеДляДеактуализацииПредв.Ссылка В
		|				(ВЫБРАТЬ
		|					ДанныеКонфликтные.Ссылка
		|				ИЗ
		|					ДанныеКонфликтные)
		|ИНДЕКСИРОВАТЬ ПО
		|	Код,
		|	Бюджет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеДляДеактуализацииПредвКонечная.Ссылка,
		|	ВЫБОР
		|		КОГДА НЕ ДанныеДляСозданияБюджеты.ДатаНачалаДействия ЕСТЬ NULL 
		|				И ДанныеДляДеактуализацииПредвКонечная.ДатаНачалаДействия < ДанныеДляСозданияБюджеты.ДатаНачалаДействия
		|			ТОГДА ДОБАВИТЬКДАТЕ(ДанныеДляСозданияБюджеты.ДатаНачалаДействия, ДЕНЬ, -1)
		|		ИНАЧЕ ДанныеДляДеактуализацииПредвКонечная.ДатаОкончанияДействия
		|	КОНЕЦ КАК НоваяДатаОкончания,
		|	ВЫБОР
		|		КОГДА ДанныеДляСозданияБюджеты.ДатаНачалаДействия ЕСТЬ NULL 
		|				ИЛИ ДанныеДляДеактуализацииПредвКонечная.ДатаНачалаДействия >= ДанныеДляСозданияБюджеты.ДатаНачалаДействия
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НоваяПометкаУдаления
		|ПОМЕСТИТЬ ДанныеДляДеактуализации
		|ИЗ
		|	ДанныеДляДеактуализацииПредвКонечная КАК ДанныеДляДеактуализацииПредвКонечная 
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДляСозданияБюджеты КАК ДанныеДляСозданияБюджеты
		|		ПО ДанныеДляДеактуализацииПредвКонечная.Код = ДанныеДляСозданияБюджеты.Код
		|			И ДанныеДляДеактуализацииПредвКонечная.Бюджет = ДанныеДляСозданияБюджеты.Бюджет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДанныеФайлаБюджеты
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДанныеДляДеактуализацииПредвИндекс
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДанныеДляДеактуализацииПредвКонечная
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДанныеФайлаНесоединенные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДанныеДляСозданияБюджеты
        |";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СПРАВОЧНИКОВ
//

Функция ДеактуализироватьЭлементы(Знач МенеджерВременныхТаблиц, Знач URIТипаСвязи) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Деактуализировано", 0);
	Результат.Вставить("ПомеченоНаУдаление", 0);
	Результат.Вставить("Статус", Истина);
	Результат.Вставить("Ошибки", Новый Соответствие);
	
	РезультатЗапроса = ПолучитьВременнуюТаблицу(МенеджерВременныхТаблиц, "ДанныеДляДеактуализации");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ЭлементОбъект = НачатьИзменениеЭлемента(Выборка.Ссылка);
			Если Выборка.НоваяПометкаУдаления Тогда
				ЭлементОбъект.ПометкаУдаления   = Выборка.НоваяПометкаУдаления;
				Результат.ПомеченоНаУдаление = Результат.ПомеченоНаУдаление + 1;
			Иначе
				ЭлементОбъект.ОкончаниеДействия = Выборка.НоваяДатаОкончания;
				Результат.Деактуализировано = Результат.Деактуализировано + 1;
			КонецЕсли;
			ЗакончитьИзменениеЭлемента(ЭлементОбъект);
		Исключение
			ВызватьИсключение;
		КонецПопытки
		
	КонецЦикла;
	
КонецФункции

Функция ОбновитьЭлементы(Знач МенеджерВременныхТаблиц, Знач URIТипаСвязи) Экспорт
	
	СвойстваКлассификатора = ЗагрузкаБюджетныхКлассификаторовПовтИсп.ПолучитьСвойстваКлассификатора(URIТипаСвязи);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеДляОбновления.Ссылка КАК Ссылка,
		|	ДанныеДляОбновления.РодительСсылка КАК РодительСсылка,
		|	ДанныеДляОбновления.НомерСтроки КАК НомерСтроки,
		|	ДанныеДляОбновления.Код КАК Код,
		|	ДанныеДляОбновления.КодРодителя КАК КодРодителя,
		|	ДанныеДляОбновления.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ДанныеДляОбновления.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ДанныеДляОбновления.Наименование1 + ДанныеДляОбновления.Наименование2 + ДанныеДляОбновления.Наименование3 КАК Наименование,
		|	ДанныеДляОбновления.Бюджет КАК Бюджет
		|ИЗ
		|	ДанныеДляОбновления КАК ДанныеДляОбновления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код
		|ИТОГИ ПО
		|	Ссылка";
	
	СчетчикЭлементов = 0;
	
	ВыборкаПоСсылке = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСсылке.Следующий() Цикл
		
		ЭлементОбъект = НачатьИзменениеЭлемента(ВыборкаПоСсылке.Ссылка);
		
		Выборка = ВыборкаПоСсылке.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			УстановитьРеквизитыЭлемента(ЭлементОбъект, Выборка, СвойстваКлассификатора.Состав.Найти(ТипЗнч(Выборка.Ссылка), "ТипСсылки").Характеристики);
			
		КонецЦикла;
		
		ЗакончитьИзменениеЭлемента(ЭлементОбъект);
		
		СчетчикЭлементов = СчетчикЭлементов + 1;
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьВременнуюТаблицуДанныхИБСтандартно(МенеджерВременныхТаблиц, СвойстваКлассификатора);
	
	ЧленыОбъединения = Новый Массив;
	
	Для каждого СтрокаСоставаКлассификатора Из СвойстваКлассификатора.Состав Цикл
		
		ОбъектМетаданных = СтрокаСоставаКлассификатора.ОбъектМетаданных;
		
		ИменаТаблиц = Новый Структура;
		ИменаТаблиц.Вставить("Таблица", ОбъектМетаданных.Имя);
		
		Характеристики = СтрокаСоставаКлассификатора.Характеристики;
		Если СвойстваКлассификатора.Состав.Индекс(СтрокаСоставаКлассификатора) > 0 Тогда
			СтрокаСоставаКлассификатораВладелец = СвойстваКлассификатора.Состав[СвойстваКлассификатора.Состав.Индекс(СтрокаСоставаКлассификатора) - 1];
			ХарактеристикиВладельца = СтрокаСоставаКлассификатораВладелец.Характеристики;
			ИменаТаблиц.Вставить("Владелец", СтрокаСоставаКлассификатораВладелец.ОбъектМетаданных.Имя);
		КонецЕсли;
		
		Если Характеристики.ЕстьДопустимыеКОСГУ Тогда
			
			НуженВладелец = Ложь;
			
			СтруктураЗапроса = СоздатьОписаниеЗапросаПоДаннымИБ();
			ВыбранныеПоля = СтруктураЗапроса.ВыбранныеПоля;
			
			ВыбранныеПоля.Ссылка       = "%Таблица%ДопустимыеКОСГУ.Ссылка";
			ВыбранныеПоля.Код          = "%Таблица%ДопустимыеКОСГУ.Ссылка.Наименование + %Таблица%ДопустимыеКОСГУ.КОСГУ.Код";
			ВыбранныеПоля.Наименование = "%Таблица%ДопустимыеКОСГУ.Наименование";
			ВыбранныеПоля.НомерСтроки  = "%Таблица%ДопустимыеКОСГУ.НомерСтроки";
			
			Если Характеристики.ЕстьБюджет Тогда
				ВыбранныеПоля.Бюджет = "%Таблица%ДопустимыеКОСГУ.Ссылка.Бюджет";
			ИначеЕсли ХарактеристикиВладельца <> Неопределено И ХарактеристикиВладельца.ЕстьБюджет Тогда
				ВыбранныеПоля.Бюджет = "%Владелец%.Бюджет";
			Иначе
				ВыбранныеПоля.Бюджет = "НЕОПРЕДЕЛЕНО";
			КонецЕсли;
			
			Если Характеристики.ЕстьПериодДействия Тогда
				ВыбранныеПоля.ДатаНачалаДействия    = "%Таблица%ДопустимыеКОСГУ.Ссылка.ДатаНачалаДействия";
				ВыбранныеПоля.ДатаОкончанияДействия = "%Таблица%ДопустимыеКОСГУ.Ссылка.ОкончаниеДействия";
				ВыбранныеПоля.ЕстьПериод			= "Истина";
			ИначеЕсли ХарактеристикиВладельца <> Неопределено И ХарактеристикиВладельца.ЕстьПериодДействия Тогда
				ВыбранныеПоля.ДатаНачалаДействия    = "%Владелец%.ДатаНачалаДействия";
				ВыбранныеПоля.ДатаОкончанияДействия = "%Владелец%.ОкончаниеДействия";
			Иначе
				ВыбранныеПоля.ДатаНачалаДействия    = "ДАТАВРЕМЯ(1, 1, 1)";
				ВыбранныеПоля.ДатаОкончанияДействия = "ДАТАВРЕМЯ(1, 1, 1)";
			КонецЕсли;
			
			Если НуженВладелец Тогда
				СтруктураЗапроса.ИЗ =
					"	Справочник.%Таблица%.ДопустимыеКОСГУ КАК %Таблица%ДопустимыеКОСГУ
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.%Владелец% КАК %Владелец%
					|		ПО %Таблица%ДопустимыеКОСГУ.Ссылка.Владелец = %Владелец%.Ссылка";
			Иначе
				СтруктураЗапроса.ИЗ = "Справочник.%Таблица%.ДопустимыеКОСГУ КАК %Таблица%ДопустимыеКОСГУ";
			КонецЕсли;
			
			Если НЕ Характеристики.КонтрольУникальности Тогда
				СтруктураЗапроса.ГДЕ =
					"	НЕ %Таблица%ДопустимыеКОСГУ.Ссылка.ПометкаУдаления";
			КонецЕсли;
			
			ЧленыОбъединения.Добавить(Новый Структура("ИменаТаблиц, СтруктураЗапроса", ИменаТаблиц, СтруктураЗапроса));
			
			СтруктураЗапроса = СоздатьОписаниеЗапросаПоДаннымИБ();
			СтруктураЗапроса.ГДЕ =
				?(НЕ Характеристики.КонтрольУникальности, "	НЕ %Таблица%.ПометкаУдаления И", "") + "
				|	НЕ %Таблица%.Ссылка В
				|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|					%Таблица%ДопустимыеКОСГУ.Ссылка КАК Ссылка
				|				ИЗ
				|					Справочник.%Таблица%.ДопустимыеКОСГУ КАК %Таблица%ДопустимыеКОСГУ)";
			ВыбранныеПоля = СтруктураЗапроса.ВыбранныеПоля;
			ВыбранныеПоля.Ссылка       = "%Таблица%.Ссылка";
			ВыбранныеПоля.Код          = "%Таблица%.Наименование + ""000""";
			ВыбранныеПоля.Наименование = "%Таблица%.НаименованиеПолное";
			
			Если Характеристики.ЕстьБюджет Тогда
				ВыбранныеПоля.Бюджет = "%Таблица%.Бюджет";
			ИначеЕсли ХарактеристикиВладельца <> Неопределено И ХарактеристикиВладельца.ЕстьБюджет Тогда
				ВыбранныеПоля.Бюджет = "%Владелец%.Бюджет";
			Иначе
				ВыбранныеПоля.Бюджет = "НЕОПРЕДЕЛЕНО";
			КонецЕсли;
			
			Если Характеристики.ЕстьПериодДействия Тогда
				ВыбранныеПоля.ДатаНачалаДействия    = "%Таблица%.ДатаНачалаДействия";
				ВыбранныеПоля.ДатаОкончанияДействия = "%Таблица%.ОкончаниеДействия";
				ВыбранныеПоля.ЕстьПериод			= "Истина";
			ИначеЕсли ХарактеристикиВладельца <> Неопределено И ХарактеристикиВладельца.ЕстьПериодДействия Тогда
				ВыбранныеПоля.ДатаНачалаДействия    = "%Владелец%.ДатаНачалаДействия";
				ВыбранныеПоля.ДатаОкончанияДействия = "%Владелец%.ОкончаниеДействия";
			Иначе
				ВыбранныеПоля.ДатаНачалаДействия    = "ДАТАВРЕМЯ(1, 1, 1)";
				ВыбранныеПоля.ДатаОкончанияДействия = "ДАТАВРЕМЯ(1, 1, 1)";
			КонецЕсли;
			
			Если НуженВладелец Тогда
				СтруктураЗапроса.ИЗ =
					"	Справочник.%Таблица% КАК %Таблица%
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.%Владелец% КАК %Владелец%
					|		ПО %Таблица%.Владелец = %Владелец%.Ссылка";
			Иначе
				СтруктураЗапроса.ИЗ = "Справочник.%Таблица% КАК %Таблица%";
			КонецЕсли;
			
			ЧленыОбъединения.Добавить(Новый Структура("ИменаТаблиц, СтруктураЗапроса", ИменаТаблиц, СтруктураЗапроса));
			
		Иначе
			
			НуженВладелец = Ложь;
			
			СтруктураЗапроса = СоздатьОписаниеЗапросаПоДаннымИБ();
			ВыбранныеПоля = СтруктураЗапроса.ВыбранныеПоля;
			ВыбранныеПоля.Ссылка       = "%Таблица%.Ссылка";
			
			Если ХарактеристикиВладельца <> Неопределено И ХарактеристикиВладельца.ЕстьДопустимыеКОСГУ Тогда
				ВыбранныеПоля.Код = "%Таблица%.Наименование + %Владелец%ДопустимыеКОСГУ.КОСГУ.Код";
				НуженВладелец = Истина;
			Иначе
				ВыбранныеПоля.Код = ?(СвойстваКлассификатора.ЕстьПолныйКод, "%Таблица%.Наименование", "%Таблица%.Код");
				Если СвойстваКлассификатора.ЕстьКОСГУ Тогда
					ВыбранныеПоля.Код = ВыбранныеПоля.Код + " + ""000""";
				КонецЕсли;
			КонецЕсли;
			
			ВыбранныеПоля.Наименование = "%Таблица%.НаименованиеПолное";
			
			Если Характеристики.ЕстьБюджет Тогда
				ВыбранныеПоля.Бюджет = "%Таблица%.Бюджет";
			ИначеЕсли ХарактеристикиВладельца <> Неопределено И ХарактеристикиВладельца.ЕстьБюджет Тогда
				ВыбранныеПоля.Бюджет = ?(ХарактеристикиВладельца.ЕстьДопустимыеКОСГУ, "%Владелец%ДопустимыеКОСГУ.Ссылка.Бюджет", "%Владелец%.Бюджет");
				НуженВладелец = Истина;
			Иначе
				ВыбранныеПоля.Бюджет = "НЕОПРЕДЕЛЕНО";
			КонецЕсли;
			
			Если Характеристики.ЕстьПериодДействия Тогда
				ВыбранныеПоля.ДатаНачалаДействия    = "%Таблица%.ДатаНачалаДействия";
				ВыбранныеПоля.ДатаОкончанияДействия = "%Таблица%.ОкончаниеДействия";
				ВыбранныеПоля.ЕстьПериод			= "Истина";
			ИначеЕсли ХарактеристикиВладельца <> Неопределено И ХарактеристикиВладельца.ЕстьПериодДействия Тогда
				Если ХарактеристикиВладельца.ЕстьДопустимыеКОСГУ Тогда
					ВыбранныеПоля.ДатаНачалаДействия    = "%Владелец%ДопустимыеКОСГУ.Ссылка.ДатаНачалаДействия";
					ВыбранныеПоля.ДатаОкончанияДействия = "%Владелец%ДопустимыеКОСГУ.Ссылка.ОкончаниеДействия";
				Иначе
					ВыбранныеПоля.ДатаНачалаДействия    = "%Владелец%.ДатаНачалаДействия";
					ВыбранныеПоля.ДатаОкончанияДействия = "%Владелец%.ОкончаниеДействия";
				КонецЕсли;
				НуженВладелец = Истина;
			Иначе
				ВыбранныеПоля.ДатаНачалаДействия    = "ДАТАВРЕМЯ(1, 1, 1)";
				ВыбранныеПоля.ДатаОкончанияДействия = "ДАТАВРЕМЯ(1, 1, 1)";
			КонецЕсли;
			
			Если НЕ НуженВладелец Тогда
				СтруктураЗапроса.ИЗ = "Справочник.%Таблица% КАК %Таблица%";
				Если НЕ Характеристики.КонтрольУникальности Тогда
					СтруктураЗапроса.ГДЕ =
						"	%Таблица%.ПометкаУдаления = ЛОЖЬ";
				КонецЕсли;
			ИначеЕсли ХарактеристикиВладельца <> Неопределено И ХарактеристикиВладельца.ЕстьДопустимыеКОСГУ Тогда
				СтруктураЗапроса.ИЗ =
					"	Справочник.%Таблица% КАК %Таблица%
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.%Владелец%.ДопустимыеКОСГУ КАК %Владелец%ДопустимыеКОСГУ
					|		ПО %Таблица%.Владелец = %Владелец%ДопустимыеКОСГУ.Ссылка";
				СтруктураЗапроса.ГДЕ =
					?(НЕ Характеристики.КонтрольУникальности, "	%Таблица%.ПометкаУдаления = ЛОЖЬ И ", "") + "%Владелец%ДопустимыеКОСГУ.Ссылка.ПометкаУдаления = ЛОЖЬ";
			Иначе
				СтруктураЗапроса.ИЗ =
					"	Справочник.%Таблица% КАК %Таблица%
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.%Владелец% КАК %Владелец%
					|		ПО %Таблица%.Владелец = %Владелец%.Ссылка";
				СтруктураЗапроса.ГДЕ =
					?(НЕ Характеристики.КонтрольУникальности, "	%Таблица%.ПометкаУдаления = ЛОЖЬ И ", "") + "%Владелец%.ПометкаУдаления = ЛОЖЬ";
			КонецЕсли;
			
			ЧленыОбъединения.Добавить(Новый Структура("ИменаТаблиц, СтруктураЗапроса", ИменаТаблиц, СтруктураЗапроса));
			
		КонецЕсли;
		
	КонецЦикла;
	
	РазделительПолейВыборки = "," + Символы.ПС;
	ПолныйТекстЗапроса = "";
	
	Для каждого ЧленОбъединения Из ЧленыОбъединения Цикл
		
		ТекстЗапроса = "ВЫБРАТЬ" + Символы.ПС;
		СписокВыборки = "";
		Для каждого КлючИЗначение Из ЧленОбъединения.СтруктураЗапроса.ВыбранныеПоля Цикл
			СписокВыборки = СписокВыборки + РазделительПолейВыборки + Символы.Таб + ПодставитьЗначенияВСтроку(КлючИЗначение.Значение, ЧленОбъединения.ИменаТаблиц) + " КАК " + КлючИЗначение.Ключ;
		КонецЦикла;
		СписокВыборки = Сред(СписокВыборки, СтрДлина(РазделительПолейВыборки) + 1);
		ТекстЗапроса = ТекстЗапроса + СписокВыборки;
		
		Если ПустаяСтрока(ПолныйТекстЗапроса) Тогда
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ПОМЕСТИТЬ ДанныеИБ";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ИЗ" + Символы.ПС;
		ТекстЗапроса = ТекстЗапроса + ПодставитьЗначенияВСтроку(ЧленОбъединения.СтруктураЗапроса.ИЗ, ЧленОбъединения.ИменаТаблиц);
		
		Если ЗначениеЗаполнено(ЧленОбъединения.СтруктураЗапроса.ГДЕ) Тогда
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ГДЕ" + Символы.ПС;
			ТекстЗапроса = ТекстЗапроса + ПодставитьЗначенияВСтроку(ЧленОбъединения.СтруктураЗапроса.ГДЕ, ЧленОбъединения.ИменаТаблиц);
			
		КонецЕсли;
		
		Если ПустаяСтрока(ПолныйТекстЗапроса) Тогда
			ПолныйТекстЗапроса = ТекстЗапроса;
		Иначе
			ПолныйТекстЗапроса = ПолныйТекстЗапроса +
				"
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|" + ТекстЗапроса;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Код";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолныйТекстЗапроса;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
		
КонецПроцедуры

// Формирует сообщение из строки с параметрами. Как строка, так и значения
// параметров могут быть заданы на нескольких языках.
//
// Параметры:
//  Сообщение - Строка - текст сообщения с включенными в него параметрами
//  в форме %ИмяПараметра%.
//  Параметры - Структура - структура, в которой перечислены значения
//  параметров.
//
Функция ПодставитьЗначенияВСтроку(СтрокаПодстановки, Значения = Неопределено)
	
	Текст = СтрокаПодстановки;
	
	Если Значения = Неопределено Тогда
		Результат = Текст;
	Иначе
		ОстатокТекста   = Текст;
		ПозНачалаЗначения = Найти(ОстатокТекста, "%");
		
		Результат = "";
		Если ПозНачалаЗначения > 0 Тогда
			
			Пока ПозНачалаЗначения > 0 Цикл
				
				Результат = Результат + Лев(ОстатокТекста, ПозНачалаЗначения - 1);
				
				ОстатокТекста  = Сред(ОстатокТекста, ПозНачалаЗначения + 1);
				ПозКонцаЗначения = Найти(ОстатокТекста, "%");
				
				Если ПозКонцаЗначения = 1 Тогда // двойной «%» - не параметр
					Результат = Результат + "%";
				ИначеЕсли ПозКонцаЗначения = 0 Тогда // ошибка
					Результат = Результат + "%";
					Прервать;
				Иначе
					
					ПутьКДанным = Лев(ОстатокТекста, ПозКонцаЗначения - 1);
					Попытка
						Значение = Значения;
						Для Каждого Имя Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПутьКДанным, ".") Цикл
							Значение = Значение[Имя];
						КонецЦикла;
					Исключение
						Значение = "";
					КонецПопытки;
					Результат = Результат + ПодставитьЗначенияВСтроку(СокрЛП(Значение), Неопределено);
					
				КонецЕсли;
				
				ОстатокТекста   = Сред(ОстатокТекста, ПозКонцаЗначения + 1);
				ПозНачалаЗначения = Найти(ОстатокТекста, "%");
				
			КонецЦикла;
		КонецЕсли;   
		
		Результат = Результат + ОстатокТекста;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция СоздатьСтруктуруПолейВыборкиЗапросаПоДаннымИБ()
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", "NULL");
	Результат.Вставить("Код", "NULL");
	Результат.Вставить("Наименование", "NULL");
	Результат.Вставить("НомерСтроки", "NULL");
	Результат.Вставить("Бюджет", "NULL");
	Результат.Вставить("ДатаНачалаДействия", "NULL");
	Результат.Вставить("ДатаОкончанияДействия", "NULL");
	Результат.Вставить("ЕстьПериод", "Ложь");

	Возврат Результат;
	
КонецФункции

Функция СоздатьОписаниеЗапросаПоДаннымИБ()
	
	Результат = Новый Структура("ИЗ,ГДЕ,ВыбранныеПоля");
	Результат.ВыбранныеПоля = СоздатьСтруктуруПолейВыборкиЗапросаПоДаннымИБ();
	Возврат Результат;
	
КонецФункции

Процедура УстановитьРеквизитыЭлемента(Знач Объект, Знач ИсточникЗначений, Знач Характеристики)
	
	Если Характеристики.ЕстьРодитель И ТипЗнч(ИсточникЗначений.РодительСсылка) = ТипЗнч(Объект.Ссылка) Тогда
		Объект.Родитель = ИсточникЗначений.РодительСсылка;
	КонецЕсли;
	
	Если Характеристики.ЕстьВладелец Тогда
		Если ЗначениеЗаполнено(Объект.Родитель) Тогда
			Объект[Характеристики.ИмяРеквизитаВладелец] = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Родитель, Характеристики.ИмяРеквизитаВладелец);
		ИначеЕсли ИсточникЗначений.РодительСсылка <> Null И ТипЗнч(ИсточникЗначений.РодительСсылка) <> ТипЗнч(Объект.Ссылка) Тогда
			Объект[Характеристики.ИмяРеквизитаВладелец] = ИсточникЗначений.РодительСсылка;
		КонецЕсли;
	КонецЕсли;
	
	Если Характеристики.ЕстьДопустимыеКОСГУ Тогда
		Если ЗначениеЗаполнено(ИсточникЗначений.НомерСтроки) Тогда
			Объект.ДопустимыеКОСГУ.Найти(ИсточникЗначений.НомерСтроки, "НомерСтроки").Наименование = ИсточникЗначений.Наименование;
		Иначе
			Объект.НаименованиеПолное = ИсточникЗначений.Наименование;
		КонецЕсли;
	Иначе
		Объект.НаименованиеПолное = ИсточникЗначений.Наименование;
	КонецЕсли;
	
	Если Характеристики.ЕстьБюджет Тогда
		Объект.Бюджет = ИсточникЗначений.Бюджет;
	КонецЕсли;
	
	Если Характеристики.ЕстьПериодДействия Тогда
		Объект.ДатаНачалаДействия = ИсточникЗначений.ДатаНачалаДействия;
		Объект.ОкончаниеДействия  = ИсточникЗначений.ДатаОкончанияДействия;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВременнуюТаблицу(Знач МенеджерВременныхТаблиц, Знач Имя)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("ВЫБРАТЬ ВременнаяТаблица.* ИЗ %1 КАК ВременнаяТаблица", Имя);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция НачатьИзменениеЭлемента(Знач СсылкаИлиМенеджер)
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(СсылкаИлиМенеджер) Тогда
		Объект = СсылкаИлиМенеджер.ПолучитьОбъект();
	Иначе
		Объект = СсылкаИлиМенеджер.СоздатьЭлемент();
	КонецЕсли;
	
	// Не блокируем объект: считаем, что у нас преимущество перед интерактивными действиями.
	
	Возврат Объект;
	
КонецФункции

Функция ЗакончитьИзменениеЭлемента(Знач Объект)
	
	Если Объект.ЭтоНовый() ИЛИ Объект.Модифицированность() Тогда
		Объект.Записать();
	КонецЕсли;
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти
