
#Область СлужебныйПрограммныйИнтерфейс

Функция ОбработкаКомандыПечатиСведенияБО(ПараметрКоманды) Экспорт
	
	МассивДокументов = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечати0506101(МассивДокументов);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Документ_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
		
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);
		
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать Форму ""Сведения о бюджетном обязательстве"" по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		ВызватьИсключение СообщениеТекст;
		
	КонецЕсли; 
	
КонецФункции

Функция ОбработкаКомандыПечатиСведенияБОДоговор(ПараметрКоманды) Экспорт
	
	МассивДоговоров = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечати0506101ПоДоговорам(МассивДоговоров);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Договор_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать Форму ""Сведения о бюджетном обязательстве"" по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		ВызватьИсключение СообщениеТекст;
	КонецЕсли;
	
КонецФункции

Функция ОбработкаКомандыПечатиФ0506101(ПараметрКоманды) Экспорт
	
	МассивДокументов = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечати0506101(МассивДокументов);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Документ_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
		
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);
		
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать Форму 0506101 (Сведения о бюджетном обязательстве) по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		ВызватьИсключение СообщениеТекст;
		
	КонецЕсли; 
	
КонецФункции

Функция ОбработкаКомандыПечатиФ0506101Договор(ПараметрКоманды) Экспорт
	
	МассивДоговоров = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечати0506101ПоДоговорам(МассивДоговоров);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Договор_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать Форму 0506101 (Сведения о бюджетном обязательстве) по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		ВызватьИсключение СообщениеТекст;
	КонецЕсли;
	
КонецФункции

Функция ОбработкаКомандыПечатиФ0531702(ПараметрКоманды) Экспорт
	
	МассивДокументов = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечати0531702(МассивДокументов);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Документ_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
		
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);
		
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать Форму 0531702 (Сведения о принятом бюджетном обязательстве) по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		ВызватьИсключение СообщениеТекст;
		
	КонецЕсли; 
	
КонецФункции

Функция ОбработкаКомандыПечатиФ0531702Договор(ПараметрКоманды) Экспорт
	
	МассивДоговоров = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечати0531702ПоДоговорам(МассивДоговоров);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Договор_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать Форму 0531702 (Сведения о принятом бюджетном обязательстве) по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		ВызватьИсключение СообщениеТекст;
	КонецЕсли;
	
КонецФункции

Функция ОбработкаКомандыПечатиФ0531705(ПараметрКоманды) Экспорт
	
	МассивДокументов = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечати0531705(МассивДокументов);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Документ_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать Форму 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство) по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		ВызватьИсключение СообщениеТекст;
	КонецЕсли; 
	
КонецФункции

Функция ОбработкаКомандыПечатиФ0531705Договор(ПараметрКоманды) Экспорт
	
	МассивДоговоров = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечати0531705ПоДоговорам(МассивДоговоров);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Договор_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать Форму 0531705 (Заявка на внесение изменений в принятое бюджетное обязательство) по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		ВызватьИсключение СообщениеТекст;
	КонецЕсли;
	
КонецФункции

Функция ОбработкаКомандыПечатиФ0531706(ПараметрКоманды) Экспорт
	
	МассивДокументов = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечати0531706(МассивДокументов);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Документ_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать Форму 0531706 (Заявка на перерегистрацию бюджетного обязательства) по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		ВызватьИсключение СообщениеТекст;
	КонецЕсли;
	
КонецФункции

Функция ОбработкаКомандыПечатиФ0531706Договор(ПараметрКоманды) Экспорт
	
	МассивДоговоров = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечати0531706ПоДоговорам(МассивДоговоров);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Договор_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать Форму 0531706 (Заявка на перерегистрацию бюджетного обязательства) по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		ВызватьИсключение СообщениеТекст;
	КонецЕсли;
	
КонецФункции

Функция ОбработкаКомандыПечатиСведенийОГК(ПараметрКоманды) Экспорт
	
	МассивДокументов = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечатиСведенийОГК(МассивДокументов);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Документ_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать информацию (сведения) о заключенном контракте по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		ВызватьИсключение СообщениеТекст;
	КонецЕсли; 
	
КонецФункции

Функция ОбработкаКомандыПечатиСведенийОГКДоговор(ПараметрКоманды) Экспорт
	
	МассивДоговоров = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечатиСведенийОГКПоДоговорам(МассивДоговоров);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Договор_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
		
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);		
		
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать информацию (сведения) о заключенном контракте по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		
		ВызватьИсключение СообщениеТекст;
		
	КонецЕсли; 
	
КонецФункции

Функция ОбработкаКомандыПечатиСведенийОПрекращенииДоговор(ПараметрКоманды) Экспорт
	
	МассивДоговоров = ПараметрКоманды.ОбъектыПечати;
	МассивДокументовДляПечати = Новый Массив;
	ТекстОшибки = "";
	МассивСтруктурДляПечати = РаботаСОбязательствамиВызовСервера.СформироватьСтруктуруДляПечатиСведенийОПрекращенииПоДоговорам(МассивДоговоров);
	
	Для каждого ЭлементСтруктуры Из МассивСтруктурДляПечати Цикл
		
		Если ЭлементСтруктуры.Ошибка Тогда
			ТекстСообщения = СтрЗаменить(ЭлементСтруктуры.ТекстОшибки, "_Договор_", ЭлементСтруктуры.Наименование);
			ТекстОшибки = ТекстОшибки + ?(ТекстОшибки = "", "", Символы.ПС) + ТекстСообщения;		
		Иначе
			МассивДокументовДляПечати.Добавить(ЭлементСтруктуры.Документ);
		КонецЕсли; 
		
	КонецЦикла; 	
	
	Если МассивДокументовДляПечати.Количество() > 0 Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьСведенийПоДоговорамИОбязательствам", ПараметрКоманды.Идентификатор, МассивДокументовДляПечати, ПараметрКоманды.Форма);		
		
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		
		СообщениеТекст = НСтр("ru = 'Нельзя напечатать сведения об исполнении (расторжение) договора по причине:
											 |%ТекстОшибки%'");
		СообщениеТекст = СтрЗаменить(СообщениеТекст, "%ТекстОшибки%", ТекстОшибки);
		
		ВызватьИсключение СообщениеТекст;
		
	КонецЕсли; 
	
КонецФункции

#Область КонтрольЦенПГФ

Процедура ОбработатьКомандуКонтроляЦен(ДатаКонтроля, Форма) Экспорт
	
	Объект = Форма.Объект;
	Отказ = Ложь;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ВидПоступленияМЗ") Тогда
		Если НЕ Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика") Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСТр("ru = 'Возможно только для поступления ТМЦ от поставщика'"),, "Объект.ВидПоступленияМЗ",,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСТр("ru = 'Не заполнено обязательное поле ""Договор""'"),,
			"Объект.Договор",,Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("ДатаКонтроля", ДатаКонтроля);
	ОповещениеКонтроля = Новый ОписаниеОповещения("ПослеВводаДатыКонтроляЦен", Форма, ДопПараметры);
	
	Если ЗначениеЗаполнено(ДатаКонтроля) Тогда
		ВыполнитьОбработкуОповещения(ОповещениеКонтроля);
	Иначе
		ПоказатьВводЗначения(ОповещениеКонтроля, ДатаКонтроля, "Укажите дату в плановом периоде");
	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьКомандуУбратьВыделениеКонтроляЦен(Форма, ИмяТЧ) Экспорт
	
	Если Форма.МассивСтрокКонтроляЦен = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИдентификаторСтрокиВыделения Из Форма.МассивСтрокКонтроляЦен Цикл
		СтрокаМатериалы = Форма.Объект[ИмяТч].НайтиПоИдентификатору(ИдентификаторСтрокиВыделения);
		Если СтрокаМатериалы <> Неопределено Тогда
			СтрокаМатериалы.ЦенаОтличается = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти


