
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация"	, Организация);
	Параметры.Свойство("Период"			, Период);
	Параметры.Свойство("ОбщаяСтавка"	, ОбщаяСтавка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСоздатьНедвижимоеНажатие(Элемент)
	
	СоздатьДокументРегистрацииСтавкиСОтбором("Недвижимое");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСоздатьПоОбщейСтавкеНажатие(Элемент)
	
	СоздатьДокументРегистрацииСтавкиСОтбором("ПоОбщейСтавке");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументРегистрацииСтавкиСОтбором(Режим)
	
	ПараметрыЗаполнения = ПараметрыЗаполненияДокумента(Режим, Организация, ОбщаяСтавка);
	
	ПараметрыЗаполнения.Вставить("Организация", Организация);
	ПараметрыЗаполнения.Вставить("Дата", Период + ?(Режим = "ПоОбщейСтавке", 2, 1));
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения,ЗаполнитьПриОткрытии", ПараметрыЗаполнения, Истина);
	ОткрытьФорму("Документ.РегистрацияСтавкиНалогаНаИмущество.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыЗаполненияДокумента(Режим, Организация, ОбщаяСтавка)
	
	ПараметрыЗаполнения = Новый Структура;
	
	Если Режим = "ПоОбщейСтавке" Тогда
		ПорядокНалогообложения = Перечисления.ПорядокНалогообложенияИмущества.ПоОбщейСтавке;
	Иначе
		ПорядокНалогообложения = Перечисления.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению;
	КонецЕсли;
	
	ПараметрыЗаполнения.Вставить("ПорядокНалогообложения", ПорядокНалогообложения);
	
	СхемаКомпоновки = Отчеты.РасчетСреднегодовойСтоимостиИмущества.ПолучитьМакет("ДанныеЗаМесяц");
	
	Настройки = СхемаКомпоновки.ВариантыНастроек["Основной"].Настройки;
	Настройки.Отбор.Элементы.Очистить();
	
	ЗаполнитьОтбор(Настройки.Отбор, Режим, Организация, ОбщаяСтавка);
	
	ОтборСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(Настройки.Отбор);
	
	ПараметрыЗаполнения.Вставить("ОтборЗаполнения", ОтборСтрокой);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьОтбор(Отбор, Режим, Организация, ОбщаяСтавка)
	
	ОбщийМодульСКД.ДобавитьЭлементОтбораКомпоновкиДанных(Отбор, "ЭтоИндивидуальнаяСтавка",, (Режим = "ПоОбщейСтавке"));
	
	ОбщийМодульСКД.ДобавитьЭлементОтбораКомпоновкиДанных(Отбор, "Счет",
		ВидСравненияКомпоновкиДанных.ВИерархии,
		БухгалтерскийУчет.СчетПоКоду("101.10"));
		
	Если Режим = "ПоОбщейСтавке" Тогда
		
		Реквизиты = Новый Структура("НалоговыйОрган,КодПоОКТМО", "РегистрацияВНалоговомОргане", "РегистрацияВНалоговомОргане.КодПоОКТМО");
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, Реквизиты);
		
		ДобавитьЭлементОтбора(Отбор, "НалоговыйОрган"									, ЗначенияРеквизитов.НалоговыйОрган);
		ДобавитьЭлементОтбора(Отбор, "КодПоОКАТО"										, ЗначенияРеквизитов.КодПоОКТМО);
		ДобавитьЭлементОтбора(Отбор, "ПорядокНалогообложения"							, ОбщаяСтавка.НалогНаИмуществоПорядокНалогообложения);
		ДобавитьЭлементОтбора(Отбор, "НалоговаяСтавка"									, ОбщаяСтавка.НалогНаИмуществоСтавка);
		ДобавитьЭлементОтбора(Отбор, "НалоговаяБаза"									, Перечисления.НалоговаяБазаПоНалогуНаИмущество.СреднегодоваяСтоимость);
		ДобавитьЭлементОтбора(Отбор, "КодВидаИмущества"									, "03");
		ДобавитьЭлементОтбора(Отбор, "КодНалоговойЛьготыОсвобождениеОтНалогообложения"	, ОбщаяСтавка.НалогНаИмуществоКодЛьготы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьЭлементОтбора(Коллекция, ЛевоеЗначение, ПравоеЗначение)
	
	НовЭлемент					= Коллекция.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭлемент.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных(ЛевоеЗначение);
	НовЭлемент.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	НовЭлемент.ПравоеЗначение	= ПравоеЗначение;
	НовЭлемент.Использование	= Истина;
	
КонецПроцедуры
