
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.АдресТаблицыПакетовОбмена) Тогда
		ТабПакетов = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыПакетовОбмена);
		ТаблицаПакетов.Загрузить(ТабПакетов);
		Если ТаблицаПакетов.Количество() = 1 Тогда
			ТекстНадписи = "Пакет """+ТаблицаПакетов[0].ПакетОтчетов+"""";
			Если ТаблицаПакетов[0].Состояние = Перечисления.СостоянияПакетаОтчетов.Отправлен Тогда
				Элементы.ДекорацияСостояние.Картинка = БиблиотекаКартинок.ЗеленыйШар;
				ТекстНадписи = ТекстНадписи + " отправлен успешно";
			Иначе
				Элементы.ДекорацияСостояние.Картинка = БиблиотекаКартинок.КрасныйШар;
				ТекстНадписи = ТекстНадписи + " не принят";
			КонецЕсли;
			Элементы.ГруппаСписокПакетов.Видимость = Ложь;
			Элементы.ГруппаОдинПакет.Видимость = Истина;
			Элементы.ДекорацияОдинПакет.Заголовок = ТекстНадписи;
			Элементы.ГруппаРезультат.ОтображатьЗаголовок = Ложь;
		Иначе
			Элементы.ГруппаРезультат.ПутьКДаннымЗаголовка = "ТекПакет";
		КонецЕсли;
		ЗаполнитьПротоколы(0);
	ИначеЕсли ЗначениеЗаполнено(Параметры.ПакетВыгрузки) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИсторияСостоянийПакетаОтчетовСрезПоследних.Состояние КАК Состояние,
			|	ИсторияСостоянийПакетаОтчетовСрезПоследних.Период КАК Период
			|ИЗ
			|	РегистрСведений.ИсторияСостоянийПакетаОтчетов.СрезПоследних КАК ИсторияСостоянийПакетаОтчетовСрезПоследних
			|ГДЕ
			|	ИсторияСостоянийПакетаОтчетовСрезПоследних.ПакетОтчетов = &ПакетОтчетов";
		
		Запрос.УстановитьПараметр("ПакетОтчетов", Параметры.ПакетВыгрузки);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НовСтр = ТаблицаПакетов.Добавить();
			НовСтр.ПакетОтчетов = Параметры.ПакетВыгрузки;
			НовСтр.Период = ВыборкаДетальныеЗаписи.Период;
			НовСтр.Состояние = ВыборкаДетальныеЗаписи.Состояние;
		КонецЕсли;
	
		Элементы.ГруппаСписокПакетов.Видимость = Ложь;
		Элементы.ГруппаОдинПакет.Видимость = Ложь;
		Элементы.ГруппаРезультат.ОтображатьЗаголовок = Ложь;
			
		ЗаполнитьПротоколы(0);
	КонецЕсли;
			
	Если ЗначениеЗаполнено(ПротоколИмпорта) Тогда
		Элементы.СтраницыРезультата.ТекущаяСтраница = Элементы.СтраницаПротоколаИмпорта;
	ИначеЕсли ЗначениеЗаполнено(Комментарий) Тогда
		Элементы.СтраницыРезультата.ТекущаяСтраница = Элементы.СтраницаКомментарий;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияОдинПакетНажатие(Элемент)
	ПоказатьЗначение(,ТекПакет);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПакетов

&НаКлиенте
Процедура ТаблицаПакетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗаполнитьПротоколы(ВыбраннаяСтрока);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьРезультат(Команда)
	ТекСтрока = Элементы.ТаблицаПакетов.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено Тогда
		ЗаполнитьПротоколы(ТекСтрока);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПротоколы(ИдСтроки)
	
	ПротоколОбработки = "";
	ПротоколИмпорта = "";
	ПротоколПроверки = "";
	Комментарий = "";
	
	Для Каждого СтрТЧ Из ТаблицаПакетов Цикл
		СтрТЧ.Выбран = Ложь;
	КонецЦикла;
	
	ТекСтрока = ТаблицаПакетов.НайтиПоИдентификатору(ИдСтроки);
	ТекСтрока.Выбран = Истина;
	ТекПакет = ТекСтрока.ПакетОтчетов;
	
	ЗаписьРС = РегистрыСведений.ИсторияСостоянийПакетаОтчетов.СоздатьМенеджерЗаписи();
	ЗаписьРС.Период = ТекСтрока.Период;
	ЗаписьРС.ПакетОтчетов = ТекСтрока.ПакетОтчетов;
	ЗаписьРС.Прочитать();
	
	Если ЗаписьРС.Выбран() Тогда
		ПротоколИмпорта = ЗаписьРС.ПротоколИмпорта.Получить();
		ПротоколОбработки = ЗаписьРС.ПротоколОбработки.Получить();
		ПротоколПроверки = ЗаписьРС.ПротоколПроверки.Получить();
		Комментарий = ЗаписьРС.Комментарий;
	КонецЕсли;
	
	Элементы.СтраницаПротоколОбработки.Видимость = ЗначениеЗаполнено(ПротоколОбработки);
	Элементы.СтраницаПротоколПроверки.Видимость = ЗначениеЗаполнено(ПротоколПроверки);
	
	Если ЗначениеЗаполнено(Комментарий) Тогда
		Элементы.СтраницаКомментарий.Картинка = БиблиотекаКартинок.ОформлениеЗнакВосклицательныйЗнак;
	Иначе
		Элементы.СтраницаКомментарий.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


