#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	СпрКомпл.Ссылка
			|ИЗ
			|	Справочник.СтрокиОтчетов КАК СпрКомпл
			|ГДЕ
			|	ПОДСТРОКА(СпрКомпл.ХешРеквизитов, 1, 1) = """"";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Справочник.СтрокиОтчетов";
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		Элемент = Блокировка.Добавить("Справочник.СтрокиОтчетов");
		Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		Элемент.Режим = РежимБлокировкиДанных.Исключительный;
		
		Попытка
		
			Блокировка.Заблокировать();
		
		Исключение
			
			// Объект не удается заблокировать - попробуем обработать его на следующей итерации.
			// Отдельно обрабатывать ошибку не требуется, т.к. в худшем случае обработчик зациклится
			// и прервется автоматически.
			ЗафиксироватьТранзакцию();
			Продолжить;
			
		КонецПопытки;
		
		// Проверка существования ссылки
		Если Не ОбщегоНазначения.СсылкаСуществует(Выборка.Ссылка) Тогда
			
			// Вероятно был удален раньше, чем обработчик дошел до него
			ЗафиксироватьТранзакцию();
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			Продолжить;
		
		КонецЕсли;
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		
		Попытка
		
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект,Ложь,Ложь);
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать спавочник: %Справочник% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Справочник%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Справочники.СтрокиОтчетов,
				Выборка.Ссылка,
				ТекстСообщения);
			ВызватьИсключение;
		
		КонецПопытки;
	
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры


#КонецОбласти


#КонецОбласти

#КонецЕсли
