////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.СтруктураПоискаФизлиц) <> Тип("Структура") Тогда
		ОдинаковыеСотрудники = Параметры.ОдинаковыеСотрудники;
	Иначе
		СтруктураПоискаФизлиц = Параметры.СтруктураПоискаФизлиц;
		ОдинаковыеСотрудники = ПодобратьСписокФизЛиц(СтруктураПоискаФизлиц.ФизическоеЛицоСсылка,
													СтруктураПоискаФизлиц.Организация, 
													СтруктураПоискаФизлиц.Фамилия,
													СтруктураПоискаФизлиц.Имя,
													СтруктураПоискаФизлиц.Отчество);
		Если ОдинаковыеСотрудники.Количество() = 0 Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ФИОФизическихЛицСрезПоследних.Фамилия,
	               |	ФИОФизическихЛицСрезПоследних.Имя,
	               |	ФИОФизическихЛицСрезПоследних.Отчество,
	               |	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
	               |	ФизическиеЛица.ИНН,
	               |	ФизическиеЛица.Пол,
	               |	ФизическиеЛица.ДатаРождения,
	               |	ФизическиеЛица.Наименование КАК ФИО,
	               |	Контрагенты.Ссылка КАК Контрагент
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОФизическихЛицСрезПоследних
	               |		ПО ФизическиеЛица.Ссылка = ФИОФизическихЛицСрезПоследних.ФизическоеЛицо
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО Контрагенты.ЮридическоеФизическоеЛицо = ФизическиеЛица.Ссылка
	               |ГДЕ
	               |	ФизическиеЛица.Ссылка В(&ФизическиеЛица)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ФизическиеЛица", ОдинаковыеСотрудники);
	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	
	Сотрудники.Очистить();
	Пока Выборка.Следующий() Цикл
		СтрокаСотрудника = Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСотрудника, Выборка);
		СтрокаСотрудника.Представление = "Дата рождения: " + Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy") + Символы.ПС
		                               + "ИНН:                   " + Выборка.ИНН;
	КонецЦикла;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ Сотрудники

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.Сотрудники.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Новый Структура("ФизическоеЛицо, Контрагент",
								Элементы.Сотрудники.ТекущиеДанные.ФизическоеЛицо,Элементы.Сотрудники.ТекущиеДанные.Контрагент));
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ТотЖеСотрудник(Команда)
	Если Элементы.Сотрудники.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Новый Структура("ФизическоеЛицо, Контрагент",
								Элементы.Сотрудники.ТекущиеДанные.ФизическоеЛицо,Элементы.Сотрудники.ТекущиеДанные.Контрагент));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовыйСотрудник(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФизическоеЛицо(Команда)
	Если Элементы.Сотрудники.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(Неопределено, Элементы.Сотрудники.ТекущиеДанные.ФизическоеЛицо);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ПодобратьСписокФизЛиц(ФизическоеЛицоСсылка, Организация, Знач Фамилия, Знач Имя, Знач Отчество)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛица.Ссылка
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|			ПО Контрагенты.Ссылка = Сотрудники.Контрагент
	|				И (Сотрудники.Владелец = &Организация)
	|		ПО ФизическиеЛица.Ссылка = Контрагенты.ЮридическоеФизическоеЛицо
	|ГДЕ
	|	(НЕ ФизическиеЛица.ЭтоГруппа)
	|	И (ФизическиеЛица.Наименование ПОДОБНО &ФамилияИмяОтчество СПЕЦСИМВОЛ ""~""
	|			ИЛИ ФизическиеЛица.Наименование ПОДОБНО &ИмяОтчествоФамилия СПЕЦСИМВОЛ ""~"")
	|	И ФизическиеЛица.Ссылка <> &ФизическоеЛицоСсылка
	|	И Сотрудники.Ссылка ЕСТЬ NULL ";
	
	Фамилия = ?(ПустаяСтрока(Фамилия), "", "%"+Фамилия+"%");
	Имя = ?(ПустаяСтрока(Имя), "", "%"+Имя+"%");
	Отчество = ?(ПустаяСтрока(Отчество), "", "%"+Отчество+"%");
	
	Запрос.УстановитьПараметр("ФамилияИмяОтчество", Фамилия + Имя + Отчество);
	Запрос.УстановитьПараметр("ИмяОтчествоФамилия", Имя + Отчество + Фамилия);
	Запрос.УстановитьПараметр("ФизическоеЛицоСсылка", ФизическоеЛицоСсылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	МассивФизлиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	СписокФизлиц = Новый СписокЗначений;
	СписокФизлиц.ЗагрузитьЗначения(МассивФизлиц);
	
	Возврат СписокФизЛиц;
	
КонецФункции
