#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.КодТекущейСтроки) Тогда 
		Если ОбщегоНазначения.ЗначениеСсылочногоТипа(Параметры.КодТекущейСтроки) 
			И ТипЗнч(Параметры.КодТекущейСтроки) = Тип("СправочникСсылка.ОбщероссийскийКлассификаторОрганизационноПравовыхФорм") Тогда
			ТекущийКод = Параметры.КодТекущейСтроки;
		ИначеЕсли ТипЗнч(Параметры.КодТекущейСтроки) = Тип("Строка") Тогда
			ТекущийКод = Справочники.ОбщероссийскийКлассификаторОрганизационноПравовыхФорм.НайтиПоКоду(Параметры.КодТекущейСтроки);
		КонецЕсли;	
		
		Элементы.Список.ТекущаяСтрока = ТекущийКод;
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти