
/////////////////////////////////////////////////////////////////////////////////
// БЮДЖЕТНАЯ ОТЧЕТНОСТЬ, ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ЗАПОЛНЕНИЯ ОТЧЕТНОСТИ         //
/////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Получает контрагента, соответствующего организации по ИНН, КПП, Бюджету
//
// Параметры
//  Организация - СправочникСсылка.Организации
//  СоздаватьКонтрагента - булево - Истина - если контрагента нет, то будет создан, Ложь - контрагент создан не будет
//
// Возвращаемое значение:
//   СправочникСсылка.Контрагенты - найденный контрагент. Если не найден, возвращается пустая ссылка.
//
Функция ПолучитьКонтрагентаПоОрганизации(Знач Организация,Знач СоздаватьКонтрагента = Ложь) Экспорт
	Возврат БюджетнаяОтчетностьПолучениеНСИ.КонтрагентПоОрганизации(Организация, СоздаватьКонтрагента);		
КонецФункции

// Получает схему компоновки из шаблона и применяет к ней настройки текущей схемы
// Необходимо для обновления доступных полей схемы правила заполнения при изменении схемы швблона
//
// Параметры:
//  СхемаКомпоновки - Схема компоновки правила заполнения
//  ИмяШаблона - Строка, имя шаблона
//  ОбщиеПараметры - оющие параметры правила заполнения
//
// Возвращаемое значение:
//  Нет
//
Процедура ВосстановитьСхемуИзШаблона(СхемаКомпоновки, Знач ИмяШаблона, Знач ОбщиеПараметры, Знач ВычисляемыеПараметры) Экспорт
	
	Перем КомпоновщикНастроек;
	
	Если ТипЗнч(СхемаКомпоновки) = Тип("СхемаКомпоновкиДанных") Тогда
		
		// Сохранение текущих настроек
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		
		Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновки));
		
		КомпоновщикНастроек.Инициализировать(Источник);
		
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.ВариантыНастроек.Основной.Настройки);
		
	КонецЕсли;
	
	// Восстановление схемы из шаблона
	
	ВидТаблицы = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьИнформациюОВидеТаблицы(ИмяШаблона);
	СхемаКомпоновки = ПолучитьОбщийМакет(ВидТаблицы.ПолноеИмяМакета);
	
	Если ВидТаблицы.Имя = "ПоказателиОтчетов" И КомпоновщикНастроек <> Неопределено Тогда
		НастройкиПриемник = СхемаКомпоновки.ВариантыНастроек.Основной.Настройки;
		НастройкиИсточник = КомпоновщикНастроек.ПолучитьНастройки();
		Если ТипЗнч(НастройкиПриемник) = Тип("НастройкиКомпоновкиДанных") Тогда
			Для каждого Параметр Из НастройкиИсточник.ПараметрыДанных.Элементы Цикл
				ЗначениеПараметра = НастройкиПриемник.ПараметрыДанных.НайтиЗначениеПараметра(Параметр.Параметр);
				Если ЗначениеПараметра <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(ЗначениеПараметра, Параметр);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ДополнитьСхему(СхемаКомпоновки);
	КонецЕсли;
	
	Если ТипЗнч(КомпоновщикНастроек) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		
		СкопироватьНастройкиКомпоновкиДанных(СхемаКомпоновки.ВариантыНастроек.Основной.Настройки, КомпоновщикНастроек.ПолучитьНастройки());
		
	КонецЕсли;
	
	// Добавление общих параметров в схему компоновки
	ДобавитьПараметрыВСхему(СхемаКомпоновки, ОбщиеПараметры);
	
	//Вычисляемые параметры и способы справнения заменяются на значения и аналогичные способы сравнения со списком значений
	//перед выполнением схемы компоновки данных.
	Для каждого СтрокаТаблицы Из ВычисляемыеПараметры Цикл
		
		ПараметрСхемы = СхемаКомпоновки.Параметры.Добавить();
		ПараметрСхемы.Имя = "ВПС_"+СтрокаТаблицы.ИмяПараметра;
		ПараметрСхемы.ДоступенСписокЗначений = Истина;
		ПараметрСхемы.ОграничениеИспользования = Истина;
		ПараметрСхемы.ВключатьВДоступныеПоля = Истина;
		
		ТипЗначения = Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ");
		
		ПараметрСхемы.ТипЗначения = ТипЗначения;
		
	КонецЦикла;
	
	ПрименитьНастройкиКСхемеКомпоновки(СхемаКомпоновки);
	
КонецПроцедуры

//Дополняет схему компоновки с видом ""
Процедура ДополнитьСхему(Схема) Экспорт
	
	КодВидаОтчета = "";
	
	ЗначениеПараметра = Схема.ВариантыНастроек.Основной.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КодВидаОтчета"));
	Если ЗначениеПараметра <> Неопределено Тогда
		КодВидаОтчета = ЗначениеПараметра.Значение;
	КонецЕсли;
		
	
	Запрос =Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоказателиОтчетов.Колонка.Код КАК КодКолонки,
	|	ПоказателиОтчетов.Колонка.ПорядковыйНомер,
	|	ПоказателиОтчетов.Владелец КАК ВидОтчета
	|ИЗ
	|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыОтчетов КАК ВидыОтчетов
	|		ПО ПоказателиОтчетов.Владелец = ВидыОтчетов.Ссылка
	|			И (ВидыОтчетов.Код = &КодВидаОтчета)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоказателиОтчетов.Колонка.ПорядковыйНомер";
		
	
	Запрос.УстановитьПараметр("КодВидаОтчета", СокрЛП(КодВидаОтчета));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВидОтчета = Неопределено;
	
	ИсходнаяСхема = ПолучитьОбщийМакет("ЗаполнениеОтчетов_ПоказателиОтчетов");
	ИсходныйНабор = ИсходнаяСхема.НаборыДанных[0];
	
	МассивПолейКУдалению = Новый Массив;
	Для Каждого ТекПоле Из Схема.НаборыДанных[0].Поля Цикл
		Если ИсходныйНабор.Поля.Найти(ТекПоле.ПутьКДанным) = Неопределено Тогда
			МассивПолейКУдалению.Добавить(ТекПоле);
		КонецЕсли;		
	КонецЦикла;
	
	Для Каждого ЭлМас Из МассивПолейКУдалению Цикл
		Схема.НаборыДанных[0].Поля.Удалить(ЭлМас);
	КонецЦикла;
	
	Пока Выборка.Следующий() Цикл
		КодКолонки = СокрП(Выборка.КодКолонки);
		ПолеНабора = Схема.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабора.ПутьКДанным 	= "Объект."+КодКолонки;
		ПолеНабора.Поле			= КодКолонки;
		ВидОтчета = Выборка.ВидОтчета;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ВидОтчета) Тогда
		Для Сч = 1 По БюджетнаяОтчетность.ЧислоДопАналитик(ВидОтчета) Цикл
			
			ПолеНабора = Схема.НаборыДанных[0].Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			ПолеНабора.ПутьКДанным 	= "Объект.Аналитика"+Сч;
			ПолеНабора.Поле			= "Аналитика"+Сч;
			
		КонецЦикла;
	КонецЕсли;
	
	Настройки = Схема.ВариантыНастроек.Основной.Настройки;
	
	Настройки.Выбор.Элементы.Очистить();
	
	Для Каждого Поле Из Схема.НаборыДанных[0].Поля Цикл
		ТекПоле = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ТекПоле.Поле = Новый ПолеКомпоновкиДанных(Поле.ПутьКДанным);
		ТекПоле.Заголовок = Поле.Заголовок;
		ТекПоле.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры

// Выгружает настройки компоновки данных во внешний файл
//
// Параметры:
//  НастройкиСхемы - настройки схемы компоновки данных для выгрузки в файл
//  ИмяФайла - Строка, имя файла
//
// Возвращаемое значение:
//  Нет
//
Процедура ВыгрузитьНастройки(Знач НастройкиСхемы, Знач ИмяФайла) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, 
		НастройкиСхемы,
		"settings", 
		"http://v8.1c.ru/8.1/data-composition-system/settings");
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

// Выгружает схему компоновки данных во внешний файл
//
// Параметры:
//  СхемаКомпоновки - схема компоновки данных для выгрузки в файл
//  ИмяФайла - Строка, имя файла
//
// Возвращаемое значение:
//  Нет
//
Функция ВыгрузитьСхемуКомпоновки(Знач СхемаКомпоновки, Знач ИмяФайла) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML,
		СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(СхемаКомпоновки)),
		"data-composition-system", 
		"http://v8.1c.ru/8.1/data-composition-system");
	
	ЗаписьXML.Закрыть();
	
КонецФункции

// Выгружает таблицу данных во внешний файл
//
// Параметры:
//  ТаблицаДанных - таблица данных для выгрузки в файл
//  ИмяФайла - Строка, имя файла
//
// Возвращаемое значение:
//  Нет
//
Процедура ВыгрузитьТаблицуДанных(Знач ТаблицаДанных, Знач ИмяФайла) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ТаблицаДанных);
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

// Выгружает таблицу данных во внешний файл
//
// Параметры:
//  Построитель - построитель запроса для выгрузки в файл
//  ИмяФайла - Строка, имя файла
//
// Возвращаемое значение:
//  Нет
//
Процедура ВыгрузитьПостроительЗапроса(Построитель,ИмяФайла) Экспорт
	
	СтруктураВозврата = Новый Структура;
	
	Если ТипЗнч(Построитель) = Тип("Запрос") Тогда
		Запрос = Построитель;
	ИначеЕсли ТипЗнч(Построитель) = Тип("ПостроительЗапроса") Тогда
		Запрос = Построитель.ПолучитьЗапрос();
	КонецЕсли;
	
	СтруктураВозврата.Вставить("Текст",Запрос.Текст);
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("Имя");
	ТаблицаПараметров.Колонки.Добавить("Значение");
	
	Для каждого Параметр Из Запрос.Параметры Цикл
		
		СтрокаТаблицаПараметров = ТаблицаПараметров.Добавить();
		СтрокаТаблицаПараметров.Имя = Параметр.Ключ;
		СтрокаТаблицаПараметров.Значение = Параметр.Значение;
		
	КонецЦикла;
	
	СтруктураВозврата.Вставить("Параметры",ТаблицаПараметров);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, СтруктураВозврата);
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

// Помещает карты данных во временное хранилище и добавляет их в параметры схемы компоновки
//
// Параметры:
//  КартыДанных - массив карт данных
//  Схема - Целевая схема компоновки
//
// Возвращаемое значение:
//  Массив адресов
//
Функция ДобавитьКартыДанныхВСхему(Знач КартыДанных, Схема) Экспорт
	
	СтруктураАдресов = Новый Структура;
	
	Для каждого КартаДанных Из КартыДанных Цикл
		
		АдресКарты = ПоместитьВоВременноеХранилище(КартаДанных.Значение);
		
		СтруктураАдресов.Вставить(КартаДанных.Ключ,АдресКарты);
		
		СтруктураПараметра = Новый Структура("ИмяПараметра, ЗначениеПараметра", КартаДанных.Ключ, АдресКарты);
		
		ДобавитьПараметр(Схема,, СтруктураПараметра, Истина);
		
	КонецЦикла;
	
	Возврат СтруктураАдресов;
	
КонецФункции

// Заполняет отборы в схеме компоновки из структуры параметров
//
// Параметры:
//  Схема - Целевая схема компоновки
//  СтруктураПараметров - Структура параметров для заполнения
//
// Возвращаемое значение:
//  Нет
//
Процедура ЗаполнитьПараметрыИзДокумента(Схема, Знач СтруктураПараметров) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем ДополнительныйПериод1;
	Перем ДополнительныйПериод2;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
	
	ПараметрыСхемы = Схема.Параметры;
	НастройкиОтбор = Схема.ВариантыНастроек.Основной.Настройки.Отбор.Элементы;
	
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	
	СтруктураПараметров.Свойство("ДополнительныйПериод1", ДополнительныйПериод1);
	СтруктураПараметров.Свойство("ДополнительныйПериод2", ДополнительныйПериод2);
	
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	// Период отчета
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		
		ДобавитьПараметр(Схема,, Новый Структура("ИмяПараметра, ЗначениеПараметра","НачалоПериода",НачалоПериода));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		
		ДобавитьПараметр(Схема,, Новый Структура("ИмяПараметра, ЗначениеПараметра","КонецПериода",КонецПериода));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительныйПериод1) Тогда
		
		ДобавитьПараметр(Схема,, Новый Структура("ИмяПараметра, ЗначениеПараметра","ДополнительныйПериод1",ДополнительныйПериод1));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительныйПериод2) Тогда
		
		ДобавитьПараметр(Схема,, Новый Структура("ИмяПараметра, ЗначениеПараметра","ДополнительныйПериод2",ДополнительныйПериод2));
		
	КонецЕсли;
	
	НаборОбъединение = Схема.НаборыДанных.Найти("Объединение");
	ЕстьОрганизация = Истина;
	ЕстьИФО = Истина;
	Если НаборОбъединение<>Неопределено Тогда
		ЕстьОрганизация = НаборОбъединение.Поля.Найти("Организация") <> Неопределено;
		ЕстьИФО = НаборОбъединение.Поля.Найти("ИФО") <> Неопределено;
	КонецЕсли;
	
	// Организация
	Если Организация <> Неопределено И ЕстьОрганизация Тогда
		
		ПолеОтбора = НастройкиОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ТипЗнч(Организация) = Тип("Структура") Тогда
			
			ЗаполнитьЗначенияСвойств(ПолеОтбора, Организация);
			
		Иначе
			
			ПолеОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
			
			Если ТипЗнч(Организация) = Тип("СписокЗначений") Тогда
				ПолеОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Иначе
				ПолеОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
			
			ПолеОтбора.ПравоеЗначение = Организация;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// ИФО
	Если ИФО <> Неопределено И ЕстьИФО Тогда
		
		ПолеОтбора = НастройкиОтбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ТипЗнч(ИФО) = Тип("Структура") Тогда
			
			ЗаполнитьЗначенияСвойств(ПолеОтбора, ИФО);
			
		Иначе
			
			ПолеОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИФО");
			
			Если ТипЗнч(ИФО) = Тип("СписокЗначений") Тогда
				ПолеОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Иначе
				ПолеОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
			
			ПолеОтбора.ПравоеЗначение = ИФО;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Дополнительные параметры
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		
		Для каждого ДополнительныйПараметр Из ДополнительныеПараметры Цикл
			
			ДобавитьПараметр(Схема, , Новый Структура("ИмяПараметра, ЗначениеПараметра", ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение));
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьВнешниеНаборыДанных(СоответствиеДанных,КартыДанных) Экспорт
	
	Для Каждого НастройкаНабора Из СоответствиеДанных Цикл
		КодВидаОтчета = Неопределено;
		ИмяПараметраДляДокументов = "";
		ЗначениеПараметраДляДокументов = Неопределено;
		НастройкаНабора.Значение.Свойство("ЗначениеПараметраДляДокументов",ЗначениеПараметраДляДокументов);
		НастройкаНабора.Значение.Свойство("КодВидаОтчета",КодВидаОтчета);
		НастройкаНабора.Значение.Свойство("ИмяПараметраДляДокументов",ИмяПараметраДляДокументов);
		
		Если НЕ ЗначениеЗаполнено(ЗначениеПараметраДляДокументов) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивОтчетов = Новый Массив;
		Если ТипЗнч(ЗначениеПараметраДляДокументов) = Тип("СписокЗначений") Тогда
			Для Каждого ЭлементСписка Из ЗначениеПараметраДляДокументов Цикл
				Если МассивОтчетов.Найти(ЭлементСписка.Значение) = Неопределено 
					И ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
					МассивОтчетов.Добавить(ЭлементСписка.Значение);
				КонецЕсли;			
			КонецЦикла;
		Иначе
			МассивОтчетов.Добавить(ЗначениеПараметраДляДокументов);
		КонецЕсли;
		
		ТаблицаДанныхОбщая = Неопределено;
		Для Каждого СсылкаНаОтчет Из МассивОтчетов Цикл
			
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОтчет,"ВидОтчета,ШаблонОтчета");
			Если Реквизиты.ВидОтчета.Код <> КодВидаОтчета Тогда
				Продолжить;
			КонецЕсли;
			
			РеквизитыОтчета = Новый Структура("Ссылка,ВидОтчета,ШаблонОтчета,мДокументОснование,мДополнительныеРеквизиты");
			РеквизитыОтчета.Ссылка = СсылкаНаОтчет;
			ЗаполнитьЗначенияСвойств(РеквизитыОтчета,Реквизиты);
	
			// Инициализация контекста на сервере.
			Контекст = БюджетнаяОтчетностьСервер.ИнициализироватьКонтекстОтчета(РеквизитыОтчета);
		    Контекст.Вставить("ДокОтчет",СсылкаНаОтчет);
			
			ТаблицаДанных = ПолучитьКроссТаблицуПоказателей(Контекст);
			
			Если ТаблицаДанныхОбщая <> Неопределено Тогда
				Для Каждого СтрТЧ Из ТаблицаДанных Цикл
					НовСтр = ТаблицаДанныхОбщая.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр,СтрТЧ);
				КонецЦикла;
			Иначе
				ТаблицаДанныхОбщая = ТаблицаДанных.Скопировать();
			КонецЕсли;
		КонецЦикла;		
		
		Если ТаблицаДанныхОбщая <> Неопределено Тогда
			КартыДанных.Вставить("ДанныеВыборки_"+ИмяПараметраДляДокументов,ТаблицаДанныхОбщая);	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


// Получает кросс-таблицу значений показателей
//
Функция ПолучитьКроссТаблицуПоказателей(Контекст)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	мПоказатели.Ссылка,
	|	мПоказатели.КодСтрока КАК КодСтрокиОтчета,
	|	мПоказатели.КодКолонки,
	|	мПоказатели.ПорядковыйНомерКолонки,
	|	мПоказатели.ПорядковыйНомерСтроки,
	|	мПоказатели.Строка,
	|	мПоказатели.Колонка,
	|	мПоказатели.ГруппаРаскрытия,
	|	мПоказатели.Значение,
	|	мПоказатели.ТипЗначения
	|ПОМЕСТИТЬ Показатели
	|ИЗ
	|	&мПоказатели КАК мПоказатели";
		
	Запрос.УстановитьПараметр("мПоказатели"	,Контекст.мПоказатели);
	Запрос.Выполнить();
	
	// Создание списка колонок
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Показатели.КодКолонки,
	|	Показатели.ТипЗначения,
	|	Показатели.ПорядковыйНомерКолонки
	|ИЗ
	|	Показатели КАК Показатели
	|УПОРЯДОЧИТЬ ПО
	|	Показатели.ПорядковыйНомерКолонки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаРезультат.Колонки.Добавить("Строка",Новый ОписаниеТипов("СправочникСсылка.СтрокиОтчетов"));
	ТаблицаРезультат.Колонки.Добавить("КодСтрокиОтчета",БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(20));
	ТаблицаРезультат.Колонки.Добавить("ИтогПоСтроке",Новый ОписаниеТипов("Булево"));
	ТаблицаРезультат.Колонки.Добавить("ПорядковыйНомер",БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(5));
	
	ОписаниеТиповАналитики = Метаданные.ПланыВидовХарактеристик.АналитикаОтчетов.Тип;
	
	Если Контекст.мЧислоДопАналитик>0 Тогда
		
		РезультатЗапросаПоРаскрытию = ПолучитьДанныеРаскрытия(Контекст);
		
		Для Сч = 1 По Контекст.мЧислоДопАналитик Цикл
			ТаблицаРезультат.Колонки.Добавить("Аналитика"+Сч,ОписаниеТиповАналитики);
		КонецЦикла;
				
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ТаблицаРезультат.Колонки.Добавить(СокрП(Выборка.КодКолонки),
										  БюджетнаяОтчетность.ПолучитьОписаниеТиповДляЗначенияПоказателя(Выборка.ТипЗначения));
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Показатели.Значение,
	|	Показатели.КодКолонки,
	|	Показатели.ГруппаРаскрытия,
	|	Показатели.Строка КАК Строка,
	|	Показатели.КодСтрокиОтчета,
	|	Показатели.ПорядковыйНомерСтроки
	|ИЗ
	|	Показатели КАК Показатели
	|
	|УПОРЯДОЧИТЬ ПО
	|	Строка.ПорядковыйНомер
	|ИТОГИ ПО
	|	Строка";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Контекст.мЧислоДопАналитик>0 Тогда
		РаскрытиеСтрок = РезультатЗапросаПоРаскрытию.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = ТаблицаРезультат.Добавить();
		СтрокаТаблицы.Строка	 	  	= Выборка.Строка;
		СтрокаТаблицы.ИтогПоСтроке  	= Истина;
		
		ВыборкаПоказателей = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ГруппаРаскрытия = Неопределено;
		КодСтрокиОтчета = "";
		ПорядковыйНомер = 0;
		
		Пока ВыборкаПоказателей.Следующий() Цикл
			
			СтрокаТаблицы[СокрП(ВыборкаПоказателей.КодКолонки)] = ВыборкаПоказателей.Значение;
			
			БюджетнаяОтчетностьКлиентСервер.УстановитьНовоеЗначение(ГруппаРаскрытия,ВыборкаПоказателей.ГруппаРаскрытия);
			БюджетнаяОтчетностьКлиентСервер.УстановитьНовоеЗначение(СтрокаТаблицы.КодСтрокиОтчета,ВыборкаПоказателей.КодСтрокиОтчета);
			БюджетнаяОтчетностьКлиентСервер.УстановитьНовоеЗначение(СтрокаТаблицы.ПорядковыйНомер,ВыборкаПоказателей.ПорядковыйНомерСтроки);
			
		КонецЦикла;
		
		КодСтрокиОтчета = СтрокаТаблицы.КодСтрокиОтчета;
		ПорядковыйНомер = СтрокаТаблицы.ПорядковыйНомер;
		
		Если Контекст.мЧислоДопАналитик>0 и ЗначениеЗаполнено(ГруппаРаскрытия) Тогда
			
			РаскрытиеСтрок.Сбросить();
			Если Не РаскрытиеСтрок.НайтиСледующий(ГруппаРаскрытия,"ГруппаРаскрытия") Тогда
				Продолжить;
			КонецЕсли;
			
			ВыборкаРаскрытие = РаскрытиеСтрок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			ТекИндекс = 0;
			
			Пока ВыборкаРаскрытие.Следующий() Цикл
				
				Если ТекИндекс <> ВыборкаРаскрытие.Индекс Тогда
					
					СтрокаТаблицы = ТаблицаРезультат.Добавить();
					СтрокаТаблицы.Строка = Выборка.Строка;
					СтрокаТаблицы.КодСтрокиОтчета = КодСтрокиОтчета;
					СтрокаТаблицы.ПорядковыйНомер = ПорядковыйНомер;
					
					Для Сч = 1 По Контекст.мЧислоДопАналитик Цикл
						СтрокаТаблицы["Аналитика"+Сч] = ВыборкаРаскрытие["Аналитика"+Сч];
					КонецЦикла;
					ТекИндекс = ВыборкаРаскрытие.Индекс;
				КонецЕсли;
				
				СтрокаТаблицы[СокрП(ВыборкаРаскрытие.КодКолонки)] = ВыборкаРаскрытие.Значение;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРезультат.Колонки.Добавить("ДокОтчет",Новый ОписаниеТипов("ДокументСсылка.УниверсальныйРегламентированныйОтчет"));
	ТаблицаРезультат.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаРезультат.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контекст.ДокОтчет,"Организация,ИФО");
	
	Для Каждого СтрТЧ Из ТаблицаРезультат Цикл
		СтрТЧ.ДокОтчет = Контекст.ДокОтчет;
		ЗаполнитьЗначенияСвойств(СтрТЧ,РеквизитыДокумента);
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции // ПолучитьКроссТаблицуПоказателей()

Функция ПолучитьДанныеРаскрытия(Контекст, КодыСтрок = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(мПоказателиРаскрытия.Показатель КАК Справочник.ПоказателиОтчетов) КАК Показатель,
	|	мПоказателиРаскрытия.ГруппаРаскрытия КАК ГруппаРаскрытия,";
	
	Для Сч = 1 По Контекст.мЧислоДопАналитик Цикл
		
		Запрос.Текст = Запрос.Текст + "
		|	мПоказателиРаскрытия.Аналитика"+Сч+",";
		
	КонецЦикла;
	Запрос.Текст = Запрос.Текст + "
	|	мПоказателиРаскрытия.Значение,
	|	мПоказателиРаскрытия.Индекс
	|ПОМЕСТИТЬ ПоказателиРаскрытия
	|ИЗ
	|	&мПоказателиРаскрытия КАК мПоказателиРаскрытия";
	
	Если Не КодыСтрок = Неопределено Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	мПоказателиРаскрытия.Показатель.Строка.Код В(&КодыСтрок)";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("мПоказателиРаскрытия",Контекст.мПоказателиРаскрытия);
	
	Запрос.Выполнить();

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	мПоказателиРаскрытия.Показатель,
	|	мПоказателиРаскрытия.Показатель.Строка КАК Строка,
	|	мПоказателиРаскрытия.Показатель.Колонка КАК Колонка,
	|	мПоказателиРаскрытия.ГруппаРаскрытия КАК ГруппаРаскрытия,
	|	мПоказателиРаскрытия.Показатель.Строка.Код КАК КодСтроки,
	|	мПоказателиРаскрытия.Показатель.Колонка.Код КАК КодКолонки,";
	
	Для Сч = 1 По Контекст.мЧислоДопАналитик Цикл
		
		Запрос.Текст = Запрос.Текст + "
		|	мПоказателиРаскрытия.Аналитика"+Сч+",";
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|	мПоказателиРаскрытия.Значение,
	|	мПоказателиРаскрытия.Индекс
	|ИЗ
	|	ПоказателиРаскрытия КАК мПоказателиРаскрытия
	|УПОРЯДОЧИТЬ ПО
	|	мПоказателиРаскрытия.Индекс
	|ИТОГИ ПО
	| 	мПоказателиРаскрытия.ГруппаРаскрытия";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

//////////////////////////////////////////////////
// Генерация схемы источника - объединение наборов

// Получает схему компоновки источника данных на основании схем коспоновки наборов данных
//
// Параметры:
//  ШаблонСхемыОбъединение - Схема компоновки из макета "Объединение"
//  НаборыДанных - Массив наборов данных
//  ТаблицаСвязей - Таблица связей набора объединение с картами данных
//  СтруктураКартДанных - Структура с картами данных
//  ТекстСообщения - Строка для сообщений об ошибках
//
// Возвращаемое значение:
//  СхемаКомпоновкиОбъединение - Схема компоновки источника данных
//  Неопределено - есть ошибки
//
Функция ОбъединитьНаборы(Знач ШаблонСхемыОбъединение, Знач НаборыДанных, Знач ТаблицаСвязей, Знач СтруктураКартДанных, ТекстСообщения) Экспорт
	
	Если ТипЗнч(НаборыДанных) <> Тип("Массив") Тогда
		
		ТекстСообщения = НСтр("ru = 'Не определены наборы данных'");
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СхемаКомпоновкиОбъединение = ШаблонСхемыОбъединение;
	
	НаборОбъединение = СхемаКомпоновкиОбъединение.НаборыДанных.Объединение;
	
	МассивВыбранныхПолей = Новый Массив;
	
	Для каждого Набор Из НаборыДанных Цикл
		
		ШаблонСхемы = СкопироватьСхемуКомпоновки(Набор.НаборДанных);
		
		НаборШаблона = ШаблонСхемы.НаборыДанных.НаборДанных1;
		
		ЭлементНабора = НаборОбъединение.Элементы.Добавить(ТипЗнч(НаборШаблона)); //Тип("НаборДанныхЗапросСхемыКомпоновкиДанных")
		
		ЭлементНабора.Имя = Набор.Наименование;
		
		Если ТипЗнч(НаборШаблона) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			ОбработатьВидыСубконто(НаборШаблона.Запрос, Набор.Наименование);
			ЭлементНабора.АвтоЗаполнениеДоступныхПолей = Ложь;
			ЭлементНабора.Запрос = НаборШаблона.Запрос;
		ИначеЕсли ТипЗнч(НаборШаблона) = Тип("НаборДанныхОбъектСхемыКомпоновкиДанных") Тогда
			КодВидаОтчета = "";
			
			Если ЭлементНабора.Имя <> "ДанныеДля190_790" Тогда
				ЗначениеПараметра = Набор.НаборДанных.ВариантыНастроек.Основной.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПараметрДляВыбораДокументов"));
				Если ЗначениеПараметра <> Неопределено Тогда
					ПараметрДляВыбораДокументов = ЗначениеПараметра.Значение;
					ЭлементНабора.ИмяОбъекта = НаборШаблона.ИмяОбъекта+"_"+ПараметрДляВыбораДокументов;
				Иначе
					ЭлементНабора.ИмяОбъекта = НаборШаблона.ИмяОбъекта+"_"+Набор.Наименование;
				КонецЕсли;
			Иначе
				ЭлементНабора.ИмяОбъекта = НаборШаблона.ИмяОбъекта+"_"+Набор.Наименование;	
			КонецЕсли;
					
		КонецЕсли;
					
		ЭлементНабора.ИсточникДанных = СхемаКомпоновкиОбъединение.ИсточникиДанных.ИсточникДанных1.Имя;
		
		ЗаполнитьПоляСхемы(ЭлементНабора, НаборОбъединение, НаборШаблона.Поля, ШаблонСхемы.ВариантыНастроек.Основной.Настройки, Набор.Наименование);
		
		ЗаполнитьПоляРесурсов(ЭлементНабора, НаборОбъединение, ШаблонСхемы.ПоляИтога, СхемаКомпоновкиОбъединение.ПоляИтога, Набор.Наименование);
		
		ЗаполнитьПараметрыСхемы(ШаблонСхемы, СхемаКомпоновкиОбъединение, Набор.Наименование);
		
		КомпоновщикНастроекШаблона = Новый КомпоновщикНастроекКомпоновкиДанных;
		ИсточникНастроекШаблона = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(ШаблонСхемы));
		КомпоновщикНастроекШаблона.Инициализировать(ИсточникНастроекШаблона);
		КомпоновщикНастроекШаблона.ЗагрузитьНастройки(ШаблонСхемы.ВариантыНастроек.Основной.Настройки);
		НастройкиШаблона = КомпоновщикНастроекШаблона.ПолучитьНастройки();
		
		НастройкиСхемыОбъединение = СхемаКомпоновкиОбъединение.ВариантыНастроек.Основной.Настройки;
		
		ЗаполнитьНастрокиСхемы(НастройкиСхемыОбъединение, НастройкиШаблона.Выбор.Элементы, СхемаКомпоновкиОбъединение.Параметры, МассивВыбранныхПолей);
		
		СкопироватьОтборСКД(ЭлементНабора.Поля, НаборШаблона.Поля, НастройкиСхемыОбъединение.Отбор.Элементы, НастройкиШаблона.Отбор.Элементы, Набор.Наименование);
		
	КонецЦикла;
	
	Если СоединитьСКартамиДанных(ТаблицаСвязей, СтруктураКартДанных, СхемаКомпоновкиОбъединение, ТекстСообщения) Тогда
		
		Возврат СхемаКомпоновкиОбъединение;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Получает структуру дополнительных параметров для выполнения правила заполнения
// Получаются общие параметры правила заполнения, соединяются с дополнительными параметрами отчетного документа
// Если в документе значение не задано, то берется значение по умолчанию общего параметра
// Если передается структура переопределенных параметров, то значения заполняются по соотв. ключам
//
// Параметры:
//  ДокументСсылка - ссылка на документ "Универсальный регламентированный отчет"
//  ВидОтчета - Ссылка на вид отчета
//  ПравилоЗаполнения - Ссылка на правило заполнения
//  СтруктураПереопределенныхПараметров - Структура параметров определенных в форме "НастройкаЗаполнения"
//  СтруктураПараметровДокумента - Структура дополнительных параметров документа
//
// Возвращаемое значение:
//  ДополнительныеПараметры - Структура дополнительных параметров
//
Функция ПодготовитьСтруктуруПараметров(Знач ДокументСсылка, Знач ВидОтчета, Знач ПравилоЗаполнения, Знач СтруктураПереопределенныхПараметров = Неопределено, Знач СтруктураПараметровДокумента = Неопределено, СоответствиеПолейИДопРеквизитов = Неопределено) Экспорт
	
	// Заполнение общих параметров правила
	ДополнительныеПараметры = Новый Структура;
	
	СоответствиеПолейИДопРеквизитов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПравилаЗаполненияОбщиеПараметры.ИмяПараметра,
		|	ПравилаЗаполненияОбщиеПараметры.ВидАналитики,
		|	ПравилаЗаполненияОбщиеПараметры.ВидАналитики.Код,
		|	ПравилаЗаполненияОбщиеПараметры.ЗначениеПараметра,
		|	ПравилаЗаполненияОбщиеПараметры.ПользовательскаяДоступность
		|ПОМЕСТИТЬ ПравилаЗаполненияОбщиеПараметры
		|ИЗ
		|	Справочник.ПравилаЗаполнения.ОбщиеПараметры КАК ПравилаЗаполненияОбщиеПараметры
		|ГДЕ
		|	ПравилаЗаполненияОбщиеПараметры.Ссылка = &ПравилоЗаполнения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеРеквизитыОтчетов.Код КАК ДополнительныйРеквизитКод,
		|	ДополнительныеРеквизитыОтчетов.ВидАналитики
		|ПОМЕСТИТЬ ДополнительныеРеквизитыОтчетов
		|ИЗ
		|	Справочник.ДополнительныеРеквизитыОтчетов КАК ДополнительныеРеквизитыОтчетов
		|ГДЕ
		|	ДополнительныеРеквизитыОтчетов.Владелец = &ВидОтчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПравилаЗаполненияОбщиеПараметры.ИмяПараметра,
		|	ПравилаЗаполненияОбщиеПараметры.ВидАналитики,
		|	ПравилаЗаполненияОбщиеПараметры.ВидАналитикиКод,
		|	ПравилаЗаполненияОбщиеПараметры.ЗначениеПараметра,
		|	ПравилаЗаполненияОбщиеПараметры.ПользовательскаяДоступность,
		|	ЕСТЬNULL(ДополнительныеРеквизитыОтчетов.ДополнительныйРеквизитКод, """") КАК ДополнительныйРеквизитКод
		|ИЗ
		|	ПравилаЗаполненияОбщиеПараметры КАК ПравилаЗаполненияОбщиеПараметры
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДополнительныеРеквизитыОтчетов КАК ДополнительныеРеквизитыОтчетов
		|		ПО ПравилаЗаполненияОбщиеПараметры.ВидАналитики = ДополнительныеРеквизитыОтчетов.ВидАналитики";
	
	Запрос.УстановитьПараметр("ВидОтчета", ВидОтчета);
	Запрос.УстановитьПараметр("ПравилоЗаполнения", ПравилоЗаполнения);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ДополнительныйРеквизитКод) Тогда
			СоответствиеПолейИДопРеквизитов.Вставить(Выборка.ИмяПараметра,Выборка.ДополнительныйРеквизитКод);
		КонецЕсли;
		
		Значение = Неопределено;
		Если НЕ ПустаяСтрока(Выборка.ДополнительныйРеквизитКод) 
			И ТипЗнч(СтруктураПараметровДокумента) = Тип("Структура")
			И СтруктураПараметровДокумента.Свойство(Выборка.ДополнительныйРеквизитКод, Значение)
			И ЗначениеЗаполнено(Значение) Тогда
			
			ЗначениеПараметра = Значение;
			
		Иначе
			
			ЗначениеПараметра = Выборка.ЗначениеПараметра;
			
		КонецЕсли;
		
		ДополнительныеПараметры.Вставить(Выборка.ИмяПараметра, ЗначениеПараметра);
		
	КонецЦикла;
	
	Если ТипЗнч(СтруктураПереопределенныхПараметров) = Тип("Структура") Тогда
		
		Для каждого КлючИЗначение Из СтруктураПереопределенныхПараметров Цикл
			
			ДополнительныеПараметры.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

// Получает значение вложенного реквизита по пути с разделителями "." путем рекурсии
//
// Параметры:
//  Элемент - Ссылка на объект
//  ПутьДоРеквизита - путь до реквизита с разделителями "."
//
// Возвращаемое значение:
//  Значение реквизита - если он найден
//  Неопределено - если реквизит не найден
//
Функция ПолучитьЗначениеВложенногоРеквизита(Знач Элемент, Знач ПутьДоРеквизита) Экспорт
	
	Поз = Найти(ПутьДоРеквизита, ".");
	Если НЕ ЗначениеЗаполнено(Элемент) ИЛИ ПустаяСтрока(ПутьДоРеквизита) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если Поз = 0 Тогда
		
		ИмяРеквизита = ПутьДоРеквизита;
		ПутьДоРеквизита = "";
		
	Иначе
		
		ИмяРеквизита = Сред(ПутьДоРеквизита, 1, Поз - 1);
		ПутьДоРеквизита = Сред(ПутьДоРеквизита, Поз + 1);
		
	КонецЕсли;
	
	Попытка
		
		Значение =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент, ИмяРеквизита);
		
	Исключение
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Если НЕ ПустаяСтрока(ПутьДоРеквизита) Тогда
		
		Значение = ПолучитьЗначениеВложенногоРеквизита(Значение, ПутьДоРеквизита);
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Получает массив обязательных колонок схемы заполнения
//
// Параметры:
//  ВидСхемыЗаполнения - Строка, вид схемы заполнения: горизонтальная, вертикальная
//  ВернутьСтрокой - Признак того, что возвращаеся строка с разделителями ","
//
// Возвращаемое значение:
//  фиксированный массив - имена предопределенных колонок, если ВернутьСтрокой = Ложь
//  строка с разделителями "," - имена предопределенных колонок, если ВернутьСтрокой = Истина
//
Функция ПолучитьКолонкиСхемыЗаполнения(Знач ВидСхемыЗаполнения, Знач ВернутьСтрокой = Ложь) Экспорт
	
	МассивКолонок = Новый Массив;
	
	Если ВидСхемыЗаполнения = "Вертикальная" Тогда
		
		МассивКолонок.Добавить("Строка");
		МассивКолонок.Добавить("ТипГруппировкиГрафа");
		МассивКолонок.Добавить("Графа");
		МассивКолонок.Добавить("ТипГруппировкиСтрока");
		МассивКолонок.Добавить("Значение");
		МассивКолонок.Добавить("АгрегатнаяФункцияЗначение");
		МассивКолонок.Добавить("Расшифровка");
		МассивКолонок.Добавить("НастройкиОткрытияТиповыхОтчетов");
		МассивКолонок.Добавить("Отключить");
		
	ИначеЕсли ВидСхемыЗаполнения = "Горизонтальная" Тогда
		
		МассивКолонок.Добавить("Строка");
		МассивКолонок.Добавить("ТипГруппировкиСтрока");
		МассивКолонок.Добавить("Отключить");
		
	КонецЕсли;
	
	Если ВернутьСтрокой Тогда
		
		СтрокаКолонок = "";
		
		Для каждого ИмяКолонки Из МассивКолонок Цикл
			
			СтрокаКолонок = СтрокаКолонок + ?(ПустаяСтрока(СтрокаКолонок), "", ",") + ИмяКолонки;
			
		КонецЦикла;
		
		Возврат СтрокаКолонок;
		
	Иначе
		
		Возврат Новый ФиксированныйМассив(МассивКолонок);
		
	КонецЕсли;
	
КонецФункции // ПолучитьСтруктуруКолонокСхемыЗаполнения()

// Получает компоновщик настроек десериализацией сохраненного в текст значения
//
// Параметры:
//  АдресКомпоновщикаНастроек - Строка, адрес во временном хранилище
//
// Возвращаемое значение:
//  КомпоновщикНастроек - компоновщик настроек компоновки данных
//
Функция ПолучитьКомпоновщикНастроек(АдресКомпоновщикаНастроек) Экспорт
	
	КомпоновщикНастроек = Неопределено;
	
	Если ЭтоАдресВременногоХранилища(АдресКомпоновщикаНастроек) Тогда
		
		СериализованноеЗначение = ПолучитьИзВременногоХранилища(АдресКомпоновщикаНастроек);
		
		Если ТипЗнч(СериализованноеЗначение) = Тип("Строка") И НЕ ПустаяСтрока(СериализованноеЗначение) Тогда
			
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(СериализованноеЗначение);
			
			Значение = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
			Если ТипЗнч(Значение) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
				
				КомпоновщикНастроек = Значение;
				
			КонецЕсли;
			
			ЧтениеXML.Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КомпоновщикНастроек;
	
КонецФункции

// Получает таблицу плана счетов в которой каждому счету соответствует родительский счет с учетом всей иерархии
// с опциональным отбором по списку счетов
//
// Параметры:
//  МассивСчетов - массив счетов для отбора
//
// Возвращаемое значение:
//  Таблица значений с колонками:
//     Ссылка - Ссылка на счет
//     Родитель - Ссылка на родительский счет, если счет первого уровня, то ссылка на счет
//
Функция ПолучитьИерархиюПланаСчетов(МассивСчетов = Неопределено) Экспорт
	
	Возврат ПолучитьИерархиюСчетов(МассивСчетов, "ПланСчетов.ЕПСБУ", Истина);
	
КонецФункции

// Получает таблицу плана счетов в которой каждому счету соответствует родительский счет
// В выборку попадают только подчиненные счета
//
// Параметры:
//  МассивСчетов - массив счетов для отбора
//
// Возвращаемое значение:
//  Таблица значений с колонками:
//     Ссылка - Ссылка на счет
//     Родитель - Ссылка на родительский счет, если счет первого уровня, то ссылка на счет
//
Функция ПолучитьИерархиюПодчиненныхСчетов(МассивСчетов, ИмяТаблицы = "ПланСчетов.ЕПСБУ") Экспорт
	
	Возврат ПолучитьИерархиюСчетов(МассивСчетов, ИмяТаблицы, Истина, Истина, Истина, Ложь, Истина);
	
КонецФункции

Функция ПолучитьПолнуюИерархиюПодчиненныхСчетов(МассивСчетов, ИмяТаблицы = "ПланСчетов.ЕПСБУ") Экспорт
	
	Возврат ПолучитьИерархиюСчетов(МассивСчетов,ИмяТаблицы, Истина, Истина, Ложь, Ложь, Истина);
	
КонецФункции

///////////////////////////////////////////////////////////
// Генерация вычисляемых полей на основании схемы запонения

// Получает схему компоновки области заполнения на основании схемы источника данных и схемы заполнения
//
// Параметры:
//  СхемаИсточника - схема компоновки источника
//  ТаблицаСхемаЗаполнения - таблица значений схемы заполнения, каждая строка группировка,
//                         - каждое поле - вычисляемое поле СКД
//  ТаблицаСхемыСвязей - таблица значений, описывает связи набора объединение источника даннх и карт данных
//  ВидСхемыЗаполнения - Строка, вид схемы заполения: горизонтальная или вертикальная
//
// Возвращаемое значение:
//  СхемаКомпоновки - схема компоновки области заполнения
//
Функция ПолучитьСхемуКомпоновки(Знач СхемаИсточника, Знач ТаблицаСхемаЗаполнения, Знач ТаблицаСхемыСвязей, Знач ВидСхемыЗаполнения) Экспорт
	
	Если ТипЗнч(СхемаИсточника) <> Тип("СхемаКомпоновкиДанных") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СхемаКомпоновки = СкопироватьСхемуКомпоновки(СхемаИсточника);
	
	СхемаКомпоновки.ПоляИтога.Очистить();
	
	НастройкиСхемы = СхемаКомпоновки.ВариантыНастроек.Основной.Настройки;
	НастройкиСхемы.Структура.Очистить();
	НастройкиСхемы.Выбор.Элементы.Очистить();
	
	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновки));
	
	КомпоновшикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновшикНастроек.Инициализировать(Источник);
	КомпоновшикНастроек.ЗагрузитьНастройки(НастройкиСхемы);
	
	Настройки = КомпоновшикНастроек.ПолучитьНастройки();
	
	ВычисляемыеПоля = СхемаКомпоновки.ВычисляемыеПоля;
	ДоступныеПоля = Настройки.ДоступныеПоляВыбора;
	
	ВычисляемыеПоля.Очистить();
	
	НомераПолей = Новый Соответствие;
	
	Если ТаблицаСхемаЗаполнения.Колонки.Найти("Отключить") = Неопределено Тогда
		ТаблицаСхемаЗаполнения.Колонки.Добавить("Отключить",Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ТаблицаСхемаЗаполнения Цикл
		
		Если СтрокаТаблицы.Отключить = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяГруппировка = Неопределено;
		ПутьКДанным = Неопределено;
		ГруппировкаИЛИ = Неопределено;
		
		Для каждого КолонкаТаблицы Из ТаблицаСхемаЗаполнения.Колонки Цикл
			
			// Значение агрегатной функции и группировки учитывается при обработке колонки "Значение"
			Если Лев(КолонкаТаблицы.Имя, 17) = "АгрегатнаяФункция" 
				ИЛИ Лев(КолонкаТаблицы.Имя, 14) = "ТипГруппировки"
				ИЛИ КолонкаТаблицы.Имя = "Отключить" Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Формула = СокрЛП(СтрокаТаблицы[КолонкаТаблицы.Имя]);
			
			Если НЕ ПустаяСтрока(Формула) Тогда
				
				Если ВидСхемыЗаполнения = "Вертикальная" И КолонкаТаблицы.Имя = "Значение" Тогда
					
					АгрегатнаяФункция = СтрокаТаблицы.АгрегатнаяФункцияЗначение;
					
				Иначе
					
					АгрегатнаяФункция = Неопределено;
					
				КонецЕсли;
				
				Если ВидСхемыЗаполнения = "Горизонтальная" Тогда
					
					ИмяКолонкиАгрегатнаяФункция = "АгрегатнаяФункция" + КолонкаТаблицы.Имя;
					КолонкаАгрегатнаяФункция = ТаблицаСхемаЗаполнения.Колонки.Найти(ИмяКолонкиАгрегатнаяФункция);
					Если КолонкаАгрегатнаяФункция <> Неопределено Тогда
						
						АгрегатнаяФункция = СтрокаТаблицы[ИмяКолонкиАгрегатнаяФункция];
						
					Иначе
						
						АгрегатнаяФункция = Неопределено;
						
					КонецЕсли;
					
				КонецЕсли;
				
				ИмяКолонкиТипГруппировки = "ТипГруппировки" + КолонкаТаблицы.Имя;
				КолонкаТип = ТаблицаСхемаЗаполнения.Колонки.Найти(ИмяКолонкиТипГруппировки);
				Если КолонкаТип <> Неопределено Тогда
					
					ТипГруппировки = СтрокаТаблицы[ИмяКолонкиТипГруппировки];
					
				Иначе
					
					ТипГруппировки = Неопределено;
					
				КонецЕсли;				
								
				ТребуетсяВП = Истина;
				Если ТипГруппировки = "Иерархия" ИЛИ ТипГруппировки = "Только иерархия" Тогда
					// Поля обязательно должно найтись, иначе будет ошибка, 
					// т.к. построение иерархии для вычисляемых полей в платформе не работает.
					Поле = ДоступныеПоля.НайтиПоле(Новый ПолеКомпоновкиДанных(Формула));
					Если Поле <> Неопределено Тогда
						ПутьКДанным = Строка(Поле.Поле);
						ТребуетсяВП = Ложь;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ТребуетсяВП Тогда
					// Всегда используем вычисляемые поля для нормальной работы СКД на 8.3
					// Определение очередного номера имени поля, так как в разных строках по одной колонке могут быть разные поля
					Номер = НомераПолей[КолонкаТаблицы.Имя];
					
					Если Номер = Неопределено Тогда
						Номер = 0;
						ПутьКДанным = КолонкаТаблицы.Имя;
					Иначе
						Номер = Номер + 1;
						ПутьКДанным = КолонкаТаблицы.Имя + Номер;
					КонецЕсли;
					
					НомераПолей.Вставить(КолонкаТаблицы.Имя, Номер);
					
					// Создание вычисляемого поля
					ВычисляемоеПоле = ВычисляемыеПоля.Добавить();
					ВычисляемоеПоле.Выражение = Формула;
					ВычисляемоеПоле.Заголовок = КолонкаТаблицы.Имя;
					ВычисляемоеПоле.ПутьКДанным = ПутьКДанным;
				КонецЕсли;
									
				Если НоваяГруппировка = Неопределено Тогда
					
					// Создание группировки
					НоваяГруппировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
					НоваяГруппировка.Использование = Истина;
					
					НоваяГруппировка.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
					
				КонецЕсли;
				
				// Добавление поля в отбор группировки
				Если ВидСхемыЗаполнения = "Горизонтальная" И ГруппировкаИЛИ = Неопределено Тогда
					
					ГруппировкаИЛИ = НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
					ГруппировкаИЛИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
					
				КонецЕсли;
				
				// Для колонки добавляем поле в ресурсы если заполнена соответствующая агрегатная функция
				// иначе создаем поле группировки и добавляем поля в выбранные
				Если АгрегатнаяФункция <> Неопределено И АгрегатнаяФункция <> "Нет" И НЕ ПустаяСтрока(АгрегатнаяФункция) Тогда
					
					Если СхемаКомпоновки.ПоляИтога.Найти(ПутьКДанным) = Неопределено Тогда
						
						ПолеИтога = СхемаКомпоновки.ПоляИтога.Добавить();
						ПолеИтога.Выражение = ПрименитьАгрегатнуюФункцию(ПутьКДанным, АгрегатнаяФункция);
						ПолеИтога.ПутьКДанным = ПутьКДанным;
						
					КонецЕсли;
					
					// Добавление поля в отбор группировки
					Если ВидСхемыЗаполнения = "Горизонтальная" Тогда
						
						КоллекцияОтбора =  ГруппировкаИЛИ.Элементы;
						
					Иначе
						
						КоллекцияОтбора = НоваяГруппировка.Отбор.Элементы;
						
					КонецЕсли;
					
					ДобавлятьОтбор = Истина;
					
					Для каждого ЭлементОтбора Из КоллекцияОтбора Цикл
						
						Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКДанным)
							И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
							
							ДобавлятьОтбор = Ложь;
							
							Прервать;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если ДобавлятьОтбор Тогда
						
						Если ГруппировкаИЛИ <> Неопределено Тогда
							
							ГруппировкаИЛИ.Использование = Истина;
							
						КонецЕсли;
						
						ПолеОтбораЗначения = КоллекцияОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
						ПолеОтбораЗначения.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКДанным);
						ПолеОтбораЗначения.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
						ПолеОтбораЗначения.Использование = Истина;
						
					КонецЕсли;
					
				Иначе
					
					НовоеПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
					НовоеПолеГруппировки.Использование = Истина;
					НовоеПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ПутьКДанным);
					
					Если ТипГруппировки = "Иерархия" Тогда
						НовоеПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
					ИначеЕсли ТипГруппировки = "Только иерархия" Тогда
						НовоеПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия;
					Иначе
						НовоеПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
					КонецЕсли;
					
				КонецЕсли;
				
				// Добавление нового поля в выбранные
				ПолеВыбора = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				ПолеВыбора.Поле = Новый ПолеКомпоновкиДанных(ПутьКДанным);
				ПолеВыбора.Заголовок = КолонкаТаблицы.Имя;
				ПолеВыбора.Использование = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаполнениеОтчетностиСервер.СкопироватьНастройкиКомпоновкиДанных(НастройкиСхемы, Настройки);
	
	Возврат СхемаКомпоновки;
	
КонецФункции

// Получает таблицу открытия стандартных отчетов для расшифровки, заданную при настройке схемы заполнения
//
// Параметры:
//  Настройки - Строка сериализованных настроек
//  мДиспетчерXDTO - обработка "ДиспетчерСериализации"
//
// Возвращаемое значение:
//  ТаблицаНастроек - таблица значений с настройками
//
Функция ПолучитьТаблицуНастроекОткрытияТиповыхОтчетов(Знач Настройки, мДиспетчерXDTO = Неопределено, ДополнятьСчета = Ложь) Экспорт
	
	ТаблицаНастроек = Новый ТаблицаЗначений;
	
	Если ПустаяСтрока(Настройки) Тогда
		Возврат ТаблицаНастроек;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Настройки) И Лев(Настройки, 1) = """" Тогда
		Настройки = Сред(Настройки, 2);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Настройки) И Прав(Настройки, 1) = """" Тогда
		Настройки = Сред(Настройки, 1, СтрДлина(Настройки) - 1);
	КонецЕсли;
	
	Настройки = СтрЗаменить(Настройки, """""", """");
	
	ДиспетчерСериализации = Обработки.СериализацияПравилаЗаполненияОтчетности.Создать();
	ДиспетчерСериализации.мДиспетчерXDTO = мДиспетчерXDTO;
	
	ТаблицаНастроек = ДиспетчерСериализации.ВосстановитьТаблицуНастроекДетализацииСтандартнымиОтчетами(Настройки, ДополнятьСчета);
	
	// Сохранение инициализированного диспетчера сериализации
	мДиспетчерXDTO = ДиспетчерСериализации.мДиспетчерXDTO;
	
	Возврат ТаблицаНастроек;
	
КонецФункции

// Получает схему компоновки набора источника данных с учетом заданных отборов по видам субконто
//
// Параметры:
//  СхемаКомпоновки - целевая схема компоновки (или адрес во временном хранилище)
//                  - настройки храняться в основном варианте
//
// Возвращаемое значение:
//  Схема компоновки - если передана схема компоновки
//  Адрес во временном хранилище - если передан адрес
//
Процедура ПрименитьНастройкиКСхемеКомпоновки(СхемаКомпоновки) Экспорт
	
	Если ТипЗнч(СхемаКомпоновки) = Тип("СхемаКомпоновкиДанных") Тогда
		
		Схема = СхемаКомпоновки;
		
	Иначе
		
		Схема = ПолучитьИзВременногоХранилища(СхемаКомпоновки);
		
	КонецЕсли;
	
	МаксимальноеКоличествоСубконто = ЗаполнениеОтчетностиСерверПереопределяемый.МаксимальноеКоличествоСубконто();
	ТипПустогоЗначенияСубконто = Новый ОписаниеТипов(Неопределено);
	
	НастройкиПараметрыДанных = Схема.ВариантыНастроек.Основной.Настройки.ПараметрыДанных;
	
	Для каждого ПараметрДанных Из НастройкиПараметрыДанных.Элементы Цикл
		
		ВидСубконто = Строка(ПараметрДанных.Параметр);
		
		Если ВидСубконто = "ВидыСубконто" Тогда
			ИмяПоля = "Субконто";
		ИначеЕсли ВидСубконто = "ВидыКорСубконто" Тогда
			ИмяПоля = "КорСубконто";
		ИначеЕсли ВидСубконто = "ВидыСубконтоДт" Тогда
			ИмяПоля = "СубконтоДт";
		ИначеЕсли ВидСубконто = "ВидыСубконтоКт" Тогда
			ИмяПоля = "СубконтоКт";
		Иначе
			Продолжить;
		КонецЕсли;
		
		ЗначениеПараметра = ПараметрДанных.Значение;
		Если ТипЗнч(ЗначениеПараметра) = Тип("СписокЗначений") Тогда
			
			ЭтоСписокЗначений = Истина;
			КоличествоЗаданныхВидовСубконто = ЗначениеПараметра.Количество();
			
		ИначеЕсли ТипЗнч(ЗначениеПараметра) = ЗаполнениеОтчетности.ПолучитьТипСсылкиВидыСубконто() Тогда
			
			ЭтоСписокЗначений = Ложь;
			КоличествоЗаданныхВидовСубконто = 1;
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		Для НомСубконто = 1 По МаксимальноеКоличествоСубконто Цикл
			
			ИмяСубконто = ИмяПоля + НомСубконто;
			
			Если КоличествоЗаданныхВидовСубконто = 0 Тогда
				
				Использование = Истина;
				
			Иначе
				
				Использование = НомСубконто <= КоличествоЗаданныхВидовСубконто;
				
			КонецЕсли;
			
			ПолеНабора = Схема.НаборыДанных.НаборДанных1.Поля.Найти(ИмяСубконто);
			
			ПолеНабора.ОграничениеИспользования.Группировка = НЕ Использование;
			ПолеНабора.ОграничениеИспользования.Поле = НЕ Использование;
			ПолеНабора.ОграничениеИспользования.Порядок = НЕ Использование;
			ПолеНабора.ОграничениеИспользования.Условие = НЕ Использование;
			
			ПолеНабора.ОграничениеИспользованияРеквизитов.Группировка = НЕ Использование;
			ПолеНабора.ОграничениеИспользованияРеквизитов.Поле = НЕ Использование;
			ПолеНабора.ОграничениеИспользованияРеквизитов.Порядок = НЕ Использование;
			ПолеНабора.ОграничениеИспользованияРеквизитов.Условие = НЕ Использование;
			
			Если Использование И КоличествоЗаданныхВидовСубконто <> 0 Тогда
				
				Если ЭтоСписокЗначений Тогда
					
					Субконто = ЗначениеПараметра[НомСубконто - 1].Значение;
					
				Иначе
					
					Субконто = ЗначениеПараметра;
					
				КонецЕсли;
				
				СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Субконто,"ИмяПредопределенныхДанных,Представление, ТипЗначения");//ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Субконто,"Представление, ТипЗначения");
				
				Если ЗначениеЗаполнено(СтруктураРеквизитов.ИмяПредопределенныхДанных) Тогда
					ПолеНабора.Заголовок = СтруктураРеквизитов.ИмяПредопределенныхДанных;
				Иначе
					ПолеНабора.Заголовок = БюджетнаяОтчетность.СформироватьКодНаОснованииНаименования(СтруктураРеквизитов.Представление);
				КонецЕсли;
				
				ПолеНабора.ТипЗначения = СтруктураРеквизитов.ТипЗначения;
				
			Иначе
				
				ПолеНабора.Заголовок = "";
				ПолеНабора.ТипЗначения = ТипПустогоЗначенияСубконто;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ТипЗнч(СхемаКомпоновки) = Тип("СхемаКомпоновкиДанных") Тогда
		
		СхемаКомпоновки = Схема;
		
	Иначе
		
		СхемаКомпоновки = ПоместитьВоВременноеХранилище(Схема, СхемаКомпоновки);
		
	КонецЕсли;
	
КонецПроцедуры

// Проверка формул вычисляемых полей
//
// Параметры:
//  ТекстФормулы - Строка, описывает текст формулы для проверки
//  МассивВызововОбщихМодулей - Массив, содержит вызовы общих модулей данной конфигурации
//  МассивРазрешенныеВызовыОбщихМодулей - Массив, содержит разрешенные вызовы
//                                      - массив определен в разделе "Функции общих модулей" макета "СправочнаяИнформацияПоМетодам"
//  МинимальнаяДлинаВызова - Число, определяющее минимальную длину строки из всех вызовов общих модулей
//  СтрокаСообщения - Строка, для сообщений об ошибках в родительский контекст
//
// Возвращаемое значение:
//  Истина - проверка прошла успешно, нет запрещенных вызовов
//  Ложь - выявлены запрещенные вызовы общих модулей
//
Функция ПроверитьФормулу(Знач ТекстФормулы, Знач МассивВызововОбщихМодулей = Неопределено, Знач МассивРазрешенныеВызовыОбщихМодулей = Неопределено, Знач МинимальнаяДлинаВызова = Неопределено, СтрокаСообщения = "") Экспорт
	
	ТекстФормулы = СокрЛП(НРег(ТекстФормулы));
	
	Если МассивВызововОбщихМодулей = Неопределено 
		И МассивРазрешенныеВызовыОбщихМодулей = Неопределено Тогда
		
		ЗапрещенныеВызовыОбщихМодулей = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьВызовыОбщихМодулей(,,,,,,,,Истина);
		
	Иначе
		
		Если ТипЗнч(МассивВызововОбщихМодулей) <> Тип("Массив") Тогда
			
			МассивВызововОбщихМодулей = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьВызовыОбщихМодулей();
			
		КонецЕсли;
		
		Если ТипЗнч(МассивРазрешенныеВызовыОбщихМодулей) <> Тип("Массив") Тогда
			
			МассивРазрешенныеВызовыОбщихМодулей =ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьРазрешенныеВызовыОбщихМодулей()
			
		КонецЕсли;
		
		
		ЗапрещенныеВызовыОбщихМодулей = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивВызововОбщихМодулей, МассивРазрешенныеВызовыОбщихМодулей);

	КонецЕсли;	
		
	Если ТипЗнч(МинимальнаяДлинаВызова) <> Тип("Число") Тогда
		
		МинимальнаяДлинаВызова = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьМинимальнуюДлинуВызова();
		
	КонецЕсли;
	
	
	Если СтрДлина(ТекстФормулы) <= МинимальнаяДлинаВызова Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	ТекстФормулы = СтрЗаменить(ТекстФормулы, Символы.ВК," ");
	ТекстФормулы = СтрЗаменить(ТекстФормулы, Символы.ВТаб," ");
	ТекстФормулы = СтрЗаменить(ТекстФормулы, Символы.НПП," ");
	ТекстФормулы = СтрЗаменить(ТекстФормулы, Символы.ПС," ");
	ТекстФормулы = СтрЗаменить(ТекстФормулы, Символы.ПФ," ");
	ТекстФормулы = СтрЗаменить(ТекстФормулы, Символы.Таб," ");
	Пока Найти(ТекстФормулы, "  ") <> 0 Цикл
		ТекстФормулы = СтрЗаменить(ТекстФормулы, "  "," ");
	КонецЦикла;
	ТекстФормулы = СтрЗаменить(ТекстФормулы, "( ","(");
	ТекстФормулы = СтрЗаменить(ТекстФормулы, " (","(");
	
	ТекстФормулы = НРег(ТекстФормулы);
	
	// Поиск метода Выполнить
	ВызовНайден = Ложь;
	НачПоз = 1;
	Пока Истина Цикл
		
		Поз = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстФормулы, "выполнить(", НачПоз);
		Если Поз = 0 Тогда
			Поз = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстФормулы, "execute(", НачПоз);
		КонецЕсли;
		
		Если Поз = 0 Тогда
			
			ВызовНайден = Ложь;
			Прервать;
			
		КонецЕсли;
		
		Если Поз = 1 Тогда
			
			ВызовНайден = Истина;
			Прервать;
			
		Иначе
			
			ПредыдущийСимвол = Сред(ТекстФормулы, Поз - 1, 1);
			
			Если Найти(" ([{,;", ПредыдущийСимвол) Тогда
				
				ВызовНайден = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НачПоз = Поз + 1;
		
	КонецЦикла;
	
	Если ВызовНайден Тогда
		
		СтрокаСообщения = НСтр("ru = 'Использование функции ""Выполнить"" запрещено!'");
		
		Возврат Ложь;
		
	КонецЕсли;
	
	// Поиск прочих методов
	Поз = Найти(ТекстФормулы, ".");
	Если Поз = 0 Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	// Пременная не может иметь имя совпадающее с именем общего модуля
	Для каждого ТекстВызова Из ЗапрещенныеВызовыОбщихМодулей Цикл
		
		Если Найти(ТекстФормулы, ТекстВызова) = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаСообщения = НСтр("ru = 'В формуле обнаружены вызовы недоступных методов общих модулей.'");
		Возврат Ложь;
		
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Получает макет проверки области заполнения или источника области заполнения
//
// Параметры:
//  Схема - Проверяемая схема компоновки
//  СтруктураПараметров - Обшие параметры правила заполенения
//  КартыДанных - Коллекция карт данных
//
// Возвращаемое значение:
//  ТабличныйДокумент - готовый для отображения табличный документ
//
Функция СкомпоноватьТабличныйДокумент(Знач Схема, Знач СтруктураПараметров, Знач КартыДанных) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Если ТипЗнч(Схема) = Тип("СхемаКомпоновкиДанных") Тогда
		
		СтруктураАдресов = ДобавитьКартыДанныхВСхему(КартыДанных, Схема);
		
		ЗаполнитьПараметрыИзДокумента(Схема, СтруктураПараметров);
		
		// Здесь нужно инициализировать отчеты и получить по ним кросс таблицу, добавить в ПроцессорКомпоновкиДанных внешние наборы
		// если же не заданы параметры ссылок на отчеты, нужно передавать пустые таблицы по виду отчета
		СоответствиеДанных = Новый Соответствие;
		
		МассивИменПараметров = Новый Массив;
		Для Каждого ТекПараметр Из Схема.Параметры Цикл
			Если Лев(ТекПараметр.Имя,13)= "КодВидаОтчета" Тогда	
				ИмяНабора = Сред(ТекПараметр.Имя,15);
				КодВидаОтчета = ТекПараметр.Значение;
				
				ТекНастройка = СоответствиеДанных.Получить(ИмяНабора);
				Если ТекНастройка=Неопределено Тогда
					ТекНастройка = Новый Структура;
				КонецЕсли;
				ТекНастройка.Вставить("КодВидаОтчета",КодВидаОтчета);
				СоответствиеДанных.Вставить(ИмяНабора,ТекНастройка);
			ИначеЕсли Лев(ТекПараметр.Имя,27)= "ПараметрДляВыбораДокументов" Тогда	
				ИмяНабора = Сред(ТекПараметр.Имя,29);
				ИмяПараметраДляДокументов = ТекПараметр.Значение;
				
				ТекНастройка = СоответствиеДанных.Получить(ИмяНабора);
				Если ТекНастройка=Неопределено Тогда
					ТекНастройка = Новый Структура;
				КонецЕсли;
				
				ТекНастройка.Вставить("ИмяПараметраДляДокументов",ИмяПараметраДляДокументов);
						
				ТекПараметрДокументов = Схема.Параметры.Найти(ИмяПараметраДляДокументов);
				
				Если ТекПараметрДокументов <>Неопределено Тогда
					ТекНастройка.Вставить("ЗначениеПараметраДляДокументов",ТекПараметрДокументов.Значение);
				КонецЕсли;
				
				СоответствиеДанных.Вставить(ИмяНабора,ТекНастройка);
				
				МассивИменПараметров.Добавить(ИмяПараметраДляДокументов);
				
				//Заполнить первоначальные внешние источники пустыми таблицами
				КартыДанных.Вставить("ДанныеВыборки_"+ИмяПараметраДляДокументов,Новый ТаблицаЗначений);
			КонецЕсли;
		КонецЦикла;
		
		Если СоответствиеДанных.Количество()>0 Тогда
			ИнициализироватьВнешниеНаборыДанных(СоответствиеДанных,КартыДанных);
		КонецЕсли;
		
		//Инициализация внешних наборов данных для шаблонов:
		// "РазвернутыеОстатки", 
		// "РазвернутыеОстаткиИОборотыДенНеденСчетов", 
		// "РазвернутыеОстИОбКЭК",
		// "РазвернутыеОстИОбКЭКСегменты",
		// "Долгосрочная", 
		// "ДолгосрочнаяКЭК", 
		// "Просроченная",
		// "ПросроченнаяКЭК",      
		// "ИсполнениеОбязательств"
		// "РазвернутыеОстаткиКЭКНаДату"
		// "ТаблицаДляВыводаКартыДанных"
		// "ТаблицаЗадолженностьПоСрокамИсполнения"
		// "ТаблицаДанныеДля190_790"
		// "ДолгосрочныеАктивы";
		// "ТаблицаВозникновениеДтЗадолженности";
		ТаблицаРО = Неопределено;
		ТаблицаРОиОб = Неопределено;
		ТаблицаДолгосрочная = Неопределено;
		ТаблицаПросроченная = Неопределено;
		ТаблицаИсполнениеОбязательств = Неопределено;
		
		Для Каждого ТекЭлемент Из Схема.НаборыДанных.Объединение.Элементы Цикл
			Если ТипЗнч(ТекЭлемент) <> Тип("НаборДанныхОбъектСхемыКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;			
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаРазвернутыеОстатки_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаРазвернутыеОстатки_")+1);
				ТаблицаРО = ПолучитьВНД_РазвернутыеОстатки(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаРО);			
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаРазвернутыеОстаткиКЭК_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаРазвернутыеОстаткиКЭК_")+1);
				ТаблицаРО = ПолучитьВНД_РазвернутыеОстаткиКЭК(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаРО);			
			КонецЕсли;
			
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаРазвернутыеОстаткиКЭКНаДату_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаРазвернутыеОстаткиКЭКНаДату_")+1);
				ТаблицаРО = ПолучитьВНД_РазвернутыеОстаткиКЭКНаДату(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаРО);			
			КонецЕсли;
			
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаРазвернутыеОстаткиКЭКПоВидамСчетовИО_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаРазвернутыеОстаткиКЭКПоВидамСчетовИО_")+1);
				ТаблицаРО = ПолучитьВНД_РазвернутыеОстаткиКЭКПоВидамСчетовИО(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаРО);			
			КонецЕсли;
			
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаРазвернутыеОстаткиКЭКПоКодамПричинИО_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаРазвернутыеОстаткиКЭКПоКодамПричинИО_")+1);
				ТаблицаРО = ПолучитьВНД_РазвернутыеОстаткиКЭКПоКодамПричинИО(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаРО);			
			КонецЕсли;
			
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"РазвОстИОбДенНеденСчетов_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("РазвОстИОбДенНеденСчетов_")+1);
				ТаблицаРОиОб = ПолучитьВНД_РазвернутыеОстаткиИОборотыДенежныхИНеденежных(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаРОиОб);			
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"РазвОстИОбКЭК_") = 1  Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("РазвОстИОбКЭК_")+1);
				ТаблицаРОиОб = ПолучитьВНД_РазвернутыеОстаткиИОборотыКЭК(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаРОиОб);			
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"РазвОстИОбКЭКСегм_") = 1  Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("РазвОстИОбКЭКСегм_")+1);
				ТаблицаРОиОб = ПолучитьВНД_РазвернутыеОстаткиИОборотыКЭКСегм(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаРОиОб);			
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаДолгосрочная_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаДолгосрочная_")+1);
				ТаблицаДолгосрочная = ПолучитьВНД_Долгосрочная(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаДолгосрочная);
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаДолгосрочнаяКЭК_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаДолгосрочнаяКЭК_")+1);
				ТаблицаДолгосрочная = ПолучитьВНД_ДолгосрочнаяКЭК(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаДолгосрочная);
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаЗадолженностьПоСрокамИсполнения_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаЗадолженностьПоСрокамИсполнения_")+1);
				ТаблицаЗадолженностьПоСрокамИсполнения = ПолучитьВНД_ЗадолженностьПоСрокамИсполнения(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаЗадолженностьПоСрокамИсполнения);
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаПросроченная_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаПросроченная_")+1);
				ТаблицаПросроченная = ПолучитьВНД_Просроченная(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаПросроченная);
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаПросроченнаяКЭК_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаПросроченнаяКЭК_")+1);
				ТаблицаПросроченная = ПолучитьВНД_ПросроченнаяКЭК(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаПросроченная);
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаИсполнениеОбязательств_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаИсполнениеОбязательств_")+1);
				ТаблицаИсполнениеОбязательств = ПолучитьВНД_ИсполнениеОбязательств(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаИсполнениеОбязательств);
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаОбороты109_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаОбороты109_")+1);
				ТаблицаОбороты109 = ПолучитьВНД_Обороты109(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаОбороты109);
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаДляВыводаКартыДанных_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаДляВыводаКартыДанных_")+1);
				ТабДляВыводаКартыДанных = ПолучитьВНД_ТаблицаДляВыводаКартыДанных();

				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТабДляВыводаКартыДанных);
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаДанныеДля190_790_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаДанныеДля190_790_")+1);
				ТабДля190_790 = ПолучитьВНД_ДанныеДля190_790(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);

				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТабДля190_790);
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаДолгосрочныеАктивы_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаДолгосрочныеАктивы_")+1);
				ТаблицаДолгосрочныеАктивы = ПолучитьВНД_ДолгосрочныеАктивы(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаДолгосрочныеАктивы);
			КонецЕсли;
			Если СтрНайти(ТекЭлемент.ИмяОбъекта,"ТаблицаВозникновениеДтЗадолженности_") = 1 Тогда
				ИмяНабора = Сред(ТекЭлемент.ИмяОбъекта,СтрДлина("ТаблицаВозникновениеДтЗадолженности_")+1);
				ТаблицаВозникновениеДтЗадолженности = ПолучитьВНД_ВозникновениеДтЗадолженности(СтруктураПараметров,СтруктураПараметров.ПравилоЗаполнения,ИмяНабора,Схема.Параметры);
				КартыДанных.Вставить(ТекЭлемент.ИмяОбъекта,ТаблицаВозникновениеДтЗадолженности);
			КонецЕсли;
		КонецЦикла;
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Схема.ВариантыНастроек.Основной.Настройки,,,
			Тип("ГенераторМакетаКомпоновкиДанных"),Истина);
		
		Если Схема.НаборыДанных.Объединение.Элементы.Количество() > 1 Тогда
			
			МакетКомпоновки.НаборыДанных.Объединение.Отбор = "";
			
		КонецЕсли;
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,КартыДанных,,Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.ОтображатьПроцентВывода = Истина;
		ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
		ТабличныйДокумент = ПроцессорВывода.Вывести(ПроцессорКомпоновки,Истина);
		
		Для каждого КлючИЗначение Из СтруктураАдресов Цикл
			Если ЭтоАдресВременногоХранилища(КлючИЗначение.Значение) Тогда
				КартыДанных[КлючИЗначение.Ключ] = ПолучитьИзВременногоХранилища(КлючИЗначение.Значение);
				УдалитьИзВременногоХранилища(КлючИЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьВНД_ТаблицаДляВыводаКартыДанных() Экспорт
	
	Перем НовСтр, ТабДляВыводаКартыДанных;
	
	ТабДляВыводаКартыДанных = Новый ТаблицаЗначений;
	ТабДляВыводаКартыДанных.Колонки.Добавить("ПолеСвязиИстина",Новый ОписаниеТипов("Булево"));
	ТабДляВыводаКартыДанных.Колонки.Добавить("ПолеСвязиЛожь",Новый ОписаниеТипов("Булево"));
	НовСтр = ТабДляВыводаКартыДанных.Добавить();
	НовСтр.ПолеСвязиИстина = Истина;
	НовСтр.ПолеСвязиЛожь = Ложь;
	Возврат ТабДляВыводаКартыДанных;

КонецФункции

#Область ПолучениеВНД_РазвернутыеОстатки

//ДО 2021 (устарела) - 130/730
Функция ПолучитьВНД_РазвернутыеОстатки(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	
	Если ТипЗнч(КонецПериода) = Тип("Дата") Тогда
		КонецПериода = Новый Граница(КонецПериода,ВидГраницы.Включая);
	КонецЕсли;
		
	ТаблицаМетодовДополнительнойОбработки = Справочники.ПравилаЗаполнения.ПолучитьТаблицуМетодов(ПравилоЗаполнения,,,Истина);
	КартыДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	ОбработкаЗаполнения = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(КартыДанных, "КартыДанных", ТаблицаМетодовДополнительнойОбработки, ПравилоЗаполнения, Неопределено, "") Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;	
	
	ИмяКарты = "";
	ПараметрыМетода = Неопределено;
	Для каждого СтрокаТаблицы Из ТаблицаМетодовДополнительнойОбработки Цикл
		
		Если СтрокаТаблицы.МетодОбработки <> "РазвернутоеСальдо" Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыМетода = СтрокаТаблицы.Параметры.Получить();//Структура
		ИмяКарты = ПараметрыМетода.КартаДанных;
		Прервать;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ИмяКарты) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	//В КартаРС необходимо переименовать колонки, которые используются как параметры в методе дополнения - Счет,Субконто1,Субконто2,Субконто3,
	//если их имя не совпадает с именем параметра
	
	//Если одноименные колонки уже есть, сначала удалим их, а потом переименуем нужные.
	КартаРС = КартыДанных[ИмяКарты];
	Если ПараметрыМетода.Счет <> "Счет" Тогда
		Если КартаРС.Колонки.Найти("Счет") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Счет");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Счет);
		ТекКолонка.Имя = "Счет";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто1 <> "Субконто1" Тогда
		Если КартаРС.Колонки.Найти("Субконто1") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто1");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто1);
		ТекКолонка.Имя = "Субконто1";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто2 <> "Субконто2" Тогда
		Если КартаРС.Колонки.Найти("Субконто2") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто2");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто2);
		ТекКолонка.Имя = "Субконто2";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто3 <> "Субконто3" Тогда
		Если КартаРС.Колонки.Найти("Субконто3") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто3");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто3);
		ТекКолонка.Имя = "Субконто3";
	КонецЕсли;
	
	ПараметрыИзДокумента = Ложь;
	Значение = Неопределено;
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") 
		И СтруктураПараметров.Свойство("ПараметрыИзДокумента",Значение)
			И ТипЗнч(Значение) = Тип("Булево") Тогда
		ПараметрыИзДокумента = Значение;
	КонецЕсли;
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Субконто1");
	ТаблицаДанных.Колонки.Добавить("Субконто2");
	ТаблицаДанных.Колонки.Добавить("Субконто3");
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("КЭК",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	
	//Для баланса нужны суммы только развернутого начального и конечного остатка
	
	ТаблицаДанных.Колонки.Добавить("НачальныйОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("НачальныйОстатокКт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КонечныйОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КонечныйОстатокКт",ТипЧисло);
	
	//Для заполнения суммы исправления ошибок используем СуммаОборот по счетам исправления ошибок
	
	ТаблицаДанных.Колонки.Добавить("СуммаИООборот",ТипЧисло);
	
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И НЕ Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		УсловиеОрганизация = " И Организация = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;	
	
	Условие = УсловиеБаланс + УсловиеОрганизация;
	Условие = Сред(Условие,3);		
		
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);//Истина); - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("ВидКПС",Ложь);//для баланса не нужен
	СтруктураПолей.Вставить("Субконто1",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто2",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто3",Истина);//-меняется динамически
	СтруктураПолей.Вставить("КЭК",Ложь);// - не используется до 2021 года
	
	//Счета исправления ошибок
	ПараметрСчетаИО = ПараметрыСхемы.Найти("СчетаИсправленияОшибок_"+ИмяНабора);
	Если ПараметрСчетаИО <> Неопределено Тогда
		МассивСчетовИО = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаИО.Значение);
	Иначе	
		МассивСчетовИО = БухгалтерскийУчет.СписокСчетов("304.84, 304.94, 304.66, 304.76, 304.86, 304.96, 
														|401.16, 401.17, 401.18, 401.19, 
														|401.26, 401.27, 401.28, 401.29");
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Ложь,Ложь);//0
	ДополнитьТаблицуПоРазворотуСубконто(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО);	

	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Ложь,Ложь);//1
	ДополнитьТаблицуПоРазворотуСубконто(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Истина,Ложь);//2
	ДополнитьТаблицуПоРазворотуСубконто(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО);	

	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Ложь,Истина);//3
	ДополнитьТаблицуПоРазворотуСубконто(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Истина,Ложь);//1,2
	ДополнитьТаблицуПоРазворотуСубконто(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Ложь,Истина);//1,3
	ДополнитьТаблицуПоРазворотуСубконто(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Истина,Истина);//2,3
	ДополнитьТаблицуПоРазворотуСубконто(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Истина,Истина);//1,2,3
	ДополнитьТаблицуПоРазворотуСубконто(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО);	
	
	//КЭК убираем, т.к. остатки по счетам
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО","НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИООборот");
	//ТаблицаДанных.Сортировать("Организация,Счет,КФО,КПС,Субконто1,Субконто2,Субконто3,ИФО");
	                                                                                                                                                 
	//Далее необходимо распределить СуммаИООборот отдельно на исправление дебиторской задолженности и отдельно на исправление кредиторской задолженности,
	//И только после этого свернуть таблицу по субконто, чтобы получить обобщенные остатки
	
	ТаблицаДанных.Колонки.Добавить("СуммаИОДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("СуммаИОКт",ТипЧисло);
	
	//Если вид счета Пассивный - то положительной суммой правим Кт сумму,
			
	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
		Если СтрТЧ.СуммаИООборот=0 Тогда
			Продолжить;
		КонецЕсли;
		//Если сумма исправления >0 и есть КТ задолженность, нужно сначала уменьшить остаток по Кт,
		//а на оставшуюся сумму увеличить дт
		Если СтрТЧ.СуммаИООборот>0
			И СтрТЧ.НачальныйОстатокКт>0 Тогда
			
			СтрТЧ.СуммаИОКт = - Мин(СтрТЧ.СуммаИООборот,СтрТЧ.НачальныйОстатокКт); //уменьшаем остаток, знак минус
			СтрТЧ.СуммаИОДт = СтрТЧ.СуммаИООборот + СтрТЧ.СуммаИОКт;//складываем, т.к. СуммаИОКт - отрицательная
			
		//Если сумма исправления <0 и есть ДТ задолженность, нужно сначала уменьшить остаток по ДТ,
		//а на оставшуюся сумму увеличить КТ	
		ИначеЕсли СтрТЧ.СуммаИООборот<0
			И СтрТЧ.НачальныйОстатокДт>0 Тогда
			
			СуммаИООборотПоложительная = -1*СтрТЧ.СуммаИООборот;
			
			СтрТЧ.СуммаИОДт = - Мин(СуммаИООборотПоложительная,СтрТЧ.НачальныйОстатокДт); //уменьшаем остаток, знак минус
			СтрТЧ.СуммаИОКт = СуммаИООборотПоложительная + СтрТЧ.СуммаИОДт;//складываем, т.к. СуммаИОДт - отрицательная
			
		//НЕТ КТ задолженности и сумма исправления >0, тогда вся сумма исправления это увеличение ДТ	
		ИначеЕсли СтрТЧ.СуммаИООборот>0 Тогда
			
			СтрТЧ.СуммаИОДт = СтрТЧ.СуммаИООборот;
			СтрТЧ.СуммаИОКт = 0;
			
		//НЕТ ДТ задолженности и сумма исправления <0, тогда вся сумма исправления это увеличение КТ	
		ИначеЕсли СтрТЧ.СуммаИООборот<0 Тогда

		    СтрТЧ.СуммаИОДт = 0;
			СтрТЧ.СуммаИОКт = -СтрТЧ.СуммаИООборот;
			
		КонецЕсли;
	КонецЦикла;
	
	//После того как распределили задолженность, можно свернуть таблицу детальных данных
	//КПС в данном наборе не нужен, по нему свернем
	//По организации и ИФО сворачивать нельзя никогда, 
	//т.к. в правилах заполнения на набор дополнительно накладываются по ним отбор
	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО","НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИОДт,СуммаИОКт");
	
	КартаРС = Неопределено;
	
	Возврат ТаблицаДанных;
	
КонецФункции

//С 2021    - 130/730
Функция ПолучитьВНД_РазвернутыеОстаткиКЭК(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	
	Если ТипЗнч(КонецПериода) = Тип("Дата") Тогда
		КонецПериода = Новый Граница(КонецПериода,ВидГраницы.Включая);
	КонецЕсли;
		
	ТаблицаМетодовДополнительнойОбработки = Справочники.ПравилаЗаполнения.ПолучитьТаблицуМетодов(ПравилоЗаполнения,,,Истина);
	КартыДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	ОбработкаЗаполнения = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(КартыДанных, "КартыДанных", ТаблицаМетодовДополнительнойОбработки, ПравилоЗаполнения, Неопределено, "") Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;	
	
	ИмяКарты = "";
	ПараметрыМетода = Неопределено;
	Для каждого СтрокаТаблицы Из ТаблицаМетодовДополнительнойОбработки Цикл
		
		Если СтрокаТаблицы.МетодОбработки <> "РазвернутоеСальдо" Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыМетода = СтрокаТаблицы.Параметры.Получить();//Структура
		ИмяКарты = ПараметрыМетода.КартаДанных;
		Прервать;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ИмяКарты) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	//В КартаРС необходимо переименовать колонки, которые используются как параметры в методе дополнения - Счет,Субконто1,Субконто2,Субконто3,
	//если их имя не совпадает с именем параметра
	
	//Если одноименные колонки уже есть, сначала удалим их, а потом переименуем нужные.
	КартаРС = КартыДанных[ИмяКарты];
	Если ПараметрыМетода.Счет <> "Счет" Тогда
		Если КартаРС.Колонки.Найти("Счет") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Счет");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Счет);
		ТекКолонка.Имя = "Счет";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто1 <> "Субконто1" Тогда
		Если КартаРС.Колонки.Найти("Субконто1") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто1");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто1);
		ТекКолонка.Имя = "Субконто1";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто2 <> "Субконто2" Тогда
		Если КартаРС.Колонки.Найти("Субконто2") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто2");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто2);
		ТекКолонка.Имя = "Субконто2";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто3 <> "Субконто3" Тогда
		Если КартаРС.Колонки.Найти("Субконто3") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто3");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто3);
		ТекКолонка.Имя = "Субконто3";
	КонецЕсли;
	
	ПараметрыИзДокумента = Ложь;
	Значение = Неопределено;
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") 
		И СтруктураПараметров.Свойство("ПараметрыИзДокумента",Значение)
			И ТипЗнч(Значение) = Тип("Булево") Тогда
		ПараметрыИзДокумента = Значение;
	КонецЕсли;
	
	СоответствиеСчетаБезКЭК = Новый Соответствие;
	
	УчитыватьКартуКЭК000 = Истина;//общая настройка правила заполнения на использование карты данных СчетаБезКЭК
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("УчитыватьКартуКЭК000") Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Структура") Тогда
			
			Если ДополнительныеПараметры.УчитыватьКартуКЭК000.Свойство("ПравоеЗначение")
				И ДополнительныеПараметры.УчитыватьКартуКЭК000.ПравоеЗначение = Ложь Тогда
				
				УчитыватьКартуКЭК000 = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Булево") Тогда
			
			УчитыватьКартуКЭК000 = ДополнительныеПараметры.УчитыватьКартуКЭК000;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КартаСчетовБезКЭК = Неопределено;
	Если УчитыватьКартуКЭК000 = Истина
		И КартыДанных.Свойство("СчетаБезКЭК",КартаСчетовБезКЭК) Тогда
		Если КартаСчетовБезКЭК.Колонки.Найти("Счет") <> Неопределено
			И КартаСчетовБезКЭК.Колонки.Найти("Использовать")<> Неопределено Тогда
			
			Для Каждого СтрКарты Из КартаСчетовБезКЭК.НайтиСтроки(Новый Структура("Использовать",Истина)) Цикл
				СоответствиеСчетаБезКЭК.Вставить(СтрКарты.Счет,Истина);	
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Субконто1");
	ТаблицаДанных.Колонки.Добавить("Субконто2");
	ТаблицаДанных.Колонки.Добавить("Субконто3");
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("КЭК",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	
	//Для баланса нужны суммы только развернутого начального и конечного остатка
	
	ТаблицаДанных.Колонки.Добавить("НачальныйОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("НачальныйОстатокКт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КонечныйОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КонечныйОстатокКт",ТипЧисло);
	
	//Для заполнения суммы исправления ошибок используем СуммаОборот по счетам исправления ошибок
	
	ТаблицаДанных.Колонки.Добавить("СуммаИООборот",ТипЧисло);
	
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И НЕ Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		УсловиеОрганизация = " И Организация = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;	
	
	Условие = УсловиеБаланс + УсловиеОрганизация;
	Условие = Сред(Условие,3);		
		
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);//Истина); - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("ВидКПС",Ложь);//для баланса не нужен
	СтруктураПолей.Вставить("Субконто1",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто2",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто3",Истина);//-меняется динамически
	СтруктураПолей.Вставить("КЭК",Истина);// - используется с 2021 года
	
	//Счета исправления ошибок
	ПараметрСчетаИО = ПараметрыСхемы.Найти("СчетаИсправленияОшибок_"+ИмяНабора);
	Если ПараметрСчетаИО <> Неопределено Тогда
		МассивСчетовИО = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаИО.Значение);
	Иначе	
		МассивСчетовИО = БухгалтерскийУчет.СписокСчетов("304.66, 304.76, 304.86, 304.96, 
														|401.16, 401.17, 401.18, 401.19, 
														|401.26, 401.27, 401.28, 401.29");
	КонецЕсли;
	
	ДополнитьТаблицуПоДаннымОстатковИОборотовОбщая(ТаблицаДанных, КартаРС, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода);
	
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК","НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИООборот");
	
	ДополнитьТаблицуПоДаннымИсправленияОшибокОбщая(ТаблицаДанных, КартаРС, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО);
	
	//КЭК НЕ убираем, т.к. теперь в разрезе КЭК нужны данные
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК","НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИООборот");
	//ТаблицаДанных.Сортировать("Организация,Счет,КФО,КПС,Субконто1,Субконто2,Субконто3,ИФО");
		
	ЗаполнитьДетальныйКЭКВТаблицеДанных(ТаблицаДанных,СоответствиеСчетаБезКЭК);
		
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК","НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИООборот");
	
	//Т.к. в начале года остатки на 001-009, в середине года обороты по 56х/66х и 73х/83х, то после замены кэк нужно исправить конечные остатки,
	//иначе получится, что если до замены было: 
	//по 001 остаток на начало по дт 100,
	//по 561/661 оборот в кт 150
	//и на конец года будет по 001 остаток по дт 100, а по 561/661 остаток по кт 150.
	//А должно быть по 001 остаток на конец по кт 50, и все.
	
	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
		//т.к. форма может заполняться не с начала года, то остатки на начало отчетного периода могут быть на разных КЭК - 561/661,
		//необходимо их объединить
		Если СтрТЧ.НачальныйОстатокДт <> 0
			ИЛИ СтрТЧ.НачальныйОстатокКт <> 0 Тогда
			
			Если СтрТЧ.НачальныйОстатокДт >= СтрТЧ.НачальныйОстатокКт Тогда
				СтрТЧ.НачальныйОстатокДт = СтрТЧ.НачальныйОстатокДт - СтрТЧ.НачальныйОстатокКт;
				СтрТЧ.НачальныйОстатокКт = 0;
			Иначе
				СтрТЧ.НачальныйОстатокКт = СтрТЧ.НачальныйОстатокКт - СтрТЧ.НачальныйОстатокДт;
				СтрТЧ.НачальныйОстатокДт = 0;
			КонецЕсли;
			
		КонецЕсли;
	
		
		Если СтрТЧ.КонечныйОстатокДт <> 0
			ИЛИ СтрТЧ.КонечныйОстатокКт <> 0 Тогда
				
			Если СтрТЧ.КонечныйОстатокДт >= СтрТЧ.КонечныйОстатокКт Тогда
				СтрТЧ.КонечныйОстатокДт = СтрТЧ.КонечныйОстатокДт - СтрТЧ.КонечныйОстатокКт;
				СтрТЧ.КонечныйОстатокКт = 0;
			Иначе
				СтрТЧ.КонечныйОстатокКт = СтрТЧ.КонечныйОстатокКт - СтрТЧ.КонечныйОстатокДт;
				СтрТЧ.КонечныйОстатокДт = 0;
			КонецЕсли;
		
		КонецЕсли;
	КонецЦикла;
	
	//Далее необходимо распределить СуммаИООборот отдельно на исправление дебиторской задолженности и отдельно на исправление кредиторской задолженности,
	//И только после этого свернуть таблицу по субконто, чтобы получить обобщенные остатки
	
	ТаблицаДанных.Колонки.Добавить("СуммаИОДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("СуммаИОКт",ТипЧисло);
	
	//Если вид счета Пассивный - то положительной суммой правим Кт сумму,
			
	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
		Если СтрТЧ.СуммаИООборот=0 Тогда
			Продолжить;
		КонецЕсли;
		//Если сумма исправления >0 и есть КТ задолженность, нужно сначала уменьшить остаток по Кт,
		//а на оставшуюся сумму увеличить дт
		Если СтрТЧ.СуммаИООборот>0
			И СтрТЧ.НачальныйОстатокКт>0 Тогда
			
			СтрТЧ.СуммаИОКт = - Мин(СтрТЧ.СуммаИООборот,СтрТЧ.НачальныйОстатокКт); //уменьшаем остаток, знак минус
			СтрТЧ.СуммаИОДт = СтрТЧ.СуммаИООборот + СтрТЧ.СуммаИОКт;//складываем, т.к. СуммаИОКт - отрицательная
			
		//Если сумма исправления <0 и есть ДТ задолженность, нужно сначала уменьшить остаток по ДТ,
		//а на оставшуюся сумму увеличить КТ	
		ИначеЕсли СтрТЧ.СуммаИООборот<0
			И СтрТЧ.НачальныйОстатокДт>0 Тогда
			
			СуммаИООборотПоложительная = -1*СтрТЧ.СуммаИООборот;
			
			СтрТЧ.СуммаИОДт = - Мин(СуммаИООборотПоложительная,СтрТЧ.НачальныйОстатокДт); //уменьшаем остаток, знак минус
			СтрТЧ.СуммаИОКт = СуммаИООборотПоложительная + СтрТЧ.СуммаИОДт;//складываем, т.к. СуммаИОДт - отрицательная
			
		//НЕТ КТ задолженности и сумма исправления >0, тогда вся сумма исправления это увеличение ДТ	
		ИначеЕсли СтрТЧ.СуммаИООборот>0 Тогда
			
			СтрТЧ.СуммаИОДт = СтрТЧ.СуммаИООборот;
			СтрТЧ.СуммаИОКт = 0;
			
		//НЕТ ДТ задолженности и сумма исправления <0, тогда вся сумма исправления это увеличение КТ	
		ИначеЕсли СтрТЧ.СуммаИООборот<0 Тогда

		    СтрТЧ.СуммаИОДт = 0;
			СтрТЧ.СуммаИОКт = -СтрТЧ.СуммаИООборот;
			
		КонецЕсли;
	КонецЦикла;
	
	//После того как распределили задолженность, можно свернуть таблицу детальных данных
	//КПС в данном наборе не нужен, по нему свернем.
	//По организации и ИФО сворачивать нельзя никогда, 
	//т.к. в правилах заполнения на набор дополнительно накладываются по ним отбор.
	//КЭК теперь не нужно, его убираем.
	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО","НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИОДт,СуммаИОКт");
	
	КартаРС = Неопределено;
	
	Возврат ТаблицаДанных;
	
КонецФункции

//с 2021 для 173/773
Функция ПолучитьВНД_РазвернутыеОстаткиКЭКПоВидамСчетовИО(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Возврат ЗаполнитьТаблицыРазвернутыхОстатковКЭКПоВидамСчетовИКодамПричин(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы, Ложь);		
	
КонецФункции

//с 2021 для 173/773 для 4 раздела по кодам причин
Функция ПолучитьВНД_РазвернутыеОстаткиКЭКПоКодамПричинИО(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Возврат ЗаполнитьТаблицыРазвернутыхОстатковКЭКПоВидамСчетовИКодамПричин(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы, Истина);		
	
КонецФункции

Функция ЗаполнитьТаблицыРазвернутыхОстатковКЭКПоВидамСчетовИКодамПричин(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы, ВернутьТаблицуПоКодамПричин = Ложь)
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	
	Если ТипЗнч(КонецПериода) = Тип("Дата") Тогда
		КонецПериода = Новый Граница(КонецПериода,ВидГраницы.Включая);
	КонецЕсли;
		
	ТаблицаМетодовДополнительнойОбработки = Справочники.ПравилаЗаполнения.ПолучитьТаблицуМетодов(ПравилоЗаполнения,,,Истина);
	КартыДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	ОбработкаЗаполнения = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(КартыДанных, "КартыДанных", ТаблицаМетодовДополнительнойОбработки, ПравилоЗаполнения, Неопределено, "") Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;	
	
	ИмяКарты = "";
	ПараметрыМетода = Неопределено;
	Для каждого СтрокаТаблицы Из ТаблицаМетодовДополнительнойОбработки Цикл
		
		Если СтрокаТаблицы.МетодОбработки <> "РазвернутоеСальдо" Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыМетода = СтрокаТаблицы.Параметры.Получить();//Структура
		ИмяКарты = ПараметрыМетода.КартаДанных;
		Прервать;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ИмяКарты) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	//В КартаРС необходимо переименовать колонки, которые используются как параметры в методе дополнения - Счет,Субконто1,Субконто2,Субконто3,
	//если их имя не совпадает с именем параметра
	
	//Если одноименные колонки уже есть, сначала удалим их, а потом переименуем нужные.
	КартаРС = КартыДанных[ИмяКарты];
	Если ПараметрыМетода.Счет <> "Счет" Тогда
		Если КартаРС.Колонки.Найти("Счет") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Счет");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Счет);
		ТекКолонка.Имя = "Счет";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто1 <> "Субконто1" Тогда
		Если КартаРС.Колонки.Найти("Субконто1") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто1");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто1);
		ТекКолонка.Имя = "Субконто1";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто2 <> "Субконто2" Тогда
		Если КартаРС.Колонки.Найти("Субконто2") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто2");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто2);
		ТекКолонка.Имя = "Субконто2";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто3 <> "Субконто3" Тогда
		Если КартаРС.Колонки.Найти("Субконто3") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто3");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто3);
		ТекКолонка.Имя = "Субконто3";
	КонецЕсли;
	
	ПараметрыИзДокумента = Ложь;
	Значение = Неопределено;
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") 
		И СтруктураПараметров.Свойство("ПараметрыИзДокумента",Значение)
			И ТипЗнч(Значение) = Тип("Булево") Тогда
		ПараметрыИзДокумента = Значение;
	КонецЕсли;
	
	СоответствиеСчетаБезКЭК = Новый Соответствие;
	
	УчитыватьКартуКЭК000 = Истина;//общая настройка правила заполнения на использование карты данных СчетаБезКЭК
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("УчитыватьКартуКЭК000") Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Структура") Тогда
			
			Если ДополнительныеПараметры.УчитыватьКартуКЭК000.Свойство("ПравоеЗначение")
				И ДополнительныеПараметры.УчитыватьКартуКЭК000.ПравоеЗначение = Ложь Тогда
				
				УчитыватьКартуКЭК000 = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Булево") Тогда
			
			УчитыватьКартуКЭК000 = ДополнительныеПараметры.УчитыватьКартуКЭК000;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КартаСчетовБезКЭК = Неопределено;
	Если УчитыватьКартуКЭК000 = Истина
		И КартыДанных.Свойство("СчетаБезКЭК",КартаСчетовБезКЭК) Тогда
		Если КартаСчетовБезКЭК.Колонки.Найти("Счет") <> Неопределено
			И КартаСчетовБезКЭК.Колонки.Найти("Использовать")<> Неопределено Тогда
			
			Для Каждого СтрКарты Из КартаСчетовБезКЭК.НайтиСтроки(Новый Структура("Использовать",Истина)) Цикл
				СоответствиеСчетаБезКЭК.Вставить(СтрКарты.Счет,Истина);	
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Субконто1");
	ТаблицаДанных.Колонки.Добавить("Субконто2");
	ТаблицаДанных.Колонки.Добавить("Субконто3");
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("КЭК",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	
	//Для баланса нужны суммы только развернутого начального и конечного остатка
	
	ТаблицаДанных.Колонки.Добавить("НачальныйОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("НачальныйОстатокКт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КонечныйОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КонечныйОстатокКт",ТипЧисло);
	
	
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И НЕ Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		УсловиеОрганизация = " И Организация = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;	
	
	Условие = УсловиеБаланс + УсловиеОрганизация;
	Условие = Сред(Условие,3);		
		
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);//Истина); - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("ВидКПС",Ложь);//для баланса не нужен
	СтруктураПолей.Вставить("Субконто1",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто2",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто3",Истина);//-меняется динамически
	СтруктураПолей.Вставить("КЭК",Истина);// - используется с 2021 года
	
	//Счета исправления ошибок
	ПараметрСчетаИО = ПараметрыСхемы.Найти("СчетаИсправленияОшибок_"+ИмяНабора);
	Если ПараметрСчетаИО <> Неопределено Тогда
		МассивСчетовИООбычные = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаИО.Значение);
	Иначе	
		МассивСчетовИООбычные = БухгалтерскийУчет.СписокСчетов("304.86, 304.96,
														|401.18, 401.19,
														|401.28, 401.29");
	КонецЕсли;
	
	ПараметрСчетаИОКонтроль = ПараметрыСхемы.Найти("СчетаИсправленияОшибокКонтроль_"+ИмяНабора);
	Если ПараметрСчетаИОКонтроль <> Неопределено Тогда
		МассивСчетовИОКонтроль = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаИОКонтроль.Значение);
	Иначе	
		МассивСчетовИОКонтроль = БухгалтерскийУчет.СписокСчетов("304.66, 304.76,
														|401.16, 401.17,
														|401.26, 401.27");
	КонецЕсли;
	
	ВсеСчетаИО = Новый Массив;
	Для Каждого ЭлМас Из МассивСчетовИООбычные Цикл
		Если ВсеСчетаИО.Найти(ЭлМас) = Неопределено Тогда
			ВсеСчетаИО.Добавить(ЭлМас);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлМас Из МассивСчетовИОКонтроль Цикл
		Если ВсеСчетаИО.Найти(ЭлМас) = Неопределено Тогда
			ВсеСчетаИО.Добавить(ЭлМас);
		КонецЕсли;
	КонецЦикла;
	
	//Для заполнения суммы исправления ошибок используем отдельную таблицу, в нее заполняем обороты со счетами ИО в разные колонки, с учетом периода исправления
	
	ТаблицаДанныхИО = ТаблицаДанных.СкопироватьКолонки();
	ТаблицаДанныхИО.Колонки.Добавить("Период");
	ТаблицаДанныхИО.Колонки.Добавить("СуммаИООбычныеОборот",ТипЧисло);
	ТаблицаДанныхИО.Колонки.Добавить("СуммаИОКонтрольОборот",ТипЧисло);
	ТаблицаДанныхИО.Колонки.Добавить("КодПричиныОшибки",Новый ОписаниеТипов("ПеречислениеСсылка.КодыПричинОшибокПрошлыхЛет"));
	
	ДополнитьТаблицуПоДаннымОстатковИОборотовОбщая(ТаблицаДанных, КартаРС, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода);	
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК","НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт");
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Ложь,Ложь);//0
	ДополнитьТаблицуПоРазворотуСубконтоПоВидамСчетовИО(ТаблицаДанных, ТаблицаДанныхИО, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, ВсеСчетаИО, МассивСчетовИООбычные, МассивСчетовИОКонтроль);	

	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Ложь,Ложь);//1
	ДополнитьТаблицуПоРазворотуСубконтоПоВидамСчетовИО(ТаблицаДанных, ТаблицаДанныхИО, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, ВсеСчетаИО, МассивСчетовИООбычные, МассивСчетовИОКонтроль);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Истина,Ложь);//2
	ДополнитьТаблицуПоРазворотуСубконтоПоВидамСчетовИО(ТаблицаДанных, ТаблицаДанныхИО, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, ВсеСчетаИО, МассивСчетовИООбычные, МассивСчетовИОКонтроль);	

	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Ложь,Истина);//3
	ДополнитьТаблицуПоРазворотуСубконтоПоВидамСчетовИО(ТаблицаДанных, ТаблицаДанныхИО, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, ВсеСчетаИО, МассивСчетовИООбычные, МассивСчетовИОКонтроль);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Истина,Ложь);//1,2
	ДополнитьТаблицуПоРазворотуСубконтоПоВидамСчетовИО(ТаблицаДанных, ТаблицаДанныхИО, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, ВсеСчетаИО, МассивСчетовИООбычные, МассивСчетовИОКонтроль);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Ложь,Истина);//1,3
	ДополнитьТаблицуПоРазворотуСубконтоПоВидамСчетовИО(ТаблицаДанных, ТаблицаДанныхИО, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, ВсеСчетаИО, МассивСчетовИООбычные, МассивСчетовИОКонтроль);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Истина,Истина);//2,3
	ДополнитьТаблицуПоРазворотуСубконтоПоВидамСчетовИО(ТаблицаДанных, ТаблицаДанныхИО, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, ВсеСчетаИО, МассивСчетовИООбычные, МассивСчетовИОКонтроль);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Истина,Истина);//1,2,3
	ДополнитьТаблицуПоРазворотуСубконтоПоВидамСчетовИО(ТаблицаДанных, ТаблицаДанныхИО, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, ВсеСчетаИО, МассивСчетовИООбычные, МассивСчетовИОКонтроль);	
	
	//КЭК НЕ убираем, т.к. теперь в разрезе КЭК нужны данные
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК","НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт");
	//ТаблицаДанных.Сортировать("Организация,Счет,КФО,КПС,Субконто1,Субконто2,Субконто3,ИФО");
	
	ЗаполнитьДетальныйКЭКВТаблицеДанных(ТаблицаДанных,СоответствиеСчетаБезКЭК);
		
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК","НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт");
	
	ЗаполнитьДетальныйКЭКВТаблицеДанных(ТаблицаДанныхИО,СоответствиеСчетаБезКЭК);
		
	ТаблицаДанныхИО.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК,Период,КодПричиныОшибки","СуммаИООбычныеОборот,СуммаИОКонтрольОборот");

	
	//Т.к. в начале года остатки на 001-009, в середине года обороты по 56х/66х и 73х/83х, то после замены кэк нужно исправить конечные остатки,
	//иначе получится, что если до замены было: 
	//по 001 остаток на начало по дт 100,
	//по 561/661 оборот в кт 150
	//и на конец года будет по 001 остаток по дт 100, а по 561/661 остаток по кт 150.
	//А должно быть по 001 остаток на конец по кт 50, и все.
	
	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
		//т.к. форма может заполняться не с начала года, то остатки на начало отчетного периода могут быть на разных КЭК - 561/661,
		//необходимо их объединить
		Если СтрТЧ.НачальныйОстатокДт <> 0
			ИЛИ СтрТЧ.НачальныйОстатокКт <> 0 Тогда
			
			Если СтрТЧ.НачальныйОстатокДт >= СтрТЧ.НачальныйОстатокКт Тогда
				СтрТЧ.НачальныйОстатокДт = СтрТЧ.НачальныйОстатокДт - СтрТЧ.НачальныйОстатокКт;
				СтрТЧ.НачальныйОстатокКт = 0;
			Иначе
				СтрТЧ.НачальныйОстатокКт = СтрТЧ.НачальныйОстатокКт - СтрТЧ.НачальныйОстатокДт;
				СтрТЧ.НачальныйОстатокДт = 0;
			КонецЕсли;
			
		КонецЕсли;
			
		Если СтрТЧ.КонечныйОстатокДт <> 0
			ИЛИ СтрТЧ.КонечныйОстатокКт <> 0 Тогда
				
			Если СтрТЧ.КонечныйОстатокДт >= СтрТЧ.КонечныйОстатокКт Тогда
				СтрТЧ.КонечныйОстатокДт = СтрТЧ.КонечныйОстатокДт - СтрТЧ.КонечныйОстатокКт;
				СтрТЧ.КонечныйОстатокКт = 0;
			Иначе
				СтрТЧ.КонечныйОстатокКт = СтрТЧ.КонечныйОстатокКт - СтрТЧ.КонечныйОстатокДт;
				СтрТЧ.КонечныйОстатокДт = 0;
			КонецЕсли;
		
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПоКодамПричин = Новый ТаблицаЗначений;
	
	ТаблицаПоКодамПричин.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаПоКодамПричин.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаПоКодамПричин.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаПоКодамПричин.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаПоКодамПричин.Колонки.Добавить("КЭК",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаПоКодамПричин.Колонки.Добавить("КодПричиныОшибки",Новый ОписаниеТипов("ПеречислениеСсылка.КодыПричинОшибокПрошлыхЛет"));
	ТаблицаПоКодамПричин.Колонки.Добавить("СуммаДт",ТипЧисло);
	ТаблицаПоКодамПричин.Колонки.Добавить("СуммаКт",ТипЧисло);
	
	//Дополним таблицу данных строками, которых нет по аналитике из ТаблицаДанныхИО
	ДобавленныйИндекс = ТаблицаДанных.Индексы.Добавить("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК");
	
	ТаблицаДляДополнения = ТаблицаДанныхИО.Скопировать(,"Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК");
	ТаблицаДляДополнения.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК");
	Для Каждого СтрТЧ Из ТаблицаДляДополнения Цикл
		СтруктураПоиска = Новый Структура("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрТЧ);
		Если ТаблицаДанных.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
			НовСтр = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,СтруктураПоиска);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДанных.Индексы.Удалить(ДобавленныйИндекс);
	
	//Далее необходимо распределить СуммаИООборот отдельно на исправление дебиторской задолженности и отдельно на исправление кредиторской задолженности,
	//И только после этого свернуть таблицу по субконто, чтобы получить обобщенные остатки
	//Возможна ситуация, когда на начало периода была кт задолженность на 100р, а в течение отчетного периода были проводки исправления ошибок:
	//1) со счетами ИО контроля в дт счета 80р
	//2) со счетами ИО обычными в дт счета 40р
	//На конец периода должна быть сумма 20р по дт задолженности.
	//Чтобы правильно распределить эти суммы - какие обороты сначала учитывать для погашения кт задолженности, а какие потом,
	//суммы анализируются по порядку отражения в учете, то есть сортируются по периоду.
	
	ТаблицаДанных.Колонки.Добавить("СуммаИООбычныеДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("СуммаИООбычныеКт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("СуммаИОКонтрольДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("СуммаИОКонтрольКт",ТипЧисло);
	
	ТаблицаДанныхИО.Индексы.Добавить("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК");

	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
		
		СтруктураПоиска = Новый Структура("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,СтрТЧ);
		
		ТекТаблицаИО = ТаблицаДанныхИО.Скопировать(СтруктураПоиска);
		ТекТаблицаИО.Сортировать("Период");
		
		Для Каждого СтрИО Из ТекТаблицаИО Цикл
		
			//заодно заполним колонки СуммаИОДт и СуммаИОКт
			Если СтрИО.СуммаИООбычныеОборот=0 
				И СтрИО.СуммаИОКонтрольОборот=0 Тогда
				Продолжить;
			КонецЕсли;
						
			РаспределитьСуммуИО(СтрИО, СтрТЧ, "СуммаИООбычные",ТаблицаПоКодамПричин);
			РаспределитьСуммуИО(СтрИО, СтрТЧ, "СуммаИОКонтроль",Неопределено);

		КонецЦикла;		
	КонецЦикла;
	
	КартаРС = Неопределено;
	
	//После того как распределили задолженность, можно свернуть таблицу детальных данных
	//КПС в данном наборе не нужен, по нему свернем.
	//По организации и ИФО сворачивать нельзя никогда, 
	//т.к. в правилах заполнения на набор дополнительно накладываются по ним отбор.
	//КЭК теперь не нужно, его убираем.
	Если ВернутьТаблицуПоКодамПричин Тогда
		ТаблицаПоКодамПричин.Свернуть("Счет,Организация,ИФО,КФО,КЭК,КодПричиныОшибки","СуммаДт,СуммаКт");
		Возврат ТаблицаПоКодамПричин;
	Иначе
		ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО","НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИООбычныеДт,СуммаИООбычныеКт,СуммаИОКонтрольДт,СуммаИОКонтрольКт");	
		Возврат ТаблицаДанных;
	КонецЕсли;
		
КонецФункции

Процедура РаспределитьСуммуИО(Знач СтрИО, Знач СтрТЧ, ИмяПоляСуммы, ТаблицаПоКодамПричин)
	
	Перем СуммаИООборотПоложительная, ТекНачальныйОстатокДт, ТекНачальныйОстатокКт;
	
	ТекНачальныйОстатокКт = СтрТЧ.НачальныйОстатокКт + СтрТЧ.СуммаИООбычныеКт + СтрТЧ.СуммаИОКонтрольКт;
	ТекНачальныйОстатокДт = СтрТЧ.НачальныйОстатокДт + СтрТЧ.СуммаИООбычныеДт + СтрТЧ.СуммаИОКонтрольДт;
	
	ЗаполнятьПоКодамПричин = ТаблицаПоКодамПричин <> Неопределено;
	
	АнализируемаяСумма = СтрИО[ИмяПоляСуммы+"Оборот"];
	//Если сумма исправления >0 и есть КТ задолженность, нужно сначала уменьшить остаток по Кт,
	//а на оставшуюся сумму увеличить дт
	
	СуммаДт = 0;
	СуммаКт = 0;
	Если АнализируемаяСумма>0
		И ТекНачальныйОстатокКт>0 Тогда
		
		РаспределеннаяСумма = - Мин(АнализируемаяСумма,ТекНачальныйОстатокКт); //уменьшаем остаток, знак минус
		
		СуммаДт = АнализируемаяСумма + РаспределеннаяСумма;
		СуммаКт = РаспределеннаяСумма;
		
		
		СтрТЧ[ИмяПоляСуммы+"Кт"] = СтрТЧ[ИмяПоляСуммы+"Кт"] + СуммаКт; //складываем, т.к. РаспределеннаяСумма отрицательная
		СтрТЧ[ИмяПоляСуммы+"Дт"] = СтрТЧ[ИмяПоляСуммы+"Дт"] + СуммаДт;//складываем, т.к. РаспределеннаяСумма - отрицательная
		
		//Если сумма исправления <0 и есть ДТ задолженность, нужно сначала уменьшить остаток по ДТ,
		//а на оставшуюся сумму увеличить КТ	
	ИначеЕсли АнализируемаяСумма<0
		И ТекНачальныйОстатокДт>0 Тогда
		
		СуммаИООборотПоложительная = -1*АнализируемаяСумма;
		РаспределеннаяСумма  = - Мин(СуммаИООборотПоложительная,ТекНачальныйОстатокДт);
		
		СуммаДт = РаспределеннаяСумма;
		СуммаКт = СуммаИООборотПоложительная + РаспределеннаяСумма;
		
		СтрТЧ[ИмяПоляСуммы+"Дт"] = СтрТЧ[ИмяПоляСуммы+"Дт"] + СуммаДт; //складываем, т.к. РаспределеннаяСумма - отрицательная
		СтрТЧ[ИмяПоляСуммы+"Кт"] = СтрТЧ[ИмяПоляСуммы+"Кт"] + СуммаКт;//складываем, т.к. РаспределеннаяСумма - отрицательная
		
		//НЕТ КТ задолженности и сумма исправления >0, тогда вся сумма исправления это увеличение ДТ	
	ИначеЕсли АнализируемаяСумма>0 Тогда
		
		СуммаДт = АнализируемаяСумма;
		СтрТЧ[ИмяПоляСуммы+"Дт"] = СтрТЧ[ИмяПоляСуммы+"Дт"] + СуммаДт;
		//СтрТЧ[ИмяПоляСуммы+"Кт"] = 0;
		
		//НЕТ ДТ задолженности и сумма исправления <0, тогда вся сумма исправления это увеличение КТ	
	ИначеЕсли АнализируемаяСумма<0 Тогда
		
		//СтрТЧ[ИмяПоляСуммы+"Дт"] = 0;
		СуммаКт = - АнализируемаяСумма;
		СтрТЧ[ИмяПоляСуммы+"Кт"] = СтрТЧ[ИмяПоляСуммы+"Кт"] + СуммаКт;
		
	КонецЕсли;
	
	Если ЗаполнятьПоКодамПричин Тогда
		НовСтр = ТаблицаПоКодамПричин.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрИО);
		НовСтр.СуммаДт = СуммаДт;
		НовСтр.СуммаКт = СуммаКт;
	КонецЕсли;
КонецПроцедуры

Процедура ДополнитьТаблицуПоРазворотуСубконтоПоВидамСчетовИО(ТаблицаДанных, ТаблицаДанныхИО, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, ВсеСчетаИО, МассивСчетовОшибокОбычные, МассивСчетовОшибокКонтроль)
	
	МассивСтрок = КартаРС.НайтиСтроки(СтруктураОтбора);
			
	МассивСчетов = Новый Массив;
	Если МассивСтрок.Количество() >0 Тогда
		Для Каждого ТекСтр Из МассивСтрок Цикл
			МассивСчетов.Добавить(ТекСтр.Счет);
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
			СтруктураПолей.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);
		КонецЦикла;
	    //данные по остаткам заполняются общим запросом
		//ДополнитьТаблицуПоДаннымОстатковИОборотов(ТаблицаДанных, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода);
		ДополнитьТаблицуПоДаннымИсправленияОшибокПоВидамСчетовИО(ТаблицаДанныхИО, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, ВсеСчетаИО, МассивСчетовОшибокОбычные, МассивСчетовОшибокКонтроль);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьТаблицуПоРазворотуСубконто(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовОшибок)
	
	МассивСтрок = КартаРС.НайтиСтроки(СтруктураОтбора);
			
	МассивСчетов = Новый Массив;
	Если МассивСтрок.Количество() >0 Тогда
		Для Каждого ТекСтр Из МассивСтрок Цикл
			МассивСчетов.Добавить(ТекСтр.Счет);
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
			СтруктураПолей.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);
		КонецЦикла;
	
		ДополнитьТаблицуПоДаннымОстатковИОборотов(ТаблицаДанных, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода);
		ДополнитьТаблицуПоДаннымИсправленияОшибок(ТаблицаДанных, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовОшибок);
	КонецЕсли;
	
КонецПроцедуры


//с 2022 для 173/773 - для остатков до изменения баланса
Функция ПолучитьВНД_РазвернутыеОстаткиКЭКНаДату(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем ДополнительныйПериод1;
	Перем ДополнительныйПериод2;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
	
	
	
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	
	СтруктураПараметров.Свойство("ДополнительныйПериод1", ДополнительныйПериод1);
	СтруктураПараметров.Свойство("ДополнительныйПериод2", ДополнительныйПериод2);
	
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Если ТипЗнч(КонецПериода) = Тип("Дата") Тогда
		КонецПериода = Новый Граница(КонецПериода,ВидГраницы.Включая);
	КонецЕсли;
	
	ПараметрПериода = ПараметрыСхемы.Найти("ПериодОтчета_"+ИмяНабора);
	
	Если ПараметрПериода<>Неопределено Тогда
		Если ПараметрПериода.Выражение = "&ДополнительныйПериод1" Тогда
			ДатаОстатков = ДополнительныйПериод1;
		ИначеЕсли ПараметрПериода.Выражение = "&ДополнительныйПериод2" Тогда
			ДатаОстатков = ДополнительныйПериод2;
		ИначеЕсли ПараметрПериода.Выражение = "&НачалоПериода" Тогда
			ДатаОстатков = НачалоПериода;
		Иначе
			//считаем, что это конец периода, т.к. сейчас используется выражение ЗаполнениеОтчетности.ПреобразоватьКонецПериода(&КонецПериода)  
			ДатаОстатков = КонецПериода;	
		КонецЕсли;
	КонецЕсли;
		
	ТаблицаМетодовДополнительнойОбработки = Справочники.ПравилаЗаполнения.ПолучитьТаблицуМетодов(ПравилоЗаполнения,,,Истина);
	КартыДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	ОбработкаЗаполнения = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(КартыДанных, "КартыДанных", ТаблицаМетодовДополнительнойОбработки, ПравилоЗаполнения, Неопределено, "") Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;	
	
	ИмяКарты = "";
	ПараметрыМетода = Неопределено;
	Для каждого СтрокаТаблицы Из ТаблицаМетодовДополнительнойОбработки Цикл
		
		Если СтрокаТаблицы.МетодОбработки <> "РазвернутоеСальдо" Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыМетода = СтрокаТаблицы.Параметры.Получить();//Структура
		ИмяКарты = ПараметрыМетода.КартаДанных;
		Прервать;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ИмяКарты) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	//В КартаРС необходимо переименовать колонки, которые используются как параметры в методе дополнения - Счет,Субконто1,Субконто2,Субконто3,
	//если их имя не совпадает с именем параметра
	
	//Если одноименные колонки уже есть, сначала удалим их, а потом переименуем нужные.
	КартаРС = КартыДанных[ИмяКарты];
	Если ПараметрыМетода.Счет <> "Счет" Тогда
		Если КартаРС.Колонки.Найти("Счет") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Счет");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Счет);
		ТекКолонка.Имя = "Счет";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто1 <> "Субконто1" Тогда
		Если КартаРС.Колонки.Найти("Субконто1") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто1");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто1);
		ТекКолонка.Имя = "Субконто1";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто2 <> "Субконто2" Тогда
		Если КартаРС.Колонки.Найти("Субконто2") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто2");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто2);
		ТекКолонка.Имя = "Субконто2";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто3 <> "Субконто3" Тогда
		Если КартаРС.Колонки.Найти("Субконто3") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто3");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто3);
		ТекКолонка.Имя = "Субконто3";
	КонецЕсли;
	
	ПараметрыИзДокумента = Ложь;
	Значение = Неопределено;
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") 
		И СтруктураПараметров.Свойство("ПараметрыИзДокумента",Значение)
			И ТипЗнч(Значение) = Тип("Булево") Тогда
		ПараметрыИзДокумента = Значение;
	КонецЕсли;
	
	СоответствиеСчетаБезКЭК = Новый Соответствие;
	
	УчитыватьКартуКЭК000 = Истина;//общая настройка правила заполнения на использование карты данных СчетаБезКЭК
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("УчитыватьКартуКЭК000") Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Структура") Тогда
			
			Если ДополнительныеПараметры.УчитыватьКартуКЭК000.Свойство("ПравоеЗначение")
				И ДополнительныеПараметры.УчитыватьКартуКЭК000.ПравоеЗначение = Ложь Тогда
				
				УчитыватьКартуКЭК000 = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Булево") Тогда
			
			УчитыватьКартуКЭК000 = ДополнительныеПараметры.УчитыватьКартуКЭК000;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КартаСчетовБезКЭК = Неопределено;
	Если УчитыватьКартуКЭК000 = Истина
		И КартыДанных.Свойство("СчетаБезКЭК",КартаСчетовБезКЭК) Тогда
		Если КартаСчетовБезКЭК.Колонки.Найти("Счет") <> Неопределено
			И КартаСчетовБезКЭК.Колонки.Найти("Использовать")<> Неопределено Тогда
			
			Для Каждого СтрКарты Из КартаСчетовБезКЭК.НайтиСтроки(Новый Структура("Использовать",Истина)) Цикл
				СоответствиеСчетаБезКЭК.Вставить(СтрКарты.Счет,Истина);	
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Субконто1");
	ТаблицаДанных.Колонки.Добавить("Субконто2");
	ТаблицаДанных.Колонки.Добавить("Субконто3");
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("КЭК",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	
	//Для 173/773 нужны суммы только развернутого остатка
	
	ТаблицаДанных.Колонки.Добавить("ОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("ОстатокКт",ТипЧисло);
		
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И НЕ Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		УсловиеОрганизация = " И Организация = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;	
	
	Условие = УсловиеБаланс + УсловиеОрганизация;
	Условие = Сред(Условие,3);		
		
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);//Истина); - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("ВидКПС",Ложь);//для баланса не нужен
	СтруктураПолей.Вставить("Субконто1",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто2",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто3",Истина);//-меняется динамически
	СтруктураПолей.Вставить("КЭК",Истина);// - используется с 2021 года
		
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Ложь,Ложь);//0
	ДополнитьТаблицуПоРазворотуСубконтоНаДату(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, ДатаОстатков);	

	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Ложь,Ложь);//1
	ДополнитьТаблицуПоРазворотуСубконтоНаДату(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, ДатаОстатков);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Истина,Ложь);//2
	ДополнитьТаблицуПоРазворотуСубконтоНаДату(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, ДатаОстатков);	

	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Ложь,Истина);//3
	ДополнитьТаблицуПоРазворотуСубконтоНаДату(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, ДатаОстатков);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Истина,Ложь);//1,2
	ДополнитьТаблицуПоРазворотуСубконтоНаДату(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, ДатаОстатков);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Ложь,Истина);//1,3
	ДополнитьТаблицуПоРазворотуСубконтоНаДату(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, ДатаОстатков);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Истина,Истина);//2,3
	ДополнитьТаблицуПоРазворотуСубконтоНаДату(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, ДатаОстатков);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Истина,Истина);//1,2,3
	ДополнитьТаблицуПоРазворотуСубконтоНаДату(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, ДатаОстатков);	
	
	//КЭК НЕ убираем, т.к. теперь в разрезе КЭК нужны данные
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК","ОстатокДт,ОстатокКт");
	//ТаблицаДанных.Сортировать("Организация,Счет,КФО,КПС,Субконто1,Субконто2,Субконто3,ИФО");
		
	ЗаполнитьДетальныйКЭКВТаблицеДанных(ТаблицаДанных,СоответствиеСчетаБезКЭК);
		
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ИФО,КФО,КЭК","ОстатокДт,ОстатокКт");
	
	//Т.к. в начале года остатки на 001-009, в середине года обороты по 56х/66х и 73х/83х, то после замены кэк нужно исправить конечные остатки,
	//иначе получится, что если до замены было: 
	//по 001 остаток на начало по дт 100,
	//по 561/661 оборот в кт 150
	//и на конец года будет по 001 остаток по дт 100, а по 561/661 остаток по кт 150.
	//А должно быть по 001 остаток на конец по кт 50, и все.
	
	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
		//т.к. форма может заполняться не с начала года, то остатки на начало отчетного периода могут быть на разных КЭК - 561/661,
		//необходимо их объединить
		Если СтрТЧ.ОстатокДт <> 0
			ИЛИ СтрТЧ.ОстатокКт <> 0 Тогда
			
			Если СтрТЧ.ОстатокДт >= СтрТЧ.ОстатокКт Тогда
				СтрТЧ.ОстатокДт = СтрТЧ.ОстатокДт - СтрТЧ.ОстатокКт;
				СтрТЧ.ОстатокКт = 0;
			Иначе
				СтрТЧ.ОстатокКт = СтрТЧ.ОстатокКт - СтрТЧ.ОстатокДт;
				СтрТЧ.ОстатокДт = 0;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
		
	//После того как распределили задолженность, можно свернуть таблицу детальных данных
	//КПС в данном наборе не нужен, по нему свернем.
	//По организации и ИФО сворачивать нельзя никогда, 
	//т.к. в правилах заполнения на набор дополнительно накладываются по ним отбор.
	//КЭК теперь не нужно, его убираем.
	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО","ОстатокДт,ОстатокКт");
	
	КартаРС = Неопределено;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Процедура ДополнитьТаблицуПоРазворотуСубконтоНаДату(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, ДатаОстатков)
	
	МассивСтрок = КартаРС.НайтиСтроки(СтруктураОтбора);
			
	МассивСчетов = Новый Массив;
	Если МассивСтрок.Количество() >0 Тогда
		Для Каждого ТекСтр Из МассивСтрок Цикл
			МассивСчетов.Добавить(ТекСтр.Счет);
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
			СтруктураПолей.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);
		КонецЦикла;
	
		ДополнитьТаблицуПоДаннымОстатков(ТаблицаДанных, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, ДатаОстатков);
		
	КонецЕсли;
	
КонецПроцедуры

// Для заполнения 2 раздела формы 0503191 - только дебиторская задолженность по 206 счету по КФО 1, 
// другие варианты использования функции - при необходимости.
Функция ПолучитьВНД_ЗадолженностьПоСрокамИсполнения(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
	
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	КонецПериода = ЗаполнениеОтчетности.ПолучитьДатуИзПараметра(КонецПериода);
		
	ТаблицаМетодовДополнительнойОбработки = Справочники.ПравилаЗаполнения.ПолучитьТаблицуМетодов(ПравилоЗаполнения,,,Истина);
	КартыДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	ОбработкаЗаполнения = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(КартыДанных, "КартыДанных", ТаблицаМетодовДополнительнойОбработки, ПравилоЗаполнения, Неопределено, "") Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	ТипСтрока = БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(0);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("СчетРасчетов",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
    ТаблицаДанных.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанных.Колонки.Добавить("Договор",Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ТаблицаДанных.Колонки.Добавить("ВидЗадолженности",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗадолженности"));
	ТаблицаДанных.Колонки.Добавить("ТипЗадолженности",ТипСтрока);	
	
	// Набор колонок соответствует данным КонтрольИсполненияДоговоров.АнализЗадолженности.
	МассивИменКолонокСумм = Новый Массив;
	МассивИменКолонокСумм.Добавить("Краткосрочная");             // Менее 1 года от отчетной даты = краткосрочная (итого) + просроченная.
	МассивИменКолонокСумм.Добавить("ТекущаяКраткосрочная");      // Краткосрочная за исключением просроченной.
	МассивИменКолонокСумм.Добавить("КраткосрочнаяДоКонцаГода");  // Краткосрочная до конца текущего года.
	МассивИменКолонокСумм.Добавить("Долгосрочная");              // Более 1 года от отчетной даты = долгосрочная (итого).
	МассивИменКолонокСумм.Добавить("ДолгосрочнаяБолее2Лет");     // Более 2 лет от отчетной даты.
	МассивИменКолонокСумм.Добавить("ДолгосрочнаяБолее3Лет");     // Более 3 лет от отчетной даты.
	МассивИменКолонокСумм.Добавить("ДолгосрочнаяБолее5Лет");     // Более 5 лет от отчетной даты.
	МассивИменКолонокСумм.Добавить("Просроченная");              // Менее отчетной даты = просроченная итого.
	МассивИменКолонокСумм.Добавить("ПросроченнаяБолее30Дней");   // Более 30 дней от отчетной даты.
	МассивИменКолонокСумм.Добавить("ПросроченнаяБолее60Дней");   // Более 60 дней от отчетной даты.
	МассивИменКолонокСумм.Добавить("ПросроченнаяБолее90Дней");   // Более 90 дней от отчетной даты.
	МассивИменКолонокСумм.Добавить("ПросроченнаяБолее180Дней");  // Более 180 дней от отчетной даты.
	МассивИменКолонокСумм.Добавить("ПросроченнаяБолее1Года");    // Более 1 года от отчетной даты.
	МассивИменКолонокСумм.Добавить("ПросроченнаяБолее3Лет");     // БОлее 3 лет от отчетной даты.
	
	МассивРублевыхКолонок = Новый Массив;
	//В имя колонки добавляем "Руб", т.к. нам нужны рублевые суммы, без "Руб" - в валюте договора, и она может отличаться от валюты регл.учета
	Для Каждого ИмяКолонкиСуммы Из МассивИменКолонокСумм Цикл
		ИмяРублевойКолонки = ИмяКолонкиСуммы+"Руб";
		ТаблицаДанных.Колонки.Добавить(ИмяРублевойКолонки,ТипЧисло);
		МассивРублевыхКолонок.Добавить(ИмяРублевойКолонки);
	КонецЦикла;
	
	СтруктураПолейОтбора = Новый Структура("Организация");
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " Ссылка = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " Ссылка <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " Ссылка В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " НЕ Ссылка В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " Ссылка <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " Ссылка = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " Ссылка = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеОрганизация = " Ссылка = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеОрганизация = " Ссылка <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеОрганизация = " Ссылка В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеОрганизация = " НЕ Ссылка В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеОрганизация = " Ссылка <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеОрганизация = " Ссылка = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		УсловиеОрганизация = " Ссылка = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;
	
	МассивИФО = Новый Массив;
	Если ЕстьИФО Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИФО",СтруктураПолейОтбора.ИФО);
		ТекстЗапроса = "ВЫБРАТЬ
		|	Спр.Ссылка КАК ИФО
		|ИЗ
		|	Справочник.ИсточникиФинансовогоОбеспечения КАК Спр
		|ГДЕ
		|	&Условие";
		
		Запрос.Текст = СтрЗаменить(ТекстЗапроса,"&Условие",УсловиеБаланс);
		МассивИФО = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	КонецЕсли;
	
	МассивОрганизаций = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",СтруктураПолейОтбора.Организация);
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Спр.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Спр
	|ГДЕ
	|	&Условие";
	
	Если НЕ ЗначениеЗаполнено(УсловиеОрганизация) Тогда
		УсловиеОрганизация = "ИСТИНА";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса,"&Условие",УсловиеОрганизация);
	МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
	ВидЗадолженности = Неопределено;
	ПараметрВидЗадолженности = ПараметрыСхемы.Найти("ВидЗадолженностиПоСрокамИсп_"+ИмяНабора);
	Если ПараметрВидЗадолженности <> Неопределено Тогда
		ВидЗадолженности = ПараметрВидЗадолженности.Значение;
	КонецЕсли;
	
	ТипЗадолженности = Неопределено;
	ПараметрТипЗадолженности = ПараметрыСхемы.Найти("ТипЗадолженностиПоСрокамИсп_"+ИмяНабора);	
	Если ПараметрТипЗадолженности <> Неопределено Тогда
		ТипЗадолженности = ПараметрТипЗадолженности.Значение;
	КонецЕсли;
	
	СчетРасчетов = Неопределено;
	ПараметрСчетРасчетов = ПараметрыСхемы.Найти("СчетРасчетовПоСрокамИсп_"+ИмяНабора);
	Если ПараметрСчетРасчетов <> Неопределено Тогда
		СчетРасчетов = ПараметрСчетРасчетов.Значение;
	КонецЕсли;
	
	Отбор = Новый Структура;
	
	// Отбор по КФО выполняется в отборе набора данных, поскольку при заполнении по КФО 1 других данных в таблице по казенному учреждению нет, 
	// а при заполнении по КФО 2,4,5,6,7 может потребоваться заполнение по нескольким КФО одновременно.
	
	Если ЕстьИФО Тогда
		Отбор.Вставить("ИФО",МассивИФО);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетРасчетов) Тогда
		Отбор.Вставить("СчетРасчетов",СчетРасчетов);
	КонецЕсли;	
	
	ОбщаяТаблица = Неопределено;
	
	//ТаблицаДанных.Колонки.Добавить("Валюта",Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	Для Каждого ТекОрганизация Из МассивОрганизаций Цикл
		ТаблицаАнализЗадолженностиОрг = КонтрольИсполненияДоговоров.АнализЗадолженности(ТекОрганизация,КонецПериода,Отбор,ВидЗадолженности,ТипЗадолженности,Истина);
		Для Каждого СтрТЧ Из ТаблицаАнализЗадолженностиОрг Цикл
			
			Если ТипЗадолженности = "Дт206" Тогда
				// АнализЗадолженности использует замену счета 206 на счет 302,
				// для использования в алгоритмах контроля договоров. 
				// Необходимо их заменить обратно для использования в данных отчета.
				ТекСчетРасчетов = СтрТЧ.СчетРасчетов;
				СтрТЧ.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("206." + Прав(Строка(ТекСчетРасчетов), 2), КонецПериода, ТекОрганизация);
			КонецЕсли;	
				
			ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),СтрТЧ);
		КонецЦикла;
	КонецЦикла;
	
	СуммовыеПоказатели = СтрСоединить(МассивРублевыхКолонок,",");
	ТаблицаДанных.Свернуть("СчетРасчетов,Организация,КПС,ИФО,КФО,Контрагент,ИФО,Договор,ВидЗадолженности,ТипЗадолженности",СуммовыеПоказатели);
	
	//уберем из имени суммовых колонок "Руб", т.к. в СКД ожидаются поля набора данных без "Руб"
	Для Каждого ИмяКолонкиСуммы Из МассивИменКолонокСумм Цикл
		ИмяРублевойКолонки = ИмяКолонкиСуммы+"Руб";
		ТекКолонка = ТаблицаДанных.Колонки.Найти(ИмяРублевойКолонки);
		ТекКолонка.Имя = ИмяКолонкиСуммы;		
	КонецЦикла; 
	
	Возврат ТаблицаДанных
	
КонецФункции	
	
#КонецОбласти

#Область ПолучитьВНД_Долгосрочная

Функция ПолучитьВНД_Долгосрочная(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
	Перем ВидЗадолженности;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ДополнительныеПараметры.Свойство("ВидЗадолженности", ВидЗадолженности);
	КонецЕсли;

	НачалоПериода = НачалоДня(НачалоПериода - 1);
	КонецПериода = НачалоДня(ЗаполнениеОтчетности.ПолучитьДатуИзПараметра(КонецПериода));
		
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ВидПоказателя",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКБК"));
	ТаблицаДанных.Колонки.Добавить("ВидЗадолженностиДтКт",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗадолженности"));
	ТаблицаДанных.Колонки.Добавить("ТипКонтрагентаКод",Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанных.Колонки.Добавить("Договор",Новый ОписаниеТипов("СправочникСсылка.Договоры"));	
	
	ТаблицаДанных.Колонки.Добавить("ДолгосрочнаяНачало",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("ДолгосрочнаяКонец",ТипЧисло);
	
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ДолгосрочнаяПросроченнаяЗадолженность.ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";//переопредится далее на равно
	
	УсловиеСпрОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
				УсловиеСпрОрганизация = "Ссылка = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация <> &Организация";
				УсловиеСпрОрганизация = "Ссылка <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация В (&Организация)";
				УсловиеСпрОрганизация = "Ссылка В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				//УсловиеОрганизация = " И НЕ ДолгосрочнаяПросроченнаяЗадолженность.Организация В (&Организация)";
				УсловиеСпрОрганизация = "НЕ Ссылка В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация <> &Организация";
				УсловиеСпрОрганизация = "Ссылка <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
				УсловиеСпрОрганизация = "Ссылка = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
		УсловиеСпрОрганизация = "Ссылка = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;	
	
	УсловиеВидЗадолженностиДтКт = "";
	
	Если ТипЗнч(ВидЗадолженности) = Тип("Структура") Тогда
		Если ВидЗадолженности.Свойство("Использование") 
			И ВидЗадолженности.Использование = Истина Тогда
			
			Если ВидЗадолженности.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				И Строка(ВидЗадолженности.ПравоеЗначение) = "Кредиторская задолженность" Тогда
				УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
				СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Кредиторская);
			ИначеЕсли ВидЗадолженности.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				И Строка(ВидЗадолженности.ПравоеЗначение) = "Дебиторская задолженность" Тогда
				УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
				СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Дебиторская);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВидЗадолженности) = Тип("СправочникСсылка.Субконто") Тогда
		Если Строка(ВидЗадолженности) = "Кредиторская задолженность" Тогда
			УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
			СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Кредиторская);
		ИначеЕсли Строка(ВидЗадолженности) = "Дебиторская задолженность" Тогда
			УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
			СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Дебиторская);
		КонецЕсли;
	КонецЕсли;
		
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);//Истина); - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("КЭК",Ложь);//для отчетов до 2021 года не нужен
	СтруктураПолей.Вставить("ВидПоказателя",Истина);//нужен в основном для 169 формы, для поддержки различий БГУ1 и БГУ2
	
	КодОКУД = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоЗаполнения, "Владелец.КодФормыПоКлассификатору"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	&Условие";
	
	Если ЗначениеЗаполнено(УсловиеСпрОрганизация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие",УсловиеСпрОрганизация);
		Запрос.УстановитьПараметр("Организация",СтруктураПолейОтбора.Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие","ИСТИНА");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивОрганизаций = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	//если отчет заполняется по нескольким организациям, то нужно для каждой организации индивидуально получать настройку - ДатыСУчетомИнвентаризации,
	//иначе остатки на начало года определяются не верно, потому сначала получаем организации по отбору, и по ним получаем настройку и данные регистра
	//и отбор в цикле задаем в этом случае всегда на равно	
	УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
	
	Условие = УсловиеБаланс + УсловиеОрганизация + УсловиеВидЗадолженностиДтКт;			
	УсловиеДляОпределенияДаты = УсловиеБаланс + УсловиеОрганизация;

	Для Каждого ТекОрг Из МассивОрганизаций Цикл
    	СтруктураПолейОтбора.Вставить("Организация",ТекОрг);
		
		ДатыСУчетомИнвентаризации = ОпределитьДатыСУчетомИнвентаризации(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, УсловиеДляОпределенияДаты, НачалоПериода, КонецПериода, КодОКУД);
		
		ДополнитьТаблицуПоДаннымДолгосрочной(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, ДатыСУчетомИнвентаризации.НачалоПериода, ДатыСУчетомИнвентаризации.КонецПериода, ДатыСУчетомИнвентаризации);
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО,КПС,ВидПоказателя,ВидЗадолженностиДтКт,ТипКонтрагентаКод,Контрагент,Договор","ДолгосрочнаяНачало,ДолгосрочнаяКонец");
		
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьВНД_ДолгосрочнаяКЭК(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
	Перем ВидЗадолженности;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ДополнительныеПараметры.Свойство("ВидЗадолженности", ВидЗадолженности);
	КонецЕсли;

	НачалоПериода = НачалоДня(НачалоПериода - 1);
	КонецПериода = НачалоДня(ЗаполнениеОтчетности.ПолучитьДатуИзПараметра(КонецПериода));
	
	//заполнить карты данных по методам обработки
	ТаблицаМетодовДополнительнойОбработки = Справочники.ПравилаЗаполнения.ПолучитьТаблицуМетодов(ПравилоЗаполнения,,,Истина);
	КартыДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	ОбработкаЗаполнения = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(КартыДанных, "КартыДанных", ТаблицаМетодовДополнительнойОбработки, ПравилоЗаполнения, Неопределено, "") Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	СоответствиеСчетаБезКЭК = Новый Соответствие;
	
	УчитыватьКартуКЭК000 = Истина;//общая настройка правила заполнения на использование карты данных СчетаБезКЭК
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("УчитыватьКартуКЭК000") Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Структура") Тогда
			
			Если ДополнительныеПараметры.УчитыватьКартуКЭК000.Свойство("ПравоеЗначение")
				И ДополнительныеПараметры.УчитыватьКартуКЭК000.ПравоеЗначение = Ложь Тогда
				
				УчитыватьКартуКЭК000 = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Булево") Тогда
			
			УчитыватьКартуКЭК000 = ДополнительныеПараметры.УчитыватьКартуКЭК000;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КартаСчетовБезКЭК = Неопределено;
	Если УчитыватьКартуКЭК000 = Истина
		И КартыДанных.Свойство("СчетаБезКЭК",КартаСчетовБезКЭК) Тогда
		Если КартаСчетовБезКЭК.Колонки.Найти("Счет") <> Неопределено
			И КартаСчетовБезКЭК.Колонки.Найти("Использовать")<> Неопределено Тогда
			
			Для Каждого СтрКарты Из КартаСчетовБезКЭК.НайтиСтроки(Новый Структура("Использовать",Истина)) Цикл
				СоответствиеСчетаБезКЭК.Вставить(СтрКарты.Счет,Истина);	
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("КЭК",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаДанных.Колонки.Добавить("ВидПоказателя",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКБК"));
	ТаблицаДанных.Колонки.Добавить("ВидЗадолженностиДтКт",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗадолженности"));
	ТаблицаДанных.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанных.Колонки.Добавить("Договор",Новый ОписаниеТипов("СправочникСсылка.Договоры"));	
	
	ТаблицаДанных.Колонки.Добавить("ДолгосрочнаяНачало",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("ДолгосрочнаяКонец",ТипЧисло);
	
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ДолгосрочнаяПросроченнаяЗадолженность.ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";//переопредится далее на равно
	
	УсловиеСпрОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
				УсловиеСпрОрганизация = "Ссылка = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация <> &Организация";
				УсловиеСпрОрганизация = "Ссылка <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация В (&Организация)";
				УсловиеСпрОрганизация = "Ссылка В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				//УсловиеОрганизация = " И НЕ ДолгосрочнаяПросроченнаяЗадолженность.Организация В (&Организация)";
				УсловиеСпрОрганизация = "НЕ Ссылка В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация <> &Организация";
				УсловиеСпрОрганизация = "Ссылка <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
				УсловиеСпрОрганизация = "Ссылка = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
		УсловиеСпрОрганизация = "Ссылка = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;
		
	УсловиеВидЗадолженностиДтКт = "";
	
	Если ТипЗнч(ВидЗадолженности) = Тип("Структура") Тогда
		Если ВидЗадолженности.Свойство("Использование") 
			И ВидЗадолженности.Использование = Истина Тогда
			
			Если ВидЗадолженности.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				И Строка(ВидЗадолженности.ПравоеЗначение) = "Кредиторская задолженность" Тогда
				УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
				СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Кредиторская);
			ИначеЕсли ВидЗадолженности.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				И Строка(ВидЗадолженности.ПравоеЗначение) = "Дебиторская задолженность" Тогда
				УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
				СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Дебиторская);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВидЗадолженности) = Тип("СправочникСсылка.Субконто") Тогда
		Если Строка(ВидЗадолженности) = "Кредиторская задолженность" Тогда
			УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
			СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Кредиторская);
		ИначеЕсли Строка(ВидЗадолженности) = "Дебиторская задолженность" Тогда
			УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
			СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Дебиторская);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);//Истина); - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("КЭК",Истина);//нужен для отчетов с 2021 года
	СтруктураПолей.Вставить("ВидПоказателя",Истина);//нужен в основном для 169 формы, для поддержки различий БГУ1 и БГУ2
	
	КодОКУД = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоЗаполнения, "Владелец.КодФормыПоКлассификатору"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	&Условие";
	
	Если ЗначениеЗаполнено(УсловиеСпрОрганизация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие",УсловиеСпрОрганизация);
		Запрос.УстановитьПараметр("Организация",СтруктураПолейОтбора.Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие","ИСТИНА");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивОрганизаций = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	//если отчет заполняется по нескольким организациям, то нужно для каждой организации индивидуально получать настройку - ДатыСУчетомИнвентаризации,
	//иначе остатки на начало года определяются не верно, потому сначала получаем организации по отбору, и по ним получаем настройку и данные регистра
	//и отбор в цикле задаем в этом случае всегда на равно	
	УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
	
	Условие = УсловиеБаланс + УсловиеОрганизация + УсловиеВидЗадолженностиДтКт;			
	УсловиеДляОпределенияДаты = УсловиеБаланс + УсловиеОрганизация;

	Для Каждого ТекОрг Из МассивОрганизаций Цикл
    	СтруктураПолейОтбора.Вставить("Организация",ТекОрг);
		
		ДатыСУчетомИнвентаризации = ОпределитьДатыСУчетомИнвентаризации(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, УсловиеДляОпределенияДаты, НачалоПериода, КонецПериода, КодОКУД);
		
		ДополнитьТаблицуПоДаннымДолгосрочной(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, ДатыСУчетомИнвентаризации.НачалоПериода, ДатыСУчетомИнвентаризации.КонецПериода, ДатыСУчетомИнвентаризации);
	КонецЦикла;
		
	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО,КПС,КЭК,ВидПоказателя,ВидЗадолженностиДтКт,Контрагент,Договор","ДолгосрочнаяНачало,ДолгосрочнаяКонец");
	
	КЭКПустаяСсылка = Справочники.КОСГУ.ПустаяСсылка();
	КЭК000 = Справочники.КОСГУ.НайтиПоКоду("000");
	
	Если ТаблицаДанных.Найти(КЭКПустаяСсылка, "КЭК") <> Неопределено Тогда
		
		МассивКонтрагентов = ТаблицаДанных.ВыгрузитьКолонку("Контрагент");
				
		Если МассивКонтрагентов.Количество() Тогда
			
			ТипыКонтрагентов = Новый Соответствие;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Контрагенты.Ссылка КАК Ссылка,
			|	Контрагенты.ТипКонтрагента.Код КАК ТипКонтрагентаКод
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Ссылка В(&МассивКонтрагентов)";
			
			Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ТипыКонтрагентов.Вставить(Выборка.Ссылка, Выборка.ТипКонтрагентаКод);
			КонецЦикла;
			
		Иначе
			ТипыКонтрагентов = Новый Соответствие;
		КонецЕсли;
		
		КЭКОстатков = ПолучитьКЭКОстатков();
		КЭКДляЗаменыОстатков = ПолучитьКЭКДляЗамены();
		КЭКСчетов = Новый Соответствие;
		
		Для Каждого СтрДанных Из ТаблицаДанных Цикл
			Если Не ЗначениеЗаполнено(СтрДанных.КЭК) Тогда
				// Если инвентариазция за 2020 год была заполнена без КЭК, дозаполняем КЭК по данным счета/контрагента.
				//Проверим, есть ли для счета единственный допустимый КЭК. 
				УстановитьДетальныйКЭКПоСчету(СтрДанных, СтрДанных.Счет, КЭКСчетов, КЭКДляЗаменыОстатков, КЭК000);
				
				Если НЕ ЗначениеЗаполнено(СтрДанных.КЭК) Тогда
				
					ТекТипКонтрагента = ТипыКонтрагентов[СтрДанных.Контрагент];
					КонтрагентЗаполнен = ЗначениеЗаполнено(СтрДанных.Контрагент);
					
					Если КонтрагентЗаполнен Тогда
						Если ТекТипКонтрагента = Неопределено Тогда
							КодКЭКПоКонтрагенту = "001"
						ИначеЕсли ЗначениеЗаполнено(ТекТипКонтрагента) Тогда
							КодКЭКПоКонтрагенту = "00"+ТекТипКонтрагента;
						Иначе
							КодКЭКПоКонтрагенту = "000";
						КонецЕсли;
					Иначе
						КодКЭКПоКонтрагенту = "001";
					КонецЕсли;
					СтрДанных.КЭК = КЭКОстатков.Получить(КодКЭКПоКонтрагенту);
					
				КонецЕсли;		
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
		
	//Для счетов из карты данных заменяем на КЭК 000
	Для Каждого СтрДанных Из ТаблицаДанных Цикл
		Если СоответствиеСчетаБезКЭК[СтрДанных.Счет] = Истина Тогда
			СтрДанных.КЭК = КЭК000;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО,КПС,КЭК,ВидПоказателя,ВидЗадолженностиДтКт,Контрагент,Договор","ДолгосрочнаяНачало,ДолгосрочнаяКонец");
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ОпределитьДатыСУчетомИнвентаризации(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, КодОКУД)
	
	ЭтоОтчетИзменениеВалютыБаланса = Ложь;
	//используется код ОКУД, а не код вида отчета, потому что могут быть не типовые виды отчетов с другим кодом вида отчета
	Если КодОКУД = "0503173" ИЛИ КодОКУД = "0503773" Тогда
		ЭтоОтчетИзменениеВалютыБаланса = Истина;	
	КонецЕсли;	

	ДатыСУчетомИнвентаризации = Новый Структура;
	ДатыСУчетомИнвентаризации.Вставить("НачалоПериода", НачалоПериода);
	ДатыСУчетомИнвентаризации.Вставить("КонецПериода", КонецПериода);
	
	// Для того, чтобы учесть исправления межотчетного периода по долгосрочной задолженности, используется спецаильный порядок ввода документов инвентаризации.
	// Основной режим ввода инвентаризации - последним днем предыдущего преиода (например, 31.12).
	// В этом случае, для отражения измненений межотчетного периода, следует ввести документ следующей датой (01.01).
	// Если такой документ найден, то используется дата, следующая за началом периода (используеются документы 01.01).
	ДатаПроверкиМежотчетныйПериод = НачалоДня(КонецДня(НачалоПериода)+1);
	
	//если это отчетность за 26 год и далее, то на начало года данные смотрим только у одного документа, 
	//последнего, введенного до даты окончания
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	    |	ДолгосрочнаяПросроченнаяЗадолженность.СчетРасчетов КАК Счет,
		|	ДолгосрочнаяПросроченнаяЗадолженность.Регистратор КАК Регистратор,
	    |	ДолгосрочнаяПросроченнаяЗадолженность.Организация КАК Организация,
		|	ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности КАК ВидЗадолженностиДтКт,
	    |	ДолгосрочнаяПросроченнаяЗадолженность.КФО КАК КФО, "+?(СтруктураПолей.ИФО,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.ИФО КАК ИФО,","")+"
		|	ДолгосрочнаяПросроченнаяЗадолженность.Долгосрочная КАК ДолгосрочнаяНачало,
		|	ДолгосрочнаяПросроченнаяЗадолженность.Просроченная КАК ПросроченнаяНачало
		|ИЗ
	    |	РегистрСведений.ДолгосрочнаяПросроченнаяЗадолженность КАК ДолгосрочнаяПросроченнаяЗадолженность
	    |ГДЕ
	    |	ДолгосрочнаяПросроченнаяЗадолженность.ДатаИнвентаризации = &ДатаПроверкиМежотчетныйПериод
		|	%УсловиеГод2026% 
		|	%Условие%
		|
	    |УПОРЯДОЧИТЬ ПО
	    |	Период УБЫВ";
	
	УсловиеГод2026 = "";
	Если Год(КонецПериода)>= 2026 Тогда
		УсловиеГод2026 = "И ДолгосрочнаяПросроченнаяЗадолженность.Период <= &ДатаОкончания";
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(КонецПериода));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаПроверкиМежотчетныйПериод", ДатаПроверкиМежотчетныйПериод);
			
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%УсловиеГод2026%",УсловиеГод2026);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	НачалоПериодаСУчетомИсправлений = НачалоПериода;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ДатыСУчетомИнвентаризации.Вставить("НачалоПериода", ДатаПроверкиМежотчетныйПериод);
		
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ДатыСУчетомИнвентаризации.Вставить("Регистратор",Выборка.Регистратор);	
		КонецЕсли;
		
		Если ЭтоОтчетИзменениеВалютыБаланса Тогда
			// Для того чтобы в 173/773 форме учитывать изменения валюты баланса без спец.периода, 
			// если введена корректирующая инвентаризация, используем существующие даты:
			// НачалоПериода - как дату с изменениями (на 01.01)
			// КонецПериода - как дату до изменений (31.12) - конец периода отчета при этом не используется при заполнении
			
			ДатыСУчетомИнвентаризации.Вставить("НачалоПериода", ДатаПроверкиМежотчетныйПериод);
			ДатыСУчетомИнвентаризации.Вставить("КонецПериода", НачалоПериода);
		КонецЕсли;
	Иначе
		Если ЭтоОтчетИзменениеВалютыБаланса Тогда
			//если это 173/773, и нет корректирующей инвентаризации на 01.01, то дату начала и дату окончания заполняем одинаково,
			//чтобы не было различий
			ДатыСУчетомИнвентаризации.Вставить("НачалоПериода", НачалоПериода);
			ДатыСУчетомИнвентаризации.Вставить("КонецПериода", НачалоПериода);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДатыСУчетомИнвентаризации;
	
КонецФункции

Процедура ДополнитьТаблицуПоДаннымДолгосрочной(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, СтруктураДат)
		
	//запрос надо изменять в зависимости от того, какие поля в Массиве полей
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ДолгосрочнаяПросроченнаяЗадолженность.СчетРасчетов КАК Счет,
	    |	ДолгосрочнаяПросроченнаяЗадолженность.Организация КАК Организация,
		|	ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности КАК ВидЗадолженностиДтКт,
	    |	ДолгосрочнаяПросроченнаяЗадолженность.КФО КАК КФО, "+?(СтруктураПолей.КПС,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.КПС КАК КПС,","")+?(СтруктураПолей.КЭК,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.КЭК КАК КЭК,","")+?(СтруктураПолей.ВидПоказателя,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.КПС.ВидПоказателя КАК ВидПоказателя,","")+?(СтруктураПолей.ИФО,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.ИФО КАК ИФО,","")+"
		|	ДолгосрочнаяПросроченнаяЗадолженность.Контрагент КАК Контрагент,
		|	ВЫБОР 
		|		КОГДА ДолгосрочнаяПросроченнаяЗадолженность.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			""1""
		|		КОГДА ДолгосрочнаяПросроченнаяЗадолженность.Контрагент.ТипКонтрагента = ЗНАЧЕНИЕ(Справочник.ТипыКонтрагентов.ПустаяСсылка) ТОГДА
		|			""0""
		|		ИНАЧЕ ДолгосрочнаяПросроченнаяЗадолженность.Контрагент.ТипКонтрагента.Код
		|	КОНЕЦ КАК ТипКонтрагентаКод,
		|	ДолгосрочнаяПросроченнаяЗадолженность.Договор КАК Договор,
		|	ДолгосрочнаяПросроченнаяЗадолженность.Долгосрочная КАК ДолгосрочнаяНачало,
	    |	0 КАК ДолгосрочнаяКонец
	    |ИЗ
	    |	РегистрСведений.ДолгосрочнаяПросроченнаяЗадолженность КАК ДолгосрочнаяПросроченнаяЗадолженность
	    |ГДЕ
	    |	ДолгосрочнаяПросроченнаяЗадолженность.ДатаИнвентаризации = &НачалоПериода
		|   И ДолгосрочнаяПросроченнаяЗадолженность.Долгосрочная <> 0
		|	%Условие%
		|	%УсловиеГод2026%
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	ДолгосрочнаяПросроченнаяЗадолженность.СчетРасчетов,
	    |	ДолгосрочнаяПросроченнаяЗадолженность.Организация,
		|	ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности,
	    |	ДолгосрочнаяПросроченнаяЗадолженность.КФО, "+?(СтруктураПолей.КПС,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.КПС,","")+?(СтруктураПолей.КЭК,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.КЭК,","")+?(СтруктураПолей.ВидПоказателя,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.КПС.ВидПоказателя,","")+?(СтруктураПолей.ИФО,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.ИФО,","")+"
		|	ДолгосрочнаяПросроченнаяЗадолженность.Контрагент,
	    |	ВЫБОР 
		|		КОГДА ДолгосрочнаяПросроченнаяЗадолженность.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			""1""
		|		КОГДА ДолгосрочнаяПросроченнаяЗадолженность.Контрагент.ТипКонтрагента = ЗНАЧЕНИЕ(Справочник.ТипыКонтрагентов.ПустаяСсылка) ТОГДА
		|			""0""
		|		ИНАЧЕ ДолгосрочнаяПросроченнаяЗадолженность.Контрагент.ТипКонтрагента.Код
		|	КОНЕЦ КАК ТипКонтрагентаКод,
		|	ДолгосрочнаяПросроченнаяЗадолженность.Договор,
	    |	0,
	    |	ДолгосрочнаяПросроченнаяЗадолженность.Долгосрочная
	    |ИЗ
	    |	РегистрСведений.ДолгосрочнаяПросроченнаяЗадолженность КАК ДолгосрочнаяПросроченнаяЗадолженность
	    |ГДЕ
	    |	ДолгосрочнаяПросроченнаяЗадолженность.ДатаИнвентаризации = &КонецПериода
		|   И ДолгосрочнаяПросроченнаяЗадолженность.Долгосрочная <> 0
		|	%Условие%";
	
	УсловиеГод2026 = "";
	Если НачалоДня(НачалоПериода) = НачалоГода(НачалоПериода)
		И Год(НачалоПериода) >= 2026
		И СтруктураДат.Свойство("Регистратор") Тогда
		УсловиеГод2026 = "И ДолгосрочнаяПросроченнаяЗадолженность.Регистратор = &Регистратор";
		Запрос.УстановитьПараметр("Регистратор", СтруктураДат.Регистратор);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%УсловиеГод2026%",УсловиеГод2026);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьДетальныйКЭКПоСчету(СтрокаТаблицыДанных, СчетДляКЭК, КЭКСчетов, КЭКДляЗаменыОстатков, КЭК000)
	
	КЭКОстаткаПоСчету = КЭКСчетов.Получить(СчетДляКЭК);
	Если КЭКОстаткаПоСчету = Неопределено Тогда
		Если СчетДляКЭК.БезДетализацииКОСГУ Тогда
			КЭКОстаткаПоСчету = КЭК000;
		Иначе
			КЭКПоЕПСБУ = СчетДляКЭК.КОСГУДт;
			КЭКОстаткаПоСчету = КЭКДляЗаменыОстатков.Получить(КЭКПоЕПСБУ);
			
			Если КЭКОстаткаПоСчету = КЭК000 Тогда
				КЭКОстаткаПоСчету = Неопределено;
			КонецЕсли;
		КонецЕсли;	
		
		Если КЭКОстаткаПоСчету <> Неопределено Тогда
			КЭКСчетов.Вставить(СчетДляКЭК, КЭКОстаткаПоСчету);
			СтрокаТаблицыДанных.КЭК = КЭКОстаткаПоСчету;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(КЭКОстаткаПоСчету) Тогда		
		СтрокаТаблицыДанных.КЭК = КЭКОстаткаПоСчету;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКЭКОстатков(НачальныйКИЕ = 0)
	
	Перем ВыборкаКЭКОстатков, Запрос, КодыКЭКОстатков, КЭКОстатков, РезультатЗапроса, Сч;
	
	КодыКЭКОстатков = Новый Массив;
	
	Для Сч = НачальныйКИЕ По 9 Цикл
		КодыКЭКОстатков.Добавить("00"+Сч);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОСГУ.Ссылка КАК Ссылка,
	|	КОСГУ.Код КАК КОСГУКод
	|ИЗ
	|	Справочник.КОСГУ КАК КОСГУ
	|ГДЕ
	|	КОСГУ.Код В(&КодыКЭКОстатков)";
	
	Запрос.УстановитьПараметр("КодыКЭКОстатков", КодыКЭКОстатков);

	КЭКОстатков = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаКЭКОстатков = РезультатЗапроса.Выбрать();
	Пока ВыборкаКЭКОстатков.Следующий() Цикл
		КЭКОстатков.Вставить(ВыборкаКЭКОстатков.КОСГУКод, ВыборкаКЭКОстатков.Ссылка);
	КонецЦикла;
	
	Возврат КЭКОстатков;
	
КонецФункции

#КонецОбласти

//строка 101 форм 130/730/173/773
#Область ПолучитьВНД_ДолгосрочныеАктивы

Функция ПолучитьВНД_ДолгосрочныеАктивы(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
	Перем ВидЗадолженности;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	НачалоПериода = НачалоДня(НачалоПериода - 1);
	КонецПериода = НачалоДня(ЗаполнениеОтчетности.ПолучитьДатуИзПараметра(КонецПериода));
	
	//заполнить карты данных по методам обработки
	ТаблицаМетодовДополнительнойОбработки = Справочники.ПравилаЗаполнения.ПолучитьТаблицуМетодов(ПравилоЗаполнения,,,Истина);
	КартыДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	ОбработкаЗаполнения = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(КартыДанных, "КартыДанных", ТаблицаМетодовДополнительнойОбработки, ПравилоЗаполнения, Неопределено, "") Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
		
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ОсновноеСредство",Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	
	ТаблицаДанных.Колонки.Добавить("ДолгосрочныеНачало",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("ДолгосрочныеКонец",ТипЧисло);
	
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ДолгосрочныеПраваПользованияАктивами.ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ДолгосрочныеПраваПользованияАктивами.ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ДолгосрочныеПраваПользованияАктивами.ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ДолгосрочныеПраваПользованияАктивами.ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ДолгосрочныеПраваПользованияАктивами.ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ДолгосрочныеПраваПользованияАктивами.ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ДолгосрочныеПраваПользованияАктивами.ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";//переопредится далее на равно
	
	УсловиеСпрОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
				УсловиеСпрОрганизация = "Ссылка = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация <> &Организация";
				УсловиеСпрОрганизация = "Ссылка <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация В (&Организация)";
				УсловиеСпрОрганизация = "Ссылка В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				//УсловиеОрганизация = " И НЕ ДолгосрочнаяПросроченнаяЗадолженность.Организация В (&Организация)";
				УсловиеСпрОрганизация = "НЕ Ссылка В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация <> &Организация";
				УсловиеСпрОрганизация = "Ссылка <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
				УсловиеСпрОрганизация = "Ссылка = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
		УсловиеСпрОрганизация = "Ссылка = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);//Истина); - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда

	КодОКУД = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоЗаполнения, "Владелец.КодФормыПоКлассификатору"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	&Условие";
	
	Если ЗначениеЗаполнено(УсловиеСпрОрганизация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие",УсловиеСпрОрганизация);
		Запрос.УстановитьПараметр("Организация",СтруктураПолейОтбора.Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие","ИСТИНА");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивОрганизаций = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	//если отчет заполняется по нескольким организациям, то нужно для каждой организации индивидуально получать настройку - ДатыСУчетомИнвентаризации,
	//иначе остатки на начало года определяются не верно, потому сначала получаем организации по отбору, и по ним получаем настройку и данные регистра
	//и отбор в цикле задаем в этом случае всегда на равно	
	УсловиеОрганизация = " И ДолгосрочныеПраваПользованияАктивами.Организация = &Организация";
	
	Условие = УсловиеБаланс + УсловиеОрганизация;			
	УсловиеДляОпределенияДаты = УсловиеБаланс + УсловиеОрганизация;

	Для Каждого ТекОрг Из МассивОрганизаций Цикл
		СтруктураПолейОтбора.Вставить("Организация",ТекОрг);
		
		ДатыСУчетомИнвентаризации = ОпределитьДатыСУчетомИнвентаризацииДляАктивов(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, УсловиеДляОпределенияДаты, НачалоПериода, КонецПериода, КодОКУД);
		
		ДополнитьТаблицуПоДаннымДолгосрочныхАктивов(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, ДатыСУчетомИнвентаризации.НачалоПериода, ДатыСУчетомИнвентаризации.КонецПериода);
	КонецЦикла;
		
	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО,КПС,ОсновноеСредство","ДолгосрочныеНачало,ДолгосрочныеКонец");
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ОпределитьДатыСУчетомИнвентаризацииДляАктивов(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, КодОКУД)
	
	ЭтоОтчетИзменениеВалютыБаланса = Ложь;

	//используется код ОКУД, а не код вида отчета, потому что могут быть не типовые виды отчетов с другим кодом вида отчета
	Если КодОКУД = "0503173" ИЛИ КодОКУД = "0503773" Тогда
		ЭтоОтчетИзменениеВалютыБаланса = Истина;	
	КонецЕсли;

	ДатыСУчетомИнвентаризации = Новый Структура;
	ДатыСУчетомИнвентаризации.Вставить("НачалоПериода", НачалоПериода);
	ДатыСУчетомИнвентаризации.Вставить("КонецПериода", КонецПериода);
	
	// Для того, чтобы учесть исправления межотчетного периода по долгосрочным активам, используется спецаильный порядок ввода документов инвентаризации.
	// Основной режим ввода инвентаризации - последним днем предыдущего преиода (например, 31.12).
	// В этом случае, для отражения измненений межотчетного периода, следует ввести документ следующей датой (01.01).
	// Если такой документ найден, то используется дата, следующая за началом периода (используеются документы 01.01).
	ДатаПроверкиМежотчетныйПериод = НачалоДня(КонецДня(НачалоПериода)+1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	    |	ДолгосрочныеПраваПользованияАктивами.СчетУчета КАК Счет,
	    |	ДолгосрочныеПраваПользованияАктивами.Организация КАК Организация,
		|	ДолгосрочныеПраваПользованияАктивами.ОсновноеСредство КАК ОсновноеСредство,
	    |	ДолгосрочныеПраваПользованияАктивами.КФО КАК КФО, "+?(СтруктураПолей.ИФО,"
		|	ДолгосрочныеПраваПользованияАктивами.ИФО КАК ИФО,","")+"
		|	ДолгосрочныеПраваПользованияАктивами.ОстаточнаяСтоимость КАК ОстаточнаяСтоимость,
		|	ДолгосрочныеПраваПользованияАктивами.Долгосрочные КАК Долгосрочные
	    |ИЗ
	    |	РегистрСведений.ДолгосрочныеПраваПользованияАктивами КАК ДолгосрочныеПраваПользованияАктивами
	    |ГДЕ
	    |	ДолгосрочныеПраваПользованияАктивами.ДатаИнвентаризации = &ДатаПроверкиМежотчетныйПериод 
		|	%Условие%";
	
	Запрос.УстановитьПараметр("ДатаПроверкиМежотчетныйПериод", ДатаПроверкиМежотчетныйПериод);
			
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	НачалоПериодаСУчетомИсправлений = НачалоПериода;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ДатыСУчетомИнвентаризации.Вставить("НачалоПериода", ДатаПроверкиМежотчетныйПериод);
		
		Если ЭтоОтчетИзменениеВалютыБаланса Тогда
			// Для того чтобы в 173/773 форме учитывать изменения валюты баланса без спец.периода, 
			// если введена корректирующая инвентаризация, используем существующие даты:
			// НачалоПериода - как дату с изменениями (на 01.01)
			// КонецПериода - как дату до изменений (31.12) - конец периода отчета при этом не используется при заполнении
			
			ДатыСУчетомИнвентаризации.Вставить("НачалоПериода", ДатаПроверкиМежотчетныйПериод);
			ДатыСУчетомИнвентаризации.Вставить("КонецПериода", НачалоПериода);
		КонецЕсли;
	Иначе
		Если ЭтоОтчетИзменениеВалютыБаланса Тогда
			//если это 173/773, и нет корректирующей инвентаризации на 01.01, то дату начала и дату окончания заполняем одинаково,
			//чтобы не было различий
			ДатыСУчетомИнвентаризации.Вставить("НачалоПериода", НачалоПериода);
			ДатыСУчетомИнвентаризации.Вставить("КонецПериода", НачалоПериода);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДатыСУчетомИнвентаризации;
	
КонецФункции

Процедура ДополнитьТаблицуПоДаннымДолгосрочныхАктивов(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода)
	
	//запрос надо изменять в зависимости от того, какие поля в Массиве полей
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ДолгосрочныеПраваПользованияАктивами.СчетУчета КАК Счет,
	    |	ДолгосрочныеПраваПользованияАктивами.Организация КАК Организация,
	    |	ДолгосрочныеПраваПользованияАктивами.КФО КАК КФО, 
		|	ДолгосрочныеПраваПользованияАктивами.КПС КАК КПС,"+?(СтруктураПолей.ИФО,"
		|	ДолгосрочныеПраваПользованияАктивами.ИФО КАК ИФО,","")+"
		|	ДолгосрочныеПраваПользованияАктивами.ОсновноеСредство КАК ОсновноеСредство,
		|	ДолгосрочныеПраваПользованияАктивами.Долгосрочные КАК ДолгосрочныеНачало,
	    |	0 КАК ДолгосрочныеКонец
	    |ИЗ
	    |	РегистрСведений.ДолгосрочныеПраваПользованияАктивами КАК ДолгосрочныеПраваПользованияАктивами
	    |ГДЕ
	    |	ДолгосрочныеПраваПользованияАктивами.ДатаИнвентаризации = &НачалоПериода
		|   И ДолгосрочныеПраваПользованияАктивами.Долгосрочные <> 0
		|	%Условие%
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	ДолгосрочныеПраваПользованияАктивами.СчетУчета КАК Счет,
	    |	ДолгосрочныеПраваПользованияАктивами.Организация КАК Организация,
	    |	ДолгосрочныеПраваПользованияАктивами.КФО КАК КФО, 
		|	ДолгосрочныеПраваПользованияАктивами.КПС КАК КПС,"+?(СтруктураПолей.ИФО,"
		|	ДолгосрочныеПраваПользованияАктивами.ИФО КАК ИФО,","")+"
		|	ДолгосрочныеПраваПользованияАктивами.ОсновноеСредство КАК ОсновноеСредство,
		|	0 КАК ДолгосрочныеНачало,
	    |	ДолгосрочныеПраваПользованияАктивами.Долгосрочные КАК ДолгосрочныеКонец
	    |ИЗ
	    |	РегистрСведений.ДолгосрочныеПраваПользованияАктивами КАК ДолгосрочныеПраваПользованияАктивами
	    |ГДЕ
	    |	ДолгосрочныеПраваПользованияАктивами.ДатаИнвентаризации = &КонецПериода
		|   И ДолгосрочныеПраваПользованияАктивами.Долгосрочные <> 0
		|	%Условие%";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область ПолучитьВНД_Просроченная

Функция ПолучитьВНД_Просроченная(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
	Перем ВидЗадолженности;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ДополнительныеПараметры.Свойство("ВидЗадолженности", ВидЗадолженности);
	КонецЕсли;

	НачалоПериода = НачалоДня(НачалоПериода - 1);
	КонецПериода = НачалоДня(ЗаполнениеОтчетности.ПолучитьДатуИзПараметра(КонецПериода));	
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	ТипДата = БюджетнаяОтчетность.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	ТипСтрока = Новый ОписаниеТипов("Строка");
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ВидПоказателя",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКБК"));
	ТаблицаДанных.Колонки.Добавить("ВидЗадолженностиДтКт",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗадолженности"));
	ТаблицаДанных.Колонки.Добавить("ТипКонтрагентаКод",Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанных.Колонки.Добавить("Договор",Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	
	ТаблицаДанных.Колонки.Добавить("ДатаВозникновения",ТипДата);
	ТаблицаДанных.Колонки.Добавить("ДатаИсполнения",ТипДата);
	ТаблицаДанных.Колонки.Добавить("ПричинаОбразованияКод",ТипСтрока);
	ТаблицаДанных.Колонки.Добавить("ПричинаОбразованияПояснение",ТипСтрока);
	ТаблицаДанных.Колонки.Добавить("ПричинаОбразованияДополнительно",ТипСтрока);
	
	ТаблицаДанных.Колонки.Добавить("ПросроченнаяНачало",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("ПросроченнаяКонец",ТипЧисло);
	
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ДолгосрочнаяПросроченнаяЗадолженность.ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";//переопредится далее на равно
	
	УсловиеСпрОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
				УсловиеСпрОрганизация = "Ссылка = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация <> &Организация";
				УсловиеСпрОрганизация = "Ссылка <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация В (&Организация)";
				УсловиеСпрОрганизация = "Ссылка В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				//УсловиеОрганизация = " И НЕ ДолгосрочнаяПросроченнаяЗадолженность.Организация В (&Организация)";
				УсловиеСпрОрганизация = "НЕ Ссылка В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация <> &Организация";
				УсловиеСпрОрганизация = "Ссылка <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
				УсловиеСпрОрганизация = "Ссылка = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
		УсловиеСпрОрганизация = "Ссылка = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;	
	
	УсловиеВидЗадолженностиДтКт = "";
	
	Если ТипЗнч(ВидЗадолженности) = Тип("Структура") Тогда
		Если ВидЗадолженности.Свойство("Использование") 
			И ВидЗадолженности.Использование = Истина Тогда
			
			Если ВидЗадолженности.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				И Строка(ВидЗадолженности.ПравоеЗначение) = "Кредиторская задолженность" Тогда
				УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
				СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Кредиторская);
			ИначеЕсли ВидЗадолженности.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				И Строка(ВидЗадолженности.ПравоеЗначение) = "Дебиторская задолженность" Тогда
				УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
				СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Дебиторская);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВидЗадолженности) = Тип("СправочникСсылка.Субконто") Тогда
		Если Строка(ВидЗадолженности) = "Кредиторская задолженность" Тогда
			УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
			СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Кредиторская);
		ИначеЕсли Строка(ВидЗадолженности) = "Дебиторская задолженность" Тогда
			УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
			СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Дебиторская);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);//Истина); - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("КЭК",Ложь);//не нужен до 2021 года
	СтруктураПолей.Вставить("ВидПоказателя",Истина);//нужен в основном для 169 формы, для поддержки различий БГУ1 и БГУ2
	
	КодОКУД = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоЗаполнения, "Владелец.КодФормыПоКлассификатору"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	&Условие";
	
	Если ЗначениеЗаполнено(УсловиеСпрОрганизация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие",УсловиеСпрОрганизация);
		Запрос.УстановитьПараметр("Организация",СтруктураПолейОтбора.Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие","ИСТИНА");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивОрганизаций = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	//если отчет заполняется по нескольким организациям, то нужно для каждой организации индивидуально получать настройку - ДатыСУчетомИнвентаризации,
	//иначе остатки на начало года определяются не верно, потому сначала получаем организации по отбору, и по ним получаем настройку и данные регистра
	//и отбор в цикле задаем в этом случае всегда на равно	
	УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
	
	Условие = УсловиеБаланс + УсловиеОрганизация + УсловиеВидЗадолженностиДтКт;			
	УсловиеДляОпределенияДаты = УсловиеБаланс + УсловиеОрганизация;

	Для Каждого ТекОрг Из МассивОрганизаций Цикл
    	СтруктураПолейОтбора.Вставить("Организация",ТекОрг);
		
		ДатыСУчетомИнвентаризации = ОпределитьДатыСУчетомИнвентаризации(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, УсловиеДляОпределенияДаты, НачалоПериода, КонецПериода, КодОКУД);
		
		ДополнитьТаблицуПоДаннымПросроченной(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, ДатыСУчетомИнвентаризации.НачалоПериода, ДатыСУчетомИнвентаризации.КонецПериода, ДатыСУчетомИнвентаризации);
	КонецЦикла;
		
	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО,КПС,
		|ВидПоказателя,ВидЗадолженностиДтКт,ТипКонтрагентаКод,Контрагент,Договор,
		|ДатаВозникновения,ДатаИсполнения,ПричинаОбразованияКод,ПричинаОбразованияПояснение,ПричинаОбразованияДополнительно",
		"ПросроченнаяНачало,ПросроченнаяКонец");
		
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьВНД_ПросроченнаяКЭК(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
	Перем ВидЗадолженности;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ДополнительныеПараметры.Свойство("ВидЗадолженности", ВидЗадолженности);
	КонецЕсли;
	
	//заполнить карты данных по методам обработки
	ТаблицаМетодовДополнительнойОбработки = Справочники.ПравилаЗаполнения.ПолучитьТаблицуМетодов(ПравилоЗаполнения,,,Истина);
	КартыДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	ОбработкаЗаполнения = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(КартыДанных, "КартыДанных", ТаблицаМетодовДополнительнойОбработки, ПравилоЗаполнения, Неопределено, "") Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	СоответствиеСчетаБезКЭК = Новый Соответствие;
	
	УчитыватьКартуКЭК000 = Истина;//общая настройка правила заполнения на использование карты данных СчетаБезКЭК
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("УчитыватьКартуКЭК000") Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Структура") Тогда
			
			Если ДополнительныеПараметры.УчитыватьКартуКЭК000.Свойство("ПравоеЗначение")
				И ДополнительныеПараметры.УчитыватьКартуКЭК000.ПравоеЗначение = Ложь Тогда
				
				УчитыватьКартуКЭК000 = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Булево") Тогда
			
			УчитыватьКартуКЭК000 = ДополнительныеПараметры.УчитыватьКартуКЭК000;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КартаСчетовБезКЭК = Неопределено;
	Если УчитыватьКартуКЭК000 = Истина
		И КартыДанных.Свойство("СчетаБезКЭК",КартаСчетовБезКЭК) Тогда
		Если КартаСчетовБезКЭК.Колонки.Найти("Счет") <> Неопределено
			И КартаСчетовБезКЭК.Колонки.Найти("Использовать")<> Неопределено Тогда
			
			Для Каждого СтрКарты Из КартаСчетовБезКЭК.НайтиСтроки(Новый Структура("Использовать",Истина)) Цикл
				СоответствиеСчетаБезКЭК.Вставить(СтрКарты.Счет,Истина);	
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	НачалоПериода = НачалоДня(НачалоПериода - 1);
	КонецПериода = НачалоДня(ЗаполнениеОтчетности.ПолучитьДатуИзПараметра(КонецПериода));	
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	ТипДата = БюджетнаяОтчетность.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	ТипСтрока = Новый ОписаниеТипов("Строка");
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("КЭК",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаДанных.Колонки.Добавить("ВидПоказателя",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКБК"));
	ТаблицаДанных.Колонки.Добавить("ВидЗадолженностиДтКт",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗадолженности"));
	ТаблицаДанных.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанных.Колонки.Добавить("Договор",Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	
	ТаблицаДанных.Колонки.Добавить("ДатаВозникновения",ТипДата);
	ТаблицаДанных.Колонки.Добавить("ДатаИсполнения",ТипДата);
	ТаблицаДанных.Колонки.Добавить("ПричинаОбразованияКод",ТипСтрока);
	ТаблицаДанных.Колонки.Добавить("ПричинаОбразованияПояснение",ТипСтрока);
	ТаблицаДанных.Колонки.Добавить("ПричинаОбразованияДополнительно",ТипСтрока);
	
	ТаблицаДанных.Колонки.Добавить("ПросроченнаяНачало",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("ПросроченнаяКонец",ТипЧисло);
	
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ДолгосрочнаяПросроченнаяЗадолженность.ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ДолгосрочнаяПросроченнаяЗадолженность.ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";//переопредится далее на равно
	
	УсловиеСпрОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
				УсловиеСпрОрганизация = "Ссылка = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация <> &Организация";
				УсловиеСпрОрганизация = "Ссылка <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация В (&Организация)";
				УсловиеСпрОрганизация = "Ссылка В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				//УсловиеОрганизация = " И НЕ ДолгосрочнаяПросроченнаяЗадолженность.Организация В (&Организация)";
				УсловиеСпрОрганизация = "НЕ Ссылка В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация <> &Организация";
				УсловиеСпрОрганизация = "Ссылка <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
				УсловиеСпрОрганизация = "Ссылка = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		//УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
		УсловиеСпрОрганизация = "Ссылка = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;	
	
	УсловиеВидЗадолженностиДтКт = "";
	
	Если ТипЗнч(ВидЗадолженности) = Тип("Структура") Тогда
		Если ВидЗадолженности.Свойство("Использование") 
			И ВидЗадолженности.Использование = Истина Тогда
			
			Если ВидЗадолженности.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				И Строка(ВидЗадолженности.ПравоеЗначение) = "Кредиторская задолженность" Тогда
				УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
				СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Кредиторская);
			ИначеЕсли ВидЗадолженности.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				И Строка(ВидЗадолженности.ПравоеЗначение) = "Дебиторская задолженность" Тогда
				УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
				СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Дебиторская);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВидЗадолженности) = Тип("СправочникСсылка.Субконто") Тогда
		Если Строка(ВидЗадолженности) = "Кредиторская задолженность" Тогда
			УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
			СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Кредиторская);
		ИначеЕсли Строка(ВидЗадолженности) = "Дебиторская задолженность" Тогда
			УсловиеВидЗадолженностиДтКт = " И ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности = &ВидЗадолженностиДтКт";
			СтруктураПолейОтбора.Вставить("ВидЗадолженностиДтКт",Перечисления.ВидыЗадолженности.Дебиторская);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);//Истина); - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("КЭК",Истина);//нужен с 2021 года
	СтруктураПолей.Вставить("ВидПоказателя",Истина);//нужен в основном для 169 формы, для поддержки различий БГУ1 и БГУ2
	
	КодОКУД = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПравилоЗаполнения, "Владелец.КодФормыПоКлассификатору"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	&Условие";
	
	Если ЗначениеЗаполнено(УсловиеСпрОрганизация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие",УсловиеСпрОрганизация);
		Запрос.УстановитьПараметр("Организация",СтруктураПолейОтбора.Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие","ИСТИНА");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивОрганизаций = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	//если отчет заполняется по нескольким организациям, то нужно для каждой организации индивидуально получать настройку - ДатыСУчетомИнвентаризации,
	//иначе остатки на начало года определяются не верно, потому сначала получаем организации по отбору, и по ним получаем настройку и данные регистра
	//и отбор в цикле задаем в этом случае всегда на равно	
	УсловиеОрганизация = " И ДолгосрочнаяПросроченнаяЗадолженность.Организация = &Организация";
	
	Условие = УсловиеБаланс + УсловиеОрганизация + УсловиеВидЗадолженностиДтКт;			
	УсловиеДляОпределенияДаты = УсловиеБаланс + УсловиеОрганизация;

	Для Каждого ТекОрг Из МассивОрганизаций Цикл
    	СтруктураПолейОтбора.Вставить("Организация",ТекОрг);
		
		ДатыСУчетомИнвентаризации = ОпределитьДатыСУчетомИнвентаризации(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, УсловиеДляОпределенияДаты, НачалоПериода, КонецПериода, КодОКУД);
		
		ДополнитьТаблицуПоДаннымПросроченной(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, ДатыСУчетомИнвентаризации.НачалоПериода, ДатыСУчетомИнвентаризации.КонецПериода, ДатыСУчетомИнвентаризации);
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО,КПС,КЭК,
		|ВидПоказателя,ВидЗадолженностиДтКт,Контрагент,Договор,
		|ДатаВозникновения,ДатаИсполнения,ПричинаОбразованияКод,ПричинаОбразованияПояснение,ПричинаОбразованияДополнительно",
		"ПросроченнаяНачало,ПросроченнаяКонец");
	
	КЭК000 = Справочники.КОСГУ.НайтиПоКоду("000");
	
	Если НачалоПериода = Дата(2020,12,31) Тогда
		
		МассивКонтрагентов = ТаблицаДанных.ВыгрузитьКолонку("Контрагент");
				
		Если МассивКонтрагентов.Количество() Тогда
			
			ТипыКонтрагентов = Новый Соответствие;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Контрагенты.Ссылка КАК Ссылка,
			|	Контрагенты.ТипКонтрагента.Код КАК ТипКонтрагентаКод
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.Ссылка В(&МассивКонтрагентов)";
			
			Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ТипыКонтрагентов.Вставить(Выборка.Ссылка, Выборка.ТипКонтрагентаКод);
			КонецЦикла;
			
		Иначе
			ТипыКонтрагентов = Новый Соответствие;
		КонецЕсли;
		
		КЭКОстатков = ПолучитьКЭКОстатков();
		КЭКДляЗаменыОстатков = ПолучитьКЭКДляЗамены();
		КЭКСчетов = Новый Соответствие;
		
		Для Каждого СтрДанных Из ТаблицаДанных Цикл
			Если Не ЗначениеЗаполнено(СтрДанных.КЭК) Тогда
				// Если инвентариазция за 2020 год была заполнена без КЭК, дозаполняем КЭК по данным счета/контрагента.
				//Проверим, есть ли для счета единственный допустимый КЭК. 
				УстановитьДетальныйКЭКПоСчету(СтрДанных, СтрДанных.Счет, КЭКСчетов, КЭКДляЗаменыОстатков, КЭК000);
				
				Если НЕ ЗначениеЗаполнено(СтрДанных.КЭК) Тогда
				
					ТекТипКонтрагента = ТипыКонтрагентов[СтрДанных.Контрагент];
					КонтрагентЗаполнен = ЗначениеЗаполнено(СтрДанных.Контрагент);
					
					Если КонтрагентЗаполнен Тогда
						Если ТекТипКонтрагента = Неопределено Тогда
							КодКЭКПоКонтрагенту = "001"
						ИначеЕсли ЗначениеЗаполнено(ТекТипКонтрагента) Тогда
							КодКЭКПоКонтрагенту = "00"+ТекТипКонтрагента;
						Иначе
							КодКЭКПоКонтрагенту = "000";
						КонецЕсли;
					Иначе
						КодКЭКПоКонтрагенту = "001";
					КонецЕсли;
					СтрДанных.КЭК = КЭКОстатков.Получить(КодКЭКПоКонтрагенту);
					
				КонецЕсли;		
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	//Для счетов из карты данных заменяем на КЭК 000
	Для Каждого СтрДанных Из ТаблицаДанных Цикл
		Если СоответствиеСчетаБезКЭК[СтрДанных.Счет] = Истина Тогда
			СтрДанных.КЭК = КЭК000;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО,КПС,КЭК,
		|ВидПоказателя,ВидЗадолженностиДтКт,Контрагент,Договор,
		|ДатаВозникновения,ДатаИсполнения,ПричинаОбразованияКод,ПричинаОбразованияПояснение,ПричинаОбразованияДополнительно",
		"ПросроченнаяНачало,ПросроченнаяКонец");
	
	Возврат ТаблицаДанных;
	
КонецФункции

Процедура ДополнитьТаблицуПоДаннымПросроченной(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, СтруктураДат)
	
	//запрос надо изменять в зависимости от того, какие поля в Массиве полей
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	ДолгосрочнаяПросроченнаяЗадолженность.СчетРасчетов КАК Счет,
	    |	ДолгосрочнаяПросроченнаяЗадолженность.Организация КАК Организация,
		|	ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности КАК ВидЗадолженностиДтКт,
	    |	ДолгосрочнаяПросроченнаяЗадолженность.КФО КАК КФО, "+?(СтруктураПолей.КПС,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.КПС КАК КПС,","")+?(СтруктураПолей.КЭК,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.КЭК КАК КЭК,","")+?(СтруктураПолей.ВидПоказателя,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.КПС.ВидПоказателя КАК ВидПоказателя,","")+?(СтруктураПолей.ИФО,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.ИФО КАК ИФО,","")+"
	    |	ВЫБОР 
		|		КОГДА ДолгосрочнаяПросроченнаяЗадолженность.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			""1""
		|		КОГДА ДолгосрочнаяПросроченнаяЗадолженность.Контрагент.ТипКонтрагента = ЗНАЧЕНИЕ(Справочник.ТипыКонтрагентов.ПустаяСсылка) ТОГДА
		|			""0""
		|		ИНАЧЕ ДолгосрочнаяПросроченнаяЗадолженность.Контрагент.ТипКонтрагента.Код
		|	КОНЕЦ КАК ТипКонтрагентаКод,
		|	ДолгосрочнаяПросроченнаяЗадолженность.Контрагент КАК Контрагент,
		|	ДолгосрочнаяПросроченнаяЗадолженность.Договор КАК Договор,
		|	НАЧАЛОПЕРИОДА(ДолгосрочнаяПросроченнаяЗадолженность.ДатаВозникновения, МЕСЯЦ) КАК ДатаВозникновения,
		|	НАЧАЛОПЕРИОДА(ДолгосрочнаяПросроченнаяЗадолженность.ДатаИсполнения, МЕСЯЦ) КАК ДатаИсполнения,
		|	ДолгосрочнаяПросроченнаяЗадолженность.ПричинаОбразованияКод КАК ПричинаОбразованияКод,
		|	ДолгосрочнаяПросроченнаяЗадолженность.ПричинаОбразованияПояснение КАК ПричинаОбразованияПояснение,
		|	ДолгосрочнаяПросроченнаяЗадолженность.ПричинаОбразованияДополнительно КАК ПричинаОбразованияДополнительно,
		|	ДолгосрочнаяПросроченнаяЗадолженность.Просроченная КАК ПросроченнаяНачало,
	    |	0 КАК ПросроченнаяКонец
	    |ИЗ
	    |	РегистрСведений.ДолгосрочнаяПросроченнаяЗадолженность КАК ДолгосрочнаяПросроченнаяЗадолженность
	    |ГДЕ
	    |	ДолгосрочнаяПросроченнаяЗадолженность.ДатаИнвентаризации = &НачалоПериода
		|   И ДолгосрочнаяПросроченнаяЗадолженность.Просроченная <> 0
		|	%Условие%
		|	%УсловиеГод2026%
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	ДолгосрочнаяПросроченнаяЗадолженность.СчетРасчетов,
	    |	ДолгосрочнаяПросроченнаяЗадолженность.Организация,
		|	ДолгосрочнаяПросроченнаяЗадолженность.ВидЗадолженности,
	    |	ДолгосрочнаяПросроченнаяЗадолженность.КФО, "+?(СтруктураПолей.КПС,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.КПС,","")+?(СтруктураПолей.КЭК,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.КЭК,","")+?(СтруктураПолей.ВидПоказателя,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.КПС.ВидПоказателя,","")+?(СтруктураПолей.ИФО,"
		|	ДолгосрочнаяПросроченнаяЗадолженность.ИФО,","")+"
	    |	ВЫБОР 
		|		КОГДА ДолгосрочнаяПросроченнаяЗадолженность.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
		|			""1""
		|		КОГДА ДолгосрочнаяПросроченнаяЗадолженность.Контрагент.ТипКонтрагента = ЗНАЧЕНИЕ(Справочник.ТипыКонтрагентов.ПустаяСсылка) ТОГДА
		|			""0""
		|		ИНАЧЕ ДолгосрочнаяПросроченнаяЗадолженность.Контрагент.ТипКонтрагента.Код
		|	КОНЕЦ КАК ТипКонтрагентаКод,
		|	ДолгосрочнаяПросроченнаяЗадолженность.Контрагент,
		|	ДолгосрочнаяПросроченнаяЗадолженность.Договор,
		|	НАЧАЛОПЕРИОДА(ДолгосрочнаяПросроченнаяЗадолженность.ДатаВозникновения, МЕСЯЦ),
		|	НАЧАЛОПЕРИОДА(ДолгосрочнаяПросроченнаяЗадолженность.ДатаИсполнения, МЕСЯЦ),
		|	ДолгосрочнаяПросроченнаяЗадолженность.ПричинаОбразованияКод,
		|	ДолгосрочнаяПросроченнаяЗадолженность.ПричинаОбразованияПояснение,
		|	ДолгосрочнаяПросроченнаяЗадолженность.ПричинаОбразованияДополнительно,
	    |	0,
	    |	ДолгосрочнаяПросроченнаяЗадолженность.Просроченная
	    |ИЗ
	    |	РегистрСведений.ДолгосрочнаяПросроченнаяЗадолженность КАК ДолгосрочнаяПросроченнаяЗадолженность
	    |ГДЕ
	    |	ДолгосрочнаяПросроченнаяЗадолженность.ДатаИнвентаризации = &КонецПериода
		|   И ДолгосрочнаяПросроченнаяЗадолженность.Просроченная <> 0
		|	%Условие%";
	
	УсловиеГод2026 = "";
	Если НачалоДня(НачалоПериода) = НачалоГода(НачалоПериода)
		И Год(НачалоПериода) >= 2026
		И СтруктураДат.Свойство("Регистратор") Тогда
		УсловиеГод2026 = "И ДолгосрочнаяПросроченнаяЗадолженность.Регистратор = &Регистратор";
		Запрос.УстановитьПараметр("Регистратор", СтруктураДат.Регистратор);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%УсловиеГод2026%",УсловиеГод2026);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

//для форм 110/710
Функция ПолучитьВНД_Обороты109(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
	Перем ВидЗадолженности;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Если ТипЗнч(КонецПериода) = Тип("Дата") Тогда
		КонецПериода = Новый Граница(КонецПериода,ВидГраницы.Включая);
	КонецЕсли;
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	ТипДата = БюджетнаяОтчетность.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	
	//Принцип работы:
	//1. Рассчитываем по отдельности обороты за год:
	//Д-т 109.60, К-т 109.70                - X
	//Д-т 109.60, К-т 109.80                - Y
	//Д-т 109.60, К-т <ПрочиеСчета>  		- Z
	//остаток 109.60 на начало года  		- A
	//остаток 109.60 на конец года  		- B

	//Нужно найти сколько оборотов X содержится в годовых оборотах Д-т 401.10, К-т 109.60 - обозначим O.
	// для счета 109.70 = O * X / (A + X + Y + Z - B) 
	// для счета 109.80 = O * Y / (A + X + Y + Z - B)
	//все расчеты выполняются в разрезе КФО, КПС, Организации, ИФО
	
		
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КПС401",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("КЭК401",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаДанных.Колонки.Добавить("КПС109",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("КЭК109",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаДанных.Колонки.Добавить("Субконто1_109");
	ТаблицаДанных.Колонки.Добавить("Субконто2_109");
	ТаблицаДанных.Колонки.Добавить("Субконто3_109");
	
	ТаблицаДанных.Колонки.Добавить("Сумма109",ТипЧисло);   //-O
	ТаблицаДанных.Колонки.Добавить("Сумма10970_ДляРасчета",ТипЧисло); //-X
	ТаблицаДанных.Колонки.Добавить("Сумма10980_ДляРасчета",ТипЧисло); //-Y
	ТаблицаДанных.Колонки.Добавить("СуммаПрочие_ДляРасчета",ТипЧисло);//-Z
	ТаблицаДанных.Колонки.Добавить("СуммаНачОст_ДляРасчета",ТипЧисло);//-A
	ТаблицаДанных.Колонки.Добавить("СуммаКонОст_ДляРасчета",ТипЧисло);//-B
	
	ТаблицаДанных.Колонки.Добавить("Сумма10970",ТипЧисло); //итоговые суммы для заполнения
	ТаблицаДанных.Колонки.Добавить("Сумма10980",ТипЧисло); //итоговые суммы для заполнения
	
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И НЕ Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		УсловиеОрганизация = " И Организация = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;	
		
	Условие = УсловиеБаланс + УсловиеОрганизация;		
	Условие = Сред(Условие,3);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);//Истина); - необходимо определять нужность ИФО в зависимости от параметров
	//СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	//СтруктураПолей.Вставить("КЭК",Ложь);//не нужен до 2021 года
	//СтруктураПолей.Вставить("ВидПоказателя",Истина);//нужен в основном для 169 формы, для поддержки различий БГУ1 и БГУ2
	
	ЗаполнитьТаблицуПоДанным401_10960(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода);
	
	//непосредственно расчет:
	// для счета 109.70 = O * X / (A + X + Y + Z - B) 
	// для счета 109.80 = O * Y / (A + X + Y + Z - B)
	ЛишниеСтроки = Новый Массив;
	Для Каждого СтрТаблицы Из ТаблицаДанных Цикл
		Обороты10960 = СтрТаблицы.СуммаНачОст_ДляРасчета + СтрТаблицы.Сумма10970_ДляРасчета + СтрТаблицы.Сумма10980_ДляРасчета	+ СтрТаблицы.СуммаПрочие_ДляРасчета - СтрТаблицы.СуммаКонОст_ДляРасчета;
		Если Обороты10960 = 0 Тогда
			ЛишниеСтроки.Добавить(СтрТаблицы);
			Продолжить;
		КонецЕсли;
		
		СтрТаблицы.Сумма10970 = СтрТаблицы.Сумма109 * СтрТаблицы.Сумма10970_ДляРасчета / Обороты10960;
		СтрТаблицы.Сумма10980 = СтрТаблицы.Сумма109 * СтрТаблицы.Сумма10980_ДляРасчета / Обороты10960;
		
		Если НЕ ЗначениеЗаполнено(СтрТаблицы.Сумма10970)
			И НЕ ЗначениеЗаполнено(СтрТаблицы.Сумма10980) Тогда
			ЛишниеСтроки.Добавить(СтрТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлМас Из ЛишниеСтроки Цикл
		ТаблицаДанных.Удалить(ЭлМас);	
	КонецЦикла;
		
	ТаблицаДанных.Свернуть("Организация,ИФО,КФО,КПС401,КЭК401,КПС109,КЭК109","Сумма10970,Сумма10980");
	
	//ТаблицаДанных.Колонки.Добавить("ВидПоказателя",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКБК"));
	
	//Если ТаблицаДанных.Количество()>0 Тогда
	//	
	//	//Заполнение вида показателя
	//	ТабКПС = ТаблицаДанных.Скопировать(,"КПС");
	//	ТабКПС.Свернуть("КПС");
	//	ЗначенияКПС = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТабКПС.ВыгрузитьКолонку("КПС"),"ВидПоказателя");
	//	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
	//		СтрТЧ.ВидПоказателя = ЗначенияКПС[СтрТЧ.КПС];
	//	КонецЦикла;
	//	
	//КонецЕсли;
		
	Возврат ТаблицаДанных;
	
КонецФункции

Процедура ЗаполнитьТаблицуПоДанным401_10960(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЖурналПроводокЕПСБУОбороты.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОбороты.КФО КАК КФО,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОбороты.ИФО КАК ИФО,","")+"
		|	ЖурналПроводокЕПСБУОбороты.КПС КАК КПС401,
		|	ЖурналПроводокЕПСБУОбороты.КЭК КАК КЭК401,
		|	ЖурналПроводокЕПСБУОбороты.КПСКор КАК КПС109,
		|	ЕстьNull(ЖурналПроводокЕПСБУОбороты.КорСубконто1,Неопределено) КАК Субконто1_109,
		|	ЕстьNull(ЖурналПроводокЕПСБУОбороты.КорСубконто2,Неопределено) КАК Субконто2_109,
		|	ЖурналПроводокЕПСБУОбороты.КЭККор КАК КЭК109,
		|	СУММА(ЖурналПроводокЕПСБУОбороты.СуммаОборот) КАК Сумма109
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(&НачалоПериода, &КонецПериода, , Счет В (&Счет401), ,%Условие% , КорСчет В (&Счет10960), ) КАК ЖурналПроводокЕПСБУОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналПроводокЕПСБУОбороты.Организация,
		|	ЖурналПроводокЕПСБУОбороты.КФО,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОбороты.ИФО,","")+"
		|	ЖурналПроводокЕПСБУОбороты.КПС,
		|	ЖурналПроводокЕПСБУОбороты.КЭК,
		|	ЖурналПроводокЕПСБУОбороты.КПСКор,
		|	ЕстьNull(ЖурналПроводокЕПСБУОбороты.КорСубконто1,Неопределено),
		|	ЕстьNull(ЖурналПроводокЕПСБУОбороты.КорСубконто2,Неопределено),
		|	ЖурналПроводокЕПСБУОбороты.КЭККор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЖурналПроводокЕПСБУОбороты.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОбороты.КФО КАК КФО,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОбороты.ИФО КАК ИФО,","")+"
		|	ЖурналПроводокЕПСБУОбороты.КПС КАК КПС109,
		|	ЕстьNull(ЖурналПроводокЕПСБУОбороты.Субконто1,Неопределено) КАК Субконто1_109,
		|	ЕстьNull(ЖурналПроводокЕПСБУОбороты.Субконто2,Неопределено) КАК Субконто2_109,
		|	ЖурналПроводокЕПСБУОбороты.КЭК КАК КЭК109,
		|	СУММА(ВЫБОР
		|			КОГДА ЖурналПроводокЕПСБУОбороты.КорСчет В (&Счет10970)
		|				ТОГДА ЖурналПроводокЕПСБУОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма10970_ДляРасчета,
		|	СУММА(ВЫБОР
		|			КОГДА ЖурналПроводокЕПСБУОбороты.КорСчет В (&Счет10980)
		|				ТОГДА ЖурналПроводокЕПСБУОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Сумма10980_ДляРасчета,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ ЖурналПроводокЕПСБУОбороты.КорСчет В (&СчетаКроме)
		|				ТОГДА ЖурналПроводокЕПСБУОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПрочие_ДляРасчета
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(&НачалоПериода, &КонецПериода, , Счет В (&Счет10960), ,%Условие% , , ) КАК ЖурналПроводокЕПСБУОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналПроводокЕПСБУОбороты.Организация,
		|	ЖурналПроводокЕПСБУОбороты.КФО,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОбороты.ИФО,","")+"
		|	ЖурналПроводокЕПСБУОбороты.КПС,
		|	ЕстьNull(ЖурналПроводокЕПСБУОбороты.Субконто1,Неопределено),
		|	ЕстьNull(ЖурналПроводокЕПСБУОбороты.Субконто2,Неопределено),
		|	ЖурналПроводокЕПСБУОбороты.КЭК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.КФО КАК КФО,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.ИФО КАК ИФО,","")+"
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.КПС КАК КПС109,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстаткиИОбороты.Субконто1, НЕОПРЕДЕЛЕНО) КАК Субконто1_109,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстаткиИОбороты.Субконто2, НЕОПРЕДЕЛЕНО) КАК Субконто2_109,
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.КЭК КАК КЭК109,
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачОст_ДляРасчета,
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонОст_ДляРасчета
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В (&Счет10960), ,%Условие% ) КАК ЖурналПроводокЕПСБУОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.Организация,
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.КФО,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.ИФО,","")+"
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.КПС,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстаткиИОбороты.Субконто1, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстаткиИОбороты.Субконто2, НЕОПРЕДЕЛЕНО),
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.КЭК,
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.СуммаНачальныйОстаток,
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.СуммаКонечныйОстаток";
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Счет10960", БухгалтерскийУчет.СписокСчетов("109.60"));
	Запрос.УстановитьПараметр("Счет10970", БухгалтерскийУчет.СписокСчетов("109.70"));
	Запрос.УстановитьПараметр("Счет10980", БухгалтерскийУчет.СписокСчетов("109.80"));
	Запрос.УстановитьПараметр("СчетаКроме", БухгалтерскийУчет.СписокСчетов("109.70,109.80,401.10"));
	Запрос.УстановитьПараметр("Счет401", БухгалтерскийУчет.СписокСчетов("401.10"));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[0].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("Организация,КФО,ИФО,КПС401,КЭК401,КПС109,КЭК109,Субконто1_109,Субконто2_109",
		"Сумма109,Сумма10970,Сумма10980,Сумма10970_ДляРасчета,Сумма10980_ДляРасчета,СуммаПрочие_ДляРасчета,СуммаНачОст_ДляРасчета,СуммаКонОст_ДляРасчета");
	
	Если СтруктураПолей.ИФО Тогда
		ТаблицаДанных.Индексы.Добавить("Организация,КФО,КПС109,КЭК109,Субконто1_109,Субконто2_109,ИФО");
	Иначе
		ТаблицаДанных.Индексы.Добавить("Организация,КФО,КПС109,КЭК109,Субконто1_109,Субконто2_109");	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПоиска = Новый Структура("Организация,КФО,КПС109,КЭК109,Субконто1_109,Субконто2_109"+?(СтруктураПолей.ИФО,",ИФО",""));
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,ВыборкаДетальныеЗаписи);
		МассивСтрок = ТаблицаДанных.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество()>0 Тогда
			Для Каждого ЭлМас Из МассивСтрок Цикл
				ЭлМас.Сумма10970_ДляРасчета = ЭлМас.Сумма10970_ДляРасчета + ВыборкаДетальныеЗаписи.Сумма10970_ДляРасчета;
				ЭлМас.Сумма10980_ДляРасчета = ЭлМас.Сумма10980_ДляРасчета + ВыборкаДетальныеЗаписи.Сумма10980_ДляРасчета;
				ЭлМас.СуммаПрочие_ДляРасчета = ЭлМас.СуммаПрочие_ДляРасчета + ВыборкаДетальныеЗаписи.СуммаПрочие_ДляРасчета;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[2].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПоиска = Новый Структура("Организация,КФО,КПС109,КЭК109,Субконто1_109,Субконто2_109"+?(СтруктураПолей.ИФО,",ИФО",""));
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,ВыборкаДетальныеЗаписи);
		МассивСтрок = ТаблицаДанных.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество()>0 Тогда
			Для Каждого ЭлМас Из МассивСтрок Цикл
				ЭлМас.СуммаНачОст_ДляРасчета = ЭлМас.СуммаНачОст_ДляРасчета + ВыборкаДетальныеЗаписи.СуммаНачОст_ДляРасчета;
				ЭлМас.СуммаКонОст_ДляРасчета = ЭлМас.СуммаКонОст_ДляРасчета + ВыборкаДетальныеЗаписи.СуммаКонОст_ДляРасчета;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ПолучитьВНД_ИсполнениеОбязательств

//для форм 175/775
Функция ПолучитьВНД_ИсполнениеОбязательств(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
		
	Если ТипЗнч(КонецПериода) = Тип("Дата") Тогда
		КонецПериода = Новый Граница(КонецПериода,ВидГраницы.Включая);
	КонецЕсли;	
	КонецПериодаДата = КонецДня(ЗаполнениеОтчетности.ПолучитьДатуИзПараметра(КонецПериода));
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	ТипДата = БюджетнаяОтчетность.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	ТипСтрока = БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(0);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ВидПоказателя",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКБК"));
	ТаблицаДанных.Колонки.Добавить("КОСГУ",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаДанных.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанных.Колонки.Добавить("Договор",Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	
	ТаблицаДанных.Колонки.Добавить("СуммаНеИсполнено",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("ДатаВозникновения",ТипДата);
	ТаблицаДанных.Колонки.Добавить("ДатаИсполнения",ТипДата);
	ТаблицаДанных.Колонки.Добавить("ПричинаКод",ТипСтрока);
	ТаблицаДанных.Колонки.Добавить("ПричинаНаименование",ТипСтрока);
	
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И НЕ Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		УсловиеОрганизация = " И Организация = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;	
	
	Условие = УсловиеБаланс + УсловиеОрганизация;
	Условие = Сред(Условие,3);		
		
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);//Истина); - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("ВидПоказателя",Истина);
	
	ПараметрСчетОбязательств = ПараметрыСхемы.Найти("СчетОбязательств_"+ИмяНабора);
	Если ПараметрСчетОбязательств <> Неопределено Тогда
		СчетОбязательств = БухгалтерскийУчет.СчетПоКоду(ПараметрСчетОбязательств.Значение,ЗаполнениеОтчетности.ПолучитьДатуИзПараметра(КонецПериода));
	Иначе	
		СчетОбязательств = БухгалтерскийУчет.СписокСчетов("502.11");
	КонецЕсли;
	
	СчетНКО = БухгалтерскийУчет.СписокСчетов("НКО.01");
	
	ПараметрИсполнениеПоБалансовым = ПараметрыСхемы.Найти("ИсполнениеПоБалансовым_"+ИмяНабора);
	Если ПараметрИсполнениеПоБалансовым <> Неопределено Тогда
		ИсполнениеПоБалансовым = ПараметрИсполнениеПоБалансовым.Значение;
	Иначе
		ИсполнениеПоБалансовым = Ложь;
	КонецЕсли;	
	
	ПараметрСчетаЗабаланс = ПараметрыСхемы.Найти("СчетаЗабаланс_"+ИмяНабора);
	Если ПараметрСчетаЗабаланс <> Неопределено Тогда
		СчетаЗабаланс = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаЗабаланс.Значение);
	Иначе	
		СчетаЗабаланс = БухгалтерскийУчет.СписокСчетов("17.01,17.03,17.07,18.01,18.03,18.07");
	КонецЕсли;
	
	ДополнитьТаблицуПоПринятымОбязательствам(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, СчетОбязательств);
	ДополнитьТаблицуЗабалансДт(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериодаДата, СчетОбязательств, СчетаЗабаланс);
	ДополнитьТаблицуЗабалансКт(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериодаДата, СчетОбязательств, СчетаЗабаланс);
	ДополнитьТаблицуПоНекассовымОперациям(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, СчетОбязательств, СчетНКО);
	Если ИсполнениеПоБалансовым = Истина Тогда
		ДополнитьТаблицуПоИсполнениюДт(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериодаДата,СчетОбязательств);
		ДополнитьТаблицуПоИсполнениюКт(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериодаДата,СчетОбязательств);
	КонецЕсли;	
	
	ТаблицаДанных.Свернуть("Счет,Организация,КФО,ИФО,КПС,ВидПоказателя,КОСГУ,Контрагент,Договор,ДатаВозникновения,ДатаИсполнения,ПричинаКод,ПричинаНаименование","СуммаНеИсполнено");
	
	Если ТаблицаДанных.Количество()>0 Тогда
		
		//Заполнение вида показателя
		ТабКПС = ТаблицаДанных.Скопировать(,"КПС");
		ТабКПС.Свернуть("КПС");
		ЗначенияКПС = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТабКПС.ВыгрузитьКолонку("КПС"),"ВидПоказателя");
		Для Каждого СтрТЧ Из ТаблицаДанных Цикл
			СтрТЧ.ВидПоказателя = ЗначенияКПС[СтрТЧ.КПС];
		КонецЦикла;
		
		//Заполнение дат договоров
		ТабДоговоров = ТаблицаДанных.Скопировать(,"Договор");
		ТабДоговоров.Свернуть("Договор");
		ДатыДоговоров = Новый Соответствие;
		Для Каждого СтрТЧ Из ТабДоговоров Цикл
			ДанныеДоговора = Новый Структура;
			ДанныеДоговора.Вставить("Возникновение", НачалоМесяца(ЗаполнениеОтчетности.ПолучитьРеквизитДоговора(СтрТЧ.Договор, "Возникновение", КонецПериодаДата)));
			ДанныеДоговора.Вставить("Окончание", НачалоМесяца(ЗаполнениеОтчетности.ПолучитьРеквизитДоговора(СтрТЧ.Договор, "Окончание", КонецПериодаДата)));
			
			ДатыДоговоров.Вставить(СтрТЧ.Договор, ДанныеДоговора); 
		КонецЦикла;
		
		Для Каждого СтрТЧ Из ТаблицаДанных Цикл
			СтрТЧ.ДатаВозникновения = ДатыДоговоров[СтрТЧ.Договор].Возникновение;
			СтрТЧ.ДатаИсполнения = ДатыДоговоров[СтрТЧ.Договор].Окончание;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Процедура ДополнитьТаблицуПоПринятымОбязательствам(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, СчетОбязательств)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналПроводокЕПСБУОборотыДтКт.СчетКт КАК Счет,
		|	ЖурналПроводокЕПСБУОборотыДтКт.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОборотыДтКт.КФО КАК КФО,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОборотыДтКт.ИФО КАК ИФО,","")+"
		|	ЖурналПроводокЕПСБУОборотыДтКт.КПСКт КАК КПС,
		|	ЖурналПроводокЕПСБУОборотыДтКт.КЭККт КАК КОСГУ,
		|	ВЫБОР 
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт1 ССЫЛКА Справочник.Договоры ТОГДА
		|			ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт1
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт2 ССЫЛКА Справочник.Договоры ТОГДА
		|			ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт2
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт3 ССЫЛКА Справочник.Договоры ТОГДА
		|			ЖурналПроводокЕПСБУОборотыДтКт.СубконтоКт3
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
		|		КОНЕЦ КАК Договор,
		|	ЖурналПроводокЕПСБУОборотыДтКт.СуммаОборот КАК СуммаНеИсполнено
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(&НачалоПериода, &КонецПериода, Авто, НЕ СчетДт В (&КоррСчетаИсключения), , СчетКт В ИЕРАРХИИ (&СчетОбязательств), ,%Условие%) КАК ЖурналПроводокЕПСБУОборотыДтКт";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	КоррСчетаИсключения = БухгалтерскийУчет.СписокСчетов("000");	
	Запрос.УстановитьПараметр("КоррСчетаИсключения", КоррСчетаИсключения);
	
	Запрос.УстановитьПараметр("СчетОбязательств", СчетОбязательств);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
КонецПроцедуры

Процедура ДополнитьТаблицуПоНекассовымОперациям(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, СчетОбязательств, СчетНКО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&СчетОбязательств КАК Счет,
		|	ЖурналПроводокЕПСБУОбороты.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОбороты.КФО КАК КФО,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОбороты.ИФО КАК ИФО,","")+"
		|	ЖурналПроводокЕПСБУОбороты.КПС КАК КПС,
		|	ЖурналПроводокЕПСБУОбороты.КЭК КАК КОСГУ,
		|	ВЫБОР
		|		КОГДА ЖурналПроводокЕПСБУОбороты.Субконто1 ССЫЛКА Справочник.Договоры
		|			ТОГДА ЖурналПроводокЕПСБУОбороты.Субконто1
		|		КОГДА ЖурналПроводокЕПСБУОбороты.Субконто2 ССЫЛКА Справочник.Договоры
		|			ТОГДА ЖурналПроводокЕПСБУОбороты.Субконто2
		|		КОГДА ЖурналПроводокЕПСБУОбороты.Субконто3 ССЫЛКА Справочник.Договоры
		|			ТОГДА ЖурналПроводокЕПСБУОбороты.Субконто3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
		|	КОНЕЦ КАК Договор,
		|	-ЖурналПроводокЕПСБУОбороты.СуммаОборот КАК СуммаНеИсполнено
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(&НачалоПериода, &КонецПериода, Авто, Счет В ИЕРАРХИИ (&СчетНКО), , %Условие%, , ) КАК ЖурналПроводокЕПСБУОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Запрос.УстановитьПараметр("СчетОбязательств", СчетОбязательств);
	Запрос.УстановитьПараметр("СчетНКО", СчетНКО);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
КонецПроцедуры

Процедура ДополнитьТаблицуЗабалансДт(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериодаДата, СчетОбязательств, СчетаЗабаланс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	&СчетОбязательств КАК Счет,
				|	ЖурналПроводокЕПСБУ.Организация КАК Организация,
				|	ЖурналПроводокЕПСБУ.КФО КАК КФО,"+?(СтруктураПолей.ИФО,"
				|	ЖурналПроводокЕПСБУ.ИФО КАК ИФО,","")+"
				|	ЖурналПроводокЕПСБУ.КПСДт КАК КПС,
				|	ЖурналПроводокЕПСБУ.КЭКДт КАК КОСГУ,
				|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУ.ХарактеристикаДвиженияДт КАК Справочник.Договоры) КАК Договор,
				|	ЖурналПроводокЕПСБУ.Сумма КАК СуммаНеИсполнено
				|ИЗ
				|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЖурналПроводокЕПСБУ
				|ГДЕ
				|	ЖурналПроводокЕПСБУ.Период >= &НачалоПериода
				|	И ЖурналПроводокЕПСБУ.Период <= &КонецПериода
				|	И ЖурналПроводокЕПСБУ.СчетДт В (&СчетаЗабаланс)
				|	И ЖурналПроводокЕПСБУ.Активность = ИСТИНА
				|	И ЖурналПроводокЕПСБУ.УточнениеПериода = 0
				|	%Условие%";
				
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериодаДата);
	Запрос.УстановитьПараметр("СчетОбязательств", СчетОбязательств);
	Запрос.УстановитьПараметр("СчетаЗабаланс", СчетаЗабаланс);
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",?(ЗначениеЗаполнено(Условие),"И "+Условие,""));
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
КонецПроцедуры

Процедура ДополнитьТаблицуЗабалансКт(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериодаДата, СчетОбязательств, СчетаЗабаланс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	&СчетОбязательств КАК Счет,
				|	ЖурналПроводокЕПСБУ.Организация КАК Организация,
				|	ЖурналПроводокЕПСБУ.КФО КАК КФО,"+?(СтруктураПолей.ИФО,"
				|	ЖурналПроводокЕПСБУ.ИФО КАК ИФО,","")+"
				|	ЖурналПроводокЕПСБУ.КПСКт КАК КПС,
				|	ЖурналПроводокЕПСБУ.КЭККт КАК КОСГУ,
				|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУ.ХарактеристикаДвиженияКт КАК Справочник.Договоры) КАК Договор,
				|	-ЖурналПроводокЕПСБУ.Сумма КАК СуммаНеИсполнено
				|ИЗ
				|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЖурналПроводокЕПСБУ
				|ГДЕ
				|	ЖурналПроводокЕПСБУ.Период >= &НачалоПериода
				|	И ЖурналПроводокЕПСБУ.Период <= &КонецПериода
				|	И ЖурналПроводокЕПСБУ.СчетКт В (&СчетаЗабаланс)
				|	И ЖурналПроводокЕПСБУ.Активность = ИСТИНА
				|	И ЖурналПроводокЕПСБУ.УточнениеПериода = 0
				|	%Условие%";
				
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериодаДата);
	Запрос.УстановитьПараметр("СчетОбязательств", СчетОбязательств);
	Запрос.УстановитьПараметр("СчетаЗабаланс", СчетаЗабаланс);
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",?(ЗначениеЗаполнено(Условие),"И "+Условие,""));
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
КонецПроцедуры

Процедура ДополнитьТаблицуПоИсполнениюДт(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериодаДата, СчетОбязательств)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	&СчетОбязательств КАК Счет,
				|	ЖурналПроводокЕПСБУ.Организация КАК Организация,
				|	ЖурналПроводокЕПСБУ.КФО КАК КФО,"+?(СтруктураПолей.ИФО,"
				|	ЖурналПроводокЕПСБУ.ИФО КАК ИФО,","")+"
				|	ЖурналПроводокЕПСБУ.КПСДт КАК КПС,
				|	ЖурналПроводокЕПСБУ.КЭКДт КАК КОСГУ,
				|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУ.ХарактеристикаДвиженияДт КАК Справочник.Договоры) КАК Договор,
				|	ЖурналПроводокЕПСБУ.Сумма КАК СуммаНеИсполнено
				|ИЗ
				|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЖурналПроводокЕПСБУ
				|ГДЕ
				|	ЖурналПроводокЕПСБУ.Период >= &НачалоПериода
				|	И ЖурналПроводокЕПСБУ.Период <= &КонецПериода
				|	И (ЖурналПроводокЕПСБУ.СчетДт В (&Счета30404)
				|				И ЖурналПроводокЕПСБУ.СчетКт В (&Счета20120)
				|			ИЛИ ЖурналПроводокЕПСБУ.СчетДт В (&Счета30405)
				|				И ЖурналПроводокЕПСБУ.СчетКт НЕ В (&КоррСчетаИсключения))
				|	И ЖурналПроводокЕПСБУ.Активность = ИСТИНА
				|	И ЖурналПроводокЕПСБУ.УточнениеПериода = 0
				|	%Условие%";
				
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериодаДата);
	Запрос.УстановитьПараметр("СчетОбязательств", СчетОбязательств);
	
	КоррСчетаИсключения = БухгалтерскийУчет.СписокСчетов("000, 304.04, 401.30,
														|304.84, 304.94, 304.66, 304.76, 304.86, 304.96,
														|401.16, 401.17, 401.18, 401.19,
														|401.26, 401.27, 401.28, 401.29");
	Запрос.УстановитьПараметр("КоррСчетаИсключения", КоррСчетаИсключения);
	
	Счета30404 = БухгалтерскийУчет.СписокСчетов("304.04");
	Запрос.УстановитьПараметр("Счета30404", Счета30404);
	
	Счета30405 = БухгалтерскийУчет.СписокСчетов("304.05");
	Запрос.УстановитьПараметр("Счета30405", Счета30405);
	
	Счета20120 = БухгалтерскийУчет.СписокСчетов("201.21, 201.23, 201.27");
	Запрос.УстановитьПараметр("Счета20120", Счета20120);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",?(ЗначениеЗаполнено(Условие),"И "+Условие,""));
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
КонецПроцедуры

Процедура ДополнитьТаблицуПоИсполнениюКт(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериодаДата, СчетОбязательств)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	&СчетОбязательств КАК Счет,
				|	ЖурналПроводокЕПСБУ.Организация КАК Организация,
				|	ЖурналПроводокЕПСБУ.КФО КАК КФО,"+?(СтруктураПолей.ИФО,"
				|	ЖурналПроводокЕПСБУ.ИФО КАК ИФО,","")+"
				|	ЖурналПроводокЕПСБУ.КПСКт КАК КПС,
				|	ЖурналПроводокЕПСБУ.КЭККт КАК КОСГУ,
				|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУ.ХарактеристикаДвиженияКт КАК Справочник.Договоры) КАК Договор,
				|	-ЖурналПроводокЕПСБУ.Сумма КАК СуммаНеИсполнено
				|ИЗ
				|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЖурналПроводокЕПСБУ
				|ГДЕ
				|	ЖурналПроводокЕПСБУ.Период >= &НачалоПериода
				|	И ЖурналПроводокЕПСБУ.Период <= &КонецПериода
				|	И (ЖурналПроводокЕПСБУ.СчетКт В (&Счета30404)
				|				И ЖурналПроводокЕПСБУ.СчетДт В (&Счета20120)
				|			ИЛИ ЖурналПроводокЕПСБУ.СчетКт В (&Счета30405)
				|				И ЖурналПроводокЕПСБУ.СчетДт НЕ В (&КоррСчетаИсключения))
				|	И ЖурналПроводокЕПСБУ.Активность = ИСТИНА
				|	И ЖурналПроводокЕПСБУ.УточнениеПериода = 0
				|	%Условие%";
				
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериодаДата);
	Запрос.УстановитьПараметр("СчетОбязательств", СчетОбязательств);
	
	КоррСчетаИсключения = БухгалтерскийУчет.СписокСчетов("000, 304.04, 401.30,
														|304.84, 304.94, 304.66, 304.76, 304.86, 304.96,
														|401.16, 401.17, 401.18, 401.19,
														|401.26, 401.27, 401.28, 401.29");
	Запрос.УстановитьПараметр("КоррСчетаИсключения", КоррСчетаИсключения);
	
	Счета30404 = БухгалтерскийУчет.СписокСчетов("304.04");
	Запрос.УстановитьПараметр("Счета30404", Счета30404);
	
	Счета30405 = БухгалтерскийУчет.СписокСчетов("304.05");
	Запрос.УстановитьПараметр("Счета30405", Счета30405);
	
	Счета20120 = БухгалтерскийУчет.СписокСчетов("201.21, 201.23, 201.27");
	Запрос.УстановитьПараметр("Счета20120", Счета20120);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",?(ЗначениеЗаполнено(Условие),"И "+Условие,""));
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

// для форм 190/790

Функция ПолучитьВНД_ДанныеДля190_790(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	
	ИсключатьВнутрОборот = Ложь;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("ИсключатьВнутрОборот") Тогда
		Если ТипЗнч(ДополнительныеПараметры["ИсключатьВнутрОборот"]) = Тип("Булево") Тогда
			Если ДополнительныеПараметры["ИсключатьВнутрОборот"] = Истина Тогда
				ИсключатьВнутрОборот = Истина;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДополнительныеПараметры["ИсключатьВнутрОборот"]) = Тип("Структура") Тогда
			Если ДополнительныеПараметры["ИсключатьВнутрОборот"].Свойство("Использование") 
				И ДополнительныеПараметры["ИсключатьВнутрОборот"].Использование = Истина
				И ДополнительныеПараметры["ИсключатьВнутрОборот"].Свойство("ПравоеЗначение")
				И ДополнительныеПараметры["ИсключатьВнутрОборот"].ПравоеЗначение = Истина Тогда	
		        ИсключатьВнутрОборот = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрДляВыбораДокументов = ПараметрыСхемы.Найти("ПараметрДляВыбораДокументов_"+ИмяНабора);
	Если ПараметрДляВыбораДокументов <> Неопределено Тогда
		ИмяПараметраОтчетаПредПериода = ПараметрДляВыбораДокументов.Значение;
	Иначе	
		ИмяПараметраОтчетаПредПериода = "ОтчетПредПериод";
	КонецЕсли; 
	
	ПараметрОтчетПредПериод = Неопределено;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство(ИмяПараметраОтчетаПредПериода)
		И ЗначениеЗаполнено(ДополнительныеПараметры[ИмяПараметраОтчетаПредПериода]) Тогда
		ПараметрОтчетПредПериод = ДополнительныеПараметры[ИмяПараметраОтчетаПредПериода];
	КонецЕсли;
	
	ОтчетПредПериод = Неопределено;
	Если ТипЗнч(ПараметрОтчетПредПериод) = Тип("Структура") Тогда
		Если ПараметрОтчетПредПериод.Свойство("Использование") 
			И ПараметрОтчетПредПериод.Использование = Истина Тогда	
	        ОтчетПредПериод = ПараметрОтчетПредПериод.ПравоеЗначение;
		КонецЕсли;
	КонецЕсли;	
	
	Если ТипЗнч(КонецПериода) = Тип("Дата") Тогда
		КонецПериода = Новый Граница(КонецПериода,ВидГраницы.Включая);
	КонецЕсли;	
	КонецПериодаДата = КонецДня(ЗаполнениеОтчетности.ПолучитьДатуИзПараметра(КонецПериода));
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	ТипДата = БюджетнаяОтчетность.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	ТипСтрока = БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(0);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	//часть колонок, заполняемая по РБ
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("ОсновноеСредство",Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТаблицаДанных.Колонки.Добавить("НачальныйОстаток",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("Увеличение",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("Уменьшение",ТипЧисло);
	
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И НЕ Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		УсловиеОрганизация = " И Организация = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;	
		
	ПараметрКодВидаОтчета = ПараметрыСхемы.Найти("КодВидаОтчета_"+ИмяНабора);
	Если ПараметрКодВидаОтчета <> Неопределено Тогда
		КодВидаОтчета = ПараметрКодВидаОтчета.Значение;
	Иначе	
		КодВидаОтчета = "190";
	КонецЕсли;
	
	УсловиеКФО = "";
	
	Если СтрНайти(КодВидаОтчета,"190")>0 Тогда
		УсловиеКФО = " И КФО = &КФО";
		СтруктураПолейОтбора.Вставить("КФО",Перечисления.КВД.Бюджет);	
	Иначе
		УсловиеКФО = " И КФО В (&КФО)";//2, 4, 5, 6, 7
		МассивКФО = Новый Массив;
		МассивКФО.Добавить(Перечисления.КВД.Внебюджет);
		МассивКФО.Добавить(Перечисления.КВД.СубсидииНаГосзадание);
		МассивКФО.Добавить(Перечисления.КВД.СубсидииНаИныеЦели);
		МассивКФО.Добавить(Перечисления.КВД.БюджетныеИнвестиции);
		МассивКФО.Добавить(Перечисления.КВД.СредстваОМС);
		СтруктураПолейОтбора.Вставить("КФО",МассивКФО);	
	КонецЕсли;
	
	Условие = УсловиеБаланс + УсловиеОрганизация + УсловиеКФО;
	Условие = Сред(Условие,3);		
		
	ПараметрСчета106 = ПараметрыСхемы.Найти("Счета106_"+ИмяНабора);
	Если ПараметрСчета106 <> Неопределено Тогда
		Счета106 = БухгалтерскийУчет.СписокСчетов(ПараметрСчета106.Значение);
	Иначе	
		Счета106 = БухгалтерскийУчет.СписокСчетов("106.11,106.КС,106.51,106.91");
	КонецЕсли;
	
	
	
	ПараметрСчетаИО = ПараметрыСхемы.Найти("СчетаИсправленияОшибок_"+ИмяНабора);
	Если ПараметрСчетаИО <> Неопределено Тогда
		МассивСчетовИО = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаИО.Значение);
	Иначе	
		МассивСчетовИО = БухгалтерскийУчет.СписокСчетов("304.84, 304.94, 304.66, 304.76, 304.86, 304.96, 
														|401.16, 401.17, 401.18, 401.19, 
														|401.26, 401.27, 401.28, 401.29");
	КонецЕсли;
	
	//Суть процедуры - получить данные по 106 счету, получить данные выбранных рег.отчетов, соединиться
	
	ДополнитьТаблицуПо106(ТаблицаДанных, Счета106, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода,  МассивСчетовИО, ИсключатьВнутрОборот);
	
	ТипСтрока3 = ОбщегоНазначения.ОписаниеТипаСтрока(3);
	ТипСтрока20 = ОбщегоНазначения.ОписаниеТипаСтрока(20);
	ТипСтрока4 = ОбщегоНазначения.ОписаниеТипаСтрока(4);
	
	ТаблицаДанных.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	ТаблицаДанных.Колонки.Добавить("гр5а",ТипСтрока3);
	ТаблицаДанных.Колонки.Добавить("гр5б",ТипСтрока20);
	ТаблицаДанных.Колонки.Добавить("гр5в",ТипСтрока4);
	ТаблицаДанных.Колонки.Добавить("гр5г",Новый ОписаниеТипов("СправочникСсылка.Субконто"));
	
	ТаблицаДанных.Колонки.Добавить("гр6а",ТипСтрока3);
	ТаблицаДанных.Колонки.Добавить("гр6б",ТипСтрока20);
	ТаблицаДанных.Колонки.Добавить("гр6в",ТипСтрока4);
	ТаблицаДанных.Колонки.Добавить("гр6г",Новый ОписаниеТипов("СправочникСсылка.Субконто"));
	
	ТаблицаДанных.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("КодОбъекта",Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("КадастровыйНомер",Новый ОписаниеТипов("Строка"));
	
	//заполняется из данных отчета прошлого года
	ТаблицаДанных.Колонки.Добавить("СтатусНаНачалоГода",Новый ОписаниеТипов("СправочникСсылка.Субконто"));//гр7 - из графы 8 отчета прошлого года
	ТаблицаДанных.Колонки.Добавить("СтатусНаКонецГода",Новый ОписаниеТипов("СправочникСсылка.Субконто")); //гр8 - не заполняется
	ТаблицаДанных.Колонки.Добавить("ЦелеваяФункция",Новый ОписаниеТипов("СправочникСсылка.Субконто"));    //гр9
	ТаблицаДанных.Колонки.Добавить("ПриостановлениеГод",Новый ОписаниеТипов("Дата"));                     //гр10
	ТаблицаДанных.Колонки.Добавить("ПриостановлениеПричина",Новый ОписаниеТипов("СправочникСсылка.Субконто"));//гр11
	ТаблицаДанных.Колонки.Добавить("ПриостановлениеПояснение",Новый ОписаниеТипов("Строка"));                 //гр12
	ТаблицаДанных.Колонки.Добавить("НачалоРеализации",Новый ОписаниеТипов("Дата"));                           //гр13
	
	//не заполняются, добавлено на случай, если будут заполняться, чтобы не менять скд, а просто реализовать заполнение в коде
	ТаблицаДанных.Колонки.Добавить("СметнаяСтоимость",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КассовыеРасходыВсего",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КассовыеРасходыФБ",ТипЧисло);
	
	МассивСсылокОС = Новый Массив;
	ТаблицаОС = ТаблицаДанных.Скопировать(,"ОсновноеСредство");
	ТаблицаОС.Свернуть("ОсновноеСредство");
	МассивСсылокОС = ТаблицаОС.ВыгрузитьКолонку("ОсновноеСредство");
	
	ТаблицаАдресовОС = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивСсылокОС,,Справочники.ВидыКонтактнойИнформации.АдресМестонахожденияОбъектаОС);
	ТаблицаАдресовОС.Индексы.Добавить("Объект");
		
	Запрос = Новый Запрос;
	//УчетныйНомерОбъектаКапвложенийДоПоступления 
	//УчетныйНомерОбъектаКапвложений
	//	- если 30 знаков, значит первые 2 это год открытия, они не нужны, 
	//	остальные 28 - код главы (3), номер реестровой записи (20), номер (4), код контура (1)
	
	//Если не заполнена УчетныйНомерОбъектаКапвложений в карточке, заполняем из организации + 4 символа кода + код контура
	
	//Из инвентаризации берем статус объекта на конец года и целевую функцию.
	//Инвентаризацию берем за период - с начала года + 1 день по дату окончания отчетного периода +1 день.
	//Отбор по полю ДатаИнвентаризации
	//Т.к. пользователи по разному могут заполнять инвентаризацию - кто-то на 31.12, кто-то на 01.01. Поэтому +1 день к концу периода и началу периода.
	//А если вдруг заполнили не на конец года, а на условное 28.12, то возьмем и из него.
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОсновныеСредства.Ссылка КАК Ссылка,
		|	ОсновныеСредства.Наименование КАК Наименование,
		|	ОсновныеСредства.НаименованиеПолное КАК НаименованиеПолное,
		|	ОсновныеСредства.КодФАИП КАК КодФАИП,
		|	ОсновныеСредства.КодКонтураИдентификацииСведенийОбОбъекте КАК КодКонтураИдентификацииСведенийОбОбъекте,
		|	СОКРЛП(ОсновныеСредства.УчетныйНомерОбъектаКапвложенийДоПоступления) КАК УчетныйНомерОбъектаКапвложенийДоПоступления,
		|	ОсновныеСредства.Организация.НомерРеестровойЗаписи КАК ОрганизацияНомерРеестровойЗаписи,
		|	ОсновныеСредства.Организация.КодПоППП.Код КАК ОрганизацияКодПоПППКод,
		|	ОсновныеСредства.Код КАК Код
		|ПОМЕСТИТЬ ДанныеОС
		|ИЗ
		|	Справочник.ОсновныеСредства КАК ОсновныеСредства
		|ГДЕ
		|	ОсновныеСредства.Ссылка В(&МассивОС)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(СОКРЛП(КарточкиКапвложений.УчетныйНомерОбъектаКапвложений)) КАК УчетныйНомерОбъектаКапвложений,
		|	КарточкиКапвложений.ОбъектВложений КАК ОбъектВложений
		|ПОМЕСТИТЬ ДанныеКарточки
		|ИЗ
		|	Справочник.КарточкиКапвложений КАК КарточкиКапвложений
		|ГДЕ
		|	КарточкиКапвложений.ОбъектВложений В(&МассивОС)
		|	И КарточкиКапвложений.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	КарточкиКапвложений.ОбъектВложений
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОбъектВложений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеОС.Ссылка КАК ОсновноеСредство,
		|	СОКРЛП(ДанныеОС.Наименование) КАК Наименование,
		|	СОКРЛП(ДанныеОС.НаименованиеПолное) КАК НаименованиеПолное,
		|	СОКРЛП(ДанныеОС.КодФАИП) КАК КодФАИП,
		|	ДанныеОС.КодКонтураИдентификацииСведенийОбОбъекте КАК КодКонтураИдентификацииСведенийОбОбъекте,
		|	ДанныеОС.УчетныйНомерОбъектаКапвложенийДоПоступления КАК УчетныйНомерОбъектаКапвложенийДоПоступления,
		|	ДанныеОС.ОрганизацияНомерРеестровойЗаписи КАК НомерРеестровойЗаписи,
		|	ЕСТЬNULL(ДанныеОС.ОрганизацияКодПоПППКод, """") КАК КодГлавыОрганизации,
		|	СОКРЛП(ДанныеОС.Код) КАК Код,
		|	ЕСТЬNULL(ДанныеКарточки.УчетныйНомерОбъектаКапвложений, """") КАК УчетныйНомерОбъектаКапвложений,
		|	ЕСТЬNULL(СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер, """") КАК КадастровыйНомер
		|ИЗ
		|	ДанныеОС КАК ДанныеОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКарточки КАК ДанныеКарточки
		|		ПО ДанныеОС.Ссылка = ДанныеКарточки.ОбъектВложений
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(&КонецПериодаДата, ОсновноеСредство В (&МассивОС)) КАК СведенияКадастровогоУчетаСрезПоследних
		|		ПО ДанныеОС.Ссылка = СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИнвентаризацияОСИнвентаризация.Ссылка КАК Ссылка,
		|	ИнвентаризацияОСИнвентаризация.ОсновноеСредство КАК ОсновноеСредство,
		|	Подстрока(СОКРЛП(ИнвентаризацияОСИнвентаризация.СтатусОбъекта),1,2) КАК СтатусОбъектаТекст,
		|	Подстрока(СОКРЛП(ИнвентаризацияОСИнвентаризация.ЦелеваяФункцияАктива),1,2) КАК ЦелеваяФункцияАктиваТекст,
		|	ИнвентаризацияОСИнвентаризация.Ссылка.Дата КАК Дата,
		|	ИнвентаризацияОСИнвентаризация.Ссылка.ДатаИнвентаризации КАК ДатаИнвентаризации,
		|	Значение(Справочник.Субконто.ПустаяСсылка) КАК СтатусОбъектаСсылка,
		|	Значение(Справочник.Субконто.ПустаяСсылка) КАК ЦелеваяФункцияАктиваСсылка,
		|	"""" КАК СтатусОбъектаКодДляОтчетности,
		|	0 КАК ЦелеваяФункцияАктиваКодДляОтчетности
		|ПОМЕСТИТЬ ДанныеИнвентаризации
		|ИЗ
		|	Документ.ИнвентаризацияОС.Инвентаризация КАК ИнвентаризацияОСИнвентаризация
		|ГДЕ
		|	ИнвентаризацияОСИнвентаризация.ОсновноеСредство В
		|			(ВЫБРАТЬ
		|				ДанныеОС.Ссылка КАК Ссылка
		|			ИЗ
		|				ДанныеОС КАК ДанныеОС)
		|	И ИнвентаризацияОСИнвентаризация.Ссылка.Проведен = ИСТИНА
		|	И ИнвентаризацияОСИнвентаризация.Ссылка.ДатаИнвентаризации МЕЖДУ &НачИвнентаризации И &КонИнвентаризации
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИнвентаризационнаяОписьНФАРаздел21.Ссылка,
		|	ИнвентаризационнаяОписьНФАРаздел21.НФА,
		|	Подстрока(СОКРЛП(ИнвентаризационнаяОписьНФАРаздел21.СтатусОбъекта.Наименование),1,2),
		|	Подстрока(СОКРЛП(ИнвентаризационнаяОписьНФАРаздел21.ЦелеваяФункцияАктива.Наименование),1,2),
		|	ИнвентаризационнаяОписьНФАРаздел21.Ссылка.Дата,
		|	ИнвентаризационнаяОписьНФАРаздел21.Ссылка.ДатаИнвентаризации,
		|	ИнвентаризационнаяОписьНФАРаздел21.СтатусОбъекта,
		|	ИнвентаризационнаяОписьНФАРаздел21.ЦелеваяФункцияАктива,
		|	ИнвентаризационнаяОписьНФАРаздел21.СтатусОбъекта.КодДляОтчетности,
		|	ИнвентаризационнаяОписьНФАРаздел21.ЦелеваяФункцияАктива.КодДляОтчетности
		|ИЗ
		|	Документ.ИнвентаризационнаяОписьНФА.Раздел21 КАК ИнвентаризационнаяОписьНФАРаздел21
		|ГДЕ
		|	ИнвентаризационнаяОписьНФАРаздел21.НФА В
		|			(ВЫБРАТЬ
		|				ДанныеОС.Ссылка КАК Ссылка
		|			ИЗ
		|				ДанныеОС КАК ДанныеОС)
		|	И ИнвентаризационнаяОписьНФАРаздел21.Ссылка.ДатаИнвентаризации МЕЖДУ &НачИвнентаризации И &КонИнвентаризации
		|	И ИнвентаризационнаяОписьНФАРаздел21.Ссылка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппировкаПоДатеИнвентаризации.ДатаИнвентаризации КАК ДатаИнвентаризации,
		|	ГруппировкаПоДатеИнвентаризации.ОсновноеСредство КАК ОсновноеСредство,
		|	МАКСИМУМ(ДанныеИнвентаризации.Дата) КАК Дата
		|ПОМЕСТИТЬ ИнвентаризацияДаты
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ДанныеИнвентаризации.ДатаИнвентаризации) КАК ДатаИнвентаризации,
		|		ДанныеИнвентаризации.ОсновноеСредство КАК ОсновноеСредство
		|	ИЗ
		|		ДанныеИнвентаризации КАК ДанныеИнвентаризации
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДанныеИнвентаризации.ОсновноеСредство) КАК ГруппировкаПоДатеИнвентаризации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеИнвентаризации КАК ДанныеИнвентаризации
		|		ПО ГруппировкаПоДатеИнвентаризации.ОсновноеСредство = ДанныеИнвентаризации.ОсновноеСредство
		|			И ГруппировкаПоДатеИнвентаризации.ДатаИнвентаризации = ДанныеИнвентаризации.ДатаИнвентаризации
		|
		|СГРУППИРОВАТЬ ПО
		|	ГруппировкаПоДатеИнвентаризации.ДатаИнвентаризации,
		|	ГруппировкаПоДатеИнвентаризации.ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнвентаризацияДаты.ДатаИнвентаризации КАК ДатаИнвентаризации,
		|	ИнвентаризацияДаты.ОсновноеСредство КАК ОсновноеСредство,
		|	ИнвентаризацияДаты.Дата КАК Дата,
		|	ДанныеИнвентаризации.СтатусОбъектаТекст КАК СтатусОбъектаТекст,
		|	ДанныеИнвентаризации.ЦелеваяФункцияАктиваТекст КАК ЦелеваяФункцияАктиваТекст,
		|	ДанныеИнвентаризации.СтатусОбъектаСсылка КАК СтатусОбъектаСсылка,
		|	ДанныеИнвентаризации.ЦелеваяФункцияАктиваСсылка КАК ЦелеваяФункцияАктиваСсылка,
		|	ДанныеИнвентаризации.СтатусОбъектаКодДляОтчетности КАК СтатусОбъектаКодДляОтчетности,
		|	ДанныеИнвентаризации.ЦелеваяФункцияАктиваКодДляОтчетности КАК ЦелеваяФункцияАктиваКодДляОтчетности
		|ИЗ
		|	ИнвентаризацияДаты КАК ИнвентаризацияДаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеИнвентаризации КАК ДанныеИнвентаризации
		|		ПО ИнвентаризацияДаты.ОсновноеСредство = ДанныеИнвентаризации.ОсновноеСредство
		|			И ИнвентаризацияДаты.ДатаИнвентаризации = ДанныеИнвентаризации.ДатаИнвентаризации
		|			И ИнвентаризацияДаты.Дата = ДанныеИнвентаризации.Дата";
	
	Запрос.УстановитьПараметр("МассивОС", МассивСсылокОС);
	Запрос.УстановитьПараметр("КонецПериодаДата",КонецПериодаДата);
	Запрос.УстановитьПараметр("НачИвнентаризации",КонецДня(НачалоПериода)+1); //с 02.01.2024
	Запрос.УстановитьПараметр("КонИнвентаризации",КонецДня(КонецПериодаДата+1));//по 01.01.2025
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеОС = РезультатыЗапроса[2].Выгрузить();
	ДанныеОС.Индексы.Добавить("ОсновноеСредство");
	
	ДанныеИнвентаризации = РезультатыЗапроса[5].Выгрузить();
	ДанныеИнвентаризации.Индексы.Добавить("ОсновноеСредство");
	
	
	СоответствиеКодовЗначенийКодКонтура = ПолучитьСоответствиеЗначенийКлассификатора("КодКонтур");
	
	СоответствиеКодовЗначенийДляГр7 = ПолучитьСоответствиеЗначенийКлассификатора("Ф190СтатусОбъекта2017");
	СоответствиеКодовЗначенийДляГр8 = ПолучитьСоответствиеЗначенийКлассификатора("Ф190СтатусОбъекта2021");
	СоответствиеКодовЗначенийДляЦФ = ПолучитьСоответствиеЗначенийКлассификатора("Ф190ЦелеваяФункцияОбъекта");
	
	СоответствиеКодКонтура = Новый Соответствие;
		
	СоответствиеКонтрагентов = Новый Соответствие;
	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
		СтрокаОС = ДанныеОС.Найти(СтрТЧ.ОсновноеСредство,"ОсновноеСредство");		
		СтрокаАдреса = ТаблицаАдресовОС.Найти(СтрТЧ.ОсновноеСредство,"Объект");
		
		СтрокаИнвентаризации = ДанныеИнвентаризации.Найти(СтрТЧ.ОсновноеСредство,"ОсновноеСредство");
		
		ТекКонтрагент = СоответствиеКонтрагентов[СтрТЧ.Организация];
		Если НЕ ЗначениеЗаполнено(ТекКонтрагент) Тогда
			ТекКонтрагент = ЗаполнениеОтчетности.ПолучитьКонтрагентаПоОрганизации(СтрТЧ.Организация,Истина,Ложь);
			СоответствиеКонтрагентов.Вставить(СтрТЧ.Организация,ТекКонтрагент);
		КонецЕсли;
		СтрТЧ.Контрагент = ТекКонтрагент;
		
		Если СтрокаОС <> Неопределено Тогда
			ДлинаНомера = СтрДлина(СтрокаОС.УчетныйНомерОбъектаКапвложений);
			Если ЗначениеЗаполнено(СтрокаОС.УчетныйНомерОбъектаКапвложений)
				И (ДлинаНомера = 28
					ИЛИ ДлинаНомера = 30) Тогда
				ТекУчетныйНомер = СтрокаОС.УчетныйНомерОбъектаКапвложений;
				Если ДлинаНомера = 30 Тогда
					//первые 2 не нужны, это год открытия карточки
					ТекУчетныйНомер = Сред(ТекУчетныйНомер,3);
				КонецЕсли;
				СтрТЧ.гр5а = Лев(ТекУчетныйНомер,3);
				СтрТЧ.гр5б = Сред(ТекУчетныйНомер,4,20);
				СтрТЧ.гр5в = Сред(ТекУчетныйНомер,24,4);
				КодКонтураСтрокой = Сред(ТекУчетныйНомер,28,1);
				
				ТекКодКонтура = СоответствиеКодКонтура[КодКонтураСтрокой];
				Если ТекКодКонтура = Неопределено Тогда
					ТекКодКонтура = СоответствиеКодовЗначенийКодКонтура[КодКонтураСтрокой];
				    СоответствиеКодКонтура.Вставить(КодКонтураСтрокой,ТекКодКонтура);
				КонецЕсли;
				СтрТЧ.гр5г = ТекКодКонтура;
				
			Иначе
				СтрТЧ.гр5а = СтрокаОС.КодГлавыОрганизации;
				СтрТЧ.гр5б = СтрокаОС.НомерРеестровойЗаписи;
				СтрТЧ.гр5в = Прав(СтрокаОС.Код,4);
				КодКонтураСтрокой = Строка(СтрокаОС.КодКонтураИдентификацииСведенийОбОбъекте);
				Если НЕ ЗначениеЗаполнено(КодКонтураСтрокой)
					ИЛИ КодКонтураСтрокой = "0" Тогда
					КодКонтураСтрокой = "1";//не секретно
				КонецЕсли;
				
				ТекКодКонтура = СоответствиеКодКонтура[КодКонтураСтрокой];
				Если ТекКодКонтура = Неопределено Тогда
					ТекКодКонтура = СоответствиеКодовЗначенийКодКонтура[КодКонтураСтрокой];
				    СоответствиеКодКонтура.Вставить(КодКонтураСтрокой,ТекКодКонтура);
				КонецЕсли;
				СтрТЧ.гр5г = ТекКодКонтура;
				
			КонецЕсли;
			ДлинаНомераДоПоступления = СтрДлина(СтрокаОС.УчетныйНомерОбъектаКапвложенийДоПоступления);
			Если ЗначениеЗаполнено(СтрокаОС.УчетныйНомерОбъектаКапвложенийДоПоступления)
				И (ДлинаНомераДоПоступления = 28
					ИЛИ ДлинаНомераДоПоступления = 30) Тогда
				ТекУчетныйНомер = СтрокаОС.УчетныйНомерОбъектаКапвложенийДоПоступления;
				Если СтрДлина(ТекУчетныйНомер) = 30 Тогда
					//первые 2 не нужны, это год открытия карточки
					ТекУчетныйНомер = Сред(ТекУчетныйНомер,3);
				КонецЕсли;
				СтрТЧ.гр6а = Лев(ТекУчетныйНомер,3);
				СтрТЧ.гр6б = Сред(ТекУчетныйНомер,4,20);
				СтрТЧ.гр6в = Сред(ТекУчетныйНомер,24,4);
				КодКонтураСтрокой = Сред(ТекУчетныйНомер,28,1);
				
				ТекКодКонтура = СоответствиеКодКонтура[КодКонтураСтрокой];
				Если ТекКодКонтура = Неопределено Тогда
					ТекКодКонтура = СоответствиеКодовЗначенийКодКонтура[КодКонтураСтрокой];
				    СоответствиеКодКонтура.Вставить(КодКонтураСтрокой,ТекКодКонтура);
				КонецЕсли;
				СтрТЧ.гр6г = ТекКодКонтура;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаОС.НаименованиеПолное) Тогда
				Если СтрокаАдреса <> Неопределено
					И ЗначениеЗаполнено(СтрокаАдреса.Представление) Тогда
					СтрТЧ.Наименование = СтрокаОС.НаименованиеПолное + ", " + СтрокаАдреса.Представление;
				Иначе
					СтрТЧ.Наименование = СтрокаОС.НаименованиеПолное;
				КонецЕсли;
			Иначе
				Если СтрокаАдреса <> Неопределено
					И ЗначениеЗаполнено(СтрокаАдреса.Представление) Тогда
					СтрТЧ.Наименование = СтрокаОС.Наименование + ", " + СтрокаАдреса.Представление;
				Иначе
					СтрТЧ.Наименование = СтрокаОС.Наименование;
				КонецЕсли;
			КонецЕсли;
			
			СтрТЧ.КодОбъекта = СтрокаОС.КодФАИП;
			СтрТЧ.КадастровыйНомер = СтрокаОС.КадастровыйНомер;
		КонецЕсли;
		
		Если СтрокаИнвентаризации<>Неопределено Тогда
			ПервыеДва = "";
			Если ЗначениеЗаполнено(СтрокаИнвентаризации.СтатусОбъектаКодДляОтчетности) Тогда
				ПервыеДва = СтрокаИнвентаризации.СтатусОбъектаКодДляОтчетности;
			ИначеЕсли ЗначениеЗаполнено(СтрокаИнвентаризации.СтатусОбъектаТекст) Тогда
				ПервыеДва = СокрЛП(Лев(СокрЛП(СтрокаИнвентаризации.СтатусОбъектаТекст),2));
				НужныеСимволы = "0123456789";
				ЛишниеСимволы = СтрСоединить(СтрРазделить(ПервыеДва,НужныеСимволы),"");
				ПервыеДва = СтрСоединить(СтрРазделить(ПервыеДва,ЛишниеСимволы),"");				
			КонецЕсли;
			
			СтрТЧ.СтатусНаКонецГода = СоответствиеКодовЗначенийДляГр8[ПервыеДва];
			
			ПервыеДва = "";
			Если ЗначениеЗаполнено(СтрокаИнвентаризации.ЦелеваяФункцияАктиваКодДляОтчетности) Тогда
				//число, приводим к строке
				ПервыеДва = Строка(СтрокаИнвентаризации.ЦелеваяФункцияАктиваКодДляОтчетности);
			ИначеЕсли ЗначениеЗаполнено(СтрокаИнвентаризации.ЦелеваяФункцияАктиваТекст) Тогда
				ПервыеДва = СокрЛП(Лев(СокрЛП(СтрокаИнвентаризации.ЦелеваяФункцияАктиваТекст),2));
				НужныеСимволы = "0123456789";
				ЛишниеСимволы = СтрСоединить(СтрРазделить(ПервыеДва,НужныеСимволы),"");
				ПервыеДва = СтрСоединить(СтрРазделить(ПервыеДва,ЛишниеСимволы),"");				
			КонецЕсли;
			
			СтрТЧ.ЦелеваяФункция = СоответствиеКодовЗначенийДляЦФ[ПервыеДва];
			
		КонецЕсли;
	КонецЦикла;	
	//
	ТаблицаДанных.Индексы.Добавить("гр5а,гр5б,гр5в,гр5г");
	
	
	
	СоответствиеСтатусов = Новый Соответствие;
		
	ПустойСтатус = Справочники.Субконто.ПустаяСсылка();
	//тут получаем данные отчетов
	Если ЗначениеЗаполнено(ОтчетПредПериод) Тогда
		Если ТипЗнч(ОтчетПредПериод) <> Тип("Массив") Тогда
			МассивОтчетов = Новый Массив;
			МассивОтчетов.Добавить(ОтчетПредПериод);
		Иначе
			МассивОтчетов = ОтчетПредПериод;	
		КонецЕсли;
		
		Для Каждого ТекОтчет Из МассивОтчетов Цикл
			ЭкземплярИсточник = ТекОтчет.ПолучитьОбъект();
			ЭкземплярИсточник.ИнициализироватьКонтекст();
			
			ГруппыРаскрытияИсходные = ЭкземплярИсточник.ПодготовитьКэшДанныхПоГруппамРаскрытия();
			
			СтрГруппаИсточника = ГруппыРаскрытияИсходные.Найти("ГР100","КодГруппыРаскрытия");
			Если СтрГруппаИсточника = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТаблицаИсходныхДанных = ЭкземплярИсточник.ПолучитьТаблицуРаскрытия(СтрГруппаИсточника);
						
			СтруктураПоиска = Новый Структура("гр5а,гр5б,гр5в,гр5г");
			Для Каждого СтрИсх Из ТаблицаИсходныхДанных Цикл
				СтруктураПоиска.гр5а = СокрЛП(СтрИсх.Аналитика2);
				СтруктураПоиска.гр5б = СокрЛП(СтрИсх.стр100_гр052);
				СтруктураПоиска.гр5в = СокрЛП(СтрИсх.стр100_гр053);
				СтруктураПоиска.гр5г = СтрИсх.Аналитика3;
				
				НайденныеСтроки = ТаблицаДанных.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() Тогда
					ТекСтрока = НайденныеСтроки[0];
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СтрИсх.Аналитика7) Тогда
					ТекСтатус = Справочники.Субконто.ПустаяСсылка();
				Иначе
					ТекСтатус = СоответствиеСтатусов[СтрИсх.Аналитика7];
					Если ТекСтатус = Неопределено Тогда
						ТекКодСтатуса = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрИсх.Аналитика7,"Код"));
						ТекСтатус = СоответствиеКодовЗначенийДляГр7[ТекКодСтатуса];
						СоответствиеСтатусов.Вставить(СтрИсх.Аналитика7,ТекСтатус);
					КонецЕсли;
				КонецЕсли;
				
				ТекСтрока.СтатусНаНачалоГода = ТекСтатус;
				
				Если НЕ ЗначениеЗаполнено(ТекСтрока.ЦелеваяФункция) Тогда
					//если не заполнили ранее
					ТекСтрока.ЦелеваяФункция = СтрИсх.Аналитика8;
				КонецЕсли;
				ТекСтрока.ПриостановлениеГод = СтрИсх.стр100_гр10;
				ТекСтрока.ПриостановлениеПричина = СтрИсх.Аналитика9;
				ТекСтрока.ПриостановлениеПояснение = СтрИсх.стр100_гр12;
				ТекСтрока.НачалоРеализации = СтрИсх.стр100_гр13;
						
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	
	ТаблицаДанных.Сортировать("Наименование");
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПолучитьСоответствиеЗначенийКлассификатора(КодВладельцаКлассификатора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Субконто.Ссылка КАК Ссылка,
		|	СокрЛП(Субконто.Код) КАК Код
		|ИЗ
		|	Справочник.Субконто КАК Субконто
		|ГДЕ
		|	Субконто.Владелец.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодВладельцаКлассификатора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СоответствиеЗначенийКлассификатора = Новый Соответствие;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеЗначенийКлассификатора.Вставить(ВыборкаДетальныеЗаписи.Код,ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат СоответствиеЗначенийКлассификатора;
	
КонецФункции

Процедура ДополнитьТаблицуПо106(ТаблицаДанных, МассивСчетов106, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, ИсключатьВнутрОборот)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналПроводокЕПСБУОстатки.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
		|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
		|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ОсновноеСредство,
		|	СУММА(ЖурналПроводокЕПСБУОстатки.СуммаОстаток) КАК НачальныйОстаток
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&НачалоПериода, Счет В (&МассивСчетов106), , &Условие) КАК ЖурналПроводокЕПСБУОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналПроводокЕПСБУОстатки.Организация,
		|	ЖурналПроводокЕПСБУОстатки.Счет,
		|	ЖурналПроводокЕПСБУОстатки.КФО,
		|	ЖурналПроводокЕПСБУОстатки.Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналПроводокЕПСБУОбороты.Счет КАК Счет,
		|	ЖурналПроводокЕПСБУОбороты.Субконто1 КАК ОсновноеСредство,
		|	ЖурналПроводокЕПСБУОбороты.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОбороты.КФО КАК КФО,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ ЖурналПроводокЕПСБУОбороты.КорСчет В (&СчетаИО)
		|				ТОГДА ЖурналПроводокЕПСБУОбороты.СуммаОборотДт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Увеличение,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ ЖурналПроводокЕПСБУОбороты.КорСчет В (&СчетаИО)
		|				ТОГДА ЖурналПроводокЕПСБУОбороты.СуммаОборотКт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Уменьшение,
		|	СУММА(ВЫБОР
		|			КОГДА ЖурналПроводокЕПСБУОбороты.КорСчет В (&СчетаИО)
		|				ТОГДА ЖурналПроводокЕПСБУОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НачальныйОстаток
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(&НачалоПериода, &КонецПериода, Авто, Счет В (&МассивСчетов106), , &Условие, , ) КАК ЖурналПроводокЕПСБУОбороты
		|
		|ГДЕ
		|	&ГДЕУсловие
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналПроводокЕПСБУОбороты.Счет,
		|	ЖурналПроводокЕПСБУОбороты.Субконто1,
		|	ЖурналПроводокЕПСБУОбороты.Организация,
		|	ЖурналПроводокЕПСБУОбороты.КФО";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("МассивСчетов106", МассивСчетов106);
	Запрос.УстановитьПараметр("СчетаИО", МассивСчетовИО);
	
	ГДЕУсловие = "ИСТИНА";
	Если ИсключатьВнутрОборот = Истина Тогда
		ГДЕУсловие = "НЕ (ЖурналПроводокЕПСБУОбороты.Счет = ЖурналПроводокЕПСБУОбороты.КорСчет
			|		И ЖурналПроводокЕПСБУОбороты.Субконто1 = ЖурналПроводокЕПСБУОбороты.КорСубконто1)";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ГДЕУсловие",ГДЕУсловие);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[0].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи = РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("Организация,ОсновноеСредство","НачальныйОстаток,Увеличение,Уменьшение");
	
КонецПроцедуры

// для формы 192 - дополнительный набор для графы 12
//в графе 12 - дата возникновения дебиторской задолженности, отраженной в графе 10 (дата списания средств с лицевого счета, со счета в кредитной организации);

Функция ПолучитьВНД_ВозникновениеДтЗадолженности(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
	Перем ДополнительныйПериод1, ДополнительныйПериод2;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("ДополнительныйПериод1", ДополнительныйПериод1);
	СтруктураПараметров.Свойство("ДополнительныйПериод2", ДополнительныйПериод2);
	
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
		
	Если ТипЗнч(КонецПериода) = Тип("Дата") Тогда
		КонецПериода = Новый Граница(КонецПериода,ВидГраницы.Включая);
	КонецЕсли;	
	КонецПериодаДата = КонецДня(ЗаполнениеОтчетности.ПолучитьДатуИзПараметра(КонецПериода));
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	ТипДата = БюджетнаяОтчетность.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	ТипСтрока = БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(0);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	//ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ВидПоказателя",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКБК"));
	ТаблицаДанных.Колонки.Добавить("Контрагент",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанных.Колонки.Добавить("Договор",Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	
	ТаблицаДанных.Колонки.Добавить("ДатаВозникновения",ТипДата);
	
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И НЕ Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		УсловиеОрганизация = " И Организация = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;	
	
	Условие = УсловиеБаланс + УсловиеОрганизация;
	Условие = Сред(Условие,3);		
		
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);//Истина); - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("ВидПоказателя",Истина);
		
	ПараметрСчетаДт = ПараметрыСхемы.Найти("СчетаДт_"+ИмяНабора);
	Если ПараметрСчетаДт <> Неопределено Тогда
		СчетаДТ = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаДт.Значение);
	Иначе	
		СчетаДТ = БухгалтерскийУчет.СписокСчетов("206.20,206.30");
	КонецЕсли;
	
	ПараметрСчетаКт = ПараметрыСхемы.Найти("СчетаКт_"+ИмяНабора);
	Если ПараметрСчетаКт <> Неопределено Тогда
		СчетаКТ = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаКт.Значение);
	Иначе	
		СчетаКТ = БухгалтерскийУчет.СписокСчетов("201.00,304.05");
	КонецЕсли;
	
	ПараметрДатаНачала = ПараметрыСхемы.Найти("ПериодОтчета_"+ИмяНабора);
	Если ПараметрДатаНачала <> Неопределено Тогда
			
		Если ПараметрДатаНачала.Выражение = "&ДополнительныйПериод1" Тогда
			НачалоПериода = ДополнительныйПериод1;
		ИначеЕсли ПараметрДатаНачала.Выражение = "&ДополнительныйПериод2" Тогда
			НачалоПериода = ДополнительныйПериод2;
		ИначеЕсли ПараметрДатаНачала.Выражение = "&НачалоПериода" Тогда
			НачалоПериода = НачалоПериода;
		ИначеЕсли ПараметрДатаНачала.Выражение = "&КонецПериода" Тогда 
			НачалоПериода = КонецПериода;	
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнитьТаблицуПоОборотамРБ_ВозникновениеЗадолженности(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, СчетаДт, СчетаКт);
			
	Если ТаблицаДанных.Количество()>0 Тогда
		
		//Заполнение вида показателя
		ТабКПС = ТаблицаДанных.Скопировать(,"КПС");
		ТабКПС.Свернуть("КПС");
		ЗначенияКПС = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТабКПС.ВыгрузитьКолонку("КПС"),"ВидПоказателя");
		Для Каждого СтрТЧ Из ТаблицаДанных Цикл
			СтрТЧ.ВидПоказателя = ЗначенияКПС[СтрТЧ.КПС];
		КонецЦикла;
				
	КонецЕсли;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Процедура ДополнитьТаблицуПоОборотамРБ_ВозникновениеЗадолженности(ТаблицаДанных, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, СчетаДт, СчетаКт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналПроводокЕПСБУОборотыДтКт.СчетДт КАК Счет,
		|	ЖурналПроводокЕПСБУОборотыДтКт.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОборотыДтКт.КФО КАК КФО,
		|	ЖурналПроводокЕПСБУОборотыДтКт.КПСДт КАК КПС,
		|	ВЫБОР
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт1
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт2
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт1 ССЫЛКА Справочник.Договоры
		|			ТОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт1
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт2 ССЫЛКА Справочник.Договоры
		|			ТОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт2
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт3 ССЫЛКА Справочник.Договоры
		|			ТОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
		|	КОНЕЦ КАК Договор,
		|	МАКСИМУМ(ЖурналПроводокЕПСБУОборотыДтКт.ПериодДень) КАК ДатаВозникновения
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(&НачалоПериода, &КонецПериода, Авто, СчетДт В (&СчетаДт), , СчетКт В (&СчетаКт), , &Условие) КАК ЖурналПроводокЕПСБУОборотыДтКт
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналПроводокЕПСБУОборотыДтКт.КПСДт,
		|	ЖурналПроводокЕПСБУОборотыДтКт.СчетДт,
		|	ЖурналПроводокЕПСБУОборотыДтКт.Организация,
		|	ЖурналПроводокЕПСБУОборотыДтКт.КФО,
		|	ВЫБОР
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт1 ССЫЛКА Справочник.Договоры
		|			ТОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт1
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт2 ССЫЛКА Справочник.Договоры
		|			ТОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт2
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт3 ССЫЛКА Справочник.Договоры
		|			ТОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт1 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт1
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт2 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт2
		|		КОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт3 ССЫЛКА Справочник.Контрагенты
		|			ТОГДА ЖурналПроводокЕПСБУОборотыДтКт.СубконтоДт3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Запрос.УстановитьПараметр("СчетаДт", СчетаДт);
	
	Запрос.УстановитьПараметр("СчетаКт", СчетаКт);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
КонецПроцедуры


#Область ЗаполнениеТаблицыРазвернутыхНаборов

Процедура ДополнитьТаблицуПоДаннымОстатковИОборотов(ТаблицаДанных, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.Счет КАК Счет,
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.КФО КАК КФО,	"+?(СтруктураПолей.Субконто1,"
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.Субконто1 КАК Субконто1,","")+?(СтруктураПолей.Субконто2,"
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.Субконто2 КАК Субконто2,","")+?(СтруктураПолей.Субконто3,"
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.Субконто3 КАК Субконто3,","")+?(СтруктураПолей.КПС,"
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.КПС КАК КПС,","")+?(СтруктураПолей.ВидКПС,"
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.КПС.ВидПоказателя КАК ВидПоказателя,","")+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.ИФО КАК ИФО,","")+?(СтруктураПолей.КЭК,"
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.КЭК КАК КЭК,","")+"
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокДт КАК НачальныйОстатокДт,
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокКт КАК НачальныйОстатокКт,
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокДт КАК КонечныйОстатокДт,
		|	ЖурналПроводокЕПСБУОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокКт КАК КонечныйОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Авто, Движения, Счет В (&МассивСчетов), ,%Условие% ) КАК ЖурналПроводокЕПСБУОстаткиИОбороты";
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуПоДаннымИсправленияОшибок(ТаблицаДанных, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовОшибок)
	//СтруктураПолей - Структура строковых имен полей, по которым надо развернуть таблицу  (ИФО,Субконто1,Субконто2,Субконто3,КПС,КЭК(?))
	
	//запрос надо изменять в зависимости от того, какие поля в Массиве полей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналПроводокЕПСБУОбороты.Счет КАК Счет,
		|	ЖурналПроводокЕПСБУОбороты.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОбороты.КФО КАК КФО,	"+?(СтруктураПолей.Субконто1,"
		|	ЖурналПроводокЕПСБУОбороты.Субконто1 КАК Субконто1,","")+?(СтруктураПолей.Субконто2,"
		|	ЖурналПроводокЕПСБУОбороты.Субконто2 КАК Субконто2,","")+?(СтруктураПолей.Субконто3,"
		|	ЖурналПроводокЕПСБУОбороты.Субконто3 КАК Субконто3,","")+?(СтруктураПолей.КПС,"
		|	ЖурналПроводокЕПСБУОбороты.КПС КАК КПС,","")+?(СтруктураПолей.ВидКПС,"
		|	ЖурналПроводокЕПСБУОбороты.КПС.ВидПоказателя КАК ВидПоказателя,","")+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОбороты.ИФО КАК ИФО,","")+?(СтруктураПолей.КЭК,"
		|	ЖурналПроводокЕПСБУОбороты.КЭК КАК КЭК,","")+"
		|	ЖурналПроводокЕПСБУОбороты.СуммаОборот КАК СуммаИООборот
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(&НачалоПериода, &КонецПериода, Авто, Счет В (&МассивСчетов), ,%Условие% , КорСчет В (&МассивСчетовОшибок), ) КАК ЖурналПроводокЕПСБУОбороты";
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	Запрос.УстановитьПараметр("МассивСчетовОшибок", МассивСчетовОшибок);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуПоДаннымИсправленияОшибокПоВидамСчетовИО(ТаблицаДанныхИО, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, ВсеСчетаИО, МассивСчетовОшибокОбычные, МассивСчетовОшибокКонтроль)
	//СтруктураПолей - Структура строковых имен полей, по которым надо развернуть таблицу  (ИФО,Субконто1,Субконто2,Субконто3,КПС,КЭК(?))
	
	//запрос надо изменять в зависимости от того, какие поля в Массиве полей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналПроводокЕПСБУОбороты.Счет КАК Счет,
		|	ЖурналПроводокЕПСБУОбороты.ПериодСекунда КАК Период,
		|	ЖурналПроводокЕПСБУОбороты.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОбороты.КФО КАК КФО,	"+?(СтруктураПолей.Субконто1,"
		|	ЖурналПроводокЕПСБУОбороты.Субконто1 КАК Субконто1,","")+?(СтруктураПолей.Субконто2,"
		|	ЖурналПроводокЕПСБУОбороты.Субконто2 КАК Субконто2,","")+?(СтруктураПолей.Субконто3,"
		|	ЖурналПроводокЕПСБУОбороты.Субконто3 КАК Субконто3,","")+?(СтруктураПолей.КПС,"
		|	ЖурналПроводокЕПСБУОбороты.КПС КАК КПС,","")+?(СтруктураПолей.ВидКПС,"
		|	ЖурналПроводокЕПСБУОбороты.КПС.ВидПоказателя КАК ВидПоказателя,","")+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОбороты.ИФО КАК ИФО,","")+?(СтруктураПолей.КЭК,"
		|	ЖурналПроводокЕПСБУОбороты.КЭК КАК КЭК,","")+"
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУОбороты.КорСубконто1) = ТИП(Справочник.ПричиныОшибокПрошлыхЛет)
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОбороты.КорСубконто1 КАК Справочник.ПричиныОшибокПрошлыхЛет).КодПричиныОшибки
		|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУОбороты.КорСубконто2) = ТИП(Справочник.ПричиныОшибокПрошлыхЛет)
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОбороты.КорСубконто2 КАК Справочник.ПричиныОшибокПрошлыхЛет).КодПричиныОшибки
		|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУОбороты.КорСубконто3) = ТИП(Справочник.ПричиныОшибокПрошлыхЛет)
		|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОбороты.КорСубконто3 КАК Справочник.ПричиныОшибокПрошлыхЛет).КодПричиныОшибки
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КодыПричинОшибокПрошлыхЛет.ПустаяСсылка)
		|	КОНЕЦ КАК КодПричиныОшибки,	
		|	ВЫБОР
		|	КОГДА ЖурналПроводокЕПСБУОбороты.КорСчет В (&СчетаИООбычные)
		|		ТОГДА ЖурналПроводокЕПСБУОбороты.СуммаОборот
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаИООбычныеОборот,
		|	ВЫБОР
		|	КОГДА ЖурналПроводокЕПСБУОбороты.КорСчет В (&СчетаИОКонтроль)
		|		ТОГДА ЖурналПроводокЕПСБУОбороты.СуммаОборот
		|	ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаИОКонтрольОборот
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(&НачалоПериода, &КонецПериода, Авто, Счет В (&МассивСчетов), ,%Условие% , КорСчет В (&ВсеСчетаИО),) КАК ЖурналПроводокЕПСБУОбороты";
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	Запрос.УстановитьПараметр("ВсеСчетаИО", ВсеСчетаИО);
	Запрос.УстановитьПараметр("СчетаИООбычные", МассивСчетовОшибокОбычные);
	Запрос.УстановитьПараметр("СчетаИОКонтроль", МассивСчетовОшибокКонтроль);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанныхИО.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуПоДаннымОборотовДенежныхИНеденежных(ТаблицаДанных, СтруктураПолей, МассивСчетов, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода)
	//МассивПолей - массив строковых имен полей, по которым надо развернуть таблицу  (ИФО,Субконто1,Субконто2,Субконто3,КПС,КЭК(?))
	
	//запрос надо изменять в зависимости от того, какие поля в Массиве полей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Обороты.Счет КАК Счет,
		|	Обороты.Организация КАК Организация,
		|	Обороты.КФО КАК КФО,	"+?(СтруктураПолей.Субконто1,"
		|	Обороты.Субконто1 КАК Субконто1,","")+?(СтруктураПолей.Субконто2,"
		|	Обороты.Субконто2 КАК Субконто2,","")+?(СтруктураПолей.Субконто3,"
		|	Обороты.Субконто3 КАК Субконто3,","")+?(СтруктураПолей.КПС,"
		|	Обороты.КПС КАК КПС,","")+?(СтруктураПолей.ВидКПС,"
		|	Обороты.КПС.ВидПоказателя КАК ВидПоказателя,","")+?(СтруктураПолей.ИФО,"
		|	Обороты.ИФО КАК ИФО,","")+?(СтруктураПолей.КЭК,"
		|	Обороты.КЭК КАК КЭК,","")+"
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КорСчет В (&МассивДенежныхСчетов)
		|				ТОГДА Обороты.СуммаОборотДт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДенДт,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КорСчет В (&МассивДенежныхСчетов)
		|				ТОГДА Обороты.СуммаОборотКт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДенКт,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Обороты.КорСчет В (&МассивДенежныхСчетов)
		|				ТОГДА Обороты.СуммаОборотДт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеДенДт,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Обороты.КорСчет В (&МассивДенежныхСчетов)
		|				ТОГДА Обороты.СуммаОборотКт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеДенКт
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(&НачалоПериода, &КонецПериода, Авто, Счет В (&МассивСчетов), , %Условие%, НЕ КорСчет В (&МассивИсключаемыхКорСчетов), ) КАК Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.Счет,
		|	Обороты.КФО,"+?(СтруктураПолей.Субконто1,"
		|	Обороты.Субконто1,","")+?(СтруктураПолей.Субконто2,"
		|	Обороты.Субконто2,","")+?(СтруктураПолей.Субконто3,"
		|	Обороты.Субконто3,","")+?(СтруктураПолей.КПС,"
		|	Обороты.КПС,","")+?(СтруктураПолей.ВидКПС,"
		|	Обороты.КПС.ВидПоказателя,","")+?(СтруктураПолей.ИФО,"
		|	Обороты.ИФО,","")+?(СтруктураПолей.КЭК,"
		|	Обороты.КЭК,","")+"
		|	Обороты.Организация";
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	Запрос.УстановитьПараметр("МассивИсключаемыхКорСчетов", МассивИсключаемыхКорСчетов);
	Запрос.УстановитьПараметр("МассивДенежныхСчетов", МассивДенежныхСчетов);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуПоДаннымОстатков(ТаблицаДанных, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, ДатаОстатков)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
		|	ЖурналПроводокЕПСБУОстатки.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,	"+?(СтруктураПолей.Субконто1,"
		|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК Субконто1,","")+?(СтруктураПолей.Субконто2,"
		|	ЖурналПроводокЕПСБУОстатки.Субконто2 КАК Субконто2,","")+?(СтруктураПолей.Субконто3,"
		|	ЖурналПроводокЕПСБУОстатки.Субконто3 КАК Субконто3,","")+?(СтруктураПолей.КПС,"
		|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС,","")+?(СтруктураПолей.ВидКПС,"
		|	ЖурналПроводокЕПСБУОстатки.КПС.ВидПоказателя КАК ВидПоказателя,","")+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОстатки.ИФО КАК ИФО,","")+?(СтруктураПолей.КЭК,"
		|	ЖурналПроводокЕПСБУОстатки.КЭК КАК КЭК,","")+"
		|	ЖурналПроводокЕПСБУОстатки.СуммаРазвернутыйОстатокДт КАК ОстатокДт,
		|	ЖурналПроводокЕПСБУОстатки.СуммаРазвернутыйОстатокКт КАК ОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&ДатаОстатков, Счет В (&МассивСчетов), ,%Условие% ) КАК ЖурналПроводокЕПСБУОстатки";
		
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуПоДаннымОборотовСегменты(ТаблицаДанных, СтруктураПолей, МассивСчетов, МассивИсключаемыхКорСчетов, МассивСчетовСегменты, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода)
	//МассивПолей - массив строковых имен полей, по которым надо развернуть таблицу  (ИФО,Субконто1,Субконто2,Субконто3,КПС,КЭК(?))
	
	//запрос надо изменять в зависимости от того, какие поля в Массиве полей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Обороты.Счет КАК Счет,
		|	Обороты.Организация КАК Организация,
		|	Обороты.КФО КАК КФО,	"+?(СтруктураПолей.Субконто1,"
		|	Обороты.Субконто1 КАК Субконто1,","")+?(СтруктураПолей.Субконто2,"
		|	Обороты.Субконто2 КАК Субконто2,","")+?(СтруктураПолей.Субконто3,"
		|	Обороты.Субконто3 КАК Субконто3,","")+?(СтруктураПолей.КПС,"
		|	Обороты.КПС КАК КПС,","")+?(СтруктураПолей.ВидКПС,"
		|	Обороты.КПС.ВидПоказателя КАК ВидПоказателя,","")+?(СтруктураПолей.ИФО,"
		|	Обороты.ИФО КАК ИФО,","")+?(СтруктураПолей.КЭК,"
		|	Обороты.КЭК КАК КЭК,","")+"
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КорСчет В (&МассивСчетовСегменты)
		|				ТОГДА Обороты.СуммаОборотДт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СегмДт,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КорСчет В (&МассивСчетовСегменты)
		|				ТОГДА Обороты.СуммаОборотКт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СегмКт,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Обороты.КорСчет В (&МассивСчетовСегменты)
		|				ТОГДА Обороты.СуммаОборотДт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПрочДт,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Обороты.КорСчет В (&МассивСчетовСегменты)
		|				ТОГДА Обороты.СуммаОборотКт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПрочКт
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(&НачалоПериода, &КонецПериода, Авто, Счет В (&МассивСчетов), , %Условие%, НЕ КорСчет В (&МассивИсключаемыхКорСчетов), ) КАК Обороты
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.Счет,
		|	Обороты.КФО,"+?(СтруктураПолей.Субконто1,"
		|	Обороты.Субконто1,","")+?(СтруктураПолей.Субконто2,"
		|	Обороты.Субконто2,","")+?(СтруктураПолей.Субконто3,"
		|	Обороты.Субконто3,","")+?(СтруктураПолей.КПС,"
		|	Обороты.КПС,","")+?(СтруктураПолей.ВидКПС,"
		|	Обороты.КПС.ВидПоказателя,","")+?(СтруктураПолей.ИФО,"
		|	Обороты.ИФО,","")+?(СтруктураПолей.КЭК,"
		|	Обороты.КЭК,","")+"
		|	Обороты.Организация";
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("МассивСчетов", МассивСчетов);
	Запрос.УстановитьПараметр("МассивИсключаемыхКорСчетов", МассивИсключаемыхКорСчетов);
	Запрос.УстановитьПараметр("МассивСчетовСегменты", МассивСчетовСегменты);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеВНД_РазвернутыеОстаткиИОборотыДенежныхИНеденежных
//для 169/769 до 2021 года
Функция ПолучитьВНД_РазвернутыеОстаткиИОборотыДенежныхИНеденежных(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Если ТипЗнч(КонецПериода) = Тип("Дата") Тогда
		КонецПериода = Новый Граница(КонецПериода,ВидГраницы.Включая);
	КонецЕсли;
		
	ТаблицаМетодовДополнительнойОбработки = Справочники.ПравилаЗаполнения.ПолучитьТаблицуМетодов(ПравилоЗаполнения,,,Истина);
	КартыДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	ОбработкаЗаполнения = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(КартыДанных, "КартыДанных", ТаблицаМетодовДополнительнойОбработки, ПравилоЗаполнения, Неопределено, "") Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;	
	
	ИмяКарты = "";
	ПараметрыМетода = Неопределено;
	Для каждого СтрокаТаблицы Из ТаблицаМетодовДополнительнойОбработки Цикл
		
		Если СтрокаТаблицы.МетодОбработки <> "РазвернутоеСальдо" Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыМетода = СтрокаТаблицы.Параметры.Получить();//Структура
		ИмяКарты = ПараметрыМетода.КартаДанных;
		Прервать;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ИмяКарты) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	//В КартаРС необходимо переименовать колонки, которые используются как параметры в методе дополнения - Счет,Субконто1,Субконто2,Субконто3,
	//если их имя не совпадает с именем параметра
	
	//Если одноименные колонки уже есть, сначала удалим их, а потом переименуем нужные.
	КартаРС = КартыДанных[ИмяКарты];
	Если ПараметрыМетода.Счет <> "Счет" Тогда
		Если КартаРС.Колонки.Найти("Счет") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Счет");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Счет);
		ТекКолонка.Имя = "Счет";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто1 <> "Субконто1" Тогда
		Если КартаРС.Колонки.Найти("Субконто1") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто1");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто1);
		ТекКолонка.Имя = "Субконто1";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто2 <> "Субконто2" Тогда
		Если КартаРС.Колонки.Найти("Субконто2") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто2");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто2);
		ТекКолонка.Имя = "Субконто2";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто3 <> "Субконто3" Тогда
		Если КартаРС.Колонки.Найти("Субконто3") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто3");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто3);
		ТекКолонка.Имя = "Субконто3";
	КонецЕсли;
	
	ПараметрыИзДокумента = Ложь;
	Значение = Неопределено;
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") 
		И СтруктураПараметров.Свойство("ПараметрыИзДокумента",Значение)
			И ТипЗнч(Значение) = Тип("Булево") Тогда
		ПараметрыИзДокумента = Значение;
	КонецЕсли;
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	ТипДата = БюджетнаяОтчетность.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	
	НуженТипКонтрагента = Истина;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Если ДополнительныеПараметры.Свойство("ЗаполнятьКОСГУ") Тогда
			ЗаполнятьКОСГУ = ДополнительныеПараметры.ЗаполнятьКОСГУ;
			//Если по косгу не заполняется, значит тип контрагента заполнять не требуется
			Если ТипЗнч(ЗаполнятьКОСГУ) = Тип("Булево") Тогда
				Если ЗаполнятьКОСГУ = Ложь Тогда				
					НуженТипКонтрагента = Ложь;
				КонецЕсли;
			ИначеЕсли ТипЗнч(ЗаполнятьКОСГУ) = Тип("Структура") Тогда
				Если ЗаполнятьКОСГУ.ПравоеЗначение = Ложь Тогда
					НуженТипКонтрагента = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Субконто1");
	ТаблицаДанных.Колонки.Добавить("Субконто2");
	ТаблицаДанных.Колонки.Добавить("Субконто3");
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ВидПоказателя",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКБК"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	//ТаблицаДанных.Колонки.Добавить("КЭК",Новый ОписаниеТипов("СправочникСсылка.КОСГУ")); - не нужен
	ТаблицаДанных.Колонки.Добавить("ТипКонтрагентаКод",Новый ОписаниеТипов("Строка"));
		
	//Для 169/769 нужны:
	//- суммы развернутого начального и конечного остатка дт и кт:
	ТаблицаДанных.Колонки.Добавить("НачальныйОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("НачальныйОстатокКт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КонечныйОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КонечныйОстатокКт",ТипЧисло);
	//- суммы оборотов с денежными счетами по дт и кт:
	ТаблицаДанных.Колонки.Добавить("ДенДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("ДенКт",ТипЧисло);
	//- суммы оборотов с неденежными счетами по дт и кт:
	ТаблицаДанных.Колонки.Добавить("НеДенДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("НеДенКт",ТипЧисло);
	//- сумма оборотов исправления ошибок прошлых лет:
	ТаблицаДанных.Колонки.Добавить("СуммаИООборот",ТипЧисло);
			
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И НЕ Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		УсловиеОрганизация = " И Организация = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;
	
	УсловиеКФО = "";
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("КФО") Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.КФО) = Тип("Структура") Тогда
		
			мКФО = ДополнительныеПараметры.КФО;
			Если мКФО.Свойство("Использование") 
				И мКФО.Использование = Истина Тогда
				
				Если мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
					ИЛИ мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
					УсловиеКФО = " И КФО = &КФО";
					СтруктураПолейОтбора.Вставить("КФО",мКФО.ПравоеЗначение);
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
					ИЛИ мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
					УсловиеКФО = " И КФО <> &КФО";
					СтруктураПолейОтбора.Вставить("КФО",мКФО.ПравоеЗначение);
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
					ИЛИ мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
					УсловиеКФО = " И КФО В (&КФО)";
					СтруктураПолейОтбора.Вставить("КФО",мКФО.ПравоеЗначение);
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
					ИЛИ мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
					УсловиеКФО = " И НЕ КФО В (&КФО)";
					СтруктураПолейОтбора.Вставить("КФО",мКФО.ПравоеЗначение);
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
					УсловиеКФО = " И КФО <> &КФО";
					СтруктураПолейОтбора.Вставить("КФО",Перечисления.КВД.ПустаяСсылка());
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
					УсловиеКФО = " И КФО = &КФО";
					СтруктураПолейОтбора.Вставить("КФО",Перечисления.КВД.ПустаяСсылка());
				КонецЕсли;
							
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДополнительныеПараметры.КФО) = Тип("ПеречислениеСсылка.КВД") Тогда
			УсловиеКФО = " И КФО = &КФО";
			СтруктураПолейОтбора.Вставить("КФО",ДополнительныеПараметры.КФО);
		КонецЕсли;
	КонецЕсли;
	
	
	Условие = УсловиеБаланс + УсловиеОрганизация + УсловиеКФО;
	Условие = Сред(Условие,3);		
		
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);// - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("ВидКПС",Ложь);//заполняется отдельно, так быстрее
	СтруктураПолей.Вставить("Субконто1",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто2",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто3",Истина);//-меняется динамически
	СтруктураПолей.Вставить("КЭК",Ложь);// - пока кэк не нужен, и вряд ли будет вообще нужен в данном наборе
	
	//Счета исправления ошибок
			
	ПараметрДенежныеСчета = ПараметрыСхемы.Найти("ДенежныеСчета_"+ИмяНабора);
	Если ПараметрДенежныеСчета <> Неопределено Тогда
		МассивДенежныхСчетов = БухгалтерскийУчет.СписокСчетов(ПараметрДенежныеСчета.Значение);
	Иначе	
		МассивДенежныхСчетов = БухгалтерскийУчет.СписокСчетов("201.10, 201.20, 201.34, 210.02, 210.03, 210.04, 304.05");
	КонецЕсли;
	
	ПараметрСчетаИО = ПараметрыСхемы.Найти("СчетаИсправленияОшибок_"+ИмяНабора);
	Если ПараметрСчетаИО <> Неопределено Тогда
		МассивСчетовИО = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаИО.Значение);
	Иначе	
		МассивСчетовИО = БухгалтерскийУчет.СписокСчетов("304.84, 304.94, 304.66, 304.76, 304.86, 304.96, 
														|401.16, 401.17, 401.18, 401.19, 
														|401.26, 401.27, 401.28, 401.29");
	КонецЕсли;
	
	ПараметрСчетаИсключаемые = ПараметрыСхемы.Найти("СчетаИсключаемые_"+ИмяНабора);
	Если ПараметрСчетаИсключаемые <> Неопределено Тогда
		МассивИсключаемыхКорСчетов = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаИсключаемые.Значение);
	Иначе	
		МассивИсключаемыхКорСчетов = БухгалтерскийУчет.СписокСчетов("304.84, 304.94, 304.66, 304.76, 304.86, 304.96, 
																	|401.16, 401.17, 401.18, 401.19, 
																	|401.26, 401.27, 401.28, 401.29, 
																	|401.30, 000");
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Ложь,Ложь);//0
	ДополнитьТаблицуПоРазворотуСубконтоИОборотам(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов);	

	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Ложь,Ложь);//1
	ДополнитьТаблицуПоРазворотуСубконтоИОборотам(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Истина,Ложь);//2
	ДополнитьТаблицуПоРазворотуСубконтоИОборотам(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов);	

	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Ложь,Истина);//3
	ДополнитьТаблицуПоРазворотуСубконтоИОборотам(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Истина,Ложь);//1,2
	ДополнитьТаблицуПоРазворотуСубконтоИОборотам(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Ложь,Истина);//1,3
	ДополнитьТаблицуПоРазворотуСубконтоИОборотам(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Истина,Истина);//2,3
	ДополнитьТаблицуПоРазворотуСубконтоИОборотам(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Истина,Истина);//1,2,3
	ДополнитьТаблицуПоРазворотуСубконтоИОборотам(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов);	
	
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ВидПоказателя,ИФО,КФО,ТипКонтрагентаКод",
						"НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИООборот,ДенДт,ДенКт,НеДенДт,НеДенКт");
	
	Если НуженТипКонтрагента Тогда
		//Дополняем таблицу данных кодами типов контрагентов
		ТипЗнчКонтрагенты = Тип("СправочникСсылка.Контрагенты");
		ЗаполненныеКонтрагенты = Новый Соответствие;
		
		//Заполняем коды типов контрагентов в полученной таблице.
		Для Каждого СтрДанных Из ТаблицаДанных Цикл
			Если ТипЗнч(СтрДанных.Субконто1) = ТипЗнчКонтрагенты Тогда
				Если ЗначениеЗаполнено(СтрДанных.Субконто1) Тогда
					ЗаполненныеКонтрагенты.Вставить(СтрДанных.Субконто1);
				КонецЕсли;
			ИначеЕсли ТипЗнч(СтрДанных.Субконто2) = ТипЗнчКонтрагенты Тогда
				Если ЗначениеЗаполнено(СтрДанных.Субконто2) Тогда
					ЗаполненныеКонтрагенты.Вставить(СтрДанных.Субконто2);
				КонецЕсли;
			ИначеЕсли ТипЗнч(СтрДанных.Субконто3) = ТипЗнчКонтрагенты Тогда
				Если ЗначениеЗаполнено(СтрДанных.Субконто3) Тогда
					ЗаполненныеКонтрагенты.Вставить(СтрДанных.Субконто3);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		МассивКонтрагентов = Новый Массив;
		Для Каждого КлючИЗначение Из ЗаполненныеКонтрагенты Цикл
			МассивКонтрагентов.Добавить(КлючИЗначение.Ключ);
		КонецЦикла;
		
		Если МассивКонтрагентов.Количество() Тогда
			
			ТипыКонтрагентов = Новый Соответствие;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Контрагенты.Ссылка КАК Ссылка,
				|	Контрагенты.ТипКонтрагента.Код КАК ТипКонтрагентаКод
				|ИЗ
				|	Справочник.Контрагенты КАК Контрагенты
				|ГДЕ
				|	Контрагенты.Ссылка В(&МассивКонтрагентов)";
			
			Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ТипыКонтрагентов.Вставить(Выборка.Ссылка, Выборка.ТипКонтрагентаКод);
			КонецЦикла;
			
		Иначе
			ТипыКонтрагентов = Новый Соответствие;
		КонецЕсли;
		
		Для Каждого СтрДанных Из ТаблицаДанных Цикл
			ТекТипКонтрагента = Неопределено;
			КонтрагентЗаполнен = Ложь;
			Если ТипЗнч(СтрДанных.Субконто1) = ТипЗнчКонтрагенты Тогда
				ТекТипКонтрагента = ТипыКонтрагентов[СтрДанных.Субконто1];
				КонтрагентЗаполнен = ЗначениеЗаполнено(СтрДанных.Субконто1);
			ИначеЕсли ТипЗнч(СтрДанных.Субконто2) = ТипЗнчКонтрагенты Тогда
				ТекТипКонтрагента = ТипыКонтрагентов[СтрДанных.Субконто2];
				КонтрагентЗаполнен = ЗначениеЗаполнено(СтрДанных.Субконто2);
			ИначеЕсли ТипЗнч(СтрДанных.Субконто3) = ТипЗнчКонтрагенты Тогда
				ТекТипКонтрагента = ТипыКонтрагентов[СтрДанных.Субконто3];
				КонтрагентЗаполнен = ЗначениеЗаполнено(СтрДанных.Субконто3);
			КонецЕсли;
			
			Если КонтрагентЗаполнен Тогда
				Если ТекТипКонтрагента = Неопределено Тогда
					СтрДанных.ТипКонтрагентаКод = "1";
				ИначеЕсли ЗначениеЗаполнено(ТекТипКонтрагента) Тогда
					СтрДанных.ТипКонтрагентаКод = ТекТипКонтрагента;
				Иначе
					СтрДанных.ТипКонтрагентаКод = "0";
				КонецЕсли;
			Иначе
				СтрДанных.ТипКонтрагентаКод = "1";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Далее необходимо распределить СуммаИООборот отдельно на исправление дебиторской задолженности и отдельно на исправление кредиторской задолженности,
	//И только после этого свернуть таблицу по субконто, чтобы получить обобщенные остатки
	
	ТаблицаДанных.Колонки.Добавить("СуммаИОДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("СуммаИОКт",ТипЧисло);
	
	//Если вид счета Пассивный - то положительной суммой правим Кт сумму,
			
	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
		Если СтрТЧ.СуммаИООборот=0 Тогда
			Продолжить;
		КонецЕсли;
		//Если сумма исправления >0 и есть КТ задолженность, нужно сначала уменьшить остаток по Кт,
		//а на оставшуюся сумму увеличить дт
		Если СтрТЧ.СуммаИООборот>0
			И СтрТЧ.НачальныйОстатокКт>0 Тогда
			
			СтрТЧ.СуммаИОКт = - Мин(СтрТЧ.СуммаИООборот,СтрТЧ.НачальныйОстатокКт); //уменьшаем остаток, знак минус
			СтрТЧ.СуммаИОДт = СтрТЧ.СуммаИООборот + СтрТЧ.СуммаИОКт;//складываем, т.к. СуммаИОКт - отрицательная
			
		//Если сумма исправления <0 и есть ДТ задолженность, нужно сначала уменьшить остаток по ДТ,
		//а на оставшуюся сумму увеличить КТ	
		ИначеЕсли СтрТЧ.СуммаИООборот<0
			И СтрТЧ.НачальныйОстатокДт>0 Тогда
			
			СуммаИООборотПоложительная = -1*СтрТЧ.СуммаИООборот;
			
			СтрТЧ.СуммаИОДт = - Мин(СуммаИООборотПоложительная,СтрТЧ.НачальныйОстатокДт); //уменьшаем остаток, знак минус
			СтрТЧ.СуммаИОКт = СуммаИООборотПоложительная + СтрТЧ.СуммаИОДт;//складываем, т.к. СуммаИОДт - отрицательная
			
		//НЕТ КТ задолженности и сумма исправления >0, тогда вся сумма исправления это увеличение ДТ	
		ИначеЕсли СтрТЧ.СуммаИООборот>0 Тогда

		    СтрТЧ.СуммаИОДт = СтрТЧ.СуммаИООборот;
			СтрТЧ.СуммаИОКт = 0;
			
		//НЕТ ДТ задолженности и сумма исправления <0, тогда вся сумма исправления это увеличение КТ	
		ИначеЕсли СтрТЧ.СуммаИООборот<0 Тогда
			
			СтрТЧ.СуммаИОДт = 0;
			СтрТЧ.СуммаИОКт = -СтрТЧ.СуммаИООборот;
			
		КонецЕсли;
	КонецЦикла;
	
	//После того как распределили задолженность, можно свернуть таблицу детальных данных	
	//По организации и ИФО сворачивать нельзя никогда, 
	//т.к. в правилах заполнения на набор дополнительно накладываются по ним отбор

	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО,КПС,ВидПоказателя,ТипКонтрагентаКод",
					"НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИОДт,СуммаИОКт,ДенДт,ДенКт,НеДенДт,НеДенКт");
	
	КартаРС = Неопределено;
	
	Если ТаблицаДанных.Количество()>0 Тогда
		//Заполнение вида показателя
		ТабКПС = ТаблицаДанных.Скопировать(,"КПС");
		ТабКПС.Свернуть("КПС");
		
		ЗначенияКПС = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТабКПС.ВыгрузитьКолонку("КПС"),"ВидПоказателя");
		
		Для Каждого СтрТЧ Из ТаблицаДанных Цикл
			СтрТЧ.ВидПоказателя = ЗначенияКПС[СтрТЧ.КПС];
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаДанных;
	
КонецФункции

//для 169/769 с 2021 года
Функция ПолучитьВНД_РазвернутыеОстаткиИОборотыКЭК(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Если ТипЗнч(КонецПериода) = Тип("Дата") Тогда
		КонецПериода = Новый Граница(КонецПериода,ВидГраницы.Включая);
	КонецЕсли;
		
	ТаблицаМетодовДополнительнойОбработки = Справочники.ПравилаЗаполнения.ПолучитьТаблицуМетодов(ПравилоЗаполнения,,,Истина);
	КартыДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	ОбработкаЗаполнения = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(КартыДанных, "КартыДанных", ТаблицаМетодовДополнительнойОбработки, ПравилоЗаполнения, Неопределено, "") Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;	
	
	ИмяКарты = "";
	ПараметрыМетода = Неопределено;
	Для каждого СтрокаТаблицы Из ТаблицаМетодовДополнительнойОбработки Цикл
		
		Если СтрокаТаблицы.МетодОбработки <> "РазвернутоеСальдо" Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыМетода = СтрокаТаблицы.Параметры.Получить();//Структура
		ИмяКарты = ПараметрыМетода.КартаДанных;
		Прервать;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ИмяКарты) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	//В КартаРС необходимо переименовать колонки, которые используются как параметры в методе дополнения - Счет,Субконто1,Субконто2,Субконто3,
	//если их имя не совпадает с именем параметра
	
	//Если одноименные колонки уже есть, сначала удалим их, а потом переименуем нужные.
	КартаРС = КартыДанных[ИмяКарты];
	Если ПараметрыМетода.Счет <> "Счет" Тогда
		Если КартаРС.Колонки.Найти("Счет") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Счет");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Счет);
		ТекКолонка.Имя = "Счет";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто1 <> "Субконто1" Тогда
		Если КартаРС.Колонки.Найти("Субконто1") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто1");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто1);
		ТекКолонка.Имя = "Субконто1";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто2 <> "Субконто2" Тогда
		Если КартаРС.Колонки.Найти("Субконто2") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто2");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто2);
		ТекКолонка.Имя = "Субконто2";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто3 <> "Субконто3" Тогда
		Если КартаРС.Колонки.Найти("Субконто3") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто3");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто3);
		ТекКолонка.Имя = "Субконто3";
	КонецЕсли;
	
	ПараметрыИзДокумента = Ложь;
	Значение = Неопределено;
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") 
		И СтруктураПараметров.Свойство("ПараметрыИзДокумента",Значение)
			И ТипЗнч(Значение) = Тип("Булево") Тогда
		ПараметрыИзДокумента = Значение;
	КонецЕсли;
	
	СоответствиеСчетаБезКЭК = Новый Соответствие;
	
	УчитыватьКартуКЭК000 = Истина;//общая настройка правила заполнения на использование карты данных СчетаБезКЭК
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("УчитыватьКартуКЭК000") Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Структура") Тогда
			
			Если ДополнительныеПараметры.УчитыватьКартуКЭК000.Свойство("ПравоеЗначение")
				И ДополнительныеПараметры.УчитыватьКартуКЭК000.ПравоеЗначение = Ложь Тогда
				
				УчитыватьКартуКЭК000 = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Булево") Тогда
			
			УчитыватьКартуКЭК000 = ДополнительныеПараметры.УчитыватьКартуКЭК000;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КартаСчетовБезКЭК = Неопределено;
	Если УчитыватьКартуКЭК000 = Истина
		И КартыДанных.Свойство("СчетаБезКЭК",КартаСчетовБезКЭК) Тогда
		Если КартаСчетовБезКЭК.Колонки.Найти("Счет") <> Неопределено
			И КартаСчетовБезКЭК.Колонки.Найти("Использовать")<> Неопределено Тогда
			
			Для Каждого СтрКарты Из КартаСчетовБезКЭК.НайтиСтроки(Новый Структура("Использовать",Истина)) Цикл
				СоответствиеСчетаБезКЭК.Вставить(СтрКарты.Счет,Истина);	
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	ТипДата = БюджетнаяОтчетность.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Субконто1");
	ТаблицаДанных.Колонки.Добавить("Субконто2");
	ТаблицаДанных.Колонки.Добавить("Субконто3");
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ВидПоказателя",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКБК"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("КЭК",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
		
	//Для 169/769 нужны:
	//- суммы развернутого начального и конечного остатка дт и кт:
	ТаблицаДанных.Колонки.Добавить("НачальныйОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("НачальныйОстатокКт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КонечныйОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КонечныйОстатокКт",ТипЧисло);
	//- суммы оборотов с денежными счетами по дт и кт:
	ТаблицаДанных.Колонки.Добавить("ДенДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("ДенКт",ТипЧисло);
	//- суммы оборотов с неденежными счетами по дт и кт:
	ТаблицаДанных.Колонки.Добавить("НеДенДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("НеДенКт",ТипЧисло);
	//- сумма оборотов исправления ошибок прошлых лет:
	ТаблицаДанных.Колонки.Добавить("СуммаИООборот",ТипЧисло);
			
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И НЕ Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		УсловиеОрганизация = " И Организация = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;
	
	УсловиеКФО = "";
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("КФО") Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.КФО) = Тип("Структура") Тогда
		
			мКФО = ДополнительныеПараметры.КФО;
			Если мКФО.Свойство("Использование") 
				И мКФО.Использование = Истина Тогда
				
				Если мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
					ИЛИ мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
					УсловиеКФО = " И КФО = &КФО";
					СтруктураПолейОтбора.Вставить("КФО",мКФО.ПравоеЗначение);
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
					ИЛИ мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
					УсловиеКФО = " И КФО <> &КФО";
					СтруктураПолейОтбора.Вставить("КФО",мКФО.ПравоеЗначение);
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
					ИЛИ мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
					УсловиеКФО = " И КФО В (&КФО)";
					СтруктураПолейОтбора.Вставить("КФО",мКФО.ПравоеЗначение);
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
					ИЛИ мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
					УсловиеКФО = " И НЕ КФО В (&КФО)";
					СтруктураПолейОтбора.Вставить("КФО",мКФО.ПравоеЗначение);
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
					УсловиеКФО = " И КФО <> &КФО";
					СтруктураПолейОтбора.Вставить("КФО",Перечисления.КВД.ПустаяСсылка());
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
					УсловиеКФО = " И КФО = &КФО";
					СтруктураПолейОтбора.Вставить("КФО",Перечисления.КВД.ПустаяСсылка());
				КонецЕсли;
							
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДополнительныеПараметры.КФО) = Тип("ПеречислениеСсылка.КВД") Тогда
			УсловиеКФО = " И КФО = &КФО";
			СтруктураПолейОтбора.Вставить("КФО",ДополнительныеПараметры.КФО);
		КонецЕсли;
	КонецЕсли;
	
	
	Условие = УсловиеБаланс + УсловиеОрганизация + УсловиеКФО;
	Условие = Сред(Условие,3);		
		
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);// - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("ВидКПС",Ложь);//заполняется отдельно, так быстрее
	СтруктураПолей.Вставить("Субконто1",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто2",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто3",Истина);//-меняется динамически
	СтруктураПолей.Вставить("КЭК",Истина);// - нужен всегда с 2021 года
	
	//Счета исправления ошибок
			
	ПараметрДенежныеСчета = ПараметрыСхемы.Найти("ДенежныеСчета_"+ИмяНабора);
	Если ПараметрДенежныеСчета <> Неопределено Тогда
		МассивДенежныхСчетов = БухгалтерскийУчет.СписокСчетов(ПараметрДенежныеСчета.Значение);
	Иначе	
		МассивДенежныхСчетов = БухгалтерскийУчет.СписокСчетов("201.10, 201.20, 201.34, 210.02, 210.03, 210.04, 304.05");
	КонецЕсли;
	
	ПараметрСчетаИО = ПараметрыСхемы.Найти("СчетаИсправленияОшибок_"+ИмяНабора);
	Если ПараметрСчетаИО <> Неопределено Тогда
		МассивСчетовИО = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаИО.Значение);
	Иначе	
		МассивСчетовИО = БухгалтерскийУчет.СписокСчетов("304.66, 304.76, 304.86, 304.96, 
														|401.16, 401.17, 401.18, 401.19, 
														|401.26, 401.27, 401.28, 401.29");
	КонецЕсли;
	
	ПараметрСчетаИсключаемые = ПараметрыСхемы.Найти("СчетаИсключаемые_"+ИмяНабора);
	Если ПараметрСчетаИсключаемые <> Неопределено Тогда
		МассивИсключаемыхКорСчетов = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаИсключаемые.Значение);
	Иначе	
		МассивИсключаемыхКорСчетов = БухгалтерскийУчет.СписокСчетов("304.66, 304.76, 304.86, 304.96, 
																	|401.16, 401.17, 401.18, 401.19, 
																	|401.26, 401.27, 401.28, 401.29, 
																	|401.30, 000");
	КонецЕсли;
	
	ДополнитьТаблицуПоДаннымОстатковИОборотовОбщая(ТаблицаДанных, КартаРС, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода);
	
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ВидПоказателя,ИФО,КФО,КЭК",
						"НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИООборот,ДенДт,ДенКт,НеДенДт,НеДенКт");

	ДополнитьТаблицуПоДаннымИсправленияОшибокОбщая(ТаблицаДанных, КартаРС, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО);
	ДополнитьТаблицуПоДаннымОборотовДенежныхИНеденежныхОбщая(ТаблицаДанных, КартаРС, СтруктураПолей, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода);
		
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ВидПоказателя,ИФО,КФО,КЭК",
						"НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИООборот,ДенДт,ДенКт,НеДенДт,НеДенКт");
	
	//КЭК оборотов не используются, все КЭК должны быть преобразованы в 000-009
	
	ЗаполнитьДетальныйКЭКВТаблицеДанных(ТаблицаДанных,СоответствиеСчетаБезКЭК);
	
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ВидПоказателя,ИФО,КФО,КЭК",
						"НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИООборот,ДенДт,ДенКт,НеДенДт,НеДенКт");
	
	//Т.к. в начале года остатки на 000-009, в середине года обороты по 56х/66х и 73х/83х, то после замены кэк нужно исправить конечные остатки
	//иначе получится, что если до замены было: 
	//по 001 остаток на начало по дт 100,
	//по 561/661 оборот в кт 150
	//и на конец года будет по 001 остаток по дт 100, а по 561/661 остаток по кт 150.
	//А должно быть по 001 остаток на конец по кт 50, и все.
	
	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
		//т.к. форма может заполняться не с начала года, то остатки на начало отчетного периода могут быть на разных КЭК - 561/661,
		//необходимо их объединить
		Если СтрТЧ.НачальныйОстатокДт <> 0
			ИЛИ СтрТЧ.НачальныйОстатокКт <> 0 Тогда
			
			Если СтрТЧ.НачальныйОстатокДт >= СтрТЧ.НачальныйОстатокКт Тогда
				СтрТЧ.НачальныйОстатокДт = СтрТЧ.НачальныйОстатокДт - СтрТЧ.НачальныйОстатокКт;
				СтрТЧ.НачальныйОстатокКт = 0;
			Иначе
				СтрТЧ.НачальныйОстатокКт = СтрТЧ.НачальныйОстатокКт - СтрТЧ.НачальныйОстатокДт;
				СтрТЧ.НачальныйОстатокДт = 0;
			КонецЕсли;
			
		КонецЕсли;
	
		
		Если СтрТЧ.КонечныйОстатокДт <> 0
			ИЛИ СтрТЧ.КонечныйОстатокКт <> 0 Тогда
				
			Если СтрТЧ.КонечныйОстатокДт >= СтрТЧ.КонечныйОстатокКт Тогда
				СтрТЧ.КонечныйОстатокДт = СтрТЧ.КонечныйОстатокДт - СтрТЧ.КонечныйОстатокКт;
				СтрТЧ.КонечныйОстатокКт = 0;
			Иначе
				СтрТЧ.КонечныйОстатокКт = СтрТЧ.КонечныйОстатокКт - СтрТЧ.КонечныйОстатокДт;
				СтрТЧ.КонечныйОстатокДт = 0;
			КонецЕсли;
		
		КонецЕсли;
	КонецЦикла;	
	
	//Далее необходимо распределить СуммаИООборот отдельно на исправление дебиторской задолженности и отдельно на исправление кредиторской задолженности,
	//И только после этого свернуть таблицу по субконто, чтобы получить обобщенные остатки
	
	ТаблицаДанных.Колонки.Добавить("СуммаИОДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("СуммаИОКт",ТипЧисло);
	
	//Если вид счета Пассивный - то положительной суммой правим Кт сумму,
			
	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
		Если СтрТЧ.СуммаИООборот=0 Тогда
			Продолжить;
		КонецЕсли;
		//Если сумма исправления >0 и есть КТ задолженность, нужно сначала уменьшить остаток по Кт,
		//а на оставшуюся сумму увеличить дт
		Если СтрТЧ.СуммаИООборот>0
			И СтрТЧ.НачальныйОстатокКт>0 Тогда
			
			СтрТЧ.СуммаИОКт = - Мин(СтрТЧ.СуммаИООборот,СтрТЧ.НачальныйОстатокКт); //уменьшаем остаток, знак минус
			СтрТЧ.СуммаИОДт = СтрТЧ.СуммаИООборот + СтрТЧ.СуммаИОКт;//складываем, т.к. СуммаИОКт - отрицательная
			
		//Если сумма исправления <0 и есть ДТ задолженность, нужно сначала уменьшить остаток по ДТ,
		//а на оставшуюся сумму увеличить КТ	
		ИначеЕсли СтрТЧ.СуммаИООборот<0
			И СтрТЧ.НачальныйОстатокДт>0 Тогда
			
			СуммаИООборотПоложительная = -1*СтрТЧ.СуммаИООборот;
			
			СтрТЧ.СуммаИОДт = - Мин(СуммаИООборотПоложительная,СтрТЧ.НачальныйОстатокДт); //уменьшаем остаток, знак минус
			СтрТЧ.СуммаИОКт = СуммаИООборотПоложительная + СтрТЧ.СуммаИОДт;//складываем, т.к. СуммаИОДт - отрицательная
			
		//НЕТ КТ задолженности и сумма исправления >0, тогда вся сумма исправления это увеличение ДТ	
		ИначеЕсли СтрТЧ.СуммаИООборот>0 Тогда

		    СтрТЧ.СуммаИОДт = СтрТЧ.СуммаИООборот;
			СтрТЧ.СуммаИОКт = 0;
			
		//НЕТ ДТ задолженности и сумма исправления <0, тогда вся сумма исправления это увеличение КТ	
		ИначеЕсли СтрТЧ.СуммаИООборот<0 Тогда
			
			СтрТЧ.СуммаИОДт = 0;
			СтрТЧ.СуммаИОКт = -СтрТЧ.СуммаИООборот;
			
		КонецЕсли;
	КонецЦикла;
	
	//После того как распределили задолженность, можно свернуть таблицу детальных данных	
	//По организации и ИФО сворачивать нельзя никогда, 
	//т.к. в правилах заполнения на набор дополнительно накладываются по ним отбор

	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО,КПС,ВидПоказателя,КЭК",
					"НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИОДт,СуммаИОКт,ДенДт,ДенКт,НеДенДт,НеДенКт");
	
	КартаРС = Неопределено;
	
	Если ТаблицаДанных.Количество()>0 Тогда
		//Заполнение вида показателя
		ТабКПС = ТаблицаДанных.Скопировать(,"КПС");
		ТабКПС.Свернуть("КПС");
		
		ЗначенияКПС = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТабКПС.ВыгрузитьКолонку("КПС"),"ВидПоказателя");
		
		Для Каждого СтрТЧ Из ТаблицаДанных Цикл
			СтрТЧ.ВидПоказателя = ЗначенияКПС[СтрТЧ.КПС];
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Процедура ЗаполнитьДетальныйКЭКВТаблицеДанных(ТаблицаДанных,СоответствиеСчетаБезКЭК)
	
	КЭКДляЗамены = ПолучитьКЭКДляЗамены();
	
	КЭК000 = Справочники.КОСГУ.НайтиПоКоду("000");
	
	//Заменяем КЭК оборотов на КЭК остатков в таблице
	Для Каждого СтрДанных Из ТаблицаДанных Цикл
		Если СоответствиеСчетаБезКЭК[СтрДанных.Счет] = Истина Тогда
			СтрДанных.КЭК = КЭК000;
		Иначе
			НовыйКЭК = КЭКДляЗамены.Получить(СтрДанных.КЭК);
			Если ЗначениеЗаполнено(НовыйКЭК) Тогда
				СтрДанных.КЭК = НовыйКЭК;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


Функция ПолучитьКЭКДляЗамены()
	
	Перем ВыборкаКЭКДляЗамены, ВыборкаКЭКОстатков, Запрос, КодыКЭКДляЗамены, КодыКЭКОстатков, КЭКДляЗамены, КЭКОстатков, МассивРезультатов, Сч;
	
	КодыКЭКОстатков = Новый Массив;
	КодыКЭКДляЗамены = Новый Массив;
	
	Для Сч = 0 По 9 Цикл
		КодыКЭКОстатков.Добавить("00"+Сч);
		
		КодыКЭКДляЗамены.Добавить("56"+Сч);
		КодыКЭКДляЗамены.Добавить("66"+Сч);
		КодыКЭКДляЗамены.Добавить("73"+Сч);
		КодыКЭКДляЗамены.Добавить("83"+Сч);		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОСГУ.Ссылка КАК Ссылка,
	|	КОСГУ.Код КАК КОСГУКод
	|ИЗ
	|	Справочник.КОСГУ КАК КОСГУ
	|ГДЕ
	|	КОСГУ.Код В(&КодыКЭКОстатков)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОСГУ.Ссылка КАК Ссылка,
	|	""00"" + ПОДСТРОКА(КОСГУ.Код, 3, 1) КАК КОСГУОстатковКод
	|ИЗ
	|	Справочник.КОСГУ КАК КОСГУ
	|ГДЕ
	|	КОСГУ.Код В(&КодыКЭКДляЗамены)";
	
	Запрос.УстановитьПараметр("КодыКЭКОстатков", КодыКЭКОстатков);
	Запрос.УстановитьПараметр("КодыКЭКДляЗамены", КодыКЭКДляЗамены);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	КЭКОстатков = Новый Соответствие;
	ВыборкаКЭКОстатков = МассивРезультатов[0].Выбрать();
	Пока ВыборкаКЭКОстатков.Следующий() Цикл
		КЭКОстатков.Вставить(ВыборкаКЭКОстатков.КОСГУКод, ВыборкаКЭКОстатков.Ссылка);
	КонецЦикла;
	
	КЭКДляЗамены = Новый Соответствие;
	ВыборкаКЭКДляЗамены = МассивРезультатов[1].Выбрать();
	Пока ВыборкаКЭКДляЗамены.Следующий() Цикл
		КЭКДляЗамены.Вставить(ВыборкаКЭКДляЗамены.Ссылка, КЭКОстатков.Получить(ВыборкаКЭКДляЗамены.КОСГУОстатковКод));
	КонецЦикла;
	Возврат КЭКДляЗамены;

КонецФункции

//процедуры оптимизации 
Процедура ДополнитьТаблицуПоДаннымОстатковИОборотовОбщая(ТаблицаДанных, КартаРС, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРС.Счет КАК Счет,
		|	ТаблицаРС.Субконто1 КАК Субконто1,
		|	ТаблицаРС.Субконто2 КАК Субконто2,
		|	ТаблицаРС.Субконто3 КАК Субконто3
		|ПОМЕСТИТЬ НастройкаРС
		|ИЗ
		|	&ТаблицаРС КАК ТаблицаРС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
		|	ЖурналПроводокЕПСБУОстатки.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто1
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто1, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто1,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто2
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто2, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто2,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто3
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто3, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто3,
		|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОстатки.ИФО КАК ИФО,","")+"
		|	ЖурналПроводокЕПСБУОстатки.КЭК КАК КЭК,
		|	СУММА(ЖурналПроводокЕПСБУОстатки.СуммаРазвернутыйОстатокДт) КАК НачальныйОстатокДт,
		|	СУММА(ЖурналПроводокЕПСБУОстатки.СуммаРазвернутыйОстатокКт) КАК НачальныйОстатокКт,
		|	0 КАК КонечныйОстатокДт,
		|	0 КАК КонечныйОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&НачалоПериода, Счет В (&МассивСчетов), , %Условие%) КАК ЖурналПроводокЕПСБУОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкаРС КАК НастройкаРС
		|		ПО ЖурналПроводокЕПСБУОстатки.Счет = НастройкаРС.Счет
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналПроводокЕПСБУОстатки.Счет,
		|	ЖурналПроводокЕПСБУОстатки.Организация,
		|	ЖурналПроводокЕПСБУОстатки.КФО,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто1
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто1, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто2
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто2, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто3
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто3, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ЖурналПроводокЕПСБУОстатки.КПС,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОстатки.ИФО,","")+"
		|	ЖурналПроводокЕПСБУОстатки.КЭК
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЖурналПроводокЕПСБУОстатки.Счет,
		|	ЖурналПроводокЕПСБУОстатки.Организация,
		|	ЖурналПроводокЕПСБУОстатки.КФО,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто1
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто1, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто2
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто2, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто3
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто3, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ЖурналПроводокЕПСБУОстатки.КПС,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОстатки.ИФО,","")+"
		|	ЖурналПроводокЕПСБУОстатки.КЭК,
		|	0,
		|	0,
		|	СУММА(ЖурналПроводокЕПСБУОстатки.СуммаРазвернутыйОстатокДт),
		|	СУММА(ЖурналПроводокЕПСБУОстатки.СуммаРазвернутыйОстатокКт)
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&КонецПериода, Счет В (&МассивСчетов), , %Условие%) КАК ЖурналПроводокЕПСБУОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкаРС КАК НастройкаРС
		|		ПО ЖурналПроводокЕПСБУОстатки.Счет = НастройкаРС.Счет
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналПроводокЕПСБУОстатки.Счет,
		|	ЖурналПроводокЕПСБУОстатки.Организация,
		|	ЖурналПроводокЕПСБУОстатки.КФО,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто1
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто1, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто2
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто2, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто3
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто3, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ЖурналПроводокЕПСБУОстатки.КПС,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОстатки.ИФО,","")+"
		|	ЖурналПроводокЕПСБУОстатки.КЭК";
	
	Запрос.УстановитьПараметр("ТаблицаРС",КартаРС);
	МассивВсехСчетов = КартаРС.ВыгрузитьКолонку("Счет");
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("МассивСчетов", МассивВсехСчетов);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуПоДаннымИсправленияОшибокОбщая(ТаблицаДанных, КартаРС, СтруктураПолей, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовОшибок)
	//СтруктураПолей - Структура строковых имен полей, по которым надо развернуть таблицу  (ИФО,Субконто1,Субконто2,Субконто3,КПС,КЭК(?))
	
	//запрос надо изменять в зависимости от того, какие поля в Массиве полей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРС.Счет КАК Счет,
		|	ТаблицаРС.Субконто1 КАК Субконто1,
		|	ТаблицаРС.Субконто2 КАК Субконто2,
		|	ТаблицаРС.Субконто3 КАК Субконто3
		|ПОМЕСТИТЬ НастройкаРС
		|ИЗ
		|	&ТаблицаРС КАК ТаблицаРС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЖурналПроводокЕПСБУОбороты.Счет КАК Счет,
		|	ЖурналПроводокЕПСБУОбороты.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУОбороты.КФО КАК КФО,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто1
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Субконто1, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто1,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто2
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Субконто2, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто2,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто3
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Субконто3, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто3,
		|	ЖурналПроводокЕПСБУОбороты.КПС КАК КПС,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОбороты.ИФО КАК ИФО,","")+"
		|	ЖурналПроводокЕПСБУОбороты.КЭК КАК КЭК,
		|	СУММА(ЖурналПроводокЕПСБУОбороты.СуммаОборот) КАК СуммаИООборот
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(&НачалоПериода, &КонецПериода, Авто, Счет В (&МассивСчетов), , %Условие%, КорСчет В (&МассивСчетовОшибок), ) КАК ЖурналПроводокЕПСБУОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкаРС КАК НастройкаРС
		|		ПО ЖурналПроводокЕПСБУОбороты.Счет = НастройкаРС.Счет
		|
		|СГРУППИРОВАТЬ ПО
		|	ЖурналПроводокЕПСБУОбороты.Счет,
		|	ЖурналПроводокЕПСБУОбороты.Организация,
		|	ЖурналПроводокЕПСБУОбороты.КФО,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто1
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Субконто1, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто2
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Субконто2, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто3
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Субконто3, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ЖурналПроводокЕПСБУОбороты.КПС,"+?(СтруктураПолей.ИФО,"
		|	ЖурналПроводокЕПСБУОбороты.ИФО,","")+"
		|	ЖурналПроводокЕПСБУОбороты.КЭК";
	
	Запрос.УстановитьПараметр("ТаблицаРС",КартаРС);
	МассивВсехСчетов = КартаРС.ВыгрузитьКолонку("Счет");
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("МассивСчетов", МассивВсехСчетов);
	Запрос.УстановитьПараметр("МассивСчетовОшибок", МассивСчетовОшибок);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуПоДаннымОборотовДенежныхИНеденежныхОбщая(ТаблицаДанных, КартаРС, СтруктураПолей, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода)
	//МассивПолей - массив строковых имен полей, по которым надо развернуть таблицу  (ИФО,Субконто1,Субконто2,Субконто3,КПС,КЭК(?))
	
	//запрос надо изменять в зависимости от того, какие поля в Массиве полей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРС.Счет КАК Счет,
		|	ТаблицаРС.Субконто1 КАК Субконто1,
		|	ТаблицаРС.Субконто2 КАК Субконто2,
		|	ТаблицаРС.Субконто3 КАК Субконто3
		|ПОМЕСТИТЬ НастройкаРС
		|ИЗ
		|	&ТаблицаРС КАК ТаблицаРС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Обороты.Счет КАК Счет,
		|	Обороты.Организация КАК Организация,
		|	Обороты.КФО КАК КФО,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто1
		|			ТОГДА ЕСТЬNULL(Обороты.Субконто1, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто1,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто2
		|			ТОГДА ЕСТЬNULL(Обороты.Субконто2, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто2,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто3
		|			ТОГДА ЕСТЬNULL(Обороты.Субконто3, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Субконто3,
		|	Обороты.КПС КАК КПС,"+?(СтруктураПолей.ИФО,"
		|	Обороты.ИФО КАК ИФО,","")+"
		|	Обороты.КЭК КАК КЭК,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КорСчет В (&МассивДенежныхСчетов)
		|				ТОГДА Обороты.СуммаОборотДт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДенДт,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КорСчет В (&МассивДенежныхСчетов)
		|				ТОГДА Обороты.СуммаОборотКт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДенКт,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Обороты.КорСчет В (&МассивДенежныхСчетов)
		|				ТОГДА Обороты.СуммаОборотДт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеДенДт,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ Обороты.КорСчет В (&МассивДенежныхСчетов)
		|				ТОГДА Обороты.СуммаОборотКт
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеДенКт
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(&НачалоПериода, &КонецПериода, Авто, Счет В (&МассивСчетов), , %Условие%, НЕ КорСчет В (&МассивИсключаемыхКорСчетов), ) КАК Обороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкаРС КАК НастройкаРС
		|		ПО Обороты.Счет = НастройкаРС.Счет
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.Счет,
		|	Обороты.КФО,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто1
		|			ТОГДА ЕСТЬNULL(Обороты.Субконто1, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто2
		|			ТОГДА ЕСТЬNULL(Обороты.Субконто2, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НастройкаРС.Субконто3
		|			ТОГДА ЕСТЬNULL(Обороты.Субконто3, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	Обороты.КПС,"+?(СтруктураПолей.ИФО,"
		|	Обороты.ИФО,","")+"
		|	Обороты.КЭК,
		|	Обороты.Организация";
	
	Запрос.УстановитьПараметр("ТаблицаРС",КартаРС);
	МассивВсехСчетов = КартаРС.ВыгрузитьКолонку("Счет");
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("МассивСчетов", МассивВсехСчетов);
	Запрос.УстановитьПараметр("МассивИсключаемыхКорСчетов", МассивИсключаемыхКорСчетов);
	Запрос.УстановитьПараметр("МассивДенежныхСчетов", МассивДенежныхСчетов);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%Условие%",Условие);
	
	Для Каждого КлючИЗначение Из СтруктураПолейОтбора Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
КонецПроцедуры

Процедура ДополнитьТаблицуПоРазворотуСубконтоИОборотам(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовОшибок, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов)
	
	МассивСтрок = КартаРС.НайтиСтроки(СтруктураОтбора);
			
	МассивСчетов = Новый Массив;
	Если МассивСтрок.Количество() >0 Тогда
		Для Каждого ТекСтр Из МассивСтрок Цикл
			МассивСчетов.Добавить(ТекСтр.Счет);
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
			СтруктураПолей.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);
		КонецЦикла;
	
		ДополнитьТаблицуПоДаннымОстатковИОборотов(ТаблицаДанных, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода);
		ДополнитьТаблицуПоДаннымИсправленияОшибок(ТаблицаДанных, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовОшибок);
		ДополнитьТаблицуПоДаннымОборотовДенежныхИНеденежных(ТаблицаДанных, СтруктураПолей, МассивСчетов, МассивИсключаемыхКорСчетов, МассивДенежныхСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода);
	КонецЕсли;
	
КонецПроцедуры

//для 169/769 с 2022 года - не используется, т.к. в инструкцию изменения НЕ внесли
Функция ПолучитьВНД_РазвернутыеОстаткиИОборотыКЭКСегм(СтруктураПараметров,ПравилоЗаполнения,ИмяНабора,ПараметрыСхемы) Экспорт
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
		
	СтруктураПараметров.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.Свойство("Организация", Организация);
	СтруктураПараметров.Свойство("ИФО", ИФО);
	СтруктураПараметров.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Если ТипЗнч(КонецПериода) = Тип("Дата") Тогда
		КонецПериода = Новый Граница(КонецПериода,ВидГраницы.Включая);
	КонецЕсли;
		
	ТаблицаМетодовДополнительнойОбработки = Справочники.ПравилаЗаполнения.ПолучитьТаблицуМетодов(ПравилоЗаполнения,,,Истина);
	КартыДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	ОбработкаЗаполнения = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(КартыДанных, "КартыДанных", ТаблицаМетодовДополнительнойОбработки, ПравилоЗаполнения, Неопределено, "") Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;	
	
	ИмяКарты = "";
	ПараметрыМетода = Неопределено;
	Для каждого СтрокаТаблицы Из ТаблицаМетодовДополнительнойОбработки Цикл
		
		Если СтрокаТаблицы.МетодОбработки <> "РазвернутоеСальдо" Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыМетода = СтрокаТаблицы.Параметры.Получить();//Структура
		ИмяКарты = ПараметрыМетода.КартаДанных;
		Прервать;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ИмяКарты) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	//В КартаРС необходимо переименовать колонки, которые используются как параметры в методе дополнения - Счет,Субконто1,Субконто2,Субконто3,
	//если их имя не совпадает с именем параметра
	
	//Если одноименные колонки уже есть, сначала удалим их, а потом переименуем нужные.
	КартаРС = КартыДанных[ИмяКарты];
	Если ПараметрыМетода.Счет <> "Счет" Тогда
		Если КартаРС.Колонки.Найти("Счет") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Счет");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Счет);
		ТекКолонка.Имя = "Счет";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто1 <> "Субконто1" Тогда
		Если КартаРС.Колонки.Найти("Субконто1") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто1");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто1);
		ТекКолонка.Имя = "Субконто1";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто2 <> "Субконто2" Тогда
		Если КартаРС.Колонки.Найти("Субконто2") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто2");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто2);
		ТекКолонка.Имя = "Субконто2";
	КонецЕсли;
	
	Если ПараметрыМетода.Субконто3 <> "Субконто3" Тогда
		Если КартаРС.Колонки.Найти("Субконто3") <> Неопределено Тогда
			КартаРС.Колонки.Удалить("Субконто3");
		КонецЕсли;
		ТекКолонка = КартаРС.Колонки.Найти(ПараметрыМетода.Субконто3);
		ТекКолонка.Имя = "Субконто3";
	КонецЕсли;
	
	ПараметрыИзДокумента = Ложь;
	Значение = Неопределено;
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") 
		И СтруктураПараметров.Свойство("ПараметрыИзДокумента",Значение)
			И ТипЗнч(Значение) = Тип("Булево") Тогда
		ПараметрыИзДокумента = Значение;
	КонецЕсли;
	
	СоответствиеСчетаБезКЭК = Новый Соответствие;
	
	УчитыватьКартуКЭК000 = Истина;//общая настройка правила заполнения на использование карты данных СчетаБезКЭК
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("УчитыватьКартуКЭК000") Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Структура") Тогда
			
			Если ДополнительныеПараметры.УчитыватьКартуКЭК000.Свойство("ПравоеЗначение")
				И ДополнительныеПараметры.УчитыватьКартуКЭК000.ПравоеЗначение = Ложь Тогда
				
				УчитыватьКартуКЭК000 = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДополнительныеПараметры.УчитыватьКартуКЭК000) = Тип("Булево") Тогда
			
			УчитыватьКартуКЭК000 = ДополнительныеПараметры.УчитыватьКартуКЭК000;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КартаСчетовБезКЭК = Неопределено;
	Если УчитыватьКартуКЭК000 = Истина
		И КартыДанных.Свойство("СчетаБезКЭК",КартаСчетовБезКЭК) Тогда
		Если КартаСчетовБезКЭК.Колонки.Найти("Счет") <> Неопределено
			И КартаСчетовБезКЭК.Колонки.Найти("Использовать")<> Неопределено Тогда
			
			Для Каждого СтрКарты Из КартаСчетовБезКЭК.НайтиСтроки(Новый Структура("Использовать",Истина)) Цикл
				СоответствиеСчетаБезКЭК.Вставить(СтрКарты.Счет,Истина);	
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	ТипЧисло = БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(18,2);
	ТипДата = БюджетнаяОтчетность.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Счет",Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДанных.Колонки.Добавить("Субконто1");
	ТаблицаДанных.Колонки.Добавить("Субконто2");
	ТаблицаДанных.Колонки.Добавить("Субконто3");
	ТаблицаДанных.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("КПС",Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДанных.Колонки.Добавить("ВидПоказателя",Новый ОписаниеТипов("ПеречислениеСсылка.ВидыКБК"));
	ТаблицаДанных.Колонки.Добавить("ИФО",Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДанных.Колонки.Добавить("КФО",Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДанных.Колонки.Добавить("КЭК",Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
		
	//Для 169/769 нужны:
	//- суммы развернутого начального и конечного остатка дт и кт:
	ТаблицаДанных.Колонки.Добавить("НачальныйОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("НачальныйОстатокКт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КонечныйОстатокДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("КонечныйОстатокКт",ТипЧисло);
	//- суммы оборотов со счетами расчетов по сегментам по дт и кт:
	ТаблицаДанных.Колонки.Добавить("СегмДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("СегмКт",ТипЧисло);
	//- суммы оборотов с остальными счетамм по дт и кт:
	ТаблицаДанных.Колонки.Добавить("ПрочДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("ПрочКт",ТипЧисло);
	//- сумма оборотов исправления ошибок прошлых лет:
	ТаблицаДанных.Колонки.Добавить("СуммаИООборот",ТипЧисло);
			
	СтруктураПолейОтбора = Новый Структура;
	
	Условие = "";
	УсловиеБаланс = "";
	ЕстьИФО = Ложь;
	
	Если ТипЗнч(ИФО) = Тип("Структура") Тогда
		Если ИФО.Свойство("Использование") 
			И ИФО.Использование = Истина Тогда
			ЕстьИФО = Истина;
			
			Если ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеБаланс = " И ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеБаланс = " И НЕ ИФО В (&ИФО)";
				СтруктураПолейОтбора.Вставить("ИФО",ИФО.ПравоеЗначение);
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеБаланс = " И ИФО <> &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			ИначеЕсли ИФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеБаланс = " И ИФО = &ИФО";
				СтруктураПолейОтбора.Вставить("ИФО",Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ИФО <> Неопределено Тогда
		ЕстьИФО = Истина;
		Если ТипЗнч(ИФО) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения") Тогда
			УсловиеБаланс = " И ИФО = &ИФО";
			СтруктураПолейОтбора.Вставить("ИФО",ИФО);
		КонецЕсли;
	КонецЕсли;
	
	УсловиеОрганизация = "";
	
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		Если Организация.Свойство("Использование") 
			И Организация.Использование = Истина Тогда
			
			Если Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				УсловиеОрганизация = " И НЕ Организация В (&Организация)";
				СтруктураПолейОтбора.Вставить("Организация",Организация.ПравоеЗначение);
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				УсловиеОрганизация = " И Организация <> &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			ИначеЕсли Организация.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				УсловиеОрганизация = " И Организация = &Организация";
				СтруктураПолейОтбора.Вставить("Организация",Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
						
		КонецЕсли;
	ИначеЕсли ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		УсловиеОрганизация = " И Организация = &Организация";
		СтруктураПолейОтбора.Вставить("Организация",Организация);
	КонецЕсли;
	
	УсловиеКФО = "";
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("КФО") Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.КФО) = Тип("Структура") Тогда
		
			мКФО = ДополнительныеПараметры.КФО;
			Если мКФО.Свойство("Использование") 
				И мКФО.Использование = Истина Тогда
				
				Если мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
					ИЛИ мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
					УсловиеКФО = " И КФО = &КФО";
					СтруктураПолейОтбора.Вставить("КФО",мКФО.ПравоеЗначение);
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
					ИЛИ мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
					УсловиеКФО = " И КФО <> &КФО";
					СтруктураПолейОтбора.Вставить("КФО",мКФО.ПравоеЗначение);
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
					ИЛИ мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
					УсловиеКФО = " И КФО В (&КФО)";
					СтруктураПолейОтбора.Вставить("КФО",мКФО.ПравоеЗначение);
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
					ИЛИ мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
					УсловиеКФО = " И НЕ КФО В (&КФО)";
					СтруктураПолейОтбора.Вставить("КФО",мКФО.ПравоеЗначение);
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
					УсловиеКФО = " И КФО <> &КФО";
					СтруктураПолейОтбора.Вставить("КФО",Перечисления.КВД.ПустаяСсылка());
				ИначеЕсли мКФО.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
					УсловиеКФО = " И КФО = &КФО";
					СтруктураПолейОтбора.Вставить("КФО",Перечисления.КВД.ПустаяСсылка());
				КонецЕсли;
							
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДополнительныеПараметры.КФО) = Тип("ПеречислениеСсылка.КВД") Тогда
			УсловиеКФО = " И КФО = &КФО";
			СтруктураПолейОтбора.Вставить("КФО",ДополнительныеПараметры.КФО);
		КонецЕсли;
	КонецЕсли;
	
	
	Условие = УсловиеБаланс + УсловиеОрганизация + УсловиеКФО;
	Условие = Сред(Условие,3);		
		
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ИФО",ЕстьИФО);// - необходимо определять нужность ИФО в зависимости от параметров
	СтруктураПолей.Вставить("КПС",Истина);//нужен всегда
	СтруктураПолей.Вставить("ВидКПС",Ложь);//заполняется отдельно, так быстрее
	СтруктураПолей.Вставить("Субконто1",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто2",Истина);//-меняется динамически
	СтруктураПолей.Вставить("Субконто3",Истина);//-меняется динамически
	СтруктураПолей.Вставить("КЭК",Истина);// - нужен всегда с 2021 года
	
	//Счета исправления ошибок
			
	ПараметрСчетаРасчетовССегментами = ПараметрыСхемы.Найти("СчетаРасчетовССегментами_"+ИмяНабора);
	Если ПараметрСчетаРасчетовССегментами <> Неопределено Тогда
		МассивСчетовСегменты = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаРасчетовССегментами.Значение);
	Иначе	
		МассивСчетовСегменты = БухгалтерскийУчет.СписокСчетов("109.00, 401.10, 401.20, 401.40, 401.41, 401.49");
	КонецЕсли;
	
	ПараметрСчетаИО = ПараметрыСхемы.Найти("СчетаИсправленияОшибок_"+ИмяНабора);
	Если ПараметрСчетаИО <> Неопределено Тогда
		МассивСчетовИО = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаИО.Значение);
	Иначе	
		МассивСчетовИО = БухгалтерскийУчет.СписокСчетов("304.66, 304.76, 304.86, 304.96, 
														|401.16, 401.17, 401.18, 401.19, 
														|401.26, 401.27, 401.28, 401.29");
	КонецЕсли;
	
	ПараметрСчетаИсключаемые = ПараметрыСхемы.Найти("СчетаИсключаемые_"+ИмяНабора);
	Если ПараметрСчетаИсключаемые <> Неопределено Тогда
		МассивИсключаемыхКорСчетов = БухгалтерскийУчет.СписокСчетов(ПараметрСчетаИсключаемые.Значение);
	Иначе	
		МассивИсключаемыхКорСчетов = БухгалтерскийУчет.СписокСчетов("304.66, 304.76, 304.86, 304.96, 
																	|401.16, 401.17, 401.18, 401.19, 
																	|401.26, 401.27, 401.28, 401.29, 
																	|401.30, 000");
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Ложь,Ложь);//0
	ДополнитьТаблицуПоРазворотуСубконтоИОборотамСегменты(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивСчетовСегменты);	

	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Ложь,Ложь);//1
	ДополнитьТаблицуПоРазворотуСубконтоИОборотамСегменты(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивСчетовСегменты);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Истина,Ложь);//2
	ДополнитьТаблицуПоРазворотуСубконтоИОборотамСегменты(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивСчетовСегменты);	

	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Ложь,Истина);//3
	ДополнитьТаблицуПоРазворотуСубконтоИОборотамСегменты(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивСчетовСегменты);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Истина,Ложь);//1,2
	ДополнитьТаблицуПоРазворотуСубконтоИОборотамСегменты(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивСчетовСегменты);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Ложь,Истина);//1,3
	ДополнитьТаблицуПоРазворотуСубконтоИОборотамСегменты(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивСчетовСегменты);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Ложь,Истина,Истина);//2,3
	ДополнитьТаблицуПоРазворотуСубконтоИОборотамСегменты(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивСчетовСегменты);	
	
	СтруктураОтбора = Новый Структура("Субконто1,Субконто2,Субконто3",Истина,Истина,Истина);//1,2,3
	ДополнитьТаблицуПоРазворотуСубконтоИОборотамСегменты(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовИО, МассивИсключаемыхКорСчетов, МассивСчетовСегменты);	
	
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ВидПоказателя,ИФО,КФО,КЭК",
						"НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИООборот,СегмДт,СегмКт,ПрочДт,ПрочКт");
	
	//КЭК оборотов не используются, все КЭК должны быть преобразованы в 000-009
	
	ЗаполнитьДетальныйКЭКВТаблицеДанных(ТаблицаДанных,СоответствиеСчетаБезКЭК);
	
	ТаблицаДанных.Свернуть("Счет,Субконто1,Субконто2,Субконто3,Организация,КПС,ВидПоказателя,ИФО,КФО,КЭК",
						"НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИООборот,СегмДт,СегмКт,ПрочДт,ПрочКт");
	
	//Т.к. в начале года остатки на 000-009, в середине года обороты по 56х/66х и 73х/83х, то после замены кэк нужно исправить конечные остатки
	//иначе получится, что если до замены было: 
	//по 001 остаток на начало по дт 100,
	//по 561/661 оборот в кт 150
	//и на конец года будет по 001 остаток по дт 100, а по 561/661 остаток по кт 150.
	//А должно быть по 001 остаток на конец по кт 50, и все.
	
	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
		//т.к. форма может заполняться не с начала года, то остатки на начало отчетного периода могут быть на разных КЭК - 561/661,
		//необходимо их объединить
		Если СтрТЧ.НачальныйОстатокДт <> 0
			ИЛИ СтрТЧ.НачальныйОстатокКт <> 0 Тогда
			
			Если СтрТЧ.НачальныйОстатокДт >= СтрТЧ.НачальныйОстатокКт Тогда
				СтрТЧ.НачальныйОстатокДт = СтрТЧ.НачальныйОстатокДт - СтрТЧ.НачальныйОстатокКт;
				СтрТЧ.НачальныйОстатокКт = 0;
			Иначе
				СтрТЧ.НачальныйОстатокКт = СтрТЧ.НачальныйОстатокКт - СтрТЧ.НачальныйОстатокДт;
				СтрТЧ.НачальныйОстатокДт = 0;
			КонецЕсли;
			
		КонецЕсли;
	
		
		Если СтрТЧ.КонечныйОстатокДт <> 0
			ИЛИ СтрТЧ.КонечныйОстатокКт <> 0 Тогда
				
			Если СтрТЧ.КонечныйОстатокДт >= СтрТЧ.КонечныйОстатокКт Тогда
				СтрТЧ.КонечныйОстатокДт = СтрТЧ.КонечныйОстатокДт - СтрТЧ.КонечныйОстатокКт;
				СтрТЧ.КонечныйОстатокКт = 0;
			Иначе
				СтрТЧ.КонечныйОстатокКт = СтрТЧ.КонечныйОстатокКт - СтрТЧ.КонечныйОстатокДт;
				СтрТЧ.КонечныйОстатокДт = 0;
			КонецЕсли;
		
		КонецЕсли;
	КонецЦикла;	
	
	//Далее необходимо распределить СуммаИООборот отдельно на исправление дебиторской задолженности и отдельно на исправление кредиторской задолженности,
	//И только после этого свернуть таблицу по субконто, чтобы получить обобщенные остатки
	
	ТаблицаДанных.Колонки.Добавить("СуммаИОДт",ТипЧисло);
	ТаблицаДанных.Колонки.Добавить("СуммаИОКт",ТипЧисло);
	
	//Если вид счета Пассивный - то положительной суммой правим Кт сумму,
			
	Для Каждого СтрТЧ Из ТаблицаДанных Цикл
		Если СтрТЧ.СуммаИООборот=0 Тогда
			Продолжить;
		КонецЕсли;
		//Если сумма исправления >0 и есть КТ задолженность, нужно сначала уменьшить остаток по Кт,
		//а на оставшуюся сумму увеличить дт
		Если СтрТЧ.СуммаИООборот>0
			И СтрТЧ.НачальныйОстатокКт>0 Тогда
			
			СтрТЧ.СуммаИОКт = - Мин(СтрТЧ.СуммаИООборот,СтрТЧ.НачальныйОстатокКт); //уменьшаем остаток, знак минус
			СтрТЧ.СуммаИОДт = СтрТЧ.СуммаИООборот + СтрТЧ.СуммаИОКт;//складываем, т.к. СуммаИОКт - отрицательная
			
		//Если сумма исправления <0 и есть ДТ задолженность, нужно сначала уменьшить остаток по ДТ,
		//а на оставшуюся сумму увеличить КТ	
		ИначеЕсли СтрТЧ.СуммаИООборот<0
			И СтрТЧ.НачальныйОстатокДт>0 Тогда
			
			СуммаИООборотПоложительная = -1*СтрТЧ.СуммаИООборот;
			
			СтрТЧ.СуммаИОДт = - Мин(СуммаИООборотПоложительная,СтрТЧ.НачальныйОстатокДт); //уменьшаем остаток, знак минус
			СтрТЧ.СуммаИОКт = СуммаИООборотПоложительная + СтрТЧ.СуммаИОДт;//складываем, т.к. СуммаИОДт - отрицательная
			
		//НЕТ КТ задолженности и сумма исправления >0, тогда вся сумма исправления это увеличение ДТ	
		ИначеЕсли СтрТЧ.СуммаИООборот>0 Тогда

		    СтрТЧ.СуммаИОДт = СтрТЧ.СуммаИООборот;
			СтрТЧ.СуммаИОКт = 0;
			
		//НЕТ ДТ задолженности и сумма исправления <0, тогда вся сумма исправления это увеличение КТ	
		ИначеЕсли СтрТЧ.СуммаИООборот<0 Тогда
			
			СтрТЧ.СуммаИОДт = 0;
			СтрТЧ.СуммаИОКт = -СтрТЧ.СуммаИООборот;
			
		КонецЕсли;
	КонецЦикла;
	
	//После того как распределили задолженность, можно свернуть таблицу детальных данных	
	//По организации и ИФО сворачивать нельзя никогда, 
	//т.к. в правилах заполнения на набор дополнительно накладываются по ним отбор

	ТаблицаДанных.Свернуть("Счет,Организация,ИФО,КФО,КПС,ВидПоказателя,КЭК",
					"НачальныйОстатокДт,НачальныйОстатокКт,КонечныйОстатокДт,КонечныйОстатокКт,СуммаИОДт,СуммаИОКт,СегмДт,СегмКт,ПрочДт,ПрочКт");
	
	КартаРС = Неопределено;
	
	Если ТаблицаДанных.Количество()>0 Тогда
		//Заполнение вида показателя
		ТабКПС = ТаблицаДанных.Скопировать(,"КПС");
		ТабКПС.Свернуть("КПС");
		
		ЗначенияКПС = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТабКПС.ВыгрузитьКолонку("КПС"),"ВидПоказателя");
		
		Для Каждого СтрТЧ Из ТаблицаДанных Цикл
			СтрТЧ.ВидПоказателя = ЗначенияКПС[СтрТЧ.КПС];
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Процедура ДополнитьТаблицуПоРазворотуСубконтоИОборотамСегменты(ТаблицаДанных, КартаРС, СтруктураПолей,СтруктураОтбора,СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовОшибок, МассивИсключаемыхКорСчетов, МассивСчетовСегменты)
	
	МассивСтрок = КартаРС.НайтиСтроки(СтруктураОтбора);
			
	МассивСчетов = Новый Массив;
	Если МассивСтрок.Количество() >0 Тогда
		Для Каждого ТекСтр Из МассивСтрок Цикл
			МассивСчетов.Добавить(ТекСтр.Счет);
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
			СтруктураПолей.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);
		КонецЦикла;
	
		ДополнитьТаблицуПоДаннымОстатковИОборотов(ТаблицаДанных, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода);
		ДополнитьТаблицуПоДаннымИсправленияОшибок(ТаблицаДанных, СтруктураПолей, МассивСчетов, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода, МассивСчетовОшибок);
		ДополнитьТаблицуПоДаннымОборотовСегменты(ТаблицаДанных, СтруктураПолей, МассивСчетов, МассивИсключаемыхКорСчетов, МассивСчетовСегменты, СтруктураПолейОтбора, Условие, НачалоПериода, КонецПериода);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Копирует настройки компоновки данных из одного компоновщика настроек в другой
Процедура СкопироватьНастройкиКомпоновкиДанных(НастройкиПриемник, НастройкиИсточник) Экспорт
	
	Если НастройкиИсточник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НастройкиПриемник) = Тип("НастройкиКомпоновкиДанных") Тогда
		Для каждого Параметр Из НастройкиИсточник.ПараметрыДанных.Элементы Цикл
			ЗначениеПараметра = НастройкиПриемник.ПараметрыДанных.НайтиЗначениеПараметра(Параметр.Параметр);
			Если ЗначениеПараметра <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЗначениеПараметра, Параметр);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
		ЗаполнитьЗначенияСвойств(НастройкиПриемник, НастройкиИсточник);
		СкопироватьНастройкиКомпоновкиДанных(НастройкиПриемник.Настройки, НастройкиИсточник.Настройки);
		Возврат;
	КонецЕсли;
	
	// Копирование настроек
	Если ТипЗнч(НастройкиИсточник) = Тип("НастройкиКомпоновкиДанных") Тогда
		
		ЗаполнитьЭлементы(НастройкиПриемник.ПараметрыДанных, НастройкиИсточник.ПараметрыДанных);
		СкопироватьЭлементы(НастройкиПриемник.ПользовательскиеПоля, НастройкиИсточник.ПользовательскиеПоля);
		СкопироватьЭлементы(НастройкиПриемник.Отбор,         НастройкиИсточник.Отбор);
		СкопироватьЭлементы(НастройкиПриемник.Порядок,       НастройкиИсточник.Порядок);
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаКомпоновкиДанных")
		ИЛИ ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаТаблицыКомпоновкиДанных")
		ИЛИ ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
		
		СкопироватьЭлементы(НастройкиПриемник.ПоляГруппировки, НастройкиИсточник.ПоляГруппировки);
		СкопироватьЭлементы(НастройкиПриемник.Отбор,           НастройкиИсточник.Отбор);
		СкопироватьЭлементы(НастройкиПриемник.Порядок,         НастройкиИсточник.Порядок);
		ЗаполнитьЗначенияСвойств(НастройкиПриемник, НастройкиИсточник);
		
	КонецЕсли;
	
	СкопироватьЭлементы(НастройкиПриемник.Выбор,              НастройкиИсточник.Выбор);
	СкопироватьЭлементы(НастройкиПриемник.УсловноеОформление, НастройкиИсточник.УсловноеОформление);
	ЗаполнитьЭлементы(НастройкиПриемник.ПараметрыВывода,      НастройкиИсточник.ПараметрыВывода);
	
	// Копирование структуры
	Если ТипЗнч(НастройкиИсточник) = Тип("НастройкиКомпоновкиДанных")
		ИЛИ ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаКомпоновкиДанных") Тогда
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Структура Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Структура.Добавить(ТипЗнч(ЭлементСтруктурыИсточник));
			СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаТаблицыКомпоновкиДанных")
		ИЛИ ТипЗнч(НастройкиИсточник) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Структура Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Структура.Добавить(ТипЗнч(ЭлементСтруктурыИсточник));
			СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("ТаблицаКомпоновкиДанных") Тогда
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Строки Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Строки.Добавить();
			СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Колонки Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Колонки.Добавить();
			СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗнч(НастройкиИсточник) = Тип("ДиаграммаКомпоновкиДанных") Тогда
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Серии Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Серии.Добавить();
			СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
		Для каждого ЭлементСтруктурыИсточник Из НастройкиИсточник.Точки Цикл
			ЭлементСтруктурыПриемник = НастройкиПриемник.Точки.Добавить();
			СкопироватьНастройкиКомпоновкиДанных(ЭлементСтруктурыПриемник, ЭлементСтруктурыИсточник);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Копирует элементы из одной коллекции в другую
//
Процедура СкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения, ПроверятьДоступность = Ложь, ОчищатьПриемник = Истина) Экспорт
	
	Если ТипЗнч(ИсточникЗначения) = Тип("УсловноеОформлениеКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ВариантыПользовательскогоПоляВыборКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ОформляемыеПоляКомпоновкиДанных") Тогда
		СоздаватьПоТипу = Ложь;
	Иначе
		СоздаватьПоТипу = Истина;
	КонецЕсли;
	ПриемникЭлементов = ПриемникЗначения.Элементы;
	ИсточникЭлементов = ИсточникЗначения.Элементы;
	Если ОчищатьПриемник Тогда
		ПриемникЭлементов.Очистить();
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из ИсточникЭлементов Цикл
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
			// Элементы порядка добавляем в начало
			Индекс = ИсточникЭлементов.Индекс(ЭлементИсточник);
			ЭлементПриемник = ПриемникЭлементов.Вставить(Индекс, ТипЗнч(ЭлементИсточник));
		Иначе
			Если СоздаватьПоТипу Тогда
				ЭлементПриемник = ПриемникЭлементов.Добавить(ТипЗнч(ЭлементИсточник));
			Иначе
				ЭлементПриемник = ПриемникЭлементов.Добавить();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		// В некоторых коллекциях необходимо заполнить другие коллекции
		Если ТипЗнч(ИсточникЭлементов) = Тип("КоллекцияЭлементовУсловногоОформленияКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Поля, ЭлементИсточник.Поля);
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
			ЗаполнитьЭлементы(ЭлементПриемник.Оформление, ЭлементИсточник.Оформление); 
		ИначеЕсли ТипЗнч(ИсточникЭлементов)	= Тип("КоллекцияВариантовПользовательскогоПоляВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
		КонецЕсли;
		
		// В некоторых элементах коллекции необходимо заполнить другие коллекции
		Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Варианты, ЭлементИсточник.Варианты);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
			ЭлементПриемник.УстановитьВыражениеДетальныхЗаписей (ЭлементИсточник.ПолучитьВыражениеДетальныхЗаписей());
			ЭлементПриемник.УстановитьВыражениеИтоговыхЗаписей(ЭлементИсточник.ПолучитьВыражениеИтоговыхЗаписей());
			ЭлементПриемник.УстановитьПредставлениеВыраженияДетальныхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияДетальныхЗаписей ());
			ЭлементПриемник.УстановитьПредставлениеВыраженияИтоговыхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияИтоговыхЗаписей ());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Выполняет сериализацию компоновщика настроек для сохранения в схеме заполнения
//
// Параметры:
//  КомпоновщикНастроек - Компоновщик настроек для сериализации
//  УникальныйИдентификаторВладельца - уникальный идентификатор формы
//
// Возвращаемое значение:
//  Адрес во временном хранилище - текст сериализованного компоновщика
//
Функция СохранитьКомпоновщикНастроек(КомпоновщикНастроек, УникальныйИдентификаторВладельца) Экспорт
	
	СериализованноеЗначение = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, КомпоновщикНастроек);
	
	СериализованноеЗначение = ЗаписьXML.Закрыть();
	
	Возврат ПоместитьВоВременноеХранилище(СериализованноеЗначение, УникальныйИдентификаторВладельца);
	
КонецФункции

// Выполняет сериализацию таблицы настроек расшифровки для сохранения в схеме заполнения
//
// Параметры:
//  ТаблицаНастроекФорма - Таблица значений с настройками
//
// Возвращаемое значение:
//  Строка, текст сериализованных настроек
//
Функция СохранитьТаблицуНастроекОткрытияТиповыхОтчетов(ТаблицаНастроекФорма) Экспорт
	
	ТаблицаНастроек = ТаблицаНастроекФорма.СкопироватьКолонки();
	ТаблицаНастроек.Колонки.Добавить("Настройки");
	
	Для каждого СтрокаТаблицы Из ТаблицаНастроекФорма Цикл
		
		Если НЕ ПустаяСтрока(СтрокаТаблицы.Идентификатор) И ЭтоАдресВременногоХранилища(СтрокаТаблицы.АдресНастройки) Тогда
			
			НоваяСтрока = ТаблицаНастроек.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			НоваяСтрока.Настройки = ПолучитьИзВременногоХранилища(СтрокаТаблицы.АдресНастройки)
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаНастроек.Колонки.Удалить("АдресНастройки");
	
	ДиспетчерСериализации = Обработки.СериализацияПравилаЗаполненияОтчетности.Создать();
	ТекстНастроек = ДиспетчерСериализации.СохранитьТаблицуНастроекДетализацииСтандартнымиОтчетами(ТаблицаНастроек);
	
	Возврат """" + СтрЗаменить(ТекстНастроек, """", """""") + """";
	
КонецФункции

// Выполняет замену параметров отбора из таблицы Вычисляемые счета области заполнения,
// на ссылки счетов, полученных по функции ЗаполнениеОтчетности.ПолучитьМассивСчетов.
//
// Параметры:
//  Схема - схема компоновки данных, в элементах отбора которой будет выполняться замена
//  ВычисляемыеПараметры - таблица значений с колонками ИмяПараметра, СписокСчетов, ПоИерархии
//
Процедура ПреобразоватьПоляОтбораВычисляемыхСчетов_СКД(Схема,ВычисляемыеПараметры) Экспорт
	
	СоответствиеВП = Новый Соответствие;
	Для Каждого СтрТЧ Из ВычисляемыеПараметры Цикл
		МассивСчетов = ЗаполнениеОтчетности.ПолучитьМассивСчетов(СтрТЧ.СписокСчетов,Неопределено,СтрТЧ.ПоИерархии = Ложь);
		СоответствиеВП.Вставить("ПараметрыДанных.ВПС_"+СтрТЧ.ИмяПараметра,МассивСчетов);			
	КонецЦикла;
			
	СоответствиеОтборов = Новый Соответствие;
	СоответствиеОтборов.Вставить(ВидСравненияКомпоновкиДанных.Равно,ВидСравненияКомпоновкиДанных.ВСписке);
	СоответствиеОтборов.Вставить(ВидСравненияКомпоновкиДанных.НеРавно,ВидСравненияКомпоновкиДанных.НеВСписке);
	СоответствиеОтборов.Вставить(ВидСравненияКомпоновкиДанных.ВИерархии,ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
	СоответствиеОтборов.Вставить(ВидСравненияКомпоновкиДанных.НеВИерархии,ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии);
			
	ПреобразоватьПолеОтбораВычисляемыхСчетов(Схема.ВариантыНастроек.Основной.Настройки.Отбор.Элементы,СоответствиеВП,СоответствиеОтборов);
	
КонецПроцедуры

Процедура ПреобразоватьПолеОтбораВычисляемыхСчетов(КоллекцияПолей, СоответствиеВП,СоответствиеОтборов)
	Для каждого ПолеОтбора Из КоллекцияПолей Цикл		
		Если ТипЗнч(ПолеОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда			
			ПреобразоватьПолеОтбораВычисляемыхСчетов(ПолеОтбора.Элементы, СоответствиеВП,СоответствиеОтборов);
		Иначе
			Если ТипЗнч(ПолеОтбора.ПравоеЗначение) = Тип("ПолеКомпоновкиДанных") Тогда
				МассивСчетов = СоответствиеВП[Строка(ПолеОтбора.ПравоеЗначение)];
				Если МассивСчетов <> Неопределено Тогда
					ПолеОтбора.ВидСравнения = СоответствиеОтборов[ПолеОтбора.ВидСравнения];
					ПолеОтбора.ПравоеЗначение = МассивСчетов;
				КонецЕсли;				
			КонецЕсли;			
		КонецЕсли;		
	КонецЦикла;	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ДобавитьПараметр(Схема, Настройки = Неопределено, Знач СтруктураПараметров, Знач ДобавлятьНовые = Ложь)
	
	Перем ИмяПараметра;
	Перем ЗначениеПараметра;
	
	ПараметрыСхемы = Схема.Параметры;
	
	Если Настройки = Неопределено Тогда
		
		Настройки = Схема.ВариантыНастроек.Основной.Настройки;
		
	КонецЕсли;
	
	СтруктураПараметров.Свойство("ИмяПараметра", ИмяПараметра);
	СтруктураПараметров.Свойство("ЗначениеПараметра", ЗначениеПараметра);
	
	Использование = Истина;
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Структура") Тогда
	
		Значение = Неопределено;
		Если ЗначениеПараметра.Свойство("Использование", Значение) И ТипЗнч(Значение) = Тип("Булево") Тогда
			Использование = Значение;
		КонецЕсли;
		
		ЛевоеЗначение = Неопределено;
		ПравоеЗначение = Неопределено;
		СписокЗначений = Неопределено;
		
		ЗначениеПараметра.Свойство("ЛевоеЗначение", ЛевоеЗначение);
		ЗначениеПараметра.Свойство("ПравоеЗначение", ПравоеЗначение);
		ЗначениеПараметра.Свойство("СписокЗначений", СписокЗначений);
		
		Если ТипЗнч(Строка(ЛевоеЗначение)) = Тип("Строка") И Не ПустаяСтрока(Строка(ЛевоеЗначение)) Тогда
			ИмяПараметра = Строка(ЛевоеЗначение);
		КонецЕсли;
		
		Если ТипЗнч(СписокЗначений) = Тип("СписокЗначений") Тогда
			ЗначениеПараметра = СписокЗначений;
		Иначе
			ЗначениеПараметра = ПравоеЗначение;
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполнение параметра схемы
	ПараметрСхемы = ПараметрыСхемы.Найти(ИмяПараметра);
	
	Если ПараметрСхемы = Неопределено Тогда
		
		Если ДобавлятьНовые Тогда
			
			ПараметрСхемы = ПараметрыСхемы.Добавить();
			ПараметрСхемы.Имя = ИмяПараметра;
			ПараметрСхемы.ОграничениеИспользования = Истина;
			ПараметрСхемы.ВключатьВДоступныеПоля = Истина;
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТипЗначенияПараметра = ТипЗнч(ЗначениеПараметра);
	
	Если ТипЗначенияПараметра = Тип("СписокЗначений") Тогда
		ПараметрСхемы.ДоступенСписокЗначений = Истина;
		ТипЗначения = ЗначениеПараметра.ТипЗначения;
	Иначе
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗначенияПараметра);
		ТипЗначения = Новый ОписаниеТипов(МассивТипов);
	КонецЕсли;
	
	ПараметрСхемы.Значение = ЗначениеПараметра;
	ПараметрСхемы.ТипЗначения = ТипЗначения;
	ПараметрСхемы.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	
	// Заполнение параметра настроек
	ПараметрКомпоновкиДанных = Новый ПараметрКомпоновкиДанных(ПараметрСхемы.Имя);
	
	ЗначениеПараметраНастроек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновкиДанных);
	Если ЗначениеПараметраНастроек = Неопределено Тогда
		
		ПараметрНастроек = Настройки.ПараметрыДанных.Элементы.Добавить();
		ПараметрНастроек.Параметр = ПараметрКомпоновкиДанных;
		ПараметрНастроек.Значение = ЗначениеПараметра;
		ПараметрНастроек.Использование = Истина;
		
	Иначе
		
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрКомпоновкиДанных, ЗначениеПараметра);
		
	КонецЕсли;
	
	// Проверка условий в отборах по правому значению
	ПроверкаУсловийОтбора(ПараметрСхемы, Использование, ТипЗначенияПараметра, Настройки.Отбор.Элементы);
	
КонецПроцедуры

Процедура ДобавитьПараметрыВСхему(СхемаКомпоновки, Знач ОбщиеПараметры)
	
	Для каждого СтрокаТаблицы Из ОбщиеПараметры Цикл
		
		ПараметрСхемы = СхемаКомпоновки.Параметры.Добавить();
		ПараметрСхемы.Имя = СтрокаТаблицы.ИмяПараметра;
		ПараметрСхемы.ОграничениеИспользования = Истина;
		ПараметрСхемы.ВключатьВДоступныеПоля = Истина;
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(СтрокаТаблицы.ЗначениеПараметра));
		ТипЗначения = Новый ОписаниеТипов(МассивТипов);
		
		ПараметрСхемы.Значение = СтрокаТаблицы.ЗначениеПараметра;
		ПараметрСхемы.ТипЗначения = ТипЗначения;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет одну коллекцию элементов на основании другой
//
Процедура ЗаполнитьЭлементы(ПриемникЗначения, ИсточникЗначения, ПервыйУровень = Неопределено)
	
	Если ТипЗнч(ПриемникЗначения) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		КоллекцияЗначений = ИсточникЗначения;
	Иначе
		КоллекцияЗначений = ИсточникЗначения.Элементы;
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из КоллекцияЗначений Цикл
		Если ПервыйУровень = Неопределено Тогда
			ЭлементПриемник = ПриемникЗначения.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		Иначе
			ЭлементПриемник = ПервыйУровень.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		КонецЕсли;
		Если ЭлементПриемник = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		Если ТипЗнч(ЭлементИсточник) = Тип("ЗначениеПараметраКомпоновкиДанных") Тогда
			Если ЭлементИсточник.ЗначенияВложенныхПараметров.Количество() <> 0 Тогда
				ЗаполнитьЭлементы(ЭлементПриемник.ЗначенияВложенныхПараметров, ЭлементИсточник.ЗначенияВложенныхПараметров, ПриемникЗначения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПрименитьАгрегатнуюФункцию(Знач ТекстВыражения, Знач АгрегатнаяФункция)
	
	Перем Результат;
	
	Если АгрегатнаяФункция = "Нет" Тогда
		Результат = ТекстВыражения;
	ИначеЕсли АгрегатнаяФункция = "Сумма" Тогда
		Результат = "Сумма("+ТекстВыражения+")";
	ИначеЕсли АгрегатнаяФункция = "Количество" Тогда
		Результат = "Количество("+ТекстВыражения+")";
	ИначеЕсли АгрегатнаяФункция = "Количество различных" Тогда
		Результат = "Количество(Различные "+ТекстВыражения+")";
	ИначеЕсли АгрегатнаяФункция = "Минимум" Тогда
		Результат = "Минимум("+ТекстВыражения+")";
	ИначеЕсли АгрегатнаяФункция = "Максимум" Тогда
		Результат = "Максимум("+ТекстВыражения+")";
	ИначеЕсли АгрегатнаяФункция = "Среднее" Тогда
		Результат = "Среднее("+ТекстВыражения+")";
	ИначеЕсли АгрегатнаяФункция = "СоединитьСтроки" Тогда
		Результат = "СоединитьСтроки("+ТекстВыражения+")";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверкаУсловийОтбора(ПараметрСхемы, Использование, ТипЗначенияПараметра, КоллекцияЭлементовОтбора)
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементовОтбора Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			ПроверкаУсловийОтбора(ПараметрСхемы, Использование, ТипЗначенияПараметра, ЭлементОтбора.Элементы);
			
		Иначе
			
			Если ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ПараметрыДанных."+ПараметрСхемы.Имя) Тогда
				
				ЭлементОтбора.Использование = Использование;
				
				Если ТипЗначенияПараметра = Тип("СписокЗначений") Тогда
					
					Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
					ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Служебные процедуры метода ОбъединитьНаборы

Процедура ДобавитьГруппуОтбораСКД(Знач ПолеОтбораШаблона, Знач КоллекцияПолейШаблона, КоллекцияПолейНабора, КоллекцияЭлементовОтбора, НаименованиеНабора)
	
	НоваяГруппаОтбора = КоллекцияЭлементовОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ЗаполнитьЗначенияСвойств(НоваяГруппаОтбора,ПолеОтбораШаблона);
	
	Для каждого ЭлементОтбора Из ПолеОтбораШаблона.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			ДобавитьГруппуОтбораСКД(ЭлементОтбора, КоллекцияПолейШаблона, КоллекцияПолейНабора, НоваяГруппаОтбора.Элементы, НаименованиеНабора);
			
		Иначе
			
			ДобавитьОтборСКД(ЭлементОтбора, КоллекцияПолейШаблона, КоллекцияПолейНабора, НоваяГруппаОтбора.Элементы, НаименованиеНабора);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОтборСКД(Знач ПолеОтбораШаблона, Знач КоллекцияПолейШаблона, КоллекцияПолейНабора, КоллекцияЭлементовОтбора, НаименованиеНабора)
	
	НовоеПолеОтбора = КоллекцияЭлементовОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЗаполнитьЗначенияСвойств(НовоеПолеОтбора,ПолеОтбораШаблона);
	НовоеПолеОтбора.ЛевоеЗначение = ДобавитьПолеОтбораСКД(Строка(ПолеОтбораШаблона.ЛевоеЗначение), КоллекцияПолейШаблона, КоллекцияПолейНабора, КоллекцияЭлементовОтбора, НаименованиеНабора);
	
	Если ТипЗнч(НовоеПолеОтбора.ПравоеЗначение) = Тип("ПолеКомпоновкиДанных") Тогда
		
		НовоеПолеОтбора.ПравоеЗначение = ДобавитьПолеОтбораСКД(Строка(ПолеОтбораШаблона.ПравоеЗначение), КоллекцияПолейШаблона, КоллекцияПолейНабора, КоллекцияЭлементовОтбора, НаименованиеНабора);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьПолеОтбораСКД(Знач ИмяПоля, Знач КоллекцияПолейШаблона, КоллекцияПолейНабора, КоллекцияЭлементовОтбора, НаименованиеНабора)
	
	// Если у поля шаблона есть заголовок, то это поле в объединении называется именем заголовка
	Поз = Найти(ИмяПоля, ".");
	Если Поз <> 0 Тогда
		ПолеШаблона = НайтиПолеНабораСКД(ИмяПоля, КоллекцияПолейШаблона);
		Если ПолеШаблона = Неопределено Тогда
			ИмяРодителя = Лев(ИмяПоля, Поз - 1);
			Если ИмяРодителя = "ПараметрыДанных" Тогда
				Возврат Новый ПолеКомпоновкиДанных(ИмяПоля);
			КонецЕсли;
			ПодчиненныеПоля = Сред(ИмяПоля, Поз);
			ПолеШаблона = КоллекцияПолейШаблона.Найти(ИмяРодителя);
			Если ПолеШаблона <> Неопределено И НЕ ПустаяСтрока(ПолеШаблона.Заголовок) Тогда
				ИмяРодителя = ПолеШаблона.Заголовок;
			КонецЕсли;
		Иначе
			ИмяРодителя = ПолеШаблона.Поле;
			ПодчиненныеПоля = "";
		КонецЕсли;
	Иначе
		ИмяРодителя = ИмяПоля;
		ПодчиненныеПоля = "";
		ПолеШаблона = КоллекцияПолейШаблона.Найти(ИмяРодителя);
		Если ПолеШаблона <> Неопределено И НЕ ПустаяСтрока(ПолеШаблона.Заголовок) Тогда
			ИмяРодителя = ПолеШаблона.Заголовок;
		КонецЕсли;
	КонецЕсли;
	
	Если ПолеШаблона <> Неопределено Тогда
		
		ТипЗначения = ПолеШаблона.ТипЗначения;
		
		Если НЕ ПустаяСтрока(ПолеШаблона.Заголовок) Тогда
			
			ИмяРодителя = ПолеШаблона.Заголовок;
			
		КонецЕсли;
		
		ПутьКДанным = СтрЗаменить("Условие" + НаименованиеНабора + ИмяРодителя, ".", "");
	Иначе
		ПутьКДанным = СтрЗаменить(ИмяРодителя, ".", "");
	КонецЕсли;
	
	НовоеПолеЭлементаНабора = КоллекцияПолейНабора.Найти(ПутьКДанным);
	Если НовоеПолеЭлементаНабора = Неопределено Тогда
		
		// Добавление поля вложенного набора
		НовоеПолеЭлементаНабора = КоллекцияПолейНабора.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПолеЭлементаНабора.Поле = ИмяРодителя;
		НовоеПолеЭлементаНабора.ПутьКДанным = ПутьКДанным;
		Если ТипЗначения <> Неопределено Тогда
			НовоеПолеЭлементаНабора.ТипЗначения = ТипЗначения;
		КонецЕсли;
		
		НовоеПолеЭлементаНабора.ОграничениеИспользования.Поле = Истина;
		НовоеПолеЭлементаНабора.ОграничениеИспользования.Группировка = Истина;
		НовоеПолеЭлементаНабора.ОграничениеИспользования.Порядок = Истина;
		
		НовоеПолеЭлементаНабора.ОграничениеИспользованияРеквизитов.Поле = Истина;
		НовоеПолеЭлементаНабора.ОграничениеИспользованияРеквизитов.Группировка = Истина;
		НовоеПолеЭлементаНабора.ОграничениеИспользованияРеквизитов.Порядок = Истина;
		
	КонецЕсли;
	
	Возврат Новый ПолеКомпоновкиДанных(ПутьКДанным + ПодчиненныеПоля);;
	
КонецФункции // ДобавитьПолеОтбораСКД()

Процедура ЗаполнитьНастрокиСхемы(Настройки, КоллекцияВыбранныхЭлементовШаблона, КоллекцияПараметровСхемыОбъединение, МассивВыбранныхПолей)
	
	// Заполнение в настройках выбранных полей
	Для каждого ПолеВыбора Из КоллекцияВыбранныхЭлементовШаблона Цикл
		
		Если МассивВыбранныхПолей.Найти(ПолеВыбора.Поле) = Неопределено Тогда
			
			НовоеПоле = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовоеПоле,ПолеВыбора);
			НовоеПоле.Использование = Истина;
			
			МассивВыбранныхПолей.Добавить(ПолеВыбора.Поле);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Создание параметров в настройках схемы
	Для каждого ПараметрСхемы Из КоллекцияПараметровСхемыОбъединение Цикл
		
		Если ЗначениеЗаполнено(ПараметрСхемы.Значение) ИЛИ Найти("НачалоПериода,КонецПериода", ПараметрСхемы.Имя) <> 0 Тогда
			
			ПараметрКомпоновкиДанных = Новый ПараметрКомпоновкиДанных(ПараметрСхемы.Имя);
			
			ЗначениеПараметраНастроек = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновкиДанных);
			Если ЗначениеПараметраНастроек = Неопределено Тогда
				
				ПараметрНастроек = Настройки.ПараметрыДанных.Элементы.Добавить();
				ПараметрНастроек.Параметр = ПараметрКомпоновкиДанных;
				ПараметрНастроек.Значение = ПараметрСхемы.Значение;
				ПараметрНастроек.Использование = Истина;
				
			Иначе
				
				Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрКомпоновкиДанных, ПараметрСхемы.Значение);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьПараметрыСхемы(ШаблонСхемы, СхемаКомпоновкиОбъединение, НаименованиеНабора)
	
	ПараметрыДанных = ШаблонСхемы.ВариантыНастроек.Основной.Настройки.ПараметрыДанных;
	Для каждого Параметр Из ШаблонСхемы.Параметры Цикл
		
		ПараметрСхемыКомпоновкиОбъединение = СхемаКомпоновкиОбъединение.Параметры.Найти(Параметр.Имя);
		
		Если ПараметрСхемыКомпоновкиОбъединение = Неопределено Тогда
			
			ПараметрКомпоновкиДанных = Новый ПараметрКомпоновкиДанных(Параметр.Имя);
			ЗначениеПараметра = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновкиДанных);
			
			ПараметрЭлементаНабора = СхемаКомпоновкиОбъединение.Параметры.Добавить();
			ЗаполнитьЗначенияСвойств(ПараметрЭлементаНабора, Параметр);
			
			Если ПараметрЭлементаНабора.Имя = "ПериодОтчета" Тогда
				
				ПараметрЭлементаНабора.Имя = "ПериодОтчета_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Заголовок = ПараметрЭлементаНабора.Имя;
				
				Если ЗначениеПараметра.Значение = "КонецПериода" Тогда

					ПараметрЭлементаНабора.Выражение = "ЗаполнениеОтчетности.ПреобразоватьКонецПериода(&"+ЗначениеПараметра.Значение+")";

				Иначе
					ПараметрЭлементаНабора.Выражение = "&"+ЗначениеПараметра.Значение;
				КонецЕсли;
				
				ПараметрЭлементаНабора.Значение = "";
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "ВидыСубконто" Тогда
				
				ПараметрЭлементаНабора.Имя = "ВидыСубконто_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Заголовок = ПараметрЭлементаНабора.Имя;
				ПараметрЭлементаНабора.ДоступенСписокЗначений = Истина;
				
				Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СписокЗначений") Тогда
					ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение.Скопировать();
				ИначеЕсли ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда
					ПараметрЭлементаНабора.Значение.Добавить(ЗначениеПараметра.Значение);
				КонецЕсли;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "ВидыКорСубконто" Тогда
				
				ПараметрЭлементаНабора.Имя = "ВидыКорСубконто_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Заголовок = ПараметрЭлементаНабора.Имя;
				ПараметрЭлементаНабора.ДоступенСписокЗначений = Истина;
				
				Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СписокЗначений") Тогда
					ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение.Скопировать();
				ИначеЕсли ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда
					ПараметрЭлементаНабора.Значение.Добавить(ЗначениеПараметра.Значение);
				КонецЕсли;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "ВидыСубконтоДт" Тогда
				
				ПараметрЭлементаНабора.Имя = "ВидыСубконтоДт_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Заголовок = ПараметрЭлементаНабора.Имя;
				ПараметрЭлементаНабора.ДоступенСписокЗначений = Истина;
				
				Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СписокЗначений") Тогда
					ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение.Скопировать();
				ИначеЕсли ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда
					ПараметрЭлементаНабора.Значение.Добавить(ЗначениеПараметра.Значение);
				КонецЕсли;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "ВидыСубконтоКт" Тогда
				
				ПараметрЭлементаНабора.Имя = "ВидыСубконтоКт_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Заголовок = ПараметрЭлементаНабора.Имя;
				ПараметрЭлементаНабора.ДоступенСписокЗначений = Истина;
				
				Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СписокЗначений") Тогда
					ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение.Скопировать();
				ИначеЕсли ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда
					ПараметрЭлементаНабора.Значение.Добавить(ЗначениеПараметра.Значение);
				КонецЕсли;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "КодВидаОтчета" Тогда
				
				ПараметрЭлементаНабора.Имя = "КодВидаОтчета_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Заголовок = ПараметрЭлементаНабора.Имя;
				ПараметрЭлементаНабора.ДоступенСписокЗначений = Ложь;
				
				Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СписокЗначений") Тогда
					ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение.Скопировать();
				ИначеЕсли ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда
					ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				КонецЕсли;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "ПараметрДляВыбораДокументов" Тогда
				
				ПараметрЭлементаНабора.Имя = "ПараметрДляВыбораДокументов_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Заголовок = ПараметрЭлементаНабора.Имя;
				ПараметрЭлементаНабора.ДоступенСписокЗначений = Ложь;
				
				Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СписокЗначений") Тогда
					ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение.Скопировать();
				ИначеЕсли ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда
					ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				КонецЕсли;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "Счета206" Тогда
				
				ПараметрЭлементаНабора.Имя = "Счета206";
				ПараметрЭлементаНабора.Заголовок = ПараметрЭлементаНабора.Имя;
				ПараметрЭлементаНабора.ДоступенСписокЗначений = Истина;				
				ПараметрЭлементаНабора.Выражение = "ЗаполнениеОтчетности.ПолучитьМассивСчетов(""206.00"",Неопределено,Ложь)";
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "Счета20930" Тогда
				
				ПараметрЭлементаНабора.Имя = "Счета20930";
				ПараметрЭлементаНабора.Заголовок = ПараметрЭлементаНабора.Имя;
				ПараметрЭлементаНабора.ДоступенСписокЗначений = Истина;
								
				ПараметрЭлементаНабора.Выражение = "ЗаполнениеОтчетности.ПолучитьМассивСчетов(""209.30"",Неопределено,Ложь)";
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "ВалютаРегУчета" Тогда
				
				ПараметрЭлементаНабора.Имя = "ВалютаРегУчета";
				ПараметрЭлементаНабора.Заголовок = ПараметрЭлементаНабора.Имя;
				ПараметрЭлементаНабора.ДоступенСписокЗначений = Ложь;

				ПараметрЭлементаНабора.Значение = Константы.ВалютаРегламентированногоУчета.Получить();	
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "ДенежныеСчета" Тогда	
				
				ПараметрЭлементаНабора.Имя = "ДенежныеСчета_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "СчетаРасчетовССегментами" Тогда	
				
				ПараметрЭлементаНабора.Имя = "СчетаРасчетовССегментами_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "СчетаИсправленияОшибок" Тогда	
				
				ПараметрЭлементаНабора.Имя = "СчетаИсправленияОшибок_"+НаименованиеНабора;	
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "СчетаИсправленияОшибокКонтроль" Тогда	
				
				ПараметрЭлементаНабора.Имя = "СчетаИсправленияОшибокКонтроль_"+НаименованиеНабора;	
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "СчетаИсключаемые" Тогда	
				
				ПараметрЭлементаНабора.Имя = "СчетаИсключаемые_"+НаименованиеНабора;	
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
					
			ИначеЕсли ПараметрЭлементаНабора.Имя = "СчетОбязательств" Тогда	
				
				ПараметрЭлементаНабора.Имя = "СчетОбязательств_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "ИсполнениеПоБалансовым" Тогда	
				
				ПараметрЭлементаНабора.Имя = "ИсполнениеПоБалансовым_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "СчетаЗабаланс" Тогда	
				
				ПараметрЭлементаНабора.Имя = "СчетаЗабаланс_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "СчетаДт" Тогда	
				
				ПараметрЭлементаНабора.Имя = "СчетаДт_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "СчетаКт" Тогда	
				
				ПараметрЭлементаНабора.Имя = "СчетаКт_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "ВидЗадолженностиПоСрокамИсп" Тогда	
				
				ПараметрЭлементаНабора.Имя = "ВидЗадолженностиПоСрокамИсп_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "ТипЗадолженностиПоСрокамИсп" Тогда	
				
				ПараметрЭлементаНабора.Имя = "ТипЗадолженностиПоСрокамИсп_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "СчетРасчетовПоСрокамИсп" Тогда	
				
				ПараметрЭлементаНабора.Имя = "СчетРасчетовПоСрокамИсп_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;		
				
			ИначеЕсли ПараметрЭлементаНабора.Имя = "Счета106" Тогда	
				
				ПараметрЭлементаНабора.Имя = "Счета106_"+НаименованиеНабора;
				ПараметрЭлементаНабора.Значение = ЗначениеПараметра.Значение;
								
			КонецЕсли;
			
			ИзменитьДоступностьПараметра(ПараметрЭлементаНабора, Параметр.Имя);
			
		Иначе
			
			ИзменитьДоступностьПараметра(ПараметрСхемыКомпоновкиОбъединение, Параметр.Имя);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьПоляРесурсов(ЭлементНабора, НаборОбъединение, КоллекцияПолейИтогаШаблона, КоллекцияПолейИтогаОбъединение, НаименованиеНабора = "")
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	// Дополним поля шаблона полями ресурсов с префиксом имени запроса в пути
	Для каждого ПолеИтога Из КоллекцияПолейИтогаШаблона Цикл
		
		ПолеСхемы = НаборОбъединение.Поля.Найти(ПолеИтога.ПутьКДанным);
		ПолеСхемы.ОграничениеИспользованияРеквизитов.Группировка = Истина;
		ПолеСхемы.ОграничениеИспользованияРеквизитов.Поле = Истина;
		ПолеСхемы.ОграничениеИспользованияРеквизитов.Порядок = Истина;
		ПолеСхемы.ОграничениеИспользованияРеквизитов.Условие = Истина;
		
		ПолеЭлементаНабора = ЭлементНабора.Поля.Найти(ПолеИтога.ПутьКДанным);
		ПолеЭлементаНабора.ОграничениеИспользованияРеквизитов.Группировка = Истина;
		ПолеЭлементаНабора.ОграничениеИспользованияРеквизитов.Поле = Истина;
		ПолеЭлементаНабора.ОграничениеИспользованияРеквизитов.Порядок = Истина;
		ПолеЭлементаНабора.ОграничениеИспользованияРеквизитов.Условие = Истина;
		
		Если КоллекцияПолейИтогаОбъединение.Найти(ПолеИтога.ПутьКДанным) = Неопределено Тогда
			
			ПолеИтогаСхемы = КоллекцияПолейИтогаОбъединение.Добавить();
			ЗаполнитьЗначенияСвойств(ПолеИтогаСхемы, ПолеИтога);
			
		КонецЕсли;
		
		НовоеПолеЭлементаНабора = ЭлементНабора.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПолеЭлементаНабора.Поле = ПолеИтога.ПутьКДанным;
		НовоеПолеЭлементаНабора.ПутьКДанным = НаименованиеНабора+"_"+ПолеИтога.ПутьКДанным;
		НовоеПолеЭлементаНабора.ТипЗначения = ТипЧисло;
		
		НовоеПолеЭлементаНабора.ОграничениеИспользованияРеквизитов.Группировка = Истина;
		НовоеПолеЭлементаНабора.ОграничениеИспользованияРеквизитов.Поле = Истина;
		НовоеПолеЭлементаНабора.ОграничениеИспользованияРеквизитов.Порядок = Истина;
		НовоеПолеЭлементаНабора.ОграничениеИспользованияРеквизитов.Условие = Истина;
		
		НовоеПолеСхемы = НаборОбъединение.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПолеСхемы.Поле = НовоеПолеЭлементаНабора.ПутьКДанным;
		НовоеПолеСхемы.ПутьКДанным = НаименованиеНабора+"."+ПолеИтога.ПутьКДанным;
		НовоеПолеСхемы.ТипЗначения = ТипЧисло;
		
		НовоеПолеСхемы.ОграничениеИспользованияРеквизитов.Группировка = Истина;
		НовоеПолеСхемы.ОграничениеИспользованияРеквизитов.Поле = Истина;
		НовоеПолеСхемы.ОграничениеИспользованияРеквизитов.Порядок = Истина;
		НовоеПолеСхемы.ОграничениеИспользованияРеквизитов.Условие = Истина;
		
		ПолеИтогаСхемы = КоллекцияПолейИтогаОбъединение.Добавить();
		ПолеИтогаСхемы.Выражение = "Сумма(" + НовоеПолеСхемы.ПутьКДанным + ")";
		ПолеИтогаСхемы.ПутьКДанным = НовоеПолеСхемы.ПутьКДанным;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьПоляСхемы(ЭлементНабора, НаборОбъединение, КоллекцияПолейШаблона, НастройкиШаблона, НаименованиеНабора = "")
	
	Для каждого Поле Из КоллекцияПолейШаблона Цикл
		
		ЭтоСубконто = Найти(Поле.Поле, "Субконто") <> 0;
		
		ПутьКДанным = Поле.ПутьКДанным;
		
		ПолеЭлементаНабора = ЭлементНабора.Поля.Найти(ПутьКДанным);
		
		Если ПолеЭлементаНабора = Неопределено Тогда
			
			Если ЭтоСубконто Тогда
				
				Если Поле.ОграничениеИспользования.Поле Тогда
					
					ЭлементНабора.Запрос = ЗаполнениеОтчетностиКлиентСервер.УдалитьПолеЗапроса(ЭлементНабора.Запрос, Поле.Поле);
					МассивУдаляемыхПолей = Новый Массив;
					
					Для каждого ВыбранноеПоле Из НастройкиШаблона.Выбор.Элементы Цикл
						Если Строка(ВыбранноеПоле.Поле) = Поле.Поле И МассивУдаляемыхПолей.Найти(ВыбранноеПоле) = Неопределено Тогда
							МассивУдаляемыхПолей.Добавить(ВыбранноеПоле);
						КонецЕсли;
					КонецЦикла;
					Для каждого ВыбранноеПоле Из МассивУдаляемыхПолей Цикл
						НастройкиШаблона.Выбор.Элементы.Удалить(ВыбранноеПоле);
					КонецЦикла;
					
					Продолжить;
					
				Иначе
					
					Если ЗначениеЗаполнено(Поле.Заголовок) И ЗначениеЗаполнено(Поле.ТипЗначения) Тогда
						
						ЭлементНабора.Запрос = ВыразитьПолеЗапроса(ЭлементНабора.Запрос, Поле.Поле, Поле.ТипЗначения, Поле.Заголовок);
						
						ПолеЭлементаНабора = ЭлементНабора.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
						ЗаполнитьЗначенияСвойств(ПолеЭлементаНабора, Поле,, "Поле, ПутьКДанным, Заголовок, ТипЗначения");
						
						ПолеЭлементаНабора.Поле = Поле.Заголовок;
						ПолеЭлементаНабора.ПутьКДанным = Поле.Заголовок;
						ПолеЭлементаНабора.ТипЗначения = Поле.ТипЗначения;
						
						Для каждого ВыбранноеПоле Из НастройкиШаблона.Выбор.Элементы Цикл
							Если Строка(ВыбранноеПоле.Поле) = Поле.Поле Тогда
								ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(Поле.Заголовок);
							КонецЕсли;
						КонецЦикла;
						
					Иначе
						
						ПолеЭлементаНабора = ЭлементНабора.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
						ЗаполнитьЗначенияСвойств(ПолеЭлементаНабора, Поле,, "Заголовок, ТипЗначения");
						ПолеЭлементаНабора.ТипЗначения = Поле.ТипЗначения;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ПолеЭлементаНабора = ЭлементНабора.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(ПолеЭлементаНабора, Поле);
				
			КонецЕсли;
			
			ПолеЭлементаНабора.Роль.Обязательное = Поле.Роль.Обязательное;
			
		КонецЕсли;
		
		Если Найти(ПолеЭлементаНабора.ПутьКДанным, ".") <> 0 Тогда
			
			ПутьКДаннымОбъединение = ПолеЭлементаНабора.ПутьКДанным;
			
			ПолеЭлементаНабора.ПутьКДанным = НаименованиеНабора + "_" + СтрЗаменить(ПолеЭлементаНабора.ПутьКДанным, ".", "_");
			
			ПолеОбъединение = ПолеЭлементаНабора.ПутьКДанным;
			
		Иначе
			
			ПутьКДаннымОбъединение = ПолеЭлементаНабора.ПутьКДанным;
			ПолеОбъединение = ПолеЭлементаНабора.Поле;
			
		КонецЕсли;
		
		ПолеНабораОбъединения = НаборОбъединение.Поля.Найти(ПолеЭлементаНабора.ПутьКДанным);
		Если ПолеНабораОбъединения = Неопределено Тогда
			
			ПолеНабораОбъединения = НаборОбъединение.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ПолеНабораОбъединения, ПолеЭлементаНабора);
			
			ПолеНабораОбъединения.Поле = ПолеОбъединение;
			ПолеНабораОбъединения.ПутьКДанным = ПутьКДаннымОбъединение;
			
		КонецЕсли;
		
		ПолеНабораОбъединения.Роль.Обязательное = Поле.Роль.Обязательное;
		
	КонецЦикла;
	
КонецПроцедуры 

// Получает модифицированный текст запроса в котором поля выражены переданным типом
//
// Параметры:
//  ТекстЗапроса - Текст запроса
//  ИмяПоля - Имя поля запроса, поиск осуществляется по шаблону: "//" + ИмяПоля + Постфикс
//          - Постфикс: _Поле, _ДоступноеПоле, _ПараметрВТ
//  ТипЗначения - Тип значения поля
//  Заголовок - Псевдоним поля
//
// Возвращаемое значение:
//  ТекстЗапроса - модифицированный текст запроса
//
Функция ВыразитьПолеЗапроса(Знач ТекстЗапроса, Знач ИмяПоля, Знач ТипЗначения, Знач Заголовок) Экспорт
	
	// Поле запроса
	ТекстЗапроса1 = НРег(ТекстЗапроса);
	ИмяПоля1 = НРег("//"+ИмяПоля + "_Поле");
	
	Поз = Найти(ТекстЗапроса1, ИмяПоля1);
	
	Если Поз <> 0 Тогда
		
		СтрокаТипа = ЗаполнениеОтчетности.ВернутьСтрокуТипаПоТипу(ТипЗначения.Типы()[0], "Запрос");
		ДлинаСтрокиТипа = СтрДлина(СтрокаТипа);
		
		Пока Поз <> 0 Цикл
			
			Начало = Поз;
			Конец = 0;
			
			Если ЗаполнениеОтчетностиКлиентСервер.ВыделитьПолеЗапроса(ТекстЗапроса1, Начало, Конец) Тогда
				
				ТекстЗапроса = ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, 1, Начало - 1) + "ВЫРАЗИТЬ(" + ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, Начало, Конец) + " КАК " + СтрокаТипа + ") " + ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, Конец + 1);
				
				ТекстЗапроса1 = НРег(ТекстЗапроса);
				
			Иначе
				
				Продолжить;
				
			КонецЕсли;
			
			Поз = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстЗапроса1, ИмяПоля1, Начало);
			Если Поз <> 0 Тогда
				
				Поз = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстЗапроса1, ИмяПоля1, Поз + 1);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Выбранное поле запроса
	ТекстЗапроса1 = НРег(ТекстЗапроса);
	ИмяПоля2 = НРег("//"+ИмяПоля + "_ДоступноеПоле");
	
	Поз = Найти(ТекстЗапроса1, ИмяПоля2);
	
	Пока Поз <> 0 Цикл
		
		Начало = Поз;
		Конец = 0;
		
		Если ЗаполнениеОтчетностиКлиентСервер.ВыделитьПолеЗапроса(ТекстЗапроса1, Начало, Конец) Тогда
			
			ПредставлениеПоля = " КАК " + Заголовок;
			
			ПозТочка = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстЗапроса, ".", Начало, Конец);
			ПозКАК = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстЗапроса, "КАК", Конец, Поз);
			
			Если ПозКАК = 0 Тогда
				
				ТекстЗапроса = ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, 1, Конец) + ПредставлениеПоля + ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, Конец + 1);
				
			Иначе
				
				ПозЗапятая = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстЗапроса, ",", Конец + 1, Поз);
				
				Если ПозЗапятая = 0 Тогда
					
					ТекстЗапроса = ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, 1, Конец) + ПредставлениеПоля + ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, Поз);
					
				Иначе
					
					ТекстЗапроса = ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, 1, Конец) + ПредставлениеПоля + ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, ПозЗапятая);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТекстЗапроса1 = НРег(ТекстЗапроса);
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		Поз = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстЗапроса1, ИмяПоля2, Начало);
		Если Поз <> 0 Тогда
			
			Поз = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстЗапроса1, ИмяПоля2, Поз + 1);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Параметры ВТ
	ТекстЗапроса1 = НРег(ТекстЗапроса);
	ИмяПоля3 = НРег("//"+ИмяПоля + "_ПараметрВТ");
	
	Поз = Найти(ТекстЗапроса1, ИмяПоля3);
	
	Пока Поз <> 0 Цикл
		
		Начало = Поз;
		Конец = 0;
		
		Если ЗаполнениеОтчетностиКлиентСервер.ВыделитьПолеЗапроса(ТекстЗапроса1, Начало, Конец) Тогда
			
			ПредставлениеПоля = " КАК " + Заголовок;
			
			ПозТочка = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстЗапроса, ".", Начало, Конец);
			ПозКАК = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстЗапроса, "КАК", Конец, Поз);
			
			Если ПозКАК = 0 Тогда
				
				ТекстЗапроса = ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, 1, Конец) + ПредставлениеПоля + ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, Конец + 1);
				
			Иначе
				
				ПозЗапятая = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстЗапроса, ",", Конец + 1, Поз);
				
				Если ПозЗапятая = 0 Тогда
					
					ТекстЗапроса = ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, 1, Конец) + ПредставлениеПоля + ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, Поз);
					
				Иначе
					
					ТекстЗапроса = ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, 1, Конец) + ПредставлениеПоля + ЗаполнениеОтчетностиКлиентСервер.Подстрока(ТекстЗапроса, ПозЗапятая);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТекстЗапроса1 = НРег(ТекстЗапроса);
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		Поз = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстЗапроса1, ИмяПоля3, Начало);
		Если Поз <> 0 Тогда
			
			Поз = ЗаполнениеОтчетностиКлиентСервер.НайтиПодстрокуПрав(ТекстЗапроса1, ИмяПоля3, Поз + 1);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ИзменитьДоступностьПараметра(ПараметрСхемыКомпоновкиОбъединение, Знач ИмяИсходногоПараметра)
	
	Если Найти("ПериодОтчета,ВидыСубконто,ВидыКорСубконто,ВидыСубконтоДт,ВидыСубконтоКт", ИмяИсходногоПараметра) Тогда
		ПараметрСхемыКомпоновкиОбъединение.ВключатьВДоступныеПоля = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиПолеНабораСКД(Знач ПутьКДанным, Знач КоллекцияПолей)
	
	Для каждого ПолеНабора Из КоллекцияПолей Цикл
		
		Если ПолеНабора.ПутьКДанным = ПутьКДанным Тогда
			
			Возврат ПолеНабора;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОбработатьВидыСубконто(ТекстЗапроса, ИмяНабора)
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "(&ПериодОтчета)", "(&ПериодОтчета_"+ИмяНабора+")");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "(&ВидыСубконто)", "(&ВидыСубконто_"+ИмяНабора+")");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "(&ВидыКорСубконто)", "(&ВидыКорСубконто_"+ИмяНабора+")");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "(&ВидыСубконтоДт)", "(&ВидыСубконтоДт_"+ИмяНабора+")");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "(&ВидыСубконтоКт)", "(&ВидыСубконтоКт_"+ИмяНабора+")");
	
КонецПроцедуры 

Функция ПодготовитьСписокИспользованныхКарт(ТаблицаСвязей)
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("КартаДанных");
	
	Для каждого СтрокаТаблицы Из ТаблицаСвязей Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.КартаДанных = СтрокаТаблицы.ИсточникСвязи;
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.КартаДанных = СтрокаТаблицы.ПриемникСвязи;
		
	КонецЦикла;
	
	ТаблицаДанных.Свернуть("КартаДанных","");
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ПодготовитьСтруктуруТаблиц(СтруктураКартДанных)
	
	СтруктураТаблиц = Новый Соответствие;
	
	Если ТипЗнч(СтруктураКартДанных) = Тип("Структура") Тогда
		
		Для каждого КлючИЗначение Из СтруктураКартДанных Цикл
			
			СписокПолейКарты = Новый СписокЗначений;
			
			Для каждого КолонкаКарты Из КлючИЗначение.Значение.Колонки Цикл
				
				СписокПолейКарты.Добавить(КолонкаКарты);
				
			КонецЦикла;
			
			СтруктураТаблиц.Вставить(КлючИЗначение.Ключ, СписокПолейКарты);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураТаблиц;
	
КонецФункции

Процедура СвязатьНаборыДанных(ТаблицаДанных, ТаблицаСвязей, СхемаКомпоновкиОбъединение)
	
	ИмяИсточника = "Объединение";
	Если СхемаКомпоновкиОбъединение.НаборыДанных.Найти(ИмяИсточника) = Неопределено Тогда
		ИмяИсточника = "НаборДанных1";
	КонецЕсли;
	
	// Создаем таблицу связей всех использованных наборов
	Для каждого СтрокаТаблицы Из ТаблицаСвязей Цикл
		
		ИсточникСвязи = СтрокаТаблицы.ИсточникСвязи;
		Если ИсточникСвязи = "Данные запроса" Тогда
			ИсточникСвязи = ИмяИсточника;
			ПолеИсточника= СтрокаТаблицы.ПолеИсточника;
		Иначе
			ПолеИсточника= ИсточникСвязи + "." + СтрокаТаблицы.ПолеИсточника;
		КонецЕсли;
		
		ПриемникСвязи = СтрокаТаблицы.ПриемникСвязи;
		Если ПриемникСвязи = "Данные запроса" Тогда
			ПриемникСвязи = ИмяИсточника;
			ПолеПриемника = СтрокаТаблицы.ПолеПриемника;
		Иначе
			ПолеПриемника = ПриемникСвязи + "." + СтрокаТаблицы.ПолеПриемника;
		КонецЕсли;
		
		НоваяСвязьНаборов = СхемаКомпоновкиОбъединение.СвязиНаборовДанных.Добавить();
		
		НоваяСвязьНаборов.НаборДанныхИсточник = ИсточникСвязи;
		НоваяСвязьНаборов.ВыражениеИсточник = ПолеИсточника;
		НоваяСвязьНаборов.НаборДанныхПриемник = ПриемникСвязи;
		НоваяСвязьНаборов.ВыражениеПриемник = ПолеПриемника;
		
	КонецЦикла;
	
	// Для работы связей наборов необходимо все не связанные наборы связать по "Истина"
	ТаблицаСвязейВрем = Новый ТаблицаЗначений;
	ТаблицаСвязейВрем.Колонки.Добавить("НаборДанныхИсточник");
	ТаблицаСвязейВрем.Колонки.Добавить("НаборДанныхПриемник");
	
	Для Инд = 0 По ТаблицаДанных.Количество() - 1 Цикл
		
		Для Джи = 0 По ТаблицаДанных.Количество() - 1 Цикл
			
			Если Инд <> Джи Тогда
				
				ПараметрыПоиска = Новый Структура;
				ПараметрыПоиска.Вставить("НаборДанныхИсточник", ТаблицаДанных[Джи].КартаДанных);
				ПараметрыПоиска.Вставить("НаборДанныхПриемник", ТаблицаДанных[Инд].КартаДанных);
				
				НайденныеСтроки = ТаблицаСвязейВрем.НайтиСтроки(ПараметрыПоиска);
				Если НайденныеСтроки.Количество() = 0 Тогда
					
					НоваяСвязьНаборов = ТаблицаСвязейВрем.Добавить();
					
					НоваяСвязьНаборов.НаборДанныхИсточник = ТаблицаДанных[Инд].КартаДанных;
					НоваяСвязьНаборов.НаборДанныхПриемник = ТаблицаДанных[Джи].КартаДанных;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Необходимо удалить те связи которые уже есть в таблице связи (не важно слева или справа поле)
	Для каждого СтрокаТаблицы Из ТаблицаСвязей Цикл
		
		ПараметрыПоиска = Новый Структура("НаборДанныхИсточник, НаборДанныхПриемник", СтрокаТаблицы.ИсточникСвязи, СтрокаТаблицы.ПриемникСвязи);
		НайденныеСтроки = ТаблицаСвязейВрем.НайтиСтроки(ПараметрыПоиска);
		Для каждого СтрокаТаблицыВрем Из НайденныеСтроки Цикл
			ТаблицаСвязейВрем.Удалить(СтрокаТаблицыВрем);
		КонецЦикла;
		
		ПараметрыПоискаИнв = Новый Структура("НаборДанныхИсточник, НаборДанныхПриемник", СтрокаТаблицы.ПриемникСвязи, СтрокаТаблицы.ИсточникСвязи);
		НайденныеСтроки = ТаблицаСвязейВрем.НайтиСтроки(ПараметрыПоискаИнв);
		Для каждого СтрокаТаблицыВрем Из НайденныеСтроки Цикл
			ТаблицаСвязейВрем.Удалить(СтрокаТаблицыВрем);
		КонецЦикла;
		
	КонецЦикла;
	
	// Добавляем в таблицу связей оставшиеся строки
	Для каждого СтрокаТаблицы Из ТаблицаСвязейВрем Цикл
		
		НоваяСвязьНаборов = СхемаКомпоновкиОбъединение.СвязиНаборовДанных.Добавить();
		
		НоваяСвязьНаборов.НаборДанныхИсточник = СтрокаТаблицы.НаборДанныхИсточник;
		НоваяСвязьНаборов.ВыражениеИсточник = "Истина";
		НоваяСвязьНаборов.НаборДанныхПриемник = СтрокаТаблицы.НаборДанныхПриемник;
		НоваяСвязьНаборов.ВыражениеПриемник = "Истина";
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьОтборСКД(КоллекцияПолейНабора, КоллекцияПолейШаблона, КоллекцияЭлементовОтбора, КоллекцияЭлементовОтбораШаблон, НаименованиеНабора)
	
	Для каждого ПолеОтбора Из КоллекцияЭлементовОтбораШаблон Цикл
		
		Если ТипЗнч(ПолеОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			ДобавитьГруппуОтбораСКД(ПолеОтбора, КоллекцияПолейШаблона, КоллекцияПолейНабора, КоллекцияЭлементовОтбора, НаименованиеНабора);
			
		Иначе
			
			ДобавитьОтборСКД(ПолеОтбора, КоллекцияПолейШаблона, КоллекцияПолейНабора, КоллекцияЭлементовОтбора, НаименованиеНабора);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СкопироватьСхемуКомпоновки(СхемаШаблона)
	
	Буфер = Новый ХранилищеЗначения(СхемаШаблона);
	
	Возврат Буфер.Получить();
	
КонецФункции

Функция СоединитьСКартамиДанных(ТаблицаСвязей, СтруктураКартДанных, СхемаКомпоновкиОбъединение, ТекстСообщения = "") Экспорт
	
	Если ТипЗнч(ТаблицаСвязей) <> Тип("ТаблицаЗначений") ИЛИ Не ЗначениеЗаполнено(ТаблицаСвязей) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	ТаблицаДанных = ПодготовитьСписокИспользованныхКарт(ТаблицаСвязей);
	
	Если НЕ СоздатьНаборыДанныхОбъект(ТаблицаДанных, СтруктураКартДанных, СхемаКомпоновкиОбъединение, ТекстСообщения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СвязатьНаборыДанных(ТаблицаДанных, ТаблицаСвязей, СхемаКомпоновкиОбъединение);
	
	Возврат Истина;
	
КонецФункции

Функция СоздатьНаборыДанныхОбъект(ТаблицаДанных, СтруктураКартДанных, СхемаКомпоновкиОбъединение, ТекстСообщения = "")
	
	СтруктураТаблиц = ПодготовитьСтруктуруТаблиц(СтруктураКартДанных);
	
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		Если СтрокаТаблицы.КартаДанных = "Данные запроса" Тогда
			
			Продолжить;
			
		ИначеЕсли СтрокаТаблицы.КартаДанных = "ИерархияСчетов" Тогда
			
			ТаблицаКарты = Новый ТаблицаЗначений;
			ТаблицаКарты.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
			ТаблицаКарты.Колонки.Добавить("Родитель", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
			
			ИмяНабора = "ИерархияСчетов";
			
		Иначе
			
			ТаблицаКарты = Новый ТаблицаЗначений;
			
			СписокПолей = СтруктураТаблиц[СтрокаТаблицы.КартаДанных];
			
			Если ТипЗнч(СписокПолей) <> Тип("СписокЗначений") Тогда
				
				ТекстОшибки = НСтр("ru = 'Карта данных ""%1"", используемая в таблице соединений не найдена.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СтрокаТаблицы.КартаДанных);
				
				Возврат Ложь;
				
			КонецЕсли;
			
			Для каждого ЭлементСписка Из СписокПолей Цикл
				
				Колонка = ТаблицаКарты.Колонки.Добавить(ЭлементСписка.Значение.Имя, ЭлементСписка.Значение.ТипЗначения);
				
			КонецЦикла;
			
			ИмяНабора = СтрокаТаблицы.КартаДанных;
			
		КонецЕсли;
		
		БюджетнаяОтчетность.ДобавитьТаблицуЗначенийВНаборыДанныхСхемыКомпоновкиДанных(
				СхемаКомпоновкиОбъединение, ТаблицаКарты, ИмяНабора, Истина);
		
		Для каждого ПолеКарты Из СхемаКомпоновкиОбъединение.НаборыДанных[ИмяНабора].Поля Цикл
			
			ПолеКарты.ПутьКДанным = СтрокаТаблицы.КартаДанных + "." + ПолеКарты.ПутьКДанным;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Служебные процедуры метода ПолучитьИерархиюПланаСчетов

Функция ПолучитьИерархиюСчетов(ОтборСчетов = Неопределено,ИмяТаблицы = "ПланСчетов.ЕПСБУ", СчетВИерархииОтбора = Ложь, ИсключитьПереданные = Ложь,
				РодительИзСпискаОтбораСчетов = Ложь, ПолучитьТолькоПервогоРодителя = Ложь, ИсключатьСчетаОтбора = Ложь, МаксимальныйУровеньВложенности = 1000)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ПолучитьСчетаПервогоУровня(МенеджерВременныхТаблиц, ИмяТаблицы, ОтборСчетов, СчетВИерархииОтбора, ИсключитьПереданные,
			РодительИзСпискаОтбораСчетов, ПолучитьТолькоПервогоРодителя, ИсключатьСчетаОтбора) Тогда
		
		УровеньВложенности = 1;
		Пока УровеньВложенности <= МаксимальныйУровеньВложенности И ПолучитьПодчиненныеСчета(МенеджерВременныхТаблиц, ИмяТаблицы, ОтборСчетов,
				ИсключитьПереданные, РодительИзСпискаОтбораСчетов, ПолучитьТолькоПервогоРодителя, ИсключатьСчетаОтбора) Цикл
				
			УровеньВложенности = УровеньВложенности + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПолучитьРезультат(МенеджерВременныхТаблиц,ИмяТаблицы);
	
КонецФункции

Функция ПолучитьСчетаПервогоУровня(МенеджерВременныхТаблиц, ИмяТаблицы, МассивСсылокОтбор, УсловиеВИерархии, ИсключитьПереданные,
			РодительИзСписка, ПервыйРодитель, ИсключатьСамиСчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.Родитель,
		|	ВложенныйЗапрос.ПродолжатьПоиск
		|ПОМЕСТИТЬ Счета
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаСчетов.Ссылка КАК Ссылка,
		|		ВЫБОР
		|			КОГДА ТаблицаСчетов.Родитель = ЗНАЧЕНИЕ("+ИмяТаблицы+".ПустаяСсылка) ТОГДА
		|				%4
		|			ИНАЧЕ ТаблицаСчетов.Родитель
		|		КОНЕЦ КАК Родитель,
		|		ВЫБОР
		|			КОГДА ТаблицаСчетов.Родитель = ЗНАЧЕНИЕ("+ИмяТаблицы+".ПустаяСсылка) %3
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ %5
		|		КОНЕЦ КАК ПродолжатьПоиск
		|	ИЗ
		|		"+ИмяТаблицы+" КАК ТаблицаСчетов
		|	%1
		|	) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Родитель <> ЗНАЧЕНИЕ("+ИмяТаблицы+".ПустаяСсылка) %2
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВложенныйЗапрос.ПродолжатьПоиск
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Счета.Ссылка,
		|	Счета.Родитель
		|ПОМЕСТИТЬ ТаблицаСчетов
		|ИЗ
		|	Счета КАК Счета
		|ГДЕ
		|	Счета.ПродолжатьПоиск
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСчетов.Ссылка,
		|	ТаблицаСчетов.Родитель
		|ИЗ
		|	ТаблицаСчетов КАК ТаблицаСчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Счета.Ссылка,
		|	Счета.Родитель
		|ПОМЕСТИТЬ Результат
		|ИЗ
		|	Счета КАК Счета
		|%6
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Счета";
	
	ТекстУсловияВключенияСчетов = "";
	ТекстУсловияИсключенияСчетов = "";
	ТекстУсловияРодительПервыйИзСписка = "";
	
	ТекстУсловие6 = "";
	
	Если МассивСсылокОтбор <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("СписокСсылок", МассивСсылокОтбор);
		
		ТекстУсловияВключенияСчетов = "ГДЕ ТаблицаСчетов.Ссылка %1(&СписокСсылок)";
		ТекстСравнения = "В";
		Если УсловиеВИерархии Тогда
			ТекстСравнения = "В Иерархии";
		КонецЕсли;
		ТекстУсловияВключенияСчетов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстУсловияВключенияСчетов, ТекстСравнения);
		
		Если ИсключитьПереданные Тогда
			ТекстУсловияИсключенияСчетов = "И НЕ ВложенныйЗапрос.Ссылка В(&СписокСсылок)";
		КонецЕсли;
		
		Если РодительИзСписка Тогда
			ТекстУсловияВключенияСамихСчетов = "ИЛИ ТаблицаСчетов.Родитель В (&СписокСсылок)";
			ТекстУсловие6 = "ГДЕ НЕ Счета.ПродолжатьПоиск";
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстУсловияПервыйРодитель = "ИСТИНА";
	Если ПервыйРодитель Тогда
		ТекстУсловияПервыйРодитель = "ЛОЖЬ";
	КонецЕсли;
	
	ТекстУсловияИсключатьСамиСчета = "ТаблицаСчетов.Ссылка";
	Если ИсключатьСамиСчета Тогда
		ТекстУсловияИсключатьСамиСчета = "ЗНАЧЕНИЕ("+ИмяТаблицы+".ПустаяСсылка)";
	КонецЕсли;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст,
			ТекстУсловияВключенияСчетов, ТекстУсловияИсключенияСчетов, ТекстУсловияВключенияСамихСчетов,
			ТекстУсловияИсключатьСамиСчета, ТекстУсловияПервыйРодитель, ТекстУсловие6);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат НЕ Результат[2].Пустой();
	
КонецФункции

Функция ПолучитьПодчиненныеСчета(МенеджерВременныхТаблиц, ИмяТаблицы, МассивСсылокОтбор, ИсключитьПереданные,
			РодительИзСписка, ПервыйРодитель, ИсключатьСамиСчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Результат.Ссылка,
		|	Результат.Родитель
		|ПОМЕСТИТЬ ПредыдущийРезультат
		|ИЗ
		|	Результат КАК Результат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Результат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.Родитель,
		|	ВложенныйЗапрос.ПродолжатьПоиск
		|ПОМЕСТИТЬ Счета
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаСчетов.Ссылка КАК Ссылка,
		|		ВЫБОР
		|			КОГДА ТаблицаСчетов.Родитель.Родитель = ЗНАЧЕНИЕ("+ИмяТаблицы+".ПустаяСсылка) ТОГДА
		|				%3
		|			ИНАЧЕ ТаблицаСчетов.Родитель.Родитель
		|		КОНЕЦ КАК Родитель,
		|		ВЫБОР
		|			КОГДА ТаблицаСчетов.Родитель.Родитель = ЗНАЧЕНИЕ("+ИмяТаблицы+".ПустаяСсылка) %2
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ %4
		|		КОНЕЦ КАК ПродолжатьПоиск
		|	ИЗ
		|		ТаблицаСчетов КАК ТаблицаСчетов) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.Родитель <> ЗНАЧЕНИЕ("+ИмяТаблицы+".ПустаяСсылка) %1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВложенныйЗапрос.ПродолжатьПоиск
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаСчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Счета.Ссылка,
		|	Счета.Родитель
		|ПОМЕСТИТЬ ТаблицаСчетов
		|ИЗ
		|	Счета КАК Счета
		|ГДЕ
		|	Счета.ПродолжатьПоиск
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаСчетов.Ссылка,
		|	ТаблицаСчетов.Родитель
		|ИЗ
		|	ТаблицаСчетов КАК ТаблицаСчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Счета.Ссылка,
		|	Счета.Родитель
		|ПОМЕСТИТЬ Результат
		|ИЗ
		|	Счета КАК Счета
		|%5
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПредыдущийРезультат.Ссылка,
		|	ПредыдущийРезультат.Родитель
		|ИЗ
		|	ПредыдущийРезультат КАК ПредыдущийРезультат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Счета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПредыдущийРезультат";
		
	ТекстУсловияИсключенияСчетов = "";
	ТекстУсловияРодительПервыйИзСписка = "";
	
	ТекстУсловие5 = "";
	
	Если МассивСсылокОтбор <> Неопределено Тогда
		
		Запрос.УстановитьПараметр("СписокСсылок", МассивСсылокОтбор);
		
		Если ИсключитьПереданные Тогда
			ТекстУсловияИсключенияСчетов = "И НЕ ВложенныйЗапрос.Ссылка В(&СписокСсылок)";
		КонецЕсли;
		
		Если РодительИзСписка Тогда
			ТекстУсловияВключенияСамихСчетов = "ИЛИ ТаблицаСчетов.Родитель.Родитель В (&СписокСсылок)";
			ТекстУсловие5 = "ГДЕ НЕ Счета.ПродолжатьПоиск";
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстУсловияПервыйРодитель = "ИСТИНА";
	Если ПервыйРодитель Тогда
		ТекстУсловияПервыйРодитель = "ЛОЖЬ";
	КонецЕсли;
	
	ТекстУсловияИсключатьСамиСчета = "ТаблицаСчетов.Ссылка";
	Если ИсключатьСамиСчета Тогда
		ТекстУсловияИсключатьСамиСчета = "ЗНАЧЕНИЕ("+ИмяТаблицы+".ПустаяСсылка)";
	КонецЕсли;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст,
			ТекстУсловияИсключенияСчетов, ТекстУсловияВключенияСамихСчетов,
			ТекстУсловияИсключатьСамиСчета, ТекстУсловияПервыйРодитель, ТекстУсловие5);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат НЕ Результат[5].Пустой();
	
КонецФункции

Функция ПолучитьРезультат(МенеджерВременныхТаблиц,ИмяТаблицы)
	
	Запрос = Новый Запрос;
	
	Если ИмяТаблицы = "ПланСчетов.ЕПСБУ" Тогда
		ПолеУпорядочивания = "Порядок";
	Иначе
		ПолеУпорядочивания = "Код";
	КонецЕсли;

	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Результат.Ссылка,
		|	Результат.Родитель
		|ИЗ
		|	Результат КАК Результат
		|
		|УПОРЯДОЧИТЬ ПО
		|	Результат.Ссылка."+ПолеУпорядочивания+",
		|	Результат.Родитель."+ПолеУпорядочивания;
		
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Индексы.Добавить("Ссылка");
		
	Возврат Таблица;
	
КонецФункции

/////////////////////////////////////////////////////////////////////////
// Проверка правил заполнения

Функция ПодготовитьСтруктуруПараметровПроверки() Экспорт
	
	СтруктураПараметров = Новый Структура;
	
	//параметры запуска 
	СтруктураПараметров.Вставить("ПравилоЗаполнения");
	СтруктураПараметров.Вставить("ОбластьЗаполнения");
	СтруктураПараметров.Вставить("ПараметрыЗаполнения");
	
	// Вниутренние управляющие параметры
	СтруктураПараметров.Вставить("СформироватьТолькоТаблицуОбласти",Ложь);
	
	//данные Механизма кэширования
	СтруктураПараметров.Вставить("КэшЗаполнен",Ложь);
	СтруктураПараметров.Вставить("ИсточникЗаполненияКэша");
	СтруктураПараметров.Вставить("КэшируемыеДанные",Новый Структура);
	СтруктураПараметров.КэшируемыеДанные.Вставить("ПравилоЗаполнения");
	СтруктураПараметров.КэшируемыеДанные.Вставить("ПравилоНаименование");
	СтруктураПараметров.КэшируемыеДанные.Вставить("НаименованиеВидаОтчета");
	СтруктураПараметров.КэшируемыеДанные.Вставить("ТаблицаМетодовДополнительнойОбработки");
	СтруктураПараметров.КэшируемыеДанные.Вставить("КартыДанных");
	СтруктураПараметров.КэшируемыеДанные.Вставить("ОбработкаЗаполнения");
	СтруктураПараметров.КэшируемыеДанные.Вставить("МакетОтчета");
	
	
	
	Возврат СтруктураПараметров;
	
КонецФункции	

Функция СформироватьОтчетПроверкиПравилЗаполнения(СтруктураПараметров) Экспорт 
	
	Если не ЗначениеЗаполнено(СтруктураПараметров.ПравилоЗаполнения) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(СтруктураПараметров.ПараметрыЗаполнения) <> Тип("Структура") Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	
	СтруктураПараметров.ИсточникЗаполненияКэша = "ПравилоЗаполнения";
	ЗаполнитьКэшируемыеДанные(СтруктураПараметров);
	
	ПравилоЗаполнения = СтруктураПараметров.КэшируемыеДанные.ПравилоЗаполнения;
	ПравилоНаименование = СтруктураПараметров.КэшируемыеДанные.ПравилоНаименование;
	НаименованиеВидаОтчета = СтруктураПараметров.КэшируемыеДанные.НаименованиеВидаОтчета;
	ТаблицаМетодовДополнительнойОбработки = СтруктураПараметров.КэшируемыеДанные.ТаблицаМетодовДополнительнойОбработки;
	КартыДанных = СтруктураПараметров.КэшируемыеДанные.КартыДанных;
	
	//Т.к. тип значения колонок в картах явно задан, то надо удалить колонку и заново добавить,
	//чтобы присваивать нужные значения без приведения типов.
	
	Для Каждого КлючИЗначение Из КартыДанных Цикл
		МассивИменКолонок = Новый Массив;
		Для Каждого ТекКолонка Из КлючИЗначение.Значение.Колонки Цикл
			Если Лев(ТекКолонка.Имя,5)= "Пред_" Тогда
				МассивИменКолонок.Добавить(ТекКолонка.Имя);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекИмя Из МассивИменКолонок Цикл
			КлючИЗначение.Значение.Колонки.Удалить(ТекИмя);
			КлючИЗначение.Значение.Колонки.Добавить(ТекИмя);
		КонецЦикла;
	КонецЦикла;
	
	ОбработкаЗаполнения = СтруктураПараметров.КэшируемыеДанные.ОбработкаЗаполнения;
	МакетОтчета = СтруктураПараметров.КэшируемыеДанные.МакетОтчета;
	
		
	СписокОбластей = Справочники.ПравилаЗаполнения.ПолучитьСписокОбластей(ПравилоЗаполнения,,Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
	
	МакетОбъектПроверки =	МакетОтчета.ПолучитьОбласть("ОбъектПроверки");
	
	// ОбъектПроверки
	
	Сообщение = НСтр("ru = 'Проверка правила заполнения "" %1 "" вида отчета "" %2 ""'");
	МакетОбъектПроверки.Параметры.Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, ПравилоНаименование, НаименованиеВидаОтчета);
	
	ТабличныйДокумент.Вывести(МакетОбъектПроверки, 0, "Правило", Истина);
	
	
	// параметры заполнения
	ВывестиПараметрыЗаполнения(ТабличныйДокумент, СтруктураПараметров);
	
	СтруктураДопПараметров = Новый Структура;
	
	МассивКодов = Новый Массив;	
	
	Для каждого Элемент Из СписокОбластей Цикл
		Схема = Элемент.СхемаКомпоновки.Получить();
		
		Для Каждого ТекПараметр Из Схема.Параметры Цикл
			Если Лев(ТекПараметр.Имя,13)= "КодВидаОтчета" 
				И ЗначениеЗаполнено(ТекПараметр.Значение) Тогда	
				КодВидаОтчета = ТекПараметр.Значение;
				МассивКодов.Добавить(КодВидаОтчета);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ЭлМас Из МассивКодов Цикл
		СсылкаНаОтчет = Справочники.ВидыОтчетов.НайтиПоКоду(ЭлМас);	
		
		СтруктураДопПараметров.Вставить(ЭлМас,ЗначениеЗаполнено(СсылкаНаОтчет));
	КонецЦикла;
		
	// Области заполнения	
	Для каждого Элемент Из СписокОбластей Цикл
		
		Если ЗначениеЗаполнено(Элемент.Условие) Тогда
			//Нужно проверить выполнение данного условия
			УсловиеВыполненияОбласти = ПроверитьУсловиеОбласти(Элемент.Условие, СтруктураПараметров.ПараметрыЗаполнения,СтруктураДопПараметров);
			Если УсловиеВыполненияОбласти = Ложь Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураПараметров.ОбластьЗаполнения = Элемент.Значение;
		СтруктураПараметров.СформироватьТолькоТаблицуОбласти = Истина;
		
		ТабличныйДокументОбласти = СформироватьОтчетПроверкиОбластейЗаполнения(СтруктураПараметров);
		ТабличныйДокумент.Вывести(ТабличныйДокументОбласти, 1, "Область", Истина);
		
	КонецЦикла;
	
	//Подвал
	
	ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
	
	ПрименитьОформлениеКТаблице(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СформироватьОтчетПроверкиОбластейЗаполнения(СтруктураПараметров) Экспорт 
	
	Если не ЗначениеЗаполнено(СтруктураПараметров.ОбластьЗаполнения) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(СтруктураПараметров.ПараметрыЗаполнения) <> Тип("Структура") Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	
	СтруктураПараметров.ИсточникЗаполненияКэша = "ОбластьЗаполнения";
	ЗаполнитьКэшируемыеДанные(СтруктураПараметров);
	
	ПравилоЗаполнения = СтруктураПараметров.КэшируемыеДанные.ПравилоЗаполнения;
	ПравилоНаименование = СтруктураПараметров.КэшируемыеДанные.ПравилоНаименование;
	НаименованиеВидаОтчета = СтруктураПараметров.КэшируемыеДанные.НаименованиеВидаОтчета;
	ТаблицаМетодовДополнительнойОбработки = СтруктураПараметров.КэшируемыеДанные.ТаблицаМетодовДополнительнойОбработки;
	КартыДанных = СтруктураПараметров.КэшируемыеДанные.КартыДанных;
	
	//Т.к. тип значения колонок в картах явно задан, то надо удалить колонку и заново добавить,
	//чтобы присваивать нужные значения без приведения типов.
	
	Для Каждого КлючИЗначение Из КартыДанных Цикл
		МассивИменКолонок = Новый Массив;
		Для Каждого ТекКолонка Из КлючИЗначение.Значение.Колонки Цикл
			Если Лев(ТекКолонка.Имя,5)= "Пред_" Тогда
				МассивИменКолонок.Добавить(ТекКолонка.Имя);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ТекИмя Из МассивИменКолонок Цикл
			КлючИЗначение.Значение.Колонки.Удалить(ТекИмя);
			КлючИЗначение.Значение.Колонки.Добавить(ТекИмя);
		КонецЦикла;
	КонецЦикла;
	
	ОбработкаЗаполнения = СтруктураПараметров.КэшируемыеДанные.ОбработкаЗаполнения;
	МакетОтчета = СтруктураПараметров.КэшируемыеДанные.МакетОтчета;
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	МакетОбъектПроверки =	МакетОтчета.ПолучитьОбласть("ОбъектПроверки");
	МакетРазделОбласть = 	МакетОтчета.ПолучитьОбласть("РазделОбласть");
	МакетЗаголовокКолонка = МакетОтчета.ПолучитьОбласть("Заголовок|Колонка");
	МакетСтрокаКолонка = 	МакетОтчета.ПолучитьОбласть("Строка|Колонка");

	
	Если СтруктураПараметров.СформироватьТолькоТаблицуОбласти Тогда
		ТабличныйДокумент.НачатьАвтогруппировкуСтрок();
		
	Иначе 
		НаименованиеОбласти = ЗаполнениеОтчетности.ЗначениеРеквизита(СтруктураПараметров.ОбластьЗаполнения, "Наименование");
		
		Сообщение = НСтр("ru = 'Проверка области заполнения "" %1 "" правила заполнения "" %2 "" вида отчета "" %3 ""'");
		МакетОбъектПроверки.Параметры.Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, НаименованиеОбласти, ПравилоНаименование, НаименованиеВидаОтчета);
		ТабличныйДокумент.Вывести(МакетОбъектПроверки);
		
		ВывестиПараметрыЗаполнения(ТабличныйДокумент, СтруктураПараметров);
		
	КонецЕсли;
	
	
	МакетРазделОбласть.Параметры.ОбъектПроверки = СтруктураПараметров.ОбластьЗаполнения;
	ТабличныйДокумент.Вывести(МакетРазделОбласть, 1, "Область", Истина);
	
	ОбработкаЗаполнения.мКартыДанных = КартыДанных;
	
	ТаблицаДанных = ОбработкаЗаполнения.ПолучитьТаблицуДанныхОбластиЗаполнения(СтруктураПараметров.ОбластьЗаполнения, ПравилоЗаполнения, СтруктураПараметров.ПараметрыЗаполнения, КартыДанных);
	
	ТекстСообщения = "";
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(ТаблицаДанных, "ОбластьЗаполнения", ТаблицаМетодовДополнительнойОбработки, 
		ПравилоЗаполнения, СтруктураПараметров.ОбластьЗаполнения, ТекстСообщения) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
	ВывестиДанныеОбласти(ТабличныйДокумент, ТаблицаДанных, МакетЗаголовокКолонка, МакетСтрокаКолонка);
	
	Если СтруктураПараметров.СформироватьТолькоТаблицуОбласти Тогда
		ТабличныйДокумент.ЗакончитьАвтогруппировкуСтрок();
		
	Иначе 
		ПрименитьОформлениеКТаблице(ТабличныйДокумент);
	
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьКэшируемыеДанные(СтруктураПараметров)
	Если СтруктураПараметров.КэшЗаполнен Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПравилоЗаполнения",СтруктураПараметров.ПравилоЗаполнения);
	Запрос.УстановитьПараметр("ОбластьЗаполнения",СтруктураПараметров.ОбластьЗаполнения);
	Запрос.УстановитьПараметр("ИсточникЗаполненияКэша",СтруктураПараметров.ИсточникЗаполненияКэша);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПравилаЗаполнения.Ссылка КАК ПравилоЗаполнения,
	|	ПравилаЗаполнения.Наименование КАК ПравилоНаименование,
	|	ПравилаЗаполнения.Владелец.Наименование КАК НаименованиеВидаОтчета
	|ИЗ
	|	Справочник.ПравилаЗаполнения КАК ПравилаЗаполнения
	|ГДЕ
	|	&ИсточникЗаполненияКэша = ""ПравилоЗаполнения""
	|	И ПравилаЗаполнения.Ссылка = &ПравилоЗаполнения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбластиЗаполнения.Владелец,
	|	ОбластиЗаполнения.Владелец.Наименование,
	|	ОбластиЗаполнения.Владелец.Владелец.Наименование
	|ИЗ
	|	Справочник.ОбластиЗаполнения КАК ОбластиЗаполнения
	|ГДЕ
	|	&ИсточникЗаполненияКэша = ""ОбластьЗаполнения""
	|	И ОбластиЗаполнения.Ссылка = &ОбластьЗаполнения";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		ВызватьИсключение НСтр("ru = 'Не удалось прочитать кэшируемые данные.'");
	КонецЕсли;
	ДанныеЗапроса = РезультатЗапроса.Выгрузить()[0];
	
	ЗаполнитьЗначенияСвойств(СтруктураПараметров.КэшируемыеДанные,ДанныеЗапроса,"ПравилоЗаполнения,ПравилоНаименование,НаименованиеВидаОтчета");
	
	
	ОбработкаЗаполнения = Обработки.ОбработкаДанныхОтчетности.Создать();
	
	ТаблицаМетодовДополнительнойОбработки = Справочники.ПравилаЗаполнения.ПолучитьТаблицуМетодов(ДанныеЗапроса.ПравилоЗаполнения,,,Истина);
	КартыДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ДанныеЗапроса.ПравилоЗаполнения);	
	ТекстСообщения = "";
	Если НЕ ОбработкаЗаполнения.ПрименитьМетодыДополнительнойОбработки(КартыДанных, "КартыДанных", ТаблицаМетодовДополнительнойОбработки, ДанныеЗапроса.ПравилоЗаполнения, Неопределено, ТекстСообщения) Тогда
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	СтруктураПараметров.КэшируемыеДанные.ТаблицаМетодовДополнительнойОбработки = ТаблицаМетодовДополнительнойОбработки;
	СтруктураПараметров.КэшируемыеДанные.КартыДанных = КартыДанных;	
	
	СтруктураПараметров.КэшируемыеДанные.ОбработкаЗаполнения = ОбработкаЗаполнения;
	СтруктураПараметров.КэшируемыеДанные.МакетОтчета = Справочники.ПравилаЗаполнения.ПолучитьМакет("МакетОтчетаПроверки");
	
	СтруктураПараметров.КэшЗаполнен = Истина;
КонецПроцедуры	

Процедура ВывестиПараметрыЗаполнения(ТабличныйДокумент, СтруктураПараметров)
	
	Перем НачалоПериода;
	Перем КонецПериода;
	Перем ДополнительныйПериод1;
	Перем ДополнительныйПериод2;
	Перем Организация;
	Перем ИФО;
	Перем ДополнительныеПараметры;
	
	
	
	МакетОтчетаПроверки = СтруктураПараметров.КэшируемыеДанные.МакетОтчета;;
	
	ОбластьПараметрыЗаголовок = МакетОтчетаПроверки.ПолучитьОбласть("ПараметрыЗаголовок");
	ОбластьПараметрыСтрока = МакетОтчетаПроверки.ПолучитьОбласть("ПараметрыСтрока");
	ОбластьПараметрыПодвал = МакетОтчетаПроверки.ПолучитьОбласть("ПараметрыПодвал");
	
	ТабличныйДокумент.Вывести(ОбластьПараметрыЗаголовок);
	
	СтруктураПараметров.ПараметрыЗаполнения.Свойство("НачалоПериода", НачалоПериода);
	СтруктураПараметров.ПараметрыЗаполнения.Свойство("КонецПериода", КонецПериода);
	СтруктураПараметров.ПараметрыЗаполнения.Свойство("ДополнительныйПериод1", ДополнительныйПериод1);
	СтруктураПараметров.ПараметрыЗаполнения.Свойство("ДополнительныйПериод2", ДополнительныйПериод2);
	СтруктураПараметров.ПараметрыЗаполнения.Свойство("Организация", Организация);
	СтруктураПараметров.ПараметрыЗаполнения.Свойство("ИФО", ИФО);
	СтруктураПараметров.ПараметрыЗаполнения.Свойство("ДополнительныеПараметры", ДополнительныеПараметры);
	
	// Период отчета
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		
		ОбластьПараметрыСтрока.Параметры.ИмяПараметра = "НачалоПериода";
		
		Если ТипЗнч(НачалоПериода) = Тип("Граница") Тогда
			ТекНачалоПериода = НачалоПериода.Значение;
		Иначе
			ТекНачалоПериода = НачалоПериода;
		КонецЕсли;
		
		ОбластьПараметрыСтрока.Параметры.ЗначениеПараметра = ТекНачалоПериода;
		
		ТабличныйДокумент.Вывести(ОбластьПараметрыСтрока);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		
		ОбластьПараметрыСтрока.Параметры.ИмяПараметра = "КонецПериода";
		
		Если ТипЗнч(КонецПериода) = Тип("Граница") Тогда
			ТекКонецПериода = КонецПериода.Значение;
		Иначе
			ТекКонецПериода = КонецПериода;
		КонецЕсли;
		
		ОбластьПараметрыСтрока.Параметры.ЗначениеПараметра = ТекКонецПериода;
		
		ТабличныйДокумент.Вывести(ОбластьПараметрыСтрока);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительныйПериод1) Тогда
			
		ОбластьПараметрыСтрока.Параметры.ИмяПараметра = "Доп. период №1";
		
		Если ТипЗнч(ДополнительныйПериод1) = Тип("Граница") Тогда
			ТекЗначение = ДополнительныйПериод1.Значение;
		Иначе
			ТекЗначение = ДополнительныйПериод1;
		КонецЕсли;
		
		ОбластьПараметрыСтрока.Параметры.ЗначениеПараметра = ТекЗначение;
				
		ТабличныйДокумент.Вывести(ОбластьПараметрыСтрока);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительныйПериод2) Тогда
		
		ОбластьПараметрыСтрока.Параметры.ИмяПараметра = "Доп. период №2";
		
		Если ТипЗнч(ДополнительныйПериод2) = Тип("Граница") Тогда
			ТекЗначение = ДополнительныйПериод2.Значение;
		Иначе
			ТекЗначение = ДополнительныйПериод2;
		КонецЕсли;
		
		ОбластьПараметрыСтрока.Параметры.ЗначениеПараметра = ТекЗначение;
		
		ТабличныйДокумент.Вывести(ОбластьПараметрыСтрока);
		
	КонецЕсли;
	
	// Организация
	Если Организация <> Неопределено Тогда
		
		Если ТипЗнч(Организация) = Тип("Структура") Тогда
			ИмяПараметра = Строка(Организация.ЛевоеЗначение);
			ЗначениеПараметра = Строка(Организация.ПравоеЗначение);
		Иначе
			ИмяПараметра = "Организация";
			ЗначениеПараметра = Организация;
		КонецЕсли;
		
		ОбластьПараметрыСтрока.Параметры.ИмяПараметра = ИмяПараметра;
		ОбластьПараметрыСтрока.Параметры.ЗначениеПараметра = ЗначениеПараметра;
		
		ТабличныйДокумент.Вывести(ОбластьПараметрыСтрока);
		
	КонецЕсли;
	
	// ИФО
	Если ИФО <> Неопределено Тогда
		
		Если ТипЗнч(ИФО) = Тип("Структура") Тогда
			ИмяПараметра = Строка(ИФО.ЛевоеЗначение);
			ЗначениеПараметра = Строка(ИФО.ПравоеЗначение);
		Иначе
			ИмяПараметра = "ИФО";
			ЗначениеПараметра = ИФО;
		КонецЕсли;
		
		ОбластьПараметрыСтрока.Параметры.ИмяПараметра = ИмяПараметра;
		ОбластьПараметрыСтрока.Параметры.ЗначениеПараметра = ЗначениеПараметра;
		
		ТабличныйДокумент.Вывести(ОбластьПараметрыСтрока);
		
	КонецЕсли;
	
	// Дополнительные параметры
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		
		Для каждого ДополнительныйПараметр Из ДополнительныеПараметры Цикл
			
			ЗначениеДопПараметра = ДополнительныйПараметр.Значение;
			Значение = Неопределено;
			Если ТипЗнч(ЗначениеДопПараметра) = Тип("Структура") И ЗначениеДопПараметра.Свойство("ПравоеЗначение", Значение) Тогда
				ЗначениеДопПараметра = ДополнительныйПараметр.Значение.ПравоеЗначение;
			КонецЕсли;
			
			ОбластьПараметрыСтрока.Параметры.ИмяПараметра = ДополнительныйПараметр.Ключ;
			ОбластьПараметрыСтрока.Параметры.ЗначениеПараметра = ЗначениеДопПараметра;
			
			ТабличныйДокумент.Вывести(ОбластьПараметрыСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьПараметрыПодвал);
	
	
КонецПроцедуры

Процедура ВывестиДанныеОбласти(ТабличныйДокумент, ТаблицаДанных, МакетЗаголовокКолонка, МакетСтрокаКолонка)
	
	Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
		
		// Вывод колонок
		Вывести = Истина;
		Для каждого Колонка Из ТаблицаДанных.Колонки Цикл
			
			МакетЗаголовокКолонка.Параметры.Значение = Колонка.Имя;
			Если Вывести Тогда
				ТабличныйДокумент.Вывести(МакетЗаголовокКолонка, 2, "Результат проверки", Истина);
				Вывести = Ложь;
			Иначе
				ТабличныйДокумент.Присоединить(МакетЗаголовокКолонка, 2, "Результат проверки", Истина);
			КонецЕсли;
			
		КонецЦикла;
		
		// Вывод строк
		Вывести = Истина;
		Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			
			Для каждого Колонка Из ТаблицаДанных.Колонки Цикл
				
				МакетСтрокаКолонка.Параметры.Значение = СтрокаТаблицы[Колонка.Имя];
				Если Вывести Тогда
					ТабличныйДокумент.Вывести(МакетСтрокаКолонка, 2, "Результат проверки", Истина);
					Вывести = Ложь;
				Иначе
					ТабличныйДокумент.Присоединить(МакетСтрокаКолонка, 2, "Результат проверки", Истина);
				КонецЕсли;
				
			КонецЦикла;
			Вывести = Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрименитьОформлениеКТаблице(ТабличныйДокумент)
	
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	ОбластьПараметрыПодвал = ТабличныйДокумент.Область("ПараметрыПодвал");
	
	ОбластьДанных = ТабличныйДокумент.Область(ОбластьПараметрыПодвал.Низ+1, 1, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);
	ОбластьДанных.СоздатьФорматСтрок();
	
КонецПроцедуры

Функция ПроверитьУсловиеОбласти(Условие, СтруктураПараметров,СтруктураДопПараметров) Экспорт
	
	//Основная цель условия для выполнения области - определить до выполнения области, 
	//нужно ли будет результат данной области отражать в отчете.
	//В некоторых случаях область выполнять не нужно.
	//Поэтому определения условия следующий:
	//	- если при проверке условия получился результат = ЛОЖЬ, то в этом случае область не выполняется
	//  - если при проверке условия получился результат = ИСТИНА, либо ПОЛУЧИЛИ ИСКЛЮЧЕНИЕ из-за ошибки в выражении
	//		, то в этом случае область все равно выполняется
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА &Условие
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК УсловиеВыполнено";
				   
	Попытка		
		
		ДополнитьПараметрыЗапроса(Запрос,СтруктураПараметров);
		
		Если Запрос.Параметры.Свойство("ИФО") И Запрос.Параметры.ИФО <> Неопределено Тогда
			Запрос.Параметры.Вставить("ЕстьИФО",Истина);
		Иначе
			Запрос.Параметры.Вставить("ЕстьИФО",Ложь);
		КонецЕсли;
		
		Запрос.Параметры.Вставить("ТекущаяКонфигурация",ЗаполнениеОтчетности.ТекущаяКонфигурация());
		
		Для Каждого КлючИЗначение Из СтруктураДопПараметров Цикл
			Запрос.Параметры.Вставить(КлючИЗначение.Ключ,КлючИЗначение.Значение);
		КонецЦикла;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Условие",Условие);
		
		Результат = Запрос.Выполнить().Выбрать();
		Результат.Следующий();
		
		Возврат Результат.УсловиеВыполнено;
		
	Исключение
		Возврат Истина;
	КонецПопытки;
			
КонецФункции

Процедура ДополнитьПараметрыЗапроса(Запрос,ТекСтруктура)
	Для Каждого КлючИЗначение Из ТекСтруктура Цикл
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Структура") Тогда
			Если КлючИЗначение.Значение.Свойство("ПравоеЗначение")
				И КлючИЗначение.Значение.Свойство("СписокЗначений") Тогда
				Если КлючИЗначение.Значение.Свойство("Использование") 
					И КлючИЗначение.Значение.Использование = Истина Тогда 
					Запрос.УстановитьПараметр(КлючИЗначение.Ключ,КлючИЗначение.Значение.СписокЗначений);
				Иначе
					МассивТипов = Новый Массив;
					МассивТипов.Добавить(ТипЗнч(КлючИЗначение.Значение.ПравоеЗначение));
					ОпТипов = Новый ОписаниеТипов(МассивТипов);
					ПустоеЗначениеТипа = ОпТипов.ПривестиЗначение(Неопределено);
					Запрос.УстановитьПараметр(КлючИЗначение.Ключ,ПустоеЗначениеТипа);
				КонецЕсли;
			ИначеЕсли КлючИЗначение.Значение.Свойство("ПравоеЗначение") Тогда
				Если КлючИЗначение.Значение.Свойство("Использование") 
					И КлючИЗначение.Значение.Использование = Истина Тогда
					Запрос.УстановитьПараметр(КлючИЗначение.Ключ,КлючИЗначение.Значение.ПравоеЗначение);
				Иначе
					МассивТипов = Новый Массив;
					МассивТипов.Добавить(ТипЗнч(КлючИЗначение.Значение.ПравоеЗначение));
					ОпТипов = Новый ОписаниеТипов(МассивТипов);
					ПустоеЗначениеТипа = ОпТипов.ПривестиЗначение(Неопределено);
					Запрос.УстановитьПараметр(КлючИЗначение.Ключ,ПустоеЗначениеТипа);
				КонецЕсли;
			Иначе
				ДополнитьПараметрыЗапроса(Запрос,КлючИЗначение.Значение);
			КонецЕсли;
		Иначе
			Запрос.УстановитьПараметр(КлючИЗначение.Ключ,КлючИЗначение.Значение);
		КонецЕсли;			
	КонецЦикла;	
КонецПроцедуры

// Проверка правил заполнения
/////////////////////////////////////////////////////////////////////////


