
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаДоходы.Видимость = Запись.ТипДанных = ПредопределенноеЗначение("Перечисление.ВидыКБК.КДБ");
	Элементы.ГруппаРасходы.Видимость = Запись.ТипДанных = ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДанныхПриИзменении(Элемент)
	
	Если Запись.ТипДанных = ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ") Тогда
		Запись.ВидДохода = "";
		Запись.АналитическийКодДохода = "";
	Иначе
		Запись.ВидРасхода = "";
	КонецЕсли;
	
	Элементы.ГруппаДоходы.Видимость = Запись.ТипДанных = ПредопределенноеЗначение("Перечисление.ВидыКБК.КДБ");
	Элементы.ГруппаРасходы.Видимость = Запись.ТипДанных = ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидРасходаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыРасходовКРБ.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВидДоходаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыДоходовКДБ.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АналитическийКодДоходаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Новый Структура);
	ПараметрыФормы.Отбор.Вставить("Код", СтрРазделить("100,110,120,130,140,150,151,152,153,160,180,190,191,192,193,194,195,196,197,198,199,400,410,420,430,440", ",")); 

	ОткрытьФорму("Справочник.КОСГУ.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура КОСГУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.КОСГУ.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

#КонецОбласти