#Область СлужебныйПрограммныйИнтерфейс

// см. СтандартныеОтчеты.ОтветственноеЛицоОрганизации
Функция ОтветственноеЛицоОрганизации(Знач Организация, Знач Роль) Экспорт
	
	Возврат СтандартныеОтчеты.ОтветственноеЛицоОрганизации(Организация, Роль);
	
КонецФункции

// см. СтандартныеОтчеты.ПолучитьДолжность
Функция ПолучитьДолжность(Знач Сотрудник) Экспорт
	
	Возврат СтандартныеОтчеты.ПолучитьДолжность(Сотрудник);
	
КонецФункции

// см. СтандартныеОтчеты.ПолучитьЛокейл
Функция ПолучитьЛокейл() Экспорт
	Возврат СтандартныеОтчеты.ПолучитьЛокейл();
КонецФункции

// см. СтандартныеОтчеты.ПолучитьНастройкиКолонтитулов
Функция ПолучитьНастройкиКолонтитулов() Экспорт
	Возврат СтандартныеОтчеты.ПолучитьНастройкиКолонтитулов();
КонецФункции

// см. СтандартныеОтчеты.ПолучитьПараметрыРасшифровкиОтчета
Функция ПолучитьПараметрыРасшифровкиОтчета(Адрес, ИдентификаторОбъекта, Расшифровка) Экспорт
	Возврат СтандартныеОтчеты.ПолучитьПараметрыРасшифровкиОтчета(Адрес, ИдентификаторОбъекта, Расшифровка);
КонецФункции

// см. СтандартныеОтчеты.ПолучитьСписокДополнительнойРасшифровки
Функция ПолучитьСписокДополнительнойРасшифровки(ДанныеОтчета, Адрес, Расшифровка, ПоказательСчет, АдресПараметровДляСтандартныхОтчетов) Экспорт
	Возврат СтандартныеОтчеты.ПолучитьСписокДополнительнойРасшифровки(ДанныеОтчета, Адрес, Расшифровка, ПоказательСчет, АдресПараметровДляСтандартныхОтчетов);
КонецФункции

// см. СтандартныеОтчеты.ЗаписатьНастройкиКолонтитулов
Процедура ЗаписатьНастройкиКолонтитулов(Знач Настройка) Экспорт

	СтандартныеОтчеты.ЗаписатьНастройкиКолонтитулов(Настройка);

КонецПроцедуры

#КонецОбласти