#Область ОписаниеПеременных

&НаКлиенте
Перем ТекстЗаголовкаСообщений;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части

	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами". 
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1Сдокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ТекстЗаголовкаСообщений = НСтр("ru='Начисление имущественных налогов'");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части

	ПодготовитьФормуНаСервере();
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.НастройкаОтраженияВУчете" Тогда
		
		ОбработкаВыбораОтраженияВУчетеНаКлиенте(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.РасчетТранспортногоНалога.Форма.ФормаВыбора"
		Или ИсточникВыбора.ИмяФормы = "Документ.РасчетЗемельногоНалога.Форма.ФормаВыбора"
		Или ИсточникВыбора.ИмяФормы = "Документ.РасчетНалогаНаИмущество.Форма.ФормаВыбора" Тогда
			
		Объект.ДокументОснование = ВыбранноеЗначение;
		ВидимостьГруппаДанныеРасчета(ЭтотОбъект);
		ЗаполнитьПоДокументуОснованиюНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ); 
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1Сдокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНалогаПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(Объект.ВидНалога) Тогда
		Объект.ДокументОснование = Неопределено;
	КонецЕсли;
	
	УстановитьОграничениеТипаДокументаОснования(ЭтотОбъект);
	УстановитьДоступностьДокументаОснования(ЭтотОбъект);

	ВидимостьГруппаДанныеРасчета(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) 
		И Объект.УчетныеДанныеОС.Количество() > 0 Тогда
		Объект.УчетныеДанныеОС.Очистить();
		Объект.ПорядокОтраженияВУчете.Очистить();	
	КонецЕсли;
	
	ВидНалогаПриИзмененииНаСервере();

	ВидимостьСуммаКРаспределению(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)

	ВидимостьГруппаДанныеРасчета(ЭтотОбъект);

	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ЗаполнитьПоДокументуОснованиюНаСервере();
	Иначе                                 
		Объект.ПорядокОтраженияВУчете.Очистить();
		Объект.УчетныеДанныеОС.Очистить();
		ВидимостьСуммаКРаспределению(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если (Объект.ДвиженияДокумента.Количество() > 0
		Или Объект.УчетныеДанныеОС.Количество() > 0)
		И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		СтандартнаяОбработка = Ложь;
		ВопросПриВыбореДокументаОснованияАсинх(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВопросПриВыбореДокументаОснованияАсинх(ВыбранноеЗначение)

	ТекстВопроса = НСтр("ru = 'Документ будет перезаполнен. Продолжить?'");
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
	    Возврат;
	КонецЕсли;		
	
	Объект.ДокументОснование = ВыбранноеЗначение;
	ВидимостьГруппаДанныеРасчета(ЭтотОбъект);
	ЗаполнитьПоДокументуОснованиюНаСервере();
	Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьДоступностьДокументаОснования(ЭтотОбъект);
	ВидимостьГруппаДанныеРасчета(ЭтотОбъект);

	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) 
		И Объект.УчетныеДанныеОС.Количество() > 0 Тогда
		Объект.ПорядокОтраженияВУчете.Очистить();	
		Объект.УчетныеДанныеОС.Очистить();
	КонецЕсли;

	ВидимостьСуммаКРаспределению(ЭтотОбъект);

	ОрганизацияПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделЛицевогоСчетаВТаблицеПриИзменении(Элемент)
	
	РазделЛицевогоСчетаВТаблицеПриИзмененииНаКлиенте();
	ВидимостьРазделЛицевогоСчета(ЭтотОбъект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтотОбъект.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтотОбъект);

КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);	

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДвиженияДокумента

&НаКлиенте
Процедура ДвиженияДокументаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ДвиженияДокументаОтражениеВУчете" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуНастройкиОтраженияВУчете(Элемент.ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокументаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.ДвиженияДокумента.ТекущиеДанные;
	
	Если НоваяСтрока И Не Копирование Тогда
		ТекущиеДанные.ВидНалогаИлиПлатежа = ЭтотОбъект.КэшПараметров.Локальные.ВидНалогаИлиПлатежаПоУмолчанию;
		ТекущиеДанные.НалогСборПлатеж 	  = ЭтотОбъект.КэшПараметров.Локальные.НалогСборПлатежПоУмолчанию;
		ТекущиеДанные.КЭК = ЭтотОбъект.КэшПараметров.Локальные.КЭКПоУмолчанию;
		ТекущиеДанные.ОтражениеВУчете = "<...>";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокументаПослеУдаления(Элемент)
	ВидимостьСуммаКРаспределению(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокументаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ВидимостьСуммаКРаспределению(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокументаВидНалогаИлиПлатежаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияДокумента.ТекущиеДанные;
	ТекущиеДанные.НалогСборПлатеж = НалогСборПлатежПоУмолчанию(Объект.Организация, ТекущиеДанные.ВидНалогаИлиПлатежа);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокументаКФОПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияДокумента.ТекущиеДанные;
	КФОПриИзмененииВСтроке(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокументаСуммаПриИзменении(Элемент)
	ВидимостьСуммаКРаспределению(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ПерезаполнитьПоДокументуОснованию(Команда)
	
	Если Объект.ДвиженияДокумента.Количество() > 0
		Или Объект.УчетныеДанныеОС.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru = 'Документ будет перезаполнен. Продолжить?'");
	    Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений);
	    Если Ответ <> КодВозвратаДиалога.Да Тогда
	        Возврат;
	    КонецЕсли;		
	КонецЕсли;

	ЗаполнитьПоДокументуОснованиюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьПоРасчету(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ВидНалога) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Вид налога'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Объект.ВидНалога");
		Возврат;
	КонецЕсли;

	Если Объект.ДвиженияДокумента.Количество() > 0
		Или Объект.УчетныеДанныеОС.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru = 'Документ будет перезаполнен. Продолжить?'");
	    Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений);
	    Если Ответ <> КодВозвратаДиалога.Да Тогда
	        Возврат;
	    КонецЕсли;		
		
	КонецЕсли;
	
	ВыбратьДокументОснованиеИПродолжитьЗаполнение();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеПоИсточникам(Команда)

	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Расчет налога'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ОткрытьФормуРаспределенияПоИсточникам();	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1Сдокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("КЭКПоУмолчанию",
		БухгалтерскийУчетПовтИсп.КЭКПоКоду("291"));

	ОбновитьКэшПараметровНалогПоУмолчанию();
		
	УстановитьОграничениеТипаДокументаОснования(ЭтотОбъект);
	УстановитьДоступностьДокументаОснования(ЭтотОбъект);

	ВидимостьРазделЛицевогоСчета(ЭтотОбъект);
	ВидимостьГруппаДанныеРасчета(ЭтотОбъект);
	ВидимостьСуммаКРаспределению(ЭтотОбъект);

	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

#Область ЗаполнениеДокумента

&НаКлиенте
Процедура ВыбратьДокументОснованиеИПродолжитьЗаполнение()
	
	ИмяДокумента = ИмяДокументаПоВидуНалога(Объект.ВидНалога);
	
	Если ИмяДокумента = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	СтруктураОтбора	= Новый Структура;
	СтруктураОтбора.Вставить("Организация",	Объект.Организация);
	СтруктураОтбора.Вставить("ПометкаУдаления",	Ложь);
	
	СтруктураПараметров	= Новый Структура;
	СтруктураПараметров.Вставить("Отбор",              СтруктураОтбора);
	СтруктураПараметров.Вставить("РежимВыбора",        Истина);
	СтруктураПараметров.Вставить("МножественныйВыбор", Ложь);
	
	ОткрытьФорму(СтрШаблон("Документ.%1.ФормаВыбора", ИмяДокумента), СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументуОснованиюНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьПоРасчетуИмущественногоНалога();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

	ВидимостьРазделЛицевогоСчета(ЭтотОбъект);
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	ВидимостьСуммаКРаспределению(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиОтраженияВУчете(ДанныеСтроки)
	
	Если Не ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("ИФО", ДанныеСтроки.ИФО);
	ПараметрыФормы.Вставить("КФО", ДанныеСтроки.КФО);
	
	ПараметрыФормы.Вставить("КПС", 
		?(ЗначениеЗаполнено(ДанныеСтроки.КПСДт), ДанныеСтроки.КПСДт, ДанныеСтроки.КПС));
	
	ПараметрыФормы.Вставить("Подразделение", 
		?(ЗначениеЗаполнено(ДанныеСтроки.ПодразделениеДт), ДанныеСтроки.ПодразделениеДт, ДанныеСтроки.Подразделение));
	
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	ПараметрыФормы.Вставить("ТолькоПросмотрКФО", 		Истина);
	ПараметрыФормы.Вставить("ТолькоПросмотрКПС", 		Ложь);
	ПараметрыФормы.Вставить("ТолькоПросмотрКЭК", 		Ложь);
	ПараметрыФормы.Вставить("ВидимостьКПС", 			Истина);
	ПараметрыФормы.Вставить("ВидимостьКЭК", 			Ложь);
	ПараметрыФормы.Вставить("ВидимостьПодразделение", 	Истина);
	ПараметрыФормы.Вставить("ВидимостьКоличество", 		Ложь);
	
	// Бухгалтерский учет
	ПараметрыФормы.Вставить("Счет",      ДанныеСтроки.СчетДт);
	ПараметрыФормы.Вставить("Субконто1", ДанныеСтроки.СубконтоДт1);
	ПараметрыФормы.Вставить("Субконто2", ДанныеСтроки.СубконтоДт2);
	ПараметрыФормы.Вставить("Субконто3", ДанныеСтроки.СубконтоДт3);
	
	ПараметрыФормы.Вставить("ЗаголовокФормы", 			НСтр("ru = 'Настройка отражения расходов в учете'"));
	ПараметрыФормы.Вставить("ЗаголовокСчет", 			НСтр("ru = 'Счет дебета'"));
	ПараметрыФормы.Вставить("ЗаголовокПодразделение", 	НСтр("ru = 'Подразделение дебета'"));
	
	ПараметрыСчета = Новый Структура;
	ПараметрыСчета.Вставить("ОграниченияСписокСчетов", 
		БухгалтерскийУчетКлиентСервер.СписокСчетов("106.00,109.00,110.00,401.20", Объект.Дата, , Объект.Организация));
	ПараметрыСчета.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	ПараметрыСчета.Вставить("Организация", 			Объект.Организация);
	ПараметрыСчета.Вставить("ИФО", 					ДанныеСтроки.ИФО);
	ПараметрыФормы.Вставить("ПараметрыСчета", 		ПараметрыСчета);
	
	ПараметрыФормы.Вставить("ЕстьНДС", Ложь);
	ПараметрыФормы.Вставить("НДСКРаспределению", Ложь);
	ПараметрыФормы.Вставить("СчетУчетаНДС", Неопределено);

	ПараметрыФормы.Вставить("Валюта", ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета);
	
	// Налоговый учет
	ПараметрыФормы.Вставить("СчетНУ",      ДанныеСтроки.СчетНУ);
	ПараметрыФормы.Вставить("СубконтоНУ1", ДанныеСтроки.СубконтоНУ1);
	ПараметрыФормы.Вставить("СубконтоНУ2", ДанныеСтроки.СубконтоНУ2);
	ПараметрыФормы.Вставить("СубконтоНУ3", ДанныеСтроки.СубконтоНУ3);
	
	ПараметрыСчетаНУ = Новый Структура("ОграниченияСписокСчетов",
		БухгалтерскийУчетКлиентСервер.СписокСчетов("Н08,Н15,Н20,Н25,Н26,Н44,Н91.02", Объект.Дата, , Объект.Организация));
	ПараметрыФормы.Вставить("ПараметрыСчетаНУ", ПараметрыСчетаНУ);
	
	// УСН
	ПараметрыФормы.Вставить("ОтражениеВУСН", ДанныеСтроки.ОтражениеВУСН);
	Если ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		ПараметрыФормы.Вставить("ЕстьНалоговыйУчет", Ложь);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ОтразитьВКарточкеКапвложений", ДанныеСтроки.ОтразитьВКарточкеКапвложений);
	ПараметрыФормы.Вставить("КарточкаКапвложений", ДанныеСтроки.КарточкаКапвложений);
	
	ОткрытьФорму("ОбщаяФорма.НастройкаОтраженияВУчете", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораОтраженияВУчетеНаКлиенте(СтруктураОтражениеВУчете)
	
	ТекущиеДанные = Элементы.ДвиженияДокумента.ТекущиеДанные;
 
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтруктураОтражениеВУчете,, "КФО, КПС, КЭК"); 
	
	Если НЕ ТекущиеДанные.КПС = СтруктураОтражениеВУчете.КПС Тогда
		ТекущиеДанные.КПСДт = СтруктураОтражениеВУчете.КПС;
	Иначе
		ТекущиеДанные.КПСДт = Неопределено;
	КонецЕсли;
	
	Если НЕ ТекущиеДанные.Подразделение = СтруктураОтражениеВУчете.Подразделение Тогда
		ТекущиеДанные.ПодразделениеДт = СтруктураОтражениеВУчете.Подразделение;
	Иначе
		ТекущиеДанные.ПодразделениеДт = Неопределено;
	КонецЕсли;
	
	ТекущиеДанные.СчетДт      = СтруктураОтражениеВУчете.Счет;
	ТекущиеДанные.СубконтоДт1 = СтруктураОтражениеВУчете.Субконто1;
	ТекущиеДанные.СубконтоДт2 = СтруктураОтражениеВУчете.Субконто2;
	ТекущиеДанные.СубконтоДт3 = СтруктураОтражениеВУчете.Субконто3;
	
	ОбновитьТекстОтражениеВУчете(ЭтотОбъект.КэшПараметров.УчетнаяПолитика, ТекущиеДанные);

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРаспределенияПоИсточникам()
	
	Если Не ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилищеУчетныеДанныеОС();
	
	ПараметрыЗакрытияФормы = Новый Структура;
	ПараметрыЗакрытияФормы.Вставить("АдресВременногоХранилища", АдресВременногоХранилища);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("АдресВременногоХранилища", АдресВременногоХранилища);
	ПараметрыОткрытияФормы.Вставить("ТолькоПросмотр", 			ТолькоПросмотр);
	ПараметрыОткрытияФормы.Вставить("Дата",
		?(Объект.Ссылка.Пустая(), КонецДня(Объект.Дата), Объект.Дата));
	ПараметрыОткрытияФормы.Вставить("Организация", 				Объект.Организация);
	ПараметрыОткрытияФормы.Вставить("ВидНалога", 				Объект.ВидНалога);
	ПараметрыОткрытияФормы.Вставить("ДокументОснование", 		Объект.ДокументОснование);
	ПараметрыОткрытияФормы.Вставить("РазделЛицевогоСчетаВТаблице", Объект.РазделЛицевогоСчетаВТаблице);
	
	ПараметрыОткрытияФормы.Вставить("КэшПараметров", 			Новый Структура);
	ПараметрыОткрытияФормы.КэшПараметров.Вставить("ВалютаРегламентированногоУчета",
		ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета);
	ПараметрыОткрытияФормы.КэшПараметров.Вставить("ИспользоватьУчетПоИФО",
		ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО);
		
	ПараметрыОткрытияФормы.КэшПараметров.Вставить("УчетнаяПолитика", Новый Структура);
	ПараметрыОткрытияФормы.КэшПараметров.УчетнаяПолитика.Вставить("ПлательщикНалогаНаПрибыль",
		ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ПлательщикНалогаНаПрибыль);
 	ПараметрыОткрытияФормы.КэшПараметров.УчетнаяПолитика.Вставить("ПрименяетсяУСНДоходыМинусРасходы",
		ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы);
		
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьРаспределениеПоИсточникам",
		ЭтотОбъект, ПараметрыЗакрытияФормы);
	
	ОткрытьФорму("Обработка.РаспределениеНалогаПоИсточникамФинансирования.Форма.Форма", ПараметрыОткрытияФормы, , , , ,
		ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьРаспределениеПоИсточникам(РезультатЗакрытия, ПараметрыЗакрытияФормы) Экспорт

	Если РезультатЗакрытия = "ПеренестиВДокумент" Тогда
		
		АдресВременногоХранилища = ПараметрыЗакрытияФормы.АдресВременногоХранилища;
		ЗаполнитьРаспределениеПоИсточникамСервере(ПараметрыЗакрытияФормы.АдресВременногоХранилища);
		Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры
	
&НаСервере
Функция ПоместитьВоВременноеХранилищеУчетныеДанныеОС()

	ТаблицыРаспределения = Новый Структура;
	ТаблицыРаспределения.Вставить("УчетныеДанныеОС", Объект.УчетныеДанныеОС.Выгрузить());
	ТаблицыРаспределения.Вставить("ПорядокОтраженияВУчете", Объект.ПорядокОтраженияВУчете.Выгрузить());

	Возврат ПоместитьВоВременноеХранилище(ТаблицыРаспределения, УникальныйИдентификатор);

КонецФункции 

&НаСервере
Процедура ЗаполнитьРаспределениеПоИсточникамСервере(АдресВременногоХранилища)

	ТаблицыРаспределения = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
    Объект.УчетныеДанныеОС.Загрузить(ТаблицыРаспределения.УчетныеДанныеОС);
    Объект.ПорядокОтраженияВУчете.Загрузить(ТаблицыРаспределения.ПорядокОтраженияВУчете);
	
	ТаблицаБухгалтерскийУчет = Документы.НачислениеИмущественныхНалогов.СформироватьТаблицуБухгалтерскийУчет(
		ТаблицыРаспределения.ПорядокОтраженияВУчете);
	
	Объект.ДвиженияДокумента.Загрузить(ТаблицаБухгалтерскийУчет);

	ЗаполнитьДобавленныеКолонкиТаблиц();
	ВидимостьСуммаКРаспределению(ЭтотОбъект);

КонецПроцедуры 

#КонецОбласти

#Область ЗаполнениеДобавленныхКолонок

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

	Для Каждого СтрокаТаблицы Из Объект.ДвиженияДокумента Цикл
		ОбновитьТекстОтражениеВУчете(ЭтотОбъект.КэшПараметров.УчетнаяПолитика, СтрокаТаблицы);
	КонецЦикла;

	Для Каждого СтрокаТаблицы Из Объект.УчетныеДанныеОС Цикл
		ОбновитьДобавленныеКолонкиУчетныеДанныеОС(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры
		
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстОтражениеВУчете(УчетнаяПолитика, СтрокаТаблицы)
	
	ПоляФормы = Новый Структура;
	ПоляФормы.Вставить("КПС",			"КПСДт");
	ПоляФормы.Вставить("Подразделение",	"ПодразделениеДт");
	ПоляФормы.Вставить("Счет",			"СчетДт");
	ПоляФормы.Вставить("Субконто1",		"СубконтоДт1");
	ПоляФормы.Вставить("Субконто2",		"СубконтоДт2");
	ПоляФормы.Вставить("Субконто3",		"СубконтоДт3");
	
	ОтражатьВНалоговомУчете = УчетнаяПолитика.ПлательщикНалогаНаПрибыль
		И НалоговыйУчетКлиентСервер.ВедетсяНалоговыйУчетПоКФО(СтрокаТаблицы.КФО);
	
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("ОтражатьВНалоговомУчете", ОтражатьВНалоговомУчете);
	ПараметрыОбъекта.Вставить("ОтражатьВУСНДоходыМинусРасходы", Ложь);
	ПараметрыОбъекта.Вставить("ЕстьНДС", Ложь);
	ПараметрыОбъекта.Вставить("ЕстьКПС",
		НЕ СтрокаТаблицы.КПС = СтрокаТаблицы.КПСДт И ЗначениеЗаполнено(СтрокаТаблицы.КПСДт));
	ПараметрыОбъекта.Вставить("ЕстьКЭК", Ложь);
	ПараметрыОбъекта.Вставить("ЕстьПодразделение",
		НЕ СтрокаТаблицы.Подразделение = СтрокаТаблицы.ПодразделениеДт И ЗначениеЗаполнено(СтрокаТаблицы.ПодразделениеДт));
	ПараметрыОбъекта.Вставить("ОтразитьВКарточкеКапвложений", СтрокаТаблицы.ОтразитьВКарточкеКапвложений);
	ПараметрыОбъекта.Вставить("КарточкаКапвложений", СтрокаТаблицы.КарточкаКапвложений);
	
	БухгалтерскийУчетКлиентСервер.ЗаполнитьДобавленныеКолонкиОтражениеВУчете(СтрокаТаблицы, ПараметрыОбъекта, ПоляФормы);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДобавленныеКолонкиУчетныеДанныеОС(СтрокаТаблицы)

	ПодчиненныеСтроки = Объект.ПорядокОтраженияВУчете.НайтиСтроки(
		Новый Структура("ИдентификаторСтроки", СтрокаТаблицы.ИдентификаторСтроки));
		
	МассивОпределений = Новый Массив;
	Для каждого СтрокаТаблицыПорядокОтражения Из ПодчиненныеСтроки Цикл
		МассивОпределений.Добавить(ТекстОтражениеВУчетеКратко(СтрокаТаблицыПорядокОтражения));
	КонецЦикла;	
	
	СтрокаТаблицы.ОтражениеВУчетеКратко = ТекстОтражениеВУчетеКраткоИзМассиваОпределений(МассивОпределений);

КонецПроцедуры  

&НаСервере
Функция ТекстОтражениеВУчетеКратко(СтрокаТаблицы)
	Возврат СтрШаблон("%1.%2 К.:%3",
		СтрокаТаблицы.КФО,
		СтрокаТаблицы.СчетДт,
		XMLСтрока(СтрокаТаблицы.Коэффициент));
КонецФункции

&НаСервере
Функция ТекстОтражениеВУчетеКраткоИзМассиваОпределений(МассивОпределений)

	Возврат СтрСоединить(МассивОпределений, Символы.ПС);	

КонецФункции  

#КонецОбласти

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидНалогаПриИзмененииНаСервере()
	
	ОбновитьКэшПараметровНалогПоУмолчанию();
	
	Для каждого Строка Из Объект.ДвиженияДокумента Цикл
		
		Строка.ВидНалогаИлиПлатежа = ЭтотОбъект.КэшПараметров.Локальные.ВидНалогаИлиПлатежаПоУмолчанию;
		Строка.НалогСборПлатеж 	   = ЭтотОбъект.КэшПараметров.Локальные.НалогСборПлатежПоУмолчанию;
		
		Строка.КПС 		= КПСУчетаНалогаПоУмолчанию(Объект.ВидНалога, Строка.КПС, Объект.Дата);
		Строка.КПСДт 	= КПСУчетаНалогаПоУмолчанию(Объект.ВидНалога, Строка.КПСДт, Объект.Дата);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделЛицевогоСчетаВТаблицеПриИзмененииНаКлиенте()
	
	Если Объект.ДвиженияДокумента.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Если Объект.РазделЛицевогоСчетаВТаблице = 0
		И Не ЗначениеЗаполнено(Объект.РазделЛицевогоСчета) Тогда
		
		Объект.РазделЛицевогоСчета = Объект.ДвиженияДокумента[0].РазделЛицевогоСчета;
		
	ИначеЕсли Объект.РазделЛицевогоСчетаВТаблице = 1
		И ЗначениеЗаполнено(Объект.РазделЛицевогоСчета) Тогда
		
		ЗаполнитьРазделЛицевогоСчетаВТабличнойЧасти();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделЛицевогоСчетаВТабличнойЧасти()
	
	РазделЛицевогоСчета = Объект.РазделЛицевогоСчета;	
	ДопустимыеКФО = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазделыЛицевыхСчетовДопустимыеКФО.КФО КАК КФО
		|ИЗ
		|	Справочник.РазделыЛицевыхСчетов.ДопустимыеКФО КАК РазделыЛицевыхСчетовДопустимыеКФО
		|ГДЕ
		|	РазделыЛицевыхСчетовДопустимыеКФО.Ссылка = &РазделЛицевогоСчета";
	
	Запрос.УстановитьПараметр("РазделЛицевогоСчета", РазделЛицевогоСчета);
	
	ВыборкаДопустимыеКФО = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДопустимыеКФО.Следующий() Цикл
		ДопустимыеКФО.Вставить(ВыборкаДопустимыеКФО.КФО, Истина);		
	КонецЦикла;
	
	Для каждого Строка Из Объект.ДвиженияДокумента Цикл
		Если ДопустимыеКФО[Строка.КФО] <> Неопределено Тогда
			Строка.РазделЛицевогоСчета = РазделЛицевогоСчета;		
		КонецЕсли;	
	КонецЦикла;
	Для каждого Строка Из Объект.ПорядокОтраженияВУчете Цикл
		Если ДопустимыеКФО[Строка.КФО] <> Неопределено Тогда
			Строка.РазделЛицевогоСчета = РазделЛицевогоСчета;		
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзмененииВСтроке(ТекущиеДанные)
	
	ОтражатьВНалоговомУчете = ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ПлательщикНалогаНаПрибыль
		И НалоговыйУчетКлиентСервер.ВедетсяНалоговыйУчетПоКФО(ТекущиеДанные.КФО);
	Если НЕ ОтражатьВНалоговомУчете Тогда
		ТекущиеДанные.СчетНУ      = Неопределено;
		ТекущиеДанные.СубконтоНУ1 = Неопределено;
		ТекущиеДанные.СубконтоНУ2 = Неопределено;
		ТекущиеДанные.СубконтоНУ3 = Неопределено;
	КонецЕсли;
	
	ОбновитьТекстОтражениеВУчете(ЭтотОбъект.КэшПараметров.УчетнаяПолитика, ТекущиеДанные);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОграничениеТипаДокументаОснования(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы; 

	МассивТипов = Новый Массив;
	
	ИмяДокумента = ИмяДокументаПоВидуНалога(Объект.ВидНалога);
	
	Если ИмяДокумента = Неопределено Тогда
		МассивТипов.Добавить(Тип("Неопределено"));
	Иначе	
		МассивТипов.Добавить(Тип(СтрШаблон("ДокументСсылка.%1", ИмяДокумента)));
	КонецЕсли;
	
	ОграничениеТипаДокументаОснования = Новый ОписаниеТипов(МассивТипов);
	
	Элементы.ДокументОснование.ОграничениеТипа = ОграничениеТипаДокументаОснования;
	Объект.ДокументОснование = ОграничениеТипаДокументаОснования.ПривестиЗначение(Объект.ДокументОснование);
 	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДокументаОснования(Форма)

	Объект   = Форма.Объект;
	Элементы = Форма.Элементы; 

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДокументОснование",
		"Доступность", ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.ВидНалога));

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаполнитьПоДокументуОснованию",
		"Доступность", ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.ВидНалога));

КонецПроцедуры

// Управление видимостью раздела лицевого счета
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
//
&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьРазделЛицевогоСчета(Форма)

	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РазделЛицевогоСчета",
		"Видимость", Объект.РазделЛицевогоСчетаВТаблице = 0);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДвиженияДокументаРазделЛицевогоСчета",
		"Видимость", Объект.РазделЛицевогоСчетаВТаблице = 1);
	
КонецПроцедуры

// Управление видимостью страницы Данные расчета
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
//
&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьГруппаДанныеРасчета(Форма)

	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ВидимостьБыла = Элементы.ГруппаДанныеРасчета.Видимость;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДанныеРасчета",
		"Видимость", ЗначениеЗаполнено(Объект.ДокументОснование));
	
	Если ВидимостьБыла <> Элементы.ГруппаДанныеРасчета.Видимость Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаБухгалтерскийУчет;
	КонецЕсли;
	
	Если Элементы.ГруппаДанныеРасчета.Видимость Тогда
		
		ВидимостьКБКНалога = Объект.ВидНалога = ПредопределенноеЗначение("Перечисление.ВидыИмущественныхНалогов.ЗемельныйНалог");
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УчетныеДанныеОСКБК",
			"Видимость", ВидимостьКБКНалога);
	
	КонецЕсли;
	
КонецПроцедуры

// Управление видимостью предупреждающей надписи Сумма к распределению.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
//
&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьСуммаКРаспределению(Форма)

	Объект   = Форма.Объект; 
	Элементы = Форма.Элементы;
	
	Видимость = ЗначениеЗаполнено(Объект.ДокументОснование) И Объект.УчетныеДанныеОС.Количество() > 0
		И Объект.ДвиженияДокумента.Итог("Сумма") <> Объект.УчетныеДанныеОС.Итог("Сумма");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСуммаКРаспределению",
		"Видимость", Видимость);
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УчетныеДанныеОСОсновноеСредство");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор, "Объект.УчетныеДанныеОС.ОсновноеСредство",,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru = 'по всем'"));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "УчетныеДанныеОСИнвентарныйНомер");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор, "Объект.УчетныеДанныеОС.ИнвентарныйНомер",,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru = 'по всем'"));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКэшПараметровНалогПоУмолчанию()

	НалогиПоУмолчанию = Новый Соответствие;
	НалогиПоУмолчанию.Вставить(Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог,
		Справочники.ВидыНалоговИПлатежей.Транспортный);
	НалогиПоУмолчанию.Вставить(Перечисления.ВидыИмущественныхНалогов.НалогНаИмущество,
		Справочники.ВидыНалоговИПлатежей.ИмуществоОрганизаций);
		
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВидНалогаИлиПлатежаПоУмолчанию",
		НалогиПоУмолчанию[Объект.ВидНалога]);
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("НалогСборПлатежПоУмолчанию",
		НалогСборПлатежПоУмолчанию(Объект.Организация, НалогиПоУмолчанию[Объект.ВидНалога]));

КонецПроцедуры

// Возвращает подходящее значение по виду налога и организации
//
// Параметры:
//  Организация  		- СправочникСсылка.Организации
//  ВидНалогаИлиПлатежа - СправочникСсылка.ВидНалогаИлиПлатежа
//
// Возвращаемое значение:
//   СправочникСсылка.НалогиИПлатежиОрганизации
//
&НаСервереБезКонтекста
Функция НалогСборПлатежПоУмолчанию(Знач Организация, Знач ВидНалогаИлиПлатежа)
	
	Возврат Справочники.НалогиИПлатежиОрганизации.НалогСборПлатежПоУмолчанию(Организация, ВидНалогаИлиПлатежа); 
	
КонецФункции

// Возвращает рекомендуемый КПС для учета налога по объекту налогообложения.
//
// Параметры:
//  ВидНалога	- ПеречислениеСсылка.ВидыИмущественныхНалогов
//  КПС 		- СправочникСсылка.КлассификационныеПризнакиСчетов - КПС объекта налогообложения
//  Дата 		- Дата
//
// Возвращаемое значение:
//   СправочникСсылка.КлассификационныеПризнакиСчетов - Рекомендуемый КПС
//
&НаСервереБезКонтекста
Функция КПСУчетаНалогаПоУмолчанию(Знач ВидНалога, Знач КПС, Знач Дата)

	Возврат 
		УправлениеОсновнымиСредствами.КПСУчетаНалогаПоУмолчанию(ВидНалога, КПС, Дата);

КонецФункции 

// Возвращает имя документа по виду налога.
//
// Параметры:
//  ВидНалога 	- ПеречислениеСсылка.ВидыИмущественныхНалогов
//
// Возвращаемое значение:
//   Строка, Неопределено
//
&НаКлиентеНаСервереБезКонтекста
Функция ИмяДокументаПоВидуНалога(ВидНалога)
	
	Если ВидНалога = ПредопределенноеЗначение("Перечисление.ВидыИмущественныхНалогов.ТранспортныйНалог") Тогда
		ИмяДокумента = "РасчетТранспортногоНалога";
	ИначеЕсли ВидНалога = ПредопределенноеЗначение("Перечисление.ВидыИмущественныхНалогов.ЗемельныйНалог") Тогда
		ИмяДокумента = "РасчетЗемельногоНалога";
	ИначеЕсли ВидНалога = ПредопределенноеЗначение("Перечисление.ВидыИмущественныхНалогов.НалогНаИмущество") Тогда
		ИмяДокумента = "РасчетНалогаНаИмущество";
	Иначе
		ИмяДокумента = Неопределено;
	КонецЕсли;

	Возврат ИмяДокумента;
КонецФункции 

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
