
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПоДаннымОснования();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Список.Количество() = 1 Тогда
		Отказ = Истина;
		Результат = Новый Структура("ЦМО, КФО, Подразделение");
		Для Каждого Строка Из Список Цикл
			ЗаполнитьЗначенияСвойств(Результат, Строка);
		КонецЦикла;
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, Результат);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		УстановитьОтборСлужебнойТаблицы(Элементы.Список.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗакрытьСВыбором();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ЗакрытьСВыбором();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьСВыбором()
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Закрыть();
	КонецЕсли;
	
	Результат = Новый Структура("ЦМО, КФО, Подразделение");
	ЗаполнитьЗначенияСвойств(Результат, Элементы.Список.ТекущиеДанные);
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСлужебнойТаблицы(ТекущиеДанные)
	Отбор = Новый Структура;
	Отбор.Вставить("ЦМО", ТекущиеДанные.ЦМО);
	Отбор.Вставить("КФО", ТекущиеДанные.КФО);
	Отбор.Вставить("Подразделение", ТекущиеДанные.Подразделение);
	
	Элементы.НоменклатураДокумента.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымОснования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаЗаполненияФормы(Параметры.Основание);
	Запрос.УстановитьПараметр("Ссылка", Параметры.Основание);

	ДанныеДокумента = Запрос.Выполнить().Выгрузить();
	НоменклатураДокумента.Загрузить(ДанныеДокумента);
	ДанныеДокумента.Свернуть("ЦМО, КФО, Подразделение");
	Список.Загрузить(ДанныеДокумента);
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаЗаполненияФормы(Ссылка)
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТребованиеНакладная0315006") Тогда
		Возврат
		"ВЫБРАТЬ
		|	ТребованиеНакладная0315006.ЦМОПолучатель КАК ЦМО,
		|	ТребованиеНакладная0315006.ПодразделениеПолучатель КАК Подразделение,
		|	ТребованиеНакладная0315006Материалы.Номенклатура КАК Номенклатура,
		|	ТребованиеНакладная0315006Материалы.Номенклатура.БСО КАК БСО,
		|	ТребованиеНакладная0315006Материалы.Количество КАК Количество,
		|	ТребованиеНакладная0315006Материалы.КФО КАК КФО
		|ИЗ
		|	Документ.ТребованиеНакладная0315006.Материалы КАК ТребованиеНакладная0315006Материалы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТребованиеНакладная0315006 КАК ТребованиеНакладная0315006
		|		ПО ТребованиеНакладная0315006Материалы.Ссылка = ТребованиеНакладная0315006.Ссылка
		|ГДЕ
		|	ТребованиеНакладная0315006.Ссылка = &Ссылка
		|	И ТребованиеНакладная0315006Материалы.Ссылка = &Ссылка
		|	И ТребованиеНакладная0315006Материалы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.БСО)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КФО,
		|	ТребованиеНакладная0315006Материалы.НомерСтроки";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.АктСписанияМЗ") Тогда
		Возврат
		"ВЫБРАТЬ
		|	АктСписанияМЗ.ЦМООтправитель КАК ЦМО,
		|	АктСписанияМЗ.ПодразделениеОтправитель КАК Подразделение,
		|	АктСписанияМЗМатериалы.Номенклатура КАК Номенклатура,
		|	АктСписанияМЗМатериалы.Номенклатура.БСО КАК БСО,
		|	АктСписанияМЗМатериалы.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА АктСписанияМЗ.КФОВТабличнойЧасти
		|			ТОГДА АктСписанияМЗМатериалы.КФО
		|		ИНАЧЕ АктСписанияМЗ.КФО
		|	КОНЕЦ КАК КФО
		|ИЗ
		|	Документ.АктСписанияМЗ.Материалы КАК АктСписанияМЗМатериалы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктСписанияМЗ КАК АктСписанияМЗ
		|		ПО АктСписанияМЗМатериалы.Ссылка = АктСписанияМЗ.Ссылка
		|ГДЕ
		|	АктСписанияМЗ.Ссылка = &Ссылка
		|	И АктСписанияМЗМатериалы.Ссылка = &Ссылка
		|	И АктСписанияМЗМатериалы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.БСО)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КФО,
		|	АктСписанияМЗМатериалы.НомерСтроки";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВедомостьНаВыдачуМЗНаНуждыУчреждения") Тогда
		Возврат
		"ВЫБРАТЬ
		|	ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериалы.ЦМОПолучатель КАК ЦМО,
		|	ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериалы.ПодразделениеПолучатель КАК Подразделение,
		|	ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериалы.Номенклатура КАК Номенклатура,
		|	ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериалы.Номенклатура.БСО КАК БСО,
		|	ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериалы.Количество КАК Количество,
		|	ВедомостьНаВыдачуМЗНаНуждыУчреждения.КФО КАК КФО
		|ИЗ
		|	Документ.ВедомостьНаВыдачуМЗНаНуждыУчреждения.МатериальныеЗапасы КАК ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериалы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыдачуМЗНаНуждыУчреждения КАК ВедомостьНаВыдачуМЗНаНуждыУчреждения
		|		ПО ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериалы.Ссылка = ВедомостьНаВыдачуМЗНаНуждыУчреждения.Ссылка
		|ГДЕ
		|	ВедомостьНаВыдачуМЗНаНуждыУчреждения.Ссылка = &Ссылка
		|	И ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериалы.Ссылка = &Ссылка
		|	И ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериалы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.БСО)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КФО,
		|	ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериалы.НомерСтроки";
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не известный тип документа (%1) в функции Документы.ПоступлениеБСО.Формы.ФормаВыбораКФОИлиЦМО.ТекстЗапросаЗаполненияФормы'"), ТипЗнч(Ссылка));
	КонецЕсли;
		
КонецФункции

#КонецОбласти

