
#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает студента в форме по данным переданного отбора.
//
&НаСервере
Процедура УстановитьСтудента()
	
	Если Параметры.Свойство("Отбор") Тогда
		
		Если Параметры.Отбор.Свойство("Студент") Тогда
		
			ОтборСтудент = Параметры.Отбор.Студент;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборСтудент", "ТолькоПросмотр", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборСтудент", "КнопкаОткрытия", Ложь);
			
		КонецЕсли; 
		
		Если Параметры.Отбор.Свойство("Регистратор") Тогда
		
			ОтборРегистратор = Параметры.Отбор.Регистратор;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборРегистратор", "ТолькоПросмотр", Истина);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьСтудента()

#КонецОбласти



#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСтудента();
	
	Элементы.Студент.Видимость = НЕ ЗначениеЗаполнено(ОтборСтудент);
	Элементы.Регистратор.Видимость = НЕ ЗначениеЗаполнено(ОтборРегистратор);
	Элементы.ГруппаОтборыПериод.Видимость = ЗначениеЗаполнено(НачалоНачисления) ИЛИ ЗначениеЗаполнено(ОкончаниеНачисления);
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборСтудентПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Студент", ОтборСтудент, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборСтудент));
	Элементы.Студент.Видимость = НЕ ЗначениеЗаполнено(ОтборСтудент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборРегистраторПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Регистратор", ОтборРегистратор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборРегистратор));
	Элементы.Регистратор.Видимость = НЕ ЗначениеЗаполнено(ОтборРегистратор);
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИнтервалДатДляПросмотра(Команда)
	
	ПараметрыФормы = Новый Структура("НачалоПериода, КонецПериода", НачалоНачисления, ОкончаниеНачисления);
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ВыбратьПериод_Выбор", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.НастройкаПериодаОтчета", ПараметрыФормы,,,,,ОписаниеОповещенияОЗавершении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиОповещений

&НаКлиенте
Процедура ВыбратьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "НачалоНачисления", РезультатВыбора.НачалоПериода, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , ЗначениеЗаполнено(РезультатВыбора.НачалоПериода));
		НачалоНачисления = РезультатВыбора.НачалоПериода;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ОкончаниеНачисления", РезультатВыбора.КонецПериода, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, , ЗначениеЗаполнено(РезультатВыбора.КонецПериода));
		ОкончаниеНачисления = РезультатВыбора.КонецПериода;
	КонецЕсли;
	
	Элементы.ГруппаОтборыПериод.Видимость = ЗначениеЗаполнено(НачалоНачисления) ИЛИ  ЗначениеЗаполнено(ОкончаниеНачисления);
	
КонецПроцедуры

#КонецОбласти