#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем НаборПоказателей Экспорт; // Массив показателей отчета
Перем ИмяМакетПроводок;         // Имя макета проводок

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СтандартныеОтчеты.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РАЗДЕЛ ИНИЦИАЛИЗАЦИИ

НаборПоказателей = Новый Массив;
НаборПоказателей.Добавить("БУ");
НаборПоказателей.Добавить("НеУчитываетсяНУ");
НаборПоказателей.Добавить("ЕНВД");
НаборПоказателей.Добавить("НДС");
НаборПоказателей.Добавить("ВалютнаяСумма");
НаборПоказателей.Добавить("Количество");

#КонецЕсли

