#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

Процедура СформироватьОписаниеДокументовСКонтрагентомВШапке(Описание, ДокументСсылка, ДокументОбъект, Форма) Экспорт
	
	ПроверкаКонтрагентов.ДополнитьОписание(
	Описание, 
	ДокументСсылка, 
	Форма.Элементы.Контрагент,
	ДокументОбъект.Контрагент,
	Форма.Элементы.ГруппаКонтрагент);
	
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы  

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РСКППеречислениеКонтрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РСКППеречисление.Контрагенты КАК РСКППеречислениеКонтрагенты
	|ГДЕ
	|	РСКППеречислениеКонтрагенты.КонтрагентИНН = """"
	|	И НЕ РСКППеречислениеКонтрагенты.Контрагент.ИНН = """"";
	
	РегистрируемыеСсылки = Новый Массив;
	КоличествоСсылок = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РегистрируемыеСсылки.Добавить(Выборка.Ссылка);
		КоличествоСсылок = КоличествоСсылок + 1;
		Если КоличествоСсылок = 1000 Тогда
			ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, РегистрируемыеСсылки);
			РегистрируемыеСсылки.Очистить();
			КоличествоСсылок = 0;
		КонецЕсли;
	КонецЦикла;
	
	Если РегистрируемыеСсылки.Количество() > 0 Тогда
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, РегистрируемыеСсылки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Документ.РСКППеречисление";
	МетаданныеДокумента = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			ПредставлениеОбъекта = Строка(Выборка.Ссылка);
			Блокировка = Новый БлокировкаДанных;
			Элемент = Блокировка.Добавить(ПолноеИмяОбъекта);
			Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Элемент.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Если Объект = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			Иначе
				Объект.Заблокировать();
				
				Для Каждого СтрКонтрагент Из Объект.Контрагенты Цикл 
					Если НЕ ЗначениеЗаполнено(СтрКонтрагент.Контрагент) Тогда
						Продолжить;
					КонецЕсли;	
					ИННКПП = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрКонтрагент.Контрагент, "ИНН,КПП");
					Если НЕ СтрКонтрагент.КонтрагентИНН = ИННКПП.ИНН Тогда
						СтрКонтрагент.КонтрагентИНН = ИННКПП.ИНН;
					КонецЕсли;	
				    Если НЕ СтрКонтрагент.КонтрагентКПП = ИННКПП.КПП Тогда
						СтрКонтрагент.КонтрагентКПП = ИННКПП.КПП;
					КонецЕсли;
				КонецЦикла;	
				
				Если Объект.Модифицированность() Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
				Иначе
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				КонецЕсли;
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать объект: %Документ% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ПредставлениеОбъекта);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеДокумента,
			Выборка.Ссылка,
			ТекстСообщения);
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			// Прервать текущую итерацию цикла, чтобы не увеличивать счетчик обработанных объектов.
			Продолжить;
			
		КонецПопытки;
		ОбъектовОбработано = ОбъектовОбработано + 1;
		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Не удалось обработать некоторые документы ""%1"" (пропущены): %2'"),
		МетаданныеДокумента.Синоним,
		ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация, МетаданныеДокумента,,
		СтрШаблон(НСтр("ru = 'Обработана очередная порция документов ""%1"": %2'"),
		МетаданныеДокумента.Синоним,
		ОбъектовОбработано));
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры


#КонецОбласти      

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти      

#Область ЗаполнениеДокумента     

Функция ЗначенияЗаполненияПоПоступлениюТМЦ(ДокументДО, ДокументТМЦ) Экспорт
	
	ИмяТаблицы = "Документ." + ДокументТМЦ.Метаданные().Имя;
	
	ЭтоАванс = ИмяТаблицы = "Документ.РегистрацияОбязательствИСведенийПоДоговорам";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументТМЦ", ДокументТМЦ);
	Запрос.УстановитьПараметр("ДокументДО", ДокументДО);
	Запрос.УстановитьПараметр("СчетаДО", 
		БухгалтерскийУчет.СписокСчетов("502.12",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументТМЦ, "Дата")));
	
	Запрос.Текст = "ВЫБРАТЬ
	|" + ?(ЭтоАванс, " 
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.ОснованиеИзменений = """"
	|			ТОГДА ПоступлениеМЗ.Договор.ВидОбязательства
	|		ИНАЧЕ ПоступлениеМЗ.ОснованиеИзменений
	|	КОНЕЦ КАК ДокументОснованиеВид,", "
	|	ПоступлениеМЗ.ВидПервичногоДокумента КАК ДокументОснованиеВид,") + "
	|" + ?(ЭтоАванс, " 
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.ОснованиеИзменений = """"
	|			ТОГДА ПоступлениеМЗ.Договор.ДатаДоговора
	|		ИНАЧЕ ПоступлениеМЗ.ОснованиеИзмененийДата
	|	КОНЕЦ КАК ДокументОснованиеДата,", "
	|	ПоступлениеМЗ.ДатаПервичногоДокумента КАК ДокументОснованиеДата,") + "
	|" + ?(ЭтоАванс, " 
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.ОснованиеИзменений = """"
	|			ТОГДА ПоступлениеМЗ.Договор.НомерДоговора
	|		ИНАЧЕ ПоступлениеМЗ.ОснованиеИзмененийНомер
	|	КОНЕЦ КАК ДокументОснованиеНомер,", "
	|	ПоступлениеМЗ.НомерПервичногоДокумента КАК ДокументОснованиеНомер,") + "
	|	ПоступлениеМЗ.ВалютаДокумента КАК ВалютаДокумента1,
	|	ПоступлениеМЗ.Организация КАК Организация,
	|	ПоступлениеМЗ.ИФО КАК ИФО,
	|	ПоступлениеМЗ.Контрагент КАК Контрагент,
	|	ПоступлениеМЗ.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.Контрагент = ПоступлениеМЗ.Договор.Контрагент
	|			ТОГДА ПоступлениеМЗ.Договор.СчетКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетКонтрагента
	|ИЗ
	|	&ИмяТаблицы КАК ПоступлениеМЗ
	|ГДЕ
	|	ПоступлениеМЗ.Ссылка = &ДокументТМЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДенежномОбязательстве.ИсточникСредств КАК ИсточникСредств,
	|	СведенияОДенежномОбязательстве.ЛицевойСчет КАК ЛицевойСчет,
	|	СведенияОДенежномОбязательстве.ОрганКазначейства КАК ОрганКазначейства,
	|	СведенияОДенежномОбязательстве.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчета,
	|	СведенияОДенежномОбязательстве.ОбъектФАИП КАК ОбъектФАИП
	|ИЗ
	|	Документ.СведенияОДенежномОбязательстве КАК СведенияОДенежномОбязательстве
	|ГДЕ
	|	СведенияОДенежномОбязательстве.Ссылка = &ДокументДО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КБКНазначениеПлатежа,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КОСГУНазначениеПлатежа,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов).ИсточникСредств  КАК ИсточникСредств,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК Сумма,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК СуммаВал
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор = &ДокументТМЦ
	|				И СчетКт В (&СчетаДО),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов).ИсточникСредств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов).Владелец КАК ЛицевойСчет,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов).ИсточникСредств  КАК ИсточникСредств,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов) КАК РазделЛицевогоСчета,
	|	РеквизитыЛицевыхСчетов.Ссылка КАК РеквизитыЛицевогоСчета,
	|	РеквизитыЛицевыхСчетов.КассовыйОрган КАК ОрганКазначейства
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор = &ДокументТМЦ
	|				И СчетКт В (&СчетаДО),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	|		ПО (ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов).Владелец = РеквизитыЛицевыхСчетов.Владелец)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяТаблицы); 
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("Шапка", МассивРезультатов[0].Выгрузить());
	Результат.Вставить("ШапкаДО", МассивРезультатов[1].Выгрузить());
    Результат.Вставить("РасшифровкаПлатежа", МассивРезультатов[2].Выгрузить());
	Результат.Вставить("ЛицевойСчет", МассивРезультатов[3].Выгрузить());
	
	Результат.Вставить("КорСчет", БухгалтерскийУчет.СчетПоКоду(?(ЭтоАванс, "206.00", "302.00"), Неопределено, Неопределено));
	Результат.Вставить("ЭтоАванс", ЭтоАванс); 
	
	Если Результат.ШапкаДО.Количество() = 0 
		И (Результат.ЛицевойСчет.Количество() = 0
		ИЛИ НЕ ЗначениеЗаполнено(Результат.ЛицевойСчет[0].РеквизитыЛицевогоСчета)) Тогда
		
		Если Результат.Шапка.Количество() > 0 Тогда
			
			МассивКФО = Результат.РасшифровкаПлатежа.ВыгрузитьКолонку("КФО");
			ДанныеЛицевогоСчета = ПлатежноРасчетныеДокументы.ДанныеЛицевогоСчетаПоКФО(Результат.Шапка[0].Организация, МассивКФО);
			
			Если Результат.ЛицевойСчет.Количество() = 0 Тогда
				Результат.ЛицевойСчет.Добавить();
			КонецЕсли;
			
			Результат.ЛицевойСчет[0].ЛицевойСчет = ДанныеЛицевогоСчета.ЛицевойСчет;
			Результат.ЛицевойСчет[0].РеквизитыЛицевогоСчета = ДанныеЛицевогоСчета.РеквизитыЛицевогоСчета;
			Результат.ЛицевойСчет[0].ОрганКазначейства = ДанныеЛицевогоСчета.ОрганФК;
			
			Для Каждого Стр ИЗ Результат.РасшифровкаПлатежа Цикл
				Если НЕ ЗначениеЗаполнено(Стр.ИсточникСредств) Тогда
					ИсточникПоКФО = ДанныеЛицевогоСчета.РазделыИКФО.НайтиСтроки(Новый Структура("КФО", Стр.КФО));
					Если ИсточникПоКФО.Количество() > 0 Тогда
						Стр.ИсточникСредств = ИсточникПоКФО[0].ИсточникСредств;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	Конецесли;
		 
	Возврат Результат;
	
КонецФункции	

Процедура ЗаполнитьРеквизитыПолучателя(СтрокаТаблицы) Экспорт
	
	РеквизитыПолучателя = Новый Структура("КонтрагентИНН, КонтрагентКПП, КонтрагентНаименование, КонтрагентБанковскийСчет, КонтрагентНаименованиеБанка, КонтрагентБИКБанка, КонтрагентКорСчетБанка",
	"ИНН", "КПП", "Корреспондент", "СчетНомер", "Банк", "БИК", "КоррСчет");
	
	ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(СтрокаТаблицы.СчетКонтрагента, СтрокаТаблицы.СчетКонтрагента, РеквизитыПолучателя);
	
	СтруктураРеквизитов = Новый Структура("ТипЛицевогоСчета, Код, КассовыйОрган"); 
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.СчетКонтрагента, СтруктураРеквизитов);
	
	Если СтруктураРеквизитов.ТипЛицевогоСчета = Перечисления.ТипыЛицевыхСчетов.Казначейский Тогда
		КазначействоИлиФО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураРеквизитов.КассовыйОрган, "КазначействоИлиФО");
		Если КазначействоИлиФО = 0 Тогда 
			РеквизитыПолучателя.Вставить("КонтрагентЛицевойСчет", СтруктураРеквизитов.Код); 
		Иначе
			РеквизитыПолучателя.Вставить("КонтрагентЛицевойСчет", "00000000000");   
		КонецЕсли;	
	Иначе
		РеквизитыПолучателя.Вставить("КонтрагентЛицевойСчет","");
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РеквизитыПолучателя); 
	
КонецПроцедуры

//  Возвращает сведения о записи в регистре сведенеий "СостояниеПлатежноРасчетныхДокументов"
//    Входящие параметры: Ссылка - тип ссылка на документ "Уведомление об уточнении операции клиента"
//    Исходящие параметры: 
Функция ПолучитьСостояниеДокумента(Ссылка) экспорт
	
	СтруктураРеквизитов = Новый Структура;
	ПоляВыборки = "";
	//  Струкутра реквизитов динамическая, т.к. со временем может понадобится новый ресурс в регистр
	//  что-бы его не забыть будем каждый раз перебирать ресурсы регистра
	Для каждого Ресурс из Метаданные.РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.Ресурсы цикл
		СтруктураРеквизитов.Вставить(Ресурс.Имя);
		ПоляВыборки = ПоляВыборки + "
		|	Состояние." + Ресурс.Имя + " КАК " + Ресурс.Имя + ", "
	КонецЦикла;	
	//  Добавка ввиде реквизита "ПервичныйОбразИРеквизиты"
	СтруктураРеквизитов.Вставить("ПервичныйОбразИРеквизиты");		
	ПоляВыборки = ПоляВыборки + "
	|	Состояние.ПервичныйОбразИРеквизиты КАК ПервичныйОбразИРеквизиты ";
	
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.ЗаявкаНаКассовыйРасход") тогда
		Возврат СтруктураРеквизитов;
	КонецЕсли;	
		
	ТекстЗапроса = "ВЫБРАТЬ " + ПоляВыборки + "
					|ИЗ	
					|	РегистрСведений.СостояниеПлатежноРасчетныхДокументов КАК Состояние
					|ГДЕ 
					|	Состояние.ПлатежноРасчетныйДокумент = &Ссылка";
						
	Запрос = Новый Запрос(ТекстЗапроса);				
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
		
	Для каждого КлючЗначение из СтруктураРеквизитов Цикл
		ТекРеквизит = КлючЗначение.Ключ;
		СтруктураРеквизитов[ТекРеквизит] = Выборка[ТекРеквизит];
	КонецЦикла;	
		
	Возврат СтруктураРеквизитов;
КонецФункции	

Функция ПолучитьРеквизитыДоговора(Знач Договор) Экспорт
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидОснованияЕБП,ТипЗакупкиЕБП,ДатаДоговора,НомерДоговора,КраткоеСодержание,ТекстНазначенияПлатежа");  
	
	РеквизитыДоговора.Вставить("НазначениеПлатежа", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДоговора.ВидОснованияЕБП, "НазначениеПлатежа"));	
	
	РеквизитыДоговора.Вставить("УчетныйНомерОбязательства", РаботаСОбязательствами.ПолучитьУчетныйНомерОбязательства(Договор));
	
	СведенияОВалютеОбязательства = РаботаСОбязательствами.СведенияОВалютеОбязательства(Договор);
	РеквизитыДоговора.Вставить("ОплатаВРублях", СведенияОВалютеОбязательства.ОплатаВРублях); 
	
	РеквизитыДоговора.Вставить("ИГК", РаботаСОбязательствами.ПолучитьИГК(Договор));
		
	Возврат РеквизитыДоговора;
	
КонецФункции

// Заполняет платежно-расчетный документ при вводе на основании.
// 
// Параметры:
// 	Объект - ДокументОбъект.РСКППеречисление - заполняемый объект,
// 	ДокументОснование - ДокументСсылка.ВедомостьКомпенсацииРодительскойПлатыКВыплате - документ-основание.
// 	СтандартнаяОбработка - Булево - продолжать стандартное заполнение объекта.
//
Процедура ЗаполнитьНаОснованииВедомостиКомпенсацииРодительскойПлатыКВыплате(Объект, ДокументОснование, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.ВедомостьКомпенсацииРодительскойПлатыКВыплате") Тогда
		ВызватьИсключение "Не верный тип параметра при вызове процедуры";
	КонецЕсли;

	РасчетноПлатежныйДокумент = 
		ПлатежноРасчетныеДокументы.ВведенныйНаОснованииВедомостиКомпенсацииРасчетноПлатежныйДокумент(ДокументОснование);
	
	Если ЗначениеЗаполнено(РасчетноПлатежныйДокумент) И Объект.Ссылка <> РасчетноПлатежныйДокумент Тогда
		ТекстИсключения = СтрШаблон(НСтр(
			"ru='На основании ведомости компенсации уже введен расчетно-платежный документ (%1)'"),
			РасчетноПлатежныйДокумент);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;   
	
	ЧитаемыеДанные = Новый Структура("Организация, ИФО, СуммаДокумента, Дата");
	ЧитаемыеДанные.Вставить("СуммаДокументаВВалюте", "СуммаДокумента");
	ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЧитаемыеДанные);
	ЗаполнитьЗначенияСвойств(Объект, ДанныеОснования);
	Объект.ДокументОснование = ДокументОснование;
	Объект.КорСчет = БухгалтерскийУчет.СчетПоКоду("302.00");
    Объект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();  
	
	Умолчания = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(Объект.Организация, "Документ.РСКППеречисление", Объект.Дата, Перечисления.ТипыЛицевыхСчетов.Казначейский,,, Неопределено);
	Объект.ЛицевойСчет = Умолчания.ЛицевойСчет;  
	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЛицевойСчет, "МаксДлинаНазначенияПлатежа"); 
		Объект.МодульИнтеграции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЛицевойСчет, "МодульИнтеграции"); 
		Если НЕ ЗначениеЗаполнено(Объект.МодульИнтеграции) ИЛИ Объект.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.НетИнтеграции") Тогда
			ВызватьИсключение "Документ РСКП (перечисление) не применяется для указанного лицевого счета";  
		КонецЕсли;
	Иначе
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = 240;
	КонецЕсли;	
	
	Объект.НесколькоПолучателей = 0;
	Объект.Контрагенты.Очистить();
	СтрКонтрагент = Объект.Контрагенты.Добавить();  
	СтрКонтрагент.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	СтрКонтрагент.Контрагент = Константы.КонтрагентДляНачисленияКомпенсацииРодительскойПлаты.Получить();
	Если ЗначениеЗаполнено(СтрКонтрагент.Контрагент) Тогда
		СтрКонтрагент.СчетКонтрагента = Справочники.БанковскиеИКазначейскиеСчета.ПолучитьСчетПоУмолчанию(СтрКонтрагент.Контрагент, "Документ.РСКППеречисление.Контрагенты");
	КонецЕсли;
	ЗаполнитьРеквизитыПолучателя(СтрКонтрагент);

	КОСГУКомпенсации = Неопределено;
	ДокументНачислениеКомпенсации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ДокументОснование");
	ДанныеКОСГУКомпенсации = БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(ДокументНачислениеКомпенсации, "КЭК");
	Если ДанныеКОСГУКомпенсации.КЭК <> Неопределено Тогда
		КОСГУКомпенсации = ДанныеКОСГУКомпенсации.КЭК;
	Иначе
		КОСГУКомпенсации = БухгалтерскийУчетПовтИсп.КЭКПоКоду("262");
	КонецЕсли;
	
	СоставВедомости = Документы.ВедомостьКомпенсацииРодительскойПлатыКВыплате.ВедомостьКомпенсацииПоКПС(ДокументОснование);
	
	Объект.РасшифровкаПлатежа.Очистить();  
	Объект.ДетализацияПлатежа.Очистить(); 
	
	РасшифровкаПлатежа = Объект.РасшифровкаПлатежа.Выгрузить(); 
	РасшифровкаПлатежа.Колонки.Добавить("КодПоступленияЕБП", Новый ОписаниеТипов("ПеречислениеСсылка.КодыПоступленийЕБП"));
	
	Для Каждого СтрокаСостава Из СоставВедомости Цикл
		СтрокаРасшифровки = РасшифровкаПлатежа.Добавить();
		СтрокаРасшифровки.КБКНазначениеПлатежа = СтрокаСостава.КПС;
		СтрокаРасшифровки.РазделЛС = ПлатежноРасчетныеДокументы.РазделЛСПоКодуПоступленияИлиКФО(Объект.ЛицевойСчет,,, СтрокаСостава.КФО); 
		СтрокаРасшифровки.КодПоступленияЕБП = ПлатежноРасчетныеДокументыКлиентСервер.КодПоступленияЕБППоКФО(СтрокаСостава.КФО, ТекущаяДатаСеанса());
		СтрокаРасшифровки.НаправлениеПлатежа = ""; // Определять по КВР
		СтрокаРасшифровки.СуммаВал = СтрокаСостава.СуммаКомпенсации;
		СтрокаРасшифровки.Сумма = СтрокаСостава.СуммаКомпенсации;
		СтрокаРасшифровки.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		// Детализация
		СтрДетализации = Объект.ДетализацияПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(СтрДетализации, СтрокаРасшифровки);
		СтрДетализации.КОСГУНазначениеПлатежа = КОСГУКомпенсации;
		СтрДетализации.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
		СтрДетализации.КОСГУНазначениеПлатежа, Объект.КорСчет,, Объект.Дата, Объект.Организация, Объект.ИФО);
		СтрДетализации.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг; 
		СтрДетализации.Контрагент = Объект.Контрагенты[0].Контрагент; 
	КонецЦикла;  
	
	Объект.НесколькоКодовБК = ?(РасшифровкаПлатежа.Количество() > 1, 1, 0);  
	
	РеквизитыДокументаОснования = Объект.РеквизитыДокументаОснования.Выгрузить();
	РеквизитыДокументаОснования.Колонки.Добавить("НазначениеПлатежа", Новый ОписаниеТипов("Булево")); 
	ПлатежноРасчетныеДокументы.ЗаполнитьПризнакНазначенияПлатежаВСпискеОснований(РеквизитыДокументаОснования);
	
	ПлатежноРасчетныеДокументыКлиентСервер.СформироватьТекстНазначенияПлатежаРСКППеречисление(Объект, 
	РасшифровкаПлатежа,
	Объект.Контрагенты,
	РеквизитыДокументаОснования,
	УстановленнаяМаксимальнаяДлинаНазначенияПлатежа); 
	
	Объект.РасшифровкаПлатежа.Загрузить(РасшифровкаПлатежа);
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииВедомостиНаВыплатуВБанк(Объект, ДокументОснование, СтандартнаяОбработка) Экспорт  
	
	// проверим, был ли уже введен расчетно-платежный документ на основании ведомости
	РасчетноПлатежныйДокумент =
		ПлатежноРасчетныеДокументы.ВведенныйНаОснованииВедомостиВБанкРасчетноПлатежныйДокумент(ДокументОснование);
	
	Если ЗначениеЗаполнено(РасчетноПлатежныйДокумент) И Объект.Ссылка <> РасчетноПлатежныйДокумент Тогда
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='На основании ведомости уже введен расчетно-платежный документ (%1)'"),
		РасчетноПлатежныйДокумент);
		ВызватьИсключение ТекстИсключения;
	Иначе
		Если НЕ ДокументОснование.ПолучитьОбъект().ПроверитьЗаполнение() Тогда
			ВызватьИсключение "В ведомости есть ошибки заполнения (см. окно сообщений)! Ввод на основании невозможен."
		КонецЕсли;
		
		Объект.Организация				= ДокументОснование.Организация;
		Объект.ИФО						= ДокументОснование.ИФО;
		Объект.Дата						= ДокументОснование.Дата;
		Объект.СуммаДокументаВВалюте	= ДокументОснование.СуммаДокумента;
		Объект.СуммаДокумента			= ДокументОснование.СуммаДокумента;
		Объект.ДокументОснование		= ДокументОснование;
		Объект.КодВидаДохода			= ДокументОснование.КодВидаДохода;
		Объект.ВалютаДокумента			= Константы.ВалютаРегламентированногоУчета.Получить();
		КурсКратность					= РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
		Объект.Курс						= КурсКратность.Курс;
		Объект.Кратность				= КурсКратность.Кратность; 
		Объект.КорСчет 					= БухгалтерскийУчет.СчетПоКоду("302.00");
		
		Умолчания = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(Объект.Организация, "Документ.РСКППеречисление", Объект.Дата, Перечисления.ТипыЛицевыхСчетов.Казначейский,,, Неопределено);
		Объект.ЛицевойСчет = Умолчания.ЛицевойСчет; 
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЛицевойСчет, "МаксДлинаНазначенияПлатежа"); 
		
		Объект.НесколькоПолучателей = 0;   
		Если Объект.Контрагенты.Количество() > 1 Тогда       
			СтрокаКонтрагента = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Объект.Контрагенты.Выгрузить()[0]); 
			Объект.Контрагенты.Очистить();    
			НовКонтрагент = Объект.Контрагенты.Добавить();
			ЗаполнитьЗначенияСвойств(НовКонтрагент, СтрокаКонтрагента,, "СуммаВал,Сумма,СтрокаНазначениеПлатежа,ДополнительнаяИнформация"); 
		ИначеЕсли Объект.Контрагенты.Количество() = 0 Тогда 
			СтрКонтрагент = Объект.Контрагенты.Добавить();  
			СтрКонтрагент.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
		
		Объект.РасшифровкаПлатежа.Очистить();  
		Объект.ДетализацияПлатежа.Очистить();  
		РасшифровкаПлатежа = Объект.РасшифровкаПлатежа.Выгрузить(); 
		РасшифровкаПлатежа.Колонки.Добавить("КодПоступленияЕБП", Новый ОписаниеТипов("ПеречислениеСсылка.КодыПоступленийЕБП"));
		
		ТаблицаДляЗаполнения = ДокументОснование.РасшифровкаПлатежа.Выгрузить();
		ТаблицаДляЗаполнения.Свернуть("КФО,КПС,КЭК,КодЦели,КодМероприятия,ДопКлассификация","Сумма");
		ТаблицаДляЗаполнения.Сортировать("КФО,КПС,КЭК"); 
		
		ТаблицаКБК = ДокументОснование.РасшифровкаПлатежа.Выгрузить();  
		ТаблицаКБК.Свернуть("КФО,КПС,КодЦели","Сумма");
		
		Для Каждого СтрокаКБК Из ТаблицаКБК Цикл
			СтрРасшифровка = РасшифровкаПлатежа.Добавить();  
			СтрРасшифровка.РазделЛС = ПлатежноРасчетныеДокументы.РазделЛСПоКодуПоступленияИлиКФО(Объект.ЛицевойСчет,,, СтрокаКБК.КФО); 
			СтрРасшифровка.КодПоступленияЕБП = ПлатежноРасчетныеДокументыКлиентСервер.КодПоступленияЕБППоКФО(СтрокаКБК.КФО, Объект.Дата);
			СтрРасшифровка.НаправлениеПлатежа = ""; // Определять по КВР
			СтрРасшифровка.КБКНазначениеПлатежа		= СтрокаКБК.КПС;
			СтрРасшифровка.КодЦели					= СтрокаКБК.КодЦели;
			СтрРасшифровка.СуммаВал					= СтрокаКБК.Сумма;
			СтрРасшифровка.Сумма					= СтрокаКБК.Сумма;
			СтрРасшифровка.ИдентификаторСтроки = Новый УникальныйИдентификатор; 
			
			СтрокиДетализации = ТаблицаДляЗаполнения.НайтиСтроки(Новый Структура("КФО,КПС,КодЦели", СтрокаКБК.КФО, СтрокаКБК.КПС, СтрокаКБК.КодЦели)); 
			Для Каждого Стр Из СтрокиДетализации Цикл
				СтрДетализации = Объект.ДетализацияПлатежа.Добавить();
				ЗаполнитьЗначенияСвойств(СтрДетализации, СтрРасшифровка);
				СтрДетализации.КОСГУНазначениеПлатежа 	= Стр.КЭК;  
				СтрДетализации.ДопКлассификация   		= Стр.ДопКлассификация;
				СтрДетализации.КодМероприятия           = Стр.КодМероприятия;
				СтрДетализации.СуммаВал					= Стр.Сумма;
				СтрДетализации.Сумма					= Стр.Сумма;  
				СтрДетализации.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
				СтрДетализации.КОСГУНазначениеПлатежа, Объект.КорСчет,, Объект.Дата, Объект.Организация, Объект.ИФО);
				СтрДетализации.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг;
				СтрДетализации.Контрагент = Объект.Контрагенты[0].Контрагент;
			КонецЦикла;
		КонецЦикла; 
		
		Объект.НесколькоКодовБК = ?(РасшифровкаПлатежа.Количество() > 1, 1, 0);  
	
		РеквизитыДокументаОснования = Объект.РеквизитыДокументаОснования.Выгрузить();
		РеквизитыДокументаОснования.Колонки.Добавить("НазначениеПлатежа", Новый ОписаниеТипов("Булево")); 
		ПлатежноРасчетныеДокументы.ЗаполнитьПризнакНазначенияПлатежаВСпискеОснований(РеквизитыДокументаОснования);
	
		ПлатежноРасчетныеДокументыКлиентСервер.СформироватьТекстНазначенияПлатежаРСКППеречисление(Объект, 
		РасшифровкаПлатежа,
		Объект.Контрагенты,
		РеквизитыДокументаОснования,
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа); 
		
		Объект.РасшифровкаПлатежа.Загрузить(РасшифровкаПлатежа);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДенежномуОбязательству(Объект, ДокументДО, ДокументТМЦ) Экспорт 
	
	ИмяТаблицы = "Документ." + ДокументТМЦ.Метаданные().Имя;
	ЭтоАванс = ИмяТаблицы = "Документ.РегистрацияОбязательствИСведенийПоДоговорам";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументТМЦ", ДокументТМЦ);
	Запрос.УстановитьПараметр("ДокументДО", ДокументДО);
	Запрос.УстановитьПараметр("СчетаДО", 
	БухгалтерскийУчет.СписокСчетов("502.12",
	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументТМЦ, "Дата")));
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПоступлениеМЗ.ВалютаДокумента КАК ВалютаПоступления,
	|	ПоступлениеМЗ.Организация КАК Организация,
	|	ПоступлениеМЗ.ИФО КАК ИФО,
	|	ПоступлениеМЗ.Контрагент КАК Контрагент,
	|	ПоступлениеМЗ.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.Контрагент = ПоступлениеМЗ.Договор.Контрагент
	|			ТОГДА ПоступлениеМЗ.Договор.СчетКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетКонтрагента
	|ИЗ
	|	&ИмяТаблицы КАК ПоступлениеМЗ
	|ГДЕ
	|	ПоступлениеМЗ.Ссылка = &ДокументТМЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДенежномОбязательстве.ЛицевойСчет КАК ЛицевойСчет,
	|	СведенияОДенежномОбязательстве.ОбъектФАИП КАК ОбъектФАИП
	|ИЗ
	|	Документ.СведенияОДенежномОбязательстве КАК СведенияОДенежномОбязательстве
	|ГДЕ
	|	СведенияОДенежномОбязательстве.Ссылка = &ДокументДО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КБКНазначениеПлатежа,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КОСГУНазначениеПлатежа,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов) КАК РазделЛС,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДополнительнаяБюджетнаяКлассификация.ПустаяСсылка)
	|	КОНЕЦ КАК ДопКлассификация,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.ВидыЦелевыхСредств)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЦелевыхСредств.ПустаяСсылка)
	|	КОНЕЦ КАК КодЦели,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Мероприятия)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Мероприятия.ПустаяСсылка)
	|	КОНЕЦ КАК КодМероприятия,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК Сумма,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК СуммаВал
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор = &ДокументТМЦ
	|				И СчетКт В (&СчетаДО),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДополнительнаяБюджетнаяКлассификация.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.ВидыЦелевыхСредств)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЦелевыхСредств.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Мероприятия)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Мероприятия.ПустаяСсылка)
	|	КОНЕЦ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяТаблицы); 
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Шапка = МассивРезультатов[0].Выгрузить();
	ШапкаДО = МассивРезультатов[1].Выгрузить();
	ТаблицаДляЗаполнения = МассивРезультатов[2].Выгрузить(); 
	
	Если Шапка.Количество() > 0 Тогда
		
		ЗаполнитьЗначенияСвойств(Объект, Шапка[0]);
		
		Если ЗначениеЗаполнено(Объект.Договор) Тогда  
			РеквизитыДоговора = ПолучитьРеквизитыДоговора(Объект.Договор);
			Объект.НомерОбязательства = РеквизитыДоговора.УчетныйНомерОбязательства;
			Объект.ДополнительнаяИнформация = РеквизитыДоговора.ТекстНазначенияПлатежа;
			Объект.ИГК = РеквизитыДоговора.ИГК;
			
			Если Объект.РеквизитыДокументаОснования.Количество() = 0 Тогда
				Объект.РеквизитыДокументаОснования.Добавить();
			КонецЕсли;
			ТекущаяСтрокаРеквизитов = Объект.РеквизитыДокументаОснования[0];
			ТекущаяСтрокаРеквизитов.ДокументОснованиеВид		= РеквизитыДоговора.ВидОснованияЕБП;
			ТекущаяСтрокаРеквизитов.ДокументОснованиеДата 		= РеквизитыДоговора.ДатаДоговора;
			ТекущаяСтрокаРеквизитов.ДокументОснованиеНомер		= РеквизитыДоговора.НомерДоговора;
			ТекущаяСтрокаРеквизитов.ДокументОснованиеПредмет 	= РеквизитыДоговора.КраткоеСодержание;
		КонецЕсли;  
		
		Объект.НесколькоПолучателей = 0;
		Объект.Контрагенты.Очистить();
		СтрКонтрагент = Объект.Контрагенты.Добавить();  
		СтрКонтрагент.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		СтрКонтрагент.Контрагент = Шапка[0].Контрагент; 
		СтрКонтрагент.СчетКонтрагента =  Шапка[0].СчетКонтрагента;
		Если НЕ ЗначениеЗаполнено(СтрКонтрагент.СчетКонтрагента) Тогда
			СтрКонтрагент.СчетКонтрагента = Справочники.БанковскиеИКазначейскиеСчета.ПолучитьСчетПоУмолчанию(СтрКонтрагент.Контрагент, "Документ.РСКППеречисление.Контрагенты");
		КонецЕсли;
		ЗаполнитьРеквизитыПолучателя(СтрКонтрагент);
		
		Если ЗначениеЗаполнено(Шапка[0].ВалютаПоступления) Тогда
			Объект.ВалютаДокумента = Шапка[0].ВалютаПоступления;
		Иначе	
			Объект.ВалютаДокумента			= Константы.ВалютаРегламентированногоУчета.Получить(); 
		КонецЕсли;
		КурсКратность					= РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
		Объект.Курс						= КурсКратность.Курс;
		Объект.Кратность				= КурсКратность.Кратность; 
		
	Конецесли;
	
	Объект.КорСчет = БухгалтерскийУчет.СчетПоКоду(?(ЭтоАванс, "206.00", "302.00"), Неопределено, Неопределено);
	Объект.ПризнакАвансовогоПлатежа = ЭтоАванс;	
	УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = 210;
	
	Если ТаблицаДляЗаполнения.Количество() > 0 Тогда
		РазделЛС = ТаблицаДляЗаполнения[0].РазделЛС;
		Если ЗначениеЗаполнено(РазделЛС) Тогда   
			Объект.ЛицевойСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РазделЛС, "Владелец");
		Иначе
			Умолчания = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(Объект.Организация, "Документ.РСКППеречисление", Объект.Дата, Перечисления.ТипыЛицевыхСчетов.Казначейский,,, Неопределено);
			Объект.ЛицевойСчет = Умолчания.ЛицевойСчет; 
		КонецЕсли;  
	КонецЕсли; 	
	Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЛицевойСчет, "МаксДлинаНазначенияПлатежа"); 
	КонецЕсли;
	
	Объект.РасшифровкаПлатежа.Очистить();  
	Объект.ДетализацияПлатежа.Очистить();  
	РасшифровкаПлатежа = Объект.РасшифровкаПлатежа.Выгрузить(); 
	РасшифровкаПлатежа.Колонки.Добавить("КодПоступленияЕБП", Новый ОписаниеТипов("ПеречислениеСсылка.КодыПоступленийЕБП"));
	
	ТаблицаКБК = ТаблицаДляЗаполнения.Скопировать();  
	ТаблицаКБК.Свернуть("КФО,КБКНазначениеПлатежа,РазделЛС,КодЦели","Сумма,СуммаВал");
		
	Для Каждого СтрокаКБК Из ТаблицаКБК Цикл
		СтрРасшифровка = РасшифровкаПлатежа.Добавить(); 
		ЗаполнитьЗначенияСвойств(СтрРасшифровка, СтрокаКБК);
		Если НЕ ЗначениеЗаполнено(СтрРасшифровка.РазделЛС) Тогда
			СтрРасшифровка.РазделЛС = ПлатежноРасчетныеДокументы.РазделЛСПоКодуПоступленияИлиКФО(Объект.ЛицевойСчет,,, СтрокаКБК.КФО); 
		КонецЕсли;	
		СтрРасшифровка.КодПоступленияЕБП = ПлатежноРасчетныеДокументыКлиентСервер.КодПоступленияЕБППоКФО(СтрокаКБК.КФО, ТекущаяДатаСеанса());
		СтрРасшифровка.НаправлениеПлатежа = ""; // Определять по КВР
		СтрРасшифровка.ИдентификаторСтроки = Новый УникальныйИдентификатор; 
		
		СтрокиДетализации = ТаблицаДляЗаполнения.НайтиСтроки(Новый Структура("КФО,КБКНазначениеПлатежа,КодЦели", СтрокаКБК.КФО, СтрокаКБК.КБКНазначениеПлатежа, СтрокаКБК.КодЦели)); 
		Для Каждого Стр Из СтрокиДетализации Цикл
			СтрДетализации = Объект.ДетализацияПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДетализации, СтрРасшифровка);
			СтрДетализации.КОСГУНазначениеПлатежа 	= Стр.КОСГУНазначениеПлатежа;  
			СтрДетализации.ДопКлассификация   		= Стр.ДопКлассификация;
			СтрДетализации.КодМероприятия           = Стр.КодМероприятия;
			СтрДетализации.СуммаВал					= Стр.СуммаВал;
			СтрДетализации.Сумма					= Стр.Сумма;  
			СтрДетализации.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
			СтрДетализации.КОСГУНазначениеПлатежа, Объект.КорСчет,, ТекущаяДатаСеанса(), Объект.Организация, Объект.ИФО);
			СтрДетализации.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг;
			СтрДетализации.Контрагент = Объект.Контрагенты[0].Контрагент;
		КонецЦикла;
	КонецЦикла;    
	
	Объект.СуммаДокумента = РасшифровкаПлатежа.Итог("Сумма");
	Объект.СуммаДокументаВВалюте = РасшифровкаПлатежа.Итог("СуммаВал");
		
	Объект.НесколькоКодовБК = ?(РасшифровкаПлатежа.Количество() > 1, 1, 0);  

	РеквизитыДокументаОснования = Объект.РеквизитыДокументаОснования.Выгрузить();
	РеквизитыДокументаОснования.Колонки.Добавить("НазначениеПлатежа", Новый ОписаниеТипов("Булево")); 
	ПлатежноРасчетныеДокументы.ЗаполнитьПризнакНазначенияПлатежаВСпискеОснований(РеквизитыДокументаОснования);
	
	ПлатежноРасчетныеДокументыКлиентСервер.СформироватьТекстНазначенияПлатежаРСКППеречисление(Объект, 
	РасшифровкаПлатежа,
	Объект.Контрагенты,
	РеквизитыДокументаОснования,
	УстановленнаяМаксимальнаяДлинаНазначенияПлатежа); 
	
	Объект.РасшифровкаПлатежа.Загрузить(РасшифровкаПлатежа);   
	
	
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииРешенияОКомпенсации(ПлатежныйДокумент, ДанныеЗаполнения, Отказ) Экспорт
	
	ПлатежныйДокумент.ДокументОснование = ДанныеЗаполнения;
	ПлатежныйДокумент.Организация = ДанныеЗаполнения.Организация;
	ПлатежныйДокумент.ИФО = ДанныеЗаполнения.ИФО; 
	ПлатежныйДокумент.КорСчет = БухгалтерскийУчет.СчетПоКоду("208.00", ТекущаяДатаСеанса(), ПлатежныйДокумент.Организация); 
	ПлатежныйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить(); 
	КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПлатежныйДокумент.ВалютаДокумента, ПлатежныйДокумент.Дата);
	ПлатежныйДокумент.Курс = КурсКратность.Курс;
	ПлатежныйДокумент.Кратность = КурсКратность.Кратность;
		
	ПлатежныйДокумент.Договор = ДанныеЗаполнения.ОснованиеПринятияОбязательства;
    ПлатежныйДокумент.ЛицевойСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.РазделЛицевогоСчета, "Владелец");

	Если ЗначениеЗаполнено(ПлатежныйДокумент.ЛицевойСчет) Тогда
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.ЛицевойСчет, "МаксДлинаНазначенияПлатежа"); 
		ПлатежныйДокумент.МодульИнтеграции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.ЛицевойСчет, "МодульИнтеграции"); 
		Если НЕ ЗначениеЗаполнено(ПлатежныйДокумент.МодульИнтеграции) ИЛИ ПлатежныйДокумент.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.НетИнтеграции") Тогда
			ВызватьИсключение "Документ РСКП (перечисление) не применяется для указанного лицевого счета";  
		КонецЕсли;
	Иначе
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = 240;
	КонецЕсли; 
	
	ПлатежныйДокумент.НесколькоПолучателей = 0;
	ПлатежныйДокумент.Контрагенты.Очистить();
	СтрКонтрагент = ПлатежныйДокумент.Контрагенты.Добавить();  
	СтрКонтрагент.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	СтрКонтрагент.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Сотрудник, "Контрагент");
	Если ЗначениеЗаполнено(СтрКонтрагент.Контрагент) Тогда
		СтрКонтрагент.СчетКонтрагента = Справочники.БанковскиеИКазначейскиеСчета.ПолучитьСчетПоУмолчанию(СтрКонтрагент.Контрагент, "Документ.РСКППеречисление.Контрагенты");
	КонецЕсли;
	ЗаполнитьРеквизитыПолучателя(СтрКонтрагент);
	
	ПлатежныйДокумент.РасшифровкаПлатежа.Очистить();  
	ПлатежныйДокумент.ДетализацияПлатежа.Очистить(); 

	ТаблицаКЭК = ДанныеЗаполнения.ФинансовоеОбеспечение.Выгрузить();  
	ТаблицаКПС = ДанныеЗаполнения.ФинансовоеОбеспечение.Выгрузить(); 
	ТаблицаКПС.Свернуть("КФО, КПС, КодЦели", "Сумма");
	
	РасшифровкаПлатежа = ПлатежныйДокумент.РасшифровкаПлатежа.Выгрузить(); 
	РасшифровкаПлатежа.Колонки.Добавить("КодПоступленияЕБП", Новый ОписаниеТипов("ПеречислениеСсылка.КодыПоступленийЕБП"));
	
	Для Каждого СтрокаСостава Из ТаблицаКПС Цикл
		СтрокаРасшифровки = РасшифровкаПлатежа.Добавить();
		СтрокаРасшифровки.КБКНазначениеПлатежа = СтрокаСостава.КПС;
		СтрокаРасшифровки.РазделЛС = ПлатежноРасчетныеДокументы.РазделЛСПоКодуПоступленияИлиКФО(ПлатежныйДокумент.ЛицевойСчет,,, СтрокаСостава.КФО); 
		СтрокаРасшифровки.КодПоступленияЕБП = ПлатежноРасчетныеДокументыКлиентСервер.КодПоступленияЕБППоКФО(СтрокаСостава.КФО, ТекущаяДатаСеанса());
		СтрокаРасшифровки.НаправлениеПлатежа = ""; // Определять по КВР 
		СтрокаРасшифровки.КодЦели = СтрокаСостава.КодЦели;
		СтрокаРасшифровки.СуммаВал = СтрокаСостава.Сумма;
		СтрокаРасшифровки.Сумма = СтрокаСостава.Сумма;
		СтрокаРасшифровки.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		// Детализация 
		СтрокиДетализации = ТаблицаКЭК.НайтиСтроки(Новый Структура("КФО, КПС, КодЦели", СтрокаСостава.КФО, СтрокаСостава.КПС, СтрокаСостава.КодЦели)); 
		Для Каждого Стр Из СтрокиДетализации Цикл
			СтрДетализации = ПлатежныйДокумент.ДетализацияПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДетализации, СтрокаРасшифровки);
			СтрДетализации.КОСГУНазначениеПлатежа = Стр.КЭК;
			СтрДетализации.КодМероприятия = Стр.КодМероприятия;
			СтрДетализации.ДопКлассификация = Стр.ДопКлассификация;
			СтрДетализации.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(СтрДетализации.КОСГУНазначениеПлатежа, 
				ПлатежныйДокумент.КорСчет,, 
				ПлатежныйДокумент.Дата, 
				ПлатежныйДокумент.Организация, 
				ПлатежныйДокумент.ИФО);
			СтрДетализации.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг; 
			СтрДетализации.Контрагент = ПлатежныйДокумент.Контрагенты[0].Контрагент; 
			СтрДетализации.Подразделение = ДанныеЗаполнения.Подразделение;
			СтрДетализации.СуммаВал = Стр.Сумма;
			СтрДетализации.Сумма = Стр.Сумма;
		КонецЦикла;
	КонецЦикла;  
	
	ПлатежныйДокумент.НесколькоКодовБК = ?(РасшифровкаПлатежа.Количество() > 1, 1, 0);  

 	РеквизитыДокументаОснования = ПлатежныйДокумент.РеквизитыДокументаОснования.Выгрузить();
	РеквизитыДокументаОснования.Колонки.Добавить("НазначениеПлатежа", Новый ОписаниеТипов("Булево")); 
	ПлатежноРасчетныеДокументы.ЗаполнитьПризнакНазначенияПлатежаВСпискеОснований(РеквизитыДокументаОснования);
	
	ПлатежноРасчетныеДокументыКлиентСервер.СформироватьТекстНазначенияПлатежаРСКППеречисление(ПлатежныйДокумент, 
		РасшифровкаПлатежа,
		ПлатежныйДокумент.Контрагенты,
		РеквизитыДокументаОснования,
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа); 
		
	ПлатежныйДокумент.РасшифровкаПлатежа.Загрузить(РасшифровкаПлатежа); 
	ПлатежныйДокумент.СуммаДокументаВВалюте = ПлатежныйДокумент.РасшифровкаПлатежа.Итог("СуммаВал");
	ПлатежныйДокумент.СуммаДокумента = ПлатежныйДокумент.РасшифровкаПлатежа.Итог("Сумма");
		
КонецПроцедуры

Процедура ЗаполнитьНаОснованииРешенияОКомандировании(ПлатежныйДокумент, ДанныеЗаполнения, Отказ) Экспорт
	
	ЭтоИзменение = ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование);
	
	ПлатежныйДокумент.ДокументОснование = ДанныеЗаполнения;
	ПлатежныйДокумент.Организация = ДанныеЗаполнения.Организация;
	ПлатежныйДокумент.ИФО = ДанныеЗаполнения.ИФО;
    ПлатежныйДокумент.Договор = ДанныеЗаполнения.ОснованиеПринятияОбязательства;
    ПлатежныйДокумент.КорСчет = БухгалтерскийУчет.СчетПоКоду("208.00", ТекущаяДатаСеанса(), ПлатежныйДокумент.Организация);
	ПлатежныйДокумент.Договор = ДанныеЗаполнения.ОснованиеПринятияОбязательства;
	ПлатежныйДокумент.ЛицевойСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.РазделЛицевогоСчета, "Владелец");
	Если ЗначениеЗаполнено(ПлатежныйДокумент.ЛицевойСчет) Тогда
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.ЛицевойСчет, "МаксДлинаНазначенияПлатежа"); 
		ПлатежныйДокумент.МодульИнтеграции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.ЛицевойСчет, "МодульИнтеграции"); 
		Если НЕ ЗначениеЗаполнено(ПлатежныйДокумент.МодульИнтеграции) ИЛИ ПлатежныйДокумент.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.НетИнтеграции") Тогда
			ВызватьИсключение "Документ РСКП (перечисление) не применяется для указанного лицевого счета";  
		КонецЕсли;
	Иначе
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = 240;
	КонецЕсли;
	
	ПлатежныйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить(); 
	КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПлатежныйДокумент.ВалютаДокумента, ПлатежныйДокумент.Дата);
	ПлатежныйДокумент.Курс = КурсКратность.Курс;
	ПлатежныйДокумент.Кратность = КурсКратность.Кратность;
	
	ПлатежныйДокумент.НесколькоПолучателей = 0;
	ПлатежныйДокумент.Контрагенты.Очистить();
	СтрКонтрагент = ПлатежныйДокумент.Контрагенты.Добавить();  
	СтрКонтрагент.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	СтрКонтрагент.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Сотрудник, "Контрагент");
	Если ЗначениеЗаполнено(СтрКонтрагент.Контрагент) Тогда
		СтрКонтрагент.СчетКонтрагента = Справочники.БанковскиеИКазначейскиеСчета.ПолучитьСчетПоУмолчанию(СтрКонтрагент.Контрагент, "Документ.РСКППеречисление.Контрагенты");
	КонецЕсли;
	ЗаполнитьРеквизитыПолучателя(СтрКонтрагент);
	
	ПлатежныйДокумент.РасшифровкаПлатежа.Очистить();  
	ПлатежныйДокумент.ДетализацияПлатежа.Очистить(); 

	ТаблицаКЭК = ДанныеЗаполнения.ФинансовоеОбеспечение.Выгрузить();  
	ТаблицаКПС = ДанныеЗаполнения.ФинансовоеОбеспечение.Выгрузить(); 
	ТаблицаКПС.Свернуть("КФО, КПС, КодЦели", "СуммаАванса, ИзменениеАванса");
	
	РасшифровкаПлатежа = ПлатежныйДокумент.РасшифровкаПлатежа.Выгрузить(); 
	РасшифровкаПлатежа.Колонки.Добавить("КодПоступленияЕБП", Новый ОписаниеТипов("ПеречислениеСсылка.КодыПоступленийЕБП"));
	
	Для Каждого СтрокаСостава Из ТаблицаКПС Цикл  
		Если ЭтоИзменение Тогда
			Если СтрокаСостава.ИзменениеАванса > 0 Тогда
				Сумма = СтрокаСостава.ИзменениеАванса;
			Иначе
				Продолжить;
			КонецЕсли;
		Иначе
			Сумма = СтрокаСостава.СуммаАванса;
		КонецЕсли;
		Если Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
       	СтрокаРасшифровки = РасшифровкаПлатежа.Добавить();
		СтрокаРасшифровки.КБКНазначениеПлатежа = СтрокаСостава.КПС;
		СтрокаРасшифровки.РазделЛС = ПлатежноРасчетныеДокументы.РазделЛСПоКодуПоступленияИлиКФО(ПлатежныйДокумент.ЛицевойСчет,,, СтрокаСостава.КФО); 
		СтрокаРасшифровки.КодПоступленияЕБП = ПлатежноРасчетныеДокументыКлиентСервер.КодПоступленияЕБППоКФО(СтрокаСостава.КФО, ТекущаяДатаСеанса());
		СтрокаРасшифровки.НаправлениеПлатежа = ""; // Определять по КВР 
		СтрокаРасшифровки.КодЦели = СтрокаСостава.КодЦели;
		СтрокаРасшифровки.СуммаВал = Сумма;
		СтрокаРасшифровки.Сумма = Сумма;
		СтрокаРасшифровки.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		// Детализация 
		СтрокиДетализации = ТаблицаКЭК.НайтиСтроки(Новый Структура("КФО, КПС, КодЦели", СтрокаСостава.КФО, СтрокаСостава.КПС, СтрокаСостава.КодЦели)); 
		Для Каждого Стр Из СтрокиДетализации Цикл
			СтрДетализации = ПлатежныйДокумент.ДетализацияПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДетализации, СтрокаРасшифровки);
			СтрДетализации.КОСГУНазначениеПлатежа = Стр.КЭК;
			СтрДетализации.КодМероприятия = Стр.КодМероприятия;
			СтрДетализации.ДопКлассификация = Стр.ДопКлассификация;
			СтрДетализации.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(СтрДетализации.КОСГУНазначениеПлатежа, 
				ПлатежныйДокумент.КорСчет,, 
				ПлатежныйДокумент.Дата, 
				ПлатежныйДокумент.Организация, 
				ПлатежныйДокумент.ИФО);
			СтрДетализации.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг; 
			СтрДетализации.Контрагент = ПлатежныйДокумент.Контрагенты[0].Контрагент; 
			СтрДетализации.Подразделение = ДанныеЗаполнения.Подразделение;
			СтрДетализации.СуммаВал = Стр.Сумма;
			СтрДетализации.Сумма = Стр.Сумма;
		КонецЦикла;
	КонецЦикла;  
	
	ПлатежныйДокумент.НесколькоКодовБК = ?(РасшифровкаПлатежа.Количество() > 1, 1, 0); 
	
	РеквизитыДокументаОснования = ПлатежныйДокумент.РеквизитыДокументаОснования.Выгрузить();
	РеквизитыДокументаОснования.Колонки.Добавить("НазначениеПлатежа", Новый ОписаниеТипов("Булево")); 
	ПлатежноРасчетныеДокументы.ЗаполнитьПризнакНазначенияПлатежаВСпискеОснований(РеквизитыДокументаОснования);
	
	ПлатежноРасчетныеДокументыКлиентСервер.СформироватьТекстНазначенияПлатежаРСКППеречисление(ПлатежныйДокумент, 
		РасшифровкаПлатежа,
		ПлатежныйДокумент.Контрагенты,
		РеквизитыДокументаОснования,
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа); 
		
	ПлатежныйДокумент.РасшифровкаПлатежа.Загрузить(РасшифровкаПлатежа); 
	ПлатежныйДокумент.СуммаДокументаВВалюте = ПлатежныйДокумент.РасшифровкаПлатежа.Итог("СуммаВал");
	ПлатежныйДокумент.СуммаДокумента = ПлатежныйДокумент.РасшифровкаПлатежа.Итог("Сумма");

КонецПроцедуры   

Процедура ЗаполнитьНаОснованииЗаявкиОбоснования(ПлатежныйДокумент, ДанныеЗаполнения, Отказ) Экспорт   
	
	ПлатежныйДокумент.ДокументОснование = ДанныеЗаполнения;
	ПлатежныйДокумент.Организация = ДанныеЗаполнения.Организация;
	ПлатежныйДокумент.ИФО = ДанныеЗаполнения.ИФО;
    ПлатежныйДокумент.Договор = ДанныеЗаполнения.ОснованиеПринятияОбязательства;
    ПлатежныйДокумент.КорСчет = БухгалтерскийУчет.СчетПоКоду("208.00", ТекущаяДатаСеанса(), ПлатежныйДокумент.Организация);
	ПлатежныйДокумент.ЛицевойСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.РазделЛицевогоСчета, "Владелец");
	Если ЗначениеЗаполнено(ПлатежныйДокумент.ЛицевойСчет) Тогда
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.ЛицевойСчет, "МаксДлинаНазначенияПлатежа"); 
		ПлатежныйДокумент.МодульИнтеграции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.ЛицевойСчет, "МодульИнтеграции"); 
		Если НЕ ЗначениеЗаполнено(ПлатежныйДокумент.МодульИнтеграции) ИЛИ ПлатежныйДокумент.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.НетИнтеграции") Тогда
			ВызватьИсключение "Документ РСКП (перечисление) не применяется для указанного лицевого счета";  
		КонецЕсли;
	Иначе
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = 240;
	КонецЕсли;
	
	ПлатежныйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить(); 
	КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПлатежныйДокумент.ВалютаДокумента, ПлатежныйДокумент.Дата);
	ПлатежныйДокумент.Курс = КурсКратность.Курс;
	ПлатежныйДокумент.Кратность = КурсКратность.Кратность; 
	
	ПлатежныйДокумент.НесколькоПолучателей = 0;
	ПлатежныйДокумент.Контрагенты.Очистить();
	СтрКонтрагент = ПлатежныйДокумент.Контрагенты.Добавить();  
	СтрКонтрагент.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	СтрКонтрагент.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.ПодотчетноеЛицо, "Контрагент"); 
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо") Тогда
		СтрКонтрагент.СчетКонтрагента = ДанныеЗаполнения.СчетДляПеречисленияДенежныхСредств;
	КонецЕсли;	
	Если ЗначениеЗаполнено(СтрКонтрагент.Контрагент) И НЕ ЗначениеЗаполнено(СтрКонтрагент.СчетКонтрагента) Тогда
		СтрКонтрагент.СчетКонтрагента = Справочники.БанковскиеИКазначейскиеСчета.ПолучитьСчетПоУмолчанию(СтрКонтрагент.Контрагент, "Документ.РСКППеречисление.Контрагенты");
	КонецЕсли;
	ЗаполнитьРеквизитыПолучателя(СтрКонтрагент);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо") Тогда
		ПлатежныйДокумент.Договор = ДанныеЗаполнения.ОснованиеПринятияОбязательства;
	Иначе
		ПлатежныйДокумент.Договор = ДанныеЗаполнения.Договор;
	КонецЕсли;
	
	ТаблицаКЭК = ДанныеЗаполнения.ТоварыРаботыУслуги.Выгрузить(); 
	ТаблицаКЭК.Свернуть("КФО, КПС, КЭК, КодЦели, КодМероприятия, ДопКлассификация, Подразделение", "Сумма"); 
	ТаблицаКПС = ДанныеЗаполнения.ТоварыРаботыУслуги.Выгрузить(); 
	ТаблицаКПС.Свернуть("КФО, КПС, КодЦели", "Сумма");
	
	РасшифровкаПлатежа = ПлатежныйДокумент.РасшифровкаПлатежа.Выгрузить(); 
	РасшифровкаПлатежа.Колонки.Добавить("КодПоступленияЕБП", Новый ОписаниеТипов("ПеречислениеСсылка.КодыПоступленийЕБП"));
	
	Для Каждого СтрокаСостава Из ТаблицаКПС Цикл  
		СтрокаРасшифровки = РасшифровкаПлатежа.Добавить();
		СтрокаРасшифровки.КБКНазначениеПлатежа = СтрокаСостава.КПС;
		СтрокаРасшифровки.РазделЛС = ПлатежноРасчетныеДокументы.РазделЛСПоКодуПоступленияИлиКФО(ПлатежныйДокумент.ЛицевойСчет,,, СтрокаСостава.КФО); 
		СтрокаРасшифровки.КодПоступленияЕБП = ПлатежноРасчетныеДокументыКлиентСервер.КодПоступленияЕБППоКФО(СтрокаСостава.КФО, ТекущаяДатаСеанса());
		СтрокаРасшифровки.НаправлениеПлатежа = ""; // Определять по КВР 
		СтрокаРасшифровки.КодЦели = СтрокаСостава.КодЦели;
		СтрокаРасшифровки.СуммаВал = СтрокаСостава.Сумма;
		СтрокаРасшифровки.Сумма = СтрокаСостава.Сумма;
		СтрокаРасшифровки.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		// Детализация 
		СтрокиДетализации = ТаблицаКЭК.НайтиСтроки(Новый Структура("КФО, КПС, КодЦели", СтрокаСостава.КФО, СтрокаСостава.КПС, СтрокаСостава.КодЦели)); 
		Для Каждого Стр Из СтрокиДетализации Цикл
			СтрДетализации = ПлатежныйДокумент.ДетализацияПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДетализации, СтрокаРасшифровки);
			СтрДетализации.КОСГУНазначениеПлатежа = Стр.КЭК;
			СтрДетализации.КодМероприятия = Стр.КодМероприятия;
			СтрДетализации.ДопКлассификация = Стр.ДопКлассификация;
			СтрДетализации.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(СтрДетализации.КОСГУНазначениеПлатежа, 
				ПлатежныйДокумент.КорСчет,, 
				ПлатежныйДокумент.Дата, 
				ПлатежныйДокумент.Организация, 
				ПлатежныйДокумент.ИФО);
			СтрДетализации.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг; 
			СтрДетализации.Контрагент = ПлатежныйДокумент.Контрагенты[0].Контрагент;  
			Если ЗначениеЗаполнено(Стр.Подразделение) Тогда
				СтрДетализации.Подразделение = Стр.Подразделение;
			Иначе
				СтрДетализации.Подразделение = ДанныеЗаполнения.Подразделение;
			КонецЕсли;
			СтрДетализации.СуммаВал = Стр.Сумма;
			СтрДетализации.Сумма = Стр.Сумма;
		КонецЦикла;
	КонецЦикла;  

	ПлатежныйДокумент.НесколькоКодовБК = ?(РасшифровкаПлатежа.Количество() > 1, 1, 0); 
	
	РеквизитыДокументаОснования = ПлатежныйДокумент.РеквизитыДокументаОснования.Выгрузить();
	РеквизитыДокументаОснования.Колонки.Добавить("НазначениеПлатежа", Новый ОписаниеТипов("Булево")); 
	ПлатежноРасчетныеДокументы.ЗаполнитьПризнакНазначенияПлатежаВСпискеОснований(РеквизитыДокументаОснования);
	
	ПлатежноРасчетныеДокументыКлиентСервер.СформироватьТекстНазначенияПлатежаРСКППеречисление(ПлатежныйДокумент, 
		РасшифровкаПлатежа,
		ПлатежныйДокумент.Контрагенты,
		РеквизитыДокументаОснования,
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа); 
		
	ПлатежныйДокумент.РасшифровкаПлатежа.Загрузить(РасшифровкаПлатежа); 
	ПлатежныйДокумент.СуммаДокументаВВалюте = ПлатежныйДокумент.РасшифровкаПлатежа.Итог("СуммаВал");
	ПлатежныйДокумент.СуммаДокумента = ПлатежныйДокумент.РасшифровкаПлатежа.Итог("Сумма");
	
КонецПроцедуры 

Процедура ЗаполнитьНаОснованииОтчетаОРасходахПодотчетногоЛица(ПлатежныйДокумент, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	ПлатежныйДокумент.ДокументОснование = ДанныеЗаполнения;  
	ПлатежныйДокумент.Организация = ДанныеЗаполнения.Организация;
	ПлатежныйДокумент.ИФО = ДанныеЗаполнения.ИФО;
    ПлатежныйДокумент.Договор = ДанныеЗаполнения.ОснованиеПринятияОбязательства;
    ПлатежныйДокумент.КорСчет = БухгалтерскийУчет.СчетПоКоду("208.00", ТекущаяДатаСеанса(), ПлатежныйДокумент.Организация);
	ПлатежныйДокумент.ЛицевойСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.РазделЛицевогоСчета, "Владелец");
	Если ЗначениеЗаполнено(ПлатежныйДокумент.ЛицевойСчет) Тогда
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.ЛицевойСчет, "МаксДлинаНазначенияПлатежа"); 
		ПлатежныйДокумент.МодульИнтеграции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.ЛицевойСчет, "МодульИнтеграции"); 
		Если НЕ ЗначениеЗаполнено(ПлатежныйДокумент.МодульИнтеграции) ИЛИ ПлатежныйДокумент.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.НетИнтеграции") Тогда
			ВызватьИсключение "Документ РСКП (перечисление) не применяется для указанного лицевого счета";  
		КонецЕсли;
	Иначе
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = 240;
	КонецЕсли;
	
	ПлатежныйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить(); 
	КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПлатежныйДокумент.ВалютаДокумента, ПлатежныйДокумент.Дата);
	ПлатежныйДокумент.Курс = КурсКратность.Курс;
	ПлатежныйДокумент.Кратность = КурсКратность.Кратность; 
	
	ПлатежныйДокумент.НесколькоПолучателей = 0;
	ПлатежныйДокумент.Контрагенты.Очистить();
	СтрКонтрагент = ПлатежныйДокумент.Контрагенты.Добавить();  
	СтрКонтрагент.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	СтрКонтрагент.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Сотрудник, "Контрагент"); 
	Если ЗначениеЗаполнено(СтрКонтрагент.Контрагент) Тогда
		СтрКонтрагент.СчетКонтрагента = Справочники.БанковскиеИКазначейскиеСчета.ПолучитьСчетПоУмолчанию(СтрКонтрагент.Контрагент, "Документ.РСКППеречисление.Контрагенты");
	КонецЕсли;
	ЗаполнитьРеквизитыПолучателя(СтрКонтрагент);
    	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет208", БухгалтерскийУчет.СписокСчетов("208.00"));
	Запрос.УстановитьПараметр("Организация", ДанныеЗаполнения.Организация);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	Запрос.УстановитьПараметр("Субконто1", СтрКонтрагент.Контрагент);
	Запрос.УстановитьПараметр("ОтчетОРасходахПодотчетногоЛица", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("ДокументыАвансов", ДанныеЗаполнения.Получено.ВыгрузитьКолонку("ДокументАванса"));
	Запрос.УстановитьПараметр("Счет105", БухгалтерскийУчет.СписокСчетов("105.00", ДанныеЗаполнения.Дата));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетОРасходахПодотчетногоЛицаТоварыРаботыУслуги.ПриходныйДокумент КАК ДокументРасхода
	|ПОМЕСТИТЬ ДокументыРасходов
	|ИЗ
	|	Документ.ОтчетОРасходахПодотчетногоЛица.ТоварыРаботыУслуги КАК ОтчетОРасходахПодотчетногоЛицаТоварыРаботыУслуги
	|ГДЕ
	|	ОтчетОРасходахПодотчетногоЛицаТоварыРаботыУслуги.Ссылка = &ОтчетОРасходахПодотчетногоЛица
	|	И ОтчетОРасходахПодотчетногоЛицаТоварыРаботыУслуги.ПоДокументу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетОРасходахПодотчетногоЛица.Ссылка
	|ИЗ
	|	Документ.ОтчетОРасходахПодотчетногоЛица КАК ОтчетОРасходахПодотчетногоЛица
	|ГДЕ
	|	ОтчетОРасходахПодотчетногоЛица.Ссылка = &ОтчетОРасходахПодотчетногоЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОбороты.Счет КАК Счет,
	|	ЖурналПроводокЕПСБУОбороты.КПС КАК КПС,
	|	ЖурналПроводокЕПСБУОбороты.КФО КАК КФО,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУОбороты.Регистратор В (&ДокументыАвансов)
	|			ТОГДА 
	|				ЖурналПроводокЕПСБУОбороты.СуммаОборотДт - ЖурналПроводокЕПСБУОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Получено,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУОбороты.Регистратор В
	|				(ВЫБРАТЬ
	|					Т.ДокументРасхода
	|				ИЗ
	|					ДокументыРасходов КАК Т)
	|			ТОГДА
	|				ЖурналПроводокЕПСБУОбороты.СуммаОборотКт - ЖурналПроводокЕПСБУОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Израсходовано,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУОбороты.Регистратор В
	|					(ВЫБРАТЬ
	|						Т.ДокументРасхода
	|					ИЗ
	|						ДокументыРасходов КАК Т)
	|				И ЖурналПроводокЕПСБУОбороты.КорСчет В (&Счет105)
	|			ТОГДА ЖурналПроводокЕПСБУОбороты.КЭККор
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)
	|	КОНЕЦ КАК КЭКРасходов
	|ПОМЕСТИТЬ ДетальныеДанные
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Счет В (&Счет208),
	|			,
	|			Организация = &Организация
	|				И Субконто1 = &Субконто1,
	|			,
	|			) КАК ЖурналПроводокЕПСБУОбороты
	|ГДЕ
	|	(ЖурналПроводокЕПСБУОбороты.Регистратор В (&ДокументыАвансов)
	|			ИЛИ ЖурналПроводокЕПСБУОбороты.Регистратор В
	|				(ВЫБРАТЬ
	|					Т.ДокументРасхода
	|				ИЗ
	|					ДокументыРасходов КАК Т))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДетальныеДанные.Счет КАК Счет,
	|	МАКСИМУМ(СоответствияАналитическихСчетовКЭК.КЭК) КАК КЭК
	|ПОМЕСТИТЬ СчетКЭК
	|ИЗ
	|	ДетальныеДанные КАК ДетальныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияАналитическихСчетовКЭК КАК СоответствияАналитическихСчетовКЭК
	|		ПО ДетальныеДанные.Счет = СоответствияАналитическихСчетовКЭК.Счет
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетальныеДанные.Счет
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствияАналитическихСчетовКЭК.КЭК) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДетальныеДанные.Счет КАК Счет,
	|	МАКСИМУМ(ДетальныеДанные.КЭКРасходов) КАК КЭК
	|ПОМЕСТИТЬ СчетКЭК2
	|ИЗ
	|	ДетальныеДанные КАК ДетальныеДанные
	|ГДЕ
	|	ДетальныеДанные.КЭКРасходов <> ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетальныеДанные.Счет
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДетальныеДанные.КЭКРасходов) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДетальныеДанные.Счет КАК КорСчет,
	|	ДетальныеДанные.КПС КАК КПС,
	|	ДетальныеДанные.КФО КАК КФО,
	|	ВЫБОР
	|		КОГДА СУММА(ДетальныеДанные.Получено) - СУММА(ДетальныеДанные.Израсходовано) < 0
	|			ТОГДА -СУММА(ДетальныеДанные.Получено) + СУММА(ДетальныеДанные.Израсходовано)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	ОтчетОРасходахПодотчетногоЛица.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА НЕ СчетКЭК2.КЭК ЕСТЬ NULL
	|			ТОГДА СчетКЭК2.КЭК
	|		КОГДА НЕ СчетКЭК.КЭК ЕСТЬ NULL
	|			ТОГДА СчетКЭК.КЭК
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)
	|	КОНЕЦ КАК КЭК
	|ИЗ
	|	ДетальныеДанные КАК ДетальныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетКЭК КАК СчетКЭК
	|		ПО ДетальныеДанные.Счет = СчетКЭК.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетКЭК2 КАК СчетКЭК2
	|		ПО ДетальныеДанные.Счет = СчетКЭК2.Счет,
	|	Документ.ОтчетОРасходахПодотчетногоЛица КАК ОтчетОРасходахПодотчетногоЛица
	|ГДЕ
	|	ОтчетОРасходахПодотчетногоЛица.Ссылка = &ОтчетОРасходахПодотчетногоЛица
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетальныеДанные.Счет,
	|	ДетальныеДанные.КПС,
	|	ДетальныеДанные.КФО,
	|	ОтчетОРасходахПодотчетногоЛица.Подразделение,
	|	СчетКЭК2.КЭК,
	|	СчетКЭК.КЭК
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДетальныеДанные.Получено) - СУММА(ДетальныеДанные.Израсходовано) < 0";
	
	
	ТаблицаКЭК = Запрос.Выполнить().Выгрузить();
	ТаблицаКПС = ТаблицаКЭК.Скопировать();	
	ТаблицаКЭК.Свернуть("КФО, КПС, КЭК, КорСчет, Подразделение", "Сумма"); 
	ТаблицаКПС.Свернуть("КФО, КПС", "Сумма");
	
	РасшифровкаПлатежа = ПлатежныйДокумент.РасшифровкаПлатежа.Выгрузить(); 
	РасшифровкаПлатежа.Колонки.Добавить("КодПоступленияЕБП", Новый ОписаниеТипов("ПеречислениеСсылка.КодыПоступленийЕБП"));
	
	Для Каждого СтрокаСостава Из ТаблицаКПС Цикл  
		СтрокаРасшифровки = РасшифровкаПлатежа.Добавить();
		СтрокаРасшифровки.КБКНазначениеПлатежа = СтрокаСостава.КПС;
		СтрокаРасшифровки.РазделЛС = ПлатежноРасчетныеДокументы.РазделЛСПоКодуПоступленияИлиКФО(ПлатежныйДокумент.ЛицевойСчет,,, СтрокаСостава.КФО); 
		СтрокаРасшифровки.КодПоступленияЕБП = ПлатежноРасчетныеДокументыКлиентСервер.КодПоступленияЕБППоКФО(СтрокаСостава.КФО, ТекущаяДатаСеанса());
		СтрокаРасшифровки.НаправлениеПлатежа = ""; // Определять по КВР 
		СтрокаРасшифровки.Сумма = СтрокаСостава.Сумма; 
		СтрокаРасшифровки.СуммаВал = СтрокаСостава.Сумма;
		СтрокаРасшифровки.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		// Детализация 
		СтрокиДетализации = ТаблицаКЭК.НайтиСтроки(Новый Структура("КФО, КПС", СтрокаСостава.КФО, СтрокаСостава.КПС)); 
		Для Каждого Стр Из СтрокиДетализации Цикл
			СтрДетализации = ПлатежныйДокумент.ДетализацияПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДетализации, СтрокаРасшифровки);
			СтрДетализации.КОСГУНазначениеПлатежа = Стр.КЭК;
			СтрДетализации.СчетРасчетов = Стр.КорСчет;
			СтрДетализации.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг; 
			СтрДетализации.Контрагент = ПлатежныйДокумент.Контрагенты[0].Контрагент;  
			СтрДетализации.Подразделение = Стр.Подразделение;
			СтрДетализации.СуммаВал = Стр.Сумма;
			СтрДетализации.Сумма = Стр.Сумма;
		КонецЦикла;
	КонецЦикла;  
	
	ПлатежныйДокумент.НесколькоКодовБК = ?(РасшифровкаПлатежа.Количество() > 1, 1, 0); 
	
	РеквизитыДокументаОснования = ПлатежныйДокумент.РеквизитыДокументаОснования.Выгрузить();
	РеквизитыДокументаОснования.Колонки.Добавить("НазначениеПлатежа", Новый ОписаниеТипов("Булево")); 
	ПлатежноРасчетныеДокументы.ЗаполнитьПризнакНазначенияПлатежаВСпискеОснований(РеквизитыДокументаОснования);
	
	ПлатежноРасчетныеДокументыКлиентСервер.СформироватьТекстНазначенияПлатежаРСКППеречисление(ПлатежныйДокумент, 
		РасшифровкаПлатежа,
		ПлатежныйДокумент.Контрагенты,
		РеквизитыДокументаОснования,
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа); 
		
	ПлатежныйДокумент.РасшифровкаПлатежа.Загрузить(РасшифровкаПлатежа); 
	ПлатежныйДокумент.СуммаДокументаВВалюте = ПлатежныйДокумент.РасшифровкаПлатежа.Итог("СуммаВал");
	ПлатежныйДокумент.СуммаДокумента = ПлатежныйДокумент.РасшифровкаПлатежа.Итог("Сумма");
		
КонецПроцедуры

Процедура ЗаполнитьНаОснованииЗаявленияНаВыдачуАванса(ПлатежныйДокумент, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ДанныеЗаполнения.СуммаДокумента > 0 И ДанныеЗаполнения.СуммаДокументаВВалюте > 0 Тогда
		ТекстИсключения = НСтр("ru='Ввод на основании заявления на выдачу аванса в нескольких валютах невозможен!'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;  
	
	ПлатежныйДокумент.ДокументОснование = ДанныеЗаполнения;  
	ПлатежныйДокумент.Организация = ДанныеЗаполнения.Организация;
	ПлатежныйДокумент.ИФО = ДанныеЗаполнения.ИФО;
    ПлатежныйДокумент.Договор = ДанныеЗаполнения.ОснованиеПринятияОбязательства;
    ПлатежныйДокумент.КорСчет = БухгалтерскийУчет.СчетПоКоду("208.00", ТекущаяДатаСеанса(), ПлатежныйДокумент.Организация);
	ПлатежныйДокумент.ЛицевойСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.РазделЛицевогоСчета, "Владелец");
	Если ЗначениеЗаполнено(ПлатежныйДокумент.ЛицевойСчет) Тогда
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.ЛицевойСчет, "МаксДлинаНазначенияПлатежа"); 
		ПлатежныйДокумент.МодульИнтеграции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.ЛицевойСчет, "МодульИнтеграции"); 
		Если НЕ ЗначениеЗаполнено(ПлатежныйДокумент.МодульИнтеграции) ИЛИ ПлатежныйДокумент.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.НетИнтеграции") Тогда
			ВызватьИсключение "Документ РСКП (перечисление) не применяется для указанного лицевого счета";  
		КонецЕсли;
	Иначе 
		Умолчания = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(ПлатежныйДокумент.Организация, "Документ.РСКППеречисление", ПлатежныйДокумент.Дата, Перечисления.ТипыЛицевыхСчетов.Казначейский,,, Неопределено);
		ПлатежныйДокумент.ЛицевойСчет = Умолчания.ЛицевойСчет; 
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежныйДокумент.ЛицевойСчет, "МаксДлинаНазначенияПлатежа"); 
	КонецЕсли;  
	
	ПлатежныйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить(); 
	КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ПлатежныйДокумент.ВалютаДокумента, ПлатежныйДокумент.Дата);
	ПлатежныйДокумент.Курс = КурсКратность.Курс;
	ПлатежныйДокумент.Кратность = КурсКратность.Кратность; 
	
	ПлатежныйДокумент.НесколькоПолучателей = 0;
	ПлатежныйДокумент.Контрагенты.Очистить();
	СтрКонтрагент = ПлатежныйДокумент.Контрагенты.Добавить();  
	СтрКонтрагент.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	СтрКонтрагент.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Сотрудник, "Контрагент"); 
	Если ЗначениеЗаполнено(СтрКонтрагент.Контрагент) Тогда
		СтрКонтрагент.СчетКонтрагента = Справочники.БанковскиеИКазначейскиеСчета.ПолучитьСчетПоУмолчанию(СтрКонтрагент.Контрагент, "Документ.РСКППеречисление.Контрагенты");
	КонецЕсли;
	ЗаполнитьРеквизитыПолучателя(СтрКонтрагент);

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЗаявлениеНаВыдачуАвансаРасчетРазмераАванса.КФО КАК КФО,
	|	ЗаявлениеНаВыдачуАвансаРасчетРазмераАванса.КПС КАК КПС,
	|	ЗаявлениеНаВыдачуАвансаРасчетРазмераАванса.КЭК КАК КЭК,
	|	ЗаявлениеНаВыдачуАвансаРасчетРазмераАванса.КодЦели КАК КодЦели,
	|	ЗаявлениеНаВыдачуАвансаРасчетРазмераАванса.КодМероприятия КАК КодМероприятия,
	|	ЗаявлениеНаВыдачуАвансаРасчетРазмераАванса.ДопКлассификация КАК ДопКлассификация,
	|	ЗаявлениеНаВыдачуАвансаРасчетРазмераАванса.Сумма КАК Сумма,
	|	ЗаявлениеНаВыдачуАвансаРасчетРазмераАванса.Ссылка.Подразделение КАК Подразделение
	|ИЗ
	|	Документ.ЗаявлениеНаВыдачуАванса.РасчетРазмераАванса КАК ЗаявлениеНаВыдачуАвансаРасчетРазмераАванса
	|ГДЕ
	|	ЗаявлениеНаВыдачуАвансаРасчетРазмераАванса.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	ТаблицаКЭК = Запрос.Выполнить().Выгрузить();
	ТаблицаКПС = ТаблицаКЭК.Скопировать();	 
	ТаблицаКПС.Свернуть("КФО, КПС, КодЦели", "Сумма");  
	
	РасшифровкаПлатежа = ПлатежныйДокумент.РасшифровкаПлатежа.Выгрузить(); 
	РасшифровкаПлатежа.Колонки.Добавить("КодПоступленияЕБП", Новый ОписаниеТипов("ПеречислениеСсылка.КодыПоступленийЕБП"));
	
	Для Каждого СтрокаСостава Из ТаблицаКПС Цикл  
		СтрокаРасшифровки = РасшифровкаПлатежа.Добавить();
		СтрокаРасшифровки.КБКНазначениеПлатежа = СтрокаСостава.КПС;
		СтрокаРасшифровки.РазделЛС = ПлатежноРасчетныеДокументы.РазделЛСПоКодуПоступленияИлиКФО(ПлатежныйДокумент.ЛицевойСчет,,, СтрокаСостава.КФО); 
		СтрокаРасшифровки.КодПоступленияЕБП = ПлатежноРасчетныеДокументыКлиентСервер.КодПоступленияЕБППоКФО(СтрокаСостава.КФО, ТекущаяДатаСеанса());
		СтрокаРасшифровки.НаправлениеПлатежа = ""; // Определять по КВР 
		СтрокаРасшифровки.Сумма = СтрокаСостава.Сумма; 
		СтрокаРасшифровки.СуммаВал = СтрокаСостава.Сумма;
		СтрокаРасшифровки.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		// Детализация 
		СтрокиДетализации = ТаблицаКЭК.НайтиСтроки(Новый Структура("КФО, КПС", СтрокаСостава.КФО, СтрокаСостава.КПС)); 
		Для Каждого Стр Из СтрокиДетализации Цикл
			СтрДетализации = ПлатежныйДокумент.ДетализацияПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(СтрДетализации, СтрокаРасшифровки);
			СтрДетализации.КОСГУНазначениеПлатежа = Стр.КЭК; 
			СтрДетализации.Контрагент = ПлатежныйДокумент.Контрагенты[0].Контрагент;  
			СтрДетализации.Подразделение = Стр.Подразделение;
			СтрДетализации.ДопКлассификация = Стр.ДопКлассификация; 
           	СтрДетализации.КодМероприятия = Стр.КодМероприятия;
            СтрДетализации.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					СтрДетализации.КОСГУНазначениеПлатежа, ПлатежныйДокумент.КорСчет,,, ПлатежныйДокумент.Организация, ПлатежныйДокумент.ИФО);
			СтрДетализации.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг; 
			СтрДетализации.СуммаВал = Стр.Сумма;
			СтрДетализации.Сумма = Стр.Сумма;
		КонецЦикла;
	КонецЦикла;  

    ПлатежныйДокумент.НесколькоКодовБК = ?(РасшифровкаПлатежа.Количество() > 1, 1, 0); 
	
	РеквизитыДокументаОснования = ПлатежныйДокумент.РеквизитыДокументаОснования.Выгрузить();
	РеквизитыДокументаОснования.Колонки.Добавить("НазначениеПлатежа", Новый ОписаниеТипов("Булево")); 
	ПлатежноРасчетныеДокументы.ЗаполнитьПризнакНазначенияПлатежаВСпискеОснований(РеквизитыДокументаОснования);
	
	ПлатежноРасчетныеДокументыКлиентСервер.СформироватьТекстНазначенияПлатежаРСКППеречисление(ПлатежныйДокумент, 
		РасшифровкаПлатежа,
		ПлатежныйДокумент.Контрагенты,
		РеквизитыДокументаОснования,
		УстановленнаяМаксимальнаяДлинаНазначенияПлатежа); 
		
	ПлатежныйДокумент.РасшифровкаПлатежа.Загрузить(РасшифровкаПлатежа); 
	ПлатежныйДокумент.СуммаДокументаВВалюте = ПлатежныйДокумент.РасшифровкаПлатежа.Итог("СуммаВал");
	ПлатежныйДокумент.СуммаДокумента = ПлатежныйДокумент.РасшифровкаПлатежа.Итог("Сумма");
	
КонецПроцедуры	

Процедура ОтразитьРезультатОбработкиДокументаЕБП(ДокументСсылка, ДанныеКОбработке, ИнформацияОбОшибке = "", ЕстьВложения) Экспорт
	
	ТекстСтатусаЕБП = "";
	Если НЕ ДанныеКОбработке.Свойство("СтатусРСКП", ТекстСтатусаЕБП) Тогда
		ИнформацияОбОшибке = НСтр("ru = 'Не указан статус РСКП, присвоенный в ЕБП, обработка невозможна.'"); 
		Возврат;
	КонецЕсли;
	
	НовыйСтатусДокумента = ПлатежноРасчетныеДокументы.СтатусДокументаЕБП(ТекстСтатусаЕБП); 
	Если НовыйСтатусДокумента = Неопределено Тогда
		ИнформацияОбОшибке = НСтр("ru = 'Не удалось определить статус РСКП, присвоенный в ЕБП (%1), обработка невозможна.'");
		ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИнформацияОбОшибке, ТекстСтатусаЕБП);
		Возврат;
	КонецЕсли;

	ТекущийСтатусДокумента = ПлатежноРасчетныеДокументы.ПолучитьСостояниеЗаявки(ДокументСсылка);  
	
	Если ТекущийСтатусДокумента.Статус = НовыйСтатусДокумента Тогда
		Возврат;
	КонецЕсли;
   	
	НачатьТранзакцию();
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.РСКППеречисление");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументСсылка); 
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостояниеПлатежноРасчетныхДокументов");
		ЭлементБлокировки.УстановитьЗначение("ПлатежноРасчетныйДокумент", ДокументСсылка); 
		Блокировка.Заблокировать();  
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДанныеКОбработке.Свойство("НомерРСКП", ДокументОбъект.НомерРСКП);
		ДанныеКОбработке.Свойство("ДатаРСКП", ДокументОбъект.ДатаРСКП); 
		ДанныеКОбработке.Свойство("ПриоритетИсполнения", ДокументОбъект.ПриоритетИсполнения);
		ДанныеКОбработке.Свойство("ПредельнаяДатаИсполнения", ДокументОбъект.ПредельнаяДатаИсполнения);  
		Если НовыйСтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыИсполненияДокумента.Исполнен")
			ИЛИ НовыйСтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыИсполненияДокумента.ИсполненЧастично")
			Тогда
			Если ДанныеКОбработке.ФАЙЛЫПРИЛОЖЕНИЯ.Количество() > 0 Тогда
				Для Каждого СтрВложений Из ДанныеКОбработке.ФАЙЛЫПРИЛОЖЕНИЯ Цикл
					Если ДокументОбъект.ФайлыПриложения.Найти(СтрВложений.ИдентификаторФайла, "ИдентификаторФайла") = Неопределено Тогда 
						СтрДокумента = ДокументОбъект.ФайлыПриложения.Добавить();
						СтрДокумента.ИдентификаторФайла = СтрВложений.ИдентификаторФайла;
						СтрДокумента.Внешний = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		ДокументОбъект.Записать();	
		
		НаборЗаписей = РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПлатежноРасчетныйДокумент.Установить(ДокументСсылка);
		НаборЗаписей.Прочитать(); 
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		Запись.ПлатежноРасчетныйДокумент = ДокументСсылка; 
		Если ДанныеКОбработке.Свойство("ПричинаОтказа", Запись.КомментарийОбработки) Тогда 
			Запись.КомментарийОбработки = ТекстСтатусаЕБП + ": " + Запись.КомментарийОбработки; 
		Иначе
			Запись.КомментарийОбработки = ТекстСтатусаЕБП;
		КонецЕсли;	
		Запись.Статус = НовыйСтатусДокумента; 
		Если Запись.Статус = ПредопределенноеЗначение("Перечисление.СтатусыИсполненияДокумента.Исполнен")
			ИЛИ Запись.Статус = ПредопределенноеЗначение("Перечисление.СтатусыИсполненияДокумента.ИсполненЧастично")
			Тогда  
			ДатаИсполнения = Неопределено;
			ДанныеКОбработке.Свойство("ДатаИсполненияРСКП", ДатаИсполнения); 
			Если Не ЗначениеЗаполнено(ДатаИсполнения) И НЕ ЕстьВложения Тогда
				ДатаИсполнения = ТекущаяДатаСеанса();  
			КонецЕсли;
			Запись.ДатаПроведения = ДатаИсполнения;
		КонецЕсли;	
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию(); 
		ИнформацияОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Обмен ЕБП", УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьНовыйРСКППоДаннымЕБП(ДанныеКОбработке, Организация, ИнформацияОбОшибке = "", РСКПСсылка, ЕстьВложения) Экспорт  
	
	ТекстСтатусаЕБП = "";
	Если НЕ ДанныеКОбработке.Свойство("СтатусРСКП", ТекстСтатусаЕБП) Тогда
		ИнформацияОбОшибке = НСтр("ru = 'Не указан статус РСКП, присвоенный в ЕБП, обработка невозможна.'"); 
	Иначе
		НовыйСтатусДокумента = ПлатежноРасчетныеДокументы.СтатусДокументаЕБП(ТекстСтатусаЕБП); 
		Если НовыйСтатусДокумента = Неопределено Тогда
			ИнформацияОбОшибке = НСтр("ru = 'Не удалось определить статус РСКП, присвоенный в ЕБП (%1), обработка невозможна.'");
			ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИнформацияОбОшибке, ТекстСтатусаЕБП); 
		ИначеЕсли НЕ (НовыйСтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыИсполненияДокумента.Исполнен")
			ИЛИ НовыйСтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыИсполненияДокумента.ИсполненЧастично")) Тогда
			ИнформацияОбОшибке = НСтр("ru = 'Документ может быть загружен только в статусе ""Исполнен"" или ""Исполнен частично"". Текущий статус: ""%1"".'");
			ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИнформацияОбОшибке, ТекстСтатусаЕБП); 
		КонецЕсли;  
	КонецЕсли;
	Если ЗначениеЗаполнено(ИнформацияОбОшибке) Тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|" + НСтр("ru = 'Не удалось создать РСКП по переданным данным'"); 
		Возврат;
	КонецЕсли;  
	// Проверка наличия лицевого счета. Лицевой счет должен быть заведен до формирования документов.
	ЛицевойСчетДляЗагрузки = Справочники.ЛицевыеСчета.ЛицевойСчетПоНомеру(ДанныеКОбработке.ЛицевойСчет, Организация);
	Если Не ЗначениеЗаполнено(ЛицевойСчетДляЗагрузки) Тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|" + НСтр("ru = 'Не найден лицевой счет № %1. Документ %2 от %3 ID %4 не может быть обработан'");
		ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ИнформацияОбОшибке, 
		ДанныеКОбработке.ЛицевойСчет, 
		ДанныеКОбработке.НомерРСКП, 
		ДанныеКОбработке.ДатаРСКП, 
		ДанныеКОбработке.СсылкаВнешняя);
		Возврат;
	КонецЕсли; 
	// Проверка типа лицевого счета.
	ТипЛС = Неопределено;
	Если Лев(ДанныеКОбработке.ЛицевойСчет, 2) = "80" Или Лев(ДанныеКОбработке.ЛицевойСчет, 2) = "90" Тогда
		ТипЛС = "АУБУ";
	ИначеЕсли Лев(ДанныеКОбработке.ЛицевойСчет, 2) = "05"	Тогда
		ТипЛС = "ВРПБС";
	КонецЕсли;
	Если ТипЛС = Неопределено Тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|" + НСтр("ru = 'Неизвестный тип лицевого счета № %1'");
		ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИнформацияОбОшибке, ДанныеКОбработке.ЛицевойСчет); 
		Возврат;
	КонецЕсли;   
	
	НачатьТранзакцию();
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		
		НовыйДокумент = Документы.РСКППеречисление.СоздатьДокумент(); 
		НовыйДокумент.УстановитьСсылкуНового(РСКПСсылка); 
		НовыйДокумент.Заблокировать();  
		
		НовыйДокумент.Внешнее = Истина;
		НовыйДокумент.Организация = Организация; 
		НовыйДокумент.МодульИнтеграции = ДанныеКОбработке.МодульИнтеграции;
		
		//ЛицевойСчет   
		НовыйДокумент.ЛицевойСчет = ЛицевойСчетДляЗагрузки;
		
		ВидПлатежа = "";
		ДанныеКОбработке.Свойство("ВидПлатежа", ВидПлатежа);
		НовыйДокумент.ВидПлатежа = БиблиотекаФункцийОбмена.СтрокаВидаПлатежа(ВидПлатежа);
		НовыйДокумент.Дата = ТекущаяДатаСеанса(); 
		НовыйДокумент.ДатаРСКП = ДанныеКОбработке.ДатаРСКП; 
		НовыйДокумент.НомерРСКП = ДанныеКОбработке.НомерРСКП;  
		НовыйДокумент.ПризнакАвансовогоПлатежа = ДанныеКОбработке.ПризнакАвансовогоПлатежа;
		НовыйДокумент.ОчередностьПлатежа = ДанныеКОбработке.ОчередностьПлатежа; 
		НовыйДокумент.НазначениеПлатежа = ДанныеКОбработке.НазначениеПлатежа;
		
		НовыйДокумент.ВалютаДокумента = БиблиотекаФункцийОбмена.Валюта(ДанныеКОбработке.КодВалюты, "Код"); 
		Если НЕ ЗначениеЗаполнено(НовыйДокумент.ВалютаДокумента) Тогда
			НовыйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли; 
		КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовыйДокумент.ВалютаДокумента, НовыйДокумент.ДатаРСКП);
		НовыйДокумент.Курс	= КурсКратность.Курс;
		НовыйДокумент.Кратность = КурсКратность.Кратность;
		ВРублях = НовыйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		
		НовыйДокумент.СуммаДокументаВВалюте = ДанныеКОбработке.СуммаДокументаВВалюте;
		Если ВРублях Тогда
			НовыйДокумент.СуммаДокумента = НовыйДокумент.СуммаДокументаВВалюте;
		Иначе
			ДанныеКОбработке.Свойство("СуммаДокументаВРублях", НовыйДокумент.СуммаДокумента);
		КонецЕсли; 
		
		ПризнакНаличияНДС = "";
		ДанныеКОбработке.Свойство("ПризнакНаличияНДС", ПризнакНаличияНДС);
		Если НЕ ПризнакНаличияНДС = "1" Тогда
			ДанныеКОбработке.Свойство("СуммаНДС", НовыйДокумент.СуммаНДС); 
			Если НовыйДокумент.СуммаНДС = 0 Тогда
				НовыйДокумент.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
			Иначе
				СуммаБезНДС = НовыйДокумент.СуммаДокументаВВалюте - НовыйДокумент.СуммаНДС;
				Если НЕ СуммаБезНДС = 0 Тогда
					ПроцентНДС = Окр(НовыйДокумент.СуммаНДС / СуммаБезНДС * 100);
					Если ПроцентНДС = 5 Тогда
						НовыйДокумент.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5");
					ИначеЕсли ПроцентНДС = 7 Тогда
						НовыйДокумент.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7");
					ИначеЕсли ПроцентНДС = 10 Тогда
						НовыйДокумент.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10");
					ИначеЕсли ПроцентНДС = 18 Тогда
						НовыйДокумент.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18"); 	
					ИначеЕсли ПроцентНДС = 20 Тогда
						НовыйДокумент.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
					ИначеЕсли ПроцентНДС = 22 Тогда
						НовыйДокумент.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22");
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;  
		КонецЕсли;	
		
		ДанныеКОбработке.Свойство("КодВыплат", НовыйДокумент.КодВыплат);	
		ДанныеКОбработке.Свойство("ДополнительнаяИнформация", НовыйДокумент.ДополнительнаяИнформация); 
		ДанныеКОбработке.Свойство("Примечание", НовыйДокумент.Примечание); 
		ДанныеКОбработке.Свойство("ПриоритетИсполнения", НовыйДокумент.ПриоритетИсполнения); 
		ДанныеКОбработке.Свойство("ПредельнаяДатаИсполнения", НовыйДокумент.ПредельнаяДатаИсполнения);
		ДанныеКОбработке.Свойство("НомерБО", НовыйДокумент.НомерОбязательства); 
		ДанныеКОбработке.Свойство("НомерДО", НовыйДокумент.НомерДенежногоОбязательства);  
		ДанныеКОбработке.Свойство("КодВидаДохода", НовыйДокумент.КодВидаДохода); 
		
		// Налоговые реквизиты
		ДанныеКОбработке.Свойство("УИН", НовыйДокумент.УИН);  
		ДанныеКОбработке.Свойство("ИГК", НовыйДокумент.ИГК);
		ДанныеКОбработке.Свойство("СтатусСоставителя", НовыйДокумент.СтатусСоставителя);
		ДанныеКОбработке.Свойство("КодБКНалога", НовыйДокумент.КодБКНалога);
		ДанныеКОбработке.Свойство("КодОКАТО", НовыйДокумент.КодОКАТО);
		ДанныеКОбработке.Свойство("ПоказательОснования", НовыйДокумент.ПоказательОснования);
		ДанныеКОбработке.Свойство("ПоказательПериода", НовыйДокумент.ПоказательПериода);
		ДанныеКОбработке.Свойство("ПоказательДаты", НовыйДокумент.ПоказательДаты); 
		ДанныеКОбработке.Свойство("ПоказательТипа", НовыйДокумент.ПоказательТипа); 
		ДанныеКОбработке.Свойство("ПоказательИдентификатора", НовыйДокумент.ПоказательНомера); 
		Если ЗначениеЗаполнено(НовыйДокумент.ПоказательНомера) Тогда
			НовыйДокумент.ПоказательИдентификатора = Истина;
		Иначе
			ДанныеКОбработке.Свойство("ПоказательНомера", НовыйДокумент.ПоказательНомера);
		КонецЕсли;
		//НалогСборПлатеж  - попробовать определить
		
		// Платеж ЖКХ  
		ДанныеКОбработке.Свойство("ИдентификаторПлатежногоДокументаЖКХ", НовыйДокумент.ИдентификаторПлатежногоДокументаЖКХ);
		ДанныеКОбработке.Свойство("ПериодОплатыЖКХ", НовыйДокумент.ПериодОплатыЖКХ);
		ДанныеКОбработке.Свойство("ЕдиныйЛицевойСчетЖКХ", НовыйДокумент.ЕдиныйЛицевойСчетЖКХ); 
		ДанныеКОбработке.Свойство("ИдентификаторУслугиЖКХ", НовыйДокумент.ИдентификаторУслугиЖКХ); 
		
		ТипЗакупки = "";  
		ДанныеКОбработке.Свойство("ТипЗакупки", ТипЗакупки); 
		Если ЗначениеЗаполнено(ТипЗакупки) Тогда
			Если СтрДлина(ТипЗакупки) = 1 И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ТипЗакупки) Тогда
				ТипЗакупкиЧисло = Число(ТипЗакупки) - 1;
				НовыйДокумент.ТипЗакупки = Перечисления.ТипЗакупкиЕБП[ТипЗакупкиЧисло]; 
			Иначе
				НовыйДокумент.ТипЗакупки = ОбщегоНазначенияБГУ.ЗначениеПеречисленияПоСинониму("ТипЗакупкиЕБП", ТипЗакупки); 
			КонецЕсли;
		КонецЕсли;
		
		ЭтоКазенное = БухгалтерскийУчетПовтИсп.УчетнаяПолитикаОрганизации(Организация, НовыйДокумент.Дата).ЭтоКазенноеУчреждение; 
		
		// Контрагенты
		ДанныеКОбработке.КОНТРАГЕНТЫ.Сортировать("НомерСтроки");
		Для Каждого СтрокаКонтрагент Из ДанныеКОбработке.КОНТРАГЕНТЫ Цикл 
			СтрДок = НовыйДокумент.Контрагенты.Добавить();
			СтрДок.ИдентификаторСтроки = Новый УникальныйИдентификатор();
			
			СтрДок.ВидБКПолучателя = СтрокаКонтрагент.ВидБКПолучателя;
			СтрДок.ДополнительнаяИнформация = СтрокаКонтрагент.ДополнительнаяИнформация; 
			СтрДок.КодБКПолучателя = СтрокаКонтрагент.КодБКПолучателя; 
			Если НЕ Метаданные.Перечисления.КодыПоступленийЕБП.ЗначенияПеречисления.Найти(СтрокаКонтрагент.КодПоступленияЕБП) = Неопределено Тогда
				СтрДок.КодПоступленияЕБП = Перечисления.КодыПоступленийЕБП[СтрокаКонтрагент.КодПоступленияЕБП]; 	
			КонецЕсли;	
			СтрДок.КодЦелиПолучателя = СтрокаКонтрагент.КодЦелиПолучателя; 
			СтрДок.КонтрагентБанковскийСчет = СтрокаКонтрагент.КонтрагентБанковскийСчет;
			СтрДок.КонтрагентБИКБанка = СтрокаКонтрагент.КонтрагентБИКБанка; 
			СтрДок.КонтрагентКорСчетБанка = СтрокаКонтрагент.КонтрагентКорСчетБанка;
			СтрДок.КонтрагентЛицевойСчет = СтрокаКонтрагент.КонтрагентЛицевойСчет;   
			СтрДок.КонтрагентНаименование = СтрокаКонтрагент.КонтрагентНаименование;  
			СтрДок.КонтрагентНаименованиеБанка = СтрокаКонтрагент.КонтрагентНаименованиеБанка;  
			СтрДок.СтрокаНазначениеПлатежа = СтрокаКонтрагент.СтрокаНазначениеПлатежа;
			
			СтрДок.СуммаВал = СтрокаКонтрагент.СуммаВал;
			Если ВРублях Тогда
				СтрДок.Сумма = СтрДок.СуммаВал; 
			Иначе
				СтрДок.Сумма = СтрокаКонтрагент.СуммаРуб;
			КонецЕсли;  
			
			КонтрагентНаименование = "";
			КонтрагентФИО = "";
			Если ЗначениеЗаполнено(СтрокаКонтрагент.КонтрагентИНН) Тогда
				Если СтрДлина(СтрокаКонтрагент.КонтрагентИНН) = 12 Тогда
					КонтрагентНаименование = "";
					КонтрагентФИО = СтрокаКонтрагент.КонтрагентНаименование;
				Иначе
					КонтрагентНаименование = СтрокаКонтрагент.КонтрагентНаименование;			
					КонтрагентФИО = ""; 
				КонецЕсли;
			Иначе // считаем, что физлицо
				КонтрагентНаименование = "";
				КонтрагентФИО = СтрокаКонтрагент.КонтрагентНаименование;
			КонецЕсли;
			СтрДок.Контрагент = БиблиотекаФункцийОбмена.ОпределитьКонтрагента(СтрокаКонтрагент.КонтрагентИНН, СтрокаКонтрагент.КонтрагентКПП, КонтрагентНаименование, КонтрагентФИО,);
			
		КонецЦикла;   
		
		// Документы - основания
		Для Каждого СтрокаОснования Из ДанныеКОбработке.РЕКВИЗИТЫДОКУМЕНТАОСНОВАНИЯ Цикл  
			СтрДок = НовыйДокумент.РеквизитыДокументаОснования.Добавить();
			Если ТипЛС = "АУБУ" Тогда
				СтрДок.ДокументОснованиеВид = Справочники.ВидыДокументовОснованийЕБП.ВидОснованияПоНаименованию(СтрокаОснования.ДокументОснованиеВид, НовыйДокумент.НазначениеПлатежа);  
			Иначе
				СтрДок.ДокументОснованиеВид = СтрокаОснования.ДокументОснованиеВид;
			КонецЕсли;
			СтрДок.ДокументОснованиеНомер = СтрокаОснования.ДокументОснованиеНомер;
			СтрДок.ДокументОснованиеДата = СтрокаОснования.ДокументОснованиеДата;
			СтрДок.ДокументОснованиеПредмет = СтрокаОснования.ДокументОснованиеПредмет;
			СтрДок.ВидРеестра = СтрокаОснования.ВидРеестра;
			СтрДок.НомерРеестровойЗаписи = СтрокаОснования.НомерРеестровойЗаписи;
			СтрДок.ИдентификаторДокумента = СтрокаОснования.ИдентификаторДокумента; 
			СтрДок.GUIDПоступления = СтрокаОснования.GUIDПоступления;
		КонецЦикла;	  
		
		// Договор для учета
		Если НовыйДокумент.Контрагенты.Количество() = 1 Тогда
			Контрагент = НовыйДокумент.Контрагенты[0].Контрагент; 
		Иначе
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;  
		Если ДанныеКОбработке.РЕКВИЗИТЫДОКУМЕНТАОСНОВАНИЯ.Количество() > 0 Тогда 
			ДопПараметры = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеКОбработке.РЕКВИЗИТЫДОКУМЕНТАОСНОВАНИЯ[0]);
		Иначе	
			ДопПараметры = Неопределено;
		КонецЕсли;
		НовыйДокумент.Договор = Справочники.Договоры.ОпределитьДоговор(Организация, Контрагент, НовыйДокумент.НомерОбязательства, НовыйДокумент.ИГК, "", ДопПараметры); 
		
		// Расшифровка платежа  
		Если ТипЛС = "ВРПБС" Тогда  
			СтрДок = НовыйДокумент.РасшифровкаПлатежа.Добавить();
			СтрДок.ИдентификаторСтроки = Новый УникальныйИдентификатор(); 
			СтрДок.РазделЛС = Справочники.РазделыЛицевыхСчетов.РазделЛСПоКодуПоступленияЕБП(НовыйДокумент.ЛицевойСчет, "ВР", ИнформацияОбОшибке, Истина); 
			СтрДок.КБКНазначениеПлатежа = БиблиотекаФункцийОбмена.КПСПоТекстовомуКодуБК("00000000000000000000", Перечисления.ВидыКБК.гКБК,, НовыйДокумент.Дата, ИнформацияОбОшибке); 
		Иначе	
			ДанныеКОбработке.РАСШИФРОВКАПЛАТЕЖА.Сортировать("НомерСтроки");
			Для Каждого СтрокаРасшифровки Из ДанныеКОбработке.РАСШИФРОВКАПЛАТЕЖА Цикл 
				СтрДок = НовыйДокумент.РасшифровкаПлатежа.Добавить();
				СтрДок.ИдентификаторСтроки = Новый УникальныйИдентификатор();
				
				// КПС
				Если ЗначениеЗаполнено(СтрокаРасшифровки.ТипКБК) Тогда
					ТипКБК = БиблиотекаФункцийОбмена.ПолучитьВидКБК(СтрокаРасшифровки.ТипКБК);	
				Иначе
					ТипКБК = ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ");
				КонецЕсли;
				Если ЭтоКазенное Тогда
					СтрДок.КБКНазначениеПлатежа = БиблиотекаФункцийОбмена.КПСПоТекстовомуКодуБК(СтрокаРасшифровки.КБКНазначениеПлатежа, ТипКБК,, НовыйДокумент.Дата, ИнформацияОбОшибке);
				Иначе
					СтрДок.КБКНазначениеПлатежа = БиблиотекаФункцийОбмена.КПСПоТекстовомуКодуБК(СтрокаРасшифровки.КБКНазначениеПлатежа, Перечисления.ВидыКБК.АУИБУ, ТипКБК, НовыйДокумент.Дата, ИнформацияОбОшибке); 
				КонецЕсли;	 
				
				// Раздел лицевого счета   
				Если ЗначениеЗаполнено(НовыйДокумент.ЛицевойСчет) Тогда 
					СтрДок.РазделЛС = Справочники.РазделыЛицевыхСчетов.РазделЛСПоКодуПоступленияЕБП(НовыйДокумент.ЛицевойСчет, СтрокаРасшифровки.РазделЛСКод, ИнформацияОбОшибке, Истина); 
				КонецЕсли;  
				
				СтрДок.КодЦели = Справочники.ВидыЦелевыхСредств.ВидЦелевыхТекстовомуКоду(СтрокаРасшифровки.КодЦели); 
				СтрДок.ОбъектФАИП = БиблиотекаФункцийОбмена.ОбъектФАИПКМИПоТекстовомуКоду(СтрокаРасшифровки.ОбъектФАИП, Организация);
				СтрДок.НаправлениеПлатежа = Справочники.НаправлениеПлатежейЕБП.НаправлениеПлатежаПоНаименованию(СтрокаРасшифровки.НаправлениеПлатежа, СтрДок.КБКНазначениеПлатежа);
				
				СтрДок.СуммаВал = СтрокаРасшифровки.СуммаВал;
				Если ВРублях Тогда
					СтрДок.Сумма = СтрДок.СуммаВал; 
				Иначе
					СтрДок.Сумма = СтрокаРасшифровки.СуммаРуб;
				КонецЕсли;  
				
				СтрДок.КодПрослеживаемости = СтрокаРасшифровки.КодПрослеживаемости; 
				СтрДок.СтрокаНазначениеПлатежа = СтрокаРасшифровки.СтрокаНазначениеПлатежа;		
				
			КонецЦикла;	
		КонецЕсли;
		
		Если НовыйДокумент.РасшифровкаПлатежа.Количество() = 1 Тогда
			НовыйДокумент.РасшифровкаПлатежа[0].Сумма = НовыйДокумент.СуммаДокумента;
			НовыйДокумент.РасшифровкаПлатежа[0].СуммаВал = НовыйДокумент.СуммаДокументаВВалюте;
		Иначе
			НовыйДокумент.НесколькоКодовБК = 1;
		КонецЕсли;
		
		Если НовыйДокумент.Контрагенты.Количество() = 1 Тогда
			 НовыйДокумент.Контрагенты[0].Сумма = НовыйДокумент.СуммаДокумента;
			 НовыйДокумент.Контрагенты[0].СуммаВал = НовыйДокумент.СуммаДокументаВВалюте;
		 Иначе
			НовыйДокумент.НесколькоПолучателей = 1;
		КонецЕсли;  
		
		// Добавляем одну строку в таблицу Детализация платежа
		// 
		ИмяТаблицы = "";
		Если НовыйДокумент.НесколькоКодовБК = 1 Тогда
			ИмяТаблицы = "РасшифровкаПлатежа"; 
			ДопРодительскаяСтрока = НовыйДокумент.Контрагенты[0];
		ИначеЕсли НовыйДокумент.НесколькоПолучателей = 1 Тогда
			ИмяТаблицы = "Контрагенты";  
			ДопРодительскаяСтрока = НовыйДокумент.РасшифровкаПлатежа[0]; 
		ИначеЕсли НовыйДокумент.РасшифровкаПлатежа.Количество() > 0 Тогда
			ИмяТаблицы = "РасшифровкаПлатежа"; 
			ДопРодительскаяСтрока = НовыйДокумент.Контрагенты[0];
		КонецЕсли;
		Если ЗначениеЗаполнено(ИмяТаблицы) Тогда  
			Для Каждого РодительскаяСтрока Из НовыйДокумент[ИмяТаблицы] Цикл   
				СтрокаДетализации = НовыйДокумент.ДетализацияПлатежа.Добавить(); 
				ЗаполнитьЗначенияСвойств(СтрокаДетализации, РодительскаяСтрока); 
				ЗаполнитьЗначенияСвойств(СтрокаДетализации, ДопРодительскаяСтрока,, "Сумма,СуммаВал,ИдентификаторСтроки");
			    СтрокаДетализации.КФО = ПлатежноРасчетныеДокументыКлиентСервер.КФОПоКодуПоступленияЕБП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДетализации.РазделЛС, "КодПоступленияЕБП"));
			КонецЦикла;
		КонецЕсли;	
		
		// Кор. счет. Если РСКП импортируется из ЕБП, то, скорее всего, РСКП создано в ЕИС, это расчеты по контрактам 
		Если НЕ ТипЛС = "ВРПБС" Тогда
			НовыйДокумент.КорСчет = БухгалтерскийУчет.СчетПоКоду(?(ДанныеКОбработке.ПризнакАвансовогоПлатежа, "206.00", "302.00"), Неопределено, Неопределено);
		КонецЕсли;
        	
		Если ЗначениеЗаполнено(ИнформацияОбОшибке) Тогда
			ОтменитьТранзакцию(); 
			ЗаписьЖурналаРегистрации("Обмен ЕБП", УровеньЖурналаРегистрации.Ошибка,,, ИнформацияОбОшибке);
		Иначе
			
			НовыйДокумент.Записать(); 
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостояниеПлатежноРасчетныхДокументов");
			ЭлементБлокировки.УстановитьЗначение("ПлатежноРасчетныйДокумент", НовыйДокумент.Ссылка); 
			Блокировка.Заблокировать();  
			
			НаборЗаписей = РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПлатежноРасчетныйДокумент.Установить(НовыйДокумент.Ссылка);
			НаборЗаписей.Прочитать(); 
			Если НаборЗаписей.Количество() =0 Тогда
				Запись = НаборЗаписей.Добавить();
			Иначе
				Запись = НаборЗаписей[0];
			КонецЕсли;
			Запись.ПлатежноРасчетныйДокумент = НовыйДокумент.Ссылка; 
			Запись.Статус = НовыйСтатусДокумента; 
			ДатаИсполнения = Неопределено;
			ДанныеКОбработке.Свойство("ДатаИсполненияРСКП", ДатаИсполнения); 
			Если Не ЗначениеЗаполнено(ДатаИсполнения) И НЕ ЕстьВложения Тогда
				ДатаИсполнения = ТекущаяДатаСеанса();  
			КонецЕсли;
			Запись.ДатаПроведения = ДатаИсполнения;
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию(); 
		КонецЕсли;
	Исключение
		ОтменитьТранзакцию(); 
		ИнформацияОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Обмен ЕБП", УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры	

#КонецОбласти   
                                                        
#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "РасчетныйДокументБезККТ", 5);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
