#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("ДокументОснование", ДокументОснование);
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,
				"Дата,Организация,ИФО,КФО,Контрагент,Ответственный");
			
			Отбор.Очистить();
			Если ДанныеЗаполнения.Свойство("Договор") Тогда
				ОтборПоДоговору = Отбор.Добавить();
				ОтборПоДоговору.Договор = ДанныеЗаполнения.Договор;
			КонецЕсли;
			
			ЗаполнитьДокумент();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеЗаполнения <> Неопределено И ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") тогда
		ТекстСообщения = "";
		Если НЕ Документы.СписаниеДоходовБудущихПериодов.ЗаполнитьНаОсновании(ДанныеЗаполнения, ЭтотОбъект, ТекстСообщения) тогда
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РеквизитыСчетаРБП = Новый Структура("Счет, КПС, КЭК, Подразделение",
		"СчетДБП", "КПС", "КЭК", "Подразделение");
	БухгалтерскийУчет.ПроверитьЗаполнениеСчетаИАналитики(РеквизитыСчетаРБП,
		ЭтотОбъект, "ДоходыБудущихПериодов", Отказ);
	
	РеквизитыСчетаРасходов = Новый Структура("Счет, Субконто1, Субконто2, Субконто3",
		"СчетДоходов", "СубконтоДоходов1", "СубконтоДоходов2", "СубконтоДоходов3");
	БухгалтерскийУчет.ПроверитьЗаполнениеСчетаИАналитики(РеквизитыСчетаРасходов,
		ЭтотОбъект, "ДоходыБудущихПериодов", Отказ);
	
	ПлательщикНалогаНаПрибыль = НалоговыйУчетВызовСервера.ПлательщикНалогаНаПрибыль(Организация, Дата);
	Для Каждого СтрокаТаблицы Из ДоходыБудущихПериодов Цикл
		
		Если (СтрокаТаблицы.Всего <> СтрокаТаблицы.ВсегоСправедливая)
			И СтрокаТаблицы.ВидОперации <> Перечисления.ВидыОперацийНачисленияДБП.ПередачаВАрендуНаЛьготныхУсловиях
			И СтрокаТаблицы.ВидОперации <> Перечисления.ВидыОперацийНачисленияДБП.ПередачаВБезвозмездноеПользование Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru='
				|Для вида операции ""%1"" справедливая стоимость (%2) должна совпадать с суммой по договору (%3).'"),
					СтрокаТаблицы.ВидОперации,
					СтрокаТаблицы.ВсегоСправедливая,
					СтрокаТаблицы.Всего);
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
				НСтр("ru = 'Сумма по договору'"), СтрокаТаблицы.НомерСтроки, НСтр("ru = 'Доходы будущих периодов'"), ТекстОшибки);
			ПолеОшибки = "ДоходыБудущихПериодов[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Всего";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.Ссылка, ПолеОшибки, "Объект", Отказ);
		КонецЕсли;
		
		Если ПлательщикНалогаНаПрибыль И НалоговыйУчетКлиентСервер.ВедетсяНалоговыйУчетПоКФО(СтрокаТаблицы.КФО) Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ВидДеятельностиНУ) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					НСтр("ru = 'Вид деятельности (НУ)'"), СтрокаТаблицы.НомерСтроки, НСтр("ru = 'Доходы будущих периодов'"));
				ПолеОшибки = "ДоходыБудущихПериодов[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ВидДеятельностиНУ";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.Ссылка, ПолеОшибки, "Объект", Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СчетДоходовНУ) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					НСтр("ru = 'Счет доходов (НУ)'"), СтрокаТаблицы.НомерСтроки, НСтр("ru = 'Доходы будущих периодов'"));
				ПолеОшибки = "ДоходыБудущихПериодов[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].СчетДоходовНУ";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.Ссылка, ПолеОшибки, "Объект", Отказ);
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтатьяПрочихДоходовНУ)
				И БухгалтерскийУчет.СчетВИерархии(СтрокаТаблицы.СчетДоходовНУ, "Н91.01") Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					НСтр("ru = 'Статья прочих доходов (НУ)'"), СтрокаТаблицы.НомерСтроки, НСтр("ru = 'Доходы будущих периодов'"));
				ПолеОшибки = "ДоходыБудущихПериодов[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].СтатьяПрочихДоходовНУ";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.Ссылка, ПолеОшибки, "Объект", Отказ);
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	МассивИдентификаторовСтрок = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		//Если ссылка пустая, значит документ новый, устанавливаем новые идентификаторы всем строкам
		Для Каждого СтрТЧ Из ДоходыБудущихПериодов Цикл
			Если НЕ ЗначениеЗаполнено(СтрТЧ.ИДСтроки) Тогда
				СтрТЧ.ИДСтроки = Строка(Новый УникальныйИдентификатор);			
			ИначеЕсли МассивИдентификаторовСтрок.Найти(СтрТЧ.ИДСтроки)<>Неопределено Тогда
				СтрТЧ.ИДСтроки = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			МассивИдентификаторовСтрок.Добавить(СтрТЧ.ИДСтроки);
		КонецЦикла;
	Иначе
		//Если ссылка не пустая, нужен анализ идентификаторов строк.
		//Т.к. возможна ситуация, когда строку скопировали, а исходную - удалили.
		//В этом случае нужно ранее присвоенные идентификаторы назначить новым строкам.
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Начисления.НомерСтроки КАК НомерСтроки,
		|	Начисления.Контрагент КАК Контрагент,
		|	Начисления.Договор КАК Договор,
		|	Начисления.Номенклатура КАК Номенклатура,
		|	Начисления.КПС КАК КПС,
		|	Начисления.КФО КАК КФО,
		|	Начисления.КЭК КАК КЭК,
		|	Начисления.ИДСтроки КАК ИДСтроки
		|ПОМЕСТИТЬ ТекущиеНачисления
		|ИЗ
		|	&Начисления КАК Начисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыБудущихПериодов.НомерСтроки КАК НомерСтроки,
		|	ДоходыБудущихПериодов.Контрагент КАК Контрагент,
		|	ДоходыБудущихПериодов.Договор КАК Договор,
		|	ДоходыБудущихПериодов.Номенклатура КАК Номенклатура,
		|	ДоходыБудущихПериодов.КПС КАК КПС,
		|	ДоходыБудущихПериодов.КФО КАК КФО,
		|	ДоходыБудущихПериодов.КЭК КАК КЭК,
		|	ДоходыБудущихПериодов.ИДСтроки КАК ИДСтроки
		|ПОМЕСТИТЬ ДанныеДокумента
		|ИЗ
		|	Документ.СписаниеДоходовБудущихПериодов.ДоходыБудущихПериодов КАК ДоходыБудущихПериодов
		|ГДЕ
		|	ДоходыБудущихПериодов.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущиеНачисления.НомерСтроки КАК НомерСтроки,
		|	ТекущиеНачисления.Контрагент КАК Контрагент,
		|	ТекущиеНачисления.Договор КАК Договор,
		|	ТекущиеНачисления.Номенклатура КАК Номенклатура,
		|	ТекущиеНачисления.КПС КАК КПС,
		|	ТекущиеНачисления.КФО КАК КФО,
		|	ТекущиеНачисления.КЭК КАК КЭК,
		|	ТекущиеНачисления.ИДСтроки КАК ИДСтроки,
		|	ДанныеДокумента.НомерСтроки КАК НомерСтрокиИсх,
		|	ДанныеДокумента.ИДСтроки КАК ИДСтрокиИсх,
		|	ДанныеДокумента.Номенклатура КАК НоменклатураИсх,
		|	ДанныеДокумента.Контрагент КАК КонтрагентИсх,
		|	ДанныеДокумента.КПС КАК КПСИсх,
		|	ДанныеДокумента.КФО КАК КФОИсх,
		|	ДанныеДокумента.КЭК КАК КЭКИсх,
		|	ДанныеДокумента.Договор КАК ДоговорИсх
		|ПОМЕСТИТЬ СвязанныеТаблицы
		|ИЗ
		|	ТекущиеНачисления КАК ТекущиеНачисления
		|		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеДокумента КАК ДанныеДокумента
		|		ПО ТекущиеНачисления.Контрагент = ДанныеДокумента.Контрагент
		|			И ТекущиеНачисления.Договор = ДанныеДокумента.Договор
		|			И ТекущиеНачисления.Номенклатура = ДанныеДокумента.Номенклатура
		|			И ТекущиеНачисления.КПС = ДанныеДокумента.КПС
		|			И ТекущиеНачисления.КФО = ДанныеДокумента.КФО
		|			И ТекущиеНачисления.КЭК = ДанныеДокумента.КЭК
		|			И ТекущиеНачисления.ИДСтроки = ДанныеДокумента.ИДСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвязанныеТаблицы.НомерСтрокиИсх КАК НомерСтрокиИсх,
		|	СвязанныеТаблицы.ИДСтрокиИсх КАК ИДСтрокиИсх,
		|	СвязанныеТаблицы.КонтрагентИсх КАК КонтрагентИсх,
		|	СвязанныеТаблицы.НоменклатураИсх КАК НоменклатураИсх,
		|	СвязанныеТаблицы.КПСИсх КАК КПСИсх,
		|	СвязанныеТаблицы.КФОИсх КАК КФОИсх,
		|	СвязанныеТаблицы.КЭКИсх КАК КЭКИсх,
		|	СвязанныеТаблицы.ДоговорИсх КАК ДоговорИсх
		|ПОМЕСТИТЬ СвободныеИдентификаторы
		|ИЗ
		|	СвязанныеТаблицы КАК СвязанныеТаблицы
		|ГДЕ
		|	СвязанныеТаблицы.НомерСтроки ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СвязанныеТаблицы.НомерСтроки КАК НомерСтроки,
		|	СвободныеИдентификаторы.ИДСтрокиИсх КАК ИДСтрокиИсх
		|ИЗ
		|	СвязанныеТаблицы КАК СвязанныеТаблицы
		|		ЛЕВОЕ СОЕДИНЕНИЕ СвободныеИдентификаторы КАК СвободныеИдентификаторы
		|		ПО СвязанныеТаблицы.Контрагент = СвободныеИдентификаторы.КонтрагентИсх
		|			И СвязанныеТаблицы.Договор = СвободныеИдентификаторы.ДоговорИсх
		|			И СвязанныеТаблицы.Номенклатура = СвободныеИдентификаторы.НоменклатураИсх
		|			И СвязанныеТаблицы.КПС = СвободныеИдентификаторы.КПСИсх
		|			И СвязанныеТаблицы.КФО = СвободныеИдентификаторы.КФОИсх
		|			И СвязанныеТаблицы.КЭК = СвободныеИдентификаторы.КЭКИсх
		|ГДЕ
		|	СвязанныеТаблицы.НомерСтрокиИсх ЕСТЬ NULL
		|	И НЕ СвободныеИдентификаторы.ИДСтрокиИсх ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ ПО
		|	НомерСтроки");
		Запрос.УстановитьПараметр("Начисления",ДоходыБудущихПериодов.Выгрузить());
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Для Каждого СтрТЧ Из ДоходыБудущихПериодов Цикл
			Если НЕ ЗначениеЗаполнено(СтрТЧ.ИДСтроки) Тогда
				Если Выборка.НайтиСледующий(Новый Структура("НомерСтроки",СтрТЧ.НомерСтроки)) Тогда
					ВыборкаДетальная = Выборка.Выбрать();
					Пока ВыборкаДетальная.Следующий() Цикл
						Если МассивИдентификаторовСтрок.Найти(ВыборкаДетальная.ИДСтрокиИсх) = Неопределено Тогда
							СтрТЧ.ИДСтроки = ВыборкаДетальная.ИДСтрокиИсх;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрТЧ.ИДСтроки) Тогда
					СтрТЧ.ИДСтроки = Строка(Новый УникальныйИдентификатор);
				КонецЕсли;
			ИначеЕсли МассивИдентификаторовСтрок.Найти(СтрТЧ.ИДСтроки)<>Неопределено Тогда
				СтрТЧ.ИДСтроки = Строка(Новый УникальныйИдентификатор);
			КонецЕсли;
			МассивИдентификаторовСтрок.Добавить(СтрТЧ.ИДСтроки);
		КонецЦикла;
	КонецЕсли;
	
	Если ТипПериода = 0 Тогда // За месяц.
		Дата = КонецМесяца(Дата);
	КонецЕсли;
	
	СуммаДокумента = ДоходыБудущихПериодов.Итог("ВсегоСправедливая");
	
	КонтрольИсполненияДоговоров.ОчиститьДвиженияРегистровПодсистемы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

Процедура ЗаполнитьДокумент() Экспорт
	
	Если Проведен Тогда
		Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	ДоходыБудущихПериодов.Очистить();
	
	ЭтоДоходыТекущегоПериодаПриКорректировкеДБП = ЗначениеЗаполнено(ДокументОснование);
	
	Запрос = Новый Запрос;
	
	Если ТипПериода = 0 Тогда // За месяц.
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода",  Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая));
	ИначеЕсли ТипПериода = 1 Тогда // На дату.
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Дата));
		Запрос.УстановитьПараметр("КонецПериода",  Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("СчетаДБП",     БухгалтерскийУчет.СписокСчетов("401.40,401.41,401.49"));
	Запрос.УстановитьПараметр("СчетаРБП",     БухгалтерскийУчет.СписокСчетов("401.50"));
	Запрос.УстановитьПараметр("Счета40110",   БухгалтерскийУчет.СписокСчетов("401.10"));
	Запрос.УстановитьПараметр("ВидРБП",       Перечисления.ВидыРБП.УпущеннаяВыгодаПоДоговорамАрендыНаЛьготныхУсловиях);
	
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	НастройкиСчетовУчетаДБП = УчетДоходовРасходов.НастройкиСчетовУчетаДБП();
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета);
	
	ВидыСубконто = Новый Массив();
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	Запрос.УстановитьПараметр("ВидыСубконтоДБП", ВидыСубконто);
	
	ВидыСубконто = Новый Массив();
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.РасходыБудущихПериодов);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	Запрос.УстановитьПараметр("ВидыСубконтоРБП", ВидыСубконто);
	
	НомераТаблиц = Новый Структура;
	НомераТаблиц.Вставить("ОстаткиДБП", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ОборотыДБП", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПараметрыСписанияДоходовБудущихПериодов", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ДоходыБудущихПериодов", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РасходыПоУпущеннойВыгоде", НомераТаблиц.Количество());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиДБП.Организация КАК Организация,
	|	ЕСТЬNULL(ОстаткиДБП.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ОстаткиДБП.КФО КАК КФО,
	|	ОстаткиДБП.КПС КАК КПС,
	|	ОстаткиДБП.КЭК КАК КЭК,
	|	ОстаткиДБП.Счет КАК СчетДБП,
	|	ОстаткиДБП.Подразделение КАК Подразделение,
	|	ВЫРАЗИТЬ(ОстаткиДБП.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ОстаткиДБП.Субконто2 КАК Справочник.Договоры) КАК Договор,
	|	ВЫРАЗИТЬ(ОстаткиДБП.Субконто3 КАК Справочник.ВидыЦелевыхСредств) КАК КодЦели,
	|	ЕСТЬNULL(ОстаткиДБП.Валюта, &ВалютаРеглУчета) КАК Валюта,
	|	ОстаткиДБП.СуммаОстатокКт КАК Сумма,
	|	ОстаткиДБП.ВалютнаяСуммаОстатокКт КАК ВалютнаяСумма
	|ПОМЕСТИТЬ ОстаткиДБП
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&КонецПериода,
	|			Счет В (&СчетаДБП),
	|			,
	|			Организация = &Организация
	|				И &УсловиеИФО
	|				И &УсловиеКФО
	|				И &УсловиеКПС
	|				И &УсловиеКонтрагент
	|				И &УсловиеДоговор) КАК ОстаткиДБП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор,
	|	Организация,
	|	Номенклатура,
	|	ИФО,
	|	КФО,
	|	КПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыДБП.Организация КАК Организация,
	|	ЕСТЬNULL(ОборотыДБП.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ОборотыДБП.КФО КАК КФО,
	|	ОборотыДБП.КПС КАК КПС,
	|	ОборотыДБП.КЭК КАК КЭК,
	|	ОборотыДБП.Счет КАК СчетДБП,
	|	ОборотыДБП.Подразделение КАК Подразделение,
	|	ВЫРАЗИТЬ(ОборотыДБП.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ОборотыДБП.Субконто2 КАК Справочник.Договоры) КАК Договор,
	|	ОборотыДБП.СуммаОборотДт КАК СписаноВТекущемМесяце
	|ПОМЕСТИТЬ ОборотыДБП
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В (&СчетаДБП),
	|			&ВидыСубконтоДБП,
	|			Организация = &Организация
	|				И &УсловиеИФО
	|				И &УсловиеКФО
	|				И &УсловиеКПС
	|				И &УсловиеКонтрагент,
	|			КорСчет В (&Счета40110),
	|			) КАК ОборотыДБП
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор,
	|	Организация,
	|	Номенклатура,
	|	ИФО,
	|	КФО,
	|	КПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыСписанияДоходовБудущихПериодов.Организация КАК Организация,
	|	ПараметрыСписанияДоходовБудущихПериодов.Договор КАК Договор,
	|	ПараметрыСписанияДоходовБудущихПериодов.ВидОперации КАК ВидОперации,
	|	ПараметрыСписанияДоходовБудущихПериодов.СпособПризнанияДоходов КАК СпособПризнанияДоходов,
	|	ПараметрыСписанияДоходовБудущихПериодов.ДатаНачалаСписания КАК ДатаНачалаСписания,
	|	ПараметрыСписанияДоходовБудущихПериодов.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
	|	ПараметрыСписанияДоходовБудущихПериодов.СчетДоходов КАК СчетДоходов,
	|	ПараметрыСписанияДоходовБудущихПериодов.СубконтоДоходов1 КАК СубконтоДоходов1,
	|	ПараметрыСписанияДоходовБудущихПериодов.СубконтоДоходов2 КАК СубконтоДоходов2,
	|	ПараметрыСписанияДоходовБудущихПериодов.СубконтоДоходов3 КАК СубконтоДоходов3,
	|	ПараметрыСписанияДоходовБудущихПериодов.ВидДеятельностиНУ КАК ВидДеятельностиНУ,
	|	ПараметрыСписанияДоходовБудущихПериодов.СчетДоходовНУ КАК СчетДоходовНУ,
	|	ПараметрыСписанияДоходовБудущихПериодов.СтатьяПрочихДоходовНУ КАК СтатьяПрочихДоходовНУ
	|ПОМЕСТИТЬ ПараметрыСписанияДоходовБудущихПериодов
	|ИЗ
	|	РегистрСведений.ПараметрыСписанияДоходовБудущихПериодов.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Договор В
	|					(ВЫБРАТЬ
	|						ОстаткиДБП.Договор КАК Договор
	|					ИЗ
	|						ОстаткиДБП КАК ОстаткиДБП)) КАК ПараметрыСписанияДоходовБудущихПериодов
	|ГДЕ
	|	НЕ ПараметрыСписанияДоходовБудущихПериодов.ВидОперации ССЫЛКА Перечисление.ВидыОперацийПринятияКУчетуПравПользованияОС
	|	И ПараметрыСписанияДоходовБудущихПериодов.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийНачисленияДБП.ДолгосрочныйДоговорОбразование)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДБП.ИФО КАК ИФО,
	|	ОстаткиДБП.КФО КАК КФО,
	|	ОстаткиДБП.КПС КАК КПС,
	|	ОстаткиДБП.КЭК КАК КЭК,
	|	ОстаткиДБП.СчетДБП КАК СчетДБП,
	|	ОстаткиДБП.Подразделение КАК Подразделение,
	|	ОстаткиДБП.Договор.Контрагент КАК Контрагент,
	|	ОстаткиДБП.Договор КАК Договор,
	|	ОстаткиДБП.Договор.Наименование КАК ДоговорПредставление,
	|	ОстаткиДБП.Договор.Контрагент.Наименование КАК КонтрагентПредставление,
	|	ОстаткиДБП.КодЦели КАК КодЦели,
	|	ОстаткиДБП.Номенклатура КАК Номенклатура,
	|	ОстаткиДБП.Номенклатура.Наименование КАК НоменклатураПредставление,
	|	ОстаткиДБП.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	ОстаткиДБП.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ОстаткиДБП.Номенклатура.НаименованиеПолное, 1, 1000) <> """"""""
	|			ТОГДА ОстаткиДБП.Номенклатура.НаименованиеПолное
	|		ИНАЧЕ ОстаткиДБП.Номенклатура.Наименование
	|	КОНЕЦ КАК НаименованиеУслуги,
	|	ОстаткиДБП.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ЕСТЬNULL(ОборотыДБП.СписаноВТекущемМесяце, 0) КАК СписаноВТекущемМесяце,
	|	ПараметрыСписанияДоходовБудущихПериодов.ВидОперации КАК ВидОперации,
	|	ПараметрыСписанияДоходовБудущихПериодов.СпособПризнанияДоходов КАК СпособПризнанияДоходов,
	|	ПараметрыСписанияДоходовБудущихПериодов.ДатаНачалаСписания КАК ДатаНачалаСписания,
	|	ПараметрыСписанияДоходовБудущихПериодов.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
	|	ПараметрыСписанияДоходовБудущихПериодов.СчетДоходов КАК СчетДоходов,
	|	ПараметрыСписанияДоходовБудущихПериодов.СубконтоДоходов1 КАК СубконтоДоходов1,
	|	ПараметрыСписанияДоходовБудущихПериодов.СубконтоДоходов2 КАК СубконтоДоходов2,
	|	ПараметрыСписанияДоходовБудущихПериодов.СубконтоДоходов3 КАК СубконтоДоходов3,
	|	ПараметрыСписанияДоходовБудущихПериодов.ВидДеятельностиНУ КАК ВидДеятельностиНУ,
	|	ПараметрыСписанияДоходовБудущихПериодов.СчетДоходовНУ КАК СчетДоходовНУ,
	|	ПараметрыСписанияДоходовБудущихПериодов.СтатьяПрочихДоходовНУ КАК СтатьяПрочихДоходовНУ,
	|	ОстаткиДБП.Валюта КАК Валюта,
	|	ОстаткиДБП.ВалютнаяСумма КАК ОстатокДБПВВалюте,
	|	ОстаткиДБП.Сумма КАК ОстатокДБП
	|ИЗ
	|	ОстаткиДБП КАК ОстаткиДБП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыСписанияДоходовБудущихПериодов КАК ПараметрыСписанияДоходовБудущихПериодов
	|		ПО ОстаткиДБП.Договор = ПараметрыСписанияДоходовБудущихПериодов.Договор
	|			И ОстаткиДБП.Организация = ПараметрыСписанияДоходовБудущихПериодов.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыДБП КАК ОборотыДБП
	|		ПО ОстаткиДБП.Договор = ОборотыДБП.Договор
	|			И ОстаткиДБП.Организация = ОборотыДБП.Организация
	|			И ОстаткиДБП.Номенклатура = ОборотыДБП.Номенклатура
	|			И ОстаткиДБП.ИФО = ОборотыДБП.ИФО
	|			И ОстаткиДБП.КФО = ОборотыДБП.КФО
	|			И ОстаткиДБП.КПС = ОборотыДБП.КПС
	|ГДЕ
	|	ЕСТЬNULL(ОборотыДБП.СписаноВТекущемМесяце, 0) = 0
	|	И &УсловиеВидОперации
	|	И &УсловиеСпособПризнанияДоходов
	|	И &УсловиеПоВалютеРасчетов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидОперации,
	|	СчетДБП,
	|	КонтрагентПредставление,
	|	ДоговорПредставление,
	|	НоменклатураПредставление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация КАК Организация,
	|	ЕСТЬNULL(ЕПСБУОстатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ЕПСБУОстатки.Подразделение КАК Подразделение,
	|	ЕПСБУОстатки.КФО КАК КФО,
	|	ЕПСБУОстатки.Счет КАК СчетРБППоУпущеннойВыгоде,
	|	ЕПСБУОстатки.КПС КАК КПСРасходовПоУпущеннойВыгоде,
	|	ЕПСБУОстатки.КЭК КАК КЭКРасходовПоУпущеннойВыгоде,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.РасходыБудущихПериодов) КАК СтатьяРасходовПоУпущеннойВыгоде,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.РасходыБудущихПериодов).ВидРБП КАК ВидРБП,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто2 КАК Справочник.Договоры) КАК Договор,
	|	ЕПСБУОстатки.СуммаОстатокДт КАК ОстатокРасходовПоУпущеннойВыгоде
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&КонецПериода,
	|			Счет В (&СчетаРБП),
	|			&ВидыСубконтоРБП,
	|			Организация = &Организация
	|				И &УсловиеИФО
	|				И &УсловиеКФО
	|				И Субконто2 В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						ОстаткиДБП.Договор
	|					ИЗ
	|						ОстаткиДБП)) КАК ЕПСБУОстатки
	|ГДЕ
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.РасходыБудущихПериодов).ВидРБП = &ВидРБП";
	
	Если ТипПериода = 0 Тогда // За месяц.
		// При ежемесячном заполнении включаются доходы будущих периодов с любыми способами списания.
		// ДБП, списанные в текущем месяце документами в режиме "На дату", не включаются в итоговый документ за месяц,
		// поскольку в текущем месяце уже сформированы обороты по Дт 401.40.
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСпособПризнанияДоходов", "ИСТИНА");
		
	ИначеЕсли ТипПериода = 1 Тогда // На дату.
		// При заполнении в режиме "На дату" включаются только доходы будущих периодов с признанием "По графику" и "На дату признания".
		// Способы признания доходов "По месяцам", "По календарным дням", "В особом порядке"
		// предназначены только для ежемесячного отражения в составе финансового результата.
		// В документ включаются суммы по договорам, для которых в плане-графике реализации
		// запланирована реализация на выбранную дату (регистр ИсполнениеДоговоровСПокупателями).
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСпособПризнанияДоходов",
			"ПараметрыСписанияДоходовБудущихПериодов.СпособПризнанияДоходов В(&СпособыПризнанияДоходов)");
		СпособыПризнанияДоходовНаДату = Новый Массив;
		СпособыПризнанияДоходовНаДату.Добавить(Перечисления.СпособыПризнанияРасходов.ПоГрафику);
		СпособыПризнанияДоходовНаДату.Добавить(Перечисления.СпособыПризнанияРасходов.НаДатуПризнания);
		Запрос.УстановитьПараметр("СпособыПризнанияДоходов", СпособыПризнанияДоходовНаДату);
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоВалютеРасчетов",
		?(ИспользоватьВалютныйУчет И ЗначениеЗаполнено(ВалютаДокумента), "ОстаткиДБП.Валюта = &Валюта", "ИСТИНА"));
	Запрос.УстановитьПараметр("Валюта", ВалютаДокумента); // Валюта документа.
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(ИФО) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", "ИФО = &ИФО");
		Запрос.УстановитьПараметр("ИФО", ИФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КФО) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКФО", "КФО = &КФО");
		Запрос.УстановитьПараметр("КФО", КФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКФО", "ИСТИНА" );
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КПС) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКПС", "КПС = &КПС");
		Запрос.УстановитьПараметр("КПС", КПС);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКПС", "ИСТИНА" );
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидОперации) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидОперации", "ВидОперации = &ВидОперации");
		Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидОперации", "ИСТИНА" );
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Если Контрагент.ЭтоГруппа Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтрагент",
				"ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры).Контрагент В ИЕРАРХИИ (&Контрагент)");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтрагент",
				"ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры).Контрагент = &Контрагент");
		КонецЕсли;
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКонтрагент", "ИСТИНА" );
	КонецЕсли;
	
	Если Отбор.Количество() > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДоговор",
			"ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры) В(&Договоры)");
		Запрос.УстановитьПараметр("Договоры", Отбор.ВыгрузитьКолонку("Договор"));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДоговор", "ИСТИНА" );
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаОстатковДБП = Результат[НомераТаблиц.ДоходыБудущихПериодов].Выгрузить();
	
	ВедетсяУчетДБППоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("401.40").УчетПоПодразделениям;
	
	// Распределим остатки расходов по упущенной выгоде по аналитике ДБП.
	РасходыПоУпущеннойВыгоде = Результат[НомераТаблиц.РасходыПоУпущеннойВыгоде].Выгрузить();
	ТаблицаОстатковДБП.Колонки.Добавить("СчетРБППоУпущеннойВыгоде",        Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаОстатковДБП.Колонки.Добавить("СтатьяРасходовПоУпущеннойВыгоде", Новый ОписаниеТипов("СправочникСсылка.РасходыБудущихПериодов"));
	ТаблицаОстатковДБП.Колонки.Добавить("КПСРасходовПоУпущеннойВыгоде",    Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаОстатковДБП.Колонки.Добавить("КЭКРасходовПоУпущеннойВыгоде",    Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаОстатковДБП.Колонки.Добавить("ОстатокРасходовПоУпущеннойВыгоде",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой)));
	Для Каждого ОстатокРБП Из РасходыПоУпущеннойВыгоде Цикл
		
		СвойстваСчетаРБП = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(ОстатокРБП.СчетРБППоУпущеннойВыгоде);
		
		ОтборДБП = ?(ВедетсяУчетДБППоПодразделениям И СвойстваСчетаРБП.УчетПоПодразделениям,
			Новый Структура("ИФО,КФО,Подразделение,Договор"),
			Новый Структура("ИФО,КФО,Договор"));
		ЗаполнитьЗначенияСвойств(ОтборДБП, ОстатокРБП);
		НайденныеСтрокиДБП = ТаблицаОстатковДБП.НайтиСтроки(ОтборДБП);
		
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(ОстатокРБП.ОстатокРасходовПоУпущеннойВыгоде,
			НайденныеСтрокиДБП, "ОстатокРасходовПоУпущеннойВыгоде", "ОстатокДБП", Ложь);
		
		Для Каждого СтрокаДБП Из НайденныеСтрокиДБП Цикл
			ЗаполнитьЗначенияСвойств(СтрокаДБП, ОстатокРБП,
				"СчетРБППоУпущеннойВыгоде,СтатьяРасходовПоУпущеннойВыгоде,КПСРасходовПоУпущеннойВыгоде,КЭКРасходовПоУпущеннойВыгоде");
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЭтоДоходыТекущегоПериодаПриКорректировкеДБП Тогда
		РеквизитыДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "ВидОперации,Дата,Номер");
	КонецЕсли;
	
	// Получим данные графиков исполнения (план-график реализации) для договоров с признанием доходов текущего периода по графику.
	ПризнаниеДоходовПоГрафику = Новый Структура("СпособПризнанияДоходов", Перечисления.СпособыПризнанияРасходов.ПоГрафику);
	СтрокиСПризнаниемПоГрафику = ТаблицаОстатковДБП.НайтиСтроки(ПризнаниеДоходовПоГрафику);
	ПризнаниеДоходовНаДату = Новый Структура("СпособПризнанияДоходов", Перечисления.СпособыПризнанияРасходов.НаДатуПризнания); // Частный случай признания по графику.
	СтрокиСПризнаниемНаДату = ТаблицаОстатковДБП.НайтиСтроки(ПризнаниеДоходовНаДату);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиСПризнаниемПоГрафику, СтрокиСПризнаниемНаДату);
	Если СтрокиСПризнаниемПоГрафику.Количество() > 0 Тогда
		
		ТаблицаОстатковДБП.Колонки.Добавить("ОстатокСуммаПоДоговору",
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой)));
		ТаблицаОстатковДБП.Колонки.Добавить("СуммаПоГрафику",
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой)));
		ТаблицаОстатковДБП.Колонки.Добавить("СправедливаяПоГрафику",
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой)));
		
		ДоговорыСПризнаниемПоГрафику = Новый Массив;
		СтрокиАрендаНаЛьготныхУсловиях = Новый Массив;
		Для Каждого Строка Из СтрокиСПризнаниемПоГрафику Цикл
			ДоговорыСПризнаниемПоГрафику.Добавить(Строка.Договор);
			Если Строка.ВидОперации = Перечисления.ВидыОперацийНачисленияДБП.ПередачаВАрендуНаЛьготныхУсловиях Тогда
				СтрокиАрендаНаЛьготныхУсловиях.Добавить(Строка);
			КонецЕсли;
			// Для каждой строки таблицы остатков ДБП рассчитаем остаток оплаты за весь оставшийся срок договора.
			Если ИспользоватьВалютныйУчет
				И НастройкиСчетовУчетаДБП[Строка.СчетДБП].Валютный
				И ЗначениеЗаполнено(Строка.Валюта)
				И Строка.Валюта <> ВалютаРегламентированногоУчета Тогда
				Строка.ОстатокСуммаПоДоговору = Строка.ОстатокДБПВВалюте; // В иностранной валюте возможна только обычная аренда.
			Иначе // Льготная аренда с признанием расходов по упущенной выгоде возможна только в рублях.
				Строка.ОстатокСуммаПоДоговору = Строка.ОстатокДБП - Строка.ОстатокРасходовПоУпущеннойВыгоде;
			КонецЕсли;
		КонецЦикла;
		
		Если ТипПериода = 0 Тогда // За месяц.
			ГрафикНачисления = КонтрольИсполненияДоговоров.ГрафикИсполненияПоДоговору(
				Организация,
				ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ДоговорыСПризнаниемПоГрафику),
				"Месяц",
				НачалоМесяца(Дата));
		ИначеЕсли ТипПериода = 1 Тогда // На дату.
			ГрафикНачисления = КонтрольИсполненияДоговоров.ГрафикИсполненияПоДоговору(
				Организация,
				ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ДоговорыСПризнаниемПоГрафику),
				"День",
				НачалоДня(Дата));
		КонецЕсли;
		
		ИспользоватьДетализациюПоКОСГУ = ПолучитьФункциональнуюОпцию("ИспользоватьДетализациюПоКОСГУВГрафикахСПокупателями");
		
		Если СтрокиАрендаНаЛьготныхУсловиях.Количество() > 0 И ТипПериода = 0 Тогда
			Для Каждого Строка Из СтрокиАрендаНаЛьготныхУсловиях Цикл
				
				// По договорам аренды на льготных условиях добавим в график начисления периоды (месяцы),
				// в которых сумма по договору (платная часть) не указана, но пользование имуществом осуществляется.
				// Справедливая стоимость должна распределяться на весь период пользования имуществом, в т.ч. периоды (месяцы),
				// в которых арендатора освободили от арендных платежей, хотя этих периодов (месяцев) нет в плане-графике реализации по договору.
				// В такие периоды (месяцы) в учете отражается упущенная выгода, равная справедливой стоимости арендных платежей.
				Если ЗначениеЗаполнено(Строка.ДатаНачалаСписания)
					И ЗначениеЗаполнено(Строка.ДатаОкончанияСписания)
					И Строка.ДатаНачалаСписания <= Строка.ДатаОкончанияСписания Тогда
					
					МесяцСписания = МАКС(НачалоМесяца(Строка.ДатаНачалаСписания), НачалоМесяца(Дата));
					Пока МесяцСписания <= НачалоМесяца(Строка.ДатаОкончанияСписания) Цикл
						
						ОтборСтрок = Новый Структура("ИФО,КФО,Контрагент,Договор,КПС");
						ЗаполнитьЗначенияСвойств(ОтборСтрок, Строка);
						Если ИспользоватьДетализациюПоКОСГУ Тогда
							ОтборСтрок.Вставить("КЭК", Строка.КЭК);
						КонецЕсли;
						ОтборСтрок.Вставить("Период", МесяцСписания);
						НайденныеСтрокиГрафика = ГрафикНачисления.НайтиСтроки(ОтборСтрок);
						
						Если НайденныеСтрокиГрафика.Количество() = 0 Тогда
							НоваяСтрокаГрафика = ГрафикНачисления.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаГрафика, Строка,
								"ИФО,КФО,Контрагент,Договор,КПС");
							Если ИспользоватьДетализациюПоКОСГУ Тогда
								НоваяСтрокаГрафика.КЭК = Строка.КЭК;
							КонецЕсли;
							НоваяСтрокаГрафика.Организация = Организация;
							НоваяСтрокаГрафика.Период = МесяцСписания;
						КонецЕсли;
						
						МесяцСписания = НачалоМесяца(ДобавитьМесяц(МесяцСписания, 1));
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		// Распределим справедливую стоимость по всем периодам графика по договору.
		ГрафикНачисления.Колонки.Добавить("СправедливаяСтоимость",
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой)));
		ГрафикНачисления.Колонки.Добавить("БазаРаспределения", Новый ОписаниеТипов("Число"));
		Для Каждого СтрокаТаблицы Из СтрокиСПризнаниемПоГрафику Цикл
			
			ОтборСтрок = Новый Структура("ИФО,КФО,Контрагент,Договор");
			ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаТаблицы);
			ОтборСтрок.Вставить("КПС", СтрокаТаблицы.КПС);
			Если ИспользоватьДетализациюПоКОСГУ Тогда
				ОтборСтрок.Вставить("КЭК", СтрокаТаблицы.КЭК);
			КонецЕсли;
			НайденныеСтрокиГрафика = ГрафикНачисления.НайтиСтроки(ОтборСтрок);
			
			ГрафикНачисления.ЗаполнитьЗначения(0, "БазаРаспределения");
			Для Каждого СтрокаГрафика Из НайденныеСтрокиГрафика Цикл
				Если СтрокаТаблицы.ОстатокРасходовПоУпущеннойВыгоде = 0 Тогда
					// Для обычных договоров (без льгот) справедливая стоимость распределена так же, как сумма реализации по графику.
					СтрокаГрафика.БазаРаспределения = СтрокаГрафика.Сумма;
				Иначе
					// При льготной аренде распределим справедливую стоимость равномерно по всем периодам графика по договору.
					СтрокаГрафика.БазаРаспределения = 1;
				КонецЕсли;
			КонецЦикла;
			
			Если ИспользоватьВалютныйУчет
				И НастройкиСчетовУчетаДБП[СтрокаТаблицы.СчетДБП].Валютный
				И ЗначениеЗаполнено(СтрокаТаблицы.Валюта)
				И СтрокаТаблицы.Валюта <> ВалютаРегламентированногоУчета Тогда
				ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(СтрокаТаблицы.ОстатокДБПВВалюте,
					НайденныеСтрокиГрафика, "СправедливаяСтоимость", "БазаРаспределения", Ложь);
			Иначе
				ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(СтрокаТаблицы.ОстатокДБП,
					НайденныеСтрокиГрафика, "СправедливаяСтоимость", "БазаРаспределения", Ложь);
			КонецЕсли;
			
			Если БухгалтерскийУчет.СчетВИерархии(СтрокаТаблицы.СчетДБП, "401.49") Тогда
				// Для последующего распределения обнулим числовые показатели (колонки базы распределения) в строках с 401.49,
				// т.к. эти суммы ДБП относятся к следующим отчетным периодам.
				СтрокаТаблицы.ОстатокСуммаПоДоговору = 0;
				СтрокаТаблицы.ОстатокДБП = 0;
				СтрокаТаблицы.ОстатокРасходовПоУпущеннойВыгоде = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		// Распределим сумму по графику по строкам ДБП пропорционально остаткам.
		Для Каждого СтрокаПоГрафику Из ГрафикНачисления Цикл
			
			Если ТипПериода = 0 Тогда // За месяц.
				Если СтрокаПоГрафику.Период < НачалоМесяца(Дата)
				 ИЛИ СтрокаПоГрафику.Период > КонецМесяца(Дата) Тогда
					Продолжить; // Пропускаем строки графика из других периодов.
				КонецЕсли;
			ИначеЕсли ТипПериода = 1 Тогда // На дату.
				Если СтрокаПоГрафику.Период < НачалоДня(Дата)
				 ИЛИ СтрокаПоГрафику.Период > КонецДня(Дата) Тогда
					Продолжить; // Пропускаем строки графика из других периодов.
				КонецЕсли;
			КонецЕсли;
			
			ОтборСтрок = Новый Структура("ИФО,КФО,Контрагент,Договор");
			ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаПоГрафику);
			ОтборСтрок.Вставить("КПС", СтрокаПоГрафику.КПС);
			Если ИспользоватьДетализациюПоКОСГУ Тогда
				ОтборСтрок.Вставить("КЭК", СтрокаПоГрафику.КЭК);
			КонецЕсли;
			НайденныеСтрокиДБП = ТаблицаОстатковДБП.НайтиСтроки(ОтборСтрок);
			
			ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(СтрокаПоГрафику.Сумма,
				НайденныеСтрокиДБП, "СуммаПоГрафику", "ОстатокСуммаПоДоговору", Ложь);
			ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(СтрокаПоГрафику.СправедливаяСтоимость,
				НайденныеСтрокиДБП, "СправедливаяПоГрафику", "ОстатокДБП", Ложь);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Расчет сумм списания доходов будущих периодов.
	Для Каждого ОстаткиДБП Из ТаблицаОстатковДБП Цикл
		
		Если БухгалтерскийУчет.СчетВИерархии(ОстаткиДБП.СчетДБП, "401.49") Тогда
			// Остатки по счету 401.49 используются в расчетах (для распределения упущенной выгоды 401.50),
			// при этом списание доходов будущих периодов производится только со счетов 401.40 и 401.41.
			Продолжить;
		КонецЕсли;
		
		Доля = 0;
		ПротоколРасчета = Новый Структура("Числитель, Знаменатель", 0, 0);
		Если ОстаткиДБП.СпособПризнанияДоходов = Перечисления.СпособыПризнанияРасходов.ПоКалендарнымДням
			ИЛИ ОстаткиДБП.СпособПризнанияДоходов = Перечисления.СпособыПризнанияРасходов.ПоМесяцам Тогда
			
			Если БухгалтерскийУчет.СчетВИерархии(ОстаткиДБП.СчетДБП, "401.41") Тогда
				Доля = БухгалтерскийУчет.ДоляОчередногоМесяцаПриРавномерномПризнанииДоходовРасходов(
					ОстаткиДБП.СпособПризнанияДоходов,
					ЭтотОбъект.Дата,
					Макс(ОстаткиДБП.ДатаНачалаСписания, НачалоГода(ЭтотОбъект.Дата)),
					Мин(ОстаткиДБП.ДатаОкончанияСписания, КонецГода(ЭтотОбъект.Дата)),
					ПротоколРасчета);
			Иначе
				Доля = БухгалтерскийУчет.ДоляОчередногоМесяцаПриРавномерномПризнанииДоходовРасходов(
					ОстаткиДБП.СпособПризнанияДоходов,
					ЭтотОбъект.Дата,
					ОстаткиДБП.ДатаНачалаСписания,
					ОстаткиДБП.ДатаОкончанияСписания,
					ПротоколРасчета);
			КонецЕсли;
				
			Если Доля = 0
				И ЗначениеЗаполнено(ОстаткиДБП.ДатаНачалаСписания)
				И КонецМесяца(Дата) < КонецМесяца(ОстаткиДБП.ДатаОкончанияСписания) Тогда
				Продолжить; // Срок списания еще не начался.
			КонецЕсли;
			
		ИначеЕсли ОстаткиДБП.СпособПризнанияДоходов = Перечисления.СпособыПризнанияРасходов.ПоГрафику
			ИЛИ ОстаткиДБП.СпособПризнанияДоходов = Перечисления.СпособыПризнанияРасходов.НаДатуПризнания Тогда
			
			Если ОстаткиДБП.СуммаПоГрафику = 0 Тогда
				Продолжить; // Не начисляется в данном периоде.
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоДоходыТекущегоПериодаПриКорректировкеДБП Тогда
			
			Если НЕ ЗначениеЗаполнено(ОстаткиДБП.ДатаОкончанияСписания) Тогда
				Продолжить; // Нет параметров учета в регистре. Возможно, ДБП приняты к учету ручной операцией.
			КонецЕсли;
			Если РеквизитыДокументаОснования.ВидОперации = Перечисления.ВидыОперацийКорректировкиДБП.ДосрочноеПрекрашение
				И (КонецДня(РеквизитыДокументаОснования.Дата) >= КонецДня(ОстаткиДБП.ДатаОкончанияСписания)) Тогда
				Продолжить;
			КонецЕсли;
			
			// При корректировке ДБП ранее завершения срока договора скорректируем долю очередного месяца.
			// Признание доходов текущего периода производится за период с начала месяца до даты документа.
			Если КонецДня(Дата) < КонецДня(ОстаткиДБП.ДатаОкончанияСписания) Тогда
				КоэффициентКорректировки = День(Дата) / День(КонецМесяца(Дата));
				ПротоколРасчета.Числитель = ПротоколРасчета.Числитель * КоэффициентКорректировки;
				Доля = Доля * КоэффициентКорректировки;
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока = ДоходыБудущихПериодов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстаткиДБП);
		
		Если ТипПериода = 0 Тогда // За месяц.
			НоваяСтрока.СодержаниеУслуги = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1, %2'"),
				ОстаткиДБП.НаименованиеУслуги,
				Формат(Дата, "ДФ=""ММММ гггг 'г.'"""));
		ИначеЕсли ТипПериода = 1 Тогда // На дату.
			НоваяСтрока.СодержаниеУслуги = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1, %2'"),
				ОстаткиДБП.НаименованиеУслуги,
				Формат(Дата, "ДЛФ=Д"));
		КонецЕсли;
		
		Если ОстаткиДБП.СпособПризнанияДоходов = Перечисления.СпособыПризнанияРасходов.ПоКалендарнымДням
		 ИЛИ ОстаткиДБП.СпособПризнанияДоходов = Перечисления.СпособыПризнанияРасходов.ПоМесяцам Тогда
		
			НоваяСтрока.Коэффициент            = Доля;
			НоваяСтрока.КоэффициентЧислитель   = ПротоколРасчета.Числитель;
			НоваяСтрока.КоэффициентЗнаменатель = ПротоколРасчета.Знаменатель;
			
			Если ИспользоватьВалютныйУчет
				И НастройкиСчетовУчетаДБП[ОстаткиДБП.СчетДБП].Валютный
				И ЗначениеЗаполнено(ОстаткиДБП.Валюта)
				И ОстаткиДБП.Валюта <> ВалютаРегламентированногоУчета Тогда
				НоваяСтрока.ВсегоСправедливая = Доля * НоваяСтрока.ОстатокДБПВВалюте;
			Иначе // В рублях.
				НоваяСтрока.ВсегоСправедливая = Доля * НоваяСтрока.ОстатокДБП;
			КонецЕсли;
			
			// Ставка НДС по умолчанию установлена в карточке номенклатуры.
			СтавкаНДС = УчетНДСКлиентСервер.ЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
			НоваяСтрока.СуммаНДССправедливая = НоваяСтрока.ВсегоСправедливая * СтавкаНДС / (100 + СтавкаНДС);
			
			// Заполним сумму и НДС по договору.
			Если ОстаткиДБП.ВидОперации = Перечисления.ВидыОперацийНачисленияДБП.ПередачаВБезвозмездноеПользование Тогда
				НоваяСтрока.Всего = 0;
				НоваяСтрока.СуммаНДС = 0;
			ИначеЕсли ОстаткиДБП.ВидОперации = Перечисления.ВидыОперацийНачисленияДБП.ПередачаВАрендуНаЛьготныхУсловиях Тогда
				// Рассчитаем через пропорцию остатка на 401.50 и на 401.40.
				СоотношениеДБПиРБП = ?(НоваяСтрока.ОстатокДБП = 0, 0, НоваяСтрока.ОстатокРасходовПоУпущеннойВыгоде / НоваяСтрока.ОстатокДБП);
				НоваяСтрока.Всего = НоваяСтрока.ВсегоСправедливая * (1 - СоотношениеДБПиРБП);
				НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДССправедливая * (1 - СоотношениеДБПиРБП);
			Иначе // Аренда по справедливой стоимости и прочие ДБП.
				НоваяСтрока.Всего = НоваяСтрока.ВсегоСправедливая;
				НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДССправедливая;
			КонецЕсли;
			
		ИначеЕсли ОстаткиДБП.СпособПризнанияДоходов = Перечисления.СпособыПризнанияРасходов.ПоГрафику
			ИЛИ ОстаткиДБП.СпособПризнанияДоходов = Перечисления.СпособыПризнанияРасходов.НаДатуПризнания Тогда
			
			// Заполним справедливую стоимость.
			Если ИспользоватьВалютныйУчет
				И НастройкиСчетовУчетаДБП[ОстаткиДБП.СчетДБП].Валютный
				И ЗначениеЗаполнено(ОстаткиДБП.Валюта)
				И ОстаткиДБП.Валюта <> ВалютаРегламентированногоУчета Тогда
				НоваяСтрока.ВсегоСправедливая = МИН(ОстаткиДБП.СправедливаяПоГрафику, НоваяСтрока.ОстатокДБПВВалюте);
			Иначе
				НоваяСтрока.ВсегоСправедливая = МИН(ОстаткиДБП.СправедливаяПоГрафику, НоваяСтрока.ОстатокДБП);
			КонецЕсли;
			
			// Ставка НДС по умолчанию установлена в карточке номенклатуры.
			СтавкаНДС = УчетНДСКлиентСервер.ЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
			НоваяСтрока.СуммаНДССправедливая = НоваяСтрока.ВсегоСправедливая * СтавкаНДС / (100 + СтавкаНДС);
			
			// Заполним сумму и НДС по договору.
			НоваяСтрока.Всего = МИН(ОстаткиДБП.СуммаПоГрафику, ОстаткиДБП.ОстатокСуммаПоДоговору);
			НоваяСтрока.СуммаНДС = НоваяСтрока.Всего * СтавкаНДС / (100 + СтавкаНДС);
			
			// Коэффициент списания рассчитываем по фактической стоимости списания, как если бы указали ее вручную.
			НоваяСтрока.Коэффициент = ?(НоваяСтрока.ОстатокДБП = 0, 0,
				НоваяСтрока.ВсегоСправедливая / НоваяСтрока.ОстатокДБП);
			НоваяСтрока.КоэффициентЧислитель	= 0;
			НоваяСтрока.КоэффициентЗнаменатель	= 0;
			
			НоваяСтрока.ОтразитьВГрафикеИсполненияДоговора = Перечисления.СтатусыДокументовКонтрольИсполненияДоговоров.ОтразитьСейчас;
			
		КонецЕсли;
		
		// Списание расходов по упущенной выгоде.
		Если ОстаткиДБП.ВидОперации = Перечисления.ВидыОперацийНачисленияДБП.ПередачаВБезвозмездноеПользование
			ИЛИ ОстаткиДБП.ВидОперации = Перечисления.ВидыОперацийНачисленияДБП.ПередачаВАрендуНаЛьготныхУсловиях Тогда
			
			НоваяСтрока.СуммаРасходовПоУпущеннойВыгоде =
				МИН(НоваяСтрока.ВсегоСправедливая - НоваяСтрока.Всего, НоваяСтрока.ОстатокРасходовПоУпущеннойВыгоде);
			
			ОтражениеВБухУчете = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОстаткиДБП.СтатьяРасходовПоУпущеннойВыгоде,
				"СчетРасходов,СубконтоРасходов1,СубконтоРасходов2,СубконтоРасходов3");
			НоваяСтрока.СчетРасходовПоУпущеннойВыгоде      = ОтражениеВБухУчете.СчетРасходов;
			НоваяСтрока.СубконтоРасходовПоУпущеннойВыгоде1 = ОтражениеВБухУчете.СубконтоРасходов1;
			НоваяСтрока.СубконтоРасходовПоУпущеннойВыгоде2 = ОтражениеВБухУчете.СубконтоРасходов2;
			НоваяСтрока.СубконтоРасходовПоУпущеннойВыгоде3 = ОтражениеВБухУчете.СубконтоРасходов3;
			
		КонецЕсли;
		
		// Налоговый учет.
		Если НалоговыйУчетКлиентСервер.ОтражатьВНалоговомУчете(Организация, Дата, НоваяСтрока.КФО) Тогда
			
			Если НЕ ЗначениеЗаполнено(ОстаткиДБП.ВидДеятельностиНУ) Тогда
				// По умолчанию - основная система налогообложения.
				НоваяСтрока.ВидДеятельностиНУ = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОстаткиДБП.СчетДоходовНУ) Тогда
				// По умолчанию - доходы от обычных видов деятельности.
				НоваяСтрока.СчетДоходовНУ = БухгалтерскийУчет.СчетПоКоду("Н90.01", Дата);
			КонецЕсли;
			
			Если НЕ БухгалтерскийУчет.СчетВИерархии(ОстаткиДБП.СчетДоходовНУ, "Н91.01") Тогда
				НоваяСтрока.СтатьяПрочихДоходовНУ = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
