
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСпискиВидовДокументов();
	
	СписокИсточниковСравнения1 = Элементы.ИсточникСравнения1.СписокВыбора;
	СписокИсточниковСравнения1.Добавить("ТиповаяОперация",             НСтр("ru = 'Типовая операция'"));
	СписокИсточниковСравнения1.Добавить("ПоставляемаяТиповаяОперация", НСтр("ru = 'Поставляемая типовая операция'"));
	СписокИсточниковСравнения1.Добавить("ТиповаяОперацияИзФайла",      НСтр("ru = 'Типовая операция из файла'"));
	СписокИсточниковСравнения1.Добавить("Файл",                        НСтр("ru = 'Все операции из файла поставки типовых операций'"));

	СписокИсточниковСравнения2 = Элементы.ИсточникСравнения2.СписокВыбора;
	СписокИсточниковСравнения2.Добавить("ТиповаяОперация",             НСтр("ru = 'Типовая операция'"));
	СписокИсточниковСравнения2.Добавить("ПоставляемаяТиповаяОперация", НСтр("ru = 'Поставляемая типовая операция'"));
	СписокИсточниковСравнения2.Добавить("ТиповаяОперацияИзФайла",      НСтр("ru = 'Типовая операция из файла'"));
	СписокИсточниковСравнения2.Добавить("Файл",                        НСтр("ru = 'Все операции из файла поставки типовых операций'"));
	
	Если ЗначениеЗаполнено(Параметры.ИсточникСравнения1) Тогда
		Если ТипЗнч(Параметры.ИсточникСравнения1) = Тип("СправочникСсылка.ТиповыеОперации") Тогда
			ИсточникСравнения1 = "ТиповаяОперация";
			ТиповаяОперация1 = Параметры.ИсточникСравнения1;
			ИдентификаторДокумента1 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТиповаяОперация1, "ИдентификаторДокумента");
		ИначеЕсли ТипЗнч(Параметры.ИсточникСравнения1) = Тип("СправочникСсылка.ПоставляемыеТиповыеОперации") Тогда
			ИсточникСравнения1 = "ПоставляемаяТиповаяОперация";
			ПоставляемаяТиповаяОперация1 = Параметры.ИсточникСравнения1;
			ИдентификаторДокумента1 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПоставляемаяТиповаяОперация1, "ИдентификаторДокумента");
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИсточникСравнения1) Тогда
		ИсточникСравнения1 = "ТиповаяОперация";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ИсточникСравнения2) Тогда
		Если ТипЗнч(Параметры.ИсточникСравнения2) = Тип("СправочникСсылка.ТиповыеОперации") Тогда
			ИсточникСравнения2 = "ТиповаяОперация";
			ТиповаяОперация2 = Параметры.ИсточникСравнения2;
			ИдентификаторДокумента2 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТиповаяОперация2, "ИдентификаторДокумента");
		ИначеЕсли ТипЗнч(Параметры.ИсточникСравнения2) = Тип("СправочникСсылка.ПоставляемыеТиповыеОперации") Тогда
			ИсточникСравнения2 = "ПоставляемаяТиповаяОперация";
			ПоставляемаяТиповаяОперация2 = Параметры.ИсточникСравнения2;
			ИдентификаторДокумента2 = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПоставляемаяТиповаяОперация2, "ИдентификаторДокумента");
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИсточникСравнения2) Тогда
		ИсточникСравнения2 = "ТиповаяОперация";
	КонецЕсли;
	
	ПредставлениеИмениФайла1 = НСтр("ru = 'Файл поставки типовых операций'");
	ПредставлениеОперацииИзФайла1 = НСтр("ru = 'Выбрать типовую операцию'");
	ПредставлениеИмениФайла2 = НСтр("ru = 'Файл поставки типовых операций'");
	ПредставлениеОперацииИзФайла2 = НСтр("ru = 'Выбрать типовую операцию'");

	УстановитьВидимостьЭлементовПоИсточникуСравнения(ЭтотОбъект, "1");
	УстановитьВидимостьЭлементовПоИсточникуСравнения(ЭтотОбъект, "2");
	
	Если Параметры.Свойство("ТолькоОтличия") Тогда
		Объект.ТолькоОтличия = Параметры.ТолькоОтличия = Истина;
	КонецЕсли;
	
	ФормироватьПриОткрытии = Параметры.ФормироватьПриОткрытии;
	
	Если Параметры.СравнитьВсеТиповыеОперации Тогда
		ОтображениеПанелиНастроек = Ложь;
		СравнитьВсеТиповыеОперации = Истина;
		ФормироватьПриОткрытии = Истина;
	Иначе
		ОтображениеПанелиНастроек = Истина;
	КонецЕсли;
	
	УстановитьОтображениеПанелиНастроек(ЭтотОбъект);
	Элементы.ФормаТолькоОтличия.Пометка = Объект.ТолькоОтличия;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ФормироватьПриОткрытии Тогда
		ПодключитьОбработчикОжидания("ЗапуститьСравнение", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсточникСравнения1ПриИзменении(Элемент)
	УстановитьВидимостьЭлементовПоИсточникуСравнения(ЭтотОбъект, "1");
КонецПроцедуры

&НаКлиенте
Процедура ИсточникСравнения2ПриИзменении(Элемент)
	УстановитьВидимостьЭлементовПоИсточникуСравнения(ЭтотОбъект, "2");
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторДокумента1ПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ИдентификаторДокумента1) И ИдентификаторДокумента2 <> ИдентификаторДокумента1 Тогда
		ИдентификаторДокумента2 = ИдентификаторДокумента1;
		ТиповаяОперация2 = Неопределено;
		ПоставляемаяТиповаяОперация2 = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТиповаяОперация1ПриИзменении(Элемент)
	Если ИсточникСравнения2 = "ПоставляемаяТиповаяОперация" И ЗначениеЗаполнено(ТиповаяОперация1) Тогда
		ПоставляемаяТиповаяОперация2 = ПоставляемаяОперацияТиповойОперации(ТиповаяОперация1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеИмениФайла1Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПредставлениеИмениФайлаНажатие("1");
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОперацииИзФайла1Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПредставлениеОперацииИзФайлаНажатие("1");
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеИмениФайла2Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПредставлениеИмениФайлаНажатие("2");
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОперацииИзФайла2Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПредставлениеОперацииИзФайлаНажатие("2");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сравнить(Команда)
	
	Если НЕ ПроверитьЗаполнениеНаКлиенте() Тогда
		Возврат;
	КонецЕсли;
	
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДлительнаяОперация48;
	ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет формируется...'");
	
	Попытка
	
		Если ИсточникСравнения1 = "Файл" И ИсточникСравнения2 = "Файл" Тогда
			СравнитьФайлыОпераций();
		Иначе
			СравнитьНаСервере();
		КонецЕсли;
	
	Исключение
		
		ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
		ОтображениеСостояния.Картинка = Неопределено;
		ОтображениеСостояния.Текст    = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	ОтображениеСостояния.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОтличия(Команда)
	Объект.ТолькоОтличия = Не Объект.ТолькоОтличия;
	Элементы.ФормаТолькоОтличия.Пометка = Объект.ТолькоОтличия;
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.Картинка                       = Неопределено;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет не сформирован. Нажмите ""Сравнить"" для получения отчета.'");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПанельНастроек(Команда)
	ОтображениеПанелиНастроек = Не ОтображениеПанелиНастроек;
	УстановитьОтображениеПанелиНастроек(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СравнитьВсеСнятыеСПоддержки(Команда)
	
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДлительнаяОперация48;
	ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет формируется...'");
	
	СравнитьВсеСнятыеСПоддержкиНаСервере();
	
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	ОтображениеСостояния.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеНастройки(СторонаНастройки, Отказ)
	Перем РеквизитСообщения;
	
	ИсточникСравнения = ЭтотОбъект["ИсточникСравнения" + СторонаНастройки];
	Если ИсточникСравнения = "ТиповаяОперация" Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект["ТиповаяОперация" + СторонаНастройки]) Тогда
			РеквизитСообщения = "ТиповаяОперация" + СторонаНастройки;
			ПредставлениеРеквизита = Элементы["ИсточникСравнения" + СторонаНастройки]
			.СписокВыбора.НайтиПоЗначению("ТиповаяОперация").Представление;
		КонецЕсли;
	ИначеЕсли ИсточникСравнения = "ПоставляемаяТиповаяОперация" Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект["ПоставляемаяТиповаяОперация" + СторонаНастройки]) Тогда
			РеквизитСообщения = "ПоставляемаяТиповаяОперация" + СторонаНастройки;
			ПредставлениеРеквизита = Элементы["ИсточникСравнения" + СторонаНастройки]
			.СписокВыбора.НайтиПоЗначению("ПоставляемаяТиповаяОперация").Представление;
		КонецЕсли;
	ИначеЕсли ИсточникСравнения = "ТиповаяОперацияИзФайла" Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект["СсылкаОперацииВФайле" + СторонаНастройки]) Тогда
			РеквизитСообщения = "ПредставлениеОперацииИзФайла" + СторонаНастройки;
			ПредставлениеРеквизита = Элементы["ИсточникСравнения" + СторонаНастройки]
			.СписокВыбора.НайтиПоЗначению("ТиповаяОперацияИзФайла").Представление;
		КонецЕсли;
	ИначеЕсли ИсточникСравнения = "Файл" Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект["АдресФайла" + СторонаНастройки]) Тогда
			РеквизитСообщения = "ПредставлениеИмениФайла" + СторонаНастройки;
			ПредставлениеРеквизита = Элементы["ИсточникСравнения" + СторонаНастройки]
			.СписокВыбора.НайтиПоЗначению("Файл").Представление;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,ПредставлениеРеквизита),,,
			РеквизитСообщения, Отказ);
	КонецЕсли;

КонецПроцедуры
 

&НаКлиенте
Функция ПроверитьЗаполнениеНаКлиенте()

	Если (ИсточникСравнения1 = "Файл" ИЛИ ИсточникСравнения2 = "Файл")
		И ИсточникСравнения1 <> ИсточникСравнения2 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Вариант сравнения ""Все операции из файла поставки"" можно использовать только при сравнении двух файлов поставки'"),,,
			"ИсточникСравнения2");
			
		Возврат Ложь;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеНастройки(1, Отказ);
	ПроверитьЗаполнениеНастройки(2, Отказ);
	
	Возврат Не Отказ;

КонецФункции
 

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеПанелиНастроек(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппаНастройки",
		"Видимость", Форма.ОтображениеПанелиНастроек);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ФормаПоказатьПанельНастроек",
		"Пометка", Форма.ОтображениеПанелиНастроек);

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСравнение()

	Если СравнитьВсеТиповыеОперации Тогда
		СравнитьВсеСнятыеСПоддержки(Неопределено);
	Иначе
		Сравнить(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СравнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Результат.Очистить();
	Макет = ОбработкаОбъект.ПолучитьМакет("МакетСравненияОпераций");
	МакетЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Результат.Вывести(МакетЗаголовок);
	
	ДанныеОперации1 = ПолучитьДанныеОперацииДляСравнения("1");
	ДанныеОперации2 = ПолучитьДанныеОперацииДляСравнения("2");
	
	ДанныеСравнения = ОбработкаОбъект.ПолучитьДанныеСравненияТиповыхОпераций(ДанныеОперации1, ДанныеОперации2);
	
	ВывестиДанныеСравненияВМакет(ДанныеСравнения);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиДанныеСравненияВМакет(ДанныеСравнения)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Макет = ОбработкаОбъект.ПолучитьМакет("МакетСравненияОпераций");
	Шапка                  = Макет.ПолучитьОбласть("Шапка");
	ЗаголовокДопРеквизиты  = Макет.ПолучитьОбласть("ЗаголовокДопРеквизиты");
	ЗаголовокДопРеквизиты1 = Макет.ПолучитьОбласть("ЗаголовокДопРеквизиты1");
	ЗаголовокПроводки      = Макет.ПолучитьОбласть("ЗаголовокПроводки");
	ЗаголовокПроводки1     = Макет.ПолучитьОбласть("ЗаголовокПроводки1");
	ЗаголовокИсточники     = Макет.ПолучитьОбласть("ЗаголовокИсточники");
	ЗаголовокИсточники1    = Макет.ПолучитьОбласть("ЗаголовокИсточники1");
	ЗаголовокИсточники2    = Макет.ПолучитьОбласть("ЗаголовокИсточники2");
	ОбластьНетРазличий     = Макет.ПолучитьОбласть("НетРазличий");
	
	ЗаголовокТиповаяОперация = Макет.ПолучитьОбласть("ЗаголовокТиповаяОперация");
	ОбластьСвойство = Макет.ПолучитьОбласть("Свойство");
	
	ПредставлениеОперации1 = НСтр("ru = 'Типовая операция
	|[НаименованиеОперации]
	|([ИдентификаторДокумента])'");
	
	ПредставлениеОперации2 = НСтр("ru = 'Типовая операция
	|[НаименованиеОперации]
	|([ИдентификаторДокумента])'");
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(ДанныеСравнения);
	
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.Имя = "ТиповаяОперация" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ПараметрыШапки = Новый Структура("ТиповаяОперация1, ТиповаяОперация2");
			ПараметрыШапки.ТиповаяОперация1 = СтрЗаменить(ПредставлениеОперации1, "[НаименованиеОперации]",
				Чтение.ПолучитьАтрибут("НаименованиеОперации1"));
			ПараметрыШапки.ТиповаяОперация1 = СтрЗаменить(ПараметрыШапки.ТиповаяОперация1, "[ИдентификаторДокумента]",
				Чтение.ПолучитьАтрибут("Документ1"));
			ПараметрыШапки.ТиповаяОперация2 = СтрЗаменить(ПредставлениеОперации2, "[НаименованиеОперации]",
				Чтение.ПолучитьАтрибут("НаименованиеОперации2"));
			ПараметрыШапки.ТиповаяОперация2 = СтрЗаменить(ПараметрыШапки.ТиповаяОперация2, "[ИдентификаторДокумента]",
				Чтение.ПолучитьАтрибут("Документ2"));
			
			Шапка.Параметры.Заполнить(ПараметрыШапки);
			Результат.Вывести(Шапка, 0, "Шапка");
			Результат.НачатьАвтогруппировкуСтрок();
			
			ЗаголовокТиповаяОперация = Макет.ПолучитьОбласть("ЗаголовокТиповаяОперация");
			
			ЕстьРазличияВТиповойОперации = Ложь;
			ВыводДанныхОперации = Ложь;
			ВыводДополнительныхРеквизитов = Ложь;
			ВыводПроводок = Ложь;
			ВыводИсточниковДанных = Ложь;
			
			ВыведенЗаголовокДанныеОперации = Ложь;
			ВыведенЗаголовокДополнительныеРеквизиты = Ложь;
			ВыведенЗаголовокТекущийДополнительныйРеквизит = Ложь;
			ВыведенЗаголовокИсточникиДанных = Ложь;
			ВыведенЗаголовокПроводки = Ложь;
			
		ИначеЕсли Чтение.Имя = "ДанныеОперации" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ВыводДанныхОперации = Истина;
			ВыводДополнительныхРеквизитов = Ложь;
			ВыводПроводок = Ложь;
			ВыводИсточниковДанных = Ложь;
			
		ИначеЕсли Чтение.Имя = "ДополнительныйРеквизит" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ВыводДанныхОперации = Ложь;
			ВыводДополнительныхРеквизитов = Истина;
			ВыведенЗаголовокТекущийДополнительныйРеквизит = Ложь;
			ВыводПроводок = Ложь;
			ВыводИсточниковДанных = Ложь;
			
			ПараметрыЗаголовкаТекущегоДопРеквизита = Новый Структура("ИмяДляФормулы, Наименование1, Наименование2");
			ПараметрыЗаголовкаТекущегоДопРеквизита.ИмяДляФормулы = Чтение.ПолучитьАтрибут("ИмяДляФормулы");
			ПараметрыЗаголовкаТекущегоДопРеквизита.Наименование1 = Чтение.ПолучитьАтрибут("Наименование1");
			ПараметрыЗаголовкаТекущегоДопРеквизита.Наименование2 = Чтение.ПолучитьАтрибут("Наименование2");
			
			ТекущийДопРеквизитЕстьДанные1 = ПараметрыЗаголовкаТекущегоДопРеквизита.Наименование1 <> Неопределено;
			ТекущийДопРеквизитЕстьДанные2 = ПараметрыЗаголовкаТекущегоДопРеквизита.Наименование2 <> Неопределено;
			
		ИначеЕсли Чтение.Имя = "ИсточникиДанных" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ВыводДанныхОперации = Ложь;
			ВыводДополнительныхРеквизитов = Ложь;
			ВыводПроводок = Ложь;
			ВыводИсточниковДанных = Истина;
			
		ИначеЕсли Чтение.Имя = "ИсточникДанных" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ВыведенЗаголовокТекущегоИсточника = Ложь;
			ПараметрыЗаголовкаТекущегоИсточника = Новый Структура("ИмяИсточника, Наименование1, Наименование2");
			ПараметрыЗаголовкаТекущегоИсточника.ИмяИсточника = Чтение.ПолучитьАтрибут("ИмяИсточника");
			ПараметрыЗаголовкаТекущегоИсточника.Наименование1 = Чтение.ПолучитьАтрибут("Наименование1");
			ПараметрыЗаголовкаТекущегоИсточника.Наименование2 = Чтение.ПолучитьАтрибут("Наименование2");
			
		ИначеЕсли Чтение.Имя = "ПараметрыИсточникаДанных" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ВыведенЗаголовокТабличнойЧастиИсточникаДанных = Ложь;
			
		ИначеЕсли Чтение.Имя = "ПараметрИсточникаДанных" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если Не ВыведенЗаголовокИсточникиДанных Тогда
				Результат.Вывести(ЗаголовокИсточники, 1);
				ВыведенЗаголовокИсточникиДанных = Истина;
			КонецЕсли;
			Если Не ВыведенЗаголовокТекущегоИсточника Тогда
				УстановитьЦветСтрокиТаблицы(ЗаголовокИсточники1, Ложь,
					ПараметрыЗаголовкаТекущегоИсточника.Наименование1, ПараметрыЗаголовкаТекущегоИсточника.Наименование2);
				ЗаголовокИсточники1.Параметры.Заполнить(ПараметрыЗаголовкаТекущегоИсточника);
				Результат.Вывести(ЗаголовокИсточники1, 1);
				ВыведенЗаголовокТекущегоИсточника = Истина;
			КонецЕсли;
			Если НЕ ВыведенЗаголовокТабличнойЧастиИсточникаДанных Тогда
				ЗаголовокИсточники2.Параметры.ИмяВыводимойТаблицы = НСтр("ru = 'Параметры источника данных'");
				Результат.Вывести(ЗаголовокИсточники2, 1);
				ВыведенЗаголовокТабличнойЧастиИсточникаДанных = Истина;
			КонецЕсли;
			
			ЕстьРазличияВТиповойОперации = Истина;
			ДанныеПараметраИсточника = Обработки.СравнениеТиповыхОпераций.ПрочитатьДанныеПараметраИсточникаДанных(Чтение);
			
			ОбластьСвойство.Параметры.ИмяСвойства = ДанныеПараметраИсточника.ИмяПараметра;
			ОбластьСвойство.Параметры.ЗначениеСвойства1 = ДанныеПараметраИсточника.ФормулаПараметра1;
			ОбластьСвойство.Параметры.ЗначениеСвойства2 = ДанныеПараметраИсточника.ФормулаПараметра2;
			
			Если ЗначениеЗаполнено(ДанныеПараметраИсточника.ФормулаПараметра2)
				И ДанныеПараметраИсточника.ФормулаПараметра1НетДанных Тогда
				
				УстановитьЦветДобавленныеДанные(ОбластьСвойство);
			ИначеЕсли ЗначениеЗаполнено(ДанныеПараметраИсточника.ФормулаПараметра1)
				И ДанныеПараметраИсточника.ФормулаПараметра2НетДанных Тогда
				
				УстановитьЦветУдаленныеДанные(ОбластьСвойство);
			Иначе
				
				УстановитьЦветСтрокиТаблицы(ОбластьСвойство, ДанныеПараметраИсточника.ЕстьРазличия,
					ДанныеПараметраИсточника.ФормулаПараметра1, ДанныеПараметраИсточника.ФормулаПараметра2);
			КонецЕсли;
			
			Результат.Вывести(ОбластьСвойство, 1);
			
		ИначеЕсли Чтение.Имя = "КолонкиИсточникаДанных" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ВыведенЗаголовокТабличнойЧастиИсточникаДанных = Ложь;
			
		ИначеЕсли Чтение.Имя = "КолонкаИсточникаДанных" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если Не ВыведенЗаголовокИсточникиДанных Тогда
				Результат.Вывести(ЗаголовокИсточники, 1);
				ВыведенЗаголовокИсточникиДанных = Истина;
			КонецЕсли;
			Если Не ВыведенЗаголовокТекущегоИсточника Тогда
				УстановитьЦветСтрокиТаблицы(ЗаголовокИсточники1, Ложь,
					ПараметрыЗаголовкаТекущегоИсточника.Наименование1, ПараметрыЗаголовкаТекущегоИсточника.Наименование2);
				ЗаголовокИсточники1.Параметры.Заполнить(ПараметрыЗаголовкаТекущегоИсточника);
				Результат.Вывести(ЗаголовокИсточники1, 1);
				ВыведенЗаголовокТекущегоИсточника = Истина;
			КонецЕсли;
			Если НЕ ВыведенЗаголовокТабличнойЧастиИсточникаДанных Тогда
				ЗаголовокИсточники2.Параметры.ИмяВыводимойТаблицы = НСтр("ru = 'Колонки источника данных'");
				Результат.Вывести(ЗаголовокИсточники2, 1);
				ВыведенЗаголовокТабличнойЧастиИсточникаДанных = Истина;
			КонецЕсли;
			
			ЕстьРазличияВТиповойОперации = Истина;
			ДанныеКолонкиИсточника = Обработки.СравнениеТиповыхОпераций.ПрочитатьДанныеКолонкиИсточникаДанных(Чтение);
			
			ОбластьСвойство.Параметры.ИмяСвойства = ДанныеКолонкиИсточника.ИмяКолонки;
			ОбластьСвойство.Параметры.ЗначениеСвойства1 = ?(ДанныеКолонкиИсточника.Ресурс1 = Истина, НСтр("ru = 'ресурс'"), "");
			ОбластьСвойство.Параметры.ЗначениеСвойства2 = ?(ДанныеКолонкиИсточника.Ресурс2 = Истина, НСтр("ru = 'ресурс'"), "");
			
			Если ДанныеКолонкиИсточника.Ресурс1НетДанных Тогда
				УстановитьЦветДобавленныеДанные(ОбластьСвойство);
			ИначеЕсли ДанныеКолонкиИсточника.Ресурс2НетДанных Тогда
				УстановитьЦветУдаленныеДанные(ОбластьСвойство);
			Иначе
				УстановитьЦветСтрокиТаблицы(ОбластьСвойство, ДанныеКолонкиИсточника.ЕстьРазличия,
					ДанныеКолонкиИсточника.Ресурс1, ДанныеКолонкиИсточника.Ресурс2);
			КонецЕсли;
			
			Результат.Вывести(ОбластьСвойство, 1);
			
		ИначеЕсли Чтение.Имя = "Проводки" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ВыводДанныхОперации = Ложь;
			ВыводДополнительныхРеквизитов = Ложь;
			ВыводПроводок = Истина;
			ВыводИсточниковДанных = Ложь;
			
			ВыведенЗаголовокТекущейПроводки = Ложь;
			
		ИначеЕсли Чтение.Имя = "Проводка" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ВыведенЗаголовокТекущейПроводки = Ложь;
			ПараметрыЗаголовкаТекущейПроводки = Новый Структура("Наименование1, Наименование2");
			ПараметрыЗаголовкаТекущейПроводки.Наименование1 = Чтение.ПолучитьАтрибут("Наименование1");
			ПараметрыЗаголовкаТекущейПроводки.Наименование2 = Чтение.ПолучитьАтрибут("Наименование2");
			
		ИначеЕсли Чтение.Имя = "Реквизит" И Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ВыводДанныхОперации Тогда
				Если Не ВыведенЗаголовокДанныеОперации Тогда
					Результат.Вывести(ЗаголовокТиповаяОперация, 1);
					ВыведенЗаголовокДанныеОперации = Истина;
				КонецЕсли;
			ИначеЕсли ВыводДополнительныхРеквизитов Тогда
				Если Не ВыведенЗаголовокДополнительныеРеквизиты Тогда
					Результат.Вывести(ЗаголовокДопРеквизиты, 1);
					ВыведенЗаголовокДополнительныеРеквизиты = Истина;
				КонецЕсли;
				Если Не ВыведенЗаголовокТекущийДополнительныйРеквизит Тогда
					УстановитьЦветСтрокиТаблицы(ЗаголовокДопРеквизиты1, Ложь,
						ПараметрыЗаголовкаТекущегоДопРеквизита.Наименование1,
						ПараметрыЗаголовкаТекущегоДопРеквизита.Наименование2);
					ЗаголовокДопРеквизиты1.Параметры.Заполнить(ПараметрыЗаголовкаТекущегоДопРеквизита);
					Результат.Вывести(ЗаголовокДопРеквизиты1, 1);
					ВыведенЗаголовокТекущийДополнительныйРеквизит = Истина;
				КонецЕсли;
			ИначеЕсли ВыводПроводок Тогда
				Если Не ВыведенЗаголовокПроводки Тогда
					Результат.Вывести(ЗаголовокПроводки, 1);
					ВыведенЗаголовокПроводки = Истина;
				КонецЕсли;
				Если Не ВыведенЗаголовокТекущейПроводки Тогда
					УстановитьЦветСтрокиТаблицы(ЗаголовокПроводки1, Ложь,
						ПараметрыЗаголовкаТекущейПроводки.Наименование1, ПараметрыЗаголовкаТекущейПроводки.Наименование2);
					ЗаголовокПроводки1.Параметры.Заполнить(ПараметрыЗаголовкаТекущейПроводки);
					Результат.Вывести(ЗаголовокПроводки1, 1);
					ВыведенЗаголовокТекущейПроводки = Истина;
				КонецЕсли;
			ИначеЕсли ВыводИсточниковДанных Тогда
				
				Если Не ВыведенЗаголовокИсточникиДанных Тогда
					Результат.Вывести(ЗаголовокИсточники, 1);
					ВыведенЗаголовокИсточникиДанных = Истина;
				КонецЕсли;
				Если Не ВыведенЗаголовокТекущегоИсточника Тогда
					УстановитьЦветСтрокиТаблицы(ЗаголовокИсточники1, Ложь,
						ПараметрыЗаголовкаТекущегоИсточника.Наименование1, ПараметрыЗаголовкаТекущегоИсточника.Наименование2);
					ЗаголовокИсточники1.Параметры.Заполнить(ПараметрыЗаголовкаТекущегоИсточника);
					Результат.Вывести(ЗаголовокИсточники1, 1);
					ВыведенЗаголовокТекущегоИсточника = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			ЕстьРазличияВТиповойОперации = Истина;
			
			ПараметрыОбласти = Новый Структура("ИмяСвойства, ЗначениеСвойства1, ЗначениеСвойства2");
			ПараметрыОбласти.ИмяСвойства = Чтение.ПолучитьАтрибут("Представление");
			
			ИмяСвойства = Чтение.ПолучитьАтрибут("Имя");
			
			ЗначениеСвойства1 = Неопределено;
			ЗначениеСвойства2 = Неопределено;
			
			ЕстьРазличия = Чтение.ПолучитьАтрибут("ЕстьРазличия") = "1";
			Чтение.Прочитать();
			ЕстьДанные1 = Чтение.ПолучитьАтрибут("НетДанных") <> "Да";
			Если ЕстьДанные1 Тогда
				Чтение.Прочитать();
				ЗначениеСвойства1 = СериализаторXDTO.ПрочитатьXML(Чтение);
			Иначе
				Чтение.Прочитать();
			КонецЕсли;
			Чтение.Прочитать();
			ЕстьДанные2 = Чтение.ПолучитьАтрибут("НетДанных") <> "Да";
			Если ЕстьДанные2 Тогда
				Чтение.Прочитать();
				ЗначениеСвойства2 = СериализаторXDTO.ПрочитатьXML(Чтение);
			КонецЕсли;
			
			ДополнительноОбработатьЗначениеПоля(ЗначениеСвойства1, ИмяСвойства);
			ДополнительноОбработатьЗначениеПоля(ЗначениеСвойства2, ИмяСвойства);
			
			ПараметрыОбласти.ЗначениеСвойства1 = ЗначениеСвойства1;
			ПараметрыОбласти.ЗначениеСвойства2 = ЗначениеСвойства2;
			
			Если ВыводДополнительныхРеквизитов И НЕ ТекущийДопРеквизитЕстьДанные1 Тогда
				УстановитьЦветДобавленныеДанные(ОбластьСвойство);
			ИначеЕсли ВыводДополнительныхРеквизитов И НЕ ТекущийДопРеквизитЕстьДанные2 Тогда
				УстановитьЦветУдаленныеДанные(ОбластьСвойство);
			Иначе
				УстановитьЦветСтрокиТаблицы(ОбластьСвойство, ЕстьРазличия,
					ПараметрыОбласти.ЗначениеСвойства1, ПараметрыОбласти.ЗначениеСвойства2);
			КонецЕсли;
			
			ОбластьСвойство.Параметры.Заполнить(ПараметрыОбласти);
			Результат.Вывести(ОбластьСвойство, 1);
			
		ИначеЕсли Чтение.Имя = "ТиповаяОперация" И Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			Если НЕ ЕстьРазличияВТиповойОперации Тогда
				Результат.Вывести(ОбластьНетРазличий, 0);
			КонецЕсли;
			Результат.ЗакончитьАвтогруппировкуСтрок();
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьЦветСтрокиТаблицы(Область, ЕстьРазличия, Данные1, Данные2)

	Если НЕ ЕстьРазличия Тогда
		Область.Области[0].ЦветТекста = Новый Цвет();
	ИначеЕсли Данные1 = Неопределено Тогда
		УстановитьЦветДобавленныеДанные(Область);
	ИначеЕсли Данные2 = Неопределено Тогда
		УстановитьЦветУдаленныеДанные(Область);
	Иначе
		Область.Области[0].ЦветТекста = WebЦвета.Коричневый;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьЦветДобавленныеДанные(Область)
	
	Область.Области[0].ЦветТекста = WebЦвета.Зеленый;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветУдаленныеДанные(Область)
	
	Область.Области[0].ЦветТекста = WebЦвета.Синий;
	
КонецПроцедуры

&НаСервере
Процедура ДополнительноОбработатьЗначениеПоля(ЗначениеСвойства, ИмяПоля)

	Если ЗначениеСвойства = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ИмяПоля = "УсловиеИспользования" Тогда
		ЗначениеСвойства = Обработки.СравнениеТиповыхОпераций.ПреобразоватьОтборВСтроку(ЗначениеСвойства, "УсловияИспользования");
	ИначеЕсли ИмяПоля = "ОтборЭлементов" Тогда
		ЗначениеСвойства = Обработки.СравнениеТиповыхОпераций.ПреобразоватьОтборВСтроку(ЗначениеСвойства, ИмяПоля);
	ИначеЕсли ИмяПоля = "СвязиПараметровВыбора" Тогда
		Если ЗначениеЗаполнено(ЗначениеСвойства)
			И ТипЗнч(ЗначениеСвойства) = Тип("Строка")
			И Лев(ЗначениеСвойства, 4) = "{""#""" Тогда
			
			ТаблицаСвязей = ЗначениеИзСтрокиВнутр(ЗначениеСвойства);
			ЗначениеСвойства = "";
			Для каждого ЗначениеСвязи Из ТаблицаСвязей Цикл
			
				ЗначениеСвойства = ?(ПустаяСтрока(ЗначениеСвойства), "", Символы.ПС)
								+ """" + ЗначениеСвязи.Имя + """" + Символы.НПП
								+ """" + ЗначениеСвязи.Реквизит + """" + Символы.НПП
								+ """" + ЗначениеСвязи.Режим + """";
			
			КонецЦикла; 
			
		КонецЕсли;
	ИначеЕсли ИмяПоля = "ПараметрыВыбора" Тогда
		Если ЗначениеЗаполнено(ЗначениеСвойства)
			И ТипЗнч(ЗначениеСвойства) = Тип("Строка")
			И Лев(ЗначениеСвойства, 4) = "{""#""" Тогда
			
			ЗначениеПараметрыВыбора = ЗначениеИзСтрокиВнутр(ЗначениеСвойства);
			СоставЗначений = Новый Массив;
			Для каждого ЭлементКоллекции Из ЗначениеПараметрыВыбора Цикл
				СоставЗначений.Добавить(ЭлементКоллекции.Имя + "(" + ЭлементКоллекции.Значение + ")");
			КонецЦикла; 
			ЗначениеСвойства = СтрСоединить(СоставЗначений, Символы.ПС);
		КонецЕсли;
	ИначеЕсли ИмяПоля = "Подсказка" Тогда
		Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЗначениеСвойства = НСтр("ru = '<настройка отображения подсказки>'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СравнитьФайлыОпераций()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Результат.Очистить();
	Макет = ОбработкаОбъект.ПолучитьМакет("МакетСравненияОпераций");
	МакетЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Результат.Вывести(МакетЗаголовок);
	
	ТекстФайла1 = ПолучитьТекстФайлаОперации(ЭтотОбъект["АдресФайла1"]);
	ТекстФайла2 = ПолучитьТекстФайлаОперации(ЭтотОбъект["АдресФайла2"]);
	
	ДанныеСравнения = ОбработкаОбъект.ПолучитьДанныеСравненияТекстовФайловТиповыхОпераций(ТекстФайла1, ТекстФайла2);
	
	ВывестиДанныеСравненияВМакет(ДанныеСравнения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовПоИсточникуСравнения(Форма, НомерСтороныСравнения)

	ВыбранноеЗначение = Форма["ИсточникСравнения" + НомерСтороныСравнения];
	
	ВидимыеЭлементы = Новый Массив;
	НеВидимыеЭлементы = Новый Массив;
	Если ВыбранноеЗначение = "ТиповаяОперация" Тогда
		
		ВидимыеЭлементы.Добавить("ИдентификаторДокумента");
		ВидимыеЭлементы.Добавить("ТиповаяОперация");
		
		НеВидимыеЭлементы.Добавить("ПоставляемаяТиповаяОперация");
		НеВидимыеЭлементы.Добавить("ПредставлениеИмениФайла");
		НеВидимыеЭлементы.Добавить("ПредставлениеОперацииИзФайла");
		
	ИначеЕсли ВыбранноеЗначение = "ПоставляемаяТиповаяОперация" Тогда
		
		ВидимыеЭлементы.Добавить("ИдентификаторДокумента");
		ВидимыеЭлементы.Добавить("ПоставляемаяТиповаяОперация");
		
		НеВидимыеЭлементы.Добавить("ТиповаяОперация");
		НеВидимыеЭлементы.Добавить("ПредставлениеИмениФайла");
		НеВидимыеЭлементы.Добавить("ПредставлениеОперацииИзФайла");
		
	ИначеЕсли ВыбранноеЗначение = "ТиповаяОперацияИзФайла" Тогда
		
		ВидимыеЭлементы.Добавить("ПредставлениеИмениФайла");
		ВидимыеЭлементы.Добавить("ПредставлениеОперацииИзФайла");
		
		НеВидимыеЭлементы.Добавить("ИдентификаторДокумента");
		НеВидимыеЭлементы.Добавить("ТиповаяОперация");
		НеВидимыеЭлементы.Добавить("ПоставляемаяТиповаяОперация");
		
	ИначеЕсли ВыбранноеЗначение = "Файл" Тогда
		
		ВидимыеЭлементы.Добавить("ПредставлениеИмениФайла");
		
		НеВидимыеЭлементы.Добавить("ИдентификаторДокумента");
		НеВидимыеЭлементы.Добавить("ТиповаяОперация");
		НеВидимыеЭлементы.Добавить("ПоставляемаяТиповаяОперация");
		НеВидимыеЭлементы.Добавить("ПредставлениеОперацииИзФайла");
		
	КонецЕсли;
	
	Для каждого ТекЭлемент Из ВидимыеЭлементы Цикл
	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ТекЭлемент + НомерСтороныСравнения,
			"Видимость", Истина);
	
	КонецЦикла;
	
	Для каждого ТекЭлемент Из НеВидимыеЭлементы Цикл
	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ТекЭлемент + НомерСтороныСравнения,
			"Видимость", Ложь);
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеОперацииДляСравнения(НомерСтороныСравнения)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ИсточникДанных = ЭтотОбъект["ИсточникСравнения" + НомерСтороныСравнения];
	Если ИсточникДанных = "ТиповаяОперация" Тогда
		ДанныеОперации = ОбработкаОбъект.ПолучитьДанныеТиповойОперации(ЭтотОбъект["ТиповаяОперация" + НомерСтороныСравнения]);
	ИначеЕсли ИсточникДанных = "ПоставляемаяТиповаяОперация" Тогда
		ДанныеОперации = ОбработкаОбъект.ПолучитьДанныеПоставляемойТиповойОперации(ЭтотОбъект["ПоставляемаяТиповаяОперация" + НомерСтороныСравнения]);
	ИначеЕсли ИсточникДанных = "ТиповаяОперацияИзФайла" Тогда
		
		ТекстФайла = ПолучитьТекстФайлаОперации(ЭтотОбъект["АдресФайла" + НомерСтороныСравнения]);
		
		ДанныеОперации = ОбработкаОбъект.ПолучитьДанныеОперацииТекстаXML(
			ТекстФайла, ЭтотОбъект["СсылкаОперацииВФайле" + НомерСтороныСравнения]);
	КонецЕсли;
	
	Возврат ДанныеОперации;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекстФайлаОперации(АдресФайла)

	ФайлДанных = ПолучитьИзВременногоХранилища(АдресФайла);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ФайлДанных.Записать(ИмяВременногоФайла);
	
	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(ИмяВременногоФайла);
	ТекстФайла = Текст.ПолучитьТекст();
	
	Текст = Неопределено;
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		// Обработка исключения не требуется. Платформа позже сама удалит файл.
	КонецПопытки;
	
	Возврат ТекстФайла;

КонецФункции

&НаСервереБезКонтекста
Функция ПоставляемаяОперацияТиповойОперации(Знач ТиповаяОперация)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТиповаяОперация, "ПоставляемаяТиповаяОперация");

КонецФункции

&НаКлиенте
Процедура ВыбратьФайлОпераций(НомерСтороныСравнения, ПродолжитьВыборОперации)

	ДополнительныеПараметры = Новый Структура("НомерСтроныСравнения, ПродолжитьВыборОперации",
		НомерСтороныСравнения, ПродолжитьВыборОперации);
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайлаТиповойОперации", ЭтотОбъект, ДополнительныеПараметры);

	НачатьПомещениеФайла(Оповещение, ЭтотОбъект["АдресФайла" + НомерСтороныСравнения], ,
		Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеИмениФайлаНажатие(НомерСтороныСравнения)

	ИсточникДанных = ЭтотОбъект["ИсточникСравнения" + НомерСтороныСравнения];
	Если ИсточникДанных = "ТиповаяОперацияИзФайла" Тогда
		ПродолжитьВыборОперации = Истина;
	ИначеЕсли ИсточникДанных = "Файл" Тогда
		ПродолжитьВыборОперации = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	ВыбратьФайлОпераций(НомерСтороныСравнения, ПродолжитьВыборОперации);

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОперацииИзФайлаНажатие(НомерСтороныСравнения)
	
	Если ЗначениеЗаполнено(ЭтотОбъект["АдресФайла" + НомерСтороныСравнения]) Тогда
		ВыбратьОперациюИзФайла(НомерСтороныСравнения);
	Иначе
		ВыбратьФайлОпераций(НомерСтороныСравнения, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайлаТиповойОперации(ФайлВыбран, Адрес, ПредставлениеИмениВыбранногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ФайлВыбран = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	НомерСтороныСравнения = ДополнительныеПараметры.НомерСтроныСравнения;
	ЭтотОбъект["АдресФайла" + НомерСтороныСравнения] = Адрес;
	ЭтотОбъект["ПредставлениеИмениФайла" + НомерСтороныСравнения] = ПредставлениеИмениВыбранногоФайла;
	
	Если ДополнительныеПараметры.ПродолжитьВыборОперации Тогда
		
		ВыбратьОперациюИзФайла(НомерСтороныСравнения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОперациюИзФайла(НомерСтороныСравнения)
	
	СписокОперацийВФайле = ПолучитьСписокОперацийИзФайла(ЭтотОбъект["АдресФайла" + НомерСтороныСравнения]);
	
	Если СписокОперацийВФайле = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Неизвестная ошибка. Повторно выберите файл операций.'"));
		Возврат;
	ИначеЕсли СписокОперацийВФайле = "Ошибка чтения файла" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Ошибка чтения файла. Повторно выберите файл операций.'"));
		Возврат;
	ИначеЕсли СписокОперацийВФайле = "Не файл поставки" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выбран не файл поставки типовых операций. Повторно выберите файл операций.'"));
		Возврат;
	ИначеЕсли СписокОперацийВФайле = "Версия файла ниже 2" Тогда
		ТекстПредупреждения = НСтр("ru = 'Версия файла поставки типовых операций ниже 2.0.1.1.
			|Сравнение с этой версией поддерживалось в версиях до 2.0.59.20 включительно.
			|С помощью загрузки и повторной выгрузки в указанной версии можно сконвертировать файл в новый формат.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если СписокОперацийВФайле.Количество() = 0 Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Файл не содержит типовых операций'"));
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаОперацииИзФайла = Неопределено;
	СсылкаОперацииВФайле = ЭтотОбъект["СсылкаОперацииВФайле" + НомерСтороныСравнения];
	Если ЗначениеЗаполнено(СсылкаОперацииВФайле) Тогда
		Для каждого ТекЗначениеСписка Из СписокОперацийВФайле Цикл
		
			Если ТекЗначениеСписка.Значение.Ссылка = СсылкаОперацииВФайле Тогда
				ТекущаяСтрокаОперацииИзФайла = ТекЗначениеСписка;
				Прервать;
			КонецЕсли;
		
		КонецЦикла; 
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьОперациюИзФайлаЗавершение", ЭтотОбъект,
		Новый Структура("НомерСтороныСравнения", НомерСтороныСравнения));
	СписокОперацийВФайле.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выберите типовую операцию'"), ТекущаяСтрокаОперацииИзФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОперациюИзФайлаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	НомерСтороныСравнения = ДополнительныеПараметры.НомерСтороныСравнения;
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		
		ЭтотОбъект["СсылкаОперацииВФайле" + НомерСтороныСравнения] = ВыбранныйЭлемент.Значение.ИдентификаторПоддержки;
		ЭтотОбъект["ИдентификаторДокумента" + НомерСтороныСравнения] = ВыбранныйЭлемент.Значение.ИдентификаторДокумента;
		ЭтотОбъект["ПредставлениеОперацииИзФайла" + НомерСтороныСравнения] = ВыбранныйЭлемент.Представление;
		
	Иначе
		
		ЭтотОбъект["СсылкаОперацииВФайле" + НомерСтороныСравнения] = Неопределено;
		ЭтотОбъект["ИдентификаторДокумента" + НомерСтороныСравнения] = Неопределено;
		ЭтотОбъект["ПредставлениеОперацииИзФайла" + НомерСтороныСравнения] = НСтр("ru = 'Выбрать типовую операцию'");
		
	КонецЕсли;
	
	ДругаяСторонаСравнения = ?(НомерСтороныСравнения = "1", "2", "1");
	Если СтрНайти(",ТиповаяОперация,ПоставляемаяТиповаяОперация", "," + ЭтотОбъект["ИсточникСравнения" + ДругаяСторонаСравнения]) > 0
		И Не ЗначениеЗаполнено(ЭтотОбъект[ЭтотОбъект["ИсточникСравнения" + ДругаяСторонаСравнения] + ДругаяСторонаСравнения]) Тогда
		
		ЭтотОбъект["ИдентификаторДокумента" + ДругаяСторонаСравнения] = ЭтотОбъект["ИдентификаторДокумента" + НомерСтороныСравнения];
		
		ИдентификаторПоддержки = Новый УникальныйИдентификатор(ЭтотОбъект["СсылкаОперацииВФайле" + НомерСтороныСравнения]);
		Если ЗначениеЗаполнено(ИдентификаторПоддержки) Тогда
			ЗаполнитьДругуюСторонуПоОперацииИзФайла(ДругаяСторонаСравнения, ИдентификаторПоддержки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДругуюСторонуПоОперацииИзФайла(НомерСтороныСравнения, ИдентификаторПоддержки)
	
	Запрос = Новый Запрос;
	Если ЭтотОбъект["ИсточникСравнения" + НомерСтороныСравнения] = "ТиповаяОперация" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТиповыеОперации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТиповыеОперации КАК ТиповыеОперации
		|ГДЕ
		|	ТиповыеОперации.ИдентификаторПоддержки = &ИдентификаторПоддержки";
	ИначеЕсли ЭтотОбъект["ИсточникСравнения" + НомерСтороныСравнения] = "ПоставляемаяТиповаяОперация" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПоставляемыеТиповыеОперации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПоставляемыеТиповыеОперации КАК ПоставляемыеТиповыеОперации
		|ГДЕ
		|	ПоставляемыеТиповыеОперации.ИдентификаторПоддержки = &ИдентификаторПоддержки";
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ИдентификаторПоддержки", ИдентификаторПоддержки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЭтотОбъект[ЭтотОбъект["ИсточникСравнения" + НомерСтороныСравнения] + НомерСтороныСравнения] = Выборка.Ссылка;
	КонецЕсли;

КонецПроцедуры
 

&НаСервереБезКонтекста
Функция ПолучитьСписокОперацийИзФайла(Знач АдресФайла)
	
	ТекстФайла = ПолучитьТекстФайлаОперации(АдресФайла);
	
	Возврат Обработки.СравнениеТиповыхОпераций.ПолучитьСписокОперацийИзТекстаXML(ТекстФайла);
	
КонецФункции

&НаСервере
Процедура СравнитьВсеСнятыеСПоддержкиНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Результат.Очистить();
	Макет = ОбработкаОбъект.ПолучитьМакет("МакетСравненияОпераций");
	МакетЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Результат.Вывести(МакетЗаголовок);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТиповыеОперации.Ссылка КАК ТиповаяОперация,
	|	ТиповыеОперации.ПоставляемаяТиповаяОперация КАК ПоставляемаяТиповаяОперация
	|ИЗ
	|	Справочник.ТиповыеОперации КАК ТиповыеОперации
	|ГДЕ
	|	ТиповыеОперации.ПоставляемаяТиповаяОперация <> ЗНАЧЕНИЕ(Справочник.ПоставляемыеТиповыеОперации.ПустаяСсылка)
	|	И ТиповыеОперации.СостояниеПоддержки <> ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДанныеОперации1 = ОбработкаОбъект.ПолучитьДанныеТиповойОперации(Выборка.ТиповаяОперация);
		ДанныеОперации2 = ОбработкаОбъект.ПолучитьДанныеПоставляемойТиповойОперации(Выборка.ПоставляемаяТиповаяОперация);
		
		ДанныеСравнения = ОбработкаОбъект.ПолучитьДанныеСравненияТиповыхОпераций(ДанныеОперации1, ДанныеОперации2);
		
		ВывестиДанныеСравненияВМакет(ДанныеСравнения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВидовДокументов()

	ТипыДокументов = Метаданные.ОпределяемыеТипы.РегистраторыРегистраБухгалтерии.Тип.Типы();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка,
	|	ИдентификаторыОбъектовМетаданных.Синоним КАК Синоним
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ИдентификаторыОбъектовМетаданных.ЗначениеПустойСсылки) В (&ТипыДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Синоним";
	Запрос.УстановитьПараметр("ТипыДокументов", ТипыДокументов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Элементы.ИдентификаторДокумента1.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Синоним);
		Элементы.ИдентификаторДокумента2.СписокВыбора.Добавить(Выборка.Ссылка, Выборка.Синоним);
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
