
#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеТокенаДляКлиента(Организация) Экспорт
	
	Возврат РегистрыСведений.НастройкиОбменаФРМО.ДанныеТокенаДляКлиента(Организация);
	
КонецФункции

Функция ПрямойОбменИПС(Организация) Экспорт
	
	Возврат РегистрыСведений.НастройкиОбменаФРМО.ПрямойОбменИПС(Организация);
	
КонецФункции

Функция ВыполнятьОбменНаКлиенте(Организация) Экспорт
	
	Возврат РегистрыСведений.НастройкиОбменаФРМО.ВыполнятьОбменНаКлиенте(Организация);
	
КонецФункции

Функция ДанныеНастройкиПодключения(Организация, Токен) Экспорт
	
	Возврат РегистрыСведений.НастройкиОбменаФРМО.ДанныеНастройкиПодключения(Организация, Токен);
	
КонецФункции

#КонецОбласти
