
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		
		Элементы.Владелец.ТолькоПросмотр = Истина;
		Элементы.ТипЛицевогоСчета.ТолькоПросмотр = Истина;
		
		Если Параметры.Ключ.ОтдельныйСчетГОЗ
			И ЗначениеЗаполнено(Параметры.Ключ.ГосударственныйКонтрактПоГОЗ)
			И ВведеныРеквизитыЛицевыхСчетов(Параметры.Ключ) Тогда
			
			Элементы.ОтдельныйСчетГОЗ.ТолькоПросмотр = Истина;
			Элементы.ГосударственныйКонтрактПоГОЗ.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Объект.ВалютаСчета) Тогда
			Объект.ВалютаСчета = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Владелец) Тогда
			ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации("Руководитель", Объект.Владелец).Свойство("ОтветственноеЛицоСсылка", Объект.ПерваяПодпись);
			ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации("Главный бухгалтер", Объект.Владелец).Свойство("ОтветственноеЛицоСсылка", Объект.ВтораяПодпись);
		КонецЕсли;   
		
		СформироватьТекстОшибки(Объект.Код, Объект.МодульИнтеграции, Объект.Владелец);
		
	КонецЕсли;
	
	ВалютаРегУчета = ОбщегоНазначенияБГУПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	ТипСчетаБанковский = Перечисления.ТипыЛицевыхСчетов.Банковский;
	
	Элементы.ДекорацияКомментарийКТипу.Заголовок = ПолучитьКомментарийКТипу(Объект.ТипЛицевогоСчета, ТипСчетаБанковский);
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Владелец);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	АвтоНаименование = СформироватьАвтоНаименование();
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = АвтоНаименование;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СформироватьТекстОшибки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)  
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства 
	
	Если ИмяСобытия = "Запись_Организации" И Параметр = Объект.Владелец Тогда
		СформироватьТекстОшибки(Объект.Код, Объект.МодульИнтеграции, Объект.Владелец);	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты) 
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
	
	Если ТекущийОбъект.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.ЕБПАУБУ")
		И ОбщегоНазначения.СсылкаСуществует(ТекущийОбъект.Ссылка) Тогда  
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	РазделыЛицевыхСчетов.КодПоступленияЕБП КАК КодПоступленияЕБП
		|ИЗ
		|	Справочник.РазделыЛицевыхСчетов КАК РазделыЛицевыхСчетов
		|ГДЕ
		|	РазделыЛицевыхСчетов.Владелец = &Владелец");  
		Запрос.УстановитьПараметр("Владелец", ТекущийОбъект.Ссылка);
		ВведенныеКоды = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КодПоступленияЕБП"); 
		
		ДействующиеКоды = Перечисления.КодыПоступленийЕБП.ДействующиеКодыПоступлений(ТекущийОбъект.Код);
		
		Для Каждого ДействующийКод Из ДействующиеКоды Цикл
			Если ВведенныеКоды.Найти(ДействующийКод) = Неопределено Тогда 
				НовыйРаздел = Справочники.РазделыЛицевыхСчетов.СоздатьЭлемент();
				НовыйРаздел.Владелец = ТекущийОбъект.Ссылка;
				НовыйРаздел.КодПоступленияЕБП = ДействующийКод;
				НовыйРаздел.Код = Лев(ДействующийКод, 2); 
				НовыйРаздел.Наименование = "(" + НовыйРаздел.Код + ") " + ТекущийОбъект.Наименование;
				НовыйРаздел.Записать();
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом 
	
	СформироватьТекстОшибки();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЛицевогоСчетаПриИзменении(Элемент)
	
	Элементы.ДекорацияКомментарийКТипу.Заголовок = ПолучитьКомментарийКТипу(Объект.ТипЛицевогоСчета, ТипСчетаБанковский);
	ОбновитьНаименование();
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент) 
	Если НЕ Объект.Код = СокрЛП(Объект.Код) Тогда    
		Объект.Код = СокрЛП(Объект.Код);
	КонецЕсли;	
	ОбновитьНаименование(); 
	Если Объект.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.ЕБПАУБУ") Тогда
		Если СтрНайти("80,90,05", Лев(Объект.Код, 2)) = 0 Тогда  
			ТекстСобщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Некорректные параметры интеграции для счета с кодом ""%1"".
			|Код счета должен быть: 80, 90 или 05.
			|Проверьте правильность указания номера счета.'"),  
			Лев(Объект.Код, 2));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСобщения,, "Объект.Код", ); 
		КонецЕсли;  
	КонецЕсли;
	СформироватьТекстОшибки(Объект.Код, Объект.МодульИнтеграции, Объект.Владелец);
КонецПроцедуры

&НаКлиенте
Процедура ОтдельныйСчетГОЗПриИзменении(Элемент)
	
	Если Не Объект.ОтдельныйСчетГОЗ Тогда
		Объект.ГосударственныйКонтрактПоГОЗ = Неопределено;
	КонецЕсли;
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГосударственныйКонтрактПоГОЗПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ОтдельныйСчетКСПриИзменении(Элемент)
	
	Если Не Объект.ОтдельныйСчетГОЗ Тогда
		Объект.ГосударственныйКонтрактПоГОЗ = Неопределено;
	КонецЕсли;
	
	Если Объект.КазначейскоеСопровождениеНаРазделах Тогда
		Объект.КазначейскоеСопровождениеНаРазделах = Ложь;
	КонецЕсли;
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КазаначейскоеСопровождениеПоРазделамПриИзменении(Элемент)
	
	Если Объект.ОтдельныйСчетГОЗ Тогда
		Объект.ОтдельныйСчетГОЗ = Ложь;
		Объект.ГосударственныйКонтрактПоГОЗ = Неопределено;
	КонецЕсли;
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура МодульИнтеграцииПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.МодульИнтеграции) 
		Или Объект.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.НетИнтеграции") Тогда
		Объект.ВидОбмена = Неопределено;
		Объект.НастройкаФорматов = Неопределено;  
	ИначеЕсли Параметры.Ключ.Пустая() 
		И (НЕ ЗначениеЗаполнено(Объект.ВидОбмена) ИЛИ НЕ ЗначениеЗаполнено(Объект.НастройкаФорматов)) Тогда
		ЗаполнитьНастройкиОбмена();
	КонецЕсли;   
	Если Объект.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.ЕБПАУБУ") Тогда 
		Объект.НеВыводитьКодГлавы = Истина;
		Объект.НеВыводитьРазделПодраздел = Истина;
		Объект.НеВыводитьАналитическийКод = Истина;  
		Объект.ИспользоватьДляСчетаУчетныйНомер = Ложь;
		Объект.КодПоРПБС = "";
		Объект.МаксДлинаНазначенияПлатежа = 210;//в форматах обмена ЕБП максимальная длина назначения платежа 210
		Если СтрНайти("80,90,05", Лев(Объект.Код, 2)) = 0 Тогда  
			ТекстСобщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Некорректные параметры интеграции для счета с кодом ""%1"".
			           |Код счета должен быть: 80, 90 или 05.
			           |Проверьте правильность указания номера счета.'"),  
			Лев(Объект.Код, 2));
           	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСобщения,, "Объект.Код", ); 
		КонецЕсли;	
	КонецЕсли;	
	УправлениеЭлементамиФормы(ЭтотОбъект); 
	СформироватьТекстОшибки(Объект.Код, Объект.МодульИнтеграции, Объект.Владелец);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКомментарийКТипу(Знач ТипЛицевогоСчета, Знач ТипБанковский)
	
	Возврат ?(	ТипЛицевогоСчета = ТипБанковский, 
				"Счет открыт в учреждении банка, кредитной организации или на едином казначейском счете", 
				"Лицевой счет открыт в органе казначейства или финансовом органе");
	
КонецФункции	

&НаКлиенте
Функция СформироватьАвтоНаименование()
	
	СтрокаНаименования = СокрЛП(Объект.Код) + ?(Объект.ТипЛицевогоСчета = ТипСчетаБанковский, " (в банке)", " (в казначействе)"); 
	
	Если Элементы.Наименование.СписокВыбора.НайтиПоЗначению(СтрокаНаименования) = Неопределено Тогда
		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	КонецЕсли;
	
	//Если Объект.ОтдельныйСчетГОЗ И ЗначениеЗаполнено(Объект.ГосударственныйКонтрактПоГОЗ) Тогда
	//	СтрокаНаименования = "ГК: " + СтрокаНаименования;
	//	Если Элементы.Наименование.СписокВыбора.НайтиПоЗначению(СтрокаНаименования) = Неопределено Тогда
	//		Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	//	КонецЕсли;
	//КонецЕсли;
	
	Возврат СтрокаНаименования;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНаименование()
	
	Если Объект.Наименование = АвтоНаименование Тогда
		Объект.Наименование = СформироватьАвтоНаименование();
	КонецЕсли;
	
	АвтоНаименование = СформироватьАвтоНаименование();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВведеныРеквизитыЛицевыхСчетов(СпрСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеквизитыЛицевыхСчетов.Ссылка
	|ИЗ
	|	Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	|ГДЕ
	|	РеквизитыЛицевыхСчетов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",СпрСсылка);
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеЭлементамиФормы(Форма)  
	
	// Настройки обмена ЕБП 
	ПоказыватьНастройки = ЗначениеЗаполнено(Форма.Объект.МодульИнтеграции) 
		И НЕ Форма.Объект.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.НетИнтеграции");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ГруппаНастройкиОбмена", "Видимость", ПоказыватьНастройки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "УчетныйНомер", "ТолькоПросмотр", ПоказыватьНастройки);
		
	// Государственные контракты
    //
	ЭтоБанковскийСчет = Форма.Объект.ТипЛицевогоСчета = Форма.ТипСчетаБанковский;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ГруппаБанковскоеСопровождение", "Видимость", ЭтоБанковскийСчет);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ГосударственныйКонтрактПоГОЗ", "Доступность", Форма.Объект.ОтдельныйСчетГОЗ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ГосударственныйКонтрактПоГОЗ", "ОтметкаНезаполненного", Форма.Объект.ОтдельныйСчетГОЗ И ЭтоБанковскийСчет);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ГруппаКазначейскоеСопровождение", "Видимость", НЕ ЭтоБанковскийСчет);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ГосударственныйКонтрактКС", "Доступность", Форма.Объект.ОтдельныйСчетГОЗ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ГосударственныйКонтрактКС", "ОтметкаНезаполненного", Форма.Объект.ОтдельныйСчетГОЗ И НЕ ЭтоБанковскийСчет);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиОбмена() 
	
	Если НЕ ЗначениеЗаполнено(Объект.ВидОбмена) Тогда
		Объект.ВидОбмена = Справочники.ТипыОбменаБанкиКС.НайтиПоРеквизиту("ПредставлениеВНомереВерсии", "EBP");
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.ВидОбмена) И НЕ ЗначениеЗаполнено(Объект.НастройкаФорматов) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаФорматовОбменаБанкиКС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НастройкаФорматовОбменаБанкиКС КАК НастройкаФорматовОбменаБанкиКС
		|ГДЕ
		|	НастройкаФорматовОбменаБанкиКС.Владелец = &Владелец
		|	И НастройкаФорматовОбменаБанкиКС.ПометкаУдаления = ЛОЖЬ";
		Запрос.УстановитьПараметр("Владелец", Объект.ВидОбмена);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Объект.НастройкаФорматов = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТекстОшибки(НомерЛС = Неопределено, МодульИнтеграции = Неопределено, Организация = Неопределено)
	Элементы.ТекстОшибки.Видимость = НЕ Справочники.ЛицевыеСчета.НомерЛицевогоСчетаКорректен(Объект.Ссылка, ТекстОшибки, НомерЛС, МодульИнтеграции, Организация);
	Элементы.ТекстОшибки.Подсказка = ТекстОшибки;
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти
