#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Метаданные.Справочники.ВидыДоходовКДБ.СтандартныеРеквизиты.Код.Имя);
	Результат.Добавить(Метаданные.Справочники.ВидыДоходовКДБ.СтандартныеРеквизиты.Родитель.Имя);
	Результат.Добавить(Метаданные.Справочники.ВидыДоходовКДБ.Реквизиты.Группа.Имя);
	Результат.Добавить(Метаданные.Справочники.ВидыДоходовКДБ.Реквизиты.Подгруппа.Имя);
	Результат.Добавить(Метаданные.Справочники.ВидыДоходовКДБ.Реквизиты.Статья.Имя);
	Результат.Добавить(Метаданные.Справочники.ВидыДоходовКДБ.Реквизиты.Подстатья.Имя);
	Результат.Добавить(Метаданные.Справочники.ВидыДоходовКДБ.Реквизиты.Элемент.Имя);
	Результат.Добавить(Метаданные.Справочники.ВидыДоходовКДБ.ТабличныеЧасти.АналитическиеГруппы.Имя);
	
	БюджетнаяКлассификацияПереопределяемый.ПолучитьБлокируемыеРеквизитыОбъекта(Результат);

	Возврат Результат;
	
КонецФункции

Функция НайтиПоКодуДействующийНаДату(Код, ДатаНачалаДействия, ДатаОкончанияДействия, ИсключитьСсылку = Неопределено) Экспорт 
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыДоходовКДБ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
	|ГДЕ
	|	ВидыДоходовКДБ.Код = &Код
	|	И ВидыДоходовКДБ.ДатаОкончанияДействия >= &ДатаОкончанияДействия
	|	И ВидыДоходовКДБ.ДатаНачалаДействия <= &ДатаНачалаДействия
	|	И НЕ ВидыДоходовКДБ.Ссылка = &ИсключитьСсылку");
	
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("ДатаОкончанияДействия", ?(ДатаОкончанияДействия = Дата(1,1,1), Дата(2999, 1, 1), ДатаОкончанияДействия));
	Запрос.УстановитьПараметр("ДатаНачалаДействия", ДатаНачалаДействия);
	Запрос.УстановитьПараметр("ИсключитьСсылку", ИсключитьСсылку);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ВидыДоходовКДБ.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции	

// Выполняет поиск фрагмента кода по всем справочникам классификации.
//
// Параметры
//  Код			 	- Код или фрагмент кода классификатора
//                 
//  СтруктураДанных - Возвращаемое значение.
//                    Уточнение поиска. Имеет свойства Ссылка,Группа,Статья,ГруппаПодвида
//                    где Ссылка - найденный элемент, остальные свойства - ссылки на компоненты кода.
//					  Если передана структура с ключем "ГруппаПодвида" будет сделана попытка определить ссылку на
//					  элемент соответствующего справочника	
//
// Возвращаемое значение:
//   Ссылка или Неопределено
//
Функция НайтиВКлассификации(Код, СтруктураДанных = Неопределено, Бюджет = Неопределено, ДатаАктуальности = Неопределено) Экспорт
	
	Если ТипЗнч(СтруктураДанных) = Тип("Структура") Тогда
		СтруктураДанных.Вставить("Ссылка");
		СтруктураДанных.Вставить("ВидДохода");
		СтруктураДанных.Вставить("КОСГУ");
	Иначе
		СтруктураДанных = Новый Структура("Ссылка, ВидДохода, КОСГУ");
	КонецЕсли;	
	
	КодГруппы  		= СтрЗаменить(Сред(Код, 1,  4), " ", "");
	КодСтатьи  		= ?(ПустаяСтрока(Сред(Код, 6,  5)), "00000", Сред(Код, 6,  5));
	КодЭлемента     = ?(ПустаяСтрока(Сред(Код, 12, 2)), "00", Сред(Код, 12, 2));
	КодПодвида      = ?(ПустаяСтрока(Сред(Код, 15, 4)), "0000", Сред(Код, 15, 4));
	КодКОСГУ   		= Сред(Код, 20, 3);
	
	
	Если Не ПустаяСтрока(КодГруппы) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Спр.Ссылка
		|ИЗ
		|	Справочник.ВидыДоходовКДБ КАК Спр
		|ГДЕ
		|	Спр.Наименование ПОДОБНО &ПодобиеКода";
		
		ПодобиеКода = КодГруппы;
		
		Если НЕ КодЭлемента = "00" Тогда
			ПодобиеКода = ПодобиеКода + КодСтатьи + КодЭлемента;
		ИначеЕсли НЕ КодСтатьи = "00000" Тогда
			ПодобиеКода = ПодобиеКода + КодСтатьи;
		КонецЕсли;	
			
		Если ЗначениеЗаполнено(ДатаАктуальности) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И Спр.ДатаНачалаДействия <= &ДатаАктуальности
			|	И Спр.ДатаОкончанияДействия >= &ДатаАктуальности";
			
			Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ПодобиеКода", ПодобиеКода + "%");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтруктураДанных.ВидДохода = Выборка.Ссылка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(КодКОСГУ) И НЕ КодКОСГУ = "000" Тогда
			
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВидыДоходовКДБАналитическиеГруппы.АналитическаяГруппа КАК КОСГУ
			|ИЗ
			|	Справочник.ВидыДоходовКДБ.АналитическиеГруппы КАК ВидыДоходовКДБАналитическиеГруппы
			|ГДЕ
			|	ВидыДоходовКДБАналитическиеГруппы.Ссылка = &Ссылка
			|	И ВидыДоходовКДБАналитическиеГруппы.АналитическаяГруппа.Код ПОДОБНО &КодКОСГУ");
			
			Запрос.УстановитьПараметр("Ссылка",  СтруктураДанных.ВидДохода);
			Запрос.УстановитьПараметр("КодКОСГУ", СокрЛП(КодКОСГУ) + "%");
			
			
			Выборка = Запрос.Выполнить().Выбрать(); 
			
			Если Выборка.Следующий() Тогда
				СтруктураДанных.КОСГУ = Выборка.КОСГУ;
			Иначе
				Возврат Неопределено;
			КонецЕсли;
			
		КонецЕсли;
			
		СтруктураДанных.Ссылка = СтруктураДанных.ВидДохода;
		
		Если СтруктураДанных.Свойство("ГруппаПодвида") Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ГруппыПодвидовКДБ.Ссылка,
			|	ВЫБОР
			|		КОГДА ГруппыПодвидовКДБ.ВидДохода = &ВидДохода
			|				И ГруппыПодвидовКДБ.Бюджет = &Бюджет
			|			ТОГДА 3
			|		КОГДА ГруппыПодвидовКДБ.ВидДохода = &ВидДохода
			|			ТОГДА 2
			|		КОГДА ГруппыПодвидовКДБ.Бюджет = &Бюджет
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Приоритет
			|ИЗ
			|	Справочник.ГруппыПодвидовКДБ КАК ГруппыПодвидовКДБ
			|ГДЕ
			|	ГруппыПодвидовКДБ.Код ПОДОБНО &Код
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет УБЫВ");
			
			Запрос.УстановитьПараметр("Код", СокрЛП(КодПодвида) + "%");
			Запрос.УстановитьПараметр("ВидДохода", СтруктураДанных.ВидДохода);
			Запрос.УстановитьПараметр("Бюджет", Бюджет);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				СтруктураДанных.ГруппаПодвида = Выборка.Ссылка;
				
			КонецЕсли;	
			
		КонецЕсли;	
			
		Возврат СтруктураДанных.Ссылка;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;

КонецФункции // НайтиВКлассификации()

// Создает временную таблицу данных бюджетного классификатора для использования при загрузке или обновлении.
// Поля выборки
//			Ссылка
//			Код
//			Наименование
//			НомерСтроки
//			Бюджет
//			ДатаНачалаДействия
//			ДатаОкончанияДействия
//			ЕстьПериод
//
Процедура ПолучитьВременнуюТаблицуДанныхИБ(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ВидыДоходовКДБ.Ссылка КАК Ссылка,
	|	ВидыДоходовКДБ.Наименование КАК Код,
	|	ВидыДоходовКДБ.НаименованиеПолное КАК Наименование,
	|	0 КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Бюджет,
	|	ВидыДоходовКДБ.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ВидыДоходовКДБ.ОкончаниеДействия КАК ДатаОкончанияДействия,
	|	ИСТИНА КАК ЕстьПериод,
	|	1 КАК Порядок
	|ИЗ
	|	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
	|ГДЕ
	|	НЕ ВидыДоходовКДБ.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ГруппыПодвидовКДБ.Ссылка,
	|	ГруппыПодвидовКДБ.Наименование,
	|	ГруппыПодвидовКДБ.НаименованиеПолное,
	|	0,
	|	ГруппыПодвидовКДБ.Бюджет,
	|	ВЫБОР
	|		КОГДА ГруппыПодвидовКДБ.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовКДБ.ПустаяСсылка)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ГруппыПодвидовКДБ.ВидДохода.ДатаНачалаДействия
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ГруппыПодвидовКДБ.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовКДБ.ПустаяСсылка)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ГруппыПодвидовКДБ.ВидДохода.ОкончаниеДействия
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	2
	|ИЗ
	|	Справочник.ГруппыПодвидовКДБ КАК ГруппыПодвидовКДБ
	|ГДЕ
	|	НЕ ГруппыПодвидовКДБ.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыДоходовКДБАналитическиеГруппы.Ссылка КАК Ссылка,
	|	ПОДСТРОКА(ВидыДоходовКДБАналитическиеГруппы.Ссылка.Наименование, 1, 14) + ВидыДоходовКДБАналитическиеГруппы.АналитическаяГруппа.Код КАК Код,
	|	ВидыДоходовКДБАналитическиеГруппы.Наименование КАК Наименование,
	|	ВидыДоходовКДБАналитическиеГруппы.НомерСтроки КАК НомерСтроки,
	|	НЕОПРЕДЕЛЕНО КАК Бюджет,
	|	ВидыДоходовКДБАналитическиеГруппы.Ссылка.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ВидыДоходовКДБАналитическиеГруппы.Ссылка.ОкончаниеДействия КАК ДатаОкончанияДействия,
	|	ИСТИНА КАК ЕстьПериод,
	|	1 КАК Порядок
	|ИЗ
	|	Справочник.ВидыДоходовКДБ.АналитическиеГруппы КАК ВидыДоходовКДБАналитическиеГруппы
	|ГДЕ
	|	НЕ ВидыДоходовКДБАналитическиеГруппы.Ссылка.ПометкаУдаления");
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТабДанных = Результат[0].Выгрузить();
	
	ТабКОСГУ = Результат[1].Выгрузить();
	ТабКОСГУ.Индексы.Добавить("Ссылка");
	КоличествоЗаписей = ТабДанных.Количество() - 1;
	
	Для Инд = 0 По КоличествоЗаписей Цикл
		
		Стр = ТабДанных[Инд];
		
		Если Стр.Порядок = 2 Тогда
			Продолжить;
		КонецЕсли;	
		
		АналитическиеГруппы = ТабКОСГУ.НайтиСтроки(Новый Структура("Ссылка", Стр.Ссылка)); 
		
		Если АналитическиеГруппы.Количество() = 1 И НЕ ЗначениеЗаполнено(Стр.Наименование) Тогда
			ЗаполнитьЗначенияСвойств(Стр, АналитическиеГруппы[0]);
		Иначе
			Для Каждого СтрКОСГУ Из АналитическиеГруппы Цикл
				СтрДоб = ТабДанных.Добавить();
				ЗаполнитьЗначенияСвойств(СтрДоб, СтрКОСГУ);
			КонецЦикла;	
		КонецЕсли;
		
	КонецЦикла;	
	
	ТабДанных.Сортировать("Порядок, Код");
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ВидыДоходовКДБ.Ссылка 					КАК Ссылка,
	|	ВидыДоходовКДБ.Код 						КАК Код,
	|	ВидыДоходовКДБ.Наименование 			КАК Наименование,
	|	ВЫБОР
	|		КОГДА ВидыДоходовКДБ.НомерСтроки = 0
	|			ТОГДА NULL
	|		ИНАЧЕ ВидыДоходовКДБ.НомерСтроки
	|	КОНЕЦ 									КАК НомерСтроки,
	|	ВидыДоходовКДБ.Бюджет 					КАК Бюджет,
	|	ВидыДоходовКДБ.ДатаНачалаДействия 		КАК ДатаНачалаДействия,
	|	ВидыДоходовКДБ.ДатаОкончанияДействия 	КАК ДатаОкончанияДействия,
	|	ВидыДоходовКДБ.ЕстьПериод 				КАК ЕстьПериод
	|ПОМЕСТИТЬ ДанныеИБ
	|ИЗ
	|	&ВидыДоходовКДБ КАК ВидыДоходовКДБ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Код,
	|	Бюджет,
	|	ДатаНачалаДействия,
	|	ДатаОкончанияДействия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Модификация таблицы данных файла.
	|// Для загрузки групп подвидов надо из кода в файле убрать аналитический код
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеФайла.Бюджет КАК Бюджет,
	|	ВЫБОР
	|		КОГДА ДанныеФайла.Бюджет = НЕОПРЕДЕЛЕНО
	|			ТОГДА ДанныеФайла.Код
	|		ИНАЧЕ ПОДСТРОКА(ДанныеФайла.Код, 1, 14) + ""000""
	|	КОНЕЦ КАК Код,
	|	ВЫБОР
	|		КОГДА ДанныеФайла.Бюджет = НЕОПРЕДЕЛЕНО
	|			ТОГДА ДанныеФайла.КодРодителя
	|		ИНАЧЕ ПОДСТРОКА(ДанныеФайла.КодРодителя, 1, 14) + ""000""
	|	КОНЕЦ КАК КодРодителя,
	|	ДанныеФайла.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ДанныеФайла.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ДанныеФайла.Наименование КАК Наименование,
	|	ДанныеФайла.Уровень КАК Уровень
	|ПОМЕСТИТЬ ДанныеФайлаПредв
	|ИЗ
	|	ДанныеФайла КАК ДанныеФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеФайла.Бюджет КАК Бюджет,
	|	ДанныеФайла.Код,
	|	ДанныеФайла.КодРодителя,
	|	ДанныеФайла.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ДанныеФайла.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ДанныеФайла.Наименование КАК Наименование,
	|	ДанныеФайла.Уровень КАК Уровень
	|ПОМЕСТИТЬ ДанныеФайла	
	|ИЗ
	|	ДанныеФайлаПредв КАК ДанныеФайла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеФайлаПредв");

	Запрос.УстановитьПараметр("ВидыДоходовКДБ", ТабДанных);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры	

// Заполняет дерево значений классификатора доходов.
// Параметры
//	Дерево - дерево значений с колонками: Ссылка, ПометкаУдаления, ЕстьПодчиненныеСтроки, Код, Наименование, ДатаНачалаДействия, ОкончаниеДействия, ИндексКартинки, СсылкаКОСГУ, Уровень
//	НаДату - Дата на которую надо заполнить классификатор, или Неопределено
//
Процедура ЗаполнитьДеревоКлассификатораДоходов(Дерево, НаДату = Неопределено) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	БюджетнаяКлассификацияПереопределяемый.ЗаполнитьДеревоКлассификатораДоходовНачало(Дерево,НаДату,СтандартнаяОбработка);
	
	Если СтандартнаяОбработка = Ложь Тогда		
		Возврат;
	КонецЕсли;
	
	//Внимание! Дерево классификатора используется при расчете группировочных итогов для рег. форм отчетности.
	//Необходимо учитывать при внесении изменений в структуру дерева. 
	//Не менять существующие колонки: Ссылка, Наименование, СсылкаКОСГУ, Уровень.
	
	Дерево.Строки.Очистить();
	
	Запрос = Новый Запрос;
	СхемаЗапроса = Новый СхемаЗапроса;
	
	СхемаЗапроса.УстановитьТекстЗапроса( 
	"ВЫБРАТЬ
	|	ПОДСТРОКА(ВидыДоходовКДБ.Наименование, 1, 1) + "" "" + ПОДСТРОКА(ВидыДоходовКДБ.Наименование, 2, 2) + "" "" + ПОДСТРОКА(ВидыДоходовКДБ.Наименование, 4, 5) + "" "" + ПОДСТРОКА(ВидыДоходовКДБ.Наименование, 9, 2) + "" "" + ПОДСТРОКА(ВидыДоходовКДБ.Наименование, 11, 4) + "" "" + ПОДСТРОКА(ВидыДоходовКДБ.Наименование, 15, 3) КАК Код,
	|	ВидыДоходовКДБ.Ссылка КАК Ссылка,
	|	ВидыДоходовКДБ.Код КАК КодВД,
	|	ВидыДоходовКДБ.НаименованиеПолное КАК Наименование,
	|	ВидыДоходовКДБ.ПометкаУдаления,
	|	ВидыДоходовКДБ.ДатаНачалаДействия,
	|	ВидыДоходовКДБ.ДатаОкончанияДействия,
	|	ВидыДоходовКДБ.ОкончаниеДействия,
	|	ВЫБОР
	|		КОГДА ВидыДоходовКДБ.ПометкаУдаления
	|			ТОГДА 3
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинки,
	|	ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка) КАК СсылкаКОСГУ,
	|	ВидыДоходовКДБ.Родитель КАК Родитель
	|ИЗ
	|	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыДоходовКДБ.Код,
	|	Ссылка ИЕРАРХИЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыДоходовКДБАналитическиеГруппы.Ссылка КАК ВидДохода,
	|	ВидыДоходовКДБАналитическиеГруппы.АналитическаяГруппа КАК СсылкаКОСГУ,
	|	ВидыДоходовКДБАналитическиеГруппы.Наименование,
	|	ВидыДоходовКДБАналитическиеГруппы.АналитическаяГруппа.Код КАК КодКЭК,
	|	ВидыДоходовКДБАналитическиеГруппы.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник.ВидыДоходовКДБ.АналитическиеГруппы КАК ВидыДоходовКДБАналитическиеГруппы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидДохода,
	|	НомерСтроки");
		
	Если ЗначениеЗаполнено(НаДату) Тогда
		ОтборЗапроса 		= СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
		
		ОтборЗапроса.Добавить("ВидыДоходовКДБ.ДатаНачалаДействия <= &ДатаАктуальности");
		ОтборЗапроса.Добавить("ВидыДоходовКДБ.ДатаОкончанияДействия >= &ДатаАктуальности");
		
		ОтборЗапроса 		= СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Отбор;
		ОтборЗапроса.Добавить("ВидыДоходовКДБАналитическиеГруппы.Ссылка.ДатаНачалаДействия <= &ДатаАктуальности");
		ОтборЗапроса.Добавить("ВидыДоходовКДБАналитическиеГруппы.Ссылка.ДатаОкончанияДействия >= &ДатаАктуальности");
		
		Запрос.УстановитьПараметр("ДатаАктуальности", НаДату);
	КонецЕсли;
		
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	КорневаяСтрока = Дерево.Строки.Добавить();
	КорневаяСтрока.Код 						= "Виды доходов бюджетов";
	КорневаяСтрока.ИндексКартинки        	= 2;
	Если Дерево.Колонки.Найти("ЕстьПодчиненныеСтроки") <> Неопределено Тогда
		КорневаяСтрока.ЕстьПодчиненныеСтроки 	= Истина;
	КонецЕсли;
	
	Результаты = Запрос.ВыполнитьПакет(); 
	
	Выборка = Результаты[0].Выбрать();
	
	ТаблицаАнГрупп = Результаты[1].Выгрузить();
	ТаблицаАнГрупп.Индексы.Добавить("ВидДохода");
	
	ТаблицаПоиска = Новый ТаблицаЗначений;
	ТаблицаПоиска.Колонки.Добавить("ВидДохода");
	ТаблицаПоиска.Колонки.Добавить("Код");
	ТаблицаПоиска.Колонки.Добавить("СтрокаДерева");
	
	ТаблицаПоиска.Индексы.Добавить("ВидДохода,Код");
	ТаблицаПоиска.Индексы.Добавить("СтрокаДерева");
	
	МассивСтрокДляПостОбработки = Новый Массив;
	
	СоответствиеСтрокДереваВД = Новый Соответствие;
	
	СоответствиеСтрокДереваВД.Вставить(Справочники.ВидыДоходовКДБ.ПустаяСсылка(),КорневаяСтрока);
	
	Пока Выборка.Следующий() Цикл
			
		СтруктураПустогоКЭК = Новый Структура("КодКЭК","000");
		
		СтрокаРодителя = СоответствиеСтрокДереваВД[Выборка.Родитель];
		
		Если СтрокаРодителя = Неопределено Тогда
			//ошибка в классификаторе, выведем такие строки в корень
			СтрокаРодителя = КорневаяСтрока;
		КонецЕсли;
				
		СтрокаДерева = СтрокаРодителя.Строки.Добавить();
		СтрокаДерева.Уровень = СтрокаДерева.Уровень();
		
		ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтруктураПустогоКЭК);
		
		СоответствиеСтрокДереваВД.Вставить(Выборка.Ссылка,СтрокаДерева);
		
		ДобавитьСтрокуТаблицыПоиска(ТаблицаПоиска,СтрокаДерева);
		
		ЗаполнитьДетальныеЗаписи(Выборка, СтрокаДерева, ТаблицаАнГрупп,ТаблицаПоиска,МассивСтрокДляПостОбработки);
						
	КонецЦикла;
		
	Для Инд = -(МассивСтрокДляПостОбработки.Количество()-1) По 0 Цикл
		ТекИнд = -Инд;
		Если ЕстьЗначимыеСтроки(МассивСтрокДляПостОбработки[ТекИнд]) = Ложь Тогда
			ТекРодитель = МассивСтрокДляПостОбработки[ТекИнд].Родитель;
			Если ТекРодитель = Неопределено Тогда
				ТекРодитель = Дерево;
			КонецЕсли;
			ТекРодитель.Строки.Удалить(МассивСтрокДляПостОбработки[ТекИнд]);
		КонецЕсли;		
	КонецЦикла;
	
	БюджетнаяКлассификацияПереопределяемый.ЗаполнитьДеревоКлассификатораДоходовКонец(Дерево,НаДату);
	
КонецПроцедуры

Процедура ЗаполнитьДеревоКлассификатораДоходовДляФормы(Дерево, НаДату = Неопределено,ВидДоходаДляРазворачивания=Неопределено,ВидДоходаДляПоиска=Неопределено) Экспорт
		
	Дерево.Строки.Очистить();
	
	ЗапросПолученияВидовДоходов = Новый Запрос;
	Если ЗначениеЗаполнено(ВидДоходаДляРазворачивания) Тогда
		ЗапросПолученияВидовДоходов.УстановитьПараметр("ВидДохода",ВидДоходаДляРазворачивания);
	Иначе
		ЗапросПолученияВидовДоходов.УстановитьПараметр("ВидДохода",Справочники.ВидыДоходовКДБ.ПустаяСсылка());//для получения первого уровня
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидДоходаДляПоиска) Тогда
		//запрос с отбором по ссылке нужен для кодов, по которым возможна иерархия ан. групп - 190 ->191, 192, 193...
		ЗапросПолученияВидовДоходов.Текст = 
			"ВЫБРАТЬ
		    |	ВидыДоходовКДБ.Ссылка КАК Ссылка
		    |ИЗ
		    |	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
		    |ГДЕ
		    |	ВидыДоходовКДБ.Родитель = &ВидДохода
		    |
		    |ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
		    |	ВидыДоходовКДБ.Ссылка КАК Ссылка
		    |ИЗ
		    |	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
		    |ГДЕ
		    |	ВидыДоходовКДБ.Ссылка = &ВидДохода
		    |
			|ОБЪЕДИНИТЬ ВСЕ
			|
		    |ВЫБРАТЬ
		    |	ВидыДоходовКДБ.Ссылка
		    |ИЗ
		    |	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
		    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБРодитель
		    |		ПО ВидыДоходовКДБ.Родитель = ВидыДоходовКДБРодитель.Ссылка
		    |ГДЕ
		    |	ВидыДоходовКДБРодитель.Родитель = &ВидДохода
		    |ИТОГИ ПО
		    |	Ссылка ИЕРАРХИЯ";
		
	Иначе
		//получим полную иерархию искомого элемента
		ЗапросПолученияВидовДоходов.Текст = 
			"ВЫБРАТЬ
		    |	ВидыДоходовКДБ.Ссылка КАК Ссылка
		    |ИЗ
		    |	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
		    |ГДЕ
		    |	ВидыДоходовКДБ.Ссылка = &ВидДоходаДляПоиска
		    |
		    |ИТОГИ ПО
		    |	Ссылка ИЕРАРХИЯ";
			
		ЗапросПолученияВидовДоходов.УстановитьПараметр("ВидДоходаДляПоиска",ВидДоходаДляПоиска);
		Результат = ЗапросПолученияВидовДоходов.Выполнить();	
		Таб = Результат.Выгрузить();
		Таб.Свернуть("Ссылка");
		МассивВидовДоходов = Таб.ВыгрузитьКолонку("Ссылка");
		
		//получим ссылки на те элементы, которые входят в группы полученных ранее элементов
		ЗапросПолученияВидовДоходов.УстановитьПараметр("МассивВидовДоходов",МассивВидовДоходов);
		ЗапросПолученияВидовДоходов.Текст = 
			"ВЫБРАТЬ
			|	ВидыДоходовКДБ.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
			|ГДЕ
			|	ВидыДоходовКДБ.Ссылка В(&МассивВидовДоходов)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВидыДоходовКДБ.Ссылка
			|ИЗ
			|	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
			|ГДЕ
			|	ВидыДоходовКДБ.Родитель В(&МассивВидовДоходов)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВидыДоходовКДБ.Ссылка
			|ИЗ
			|	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
			|ГДЕ
			|	ВидыДоходовКДБ.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыДоходовКДБ.ПустаяСсылка)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВидыДоходовКДБ.Ссылка
			|ИЗ
			|	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБРодитель
			|		ПО ВидыДоходовКДБ.Родитель = ВидыДоходовКДБРодитель.Ссылка
			|ГДЕ
			|	ВидыДоходовКДБРодитель.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыДоходовКДБ.ПустаяСсылка)";
		
	КонецЕсли;
	
	Результат = ЗапросПолученияВидовДоходов.Выполнить();	
	Таб = Результат.Выгрузить();
	Таб.Свернуть("Ссылка");
	МассивВидовДоходов = Таб.ВыгрузитьКолонку("Ссылка");
	
	Запрос = Новый Запрос;
	СхемаЗапроса = Новый СхемаЗапроса;
		
	СхемаЗапроса.УстановитьТекстЗапроса( 
	"ВЫБРАТЬ
	|	ПОДСТРОКА(ВидыДоходовКДБ.Наименование, 1, 1) + "" "" + ПОДСТРОКА(ВидыДоходовКДБ.Наименование, 2, 2) + "" "" + ПОДСТРОКА(ВидыДоходовКДБ.Наименование, 4, 5) + "" "" + ПОДСТРОКА(ВидыДоходовКДБ.Наименование, 9, 2) + "" "" + ПОДСТРОКА(ВидыДоходовКДБ.Наименование, 11, 4) + "" "" + ПОДСТРОКА(ВидыДоходовКДБ.Наименование, 15, 3) КАК Код,
	|	ВидыДоходовКДБ.Ссылка КАК Ссылка,
	|	ВидыДоходовКДБ.Код КАК КодВД,
	|	ВидыДоходовКДБ.НаименованиеПолное КАК Наименование,
	|	ВидыДоходовКДБ.ПометкаУдаления КАК ПометкаУдаления,
	|	ВидыДоходовКДБ.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	ВидыДоходовКДБ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	ВидыДоходовКДБ.ОкончаниеДействия КАК ОкончаниеДействия,
	|	ВЫБОР
	|		КОГДА ВидыДоходовКДБ.ПометкаУдаления
	|			ТОГДА 3
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинки,
	|	ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка) КАК СсылкаКОСГУ,
	|	ВидыДоходовКДБ.Родитель КАК Родитель
	|ИЗ
	|	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
	|ГДЕ
	|	ВидыДоходовКДБ.Ссылка В (&ВидыДохода)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыДоходовКДБ.Код,
	|	Ссылка ИЕРАРХИЯ
	|");
		
	Если ЗначениеЗаполнено(НаДату) Тогда
		ОтборЗапроса 		= СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
		
		ОтборЗапроса.Добавить("ВидыДоходовКДБ.ДатаНачалаДействия <= &ДатаАктуальности");
		ОтборЗапроса.Добавить("ВидыДоходовКДБ.ДатаОкончанияДействия >= &ДатаАктуальности");
		
		Запрос.УстановитьПараметр("ДатаАктуальности", НаДату);
	КонецЕсли;
	Запрос.УстановитьПараметр("ВидыДохода",МассивВидовДоходов);
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	КорневаяСтрока = Дерево.Строки.Добавить();
	КорневаяСтрока.Код 						= "Виды доходов бюджетов";
	КорневаяСтрока.ИндексКартинки        	= 2;
	Если Дерево.Колонки.Найти("ЕстьПодчиненныеСтроки") <> Неопределено Тогда
		КорневаяСтрока.ЕстьПодчиненныеСтроки 	= Истина;
	КонецЕсли;
	
	Результат = Запрос.Выполнить(); 
		
	Выборка = Результат.Выбрать();
	
	ЗапросАнГрупп = Новый Запрос;
	ЗапросАнГрупп.УстановитьПараметр("ВидыДохода",МассивВидовДоходов);
	ЗапросАнГрупп.УстановитьПараметр("ДатаАктуальности", НаДату);
	ЗапросАнГрупп.Текст = "
	|ВЫБРАТЬ
	|	ВидыДоходовКДБАналитическиеГруппы.Ссылка КАК ВидДохода,
	|	ВидыДоходовКДБАналитическиеГруппы.АналитическаяГруппа КАК СсылкаКОСГУ,
	|	ВидыДоходовКДБАналитическиеГруппы.Наименование КАК Наименование,
	|	ВидыДоходовКДБАналитическиеГруппы.АналитическаяГруппа.Код КАК КодКЭК,
	|	ВидыДоходовКДБАналитическиеГруппы.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник.ВидыДоходовКДБ.АналитическиеГруппы КАК ВидыДоходовКДБАналитическиеГруппы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
	|		ПО ВидыДоходовКДБАналитическиеГруппы.Ссылка = ВидыДоходовКДБ.Ссылка
	|ГДЕ
	|	ВидыДоходовКДБ.Ссылка В (&ВидыДохода)
	|	И ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидДохода,
	|	НомерСтроки";
	
	Если ЗначениеЗаполнено(НаДату) Тогда
		
		Условие = "ВидыДоходовКДБ.ДатаНачалаДействия <= &ДатаАктуальности 
			| И ВидыДоходовКДБ.ДатаОкончанияДействия >= &ДатаАктуальности";
		
		ЗапросАнГрупп.Текст = СтрЗаменить(ЗапросАнГрупп.Текст,"ИСТИНА", Условие);
		
	КонецЕсли;
	
	ТаблицаАнГрупп = ЗапросАнГрупп.Выполнить().Выгрузить();
	ТаблицаАнГрупп.Индексы.Добавить("ВидДохода");
	
	ТаблицаПоиска = Новый ТаблицаЗначений;
	ТаблицаПоиска.Колонки.Добавить("ВидДохода");
	ТаблицаПоиска.Колонки.Добавить("Код");
	ТаблицаПоиска.Колонки.Добавить("СтрокаДерева");
	
	ТаблицаПоиска.Индексы.Добавить("ВидДохода,Код");
	ТаблицаПоиска.Индексы.Добавить("СтрокаДерева");
	
	МассивСтрокДляПостОбработки = Новый Массив;
	
	СоответствиеСтрокДереваВД = Новый Соответствие;
	
	СоответствиеСтрокДереваВД.Вставить(Справочники.ВидыДоходовКДБ.ПустаяСсылка(),КорневаяСтрока);
	
	Пока Выборка.Следующий() Цикл
			
		СтруктураПустогоКЭК = Новый Структура("КодКЭК","000");
		СтрокаРодителя = СоответствиеСтрокДереваВД[Выборка.Родитель];
		
		Если СтрокаРодителя = Неопределено Тогда
			//ошибка в классификаторе, выведем такие строки в корень
			СтрокаРодителя = КорневаяСтрока;
		КонецЕсли;
				
		СтрокаДерева = СтрокаРодителя.Строки.Добавить();
		СтрокаДерева.Уровень = СтрокаДерева.Уровень();
		
		ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтруктураПустогоКЭК);
		
		СоответствиеСтрокДереваВД.Вставить(Выборка.Ссылка,СтрокаДерева);
		
		ДобавитьСтрокуТаблицыПоиска(ТаблицаПоиска,СтрокаДерева);
		
		ЗаполнитьДетальныеЗаписи(Выборка,СтрокаДерева, ТаблицаАнГрупп,ТаблицаПоиска,МассивСтрокДляПостОбработки);
						
	КонецЦикла;
	
	Для Инд = -(МассивСтрокДляПостОбработки.Количество()-1) По 0 Цикл
		ТекИнд = -Инд;
		Если ЕстьЗначимыеСтроки(МассивСтрокДляПостОбработки[ТекИнд]) = Ложь Тогда
			ТекРодитель = МассивСтрокДляПостОбработки[ТекИнд].Родитель;
			Если ТекРодитель = Неопределено Тогда
				ТекРодитель = Дерево;
			КонецЕсли;
			ТекРодитель.Строки.Удалить(МассивСтрокДляПостОбработки[ТекИнд]);
		КонецЕсли;		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	БюджетнаяКлассификация.ОбработкаПолученияДанныхВыбораБюджетнойКлассификации(ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Служебные процедуры и функции формирования Дерева

// Заполняет строки в дереве данными по аналитическим группам
//
Процедура ЗаполнитьДетальныеЗаписи(ДетальныеЗаписи,СтрокаДерева, ТаблицаАнГрупп,ТаблицаПоиска,МассивСтрокДляПостОбработки)
	
	АнГруппыМассив = ТаблицаАнГрупп.НайтиСтроки(Новый Структура("ВидДохода",ДетальныеЗаписи.Ссылка));
		
	Если АнГруппыМассив.Количество() > 0 Тогда
		Если АнГруппыМассив.Количество() = 1 
			И НЕ ЗначениеЗаполнено(ДетальныеЗаписи.Наименование) Тогда
			
			Стр = АнГруппыМассив[0];
			ТекРодитель = СтрокаДерева.Родитель;
			
			КодРодителяТекКЭК = Лев(ТекРодитель.Код,19);
			
			// Поиск по коду родителя и аналитической группе.
			// У родителя может быть несколько аналитических групп, каждая из которых - отдельный узел дерева.
			СтрокаРодителя = НайтиСтрокуПоКодуИРодителю(ТаблицаПоиска,ТекРодитель.Ссылка,КодРодителяТекКЭК,Стр.КодКЭК);
			
			Если СтрокаРодителя <> Неопределено 
				И СтрокаРодителя <> ТекРодитель Тогда
				// Если нашли строку родителя и она отличается от текущего родителя,
				// то добавим новую строку к найденному родителю, а текущую добавим к массиву строк для пост обработки.
				СтрКОСГУ = СтрокаРодителя.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрКОСГУ, ДетальныеЗаписи);
				ЗаполнитьЗначенияСвойств(СтрКОСГУ, Стр);
				СтрКОСГУ.Код = Лев(ДетальныеЗаписи.Код,19)+Стр.КодКЭК;
				СтрКОСГУ.ИндексКартинки = СтрокаДерева.ИндексКартинки; // 4;
				СтрКОСГУ.Уровень = СтрКОСГУ.Уровень();
				
				ДобавитьСтрокуТаблицыПоиска(ТаблицаПоиска,СтрКОСГУ);						
				МассивСтрокДляПостОбработки.Добавить(СтрокаДерева);
			Иначе
								
				ЗаполнитьЗначенияСвойств(СтрокаДерева, Стр);						
				СтрокаДерева.Уровень = СтрокаДерева.Уровень(); 						
				СтрокаДерева.Код = Лев(ДетальныеЗаписи.Код,19)+Стр.КодКЭК;
				
				ИзменитьСтрокуТаблицыПоиска(ТаблицаПоиска,СтрокаДерева);
				
			КонецЕсли;
		Иначе
			
			АнГруппыТаблица = ТаблицаАнГрупп.Скопировать(АнГруппыМассив);
			АнГруппыТаблица.Сортировать("НомерСтроки");
			
			Для Каждого Стр Из АнГруппыТаблица Цикл
				
				ТекСтрокаДерева = СтрокаДерева;
				Если НЕ ЗначениеЗаполнено(СтрокаДерева.Наименование) Тогда
					// Если не заполнено наименование, значит это группировочный узел - элемент,
					// кода которого нет в БК, но у которого несколько аналитических групп.
					// При этом полный код с аналитической группой присутствует в БК.
					// Выполним поиск подходящего родителя для полного кода.
					
					Если Лев(Стр.КодКЭК,2) = "19" 
						И Сред(Стр.КодКЭК,3,1) <> "0"
						И АнГруппыТаблица.НайтиСтроки(Новый Структура("КодКЭК","190")).Количество()>0 Тогда
						// искать нужно для текущей строки, а не строки родителя
						
						ТекРодитель = СтрокаДерева;
						КодРодителяТекКЭК = Лев(ТекРодитель.Код,19);
						СтрокаР = НайтиСтрокуПоКодуИРодителю(ТаблицаПоиска,ТекРодитель.Ссылка,КодРодителяТекКЭК,Стр.КодКЭК);
						
						Если СтрокаР <> Неопределено Тогда
							ТекСтрокаДерева = СтрокаР;
						КонецЕсли;
					Иначе
					
						ТекРодитель = СтрокаДерева.Родитель;
						КодРодителяТекКЭК = Лев(ТекРодитель.Код,19);
						СтрокаР = НайтиСтрокуПоКодуИРодителю(ТаблицаПоиска,ТекРодитель.Ссылка,КодРодителяТекКЭК,Стр.КодКЭК);
						Если СтрокаР <> Неопределено Тогда
							ТекСтрокаДерева = СтрокаР;
						КонецЕсли;	
					КонецЕсли;
					
				КонецЕсли;
				
			 	СтрКОСГУ = ТекСтрокаДерева.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрКОСГУ, ДетальныеЗаписи);
				ЗаполнитьЗначенияСвойств(СтрКОСГУ, Стр);
				СтрКОСГУ.Код = Лев(ДетальныеЗаписи.Код,19)+Стр.КодКЭК;
				СтрКОСГУ.ИндексКартинки = СтрокаДерева.ИндексКартинки; // 4;
				СтрКОСГУ.Уровень = СтрКОСГУ.Уровень();
				
				ДобавитьСтрокуТаблицыПоиска(ТаблицаПоиска,СтрКОСГУ);
			КонецЦикла;
			
			Если НЕ ЗначениеЗаполнено(СтрокаДерева.Наименование) 
				И СтрокаДерева.Строки.Количество() = 0 Тогда
				// Если у строки нет подчиненных строк, 
				// добавляем строку дерева для пост обработки.
				// Строки дерева, не содержащие значимых строк будут удалены. 
				МассивСтрокДляПостОбработки.Добавить(СтрокаДерева);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьДетальныеЗаписи()

Функция ЕстьЗначимыеСтроки(ПроверяемаяСтрока)
	Если ЗначениеЗаполнено(ПроверяемаяСтрока.Наименование) Тогда
		Возврат Истина;
	КонецЕсли;
	Для Каждого Стр Из ПроверяемаяСтрока.Строки Цикл
		Если ЕстьЗначимыеСтроки(Стр) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Процедура ДобавитьСтрокуТаблицыПоиска(ТаблицаПоиска,СтрокаДерева)
	
	СтруктураЗаполнения = Новый Структура("ВидДохода,Код,СтрокаДерева",СтрокаДерева.Ссылка,СтрокаДерева.Код,СтрокаДерева);
	ЗаполнитьЗначенияСвойств(ТаблицаПоиска.Добавить(),СтруктураЗаполнения);	
	
КонецПроцедуры

Процедура ИзменитьСтрокуТаблицыПоиска(ТаблицаПоиска,СтрокаДерева)
	
	ТекСтр = ТаблицаПоиска.Найти(СтрокаДерева,"СтрокаДерева");
	Если ТекСтр<> Неопределено Тогда
		ТекСтр.Код = СтрокаДерева.Код;
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиСтрокуПоКодуИРодителю(ТаблицаПоиска,РодительСсылка,КодРодителя,КодКЭК)
	
	// Поиск по коду родителя и аналитической группе.
	// У родителя может быть несколько аналитических групп, каждая из которых - отдельный узел дерева.
	НайденныеСтроки = ТаблицаПоиска.НайтиСтроки(Новый Структура("ВидДохода,Код",РодительСсылка,КодРодителя+КодКЭК));
	Если НайденныеСтроки.Количество()>0 Тогда
		Возврат НайденныеСтроки[0].СтрокаДерева;
	КонецЕсли;
	
	// ан. коды 191-197 в дереве должны быть в иерархии кода 190
	Если Лев(КодКЭК,2) = "19" 
		И Сред(КодКЭК,3,1) <> 0 Тогда
		
		НайденныеСтроки = ТаблицаПоиска.НайтиСтроки(Новый Структура("ВидДохода,Код",РодительСсылка,КодРодителя+"190"));
		Если НайденныеСтроки.Количество()>0 Тогда
			Возврат НайденныеСтроки[0].СтрокаДерева;
		КонецЕсли;
		
	КонецЕсли;
	
	// У родителя нет отдельных узлов по аналитическим группам, ищем по коду с "000".
	НайденныеСтроки = ТаблицаПоиска.НайтиСтроки(Новый Структура("ВидДохода,Код",РодительСсылка,КодРодителя+"000"));
	Если НайденныеСтроки.Количество()>0 Тогда
		Возврат НайденныеСтроки[0].СтрокаДерева;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли