#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Константы.РасширеннаяНастройкаПравДоступа.Получить() И НЕ Значение Тогда
		//Надо проверить возможность изменения
		
		
		 Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		 |	ГруппыДоступаПользователи.Пользователь
		 |ИЗ
		 |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		 |ГДЕ
		 |	ГруппыДоступаПользователи.Ссылка.Предопределенный = ЛОЖЬ
		 |	И ГруппыДоступаПользователи.Ссылка.Пользователь = НЕОПРЕДЕЛЕНО");
		 
		 РезультатЗапроса = Запрос.Выполнить();
		 
		 Если НЕ РезультатЗапроса.Пустой() Тогда
			 
			НСтрока = НСтр("ru = 'Существуют непустые группы доступа пльзователей. Изменение режима управления доступом невозможно'");
			ОбщегоНазначения.СообщитьПользователю(НСтрока,,,, Отказ);

			
		КонецЕсли;	
		
	КонецЕсли;	
	
	
	
КонецПроцедуры


#КонецЕсли
