
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Событие = Параметры.Событие;
	
	АктивизироватьСтраницуРасшифровки = Параметры.АктивизироватьСтраницуРасшифровки;
	АктивизироватьСтраницуНастройкиОткрытияТиповыхОтчетов = Параметры.АктивизироватьСтраницуНастройкиОткрытияТиповыхОтчетов;
	КолонкиТаблицы = Параметры.КолонкиТаблицы;
	
	МассивВызовов = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьВызовыОбщихМодулей();
	Для каждого ТекстВызова Из МассивВызовов Цикл
		Если МинДлинаВызова = 0 Тогда
			МинДлинаВызова = СтрДлина(ТекстВызова);
		Иначе
			МинДлинаВызова = Мин(МинДлинаВызова, СтрДлина(ТекстВызова));
		КонецЕсли;
	КонецЦикла;
	
	Формула.УстановитьТекст(Параметры.Формула);
	Расшифровка.УстановитьТекст(Параметры.Расшифровка);
	Заголовок = Параметры.Заголовок;
	
	АгрегатнаяФункция = Параметры.АгрегатнаяФункция;
	Если НЕ ЗначениеЗаполнено(АгрегатнаяФункция) Тогда
		Элементы.АгрегатнаяФункция.Видимость = Ложь;
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		Элементы.ГруппаРасшифровка.Видимость = Ложь;
		Элементы.ГруппаНастройкиОткрытияТиповыхОтчетов.Видимость = Ложь;
	КонецЕсли;
	
	КомпоновщикНастроек = ЗаполнениеОтчетностиСервер.ПолучитьКомпоновщикНастроек(Параметры.АдресКомпоновщикаНастроек);
	
	ЗначениеВРеквизитФормы(ПолучитьИзВременногоХранилища(Параметры.АдресДоступныхВызовов),"ДоступныеВыражения");
	
	Если ЗначениеЗаполнено(АгрегатнаяФункция) Тогда
		
		ТаблицаНастроек = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьНастройкиРасшифровки();
		
		АдресТаблицыНастроек = ПоместитьВоВременноеХранилище(ТаблицаНастроек, УникальныйИдентификатор);
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("Использовать", Истина);
		
		НайденныеСтроки = ТаблицаНастроек.НайтиСтроки(ПараметрыПоиска);
		Для каждого СтрокаТаблицы Из НайденныеСтроки Цикл
			
			СписокВыбора.Добавить(СтрокаТаблицы.Идентификатор, СтрокаТаблицы.Представление);
			
			Элементы.ТаблицаОтчетовРасшифровкиПредставление.СписокВыбора.Добавить(СтрокаТаблицы.Представление);
			
		КонецЦикла;
		
		ВосстановитьНастройкиНаСервере(Параметры.НастройкиОткрытияТиповыхОтчетов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстФормулы = СокрЛП(Формула.ПолучитьТекст());
	
	Если НЕ ПустаяСтрока(ТекстФормулы) Тогда
		
		НомерСтроки = СтрЧислоСтрок(ТекстФормулы);
		НомерКолонки = СтрДлина(СтрПолучитьСтроку(ТекстФормулы, НомерСтроки)) + 2;
		
		Элементы.Формула.УстановитьГраницыВыделения(НомерСтроки,НомерКолонки,НомерСтроки,НомерКолонки);
		
	КонецЕсли;
	
	ТекстРасшифровка = СокрЛП(Расшифровка.ПолучитьТекст());
	
	Если НЕ ПустаяСтрока(ТекстРасшифровка) Тогда
		
		НомерСтроки = СтрЧислоСтрок(ТекстРасшифровка);
		НомерКолонки = СтрДлина(СтрПолучитьСтроку(ТекстРасшифровка, НомерСтроки)) + 2;
		
		Элементы.Расшифровка.УстановитьГраницыВыделения(НомерСтроки,НомерКолонки,НомерСтроки,НомерКолонки);
		
	КонецЕсли;
	
	Если АктивизироватьСтраницуРасшифровки Тогда
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРасшифровка;
		
	КонецЕсли;
	
	Если АктивизироватьСтраницуНастройкиОткрытияТиповыхОтчетов Тогда
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНастройкиОткрытияТиповыхОтчетов;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ТипЗнч(Параметр) = Тип("Структура") Тогда
		
		Если Источник = "ФормаНастройкиОтчетаРасшифровки" Тогда
			
			Если ИмяСобытия = "ДобавлениеОтчета" Тогда
				
				НоваяСтрока = ТаблицаОтчетовРасшифровки.Добавить();
				
				НоваяСтрока.Идентификатор = Параметр.ИдентификаторОтчета;
				НоваяСтрока.АдресНастройки = Параметр.АдресНастройки;
				НоваяСтрока.Использовать = Истина;
				
				ТекстПредставления = СписокВыбора.НайтиПоЗначению(Параметр.ИдентификаторОтчета).Представление;
				Если ЗначениеЗаполнено(Параметр.ДополнениеЗаголовка) Тогда
					ТекстПредставления = СтрШаблон("%1 <%2>",
						ТекстПредставления,
						СокрЛП(Параметр.ДополнениеЗаголовка));
				КонецЕсли;
				НоваяСтрока.Представление = ТекстПредставления;
				
				Элементы.ТаблицаОтчетовРасшифровки.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
				
			ИначеЕсли ИмяСобытия = "ИзменениеНастроек" Тогда
				
				ТекущиеДанные = Элементы.ТаблицаОтчетовРасшифровки.ТекущиеДанные;
				ТекущиеДанные.АдресНастройки = Параметр.АдресНастройки;
				
				ТекстПредставления = СписокВыбора.НайтиПоЗначению(Параметр.ИдентификаторОтчета).Представление;
				Если ЗначениеЗаполнено(Параметр.ДополнениеЗаголовка) Тогда
					ТекстПредставления = СтрШаблон("%1 <%2>",
						ТекстПредставления,
						СокрЛП(Параметр.ДополнениеЗаголовка));
				КонецЕсли;
				ТекущиеДанные.Представление = ТекстПредставления;
				
			ИначеЕсли ИмяСобытия = "ИзменениеСтандартногоОтчета" Тогда
				
				ТекущиеДанные = Элементы.ТаблицаОтчетовРасшифровки.ТекущиеДанные;
				
				ТекущиеДанные.Идентификатор = Параметр.ИдентификаторОтчета;
				ТекущиеДанные.АдресНастройки = Параметр.АдресНастройки;
				
				ТекстПредставления = СписокВыбора.НайтиПоЗначению(Параметр.ИдентификаторОтчета).Представление;
				Если ЗначениеЗаполнено(Параметр.ДополнениеЗаголовка) Тогда
					ТекстПредставления = СтрШаблон("%1 <%2>",
						ТекстПредставления,
						СокрЛП(Параметр.ДополнениеЗаголовка));
				КонецЕсли;
				ТекущиеДанные.Представление = ТекстПредставления;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	ТекстФормулы = СокрЛП(Формула.ПолучитьТекст());
	
	
	ОтказФормула = НЕ ЗаполнениеОтчетностиСервер.ПроверитьФормулу(ТекстФормулы, , , МинДлинаВызова, ТекстСообщения);
	Если ОтказФормула Тогда
		
		Отказ = Истина;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Проверка формулы %1'"), ТекстСообщения));
		
	КонецЕсли;
	
	Если Элементы.ГруппаРасшифровка.Видимость Тогда
		
		ТекстРасшифровка = СокрЛП(Расшифровка.ПолучитьТекст());
		
		ОтказРасшифровка = НЕ ЗаполнениеОтчетностиСервер.ПроверитьФормулу(ТекстРасшифровка, , , МинДлинаВызова, ТекстСообщения);
		Если ОтказРасшифровка Тогда
			
			Отказ = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Проверка расшифровки %1'"), ТекстСообщения));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	ЗаполнениеОтчетностиКлиент.СохранениеПередЗакрытием(ЭтаФорма,Событие,"ФормаЭлементаСхемыЗаполнения");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ КомпоновщикНастроекНастройкиВыбор

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиВыборДоступныеПоляВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Поле = ПолучитьИмяПоля(КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.ПолучитьОбъектПоИдентификатору(ВыбраннаяСтрока));
	
	Если Поле <> Неопределено Тогда
		
		ИзменитьТекстВФормулы(Поле, 1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиВыборДоступныеПоляВыбораНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	#Если ВебКлиент Тогда
		
	Выполнение = Ложь;
		
	#Иначе
		
	СтрокаВыбранныхПолей = "";
	
	Для каждого ВыбранноеПоле Из ПараметрыПеретаскивания.Значение Цикл
		
		Поле = ПолучитьИмяПоля(ВыбранноеПоле);
		
		Если Поле <> Неопределено Тогда
			
			СтрокаВыбранныхПолей = СтрокаВыбранныхПолей + ?(ПустаяСтрока(СтрокаВыбранныхПолей),"",Символы.ПС) + Поле;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПустаяСтрока(СтрокаВыбранныхПолей) Тогда
		
		Выполнение = Ложь;
		
	КонецЕсли;
	
	ПараметрыПеретаскивания.Значение = СтрокаВыбранныхПолей;
		
	#КонецЕсли
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ДоступныеВыражения

&НаКлиенте
Процедура ДоступныеВыраженияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИзменитьТекстВФормулы(Элемент.ТекущиеДанные.Шаблон);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеВыраженияНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	#Если ВебКлиент Тогда
		
	Выполнение = Ложь;
		
	#Иначе
	
	СтрокаВыбранныхПолей = "";
	
	Если Элемент.ТекущиеДанные.Уровень <> 3 Тогда
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементМассива Из ПараметрыПеретаскивания.Значение Цикл
		
		СтрокаВыбранныхПолей = СтрокаВыбранныхПолей + ?(ПустаяСтрока(СтрокаВыбранныхПолей),"",Символы.ПС) 
													+ ДоступныеВыражения.НайтиПоИдентификатору(ЭлементМассива).Шаблон;
		
	КонецЦикла;
	
	ПараметрыПеретаскивания.Значение = СтрокаВыбранныхПолей;
	
	#КонецЕсли
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ТаблицаОтчетовРасшифровки

&НаКлиенте
Процедура ТаблицаОтчетовРасшифровкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Не Копирование Тогда
		
		Отказ = Истина;
		
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Источник","ТаблицаОтчетовРасшифровкиПередНачаломДобавления");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаПроизвольногоОповещения", ЭтаФорма, ДополнительныеПараметры);

		СписокВыбора.ПоказатьВыборЭлемента(ОписаниеОповещения,НСтр("ru = 'Выбор стандартного отчета'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчетовРасшифровкиПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуНастроек(Элементы.ТаблицаОтчетовРасшифровки.ТекущиеДанные.Идентификатор,
			Элементы.ТаблицаОтчетовРасшифровки.ТекущиеДанные.Представление,
			Элементы.ТаблицаОтчетовРасшифровки.ТекущиеДанные.АдресНастройки,
			"ИзменениеНастроек");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчетовРасшифровкиПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение <> Неопределено И Элементы.ТаблицаОтчетовРасшифровки.ТекущиеДанные.Представление <> ВыбранноеЗначение Тогда
		
		Идентификатор = Неопределено;
		Для каждого ЭлементСписка Из СписокВыбора Цикл
			
			Если ЭлементСписка.Представление = ВыбранноеЗначение Тогда
				Идентификатор = ЭлементСписка.Значение;
			КонецЕсли;
			
		КонецЦикла;
		
		ОткрытьФормуНастроек(Идентификатор,
				ВыбранноеЗначение,
				Элементы.ТаблицаОтчетовРасшифровки.ТекущиеДанные.АдресНастройки,
				"ИзменениеСтандартногоОтчета");
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если СохранитьДанныеФормы() Тогда
		
		Модифицированность = Ложь;
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ИзменитьТекстВФормулы(Знач ТекстДляВставки, Знач Сдвиг = 0)
	
	СтрокаНач  = 0;
	СтрокаКон  = 0;
	КолонкаНач = 0;
	КолонкаКон = 0;
	
	ТекЭлемент = Неопределено;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаФормула Тогда
		
		ТекЭлемент = Элементы.Формула;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРасшифровка Тогда
		
		ТекЭлемент = Элементы.Расшифровка;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ТекЭлемент.ПолучитьГраницыВыделения(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
	
	ТекстФормулы = СокрЛП(Формула.ПолучитьТекст());
	
	Если ПустаяСтрока(ТекстФормулы) Тогда
		
		ТекЭлемент.УстановитьГраницыВыделения(1,1,1,1);
		
	КонецЕсли;
		
	ТекЭлемент.ВыделенныйТекст = ТекстДляВставки;
	
	Если НЕ Сдвиг = 0 Тогда
		
		ТекЭлемент.ПолучитьГраницыВыделения(СтрокаНач, КолонкаНач, СтрокаКон, КолонкаКон);
		ТекЭлемент.УстановитьГраницыВыделения(СтрокаНач, КолонкаНач + Сдвиг, СтрокаКон, КолонкаКон + Сдвиг);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяПоля(ВыбранноеПоле)
	
	СистемныеПоля = Новый ПолеКомпоновкиДанных("СистемныеПоля");
	ПараметрыДанных = Новый ПолеКомпоновкиДанных("ПараметрыДанных");
	
	Поле = Неопределено;
	
	Если ТипЗнч(ВыбранноеПоле) = Тип("ДоступноеПолеКомпоновкиДанных") Тогда
		
		Если ВыбранноеПоле.Поле = ПараметрыДанных ИЛИ ВыбранноеПоле.Поле = СистемныеПоля Тогда
			
			СтандартнаяОбработка = Ложь;
			Возврат Неопределено;
			
		КонецЕсли;
		
		Если ВыбранноеПоле.Родитель <> Неопределено Тогда 
			
			Если ВыбранноеПоле.Родитель.Поле = ПараметрыДанных Тогда
				
				Поле = СтрЗаменить(Строка(ВыбранноеПоле.Поле),"ПараметрыДанных.","&");
				
			ИначеЕсли ВыбранноеПоле.Родитель.Поле = СистемныеПоля Тогда
				
				Поле = СтрЗаменить(Строка(ВыбранноеПоле.Поле),"СистемныеПоля.","")+"()";
				
			Иначе
				
				Поле = Строка(ВыбранноеПоле.Поле);
				
			КонецЕсли;
			
		Иначе
			
			Поле = Строка(ВыбранноеПоле.Поле);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Поле;
	
КонецФункции

&НаКлиенте
Функция СохранитьДанныеФормы()
	
	Если не ПроверитьЗаполнение() Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	ВозвращаемыеДанные = ПодготовитьСтруктуруВозврата();
	
	Если ВозвращаемыеДанные = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	Оповестить(Событие, ВозвращаемыеДанные, "ФормаЭлементаСхемыЗаполнения");
	
	Модифицированность = Ложь;
	
	Возврат Истина;
	
	
КонецФункции

&НаКлиенте
Функция ПодготовитьСтруктуруВозврата() Экспорт 

	ТекстФормулы = СокрЛП(Формула.ПолучитьТекст());
	ТекстРасшифровки = СокрЛП(Расшифровка.ПолучитьТекст());
	
	
	ПараметрыВозврата = Новый Структура;
	ПараметрыВозврата.Вставить("АгрегатнаяФункция", ?(ПустаяСтрока(АгрегатнаяФункция),Неопределено,АгрегатнаяФункция));
	ПараметрыВозврата.Вставить("ТекстФормулы", ТекстФормулы);
	ПараметрыВозврата.Вставить("ТекстРасшифровки", ТекстРасшифровки);
	
	Если ТаблицаОтчетовРасшифровки.Количество() = 0 Тогда
		НастройкиОткрытияТиповыхОтчетов = "";
	Иначе
		Попытка
			НастройкиОткрытияТиповыхОтчетов = СохранитьТаблицаОтчетовРасшифровки();
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	ПараметрыВозврата.Вставить("НастройкиОткрытияТиповыхОтчетов", НастройкиОткрытияТиповыхОтчетов);

	
	Возврат ПараметрыВозврата;
	
КонецФункции


&НаСервере
Функция СохранитьТаблицаОтчетовРасшифровки()
	
	ТаблицаНастроекФорма = РеквизитФормыВЗначение("ТаблицаОтчетовРасшифровки");
	
	Если НЕ ЗначениеЗаполнено(ТаблицаНастроекФорма) Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Попытка
		
		ТекстНастроек = ЗаполнениеОтчетностиСервер.СохранитьТаблицуНастроекОткрытияТиповыхОтчетов(ТаблицаНастроекФорма);
		
	Исключение
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При сохранении настроек детализации показателей стандатными отчетами возникли ошибки: %1'"),
						ДиагностикаСлужебный.ПолучитьТекстОшибки(ИнформацияОбОшибке()));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ЗаписьЖурналаРегистрации("ОбластьЗаполнения.СохранениеНастроекДетализацииПоказателей",
					УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецПопытки;
	
	Возврат ТекстНастроек;
	
КонецФункции

&НаСервере
Процедура ВосстановитьНастройкиНаСервере(Знач Настройки)
	
	Попытка
		
		ТаблицаНастроек = ЗаполнениеОтчетностиСервер.ПолучитьТаблицуНастроекОткрытияТиповыхОтчетов(Настройки);
		
	Исключение
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При восстановлении настроек детализации показателей стандатными отчетами возникли ошибки: %1'"),
						ДиагностикаСлужебный.ПолучитьТекстОшибки(ИнформацияОбОшибке()));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		ЗаписьЖурналаРегистрации("ОбластьЗаполнения.ВосстановлениеНастроекДетализацииПоказателей",
					УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
					
		Возврат;
		
	КонецПопытки;
	
	ТаблицаНастроек = ЗаполнениеОтчетностиСервер.ПолучитьТаблицуНастроекОткрытияТиповыхОтчетов(Настройки);
	
	Если ТипЗнч(ТаблицаНастроек) = Тип("ТаблицаЗначений") Тогда
		
		Для каждого СтрокаТаблицы Из ТаблицаНастроек Цикл
			
			НоваяСтрока = ТаблицаОтчетовРасшифровки.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
			НоваяСтрока.АдресНастройки = ПоместитьВоВременноеХранилище(СтрокаТаблицы.Настройки, УникальныйИдентификатор);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Знач Идентификатор, Знач Представление, Знач АдресНастройки, Знач Событие)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ИдентификаторОтчета", Идентификатор);
	
	ЧастиНаименования = РазделитьСтрокуПоСкобкам(Представление);
	ПараметрыФормы.Вставить("НаименованиеОтчета", ЧастиНаименования.ТекстДоСкобок);
	ПараметрыФормы.Вставить("ДополнениеЗаголовка", ЧастиНаименования.ТекстВСкобках);
	
	ПараметрыФормы.Вставить("АдресНастройки", АдресНастройки);
	
	ПараметрыФормы.Вставить("КолонкиТаблицы", КолонкиТаблицы);
	ПараметрыФормы.Вставить("АдресТаблицыНастроек", АдресТаблицыНастроек);
	ПараметрыФормы.Вставить("Событие", Событие);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда  
		ОткрытьФормуМодально("Справочник.ОбластиЗаполнения.Форма.ФормаНастройкиОтчетаРасшифровки", ПараметрыФормы, ЭтаФорма);
	#Иначе 
		ОткрытьФорму("Справочник.ОбластиЗаполнения.Форма.ФормаНастройкиОтчетаРасшифровки", ПараметрыФормы, ЭтаФорма);
	#КонецЕсли
	
КонецПроцедуры

Функция РазделитьСтрокуПоСкобкам(ИсходнаяСтрока)
	
	РезультатПоиска = СтрНайтиПоРегулярномуВыражению(ИсходнаяСтрока, "<([^>]+)>");
	
	Если РезультатПоиска.НачальнаяПозиция <> 0 Тогда
		Группы = РезультатПоиска.ПолучитьГруппы();
		ТекстДоСкобок = СокрЛП(Сред(ИсходнаяСтрока, 1, РезультатПоиска.НачальнаяПозиция - 1));
		ТекстВСкобках = Группы[0].Значение;
		
		Возврат Новый Структура("ТекстДоСкобок, ТекстВСкобках", ТекстДоСкобок, ТекстВСкобках);
	Иначе
		Возврат Новый Структура("ТекстДоСкобок, ТекстВСкобках", ИсходнаяСтрока, "");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаПроизвольногоОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Источник = "ТаблицаОтчетовРасшифровкиПередНачаломДобавления" Тогда 
		
		Если Результат = Неопределено Тогда 
			Возврат;
		КонецЕсли;	
		
		ОткрытьФормуНастроек(Результат.Значение, Результат.Представление, "", "ДобавлениеОтчета");
		
	КонецЕсли;	
	
КонецПроцедуры	
