////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции, вызываемые с клиента.
// Должны использоваться только в механизме типовых операций.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Вызывает функцию серверного модуля БСП
// вызывается из модуля БухгалтерскиеОперацииКлиент
//
Функция ПолучитьКурсВалюты(Знач Валюта, Знач ДатаКурса) Экспорт
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ДатаКурса);
КонецФункции

// Вызывает функцию серверного модуля БСП
//
Функция ЭтоСсылка(Знач Тип) Экспорт
	
	Возврат ОбщегоНазначения.ЭтоСсылка(Тип);
	
КонецФункции

Функция ВладелецОбъекта(Знач Ссылка) Экспорт

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Владелец");

КонецФункции

Функция КонтрагентОбъекта(Знач Ссылка) Экспорт

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Контрагент");

КонецФункции

Процедура УстановитьОперациюПоУмолчанию(Знач ТиповаяОперация, Знач ДляВсехПользователей = Ложь) Экспорт

	Если ДляВсехПользователей Тогда
		ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	ИдентификаторДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТиповаяОперация, "ИдентификаторДокумента");
	
	НоваяЗапись = РегистрыСведений.ТиповыеОперацииПоУмолчанию.СоздатьМенеджерЗаписи();
	НоваяЗапись.ИдентификаторДокумента	= ИдентификаторДокумента;
	НоваяЗапись.Пользователь			= ТекущийПользователь;
	НоваяЗапись.ТиповаяОперация			= ТиповаяОперация;
	НоваяЗапись.Записать(Истина);

КонецПроцедуры

Процедура УстановитьРеквизитыОперацииПоУмолчаниюИзФормы(Знач ПараметрыУстановкиРеквизитов) Экспорт
	Перем Пользователь;
	Перем ЗначенияДополнительныхРеквизитов;
	Перем ТиповаяОперация;
	Перем Организация;
	Перем ЗначениеТекущегоРеквизита;
	
	ПараметрыУстановкиРеквизитов.Свойство("ТиповаяОперация",					ТиповаяОперация);
	ПараметрыУстановкиРеквизитов.Свойство("Пользователь",						Пользователь);
	ПараметрыУстановкиРеквизитов.Свойство("ЗначенияДополнительныхРеквизитов",	ЗначенияДополнительныхРеквизитов);
	ПараметрыУстановкиРеквизитов.Свойство("Организация",						Организация);
	
	Если ПараметрыУстановкиРеквизитов.ДляТекущегоПользователя
		И НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка КАК Ссылка,
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы КАК ИмяДляФормулы,
	|	ВЫБОР
	|		КОГДА РеквизитыТиповыхОпераций.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)
	|			ТОГДА ПоставляемыеРеквизитыТиповыхОпераций.СвязиПараметровВыбора
	|		ИНАЧЕ ДанныеРеквизитовТиповыхОпераций.СвязиПараметровВыбора
	|	КОНЕЦ КАК СвязиПараметровВыбора
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПоставляемыеРеквизитыТиповыхОпераций КАК ПоставляемыеРеквизитыТиповыхОпераций
	|		ПО РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации = ПоставляемыеРеквизитыТиповыхОпераций.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеРеквизитовТиповыхОпераций КАК ДанныеРеквизитовТиповыхОпераций
	|		ПО РеквизитыТиповыхОпераций.Ссылка = ДанныеРеквизитовТиповыхОпераций.РеквизитТиповойОперации
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И НЕ РеквизитыТиповыхОпераций.ЭтоГруппа
	|	И НЕ РеквизитыТиповыхОпераций.ПометкаУдаления";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	РеквизитыСОрганизацией = РегистрыСведений.ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	РеквизитыБезОрганизации = РеквизитыСОрганизацией.Скопировать();
	
	СтруктураЗаполнения = Новый Структура("ТиповаяОперация", ТиповаяОперация);
	СтруктураЗаполнения.Вставить("Пользователь", Пользователь);
	
	Пока Выборка.Следующий() Цикл
		Если ЗначенияДополнительныхРеквизитов.Свойство(Выборка.ИмяДляФормулы, ЗначениеТекущегоРеквизита) Тогда
			Если ЗначениеЗаполнено(Выборка.СвязиПараметровВыбора)
				И Найти(Выборка.СвязиПараметровВыбора, "{""S"",""Объект.Организация""}") > 0 Тогда
				НоваяСтрока = РеквизитыСОрганизацией.Добавить();
				НоваяСтрока.Организация = Организация;
			Иначе
				НоваяСтрока = РеквизитыБезОрганизации.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураЗаполнения);
			НоваяСтрока.РеквизитОперации 	= Выборка.Ссылка;
			НоваяСтрока.Значение			= ЗначениеТекущегоРеквизита;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ТиповаяОперация.Установить(ТиповаяОперация);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Загрузить(РеквизитыСОрганизацией);
	НаборЗаписей.Записать(Истина);
	
	НаборЗаписей = РегистрыСведений.ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ТиповаяОперация.Установить(ТиповаяОперация);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());
	НаборЗаписей.Загрузить(РеквизитыБезОрганизации);
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

Функция СериализоватьКомпоновщикНастроек(Знач КомпоновщикНастроек, ПредставлениеОтбора="") Экспорт

	ПредставлениеОтбора = Строка(КомпоновщикНастроек.Настройки.Отбор);
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(КомпоновщикНастроек.Настройки);
	
КонецФункции // СериализоватьКомпоновщикНастроек()

Процедура ВыполнитьОсобуюПроцедуруВосстановленияПоддержки(Знач ТиповаяОперация, Знач СкопироватьИсходнуюОперацию = Ложь) Экспорт
	Справочники.ТиповыеОперации.ВыполнитьОсобуюПроцедуруВосстановленияПоддержки(ТиповаяОперация, СкопироватьИсходнуюОперацию);
КонецПроцедуры

Функция НомерЖурнала(Знач СчетДт, Знач СчетКт) Экспорт
	Возврат БухгалтерскийУчетПовтИсп.НомерЖурнала(СчетДт, СчетКт);
КонецФункции

Процедура УстановитьЗначенияРеквизитовПоУмолчаниюВДокументы(Знач ТиповаяОперация) Экспорт
	Справочники.ТиповыеОперации.УстановитьЗначенияРеквизитовПоУмолчаниюВДокументы(ТиповаяОперация, Ложь);
КонецПроцедуры

Функция ЗапущеноФоновоеОбновлениеТиповыхОпераций() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Результат = БухгалтерскиеОперацииСервер.ЗапущеноФоновоеОбновлениеТиповыхОпераций();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;

КонецФункции

#КонецОбласти

