
#Область ОписаниеПеременных
&НаКлиенте
Перем ОчередьОбновлений;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания, ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НужнаАктуализацияКПС = БюджетнаяКлассификацияПереопределяемый.НеобходимаАктуализацияКПС();
	БюджетнаяКлассификацияПереопределяемый.ПриСозданииНаСервереФормыПомощникаЗагрузкиБК(Отказ, ЭтаФорма);
	
	
	УстановитьСвойстваНачальнойСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекущуюСтраницуПомощника(НачальнаяСтраница());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтменятьЗагрузкуПриИзменении(Элемент)
	Если Объект.ОтменятьЗагрузку Тогда
		Объект.ЗагружатьСОшибками = Ложь;
	КонецЕсли;
	Элементы.ЗагружатьСОшибками.Доступность = НЕ Объект.ОтменятьЗагрузку;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаНаДискеПриИзменении(Элемент)
	
	ЗагружатьИзИнтернета = Ложь;
	ДоступныеВерсииВИнтернете.Очистить();
	УстановитьСвойстваНачальнойСтраницы();
	УстановитьТекущуюСтраницуПомощника(НачальнаяСтраница());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаНаДиске_1ПриИзменении(Элемент)
	
	ЗагружатьИзИнтернета = Ложь;
	ДоступныеВерсииВИнтернете.Очистить();
	УстановитьСвойстваНачальнойСтраницы();
	УстановитьТекущуюСтраницуПомощника(НачальнаяСтраница());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеОбновления

&НаКлиенте
Процедура ДоступныеОбновленияПометкаПриИзменении(Элемент)
	
	Если Элементы.ДоступныеОбновления.ТекущиеДанные.Пометка = 2 Тогда
		Элементы.ДоступныеОбновления.ТекущиеДанные.Пометка = 0;
	КонецЕсли;
	
	УстановитьПометкиВДереве(Элементы.ДоступныеОбновления.ТекущиеДанные.ПолучитьЭлементы(), Элементы.ДоступныеОбновления.ТекущиеДанные.Пометка);
	РассчитатьПометкиПредковВДереве(Элементы.ДоступныеОбновления.ТекущиеДанные.ПолучитьРодителя());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоДублей

&НаКлиенте
Процедура ДеревоДублейСсылкаДубльНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДублейСсылкаДубльОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОшибок

&НаКлиенте
Процедура ДеревоОшибокСсылкаНаОшибкуОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОшибокСсылкаНаОшибкуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОшибокВидОбновленияИмяСпрОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоИнформации

&НаКлиенте
Процедура ДеревоИнформацииСсылкаНаОшибкуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИнформацииСсылкаНаОшибкуОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИнформацииВидОбновленияИмяСпрОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоместитьФайлБезРасширенияРаботыСФайлами(Команда)
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПоместитьФайлБезРасширенияРаботыСФайламиЗавершение", ЭтотОбъект), АдресВременногоХранилища,, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьФайлБезРасширенияРаботыСФайламиЗавершение(Результат, Адрес, ИмяВыбрФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат = Ложь Тогда
		Возврат;
	КонецЕсли;	
	
	ИмяФайла = ИмяВыбрФайла;
	АдресВременногоХранилища = Адрес;
	
	ПрочитатьВыбранныйФайл();
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ТекущаяСтраница = Элементы.СтраницыПомощника.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Элементы.СтраницаФайлОбновлений Тогда
		ПрочитатьВыбранныйФайл();
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДоступныеОбновления Тогда
		НачатьЗагрузкуВыбранныхОбновлений();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	ТекущаяСтраница = Элементы.СтраницыПомощника.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Элементы.СтраницаДоступныеОбновления Тогда
		Если НеВыбиратьФайлы Тогда
			Возврат;
		КонецЕсли;	
		УстановитьТекущуюСтраницуПомощника(Элементы.СтраницаФайлОбновлений);
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаФайлОбновлений Тогда
		// Стоп.
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаХодЗагрузки Тогда
		ОчередьОбновлений = Неопределено;
		УстановитьТекущуюСтраницуПомощника(Элементы.СтраницаДоступныеОбновления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиДоступныхОбновлений(Команда)
	УстановитьПометкиВДереве(ДоступныеОбновления.ПолучитьЭлементы(), 1);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиДоступныхОбновлений(Команда)
	УстановитьПометкиВДереве(ДоступныеОбновления.ПолучитьЭлементы(), 0);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДубли(Команда)
	ПроверитьДублиКлассификаторов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСвойстваНачальнойСтраницы()
	
	Элементы.ВыбранныйФайл.Видимость 		= НЕ ЗагружатьИзИнтернета;
	Элементы.ЗагрузкаИзИнтернета.Видимость 	= ЗагружатьИзИнтернета;
	Если ЗагружатьИзИнтернета Тогда
		Элементы.СтраницаФайлОбновлений.Заголовок = "Доступные обновления в интернете";
		Элементы.СтраницаФайлОбновлений.Подсказка = "";
	Иначе	
		Элементы.СтраницаФайлОбновлений.Заголовок = "Файл обновлений";
		Элементы.СтраницаФайлОбновлений.Подсказка = "Выберите файл с обновлениями";
	КонецЕсли;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПроверитьВыполнениеФоновогоЗаданияНаСервере(ФоновоеЗаданиеИдентификатор)
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
КонецФункции

&НаКлиенте
Функция ВыполняетсяЗагрузка()
	Возврат ЗначениеЗаполнено(ОчередьОбновлений);
КонецФункции

&НаКлиенте
Процедура ОбновитьДоступностьКнопок()
	
	ТекущаяСтраница = Элементы.СтраницыПомощника.ТекущаяСтраница;
	
	ДоступностьНазад = Истина;
	ДоступностьДалее = Истина;
	
	Если ТекущаяСтраница = Элементы.СтраницаФайлОбновлений Тогда
		ДоступностьНазад = Ложь;
		Если ЗагружатьИзИнтернета И ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
			ДоступностьДалее = Ложь;
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница =	Элементы.СтраницаДоступныеОбновления И НеВыбиратьФайлы Тогда
		ДоступностьНазад = Ложь;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаХодЗагрузки Тогда
		ДоступностьНазад = НЕ ВыполняетсяЗагрузка();
		ДоступностьДалее = Ложь;
		Элементы.Закрыть.Доступность = НЕ ВыполняетсяЗагрузка();
	КонецЕсли;
	
	Если Элементы.Закрыть.Доступность Тогда
		
		Протокол.ДобавитьСтроку("");
		Протокол.ДобавитьСтроку(НСтр("ru = 'Для завершения работы ""Помощника..."" нажмите кнопку ""Закрыть""'"));
		
	КонецЕсли;
	
	Элементы.Назад.Доступность = ДоступностьНазад;
	Элементы.Далее.Доступность = ДоступностьДалее;
	
КонецПроцедуры

&НаКлиенте
Функция НачальнаяСтраница()
	
	Если НеВыбиратьФайлы Тогда
		Возврат Элементы.СтраницаДоступныеОбновления;
	КонецЕсли;	
	
	Возврат Элементы.СтраницаФайлОбновлений;
	
КонецФункции

&НаКлиенте
Процедура УстановитьТекущуюСтраницуПомощника(Знач НоваяСтраница)
	
	Элементы.СтраницыПомощника.ТекущаяСтраница = НоваяСтраница;
	ТекущийЗаголовокСтраницы    = НоваяСтраница.Заголовок;
	ТекущийПодзаголовокСтраницы = НоваяСтраница.Подсказка;
	
	ОбновитьДоступностьКнопок();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПомещенныйФайлНаСервере(Знач ПомещенныйФайл)
	
	Перем ДиспетчерОбновлений;
	
	ДиспетчерОбновлений = РеквизитФормыВЗначение("Объект");
	ДиспетчерОбновлений.ДоступныеОбновления.Очистить();
	
	ДиспетчерОбновлений.ПрочитатьФайлПакета(ПомещенныйФайл.Хранение);
	
	ДеревоДоступныхОбновлений = ДиспетчерОбновлений.СформироватьДеревоДоступныхОбновлений();
	ЗначениеВРеквизитФормы(ДеревоДоступныхОбновлений, 	"ДоступныеОбновления");
	ЗначениеВРеквизитФормы(ДиспетчерОбновлений, 		"Объект"); 
	
	Элементы.ДоступныеОбновления.ТолькоПросмотр = Объект.ДатаИзменения < ДАТА(2016, 1, 1);  
	Если Элементы.ДоступныеОбновления.ТолькоПросмотр Тогда
		ОбщегоНазначения.СообщитьПользователю(
		НСтр("ru = 'Обновление классификаторов, с датой начала действия ранее 01.01.2016 г. не поддерживается'"),
		,
		,
		"ДоступныеОбновления");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьВыбранныйФайл()
	
	Если ЗагружатьИзИнтернета Тогда
		ОтмеченнаяСтрока = ДоступныеВерсииВИнтернете.НайтиСтроки(Новый Структура("Пометка", Истина));
		Если ОтмеченнаяСтрока.Количество() = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано обновление для загрузки'"),,,);
			Возврат;
		КонецЕсли;
		
		ИмяФайла = ОтмеченнаяСтрока[0].ИдентификаторФайла;
		АдресВременногоХранилища = ОтмеченнаяСтрока[0].Адрес;
		
	Иначе	
		Если ПустаяСтрока(ИмяФайла) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран файл обновлений'"),,,	"ИмяФайла");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеПереданногоФайла 			= Новый Структура("Имя, Хранение");
	ОписаниеПереданногоФайла.Имя 		= ИмяФайла;
	ОписаниеПереданногоФайла.Хранение 	= АдресВременногоХранилища;
	
	ПрочитатьПомещенныйФайлНаСервере(ОписаниеПереданногоФайла);
	
	УстановитьТекущуюСтраницуПомощника(Элементы.СтраницаДоступныеОбновления);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбновлениеИзОчереди()
	
	Если НЕ ЗначениеЗаполнено(ОчередьОбновлений) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОжидающегоОбновления = ОчередьОбновлений[0];
	
	Попытка
		ВыполнитьЗагрузку(ДанныеОжидающегоОбновления.НомерСтроки);
	Исключение
		
		Протокол.ДобавитьСтроку(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Во время загрузки произошла ошибка (%1). Загрузка обновления прервана. Подробности в журнале регистрации.'"),
		КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьАктуализациюКПС()
	
	Попытка
		ВыполнитьПроцедуруАктуализацииКПС();
	Исключение
		
		Протокол.ДобавитьСтроку(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Во время актуализации КПС произошла ошибка (%1). Актуализация прервана. Подробности в журнале регистрации.'"),
		КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПроцедуруАктуализацииКПС()
	
	ЗаданиеВыполнено = АктуализацияКПСЗагруженногоКомплекта();
	Если ЗаданиеВыполнено Тогда
		ЗапланироватьЗагрузкуОбновленияИзОчереди();
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработчикаОжидания = Новый Структура(
	"МинимальныйИнтервал,
	|МаксимальныйИнтервал,
	|ТекущийИнтервал,
	|КоэффициентУвеличенияИнтервала", 
	1, 15, 1, 1.4);
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания_АктуализацияКПС", 1, Истина);
	ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация",
	Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания_АктуализацияКПС()
	
	Попытка
		Если ПроверитьВыполнениеФоновогоЗаданияНаСервере(ИдентификаторЗадания) Тогда
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			ЗагрузитьПодготовленныеДанные();
			
			ЗапланироватьЗагрузкуОбновленияИзОчереди();
			
			Возврат;
		КонецЕсли;
		
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	ПодключитьОбработчикОжидания(
	"Подключаемый_ПроверитьВыполнениеЗадания_АктуализацияКПС", 
	ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
	Истина);
КонецПроцедуры

&НаСервере
Функция АктуализацияКПСЗагруженногоКомплекта()
	
	ПараметрыОбработки = Новый Структура("ДанныеДляАктуализацииКПС", Объект.ДанныеДляАктуализацииКПС.Выгрузить());
	
	ЗаданиеВыполнено = Ложь;	
	НачальноеКоличествоОшибок = Объект.ТаблицаОшибок.Количество(); 
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() И НЕ БюджетнаяКлассификацияПереопределяемый.ВозможноИспользованиеФоновыхЗаданийВФайловойБазе() Тогда
		
		ФоновыеЗаданияБюджетнаяКлассификация.ВыполнитьАктуализациюКПС(ПараметрыОбработки,АдресХранилища);
		ЗагрузитьПодготовленныеДанные();
		
		Возврат Истина;	
		
	КонецЕсли;		
	
	НаименованиеЗадания = НСтр("ru = 'Актуализация КПС'");
	
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(ПараметрыОбработки);
	ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилища);
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
	
	Задание = ФоновыеЗадания.Выполнить(
	"ФоновыеЗаданияБюджетнаяКлассификация.ВыполнитьАктуализациюКПС", 
	ПараметрыЭкспортнойПроцедуры, , НаименованиеЗадания);
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение		
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
	
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		ЗаданиеВыполнено = Истина; 
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;	
	Возврат ЗаданиеВыполнено;
	
КонецФункции

&НаКлиенте
Процедура ЗапланироватьЗагрузкуОбновленияИзОчереди()
	
	Если ЗначениеЗаполнено(ОчередьОбновлений) Тогда
		
		Если Протокол.КоличествоСтрок() > 0 Тогда
			Протокол.ДобавитьСтроку("");
		КонецЕсли;	
		
		Протокол.ДобавитьСтроку(ОчередьОбновлений[0].ТекстСообщения);
		
		
		ПодключитьОбработчикОжидания("ЗагрузитьОбновлениеИзОчереди", 0.1, Истина);
		
	Иначе
		Если НЕ АктуализацияВыполнялась И НужнаАктуализацияКПС И НЕ Объект.ОтменятьЗагрузку Тогда
			
			Если Протокол.КоличествоСтрок() > 0 Тогда
				Протокол.ДобавитьСтроку("");
			КонецЕсли;	
			
			Протокол.ДобавитьСтроку(НСтр("ru = 'Выполняется актуализация КПС по загруженным данным'"));
			
			ПодключитьОбработчикОжидания("ЗагрузитьАктуализациюКПС", 0.1, Истина);
			
			АктуализацияВыполнялась = Истина;
		Иначе
			ОчередьОбновлений = Неопределено;
			ОбновитьДоступностьКнопок();	
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗагрузкуВыбранныхОбновлений()
	
	АктуализацияВыполнялась = Ложь;
	
	ОчередьОбновлений = Новый Массив;
	Объект.ТаблицаОшибок.Очистить();
	ДеревоОшибок.ПолучитьЭлементы().Очистить();
	ДеревоИнформации.ПолучитьЭлементы().Очистить();
	
	Объект.ТаблицаИнформации.Очистить();
	Объект.ДанныеДляАктуализацииКПС.Очистить();
	
	// Подсчитаем количество элементов для инициализации полосы индикатора.
	КоличествоВыбранныхОбновлений = 0;
	Для Каждого СтрокаВендора Из ДоступныеОбновления.ПолучитьЭлементы() Цикл
		Если НЕ СтрокаВендора.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого СтрокаГруппы Из СтрокаВендора.ПолучитьЭлементы() Цикл
			Если НЕ СтрокаГруппы.Пометка Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого СтрокаОбновления Из СтрокаГруппы.ПолучитьЭлементы() Цикл
				Если НЕ СтрокаОбновления.Пометка Тогда
					Продолжить;
				КонецЕсли;
				КоличествоВыбранныхОбновлений = КоличествоВыбранныхОбновлений + 1;
				ОчередьОбновлений.Добавить(
				Новый Структура("НомерСтроки, ТекстСообщения",
				СтрокаОбновления.НомерСтроки,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Загрузка обновления ""%1""…'"),
				СтрокаОбновления.Наименование)));
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если ОчередьОбновлений.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Не отмечено ни одного обновления'"),
		,
		,
		"ДоступныеОбновления");
		Возврат;
	КонецЕсли;
	
	Элементы.Прогресс.МаксимальноеЗначение = КоличествоВыбранныхОбновлений;
	Прогресс = 0;
	Протокол.Очистить();
	
	УстановитьТекущуюСтраницуПомощника(Элементы.СтраницаХодЗагрузки);
	
	ЗапланироватьЗагрузкуОбновленияИзОчереди();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиВДереве(Знач КоллекцияЭлементовДерева, Знач Пометка)
	
	Для каждого ЭлементДерева Из КоллекцияЭлементовДерева Цикл
		
		УстановитьПометкиВДереве(ЭлементДерева.ПолучитьЭлементы(), Пометка);
		ЭлементДерева.Пометка = Пометка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПометкиПредковВДереве(Родитель)
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьСброшенные    = Ложь;
	ЕстьУстановленные = Ложь;
	Для каждого Элемент Из Родитель.ПолучитьЭлементы() Цикл
		Если Элемент.Пометка = 0 Тогда
			ЕстьСброшенные = Истина;
		ИначеЕсли Элемент.Пометка = 1 Тогда
			ЕстьУстановленные = Истина;
		ИначеЕсли Элемент.Пометка = 2 Тогда
			ЕстьУстановленные = Истина;
			ЕстьСброшенные = Истина;
		КонецЕсли;
		Если ЕстьУстановленные И ЕстьСброшенные Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьУстановленные И ЕстьСброшенные Тогда
		Родитель.Пометка = 2;
	ИначеЕсли ЕстьУстановленные Тогда
		Родитель.Пометка = 1;
	ИначеЕсли ЕстьСброшенные Тогда
		Родитель.Пометка = 0;
	КонецЕсли;
	
	РассчитатьПометкиПредковВДереве(Родитель.ПолучитьРодителя());
	
КонецПроцедуры

//длительные операции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ПроверитьВыполнениеФоновогоЗаданияНаСервере(ИдентификаторЗадания) Тогда
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			ЗагрузитьПодготовленныеДанные();
			
			Прогресс = Прогресс + 1;	
			ОчередьОбновлений.Удалить(0);
			ЗапланироватьЗагрузкуОбновленияИзОчереди();
			
			Возврат;
		КонецЕсли;
		
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	ПодключитьОбработчикОжидания(
	"Подключаемый_ПроверитьВыполнениеЗадания", 
	ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
	Истина);
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКомплект(Знач НомерСтроки)
	
	ПараметрыОбработки = Новый Структура("АдресХранилища, ДоступныеОбновления, НомерСтроки, ЗагружатьСОшибками, ОтменятьЗагрузку", 
	ПолучитьИзВременногоХранилища(Объект.Хранение), Объект.ДоступныеОбновления.Выгрузить(), НомерСтроки, Объект.ЗагружатьСОшибками, Объект.ОтменятьЗагрузку);
	
	ЗаданиеВыполнено = Ложь;	
	ОбъектОбр = РеквизитФормыВЗначение("Объект");
	НачальноеКоличествоОшибок = ОбъектОбр.ТаблицаОшибок.Количество(); 
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() И НЕ БюджетнаяКлассификацияПереопределяемый.ВозможноИспользованиеФоновыхЗаданийВФайловойБазе() Тогда
		
		ФоновыеЗаданияБюджетнаяКлассификация.ЗагрузитьКомплектВОбщемМодуле(ПараметрыОбработки, АдресХранилища);
		ЗагрузитьПодготовленныеДанные();
		
		Возврат Истина;	
		
	КонецЕсли;		
	
	НаименованиеЗадания = НСтр("ru = 'Импорт бюджетных классификаторов'");
	
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(ПараметрыОбработки);
	ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилища);
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
	
	Задание = ФоновыеЗадания.Выполнить(
	"ФоновыеЗаданияБюджетнаяКлассификация.ЗагрузитьКомплектВОбщемМодуле", 
	ПараметрыЭкспортнойПроцедуры, , НаименованиеЗадания);
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение		
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
	
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		ЗаданиеВыполнено = Истина; 
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;	
	Возврат ЗаданиеВыполнено;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗагрузку(Знач НомерСтроки)
	
	ЗаданиеВыполнено = ЗагрузитьКомплект(НомерСтроки);
	Если ЗаданиеВыполнено Тогда
		Прогресс = Прогресс + 1;	
		ОчередьОбновлений.Удалить(0);
		ЗапланироватьЗагрузкуОбновленияИзОчереди();
		Возврат;
	КонецЕсли;
	
	ПараметрыОбработчикаОжидания = Новый Структура(
	"МинимальныйИнтервал,
	|МаксимальныйИнтервал,
	|ТекущийИнтервал,
	|КоэффициентУвеличенияИнтервала", 
	1, 15, 1, 1.4);
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация",
	Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания), ЭтаФорма);
	
КонецПроцедуры		

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	КолОш = 0;	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Свойство("ТаблицаОшибок") Тогда
			ТекДеревоОшибок = РеквизитФормыВЗначение("ДеревоОшибок");
			
			ТекТаблицаОшибок = Результат.ТаблицаОшибок;
			
			КолОш = ТекТаблицаОшибок.Количество();
			ЭтоПервый = Истина;
			ТекИмя = "";
			СтрокаСпр = Неопределено;
			Для Каждого СтрТЧ Из ТекТаблицаОшибок Цикл
				Если ЭтоПервый Тогда
					СтрокаОбновления = ТекДеревоОшибок.Строки.Добавить();
					СтрокаОбновления.ВидОбновленияИмяСпр = СтрТЧ.ЗагружаемыеДанные;
					ЭтоПервый = Ложь;
				КонецЕсли;
				Если ТекИмя<>СтрТЧ.ИмяОбъекта ИЛИ СтрокаСпр = Неопределено Тогда
					СтрокаСпр = СтрокаОбновления.Строки.Найти(СтрТЧ.ИмяОбъекта,"ВидОбновленияИмяСпр");
					Если СтрокаСпр = Неопределено Тогда
						СтрокаСпр = СтрокаОбновления.Строки.Добавить();
						СтрокаСпр.ВидОбновленияИмяСпр = СтрТЧ.ИмяОбъекта;
					КонецЕсли;
				КонецЕсли;
				ДетальнаяСтрока = СтрокаСпр.Строки.Добавить();
				ДетальнаяСтрока.ВидОбновленияИмяСпр = СтрТЧ.ОписаниеОшибки;
				ДетальнаяСтрока.СсылкаНаОшибку = СтрТЧ.СсылкаНаЭлементОшибки;
				
				ЗаполнитьЗначенияСвойств(Объект.ТаблицаОшибок.Добавить(),СтрТЧ);
				ТекИмя=СтрТЧ.ИмяОбъекта;
			КонецЦикла;
			
			ТекСтруктура = Новый Структура("ВидОбновленияИмяСпр,СсылкаНаОшибку",Неопределено,Неопределено);
			Для Каждого СтрО Из ТекДеревоОшибок.Строки Цикл
				Для Каждого СтрСпр Из СтрО.Строки Цикл
					МассивУд = Новый Массив;
					Для Каждого СтрДет Из СтрСпр.Строки Цикл
						Если ТекСтруктура.ВидОбновленияИмяСпр = СтрДет.ВидОбновленияИмяСпр 
							И ТекСтруктура.СсылкаНаОшибку = СтрДет.СсылкаНаОшибку Тогда
							МассивУд.Добавить(СтрДет);
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(ТекСтруктура,СтрДет);
					КонецЦикла;	
					Для Каждого СтрМ Из МассивУд Цикл
						СтрСпр.Строки.Удалить(СтрМ);	
					КонецЦикла;
				КонецЦикла;				
			КонецЦикла;
			
			ЗначениеВРеквизитФормы(ТекДеревоОшибок,"ДеревоОшибок");
			
		КонецЕсли;
		Если Результат.Свойство("ТаблицаИнформации") Тогда
			ТекДеревоИнф = РеквизитФормыВЗначение("ДеревоИнформации");
			ТекТаблицаИнформации = Результат.ТаблицаИнформации;
			ТекТаблицаИнформации.Свернуть("ИмяОбъекта,СсылкаНаЭлементОшибки,ОписаниеОшибки,ЗагружаемыеДанные");
			ЭтоПервый = Истина;
			ТекИмя = "";
			СтрокаСпр = Неопределено;
			Для Каждого СтрТЧ Из ТекТаблицаИнформации Цикл
				Если ЭтоПервый Тогда
					СтрокаОбновления = ТекДеревоИнф.Строки.Добавить();
					СтрокаОбновления.ВидОбновленияИмяСпр = СтрТЧ.ЗагружаемыеДанные;
					ЭтоПервый = Ложь;
				КонецЕсли;
				Если ТекИмя<>СтрТЧ.ИмяОбъекта ИЛИ СтрокаСпр = Неопределено Тогда
					СтрокаСпр = СтрокаОбновления.Строки.Найти(СтрТЧ.ИмяОбъекта,"ВидОбновленияИмяСпр");
					Если СтрокаСпр = Неопределено Тогда
						СтрокаСпр = СтрокаОбновления.Строки.Добавить();
						СтрокаСпр.ВидОбновленияИмяСпр = СтрТЧ.ИмяОбъекта;
					КонецЕсли;
				КонецЕсли;
				ДетальнаяСтрока = СтрокаСпр.Строки.Добавить();
				ДетальнаяСтрока.ВидОбновленияИмяСпр = СтрТЧ.ОписаниеОшибки;
				ДетальнаяСтрока.СсылкаНаОшибку = СтрТЧ.СсылкаНаЭлементОшибки;
				
				ЗаполнитьЗначенияСвойств(Объект.ТаблицаИнформации.Добавить(),СтрТЧ);
				ТекИмя=СтрТЧ.ИмяОбъекта;
			КонецЦикла;
			
			ТекСтруктура = Новый Структура("ВидОбновленияИмяСпр,СсылкаНаОшибку",Неопределено,Неопределено);
			Для Каждого СтрО Из ТекДеревоИнф.Строки Цикл
				Для Каждого СтрСпр Из СтрО.Строки Цикл
					МассивУд = Новый Массив;
					Для Каждого СтрДет Из СтрСпр.Строки Цикл
						Если ТекСтруктура.ВидОбновленияИмяСпр = СтрДет.ВидОбновленияИмяСпр 
							И ТекСтруктура.СсылкаНаОшибку = СтрДет.СсылкаНаОшибку Тогда
							МассивУд.Добавить(СтрДет);
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(ТекСтруктура,СтрДет);
					КонецЦикла;
					Для Каждого СтрМ Из МассивУд Цикл
						СтрСпр.Строки.Удалить(СтрМ);	
					КонецЦикла;
				КонецЦикла;				
			КонецЦикла;
			
			ЗначениеВРеквизитФормы(ТекДеревоИнф,"ДеревоИнформации");
		КонецЕсли;
		
		Если Результат.Свойство("ДанныеДляАктуализацииКПС") Тогда
			Если КолОш = 0 ИЛИ Объект.ЗагружатьСОшибками Тогда
				ТекТаблицаДляКПС = Результат.ДанныеДляАктуализацииКПС;
				Для Каждого СтрТЧ Из ТекТаблицаДляКПС Цикл
					ЗаполнитьЗначенияСвойств(Объект.ДанныеДляАктуализацииКПС.Добавить(),СтрТЧ);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ АктуализацияВыполнялась Тогда	
		Если КолОш>0 Тогда	
			Если Объект.ОтменятьЗагрузку Тогда
				Текст = Нстр("ru='При тестировании загрузки были обнаружены ошибки: %1. 
				|Перед реальной загрузкой рекомендуется исправить имеющиеся ошибки.'");
			ИначеЕсли Объект.ЗагружатьСОшибками Тогда
				Текст = Нстр("ru='При загрузке были ошибки: %1. Загружено с ошибками.'");
			Иначе
				Текст = Нстр("ru='При загрузке были ошибки: %1. Не загружено.'");
			КонецЕсли;
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст,КолОш);
		Иначе
			Если Объект.ОтменятьЗагрузку Тогда
				Текст = Нстр("ru='При тестировании загрузки ошибок не обнаружено.'");
			Иначе
				Текст = Нстр("ru='Загружено. Ошибок нет.'");
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если КолОш>0 Тогда
			Текст = Нстр("ru='При актуализации КПС были обнаружены ошибки: %1.'");
		Иначе
			Текст = Нстр("ru='Актуализация выполнена. Ошибок нет.'");
		КонецЕсли;
	КонецЕсли;
	
	Если Протокол.КоличествоСтрок() > 0 Тогда
		Протокол.ДобавитьСтроку("");
	КонецЕсли;	
	Протокол.ДобавитьСтроку(Текст);
	
	// В этой процедуре выполняются действия после загрузки комплекта на сервере.
	БюджетнаяКлассификацияПереопределяемый.ВыполнитьДействияПослеЗагрузкиКомплекта(ИсточникДанных);
	
КонецПроцедуры

//длительные операции конец

&НаСервере
Процедура ПроверитьДублиКлассификаторов()
	
	ТекстЗапроса = "";
	
	ЕстьЗапросКВидамРасходовКРБ 	= Ложь;
	ЕстьЗапросКГлавамПоБК 			= Ложь;
	ЕстьЗапросРазделыПодразделыКРБ 	= Ложь;
	ЕстьЗапросКРБ 					= Ложь;
	ЕстьЗапросКДБ 					= Ложь;
	ЕстьЗапросКИФ 					= Ложь;
	
	Текст = "";
	
	Для Каждого СтрокаВендора Из ДоступныеОбновления.ПолучитьЭлементы() Цикл
		Если НЕ СтрокаВендора.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого СтрокаГруппы Из СтрокаВендора.ПолучитьЭлементы() Цикл
			Если НЕ СтрокаГруппы.Пометка Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого СтрокаОбновления Из СтрокаГруппы.ПолучитьЭлементы() Цикл
				Если НЕ СтрокаОбновления.Пометка Тогда
					Продолжить;
				КонецЕсли;
				Если СтрокаОбновления.Тип = "urn:rels-1c-ru:budget:classification/kdb16-catalog" И НЕ ЕстьЗапросКДБ Тогда
					ЗагружаемыеДанные = "КДБ";
					ЕстьЗапросКДБ = Истина;
					Если ЗначениеЗаполнено(Текст) Тогда
						Текст = Текст + ";
						|
						|////////////////////////////////////////////////////////////////////////////////
						|";
					КонецЕсли;
					Текст = Текст + "
					|ВЫБРАТЬ
					|	ВидыДоходовКДБ.ДатаНачалаДействия,
					|	ВидыДоходовКДБ.ДатаОкончанияДействия,
					|	ВидыДоходовКДБ.ОкончаниеДействия,
					|	ВидыДоходовКДБ.Ссылка,
					|	ВидыДоходовКДБ.Код,
					|	ВидыДоходовКДБ.Наименование
					|ПОМЕСТИТЬ ВремВидыДоходовКДБ
					|ИЗ
					|	Справочник.ВидыДоходовКДБ КАК ВидыДоходовКДБ
					|ГДЕ
					|	ВидыДоходовКДБ.ПометкаУдаления = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВложенныйЗапрос.ДатаНачалаДействия,
					|	ВложенныйЗапрос.ДатаОкончанияДействия,
					|	ВложенныйЗапрос.Наименование,
					|	ВложенныйЗапрос.Код,
					|	ВремВидыДоходовКДБ.Ссылка
					|ИЗ
					|	(ВЫБРАТЬ
					|		ВремВидыДоходовКДБ.ДатаНачалаДействия КАК ДатаНачалаДействия,
					|		ВремВидыДоходовКДБ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
					|		ВремВидыДоходовКДБ.ОкончаниеДействия КАК ОкончаниеДействия,
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремВидыДоходовКДБ.Ссылка) КАК Количество,
					|		ВремВидыДоходовКДБ.Код КАК Код,
					|		ВремВидыДоходовКДБ.Наименование КАК Наименование
					|	ИЗ
					|		ВремВидыДоходовКДБ КАК ВремВидыДоходовКДБ
					|	
					|	СГРУППИРОВАТЬ ПО
					|		ВремВидыДоходовКДБ.ДатаНачалаДействия,
					|		ВремВидыДоходовКДБ.ДатаОкончанияДействия,
					|		ВремВидыДоходовКДБ.ОкончаниеДействия,
					|		ВремВидыДоходовКДБ.Код,
					|		ВремВидыДоходовКДБ.Наименование
					|	
					|	ИМЕЮЩИЕ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремВидыДоходовКДБ.Ссылка) > 1) КАК ВложенныйЗапрос
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВремВидыДоходовКДБ КАК ВремВидыДоходовКДБ
					|		ПО ВложенныйЗапрос.ДатаНачалаДействия = ВремВидыДоходовКДБ.ДатаНачалаДействия
					|			И ВложенныйЗапрос.ДатаОкончанияДействия = ВремВидыДоходовКДБ.ДатаОкончанияДействия
					|			И ВложенныйЗапрос.ОкончаниеДействия = ВремВидыДоходовКДБ.ОкончаниеДействия
					|			И ВложенныйЗапрос.Наименование = ВремВидыДоходовКДБ.Наименование
					|			И ВложенныйЗапрос.Код = ВремВидыДоходовКДБ.Код
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ГруппыПодвидовКДБ.Ссылка,
					|	ГруппыПодвидовКДБ.Код,
					|	ГруппыПодвидовКДБ.Наименование,
					|	ГруппыПодвидовКДБ.ВидДохода,
					|	ГруппыПодвидовКДБ.ВидДохода.ДатаНачалаДействия КАК ДатаНачалаДействия,
					|	ГруппыПодвидовКДБ.ВидДохода.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
					|	ГруппыПодвидовКДБ.ВидДохода.ОкончаниеДействия КАК ОкончаниеДействия
					|ПОМЕСТИТЬ ВремГруппыПодвидовКДБ
					|ИЗ
					|	Справочник.ГруппыПодвидовКДБ КАК ГруппыПодвидовКДБ
					|ГДЕ
					|	ГруппыПодвидовКДБ.Бюджет = &Бюджет
					|	И ГруппыПодвидовКДБ.ПометкаУдаления = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВложенныйЗапрос.Наименование,
					|	ВложенныйЗапрос.Код,
					|	ВремГруппыПодвидовКДБ.Ссылка,
					|	ВложенныйЗапрос.ДатаНачалаДействия,
					|	ВложенныйЗапрос.ДатаОкончанияДействия
					|ИЗ
					|	(ВЫБРАТЬ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремГруппыПодвидовКДБ.Ссылка) КАК Количество,
					|		ВремГруппыПодвидовКДБ.Код КАК Код,
					|		ВремГруппыПодвидовКДБ.Наименование КАК Наименование,
					|		ВремГруппыПодвидовКДБ.ВидДохода КАК ВидДохода,
					|		ВремГруппыПодвидовКДБ.ДатаНачалаДействия,
					|		ВремГруппыПодвидовКДБ.ДатаОкончанияДействия,
					|		ВремГруппыПодвидовКДБ.ОкончаниеДействия
					|	ИЗ
					|		ВремГруппыПодвидовКДБ КАК ВремГруппыПодвидовКДБ
					|	
					|	СГРУППИРОВАТЬ ПО
					|		ВремГруппыПодвидовКДБ.Код,
					|		ВремГруппыПодвидовКДБ.Наименование,
					|		ВремГруппыПодвидовКДБ.ВидДохода,
					|		ВремГруппыПодвидовКДБ.ДатаНачалаДействия,
					|		ВремГруппыПодвидовКДБ.ДатаОкончанияДействия,
					|		ВремГруппыПодвидовКДБ.ОкончаниеДействия
					|	
					|	ИМЕЮЩИЕ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремГруппыПодвидовКДБ.Ссылка) > 1) КАК ВложенныйЗапрос
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВремГруппыПодвидовКДБ КАК ВремГруппыПодвидовКДБ
					|		ПО ВложенныйЗапрос.Наименование = ВремГруппыПодвидовКДБ.Наименование
					|			И ВложенныйЗапрос.Код = ВремГруппыПодвидовКДБ.Код
					|			И ВложенныйЗапрос.ВидДохода = ВремГруппыПодвидовКДБ.ВидДохода
					|			И ВложенныйЗапрос.ДатаНачалаДействия = ВремГруппыПодвидовКДБ.ДатаНачалаДействия
					|			И ВложенныйЗапрос.ДатаОкончанияДействия = ВремГруппыПодвидовКДБ.ДатаОкончанияДействия
					|			И ВложенныйЗапрос.ОкончаниеДействия = ВремГруппыПодвидовКДБ.ОкончаниеДействия";
					
				ИначеЕсли СтрокаОбновления.Тип = "urn:rels-1c-ru:budget:classification/cs-catalog" И НЕ ЕстьЗапросКРБ Тогда
					ЗагружаемыеДанные = "КРБ";
					ЕстьЗапросКРБ = Истина;
					Если ЗначениеЗаполнено(Текст) Тогда
						Текст = Текст + ";
						|
						|////////////////////////////////////////////////////////////////////////////////
						|";
					КонецЕсли;
					Текст = Текст + "ВЫБРАТЬ
					|	ЦелевыеСтатьиКРБ.ДатаНачалаДействия,
					|	ЦелевыеСтатьиКРБ.ДатаОкончанияДействия,
					|	ЦелевыеСтатьиКРБ.ОкончаниеДействия,
					|	ЦелевыеСтатьиКРБ.Ссылка,
					|	ЦелевыеСтатьиКРБ.Код,
					|	ЦелевыеСтатьиКРБ.Наименование
					|ПОМЕСТИТЬ ВремЦелевыеСтатьиКРБ
					|ИЗ
					|	Справочник.ЦелевыеСтатьиКРБ КАК ЦелевыеСтатьиКРБ
					|ГДЕ
					|	ЦелевыеСтатьиКРБ.Бюджет = &Бюджет
					|	И ЦелевыеСтатьиКРБ.ПометкаУдаления = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВложенныйЗапрос.ДатаНачалаДействия,
					|	ВложенныйЗапрос.ДатаОкончанияДействия,
					|	ВложенныйЗапрос.Наименование,
					|	ВложенныйЗапрос.Код,
					|	ВремЦелевыеСтатьиКРБ.Ссылка
					|ИЗ
					|	(ВЫБРАТЬ
					|		ВремЦелевыеСтатьиКРБ.ДатаНачалаДействия КАК ДатаНачалаДействия,
					|		ВремЦелевыеСтатьиКРБ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
					|		ВремЦелевыеСтатьиКРБ.ОкончаниеДействия КАК ОкончаниеДействия,
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремЦелевыеСтатьиКРБ.Ссылка) КАК Количество,
					|		ВремЦелевыеСтатьиКРБ.Код КАК Код,
					|		ВремЦелевыеСтатьиКРБ.Наименование КАК Наименование
					|	ИЗ
					|		ВремЦелевыеСтатьиКРБ КАК ВремЦелевыеСтатьиКРБ
					|	
					|	СГРУППИРОВАТЬ ПО
					|		ВремЦелевыеСтатьиКРБ.ДатаНачалаДействия,
					|		ВремЦелевыеСтатьиКРБ.ДатаОкончанияДействия,
					|		ВремЦелевыеСтатьиКРБ.ОкончаниеДействия,
					|		ВремЦелевыеСтатьиКРБ.Код,
					|		ВремЦелевыеСтатьиКРБ.Наименование
					|	
					|	ИМЕЮЩИЕ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремЦелевыеСтатьиКРБ.Ссылка) > 1) КАК ВложенныйЗапрос
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВремЦелевыеСтатьиКРБ КАК ВремЦелевыеСтатьиКРБ
					|		ПО ВложенныйЗапрос.ДатаНачалаДействия = ВремЦелевыеСтатьиКРБ.ДатаНачалаДействия
					|			И ВложенныйЗапрос.ДатаОкончанияДействия = ВремЦелевыеСтатьиКРБ.ДатаОкончанияДействия
					|			И ВложенныйЗапрос.ОкончаниеДействия = ВремЦелевыеСтатьиКРБ.ОкончаниеДействия
					|			И ВложенныйЗапрос.Код = ВремЦелевыеСтатьиКРБ.Код
					|			И ВложенныйЗапрос.Наименование = ВремЦелевыеСтатьиКРБ.Наименование
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ПрограммыЦелевыхСтатейКРБ.ДатаНачалаДействия,
					|	ПрограммыЦелевыхСтатейКРБ.ДатаОкончанияДействия,
					|	ПрограммыЦелевыхСтатейКРБ.ОкончаниеДействия,
					|	ПрограммыЦелевыхСтатейКРБ.Ссылка,
					|	ПрограммыЦелевыхСтатейКРБ.Код,
					|	ПрограммыЦелевыхСтатейКРБ.Наименование
					|ПОМЕСТИТЬ ВремПрограммыЦелевыхСтатейКРБ
					|ИЗ
					|	Справочник.ПрограммыЦелевыхСтатейКРБ КАК ПрограммыЦелевыхСтатейКРБ
					|ГДЕ
					|	ПрограммыЦелевыхСтатейКРБ.Бюджет = &Бюджет
					|	И ПрограммыЦелевыхСтатейКРБ.ПометкаУдаления = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВложенныйЗапрос.ДатаНачалаДействия,
					|	ВложенныйЗапрос.ДатаОкончанияДействия,
					|	ВложенныйЗапрос.Наименование,
					|	ВложенныйЗапрос.Код,
					|	ПрограммыЦелевыхСтатейКРБ.Ссылка
					|ИЗ
					|	(ВЫБРАТЬ
					|		ПрограммыЦелевыхСтатейКРБ.ДатаНачалаДействия КАК ДатаНачалаДействия,
					|		ПрограммыЦелевыхСтатейКРБ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
					|		ПрограммыЦелевыхСтатейКРБ.ОкончаниеДействия КАК ОкончаниеДействия,
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПрограммыЦелевыхСтатейКРБ.Ссылка) КАК Количество,
					|		ПрограммыЦелевыхСтатейКРБ.Код КАК Код,
					|		ПрограммыЦелевыхСтатейКРБ.Наименование КАК Наименование
					|	ИЗ
					|		ВремПрограммыЦелевыхСтатейКРБ КАК ПрограммыЦелевыхСтатейКРБ
					|	
					|	СГРУППИРОВАТЬ ПО
					|		ПрограммыЦелевыхСтатейКРБ.ДатаНачалаДействия,
					|		ПрограммыЦелевыхСтатейКРБ.ДатаОкончанияДействия,
					|		ПрограммыЦелевыхСтатейКРБ.ОкончаниеДействия,
					|		ПрограммыЦелевыхСтатейКРБ.Код,
					|		ПрограммыЦелевыхСтатейКРБ.Наименование
					|	
					|	ИМЕЮЩИЕ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПрограммыЦелевыхСтатейКРБ.Ссылка) > 1) КАК ВложенныйЗапрос
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВремПрограммыЦелевыхСтатейКРБ КАК ПрограммыЦелевыхСтатейКРБ
					|		ПО ВложенныйЗапрос.ДатаНачалаДействия = ПрограммыЦелевыхСтатейКРБ.ДатаНачалаДействия
					|			И ВложенныйЗапрос.ДатаОкончанияДействия = ПрограммыЦелевыхСтатейКРБ.ДатаОкончанияДействия
					|			И ВложенныйЗапрос.ОкончаниеДействия = ПрограммыЦелевыхСтатейКРБ.ОкончаниеДействия
					|			И ВложенныйЗапрос.Наименование = ПрограммыЦелевыхСтатейКРБ.Наименование
					|			И ВложенныйЗапрос.Код = ПрограммыЦелевыхСтатейКРБ.Код";
					
				ИначеЕсли СтрокаОбновления.Тип = "urn:rels-1c-ru:budget:classification/kif-catalog" И НЕ ЕстьЗапросКИФ Тогда
					ЗагружаемыеДанные = "КИФ";
					
					ЕстьЗапросКИФ = Истина;
					Если ЗначениеЗаполнено(Текст) Тогда
						Текст = Текст + ";
						|
						|////////////////////////////////////////////////////////////////////////////////
						|";
					КонецЕсли;
					Текст = Текст + "ВЫБРАТЬ
					|	ГруппыПодгруппыКИФ.Ссылка,
					|	ГруппыПодгруппыКИФ.Код,
					|	ГруппыПодгруппыКИФ.Наименование
					|ПОМЕСТИТЬ ВремГруппыПодгруппыКИФ
					|ИЗ
					|	Справочник.ГруппыПодгруппыКИФ КАК ГруппыПодгруппыКИФ
					|ГДЕ
					|	ГруппыПодгруппыКИФ.ПометкаУдаления = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВложенныйЗапрос.Наименование,
					|	ВложенныйЗапрос.Код,
					|	ВремГруппыПодгруппыКИФ.Ссылка
					|ИЗ
					|	(ВЫБРАТЬ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремГруппыПодгруппыКИФ.Ссылка) КАК Количество,
					|		ВремГруппыПодгруппыКИФ.Код КАК Код,
					|		ВремГруппыПодгруппыКИФ.Наименование КАК Наименование
					|	ИЗ
					|		ВремГруппыПодгруппыКИФ КАК ВремГруппыПодгруппыКИФ
					|	
					|	СГРУППИРОВАТЬ ПО
					|		ВремГруппыПодгруппыКИФ.Код,
					|		ВремГруппыПодгруппыКИФ.Наименование
					|	
					|	ИМЕЮЩИЕ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремГруппыПодгруппыКИФ.Ссылка) > 1) КАК ВложенныйЗапрос
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВремГруппыПодгруппыКИФ КАК ВремГруппыПодгруппыКИФ
					|		ПО ВложенныйЗапрос.Код = ВремГруппыПодгруппыКИФ.Код
					|			И ВложенныйЗапрос.Наименование = ВремГруппыПодгруппыКИФ.Наименование
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	СтатьиКИФ.ДатаНачалаДействия,
					|	СтатьиКИФ.ДатаОкончанияДействия,
					|	СтатьиКИФ.ОкончаниеДействия,
					|	СтатьиКИФ.Ссылка,
					|	СтатьиКИФ.Код,
					|	СтатьиКИФ.Наименование
					|ПОМЕСТИТЬ ВремСтатьиКИФ
					|ИЗ
					|	Справочник.СтатьиКИФ КАК СтатьиКИФ
					|ГДЕ
					|	СтатьиКИФ.Бюджет = &Бюджет
					|	И СтатьиКИФ.ПометкаУдаления = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВложенныйЗапрос.ДатаНачалаДействия,
					|	ВложенныйЗапрос.ДатаОкончанияДействия,
					|	ВложенныйЗапрос.Наименование,
					|	ВложенныйЗапрос.Код,
					|	ВремСтатьиКИФ.Ссылка
					|ИЗ
					|	(ВЫБРАТЬ
					|		ВремСтатьиКИФ.ДатаНачалаДействия КАК ДатаНачалаДействия,
					|		ВремСтатьиКИФ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
					|		ВремСтатьиКИФ.ОкончаниеДействия КАК ОкончаниеДействия,
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремСтатьиКИФ.Ссылка) КАК Количество,
					|		ВремСтатьиКИФ.Код КАК Код,
					|		ВремСтатьиКИФ.Наименование КАК Наименование
					|	ИЗ
					|		ВремСтатьиКИФ КАК ВремСтатьиКИФ
					|	
					|	СГРУППИРОВАТЬ ПО
					|		ВремСтатьиКИФ.ДатаНачалаДействия,
					|		ВремСтатьиКИФ.ДатаОкончанияДействия,
					|		ВремСтатьиКИФ.ОкончаниеДействия,
					|		ВремСтатьиКИФ.Код,
					|		ВремСтатьиКИФ.Наименование
					|	
					|	ИМЕЮЩИЕ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремСтатьиКИФ.Ссылка) > 1) КАК ВложенныйЗапрос
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВремСтатьиКИФ КАК ВремСтатьиКИФ
					|		ПО ВложенныйЗапрос.ДатаНачалаДействия = ВремСтатьиКИФ.ДатаНачалаДействия
					|			И ВложенныйЗапрос.ДатаОкончанияДействия = ВремСтатьиКИФ.ДатаОкончанияДействия
					|			И ВложенныйЗапрос.ОкончаниеДействия = ВремСтатьиКИФ.ОкончаниеДействия
					|			И ВложенныйЗапрос.Наименование = ВремСтатьиКИФ.Наименование
					|			И ВложенныйЗапрос.Код = ВремСтатьиКИФ.Код
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВидыКИФ.Ссылка,
					|	ВидыКИФ.Код,
					|	ВидыКИФ.Наименование
					|ПОМЕСТИТЬ ВремВидыКИФ
					|ИЗ
					|	Справочник.ВидыКИФ КАК ВидыКИФ
					|ГДЕ
					|	ВидыКИФ.Бюджет = &Бюджет
					|	И ВидыКИФ.ПометкаУдаления = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВложенныйЗапрос.Наименование,
					|	ВложенныйЗапрос.Код,
					|	ВидыКИФ.Ссылка
					|ИЗ
					|	(ВЫБРАТЬ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидыКИФ.Ссылка) КАК Количество,
					|		ВидыКИФ.Код КАК Код,
					|		ВидыКИФ.Наименование КАК Наименование
					|	ИЗ
					|		ВремВидыКИФ КАК ВидыКИФ
					|	
					|	СГРУППИРОВАТЬ ПО
					|		ВидыКИФ.Код,
					|		ВидыКИФ.Наименование
					|	
					|	ИМЕЮЩИЕ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидыКИФ.Ссылка) > 1) КАК ВложенныйЗапрос
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВремВидыКИФ КАК ВидыКИФ
					|		ПО ВложенныйЗапрос.Наименование = ВидыКИФ.Наименование
					|			И ВложенныйЗапрос.Код = ВидыКИФ.Код";
					
				ИначеЕсли СтрокаОбновления.Тип = "urn:rels-1c-ru:budget:classification/adm-catalog" И НЕ ЕстьЗапросКГлавамПоБК Тогда
					ЗагружаемыеДанные = "Главы по БК";
					ЕстьЗапросКГлавамПоБК = Истина;
					Если ЗначениеЗаполнено(Текст) Тогда
						Текст = Текст + ";
						|
						|////////////////////////////////////////////////////////////////////////////////
						|";
					КонецЕсли;
					Текст = Текст + "ВЫБРАТЬ
					|	ГлавыПоБюджетнойКлассификации.ДатаНачалаДействия,
					|	ГлавыПоБюджетнойКлассификации.ДатаОкончанияДействия,
					|	ГлавыПоБюджетнойКлассификации.ОкончаниеДействия,
					|	ГлавыПоБюджетнойКлассификации.Ссылка,
					|	ГлавыПоБюджетнойКлассификации.Код
					|ПОМЕСТИТЬ ВремГлавыПоБК
					|ИЗ
					|	Справочник.ГлавыПоБюджетнойКлассификации КАК ГлавыПоБюджетнойКлассификации
					|ГДЕ
					|	ГлавыПоБюджетнойКлассификации.Бюджет = &Бюджет
					|	И ГлавыПоБюджетнойКлассификации.ПометкаУдаления = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВложенныйЗапрос.ДатаНачалаДействия,
					|	ВложенныйЗапрос.ДатаОкончанияДействия,
					|	ВложенныйЗапрос.Код,
					|	ВремГлавыПоБК.Ссылка
					|ИЗ
					|	(ВЫБРАТЬ
					|		ВремГлавыПоБК.ДатаНачалаДействия КАК ДатаНачалаДействия,
					|		ВремГлавыПоБК.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
					|		ВремГлавыПоБК.ОкончаниеДействия КАК ОкончаниеДействия,
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремГлавыПоБК.Ссылка) КАК Количество,
					|		ВремГлавыПоБК.Код КАК Код
					|	ИЗ
					|		ВремГлавыПоБК КАК ВремГлавыПоБК
					|	
					|	СГРУППИРОВАТЬ ПО
					|		ВремГлавыПоБК.ДатаНачалаДействия,
					|		ВремГлавыПоБК.ДатаОкончанияДействия,
					|		ВремГлавыПоБК.ОкончаниеДействия,
					|		ВремГлавыПоБК.Код
					|	
					|	ИМЕЮЩИЕ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремГлавыПоБК.Ссылка) > 1) КАК ВложенныйЗапрос
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВремГлавыПоБК КАК ВремГлавыПоБК
					|		ПО ВложенныйЗапрос.ДатаНачалаДействия = ВремГлавыПоБК.ДатаНачалаДействия
					|			И ВложенныйЗапрос.ДатаОкончанияДействия = ВремГлавыПоБК.ДатаОкончанияДействия
					|			И ВложенныйЗапрос.ОкончаниеДействия = ВремГлавыПоБК.ОкончаниеДействия
					|			И ВложенныйЗапрос.Код = ВремГлавыПоБК.Код";
					
				ИначеЕсли СтрокаОбновления.Тип = "urn:rels-1c-ru:budget:classification/rzpr-catalog" И НЕ ЕстьЗапросРазделыПодразделыКРБ Тогда
					ЗагружаемыеДанные = "Разделы, подразделы КРБ";
					ЕстьЗапросРазделыПодразделыКРБ = Истина;
					Если ЗначениеЗаполнено(Текст) Тогда
						Текст = Текст + ";
						|
						|////////////////////////////////////////////////////////////////////////////////
						|";
					КонецЕсли;
					Текст = Текст + "ВЫБРАТЬ
					|	РазделыПодразделыКРБ.Ссылка,
					|	РазделыПодразделыКРБ.Код
					|ПОМЕСТИТЬ ВремРазделыПодразделыКРБ
					|ИЗ
					|	Справочник.РазделыПодразделыКРБ КАК РазделыПодразделыКРБ
					|ГДЕ
					|	РазделыПодразделыКРБ.ПометкаУдаления = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВремРазделыПодразделыКРБ.Ссылка,
					|	ВложенныйЗапрос.Код
					|ИЗ
					|	(ВЫБРАТЬ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремРазделыПодразделыКРБ.Ссылка) КАК Количество,
					|		ВремРазделыПодразделыКРБ.Код КАК Код
					|	ИЗ
					|		ВремРазделыПодразделыКРБ КАК ВремРазделыПодразделыКРБ
					|	
					|	СГРУППИРОВАТЬ ПО
					|		ВремРазделыПодразделыКРБ.Код
					|	
					|	ИМЕЮЩИЕ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремРазделыПодразделыКРБ.Ссылка) > 1) КАК ВложенныйЗапрос
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВремРазделыПодразделыКРБ КАК ВремРазделыПодразделыКРБ
					|		ПО ВложенныйЗапрос.Код = ВремРазделыПодразделыКРБ.Код";
					
				ИначеЕсли СтрокаОбновления.Тип = "urn:rels-1c-ru:budget:classification/vr-catalog" И НЕ ЕстьЗапросКВидамРасходовКРБ Тогда
					ЗагружаемыеДанные = "Виды расходов КРБ";
					ЕстьЗапросКВидамРасходовКРБ = Истина;
					Если ЗначениеЗаполнено(Текст) Тогда
						Текст = Текст + ";
						|
						|////////////////////////////////////////////////////////////////////////////////
						|";
					КонецЕсли;
					Текст = Текст + "ВЫБРАТЬ
					|	ВидыРасходовКРБ.ДатаНачалаДействия,
					|	ВидыРасходовКРБ.ДатаОкончанияДействия,
					|	ВидыРасходовКРБ.ОкончаниеДействия,
					|	ВидыРасходовКРБ.Ссылка,
					|	ВидыРасходовКРБ.Код
					|ПОМЕСТИТЬ ВремВидыРасходовКРБ
					|ИЗ
					|	Справочник.ВидыРасходовКРБ КАК ВидыРасходовКРБ
					|ГДЕ
					|	ВидыРасходовКРБ.Бюджет = &Бюджет
					|	И ВидыРасходовКРБ.ПометкаУдаления = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВложенныйЗапрос.ДатаНачалаДействия,
					|	ВложенныйЗапрос.ДатаОкончанияДействия,
					|	ВложенныйЗапрос.Код,
					|	ВремВидыРасходовКРБ.Ссылка
					|ИЗ
					|	(ВЫБРАТЬ
					|		ВремВидыРасходовКРБ.ДатаНачалаДействия КАК ДатаНачалаДействия,
					|		ВремВидыРасходовКРБ.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
					|		ВремВидыРасходовКРБ.ОкончаниеДействия КАК ОкончаниеДействия,
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремВидыРасходовКРБ.Ссылка) КАК Количество,
					|		ВремВидыРасходовКРБ.Код КАК Код
					|	ИЗ
					|		ВремВидыРасходовКРБ КАК ВремВидыРасходовКРБ
					|	
					|	СГРУППИРОВАТЬ ПО
					|		ВремВидыРасходовКРБ.ДатаНачалаДействия,
					|		ВремВидыРасходовКРБ.ДатаОкончанияДействия,
					|		ВремВидыРасходовКРБ.ОкончаниеДействия,
					|		ВремВидыРасходовКРБ.Код
					|	
					|	ИМЕЮЩИЕ
					|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремВидыРасходовКРБ.Ссылка) > 1) КАК ВложенныйЗапрос
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВремВидыРасходовКРБ КАК ВремВидыРасходовКРБ
					|		ПО ВложенныйЗапрос.ДатаНачалаДействия = ВремВидыРасходовКРБ.ДатаНачалаДействия
					|			И ВложенныйЗапрос.ДатаОкончанияДействия = ВремВидыРасходовКРБ.ДатаОкончанияДействия
					|			И ВложенныйЗапрос.ОкончаниеДействия = ВремВидыРасходовКРБ.ОкончаниеДействия
					|			И ВложенныйЗапрос.Код = ВремВидыРасходовКРБ.Код";
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(Текст) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЕстьЗапросКДБ ИЛИ ЕстьЗапросКИФ Тогда
		Если ЗначениеЗаполнено(Текст) Тогда
			Текст = Текст + ";
			|
			|////////////////////////////////////////////////////////////////////////////////
			|";
		КонецЕсли;
		Текст = Текст + "ВЫБРАТЬ
		|	КОСГУ.Ссылка,
		|	КОСГУ.Код
		|ПОМЕСТИТЬ ВремКОСГУ
		|ИЗ
		|	Справочник.КОСГУ КАК КОСГУ
		|ГДЕ
		|	КОСГУ.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Код,
		|	ВремКОСГУ.Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремКОСГУ.Ссылка) КАК Количество,
		|		ВремКОСГУ.Код КАК Код
		|	ИЗ
		|		ВремКОСГУ КАК ВремКОСГУ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВремКОСГУ.Код
		|	
		|	ИМЕЮЩИЕ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВремКОСГУ.Ссылка) > 1) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВремКОСГУ КАК ВремКОСГУ
		|		ПО ВложенныйЗапрос.Код = ВремКОСГУ.Код";	
	КонецЕсли;
	
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Бюджет", Справочники.Бюджеты.ФедеральныйБюджет);
	Результаты = Запрос.ВыполнитьПакет();
	
	Инд = 2;
	
	Количество = Результаты.Количество();
	
	ТекДерево = РеквизитФормыВЗначение("ДеревоДублей");
	
	ТекДерево.Строки.Очистить();
	
	Пока Инд <= Количество Цикл
		
		ВыборкаДляОбхода = Результаты[Инд-1].Выбрать();
		
		ЭтоПерваяСтрока = Истина;
		
		Инд = Инд + 2;
		
		Пока ВыборкаДляОбхода.Следующий() Цикл
			
			Если ЭтоПерваяСтрока Тогда
				ТекТип = ТипЗнч(ВыборкаДляОбхода.Ссылка);
				ЕстьПериод = Ложь;
				
				Если ТекТип = Тип("СправочникСсылка.РазделыПодразделыКРБ") Тогда
					СтрокаОбновления = ТекДерево.Строки.Добавить();
					СтрокаОбновления.ИмяСправочника = НСтр("ru='Разделы, подразделы классификации расходов'");
					
					СтрокаСправочника = СтрокаОбновления.Строки.Добавить();
					СтрокаСправочника.ИмяСправочника = НСтр("ru='Разделы, подразделы КРБ'");
					РеквизитКода = "Код";
					
				ИначеЕсли ТекТип = Тип("СправочникСсылка.ВидыРасходовКРБ") Тогда
					СтрокаОбновления = ТекДерево.Строки.Добавить();
					СтрокаОбновления.ИмяСправочника = НСтр("ru='Виды расходов'");
					
					СтрокаСправочника = СтрокаОбновления.Строки.Добавить();
					СтрокаСправочника.ИмяСправочника = НСтр("ru='Виды расходов КРБ'");
					РеквизитКода = "Код";
					ЕстьПериод = Истина;
					
				ИначеЕсли ТекТип = Тип("СправочникСсылка.ГлавыПоБюджетнойКлассификации") Тогда
					СтрокаОбновления = ТекДерево.Строки.Добавить();
					СтрокаОбновления.ИмяСправочника = НСтр("ru='Главы по бюджетной классификации'");
					
					СтрокаСправочника = СтрокаОбновления.Строки.Добавить();
					СтрокаСправочника.ИмяСправочника = НСтр("ru='Главы по БК'");
					РеквизитКода = "Код";
					ЕстьПериод = Истина;
					
				ИначеЕсли ТекТип = Тип("СправочникСсылка.ВидыДоходовКДБ") Тогда 
					ТекОбновление = НСтр("ru='Классификация доходов бюджетов'");
					СтруктураПоиска = Новый Структура("ИмяСправочника", ТекОбновление);
					СтрокиПоиска = ТекДерево.Строки.НайтиСтроки(СтруктураПоиска);
					Если СтрокиПоиска.Количество()>0 Тогда 
						СтрокаОбновления = СтрокиПоиска[0];
					Иначе
						СтрокаОбновления = ТекДерево.Строки.Добавить();
						СтрокаОбновления.ИмяСправочника = ТекОбновление;
					КонецЕсли;
					
					СтрокаСправочника = СтрокаОбновления.Строки.Добавить();
					СтрокаСправочника.ИмяСправочника = НСтр("ru='Виды доходов КДБ'");
					РеквизитКода = "Наименование"; 
					ЕстьПериод = Истина;
					
				ИначеЕсли ТекТип = Тип("СправочникСсылка.ГруппыПодвидовКДБ") Тогда
					ТекОбновление = НСтр("ru='Классификация доходов бюджетов'");
					СтруктураПоиска = Новый Структура("ИмяСправочника", ТекОбновление);
					СтрокиПоиска = ТекДерево.Строки.НайтиСтроки(СтруктураПоиска);
					Если СтрокиПоиска.Количество()>0 Тогда 
						СтрокаОбновления = СтрокиПоиска[0];
					Иначе
						СтрокаОбновления = ТекДерево.Строки.Добавить();
						СтрокаОбновления.ИмяСправочника = ТекОбновление;
					КонецЕсли;
					
					СтрокаСправочника = СтрокаОбновления.Строки.Добавить();
					СтрокаСправочника.ИмяСправочника = НСтр("ru='Группы подвидов доходов КДБ'");
					РеквизитКода = "Наименование"; 
					ЕстьПериод = Истина;
					
				ИначеЕсли ТекТип = Тип("СправочникСсылка.ГруппыПодгруппыКИФ") Тогда
					ТекОбновление = НСтр("ru='Классификация источников финансирования дефицитов бюджетов'");
					СтруктураПоиска = Новый Структура("ИмяСправочника",ТекОбновление);
					СтрокиПоиска = ТекДерево.Строки.НайтиСтроки(СтруктураПоиска);
					Если СтрокиПоиска.Количество()>0 Тогда 
						СтрокаОбновления = СтрокиПоиска[0];
					Иначе
						СтрокаОбновления = ТекДерево.Строки.Добавить();
						СтрокаОбновления.ИмяСправочника = ТекОбновление;
					КонецЕсли;
					
					СтрокаСправочника = СтрокаОбновления.Строки.Добавить();
					СтрокаСправочника.ИмяСправочника = НСтр("ru='Группы, подгруппы КИФ'");
					РеквизитКода = "Наименование";
					
				ИначеЕсли ТекТип = Тип("СправочникСсылка.СтатьиКИФ") Тогда
					ТекОбновление = НСтр("ru='Классификация источников финансирования дефицитов бюджетов'");
					СтруктураПоиска = Новый Структура("ИмяСправочника",ТекОбновление);
					СтрокиПоиска = ТекДерево.Строки.НайтиСтроки(СтруктураПоиска);
					Если СтрокиПоиска.Количество()>0 Тогда 
						СтрокаОбновления = СтрокиПоиска[0];
					Иначе
						СтрокаОбновления = ТекДерево.Строки.Добавить();
						СтрокаОбновления.ИмяСправочника = ТекОбновление;
					КонецЕсли;
					
					СтрокаСправочника = СтрокаОбновления.Строки.Добавить();
					СтрокаСправочника.ИмяСправочника = НСтр("ru='Статьи КИФ'");
					РеквизитКода = "Наименование";
					ЕстьПериод = Истина;
					
				ИначеЕсли ТекТип = Тип("СправочникСсылка.ВидыКИФ") Тогда
					ТекОбновление = НСтр("ru='Классификация источников финансирования дефицитов бюджетов'");
					СтруктураПоиска = Новый Структура("ИмяСправочника",ТекОбновление);
					СтрокиПоиска = ТекДерево.Строки.НайтиСтроки(СтруктураПоиска);
					Если СтрокиПоиска.Количество()>0 Тогда 
						СтрокаОбновления = СтрокиПоиска[0];
					Иначе
						СтрокаОбновления = ТекДерево.Строки.Добавить();
						СтрокаОбновления.ИмяСправочника = ТекОбновление;
					КонецЕсли;
					
					СтрокаСправочника = СтрокаОбновления.Строки.Добавить();
					СтрокаСправочника.ИмяСправочника = НСтр("ru='Виды источников КИФ'");
					РеквизитКода = "Наименование";
					
				ИначеЕсли ТекТип = Тип("СправочникСсылка.ЦелевыеСтатьиКРБ") Тогда
					ТекОбновление = НСтр("ru='Целевые статьи расходов'");
					СтруктураПоиска = Новый Структура("ИмяСправочника",ТекОбновление);
					СтрокиПоиска = ТекДерево.Строки.НайтиСтроки(СтруктураПоиска);
					Если СтрокиПоиска.Количество()>0 Тогда 
						СтрокаОбновления = СтрокиПоиска[0];
					Иначе
						СтрокаОбновления = ТекДерево.Строки.Добавить();
						СтрокаОбновления.ИмяСправочника = ТекОбновление;
					КонецЕсли;
					
					СтрокаСправочника = СтрокаОбновления.Строки.Добавить();
					СтрокаСправочника.ИмяСправочника = НСтр("ru='Программные (непрограммные) направления расходов (целевые статьи)'");
					РеквизитКода = "Наименование";
					ЕстьПериод = Истина;
					
				ИначеЕсли ТекТип = Тип("СправочникСсылка.ПрограммыЦелевыхСтатейКРБ") Тогда
					ТекОбновление = НСтр("ru='Целевые статьи расходов'");
					СтруктураПоиска = Новый Структура("ИмяСправочника",ТекОбновление);
					СтрокиПоиска = ТекДерево.Строки.НайтиСтроки(СтруктураПоиска);
					Если СтрокиПоиска.Количество()>0 Тогда 
						СтрокаОбновления = СтрокиПоиска[0];
					Иначе
						СтрокаОбновления = ТекДерево.Строки.Добавить();
						СтрокаОбновления.ИмяСправочника = ТекОбновление;
					КонецЕсли;
					
					СтрокаСправочника = СтрокаОбновления.Строки.Добавить();
					СтрокаСправочника.ИмяСправочника = НСтр("ru='Направления расходов (программы)'");
					РеквизитКода = "Наименование";
					ЕстьПериод = Истина; 
					
				ИначеЕсли ТекТип = Тип("СправочникСсылка.КОСГУ") Тогда
					СтрокаОбновления = ТекДерево.Строки.Добавить();
					СтрокаОбновления.ИмяСправочника = НСтр("ru='Классификатор операций сектора гос. управления'");
					
					СтрокаСправочника = СтрокаОбновления.Строки.Добавить();
					СтрокаСправочника.ИмяСправочника = НСтр("ru='КОСГУ (КЭК)'");
					РеквизитКода = "Код";
					
				КонецЕсли;
				
				ЭтоПерваяСтрока = Ложь;	
			КонецЕсли;
			СтрокаДетальная = СтрокаСправочника.Строки.Добавить();
			СтрокаДетальная.ИмяСправочника 	= ВыборкаДляОбхода[РеквизитКода];
			СтрокаДетальная.СсылкаДубль 	= ВыборкаДляОбхода.Ссылка;
			
			Если ЕстьПериод Тогда
				СтрокаДетальная.ДатаНачалаДействия 		= ВыборкаДляОбхода.ДатаНачалаДействия;
				СтрокаДетальная.ДатаОкончанияДействия 	= ВыборкаДляОбхода.ДатаОкончанияДействия;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ТекДерево.Строки.Сортировать("ИмяСправочника",Истина);
	ЗначениеВРеквизитФормы(ТекДерево,"ДеревоДублей");
	
КонецПроцедуры

#КонецОбласти