#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ОсновнойКонтекст");
	
	НастройкиВарианта.Включен = Ложь;

	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Служебная функция дающая отчету счета для детализации КЭК
Функция ПолучитьСчетаДляДетализацииКЭК(НаДату) Экспорт
	
	Стр =
		"106.60,109.00,110.00,111.60,114.2D,114.2I,114.2N,114.2R,114.3D,114.3I,114.3N,114.3R,114.54,114.6D,114.6I,114.6N,114.6R"
		"204.50,205.00,206.00,207.00,209.00,210.00,215.50,302.00,304.00,401.00,501.00,502.00,503.00,504.00,506.00,507.00,508.00";
	Если Дата(2025, 12, 31, 23, 59, 59) >= НаДату Тогда
		Стр = Стр + ",105.00,106.24,106.34,106.56,107.23,107.33,108.56,114.56,114.80";
	КонецЕсли;
	Возврат Стр;
	
КонецФункции

#КонецОбласти

#КонецЕсли