#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаСписанияСБухУчета) Тогда
		ЭтотОбъект.ДатаСписанияСБухУчета = ЭтотОбъект.Дата;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.СписаниеАвтотранспорта.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	// Движения по регистрам накопления
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "СтоимостьОбъектовОС");
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "АмортизацияОбъектовОС");
	
	// Движения по регистрам сведений
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "МестонахождениеОС");
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "СобытияОС");

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивУдаляемыхРеквизитов = Новый Массив;
	
	СчетУчетаОС = УправлениеОсновнымиСредствами.СчетУчетаОС(ОсновноеСредство, Ссылка);
	СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетУчетаОС);
	
	Если НЕ СвойстваСчета.УчетПоКПС Тогда
		МассивУдаляемыхРеквизитов.Добавить("КПС");
	КонецЕсли;
	Если Не (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") И СвойстваСчета.УчетПоПодразделениям) Тогда
		МассивУдаляемыхРеквизитов.Добавить("Подразделение");
	КонецЕсли;
	Если ОсновноеСредство.ВидНФА = Перечисления.ВидыНФА.КапВложения Тогда
		МассивУдаляемыхРеквизитов.Добавить("ЦМО");
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивУдаляемыхРеквизитов);
	
	Если ЗначениеЗаполнено(ОсновноеСредство) Тогда
		ТекстСообщения = НСтр("ru='Документ применяется только для отражения списания автотранспортных средств'");
		Если ОсновноеСредство.ВидНФА = Перечисления.ВидыНФА.ОС Тогда
			СчетаУчетаАвтотранспорта = УправлениеОсновнымиСредствамиПовтИсп.ПолучитьМассивСчетовОС(Неопределено,
																									Ложь, 
																									Ложь,
																									Ложь,
																									Ложь,
																									Истина,
																									Ложь,
																									Ложь,
																									Ложь,
																									Истина,
																									Истина);
			Если СчетаУчетаАвтотранспорта.Найти(СчетУчетаОС) = Неопределено Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		Если Отказ Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновноеСредство");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнвентарныйНомер = Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
	Сумма = 0;
	СуммаАмортизации = 0;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли