#Область ОписаниеПеременных

&НаКлиенте
Перем ВыполнитьЗапись;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		Элементы.ТипЗначения.ТолькоПросмотр = Истина;
	Иначе
		// Обработчик подсистемы запрета редактирования реквизитов объектов
		ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	КонецЕсли;
 	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Параметры.Копируемый) Тогда
			Объект.Наименование              = Параметры.Копируемый.Наименование;
			Объект.Родитель                  = Параметры.Копируемый.Родитель;
		Иначе
			Если ЗначениеЗаполнено(Параметры.Родитель) Тогда
				Объект.Родитель = ?(Параметры.Родитель.ЭтоГруппа, Параметры.Родитель, Параметры.Родитель.Родитель);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ)
	
	Если ВыполнитьЗапись <> Истина И ЕстьСТакимЖеНаименованием(Объект.Наименование, Объект.Ссылка) Тогда
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВопросаЗаписать", ЭтотОбъект),
			НСтр("ru = 'Дполнительный реквизит проводки с указанным наименованием уже был введен ранее.
				|Продолжить запись?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗапись = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Результат = Неопределено;

		ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыОпераций.Форма.ФормаПоискаСсылокНаПВХ",
			Новый Структура("Ссылка", Объект.Ссылка),,,,, 
			Новый ОписаниеОповещения("Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение", ЭтотОбъект), 
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЕстьСТакимЖеНаименованием(Наименование, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыОпераций КАК ДополнительныеРеквизитыОпераций
	|ГДЕ
	|	ДополнительныеРеквизитыОпераций.Наименование = &Наименование
	|	И ДополнительныеРеквизитыОпераций.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",       Ссылка);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВопросаЗаписать(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗапись = Истина;
		Записать();
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
