&НаКлиенте
Перем ВыборОСОбработан;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(Элементы, Объект,
		"ВыбратьКомиссию,ВыбратьПредседателяКомиссии,СоставКомиссииПодобратьСотрудников,ГруппаРасчетСтоимостиОС");
	
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	
	УправлениеОсновнымиСредствамиКлиентСервер.ЗаполнитьСписокВыбораВидаОперацииДокумента(ТипЗнч(Параметры.Ключ), Элементы.ВидОперации);																			
	
	// если документ скопирован или введен на основании, то чтения на сервере не было
	Если Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
		ПрочитатьРеквизитыОС(Объект.Организация,Объект.ОсновноеСредство, ВидНФАДокумента, ГрупповойУчет, ОС_СчетУчета, ОС_СчетУчета_Забалансовый,Объект.Дата);
	КонецЕсли;
	
	ИспользоватьУчетПоПодразделениям 	= ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	ИспользоватьУчетПоИФО				= ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	
	УправлениеФормойПоВидуОперации(ЭтаФорма);
	
	ЗаполнитьТекстПроСчетФактуруСервер(); 
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	ПрочитатьРеквизитыОС(Объект.Организация,Объект.ОсновноеСредство, ВидНФАДокумента, ГрупповойУчет, ОС_СчетУчета, ОС_СчетУчета_Забалансовый, Объект.Дата);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
    Оповестить("ДокументыПоУчетуОСИзменение");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеОсновнымиСредствамиКлиент.ПриОткрытииДокумента173н(ЭтотОбъект, "ПередачаОбъектовОС");
	
	ВыборОСОбработан = Ложь;
	УстановитьОбязательностьРеквизитов();
	УстановитьОбязательностьИнвНомера();
	УстановитьДоступностьСвязанныхРеквизитовОрганизации();
	УстановитьДоступностьДоговора();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ПрочитатьРеквизитыОС(Объект.Организация, Объект.ОсновноеСредство, ВидНФАДокумента, ГрупповойУчет, ОС_СчетУчета, ОС_СчетУчета_Забалансовый, Объект.Дата);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.ПостоянноДействующиеКомиссии.Форма.ФормаВыбора" Тогда
		УправлениеОсновнымиСредствамиКлиент.УстановитьКомиссиюВДокументОС(ВыбранноеЗначение, Объект, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СчетФактураВыданный" Тогда
		ЗаполнитьТекстПроСчетФактуруКлиент(Параметр, Источник);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
	 ИЛИ (Объект.ВалютаДокумента <> ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета
	 	И НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня) Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьВалютаДляКонтроляКурса);
		
	КонецЕсли;
	
	Если ЭтоПередачаВПользование(Объект.ВидОперации) Тогда
		Объект.ДатаСписанияСБухУчета = Объект.Дата;
	Иначе
		УправлениеОсновнымиСредствамиКлиент.ЗапроситьИзменениеДатыСписанияСБухУчета(Объект);
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации();
	УстановитьДоступностьДоговора();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УправлениеФормойПоВидуОперации(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	УстановитьДоступностьДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ЦМОПриИзменении(Элемент)
	ОбнулитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзменении(Элемент)
	БухгалтерскийУчетКлиент.ОбработатьВыборКФО(Объект.Организация,
											   Объект.ИФО,
											   Объект.КФО,
											   Объект.Дата,
											   ,
											   Объект.КПС);
	ОбнулитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура КПСПриИзменении(Элемент)
	ОбнулитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборОСОбработан = Ложь;
	ОткрытьФорму("Справочник.ОсновныеСредства.ФормаВыбора", ПараметрыДляВыбораОС(), Элемент);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоПриИзменении(Элемент)
	ПриИзмененииОсновногоСредства(НЕ ВыборОСОбработан, Истина, Истина, Ложь);
	ВыборОСОбработан = Ложь;
	УстановитьОбязательностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	Если Не ПустаяСтрока(Текст) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыДляВыбора = ПараметрыДляВыбораОС();
		ПараметрыДляВыбора.Вставить("СтрокаПоиска", Текст);
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.ОсновныеСредства"), ПараметрыДляВыбора);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	Если Не ПустаяСтрока(Текст) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыДляВыбора = ПараметрыДляВыбораОС();
		ПараметрыДляВыбора.Вставить("СтрокаПоиска", Текст);
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.ОсновныеСредства"), ПараметрыДляВыбора);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СоответствиеРеквизитов = Новый Соответствие;
	СоответствиеРеквизитов.Вставить("ВидНФА", 					"ВидНФАДокумента");
	СоответствиеРеквизитов.Вставить("СчетУчета", 				"ОС_СчетУчета");
	СоответствиеРеквизитов.Вставить("ГрупповойУчет",		 	"ГрупповойУчет");
	СоответствиеРеквизитов.Вставить("СчетУчетаЗабалансовый",	"ОС_СчетУчета_Забалансовый");
	УправлениеОсновнымиСредствамиКлиент.ОбработкаВыбораОсновногоСредства(ВыбранноеЗначение, ЭтаФорма, СоответствиеРеквизитов, ВыборОСОбработан);
КонецПроцедуры

&НаКлиенте
Процедура ИнвентарныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СписокСостояний = Новый СписокЗначений;
	СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияОС.ВведеноВЭксплуатацию"));
	СписокСостояний.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияОС.ПринятоКУчету"));
	ПараметрыФормы = Новый Структура("Отбор, НаДату, ТекущаяСтрока",
									Новый Структура("Владелец, ОС, Состояние, ЦМО",
													Объект.Организация,
													Объект.ОсновноеСредство,
													СписокСостояний,
													Объект.ЦМО),
									Объект.Дата,													
									Объект.ИнвентарныйНомер);
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ПараметрыФормы.Вставить("ГраницаОтбора", Объект.Ссылка);
	КонецЕсли;
	ОткрытьФорму("Справочник.ИнвентарныеНомераОС.ФормаВыбора", ПараметрыФормы, Элемент);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПродажиПриИзменении(Элемент)
	ПересчитатьНДС();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ПересчитатьНДС();
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	ПересчитатьНДС();
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
	ПересчитатьВсего();
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПредседателяКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ОбработатьВыборПредседателяКомиссии(ЭтаФорма,
																			ВыбранноеЗначение, 
																			СтандартнаяОбработка, 
																			Объект.ДолжностьПредседателяКомиссии,
																			Объект.ФамилияПредседателяКомиссии,
																			Объект.ИмяПредседателяКомиссии,
																			Объект.ОтчествоПредседателяКомиссии);
																		КонецПроцедуры

&НаКлиенте
Процедура НадписьСчетФакутраНажатие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.СчетФактураНажатие(СчетФактура, ЭтаФорма, СтандартнаяОбработка, "СчетФактураВыданный");	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтаФорма, Объект);
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ОбработатьПодборКомиссии(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРассчитатьСтоимостьОС(Команда)
	РассчитатьСуммы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКомиссию(Команда)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", Объект.Организация));
		ОткрытьФорму("Справочник.ПостоянноДействующиеКомиссии.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Сначала необходимо выбрать организацию'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборКомиссии(Элементы.СоставКомиссии, Объект.Организация, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	УправлениеОсновнымиСредствамиКлиент.ОткрытьВыборПредседателяКомиссии(Элементы.ФамилияПредседателяКомиссии, Объект.Организация, Объект.Дата);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации()

	ДоступностьРеквизитов = ЗначениеЗаполнено(Объект.Организация);
	Элементы.РеквизитыЛицевогоСчета.Доступность	= ДоступностьРеквизитов;
	Элементы.Подразделение.Доступность			= ДоступностьРеквизитов;
	Элементы.ЦМО.Доступность					= ДоступностьРеквизитов;
	Элементы.ОсновноеСредство.Доступность		= ДоступностьРеквизитов;
	
КонецПроцедуры // УстановитьДоступностьСвязанныхРеквизитовОрганизации()

&НаКлиенте
Процедура УстановитьДоступностьДоговора()

	Элементы.Договор.Доступность = ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент);	

КонецПроцедуры // УстановитьДоступностьДоговора()

&НаКлиенте
Процедура ОбнулитьСуммы()

	Объект.Сумма 			= 0;
	Объект.СуммаАмортизации	= 0;

КонецПроцедуры // ОбнулитьСуммы()

&НаКлиенте
Процедура РассчитатьСуммы(СообщатьОбОшибках = Ложь)

	Если НеВсеРеквизитыДляЗаполненияЗаполнены(СообщатьОбОшибках) Тогда
		Возврат;
	КонецЕсли;
	РассчитатьБалансовуюСтоимостьИАмортизацию();
	УстановитьОбязательностьИнвНомера();
КонецПроцедуры // РассчитатьСуммы()

&НаСервере
Процедура РассчитатьБалансовуюСтоимостьИАмортизацию()

	ЭтоКапВложение =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОсновноеСредство, "ВидНФА") = Перечисления.ВидыНФА.КапВложения;
	Если ОС_СчетУчета_Забалансовый Тогда
		Если Параметры.Ключ.Пустая() Тогда
			Если ЭтоПередачаВПользование(Объект.ВидОперации) Тогда
				ПериодОстатков = КонецДня(Объект.Дата);
			Иначе
				ПериодОстатков = ?(ЗначениеЗаполнено(Объект.ДатаСписанияСБухУчета), КонецДня(Объект.ДатаСписанияСБухУчета), КонецДня(Объект.Дата));
			КонецЕсли;
		Иначе
			Если ЭтоПередачаВПользование(Объект.ВидОперации) 
				ИЛИ Не ЗначениеЗаполнено(Объект.ДатаСписанияСБухУчета)
				ИЛИ НачалоДня(Объект.Дата) = НачалоДня(Объект.ДатаСписанияСБухУчета) Тогда
				
				ПериодОстатков = Объект.Ссылка.МоментВремени();
			Иначе
				ПериодОстатков = Объект.ДатаСписанияСБухУчета-1;
			КонецЕсли;
		КонецЕсли;		
		
		ПараметрыЗапроса = Новый Структура("Период, Организация, КПС, КФО, ИФО, Подразделение, ЦМО, Контрагент",
											ПериодОстатков,
											Объект.Организация,
											Объект.КПС,
											Объект.КФО,
											Объект.ИФО,
											Объект.Подразделение,
											Объект.ЦМО,
											Объект.Контрагент);					
		СтоимостьОС = УправлениеОсновнымиСредствами.ОпределитьСтоимостьОбъектаОС(Объект.ОсновноеСредство, ПараметрыЗапроса,ПериодОстатков);						
		Сумма = 0;
		Количество = 0;
		Если СтоимостьОС.Количество()>0 Тогда
			Сумма = СтоимостьОС[0].Сумма;
			Количество = СтоимостьОС[0].Количество;
		КонецЕсли;
							
		Если Количество>0 Тогда
			Цена = Сумма / Количество;
		Иначе
			Цена = 0;
		КонецЕсли;
		
		Объект.Сумма 			= Цена;
		Объект.СуммаАмортизации	= 0;
	Иначе
		ПараметрыПолученияОстатков = УправлениеОсновнымиСредствами.СтруктураПараметровПолученияОстатков(Объект, Объект.ДатаСписанияСБухУчета);
		ПараметрыПолученияОстатков.ПолучатьАмортизацию = Истина;
		ПараметрыПолученияОстатков.УстанавливатьИнвентарныйНомер = Не ЗначениеЗаполнено(Объект.ИнвентарныйНомер);
		ПараметрыПолученияОстатков.УстанавливатьКПС = Истина;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПередачиОС.ПередачаКапвложений Тогда
			ТаблицаОстатков = УправлениеОсновнымиСредствами.ПолучитьОстаткиКапВложений(ПараметрыПолученияОстатков); 
		Иначе
			ТаблицаОстатков = УправлениеОсновнымиСредствами.ПолучитьОстатки(ПараметрыПолученияОстатков); 
		КонецЕсли;
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ОсновноеСредство",	"ОсновноеСредство");
		ПараметрыЗаполнения.Вставить("ИнвентарныйНомер",	"ИнвентарныйНомер");
	//	ПараметрыЗаполнения.Вставить("Количество",			"Количество");
	//	ПараметрыЗаполнения.Вставить("Цена",				"Цена");
		ПараметрыЗаполнения.Вставить("Сумма",				"Сумма");
		ПараметрыЗаполнения.Вставить("КПС",					"КПС");
		ПараметрыЗаполнения.Вставить("СуммаАмортизации",	"СуммаАмортизации");
		ПараметрыЗаполнения.Вставить("ИсходноеКоличество",	1);
		
		ПараметрыЗаполнения.Вставить("УстанавливатьИнвентарныйНомер", Истина);
		ПараметрыЗаполнения.Вставить("УстанавливатьКПС",	Истина);
			
		УправлениеОсновнымиСредствами.ЗаполнитьОбъектИзТаблицыОстатков(ТаблицаОстатков, Объект, ПараметрыЗаполнения);
	КонецЕсли;	

КонецПроцедуры // РассчитатьБалансовуюСтоимостьИАмортизацию()

&НаСервере
Процедура ПолучитьИнвентарныйНомер()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |	МестонахождениеОССрезПоследних.ИнвНомер
				   |ИЗ
				   |	РегистрСведений.МестонахождениеОС.СрезПоследних(
				   |			&Период,
				   |			ОсновноеСредство = &ОсновноеСредство
				   |				И Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
				   |				И ЦМО = &ЦМО) КАК МестонахождениеОССрезПоследних";
	Запрос.УстановитьПараметр("ОсновноеСредство", 	Объект.ОсновноеСредство);
	Запрос.УстановитьПараметр("Период",				?(Параметры.Ключ.Пустая(), КонецДня(Объект.Дата), Объект.Ссылка.МоментВремени()));
	Запрос.УстановитьПараметр("ЦМО",				Объект.ЦМО);
	Результат = Запрос.Выполнить();
	ИнвентарныйНомер = Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			ИнвентарныйНомер = Выборка.ИнвНомер;
		КонецЕсли;
	КонецЕсли;		
	Объект.ИнвентарныйНомер = ИнвентарныйНомер;
	
КонецПроцедуры // ПриИзмененииОсновногоСредства()

&НаКлиенте
Процедура ПересчитатьНДС()

	Ставка = УчетНДСКлиентСервер.ЗначениеСтавкиНДС(Объект.СтавкаНДС);
	Если Объект.СуммаВключаетНДС Тогда
		Объект.СуммаНДС = Объект.ЦенаПродажи / (100 + Ставка) * Ставка;
	Иначе
		Объект.СуммаНДС = Объект.ЦенаПродажи / 100 * Ставка;
	КонецЕсли;
    ПересчитатьВсего();
	
КонецПроцедуры // ПересчитатьНДС()
 
&НаКлиенте
Процедура ПересчитатьВсего()
	Если Объект.СуммаВключаетНДС Тогда
		Объект.Всего = Объект.ЦенаПродажи;
	Иначе
		Объект.Всего = Объект.ЦенаПродажи + Объект.СуммаНДС;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбязательностьРеквизитов()

	Если ЗначениеЗаполнено(ОС_СчетУчета) Тогда
		СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ОС_СчетУчета);
		Элементы.КПС.АвтоОтметкаНезаполненного 				= СвойстваСчета.УчетПоКПС;
		Элементы.Подразделение.АвтоОтметкаНезаполненного	= ИспользоватьУчетПоПодразделениям И СвойстваСчета.УчетПоПодразделениям;
		Элементы.Контрагент.АвтоОтметкаНезаполненного		= СвойстваСчета.ВидСубконто1 = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.Контрагенты")
																ИЛИ СвойстваСчета.ВидСубконто2 = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.Контрагенты")
																ИЛИ СвойстваСчета.ВидСубконто3 = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.Контрагенты");
	Иначе
		Элементы.КПС.АвтоОтметкаНезаполненного 				= Ложь;
		Элементы.Подразделение.АвтоОтметкаНезаполненного	= Ложь;
		Элементы.Контрагент.АвтоОтметкаНезаполненного		= Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(ВидНФАДокумента) Тогда
		Элементы.ЦМО.АвтоОтметкаНезаполненного = ВидНФАДокумента <> ПредопределенноеЗначение("Перечисление.ВидыНФА.КапВложения");
	Иначе
		Элементы.ЦМО.АвтоОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	Если Элементы.КПС.АвтоОтметкаНезаполненного Тогда
		Элементы.КПС.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(Объект.КПС);
	Иначе
		Элементы.КПС.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	Если Элементы.Подразделение.АвтоОтметкаНезаполненного Тогда
		Элементы.Подразделение.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(Объект.Подразделение);
	Иначе
		Элементы.Подразделение.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	Если Элементы.Контрагент.АвтоОтметкаНезаполненного Тогда
		Элементы.Контрагент.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(Объект.Контрагент);
	Иначе
		Элементы.Контрагент.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	Если Элементы.ЦМО.АвтоОтметкаНезаполненного Тогда
		Элементы.ЦМО.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(Объект.ЦМО);
	Иначе
		Элементы.ЦМО.ОтметкаНезаполненного = Ложь;
	КонецЕсли;

КонецПроцедуры // УстановитьОбязательностьРеквизитов()

&НаКлиенте
Процедура УстановитьОбязательностьИнвНомера()

	Элементы.ИнвентарныйНомер.АвтоОтметкаНезаполненного = ЗначениеЗаполнено(ВидНФАДокумента)
														И ВидНФАДокумента <> ПредопределенноеЗначение("Перечисление.ВидыНФА.КапВложения")
														И Объект.Сумма > 3000;
														
	Если Элементы.ИнвентарныйНомер.АвтоОтметкаНезаполненного Тогда
		Элементы.ИнвентарныйНомер.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(Объект.ИнвентарныйНомер);
	Иначе
		Элементы.ИнвентарныйНомер.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
		
КонецПроцедуры // УстановитьОбязательностьИнвНомера()

&НаКлиенте
Процедура ПриИзмененииОсновногоСредства(ЗаполнятьРеквизитыОС, ПолучатьИнвНомер, РассчитыватьСтоимость, СообщатьОбОшибках)

	Если ПолучатьИнвНомер Тогда
		ПолучатьИнвНомер = НЕ НеВсеРеквизитыДляИнвНомераЗаполнены(СообщатьОбОшибках);
	КонецЕсли;
	Если РассчитыватьСтоимость Тогда
		РассчитыватьСтоимость = НЕ НеВсеРеквизитыДляЗаполненияЗаполнены(СообщатьОбОшибках);
	КонецЕсли;
	
	Если ЗаполнятьРеквизитыОС ИЛИ ПолучатьИнвНомер ИЛИ РассчитыватьСтоимость Тогда
		ОбработатьИзменениеОсновногоСредстваНаСервере(ЗаполнятьРеквизитыОС, ПолучатьИнвНомер, РассчитыватьСтоимость);
	КонецЕсли;
	УстановитьОбязательностьИнвНомера();

КонецПроцедуры // ПриИзмененииОсновногоСредства()

&НаСервере
Процедура ОбработатьИзменениеОсновногоСредстваНаСервере(ЗаполнятьРеквизитыОС, ПолучатьИнвНомер, РассчитыватьСтоимость)

	Если ЗаполнятьРеквизитыОС Тогда
		ПрочитатьРеквизитыОС(Объект.Организация,Объект.ОсновноеСредство, ВидНФАДокумента, ГрупповойУчет, ОС_СчетУчета, ОС_СчетУчета_Забалансовый,Объект.Дата);
	КонецЕсли;
	
	Если ПолучатьИнвНомер Тогда
		ПолучитьИнвентарныйНомер();	
	КонецЕсли;
	
	Если РассчитыватьСтоимость Тогда
		РассчитатьБалансовуюСтоимостьИАмортизацию();
	КонецЕсли;

КонецПроцедуры // ОбработатьИзменениеОсновногоСредстваНаСервере()

&НаКлиенте
Функция НеВсеРеквизитыДляЗаполненияЗаполнены(СообщатьОбОшибках = Истина)

	Отказ = Ложь;
	Если ИспользоватьУчетПоИФО И НЕ ЗначениеЗаполнено(Объект.ИФО) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит ИФО'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ИФО",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
	Если Элементы.ЦМО.АвтоОтметкаНезаполненного И НЕ ЗначениеЗаполнено(Объект.ЦМО) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит МОЛ/Место хранения'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ЦМО",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
	Если Элементы.Подразделение.АвтоОтметкаНезаполненного И НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит Подразделение'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.Подразделение",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
	Если Элементы.Контрагент.АвтоОтметкаНезаполненного И НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит Контрагент'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.Контрагент",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.КФО) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит КФО'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.КФО",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
	//Если Элементы.КПС.АвтоОтметкаНезаполненного И НЕ ЗначениеЗаполнено(Объект.КПС) Тогда
	//	Если СообщатьОбОшибках Тогда
	//		ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит КПС'");
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.КПС",,Отказ);
	//	Иначе
	//		Отказ = Истина;
	//		Возврат Отказ;
	//	КонецЕсли;
	//КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит Объект'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновноеСредство",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
		
	Возврат Отказ;	

КонецФункции // НеВсеРеквизитыДляЗаполненияЗаполнены()

&НаКлиенте
Функция НеВсеРеквизитыДляИнвНомераЗаполнены(СообщатьОбОшибках = Истина)

	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит Объект'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновноеСредство",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ЦМО) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = НСтр("ru='Не заполнен обязательный реквизит МОЛ/Место хранения'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ЦМО",,Отказ);
		Иначе
			Отказ = Истина;
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
    Возврат Отказ;
	
КонецФункции // НеВсеРеквизитыДляИнвНомераЗаполнены()

&НаСервереБезКонтекста
Процедура ПрочитатьРеквизитыОС(Организация, ОсновноеСредство, ВидНФА, ГрупповойУчет, СчетУчета, СчетУчетаЗабалансовый, НаДату)
	
	ДанныеОбъектаОС = УправлениеОсновнымиСредствами.ДанныеОбъектаОС(ОсновноеСредство, НаДату);
	ВидНФА          = ДанныеОбъектаОС.ВидНФА;
	ГрупповойУчет   = ДанныеОбъектаОС.ГрупповойУчет;
	СчетУчета       = ДанныеОбъектаОС.СчетУчета;
	
	СчетУчетаЗабалансовый = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетУчета).Забалансовый;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекстПроСчетФактуруКлиент(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения)
	
	Перем ЗначениеСвойства;
	
	ЭтотДокументЯвляетсяОснованием = (ТипЗнч(ПараметрОбработкиОповещения) = Тип("Структура")
		И ПараметрОбработкиОповещения.Свойство("ДокументыОснования", ЗначениеСвойства)
		И ЗначениеСвойства.Найти(Объект.Ссылка) <> Неопределено);
	
	Если ЭтотДокументЯвляетсяОснованием Тогда
		ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения = Неопределено, ИсточникОбработкиОповещения = Неопределено)
	
	УчетНДС.ЗаполнитьТекстПроСчетФактуру(ЭтаФорма, ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыДляВыбораОС()

	Отбор = Новый Структура("Организация", Объект.Организация);
	ПараметрыФормы = Новый Структура;
	ПараметрыСчетов = УправлениеОсновнымиСредствамиКлиентСервер.СтруктураЗапрашиваемыхСчетов();
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСПолученныхвПользование") Тогда
		ПараметрыСчетов.Аренда			= Истина;
		
		ПараметрыФормы.Вставить("ОС",	Истина);
		ПараметрыФормы.Вставить("НПА",	Истина);
		
		Отбор.Вставить("ВидУчета", ПредопределенноеЗначение("Перечисление.ВидыУчетаНФА.Арендованные"));
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСнаХранении") Тогда
		ПараметрыСчетов.Хранение		= Истина;
		
		ПараметрыФормы.Вставить("ОС", Истина);
		
		Отбор.Вставить("ВидУчета", ПредопределенноеЗначение("Перечисление.ВидыУчетаНФА.НаОтветственномХранении"));
		
	Иначе
		ПараметрыСчетов.ЖилыеПомещения		= Истина;
		ПараметрыСчетов.НежилыеПомещения	= Истина;
		ПараметрыСчетов.Сооружения			= Истина;
		
		ПараметрыФормы.Вставить("ОС",	Истина);
		ПараметрыФормы.Вставить("НПА",	Истина);
		ПараметрыФормы.Вставить("НМА",	Истина);
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаСобственныхОС") Тогда
			ПараметрыФормы.Вставить("КапВложения",	Истина);
		КонецЕсли;
		
		Отбор.Вставить("ВидУчета", ПредопределенноеЗначение("Перечисление.ВидыУчетаНФА.НаБалансе"));
		
	КонецЕсли;
	ПараметрыФормы.Вставить("СписокВидовОС",	ПараметрыСчетов);
	ПараметрыФормы.Вставить("ТекущаяСтрока",	Объект.ОсновноеСредство);
	ПараметрыФормы.Вставить("ТребуемыеДанные",	"ГрупповойУчет,ВидНФА,СчетУчета,СчетУчетаЗабалансовый");
	ПараметрыФормы.Вставить("Отбор",			Отбор);
	Возврат ПараметрыФормы;

КонецФункции // ПараметрыДляВыбораОС()

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормойПоВидуОперации(Форма)

	Если ЭтоПередачаВПользование(Форма.Объект.ВидОперации) Тогда
		Форма.Элементы.ГруппаЦМОПодразделениеПолучательСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаЦМОПодразделениеПолучатель;
	Иначе
		Форма.Элементы.ГруппаЦМОПодразделениеПолучательСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаЦМОПодразделениеПолучатель1;
	КонецЕсли;		

КонецПроцедуры // УправлениеФормойПоВидуОперации()

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПередачаВПользование(ВидОперации)

	Возврат ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСАренда")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСвПользование");

КонецФункции // ЭтоПередачаВПользование()

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
