#Область ОписаниеПеременных

&НаКлиенте
Перем ИменаКолонокОстаточнаяСтоимость;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Объект.ОтчетныйПериод) Тогда
			Объект.ОтчетныйПериод = КонецКвартала(Объект.Дата);
		КонецЕсли;

		УстановитьПредставлениеПериода(ЭтотОбъект);
		УправлениеВидимостьюЭлементов(ЭтотОбъект);
		УстановитьВидимостьПоСреднегодовойИтоги(ЭтотОбъект);
		
		ЗаполнитьГлавногоБухгалтера();
	КонецЕсли;
	
	РасчетНеВыполненИтог = НСтр("ru = '<расчет не выполнен>'");
	
	УстановитьУсловноеОформление();

	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	УстановитьПредставлениеПериода(ЭтотОбъект);
	УправлениеВидимостьюЭлементов(ЭтотОбъект);
	УстановитьВидимостьПоСреднегодовойИтоги(ЭтотОбъект);
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Внутренний ЭДО
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец Внутренний ЭДО

	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НачалоПериода", 			НачалоКвартала(Объект.ОтчетныйПериод));	
	ПараметрыФормы.Вставить("КонецПериода", 			Объект.ОтчетныйПериод);	
	ПараметрыФормы.Вставить("НарастающимИтогом", 		Ложь);	
	ПараметрыФормы.Вставить("БезПоследнегоКвартала", 	Ложь);	

	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаКвартал", ПараметрыФормы, Элементы.ПредставлениеПериодаРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ОтчетныйПериод = ИзменитьПериод(Объект.ОтчетныйПериод, Направление);
	УстановитьПредставлениеПериода(ЭтотОбъект);
	
	Объект.ПоСреднегодовой.Очистить();
	Объект.ПоКадастровой.Очистить();

	УправлениеВидимостьюЭлементов(ЭтотОбъект);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.ОтчетныйПериод = ВыбранноеЗначение.КонецПериода;
	УстановитьПредставлениеПериода(ЭтотОбъект);
	
	Объект.ПоСреднегодовой.Очистить();
	Объект.ПоКадастровой.Очистить();

	УправлениеВидимостьюЭлементов(ЭтотОбъект);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ЗаполнитьОтветственногоИсполнителя();
КонецПроцедуры

// Внутренний ЭДО
&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец Внутренний ЭДО

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания,
		СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания,
		СтандартнаяОбработка);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоСреднегодовой

&НаКлиенте
Процедура ПоСреднегодовойПередУдалением(Элемент, Отказ)

	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойНалоговыйОрганПриИзменении(Элемент)
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойКодПоОКТМОПриИзменении(Элемент)
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойКодВидаИмуществаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПоСреднегодовой.ТекущиеДанные;
	Если ТекущиеДанные.КодВидаИмущества <> 2 Тогда
		ТекущиеДанные.ДоляСтоимостиЧислитель = 0;
		ТекущиеДанные.ДоляСтоимостиЗнаменатель = 0;
	КонецЕсли;
	
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойКодВидаИмуществаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборКодаВидаИмущества(Элемент, СтандартнаяОбработка, "КодВидаИмущества");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа0101ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа0102ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа0103ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа0104ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа0105ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа0106ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа0107ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа0108ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа0109ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа0110ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа0111ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа0112ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойОстаточнаяСтоимостьНа3112ПриИзменении(Элемент)
	РасчетСреднейСтоимостиВСтроке(Элементы.ПоСреднегодовой.ТекущиеДанные);
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойДоляСтоимостиЧислительПриИзменении(Элемент)
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойДоляСтоимостиЗнаменательПриИзменении(Элемент)
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойНалоговаяСтавкаПриИзменении(Элемент)
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойПорядокНалогообложенияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПоСреднегодовой.ТекущиеДанные;
	Если ТекущиеДанные.ПорядокНалогообложения <> ПредопределенноеЗначение(
			"Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения") Тогда
	
		ТекущиеДанные.КодНалоговойЛьготыОсвобождениеОтНалогообложения = "";	
	
	КонецЕсли;
	ТекущиеДанные.ПроцентУменьшенияСуммыНалога = 0;
	ТекущиеДанные.СуммаУменьшенияСуммыНалога = 0;
	ТекущиеДанные.КодОснованияЛьготы = "";	
	
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойПроцентУменьшенияСуммыНалогаПриИзменении(Элемент)
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойКодНалоговойЛьготыОсвобождениеОтНалогообложенияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПоСреднегодовой.ТекущиеДанные;
	Если ТекущиеДанные.КодНалоговойЛьготыОсвобождениеОтНалогообложения <> "2012000" Тогда
		ТекущиеДанные.КодОснованияЛьготы = "";
	КонецЕсли;
	
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойКодНалоговойЛьготыОсвобождениеОтНалогообложенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",     "Код льготы");
	ПараметрыФормы.Вставить("Префикс",       "КодЛьготы");
	ПараметрыФормы.Вставить("ИмяМакета",     "Документ.РегистрацияСтавкиНалогаНаИмущество.СпискиВыбора");
	ПараметрыФормы.Вставить("ТекущийПериод", Объект.ОтчетныйПериод);
	ПараметрыФормы.Вставить("ТекущийКод",    Элемент.ТекстРедактирования);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойКодОснованияЛьготыПриИзменении(Элемент)
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойКодОснованияЛьготыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОснованиеЛьготы", Элемент.ТекстРедактирования);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВводаОснованияЛьготы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойСуммаУменьшенияСуммыНалогаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ПоСреднегодовой.ТекущиеДанные;
	ГодовойРасчет = ЧислоПериодов = 13;
	
	ТекущиеДанные.Сумма = Макс(ТекущиеДанные.СуммаИсчислено - ТекущиеДанные.СуммаУменьшенияСуммыНалога, 0) 
		- ?(ГодовойРасчет,
			(ТекущиеДанные.СуммаАвансовыхПлатежей1Кв
			+ ТекущиеДанные.СуммаАвансовыхПлатежей2Кв
			+ ТекущиеДанные.СуммаАвансовыхПлатежей3Кв),
			0);
			
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойСуммаАвансовыхПлатежей1КвПриИзменении(Элемент)
	
	ПоСреднегодовойСуммаАвансовыхПлатежейПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойСуммаАвансовыхПлатежей2КвПриИзменении(Элемент)
	
	ПоСреднегодовойСуммаАвансовыхПлатежейПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСреднегодовойСуммаАвансовыхПлатежей3КвПриИзменении(Элемент)
	
	ПоСреднегодовойСуммаАвансовыхПлатежейПриИзменении();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоКадастровой

&НаКлиенте
Процедура ПоКадастровойКодВидаИмуществаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборКодаВидаИмущества(Элемент, СтандартнаяОбработка, "КодВидаИмРазделТри");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоКадастровойКадастроваяСтоимостьПриИзменении(Элемент)
	
	ПоКадастровойПриИзмененииПоказателяРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоКадастровойНеоблагаемаяКадастроваяСтоимостьПриИзменении(Элемент)
	
	ПоКадастровойПриИзмененииПоказателяРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоКадастровойДоляВПравеОбщейСобственностиЧислительПриИзменении(Элемент)
	
	ПоКадастровойПриИзмененииПоказателяРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоКадастровойДоляВПравеОбщейСобственностиЗнаменательПриИзменении(Элемент)
	
	ПоКадастровойПриИзмененииПоказателяРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоКадастровойДоляСтоимостиЧислительПриИзменении(Элемент)
	
	ПоКадастровойПриИзмененииПоказателяРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоКадастровойДоляСтоимостиЗнаменательПриИзменении(Элемент)
	
	ПоКадастровойПриИзмененииПоказателяРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоКадастровойНалоговаяСтавкаПриИзменении(Элемент)
	
	ПоКадастровойПриИзмененииПоказателяРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоКадастровойПорядокНалогообложенияПриИзменении(Элемент)
	
	ПоКадастровойПриИзмененииПоказателяРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоКадастровойМесяцевВладенияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПоКадастровой.ТекущиеДанные;
	ТекущиеДанные.МесяцевВладения = Мин(ТекущиеДанные.МесяцевВладения, 
		?(Месяц(Объект.ОтчетныйПериод) = 12, 12, 3));	
	
	ПоКадастровойПриИзмененииПоказателяРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоКадастровойСуммаАвансаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПоКадастровой.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.СуммаИсчислено - ТекущиеДанные.СуммаАванса;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоСредней(Команда)
	
	ЗаполнитьПоСреднейКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоСредней(Команда)
	
	ВыполнитьРасчетНалогаПоСреднегодовойСтоимости();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКадастровой(Команда)
	
	ЗаполнитьПоКадастровойКлиент();
	
КонецПроцедуры

// Внутренний ЭДО
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец Внутренний ЭДО

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
    РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюЭлементов(Форма)

	Элементы = Форма.Элементы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОстаточнаяСтоимость2кв",
		"Видимость", Форма.ЧислоПериодов > 4);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОстаточнаяСтоимость3кв",
		"Видимость", Форма.ЧислоПериодов > 7);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОстаточнаяСтоимость4кв",
		"Видимость", Форма.ЧислоПериодов > 10);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПоСреднегодовойГруппаГодовой",
		"Видимость", Форма.ЧислоПериодов = 13);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПоКадастровойГруппаГодовой",
		"Видимость", Форма.ЧислоПериодов = 13);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойСуммаИсчислено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойСумма");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор, "Объект.ТребуетсяРасчетСреднегодовой", Истина,
		ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<расчет не выполнен>'"));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойСуммаУменьшенияСуммыНалога");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"Объект.ПоСреднегодовой.ПорядокНалогообложения", 
		Перечисления.ПорядокНалогообложенияИмущества.СнижениеСуммыНаПроцент,
		ВидСравненияКомпоновкиДанных.Равно);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор, "Объект.ТребуетсяРасчетСреднегодовой", Истина,
		ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<расчет не выполнен>'"));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойДоляСтоимостиЧислитель");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойДоляСтоимостиЗнаменатель");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"Объект.ПоСреднегодовой.КодВидаИмущества",
		"02",
		ВидСравненияКомпоновкиДанных.НеРавно);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойКодНалоговойЛьготыОсвобождениеОтНалогообложения");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"Объект.ПоСреднегодовой.ПорядокНалогообложения",
		Перечисления.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения,
		ВидСравненияКомпоновкиДанных.НеРавно);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойКодНалоговойЛьготыОсвобождениеОтНалогообложения");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"Объект.ПоСреднегодовой.ПорядокНалогообложения",
		Перечисления.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения,
		ВидСравненияКомпоновкиДанных.Равно);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"Объект.ПоСреднегодовой.КодНалоговойЛьготыОсвобождениеОтНалогообложения",
		,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
 
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойКодНалоговойЛьготыОсвобождениеОтНалогообложения");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"Объект.ПоСреднегодовой.ПорядокНалогообложения",
		Перечисления.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке,
		ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "2012400");
 
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойКодНалоговойЛьготыОсвобождениеОтНалогообложения");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"Объект.ПоСреднегодовой.ПорядокНалогообложения",
		Перечисления.ПорядокНалогообложенияИмущества.СнижениеСуммыНаПроцент,
		ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "2012500");
 
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойКодНалоговойЛьготыОсвобождениеОтНалогообложения");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"Объект.ПоСреднегодовой.ПорядокНалогообложения",
		Перечисления.ПорядокНалогообложенияИмущества.СнижениеСуммыНаСумму,
		ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "2012500");
 
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойПроцентУменьшенияСуммыНалога");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.ПоСреднегодовой.ПорядокНалогообложения", ВидСравненияКомпоновкиДанных.НеРавно,
		Перечисления.ПорядокНалогообложенияИмущества.СнижениеСуммыНаПроцент);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
 
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойСуммаУменьшенияСуммыНалога");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.ПоСреднегодовой.ПорядокНалогообложения", ВидСравненияКомпоновкиДанных.НеРавно,
		Перечисления.ПорядокНалогообложенияИмущества.СнижениеСуммыНаСумму);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
 
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПоСреднегодовойКодОснованияЛьготы");
	
	ГруппаОтбораИли = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
		ЭлементУО.Отбор.Элементы,
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
	СписокОтбораКодОснованияЛьготы = Новый СписокЗначений;
	СписокОтбораКодОснованияЛьготы.Добавить(Перечисления.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке);	
	СписокОтбораКодОснованияЛьготы.Добавить(Перечисления.ПорядокНалогообложенияИмущества.СнижениеСуммыНаПроцент);	
	СписокОтбораКодОснованияЛьготы.Добавить(Перечисления.ПорядокНалогообложенияИмущества.СнижениеСуммыНаСумму);	
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИли,	
		"Объект.ПоСреднегодовой.ПорядокНалогообложения", ВидСравненияКомпоновкиДанных.ВСписке,
		СписокОтбораКодОснованияЛьготы);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбораИли,	
		"Объект.ПоСреднегодовой.КодНалоговойЛьготыОсвобождениеОтНалогообложения", ВидСравненияКомпоновкиДанных.Равно,
		"2012000");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);

 
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Объект.ПоСреднегодовой.Очистить();
	Объект.ПоКадастровой.Очистить();
	
	ЗаполнитьГлавногоБухгалтера();
	ЗаполнитьОтветственногоИсполнителя();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГлавногоБухгалтера()
	
	ЗаполнениеРеквизитовОбъектов.ЗаполнитьПодписанта(Объект, "ГлавныйБухгалтер", "ГлавныйБухгалтер");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтветственногоИсполнителя()
	
	Объект.ОтветственныйИсполнитель = ЗаполнениеРеквизитовОбъектов.ПолучитьОтветственногоИсполнителя(
		Объект.Ответственный, Объект.Организация, "Документ.РасчетНалогаНаИмущество");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеПериода(Форма)

	Объект = Форма.Объект;
	
	Форма.ПредставлениеПериодаРегистрации = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Квартал"),
		НачалоКвартала(Объект.ОтчетныйПериод), КонецМесяца(Объект.ОтчетныйПериод));
		
	Форма.ЧислоПериодов = Месяц(Объект.ОтчетныйПериод) + 1;
	
КонецПроцедуры

&НаКлиенте
Функция ИзменитьПериод(Период, Направление)
	
	НовыйПериод = КонецМесяца(ДобавитьМесяц(Период, Направление * 3));
	
	Возврат НовыйПериод;
	
КонецФункции

&НаКлиенте
Процедура РасчетСреднейСтоимостиВСтроке(ТекущиеДанные)

	СредняяСтоимостьЗаПериод = 0;
	Для НомерПериода = 1 По ЧислоПериодов Цикл
		СредняяСтоимостьЗаПериод = СредняяСтоимостьЗаПериод 
			+ ТекущиеДанные[ИменаКолонокОстаточнаяСтоимость()[НомерПериода - 1]];
	КонецЦикла;
	ТекущиеДанные.СредняяСтоимость = Окр(СредняяСтоимостьЗаПериод / ЧислоПериодов, 2);

КонецПроцедуры

&НаКлиенте
Функция ИменаКолонокОстаточнаяСтоимость()
	Если ИменаКолонокОстаточнаяСтоимость = Неопределено Тогда
		ИменаКолонокОстаточнаяСтоимость = Новый Массив;
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0101");
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0102");
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0103");
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0104");
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0105");
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0106");
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0107");
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0108");
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0109");
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0110");
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0111");
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0112");
		ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа3112");
 	КонецЕсли;
   Возврат ИменаКолонокОстаточнаяСтоимость;
КонецФункции

&НаКлиенте
Процедура ПоСреднегодовойСуммаАвансовыхПлатежейПриИзменении()

	ТекущиеДанные = Элементы.ПоСреднегодовой.ТекущиеДанные;
	
	ТекущиеДанные.Сумма = Макс(ТекущиеДанные.СуммаИсчислено - ТекущиеДанные.СуммаУменьшенияСуммыНалога, 0) 
		- (ТекущиеДанные.СуммаАвансовыхПлатежей1Кв
			+ ТекущиеДанные.СуммаАвансовыхПлатежей2Кв
			+ ТекущиеДанные.СуммаАвансовыхПлатежей3Кв);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСреднейКлиент()
	
	ДлительнаяОперация = НачатьЗаполнениеПоСреднейНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьПоСреднейЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаполнениеПоСреднейНаСервере()
	
	Объект.ПоСреднегодовой.Очистить();
	
	ПараметрыРасчета = РасчетИмущественныхНалогов.ПараметрыРасчетаНалогаНаИмущество();
	ПараметрыРасчета.Организация 	= Объект.Организация;
	ПараметрыРасчета.ОтчетныйПериод = Объект.ОтчетныйПериод;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение документа ""Расчета налога на имущество"" по среднегодовой стоимости'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Возврат 
		ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
			"РасчетИмущественныхНалогов.ТаблицаРасчетаПоСреднегодовой", ПараметрыРасчета);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоСреднейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстПредупреждения = НСтр("ru = 'При расчете возникла ошибка:
			|%1'");
		ТекстПредупреждения = СтрШаблон(ТекстПредупреждения, Результат.КраткоеПредставлениеОшибки);
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоСреднейЗавершениеНаСервере(Результат.АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСреднейЗавершениеНаСервере(Знач АдресРезультата)
	
	ТаблицаПоСреднегодовой = ПолучитьИзВременногоХранилища(АдресРезультата);	
	Для Каждого СтрокаРасчета Из ТаблицаПоСреднегодовой Цикл
		ЗаполнитьЗначенияСвойств(Объект.ПоСреднегодовой.Добавить(), СтрокаРасчета);
	КонецЦикла;
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Ложь);

	УдалитьИзВременногоХранилища(АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРасчетНалогаПоСреднегодовойСтоимости()
	
	ПараметрыРасчета = РасчетИмущественныхНалогов.ПараметрыРасчетаНалогаНаИмущество();
	ПараметрыРасчета.Организация 	= Объект.Организация;
    ПараметрыРасчета.ОтчетныйПериод = Объект.ОтчетныйПериод;
	
	ТаблицаПоСреднегодовой = РасчетИмущественныхНалогов.НоваяТаблицаПоСреднегодовой();
	Для каждого Строка Из Объект.ПоСреднегодовой Цикл
		НоваяСтрока = ТаблицаПоСреднегодовой.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.КодПоОКТМО = СокрЛП(Строка.КодПоОКТМО);
		Если Строка.ПорядокНалогообложения <> Перечисления.ПорядокНалогообложенияИмущества.СнижениеСуммыНаСумму Тогда
			НоваяСтрока.СуммаУменьшенияСуммыНалога = 0;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПоСреднегодовой.ЗаполнитьЗначения(0, "СуммаИсчислено,Сумма");
	Если КонецДня(ПараметрыРасчета.ОтчетныйПериод) <> КонецГода(ПараметрыРасчета.ОтчетныйПериод) Тогда
		ТаблицаПоСреднегодовой.ЗаполнитьЗначения(0,
			"СуммаАвансовыхПлатежей1Кв,СуммаАвансовыхПлатежей2Кв,СуммаАвансовыхПлатежей3Кв");
	КонецЕсли;
	
	РасчетИмущественныхНалогов.ВыполнитьРасчетНалогаПоСреднегодовойСтоимости(ТаблицаПоСреднегодовой, ПараметрыРасчета);
	Объект.ПоСреднегодовой.Загрузить(ТаблицаПоСреднегодовой);
	
	УстановитьТребуетсяРасчетСреднегодовой(ЭтотОбъект, Ложь);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТребуетсяРасчетСреднегодовой(Форма, ТребуетсяРасчет)
	
	Объект = Форма.Объект;
	Объект.ТребуетсяРасчетСреднегодовой = ТребуетсяРасчет;
	УстановитьВидимостьПоСреднегодовойИтоги(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПоСреднегодовойИтоги(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ПоСреднегодовойИтогСумма.Видимость = Не Объект.ТребуетсяРасчетСреднегодовой;
	Элементы.РасчетНеВыполненИтог.Видимость = Объект.ТребуетсяРасчетСреднегодовой;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКадастровойКлиент()
	
	ДлительнаяОперация = НачатьЗаполнениеПоКадастровойНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьПоКадастровойЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаполнениеПоКадастровойНаСервере()
	
	Объект.ПоКадастровой.Очистить();
	
	ПараметрыРасчета = РасчетИмущественныхНалогов.ПараметрыРасчетаНалогаНаИмущество();
	ПараметрыРасчета.Организация = Объект.Организация;
	ПараметрыРасчета.ОтчетныйПериод = Объект.ОтчетныйПериод;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение документа ""Расчета налога на имущество"" по кадастровой стоимости'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Возврат 
		ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
			"РасчетИмущественныхНалогов.ТаблицаРасчетаПоКадастровой", ПараметрыРасчета);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоКадастровойЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстПредупреждения = НСтр("ru = 'При расчете возникла ошибка:
			|%1'");
		ТекстПредупреждения = СтрШаблон(ТекстПредупреждения, Результат.КраткоеПредставлениеОшибки);
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоКадастровойЗавершениеНаСервере(Результат.АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоКадастровойЗавершениеНаСервере(Знач АдресРезультата)
	
	ТаблицаПоКадастровой = ПолучитьИзВременногоХранилища(АдресРезультата);	
	Для Каждого СтрокаРасчета Из ТаблицаПоКадастровой Цикл
		ЗаполнитьЗначенияСвойств(Объект.ПоКадастровой.Добавить(), СтрокаРасчета);
	КонецЦикла;
	
	УдалитьИзВременногоХранилища(АдресРезультата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоКадастровойПриИзмененииПоказателяРасчета()
	
	ТекущиеДанные = Элементы.ПоКадастровой.ТекущиеДанные;
	
	ПараметрыРасчета = 
		РасчетИмущественныхНалоговКлиентСервер.ПараметрыРасчетаСуммаНалогаНаИмуществоПоКадастровойСтоимости();
	
	ЗаполнитьЗначенияСвойств(ПараметрыРасчета, ТекущиеДанные);
	
	ТекущиеДанные.СуммаИсчислено =
		РасчетИмущественныхНалоговКлиентСервер.СуммаНалогаНаИмуществоПоКадастровойСтоимости(ПараметрыРасчета);
	
	ГодовойРасчет = Месяц(Объект.ОтчетныйПериод) = 12;
	ТекущиеДанные.Сумма = ТекущиеДанные.СуммаИсчислено - ?(ГодовойРасчет, ТекущиеДанные.СуммаАванса, 0);

КонецПроцедуры

&НаКлиенте
Процедура ВыборКодаВидаИмущества(Элемент, СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Код вида имущества");
	ПараметрыФормы.Вставить("Префикс", Префикс);
	ПараметрыФормы.Вставить("ИмяМакета", "Документ.РегистрацияСтавкиНалогаНаИмущество.СпискиВыбора");
	ПараметрыФормы.Вставить("ТекущийПериод", Объект.ОтчетныйПериод);
	ПараметрыФормы.Вставить("ТекущийКод", Элемент.ТекстРедактирования);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы, Элемент);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

