#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("КодТекущейСтроки") И ЗначениеЗаполнено(Параметры.КодТекущейСтроки) Тогда 
		
		ТекущийЕКПС = Неопределено;
		
		Если ОбщегоНазначения.ЗначениеСсылочногоТипа(Параметры.КодТекущейСтроки) 
			И ТипЗнч(Параметры.КодТекущейСтроки) = Тип("СправочникСсылка.ЕдиныйКодификаторПредметовСнабжения") Тогда
			
			ТекущийЕКПС = Параметры.КодТекущейСтроки;
			
		ИначеЕсли ТипЗнч(Параметры.КодТекущейСтроки) = Тип("Строка") Тогда
			
			ТекущийЕКПС = Справочники.ЕдиныйКодификаторПредметовСнабжения.НайтиПоКоду(Параметры.КодТекущейСтроки);
			
		КонецЕсли;	
		
		Элементы.Список.ТекущаяСтрока = ТекущийЕКПС;
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти