
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуДокументов(Параметры.УчетныеДокументы, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.МаршрутыПодписанияБГУ.Форма.ВыборИзДокумента" Тогда
		Если РежимЗаполненияМаршрута = "ВВыделенныхСтроках" Тогда
			ОбработкаВыбораМаршрутаВВыделенныхСтроках(ВыбранноеЗначение.Маршрут);
		ИначеЕсли РежимЗаполненияМаршрута = "ВОтмеченныхСтроках" Тогда
			ОбработкаВыбораМаршрутаВОтмеченныхСтроках(ВыбранноеЗначение.Маршрут);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлектронныеДокументы

&НаКлиенте
Процедура ЭлектронныеДокументыДеревоОтметкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭлектронныеДокументы.ТекущиеДанные;
	
	Если ТекущиеДанные.Формировать = 2 Тогда
		ТекущиеДанные.Формировать = 0;
	КонецЕсли;
	
	Если ТекущиеДанные.ИдентификаторКомандыПечати = "" Тогда
		Для Каждого ПодчиненнаяСтрока Из ТекущиеДанные.ПолучитьЭлементы() Цикл
			ПодчиненнаяСтрока.Формировать = ТекущиеДанные.Формировать;
		КонецЦикла;
	Иначе
		ЗаполнитьОтметкуУРодителя(ТекущиеДанные.ПолучитьРодителя());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеДокументыПредставлениеМаршрутаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ЭлектронныеДокументы.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(ТекущиеДанные.МаршрутПодписания) Тогда
		ПараметрыФормы.Вставить("Маршрут", ТекущиеДанные.МаршрутПодписания);
	Иначе
		ПараметрыФормы.Вставить("Маршрут", ЗначениеИзСтрокиXML(ТекущиеДанные.ДеревоМаршрута));
	КонецЕсли;
	
	ОткрытьФорму("Справочник.МаршрутыПодписанияБГУ.Форма.ВыборИзДокумента", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеДокументыПредставлениеМаршрутаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ЭлектронныеДокументы.ТекущиеДанные;
	
	Если ТипЗнч(ВыбранноеЗначение.Маршрут) = Тип("СправочникСсылка.МаршрутыПодписанияБГУ") Тогда
		ТекущиеДанные.МаршрутПодписания = ВыбранноеЗначение.Маршрут;
		ТекущиеДанные.ДеревоМаршрута = "";
		ТекущиеДанные.ПредставлениеМаршрута = Строка(ТекущиеДанные.МаршрутПодписания);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение.Маршрут) = Тип("ДанныеФормыДерево") Тогда
		ТекущиеДанные.МаршрутПодписания = "";
		ТекущиеДанные.ДеревоМаршрута = ЗначениеВСтрокуXML(ВыбранноеЗначение.Маршрут);
		ТекущиеДанные.ПредставлениеМаршрута = ВнутреннийЭДОКлиентСервер.ПредставлениеМаршрутаПоДереву(ВыбранноеЗначение.Маршрут);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлектронныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЭлектронныеДокументы.ТекущиеДанные;
	
	Если Поле.Имя = "ЭлектронныеДокументыПредставлениеДокумента"
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторКомандыПечати) Тогда
		ПоказатьЗначение(,ТекущиеДанные.УчетныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажкиДокументов(Команда)
	
	УстановитьФлажки(1);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиДокументов(Команда)
	
	УстановитьФлажки(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьПоВидуЭлектронногоДокумента(Команда)
	
	ВидыЭлектронныхДокументовВТаблице = Новый Соответствие;
	Для Каждого УчетныйДокумент Из ЭлектронныеДокументы.ПолучитьЭлементы() Цикл
		Для Каждого ЭлектронныйДокумент Из УчетныйДокумент.ПолучитьЭлементы() Цикл
			ВидыЭлектронныхДокументовВТаблице.Вставить(
				ЭлектронныйДокумент.ИдентификаторКомандыПечати, ЭлектронныйДокумент.ВидДокумента);
		КонецЦикла;
	КонецЦикла;
	
	СписокВидовЭлектронныхДокументов = Новый СписокЗначений;
	Для Каждого КлючЗначение Из ВидыЭлектронныхДокументовВТаблице Цикл
		СписокВидовЭлектронныхДокументов.Добавить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	СписокВидовЭлектронныхДокументов.СортироватьПоПредставлению();
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиВидовЭлектронныхДокументов", ЭтотОбъект);
	СписокВидовЭлектронныхДокументов.ПоказатьОтметкуЭлементов(Оповещение, "Виды электронных документов");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМаршрутВВыделенныхСтроках(Команда)
	
	Если НетВыделенныхСтрок() Тогда
		ТекстСообщения = НСтр("ru = 'Не выделено ни одной строки с электронным документом'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РежимЗаполненияМаршрута = "ВВыделенныхСтроках";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Маршрут", "");
	
	ОткрытьФорму("Справочник.МаршрутыПодписанияБГУ.Форма.ВыборИзДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМаршрутВОтмеченныхСтроках(Команда)
	
	Если НетОтмеченныхСтрок() Тогда
		ТекстСообщения = НСтр("ru = 'Не отмечено ни одной строки с электронным документом'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	РежимЗаполненияМаршрута = "ВОтмеченныхСтроках";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Маршрут", "");
	
	ОткрытьФорму("Справочник.МаршрутыПодписанияБГУ.Форма.ВыборИзДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если НетОтмеченныхСтрок() Тогда
		ТекстСообщения = НСтр("ru = 'Не отмечено ни одной строки с электронным документом'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ЕстьНезаполненныеМаршруты() Тогда
		ТекстСообщения = НСтр("ru = 'Есть отмеченные строки с незаполненнным маршрутом подписания'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	СоздатьДокументыНаСервере();
	
	РазвернутьДеревоДокументов();
	
	ТекстСообщения = НСтр("ru = 'Электронные документы созданы'");
	ПоказатьОповещениеПользователя(, , ТекстСообщения, БиблиотекаКартинок.Успешно32);
	
	Оповестить(ВнутреннийЭДОКлиент.ИмяСобытияОбновленияСостоянияВнутреннегоЭД());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуДокументов(УчетныеДокументы, Отказ = Ложь)
	
	СтрокиДерева = ЭлектронныеДокументы.ПолучитьЭлементы();
	СтрокиДерева.Очистить();
	
	ОбъектыСоСпециальнымиКомандамиПечати = ВнутреннийЭДОПереопределяемый.ОбъектыСоСпециальнымиКомандамиПечати();
	
	ОбъектыБезВнутреннихДокументов = Новый Соответствие;
	
	ЕстьАктуальныеДокументы = Ложь;
	
	Для Каждого УчетныйДокумент Из УчетныеДокументы Цикл
		
		СтрокаУчетныйДокумент = СтрокиДерева.Добавить();
		СтрокаУчетныйДокумент.УчетныйДокумент = УчетныйДокумент;
		СтрокаУчетныйДокумент.ПредставлениеДокумента = УчетныйДокумент;
		
		СтрокиУчетногоДокумента = СтрокаУчетныйДокумент.ПолучитьЭлементы();
		
		ЗаполненныеИдентификаторы = Новый Соответствие;
		
		ЕстьДокументы = Ложь;
		
		ПараметрыУчетногоДокумента = ВнутреннийЭДО.ПараметрыУчетногоДокумента(УчетныйДокумент);
		
		ИдентификаторДокумента = ПараметрыУчетногоДокумента.ИдентификаторДокумента;
		НомерДокумента = ПараметрыУчетногоДокумента.НомерДокумента;
		ДатаДокумента = ПараметрыУчетногоДокумента.ДатаДокумента;
		Организация = ПараметрыУчетногоДокумента.Организация;
		
		МетаданныеОбъекта = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
		
		Если ОбъектыСоСпециальнымиКомандамиПечати[ТипЗнч(УчетныйДокумент)] <> Неопределено Тогда
			КомандыПечати = ОбъектыСоСпециальнымиКомандамиПечати[ТипЗнч(УчетныйДокумент)];
		Иначе
			КомандыПечати = ВнутреннийЭДО.КомандыПечатиОбъекта(МетаданныеОбъекта);
		КонецЕсли; 
		
		ТаблицаКомандПечатиИсключений=ВнутреннийЭДО.ПодготовитьТаблицуИсключенийКомандПечати();
		ВнутреннийЭДОПереопределяемый.ПриЗаполненииТаблицыИсключенийКомандПечатиЭДО(ТаблицаКомандПечатиИсключений);
		
		Для Каждого Строка Из ВнутреннийЭДО.ЭлектронныеДокументыАктуальные(УчетныйДокумент) Цикл
			ЗаполненныеИдентификаторы.Вставить(Строка.ИдентификаторКомандыПечати, Истина);
			ЕстьДокументы = Истина;
			ЕстьАктуальныеДокументы = Истина;
		КонецЦикла;
		
		Для Каждого Строка Из ВнутреннийЭДО.ЭлектронныеДокументыИзНастройки(Организация, ИдентификаторДокумента) Цикл
			
			Если ЗаполненныеИдентификаторы[Строка.ИдентификаторКомандыПечати] = Истина Тогда
				Продолжить;
			КонецЕсли;
			
			КомандаПечати = ВнутреннийЭДО.КомандаПечатиПоИдентификатору(КомандыПечати, Строка.ИдентификаторКомандыПечати);
			Если КомандаПечати <> Неопределено
				И НЕ ВнутреннийЭДО.КомандаПечатиПодходитПоУсловиям(КомандаПечати, УчетныйДокумент) Тогда
				Продолжить;
			КонецЕсли; 
			
			ЗначениеПустойСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторДокумента, "ЗначениеПустойСсылки");
			СтруктураОтбора = Новый Структура;  
			СтруктураОтбора.Вставить("УчетныйДокумент", ЗначениеПустойСсылки);  
			СтруктураОтбора.Вставить("ИдентификаторКомандыПечати", Строка.ИдентификаторКомандыПечати);  
			
			КомандаПечатиИсключение=ТаблицаКомандПечатиИсключений.НайтиСтроки(СтруктураОтбора);
			
			Если КомандаПечатиИсключение.Количество() > 0  Тогда
				Продолжить;			
			КонецЕсли;
			
			НоваяСтрока = СтрокиУчетногоДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.УчетныйДокумент = УчетныйДокумент;
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.НомерДокумента = НомерДокумента;
			НоваяСтрока.ДатаДокумента = ДатаДокумента;
			НоваяСтрока.ПредставлениеМаршрута = Строка.МаршрутПодписания;
			ЕстьДокументы = Истина;
			
			Если ЗначениеЗаполнено(КомандаПечати) Тогда
				НоваяСтрока.ВидДокумента = КомандаПечати.Представление;
				НоваяСтрока.ПредставлениеДокумента = ВнутреннийЭДОКлиентСервер.ПредставлениеДокументаПоСвойствам(
					Новый Структура("ВидДокумента, ДатаДокумента, НомерДокумента",
						НоваяСтрока.ВидДокумента, ДатаДокумента, НомерДокумента));
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокиУчетногоДокумента.Количество() = 0 Тогда
			СтрокиДерева.Удалить(СтрокиДерева.Индекс(СтрокаУчетныйДокумент));
		КонецЕсли;
		
		Если НЕ ЕстьДокументы Тогда
			ОбъектыБезВнутреннихДокументов.Вставить(ИдентификаторДокумента, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого КлючЗначение Из ОбъектыБезВнутреннихДокументов Цикл
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа ""%1"" не настроено использование внутреннего документооборота ни для одной печатной формы'"),
			КлючЗначение.Ключ);
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
	КонецЦикла;
	
	Если СтрокиДерева.Количество() = 0 И ЕстьАктуальныеДокументы Тогда
		Сообщение = НСтр("ru = 'Все электронные документы уже созданы'");
		ОбщегоНазначения.СообщитьПользователю(Сообщение,,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НетВыделенныхСтрок()
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ЭлектронныеДокументы.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ЭлектронныеДокументы.ДанныеСтроки(ВыделеннаяСтрока);
		Если ЗначениеЗаполнено(ДанныеСтроки.ИдентификаторКомандыПечати) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция НетОтмеченныхСтрок()
	
	Для Каждого УчетныйДокумент Из ЭлектронныеДокументы.ПолучитьЭлементы() Цикл
		Для Каждого ЭлектронныйДокумент Из УчетныйДокумент.ПолучитьЭлементы() Цикл
			Если ЭлектронныйДокумент.Формировать Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ЕстьНезаполненныеМаршруты()
	
	Для Каждого УчетныйДокумент Из ЭлектронныеДокументы.ПолучитьЭлементы() Цикл
		Для Каждого ЭлектронныйДокумент Из УчетныйДокумент.ПолучитьЭлементы() Цикл
			Если ЭлектронныйДокумент.Формировать
				И НЕ ЗначениеЗаполнено(ЭлектронныйДокумент.ПредставлениеМаршрута) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура УстановитьФлажки(Значение)
	
	Для Каждого УчетныйДокумент Из ЭлектронныеДокументы.ПолучитьЭлементы() Цикл
		УчетныйДокумент.Формировать = Значение;
		Для Каждого ЭлектронныйДокумент Из УчетныйДокумент.ПолучитьЭлементы() Цикл
			ЭлектронныйДокумент.Формировать = Значение;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтметкуУРодителя(Родитель)
	
	ЕстьОтмеченные = Ложь;
	ЕстьНеотмеченные = Ложь;
	
	Для Каждого Строка Из Родитель.ПолучитьЭлементы() Цикл
		Если Строка.Формировать Тогда
			ЕстьОтмеченные = Истина;
		Иначе
			ЕстьНеотмеченные = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОтмеченные И ЕстьНеотмеченные Тогда
		Родитель.Формировать = 2;
	ИначеЕсли ЕстьОтмеченные Тогда
		Родитель.Формировать = 1;
	Иначе
		Родитель.Формировать = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиВидовЭлектронныхДокументов(Список, Параметры) Экспорт
	
	Если Список = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтмеченныеВидыЭлектронныхДокументов = Новый Соответствие;
	
	Для Каждого Элемент Из Список Цикл
		Если Элемент.Пометка Тогда
			ОтмеченныеВидыЭлектронныхДокументов.Вставить(Элемент.Значение, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УчетныйДокумент Из ЭлектронныеДокументы.ПолучитьЭлементы() Цикл
		Для Каждого ЭлектронныйДокумент Из УчетныйДокумент.ПолучитьЭлементы() Цикл
			Если ОтмеченныеВидыЭлектронныхДокументов[ЭлектронныйДокумент.ИдентификаторКомандыПечати] <> Неопределено Тогда
				ЭлектронныйДокумент.Формировать = 1;
			КонецЕсли;
		КонецЦикла;
		ЗаполнитьОтметкуУРодителя(УчетныйДокумент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораМаршрутаВВыделенныхСтроках(Маршрут)
	
	Если ТипЗнч(Маршрут) = Тип("СправочникСсылка.МаршрутыПодписанияБГУ") Тогда
		МаршрутПодписания = Маршрут;
		ДеревоМаршрута = "";
		ПредставлениеМаршрута = Строка(МаршрутПодписания);
	ИначеЕсли ТипЗнч(Маршрут) = Тип("ДанныеФормыДерево") Тогда
		МаршрутПодписания = "";
		ДеревоМаршрута = ЗначениеВСтрокуXML(Маршрут);
		ПредставлениеМаршрута = ВнутреннийЭДОКлиентСервер.ПредставлениеМаршрутаПоДереву(Маршрут);
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ЭлектронныеДокументы.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ЭлектронныеДокументы.ДанныеСтроки(ВыделеннаяСтрока);
		Если ЗначениеЗаполнено(ДанныеСтроки.ИдентификаторКомандыПечати) Тогда
			ДанныеСтроки.МаршрутПодписания = МаршрутПодписания;
			ДанныеСтроки.ДеревоМаршрута = ДеревоМаршрута;
			ДанныеСтроки.ПредставлениеМаршрута = ПредставлениеМаршрута;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораМаршрутаВОтмеченныхСтроках(Маршрут)
	
	Если ТипЗнч(Маршрут) = Тип("СправочникСсылка.МаршрутыПодписанияБГУ") Тогда
		МаршрутПодписания = Маршрут;
		ДеревоМаршрута = "";
		ПредставлениеМаршрута = Строка(МаршрутПодписания);
	ИначеЕсли ТипЗнч(Маршрут) = Тип("ДанныеФормыДерево") Тогда
		МаршрутПодписания = "";
		ДеревоМаршрута = ЗначениеВСтрокуXML(Маршрут);
		ПредставлениеМаршрута = ВнутреннийЭДОКлиентСервер.ПредставлениеМаршрутаПоДереву(Маршрут);
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Каждого УчетныйДокумент Из ЭлектронныеДокументы.ПолучитьЭлементы() Цикл
		Для Каждого ЭлектронныйДокумент Из УчетныйДокумент.ПолучитьЭлементы() Цикл
			Если ЭлектронныйДокумент.Формировать Тогда
				ЭлектронныйДокумент.МаршрутПодписания = МаршрутПодписания;
				ЭлектронныйДокумент.ДеревоМаршрута = ДеревоМаршрута;
				ЭлектронныйДокумент.ПредставлениеМаршрута = ПредставлениеМаршрута;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеВСтрокуXML(Значение)
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(Значение);
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеИзСтрокиXML(СтрокаXML)
	Если ПустаяСтрока(СтрокаXML) Тогда
		Возврат СтрокаXML;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеИзСтрокиXML(СтрокаXML);
	КонецЕсли;
КонецФункции

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	УчетныеДокументы = Новый Соответствие;
	МассивУчетныхДокументов = Новый Массив;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Для Каждого УчетныйДокумент Из ЭлектронныеДокументы.ПолучитьЭлементы() Цикл
		МассивУчетныхДокументов.Добавить(УчетныйДокумент.УчетныйДокумент);
		Для Каждого ЭлектронныйДокумент Из УчетныйДокумент.ПолучитьЭлементы() Цикл
			Если ЭлектронныйДокумент.Формировать Тогда
				
				ПараметрыЭД = Новый Структура;
				ПараметрыЭД.Вставить("ИдентификаторКомандыПечати", ЭлектронныйДокумент.ИдентификаторКомандыПечати);
				ПараметрыЭД.Вставить("МаршрутПодписания", ЭлектронныйДокумент.МаршрутПодписания);
				ПараметрыЭД.Вставить("ДеревоМаршрута", ЭлектронныйДокумент.ДеревоМаршрута);
				ПараметрыЭД.Вставить("Организация", ЭлектронныйДокумент.Организация);
				ПараметрыЭД.Вставить("ВидДокумента", ЭлектронныйДокумент.ВидДокумента);
				ПараметрыЭД.Вставить("ДатаДокумента", ЭлектронныйДокумент.ДатаДокумента);
				ПараметрыЭД.Вставить("НомерДокумента", ЭлектронныйДокумент.НомерДокумента);
				ПараметрыЭД.Вставить("Ответственный", Ответственный);
				
				Если УчетныеДокументы[УчетныйДокумент.УчетныйДокумент] = Неопределено Тогда
					УчетныеДокументы.Вставить(УчетныйДокумент.УчетныйДокумент, Новый Массив);
				КонецЕсли;
				
				УчетныеДокументы[УчетныйДокумент.УчетныйДокумент].Добавить(ПараметрыЭД);
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ВнутреннийЭДО.СоздатьЭлектронныеДокументы(УчетныеДокументы);
	
	ЗаполнитьТаблицуДокументов(МассивУчетныхДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоДокументов()
	
	Для Каждого ЭлементДерева Из ЭлектронныеДокументы.ПолучитьЭлементы() Цикл
		Элементы.ЭлектронныеДокументы.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
