#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	ОбновляемыВидыОпераций = Новый Массив;
	ВидыОперацийПоЗарплате = Метаданные.Перечисления.ВидыОперацийПоЗарплате.ЗначенияПеречисления;
	
	Для Каждого ТекЗначение Из ВидыОперацийПоЗарплате Цикл
		ОбновляемыВидыОпераций.Добавить(ТекЗначение.Имя);
	КонецЦикла;
	
	ЗаполнитьСоответствиеОпераций(ОбновляемыВидыОпераций);
	
КонецПроцедуры

Процедура ЗаполнитьСоответствиеОпераций(ОбновляемыВидыОпераций = Неопределено) Экспорт 
	
	ЧтениеXML = Новый ЧтениеXML;
	Макет = РегистрыСведений.СоответствиеОперацийУчетаЗарплаты.ПолучитьМакет("СоответствиеОпераций");
	ЧтениеXML.УстановитьСтроку(Макет.ПолучитьТекст());
	
	ДанныеПоУмолчанию = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ЧтениеXML);
	
	НаборЗаписей = РегистрыСведений.СоответствиеОперацийУчетаЗарплаты.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	ТаблицаСоответствий = НаборЗаписей.Выгрузить();
	
	НаборЗаписейИзменен = Ложь;
	
	Для Каждого Стр Из ДанныеПоУмолчанию.Данные Цикл
		
		ПерезаписыватьЗначения = Ложь;
		
		Если Не ЗначениеЗаполнено(Стр.БГУ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбновляемыВидыОпераций <> Неопределено Тогда
			ПерезаписыватьЗначения = Истина;
			Если ОбновляемыВидыОпераций.Найти(Стр.ЗГУ) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ОперацияЗГУ = Перечисления.ВидыОперацийПоЗарплате[Стр.ЗГУ];
		
		СтрокаЗаписи = ТаблицаСоответствий.Найти(ОперацияЗГУ, "ОперацияЗГУ"); 
		
		ЕстьСоответствие = (СтрокаЗаписи <> Неопределено);
		
		Если ЕстьСоответствие И ПерезаписыватьЗначения Тогда
			СтрокаЗаписи.ОперацияБГУ = Справочники.ВидыОперацийОтраженияЗарплаты[Стр.БГУ];
			НаборЗаписейИзменен = Истина;
		ИначеЕсли Не ЕстьСоответствие Тогда
		 	НовЗапись = ТаблицаСоответствий.Добавить();
		 
		 	НовЗапись.ОперацияБГУ = Справочники.ВидыОперацийОтраженияЗарплаты[Стр.БГУ];
		 	НовЗапись.ОперацияЗГУ = Перечисления.ВидыОперацийПоЗарплате[Стр.ЗГУ];
			НаборЗаписейИзменен = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НаборЗаписейИзменен Тогда
		НаборЗаписей.Очистить();
		НаборЗаписей.Загрузить(ТаблицаСоответствий);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли