#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Дата = Параметры.Дата;
	
	ТипНоменклатурыЭДО = Параметры.ТипНоменклатурыЭДО;
	
	НастройкаЭлементовФормы();

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипНоменклатурыЭДОПриИзменении(Элемент)
	
	НастройкаЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаРеквизитов

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	ТекущиеДанные.ИзменятьРеквизит = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ВозвращаемоеЗначение = Новый Структура;
	Для каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
	
		Если СтрокаТаблицы.ИзменятьРеквизит Тогда
			ВозвращаемоеЗначение.Вставить(СтрокаТаблицы.ИмяРеквизита, СтрокаТаблицы.ЗначениеРеквизита);
		КонецЕсли;
	
	КонецЦикла;
	ВозвращаемоеЗначение.Вставить("ТипНоменклатурыЭДО", ТипНоменклатурыЭДО);
	
	ОповеститьОВыборе(ВозвращаемоеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастройкаЭлементовФормы()
	
	ЗаполнитьСтрокиТаблицы();
	
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьСтрокиТаблицы()
	
	ТаблицаРеквизитов.Очистить();
	
	Если ТипНоменклатурыЭДО = 0 Тогда
		
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ТипНоменклатуры";
		НоваяСтрока.ПредставлениеРеквизита = "Тип номенклатуры";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры");
		
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ЕдиницаИзмерения";
		НоваяСтрока.ПредставлениеРеквизита = "Единица измерения";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения");
		
	ИначеЕсли ТипНоменклатурыЭДО = 1 Тогда
	
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ИмуществоКазны";
		НоваяСтрока.ПредставлениеРеквизита = "Имущество казны";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Булево");
		
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ВидНФА";
		НоваяСтрока.ПредставлениеРеквизита = "Вид НФА";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНФА");

		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ТипНФА";
		НоваяСтрока.ПредставлениеРеквизита = "Тип НФА";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНФА");

	ИначеЕсли ТипНоменклатурыЭДО = 2 Тогда
		
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ЕдиницаИзмерения";
		НоваяСтрока.ПредставлениеРеквизита = "Единица измерения";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения");
		
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "НомСтоимость";
		НоваяСтрока.ПредставлениеРеквизита = "Номинальная стоимость";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

