////////////////////////////////////////////////////////////////////////////////
// ИнвентаризацияКлиент
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура Редактирование0504087_РассчитатьФактическиеПоказатели(ФормаДокумента, ТекущиеДанные, ИмяИзмененногоПоля) Экспорт
	
	// Гр.7		=	Гр.5	х	Гр.6
	// Сумма		Цена		Количество
	
	ИменаКолонок = ФормаДокумента["КэшВариантФормированияОписи"]["ИменаКолонокЧисловыхПоказателей"];
	
	ИмяКоличествоФакт	= ИменаКолонок["КоличествоФакт"];
	ИмяСуммаФакт		= ИменаКолонок["СуммаФакт"];
	
	РассчитатьСумму = (ИмяИзмененногоПоля = ИмяКоличествоФакт ИЛИ ИмяИзмененногоПоля = "Цена");
	
	РассчитатьЦену = (ИмяИзмененногоПоля = ИмяСуммаФакт);
	
	Если РассчитатьСумму Тогда
		
		ТекущиеДанные[ИмяСуммаФакт] = ТекущиеДанные[ИмяКоличествоФакт] * ТекущиеДанные["Цена"];
		
	ИначеЕсли РассчитатьЦену Тогда
		
		Если ТекущиеДанные[ИмяКоличествоФакт] = 0 Тогда
			Цена = 0;
		Иначе
			Цена = ТекущиеДанные[ИмяСуммаФакт] / ТекущиеДанные[ИмяКоличествоФакт];
		КонецЕсли;
		
		ТекущиеДанные["Цена"] = Цена;
	КонецЕсли;
	
КонецПроцедуры

Процедура Редактирование0504087_РассчитатьРасхождениеВСтроке(ФормаДокумента, ТекущиеДанные) Экспорт
	
	// Предназначен для вызова в случае ВариантФормированияОписи = 1,2,3
	// 1. Опись с 2018 г. Счет в таблице (26 знаков)
	// 2. Опись с 2018 г. Счет в таблице (5 знаков)
	// 3. Опись с 2018 г. Счет в таблице (5 знаков). Одна строка - один объект
	
	ИменаКолонок = ФормаДокумента["КэшВариантФормированияОписи"]["ИменаКолонокЧисловыхПоказателей"];
	
	ИмяКоличествоУчет		= ИменаКолонок["КоличествоУчет"];
	ИмяКоличествоФакт		= ИменаКолонок["КоличествоФакт"];
	ИмяКоличествоИзлишек	= ИменаКолонок["КоличествоИзлишек"];
	ИмяКоличествоНедостача	= ИменаКолонок["КоличествоНедостача"];
	
	ИмяСуммаУчет			= ИменаКолонок["СуммаУчет"];
	ИмяСуммаФакт			= ИменаКолонок["СуммаФакт"];
	ИмяСуммаИзлишек			= ИменаКолонок["СуммаИзлишек"];
	ИмяСуммаНедостача		= ИменаКолонок["СуммаНедостача"];
	
	ДельтаКолво = ТекущиеДанные[ИмяКоличествоУчет] - ТекущиеДанные[ИмяКоличествоФакт];
	
	//
	// Недостача
	//
	ТекущиеДанные[ИмяКоличествоНедостача] = ?(ДельтаКолво>0, ДельтаКолво, 0);
	
	// Гр.14 = Гр.13 х (Гр.12 / Гр.11)
	Если ТекущиеДанные[ИмяКоличествоУчет] <> 0 Тогда
		
		Если ТекущиеДанные[ИмяКоличествоНедостача] = ТекущиеДанные[ИмяКоличествоУчет] Тогда
			// Отсутствует в полном количестве
			
			Сумма = ТекущиеДанные[ИмяСуммаУчет];
			
		Иначе
			
			Сумма = ТекущиеДанные[ИмяСуммаУчет] * ТекущиеДанные[ИмяКоличествоНедостача] / ТекущиеДанные[ИмяКоличествоУчет];
			
		КонецЕсли;
		
	Иначе
		
		Сумма = 0;
		
	КонецЕсли;
	
	ТекущиеДанные[ИмяСуммаНедостача] = Сумма;
	
	//
	// Излишек
	//
	ТекущиеДанные[ИмяКоличествоИзлишек] = ?(ДельтаКолво<0, -ДельтаКолво, 0);
	
	// Гр.16 = Гр.15 х Гр.5
	ТекущиеДанные[ИмяСуммаИзлишек] = ТекущиеДанные[ИмяКоличествоИзлишек] * ТекущиеДанные["Цена"];
	
	//
	// Не соответствует условиям актива
	//
	// Гр.18 = Гр.17 х (Гр.12 / Гр.11)
	Если ТекущиеДанные[ИмяКоличествоУчет] <> 0 Тогда
		
		Если ТекущиеДанные["КоличествоНеСоответствует"] = ТекущиеДанные[ИмяКоличествоУчет] Тогда
			// Не соответствует в полном количестве
			
			Сумма = ТекущиеДанные[ИмяСуммаУчет];
			
		Иначе
			
			Сумма = ТекущиеДанные[ИмяСуммаУчет] * ТекущиеДанные["КоличествоНеСоответствует"] / ТекущиеДанные[ИмяКоличествоУчет];
			
		КонецЕсли;
		
	Иначе
		
		Сумма = 0;
		
	КонецЕсли;
	
	ТекущиеДанные["СуммаНеСоответствует"] = Сумма;
	
КонецПроцедуры

Функция Редактирование0504087_БудутОчищеныКолонкиПриИзмененииВариантаФормированияОписи(ТекущееЗначениеВарианта, НовоеЗначениеВарианта) Экспорт
	
	// 0. Опись до 2018 г. Счет в шапке
	// 1. Опись с 2018 г. Счет в таблице (26 знаков)
	// 2. Опись с 2018 г. Счет в таблице (5 знаков)
	// 3. Опись с 2018 г. Счет в таблице (5 знаков). Одна строка - один объект
	
	БудутОчищеныКолонки = ((ТекущееЗначениеВарианта > 0 И НовоеЗначениеВарианта = 0)
		ИЛИ (ТекущееЗначениеВарианта = 1 И НовоеЗначениеВарианта > 1));
		
	Возврат БудутОчищеныКолонки;
	
КонецФункции


Процедура ОткрытьФормуГрупповогоЗаполненияСтрок(ФормаДокумента, ИмяТабличнойЧасти, ИмяЭлементаФормы = "") Экспорт
	
	Если ИмяЭлементаФормы = "" Тогда
		ИмяЭлементаФормы = ИмяТабличнойЧасти;
	КонецЕсли;
	
	КоличествоСтрок = ФормаДокумента.Элементы[ИмяЭлементаФормы].ВыделенныеСтроки.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		
		ТекстСообщения = НСтр("ru='Выделите несколько строк для выполнения группового заполнения'");
		
		ПоказатьПредупреждение(, ТекстСообщения, 20);
		
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяТабличнойЧасти",	ИмяТабличнойЧасти);
	ДополнительныеПараметры.Вставить("ИмяЭлементаФормы",	ИмяЭлементаФормы);
	
	ОповещениеВыбор = Новый ОписаниеОповещения("ЗакрытаФормаГрупповогоЗаполненияСтрок", ФормаДокумента, ДополнительныеПараметры);
	
	ПараметрыФормы = ФормаДокумента.ПолучитьПараметрыФормыГрупповогоЗаполненияСтрок(ИмяТабличнойЧасти, КоличествоСтрок);
	
	Если ИмяТабличнойЧасти = "Инвентаризация" ИЛИ ИмяТабличнойЧасти = "Материалы" Тогда
		
		ИмяФормы = "ОбщаяФорма.ИнвентаризацияГрупповоеЗаполнениеСтрокНФА";
		
	Иначе
		
		ИмяФормы = "ОбщаяФорма.ИнвентаризацияГрупповоеЗаполнениеСтрокРасхождения";
		
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормы, ПараметрыФормы,,,,, ОповещениеВыбор, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


Процедура ОткрытьВыборКомиссии(Форма) Экспорт
	
	Перем Отказ, РеквизитыПриказаКомиссии;
	
	ЗначенияПараметров = ПолучитьОрганизациюДату(Форма, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИменаРеквизитов = ОбщегоНазначенияБГУКлиент.СтруктураИменРеквизитовВыбораПредседателяКомиссии(
		"ДолжностьПредседателяКомиссии",
		"ФамилияПредседателяКомиссии",
		"ИмяПредседателяКомиссии",
		"ОтчествоПредседателяКомиссии");
	
	ТипДокумента = ТипЗнч(Форма.Объект.Ссылка);
	
	ЕстьРеквизитыПриказаКомиссии = (
		ТипДокумента = Тип("ДокументСсылка.ИнвентаризацияДрагКамнейВИК")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ИнвентаризацияДрагКамнейВНФА")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ИнвентаризацияДрагМеталловВИК")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ИнвентаризацияДрагМеталловВНФА")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ИнвентаризацияИК")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ИнвентаризацияКассы")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ИнвентаризацияМЗ")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ИнвентаризацияОС")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ИнвентаризацияОстатковНаСчетах")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ИнвентаризацияРасчетовПоПоступлениям")
		
		ИЛИ ТипДокумента = Тип("ДокументСсылка.ВедомостьИнвентаризации")
		ИЛИ ТипДокумента = Тип("ДокументСсылка.УдалитьАктОРезультатахИнвентаризации")
	);
	
	Если ЕстьРеквизитыПриказаКомиссии Тогда
		РеквизитыПриказаКомиссии = Новый Структура();
		РеквизитыПриказаКомиссии.Вставить("НомерПриказа", "НомерПриказаКомиссии");
		РеквизитыПриказаКомиссии.Вставить("ДатаПриказа", "ДатаПриказаКомиссии");
	КонецЕсли;
		
	ОбщегоНазначенияБГУКлиент.НачатьВыборПостоянноДействующейКомиссии(
		Форма,
		ИменаРеквизитов,
		РеквизитыПриказаКомиссии);
	
КонецПроцедуры

Процедура ОткрытьПодборКомиссии(Форма) Экспорт
	
	Перем Отказ;
	
	ЗначенияПараметров = ПолучитьОрганизациюДату(Форма, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Свойство Период
	ОбщегоНазначенияБГУКлиент.ОткрытьПодборКомиссии(Форма.Элементы.СоставКомиссии, ЗначенияПараметров);
	
КонецПроцедуры

Процедура ОткрытьВыборПредседателяКомиссии(Форма) Экспорт
	
	Перем Отказ;
	
	ЗначенияПараметров = ПолучитьОрганизациюДату(Форма, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИменаРеквизитов = ОбщегоНазначенияБГУКлиент.СтруктураИменРеквизитовВыбораПредседателяКомиссии(
		"ДолжностьПредседателяКомиссии",
		"ФамилияПредседателяКомиссии",
		"ИмяПредседателяКомиссии",
		"ОтчествоПредседателяКомиссии");
	
	ОбщегоНазначенияБГУКлиент.НачатьВыборПредседателяКомиссии(Форма, ИменаРеквизитов);
	
КонецПроцедуры

Процедура ДатаИнвентаризацииПриИзменении_ПроверитьНеобходимостьИзмененияСоставаГруппСчетов(Форма) Экспорт
	
	Если ЗначенияВОдномДиапазоне(
		Форма["КэшДатаИнвентаризации"],
		Форма.Объект["ДатаИнвентаризации"],
		Форма["ДатыИзмененияСоставаГруппСчетов"]) Тогда
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ДатаИнвентаризацииПриИзменении_ИзменениеСоставаГруппСчетовНеТребуется", Форма);
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗавершении);
		
		Возврат;
		
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Новое значение даты инвентаризации находится в периоде действия другого состава счетов учета НФА.
		|Список групп счетов инвентаризации будет составлен заново.
		|Табличные части документа буду очищены.
		|
		|Продолжить и сменить дату инвентаризации?'");
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ДатаИнвентаризацииПриИзменении_ПодтвержденоИзменениеСоставаГруппСчетов", Форма);
	
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

Функция СчетДействуетНаДату(СвойстваСчета, ПроверяемаяДата) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПроверяемаяДата) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Дата1 = СвойстваСчета.ДатаНачалаДействия;
	Дата2 = СвойстваСчета.ДатаОкончанияДействия;
	
	Если НЕ ЗначениеЗаполнено(Дата1) И НЕ ЗначениеЗаполнено(Дата2) Тогда
		СчетДействует = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Дата1) И ЗначениеЗаполнено(Дата2) Тогда
		СчетДействует = (ПроверяемаяДата <= Дата2);
		
	ИначеЕсли ЗначениеЗаполнено(Дата1) И НЕ ЗначениеЗаполнено(Дата2) Тогда
		СчетДействует = (Дата1 <= ПроверяемаяДата);
		
	Иначе
		// ЗначениеЗаполнено(Дата1) И ЗначениеЗаполнено(Дата2) Тогда
		
		СчетДействует = (Дата1 <= ПроверяемаяДата И ПроверяемаяДата <= Дата2);
		
	КонецЕсли;
	
	Возврат СчетДействует;
	
КонецФункции

Процедура ОткрытьФормуВыбораКЭККИЕ(Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Коды = Новый Массив();
	Коды.Добавить("000");
	Коды.Добавить("001");
	Коды.Добавить("002");
	Коды.Добавить("003");
	Коды.Добавить("004");
	Коды.Добавить("005");
	Коды.Добавить("006");
	Коды.Добавить("007");
	Коды.Добавить("008");
	Коды.Добавить("009");
	
	Отбор = Новый Структура();
	Отбор.Вставить("Код", Новый ФиксированныйМассив(Коды));
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПоказатьСкрытыеКоды",	Истина);
	ПараметрыФормы.Вставить("Отбор",				Отбор);
	
	ОткрытьФорму("Справочник.КОСГУ.ФормаВыбора", ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ВыбратьИУстановитьСтатусОбъектаДляИнвентаризации(ФормаДокумента, ТекДанные, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ФормаДокумента",	ФормаДокумента);
	ДополнительныеПараметры.Вставить("ТекДанные",		ТекДанные);
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораСтатусаОбъектаДляИнвентаризации", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.СтатусыОбъектовДляИнвентаризации.ФормаВыбора",,,,,,ОписаниеОповещенияВыбор, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПослеВыбораСтатусаОбъектаДляИнвентаризации(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ТекДанные.СтатусОбъекта = ИнвентаризацияВызовСервера.ПолучитьПредставлениеСтатусаОбъектаДляИнвентаризации(ВыбранноеЗначение);
	
	ДополнительныеПараметры.ФормаДокумента.Модифицированность = Истина;
	
КонецПроцедуры

#Область ЦепочкиИзмененийРешения

Процедура ПоказатьОшибкиЦепочки(Форма) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("АдресДокумента",	Форма.АдресХранилищаОшибкиЦепочки);
	ПараметрыФормы.Вставить("Заголовок",		НСтр("ru='Ошибки построения цепочки документов'"));
	
	ОткрытьФорму("ОбщаяФорма.ФормаПросмотраТабличногоДокумента", ПараметрыФормы, Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ВыбраноРешениеОПроведенииИнвентаризации(ФормаОписи, ВызыватьИсключение = Истина) Экспорт
	
	ОбъектОписи = ФормаОписи.Объект;
	
	РешениеОПроведенииИнвентаризации = ОбъектОписи.РешениеОПроведенииИнвентаризации;
	
	Если Не ЗначениеЗаполнено(РешениеОПроведенииИнвентаризации) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ИнвентаризацияВызовСервера.ПолучитьПараметрыФормыВыбораДанныхИзРешения(
		ОбъектОписи.Ссылка,
		РешениеОПроведенииИнвентаризации,
		ФормаОписи.УникальныйИдентификатор,
		ВызыватьИсключение);
		
	Если ПараметрыФормы.РешениеСодержитДанныеДляЗаполненияОписи Тогда
		ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ЗакрытаФормаВыбораДанныхИзРешенияОПроведенииИнвентаризации", ФормаОписи);
		
		ОткрытьФорму("ОбщаяФорма.ВыборДанныхИзРешенияОПроведенииИнвентаризации", ПараметрыФормы, ФормаОписи,,,, ОписаниеОповещенияВыбор, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьОЗаполненииНаОснованииРешенияОПроведенииИнвентаризации() Экспорт
	
	ТекстСообщения = НСтр("ru='Документ успешно заполнен на основании Решения о проведении инвентаризации'");
	
	ПоказатьПредупреждение(, ТекстСообщения, 20);
	
КонецПроцедуры

Процедура НажатиеГиперссылкиОкружающегоДокумента(Элемент, Форма, СтандартнаяОбработка = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ОкружающиеДокументыЦепочки = Форма.ОкружающиеДокументыЦепочки;
	
	ИмяЭлемента = Элемент.Имя;
	
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "НадписьДокументЦепочки", "");
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "Представление", "");
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "ДекорацияДокументЦепочки", "");
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "НеЯвляетсяПоследним", "");
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "ЯвляетсяПоследним", "");
	
	ДокументСсылка = ОкружающиеДокументыЦепочки[ИмяЭлемента].ДокументСсылка;
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ПоказатьЗначение(, ДокументСсылка);
		
	ИначеЕсли ИмяЭлемента = "Первый" И Не Форма.Объект.ПометкаУдаления Тогда
		ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораРешения", Форма);
		
		Отбор = Новый Структура();
		Отбор.Вставить("Организация", Форма.Объект.Организация);
		
		ПараметрыВыбора = Новый Структура();
		ПараметрыВыбора.Вставить("Отбор", Отбор);
		
		ОткрытьФорму("Документ.РешениеОПроведенииИнвентаризации.ФормаВыбора", ПараметрыВыбора, Форма,,,, ОписаниеОповещенияВыбор, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСлужебныеКолонкиТаблицыОбъектыВТекущейСтроке(ФормаДокумента) Экспорт
	
	ТекущиеДанные = ФормаДокумента.Элементы.Объекты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураТекущиеДанные = Новый Структура("Счет,ДатаИнвентаризации,ТипИзменения");
	
	ЗаполнитьЗначенияСвойств(СтруктураТекущиеДанные, ТекущиеДанные);
	
	СтруктураТекущиеДанные.Вставить("КодФормы");
	СтруктураТекущиеДанные.Вставить("ЕстьРеквизитМОЛ");
	СтруктураТекущиеДанные.Вставить("ОдинаковоеНаличиеРеквизитаМОЛ");
	
	Если ИнвентаризацияКлиентСервер.ЭтоДокументИзмененияРешения(ФормаДокумента.Объект.Ссылка) Тогда
		ДатаРешения = НачалоДня(ФормаДокумента.ОкружающиеДокументыЦепочки.Первый.Дата);
	Иначе
		ДатаРешения = НачалоДня(ФормаДокумента.Объект.Дата);
	КонецЕсли;
	
	ИнвентаризацияВызовСервера.ЗаполнитьСлужебныеКолонкиТаблицыОбъектыВТекущейСтроке(
		ФормаДокумента.ТаблицаНастроекЗаполненияОписейПоРешению,
		СтруктураТекущиеДанные,
		ДатаРешения);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтруктураТекущиеДанные, "КодФормы,ЕстьРеквизитМОЛ,ОдинаковоеНаличиеРеквизитаМОЛ");
	
КонецПроцедуры

#КонецОбласти

#Область РазбивкаСтрокиИнвентаризацииНФА

&НаКлиенте
Функция ПараметрыФормыРазбивкиСтрокиИнвентаризацииНфа() Экспорт
	
	СоответствиеИмен = Новый Структура("
		|КоличествоФакт,
		|СуммаФакт,
		|КоличествоУчет,
		|СуммаУчет");
	
	Параметрыформы = Новый Структура();
	Параметрыформы.Вставить("ИмяТабличнойЧасти",	"");
	Параметрыформы.Вставить("СоответствиеИмен",		СоответствиеИмен);
	Параметрыформы.Вставить("ТочностьКоличества",	0);
	Параметрыформы.Вставить("ТочностьЦены",			2);
	
	Возврат Параметрыформы;
	
КонецФункции

// ПараметрыФормы - Структура - см. ПараметрыФормыРазбивкиСтрокиИнвентаризацииНфа()
&НаКлиенте
Процедура ОткрытьФормуРазбивкиСтрокиИнвентаризацииНфа(ФормаДокумента, СтрокаТаблицы, Параметрыформы) Экспорт
	
	Если СтрокаТаблицы = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru='Выберите разбиваемую строку'"));
		
		Возврат;
	КонецЕсли;
	
	СоответствиеИмен	= Параметрыформы.СоответствиеИмен;
	ТочностьКоличества	= Параметрыформы.ТочностьКоличества;
	
	РазбиваемаяСтрока = Новый Структура("
		|НомерСтроки,
		|КоличествоНеСоответствует,
		|СуммаНеСоответствует,
		|КоличествоФакт,
		|СуммаФакт,
		|КоличествоУчет,
		|СуммаУчет,
		|СтатусОбъекта,
		|ЦелеваяФункцияАктива,
		|Примечание");
	
	ЗаполнитьЗначенияСвойств(РазбиваемаяСтрока, СтрокаТаблицы);
	
	Для Каждого Элемент Из СоответствиеИмен Цикл
		ПолеФормыРазбивки	= Элемент.Ключ;
		ПолеДокумента 		= Элемент.Значение;
		
		Если ЗначениеЗаполнено(ПолеДокумента) Тогда
			РазбиваемаяСтрока[ПолеФормыРазбивки] = СтрокаТаблицы[ПолеДокумента];
		КонецЕсли;
	КонецЦикла;
	
	НовыеПараметрыФормы = Новый Структура();
	НовыеПараметрыФормы.Вставить("РазбиваемаяСтрока", РазбиваемаяСтрока);
	НовыеПараметрыФормы.Вставить("ТочностьКоличества", Параметрыформы.ТочностьКоличества);
	НовыеПараметрыФормы.Вставить("ТочностьЦены", Параметрыформы.ТочностьЦены);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ФормаДокумента",		ФормаДокумента);
	ДополнительныеПараметры.Вставить("ИмяТабличнойЧасти",	Параметрыформы.ИмяТабличнойЧасти);
	ДополнительныеПараметры.Вставить("РазбиваемаяСтрока",	РазбиваемаяСтрока);
	ДополнительныеПараметры.Вставить("СоответствиеИмен",	СоответствиеИмен);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытаФормаРазбивкиСтрокиИнвентаризацииНфа", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.ИнвентаризацияРазбивкаСтрокиНфа", НовыеПараметрыФормы, ФормаДокумента,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытаФормаРазбивкиСтрокиИнвентаризацииНфа(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФормаДокумента = ДополнительныеПараметры.ФормаДокумента;
	
	Объект = ФормаДокумента.Объект;
	
	ТабличнаяЧасть = Объект[ДополнительныеПараметры.ИмяТабличнойЧасти];
	
	СоответствиеИмен = ДополнительныеПараметры.СоответствиеИмен;
	
	ИндексРазбиваемойСтроки = ДополнительныеПараметры.РазбиваемаяСтрока.НомерСтроки - 1;
	
	РазбиваемаяСтрока = ТабличнаяЧасть[ИндексРазбиваемойСтроки];
	
	Для Счетчик = 1 По РезультатВыбора.Количество() - 1 Цикл
		НоваяСтрока = ТабличнаяЧасть.Вставить(ИндексРазбиваемойСтроки + 1);
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РазбиваемаяСтрока);
	КонецЦикла;
	
	ИндексыСтрок = Новый Массив();
	
	ИндексСтроки = ИндексРазбиваемойСтроки;
	
	Для Каждого СтруктураСтроки Из РезультатВыбора Цикл
		
		ИндексыСтрок.Добавить(ИндексСтроки);
		
		СтрокаТаблицы = ТабличнаяЧасть[ИндексСтроки];
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураСтроки);
	
		Для Каждого Элемент Из СоответствиеИмен Цикл
			ПолеФормыРазбивки	= Элемент.Ключ;
			ПолеДокумента 		= Элемент.Значение;
			
			Если ЗначениеЗаполнено(ПолеДокумента) Тогда
				СтрокаТаблицы[ПолеДокумента] = СтруктураСтроки[ПолеФормыРазбивки];
			КонецЕсли;
		КонецЦикла;
		
		ИндексСтроки = ИндексСтроки + 1;
		
	КонецЦикла;
	
	ФормаДокумента.Модифицированность = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеРазбивкиСтрокиИнвентаризацииНфа", ФормаДокумента);
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, ИндексыСтрок);
	
КонецПроцедуры

#КонецОбласти

#Область ИнвентаризационныеОписи61н

Процедура СоздатьДокументРасписки(ФормаДокументаОписи) Экспорт
	
	ОбъектОписи = ФормаДокументаОписи.Объект;
	
	СтрокаТаблицыНастроек = ФормаДокументаОписи.ДанныеПанелиРасписки.СтрокаТаблицыНастроек;
	
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("Организация",	ОбъектОписи.Организация);
	ДанныеЗаполнения.Вставить("ДокументОписи",	ОбъектОписи.Ссылка);
	ДанныеЗаполнения.Вставить("Сотрудник",		ОбъектОписи[СтрокаТаблицыНастроек.ИмяРеквизитаСотрудникДляРасписки]);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СозданиеИзФормыОписи",	Истина);
	ПараметрыФормы.Вставить("Основание",			ДанныеЗаполнения);
	
	ОткрытьФорму("Документ.РаспискаИнвентаризации.ФормаОбъекта", ПараметрыФормы, ФормаДокументаОписи);
	
КонецПроцедуры

Процедура ПриНажатииНадписиРасписка(ФормаДокументаОписи, ДополнительноПроверяемыеПоляПередСозданиемРасписки = Неопределено) Экспорт
	
	ДанныеПанелиРасписки = ФормаДокументаОписи.ДанныеПанелиРасписки;
	
	Если ЗначениеЗаполнено(ДанныеПанелиРасписки.Расписка) Тогда
		ПоказатьЗначение(, ДанныеПанелиРасписки.Расписка);
		
		Возврат;
	КонецЕсли;
	
	ПроверитьИСоздатьДокументРасписки(ФормаДокументаОписи, ДополнительноПроверяемыеПоляПередСозданиемРасписки);
	
КонецПроцедуры

Процедура ПриНажатииГиперссылкиКомментарияПанелиРасписки(ФормаДокументаОписи) Экспорт
	
	ДанныеПанелиРасписки = ФормаДокументаОписи.ДанныеПанелиРасписки;
	
	СписокВыбораКомментарий = ДанныеПанелиРасписки.СписокВыбораКомментарий;
	
	Если СписокВыбораКомментарий.Количество() = 1 Тогда
		ПоказатьЗначение(, СписокВыбораКомментарий[0].Значение);
		
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ВыбранаРаспискаИзСпискаГиперссылкиКомментарияРасписки", ЭтотОбъект);
	
	ФормаДокументаОписи.ПоказатьВыборИзСписка(ОписаниеОповещенияВыбор, ДанныеПанелиРасписки.СписокВыбораКомментарий, ФормаДокументаОписи.Элементы.ДекорацияРаспискаКомментарийГиперссылкаНадпись);
	
КонецПроцедуры

Процедура ВыбранаРаспискаИзСпискаГиперссылкиКомментарияРасписки(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ЭлементСпискаЗначений") Тогда
		ПоказатьЗначение(, ВыбранноеЗначение.Значение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриНажатииГиперссылкиКомментарияПанелиОписи(ФормаДокументаРасписки) Экспорт
	
	ДанныеПанелиОписи = ФормаДокументаРасписки.ДанныеПанелиОписи;
	
	СписокВыбораКомментарий = ДанныеПанелиОписи.СписокВыбораКомментарий;
	
	Если СписокВыбораКомментарий.Количество() = 1 Тогда
		ПоказатьЗначение(, СписокВыбораКомментарий[0].Значение);
		
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ВыбранаОписьИзСпискаГиперссылкиКомментарияОписи", ЭтотОбъект);
	
	ФормаДокументаРасписки.ПоказатьВыборИзСписка(ОписаниеОповещенияВыбор, ДанныеПанелиОписи.СписокВыбораКомментарий, ФормаДокументаРасписки.Элементы.ДекорацияОписьКомментарийГиперссылкаНадпись);
	
КонецПроцедуры

Процедура ВыбранаОписьИзСпискаГиперссылкиКомментарияОписи(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ЭлементСпискаЗначений") Тогда
		ПоказатьЗначение(, ВыбранноеЗначение.Значение);
	КонецЕсли;
	
КонецПроцедуры


Процедура НачатьВводТекстовойСтрокиЗаключенияКомиссии(ФормаДокумента, СтандартнаяОбработка, ИмяТабличнойЧасти, Знач ДопПараметрыВыбора = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = ФормаДокумента.Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ФормаДокумента",		ФормаДокумента);
	ДополнительныеПараметры.Вставить("ТекДанные",			ТекДанные);
	ДополнительныеПараметры.Вставить("ДопПараметрыВыбора",	ДопПараметрыВыбора);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаТекстовойСтрокиЗаключенияКомиссии", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВводСтроки(Оповещение, ТекДанные.ЗаключениеКомиссии, НСтр("ru='Заключение комиссии по результатам инвентаризации'"),, Истина);
	
КонецПроцедуры

Процедура ПослеВводаТекстовойСтрокиЗаключенияКомиссии(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ТекДанные.ЗаключениеКомиссии = ВыбранноеЗначение;
	
	ДополнительныеПараметры.ФормаДокумента.Модифицированность = Истина;
	
	Если ДополнительныеПараметры.ДопПараметрыВыбора <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ДопПараметрыВыбора.ОписаниеОповещенияПослеИзмененияЗаключенияКомиссии);
	КонецЕсли;
	
КонецПроцедуры


Процедура ПроверитьЗаписьДокумента(ФормаДокумента, ИмяКомандыВСообщении, ИмяСледующейПроцедуры, ПараметрыСледующейПроцедуры = Неопределено) Экспорт
	
	Объект = ФормаДокумента.Объект;
	
	Если Объект.Ссылка.Пустая() Или ФормаДокумента.Модифицированность Тогда
		ШаблонВопроса = НСтр("ru = 'Для выполнения команды
			|""%1""
			|данные будут записаны. Продолжить?'");
		
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонВопроса, ИмяКомандыВСообщении);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Записать и продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ФормаДокумента",				ФормаДокумента);
		ДополнительныеПараметры.Вставить("ИмяСледующейПроцедуры",		ИмяСледующейПроцедуры);
		ДополнительныеПараметры.Вставить("ПараметрыСледующейПроцедуры",	ПараметрыСледующейПроцедуры);
		
		Обработчик = Новый ОписаниеОповещения("ПодтвержденаЗаписьДокумента", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(Обработчик, ТекстВопроса, Кнопки);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения(ИмяСледующейПроцедуры, ФормаДокумента, ПараметрыСледующейПроцедуры);
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодтвержденаЗаписьДокумента(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.ОК Тогда
		ФормаДокумента				= ДополнительныеПараметры.ФормаДокумента;
		ИмяСледующейПроцедуры		= ДополнительныеПараметры.ИмяСледующейПроцедуры;
		ПараметрыСледующейПроцедуры	= ДополнительныеПараметры.ПараметрыСледующейПроцедуры;
		
		ФормаДокумента.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		
		ОписаниеОповещения = Новый ОписаниеОповещения(ИмяСледующейПроцедуры, ФормаДокумента, ПараметрыСледующейПроцедуры);
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры


Процедура СоставКомиссииОтсутствуетПриИзменении(ФормаДокумента, Элемент, ИмяТаблицыСоставКомиссии = "СоставКомиссии") Экспорт
	
	ТекущиеДанные = ФормаДокумента.Элементы[ИмяТаблицыСоставКомиссии].ТекущиеДанные;
	
	Если Не ТекущиеДанные.Отсутствует Тогда
		ТекущиеДанные.ПричинаОтсутствия = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура СоставКомиссииПричинаОтсутствияПриИзменении(ФормаДокумента, Элемент, ИмяТаблицыСоставКомиссии = "СоставКомиссии") Экспорт
	
	ТекущиеДанные = ФормаДокумента.Элементы[ИмяТаблицыСоставКомиссии].ТекущиеДанные;
	
	ТекущиеДанные.Отсутствует = Не ПустаяСтрока(ТекущиеДанные.ПричинаОтсутствия);
	
КонецПроцедуры

Процедура СоставКомиссииПричинаОтсутствияНачалоВыбора(ФормаДокумента, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры


Процедура НачатьВводТекстовойСтроки(ФормаДокумента, ТекДанные, ИмяПоля, ТекстПодсказки, СтандартнаяОбработка, СохранитьИзменения = Истина) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ФормаДокумента",		ФормаДокумента);
	ДополнительныеПараметры.Вставить("ТекДанные",			ТекДанные);
	ДополнительныеПараметры.Вставить("ИмяПоля",				ИмяПоля);
	ДополнительныеПараметры.Вставить("СохранитьИзменения",	СохранитьИзменения);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаТекстовойСтроки", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВводСтроки(Оповещение, ТекДанные[ИмяПоля], ТекстПодсказки,, Истина);
	
КонецПроцедуры

Процедура ПослеВводаТекстовойСтроки(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.СохранитьИзменения Тогда
		Возврат;
	КонецЕсли;
	
	ФормаДокумента	= ДополнительныеПараметры.ФормаДокумента;
	ТекДанные		= ДополнительныеПараметры.ТекДанные;
	ИмяПоля			= ДополнительныеПараметры.ИмяПоля;
	
	ТекДанные[ИмяПоля] = ВыбранноеЗначение;
	
	ФормаДокумента.Модифицированность = Истина;
	
КонецПроцедуры


Функция ПолучитьДополнительныеПараметрыДляВыбораЗаключенияКомиссииПоИнвОписи(Знач ФормаДокумента, Знач ИмяПроцедуры = "ПослеИзмененияЗаключенияКомиссии") Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияПослеИзмененияЗаключенияКомиссии", Новый ОписаниеОповещения(ИмяПроцедуры, ФормаДокумента));
	
	Возврат ДополнительныеПараметры;
	
КонецФункции


Процедура НачатьВыборЗаключенияКомиссииПоИнвОписи(ФормаДокумента, ТекДанные, СтандартнаяОбработка, Знач ДопПараметрыВыбора = Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументОписи", ФормаДокумента.Объект.Ссылка);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ФормаДокумента",		ФормаДокумента);
	ДополнительныеПараметры.Вставить("ТекДанные",			ТекДанные);
	ДополнительныеПараметры.Вставить("ДопПараметрыВыбора",	ДопПараметрыВыбора);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЗаключенияКомиссииПоИнвОписи", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.ЗаключенияКомиссииПоИнвентаризационнымОписям.ФормаВыбора", ПараметрыФормы, ФормаДокумента,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПослеВыбораЗаключенияКомиссииПоИнвОписи(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	ФормаДокумента		= ДополнительныеПараметры.ФормаДокумента;
	ТекДанные			= ДополнительныеПараметры.ТекДанные;
	ДопПараметрыВыбора	= ДополнительныеПараметры.ДопПараметрыВыбора;
	
	ТекстЗаключения = ИнвентаризацияВызовСервера.ПолучитьТекстЗаключенияКомиссииПоОписи(ВыбранноеЗначение);
	
	ТекДанные.ЗаключениеКомиссии = ТекстЗаключения;
	
	ФормаДокумента.Модифицированность = Истина;
	
	Если ДопПараметрыВыбора <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДопПараметрыВыбора.ОписаниеОповещенияПослеИзмененияЗаключенияКомиссии);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьМестоПроведенияИнвентаризации(ФормаДокумента, СтандартнаяОбработка, ПроцедураОбратногоВызова = "") Экспорт
	
	МестоИнвентаризации = ФормаДокумента.Объект.МестоИнвентаризации;
	
	Если ТипЗнч(МестоИнвентаризации) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(ПроцедураОбратногоВызова) Тогда
			Оповещение = Новый ОписаниеОповещения(ПроцедураОбратногоВызова, ФормаДокумента);
		Иначе
			Оповещение = Новый ОписаниеОповещения("ВведеноСтроковоеЗначениеМестаИнвентаризацииОбработчикПоУмолчанию", ЭтотОбъект);
		КонецЕсли;
		
		ПоказатьВводСтроки(Оповещение, МестоИнвентаризации, НСтр("ru='Место проведения инвентаризации'"));
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВведеноСтроковоеЗначениеМестаИнвентаризацииОбработчикПоУмолчанию(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	// Заглушка.
	
	Возврат;
	
КонецПроцедуры

Процедура НачатьВыборМестаИнвентаризации(ФормаДокумента, Элемент, ТекДанные, СтандартнаяОбработка) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекДанные, "КодФормы") Тогда
		Возврат;
	КонецЕсли;
	
	ДопустимВыборМестаХранения = СтрНайти(ТекДанные.КодФормы, "0504087") > 0
		Или СтрНайти(ТекДанные.КодФормы, "0510465")
		Или СтрНайти(ТекДанные.КодФормы, "0510466");
	
	Если Не ДопустимВыборМестаХранения Тогда
		// Применим лишь строковый тип места инвентаризации.
		ИнвентаризацияКлиент.НачатьВводТекстовойСтроки(ФормаДокумента, ТекДанные, "МестоИнвентаризации", НСтр("ru='Место проведения инвентаризации'"), СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОткрытииМестаИнвентаризации(ФормаДокумента, ТекДанные, СтандартнаяОбработка, ИмяПоляМестоИнвентаризации = "МестоИнвентаризации", СохранитьИзменения = Истина) Экспорт
	
	Если ТипЗнч(ТекДанные.МестоИнвентаризации) = Тип("СправочникСсылка.МестаХранения") И ЗначениеЗаполнено(ТекДанные.МестоИнвентаризации) Тогда
		Возврат;
	КонецЕсли;
	
	ИнвентаризацияКлиент.НачатьВводТекстовойСтроки(ФормаДокумента, ТекДанные, ИмяПоляМестоИнвентаризации, НСтр("ru='Место проведения инвентаризации'"), СтандартнаяОбработка, СохранитьИзменения);
	
КонецПроцедуры

// 0510465

Процедура ПриИзмененииПоказателяВИнвОписи0510465(ВидДокумента, ТекДанные, ИмяТЧ, ИмяЭлемента, ПараметрыРазбивкиСтроки = Неопределено, РассчитыватьЦену = Ложь) Экспорт
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяТЧ = "Раздел1" Тогда
		
		// Раздел 1
		
		Если ИмяЭлемента = "Раздел1НачальныйНомер" Тогда
			ОбозначениеИзмененногоПоля = "НомерНач";
			
		ИначеЕсли ИмяЭлемента = "Раздел1КонечныйНомер" Тогда
			ОбозначениеИзмененногоПоля = "НомерКон";
			
		ИначеЕсли ИмяЭлемента = "Раздел1Цена" Тогда
			ОбозначениеИзмененногоПоля = "Цена";
			
		ИначеЕсли ИмяЭлемента = "Раздел1Количество" Тогда
			ОбозначениеИзмененногоПоля = "Количество";
		Иначе
			Возврат;
		КонецЕсли;
		
		ОбновитьПоказателиВСтроке0510465(ВидДокумента, ТекДанные, "", ОбозначениеИзмененногоПоля);
		
	ИначеЕсли ИмяТЧ = "Раздел21" Или ИмяТЧ = "ТаблицаФрагментыСтроки" Тогда
		
		// Раздел 2.1 или форма разбивки строки этого раздела
		
		ИмяПоля = СтрЗаменить(ИмяЭлемента, ИмяТЧ, "");
		
		ИзмененоФактическоеНаличие = Ложь;
		ИзмененоСоответствиеАктиву = Ложь;
		
		// Фактическое наличие
		Если ИмяПоля = "НачальныйНомер" Тогда
			ИзмененоФактическоеНаличие = Истина;
			ОбозначениеИзмененногоПоля = "НомерНач";
			
		ИначеЕсли ИмяПоля = "КонечныйНомер" Тогда
			ИзмененоФактическоеНаличие = Истина;
			ОбозначениеИзмененногоПоля = "НомерКон";
			
		ИначеЕсли ИмяПоля = "Количество" Тогда
			ИзмененоФактическоеНаличие = Истина;
			ОбозначениеИзмененногоПоля = "Количество";
			
		ИначеЕсли ИмяПоля = "Сумма" Тогда
			ИзмененоФактическоеНаличие = Истина;
			ОбозначениеИзмененногоПоля = "Сумма";
			
		// Не соответствует условиям актива	
		ИначеЕсли ИмяПоля = "НачальныйНомерНеСоответствует" Тогда
			ИзмененоСоответствиеАктиву = Истина;
			ОбозначениеИзмененногоПоля = "НомерНач";
			
		ИначеЕсли ИмяПоля = "КонечныйНомерНеСоответствует" Тогда
			ИзмененоСоответствиеАктиву = Истина;
			ОбозначениеИзмененногоПоля = "НомерКон";
			
		ИначеЕсли ИмяПоля = "КоличествоНеСоответствует" Тогда
			ИзмененоСоответствиеАктиву = Истина;
			ОбозначениеИзмененногоПоля = "Количество";
			
		ИначеЕсли ИмяПоля = "СуммаНеСоответствует" Тогда
			ИзмененоСоответствиеАктиву = Истина;
			ОбозначениеИзмененногоПоля = "Сумма";
			
		// Цена
		ИначеЕсли ИмяПоля = "Цена" Тогда
			ИзмененоФактическоеНаличие = Истина;
			ОбозначениеИзмененногоПоля = "Цена";
			
		Иначе
			Возврат;
		КонецЕсли;
		
		Если ИзмененоФактическоеНаличие Тогда
			ОбновитьПоказателиВСтроке0510465(ВидДокумента, ТекДанные, "", ОбозначениеИзмененногоПоля, ПараметрыРазбивкиСтроки, РассчитыватьЦену);
			
			// Колонка Цена общая для двух наборов показателей и влияет на оба набора показателей.
			Если ОбозначениеИзмененногоПоля = "Цена" Тогда
				ОбновитьПоказателиВСтроке0510465(ВидДокумента, ТекДанные, "НеСоответствует", ОбозначениеИзмененногоПоля, ПараметрыРазбивкиСтроки);
				
			ИначеЕсли РассчитыватьЦену И ОбозначениеИзмененногоПоля = "Сумма" Тогда
				ОбновитьПоказателиВСтроке0510465(ВидДокумента, ТекДанные, "НеСоответствует", "Количество", ПараметрыРазбивкиСтроки);
			КонецЕсли;
			
		ИначеЕсли ИзмененоСоответствиеАктиву Тогда
			ОбновитьПоказателиВСтроке0510465(ВидДокумента, ТекДанные, "НеСоответствует", ОбозначениеИзмененногоПоля, ПараметрыРазбивкиСтроки);
		КонецЕсли;
		
		ОграничитьДиапазонНомеровНеСоответствующихУсловиюАктива(ВидДокумента, ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьОшибкаМножителяКоличества(ТекДанные) Экспорт
	
	Возврат (ТекДанные.МножительКоличества > 1 Или ТекДанные.МножительКоличества < 0);
	
КонецФункции

Функция ЕстьОтрицательныеЗначения(ТекДанные) Экспорт
	
	Возврат (ТекДанные.Количество < 0 Или ТекДанные.Сумма < 0);
	
КонецФункции

// 0510468

Процедура ОбновитьПоказателиВСтроке0510468(ТекДанные, ИмяИзмененногоПоля, ВалютаРУ, ПрименяемыйКурс = Неопределено, ДопустимостьСумм = Неопределено) Экспорт
	
	УказанаИностраннаяВалюта = УказанаИностраннаяВалюта(ТекДанные, ВалютаРУ);
	
	ОпределятьПрименяемыйКурсИзПоказателейСтроки = УказанаИностраннаяВалюта И ПрименяемыйКурс = Неопределено;
	
	Если ОпределятьПрименяемыйКурсИзПоказателейСтроки Тогда
		ПрименяемыйКурс = ОпределитьПрименяемыйКурсИзПоказателейСтроки(ТекДанные);
	КонецЕсли;
	
	// Новые значения полей, устанавливаемые в результате настройки
	СуммаВал							= ТекДанные.СуммаВал;
	СуммаРуб							= ТекДанные.СуммаРуб;
	СуммаПодтвержденаАктомСверкиВал		= ТекДанные.СуммаПодтвержденаАктомСверкиВал;
	СуммаПодтвержденаАктомСверкиРуб		= ТекДанные.СуммаПодтвержденаАктомСверкиРуб;
	СуммаНеПодтвержденаАктомСверкиВал	= ТекДанные.СуммаНеПодтвержденаАктомСверкиВал;
	СуммаНеПодтвержденаАктомСверкиРуб	= ТекДанные.СуммаНеПодтвержденаАктомСверкиРуб;
	
	Если ДопустимостьСумм = Неопределено Тогда
		ДопустимостьСумм = Новый Структура("Отрицательные,Положительные", Новый Структура(), Новый Структура());
		ДопустимостьСумм.Отрицательные.Вставить("Валютные",	(СуммаВал <= 0));
		ДопустимостьСумм.Отрицательные.Вставить("Рублевые",	(СуммаРуб <= 0));
		ДопустимостьСумм.Положительные.Вставить("Валютные",	(СуммаВал >= 0));
		ДопустимостьСумм.Положительные.Вставить("Рублевые",	(СуммаРуб >= 0));
	КонецЕсли;
	
	//
	// Рублевые поля
	//
	Если ИмяИзмененногоПоля = "СуммаРуб" Тогда
		
		Если УказанаИностраннаяВалюта Тогда
			// Изменен применяемый курс.
			
			// Сначала пересчитываем зависимые суммы по новому курсу.
			СуммаНеПодтвержденаАктомСверкиРуб = Окр(СуммаНеПодтвержденаАктомСверкиВал * ПрименяемыйКурс, 2);
			СуммаПодтвержденаАктомСверкиРуб = СуммаРуб - СуммаНеПодтвержденаАктомСверкиРуб;
			
			ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаВсего(СуммаВал, СуммаПодтвержденаАктомСверкиВал, СуммаНеПодтвержденаАктомСверкиВал, ДопустимостьСумм, "Валютные");
		Иначе
			ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаВсего(СуммаРуб, СуммаПодтвержденаАктомСверкиРуб, СуммаНеПодтвержденаАктомСверкиРуб, ДопустимостьСумм, "Рублевые");
		КонецЕсли;
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаПодтвержденаАктомСверкиРуб" Тогда
		
		ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаПодтвержденаАктомСверки(СуммаРуб, СуммаПодтвержденаАктомСверкиРуб, СуммаНеПодтвержденаАктомСверкиРуб, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаНеПодтвержденаАктомСверкиРуб" Тогда
		
		ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаНеПодтвержденаАктомСверки(СуммаРуб, СуммаПодтвержденаАктомСверкиРуб, СуммаНеПодтвержденаАктомСверкиРуб, ДопустимостьСумм, "Рублевые");
		
	//
	// Валютные поля
	//
	ИначеЕсли ИмяИзмененногоПоля = "СуммаВал" Тогда
		
		// Сначала пересчитываем зависимые суммы по новому курсу.
		СуммаРуб							= Окр(СуммаВал * ПрименяемыйКурс, 2);
		СуммаПодтвержденаАктомСверкиРуб		= Окр(СуммаПодтвержденаАктомСверкиВал * ПрименяемыйКурс, 2);
		СуммаНеПодтвержденаАктомСверкиРуб	= Окр(СуммаНеПодтвержденаАктомСверкиВал * ПрименяемыйКурс, 2);
		
		ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаВсего(СуммаВал, СуммаПодтвержденаАктомСверкиВал, СуммаНеПодтвержденаАктомСверкиВал, ДопустимостьСумм, "Валютные");
		
		// Повтор расчета изменения поля СуммаРуб.
		ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаВсего(СуммаРуб, СуммаПодтвержденаАктомСверкиРуб, СуммаНеПодтвержденаАктомСверкиРуб, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаПодтвержденаАктомСверкиВал" Тогда
		
		ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаПодтвержденаАктомСверки(СуммаВал, СуммаПодтвержденаАктомСверкиВал, СуммаНеПодтвержденаАктомСверкиВал, ДопустимостьСумм, "Валютные");
		
		// Расчет соответствующей рублевой суммы по курсу.
		СуммаПодтвержденаАктомСверкиРуб = Окр(СуммаПодтвержденаАктомСверкиВал * ПрименяемыйКурс, 2);
		
		// Повтор расчета изменения поля СуммаПодтвержденаАктомСверкиРуб.
		ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаПодтвержденаАктомСверки(СуммаРуб, СуммаПодтвержденаАктомСверкиРуб, СуммаНеПодтвержденаАктомСверкиРуб, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаНеПодтвержденаАктомСверкиВал" Тогда
		
		ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаНеПодтвержденаАктомСверки(СуммаВал, СуммаПодтвержденаАктомСверкиВал, СуммаНеПодтвержденаАктомСверкиВал, ДопустимостьСумм, "Валютные");
		
		// Расчет соответствующей рублевой суммы по курсу.
		СуммаНеПодтвержденаАктомСверкиРуб = Окр(СуммаНеПодтвержденаАктомСверкиВал * ПрименяемыйКурс, 2);
		
		// Повтор расчета изменения поля СуммаНеПодтвержденаАктомСверкиРуб.
		ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаНеПодтвержденаАктомСверки(СуммаРуб, СуммаПодтвержденаАктомСверкиРуб, СуммаНеПодтвержденаАктомСверкиРуб, ДопустимостьСумм, "Рублевые");
		
	КонецЕсли;
	
	ТекДанные.СуммаВал							= СуммаВал;
	ТекДанные.СуммаРуб							= СуммаРуб;
	ТекДанные.СуммаПодтвержденаАктомСверкиВал	= СуммаПодтвержденаАктомСверкиВал;
	ТекДанные.СуммаПодтвержденаАктомСверкиРуб	= СуммаПодтвержденаАктомСверкиРуб;
	ТекДанные.СуммаНеПодтвержденаАктомСверкиВал	= СуммаНеПодтвержденаАктомСверкиВал;
	ТекДанные.СуммаНеПодтвержденаАктомСверкиРуб	= СуммаНеПодтвержденаАктомСверкиРуб;
	
КонецПроцедуры

Процедура ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности(ТекДанные, ИмяИзмененногоПоля, ВалютаРУ, ПрименяемыйКурс = Неопределено, ДопустимостьСумм = Неопределено) Экспорт
	
	УказанаИностраннаяВалюта = УказанаИностраннаяВалюта(ТекДанные, ВалютаРУ);
	
	ОпределятьПрименяемыйКурсИзПоказателейСтроки = УказанаИностраннаяВалюта И ПрименяемыйКурс = Неопределено;
	
	Если ОпределятьПрименяемыйКурсИзПоказателейСтроки Тогда
		ПрименяемыйКурс = ОпределитьПрименяемыйКурсИзПоказателейСтроки(ТекДанные);
	КонецЕсли;
	
	// Новые значения полей, устанавливаемые в результате настройки
	СуммаВал	= ТекДанные.СуммаВал;
	СуммаРуб	= ТекДанные.СуммаРуб;
	
	СуммаРубТекущая					= ТекДанные.СуммаРубТекущая;
	СуммаРубПросроченная			= ТекДанные.СуммаРубПросроченная;
	СуммаРубДолгосрочная			= ТекДанные.СуммаРубДолгосрочная;
	СуммаРубСомнительная			= ТекДанные.СуммаРубСомнительная;
	СуммаРубСИстекшимСрокомДавности	= ТекДанные.СуммаРубСИстекшимСрокомДавности;
	СуммаРубБезнадежная				= ТекДанные.СуммаРубБезнадежная;
	СуммаРубИная					= ТекДанные.СуммаРубИная;
	
	СуммаВалТекущая					= ТекДанные.СуммаВалТекущая;
	СуммаВалПросроченная			= ТекДанные.СуммаВалПросроченная;
	СуммаВалДолгосрочная			= ТекДанные.СуммаВалДолгосрочная;
	СуммаВалСомнительная			= ТекДанные.СуммаВалСомнительная;
	СуммаВалСИстекшимСрокомДавности	= ТекДанные.СуммаВалСИстекшимСрокомДавности;
	СуммаВалБезнадежная				= ТекДанные.СуммаВалБезнадежная;
	СуммаВалИная					= ТекДанные.СуммаВалИная;
	
	СуммаПодтвержденаАктомСверкиВал		= ТекДанные.СуммаПодтвержденаАктомСверкиВал;
	СуммаПодтвержденаАктомСверкиРуб		= ТекДанные.СуммаПодтвержденаАктомСверкиРуб;
	СуммаНеПодтвержденаАктомСверкиВал	= ТекДанные.СуммаНеПодтвержденаАктомСверкиВал;
	СуммаНеПодтвержденаАктомСверкиРуб	= ТекДанные.СуммаНеПодтвержденаАктомСверкиРуб;
	
	Если ДопустимостьСумм = Неопределено Тогда
		ДопустимостьСумм = Новый Структура("Отрицательные,Положительные", Новый Структура(), Новый Структура());
		ДопустимостьСумм.Отрицательные.Вставить("Валютные",	(СуммаВал <= 0));
		ДопустимостьСумм.Отрицательные.Вставить("Рублевые",	(СуммаРуб <= 0));
		ДопустимостьСумм.Положительные.Вставить("Валютные",	(СуммаВал >= 0));
		ДопустимостьСумм.Положительные.Вставить("Рублевые",	(СуммаРуб >= 0));
	КонецЕсли;
	
	//
	// Рублевые поля
	//
	Если ИмяИзмененногоПоля = "СуммаРуб" Тогда
		
		Если УказанаИностраннаяВалюта Тогда
			// Изменен применяемый курс.
			
			// Сначала пересчитываем зависимые суммы по новому курсу.
			СуммаНеПодтвержденаАктомСверкиРуб	= Окр(СуммаНеПодтвержденаАктомСверкиВал * ПрименяемыйКурс, 2);
			СуммаПодтвержденаАктомСверкиРуб		= Окр(СуммаПодтвержденаАктомСверкиВал * ПрименяемыйКурс, 2);
			
			СуммаРубТекущая					= Окр(СуммаВалТекущая * ПрименяемыйКурс, 2);
			СуммаРубПросроченная			= Окр(СуммаВалПросроченная * ПрименяемыйКурс, 2);
			СуммаРубДолгосрочная			= Окр(СуммаВалДолгосрочная * ПрименяемыйКурс, 2);
			СуммаРубСомнительная			= Окр(СуммаВалСомнительная * ПрименяемыйКурс, 2);
			СуммаРубСИстекшимСрокомДавности	= Окр(СуммаВалСИстекшимСрокомДавности * ПрименяемыйКурс, 2);
			СуммаРубБезнадежная				= Окр(СуммаВалБезнадежная * ПрименяемыйКурс, 2);
			СуммаРубИная					= Окр(СуммаВалИная * ПрименяемыйКурс, 2);
			
			ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаВсего(СуммаВал, СуммаПодтвержденаАктомСверкиВал, СуммаНеПодтвержденаАктомСверкиВал,
				СуммаВалТекущая,
				СуммаВалПросроченная,
				СуммаВалДолгосрочная,
				СуммаВалСомнительная,
				СуммаВалСИстекшимСрокомДавности,
				СуммаВалБезнадежная,
				СуммаВалИная,
				ДопустимостьСумм, "Валютные");
		Иначе
			ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаВсего(СуммаРуб, СуммаПодтвержденаАктомСверкиРуб, СуммаНеПодтвержденаАктомСверкиРуб,
				СуммаРубТекущая,
				СуммаРубПросроченная,
				СуммаРубДолгосрочная,
				СуммаРубСомнительная,
				СуммаРубСИстекшимСрокомДавности,
				СуммаРубБезнадежная,
				СуммаРубИная,
				ДопустимостьСумм, "Рублевые");
		КонецЕсли;
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаПодтвержденаАктомСверкиРуб" Тогда
		
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаПодтвержденаАктомСверки(СуммаРуб, СуммаПодтвержденаАктомСверкиРуб, СуммаНеПодтвержденаАктомСверкиРуб, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаНеПодтвержденаАктомСверкиРуб" Тогда
		
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаНеПодтвержденаАктомСверки(СуммаРуб, СуммаПодтвержденаАктомСверкиРуб, СуммаНеПодтвержденаАктомСверкиРуб, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаРубТекущая" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаТекущая(СуммаРуб, СуммаРубТекущая, СуммаРубПросроченная, СуммаРубДолгосрочная, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаРубПросроченная" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаПросроченная(СуммаРуб, СуммаРубТекущая, СуммаРубПросроченная, СуммаРубДолгосрочная, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаРубДолгосрочная" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаДолгосрочная(СуммаРуб, СуммаРубТекущая, СуммаРубПросроченная, СуммаРубДолгосрочная, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаРубСомнительная" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаРуб, СуммаРубСомнительная, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаРубСИстекшимСрокомДавности" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаРуб, СуммаРубСИстекшимСрокомДавности, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаРубБезнадежная" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаРуб, СуммаРубБезнадежная, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаРубИная" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаРуб, СуммаРубИная, ДопустимостьСумм, "Рублевые");
		
		
	//
	// Валютные поля
	//
	ИначеЕсли ИмяИзмененногоПоля = "СуммаВал" Тогда
		
		// Сначала пересчитываем зависимые суммы по новому курсу.
		СуммаРуб							= Окр(СуммаВал * ПрименяемыйКурс, 2);
		СуммаПодтвержденаАктомСверкиРуб		= Окр(СуммаПодтвержденаАктомСверкиВал * ПрименяемыйКурс, 2);
		СуммаНеПодтвержденаАктомСверкиРуб	= Окр(СуммаНеПодтвержденаАктомСверкиВал * ПрименяемыйКурс, 2);
		
		СуммаРубТекущая					= Окр(СуммаВалТекущая * ПрименяемыйКурс, 2);
		СуммаРубПросроченная			= Окр(СуммаВалПросроченная * ПрименяемыйКурс, 2);
		СуммаРубДолгосрочная			= Окр(СуммаВалДолгосрочная * ПрименяемыйКурс, 2);
		СуммаРубСомнительная			= Окр(СуммаВалСомнительная * ПрименяемыйКурс, 2);
		СуммаРубСИстекшимСрокомДавности	= Окр(СуммаВалСИстекшимСрокомДавности * ПрименяемыйКурс, 2);
		СуммаРубБезнадежная				= Окр(СуммаВалБезнадежная * ПрименяемыйКурс, 2);
		СуммаРубИная					= Окр(СуммаВалИная * ПрименяемыйКурс, 2);
		
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаВсего(СуммаВал, СуммаПодтвержденаАктомСверкиВал, СуммаНеПодтвержденаАктомСверкиВал,
			СуммаВалТекущая,
			СуммаВалПросроченная,
			СуммаВалДолгосрочная,
			СуммаВалСомнительная,
			СуммаВалСИстекшимСрокомДавности,
			СуммаВалБезнадежная,
			СуммаВалИная,
			ДопустимостьСумм, "Валютные");
		
		// Повтор расчета изменения поля СуммаРуб.
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаВсего(СуммаРуб, СуммаПодтвержденаАктомСверкиРуб, СуммаНеПодтвержденаАктомСверкиРуб,
			СуммаРубТекущая,
			СуммаРубПросроченная,
			СуммаРубДолгосрочная,
			СуммаРубСомнительная,
			СуммаРубСИстекшимСрокомДавности,
			СуммаРубБезнадежная,
			СуммаРубИная,
			ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаПодтвержденаАктомСверкиВал" Тогда
		
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаПодтвержденаАктомСверки(СуммаВал, СуммаПодтвержденаАктомСверкиВал, СуммаНеПодтвержденаАктомСверкиВал, ДопустимостьСумм, "Валютные");
		
		// Расчет соответствующей рублевой суммы по курсу.
		СуммаПодтвержденаАктомСверкиРуб = Окр(СуммаПодтвержденаАктомСверкиВал * ПрименяемыйКурс, 2);
		
		// Повтор расчета изменения поля СуммаПодтвержденаАктомСверкиРуб.
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаПодтвержденаАктомСверки(СуммаРуб, СуммаПодтвержденаАктомСверкиРуб, СуммаНеПодтвержденаАктомСверкиРуб, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаНеПодтвержденаАктомСверкиВал" Тогда
		
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаНеПодтвержденаАктомСверки(СуммаВал, СуммаПодтвержденаАктомСверкиВал, СуммаНеПодтвержденаАктомСверкиВал, ДопустимостьСумм, "Валютные");
		
		// Расчет соответствующей рублевой суммы по курсу.
		СуммаНеПодтвержденаАктомСверкиРуб = Окр(СуммаНеПодтвержденаАктомСверкиВал * ПрименяемыйКурс, 2);
		
		// Повтор расчета изменения поля СуммаНеПодтвержденаАктомСверкиРуб.
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаНеПодтвержденаАктомСверки(СуммаРуб, СуммаПодтвержденаАктомСверкиРуб, СуммаНеПодтвержденаАктомСверкиРуб, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаВалТекущая" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаТекущая(СуммаВал, СуммаВалТекущая, СуммаВалПросроченная, СуммаВалДолгосрочная, ДопустимостьСумм, "Валютные");
		
		// Расчет соответствующей рублевой суммы по курсу.
		СуммаРубТекущая = Окр(СуммаВалТекущая * ПрименяемыйКурс, 2);
		
		// Повтор расчета изменения поля СуммаРубТекущая.
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаТекущая(СуммаРуб, СуммаРубТекущая, СуммаРубПросроченная, СуммаРубДолгосрочная, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаВалПросроченная" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаПросроченная(СуммаВал, СуммаВалТекущая, СуммаВалПросроченная, СуммаВалДолгосрочная, ДопустимостьСумм, "Валютные");
		
		// Расчет соответствующей рублевой суммы по курсу.
		СуммаРубПросроченная = Окр(СуммаВалПросроченная * ПрименяемыйКурс, 2);
		
		// Повтор расчета изменения поля СуммаРубПросроченная.
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаПросроченная(СуммаРуб, СуммаРубТекущая, СуммаРубПросроченная, СуммаРубДолгосрочная, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаВалДолгосрочная" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаДолгосрочная(СуммаВал, СуммаВалТекущая, СуммаВалПросроченная, СуммаВалДолгосрочная, ДопустимостьСумм, "Валютные");
		
		// Расчет соответствующей рублевой суммы по курсу.
		СуммаРубДолгосрочная = Окр(СуммаВалДолгосрочная * ПрименяемыйКурс, 2);
		
		// Повтор расчета изменения поля СуммаРубДолгосрочная.
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаДолгосрочная(СуммаРуб, СуммаРубТекущая, СуммаРубПросроченная, СуммаРубДолгосрочная, ДопустимостьСумм, "Рублевые");
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаВалСомнительная" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВал, СуммаВалСомнительная, ДопустимостьСумм, "Валютные");
		
		// Расчет соответствующей рублевой суммы по курсу.
		СуммаРубСомнительная = Окр(СуммаВалСомнительная * ПрименяемыйКурс, 2);
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаВалСИстекшимСрокомДавности" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВал, СуммаВалСИстекшимСрокомДавности, ДопустимостьСумм, "Валютные");
		
		// Расчет соответствующей рублевой суммы по курсу.
		СуммаРубСИстекшимСрокомДавности = Окр(СуммаВалСИстекшимСрокомДавности * ПрименяемыйКурс, 2);
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаВалБезнадежная" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВал, СуммаВалБезнадежная, ДопустимостьСумм, "Валютные");
		
		// Расчет соответствующей рублевой суммы по курсу.
		СуммаРубБезнадежная = Окр(СуммаВалБезнадежная * ПрименяемыйКурс, 2);
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаВалИная" Тогда
		ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВал, СуммаВалИная, ДопустимостьСумм, "Валютные");
		
		// Расчет соответствующей рублевой суммы по курсу.
		СуммаРубИная = Окр(СуммаВалИная * ПрименяемыйКурс, 2);
	КонецЕсли;
	
	ТекДанные.СуммаВал							= СуммаВал;
	ТекДанные.СуммаРуб							= СуммаРуб;
	
	ТекДанные.СуммаРубТекущая					= СуммаРубТекущая;
	ТекДанные.СуммаРубПросроченная				= СуммаРубПросроченная;
	ТекДанные.СуммаРубДолгосрочная				= СуммаРубДолгосрочная;
	ТекДанные.СуммаРубСомнительная				= СуммаРубСомнительная;
	ТекДанные.СуммаРубСИстекшимСрокомДавности	= СуммаРубСИстекшимСрокомДавности;
	ТекДанные.СуммаРубБезнадежная				= СуммаРубБезнадежная;
	ТекДанные.СуммаРубИная						= СуммаРубИная;
	
	ТекДанные.СуммаВалТекущая					= СуммаВалТекущая;
	ТекДанные.СуммаВалПросроченная				= СуммаВалПросроченная;
	ТекДанные.СуммаВалДолгосрочная				= СуммаВалДолгосрочная;
	ТекДанные.СуммаВалСомнительная				= СуммаВалСомнительная;
	ТекДанные.СуммаВалСИстекшимСрокомДавности	= СуммаВалСИстекшимСрокомДавности;
	ТекДанные.СуммаВалБезнадежная				= СуммаВалБезнадежная;
	ТекДанные.СуммаВалИная						= СуммаВалИная;
	
	ТекДанные.СуммаПодтвержденаАктомСверкиВал	= СуммаПодтвержденаАктомСверкиВал;
	ТекДанные.СуммаПодтвержденаАктомСверкиРуб	= СуммаПодтвержденаАктомСверкиРуб;
	ТекДанные.СуммаНеПодтвержденаАктомСверкиВал	= СуммаНеПодтвержденаАктомСверкиВал;
	ТекДанные.СуммаНеПодтвержденаАктомСверкиРуб	= СуммаНеПодтвержденаАктомСверкиРуб;
	
КонецПроцедуры

#Область СерииДокументов

Процедура СообщитьОСозданииСерииДокументов(КоличествоДокументовСерии, СписокПустыхРазделов) Экспорт
	
	ТекстСообщения = СтрШаблон(НСтр("ru='Обнаружен большой объем данных бух.учета.
		|Выполнена разбивка общего объема данных на несколько документов и их запись.
		|
		|Сформирована серия из %1 документов описей.
		|
		|Данный документ настроен как заголовочный документ серии и не содержит строк в разделах %2.
		|
		|Разделы документа заполнены в других документах серии, см. закладку ""Содержательные документы серии"".'"),
		КоличествоДокументовСерии,
		СписокПустыхРазделов);
	
	ПоказатьПредупреждение(, ТекстСообщения);
	
КонецПроцедуры

// Удаление без очистки
Процедура ПодтвердитьИУдалитьДокументыСерии(ФормаДокумента) Экспорт
	
	Объект = ФормаДокумента.Объект;
	
	Если Объект.СписокДокументовСерии.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Список документов пустой, отсутствуют документы для обработки'"));
		
		Возврат;
	КонецЕсли;
	
	СтатистикаПометкиУдаления = ПолучитьСтатистикуПометкиУдаления(Объект.СписокДокументовСерии);
	
	// Если выделенные документы имеют различное состояние пометки (и есть хотя бы один документ
	// с установленной пометкой), то задаем вопрос "Снять".
	Если СтатистикаПометкиУдаления.ЕстьУстановленнаяПометкаУдаления Тогда
		ЗначениеПометкиУдаления = Ложь;
		
		ТекстВопроса = НСтр("ru='Снять со всех содержательных документов пометку на удаление?'");
	Иначе
		ЗначениеПометкиУдаления = Истина;
		
		ТекстВопроса = НСтр("ru='Пометить все содержательные документы на удаление?'");
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ЗначениеПометкиУдаления", ЗначениеПометкиУдаления);
	
	Оповещение = Новый ОписаниеОповещения("ПодтвердитьИУдалитьДокументыСерииЗавершение", ФормаДокумента, ДополнительныеПараметры);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Функция ПолучитьСтатистикуПометкиУдаления(СписокДокументовСерии)

	Результат = Новый Структура();
	Результат.Вставить("ЕстьУстановленнаяПометкаУдаления",	Ложь);
	Результат.Вставить("ЕстьСброшеннаяПометкаУдаления",		Ложь);
	
	Для Каждого СтрокаТаблицы Из СписокДокументовСерии Цикл
		Если СтрокаТаблицы.ПометкаУдаления Тогда
			Результат.ЕстьУстановленнаяПометкаУдаления = Истина;
		Иначе
			Результат.ЕстьСброшеннаяПометкаУдаления = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Удаление с очисткой
Процедура ПодтвердитьОчиститьИУдалитьДокументыСерии(ФормаДокумента) Экспорт
	
	Объект = ФормаДокумента.Объект;
	
	Если Объект.СписокДокументовСерии.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Список документов пустой, отсутствуют документы для обработки'"));
		
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru='Все разделы во всех содержательных документах серии
		|будут очищены, а документы помечены на удаление.
		|
		|Внимание: очистка разделов необратима.
		|
		|Продолжить и очистить все содержательные документы?'");
	
	Оповещение = Новый ОписаниеОповещения("ПодтвердитьОчиститьИУдалитьДокументыСерииЗавершение", ФормаДокумента);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

#КонецОбласти

#Область ОтборПоПодразделению

Функция ПолучитьТекстВопросаПодтвержденияОчисткиСчетовНаФормеРешения() Экспорт
	
	МассивСтрок = Новый Массив();
	МассивСтрок.Добавить(НСтр("ru='При указании подразделения будет проверен список счетов табличной части ""Объекты инвентаризации"".
		|'"));
	МассивСтрок.Добавить(НСтр("ru='Если у счета или его субсчетов отключен учет по подразделениям, '"));
	МассивСтрок.Добавить(НСтр("ru='то такие счета будут очищены в табличной части ""Объекты инвентаризации"".
		|
		|Продолжить и очистить счета без учета по подразделениям?'"));
	
	Возврат СтрСоединить(МассивСтрок);
	
КонецФункции

Процедура ПриНажатииНаДекорациюПодразделение(ФормаДокумента) Экспорт
	
	ПоказатьПредупреждение(, ФормаДокумента.СообщениеОтбораПоПодразделению);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СписокСчетовНаФормеСпискаДокументов

// Документы описей.

Процедура ОбновитьОтборПоСчетуНаФормеСпискаДокументовОписи(ФормаСписка, ИмяПоляСчет = "СписокСчетов.Счет") Экспорт
	
	ОбновитьОтборПоСчетуНаФормеСпискаДокументов(ФормаСписка, ИмяПоляСчет);
	
КонецПроцедуры

Процедура ОтборПоСчетуФлажокПриИзмененииНаФормеСпискаДокументовОписи(ФормаСписка, ИмяПоляСчет = "СписокСчетов.Счет") Экспорт
	
	ОбновитьОтборПоСчетуНаФормеСпискаДокументовОписи(ФормаСписка, ИмяПоляСчет);
	
КонецПроцедуры

Процедура ОтборПоСчетуПриИзмененииНаФормеСпискаДокументовОписи(ФормаСписка, ИмяПоляСчет = "СписокСчетов.Счет") Экспорт
	
	Если ЗначениеЗаполнено(ФормаСписка.ОтборПоСчету) Тогда
		ФормаСписка.ОтборПоСчетуФлажок = Истина;
	КонецЕсли;
	
	ОбновитьОтборПоСчетуНаФормеСпискаДокументовОписи(ФормаСписка, ИмяПоляСчет);
	
КонецПроцедуры

// Документы Решения.

Процедура ОбновитьОтборПоСчетуНаФормеСпискаДокументовРешения(ФормаСписка) Экспорт
	
	ОбновитьОтборПоСчетуНаФормеСпискаДокументов(ФормаСписка, "Объекты.Счет");
	
КонецПроцедуры

Процедура ОтборПоСчетуФлажокПриИзмененииНаФормеСпискаДокументовРешения(ФормаСписка) Экспорт
	
	ОбновитьОтборПоСчетуНаФормеСпискаДокументовРешения(ФормаСписка);
	
КонецПроцедуры

Процедура ОтборПоСчетуПриИзмененииНаФормеСпискаДокументовРешения(ФормаСписка) Экспорт
	
	Если ЗначениеЗаполнено(ФормаСписка.ОтборПоСчету) Тогда
		ФормаСписка.ОтборПоСчетуФлажок = Истина;
	КонецЕсли;
	
	ОбновитьОтборПоСчетуНаФормеСпискаДокументовРешения(ФормаСписка);
	
КонецПроцедуры

#КонецОбласти

#Область РеестрДокументовКПроводимойИнвентаризации

Процедура ОбработкаРасшифровки_Отчет_РеестрДокументовКПроводимойИнвентаризации(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеЭлементаРасшифровки = ИнвентаризацияВызовСервера.ПолучитьОписаниеЭлементаРасшифровки(
		ФормаОтчета.ОтчетДанныеРасшифровки, Расшифровка);
	
	Если ОписаниеЭлементаРасшифровки.ИмяПоляРасшифровки = "ДокументСсылка" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЭтоРасшифровкаИтогов = (ОписаниеЭлементаРасшифровки.СписокРодительскихПолей.Количество() = 0);
	
	Если ЭтоРасшифровкаИтогов Тогда
		Возврат;
	КонецЕсли;
	
	ДокументСсылка = ОписаниеЭлементаРасшифровки.СписокРодительскихПолей.Получить("ДокументСсылка").Значение;
	
	ПоказатьЗначение(, ДокументСсылка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначенияВОдномДиапазоне(Дата1, Дата2, Диапазоны)
	
	// Анализируемый диапазон дат предварительно должен быть упорядочен по возрастанию
	
	Результат = Истина;
	
	Для Каждого НачалоДиапазона Из Диапазоны Цикл
		
		Если Дата1 < НачалоДиапазона И Дата2 < НачалоДиапазона Тогда
			Результат = Истина;
			Прервать;
			
		ИначеЕсли Дата1 >= НачалоДиапазона И Дата2 >= НачалоДиапазона Тогда
			Продолжить;
			
		Иначе
			Результат = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОрганизациюДату(Форма, Отказ)
	
	Отказ = Ложь;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ДатаИнвентаризации") Тогда
		ИмяРеквизитаДата = "ДатаИнвентаризации";
	Иначе
		ИмяРеквизитаДата = "Дата";
	КонецЕсли;
	
	Организация	= Форма.Объект.Организация;
	Дата		= Форма.Объект[ИмяРеквизитаДата];
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Для продолжения необходимо указать организацию'"),
			Форма.Объект.Ссылка,
			"Объект.Организация");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Для продолжения необходимо указать дату проведения инвентаризации'"),
			Форма.Объект.Ссылка,
			"Объект." + ИмяРеквизитаДата);
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("Организация",	Организация);
	Результат.Вставить("Дата",			Дата);
	
	Возврат Результат;
	
КонецФункции

#Область ИнвентаризационныеОписи61н

Процедура ПроверитьИСоздатьДокументРасписки(ФормаДокументаОписи, ДополнительноПроверяемыеПоляПередСозданиемРасписки)
	
	Если ФормаДокументаОписи.Объект.Ссылка.Пустая() Или ФормаДокументаОписи.Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Перед созданием расписки данные будут записаны. Продолжить?'");
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Записать и продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ФормаДокументаОписи", ФормаДокументаОписи);
		ДополнительныеПараметры.Вставить("ДополнительноПроверяемыеПоляПередСозданиемРасписки",
			ДополнительноПроверяемыеПоляПередСозданиемРасписки);
		
		Обработчик = Новый ОписаниеОповещения("ПриНажатииНадписиРаспискаВыбор", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(Обработчик, ТекстВопроса, Кнопки);
		
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеОписиПередСозданиемРасписки(ФормаДокументаОписи, ДополнительноПроверяемыеПоляПередСозданиемРасписки, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьДокументРасписки(ФормаДокументаОписи);
	
КонецПроцедуры

Процедура ПриНажатииНадписиРаспискаВыбор(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ФормаДокументаОписи = ДополнительныеПараметры.ФормаДокументаОписи;
	
	ДополнительноПроверяемыеПоляПередСозданиемРасписки = ДополнительныеПараметры.ДополнительноПроверяемыеПоляПередСозданиемРасписки;
	
	ФормаДокументаОписи.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	
	Отказ = Ложь;
	
	ПроверитьЗаполнениеОписиПередСозданиемРасписки(ФормаДокументаОписи, ДополнительноПроверяемыеПоляПередСозданиемРасписки, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьДокументРасписки(ФормаДокументаОписи);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеОписиПередСозданиемРасписки(ФормаДокументаОписи, ДополнительноПроверяемыеПоляПередСозданиемРасписки, Отказ)
	
	ОбъектОписи = ФормаДокументаОписи.Объект;
	
	СтрокаТаблицыНастроек = ФормаДокументаОписи.ДанныеПанелиРасписки.СтрокаТаблицыНастроек;
	
	ОписаниеОписи = ФормаДокументаОписи.ДанныеПанелиРасписки.ОписаниеОписиИзТаблицыНастроекЗаполненияОписейПоРешению;
	
	Если Не ЗначениеЗаполнено(ОбъектОписи.Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", , НСтр("ru='Организация'")),
			ОбъектОписи.Ссылка, "Организация", "Объект", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбъектОписи[СтрокаТаблицыНастроек.ИмяРеквизитаСотрудникДляРасписки]) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", , СтрокаТаблицыНастроек.СинонимРеквизитаСотрудникДляРасписки),
			ОбъектОписи.Ссылка, СтрокаТаблицыНастроек.ИмяРеквизитаСотрудникДляРасписки, "Объект", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбъектОписи.РешениеОПроведенииИнвентаризации) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", , НСтр("ru='Решение о проведении инвентаризации'")),
			ОбъектОписи.Ссылка, "РешениеОПроведенииИнвентаризации", "Объект", Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектОписи.РешениеОПроведенииИнвентаризации) Тогда
		Если Не ЗначениеЗаполнено(ОбъектОписи.ДатаНачала) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", , НСтр("ru='Дата начала инвентаризации'")),
				ОбъектОписи.Ссылка, "ДатаНачала", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОбъектОписи.ДатаОкончания) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", , НСтр("ru='Дата окончания инвентаризации'")),
				ОбъектОписи.Ссылка, "ДатаОкончания", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОбъектОписи.ДатаИнвентаризации) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", , НСтр("ru='Дата инвентаризации'")),
				ОбъектОписи.Ссылка, "ДатаИнвентаризации", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОбъектОписи.Комиссия) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", , НСтр("ru='Комиссия'")),
				ОбъектОписи.Ссылка, "Комиссия", "Объект", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОбъектОписи.ОтветственныйИсполнитель) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", , НСтр("ru='Ответственный исполнитель инв. комиссии'")),
				ОбъектОписи.Ссылка, "ОтветственныйИсполнитель", "Объект", Отказ);
		КонецЕсли;
		
		Если ОписаниеОписи.ОписаниеРеквизитаСчет.РасположенВШапке Тогда
			ИмяПоля = ОписаниеОписи.ОписаниеРеквизитаСчет.ИмяПоля;
			
			Если Не ЗначениеЗаполнено(ОбъектОписи[ИмяПоля]) Тогда
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаДокументаОписи.Элементы, "ПредставлениеСчета") Тогда
					Поле = "ПредставлениеСчета";
					ПутьКДанным = "";
				Иначе
					Поле = ИмяПоля;
					ПутьКДанным = "Объект";
				КонецЕсли;
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле",, НСтр("ru='Счет'")),
					ОбъектОписи.Ссылка, Поле, ПутьКДанным, Отказ);
			КонецЕсли;
			
		ИначеЕсли ОписаниеОписи.ОписаниеРеквизитаСчет.РасположенВТабличнойЧасти Тогда
			ИмяТабличнойЧасти = ОписаниеОписи.ОписаниеРеквизитаСчет.ИмяТабличнойЧасти;
			
			Если ОбъектОписи[ИмяТабличнойЧасти].Количество() = 0 Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					НСтр("ru='Не заполнен список счетов инвентаризации'"),
					ОбъектОписи.Ссылка, ИмяТабличнойЧасти, "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ОписаниеОписи.ОписаниеРеквизитаМестоИнвентаризации.РасположенВШапке Тогда
			ИмяПоля = ОписаниеОписи.ОписаниеРеквизитаМестоИнвентаризации.ИмяПоля;
			
			Если Не ЗначениеЗаполнено(ОбъектОписи[ИмяПоля]) Тогда
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаДокументаОписи.Элементы, "ПредставлениеМестаПроведения") Тогда
					Поле = "ПредставлениеМестаПроведения";
					ПутьКДанным = "";
				Иначе
					Поле = ИмяПоля;
					ПутьКДанным = "Объект";
				КонецЕсли;
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле",, НСтр("ru='Место проведения инвентаризации'")),
					ОбъектОписи.Ссылка, Поле, ПутьКДанным, Отказ);
			КонецЕсли;
			
		ИначеЕсли ОписаниеОписи.ОписаниеРеквизитаМестоИнвентаризации.РасположенВТабличнойЧасти Тогда
			ИмяТабличнойЧасти = ОписаниеОписи.ОписаниеРеквизитаМестоИнвентаризации.ИмяТабличнойЧасти;
			
			Если ОбъектОписи[ИмяТабличнойЧасти].Количество() = 0 Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					НСтр("ru='Не заполнен список мест проведения инвентаризации'"),
					ОбъектОписи.Ссылка, ИмяТабличнойЧасти, "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительноПроверяемыеПоляПередСозданиемРасписки) = Тип("Структура") Тогда
		Для Каждого Элемент Из ДополнительноПроверяемыеПоляПередСозданиемРасписки Цикл
			ИмяПоля = Элемент.Ключ;
			СинонимПоля = Элемент.Значение;
			
			Если Не ЗначениеЗаполнено(ОбъектОписи[ИмяПоля]) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле",, СинонимПоля),
					ОбъектОписи.Ссылка, ИмяПоля, "Объект", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// 0510465

Процедура ОбновитьПоказателиВСтроке0510465(ВидДокумента, ТекДанные, ПостфиксИмени, ОбозначениеИзмененногоПоля, ПараметрыРазбивкиСтроки = Неопределено, РассчитыватьЦену = Ложь)
	
	ЭтоРазбивкаСтроки = (ПараметрыРазбивкиСтроки <> Неопределено);
	
	ЭтоБСО				= (ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументовСтрогойОтчетности.БСО"));
	ЭтоДенежныйДокумент	= (ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументовСтрогойОтчетности.ДенежныеДокументы"));
	
	ИмяПоляНомерНачальный	= "НачальныйНомер" + ПостфиксИмени;
	ИмяПоляНомерКонечный	= "КонечныйНомер" + ПостфиксИмени;
	ИмяПоляЦена				= "Цена";
	ИмяПоляКоличество		= "Количество" + ПостфиксИмени;
	ИмяПоляСумма			= "Сумма" + ПостфиксИмени;
	
	// Значения полей текущей строки до начала настройки
	НомерНач	= ТекДанные[ИмяПоляНомерНачальный];
	НомерКон	= ТекДанные[ИмяПоляНомерКонечный];
	Цена		= ТекДанные[ИмяПоляЦена];
	Количество	= ТекДанные[ИмяПоляКоличество];
	Сумма		= ТекДанные[ИмяПоляСумма];
	
	РассчитатьСумму = (ОбозначениеИзмененногоПоля <> "Сумма");
	РассчитатьЦену = РассчитыватьЦену И (ОбозначениеИзмененногоПоля = "Сумма") И ПостфиксИмени = "";
	
	// При разбивке строки ограничиваем вводимые значения.
	Если ЭтоРазбивкаСтроки Тогда
		Если ОбозначениеИзмененногоПоля = "Количество" Тогда
			РазбиваемоеЗначение = ПараметрыРазбивкиСтроки.Количество;
			
			Если Количество > РазбиваемоеЗначение Тогда
				Количество = РазбиваемоеЗначение;
			КонецЕсли;
			
		ИначеЕсли ОбозначениеИзмененногоПоля = "Сумма" Тогда
			РазбиваемоеЗначение = ПараметрыРазбивкиСтроки.Сумма;
			
			Если Сумма > РазбиваемоеЗначение Тогда
				Сумма = РазбиваемоеЗначение;
			КонецЕсли;
			
		ИначеЕсли ОбозначениеИзмененногоПоля = "НомерНач" Тогда
			МинимальныйНомерБСО		= ПараметрыРазбивкиСтроки.МинимальныйНомерБСО;
			МаксимальныйНомерБСО	= ПараметрыРазбивкиСтроки.МаксимальныйНомерБСО;
			
			Если ЗначениеЗаполнено(НомерНач) И НомерНач < МинимальныйНомерБСО	Тогда
				НомерНач = МинимальныйНомерБСО;
			ИначеЕсли ЗначениеЗаполнено(НомерНач) И НомерНач > МаксимальныйНомерБСО Тогда
				НомерНач = МаксимальныйНомерБСО;
			КонецЕсли;
			
		ИначеЕсли ОбозначениеИзмененногоПоля = "НомерКон" Тогда
			МинимальныйНомерБСО		= ПараметрыРазбивкиСтроки.МинимальныйНомерБСО;
			МаксимальныйНомерБСО	= ПараметрыРазбивкиСтроки.МаксимальныйНомерБСО;
			
			Если ЗначениеЗаполнено(НомерКон) И НомерКон < МинимальныйНомерБСО	Тогда
				НомерКон = МинимальныйНомерБСО;
			ИначеЕсли ЗначениеЗаполнено(НомерКон) И НомерКон > МаксимальныйНомерБСО Тогда
				НомерКон = МаксимальныйНомерБСО;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Новые значения полей, устанавливаемые в результате настройки
	НовНомерНач		= НомерНач;
	НовНомерКон		= НомерКон;
	НовКоличество	= Количество;
	НовСумма		= Сумма;
	
	Если ЭтоБСО Тогда
		Если ОбозначениеИзмененногоПоля = "Количество" Тогда
			Если Количество = 0 Тогда
				// Очищаем весь диапазон номеров.
				НовНомерНач = 0;
				НовНомерКон = 0;
			Иначе
				// Количество указано
				Если НомерНач > 0 Тогда
					НовНомерКон = НомерНач + Количество - 1;
					
				ИначеЕсли НомерКон > 0 И НомерНач = 0 Тогда
					НовНомерНач = НомерКон - Количество + 1;
					Если НовНомерНач < 0 Тогда
						НовНомерНач = 0;
					КонецЕсли;
					
					НовКоличество = НовНомерКон - НовНомерНач + 1;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ОбозначениеИзмененногоПоля = "НомерНач" Тогда
			Если НовНомерНач = 0 Тогда
				// Очищаем весь диапазон номеров.
				НовНомерКон = 0;
				НовКоличество = 0;
				
			Иначе
				Если НовНомерКон = 0 Тогда
					// Создаем новый диапазон номеров.
					НовНомерКон = ?(НовКоличество = 0, НовНомерНач, НовНомерНач + НовКоличество - 1);
					
				ИначеЕсли НовНомерНач > НовНомерКон И ЗначениеЗаполнено(НовНомерКон) Тогда
					НовНомерНач = НовНомерКон;
				КонецЕсли;
				
				НовКоличество = НовНомерКон - НовНомерНач + 1;
			КонецЕсли;
			
		ИначеЕсли ОбозначениеИзмененногоПоля = "НомерКон" Тогда
			Если НовНомерКон = 0 Тогда
				// Очищаем весь диапазон номеров.
				НовНомерНач = 0;
				НовКоличество = 0;
				
			Иначе
				Если НовНомерНач = 0 Тогда
					// Создаем новый диапазон номеров.
					НовНомерНач = ?(НовКоличество = 0, НовНомерКон, НовНомерКон - НовКоличество + 1);
					
				ИначеЕсли НовНомерКон < НовНомерНач Тогда
					НовНомерКон = НовНомерНач;
				КонецЕсли;
				
				НовКоличество = НовНомерКон - НовНомерНач + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоРазбивкаСтроки Тогда
		РазбиваемоеКоличество	= ПараметрыРазбивкиСтроки.Количество;
		РазбиваемаяСумма		= ПараметрыРазбивкиСтроки.Сумма;
		
		Если ПараметрыРазбивкиСтроки.РедактируетсяКоличество И НовКоличество = РазбиваемоеКоличество Тогда
			// Повторяем сумму из исходной строки.
			// Рассчитывать сумму по цене и количеству не нужно,
			// т.к. возможно получение значения, отличного от суммы в исходной строке.
			НовСумма = РазбиваемаяСумма;
			
			РассчитатьСумму = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если РассчитатьСумму Тогда
		НовСумма = НовКоличество * Цена;
	КонецЕсли;
	
	Если РассчитатьЦену И НовКоличество <> 0 Тогда
		НовЦена = НовСумма / НовКоличество;
		
		ТекДанные[ИмяПоляЦена] = НовЦена;
	КонецЕсли;
	
	ТекДанные[ИмяПоляНомерНачальный]	= НовНомерНач;
	ТекДанные[ИмяПоляНомерКонечный]		= НовНомерКон;
	ТекДанные[ИмяПоляКоличество]		= НовКоличество;
	ТекДанные[ИмяПоляСумма]				= НовСумма;
	
	Если ЭтоБСО И ИнвентаризацияКлиентСервер.ИспользоватьПредставленияНомеровБСО() Тогда
		ИнвентаризацияКлиентСервер.ОбновитьПредставленияНомеровБСО(ТекДанные, ИмяПоляНомерНачальный, ИмяПоляНомерКонечный);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекДанные, "ОшибкаУчета") Тогда
		ОбновитьПризнакОшибкиУчета(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОграничитьДиапазонНомеровНеСоответствующихУсловиюАктива(ВидДокумента, ТекДанные)
	
	// Диапазон номеров, не соответствующих условию актива, должен принадлежать диапазону фактического наличия.
	// При очистке фактического наличия принудительно очищается не актив.
	
	ЭтоБСО				= (ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументовСтрогойОтчетности.БСО"));
	ЭтоДенежныйДокумент	= (ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументовСтрогойОтчетности.ДенежныеДокументы"));
	
	Если ТекДанные.Сумма = 0 Тогда
		ОчищающаяСтруктура = Новый Структура("
			|КоличествоНеСоответствует,
			|СуммаНеСоответствует,
			|Статус");
		
		Если ЭтоБСО Тогда
			ОчищающаяСтруктура.Вставить("НачальныйНомерНеСоответствует");
			ОчищающаяСтруктура.Вставить("КонечныйНомерНеСоответствует");
			ОчищающаяСтруктура.Вставить("НачальныйНомерНеСоответствуетПредставление");
			ОчищающаяСтруктура.Вставить("КонечныйНомерНеСоответствуетПредставление");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТекДанные, ОчищающаяСтруктура);
		
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.СуммаНеСоответствует = 0 Тогда
		ОчищающаяСтруктура = Новый Структура("Статус");
		
		ЗаполнитьЗначенияСвойств(ТекДанные, ОчищающаяСтруктура);
	КонецЕсли;
	
	Если ЭтоБСО Тогда
		ЛеваяГраница = Макс(ТекДанные.НачальныйНомер, ТекДанные.НачальныйНомерНеСоответствует);
		ПраваяГраница = Мин(ТекДанные.КонечныйНомер, ТекДанные.КонечныйНомерНеСоответствует);
		
		ЕстьПересечениеДиапазонов = (ЛеваяГраница <= ПраваяГраница);
		
		ОбновитьПоказатели = Ложь;
		
		Если ЕстьПересечениеДиапазонов Тогда
			СкорректироватьЛевуюГраницу = (ТекДанные.НачальныйНомерНеСоответствует < ЛеваяГраница);
			СкорректироватьПравуюГраницу = (ТекДанные.КонечныйНомерНеСоответствует > ПраваяГраница);
			
			Если СкорректироватьЛевуюГраницу Тогда
				ТекДанные.НачальныйНомерНеСоответствует = ЛеваяГраница;
				ТекДанные.КоличествоНеСоответствует = ТекДанные.КонечныйНомерНеСоответствует - ТекДанные.НачальныйНомерНеСоответствует + 1;
				
				ОбновитьПоказатели = Истина;
			КонецЕсли;
			
			Если СкорректироватьПравуюГраницу Тогда
				ТекДанные.КонечныйНомерНеСоответствует = ПраваяГраница;
				ТекДанные.КоличествоНеСоответствует = ТекДанные.КонечныйНомерНеСоответствует - ТекДанные.НачальныйНомерНеСоответствует + 1;
				
				ОбновитьПоказатели = Истина;
			КонецЕсли;
		Иначе
			ТекДанные.НачальныйНомерНеСоответствует = 0;
			ТекДанные.КонечныйНомерНеСоответствует = 0;
			ТекДанные.КоличествоНеСоответствует = 0;
			
			ОбновитьПоказатели = Истина;
		КонецЕсли;
		
		Если ТекДанные.Количество > 0 И ТекДанные.КоличествоНеСоответствует = ТекДанные.Количество Тогда
			// При совпадении количества гарантируем совпадение суммы.
			ТекДанные.СуммаНеСоответствует = ТекДанные.Сумма;
			
		ИначеЕсли ОбновитьПоказатели Тогда
			ОбновитьПоказателиВСтроке0510465(ВидДокумента, ТекДанные, "НеСоответствует", "Количество");
			
		ИначеЕсли ТекДанные.СуммаНеСоответствует > ТекДанные.Сумма Тогда
			ТекДанные.СуммаНеСоответствует = ТекДанные.Сумма;
		КонецЕсли;
		
	ИначеЕсли ЭтоДенежныйДокумент Тогда
		Если ТекДанные.Количество > 0 И ТекДанные.КоличествоНеСоответствует = ТекДанные.Количество Тогда
			// При совпадении количества гарантируем совпадение суммы.
			ТекДанные.СуммаНеСоответствует = ТекДанные.Сумма;
			
		ИначеЕсли ТекДанные.КоличествоНеСоответствует > ТекДанные.Количество Тогда
			ТекДанные.КоличествоНеСоответствует = ТекДанные.Количество;
			ТекДанные.СуммаНеСоответствует = ТекДанные.Сумма;
		КонецЕсли;
		
		Если ТекДанные.СуммаНеСоответствует > ТекДанные.Сумма Тогда
			ТекДанные.СуммаНеСоответствует = ТекДанные.Сумма;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПризнакОшибкиУчета(ТекДанные)
	
	ТекДанные.ОшибкаУчета = ЕстьОшибкаМножителяКоличества(ТекДанные) Или ЕстьОтрицательныеЗначения(ТекДанные);
	
КонецПроцедуры

// 0510468

Процедура ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаВсего(СуммаВсего, СуммаПодтверждена, СуммаНеПодтверждена, ДопустимостьСумм, ОбозначениеСумм)
	
	Если СуммаПодтверждена < 0 И Не ДопустимостьСумм.Отрицательные[ОбозначениеСумм]
		Или СуммаПодтверждена > 0 И Не ДопустимостьСумм.Положительные[ОбозначениеСумм] Тогда
		СуммаПодтверждена = 0;
	КонецЕсли;
	
	СуммаНеПодтверждена = СуммаВсего - СуммаПодтверждена;
	
	Если СуммаНеПодтверждена < 0 И Не ДопустимостьСумм.Отрицательные[ОбозначениеСумм]
		Или СуммаНеПодтверждена > 0 И Не ДопустимостьСумм.Положительные[ОбозначениеСумм] Тогда
		СуммаНеПодтверждена = 0;
		
		СуммаПодтверждена = СуммаВсего - СуммаНеПодтверждена;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаПодтвержденаАктомСверки(СуммаВсего, СуммаПодтверждена, СуммаНеПодтверждена, ДопустимостьСумм, ОбозначениеСумм)
	
	Если СуммаПодтверждена < 0 И Не ДопустимостьСумм.Отрицательные[ОбозначениеСумм]
		Или СуммаПодтверждена > 0 И Не ДопустимостьСумм.Положительные[ОбозначениеСумм] Тогда
		СуммаПодтверждена = 0;
	КонецЕсли;
	
	СуммаНеПодтверждена = СуммаВсего - СуммаПодтверждена;
	
	Если СуммаНеПодтверждена < 0 И Не ДопустимостьСумм.Отрицательные[ОбозначениеСумм]
		Или СуммаНеПодтверждена > 0 И Не ДопустимостьСумм.Положительные[ОбозначениеСумм] Тогда
		СуммаНеПодтверждена = 0;
		
		СуммаПодтверждена = СуммаВсего - СуммаНеПодтверждена;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПоказателиВСтроке0510468_ИзмененоПоле_СуммаНеПодтвержденаАктомСверки(СуммаВсего, СуммаПодтверждена, СуммаНеПодтверждена, ДопустимостьСумм, ОбозначениеСумм)
	
	Если СуммаНеПодтверждена < 0 И Не ДопустимостьСумм.Отрицательные[ОбозначениеСумм]
		Или СуммаНеПодтверждена > 0 И Не ДопустимостьСумм.Положительные[ОбозначениеСумм] Тогда
		СуммаНеПодтверждена = 0;
	КонецЕсли;
	
	СуммаПодтверждена = СуммаВсего - СуммаНеПодтверждена;
	
	Если СуммаПодтверждена < 0 И Не ДопустимостьСумм.Отрицательные[ОбозначениеСумм]
		Или СуммаПодтверждена > 0 И Не ДопустимостьСумм.Положительные[ОбозначениеСумм] Тогда
		СуммаПодтверждена = 0;
		
		СуммаНеПодтверждена = СуммаВсего - СуммаПодтверждена;
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьПрименяемыйКурсИзПоказателейСтроки(ТекДанные)
	
	Возврат ?(ЗначениеЗаполнено(ТекДанные.СуммаВал), ТекДанные.СуммаРуб / ТекДанные.СуммаВал, 0);
	
КонецФункции

Функция УказанаИностраннаяВалюта(ТекДанные, ВалютаРУ)
	
	Возврат ЗначениеЗаполнено(ТекДанные.Валюта) И ТекДанные.Валюта <> ВалютаРУ;
	
КонецФункции

Процедура ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаВсего(СуммаВсего, СуммаПодтверждена, СуммаНеПодтверждена,
	СуммаТекущая,
	СуммаПросроченная,
	СуммаДолгосрочная,
	СуммаСомнительная,
	СуммаСИстекшимСрокомДавности,
	СуммаБезнадежная,
	СуммаИная,
	ДопустимостьСумм, ОбозначениеСумм)
	
	// Всего = Подтверждено + НеПодтверждено
	ОчиститьСуммыНеподходящегоЗнака(СуммаВсего, СуммаНеПодтверждена, СуммаПодтверждена);
	РассчитатьЗависимыеКомпонентыОбщейСуммы(СуммаВсего,, СуммаНеПодтверждена, СуммаПодтверждена);
	
	// Всего = Текущая + Просроченная + Долгосрочная
	ОчиститьСуммыНеподходящегоЗнака(СуммаВсего, СуммаДолгосрочная, СуммаПросроченная, СуммаТекущая);
	РассчитатьЗависимыеКомпонентыОбщейСуммы(СуммаВсего,, СуммаТекущая, СуммаПросроченная, СуммаДолгосрочная);
	
	ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВсего, СуммаСомнительная,				ДопустимостьСумм, ОбозначениеСумм);
	ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВсего, СуммаСИстекшимСрокомДавности,	ДопустимостьСумм, ОбозначениеСумм);
	ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВсего, СуммаБезнадежная,				ДопустимостьСумм, ОбозначениеСумм);
	ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВсего, СуммаИная,						ДопустимостьСумм, ОбозначениеСумм);
	
КонецПроцедуры

Процедура ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаПодтвержденаАктомСверки(СуммаВсего, СуммаПодтверждена, СуммаНеПодтверждена, ДопустимостьСумм, ОбозначениеСумм)
	
	// Ограничиваем значение по модулю.
	ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВсего, СуммаПодтверждена, ДопустимостьСумм, ОбозначениеСумм);
	
	// Всего = Подтверждено + НеПодтверждено
	РассчитатьЗависимыеКомпонентыОбщейСуммы(СуммаВсего, СуммаПодтверждена, СуммаНеПодтверждена);
	
КонецПроцедуры

Процедура ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаНеПодтвержденаАктомСверки(СуммаВсего, СуммаПодтверждена, СуммаНеПодтверждена, ДопустимостьСумм, ОбозначениеСумм)
	
	// Ограничиваем значение по модулю.
	ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВсего, СуммаНеПодтверждена, ДопустимостьСумм, ОбозначениеСумм);
	
	// Всего = Подтверждено + НеПодтверждено
	РассчитатьЗависимыеКомпонентыОбщейСуммы(СуммаВсего, СуммаНеПодтверждена, СуммаПодтверждена);
	
КонецПроцедуры

Процедура ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВсего, Сумма, ДопустимостьСумм, ОбозначениеСумм)
	
	Если Сумма < 0 И Не ДопустимостьСумм.Отрицательные[ОбозначениеСумм]
		Или Сумма > 0 И Не ДопустимостьСумм.Положительные[ОбозначениеСумм] Тогда
		Сумма = 0;
	КонецЕсли;
	
	Если Сумма < 0 И ДопустимостьСумм.Отрицательные[ОбозначениеСумм] И Сумма < СуммаВсего
		Или Сумма > 0 И ДопустимостьСумм.Положительные[ОбозначениеСумм] И Сумма > СуммаВсего Тогда
		Сумма = СуммаВсего;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаТекущая(СуммаВсего, СуммаТекущая, СуммаПросроченная, СуммаДолгосрочная, ДопустимостьСумм, ОбозначениеСумм)
	
	// Ограничиваем значение по модулю.
	ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВсего, СуммаТекущая, ДопустимостьСумм, ОбозначениеСумм);
	
	// Всего = Текущая + Просроченная + Долгосрочная
	РассчитатьЗависимыеКомпонентыОбщейСуммы(СуммаВсего, СуммаТекущая, СуммаПросроченная, СуммаДолгосрочная);
	
КонецПроцедуры

Процедура ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаПросроченная(СуммаВсего, СуммаТекущая, СуммаПросроченная, СуммаДолгосрочная, ДопустимостьСумм, ОбозначениеСумм)
	
	// Ограничиваем значение по модулю.
	ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВсего, СуммаПросроченная, ДопустимостьСумм, ОбозначениеСумм);
	
	// Всего = Текущая + Просроченная + Долгосрочная
	РассчитатьЗависимыеКомпонентыОбщейСуммы(СуммаВсего, СуммаПросроченная, СуммаТекущая, СуммаДолгосрочная);
	
КонецПроцедуры

Процедура ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_СуммаДолгосрочная(СуммаВсего, СуммаТекущая, СуммаПросроченная, СуммаДолгосрочная, ДопустимостьСумм, ОбозначениеСумм)
	
	// Ограничиваем значение по модулю.
	ОбновитьПоказателиВСтроке0510468СоСтатусамиЗадолженности_ИзмененоПоле_ОграничитьРазмерСуммы(СуммаВсего, СуммаДолгосрочная, ДопустимостьСумм, ОбозначениеСумм);
	
	// Всего = Текущая + Просроченная + Долгосрочная
	РассчитатьЗависимыеКомпонентыОбщейСуммы(СуммаВсего, СуммаДолгосрочная, СуммаТекущая, СуммаПросроченная);
	
КонецПроцедуры

Процедура РассчитатьЗависимыеКомпонентыОбщейСуммы(Знач СуммаВсего, Знач ИзмененнаяСумма, СуммаПриоритетИзменения1, СуммаПриоритетИзменения2 = Неопределено, СуммаПриоритетИзменения3 = Неопределено)
	
	ОжидаютсяПоложительныеЗначения = (СуммаВсего >= 0);
	
	Если ИзмененнаяСумма = Неопределено Тогда
		ИзмененнаяСумма = 0;
	КонецЕсли;
	
	МассивСумм = Новый Массив();
	МассивСумм.Добавить(СуммаПриоритетИзменения1);
	Если СуммаПриоритетИзменения2 <> Неопределено Тогда
		МассивСумм.Добавить(СуммаПриоритетИзменения2);
	КонецЕсли;
	Если СуммаПриоритетИзменения3 <> Неопределено Тогда
		МассивСумм.Добавить(СуммаПриоритетИзменения3);
	КонецЕсли;
	
	Для Индекс = 0 По МассивСумм.ВГраница() Цикл
		ИтогПоМассиву = 0;
		
		Для Каждого Сумма Из МассивСумм Цикл
			ИтогПоМассиву = ИтогПоМассиву + Сумма;
		КонецЦикла;
		
		Дельта = СуммаВсего - (ИзмененнаяСумма + ИтогПоМассиву);
		
		Если Дельта = 0 Тогда
			СуммаПриоритетИзменения1 = МассивСумм[0];
			Если СуммаПриоритетИзменения2 <> Неопределено Тогда
				СуммаПриоритетИзменения2 = МассивСумм[1];
			КонецЕсли;
			Если СуммаПриоритетИзменения3 <> Неопределено Тогда
				СуммаПриоритетИзменения3 = МассивСумм[2];
			КонецЕсли;
			
			Возврат;
		КонецЕсли;
		
		Сумма = МассивСумм[Индекс];
		
		Сумма = Сумма + Дельта;
		
		Если ОжидаютсяПоложительныеЗначения И Сумма < 0 Или Не ОжидаютсяПоложительныеЗначения И Сумма > 0 Тогда
			Сумма = 0;
		КонецЕсли;
		
		Если ОжидаютсяПоложительныеЗначения И Сумма > СуммаВсего Или Не ОжидаютсяПоложительныеЗначения И Сумма < СуммаВсего Тогда
			Сумма = СуммаВсего;
		КонецЕсли;
		
		МассивСумм[Индекс] = Сумма;
	КонецЦикла;
	
	СуммаПриоритетИзменения1 = МассивСумм[0];
	Если СуммаПриоритетИзменения2 <> Неопределено Тогда
		СуммаПриоритетИзменения2 = МассивСумм[1];
	КонецЕсли;
	Если СуммаПриоритетИзменения3 <> Неопределено Тогда
		СуммаПриоритетИзменения3 = МассивСумм[2];
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьСуммыНеподходящегоЗнака(Знач СуммаВсего, Сумма1, Сумма2, Сумма3 = Неопределено)
	
	ОжидаютсяПоложительныеЗначения = (СуммаВсего >= 0);
	
	Если ОжидаютсяПоложительныеЗначения И Сумма1 < 0 Или Не ОжидаютсяПоложительныеЗначения И Сумма1 > 0 Тогда
		Сумма1 = 0;
	КонецЕсли;
	
	Если ОжидаютсяПоложительныеЗначения И Сумма2 < 0 Или Не ОжидаютсяПоложительныеЗначения И Сумма2 > 0 Тогда
		Сумма2 = 0;
	КонецЕсли;
	
	Если Сумма3 <> Неопределено И (ОжидаютсяПоложительныеЗначения И Сумма3 < 0 Или Не ОжидаютсяПоложительныеЗначения И Сумма3 > 0) Тогда
		Сумма3 = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СписокСчетовНаФормеСпискаДокументов

Процедура ОбновитьОтборПоСчетуНаФормеСпискаДокументов(ФормаСписка, ИмяПоляСчет)
	
	ЗначениеФлажка = ФормаСписка.ОтборПоСчетуФлажок;
	ЗначениеСчета = ФормаСписка.ОтборПоСчету;
	
	ДинамическийСписок = ФормаСписка.Список;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(ДинамическийСписок, ИмяПоляСчет);
	
	ИспользованиеОтбора = ЗначениеФлажка;
	РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	
	ЗначениеВидСравнения = ?(ЗначениеЗаполнено(ЗначениеСчета),
		ВидСравненияКомпоновкиДанных.ВИерархии,
		ВидСравненияКомпоновкиДанных.Равно);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ДинамическийСписок, ИмяПоляСчет, ЗначениеСчета, ЗначениеВидСравнения,,
		ИспользованиеОтбора, РежимОтображения, "ОтборПоСчету");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
