&НаКлиенте
Перем ТекстЗаголовкаСообщений;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(Элементы, Объект, "ФормаЗаполнить"
																			+",РеализацияРеализация");

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ,
													 СтандартнаяОбработка, 
													 Элементы.БухгалтерскаяОперация, 
													 Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части

	//---
	// Аналог установки свойства ТолькоПросмотр, но с возможностью открытия значения
	//---
	ТолькоПросмотр_ПоДаннымУчета_ИнициализацияСервер();
	
	УчетНДС.НастроитьТаблицу_ОформитьСтрокиЗаписьДопЛиста(Объект, ЭтаФорма, "Реализация");
	УчетНДС.НастроитьТаблицу_ОформитьСтрокиЗаписьДопЛиста(Объект, ЭтаФорма, "Реализация0");
	УчетНДС.НастроитьТаблицу_ОформитьСтрокиЗаписьДопЛиста(Объект, ЭтаФорма, "АвансыВыданные");
	УчетНДС.НастроитьТаблицу_ОформитьСтрокиЗаписьДопЛиста(Объект, ЭтаФорма, "АвансыВыданныеПредъявленныеКомиссионером");
	
	ЗаполнитьСписокКодовВидовОпераций(ЭтаФорма);
	
	ЗаполнитьСпискиВыбораСтавокНДС();
	
	УстановитьУсловноеОформление();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ТекстЗаголовкаСообщений = НСтр("ru='Формирование записей книги продаж'");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма,
												   ТекущийОбъект, 
												   Элементы.БухгалтерскаяОперация, 
												   Элементы.ДополнительныеТабличныеЧасти);
    // Конец Типовые операции и дополнительные табличные части
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части

	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗаполнитьСписокКодовВидовОпераций(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Реализация

&НаКлиенте
Процедура РеализацияСчетФактураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Реализация.ТекущиеДанные;
	Сведения = КонтрагентСчетФактуры(ТекущиеДанные.СчетФактура);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные,Сведения);
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСумма18ПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСумма18ВалютнаяПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСтавкаНДС18ПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСуммаНДС18ПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСуммаНДС18ВалютнаяПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСумма10ПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСумма10ВалютнаяПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСтавкаНДС10ПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСуммаНДС10ПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСуммаНДС10ВалютнаяПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСумма0ПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСумма0ВалютнаяПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСуммаБНПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры
&НаКлиенте
Процедура РеализацияСуммаБНВалютнаяПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСтавкаНДС7ПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("Реализация", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСумма7ПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("Реализация", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСумма7ВалютнаяПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("Реализация", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСуммаНДС7ПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("Реализация", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСуммаНДС7ВалютнаяПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("Реализация", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСтавкаНДС5ПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("Реализация", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСумма5ПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("Реализация", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСумма5ВалютнаяПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("Реализация", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСуммаНДС5ПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("Реализация", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСуммаНДС5ВалютнаяПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("Реализация", Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура РеализацияСумма22ПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСумма22ВалютнаяПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСтавкаНДС22ПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСуммаНДС22ПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РеализацияСуммаНДС22ВалютнаяПриИзменении(Элемент)
	РассчитатьСуммыВСтроке("Реализация", Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Реализация0

&НаКлиенте
Процедура Реализация0СчетФактураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Реализация0.ТекущиеДанные;
	Сведения = КонтрагентСчетФактуры(ТекущиеДанные.СчетФактура);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные,Сведения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_АвансыВыданные

&НаКлиенте
Процедура АвансыВыданныеСчетФактураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.АвансыВыданные.ТекущиеДанные;
	Сведения = КонтрагентСчетФактуры(ТекущиеДанные.СчетФактура);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные,Сведения);
КонецПроцедуры

&НаКлиенте
Процедура АвансыВыданныеВсегоПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("АвансыВыданные", Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура АвансыВыданныеВсегоВалютнаяПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("АвансыВыданные", Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура АвансыВыданныеСтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("АвансыВыданные", Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура АвансыВыданныеСуммаНДСПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("АвансыВыданные", Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура АвансыВыданныеСуммаНДСВалютнаяПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("АвансыВыданные", Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_АвансыВыданныеПредъявленныеКомиссионером

&НаКлиенте
Процедура АвансыВыданныеПредъявленныеКомиссионеромСчетФактураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.АвансыВыданныеПредъявленныеКомиссионером.ТекущиеДанные;
	Сведения = КонтрагентСчетФактуры(ТекущиеДанные.СчетФактура);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные,Сведения);
КонецПроцедуры

&НаКлиенте
Процедура АвансыВыданныеПредъявленныеКомиссионеромВсегоПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("АвансыВыданныеПредъявленныеКомиссионером", Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура АвансыВыданныеПредъявленныеКомиссионеромВсегоВалютнаяПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("АвансыВыданныеПредъявленныеКомиссионером", Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура АвансыВыданныеПредъявленныеКомиссионеромСтавкаНДСПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("АвансыВыданныеПредъявленныеКомиссионером", Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура АвансыВыданныеПредъявленныеКомиссионеромСуммаНДСПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("АвансыВыданныеПредъявленныеКомиссионером", Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура АвансыВыданныеПредъявленныеКомиссионеромСуммаНДСВалютнаяПриИзменении(Элемент)
	
	РассчитатьСуммыВСтроке("АвансыВыданныеПредъявленныеКомиссионером", Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ПроверитьИЗаполнить(Команда.Имя);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьИЗаполнить(ИмяКоманды)
	
	Если ИмяКоманды = "ЗаполнитьВсе" Тогда
		// Заполняем все табл.части
		ЗаполняемыеТабличныеЧасти = Новый Структура("Реализация,Реализация0,АвансыВыданные,АвансыВыданныеПредъявленныеКомиссионером");
		ЗаполняемыеТабличныеЧастиЗаполнены = (Объект["Реализация"].Количество() > 0
			ИЛИ Объект["Реализация0"].Количество() > 0
			ИЛИ Объект["АвансыВыданныеПредъявленныеКомиссионером"].Количество() > 0
			ИЛИ Объект["АвансыВыданные"].Количество() > 0);
		ТекстСообщения = НСтр("ru='Перед заполнением по данным учета
			|все табличные части будут очищены.
			|
			|Продолжить и очистить?'");
	Иначе
		// Заполняем только одну табл.часть
		ЗаполняемыеТабличныеЧасти = Новый Структура(ИмяКоманды);
		ЗаполняемыеТабличныеЧастиЗаполнены = (Объект[ИмяКоманды].Количество() > 0);
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Перед заполнением по данным учета
				|табличная часть ""%1""
				|будет очищена.
				|
				|Продолжить и очистить?'"),
			ИмяКоманды);
	КонецЕсли;
	
	Если ЗаполняемыеТабличныеЧастиЗаполнены Тогда
		ПараметрыОповещения = Новый Структура("ЗаполняемыеТабличныеЧасти", ЗаполняемыеТабличныеЧасти);
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнить_Выбор", ЭтотОбъект, ПараметрыОповещения);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьНаСервере(ЗаполняемыеТабличныеЧасти);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗаполнить_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаСервере(ПараметрыОповещения["ЗаполняемыеТабличныеЧасти"]);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Функция ЗаполнитьНаСервере(ЗаполняемыеТабличныеЧасти)
	
	Документы.ФормированиеЗаписейКнигиПродаж.ЗаполнитьПоДаннымУчета(Объект, ЗаполняемыеТабличныеЧасти);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция КонтрагентСчетФактуры(СчетФактура);
	Сведения = Новый Структура;
	Сведения.Вставить("Контрагент",СчетФактура.Контрагент);
	Сведения.Вставить("Договор",СчетФактура.Договор);
	Возврат 	Сведения;
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммыВСтроке(ИмяТаблЧасти, Элемент)
	
	ТекДанные = Элементы[ИмяТаблЧасти].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяИзмененногоПоля = Сред(Элемент.Имя, СтрДлина(ИмяТаблЧасти) + 1);
	
	Если ВРег(ИмяТаблЧасти) = ВРег("Реализация") Тогда
		
		Если ИмяИзмененногоПоля = "Сумма22" ИЛИ ИмяИзмененногоПоля = "Сумма22Валютная"
			ИЛИ ИмяИзмененногоПоля = "СуммаНДС22" ИЛИ ИмяИзмененногоПоля = "СуммаНДС22Валютная"
			ИЛИ ИмяИзмененногоПоля = "СтавкаНДС22" Тогда
			СтруктураИменПолей = Новый Структура();
			СтруктураИменПолей.Вставить("Сумма",			"Сумма22");
			СтруктураИменПолей.Вставить("СуммаНДС",			"СуммаНДС22");
			СтруктураИменПолей.Вставить("Всего",			"Всего");
			СтруктураИменПолей.Вставить("СтавкаНДС",		"СтавкаНДС22");
			СтруктураИменПолей.Вставить("СуммаВалютная",	"Сумма22Валютная");
			СтруктураИменПолей.Вставить("СуммаНДСВалютная",	"СуммаНДС22Валютная");
			СтруктураИменПолей.Вставить("ВсегоВалютная",	"ВсегоВалютная");
			УчетНДСКлиентСервер.РассчитатьСуммы(ТекДанные, ИмяИзмененногоПоля, СтруктураИменПолей);
			
		ИначеЕсли ИмяИзмененногоПоля = "Сумма18" ИЛИ ИмяИзмененногоПоля = "Сумма18Валютная"
			ИЛИ ИмяИзмененногоПоля = "СуммаНДС18" ИЛИ ИмяИзмененногоПоля = "СуммаНДС18Валютная"
			ИЛИ ИмяИзмененногоПоля = "СтавкаНДС18" Тогда
			СтруктураИменПолей = Новый Структура();
			СтруктураИменПолей.Вставить("Сумма",			"Сумма18");
			СтруктураИменПолей.Вставить("СуммаНДС",			"СуммаНДС18");
			СтруктураИменПолей.Вставить("Всего",			"Всего");
			СтруктураИменПолей.Вставить("СтавкаНДС",		"СтавкаНДС18");
			СтруктураИменПолей.Вставить("СуммаВалютная",	"Сумма18Валютная");
			СтруктураИменПолей.Вставить("СуммаНДСВалютная",	"СуммаНДС18Валютная");
			СтруктураИменПолей.Вставить("ВсегоВалютная",	"ВсегоВалютная");
			УчетНДСКлиентСервер.РассчитатьСуммы(ТекДанные, ИмяИзмененногоПоля, СтруктураИменПолей);
			
		ИначеЕсли ИмяИзмененногоПоля = "Сумма10" ИЛИ ИмяИзмененногоПоля = "Сумма10Валютная"
			ИЛИ ИмяИзмененногоПоля = "СуммаНДС10" ИЛИ ИмяИзмененногоПоля = "СуммаНДС10Валютная"
			ИЛИ ИмяИзмененногоПоля = "СтавкаНДС10" Тогда
			СтруктураИменПолей = Новый Структура();
			СтруктураИменПолей.Вставить("Сумма",			"Сумма10");
			СтруктураИменПолей.Вставить("СуммаНДС",			"СуммаНДС10");
			СтруктураИменПолей.Вставить("Всего",			"Всего");
			СтруктураИменПолей.Вставить("СтавкаНДС",		"СтавкаНДС10");
			СтруктураИменПолей.Вставить("СуммаВалютная",	"Сумма10Валютная");
			СтруктураИменПолей.Вставить("СуммаНДСВалютная",	"СуммаНДС10Валютная");
			СтруктураИменПолей.Вставить("ВсегоВалютная",	"ВсегоВалютная");
			УчетНДСКлиентСервер.РассчитатьСуммы(ТекДанные, ИмяИзмененногоПоля, СтруктураИменПолей);
			
		ИначеЕсли ИмяИзмененногоПоля = "Сумма7" ИЛИ ИмяИзмененногоПоля = "Сумма7Валютная"
			ИЛИ ИмяИзмененногоПоля = "СуммаНДС7" ИЛИ ИмяИзмененногоПоля = "СуммаНДС7Валютная"
			ИЛИ ИмяИзмененногоПоля = "СтавкаНДС7" Тогда
			СтруктураИменПолей = Новый Структура();
			СтруктураИменПолей.Вставить("Сумма",			"Сумма7");
			СтруктураИменПолей.Вставить("СуммаНДС",			"СуммаНДС7");
			СтруктураИменПолей.Вставить("Всего",			"Всего");
			СтруктураИменПолей.Вставить("СтавкаНДС",		"СтавкаНДС7");
			СтруктураИменПолей.Вставить("СуммаВалютная",	"Сумма7Валютная");
			СтруктураИменПолей.Вставить("СуммаНДСВалютная",	"СуммаНДС7Валютная");
			СтруктураИменПолей.Вставить("ВсегоВалютная",	"ВсегоВалютная");
			УчетНДСКлиентСервер.РассчитатьСуммы(ТекДанные, ИмяИзмененногоПоля, СтруктураИменПолей);
			
		ИначеЕсли ИмяИзмененногоПоля = "Сумма5" ИЛИ ИмяИзмененногоПоля = "Сумма5Валютная"
			ИЛИ ИмяИзмененногоПоля = "СуммаНДС5" ИЛИ ИмяИзмененногоПоля = "СуммаНДС5Валютная"
			ИЛИ ИмяИзмененногоПоля = "СтавкаНДС5" Тогда
			СтруктураИменПолей = Новый Структура();
			СтруктураИменПолей.Вставить("Сумма",			"Сумма5");
			СтруктураИменПолей.Вставить("СуммаНДС",			"СуммаНДС5");
			СтруктураИменПолей.Вставить("Всего",			"Всего");
			СтруктураИменПолей.Вставить("СтавкаНДС",		"СтавкаНДС5");
			СтруктураИменПолей.Вставить("СуммаВалютная",	"Сумма5Валютная");
			СтруктураИменПолей.Вставить("СуммаНДСВалютная",	"СуммаНДС5Валютная");
			СтруктураИменПолей.Вставить("ВсегоВалютная",	"ВсегоВалютная");
			УчетНДСКлиентСервер.РассчитатьСуммы(ТекДанные, ИмяИзмененногоПоля, СтруктураИменПолей);
		КонецЕсли;
		
		ТекДанные["Всего"] = ТекДанные["Сумма22"] + ТекДанные["СуммаНДС22"]
			+ ТекДанные["Сумма18"] + ТекДанные["СуммаНДС18"]
			+ ТекДанные["Сумма10"] + ТекДанные["СуммаНДС10"]
			+ ТекДанные["Сумма7"] + ТекДанные["СуммаНДС7"]
			+ ТекДанные["Сумма5"] + ТекДанные["СуммаНДС5"]
			+ ТекДанные["Сумма0"] + ТекДанные["СуммаБН"];
			
		ТекДанные["ВсегоВалютная"] = ТекДанные["Сумма22Валютная"] + ТекДанные["СуммаНДС22Валютная"]
			+ ТекДанные["Сумма18Валютная"] + ТекДанные["СуммаНДС18Валютная"]
			+ ТекДанные["Сумма10Валютная"] + ТекДанные["СуммаНДС10Валютная"]
			+ ТекДанные["Сумма7Валютная"] + ТекДанные["СуммаНДС7Валютная"]
			+ ТекДанные["Сумма5Валютная"] + ТекДанные["СуммаНДС5Валютная"]
			+ ТекДанные["Сумма0Валютная"] + ТекДанные["СуммаБНВалютная"];
		
	ИначеЕсли ВРег(ИмяТаблЧасти) = ВРег("АвансыВыданные") Тогда
		СтруктураИменПолей = Новый Структура();
		СтруктураИменПолей.Вставить("СуммаНДС",			"СуммаНДС");
		СтруктураИменПолей.Вставить("Всего",			"Всего");
		СтруктураИменПолей.Вставить("СтавкаНДС",		"СтавкаНДС");
		СтруктураИменПолей.Вставить("СуммаНДСВалютная",	"СуммаНДСВалютная");
		СтруктураИменПолей.Вставить("ВсегоВалютная",	"ВсегоВалютная");
		УчетНДСКлиентСервер.РассчитатьСуммы(ТекДанные, ИмяИзмененногоПоля, СтруктураИменПолей, Истина);
		
	ИначеЕсли ВРег(ИмяТаблЧасти) = ВРег("АвансыВыданныеПредъявленныеКомиссионером") Тогда
		СтруктураИменПолей = Новый Структура();
		СтруктураИменПолей.Вставить("СуммаНДС",			"СуммаНДС");
		СтруктураИменПолей.Вставить("Всего",			"Всего");
		СтруктураИменПолей.Вставить("СтавкаНДС",		"СтавкаНДС");
		СтруктураИменПолей.Вставить("СуммаНДСВалютная",	"СуммаНДСВалютная");
		СтруктураИменПолей.Вставить("ВсегоВалютная",	"ВсегоВалютная");
		УчетНДСКлиентСервер.РассчитатьСуммы(ТекДанные, ИмяИзмененногоПоля, СтруктураИменПолей, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСписокКодовВидовОпераций(Форма)
	
	Элементы	= Форма.Элементы;
	Объект		= Форма.Объект;
	
	УчетНДСКлиентСервер.ЗаполнитьСписокКодовВидовОпераций(
		Элементы["РеализацияКодВидаОперации"].СписокВыбора,
		,
		Объект["Дата"]);
	
	УчетНДСКлиентСервер.ЗаполнитьСписокКодовВидовОпераций(
		Элементы["Реализация0КодВидаОперации"].СписокВыбора,
		,
		Объект["Дата"]);
		
	УчетНДСКлиентСервер.ЗаполнитьСписокКодовВидовОпераций(
		Элементы["АвансыВыданныеКодВидаОперации"].СписокВыбора,
		,
		Объект["Дата"]);
		
	УчетНДСКлиентСервер.ЗаполнитьСписокКодовВидовОпераций(
		Элементы["АвансыВыданныеПредъявленныеКомиссионеромКодВидаОперации"].СписокВыбора,
		,
		Объект["Дата"]);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораСтавокНДС()
	
	СписокВыбора = Элементы.РеализацияСтавкаНДС22.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС22);
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС22_122);
	
	СписокВыбора = Элементы.РеализацияСтавкаНДС18.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС20);
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС20_120);
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС18);
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС18_118);
	
	СписокВыбора = Элементы.РеализацияСтавкаНДС10.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС10);
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС10_110);
	
	СписокВыбора = Элементы.РеализацияСтавкаНДС7.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС7);
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС7_107);
	
	СписокВыбора = Элементы.РеализацияСтавкаНДС5.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС5);
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС5_105);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// ВНЕШНИЙ ВИД ИТОГОВ ТАБЛИЦ
	//
	//	----------------------------------------
	//			ИспользоватьВалютныйУчет
	//	--------------------+-------------------
	//			Истина		|		Ложь
	//	--------------------+-------------------
	//	Всего               |
	//	в рублях: _________	|	Всего: _________
	//	в валюте: _________	|
	//	----------------------------------------
	
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	
	//---
	// Итоги таблицы Реализация
	//---
	ИменаЭлементов = Новый Структура();
	//						Имя элемента-группы			Имя элемента-поля для рублевой суммы
	ИменаЭлементов.Вставить("РеализацияИтогиВсего",		"РеализацияИтогВсего");
	ИменаЭлементов.Вставить("РеализацияИтогиНДС22",		"РеализацияИтогСуммаНДС22");
	ИменаЭлементов.Вставить("РеализацияИтогиНДС18",		"РеализацияИтогСуммаНДС18");
	ИменаЭлементов.Вставить("РеализацияИтогиНДС10",		"РеализацияИтогСуммаНДС10");
	ИменаЭлементов.Вставить("РеализацияИтогиНДС7",		"РеализацияИтогСуммаНДС7");
	ИменаЭлементов.Вставить("РеализацияИтогиНДС5",		"РеализацияИтогСуммаНДС5");
	ИменаЭлементов.Вставить("РеализацияИтогиНДС0",		"РеализацияИтогСумма0");
	ИменаЭлементов.Вставить("РеализацияИтогиБезНДС",	"РеализацияИтогСуммаБН");
	НастроитьЭлементыИтогов(ИменаЭлементов, ИспользоватьВалютныйУчет);
	
	//---
	// Итоги таблицы Реализация 0%
	//---
	ИменаЭлементов = Новый Структура();
	//						Имя элемента-группы			Имя элемента-поля для рублевой суммы
	ИменаЭлементов.Вставить("Реализация0ИтогиВсего",	"Реализация0ИтогВсего");
	НастроитьЭлементыИтогов(ИменаЭлементов, ИспользоватьВалютныйУчет);
	
	//---
	// Итоги таблицы Авансы выданные
	//---
	ИменаЭлементов = Новый Структура();
	//						Имя элемента-группы			Имя элемента-поля для рублевой суммы
	ИменаЭлементов.Вставить("АвансыВыданныеИтогиВсего",	"АвансыВыданныеИтогВсего");
	ИменаЭлементов.Вставить("АвансыВыданныеИтогиНДС",	"АвансыВыданныеИтогСуммаНДС");
	НастроитьЭлементыИтогов(ИменаЭлементов, ИспользоватьВалютныйУчет);
	
	
	//---
	// Итоги таблицы Авансы выданные, предъявленные комиссионером
	//---
	ИменаЭлементов = Новый Структура();
	//						Имя элемента-группы			Имя элемента-поля для рублевой суммы
	ИменаЭлементов.Вставить("АвансыВыданныеПредъявленныеКомиссионеромИтогиВсего",	"АвансыВыданныеПредъявленныеКомиссионеромИтогВсего");
	ИменаЭлементов.Вставить("АвансыВыданныеПредъявленныеКомиссионеромИтогиНДС",	"АвансыВыданныеПредъявленныеКомиссионеромИтогСуммаНДС");
	НастроитьЭлементыИтогов(ИменаЭлементов, ИспользоватьВалютныйУчет);
	
	//---
	// Таблица Реализация, надпись "в рублях"
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Реализация"" - надпись ""в рублях""'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в рублях'"));
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Истина;
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ИмяЭлемента = "РеализацияНадписьВРублях";
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	
	//---
	// Таблица Реализация, надпись "в валюте"
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Реализация"" - надпись ""в валюте""'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в валюте'"));
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Истина;
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ИмяЭлемента = "РеализацияНадписьВВалюте";
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	
	
	//---
	// Таблица Реализация 0%, надпись "в рублях"
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Реализация 0%"" - надпись ""в рублях""'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в рублях'"));
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Истина;
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ИмяЭлемента = "Реализация0НадписьВРублях";
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	
	//---
	// Таблица Реализация 0%, надпись "в валюте"
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Реализация 0%"" - надпись ""в валюте""'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в валюте'"));
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Истина;
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ИмяЭлемента = "Реализация0НадписьВВалюте";
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	
	
	//---
	// Таблица Авансы выданные, надпись "в рублях"
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Авансы выданные"" - надпись ""в рублях""'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в рублях'"));
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Истина;
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ИмяЭлемента = "АвансыВыданныеНадписьВРублях";
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	
	//---
	// Таблица Авансы выданные, надпись "в валюте"
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Авансы выданные"" - надпись ""в валюте""'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в валюте'"));
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Истина;
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ИмяЭлемента = "АвансыВыданныеНадписьВВалюте";
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	
		//---
	// Таблица Авансы выданные, предъявленные комиссионером надпись "в рублях"
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Авансы выданные, предъявленные комиссионером"" - надпись ""в рублях""'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в рублях'"));
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Истина;
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ИмяЭлемента = "АвансыВыданныеПредъявленныеКомиссионеромНадписьВРублях";
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	
	//---
	// Таблица Авансы выданные, предъявленные комиссионером, надпись "в валюте"
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Авансы выданные"" - надпись ""в валюте""'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в валюте'"));
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Истина;
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ИмяЭлемента = "АвансыВыданныеПредъявленныеКомиссионеромНадписьВВалюте";
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);

	
КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыИтогов(ИменаЭлементов, ИспользоватьВалютныйУчет)
	
	ОтображатьЗаголовокГруппы = ИспользоватьВалютныйУчет;
	
	Для Каждого Элемент Из ИменаЭлементов Цикл
		ИмяЭлементаГруппы	= Элемент.Ключ;
		ИмяЭлементаПоля		= Элемент.Значение;
		
		УстановитьЗаголовокПоля = НЕ ИспользоватьВалютныйУчет;
		
		// Элемент группы
		Элементы[ИмяЭлементаГруппы].ОтображатьЗаголовок = ОтображатьЗаголовокГруппы;
		
		// Элемент поля
		Если УстановитьЗаголовокПоля Тогда
			Элементы[ИмяЭлементаПоля].Заголовок				= Элементы[ИмяЭлементаГруппы].Заголовок;
			Элементы[ИмяЭлементаПоля].ПоложениеЗаголовка	= ПоложениеЗаголовкаЭлементаФормы.Лево;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//---
// Аналог установки свойства ТолькоПросмотр, но с возможностью открытия значения

&НаСервере
Процедура ТолькоПросмотр_ПоДаннымУчета_ИнициализацияСервер()
	
	НастройкиТаблиц = Новый Структура();
	
	НастройкиОднойТаблицы = Новый Структура();
	НастройкиОднойТаблицы.Вставить("ИмяФлажкаПоДаннымУчета", "ПоУчету");
	НастройкиОднойТаблицы.Вставить("ИменаЭлементов",
		"РеализацияСчетФактура,
		|РеализацияОбъектНалогообложения,
		|РеализацияКонтрагент,
		|РеализацияСчетРасчетов,
		|РеализацияКПС,
		|РеализацияКФО,
		|РеализацияСчетДебета,
		|РеализацияКОСГУСчетДебета");
	НастройкиТаблиц.Вставить("Реализация", НастройкиОднойТаблицы);
	
	НастройкиОднойТаблицы = Новый Структура();
	НастройкиОднойТаблицы.Вставить("ИмяФлажкаПоДаннымУчета", "ПоУчету");
	НастройкиОднойТаблицы.Вставить("ИменаЭлементов",
		"Реализация0СчетФактура,
		|Реализация0ОбъектНалогообложения,
		|Реализация0Контрагент,
		|Реализация0СчетРасчетов,
		|Реализация0КПС,
		|Реализация0КФО");
	НастройкиТаблиц.Вставить("Реализация0", НастройкиОднойТаблицы);
	
	НастройкиОднойТаблицы = Новый Структура();
	НастройкиОднойТаблицы.Вставить("ИмяФлажкаПоДаннымУчета", "ПоУчету");
	НастройкиОднойТаблицы.Вставить("ИменаЭлементов",
		"АвансыВыданныеСчетФактура,
		|АвансыВыданныеОбъектНалогообложения,
		|АвансыВыданныеКонтрагент,
		|АвансыВыданныеДоговор,
		|АвансыВыданныеСчетРасчетов,
		|АвансыВыданныеКПССчетРасчетов,
		|АвансыВыданныеКФО,
		|АвансыВыданныеДатаЗачета,
		|АвансыВыданныеСчетДебета,
		|АвансыВыданныеКОСГУСчетДебета");
	НастройкиТаблиц.Вставить("АвансыВыданные", НастройкиОднойТаблицы);
	
	НастройкиОднойТаблицы = Новый Структура();
	НастройкиОднойТаблицы.Вставить("ИмяФлажкаПоДаннымУчета", "ПоУчету");
	НастройкиОднойТаблицы.Вставить("ИменаЭлементов",
		"АвансыВыданныеПредъявленныеКомиссионеромСчетФактура,
		|АвансыВыданныеПредъявленныеКомиссионеромОбъектНалогообложения,
		|АвансыВыданныеПредъявленныеКомиссионеромКонтрагент,
		|АвансыВыданныеПредъявленныеКомиссионеромДоговор,
		|АвансыВыданныеПредъявленныеКомиссионеромСчетРасчетов,
		|АвансыВыданныеПредъявленныеКомиссионеромКПССчетРасчетов,
		|АвансыВыданныеПредъявленныеКомиссионеромКФО,
		|АвансыВыданныеПредъявленныеКомиссионеромДатаЗачета,
		|АвансыВыданныеПредъявленныеКомиссионеромСчетДебета,
		|АвансыВыданныеПредъявленныеКомиссионеромКОСГУСчетДебета");
	НастройкиТаблиц.Вставить("АвансыВыданныеПредъявленныеКомиссионером", НастройкиОднойТаблицы);
	
	УчетНДС.ТолькоПросмотр_ПоДаннымУчета_Инициализация(ЭтаФорма, НастройкиТаблиц);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТолькоПросмотр_ПоДаннымУчета_Таблица_ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УчетНДСКлиентСервер.ТолькоПросмотр_ПоДаннымУчета_Клиент_НастроитьЭлементыТекущейСтроки(ЭтаФорма, Элемент, НоваяСтрока);
	
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ТолькоПросмотр_ПоДаннымУчета_Таблица_ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УчетНДСКлиентСервер.ТолькоПросмотр_ПоДаннымУчета_Клиент_НастроитьЭлементыТекущейСтроки(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТолькоПросмотр_ПоДаннымУчета_Поле_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УчетНДСКлиентСервер.ТолькоПросмотр_ПоДаннымУчета_Клиент_ОтменитьСтандартнуюОбработкуСобытия(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ТолькоПросмотр_ПоДаннымУчета_Поле_Очистка(Элемент, СтандартнаяОбработка)
	
	УчетНДСКлиентСервер.ТолькоПросмотр_ПоДаннымУчета_Клиент_ОтменитьСтандартнуюОбработкуСобытия(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ТолькоПросмотр_ПоДаннымУчета_Поле_ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	УчетНДСКлиентСервер.ТолькоПросмотр_ПоДаннымУчета_Клиент_ОтменитьСтандартнуюОбработкуСобытия(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ТиповыеОперации

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

    БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

#КонецОбласти
