 
 #Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ТаблицаКФО.Очистить();
	
	ПодходящиеКФО = Новый Массив;
	
	Если Параметры.Свойство("Отбор")
		И ТипЗнч(Параметры.Отбор) = Тип("Структура") Тогда
		Если Параметры.Отбор.Свойство("Код")
			И ТипЗнч(Параметры.Отбор.Код) = Тип("СписокЗначений") Тогда
			
			СоответствиеЗначенийКФО = Новый Соответствие;
			Для каждого ЗначениеПеречисления Из Метаданные.Перечисления.КВД.ЗначенияПеречисления Цикл
				СоответствиеЗначенийКФО.Вставить(ЗначениеПеречисления.Синоним,Перечисления.КВД[ЗначениеПеречисления.Имя]);
			КонецЦикла;
	        
			Для Каждого СтрЗначения Из Параметры.Отбор.Код Цикл
				НайденноеЗначение = СоответствиеЗначенийКФО[СтрЗначения.Значение];
				Если НайденноеЗначение <> Неопределено
					И ПодходящиеКФО.Найти(НайденноеЗначение)=Неопределено Тогда
					ПодходящиеКФО.Добавить(НайденноеЗначение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПодходящиеКФО",ПодходящиеКФО);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КВД.Ссылка КАК КФО,
	|	ВЫБОР
	|		КОГДА КВД.Ссылка В (&ПодходящиеКФО)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДляОтбора
	|ИЗ
	|	Перечисление.КВД КАК КВД
	|
	|УПОРЯДОЧИТЬ ПО
	|	КВД.Порядок";
	
	ТаблицаКФО.Загрузить(Запрос.Выполнить().Выгрузить());
		
	Если Параметры.Свойство("ТекущаяСтрока")
		И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		СтрокиСписка = ТаблицаКФО.НайтиСтроки(Новый Структура("КФО",Параметры.ТекущаяСтрока));
		Если СтрокиСписка.Количество() Тогда
			Элементы.ТаблицаКФО.ТекущаяСтрока = СтрокиСписка[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ОтборПоПараметруБланка = Истина Тогда
		ДобавитьКнопкуОтборПоПараметруБланка();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьКФО(Команда)
	ОбработатьВыборЗначения();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПараметруБланка_Подключаемый(Команда)
	
	КнопкаОтборПоПараметруБланка = Элементы.Найти("КнопкаОтборПоПараметруБланка");
	Если НЕ КнопкаОтборПоПараметруБланка = Неопределено Тогда
		КнопкаОтборПоПараметруБланка.Пометка = НЕ КнопкаОтборПоПараметруБланка.Пометка;
		Если КнопкаОтборПоПараметруБланка.Пометка Тогда
			Элементы.ТаблицаКФО.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ДляОтбора",Истина));
		Иначе
			Элементы.ТаблицаКФО.ОтборСтрок = Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаКФО

&НаКлиенте
Процедура ТаблицаКФОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыборЗначения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборЗначения()
	ТекДанные = Элементы.ТаблицаКФО.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		Если Параметры.ОповещатьОВыборе = Истина Тогда
			ОповеститьОВыборе(ТекДанные.КФО);
		Иначе
			Закрыть(ТекДанные.КФО);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Не выбрано значение.'"));
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопкуОтборПоПараметруБланка()
	
	КомандаОтборПоПараметруБланка = ЭтаФорма.Команды.Добавить("ОтборПоПараметруБланка");
	КомандаОтборПоПараметруБланка.Действие = "ОтборПоПараметруБланка_Подключаемый";
	КомандаОтборПоПараметруБланка.Подсказка = "Отбор по параметру бланка";
	
	КнопкаОтборПоПараметруБланка = Элементы.Добавить("КнопкаОтборПоПараметруБланка",Тип("КнопкаФормы"),ЭтаФорма.КоманднаяПанель);
	КнопкаОтборПоПараметруБланка.Заголовок = "Отбор по параметру бланка";
	КнопкаОтборПоПараметруБланка.Картинка = БиблиотекаКартинок.ОтборКомпоновкиДанных;
	КнопкаОтборПоПараметруБланка.Отображение = ОтображениеКнопки.Картинка;
	КнопкаОтборПоПараметруБланка.ИмяКоманды = "ОтборПоПараметруБланка";
	КнопкаОтборПоПараметруБланка.Пометка = Истина;
	
	Элементы.ТаблицаКФО.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ДляОтбора",Истина));
	
КонецПроцедуры

#КонецОбласти
