#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Таблица.Ссылка.Дата КАК Период,
	|	Таблица.Ссылка.Организация КАК Организация,
	|	Таблица.ОсновноеСредство КАК ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	Таблица.СуммаАмортизации КАК СуммаАмортизации
	|ИЗ
	|	Документ.НачислениеАмортизацииОС.ОсновныеСредства КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|	И Таблица.СуммаАмортизации <> 0";
	
	АмортизацияОбъектовОС = Запрос.Выполнить().Выгрузить();
	ТаблицыДляДвижений.Вставить("АмортизацияОбъектовОС", АмортизацияОбъектовОС);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.НачислениеАмортизацииОС";
	КомандаПечати.Идентификатор		= "ВедомостьАмортизации";
	КомандаПечати.Представление		= НСтр("ru = 'Ведомость начисленной амортизации'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВедомостьАмортизации") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ВедомостьАмортизации", "Ведомость начисленной амортизации",
			УправлениеПечатьюБГУ.ПечатьВедомостиАмортизации(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

Функция ЗаполнитьТаблицуАмортизации(ТаблицаОтбора, Реквизиты) Экспорт
	
	ТаблицыАмортизации = УправлениеОсновнымиСредствами.РасчетАмортизацииОСиНМА(
		ТаблицаОтбора, Реквизиты, Ложь, Истина, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АмортизацияБУ", ТаблицыАмортизации.ТаблицаНачисленияАмортизацииБУ);
	Запрос.УстановитьПараметр("АмортизацияНУ", ТаблицыАмортизации.ТаблицаНачисленияАмортизацииНУ);
	Запрос.УстановитьПараметр("МаксПогрешность", 0.005);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(АмортизацияБУ.ОсновноеСредство КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	АмортизацияБУ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	АмортизацияБУ.СчетУчета КАК СчетУчета,
	|	АмортизацияБУ.ИФО КАК ИФО,
	|	АмортизацияБУ.КФО КАК КФО,
	|	АмортизацияБУ.КПС КАК КПС,
	|	АмортизацияБУ.Подразделение КАК Подразделение,
	|	АмортизацияБУ.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	АмортизацияБУ.АмортизацияНаКонецПериода КАК АмортизацияНаКонецПериода,
	|	АмортизацияБУ.ОбесценениеНаКонецПериода КАК ОбесценениеНаКонецПериода,
	|	АмортизацияБУ.СуммаАмортизацииБУ КАК СуммаАмортизацииБУ,
	|	АмортизацияБУ.СтоимостьНаКонецПериода КАК СтоимостьНаКонецПериода,
	|	АмортизацияБУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	АмортизацияБУ.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	АмортизацияБУ.КоэффициентУскорения КАК КоэффициентУскорения,
	|	АмортизацияБУ.ПараметрВыработки КАК ПараметрВыработки,
	|	АмортизацияБУ.ОбъемВыработки КАК ОбъемВыработки,
	|	АмортизацияБУ.ПредполагаемыйОбъемВыработки КАК ПредполагаемыйОбъемВыработки
	|ПОМЕСТИТЬ АмортизацияБУ
	|ИЗ
	|	&АмортизацияБУ КАК АмортизацияБУ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(АмортизацияНУ.ОсновноеСредство КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	АмортизацияНУ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	АмортизацияНУ.СчетУчетаНУ КАК СчетУчетаНУ,
	|	АмортизацияНУ.ИФО КАК ИФО,
	|	АмортизацияНУ.КФО КАК КФО,
	|	АмортизацияНУ.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА АмортизацияНУ.СтоимостьВыбыло > 0
	|			ТОГДА АмортизацияНУ.СтоимостьНаНачалоПериода - АмортизацияНУ.СтоимостьВыбыло
	|		ИНАЧЕ АмортизацияНУ.СтоимостьНаНачалоПериода
	|	КОНЕЦ КАК СтоимостьНаНачалоПериода,
	|	ВЫБОР
	|		КОГДА АмортизацияНУ.СтоимостьНеУчитываетсяНУВыбыло > 0
	|			ТОГДА АмортизацияНУ.СтоимостьНеУчитываетсяНУНаНачалоПериода - АмортизацияНУ.СтоимостьНеУчитываетсяНУВыбыло
	|		ИНАЧЕ АмортизацияНУ.СтоимостьНеУчитываетсяНУНаНачалоПериода
	|	КОНЕЦ КАК СтоимостьНеУчитываетсяНУНаНачалоПериода,
	|	ВЫБОР
	|		КОГДА АмортизацияНУ.СтоимостьЕНВДВыбыло > 0
	|			ТОГДА АмортизацияНУ.СтоимостьЕНВДНаНачалоПериода - АмортизацияНУ.СтоимостьЕНВДВыбыло
	|		ИНАЧЕ АмортизацияНУ.СтоимостьЕНВДНаНачалоПериода
	|	КОНЕЦ КАК СтоимостьЕНВДНаНачалоПериода,
	|	АмортизацияНУ.АмортизацияНаНачалоПериода КАК АмортизацияНаНачалоПериода,
	|	АмортизацияНУ.АмортизацияНеУчитываетсяНУНаНачалоПериода КАК АмортизацияНеУчитываетсяНУНаНачалоПериода,
	|	АмортизацияНУ.АмортизацияЕНВДНаНачалоПериода КАК АмортизацияЕНВДНаНачалоПериода,
	|	АмортизацияНУ.СуммаАмортизацииНУ КАК СуммаАмортизацииНУ,
	|	АмортизацияНУ.СуммаАмортизацииНеУчитываетсяНУ КАК СуммаАмортизацииНеУчитываетсяНУ,
	|	АмортизацияНУ.СуммаАмортизацииЕНВД КАК СуммаАмортизацииЕНВД,
	|	АмортизацияНУ.СуммаКапитальныхВложенийВключаемыхВРасходы КАК СуммаКапитальныхВложенийВключаемыхВРасходы,
	|	АмортизацияНУ.МетодНачисленияАмортизацииНУ КАК МетодНачисленияАмортизацииНУ,
	|	АмортизацияНУ.СтоимостьДляВычисленияАмортизацииНУ КАК СтоимостьДляВычисленияАмортизацииНУ,
	|	АмортизацияНУ.СрокИспользованияДляВычисленияАмортизацииНУ КАК СрокИспользованияДляВычисленияАмортизацииНУ,
	|	АмортизацияНУ.СпециальныйКоэффициентНУ КАК СпециальныйКоэффициентНУ,
	|	АмортизацияНУ.НормаАмортизацииНУ КАК НормаАмортизацииНУ
	|ПОМЕСТИТЬ АмортизацияНУ
	|ИЗ
	|	&АмортизацияНУ КАК АмортизацияНУ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	АмортизацияБУ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	АмортизацияБУ.ОсновноеСредство.Наименование КАК НаименованиеОбъекта,
	|	АмортизацияБУ.СчетУчета КАК СчетУчета,
	|	АмортизацияБУ.ИФО КАК ИФО,
	|	АмортизацияБУ.КФО КАК КФО,
	|	АмортизацияБУ.КПС КАК КПС,
	|	АмортизацияБУ.Подразделение КАК Подразделение,
	|	АмортизацияБУ.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	АмортизацияБУ.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	АмортизацияБУ.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	АмортизацияБУ.КоэффициентУскорения КАК КоэффициентУскорения,
	|	АмортизацияБУ.ПараметрВыработки КАК ПараметрВыработки,
	|	АмортизацияБУ.ОбъемВыработки КАК ОбъемВыработки,
	|	АмортизацияБУ.ПредполагаемыйОбъемВыработки КАК ПредполагаемыйОбъемВыработки,
	|	АмортизацияБУ.СтоимостьНаКонецПериода КАК Сумма,
	|	АмортизацияБУ.АмортизацияНаКонецПериода КАК СуммаАмортизацииНачисленная,
	|	АмортизацияБУ.ОбесценениеНаКонецПериода КАК СуммаОбесцененияНачисленная,
	|	ВЫБОР
	|		КОГДА АмортизацияБУ.СтоимостьНаКонецПериода - (АмортизацияБУ.АмортизацияНаКонецПериода +
	|			АмортизацияБУ.СуммаАмортизацииБУ) МЕЖДУ -(&МаксПогрешность *
	|			АмортизацияБУ.СрокИспользованияДляВычисленияАмортизации) И &МаксПогрешность *
	|			АмортизацияБУ.СрокИспользованияДляВычисленияАмортизации
	|			ТОГДА (АмортизацияБУ.СтоимостьНаКонецПериода - АмортизацияБУ.АмортизацияНаКонецПериода) * ВЫБОР
	|				КОГДА АмортизацияБУ.СтоимостьНаКонецПериода - (АмортизацияБУ.АмортизацияНаКонецПериода +
	|					АмортизацияБУ.СуммаАмортизацииБУ) < 0
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ
	|		ИНАЧЕ АмортизацияБУ.СуммаАмортизацииБУ
	|	КОНЕЦ КАК СуммаАмортизации,
	|	ЕСТЬNULL(АмортизацияНУ.СчетУчетаНУ, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетУчетаНУ,
	|	ЕСТЬNULL(АмортизацияНУ.МетодНачисленияАмортизацииНУ,
	|		ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизации.ПустаяСсылка)) КАК МетодНачисленияАмортизацииНУ,
	|	ЕСТЬNULL(АмортизацияНУ.СтоимостьДляВычисленияАмортизацииНУ, 0) КАК СтоимостьДляВычисленияАмортизацииНУ,
	|	ЕСТЬNULL(АмортизацияНУ.СрокИспользованияДляВычисленияАмортизацииНУ, 0) КАК
	|		СрокИспользованияДляВычисленияАмортизацииНУ,
	|	ЕСТЬNULL(АмортизацияНУ.СпециальныйКоэффициентНУ, 0) КАК СпециальныйКоэффициентНУ,
	|	ЕСТЬNULL(АмортизацияНУ.НормаАмортизацииНУ, 0) КАК НормаАмортизацииНУ,
	|	ЕСТЬNULL(АмортизацияНУ.СтоимостьНаНачалоПериода, 0) КАК СуммаНУ,
	|	ЕСТЬNULL(АмортизацияНУ.СтоимостьНеУчитываетсяНУНаНачалоПериода, 0) КАК СуммаНеУчитываетсяНУ,
	|	ЕСТЬNULL(АмортизацияНУ.СтоимостьЕНВДНаНачалоПериода, 0) КАК СуммаЕНВД,
	|	ЕСТЬNULL(АмортизацияНУ.АмортизацияНаНачалоПериода, 0) КАК СуммаАмортизацииНачисленнаяНУ,
	|	ЕСТЬNULL(АмортизацияНУ.АмортизацияНеУчитываетсяНУНаНачалоПериода, 0) КАК СуммаАмортизацииНачисленнаяНеУчитываетсяНУ,
	|	ЕСТЬNULL(АмортизацияНУ.АмортизацияЕНВДНаНачалоПериода, 0) КАК СуммаАмортизацииНачисленнаяЕНВД,
	|	ЕСТЬNULL(АмортизацияНУ.СуммаАмортизацииНУ, 0) КАК СуммаАмортизацииНУ,
	|	ЕСТЬNULL(АмортизацияНУ.СуммаАмортизацииНеУчитываетсяНУ, 0) КАК СуммаАмортизацииНеУчитываетсяНУ,
	|	ЕСТЬNULL(АмортизацияНУ.СуммаАмортизацииЕНВД, 0) КАК СуммаАмортизацииЕНВД,
	|	ЕСТЬNULL(АмортизацияНУ.СуммаКапитальныхВложенийВключаемыхВРасходы, 0) КАК
	|		СуммаКапитальныхВложенийВключаемыхВРасходыНУ
	|ИЗ
	|	АмортизацияБУ КАК АмортизацияБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияНУ КАК АмортизацияНУ
	|		ПО АмортизацияБУ.ОсновноеСредство = АмортизацияНУ.ОсновноеСредство
	|		И АмортизацияБУ.ИнвентарныйНомер = АмортизацияНУ.ИнвентарныйНомер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АмортизацияНУ.ОсновноеСредство,
	|	АмортизацияНУ.ИнвентарныйНомер,
	|	АмортизацияНУ.ОсновноеСредство.Наименование,
	|	ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка),
	|	АмортизацияНУ.ИФО,
	|	АмортизацияНУ.КФО,
	|	ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка),
	|	АмортизацияНУ.Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПустаяСсылка),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	АмортизацияНУ.СчетУчетаНУ,
	|	АмортизацияНУ.МетодНачисленияАмортизацииНУ,
	|	АмортизацияНУ.СтоимостьДляВычисленияАмортизацииНУ,
	|	АмортизацияНУ.СрокИспользованияДляВычисленияАмортизацииНУ,
	|	АмортизацияНУ.СпециальныйКоэффициентНУ,
	|	АмортизацияНУ.НормаАмортизацииНУ,
	|	АмортизацияНУ.СтоимостьНаНачалоПериода,
	|	АмортизацияНУ.СтоимостьНеУчитываетсяНУНаНачалоПериода,
	|	АмортизацияНУ.СтоимостьЕНВДНаНачалоПериода,
	|	АмортизацияНУ.АмортизацияНаНачалоПериода,
	|	АмортизацияНУ.АмортизацияНеУчитываетсяНУНаНачалоПериода,
	|	АмортизацияНУ.АмортизацияЕНВДНаНачалоПериода,
	|	АмортизацияНУ.СуммаАмортизацииНУ,
	|	АмортизацияНУ.СуммаАмортизацииНеУчитываетсяНУ,
	|	АмортизацияНУ.СуммаАмортизацииЕНВД,
	|	АмортизацияНУ.СуммаКапитальныхВложенийВключаемыхВРасходы
	|ИЗ
	|	АмортизацияНУ КАК АмортизацияНУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ АмортизацияБУ КАК АмортизацияБУ
	|		ПО АмортизацияНУ.ОсновноеСредство = АмортизацияБУ.ОсновноеСредство
	|		И АмортизацияНУ.ИнвентарныйНомер = АмортизацияБУ.ИнвентарныйНомер
	|ГДЕ
	|	АмортизацияБУ.ОсновноеСредство ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеОбъекта";
	
	ТаблицаАмортизации = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаАмортизации;
	
КонецФункции

#КонецОбласти

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьТаблицуАмортизации", Истина);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
