
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыВводаНаОсновании = Новый Структура();
	ПараметрыВводаНаОсновании.Вставить("ПараметрКоманды",						ПараметрКоманды);
	ПараметрыВводаНаОсновании.Вставить("ПараметрыВыполненияКоманды",			ПараметрыВыполненияКоманды);
	ПараметрыВводаНаОсновании.Вставить("ИмяТабличнойЧастиДокументаОснования",	"Излишки");
	
	ПараметрыВводаНаОсновании.Вставить("ВидДокумента",							"ПоступлениеМЗ");
	
	ВводНаОснованииКлиент.ОткрытьФормуВводаНаОсновании(ПараметрыВводаНаОсновании);
	
КонецПроцедуры
