#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоАгрегаторДвижений Тогда
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	НормироватьДанные();
	
	Если Не ОтражатьВБухгалтерскомУчете И Не ОтражатьВНалоговомУчете И Не ОтражатьИсторию Тогда
		ТекстОшибки = НСтр("ru = 'Необходимо настроить режим ввода: бух.учет, налог.учет, история.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,
			Ссылка, "ОтражатьВБухгалтерскомУчете", "Объект", Отказ);
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	ОтражатьВНалоговомУчетеОСН = ОтражатьВНалоговомУчете
		И НалоговыйУчетКлиентСервер.ОтражатьВНалоговомУчете(Организация, КонецГода(Дата)+1, КФО);
	ОтражатьВУСНДоходыМинусРасходы = ОтражатьВНалоговомУчете
		И УчетУСНКлиентСервер.ОтражатьВУСНДоходыМинусРасходы(Организация, КонецГода(Дата)+1, КФО);
	
	ПараметрыПроверки = Новый Структура("БухгалтерскийУчет, НалоговыйУчет, НалоговыйУчетУСН",
		ОтражатьВБухгалтерскомУчете, ОтражатьВНалоговомУчетеОСН, ОтражатьВУСНДоходыМинусРасходы);
	ЕстьОстаткиПоОС = Документы.ВводНачальныхОстатковОС.ЕстьОстаткиПоОсновномуСредству(
		ОсновноеСредство, ?(Проведен, Ссылка, КонецГода(Дата)), ПараметрыПроверки);
	Если ЕстьОстаткиПоОС.ЕстьОстаткиБУ Тогда 
		ТекстОшибки = НСтр("ru='По объекту уже введены остатки в бухгалтерском учете.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,
			Ссылка, "ОтражатьВБухгалтерскомУчете", "Объект", Отказ);
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	Если ЕстьОстаткиПоОС.ЕстьОстаткиНУ ИЛИ ЕстьОстаткиПоОС.ЕстьОстаткиУСН Тогда 
		ТекстОшибки = НСтр("ru='По объекту уже введены остатки в налоговом учете.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,
			Ссылка, "ОтражатьВНалоговомУчете", "Объект", Отказ);
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ОсновноеСредство, "ГрупповойУчет, ТипНФА");
	ГрупповойУчет = РеквизитыОбъекта.ГрупповойУчет;	
	ЭтоБиблиотечныйФонд = (РеквизитыОбъекта.ТипНФА = ПредопределенноеЗначение("Перечисление.ТипыНФА.БиблиотечныйФонд"));	
	
	ПараметрыУчета = Документы.ВводНачальныхОстатковОС.ПараметрыУчетаОбъектаОС(ОсновноеСредство, Дата);
	ВедетсяАналитическийУчет		= ПараметрыУчета.ВедетсяАналитическийУчет;
	ВедетсяНачислениеАмортизации	= ПараметрыУчета.ВедетсяНачислениеАмортизации;
	
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(СчетУчета);
	ВедетсяУчетПоПодразделениям = БухгалтерскийУчет.ПодразделениеОбязательно(СписокСчетов);
	
	ВедетсяУчетПоЦМО = БухгалтерскийУчетПовтИсп.ЕстьСубконтоСчета(СчетУчета, ПланыВидовХарактеристик.ВидыСубконто.ЦМО);
	
	ЭтоИндивидуальныйУчетНаСчете21 = НЕ ГрупповойУчет
		И ИнвентарныеОбъекты[0].НаСчете21;
	ЭтоИндивидуальныйУчетСписано = НЕ ГрупповойУчет
		И ИнвентарныеОбъекты[0].СостояниеОС = Перечисления.СостоянияОС.СнятоСУчета;
	
	// Шапка документа.
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Не ОтражатьВБухгалтерскомУчете Тогда
		НепроверяемыеРеквизиты.Добавить("СчетУчета");
		НепроверяемыеРеквизиты.Добавить("КФО");
		НепроверяемыеРеквизиты.Добавить("КПС");
		НепроверяемыеРеквизиты.Добавить("ДатаПринятияКУчету");
		НепроверяемыеРеквизиты.Добавить("ПервоначальноеКоличество");
		НепроверяемыеРеквизиты.Добавить("ПервоначальнаяСтоимость");
		Если Не ОтражатьИсторию Тогда
			НепроверяемыеРеквизиты.Добавить("ИнвентарныеОбъекты.СостояниеОС");
		КонецЕсли;
	ИначеЕсли ЭтоБиблиотечныйФонд Тогда	
		НепроверяемыеРеквизиты.Добавить("ПервоначальноеКоличество");
		НепроверяемыеРеквизиты.Добавить("Местонахождение.Количество");
	КонецЕсли;
	
	Если Не ОтражатьВНалоговомУчетеОСН
		ИЛИ (ЭтоИндивидуальныйУчетНаСчете21)
		ИЛИ (ЭтоИндивидуальныйУчетСписано) Тогда
		НепроверяемыеРеквизиты.Добавить("ПорядокВключенияСтоимостиВСоставРасходовНУ");
	КонецЕсли;
	
	Если Не ОтражатьВУСНДоходыМинусРасходы
		ИЛИ (ЭтоИндивидуальныйУчетНаСчете21)
		ИЛИ (ЭтоИндивидуальныйУчетСписано) Тогда
		НепроверяемыеРеквизиты.Добавить("ПорядокВключенияСтоимостиВСоставРасходовУСН");
		НепроверяемыеРеквизиты.Добавить("СрокПолезногоИспользованияУСН");
	Иначе
		Если ПорядокВключенияСтоимостиВСоставРасходовУСН <>
				Перечисления.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставРасходовНаОСиНМА Тогда
			НепроверяемыеРеквизиты.Добавить("СрокПолезногоИспользованияУСН");
		КонецЕсли;
	КонецЕсли;
	
	НачислениеАмортизацииПриВводеВЭксплуатацию = Ложь;
	Если СтоимостьИАмортизация.Количество() > 0 Тогда
		Способ = СтоимостьИАмортизация[СтоимостьИАмортизация.Количество()-1].СпособНачисленияАмортизации;
		НачислениеАмортизацииПриВводеВЭксплуатацию = (Способ = Перечисления.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию);
	КонецЕсли;
	
	// Таблица "ИнвентарныеОбъекты".
	Если ОтражатьВБухгалтерскомУчете Тогда
		Для Каждого СтрокаИнвентарныйОбъект Из ИнвентарныеОбъекты Цикл
			
			// Инвентарный номер
			Если ГрупповойУчет И Не ЗначениеЗаполнено(СтрокаИнвентарныйОбъект.ИнвентарныйНомер) И ИнвентарныйУчет = 0 Тогда
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Инвентарный номер'"),
				СтрокаИнвентарныйОбъект.НомерСтроки, НСтр("ru = 'Инвентарные объекты'"));
				ПолеОшибки = "ИнвентарныеОбъекты[" + Формат(СтрокаИнвентарныйОбъект.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ИнвентарныйНомер";
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, ПолеОшибки, "Объект", Отказ);
			КонецЕсли;
			
			// ЦМО, Подразделение.
			Если ВедетсяУчетПоЦМО И НЕ ЗначениеЗаполнено(СтрокаИнвентарныйОбъект.ЦМО) Тогда
				Если НЕ ГрупповойУчет Тогда
					ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле",, НСтр("ru = 'МОЛ/Место хранения'"));
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, , , Отказ);
				Иначе
					ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'МОЛ'"),
					СтрокаИнвентарныйОбъект.НомерСтроки, НСтр("ru = 'Инвентарные объекты'"));
					ПолеОшибки = "ИнвентарныеОбъекты[" + Формат(СтрокаИнвентарныйОбъект.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ЦМО";
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, ПолеОшибки, "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
			Если ВедетсяУчетПоПодразделениям И НЕ ЗначениеЗаполнено(СтрокаИнвентарныйОбъект.Подразделение) Тогда
				Если НЕ ГрупповойУчет Тогда
					ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле",, НСтр("ru = 'Подразделение'"));
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, , , Отказ);
				Иначе
					ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Подразделение'"),
					СтрокаИнвентарныйОбъект.НомерСтроки, НСтр("ru = 'Инвентарные объекты'"));
					ПолеОшибки = "ИнвентарныеОбъекты[" + Формат(СтрокаИнвентарныйОбъект.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Подразделение";
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, ПолеОшибки, "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
			
			Если ВедетсяНачислениеАмортизации И НачислениеАмортизацииПриВводеВЭксплуатацию Тогда
				// Если 100% начисление амортизации, то сумма амортизации должна быть равна стоимости или равна 0.
				Если СтрокаИнвентарныйОбъект.СуммаАмортизации > 0
					И СтрокаИнвентарныйОбъект.Стоимость <> СтрокаИнвентарныйОбъект.СуммаАмортизации Тогда
					ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность", НСтр("ru = 'Амортизация'"),
					СтрокаИнвентарныйОбъект.НомерСтроки, НСтр("ru = 'Инвентарные объекты'"),
					НСтр("ru = 'Сумма амортизации должна быть равна стоимости'"));
					ПолеОшибки = "ИнвентарныеОбъекты[" + Формат(СтрокаИнвентарныйОбъект.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].СуммаАмортизации";
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, ПолеОшибки, "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
			
			// Контрагент - для объектов, переданных в пользование.
			Если ЗначениеЗаполнено(СтрокаИнвентарныйОбъект.ВПользованииСостояниеОС)
				И Не ЗначениеЗаполнено(СтрокаИнвентарныйОбъект.ВПользованииКонтрагент) Тогда
				Если Не ГрупповойУчет Тогда
					ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле",, НСтр("ru = 'Контрагент'"));
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, , , Отказ);
				Иначе
					ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Контрагент'"),
					СтрокаИнвентарныйОбъект.НомерСтроки, НСтр("ru = 'Инвентарные объекты'"));
					ПолеОшибки = "ИнвентарныеОбъекты[" + Формат(СтрокаИнвентарныйОбъект.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ВПользованииКонтрагент";
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, ПолеОшибки, "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
			
			// Проверим реквизиты в зависимости от состояния ОС в организации.
			Если (ОтражатьВБухгалтерскомУчете Или ОтражатьИсторию) И (Не ГрупповойУчет Или ИнвентарныйУчет = 0) Тогда
				
				// Дата ввода в эксплуатацию.
				Если СтрокаИнвентарныйОбъект.СостояниеОС <> Перечисления.СостоянияОС.ПринятоКУчету
					И НЕ ЗначениеЗаполнено(СтрокаИнвентарныйОбъект.ДатаВводаВЭксплуатацию) Тогда
					Если НЕ ГрупповойУчет Тогда
						ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле",, НСтр("ru = 'Дата ввода в эксплуатацию'"));
						ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, , , Отказ);
					Иначе
						ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Дата ввода в эксплуатацию'"),
						СтрокаИнвентарныйОбъект.НомерСтроки, НСтр("ru = 'Инвентарные объекты'"));
						ПолеОшибки = "ИнвентарныеОбъекты[" + Формат(СтрокаИнвентарныйОбъект.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ДатаВводаВЭксплуатацию";
						ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, ПолеОшибки, "Объект", Отказ);
					КонецЕсли;
				КонецЕсли;
				
				// Дата списания.
				Если СтрокаИнвентарныйОбъект.СостояниеОС = Перечисления.СостоянияОС.СнятоСУчета
					И НЕ ЗначениеЗаполнено(СтрокаИнвентарныйОбъект.ДатаСписания) Тогда
					Если НЕ ГрупповойУчет Тогда
						ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле",, НСтр("ru = 'Дата списания'"));
						ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, , , Отказ);
					Иначе
						ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Дата списания'"),
						СтрокаИнвентарныйОбъект.НомерСтроки, НСтр("ru = 'Инвентарные объекты'"));
						ПолеОшибки = "ИнвентарныеОбъекты[" + Формат(СтрокаИнвентарныйОбъект.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ДатаСписания";
						ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, ПолеОшибки, "Объект", Отказ);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если ГрупповойУчет Тогда
		УправлениеОсновнымиСредствами.ПроверитьДублиИнвентарныхНомеровВТабЧасти(ЭтотОбъект, "ИнвентарныеОбъекты", Отказ);
		Если ВедетсяАналитическийУчет Тогда
			ПроверитьСтоимостьОбъектовВТабЧастиИнвентарныеОбъекты(ЭтотОбъект, Отказ);
		КонецЕсли
	КонецЕсли;
	
	// Таблица "СтоимостьИАмортизация"
	Если Не ОтражатьИсторию Или ИнвентарныйУчет = 1 Тогда
		НепроверяемыеРеквизиты.Добавить("СтоимостьИАмортизация.Период");
		НепроверяемыеРеквизиты.Добавить("СтоимостьИАмортизация.Событие");
	КонецЕсли;
	Если Не ВедетсяНачислениеАмортизации
		Или (ОтражатьВНалоговомУчете И Не ОтражатьВБухгалтерскомУчете) Тогда // Ввод остатков только в НУ.
		НепроверяемыеРеквизиты.Добавить("СтоимостьИАмортизация.ПорядокПогашенияСтоимости");
	Иначе
		Инд = Не ОтражатьИсторию Или ГрупповойУчет И ИнвентарныйУчет = 1;
		Если Инд И Не ЗначениеЗаполнено(СтоимостьИАмортизация[0].ПорядокПогашенияСтоимости) Тогда
			НепроверяемыеРеквизиты.Добавить("СтоимостьИАмортизация.ПорядокПогашенияСтоимости");
			ТекстОшибки = НСтр("ru = 'Закладка ""Амортизация"". '")
				+ ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле",, НСтр("ru = 'Порядок погашения стоимости'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ТаблАмортизация = СтоимостьИАмортизация.Выгрузить(, "Период,ПорядокПогашенияСтоимости,СпособНачисленияАмортизации");
	Для Каждого СтрокаАмортизация Из ТаблАмортизация Цикл
		Если СтрокаАмортизация.ПорядокПогашенияСтоимости <> Перечисления.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации Тогда
			СтрокаАмортизация.СпособНачисленияАмортизации = Перечисления.СпособНачисленияАмортизации.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	ТаблАмортизация.Свернуть("Период,ПорядокПогашенияСтоимости,СпособНачисленияАмортизации");
	ТаблАмортизация.Колонки.Добавить("Количество");
	ТаблАмортизация.ЗаполнитьЗначения(1, "Количество");
	ТаблАмортизация.Свернуть("Период", "Количество");
	Для Каждого СтрокаАмортизация Из ТаблАмортизация Цикл
		Если СтрокаАмортизация.Количество > 1 Тогда
			ТекстОшибки = НСтр("ru = 'Закладка ""Стоимость"". На %1 заданы различные порядки погашения стоимости'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Формат(СтрокаАмортизация.Период, "ДЛФ=D"));
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	// Таблица "Местонахождение".
	Если ОтражатьИсторию И ВедетсяУчетПоЦМО Тогда
		// Обязательно заполнить местонахождение, иначе перестанет начисляться амортизация.
		ПроверяемыеРеквизиты.Добавить("Местонахождение");
	КонецЕсли;
	Если ИнвентарныйУчет = 0 Тогда
		НепроверяемыеРеквизиты.Добавить("Местонахождение.Событие");
		НепроверяемыеРеквизиты.Добавить("Местонахождение.Количество");
		НепроверяемыеРеквизиты.Добавить("Местонахождение.Сумма");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты); 
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВводНачальныхОстатковОС") Тогда
		
		СтандартнаяОбработка = Ложь;
		ЗаполнитьИзДокументаОснования(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		
		СтандартнаяОбработка = Ложь;
		ЗаполнитьПоОС(ДанныеЗаполнения);
		
	ИначеЕсли ДанныеЗаполнения = "ИзДвиженийДокумента" Тогда
		
		СтандартнаяОбработка = Ложь;
		Документы.ВводНачальныхОстатковОС.ЗаполнитьИзДвижений(ЭтотОбъект);
		
		ДанныеЗаполнения = Новый Структура("ВводНаОсновании");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ЭтоПереносИзСтарогоДокумента Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЭтоАгрегаторДвижений Тогда
		// Проводки не будут переформировываться
		ДополнительныеСвойства.Вставить("РучнаяКорректировка", Истина);
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		НормироватьДанные();
		Если Не ЭтоАгрегаторДвижений И Не Проведен Тогда
			Для Каждого НаборЗаписей Из Движения Цикл
				НаборЗаписей.Очистить();
				НаборЗаписей.Записывать = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОтключитьПроверкуЗапретаИзменения();
	
	УстановитьАктивностьПредыдущейИстории(Ложь);
	
	Если ЭтоАгрегаторДвижений Тогда
		ИзменитьАктивностьДвиженийДокумента(Ссылка, Истина);
	Иначе
		ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
		ПрослеживаемостьБГУ.СформироватьДвижения(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОтключитьПроверкуЗапретаИзменения();
	
	Если ЭтоАгрегаторДвижений Тогда
		ИзменитьАктивностьДвиженийДокумента(Ссылка, Ложь);
	Иначе
		ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	УстановитьАктивностьПредыдущейИстории(Истина);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтоАгрегаторДвижений = Ложь;
	
	Если ОтражатьИсторию
		И НЕ ОтражатьВБухгалтерскомУчете
		И НЕ ОтражатьВНалоговомУчете Тогда
		ДокументОснование = ОбъектКопирования;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура УстановитьАктивностьПредыдущейИстории(Активность)
	
	Если ОтражатьИсторию И ЗначениеЗаполнено(ДокументОснование) Тогда
		ИзменитьАктивностьДвиженийДокумента(ДокументОснование, Активность, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьАктивностьДвиженийДокумента(ДокументСсылка, Активность, ТолькоИсторию = Ложь)
	
	МенеджерыРегистров = Новый Массив;
	
	Если ТолькоИсторию Тогда
		
		МенеджерыРегистров.Добавить(РегистрыСведений.КапРемонтОС);
		МенеджерыРегистров.Добавить(РегистрыСведений.НачислениеАмортизацииОСБухгалтерскийУчет);
		МенеджерыРегистров.Добавить(РегистрыСведений.ПараметрыАмортизацииОСБухгалтерскийУчет);
		МенеджерыРегистров.Добавить(РегистрыСведений.ПереоценкаНФА);
		МенеджерыРегистров.Добавить(РегистрыСведений.РасчетАмортизацииОС);
		МенеджерыРегистров.Добавить(РегистрыСведений.СобытияОС);
		
		МенеджерыРегистров.Добавить(РегистрыНакопления.СтоимостьОбъектовОС);
		МенеджерыРегистров.Добавить(РегистрыНакопления.АмортизацияОбъектовОС);
		МенеджерыРегистров.Добавить(РегистрыНакопления.НаличиеДрагМатериаловВОбъектахНФА);
		
	Иначе
		
		ДвиженияДокумента = Метаданные.Документы.ВводНачальныхОстатковОС.Движения;
		Для Каждого Регистр Из ДвиженияДокумента Цикл
			МенеджерыРегистров.Добавить(ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Регистр.ПолноеИмя()));
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого Менеджер Из МенеджерыРегистров Цикл
		
		НаборЗаписей = Менеджер.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Прочитать();
		
		НаборЗаписей.УстановитьАктивность(Активность);
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения");
		НаборЗаписей.Записывать = Истина;
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		
		Если ТипЗнч(Менеджер) = Тип("РегистрБухгалтерииМенеджер.ЖурналПроводокЕПСБУ") Тогда
			
			Запись = РегистрыСведений.ОперацииДокументов.СоздатьМенеджерЗаписи();
			Запись.Документ = ДокументСсылка;
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				Запись.ЕстьПроводки = Активность И НаборЗаписей.Количество() > 0;
				Запись.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтключитьПроверкуЗапретаИзменения()
	
	Для Каждого НаборЗаписей Из Движения Цикл
		НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения");
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ЗаполнитьИзДокументаОснования(ДокументИсточник)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументИсточник,, "Проведен,Номер,Дата");
	
	ДокументОснование			= ДокументИсточник;
	ОтражатьВБухгалтерскомУчете	= Ложь;
	ОтражатьВНалоговомУчете		= Ложь;
	ОтражатьИсторию				= Истина;
	ЭтоАгрегаторДвижений		= Ложь;
	
	ИнвентарныеОбъекты.Загрузить(	ДокументИсточник.ИнвентарныеОбъекты.Выгрузить());
	СтоимостьИАмортизация.Загрузить(ДокументИсточник.СтоимостьИАмортизация.Выгрузить());
	Местонахождение.Загрузить(		ДокументИсточник.Местонахождение.Выгрузить());
	КапитальныйРемонт.Загрузить(	ДокументИсточник.КапитальныйРемонт.Выгрузить());
	ДрагМатериалы.Загрузить(		ДокументИсточник.ДрагМатериалы.Выгрузить());
	РасходыУСН.Загрузить(			ДокументИсточник.РасходыУСН.Выгрузить());
	
	Если Не ДокументИсточник.ОтражатьИсторию Тогда
		ЗаполнитьТаблицыИсторииПоОстаткам();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоОС(ОС)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОсновноеСредство", ОС);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВводНачальныхОстатковОС.Ссылка КАК Документ,
	|	ВводНачальныхОстатковОС.ДокументОснование
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ВводНачальныхОстатковОС КАК ВводНачальныхОстатковОС
	|ГДЕ
	|	ВводНачальныхОстатковОС.ОсновноеСредство = &ОсновноеСредство
	|	И ВводНачальныхОстатковОС.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ.Документ
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	НЕ ВТ.Документ В
	|				(ВЫБРАТЬ
	|					ВТ.ДокументОснование
	|				ИЗ
	|					ВТ КАК ВТ)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьИзДокументаОснования(Выборка.Документ);
	Иначе
		ОсновноеСредство = ОС;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицыИсторииПоОстаткам()
	
	ПараметрыУчета = Документы.ВводНачальныхОстатковОС.ПараметрыУчетаОбъектаОС(ОсновноеСредство, Дата);
	ВедетсяАналитическийУчет = ПараметрыУчета.ВедетсяАналитическийУчет;
	
	// Заполнение таблицы СтоимостьИАмортизация
	
	ДанныеТаблицы = Новый Структура("ПорядокПогашенияСтоимости,СпособНачисленияАмортизации,СрокПолезногоИспользования,
		|РасчетАмортизацииВручную,СтоимостьДляВычисленияАмортизации,СрокИспользованияДляВычисленияАмортизации");
	
	Если СтоимостьИАмортизация.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ДанныеТаблицы, СтоимостьИАмортизация[0]); 
	КонецЕсли;
	
	СтоимостьИАмортизация.Очистить();
	
	Для Каждого СтрокаИнвНомер Из ИнвентарныеОбъекты Цикл
		
		НоваяСтрока = СтоимостьИАмортизация.Добавить();
		
		НоваяСтрока.ИнвентарныйНомер = СтрокаИнвНомер.ИнвентарныйНомер;
		НоваяСтрока.Событие = ПредопределенноеЗначение("Перечисление.СобытияИсторииСтоимостиОС.ПринятиеКУчету");
		НоваяСтрока.БалансоваяСтоимость = СтрокаИнвНомер.Стоимость;
		НоваяСтрока.СуммаАмортизации = СтрокаИнвНомер.СуммаАмортизации;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеТаблицы);
		Если ВедетсяАналитическийУчет Тогда
			НоваяСтрока.Период						= ДатаПринятияКУчету;
			НоваяСтрока.ВидПервичногоДокумента		= ДокументПринятияВид;
			НоваяСтрока.ДатаПервичногоДокумента		= ДокументПринятияДата;
			НоваяСтрока.НомерПервичногоДокумента	= ДокументПринятияНомер;
		Иначе
			НоваяСтрока.Период						= СтрокаИнвНомер.ДатаВводаВЭксплуатацию;
			НоваяСтрока.ВидПервичногоДокумента		= СтрокаИнвНомер.ДокументВводаВид;
			НоваяСтрока.ДатаПервичногоДокумента		= СтрокаИнвНомер.ДокументВводаДата;
			НоваяСтрока.НомерПервичногоДокумента	= СтрокаИнвНомер.ДокументВводаНомер;
		КонецЕсли;
		
	КонецЦикла;
	
	
	// Заполнение таблицы Местонахождение
	
	Местонахождение.Очистить();
	
	Для Каждого СтрокаИнвНомер Из ИнвентарныеОбъекты Цикл
		
		НоваяСтрока = Местонахождение.Добавить();
		
		НоваяСтрока.ИнвентарныйНомер = СтрокаИнвНомер.ИнвентарныйНомер;
		НоваяСтрока.ЦМО = СтрокаИнвНомер.ЦМО;
		НоваяСтрока.Событие = ПредопределенноеЗначение("Перечисление.СобытияИсторииМестонахожденияОС.ПринятиеКУчету");
		Если ВедетсяАналитическийУчет Тогда
			НоваяСтрока.Период				= ДатаПринятияКУчету;
			НоваяСтрока.НазваниеДокумента	= ДокументПринятияВид;
			НоваяСтрока.ДатаДокумента		= ДокументПринятияДата;
			НоваяСтрока.НомерДокумента		= ДокументПринятияНомер;
		Иначе
			НоваяСтрока.Период				= СтрокаИнвНомер.ДатаВводаВЭксплуатацию;
			НоваяСтрока.НазваниеДокумента	= СтрокаИнвНомер.ДокументВводаВид;
			НоваяСтрока.ДатаДокумента		= СтрокаИнвНомер.ДокументВводаДата;
			НоваяСтрока.НомерДокумента		= СтрокаИнвНомер.ДокументВводаНомер;
		КонецЕсли;
		
		Если ИнвентарныйУчет = 1 Тогда
			НоваяСтрока.Сумма = СтрокаИнвНомер.Стоимость;
			НоваяСтрока.Количество = СтрокаИнвНомер.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НормироватьДанные()
	
	ГрупповойУчет = ?(ЗначениеЗаполнено(ОсновноеСредство),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновноеСредство, "ГрупповойУчет"),
		Ложь);
	
	ПараметрыУчета = Документы.ВводНачальныхОстатковОС.ПараметрыУчетаОбъектаОС(ОсновноеСредство, Дата);
	ВедетсяАналитическийУчет = ПараметрыУчета.ВедетсяАналитическийУчет;
	
	Если Не ВедетсяАналитическийУчет Тогда
		ИнвентарныйУчет = 1;
	ИначеЕсли Не ГрупповойУчет Тогда
		ИнвентарныйУчет = 0;
	КонецЕсли;
	
	// таблица ИнвентарныеОбъекты
	// и инвентарный номер
	
	Если ГрупповойУчет Тогда
		
		Если ИнвентарныйУчет = 1 Тогда
			
			пИнвентарныйНомер = Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
			ЗаполнитьИнвентарныйНомерВТаблице(пИнвентарныйНомер, ИнвентарныеОбъекты);
			ЗаполнитьИнвентарныйНомерВТаблице(пИнвентарныйНомер, СтоимостьИАмортизация);
			ЗаполнитьИнвентарныйНомерВТаблице(пИнвентарныйНомер, Местонахождение);
			ЗаполнитьИнвентарныйНомерВТаблице(пИнвентарныйНомер, КапитальныйРемонт);
			ЗаполнитьИнвентарныйНомерВТаблице(пИнвентарныйНомер, ДрагМатериалы);
			ЗаполнитьИнвентарныйНомерВТаблице(пИнвентарныйНомер, Консервация);
			
		КонецЕсли;
		
	Иначе
		
		Если ИнвентарныеОбъекты.Количество() = 0 Тогда
			ИнвентарныеОбъекты.Добавить();
		Иначе
			Пока ИнвентарныеОбъекты.Количество() > 1 Цикл
				ИнвентарныеОбъекты.Удалить(1);
			КонецЦикла;
		КонецЕсли;
		
		пИнвентарныйНомер = ?(ИнвентарныйУчет = 0, ИнвентарныеОбъекты[0].ИнвентарныйНомер,
			Справочники.ИнвентарныеНомераОС.ПустаяСсылка());
		ЗаполнитьИнвентарныйНомерВТаблице(пИнвентарныйНомер, ИнвентарныеОбъекты);
		ЗаполнитьИнвентарныйНомерВТаблице(пИнвентарныйНомер, СтоимостьИАмортизация);
		ЗаполнитьИнвентарныйНомерВТаблице(пИнвентарныйНомер, Местонахождение);
		ЗаполнитьИнвентарныйНомерВТаблице(пИнвентарныйНомер, КапитальныйРемонт);
		ЗаполнитьИнвентарныйНомерВТаблице(пИнвентарныйНомер, ДрагМатериалы);
		ЗаполнитьИнвентарныйНомерВТаблице(пИнвентарныйНомер, Консервация);
		
	КонецЕсли;
	
	Для Каждого Строка Из ИнвентарныеОбъекты Цикл
		
		Если Строка.СостояниеОС = Перечисления.СостоянияОС.ПринятоКУчету Тогда
			ОчиститьВвод	 = Истина;
			ОчиститьСписание = Истина;
		ИначеЕсли Строка.СостояниеОС = Перечисления.СостоянияОС.ВведеноВЭксплуатацию Тогда
			ОчиститьВвод	 = Ложь;
			ОчиститьСписание = Истина;
		Иначе
			ОчиститьВвод	 = Ложь;
			ОчиститьСписание = Ложь;
		КонецЕсли;
		
		Если ОчиститьВвод Тогда
			Строка.ДатаВводаВЭксплуатацию	= '00010101';
			Строка.ДокументВводаДата		= '00010101';
			Строка.ДокументВводаНомер		= "";
			Строка.ДокументВводаВид			= "";
		КонецЕсли;
		
		Если ОчиститьСписание Тогда
			Строка.ДатаСписания				= '00010101';
			Строка.ДокументСписанияДата		= '00010101';
			Строка.ДокументСписанияНомер	= "";
			Строка.ДокументСписанияВид		= "";
			Строка.ПричинаСписания			= "";
		КонецЕсли;
		
	КонецЦикла;
	
	// таблица СтоимостьИАмортизация
	
	Если ОтражатьИсторию И ИнвентарныйУчет = 0 Тогда
		
		Таблицы = ТаблицыИнвНомеров(СтоимостьИАмортизация);
		
		Для Каждого СтрокаИнвНомер Из Таблицы Цикл
			
			ПредыдущаяСтрока = Неопределено;
			
			Для Каждого Строка Из СтрокаИнвНомер.Таблица Цикл
				
				ОпределитьВременнуюСоставляющуюПериода(Строка);
				
				Если Строка.ПорядокПогашенияСтоимости <> Перечисления.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации Тогда
					Строка.СпособНачисленияАмортизации = Перечисления.СпособНачисленияАмортизации.ПустаяСсылка();
				КонецЕсли;
				
				ПредыдущаяБалансоваяСтоимость		= ?(ПредыдущаяСтрока = Неопределено, 0, ПредыдущаяСтрока.БалансоваяСтоимость);
				Строка.БалансоваяСтоимостьДельта	= Строка.БалансоваяСтоимость - ПредыдущаяБалансоваяСтоимость;
				
				ПредыдущаяСтрока = Строка;
				
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		
		Пока СтоимостьИАмортизация.Количество() > 1 Цикл
			СтоимостьИАмортизация.Удалить(1);
		КонецЦикла;
		Если СтоимостьИАмортизация.Количество() > 0 Тогда
			СтрокаСиА = СтоимостьИАмортизация[0];
			СтрокаСиА.Период					= ДатаПринятияКУчету;
			СтрокаСиА.Событие					= Перечисления.СобытияИсторииСтоимостиОС.ПринятиеКУчету;
			СтрокаСиА.ИнвентарныйНомер			= Неопределено;
			СтрокаСиА.БалансоваяСтоимость		= 0;
			СтрокаСиА.БалансоваяСтоимостьДельта	= 0;
			СтрокаСиА.СуммаАмортизации			= 0;
		КонецЕсли;
		
	КонецЕсли;
	
	// таблица Местонахождение
	
	Если Не ОтражатьИсторию Тогда
		Местонахождение.Очистить();
	КонецЕсли;
	
	Если ИнвентарныйУчет = 0 Тогда
		
		Для Каждого Строка Из Местонахождение Цикл
			
			ОпределитьВременнуюСоставляющуюПериода(Строка);
			
			Строка.Сумма		= 0;
			Строка.Количество	= 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// таблица Кап. ремонт
	
	Для Каждого Строка Из КапитальныйРемонт Цикл
		ОпределитьВременнуюСоставляющуюПериода(Строка);
	КонецЦикла;
	
	// таблица Консервация
	
	Для Каждого Строка Из Консервация Цикл
		ОпределитьВременнуюСоставляющуюПериода(Строка);
	КонецЦикла;
	
	// Итоги документа
	
	СуммаБалансовая		= 0;
	СуммаАмортизации	= 0;
	СуммаОбесценения	= 0;
	Количество			= 0;
	СуммаЗабалансовая	= 0;
	СуммаВАренде		= 0;
	СуммаВПользовании	= 0;
	
	СуммаНУ							= 0;
	СуммаНеУчитываетсяНУ			= 0;
	СуммаЕНВД						= 0;
	СуммаАмортизацииНУ				= 0;
	СуммаАмортизацииНеУчитываетсяНУ	= 0;
	СуммаАмортизацииЕНВД			= 0;
	
	ОтражатьВНалоговомУчетеОСН = ОтражатьВНалоговомУчете
		И НалоговыйУчетКлиентСервер.ОтражатьВНалоговомУчете(Организация, КонецГода(Дата)+1, КФО);
	
	Для Каждого ТекущиеДанные Из ИнвентарныеОбъекты Цикл
		
		Если ТекущиеДанные.НаСчете21 Тогда
			СуммаЗабалансовая	= СуммаЗабалансовая + ТекущиеДанные.Стоимость;
		ИначеЕсли ТекущиеДанные.СостояниеОС <> Перечисления.СостоянияОС.СнятоСУчета Тогда
			СуммаБалансовая		= СуммаБалансовая + ТекущиеДанные.Стоимость;
			СуммаАмортизации	= СуммаАмортизации + ТекущиеДанные.СуммаАмортизации;
			СуммаОбесценения	= СуммаОбесценения + ТекущиеДанные.СуммаОбесценения;
		КонецЕсли;
		
		Если ОтражатьВНалоговомУчетеОСН Тогда
			
			СуммаНУ				= СуммаНУ				+ ТекущиеДанные.СуммаНУ;
			СуммаНеУчитываетсяНУ= СуммаНеУчитываетсяНУ	+ ТекущиеДанные.СуммаНеУчитываетсяНУ;
			СуммаЕНВД			= СуммаЕНВД				+ ТекущиеДанные.СуммаЕНВД;
			
			СуммаАмортизацииНУ				= СуммаАмортизацииНУ				+ ТекущиеДанные.СуммаАмортизацииНУ;
			СуммаАмортизацииНеУчитываетсяНУ	= СуммаАмортизацииНеУчитываетсяНУ	+ ТекущиеДанные.СуммаАмортизацииНеУчитываетсяНУ;
			СуммаАмортизацииЕНВД			= СуммаАмортизацииЕНВД				+ ТекущиеДанные.СуммаАмортизацииЕНВД;
			
		КонецЕсли;
		
		Если ТекущиеДанные.ВПользованииСостояниеОС = ПредопределенноеЗначение("Перечисление.ВидыСобытийОС.СдачаВАренду") Тогда
			СуммаВАренде		= СуммаВАренде		+ ?(УчетныеДанныеПодробно, ТекущиеДанные.ВПользованииСтоимость, ТекущиеДанные.Стоимость);
		ИначеЕсли ТекущиеДанные.ВПользованииСостояниеОС = ПредопределенноеЗначение("Перечисление.ВидыСобытийОС.ПередачаВБезвозмездноеПользование") Тогда
			СуммаВПользовании	= СуммаВПользовании	+ ?(УчетныеДанныеПодробно, ТекущиеДанные.ВПользованииСтоимость, ТекущиеДанные.Стоимость);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИнвентарныйНомерВТаблице(ИнвентарныйНомер, Таблица)
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаТаблицы.ИнвентарныйНомер = ИнвентарныйНомер;
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицыИнвНомеров(Таблица)
	
	Если ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
		ИнвНомера = Таблица.Скопировать(, "ИнвентарныйНомер");
	Иначе
		ИнвНомера = Таблица.Выгрузить(, "ИнвентарныйНомер");
	КонецЕсли;
	ИнвНомера.Свернуть("ИнвентарныйНомер");
	ИнвНомера = ИнвНомера.ВыгрузитьКолонку("ИнвентарныйНомер");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИнвентарныйНомер");
	Результат.Колонки.Добавить("Таблица");
	
	Для Каждого ИнвНомер Из ИнвНомера Цикл
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ИнвентарныйНомер = ИнвНомер;
		НоваяСтрока.Таблица = Таблица.НайтиСтроки(Новый Структура("ИнвентарныйНомер", ИнвНомер));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ОпределитьВременнуюСоставляющуюПериода(ТекущаяСтрока)
	
	ТекущаяСтрока["Период"] = НачалоДня(ТекущаяСтрока["Период"]) + ТекущаяСтрока.НомерСтроки;
	
КонецПроцедуры

Процедура ПроверитьСтоимостьОбъектовВТабЧастиИнвентарныеОбъекты(ДокументОбъект, Отказ = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТабЧастьИнвентарныеОбъекты", ДокументОбъект.ИнвентарныеОбъекты.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабЧасть.НомерСтроки,
	|	ТабЧасть.Количество КАК Количество,
	|	ТабЧасть.Стоимость КАК Стоимость
	|ПОМЕСТИТЬ ТабЧасть
	|ИЗ
	|	&ТабЧастьИнвентарныеОбъекты КАК ТабЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|			КОГДА ТабЧасть.Количество = 0
	|				ТОГДА ТабЧасть.Стоимость
	|			ИНАЧЕ ТабЧасть.Стоимость / ТабЧасть.Количество
	|		КОНЕЦ) КАК КоличествоРазличных
	|ИЗ
	|	ТабЧасть КАК ТабЧасть";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И (Выборка.КоличествоРазличных > 1) Тогда
		ТекстСообщения = НСтр("ru = 'В строках табличной части ""Инвентарные объекты"" указаны объекты ОС с различной стоимостью.
                               |При групповом учете в группу включаются объекты ОС с одинаковой стоимостью.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ИнвентарныеОбъекты");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
