//@strict-types

#Область ПрограммныйИнтерфейс

// Открыть форму выбора рабочего счета.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//    * Объект - ДанныеФормыСтруктураСКоллекцией
//    * ВсеДопустимыеКорреспонденции - см. ЦентрализованноеСнабжениеКлиентСервер.ПустаяДопустимаяКорреспонденция
//  Элемент - ПолеФормы
//  ДтКт - Строка
//  СтандартнаяОбработка - Булево
Процедура ОткрытьФормуВыбораРабочегоСчета(Форма, Элемент, ДтКт, СтандартнаяОбработка) Экспорт
	
	Объект = Форма.Объект;
	ТекущиеДанные = Форма.Элементы.ПередаваемыеПроводки.ТекущиеДанные; // ДанныеФормыЭлементКоллекции
	
	ДопустимыеКорреспонденции = Форма.ВсеДопустимыеКорреспонденции;
	Если ДопустимыеКорреспонденции = Неопределено Тогда
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	
	СчетаКорреспонденции = ДопустимыеКорреспонденции["Счета" + ДтКт]; // ФиксированныйМассив
	ОграниченияСчета = Новый Массив(СчетаКорреспонденции);
	НачальноеЗначениеВыбора = Новый Структура;
	НачальноеЗначениеВыбора.Вставить("Счет", ТекущиеДанные["Счет" + ДтКт]);
	НачальноеЗначениеВыбора.Вставить("КПС",  ТекущиеДанные["КПС" + ДтКт]);
	НачальноеЗначениеВыбора.Вставить("КФО",  ТекущиеДанные["КФО"]);
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
		СтандартнаяОбработка, 
		НачальноеЗначениеВыбора, 
		Объект.Организация,
		Объект.ИФО,
		ОграниченияСчета,
		ТекущиеДанные["КФО"],
		,
		Объект.Дата);

КонецПроцедуры

// Заполнить данные новой строки.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//   * Объект - ДанныеФормыСтруктура:
//    ** Ссылка - ДокументСсылка -
//    ** ВидИзвещения - ПеречислениеСсылка -
//   * ВсеДопустимыеКорреспонденции - см. ЦентрализованноеСнабжениеКлиентСервер.ПустаяДопустимаяКорреспонденция
//   * СвойстваИспользуемыхСчетов - ДанныеФормыКоллекция
//  Строка - ДанныеФормыЭлементКоллекции:
//   * СубконтоДт1 - Характеристика.ВидыСубконто
//   * СубконтоКт1 - Характеристика.ВидыСубконто
Процедура ЗаполнитьДанныеНовойСтроки(Форма, Строка) Экспорт

	Объект = Форма.Объект;
	
	ДопустимыеКорреспонденции = Форма.ВсеДопустимыеКорреспонденции;
	Если ДопустимыеКорреспонденции = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоВходящееИзвещение = ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ИзвещениеВходящее");
	СвойстваИспользуемыхСчетов = Форма.СвойстваИспользуемыхСчетов;
	// Счета при вводе новой строки не заполняются, если это операция с забалансовыми счетами.
	// Нужно заполнить только одну стророну проводки, но автоматически заполнятся обе. 
	ЗаполнятьСчета = Объект.ВидИзвещения = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийВходящееИзвещение.ОтПолучателя_ПолучениеСведенийОРазделенииЗемельныхУчастковОПУИ")
		Или Объект.ВидИзвещения = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийИсходящееИзвещение.ОтПолучателя_ОтражениеВУчетеРазделенияЗемельныхУчастковЭДО");
	Если ЗаполнятьСчета Тогда
		ЦентрализованноеСнабжениеКлиентСервер.ЗаполнитьСчетЕслиДопустимЕдинственныйСчет(Строка,
			ДопустимыеКорреспонденции, СвойстваИспользуемыхСчетов, "Дт");
		ЦентрализованноеСнабжениеКлиентСервер.ЗаполнитьСчетЕслиДопустимЕдинственныйСчет(Строка,
			ДопустимыеКорреспонденции, СвойстваИспользуемыхСчетов, "Кт");
	КонецЕсли;

	ПараметрыПодстановки = ЦентрализованноеСнабжениеКлиентСервер.УстановитьЗначенияСубконтоДтКт_Параметры();
	ПараметрыПодстановки.ДтКт = "Дт";
	ПараметрыПодстановки.Объект = Объект;
	ПараметрыПодстановки.ДопустимыеКорреспонденции = ДопустимыеКорреспонденции;
	ЦентрализованноеСнабжениеКлиентСервер.СкопироватьСвойстваСчетовИзФормы(Форма.СвойстваИспользуемыхСчетов, ПараметрыПодстановки);
	Если ЭтоВходящееИзвещение Тогда
		ЦентрализованноеСнабжениеКлиентСервер.ЗаполнитьПараметрыПодстановкиСубконтоВходящееИзвещение(ПараметрыПодстановки, Объект);
	Иначе
		ЦентрализованноеСнабжениеКлиентСервер.ЗаполнитьПараметрыПодстановкиСубконтоИсходящееИзвещение(ПараметрыПодстановки, Объект);
	КонецЕсли;
	ЦентрализованноеСнабжениеКлиентСервер.ПодставитьЗначенияСубконтоВСтрокуИсходящееИзвещение(Строка, ПараметрыПодстановки);

	ПараметрыПодстановки = ЦентрализованноеСнабжениеКлиентСервер.УстановитьЗначенияСубконтоДтКт_Параметры();
	ПараметрыПодстановки.ДтКт = "Кт";
	ПараметрыПодстановки.ДопустимыеКорреспонденции = ДопустимыеКорреспонденции;
	ЦентрализованноеСнабжениеКлиентСервер.СкопироватьСвойстваСчетовИзФормы(Форма.СвойстваИспользуемыхСчетов, ПараметрыПодстановки);
	Если ЭтоВходящееИзвещение Тогда
		ЦентрализованноеСнабжениеКлиентСервер.ЗаполнитьПараметрыПодстановкиСубконтоВходящееИзвещение(ПараметрыПодстановки, Объект);
	Иначе
		ЦентрализованноеСнабжениеКлиентСервер.ЗаполнитьПараметрыПодстановкиСубконтоИсходящееИзвещение(ПараметрыПодстановки, Объект);
	КонецЕсли;
	ЦентрализованноеСнабжениеКлиентСервер.ПодставитьЗначенияСубконтоВСтрокуИсходящееИзвещение(Строка, ПараметрыПодстановки);
	
	Если ЗначениеЗаполнено(Строка.СубконтоДт1) Тогда
		ЦентрализованноеСнабжениеКлиентСервер.УстановитьДетальныйКЭКВСтрокеДокумента(Объект, Строка, "Дт");
	КонецЕсли;
	Если ЗначениеЗаполнено(Строка.СубконтоКт1) Тогда
		ЦентрализованноеСнабжениеКлиентСервер.УстановитьДетальныйКЭКВСтрокеДокумента(Объект, Строка, "Кт");
	КонецЕсли;
	
КонецПроцедуры

// см. ЦентрализованноеСнабжение.ДокументооборотСоСтороныПолучателя
Функция ДокументооборотСоСтороныПолучателя(ВидИзвещения) Экспорт
	Возврат ЦентрализованноеСнабжениеВызовСервера.ДокументооборотСоСтороныПолучателя(ВидИзвещения);
КонецФункции

// Установить текущую строку списка.
// 
// Параметры:
//  Форма - см. Перечисление.ВидыОперацийВходящееИзвещение.Форма.ФормаВыбора
//        - см. Перечисление.ВидыОперацийИсходящееИзвещение.Форма.ФормаВыбора2
//  ТекущееЗначение - ПеречислениеСсылка.ВидыОперацийВходящееИзвещение -
//                  - ПеречислениеСсылка.ВидыОперацийИсходящееИзвещение -
//                  - Строка -
Процедура УстановитьТекущуюСтрокуСписка(Форма, ТекущееЗначение) Экспорт
	Если Не ЗначениеЗаполнено(ТекущееЗначение) Тогда
		Возврат;
	КонецЕсли;
	ТипСтрока = ТипЗнч(ТекущееЗначение) = Тип("Строка");
	Для Каждого Строка Из Форма.Список Цикл
		Если ТипСтрока И Строка.Представление = ТекущееЗначение
			Или Строка.Ссылка = ТекущееЗначение Тогда
			
			Форма.Элементы.Список.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// При изменении отбора по видам.
// 
// Параметры:
//  Форма - см. Перечисление.ВидыОперацийВходящееИзвещение.Форма.ФормаВыбора
//        - см. Перечисление.ВидыОперацийИсходящееИзвещение.Форма.ФормаВыбора2
//  ПараметрыЗаполнения - см. ЦентрализованноеСнабжениеКлиентСервер.ПараметрыОбновленияСоставаВидимойТаблицыПеречисления
Процедура ПриИзмененииОтбораПоВидам(Форма, ПараметрыЗаполнения) Экспорт
	ТекущиеДанные = Форма.Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ТекущееЗначение = Неопределено;
	Иначе
		ТекущееЗначение = ?(ЗначениеЗаполнено(ТекущиеДанные.Ссылка), ТекущиеДанные.Ссылка, ТекущиеДанные.Представление);
	КонецЕсли;
	ЦентрализованноеСнабжениеКлиентСервер.ОбновитьСоставВидимойТаблицыПеречисления(Форма, ПараметрыЗаполнения);
	УстановитьТекущуюСтрокуСписка(Форма, ТекущееЗначение);	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
