/////////////////////////////////////////////////////////////////////////////////
// ОБЩЕГО НАЗНАЧЕНИЯ БГУ, КЛИЕНТСЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ                  //
// Модуль содержит клиентсерверные процедуры и функции общего назначения,      //
// работа которых не зависит от конфигурации                                   //
/////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает значение ключа из свойства "Локальные" кэша параметров формы.
// Инициализация кэша см. ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы()
// 
// Если Кэша параметров нет, или в нем нет ключа "Локальные", или в ключе "Локальные" нет нужного ключа, то
// возвращается значение параметра ЗначениеПоУмолчанию
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения -
// 	Ключ - Строка - 
// 	ЗначениеПоУмолчанию - Произвольный - 
// Возвращаемое значение:
// 	Произвольный - значение нужного ключа кэша или значение по умолчанию
Функция СвойствоЛокальногоКэшаФормы(Форма, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "КэшПараметров") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	ЛокальныеСвойства = Неопределено;
	Если НЕ Форма.КэшПараметров.Свойство("Локальные", ЛокальныеСвойства)
		ИЛИ ТипЗнч(ЛокальныеСвойства) <> Тип("Структура") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Значение = Неопределено;
	Если ЛокальныеСвойства.Свойство(Ключ, Значение) Тогда
		Возврат Значение;
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецФункции

// Запрещено добавление строк в документы НФА.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
// 
// Возвращаемое значение:
//  Булево - Запрещено добавление строк в документы НФА
Функция ЗапрещеноДобавлениеСтрокВДокументыНФА(Форма) Экспорт
	Возврат СвойствоЛокальногоКэшаФормы(Форма, "ЗапрещеноРедактироватьСтроки", Ложь);
КонецФункции

// Установить признак запрещено добавление строк в документы НФА.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ЗначениеПризнака - Булево
Процедура УстановитьПризнакЗапрещеноДобавлениеСтрокВДокументыНФА(Форма, ЗначениеПризнака) Экспорт
	Форма.КэшПараметров.Локальные.Вставить("ЗапрещеноРедактироватьСтроки", ЗначениеПризнака);
КонецПроцедуры

// Изменить доступность редактирования строк.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ИзменитьДоступностьРедактированияСтрок(Форма) Экспорт
	
	ТолькоПросмотр = ЗапрещеноДобавлениеСтрокВДокументыНФА(Форма);
	
	НастройкаДокумента = СвойствоЛокальногоКэшаФормы(Форма, "ЗапрещеноРедактироватьСтрокиНастройка"); // см. ОбщегоНазначенияБГУ.ПустаяНастройкаНедоступныхЭлементовФормыВДокументахНФА
	
	Если ТипЗнч(НастройкаДокумента) = Тип("Структура") И НастройкаДокумента.Свойство("Видимость") Тогда
		УстановитьСвойствоЭлементовФормы(Форма.Элементы, НастройкаДокумента.Видимость, "Видимость", Не ТолькоПросмотр);
	КонецЕсли;
	Если ТипЗнч(НастройкаДокумента) = Тип("Структура") И НастройкаДокумента.Свойство("ТолькоПросмотр") Тогда
		УстановитьСвойствоЭлементовФормы(Форма.Элементы, НастройкаДокумента.ТолькоПросмотр, "ТолькоПросмотр", ТолькоПросмотр);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру для передачи параметров в процедуру УстановитьЗаголовкиСубконто
//
Функция СтруктураИменЭлементовСубконтоЗатрат(ИспользоватьУчетПоПодразделениям = Неопределено,
	ИспользоватьСчетФормы = Ложь, ДобавлятьСубконтоФормы = Истина) Экспорт
	
	Результат = Новый Структура;
	
	Если ИспользоватьСчетФормы Тогда
		Результат.Вставить("СчетФормы",		"");
	Иначе
		Результат.Вставить("СчетОбъекта",	"");
	КонецЕсли;
	Если ДобавлятьСубконтоФормы Тогда
		Результат.Вставить("Субконто1",		"");
		Результат.Вставить("Субконто2",		"");
		Результат.Вставить("Субконто3",		"");
		Результат.Вставить("Подразделение",	"");
	КонецЕсли;
	Результат.Вставить("ОчищатьОтстуствующие",	Ложь);
	Если ИспользоватьУчетПоПодразделениям = Неопределено Тогда
		Результат.Вставить("ИспользоватьУчетПоПодразделениям",
			ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоПодразделениям"));
	Иначе
		Результат.Вставить("ИспользоватьУчетПоПодразделениям", ИспользоватьУчетПоПодразделениям);
	КонецЕсли;
	// параметры для очистки значений
	Результат.Вставить("СубконтоОбъекта1", ""); 
	Результат.Вставить("СубконтоОбъекта2", "");
	Результат.Вставить("СубконтоОбъекта3", "");
	Результат.Вставить("СубконтоФормы1", ""); 
	Результат.Вставить("СубконтоФормы2", "");
	Результат.Вставить("СубконтоФормы3", "");
	
	Возврат Результат;

КонецФункции

// Устанавливает заголовки и доступность элементов для ввода субконто. 
// Параметры:
//	Форма - управляемаяформа
//	Объект - объект формы
//	СтруктураИменЭлементов - структура.
//		Ключи структуры:
//		СчетОбъекта - Строка - Имя реквизита объекта для получения счета
//		СчетФормы	- Строка - Имя реквизита формы для получения счета
//		Субконто1	- Строка - Имя элемента формы, содержащего субконто 1 (необязательный)
//		Субконто2	- Строка - Имя элемента формы, содержащего субконто 2 (необязательный)
//		Субконто3	- Строка - Имя элемента формы, содержащего субконто 3 (необязательный)
//		Подразделение- Строка - Имя элемента формы, содержащего подразделение затрат (необязательный)
//		КОСГУДт		- Строка - Имя реквизита объекта, для постановки КОСГУДт счета (необязательный)
//		КОСГУКт		- Строка - Имя реквизита объекта, для постановки КОСГУКт счета (необязательный)
// 		ИспользоватьУчетПоПодразделениям - Булево - значение ФО. Если не передано, то будет получено текущее значение ФО.													
//	Примечание:
//		Необходимо чтобы в структуре содеражался либо ключ СчетОбъекта, либо СчетФормы.
//		Если заданы оба, то используется СчетОбъекта, а СчетФормы игнорируется.
//		Если не задан ни один, то выполнение процедуры прерывается.
//
//		Для Веб-клиента, для гарантированной очистки пустых субконто можно задать ключ ОчищатьОтстуствующие.
//		При этом имена реквизитов объекта, содержащие значения субконто задаются в ключах
//		СубконтоОбъекта1, СубконтоОбъекта2, СубконтоОбъекта3 для объекта или
//		СубконтоФормы1, СубконтоФормы2, СубконтоФормы3 для формы.
//
//	ТекстОтсутствующегоСубконто - Строка - Текст заголовка пустого субконто.
//
Процедура УстановитьЗаголовкиСубконто(Форма, Объект, СтруктураИменЭлементов,
	ТекстОтсутствующегоСубконто = "<не определено>") Экспорт
	
	Если СтруктураИменЭлементов.Свойство("СчетОбъекта") Тогда 
		Счет = Объект[СтруктураИменЭлементов.СчетОбъекта];
	ИначеЕсли СтруктураИменЭлементов.Свойство("СчетФормы") Тогда 
		Счет = Форма[СтруктураИменЭлементов.СчетФормы];
	Иначе
		Возврат;
	КонецЕсли;
	
	ИспользоватьУчетПоПодразделениям = Неопределено;
	Если НЕ СтруктураИменЭлементов.Свойство("ИспользоватьУчетПоПодразделениям", ИспользоватьУчетПоПодразделениям) Тогда
		ИспользоватьУчетПоПодразделениям = ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции(
			"ИспользоватьУчетПоПодразделениям");
	КонецЕсли;
	Если ИспользоватьУчетПоПодразделениям <> Истина Тогда
		ИспользоватьУчетПоПодразделениям = Ложь;
	КонецЕсли;
	ИмяЭлементаПодразделение = "";
	ДоступностьЭлементаПодразделение = Ложь;
		
	Если ЗначениеЗаполнено(Счет) Тогда
		СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
		Если ИспользоватьУчетПоПодразделениям Тогда
			ДоступностьЭлементаПодразделение = СвойстваСчета.УчетПоПодразделениям;
		КонецЕсли;
		КоличествоСубконто = СвойстваСчета.КоличествоСубконто;
		Для Счетчик = 1 По КоличествоСубконто Цикл
			ИмяРеквизита = "";
			СтруктураИменЭлементов.Свойство("Субконто"+Счетчик, ИмяРеквизита);
			Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
				ИмяЭлементаФормы = Неопределено;
				Если НЕ СтруктураИменЭлементов.Свойство("ЭлементСубконто" + Счетчик, ИмяЭлементаФормы) Тогда
					ИмяЭлементаФормы = ИмяРеквизита;
				КонецЕсли;
				ТекЭлемент = Форма.Элементы.Найти(ИмяЭлементаФормы);
				Если ТекЭлемент = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ТекЭлемент.Заголовок = СвойстваСчета["ВидСубконто"+Счетчик+"Наименование"];
				ТекЭлемент.Доступность = Истина;
				Если Не СвойстваСчета["ВидСубконто"+Счетчик+"Обязательный"] Тогда
					ТекЭлемент.АвтоОтметкаНезаполненного	= Ложь;
					ТекЭлемент.ОтметкаНезаполненного 		= Ложь;
				Иначе
					ТекЭлемент.АвтоОтметкаНезаполненного 	= Истина;
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		
		ИмяРеквизита = "";
		СтруктураИменЭлементов.Свойство("КОСГУДт", ИмяРеквизита);
		Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
			Объект[ИмяРеквизита] = СвойстваСчета.КОСГУДт;
		КонецЕсли;
		ИмяРеквизита = "";
		СтруктураИменЭлементов.Свойство("КОСГУКт", ИмяРеквизита);
		Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
			Объект[ИмяРеквизита] = СвойстваСчета.КОСГУКт;
		КонецЕсли;
	Иначе
		КоличествоСубконто = 0;
	КонецЕсли;
	Если ИспользоватьУчетПоПодразделениям
		И СтруктураИменЭлементов.Свойство("Подразделение", ИмяЭлементаПодразделение) Тогда
		
		Форма.Элементы[ИмяЭлементаПодразделение].Доступность = ДоступностьЭлементаПодразделение;
	КонецЕсли;
		
	Для Счетчик = КоличествоСубконто + 1 По 3 Цикл
		Если СтруктураИменЭлементов.Свойство("Субконто"+Счетчик, ИмяРеквизита) Тогда
			ИмяЭлементаФормы = Неопределено;
			Если НЕ СтруктураИменЭлементов.Свойство("ЭлементСубконто" + Счетчик, ИмяЭлементаФормы) Тогда
				ИмяЭлементаФормы = ИмяРеквизита;
			КонецЕсли;
			ТекЭлемент = Форма.Элементы.Найти(ИмяЭлементаФормы);
			Если ТекЭлемент = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ТекЭлемент.Заголовок = ТекстОтсутствующегоСубконто;
			ТекЭлемент.Доступность               = Ложь;
			ТекЭлемент.АвтоОтметкаНезаполненного = Ложь;
			ТекЭлемент.ОтметкаНезаполненного     = Ложь;
			Если СтруктураИменЭлементов.Свойство("ОчищатьОтстуствующие") Тогда
				ИмяРеквизита = "";
				Если СтруктураИменЭлементов.Свойство("СубконтоОбъекта"+Счетчик, ИмяРеквизита) Тогда
					Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
						Объект[ИмяРеквизита] = Неопределено;
					КонецЕсли;
				ИначеЕсли СтруктураИменЭлементов.Свойство("СубконтоФормы"+Счетчик, ИмяРеквизита) Тогда
					Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
						Форма[ИмяРеквизита] = Неопределено;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает полное имя переданного типа. На клиенте данные берутся из 
// параметров работы клиента "ПараметрыБГУ_ИменаТипов".
// Параметры:
//	Тип - Тип - тип, полное имя которого нужно определить.
//
Функция ПолноеИмяТипа(Тип) Экспорт
	
	Перем ПолноеИмяТипа;
	
	#Если Клиент Тогда
	ИменаТиповБГУ = Неопределено;
	СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().Свойство("ПараметрыБГУ_ИменаТипов", ИменаТиповБГУ);
	Если ИменаТиповБГУ <> Неопределено Тогда
		ПолноеИмяТипа = ИменаТиповБГУ.Получить(Тип);
	КонецЕсли;
	#Иначе
	Если ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
		ПолноеИмяТипа = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип).ПолноеИмя;
	КонецЕсли;
	#КонецЕсли
	
	Возврат ПолноеИмяТипа;
	
КонецФункции // ПолноеИмяТипа()

// Возвращает имя ключевой операции для замера времени создания, открытия или проведения документа.
// Параметры:
//	Параметр - Тип, ЛюбаяСсылка - тип или ссылка, для которой нужно получить имя ключевой операции.
//	ТипОперации - Строка - "СозданиеФормы", "ОткрытиеФормы" или "Проведение".
Функция ИмяКлючевойОперации(Параметр, ТипОперации) Экспорт

	Если ТипЗнч(Параметр) = Тип("Тип") Тогда
		ПолноеИмяТипа = ПолноеИмяТипа(Параметр);
	Иначе
		ПолноеИмяТипа = ПолноеИмяТипа(ТипЗнч(Параметр));
	КонецЕсли;
	
	Если ПолноеИмяТипа = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЧастиТипа = СтрРазделить(ПолноеИмяТипа, ".");
	
	Если ЧастиТипа.Количество() <> 2 Тогда
		Возврат "";
	КонецЕсли;
		
	Возврат ТипОперации + ЧастиТипа[1];

КонецФункции // ИмяКлючевойОперации()

// Процедура активизирует элемент формы.
// Если это - табличная часть, то тогда анализируется,
// может табличная часть на закладке и если так,
// то закладка становится текущей, но табличная часть не активизируется
//
// Параметры:
//  Форма            - Управляемая форма
//  ИмяЭлементаФормы - Строка - имя элемента, который необходимо активизировать
//
Процедура АктивизироватьЭлементФормы(Форма, ИмяЭлементаФормы) Экспорт

	Если НЕ ПустаяСтрока(ИмяЭлементаФормы) Тогда
		НайденныйЭлементФормы = Форма.Элементы.Найти(ИмяЭлементаФормы);
		Если НайденныйЭлементФормы <> Неопределено Тогда
			Если ТипЗнч(НайденныйЭлементФормы) = Тип("ТаблицаФормы") Тогда
				// Для таблицы определить - если она находится на закладке, то не активизировать элемент,
				// а сделать активной страницу, на которой находится эта табличная часть
				Страница = НайденныйЭлементФормы.Родитель;
				Пока Страница <> Неопределено И ТипЗнч(Страница) = Тип("ГруппаФормы") И Страница.Вид = ВидГруппыФормы.ОбычнаяГруппа Цикл
					// Таблица может быть внутри группы, а группа на странице
					Страница = Страница.Родитель;
				КонецЦикла;
				Если (Страница <> Неопределено) И ТипЗнч(Страница) = Тип("ГруппаФормы") И (Страница.Вид = ВидГруппыФормы.Страница) Тогда
					// Определим владельца этой страницы и активизируем эту страницу
					ПанельСтраниц = Страница.Родитель;
					Если (ПанельСтраниц <> Неопределено) И (ПанельСтраниц.Вид = ВидГруппыФормы.Страницы) Тогда
						ПанельСтраниц.ТекущаяСтраница = Страница;
					Иначе
						Форма.ТекущийЭлемент = НайденныйЭлементФормы;
					КонецЕсли;
				Иначе
					Форма.ТекущийЭлемент = НайденныйЭлементФормы;
				КонецЕсли;
			Иначе
				Форма.ТекущийЭлемент = НайденныйЭлементФормы;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Устанавливает значение свойства элементов формы, если находит элемент на форме
//
// Параметры
//  ЭлементыФормы       - ВсеЭлементыФормы - элементы формы, среди которых содержится искомый элемент.
//  МассивИменЭлементов - Массив - массив имен искомых элементов.
//  ИмяСвойства         - Строка - имя свойства, для которого будет устанавливаться значение.
//  Значение            - Произвольный - значение, которое будет установлено
//
Процедура УстановитьСвойствоЭлементовФормы(ЭлементыФормы, МассивИменЭлементов, ИмяСвойства, Значение) Экспорт
	
	Для Каждого ИмяЭлемента Из МассивИменЭлементов Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства, Значение);
	КонецЦикла
	
КонецПроцедуры // УстановитьСвойствоЭлементовФормы()

// Функция возвращает структуру, содержащую значения отбора компоновки данных.
// В структуру добавляются только элементы отбора с видом сравнения РАВНО.
// При добавлении учитывается иерархическая структура отбора, при этом если в отборе одно поле
// встречается несколько раз, то в структуру попадает первое встретившееся значение
//
Функция СтруктураИзОтбора(Отбор, Структура = Неопределено) Экспорт
	Если Структура = Неопределено Тогда
		Структура = Новый Структура;
	КонецЕсли;
	Для Каждого ЭлементОтбора Из Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				И ЭлементОтбора.Использование Тогда
				Если НЕ Структура.Свойство(Строка(ЭлементОтбора.ЛевоеЗначение)) Тогда
					Структура.Вставить(Строка(ЭлементОтбора.ЛевоеЗначение), ЭлементОтбора.ПравоеЗначение);
				КонецЕсли;
			КонецЕсли;
		Иначе
			СтруктураИзОтбора(ЭлементОтбора, Структура);
		КонецЕсли;
	КонецЦикла;
	Возврат Структура;
КонецФункции

Функция СтруктураИзФиксированнойСтруктуры(Источник) Экспорт
	
	Результат = Новый Структура;
	
	Для Каждого Элемент Из Источник Цикл
		Результат.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Устарела. Следует использовать ОбщегоНазначенияБГУКлиентСервер.ИзменитьОтборСпискаПоОрганизации().
//
Процедура УстановитьОтборОсновнойОрганизации(Список, ОтборОрганизация, ИмяПоля = "Организация", Организация = Неопределено) Экспорт
	
	ОтборОрганизация = Организация;
	
	Представление = НСтр("ru = 'Отбор по основной организации (%1)'");
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, Строка(ОтборОрганизация));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, ИмяПоля, ОтборОрганизация,,Представление, ЗначениеЗаполнено(ОтборОрганизация));
КонецПроцедуры

// Изменяет значение отбора по организации в динамическом списке.
// Поиск производится по представлению в элементах отборов верхнего уровня.
//
// Параметры
//  Список         - ДинамическийСписок - список, в котором необходимо изменить значение отбора.
//  ИмяРеквизита   - Строка - имя поля-организации в динамическом списке.
//  ЗначениеОтбора - СправочникСсылка.Организации, СписокЗначений, Массив - значение отбора.
//
// Возвращаемое значение:
//   СправочникСсылка.Организации - Если отбор установлен, то вернет значение отбора.
//
Функция ИзменитьОтборСпискаПоОрганизации(Список, ИмяРеквизита = "Организация", Знач ЗначениеОтбора = Неопределено) Экспорт

	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.КомпоновщикНастроек.Настройки.Отбор, ИмяРеквизита);
	
	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		Если ТипЗнч(ЗначениеОтбора) <> Тип("СправочникСсылка.Организации")
			И ТипЗнч(ЗначениеОтбора) <> Тип("Массив")
			И ТипЗнч(ЗначениеОтбора) <> Тип("СписокЗначений") Тогда
			ЗначениеОтбора = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеОтбора) = Тип("Массив")
		ИЛИ ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") Тогда
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
	Иначе
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ИспользованиеОтбора = ЗначениеЗаполнено(ЗначениеОтбора);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, ИмяРеквизита, ЗначениеОтбора, ВидСравненияОтбора, , ИспользованиеОтбора, 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	Возврат ЗначениеОтбора;
	
КонецФункции

// Проверяет заполнение реквизитов объекта.
// Реквизиты передаются в структуре, где "ключ" - имя реквизита, "значение" - представление реквизита.
// В случае вызова не из формы проверяет заполнение реквизитов в конструкции "Попытка - Исключение".
// При необходимости может сразу выводить стандартное сообщение об ошибке заполнения реквизита.
// Независимо от вывода сообщения об ошибке оно добавляется в структуру "Ошибки", которая может
// использоваться для вывода сообщений процедурой ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки).
//
// Параметры:
//  СтруктураРеквизитов	 - Структура - содержит имена и представления проверяемых реквизитов,
//  Объект				 - ДанныеФормыСтруктура, Произвольный - объект проверки,
//  СообщатьОбОшибках	 - Булево - выводить сообщения о не заполненных реквизитах,
//  Ошибки				 - Структура - ошибки заполнения. Ошибки выводяться процедурой ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки).
//
// Возвращаемое значение:
//   Булево - Ложь, если все реквизиты заполнены, Истина, если есть не заполенный реквизит.
//
Функция ПроверитьЗаполнениеРеквизитов(СтруктураРеквизитов, Объект, СообщатьОбОшибках = Ложь, Ошибки = Неопределено) Экспорт
	Перем ДанныеРеквизита;
	
	Отказ = Ложь;
	
	ТипДанныхСтруктура = ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура");
	
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		
		Если ТипДанныхСтруктура Тогда
			ОшибкаЗаполнения = Объект.Свойство(КлючИЗначение.Ключ, ДанныеРеквизита) И НЕ ЗначениеЗаполнено(ДанныеРеквизита);
		Иначе // нужно проверять в "попытке"
			Попытка
				ОшибкаЗаполнения = НЕ ЗначениеЗаполнено(Объект[КлючИЗначение.Ключ]);
			Исключение
				ОшибкаЗаполнения = Ложь;
			КонецПопытки;
		КонецЕсли;
		
		Отказ = Отказ ИЛИ ОшибкаЗаполнения;
		Если ОшибкаЗаполнения Тогда
			
			ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение), КлючИЗначение.Значение, КлючИЗначение.Ключ);
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", ИмяПоля);
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект."+КлючИЗначение.Ключ, ТекстОшибки, КлючИЗначение.Ключ);
			
			Если СообщатьОбОшибках Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект."+КлючИЗначение.Ключ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

// Проверяет заполнение реквизитов табличной части объекта.
// Реквизиты передаются в структуре, где "ключ" - имя реквизита, "значение" - представление реквизита.
// При необходимости может сразу выводить стандартное сообщение об ошибке заполнения реквизита.
// Независимо от вывода сообщения об ошибке оно добавляется в структуру "Ошибки", которая может
// использоваться для вывода сообщений процедурой ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки).
//
// Параметры:
//  СтруктураРеквизитов	 - Структура - содержит имена и представления проверяемых реквизитов,
//  ОписаниеТабЧасти	 - Структура - содержит "Имя" и "Синоним" табличной части,
//  ОбъектПроверки		 - ДанныеФормыКоллекция, ДанныеФормыЭлементКоллекции - табличная часть или отдельная строка табличной части,
//  СообщатьОбОшибках	 - Булево - выводить сообщения о не заполненных реквизитах,
//  Ошибки				 - Структура - ошибки заполнения. Ошибки выводяться процедурой ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки).
//
// Возвращаемое значение:
//   Булево - Ложь, если все реквизиты заполнены, Истина, если есть не заполенный реквизит.
//
Функция ПроверитьЗаполнениеРеквизитовТабличнойЧасти(СтруктураРеквизитов, ОписаниеТабЧасти, ОбъектПроверки, СообщатьОбОшибках = Ложь, Ошибки = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	ИмяСписка     = ОписаниеТабЧасти.Имя;
	СинонимСписка = ?(ОписаниеТабЧасти.Свойство("Синоним"), ОписаниеТабЧасти.Синоним, ОписаниеТабЧасти.Имя);
	
	Если ТипЗнч(ОбъектПроверки) = Тип("ДанныеФормыКоллекция") Тогда // проверить для всех строк табличной части
		
		Для Каждого СтрокаТабЧасти ИЗ ОбъектПроверки Цикл
			Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
				
				Если НЕ ЗначениеЗаполнено(СтрокаТабЧасти[КлючИЗначение.Ключ]) Тогда
					Отказ = Истина;
					
					ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение), КлючИЗначение.Значение, КлючИЗначение.Ключ);
					ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
						ИмяПоля, СтрокаТабЧасти.НомерСтроки, СинонимСписка);
					ПолеФормы = "Объект."+ИмяСписка+"["+Строка(СтрокаТабЧасти.НомерСтроки-1)+"]."+КлючИЗначение.Ключ;
					
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
						ПолеФормы, ТекстОшибки, КлючИЗначение.Ключ);
					
					Если СообщатьОбОшибках Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, ПолеФормы);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
	Иначе // проверить только в указанной строке табличной части
		
		Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
			
			Если НЕ ЗначениеЗаполнено(ОбъектПроверки[КлючИЗначение.Ключ]) Тогда
				Отказ = Истина;
				
				ИмяПоля = ?(ЗначениеЗаполнено(КлючИЗначение.Значение), КлючИЗначение.Значение, КлючИЗначение.Ключ);
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					ИмяПоля, ОбъектПроверки.НомерСтроки, СинонимСписка);
				ПолеФормы = "Объект."+ИмяСписка+"["+Строка(ОбъектПроверки.НомерСтроки-1)+"]."+КлючИЗначение.Ключ;
				
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
					ПолеФормы, ТекстОшибки, КлючИЗначение.Ключ);
				
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, ПолеФормы);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

// Предназначена для получения пустого значения заданного типа:
//	примитивного, или ссылочного. Используется
//
// Параметры:
//	ЗаданныйТип   - тип, пустое значение которого нужно получить
//
Функция ПустоеЗначениеТипа(ЗаданныйТип) Экспорт

	Если ЗаданныйТип = Тип("Число") Тогда
		Возврат 0;

	ИначеЕсли ЗаданныйТип = Тип("Строка") Тогда
		Возврат "";

	ИначеЕсли ЗаданныйТип = Тип("Дата") Тогда
		Возврат '00010101000000';

	ИначеЕсли ЗаданныйТип = Тип("Булево") Тогда
		Возврат Ложь;

	ИначеЕсли ЗаданныйТип = Тип("Null") ИЛИ ЗаданныйТип = Тип("Неопределено") Тогда
		Возврат Неопределено;
		
	Иначе
		Возврат Новый (ЗаданныйТип);

	КонецЕсли;

КонецФункции // ПустоеЗначениеТипа();

Функция ВывестиНомераСтрокВТекстСообщения(ИсходнаяСтрока, ВыводимыйМассив, МаксДлинаИтоговойСтроки, СимволПодстановки) Экспорт
	
	СимволРазделитель = ", ";
	СимволИТакДалее = СимволРазделитель + "..." + СимволРазделитель;
	
	ДлинаНач = СтрДлина(ИсходнаяСтрока) - СтрДлина(СимволПодстановки);
	МаксДлинаМассива = МаксДлинаИтоговойСтроки - ДлинаНач;
	
	СтрокаИзМассива = "";
	ЭтоПервыйЭлемент = Истина;
	Колво = ВыводимыйМассив.Количество();
	Для инд = 0 По Колво-1 Цикл
		Элем = ВыводимыйМассив[инд];
		ЭтоПоследнийЭлемент = (инд = Колво-1);
		
		// Хотим добавить еще такую строку:
		Кандидат = ?(ЭтоПервыйЭлемент, "", СимволРазделитель) + Элем;
		
		Если СтрДлина(СтрокаИзМассива + Кандидат) >= МаксДлинаМассива
			И НЕ ЭтоПоследнийЭлемент Тогда
			// Прерываем вывод элементов массива.
			СтрокаИзМассива = ?(ЭтоПервыйЭлемент, Кандидат,	СтрокаИзМассива)
				+ СимволИТакДалее + ВыводимыйМассив[Колво-1];
			Прервать;
		Иначе
			// Продолжаем вывод элементов массива.
			СтрокаИзМассива = СтрокаИзМассива + Кандидат;
			
		КонецЕсли;
		
		ЭтоПервыйЭлемент = Ложь;
	КонецЦикла;	
	
	Результат = СтрЗаменить(ИсходнаяСтрока, СимволПодстановки, СтрокаИзМассива);
	Возврат Результат;
	
КонецФункции

//  Возвращает признак того, является ли текст XML.
//
//  Параметры:
//      Текст - Строка - проверяемый текст.
//
// Возвращаемое значение:
//      Булево - результат проверки.
//
Функция ЭтоСтрокаXML(Текст) Экспорт
	
	Возврат ТипЗнч(Текст) = Тип("Строка") И Лев(СокрЛ(Текст),1) = "<";
	
КонецФункции

// Соединяет массив подстрок в одну итоговую строку с учетом указанного ограничения максимальной длины строки.
//
//	Например, имеем массив подстрок {"1", "2", "3", "4", "5"}
//
//		Максимальная длина	  Результат
//		итоговой строки
//			>=13			"1, 2, 3, 4, 5"
//			12				"1, 2, ..., 5"
//			9				"1, ..., 5"
//			6				"1, ..."
//			<=3				"Х"
//
// Параметры
//	МассивПодстрок					- Массив строк	- соединяемые подстроки
//
//	МаксимальнаяДлинаИтоговойСтроки	- Число	- максимальная длина формируемой строки
//
// Возвращаемое значение
//	Строка
Функция СтрСоединитьСОграничениемДлины(МассивПодстрок, МаксимальнаяДлинаИтоговойСтроки) Экспорт
	
	Перем	ИтоговаяСтрока,
			ПомещаютсяВсеПодстрокиПолностью,
			ПомещаютсяВсеПодстрокиДиапазоном,
			ПомещаетсяПерваяПодстрокаИДиапазонСправа,
			ПомещаетсяПерваяПодстрокаИДиапазон;
	
	// Используемые символы при составлении итоговой строки
	ОбозначениеРазделителя			= ", ";
	ОбозначениеДиапазона			= "...";
	ОбозначениеОбрезкиТекста		= "…";
	ОбозначениеНичегоНеПомещается	= "Х";
	ОбозначениеДиапазонаСправа		= ОбозначениеРазделителя + ОбозначениеДиапазона;
	ОбозначениеДиапазонаМежду		= ОбозначениеРазделителя + ОбозначениеДиапазона + ОбозначениеРазделителя;
	
	ДлинаОбозначенияРазделителя		= СтрДлина(ОбозначениеРазделителя);
	ДлинаОбозначенияДиапазона		= СтрДлина(ОбозначениеДиапазона);
	ДлинаОбозначенияДиапазонаМежду	= СтрДлина(ОбозначениеДиапазонаМежду);
	ДлинаОбозначенияДиапазонаСправа	= СтрДлина(ОбозначениеДиапазонаСправа);
	ДлинаОбозначенияОбрезкиТекста	= СтрДлина(ОбозначениеОбрезкиТекста);
	
	КоличествоПодстрок = МассивПодстрок.Количество();
	
	Если КоличествоПодстрок = 0 Тогда
		// Выходим
		Возврат "";
	КонецЕсли;
	
	ИтоговаяДлина = 0;
	ЭтоПерваяПодстрока = Истина;
	Для Каждого Подстрока Из МассивПодстрок Цикл
		ИтоговаяДлина = ИтоговаяДлина + СтрДлина(Подстрока) + ?(ЭтоПерваяПодстрока, 0, ДлинаОбозначенияРазделителя);
		
		Если ЭтоПерваяПодстрока Тогда
			ЭтоПерваяПодстрока = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ПомещаютсяВсеПодстрокиПолностью = (ИтоговаяДлина <= МаксимальнаяДлинаИтоговойСтроки);
	
	Если ПомещаютсяВсеПодстрокиПолностью Тогда
		ИтоговаяСтрока = СтрСоединить(МассивПодстрок, ОбозначениеРазделителя);
		
		// Выходим
		Возврат ИтоговаяСтрока;
	КонецЕсли;
	
	ПомещаютсяВсеПодстрокиДиапазоном			= Ложь;
	ПомещаетсяПерваяПодстрокаИДиапазонСправа	= Ложь;
	ПомещаетсяПерваяПодстрокаИДиапазон			= Ложь;
	
	ПерваяПодстрока			= МассивПодстрок[0];
	ПоследняяПодстрока		= МассивПодстрок[КоличествоПодстрок - 1];
	ДлинаПервойПодстроки	= СтрДлина(ПерваяПодстрока);
	ДлинаПоследнейПодстроки	= СтрДлина(ПоследняяПодстрока);
	
	Если КоличествоПодстрок > 1 Тогда
		Если КоличествоПодстрок > 2 Тогда
			ПомещаютсяВсеПодстрокиДиапазоном = ((ДлинаПервойПодстроки + ДлинаОбозначенияДиапазонаМежду + ДлинаПоследнейПодстроки) <= МаксимальнаяДлинаИтоговойСтроки);
		КонецЕсли;
		
		ПомещаетсяПерваяПодстрокаИДиапазонСправа = ((ДлинаПервойПодстроки + ДлинаОбозначенияДиапазонаСправа) <= МаксимальнаяДлинаИтоговойСтроки);
		
		ПомещаетсяПерваяПодстрокаИДиапазон = ((ДлинаПервойПодстроки + ДлинаОбозначенияДиапазона) <= МаксимальнаяДлинаИтоговойСтроки);
	КонецЕсли;
	
	Если ПомещаютсяВсеПодстрокиДиапазоном Тогда
		// Все подстроки диапазоном помещаются точно
		
		// Что делаем: собираем итоговую строку до достижения максимальной длины
		
		ИтоговаяСтрока		= "";
		ТекущаяДлина		= 0;
		
		Для Индекс = 0 По КоличествоПодстрок - 1 Цикл
			ЭтоПерваяПодстрока			= (Индекс = 0);
			ЭтоПредпоследняяПодстрока	= (Индекс = КоличествоПодстрок - 2);
			ЭтоПоследняяПодстрока		= (Индекс = КоличествоПодстрок - 1);
			
			Подстрока = МассивПодстрок[Индекс];
			ДлинаПодстроки = СтрДлина(Подстрока);
			
			СтрокаКандидат	= ?(ЭтоПерваяПодстрока, "", ОбозначениеРазделителя) + Подстрока;
			ДлинаКандидата	= СтрДлина(СтрокаКандидат);
			
			Если ЭтоПоследняяПодстрока Тогда
				ПотенциальнаяДлина = ТекущаяДлина + ДлинаКандидата;
			ИначеЕсли ЭтоПредпоследняяПодстрока	Тогда
				ПотенциальнаяДлина = ТекущаяДлина + ДлинаКандидата + ДлинаОбозначенияРазделителя + ДлинаПоследнейПодстроки;
			Иначе
				ПотенциальнаяДлина = ТекущаяДлина + ДлинаКандидата + ДлинаОбозначенияДиапазонаМежду + ДлинаПоследнейПодстроки;
			КонецЕсли;
			
			ТекущаяПодстрокаПомещаетсяПолностью		= (ПотенциальнаяДлина <= МаксимальнаяДлинаИтоговойСтроки);
			ТекущаяПодстрокаПомещаетсяОбрезанной	= Ложь;
			
			Если НЕ ТекущаяПодстрокаПомещаетсяПолностью 
				И НЕ ЭтоПерваяПодстрока
				И НЕ ЭтоПредпоследняяПодстрока
				И НЕ ЭтоПоследняяПодстрока Тогда
				// Определяем, может быть подстрока поместится в обрезанном виде
				
				ДлинаОбрезкиКандидата = (ПотенциальнаяДлина - МаксимальнаяДлинаИтоговойСтроки);
				
				ПотенциальнаяДлинаПодстроки = (ДлинаПодстроки - ДлинаОбрезкиКандидата);
				
				ТекущаяПодстрокаПомещаетсяОбрезанной = (ПотенциальнаяДлинаПодстроки > ДлинаОбозначенияОбрезкиТекста);
					
				ДлинаКандидата = ДлинаКандидата - ДлинаОбрезкиКандидата;
				СтрокаКандидат = СтрокаСОграничениемДлины(СтрокаКандидат, ДлинаКандидата, ОбозначениеОбрезкиТекста);
			КонецЕсли;
			
			Если ТекущаяПодстрокаПомещаетсяПолностью ИЛИ ТекущаяПодстрокаПомещаетсяОбрезанной Тогда
				ИтоговаяСтрока	= ИтоговаяСтрока + СтрокаКандидат;
				ТекущаяДлина	= ТекущаяДлина + ДлинаКандидата;
			Иначе
				// Ничего не выводим ,совсем мало места
				
				ИтоговаяСтрока	= ИтоговаяСтрока + ОбозначениеДиапазонаМежду + ПоследняяПодстрока;
				
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ПомещаетсяПерваяПодстрокаИДиапазонСправа Тогда
		// Помещается не более, чем полная первая подстрока и обозначение диапазона справа
		
		ИтоговаяСтрока = ПерваяПодстрока + ОбозначениеДиапазонаСправа;
		
	ИначеЕсли ПомещаетсяПерваяПодстрокаИДиапазон Тогда
		// Помещается не более, чем полная первая подстрока и обозначение диапазона
		
		ИтоговаяСтрока = ПерваяПодстрока + ОбозначениеДиапазона;
		
	Иначе
		// Помещается менее, чем полная первая подстрока и обозначение диапазона
		// Вероятно, требуется обрезка первой подстроки
		
		ОставшаясяДлина		= МаксимальнаяДлинаИтоговойСтроки;
		ДобавляемыйТекст	= "";
		
		Если КоличествоПодстрок > 1 Тогда
			ОставшаясяДлина		= МаксимальнаяДлинаИтоговойСтроки - ДлинаОбозначенияДиапазонаСправа;
			ДобавляемыйТекст	= ОбозначениеДиапазонаСправа;
		КонецЕсли;
		
		Если ОставшаясяДлина > ДлинаОбозначенияОбрезкиТекста Тогда
			ИтоговаяСтрока = СтрокаСОграничениемДлины(ПерваяПодстрока, ОставшаясяДлина, ОбозначениеОбрезкиТекста) + ДобавляемыйТекст;
		Иначе
			ИтоговаяСтрока = ОбозначениеНичегоНеПомещается;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИтоговаяСтрока;
	
КонецФункции

// Укорачивает справа выводимую строку до указанной длины в случае необходимости, добавляет обозначение обрезки текста.
Функция СтрокаСОграничениемДлины(ВыводимаяСтрока, МаксимальнаяДлина, ОбозначениеОбрезкиТекста = Неопределено) Экспорт
	
	ДлинаСтроки = СтрДлина(ВыводимаяСтрока);
	
	Если ДлинаСтроки > МаксимальнаяДлина Тогда
		// Обрезаем правый край строки
		
		Если ОбозначениеОбрезкиТекста = Неопределено Тогда
			ОбозначениеОбрезкиТекста = "";
		КонецЕсли;
		
		ОбрезаемаяДлина = ДлинаСтроки - МаксимальнаяДлина + СтрДлина(ОбозначениеОбрезкиТекста);
		
		Возврат Лев(ВыводимаяСтрока, ДлинаСтроки - ОбрезаемаяДлина) + ОбозначениеОбрезкиТекста;
	Иначе
		// Оставляем строку без изменения
		
		Возврат ВыводимаяСтрока;
	КонецЕсли;
	
КонецФункции

// Выполняет пропорциональное распределение суммы в соответствии
// с заданными коэффициентами распределения.
//
// Параметры:
//  РаспределяемаяСумма - Число - сумма, которую надо распределить;
//  Коэффициенты - Массив - коэффициенты распределения;
//  Точность - Число - точность округления при распределении. Необязателен.
//
// Возвращаемое значение:
//  Массив - массив размерностью равный массиву коэффициентов, содержит
//           суммы в соответствии с весом коэффициента (из массива коэффициентов).
//           В случае если распределить не удалось (сумма = 0, кол-во коэффициентов = 0,
//           или суммарный вес коэффициентов = 0), тогда возвращается значение Неопределено.
//
Функция РаспределитьСуммуПропорциональноКоэффициентам(Знач РаспределяемаяСумма, Знач Коэффициенты, Знач Точность = 2) Экспорт
	
	Если Коэффициенты.Количество() = 0 Или Не ЗначениеЗаполнено(РаспределяемаяСумма) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексМаксимальногоКоэффициента = 0;
	МаксимальныйКоэффициент = 0;
	РаспределеннаяСумма = 0;
	СуммаКоэффициентов  = 0;
	
	Для Индекс = 0 По Коэффициенты.Количество() - 1 Цикл
		Коэффициент = Коэффициенты[Индекс];
		
		АбсолютноеЗначениеКоэффициента = ?(Коэффициент > 0, Коэффициент, -Коэффициент);
		Если МаксимальныйКоэффициент < АбсолютноеЗначениеКоэффициента Тогда
			МаксимальныйКоэффициент = АбсолютноеЗначениеКоэффициента;
			ИндексМаксимальногоКоэффициента = Индекс;
		КонецЕсли;
		
		СуммаКоэффициентов = СуммаКоэффициентов + Коэффициент;
	КонецЦикла;
	
	Если СуммаКоэффициентов = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Массив(Коэффициенты.Количество());
	
	Для Индекс = 0 По Коэффициенты.Количество() - 1 Цикл
		Результат[Индекс] = Окр(РаспределяемаяСумма * Коэффициенты[Индекс] / СуммаКоэффициентов, Точность, 1);
		РаспределеннаяСумма = РаспределеннаяСумма + Результат[Индекс];
	КонецЦикла;
	
	Дельта = РаспределяемаяСумма - РаспределеннаяСумма;
	
	Если Дельта > 0 Тогда 
		
		// Погрешности округления отнесем на коэффициент с максимальным весом.
		Если Не РаспределеннаяСумма = РаспределяемаяСумма Тогда
			Результат[ИндексМаксимальногоКоэффициента] = Результат[ИндексМаксимальногоКоэффициента] + Дельта;
		КонецЕсли;
		
	ИначеЕсли Дельта < 0 Тогда 
		
		// Если распределили больше чем положено, размазываем погрешность по ближайшим максимальным весам.
		ЗначениеПогрешности = 1 / Pow(10, Точность);
		КоличествоЭлементовПогрешности = -Дельта / ЗначениеПогрешности;
		
		КоэффициентыРешето = Новый Массив(Новый ФиксированныйМассив(Коэффициенты));
		
		Для Сч = 1 По КоличествоЭлементовПогрешности Цикл 
			МаксимальныйКоэффициент = МаксимальноеЗначениеВМассиве(КоэффициентыРешето);
			Индекс = КоэффициентыРешето.Найти(МаксимальныйКоэффициент);
			Если Индекс = Неопределено Тогда
				Индекс = КоэффициентыРешето.Найти(-МаксимальныйКоэффициент); // Отрицательный коэффициент.
			КонецЕсли;
			Если Индекс = Неопределено Тогда
				Индекс = 0; // Если не смогли определить индекс, относим на первую строку.
			КонецЕсли;
			Результат[Индекс] = Результат[Индекс] - ЗначениеПогрешности;
			КоэффициентыРешето[Индекс] = 0;
		КонецЦикла;
		
	Иначе 
		// Если Дельта = 0, то все идеально.
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МаксимальноеЗначениеВМассиве(Массив) Экспорт
	
	МаксимальноеЗначение = 0;
	
	Для Индекс = 0 По Массив.Количество() - 1 Цикл
		Значение = Массив[Индекс];
		
		АбсолютноеЗначение = ?(Значение > 0, Значение, -Значение);
		Если МаксимальноеЗначение < АбсолютноеЗначение Тогда
			МаксимальноеЗначение = АбсолютноеЗначение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксимальноеЗначение;
	
КонецФункции

// Процедура проверяет переданный параметр, если он не соответствует значению, 
// то присваивает ему указанное значение.
//
// Параметры:
//  Параметр - параметр, значение которого проверяется и заполняется.
//  Значение - значение для заполнения пустого параметра.
//
Процедура УстановитьНовоеЗначение(Параметр, Значение) Экспорт
	
	Если Параметр <> Значение Тогда
		Параметр = Значение;
	КонецЕсли;
	
КонецПроцедуры // УстановитьНовоеЗначение()

Функция СформироватьОтступ(Уровень, Отступ = Неопределено) Экспорт
	
	Результат = "";
	
	Если Отступ = Неопределено Тогда
		Отступ = Символы.НПП + Символы.НПП;
	КонецЕсли;

	Для Сч = 1 По Уровень Цикл
		Результат = Результат + Отступ;
	КонецЦикла;
	
	Возврат Результат;                         
	
КонецФункции

// Проверяет принадлежность обоих чисел или дат одному диапазону значений.
//
// Параметры:
//	Значение1			- Число или дата - Первое из двух проверяемых значений.
//	Значение2			- Число или дата - Второе из двух проверяемых значений.
//	ГраницыДиапазонов	- Массив чисел или дат - Каждым элементом является начало следующего диапазона.
//						Этот массив предварительно должен быть упорядочен по возрастанию.
// Возвращаемое значение:
//	Булево - Признак нахождения обоих значений одному диапазону значений.
Функция ЗначенияВОдномДиапазоне(Значение1, Значение2, ГраницыДиапазонов) Экспорт
	
	Для Каждого НачалоДиапазона Из ГраницыДиапазонов Цикл
		
		Если Значение1 < НачалоДиапазона И Значение2 < НачалоДиапазона Тогда
			Возврат Истина;
			
		ИначеЕсли Значение1 >= НачалоДиапазона И Значение2 >= НачалоДиапазона Тогда
			Продолжить;
			
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Пустой кэш параметров формы.
// 
// Возвращаемое значение:
//  Структура - Пустой кэш параметров формы:
// * Дата - Дата
// * Организация - СправочникСсылка.Организации
// * ИФО - СправочникСсылка.ИсточникиФинансовогоОбеспечения
// * ВалютаДокумента - СправочникСсылка.Валюты
// * ИзмениласьДатаВПределахДня - Булево
// * ИзмениласьДатаВПределахМесяца - Булево
// * ИзмениласьДатаНаМесяцИБолее - Булево
// * ИзмениласьДатаСПереходомНачалаПрослеживаемости - Булево
// * ИзмениласьУчетнаяПолитика - Булево
// * ИспользоватьУчетПоИФО - Булево
// * ИспользоватьУчетПоПодразделениям - Булево
// * ИспользоватьВалютныйУчет - Булево
// * ВалютаРегламентированногоУчета - СправочникСсылка.Валюты
// * УчетнаяПолитика - Структура -
// * Служебные - Структура -
// * Локальные - Структура -
Функция ПустойКэшПараметровФормы() Экспорт
	
	КэшПараметров = Новый Структура;
	
	// Дата, Организация, ИФО и пр. хранят старые значения (до изменения) соответствующих реквизитов документа.
	// Имеет смысл использовать только в обработчиках ДатаПриИзменении(), ОрганизацияПриИзменении(), ИФОПриИзменении(),
	// т.к. в остальных обработчиках формы их значения совпадают с Объект.Дата, Объект.Организация, Объект.ИФО.
	КэшПараметров.Вставить("Дата");
	КэшПараметров.Вставить("Организация");
	КэшПараметров.Вставить("ИФО");
	КэшПараметров.Вставить("ВалютаДокумента");
	
	// Интервал изменения даты:
	// - в пределах дня - обычно никаких действий не требуется, т.к. изменилось только время документа;
	// - в пределах месяца - может потребоваться пересчет некоторых реквизитов, например, курса валюты;
	// - более месяца - может потребоваться пересчет реквизитов, например, оставщегося срока использования.
	// Имеет смысл использовать только в обработчике ДатаПриИзменении().
	КэшПараметров.Вставить("ИзмениласьДатаВПределахДня");
	КэшПараметров.Вставить("ИзмениласьДатаВПределахМесяца");
	КэшПараметров.Вставить("ИзмениласьДатаНаМесяцИБолее");
	КэшПараметров.Вставить("ИзмениласьДатаСПереходомНачалаПрослеживаемости");
	// При изменении даты на месяц и более могла измениться действующая учетная политика.
	// Имеет смысл использовать только в обработчике ДатаПриИзменении().
	КэшПараметров.Вставить("ИзмениласьУчетнаяПолитика");
	
	// Общие параметры учета, часто используемые в документах.
	// Можно использовать в любых обработчиках событий документа для управления видимостью и логикой работы формы.
	КэшПараметров.Вставить("ИспользоватьУчетПоИФО");
	КэшПараметров.Вставить("ИспользоватьУчетПоПодразделениям");
	КэшПараметров.Вставить("ИспользоватьВалютныйУчет");
	КэшПараметров.Вставить("ВалютаРегламентированногоУчета");
	
	// Параметры учетной политики, действующие для установленных в документе Организации и Даты.
	// Можно использовать в любых обработчиках событий документа для управления видимостью и логикой работы формы.
	КэшПараметров.Вставить("УчетнаяПолитика", Новый Структура);
	КэшПараметров.УчетнаяПолитика.Вставить("ДатыИзменения");
	КэшПараметров.УчетнаяПолитика.Вставить("ДатаПоследнегоИзменения");
	// - общие сведения об учреждении:
	КэшПараметров.УчетнаяПолитика.Вставить("СтруктураРПС");
	КэшПараметров.УчетнаяПолитика.Вставить("ЭтоАвтономноеУчреждение");
	КэшПараметров.УчетнаяПолитика.Вставить("ЭтоБюджетноеУчреждение");
	КэшПараметров.УчетнаяПолитика.Вставить("ЭтоКазенноеУчреждение");
	КэшПараметров.УчетнаяПолитика.Вставить("ПолномочияАДБ");
	КэшПараметров.УчетнаяПолитика.Вставить("ПолномочияГАДБ");
	// - параметры налогообложения:
	КэшПараметров.УчетнаяПолитика.Вставить("ПлательщикНалогаНаПрибыль");
	КэшПараметров.УчетнаяПолитика.Вставить("ПрименяетсяУСНДоходы");
	КэшПараметров.УчетнаяПолитика.Вставить("ПрименяетсяУСНДоходыМинусРасходы");
	КэшПараметров.УчетнаяПолитика.Вставить("ПлательщикЕНВД");
	// - параметры учета имущества казны:
	КэшПараметров.УчетнаяПолитика.Вставить("ВедениеАналитическогоУчетаИмуществаКазны");
	КэшПараметров.УчетнаяПолитика.Вставить("НачислятьАмортизациюИмуществаКазны");
	
	// Служебные параметры используются для внутренних механизмов конфигурации.
	КэшПараметров.Вставить("Служебные", Новый Структура);
	// - служебные параметры механизма автоматического контроля курса валюты в документе:
	КэшПараметров.Служебные.Вставить("ОбновлятьКурсВалютыАвтоматически");
	КэшПараметров.Служебные.Вставить("ИзмениласьДатаДляКонтроляКурса");
	КэшПараметров.Служебные.Вставить("ИзмениласьВалютаДляКонтроляКурса");
	// - служебные параметры механизма контроля зависимых реквизитов:
	КэшПараметров.Служебные.Вставить("РеквизитыДокументаЗависящиеОтДаты");
	КэшПараметров.Служебные.Вставить("РеквизитыТиповойОперацииЗависящиеОтДаты");
	
	// Локальные параметры могут быть добавлены в форме конкретного документа.
	КэшПараметров.Вставить("Локальные", Новый Структура);
	
	Возврат КэшПараметров;

КонецФункции

// Кэш параметров формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//   * КэшПараметров - см. ПустойКэшПараметровФормы
// 
// Возвращаемое значение:
//  Структура - см. ПустойКэшПараметровФормы
Функция КэшПараметровФормы(Форма) Экспорт
	Возврат Форма.КэшПараметров;
КонецФункции

// Функция возвращает наличие кворума присутствия. Может использоваться для документов с голосованием комиссии.
// 
// Параметры:
//   ВсегоСотрудников - Число(10) - общее количество сотрудников
//   ВсегоПрисутствующих - Число(10) - количество присутствующих сотрудников
//   Кворум - Число(5,2) - минимальный процент присутствующих, необходимый для наличия кворума
//
// Возвращаемое значение:
//  Булево - Истина, если кворум есть, иначе Ложь
//
Функция ЕстьКворумПрисутствия(ВсегоСотрудников, ВсегоПрисутствующих, Кворум) Экспорт
	
	Если ВсегоСотрудников = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат 100 * ВсегоПрисутствующих / ВсегоСотрудников >= Кворум;
	
КонецФункции

// Рассчитывает количество месяцев между датой Дата1 и Дата2
// Если Дата2 < Дата1, то результат будет отрицательный
//
// Параметры:
//  Дата1 - Дата - начальная дата
//  Дата2 - Дата - конецная дата                   
//  УчитыватьМесяцДата1 - Булево - учитывать месяц даты Дата1 или нет.
//
// Возвращаемое значение:
//  Число - количество месяцев между датой Дата1 и Дата2
Функция КоличествоМесяцевМеждуДатами(Знач Дата1, Знач Дата2, 
		УчитыватьМесяцДата1 = Истина, УчитыватьМесяцДата2 = Истина) Экспорт
		
	ЗнакОтрицательный = Ложь;              
	Если НачалоМесяца(Дата2) < НачалоМесяца(Дата1) Тогда
		ДатаВр = Дата1;
		Дата1 = Дата2;
		Дата2 = ДатаВр;
		ЗнакОтрицательный = Истина;
	КонецЕсли;	                  
	
	Дата1 = НачалоМесяца(?(УчитыватьМесяцДата1, Дата1, ДобавитьМесяц(Дата1, 1)));
	Дата2 = КонецМесяца(?(УчитыватьМесяцДата2, Дата2, ДобавитьМесяц(Дата2, -1)));
	
	КолМесяцев = 0;
	Пока КонецМесяца(Дата1) <= Дата2 Цикл
		КолМесяцев = КолМесяцев + 1;
		Дата1 = ДобавитьМесяц(Дата1, 1);
	КонецЦикла;                    
	
	Возврат ?(ЗнакОтрицательный И КолМесяцев <> 0, - КолМесяцев, КолМесяцев);
КонецФункции	

// Параметры выбора файла особого мнения сотрудника.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//  * Объект - ДанныеФормыСтруктура:
//   ** Ссылка - ОпределяемыйТип.ДокументыСФайламиСотрудников
//  ИмяТаблицыСоставКомиссии - Строка - Имя таблицы состав комиссии
//  ОповещениеПослеВыбора - Неопределено, ОписаниеОповещения - Оповещение после выбора
// 
// Возвращаемое значение:
//  Структура - Параметры выбора файла особого мнения сотрудника:
// * Форма - ФормаКлиентскогоПриложения, Неопределено -
// * ТаблицаФормы - ТаблицаФормы
// * Таблица - ДанныеФормыКоллекция
// * Документ - ОпределяемыйТип.ДокументыСФайламиСотрудников
// * Сотрудник - СправочникСсылка.Сотрудники
// * Файл - ОпределяемыйТип.ПрисоединенныйФайл
// * ОповещениеПослеВыбора - Булево, ОписаниеОповещения, Неопределено - 
Функция ПараметрыВыбораФайлаОсобогоМненияСотрудника(Форма = Неопределено, ИмяТаблицыСоставКомиссии = "СоставКомиссии", ОповещениеПослеВыбора = Неопределено) Экспорт
	Параметры = Новый Структура;
	Параметры.Вставить("Форма");
	Параметры.Вставить("ТаблицаФормы");
	Параметры.Вставить("Таблица");
	Параметры.Вставить("Документ");
	Параметры.Вставить("Сотрудник");
	Параметры.Вставить("Файл");
	Параметры.Вставить("ОповещениеПослеВыбора", ОповещениеПослеВыбора);
	Если Форма <> Неопределено Тогда
		Параметры.Форма = Форма;
		ТаблицаФормы = Форма.Элементы[ИмяТаблицыСоставКомиссии]; // см. Документ.РешениеОбОценкеИмуществаМЗИК.Форма.ФормаДокумента.Элементы.СоставКомиссии
		Параметры.ТаблицаФормы = ТаблицаФормы;
		Параметры.Таблица = Форма.Объект[ИмяТаблицыСоставКомиссии];
		Параметры.Документ = Форма.Объект.Ссылка;
		ТекущиеДанные = Неопределено;
		#Если ТолстыйКлиентУправляемоеПриложение Тогда
			Если ТаблицаФормы.ВыделенныеСтроки.Количество() > 0 Тогда
				ТекущиеДанные = Форма.Объект[ИмяТаблицыСоставКомиссии].НайтиПоИдентификатору(
					ТаблицаФормы.ВыделенныеСтроки[0]);
			КонецЕсли;
		#ИначеЕсли Клиент Тогда
			ТекущиеДанные = ТаблицаФормы.ТекущиеДанные; 
		#КонецЕсли
		Если ТекущиеДанные <> Неопределено Тогда
			Параметры.Сотрудник = ТекущиеДанные.Сотрудник;
			Параметры.Файл = ТекущиеДанные.ФайлОсобогоМнения;
		КонецЕсли;
		Параметры.ОповещениеПослеВыбора = ?(ОповещениеПослеВыбора = Неопределено, Истина, ОповещениеПослеВыбора);
	КонецЕсли;
	
	Возврат Параметры;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ФУНКЦИОНАЛЬНЫМИ ОПЦИЯМИ

Процедура УстановитьПараметрОрганизацияФункциональныхОпцийФормы(Форма, Организация, Период = Неопределено) Экспорт

	ПараметрыФО = Новый Структура();
	ПараметрыФО.Вставить("Организация", Организация);
	Если Период <> Неопределено Тогда
		ПараметрыФО.Вставить("Период", НачалоМесяца(Период));
		// Приводим к началу месяца для того, чтобы сократить пространство кэшируемых значений.
		// Параметр "Организация" используется в функциональных опциях, привязанных к регистрам сведений с периодичностью Месяц или реже.
	КонецЕсли;
	
	Форма.УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

Процедура УстановитьПараметрыФункциональныхОпцийФормыДокумента(Форма) Экспорт
	
	УстановитьПараметрОрганизацияФункциональныхОпцийФормы(Форма, Форма.Объект.Организация, Форма.Объект.Дата);
	
КонецПроцедуры

Функция МаксимальнаяДлинаНомераБСО() Экспорт
	Возврат 20;	
КонецФункции

// Возвращает элемент формы заданного типа, содержащий текущий элемент
// Поиск ведется рекурсивно, до первного родителя нужного типа.
// Если элемент нужного типа не получен (получена родительская управляемая форма, то возвращается неопределено
//
// Параметры:
//	Элемент - Элемент формы
//	Тип - тип родителя для поиска
//
// Возвращаемое значение:
//	ЭлементФормы - найденный элемент нужного типа
//	Неопределено - элемент нужного типа не найден
//
Функция РодительскийЭлементЗаданногоТипа(Знач Элемент, Тип) Экспорт
	Если ТипЗнч(Элемент.Родитель) = Тип Тогда
		Возврат Элемент.Родитель;
	ИначеЕсли ТипЗнч(Элемент.Родитель) = Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат Неопределено;
	Иначе
		Возврат РодительскийЭлементЗаданногоТипа(Элемент.Родитель, Тип);
	КонецЕсли;
КонецФункции

#Область ФлажокБезОграничения

// Флажок <без ограничения>
//	Механизм предназначен для интерактивного совместного редактирования
// двух связанных между собой реквизитов (ссылки и флажка), когда требуется
// различать 2 различных состояния при пустом значении реквизита-ссылки
// (<пустое значение> и <без ограничения>).
//
//	Взаимосвязанные реквизиты:
//	- Ссылочный реквизит
//		Далее обозначается как реквизит-ссылка.
//		В случае пустого значения различаются 2 состояния
//		в зависимости от значения связанного реквизита-флажка.
//	- Реквизит флажка "Без ограничения"
//		Далее обозначается как реквизит-флажок.
//		Позволяет задать состояние <без ограничения> при установленном флажке.
//		При сброшенном флажке и пустой ссылке устанавливается состояние <пустое значение>.
//
Процедура ФлажокБезОграничения_ИнициализироватьВсеФлажкиБезОграничения(ДокументОбъект, НастройкиМеханизма, ДанныеЗаполнения = Неопределено) Экспорт
	
	// Размещаем все настройки в массив
	МассивНастроек = ФлажокБезОграничения_ПривестиНастройкиМеханизмаКОжидаемомуФормату(НастройкиМеханизма);
	
	// Инициализируем все флажки
	Для Каждого ТекущиеНастройки Из МассивНастроек Цикл
		ИмяРеквизитаСсылка	= ТекущиеНастройки["ИмяРеквизитаСсылка"];
		ИмяРеквизитаФлажок	= ТекущиеНастройки["ИмяРеквизитаФлажок"];
		
		// Определим значение реквизита ссылки
		// Сначала берем из самого документа
		ЗначениеРеквизитаСсылка = ДокументОбъект[ИмяРеквизитаСсылка];
		
		// Если указаны данные заполнения, то пробуем взять значение оттуда
		Если НЕ ДанныеЗаполнения = Неопределено Тогда
			ВремСтруктура = Новый Структура(ИмяРеквизитаСсылка);
			ЗаполнитьЗначенияСвойств(ВремСтруктура, ДанныеЗаполнения);
			
			Если ЗначениеЗаполнено(ВремСтруктура[ИмяРеквизитаСсылка]) Тогда
				ЗначениеРеквизитаСсылка = ВремСтруктура[ИмяРеквизитаСсылка];
			КонецЕсли;
		КонецЕсли;
		
		// Инициализируем флажок
		ДокументОбъект[ИмяРеквизитаФлажок] = НЕ ЗначениеЗаполнено(ЗначениеРеквизитаСсылка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ФлажокБезОграничения_НастроитьЭлементСсылку(Форма, НастройкиМеханизма) Экспорт
	
	Объект = Форма["Объект"];
	
	ИмяРеквизитаСсылка	= НастройкиМеханизма["ИмяРеквизитаСсылка"];
	ИмяРеквизитаФлажок	= НастройкиМеханизма["ИмяРеквизитаФлажок"];
	
	ЭлементСсылка			= Форма.Элементы[ИмяРеквизитаСсылка];
	ЗначениеРеквизитаФлажок	= Объект[ИмяРеквизитаФлажок];
	
	ТекстПустоеЗначение	= НСтр("ru='<пустое значение>'");
	ТекстБезОграничения	= НСтр("ru='<без ограничения>'");
	
	ЭлементСсылка.ПодсказкаВвода = ?(ЗначениеРеквизитаФлажок, ТекстБезОграничения, ТекстПустоеЗначение);
	
КонецПроцедуры

Функция ФлажокБезОграничения_ПривестиНастройкиМеханизмаКОжидаемомуФормату(НастройкиМеханизма) Экспорт
	
	МассивНастроек = Новый Массив();
	
	Если ТипЗнч(НастройкиМеханизма) = Тип("Структура") Тогда
		// Опциональный параметр РеквизитСсылкаПустоеЗначение
		Если НЕ НастройкиМеханизма.Свойство("РеквизитСсылкаПустоеЗначение") Тогда
			ЗначениеПоУмолчанию = Неопределено;
			НастройкиМеханизма.Вставить("РеквизитСсылкаПустоеЗначение", ЗначениеПоУмолчанию);
		КонецЕсли;
		
		МассивНастроек.Добавить(Новый ФиксированнаяСтруктура(НастройкиМеханизма));
		
	ИначеЕсли ТипЗнч(НастройкиМеханизма) = Тип("Массив") Тогда
		Для Каждого ТекущаяНастройка Из НастройкиМеханизма Цикл
			Если ТипЗнч(ТекущаяНастройка) = Тип("Структура") Тогда
				// Опциональный параметр РеквизитСсылкаПустоеЗначение
				Если НЕ ТекущаяНастройка.Свойство("РеквизитСсылкаПустоеЗначение") Тогда
					ЗначениеПоУмолчанию = Неопределено;
					ТекущаяНастройка.Вставить("РеквизитСсылкаПустоеЗначение", ЗначениеПоУмолчанию);
				КонецЕсли;
				
				МассивНастроек.Добавить(Новый ФиксированнаяСтруктура(ТекущаяНастройка));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивНастроек;
	
КонецФункции

Функция ФлажокБезОграничения_ИмяРеквизитаФормыДляНастроекМеханизма() Экспорт
	
	Возврат "ФлажокБезОграничения_НастройкиМеханизма";
	
КонецФункции

Процедура ФлажокБезОграничения_РеквизитСсылка_ПриИзменении(Форма, Элемент) Экспорт
	
	// Определяем имя реквизита-флажка
	НастройкиМеханизма = ФлажокБезОграничения_ОпределитьНастройкиМеханизмаДляЭлемента(Форма, Элемент);
	
	Если НЕ НастройкиМеханизма = Неопределено Тогда
		ИмяРеквизитаСсылка	= НастройкиМеханизма["ИмяРеквизитаСсылка"];
		ИмяРеквизитаФлажок	= НастройкиМеханизма["ИмяРеквизитаФлажок"];
		
		Объект = Форма["Объект"];
		
		// При необходимости сбрасываем флажок "Без ограничения"
		Если Объект[ИмяРеквизитаФлажок] Тогда
			Объект[ИмяРеквизитаФлажок] = Ложь;
		КонецЕсли;
		
		ФлажокБезОграничения_НастроитьЭлементСсылку(Форма, НастройкиМеханизма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ФлажокБезОграничения_РеквизитФлажок_ПриИзменении(Форма, Элемент) Экспорт
	
	// Определяем имя реквизита-ссылки
	НастройкиМеханизма = ФлажокБезОграничения_ОпределитьНастройкиМеханизмаДляЭлемента(Форма, Элемент);
	
	Если НЕ НастройкиМеханизма = Неопределено Тогда
		ИмяРеквизитаСсылка				= НастройкиМеханизма["ИмяРеквизитаСсылка"];
		ИмяРеквизитаФлажок				= НастройкиМеханизма["ИмяРеквизитаФлажок"];
		РеквизитСсылкаПустоеЗначение	= НастройкиМеханизма["РеквизитСсылкаПустоеЗначение"];
		
		Объект = Форма["Объект"];
		
		// При установленном флажке очищаем значение ссылки
		Если Объект[ИмяРеквизитаФлажок] И ЗначениеЗаполнено(Объект[ИмяРеквизитаСсылка]) Тогда
			Объект[ИмяРеквизитаСсылка] = РеквизитСсылкаПустоеЗначение;
		КонецЕсли;
		
		ФлажокБезОграничения_НастроитьЭлементСсылку(Форма, НастройкиМеханизма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   

#Область ТабличныйДокументСлужебныйИнтеграцияБСП

Функция РасчетныеПоказателиЯчеек(Знач ТабличныйДокумент, ВыделенныеОбласти) Экспорт 
 	Возврат ОбщегоНазначенияСлужебныйКлиентСервер.РасчетныеПоказателиЯчеек(ТабличныйДокумент, ВыделенныеОбласти);
КонецФункции	

#КонецОбласти

#Область МеханизмГолосованияКомиссии

Процедура МеханизмГолосованияКомиссии_УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(Форма) Экспорт
	
	ИменаРеквизитов = Форма.НастройкиМеханизмаГолосованияКомиссии.ИменаРеквизитов;
	
	ИменаЭлементов = Форма.НастройкиМеханизмаГолосованияКомиссии.ИменаЭлементов;
	
	Сотрудник = Форма[ИменаРеквизитов.Сотрудник];
	
	РешениеСотрудникаМодифицированность = Форма[ИменаРеквизитов.РешениеСотрудникаМодифицированность];
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		ИменаЭлементов.КнопкаСохранитьРезультатыГолосования, "Доступность",
			ЗначениеЗаполнено(Сотрудник) И РешениеСотрудникаМодифицированность);
	
КонецПроцедуры

Процедура МеханизмГолосованияКомиссии_УстановитьПризнакМодифицированностиРешенияСотрудника(Форма, НовоеЗначение) Экспорт
	
	ИменаРеквизитов = Форма.НастройкиМеханизмаГолосованияКомиссии.ИменаРеквизитов;
	
	Форма[ИменаРеквизитов.РешениеСотрудникаМодифицированность] = НовоеЗначение;
	
КонецПроцедуры

Функция МеханизмГолосованияКомиссии_ПолучитьРезультатыГолосованияСотрудника(ТаблицаДокумента) Экспорт
	
	РезультатыГолосования = Новый Массив;
	
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		Если ЗначениеЗаполнено(СтрокаДокумента.РешениеСотрудникаПоРезолюции) Тогда
			РезультатГолосования = Новый Структура("ИдентификаторСтроки,РешениеСотрудникаПоРезолюции",
				СтрокаДокумента.ИдентификаторСтроки, СтрокаДокумента.РешениеСотрудникаПоРезолюции);
			РезультатыГолосования.Добавить(РезультатГолосования);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатыГолосования;
	
КонецФункции

#КонецОбласти

#Область РезолюцииКомиссий

Функция ПолучитьТекстРезолюцииПоИдентификатору(МассивРезолюций, ИдентификаторРезолюции) Экспорт
	
	Для Каждого Элемент Из МассивРезолюций Цикл
		
		Если Элемент.Идентификатор = ИдентификаторРезолюции Тогда
			Возврат Элемент.Текст;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеКомиссий

// Возвращает структуру, содержащую имена реквизитов для записи председателя комиссии в документы
//
// Параметры:
//  Должность - Строка - имя реквизита должность документа 
//  Фамилия - Строка - имя реквизита фамилия документа
//  Имя - Строка - имя реквизита имя документа
//  Отчество - Строка - имя реквизита отчетства документа
//
// Возвращаемое значение:
//  Структура - структура имен реквизитов председателя:
//  * Должность - Строка - имя реквизита должность документа
//  * Фамилия - Строка - имя реквизита фамилия документа
//  * Имя - Строка - имя реквизита имя документа
//  * Отчество - Строка - имя реквизита отчетство документа
Функция СтруктураИменРеквизитовВыбораПредседателяКомиссии(Должность = "ДолжностьПредседателяКомиссии",
	Фамилия = "ФамилияПредседателяКомиссии", Имя = "ИмяПредседателяКомиссии",
	Отчество = "ОтчествоПредседателяКомиссии") Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Должность"	, Должность);
	Результат.Вставить("Фамилия"	, Фамилия);
	Результат.Вставить("Имя"		, Имя);
	Результат.Вставить("Отчество"	, Отчество);
	Возврат Результат;
	
КонецФункции // СтруктураИменРеквизитовВыбораПредседателяКомиссии()

// Структура параметров выбора комисии.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа
// 
// Возвращаемое значение:
//  Структура - Структура параметров выбора комисии:
// * Форма - ФормаКлиентскогоПриложения - форма документа. Используется только для установки модифицированности.
// 					Можно не передавать
// * ИменаРеквизитовПредседателя - Структура - :
// ** Должность - Строка - имя реквизита должность документа
// ** Фамилия - Строка - имя реквизита фамилия документа
// ** Имя - Строка - имя реквизита имя документа
// ** Отчество - Строка - имя реквизита отчетство документа
// * Приказ - Структура - о создании комиссии:
// ** ЕстьНомерПриказа - Булево
// ** НомерПриказа - Строка
// ** ДатаПриказа - Строка 
// ** НаименованиеПриказа - Строка 
Функция СтруктураПараметровВыбораКомисии(Форма = Неопределено) Экспорт
	
	РеквизитыПредседателя = СтруктураИменРеквизитовВыбораПредседателяКомиссии();
	
	РеквизитыПриказа = Новый Структура;
	РеквизитыПриказа.Вставить("ЕстьНомерПриказа"	, Истина);
	РеквизитыПриказа.Вставить("НомерПриказа"		, "НомерПриказа");
	РеквизитыПриказа.Вставить("ДатаПриказа"			, "ДатаПриказа");
	РеквизитыПриказа.Вставить("НаименованиеПриказа"	, "НаименованиеПриказа");
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Форма", Форма);
	ДопПараметры.Вставить("ИменаРеквизитовПредседателя"	, РеквизитыПредседателя);
	ДопПараметры.Вставить("Приказ"						, РеквизитыПриказа);
	
	Возврат ДопПараметры;
	
КонецФункции

// Заполняет реквизиты комиссии документа.
//
// Параметры:
//  Комиссия - СправочникСсылка.ПостоянноДействующиеКомиссии
//  ДопПараметры - Структура - :
//   * Форма - ФормаКлиентскогоПриложения - в этой процедуре не используется
//   * ИменаРеквизитовПредседателя - Структура - см. СтруктураИменРеквизитовВыбораПредседателяКомиссии()
//   * Приказ - Структура - см. СтруктураПараметровВыбораКомисии()
//  Объект - ДанныеФормыКоллекция, ДокументОбъект - документ 
Процедура ЗаполнитьКомиссиюВДокументе(Комиссия, ДопПараметры, Объект) Экспорт
	
	Если Комиссия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Приказ = ДопПараметры.Приказ;
	ИменаРеквизитовПредседателя = ДопПараметры.ИменаРеквизитовПредседателя;
	
	Объект.СоставКомиссии.Очистить();
	Объект[ИменаРеквизитовПредседателя.Должность] = "";
	Объект[ИменаРеквизитовПредседателя.Фамилия]   = "";
	Объект[ИменаРеквизитовПредседателя.Имя]       = "";
	Объект[ИменаРеквизитовПредседателя.Отчество]  = "";
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ДатаИнвентаризации") Тогда
		НаДату = Объект.ДатаИнвентаризации;
	Иначе
		НаДату = Объект.Дата;
	КонецЕсли;
	
	ТекущаяКомиссия = ОбщегоНазначенияБГУВызовСервера.ПолучитьДанныеКомиссии(Комиссия, НаДату);
	
	Если Приказ.ЕстьНомерПриказа Тогда
		ДанныеПриказа = Новый Структура;
		ДанныеПриказа.Вставить(Приказ.НомерПриказа , ТекущаяКомиссия.НомерПриказа);
		ДанныеПриказа.Вставить(Приказ.ДатаПриказа , ТекущаяКомиссия.ДатаПриказа);
		ДанныеПриказа.Вставить(Приказ.НаименованиеПриказа, ТекущаяКомиссия.НаименованиеПриказа);
		ЗаполнитьЗначенияСвойств(Объект, ДанныеПриказа);
	КонецЕсли;
	
	Для Каждого ТекСтрокаКомиссии Из ТекущаяКомиссия.ДанныеКомиссии Цикл
		
		Если ТекСтрокаКомиссии.Председатель Тогда
			Объект[ИменаРеквизитовПредседателя.Должность] = ТекСтрокаКомиссии.ДолжностьЧленаКомиссии;
			Объект[ИменаРеквизитовПредседателя.Фамилия]   = ТекСтрокаКомиссии.ФамилияЧленаКомиссии;
			Объект[ИменаРеквизитовПредседателя.Имя]       = ТекСтрокаКомиссии.ИмяЧленаКомиссии;
			Объект[ИменаРеквизитовПредседателя.Отчество]  = ТекСтрокаКомиссии.ОтчествоЧленаКомиссии;
			ЗаполнитьЗначенияСвойств(Объект, Новый Структура("Председатель", ТекСтрокаКомиссии.Сотрудник));
		Иначе
			ЗаполнитьЗначенияСвойств(Объект.СоставКомиссии.Добавить(), ТекСтрокаКомиссии);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область МеханизмОзнакомленияСотрудников

Функция МеханизмОзнакомленияСотрудников_ДопустимоРедактирование(Форма) Экспорт
	
	ДопустимоРедактирование = ЗначениеЗаполнено(Форма.Объект.Ссылка) И Не Форма.Модифицированность 
							  И Не Форма.ТолькоПросмотр;
	
	Возврат ДопустимоРедактирование;
	
КонецФункции

Процедура МеханизмОзнакомленияСотрудников_УстановитьМодифицированность(Форма, ИмяТабличнойЧасти, НовоеЗначение) Экспорт
	
	НастройкиМеханизма = Форма.НастройкиМеханизмаОзнакомленияСотрудников;
	
	ИменаРеквизитов = НастройкиМеханизма.ТабличныеЧасти[ИмяТабличнойЧасти].ИменаРеквизитов;
	
	Форма[ИменаРеквизитов.Модифицированность] = НовоеЗначение;
	
КонецПроцедуры	

Функция МеханизмОзнакомленияСотрудников_УстановленОтборСотрудника(Форма) Экспорт
	
	НастройкиМеханизма = Форма.НастройкиМеханизмаОзнакомленияСотрудников;
	
	ОтборСотрудника = НастройкиМеханизма.ОтборСотрудника;
	
	Возврат (ОтборСотрудника.Количество() > 0);
	
КонецФункции

// Настройки

Функция МеханизмОзнакомленияСотрудников_ТекстСообщенияНедопустимоРедактирование() Экспорт
	
	Возврат НСтр("ru = 'Редактирование и сохранение результатов недоступно, пока документ не записан'");
	
КонецФункции

Функция МеханизмОзнакомленияСотрудников_ПодтверждатьСохранениеРезультатов() Экспорт
	
	Возврат Истина;
	
КонецФункции

Функция МеханизмОзнакомленияСотрудников_ОчищатьРеквизитыМеханизмаПослеЧтенияЗаписиФормы() Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция МеханизмОзнакомленияСотрудников_ИмяПроцедурыОбработчикОжидания() Экспорт
	
	Возврат "Подключаемый_МеханизмОзнакомленияСотрудников_ПроверитьДопустимостьРедактирования";
	
КонецФункции

#КонецОбласти 

#Область УстаревшиеПроцедурыИФункции

// Устарела.
// Заполнить виды первичных документов.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//   * ПараметрыПодключаемыхКоманд - Структура
//   * Элементы - ВсеЭлементыФормы:
//     ** ПервичныйДокумент - ПолеФормы
//   * ПараметрыПечатныхФорм - Структура из см. ПустаяСтрокаПараметраПечатныхФорм
//
Процедура ОбновитьВидыПервичныхДокументов(Форма) Экспорт
	
	СписокПечатныхФорм = Форма.Элементы.ПервичныйДокумент.СписокВыбора; // СписокЗначений
	СписокПечатныхФорм.Очистить();
	Объект = Форма.Объект;
	
	Для Каждого Строка Из Форма.ПараметрыПечатныхФорм Цикл
		Если УсловияВидимостиКомандыПечатиВыполняются(Строка.Значение.УсловияВидимости, Объект) Тогда
			СписокПечатныхФорм.Добавить(Строка.Значение.ВидПервичногоДокумента, Строка.Значение.Представление);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Устарела.
// Пустая строка параметра печатных форм.
// 
// Возвращаемое значение:
//  Структура - Пустая строка параметра печатных форм:
// * Представление - Строка -
// * ВидПервичногоДокумента - СправочникСсылка.ПервичныеДокументы
// * УсловияВидимости - Массив из Строка
Функция ПустаяСтрокаПараметраПечатныхФорм() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Представление", "");
	Результат.Вставить("ВидПервичногоДокумента", ПредопределенноеЗначение("Справочник.ПервичныеДокументы.ПустаяСсылка"));
	Результат.Вставить("УсловияВидимости", Новый Массив);
	Возврат Результат;
КонецФункции

// Устарела. Следует использовать ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(...).
// Формирует текст сообщения, подставляя значения
// параметров в шаблоны сообщений.
//
// Параметры
//  ВидПоля       - Строка - может принимать значения:
//                  Поле, Колонка, Список
//  ВидСообщения  - Строка - может принимать значения:
//                  Заполнение, Корректность
//  Параметр1     - Строка - имя поля
//  Параметр2     - Строка - номер строки
//  Параметр3     - Строка - имя списка
//  Параметр4     - Строка - текст сообщения о некорректности заполнения
//
// Возвращаемое значение:
//   Строка - текст сообщения
//
Функция ПолучитьТекстСообщения(ВидПоля = "Поле", ВидСообщения = "Заполнение",
	Параметр1 = "", Параметр2 = "",	Параметр3 = "", Параметр4 = "") Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(ВидПоля, ВидСообщения,
		Параметр1, Параметр2, Параметр3, Параметр4);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиПодписокНаСобытия

//Обработчик подписки ПриПолученииПолейПредставления события ОбработкаПолученияПолейПредставления Менеджера документа
//
Процедура ПриПолученииПолейПредставленияОбработкаПолученияПолейПредставления(Источник, Поля, СтандартнаяОбработка) Экспорт
	
	ПредставлениеОбъектовБГУВызовСервераПереопределяемый.ОбработкаПолученияПолейПредставления(ТипЗнч(Источник), Поля, СтандартнаяОбработка);
	
КонецПроцедуры

//Обработчик подписки ПриПолученииПредставления события ОбработкаПолученияПредставления Менеджера документа
//
Процедура ПриПолученииПредставленияОбработкаПолученияПредставления(Источник, Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ПредставлениеОбъектовБГУВызовСервераПереопределяемый.ОбработкаПолученияПредставления(ТипЗнч(Источник), Данные, Представление, СтандартнаяОбработка);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УсловияВидимостиКомандыПечатиВыполняются(Условия, ЗначенияРеквизитов)
	Если Не ЗначениеЗаполнено(Условия) Тогда
		Возврат Истина;
	КонецЕсли;
	Для Каждого Условие Из Условия Цикл
		ИмяРеквизита = Условие.Реквизит;
		Если Не ЗначенияРеквизитов.Свойство(ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		Если ИмяРеквизита = "ПервичныйДокумент" Тогда
			Продолжить;
		КонецЕсли;
		УсловиеВыполняется = Истина;
		Если Условие.ВидСравнения = ВидСравнения.Равно
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			УсловиеВыполняется = ЗначенияРеквизитов[ИмяРеквизита] = Условие.Значение;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.Больше
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
			УсловиеВыполняется = ЗначенияРеквизитов[ИмяРеквизита] > Условие.Значение;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.БольшеИлиРавно
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
			УсловиеВыполняется = ЗначенияРеквизитов[ИмяРеквизита] >= Условие.Значение;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.Меньше
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда
			УсловиеВыполняется = ЗначенияРеквизитов[ИмяРеквизита] < Условие.Значение;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.МеньшеИлиРавно
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
			УсловиеВыполняется = ЗначенияРеквизитов[ИмяРеквизита] <= Условие.Значение;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.НеРавно
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
			УсловиеВыполняется = ЗначенияРеквизитов[ИмяРеквизита] <> Условие.Значение;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.ВСписке
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
			Если ТипЗнч(Условие.Значение) = Тип("СписокЗначений") Тогда
				УсловиеВыполняется = Условие.Значение.НайтиПоЗначению(ЗначенияРеквизитов[ИмяРеквизита]) <> Неопределено;
			Иначе // Массив
				УсловиеВыполняется = Условие.Значение.Найти(ЗначенияРеквизитов[ИмяРеквизита]) <> Неопределено;
			КонецЕсли;
		ИначеЕсли Условие.ВидСравнения = ВидСравнения.НеВСписке
			Или Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
			Если ТипЗнч(Условие.Значение) = Тип("СписокЗначений") Тогда
				УсловиеВыполняется = Условие.Значение.НайтиПоЗначению(ЗначенияРеквизитов[ИмяРеквизита]) = Неопределено;
			Иначе // Массив
				УсловиеВыполняется = Условие.Значение.Найти(ЗначенияРеквизитов[ИмяРеквизита]) = Неопределено;
			КонецЕсли;
		ИначеЕсли Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
			УсловиеВыполняется = ЗначениеЗаполнено(ЗначенияРеквизитов[ИмяРеквизита]);
		ИначеЕсли Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
			УсловиеВыполняется = Не ЗначениеЗаполнено(ЗначенияРеквизитов[ИмяРеквизита]);
		КонецЕсли;
		Если Не УсловиеВыполняется Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

#Область ФлажокБезОграничения

Функция ФлажокБезОграничения_ОпределитьНастройкиМеханизмаДляЭлемента(Форма, Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	
	ИмяРеквизитаФормы	= ФлажокБезОграничения_ИмяРеквизитаФормыДляНастроекМеханизма();
	МассивНастроек		= Форма[ИмяРеквизитаФормы];
	
	Для Каждого ТекущиеНастройки Из МассивНастроек Цикл
		ИмяРеквизитаСсылка	= ТекущиеНастройки["ИмяРеквизитаСсылка"];
		ИмяРеквизитаФлажок	= ТекущиеНастройки["ИмяРеквизитаФлажок"];
		
		Если (ИмяЭлемента = ИмяРеквизитаСсылка) ИЛИ (ИмяЭлемента = ИмяРеквизитаФлажок) Тогда
			Возврат ТекущиеНастройки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецОбласти
 