#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
Процедура СформироватьОписаниеДокументовСТабличнымиЧастями(Форма, Описание) Экспорт
	
	ПроверкаКонтрагентов.ДополнитьОписаниеТабличныхЧастей(
	Форма, Описание, "Начисления", "НачисленияКонтрагент", "");

КонецПроцедуры
// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

Функция СуммыДоходаДляСтроки(Организация, ИФО, Дата, ДанныеСтроки) Экспорт
	
	СуммыДохода = Новый Структура("Доход, Зачтено", 0, 0);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОборотыДтКт.СуммаОборот, 0) КАК СуммаОборот,
	|	0 КАК СуммаВыпадающая
	|ПОМЕСТИТЬ СуммыДоходовПредв
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			,
	|			,
	|			,
	|			СчетДт = &СчетРасчеты,
	|			,
	|			СчетКт = &СчетДоходы,
	|			,
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И КПСДт = &КПС
	|				И КПСКт = &КПС
	|				И СубконтоДт1 = &Контрагент
	|				И СубконтоДт2 = &Договор
	|				И КЭККт = &КЭКРасчетов) КАК ЖурналПроводокЕПСБУОборотыДтКт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	-ЕСТЬNULL(ЖурналПроводокЕПСБУОборотыДтКт.СуммаОборот, 0),
	|	0
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			,
	|			,
	|			,
	|			СчетДт = &СчетДоходы,
	|			,
	|			СчетКт = &СчетРасчеты,
	|			,
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И КПСДт = &КПС
	|				И КПСКт = &КПС
	|				И СубконтоКт1 = &Контрагент
	|				И СубконтоКт2 = &Договор
	|				И КЭКДт = &КЭКРасчетов) КАК ЖурналПроводокЕПСБУОборотыДтКт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОборотыДтКт.СуммаОборот, 0),
	|	0
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			,
	|			,
	|			,
	|			СчетДт = &СчетДоходыБП,
	|			,
	|			СчетКт = &СчетДоходы,
	|			,
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И КПСДт = &КПС
	|				И КПСКт = &КПС
	|				И СубконтоДт2 = &Договор
	|				И КЭККт = &КЭКРасчетов
	|				И КЭКДт = &КЭКРасчетов) КАК ЖурналПроводокЕПСБУОборотыДтКт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	-ЕСТЬNULL(ЖурналПроводокЕПСБУОборотыДтКт.СуммаОборот, 0),
	|	0
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			,
	|			,
	|			,
	|			СчетДт = &СчетДоходы,
	|			,
	|			СчетКт = &СчетДоходыБП,
	|			,
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И КПСДт = &КПС
	|				И КПСКт = &КПС
	|				И СубконтоКт2 = &Договор
	|				И КЭККт = &КЭКРасчетов
	|				И КЭКДт = &КЭКРасчетов) КАК ЖурналПроводокЕПСБУОборотыДтКт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОборотыДтКт.СуммаОборот, 0)
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			,
	|			,
	|			,
	|			СчетДт = &СчетДоходы,
	|			,
	|			СчетКт = &СчетРасчеты,
	|			,
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И КПСДт = &КПС
	|				И КПСКт = &КПС
	|				И СубконтоКт1 = &Контрагент
	|				И СубконтоКт2 = &Договор
	|				И КЭКДт = &КЭКВыпадающие) КАК ЖурналПроводокЕПСБУОборотыДтКт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(СуммыДоходовПредв.СуммаОборот) КАК СуммаОборот,
	|	СУММА(СуммыДоходовПредв.СуммаВыпадающая) КАК СуммаВыпадающая
	|ИЗ
	|	СуммыДоходовПредв КАК СуммыДоходовПредв");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИФО", ИФО);
	Запрос.УстановитьПараметр("Контрагент", ДанныеСтроки.Контрагент);
	Запрос.УстановитьПараметр("Договор", ДанныеСтроки.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("КФО", ДанныеСтроки.КФО);
	Запрос.УстановитьПараметр("КПС", ДанныеСтроки.КПС);
	Запрос.УстановитьПараметр("КЭКРасчетов", ДанныеСтроки.КОСГУ);
	Запрос.УстановитьПараметр("СчетРасчеты", ДанныеСтроки.СчетРасчетов);
	Запрос.УстановитьПараметр("СчетДоходы",  БухгалтерскийУчет.СчетПоКоду("401.10", Дата, Организация));
	Запрос.УстановитьПараметр("СчетДоходыБП", БухгалтерскийУчет.СчетПоКоду("401.40", Дата, Организация));
	Запрос.УстановитьПараметр("КЭКВыпадающие", БухгалтерскийУчетПовтИсп.КЭКПоКоду("174"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СуммыДохода.Доход = Выборка.СуммаОборот;
		СуммыДохода.Зачтено = Выборка.СуммаВыпадающая;
	КонецЕсли;
	
	Возврат СуммыДохода;
		
КонецФункции	

Функция СчетКЭКПоДоговору(Организация, ИФО, Дата, ПараметрыЗапроса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Обороты.Счет КАК Счет,
	|	Обороты.Счет.Родитель.Родитель КАК ВидДохода,
	|	Обороты.КФО КАК КФО,
	|	Обороты.ИФО КАК ИФО,
	|	Обороты.КПС КАК КПС,
	|	Обороты.Организация КАК Организация,
	|	ВЫРАЗИТЬ(Обороты.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|	ВЫРАЗИТЬ(Обороты.Субконто2 КАК Справочник.Договоры) КАК Договор
	|ПОМЕСТИТЬ ВТ_Счета
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(
	|			,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (&ГруппаСчетов),
	|			&СписокСубконто,
	|			Организация = &Организация
	|				И ИФО = &ИФО
	|				И КФО В (&СписокКФО)
	|				И КПС В (&СписокКПС)
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты) В (&СписокКонтрагентов)
	|				И ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры) В (&СписокДоговоров),
	|			,
	|			) КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(Обороты.Субконто1 КАК Справочник.Контрагенты),
	|	ВЫРАЗИТЬ(Обороты.Субконто2 КАК Справочник.Договоры),
	|	Обороты.Организация,
	|	Обороты.ИФО,
	|	Обороты.Счет,
	|	Обороты.КПС,
	|	Обороты.Счет.Родитель.Родитель,
	|	Обороты.КФО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Счета.Организация КАК Организация,
	|	ВТ_Счета.Контрагент КАК Контрагент,
	|	ВТ_Счета.Договор КАК Договор,
	|	ВТ_Счета.КФО КАК КФО,
	|	ВТ_Счета.ИФО КАК ИФО,
	|	ВТ_Счета.КПС КАК КПС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Счета.Счет) КАК КоличествоСчетов
	|ПОМЕСТИТЬ ВТ_КолСчетов
	|ИЗ
	|	ВТ_Счета КАК ВТ_Счета
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Счета.КПС,
	|	ВТ_Счета.ИФО,
	|	ВТ_Счета.Организация,
	|	ВТ_Счета.Контрагент,
	|	ВТ_Счета.Договор,
	|	ВТ_Счета.КФО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КПС,
	|	ИФО,
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	КФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Счета.Организация КАК Организация,
	|	ВТ_Счета.КФО КАК КФО,
	|	ВТ_Счета.ИФО КАК ИФО,
	|	ВТ_Счета.КПС КАК КПС,
	|	ВТ_Счета.Контрагент КАК Контрагент,
	|	ВТ_Счета.Счет КАК СчетРасчетов,
	|	ВТ_Счета.Договор КАК ДоговорКонтрагента,
	|	ВТ_Счета.ВидДохода КАК ВидДохода,
	|	ЕСТЬNULL(СоответствияАналитическихСчетовКЭК.КЭК, ЗНАЧЕНИЕ(справочник.косгу.пустаяссылка)) КАК КОСГУ
	|ИЗ
	|	ВТ_Счета КАК ВТ_Счета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияАналитическихСчетовКЭК КАК СоответствияАналитическихСчетовКЭК
	|		ПО ВТ_Счета.Счет = СоответствияАналитическихСчетовКЭК.Счет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КолСчетов КАК ВТ_КолСчетов
	|		ПО ВТ_Счета.КПС = ВТ_КолСчетов.КПС
	|			И ВТ_Счета.ИФО = ВТ_КолСчетов.ИФО
	|			И ВТ_Счета.Организация = ВТ_КолСчетов.Организация
	|			И ВТ_Счета.Контрагент = ВТ_КолСчетов.Контрагент
	|			И ВТ_Счета.Договор = ВТ_КолСчетов.Договор
	|			И ВТ_Счета.КФО = ВТ_КолСчетов.КФО
	|ГДЕ
	|	ВТ_КолСчетов.КоличествоСчетов = 1";
	
	СписокСубконто = Новый СписокЗначений;
	СписокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	СписокСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	
	ГруппаСчетов = Новый СписокЗначений;
	ГруппаСчетов.Добавить(БухгалтерскийУчет.СчетПоКоду("205.00", Дата, Организация));
	ГруппаСчетов.Добавить(БухгалтерскийУчет.СчетПоКоду("209.00", Дата, Организация));
	
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ИФО",					ИФО);
	Запрос.УстановитьПараметр("СписокКФО",			ПараметрыЗапроса.КФО);
	Запрос.УстановитьПараметр("КонецПериода",		КонецДня(Дата));
	Запрос.УстановитьПараметр("СписокКПС",			ПараметрыЗапроса.КПС);
	Запрос.УстановитьПараметр("СписокКонтрагентов",	ПараметрыЗапроса.Контрагенты);
	Запрос.УстановитьПараметр("СписокДоговоров",	ПараметрыЗапроса.Договоры);
	Запрос.УстановитьПараметр("ГруппаСчетов",		ГруппаСчетов);
	Запрос.УстановитьПараметр("СписокСубконто",		СписокСубконто);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ВедомостьВыпадающихДоходов";
	КомандаПечати.Идентификатор		= "Форма0510838";
	КомандаПечати.Представление		= НСтр("ru = 'Ведомость выпадающих доходов (ф. 0510838)'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0510838") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
		"Форма0510838",
		НСтр("ru = 'Ведомость выпадающих доходов (ф. 0510838)'"),
		ПечатьВедомостьНачислений(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПечатьВедомостьНачислений(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)   
	
	ОбщиеСведения = УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВедомостьВыпадающихДоходов.Ссылка КАК Ссылка,
	|	ВедомостьВыпадающихДоходов.Номер КАК Номер,
	|	ВедомостьВыпадающихДоходов.Дата КАК ДатаДок,
	|	ВедомостьВыпадающихДоходов.ВидРегламентирующегоДокумента КАК ВидРегламентирующегоДокумента,
	|	ВедомостьВыпадающихДоходов.ДатаРегламентирующегоДокумента КАК ДатаРегламентирующегоДокумента,
	|	ВедомостьВыпадающихДоходов.НомерРегламентирующегоДокумента КАК НомерРегламентирующегоДокумента,
	|	ВедомостьВыпадающихДоходов.СтатьяРегламентирующегоДокумента КАК СтатьяРегламентирующегоДокумента
	|ИЗ
	|	Документ.ВедомостьВыпадающихДоходов КАК ВедомостьВыпадающихДоходов
	|ГДЕ
	|	ВедомостьВыпадающихДоходов.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВедомостьВыпадающихДоходовНачисления.Ссылка КАК Ссылка,
	|	ВедомостьВыпадающихДоходовНачисления.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВедомостьВыпадающихДоходовНачисления.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА ВедомостьВыпадающихДоходовНачисления.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|		КОГДА ВедомостьВыпадающихДоходовНачисления.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				И ВедомостьВыпадающихДоходовНачисления.Контрагент.ЮридическоеФизическоеЛицо.ОГРНИП = """"
	|			ТОГДА ВедомостьВыпадающихДоходовНачисления.Контрагент.ЮридическоеФизическоеЛицо.Наименование
	|		КОГДА ВедомостьВыпадающихДоходовНачисления.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				И НЕ ВедомостьВыпадающихДоходовНачисления.Контрагент.ЮридическоеФизическоеЛицо.ОГРНИП = """"
	|			ТОГДА ВедомостьВыпадающихДоходовНачисления.Контрагент.НаименованиеСокращенное
	|		ИНАЧЕ ВедомостьВыпадающихДоходовНачисления.Контрагент.Наименование
	|	КОНЕЦ КАК Контрагент,
	|	ВедомостьВыпадающихДоходовНачисления.ИдентификаторПлательщика КАК ИдентификаторПлательщика,
	|	ВедомостьВыпадающихДоходовНачисления.ДоговорКонтрагента.УИН КАК УникальныйИдентификаторНачисления,
	|	ВедомостьВыпадающихДоходовНачисления.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	ВедомостьВыпадающихДоходовНачисления.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	ВедомостьВыпадающихДоходовНачисления.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	ВедомостьВыпадающихДоходовНачисления.КПС.Код КАК КПС,
	|	ВедомостьВыпадающихДоходовНачисления.КФО КАК КФО,
	|	ВедомостьВыпадающихДоходовНачисления.Валюта.Код КАК КодОКВ,
	|	ВедомостьВыпадающихДоходовНачисления.СуммаВВалюте КАК СуммаВВалюте,
	|	ВедомостьВыпадающихДоходовНачисления.Сумма КАК Сумма,
	|	ВедомостьВыпадающихДоходовНачисления.ОсобыеОтметки КАК ОсобыеОтметки,
	|	ВедомостьВыпадающихДоходовНачисления.ВидПодтверждающегоДокумента КАК ВидПодтверждающегоДокумента,
	|	ВедомостьВыпадающихДоходовНачисления.ДатаПодтверждающегоДокумента КАК ДатаПодтверждающегоДокумента,
	|	ВедомостьВыпадающихДоходовНачисления.НомерПодтверждающегоДокумента КАК НомерПодтверждающегоДокумента,
	|	ВедомостьВыпадающихДоходовНачисления.КлючСтроки КАК КлючСтроки
	|ИЗ
	|	Документ.ВедомостьВыпадающихДоходов.Начисления КАК ВедомостьВыпадающихДоходовНачисления
	|ГДЕ
	|	ВедомостьВыпадающихДоходовНачисления.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	КлючСтроки,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВедомостьВыпадающихДоходовГруппыУчета.Ссылка КАК Ссылка,
	|	ВедомостьВыпадающихДоходовГруппыУчета.НомерСтроки КАК НомерСтроки,
	|	ВедомостьВыпадающихДоходовГруппыУчета.ГруппаУчета.Наименование КАК ГруппаУчета,
	|	ВедомостьВыпадающихДоходовГруппыУчета.КлючСтроки КАК КлючСтроки
	|ИЗ
	|	Документ.ВедомостьВыпадающихДоходов.ГруппыУчета КАК ВедомостьВыпадающихДоходовГруппыУчета
	|ГДЕ
	|	ВедомостьВыпадающихДоходовГруппыУчета.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки,
	|	КлючСтроки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		
	Результат = Запрос.ВыполнитьПакет();
	Выборка 	= Результат[0].Выбрать();	
	Начисления 	= Результат[1].Выгрузить();
	ГруппыУчета	= Результат[2].Выгрузить();

	
	Начисления.Колонки.Добавить("КБК", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20)));
	Начисления.Колонки.Добавить("НомерНаПечать", Новый ОписаниеТипов("Строка"));
			
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ВедомостьВыпадающихДоходов_ПФ_MXL_Форма0510838";
    	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВедомостьВыпадающихДоходов.ПФ_MXL_Форма0510838");
	
	ОбластьМакетаШапка         	= Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаЗаголовок_2   	= Макет.ПолучитьОбласть("Заголовок_2");
	ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
		
	ПервыйДокумент = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
        ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;  
		
		ОбщиеСведенияОрг =  ОбщиеСведения.Получить(Выборка.Ссылка);  
		Если ОбщиеСведенияОрг = Неопределено Тогда
			ОбщиеСведенияОрг = Новый Структура; 
		КонецЕсли;	
		
		СтруктураДанных = Новый Структура;
				
		// для печати даты в виде "__" ________ 20__ г.
		СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(Выборка.ДатаДок);
        СтруктураДанных.Вставить("ЧислоДаты", СтруктураДаты.Число);	
		СтруктураДанных.Вставить("МесяцДаты", СтруктураДаты.Месяц);
		СтруктураДанных.Вставить("ГодДаты", СтруктураДаты.Год);    
		
		// реквизиты, требующие преобразования
		СтруктураДанных.Вставить("НомерДок", ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(Выборка.Ссылка, Выборка.Номер));

		ОбластьМакетаШапка.Параметры.Заполнить(Выборка);
		ОбластьМакетаШапка.Параметры.Заполнить(СтруктураДанных);  
		ОбластьМакетаШапка.Параметры.Заполнить(ОбщиеСведенияОрг); 
		
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
				
		СтрокиНачислений = Начисления.Скопировать(Новый Структура("Ссылка", Выборка.Ссылка));
		СтрокиГрупп = ГруппыУчета.Скопировать(Новый Структура("Ссылка", Выборка.Ссылка));

		ДлинаНомераГр = ?(СтрокиГрупп.Количество() =0, 0, СтрДлина(Строка(СтрокиГрупп.Количество())));
		ДлинаНомераСтр = СтрДлина(Строка(СтрокиНачислений.Количество()));
		
		Если НЕ ДлинаНомераГр = 0 Тогда
			ФорматНомераГр = "ЧЦ=" + Строка(Макс(ДлинаНомераГр, 2)) + "; ЧДЦ=0; ЧВН=; ЧГ=0";
			ФорматНомераСтр = "ЧЦ=" + Строка(Макс(ДлинаНомераСтр, 2)) + "; ЧДЦ=0; ЧВН=; ЧГ=0";
		Иначе
			ФорматНомераСтр = "ЧЦ=" + Строка(Макс(ДлинаНомераСтр, 4)) + "; ЧДЦ=0; ЧВН=; ЧГ=0";
		КонецЕсли;
				
		Если СтрокиГрупп.Количество() = 0 Тогда
			Группа = СтрокиГрупп.Добавить();
			Группа.КлючСтроки = "";
		КонецЕсли;	 
		
		Для Каждого Группа Из СтрокиГрупп Цикл
			
			СтрокиДокумента = СтрокиНачислений.Скопировать(Новый Структура("КлючСтроки", Группа.КлючСтроки));
			ОбластьМакетаЗаголовок_1   		= Макет.ПолучитьОбласть("Заголовок_1");
			ОбластьМакетаЗаголовок_1.Параметры.Заполнить(Группа);
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок_1);
			ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок_2);
			
			Для Каждого СтрокаДок Из СтрокиДокумента Цикл
				
				СтрокаДок.КБК = ?(ЗначениеЗаполнено(ОбщиеСведенияОрг.ГлаваБК), ОбщиеСведенияОрг.ГлаваБК, "000") + СтрокаДок.КПС;
				
				Если НЕ ЗначениеЗаполнено(СтрокаДок.КодОКВ) Тогда
					СтрокаДок.КодОКВ = "643";
				КонецЕсли;
				
				СтрокаДок.НомерНаПечать = ?(НЕ ДлинаНомераГр = 0, Формат(Группа.НомерСтроки, ФорматНомераГр), "")
				+ Формат(СтрокаДок.НомерСтроки, ФорматНомераСтр);
				
				ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
				
				ОбластьМакетаСтрока.Параметры.Заполнить(СтрокаДок);
				
				ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
				
			КонецЦикла;
			
			ОбластьМакетаИтого = Макет.ПолучитьОбласть("Итого");
			ОбластьМакетаИтого.Параметры.Заполнить(Новый Структура("Сумма", СтрокиДокумента.Итог("Сумма")));
			ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
			
			СтрокиДокумента.Свернуть("КБК", "Сумма");
			Для Каждого СтрКБК Из  СтрокиДокумента Цикл
				ОбластьМакетаПоКД = Макет.ПолучитьОбласть("ПоКД");
				ОбластьМакетаПоКД.Параметры.Заполнить(СтрКБК);
				ТабличныйДокумент.Вывести(ОбластьМакетаПоКД);
			КонецЦикла;
			
			ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
			
		КонецЦикла;
		
		Файлы = УправлениеПечатьюБГУ.ПолучитьСписокФайловДокумента(Выборка.Ссылка);
		Для Каждого Приложение Из Файлы Цикл
			ОбластьМакетаПриложение = Макет.ПолучитьОбласть("Приложение");
			ОбластьМакетаПриложение.Параметры.Заполнить(Приложение);
			ТабличныйДокумент.Вывести(ОбластьМакетаПриложение);
		КонецЦикла;
		
		ОбластьМакетаПодписи = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакетаПодписи.Параметры.Заполнить(ОбщиеСведенияОрг);
		ТабличныйДокумент.Вывести(ОбластьМакетаПодписи);
		
		// В табличном документе зададим имя области, в которую был выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
		"Организация,ИФО,Дата");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	Запрос.УстановитьПараметр("ИспользоватьВалютныйУчет", ИспользоватьВалютныйУчет);
	
	Если ДополнительныеСвойства.ИспользоватьОтдельнуюДатуПроведенияДокументов
		И ЗначениеЗаполнено(ДополнительныеСвойства.УстановленнаяДатаПроведения) Тогда
		Запрос.УстановитьПараметр("ДатаПроведения", ДополнительныеСвойства.УстановленнаяДатаПроведения);
	Иначе
		Запрос.УстановитьПараметр("ДатаПроведения", ЗначенияРеквизитов.Дата);
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	
	ИспользоватьКонтрольИсполненияДоговоров = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров");
	Если ИспользоватьКонтрольИсполненияДоговоров Тогда
		
		НомераТаблиц.Вставить("ОплатаОтПокупателейДебиторов", НомераТаблиц.Количество());
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ВедомостьВыпадающихДоходов.ОплатитьДо КАК Период,
		|	ВедомостьВыпадающихДоходов.Ссылка.Организация КАК Организация,
		|	ВедомостьВыпадающихДоходов.Контрагент КАК Контрагент,
		|	ВедомостьВыпадающихДоходов.ДоговорКонтрагента КАК Договор,
		|	ВедомостьВыпадающихДоходов.СчетРасчетов КАК СчетРасчетов,
		|	ВедомостьВыпадающихДоходов.ВидРасчетов КАК ВидРасчетов,
		|	ВЫБОР
		|		КОГДА НЕ &ИспользоватьВалютныйУчет
		|				ИЛИ ВедомостьВыпадающихДоходов.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ТОГДА &ВалютаРеглУчета
		|		ИНАЧЕ ВедомостьВыпадающихДоходов.Валюта
		|	КОНЕЦ КАК Валюта,
		|	ВедомостьВыпадающихДоходов.Ссылка.ИФО КАК ИФО,
		|	ВедомостьВыпадающихДоходов.КФО КАК КФО,
		|	ВедомостьВыпадающихДоходов.КПС КАК КПС,
		|	ВедомостьВыпадающихДоходов.КОСГУ КАК КЭК,
		|	ЗНАЧЕНИЕ(Справочник.ДополнительнаяБюджетнаяКлассификация.ПустаяСсылка) КАК ДопКлассификация,
		|	ЗНАЧЕНИЕ(Справочник.Мероприятия.ПустаяСсылка) КАК КодМероприятия,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЦелевыхСредств.ПустаяСсылка) КАК КодЦели,
		|	ВедомостьВыпадающихДоходов.ОплатитьДо КАК ОплатитьДо,
		|	ВЫБОР
		|		КОГДА НЕ &ИспользоватьВалютныйУчет
		|				ИЛИ ВедомостьВыпадающихДоходов.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|				ИЛИ ВедомостьВыпадающихДоходов.Валюта = &ВалютаРеглУчета
		|			ТОГДА -1 * ВедомостьВыпадающихДоходов.Сумма
		|		ИНАЧЕ -1 * ВедомостьВыпадающихДоходов.СуммаВВалюте
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	Документ.ВедомостьВыпадающихДоходов.Начисления КАК ВедомостьВыпадающихДоходов
		|ГДЕ
		|	ВедомостьВыпадающихДоходов.Ссылка = &Ссылка
		|	И ВедомостьВыпадающихДоходов.ДоговорКонтрагента.ВестиГрафикПлатежей
		|	И ВедомостьВыпадающихДоходов.АвтоматическиОтразитьВГрафикахИсполненияДоговоров";
		
		НомераТаблиц.Вставить("ИсполнениеДоговоровСПокупателями", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&ДатаПроведения КАК Период,
		|	ВедомостьВыпадающихДоходов.Ссылка.Организация КАК Организация,
		|	ВедомостьВыпадающихДоходов.Контрагент КАК Контрагент,
		|	ВедомостьВыпадающихДоходов.ДоговорКонтрагента КАК Договор,
		|	ВедомостьВыпадающихДоходов.СчетРасчетов КАК СчетРасчетов,
		|	ВЫБОР
		|		КОГДА НЕ &ИспользоватьВалютныйУчет
		|				ИЛИ ВедомостьВыпадающихДоходов.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ТОГДА &ВалютаРеглУчета
		|		ИНАЧЕ ВедомостьВыпадающихДоходов.Валюта
		|	КОНЕЦ КАК Валюта,
		|	ВедомостьВыпадающихДоходов.Ссылка.ИФО КАК ИФО,
		|	ВедомостьВыпадающихДоходов.КФО КАК КФО,
		|	ВедомостьВыпадающихДоходов.КПС КАК КПС,
		|	ВедомостьВыпадающихДоходов.КОСГУ КАК КЭК,
		|	&ДатаПроведения КАК ИсполнитьДо,
		|	ВЫБОР
		|		КОГДА НЕ &ИспользоватьВалютныйУчет
		|				ИЛИ ВедомостьВыпадающихДоходов.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|				ИЛИ ВедомостьВыпадающихДоходов.Валюта = &ВалютаРеглУчета
		|			ТОГДА -1 * ВедомостьВыпадающихДоходов.Сумма
		|		ИНАЧЕ -1 * ВедомостьВыпадающихДоходов.СуммаВВалюте
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	Документ.ВедомостьВыпадающихДоходов.Начисления КАК ВедомостьВыпадающихДоходов
		|ГДЕ
		|	ВедомостьВыпадающихДоходов.Ссылка = &Ссылка
		|	И ВедомостьВыпадающихДоходов.ДоговорКонтрагента.ВестиПланГрафикИсполнения
		|	И ВедомостьВыпадающихДоходов.АвтоматическиОтразитьВГрафикахИсполненияДоговоров
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
		|	&ДатаПроведения,
		|	ВедомостьВыпадающихДоходов.Ссылка.Организация,
		|	ВедомостьВыпадающихДоходов.Контрагент,
		|	ВедомостьВыпадающихДоходов.ДоговорКонтрагента,
		|	ВедомостьВыпадающихДоходов.СчетРасчетов,
		|	ВЫБОР
		|		КОГДА НЕ &ИспользоватьВалютныйУчет
		|				ИЛИ ВедомостьВыпадающихДоходов.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ТОГДА &ВалютаРеглУчета
		|		ИНАЧЕ ВедомостьВыпадающихДоходов.Валюта
		|	КОНЕЦ,
		|	ВедомостьВыпадающихДоходов.Ссылка.ИФО,
		|	ВедомостьВыпадающихДоходов.КФО,
		|	ВедомостьВыпадающихДоходов.КПС,
		|	ВедомостьВыпадающихДоходов.КОСГУ,
		|	&ДатаПроведения,
		|	ВЫБОР
		|		КОГДА НЕ &ИспользоватьВалютныйУчет
		|				ИЛИ ВедомостьВыпадающихДоходов.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|				ИЛИ ВедомостьВыпадающихДоходов.Валюта = &ВалютаРеглУчета
		|			ТОГДА -1 * ВедомостьВыпадающихДоходов.Сумма
		|		ИНАЧЕ -1 * ВедомостьВыпадающихДоходов.СуммаВВалюте
		|	КОНЕЦ
		|ИЗ
		|	Документ.ВедомостьВыпадающихДоходов.Начисления КАК ВедомостьВыпадающихДоходов
		|ГДЕ
		|	ВедомостьВыпадающихДоходов.Ссылка = &Ссылка
		|	И ВедомостьВыпадающихДоходов.ДоговорКонтрагента.ВестиПланГрафикИсполнения
		|	И ВедомостьВыпадающихДоходов.АвтоматическиОтразитьВГрафикахИсполненияДоговоров";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		
		Результат = Запрос.ВыполнитьПакет();
		
		ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(ДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
		БухгалтерскийУчет.УстановитьПериодВТаблицахДляПроведения(ДополнительныеСвойства.ТаблицыДляДвижений, ДокументСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Документ.ВедомостьВыпадающихДоходов";
	МетаданныеДокумента = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъекта);
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			ПредставлениеОбъекта = Строка(Выборка.Ссылка);
			Блокировка = Новый БлокировкаДанных;
			Элемент = Блокировка.Добавить(ПолноеИмяОбъекта);
			Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если Объект = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			Иначе
				Объект.Заблокировать();
				Для Каждого СтрокаТЧ Из Объект.Начисления Цикл
					СтрокаТЧ.ВидДохода = Объект.УдалитьКорСчет;
				КонецЦикла;
				
				Если Объект.Модифицированность() Тогда
					ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
				Иначе
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
				КонецЕсли;
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать объект: %Документ% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ПредставлениеОбъекта);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(
						Выборка.Ссылка,
						ПредставлениеОбъекта,
						ТекстСообщения,
						УровеньЖурналаРегистрации.Предупреждение);
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			// Прервать текущую итерацию цикла, чтобы не увеличивать счетчик обработанных объектов.
			Продолжить;
			
		КонецПопытки;
		
		ОбъектовОбработано = ОбъектовОбработано + 1;
		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтрШаблон(
					НСтр("ru = 'Не удалось обработать некоторые документы ""%1"" (пропущены): %2'"),
					МетаданныеДокумента.Синоним,
					ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(
						МетаданныеДокумента,
						МетаданныеДокумента.Синоним,
						СтрШаблон(НСтр("ru = 'Обработана очередная порция документов ""%1"": %2'"), МетаданныеДокумента.Синоним, ОбъектовОбработано),
						УровеньЖурналаРегистрации.Информация);
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВедомостьВыпадающихДоходовНачисления.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВедомостьВыпадающихДоходов.Начисления КАК ВедомостьВыпадающихДоходовНачисления
	|ГДЕ
	|	ВедомостьВыпадающихДоходовНачисления.ВидДохода = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)";
	
	РегистрируемыеСсылки = Новый Массив;
	КоличествоСсылок = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РегистрируемыеСсылки.Добавить(Выборка.Ссылка);
		КоличествоСсылок = КоличествоСсылок + 1;
		
		Если КоличествоСсылок = 1000 Тогда
			ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, РегистрируемыеСсылки);
			РегистрируемыеСсылки.Очистить();
			КоличествоСсылок = 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Если РегистрируемыеСсылки.Количество() > 0 Тогда
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, РегистрируемыеСсылки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#КонецЕсли
