
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ЗаполнитьПоДаннымОрганизации();
		
	Иначе
		
		Если Объект.КодБезРазделительныхТочек Тогда
			
			КодГРБС 				= Лев(Объект.Код, 3);
			КодРПБС 				= Сред(Объект.Код, 4, 8);
			ГодСведений 			= Сред(Объект.Код, 12, 2);
			ТипМероприятия 			= Сред(Объект.Код, 14, 1);
			НомерИВерсияМероприятия = Сред(Объект.Код, 15);
			
		Иначе	
			
			СоставКода = СтрРазделить(Объект.Код, ".", Истина);
			
			Если СоставКода.Количество() = 6 Тогда
				
				КодГРБС 			= СоставКода[0];
				КодРПБС 			= СоставКода[1];
				ГодСведений 		= СоставКода[2];
				ТипМероприятия 		= СоставКода[3];
				НомерМероприятия 	= СоставКода[4];
				НомерВерсии  		= СоставКода[5];
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
	УстановитьВидимостьЭлементов(ЭтотОбъект, Объект.КодБезРазделительныхТочек);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.КодБезРазделительныхТочек Тогда
		
		ТекущийОбъект.Код = КодГРБС + КодРПБС + ГодСведений + ТипМероприятия + НомерИВерсияМероприятия;
		
	Иначе	
		
		ТекущийОбъект.Код = КодГРБС + "." + КодРПБС + "." + ГодСведений + "." + ТипМероприятия + "." + НомерМероприятия + "." + НомерВерсии;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ЗаполнитьПоДаннымОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура КодГРБСПриИзменении(Элемент)
	КодГРБС = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(КодГРБС, 3, "0");
КонецПроцедуры

&НаКлиенте
Процедура КодРПБСПриИзменении(Элемент)
	КодРПБС = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(КодРПБС, 8, "0");
КонецПроцедуры

&НаКлиенте
Процедура ГодСведенийПриИзменении(Элемент)
	ГодСведений = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ГодСведений, 2, "0");
КонецПроцедуры

&НаКлиенте
Процедура НомерМероприятияПриИзменении(Элемент)
	НомерМероприятия = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(НомерМероприятия, 3, "0");
КонецПроцедуры

&НаКлиенте
Процедура НомерВерсииПриИзменении(Элемент)
	НомерВерсии = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(НомерВерсии, 2, "0");
КонецПроцедуры

&НаКлиенте
Процедура КодБезРазделительныхТочекПриИзменении(Элемент)
	
	Если Объект.КодБезРазделительныхТочек Тогда
		
		Если ЗначениеЗаполнено(НомерМероприятия) ИЛИ ЗначениеЗаполнено(НомерВерсии) Тогда
			
			НомерИВерсияМероприятия = НомерМероприятия + НомерВерсии;
			
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(НомерИВерсияМероприятия) Тогда
			
			НомерВерсии = Прав(НомерИВерсияМероприятия, 2);
			НомерМероприятия = Лев(НомерИВерсияМероприятия, 3);
			
		КонецЕсли;
		
	КонецЕсли;	
	
	УстановитьВидимостьЭлементов(ЭтотОбъект, Объект.КодБезРазделительныхТочек)
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоДаннымОрганизации()
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Организации.КодПоППП.Код КАК КодПоПППКод,
		|	Организации.КодПоРПБС КАК КодПоРПБС
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Владелец);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			КодГРБС = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Выборка.КодПоПППКод, 3, "0");
			КодРПБС = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Выборка.КодПоРПБС, 8, "0");
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ГодСведений) Тогда
		
		ГодСведений = Прав(Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy"), 2);
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма, БезТочек)
	
	ЭлементыФормы = Форма.Элементы;
	ЭлементыФормы.Декорация1.Видимость = НЕ БезТочек;
	ЭлементыФормы.Декорация2.Видимость = НЕ БезТочек;
	ЭлементыФормы.Декорация3.Видимость = НЕ БезТочек;
	ЭлементыФормы.Декорация4.Видимость = НЕ БезТочек;
	
	ЭлементыФормы.НомерИВерсия.ТекущаяСтраница = ?(БезТочек, ЭлементыФормы.НомерВерсия, ЭлементыФормы.НомерТочкаВерсия)
	
КонецПроцедуры	

#КонецОбласти



