

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПравилаОбмена, "ФорматОбмена", Параметры.ФорматОбмена, Истина);
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ФорматОбмена,"НаправлениеОбмена") = Перечисления.НаправлениеОбменаБанкиКС.Экспорт Тогда
		Элементы.ПравилаОбменаДопДействия.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ

&НаКлиенте
Процедура ПравилаОбменаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыборСтрокиТЧ(Элементы.ПравилаОбмена.ТекущиеДанные);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Выбрать(Команда)
	ТекСтр = Элементы.ПравилаОбмена.ТекущиеДанные;
	СтруктураДанных = Новый Структура("ПолеФайла,ОбрабатываемоеПоле");
	
	Если ТекСтр<> Неопределено Тогда
		ОбработатьВыборСтрокиТЧ(ТекСтр);
			
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбработатьВыборСтрокиТЧ(ВыбраннаяСтрока)
	
	СтруктураДанных = Новый Структура;
	
	ИмяКолонки      = СтрЗаменить(Элементы.ПравилаОбмена.ТекущийЭлемент.Имя,"ПравилаОбмена","");
	
	Если ИмяКолонки = "НомерСтроки" ИЛИ ИмяКолонки = "ПолеФайлаПередачи" Тогда
		ИмяКолонки  = "ПолеОбъекта";
	КонецЕсли;
	
	СтруктураДанных.Вставить("ОбрабатываемоеПоле", ИмяКолонки);
	СтруктураДанных.Вставить("ВыражениеВФорматеОбмена", ВыбраннаяСтрока[ИмяКолонки]);
	СтруктураДанных.Вставить("ПолеФайла", ВыбраннаяСтрока.ПолеФайлаПередачи);
	
	Если ВыбраннаяСтрока.КоличествоОдноименныхСтрок >1 Тогда
		СтруктураДанных.Вставить("НомерСтроки",ВыбраннаяСтрока.НомерСтроки);
	Иначе
		СтруктураДанных.Вставить("НомерСтроки",0);
	КонецЕсли;

	ОповеститьОВыборе(СтруктураДанных);
	
КонецПроцедуры
