
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТребуемыеДанные = Параметры.ТребуемыеДанные;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если НЕ ПустаяСтрока(ТребуемыеДанные) Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		//Если ТекущиеДанные.ЭтоГруппа Тогда
		//	Возврат;
		//КонецЕслИ;
		СтандартнаяОбработка = Ложь;
		МассивТребуемыхДанных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТребуемыеДанные, ",");
		Результат = Новый Структура("Ссылка", ВыбраннаяСтрока);
		Для каждого ТекТребуемыеДанные Из МассивТребуемыхДанных Цикл
		
			Попытка
			
				Результат.Вставить(ТекТребуемыеДанные, ТекущиеДанные[ТекТребуемыеДанные]);
			
			Исключение
			
			КонецПопытки;
		
		КонецЦикла;
		ОповеститьОвыборе(Результат);
	КонецЕсли;
КонецПроцедуры
