#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	Если Не ЭтоГруппа Тогда
		ОчиститьВключитьВСоставВнеоборотныхАктивов = Ложь;
		Если Не УправлениеМатериальнымиЗапасамиКлиентСервер.ТипНоменклатурыСоСчетомУчета(ТипНоменклатуры) Тогда
			Если ЗначениеЗаполнено(СчетУчета) Тогда
				СчетУчета = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			КонецЕсли;
			ОчиститьВключитьВСоставВнеоборотныхАктивов = Истина;
		ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.БиологическиеАктивы Тогда
			ОчиститьВключитьВСоставВнеоборотныхАктивов = Истина;
		КонецЕсли;
		Если ОчиститьВключитьВСоставВнеоборотныхАктивов Тогда
			ВключитьВСоставВнеоборотныхАктивов = Ложь;
		КонецЕсли;
		Если Не УправлениеМатериальнымиЗапасамиКлиентСервер.ТипНоменклатурыСоСтранойПроисходждения(ТипНоменклатуры) Тогда
			Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
				СтранаПроисхождения = Справочники.СтраныМира.ПустаяСсылка();
			КонецЕсли;
			Если ЗначениеЗаполнено(НомерГТД) Тогда
				НомерГТД = Справочники.НомераГТД.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.НоменклатурнаяГруппа 
			И ЗначениеЗаполнено(МетодРаспределенияСтоимостиПроизводства) Тогда
			МетодРаспределенияСтоимостиПроизводства = Перечисления.МетодыРаспределенияСтоимостиПроизводства.ПустаяСсылка();
		КонецЕсли;
		Если КомплектСПрослеживаемымиТоварами И НЕ ЗначениеЗаполнено(СтранаПроисхождения) Тогда
			СтранаПроисхождения = Справочники.СтраныМира.Россия;
		КонецЕсли;
	КонецЕсли;
	
	ПрослеживаемостьБГУ.ОбработкаИзмененияПризнаковПрослеживаемости(Отказ, ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если ЭтоГруппа Тогда
		НепроверяемыеРеквизиты.Добавить("ТипНоменклатуры");
	КонецЕсли;
		
	Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.НоменклатурнаяГруппа Тогда
		НепроверяемыеРеквизиты.Добавить("МетодРаспределенияСтоимостиПроизводства");
		НепроверяемыеРеквизиты.Добавить("ТипПроизводственнойОперации");
	КонецЕсли;
	
	Если НЕ ЭтоГруппа И ПрослеживаемыйТовар Тогда
		ПроверяемыеРеквизиты.Добавить("СтранаПроисхождения");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Перем ПереданТипНоменклатуры;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Родитель")
			И ТипЗнч(ДанныеЗаполнения.Родитель) = Тип("СправочникСсылка.Номенклатура") Тогда
			ТипНоменклатуры = ДанныеЗаполнения.Родитель.ТипНоменклатуры;
		ИначеЕсли ДанныеЗаполнения.Свойство("ТипНоменклатуры", ПереданТипНоменклатуры) Тогда
			Если ТипЗнч(ПереданТипНоменклатуры) = Тип("ПеречислениеСсылка.ТипыНоменклатуры") 
				И ЗначениеЗаполнено(ПереданТипНоменклатуры) Тогда
				ТипНоменклатуры = ПереданТипНоменклатуры;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Не ЭтоГруппа И ЗначениеЗаполнено(ТипНоменклатуры) Тогда
		СчетУчета = УправлениеМатериальнымиЗапасамиКлиентСервер.КодСчетаПоТипуНоменклатуры(ТипНоменклатуры);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если Не ЭтоГруппа Тогда
		GUIDНоменклатурыОтправителя = "";
		ОсновнаяСпецификацияНоменклатуры = Справочники.СпецификацииНоменклатуры.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли