////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>.
//  
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС



Функция ПолучитьСписокСпособовВыгрузкиДляРаботыСЭЦП() Экспорт 
	
	Результат = Новый Массив;
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайлов.Каталог"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайлов.FTP"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайлов.ЭлектроннаяПочта"));

	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайлов.WebСервис"));

	Возврат Результат;
	
КонецФункции	

// ПРОГРАММНЫЙ ИНТЕРФЕЙС



