
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияБГУ.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");
	УстановитьУсловноеОформление();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Документы.РегистрацияСтавкиНалогаНаИмущество.УстановитьУсловноеОформление(Элементы, УсловноеОформление);
	
	УправлениеОсновнымиСредствами.УсловноеОформлениеОСвСписке(
		УсловноеОформление, Элементы.ОсновноеСредство.Имя);		
		
КонецПроцедуры

#КонецОбласти