#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	

// Выполняет поиск фрагмента кода по всем справочникам классификации.
//
// Параметры
//  Код			 	- Код или фрагмент кода классификатора
//                 
//  СтруктураДанных - Уточнение поиска. Имеет свойства Ссылка,Статья,Программа
//                    где Ссылка - найденный элемент, остальные свойства - ссылки на компоненты кода.
//
// Возвращаемое значение:
//   Ссылка или Неопределено
//
Функция НайтиВКлассификации(Знач КодДляПоиска, СтруктураДанных = Неопределено, Бюджет = Неопределено, Знач ДатаАктуальности = Неопределено) Экспорт
	СтруктураДанных = Новый Структура("Ссылка, Статья, Программа");
	
	Если ДатаАктуальности = Неопределено Тогда
		ДатаАктуальности = ТекущаяДатаСеанса();
	КонецЕсли;	 
	
	Код = Лев(СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СтрЗаменить(КодДляПоиска, " ", ""), 10, "0", "Справа"), 10);
	КодСтатьи  		= Лев(Код,5);
	КодПрограммы	= Сред(Код,6);
	
	Если Не ПустаяСтрока(КодСтатьи) Тогда
		ТекстУпорядочить = "";
		МассивБюджетов = Неопределено;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Спр.Ссылка";
		// Отбор по бюджету.
		Если ЗначениеЗаполнено(Бюджет) Тогда
			МассивБюджетов = БюджетнаяКлассификация.МассивВышестоящихБюджетов(Бюджет);
			Запрос.Текст = Запрос.Текст + "
			|   ,
			|	ВЫБОР
			|		КОГДА Спр.Бюджет = &Бюджет
			|			ТОГДА 2
			|		КОГДА Спр.Бюджет В (&МассивБюджетов)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Приоритет";
			
			Запрос.УстановитьПараметр("Бюджет", Бюджет);
			Запрос.УстановитьПараметр("МассивБюджетов", МассивБюджетов);
			ТекстУпорядочить = "
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет УБЫВ";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|
		|ИЗ
		|	Справочник.ЦелевыеСтатьиКРБ КАК Спр
		|ГДЕ
		|	Спр.Код ПОДОБНО &КодСтатьи";
		// Отбор по дате.
		Если ЗначениеЗаполнено(ДатаАктуальности) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И Спр.ДатаНачалаДействия <= &ДатаАктуальности
			|	И Спр.ДатаОкончанияДействия >= &ДатаАктуальности";
			Запрос.УстановитьПараметр("ДатаАктуальности",ДатаАктуальности);
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + ТекстУпорядочить;
		Запрос.УстановитьПараметр("КодСтатьи", КодСтатьи+"%");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтруктураДанных.Статья = Выборка.Ссылка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(КодПрограммы) И НЕ Сред(Код,6) = "00000" Тогда
			СтруктураДанных.Программа = НайтиПрограмму(СтруктураДанных.Статья, КодПрограммы, КодСтатьи, Бюджет, ДатаАктуальности, МассивБюджетов);
			Если СтруктураДанных.Программа = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;	
			СтруктураДанных.Ссылка = СтруктураДанных.Программа;
			Возврат СтруктураДанных.Ссылка;
		Иначе
			СтруктураДанных.Ссылка = СтруктураДанных.Статья;
			Возврат СтруктураДанных.Ссылка;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // НайтиВКлассификации()

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Метаданные.Справочники.ЦелевыеСтатьиКРБ.СтандартныеРеквизиты.Код.Имя);
	
	БюджетнаяКлассификацияПереопределяемый.ПолучитьБлокируемыеРеквизитыОбъекта(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	БюджетнаяКлассификация.ОбработкаПолученияДанныхВыбораБюджетнойКлассификации(ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиПрограмму(Статья, КодПрограммы, КодСтатьи, Бюджет, ДатаАктуальности, МассивБюджетов)
	
	ПодобиеКода = КодПрограммы + "%";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Спр.Ссылка";
	
	Если ЗначениеЗаполнено(Бюджет) Тогда
		Запрос.Текст = Запрос.Текст + "
		|   ,
		|	ВЫБОР
		|		КОГДА Спр.Бюджет = &Бюджет И Спр.ЦелеваяСтатья = &ЦелеваяСтатья
		|			ТОГДА 5
		|		КОГДА Спр.Бюджет В (&МассивБюджетов) И Спр.ЦелеваяСтатья = &ЦелеваяСтатья
		|			ТОГДА 4
		|		КОГДА Спр.Бюджет = &Бюджет И Спр.ЦелеваяСтатья = Значение(Справочник.ЦелевыеСтатьиКРБ.ПустаяСсылка)
		|			ТОГДА 3
		|		КОГДА Спр.Бюджет В (&МассивБюджетов) И Спр.ЦелеваяСтатья = Значение(Справочник.ЦелевыеСтатьиКРБ.ПустаяСсылка)
		|			ТОГДА 2
		|		КОГДА Спр.ЦелеваяСтатья = Значение(Справочник.ЦелевыеСтатьиКРБ.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приоритет";
		Запрос.УстановитьПараметр("Бюджет", Бюджет);
		Запрос.УстановитьПараметр("МассивБюджетов", МассивБюджетов);
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|   ,
		|	ВЫБОР
		|		КОГДА Спр.ЦелеваяСтатья = &ЦелеваяСтатья
		|			ТОГДА 2
		|		КОГДА Спр.ЦелеваяСтатья = Значение(Справочник.ЦелевыеСтатьиКРБ.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Приоритет";
	КонецЕсли;
	Запрос.УстановитьПараметр("ЦелеваяСтатья", Статья);
	
	Запрос.Текст = Запрос.Текст + "
	|
	|ИЗ
	|	Справочник.ПрограммыЦелевыхСтатейКРБ КАК Спр
	|ГДЕ
	|	Спр.Код ПОДОБНО &КодПрограммы";
	Запрос.УстановитьПараметр("КодПрограммы", ПодобиеКода);
	
	// Отбор по дате.
	Если ЗначениеЗаполнено(ДатаАктуальности) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Спр.ДатаНачалаДействия <= &ДатаАктуальности
		|	И Спр.ДатаОкончанияДействия >= &ДатаАктуальности";
		Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции			

#КонецОбласти

#КонецЕсли