
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НормативСуммовой = Запись.Сумма > 0;
	
	УправлениеВидимостьюЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи); 
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НормативСуммовойПриИзменении(Элемент)
	
	Если НормативСуммовой Тогда
		Запись.Категория = "";
	Иначе
		Запись.Сумма = "";
		Запись.Валюта = "";
	КонецЕсли;
	
	УправлениеВидимостьюЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СтранаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Страна) И Запись.Страна <> ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда
		Запись.КатегорияДолжностиГосударственнойСлужбы = "";
		Запись.ГруппаДолжностиГосударственнойСлужбы = "";
	КонецЕсли;
	
	УправлениеВидимостьюЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Запись.ВидДоговора)
		ИЛИ Запись.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровССотрудниками.КонтрактГосслужащего") Тогда
		Запись.КатегорияДолжностиГосударственнойСлужбы = "";
		Запись.ГруппаДолжностиГосударственнойСлужбы = "";
	КонецЕсли;
	
	УправлениеВидимостьюЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостьюЭлементов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Категория", "Видимость", Не НормативСуммовой);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаВалюта", "Видимость", НормативСуммовой);
	
	ЭтоКонтрактГосслужащего = Запись.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровССотрудниками.КонтрактГосслужащего");
	
	Если Не ЗначениеЗаполнено(Запись.Страна) ИЛИ Запись.Страна = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда
		СтранаРоссия = Истина;
	Иначе
		СтранаРоссия = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "КатегорияДолжностиГосударственнойСлужбы", "Видимость", ЭтоКонтрактГосслужащего И СтранаРоссия);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаДолжностиГосударственнойСлужбы", "Видимость", ЭтоКонтрактГосслужащего И СтранаРоссия);
	
КонецПроцедуры

#КонецОбласти
