#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем    

Процедура ЗаполнитьОтветственныхЛиц(КонтрагентСсылка, ТаблицаОтветственных) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ОтветственныеЛицаКонтрагентов.Фамилия КАК Фамилия,
	|	ОтветственныеЛицаКонтрагентов.Имя КАК Имя,
	|	ОтветственныеЛицаКонтрагентов.Отчество КАК Отчество,
	|	ОтветственныеЛицаКонтрагентов.Должность КАК Должность,
	|	ОтветственныеЛицаКонтрагентов.ДатаНазначения КАК ДатаЗаписи
	|ИЗ
	|	Справочник.ОтветственныеЛицаКонтрагентов КАК ОтветственныеЛицаКонтрагентов
	|ГДЕ
	|	ОтветственныеЛицаКонтрагентов.Владелец = &Владелец");
	
	Запрос.УстановитьПараметр("Владелец", КонтрагентСсылка);
	
	ТабСуществующих = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Ответственный Из ТаблицаОтветственных Цикл
		СтруктураПоиска = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Ответственный);	
		НайденныеСтроки = ТабСуществующих.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			// Новые данные ответственного
			НовыйЭлемент = Справочники.ОтветственныеЛицаКонтрагентов.СоздатьЭлемент();
			НовыйЭлемент.Владелец = КонтрагентСсылка;
			НовыйЭлемент.Фамилия = Ответственный.Фамилия;
			НовыйЭлемент.Имя = Ответственный.Имя; 
			НовыйЭлемент.Отчество = Ответственный.Отчество;
			НовыйЭлемент.Должность = Ответственный.Должность;
			НовыйЭлемент.ДатаНазначения = Ответственный.ДатаЗаписи;
			НовыйЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;	 
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#КонецЕсли
