
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДополнительнаяОбработкаСсылка", ОбъектСсылка);
	Параметры.Свойство("ПакетДанныхДляМСД", ПакетДанныхДляМСД);
	Если ЗначениеЗаполнено(ПакетДанныхДляМСД) Тогда
		ЗагрузитьТаблицуСоответствия(ПакетДанныхДляМСД);
		Элементы.ТаблицаСоответствияОбновитьТаблицуСоответствия.Доступность = Истина;	
	КонецЕсли;	
	
	СРасшифровкойБГУ = Истина;
	СпособСравнения = 1;
	ТолькоСОтклонением = Истина;
	
	ОбработкаВКонфигурации = ВРег(СтрРазделить(ИмяФормы, ".")[0]) = "ОБРАБОТКА";
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ПолноеИмяОбъекта = ОбъектОбработки.Метаданные().ПолноеИмя();

	Элементы.ТаблицаСоответствияОбновитьТаблицуСоответствия.Доступность = ЗначениеЗаполнено(ПакетДанныхДляМСД);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СверкаУчетныхДанных_РасшифровкаТабличногоДокумента" Тогда
		
		РасшифровкаТабличногоДокумента(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособСравненияПриИзменении(Элемент)
	Элементы.ПакетДанныхДляМСД.Видимость = СпособСравнения;
КонецПроцедуры

&НаКлиенте
Процедура ПакетДанныхДляМСДПриИзменении(Элемент)
	ЗагрузитьТаблицуСоответствия(ПакетДанныхДляМСД);
	Элементы.ТаблицаСоответствияОбновитьТаблицуСоответствия.Доступность = ЗначениеЗаполнено(ПакетДанныхДляМСД);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ПроизвестиСверкуБГУ(Команда)
	
	Если СпособСравнения И Не ЗначениеЗаполнено(ПакетДанныхДляМСД) Тогда
		ТекстСообщения = НСтр("ru = 'Выберите пакет данных для МСД.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Попытка
		
		АдресРасшифровкиПротоколаСверки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		АдресРезультатаПротокола = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		АдресТаблицаРезультат = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		
		ПараметрыВыполнения = Новый Структура;
		ПараметрыВыполнения.Вставить("АдресРасшифровкиПротоколаСверки", АдресРасшифровкиПротоколаСверки);
		ПараметрыВыполнения.Вставить("АдресРезультатаПротокола", АдресРезультатаПротокола);
		ПараметрыВыполнения.Вставить("АдресТаблицаРезультат", АдресТаблицаРезультат);
		ПараметрыВыполнения.Вставить("Период", Неопределено);
		ПараметрыВыполнения.Вставить("ОбработкаВКонфигурации", ОбработкаВКонфигурации);
		ПараметрыВыполнения.Вставить("СРасшифровкой", СРасшифровкойБГУ);
		ПараметрыВыполнения.Вставить("ТолькоСОтклонением", ТолькоСОтклонением);
		ПараметрыВыполнения.Вставить("СпособСравнения", СпособСравнения);
		
		Если Не СпособСравнения Тогда
			
			ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
			ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите файл выгрузки из БГУ'");
			ПараметрыДиалога.МножественныйВыбор = Ложь;
			ПараметрыДиалога.Фильтр = "Файл ZIP|*.zip";
			
			Обещание = Ждать ПоместитьФайлНаСерверАсинх( , , , ПараметрыДиалога, УникальныйИдентификатор);
			
			Если Обещание = Неопределено Или (Обещание <> Неопределено И Обещание.ПомещениеФайлаОтменено) Тогда
				Возврат;
			КонецЕсли;
			
			ПараметрыВыполнения.Вставить("Адрес", Обещание.Адрес);
			ПараметрыВыполнения.Вставить("ИмяАрхива", Обещание.СсылкаНаФайл.Имя);
			
		Иначе
			
			ПараметрыВыполнения.Вставить("ПакетДанныхДляМСД", ПакетДанныхДляМСД);
			
		КонецЕсли;
		
		ИмяМетода = "ПроизвестиСверкуБГУ";
		НаименованиеЗадания = НСтр("ru = 'Сопоставление файлов для вывода протокола сверки'");
		
		АдресФайлаОбработки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		
		Если Не ОбработкаВКонфигурации Тогда
			АдресФайлаОбработки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
			ПоместитьФайлНаСерверАсинх( , , АдресФайлаОбработки, ИмяФайлаОбработки(), УникальныйИдентификатор);
		Иначе
			АдресФайлаОбработки = "";
		КонецЕсли;
		
		РезультатФоновогоЗадания = ВыполнитьФоновоеЗаданиеНаСервере(АдресФайлаОбработки, ПараметрыВыполнения,
		НаименованиеЗадания, УникальныйИдентификатор);
		
		Оповещение = Новый ОписаниеОповещения("ПроизвестиСверкуБГУ_Завершено", ЭтотОбъект, ПараметрыВыполнения);
		
		МодульДлительныеОперацииКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ДлительныеОперацииКлиент");
		ПараметрыОжидания = МодульДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.Интервал = 1;
		ПараметрыОжидания.ТекстСообщения = НаименованиеЗадания;
		
		МодульДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатФоновогоЗадания, Оповещение, ПараметрыОжидания);
			
	Исключение
		
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Шаблон = НСтр("ru = 'Формирование протокола сверки завершилось с ошибкой: %1'");
		ТекстСообщения = СтрШаблон(Шаблон, ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуСоответствия(Команда)
	ЗагрузитьТаблицуСоответствия(ПакетДанныхДляМСД);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьИмяФайла(ПараметрыВыполнения)
	
	Если ПараметрыВыполнения.СпособСравнения Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПакетыДанныхДляМСДПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПакетыДанныхДляМСДПрисоединенныеФайлы КАК ПакетыДанныхДляМСДПрисоединенныеФайлы
		|ГДЕ
		|	ПакетыДанныхДляМСДПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайлов
		|	И НЕ ПакетыДанныхДляМСДПрисоединенныеФайлы.ПометкаУдаления
		|	И ПОДСТРОКА(ПакетыДанныхДляМСДПрисоединенныеФайлы.Наименование, 1, 8) <> ""Протокол""
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПакетыДанныхДляМСДПрисоединенныеФайлы.ДатаСоздания УБЫВ";
		
		Запрос.УстановитьПараметр("ВладелецФайлов", ПараметрыВыполнения.ПакетДанныхДляМСД);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			МодульРаботаСФайламиКлиентСервер = ОбщегоНазначения.ОбщийМодуль("РаботаСФайламиКлиентСервер");
			ПараметрыДанныхФайла = МодульРаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
			ПараметрыДанныхФайла.ПолучатьСсылкуНаДвоичныеДанные = Истина;
			
			МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
			СведенияОФайле = МодульРаботаСФайлами.ДанныеФайла(Выборка.Ссылка, ПараметрыДанныхФайла);
			
			Если СведенияОФайле = Неопределено Тогда
				ТекстСообщения = НСтр(
					"ru = 'По ссылке на присоединенный файл в документе ""Пакет данных для МСД"" отсутствует сам файл в томе на сервере.
					|Обработка прервана.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат Ложь;
			КонецЕсли;
			
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(СведенияОФайле.СсылкаНаДвоичныеДанныеФайла);
			
			ПараметрыВыполнения.Вставить("ИмяАрхива", СведенияОФайле.ИмяФайла);
			ПараметрыВыполнения.Вставить("ДДАрхива", Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(7)));
			
			УдалитьИзВременногоХранилища(СведенияОФайле.СсылкаНаДвоичныеДанныеФайла);
			
		Иначе
			
			ТекстСообщения = НСтр(
				"ru = 'В документе ""Пакет данных для МСД"" отсутствует актуальный файл для сверки. Обработка прервана.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЧастиИмени = СтрРазделить(ПараметрыВыполнения.ИмяАрхива, "_");
	Если ЧастиИмени.Количество() <> 6 Тогда
		
		Шаблон = НСтр("ru = 'Имя файла %1 не соответствует формату. Обработка прервана.'");
		ТекстСообщения = СтрШаблон(Шаблон, ПараметрыВыполнения.ИмяАрхива);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		Возврат Ложь;
		
	КонецЕсли;
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыСеанса.ТекущаяОрганизация,
		"НаименованиеСокращенное, КодПоРПБС");
	
	Если РеквизитыОрганизации.КодПоРПБС <> ЧастиИмени[1] Тогда
		
		ТекстСообщения = НСтр("ru = 'Код РПБС в имени файла не соответствует коду в базе БГУ. Обработка прервана.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ПараметрыВыполнения.Вставить("Организация", РеквизитыОрганизации.КодПоРПБС);
	ПараметрыВыполнения.Вставить("НаименованиеОрганизации", РеквизитыОрганизации.НаименованиеСокращенное);
	
	ОтчетныйПериодСсылка = ПолучитьСсылкуНаПериод(ЧастиИмени);
	ПараметрыВыполнения.Период = ОтчетныйПериодСсылка;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПреобразоватьАдресВДвоичныеДанные(ПараметрыВыполнения)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПараметрыВыполнения.Адрес);
	
	УдалитьИзВременногоХранилища(ПараметрыВыполнения.Адрес);
	
	ПараметрыВыполнения.Удалить("Адрес");
	
	ПараметрыВыполнения.Вставить("ДДАрхива", Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(7)));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвестиСверкуБГУ_Завершено(Результат, ДополнительныеПараметры) Экспорт
	
	ТекстСообщения = НСтр("ru = 'Окончание задания сверки учетных данных с пакетом данных БГУ.'");
	ЗаписьСобытияВЖурналРегистрации(ТекстСообщения);
	
	Если Результат = Неопределено Тогда
		Возврат;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
		
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		
		ПроизвестиСверкуБГУНаСервере_ВыполнитьЗавершающиеПроцедуры();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвестиСверкуБГУНаСервере_ВыполнитьЗавершающиеПроцедуры()
	
	Если Не ЭтоАдресВременногоХранилища(АдресРезультатаПротокола) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРезультат = ПолучитьИзВременногоХранилища(АдресРезультатаПротокола);
	
	ТабличныйДокумент = СтруктураРезультат.ТабличныйДокумент;
	АдресРасшифровкиПротоколаСверки = СтруктураРезультат.ДанныеРасшифровки;
	АдресТаблицаРезультат = СтруктураРезультат.ТаблицаРезультатВХранилище;
	
	СтруктураОткрытияФормыПросмотра = Новый Структура;
	СтруктураОткрытияФормыПросмотра.Вставить("АдресДокумента", ПоместитьВоВременноеХранилище(ТабличныйДокумент,
		УникальныйИдентификатор)); 
	СтруктураОткрытияФормыПросмотра.Вставить("АдресРасшифровкиПротоколаСверки", АдресРасшифровкиПротоколаСверки);
	СтруктураОткрытияФормыПросмотра.Вставить("АдресТаблицаРезультат", АдресТаблицаРезультат);
	СтруктураОткрытияФормыПросмотра.Вставить("Расшифровывать", Истина); 
	СтруктураОткрытияФормыПросмотра.Вставить("ТолькоСОтклонением", ТолькоСОтклонением);
	СтруктураОткрытияФормыПросмотра.Вставить("Заголовок", НСтр("ru = 'Протокол сверки данных учета БГУ и файла выгрузки'"));
	
	ИмяОткрытияФормы = СтрШаблон("%1.Форма.ПросмотрТабличногоДокумента", ПолноеИмяОбъекта);
	ОткрытьФорму(ИмяОткрытияФормы, СтруктураОткрытияФормыПросмотра, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаТабличногоДокумента(Параметр)
	
	Если Параметр.Свойство("ТолькоСОтклонением") Тогда
		ТолькоСОтклонением = Параметр.ТолькоСОтклонением;
	Иначе
		ТолькоСОтклонением = Ложь;
	КонецЕсли;
		
	ОбработкаРасшифровки(Параметр.Расшифровка, ТолькоСОтклонением);
	
	Если ЭтоАдресВременногоХранилища(АдресРезультатаРасшифровки) Тогда
		
		СтруктураРезультат = ПолучитьИзВременногоХранилища(АдресРезультатаРасшифровки);
		
		ТабличныйДокумент = СтруктураРезультат.ТабличныйДокумент;
			
		СтруктураОткрытияФормыПросмотра = Новый Структура;
		СтруктураОткрытияФормыПросмотра.Вставить("АдресДокумента", ПоместитьВоВременноеХранилище(ТабличныйДокумент,
			УникальныйИдентификатор));
		СтруктураОткрытияФормыПросмотра.Вставить("Расшифровывать", Ложь);
		СтруктураОткрытияФормыПросмотра.Вставить("Заголовок", 
			НСтр("ru = 'Протокол сверки данных учета БГУ и файла выгрузки'"));
		
		ИмяОткрытияФормы = СтрШаблон("%1.Форма.ПросмотрТабличногоДокумента", ПолноеИмяОбъекта);
		ОткрытьФорму(ИмяОткрытияФормы, СтруктураОткрытияФормыПросмотра, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаРасшифровки(ИдентификаторЭлементаРасшифровки, ТолькоСОтклонением)
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресРасшифровкиПротоколаСверки);
	КоллекцияЗначенийПолей = ДанныеРасшифровки.Элементы[ИдентификаторЭлементаРасшифровки].ПолучитьПоля();
	
	СтруктураОтбора = Новый Структура;
	
	ЭлементКоллекцииЗначенийПолей = КоллекцияЗначенийПолей.Найти("Организация");
	Если ЭлементКоллекцииЗначенийПолей <> Неопределено Тогда
		СтруктураОтбора.Вставить("Организация", ЭлементКоллекцииЗначенийПолей.Значение);
	КонецЕсли;
	
	ЭлементКоллекцииЗначенийПолей = КоллекцияЗначенийПолей.Найти("ПериодМесяц");
	Если ЭлементКоллекцииЗначенийПолей <> Неопределено Тогда
		СтруктураОтбора.Вставить("ПериодМесяц", ЭлементКоллекцииЗначенийПолей.Значение);
	КонецЕсли;
	
	ТаблицаРезультат = ПолучитьИзВременногоХранилища(АдресТаблицаРезультат);
	АдресРезультатаРасшифровки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ПараметрыВыполнения = Новый Структура("АдресРезультатаРасшифровки", АдресРезультатаРасшифровки);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВывестиПротоколСверкиУчетныхДанных(ТаблицаРезультат, ПараметрыВыполнения,
		СтруктураОтбора, ТолькоСОтклонением);
	
КонецПроцедуры

#Область ЗапускФоновогоЗадания

&НаСервере
Функция ИмяФайлаОбработки()
	Возврат РеквизитФормыВЗначение("Объект").ИспользуемоеИмяФайла;
КонецФункции

&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере(АдресФайлаНаСервере, ПараметрыВыполнения, НаименованиеЗадания, УникальныйИдентификатор)
	
	ФайлКорректный = ПроверитьИмяФайла(ПараметрыВыполнения);
	
	Если Не ФайлКорректный Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ПараметрыВыполнения.СпособСравнения Тогда
		ПреобразоватьАдресВДвоичныеДанные(ПараметрыВыполнения);
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Запуск фонового задания сверки учетных данных с пакетом данных в БГУ.'");
		
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ИмяМетода", "ПроизвестиСверкуБГУ");
	ПараметрыЗадания.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", Не ПараметрыВыполнения.ОбработкаВКонфигурации);
	Если ПараметрыВыполнения.ОбработкаВКонфигурации Тогда
		ПараметрыЗадания.Вставить("ИмяОбработки", СтрРазделить(ИмяФормы, ".")[1]);
	Иначе
		ИмяФайлаНаСервере = ПолучитьИмяВременногоФайла("epf");
		ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаНаСервере);
		ДанныеФайла.Записать(ИмяФайлаНаСервере);
		ПараметрыЗадания.Вставить("ИмяОбработки", ИмяФайлаНаСервере);
	КонецЕсли;
	
	МодульДлительныеОперации = ОбщегоНазначения.ОбщийМодуль("ДлительныеОперации");
	ПараметрыВыполненияФоновойОперации = МодульДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияФоновойОперации.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	ЗаписьСобытияВЖурналРегистрации(ТекстСообщения);
	
	РезультатФоновогоЗадания = МодульДлительныеОперации.ВыполнитьВФоне("ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки", ПараметрыЗадания,
		ПараметрыВыполненияФоновойОперации);
	
	Если Не ПараметрыВыполнения.ОбработкаВКонфигурации Тогда
		УдалитьФайлы(ИмяФайлаНаСервере);
	КонецЕсли;
	
	Возврат РезультатФоновогоЗадания;
	
КонецФункции

#КонецОбласти

&НаСервереБезКонтекста
Процедура ЗаписьСобытияВЖурналРегистрации(ТекстСообщения)
	
	ЗаписьЖурналаРегистрации("ДополнительныеОтчетыОбработки.Арт_СверкаУчетныхДанных", УровеньЖурналаРегистрации.Информация, , ,
		ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуСоответствия(Пакет)
	
	Если НЕ ЗначениеЗаполнено(Пакет) Тогда
		ТаблицаСоответствия.Очистить();
		Возврат;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	
#Область ТекстЗапроса
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиВыгрузкиАналитикМСД.Организация КАК Организация,
	|	НастройкиВыгрузкиАналитикМСД.Счет КАК Счет,
	|	НастройкиВыгрузкиАналитикМСД.Аналитика1 КАК Аналитика1,
	|	НастройкиВыгрузкиАналитикМСД.Аналитика2 КАК Аналитика2,
	|	НастройкиВыгрузкиАналитикМСД.Аналитика3 КАК Аналитика3,
	|	НастройкиВыгрузкиАналитикМСД.Аналитика4 КАК Аналитика4,
	|	НастройкиВыгрузкиАналитикМСД.Аналитика5 КАК Аналитика5,
	|	НастройкиВыгрузкиАналитикМСД.Аналитика6 КАК Аналитика6,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках1
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика1 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОстатках1 КАК ОбязательноВОстатках1,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках2
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика2 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОстатках2 КАК ОбязательноВОстатках2,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках3
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика3 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОстатках3 КАК ОбязательноВОстатках3,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках4
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика4 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОстатках4 КАК ОбязательноВОстатках4,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках5
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика5 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОстатках5 КАК ОбязательноВОстатках5,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОстатках6
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика6 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОстатках6 КАК ОбязательноВОстатках6,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах1
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика1 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОборотах1 КАК ОбязательноВОборотах1,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах2
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика2 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОборотах2 КАК ОбязательноВОборотах2,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах3
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика3 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОборотах3 КАК ОбязательноВОборотах3,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах4
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика4 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОборотах4 КАК ОбязательноВОборотах4,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах5
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика5 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОборотах5 КАК ОбязательноВОборотах5,
	|	НЕ НастройкиВыгрузкиАналитикМСД.ОбязательноВОборотах6
	|		И НЕ НастройкиВыгрузкиАналитикМСД.Аналитика6 = """"
	|		И НастройкиВыгрузкиАналитикМСД.ВОборотах6 КАК ОбязательноВОборотах6,
	|	НастройкиВыгрузкиАналитикМСД.ВОстатках1 КАК ВОстатках1,
	|	НастройкиВыгрузкиАналитикМСД.ВОстатках2 КАК ВОстатках2,
	|	НастройкиВыгрузкиАналитикМСД.ВОстатках3 КАК ВОстатках3,
	|	НастройкиВыгрузкиАналитикМСД.ВОстатках4 КАК ВОстатках4,
	|	НастройкиВыгрузкиАналитикМСД.ВОстатках5 КАК ВОстатках5,
	|	НастройкиВыгрузкиАналитикМСД.ВОстатках6 КАК ВОстатках6,
	|	НастройкиВыгрузкиАналитикМСД.ВОборотах1 КАК ВОборотах1,
	|	НастройкиВыгрузкиАналитикМСД.ВОборотах2 КАК ВОборотах2,
	|	НастройкиВыгрузкиАналитикМСД.ВОборотах3 КАК ВОборотах3,
	|	НастройкиВыгрузкиАналитикМСД.ВОборотах4 КАК ВОборотах4,
	|	НастройкиВыгрузкиАналитикМСД.ВОборотах5 КАК ВОборотах5,
	|	НастройкиВыгрузкиАналитикМСД.ВОборотах6 КАК ВОборотах6
	|ПОМЕСТИТЬ ВТТаблицаСвязейАналитик
	|ИЗ
	|	РегистрСведений.НастройкиВыгрузкиАналитикМСД КАК НастройкиВыгрузкиАналитикМСД
	|ГДЕ
	|	НастройкиВыгрузкиАналитикМСД.Версия = &Версия
	|	И НастройкиВыгрузкиАналитикМСД.Организация = &Организация 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Код КАК Код,
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ1.Ссылка КАК Родитель,
	|	ЕПСБУ2.Ссылка КАК РодительРодитель,
	|	ЕПСБУ.Вид КАК Вид,
	|	ЕПСБУ1.Код КАК КодРодитель,
	|	ЕПСБУ2.Код КАК КодРодтельРодитель,
	|	ЕПСБУ.Забалансовый КАК Забалансовый
	|ПОМЕСТИТЬ ВТПланСчетов
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ1
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ2
	|			ПО ЕПСБУ1.Родитель = ЕПСБУ2.Ссылка
	|				И (&ДатаНачала МЕЖДУ ЕПСБУ2.ДатаНачалаДействия И ВЫБОР
	|					КОГДА ЕПСБУ2.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ДАТАВРЕМЯ(2999, 12, 31, 23, 59, 59)
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕПСБУ2.ДатаОкончанияДействия, ГОД, 1)
	|				КОНЕЦ)
	|		ПО (ВЫБОР
	|				КОГДА ЕПСБУ.Код = ""106.КС""
	|					ТОГДА ЕПСБУ1.Код = ""106.11""
	|				ИНАЧЕ ЕПСБУ.Родитель = ЕПСБУ1.Ссылка
	|			КОНЕЦ)
	|			И (&ДатаНачала МЕЖДУ ЕПСБУ1.ДатаНачалаДействия И ВЫБОР
	|				КОГДА ЕПСБУ1.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ДАТАВРЕМЯ(2999, 12, 31, 23, 59, 59)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕПСБУ1.ДатаОкончанияДействия, ГОД, 1)
	|			КОНЕЦ)
	|ГДЕ
	|	&ДатаНачала МЕЖДУ ЕПСБУ.ДатаНачалаДействия И ВЫБОР
	|			КОГДА ЕПСБУ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДАТАВРЕМЯ(2999, 12, 31, 23, 59, 59)
	|			ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕПСБУ.ДатаОкончанияДействия, ГОД, 1)
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТиповСубконтоИТеговВыгрузки.ИмяТега КАК ИмяТега,
	|	ТаблицаТиповСубконтоИТеговВыгрузки.ТипСубконто КАК ТипСубконто,
	|	ТаблицаТиповСубконтоИТеговВыгрузки.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ТаблицаТиповСубконтоИТеговВыгрузки
	|ИЗ
	|	&ТаблицаТиповСубконтоИТеговВыгрузки КАК ТаблицаТиповСубконтоИТеговВыгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТаблицаСвязейАналитик.Счет КАК Счет,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки.Ссылка КАК Ссылка,
	|	ВТПланСчетов.Ссылка КАК СчетСсылка
	|ПОМЕСТИТЬ ВТ_ТаблицаТиповСубконтоИТеговВыгрузки_Счет
	|ИЗ
	|	ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаТиповСубконтоИТеговВыгрузки КАК ВТ_ТаблицаТиповСубконтоИТеговВыгрузки
	|		ПО (ВТТаблицаСвязейАналитик.Аналитика1 = ВТ_ТаблицаТиповСубконтоИТеговВыгрузки.ИмяТега
	|				ИЛИ ВТТаблицаСвязейАналитик.Аналитика2 = ВТ_ТаблицаТиповСубконтоИТеговВыгрузки.ИмяТега
	|				ИЛИ ВТТаблицаСвязейАналитик.Аналитика3 = ВТ_ТаблицаТиповСубконтоИТеговВыгрузки.ИмяТега
	|				ИЛИ ВТТаблицаСвязейАналитик.Аналитика4 = ВТ_ТаблицаТиповСубконтоИТеговВыгрузки.ИмяТега
	|				ИЛИ ВТТаблицаСвязейАналитик.Аналитика5 = ВТ_ТаблицаТиповСубконтоИТеговВыгрузки.ИмяТега
	|				ИЛИ ВТТаблицаСвязейАналитик.Аналитика6 = ВТ_ТаблицаТиповСубконтоИТеговВыгрузки.ИмяТега)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ВТПланСчетов
	|		ПО ВТТаблицаСвязейАналитик.Счет = ВТПланСчетов.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕПСБУВидыСубконто.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки_Счет.Счет КАК Код
	|ПОМЕСТИТЬ ВТ_ВидыСубконто
	|ИЗ
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки_Счет КАК ВТ_ТаблицаТиповСубконтоИТеговВыгрузки_Счет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО ВТ_ТаблицаТиповСубконтоИТеговВыгрузки_Счет.Ссылка = ЕПСБУВидыСубконто.ВидСубконто
	|			И ВТ_ТаблицаТиповСубконтоИТеговВыгрузки_Счет.СчетСсылка = ЕПСБУВидыСубконто.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТаблицаСвязейАналитик.Счет КАК Счет,
	|	ВТТаблицаСвязейАналитик.Аналитика1 КАК Аналитика1,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки1.ТипСубконто КАК ТипСубконто1,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки1.Ссылка КАК ВидСубконто1,
	|	ВТТаблицаСвязейАналитик.Аналитика2 КАК Аналитика2,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки2.ТипСубконто КАК ТипСубконто2,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки2.Ссылка КАК ВидСубконто2,
	|	ВТТаблицаСвязейАналитик.Аналитика3 КАК Аналитика3,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки3.ТипСубконто КАК ТипСубконто3,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки3.Ссылка КАК ВидСубконто3,
	|	ВТТаблицаСвязейАналитик.Аналитика4 КАК Аналитика4,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки4.ТипСубконто КАК ТипСубконто4,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки4.Ссылка КАК ВидСубконто4,
	|	ВТТаблицаСвязейАналитик.Аналитика5 КАК Аналитика5,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки5.ТипСубконто КАК ТипСубконто5,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки5.Ссылка КАК ВидСубконто5,
	|	ВТТаблицаСвязейАналитик.Аналитика6 КАК Аналитика6,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки6.ТипСубконто КАК ТипСубконто6,
	|	ВТ_ТаблицаТиповСубконтоИТеговВыгрузки6.Ссылка КАК ВидСубконто6,
	|	ВТПланСчетов.Ссылка КАК СчетСсылка,
	|	ВТПланСчетов.Забалансовый КАК Забалансовый
	|ПОМЕСТИТЬ ВТ_СоответствиеСубконто_Предварительно
	|ИЗ
	|	ВТТаблицаСвязейАналитик КАК ВТТаблицаСвязейАналитик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаТиповСубконтоИТеговВыгрузки КАК ВТ_ТаблицаТиповСубконтоИТеговВыгрузки1
	|		ПО (ВТТаблицаСвязейАналитик.Аналитика1 = ВТ_ТаблицаТиповСубконтоИТеговВыгрузки1.ИмяТега)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаТиповСубконтоИТеговВыгрузки КАК ВТ_ТаблицаТиповСубконтоИТеговВыгрузки2
	|		ПО (ВТТаблицаСвязейАналитик.Аналитика2 = ВТ_ТаблицаТиповСубконтоИТеговВыгрузки2.ИмяТега) 
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаТиповСубконтоИТеговВыгрузки КАК ВТ_ТаблицаТиповСубконтоИТеговВыгрузки3
	|		ПО (ВТТаблицаСвязейАналитик.Аналитика3 = ВТ_ТаблицаТиповСубконтоИТеговВыгрузки3.ИмяТега)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаТиповСубконтоИТеговВыгрузки КАК ВТ_ТаблицаТиповСубконтоИТеговВыгрузки4
	|		ПО (ВТТаблицаСвязейАналитик.Аналитика4 = ВТ_ТаблицаТиповСубконтоИТеговВыгрузки4.ИмяТега)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаТиповСубконтоИТеговВыгрузки КАК ВТ_ТаблицаТиповСубконтоИТеговВыгрузки5
	|		ПО (ВТТаблицаСвязейАналитик.Аналитика5 = ВТ_ТаблицаТиповСубконтоИТеговВыгрузки5.ИмяТега)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаТиповСубконтоИТеговВыгрузки КАК ВТ_ТаблицаТиповСубконтоИТеговВыгрузки6
	|		ПО (ВТТаблицаСвязейАналитик.Аналитика6 = ВТ_ТаблицаТиповСубконтоИТеговВыгрузки6.ИмяТега)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПланСчетов КАК ВТПланСчетов
	|		ПО (ВТТаблицаСвязейАналитик.Счет = ВТПланСчетов.Код
	|		ИЛИ ВТТаблицаСвязейАналитик.Счет = ВТПланСчетов.КодРодитель
	|		ИЛИ ВТТаблицаСвязейАналитик.Счет = ВТПланСчетов.КодРодтельРодитель)
	|;
	| 
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТаблицаСвязейАналитик.СчетСсылка КАК Счет,
	|	ВТТаблицаСвязейАналитик.Счет КАК СчетСтрока,
	|	ВТТаблицаСвязейАналитик.Забалансовый КАК Забалансовый,
	|	ВТТаблицаСвязейАналитик.Аналитика1 КАК Аналитика1,
	|	ВТТаблицаСвязейАналитик.ТипСубконто1 КАК ТипСубконто1,
	|	ЕПСБУВидыСубконто1.НомерСтроки КАК НомерСубконто1,
	|	НЕ ЕПСБУВидыСубконто1.НомерСтроки ЕСТЬ NULL КАК УчаствуетВСравнении1,
	|	ВТТаблицаСвязейАналитик.Аналитика2 КАК Аналитика2,
	|	ВТТаблицаСвязейАналитик.ТипСубконто2 КАК ТипСубконто2,
	|	ЕПСБУВидыСубконто2.НомерСтроки КАК НомерСубконто2,
	|	НЕ ЕПСБУВидыСубконто2.НомерСтроки ЕСТЬ NULL КАК УчаствуетВСравнении2,
	|	ВТТаблицаСвязейАналитик.Аналитика3 КАК Аналитика3,
	|	ВТТаблицаСвязейАналитик.ТипСубконто3 КАК ТипСубконто3,
	|	ЕПСБУВидыСубконто3.НомерСтроки КАК НомерСубконто3,
	|	НЕ ЕПСБУВидыСубконто3.НомерСтроки ЕСТЬ NULL КАК УчаствуетВСравнении3,
	|	ВТТаблицаСвязейАналитик.Аналитика4 КАК Аналитика4,
	|	ВТТаблицаСвязейАналитик.ТипСубконто4 КАК ТипСубконто4, 
	|	ЕПСБУВидыСубконто4.НомерСтроки КАК НомерСубконто4,
	|	НЕ ЕПСБУВидыСубконто4.НомерСтроки ЕСТЬ NULL КАК УчаствуетВСравнении4,
	|	ВТТаблицаСвязейАналитик.Аналитика5 КАК Аналитика5,
	|	ВТТаблицаСвязейАналитик.ТипСубконто5 КАК ТипСубконто5,
	|	ЕПСБУВидыСубконто5.НомерСтроки КАК НомерСубконто5,
	|	НЕ ЕПСБУВидыСубконто5.НомерСтроки ЕСТЬ NULL КАК УчаствуетВСравнении5,
	|	ВТТаблицаСвязейАналитик.Аналитика6 КАК Аналитика6,
	|	ВТТаблицаСвязейАналитик.ТипСубконто6 КАК ТипСубконто6,
	|	ЕПСБУВидыСубконто6.НомерСтроки КАК НомерСубконто6,
	|	НЕ ЕПСБУВидыСубконто6.НомерСтроки ЕСТЬ NULL КАК УчаствуетВСравнении6
	|ИЗ
	|	ВТ_СоответствиеСубконто_Предварительно КАК ВТТаблицаСвязейАналитик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто1
	|		ПО ВТТаблицаСвязейАналитик.ВидСубконто1 = ЕПСБУВидыСубконто1.ВидСубконто
	|			И ВТТаблицаСвязейАналитик.СчетСсылка = ЕПСБУВидыСубконто1.Ссылка
	|			И (ПОДСТРОКА(ВТТаблицаСвязейАналитик.Счет, 1, 3) В (&СчетаССубконто)
	|				ИЛИ ПОДСТРОКА(ВТТаблицаСвязейАналитик.Счет, 1, 3) В (&СчетаССубконто2))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто2
	|		ПО ВТТаблицаСвязейАналитик.ВидСубконто2 = ЕПСБУВидыСубконто2.ВидСубконто
	|			И ВТТаблицаСвязейАналитик.СчетСсылка = ЕПСБУВидыСубконто2.Ссылка 
	|			И (ПОДСТРОКА(ВТТаблицаСвязейАналитик.Счет, 1, 3) В (&СчетаССубконто)
	|				ИЛИ ПОДСТРОКА(ВТТаблицаСвязейАналитик.Счет, 1, 3) В (&СчетаССубконто2))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто3
	|		ПО ВТТаблицаСвязейАналитик.ВидСубконто3 = ЕПСБУВидыСубконто3.ВидСубконто
	|			И ВТТаблицаСвязейАналитик.СчетСсылка = ЕПСБУВидыСубконто3.Ссылка
	|			И (ПОДСТРОКА(ВТТаблицаСвязейАналитик.Счет, 1, 3) В (&СчетаССубконто)
	|				ИЛИ ПОДСТРОКА(ВТТаблицаСвязейАналитик.Счет, 1, 3) В (&СчетаССубконто2))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто4
	|		ПО ВТТаблицаСвязейАналитик.ВидСубконто4 = ЕПСБУВидыСубконто4.ВидСубконто
	|			И ВТТаблицаСвязейАналитик.СчетСсылка = ЕПСБУВидыСубконто4.Ссылка
	|			И (ПОДСТРОКА(ВТТаблицаСвязейАналитик.Счет, 1, 3) В (&СчетаССубконто)
	|				ИЛИ ПОДСТРОКА(ВТТаблицаСвязейАналитик.Счет, 1, 3) В (&СчетаССубконто2))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто5
	|		ПО ВТТаблицаСвязейАналитик.ВидСубконто5 = ЕПСБУВидыСубконто5.ВидСубконто
	|			И ВТТаблицаСвязейАналитик.СчетСсылка = ЕПСБУВидыСубконто5.Ссылка
	|			И (ПОДСТРОКА(ВТТаблицаСвязейАналитик.Счет, 1, 3) В (&СчетаССубконто)
	|				ИЛИ ПОДСТРОКА(ВТТаблицаСвязейАналитик.Счет, 1, 3) В (&СчетаССубконто2))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто6
	|		ПО ВТТаблицаСвязейАналитик.ВидСубконто6 = ЕПСБУВидыСубконто6.ВидСубконто
	|			И ВТТаблицаСвязейАналитик.СчетСсылка = ЕПСБУВидыСубконто6.Ссылка
	|			И (ПОДСТРОКА(ВТТаблицаСвязейАналитик.Счет, 1, 3) В (&СчетаССубконто)
	|				ИЛИ ПОДСТРОКА(ВТТаблицаСвязейАналитик.Счет, 1, 3) В (&СчетаССубконто2))
	|
	|ГДЕ 
	|	НЕ ВТТаблицаСвязейАналитик.СчетСсылка ЕСТЬ NULL
	|	И (НЕ ЕПСБУВидыСубконто1.НомерСтроки ЕСТЬ NULL 
	|		ИЛИ НЕ ЕПСБУВидыСубконто2.НомерСтроки ЕСТЬ NULL
	|		ИЛИ НЕ ЕПСБУВидыСубконто3.НомерСтроки ЕСТЬ NULL
	|		ИЛИ НЕ ЕПСБУВидыСубконто4.НомерСтроки ЕСТЬ NULL
	|		ИЛИ НЕ ЕПСБУВидыСубконто5.НомерСтроки ЕСТЬ NULL
	|		ИЛИ НЕ ЕПСБУВидыСубконто6.НомерСтроки ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Забалансовый,
	|	СчетСтрока";
	
#КонецОбласти
	
	МодульОбщегоНазначенияМСД = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияМСД");
	ДанныеВерсии = МодульОбщегоНазначенияМСД.ТекущаяВерсияТаксономии(КонецДня(Пакет.ОкончаниеПериода), Пакет.Организация);
	Если ДанныеВерсии = Неопределено Тогда
		ВызватьИсключение ("Отсутствует утвержденная таксономия на конец периода");
	КонецЕсли;
	Запрос.УстановитьПараметр("Организация", Пакет.Организация);
	Запрос.УстановитьПараметр("Версия", ДанныеВерсии.Версия);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Пакет.НачалоПериода));
	ТаблицаТиповСубконтоИТеговВыгрузки = ВернутьТаблицуТиповСубконтоИТеговВыгрузки();
	ТаблицаТиповСубконтоИТеговВыгрузки.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто"));
	Для каждого СтрокаСубконто Из ТаблицаТиповСубконтоИТеговВыгрузки Цикл
		СтрокаСубконто.Ссылка = ПланыВидовХарактеристик.ВидыСубконто[СтрокаСубконто.ИмяСубконто];	
	КонецЦикла;	
	Запрос.УстановитьПараметр("ТаблицаТиповСубконтоИТеговВыгрузки", ТаблицаТиповСубконтоИТеговВыгрузки);  
	
	ПереченьСчетовССубконто = Новый Массив;
	ПереченьСчетовССубконто.Добавить("101");
	ПереченьСчетовССубконто.Добавить("102");
	ПереченьСчетовССубконто.Добавить("103");
	ПереченьСчетовССубконто.Добавить("104");
	//ПереченьСчетовССубконто.Добавить("105");
	ПереченьСчетовССубконто.Добавить("106");
	ПереченьСчетовССубконто.Добавить("107");
	ПереченьСчетовССубконто.Добавить("108");
	ПереченьСчетовССубконто.Добавить("109");
	ПереченьСчетовССубконто.Добавить("111");
	ПереченьСчетовССубконто.Добавить("113");
	ПереченьСчетовССубконто.Добавить("114");
	//ПереченьСчетовССубконто.Добавить("201");
	ПереченьСчетовССубконто.Добавить("204");
	ПереченьСчетовССубконто.Добавить("205");
	ПереченьСчетовССубконто.Добавить("206");
	ПереченьСчетовССубконто.Добавить("207");
	ПереченьСчетовССубконто.Добавить("208");
	ПереченьСчетовССубконто.Добавить("209");
	ПереченьСчетовССубконто.Добавить("210");
	ПереченьСчетовССубконто.Добавить("302");
	ПереченьСчетовССубконто.Добавить("301");
	ПереченьСчетовССубконто.Добавить("303");
	ПереченьСчетовССубконто.Добавить("304");
	ПереченьСчетовССубконто.Добавить("401");
	ПереченьСчетовССубконто.Добавить("501");
	ПереченьСчетовССубконто.Добавить("502");
	ПереченьСчетовССубконто.Добавить("503");
		
	ПереченьЗабСчетовССубконто = Новый Массив;
	ПереченьЗабСчетовССубконто.Добавить("01");
	ПереченьЗабСчетовССубконто.Добавить("02");
	ПереченьЗабСчетовССубконто.Добавить("21");
		
	Запрос.УстановитьПараметр("СчетаССубконто", ПереченьСчетовССубконто);
	Запрос.УстановитьПараметр("СчетаССубконто2", ПереченьЗабСчетовССубконто); 
	
	ТаблицаСоответствия.Загрузить(Запрос.Выполнить().Выгрузить()); 

КонецПроцедуры 

&НаСервереБезКонтекста
Функция ВернутьТаблицуТиповСубконтоИТеговВыгрузки()
	
	МакетОписания = Обработки.СверкаУчетныхДанныхМСД.ПолучитьМакет("СопоставлениеТиповСубконтоИТеговВыгрузки_ru");
	ОбластьМакета = МакетОписания.Область(1, 1, МакетОписания.ВысотаТаблицы, МакетОписания.ШиринаТаблицы);
	Построитель = Новый ПостроительЗапроса;
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьМакета);
	Построитель.ИсточникДанных = ИсточникДанных;
	Построитель.Выполнить();
	
	Возврат Построитель.Результат.Выгрузить();
	
КонецФункции 

&НаСервере
Функция ПолучитьСсылкуНаПериод(ЧастиИмени)
	
	ПризнакВидаДанных = ЧастиИмени[2];
	ПериодДанных = ЧастиИмени[3];
	ПризнакЭП = ЧастиИмени[4];
	
	ВидПередаваемыхДанных = (ПризнакВидаДанных = "1") Или (ПризнакВидаДанных = "3");
	
	МодульОбщегоНазначенияКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	ВидПериода = ?(ВидПередаваемыхДанных, 
	МодульОбщегоНазначенияКлиентСервер.МассивЗначений(ПредопределенноеЗначение("Перечисление.ПериодичностьМСД.Месяц")),
	МодульОбщегоНазначенияКлиентСервер.МассивЗначений(ПредопределенноеЗначение("Перечисление.ПериодичностьМСД.Декада"), ПредопределенноеЗначение("Перечисление.ПериодичностьМСД.ПроизвольныйПериод")));	
	
	Если СтрДлина(ПериодДанных) = 6 Тогда
		// Отчетные данные. Указывается год и месяц, например 202403
		ГодМесяц = ПериодДанных;
		
		НачалоПериодаСтрока = ГодМесяц + "01";
		
		НачалоПериода	= Дата(НачалоПериодаСтрока);
		КонецПериода	= КонецМесяца(НачалоПериода);
		
	ИначеЕсли СтрДлина(ПериодДанных) = 17 Тогда
		// Отчетные данные. Указывается год и месяц и день начала и год и месяц и день окончания, например 20240801-20240804
		ЧастиДатыОперативные = СтрРазделить(ПериодДанных, "-");
		
		НачалоПериода = Дата(ЧастиДатыОперативные[0]);
		КонецПериода = Дата(ЧастиДатыОперативные[1]);
		
		Если КонецПериода >= Дата(2026,1,1) Тогда
			ВидПериода = Неопределено;
		КонецЕсли;
		
	ИначеЕсли СтрДлина(ПериодДанных) = 13 Тогда
		// Корректировка (перезагрузка) данных за прошлые периоды. Указывается год и месяц начала и год и месяц окончания, например 202407-202410
		ЧастиДатыОтчетные = СтрРазделить(ПериодДанных, "-");
		
		НомерПакетаВПачке = Число(Лев(ЧастиИмени[5], 2));
		
		Если ЧастиДатыОтчетные.Количество() < 2 Тогда
			ВызватьИсключение "Имя файла не соответствует формату.";
		Иначе
			ГодМесяцНачало = ЧастиДатыОтчетные[0];
			ГодМесяцОкончание = ЧастиДатыОтчетные[1];
			
			ДатаГодМесяцНачало = Дата(ГодМесяцНачало+"01");
			
			НачалоПериода = ДобавитьМесяц(ДатаГодМесяцНачало, НомерПакетаВПачке-1);
			КонецПериода = КонецМесяца(НачалоПериода);
		КонецЕсли;
	
	КонецЕсли;
	
	ПериодСсылка = Неопределено;
	
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) Тогда
		МодульОбщегоНазначенияМСД = ОбщегоНазначения.ОбщийМодуль("ОбщегоНазначенияМСД");
		ПериодСсылка = МодульОбщегоНазначенияМСД.НайтиОтчетныйПериод(ВидПериода, НачалоПериода, КонецПериода);
	КонецЕсли;
	
	Возврат ПериодСсылка;
	
КонецФункции

#КонецОбласти


