#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Период", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеДокумента.Ссылка.Дата КАК Период,
	               |	ДанныеДокумента.Ссылка.Организация КАК Организация,
	               |	ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
	               |	ДанныеДокумента.ИнвентарныйНомер КАК ИнвентарныйНомер,
	               |	ДанныеДокумента.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
	               |	ДанныеДокумента.Подразделение КАК Подразделение,
	               |	ДанныеДокумента.КПС КАК КПС,
	               |	ДанныеДокумента.КЭК КАК КЭК,
	               |	ДанныеДокумента.Субконто1 КАК Субконто1,
	               |	ДанныеДокумента.Субконто2 КАК Субконто2,
	               |	ДанныеДокумента.Субконто3 КАК Субконто3,
	               |	ДанныеДокумента.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	               |	ДанныеДокумента.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	               |	ДанныеДокумента.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	               |	ДанныеДокумента.ОставшийсяСрок КАК СрокИспользованияДляВычисленияАмортизации,
	               |	ДанныеДокумента.Сумма - ДанныеДокумента.РассчитаннаяАмортизация КАК СтоимостьДляВычисленияАмортизации,
	               |	ДанныеДокумента.КорректировкаАмортизации КАК КорректировкаАмортизации
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.КорректировкаАмортизации.ОсновныеСредства КАК ДанныеДокумента
	               |ГДЕ
	               |	ДанныеДокумента.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ДанныеДокумента.Период КАК Период,
	               |	ВТ_ДанныеДокумента.Организация КАК Организация,
	               |	ВТ_ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
	               |	ВТ_ДанныеДокумента.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
	               |	ВТ_ДанныеДокумента.Подразделение КАК Подразделение,
	               |	ВТ_ДанныеДокумента.КПС КАК КПС,
	               |	ВТ_ДанныеДокумента.КЭК КАК КЭК,
	               |	ВТ_ДанныеДокумента.Субконто1 КАК Субконто1,
	               |	ВТ_ДанныеДокумента.Субконто2 КАК Субконто2,
	               |	ВТ_ДанныеДокумента.Субконто3 КАК Субконто3
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |ГДЕ
	               |	КОНЕЦПЕРИОДА(ВТ_ДанныеДокумента.Период, ГОД) <> КОНЕЦПЕРИОДА(ВТ_ДанныеДокумента.Период, ДЕНЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	               |	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	               |	РасчетАмортизацииОССрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	               |	РасчетАмортизацииОССрезПоследних.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации
	               |ПОМЕСТИТЬ ВТ_РасчетАмортизацииСтар
	               |ИЗ
	               |	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	               |			&Период,
	               |			ОсновноеСредство В
	               |				(ВЫБРАТЬ
	               |					ВТ_ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство
	               |				ИЗ
	               |					ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК РасчетАмортизацииОССрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ВТ_ДанныеДокумента.Период, МЕСЯЦ), СЕКУНДА, 1) КАК Период,
	               |	ВТ_ДанныеДокумента.Организация КАК Организация,
	               |	ВТ_ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
	               |	ВТ_ДанныеДокумента.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	               |	ВТ_ДанныеДокумента.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	               |	ВТ_ДанныеДокумента.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасчетАмортизацииСтар КАК ВТ_РасчетАмортизацииСтар
	               |		ПО ВТ_ДанныеДокумента.ОсновноеСредство = ВТ_РасчетАмортизацииСтар.ОсновноеСредство
	               |ГДЕ
	               |	(ВТ_ДанныеДокумента.СрокПолезногоИспользования <> ВТ_РасчетАмортизацииСтар.СрокПолезногоИспользования
	               |			ИЛИ ВТ_ДанныеДокумента.СрокИспользованияДляВычисленияАмортизации <> ВТ_РасчетАмортизацииСтар.СрокИспользованияДляВычисленияАмортизации
	               |			ИЛИ ВТ_ДанныеДокумента.СтоимостьДляВычисленияАмортизации <> ВТ_РасчетАмортизацииСтар.СтоимостьДляВычисленияАмортизации)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Период КАК Период,
	               |	ВТ_ДанныеДокумента.Организация КАК Организация,
	               |	ВТ_ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
	               |	ВТ_ДанныеДокумента.ИнвентарныйНомер КАК ИнвентарныйНомер,
	               |	ВТ_ДанныеДокумента.Подразделение КАК Подразделение,
	               |	ВЫБОР
	               |		КОГДА ВТ_ДанныеДокумента.КорректировкаАмортизации > 0
	               |			ТОГДА ВТ_ДанныеДокумента.КорректировкаАмортизации
	               |		ИНАЧЕ -ВТ_ДанныеДокумента.КорректировкаАмортизации
	               |	КОНЕЦ КАК СуммаАмортизации,
	               |	ВЫБОР
	               |		КОГДА ВТ_ДанныеДокумента.КорректировкаАмортизации > 0
	               |			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	               |	КОНЕЦ КАК ВидДвижения
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |ГДЕ
	               |	ВТ_ДанныеДокумента.КорректировкаАмортизации <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ДанныеДокумента.Период КАК Период,
	               |	ВТ_ДанныеДокумента.Организация КАК Организация,
	               |	ВТ_ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
	               |	ВТ_ДанныеДокумента.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	               |	ВТ_ДанныеДокумента.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ДанныеДокумента.Период КАК Период,
	               |	ВТ_ДанныеДокумента.Организация КАК Организация,
	               |	ВТ_ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
	               |	ВЫБОР
	               |		КОГДА ВТ_ДанныеДокумента.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	               |				И ВТ_ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК НачислятьАмортизацию
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента";
				   
	Результат = Запрос.ВыполнитьПакет();				   
	
	ТаблицыЗапроса = Новый Массив;
	ТаблицыЗапроса.Добавить("ВТ_ДанныеДокумента");
	ТаблицыЗапроса.Добавить("АмортизацияОС");
	ТаблицыЗапроса.Добавить("ВТ_РасчетАмортизацииОССтар");
	ТаблицыЗапроса.Добавить("РасчетАмортизацииОС");
	ТаблицыЗапроса.Добавить("АмортизацияОбъектовОС");
	ТаблицыЗапроса.Добавить("ПараметрыАмортизацииОСБухгалтерскийУчет");
	ТаблицыЗапроса.Добавить("НачислениеАмортизацииОСБухгалтерскийУчет");
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, ТаблицыЗапроса);
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
  // Встроенная печатная форма
  КомандаПечати = КомандыПечати.Добавить();
  КомандаПечати.МенеджерПечати					= "Документ.КорректировкаАмортизации";
  КомандаПечати.Идентификатор					= "ПФ_MXL_ОписьОС";
  КомандаПечати.Представление					= НСтр("ru = 'Опись ОС при корректировке амортизации'");
  КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// Проверяем, нужно ли для макета формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ОписьОС") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ОписьОС",
			"Опись основных средств при корректировке амортизации",
			ПечатьОписьОС(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

КонецПроцедуры

// Процедура печати табличной части документа
//
Функция ПечатьОписьОС(МассивОбъектов, ОбъектыПечати = Неопределено) Экспорт
		
	СхемаКомпоновкиДанных = ПолучитьМакет("ОписьОС");
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Для Каждого Объект Из МассивОбъектов Цикл
				
		ДанныеРасшифровки = Неопределено;
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		
		Заголовок = Объект.Метаданные().Представление() + " № " + Объект.Номер + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
		СтандартныеОтчетыКлиентСервер.УстановитьПараметрВывода(КомпоновщикНастроек, "Заголовок", Заголовок);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Документ", Объект);
		
		// Инициализация системы компоновки данных	
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;				
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки);
		
		// Запуск вывода в коллекцию
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		
		ТабДок = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		ТабДокумент.Вывести(ТабДок);
		
	КонецЦикла;
		
	Возврат ТабДокумент;
	
КонецФункции 

#КонецОбласти

#КонецЕсли
