

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Наименование = Параметры.Наименование;
	Событие = Параметры.Событие;
	
	Заголовок = Параметры.Заголовок;
	
	СоздатьТаблицуФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ФормаСоздания" И ИмяСобытия = "ИзменениеСтруктуры" Тогда
		
		СоздатьТаблицуФормы();
		
		Наименование = Параметр.Наименование;
		
	ИначеЕсли Источник = "ЗагрузкаДанныхТаблицы" И ИмяСобытия = "ЗагрузкаДанных" Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("АдресДанныхЗагрузки") И Параметр.Свойство("ОчищатьТекущиеЗначения") Тогда
			
			ЗагрузитьТаблицу(Параметр.АдресДанныхЗагрузки, Параметр.ОчищатьТекущиеЗначения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	ЗаполнениеОтчетностиКлиент.СохранениеПередЗакрытием(ЭтаФорма,Событие,"ФормаРедактирования");

	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если СохранитьДанныеФормы() Тогда
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	СохранитьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортИзТаблицы(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресКарты", СохранитьТаблицу());
	ПараметрыФормы.Вставить("Событие","ЗагрузкаДанных");
	ПараметрыФормы.Вставить("Заголовок", Заголовок);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ОткрытьФормуМодально("Справочник.ПравилаЗаполнения.Форма.ЗагрузкаДанныхТаблицы",ПараметрыФормы,ЭтаФорма);
	#Иначе	
		ОткрытьФорму("Справочник.ПравилаЗаполнения.Форма.ЗагрузкаДанныхТаблицы",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтруктуру(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Наименование", Наименование);
	ПараметрыФормы.Вставить("АдресТаблицы", СохранитьТаблицу());
	ПараметрыФормы.Вставить("Событие","ИзменениеСтруктуры");
	ПараметрыФормы.Вставить("Заголовок", Заголовок);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда 
		ОткрытьФормуМодально("Справочник.ПравилаЗаполнения.Форма.СтруктураТаблицы",ПараметрыФормы,ЭтаФорма);
	#Иначе 
		ОткрытьФорму("Справочник.ПравилаЗаполнения.Форма.СтруктураТаблицы",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	#КонецЕсли	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура СоздатьТаблицуФормы()
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипЧисло = Новый ОписаниеТипов("Число");
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипДата = Новый ОписаниеТипов("Дата");
	
	Таблица = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицы);
	
	Если ТипЗнч(Таблица) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	УдаляемыеРеквизиты = Новый Массив;
	
	Для каждого РеквизитКолонка Из ПолучитьРеквизиты("ТаблицаЗначений") Цикл
		
		УдаляемыеРеквизиты.Добавить("ТаблицаЗначений."+РеквизитКолонка.Имя);
		
	КонецЦикла;
	
	УдаляемыеЭлементы = Новый Массив;
	
	Для каждого ЭлементКолонка Из Элементы.ТаблицаЗначений.ПодчиненныеЭлементы Цикл
		
		УдаляемыеЭлементы.Добавить(ЭлементКолонка);
		
	КонецЦикла;
	
	Для каждого ЭлементФормы Из УдаляемыеЭлементы Цикл
		
		Элементы.Удалить(ЭлементФормы);
		
	КонецЦикла;
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	Для каждого Колонка Из Таблица.Колонки Цикл
		
		Реквизит = Новый РеквизитФормы(Колонка.Имя,Колонка.ТипЗначения,"ТаблицаЗначений",БюджетнаяОтчетностьКлиентСервер.Синоним(Колонка.Имя));
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	Для каждого Колонка Из Таблица.Колонки Цикл
		
		ЭлементКолонка = Элементы.Добавить(Колонка.Имя,Тип("ПолеФормы"),Элементы.ТаблицаЗначений);
		ЭлементКолонка.ПутьКДанным = "ТаблицаЗначений."+Колонка.Имя;
		
		Если Колонка.ТипЗначения = ТипБулево Тогда
			
			ЭлементКолонка.Вид = ВидПоляФормы.ПолеФлажка;
			ЭлементКолонка.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
			
		ИначеЕсли Колонка.ТипЗначения = ТипСтрока Тогда
			
			ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
			
			ЭлементКолонка.КнопкаОчистки = Истина;
			
		ИначеЕсли Колонка.ТипЗначения = ТипЧисло Тогда
			
			ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
			
			ЭлементКолонка.КнопкаВыбора = Истина;
			ЭлементКолонка.КнопкаРегулирования = Истина;
			ЭлементКолонка.КнопкаОчистки = Истина;
			
		ИначеЕсли Колонка.ТипЗначения = ТипДата Тогда
			
			ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
			
			ЭлементКолонка.КнопкаВыбора = Истина;
			ЭлементКолонка.КнопкаРегулирования = Истина;
			ЭлементКолонка.КнопкаОчистки = Истина;
			
		Иначе
			
			ЭлементКолонка.Вид = ВидПоляФормы.ПолеВвода;
			
			ЭлементКолонка.КнопкаВыбора = Истина;
			ЭлементКолонка.КнопкаОчистки = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Таблица,"ТаблицаЗначений");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицу(Знач АдресТаблицы, Знач ОчищатьТекущиеДанные)
	
	Если ЭтоАдресВременногоХранилища(АдресТаблицы) Тогда
		
		ДанныеТаблицы = ПолучитьИзВременногоХранилища(АдресТаблицы);
		
		Если ОчищатьТекущиеДанные Тогда
			
			ТаблицаЗначений.Очистить();
			
		КонецЕсли;
		
		Для каждого СтрокаТаблицы Из ДанныеТаблицы Цикл
			
			НоваяСтрока = ТаблицаЗначений.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СохранитьДанныеФормы()
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	ВозвращаемыеДанные = ПодготовитьСтруктуруВозврата();
	
	Если ВозвращаемыеДанные = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	Оповестить(Событие,ВозвращаемыеДанные,"ФормаРедактирования");
	
	Модифицированность = Ложь;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПодготовитьСтруктуруВозврата() Экспорт 
	
	АдресТаблицы = СохранитьТаблицу();
	
	Если ЭтоАдресВременногоХранилища(АдресТаблицы) Тогда
		
		Возврат Новый Структура("Наименование,ПравилоЗаполнения,АдресТаблицы",Наименование,Параметры.ПравилоЗаполнения,Параметры.АдресТаблицы);
		
	Иначе 
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция СохранитьТаблицу()
	
	Возврат ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("ТаблицаЗначений"),Параметры.АдресТаблицы);
	
КонецФункции

