#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	

Процедура ЗагрузитьЭлементы() Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		
		ОбновитьЭлемент("01", НСтр("ru = 'Федеральный бюджет'"));
		ОбновитьЭлемент("02", НСтр("ru = 'Бюджет субъекта Российской Федерации'"));
		ОбновитьЭлемент("03", НСтр("ru = 'Бюджеты внутригородских муниципальных образований городов федерального значения'"));
		ОбновитьЭлемент("04", НСтр("ru = 'Бюджет городского округа'"));
		ОбновитьЭлемент("05", НСтр("ru = 'Бюджет муниципального района'"));
		ОбновитьЭлемент("06", НСтр("ru = 'Бюджет Фонда пенсионного и социального страхования Российской Федерации'"));
		ОбновитьЭлемент("07", НСтр("ru = 'Бюджет Фонда социального страхования Российской Федерации'"));
		ОбновитьЭлемент("08", НСтр("ru = 'Бюджет Федерального фонда обязательного медицинского страхования'"));
		ОбновитьЭлемент("09", НСтр("ru = 'Бюджет территориального фонда обязательного медицинского страхования'"));
		ОбновитьЭлемент("10", НСтр("ru = 'Бюджет сельского поселения'"));
		ОбновитьЭлемент("11", НСтр("ru = 'Бюджет городского округа с внутригородским делением'"));
		ОбновитьЭлемент("12", НСтр("ru = 'Бюджет внутригородского района'"));
		ОбновитьЭлемент("13", НСтр("ru = 'Бюджет городского поселения'"));
		ОбновитьЭлемент("14", НСтр("ru = 'Бюджет муниципального округа'"));

	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Метаданные.Справочники.Бюджеты.СтандартныеРеквизиты.Код.Имя);
	
	БюджетнаяКлассификацияПереопределяемый.ПолучитьБлокируемыеРеквизитыОбъекта(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьЭлемент(Знач Код, Знач Наименование)
	
	Ссылка = НайтиПоКоду(Код);
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Объект = СоздатьЭлемент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
		ЗаблокироватьДанныеДляРедактирования(Ссылка);
	КонецЕсли;
	
	Если Объект.Код <> Код Тогда
		Объект.Код = Код;
	КонецЕсли;
	
	Если Объект.НаименованиеПолное <> Наименование Тогда
		Объект.НаименованиеПолное = Наименование;
	КонецЕсли;
	
	Если Объект.Модифицированность() Тогда
		Объект.Записать();
	КонецЕсли;
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗагрузитьЭлементы");
КонецПроцедуры

#КонецОбласти

#КонецЕсли