
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если НЕ Объект.Дата = КонецГода(Объект.Дата) И ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода) Тогда
			Объект.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка");
		КонецЕсли;
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1Сдокументооборотом
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не (Параметры.Ключ.Пустая()
		ИЛИ ЗначениеЗаполнено(Объект.ПроцентИндексации)
		ИЛИ ЗначениеЗаполнено(Объект.СуммаРаспределенная) ) Тогда
		Элементы.ГруппаКорректировкаСтоимостиОбразовательныхУслуг.Скрыть();
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ОтразитьВМежотчетномПериоде Тогда
		Объект.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса");
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ); 
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1Сдокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ДоходыБудущихПериодовЗаполнитьДобавленныеКолонки();
	ПорядокОплатыЗаполнитьДобавленныеКолонки();
	ПорядокУчетаДоходовЗаполнитьДобавленныеКолонки();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ОтразитьВМежотчетномПериоде", ОтразитьВМежотчетномПериоде);
	БухгалтерскийУчетКлиент.ОчиститьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня
	 ИЛИ ЭтотОбъект.КэшПараметров.Локальные.ОтразитьВМежотчетномПериоде <> ОтразитьВМежотчетномПериоде Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
	 ИЛИ ЭтотОбъект.КэшПараметров.Локальные.ОтразитьВМежотчетномПериоде <> ОтразитьВМежотчетномПериоде Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	ПорядокОплатыЗаполнитьДобавленныеКолонки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьПодразделения(ЭтотОбъект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВМежотчетномПериодеПриИзменении(Элемент)
	
	Если ОтразитьВМежотчетномПериоде Тогда
		Объект.Дата = КонецГода(Объект.Дата);
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"));
	Иначе
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка"));
	КонецЕсли;
	
	ОтразитьВМежотчетномПериодеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьВМежотчетномПериодеПриИзмененииНаСервере()
	
	// Может измениться дата определения параметров учетной политики.
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПорядокУчетаДоходовПриИзменении(Элемент)
	
	Если НЕ Объект.ИзменитьПорядокУчетаДоходов Тогда
		
		ИзменитьПорядокУчетаДоходовПриИзмененииНаСервере();
		
	КонецЕсли;
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПорядокУчетаДоходовПриИзмененииНаСервере()
	
	Если НЕ Объект.ИзменитьПорядокУчетаДоходов Тогда
		
		ДанныеУчащихся = Объект.ДоходыБудущихПериодов.Выгрузить(, "Студент,Контрагент,Договор");
		ДанныеУчащихся.Колонки.Договор.Имя = "ДоговорКонтрагента";
		
		// Восстановим прежние значения.
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ЗаполнитьСуммыДоходов", Ложь);
		ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокУчетаДоходов", Истина);
		Документы.КорректировкаДолгосрочныхДоговоровОбразование.ЗаполнитьПоОстаткам(Объект, ДанныеУчащихся,
			ПараметрыЗаполнения.ЗаполнитьСуммыДоходов, ПараметрыЗаполнения.ЗаполнитьПорядокУчетаДоходов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСуммыНаПроцентПриИзменении(Элемент)
	
	Если ИзменитьСуммыНаПроцент Тогда
		Если РаспределитьСуммуПоПериодам Тогда
			РаспределитьСуммуПоПериодам = Ложь;
			Объект.СуммаРаспределенная = 0;
			ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
		КонецЕсли;
	Иначе
		Объект.ПроцентИндексации = 0;
		ПересчитатьСуммыПриИзмененииПроцентаИндексации();
	КонецЕсли;
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентИндексацииПриИзменении(Элемент)
	
	ИзменитьСуммыНаПроцент = ЗначениеЗаполнено(Объект.ПроцентИндексации);
	
	ПересчитатьСуммыПриИзмененииПроцентаИндексации();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСуммуПриИзменении(Элемент)
	
	Если РаспределитьСуммуПоПериодам Тогда
		Если ИзменитьСуммыНаПроцент Тогда
			ИзменитьСуммыНаПроцент = Ложь;
			Объект.ПроцентИндексации = 0;
			ПересчитатьСуммыПриИзмененииПроцентаИндексации();
		КонецЕсли;
	Иначе
		Объект.СуммаРаспределенная = 0;
		ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
	КонецЕсли;
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаРаспределеннаяПриИзменении(Элемент)
	
	РаспределитьСуммуПоПериодам = ЗначениеЗаполнено(Объект.СуммаРаспределенная);
	
	ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПериодуОбученияПриИзменении(Элемент)
	
	Если ВидОтбораПоПериодуОбучения = 0 Тогда // За незавершенные периоды обучения.
		Объект.НачалоПериодаОбучения = Неопределено;
		Объект.КонецПериодаОбучения = Неопределено;
	КонецЕсли;
	
	Если ИзменитьСуммыНаПроцент Тогда
		ПересчитатьСуммыПриИзмененииПроцентаИндексации();
	КонецЕсли;
	Если РаспределитьСуммуПоПериодам Тогда
		ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
	КонецЕсли;
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаОбученияПриИзменении(Элемент)
	
	Если ИзменитьСуммыНаПроцент Тогда
		ПересчитатьСуммыПриИзмененииПроцентаИндексации();
	КонецЕсли;
	Если РаспределитьСуммуПоПериодам Тогда
		ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаОбученияПриИзменении(Элемент)
	
	Если ИзменитьСуммыНаПроцент Тогда
		ПересчитатьСуммыПриИзмененииПроцентаИндексации();
	КонецЕсли;
	Если РаспределитьСуммуПоПериодам Тогда
		ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДоходыБудущихПериодов

&НаКлиенте
Процедура ДоходыБудущихПериодовПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДоходыБудущихПериодов.ТекущиеДанные;
	
	БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
		ЭтотОбъект, ТекущиеДанные.СчетДБП, ДоходыБудущихПериодовПоляАналитикиСчетаДБП());
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДоходыБудущихПериодов.ТекущиеДанные;
	
	Если НЕ Отказ И ТекущиеДанные.ОсобыйПорядокОплаты Тогда
		// Удаляем строки особого графика из табличной части.
		ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
		ОсобыйГрафикОплаты = Объект.ПорядокОплаты.НайтиСтроки(ОтборПоИдентификатору);
		Для Каждого СтрокаГрафика Из ОсобыйГрафикОплаты Цикл
			Объект.ПорядокОплаты.Удалить(Объект.ПорядокОплаты.Индекс(СтрокаГрафика));
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.ДоходыБудущихПериодов.ТекущиеДанные;
		
		Если Копирование Тогда
			ТекущиеДанные.ОстатокДБП = 0;
		КонецЕсли;
		
		ДоходыБудущихПериодовЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовСчетДБППриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДоходыБудущихПериодов.ТекущиеДанные;
	
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
		ТекущиеДанные, ТекущиеДанные.СчетДБП, ДоходыБудущихПериодовПоляАналитикиСчетаДБП());
	БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
		ЭтотОбъект, ТекущиеДанные.СчетДБП, ДоходыБудущихПериодовПоляАналитикиСчетаДБП());
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовКЭКПриИзменении(Элемент)
	
	ДоходыБудущихПериодовКЭКПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДоходыБудущихПериодовКЭКПриИзмененииНаСервере()
	
	ДанныеСтроки = Объект.ДоходыБудущихПериодов.НайтиПоИдентификатору(Элементы.ДоходыБудущихПериодов.ТекущаяСтрока);
	
	НаДату = ?(ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода), КонецГода(Объект.Дата) + 1, Объект.Дата);
	УчетРасчетов.ЗаполнитьПараметрыСчетаИДопСубконтоРасчетов(ДанныеСтроки,
		ДанныеСтроки.КЭК, "205.00", НаДату, Объект.Организация, Объект.ИФО);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовСчетРасчетовПриИзменении(Элемент)
	
	ДоходыБудущихПериодовСчетРасчетовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДоходыБудущихПериодовСчетРасчетовПриИзмененииНаСервере()
	
	ДанныеСтроки = Объект.ДоходыБудущихПериодов.НайтиПоИдентификатору(Элементы.ДоходыБудущихПериодов.ТекущаяСтрока);
	
	ДанныеСтроки.ДопСубконтоРасчетов = Неопределено;
	
	НаДату = ?(ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода), КонецГода(Объект.Дата) + 1, Объект.Дата);
	УчетРасчетов.ЗаполнитьПараметрыСчетаИДопСубконтоРасчетов(ДанныеСтроки,
		ДанныеСтроки.КЭК, "205.00", НаДату, Объект.Организация, Объект.ИФО, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовДопСубконтоРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДоходыБудущихПериодов.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДопСубконтоРасчетовВид) Тогда
		ПараметрыВыбораДопСубконто = Новый Структура;
		ПараметрыВыбораДопСубконто.Вставить("Организация",   Объект.Организация);
		ПараметрыВыбораДопСубконто.Вставить("Счет",          ТекущиеДанные.СчетРасчетов);
		ПараметрыВыбораДопСубконто.Вставить("НомерСубконто", ТекущиеДанные.ДопСубконтоРасчетовНомер);
		ПараметрыВыбораДопСубконто.Вставить("Субконто" + ТекущиеДанные.ДопСубконтоРасчетовНомер, ТекущиеДанные.ДопСубконтоРасчетов);
		БухгалтерскийУчетКлиент.ПриНачалеВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, ПараметрыВыбораДопСубконто);
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовВсегоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДоходыБудущихПериодов.ТекущиеДанные;
	
	Если ТекущиеДанные.Всего < 0 // Уменьшаем сумму.
		И ТекущиеДанные.ОстатокДБП + ТекущиеДанные.Всего < 0 Тогда
		ТекущиеДанные.Всего = (-1) * ТекущиеДанные.ОстатокДБП;
	КонецЕсли;
	
	ДоходыБудущихПериодовЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ДоходыБудущихПериодовЗаполнитьДобавленныеКолонки()
	
	НаДату = ?(ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода), КонецГода(Объект.Дата) + 1, Объект.Дата);
	
	Для Каждого СтрокаТаблицы Из Объект.ДоходыБудущихПериодов Цикл
		
		УчетРасчетов.ЗаполнитьПараметрыСчетаИДопСубконтоРасчетов(СтрокаТаблицы,
			СтрокаТаблицы.КЭК, "205.00", НаДату, Объект.Организация, Объект.ИФО, Истина);
		
		ДоходыБудущихПериодовЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДоходыБудущихПериодовПоляАналитикиСчетаДБП()

	// Пути к данным полей аналитики счета, выбираемого в таблице формы.
	Возврат Новый Структура("Счет, КПС, КЭК, Подразделение",
		"Объект.ДоходыБудущихПериодов.СчетДБП",
		"Объект.ДоходыБудущихПериодов.КПС",
		"Объект.ДоходыБудущихПериодов.КЭК",
		"Объект.ДоходыБудущихПериодов.Подразделение");

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ДоходыБудущихПериодовЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(Форма, СтрокаТаблицы)
	
	НастройкиСчетовУчетаДБП = Форма.КэшПараметров.Локальные.НастройкиСчетовУчетаДБП;
	Если ТипЗнч(НастройкиСчетовУчетаДБП) = Тип("Соответствие")
		И НастройкиСчетовУчетаДБП[СтрокаТаблицы.СчетДБП] <> Неопределено Тогда
		СтрокаТаблицы.СчетДБПВалютный = НастройкиСчетовУчетаДБП[СтрокаТаблицы.СчетДБП].Валютный;
	Иначе
		СтрокаТаблицы.СчетДБПВалютный = Ложь;
	КонецЕсли;
	СтрокаТаблицы.ВалютаРеглУчета = Форма.КэшПараметров.ВалютаРегламентированногоУчета;
	
	Если Форма.КэшПараметров.ИспользоватьВалютныйУчет
	И СтрокаТаблицы.СчетДБПВалютный
	И ЗначениеЗаполнено(СтрокаТаблицы.Валюта)
	И СтрокаТаблицы.Валюта <> СтрокаТаблицы.ВалютаРеглУчета Тогда
		СтрокаТаблицы.ПослеИзмененияВсего = СтрокаТаблицы.ОстатокДБПВВалюте + СтрокаТаблицы.Всего;
	Иначе // В рублях.
		СтрокаТаблицы.ПослеИзмененияВсего = СтрокаТаблицы.ОстатокДБП + СтрокаТаблицы.Всего;
	КонецЕсли;
	
	// Поля СуммаРуб и ВсегоРуб отображаются информационно, рассчитываются по курсу, определяемому по остатку 401.4х.
	КурсПересчета = ?(СтрокаТаблицы.ОстатокДБПВВалюте = 0, 1, СтрокаТаблицы.ОстатокДБП / СтрокаТаблицы.ОстатокДБПВВалюте);
	СтрокаТаблицы.ВсегоРуб = СтрокаТаблицы.Всего * КурсПересчета;
	СтрокаТаблицы.ПослеИзмененияВсегоРуб = СтрокаТаблицы.ПослеИзмененияВсего * КурсПересчета;
	
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
		СтрокаТаблицы, СтрокаТаблицы.СчетДБП, ДоходыБудущихПериодовПоляАналитикиСчетаДБП());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПорядокОплаты

&НаКлиенте
Процедура ПорядокОплатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		
		ТекущаяСтрока = Элементы.ПорядокОплаты.ТекущиеДанные;
		ТекущаяСтрока.СуммаВВалютеДоИзменений = 0;
		ТекущаяСтрока.СуммаВВалюте = ТекущаяСтрока.СуммаВВалютеПослеИзменений;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ПорядокОплаты.ТекущиеДанные;
	Отказ = (ТекущаяСтрока.СуммаВВалютеДоИзменений <> 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.ПорядокОплаты.ТекущиеДанные;
	
	Если ТекущиеДанные.НачалоПериода > ТекущиеДанные.КонецПериода Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Дата начала периода превышает дату окончания!'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Объект.ПорядокОплаты.Сортировать("ИдентификаторСтроки,ОплатитьДо");
	
	ИтогСуммаОплатыПоОбщемуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыПослеУдаления(Элемент)
	
	ИтогСуммаОплатыПоОбщемуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыСуммаВВалютеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПорядокОплаты.ТекущиеДанные;
	ТекущиеДанные.СуммаВВалютеПослеИзменений = ТекущиеДанные.СуммаВВалютеДоИзменений + ТекущиеДанные.СуммаВВалюте;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыСуммаВВалютеПослеИзмененийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПорядокОплаты.ТекущиеДанные;
	ТекущиеДанные.СуммаВВалюте = ТекущиеДанные.СуммаВВалютеПослеИзменений - ТекущиеДанные.СуммаВВалютеДоИзменений;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыКонецПериодаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПорядокОплаты.ТекущиеДанные;
	ПорядокОплатыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ТекущиеДанные, Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ПорядокОплатыЗаполнитьДобавленныеКолонки()
	
	Для Каждого СтрокаТаблицы Из Объект.ПорядокОплаты Цикл
		
		ПорядокОплатыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(СтрокаТаблицы, Объект.Дата);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПорядокОплатыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(СтрокаТаблицы, ДатаДокумента)
	
	СтрокаТаблицы.ПериодЗавершен = ( КонецДня(СтрокаТаблицы.КонецПериода) <= КонецДня(ДатаДокумента) );
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОсобыйПорядокОплаты

&НаКлиенте
Процедура НачисленияОсобыйПорядокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачислениеИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
	НачислениеОсобыйПорядокОплаты = ТекущиеДанные.ОсобыйПорядокОплаты;
	
	Элементы.НачислениеПредставление.Заголовок =
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, %2 %3'"),
			ТекущиеДанные.Студент,
			ТекущиеДанные.Всего,
			БухгалтерскийУчетВызовСервераПовтИсп.ВалютаРегламентированногоУчета());
	
	ИтогСуммаОплатыПоОсобомуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект, ТекущиеДанные.ИдентификаторСтроки);
	
	УстановитьВидимостьЭлементовОсобыйПорядокОплаты(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("НачисленияОсобыйПорядокУстановитьОтборВТаблице", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеОсобыйПорядокОплатыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ОсобыйПорядокОплаты = НачислениеОсобыйПорядокОплаты;
	
	Если НачислениеОсобыйПорядокОплаты Тогда // Установили особый порядок оплаты.
		
		// Начисления с особым порядком оплаты маркируем уникальным идентификатором.
		ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		
		// Добавляем строки особого графика в табличную часть.
		ОтборПоПустомуИдентификатору = Новый Структура("ИдентификаторСтроки",
			Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		ОбщийГрафикОплаты = Объект.ПорядокОплаты.НайтиСтроки(ОтборПоПустомуИдентификатору);
		Для Каждого СтрокаГрафика Из ОбщийГрафикОплаты Цикл
			НоваяСтрока = Объект.ПорядокОплаты.Добавить();
			НоваяСтрока.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаГрафика,
				"ОплатитьДо,СуммаВВалюте,СуммаВВалютеДоИзменений,СуммаВВалютеПослеИзменений,Валюта,НачалоПериода,КонецПериода,Примечание");
		КонецЦикла;
		
	Иначе // Отменили особый порядок оплаты.
		
		// Удаляем строки особого графика из табличной части.
		ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
		ОсобыйГрафикОплаты = Объект.ПорядокОплаты.НайтиСтроки(ОтборПоИдентификатору);
		Для Каждого СтрокаГрафика Из ОсобыйГрафикОплаты Цикл
			Объект.ПорядокОплаты.Удалить(Объект.ПорядокОплаты.Индекс(СтрокаГрафика));
		КонецЦикла;
		
		// Очистили уникальный идентификатор в строке начисления.
		ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		
	КонецЕсли;
	
	УстановитьВидимостьЭлементовОсобыйПорядокОплаты(ЭтотОбъект);
	НачисленияОсобыйПорядокУстановитьОтборВТаблице();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПорядокОплатыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ОсобыйПорядокОплаты.ТекущиеДанные;
	Отказ = (ТекущиеДанные.СуммаВВалютеДоИзменений <> 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПорядокОплатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.ОсобыйПорядокОплаты.ТекущиеДанные;
		
		Если Копирование Тогда
			
			ТекущиеДанные.СуммаВВалютеДоИзменений = 0;
			ТекущиеДанные.СуммаВВалюте = ТекущиеДанные.СуммаВВалютеПослеИзменений;
			
		Иначе
			
			ТекущиеНачисление = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
			Если ТекущиеНачисление = Неопределено Тогда
				Отказ = Истина;
			Иначе
				ТекущиеДанные.ИдентификаторСтроки = ТекущиеНачисление.ИдентификаторСтроки;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПорядокОплатыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.ОсобыйПорядокОплаты.ТекущиеДанные;
	
	Если ТекущиеДанные.НачалоПериода > ТекущиеДанные.КонецПериода Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Дата начала периода превышает дату окончания!'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПорядокОплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Объект.ПорядокОплаты.Сортировать("ИдентификаторСтроки,ОплатитьДо");
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИтогСуммаОплатыПоОсобомуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект, ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПорядокОплатыПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИтогСуммаОплатыПоОсобомуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект, ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПорядокОплатыСуммаВВалютеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсобыйПорядокОплаты.ТекущиеДанные;
	ТекущиеДанные.СуммаВВалютеПослеИзменений = ТекущиеДанные.СуммаВВалютеДоИзменений + ТекущиеДанные.СуммаВВалюте;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПорядокОплатыСуммаВВалютеПослеИзмененийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсобыйПорядокОплаты.ТекущиеДанные;
	ТекущиеДанные.СуммаВВалюте = ТекущиеДанные.СуммаВВалютеПослеИзменений - ТекущиеДанные.СуммаВВалютеДоИзменений;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПорядокОплатыКонецПериодаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсобыйПорядокОплаты.ТекущиеДанные;
	ПорядокОплатыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ТекущиеДанные, Объект.Дата);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПорядокОплаты

&НаКлиенте
Процедура ПорядокУчетаДоходовПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ПорядокУчетаДоходов.ТекущиеДанные;
	БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
		ЭтотОбъект, ТекущиеДанные.СчетДоходов, ПорядокУчетаДоходовПоляАналитикиСчетаДоходов());
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокУчетаДоходовСчетДоходовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПорядокУчетаДоходов.ТекущиеДанные;
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
		ТекущиеДанные, ТекущиеДанные.СчетДоходов, ПорядокУчетаДоходовПоляАналитикиСчетаДоходов());
	БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
		ЭтотОбъект, ТекущиеДанные.СчетДоходов, ПорядокУчетаДоходовПоляАналитикиСчетаДоходов());
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПорядокУчетаДоходовПоляАналитикиСчетаДоходов()

	// Пути к данным полей аналитики счета, выбираемого в таблице формы.
	Возврат Новый Структура("Счет, Субконто1, Субконто2, Субконто3",
		"Объект.ПорядокУчетаДоходов.СчетДоходов",
		"Объект.ПорядокУчетаДоходов.СубконтоДоходов1",
		"Объект.ПорядокУчетаДоходов.СубконтоДоходов2",
		"Объект.ПорядокУчетаДоходов.СубконтоДоходов3");

КонецФункции

&НаСервере
Процедура ПорядокУчетаДоходовЗаполнитьДобавленныеКолонки()
	
	Для Каждого СтрокаТаблицы Из Объект.ПорядокУчетаДоходов Цикл
		
		БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
			СтрокаТаблицы, СтрокаТаблицы.СчетДоходов, ПорядокУчетаДоходовПоляАналитикиСчетаДоходов());
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьУчащимися(Команда)
	
	Отказ = Ложь;
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Организация",, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Факультет'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Подразделение",, Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Если Объект.ДоходыБудущихПериодов.Количество() > 0 Тогда
			ДопПараметры = Новый Структура("ИмяМакета", "ПодборСПлательщиком");
			
			Если Объект.Проведен Тогда
				ТекстВопроса = НСтр("ru='Проведение документа будет отменено.
					|Документ уже заполнен, выберите необходимое действие:'"); 
			Иначе
				ТекстВопроса = НСтр("ru='Документ уже заполнен, выберите необходимое действие:'"); 
			КонецЕсли;
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить("Перезаполнить", "Перезаполнить документ");
			СписокКнопок.Добавить("Добавить", "Добавить по отбору");
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
			
			Оповещение = Новый ОписаниеОповещения("ОбработкаВопросаПередЗаполнением", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок, , КодВозвратаДиалога.Отмена);
		Иначе
			ВызватьОкноОтбора("ПодборСПлательщиком");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуКорректировки(Команда)
	
	Подсказка = НСтр("ru='Введите сумму корректировки:'");
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьСуммуКорректировкиЗавершение", ЭтотОбъект);
	ПоказатьВводЧисла(Оповещение, 0, Подсказка, 15, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуКорректировкиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.ДоходыБудущихПериодов.ВыделенныеСтроки Цикл
			СтрокаДБП = Объект.ДоходыБудущихПериодов.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
			СтрокаДБП.Всего = Результат;
			СтрокаДБП.ПослеИзмененияВсего = СтрокаДБП.ОстатокДБП + СтрокаДБП.Всего;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбщийПорядокОплатыИзШаблона(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторСтроки", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьШаблонГрафикаОплатыЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВводЗначения(Оповещение, Неопределено, "Выберите график оплаты", Тип("СправочникСсылка.ГрафикиОплатыОбразование"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОсобыйПорядокОплатыИзШаблона(Команда)
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьШаблонГрафикаОплатыЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВводЗначения(Оповещение, Неопределено, "Выберите график оплаты", Тип("СправочникСсылка.ГрафикиОплатыОбразование"));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОбщийПорядокОплатыВШаблон(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторСтроки", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Оповещение = Новый ОписаниеОповещения("СохранитьШаблонГрафикаОплатыЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВводЗначения(Оповещение, Неопределено, "Введите наименование графика оплаты", Тип("Строка"));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОсобыйПорядокОплатыВШаблон(Команда)
	
	ТекущиеДанные = Элементы.ОсобыйПорядокОплаты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьШаблонГрафикаОплатыЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВводЗначения(Оповещение, Неопределено, "Введите наименование графика оплаты", Тип("Строка"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПериодуОбучения(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = Объект.НачалоПериодаОбучения;
	Диалог.Период.ДатаОкончания = Объект.КонецПериодаОбучения;
	Диалог.Показать(Новый ОписаниеОповещения("УстановитьОтборПоПериодуОбученияЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПериодуОбученияЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		
		Объект.НачалоПериодаОбучения = Период.ДатаНачала;
		Объект.КонецПериодаОбучения  = Период.ДатаОкончания;
		
		Модифицированность = Истина;
		
		Если ИзменитьСуммыНаПроцент Тогда
			ПересчитатьСуммыПриИзмененииПроцентаИндексации();
		КонецЕсли;
		Если РаспределитьСуммуПоПериодам Тогда
			ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1Сдокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("НастройкиСчетовУчетаДБП",
		УчетДоходовРасходов.НастройкиСчетовУчетаДБП());
	
	// Отбор строк на странице "Общий порядок оплаты".
	Элементы.ПорядокОплаты.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтроки",
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ИтогСуммаОплатыПоОбщемуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	// Увеличение (уменьшение) стоимости образовательных услуг.
	ИзменитьСуммыНаПроцент = ЗначениеЗаполнено(Объект.ПроцентИндексации);
	РаспределитьСуммуПоПериодам = ЗначениеЗаполнено(Объект.СуммаРаспределенная);
	ВидОтбораПоПериодуОбучения = ЗначениеЗаполнено(Объект.НачалоПериодаОбучения) ИЛИ ЗначениеЗаполнено(Объект.КонецПериодаОбучения);
	
	Элементы.ПорядокУчетаДоходовСпособПризнанияДоходов.ПараметрыВыбора =
		Перечисления.СпособыПризнанияРасходов.ПараметрыВыбораСпособаПризнанияДоходов(Перечисления.ВидыОперацийНачисленияДБП.ДолгосрочныйДоговорОбразование);
	
	ДоходыБудущихПериодовЗаполнитьДобавленныеКолонки();
	ПорядокОплатыЗаполнитьДобавленныеКолонки();
	ПорядокУчетаДоходовЗаполнитьДобавленныеКолонки();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	УстановитьВидимостьЭлементовОсобыйПорядокОплаты(ЭтотОбъект);
	
	БухгалтерскийУчетКлиентСервер.УстановитьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	УстановитьДоступностьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭлементыПорядокУчетаДоходов = Новый Массив;
	ЭлементыПорядокУчетаДоходов.Добавить("ПорядокУчетаДоходов");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыПорядокУчетаДоходов, "Доступность", Объект.ИзменитьПорядокУчетаДоходов);
	
	// Увеличение (уменьшение) стоимости образовательных услуг.
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПроцентИндексации", "Доступность", Форма.ИзменитьСуммыНаПроцент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СуммаРаспределенная", "Доступность", Форма.РаспределитьСуммуПоПериодам);
	
	ЭлементыОтборПоПериодуОбучения = Новый Массив;
	ЭлементыОтборПоПериодуОбучения.Добавить("НачалоПериодаОбучения");
	ЭлементыОтборПоПериодуОбучения.Добавить("КонецПериодаОбучения");
	ЭлементыОтборПоПериодуОбучения.Добавить("УстановитьОтборПоПериодуОбучения");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыОтборПоПериодуОбучения, "Доступность", Форма.ВидОтбораПоПериодуОбучения <> 0);
	
	// Графики оплаты.
	КомандыЗагрузитьПорядокОплаты = Новый Массив;
	КомандыЗагрузитьПорядокОплаты.Добавить("ПорядокОплатыЗагрузитьИзШаблона");
	КомандыЗагрузитьПорядокОплаты.Добавить("ОсобыйПорядокОплатыЗагрузитьИзШаблона");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		КомандыЗагрузитьПорядокОплаты, "Доступность", НЕ Форма.ИзменитьСуммыНаПроцент И НЕ Форма.РаспределитьСуммуПоПериодам);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовОсобыйПорядокОплаты(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭлементыОсобыйПорядокОплаты = Новый Массив;
	ЭлементыОсобыйПорядокОплаты.Добавить("ОсобыйПорядокОплаты");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыОсобыйПорядокОплаты, "Доступность", Форма.НачислениеОсобыйПорядокОплаты);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Счета учета доступны для редактирования только в строках, введенных вручную.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовКПС");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовКФО");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовСчетДБП");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовКЭК");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовПодразделение");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ДоходыБудущихПериодов.ОстатокДБП", ВидСравненияКомпоновкиДанных.НеРавно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	
	// Доходы будущих периодов в валюте.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовОстатокДБПВВалюте");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовВалюта");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовВалютаРеглУчета");
	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор,, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"Объект.ДоходыБудущихПериодов.СчетДБПВалютный", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"Объект.ДоходыБудущихПериодов.Валюта", ВидСравненияКомпоновкиДанных.Равно, ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"Объект.ДоходыБудущихПериодов.Валюта", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Реквизиты порядка оплаты доступны для редактирования только в строках, введенных вручную.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокОплатыОплатитьДо");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокОплатыВалюта");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокОплатыНачалоПериода");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокОплатыКонецПериода");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОсобыйПорядокОплатыОплатитьДо");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОсобыйПорядокОплатыВалюта");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОсобыйПорядокОплатыНачалоПериода");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОсобыйПорядокОплатыКонецПериода");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ПорядокОплаты.СуммаВВалютеДоИзменений", ВидСравненияКомпоновкиДанных.НеРавно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	
	// Параметры списания ДБП.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокУчетаДоходовДатаНачалаСписания");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокУчетаДоходовДатаОкончанияСписания");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ПорядокУчетаДоходов.СпособПризнанияДоходов",
			ВидСравненияКомпоновкиДанных.Равно, Перечисления.СпособыПризнанияРасходов.ПоГрафику);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Статья прочих доходов (НУ).
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокУчетаДоходовСтатьяПрочихДоходовНУ");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ПорядокУчетаДоходов.СчетДоходовНУ",
			ВидСравненияКомпоновкиДанных.НеРавно, БухгалтерскийУчет.СчетПоКоду("Н91.01", Объект.Дата));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	БухгалтерскийУчет.УстановитьУсловноеОформлениеПолейАналитикиСчета(
		УсловноеОформление, ДоходыБудущихПериодовПоляАналитикиСчетаДБП());
	БухгалтерскийУчет.УстановитьУсловноеОформлениеПолейАналитикиСчета(
		УсловноеОформление, ПорядокУчетаДоходовПоляАналитикиСчетаДоходов());
	УчетРасчетов.УстановитьУсловноеОформлениеСчетаИДопСубконтоРасчетов(
		УсловноеОформление, "ДоходыБудущихПериодов");
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияОсобыйПорядокУстановитьОтборВТаблице()
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		НовыйОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтроки",
			Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Иначе
		НовыйОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтроки",
			ТекущиеДанные.ИдентификаторСтроки);
	КонецЕсли;
	
	ТекущийОтборСтрок = Элементы.ОсобыйПорядокОплаты.ОтборСтрок;
	Если ТекущийОтборСтрок = Неопределено
	 ИЛИ ТекущийОтборСтрок.ИдентификаторСтроки <> НовыйОтборСтрок.ИдентификаторСтроки Тогда
		Элементы.ОсобыйПорядокОплаты.ОтборСтрок = НовыйОтборСтрок;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьИтоговуюСуммуОплатыПоГрафику(Форма, ИдентификаторСтроки)
	
	Объект = Форма.Объект;
	
	ОтборСтрок = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	ОбщийГрафикОплаты = Объект.ПорядокОплаты.НайтиСтроки(ОтборСтрок);
	
	ИтогСуммаОплатыПоГрафику = 0;
	Для Каждого СтрокаГрафика Из ОбщийГрафикОплаты Цикл
		ИтогСуммаОплатыПоГрафику = ИтогСуммаОплатыПоГрафику + СтрокаГрафика.СуммаВВалюте;
	КонецЦикла;
	
	Возврат ИтогСуммаОплатыПоГрафику;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВопросаПередЗаполнением(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Результат = "Перезаполнить" Тогда
		Объект.ДоходыБудущихПериодов.Очистить();
	КонецЕсли;
	
	ИмяМакета = ДопПараметры.ИмяМакета;
	
	ВызватьОкноОтбора(ИмяМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОтбору(Результат, ДопПараметры) Экспорт
	
	Адреса = ДопПараметры.Адреса;
	ИмяМакета = ДопПараметры.ИмяМакета;
	
	Если Результат <> Неопределено Тогда
		
		Адреса.НастройкиКомпоновкиДанных = Результат;
		ЗаполнитьУчащимисяСервер(Адреса);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьОкноОтбора(ИмяМакета)
	
	Адреса = РаботаСоСтудентамиВызовСервера.ПолучитьАдресаСКДПодбора(ИмяМакета, УникальныйИдентификатор);
	
	ПараметрыФормы = РаботаСоСтудентамиКлиент.ПараметрыФормыУпрощеннойНастройкиСхемыКомпоновкиДанных(Адреса, УникальныйИдентификатор);
	ПараметрыФормы.Заголовок = СтрШаблон(НСтр("ru = 'Настройка параметров отбора учащихся (значения на %1)'"), Формат(Объект.Дата, "ДЛФ=DD"));
	
	ДопПараметры = Новый Структура("Адреса, ИмяМакета", Адреса, ИмяМакета);
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоОтбору", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("ОбщаяФорма.УпрощеннаяНастройкаСхемыКомпоновкиДанных", ПараметрыФормы, ЭтаФорма, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчащимисяСервер(Адреса)
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	ДанныеУчащихся = РаботаСоСтудентами.ПолучитьДанныеПодбораУчащихся(Адреса,
		Объект.Организация, Объект.Подразделение, Объект.Дата);
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ЗаполнитьСуммыДоходов", Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокУчетаДоходов", Истина);
	Документы.КорректировкаДолгосрочныхДоговоровОбразование.ЗаполнитьПоОстаткам(Объект, ДанныеУчащихся,
		ПараметрыЗаполнения.ЗаполнитьСуммыДоходов, ПараметрыЗаполнения.ЗаполнитьПорядокУчетаДоходов);
	
	ДоходыБудущихПериодовЗаполнитьДобавленныеКолонки();
	ПорядокОплатыЗаполнитьДобавленныеКолонки();
	ПорядокУчетаДоходовЗаполнитьДобавленныеКолонки();
	
	УстановитьПредупреждение();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредупреждение()
	
	Если Объект.ДоходыБудущихПериодов.Количество() > 0 Тогда
		
		Элементы.Организация.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.Подразделение.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		
	Иначе
		
		Элементы.Организация.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
		Элементы.Подразделение.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШаблонГрафикаОплатыЗавершение(ВыбранныйГрафикОплат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранныйГрафикОплат) Тогда
		
		ИтоговаяСуммаПоГрафику = ЗагрузитьШаблонГрафикаОплатыНаСервере(ВыбранныйГрафикОплат, ДопПараметры.ИдентификаторСтроки);
		
		Если НЕ ЗначениеЗаполнено(ДопПараметры.ИдентификаторСтроки) Тогда // Общий порядок оплаты.
			УстановитьВидимостьЭлементов(ЭтотОбъект);
			ТекстВопроса = СтрШаблон(НСтр("ru = 'Установить сумму корректировки доходов будущих периодов %1 для учащихся с общим порядком оплаты?'"),
				Формат(ИтоговаяСуммаПоГрафику, "ЧЦ=15;ЧДЦ=2"));
		Иначе // Особый порядок оплаты.
			УстановитьВидимостьЭлементовОсобыйПорядокОплаты(ЭтотОбъект);
			ТекстВопроса = СтрШаблон(НСтр("ru = 'Установить сумму корректировки доходов будущих периодов %1 для выбранного учащегося?'"),
				Формат(ИтоговаяСуммаПоГрафику, "ЧЦ=15;ЧДЦ=2"));
		КонецЕсли;
		
		ДопПараметры.Вставить("ИтоговаяСуммаПоГрафику", ИтоговаяСуммаПоГрафику);
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьСуммуПоГрафикуОплатЗавершение", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьШаблонГрафикаОплатыНаСервере(ВыбранныйГрафикОплат, ИдентификаторСтроки)
	
	ОсобыйПорядокОплаты = ЗначениеЗаполнено(ИдентификаторСтроки);
	
	// Обнуляем суммы в строках по выбранному идентификатору из табличной части.
	ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	СтрокиПоИдентификатору = Объект.ПорядокОплаты.НайтиСтроки(ОтборПоИдентификатору);
	Для Каждого СтрокаГрафика Из СтрокиПоИдентификатору Цикл
		СтрокаГрафика.СуммаВВалюте = 0;
		СтрокаГрафика.СуммаВВалютеПослеИзменений = СтрокаГрафика.СуммаВВалютеДоИзменений;
	КонецЦикла;
	
	// Заполняем график оплат по выбранному графику оплат.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГрафикиОплатыОбразование.Ссылка КАК Ссылка,
	|	ГрафикиОплатыОбразование.Валюта КАК Валюта,
	|	ГрафикиОплатыОбразование.РежимВводаГрафикаОплаты КАК РежимВводаГрафикаОплаты,
	|	ГрафикиОплатыОбразование.ПорядокОплаты.(
	|		НомерСтроки КАК НомерСтроки,
	|		ОплатитьДо КАК ОплатитьДо,
	|		СуммаПроцент КАК СуммаПроцент,
	|		НачалоПериода КАК НачалоПериода,
	|		КонецПериода КАК КонецПериода,
	|		Примечание КАК Примечание
	|	) КАК ПорядокОплаты
	|ИЗ
	|	Справочник.ГрафикиОплатыОбразование КАК ГрафикиОплатыОбразование
	|ГДЕ
	|	ГрафикиОплатыОбразование.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОплатитьДо,
	|	НачалоПериода,
	|	КонецПериода";
	Запрос.УстановитьПараметр("Ссылка", ВыбранныйГрафикОплат);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.РежимВводаГрафикаОплаты <> 0 Тогда
			Продолжить; // Только графики оплат в абсолютных величинах (суммы платежей) подходят.
		КонецЕсли;
		
		ВыборкаПорядокОплаты = Выборка.ПорядокОплаты.Выбрать();
		Пока ВыборкаПорядокОплаты.Следующий() Цикл
			
			Если КонецДня(Объект.Дата) < КонецДня(ВыборкаПорядокОплаты.КонецПериода) Тогда
				
				// Сумма по строкам графика с периодами обучения, которые еще не завершились, должна соответствовать остатку ДБП,
				// т.к. доходы текущего периода признаем на дату окончания периода обучения.
				ОтборСтрокПоПериодуОбучения = Новый Структура("ИдентификаторСтроки,ОплатитьДо,НачалоПериода,КонецПериода,Валюта",
					ИдентификаторСтроки,
					ВыборкаПорядокОплаты.ОплатитьДо,
					ВыборкаПорядокОплаты.НачалоПериода,
					ВыборкаПорядокОплаты.КонецПериода,
					Выборка.Валюта);
				НайденныеСтроки = Объект.ПорядокОплаты.НайтиСтроки(ОтборСтрокПоПериодуОбучения);
				Если НайденныеСтроки.Количество() = 0 Тогда
					// Строки выбранного графика оплаты нет в документе, добавляем.
					НоваяСтрока = Объект.ПорядокОплаты.Добавить();
					НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПорядокОплаты,
						"ОплатитьДо,НачалоПериода,КонецПериода,Примечание");
					НоваяСтрока.Валюта = Выборка.Валюта;
					НоваяСтрока.СуммаВВалютеДоИзменений    = 0;
					НоваяСтрока.СуммаВВалютеПослеИзменений = ВыборкаПорядокОплаты.СуммаПроцент;
					НоваяСтрока.СуммаВВалюте               = НоваяСтрока.СуммаВВалютеПослеИзменений - НоваяСтрока.СуммаВВалютеДоИзменений;
				Иначе
					// Устанавливаем сумму из выбранного графика оплаты в первой найденной строке.
					НайденныеСтроки[0].СуммаВВалютеПослеИзменений = ВыборкаПорядокОплаты.СуммаПроцент;
					НайденныеСтроки[0].СуммаВВалюте = НайденныеСтроки[0].СуммаВВалютеПослеИзменений - НайденныеСтроки[0].СуммаВВалютеДоИзменений;
				КонецЕсли;
			Иначе
				Продолжить; // Завершенные периоды обучения пропускаем.
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ОсобыйПорядокОплаты Тогда
		ИтогСуммаОплатыПоОсобомуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
			ИдентификаторСтроки);
		Возврат ИтогСуммаОплатыПоОсобомуГрафику;
	Иначе
		ИтогСуммаОплатыПоОбщемуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
			Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		Возврат ИтогСуммаОплатыПоОбщемуГрафику;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СохранитьШаблонГрафикаОплатыЗавершение(НаименованиеГрафикаОплаты, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(НаименованиеГрафикаОплаты) Тогда
		
		СохранитьШаблонГрафикаОплатыНаСервере(НаименованиеГрафикаОплаты, ДопПараметры.ИдентификаторСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьШаблонГрафикаОплатыНаСервере(НаименованиеГрафикаОплаты, ИдентификаторСтроки)
	
	ОсобыйПорядокОплаты = ЗначениеЗаполнено(ИдентификаторСтроки);
	
	ГрафикОплатОбъект = Справочники.ГрафикиОплатыОбразование.СоздатьЭлемент();
	ГрафикОплатОбъект.Наименование = НаименованиеГрафикаОплаты;
	ГрафикОплатОбъект.РежимВводаГрафикаОплаты = 0; // В абсолютных величинах (суммы платежей).
	ГрафикОплатОбъект.Валюта = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
	
	// Сохраняем строки по выбранному идентификатору из табличной части.
	ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	СтрокиПоИдентификатору = Объект.ПорядокОплаты.НайтиСтроки(ОтборПоИдентификатору);
	Для Каждого СтрокаГрафика Из СтрокиПоИдентификатору Цикл
		НоваяСтрока = ГрафикОплатОбъект.ПорядокОплаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаГрафика,
			"ОплатитьДо,НачалоПериода,КонецПериода,Примечание");
		НоваяСтрока.СуммаПроцент = СтрокаГрафика.СуммаВВалютеПослеИзменений;
	КонецЦикла;
	
	Попытка
		ГрафикОплатОбъект.Записать();
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Записан новый элемент ""%1"" справочника ""Графики оплат"" в разделе ""Платное обучение - Долгосрочные договоры"".'"), НаименованиеГрафикаОплаты);
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось записать новый элемент справочника ""Графики оплат (образование)"".'")
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

// Прочее.

&НаКлиенте
Процедура ЗаполнитьСуммуПоГрафикуОплатЗавершение(РезультатВопроса, ДопПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ДопПараметры.ИдентификаторСтроки);
	НайденныеСтроки = Объект.ДоходыБудущихПериодов.НайтиСтроки(ОтборПоИдентификатору);
	Для Каждого СтрокаДокумента Из НайденныеСтроки Цикл
		СтрокаДокумента.Всего = ДопПараметры.ИтоговаяСуммаПоГрафику;
		ДоходыБудущихПериодовЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, СтрокаДокумента);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыПриИзмененииПроцентаИндексации()
	
	Документы.КорректировкаДолгосрочныхДоговоровОбразование.ИзменитьСуммыНаПроцент(Объект);
	
	ДоходыБудущихПериодовЗаполнитьДобавленныеКолонки();
	
	ИтогСуммаОплатыПоОбщемуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ИтогСуммаОплатыПоОсобомуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
		НачислениеИдентификаторСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыПриИзмененииСуммыРаспределенная()
	
	Документы.КорректировкаДолгосрочныхДоговоровОбразование.РаспределитьСуммуПоПериодам(Объект);
	
	ДоходыБудущихПериодовЗаполнитьДобавленныеКолонки();
	
	ИтогСуммаОплатыПоОбщемуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ИтогСуммаОплатыПоОсобомуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
		НачислениеИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьПодразделения(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Подразделение",
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация));

КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
