
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ТаможенныйПлатеж Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ПоказательПериода","Заголовок","Код таможенного органа (107)");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Интерактивное создание элементов справочника ""Шаблоны реквизитов для Начисления от посредника"" не предусмотрено.'"));
	КонецЕсли;
КонецПроцедуры
