#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Добавить данные для печати0510448.
// 
// Параметры:
//  ДанныеДокументов - см. УправлениеПечатьюБГУ.ТаблицаШапкиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448
//  МассивОбъектов - Массив из ДокументОбъект.ПринятиеКУчетуОбъектовОС
//  МЗПоСебестоимости - Булево - не используется для печати ОС
Процедура ДобавитьДанныеДляПечати0510448(ДанныеДокументов, МассивОбъектов, МЗПоСебестоимости = Ложь) Экспорт
	Документы.ПринятиеКУчетуОбъектовОС.ДобавитьДанныеДляПечати0510448(ДанныеДокументов, МассивОбъектов, МЗПоСебестоимости);
КонецПроцедуры

// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Формирует таблицу разделителей для формирования нескольких документов "Списание объектов ОС, НМА, НПА (имущество казны)"
// на основании одного документа
// 
// Параметры:
//  - ДокументОснование - ДокументСсылка.РешениеОПрекращенииПризнанияАктивом,
//						ДокументСсылка.ИнвентаризационнаяОписьНФА  - документ-основание
//  - СсылкаЦелевогоДокумента - ДокументСсылка.СписаниеОбъектовИК - ссылка на текущий документ.
//						Следует передавать, только, если ссылка не пустая. Если передан, то данные этого 
//                      документа не учитываются, как отработанные. Передается, если документ заполняется
//                      из формы самого документа (при выборе документа-основания)
//
// Возвращаемое значение:
// 	- ТаблицаЗначений с полями:
//  * ВидУчета - Строка
//  * ЦМО - СправочникСсылка.ЦМО
//  * Подразделение - СправочникСсылка.Подразделения
//  * КФО - ПеречислениеСсылка.КФО
Функция ТаблицаРазделителейДокументов(ДокументОснование, СсылкаЦелевогоДокумента = Неопределено) Экспорт  
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ИнвентаризационнаяОписьНФА") Тогда
		Возврат ТаблицаРазделителейДокументов_ИнвентаризационнаяОписьНФА(ДокументОснование, СсылкаЦелевогоДокумента);
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомИК") Тогда
		Возврат ТаблицаРазделителейДокументов_РешениеОПрекращенииПризнанияАктивомИК(
			ДокументОснование, СсылкаЦелевогоДокумента);
	КонецЕсли;	
КонецФункции	

// Формирует текст запроса для получения НФА, уже отработанных данным документом
// по инвентаризации
//
// Возвращаемое значение:
// - Строка - текст запроса
Функция ТекстЗапроса_НФАОтработанныеПоИнвентаризации() Экспорт
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК ДокументОтклонения,
	|	ОсновныеСредства.Ссылка.Решение КАК ДокументИнвентаризации,
	|	ОсновныеСредства.ОсновноеСредство КАК НФА,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОтклоненийВИнвентаризацииНФА.Недостача) КАК ВидОтклонения,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ЦМО <> ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)
	|			ТОГДА ОсновныеСредства.Ссылка.ЦМО.МестоХранения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)
	|	КОНЕЦ КАК МестоИнвентаризации,
	|	ОсновныеСредства.Количество КАК Количество
	|ИЗ
	|	Документ.СписаниеОбъектовИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка.Решение В(&ДокументыИнвентаризации)
	|	И НЕ ОсновныеСредства.Ссылка = &СписаниеОбъектовИКСсылка
	|	И НЕ ОсновныеСредства.Ссылка.ПометкаУдаления";
	
	Возврат ТекстЗапроса;
КонецФункции	

// Формирует строку кодов счетов учета ОС, НМА, НПА по значеням вида имущества и вида операции
//
// Параметры:
//  - ВидОперации - ПеречислениеСсылка.ВидыОперацийСписанияОС - вид операции, выбранный в документе
//  - ВидИмущества - ПеречислениеСсылка.ВидыИмущества - вид имущества, выбранный в документе
//  - ВосстановитьНаБалансе - Булево - значение реквизита ВосстановлениеНаБалансе
//
//  Возвращает строку счетов, разделенных запятыми
Функция КодыСчетовУчетаОСПоВидуОперацииИИмущества(ВидОперации, ВидИмущества, ВосстановитьНаБалансе = Ложь) Экспорт
	КодыСчетов = "";
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.СписаниеИКНаБалансе") Тогда
		Если ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.Казна") Тогда
			КодыСчетов = "108.50";
		ИначеЕсли ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ВКонцессии") Тогда
			КодыСчетов = "108.90";
		Иначе
			КодыСчетов = "-";
		КонецЕсли;
	ИначеЕсли ВидОперации 
		= ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.СписаниеИКнаХранении") Тогда
		Если ВосстановитьНаБалансе Тогда
			КодыСчетов = "02.5";
		Иначе		
			КодыСчетов = "02.5, 02.51, 02.52";
		КонецЕсли;	
	ИначеЕсли ВидОперации 
		= ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.СписаниеИКПолученноеВПользование") Тогда
		КодыСчетов = "01.50";
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.СписаниеКапвложенийВИК") Тогда
		КодыСчетов = "106.50";
	КонецЕсли;
	
	Возврат КодыСчетов;
КонецФункции	

Функция ПредставлениеВидаУчетаПоИмениПараметра(ИмяПараметра) Экспорт
	Результат = "";
	Если ИмяПараметра = "ИК" Тогда 
		Результат = НСтр("ru = 'Имущество казны на балансе (108.50)'");
	ИначеЕсли ИмяПараметра = "ИКвКонцессии" Тогда 
		Результат = НСтр("ru = 'Имущество казны в концессии (108.90)'");
	ИначеЕсли ИмяПараметра = "ИКвПользовании" Тогда 
		Результат = НСтр("ru = 'Имущество казны в пользовании (01.50)'");
	ИначеЕсли ИмяПараметра = "ИКнаХранении" Тогда 
		Результат = НСтр("ru = 'Имущество казны на хранении (02.5Х)'");
	КонецЕсли;	                                                   
	
	Возврат Результат;
КонецФункции	
	
// Формирует таблицу движений по регистру сведений "Операции капвложений"
// Вызывается после формирования таблицы проводок для документа при его проведении
//
// Параметры:
//  ТаблицаПроводок - ТаблицаЗначений - Таблица проводок, которые будут сформированы
//  ДокументОбъект - ДокументОбъект - Документ, из которого формируются движения
//  ДополнительныеРеквизиты - Структура - Структура дополнительных реквизитов типовой бухгалтерской операции
//  ТабДвижений - ТаблицаЗначений - Исходящая таблица. Ее заполняет эта функция
//  ТекстОшибки - Строка - Исходящая строка, описание ошики. Ее заполняет эта функция, если была ошибка.
//
// Возвращаемое значение:
//  - Булево - Возвращает флаг ошибки. Если Истина - все ОК, иначе - Ложь
Функция ИнициализироватьТабДвиженийДляКарточкиКапвложений(
	ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТабДвижений, ТекстОшибки) Экспорт
	
	ТекОрганизация = ДокументОбъект.Организация;
	ТекДата        = ДокументОбъект.Дата;

	ОтразитьВКарточкеКапвложений = Ложь;
	Если ДополнительныеРеквизиты.Свойство("ОтразитьВКарточкеКапвложений", ОтразитьВКарточкеКапвложений) 
		И ОтразитьВКарточкеКапвложений Тогда
			
		Если НЕ ЗначениеЗаполнено(ДополнительныеРеквизиты.КарточкаКапвложений) Тогда
			ТекстОшибки = НСтр("ru = 'На закладке документа ""Бухгалтерская операция"" включен флажок 
			|""Отражать в карточке капвложений"", но не заполнена Карточка капвложений'");
			Возврат Ложь;
		КонецЕсли;		

		НоваяСтрока = ТабДвижений.Добавить();
		НоваяСтрока.Организация         = ТекОрганизация;
		НоваяСтрока.КарточкаКапвложений = ДополнительныеРеквизиты.КарточкаКапвложений;
		НоваяСтрока.Период              = ТекДата;
	КонецЕсли;		
	
	Для каждого СтрокаТЧ из ДокументОбъект.ОсновныеСредства Цикл
		Если НЕ ОбслуживаниеКарточекКапвложений.ЭтоСчетКапвложений(СтрокаТЧ.СчетУчета) Тогда
			Продолжить;
		ИначеЕсли НЕ СтрокаТЧ.ОтразитьВКарточкеКапвложений ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.КарточкаКапвложений) Тогда
			Продолжить;
		ИначеЕсли ТабДвижений.Найти(СтрокаТЧ.КарточкаКапвложений, "КарточкаКапвложений") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока = ТабДвижений.Добавить();
		НоваяСтрока.Организация         = ТекОрганизация;
		НоваяСтрока.КарточкаКапвложений = СтрокаТЧ.КарточкаКапвложений;
		НоваяСтрока.Период              = ТекДата;
	КонецЦикла;	

	Возврат Истина;
КонецФункции	

// Формирует данные табличной части (ТЧ) документа для проверки остатков в функции ПолучитьОстаткиОСЗабаланс
// общего модуля БухгалтерскиеОперацииПовтИсп
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.СписаниеОбъектовИК - документ, для которого собираем данные ТЧ
//
// Возвращаемое значение:
//  - ТаблицаЗначений - таблица, содержащая данные ТЧ 
Функция ДанныеТЧдляПроверкиОстатковЗабалансомВТО(ДокументСсылка) Экспорт
	ДоговорВТабличнойЧасти = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ДоговорВТабличнойЧасти");
	
	Если ДоговорВТабличнойЧасти Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
		|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ОсновныеСредства.КПС КАК КПС,
		|	ОсновныеСредства.Количество КАК Количество,
		|	ОсновныеСредства.Сумма КАК Сумма,
		|	ОсновныеСредства.СчетУчета КАК СчетУчета,
		|	ОсновныеСредства.Контрагент КАК Контрагент,
		|	ОсновныеСредства.Договор КАК Договор
		|ПОМЕСТИТЬ ТабЧасть
		|ИЗ
		|	Документ.СписаниеОбъектовИК.ОсновныеСредства КАК ОсновныеСредства
		|ГДЕ
		|	ОсновныеСредства.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕПСБУВидыСубконто.Ссылка,
		|	МАКСИМУМ(выбор
		|		когда ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
		|			тогда ИСТИНА
		|		иначе ЛОЖЬ
		|	конец) КАК ЕстьДоговоры,		
		|	МАКСИМУМ(выбор
		|		когда ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты)
		|			тогда ИСТИНА
		|		иначе ЛОЖЬ
		|	конец) КАК ЕстьКонтрагенты
		|ПОМЕСТИТЬ Счета
		|ИЗ
		|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|ГДЕ
		|	ЕПСБУВидыСубконто.Ссылка В
		|		(ВЫБРАТЬ
		|			Таб.СчетУчета
		|		ИЗ
		|			ТабЧасть КАК Таб)
		|	И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры)
		|	ИЛИ ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Контрагенты))
		|СГРУППИРОВАТЬ ПО
		|	ЕПСБУВидыСубконто.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабЧасть.НомерСтроки КАК НомерСтроки,
		|	ТабЧасть.ОсновноеСредство КАК ОсновноеСредство,
		|	ТабЧасть.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ТабЧасть.КПС КАК КПС,
		|	ТабЧасть.Количество КАК Количество,
		|	ТабЧасть.Сумма КАК Сумма,
		|	ТабЧасть.СчетУчета КАК СчетУчета,
		|	ВЫБОР
		|		КОГДА НЕ Счета.ЕстьКонтрагенты
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		ИНАЧЕ ТабЧасть.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА НЕ Счета.ЕстьДоговоры
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
		|		ИНАЧЕ ТабЧасть.Договор
		|	КОНЕЦ КАК Договор
		|ИЗ
		|	ТабЧасть КАК ТабЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ Счета КАК Счета
		|		ПО Счета.Ссылка = ТабЧасть.СчетУчета
		|";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
		|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ОсновныеСредства.КПС КАК КПС,
		|	ОсновныеСредства.Количество КАК Количество,
		|	ОсновныеСредства.Сумма КАК Сумма,
		|	ОсновныеСредства.СчетУчета КАК СчетУчета
		|ИЗ
		|	Документ.СписаниеОбъектовИК.ОсновныеСредства КАК ОсновныеСредства
		|ГДЕ
		|	ОсновныеСредства.Ссылка = &Ссылка";
	КонецЕсли;	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ГолосованиеКомиссии

Процедура ЗаполнитьРезультатГолосования(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	ЗаполнитьРезультатыГолосования = Не Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.Комиссия)
		И ЗначениеЗаполнено(Объект.Организация);
	Если ЗаполнитьРезультатыГолосования Тогда
		РезультатГолосованияСотрудника = ОбщегоНазначенияБГУ.РезультатыГолосованияСотрудникаПоДокументу(
			Форма.Сотрудник, Объект.Ссылка, Объект.Комиссия, Объект.Организация);
		РезультатГолосованияКомиссии = ОбщегоНазначенияБГУ.РезультатыГолосованияКомиссийПоДокументам(
			Объект.Ссылка, Объект.Комиссия, Объект.Организация);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		
		СтрокаТаблицы.РешениеСотрудникаПоРезолюции = Неопределено;
		СтрокаТаблицы.ИтогГолосования = 0;
		СтрокаТаблицы.РезолюцияКомиссииОдобрена = Ложь;
		Если ЗаполнитьРезультатыГолосования Тогда
			
			Если РезультатГолосованияСотрудника.Количество() > 0 Тогда
				Результаты = РезультатГолосованияСотрудника.Найти(СтрокаТаблицы.ИдентификаторСтроки, "ИдентификаторСтроки");
				Если Результаты <> Неопределено Тогда
					СтрокаТаблицы.РешениеСотрудникаПоРезолюции = Результаты.РезультатГолосования;
				КонецЕсли;
			КонецЕсли;
			
			Если РезультатГолосованияКомиссии.Количество() > 0 Тогда
				ОтборПоИдентификаторуСтроки = Новый Структура("Документ, ИдентификаторСтроки",
					Объект.Ссылка, СтрокаТаблицы.ИдентификаторСтроки);
				РезультатыГолосованияПоСтроке = РезультатГолосованияКомиссии.НайтиСтроки(ОтборПоИдентификаторуСтроки);
				Если РезультатыГолосованияПоСтроке.Количество() > 0 Тогда
					СтрокаТаблицы.ИтогГолосования = РезультатыГолосованияПоСтроке[0].ИтогГолосования;
					СтрокаТаблицы.РезолюцияКомиссииОдобрена = РезультатыГолосованияПоСтроке[0].РезолюцияКомиссииОдобрена;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УправлениеЭлементамиГолосования(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЕстьРезервирование = ПолучитьФункциональнуюОпцию("РезервироватьОСПриВыбытии") И Объект.Резервировать;
	ЕстьКомиссия = ЗначениеЗаполнено(Объект.Комиссия);
	ДоступностьГолосования = Не Объект.Ссылка.Пустая()
		И НЕ Объект.Аннулирован
		И (ЕстьРезервирование ИЛИ Не Объект.Проведен)
		И ЗначениеЗаполнено(Объект.Комиссия)
		И ЗначениеЗаполнено(Объект.Организация)
		И ЕстьКомиссия;
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("ГруппаГолосование");
	ЭлементыГолосование.Добавить("ОсновныеСредстваИтогГолосования");
	ЭлементыГолосование.Добавить("ОсновныеСредстваРезолюцияКомиссииОдобрена");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Видимость", ЕстьКомиссия);
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("Сотрудник");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Доступность", ДоступностьГолосования);
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЕдиногласноЗаВоВсехСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЕдиногласноПротивВоВсехСтроках");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Видимость", ДоступностьГолосования И Не ЗначениеЗаполнено(Форма.Сотрудник));
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЗаВоВсехСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеПротивВоВсехСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЗаВВыделенныхСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеПротивВВыделенныхСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваРешениеСотрудникаПоРезолюции");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Видимость", ДоступностьГолосования И ЗначениеЗаполнено(Форма.Сотрудник));
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("СохранитьРезультатыГолосования");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Доступность", ДоступностьГолосования И ЗначениеЗаполнено(Форма.Сотрудник) И Форма.РешениеСотрудникаМодифицированность);
	
КонецПроцедуры

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, 
		"Решение, ВидИмущества, Номер, Дата, Комиссия, ВидОперации, 
		|ПринятьНаХранение, ВосстановитьНаБалансе, МоментВремени, 
		|ДоговорВТабличнойЧасти, ЕстьРешениеОПрекращенииПризнанияАктивом, Резервировать");
		
	Если РеквизитыДокумента.ЕстьРешениеОПрекращенииПризнанияАктивом ИЛИ РеквизитыДокумента.Резервировать Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПроведения = БухгалтерскийУчет.УстановленнаяДатаПроведения(ДокументСсылка);
	Если ЗначениеЗаполнено(ДатаПроведения) Тогда
		РеквизитыДокумента.Вставить("Дата", ДатаПроведения);
	КонецЕсли;	
	
	ПараметрыСписания = УправлениеОсновнымиСредствами.ПараметрыСписанияОСПоРегистрамНакопления(
		РеквизитыДокумента.ВидОперации);
	
	Если ПараметрыСписания.СписатьСтоимостьИАмортизацию И РеквизитыДокумента.ПринятьНаХранение Тогда
		ПараметрыСписания.ВидРаспоряженияУКонтрагента	= Перечисления.ВидыРаспоряженияОС.НаХранении;
		ПараметрыСписания.ПоступлениеКонтрагенту		= Истина;
	КонецЕсли;
	
	НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДокументСсылка, РеквизитыДокумента.Номер);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента",
		НСтр("ru = 'Акт о списании объектов нефинансовых активов (кроме транспортных средств)'"));
	Запрос.УстановитьПараметр("НомерДокумента", НомерДокумента);
	Запрос.УстановитьПараметр("ДатаДокумента", КонецДня(РеквизитыДокумента.Дата));
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства1", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СобытиеСписание", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка КАК Ссылка,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|		ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВидыСубконтоЦМО.Ссылка ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаОсновныеСредства.Ссылка.ЦМО
	|	КОНЕЦ КАК ЦМО,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМОПолучатель КАК ЦМОПолучатель,
	|	&ПустойКонтрагент_ПодЗамену КАК Контрагент,
	|	&ПустойДоговор_ПодЗамену КАК Договор,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.Ссылка.ВидПервичногоДокумента = """"
	|			ТОГДА &ИмяДокумента
	|		ИНАЧЕ ТаблицаОсновныеСредства.Ссылка.ВидПервичногоДокумента
	|	КОНЕЦ КАК НазваниеДокумента,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.Ссылка.НомерПервичногоДокумента = """"
	|			ТОГДА &НомерДокумента
	|		ИНАЧЕ ТаблицаОсновныеСредства.Ссылка.НомерПервичногоДокумента
	|	КОНЕЦ КАК НомерДокумента,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.Ссылка.ДатаПервичногоДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.Ссылка.ДатаПервичногоДокумента
	|	КОНЕЦ КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаОсновныеСредства.Ссылка.ВосстановитьНаБалансе КАК ВосстановитьНаБалансе,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ТаблицаОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ТаблицаОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц КАК СуммаАмортизацииЗаТекущийМесяц,
	|	ТаблицаОсновныеСредства.ПричинаСписания КАК ПричинаСписания,
	|	ТаблицаОсновныеСредства.СчетУчетаВосстановление КАК СчетУчетаВосстановление,
	|	ТаблицаОсновныеСредства.КПСВосстановление КАК КПСВосстановление,
	|	ТаблицаОсновныеСредства.ЦМОВосстановление КАК ЦМОВосстановление,
	|	ТаблицаОсновныеСредства.СуммаВосстановление КАК СуммаВосстановление,
	|	ТаблицаОсновныеСредства.СчетУчета КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|		ИЛИ НЕ ТаблицаОсновныеСредства.ОсновноеСредство.ГрупповойУчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПообъектныйУчет,
	|	ТаблицаОсновныеСредства.Ссылка.ПринятьНаХранение КАК ПринятьНаХранение
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства1
	|ИЗ
	|	Документ.СписаниеОбъектовИК.ОсновныеСредства КАК ТаблицаОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидыСубконтоЦМО
	|		ПО ТаблицаОсновныеСредства.СчетУчета = ВидыСубконтоЦМО.Ссылка
	|		И (ВидыСубконтоЦМО.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ТаблицаОсновныеСредства.Ссылка)
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|	И &УсловиеОдобренные
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СобытияОССрезПоследних.ОсновноеСредство,
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер,
	|	СобытияОССрезПоследних.Период
	|ПОМЕСТИТЬ СобытиеСписание
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(&ДатаДокумента, (ОсновноеСредство, ИнвНомер) В
	|		(ВЫБРАТЬ
	|			Таб.ОсновноеСредство,
	|			Таб.ИнвентарныйНомер
	|		ИЗ
	|			ТаблицаОсновныеСредства1 КАК Таб)
	|	И Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)) КАК СобытияОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОсновныеСредства1.Ссылка,
	|	ТаблицаОсновныеСредства1.Номер,
	|	ТаблицаОсновныеСредства1.Дата,
	|	ТаблицаОсновныеСредства1.ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства1.Организация,
	|	ТаблицаОсновныеСредства1.Подразделение,
	|	ТаблицаОсновныеСредства1.ЦМО,
	|	ТаблицаОсновныеСредства1.ЦМОПолучатель,
	|	ТаблицаОсновныеСредства1.Контрагент,
	|	ТаблицаОсновныеСредства1.Договор,
	|	ТаблицаОсновныеСредства1.НазваниеДокумента,
	|	ТаблицаОсновныеСредства1.НомерДокумента,
	|	ТаблицаОсновныеСредства1.ДатаДокумента,
	|	ТаблицаОсновныеСредства1.ВидОперации,
	|	ТаблицаОсновныеСредства1.ВосстановитьНаБалансе,
	|	ТаблицаОсновныеСредства1.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства1.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства1.Количество,
	|	ТаблицаОсновныеСредства1.Сумма,
	|	ТаблицаОсновныеСредства1.СуммаАмортизации,
	|	ТаблицаОсновныеСредства1.СуммаОбесценения,
	|	ТаблицаОсновныеСредства1.СуммаАмортизацииЗаТекущийМесяц,
	|	ТаблицаОсновныеСредства1.ПричинаСписания,
	|	ТаблицаОсновныеСредства1.СчетУчета,
	|	ТаблицаОсновныеСредства1.СчетУчетаВосстановление,
	|	ТаблицаОсновныеСредства1.КПСВосстановление,
	|	ТаблицаОсновныеСредства1.ЦМОВосстановление,
	|	ТаблицаОсновныеСредства1.СуммаВосстановление,
	|	ТаблицаОсновныеСредства1.ПообъектныйУчет,
	|	ТаблицаОсновныеСредства1.ПринятьНаХранение,
	|	НЕ СобытиеСписание.Период ЕСТЬ NULL
	|	И СобытиеСписание.Период <> ДАТАВРЕМЯ(1, 1, 1) КАК ЕстьСписание
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	ТаблицаОсновныеСредства1 КАК ТаблицаОсновныеСредства1
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобытиеСписание КАК СобытиеСписание
	|		ПО ТаблицаОсновныеСредства1.ОсновноеСредство = СобытиеСписание.ОсновноеСредство
	|		И ТаблицаОсновныеСредства1.ИнвентарныйНомер = СобытиеСписание.ИнвентарныйНомер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	ОперацииНеЗависимыеОтКомиссии = Новый Массив;
	ОперацииНеЗависимыеОтКомиссии.Добавить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.СписаниеИКПолученноеВПользование"));
	ОперацииНеЗависимыеОтКомиссии.Добавить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.СписаниеИКнаХранении"));
	
	Если ЗначениеЗаполнено(РеквизитыДокумента.Комиссия)
		И ОперацииНеЗависимыеОтКомиссии.Найти(РеквизитыДокумента.ВидОперации) = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОдобренные", 
			"ТаблицаОсновныеСредства.ИдентификаторСтроки В (&Одобренные)");
		Запрос.УстановитьПараметр("Одобренные", ОбщегоНазначенияБГУ.ОдобренныеОбъектыГолосования(ДокументСсылка));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОдобренные", "ИСТИНА");
	КонецЕсли;
	
	Если  РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийИК.СписаниеИКНаБалансе
		И РеквизитыДокумента.ВидИмущества = Перечисления.ВидыИмущества.ВКонцессии Тогда
		ДополнитьТекстЗапросаПолучениемДоговора(Запрос.Текст);
		Запрос.УстановитьПараметр("Период", РеквизитыДокумента.Дата);

	ИначеЕсли ЗначениеЗаполнено(ПараметрыСписания.ВидРаспоряженияУКонтрагента)
		И ПараметрыСписания.ПоступлениеКонтрагенту = Ложь Тогда
		ДополнитьТекстЗапросаПолучениемКонтрагента(Запрос, НомераТаблиц, РеквизитыДокумента, ПараметрыСписания);
		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"&ПустойДоговор_ПодЗамену", "ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"&ПустойКонтрагент_ПодЗамену", "ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)");
	КонецЕсли;
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.ПричинаСписания КАК ПричинаСписания,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.СписаниеИКНаБалансе)
	|	И НЕ ТаблицаОсновныеСредства.ПринятьНаХранение
	|	И ТаблицаОсновныеСредства.ПообъектныйУчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание),
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.ПричинаСписания,
	|	ТаблицаОсновныеСредства.НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.СписаниеИКнаХранении)
	|	И ТаблицаОсновныеСредства.СчетУчета В (&СчетаНеАктивов)
	|	И НЕ ТаблицаОсновныеСредства.ВосстановитьНаБалансе
	|	И ТаблицаОсновныеСредства.ПообъектныйУчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	"""",
	|	"""",
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1)
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ВосстановитьНаБалансе
	|	И ТаблицаОсновныеСредства.ЕстьСписание
	|	И ТаблицаОсновныеСредства.ПообъектныйУчет
	|";
	
	Запрос.УстановитьПараметр("СчетаНеАктивов", БухгалтерскийУчет.СписокСчетов("02.5", РеквизитыДокумента.Дата));
	
	Если РеквизитыДокумента.ВосстановитьНаБалансе Тогда
		
		НомераТаблиц.Вставить("СтоимостьОбъектовОСПоКонтрагентам", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении) КАК ВидРаспоряжения,
		|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период,
		|	ТаблицаОсновныеСредства.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА &УчетПоПодразделениямКонтрагент
		|			ТОГДА ТаблицаОсновныеСредства.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	ТаблицаОсновныеСредства.ЦМО КАК ЦМО,
		|	ТаблицаОсновныеСредства.Контрагент КАК Контрагент,
		|	ТаблицаОсновныеСредства.Договор КАК Договор,
		|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ТаблицаОсновныеСредства.Количество КАК Количество,
		|	ТаблицаОсновныеСредства.Сумма КАК Стоимость
		|ИЗ
		|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
		|ГДЕ
		|	ТаблицаОсновныеСредства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.СписаниеИКнаХранении)";
		
		Запрос.УстановитьПараметр("УчетПоПодразделениямКонтрагент",
			ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
			И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("02").УчетПоПодразделениям);
			
		НомераТаблиц.Вставить("СтоимостьОбъектовОС", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе) КАК ВидРаспоряжения,
		|	СтоимостьОбъектовОС.ДатаСписанияСБухУчета КАК Период,
		|	СтоимостьОбъектовОС.Организация КАК Организация,
		|	СтоимостьОбъектовОС.ОсновноеСредство КАК ОсновноеСредство,
		|	СтоимостьОбъектовОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	СтоимостьОбъектовОС.ЦМОВосстановление КАК ЦМО,
		|	ВЫБОР
		|		КОГДА &УчетПоПодразделениям
		|			ТОГДА СтоимостьОбъектовОС.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	СтоимостьОбъектовОС.Договор КАК Договор,
		|	-СтоимостьОбъектовОС.СуммаВосстановление КАК Стоимость,
		|	-СтоимостьОбъектовОС.Количество КАК Количество,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
		|	СтоимостьОбъектовОС.НазваниеДокумента КАК НазваниеДокумента,
		|	СтоимостьОбъектовОС.НомерДокумента КАК НомерДокумента,
		|	СтоимостьОбъектовОС.ДатаДокумента КАК ДатаДокумента
		|ИЗ
		|	ТаблицаОсновныеСредства КАК СтоимостьОбъектовОС";
		
		Запрос.УстановитьПараметр("УчетПоПодразделениям", 
			УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетИКПоПодразделениям());
		
		НомераТаблиц.Вставить("АмортизацияОбъектовОС", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	АмортизацияОбъектовОС.ДатаСписанияСБухУчета КАК Период,
		|	АмортизацияОбъектовОС.Организация КАК Организация,
		|	АмортизацияОбъектовОС.ОсновноеСредство КАК ОсновноеСредство,
		|	АмортизацияОбъектовОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	-АмортизацияОбъектовОС.СуммаАмортизации КАК СуммаАмортизации,
		|	-АмортизацияОбъектовОС.СуммаОбесценения КАК СуммаОбесценения,
		|	ИСТИНА КАК ЭтоСписание
		|ИЗ
		|	ТаблицаОсновныеСредства КАК АмортизацияОбъектовОС
		|ГДЕ
		|	(АмортизацияОбъектовОС.СуммаАмортизации <> 0
		|			ИЛИ АмортизацияОбъектовОС.СуммаОбесценения <> 0)";
		
	Иначе
		
		// Движения по регистрам СтоимостьОбъектовОС и АмортизацияОбъектовОС.
		УправлениеОсновнымиСредствами.ДобавитьТаблицыСписанияОСПоРегистрамНакопления(Запрос, НомераТаблиц,
			ДокументСсылка, ПараметрыСписания);
		
	КонецЕсли;
	
	#Область УчетДрагМатериалов
	ИнициализироватьЗапросыДМ(Запрос, НомераТаблиц);
	#КонецОбласти
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыДМ(Запрос, НомераТаблиц)
	
	НомераТаблиц.Вставить("НаличиеДрагМатериаловВОбъектахНФА", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка КАК Документ.СписаниеОбъектовИК).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.СписаниеКапвложенийВИК)
	|			ТОГДА СписаниеОбъектовИКДрагоценныеМатериалы.ОбъектМЦ
	|		ИНАЧЕ СписаниеОбъектовИКДрагоценныеМатериалы.ОбъектНФА
	|	КОНЕЦ КАК ОбъектНФА,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка КАК Документ.СписаниеОбъектовИК).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.СписаниеКапвложенийВИК)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|		ИНАЧЕ СписаниеОбъектовИКДрагоценныеМатериалы.ИнвНомер
	|	КОНЕЦ КАК ИнвНомер,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.ВидДрагМатериала КАК ВидДрагМатериала,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.МассаДМ КАК МассаДМ,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.КоличествоДМ КАК КоличествоДМ,
	|	&ИмяДокумента КАК Основание,
	|	&НомерДокумента КАК НомерОснования,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка.Дата КАК ДатаОснования,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.ЕдИзм КАК ЕдИзм,
	|	ИСТИНА КАК ЭтоСписание,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка.АналитикаОперацииСДрагМатериалами КАК АналитикаОперации
	|ИЗ
	|	Документ.СписаниеОбъектовИК.ДрагоценныеМатериалы КАК СписаниеОбъектовИКДрагоценныеМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка)
	|ГДЕ
	|	СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка = &Ссылка
	|	И СписаниеОбъектовИКДрагоценныеМатериалы.МассаДМ > 0
	|	И (СписаниеОбъектовИКДрагоценныеМатериалы.ОбъектНФА, СписаниеОбъектовИКДрагоценныеМатериалы.ИнвНомер) В
	|			(ВЫБРАТЬ
	|				ВТ.ОсновноеСредство,
	|				ВТ.ИнвентарныйНомер
	|			ИЗ
	|				ТаблицаОсновныеСредства КАК ВТ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеОбъектовИКДрагоценныеМатериалы.НомерСтроки";
	
	НомераТаблиц.Вставить("НаличиеДрагМатериаловВЛомеИОтходах", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка.Организация КАК Организация,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка.НоменклатураЛома КАК ОбъектНФА,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовСодержащихДрагМатериалы.ЛомДМ) КАК ВидОбъекта,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.ВидДрагМатериала КАК ВидДрагМатериала,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.МассаДМ КАК ЧистаяМасса,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.ЛигатурнаяМассаЛома КАК ЛигатурнаяМасса,
	|	&ИмяДокумента КАК Основание,
	|	&НомерДокумента КАК НомерОснования,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка.Дата КАК ДатаОснования,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.ЕдИзм КАК ЕдИзм,
	|	СписаниеОбъектовИКДрагоценныеМатериалы.ИсточникОбразования КАК ИсточникОбразования
	|ИЗ
	|	Документ.СписаниеОбъектовИК.ДрагоценныеМатериалы КАК СписаниеОбъектовИКДрагоценныеМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка)
	|ГДЕ
	|	СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка = &Ссылка
	|	И СписаниеОбъектовИКДрагоценныеМатериалы.МассаДМ > 0
	|	И НЕ СписаниеОбъектовИКДрагоценныеМатериалы.Ссылка.НоменклатураЛома = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И (СписаниеОбъектовИКДрагоценныеМатериалы.ОбъектНФА, СписаниеОбъектовИКДрагоценныеМатериалы.ИнвНомер) В
	|			(ВЫБРАТЬ
	|				ВТ.ОсновноеСредство,
	|				ВТ.ИнвентарныйНомер
	|			ИЗ
	|				ТаблицаОсновныеСредства КАК ВТ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеОбъектовИКДрагоценныеМатериалы.НомерСтроки";
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаПолучениемДоговора(ТекстЗапроса)
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПустойКонтрагент_ПодЗамену", 
	"ВЫБОР
	|		КОГДА СтоимостьОбъектовОСОстатки.Договор <> ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|			ТОГДА СтоимостьОбъектовОСОстатки.Договор.Контрагент
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПустойДоговор_ПодЗамену", "СтоимостьОбъектовОСОстатки.Договор");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ГДЕ", "
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|				&Период,
	|				(Организация, ОсновноеСредство)
	|					В (ВЫБРАТЬ ВТ.Ссылка.Организация, ВТ.ОсновноеСредство 
	|						ИЗ Документ.СписаниеОбъектовИК.ОсновныеСредства КАК ВТ 
	|						ГДЕ ВТ.Ссылка = &Ссылка)
	|				И ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)) КАК СтоимостьОбъектовОСОстатки
	|		ПО ТаблицаОсновныеСредства.ОсновноеСредство = СтоимостьОбъектовОСОстатки.ОсновноеСредство
	|			И ТаблицаОсновныеСредства.ИнвентарныйНомер = СтоимостьОбъектовОСОстатки.ИнвентарныйНомер
	|ГДЕ");
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаПолучениемКонтрагента(Запрос, НомераТаблиц, РеквизитыДокумента, ПараметрыСписания)
	
	Если РеквизитыДокумента.ДоговорВТабличнойЧасти Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПустойКонтрагент_ПодЗамену", 
		"ВЫБОР
		|		КОГДА НЕ ОстаткиПоКонтрагентам.Контрагент ЕСТЬ NULL
		|			ТОГДА ОстаткиПоКонтрагентам.Контрагент
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПустойДоговор_ПодЗамену", 
		"ВЫБОР
		|		КОГДА НЕ ОстаткиПоКонтрагентам.Договор ЕСТЬ NULL
		|			ТОГДА ОстаткиПоКонтрагентам.Договор
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
		|	КОНЕЦ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам.Остатки(
		|				&Период,
		|				(Организация, ОсновноеСредство)
		|					В (ВЫБРАТЬ ВТ.Ссылка.Организация, ВТ.ОсновноеСредство 
		|					ИЗ Документ.СписаниеОбъектовИК.ОсновныеСредства КАК ВТ 
		|					ГДЕ ВТ.Ссылка = &Ссылка)
		|					И ВидРаспоряжения = &ВидРаспКонтр) КАК ОстаткиПоКонтрагентам
		|		ПО ТаблицаОсновныеСредства.ОсновноеСредство = ОстаткиПоКонтрагентам.ОсновноеСредство
		|			И ТаблицаОсновныеСредства.ИнвентарныйНомер = ОстаткиПоКонтрагентам.ИнвентарныйНомер
		|			И ТаблицаОсновныеСредства.Контрагент = ОстаткиПоКонтрагентам.Контрагент
		|			И ТаблицаОсновныеСредства.Договор = ОстаткиПоКонтрагентам.Договор
		|ГДЕ");
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПустойКонтрагент_ПодЗамену", "ОстаткиПоКонтрагентам.Контрагент");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПустойДоговор_ПодЗамену", "ОстаткиПоКонтрагентам.Договор");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ", "
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам.Остатки(
		|				&Период,
		|				(Организация, ОсновноеСредство)
		|					В (ВЫБРАТЬ ВТ.Ссылка.Организация, ВТ.ОсновноеСредство 
		|					ИЗ Документ.СписаниеОбъектовИК.ОсновныеСредства КАК ВТ 
		|					ГДЕ ВТ.Ссылка = &Ссылка)
		|					И ВидРаспоряжения = &ВидРаспКонтр) КАК ОстаткиПоКонтрагентам
		|		ПО ТаблицаОсновныеСредства.ОсновноеСредство = ОстаткиПоКонтрагентам.ОсновноеСредство
		|			И ТаблицаОсновныеСредства.ИнвентарныйНомер = ОстаткиПоКонтрагентам.ИнвентарныйНомер
		|ГДЕ");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Период", РеквизитыДокумента.МоментВремени);
	Запрос.УстановитьПараметр("ВидРаспКонтр", ПараметрыСписания.ВидРаспоряженияУКонтрагента);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуОбъектовОС";
	КомандаПечати.Идентификатор		= "АктПриемаПередачи0510448";
	КомандаПечати.Представление		= НСтр("ru = 'Акт о приеме-передаче НФА (ф.0510448) (61н, ред. 100н)'");
	КомандаПечати.Порядок			= 3;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);

	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.СписаниеОбъектовОС";
	КомандаПечати.Идентификатор		= "АктСписания0510454";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о списании объектов НФА'"), "0510454", "61н", "157н");
	КомандаПечати.Порядок			= 1;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.СписаниеОбъектовОС";
	КомандаПечати.Идентификатор		= "АктСписания0504104_103н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о списании объектов НФА'"), "0504104", "52н", "103н", Истина);
	КомандаПечати.Порядок			= 101;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.СписаниеОбъектовОС";
	КомандаПечати.Идентификатор		= "АктСписания0504104";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о списании объектов НФА'"), "0504104", "52н",, Истина);
	КомандаПечати.Порядок			= 102;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.СписаниеОбъектовИК";
	КомандаПечати.Идентификатор		= "ПечатьИнвКарточек61н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(
		НСтр("ru = 'Инвентарные карточки объектов'"),, "61н");
	КомандаПечати.Порядок			= 4;
	
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "СправкаОСодержанииДрагМатериалов", 4);
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ПечатьИнвКарточек61н") Тогда
		
		ДанныеДляПечати = ДанныеДляПечатиИнвКарточек(МассивОбъектов);
		ИменаФайловПечати = Новый Соответствие;
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ПечатьИнвКарточек61н","Инвентарные карточки объектов",
			Справочники.ОсновныеСредства.ПечатьИнвентарнойКарточки61н(
			ДанныеДляПечати, ПараметрыПечати, ОбъектыПечати, ИменаФайловПечати));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеДляПечатиИнвКарточек(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.СписаниеОбъектовИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
	
КонецФункции

#КонецОбласти

Функция ТаблицаРазделителейДокументов_ИнвентаризационнаяОписьНФА(ДокументОснование, СсылкаЦелевогоДокумента)
	Запрос = Новый Запрос;
	ВидыОпераций = УправлениеОсновнымиСредствамиКлиентСервер.СписокВидовОперацииДокумента(
		Тип("ДокументСсылка.СписаниеОбъектовИК")).ВыгрузитьЗначения();
	ВидыИмущества = Новый Массив;
	ВидыИмущества.Добавить(Перечисления.ВидыИмущества.Казна);
	ВидыИмущества.Добавить(Перечисления.ВидыИмущества.ВКонцессии);

	КодыСчетовГруппСтрокой = "";
	Для каждого ТекОперация из ВидыОпераций Цикл
		Для каждого ТекИмущество из ВидыИмущества Цикл
			КодыСчетовГруппСтрокой = КодыСчетовГруппСтрокой + ?(ЗначениеЗаполнено(КодыСчетовГруппСтрокой), ",", "") 
			+ КодыСчетовУчетаОСПоВидуОперацииИИмущества(ТекОперация, ТекИмущество);
		КонецЦикла;	
	КонецЦикла;	
	
	КодыСчетовГрупп = СтрРазделить(КодыСчетовГруппСтрокой, ",", Ложь);
	
	Документы.ИнвентаризационнаяОписьНФА.ЗапросДанныхДокументаИнвентаризации(Запрос, ДокументОснование, СсылкаЦелевогоДокумента);
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СчетаГруппы
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Код В (&КодыСчетовГрупп)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ДанныеИнвентаризации.Счет.Забалансовый
	|			ТОГДА ВЫБОР
	|				КОГДА ПОДСТРОКА(ДанныеИнвентаризации.Счет.Код, 5, 1) = ""5""
	|					ТОГДА &ИК
	|				ИНАЧЕ &ИКвКонцессии
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ПОДСТРОКА(ДанныеИнвентаризации.Счет.Код, 1, 2) = ""01""
	|				ТОГДА &ИКвПользовании
	|			ИНАЧЕ &ИКнаХранении
	|		КОНЕЦ
	|	КОНЕЦ КАК ВидУчета,
	|	ДанныеИнвентаризации.ЦМОРаздела4 КАК ЦМО,
	|	ДанныеИнвентаризации.Подразделение КАК Подразделение,
	|	ДанныеИнвентаризации.ИФО КАК ИФО,
	|	ДанныеИнвентаризации.КФО КАК КФО
	|ИЗ
	|	ДанныеДокументаИнвентаризации КАК ДанныеИнвентаризации
	|ГДЕ
	|	ДанныеИнвентаризации.ДокументИнвентаризации = &Ссылка
	|	И ДанныеИнвентаризации.ВидОбъекта = 6
	|	И ДанныеИнвентаризации.Счет В ИЕРАРХИИ
	|		(ВЫБРАТЬ
	|			СчетаГруппы.Ссылка
	|		ИЗ
	|			СчетаГруппы)
	|	И (ДанныеИнвентаризации.КоличествоНедостачаНеПодтверждено <> 0
	|	ИЛИ ДанныеИнвентаризации.СуммаНедостачаНеПодтверждено <> 0)
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА НЕ ДанныеИнвентаризации.Счет.Забалансовый
	|			ТОГДА ВЫБОР
	|				КОГДА ПОДСТРОКА(ДанныеИнвентаризации.Счет.Код, 5, 1) = ""5""
	|					ТОГДА &ИК
	|				ИНАЧЕ &ИКвКонцессии
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ПОДСТРОКА(ДанныеИнвентаризации.Счет.Код, 1, 2) = ""01""
	|				ТОГДА &ИКвПользовании
	|			ИНАЧЕ &ИКнаХранении
	|		КОНЕЦ
	|	КОНЕЦ,
	|	ДанныеИнвентаризации.ЦМОРаздела4,
	|	ДанныеИнвентаризации.Подразделение,
	|	ДанныеИнвентаризации.ИФО,
	|	ДанныеИнвентаризации.КФО";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("КодыСчетовГрупп", КодыСчетовГрупп);
	Запрос.УстановитьПараметр("ИК", ПредставлениеВидаУчетаПоИмениПараметра("ИК"));
	Запрос.УстановитьПараметр("ИКвКонцессии", ПредставлениеВидаУчетаПоИмениПараметра("ИКвКонцессии"));
	Запрос.УстановитьПараметр("ИКвПользовании", ПредставлениеВидаУчетаПоИмениПараметра("ИКвПользовании"));
	Запрос.УстановитьПараметр("ИКнаХранении", ПредставлениеВидаУчетаПоИмениПараметра("ИКнаХранении"));
	
	ТаблицаРазделителей = Запрос.Выполнить().Выгрузить();
	СтруктураРазделителей = Новый Структура("Разделители, ЗаголовкиКолонок");
	СтруктураРазделителей.Вставить("Разделители", ТаблицаРазделителей);
	СтруктураРазделителей.Вставить("ЗаголовкиКолонок", Новый Структура("ВидУчета", "Вид учета"));
	
	Возврат(СтруктураРазделителей);
КонецФункции	

Функция ТаблицаРазделителейДокументов_РешениеОПрекращенииПризнанияАктивомИК(ДокументОснование, СсылкаЦелевогоДокумента)
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЧОсновныеСредства.КФО КАК КФО
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомИК.ОсновныеСредства КАК ТЧОсновныеСредства
	|ГДЕ
	|	ТЧОсновныеСредства.Ссылка = &Ссылка
	|	И НЕ ТЧОсновныеСредства.ОсновноеСредство.ТипНФА = &ТипНФА";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("ТипНФА", Перечисления.ТипыНФА.Транспорт);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

#КонецОбласти

#КонецЕсли
