&НаКлиенте
Перем ЗагружаемаяСтрока;

&НаСервере
Перем ДанныеАутентификации;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мСоответствиеИменИдентификаторам = БюджетнаяОтчетностьСервер.СоответствиеИменКомплектовИдентификаторам();
	
	СоответствиеИменИдентификаторам = Новый ФиксированноеСоответствие(мСоответствиеИменИдентификаторам);
	
	ЗапаснойИсточник = "https://filerepository.1c.ru/?pageUuid=f28e02c1-7955-4d70-81ef-6bf1042e31fe";
	
	ПолучитьДанныеОбработатьНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ТаблицаФайлов.Количество() = 0
		И ДанныеАутентификацииЗаполнены Тогда
		ОткрытьСтраницуЗапасногоИсточника();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Обработка.ИмпортКейса/ОкончаниеЗагрузки" 
		И ЗагружаемаяСтрока <> Неопределено Тогда
		
		Если Параметр = Истина Тогда
			ЗагружаемаяСтрока.ТекущаяВерсия = ЗагружаемаяСтрока.ВерсияНаСайте;
			
			ЗагружаемаяСтрока.Информация = "Установка завершена";
			ЗагружаемаяСтрока.ИндексКартинки = 1;
			ЗагружаемаяСтрока.ЕстьОбновление = Ложь;
			ЗагружаемаяСтрока.ЗагруженаБолееНоваяВерсия = Ложь;
			
			ОбновитьПредставлениеВерсииВСтроке(ЗагружаемаяСтрока);
		Иначе
			ЗагружаемаяСтрока.ИндексКартинки = 2;
			ЗагружаемаяСтрока.Информация = "Ошибка, подробности в Журнале регистрации";
		КонецЕсли;
			
		Если Параметр = Истина Тогда
			Источник.ЗакрытьФормуБезусловно = Истина;
			Источник.Закрыть();
			ПодключитьОбработчикОжидания("ЗапуститьУстановкуКомплектов",2,Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
	
	Если (Элемент.Документ <> Неопределено) 
		И (Элемент.Документ.readyState = "complete")тогда
		
		Если ПолеHTML = ЗапаснойИсточник Тогда
			ПодключитьОбработчикОжидания("ПолучитьТекстСтраницы",0.5,Истина);
		ИначеЕсли ЗначениеЗаполнено(ПолеHTML) Тогда//если установлен другой адрес, то вернем правильный, чтобы получить данные еще раз
			ПолеHTML = ЗапаснойИсточник;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиТаблицаФайлов

&НаКлиенте
Процедура ТаблицаФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ТаблицаФайлов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ТаблицаФайловНеИспользуется" Тогда
		Если ЗначениеЗаполнено(ТекДанные.ТекущаяВерсия) Тогда
			//есть запись в регистре, можно сохранить
			СтандартнаяОбработка = Ложь;
			ТекДанные.НеИспользуется = НЕ ТекДанные.НеИспользуется;
			
			ТаблицаФайловНеИспользуетсяПриИзмененииНаСервере(ТекДанные.ИдентификаторКомплекта,ТекДанные.НеИспользуется);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТаблицаФайловНеИспользуетсяПриИзмененииНаСервере(ИдентификаторКомплекта,НеИспользуется)
	ТекЗапись = РегистрыСведений.УстановленныеКомплектыОтчетности.СоздатьМенеджерЗаписи();
	ТекЗапись.ИдентификаторКомплекта = ИдентификаторКомплекта;
	ТекЗапись.Прочитать();
	Если ТекЗапись.Выбран() Тогда
		Если ТекЗапись.НеИспользуется <> НеИспользуется Тогда
			ТекЗапись.НеИспользуется = НеИспользуется;
			ТекЗапись.Записать(Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОчиститьСообщения();
	ПолучитьДанныеОбработатьНаСервере(Истина);
	
	Если ТаблицаФайлов.Количество() = 0
		И ДанныеАутентификацииЗаполнены Тогда
		ОткрытьСтраницуЗапасногоИсточника();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОтмеченныеКомплекты(Команда)
	ОчиститьСообщения();
	
	ЕстьКомплекты = ЗагрузитьОтмеченныеКомплектыНаСервере();
	
	Если ЕстьКомплекты Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияОтвета",ЭтотОбъект);
	
		ПоказатьВопрос(ОписаниеОповещения,Нстр("ru='Для отмеченных комплектов будет выполнена загрузка.
			|Продолжить?'"),РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщатьОбОшибкахПолученияДанных(Команда)
	СообщатьОбОшибкахПолученияДанных = НЕ СообщатьОбОшибкахПолученияДанных;
	Элементы.ТаблицаФайловСообщатьОбОшибкахПолученияДанных.Пометка = СообщатьОбОшибкахПолученияДанных;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьДанныеОбработатьНаСервере(СообщатьОбОшибках)
	
	ТаблицаФайлов.Очистить();
	
	АдресСтраницыПоддержки = БюджетнаяОтчетностьСервер.ПолучитьСтраницуПоддержкиКонфигурации();
		
	Если НЕ ЗначениеЗаполнено(АдресСтраницыПоддержки) Тогда
		Если СообщатьОбОшибках = Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось определить страницу поддержки конфигурации.'"));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеАутентификации();
	
	Если ДанныеАутентификации = Неопределено Тогда
		Если СообщатьОбОшибках = Истина Тогда
			ТекстОшибки = НСтр("ru='Не подключена Интернет-поддержка пользователей.
				|Подключение выполняется разделе Администрирование - Интернет-поддержка и сервисы - Настройка интернет-поддержки'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если СообщатьОбОшибках = Ложь Тогда
		//проверим, что есть интернет, и если есть, то сразу загрузим список комплектов
		ПараметрыЗапроса = Новый Структура("Таймаут",3);
		Результат = Обработки.ИмпортКейса.ЗагрузитьСодержимоеИзИнтернет("https://portal.1c.ru/",,,ПараметрыЗапроса);
		Если Результат.КодСостояния <> 200 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтраницаСайта = Обработки.ИмпортКейса.ПолучитьДанныеНаСервере(АдресСтраницыПоддержки,КукиДляНужнойСтраницы,ДанныеАутентификации,СообщатьОбОшибкахПолученияДанных);
	ПрочитатьФайлыНаСервере(СтраницаСайта);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеАутентификации()
	ДанныеАутентификации = Неопределено;
	УстановитьПривилегированныйРежим(Истина);
	ДанныеАутентификации = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
	Если ДанныеАутентификации <> Неопределено Тогда
		ДанныеАутентификации.Логин = КодироватьСтроку(ДанныеАутентификации.Логин, СпособКодированияСтроки.КодировкаURL);
		ДанныеАутентификации.Пароль = КодироватьСтроку(ДанныеАутентификации.Пароль, СпособКодированияСтроки.КодировкаURL);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеАутентификацииЗаполнены = (ДанныеАутентификации <> Неопределено);
	Элементы.ДекорацияДанныеАутентификации.Видимость = (ДанныеАутентификации = Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлыНаСервере(СтраницаСайта)
	
	Обработки.ИмпортКейса.ЗаполнитьТаблицуФайловПоДаннымСтраницыПоддержки(СтраницаСайта,ТаблицаФайлов);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПредставлениеВерсииВСтроке(СтрокаТаблицы)
	
	СтрокаТаблицы.ВерсияПредставление = "Доступна: "+ СтрокаТаблицы.ВерсияНаСайтеСДатой +", установлена: "+?(ЗначениеЗаполнено(СтрокаТаблицы.ТекущаяВерсия),СтрокаТаблицы.ТекущаяВерсия,"нет");

КонецПроцедуры

&НаСервере
Функция СравнитьВерсииКомплектов(Знач СтрокаВерсии1, Знач СтрокаВерсии2)
	
	Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	
	Версия1 = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка1, ".",,Истина);
	Версия2 = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка2, ".",,Истина);
	
	Если Версия1.Количество() >= 4 И Версия2.Количество() >= 4 Тогда
		
		Результат = 0;
		Для Разряд = 0 По 3 Цикл
			Если Версия1[Разряд] = Версия2[Разряд] Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Версия1[Разряд])
				И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Версия2[Разряд]) Тогда
			
				Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
				Если Результат <> 0 Тогда
					Возврат Новый Структура("Разряд,Результат",Разряд,Результат);
				КонецЕсли;
			Иначе
				//если в разрядах буквы, и они отличаются
				Возврат Новый Структура("Разряд,Результат",-1,0);
			КонецЕсли;
		КонецЦикла;
		
		Возврат Новый Структура("Разряд,Результат",0,0);
		
	КонецЕсли;
	
	Возврат Новый Структура("Разряд,Результат",-1,0);	
				
	
КонецФункции

&НаСервере
Функция ЗагрузитьОтмеченныеКомплектыНаСервере()
	
	МассивСтрок = ТаблицаФайлов.НайтиСтроки(Новый Структура("Загрузить",Истина));
	Если МассивСтрок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Не отмечен ни один комплект для загрузки.'"));
		Возврат Ложь;
	КонецЕсли;
	
	ПроблемыССетью = Ложь;
	ЕстьСкачанныйКомплект = Ложь;
	Для Каждого СтрТЧ Из МассивСтрок Цикл
		//Необходимо скачать файл.
		//Если файл это zip архив, то разархивировать, найти файл с расширение repx и поместить во временное хранилище.
		//Если это файл с расширением repx, то сразу его поместить во временное хранилище.
		
		Если Не ЗначениеЗаполнено(СтрТЧ.АдресКомплекта) Тогда
			ПолучитьКомплектДляЗагрузки(СтрТЧ,ПроблемыССетью);
		КонецЕсли;
		
		Если ПроблемыССетью = Истина Тогда
			Прервать;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрТЧ.АдресКомплекта) Тогда
			ЕстьСкачанныйКомплект = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьСкачанныйКомплект;
	
КонецФункции

&НаСервере
Процедура ПолучитьКомплектДляЗагрузки(СтрТЧ,ПроблемыССетью)
	
	СсылкаДляСкачивания = СтрТЧ.Адрес;
	
	ЗаполнитьДанныеАутентификации();
	
	Если ДанныеАутентификации = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены данные аутентификации.'"));
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	Результат = Обработки.ИмпортКейса.ПолучитьКомплектДляЗагрузки(СсылкаДляСкачивания,КукиДляНужнойСтраницы,ДанныеАутентификации,Отказ,ПроблемыССетью);	
			
	Если Отказ = Истина
		ИЛИ Результат.Содержимое = Неопределено
		ИЛИ Результат.Содержимое.КодСостояния < 200 
		Или Результат.Содержимое.КодСостояния >= 300 Тогда
		
		СтрТЧ.Информация = "Не удалось скачать комплект со страницы поддержки.
		|" + Результат.СообщениеОбОшибке+Символы.ПС
		+ Результат.ИнформацияОбОшибке;
		
		СтрТЧ.Загрузить = Ложь;
		СтрТЧ.ИндексКартинки = 2;
		СтрТЧ.АдресКомплекта = "";
		
		Возврат;
	КонецЕсли;
			
	//добавить проверку успешной загрузки 
	
	Попытка
		ДвоичныеДанные = Результат.Содержимое.ПолучитьТелоКакДвоичныеДанные();	
		
		ИмяКаталога = ПолучитьИмяВременногоФайла("");
		
		Если СтрТЧ.Расширение = "repx" Тогда
			СтрТЧ.АдресКомплекта = ПоместитьВоВременноеХранилище(ДвоичныеДанные,УникальныйИдентификатор);	
		ИначеЕсли СтрТЧ.Расширение = "zip" Тогда
			
			Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
			
			Архив = Новый ЧтениеZipФайла(Поток);
			
			Для Каждого ТекЭлемент Из Архив.Элементы Цикл
				ТекРасширение = НРег(ТекЭлемент.Расширение);
				Если ТекРасширение = "repx" Тогда
					
					СоздатьКаталог(ИмяКаталога);
					
					Архив.Извлечь(ТекЭлемент,ИмяКаталога);
					ИмяФайла = ТекЭлемент.Имя;
					
					ДвоичныеДанныеКомплекта = Новый ДвоичныеДанные(ИмяКаталога+ПолучитьРазделительПути()+ИмяФайла);
					СтрТЧ.АдресКомплекта = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКомплекта,УникальныйИдентификатор);
					
					ДвоичныеДанныеКомплекта = Неопределено;

					Прервать;
				КонецЕсли;
			КонецЦикла;
			Архив.Закрыть();
			Архив = Неопределено;
			Поток = Неопределено;
			
			Попытка
				УдалитьФайлы(ИмяКаталога);
			Исключение
				//не критично
			КонецПопытки;
		КонецЕсли;
	Исключение
		СтрТЧ.Информация = "Не удалось прочитать скачанный файл";
		СтрТЧ.Загрузить = Ложь;
		СтрТЧ.ИндексКартинки = 2;
		СтрТЧ.АдресКомплекта = "";	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПолученияОтвета(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗапуститьУстановкуКомплектов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ЗапуститьУстановкуКомплектов()
	ЗагружаемаяСтрока = Неопределено;
	Для Каждого СтрТЧ Из ТаблицаФайлов Цикл
		Если СтрТЧ.Загрузить И ЗначениеЗаполнено(СтрТЧ.АдресКомплекта) Тогда
			Если ЗагружаемаяСтрока = Неопределено Тогда				
				ЗагружаемаяСтрока = СтрТЧ;		
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗагружаемаяСтрока <> Неопределено Тогда
		ЗагружаемаяСтрока.Информация = "Установка";
		ЗагружаемаяСтрока.ИндексКартинки = 0;
		ЗагружаемаяСтрока.Загрузить = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НеВыбиратьФайлы",Истина);
		ПараметрыФормы.Вставить("ЗапускатьЗагрузкуПослеПроверкиТребований",Истина);
		ПараметрыФормы.Вставить("ИмяФайлаКомплектаОтчетности","supplied-data.repx");
        ПараметрыФормы.Вставить("АдресФайлаКомплектаОтчетности",ЗагружаемаяСтрока.АдресКомплекта);
		ПараметрыФормы.Вставить("РазрешитьУдалениеОбъектов",Истина);

		ОткрытьФорму("Обработка.ИмпортКейса.Форма.Форма",ПараметрыФормы,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьСтраницуЗапасногоИсточника()
	Если ПолеHTML <> ЗапаснойИсточник Тогда
		ПолеHTML = ЗапаснойИсточник;
	Иначе
		//установим другой адрес, чтобы потом вернуть первоначальный
		ПолеHTML = "1";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекстСтраницы() Экспорт
	СтраницаСайта = Элементы.ПолеHTML.Документ.documentElement.innerHTML;
	ПрочитатьФайлыНаСервереИзДопИсточника(СтраницаСайта);	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлыНаСервереИзДопИсточника(СтраницаСайта)
	
	ТаблицаФайлов.Очистить();
	
	ПозицияДопМатериаловНачало = СтрНайти(СтраницаСайта,"tbody");
	
	Если ПозицияДопМатериаловНачало = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПозицияДопМатериаловКонец = СтрНайти(СтраницаСайта,"tbody",НаправлениеПоиска.СНачала,ПозицияДопМатериаловНачало+10);
	
	СтрокаДопМатериалов = Сред(СтраницаСайта,ПозицияДопМатериаловНачало,ПозицияДопМатериаловКонец-ПозицияДопМатериаловНачало);
	
	ПозицияСсылкиН = 1;
	НомерВхождения = 1;
	Пока ПозицияСсылкиН<>0 Цикл
		
		НачальныйБлокСсылки = СтрНайти(СтрокаДопМатериалов,"<a ",,,НомерВхождения); 
		 	
		Если НачальныйБлокСсылки = 0 Тогда
			Прервать;
		КонецЕсли;
		
		КолечныйБлокСсылки = СтрНайти(СтрокаДопМатериалов,">",,НачальныйБлокСсылки);
		
		СтрокаДляРазбора = Сред(СтрокаДопМатериалов,НачальныйБлокСсылки,КолечныйБлокСсылки-НачальныйБлокСсылки);
		
		ПозицияСсылкиН = СтрНайти(СтрокаДляРазбора,"href=""");
		
		ПозицияСсылкиК = СтрНайти(СтрокаДляРазбора,"""",,ПозицияСсылкиН+6);
		ТекстСсылки = Сред(СтрокаДляРазбора,ПозицияСсылкиН+6,ПозицияСсылкиК-(ПозицияСсылкиН+6));
		
		ПозицияНаименованиеН = СтрНайти(СтрокаДляРазбора,"data-caption=""",,ПозицияСсылкиН+1);
		ПозицияНаименованиеК = СтрНайти(СтрокаДляРазбора,"""",,ПозицияНаименованиеН+14);
		
		ТекстНаименования = СокрЛП(Сред(СтрокаДляРазбора,ПозицияНаименованиеН+14,ПозицияНаименованиеК-(ПозицияНаименованиеН+14))); 
		
		НоваяСтрокаТаблицы = ТаблицаФайлов.Добавить();
		НоваяСтрокаТаблицы.Адрес = "https://filerepository.1c.ru"+ТекстСсылки;
		НоваяСтрокаТаблицы.Наименование = ТекстНаименования;
		//НоваяСтрокаТаблицы.Описание = ОписаниеФайла; //описания в доп. источнике в текущей реализации нет
		НоваяСтрокаТаблицы.ИндексКартинки = 3;
		
		МассивЧастейПути = СтрРазделить(СтрЗаменить(ТекстСсылки,"?","/"),"/",Ложь);
		ИмяФайлаСРасширением = МассивЧастейПути[МассивЧастейПути.Количество()-2];
		
		ПозицияРасширения = СтрНайти(ИмяФайлаСРасширением,".",НаправлениеПоиска.СКонца);
		Расширение = "";
		Если ПозицияРасширения>0 Тогда
			Расширение = Сред(ИмяФайлаСРасширением,ПозицияРасширения+1);
			ИмяФайла = Лев(ИмяФайлаСРасширением,ПозицияРасширения-1);
		Иначе
			ИмяФайла = ИмяФайлаСРасширением;
		КонецЕсли;
			
		
		НоваяСтрокаТаблицы.ИмяФайла = ИмяФайла;
		НоваяСтрокаТаблицы.Расширение = НРег(Расширение);
		
		//Наименование комплекта формируется как <название комплекта> <версия (опционально)> <номер версии> <от> <дата>
		//заполним колонки версия и версия с датой, и оставим только название комплекта
		МассивЧастейНазвания = СтрРазделить(НоваяСтрокаТаблицы.Наименование," ",Ложь);
		
		КоличествоЧастейНазвания = МассивЧастейНазвания.Количество();
		Если КоличествоЧастейНазвания>3 Тогда
			НоваяСтрокаТаблицы.ВерсияНаСайте = МассивЧастейНазвания[КоличествоЧастейНазвания-3];
			НоваяСтрокаТаблицы.ВерсияНаСайтеСДатой = МассивЧастейНазвания[КоличествоЧастейНазвания-3] + " "
											+ МассивЧастейНазвания[КоличествоЧастейНазвания-2] + " "
											+ МассивЧастейНазвания[КоличествоЧастейНазвания-1];
											
			МассивЧастейНазвания.Удалить(КоличествоЧастейНазвания-1);
			МассивЧастейНазвания.Удалить(КоличествоЧастейНазвания-2);
			МассивЧастейНазвания.Удалить(КоличествоЧастейНазвания-3);
			Если НРег(МассивЧастейНазвания[КоличествоЧастейНазвания-4]) = "версия" Тогда
				МассивЧастейНазвания.Удалить(КоличествоЧастейНазвания-4);	
			КонецЕсли;
			
			НоваяСтрокаТаблицы.Наименование = СтрСоединить(МассивЧастейНазвания," ");
			
			Если Прав(НоваяСтрокаТаблицы.Наименование,1) = "," Тогда
				//если последний символ в наименовании запятая, уберем ее
				НоваяСтрокаТаблицы.Наименование = Сред(НоваяСтрокаТаблицы.Наименование,1,СтрДлина(НоваяСтрокаТаблицы.Наименование)-1);	
			КонецЕсли;
		КонецЕсли;
		
		ТекДанныеКомплекта = Обработки.ИмпортКейса.ПолучитьДанныеУстановленногоКомплекта(ИмяФайла,СоответствиеИменИдентификаторам);
		НоваяСтрокаТаблицы.ТекущаяВерсия = ТекДанныеКомплекта.ТекущаяВерсия;
		НоваяСтрокаТаблицы.НеИспользуется = ТекДанныеКомплекта.НеИспользуется;
		НоваяСтрокаТаблицы.ИдентификаторКомплекта = ТекДанныеКомплекта.ИдентификаторКомплекта;
		
		
		ОбновитьПредставлениеВерсииВСтроке(НоваяСтрокаТаблицы);

		
		Если ЗначениеЗаполнено(НоваяСтрокаТаблицы.ТекущаяВерсия) Тогда
			РезультатСравнения = СравнитьВерсииКомплектов(НоваяСтрокаТаблицы.ВерсияНаСайте, НоваяСтрокаТаблицы.ТекущаяВерсия);
			
			Если РезультатСравнения.Разряд = -1 Тогда
				//Сравнить не удалось
				
			ИначеЕсли РезультатСравнения.Результат <> 0 И РезультатСравнения.Разряд = 0 Тогда
				//отличаются редакции - совсем новый комплект
				Если РезультатСравнения.Результат>0 Тогда
					НоваяСтрокаТаблицы.ЕстьОбновление = Истина;
					НоваяСтрокаТаблицы.Загрузить = Истина И НоваяСтрокаТаблицы.НеИспользуется = Ложь;
					НоваяСтрокаТаблицы.Информация = "Доступна новая версия";
				КонецЕсли;
			Иначе
				//обновление комплекта
				Если РезультатСравнения.Результат>0 Тогда
					НоваяСтрокаТаблицы.ЕстьОбновление = Истина;
					НоваяСтрокаТаблицы.Загрузить = Истина И НоваяСтрокаТаблицы.НеИспользуется = Ложь;
					НоваяСтрокаТаблицы.Информация = "Доступна новая версия";
				ИначеЕсли РезультатСравнения.Результат<0 Тогда
					//например, через ЛК получен комплект, который еще не опубликован на странице поддержки
					НоваяСтрокаТаблицы.Информация = "В базу загружена более новая версия, еще не опубликованная на сайте";
					НоваяСтрокаТаблицы.ЗагруженаБолееНоваяВерсия = Истина;
				ИначеЕсли РезультатСравнения.Результат=0 Тогда
					НоваяСтрокаТаблицы.Информация = "Версия уже загружена";
				КонецЕсли;
				
			КонецЕсли;
	
		КонецЕсли;
			
		НомерВхождения = НомерВхождения + 1;
		
	КонецЦикла;
	
	ТаблицаФайлов.Сортировать("Наименование");
	
КонецПроцедуры






#КонецОбласти
