#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обозначения и значения числового параметра РежимФормирования.
Функция ПолучитьКодыРежимовФормирования() Экспорт
	
	Коды = Новый Структура();
	Коды.Вставить("ПериодПроведенияИнвентаризации", 0);
	Коды.Вставить("ОтДатыИнвентаризацииДоДатыНачалаПроведенияИнвентаризации", 1);
	Коды.Вставить("ОтДатыИнвентаризацииДоДатыОкончанияПроведенияИнвентаризации", 2);
	
	Возврат Коды;
	
КонецФункции

// Возвращает даты периода формирования отчета в зависимости от Режима формирования.
Функция ОпределитьПериодФормирования(РежимФормирования, ДатаИнвентаризации, ДатаНачала, ДатаОкончания) Экспорт
	
	Коды = ПолучитьКодыРежимовФормирования();
	
	Если РежимФормирования = Коды.ПериодПроведенияИнвентаризации Тогда
		Дата1 = ДатаНачала;
		Дата2 = ДатаОкончания;
		
	ИначеЕсли РежимФормирования = Коды.ОтДатыИнвентаризацииДоДатыНачалаПроведенияИнвентаризации Тогда
		Дата1 = ДатаИнвентаризации;
		Дата2 = НачалоДня(НачалоДня(ДатаНачала) - 1);
		
	ИначеЕсли РежимФормирования = Коды.ОтДатыИнвентаризацииДоДатыОкончанияПроведенияИнвентаризации Тогда
		Дата1 = ДатаИнвентаризации;
		Дата2 = ДатаОкончания;
	КонецЕсли;
	
	ПериодФормирования = Новый Структура();
	ПериодФормирования.Вставить("Дата1", Дата1);
	ПериодФормирования.Вставить("Дата2", Дата2);
	
	Возврат ПериодФормирования;
	
КонецФункции

// Минимальный набор сведений описи, общий для всех документов описей.
Функция НовыйОбщиеДанныеОписи() Экспорт
	
	Возврат Новый Структура("
		|Ссылка,
		|Дата,
		|Номер,
		|РешениеОПроведенииИнвентаризации,
		|ДатаИнвентаризации,
		|ДатаНачала,
		|ДатаОкончания,
		|Организация,
		|Подразделение,
		|ИФО");
	
КонецФункции

#Область ПроверкаПередФормированиемРеестра

Процедура ПроверитьОбщиеДанныеОписи(Знач ДанныеОписи, Отказ) Экспорт
	
	ШаблонСообщения = ПолучитьШаблонСообщенияПроверкиПередФормированиемРеестра();
	
	Если Не ЗначениеЗаполнено(ДанныеОписи.ДатаИнвентаризации) Тогда
		ТекстСообщения = СтрШаблон(ШаблонСообщения,
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru='Дата инвентаризации'")));
			
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеОписи.Ссылка, "ДатаИнвентаризации", "Объект", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеОписи.ДатаНачала) Тогда
		ТекстСообщения = СтрШаблон(ШаблонСообщения,
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru='Начало периода инвентаризации'")));
			
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеОписи.Ссылка, "ДатаНачала", "Объект", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеОписи.ДатаОкончания) Тогда
		ТекстСообщения = СтрШаблон(ШаблонСообщения,
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru='Окончание периода инвентаризации'")));
			
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеОписи.Ссылка, "ДатаОкончания", "Объект", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеОписи.Организация) Тогда
		ТекстСообщения = СтрШаблон(ШаблонСообщения,
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru='Организация'")));
			
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеОписи.Ссылка, "Организация", "Объект", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеОписи.РешениеОПроведенииИнвентаризации) Тогда
		ТекстСообщения = СтрШаблон(ШаблонСообщения,
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru='Решение о проведении инвентаризации'")));
			
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеОписи.Ссылка, "РешениеОПроведенииИнвентаризации", "Объект", Отказ);
	КонецЕсли;
	
	ДатаИнвентаризации = ДанныеОписи.ДатаИнвентаризации;
	ДатаНачала = ДанныеОписи.ДатаНачала;
	ДатаОкончания = ДанныеОписи.ДатаОкончания;
	
	Если ЗначениеЗаполнено(ДатаИнвентаризации) И ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		// Проверка дат, аналогичная ИнвентаризацияСервер.ПроверитьДатыИнвентаризации_ОдинНаборДанных().
		
		Если ДатаНачала > ДатаОкончания Тогда
			ТекстСообщения = НСтр("ru='Дата начала периода инвентаризации превышает дату окончания периода инвентаризации'");
				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеОписи.Ссылка, "ДатаНачала", "Объект", Отказ);
		КонецЕсли;
		
		НачалоПримененияПриказа144н = '20240701'; // Дата начала применения приказа Минфина от 13.09.2023 N 144н.
		
		Если ДатаИнвентаризации < НачалоПримененияПриказа144н Тогда
			Если ДатаИнвентаризации > ДатаОкончания Тогда
				ТекстСообщения = НСтр("ru='Дата инвентаризации превышает дату окончания периода инвентаризации'");
					
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеОписи.Ссылка, "ДатаИнвентаризации", "Объект", Отказ);
			КонецЕсли;
		Иначе
			Если ДатаИнвентаризации > ДатаНачала Тогда
				ТекстСообщения = НСтр("ru='Дата инвентаризации превышает дату начала периода инвентаризации'");
					
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеОписи.Ссылка, "ДатаИнвентаризации", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьШаблонСообщенияПроверкиПередФормированиемРеестра() Экспорт
	
	Возврат НСтр("ru='Формирование реестра документов отменено. %1'");
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

Функция ЭтоРегистрУчета() Экспорт
	
	Возврат Истина;
	
КонецФункции

Процедура СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета) Экспорт   
	
	РежимФормирования = СтандартныеОтчетыКлиентСервер.ПолучитьПараметр(
		ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки,
		"РежимФормирования").Значение;
	
	ПараметрыДанных = ОтчетОбъект.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных;
	
	ПериодФормирования = ОпределитьПериодФормирования(
		РежимФормирования,
		ПолучитьЗначениеПараметра(ОтчетОбъект, "ДатаИнвентаризации"),
		ПолучитьЗначениеПараметра(ОтчетОбъект, "ДатаНачала"),
		ПолучитьЗначениеПараметра(ОтчетОбъект, "ДатаОкончания"));
	
	СвойстваРегистраУчета.Вставить("Организация", ПолучитьЗначениеПараметра(ОтчетОбъект, "Организация"));
	СвойстваРегистраУчета.Вставить("ПодразделениеОрганизации", ПолучитьЗначениеПараметра(ОтчетОбъект, "Подразделение"));
	СвойстваРегистраУчета.Вставить("НачалоПериода", ПериодФормирования.Дата1);
	СвойстваРегистраУчета.Вставить("КонецПериода", ПериодФормирования.Дата2);
	
КонецПроцедуры

Процедура ОбновитьНаименованиеРегистраУчета() Экспорт
	
	ИмяОтчета = "РеестрДокументовКПроводимойИнвентаризации";
	
	ИдентификаторОтчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ОтчетОбъект." + ИмяОтчета));
	
	ВариантОтчета = ВариантыОтчетов.ВариантОтчета(ИдентификаторОтчета, "Основной");
	
	НовоеНаименование = ВариантОтчета.Наименование;
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("ИдентификаторОтчета", ИдентификаторОтчета);
	ЗапросПоиск.УстановитьПараметр("НовоеНаименование", НовоеНаименование);
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ
	|	Ссылка,
	|	Наименование
	|ИЗ
	|	Справочник.ВидыРегистровУчета
	|ГДЕ
	|	Отчет = &ИдентификаторОтчета
	|	И НЕ Наименование = &НовоеНаименование";
	
	Выборка = ЗапросПоиск.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭлементСправочника = Выборка.Ссылка.ПолучитьОбъект();
		
		ЭлементСправочника.Наименование = НовоеНаименование;
		
		ЭлементСправочника.Записать();
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Регистры учета. Изменено наименование вида регистра учета для отчета %1'"), ИмяОтчета);
		
		ЗаписьЖурналаРегистрации(ТекстСообщения,
			УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ВидыРегистровУчета, ЭлементСправочника);
			
		Прервать;
	КонецЦикла;
	
КонецПроцедуры


// СтандартныеПодсистемы.ВариантыОтчетов
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = 'Реестр документов к проводимой инвентаризации'");
	НастройкиВарианта.Включен = Ложь;
	
КонецПроцедуры

// Определяет состав программного интерфейса для интеграции с конфигурацией.
//
// Параметры:
//   Настройки - Структура - Настройки интеграции этого объекта.
//       См. возвращаемое значение функции ПодключаемыеКоманды.НастройкиПодключаемыхОтчетовИОбработок().
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт
	Настройки.Размещение.Добавить(Метаданные.Документы.ИнвентаризационнаяОписьБСО);
	Настройки.Размещение.Добавить(Метаданные.Документы.ИнвентаризационнаяОписьНФА);
	Настройки.Размещение.Добавить(Метаданные.Документы.ИнвентаризационнаяОписьРасчетовПоПоступлениям);
	Настройки.Размещение.Добавить(Метаданные.Документы.ИнвентаризационнаяОписьРасчетовСКонтрагентами);
	Настройки.ДобавитьКомандыОтчетов = Истина;
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.РеестрДокументовКПроводимойИнвентаризации) Тогда
		Команда = КомандыОтчетов.Добавить();
		Команда.Представление = НСтр("ru='Реестр документов к проводимой инвентаризации'");
		Команда.КлючВарианта = "Основной";
		Команда.Картинка = БиблиотекаКартинок.Отчет;
		Команда.МножественныйВыбор = Ложь;
	КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗначениеПараметра(ОтчетОбъект, ИмяПараметра)
	
	Параметр = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(
		Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	
	Возврат Параметр.Значение;
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОбновитьНаименованиеРегистраУчета");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли