#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасчетНалогаНаИмущество")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасчетЗемельногоНалога") 
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасчетТранспортногоНалога") Тогда
		
		Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
		ДокументОснование = ДанныеЗаполнения;
		Организация       = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
		ОпределитьВидНалогаПоТипуДокументаОснования();
		ЗаполнитьПоРасчетуИмущественногоНалога();
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Для каждого СтрокаТаблицы Из ДвиженияДокумента Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.СчетДт) Тогда
			
			Префикс = "ДвиженияДокумента[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
			ИмяСписка = НСтр("ru = 'Бухгалтерский учет'");
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не заполнено поле ""Счет дебета"" в строке %1 списка ""%2""'"),
				СтрокаТаблицы.НомерСтроки, ИмяСписка);
				
			Поле = Префикс + "ОтражениеВУчете";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументОснование)
		И УчетныеДанныеОС.Количество() > 0
		И ДвиженияДокумента.Итог("Сумма") <> УчетныеДанныеОС.Итог("Сумма") Тогда
	
			ТекстСообщения = НСтр("ru = 'Сумма к отражению в учете не совпадает с суммой налога к распределению'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ДвиженияДокумента", "Объект", Отказ);

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента  = ДвиженияДокумента.Итог("Сумма");
	
	Если РазделЛицевогоСчетаВТаблице = 0 Тогда
		Если ДвиженияДокумента.Количество() > 0 Тогда
			ДвиженияДокумента.ЗагрузитьКолонку(Новый Массив(ДвиженияДокумента.Количество()), "РазделЛицевогоСчета");
		КонецЕсли;
	Иначе
		РазделЛицевогоСчета = Справочники.РазделыЛицевыхСчетов.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

// Заполняет документ по данным документа расчета налога
// ДокументОснование  - ДокументСсылка.РасчетНалогаНаИмущество, ДокументСсылка.РасчетЗемельногоНалога, ДокументСсылка.РасчетТранспортногоНалога
//
Процедура ЗаполнитьПоРасчетуИмущественногоНалога() Экспорт

	Если ПорядокОтраженияВУчете.Количество() > 0 Тогда
		ПорядокОтраженияВУчете.Очистить();
	КонецЕсли;
	Если УчетныеДанныеОС.Количество() > 0 Тогда
		УчетныеДанныеОС.Очистить();
	КонецЕсли;
	
	ПараметрыЗаполнения = Документы.НачислениеИмущественныхНалогов.ПараметрыЗаполненияУчетныеДанныеИПорядокОтражения();
	ПараметрыЗаполнения.Организация = Организация;
	ПараметрыЗаполнения.Дата 		= ?(Ссылка.Пустая(), КонецДня(Дата), Дата);
	ПараметрыЗаполнения.ВидНалога 	= ВидНалога;
	ПараметрыЗаполнения.ДокументОснование = ДокументОснование;
	
	Документы.НачислениеИмущественныхНалогов.ЗаполнитьУчетныеДанныеИПорядокОтражения(
		ПараметрыЗаполнения,
		УчетныеДанныеОС,
		ПорядокОтраженияВУчете);
		
	ТаблицаБухгалтерскийУчет = Документы.НачислениеИмущественныхНалогов.СформироватьТаблицуБухгалтерскийУчет(
		ПорядокОтраженияВУчете.Выгрузить());
		
	РазделыЛицевыхСчетовДокумента = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаБухгалтерскийУчет, "РазделЛицевогоСчета", Истина);
	
	Если РазделыЛицевыхСчетовДокумента.Количество() > 1 Тогда
		РазделЛицевогоСчетаВТаблице = 1;
	Иначе
		РазделЛицевогоСчетаВТаблице = 0;
		РазделЛицевогоСчета = ?(РазделыЛицевыхСчетовДокумента.Количество() = 1, РазделыЛицевыхСчетовДокумента[0],
			Справочники.РазделыЛицевыхСчетов.ПустаяСсылка());
	КонецЕсли;
	
	ДвиженияДокумента.Загрузить(ТаблицаБухгалтерскийУчет);
	
КонецПроцедуры

// Заполняет поле ВидНалога в соответствии с типом документа основания
//
Процедура ОпределитьВидНалогаПоТипуДокументаОснования()
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасчетНалогаНаИмущество") Тогда
		ВидНалога = Перечисления.ВидыИмущественныхНалогов.НалогНаИмущество;
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасчетЗемельногоНалога") Тогда
		ВидНалога = Перечисления.ВидыИмущественныхНалогов.ЗемельныйНалог;
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасчетТранспортногоНалога") Тогда
		ВидНалога = Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог;
	Иначе
		ВидНалога = Перечисления.ВидыИмущественныхНалогов.ПустаяСсылка();	
	КонецЕсли;

КонецПроцедуры  

#КонецОбласти

#КонецОбласти

#КонецЕсли