#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьПоставляемыеЭлементы(Успех = Неопределено) Экспорт
	
	Успех = Ложь;
	
	МетаданныеОбъекта = Метаданные.Справочники.ЗаключенияКомиссииПоИнвентаризационнымОписям;
	
	ИмяСобытия = НСтр("ru='Инициализация поставляемых элементов справочника ЗаключенияКомиссииПоИнвентаризационнымОписям'");
	
	ТаблицаПоставляемыхЭлементов = ПолучитьТаблицуПоставляемыхЭлементов(МетаданныеОбъекта, ИмяСобытия);
	
	Если ТаблицаПоставляемыхЭлементов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВремТаблица = ТаблицаПоставляемыхЭлементов.Скопировать(, "Наименование");
	ВремТаблица.Свернуть("Наименование");
	СписокНаименований = ВремТаблица.ВыгрузитьКолонку("Наименование");
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("СписокНаименований", СписокНаименований);
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	Справочник.ЗаключенияКомиссииПоИнвентаризационнымОписям
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И Наименование В(&СписокНаименований)";
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаНайденныхЭлементов = ЗапросПоиск.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Поиск = Новый Структура("Наименование,ИмяПредопределенныхДанных");
	
	НачатьТранзакцию();
	
	Попытка
		Для Каждого СтрокаПоставляемогоЭлемента Из ТаблицаПоставляемыхЭлементов Цикл
			ЗаполнитьЗначенияСвойств(Поиск, СтрокаПоставляемогоЭлемента);
			
			МассивСтрок = ТаблицаНайденныхЭлементов.НайтиСтроки(Поиск);
			
			Если МассивСтрок.Количество() = 0 Тогда
				// Создаем новый элемент
				
				СправочникОбъект = Справочники.ЗаключенияКомиссииПоИнвентаризационнымОписям.СоздатьЭлемент();
				
				ЗаполнитьЗначенияСвойств(СправочникОбъект, СтрокаПоставляемогоЭлемента,, "ИмяПредопределенныхДанных");
				
				СправочникОбъект.Записать();
				
				Продолжить;
			КонецЕсли;
			
			Для Каждого СтрокаНайденногоЭлемента Из МассивСтрок Цикл
				// Настраиваем существующий элемент
				
				НужноОбновить = (ЗначениеЗаполнено(СтрокаПоставляемогоЭлемента.КодФормыОписи) И Не ЗначениеЗаполнено(СтрокаНайденногоЭлемента.КодФормыОписи))
					Или (ЗначениеЗаполнено(СтрокаПоставляемогоЭлемента.НаименованиеПолное) И Не ЗначениеЗаполнено(СтрокаНайденногоЭлемента.НаименованиеПолное));
				
				Если Не НужноОбновить Тогда
					Продолжить;
				КонецЕсли;
					
				СправочникСсылка = СтрокаНайденногоЭлемента.Ссылка;
				
				Блокировка = Новый БлокировкаДанных();
				ЭлементБлокировки = Блокировка.Добавить(МетаданныеОбъекта.ПолноеИмя());
				ЭлементБлокировки.УстановитьЗначение("Ссылка", СправочникСсылка);
				Блокировка.Заблокировать();
				
				СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
				
				ЗаполнитьЗначенияСвойств(СправочникОбъект, СтрокаПоставляемогоЭлемента,, "ИмяПредопределенныхДанных");
				
				СправочникОбъект.Записать();
			КонецЦикла;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Успех = Истина;
		
		ТекстСообщения = НСтр("ru='Успешно инициализированы поставляемые элементы справочника ЗаключенияКомиссииПоИнвентаризационнымОписям'");
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеОбъекта,
			,
			ТекстСообщения);
	Исключение
		ОтменитьТранзакцию();
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru='Не удалось инициализировать поставляемые элементы справочника ЗаключенияКомиссииПоИнвентаризационнымОписям по причине %1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Предупреждение,
			МетаданныеОбъекта,
			,
			ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуПоставляемыхЭлементов(МетаданныеОбъекта, ИмяСобытия)
	
	Макет = Справочники.ЗаключенияКомиссииПоИнвентаризационнымОписям.ПолучитьМакет("ПоставляемыеЭлементы");
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строки");
	
	ИменаКолонокМакета = Новый Соответствие();
	ИменаКолонокМакета.Вставить(1, "КодФормыОписи");
	ИменаКолонокМакета.Вставить(2, "ИмяПредопределенныхДанных");
	ИменаКолонокМакета.Вставить(3, "Наименование");
	ИменаКолонокМакета.Вставить(4, "НаименованиеПолное");
	
	НомерПоследнейКолонкиМакета = 4;
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("КодФормыОписи",				Новый ОписаниеТипов("ПеречислениеСсылка.КодыФормОписей"));
	Таблица.Колонки.Добавить("ИмяПредопределенныхДанных",	Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Наименование",				Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("НаименованиеПолное",			Новый ОписаниеТипов("Строка"));
	
	Для НомерСтроки = 1 По ОбластьСтроки.ВысотаТаблицы Цикл
		
		СтрокаТаблицы = Таблица.Добавить();
		
		Для НомерСтолбца = 1 По НомерПоследнейКолонкиМакета Цикл
			
			ТекстЯчейки = ОбластьСтроки.Область(НомерСтроки, НомерСтолбца, НомерСтроки, НомерСтолбца).Текст;
			
			ИмяКолонкиМакета = ИменаКолонокМакета.Получить(НомерСтолбца);
			
			Если ИмяКолонкиМакета = "КодФормыОписи" Тогда
				Если ПустаяСтрока(ТекстЯчейки) Тогда
					Значение = Перечисления.КодыФормОписей.ПустаяСсылка();
				Иначе
					ИмяЗначенияПеречисления = "ф" + ТекстЯчейки;
					
					Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Перечисления.КодыФормОписей, ИмяЗначенияПеречисления) Тогда
						ТекстСообщения = СтрШаблон(
							НСтр("ru='В макете поставляемых элементов справочника ЗаключенияКомиссииПоИнвентаризационнымОписям в колонке ""Код формы описи"" указано неподдерживаемое значение ""%1""'"),
							ТекстЯчейки);
							
						ЗаписьЖурналаРегистрации(
							ИмяСобытия,
							УровеньЖурналаРегистрации.Предупреждение,
							МетаданныеОбъекта,
							,
							ТекстСообщения);
							
						Возврат Неопределено;
					КонецЕсли;
					
					Значение = Перечисления.КодыФормОписей[ИмяЗначенияПеречисления];
				КонецЕсли;
				
			ИначеЕсли ИмяКолонкиМакета = "ИмяПредопределенныхДанных" Тогда
				Если Не ПустаяСтрока(ТекстЯчейки) И Не ОбщегоНазначенияКлиентСервер.ИмяСоответствуетТребованиямИменованияСвойств(ТекстЯчейки) Тогда
					ТекстСообщения = СтрШаблон(
						НСтр("ru='В макете поставляемых элементов справочника ЗаключенияКомиссииПоИнвентаризационнымОписям в колонке ""Имя предопределенного элемента"" указано значение ""%1"", не соответствующее требованиям наименования имен элементов'"),
						ТекстЯчейки);
						
					ЗаписьЖурналаРегистрации(
						ИмяСобытия,
						УровеньЖурналаРегистрации.Предупреждение,
						МетаданныеОбъекта,
						,
						ТекстСообщения);
						
					Возврат Неопределено;
				КонецЕсли;
				
				Значение = ТекстЯчейки;
				
			Иначе
				Значение = ТекстЯчейки;
			КонецЕсли;
			
			СтрокаТаблицы[ИмяКолонкиМакета] = Значение;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#КонецЕсли