#Область ПрограммныйИнтерфейс

Функция ЕстьРеквизитОбъекта(Объект, ИмяРеквизита) Экспорт
	
	КлючУникальности   = Новый УникальныйИдентификатор;
	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);

	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции

// Пересчитывает количество из базовой единицы измерения номенклатуры в единицу измерения ВетИС.
//
Функция ПересчитатьКоличествоЕдиницВЕТИС(Количество, Номенклатура, ЕдиницаИзмеренияВЕТИС, КэшированныеЗначения, ТекстОшибки = Неопределено) Экспорт
	
	НовоеКоличествоВЕТИС = Неопределено;
	
	Результат = ИнтеграцияВЕТИСБГУВызовСервера.ПолучитьКоэффициентЕдиницыИзмеренияВЕТИС(ЕдиницаИзмеренияВЕТИС, Номенклатура);
	
	Если Результат = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Единицы измерения номенклатуры не соотвествуют единицам ВЕТИС'");
	Иначе
		НовоеКоличествоВЕТИС = ?(Результат <> 0, Количество * Результат, Количество);
	КонецЕсли;
	
	Возврат НовоеКоличествоВЕТИС;
	
КонецФункции

// Пересчитывает количество из единицы измерения ВетИС в базовую единицу измерения номенклатуры.
//
Функция ПересчитатьКоличествоЕдиниц(КоличествоВЕТИС, Номенклатура, ЕдиницаИзмеренияВЕТИС, КэшированныеЗначения, ТекстОшибки = Неопределено) Экспорт
	
	НовоеКоличество = Неопределено;
	
	Результат = ИнтеграцияВЕТИСБГУВызовСервера.ПолучитьКоэффициентЕдиницыИзмеренияВЕТИС(ЕдиницаИзмеренияВЕТИС, Номенклатура);
	
	Если Результат = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Единицы измерения номенклатуры не соотвествуют единицам ВЕТИС'");
	Иначе
		НовоеКоличество = ?(Результат <> 0, КоличествоВЕТИС / Результат, КоличествоВЕТИС);
	КонецЕсли;
	
	Возврат НовоеКоличество;
	
КонецФункции

#Область ИнтеграцияВЕТИСКлиентСервер

Процедура КомандыИсходящейТранспортнойОперации(Команды) Экспорт 
	
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"НакладнаяНаРеализациюТорг12", НСтр("ru = 'Накладную на реализацию товаров (ТОРГ-12)'"));
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"НакладнаяНаОтпускМ15", НСтр("ru = 'Накладную на отпуск материалов на сторону'"));
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ТребованиеНакладная0315006", НСтр("ru = 'Требование - накладная (Материальные запасы)'"));
	
КонецПроцедуры

Процедура КомандыВходящейТранспортнойОперации(Команды) Экспорт
	
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуОформить(Команды,"ПоступлениеМЗ", НСтр("ru = 'Поступление МЗ'"));
	
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ПоступлениеМЗ", НСтр("ru = 'Поступление МЗ'"));
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды,"ТребованиеНакладная0315006", НСтр("ru = 'Требование - накладная (Материальные запасы)'"));
	
КонецПроцедуры

Процедура КомандыПроизводственнойОперации(Команды) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура КомандыИнвентаризацииПродукции(Команды) Экспорт
	
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "АктСписанияМЗ", НСтр("ru = 'Акт списания материалов'"));
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "ПоступлениеМЗ", НСтр("ru = 'Поступление МЗ'"));
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "НакладнаяНаРеализациюТорг12", НСтр("ru = 'Накладную на реализацию товаров (ТОРГ-12)'"));
	ПодключаемыеКомандыИСКлиентСервер.ДобавитьКомандуВыбрать(Команды, "НакладнаяНаОтпускМ15", НСтр("ru = 'Накладную на отпуск материалов на сторону'"));
	
КонецПроцедуры

#КонецОбласти

Функция АвторизованВнешнийПользователь() Экспорт
	
	Возврат ТипЗнч(ПользователиКлиентСервер.АвторизованныйПользователь()) =  Тип("СправочникСсылка.ВнешниеПользователи");
	
КонецФункции	

#КонецОбласти