#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	FTPПуть = "/";
	FTPПорт = 21;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	ИмяТранспорта = ПолучитьПолноеИмяПредопределенногоЗначения(ЭтотОбъект.СпособВыгрузки);
	
	Если ИмяТранспорта <> "Перечисление.СпособыВыгрузкиФайлов.ЭлектроннаяПочта" Тогда 
		НепроверяемыеРеквизиты.Добавить("УчетнаяЗаписьЭлектроннойПочты");
		НепроверяемыеРеквизиты.Добавить("Получатели");
	КонецЕсли;	
	
	Если ИмяТранспорта <> "Перечисление.СпособыВыгрузкиФайлов.FTP" Тогда 
		НепроверяемыеРеквизиты.Добавить("FTPСервер");
		НепроверяемыеРеквизиты.Добавить("FTPПорт");
		НепроверяемыеРеквизиты.Добавить("FTPПуть");
	КонецЕсли;	
	
	Если ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.FTP" Тогда	
		
		Если Лев(FTPПуть,1) <> "/" Тогда 
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Путь на FTP сервере должен начинаться с ""/"".'"),,"FTPПуть");
			
		КонецЕсли;
		
		Если Найти(FTPПуть,"\") <> 0 Тогда 
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'При выгрузке на FTP в качестве разделителя должен использоваться символ ""/"".'"),,"FTPПуть");
			
		КонецЕсли;   
		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.ЭлектроннаяПочта" Тогда
		МассивАдресов = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(ЭтотОбъект.Получатели);
		Счетчик = 0;
		
		Для Каждого АдресПолучателя Из МассивАдресов Цикл
			Счетчик = Счетчик + 1;	
			
			Если ЗначениеЗаполнено(АдресПолучателя.ОписаниеОшибки) Тогда 
				Отказ = Истина;
				
				Шаблон = НСтр("ru = 'Ошибка в %1 адресе получателя
				|%2'");
				Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Счетчик, АдресПолучателя.ОписаниеОшибки);
				ОбщегоНазначения.СообщитьПользователю(Сообщение,,"Получатели");
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;

	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,НепроверяемыеРеквизиты);	
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли