#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма, Неопределено - Форма отчета или форма настроек отчета.
//       Неопределено когда вызов без контекста.
//   КлючВарианта - Строка, Неопределено - Имя предопределенного
//       или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов без контекста.
//   Настройки - Структура - Настройки общей формы отчета (для изменения).
//       См. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.РазрешеноИзменятьСтруктуру 				= Ложь;
	Настройки.РазрешеноИзменятьВарианты 				= Ложь;

	Настройки.События.ПриОпределенииПараметровВыбора 				= Истина;
	Настройки.События.ПриОпределенииСвойствЭлементовФормыНастроек 	= Истина;

	
КонецПроцедуры

// Вызывается в форме отчета перед выводом настройки.
//   Подробнее - см. ОтчетыПереопределяемый.ПриОпределенииПараметровВыбора().
//
Процедура ПриОпределенииПараметровВыбора(Форма, СвойстваНастройки) Экспорт
	
	Если СвойстваНастройки.ОписаниеТипов.СодержитТип(Тип("ПланСчетовСсылка.ЕПСБУ")) Тогда
		СвойстваНастройки.ОграничиватьВыборУказаннымиЗначениями = Истина;
		СвойстваНастройки.ЗначенияДляВыбора.Очистить();
		ДоступныеСчета = БухгалтерскийУчет.СписокСчетов("501.11,501.14,501.15,503.11,503.14,503.15"); 
		Для Каждого ЭлементСписка Из ДоступныеСчета Цикл
			СвойстваНастройки.ЗначенияДляВыбора.Добавить(ЭлементСписка);	
		КонецЦикла;	
	КонецЕсли;
    
КонецПроцедуры

// Вызывается после определения свойств элементов формы, связанных с пользовательскими настройками.
// См. ОтчетыСервер.СвойстваЭлементовФормыНастроек()
// Позволяет переопределить свойства, для целей персонализации отчета.
//
// Параметры:
//  ТипФормы - ТипФормыОтчета - см. Синтакс-помощник.
//  СвойстваЭлементов - Структура - см. ОтчетыСервер.СвойстваЭлементовФормыНастроек().
//  ПользовательскиеНастройки - КоллекцияЭлементовПользовательскихНастроекКомпоновкиДанных - элементы актуальных
//                              пользовательских настроек, влияющих на создание связанных элементов формы.
//
Процедура ПриОпределенииСвойствЭлементовФормыНастроек(ТипФормы, СвойстваЭлементов, ПользовательскиеНастройки) Экспорт 
	
	СвойстваГруппы = ОтчетыСервер.СвойстваГруппыЭлементовФормы();
	СвойстваГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СвойстваЭлементов.Группы.Вставить("ФиксированныеПараметры_0", СвойстваГруппы);
	
	СвойстваГруппы = ОтчетыСервер.СвойстваГруппыЭлементовФормы();
	СвойстваГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СвойстваГруппы.Вставить("Отображение", ОтображениеОбычнойГруппы.ОбычноеВыделение);
	СвойстваЭлементов.Группы.Вставить("ФиксированныеПараметры_1", СвойстваГруппы);

	СвойстваГруппы = ОтчетыСервер.СвойстваГруппыЭлементовФормы();
	СвойстваГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	СвойстваГруппы.Вставить("Отображение", ОтображениеОбычнойГруппы.ОбычноеВыделение);
	СвойстваЭлементов.Группы.Вставить("ФиксированныеПараметры_2", СвойстваГруппы);

	ФиксированныеПараметры_0 = Новый Структура("Период, Счет, Организация");
	ФиксированныеПараметры_1 = Новый Структура("Подразделение, ПоПодразделениям");
	ФиксированныеПараметры_2 = Новый Структура("ГлавныйБухгалтер, НачальникОтдела, Исполнитель, ДатаПодписания");
	
	ШиринаПоля = Новый Структура("Счет, Организация, Подразделение, ПоПодразделениям, ГлавныйБухгалтер, НачальникОтдела, Исполнитель, ДатаПодписания", 
	5, 0, 0, 0, 0, 0, 0, 0);
	
	Для Каждого ЭлементНастройки Из ПользовательскиеНастройки Цикл 
		
		Если ТипЗнч(ЭлементНастройки) <> Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ФиксированныеПараметры_0.Свойство(ЭлементНастройки.Параметр) Тогда
			ИдентификаторГруппы = "ФиксированныеПараметры_0";
		ИначеЕсли ФиксированныеПараметры_1.Свойство(ЭлементНастройки.Параметр) Тогда
			ИдентификаторГруппы = "ФиксированныеПараметры_1";
		ИначеЕсли ФиксированныеПараметры_2.Свойство(ЭлементНастройки.Параметр) Тогда
			ИдентификаторГруппы = "ФиксированныеПараметры_2";	
		Иначе
			Продолжить;
	    КонецЕсли;
		
		СвойстваПоля = СвойстваЭлементов.Поля.Найти(
			ЭлементНастройки.ИдентификаторПользовательскойНастройки, "ИдентификаторНастройки");
		
		Если СвойстваПоля = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		СвойстваПоля.ИдентификаторГруппы = ИдентификаторГруппы;
		
		ИмяПараметра = Строка(ЭлементНастройки.Параметр);
		Если ИмяПараметра <> "Период" Тогда 
			СвойстваПоля.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Если НЕ ШиринаПоля[ИмяПараметра] = 0 Тогда 
				СвойстваПоля.Ширина = ШиринаПоля[ИмяПараметра];
				СвойстваПоля.РастягиватьПоГоризонтали = Ложь;
			КонецЕсли;
			Если ИмяПараметра = "ПоПодразделениям" И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
				СвойстваПоля.ЭлементНастройки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

