
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.РеквизитыЛицевогоСчета) Тогда
			
			ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию();
			
		КонецЕсли;	

	КонецЕсли;
	
	ПлательщикПодробности = СформироватьПодробностиПлательщика(Объект);
	
	ПолучательПодробности = СформироватьПодробностиПолучателя(Объект);
	
	Строка01Подробности = СформироватьПодробностиДоговора01(Объект);
	
	Строка02Подробности = СформироватьПодробностиДоговора02(Объект);
	
	УстановитьДоступностьЭлементов(ЭтотОбъект);
	
	ПлатежноРасчетныеДокументы.ПриСозданииНаСервереФормыДокумента(ЭтаФорма);
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.РедактированиеПлатежныхРеквизитов") Тогда
		
		Если ВыбранноеЗначение.КлючДанных =	"Плательщик" Тогда
			
			Объект.ПлательщикБанковскийСчет   = ВыбранноеЗначение.БанковскийСчет;
			Объект.ПлательщикБИКБанка		  = ВыбранноеЗначение.БИКБанка;
			Объект.ПлательщикИНН 			  = ВыбранноеЗначение.ИНН ;
			Объект.ПлательщикКодРПБС 		  = ВыбранноеЗначение.КодРПБС;
			Объект.ПлательщикКПП 			  = ВыбранноеЗначение.КПП;
			Объект.ПлательщикНомерЛС 		  = ВыбранноеЗначение.ЛицевойСчет;
			Объект.ПлательщикНаименование 	  = ВыбранноеЗначение.Наименование;
			Объект.ПлательщикБюджет     	  = ВыбранноеЗначение.Бюджет;  
			Объект.ПлательщикОКПО        	  = ВыбранноеЗначение.ОКПО;
			Объект.ПлательщикАналитическийКод = ВыбранноеЗначение.АналитическийКод;
			Объект.ПлательщикАналитическийКод1= ВыбранноеЗначение.АналитическийКод1;
			
			ПлательщикПодробности = СформироватьПодробностиПлательщика(Объект);
			
			Модифицированность = Истина;
			
		ИначеЕсли ВыбранноеЗначение.КлючДанных =	"Получатель" Тогда
			
			Объект.ПолучательБанковскийСчет   = ВыбранноеЗначение.БанковскийСчет;
			Объект.ПолучательБИКБанка		  = ВыбранноеЗначение.БИКБанка;
			Объект.ПолучательИНН 			  = ВыбранноеЗначение.ИНН ;
			Объект.ПолучательКодРПБС 		  = ВыбранноеЗначение.КодРПБС;
			Объект.ПолучательКПП 			  = ВыбранноеЗначение.КПП;
			Объект.ПолучательНомерЛС 		  = ВыбранноеЗначение.ЛицевойСчет;
			Объект.ПолучательНаименование 	  = ВыбранноеЗначение.Наименование;
			Объект.ПолучательБюджет     	  = ВыбранноеЗначение.Бюджет;  
			Объект.ПолучательОКПО       	  = ВыбранноеЗначение.ОКПО;
			Объект.ПолучательАналитическийКод = ВыбранноеЗначение.АналитическийКод;
			Объект.ПолучательАналитическийКод1= ВыбранноеЗначение.АналитическийКод1;
			
			ПолучательПодробности = СформироватьПодробностиПолучателя(Объект);
			
			Модифицированность = Истина;
			
		КонецЕсли;	
		
	ИначеЕсли ВРег(ИсточникВыбора.ИмяФормы) = ВРег("Документ.ЗаявлениеНаВыдачуКазначейскогоАккредитива.Форма.РедактированиеРеквизитовДоговора") Тогда
		
		Если ВыбранноеЗначение.КлючДанных =	"Строка01" Тогда
			
			Объект.Наименование01	= ВыбранноеЗначение.Наименование;
			Объект.Номер01			= ВыбранноеЗначение.Номер;
			Объект.Дата01			= ВыбранноеЗначение.Дата;
			Объект.Идентификатор01	= ВыбранноеЗначение.Идентификатор;
			Объект.КПС01			= ВыбранноеЗначение.КПС;
			Объект.КодФАИП01		= ВыбранноеЗначение.КодФАИП;
			Объект.ОбъектФАИП		= ВыбранноеЗначение.ОбъектФАИП;
			Объект.НомерБО01		= ВыбранноеЗначение.НомерБО;
			Объект.СтавкаНДС01		= ВыбранноеЗначение.СтавкаНДС;
			
			Строка01Подробности = СформироватьПодробностиДоговора01(Объект);
			
			Модифицированность = Истина;
			
		ИначеЕсли ВыбранноеЗначение.КлючДанных =	"Строка02" Тогда
			
			Объект.Наименование02	= ВыбранноеЗначение.Наименование;
			Объект.Номер02			= ВыбранноеЗначение.Номер;
			Объект.Дата02			= ВыбранноеЗначение.Дата;
			Объект.Идентификатор02	= ВыбранноеЗначение.Идентификатор;
			Объект.КПС02			= ВыбранноеЗначение.КПС;
			Объект.КодФАИП02		= ВыбранноеЗначение.КодФАИП;
			Объект.НомерБО02		= ВыбранноеЗначение.НомерБО;
			Объект.СтавкаНДС02		= ВыбранноеЗначение.СтавкаНДС;
			
			Строка02Подробности = СформироватьПодробностиДоговора02(Объект);
			
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	ПлатежноРасчетныеДокументыКлиент.ОбработатьОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	ПолучитьРеквизитыПлательщика();

КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Организация, ТекущаяСтрока, ТипЛицевогоСчета, НаДату, РазрешитьВыборЛСсСопровождениемНаРазделах",
		Объект.Организация, Объект.РеквизитыЛицевогоСчета, ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Казначейский"), Объект.Дата, Истина);
	ОткрытьФорму("Справочник.РеквизитыЛицевыхСчетов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.РеквизитыЛицевогоСчета 	= ВыбранноеЗначение;
	ПолучитьЛицевойСчетОрганКазначейства();

КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ВидОперации = "выдать" Тогда
		
		 Объект.КодОперации 		= "01";
		 Объект.Договор02			= "";
		 Объект.Наименование02		= "";
		 Объект.Номер02				= "";
		 Объект.Дата02				= "";

	 ИначеЕсли Объект.ВидОперации = "перевести" Тогда  
		 
		 Объект.КодОперации = "02";
		 //Строка 02 Раздел 1 заполняется в случае представления Заявления на перевод.
		 
	 ИначеЕсли Объект.ВидОперации = "изменить" Тогда
		 
		 Объект.КодОперации = "03";
		 Объект.Договор02			= "";
		 Объект.Наименование02		= "";
		 Объект.Номер02				= "";
		 Объект.Дата02				= "";
		 
 
		 //В случае представления Заявления на изменение и Заявления на отзыв Раздел 2 не заполняется.

	 ИначеЕсли Объект.ВидОперации = "отозвать" Тогда
		 
		 Объект.КодОперации = "04";
		 
		 Объект.Договор02			= "";
		 Объект.Наименование02		= "";
		 Объект.Номер02				= "";
		 Объект.Дата02				= "";
		 Объект.Идентификатор02		= "";
		 Объект.КПС02				= "";
		 Объект.КодФАИП02			= "";
		 Объект.НомерБО02			= "";
		 Объект.СтавкаНДС02         = "";
		 
		 //Объект.Договор01			= "";  Договор01 должен быть всегда
		 //Объект.Наименование01	= "";
		 //Объект.Номер01			= "";
		 //Объект.Дата01			= "";
		 //Объект.Идентификатор01	= "";
		 //Объект.КПС01				= "";
		 //Объект.КодФАИП01			= "";
		 //Объект.НомерБО01			= "";
		 //Объект.СтавкаНДС01       = "";
		 Объект.ПредметКонтракта	= "";
		 
		 //В случае представления Заявления на отзыв Раздел 1 не заполняется.
		 //В случае представления Заявления на изменение и Заявления на отзыв Раздел 2 не заполняется.

	КонецЕсли;	 

	
	ВидОперацииПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КодВидаСредствПриИзменении(Элемент)
	
	Если Объект.КодВидаСредств = "01" Тогда
		 Объект.ВидСредств = "средства авансового платежа";
	ИначеЕсли Объект.КодВидаСредств = "03" Тогда
		 Объект.ВидСредств = "расчеты, связанные с предварительной оплатой";
	ИначеЕсли Объект.КодВидаСредств = "04" Тогда
		 Объект.ВидСредств = "расчеты, связанные с исполнением государственного контракта (договора)";
	 ИначеЕсли Объект.ВидСредств = "средства авансового платежа" 
		 ИЛИ Объект.ВидСредств = "расчеты, связанные с предварительной оплатой по контракту"
		 ИЛИ Объект.ВидСредств = "расчеты, связанные с исполнением контракта"
		 Тогда
	     Объект.ВидСредств = "";
	КонецЕсли;	 
		 
	УстановитьДоступностьЭлементов(ЭтотОбъект);  
	
КонецПроцедуры

&НаКлиенте
Процедура Строка01ПодробностиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РеквизитыДоговора = Новый Структура;
	РеквизитыДоговора.Вставить("Наименование", 	Объект.Наименование01);
	РеквизитыДоговора.Вставить("Номер",			Объект.Номер01);	
	РеквизитыДоговора.Вставить("Дата",			Объект.Дата01);	
	РеквизитыДоговора.Вставить("Идентификатор",	Объект.Идентификатор01);	
	РеквизитыДоговора.Вставить("КПС",			Объект.КПС01);
	РеквизитыДоговора.Вставить("КодФАИП", 		Объект.КодФАИП01);
	РеквизитыДоговора.Вставить("ОбъектФАИП", 	Объект.ОбъектФАИП);
	РеквизитыДоговора.Вставить("НомерБО", 		Объект.НомерБО01);
	РеквизитыДоговора.Вставить("СтавкаНДС", 	Объект.СтавкаНДС01);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", 		"1. Сведения о сопровождаемом документе (строка 01)"); 
	ПараметрыФормы.Вставить("КлючДанных", 			"Строка01");
	ПараметрыФормы.Вставить("РеквизитыДоговора", 	РеквизитыДоговора);
	ПараметрыФормы.Вставить("Договор", 				Объект.Договор01);
	ПараметрыФормы.Вставить("Организация", 			Объект.Организация);

	ОткрытьФорму("Документ.ЗаявлениеНаВыдачуКазначейскогоАккредитива.Форма.РедактированиеРеквизитовДоговора", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура Строка02ПодробностиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РеквизитыДоговора = Новый Структура;
	РеквизитыДоговора.Вставить("Наименование", 	Объект.Наименование02);
	РеквизитыДоговора.Вставить("Номер",			Объект.Номер02);	
	РеквизитыДоговора.Вставить("Дата",			Объект.Дата02);
	РеквизитыДоговора.Вставить("Идентификатор",	Объект.Идентификатор02);	
	РеквизитыДоговора.Вставить("КПС",			Объект.КПС02);
	РеквизитыДоговора.Вставить("КодФАИП", 		Объект.КодФАИП02);
	РеквизитыДоговора.Вставить("НомерБО", 		Объект.НомерБО02);
	РеквизитыДоговора.Вставить("СтавкаНДС", 	Объект.СтавкаНДС02);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", 		"1. Сведения о сопровождаемом документе (строка 02)"); 
	ПараметрыФормы.Вставить("КлючДанных", 			"Строка02");
	ПараметрыФормы.Вставить("РеквизитыДоговора", 	РеквизитыДоговора);

	ОткрытьФорму("Документ.ЗаявлениеНаВыдачуКазначейскогоАккредитива.Форма.РедактированиеРеквизитовДоговора", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПодробностиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;              
	
	ПлатежныеРеквизиты = Новый Структура;
	ПлатежныеРеквизиты.Вставить("БанковскийСчет", 	Объект.ПлательщикБанковскийСчет);
	ПлатежныеРеквизиты.Вставить("БИКБанка", 		Объект.ПлательщикБИКБанка);
	ПлатежныеРеквизиты.Вставить("ИНН", 				Объект.ПлательщикИНН);
	ПлатежныеРеквизиты.Вставить("КодРПБС", 			Объект.ПлательщикКодРПБС);
	ПлатежныеРеквизиты.Вставить("КПП", 				Объект.ПлательщикКПП);
	ПлатежныеРеквизиты.Вставить("ЛицевойСчет", 		Объект.ПлательщикНомерЛС);
	ПлатежныеРеквизиты.Вставить("Наименование", 	Объект.ПлательщикНаименование);
	ПлатежныеРеквизиты.Вставить("Бюджет", 	        Объект.ПлательщикБюджет); 
	ПлатежныеРеквизиты.Вставить("ОКПО", 	        Объект.ПлательщикОКПО);
    ПлатежныеРеквизиты.Вставить("АналитическийКод", Объект.ПлательщикАналитическийКод);
	ПлатежныеРеквизиты.Вставить("АналитическийКод1",Объект.ПлательщикАналитическийКод1);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", 		"2. Реквизиты плательщика"); 
	ПараметрыФормы.Вставить("КлючДанных", 			"Плательщик");
	ПараметрыФормы.Вставить("ПлатежныеРеквизиты", 	ПлатежныеРеквизиты); 

			
	ОткрытьФорму("ОбщаяФорма.РедактированиеПлатежныхРеквизитов", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПодробностиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПлатежныеРеквизиты = Новый Структура;
	ПлатежныеРеквизиты.Вставить("БанковскийСчет", 	Объект.ПолучательБанковскийСчет);
	ПлатежныеРеквизиты.Вставить("БИКБанка", 		Объект.ПолучательБИКБанка);
	ПлатежныеРеквизиты.Вставить("ИНН", 				Объект.ПолучательИНН);
	ПлатежныеРеквизиты.Вставить("КодРПБС", 			Объект.ПолучательКодРПБС);
	ПлатежныеРеквизиты.Вставить("КПП", 				Объект.ПолучательКПП);
	ПлатежныеРеквизиты.Вставить("ЛицевойСчет", 		Объект.ПолучательНомерЛС);
	ПлатежныеРеквизиты.Вставить("Наименование", 	Объект.ПолучательНаименование);
	ПлатежныеРеквизиты.Вставить("Бюджет",       	Объект.ПолучательБюджет); 
	ПлатежныеРеквизиты.Вставить("ОКПО",           	Объект.ПолучательОКПО);
	ПлатежныеРеквизиты.Вставить("АналитическийКод", Объект.ПолучательАналитическийКод);
	ПлатежныеРеквизиты.Вставить("АналитическийКод1",Объект.ПолучательАналитическийКод1);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокФормы", 	"3. Реквизиты получателя"); 
	ПараметрыФормы.Вставить("КлючДанных", "Получатель");
	ПараметрыФормы.Вставить("ПлатежныеРеквизиты", 	ПлатежныеРеквизиты); 

			
	ОткрытьФорму("ОбщаяФорма.РедактированиеПлатежныхРеквизитов", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ПолучательПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СчетКонтрагентаПриИзменении(Элемент)
	
	ПолучательПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Договор01ПриИзменении(Элемент)
	Договор01ПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Договор02ПриИзменении(Элемент)
	Договор02ПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановленныйСтатусДокументаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СтатусЭтогоДокументаНажатие(Элемент)
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидОперацииПриИзмененииСервер()
	
	ПолучитьРеквизитыПлательщика();
	ПолучательПриИзмененииНаСервере();
	
	УстановитьДоступностьЭлементов(ЭтотОбъект);
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма)
	
	ЭлементыФормы 	= Форма.Элементы;
	ОбъектФормы 	= Форма.Объект;
	
	ЭлементыФормы.ВидСредств.Доступность = НЕ (ОбъектФормы.КодВидаСредств = "01" ИЛИ ОбъектФормы.КодВидаСредств = "03" ИЛИ ОбъектФормы.КодВидаСредств = "04");
	
	ЭлементыФормы.Договор02.Доступность = ОбъектФормы.ВидОперации = "перевести";
	
	ЭлементыФормы.ПредметКонтракта.Доступность = НЕ ОбъектФормы.ВидОперации = "отозвать";

	ЭлементыФормы.Строка02Подробности.Доступность = ОбъектФормы.ВидОперации = "перевести";
	
	ЭлементыФормы.ПлательщикПодробности.Доступность = НЕ(ОбъектФормы.ВидОперации = "отозвать" ИЛИ ОбъектФормы.ВидОперации = "изменить");
	
	ЭлементыФормы.ПолучательПодробности.Доступность = НЕ(ОбъектФормы.ВидОперации = "отозвать" ИЛИ ОбъектФормы.ВидОперации = "изменить");
	
КонецПроцедуры	

&НаСервере
Процедура ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию()
	
	Умолчания = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(Объект.Организация, "Документ.ЗаявлениеНаВыдачуКазначейскогоАккредитива", Объект.Дата, Перечисления.ТипыЛицевыхСчетов.Казначейский);
	
	Объект.ЛицевойСчет 				= Умолчания.ЛицевойСчет;
	Объект.РеквизитыЛицевогоСчета 	= Умолчания.РеквизитыЛицевогоСчета;
	Объект.ОрганКазначейства		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "КассовыйОрган");
	
	ПолучитьРеквизитыПлательщика();
	
КонецПроцедуры	

&НаСервере
Процедура ПолучитьЛицевойСчетОрганКазначейства()
	
	Объект.ЛицевойСчет 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "Владелец");
	Объект.ОрганКазначейства		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "КассовыйОрган");
	
   	ПолучитьРеквизитыПлательщика();

КонецПроцедуры

&НаСервере
Процедура ПолучитьРеквизитыПлательщика()
	
	Объект.ПлательщикНаименование	  = "";
	Объект.ПлательщикИНН			  = "";
	Объект.ПлательщикКПП			  = "";
	Объект.ПлательщикКодРПБС		  = "";
	Объект.ПлательщикНомерЛС		  = "";
	Объект.ПлательщикБанковскийСчет	  = "";
	Объект.ПлательщикБИКБанка		  = "";
	Объект.ПлательщикБюджет           = ""; 
	Объект.ПлательщикОКПО             = "";
	Объект.ПлательщикАналитическийКод = "";
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ПерваяПодпись", "Руководитель");
	СтруктураРеквизитов.Вставить("ВтораяПодпись", "ГлавныйБухгалтер");
	СтруктураРеквизитов.Вставить("ПерваяПодписьПечататьДолжность", "РуководительПечататьДолжность");
	СтруктураРеквизитов.Вставить("ВтораяПодписьПечататьДолжность", "ГлавныйБухгалтерПечататьДолжность");
	
	СвойстваЛицевогоСчета = ПлатежноРасчетныеДокументыПовтИсп.ПолучитьСвойстваЛицевогоСчета(Объект.ЛицевойСчет, Объект.Дата, СтруктураРеквизитов); 

	ЗаполнитьЗначенияСвойств(Объект, СвойстваЛицевогоСчета);
	
	Если НЕ ЗначениеЗаполнено(Объект.ОтветственныйИсполнитель) Тогда
		Объект.ОтветственныйИсполнитель = ЗаполнениеРеквизитовОбъектов.ПолучитьОтветственногоИсполнителя(Объект.Ответственный, Объект.Организация, "Документ.ЗаявлениеНаВыдачуКазначейскогоАккредитива");
	КонецЕсли;	

	Если Объект.ВидОперации = "изменить" ИЛИ Объект.ВидОперации = "отозвать" ИЛИ НЕ ЗначениеЗаполнено(Объект.РеквизитыЛицевогоСчета) Тогда
		Возврат;
	КонецЕсли;	
	
	РеквизитыПлательщика = Новый Структура("ПлательщикИНН, ПлательщикКПП, ПлательщикНаименование, ПлательщикБанковскийСчет, ПлательщикБИКБанка", "ИНН", "КПП", "Корреспондент", "СчетНомер", "БИК");
	ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(Объект.ЛицевойСчет, Объект.РеквизитыЛицевогоСчета, РеквизитыПлательщика);

	ЗаполнитьЗначенияСвойств(Объект, РеквизитыПлательщика);
	
	Объект.ПлательщикНаименование	= СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация,        "НаименованиеПолное"));
	Объект.ПлательщикИНН			= СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация,        "ИНН"));
	Объект.ПлательщикКПП			= СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация,        "КПП"));
	
	Объект.ПлательщикКодРПБС        = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация,        "КодПоРПБС")); 	
	Объект.ПлательщикНомерЛС        = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ЛицевойСчет,        "Код")); 
	
	Объект.ПлательщикБюджет         = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация.Бюджет, "Наименование")); 
	
	Объект.ПлательщикОКПО           = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация,         "КодОКПО")); 
	
	ПлательщикПодробности           = СформироватьПодробностиПлательщика(Объект);
	
		
КонецПроцедуры	                                

&НаСервере
Процедура ПолучательПриИзмененииНаСервере()
	
	Объект.ПолучательНаименование	= "";
	Объект.ПолучательИНН			= "";
	Объект.ПолучательКПП			= "";
	Объект.ПолучательКодРПБС		= "";
	Объект.ПолучательНомерЛС		= "";
	Объект.ПолучательБанковскийСчет = "";
	Объект.ПолучательБИКБанка		= "";
	
	Если Объект.ВидОперации = "изменить"  ИЛИ Объект.ВидОперации = "отозвать" ИЛИ НЕ ЗначениеЗаполнено(Объект.СчетКонтрагента) Тогда
		ПолучательПодробности = СформироватьПодробностиПолучателя(Объект);
		Возврат;
	КонецЕсли;	
	
	РеквизитыПолучателя = Новый Структура("ПолучательИНН, ПолучательКПП, ПолучательНаименование, ПолучательБанковскийСчет, ПолучательБИКБанка", "ИНН", "КПП", "Корреспондент", "СчетНомер", "БИК");
	ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(Объект.СчетКонтрагента, Объект.СчетКонтрагента, РеквизитыПолучателя);
		
	СтруктураРеквизитов = Новый Структура("ТипЛицевогоСчета, Код"); 
    СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СчетКонтрагента, СтруктураРеквизитов);
	
	Если СтруктураРеквизитов.ТипЛицевогоСчета = ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Казначейский") Тогда
		РеквизитыПолучателя.Вставить("ПолучательНомерЛС", СтруктураРеквизитов.Код);
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.КодПоРПБС
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодРПБС,
	|   ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|		ИНАЧЕ Контрагенты.ЮридическоеФизическоеЛицо.Наименование
	|	КОНЕЦ КАК Наименование, 
	|   Контрагенты.ЮридическоеФизическоеЛицо.КодОКПО КАК КодОКПО,
	|   ВЫБОР
	|		КОГДА Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.Бюджет
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Бюджет
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		РеквизитыПолучателя.Вставить("ПолучательКодРПБС",      Выборка.КодРПБС);
		РеквизитыПолучателя.Вставить("ПолучательНаименование", Выборка.Наименование);
		РеквизитыПолучателя.Вставить("ПолучательБюджет",       Выборка.Бюджет); 
		РеквизитыПолучателя.Вставить("ПолучательОКПО",         Выборка.КодОКПО);
	КонецЕсли;	
    
	ЗаполнитьЗначенияСвойств(Объект, РеквизитыПолучателя);
	
	Объект.ПолучательИНН			= СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ИНН"));
	Объект.ПолучательКПП			= СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "КПП"));
	
	ПолучательПодробности = СформироватьПодробностиПолучателя(Объект);
 	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПодробностиПлательщика(Объект)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("Наименование: "      + ?(ЗначениеЗаполнено(Объект.ПлательщикНаименование),     Объект.ПлательщикНаименование,     "<не указано>"));
	МассивСтрок.Добавить("ИНН: "               + ?(ЗначениеЗаполнено(Объект.ПлательщикИНН),              Объект.ПлательщикИНН,              "<не указан>"));
	МассивСтрок.Добавить("КПП: "               + ?(ЗначениеЗаполнено(Объект.ПлательщикКПП),              Объект.ПлательщикКПП,              "<не указан>"));
	МассивСтрок.Добавить("Код по РПБС: "       + ?(ЗначениеЗаполнено(Объект.ПлательщикКодРПБС),          Объект.ПлательщикКодРПБС,          "<не указан>"));
	МассивСтрок.Добавить("Л/С: "               + ?(ЗначениеЗаполнено(Объект.ПлательщикНомерЛС),          Объект.ПлательщикНомерЛС,          "<не указан>"));
	МассивСтрок.Добавить("Номер счета: "       + ?(ЗначениеЗаполнено(Объект.ПлательщикБанковскийСчет),   Объект.ПлательщикБанковскийСчет,   "<не указан>"));
	МассивСтрок.Добавить("БИК: "               + ?(ЗначениеЗаполнено(Объект.ПлательщикБИКБанка),         Объект.ПлательщикБИКБанка,         "<не указан>"));   
	МассивСтрок.Добавить("Бюджет: "            + ?(ЗначениеЗаполнено(Объект.ПлательщикБюджет),           Объект.ПлательщикБюджет,           "<не указан>")); 
	МассивСтрок.Добавить("ОКПО: "              + ?(ЗначениеЗаполнено(Объект.ПлательщикОКПО),             Объект.ПлательщикОКПО,             "<не указан>")); 
	МассивСтрок.Добавить("Аналитический код: " + ?(ЗначениеЗаполнено(Объект.ПлательщикАналитическийКод), Объект.ПлательщикАналитическийКод, "<не указан>")); 
	
	Возврат СокрЛП(СтрСоединить(МассивСтрок, "; "));  
	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПодробностиПолучателя(Объект)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("Наименование: "      + ?(ЗначениеЗаполнено(Объект.ПолучательНаименование),     Объект.ПолучательНаименование,     "<не указано>"));
	МассивСтрок.Добавить("ИНН: "               + ?(ЗначениеЗаполнено(Объект.ПолучательИНН),              Объект.ПолучательИНН,              "<не указан>"));
	МассивСтрок.Добавить("КПП: "               + ?(ЗначениеЗаполнено(Объект.ПолучательКПП),              Объект.ПолучательКПП,              "<не указан>"));
	МассивСтрок.Добавить("Код по РПБС: "       + ?(ЗначениеЗаполнено(Объект.ПолучательКодРПБС),          Объект.ПолучательКодРПБС,          "<не указан>"));
	МассивСтрок.Добавить("Л/С: "               + ?(ЗначениеЗаполнено(Объект.ПолучательНомерЛС),          Объект.ПолучательНомерЛС,          "<не указан>"));
	МассивСтрок.Добавить("Номер счета: "       + ?(ЗначениеЗаполнено(Объект.ПолучательБанковскийСчет),   Объект.ПолучательБанковскийСчет,   "<не указан>"));
	МассивСтрок.Добавить("БИК: "               + ?(ЗначениеЗаполнено(Объект.ПолучательБИКБанка),         Объект.ПолучательБИКБанка,         "<не указан>"));  
	МассивСтрок.Добавить("Бюджет: "            + ?(ЗначениеЗаполнено(Объект.ПолучательБюджет),           Объект.ПолучательБюджет,           "<не указан>")); 
	МассивСтрок.Добавить("ОКПО: "              + ?(ЗначениеЗаполнено(Объект.ПолучательОКПО),             Объект.ПолучательОКПО,             "<не указан>"));
	МассивСтрок.Добавить("Аналитический код: " + ?(ЗначениеЗаполнено(Объект.ПолучательАналитическийКод), Объект.ПолучательАналитическийКод, "<не указан>")); 

	
	Возврат СокрЛП(СтрСоединить(МассивСтрок, "; "));  
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПодробностиДоговора01(Объект)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("Наименование: " + ?(ЗначениеЗаполнено(Объект.Наименование01),  Объект.Наименование01,  "<не указано>"));
	МассивСтрок.Добавить("№: "            + ?(ЗначениеЗаполнено(Объект.Номер01),         Объект.Номер01,         "<не указан>"));
	МассивСтрок.Добавить("от: "           + ?(ЗначениеЗаполнено(Объект.Дата01),          Объект.Дата01,          "<не указано>"));
	МассивСтрок.Добавить("Идент.: "       + ?(ЗначениеЗаполнено(Объект.Идентификатор01), Объект.Идентификатор01, "<не указан>"));
	МассивСтрок.Добавить("КПС: "          + ?(ЗначениеЗаполнено(Объект.КПС01),           Объект.КПС01,           "<не указан>"));
	МассивСтрок.Добавить("ФАИП: "         + ?(ЗначениеЗаполнено(Объект.КодФАИП01),       Объект.КодФАИП01,       "<не указан>"));
	МассивСтрок.Добавить("БО №: "         + ?(ЗначениеЗаполнено(Объект.НомерБО01),       Объект.НомерБО01,       "<не указан>"));  
	МассивСтрок.Добавить("НДС: "          + ?(ЗначениеЗаполнено(Объект.СтавкаНДС01),     Объект.СтавкаНДС01,     "<не указан>"));
	
	Возврат СокрЛП(СтрСоединить(МассивСтрок, "; "));  
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПодробностиДоговора02(Объект)
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить("Наименование: " + ?(ЗначениеЗаполнено(Объект.Наименование02),  Объект.Наименование02,  "<не указано>"));
	МассивСтрок.Добавить("№: "            + ?(ЗначениеЗаполнено(Объект.Номер02),         Объект.Номер02,         "<не указан>"));
	МассивСтрок.Добавить("от: "           + ?(ЗначениеЗаполнено(Объект.Дата02),          Объект.Дата02,          "<не указано>"));
	МассивСтрок.Добавить("Идент.: "       + ?(ЗначениеЗаполнено(Объект.Идентификатор02), Объект.Идентификатор02, "<не указан>"));
	МассивСтрок.Добавить("КПС: "          + ?(ЗначениеЗаполнено(Объект.КПС02),           Объект.КПС02,           "<не указан>"));
	МассивСтрок.Добавить("ФАИП: "         + ?(ЗначениеЗаполнено(Объект.КодФАИП02),       Объект.КодФАИП02,       "<не указан>"));
	МассивСтрок.Добавить("БО №: "         + ?(ЗначениеЗаполнено(Объект.НомерБО02),       Объект.НомерБО02,       "<не указан>"));
	МассивСтрок.Добавить("НДС: "          + ?(ЗначениеЗаполнено(Объект.СтавкаНДС02),     Объект.СтавкаНДС02,     "<не указан>"));
	
	Возврат СокрЛП(СтрСоединить(МассивСтрок, "; "));  
	
КонецФункции

&НаСервере
Процедура Договор01ПриИзмененииНаСервере()
	
	Объект.Наименование01 	= "";
	Объект.Номер01 			= "";
	Объект.Дата01 			= "";
	Объект.Идентификатор01 	= "";
	Объект.КПС01 			= "";
	Объект.КодФАИП01 		= "";
	Объект.НомерБО01 		= "";
	Объект.СтавкаНДС01 		= "";
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Данные.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ДействующийДокумент
	|ИЗ
	|	РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(, Обязательство = &Договор) КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА Бюджет.ОбъектФАИП ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА Бюджет.ОбъектФАИП.КодФАИП
	|          КОГДА Бюджет.ОбъектФАИП ССЫЛКА Справочник.МероприятияПоИнформатизации
	|			ТОГДА Бюджет.ОбъектФАИП.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодФАИП01,
	|	Бюджет.ОбъектФАИП КАК ОбъектФАИП,
	|	Бюджет.КПС КАК КПС01,
	|	Бюджет.Ссылка.Договор КАК Договор
	|ПОМЕСТИТЬ Бюджет
	|ИЗ
	|	Документ.РегистрацияОбязательствИСведенийПоДоговорам.РасшифровкаОбязательстваБюджет КАК Бюджет
	|ГДЕ
	|	Бюджет.Ссылка В
	|			(ВЫБРАТЬ
	|				ДействующийДокумент.Регистратор
	|			ИЗ
	|				ДействующийДокумент КАК ДействующийДокумент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Договор01.ВидОбязательства КАК Наименование01,
	|	Договор01.НомерДоговора КАК Номер01,
	|	Договор01.ДатаДоговора КАК Дата01,
	|	Договор01.КраткоеСодержание КАК ПредметКонтракта,
	|	УчетныеНомераОбязательств.УчетныйНомерОбязательства КАК НомерБО01,
	|	ЕСТЬNULL(ХарактеристикиОбязательств.ЗначениеХарактеристики, """") КАК Идентификатор01,
	|	ЕСТЬNULL(Бюджет.КодФАИП01, """") КАК КодФАИП01,
	|	ЕСТЬNULL(Бюджет.ОбъектФАИП, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)) КАК ОбъектФАИП,
	|	ЕСТЬNULL(Бюджет.КПС01, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС01,
	|	Договор01.Контрагент КАК Контрагент,
	|	Договор01.СчетКонтрагента КАК СчетКонтрагента
	|ИЗ
	|	Справочник.Договоры КАК Договор01
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетныеНомераОбязательств КАК УчетныеНомераОбязательств
	|		ПО Договор01.Ссылка = УчетныеНомераОбязательств.Обязательство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбязательств.СрезПоследних КАК ХарактеристикиОбязательств
	|		ПО Договор01.Ссылка = ХарактеристикиОбязательств.Договор
	|			И (ХарактеристикиОбязательств.ВидХарактеристики = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыХарактеристикОбязательства.ИдентификаторКонтракта))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Бюджет КАК Бюджет
	|		ПО Договор01.Ссылка = Бюджет.Договор
	|ГДЕ
	|	Договор01.Ссылка = &Договор");
	 
	 Запрос.УстановитьПараметр("Договор", Объект.Договор01);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Если Выборка.Следующий() Тогда
		 Если ЗначениеЗаполнено(Объект.Договор02) Тогда
			 Исключить = "Контрагент, СчетКонтрагента";
		 Иначе
			 Исключить = "";
		 КонецЕсли;		 
		 ЗаполнитьЗначенияСвойств(Объект, Выборка,, Исключить);
		 Если Исключить = "" Тогда
			 ПолучательПриИзмененииНаСервере();
		 КонецЕсли;	 
	 КонецЕсли;	 
	 
	 Строка01Подробности = СформироватьПодробностиДоговора01(Объект);
	
КонецПроцедуры

&НаСервере
Процедура Договор02ПриИзмененииНаСервере()
	
	Объект.Наименование02 	= "";
	Объект.Номер02 			= "";
	Объект.Дата02			= "";
	Объект.Идентификатор02 	= "";
	Объект.КПС02 			= "";
	Объект.КодФАИП02 		= "";
	Объект.НомерБО02 		= "";
	Объект.СтавкаНДС02 		= "";
		
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Договор02.ВидОбязательства КАК Наименование02,
	|	Договор02.НомерДоговора КАК Номер02,
	|	Договор02.ДатаДоговора КАК Дата02,
	|	Договор02.КраткоеСодержание КАК ПредметКонтракта,
	|	Договор02.Контрагент КАК Контрагент,
	|	Договор02.СчетКонтрагента КАК СчетКонтрагента
	|ИЗ
	|	Справочник.Договоры КАК Договор02
	|ГДЕ
	|	Договор02.Ссылка = &Договор");
	 
	 Запрос.УстановитьПараметр("Договор", Объект.Договор02);
	 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Если Выборка.Следующий() Тогда
		 Если ЗначениеЗаполнено(Объект.ПредметКонтракта) Тогда
			 Исключить = "ПредметКонтракта";
		 Иначе
			 Исключить = "";
		 КонецЕсли;		 
		 
		 ЗаполнитьЗначенияСвойств(Объект, Выборка,, Исключить);
		 
		 ПолучательПриИзмененииНаСервере();
		 
	 КонецЕсли;	 
	 
	 Строка02Подробности = СформироватьПодробностиДоговора02(Объект);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусДокумента()
	
	ПлатежноРасчетныеДокументыКлиент.ОткрытьФормуИзмененияСтатусаДокумента(ЭтотОбъект);
	
КонецПроцедуры	

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
