#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|	ПО ЭтотСписок.Контрагент.ЮридическоеФизическоеЛицо = Пользователи.ФизическоеЛицо
	|
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Пользователи.Ссылка, NULL КАК ИСТИНА)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

Процедура СформироватьОписаниеДокументовСКонтрагентомВШапке(Описание, ДокументСсылка, ДокументОбъект, Форма) Экспорт
	
	ПроверкаКонтрагентов.ДополнитьОписание(
	Описание, 
	ДокументСсылка, 
	Форма.Элементы.Контрагент,
	ДокументОбъект.Контрагент,
	Форма.Элементы.ГруппаКонтрагент);
	
КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции   

// Возвращает массив структур, содержащих значения реквизитов документа для выгрузки
//
// Параметры:
// МассивОбъектов               - Массив объектов данного вида
// ИспользоватьДопКл            - Признак применения доп. классификации и указании ее значений в структурах реквизитов документов
// ИспользоватьКодМероприятия   - Признак применения кодов мероприятий
// ИспользоватьКЭК              - Признак использования КЭК
// ИспользоватьАналитическийКод - Признак использования аналитического кода
// ИспользоватьКФО              - Признак применения КФО и указания значений КФО в структурах реквизитов документа
// ИспользоватьКОСГУПолучателя  - Признак использования КОСГУПолучателя
Функция ЗначенияРеквизитовДокумента(МассивОбъектов, ИспользоватьДопКл = Ложь, ИспользоватьКодМероприятия = Ложь, ИспользоватьКЭК = Ложь, ИспользоватьАналитическийКод = Ложь, ИспользоватьКФО = Ложь, ИспользоватьКОСГУПолучателя = Ложь) Экспорт  
	
	Возврат ПлатежноРасчетныеДокументы.ЗначенияРеквизитовПлатежноеПоручение(МассивОбъектов, ИспользоватьДопКл, ИспользоватьКодМероприятия, ИспользоватьКЭК, ИспользоватьАналитическийКод, ИспользоватьКФО, ИспользоватьКОСГУПолучателя);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает сведения о записи в регистре сведенеий "СостояниеПлатежноРасчетныхДокументов"
//    Входящие параметры: Ссылка - тип ссылка на документ "Уведомление об уточнении операции клиента"
//    Исходящие параметры: 
Функция ПолучитьСостояниеДокумента(Ссылка) Экспорт
	СтруктураРеквизитов = Новый Структура;
	ПоляВыборки = "";
	//  Струкутра реквизитов динамическая, т.к. со временем может понадобится новый ресурс в регистр
	//  что-бы его не забыть будем каждый раз перебирать ресурсы регистра
	Для каждого Ресурс из Метаданные.РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.Ресурсы цикл
		СтруктураРеквизитов.Вставить(Ресурс.Имя);
		ПоляВыборки = ПоляВыборки + "
		|	Состояние." + Ресурс.Имя + " КАК " + Ресурс.Имя + ", "
	КонецЦикла;	
	//  Добавка ввиде реквизита "ПервичныйОбразИРеквизиты"
	СтруктураРеквизитов.Вставить("ПервичныйОбразИРеквизиты");		
	ПоляВыборки = ПоляВыборки + "
	|	Состояние.ПервичныйОбразИРеквизиты КАК ПервичныйОбразИРеквизиты ";
	
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.ПлатежноеПоручение") тогда
		Возврат СтруктураРеквизитов;
	КонецЕсли;	
		
	ТекстЗапроса = "ВЫБРАТЬ " + ПоляВыборки + "
					|ИЗ	
					|	РегистрСведений.СостояниеПлатежноРасчетныхДокументов КАК Состояние
					|ГДЕ 
					|	Состояние.ПлатежноРасчетныйДокумент = &Ссылка";
						
	Запрос = Новый Запрос(ТекстЗапроса);				
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
		
	Для каждого КлючЗначение из СтруктураРеквизитов Цикл
		ТекРеквизит = КлючЗначение.Ключ;
		СтруктураРеквизитов[ТекРеквизит] = Выборка[ТекРеквизит];
	КонецЦикла;	
		
	Возврат СтруктураРеквизитов;
КонецФункции	

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПлатежноеПоручение";
	КомандаПечати.Идентификатор		= "ПлатежноеПоручение";
	КомандаПечати.Представление		= НСтр("ru = 'Платежное поручение'");
	КомандаПечати.Порядок			= 1;
	
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "РасчетныйДокументБезККТ", 5);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// Устанавливаем признак доступности печати покомплектно.
	//ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

	// Проверяем, нужно ли для макета ЗаявкаНаКассовыйРасход0531801 формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПлатежноеПоручение") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПлатежноеПоручение",
			"Платежное поручение",
			Печать0401060(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

КонецПроцедуры

// Функция формирует табличный документ Платежное поручение (ф 0401060)
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ.
//
Функция Печать0401060(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент 					= Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПлатежноеПоручение_ПлатежноеПоручение";
	
	ДанныеДляПечатиМассив = ПлатежноРасчетныеДокументы.ЗначенияРеквизитовПлатежноеПоручение(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеДляПечати Из ДанныеДляПечатиМассив Цикл
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ПлатежноеПоручение");
		Обл   = Макет.ПолучитьОбласть("ЗаголовокТаблицы");

		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		Обл.Параметры.Заполнить(ДанныеДляПечати);
						
		// Если УИН не заполнен и в поле 22 выводится "0", то выведем его шрифтом с размером "9",
		// если же УИН заполнен, то поле 22 выводится шрифтом размером "6"
		Если ДанныеДляПечати.ИдентификаторПлатежа = "0" Тогда
			ПолеКод = Обл.Область("ИдентификаторПлатежа");
			ПолеКод.Шрифт = Новый Шрифт(ПолеКод.Шрифт,, 9);
		КонецЕсли;

		ТабДокумент.Вывести(Обл);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДляПечати.Ссылка);
		
	КонецЦикла;	
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	// В документах по кор.счетам 205.00,209.00,206.00,302.00 с заполненным ДопСубконтоРасчетов
	// заполним новый реквизит СчетРасчетов.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПлатежноеПоручениеРасшифровкаПлатежа.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПлатежноеПоручение.РасшифровкаПлатежа КАК ПлатежноеПоручениеРасшифровкаПлатежа
	|ГДЕ
	|	ПлатежноеПоручениеРасшифровкаПлатежа.Ссылка.КорСчет В(&КорСчет)
	|	И ПлатежноеПоручениеРасшифровкаПлатежа.СчетРасчетов = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|	И ПлатежноеПоручениеРасшифровкаПлатежа.ДопСубконтоРасчетов <> НЕОПРЕДЕЛЕНО";
	Запрос.УстановитьПараметр("КорСчет", БухгалтерскийУчет.СписокСчетов("205.00,209.00,206.00,302.00", , Истина));
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Документ.ПлатежноеПоручение";
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		Элемент = Блокировка.Добавить(ПолноеИмяОбъекта);
		Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		Элемент.Режим = РежимБлокировкиДанных.Исключительный;
		
		Попытка
			Блокировка.Заблокировать();
		Исключение
			// Объект не удается заблокировать - попробуем обработать его на следующей итерации.
			// Отдельно обрабатывать ошибку не требуется, т.к. в худшем случае обработчик зациклится
			// и прервется автоматически.
			ЗафиксироватьТранзакцию();
			Продолжить;
		КонецПопытки;
		
		Если Не ОбщегоНазначения.СсылкаСуществует(Выборка.Ссылка) Тогда
			// Вероятно был удален раньше, чем обработчик дошел до него
			ЗафиксироватьТранзакцию();
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		
		// Проводки документа Дт Расчеты Кт Деньги по балансовым счетам.
		ПроводкиДокумента = БухгалтерскийУчет.ПроводкиДокументов(Выборка.Ссылка, Объект.КорСчет, "Дт", "201.00,304.05").Выгрузить();
		
		Для Каждого СтрокаТаблицы Из Объект.РасшифровкаПлатежа Цикл
			
			Отбор = Новый Структура("ХарактеристикаДвиженияКт", СтрокаТаблицы.КОСГУНазначениеПлатежа);
			ПроводкиСДаннымКЭК = ПроводкиДокумента.НайтиСтроки(Отбор);
			
			Если ПроводкиСДаннымКЭК.Количество() > 0 Тогда
				// Заполняем СчетРасчетов из проводок.
				СтрокаТаблицы.СчетРасчетов = ПроводкиСДаннымКЭК[0].СчетДт;
			Иначе
				// Заполняем СчетРасчетов по КОСГУ, как при проведении документа.
				НаДату = УчетРасчетов.ПериодПолученияОстатков(Объект, "Дата");
				СтрокаТаблицы.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					СтрокаТаблицы.КОСГУНазначениеПлатежа, Объект.КорСчет,, НаДату, Объект.Организация, Объект.ИФО);
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не Объект.Модифицированность() Тогда
			
			ЗафиксироватьТранзакцию();
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			Продолжить;
			
		КонецЕсли;
		
		
		Попытка
		
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать документ: %Документ% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Документы.НакладнаяНаОтпускИК,
				Выборка.Ссылка,
				ТекстСообщения);
			ВызватьИсключение;
		
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
