#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = ОбщегоНазначенияБГУ.ТекущаяОрганизация();
	
	//заполним по умолчанию
	
	СписокДоступныхЗаписей = РаботаСПочтовымиСообщениями.ДоступныеУчетныеЗаписи(Истина);
	
	УчетнаяЗапись = УправлениеЭлектроннойПочтой.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию();
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись)
		И СписокДоступныхЗаписей.Количество() Тогда
		УчетнаяЗапись = СписокДоступныхЗаписей[0].Ссылка;
	КонецЕсли;
	
	//при обновлении релиза на 2.0.71 создается пример шаблона, его и заполним как начальное значение 
	МетаданныеДокумента = Метаданные.Документы.КвитанцияНаОплатуГосуслуг;
	Назначение = МетаданныеДокумента.Представление();
	Наименование = "Для рассылки квитанций (ПД-4 с QR-кодом)";
	Тема = "Рассылка квитанций";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ШаблоныСообщений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	ШаблоныСообщений.Наименование = &Наименование
		|	И ШаблоныСообщений.ТемаПисьма = &ТемаПисьма
		|	И ШаблоныСообщений.Назначение = &Назначение";
	
	Запрос.УстановитьПараметр("Назначение", Назначение);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("ТемаПисьма", Тема);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ШаблонПисьма = Выборка.Ссылка;
	КонецЕсли;
	
	СоздатьСписокСтатусов();
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПочтовыйКлиент") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Внимание! Для формирования и отправки писем необходимо в настройках программы включить использование почтового клиента.'"));
	КонецЕсли;
		
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ПредназначенДляЭлектронныхПисем",Истина));
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ПолноеИмяТипаПараметраВводаНаОсновании", "Документ.КвитанцияНаОплатуГосуслуг"));	
			
	Элементы.ШаблонПисьма.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура ОтборВидПриИзменении(Элемент)
	ИспользоватьОтборВид = ЗначениеЗаполнено(ОтборВид);
КонецПроцедуры

&НаКлиенте
Процедура ОтборНоменклатураПриИзменении(Элемент)
	ИспользоватьОтборНоменклатура = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтборКоличествоПисемПриИзменении(Элемент)
	ИспользоватьОтборКоличествоПисем = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПлательщикПриИзменении(Элемент)
	ИспользоватьОтборПлательщик = Истина;
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборСтатус

&НаКлиенте
Процедура ОтборСтатусПометкаПриИзменении(Элемент)
	СписокОтмеченных  = ПолучитьОтмеченныеЭлементы(ОтборСтатус);
	ИспользоватьОтборСтатус = СписокОтмеченных.Количество() > 0;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаКвитанций

&НаКлиенте
Процедура ТаблицаКвитанцийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ТаблицаКвитанций.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ТаблицаКвитанций.ТекущийЭлемент.Имя = "ТаблицаКвитанцийРезультат" Тогда 
			
		Если Не ЗначениеЗаполнено(ТекДанные.ТекстОшибки) Тогда 
			Возврат;
		КонецЕсли;	
		
		ПоказатьПредупреждение(,ТекДанные.ТекстОшибки);
		
	ИначеЕсли Элементы.ТаблицаКвитанций.ТекущийЭлемент.Имя = "ТаблицаКвитанцийКоличествоПисем" Тогда
		
		ОткрытьФормуВзаимодействий(ТекДанные.Квитанция);
		
	ИначеЕсли Элементы.ТаблицаКвитанций.ТекущийЭлемент.Имя = "ТаблицаКвитанцийПисьмо"
		И ЗначениеЗаполнено(ТекДанные.Письмо) Тогда
		
		ПоказатьЗначение(,ТекДанные.Письмо);
		
	ИначеЕсли (Элементы.ТаблицаКвитанций.ТекущийЭлемент.Имя = "ТаблицаКвитанцийПлательщик"
			ИЛИ Элементы.ТаблицаКвитанций.ТекущийЭлемент.Имя = "ТаблицаКвитанцийАдресЭП")
		И ЗначениеЗаполнено(ТекДанные.Плательщик) Тогда
		// откроем для указания почты
		ПоказатьЗначение(,ТекДанные.Плательщик);
		
	Иначе
		
		ПоказатьЗначение(,ТекДанные.Квитанция);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКвитанцийФормироватьПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаКвитанций.ТекущиеДанные;
	
	Для Каждого СтрТаб Из Элементы.ТаблицаКвитанций.ВыделенныеСтроки Цикл
		СтрТЧ  = ТаблицаКвитанций.НайтиПоИдентификатору(СтрТаб);
		СтрТЧ.Формировать = ТекДанные.Формировать;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьКвитанции(Команда)
	ЗаполнитьКвитанцииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Команда)
	Для Каждого СтрТЧ Из ТаблицаКвитанций Цикл
		СтрТЧ.Формировать = ЗначениеЗаполнено(СтрТЧ.АдресЭП);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	Для Каждого СтрТЧ Из ТаблицаКвитанций Цикл
		СтрТЧ.Формировать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПисьма(Команда)
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ШаблонПисьма) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Не выбран шаблон письма.'"),,"ШаблонПисьма","ШаблонПисьма");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Не выбрана учетная запись почты для отправки писем.'"),,"УчетнаяЗапись","УчетнаяЗапись");
		Отказ = Истина;
	КонецЕсли;
		
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьПисьмаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПисьмаПоДокументу(Команда)
	
	ТекДанные = Элементы.ТаблицаКвитанций.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	ОткрытьФормуВзаимодействий(ТекДанные.Квитанция);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ОткрытьФормуВзаимодействий(ТекКвитанция)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Предмет", ТекКвитанция);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТипВзаимодействия", "Предмет");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	ПараметрыФормы.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);

	ОткрытьФорму(
		"ЖурналДокументов.Взаимодействия.Форма.ФормаСпискаПараметрическая",
		ПараметрыФормы,
		ЭтотОбъект);
		
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКвитанцииНаСервере()
	
	ТаблицаКвитанций.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КвитанцияНаОплатуГосуслуг.Ссылка КАК Квитанция,
		|	КвитанцияНаОплатуГосуслуг.Номер КАК Номер,
		|	КвитанцияНаОплатуГосуслуг.Дата КАК Дата,
		|	КвитанцияНаОплатуГосуслуг.Номенклатура КАК Номенклатура,
		|	КвитанцияНаОплатуГосуслуг.Плательщик КАК Плательщик,
		|	ВЫБОР
		|		КОГДА КвитанцияНаОплатуГосуслуг.ВидКвитанции <= 1
		|			ТОГДА ""Новая""
		|		КОГДА КвитанцияНаОплатуГосуслуг.ВидКвитанции = 2
		|			ТОГДА ""Изменение""
		|		КОГДА КвитанцияНаОплатуГосуслуг.ВидКвитанции = 3
		|			ТОГДА ""Аннулирование""
		|		КОГДА КвитанцияНаОплатуГосуслуг.ВидКвитанции = 4
		|			ТОГДА ""Деаннулирование""
		|	КОНЕЦ КАК ВидКвитанции,
		|	КвитанцияНаОплатуГосуслуг.СуммаДокумента КАК Сумма,
		|	ЕСТЬNULL(СостояниеПлатежноРасчетныхДокументов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИсполненияДокумента.ВРаботе)) КАК СтатусДокумента
		|ПОМЕСТИТЬ ТабКвитанций
		|ИЗ
		|	Документ.КвитанцияНаОплатуГосуслуг КАК КвитанцияНаОплатуГосуслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеПлатежноРасчетныхДокументов КАК СостояниеПлатежноРасчетныхДокументов
		|		ПО (СостояниеПлатежноРасчетныхДокументов.ПлатежноРасчетныйДокумент = КвитанцияНаОплатуГосуслуг.Ссылка)
		|ГДЕ
		|	КвитанцияНаОплатуГосуслуг.Организация = &Организация
		|	И &УсловиеКвитанцийНачало
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Плательщик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПредметыПапкиВзаимодействий.Предмет КАК КвитанцияНаОплату,
		|	КОЛИЧЕСТВО(ПредметыПапкиВзаимодействий.Взаимодействие) КАК КоличествоПисем
		|ПОМЕСТИТЬ ДанныеОПисьмах
		|ИЗ
		|	РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
		|ГДЕ
		|	ПредметыПапкиВзаимодействий.Предмет В
		|			(ВЫБРАТЬ
		|				ТабКвитанций.Квитанция
		|			ИЗ
		|				ТабКвитанций КАК ТабКвитанций)
		|	И ПредметыПапкиВзаимодействий.Взаимодействие ССЫЛКА Документ.ЭлектронноеПисьмоИсходящее
		|
		|СГРУППИРОВАТЬ ПО
		|	ПредметыПапкиВзаимодействий.Предмет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабКвитанций.Квитанция КАК Квитанция,
		|	ТабКвитанций.Номер КАК Номер,
		|	ТабКвитанций.Дата КАК Дата,
		|	ТабКвитанций.Номенклатура КАК Номенклатура,
		|	ТабКвитанций.Плательщик КАК Плательщик,
		|	ТабКвитанций.Сумма КАК Сумма,
		|	ТабКвитанций.СтатусДокумента КАК СтатусДокумента,
		|	ЕСТЬNULL(ДанныеОПисьмах.КоличествоПисем, 0) КАК КоличествоПисем,
		|	ТабКвитанций.ВидКвитанции КАК ВидКвитанции
		|ИЗ
		|	ТабКвитанций КАК ТабКвитанций
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОПисьмах КАК ДанныеОПисьмах
		|		ПО ТабКвитанций.Квитанция = ДанныеОПисьмах.КвитанцияНаОплату
		|ГДЕ
		|	&УсловиеКвитанцийКонец";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ТекстУсловияНачало = "";
	ТекстУсловияКонец = "";
	Если ЗначениеЗаполнено(Период.ДатаНачала)
		ИЛИ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		
		ТекстУсловияНачало = " И КвитанцияНаОплатуГосуслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания ";
		
		Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(Период.ДатаОкончания),КонецДня(Период.ДатаОкончания),Дата("29990101")));
	КонецЕсли;
	
	Если ИспользоватьОтборНоменклатура Тогда
		Запрос.УстановитьПараметр("Номенклатура", ОтборНоменклатура);
		
		ТекстУсловияНачало = ТекстУсловияНачало + " И КвитанцияНаОплатуГосуслуг.Номенклатура = &Номенклатура ";
	КонецЕсли;
	
	Если ИспользоватьОтборПлательщик Тогда
		Запрос.УстановитьПараметр("Плательщик", ОтборПлательщик);
		
		ТекстУсловияНачало = ТекстУсловияНачало + " И КвитанцияНаОплатуГосуслуг.Плательщик = &Плательщик ";
	КонецЕсли;
	
	Если ИспользоватьОтборСтатус Тогда
		
		МассивСтатусов = Новый Массив;
		Для Каждого СтрСТ Из ОтборСтатус Цикл
			Если СтрСТ.Пометка Тогда
				МассивСтатусов.Добавить(СтрСТ.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Статусы", МассивСтатусов);
		
		ТекстУсловияНачало = ТекстУсловияНачало + " И ЕСТЬNULL(СостояниеПлатежноРасчетныхДокументов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИсполненияДокумента.ВРаботе)) В (&Статусы) ";
	КонецЕсли;
	
	//конечные условия
	Если ИспользоватьОтборВид Тогда
		
		Запрос.УстановитьПараметр("ВидКвитанции", ОтборВид);
		
		ТекстУсловияКонец = ТекстУсловияКонец + " И ТабКвитанций.ВидКвитанции = &ВидКвитанции ";
	КонецЕсли;
	
	Если ИспользоватьОтборКоличествоПисем Тогда
		
		Запрос.УстановитьПараметр("КоличествоПисем", ОтборКоличествоПисем);
		
		ТекстУсловияКонец = ТекстУсловияКонец + " И ЕСТЬNULL(ДанныеОПисьмах.КоличествоПисем, 0) = &КоличествоПисем ";
	КонецЕсли;
	
	ТекстУсловияНачало = Сред(ТекстУсловияНачало,3);
	Если Не ЗначениеЗаполнено( ТекстУсловияНачало) Тогда
		ТекстУсловияНачало = " ИСТИНА ";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеКвитанцийНачало",ТекстУсловияНачало);
	
	ТекстУсловияКонец = Сред(ТекстУсловияКонец,3);
	Если Не ЗначениеЗаполнено( ТекстУсловияКонец) Тогда
		ТекстУсловияКонец = " ИСТИНА ";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеКвитанцийКонец",ТекстУсловияКонец);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыгрузкаЗапроса = РезультатыЗапроса[2].Выгрузить();
	ТаблицаКвитанций.Загрузить(ВыгрузкаЗапроса);
	
	ВыгрузкаЗапроса.Свернуть("Плательщик");
	ОбъектыКИ = ВыгрузкаЗапроса.ВыгрузитьКолонку("Плательщик");
	
	ВидыКИ = Новый Массив;
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.EmailКонтрагенты);
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.EmailФизическиеЛица);
	
	ТаблицаАдресов = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(ОбъектыКИ,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,ВидыКИ);
	ТаблицаАдресов.Индексы.Добавить("Объект");
	
	СоответствиеАдрестовКонтрагентов = Новый Соответствие;
	Для Каждого СтрТЧ Из ТаблицаКвитанций Цикл
		СтрТЧ.Результат = -1;//без статуса
		ТекАдрес = СоответствиеАдрестовКонтрагентов[СтрТЧ.Плательщик];
		
		Если ТекАдрес = Неопределено Тогда
			СтруктураПоиска = Новый Структура("Объект",СтрТЧ.Плательщик);
			
			СтрокиАдреса = ТаблицаАдресов.НайтиСтроки(СтруктураПоиска);
			Если СтрокиАдреса.Количество()>0 Тогда
				ТекАдрес = СтрокиАдреса[0].Представление;				
			КонецЕсли;
			
			СоответствиеАдрестовКонтрагентов.Вставить(СтрТЧ.Плательщик, ТекАдрес);
		КонецЕсли;
		
		СтрТЧ.АдресЭП = ТекАдрес;
		
	КонецЦикла;
			
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоПисемДляДокумента(ТекДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПредметыПапкиВзаимодействий.Предмет КАК КвитанцияНаОплату,
		|	КОЛИЧЕСТВО(ПредметыПапкиВзаимодействий.Взаимодействие) КАК КоличествоПисем
		|ПОМЕСТИТЬ ДанныеОПисьмах
		|ИЗ
		|	РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
		|ГДЕ
		|	ПредметыПапкиВзаимодействий.Предмет = &Док
		|	И ПредметыПапкиВзаимодействий.Взаимодействие ССЫЛКА Документ.ЭлектронноеПисьмоИсходящее
		|
		|СГРУППИРОВАТЬ ПО
		|	ПредметыПапкиВзаимодействий.Предмет";
	
	Запрос.УстановитьПараметр("Док",ТекДок);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоПисем;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции
	
&НаСервере
Процедура СформироватьПисьмаНаСервере()
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПочтовыйКлиент") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Внимание! Для формирования и отправки писем необходимо в настройках программы включить использование почтового клиента.'"));
	КонецЕсли;
		
	Кол = 0;
			
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("УчетнаяЗапись",УчетнаяЗапись);
	
	Для Каждого СтрТЧ Из ТаблицаКвитанций Цикл
		СтрТЧ.Результат = -1;//1-успех, 2- ошибка
		СтрТЧ.ТекстОшибки = "";
	КонецЦикла;
	
	Для Каждого СтрТЧ Из ТаблицаКвитанций Цикл
		
		Если СтрТЧ.Формировать = Ложь Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрТЧ.АдресЭП) Тогда
			СтрТЧ.Формировать = Ложь;
			Продолжить;
		КонецЕсли;
		
		//сформировать и отправить можно так:
		
		//РезультатОтправки = ШаблоныСообщений.СформироватьСообщениеИОтправить(ШаблонПисьма,СтрТЧ.Квитанция,УникальныйИдентификатор,ДополнительныеПараметры);
		//
		//Если РезультатОтправки.Отправлено = Ложь Тогда
		//	
		//	ТекстСообщения = НСтр("ru='Не удалось сформировать печатную форму и отправить письмо по причине:
		//		|%1'");
		//	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,РезультатОтправки.ОписаниеОшибки);
		//	
		//	СтрТЧ.Результат = 2; //1-успех, 2- ошибка
		//	СтрТЧ.ТекстОшибки = ТекстСообщения;
		//	
		//	СтрТЧ.КоличествоПисем = ПолучитьКоличествоПисемДляДокумента(СтрТЧ.Квитанция);
		//	Продолжить;
		//КонецЕсли;
		
		//только формирование:
		
		СформированноеСообщение = ШаблоныСообщений.СформироватьСообщение(ШаблонПисьма,СтрТЧ.Квитанция,УникальныйИдентификатор,ДополнительныеПараметры);
		
		РезультатСозданияПисьма = СоздатьПисьмо(СформированноеСообщение);
		Если РезультатСозданияПисьма.ПисьмоСоздано = Ложь Тогда
			
			СтрТЧ.Результат = 2; //1-успех, 2- ошибка
			СтрТЧ.ТекстОшибки = РезультатСозданияПисьма.ОписаниеОшибки;
			
			Продолжить;
		КонецЕсли;
		СтрТЧ.Письмо = РезультатСозданияПисьма.Письмо;
		
		СтрТЧ.Результат = 1;
		СтрТЧ.КоличествоПисем = СтрТЧ.КоличествоПисем + 1;
			
		Кол = Кол + 1;
		
		СтрТЧ.Формировать = Ложь;
		
	КонецЦикла;
	
	ТекстСообщения = НСтр("ru='Подготовлено писем: %1'");
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,Кол);
			
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

&НаСервере
Функция СоздатьПисьмо(Сообщение) 
	
	РезультатСозданияПисьма = Новый Структура("ПисьмоСоздано, Письмо, ОписаниеОшибки", Ложь);
	
	ПисьмоHTML = (Сообщение.ДополнительныеПараметры.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML);
	
	НачатьТранзакцию();
	Попытка
		
		Письмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
		
		Письмо.Автор                    = Пользователи.ТекущийПользователь();
		Письмо.Ответственный            = Пользователи.ТекущийПользователь();
		Письмо.Дата                     = ТекущаяДатаСеанса();
		Письмо.Важность                 = Перечисления.ВариантыВажностиВзаимодействия.Обычная;
		Письмо.Кодировка                = КодировкаТекста.UTF8;
		Письмо.ОтправительПредставление = Строка(УчетнаяЗапись);
		
		Если ПисьмоHTML Тогда
			
			Письмо.ТекстHTML = Сообщение.Текст;
			Письмо.Текст     = Взаимодействия.ПолучитьОбычныйТекстИзHTML(Сообщение.Текст);
			
		Иначе
			
			Письмо.Текст = Сообщение.Текст;
			
		КонецЕсли;
		
		Письмо.Тема = Сообщение.Тема;
		Письмо.ТипТекста = ?(ПисьмоHTML, Перечисления.ТипыТекстовЭлектронныхПисем.HTML, Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
		Письмо.УчетнаяЗапись = УчетнаяЗапись;
		Письмо.ВзаимодействиеОснование = Неопределено;
		
		// Заполним реквизиты ВключатьТелоИсходногоПисьма, ОтображатьТелоИсходногоПисьма, УведомитьОДоставке и УведомитьОПрочтении.
		НастройкиПользователя = Взаимодействия.ПолучитьПараметрыРаботыПользователяДляИсходящегоЭлектронногоПисьма(
		                           УчетнаяЗапись, Сообщение.ДополнительныеПараметры.ФорматПисьма, Истина);
		ЗаполнитьЗначенияСвойств(Письмо, НастройкиПользователя);
		
		Письмо.УдалятьПослеОтправки = Ложь;
		Письмо.Комментарий = КомментарийПоНаименованиюШаблона(Сообщение.ДополнительныеПараметры.Наименование);
		
		СписокПолучателейСпискомЗначений =( ТипЗнч(Сообщение.Получатель) = Тип("СписокЗначений"));
		Для Каждого ПолучательПисьма Из Сообщение.Получатель Цикл
			
			НоваяСтрока = Письмо["ПолучателиПисьма"].Добавить();
			
			Если СписокПолучателейСпискомЗначений Тогда
				НоваяСтрока.Адрес         = ПолучательПисьма.Значение;
				НоваяСтрока.Представление = ПолучательПисьма.Представление;
			Иначе
				НоваяСтрока.Адрес         = ПолучательПисьма.Адрес;
				НоваяСтрока.Представление = ПолучательПисьма.Представление;
				НоваяСтрока.Контакт       = ПолучательПисьма.ИсточникКонтактнойИнформации;
			КонецЕсли;
			
		КонецЦикла;
		
		Письмо.СписокПолучателейПисьма    = ВзаимодействияКлиентСервер.ПолучитьПредставлениеСпискаАдресатов(Письмо.ПолучателиПисьма, Ложь);
		Письмо.СтатусПисьма = ?(ОбщегоНазначения.ИнформационнаяБазаФайловая(),
			Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Черновик,
			Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее);
		
		Письмо.ЕстьВложения = (Сообщение.Вложения.Количество() > 0);
		РазмерВложений  = 0;
		РазмерыВложений = Новый Соответствие;
		Для Каждого Вложение Из Сообщение.Вложения Цикл
			
			Размер = ПолучитьИзВременногоХранилища(Вложение.АдресВоВременномХранилище).Размер() * 1.5;
			РазмерВложений = РазмерВложений + Размер;
			РазмерыВложений.Вставить(Вложение.АдресВоВременномХранилище, Размер);
			
			// Если у идентификатора не английские символы, то письмо может быть некорректно обработано.
			Если ЗначениеЗаполнено(Вложение.Идентификатор) Тогда
				Идентификатор = СтроковыеФункции.СтрокаЛатиницей(Вложение.Идентификатор);
				Письмо.ТекстHTML = СтрЗаменить(Письмо.ТекстHTML, "cid:" + Вложение.Идентификатор, "cid:" + Идентификатор);
				Вложение.Идентификатор = Идентификатор;
			КонецЕсли;
			
		КонецЦикла;
		
		Письмо.Размер = РазмерВложений + СтрДлина(Письмо.Тема) * 2
			+ ?(ПисьмоHTML, СтрДлина(Письмо.ТекстHTML), СтрДлина(Письмо.Текст)) * 2;
		Письмо.СтатусПисьма = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
		
		Письмо.Записать();
		
		// Добавим вложения
		Для Каждого Вложение Из Сообщение.Вложения Цикл
			
			ПараметрыВложения = Новый Структура;
			ПараметрыВложения.Вставить("ИмяФайла", Вложение.Представление);
			ПараметрыВложения.Вставить("Размер", РазмерыВложений[Вложение.АдресВоВременномХранилище]);
			
			МодульУправлениеЭлектроннойПочтой = ОбщегоНазначения.ОбщийМодуль("УправлениеЭлектроннойПочтой");
			Если ПустаяСтрока(Вложение.Идентификатор) Тогда
				
				МодульУправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(Письмо.Ссылка,
					Вложение.АдресВоВременномХранилище, ПараметрыВложения);
					
			ИначеЕсли ПисьмоHTML Тогда
				
				ПараметрыВложения.Вставить("ИДФайлаЭлектронногоПисьма", Вложение.Идентификатор);
				ПрисоединенныйФайл = МодульУправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(Письмо.Ссылка,
					Вложение.АдресВоВременномХранилище, ПараметрыВложения);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Сообщение.ДополнительныеПараметры.Свойство("Предмет") И ЗначениеЗаполнено(Сообщение.ДополнительныеПараметры.Предмет) Тогда
			Предмет = Сообщение.ДополнительныеПараметры.Предмет;
		Иначе
			Предмет = Письмо.Ссылка;
		КонецЕсли;
	
		Реквизиты       = СтруктураРеквизитовВзаимодействияДляЗаписи(Предмет, Истина);
		Реквизиты.Папка = Взаимодействия.ОпределитьПапкуДляПисьма(Письмо.Ссылка);
		
		РегистрыСведений.ПредметыПапкиВзаимодействий.ЗаписатьПредметыПапкиВзаимодействий(Письмо.Ссылка, Реквизиты);
		
		РезультатСозданияПисьма.Письмо = Письмо.Ссылка;
		
		ЗафиксироватьТранзакцию();		
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ШаблонТекстаСообщения = НСтр("ru = 'Не удалось сформировать письмо по причине:
			|%1'");
		
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,, Письмо,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)));
			
		РезультатСозданияПисьма.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		Возврат РезультатСозданияПисьма;
		
	КонецПопытки;
			
	РезультатСозданияПисьма.ПисьмоСоздано = Истина;
	
	Возврат РезультатСозданияПисьма;
	
КонецФункции

&НаСервере
Функция КомментарийПоНаименованиюШаблона(НаименованиеШаблона)

	Возврат НСтр("ru = 'Создано и отправлено по шаблону'") + " - " + НаименованиеШаблона;

КонецФункции

&НаСервере
Функция СтруктураРеквизитовВзаимодействияДляЗаписи(Предмет, Рассмотрено)
	
	СтруктураВозврата = РегистрыСведений.ПредметыПапкиВзаимодействий.РеквизитыВзаимодействия();
	Если Предмет <> Неопределено Тогда
		СтруктураВозврата.Предмет = Предмет;
	КонецЕсли;
	Если Рассмотрено <> Неопределено Тогда
		СтруктураВозврата.Рассмотрено = Рассмотрено;
	КонецЕсли;
	СтруктураВозврата.РассчитыватьРассмотрено = Истина;
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Процедура СоздатьСписокСтатусов()

	ОтборСтатус.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыИсполненияДокумента.Ссылка
	|ИЗ
	|	Перечисление.СтатусыИсполненияДокумента КАК СтатусыИсполненияДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыИсполненияДокумента.Порядок";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОтборСтатус.Добавить(Выборка.Ссылка);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьОтмеченныеЭлементы(ИсходныйСписок)

	СписокОтмеченных = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из ИсходныйСписок Цикл
		Если ЭлементСписка.Пометка Тогда
			СписокОтмеченных.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат СписокОтмеченных;
	
КонецФункции // ПолучитьОтмеченныеЭлементы()




#КонецОбласти