#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|	ПО ЭтотСписок.Контрагент.ЮридическоеФизическоеЛицо = Пользователи.ФизическоеЛицо
	|
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Пользователи.Ссылка, NULL КАК ИСТИНА)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

Процедура СформироватьОписаниеДокументовСКонтрагентомВШапке(Описание, ДокументСсылка, ДокументОбъект, Форма) Экспорт
	
	ПроверкаКонтрагентов.ДополнитьОписание(
	Описание, 
	ДокументСсылка, 
	Форма.Элементы.Контрагент,
	ДокументОбъект.Контрагент,
	Форма.Элементы.ГруппаКонтрагент);
	
	ПроверкаКонтрагентов.ДополнитьОписание(
	Описание, 
	ДокументСсылка, 
	Форма.Элементы.ПолучательПлатежа,
	ДокументОбъект.ПолучательПлатежа,
	Форма.Элементы.ГруппаПолучательПлатежа);

	
КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "РасчетныйДокументБезККТ", 5);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
