
#Область ОписаниеПеременных

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Перем ОтключитьЗаполнениеПоИНН;
&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОповеститьОбИзменениях = Параметры.ОповеститьОбИзменениях;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ФизическоеЛицоСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку();
		
		Корреспонденты.ИнициализироватьДокументУдостоверяющийЛичностьДляРедактированияВФорме(ЭтаФорма, ФизическоеЛицоСсылка);
	
		ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ФИОФизическихЛиц",  Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));
		
		ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ГражданствоФизическихЛиц",  Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));
		
		ФИОФизическихЛиц.Период = '19800101';
		
		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ОтобразитьЗаполнениеПоДаннымЕГР = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	// Обработчик подсистемы "Контактная информация"
	ДополнительныеПараметры = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "КонтактнаяИнформация");
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметры);

	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВидимостьРеквизитов();
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом   
	
	// СтандартныеПодсистемы.СклонениеПредставленийОбъектов
	СклонениеПредставленийОбъектов.ПриСозданииНаСервере(ЭтотОбъект, Объект.Наименование);
	// Конец СтандартныеПодсистемы.СклонениеПредставленийОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ИзмененоФИО" Тогда
		
		Если Параметр = ФизическоеЛицоСсылка Тогда
			ПрочитатьФИО();
			ФИОПриИзменении();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ОбщегоНазначенияБГУКлиент_РезультатОтветаНаЗапросИзмененияРегистраФИОФизическихЛиц"
		И Источник = ФизическоеЛицоСсылка Тогда
		
		Если Параметр = КодВозвратаДиалога.Да Тогда
			ФИОФизическихЛиц.Период = ТекущаяДата();
		ИначеЕсли Параметр = КодВозвратаДиалога.Отмена Тогда
			ПрочитатьФИО();
			ФИОПриИзменении();
			Если ЗначениеЗаполнено(ФИОФизическихЛиц.Отчество) Тогда
				Объект.Пол = КорреспондентыКлиентСервер.ОпределитьПолПоОтчеству(ФИОФизическихЛиц.Отчество);
			КонецЕсли;
		КонецЕсли;	
		
		ВопросИзмененоФИО = Истина;
				
	КонецЕсли;
	
	// СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	ЗащитаПерсональныхДанныхКлиент.ОбработкаОповещенияФормы(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ФизическоеЛицоСсылка  = ТекущийОбъект.Ссылка;
	ПрочитатьДанныеФизЛица();
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Корреспонденты.НайтиКонтрагентаЮрФизЛица(Объект.Ссылка, КонтрагентСсылка, КонтрагентСтрока);
	
	ПроверитьФизическоеЛицоНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ПустаяСтрока(ДокументыФизическихЛиц.ВидДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументыФизическихЛиц.Период) Тогда
			ТекстСообщения = НСтр("ru='Не заполнена дата начала действия сведений о документе удостоверяющем личность'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ДокументыФизическихЛиц.Период",,Отказ);
			Возврат;
		КонецЕсли;
		ТекстОшибки = "";
		Если ЗначениеЗаполнено(ДокументыФизическихЛиц.Серия) 
			И НЕ ДокументыФизическихЛицКлиентСервер.СерияДокументаУказанаПравильно(ДокументыФизическихЛиц.ВидДокумента,
			ДокументыФизическихЛиц.Серия, ТекстОшибки) Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "ДокументыФизическихЛиц.Серия",, Отказ);
		КонецЕсли;  
		ТекстОшибки = "";	
		Если ЗначениеЗаполнено(ДокументыФизическихЛиц.Номер) 
			И НЕ ДокументыФизическихЛицКлиентСервер.НомерДокументаУказанПравильно(ДокументыФизическихЛиц.ВидДокумента,
			ДокументыФизическихЛиц.Номер, ТекстОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "ДокументыФизическихЛиц.Номер",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ФИО	
	ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "ФИОФизическихЛиц");
	
	// гражданство
	ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "ГражданствоФизическихЛиц");

	// документ удостоверяющий личность
	ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "ДокументыФизическихЛиц");
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ЗаписьФизическиеЛица");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик подсистемы "Контактная информация"
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, Отказ);
	
	Если Параметры.Ключ.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(ФизическоеЛицоСсылка);
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ИзменениеКонтрагента", НЕ ОповеститьОбИзменениях);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Запись данных о ФИО
	ЗаписатьФИО();
	
	// Запись документа удостоверяющего личность
	ЗаписатьУдостоверениеЛичности();
	
	ОбщегоНазначенияБГУ.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "ГражданствоФизическихЛиц", Новый Структура("ФизическоеЛицо",  ФизическоеЛицоСсылка)); 
	
	// СтандартныеПодсистемы.СклонениеПредставленийОбъектов 
	ПараметрыСклонения = СклонениеПредставленийОбъектовКлиентСервер.ПараметрыСклонения(); 
	ПараметрыСклонения.ЭтоФИО = Истина;
	ПараметрыСклонения.Пол = ?(Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской"), 1, 2); 
	СклонениеПредставленийОбъектов.ПриЗаписиФормыОбъектаСклонения(ЭтотОбъект, Объект.Наименование, ТекущийОбъект.Ссылка, ПараметрыСклонения);
	// Конец СтандартныеПодсистемы.СклонениеПредставленийОбъектов 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПрочитатьДанныеФизЛица();
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Объект.ИНН) Тогда
		ТекстСообщения = "";
		Если Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(Объект.ИНН, ложь, ТекстСообщения) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Объект.ИНН");
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияБГУ.ПроверитьЗаписьВФорме(ЭтотОбъект, "ГражданствоФизическихЛиц", Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка), Отказ);
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПрочитатьДанныеФизЛица();
	
	Оповестить("ИзменениеЮридическогоФизическогоЛица", Объект.Ссылка);
	
	// БРО
	Оповестить("Запись_ФизическиеЛица", Объект.Ссылка); 
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ПроверитьПараметрыПодключенияК1СОтчетности(Объект.Ссылка, ЭтаФорма);
	// БРО
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КорреспондентыКлиент.ОбновитьОтображениеПолейВводаГражданства(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентСтрокаНажатие(Элемент, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(КонтрагентСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("Ключ", КонтрагентСсылка)); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтранаРегистрацииПриИзменении(Элемент)
	УстановитьВидимостьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	Если Параметры.Ключ.Пустая() Тогда
		Если ЗначениеЗаполнено(Объект.ДатаРождения) Тогда
			ФИОФизическихЛиц.Период = Объект.ДатаРождения;
		Иначе
			ФИОФизическихЛиц.Период = '19800101';
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФИОФизическихЛицОтчествоПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ФИОФизическихЛиц.Отчество) Тогда
		Объект.Пол = КорреспондентыКлиентСервер.ОпределитьПолПоОтчеству(ФИОФизическихЛиц.Отчество);
	КонецЕсли;
	ФИОПриИзменении();
	
	ЗапроситьРежимИзмененияФИО(ЭтотОбъект, ФИОФизическихЛиц.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОФизическихЛицИмяПриИзменении(Элемент)
	
	ФИОПриИзменении();
	ЗапроситьРежимИзмененияФИО(ЭтотОбъект, ФИОФизическихЛиц.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОФизическихЛицФамилияПриИзменении(Элемент)
	
	ФИОПриИзменении();
	ЗапроситьРежимИзмененияФИО(ЭтотОбъект, ФИОФизическихЛиц.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
		
	СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Объект.Наименование);
	
	ФИОФизическихЛиц.Фамилия  	= СтруктураФИО.Фамилия;
	ФИОФизическихЛиц.Имя 		= СтруктураФИО.Имя;		
	ФИОФизическихЛиц.Отчество 	= СтруктураФИО.Отчество;
	
	Если НЕ ЗначениеЗаполнено(ФИОФизическихЛиц.Период) Тогда
		Если ЗначениеЗаполнено(Объект.ДатаРождения) Тогда
			ФИОФизическихЛиц.Период = Объект.ДатаРождения;
		Иначе
			ФИОФизическихЛиц.Период = '19800101';
		КонецЕсли;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ФИОФизическихЛиц.Отчество) Тогда
		Объект.Пол = КорреспондентыКлиентСервер.ОпределитьПолПоОтчеству(ФИОФизическихЛиц.Отчество);
	КонецЕсли;
	
	ЗапроситьРежимИзмененияФИО(ЭтотОбъект, ФИОФизическихЛиц.Период);  
	
	// СтандартныеПодсистемы.СклонениеПредставленийОбъектов 
	ПараметрыСклонения = СклонениеПредставленийОбъектовКлиентСервер.ПараметрыСклонения(); 
	ПараметрыСклонения.ЭтоФИО = Истина;
	ПараметрыСклонения.Пол = ?(Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской"), 1, 2);
	СклонениеПредставленийОбъектовКлиент.ПросклонятьПредставление(ЭтотОбъект, Объект.Наименование, ПараметрыСклонения);
	// Конец СтандартныеПодсистемы.СклонениеПредставленийОбъектов
	
КонецПроцедуры


&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	ПроверитьФизическоеЛицоНаСервере();
	
	ОтключитьЗаполнениеПоИНН = Истина;
	ПодключитьОбработчикОжидания("Подключаемый_ВключитьЗаполнениеПоИНН", 0.2, Истина);

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
// Редактирование гражданства

&НаКлиенте
Процедура ГражданствоФизическихЛицСтранаПриИзменении(Элемент)
	КорреспондентыКлиент.ГражданствоФизическихЛицСтранаПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоФизическихЛицЛицоБезГражданстваПриИзменении(Элемент)
	КорреспондентыКлиент.ГражданствоФизическихЛицЛицоБезГражданстваПриИзменении(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоФизическихЛицПериодПриИзменении(Элемент)
	КорреспондентыКлиент.ОбновитьОтображениеПолейВводаГражданства(ЭтаФорма);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// удостоверение личности

&НаКлиенте
Процедура ДокументыФизическихЛицВидДокументаПриИзменении(Элемент)
	ОбновитьПолеПериодУдостоверениеЛичности();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицСерияПриИзменении(Элемент)
	ОбновитьПолеПериодУдостоверениеЛичности();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицНомерПриИзменении(Элемент)
	ОбновитьПолеПериодУдостоверениеЛичности();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицКемВыданПриИзменении(Элемент)
	ОбновитьПолеПериодУдостоверениеЛичности();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицДатаВыдачиПриИзменении(Элемент)
	ОбновитьПолеПериодУдостоверениеЛичности();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицКодПодразделенияПриИзменении(Элемент)
	ОбновитьПолеПериодУдостоверениеЛичности();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// список дублей контрагентов

&НаКлиенте
Процедура НадписьПоясненияНекорректногоИННОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ПараметрыПередачи.Вставить("ТекущаяСтрока", Объект.Ссылка);
	ПараметрыПередачи.Вставить("Отбор", Новый Структура); 
	ПараметрыПередачи.Отбор.Вставить("ЭтоГруппа", Ложь);
	
	Если Найти(НавигационнаяСсылка, "ЕстьДублиФизЛицоФИО") > 0 Тогда
		ПараметрыПередачи.Отбор.Вставить("Наименование", Объект.Наименование);
		ПараметрыПередачи.Отбор.Вставить("ДатаРождения", Объект.ДатаРождения);
	ИначеЕсли Найти(НавигационнаяСсылка, "ЕстьДублиФизЛицоИНН") > 0 Тогда
	    ПараметрыПередачи.Отбор.Вставить("ИНН", Объект.ИНН);
    ИначеЕсли Найти(НавигационнаяСсылка, "ЕстьДублиФизЛицоСНИЛС") > 0 Тогда
	    ПараметрыПередачи.Отбор.Вставить("СтраховойНомерПФР", Объект.СтраховойНомерПФР);
	Иначе
		Возврат;
	КонецЕсли;
	
	ЧтоВыполнитьПослеЗакрытия = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаСпискаДублей",
	ПараметрыПередачи,
	Элемент,
	,
	,
	,
	ЧтоВыполнитьПослеЗакрытия,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСпискаДублей(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ПроверитьФизическоеЛицоНаСервере();
	
КонецПроцедуры	


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоДаннымЕГР(Команда)
	
	ЗаполнитьРеквизитыПоДаннымЕГРНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоИННФЛ(Команда)
	
	Если ОтключитьЗаполнениеПоИНН <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ИНН) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Поле ""ИНН"" не заполнено'"));
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Наименование) 
		ИЛИ ЗначениеЗаполнено(Объект.НаименованиеСокращенное)   
		ИЛИ ЗначениеЗаполнено(Объект.КПП)
		Тогда
		ТекстВопроса = НСтр("ru='Перезаполнить текущие реквизиты?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьРеквизитыПоИННЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьЗаполнениеРеквизитовПоИНН();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоИННЗавершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаполнениеРеквизитовПоИНН();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ИсторияФИО(Команда)
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка);
	ПараметрыФормы = Новый Структура("Отбор, ФизическоеЛицо, ЗакрыватьПриЗакрытииВладельца" , Отбор, ФизическоеЛицоСсылка, Истина);
	ОткрытьФорму("РегистрСведений.ФИОФизическихЛиц.ФормаСписка", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
// Редактирование гражданства

&НаКлиенте
Процедура ГражданствоИстория(Команда)
	КорреспондентыКлиент.ГражданствоИстория(ФизическоеЛицоСсылка, ЭтаФорма);	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// удостоверение личности

&НаКлиенте
Процедура ИсторияУдостоверение(Команда)
	Отбор = Новый Структура("ФизЛицо, ЯвляетсяДокументомУдостоверяющимЛичность", ФизическоеЛицоСсылка, Истина);
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца", Отбор, Истина);
	ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.ФормаСписка", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВсеДокументыЭтогоЧеловека(Команда)
	
	Отбор = Новый Структура("ФизЛицо", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца", Отбор, Истина);
	ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.Форма.ДокументыФизическогоЛица", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// СтандартныеПодсистемы.СклонениеПредставленийОбъектов 
&НаКлиенте
Процедура Склонения(Команда)
	ПараметрыСклонения = СклонениеПредставленийОбъектовКлиентСервер.ПараметрыСклонения(); 
	ПараметрыСклонения.ЭтоФИО = Истина;
	ПараметрыСклонения.Пол = ?(Объект.Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской"), 1, 2); 
	СклонениеПредставленийОбъектовКлиент.ПоказатьСклонение(ЭтотОбъект, Объект.Наименование, ПараметрыСклонения);
КонецПроцедуры 
// Конец СтандартныеПодсистемы.СклонениеПредставленийОбъектов 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ВключитьЗаполнениеПоИНН()

	ОтключитьЗаполнениеПоИНН = Неопределено;	

КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоДаннымЕГРНаКлиенте()

	Если ПустаяСтрока(ПолеПоискаИНННаименование) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСТр("ru='Введите ИНН индивидуального предпренимателя'"),, "ПолеПоискаИНННаименование");
		Возврат;
	КонецЕсли;
	
	Если ОтключитьЗаполнениеПоИНН <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеПоискаИНННаименование = СокрЛП(ПолеПоискаИНННаименование);
	
	Если КорреспондентыКлиентСервер.ЭтоИНН(ПолеПоискаИНННаименование) Тогда
		
		Объект.ИНН = ПолеПоискаИНННаименование;
		
		Если НЕ ЗначениеЗаполнено(Объект.СтранаРегистрации) Тогда
				Объект.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
		КонецЕсли;
		
		ВыполнитьЗаполнениеРеквизитовПоИНН();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеРеквизитовПоИНН(ПроверитьИНН = Ложь)
	
	ОписаниеОшибки = "";
	ЗаполнитьРеквизитыПоИНННаСервере(ОписаниеОшибки);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		// Обработка ошибок
		Если ОписаниеОшибки = "НеУказаныПараметрыАутентификации" Тогда
			ТекстВопроса = НСтр("ru='Для автоматического заполнения реквизитов контрагентов
				|необходимо подключиться к Интернет-поддержке пользователей.
				|Подключиться сейчас?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержку", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		ИначеЕсли ОписаниеОшибки = "ЕстьДублиИННКПП" Тогда
				ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В базе данных уже есть индивидуальный предприниматель с ИНН %1!
			|Наличие записей с одинаковыми ИНН может привести 
			|к некорректной работе некоторых механизмов программы.
			|Отказаться от записи?'"), Объект.ИНН, Объект.КПП);
	
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодтвердитьЗаписьДубля", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Да);
			
		Иначе
			ПоказатьПредупреждение(, ОписаниеОшибки);
		КонецЕсли;
		
	Иначе
		ПроверитьФизическоеЛицоНаСервере();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодтвердитьЗаписьДубля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		ПроверитьФизическоеЛицоНаСервере();
				
		Возврат;
		
	КонецЕсли;
	
	ОтказОтЗаписиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтказОтЗаписиНаСервере() 
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ЗначениеВРеквизитФормы(Справочники.ФизическиеЛица.СоздатьЭлемент(), "Объект");
				
		Для Каждого Стр Из КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
			Стр.ЗначенияПолей = "";
			Стр.Представление = "";
			Стр.Комментарий = "";
		Конеццикла;

		Модифицированность = Ложь;
		
	Иначе
		
		Прочитать();

	КонецЕсли;	
	
	ПроверитьФизическоеЛицоНаСервере();
			
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьРеквизитыПоИНННаСервере(ОписаниеОшибки = "")
	
	РеквизитыКонтрагента = РаботаСКонтрагентами.РеквизитыПредпринимателяПоИНН(Объект.ИНН);
	РеквизитыКонтрагента.Вставить("КПП", "");
	
	Если ЗначениеЗаполнено(РеквизитыКонтрагента.ОписаниеОшибки) Тогда
		ОписаниеОшибки = РеквизитыКонтрагента.ОписаниеОшибки;
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнитьДаннеЮрФзЛица(РеквизитыКонтрагента, ОписаниеОшибки);

КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнитьДаннеЮрФзЛица(РеквизитыКонтрагента, ОписаниеОшибки)
	                     
	РезультатПроверки = Корреспонденты.ПроверитьОпределитьКонтрагентаЮрФизЛицо(РеквизитыКонтрагента.ИНН, РеквизитыКонтрагента.КПП, Объект.Ссылка); 
	
	Если РезультатПроверки.Корректен Тогда 
		//проверка прошла успешно, можно заполнять
		ОписаниеОшибки = "";
		
		Если РезультатПроверки.ЕстьДанные > 0 
			И ЗначениеЗаполнено(РезультатПроверки.ЮрФизЛицоСсылка) 
			И НЕ РезультатПроверки.ЮрФизЛицоСсылка = Объект.Ссылка Тогда
			//есть дубли, надо будет спросить
			ОписаниеОшибки = "ЕстьДублиИННКПП";
		КонецЕсли; 

	Иначе
		ОписаниеОшибки = "Введены некорретные данные.";
		Модифицированность = Ложь;
		Возврат;
	КонецЕсли;
	
	РеквизитыКонтрагента.Вставить("ОГРНИП", РеквизитыКонтрагента.РегистрационныйНомер);
	РеквизитыКонтрагента.Вставить("Пол", ?(РеквизитыКонтрагента.Пол = "1", Перечисления.ПолФизическогоЛица.Мужской, Перечисления.ПолФизическогоЛица.Женский));
		
	Если НЕ РеквизитыКонтрагента.СвидетельствоОРегистрации = Неопределено Тогда
		РеквизитыКонтрагента.Вставить("СвидетельствоСерияНомер", РеквизитыКонтрагента.СвидетельствоОРегистрации.Серия + " " + РеквизитыКонтрагента.СвидетельствоОРегистрации.Номер); 
		РеквизитыКонтрагента.Вставить("СвидетельствоДата", РеквизитыКонтрагента.СвидетельствоОРегистрации.Дата);
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(ФИОФизическихЛиц, РеквизитыКонтрагента);
	Если НЕ ЗначениеЗаполнено(ФИОФизическихЛиц.Период) Тогда
		ФИОФизическихЛиц.Период = РеквизитыКонтрагента.ДатаРегистрации;
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ГражданствоФизическихЛиц.Период) Тогда
		ГражданствоФизическихЛиц.Период = РеквизитыКонтрагента.ДатаРегистрации;
	КонецЕсли;

	//////////////////////////
		
	ЗаполнитьЗначенияСвойств(Объект, РеквизитыКонтрагента);
	
	ПроверитьФизическоеЛицоНаСервере();
	
	Модифицированность = Истина;

КонецПроцедуры	

&НаКлиенте
Процедура ЗапроситьРежимИзмененияФИО(ФормаИсточник, ДатаИзменения)
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru =  'При редактировании Вы изменили полное имя физического лица. 
							|Если Вы просто исправили прежние данные (они были ошибочны), нажмите ""Исправлена ошибка"".
							|Если у физического лица сменилась фамилия, имя или отчество с %1, нажмите ""Изменилось имя""'"), 
				Формат(ТекущаяДата(), "ДФ='д ММММ гггг ""г""'"));
	ТекстКнопкиДа = НСтр("ru = 'Изменилось имя'");

	ОбщегоНазначенияБГУКлиент.ЗапроситьРежимИзмененияРегистра(ФормаИсточник, "ФИОФизическихЛиц", ТекстВопроса, ТекстКнопкиДа, Ложь,, ФизическоеЛицоСсылка);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеФизЛица()
	
	ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ГражданствоФизическихЛиц",  Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));
	
	ГражданствоФизическихЛицЛицоБезГражданства = НЕ ЗначениеЗаполнено(ГражданствоФизическихЛиц.Страна);

	ПрочитатьУдостоверениеЛичности();
	
	ПрочитатьФИО();

КонецПроцедуры // ПрочитатьДанныеФизЛица()

&НаСервере
Процедура ПроверитьФизическоеЛицоНаСервере()
	
	ТекстСообщения = "";
	МассивРезультатовПроверки = Новый Массив;
	Элементы.ГруппаОшибки.Видимость = Ложь;

	Если ЗначениеЗаполнено(Объект.ИНН) Тогда
		
		Если НЕ РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(Объект.ИНН, Ложь, ТекстСообщения) Тогда
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения));
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;
		
		Дубли = Корреспонденты.ПроверитьДублиФизЛицаПоРегДанным("ИНН", Объект.ИНН, Объект.Ссылка, "ФизическиеЛица", " ");
		Если Дубли > 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В базе данных обнаружено еще записей с тем же ИНН: %1'"), Дубли);
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения,,,,"ЕстьДублиФизЛицоИНН")); 
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СтраховойНомерПФР) Тогда
		
		Если НЕ РегламентированныеДанныеКлиентСервер.СтраховойНомерПФРСоответствуетТребованиям(Объект.СтраховойНомерПФР, ТекстСообщения) Тогда
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения));
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли; 
		
		Дубли = Корреспонденты.ПроверитьДублиФизЛицаПоРегДанным("СтраховойНомерПФР", Объект.СтраховойНомерПФР, Объект.Ссылка, "ФизическиеЛица", " ");
		Если Дубли > 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В базе данных обнаружено еще записей с тем же СНИЛС: %1'"), Дубли);
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения,,,,"ЕстьДублиФизЛицоСНИЛС")); 
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;

	КонецЕсли;
	
	Дубли = Корреспонденты.ПроверитьДублиФизЛица(Объект.Наименование, Объект.ДатаРождения, Объект.Ссылка);
	Если Дубли > 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В базе данных обнаружено еще записей с теми же ФИО и датой рождения: %1'"), Дубли);
		МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения,,,,"ЕстьДублиФизЛицоФИО"));
	КонецЕсли;
	
	Если МассивРезультатовПроверки.Количество() > 0 Тогда
		МассивРезультатовПроверки.Вставить(0, Новый ФорматированнаяСтрока(Символы.ПС));
		НадписьПоясненияНекорректногоИНН = Новый ФорматированнаяСтрока(МассивРезультатовПроверки);
		Элементы.ГруппаОшибки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// удостоверение личности

&НаСервере
Процедура ПрочитатьУдостоверениеЛичности()

	Корреспонденты.ПрочитатьДокументУдостоверяющийЛичностьДляРедактированияВФорме(ЭтаФорма, ФизическоеЛицоСсылка);	

КонецПроцедуры // ПрочитатьУдостоверениеЛичности()
 
&НаСервере
Процедура ЗаписатьУдостоверениеЛичности()

	Корреспонденты.ЗаписатьДокументУдостоверяющийЛичностьПослеРедактированияВФорме(ЭтаФорма, ФизическоеЛицоСсылка);

КонецПроцедуры // ЗаписатьУдостоверениеЛичности()

// Устанавливает отметку незаполненного у поля период удостоверения личности
//
&НаКлиенте
Процедура ОбновитьПолеПериодУдостоверениеЛичности()

	Если  НЕ (ЗначениеЗаполнено(ДокументыФизическихЛиц.ВидДокумента) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.Серия) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.Номер) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.КемВыдан) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.ДатаВыдачи) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.КодПодразделения)) Тогда
		
		Элементы.ДокументыФизическихЛицПериод.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ДокументыФизическихЛицПериод.ОтметкаНезаполненного = Ложь;
	Иначе		
		Элементы.ДокументыФизическихЛицПериод.АвтоОтметкаНезаполненного = Истина;
		Если ЗначениеЗаполнено(ДокументыФизическихЛиц.Период) Тогда
			Элементы.ДокументыФизическихЛицПериод.ОтметкаНезаполненного = Ложь;
		Иначе
			Элементы.ДокументыФизическихЛицПериод.ОтметкаНезаполненного = Истина;
		КонецЕсли;
	КонецЕсли;
		

КонецПроцедуры // ОбновитьПолеПериодУдостоверениеЛичности()

////////////////////////////////////////////////////////////////////////////////
// ФИО

&НаСервере
Процедура ПрочитатьФИО()

	ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ФИОФизическихЛиц",  Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));

КонецПроцедуры // ПрочитатьФИО()

&НаСервере
Процедура ЗаписатьФИО()

	ОбщегоНазначенияБГУ.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "ФИОФизическихЛиц",  Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));

КонецПроцедуры // ЗаписатьФИО()
 
// Собирает наименование из фамилии, имени и отчества
//
&НаКлиенте
Процедура ФИОПриИзменении()

	Объект.Наименование = ФИОФизическихЛиц.Фамилия + " " + ФИОФизическихЛиц.Имя + " " + ФИОФизическихЛиц.Отчество;	
	
КонецПроцедуры // ФИОПриИзменении()

&НаСервере
Процедура УстановитьВидимостьРеквизитов()
	
	ЭтоИностранноеФЛ = НЕ (Объект.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") 
	ИЛИ Объект.СтранаРегистрации = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка"));
	
	Элементы.ГруппаРегНомераИностранца.Видимость 	= ЭтоИностранноеФЛ;
	Элементы.НаименованиеЛатиницей.Видимость 		= ЭтоИностранноеФЛ;
	
	Элементы.ГруппаЗаполнениеПоДаннымЕГР.Видимость = ОтобразитьЗаполнениеПоДаннымЕГР; 
	Элементы.ЗаполнитьПоИННФЛ.Видимость = НЕ ОтобразитьЗаполнениеПоДаннымЕГР
	И ЗначениеЗаполнено(Объект.ИНН)
	И ЗначениеЗаполнено(Объект.ОГРНИП);
	
	Элементы.ГруппаКонтрагент.Видимость = ЗначениеЗаполнено(КонтрагентСтрока);
	
КонецПроцедуры // УстановитьВидимостьРеквизитовКонтрагента()

&НаКлиенте
Процедура ПодключитьИнтернетПоддержку(Ответ, ДопПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуЗавершение", ЭтотОбъект, ДопПараметры);
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		ВыполнитьЗаполнениеРеквизитовПоИНН();
	КонецЕсли;

КонецПроцедуры


// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
        УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
    УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#КонецОбласти



