#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Заголовок 			= Параметры.ЗаголовокФормы;
	
	ИдентификаторСтроки = Параметры.ИдентификаторСтроки;
	Организация 		= Параметры.Организация;
	ИФО 				= Параметры.ИФО;
	Дата 				= Параметры.Дата;
	
	Ведомость.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресВХранилищеВедомостиПоСтроке));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВедомость

&НаКлиенте
Процедура ВедомостьПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		ЗаполнитьЗначенияСвойств(Элемент.ТекущиеДанные, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВедомостьКПСПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Ведомость.ТекущиеДанные;
	БухгалтерскийУчетКлиент.ПроверитьОчиститьКЭК(ТекущиеДанные.КПС, ТекущиеДанные.КЭК); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Модифицированность Тогда
		Если ПроверитьЗаполнение() Тогда
			РезультатыРедактирования = Новый Структура;
			РезультатыРедактирования.Вставить("Модифицированность", Модифицированность);
			РезультатыРедактирования.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
			РезультатыРедактирования.Вставить("АдресВХранилищеВедомостиПоСтроке", АдресВХранилищеВедомостиПоСтроке());
			
			Модифицированность = Ложь;
			Закрыть(РезультатыРедактирования);
		КонецЕсли;
	Иначе
		Закрыть();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция АдресВХранилищеВедомостиПоСтроке()
	
	Выплата = Ведомость.Выгрузить();
	Выплата.ЗаполнитьЗначения(ИдентификаторСтроки, "ИдентификаторСтроки");
	
	Возврат ПоместитьВоВременноеХранилище(Выплата, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
