
#Область ЗачетАвансов

////////////////////////////////////////////////////////////////////////////////
// ЗАЧЕТ АВАНСОВ (ДВИЖЕНИЕ ЦЕННОСТЕЙ: МАТЕРИАЛЬНЫХ ЗАПАСОВ, УСЛУГ И ПР.)

// Исходные данные документа.

// Пустая таблица расчетов по документу.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Пустая таблица расчетов по документу:
// * ЭтоПоступление - Булево -
// * ИФО - СправочникСсылка.ИсточникиФинансовогоОбеспечения -
// * КФО - ПеречислениеСсылка.КВД -
// * КПС - СправочникСсылка.КлассификационныеПризнакиСчетов -
// * Подразделение - СправочникСсылка.Подразделения -
// * КЭК - СправочникСсылка.КОСГУ -
// * СчетРасчетов - ПланСчетовСсылка.ЕПСБУ -
// * Контрагент - СправочникСсылка.Контрагенты -
// * Договор - СправочникСсылка.Договоры -
// * Валюта - СправочникСсылка.Валюты -
// * СуммаНДС - Число
// * СуммаРасчетов - Число
Функция ПустаяТаблицаРасчетовПоДокументу() Экспорт
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ТаблицаРасчетов = Новый ТаблицаЗначений;
	// Признак поступления ценностей: материальных запасов, услуг и пр.
	ТаблицаРасчетов.Колонки.Добавить("ЭтоПоступление", Новый ОписаниеТипов("Булево"));
	// Общие разрезы учета.
	ТаблицаРасчетов.Колонки.Добавить("ИФО",            Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаРасчетов.Колонки.Добавить("КФО",            Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаРасчетов.Колонки.Добавить("КПС",            Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаРасчетов.Колонки.Добавить("КПСРасчетов",    Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаРасчетов.Колонки.Добавить("Подразделение",  Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Счет и аналитика учета расчетов с контрагентами.
	ТаблицаРасчетов.Колонки.Добавить("КЭК",            Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаРасчетов.Колонки.Добавить("СчетРасчетов",   Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаРасчетов.Колонки.Добавить("Контрагент",     Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаРасчетов.Колонки.Добавить("Договор",        Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ТаблицаРасчетов.Колонки.Добавить("Валюта",         Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	// Суммовые показатели операции.
	ТаблицаРасчетов.Колонки.Добавить("СуммаНДС",       ОписаниеТипаСуммы);
	ТаблицаРасчетов.Колонки.Добавить("СуммаРасчетов",  ОписаниеТипаСуммы);
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

// Подготавливает таблицу документа (в унифицированном формате) для отражения расчетов с контрагентами.
// 
// Параметры:
//  Документ - ДокументОбъект - Документ
//  Параметры - Структура 
//  Отказ - Булево - Отказ
// 
// Возвращаемое значение:
//  см. ПустаяТаблицаРасчетовПоДокументу
Функция ПодготовитьТаблицуРасчетовПоДокументу(Документ, Параметры = Неопределено, Отказ) Экспорт
	
	ТаблицаРасчетов = ПустаяТаблицаРасчетовПоДокументу();
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	Если НЕ Параметры.Свойство("ПоВсемКФО") Тогда
		Параметры.Вставить("ПоВсемКФО", Ложь);
	КонецЕсли;
	Если НЕ Параметры.Свойство("ПоВсемКПС") Тогда
		Параметры.Вставить("ПоВсемКПС", Ложь);
	КонецЕсли;
	
	МетаданныеДокумента = Документ.Метаданные();
	
	Если МетаданныеДокумента.Имя = "ГТДИмпорт" Тогда // Особый случай. Существенно отличается структура данных.
		Возврат ПодготовитьТаблицуРасчетовПоДокументуГТДИмпорт(ТаблицаРасчетов, Документ, Параметры, Отказ);
	ИначеЕсли МетаданныеДокумента.Имя = "ИзвещениеИсходящее" Тогда // Особый случай. Зачет авансов будет реализован позднее.
		Возврат Документы.ИзвещениеИсходящее.ПодготовитьТаблицуРасчетовПоДокументу(ТаблицаРасчетов, Документ, Параметры, Отказ);
	ИначеЕсли МетаданныеДокумента.Имя = "АктПриемкиТоваровРаботУслуг" Тогда 
		Возврат Документы.АктПриемкиТоваровРаботУслуг.ПодготовитьТаблицуРасчетовПоДокументу(Документ, Параметры, Отказ);
	ИначеЕсли МетаданныеДокумента.Имя = "НачислениеАмортизацииПравПользованияОС" Тогда 
		Возврат Документы.НачислениеАмортизацииПравПользованияОС.ПодготовитьТаблицуРасчетовПоДокументу(Документ, Параметры, Отказ);
	ИначеЕсли МетаданныеДокумента.Имя = "НачислениеЗаУслугиОбразования" Тогда 
		Возврат Документы.НачислениеЗаУслугиОбразования.ПодготовитьТаблицуРасчетовПоДокументу(Документ, Параметры, Отказ);
	ИначеЕсли МетаданныеДокумента.Имя = "НачислениеСтудентамЗаПрочиеУслуги" Тогда 
		Возврат Документы.НачислениеСтудентамЗаПрочиеУслуги.ПодготовитьТаблицуРасчетовПоДокументу(Документ, Параметры, Отказ);
	ИначеЕсли МетаданныеДокумента.Имя = "ПоступлениеИК" Тогда 
		Возврат Документы.ПоступлениеИК.ПодготовитьТаблицуРасчетовПоДокументу(Документ, Параметры, Отказ);
	ИначеЕсли МетаданныеДокумента.Имя = "СписаниеДоходовБудущихПериодов" Тогда 
		Возврат Документы.СписаниеДоходовБудущихПериодов.ПодготовитьТаблицуРасчетовПоДокументу(Документ, Параметры, Отказ);
	ИначеЕсли МетаданныеДокумента.Имя = "ПередачаОбъектовОС"
		ИЛИ МетаданныеДокумента.Имя = "ПередачаОбъектовИК" Тогда 
		Возврат Документы.ПередачаОбъектовОС.ПодготовитьТаблицуРасчетовПоДокументу(Документ, Параметры, Отказ);
	КонецЕсли;
	
	ЕстьВалютаДокумента = ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", МетаданныеДокумента);
	Если Не ЕстьВалютаДокумента И НЕ Параметры.Свойство("ВалютаДокумента") Тогда
		Параметры.Вставить("ВалютаДокумента", Константы.ВалютаРегламентированногоУчета.Получить());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// 1. Расчеты по материальным запасам (поступившим и отгруженным).
	ЕстьТабЧастьМатериалы      = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("Материалы", МетаданныеДокумента);
	ЕстьТабЧастьНоменклатура   = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("Номенклатура", МетаданныеДокумента);
	ЕстьТабЧастьВозвратнаяТара = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("ВозвратнаяТара", МетаданныеДокумента);
	
	Если ЕстьТабЧастьМатериалы Тогда
		
		ЕстьРеквизитКомиссионнаяТорговля = ОбщегоНазначения.ЕстьРеквизитОбъекта("КомиссионнаяТорговля",
			МетаданныеДокумента.ТабличныеЧасти.Материалы);
		
		Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("КЭК", МетаданныеДокумента.ТабличныеЧасти.Материалы)
			И НЕ Параметры.Свойство("КЭК") Тогда
			Параметры.Вставить("КЭК", Справочники.КОСГУ.ПустаяСсылка());
		КонецЕсли;  
		Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("КПСРасчетов", МетаданныеДокумента.ТабличныеЧасти.Материалы) Тогда
            Параметры.Вставить("КПСРасчетов", Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка());
		КонецЕсли;
		
		СписокПолей = "ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,СуммаНДС,Всего,КЭК,КПСРасчетов";
		Если ЕстьРеквизитКомиссионнаяТорговля Тогда
			СписокПолей = СписокПолей + ",КомиссионнаяТорговля";
		КонецЕсли;
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Материалы", СписокПолей, Документ, Параметры);
		
	ИначеЕсли ЕстьТабЧастьНоменклатура Тогда
		
		ЕстьРеквизитКомиссионнаяТорговля = ОбщегоНазначения.ЕстьРеквизитОбъекта("КомиссионнаяТорговля",
			МетаданныеДокумента.ТабличныеЧасти.Номенклатура);
		
		Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("КЭК", МетаданныеДокумента.ТабличныеЧасти.Номенклатура)
			И НЕ Параметры.Свойство("КЭК") Тогда
			Параметры.Вставить("КЭК", Справочники.КОСГУ.ПустаяСсылка());
		КонецЕсли;
		Параметры.Вставить("КПСРасчетов", Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка());
		
		СписокПолей = "ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,СуммаНДС,Всего,КЭК,КПСРасчетов";
		Если ЕстьРеквизитКомиссионнаяТорговля Тогда
			СписокПолей = СписокПолей + ",КомиссионнаяТорговля";
		КонецЕсли;
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Номенклатура", СписокПолей,Документ, Параметры);
		
		// Переименуем таблицу, т.к. таб.часть называется так же, как реквизит - "Номенклатура".
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура.", "ТабНоменклатура.");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"ТаблицаНоменклатура КАК Номенклатура", "ТаблицаНоменклатура КАК ТабНоменклатура");
	КонецЕсли;
	Если ЕстьТабЧастьВозвратнаяТара Тогда
		Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("КЭК", МетаданныеДокумента.ТабличныеЧасти.ВозвратнаяТара)
			И НЕ Параметры.Свойство("КЭК") Тогда
			Параметры.Вставить("КЭК", Справочники.КОСГУ.ПустаяСсылка());
		КонецЕсли;
		Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("КПСРасчетов", МетаданныеДокумента.ТабличныеЧасти.ВозвратнаяТара) Тогда
            Параметры.Вставить("КПСРасчетов", Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка());
		КонецЕсли;
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ВозвратнаяТара",
			"ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,Сумма,КЭК,КПСРасчетов",
			Документ, Параметры);
	КонецЕсли;
		
	ВидОперации = ?(Найти(МетаданныеДокумента.Имя, "Поступление") > 0, "Поступление", "Реализация");
	СчетРасчетов = ОпределитьСчетРасчетовПоПараметрам(Параметры, ВидОперации,
		Документ.Дата, Документ.Организация, Документ.ИФО);
	СчетРасчетовПоКомиссионнойТорговли = СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("210.05", Документ.Дата, Документ.Организация);
	
	Если ЕстьТабЧастьМатериалы ИЛИ ЕстьТабЧастьНоменклатура Тогда
		
		Если ЕстьТабЧастьМатериалы Тогда
			
			Запрос.Текст = Запрос.Текст +
			"ВЫБРАТЬ
			|	Материалы.ИФО КАК ИФО,
			|	&МатериалыКФО КАК КФО,
			|	&МатериалыКПС КАК КПС,
			|	Материалы.Подразделение КАК Подразделение,
			|	Материалы.Контрагент КАК Контрагент,
			|	Материалы.Договор КАК Договор,
			|	Материалы.ВалютаДокумента КАК Валюта,
			|	Материалы.СуммаНДС КАК СуммаНДС,
			|	Материалы.Всего КАК СуммаРасчетов,
			|	Материалы.КЭК КАК КЭК,
			|	Материалы.КПСРасчетов КАК КПСРасчетов
			|ИЗ
			|	ТаблицаМатериалы КАК Материалы
			|ГДЕ
			|	&УсловиеПоКомиссионнойТорговли";
			
			Если ЕстьРеквизитКомиссионнаяТорговля И НЕ ВидОперации = "Поступление" Тогда
				Если СчетРасчетовПоКомиссионнойТорговли Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКомиссионнойТорговли","Материалы.КомиссионнаяТорговля");
				Иначе
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКомиссионнойТорговли","НЕ Материалы.КомиссионнаяТорговля");
				КонецЕсли;
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКомиссионнойТорговли","ИСТИНА");
			КонецЕсли;
			
		ИначеЕсли ЕстьТабЧастьНоменклатура Тогда
			
			Запрос.Текст = Запрос.Текст +
			"ВЫБРАТЬ
			|	ТабНоменклатура.ИФО КАК ИФО,
			|	&ТабНоменклатураКФО КАК КФО,
			|	&ТабНоменклатураКПС КАК КПС,
			|	ТабНоменклатура.Подразделение КАК Подразделение,
			|	ТабНоменклатура.Контрагент КАК Контрагент,
			|	ТабНоменклатура.Договор КАК Договор,
			|	ТабНоменклатура.ВалютаДокумента КАК Валюта,
			|	ТабНоменклатура.СуммаНДС КАК СуммаНДС,
			|	ТабНоменклатура.Всего КАК СуммаРасчетов,
			|	ТабНоменклатура.КЭК КАК КЭК,
			|	ТабНоменклатура.КПСРасчетов КАК КПСРасчетов
			|ИЗ
			|	ТаблицаНоменклатура КАК ТабНоменклатура
			|ГДЕ
			|	&УсловиеПоКомиссионнойТорговли";
			
			Если ЕстьРеквизитКомиссионнаяТорговля Тогда
				Если СчетРасчетовПоКомиссионнойТорговли Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКомиссионнойТорговли","ТабНоменклатура.КомиссионнаяТорговля");
				Иначе
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКомиссионнойТорговли","НЕ ТабНоменклатура.КомиссионнаяТорговля");
				КонецЕсли;
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКомиссионнойТорговли","ИСТИНА");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЕстьТабЧастьВозвратнаяТара Тогда
			
			Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("ВСЕ");
			Запрос.Текст = Запрос.Текст + 
			"ВЫБРАТЬ
			|	ВозвратнаяТара.ИФО,
			|	&ВозвратнаяТараКФО,
			|	&ВозвратнаяТараКПС,
			|	ВозвратнаяТара.Подразделение,
			|	ВозвратнаяТара.Контрагент,
			|	ВозвратнаяТара.Договор,
			|	ВозвратнаяТара.ВалютаДокумента,
			|	0,
			|	ВозвратнаяТара.Сумма,
			|	ВозвратнаяТара.КЭК КАК КЭК,
			|	ВозвратнаяТара.КПСРасчетов КАК КПСРасчетов
			|ИЗ
			|	ТаблицаВозвратнаяТара КАК ВозвратнаяТара";
			
		КонецЕсли;
		
		Если Параметры.ПоВсемКФО Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&МатериалыКФО",
				"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТабНоменклатураКФО",
				"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВозвратнаяТараКФО",
				"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&МатериалыКФО",
				"Материалы.КФО");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТабНоменклатураКФО",
				"ТабНоменклатура.КФО");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВозвратнаяТараКФО",
				"ВозвратнаяТара.КФО");
		КонецЕсли;
		Если Параметры.ПоВсемКПС Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&МатериалыКПС",
				"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТабНоменклатураКПС",
				"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВозвратнаяТараКПС",
				"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&МатериалыКПС",
				"Материалы.КПС");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТабНоменклатураКПС",
				"ТабНоменклатура.КПС");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВозвратнаяТараКПС",
				"ВозвратнаяТара.КПС");
		КонецЕсли;
		
		РасчетыПоМатериальнымЗапасам = Запрос.Выполнить().Выгрузить();
		
		КПСРасчетовШапка = Неопределено;
		Параметры.Свойство("КПС",КПСРасчетовШапка);
		КПСРасчетовВТЧ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "КПСРасчетовВТЧ", Ложь);

		ИспользоватьКПСРасчетов = Ложь;
		Если ВидОперации = "Реализация" И НЕ Параметры.ПоВсемКПС Тогда
			// В документах реализации в таб.части указан КПС расходов.
			// Для расчетов должен использоваться КПС доходов.
			ИспользоватьКПСРасчетов = Истина;
		ИначеЕсли ВидОперации = "Поступление" И НЕ Параметры.ПоВсемКПС Тогда
			// В документах поступления материальных запасов может быть указан КПС счета расчетов (302.ХХ),
			// отличный от КПС счета учета материальных запасов (105.ХХ).
			ИспользоватьКПСРасчетов = КПСРасчетовВТЧ ИЛИ ЗначениеЗаполнено(КПСРасчетовШапка);
		КонецЕсли;
		
		ГрупповойКЭК440 = БухгалтерскийУчетПовтИсп.КЭКпоКоду("440");
		КЭК360 = БухгалтерскийУчетПовтИсп.КЭКпоКоду("360");
		
		Для Каждого СтрокаДокумента Из РасчетыПоМатериальнымЗапасам Цикл
			
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
			
			Если ЗначениеЗаполнено(СчетРасчетов) Тогда
				НоваяСтрока.СчетРасчетов = СчетРасчетов;
			Иначе
				Если ВидОперации = "Поступление" Тогда
					Если НоваяСтрока.КЭК = КЭК360 Тогда
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("302.36", Документ.Дата, Документ.Организация);
					Иначе
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("302.34", Документ.Дата, Документ.Организация);
					КонецЕсли;
				Иначе
					НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("205.74", Документ.Дата, Документ.Организация);
				КонецЕсли;
			КонецЕсли;
			
			Если СчетРасчетовПоКомиссионнойТорговли Тогда
				НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.КЭКпоКоду("000");
			ИначеЕсли НоваяСтрока.КЭК <> КЭК360 Тогда
				КЭКПоСчету = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(НоваяСтрока.СчетРасчетов);
				Если КЭКПоСчету <> ГрупповойКЭК440 ИЛИ НЕ ЗначениеЗаполнено(НоваяСтрока.КЭК) Тогда
					НоваяСтрока.КЭК = КЭКПоСчету;
				КонецЕсли;
			КонецЕсли;
			
			Если ИспользоватьКПСРасчетов Тогда
				Если КПСРасчетовВТЧ Тогда
					НоваяСтрока.КПС = СтрокаДокумента.КПСРасчетов;
				Иначе
					НоваяСтрока.КПС = КПСРасчетовШапка;
				КонецЕсли;	
			КонецЕсли;
			
			НоваяСтрока.ЭтоПоступление = БухгалтерскийУчет.СчетВИерархии(НоваяСтрока.СчетРасчетов, "302.00");
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	// 2. Расчеты по поступившим услугам, работам.
	ЕстьТабЧастьУслугиИРаботы = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("УслугиИРаботы", МетаданныеДокумента);
	Если ЕстьТабЧастьУслугиИРаботы Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "УслугиИРаботы",
			"НомерСтроки,ИФО,КФО,КПС,КЭК,Подразделение,Контрагент,Договор,ВалютаДокумента,СуммаНДС,Всего",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	УслугиИРаботы.НомерСтроки КАК НомерСтроки,
		|	УслугиИРаботы.ИФО КАК ИФО,
		|	УслугиИРаботы.КФО КАК КФО,
		|	УслугиИРаботы.КПС КАК КПС,
		|	УслугиИРаботы.КЭК КАК КЭК,
		|	УслугиИРаботы.Подразделение КАК Подразделение,
		|	УслугиИРаботы.Контрагент КАК Контрагент,
		|	УслугиИРаботы.Договор КАК Договор,
		|	УслугиИРаботы.ВалютаДокумента КАК Валюта,
		|	УслугиИРаботы.СуммаНДС КАК СуммаНДС,
		|	УслугиИРаботы.Всего КАК СуммаРасчетов
		|ИЗ
		|	ТаблицаУслугиИРаботы КАК УслугиИРаботы";
		
		Если Параметры.ПоВсемКФО Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "УслугиИРаботы.КФО",
				"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		КонецЕсли;
		Если Параметры.ПоВсемКПС Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "УслугиИРаботы.КПС",
				"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		КонецЕсли;
		
		РасчетыПоУслугамРаботам = Запрос.Выполнить().Выгрузить();
		
		СчетРасчетов = ОпределитьСчетРасчетовПоПараметрам(Параметры, "Поступление",
			Документ.Дата, Документ.Организация, Документ.ИФО);
		
		Для Каждого СтрокаДокумента Из РасчетыПоУслугамРаботам Цикл
			
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
			
			НоваяСтрока.ЭтоПоступление = Истина;
			
			// Счет расчетов.
			Если ЗначениеЗаполнено(СчетРасчетов) Тогда
				НоваяСтрока.СчетРасчетов = СчетРасчетов;
			Иначе
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					СтрокаДокумента.КЭК, "302.00", , Документ.Дата, Документ.Организация, СтрокаДокумента.ИФО);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СчетРасчетов) Тогда
				ТекстОшибки = НСтр("ru='Невозможно определить счет расчетов с контрагентом по КЭК ""%1"".
					|Проверьте настройки соответствия аналитических счетов КЭК.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
					СтрокаДокумента.КЭК);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,
					Документ.Ссылка, "УслугиИРаботы[" + Формат(СтрокаДокумента.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].КЭК", "Объект", Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	// 3. Расчеты по реализованным услугам, работам.
	ЕстьТабЧастьУслугиОказанные  = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("УслугиОказанные", МетаданныеДокумента);
	ЕстьТабЧастьСоставЭтапаРабот = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("СоставЭтапаРабот", МетаданныеДокумента);
	ЕстьТабЧастьНачисления       = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("Начисления", МетаданныеДокумента);
	
	Если ЕстьТабЧастьУслугиОказанные Тогда
		
		ЕстьРеквизитКомиссионнаяТорговля = ОбщегоНазначения.ЕстьРеквизитОбъекта("КомиссионнаяТорговля",
			МетаданныеДокумента.ТабличныеЧасти.УслугиОказанные);
		
		СчетРасчетов = ОпределитьСчетРасчетовПоПараметрам(Параметры, "Реализация",
			Документ.Дата, Документ.Организация, Документ.ИФО);
			
		СписокПолей = "ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,СуммаНДС,Всего";
		Если ЕстьРеквизитКомиссионнаяТорговля Тогда
			СписокПолей = СписокПолей + ",КомиссионнаяТорговля";
		КонецЕсли;
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "УслугиОказанные", СписокПолей,
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	УслугиОказанные.ИФО КАК ИФО,
		|	УслугиОказанные.КФО КАК КФО,
		|	УслугиОказанные.КПС КАК КПС,
		|	УслугиОказанные.Подразделение КАК Подразделение,
		|	УслугиОказанные.Контрагент КАК Контрагент,
		|	УслугиОказанные.Договор КАК Договор,
		|	УслугиОказанные.ВалютаДокумента КАК Валюта,
		|	УслугиОказанные.СуммаНДС КАК СуммаНДС,
		|	УслугиОказанные.Всего КАК СуммаРасчетов
		|ИЗ
		|	ТаблицаУслугиОказанные КАК УслугиОказанные
		|ГДЕ
		|	&УсловиеПоКомиссионнойТорговли";
		
		Если ЕстьРеквизитКомиссионнаяТорговля Тогда
			Если СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("210.05", Документ.Дата, Документ.Организация) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКомиссионнойТорговли","УслугиОказанные.КомиссионнаяТорговля");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКомиссионнойТорговли","НЕ УслугиОказанные.КомиссионнаяТорговля");
			КонецЕсли;
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКомиссионнойТорговли","ИСТИНА");
		КонецЕсли;
		
		Если Параметры.ПоВсемКФО Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "УслугиОказанные.КФО",
				"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		КонецЕсли;
		Если Параметры.ПоВсемКПС Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "УслугиОказанные.КПС",
				"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		КонецЕсли;
		
	ИначеЕсли ЕстьТабЧастьСоставЭтапаРабот Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "СоставЭтапаРабот",
			"ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,СуммаНДС,Всего",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	СоставЭтапаРабот.ИФО КАК ИФО,
		|	СоставЭтапаРабот.КФО КАК КФО,
		|	СоставЭтапаРабот.КПС КАК КПС,
		|	СоставЭтапаРабот.Подразделение КАК Подразделение,
		|	СоставЭтапаРабот.Контрагент КАК Контрагент,
		|	СоставЭтапаРабот.Договор КАК Договор,
		|	СоставЭтапаРабот.ВалютаДокумента КАК Валюта,
		|	СоставЭтапаРабот.СуммаНДС КАК СуммаНДС,
		|	СоставЭтапаРабот.Всего КАК СуммаРасчетов
		|ИЗ
		|	ТаблицаСоставЭтапаРабот КАК СоставЭтапаРабот";
		
		Если Параметры.ПоВсемКФО Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СоставЭтапаРабот.КФО",
				"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		КонецЕсли;
		Если Параметры.ПоВсемКПС Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СоставЭтапаРабот.КПС",
				"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		КонецЕсли;
		
	ИначеЕсли ЕстьТабЧастьНачисления Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Начисления",
			"ИФО,КФО,КПС,Подразделение,Контрагент,ДоговорКонтрагента,ВалютаДокумента,УчитыватьНДС,СуммаВключаетНДС,СуммаНДС,Сумма",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	Начисления.ИФО КАК ИФО,
		|	Начисления.КФО КАК КФО,
		|	Начисления.КПС КАК КПС,
		|	Начисления.Подразделение КАК Подразделение,
		|	Начисления.Контрагент КАК Контрагент,
		|	Начисления.ДоговорКонтрагента КАК Договор,
		|	Начисления.ВалютаДокумента КАК Валюта,
		|	Начисления.СуммаНДС КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА Начисления.УчитыватьНДС
		|				И НЕ Начисления.СуммаВключаетНДС
		|			ТОГДА Начисления.Сумма + Начисления.СуммаНДС
		|		ИНАЧЕ Начисления.Сумма
		|	КОНЕЦ КАК СуммаРасчетов
		|ИЗ
		|	ТаблицаНачисления КАК Начисления";
		
		Если Параметры.ПоВсемКФО Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Начисления.КФО",
				"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		КонецЕсли;
		Если Параметры.ПоВсемКПС Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Начисления.КПС",
				"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьТабЧастьУслугиОказанные ИЛИ ЕстьТабЧастьСоставЭтапаРабот ИЛИ ЕстьТабЧастьНачисления Тогда
		
		РасчетыПоУслугамРаботам = Запрос.Выполнить().Выгрузить();
		
		СчетРасчетов = ОпределитьСчетРасчетовПоПараметрам(Параметры, "Реализация",
			Документ.Дата, Документ.Организация, Документ.ИФО);
		
		Если Параметры.Свойство("КЭКРасчетов") Тогда
			КЭКРасчетов = Параметры.КЭКРасчетов;
		ИначеЕсли СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("210.05", Документ.Дата, Документ.Организация) Тогда
			КЭКРасчетов = БухгалтерскийУчетПовтИсп.КЭКпоКоду("000");
		ИначеЕсли ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("КЭК", МетаданныеДокумента) Тогда
			КЭКРасчетов = Документ.КЭК;
			Параметры.Вставить("КЭКРасчетов", Документ.КЭК);
		Иначе
			КЭКРасчетов = Справочники.КОСГУ.ПустаяСсылка();
		КонецЕсли;
		
		Для Каждого СтрокаДокумента Из РасчетыПоУслугамРаботам Цикл
			
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
			
			НоваяСтрока.ЭтоПоступление = Ложь;
			
			Если ЗначениеЗаполнено(СчетРасчетов) Тогда
				НоваяСтрока.СчетРасчетов = СчетРасчетов;
			ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.КЭК) Тогда
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(НоваяСтрока.КЭК,
					?(Параметры.Свойство("СчетРасчетов") И ЗначениеЗаполнено(Параметры.СчетРасчетов), Параметры.СчетРасчетов, "205.00"), ,
					Документ.Дата, Документ.Организация, СтрокаДокумента.ИФО);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КЭКРасчетов) Тогда
				НоваяСтрока.КЭК = КЭКРасчетов;
			Иначе
				НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(НоваяСтрока.СчетРасчетов);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СчетРасчетов) Тогда
				ТекстОшибки = НСтр("ru='Невозможно определить счет расчетов с контрагентом по КЭК ""%1"".
					|Проверьте настройки соответствия аналитических счетов КЭК.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
					НоваяСтрока.КЭК);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,
					Документ.Ссылка, , "Объект", Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	// 4. Расчеты по поступлению ОС, НМА, НПА.
	ЕстьТабЧастьКапВложения = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("КапВложения", МетаданныеДокумента);
	Если ЕстьТабЧастьКапВложения Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "КапВложения",
			"НомерСтроки,ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,
			|ВнеоборотныйАктив,СчетУчета,СуммаНДС,Всего",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	КапВложения.НомерСтроки КАК НомерСтроки,
		|	КапВложения.ИФО КАК ИФО,
		|	КапВложения.КФО КАК КФО,
		|	КапВложения.КПС КАК КПС,
		|	КапВложения.Подразделение КАК Подразделение,
		|	КапВложения.Контрагент КАК Контрагент,
		|	КапВложения.Договор КАК Договор,
		|	КапВложения.ВалютаДокумента КАК Валюта,
		|	КапВложения.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
		|	КапВложения.СчетУчета КАК СчетУчета,
		|	КапВложения.СуммаНДС КАК СуммаНДС,
		|	КапВложения.Всего КАК СуммаРасчетов
		|ИЗ
		|	ТаблицаКапВложения КАК КапВложения";
		
		Если Параметры.ПоВсемКФО Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КапВложения.КФО",
				"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		КонецЕсли;
		Если Параметры.ПоВсемКПС Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КапВложения.КПС",
				"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		КонецЕсли;
		
		РасчетыПоОС = Запрос.Выполнить().Выгрузить();
		
		СчетРасчетов = ОпределитьСчетРасчетовПоПараметрам(Параметры, "Поступление",
			Документ.Дата, Документ.Организация, Документ.ИФО);
		
		Для Каждого СтрокаДокумента Из РасчетыПоОС Цикл
			
			// СчетУчета.
			Если НЕ ЗначениеЗаполнено(СтрокаДокумента.СчетУчета) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Счет учета'"),
					СтрокаДокумента.НомерСтроки, "Капитальные вложения");
				ПолеКолонки = "Объект.КапВложения[" + Формат(СтрокаДокумента.НомерСтроки-1, "ЧН=0; ЧГ=") + "].СчетУчета";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
			
			НоваяСтрока.ЭтоПоступление = Истина;
			
			// Счет расчетов.
			Если ЗначениеЗаполнено(СчетРасчетов) Тогда
				НоваяСтрока.СчетРасчетов = СчетРасчетов;
			ИначеЕсли МетаданныеДокумента.Имя = "ПоступлениеОСВПути" Тогда
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("302.31", Документ.Дата, Документ.Организация);
			Иначе
				НоваяСтрока.СчетРасчетов = УчетРасчетов.СчетРасчетовПоПриобретениюВНА(
					СтрокаДокумента.СчетУчета, "302.00", Документ.Дата, Документ.Организация);
			КонецЕсли;
			
			НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(НоваяСтрока.СчетРасчетов);
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СчетРасчетов) Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Невозможно определить счет расчетов с контрагентом для внеоборотного актива ""%1"".
					|Возможно, неверно указан счет учета в строке поступления внеоборотного актива.'"),
					СтрокаДокумента.ВнеоборотныйАктив);
				ПолеКолонки = "Объект.КапВложения[" + Формат(СтрокаДокумента.НомерСтроки-1, "ЧН=0; ЧГ=") + "].СчетУчета";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	// 5. Расчеты по реализованным ОС, НМА, НПА.
	ЕстьТабЧастьОсновныеСредства  = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("ОсновныеСредства", МетаданныеДокумента);
	ЕстьРеализацияОсновныхСредств = (МетаданныеДокумента.Имя = "ПередачаОбъектаОС"
								ИЛИ МетаданныеДокумента.Имя = "ПередачаЗдания");
	
	Если ЕстьТабЧастьОсновныеСредства Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ОсновныеСредства",
			"ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,ОсновноеСредство,СуммаНДС,Всего",
			Документ, Параметры);
			
	ИначеЕсли ЕстьРеализацияОсновныхСредств Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Документ",
			"ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,ОсновноеСредство,СуммаНДС,Всего",
			Документ, Параметры);
		
	КонецЕсли;
	
	Если ЕстьТабЧастьОсновныеСредства ИЛИ ЕстьРеализацияОсновныхСредств Тогда
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	ОсновныеСредства.ИФО КАК ИФО,
		|	ОсновныеСредства.КФО КАК КФО,
		|	ОсновныеСредства.КПС КАК КПС,
		|	ОсновныеСредства.Подразделение КАК Подразделение,
		|	ОсновныеСредства.Контрагент КАК Контрагент,
		|	ОсновныеСредства.Договор КАК Договор,
		|	ОсновныеСредства.ВалютаДокумента КАК Валюта,
		|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ОсновныеСредства.ОсновноеСредство.ВидНФА КАК ВидНФА,
		|	ОсновныеСредства.СуммаНДС КАК СуммаНДС,
		|	ОсновныеСредства.Всего КАК СуммаРасчетов
		|ИЗ
		|	ТаблицаОсновныеСредства КАК ОсновныеСредства";
		Если НЕ ЕстьТабЧастьОсновныеСредства Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОсновныеСредства КАК ОсновныеСредства",
				"Документ КАК ОсновныеСредства");
		КонецЕсли;
		
		Если Параметры.ПоВсемКФО Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОсновныеСредства.КФО",
				"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		КонецЕсли;
		Если Параметры.ПоВсемКПС Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОсновныеСредства.КПС",
				"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		КонецЕсли;
		
		РасчетыПоРеализованнымОС = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаДокумента Из РасчетыПоРеализованнымОС Цикл
			
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
			
			НоваяСтрока.ЭтоПоступление = Ложь;
			
			Если СтрокаДокумента.ВидНФА = Перечисления.ВидыНФА.НПА Тогда
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("205.73", Документ.Дата, Документ.Организация);
			ИначеЕсли СтрокаДокумента.ВидНФА = Перечисления.ВидыНФА.НМА Тогда
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("205.72", Документ.Дата, Документ.Организация);
			Иначе
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("205.71", Документ.Дата, Документ.Организация);
			КонецЕсли;
			
			НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(НоваяСтрока.СчетРасчетов);
			
			Если НЕ Параметры.ПоВсемКПС Тогда
				// В документах реализации в таб.части указан КПС расходов.
				// Для расчетов должен использоваться КПС доходов.
				НоваяСтрока.КПС = Параметры.КПС;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	// 6. Расчеты по поступлению денежных документов.
	Если МетаданныеДокумента.Имя = "ПриходныйОрдерФондовый" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Расшифровка",
			"НомерСтроки,ИФО,КФО,КПС,ПодразделениеКор,КорСчет,Контрагент,Договор,Сумма",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	Расшифровка.НомерСтроки КАК НомерСтроки,
		|	Расшифровка.ИФО КАК ИФО,
		|	Расшифровка.КФО КАК КФО,
		|	Расшифровка.КПС КАК КПС,
		|	Расшифровка.ПодразделениеКор КАК Подразделение,
		|	Расшифровка.КорСчет КАК СчетРасчетов,
		|	Расшифровка.Контрагент КАК Контрагент,
		|	Расшифровка.Договор КАК Договор,
		|	&ВалютаРеглУчета КАК Валюта,
		|	0 КАК СуммаНДС,
		|	Расшифровка.Сумма КАК СуммаРасчетов
		|ИЗ
		|	ТаблицаРасшифровка КАК Расшифровка";
		Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
		
		Если Параметры.ПоВсемКФО Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Расшифровка.КФО",
				"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		КонецЕсли;
		Если Параметры.ПоВсемКПС Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Расшифровка.КПС",
				"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		КонецЕсли;
		
		РасчетыПоДенежнымДокументам = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаДокумента Из РасчетыПоДенежнымДокументам Цикл
			
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
			
			НоваяСтрока.ЭтоПоступление = Истина;
			
			НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(НоваяСтрока.СчетРасчетов);
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	// 7. Расчеты по перечислению средств в финансовые вложения.
	Если МетаданныеДокумента.Имя = "ФормированиеВложенийВФинансовыеАктивы" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ВложенияВФинансовыеАктивы",
			"НомерСтроки,ИФО,КФО,КПС,Подразделение,СчетУчета,Контрагент,Договор,ВалютаДокумента,Сумма",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	ВложенияВФинансовыеАктивы.НомерСтроки КАК НомерСтроки,
		|	ВложенияВФинансовыеАктивы.ИФО КАК ИФО,
		|	ВложенияВФинансовыеАктивы.КФО КАК КФО,
		|	ВложенияВФинансовыеАктивы.КПС КАК КПС,
		|	ВложенияВФинансовыеАктивы.Подразделение КАК Подразделение,
		|	ВложенияВФинансовыеАктивы.СчетУчета КАК СчетУчета,
		|	ВложенияВФинансовыеАктивы.Контрагент КАК Контрагент,
		|	ВложенияВФинансовыеАктивы.Договор КАК Договор,
		|	ВложенияВФинансовыеАктивы.ВалютаДокумента КАК Валюта,
		|	0 КАК СуммаНДС,
		|	ВложенияВФинансовыеАктивы.Сумма КАК СуммаРасчетов
		|ИЗ
		|	ТаблицаВложенияВФинансовыеАктивы КАК ВложенияВФинансовыеАктивы";
		
		Если Параметры.ПоВсемКФО Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Расшифровка.КФО",
				"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		КонецЕсли;
		Если Параметры.ПоВсемКПС Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Расшифровка.КПС",
				"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			НоваяСтрока.ЭтоПоступление = Истина;
			
			НоваяСтрока.СчетРасчетов = УчетФинансовыхВложений.СчетРасчетовПоСчетуУчетаВложенийВФинансовыеАктивы(
				Выборка.СчетУчета, Документ.Дата, Документ.Организация);
			НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(НоваяСтрока.СчетРасчетов);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// 8. Расчеты по реализации финансовых вложений.
	Если МетаданныеДокумента.Имя = "ВыбытиеФинансовыхВложений" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Документ",
			"ИФО,КФО,КПС,Подразделение,СчетУчета,Контрагент,Договор,ВалютаДокумента,СуммаРеализации",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	1 КАК НомерСтроки,
		|	ВыбытиеФинансовыхВложений.ИФО КАК ИФО,
		|	ВыбытиеФинансовыхВложений.КФО КАК КФО,
		|	ВыбытиеФинансовыхВложений.КПС КАК КПС,
		|	ВыбытиеФинансовыхВложений.Подразделение КАК Подразделение,
		|	ВыбытиеФинансовыхВложений.СчетУчета КАК СчетУчета,
		|	ВыбытиеФинансовыхВложений.Контрагент КАК Контрагент,
		|	ВыбытиеФинансовыхВложений.Договор КАК Договор,
		|	ВыбытиеФинансовыхВложений.ВалютаДокумента КАК Валюта,
		|	0 КАК СуммаНДС,
		|	ВыбытиеФинансовыхВложений.СуммаРеализации КАК СуммаРасчетов
		|ИЗ
		|	Документ КАК ВыбытиеФинансовыхВложений";
		
		Если Параметры.ПоВсемКФО Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВыбытиеФинансовыхВложений.КФО",
				"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		КонецЕсли;
		Если Параметры.ПоВсемКПС Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВыбытиеФинансовыхВложений.КПС",
				"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			НоваяСтрока.ЭтоПоступление = Ложь;
			
			НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("205.75", Документ.Дата, Документ.Организация);
			
			Если Параметры.Свойство("КЭКРасчетов") И ЗначениеЗаполнено(Параметры.КЭКРасчетов) Тогда
				НоваяСтрока.КЭК = Параметры.КЭКРасчетов;
			Иначе
				НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(НоваяСтрока.СчетРасчетов);
			КонецЕсли;
			
			НоваяСтрока.КПС = Параметры.КПС;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаРасчетов.Свернуть("ЭтоПоступление,ИФО,КФО,КПС,КЭК,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта",
		"СуммаНДС,СуммаРасчетов");
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

Функция ПустаяТаблицаЗачетАвансовПоДокументу()
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ТаблицаЗачетаАвансов = Новый ТаблицаЗначений;
	// Идентификация строки.
	ТаблицаЗачетаАвансов.Колонки.Добавить("НомерСтроки",    Новый ОписаниеТипов("Число"));
	// Признак поступления ценностей: материальных запасов, услуг и пр.
	ТаблицаЗачетаАвансов.Колонки.Добавить("ЭтоПоступление", Новый ОписаниеТипов("Булево"));
	// Общие разрезы учета.
	ТаблицаЗачетаАвансов.Колонки.Добавить("ИФО",            Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаЗачетаАвансов.Колонки.Добавить("КФО",            Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаЗачетаАвансов.Колонки.Добавить("КПС",            Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаЗачетаАвансов.Колонки.Добавить("Подразделение",  Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Счет и аналитика учета расчетов с контрагентами.
	ТаблицаЗачетаАвансов.Колонки.Добавить("КЭК",            Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаЗачетаАвансов.Колонки.Добавить("СчетРасчетов",   Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаЗачетаАвансов.Колонки.Добавить("СчетАвансов",    Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаЗачетаАвансов.Колонки.Добавить("Контрагент",     Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаЗачетаАвансов.Колонки.Добавить("Договор",        Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ТаблицаЗачетаАвансов.Колонки.Добавить("Валюта",         Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаЗачетаАвансов.Колонки.Добавить("ДокументАванса", ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов.ТипЗначения);
	// Сумма расчетов для зачета авансов.
	ТаблицаЗачетаАвансов.Колонки.Добавить("СуммаРасчетов",  ОписаниеТипаСуммы);
	
	Возврат ТаблицаЗачетаАвансов;
	
КонецФункции

// Подготавливает таблицу документа (в унифицированном формате) для отражения зачета авансов по документам.
//
Функция ПодготовитьТаблицуЗачетАвансовПоДокументу(Документ, Параметры = Неопределено) Экспорт
	
	ТаблицаЗачетаАвансов = ПустаяТаблицаЗачетАвансовПоДокументу();
	
	МетаданныеДокумента = Документ.Метаданные();
	Если НЕ ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("СпособЗачетаАванса", МетаданныеДокумента)
	 ИЛИ НЕ ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("ЗачетАвансов", МетаданныеДокумента) Тогда
		Возврат ТаблицаЗачетаАвансов;
	ИначеЕсли Документ.СпособЗачетаАванса <> Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
		Возврат ТаблицаЗачетаАвансов;
	КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ЗачетАвансов",
		"НомерСтроки,ИФО,КФО,КПС,КЭК,Подразделение,Контрагент,Договор,ВалютаДокумента,ДокументАванса,СуммаЗачета",
		Документ, Параметры);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	ЗачетАвансов.НомерСтроки КАК НомерСтроки,
	|	ЗачетАвансов.ИФО КАК ИФО,
	|	ЗачетАвансов.КФО КАК КФО,
	|	ЗачетАвансов.КПС КАК КПС,
	|	ЗачетАвансов.КЭК КАК КЭК,
	|	ЗачетАвансов.Подразделение КАК Подразделение,
	|	ЗачетАвансов.Контрагент КАК Контрагент,
	|	ЗачетАвансов.Договор КАК Договор,
	|	ЗачетАвансов.ВалютаДокумента КАК Валюта,
	|	ЗачетАвансов.ДокументАванса КАК ДокументАванса,
	|	ЗачетАвансов.СуммаЗачета КАК СуммаРасчетов
	|ИЗ
	|	ТаблицаЗачетАвансов КАК ЗачетАвансов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если НЕ ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗачетАвансов.ВалютаДокумента", "&ВалютаРеглУчета");
		Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаЗачетаАвансов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(Выборка.КЭК,
			"302.00", , Документ.Дата, Документ.Организация, Выборка.ИФО); // Пока зачет авансов по документам (ручной) предусмотрен только для авансов, выданных поставщикам.
		
		// Счет авансов определим по счету расчетов.
		НоваяСтрока.СчетАвансов = УчетРасчетов.ОпределитьСчетАвансов(НоваяСтрока.СчетРасчетов, Документ.Дата, Документ.Организация);
		
		НоваяСтрока.ЭтоПоступление = БухгалтерскийУчет.СчетВИерархии(НоваяСтрока.СчетРасчетов, "302.00");
		
	КонецЦикла;
	
	Возврат ТаблицаЗачетаАвансов;
	
КонецФункции

// Подготавливает таблицу документа (в унифицированном формате) для отражения расчетов с таможней.
//
Функция ПодготовитьТаблицуРасчетовПоДокументуГТДИмпорт(ТаблицаРасчетов, Документ, Параметры, Отказ)
	
	Запрос = Новый Запрос;
	НомераТаблиц = Новый Структура;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Документ",
		"ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,ВалютаДокумента,
		|ТаможенныйСбор,ТаможенныйСборВал,
		|ТаможенныйШтраф,ТаможенныйШтрафВал",
		Документ, Параметры);
	НомераТаблиц.Вставить("ШапкаДокумента", НомераТаблиц.Количество());
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Разделы",
		"НомерСтроки,НДСВВалюте,ПошлинаВВалюте",
		Документ, Параметры, "НомерСтроки");
	НомераТаблиц.Вставить("ТаблицаРазделы", НомераТаблиц.Количество());
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Материалы",
		"ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,НомерРаздела,
		|УчитыватьНДС,СчетРасчетовНДС,СуммаНДС,
		|СчетРасчетов,СуммаПошлины",
		Документ, Параметры, "НомерРаздела");
	НомераТаблиц.Вставить("ТаблицаМатериалы", НомераТаблиц.Количество());
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ОсновныеСредства",
		"ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,НомерРаздела,
		|УчитыватьНДС,СчетРасчетовНДС,СуммаНДС,
		|СчетРасчетов,СуммаПошлины",
		Документ, Параметры, "НомерРаздела");
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	""Сбор"" КАК ВидТаможенныхПлатежей,
	|	СборыРуб.ИФО КАК ИФО,
	|	СборыРуб.КФО КАК КФО,
	|	СборыРуб.КПС КАК КПС,
	|	СборыРуб.Подразделение КАК Подразделение,
	|	СборыРуб.СчетРасчетов КАК СчетРасчетов,
	|	СборыРуб.Контрагент КАК Контрагент,
	|	СборыРуб.Договор КАК Договор,
	|	&ВалютаРеглУчета КАК Валюта,
	|	0 КАК СуммаНДС,
	|	СборыРуб.ТаможенныйСбор КАК СуммаРасчетов
	|ИЗ
	|	Документ КАК СборыРуб
	|ГДЕ
	|	СборыРуб.ТаможенныйСбор <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Сбор"",
	|	СборыВал.ИФО,
	|	СборыВал.КФО,
	|	СборыВал.КПС,
	|	СборыВал.Подразделение,
	|	СборыВал.СчетРасчетов,
	|	СборыВал.Контрагент,
	|	СборыВал.Договор,
	|	СборыВал.ВалютаДокумента,
	|	0,
	|	СборыВал.ТаможенныйСборВал
	|ИЗ
	|	Документ КАК СборыВал
	|ГДЕ
	|	СборыВал.ТаможенныйСборВал <> 0";
	НомераТаблиц.Вставить("ТаможенныеСборы", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	""Штраф"" КАК ВидТаможенныхПлатежей,
	|	ШтрафыРуб.ИФО КАК ИФО,
	|	ШтрафыРуб.КФО КАК КФО,
	|	ШтрафыРуб.КПС КАК КПС,
	|	ШтрафыРуб.Подразделение КАК Подразделение,
	|	ШтрафыРуб.СчетРасчетов КАК СчетРасчетов,
	|	ШтрафыРуб.Контрагент КАК Контрагент,
	|	ШтрафыРуб.Договор КАК Договор,
	|	&ВалютаРеглУчета КАК Валюта,
	|	0 КАК СуммаНДС,
	|	ШтрафыРуб.ТаможенныйШтраф КАК СуммаРасчетов
	|ИЗ
	|	Документ КАК ШтрафыРуб
	|ГДЕ
	|	ШтрафыРуб.ТаможенныйШтраф <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Штраф"",
	|	ШтрафыВал.ИФО,
	|	ШтрафыВал.КФО,
	|	ШтрафыВал.КПС,
	|	ШтрафыВал.Подразделение,
	|	ШтрафыВал.СчетРасчетов,
	|	ШтрафыВал.Контрагент,
	|	ШтрафыВал.Договор,
	|	ШтрафыВал.ВалютаДокумента,
	|	0,
	|	ШтрафыВал.ТаможенныйШтрафВал
	|ИЗ
	|	Документ КАК ШтрафыВал
	|ГДЕ
	|	ШтрафыВал.ТаможенныйШтрафВал <> 0";
	НомераТаблиц.Вставить("ТаможенныеШтрафы", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	""Пошлина"" КАК ВидТаможенныхПлатежей,
	|	Материалы.ИФО КАК ИФО,
	|	Материалы.КФО КАК КФО,
	|	Материалы.КПС КАК КПС,
	|	Материалы.Подразделение КАК Подразделение,
	|	Материалы.СчетРасчетов КАК СчетРасчетов,
	|	Материалы.Контрагент КАК Контрагент,
	|	Материалы.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.ПошлинаВВалюте, ЛОЖЬ)
	|			ТОГДА Материалы.ВалютаДокумента
	|		ИНАЧЕ &ВалютаРеглУчета
	|	КОНЕЦ КАК Валюта,
	|	0 КАК СуммаНДС,
	|	Материалы.СуммаПошлины КАК СуммаРасчетов
	|ИЗ
	|	ТаблицаМатериалы КАК Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРазделы КАК Разделы
	|		ПО Материалы.НомерРаздела = Разделы.НомерСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""НДС"",
	|	Материалы.ИФО,
	|	Материалы.КФО,
	|	Материалы.КПС,
	|	Материалы.Подразделение,
	|	Материалы.СчетРасчетовНДС,
	|	Материалы.Контрагент,
	|	Материалы.Договор,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.НДСВВалюте, ЛОЖЬ)
	|			ТОГДА Материалы.ВалютаДокумента
	|		ИНАЧЕ &ВалютаРеглУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Материалы.УчитыватьНДС
	|			ТОГДА Материалы.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Материалы.УчитыватьНДС
	|			ТОГДА Материалы.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ТаблицаМатериалы КАК Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРазделы КАК Разделы
	|		ПО Материалы.НомерРаздела = Разделы.НомерСтроки";
	НомераТаблиц.Вставить("ПошлиныНДСПоМатериалам", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	""Пошлина"" КАК ВидТаможенныхПлатежей,
	|	ОсновныеСредства.ИФО КАК ИФО,
	|	ОсновныеСредства.КФО КАК КФО,
	|	ОсновныеСредства.КПС КАК КПС,
	|	ОсновныеСредства.Подразделение КАК Подразделение,
	|	ОсновныеСредства.СчетРасчетов КАК СчетРасчетов,
	|	ОсновныеСредства.Контрагент КАК Контрагент,
	|	ОсновныеСредства.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.ПошлинаВВалюте, ЛОЖЬ)
	|			ТОГДА ОсновныеСредства.ВалютаДокумента
	|		ИНАЧЕ &ВалютаРеглУчета
	|	КОНЕЦ КАК Валюта,
	|	0 КАК СуммаНДС,
	|	ОсновныеСредства.СуммаПошлины КАК СуммаРасчетов
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРазделы КАК Разделы
	|		ПО ОсновныеСредства.НомерРаздела = Разделы.НомерСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""НДС"",
	|	ОсновныеСредства.ИФО,
	|	ОсновныеСредства.КФО,
	|	ОсновныеСредства.КПС,
	|	ОсновныеСредства.Подразделение,
	|	ОсновныеСредства.СчетРасчетовНДС,
	|	ОсновныеСредства.Контрагент,
	|	ОсновныеСредства.Договор,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.НДСВВалюте, ЛОЖЬ)
	|			ТОГДА ОсновныеСредства.ВалютаДокумента
	|		ИНАЧЕ &ВалютаРеглУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.УчитыватьНДС
	|			ТОГДА ОсновныеСредства.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.УчитыватьНДС
	|			ТОГДА ОсновныеСредства.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРазделы КАК Разделы
	|		ПО ОсновныеСредства.НомерРаздела = Разделы.НомерСтроки";
	НомераТаблиц.Вставить("ПошлиныНДСПоОсновнымСредствам", НомераТаблиц.Количество());
	
	Если Параметры.ПоВсемКФО Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СборыРуб.КФО",
			"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СборыВал.КФО",
			"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ШтрафыРуб.КФО",
			"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ШтрафыВал.КФО",
			"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Материалы.КФО",
			"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОсновныеСредства.КФО",
			"ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)");
	КонецЕсли;
	Если Параметры.ПоВсемКПС Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СборыРуб.КПС",
			"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СборыВал.КПС",
			"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ШтрафыРуб.КПС",
			"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ШтрафыВал.КПС",
			"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Материалы.КПС",
			"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОсновныеСредства.КПС",
			"ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаможенныеСборы = Результат[НомераТаблиц.ТаможенныеСборы].Выгрузить();
	Для Каждого СтрокаТаблицы Из ТаможенныеСборы Цикл
		
		НоваяСтрока = ТаблицаРасчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.ЭтоПоступление = Истина;
		
	КонецЦикла;
	
	ТаможенныеШтрафы = Результат[НомераТаблиц.ТаможенныеШтрафы].Выгрузить();
	Для Каждого СтрокаТаблицы Из ТаможенныеШтрафы Цикл
		
		НоваяСтрока = ТаблицаРасчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.ЭтоПоступление = Истина;
		
	КонецЦикла;
	
	ПошлиныНДСПоМатериалам = Результат[НомераТаблиц.ПошлиныНДСПоМатериалам].Выгрузить();
	Для Каждого СтрокаТаблицы Из ПошлиныНДСПоМатериалам Цикл
		
		НоваяСтрока = ТаблицаРасчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.ЭтоПоступление = Истина;
		
	КонецЦикла;
	
	ПошлиныНДСПоОсновнымСредствам = Результат[НомераТаблиц.ПошлиныНДСПоОсновнымСредствам].Выгрузить();
	Для Каждого СтрокаТаблицы Из ПошлиныНДСПоОсновнымСредствам Цикл
		
		НоваяСтрока = ТаблицаРасчетов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.ЭтоПоступление = Истина;
		
	КонецЦикла;
	
	ТаблицаРасчетов.Свернуть("ЭтоПоступление,ИФО,КФО,КПС,КЭК,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта",
		"СуммаНДС,СуммаРасчетов");
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

// Остатки авансов (выданных и полученных).

Функция ОстаткиАвансов(Период, ТаблицаДокумента, Реквизиты) Экспорт
	
	Если ТаблицаДокумента.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	ИначеЕсли Реквизиты.Свойство("СпособЗачетаАванса")
			И Реквизиты.СпособЗачетаАванса = Перечисления.СпособыЗачетаАвансов.НеЗачитывать Тогда
		Возврат Новый ТаблицаЗначений; // Не нужно зачитывать авансы.
	КонецЕсли;
	Если НЕ Реквизиты.Свойство("ПоВсемКФО") Тогда
		Реквизиты.Вставить("ПоВсемКФО", Ложь);
	КонецЕсли;
	Если НЕ Реквизиты.Свойство("ПоВсемКПС") Тогда
		Реквизиты.Вставить("ПоВсемКПС", Ложь);
	КонецЕсли;
	
	УчитыватьКорректировку = Реквизиты.Свойство("КорректируемыйДокумент");
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МоментВремени", Период);
	Запрос.УстановитьПараметр("Организация",   Реквизиты.Организация);
	
	Запрос.УстановитьПараметр("ИспользоватьВалютныйУчет", ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	Запрос.УстановитьПараметр("УчитыватьЗадолженностьЕНВД",
		?(Реквизиты.Свойство("УчитыватьЗадолженностьЕНВД"), Реквизиты.УчитыватьЗадолженностьЕНВД, Ложь));
	
	ПараметрыОтбора = ПараметрыОтбораОстатковАвансов(ТаблицаДокумента, Реквизиты);
	КолонкиПараметровУчета = 
		"УчетПоИФО, УчетПоКПС, УчетПоКЭК, УчетПоПодразделениям, ПоВсемКФО, ПоВсемКПС,
		|КонтрагентЕстьСубконто,ДоговорЕстьСубконто,
		|ДопАналитикаЕстьСубконто,ДопАналитикаВидСубконто, АвансыПоДебету";
	ТаблицаПараметровУчета = ПараметрыОтбора.Скопировать();
	ТаблицаПараметровУчета.Свернуть(КолонкиПараметровУчета);
	ТаблицаПараметровУчета.Колонки.Добавить("НомераСубконто", Новый ОписаниеТипов("Соответствие"));
	
	// Блокируем регистр бухгалтерии для получения остатков.
	УстанавливатьБлокировку = ?(Реквизиты.Свойство("ТиповаяОперация"), Реквизиты.ТиповаяОперация.УстанавливатьБлокировку, Ложь);
	Если УстанавливатьБлокировку Тогда
		
	КонецЕсли;
	
	// Текст запроса по остаткам формируется для каждого набора параметров учета расчетов.
	ТекстОбщегоЗапроса = "";
	Для НомерЗапроса=1 По ТаблицаПараметровУчета.Количество() Цикл
		
		НаборПараметровУчета = ТаблицаПараметровУчета[НомерЗапроса-1];
		
		Если НЕ НаборПараметровУчета.КонтрагентЕстьСубконто Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСубконто = Новый Массив;
		
		// Контрагент.
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
		НаборПараметровУчета.НомераСубконто.Вставить("Контрагент", 1);
		
		// Договор.
		Если НаборПараметровУчета.ДоговорЕстьСубконто Тогда
			
			МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
			НаборПараметровУчета.НомераСубконто.Вставить("Договор",
				НаборПараметровУчета.НомераСубконто.Количество() + 1);
			
		КонецЕсли;
		
		// ДопАналитика (документ расчетов или др.).
		Если НаборПараметровУчета.ДопАналитикаЕстьСубконто Тогда
			
			МассивСубконто.Добавить(НаборПараметровУчета.ДопАналитикаВидСубконто);
			НаборПараметровУчета.НомераСубконто.Вставить("ДопАналитика",
				НаборПараметровУчета.НомераСубконто.Количество() + 1);
			
		КонецЕсли;
		
		// Добавляем виртуальную таблицу.
		ТекстЗапроса = ТекстЗапросаОстаткиАвансов(НаборПараметровУчета, НомерЗапроса);
		Если УчитыватьКорректировку Тогда
			ТекстЗапросаКорректировки = ТекстЗапросаЗачетАвансаВКорректируемыхДокументах(НаборПараметровУчета, НомерЗапроса);
			ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все") + ТекстЗапросаКорректировки;
			Запрос.УстановитьПараметр("КорректируемыйДокумент", КорректируемыеДокументы(Реквизиты.КорректируемыйДокумент, Реквизиты.НомерКорректировки));
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
		
		// Устанавливаем параметры виртуальной таблицы.
		Отбор = Новый Структура(КолонкиПараметровУчета);
		ЗаполнитьЗначенияСвойств(Отбор, НаборПараметровУчета);
		ОтборОстатков = ПараметрыОтбора.Скопировать(Отбор);
		
		Запрос.УстановитьПараметр("Счета" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("СчетОстатков")) );
		Запрос.УстановитьПараметр("ИФО" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("ИФО")) );
		Запрос.УстановитьПараметр("КФО" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("КФО")) );
		Запрос.УстановитьПараметр("КПС" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("КПС")) );
		Запрос.УстановитьПараметр("КЭК" + НомерЗапроса,
			ДополнитьГрупповымКЭК440(ОтборОстатков.ВыгрузитьКолонку("КЭК")) );
		Запрос.УстановитьПараметр("Подразделение" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("Подразделение")) );
		Запрос.УстановитьПараметр("Контрагенты" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("Контрагент")) );
		Запрос.УстановитьПараметр("Договоры" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("Договор")) );
		Запрос.УстановитьПараметр("УчетПоПодразделениям" + НомерЗапроса,
			НаборПараметровУчета.УчетПоПодразделениям);
		Запрос.УстановитьПараметр("УчетПоКПС" + НомерЗапроса,
			НаборПараметровУчета.УчетПоКПС);
		Запрос.УстановитьПараметр("ДопАналитикаВидСубконто" + НомерЗапроса,
			НаборПараметровУчета.ДопАналитикаВидСубконто);
		
		Запрос.УстановитьПараметр("Субконто" + НомерЗапроса, МассивСубконто);
		
		// Соединение виртуальных таблиц.
		Если НЕ ПустаяСтрока(ТекстОбщегоЗапроса) Тогда
			ТекстОбщегоЗапроса = ТекстОбщегоЗапроса + "
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|";
		КонецЕсли;
		
		ТекстОбщегоЗапроса = ТекстОбщегоЗапроса +
		"ВЫБРАТЬ
		|	ТаблицаОстаткиАвансов_НомерЗапроса.СчетАвансов КАК СчетАвансов,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.УчетПоПодразделениям КАК УчетПоПодразделениям,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.УчетПоКПС КАК УчетПоКПС,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.ИФО КАК ИФО,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.КФО КАК КФО,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.КПС КАК КПС,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.КЭК КАК КЭК,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.Подразделение КАК Подразделение,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.Контрагент КАК Контрагент,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.Договор КАК Договор,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.ДопСубконтоАвансов КАК ДопСубконтоАвансов,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.ВидДопСубконтоАвансов КАК ВидДопСубконтоАвансов,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.Валюта КАК Валюта,
		|	СУММА(ТаблицаОстаткиАвансов_НомерЗапроса.СуммаРасчетов) КАК СуммаРасчетов,
		|	СУММА(ТаблицаОстаткиАвансов_НомерЗапроса.СуммаРуб) КАК СуммаРуб,
		|	СУММА(ТаблицаОстаткиАвансов_НомерЗапроса.СуммаЕНВДРуб) КАК СуммаЕНВДРуб
		|ИЗ
		|	ОстаткиАвансов_НомерЗапроса КАК ТаблицаОстаткиАвансов_НомерЗапроса
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОстаткиАвансов_НомерЗапроса.СчетАвансов,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.УчетПоПодразделениям,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.УчетПоКПС,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.ИФО,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.КФО,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.КПС,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.КЭК,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.Подразделение,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.Контрагент,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.Договор,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.ДопСубконтоАвансов,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.ВидДопСубконтоАвансов,
		|	ТаблицаОстаткиАвансов_НомерЗапроса.Валюта";
		
		ТекстОбщегоЗапроса = СтрЗаменить(ТекстОбщегоЗапроса, "_НомерЗапроса", Строка(НомерЗапроса));
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + ТекстОбщегоЗапроса;
	Если ПустаяСтрока(Запрос.Текст) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ОстаткиАвансов = Запрос.Выполнить().Выгрузить();
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиАвансов, "ДопСубконтоАвансов", "ДатаДокументаАвансов");
	
	Возврат ОстаткиАвансов;
	
КонецФункции

Функция ДополнитьГрупповымКЭК440(НачальныеКЭК)
	
	ГрупповойКЭК = БухгалтерскийУчетПовтИсп.КЭКпоКоду("440");
	ДетальныеКЭК440 = ПолучитьДетальныеКЭК440();
	
	НовыеКЭК = Новый Соответствие;
	Для Каждого КЭК Из НачальныеКЭК Цикл
		
		НовыеКЭК.Вставить(КЭК);
		Если ДетальныеКЭК440.Получить(КЭК) <> Неопределено Тогда
			НовыеКЭК.Вставить(ГрупповойКЭК);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Массив;
	Для Каждого КлючЗначение Из НовыеКЭК Цикл
		Результат.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыОтбораОстатковАвансов(ТаблицаДокумента, Реквизиты)
	
	ПараметрыОтбора = ТаблицаДокумента.СкопироватьКолонки("ИФО,КФО,КПС,КЭК,Подразделение,Контрагент,Договор,СчетРасчетов");
	ПараметрыОтбора.Колонки.Добавить("СчетОстатков", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		Отбор = ПараметрыОтбора.Добавить();
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаДокумента);
		Отбор.СчетОстатков = СтрокаДокумента.СчетАвансов;
		
		Если СтрокаДокумента.СчетРасчетов <> СтрокаДокумента.СчетАвансов Тогда
			Отбор = ПараметрыОтбора.Добавить();
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаДокумента);
			Отбор.СчетОстатков = СтрокаДокумента.СчетРасчетов;
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОтбора.Колонки.Добавить("УчетПоИФО",            Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("УчетПоКПС",            Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("УчетПоКЭК",            Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("УчетПоПодразделениям", Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("ПоВсемКФО",            Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("ПоВсемКПС",            Новый ОписаниеТипов("Булево"));
	
	ПараметрыОтбора.Колонки.Добавить("КонтрагентЕстьСубконто",   Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("ДоговорЕстьСубконто",      Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("ДопАналитикаЕстьСубконто", Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("ДопАналитикаВидСубконто",  Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто"));
	ПараметрыОтбора.Колонки.Добавить("АвансыПоДебету",           Новый ОписаниеТипов("Булево"));
	
	Для Каждого Отбор Из ПараметрыОтбора Цикл
		
		СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Отбор.СчетОстатков);
		СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Отбор.СчетРасчетов);
		
		Отбор.УчетПоИФО = Реквизиты.ИспользоватьУчетПоИФО;
		Отбор.УчетПоКПС = СвойстваСчета.УчетПоКПС;
		Отбор.ПоВсемКФО = Реквизиты.ПоВсемКФО;
		Отбор.ПоВсемКПС = Реквизиты.ПоВсемКПС;
		
		ЭтоЗабалансовыйСчетАвансовПолученных = БухгалтерскийУчет.СчетВИерархии(Отбор.СчетОстатков, "АП");
		Отбор.АвансыПоДебету = ЭтоЗабалансовыйСчетАвансовПолученных ИЛИ БухгалтерскийУчет.СчетВИерархии(Отбор.СчетОстатков, "205.00");;
		
		// Отбор остатков по КЭК выполняется только для авансов полученных на забалансовом счете АП.
		// На остальных счетах КЭК либо не используются, либо используются КЭК "Увеличение/уменьшение задолженности".
		Отбор.УчетПоКЭК = ЭтоЗабалансовыйСчетАвансовПолученных;
		
		Отбор.УчетПоПодразделениям = Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчета.УчетПоПодразделениям;
		Если ЭтоЗабалансовыйСчетАвансовПолученных И НЕ СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
			// Если на счете расчетов учет по подразделениям не ведется,
			// остатки авансов полученных по забалансовому счету АП будут учтены по пустому подразделению.
			Отбор.Подразделение = Справочники.Подразделения.ПустаяСсылка();
		КонецЕсли;
		
		Для Индекс = 1 По СвойстваСчета.КоличествоСубконто Цикл
		
			ВидСубконто = СвойстваСчета["ВидСубконто" + Индекс];
			Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты Тогда
				Отбор.КонтрагентЕстьСубконто = Истина;
				
			ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Договоры Тогда
				Отбор.ДоговорЕстьСубконто = Истина;
				
			Иначе
				Отбор.ДопАналитикаЕстьСубконто = Истина;
				Отбор.ДопАналитикаВидСубконто  = ВидСубконто;
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПараметрыОтбора;
	
КонецФункции

Функция ТекстЗапросаОстаткиАвансов(ПараметрыУчета, НомерЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Остатки.Счет КАК СчетАвансов,
	|	&УчетПоПодразделениям_НомерЗапроса КАК УчетПоПодразделениям,
	|	&УчетПоКПС_НомерЗапроса КАК УчетПоКПС,
	|	Остатки.ИФО КАК ИФО,
	|	Остатки.КФО КАК КФО,
	|	Остатки.КПС КАК КПС,
	|	Остатки.КЭК КАК КЭК,
	|	Остатки.Подразделение КАК Подразделение,
	|	&ОстаткиКонтрагент КАК Контрагент,
	|	&ОстаткиДоговор КАК Договор,
	|	&ОстаткиДопАналитика КАК ДопСубконтоАвансов,
	|	&ДопАналитикаВидСубконто_НомерЗапроса КАК ВидДопСубконтоАвансов,
	|	ЕСТЬNULL(Остатки.Валюта, &ВалютаРеглУчета) КАК Валюта,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет
	|				И Остатки.Счет.Валютный
	|			ТОГДА Остатки.ВалютнаяСуммаОстаток
	|		ИНАЧЕ Остатки.СуммаОстаток
	|	КОНЕЦ КАК СуммаРасчетов,
	|	Остатки.СуммаОстаток КАК СуммаРуб,
	|	ВЫБОР
	|		КОГДА &УчитыватьЗадолженностьЕНВД
	|				И Остатки.Счет.НалоговыйУчетЕНВД
	|			ТОГДА Остатки.СуммаЕНВДОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЕНВДРуб
	|ПОМЕСТИТЬ ОстаткиАвансов_НомерЗапроса
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&МоментВремени,
	|			Счет В (&Счета_НомерЗапроса),
	|			&Субконто_НомерЗапроса,
	|			Организация = &Организация
	|				И &УсловиеПоИФО
	|				И &УсловиеПоКФО
	|				И &УсловиеПоКонтрагентам
	|				И &УсловиеПоДоговорам
	|				И &УсловиеПоКПС
	|				И &УсловиеПоКЭК
	|				И &УсловиеПоПодразделению) КАК Остатки";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоИФО",
		?(ПараметрыУчета.УчетПоИФО, "ИФО В (&ИФО_НомерЗапроса)", "ИСТИНА") );
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКФО",
		?(НЕ ПараметрыУчета.ПоВсемКФО, "КФО В (&КФО_НомерЗапроса)", "ИСТИНА") );
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКПС",
		?(ПараметрыУчета.УчетПоКПС И НЕ ПараметрыУчета.ПоВсемКПС, "КПС В (&КПС_НомерЗапроса)", "ИСТИНА") );
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКЭК",
		?(ПараметрыУчета.УчетПоКЭК, "КЭК В (&КЭК_НомерЗапроса)", "ИСТИНА") );
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоПодразделению",
		?(ПараметрыУчета.УчетПоПодразделениям, "Подразделение В (&Подразделение_НомерЗапроса)", "ИСТИНА") );
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКонтрагентам",
		"Субконто"+ПараметрыУчета.НомераСубконто["Контрагент"]+" В (&Контрагенты_НомерЗапроса)");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДоговорам",
		?(ПараметрыУчета.ДоговорЕстьСубконто,
		"Субконто"+ПараметрыУчета.НомераСубконто["Договор"]+" В (&Договоры_НомерЗапроса)", "ИСТИНА") );
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстаткиКонтрагент",
		"Остатки.Субконто"+ПараметрыУчета.НомераСубконто["Контрагент"]);
	Если ПараметрыУчета.ДоговорЕстьСубконто Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстаткиДоговор",
			"Остатки.Субконто"+ПараметрыУчета.НомераСубконто["Договор"]);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстаткиДоговор",
			"НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	Если ПараметрыУчета.ДопАналитикаЕстьСубконто Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстаткиДопАналитика",
			"ЕСТЬNULL(Остатки.Субконто"+ПараметрыУчета.НомераСубконто["ДопАналитика"] + ", НЕОПРЕДЕЛЕНО)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОстаткиДопАналитика",
			"НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	
	Если НЕ ПараметрыУчета.УчетПоКЭК Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Остатки.КЭК", "ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)");
	КонецЕсли;
	Если НЕ ПараметрыУчета.УчетПоКПС Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Остатки.КПС", "ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
	КонецЕсли;
	Если НЕ ПараметрыУчета.УчетПоИФО Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Остатки.ИФО", "ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");
	КонецЕсли;
	Если НЕ ПараметрыУчета.УчетПоПодразделениям Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Остатки.Подразделение", "ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_НомерЗапроса", Строка(НомерЗапроса));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗачетАвансаВКорректируемыхДокументах(ПараметрыУчета, НомерЗапроса)
	
	Если ПараметрыУчета.АвансыПоДебету Тогда
		Возврат ТекстЗапросаЗачетАвансаВКорректируемыхДокументахДт(ПараметрыУчета, НомерЗапроса);
	Иначе
		Возврат ТекстЗапросаЗачетАвансаВКорректируемыхДокументахКт(ПараметрыУчета, НомерЗапроса);
	КонецЕсли;

КонецФункции

Функция ТекстЗапросаЗачетАвансаВКорректируемыхДокументахКт(ПараметрыУчета, НомерЗапроса)
	
	ТекстЗапросаЗачетАванса = ЧастьТекстаЗапросаЗачетАвансаВКорректируемыхДокументах(1, "СчетКт");
	ТекстЗапросаЗачетАванса = СтрЗаменить(ТекстЗапросаЗачетАванса, "&УсловиеСчет", "СчетКт В (&Счета_НомерЗапроса)");
	
	ТекстЗапросаРасчеты = ЧастьТекстаЗапросаЗачетАвансаВКорректируемыхДокументах(-1, "СчетДт");
	ТекстЗапросаРасчеты = СтрЗаменить(ТекстЗапросаРасчеты, "&УсловиеСчет", "СчетКт В (&Счета1) И СчетДт В (&Счета1)");
	
	ТекстЗапроса = ТекстЗапросаЗачетАванса + ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все") + ТекстЗапросаРасчеты;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоИФО",
		?(ПараметрыУчета.УчетПоИФО, "ИФО В (&ИФО_НомерЗапроса)", "ИСТИНА") );
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКФО",
		?(НЕ ПараметрыУчета.ПоВсемКФО, "КФО В (&КФО_НомерЗапроса)", "ИСТИНА") );
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКПС",
		?(ПараметрыУчета.УчетПоКПС И НЕ ПараметрыУчета.ПоВсемКПС, "КПСКт В (&КПС_НомерЗапроса)", "ИСТИНА") );
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКЭК",
		?(ПараметрыУчета.УчетПоКЭК, "КЭККт В (&КЭК_НомерЗапроса)", "ИСТИНА") );
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоПодразделению",
		?(ПараметрыУчета.УчетПоПодразделениям, "ПодразделениеКт В (&Подразделение_НомерЗапроса)", "ИСТИНА") );
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКонтрагентам",
		"СубконтоКт"+ПараметрыУчета.НомераСубконто["Контрагент"]+" В (&Контрагенты_НомерЗапроса)");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДоговорам",
		?(ПараметрыУчета.ДоговорЕстьСубконто,
		"СубконтоКт"+ПараметрыУчета.НомераСубконто["Договор"]+" В (&Договоры_НомерЗапроса)", "ИСТИНА") );
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеКонтрагент",
		"ДвиженияДокумента.СубконтоКт"+ПараметрыУчета.НомераСубконто["Контрагент"]);
	Если ПараметрыУчета.ДоговорЕстьСубконто Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДоговор",
			"ДвиженияДокумента.СубконтоКт"+ПараметрыУчета.НомераСубконто["Договор"]);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДоговор",
			"НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	Если ПараметрыУчета.ДопАналитикаЕстьСубконто Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДопАналитика",
			"ЕСТЬNULL(ДвиженияДокумента.СубконтоКт"+ПараметрыУчета.НомераСубконто["ДопАналитика"] + ", НЕОПРЕДЕЛЕНО)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДопАналитика",
			"НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	
	Если НЕ ПараметрыУчета.УчетПоКЭК Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДвиженияДокумента.КЭККт", "ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)");
	КонецЕсли;
	Если НЕ ПараметрыУчета.УчетПоКПС Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДвиженияДокумента.КПСКт", "ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
	КонецЕсли;
	Если НЕ ПараметрыУчета.УчетПоИФО Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДвиженияДокумента.ИФО", "ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");
	КонецЕсли;
	Если НЕ ПараметрыУчета.УчетПоПодразделениям Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДвиженияДокумента.ПодразделениеКт", "ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_НомерЗапроса", Строка(НомерЗапроса));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЧастьТекстаЗапросаЗачетАвансаВКорректируемыхДокументах(Множитель, ИспользуемыйСчет)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&ИспользуемыйСчет КАК Счет,
	|	&УчетПоПодразделениям_НомерЗапроса КАК УчетПоПодразделениям_НомерЗапроса,
	|	&УчетПоКПС_НомерЗапроса КАК УчетПоКПС_НомерЗапроса,
	|	ДвиженияДокумента.ИФО КАК ИФО,
	|	ДвиженияДокумента.КФО КАК КФО,
	|	ДвиженияДокумента.КПСКт КАК КПС,
	|	ДвиженияДокумента.КЭККт КАК КЭК,
	|	ДвиженияДокумента.ПодразделениеКт КАК Подразделение,
	|	&ПолеКонтрагент КАК Контрагент,
	|	&ПолеДоговор КАК Договор,
	|	&ПолеДопАналитика КАК ДопАналитика,
	|	&ДопАналитикаВидСубконто_НомерЗапроса КАК ВидДопСубконтоАвансов,
	|	ЕСТЬNULL(ДвиженияДокумента.ВалютаКт, &ВалютаРеглУчета) КАК Валюта,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет
	|				И ДвиженияДокумента.СчетКт.Валютный
	|			ТОГДА &Множитель * ДвиженияДокумента.ВалютнаяСуммаКт
	|		ИНАЧЕ &Множитель * ДвиженияДокумента.Сумма
	|	КОНЕЦ КАК СуммаРасчетов,
	|	&Множитель * ДвиженияДокумента.Сумма КАК СуммаРуб,
	|	ВЫБОР
	|		КОГДА &УчитыватьЗадолженностьЕНВД
	|				И ДвиженияДокумента.СчетКт.НалоговыйУчетЕНВД
	|			ТОГДА &Множитель * ДвиженияДокумента.СуммаЕНВД
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЕНВДРуб
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор В (&КорректируемыйДокумент)
	|				И &УсловиеСчет
	|				И &УсловиеПоИФО
	|				И &УсловиеПоКПС
	|				И &УсловиеПоКЭК
	|				И &УсловиеПоПодразделению
	|				И &УсловиеПоКонтрагентам
	|				И &УсловиеПоДоговорам
	|				И &УсловиеПоИФО,
	|			,
	|			) КАК ДвиженияДокумента";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Множитель", Множитель);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИспользуемыйСчет", "ДвиженияДокумента." + ИспользуемыйСчет);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗачетАвансаВКорректируемыхДокументахДт(ПараметрыУчета, НомерЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДвиженияДокумента.СчетДт КАК Счет,
	|	&УчетПоПодразделениям_НомерЗапроса КАК УчетПоПодразделениям_НомерЗапроса,
	|	&УчетПоКПС_НомерЗапроса КАК УчетПоКПС_НомерЗапроса,
	|	ДвиженияДокумента.ИФО КАК ИФО,
	|	ДвиженияДокумента.КФО КАК КФО,
	|	ДвиженияДокумента.КПСДт КАК КПС,
	|	ДвиженияДокумента.КЭКДт КАК КЭК,
	|	ДвиженияДокумента.ПодразделениеДт КАК Подразделение,
	|	&ПолеКонтрагент КАК Контрагент,
	|	&ПолеДоговор КАК Договор,
	|	&ПолеДопАналитика КАК ДопАналитика,
	|	&ДопАналитикаВидСубконто_НомерЗапроса КАК ВидДопСубконтоАвансов,
	|	ЕСТЬNULL(ДвиженияДокумента.ВалютаДт, &ВалютаРеглУчета) КАК Валюта,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет
	|				И ДвиженияДокумента.СчетКт.Валютный
	|			ТОГДА &Множитель * ДвиженияДокумента.ВалютнаяСуммаДт
	|		ИНАЧЕ &Множитель * ДвиженияДокумента.Сумма
	|	КОНЕЦ КАК СуммаРасчетов,
	|	&Множитель * ДвиженияДокумента.Сумма КАК СуммаРуб,
	|	ВЫБОР
	|		КОГДА &УчитыватьЗадолженностьЕНВД
	|				И ДвиженияДокумента.СчетКт.НалоговыйУчетЕНВД
	|			ТОГДА &Множитель * ДвиженияДокумента.СуммаЕНВД
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЕНВДРуб
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор В (&КорректируемыйДокумент)
	|				И СчетДт В (&Счета_НомерЗапроса)
	|				И &УсловиеПоИФО
	|				И &УсловиеПоКПС
	|				И &УсловиеПоКЭК
	|				И &УсловиеПоПодразделению
	|				И &УсловиеПоКонтрагентам
	|				И &УсловиеПоДоговорам
	|				И &УсловиеПоИФО,
	|			,
	|			) КАК ДвиженияДокумента";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Множитель", -1);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИспользуемыйСчет", "ДвиженияДокумента.СчетДт");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоИФО",
		?(ПараметрыУчета.УчетПоИФО, "ИФО В (&ИФО_НомерЗапроса)", "ИСТИНА") );
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКФО",
		?(НЕ ПараметрыУчета.ПоВсемКФО, "КФО В (&КФО_НомерЗапроса)", "ИСТИНА") );
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКПС",
		?(ПараметрыУчета.УчетПоКПС И НЕ ПараметрыУчета.ПоВсемКПС, "КПСДт В (&КПС_НомерЗапроса)", "ИСТИНА") );
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКЭК",
		?(ПараметрыУчета.УчетПоКЭК, "КЭКДт В (&КЭК_НомерЗапроса)", "ИСТИНА") );
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоПодразделению",
		?(ПараметрыУчета.УчетПоПодразделениям, "ПодразделениеДт В (&Подразделение_НомерЗапроса)", "ИСТИНА") );
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКонтрагентам",
		"СубконтоДт"+ПараметрыУчета.НомераСубконто["Контрагент"]+" В (&Контрагенты_НомерЗапроса)");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДоговорам",
		?(ПараметрыУчета.ДоговорЕстьСубконто,
		"СубконтоДт"+ПараметрыУчета.НомераСубконто["Договор"]+" В (&Договоры_НомерЗапроса)", "ИСТИНА") );
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеКонтрагент",
		"ДвиженияДокумента.СубконтоДт"+ПараметрыУчета.НомераСубконто["Контрагент"]);
	Если ПараметрыУчета.ДоговорЕстьСубконто Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДоговор",
			"ДвиженияДокумента.СубконтоДт"+ПараметрыУчета.НомераСубконто["Договор"]);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДоговор",
			"НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	Если ПараметрыУчета.ДопАналитикаЕстьСубконто Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДопАналитика",
			"ЕСТЬNULL(ДвиженияДокумента.СубконтоДт"+ПараметрыУчета.НомераСубконто["ДопАналитика"] + ", НЕОПРЕДЕЛЕНО)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеДопАналитика",
			"НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	
	Если НЕ ПараметрыУчета.УчетПоКЭК Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДвиженияДокумента.КЭКДт", "ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)");
	КонецЕсли;
	Если НЕ ПараметрыУчета.УчетПоКПС Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДвиженияДокумента.КПСДт", "ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
	КонецЕсли;
	Если НЕ ПараметрыУчета.УчетПоИФО Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДвиженияДокумента.ИФО", "ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");
	КонецЕсли;
	Если НЕ ПараметрыУчета.УчетПоПодразделениям Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДвиженияДокумента.ПодразделениеДт", "ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_НомерЗапроса", Строка(НомерЗапроса));
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция КорректируемыеДокументы(Знач КорректируемыйДокумент, Знач НомерКорректировки)
	
	Результат = Новый Массив;
	Результат.Добавить(КорректируемыйДокумент);
	
	Пока НомерКорректировки > 1 Цикл
		ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КорректируемыйДокумент,
			"ДокументОснование, НомерКорректировки");
		Если Не ЗначениеЗаполнено(КорректируемыйДокумент) Тогда
			Прервать;
		КонецЕсли; 
		КорректируемыйДокумент = ДанныеДокумента.ДокументОснование;
		НомерКорректировки = ДанныеДокумента.НомерКорректировки;
		Если Результат.Найти(КорректируемыйДокумент) <> Неопределено Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Документ корректируется несколько раз: %1'"), КорректируемыйДокумент);
		КонецЕсли;
		Результат.Добавить(КорректируемыйДокумент);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Зачет авансов.

// Структура таблицы расчетов с зачетом авансов.
//
Функция ПустаяТаблицаРасчетовСЗачетомАвансов() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Признак зачета аванса. Устанавливается для строк зачтенных авансов.
	// Остаток суммы расчетов (акта, накладной), оставшийся после зачета всех авансов, добавляется в таблицу последней строкой.
	ПустаяТаблица.Колонки.Добавить("ЭтоЗачетАванса", Новый ОписаниеТипов("Булево"));
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",            Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",            Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",            Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение",  Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Счет и аналитика учета расчетов с контрагентами.
	ПустаяТаблица.Колонки.Добавить("КЭК",                   Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",          Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СчетАвансов",           Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",            Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",               Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("ДопСубконтоАвансов",    Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	ПустаяТаблица.Колонки.Добавить("ВидДопСубконтоАвансов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто"));
	ПустаяТаблица.Колонки.Добавить("Валюта",                Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	// Суммы расчетов.
	ПустаяТаблица.Колонки.Добавить("ОстатокРасчетов",       ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРасчетов",         ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",              ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРубПоКурсуАванса", ОписаниеТипаСуммы);
	// Для целей налогового учета при УСН.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",          ОписаниеТипаСуммы);
	// Дополнительные колонки.
	ПустаяТаблица.Колонки.Добавить("ВидДоговора",           Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровКонтрагентов"));
	ПустаяТаблица.Колонки.Добавить("РасчетыВВалюте",        Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("УчетАгентскогоНДС",     Новый ОписаниеТипов("Булево"));

	Возврат ПустаяТаблица;

КонецФункции

// Формирует таблицу расчетов с зачетом авансов.
//
Функция ТаблицаРасчетовСЗачетомАвансов(ТаблицаДокумента, ТаблицаЗачетАвансовПоДокументу = Неопределено, Реквизиты, Отказ) Экспорт
	
	ТаблицаРасчетов = ПустаяТаблицаРасчетовСЗачетомАвансов();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Реквизиты.Вставить("УчитыватьЗадолженностьЕНВД",       УчетнаяПолитика.ПрименяетсяУСН И УчетнаяПолитика.ПлательщикЕНВД);
	
	Если НЕ Реквизиты.Свойство("СпособЗачетаАванса") ИЛИ НЕ ЗначениеЗаполнено(Реквизиты.СпособЗачетаАванса) Тогда
		Реквизиты.Вставить("СпособЗачетаАванса", Перечисления.СпособыЗачетаАвансов.Автоматически);
	КонецЕсли;
	Если НЕ Реквизиты.Свойство("ПоВсемКФО") Тогда
		Реквизиты.Вставить("ПоВсемКФО", Ложь);
	КонецЕсли;
	Если НЕ Реквизиты.Свойство("ПоВсемКПС") Тогда
		Реквизиты.Вставить("ПоВсемКПС", Ложь);
	КонецЕсли;
	Если НЕ Реквизиты.Свойство("ВидДеятельностиУСН") Тогда
		Реквизиты.Вставить("ВидДеятельностиУСН", Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения);
	КонецЕсли;
	
	ДобавитьСлужебныеКолонкиРасчетовСКонтрагентами(ТаблицаДокумента, Реквизиты);
	ДобавитьСлужебныеКолонкиРасчетовСКонтрагентами(ТаблицаЗачетАвансовПоДокументу, Реквизиты);
	
	ПроверитьКорректностьНастройкиСчетовРасчетов(ТаблицаДокумента, Реквизиты);
	
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		// При поступлении ценностей по договору, по которому организация выступает налоговым агентом по НДС,
		// сумма расчетов не включает НДС, т.к. сумма НДС оплачивается в налоговую инспекцию, а не поставщику.
		Если СтрокаДокумента.ЭтоПоступление И СтрокаДокумента.УчетАгентскогоНДС Тогда
			
			СтрокаДокумента.СуммаРасчетов = СтрокаДокумента.СуммаРасчетов - СтрокаДокумента.СуммаНДС;
			
			КурсДокумента = ?(СтрокаДокумента.Кратность = 0, СтрокаДокумента.Курс,
								СтрокаДокумента.Курс / СтрокаДокумента.Кратность);
			СтрокаДокумента.СуммаРуб = СтрокаДокумента.СуммаРуб - Окр(СтрокаДокумента.СуммаНДС * КурсДокумента, 2);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Подготовим таблицу остатков авансов.
	Если Реквизиты.Свойство("ПериодОстатков") Тогда // Период остатков указан явно.
		ПериодОстатков = Реквизиты.ПериодОстатков;
	ИначеЕсли Не ЗначениеЗаполнено(Реквизиты.Ссылка) Тогда // Новый документ.
		ПериодОстатков = Новый Граница(КонецДня(Реквизиты.Дата), ВидГраницы.Включая);
	Иначе
		ПериодОстатков = Новый Граница(Реквизиты.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	ОстаткиАвансов = ОстаткиАвансов(ПериодОстатков, ТаблицаДокумента, Реквизиты);
	
	Если Реквизиты.СпособЗачетаАванса = Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
		
		Для Каждого СтрокаДокумента Из ТаблицаЗачетАвансовПоДокументу Цикл
			
			НераспределенныйОстаток = СтрокаДокумента.СуммаРасчетов;
			
			Если ОстаткиАвансов.Количество() > 0 Тогда
			
				Отбор = НовыйОтборАвансов(СтрокаДокумента.СчетАвансов, СтрокаДокумента, Реквизиты);
				Если ЗначениеЗаполнено(СтрокаДокумента.ДокументАванса) Тогда
					Отбор.Вставить("ВидДопСубконтоАвансов", ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов);
				КонецЕсли;
				Отбор.Вставить("ДопСубконтоАвансов",    СтрокаДокумента.ДокументАванса);
				НайденныеОстаткиАвансов = ОстаткиАвансов.НайтиСтроки(Отбор);
				
				ДобавитьСтрокиЗачтенныхАвансов(
					ТаблицаРасчетов,
					НераспределенныйОстаток,
					НайденныеОстаткиАвансов,
					СтрокаДокумента,
					Реквизиты);
				
				Если СтрокаДокумента.СчетАвансов <> СтрокаДокумента.СчетРасчетов
				И Не БухгалтерскийУчет.СчетВИерархии(СтрокаДокумента.СчетАвансов, "АП") Тогда
				
					// Зачет остатков долга ("аванса"), образовавшихся на счете расчетов, например, при возвратах.
					Отбор = НовыйОтборАвансов(СтрокаДокумента.СчетРасчетов, СтрокаДокумента, Реквизиты);
					НайденныеОстаткиАвансов = ОстаткиАвансов.НайтиСтроки(Отбор);
					
					ДобавитьСтрокиЗачтенныхАвансов(
						ТаблицаРасчетов,
						НераспределенныйОстаток,
						НайденныеОстаткиАвансов,
						СтрокаДокумента,
						Реквизиты);
				
				КонецЕсли;
				
			КонецЕсли;
			
			// При зачете авансов "по документу" нераспределенный остаток означает,
			// что указанная сумма зачета превышает остаток аванса.
			Если НераспределенныйОстаток > 0 Тогда
				
				ТекстОшибки = НСтр("ru='Указана сумма зачета, превышающая остаток незачтенного аванса.
					|
					|Документ аванса: ""%1""
					|Указана сумма зачета: %2 %3; Остаток аванса: %4 %3; Превышение: %5 %3'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
					СтрокаДокумента.ДокументАванса,
					СтрокаДокумента.СуммаРасчетов,
					СтрокаДокумента.Валюта,
					СтрокаДокумента.СуммаРасчетов - НераспределенныйОстаток,
					НераспределенныйОстаток);
				
				ПолеСуммаЗачета = "ЗачетАвансов[" + Формат(СтрокаДокумента.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].СуммаЗачета";
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Реквизиты.Ссылка, ПолеСуммаЗачета, "Объект", Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Сумму расчетов, оставшуюся после зачета всех авансов, добавляем отдельной строкой.
		Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
			
			Отбор = Новый Структура("ЭтоПоступление,ИФО,КФО,КПС,Подразделение,СчетРасчетов,СчетАвансов,Контрагент,Договор,Валюта");
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаДокумента);
			ЗачетноАвансов = ТаблицаЗачетАвансовПоДокументу.Скопировать(Отбор);
			
			ДобавитьСтрокуЗадолженности(
				ТаблицаРасчетов,
				СтрокаДокумента.СуммаРасчетов - ЗачетноАвансов.Итог("СуммаРасчетов"),
				СтрокаДокумента,
				Реквизиты);
			
		КонецЦикла;
		
	Иначе // Автоматически или НеЗачитывать
		
		ДетальныеКЭК440 = ПолучитьДетальныеКЭК440();
		
		Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
			
			НераспределенныйОстаток = СтрокаДокумента.СуммаРасчетов;
			
			Если Реквизиты.СпособЗачетаАванса = Перечисления.СпособыЗачетаАвансов.Автоматически
			   И ОстаткиАвансов.Количество() > 0 Тогда
			
				Отбор = НовыйОтборАвансов(СтрокаДокумента.СчетАвансов, СтрокаДокумента, Реквизиты);
				НайденныеОстаткиАвансов = ОстаткиАвансов.НайтиСтроки(Отбор);
				
				Если НайденныеОстаткиАвансов.Количество() = 0
					И ДетальныеКЭК440.Получить(
						ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "КЭК")) <> Неопределено Тогда
					// Если не найдены авансы по детальному КЭК, нужно проверить авансы по групповому КЭК
					Отбор.КЭК = БухгалтерскийУчетПовтИсп.КЭКпоКоду("440");
					НайденныеОстаткиАвансов = ОстаткиАвансов.НайтиСтроки(Отбор);
				КонецЕсли;
				
				ДобавитьСтрокиЗачтенныхАвансов(
					ТаблицаРасчетов,
					НераспределенныйОстаток,
					НайденныеОстаткиАвансов,
					СтрокаДокумента,
					Реквизиты);
				
				Если СтрокаДокумента.СчетАвансов <> СтрокаДокумента.СчетРасчетов
				И Не БухгалтерскийУчет.СчетВИерархии(СтрокаДокумента.СчетАвансов, "АП") Тогда
				
					// Зачет остатков долга ("аванса"), образовавшихся на счете расчетов, например, при возвратах.
					Отбор = НовыйОтборАвансов(СтрокаДокумента.СчетРасчетов, СтрокаДокумента, Реквизиты);
					НайденныеОстаткиАвансов = ОстаткиАвансов.НайтиСтроки(Отбор);
					
					ДобавитьСтрокиЗачтенныхАвансов(
						ТаблицаРасчетов,
						НераспределенныйОстаток,
						НайденныеОстаткиАвансов,
						СтрокаДокумента,
						Реквизиты);
				
				КонецЕсли;
				
			КонецЕсли;
			
			// Сумму расчетов, оставшуюся после зачета всех авансов, добавляем отдельной строкой.
			ДобавитьСтрокуЗадолженности(
				ТаблицаРасчетов,
				НераспределенныйОстаток,
				СтрокаДокумента,
				Реквизиты);
			
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

Функция ПолучитьДетальныеКЭК440()
	Результат = Новый Соответствие;
	Результат.Вставить(БухгалтерскийУчетПовтИсп.КЭКпоКоду("441"), Истина);
	Результат.Вставить(БухгалтерскийУчетПовтИсп.КЭКпоКоду("442"), Истина);
	Результат.Вставить(БухгалтерскийУчетПовтИсп.КЭКпоКоду("443"), Истина);
	Результат.Вставить(БухгалтерскийУчетПовтИсп.КЭКпоКоду("444"), Истина);
	Результат.Вставить(БухгалтерскийУчетПовтИсп.КЭКпоКоду("445"), Истина);
	Результат.Вставить(БухгалтерскийУчетПовтИсп.КЭКпоКоду("446"), Истина);
	Возврат Результат;
КонецФункции

Функция НовыйОтборАвансов(СчетАвансов, СтрокаДокумента, Реквизиты)
	
	Отбор = Новый Структура("СчетАвансов,Контрагент",
		СчетАвансов, СтрокаДокумента.Контрагент);
	
	Если ЗначениеЗаполнено(СтрокаДокумента.Договор)
	   И БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДоговорам(СчетАвансов) Тогда
		Отбор.Вставить("Договор", СтрокаДокумента.Договор);
	КонецЕсли;
	
	СвойстваСчетаАвансов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетАвансов);
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		Отбор.Вставить("ИФО", СтрокаДокумента.ИФО);
	КонецЕсли;
	Если НЕ Реквизиты.ПоВсемКФО Тогда
		Отбор.Вставить("КФО",СтрокаДокумента.КФО);
	КонецЕсли;
	Если СвойстваСчетаАвансов.УчетПоКПС И НЕ Реквизиты.ПоВсемКПС Тогда
		Отбор.Вставить("КПС", СтрокаДокумента.КПС);
	КонецЕсли;
	
	ЭтоЗабалансовыйСчетАвансовПолученных = БухгалтерскийУчет.СчетВИерархии(СчетАвансов, "АП");
	
	Если Реквизиты.ИспользоватьУчетПоПодразделениям Тогда
		Если ЭтоЗабалансовыйСчетАвансовПолученных Тогда
			// По забалансовому счету авансов полученных АП отбираем остатки по подразделениям,
			// только если на счете расчетов ведется учет по подразделениям.
			СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаДокумента.СчетРасчетов);
			Если СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
				Отбор.Вставить("Подразделение", СтрокаДокумента.Подразделение);
			КонецЕсли;
		Иначе
			Если СвойстваСчетаАвансов.УчетПоПодразделениям Тогда
				Отбор.Вставить("Подразделение", СтрокаДокумента.Подразделение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Реквизиты.ИспользоватьВалютныйУчет Тогда
		Отбор.Вставить("Валюта", СтрокаДокумента.Валюта);
	КонецЕсли;
	
	// Отбор остатков по КЭК выполняется только для авансов полученных на забалансовом счете АП.
	// На остальных счетах КЭК либо не используются, либо используются КЭК "Увеличение/уменьшение задолженности".
	Если ЭтоЗабалансовыйСчетАвансовПолученных Тогда
		Отбор.Вставить("КЭК", СтрокаДокумента.КЭК);
	КонецЕсли;
	
	Возврат Отбор;
	
КонецФункции

Процедура ДобавитьСтрокиЗачтенныхАвансов(ТаблицаРасчетов, НераспределеннаяСумма, ОстаткиАвансов, СтрокаДокумента, Реквизиты)

	ЕстьКолонкиНомераСтроки = (ТаблицаРасчетов.Колонки.Найти("ИмяСписка") <> Неопределено)
							И (ТаблицаРасчетов.Колонки.Найти("СинонимСписка") <> Неопределено)
							И (ТаблицаРасчетов.Колонки.Найти("НомерСтроки") <> Неопределено);
	
	Знак = ?(СтрокаДокумента.ЭтоПоступление, +1, -1);
	
	Для Каждого СтрокаОстатка Из ОстаткиАвансов Цикл

		Если НераспределеннаяСумма <= 0 Тогда
			Прервать;
		КонецЕсли;

		ЗачитываемыйАванс = Мин(НераспределеннаяСумма, Знак * СтрокаОстатка.СуммаРасчетов);
		Если ЗачитываемыйАванс <= 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрокаРасчетов = ТаблицаРасчетов.Добавить();
		СтрокаРасчетов.ЭтоЗачетАванса = Истина;

		ЗаполнитьЗначенияСвойств(СтрокаРасчетов, СтрокаОстатка,
			"ИФО,КФО,КПС,КЭК,Подразделение,Валюта,
			|СчетАвансов,Контрагент,Договор,ДопСубконтоАвансов,ВидДопСубконтоАвансов");

		ЗаполнитьЗначенияСвойств(СтрокаРасчетов, СтрокаДокумента,
			"СчетРасчетов,ВидДоговора,РасчетыВВалюте,УчетАгентскогоНДС"
			+ ?(ЕстьКолонкиНомераСтроки, ",ИмяСписка,СинонимСписка,НомерСтроки", ""));

		СтрокаРасчетов.ОстатокРасчетов = Знак * СтрокаОстатка.СуммаРасчетов;
		СтрокаРасчетов.СуммаРасчетов   = ЗачитываемыйАванс;

		КоэффициентКурсаАванса = ?(НЕ СтрокаДокумента.РасчетыВВалюте, 1,
			?(СтрокаОстатка.СуммаРасчетов = 0, 0, СтрокаОстатка.СуммаРуб / СтрокаОстатка.СуммаРасчетов));

		КоэффициентРуб = ?(НЕ СтрокаДокумента.РасчетыВВалюте, 1,
			?(СтрокаДокумента.СуммаРасчетов = 0, 0, СтрокаДокумента.СуммаРуб / СтрокаДокумента.СуммаРасчетов));

		СтрокаРасчетов.СуммаРубПоКурсуАванса = Окр(ЗачитываемыйАванс * КоэффициентКурсаАванса, 2);
		СтрокаРасчетов.СуммаРуб              = Окр(ЗачитываемыйАванс * КоэффициентРуб, 2);

		Если Реквизиты.УчитыватьЗадолженностьЕНВД Тогда

			Если ЗачитываемыйАванс = Знак * СтрокаОстатка.СуммаРасчетов Тогда
				СтрокаРасчетов.СуммаЕНВДРуб = Знак * СтрокаОстатка.СуммаЕНВДРуб;
			Иначе
				СтрокаРасчетов.СуммаЕНВДРуб = Окр(СтрокаОстатка.СуммаЕНВДРуб * (ЗачитываемыйАванс / СтрокаОстатка.СуммаРасчетов), 2);
			КонецЕсли;

			СтрокаОстатка.СуммаЕНВДРуб = СтрокаОстатка.СуммаЕНВДРуб - Знак * СтрокаРасчетов.СуммаЕНВДРуб;

		КонецЕсли;

		НераспределеннаяСумма = НераспределеннаяСумма - ЗачитываемыйАванс;

		СтрокаОстатка.СуммаРасчетов = СтрокаОстатка.СуммаРасчетов - Знак * СтрокаРасчетов.СуммаРасчетов;
		СтрокаОстатка.СуммаРуб      = СтрокаОстатка.СуммаРуб      - Знак * СтрокаРасчетов.СуммаРубПоКурсуАванса;

	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьСтрокуЗадолженности(ТаблицаРасчетов, НераспределеннаяСумма, СтрокаДокумента, Реквизиты)

	Если НераспределеннаяСумма <= 0 И СтрокаДокумента.СуммаРасчетов >= 0 Тогда
		Возврат;
	КонецЕсли;

	ЕстьКолонкиНомераСтроки = (ТаблицаРасчетов.Колонки.Найти("ИмяСписка") <> Неопределено)
							И (ТаблицаРасчетов.Колонки.Найти("СинонимСписка") <> Неопределено)
							И (ТаблицаРасчетов.Колонки.Найти("НомерСтроки") <> Неопределено);
	
	СтрокаРасчетов = ТаблицаРасчетов.Добавить();
	СтрокаРасчетов.ЭтоЗачетАванса = Ложь;

	ЗаполнитьЗначенияСвойств(СтрокаРасчетов, СтрокаДокумента,
		"ИФО,КФО,КПС,КЭК,Подразделение,СчетРасчетов,СчетАвансов,Контрагент,Договор,Валюта,
		|ВидДоговора,РасчетыВВалюте,УчетАгентскогоНДС"
		+ ?(ЕстьКолонкиНомераСтроки, ",ИмяСписка,СинонимСписка,НомерСтроки", ""));

	СтрокаРасчетов.СуммаРасчетов = НераспределеннаяСумма;

	КоэффициентРуб = ?(НЕ СтрокаДокумента.РасчетыВВалюте, 1,
		?(СтрокаДокумента.СуммаРасчетов = 0, 0, СтрокаДокумента.СуммаРуб / СтрокаДокумента.СуммаРасчетов));

	СтрокаРасчетов.СуммаРуб              = Окр(НераспределеннаяСумма * КоэффициентРуб, 2);
	СтрокаРасчетов.СуммаРубПоКурсуАванса = СтрокаРасчетов.СуммаРуб;

	Если Реквизиты.УчитыватьЗадолженностьЕНВД
	   И УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО)
	   И Реквизиты.ВидДеятельностиУСН = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения Тогда

		СтрокаРасчетов.СуммаЕНВДРуб = СтрокаРасчетов.СуммаРуб;

	КонецЕсли;

КонецПроцедуры



// Расчеты по оплате труда.

// Подготавливает таблицу документа (в унифицированном формате) для отражения расчетов по оплате труда.
//
Функция ПодготовитьТаблицуРасчетовПоОплатеТрудаПоДокументу(Документ, Параметры = Неопределено, Отказ) Экспорт
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ТаблицаРасчетов = Новый ТаблицаЗначений;
	// Признак поступления ценностей: материальных запасов, услуг и пр.
	ТаблицаРасчетов.Колонки.Добавить("ЭтоПоступление", Новый ОписаниеТипов("Булево"));
	// Общие разрезы учета.
	ТаблицаРасчетов.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаРасчетов.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаРасчетов.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаРасчетов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Счет и аналитика учета расчетов с контрагентами.
	ТаблицаРасчетов.Колонки.Добавить("КЭК",           Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаРасчетов.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаРасчетов.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаРасчетов.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ТаблицаРасчетов.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	// Суммовые показатели операции.
	ТаблицаРасчетов.Колонки.Добавить("СуммаРасчетов", ОписаниеТипаСуммы);
	
	МетаданныеДокумента = Документ.Метаданные();
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если МетаданныеДокумента.Имя = "ОтражениеЗарплатыВУчете" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Операции",
			"НомерСтроки,ИФО,КФО,КПС,КЭК,Подразделение,
			|ВидОперации,ОсновнойКонтрагент,Контрагент,Договор,ВалютаДокумента,Сумма",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""Операции"" КАК ИмяСписка,
		|	""Операции"" КАК СинонимСписка,
		|	Операции.НомерСтроки КАК НомерСтроки,
		|	Операции.ИФО КАК ИФО,
		|	Операции.КФО КАК КФО,
		|	Операции.КПС КАК КПС,
		|	Операции.КЭК КАК КЭК,
		|	Операции.Подразделение КАК Подразделение,
		|	Операции.ВидОперации.Код КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА Операции.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА Операции.ОсновнойКонтрагент
		|		ИНАЧЕ Операции.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА Операции.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
		|		ИНАЧЕ Операции.Договор
		|	КОНЕЦ КАК Договор,
		|	Операции.ВалютаДокумента КАК Валюта,
		|	Операции.Сумма КАК Сумма
		|ИЗ
		|	ТаблицаОперации КАК Операции
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		РасчетыПоОплатеТруда = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаДокумента Из РасчетыПоОплатеТруда Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаДокумента.Контрагент) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					НСтр("ru = 'Контрагент'"), СтрокаДокумента.НомерСтроки, СтрокаДокумента.СинонимСписка);
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1.
						|Если учет расчетов с персоналом ведется сводно по всем работникам, необходимо указать основного контрагента.'"),
						ТекстСообщения);
				ПолеКолонки = "Объект." + СтрокаДокумента.ИмяСписка + "[" + Формат(СтрокаДокумента.НомерСтроки-1, "ЧН=0; ЧГ=") + "].Контрагент";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
			ЭтоНачисление = (Найти(СтрокаДокумента.ВидОперации, "Начисление") > 0);
			ЭтоУдержания  = (Найти(СтрокаДокумента.ВидОперации, "Удержания")  > 0);
			
			Если ЭтоНачисление Тогда
				
				НоваяСтрока = ТаблицаРасчетов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
				НоваяСтрока.ЭтоПоступление = Истина;
				
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					СтрокаДокумента.КЭК, "302.00", , Документ.Дата, Документ.Организация, СтрокаДокумента.ИФО);
				
				НоваяСтрока.СуммаРасчетов = СтрокаДокумента.Сумма;
				
			ИначеЕсли ЭтоУдержания Тогда
				
				НоваяСтрока = ТаблицаРасчетов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
				НоваяСтрока.ЭтоПоступление = Истина;
				
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					СтрокаДокумента.КЭК, "302.00", , Документ.Дата, Документ.Организация, СтрокаДокумента.ИФО);
				
				НоваяСтрока.СуммаРасчетов = - СтрокаДокумента.Сумма;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаРасчетов.Свернуть("ЭтоПоступление,ИФО,КФО,КПС,Подразделение,КЭК,СчетРасчетов,Контрагент,Договор,Валюта", "СуммаРасчетов");
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

// Структура таблицы расчетов по оплате труда.
//
Функция ПустаяТаблицаРасчетовПоОплатеТруда() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Признак зачета аванса. Устанавливается для строк зачтенных авансов.
	// Остаток платежа, оставшийся после зачета всех авансов, добавляется в таблицу последней строкой.
	ПустаяТаблица.Колонки.Добавить("ЭтоЗачетАванса", Новый ОписаниеТипов("Булево"));
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",            Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",            Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",            Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение",  Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Счет и аналитика учета расчетов с контрагентами.
	ПустаяТаблица.Колонки.Добавить("КЭК",                   Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",          Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СчетАвансов",           Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",            Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",               Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("ДопСубконтоАвансов",    Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	ПустаяТаблица.Колонки.Добавить("ВидДопСубконтоАвансов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто"));
	ПустаяТаблица.Колонки.Добавить("Валюта",                Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	// Суммы расчетов.
	ПустаяТаблица.Колонки.Добавить("ОстатокРасчетов",       ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРасчетов",         ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",              ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРубПоКурсуАванса", ОписаниеТипаСуммы);
	// Дополнительные колонки.
	ПустаяТаблица.Колонки.Добавить("ВидДоговора",           Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровКонтрагентов"));
	ПустаяТаблица.Колонки.Добавить("РасчетыВВалюте",        Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("УчетАгентскогоНДС",     Новый ОписаниеТипов("Булево"));

	Возврат ПустаяТаблица;

КонецФункции

// Формирует таблицу расчетов по оплате труда.
//
Функция ТаблицаРасчетовПоОплатеТруда(ТаблицаДокумента, Реквизиты, Отказ) Экспорт
	
	ТаблицаРасчетов = ПустаяТаблицаРасчетовПоОплатеТруда();
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Реквизиты.Вставить("УчитыватьЗадолженностьЕНВД",       Ложь);
	
	ДобавитьСлужебныеКолонкиРасчетовСКонтрагентами(ТаблицаДокумента, Реквизиты);
	
	// Подготовим таблицу остатков авансов.
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		Новый Граница(Реквизиты.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	ОстаткиАвансов = ОстаткиАвансов(ПериодОстатков, ТаблицаДокумента, Реквизиты);
	
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		НераспределенныйОстаток = СтрокаДокумента.СуммаРасчетов;
		
		Если ОстаткиАвансов.Количество() > 0 Тогда
		
			Отбор = НовыйОтборАвансов(СтрокаДокумента.СчетАвансов, СтрокаДокумента, Реквизиты);
			НайденныеОстаткиАвансов = ОстаткиАвансов.НайтиСтроки(Отбор);
			
			ДобавитьСтрокиЗачтенныхАвансов(
				ТаблицаРасчетов,
				НераспределенныйОстаток,
				НайденныеОстаткиАвансов,
				СтрокаДокумента,
				Реквизиты);
			
			Если СтрокаДокумента.СчетАвансов <> СтрокаДокумента.СчетРасчетов Тогда
			
				// Зачет остатков долга ("аванса"), образовавшихся на счете расчетов.
				Отбор = НовыйОтборАвансов(СтрокаДокумента.СчетРасчетов, СтрокаДокумента, Реквизиты);
				НайденныеОстаткиАвансов = ОстаткиАвансов.НайтиСтроки(Отбор);
				
				ДобавитьСтрокиЗачтенныхАвансов(
					ТаблицаРасчетов,
					НераспределенныйОстаток,
					НайденныеОстаткиАвансов,
					СтрокаДокумента,
					Реквизиты);
			
			КонецЕсли;
			
		КонецЕсли;
		
		// Сумму расчетов, оставшуюся после зачета всех авансов, добавляем отдельной строкой.
		ДобавитьСтрокуЗадолженности(
			ТаблицаРасчетов,
			НераспределенныйОстаток,
			СтрокаДокумента,
			Реквизиты);
		
	КонецЦикла;
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

#КонецОбласти

#Область ПогашениеЗадолженности

////////////////////////////////////////////////////////////////////////////////
// ПОГАШЕНИЕ ЗАДОЛЖЕННОСТИ (ДВИЖЕНИЕ ДЕНЕЖНЫХ СРЕДСТВ)

// Исходные данные документа.

// Структура таблицы расшифровки платежа (в унифицированном формате).
//
Функция ПустаяТаблицаРасшифровкаПлатежаУнифицированная() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Признак поступления денежных средств, признак авансового платежа.
	ПустаяТаблица.Колонки.Добавить("ЭтоПоступление",     Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("ЭтоАвансовыйПлатеж", Новый ОписаниеТипов("Булево"));
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",            Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",            Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",            Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("КЭК",            Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("Подразделение",  Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Счет и аналитика учета расчетов с контрагентами.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",   Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",     Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",        Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("Валюта",         Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	// Суммовые показатели операции.
	ПустаяТаблица.Колонки.Добавить("СуммаРасчетов",  ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",       ОписаниеТипаСуммы);
	// Конвертация валюты
	ПустаяТаблица.Колонки.Добавить("ПроданнаяВалюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ПустаяТаблица.Колонки.Добавить("СуммаПроданнойВалюты", ОписаниеТипаСуммы);
	// Порядок погашения задолженности.
	ПустаяТаблица.Колонки.Добавить("СпособПогашенияЗадолженности", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыПогашенияЗадолженности"));
	ПустаяТаблица.Колонки.Добавить("ДопСубконтоРасчетов",          Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	ПустаяТаблица.Колонки.Добавить("ВидДопСубконтоРасчетов",       Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто"));
	// Порядок отражения аванса от покупателя в налоговом учете при УСН.
	ПустаяТаблица.Колонки.Добавить("ОтражениеАвансаУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ПорядокОтраженияАвансовУСН"));
	// Отражение оплаты по графику платежей.
	ПустаяТаблица.Колонки.Добавить("ВестиГрафикПлатежей", Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("ВидРасчетов", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыРасчетовПоЗаймам"));
	ПустаяТаблица.Колонки.Добавить("ОплатитьДо",  Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	// Вспомогательные реквизиты.
	ПустаяТаблица.Колонки.Добавить("ВидДоговора",        Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровКонтрагентов"));
	ПустаяТаблица.Колонки.Добавить("ИсточникСредств",    Новый ОписаниеТипов("СправочникСсылка.ИсточникиСредств,СправочникСсылка.РазделыЛицевыхСчетов"));
	ПустаяТаблица.Колонки.Добавить("ДопКлассификация",   Новый ОписаниеТипов("СправочникСсылка.ДополнительнаяБюджетнаяКлассификация"));
	ПустаяТаблица.Колонки.Добавить("КодМероприятия",     Новый ОписаниеТипов("СправочникСсылка.Мероприятия"));
	ПустаяТаблица.Колонки.Добавить("КодЦели",            Новый ОписаниеТипов("СправочникСсылка.ВидыЦелевыхСредств"));
	ПустаяТаблица.Колонки.Добавить("НазначениеПлатежа",  ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(210));
	
	Возврат ПустаяТаблица;

КонецФункции

// Подготавливает таблицу расшифровки платежа (в унифицированном формате) по документу.
//
Функция ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(Документ, Реквизиты = Неопределено, Отказ) Экспорт
	
	РасшифровкаПлатежа = ПустаяТаблицаРасшифровкаПлатежаУнифицированная();
	
	Если Реквизиты = Неопределено Тогда
		Реквизиты = Новый Структура;
	КонецЕсли;
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты, "Дата"));
	ИспользуетсяСчетАП = (ПериодОстатков >= ДатаПереходаНаЗабалансовыйСчетАП(Документ.Организация));
	
	ИспользоватьУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	
	ЭтоКорСчет30401 = Ложь;
	Если Реквизиты.Свойство("СчетРасчетов") И ЗначениеЗаполнено(Реквизиты.СчетРасчетов) Тогда
		ЭтоКорСчет30401 = БухгалтерскийУчет.СчетВИерархии(Реквизиты.СчетРасчетов, "304.01");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	МетаданныеДокумента = Документ.Метаданные();
	
	Если МетаданныеДокумента.Имя = "ПриходныйКассовыйОрдер"
	 ИЛИ МетаданныеДокумента.Имя = "РасходныйКассовыйОрдер" Тогда
		
		// ПодразделениеКор
		СвойстваКорСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Документ.КорСчет);
		Если ИспользоватьУчетПоПодразделениям
			И СвойстваКорСчета.УчетПоПодразделениям И НЕ СвойстваКорСчета.РазрешитьНеУказыватьПодразделение
			И НЕ ЗначениеЗаполнено(Документ.ПодразделениеКор) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru = 'Подразделение (кор.)'"));
			БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.ПодразделениеКор", Отказ);
		КонецЕсли;
		
		// Контрагент
		Если НЕ ЗначениеЗаполнено(Документ.Контрагент) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru = 'Контрагент'"));
			БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.Контрагент", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат РасшифровкаПлатежа;
		КонецЕсли;
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "РасшифровкаПлатежа",
			"НомерСтроки,ИФО,КФО,КПС,КЭК,ПодразделениеКор,КорСчет,Контрагент,Договор,ВалютаДокумента,
			|СчетРасчетов,СпособПогашенияЗадолженности,ДопСубконтоРасчетов,ВидРасчетов,ОплатитьДо,
			|ДопКлассификация,КодМероприятия,КодЦели,Сумма",
			Документ, Реквизиты);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""РасшифровкаПлатежа"" КАК ИмяСписка,
		|	""Расшифровка платежа"" КАК СинонимСписка,
		|	РасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
		|	&ЭтоПоступлениеДенежныхСредств КАК ЭтоПоступление,
		|	РасшифровкаПлатежа.ИФО КАК ИФО,
		|	РасшифровкаПлатежа.ПодразделениеКор КАК Подразделение,
		|	РасшифровкаПлатежа.КФО КАК КФО,
		|	РасшифровкаПлатежа.КПС КАК КПС,
		|	РасшифровкаПлатежа.КЭК КАК КЭК,
		|	РасшифровкаПлатежа.КорСчет КАК КорСчет,
		|	РасшифровкаПлатежа.Контрагент КАК Контрагент,
		|	РасшифровкаПлатежа.Договор КАК Договор,
		|	РасшифровкаПлатежа.Договор.ВидДоговора КАК ВидДоговора,
		|	РасшифровкаПлатежа.Договор.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
		|	РасшифровкаПлатежа.ВалютаДокумента КАК Валюта,
		|	РасшифровкаПлатежа.СчетРасчетов КАК СчетРасчетов,
		|	РасшифровкаПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
		|	РасшифровкаПлатежа.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
		|	РасшифровкаПлатежа.ВидРасчетов КАК ВидРасчетов,
		|	РасшифровкаПлатежа.ОплатитьДо КАК ОплатитьДо,
		|	РасшифровкаПлатежа.ДопКлассификация КАК ДопКлассификация,
		|	РасшифровкаПлатежа.КодМероприятия КАК КодМероприятия,
		|	РасшифровкаПлатежа.КодЦели КАК КодЦели,
		|	РасшифровкаПлатежа.Сумма КАК СуммаРасчетов,
		|	&ОтражениеАвансаУСН КАК ОтражениеАвансаУСН
		|ИЗ
		|	ТаблицаРасшифровкаПлатежа КАК РасшифровкаПлатежа
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		ЭтоПоступлениеДенежныхСредств = (МетаданныеДокумента.Имя = "ПриходныйКассовыйОрдер");
		Запрос.УстановитьПараметр("ЭтоПоступлениеДенежныхСредств", ЭтоПоступлениеДенежныхСредств);
		Запрос.УстановитьПараметр("ОтражениеАвансаУСН",
			?(Реквизиты.Свойство("ОтражениеАвансаУСН"), Реквизиты.ОтражениеАвансаУСН,
				Перечисления.ПорядокОтраженияАвансовУСН.ПустаяСсылка()));
		
		ДвижениеДенежныхСредств = Запрос.Выполнить().Выгрузить();
		Для Каждого Строка Из ДвижениеДенежныхСредств Цикл
			
			Если НЕ ЗначениеЗаполнено(Строка.КФО) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'КФО'"),
					Строка.НомерСтроки, "Расшифровка платежа");
				ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].КФО";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Строка.КПС) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'КПС'"),
					Строка.НомерСтроки, "Расшифровка платежа");
				ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].КПС";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Строка.КЭК)
				И НЕ ЭтоКорСчет30401 Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'КЭК'"),
					Строка.НомерСтроки, "Расшифровка платежа");
				ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].КЭК";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			// Устарело. Для поддержки случая, когда в качестве кор.счета в ПКО выбран 205.хА.
			НоваяСтрока.ЭтоАвансовыйПлатеж = МетаданныеДокумента.Имя = "ПриходныйКассовыйОрдер"
				И БухгалтерскийУчет.СчетВИерархии(Строка.КорСчет, "205.2А,205.3А,205.7А,205.8А,209.7А,209.8А");
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СчетРасчетов) Тогда
				// Автоматическое определение счета при проведении работает только если в расшифровке платежа СчетРасчетов не заполнен.
				СвойстваКорСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Строка.КорСчет);
				Если СвойстваКорСчета.ЭлементГруппа Тогда
					НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
						Строка.КЭК, Строка.КорСчет,, ПериодОстатков, Документ.Организация, Строка.ИФО);
				Иначе
					НоваяСтрока.СчетРасчетов = Строка.КорСчет;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоваяСтрока.СчетРасчетов) Тогда
				
				Если ЗаполнениеДоговораОбязательно(НоваяСтрока.СчетРасчетов) Тогда
					
					Если НЕ ЗначениеЗаполнено(Документ.Договор) Тогда
						ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
							"Поле", "Заполнение", НСтр("ru = 'Договор'"));
						БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.Договор", Отказ);
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				ТекстСообщения = НСтр("ru='Невозможно определить счет расчетов с контрагентом по КОСГУ ""%1"".
					|Проверьте настройки соответствия аналитических счетов КОСГУ.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.КЭК);
				ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].КОСГУНазначениеПлатежа";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
			КурсДокумента = ?(Реквизиты.Кратность = 0, Реквизиты.Курс, Реквизиты.Курс / Реквизиты.Кратность);
			НоваяСтрока.СуммаРуб = Окр(НоваяСтрока.СуммаРасчетов * КурсДокумента, 2);
			
		КонецЦикла;
		
	ИначеЕсли МетаданныеДокумента.Имя = "КассовоеПоступление"
		  ИЛИ МетаданныеДокумента.Имя = "ПоступлениеНаСчет"
		  ИЛИ МетаданныеДокумента.Имя = "КассовоеВыбытие"
		  ИЛИ МетаданныеДокумента.Имя = "ЗаявкаНаКассовыйРасход"
		  ИЛИ МетаданныеДокумента.Имя = "ПлатежноеПоручение" 
		  ИЛИ МетаданныеДокумента.Имя = "РСКППеречисление" 
		  ИЛИ МетаданныеДокумента.Имя = "РСКПВозврат" Тогда
		
		// Проверим обязательные реквизиты шапки.
		Если ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("Контрагент", МетаданныеДокумента)
		   И НЕ ЗначениеЗаполнено(Документ.Контрагент) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru = 'Контрагент'"));
			БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.Контрагент", Отказ);
		КонецЕсли;
		Если Отказ Тогда
			Возврат РасшифровкаПлатежа;
		КонецЕсли;
		
		Если МетаданныеДокумента.Имя = "ПлатежноеПоручение" Тогда
		
			// В этих документах расчеты только в рублях, даже если документ оформлен в валюте.
			ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "РасшифровкаПлатежа",
				"НомерСтроки,ИФО,КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,Подразделение,
				|Контрагент,Договор,ИсточникСредств,ДопКлассификация,КодМероприятия,КодЦели,
				|СчетРасчетов,СпособПогашенияЗадолженности,ДопСубконтоРасчетов,ВидРасчетов,ОплатитьДо,
				|НазначениеПлатежа,СтрокаНазначениеПлатежа,Сумма",
				Документ, Реквизиты);
			
			Запрос.Текст = Запрос.Текст +
			"ВЫБРАТЬ
			|	""РасшифровкаПлатежа"" КАК ИмяСписка,
			|	""Расшифровка платежа"" КАК СинонимСписка,
			|	РасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
			|	ЛОЖЬ КАК ЭтоПоступление,
			|	РасшифровкаПлатежа.ИФО КАК ИФО,
			|	РасшифровкаПлатежа.Подразделение КАК Подразделение,
			|	РасшифровкаПлатежа.КФО КАК КФО,
			|	РасшифровкаПлатежа.КБКНазначениеПлатежа КАК КПС,
			|	РасшифровкаПлатежа.КОСГУНазначениеПлатежа КАК КЭК,
			|	РасшифровкаПлатежа.Контрагент КАК Контрагент,
			|	РасшифровкаПлатежа.Договор КАК Договор,
			|	РасшифровкаПлатежа.Договор.ВидДоговора КАК ВидДоговора,
			|	РасшифровкаПлатежа.Договор.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
			|	&ВалютаРеглУчета КАК Валюта,
			|	РасшифровкаПлатежа.СчетРасчетов КАК СчетРасчетов,
			|	РасшифровкаПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
			|	РасшифровкаПлатежа.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
			|	РасшифровкаПлатежа.ВидРасчетов КАК ВидРасчетов,
			|	РасшифровкаПлатежа.ОплатитьДо КАК ОплатитьДо,
			|	РасшифровкаПлатежа.ИсточникСредств КАК ИсточникСредств,
			|	РасшифровкаПлатежа.ДопКлассификация КАК ДопКлассификация,
			|	РасшифровкаПлатежа.КодМероприятия КАК КодМероприятия,
			|	РасшифровкаПлатежа.КодЦели КАК КодЦели,
			|	РасшифровкаПлатежа.НазначениеПлатежа КАК НазначениеПлатежа,
			|	РасшифровкаПлатежа.СтрокаНазначениеПлатежа КАК СтрокаНазначениеПлатежа,
			|	РасшифровкаПлатежа.Сумма КАК СуммаРасчетов,
			|	РасшифровкаПлатежа.Сумма КАК СуммаРуб,
			|	&ОтражениеАвансаУСН КАК ОтражениеАвансаУСН
			|ИЗ
			|	ТаблицаРасшифровкаПлатежа КАК РасшифровкаПлатежа
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета()); 
			
		ИначеЕсли МетаданныеДокумента.Имя = "ПоступлениеНаСчет" Тогда 
			// получаем данные из связанных таблиц
			ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "РасшифровкаПлатежа",
				"ИдентификаторСтроки,ИФО,ВалютаДокумента,НазначениеПлатежа,Примечание",
                Документ, Реквизиты);	
			ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ДетализацияПлатежа",
				"ИдентификаторСтроки,НомерСтроки,КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,РазделЛС,Подразделение,
				|ДопКлассификация,КодМероприятия,КодЦели,Контрагент,Договор,
                |СчетРасчетов,СпособПогашенияЗадолженности,ДопСубконтоРасчетов,ВидРасчетов,ОплатитьДо,
				|Сумма,СуммаВал",
                Документ, Реквизиты);
	
			Запрос.Текст = Запрос.Текст +
			"ВЫБРАТЬ
			|	""РасшифровкаПлатежа"" КАК ИмяСписка,
			|	""Расшифровка платежа"" КАК СинонимСписка,
			|	ДетализацияПлатежа.НомерСтроки КАК НомерСтроки,
			|	&ЭтоПоступлениеДенежныхСредств КАК ЭтоПоступление,  
			|	ДетализацияПлатежа.Подразделение КАК Подразделение,
            |	ДетализацияПлатежа.КБКНазначениеПлатежа КАК КПС,
            |	ДетализацияПлатежа.КОСГУНазначениеПлатежа КАК КЭК,
            |	ДетализацияПлатежа.СчетРасчетов КАК СчетРасчетов,     
			|	ДетализацияПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
			|	ДетализацияПлатежа.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
			|	ДетализацияПлатежа.ВидРасчетов КАК ВидРасчетов,
			|	ДетализацияПлатежа.ОплатитьДо КАК ОплатитьДо,
            |	ДетализацияПлатежа.ДопКлассификация КАК ДопКлассификация,
			|	ДетализацияПлатежа.КодМероприятия КАК КодМероприятия,
			|	ДетализацияПлатежа.КодЦели КАК КодЦели, 
			|	ДетализацияПлатежа.РазделЛС КАК ИсточникСредств, 
            |	ДетализацияПлатежа.СуммаВал КАК СуммаРасчетов,
			|	ДетализацияПлатежа.Сумма КАК СуммаРуб,  
            |	РасшифровкаПлатежа.ИФО КАК ИФО,    
			|	ДетализацияПлатежа.Контрагент КАК Контрагент,
	        |	ДетализацияПлатежа.Договор КАК Договор,   
			|	ДетализацияПлатежа.Договор.ВидДоговора КАК ВидДоговора,
			|	ДетализацияПлатежа.Договор.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
			|	РасшифровкаПлатежа.ВалютаДокумента КАК Валюта,
            |	РасшифровкаПлатежа.НазначениеПлатежа КАК НазначениеПлатежа,
			|	РасшифровкаПлатежа.Примечание КАК СтрокаНазначениеПлатежа,
			|	ВЫБОР КОГДА ДетализацияПлатежа.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)
			|		ТОГДА
			|";
			ПлатежноРасчетныеДокументы.ТекстЗапросаКФОПоКодуПоступленияЕБП(Запрос.Текст, "ДетализацияПлатежа.РазделЛС.КодПоступленияЕБП", "");
			
			Запрос.Текст = Запрос.Текст + "
			|		ИНАЧЕ ДетализацияПлатежа.КФО
			|	КОНЕЦ КАК КФО,
			|	&ОтражениеАвансаУСН КАК ОтражениеАвансаУСН
			|ИЗ
			|	ТаблицаДетализацияПлатежа КАК ДетализацияПлатежа
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасшифровкаПлатежа КАК РасшифровкаПлатежа
			|		ПО ДетализацияПлатежа.ИдентификаторСтроки = РасшифровкаПлатежа.ИдентификаторСтроки  
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
		ИначеЕсли МетаданныеДокумента.Имя = "РСКППеречисление" Тогда 
			// получаем данные из трех связанных таблиц
			ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Контрагенты",
				"ИдентификаторСтроки,ИФО,Контрагент,Договор,ВалютаДокумента,НазначениеПлатежа,СтрокаНазначениеПлатежа",
                Документ, Реквизиты); 
			ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "РасшифровкаПлатежа",
				"ИдентификаторСтроки,СтрокаНазначениеПлатежа",
                Документ, Реквизиты);	
			ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ДетализацияПлатежа",
				"ИдентификаторСтроки,НомерСтроки,КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,РазделЛС,Подразделение,
				|ДопКлассификация,КодМероприятия,КодЦели,
                |СчетРасчетов,СпособПогашенияЗадолженности,ДопСубконтоРасчетов,ВидРасчетов,ОплатитьДо,
				|Сумма,СуммаВал",
                Документ, Реквизиты);
	
			Запрос.Текст = Запрос.Текст +
			"ВЫБРАТЬ
			|	""РасшифровкаПлатежа"" КАК ИмяСписка,
			|	""Расшифровка платежа"" КАК СинонимСписка,
			|	ДетализацияПлатежа.НомерСтроки КАК НомерСтроки,
			|	&ЭтоПоступлениеДенежныхСредств КАК ЭтоПоступление,  
			|	ДетализацияПлатежа.Подразделение КАК Подразделение,
            |	ДетализацияПлатежа.КБКНазначениеПлатежа КАК КПС,
            |	ДетализацияПлатежа.КОСГУНазначениеПлатежа КАК КЭК,
            |	ДетализацияПлатежа.СчетРасчетов КАК СчетРасчетов,     
			|	ДетализацияПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
			|	ДетализацияПлатежа.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
			|	ДетализацияПлатежа.ВидРасчетов КАК ВидРасчетов,
			|	ДетализацияПлатежа.ОплатитьДо КАК ОплатитьДо,
            |	ДетализацияПлатежа.ДопКлассификация КАК ДопКлассификация,
			|	ДетализацияПлатежа.КодМероприятия КАК КодМероприятия,
			|	ДетализацияПлатежа.КодЦели КАК КодЦели, 
			|	ДетализацияПлатежа.РазделЛС КАК ИсточникСредств, 
            |	ДетализацияПлатежа.СуммаВал КАК СуммаРасчетов,
			|	ДетализацияПлатежа.Сумма КАК СуммаРуб,  
            |	Контрагенты.ИФО КАК ИФО,    
			|	Контрагенты.Контрагент КАК Контрагент,
	        |	Контрагенты.Договор КАК Договор,   
			|	Контрагенты.Договор.ВидДоговора КАК ВидДоговора,
			|	Контрагенты.Договор.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
			|	Контрагенты.ВалютаДокумента КАК Валюта,
            |	Контрагенты.НазначениеПлатежа КАК НазначениеПлатежа,
			|	ВЫБОР КОГДА ДетализацияПлатежа.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)
			|			ТОГДА
			|";
			ПлатежноРасчетныеДокументы.ТекстЗапросаКФОПоКодуПоступленияЕБП(Запрос.Текст, "ДетализацияПлатежа.РазделЛС.КодПоступленияЕБП", "");
			Запрос.Текст = Запрос.Текст + "
			|		ИНАЧЕ ДетализацияПлатежа.КФО
			|	КОНЕЦ КАК КФО, 
			|	Контрагенты.СтрокаНазначениеПлатежа + РасшифровкаПлатежа.СтрокаНазначениеПлатежа КАК СтрокаНазначениеПлатежа,												
			|	&ОтражениеАвансаУСН КАК ОтражениеАвансаУСН
			|ИЗ
			|	ТаблицаДетализацияПлатежа КАК ДетализацияПлатежа
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасшифровкаПлатежа КАК РасшифровкаПлатежа";
			Если Документ.НесколькоКодовБК = 1 Тогда
				Запрос.Текст = Запрос.Текст + "	
			|		ПО ДетализацияПлатежа.ИдентификаторСтроки = РасшифровкаПлатежа.ИдентификаторСтроки";  
			Иначе 
				 Запрос.Текст = Запрос.Текст + "	
			|		ПО ИСТИНА"; 
			КонецЕсли;	
			Запрос.Текст = Запрос.Текст + "
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКонтрагенты КАК Контрагенты";   
			Если Документ.НесколькоПолучателей = 1 Тогда
				Запрос.Текст = Запрос.Текст + "	
			|		ПО ДетализацияПлатежа.ИдентификаторСтроки = Контрагенты.ИдентификаторСтроки";
			Иначе 
				 Запрос.Текст = Запрос.Текст + "	
			|		ПО ИСТИНА"; 
			КонецЕсли;	 
				 
			Запрос.Текст = Запрос.Текст + "
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
	
		ИначеЕсли МетаданныеДокумента.Имя = "РСКПВозврат" Тогда 
			// получаем данные из таблицы "ДетализацияПлатежа"
			ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ДетализацияПлатежа",
				"НомерСтроки,ИФО,КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,Подразделение,
				|Контрагент,Договор,ВалютаДокумента,РазделЛС,ДопКлассификация,КодМероприятия,КодЦели,
				|СчетРасчетов,СпособПогашенияЗадолженности,ДопСубконтоРасчетов,ВидРасчетов,ОплатитьДо,
				|НазначениеПлатежа,Сумма,СуммаВал",
				Документ, Реквизиты);   
				
				Запрос.Текст = Запрос.Текст +
				"ВЫБРАТЬ
				|	""РасшифровкаПлатежа"" КАК ИмяСписка,
				|	""Расшифровка платежа"" КАК СинонимСписка,
				|	ДетализацияПлатежа.НомерСтроки КАК НомерСтроки,
				|	&ЭтоПоступлениеДенежныхСредств КАК ЭтоПоступление,  
				|	ДетализацияПлатежа.Подразделение КАК Подразделение,
				|	ДетализацияПлатежа.КБКНазначениеПлатежа КАК КПС,
				|	ДетализацияПлатежа.КОСГУНазначениеПлатежа КАК КЭК,
				|	ДетализацияПлатежа.СчетРасчетов КАК СчетРасчетов,     
				|	ДетализацияПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
				|	ДетализацияПлатежа.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
				|	ДетализацияПлатежа.ВидРасчетов КАК ВидРасчетов,
				|	ДетализацияПлатежа.ОплатитьДо КАК ОплатитьДо,
				|	ДетализацияПлатежа.ДопКлассификация КАК ДопКлассификация,
				|	ДетализацияПлатежа.КодМероприятия КАК КодМероприятия,
				|	ДетализацияПлатежа.КодЦели КАК КодЦели, 
				|	ДетализацияПлатежа.РазделЛС КАК ИсточникСредств, 
				|	ДетализацияПлатежа.СуммаВал КАК СуммаРасчетов,
				|	ДетализацияПлатежа.Сумма КАК СуммаРуб,  
				|	ДетализацияПлатежа.ИФО КАК ИФО,    
				|	ДетализацияПлатежа.Контрагент КАК Контрагент,
				|	ДетализацияПлатежа.Договор КАК Договор,   
				|	ДетализацияПлатежа.Договор.ВидДоговора КАК ВидДоговора,
				|	ДетализацияПлатежа.Договор.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
				|	ДетализацияПлатежа.ВалютаДокумента КАК Валюта,
				|	ДетализацияПлатежа.НазначениеПлатежа КАК НазначениеПлатежа,
				|	ВЫБОР КОГДА ДетализацияПлатежа.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)
				|			ТОГДА
				|";
                ПлатежноРасчетныеДокументы.ТекстЗапросаКФОПоКодуПоступленияЕБП(Запрос.Текст, "ДетализацияПлатежа.РазделЛС.КодПоступленияЕБП", "");
				
				Запрос.Текст = Запрос.Текст + "
				|		ИНАЧЕ ДетализацияПлатежа.КФО
				|	КОНЕЦ КАК КФО, 
				|	"""" КАК СтрокаНазначениеПлатежа,												
				|	&ОтражениеАвансаУСН КАК ОтражениеАвансаУСН
				|ИЗ
				|	ТаблицаДетализацияПлатежа КАК ДетализацияПлатежа
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерСтроки";
			
		Иначе
		
			ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "РасшифровкаПлатежа",
				"НомерСтроки,ИФО,КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,Подразделение,
				|Контрагент,Договор,ВалютаДокумента,ИсточникСредств,ДопКлассификация,КодМероприятия,КодЦели,
				|СчетРасчетов,СпособПогашенияЗадолженности,ДопСубконтоРасчетов,ВидРасчетов,ОплатитьДо,
				|НазначениеПлатежа,СтрокаНазначениеПлатежа,Сумма,СуммаВал",
				Документ, Реквизиты);
			
			Запрос.Текст = Запрос.Текст +
			"ВЫБРАТЬ
			|	""РасшифровкаПлатежа"" КАК ИмяСписка,
			|	""Расшифровка платежа"" КАК СинонимСписка,
			|	РасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
			|	&ЭтоПоступлениеДенежныхСредств КАК ЭтоПоступление,
			|	РасшифровкаПлатежа.ИФО КАК ИФО,
			|	РасшифровкаПлатежа.Подразделение КАК Подразделение,
			|	РасшифровкаПлатежа.КФО КАК КФО,
			|	РасшифровкаПлатежа.КБКНазначениеПлатежа КАК КПС,
			|	РасшифровкаПлатежа.КОСГУНазначениеПлатежа КАК КЭК,
			|	РасшифровкаПлатежа.Контрагент КАК Контрагент,
			|	РасшифровкаПлатежа.Договор КАК Договор,
			|	РасшифровкаПлатежа.Договор.ВидДоговора КАК ВидДоговора,
			|	РасшифровкаПлатежа.Договор.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
			|	РасшифровкаПлатежа.ВалютаДокумента КАК Валюта,
			|	РасшифровкаПлатежа.СчетРасчетов КАК СчетРасчетов,
			|	РасшифровкаПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
			|	РасшифровкаПлатежа.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
			|	РасшифровкаПлатежа.ВидРасчетов КАК ВидРасчетов,
			|	РасшифровкаПлатежа.ОплатитьДо КАК ОплатитьДо,
			|	РасшифровкаПлатежа.ИсточникСредств КАК ИсточникСредств,
			|	РасшифровкаПлатежа.ДопКлассификация КАК ДопКлассификация,
			|	РасшифровкаПлатежа.КодМероприятия КАК КодМероприятия,
			|	РасшифровкаПлатежа.КодЦели КАК КодЦели,
			|	РасшифровкаПлатежа.НазначениеПлатежа КАК НазначениеПлатежа,
			|	РасшифровкаПлатежа.СтрокаНазначениеПлатежа КАК СтрокаНазначениеПлатежа,
			|	РасшифровкаПлатежа.СуммаВал КАК СуммаРасчетов,
			|	РасшифровкаПлатежа.Сумма КАК СуммаРуб,
			|	&ОтражениеАвансаУСН КАК ОтражениеАвансаУСН
			|ИЗ
			|	ТаблицаРасшифровкаПлатежа КАК РасшифровкаПлатежа
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
		КонецЕсли;
		
		Если НЕ ОбщегоНазначенияБГУ.ЕстьРеквизитТабЧастиДокумента("СтрокаНазначениеПлатежа",
			МетаданныеДокумента, "РасшифровкаПлатежа") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РасшифровкаПлатежа.СтрокаНазначениеПлатежа", """""");
		КонецЕсли;
		
		ЭтоПоступлениеДенежныхСредств = (МетаданныеДокумента.Имя = "КассовоеПоступление")
		ИЛИ (МетаданныеДокумента.Имя = "ПоступлениеНаСчет");
		Запрос.УстановитьПараметр("ЭтоПоступлениеДенежныхСредств", ЭтоПоступлениеДенежныхСредств);
		Запрос.УстановитьПараметр("ОтражениеАвансаУСН",
			?(Реквизиты.Свойство("ОтражениеАвансаУСН"), Реквизиты.ОтражениеАвансаУСН,
				Перечисления.ПорядокОтраженияАвансовУСН.ПустаяСсылка()));
		
		ДвижениеДенежныхСредств = Запрос.Выполнить().Выгрузить();
		
		Если ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("КорСчет", МетаданныеДокумента) Тогда
			
			Если БухгалтерскийУчет.СчетВИерархии(Документ.КорСчет, "206.00") Тогда
				// В новых типовых операциях, вместо доп.реквизита "Авансовый платеж",
				// счет расчетов 206.00 или 302.00 устанавливается явно в реквизите КорСчет.
				Реквизиты.Вставить("ЭтоАвансовыйПлатеж", Истина);
			КонецЕсли;
			
			Если БухгалтерскийУчет.СчетВИерархии(Документ.КорСчет, "208.00") Тогда
				// Для корректного определения счета расчетов по КЭК далее.
				Реквизиты.Вставить("СчетРасчетов", Документ.КорСчет);
			КонецЕсли;
			
		КонецЕсли;
		
		ЕстьКонвертацияВалюты = Ложь;
		Если МетаданныеДокумента.Имя = "КассовоеВыбытие" Тогда
			ВалютаИТипЛицевогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ.ЛицевойСчет, "ВалютаСчета, ТипЛицевогоСчета");
			ВалютаЛицевогоСчета = ВалютаИТипЛицевогоСчета.ВалютаСчета;
			ТипЛицевогоСчета = ВалютаИТипЛицевогоСчета.ТипЛицевогоСчета;
			Если ЗначениеЗаполнено(ВалютаЛицевогоСчета)
				И Документ.ВалютаДокумента <> ВалютаЛицевогоСчета
				И ТипЛицевогоСчета = ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский")
				И БухгалтерскийУчет.СчетВИерархии(Документ.КорСчет, "206.00, 302.00") Тогда
				ЕстьКонвертацияВалюты = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если (МетаданныеДокумента.Имя = "ЗаявкаНаКассовыйРасход" ИЛИ МетаданныеДокумента.Имя = "РСКППеречисление")
			И Документ.ВалютаДокумента <> БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета()
			И БухгалтерскийУчет.СчетВИерархии(Документ.КорСчет, "206.00, 302.00")
			И (НЕ ЗначениеЗаполнено(Документ.Договор)
				ИЛИ НЕ РаботаСОбязательствами.СведенияОВалютеОбязательства(Документ.Договор).ОплатаВРублях) Тогда
			
			КурсПересчета = ПлатежноРасчетныеДокументы.ПолучитьСостояниеЗаявки(Документ.Ссылка).Курс;
			ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(
				Документ.СуммаДокументаВВалюте * КурсПересчета, ДвижениеДенежныхСредств, "СуммаРуб", "СуммаРасчетов");
			
			Если КурсПересчета = 0 Тогда
				ТекстСообщения = НСтр("ru = 'Курс иностранной валюты выписки не заполнен, проводки будут сформированы с нулевой суммой!'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ.Ссылка, , "Объект");
			КонецЕсли;
			
		КонецЕсли;
		
		ОбязательноУказыватьПодразделение = Ложь;
		
		Для Каждого Строка Из ДвижениеДенежныхСредств Цикл
			
			Если НЕ ЗначениеЗаполнено(Строка.ИсточникСредств) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					НСтр("ru='ИсточникСредств'"),
					Строка.НомерСтроки, Строка.СинонимСписка);
				ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].ИсточникСредств";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Строка.КПС) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					НСтр("ru='КБК'"), Строка.НомерСтроки, Строка.СинонимСписка);
				ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].КБКНазначениеПлатежа";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Строка.КЭК)
				И НЕ ЭтоКорСчет30401 Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					НСтр("ru='КОСГУ'"), Строка.НомерСтроки, Строка.СинонимСписка);
				ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].КОСГУНазначениеПлатежа";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			НоваяСтрока.ЭтоАвансовыйПлатеж = Реквизиты.Свойство("ЭтоАвансовыйПлатеж") И Реквизиты.ЭтоАвансовыйПлатеж;
			
			НоваяСтрока.НазначениеПлатежа = СокрЛП(Строка.СтрокаНазначениеПлатежа);
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СчетРасчетов) И Реквизиты.Свойство("СчетРасчетов") Тогда
				// Автоматическое определение счета при проведении работает только если в расшифровке платежа СчетРасчетов не заполнен.
				Если БухгалтерскийУчет.СчетВИерархии(Реквизиты.СчетРасчетов, "205.00") Тогда
					Если ИспользуетсяСчетАП Тогда
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
							Строка.КЭК, "205.00", , ПериодОстатков, Документ.Организация, Строка.ИФО);
					ИначеЕсли НЕ НоваяСтрока.ЭтоАвансовыйПлатеж Тогда
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
							Строка.КЭК, "205.00", , ПериодОстатков, Документ.Организация, Строка.ИФО);
					Иначе // "Старые" счета учета авансов полученных получаем без ограничения по дате действия.
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
							Строка.КЭК, "205.2А,205.3А,205.7А,205.8А");
					КонецЕсли;
				ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Реквизиты.СчетРасчетов, "209.00") Тогда
					Если ИспользуетсяСчетАП Тогда
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
							Строка.КЭК, "209.00", , ПериодОстатков, Документ.Организация, Строка.ИФО);
					ИначеЕсли НЕ НоваяСтрока.ЭтоАвансовыйПлатеж Тогда
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
							Строка.КЭК, "209.00", , ПериодОстатков, Документ.Организация, Строка.ИФО);
					Иначе // "Старые" счета учета авансов полученных получаем без ограничения по дате действия.
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
							Строка.КЭК, "209.7А,209.8А");
					КонецЕсли;
				ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Реквизиты.СчетРасчетов, "206.00,302.00") Тогда
					НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
						Строка.КЭК, ?(НоваяСтрока.ЭтоАвансовыйПлатеж, "206.00", "302.00"), , ПериодОстатков, Документ.Организация, Строка.ИФО);
				ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Реквизиты.СчетРасчетов, "208.00") Тогда
					НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
						Строка.КЭК, "208.00", , ПериодОстатков, Документ.Организация, Строка.ИФО);
				ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Реквизиты.СчетРасчетов, "207.00,301.00,304.01,304.03,210.05") Тогда
					НоваяСтрока.СчетРасчетов = Реквизиты.СчетРасчетов; // Счет расчетов не определяется по КЭК, передается параметром.
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоваяСтрока.СчетРасчетов) Тогда
				
				СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(НоваяСтрока.СчетРасчетов);
				ОбязательноУказыватьПодразделение = ОбязательноУказыватьПодразделение
					ИЛИ (СвойстваСчетаРасчетов.УчетПоПодразделениям И НЕ СвойстваСчетаРасчетов.РазрешитьНеУказыватьПодразделение);
				
				Если ЗаполнениеДоговораОбязательно(НоваяСтрока.СчетРасчетов) Тогда
					
					Если ОбщегоНазначенияБГУ.ЕстьРеквизитТабЧастиДокумента("Договор", МетаданныеДокумента, Строка.ИмяСписка) Тогда
						
						Если НЕ ЗначениеЗаполнено(Строка.Договор) Тогда
							ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
								МетаданныеДокумента.ТабличныеЧасти[Строка.ИмяСписка].Реквизиты.Договор.Синоним,
								Строка.НомерСтроки, Строка.СинонимСписка);
							ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].Договор";
							БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
						КонецЕсли;
						
					ИначеЕсли ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("Договор", МетаданныеДокумента) Тогда
						
						Если НЕ ЗначениеЗаполнено(Документ.Договор) Тогда
							ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
								"Поле", "Заполнение", НСтр("ru = 'Договор'"));
							БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.Договор", Отказ);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				ТекстСообщения = НСтр("ru='Невозможно определить счет расчетов с контрагентом по КОСГУ ""%1"".
					|Проверьте настройки соответствия аналитических счетов КОСГУ.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.КЭК);
				ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].КОСГУНазначениеПлатежа";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
			Если ЕстьКонвертацияВалюты Тогда
				НоваяСтрока.ПроданнаяВалюта = ВалютаЛицевогоСчета;
				Если ДвижениеДенежныхСредств.Индекс(Строка) = ДвижениеДенежныхСредств.Количество() - 1 Тогда
					НоваяСтрока.СуммаПроданнойВалюты = Документ.СуммаПроданнойВалюты - РасшифровкаПлатежа.Итог("СуммаПроданнойВалюты");
				Иначе
					НоваяСтрока.СуммаПроданнойВалюты = Документ.СуммаПроданнойВалюты*Строка.СуммаРасчетов/ДвижениеДенежныхСредств.Итог("СуммаРасчетов");
				КонецЕсли;
			Иначе
				НоваяСтрока.ПроданнаяВалюта = Строка.Валюта;
				НоваяСтрока.СуммаПроданнойВалюты = Строка.СуммаРасчетов;
			КонецЕсли;   
			
			//00-00014281 - добавляем подразделение из шапки
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Подразделение) И ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("Подразделение", МетаданныеДокумента) Тогда
				НоваяСтрока.Подразделение = Документ.Подразделение; 
			КонецЕсли;	
			
			//00-00014281 перенесено внутрь цикла, проверка подразделения в строке
			Если ИспользоватьУчетПоПодразделениям И ОбязательноУказыватьПодразделение
				И НЕ ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru='Подразделение'"));
				ТекстСообщения = ТекстСообщения + НСтр("ru='. Учет расчетов ведется по подразделениям.'");
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.Подразделение", Отказ);
			КонецЕсли;
			
		КонецЦикла;
				
	ИначеЕсли МетаданныеДокумента.Имя = "ЗаявкаНаВозврат"
		  ИЛИ МетаданныеДокумента.Имя = "ЗаявкаНаКассовыйРасходСокращенная"
		  ИЛИ МетаданныеДокумента.Имя = "ЭквайринговаяОперация" Тогда
		
		// Проверим обязательные реквизиты шапки.
		Если ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("Контрагент", МетаданныеДокумента)
		   И НЕ ЗначениеЗаполнено(Документ.Контрагент) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru = 'Получатель платежа'"));
			БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.Контрагент", Отказ);
		КонецЕсли;
		Если Отказ Тогда
			Возврат РасшифровкаПлатежа;
		КонецЕсли;
		
		Если МетаданныеДокумента.Имя = "ЭквайринговаяОперация" Тогда
		
			ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Документ",
				"ИФО,КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,Подразделение,Контрагент,Договор,
				|СчетРасчетов,СпособПогашенияЗадолженности,ДопСубконтоРасчетов,ВидРасчетов,ОплатитьДо,
				|ИсточникСредств,ДопКлассификация,КодМероприятия,КодЦели,ОтражениеАвансаУСН,СуммаДокумента",
				Документ, Реквизиты);
			
			Запрос.Текст = Запрос.Текст +
			"ВЫБРАТЬ
			|	&ЭтоПоступлениеДенежныхСредств КАК ЭтоПоступление,
			|	РасшифровкаПлатежа.ИФО КАК ИФО,
			|	РасшифровкаПлатежа.Подразделение КАК Подразделение,
			|	РасшифровкаПлатежа.КФО КАК КФО,
			|	РасшифровкаПлатежа.КБКНазначениеПлатежа КАК КПС,
			|	РасшифровкаПлатежа.КОСГУНазначениеПлатежа КАК КЭК,
			|	РасшифровкаПлатежа.Контрагент КАК Контрагент,
			|	РасшифровкаПлатежа.Договор КАК Договор,
			|	РасшифровкаПлатежа.Договор.ВидДоговора КАК ВидДоговора,
			|	РасшифровкаПлатежа.Договор.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
			|	&ВалютаРеглУчета КАК Валюта,
			|	РасшифровкаПлатежа.СчетРасчетов КАК СчетРасчетов,
			|	РасшифровкаПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
			|	РасшифровкаПлатежа.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
			|	РасшифровкаПлатежа.ВидРасчетов КАК ВидРасчетов,
			|	РасшифровкаПлатежа.ОплатитьДо КАК ОплатитьДо,
			|	РасшифровкаПлатежа.ИсточникСредств КАК ИсточникСредств,
			|	РасшифровкаПлатежа.ДопКлассификация КАК ДопКлассификация,
			|	РасшифровкаПлатежа.КодМероприятия КАК КодМероприятия,
			|	РасшифровкаПлатежа.КодЦели КАК КодЦели,
			|	&НазначениеПлатежа КАК НазначениеПлатежа,
			|	"""" КАК СтрокаНазначениеПлатежа,
			|	РасшифровкаПлатежа.СуммаДокумента КАК СуммаРасчетов,
			|	РасшифровкаПлатежа.СуммаДокумента КАК СуммаРуб,
			|	РасшифровкаПлатежа.ОтражениеАвансаУСН КАК ОтражениеАвансаУСН
			|ИЗ
			|	Документ КАК РасшифровкаПлатежа";
			
			Если Документ.ВидОперации = Перечисления.ВидыОперацииЭквайринга.ОплатаПлатежнойКартой Или
				Документ.ВидОперации = Перечисления.ВидыОперацииЭквайринга.ОплатаЧерезСервисПриемаПлатежей Или
				Документ.ВидОперации = Перечисления.ВидыОперацииЭквайринга.ОплатаЭлектроннымиСредствамиПлатежаПоРеестру Тогда 
				ЭтоПоступлениеДенежныхСредств = Истина;
			Иначе
				ЭтоПоступлениеДенежныхСредств = Ложь;
			КонецЕсли;
			Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
			Запрос.УстановитьПараметр("ЭтоПоступлениеДенежныхСредств", ЭтоПоступлениеДенежныхСредств);
			Запрос.УстановитьПараметр("НазначениеПлатежа", ?(ЭтоПоступлениеДенежныхСредств,
				НСтр("ru='Оплата платежной картой'"),
				НСтр("ru='Возврат оплаты платежной картой'")) );
				
		ИначеЕсли МетаданныеДокумента.Имя = "ЗаявкаНаВозврат" Тогда
			
			ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Документ",
				"ИФО,КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,Подразделение,Контрагент,Договор,
				|СчетРасчетов,СпособПогашенияЗадолженности,ДопСубконтоРасчетов,ВидРасчетов,ОплатитьДо,
				|ИсточникСредств,ДопКлассификация,КодМероприятия,КодЦели,ВалютаДокумента,
				|НазначениеПлатежа,СуммаДокумента,СуммаДокументаВВалюте",
				Документ, Реквизиты);
			
			Запрос.Текст = Запрос.Текст +
			"ВЫБРАТЬ
			|	ЛОЖЬ КАК ЭтоПоступление,
			|	РасшифровкаПлатежа.ИФО КАК ИФО,
			|	РасшифровкаПлатежа.Подразделение КАК Подразделение,
			|	РасшифровкаПлатежа.КФО КАК КФО,
			|	РасшифровкаПлатежа.КБКНазначениеПлатежа КАК КПС,
			|	РасшифровкаПлатежа.КОСГУНазначениеПлатежа КАК КЭК,
			|	РасшифровкаПлатежа.Контрагент КАК Контрагент,
			|	РасшифровкаПлатежа.Договор КАК Договор,
			|	РасшифровкаПлатежа.Договор.ВидДоговора КАК ВидДоговора,
			|	РасшифровкаПлатежа.Договор.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
			|	РасшифровкаПлатежа.ВалютаДокумента КАК Валюта,
			|	РасшифровкаПлатежа.СчетРасчетов КАК СчетРасчетов,
			|	РасшифровкаПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
			|	РасшифровкаПлатежа.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
			|	РасшифровкаПлатежа.ВидРасчетов КАК ВидРасчетов,
			|	РасшифровкаПлатежа.ОплатитьДо КАК ОплатитьДо,
			|	РасшифровкаПлатежа.ИсточникСредств КАК ИсточникСредств,
			|	РасшифровкаПлатежа.ДопКлассификация КАК ДопКлассификация,
			|	РасшифровкаПлатежа.КодМероприятия КАК КодМероприятия,
			|	РасшифровкаПлатежа.КодЦели КАК КодЦели,
			|	РасшифровкаПлатежа.НазначениеПлатежа КАК НазначениеПлатежа,
			|	РасшифровкаПлатежа.СуммаДокументаВВалюте КАК СуммаРасчетов,
			|	РасшифровкаПлатежа.СуммаДокумента КАК СуммаРуб,
			|	ЗНАЧЕНИЕ(Перечисление.ПорядокОтраженияАвансовУСН.ПустаяСсылка) КАК ОтражениеАвансаУСН
			|ИЗ
			|	Документ КАК РасшифровкаПлатежа";
			
		Иначе
			
			// В этих документах расчеты только в рублях, даже если документ оформлен в валюте.
			ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Документ",
				"ИФО,КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,Подразделение,Контрагент,Договор,
				|СчетРасчетов,СпособПогашенияЗадолженности,ДопСубконтоРасчетов,ВидРасчетов,ОплатитьДо,
				|ИсточникСредств,ДопКлассификация,КодМероприятия,КодЦели,
				|НазначениеПлатежа,СуммаДокумента",
				Документ, Реквизиты);
			
			Запрос.Текст = Запрос.Текст +
			"ВЫБРАТЬ
			|	ЛОЖЬ КАК ЭтоПоступление,
			|	РасшифровкаПлатежа.ИФО КАК ИФО,
			|	РасшифровкаПлатежа.Подразделение КАК Подразделение,
			|	РасшифровкаПлатежа.КФО КАК КФО,
			|	РасшифровкаПлатежа.КБКНазначениеПлатежа КАК КПС,
			|	РасшифровкаПлатежа.КОСГУНазначениеПлатежа КАК КЭК,
			|	РасшифровкаПлатежа.Контрагент КАК Контрагент,
			|	РасшифровкаПлатежа.Договор КАК Договор,
			|	РасшифровкаПлатежа.Договор.ВидДоговора КАК ВидДоговора,
			|	РасшифровкаПлатежа.Договор.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
			|	&ВалютаРеглУчета КАК Валюта,
			|	РасшифровкаПлатежа.СчетРасчетов КАК СчетРасчетов,
			|	РасшифровкаПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
			|	РасшифровкаПлатежа.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
			|	РасшифровкаПлатежа.ВидРасчетов КАК ВидРасчетов,
			|	РасшифровкаПлатежа.ОплатитьДо КАК ОплатитьДо,
			|	РасшифровкаПлатежа.ИсточникСредств КАК ИсточникСредств,
			|	РасшифровкаПлатежа.ДопКлассификация КАК ДопКлассификация,
			|	РасшифровкаПлатежа.КодМероприятия КАК КодМероприятия,
			|	РасшифровкаПлатежа.КодЦели КАК КодЦели,
			|	РасшифровкаПлатежа.НазначениеПлатежа КАК НазначениеПлатежа,
			|	РасшифровкаПлатежа.СуммаДокумента КАК СуммаРасчетов,
			|	РасшифровкаПлатежа.СуммаДокумента КАК СуммаРуб,
			|	ЗНАЧЕНИЕ(Перечисление.ПорядокОтраженияАвансовУСН.ПустаяСсылка) КАК ОтражениеАвансаУСН
			|ИЗ
			|	Документ КАК РасшифровкаПлатежа";
			Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
			
		КонецЕсли;
		
		Если ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("КорСчет", МетаданныеДокумента) Тогда
			
			Если БухгалтерскийУчет.СчетВИерархии(Документ.КорСчет, "206.00") Тогда
				// В новых типовых операциях, вместо доп.реквизита "Авансовый платеж",
				// счет расчетов 206.00 или 302.00 устанавливается явно в реквизите КорСчет.
				Реквизиты.Вставить("ЭтоАвансовыйПлатеж", Истина);
			КонецЕсли;
			
			Если БухгалтерскийУчет.СчетВИерархии(Документ.КорСчет, "208.00") Тогда
				// Для корректного определения счета расчетов по КЭК далее.
				Реквизиты.Вставить("СчетРасчетов", Документ.КорСчет);
			КонецЕсли;
			
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			НоваяСтрока = РасшифровкаПлатежа.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			НоваяСтрока.ЭтоАвансовыйПлатеж = Реквизиты.Свойство("ЭтоАвансовыйПлатеж") И Реквизиты.ЭтоАвансовыйПлатеж;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СчетРасчетов) И Реквизиты.Свойство("СчетРасчетов") Тогда
				// Автоматическое определение счета при проведении работает только если в расшифровке платежа СчетРасчетов не заполнен.
				Если БухгалтерскийУчет.СчетВИерархии(Реквизиты.СчетРасчетов, "205.00") Тогда
					Если ИспользуетсяСчетАП Тогда
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
							Выборка.КЭК, "205.00", , ПериодОстатков, Документ.Организация, Выборка.ИФО);
					ИначеЕсли НЕ НоваяСтрока.ЭтоАвансовыйПлатеж Тогда
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
							Выборка.КЭК, "205.00", , ПериодОстатков, Документ.Организация, Выборка.ИФО);
					Иначе // "Старые" счета учета авансов полученных получаем без ограничения по дате действия.
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
							Выборка.КЭК, "205.2А,205.3А,205.7А,205.8А");
					КонецЕсли;
				ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Реквизиты.СчетРасчетов, "209.00") Тогда
					Если ИспользуетсяСчетАП Тогда
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
							Выборка.КЭК, "209.00", , ПериодОстатков, Документ.Организация, Выборка.ИФО);
					ИначеЕсли НЕ НоваяСтрока.ЭтоАвансовыйПлатеж Тогда
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
							Выборка.КЭК, "209.00", , ПериодОстатков, Документ.Организация, Выборка.ИФО);
					Иначе // "Старые" счета учета авансов полученных получаем без ограничения по дате действия.
						НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
							Выборка.КЭК, "209.7А,209.8А");
					КонецЕсли;
				ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Реквизиты.СчетРасчетов, "206.00,302.00") Тогда
					НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
						Выборка.КЭК, ?(НоваяСтрока.ЭтоАвансовыйПлатеж, "206.00", "302.00"), , ПериодОстатков, Документ.Организация, Выборка.ИФО);
				ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Реквизиты.СчетРасчетов, "208.00") Тогда
					НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
						Выборка.КЭК, "208.00", , ПериодОстатков, Документ.Организация, Выборка.ИФО);
				ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Реквизиты.СчетРасчетов, "207.00,301.00,304.01,304.03") Тогда
					НоваяСтрока.СчетРасчетов = Реквизиты.СчетРасчетов; // Счет расчетов не определяется по КЭК, передается параметром.
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.СчетРасчетов) Тогда
				ТекстСообщения = НСтр("ru='Невозможно определить счет расчетов с контрагентом по КОСГУ ""%1"".
					|Проверьте настройки соответствия аналитических счетов КОСГУ.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.КЭК);
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.КОСГУНазначениеПлатежа", Отказ);
			Иначе
				
				Если ЗаполнениеДоговораОбязательно(НоваяСтрока.СчетРасчетов) Тогда
					
					Если ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("Договор", МетаданныеДокумента) Тогда
						Если НЕ ЗначениеЗаполнено(Документ.Договор) Тогда
							ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
								"Поле", "Заполнение", НСтр("ru = 'Договор'"));
							БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.Договор", Отказ);
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
				СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(НоваяСтрока.СчетРасчетов);
				
				Если ИспользоватьУчетПоПодразделениям
				   И СвойстваСчетаРасчетов.УчетПоПодразделениям И НЕ СвойстваСчетаРасчетов.РазрешитьНеУказыватьПодразделение
				   И НЕ ЗначениеЗаполнено(Документ.Подразделение) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
						"Поле", "Заполнение", МетаданныеДокумента.Реквизиты.Подразделение.Синоним);
					ТекстСообщения = ТекстСообщения + НСтр("ru='. Учет расчетов ведется по подразделениям.'");
					БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.Подразделение", Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаРасшифровки.СпособПогашенияЗадолженности) Тогда
			СтрокаРасшифровки.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
		КонецЕсли;
		Если СтрокаРасшифровки.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.НеПогашать Тогда
			СтрокаРасшифровки.ЭтоАвансовыйПлатеж = Истина;
		КонецЕсли;
		
		ПараметрыДопСубконтоРасчетов = УчетРасчетов.ПараметрыДопСубконтоРасчетов(СтрокаРасшифровки.СчетРасчетов);
		СтрокаРасшифровки.ВидДопСубконтоРасчетов = ПараметрыДопСубконтоРасчетов.ВидСубконто;
		
	КонецЦикла;
	
	Возврат РасшифровкаПлатежа;
	
КонецФункции

// Розничные продажи с использованием ККТ.

Функция ПодготовитьТаблицуРасшифровкаПлатежаПоОтчетуПоКассовойСмене(ОтчетПоКассовойСмене, Реквизиты, Отказ) Экспорт
	
	РасшифровкаПлатежа = ПустаяТаблицаРасшифровкаПлатежаУнифицированная();
	
	Если Не ЗначениеЗаполнено(ОтчетПоКассовойСмене) Тогда
		БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(НСтр("ru='Не указан отчет по кассовой смене.'"),
			"Объект.ДокументОснование", Отказ);
		Возврат РасшифровкаПлатежа;
	КонецЕсли;
	
	Счет20531 = БухгалтерскийУчет.СчетПоКоду("205.31");
	СписокСчетовОтбора = Новый Массив;
	Если Реквизиты.Ссылка.КорСчет = Счет20531 Тогда
		СписокСчетовОтбора.Добавить(Счет20531);
		СписокСчетовОтбора.Добавить(ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	Иначе
		СписокСчетовОтбора.Добавить(Реквизиты.Ссылка.КорСчет);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтчетПоКассовойСмене", ОтчетПоКассовойСмене);
	Запрос.УстановитьПараметр("ПриходныйКассовыйОрдер", Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("СписокСчетовОтбора", СписокСчетовОтбора);
	Запрос.УстановитьПараметр("ИФО", Реквизиты.Ссылка.ИФО);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
	|	ПриходныйКассовыйОрдер.ДокументОснование КАК ДокументОснование,
	|	ПриходныйКассовыйОрдер.ИФО КАК ИФО,
	|	ПриходныйКассовыйОрдер.Подразделение КАК Подразделение,
	|	ПриходныйКассовыйОрдер.КорСчет КАК КорСчет,
	|	ПриходныйКассовыйОрдер.Основание КАК Основание,
	|	ПриходныйКассовыйОрдер.ВалютаДокумента КАК ВалютаДокумента
	|ПОМЕСТИТЬ ПриходныйКассовыйОрдер
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Ссылка = &ПриходныйКассовыйОрдер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Расшифровка платежа"" КАК ИмяСписка,
	|	""Расшифровка платежа"" КАК СинонимСписка,
	|	ОтчетПоКассовойСменеОплатаНаличными.НомерСтроки КАК НомерСтроки,
	|	ИСТИНА КАК ЭтоПоступление,
	|	ЛОЖЬ КАК ЭтоАвансовыйПлатеж,
	|	ПриходныйКассовыйОрдер.ИФО КАК ИФО,
	|	ВЫРАЗИТЬ(ОтчетПоКассовойСменеОплатаНаличными.СтатьяАналитикиОплаты КАК Справочник.СтатьиАналитикиОплатыЧекаККМ).КФО КАК КФО,
	|	ВЫРАЗИТЬ(ОтчетПоКассовойСменеОплатаНаличными.СтатьяАналитикиОплаты КАК Справочник.СтатьиАналитикиОплатыЧекаККМ).КПС КАК КПС,
	|	ВЫРАЗИТЬ(ОтчетПоКассовойСменеОплатаНаличными.СтатьяАналитикиОплаты КАК Справочник.СтатьиАналитикиОплатыЧекаККМ).КЭК КАК КЭК,
	|	ПриходныйКассовыйОрдер.Подразделение КАК Подразделение,
	|	ОтчетПоКассовойСменеОплатаНаличными.Контрагент КАК Контрагент,
	|	ОтчетПоКассовойСменеОплатаНаличными.Договор КАК Договор,
	|	ОтчетПоКассовойСменеОплатаНаличными.Договор.ВестиГрафикПлатежей КАК ВестиГрафикПлатежей,
	|	ПриходныйКассовыйОрдер.КорСчет КАК СчетРасчетов,
	|	ПриходныйКассовыйОрдер.ВалютаДокумента КАК Валюта,
	|	ОтчетПоКассовойСменеОплатаНаличными.Сумма КАК СуммаРасчетов,
	|	ОтчетПоКассовойСменеОплатаНаличными.Сумма КАК СуммаРуб,
	|	ВЫБОР
	|		КОГДА ОтчетПоКассовойСменеОплатаНаличными.СистемаНалогообложенияЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ВидыСистемыНалогообложенияЧекаККМ.ЕНВД)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПорядокОтраженияАвансовУСН.ДоходЕНВД)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПорядокОтраженияАвансовУСН.ДоходУСН)
	|	КОНЕЦ КАК ОтражениеАвансаУСН,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиСредств.ПустаяСсылка) КАК ИсточникСредств,
	|	ВЫРАЗИТЬ(ОтчетПоКассовойСменеОплатаНаличными.СтатьяАналитикиОплаты КАК Справочник.СтатьиАналитикиОплатыЧекаККМ).ДопКлассификация КАК ДопКлассификация,
	|	ВЫРАЗИТЬ(ОтчетПоКассовойСменеОплатаНаличными.СтатьяАналитикиОплаты КАК Справочник.СтатьиАналитикиОплатыЧекаККМ).КодМероприятия КАК КодМероприятия,
	|	ВЫРАЗИТЬ(ОтчетПоКассовойСменеОплатаНаличными.СтатьяАналитикиОплаты КАК Справочник.СтатьиАналитикиОплатыЧекаККМ).КодЦели КАК КодЦели,
	|	ПриходныйКассовыйОрдер.Основание КАК НазначениеПлатежа,
	|	ОтчетПоКассовойСменеОплатаНаличными.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	|	ОтчетПоКассовойСменеОплатаНаличными.ВидРасчетов КАК ВидРасчетов,
	|	ОтчетПоКассовойСменеОплатаНаличными.ОплатитьДо КАК ОплатитьДо
	|ИЗ
	|	Документ.ОтчетПоКассовойСмене.ОплатаНаличными КАК ОтчетПоКассовойСменеОплатаНаличными
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ОтчетПоКассовойСменеОплатаНаличными.Ссылка = &ОтчетПоКассовойСмене
	|	И ВЫРАЗИТЬ(ОтчетПоКассовойСменеОплатаНаличными.СтатьяАналитикиОплаты КАК Справочник.СтатьиАналитикиОплатыЧекаККМ).СчетУчета В (&СписокСчетовОтбора)
	|	И ОтчетПоКассовойСменеОплатаНаличными.СтатьяАналитикиОплаты.ИФО = &ИФО";
	
	ДвижениеДенежныхСредств = Запрос.Выполнить().Выгрузить();
	ДвижениеДенежныхСредств.Свернуть("ИмяСписка, СинонимСписка, ЭтоПоступление, ЭтоАвансовыйПлатеж, ИФО,
	|КФО, КПС, КЭК, Подразделение, Контрагент, Договор, ВестиГрафикПлатежей, СчетРасчетов, Валюта, ОтражениеАвансаУСН, ИсточникСредств,
	|ДопКлассификация, КодМероприятия, КодЦели, НазначениеПлатежа, ПризнакСпособаРасчетаЧекаККМ, ВидРасчетов, ОплатитьДо", "СуммаРасчетов, СуммаРуб");
	
	НетКолонкиСчетАвансов = (РасшифровкаПлатежа.Колонки.Найти("СчетАвансов") = Неопределено);
	Если НетКолонкиСчетАвансов Тогда
		РасшифровкаПлатежа.Колонки.Добавить("СчетАвансов", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	КонецЕсли;
	
	Для Каждого Строка Из ДвижениеДенежныхСредств Цикл
		
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ПредоплатаЧастичная Или
			Строка.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная Тогда 
			ЭтоАвансовыйПлатеж = Истина;
		Иначе
			ЭтоАвансовыйПлатеж = Ложь;
		КонецЕсли;	
		НоваяСтрока.ЭтоАвансовыйПлатеж = ЭтоАвансовыйПлатеж;		
		Если НоваяСтрока.ЭтоАвансовыйПлатеж Тогда 
			НоваяСтрока.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.НеПогашать;
		Иначе
			НоваяСтрока.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.ВидРасчетов) Тогда 
			НоваяСтрока.ВидРасчетов = Строка.ВидРасчетов;
		Иначе	
			НоваяСтрока.ВидРасчетов = Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг;
		КонецЕсли;	
		НоваяСтрока.ОплатитьДо = Строка.ОплатитьДо;
		
		ПараметрыДопСубконтоРасчетов = УчетРасчетов.ПараметрыДопСубконтоРасчетов(НоваяСтрока.СчетРасчетов);
		НоваяСтрока.ВидДопСубконтоРасчетов = ПараметрыДопСубконтоРасчетов.ВидСубконто;
		
		// Определим счета авансов, если они еще не указаны в таблице.
		Если НетКолонкиСчетАвансов Тогда
			ПериодОстатков = УчетРасчетов.ПериодПолученияОстатков(Реквизиты, "Дата");
			НоваяСтрока.СчетАвансов = УчетРасчетов.ОпределитьСчетАвансов(Строка.СчетРасчетов,
				ПериодОстатков, Реквизиты.Организация);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РасшифровкаПлатежа;
	
КонецФункции

// Перечисление компенсации родительской платы.

Функция ДетализироватьРасшифровкуПлатежаПоПолучателямКомпенсации(РасшифровкаПлатежа, Документ, Параметры = Неопределено, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(Параметры.ВедомостьКомпенсацииРодительскойПлаты)
		ИЛИ ТипЗнч(Параметры.ВедомостьКомпенсацииРодительскойПлаты) <> Тип("ДокументСсылка.ВедомостьКомпенсацииРодительскойПлатыКВыплате") Тогда
		Возврат РасшифровкаПлатежа; // Ведомость компенсации родительской платы не указана.
		// Будем считать получателем компенсации контрагента, указанного в расчетно-платежном документе.
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// Список сотрудников из ведомости компенсации родительской платы поместим в виртуальную таблицу.
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ВедомостьКомпенсации",
		"Ребенок,Договор,Плательщик,СуммаКомпенсации,КПС,КФО,Аннулировано",
		Параметры.ВедомостьКомпенсацииРодительскойПлаты, Параметры);
	
	// Сохраним все колонки унифицированной таблицы расшифровки платежа.
	Запрос.УстановитьПараметр("РасшифровкаПлатежаУнифицированная", РасшифровкаПлатежа);
	ИменаОбщихПолей = Новый Массив;
	ОбщиеПоляЗапроса = "";
	КолонкиЗаполняемыеИзВедомости = Новый Структура("Контрагент,Договор,СуммаРасчетов,СуммаРуб,СуммаПроданнойВалюты");
	Для Каждого Колонка Из РасшифровкаПлатежа.Колонки Цикл
		Если КолонкиЗаполняемыеИзВедомости.Свойство(Колонка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		ИменаОбщихПолей.Добавить(Колонка.Имя);
		ОбщиеПоляЗапроса = ?(ЗначениеЗаполнено(ОбщиеПоляЗапроса), ОбщиеПоляЗапроса + ",", "") + "
			|	РасшифровкаПлатежа." + Колонка.Имя + " КАК " + Колонка.Имя;
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	&ОбщиеПоляЗапроса
	|ПОМЕСТИТЬ ТаблицаРасшифровкаПлатежаУнифицированная
	|ИЗ
	|	&РасшифровкаПлатежаУнифицированная КАК РасшифровкаПлатежа
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ОбщиеПоляЗапроса,
	|	ВедомостьКомпенсации.Ребенок КАК Ребенок,
	|	ВедомостьКомпенсации.Плательщик КАК Контрагент,
	|	ВедомостьКомпенсации.Договор КАК Договор,
	|	ВедомостьКомпенсации.СуммаКомпенсации КАК СуммаРасчетов,
	|	ВедомостьКомпенсации.СуммаКомпенсации КАК СуммаПроданнойВалюты,
	|	ВедомостьКомпенсации.СуммаКомпенсации КАК СуммаРуб
	|ПОМЕСТИТЬ РаспределенныеСуммы
	|ИЗ
	|	ТаблицаРасшифровкаПлатежаУнифицированная КАК РасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВедомостьКомпенсации КАК ВедомостьКомпенсации
	|		ПО РасшифровкаПлатежа.КФО = ВедомостьКомпенсации.КФО
	|		И РасшифровкаПлатежа.КПС = ВедомостьКомпенсации.КПС
	|ГДЕ
	|	НЕ ВедомостьКомпенсации.Аннулировано
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ОбщиеПоляЗапроса
	|ПОМЕСТИТЬ НераспределеннаяСтрокаПлатежа
	|ИЗ
	|	ТаблицаРасшифровкаПлатежаУнифицированная КАК РасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределенныеСуммы КАК РаспределенныеСуммы
	|		ПО &УсловиеСоединенияНераспределеннаяСтрокаПлатежа
	|ГДЕ
	|	&ПервоеОбщееПолеРаспределенныеСуммы ЕСТЬ NULL
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ОбщиеПоляЗапроса,
	|	ВедомостьКомпенсации.Ребенок КАК Ребенок,
	|	ВедомостьКомпенсации.Плательщик КАК Контрагент,
	|	ВедомостьКомпенсации.Договор КАК Договор,
	|	ВедомостьКомпенсации.СуммаКомпенсации КАК СуммаРасчетов,
	|	ВедомостьКомпенсации.СуммаКомпенсации КАК СуммаПроданнойВалюты,
	|	ВедомостьКомпенсации.СуммаКомпенсации КАК СуммаРуб
	|ИЗ
	|	НераспределеннаяСтрокаПлатежа КАК РасшифровкаПлатежа,
	|	ТаблицаВедомостьКомпенсации КАК ВедомостьКомпенсации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РаспределенныеСуммы КАК РаспределенныеСуммы
	|		ПО ВедомостьКомпенсации.Ребенок = РаспределенныеСуммы.Ребенок
	|		И ВедомостьКомпенсации.Плательщик = РаспределенныеСуммы.Контрагент
	|		И ВедомостьКомпенсации.Договор = РаспределенныеСуммы.Договор
	|		И ВедомостьКомпенсации.СуммаКомпенсации = РаспределенныеСуммы.СуммаРасчетов
	|		И ВедомостьКомпенсации.СуммаКомпенсации = РаспределенныеСуммы.СуммаПроданнойВалюты
	|		И ВедомостьКомпенсации.СуммаКомпенсации = РаспределенныеСуммы.СуммаРуб
	|ГДЕ
	|	РаспределенныеСуммы.Ребенок ЕСТЬ NULL
	|	И НЕ ВедомостьКомпенсации.Аннулировано
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ОбщиеПоляЗапроса,
	|	РасшифровкаПлатежа.Ребенок КАК Ребенок,
	|	РасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	РасшифровкаПлатежа.Договор КАК Договор,
	|	РасшифровкаПлатежа.СуммаРасчетов КАК СуммаРасчетов,
	|	РасшифровкаПлатежа.СуммаПроданнойВалюты КАК СуммаПроданнойВалюты,
	|	РасшифровкаПлатежа.СуммаРуб КАК СуммаРуб
	|ИЗ
	|	РаспределенныеСуммы КАК РасшифровкаПлатежа
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА
	|ИЗ
	|	НераспределеннаяСтрокаПлатежа КАК НераспределеннаяСтрокаПлатежа
	|";
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ОбщиеПоляЗапроса",
		ТекстВыборкиПолей("РасшифровкаПлатежа", ИменаОбщихПолей));
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&УсловиеСоединенияНераспределеннаяСтрокаПлатежа",
		ТекстСоединенияТаблиц("РасшифровкаПлатежа", "РаспределенныеСуммы", ИменаОбщихПолей));
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ПервоеОбщееПолеРаспределенныеСуммы",
		ПервоеОбщееПоле("РаспределенныеСуммы", ИменаОбщихПолей));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДвижениеДенежныхСредств = РезультатЗапроса[РезультатЗапроса.Вграница() - 1].Выгрузить();
	НераспределенныеСтроки = РезультатЗапроса[РезультатЗапроса.Вграница()].Выгрузить();
	
	Если Документ.СуммаДокумента <> ДвижениеДенежныхСредств.Итог("СуммаРасчетов") Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Сумма платежа %1 не совпадает с итогом по ведомости ""%2"": %3'"),
			Документ.СуммаДокумента,
			Параметры.ВедомостьКомпенсацииРодительскойПлаты,
			ДвижениеДенежныхСредств.Итог("СуммаРасчетов"));
		БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "СуммаДокумента", Отказ);
		Возврат РасшифровкаПлатежа;
	КонецЕсли;
	
	ПредставлениеПериода = БухгалтерскиеОперации.ПолучитьПредставлениеПериода(
		НачалоДня(Параметры.ВедомостьКомпенсацииРодительскойПлаты.НачалоПериода),
		КонецДня(Параметры.ВедомостьКомпенсацииРодительскойПлаты.КонецПериода));
	
	Для Каждого СтрокаТаблицы Из ДвижениеДенежныхСредств Цикл
		
		СтрокаТаблицы.НазначениеПлатежа =
			?(ПустаяСтрока(СтрокаТаблицы.НазначениеПлатежа), "", СтрокаТаблицы.НазначениеПлатежа + ": ")
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1, %2",
				СтрокаТаблицы.Ребенок, ПредставлениеПериода);
		
	КонецЦикла;
	
	Возврат ДвижениеДенежныхСредств;
	
КонецФункции

Функция ТекстВыборкиПолей(ИмяТаблицы, Поля)
	
	ВсеПоля = Новый Массив;
	ШаблонПоля = ИмяТаблицы + ".%1 КАК %1";
	Для Каждого Поле Из Поля Цикл
		ВсеПоля.Добавить(СтрШаблон(ШаблонПоля, Поле));
	КонецЦикла;
	Возврат СтрСоединить(ВсеПоля, "," + Символы.ПС + Символы.Таб);
	
КонецФункции

Функция ТекстСоединенияТаблиц(ЛеваяТаблица, ПраваяТаблица, Поля)
	ВсеУсловия = Новый Массив;
	ШаблонУсловия = ЛеваяТаблица + ".%1 = " + ПраваяТаблица + ".%1";
	Для Каждого Поле Из Поля Цикл
		ВсеУсловия.Добавить(СтрШаблон(ШаблонУсловия, Поле));
	КонецЦикла;
	Возврат СтрСоединить(ВсеУсловия, Символы.ПС + Символы.Таб + "И ");
КонецФункции

Функция ПервоеОбщееПоле(ИмяТаблицы, Поля)
	Возврат ИмяТаблицы + "." + Поля[0];
КонецФункции

// Перечисление сотрудникам по "Ведомости в банк".

Функция ДетализироватьРасшифровкуПлатежаПоВедомостиПеречислений(РасшифровкаПлатежа, Документ, Параметры = Неопределено, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(Параметры.ВедомостьНаВыплатуВБанк)
		ИЛИ ТипЗнч(Параметры.ВедомостьНаВыплатуВБанк) <> Тип("ДокументСсылка.ВедомостьНаВыплатуВБанк") Тогда
		Возврат РасшифровкаПлатежа;
		// Если ведомости нет, то получателем является контрагент из в расчетно-платежного документа.
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	// Список сотрудников из ведомости перечислений поместим в виртуальную таблицу.
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "РасшифровкаПлатежа",
		"СотрудникКонтрагент,Сотрудник,Контрагент,ОснованиеПринятияОбязательства,КФО,КПС,КЭК,КодЦели,КодМероприятия,ДопКлассификация,Сумма",
		Параметры.ВедомостьНаВыплатуВБанк, Параметры);
	
	// Сохраним все колонки унифицированной таблицы расшифровки платежа.
	Запрос.УстановитьПараметр("РасшифровкаПлатежаУнифицированная", РасшифровкаПлатежа);
	ОбщиеПоляЗапроса = "";
	Для Каждого Колонка Из РасшифровкаПлатежа.Колонки Цикл
		Если СтрНайти("Контрагент,Договор,СуммаРасчетов,СуммаРуб,СуммаПроданнойВалюты", Колонка.Имя) > 0 Тогда
			Продолжить; // Эти колонки заполним по ведомости перечислений.
		КонецЕсли;
		ОбщиеПоляЗапроса = ?(ЗначениеЗаполнено(ОбщиеПоляЗапроса), ОбщиеПоляЗапроса + ",", "") + "
			|	РасшифровкаПлатежа." + Колонка.Имя + " КАК " + Колонка.Имя;
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ" + ОбщиеПоляЗапроса + "
	|ПОМЕСТИТЬ ТаблицаРасшифровкаПлатежаУнифицированная
	|ИЗ
	|	&РасшифровкаПлатежаУнифицированная КАК РасшифровкаПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ" + ОбщиеПоляЗапроса + ",
	|	ВЫБОР
	|		КОГДА ВедомостьПеречислений.СотрудникКонтрагент = 0
	|			ТОГДА ВедомостьПеречислений.Сотрудник.Контрагент
	|		ИНАЧЕ ВедомостьПеречислений.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВедомостьПеречислений.ОснованиеПринятияОбязательства КАК Договор,
	|	ВедомостьПеречислений.Сумма КАК СуммаРасчетов,
	|	ВедомостьПеречислений.Сумма КАК СуммаПроданнойВалюты,
	|	ВедомостьПеречислений.Сумма КАК СуммаРуб
	|ИЗ
	|	ТаблицаРасшифровкаПлатежаУнифицированная КАК РасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРасшифровкаПлатежа КАК ВедомостьПеречислений
	|		ПО РасшифровкаПлатежа.КФО = ВедомостьПеречислений.КФО
	|			И РасшифровкаПлатежа.КПС = ВедомостьПеречислений.КПС
	|			И РасшифровкаПлатежа.КЭК = ВедомостьПеречислений.КЭК
	|			И РасшифровкаПлатежа.КодЦели = ВедомостьПеречислений.КодЦели
	|			И РасшифровкаПлатежа.КодМероприятия = ВедомостьПеречислений.КодМероприятия
	|			И РасшифровкаПлатежа.ДопКлассификация = ВедомостьПеречислений.ДопКлассификация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьНомерРеестраВВедомости(Ведомость) Экспорт
	
	Если Не ЗначениеЗаполнено(Ведомость.НастройкаВыгрузки) Тогда
		Возврат;
	КонецЕсли;
	
	Год = Год(Ведомость.Дата);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НумераторРеестровКомпенсацииРодительскойПлаты");
	ЭлементБлокировки.УстановитьЗначение("НастройкаВыгрузкиКомпенсацииРодительскойПлаты", Ведомость.НастройкаВыгрузки);
	ЭлементБлокировки.УстановитьЗначение("Год", Год);
	Блокировка.Заблокировать();
	
	Запись = РегистрыСведений.НумераторРеестровКомпенсацииРодительскойПлаты.СоздатьМенеджерЗаписи();
	Запись.НастройкаВыгрузкиКомпенсацииРодительскойПлаты = Ведомость.НастройкаВыгрузки;
	Запись.Год = Год;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		НомерРеестраВРегистре = Запись.ТекущийНомерВыгрузки;
	Иначе
		НомерРеестраВРегистре = 0;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ведомость.НомерРеестра) Тогда
		Если Не Ведомость.ЭтоНовый() Тогда
			// Если документ не новый и уже содержится в задании на экспорт, то номер реестра не присваивается
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.ОбъектыОбмена КАК ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена
			|ГДЕ
			|	НЕ ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.Ссылка.ПометкаУдаления
			|	И ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.Объект = &Ведомость";
			Запрос.УстановитьПараметр("Ведомость", Ведомость.Ссылка);
			Если Не Запрос.Выполнить().Пустой() Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Ведомость.НомерРеестра = НомерРеестраВРегистре + 1;
	Иначе
		// Проверка, что указанный номер реестра уже не используется в другом документе
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВедомостьНаВыплатуВБанк.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВедомостьНаВыплатуВБанк КАК ВедомостьНаВыплатуВБанк
		|ГДЕ
		|	ВедомостьНаВыплатуВБанк.Ссылка <> &Ссылка
		|	И ВедомостьНаВыплатуВБанк.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ГОД) И &Дата
		|	И ВедомостьНаВыплатуВБанк.НастройкаВыгрузки = &НастройкаВыгрузки
		|	И ВедомостьНаВыплатуВБанк.НомерРеестра = &НомерРеестра
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВедомостьКомпенсацииРодительскойПлатыКВыплате.Ссылка
		|ИЗ
		|	Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате КАК ВедомостьКомпенсацииРодительскойПлатыКВыплате
		|ГДЕ
		|	ВедомостьКомпенсацииРодительскойПлатыКВыплате.Ссылка <> &Ссылка
		|	И ВедомостьКомпенсацииРодительскойПлатыКВыплате.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ГОД) И &Дата
		|	И ВедомостьКомпенсацииРодительскойПлатыКВыплате.НастройкаВыгрузки = &НастройкаВыгрузки
		|	И ВедомостьКомпенсацииРодительскойПлатыКВыплате.НомерРеестра = &НомерРеестра";
		
		Запрос.УстановитьПараметр("Ссылка", Ведомость.Ссылка);
		Запрос.УстановитьПараметр("Дата", Ведомость.Дата);
		Запрос.УстановитьПараметр("НастройкаВыгрузки", Ведомость.НастройкаВыгрузки);
		Запрос.УстановитьПараметр("НомерРеестра", Ведомость.НомерРеестра);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Выбранный номер реестра уже используется в документе %1.
					|Рекомендуется указать другой номер либо очистить его - тогда он автоматически будет присвоен при записи документа.'"),
				Выборка.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Ведомость.НомерРеестра > НомерРеестраВРегистре Тогда
		Запись.НастройкаВыгрузкиКомпенсацииРодительскойПлаты = Ведомость.НастройкаВыгрузки;
		Запись.Год = Год;
		Запись.ТекущийНомерВыгрузки = Ведомость.НомерРеестра;
		Запись.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Остатки задолженности.

Функция ОстаткиЗадолженности(Период, РасшифровкаПлатежа, Реквизиты) Экспорт
	
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МоментВремени", Период);
	Запрос.УстановитьПараметр("Организация",   Реквизиты.Организация);
	
	Запрос.УстановитьПараметр("ИспользоватьВалютныйУчет", Реквизиты.ИспользоватьВалютныйУчет);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	Запрос.УстановитьПараметр("УчитыватьЗадолженностьЕНВД",
		?(Реквизиты.Свойство("УчитыватьЗадолженностьЕНВД"), Реквизиты.УчитыватьЗадолженностьЕНВД, Ложь));
	
	ПараметрыОтбора = ПараметрыОтбораОстатковЗадолженности(РасшифровкаПлатежа, Реквизиты);
	КолонкиПараметровУчета = 
		"УчетПоИФО, УчетПоКПС, УчетПоПодразделениям,
		|КонтрагентЕстьСубконто,ДоговорЕстьСубконто,
		|ДопАналитикаЕстьСубконто,ДопАналитикаВидСубконто";
	ТаблицаПараметровУчета = ПараметрыОтбора.Скопировать();
	ТаблицаПараметровУчета.Свернуть(КолонкиПараметровУчета);
	ТаблицаПараметровУчета.Колонки.Добавить("НомераСубконто", Новый ОписаниеТипов("Соответствие"));
	
	// Блокируем регистр бухгалтерии для получения остатков.
	УстанавливатьБлокировку = ?(Реквизиты.Свойство("ТиповаяОперация"), Реквизиты.ТиповаяОперация.УстанавливатьБлокировку, Ложь);
	Если УстанавливатьБлокировку Тогда
		
		//Блокировка = Новый БлокировкаДанных;
		//
		//Для Каждого СтрокаСчета Из ТаблицаСчетов Цикл
		//
		//	ДанныеСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаСчета.СчетРасчетов);
		//	
		//	ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.ЖурналПроводокЕПСБУ");
		//	ЭлементБлокировки.УстановитьЗначение("Период",      Новый Диапазон(, Реквизиты.Дата));
		//	ЭлементБлокировки.УстановитьЗначение("Организация", Реквизиты.Организация);
		//	ЭлементБлокировки.УстановитьЗначение("КФО",         СтрокаСчета.КФО);
		//	
		//	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		//		ЭлементБлокировки.УстановитьЗначение("ИФО", СтрокаСчета.ИФО);
		//	КонецЕсли;
		//	
		//	ЭлементБлокировки.УстановитьЗначение("Счет", СтрокаСчета.СчетРасчетов);
		//	
		//	ОтборПоСчету = Новый Структура("ВидАванса,ИФО,КФО,СчетРасчетов,СчетАвансов",
		//		СтрокаСчета.ИФО, СтрокаСчета.КФО, СтрокаСчета.СчетРасчетов, СтрокаСчета.СчетАвансов);
		//	ТаблицаДоговоровПоСчету = ТаблицаДоговоров.Скопировать(ОтборПоСчету, "Контрагент,Договор");
		//	ЭлементБлокировки.ИсточникДанных = ТаблицаДоговоровПоСчету;
		//	
		//	Для НомерСубконто = 1 По ДанныеСчета.КоличествоСубконто Цикл
		//		Если ДанныеСчета["ВидСубконто" + НомерСубконто] = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты Тогда
		//			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
		//				ПланыВидовХарактеристик.ВидыСубконто.Контрагенты, "Контрагент");
		//		ИначеЕсли ДанныеСчета["ВидСубконто" + НомерСубконто] = ПланыВидовХарактеристик.ВидыСубконто.Договоры Тогда
		//			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(
		//				ПланыВидовХарактеристик.ВидыСубконто.Договоры, "Договор");
		//		КонецЕсли;
		//	КонецЦикла;
		//	
		//КонецЦикла;
		//
		//Блокировка.Заблокировать();
		
	КонецЕсли;
	
	// Текст запроса по остаткам формируется для каждого набора параметров учета расчетов.
	ТекстОбщегоЗапроса = "";
	Для НомерЗапроса=1 По ТаблицаПараметровУчета.Количество() Цикл
		
		НаборПараметровУчета = ТаблицаПараметровУчета[НомерЗапроса-1];
		
		Если НЕ НаборПараметровУчета.КонтрагентЕстьСубконто Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСубконто = Новый Массив;
		
		// Контрагент.
		МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
		НаборПараметровУчета.НомераСубконто.Вставить("Контрагент", 1);
		
		// Договор.
		Если НаборПараметровУчета.ДоговорЕстьСубконто Тогда
			
			МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
			НаборПараметровУчета.НомераСубконто.Вставить("Договор",
				НаборПараметровУчета.НомераСубконто.Количество() + 1);
			
		КонецЕсли;
		
		// ДопАналитика (документ расчетов или др.).
		Если НаборПараметровУчета.ДопАналитикаЕстьСубконто Тогда
			
			МассивСубконто.Добавить(НаборПараметровУчета.ДопАналитикаВидСубконто);
			НаборПараметровУчета.НомераСубконто.Вставить("ДопАналитика",
				НаборПараметровУчета.НомераСубконто.Количество() + 1);
			
		КонецЕсли;
		
		// Добавляем виртуальную таблицу.
		Запрос.Текст = Запрос.Текст + ТекстЗапросаОстаткиЗадолженности(НаборПараметровУчета, НомерЗапроса);
		
		// Устанавливаем параметры виртуальной таблицы.
		Отбор = Новый Структура(КолонкиПараметровУчета);
		ЗаполнитьЗначенияСвойств(Отбор, НаборПараметровУчета);
		ОтборОстатков = ПараметрыОтбора.Скопировать(Отбор);
		
		Запрос.УстановитьПараметр("Счета" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("СчетОстатков")) );
		Запрос.УстановитьПараметр("ИФО" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("ИФО")) );
		Запрос.УстановитьПараметр("КФО" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("КФО")) );
		Запрос.УстановитьПараметр("КПС" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("КПС")) );
		Запрос.УстановитьПараметр("Подразделение" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("Подразделение")) );
		Запрос.УстановитьПараметр("Контрагенты" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("Контрагент")) );
		Запрос.УстановитьПараметр("Договоры" + НомерЗапроса,
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОтборОстатков.ВыгрузитьКолонку("Договор")) );
		Запрос.УстановитьПараметр("УчетПоПодразделениям" + НомерЗапроса,
			НаборПараметровУчета.УчетПоПодразделениям);
		Запрос.УстановитьПараметр("УчетПоКПС" + НомерЗапроса,
			НаборПараметровУчета.УчетПоКПС);
		Запрос.УстановитьПараметр("ДопАналитикаВидСубконто" + НомерЗапроса,
			НаборПараметровУчета.ДопАналитикаВидСубконто);
		
		Запрос.УстановитьПараметр("Субконто" + НомерЗапроса, МассивСубконто);
		
		// Соединение виртуальных таблиц.
		Если НЕ ПустаяСтрока(ТекстОбщегоЗапроса) Тогда
			ТекстОбщегоЗапроса = ТекстОбщегоЗапроса + "
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|";
		КонецЕсли;
		
		ТекстОбщегоЗапроса = ТекстОбщегоЗапроса +
		"ВЫБРАТЬ
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.СчетРасчетов КАК СчетРасчетов,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.УчетПоПодразделениям КАК УчетПоПодразделениям,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.УчетПоКПС КАК УчетПоКПС,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.ИФО КАК ИФО,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.КФО КАК КФО,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.КПС КАК КПС,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.Подразделение КАК Подразделение,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.Контрагент КАК Контрагент,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.Договор КАК Договор,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.ВидДопСубконтоРасчетов КАК ВидДопСубконтоРасчетов,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.Валюта КАК Валюта,
		|	СУММА(ТаблицаОстаткиЗадолженности_НомерЗапроса.СуммаРасчетов) КАК СуммаРасчетов,
		|	СУММА(ТаблицаОстаткиЗадолженности_НомерЗапроса.СуммаРуб) КАК СуммаРуб,
		|	СУММА(ТаблицаОстаткиЗадолженности_НомерЗапроса.СуммаЕНВДРуб) КАК СуммаЕНВДРуб
		|ИЗ
		|	ОстаткиЗадолженности_НомерЗапроса КАК ТаблицаОстаткиЗадолженности_НомерЗапроса
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.СчетРасчетов,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.УчетПоПодразделениям,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.УчетПоКПС,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.ИФО,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.КФО,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.КПС,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.Подразделение,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.Контрагент,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.Договор,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.ДопСубконтоРасчетов,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.ВидДопСубконтоРасчетов,
		|	ТаблицаОстаткиЗадолженности_НомерЗапроса.Валюта";
		
		ТекстОбщегоЗапроса = СтрЗаменить(ТекстОбщегоЗапроса, "_НомерЗапроса", Строка(НомерЗапроса));
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + ТекстОбщегоЗапроса;
	Если ПустаяСтрока(Запрос.Текст) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	ОстаткиЗадолженности = Запрос.Выполнить().Выгрузить();
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиЗадолженности, "ДопСубконтоРасчетов", "ДатаДокументаРасчетов");
	
	Возврат ОстаткиЗадолженности;
	
КонецФункции

Функция ПараметрыОтбораОстатковЗадолженности(ТаблицаДокумента, Реквизиты)
	
	ЭтоРасшифровкаПлатежа = ( ТаблицаДокумента.Колонки.Найти("ЭтоАвансовыйПлатеж") <> Неопределено );
	
	ПараметрыОтбора = ТаблицаДокумента.СкопироватьКолонки("ИФО,КФО,КПС,Подразделение,Контрагент,Договор");
	ПараметрыОтбора.Колонки.Добавить("СчетОстатков", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		Если ЭтоРасшифровкаПлатежа Тогда
			Если СтрокаДокумента.ЭтоАвансовыйПлатеж
			   И ((СтрокаДокумента.ВидАванса = "Полученный" И СтрокаДокумента.ЭтоПоступление)  // Получили аванс от покупателя.
			 ИЛИ (СтрокаДокумента.ВидАванса = "Выданный" И НЕ СтрокаДокумента.ЭтоПоступление)) // Выдали аванс поставщику.
			Тогда
				Продолжить; // Не нужно погашать задолженность.
			ИначеЕсли СтрокаДокумента.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.НеПогашать Тогда
				Продолжить; // Не нужно погашать задолженность.
			КонецЕсли;
		КонецЕсли;
		
		Отбор = ПараметрыОтбора.Добавить();
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаДокумента);
		Если ЭтоРасшифровкаПлатежа Тогда
			Отбор.СчетОстатков = СтрокаДокумента.СчетРасчетов;
		Иначе // Документы списания дебиторской и кредиторской задолженности.
			Отбор.СчетОстатков = СтрокаДокумента.Счет;
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыОтбора.Колонки.Добавить("УчетПоИФО",            Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("УчетПоКПС",            Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("УчетПоПодразделениям", Новый ОписаниеТипов("Булево"));
	
	ПараметрыОтбора.Колонки.Добавить("КонтрагентЕстьСубконто",   Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("ДоговорЕстьСубконто",      Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("ДопАналитикаЕстьСубконто", Новый ОписаниеТипов("Булево"));
	ПараметрыОтбора.Колонки.Добавить("ДопАналитикаВидСубконто",  Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто"));
	
	Для Каждого Отбор Из ПараметрыОтбора Цикл
		
		СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Отбор.СчетОстатков);
		
		Отбор.УчетПоИФО = Реквизиты.ИспользоватьУчетПоИФО;
		Отбор.УчетПоКПС = СвойстваСчета.УчетПоКПС;
		Отбор.УчетПоПодразделениям =
			Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчета.УчетПоПодразделениям;
		
		Для Индекс = 1 По СвойстваСчета.КоличествоСубконто Цикл
		
			ВидСубконто = СвойстваСчета["ВидСубконто" + Индекс];
			Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты Тогда
				Отбор.КонтрагентЕстьСубконто = Истина;
				
			ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Договоры Тогда
				Отбор.ДоговорЕстьСубконто = Истина;
				
			Иначе
				Отбор.ДопАналитикаЕстьСубконто = Истина;
				Отбор.ДопАналитикаВидСубконто  = ВидСубконто;
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПараметрыОтбора;
	
КонецФункции

Функция ТекстЗапросаОстаткиЗадолженности(ПараметрыУчета, НомерЗапроса)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Остатки.Счет КАК СчетРасчетов,
	|	&УчетПоПодразделениям_НомерЗапроса КАК УчетПоПодразделениям,
	|	&УчетПоКПС_НомерЗапроса КАК УчетПоКПС,
	|	Остатки.ИФО КАК ИФО,
	|	Остатки.КФО КАК КФО,
	|	Остатки.КПС КАК КПС,
	|	Остатки.Подразделение КАК Подразделение,
	|	Остатки.Контрагент КАК Контрагент,
	|	Остатки.Договор КАК Договор,
	|	Остатки.ДопАналитика КАК ДопСубконтоРасчетов,
	|	&ДопАналитикаВидСубконто_НомерЗапроса КАК ВидДопСубконтоРасчетов,
	|	ЕСТЬNULL(Остатки.Валюта, &ВалютаРеглУчета) КАК Валюта,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет
	|				И Остатки.Счет.Валютный
	|			ТОГДА Остатки.ВалютнаяСуммаОстаток
	|		ИНАЧЕ Остатки.СуммаОстаток
	|	КОНЕЦ КАК СуммаРасчетов,
	|	Остатки.СуммаОстаток КАК СуммаРуб,
	|	ВЫБОР
	|		КОГДА &УчитыватьЗадолженностьЕНВД
	|				И Остатки.Счет.НалоговыйУчетЕНВД
	|			ТОГДА Остатки.СуммаЕНВДОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЕНВДРуб
	|ПОМЕСТИТЬ ОстаткиЗадолженности_НомерЗапроса
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&МоментВремени,
	|			Счет В (&Счета_НомерЗапроса),
	|			&Субконто_НомерЗапроса,
	|			Организация = &Организация
	|				И &УсловиеПоИФО
	|				И &УсловиеПоКФО
	|				И &УсловиеПоКонтрагентам
	|				И &УсловиеПоДоговорам
	|				И &УсловиеПоКПС
	|				И &УсловиеПоПодразделению) КАК Остатки";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоИФО",
		?(ПараметрыУчета.УчетПоИФО, "ИФО В (&ИФО_НомерЗапроса)", "ИСТИНА") );
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКФО", "КФО В (&КФО_НомерЗапроса)");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКПС",
		?(ПараметрыУчета.УчетПоКПС, "КПС В (&КПС_НомерЗапроса)", "ИСТИНА") );
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоПодразделению",
		?(ПараметрыУчета.УчетПоПодразделениям, "Подразделение В (&Подразделение_НомерЗапроса)", "ИСТИНА") );
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоКонтрагентам",
		"Субконто"+ПараметрыУчета.НомераСубконто["Контрагент"]+" В (&Контрагенты_НомерЗапроса)");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДоговорам",
		?(ПараметрыУчета.ДоговорЕстьСубконто,
		"Субконто"+ПараметрыУчета.НомераСубконто["Договор"]+" В (&Договоры_НомерЗапроса)", "ИСТИНА") );
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Остатки.Контрагент",
		"Остатки.Субконто"+ПараметрыУчета.НомераСубконто["Контрагент"]);
	Если ПараметрыУчета.ДоговорЕстьСубконто Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Остатки.Договор",
			"Остатки.Субконто"+ПараметрыУчета.НомераСубконто["Договор"]);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Остатки.Договор",
			"НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	Если ПараметрыУчета.ДопАналитикаЕстьСубконто Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Остатки.ДопАналитика",
			"ЕСТЬNULL(Остатки.Субконто"+ПараметрыУчета.НомераСубконто["ДопАналитика"] + ", НЕОПРЕДЕЛЕНО)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Остатки.ДопАналитика",
			"НЕОПРЕДЕЛЕНО");
	КонецЕсли;
	
	Если НЕ ПараметрыУчета.УчетПоКПС Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Остатки.КПС", "ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)");
	КонецЕсли;
	Если НЕ ПараметрыУчета.УчетПоИФО Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Остатки.ИФО", "ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");
	КонецЕсли;
	Если НЕ ПараметрыУчета.УчетПоПодразделениям Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Остатки.Подразделение", "ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_НомерЗапроса", Строка(НомерЗапроса));
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ОстаткиЗадолженностиПоПлатежамВБюджеты(Период, ТаблицаДокумента, Реквизиты) Экспорт
	
	Если ТаблицаДокумента.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МоментВремени", Период);
	Запрос.УстановитьПараметр("Организация",   Реквизиты.Организация);
	
	Запрос.УстановитьПараметр("Счета30300",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("Счет")) );
	Запрос.УстановитьПараметр("ИФО",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("ИФО")) );
	Запрос.УстановитьПараметр("КФО",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("КФО")) );
	Запрос.УстановитьПараметр("КПС",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("КПС")) );
	Запрос.УстановитьПараметр("ВидНалогаИлиПлатежа",
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("ВидНалогаИлиПлатежа")) );
	
	Запрос.УстановитьПараметр("ИспользоватьВалютныйУчет", Реквизиты.ИспользоватьВалютныйУчет);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Счет КАК Счет,
	|	Остатки.Счет.УчетПоКПС КАК УчетПоКПС,
	|	Остатки.Счет.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	Остатки.Счет.Валютный КАК Валютный,
	|	Остатки.ИФО КАК ИФО,
	|	Остатки.КФО КАК КФО,
	|	Остатки.КПС КАК КПС,
	|	Остатки.Подразделение КАК Подразделение,
	|	Остатки.Субконто1 КАК Субконто1,
	|	Остатки.Субконто2 КАК Субконто2,
	|	Остатки.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА Остатки.Субконто1 ССЫЛКА Справочник.ВидыНалоговИПлатежей
	|			ТОГДА Остатки.Субконто1
	|		КОГДА Остатки.Субконто2 ССЫЛКА Справочник.ВидыНалоговИПлатежей
	|			ТОГДА Остатки.Субконто2
	|		КОГДА Остатки.Субконто3 ССЫЛКА Справочник.ВидыНалоговИПлатежей
	|			ТОГДА Остатки.Субконто3
	|	КОНЕЦ КАК ВидНалогаИлиПлатежа,
	|	ВЫБОР
	|		КОГДА Остатки.Субконто1 ССЫЛКА Справочник.НалогиИПлатежиОрганизации
	|			ТОГДА Остатки.Субконто1
	|		КОГДА Остатки.Субконто2 ССЫЛКА Справочник.НалогиИПлатежиОрганизации
	|			ТОГДА Остатки.Субконто2
	|		КОГДА Остатки.Субконто3 ССЫЛКА Справочник.НалогиИПлатежиОрганизации
	|			ТОГДА Остатки.Субконто3
	|	КОНЕЦ КАК НалогСборПлатеж,
	|	ВЫБОР
	|		КОГДА НЕ Остатки.Субконто1 ССЫЛКА Справочник.ВидыНалоговИПлатежей
	|				И НЕ Остатки.Субконто1 ССЫЛКА Справочник.НалогиИПлатежиОрганизации
	|			ТОГДА Остатки.Субконто1
	|		КОГДА НЕ Остатки.Субконто1 ССЫЛКА Справочник.ВидыНалоговИПлатежей
	|				И НЕ Остатки.Субконто2 ССЫЛКА Справочник.НалогиИПлатежиОрганизации
	|			ТОГДА Остатки.Субконто2
	|		КОГДА НЕ Остатки.Субконто1 ССЫЛКА Справочник.ВидыНалоговИПлатежей
	|				И НЕ Остатки.Субконто3 ССЫЛКА Справочник.НалогиИПлатежиОрганизации
	|			ТОГДА Остатки.Субконто3
	|	КОНЕЦ КАК ДопСубконто,
	|	ЕСТЬNULL(Остатки.Валюта, &ВалютаРеглУчета) КАК Валюта,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет
	|				И Остатки.Счет.Валютный
	|			ТОГДА Остатки.ВалютнаяСуммаОстаток
	|		ИНАЧЕ Остатки.СуммаОстаток
	|	КОНЕЦ КАК СуммаВал,
	|	Остатки.СуммаОстаток КАК СуммаРуб
	|ПОМЕСТИТЬ Остатки30300
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&МоментВремени, Счет В (&Счета30300), , Организация = &Организация) КАК Остатки
	|ГДЕ
	|	&УсловиеПоИФО
	|	И &УсловиеПоКФО
	|	И &УсловиеПоКПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки30300.Счет КАК Счет,
	|	Остатки30300.УчетПоКПС КАК УчетПоКПС,
	|	Остатки30300.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	Остатки30300.Валютный КАК Валютный,
	|	Остатки30300.ИФО КАК ИФО,
	|	Остатки30300.КФО КАК КФО,
	|	Остатки30300.КПС КАК КПС,
	|	Остатки30300.Подразделение КАК Подразделение,
	|	Остатки30300.Субконто1 КАК Субконто1,
	|	Остатки30300.Субконто2 КАК Субконто2,
	|	Остатки30300.Субконто3 КАК Субконто3,
	|	Остатки30300.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
	|	Остатки30300.НалогСборПлатеж КАК НалогСборПлатеж,
	|	Остатки30300.ДопСубконто КАК ДопСубконто,
	|	Остатки30300.Валюта КАК Валюта,
	|	Остатки30300.СуммаВал КАК СуммаВал,
	|	Остатки30300.СуммаРуб КАК СуммаРуб
	|ИЗ
	|	Остатки30300 КАК Остатки30300
	|ГДЕ
	|	&УсловиеПоВидНалогаИлиПлатежа";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоИФО",
		?(Реквизиты.ИспользоватьУчетПоИФО, "ИФО В (&ИФО)", "ИСТИНА") );
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКФО", "КФО В (&КФО)");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоКПС", "КПС В (&КПС)");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоВидНалогаИлиПлатежа",
		"Остатки30300.ВидНалогаИлиПлатежа В (&ВидНалогаИлиПлатежа)");
	
	ОстаткиЗадолженности = Запрос.Выполнить().Выгрузить();
	
	Возврат ОстаткиЗадолженности;
	
КонецФункции

// Контроль остатков по счетам расчетов при проведении документов списания дебиторской и кредиторской задолженности.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект.СписаниеВосстановлениеЗадолженностиПоДоходам,
//                   ДокументОбъект.СписаниеКредиторскойЗадолженности,
//                   ДокументОбъект.ВосстановлениеКредиторскойЗадолженности - документ списания дебиторской, кредиторской задолженности;
//  ТолькоОдобренныеОбъектыГолосования - Булево - при контроле остатков учитывать только строки документа, одобренные комиссией.
// 
Функция ОстаткиЗадолженностиПревышены(ДокументОбъект, ТолькоОдобренныеОбъектыГолосования = Истина) Экспорт
	
	ОстаткиПревышены = Ложь;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка", ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация", ДокументОбъект.Организация);
	Реквизиты.Вставить("ИспользоватьУчетПоИФО", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет", ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ДатаПроведения = БухгалтерскийУчет.УстановленнаяДатаПроведения(ДокументОбъект.Ссылка);
	Если ЗначениеЗаполнено(ДатаПроведения) Тогда
		ПериодОстатков = Новый Граница(ДатаПроведения, ВидГраницы.Исключая);
	Иначе
		ПериодОстатков = Новый Граница(ДокументОбъект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если МетаданныеДокумента.Имя = "СписаниеКредиторскойЗадолженности" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Задолженность",
			"НомерСтроки,ИдентификаторСтроки,ИФО,КФО,КПС,Подразделение,Счет,
			|Контрагент,Договор,ДопСубконтоРасчетов,
			|ВидНалогаИлиПлатежа,НалогСборПлатеж,
			|Валюта,СписатьСумма,СписатьСуммаВал",
			ДокументОбъект, Реквизиты);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	Задолженность.НомерСтроки КАК НомерСтроки,
		|	Задолженность.ИФО КАК ИФО,
		|	Задолженность.КФО КАК КФО,
		|	Задолженность.КПС КАК КПС,
		|	Задолженность.Подразделение КАК Подразделение,
		|	Задолженность.Счет КАК Счет,
		|	Задолженность.Контрагент КАК Контрагент,
		|	Задолженность.Договор КАК Договор,
		|	Задолженность.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
		|	Задолженность.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
		|	Задолженность.НалогСборПлатеж КАК НалогСборПлатеж,
		|	Задолженность.Валюта КАК Валюта,
		|	Задолженность.СписатьСумма КАК СписатьСумма,
		|	Задолженность.СписатьСуммаВал КАК СписатьСуммаВал
		|ИЗ
		|	ТаблицаЗадолженность КАК Задолженность
		|ГДЕ
		|	&УсловиеТолькоОдобренныеОбъектыГолосования
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задолженность.НомерСтроки КАК НомерСтроки,
		|	Задолженность.ИФО КАК ИФО,
		|	Задолженность.КФО КАК КФО,
		|	Задолженность.КПС КАК КПС,
		|	Задолженность.Подразделение КАК Подразделение,
		|	Задолженность.Счет КАК Счет,
		|	Задолженность.Контрагент КАК Контрагент,
		|	Задолженность.Договор КАК Договор,
		|	Задолженность.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
		|	Задолженность.Валюта КАК Валюта,
		|	Задолженность.СписатьСумма КАК СписатьСумма,
		|	Задолженность.СписатьСуммаВал КАК СписатьСуммаВал
		|ИЗ
		|	ТаблицаЗадолженность КАК Задолженность
		|ГДЕ
		|	&УсловиеТолькоОдобренныеОбъектыГолосования
		|	И НЕ Задолженность.Счет В (&Счета30300)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задолженность.НомерСтроки КАК НомерСтроки,
		|	Задолженность.ИФО КАК ИФО,
		|	Задолженность.КФО КАК КФО,
		|	Задолженность.КПС КАК КПС,
		|	Задолженность.Подразделение КАК Подразделение,
		|	Задолженность.Счет КАК Счет,
		|	Задолженность.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
		|	Задолженность.НалогСборПлатеж КАК НалогСборПлатеж,
		|	Задолженность.Валюта КАК Валюта,
		|	Задолженность.СписатьСумма КАК СписатьСумма,
		|	Задолженность.СписатьСуммаВал КАК СписатьСуммаВал
		|ИЗ
		|	ТаблицаЗадолженность КАК Задолженность
		|ГДЕ
		|	&УсловиеТолькоОдобренныеОбъектыГолосования
		|	И Задолженность.Счет В(&Счета30300)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		Запрос.УстановитьПараметр("Счета30300", БухгалтерскийУчет.СписокСчетов("303.00"));
		
		Если ТолькоОдобренныеОбъектыГолосования Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТолькоОдобренныеОбъектыГолосования",
				"Задолженность.ИдентификаторСтроки В(&ОдобренныеОбъектыГолосования)");
			ОдобренныеОбъектыГолосования = ОбщегоНазначенияБГУ.ОдобренныеОбъектыГолосования(ДокументОбъект.Ссылка);
			Запрос.УстановитьПараметр("ОдобренныеОбъектыГолосования", ОдобренныеОбъектыГолосования);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТолькоОдобренныеОбъектыГолосования", "ИСТИНА");
		КонецЕсли;
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ЗадолженностьКСписанию = РезультатЗапроса[1].Выгрузить();
		ЗадолженностьКроме30300 = РезультатЗапроса[2].Выгрузить();
		Задолженность30300 = РезультатЗапроса[3].Выгрузить();
		
		ОстаткиЗадолженности = УчетРасчетов.ОстаткиЗадолженности(ПериодОстатков, ЗадолженностьКроме30300, Реквизиты);
		ОстаткиЗадолженности30300 = УчетРасчетов.ОстаткиЗадолженностиПоПлатежамВБюджеты(ПериодОстатков, Задолженность30300, Реквизиты);
		
	ИначеЕсли МетаданныеДокумента.Имя = "ВосстановлениеКредиторскойЗадолженности" Тогда
		
		Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийВосстановленияКредиторскойЗадолженности.ВосстановлениеЗадолженностиРанееНеУчитываемой Тогда
			Возврат ОстаткиПревышены; // Не требуется проверять остатки.
		КонецЕсли;
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Задолженность",
			"НомерСтроки,ИдентификаторСтроки,ИФО,КФО,КПС,Подразделение,Счет,
			|Контрагент,Договор,ДопСубконтоРасчетов,
			|Валюта,ВосстановитьСумма,ВосстановитьСуммаВал",
			ДокументОбъект, Реквизиты);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	Задолженность.НомерСтроки КАК НомерСтроки,
		|	Задолженность.ИФО КАК ИФО,
		|	Задолженность.КФО КАК КФО,
		|	Задолженность.КПС КАК КПС,
		|	Задолженность.Подразделение КАК Подразделение,
		|	Задолженность.Счет КАК Счет,
		|	Задолженность.Контрагент КАК Контрагент,
		|	Задолженность.Договор КАК Договор,
		|	Задолженность.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
		|	Задолженность.Валюта КАК Валюта,
		|	Задолженность.ВосстановитьСумма КАК СписатьСумма,
		|	Задолженность.ВосстановитьСуммаВал КАК СписатьСуммаВал
		|ИЗ
		|	ТаблицаЗадолженность КАК Задолженность
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ЗадолженностьКСписанию = РезультатЗапроса[1].Выгрузить(); // Списание задолженности со счета 20 "Задолженность, невостребованная кредиторами".
		
		ОстаткиЗадолженности = УчетРасчетов.ОстаткиЗадолженности(ПериодОстатков, ЗадолженностьКСписанию, Реквизиты);
		ОстаткиЗадолженности30300 = Новый ТаблицаЗначений;
		
	Иначе // СписаниеВосстановлениеЗадолженностиПоДоходам
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Задолженность",
			"НомерСтроки,ИдентификаторСтроки,ИФО,КФО,КПС,Подразделение,Счет,
			|Контрагент,Договор,ДопСубконтоРасчетов,
			|Валюта,СписатьСумма,СписатьСуммаВал",
			ДокументОбъект, Реквизиты);
		
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	Задолженность.НомерСтроки КАК НомерСтроки,
		|	Задолженность.ИФО КАК ИФО,
		|	Задолженность.КФО КАК КФО,
		|	Задолженность.КПС КАК КПС,
		|	Задолженность.Подразделение КАК Подразделение,
		|	Задолженность.Счет КАК Счет,
		|	Задолженность.Контрагент КАК Контрагент,
		|	Задолженность.Договор КАК Договор,
		|	Задолженность.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
		|	Задолженность.Валюта КАК Валюта,
		|	Задолженность.СписатьСумма КАК СписатьСумма,
		|	Задолженность.СписатьСуммаВал КАК СписатьСуммаВал
		|ИЗ
		|	ТаблицаЗадолженность КАК Задолженность
		|ГДЕ
		|	&УсловиеТолькоОдобренныеОбъектыГолосования
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Если ТолькоОдобренныеОбъектыГолосования Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТолькоОдобренныеОбъектыГолосования",
				"Задолженность.ИдентификаторСтроки В(&ОдобренныеОбъектыГолосования)");
			ОдобренныеОбъектыГолосования = ОбщегоНазначенияБГУ.ОдобренныеОбъектыГолосования(ДокументОбъект.Ссылка);
			Запрос.УстановитьПараметр("ОдобренныеОбъектыГолосования", ОдобренныеОбъектыГолосования);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТолькоОдобренныеОбъектыГолосования", "ИСТИНА");
		КонецЕсли;
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ЗадолженностьКСписанию = РезультатЗапроса[1].Выгрузить();
		
		ОстаткиЗадолженности = УчетРасчетов.ОстаткиЗадолженности(ПериодОстатков, ЗадолженностьКСписанию, Реквизиты);
		ОстаткиЗадолженности30300 = Новый ТаблицаЗначений;
		
	КонецЕсли;
	
	Для Каждого СтрокаЗадолженность Из ЗадолженностьКСписанию Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("КФО", СтрокаЗадолженность.КФО);
		
		СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаЗадолженность.Счет);
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			Отбор.Вставить("ИФО", ДокументОбъект.ИФО);
		КонецЕсли;
		Если СвойстваСчета.УчетПоКПС Тогда
			Отбор.Вставить("КПС", СтрокаЗадолженность.КПС);
		КонецЕсли;
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчета.УчетПоПодразделениям Тогда
			Отбор.Вставить("Подразделение", СтрокаЗадолженность.Подразделение);
		КонецЕсли;
		Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчета.Валютный Тогда
			Отбор.Вставить("Валюта", СтрокаЗадолженность.Валюта);
		КонецЕсли;
		
		ОстатокРуб = 0;
		ОстатокВал = 0;
		ЗнакОстатка = ?(МетаданныеДокумента.Имя = "СписаниеКредиторскойЗадолженности" И НЕ СвойстваСчета.Забалансовый, -1, 1);
		
		Если БухгалтерскийУчет.СчетВИерархии(СтрокаЗадолженность.Счет, "303.00") Тогда
			
			Отбор.Вставить("Счет", СтрокаЗадолженность.Счет);
			Если ЗначениеЗаполнено(СтрокаЗадолженность.ВидНалогаИлиПлатежа) Тогда
				Отбор.Вставить("ВидНалогаИлиПлатежа", СтрокаЗадолженность.ВидНалогаИлиПлатежа)
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаЗадолженность.НалогСборПлатеж) Тогда
				Отбор.Вставить("НалогСборПлатеж", СтрокаЗадолженность.НалогСборПлатеж)
			КонецЕсли;
			
			Если ОстаткиЗадолженности30300.Количество() > 0 Тогда
				НайденныеСтрокиОстатков = ОстаткиЗадолженности30300.НайтиСтроки(Отбор);
				Для Каждого СтрокаОстатков Из НайденныеСтрокиОстатков Цикл
					ОстатокРуб = ОстатокРуб + ЗнакОстатка * СтрокаОстатков.СуммаРуб;
					ОстатокВал = ОстатокВал + ЗнакОстатка * СтрокаОстатков.СуммаВал;
				КонецЦикла;
			КонецЕсли;
			
		Иначе // Счета расчетов.
			
			Отбор.Вставить("СчетРасчетов", СтрокаЗадолженность.Счет);
			Если БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоКонтрагентам(СтрокаЗадолженность.Счет) Тогда
				Отбор.Вставить("Контрагент", СтрокаЗадолженность.Контрагент)
			КонецЕсли;
			Если БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДоговорам(СтрокаЗадолженность.Счет) Тогда
				Отбор.Вставить("Договор", СтрокаЗадолженность.Договор)
			КонецЕсли;
			Если ПараметрыДопСубконтоРасчетов(СтрокаЗадолженность.Счет).Использование // Есть доп.субконто расчетов.
				И (СтрокаЗадолженность.ДопСубконтоРасчетов <> Неопределено) Тогда // Значение Неопределено - при заполненении из инв.описи.
				Отбор.Вставить("ДопСубконтоРасчетов", СтрокаЗадолженность.ДопСубконтоРасчетов)
			КонецЕсли;
			
			Если ОстаткиЗадолженности.Количество() > 0 Тогда
				НайденныеСтрокиОстатков = ОстаткиЗадолженности.НайтиСтроки(Отбор);
				Для Каждого СтрокаОстатков Из НайденныеСтрокиОстатков Цикл
					ОстатокРуб = ОстатокРуб + ЗнакОстатка * СтрокаОстатков.СуммаРуб;
					ОстатокВал = ОстатокВал + ЗнакОстатка * СтрокаОстатков.СуммаРасчетов;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		ЭтоРасчетыВВалюте = Реквизиты.ИспользоватьВалютныйУчет
			И ЗначениеЗаполнено(СтрокаЗадолженность.Валюта)
			И СтрокаЗадолженность.Валюта <> ВалютаРегламентированногоУчета;
		
		Если СтрокаЗадолженность.СписатьСумма > ОстатокРуб
			ИЛИ (ЭтоРасчетыВВалюте И СтрокаЗадолженность.СписатьСуммаВал > ОстатокВал) Тогда
			
			ИмяПоляСумма = ?(МетаданныеДокумента.Имя = "ВосстановлениеКредиторскойЗадолженности", "ВосстановитьСумма", "СписатьСумма");
			
			Если ЭтоРасчетыВВалюте Тогда
				ТекстОшибки = НСтр("ru='Указана сумма списания, превышающая остаток задолженности по счету бухгалтерского учета %1.
					|
					|Указана сумма списания: %2 (%5); Остаток задолженности: %3 (%6); Превышение: %4 (%7)'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
					СтрокаЗадолженность.Счет,
					ОбщегоНазначенияБГУ.ФорматСумм(СтрокаЗадолженность.СписатьСуммаВал, СтрокаЗадолженность.Валюта, "0"),
					ОбщегоНазначенияБГУ.ФорматСумм(ОстатокВал, СтрокаЗадолженность.Валюта, "0"),
					ОбщегоНазначенияБГУ.ФорматСумм(СтрокаЗадолженность.СписатьСуммаВал - ОстатокВал, СтрокаЗадолженность.Валюта, "0"),
					ОбщегоНазначенияБГУ.ФорматСумм(СтрокаЗадолженность.СписатьСумма, ВалютаРегламентированногоУчета, "0"),
					ОбщегоНазначенияБГУ.ФорматСумм(ОстатокРуб, ВалютаРегламентированногоУчета, "0"),
					ОбщегоНазначенияБГУ.ФорматСумм(СтрокаЗадолженность.СписатьСумма - ОстатокРуб, ВалютаРегламентированногоУчета, "0"));
				ПолеСумма = "Задолженность[" + Формат(СтрокаЗадолженность.НомерСтроки - 1, "ЧН=0; ЧГ=") + "]." + ИмяПоляСумма + "Вал";
			Иначе
				ТекстОшибки = НСтр("ru='Указана сумма списания, превышающая остаток задолженности по счету бухгалтерского учета %1.
					|
					|Указана сумма списания: %2; Остаток задолженности: %3; Превышение: %4'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
					СтрокаЗадолженность.Счет,
					ОбщегоНазначенияБГУ.ФорматСумм(СтрокаЗадолженность.СписатьСумма, ВалютаРегламентированногоУчета, "0"),
					ОбщегоНазначенияБГУ.ФорматСумм(ОстатокРуб, ВалютаРегламентированногоУчета, "0"),
					ОбщегоНазначенияБГУ.ФорматСумм(СтрокаЗадолженность.СписатьСумма - ОстатокРуб, ВалютаРегламентированногоУчета, "0"));
				ПолеСумма = "Задолженность[" + Формат(СтрокаЗадолженность.НомерСтроки - 1, "ЧН=0; ЧГ=") + "]." + ИмяПоляСумма;
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Реквизиты.Ссылка, ПолеСумма, "Объект");
			ОстаткиПревышены = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОстаткиПревышены;
	
КонецФункции

// Погашение задолженности.

// Структура таблицы расчетов с погашением задолженности.
//
Функция ПустаяТаблицаРасчетовСПогашениемЗадолженности() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Способ погашения задолженности, установленный в документе: Автоматичеки, Погасить задолженность, Не погашать.
	ПустаяТаблица.Колонки.Добавить("СпособПогашенияЗадолженности",
		Новый ОписаниеТипов("ПеречислениеСсылка.СпособыПогашенияЗадолженности"));
	
	// Признак аванса. После погашения задолженности, сумма аванса (превышения над остатком имеющейся задолженности)
	// добавляется в таблицу последней строкой.
	ПустаяТаблица.Колонки.Добавить("ЭтоАванс", Новый ОписаниеТипов("Булево"));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета расчетов с контрагентами.
	ПустаяТаблица.Колонки.Добавить("КЭК",                    Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",           Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СчетАвансов",            Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",             Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",                Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("ДопСубконтоРасчетов",    Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	ПустаяТаблица.Колонки.Добавить("ВидДопСубконтоРасчетов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто"));
	ПустаяТаблица.Колонки.Добавить("Валюта",                 Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Суммы расчетов.
	ПустаяТаблица.Колонки.Добавить("ОстатокРасчетов",        ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРасчетов",          ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",               ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРубПоКурсуАванса",  ОписаниеТипаСуммы);
	
	// Конвертация валюты
	ПустаяТаблица.Колонки.Добавить("ПроданнаяВалюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ПустаяТаблица.Колонки.Добавить("СуммаПроданнойВалюты", ОписаниеТипаСуммы);
	
	// Для целей налогового учета при УСН.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",       ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("ОтражениеАвансаУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ПорядокОтраженияАвансовУСН"));
	
	// Учет полученных авансов на забалансовом счете АП.
	ПустаяТаблица.Колонки.Добавить("ОстатокРасчетовАП", ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("ДокументАванса",    Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	
	// Дополнительные колонки.
	ПустаяТаблица.Колонки.Добавить("ВидДоговора",            Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровКонтрагентов"));
	ПустаяТаблица.Колонки.Добавить("РасчетыВВалюте",         Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("УчетАгентскогоНДС",      Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("ИсточникСредств",        Новый ОписаниеТипов("СправочникСсылка.ИсточникиСредств,СправочникСсылка.РазделыЛицевыхСчетов"));
	ПустаяТаблица.Колонки.Добавить("ДопКлассификация",       Новый ОписаниеТипов("СправочникСсылка.ДополнительнаяБюджетнаяКлассификация"));
	ПустаяТаблица.Колонки.Добавить("КодМероприятия",         Новый ОписаниеТипов("СправочникСсылка.Мероприятия"));
	ПустаяТаблица.Колонки.Добавить("КодЦели",                Новый ОписаниеТипов("СправочникСсылка.ВидыЦелевыхСредств"));
	ПустаяТаблица.Колонки.Добавить("НазначениеПлатежа",      ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(254));
	
	Возврат ПустаяТаблица;

КонецФункции

// Формирует таблицу расчетов с погашением задолженности.
//
Функция ТаблицаРасчетовСПогашениемЗадолженности(РасшифровкаПлатежа, Реквизиты, Отказ) Экспорт
	
	ТаблицаРасчетов = ПустаяТаблицаРасчетовСПогашениемЗадолженности();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Реквизиты.Вставить("УчитыватьЗадолженностьЕНВД",       УчетнаяПолитика.ПрименяетсяУСН И УчетнаяПолитика.ПлательщикЕНВД);
	
	РасшифровкаПлатежа = ДобавитьСлужебныеКолонкиРасчетовСКонтрагентами(РасшифровкаПлатежа, Реквизиты);
	
	ПроверитьКорректностьНастройкиСчетовРасчетов(РасшифровкаПлатежа, Реквизиты);
	
	// Получим остатки задолженности со счетов бухгалтерского учета.
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты.Ссылка));
	ОстаткиЗадолженности = ОстаткиЗадолженности(ПериодОстатков, РасшифровкаПлатежа, Реквизиты);
	
	// При возврате полученных авансов, нужно определить ДокументАванса из остатков по счету АП.
	ДополнитьОстаткиЗадолженностиДокументамиАвансовПолученных(ПериодОстатков, ОстаткиЗадолженности, РасшифровкаПлатежа, Реквизиты);
	
	// Погасим задолженность, выделим аванс.
	Для Каждого СтрокаПлатежа Из РасшифровкаПлатежа Цикл
		
		НераспределенныйОстаток = СтрокаПлатежа.СуммаРасчетов;
		НераспределенныйОстатокВВалютеСписания = СтрокаПлатежа.СуммаПроданнойВалюты;
		
		Если СтрокаПлатежа.СпособПогашенияЗадолженности <> Перечисления.СпособыПогашенияЗадолженности.НеПогашать Тогда
		
			Отбор = Новый Структура("КФО,СчетРасчетов,Контрагент",
				СтрокаПлатежа.КФО,
				СтрокаПлатежа.СчетРасчетов,
				СтрокаПлатежа.Контрагент);
			
			Если ЗначениеЗаполнено(СтрокаПлатежа.Договор)
			   И БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДоговорам(СтрокаПлатежа.СчетРасчетов) Тогда
				Отбор.Вставить("Договор", СтрокаПлатежа.Договор);
			КонецЕсли;
			
			Если СтрокаПлатежа.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.ПоДокументу Тогда
				Отбор.Вставить("ВидДопСубконтоРасчетов", СтрокаПлатежа.ВидДопСубконтоРасчетов);
				Отбор.Вставить("ДопСубконтоРасчетов",    СтрокаПлатежа.ДопСубконтоРасчетов);
			КонецЕсли;
			
			СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаПлатежа.СчетРасчетов);
			Если Реквизиты.ИспользоватьУчетПоИФО Тогда
				Отбор.Вставить("ИФО", СтрокаПлатежа.ИФО);
			КонецЕсли;
			Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
				Отбор.Вставить("КПС", СтрокаПлатежа.КПС);
			КонецЕсли;
			Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
				Отбор.Вставить("Подразделение", СтрокаПлатежа.Подразделение);
			КонецЕсли;
			Если Реквизиты.ИспользоватьВалютныйУчет Тогда
				Отбор.Вставить("Валюта", СтрокаПлатежа.Валюта);
			КонецЕсли;
			
			НайденныеОстаткиЗадолженности = ?(ОстаткиЗадолженности.Количество() > 0, ОстаткиЗадолженности.НайтиСтроки(Отбор),
				ОстаткиЗадолженности.СкопироватьКолонки());
			
			ДобавитьСтрокиПогашенияЗадолженности(
				ТаблицаРасчетов,
				НераспределенныйОстаток,
				НераспределенныйОстатокВВалютеСписания,
				НайденныеОстаткиЗадолженности,
				СтрокаПлатежа,
				Реквизиты,
				Отказ);
			
		КонецЕсли;
		
		ДобавитьСтрокуАванса(
			ТаблицаРасчетов,
			НераспределенныйОстаток,
			НераспределенныйОстатокВВалютеСписания,
			СтрокаПлатежа,
			Реквизиты);
		
	КонецЦикла;
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

Процедура ДополнитьОстаткиЗадолженностиДокументамиАвансовПолученных(ПериодОстатков, ОстаткиЗадолженности, РасшифровкаПлатежа, Реквизиты)
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ОстаткиЗадолженности.Колонки.Добавить("СуммаРасчетовАП", ОписаниеТипаСуммы);
	ОстаткиЗадолженности.Колонки.Добавить("ДокументАванса", Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	Если ОстаткиЗадолженности.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтборВозвратПолученныхАвансов = Новый Структура;
	ОтборВозвратПолученныхАвансов.Вставить("ЭтоПоступление", Ложь);
	ОтборВозвратПолученныхАвансов.Вставить("ВидАванса", "Полученный");
	ВозвратПолученныхАвансов = РасшифровкаПлатежа.НайтиСтроки(ОтборВозвратПолученныхАвансов);
	Если ВозвратПолученныхАвансов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОтборАвансов = РасшифровкаПлатежа.СкопироватьКолонки();
	Для Каждого СтрокаВозвратПолученныхАвансов Из ВозвратПолученныхАвансов Цикл
		
		Если БухгалтерскийУчет.СчетВИерархии(СтрокаВозвратПолученныхАвансов.СчетАвансов, "АП")
			И СтрокаВозвратПолученныхАвансов.СпособПогашенияЗадолженности <> Перечисления.СпособыПогашенияЗадолженности.НеПогашать Тогда
			НоваяСтрока = ТаблицаОтборАвансов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВозвратПолученныхАвансов);
		КонецЕсли;
		
	КонецЦикла;
	ОстаткиАвансовПолученных = ОстаткиАвансов(ПериодОстатков, ТаблицаОтборАвансов, Реквизиты);
	Если ОстаткиАвансовПолученных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоСтрокЗадолженности = ОстаткиЗадолженности.Количество();
	Для НомерСтроки = 1 По КоличествоСтрокЗадолженности Цикл
		
		СтрокаЗадолженности = ОстаткиЗадолженности[КоличествоСтрокЗадолженности - НомерСтроки];
		
		Если СтрокаЗадолженности.СуммаРасчетов >= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДоговорам(СтрокаЗадолженности.СчетРасчетов) Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("КФО,Контрагент,Договор",
			СтрокаЗадолженности.КФО,
			СтрокаЗадолженности.Контрагент,
			СтрокаЗадолженности.Договор);
		
		Отбор.Вставить("КЭК", БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(СтрокаЗадолженности.СчетРасчетов));
		
		СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаЗадолженности.СчетРасчетов);
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			Отбор.Вставить("ИФО", СтрокаЗадолженности.ИФО);
		КонецЕсли;
		Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
			Отбор.Вставить("КПС", СтрокаЗадолженности.КПС);
		КонецЕсли;
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
			Отбор.Вставить("Подразделение", СтрокаЗадолженности.Подразделение);
		КонецЕсли;
		Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
			Отбор.Вставить("Валюта", СтрокаЗадолженности.Валюта);
		Иначе
			Отбор.Вставить("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());
		КонецЕсли;
		
		Если СтрокаЗадолженности.ВидДопСубконтоРасчетов = ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов
			И ЗначениеЗаполнено(СтрокаЗадолженности.ДопСубконтоРасчетов) Тогда
			// Учет на счете АП всегда ведется по документам расчетов.
			Отбор.Вставить("ДопСубконтоАвансов", СтрокаЗадолженности.ДопСубконтоРасчетов);
		КонецЕсли;
		
		НайденныеОстаткиАвансов = ОстаткиАвансовПолученных.НайтиСтроки(Отбор);
		
		Если НайденныеОстаткиАвансов.Количество() > 0 Тогда
			
			Для Каждого СтрокаАвансов Из НайденныеОстаткиАвансов Цикл
				
				Если Не БухгалтерскийУчет.СчетВИерархии(СтрокаАвансов.СчетАвансов, "АП") Тогда
					Продолжить;
				КонецЕсли;
				
				Знак = -1;
				ПогашеннаяСуммаРасчетов = Мин(Знак*СтрокаЗадолженности.СуммаРасчетов, Знак*СтрокаАвансов.СуммаРасчетов);
				ПогашеннаяСуммаРуб      = Мин(Знак*СтрокаЗадолженности.СуммаРуб,      Знак*СтрокаАвансов.СуммаРуб);
				ПогашеннаяСуммаЕНВДРуб  = Мин(Знак*СтрокаЗадолженности.СуммаЕНВДРуб,  Знак*СтрокаАвансов.СуммаЕНВДРуб);
				
				Если ПогашеннаяСуммаРасчетов > 0 Тогда
					
					// Дополним остатки задолженности документами авансов.
					НоваяСтрока = ОстаткиЗадолженности.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗадолженности, , "СуммаРасчетов, СуммаРуб, СуммаЕНВДРуб");
					
					Если Не ЗначениеЗаполнено(НоваяСтрока.Валюта) Тогда
						НоваяСтрока.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
					КонецЕсли;
					
					// Заполним информацию о найденном авансе полученном на счете АП.
					НоваяСтрока.СуммаРасчетовАП = СтрокаАвансов.СуммаРасчетов;
					НоваяСтрока.ДокументАванса  = СтрокаАвансов.ДопСубконтоАвансов;
					
					НоваяСтрока.СуммаРасчетов  = Знак*ПогашеннаяСуммаРасчетов;
					НоваяСтрока.СуммаРуб       = Знак*ПогашеннаяСуммаРуб;
					НоваяСтрока.СуммаЕНВДРуб   = Знак*ПогашеннаяСуммаЕНВДРуб;
					
					// Уменьшим остаток задолженности без документов авансов.
					СтрокаЗадолженности.СуммаРасчетов = СтрокаЗадолженности.СуммаРасчетов - НоваяСтрока.СуммаРасчетов;
					СтрокаЗадолженности.СуммаРуб      = СтрокаЗадолженности.СуммаРуб      - НоваяСтрока.СуммаРуб;
					СтрокаЗадолженности.СуммаЕНВДРуб  = СтрокаЗадолженности.СуммаЕНВДРуб  - НоваяСтрока.СуммаЕНВДРуб;
					
					// Уменьшим остаток нераспределенных авансов.
					СтрокаАвансов.СуммаРасчетов = СтрокаАвансов.СуммаРасчетов - НоваяСтрока.СуммаРасчетов;
					СтрокаАвансов.СуммаРуб      = СтрокаАвансов.СуммаРуб      - НоваяСтрока.СуммаРуб;
					СтрокаАвансов.СуммаЕНВДРуб  = СтрокаАвансов.СуммаЕНВДРуб  - НоваяСтрока.СуммаЕНВДРуб;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьСтрокиПогашенияЗадолженности(ТаблицаРасчетов, НераспределеннаяСумма, НераспределеннаяСуммаВВалютеСписания, ОстаткиЗадолженности, СтрокаПлатежа, Реквизиты, Отказ)
	
	Знак = ?(СтрокаПлатежа.ЭтоПоступление, +1, -1);
		
	Для Каждого СтрокаОстатка Из ОстаткиЗадолженности Цикл
		
		Если НераспределеннаяСумма <= 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПогашеннаяСумма = Мин(НераспределеннаяСумма, Знак * СтрокаОстатка.СуммаРасчетов);
		Если ПогашеннаяСумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРасчетов = ТаблицаРасчетов.Добавить();
		СтрокаРасчетов.ЭтоАванс = Ложь;
		
		ЗаполнитьЗначенияСвойств(СтрокаРасчетов, СтрокаОстатка,
			"ИФО,КФО,КПС,Подразделение,Валюта,
			|СчетРасчетов,Контрагент,Договор,ДопСубконтоРасчетов,ВидДопСубконтоРасчетов");
		
		ЗаполнитьЗначенияСвойств(СтрокаРасчетов, СтрокаПлатежа,
			"ИмяСписка,СинонимСписка,НомерСтроки,СчетАвансов,КЭК,ВидДоговора,РасчетыВВалюте,УчетАгентскогоНДС,
			|ПроданнаяВалюта,
			|ИсточникСредств,ДопКлассификация,КодМероприятия,КодЦели,НазначениеПлатежа,СпособПогашенияЗадолженности");
		
		// Если у счета расчетов нет субконто "Договоры", то при наличии задолженности
		// договор в строке расчетов не заполнится, а он нужен для заполнения характеристики движения.
		Если НЕ ЗначениеЗаполнено(СтрокаРасчетов.Договор) И ЗначениеЗаполнено(СтрокаПлатежа.Договор) Тогда
			СтрокаРасчетов.Договор = СтрокаПлатежа.Договор;
		КонецЕсли;
		
		СтрокаРасчетов.ОстатокРасчетов = Знак * СтрокаОстатка.СуммаРасчетов;
		СтрокаРасчетов.СуммаРасчетов   = ПогашеннаяСумма;
		
		Если ПогашеннаяСумма = НераспределеннаяСумма Тогда
			СтрокаРасчетов.СуммаПроданнойВалюты = НераспределеннаяСуммаВВалютеСписания;
		Иначе
			СтрокаРасчетов.СуммаПроданнойВалюты = Окр(НераспределеннаяСуммаВВалютеСписания * ПогашеннаяСумма / НераспределеннаяСумма, 2);
		КонецЕсли;
		
		// При погашении задолженности по авансам полученным сохраним информацию со счета АП.
		СтрокаРасчетов.ОстатокРасчетовАП = Знак * СтрокаОстатка.СуммаРасчетовАП;
		СтрокаРасчетов.ДокументАванса    = СтрокаОстатка.ДокументАванса;
		
		КоэффициентКурсаАванса = ?(НЕ СтрокаПлатежа.РасчетыВВалюте, 1,
			?(СтрокаОстатка.СуммаРасчетов = 0, 0, СтрокаОстатка.СуммаРуб / СтрокаОстатка.СуммаРасчетов));
		
		КоэффициентРуб = ?(НЕ СтрокаПлатежа.РасчетыВВалюте, 1,
			?(СтрокаПлатежа.СуммаРасчетов = 0, 0, СтрокаПлатежа.СуммаРуб / СтрокаПлатежа.СуммаРасчетов));
		
		СтрокаРасчетов.СуммаРубПоКурсуАванса = Окр(ПогашеннаяСумма * КоэффициентКурсаАванса, 2);
		СтрокаРасчетов.СуммаРуб              = Окр(ПогашеннаяСумма * КоэффициентРуб, 2);
		
		Если Реквизиты.УчитыватьЗадолженностьЕНВД Тогда
			
			Если ПогашеннаяСумма = Знак * СтрокаОстатка.СуммаРасчетов Тогда
				СтрокаРасчетов.СуммаЕНВДРуб = Знак * СтрокаОстатка.СуммаЕНВДРуб;
			Иначе
				СтрокаРасчетов.СуммаЕНВДРуб = Окр(СтрокаОстатка.СуммаЕНВДРуб * (ПогашеннаяСумма / СтрокаОстатка.СуммаРасчетов), 2);
			КонецЕсли;
			
			СтрокаОстатка.СуммаЕНВДРуб = СтрокаОстатка.СуммаЕНВДРуб - Знак * СтрокаРасчетов.СуммаЕНВДРуб;
		
		КонецЕсли;
		
		НераспределеннаяСумма = НераспределеннаяСумма - ПогашеннаяСумма;
		НераспределеннаяСуммаВВалютеСписания = НераспределеннаяСуммаВВалютеСписания - СтрокаРасчетов.СуммаПроданнойВалюты;
		
		СтрокаОстатка.СуммаРасчетов = СтрокаОстатка.СуммаРасчетов - Знак * СтрокаРасчетов.СуммаРасчетов;
		СтрокаОстатка.СуммаРуб      = СтрокаОстатка.СуммаРуб      - Знак * СтрокаРасчетов.СуммаРубПоКурсуАванса;
		
	КонецЦикла;
	
	// При погашении задолженности вручную нераспределенный остаток означает,
	// что указанная сумма погашения превышает остаток по документу (доп.субконто расчетов).
	Если СтрокаПлатежа.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.ПоДокументу
		И НераспределеннаяСумма > 0 Тогда
		
		Если ЗначениеЗаполнено(СтрокаПлатежа.ДопСубконтоРасчетов) Тогда
			ТекстОшибки = НСтр("ru='Указана сумма погашения, превышающая остаток задолженности по документу (доп.аналитике) расчетов: ""%4"".
				|
				|Указана сумма погашения: %1; Остаток задолженности: %2; Превышение: %3'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				ОбщегоНазначенияБГУ.ФорматСумм(СтрокаПлатежа.СуммаРасчетов, СтрокаПлатежа.Валюта, "0"),
				ОбщегоНазначенияБГУ.ФорматСумм(СтрокаПлатежа.СуммаРасчетов - НераспределеннаяСумма, СтрокаПлатежа.Валюта, "0"),
				ОбщегоНазначенияБГУ.ФорматСумм(НераспределеннаяСумма, СтрокаПлатежа.Валюта, "0"),
				СтрокаПлатежа.ДопСубконтоРасчетов);
		Иначе
			ТекстОшибки = НСтр("ru='Указана сумма погашения, превышающая остаток задолженности.
				|
				|Указана сумма погашения: %1; Остаток задолженности: %2; Превышение: %3'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				ОбщегоНазначенияБГУ.ФорматСумм(СтрокаПлатежа.СуммаРасчетов, СтрокаПлатежа.Валюта, "0"),
				ОбщегоНазначенияБГУ.ФорматСумм(СтрокаПлатежа.СуммаРасчетов - НераспределеннаяСумма, СтрокаПлатежа.Валюта, "0"),
				ОбщегоНазначенияБГУ.ФорматСумм(НераспределеннаяСумма, СтрокаПлатежа.Валюта, "0"));
		КонецЕсли;
		
		Если ОбщегоНазначенияБГУ.ЕстьРеквизитТабЧастиДокумента("СуммаВал", Реквизиты.Ссылка.Метаданные(), "РасшифровкаПлатежа") Тогда
			ПолеСумма = "РасшифровкаПлатежа[" + Формат(СтрокаПлатежа.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].СуммаВал";
		Иначе
			ПолеСумма = "РасшифровкаПлатежа[" + Формат(СтрокаПлатежа.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Сумма";
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Реквизиты.Ссылка, ПолеСумма, "Объект");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуАванса(ТаблицаРасчетов, НераспределеннаяСумма, НераспределеннаяСуммаВВалютеСписания, СтрокаПлатежа, Реквизиты)
	
	Если НераспределеннаяСумма <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРасчетов = ТаблицаРасчетов.Добавить();
	СтрокаРасчетов.ЭтоАванс = Истина;
	
	ЗаполнитьЗначенияСвойств(СтрокаРасчетов, СтрокаПлатежа,
		"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,КЭК,Подразделение,
		|СчетРасчетов,СчетАвансов,Контрагент,Договор,Валюта,СпособПогашенияЗадолженности,
		|ПроданнаяВалюта,
		|ВидДоговора,РасчетыВВалюте,УчетАгентскогоНДС,ИсточникСредств,ДопКлассификация,КодМероприятия,КодЦели,НазначениеПлатежа");
	
	Если УчетРасчетовКлиентСервер.ВедетсяУчетПоДокументамРасчетов(
			Реквизиты.Организация, Реквизиты.Дата, СтрокаПлатежа.КФО, СтрокаПлатежа.Валюта, СтрокаПлатежа.СчетРасчетов) Тогда
		СтрокаРасчетов.ВидДопСубконтоРасчетов = СтрокаПлатежа.ВидДопСубконтоРасчетов;
		СтрокаРасчетов.ДопСубконтоРасчетов    = Реквизиты.Ссылка;
	ИначеЕсли ЗначениеЗаполнено(СтрокаПлатежа.ВидДопСубконтоРасчетов)
		И СтрокаПлатежа.ВидДопСубконтоРасчетов <> ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов Тогда
		СтрокаРасчетов.ВидДопСубконтоРасчетов = СтрокаПлатежа.ВидДопСубконтоРасчетов;
		СтрокаРасчетов.ДопСубконтоРасчетов    = СтрокаПлатежа.ДопСубконтоРасчетов;
	КонецЕсли;
	
	Если СтрокаПлатежа.ЭтоПоступление И СтрокаПлатежа.ВидАванса = "Полученный" Тогда
		СтрокаРасчетов.ДокументАванса = Реквизиты.Ссылка;
	КонецЕсли;
	
	СтрокаРасчетов.СуммаРасчетов = НераспределеннаяСумма;
	СтрокаРасчетов.СуммаПроданнойВалюты = НераспределеннаяСуммаВВалютеСписания;
	
	КоэффициентРуб = ?(НЕ СтрокаПлатежа.РасчетыВВалюте, 1,
		?(СтрокаПлатежа.СуммаРасчетов = 0, 0, СтрокаПлатежа.СуммаРуб / СтрокаПлатежа.СуммаРасчетов));
	
	СтрокаРасчетов.СуммаРуб              = Окр(НераспределеннаяСумма * КоэффициентРуб, 2);
	СтрокаРасчетов.СуммаРубПоКурсуАванса = СтрокаРасчетов.СуммаРуб;
	
	Если Реквизиты.УчитыватьЗадолженностьЕНВД
	   И УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаПлатежа.КФО)
	   И УчетРасчетов.ВедетсяУчетАвансовПолученных(СтрокаПлатежа.СчетРасчетов) Тогда
	
		СтрокаРасчетов.ОтражениеАвансаУСН = СтрокаПлатежа.ОтражениеАвансаУСН;
		Если СтрокаПлатежа.ОтражениеАвансаУСН = Перечисления.ПорядокОтраженияАвансовУСН.ДоходЕНВД Тогда
			СтрокаРасчетов.СуммаЕНВДРуб = СтрокаРасчетов.СуммаРуб;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДенежныеОбязательства

// Структура таблицы принятых денежных обязательств.
//
Функция ПустаяТаблицаПринятыеДенежныеОбязательства() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("КЭК",           Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Счет и аналитика учета расчетов с контрагентами.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	// Суммы обязательств.
	ПустаяТаблица.Колонки.Добавить("СуммаВал", ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРуб", ОписаниеТипаСуммы);
	
	Возврат ПустаяТаблица;

КонецФункции

// Формирует таблицу принятых денежных обязательств.
//
Функция ТаблицаПринятыеДенежныеОбязательства(ТаблицаРасчетовСЗачетомАвансов, ТаблицыПоступления, Реквизиты = Неопределено, Отказ = Неопределено) Экспорт
	
	ДенежныеОбязательства = ПустаяТаблицаПринятыеДенежныеОбязательства();
	Если ТипЗнч(Реквизиты) = Тип("Структура") Тогда
		ЗаполнятьКЭК = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Реквизиты, "ЗаполнятьКЭК", Ложь);
	Иначе
		ЗаполнятьКЭК = Ложь;
	КонецЕсли;
	
	// По обычным договорам с поставщиками денежные обязательства будем признавать на сумму,
	// оставшуюся после зачета всех авансов.
	СтрокиОбязательств = ТаблицаРасчетовСЗачетомАвансов.НайтиСтроки(
		Новый Структура("ЭтоЗачетАванса", Ложь));
	Для Каждого СтрокаОбязательств Из СтрокиОбязательств Цикл
		
		Если БухгалтерскийУчет.СчетВИерархии(СтрокаОбязательств.СчетРасчетов, "303.00") Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДенежныеОбязательства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОбязательств,
			"ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта");
		
		НоваяСтрока.СуммаВал = СтрокаОбязательств.СуммаРасчетов;
		НоваяСтрока.СуммаРуб = СтрокаОбязательств.СуммаРубПоКурсуАванса;
		
		Если ЗаполнятьКЭК Тогда
			НоваяСтрока.КЭК = СтрокаОбязательств.КЭК;
		КонецЕсли;
		
	КонецЦикла;
	
	// По агентским договорам (в части НДС) к сумме денежного обязательства добавим сумму НДС.
	Для Каждого ТаблицаПоступления Из ТаблицыПоступления Цикл
		ЕстьКолонкаКЭК = ТаблицаПоступления.Значение.Колонки.Найти("КЭК");
		Для Каждого СтрокаПоступления Из ТаблицаПоступления.Значение Цикл
			
			Если УчетРасчетов.УчетАгентскогоНДС(СтрокаПоступления.Договор) Тогда
				
				НоваяСтрока = ДенежныеОбязательства.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПоступления,
					"ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта");
				
				НоваяСтрока.СуммаВал = СтрокаПоступления.СуммаНДСВал;
				НоваяСтрока.СуммаРуб = СтрокаПоступления.СуммаНДСРуб;
		
				Если ЗаполнятьКЭК И ЕстьКолонкаКЭК Тогда
					НоваяСтрока.КЭК = СтрокаОбязательств.КЭК;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	ДенежныеОбязательства.Свернуть("ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта,КЭК",
		"СуммаВал,СуммаРуб");
	
	Возврат ДенежныеОбязательства;
	
КонецФункции

// Структура таблицы принятых денежных обязательств при отражении зарплаты в учете.
//
Функция ПустаяТаблицаПринятыеДенежныеОбязательстваПоОплатеТруда() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Аналитика операции.
	ПустаяТаблица.Колонки.Добавить("ВидОперации",   Новый ОписаниеТипов("СправочникСсылка.ВидыОперацийОтраженияЗарплаты"));
	ПустаяТаблица.Колонки.Добавить("КЭК",           Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	// Сумма обязательств.
	ПустаяТаблица.Колонки.Добавить("Сумма", ОписаниеТипаСуммы);
	// Вспомогательные реквизиты.
	ПустаяТаблица.Колонки.Добавить("ДопКлассификация",   Новый ОписаниеТипов("СправочникСсылка.ДополнительнаяБюджетнаяКлассификация"));
	ПустаяТаблица.Колонки.Добавить("КодМероприятия",     Новый ОписаниеТипов("СправочникСсылка.Мероприятия"));
	ПустаяТаблица.Колонки.Добавить("КодЦели",            Новый ОписаниеТипов("СправочникСсылка.ВидыЦелевыхСредств"));
	
	Возврат ПустаяТаблица;

КонецФункции

// Формирует таблицу принятых денежных обязательств при отражении зарплаты в учете.
//
Функция ТаблицаПринятыеДенежныеОбязательстваПоОплатеТруда(Документ, Параметры, Отказ) Экспорт
	
	ДенежныеОбязательства = ПустаяТаблицаПринятыеДенежныеОбязательстваПоОплатеТруда();
	
	ВидыОперацийФСС = Новый Массив;
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ПФРЗаЗанятыхНаПодземныхИВредныхРаботах);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ПФРДополнительнаяНаДоплатуКПенсииШахтерам);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ПФРНакопительная);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ПФРСтраховая);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ПФРДополнительнаяЛетныхЭкипажей);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ПФРДополнительная);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ПФРПоСуммарномуТарифу);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ТФОМС);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ФСС);
	ВидыОперацийФСС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ФФОМС);
	
	ВидыОперацийФСС_НС = Новый Массив;
	ВидыОперацийФСС_НС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Начисление_НСиПЗ);
	ВидыОперацийФСС_НС.Добавить(Справочники.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_Страхование);
	
	Счет30302 = ПланыСчетов.ЕПСБУ.НайтиПоКоду("303.02");
	
	Запрос = Новый Запрос;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Операции",
		"НомерСтроки,ИФО,КФО,Счет,КПС,КЭК,Подразделение,
		|ВидОперации,Контрагент,Договор,ВалютаДокумента,
		|ДопКлассификация,КодМероприятия,КодЦели,Сумма",
		Документ, Параметры);
		
	Запрос.УстановитьПараметр("ВидыОперацийФСС", ВидыОперацийФСС);
	Запрос.УстановитьПараметр("ВидыОперацийФССНС", ВидыОперацийФСС_НС);
	Запрос.УстановитьПараметр("Счет30302", Счет30302);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_СтраховыеВзносы_ФСС) КАК ВидОперации,
	|	Операции.ИФО КАК ИФО,
	|	Операции.КФО КАК КФО,
	|	Операции.КПС КАК КПС,
	|	Операции.КЭК КАК КЭК,
	|	Операции.Подразделение КАК Подразделение,
	|	Операции.Контрагент КАК Контрагент,
	|	Операции.Договор КАК Договор,
	|	Операции.ДопКлассификация КАК ДопКлассификация,
	|	Операции.КодМероприятия КАК КодМероприятия,
	|	Операции.КодЦели КАК КодЦели,
	|	СУММА(-Операции.Сумма) КАК Сумма
	|ИЗ
	|	ТаблицаОперации КАК Операции
	|ГДЕ
	|	(Операции.ВидОперации В (&ВидыОперацийФСС)
	|				И Операции.Счет = &Счет30302
	|			%ОтборУменьшениеДО%)
	|СГРУППИРОВАТЬ ПО
	|	Операции.ИФО,
	|	Операции.КФО,
	|	Операции.КПС,
	|	Операции.КЭК,
	|	Операции.Подразделение,
	|	Операции.Контрагент,
	|	Операции.Договор,
	|	Операции.ДопКлассификация,
	|	Операции.КодМероприятия,
	|	Операции.КодЦели
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ВидыОперацийОтраженияЗарплаты.ЗП_Отчисления_Страхование),
	|	Операции.ИФО,
	|	Операции.КФО,
	|	Операции.КПС,
	|	Операции.КЭК,
	|	Операции.Подразделение,
	|	Операции.Контрагент,
	|	Операции.Договор,
	|	Операции.ДопКлассификация,
	|	Операции.КодМероприятия,
	|	Операции.КодЦели,
	|	СУММА(-Операции.Сумма)
	|ИЗ
	|	ТаблицаОперации КАК Операции
	|ГДЕ
	|	(Операции.ВидОперации В (&ВидыОперацийФССНС)
	|				И Операции.Счет = &Счет30302
	|			ИЛИ Операции.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийОтраженияЗарплаты.ЗП_Начисление_НСиПЗ))
	|СГРУППИРОВАТЬ ПО
	|	Операции.ИФО,
	|	Операции.КФО,
	|	Операции.КПС,
	|	Операции.КЭК,
	|	Операции.Подразделение,
	|	Операции.Контрагент,
	|	Операции.Договор,
	|	Операции.ДопКлассификация,
	|	Операции.КодМероприятия,
	|	Операции.КодЦели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Операции"" КАК ИмяСписка,
	|	""Операции"" КАК СинонимСписка,
	|	Операции.НомерСтроки КАК НомерСтроки,
	|	Операции.ИФО КАК ИФО,
	|	Операции.КФО КАК КФО,
	|	Операции.КПС КАК КПС,
	|	Операции.КЭК КАК КЭК,
	|	Операции.Подразделение КАК Подразделение,
	|	Операции.ВидОперации КАК ВидОперации,
	|	Операции.ВидОперации.Код КАК КодВидаОперации,
	|	Операции.Контрагент КАК Контрагент,
	|	Операции.Договор КАК Договор,
	|	Операции.ВалютаДокумента КАК Валюта,
	|	Операции.ДопКлассификация КАК ДопКлассификация,
	|	Операции.КодМероприятия КАК КодМероприятия,
	|	Операции.КодЦели КАК КодЦели,
	|	Операции.Сумма КАК Сумма
	|ИЗ
	|	ТаблицаОперации КАК Операции
	|ГДЕ
	|	Операции.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОперацийОтраженияЗарплаты.ЗП_Удержания_НДФЛ)
	|	И Операции.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОперацийОтраженияЗарплаты.ЗП_Удержания_ПФРДополнительная)
	|	И Операции.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОперацийОтраженияЗарплаты.ЗП_Удержания_Разные)
	|	И Операции.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОперацийОтраженияЗарплаты.ЗП_Удержания_НДФЛСПревышения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если Документ.Дата >= Дата("20230101") Тогда
		ТекстОтбораУменьшениеДО = "";
	Иначе
		ТекстОтбораУменьшениеДО = "ИЛИ Операции.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОперацийОтраженияЗарплаты.ЗП_Начисление_ПособияФСС2010)";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"%ОтборУменьшениеДО%",
			ТекстОтбораУменьшениеДО);
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицаУменьшениеДО = Результат[1].Выгрузить();
	ТаблицаОперации = Результат[2].Выгрузить();
	
	Для Каждого СтрокаОперации Из ТаблицаОперации Цикл
		
		НоваяСтрока = ДенежныеОбязательства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОперации);
		
	КонецЦикла;
	
	// Уменьшим страховые взносы в ФСС на начисления за счет ФСС (встречные требования).
	Для Каждого СтрокаУменьшениеДО Из ТаблицаУменьшениеДО Цикл
		
		НоваяСтрока = ДенежныеОбязательства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаУменьшениеДО);
		
	КонецЦикла;

	Возврат ДенежныеОбязательства;
	
КонецФункции

// Формирует таблицу принятых денежных обязательств при отражении в учете начисленных процентов, пени, штрафов к уплате.
//
Функция ТаблицаПринятыеДенежныеОбязательстваПоПроцентамПениШтрафамКУплате(Документ, Параметры = Неопределено) Экспорт
	
	ДенежныеОбязательства = ПустаяТаблицаПринятыеДенежныеОбязательства();
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Начисления",
		"ИФО,КФО,КПС,Подразделение,Контрагент,Договор,Валюта,СчетРасчетов,Сумма,СуммаВал", Документ, Параметры);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	Начисления.ИФО КАК ИФО,
	|	Начисления.КФО КАК КФО,
	|	Начисления.КПС КАК КПС,
	|	Начисления.Подразделение КАК Подразделение,
	|	Начисления.СчетРасчетов КАК СчетРасчетов,
	|	Начисления.Контрагент КАК Контрагент,
	|	Начисления.Договор КАК Договор,
	|	Начисления.Валюта КАК Валюта,
	|	Начисления.Сумма КАК СуммаРуб,
	|	Начисления.СуммаВал КАК СуммаВал
	|ИЗ
	|	ТаблицаНачисления КАК Начисления";
	
	Начисления = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из Начисления Цикл
		
		НоваяСтрока = ДенежныеОбязательства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	ДенежныеОбязательства.Свернуть("ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта",
		"СуммаВал,СуммаРуб");
	
	Возврат ДенежныеОбязательства;
	
КонецФункции

// Рассчитывает денежные обязательства в документах поступления товаров, работ, услуг.
// Документ должен быть не проведен.
//
// Параметры:
//  Объект						 - ДокументОбъект,
//  ПериодОстатков				 - Граница - граница для получения таблицы расчетов по документу,
//  Отказ						 - Булево - возвращаемое значение. Равен ИСТИНА, если возникли ошибки при расчете.
// 
// Возвращаемое значение:
// ТаблицаЗначений - таблица сумм денежных обязательств
//
Функция ДенежныеОбязательстваПоПоступлениюТРУ(Объект, ПериодОстатков, Отказ = Ложь) Экспорт

	ТаблицаОбязательств = Новый ТаблицаЗначений;
	ТаблицаОбязательств.Колонки.Добавить("КФО",   			Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаОбязательств.Колонки.Добавить("КПС",   			Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаОбязательств.Колонки.Добавить("КЭК",   			Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаОбязательств.Колонки.Добавить("Контрагент",		Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаОбязательств.Колонки.Добавить("Договор",   		Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ТаблицаОбязательств.Колонки.Добавить("Подразделение", 	Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТаблицаОбязательств.Колонки.Добавить("Сумма", 			Новый ОписаниеТипов("Число"));
	
	ПараметрыЗаполнения = Новый Структура("ПериодОстатков, Организация, Дата, Ссылка, КЭКРасчетов, СчетРасчетов, КПС, СпособЗачетаАванса ,КПСРасчетовВТЧ");
	
	ПараметрыЗаполнения.ПериодОстатков = ПериодОстатков;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "СчетРасчетов") Тогда
		ПараметрыЗаполнения.СчетРасчетов = Объект.СчетРасчетов;
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеМЗВПути") Тогда
		ПараметрыЗаполнения.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("302.34", Объект.Дата, Объект.Организация);
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "КПСРасчетов") Тогда
		ПараметрыЗаполнения.КПС = Объект.КПСРасчетов;
	Иначе
		ПараметрыЗаполнения.КПС = Неопределено;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "НесколькоКПСРасчетов") Тогда
		ПараметрыЗаполнения.КПСРасчетовВТЧ = Объект.НесколькоКПСРасчетов;
	Иначе
		ПараметрыЗаполнения.КПСРасчетовВТЧ = Ложь;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "СпособЗачетаАванса") Тогда
		ПараметрыЗаполнения.СпособЗачетаАванса = Объект.СпособЗачетаАванса;
	КонецЕсли;
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеУслугРаботПоСчетамУчетаЗатрат") Тогда
		ПараметрыЗаполнения.Вставить("Курс", Объект.Курс);
		ПараметрыЗаполнения.Вставить("Кратность", Объект.Кратность);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, Объект, "Организация, Дата, Ссылка");
	
	РасчетыПоДокументу = ПодготовитьТаблицуРасчетовПоДокументу(Объект, ПараметрыЗаполнения, Отказ);
	
	Если Отказ Тогда
		Возврат ТаблицаОбязательств;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "НомерКорректировки") И Объект.НомерКорректировки > 0 Тогда
		ПараметрыЗаполнения.Вставить("НомерКорректировки", Объект.НомерКорректировки);
		ПараметрыЗаполнения.Вставить("КорректируемыйДокумент", Объект.ДокументОснование);
	КонецЕсли;
	
	Если ПараметрыЗаполнения.СпособЗачетаАванса = Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
		
		ВалютаРубль = Константы.ВалютаРегламентированногоУчета.Получить();
		
		ЗачетАвансовПоДокументу = ПустаяТаблицаЗачетАвансовПоДокументу();
		Для Каждого СтрокаАванса Из Объект.ЗачетАвансов Цикл
			НоваяСтрокаЗачета = ЗачетАвансовПоДокументу.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЗачета, Объект);
			ЗаполнитьЗначенияСвойств(НоваяСтрокаЗачета, СтрокаАванса);
			Если Не ЗначениеЗаполнено(НоваяСтрокаЗачета.СчетРасчетов) Тогда
				НоваяСтрокаЗачета.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(НоваяСтрокаЗачета.КЭК, "302.00", ,
					Объект.Дата, Объект.Организация);
			КонецЕсли;
			НоваяСтрокаЗачета.СчетАвансов = ОпределитьСчетАвансов(НоваяСтрокаЗачета.СчетРасчетов,
				Объект.Дата, Объект.Организация);
			НоваяСтрокаЗачета.СуммаРасчетов = СтрокаАванса.СуммаЗачета;
			НоваяСтрокаЗачета.ЭтоПоступление = Истина;
			НоваяСтрокаЗачета.Валюта = ?(ЗначениеЗаполнено(НоваяСтрокаЗачета.Валюта), НоваяСтрокаЗачета.Валюта, ВалютаРубль);
		КонецЦикла;
		
	Иначе
		ЗачетАвансовПоДокументу = ПустаяТаблицаЗачетАвансовПоДокументу();
	КонецЕсли;
	РасчетыСЗачетомАвансов = ТаблицаРасчетовСЗачетомАвансов(РасчетыПоДокументу, ЗачетАвансовПоДокументу, ПараметрыЗаполнения, Отказ);
	
	Если Отказ Тогда
		Возврат ТаблицаОбязательств;
	КонецЕсли;
	
	ТаблицыПоступления = Новый Структура;
	
	РассчитыватьКЭКВКаждойСтроке = ТипЗнч(Объект) = Тип("ДокументОбъект.АктПриемкиТоваровРаботУслуг");
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.АктПриемкиТоваровРаботУслуг") Тогда
		ТаблицаПоступления = УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеМатериальныхЗапасов();
		
		МатериальныеЗапасыДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуПоступлениеМатериальныхЗапасовПоДокументу(Объект,, Отказ);
		ТаблицаПоступленияМЗ = УправлениеМатериальнымиЗапасами.ТаблицаПоступлениеМатериальныхЗапасов(МатериальныеЗапасыДокумента, РасчетыСЗачетомАвансов);
		Для каждого СтрокаПоступленияМЗ Из ТаблицаПоступленияМЗ Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПоступления.Добавить(), СтрокаПоступленияМЗ);
		КонецЦикла;
		
		ПараметрыЗаполнения.Вставить("ВидЗатрат", ПредопределенноеЗначение("Справочник.ВидыЗатрат.ПустаяСсылка"));
		ОСДокумента = УправлениеОсновнымиСредствами.ПодготовитьТаблицуПоступлениеОсновныхСредствПоДокументу(Объект, ПараметрыЗаполнения, Отказ);
		ТаблицаПоступленияОС = УправлениеОсновнымиСредствами.ТаблицаПоступлениеОсновныхСредств(ОСДокумента, РасчетыСЗачетомАвансов, ПараметрыЗаполнения, Отказ);
		Для каждого СтрокаПоступленияОС Из ТаблицаПоступленияОС Цикл
			СтрокаПоступления = ТаблицаПоступления.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПоступления, СтрокаПоступленияОС);
			СтрокаПоступления.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(СтрокаПоступленияОС.СчетРасчетов)
		КонецЦикла;
		
		ТабДокумента = ПодготовитьТаблицуПоступлениеУслугРаботПоДокументу(Объект, ПараметрыЗаполнения); 
		ТаблицаПоступленияУслуг = ТаблицаПоступлениеУслугРабот(ТабДокумента, РасчетыСЗачетомАвансов, ПараметрыЗаполнения, Отказ);
		Для каждого СтрокаПоступленияУслуг Из ТаблицаПоступленияУслуг Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПоступления.Добавить(), СтрокаПоступленияУслуг);
		КонецЦикла;
		ТаблицыПоступления.Вставить("ПоступлениеМатериальныхЗапасов", ТаблицаПоступления);
	ИначеЕсли ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("Материалы", Объект.Метаданные()) Тогда
		МатериальныеЗапасыДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуПоступлениеМатериальныхЗапасовПоДокументу(Объект, ПараметрыЗаполнения, Отказ);
		Если Отказ Тогда
			Возврат ТаблицаОбязательств;
		КонецЕсли;
		ТаблицаПоступления = УправлениеМатериальнымиЗапасами.ТаблицаПоступлениеМатериальныхЗапасов(МатериальныеЗапасыДокумента, РасчетыСЗачетомАвансов);
		ВозвратнаяТараДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуПоступлениеВозвратнойТарыПоДокументу(Объект, ПараметрыЗаполнения, Отказ);
		Если Отказ Тогда
			Возврат ТаблицаОбязательств;
		КонецЕсли;
		Для каждого СтрокаВозвратнойТары Из ВозвратнаяТараДокумента Цикл
			НоваяСтрока = ТаблицаПоступления.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВозвратнойТары);
			НоваяСтрока.СуммаРуб = СтрокаВозвратнойТары.Сумма;
		КонецЦикла;
		ТаблицыПоступления.Вставить("ПоступлениеМатериальныхЗапасов", ТаблицаПоступления);
	
	ИначеЕсли ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("КапВложения", Объект.Метаданные()) Тогда
		ПараметрыЗаполнения.Вставить("ВидЗатрат", ПредопределенноеЗначение("Справочник.ВидыЗатрат.ПустаяСсылка"));
		ОСДокумента = УправлениеОсновнымиСредствами.ПодготовитьТаблицуПоступлениеОсновныхСредствПоДокументу(Объект, ПараметрыЗаполнения, Отказ);
		Если Отказ Тогда
			Возврат ТаблицаОбязательств;
		КонецЕсли;
		ТаблицаПоступления = УправлениеОсновнымиСредствами.ТаблицаПоступлениеОсновныхСредств(ОСДокумента, РасчетыСЗачетомАвансов, ПараметрыЗаполнения, Отказ);
		Если Отказ Тогда
			Возврат ТаблицаОбязательств;
		КонецЕсли;
		ТаблицыПоступления.Вставить("ПоступлениеОсновныхСредств", ТаблицаПоступления);
		
	ИначеЕсли ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("ПраваПользования", Объект.Метаданные())
		Или ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("УслугиИРаботы", Объект.Метаданные()) Тогда
			
		ТабДокумента = ПодготовитьТаблицуПоступлениеУслугРаботПоДокументу(Объект, ПараметрыЗаполнения); 
		ТаблицаПоступления = ТаблицаПоступлениеУслугРабот(ТабДокумента, РасчетыСЗачетомАвансов, ПараметрыЗаполнения, Отказ);
		Если Отказ Тогда
			Возврат ТаблицаОбязательств;
		КонецЕсли;
		ТаблицыПоступления.Вставить("ПоступлениеУслугРабот", ТаблицаПоступления);
	КонецЕсли;
	
	ПараметрыРасчетаДО = Новый Структура;
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.АктПриемкиТоваровРаботУслуг") Тогда
		ПараметрыРасчетаДО.Вставить("ЗаполнятьКЭК", Истина);
	КонецЕсли;
	ТаблицаДО = ТаблицаПринятыеДенежныеОбязательства(РасчетыСЗачетомАвансов, ТаблицыПоступления, ПараметрыРасчетаДО);
	
	КЭК340 = БухгалтерскийУчетПовтИсп.КЭКПоКоду("340");
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеУслугРабот")
		Или ТипЗнч(Объект) = Тип("ДокументОбъект.АктПриемкиТоваровРаботУслуг") Тогда
		ИспользоватьДетальныйКЭК = Истина;
	Иначе
		Если ЗначениеЗаполнено(ПараметрыЗаполнения.СчетРасчетов) Тогда
			КЭКРасчетов = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчетуСУчетомПоступленияМЗ(ПараметрыЗаполнения.СчетРасчетов);
		Иначе
			КЭКРасчетов = Справочники.КОСГУ.ПустаяСсылка();
		КонецЕсли;
		ИспользоватьДетальныйКЭК = КЭКРасчетов = КЭК340;
	КонецЕсли;
	
	ПринятьВсеОбязательства = (ТипЗнч(ТаблицаПоступления) = Тип("ТаблицаЗначений"))  
	                          И (ТаблицаПоступления.Итог("СуммаРуб") = ТаблицаДО.Итог("СуммаРуб"));
		
	Если ПринятьВсеОбязательства И ИспользоватьДетальныйКЭК  Тогда
		
		Для Каждого СтрМатериалы Из ТаблицаПоступления Цикл
			НовСтрДО = ТаблицаОбязательств.Добавить();
			НовСтрДО.КФО   = СтрМатериалы.КФО;
			Если ПараметрыЗаполнения.КПСРасчетовВТЧ Тогда
				НовСтрДО.КПС   = ?(ЗначениеЗаполнено(СтрМатериалы.КПСРасчетов), СтрМатериалы.КПСРасчетов,
				?(ЗначениеЗаполнено(ПараметрыЗаполнения.КПС), ПараметрыЗаполнения.КПС, СтрМатериалы.КПС));
			Иначе
				НовСтрДО.КПС   = ?(ЗначениеЗаполнено(ПараметрыЗаполнения.КПС), ПараметрыЗаполнения.КПС, СтрМатериалы.КПС);
			КонецЕсли;
			НовСтрДО.КЭК   = СтрМатериалы.КЭК;
			НовСтрДО.Сумма = СтрМатериалы.СуммаРуб;
		КонецЦикла;
		
	Иначе
		
		ДетальныеКЭК340 = ДетальныеКЭК340();
		ПоступлениеМЗПоРазнымКЭК = ЕстьРазныеДетальныеКЭК340(ТаблицаПоступления, ДетальныеКЭК340);
		Если ИспользоватьДетальныйКЭК Тогда
			ИспользуемыеКОСГУ = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаПоступления, "КЭК", Истина);
			Если ИспользуемыеКОСГУ.Количество() = 1 И ЗначениеЗаполнено(ИспользуемыеКОСГУ[0]) Тогда
				КОСГУ = ИспользуемыеКОСГУ[0];
			Иначе
				КОСГУ = Справочники.КОСГУ.ПустаяСсылка();
			КонецЕсли;
		Иначе
			КОСГУ = КЭКРасчетов;
		КонецЕсли;
		
		Для Каждого СтрТаблицаДО Из ТаблицаДО Цикл
			НовСтрДО = ТаблицаОбязательств.Добавить();
			НовСтрДО.Контрагент= СтрТаблицаДО.Контрагент;
			НовСтрДО.Договор= СтрТаблицаДО.Договор;
			НовСтрДО.Подразделение= СтрТаблицаДО.Подразделение;
			НовСтрДО.КФО   = СтрТаблицаДО.КФО;
			НовСтрДО.КПС   = СтрТаблицаДО.КПС;
			Если РассчитыватьКЭКВКаждойСтроке Тогда
				Если ДетальныеКЭК340.Получить(СтрТаблицаДО.КЭК) <> Неопределено
					И ПоступлениеМЗПоРазнымКЭК Тогда
					НовСтрДО.КЭК = КЭК340;
				ИначеЕсли ЗначениеЗаполнено(СтрТаблицаДО.КЭК) Тогда
					НовСтрДО.КЭК = СтрТаблицаДО.КЭК;
				Иначе
					НовСтрДО.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчетуСУчетомПоступленияМЗ(СтрТаблицаДО.СчетРасчетов);
				КонецЕсли;
			Иначе
				НовСтрДО.КЭК   = ?(ЗначениеЗаполнено(КОСГУ), КОСГУ, БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчетуСУчетомПоступленияМЗ(СтрТаблицаДО.СчетРасчетов));
			КонецЕсли;
			НовСтрДО.Сумма = СтрТаблицаДО.СуммаРуб;
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаОбязательств.Свернуть("Контрагент,Договор,Подразделение,КФО,КПС,КЭК", "Сумма");
	
	Возврат ТаблицаОбязательств;

КонецФункции

Функция ДетальныеКЭК340()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОСГУ.Ссылка
	|ИЗ
	|	Справочник.КОСГУ КАК КОСГУ
	|ГДЕ
	|	КОСГУ.Ссылка В ИЕРАРХИИ (&КЭК340)";
	Запрос.УстановитьПараметр("КЭК340", БухгалтерскийУчетПовтИсп.КЭКПоКоду("340"));
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Ссылка, Истина);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ЕстьРазныеДетальныеКЭК340(Таблица, ДетальныеКЭК)
	Если Таблица = Неопределено ИЛИ Таблица.Колонки.Найти("КЭК") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ИспользованныеКЭК = Новый Соответствие;
	Для Каждого Строка Из Таблица Цикл
		Если ДетальныеКЭК.Получить(Строка.КЭК) <> Неопределено Тогда
			ИспользованныеКЭК.Вставить(Строка.КЭК, Истина);
		КонецЕсли;
	КонецЦикла;
	Возврат ИспользованныеКЭК.Количество() > 1;
КонецФункции

#КонецОбласти

#Область УчетУслугРабот

// Исходные данные документа.

// Пустая таблица поступление услуг работ по документу.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Пустая таблица поступление услуг работ по документу:
// * ИмяСписка - Строка 
// * СинонимСписка - Строка 
// * НомерСтроки - Строка 
// * ИФО - СправочникСсылка.ИсточникиФинансовогоОбеспечения - 
// * КФО - ПеречислениеСсылка.КВД - 
// * КПС - СправочникСсылка.КлассификационныеПризнакиСчетов - 
// * Подразделение - СправочникСсылка.Подразделения - 
// * Номенклатура - СправочникСсылка.Номенклатура - 
// * Содержание - Строка - 
// * КЭК - СправочникСсылка.КОСГУ - 
// * ВидЗатрат - СправочникСсылка.ВидыЗатрат - 
// * ПодразделениеЗатрат - СправочникСсылка.Подразделения - 
// * СубконтоЗатрат1 - Характеристика.ВидыСубконто 
// * СубконтоЗатрат2 - Характеристика.ВидыСубконто 
// * СубконтоЗатрат3 - Характеристика.ВидыСубконто
// * СчетРасчетов - ПланСчетовСсылка.ЕПСБУ - 
// * Контрагент - СправочникСсылка.Контрагенты - 
// * Договор - СправочникСсылка.Договоры - 
// * Валюта - СправочникСсылка.Валюты - 
// * Количество - Число 
// * Сумма - Число
// * СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - 
// * СуммаНДС - Число
// * НДСКРаспределению - Булево - 
// * ПринятьНДСКВычету - Булево - 
// * ОтразитьВГрафикеИсполненияДоговора - ПеречислениеСсылка.СтатусыДокументовКонтрольИсполненияДоговоров - 
Функция ПустаяТаблицаПоступлениеУслугРаботПоДокументу() Экспорт
	ОписаниеТипаСуммы        = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества   = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	ОписаниеТипаСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	
	ТаблицаДокумента = Новый ТаблицаЗначений;
	// Идентификация строки.
	ТаблицаДокумента.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ТаблицаДокумента.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ТаблицаДокумента.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Общие разрезы учета.
	ТаблицаДокумента.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаДокумента.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДокумента.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаДокумента.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Счет и аналитика учета услуг, работ.
	ТаблицаДокумента.Колонки.Добавить("Номенклатура",        Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДокумента.Колонки.Добавить("Содержание",          Новый ОписаниеТипов("Строка"));
	ТаблицаДокумента.Колонки.Добавить("КЭК",                 Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаДокумента.Колонки.Добавить("ВидЗатрат",           Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
	ТаблицаДокумента.Колонки.Добавить("ПодразделениеЗатрат", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТаблицаДокумента.Колонки.Добавить("СчетЗатрат", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДокумента.Колонки.Добавить("СубконтоЗатрат1", ОписаниеТипаСубконто);
	ТаблицаДокумента.Колонки.Добавить("СубконтоЗатрат2", ОписаниеТипаСубконто);
	ТаблицаДокумента.Колонки.Добавить("СубконтоЗатрат3", ОписаниеТипаСубконто);
	// Контрагент (поставщик, покупатель).
	ТаблицаДокумента.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаДокумента.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДокумента.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ТаблицаДокумента.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаДокумента.Колонки.Добавить("Комитент",      Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДокумента.Колонки.Добавить("ДоговорКомитента",     Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ТаблицаДокумента.Колонки.Добавить("КомиссионнаяТорговля", Новый ОписаниеТипов("Булево"));
	// Количество и суммовые показатели поступивших услуг, работ.
	ТаблицаДокумента.Колонки.Добавить("Количество",    ОписаниеТипаКоличества);
	ТаблицаДокумента.Колонки.Добавить("Сумма",         ОписаниеТипаСуммы); // Сумма с НДС в валюте документа.
	ТаблицаДокумента.Колонки.Добавить("СтавкаНДС",     Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТаблицаДокумента.Колонки.Добавить("СуммаНДС",      ОписаниеТипаСуммы); // Сумма НДС в валюте документа.
	ТаблицаДокумента.Колонки.Добавить("СуммаРезерв", ОписаниеТипаСуммы); // Сумма резерва с НДС в валюте документа.
	ТаблицаДокумента.Колонки.Добавить("СуммаНДСРезерв", ОписаниеТипаСуммы); // Сумма резерва НДС в валюте документа.
	// Дополнительные колонки.
	ТаблицаДокумента.Колонки.Добавить("НДСКРаспределению", Новый ОписаниеТипов("Булево"));
	ТаблицаДокумента.Колонки.Добавить("ПринятьНДСКВычету", Новый ОписаниеТипов("Булево"));
	ТаблицаДокумента.Колонки.Добавить("ОтразитьВГрафикеИсполненияДоговора",
		Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыДокументовКонтрольИсполненияДоговоров"));
	Возврат ТаблицаДокумента; 	
КонецФункции

// Подготавливает таблицу документа (в унифицированном формате) для поступления услуг, работ.
//
Функция ПодготовитьТаблицуПоступлениеУслугРаботПоДокументу(Документ, Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	Если НЕ Параметры.Свойство("ОтразитьВГрафикеИсполненияДоговора") Тогда
		// Если в документе, таб.части и типовой операции нет реквизита ОтразитьВГрафикеИсполненияДоговора,
		// по умолчанию будем отражать в графике исполнения договора.
		Параметры.Вставить("ОтразитьВГрафикеИсполненияДоговора",
			Перечисления.СтатусыДокументовКонтрольИсполненияДоговоров.ОтразитьСейчас);
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеУслугРаботПоСчетамУчетаЗатрат") Тогда
		Возврат Документы.ПоступлениеУслугРаботПоСчетамУчетаЗатрат.ТаблицаПоступлениеУслугРаботПоДокументу(
			Документ, Параметры);
	КонецЕсли;
	
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	
	МетаданныеДокумента = Документ.Метаданные();
	
	ТаблицаДокумента = ПустаяТаблицаПоступлениеУслугРаботПоДокументу();
	
	Если МетаданныеДокумента.Имя = "НачислениеАмортизацииПравПользованияОС" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ПраваПользования",
			"НомерСтроки,ИФО,КФО,КПС,Подразделение,ПодразделениеРасходов,Контрагент,Договор,Валюта,НДСКРаспределению,
			|ОсновноеСредство,СчетУчета,СчетРасходов,СубконтоРасходов1,СубконтоРасходов2,СубконтоРасходов3,КЭКРасходов,
			|СтавкаНДС,СуммаНДС,Всего,СуммаРасчетов,СуммаРасчетовВВалюте,
			|ОтразитьВГрафикеИсполненияДоговора",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""ПраваПользования"" КАК ИмяСписка,
		|	""Права пользования"" КАК СинонимСписка,
		|	ПраваПользования.НомерСтроки КАК НомерСтроки,
		|	ПраваПользования.ИФО КАК ИФО,
		|	ПраваПользования.КФО КАК КФО,
		|	ПраваПользования.КПС КАК КПС,
		|	ПраваПользования.Подразделение КАК Подразделение,
		|	ПраваПользования.ПодразделениеРасходов КАК ПодразделениеЗатрат,
		|	ПраваПользования.Контрагент КАК Контрагент,
		|	ПраваПользования.Договор КАК Договор,
		|	ПраваПользования.ОтразитьВГрафикеИсполненияДоговора КАК ОтразитьВГрафикеИсполненияДоговора,
		|	ПраваПользования.Валюта КАК Валюта,
		|	ПраваПользования.ОсновноеСредство КАК ОсновноеСредство,
		|	ПраваПользования.ОсновноеСредство.НаименованиеПолное КАК Содержание,
		|	ПраваПользования.СчетУчета КАК СчетУчета,
		|	ПраваПользования.СчетРасходов КАК СчетРасходов,
		|	ПраваПользования.СубконтоРасходов1 КАК СубконтоРасходов1,
		|	ПраваПользования.СубконтоРасходов2 КАК СубконтоРасходов2,
		|	ПраваПользования.СубконтоРасходов3 КАК СубконтоРасходов3,
		|	ПраваПользования.КЭКРасходов КАК КЭК,
		|	1 КАК Количество,
		|	ПраваПользования.СтавкаНДС КАК СтавкаНДС,
		|	ПраваПользования.СуммаНДС КАК СуммаНДС,
		|	ПраваПользования.НДСКРаспределению КАК НДСКРаспределению,
		|	ПраваПользования.СуммаРасчетовВВалюте КАК Сумма
		|ПОМЕСТИТЬ АрендныеПлатежи
		|ИЗ
		|	ТаблицаПраваПользования КАК ПраваПользования
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Договор,
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыАмортизацииПравПользованияСрезПоследних.Договор КАК Договор,
		|	ПараметрыАмортизацииПравПользованияСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	ПараметрыАмортизацииПравПользованияСрезПоследних.СчетРасчетов КАК СчетРасчетов,
		|	ПараметрыАмортизацииПравПользованияСрезПоследних.КПСРасчетов КАК КПСРасчетов
		|ПОМЕСТИТЬ ПараметрыАмортизацииПравПользования
		|ИЗ
		|	РегистрСведений.ПараметрыАмортизацииПравПользованияОС.СрезПоследних(
		|			&ГраницаСреза,
		|			Договор В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						АрендныеПлатежи.Договор
		|					ИЗ
		|						АрендныеПлатежи)
		|				И Организация = &Организация
		|				И ОсновноеСредство В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						АрендныеПлатежи.ОсновноеСредство
		|					ИЗ
		|						АрендныеПлатежи)) КАК ПараметрыАмортизацииПравПользованияСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Договор,
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АрендныеПлатежи.ИмяСписка КАК ИмяСписка,
		|	АрендныеПлатежи.СинонимСписка КАК СинонимСписка,
		|	АрендныеПлатежи.НомерСтроки КАК НомерСтроки,
		|	АрендныеПлатежи.ИФО КАК ИФО,
		|	АрендныеПлатежи.КФО КАК КФО,
		|	АрендныеПлатежи.КПС КАК КПС,
		|	АрендныеПлатежи.Подразделение КАК Подразделение,
		|	АрендныеПлатежи.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	АрендныеПлатежи.Контрагент КАК Контрагент,
		|	АрендныеПлатежи.Договор КАК Договор,
		|	АрендныеПлатежи.Валюта КАК Валюта,
		|	АрендныеПлатежи.ОсновноеСредство КАК ОсновноеСредство,
		|	АрендныеПлатежи.Содержание КАК Содержание,
		|	АрендныеПлатежи.СчетУчета КАК СчетУчета,
		|	АрендныеПлатежи.СчетРасходов КАК СчетРасходов,
		|	АрендныеПлатежи.СубконтоРасходов1 КАК СубконтоРасходов1,
		|	АрендныеПлатежи.СубконтоРасходов2 КАК СубконтоРасходов2,
		|	АрендныеПлатежи.СубконтоРасходов3 КАК СубконтоРасходов3,
		|	АрендныеПлатежи.КЭК КАК КЭК,
		|	АрендныеПлатежи.Количество КАК Количество,
		|	АрендныеПлатежи.СтавкаНДС КАК СтавкаНДС,
		|	АрендныеПлатежи.СуммаНДС КАК СуммаНДС,
		|	АрендныеПлатежи.НДСКРаспределению КАК НДСКРаспределению,
		|	АрендныеПлатежи.Сумма КАК Сумма,
		|	АрендныеПлатежи.ОтразитьВГрафикеИсполненияДоговора КАК ОтразитьВГрафикеИсполненияДоговора,
		|	ЕСТЬNULL(ПараметрыАмортизацииПравПользования.СчетРасчетов, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетРасчетов,
		|	ЕСТЬNULL(ПараметрыАмортизацииПравПользования.КПСРасчетов, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПСРасчетов
		|ИЗ
		|	АрендныеПлатежи КАК АрендныеПлатежи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииПравПользования КАК ПараметрыАмортизацииПравПользования
		|		ПО АрендныеПлатежи.Договор = ПараметрыАмортизацииПравПользования.Договор
		|			И АрендныеПлатежи.ОсновноеСредство = ПараметрыАмортизацииПравПользования.ОсновноеСредство
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		Запрос.УстановитьПараметр("ГраницаСреза", КонецМесяца(Документ.Дата));
		Запрос.УстановитьПараметр("Организация",  Документ.Организация);
		Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
		
		НачислениеАренднойПлаты = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаДокумента Из НачислениеАренднойПлаты Цикл
			
			НоваяСтрока = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
			
			Если ЗначениеЗаполнено(СтрокаДокумента.СчетРасчетов) Тогда
				// Счет расчетов указан в регистре сведений, берем его.
				// Если КПС расчетов не указан, значит совпадает с КПС учета.
				НоваяСтрока.СчетРасчетов = СтрокаДокумента.СчетРасчетов;
				НоваяСтрока.КПС = ?(ЗначениеЗаполнено(СтрокаДокумента.КПСРасчетов),
					СтрокаДокумента.КПСРасчетов, СтрокаДокумента.КПС);
			Иначе
				// Счет расчетов не указан в регистре сведений, определяем его по счету учета.
				// КПС совпадает с КПС учета.
				НоваяСтрока.СчетРасчетов = УчетРасчетов.СчетРасчетовПоАренднойПлате(
					СтрокаДокумента.СчетУчета, Документ.Дата, Документ.Организация);
				НоваяСтрока.КПС = СтрокаДокумента.КПС;
			КонецЕсли;
			
			СвойстваСчетаРасходов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаДокумента.СчетРасходов);
			Если СвойстваСчетаРасходов.ВидСубконто1 = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
				НоваяСтрока.ВидЗатрат = СтрокаДокумента.СубконтоРасходов1;
			ИначеЕсли СвойстваСчетаРасходов.ВидСубконто2 = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
				НоваяСтрока.ВидЗатрат = СтрокаДокумента.СубконтоРасходов2;
			ИначеЕсли СвойстваСчетаРасходов.ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
				НоваяСтрока.ВидЗатрат = СтрокаДокумента.СубконтоРасходов3;
			Иначе
				НоваяСтрока.ВидЗатрат = Справочники.ВидыЗатрат.ПустаяСсылка();
			КонецЕсли;
			
		КонецЦикла;
	
	ИначеЕсли МетаданныеДокумента.Имя = "АктПриемкиТоваровРаботУслуг" Тогда
		
		Параметры.Вставить("СинонимСписка", МетаданныеДокумента.ТабличныеЧасти.ТоварыРаботыУслуги.Синоним);
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ТоварыРаботыУслуги",
			"НомерСтроки,ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,
			|Номенклатура,КЭК,КоличествоПринято,СуммаПринято,СчетРасчетов,СинонимСписка",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""ТоварыРаботыУслуги"" КАК ИмяСписка,
		|	УслугиИРаботы.СинонимСписка КАК СинонимСписка,
		|	УслугиИРаботы.НомерСтроки КАК НомерСтроки,
		|	УслугиИРаботы.ИФО КАК ИФО,
		|	УслугиИРаботы.КФО КАК КФО,
		|	УслугиИРаботы.КПС КАК КПС,
		|	УслугиИРаботы.Подразделение КАК Подразделение,
		|	УслугиИРаботы.Контрагент КАК Контрагент,
		|	УслугиИРаботы.Договор КАК Договор,
		|	УслугиИРаботы.ВалютаДокумента КАК Валюта,
		|	ВЫРАЗИТЬ(УслугиИРаботы.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	УслугиИРаботы.КЭК КАК КЭК,
		|	УслугиИРаботы.СчетРасчетов КАК СчетРасчетов,
		|	УслугиИРаботы.КоличествоПринято КАК Количество,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДС,
		|	0 КАК СуммаНДС,
		|	УслугиИРаботы.СуммаПринято КАК Сумма
		|ИЗ
		|	ТаблицаТоварыРаботыУслуги КАК УслугиИРаботы
		|ГДЕ
		|	(УслугиИРаботы.Номенклатура ССЫЛКА Справочник.Номенклатура
		|				И ВЫРАЗИТЬ(УслугиИРаботы.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры В (&ТипыУслугРабот)
		|			ИЛИ УслугиИРаботы.Номенклатура ССЫЛКА Справочник.ДенежныеДокументы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		Запрос.УстановитьПараметр("ТипыУслугРабот", Перечисления.ТипыНоменклатуры.ПолучитьТипыУслугРабот());
		
		ПоступлениеУслугРабот = Запрос.Выполнить().Выгрузить();
		Для Каждого Строка Из ПоступлениеУслугРабот Цикл
			
			НоваяСтрока = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			Если Не ИспользоватьВалютныйУчет И Не ЗначениеЗаполнено(НоваяСтрока.Валюта) Тогда
				НоваяСтрока.Валюта = ВалютаРегламентированногоУчета;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли МетаданныеДокумента.Имя = "ПоступлениеУслугРабот" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "УслугиИРаботы",
			"НомерСтроки,ИФО,КФО,КПС,Подразделение,ПодразделениеЗатрат,Контрагент,Договор,Комитент,ДоговорКомитента,КомиссионнаяТорговля,ВалютаДокумента,НДСКРаспределению,
			|Номенклатура,Содержание,КЭК,ВидЗатрат,Количество,СтавкаНДС,СуммаНДС,Всего,ПринятьНДСКВычету,
			|ОтразитьВГрафикеИсполненияДоговора",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""УслугиИРаботы"" КАК ИмяСписка,
		|	""Услуги и работы"" КАК СинонимСписка,
		|	УслугиИРаботы.НомерСтроки КАК НомерСтроки,
		|	УслугиИРаботы.ИФО КАК ИФО,
		|	УслугиИРаботы.КФО КАК КФО,
		|	УслугиИРаботы.КПС КАК КПС,
		|	УслугиИРаботы.Подразделение КАК Подразделение,
		|	УслугиИРаботы.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	УслугиИРаботы.Контрагент КАК Контрагент,
		|	УслугиИРаботы.Договор КАК Договор,
		|	УслугиИРаботы.Комитент КАК Комитент,
		|	УслугиИРаботы.ДоговорКомитента КАК ДоговорКомитента,
		|	УслугиИРаботы.КомиссионнаяТорговля КАК КомиссионнаяТорговля,
		|	УслугиИРаботы.ОтразитьВГрафикеИсполненияДоговора КАК ОтразитьВГрафикеИсполненияДоговора,
		|	УслугиИРаботы.ВалютаДокумента КАК Валюта,
		|	УслугиИРаботы.Номенклатура КАК Номенклатура,
		|	УслугиИРаботы.Содержание КАК Содержание,
		|	УслугиИРаботы.КЭК КАК КЭК,
		|	УслугиИРаботы.ВидЗатрат КАК ВидЗатрат,
		|	УслугиИРаботы.Количество КАК Количество,
		|	УслугиИРаботы.СтавкаНДС КАК СтавкаНДС,
		|	УслугиИРаботы.СуммаНДС КАК СуммаНДС,
		|	УслугиИРаботы.НДСКРаспределению КАК НДСКРаспределению,
		|	УслугиИРаботы.ПринятьНДСКВычету КАК ПринятьНДСКВычету,
		|	УслугиИРаботы.Всего КАК Сумма
		|ИЗ
		|	ТаблицаУслугиИРаботы КАК УслугиИРаботы
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		СчетРасчетов = УчетРасчетов.ОпределитьСчетРасчетовПоПараметрам(Параметры, "Поступление",
			Документ.Дата, Документ.Организация, Документ.ИФО);
		// При поступлении нужно анализировать переданный групповой счет, чтобы понимать
		// это от поставщика или подотчетника
		СчетРасчетовИзПараметров = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры,
			"СчетРасчетов",
			ПланыСчетов.ЕПСБУ.ПустаяСсылка());
		ЭтоСчет208 = ЗначениеЗаполнено(СчетРасчетовИзПараметров)
			И БухгалтерскийУчет.СчетВИерархии(СчетРасчетовИзПараметров, "208.00");
		
		ПоступлениеУслугРабот = Запрос.Выполнить().Выгрузить();
		Для Каждого Строка Из ПоступлениеУслугРабот Цикл
			
			НоваяСтрока = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			Если Не ИспользоватьВалютныйУчет И Не ЗначениеЗаполнено(НоваяСтрока.Валюта) Тогда
				НоваяСтрока.Валюта = ВалютаРегламентированногоУчета;
			КонецЕсли;
			
			Если Не ЭтоСчет208 И ЗначениеЗаполнено(СчетРасчетов) Тогда
				НоваяСтрока.СчетРасчетов = СчетРасчетов;
			Иначе
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					Строка.КЭК,
					?(ЭтоСчет208, "208.00", "302.00"), ,
					Документ.Дата, Документ.Организация, Строка.ИФО);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе // ПоступлениеУслугРаботПоСчетамЗатрат
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "УслугиИРаботы",
			"НомерСтроки,ИФО,КФО,КПС,Подразделение,ПодразделениеЗатрат,Контрагент,Договор,ВалютаДокумента,НДСКРаспределению,
			|Номенклатура,Содержание,КЭК,ВидЗатрат,Количество,СтавкаНДС,СуммаНДС,Всего,ПринятьНДСКВычету,
			|ОтразитьВГрафикеИсполненияДоговора",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""УслугиИРаботы"" КАК ИмяСписка,
		|	""Услуги и работы"" КАК СинонимСписка,
		|	УслугиИРаботы.НомерСтроки КАК НомерСтроки,
		|	УслугиИРаботы.ИФО КАК ИФО,
		|	УслугиИРаботы.КФО КАК КФО,
		|	УслугиИРаботы.КПС КАК КПС,
		|	УслугиИРаботы.Подразделение КАК Подразделение,
		|	УслугиИРаботы.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
		|	УслугиИРаботы.Контрагент КАК Контрагент,
		|	УслугиИРаботы.Договор КАК Договор,
		|	УслугиИРаботы.ОтразитьВГрафикеИсполненияДоговора КАК ОтразитьВГрафикеИсполненияДоговора,
		|	УслугиИРаботы.ВалютаДокумента КАК Валюта,
		|	УслугиИРаботы.Номенклатура КАК Номенклатура,
		|	УслугиИРаботы.Содержание КАК Содержание,
		|	УслугиИРаботы.КЭК КАК КЭК,
		|	УслугиИРаботы.ВидЗатрат КАК ВидЗатрат,
		|	УслугиИРаботы.Количество КАК Количество,
		|	УслугиИРаботы.СтавкаНДС КАК СтавкаНДС,
		|	УслугиИРаботы.СуммаНДС КАК СуммаНДС,
		|	УслугиИРаботы.НДСКРаспределению КАК НДСКРаспределению,
		|	УслугиИРаботы.ПринятьНДСКВычету КАК ПринятьНДСКВычету,
		|	УслугиИРаботы.Всего КАК Сумма
		|ИЗ
		|	ТаблицаУслугиИРаботы КАК УслугиИРаботы
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		СчетРасчетов = УчетРасчетов.ОпределитьСчетРасчетовПоПараметрам(Параметры, "Поступление",
			Документ.Дата, Документ.Организация, Документ.ИФО);
		// При поступлении нужно анализировать переданный групповой счет, чтобы понимать
		// это от поставщика или подотчетника
		СчетРасчетовИзПараметров = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры,
			"СчетРасчетов",
			ПланыСчетов.ЕПСБУ.ПустаяСсылка());
		ЭтоСчет208 = ЗначениеЗаполнено(СчетРасчетовИзПараметров)
			И БухгалтерскийУчет.СчетВИерархии(СчетРасчетовИзПараметров, "208.00");
		
		ПоступлениеУслугРабот = Запрос.Выполнить().Выгрузить();
		Для Каждого Строка Из ПоступлениеУслугРабот Цикл
			
			НоваяСтрока = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			Если Не ИспользоватьВалютныйУчет И Не ЗначениеЗаполнено(НоваяСтрока.Валюта) Тогда
				НоваяСтрока.Валюта = ВалютаРегламентированногоУчета;
			КонецЕсли;
			
			Если Не ЭтоСчет208 И ЗначениеЗаполнено(СчетРасчетов) Тогда
				НоваяСтрока.СчетРасчетов = СчетРасчетов;
			Иначе
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					Строка.КЭК,
					?(ЭтоСчет208, "208.00", "302.00"), ,
					Документ.Дата, Документ.Организация, Строка.ИФО);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаДокумента;
	
КонецФункции

// Услуги сторонних организаций.

// Структура таблицы источника данных "Поступление услуг, работ".
//
Функция ПустаяТаблицаПоступлениеУслугРабот() Экспорт

	ОписаниеТиповСубконто  = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета услуг, работ.
	ПустаяТаблица.Колонки.Добавить("Номенклатура",        Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПустаяТаблица.Колонки.Добавить("Содержание",          Новый ОписаниеТипов("Строка"));
	ПустаяТаблица.Колонки.Добавить("КЭК",                 Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("ВидЗатрат",           Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
	ПустаяТаблица.Колонки.Добавить("ПодразделениеЗатрат", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Поставщик.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",         Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",           Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",              Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("Комитент",             Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("ДоговорКомитента",     Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("КомиссионнаяТорговля", Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("Валюта",               Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Количество и стоимость услуг, работ.
	ПустаяТаблица.Колонки.Добавить("Количество",    ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("СтавкаНДС",     Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ПустаяТаблица.Колонки.Добавить("СуммаНДСВал",   ОписаниеТипаСуммы); // Сумма НДС в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",   ОписаниеТипаСуммы); // Сумма НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаВал",      ОписаниеТипаСуммы); // Сумма с НДС в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",      ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	
	// Дополнительные колонки.
	ПустаяТаблица.Колонки.Добавить("ОтражениеВУСН",     Новый ОписаниеТипов("ПеречислениеСсылка.ОтражениеВУСН"));
	ПустаяТаблица.Колонки.Добавить("НДСКРаспределению", Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("ПринятьНДСКВычету", Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("НДСКРаспределениюРезерв", Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("ПринятьНДСКВычетуРезерв", Новый ОписаниеТипов("Булево"));
	
	// Контроль исполнения договоров.
	ПустаяТаблица.Колонки.Добавить("ОтразитьВГрафикеИсполненияДоговора",
		Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыДокументовКонтрольИсполненияДоговоров"));
	
	Возврат ПустаяТаблица;

КонецФункции

// Формирует таблицу источника данных "Поступление услуг, работ".
//
Функция ТаблицаПоступлениеУслугРабот(ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов=Неопределено, Реквизиты, Отказ,
		Знач ТаблицаПоступление = Неопределено) Экспорт
	
	Если ТаблицаПоступление = Неопределено Тогда
		ТаблицаПоступление = ПустаяТаблицаПоступлениеУслугРабот();
	КонецЕсли;
	Если ТаблицаДокумента.Количество() = 0 Тогда
		Возврат ТаблицаПоступление;
	КонецЕсли;
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	УчетРасчетов.РассчитатьСуммыРуб(ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты);
	
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		СтрокаПоступление = ТаблицаПоступление.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоступление, СтрокаДокумента);
		
		СтрокаПоступление.СуммаВал    = СтрокаДокумента.Сумма;
		СтрокаПоступление.СуммаНДСВал = СтрокаДокумента.СуммаНДС;
		
	КонецЦикла;
	
	Возврат ТаблицаПоступление;
	
КонецФункции

// Структура таблицы источника данных "Поступление услуг, работ (резерв)".
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Пустая таблица поступление услуг работ резерв:
// * ИмяСписка - Строка 
// * СинонимСписка - Строка
// * НомерСтроки - Число
// * ИФО - СправочникСсылка.ИсточникиФинансовогоОбеспечения - 
// * КФО - ПеречислениеСсылка.КВД - 
// * КПС - СправочникСсылка.КлассификационныеПризнакиСчетов - 
// * Подразделение - СправочникСсылка.Подразделения - 
// * Номенклатура - СправочникСсылка.Номенклатура - 
// * Содержание - Строка - 
// * КЭК - СправочникСсылка.КОСГУ - 
// * ВидЗатрат - СправочникСсылка.ВидыЗатрат - 
// * ПодразделениеЗатрат - СправочникСсылка.Подразделения - 
// * СчетЗатрат - ПланСчетовСсылка.ЕПСБУ 
// * СубконтоЗатрат1 - Характеристика.ВидыСубконто 
// * СубконтоЗатрат2 - Характеристика.ВидыСубконто 
// * СубконтоЗатрат3 - Характеристика.ВидыСубконто
// * ОтражатьВНалоговомУчете - Булево 
// * СчетЗатратНУ - ПланСчетовСсылка.ЕПСБУ 
// * СубконтоЗатратНУ1 - Характеристика.ВидыСубконто 
// * СубконтоЗатратНУ2 - Характеристика.ВидыСубконто 
// * СубконтоЗатратНУ3 - Характеристика.ВидыСубконто 
// * СчетРасчетов - ПланСчетовСсылка.ЕПСБУ - 
// * Контрагент - СправочникСсылка.Контрагенты - 
// * Договор - СправочникСсылка.Договоры - 
// * Валюта - СправочникСсылка.Валюты - 
// * Количество - Число
// * СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - 
// * СуммаНДСВал - Число
// * СуммаНДСРуб - Число
// * СуммаВал - Число
// * СуммаРуб - Число
// * ОтражениеВУСН - ПеречислениеСсылка.ОтражениеВУСН - 
// * НДСКРаспределению - Булево - 
// * ПринятьНДСКВычету - Булево - 
// * НДСКРаспределениюРезерв - Булево - 
// * ПринятьНДСКВычетуРезерв - Булево - 
// * ОтразитьВГрафикеИсполненияДоговора - ПеречислениеСсылка.СтатусыДокументовКонтрольИсполненияДоговоров - 
Функция ПустаяТаблицаПоступлениеУслугРаботПоСчетамЗатрат() Экспорт

	ОписаниеТиповСубконто  = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	
	ПустаяТаблица = ПустаяТаблицаПоступлениеУслугРабот();
	
	// Счет и аналитика учета услуг, работ.
	ПустаяТаблица.Колонки.Добавить("СчетЗатрат", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СубконтоЗатрат1", ОписаниеТиповСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоЗатрат2", ОписаниеТиповСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоЗатрат3", ОписаниеТиповСубконто);
	
	ПустаяТаблица.Колонки.Добавить("ОтражатьВНалоговомУчете", Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("СчетЗатратНУ", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СубконтоЗатратНУ1", ОписаниеТиповСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоЗатратНУ2", ОписаниеТиповСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоЗатратНУ3", ОписаниеТиповСубконто);
	
	Возврат ПустаяТаблица;

КонецФункции

// Структура таблицы источника данных "Поступление услуг, работ (резерв)".
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Пустая таблица поступление услуг работ резерв:
// * ИмяСписка - Строка 
// * СинонимСписка - Строка
// * НомерСтроки - Число
// * ИФО - СправочникСсылка.ИсточникиФинансовогоОбеспечения - 
// * КФО - ПеречислениеСсылка.КВД - 
// * КПС - СправочникСсылка.КлассификационныеПризнакиСчетов - 
// * Подразделение - СправочникСсылка.Подразделения - 
// * Номенклатура - СправочникСсылка.Номенклатура - 
// * Содержание - Строка - 
// * КЭК - СправочникСсылка.КОСГУ - 
// * ВидЗатрат - СправочникСсылка.ВидыЗатрат - 
// * ПодразделениеЗатрат - СправочникСсылка.Подразделения - 
// * СубконтоЗатрат1 - Характеристика.ВидыСубконто 
// * СубконтоЗатрат2 - Характеристика.ВидыСубконто 
// * СубконтоЗатрат3 - Характеристика.ВидыСубконто 
// * СчетРасчетов - ПланСчетовСсылка.ЕПСБУ - 
// * Контрагент - СправочникСсылка.Контрагенты - 
// * Договор - СправочникСсылка.Договоры - 
// * Валюта - СправочникСсылка.Валюты - 
// * Количество - Число
// * СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - 
// * СуммаНДСВал - Число
// * СуммаНДСРуб - Число
// * СуммаВал - Число
// * СуммаРуб - Число
// * СуммаНДСВалРезерв - Число
// * СуммаНДСРубРезерв - Число
// * СуммаВалРезерв - Число
// * СуммаРубРезерв - Число
// * ОтражениеВУСН - ПеречислениеСсылка.ОтражениеВУСН - 
// * НДСКРаспределению - Булево - 
// * ПринятьНДСКВычету - Булево - 
// * НДСКРаспределениюРезерв - Булево - 
// * ПринятьНДСКВычетуРезерв - Булево - 
// * ОтразитьВГрафикеИсполненияДоговора - ПеречислениеСсылка.СтатусыДокументовКонтрольИсполненияДоговоров - 
Функция ПустаяТаблицаПоступлениеУслугРаботРезерв() Экспорт

	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	ПустаяТаблица = ПустаяТаблицаПоступлениеУслугРаботПоСчетамЗатрат();
	
	// Количество и стоимость услуг, работ.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСВалРезерв", ОписаниеТипаСуммы); // Сумма НДС резерва в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРубРезерв", ОписаниеТипаСуммы); // Сумма НДС резерва в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаВалРезерв", ОписаниеТипаСуммы); // Сумма резерва с НДС в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СуммаРубРезерв", ОписаниеТипаСуммы); // Сумма резерва с НДС в рублях.
	
	Возврат ПустаяТаблица;

КонецФункции

// Формирует таблицу источника данных "Поступление услуг, работ".
// 
// Параметры:
//  ТаблицаДокумента Таблица документа
//  ТаблицаРасчетовСЗачетомАвансов - Неопределено - Таблица расчетов с зачетом авансов
//  Реквизиты - Структура
//  Отказ - Булево
// 
// Возвращаемое значение:
//  см. ПустаяТаблицаПоступлениеУслугРаботРезерв 
Функция ТаблицаПоступлениеУслугРаботРезерв(ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов=Неопределено, Реквизиты, Отказ) Экспорт
	
	ТаблицаПоступление = ПустаяТаблицаПоступлениеУслугРаботРезерв();
	Если ТаблицаДокумента.Количество() = 0 Тогда
		Возврат ТаблицаПоступление;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
//	РассчитатьСуммыРуб(ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты);
	
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		СтрокаПоступление = ТаблицаПоступление.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПоступление, СтрокаДокумента);
		
		СтрокаПоступление.СуммаРуб    = СтрокаДокумента.Сумма;
		СтрокаПоступление.СуммаНДСРуб = СтрокаДокумента.СуммаНДС;
		СтрокаПоступление.СуммаРубРезерв = СтрокаДокумента.СуммаРезерв;
		СтрокаПоступление.СуммаНДСРубРезерв = СтрокаДокумента.СуммаНДСРезерв;
		СтрокаПоступление.СуммаВал    = СтрокаДокумента.Сумма;
		СтрокаПоступление.СуммаНДСВал = СтрокаДокумента.СуммаНДС;
		СтрокаПоступление.СуммаВалРезерв = СтрокаДокумента.СуммаРезерв;
		СтрокаПоступление.СуммаНДСВалРезерв = СтрокаДокумента.СуммаНДСРезерв;
		
	КонецЦикла;
	
	Возврат ТаблицаПоступление;
	
КонецФункции

// Дополнительные расходы, включаемые в стоимость материальных запасов.

// Структура таблицы источника данных "Поступление доп. расходов".
//
Функция ПустаяТаблицаПоступлениеДопРасходов() Экспорт

	ОписаниеТиповСубконто  = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета услуг, работ.
	ПустаяТаблица.Колонки.Добавить("Номенклатура",        Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПустаяТаблица.Колонки.Добавить("Содержание",          Новый ОписаниеТипов("Строка"));
	ПустаяТаблица.Колонки.Добавить("КЭК",                 Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("ВидЗатрат",           Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
	
	// Счет и аналитика учета вложений в НФА.
	ПустаяТаблица.Колонки.Добавить("СчетВложений",          Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("ПартияВложений",        ПланыВидовХарактеристик.ВидыСубконто.Партии.ТипЗначения);
	ПустаяТаблица.Колонки.Добавить("КПСВложений",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("ПодразделениеВложений", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ПустаяТаблица.Колонки.Добавить("ЦМОВложений",           Новый ОписаниеТипов("СправочникСсылка.ЦМО"));
	ПустаяТаблица.Колонки.Добавить("НоменклатураВложений",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПустаяТаблица.Колонки.Добавить("ОсновноеСредствоВложений",  Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	
	// Поставщик.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Количество и стоимость услуг, работ.
	ПустаяТаблица.Колонки.Добавить("Количество",    ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("СтавкаНДС",     Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ПустаяТаблица.Колонки.Добавить("СуммаНДСВал",   ОписаниеТипаСуммы); // Сумма НДС в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",   ОписаниеТипаСуммы); // Сумма НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаВал",      ОписаниеТипаСуммы); // Сумма с НДС в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",      ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	
	// Дополнительные колонки.
	ПустаяТаблица.Колонки.Добавить("НДСКРаспределению", Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("ПринятьНДСКВычету", Новый ОписаниеТипов("Булево"));
	
	// Контроль исполнения договоров.
	ПустаяТаблица.Колонки.Добавить("ОтразитьВГрафикеИсполненияДоговора",
		Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыДокументовКонтрольИсполненияДоговоров"));
	
	Возврат ПустаяТаблица;

КонецФункции

// Формирует таблицу источника данных "Поступление доп. расходов".
//
Функция ТаблицаПоступлениеДопРасходов(ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов=Неопределено, Реквизиты, Отказ) Экспорт
	
	ТаблицаПоступление = ПустаяТаблицаПоступлениеДопРасходов();
	Если ТаблицаДокумента.Количество() = 0 Тогда
		Возврат ТаблицаПоступление;
	КонецЕсли;
	Если НЕ Реквизиты.Свойство("ПартияВложений")
	 ИЛИ НЕ Реквизиты.Свойство("СчетВложений")
	 	И ТипЗнч(Реквизиты.ПартияВложений) <> Тип("ДокументСсылка.ПоступлениеОС")
	 ИЛИ НЕ Реквизиты.Свойство("БазаРаспределения") Тогда
		Возврат ТаблицаПоступление;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	РассчитатьСуммыРуб(ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты);
	
	// Подготовим таблицу базы распределения доп. расходов
	// по остаткам вложений, по указанной партии материальных запасов.
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		Новый Граница(Реквизиты.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Если ТипЗнч(Реквизиты.ПартияВложений) = Тип("ДокументСсылка.ПоступлениеОС") Тогда
		БазаРаспределения = УправлениеОсновнымиСредствами.БазаРаспределенияРасходовНаСоставПартии(
			Реквизиты.ПартияВложений, Реквизиты.БазаРаспределения);
		ИмяКолонкиПоступления = "ОсновноеСредствоВложений";
		ИмяКолонкиРаспределения = "ВнеоборотныйАктив";
	Иначе
		БазаРаспределения = УправлениеМатериальнымиЗапасами.СформироватьБазуРаспределенияРасходовНаПартию(
			ПериодОстатков, Реквизиты.ПартияВложений, Реквизиты.БазаРаспределения, Реквизиты.СчетВложений);
		ИмяКолонкиПоступления = "НоменклатураВложений";
		ИмяКолонкиРаспределения = "Номенклатура";
	КонецЕсли;
	
	Если БазаРаспределения.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru='Не обнаружено остатков вложений на счете ""%1"" по указанной партии ""%2"".'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
			Реквизиты.СчетВложений,
			Реквизиты.ПартияВложений);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Реквизиты.Ссылка,,, Отказ);
		Возврат ТаблицаПоступление;
	КонецЕсли;
	
	КоэффициентыРаспределения = БазаРаспределения.ВыгрузитьКолонку("БазаРаспределения");
	
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		// Распределяем сумму услуг на все вложения по данной партии.
		МассивСуммВал = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаДокумента.Сумма,
			КоэффициентыРаспределения);
		МассивСуммРуб = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаДокумента.СуммаРуб,
			КоэффициентыРаспределения);
		МассивСуммНДСВал = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаДокумента.СуммаНДС,
			КоэффициентыРаспределения);
		МассивСуммНДСРуб = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаДокумента.СуммаНДСРуб,
			КоэффициентыРаспределения);
		
		Для Инд = 0 По БазаРаспределения.Количество() - 1 Цикл
			
			СтрокаРаспределения = БазаРаспределения[Инд];
			
			СтрокаПоступление = ТаблицаПоступление.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПоступление, СтрокаДокумента);
			
			СтрокаПоступление.КФО = СтрокаДокумента.КФО;
			
			Если ЗначениеЗаполнено(СтрокаРаспределения.СчетВложений) Тогда
				СтрокаПоступление.СчетВложений      = СтрокаРаспределения.СчетВложений;
			Иначе
				СтрокаПоступление.СчетВложений      = Реквизиты.СчетВложений;
			КонецЕсли;
			СтрокаПоступление.ПартияВложений        = Реквизиты.ПартияВложений;
			СтрокаПоступление.КПСВложений           = СтрокаРаспределения.КПС;
			СтрокаПоступление.ПодразделениеВложений = СтрокаРаспределения.Подразделение;
			СтрокаПоступление.ЦМОВложений           = СтрокаРаспределения.ЦМО;
			СтрокаПоступление[ИмяКолонкиПоступления]  = СтрокаРаспределения[ИмяКолонкиРаспределения];
			
			СтрокаПоступление.СуммаРуб    = ?(МассивСуммРуб = Неопределено,    0, МассивСуммРуб[Инд]);
			СтрокаПоступление.СуммаВал    = ?(МассивСуммВал = Неопределено,    0, МассивСуммВал[Инд]);
			СтрокаПоступление.СуммаНДСРуб = ?(МассивСуммНДСРуб = Неопределено, 0, МассивСуммНДСРуб[Инд]);
			СтрокаПоступление.СуммаНДСВал = ?(МассивСуммНДСВал = Неопределено, 0, МассивСуммНДСВал[Инд]);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаПоступление;
	
КонецФункции

// Услуги оказанные

Функция ПустаяТаблицаРеализацияУслугРаботПоДокументу() Экспорт
	
	ОписаниеТипаСуммы        = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества   = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	ОписаниеТиповСубконто    = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТиповВидСубконто = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто");
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("КЭК",           Новый ОписаниеТипов("СправочникСсылка.КОСГУ")); // 120, 130, 180.
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Номенклатура, содержание оказанных услуг.
	ПустаяТаблица.Колонки.Добавить("Номенклатура",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПустаяТаблица.Колонки.Добавить("Содержание",    ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(254));
	// Покупатель.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	// Аналитика доходов БУ и НУ.
	ПустаяТаблица.Колонки.Добавить("КодЦели",               Новый ОписаниеТипов("СправочникСсылка.ВидыЦелевыхСредств"));
	ПустаяТаблица.Колонки.Добавить("ВидОперацииДБП",        Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийНачисленияДБП"));
	ПустаяТаблица.Колонки.Добавить("СчетДБП",               Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СчетДоходов",           Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СубконтоДоходов1" ,     Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	ПустаяТаблица.Колонки.Добавить("СубконтоДоходов2" ,     Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	ПустаяТаблица.Колонки.Добавить("СубконтоДоходов3" ,     Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	ПустаяТаблица.Колонки.Добавить("ВидДеятельностиНУ",     Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДеятельностиДляНалоговогоУчетаЗатрат"));
	ПустаяТаблица.Колонки.Добавить("СчетДоходовНУ",         Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СтатьяПрочихДоходовНУ", Новый ОписаниеТипов("СправочникСсылка.ПрочиеДоходыИРасходы"));
	// Контроль исполнения договоров.
	ПустаяТаблица.Колонки.Добавить("ОтразитьВГрафикеИсполненияДоговора",
		Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыДокументовКонтрольИсполненияДоговоров"));
	// Количественные и суммовые характеристики.
	ПустаяТаблица.Колонки.Добавить("Количество",    ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("Сумма",         ОписаниеТипаСуммы); // Сумма с НДС в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СтавкаНДС",     Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ПустаяТаблица.Колонки.Добавить("СуммаНДС",      ОписаниеТипаСуммы); // Сумма НДС в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СуммаРубПоКурсуДБП", ОписаниеТипаСуммы); // Сумма в рублях по курсу доходов будущих периодов, определяемому по остатку 401.4х.
	
	ПустаяТаблица.Колонки.Добавить("КомиссионнаяТорговля", Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("Комитент",             Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("ДоговорКомитента",     Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	
	Возврат ПустаяТаблица;
	
КонецФункции

// Услуги оказанные

// Подготавливает таблицу документа (в унифицированном формате) для учета реализации услуг, работ.
//
Функция ПодготовитьТаблицуРеализацияУслугРаботПоДокументу(Документ, Параметры = Неопределено) Экспорт
	
	ТаблицаДокумента = ПустаяТаблицаРеализацияУслугРаботПоДокументу();
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	Если НЕ Параметры.Свойство("КЭК") Тогда
		Если Параметры.Свойство("КЭКРасчетов") И ЗначениеЗаполнено(Параметры.КЭКРасчетов) Тогда
			Параметры.Вставить("КЭК", Параметры.КЭКРасчетов);
		Иначе
			Параметры.Вставить("КЭК", Справочники.КОСГУ.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
	Если НЕ Параметры.Свойство("ОтразитьВГрафикеИсполненияДоговора") Тогда
		// Если в документе, таб.части и типовой операции нет реквизита ОтразитьВГрафикеИсполненияДоговора,
		// по умолчанию будем отражать в графике исполнения договора.
		Параметры.Вставить("ОтразитьВГрафикеИсполненияДоговора",
			Перечисления.СтатусыДокументовКонтрольИсполненияДоговоров.ОтразитьСейчас);
	КонецЕсли;
	
	МетаданныеДокумента = Документ.Метаданные();
	Если МетаданныеДокумента.Имя = "НачислениеЗаУслугиОбразования" Тогда
		Возврат Документы.НачислениеЗаУслугиОбразования.ПодготовитьТаблицуРеализацияУслугРаботПоДокументу(Документ, Параметры);
	ИначеЕсли МетаданныеДокумента.Имя = "НачислениеСтудентамЗаПрочиеУслуги" Тогда
		Возврат Документы.НачислениеСтудентамЗаПрочиеУслуги.ПодготовитьТаблицуРеализацияУслугРаботПоДокументу(Документ, Параметры);
	ИначеЕсли МетаданныеДокумента.Имя = "СписаниеДоходовБудущихПериодов" Тогда
		Возврат Документы.СписаниеДоходовБудущихПериодов.ПодготовитьТаблицуРеализацияУслугРаботПоДокументу(Документ, Параметры);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ЕстьТабЧастьУслугиОказанные  = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("УслугиОказанные", МетаданныеДокумента);
	ЕстьТабЧастьСоставЭтапаРабот = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("СоставЭтапаРабот", МетаданныеДокумента);
	ЕстьТабЧастьНачисления       = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("Начисления", МетаданныеДокумента);
	
	Если ЕстьТабЧастьУслугиОказанные Тогда
		
		Если НЕ Параметры.Свойство("СчетДоходов") Тогда
			Параметры.Вставить("СчетДоходов", ПланыСчетов.ЕПСБУ.ПустаяСсылка());
		КонецЕсли;
		Если НЕ Параметры.Свойство("СубконтоДоходов1") Тогда
			Параметры.Вставить("СубконтоДоходов1", "");
		КонецЕсли;
		Если НЕ Параметры.Свойство("СубконтоДоходов2") Тогда
			Параметры.Вставить("СубконтоДоходов2", "");
		КонецЕсли;
		Если НЕ Параметры.Свойство("СубконтоДоходов3") Тогда
			Параметры.Вставить("СубконтоДоходов3", "");
		КонецЕсли;
		Если НЕ Параметры.Свойство("ВидДеятельностиНУ") Тогда
			Параметры.Вставить("ВидДеятельностиНУ", Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ПустаяСсылка());
		КонецЕсли;
		Если НЕ Параметры.Свойство("СчетДоходовНУ") Тогда
			Параметры.Вставить("СчетДоходовНУ", ПланыСчетов.ЕПСБУ.ПустаяСсылка());
		КонецЕсли;
		Если НЕ Параметры.Свойство("СтатьяПрочихДоходовНУ") Тогда
			Параметры.Вставить("СтатьяПрочихДоходовНУ", Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка());
		КонецЕсли;
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "УслугиОказанные",
			"НомерСтроки,ИФО,КФО,КПС,КЭК,Подразделение,Контрагент,Договор,ВалютаДокумента,
			|Номенклатура,СодержаниеУслуги,Количество,Сумма,Всего,СтавкаНДС,КомиссионнаяТорговля,Комитент,ДоговорКомитента,СуммаНДС,
			|СчетДоходов,СубконтоДоходов1,СубконтоДоходов2,СубконтоДоходов3,ВидДеятельностиНУ,СчетДоходовНУ,СтатьяПрочихДоходовНУ,
			|ОтразитьВГрафикеИсполненияДоговора",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""УслугиОказанные"" КАК ИмяСписка,
		|	""Услуги"" КАК СинонимСписка,
		|	УслугиОказанные.НомерСтроки КАК НомерСтроки,
		|	УслугиОказанные.ИФО КАК ИФО,
		|	УслугиОказанные.КФО КАК КФО,
		|	УслугиОказанные.КПС КАК КПС,
		|	УслугиОказанные.КЭК КАК КЭК,
		|	УслугиОказанные.Подразделение КАК Подразделение,
		|	УслугиОказанные.Номенклатура КАК Номенклатура,
		|	УслугиОказанные.СодержаниеУслуги КАК Содержание,
		|	УслугиОказанные.Контрагент КАК Контрагент,
		|	УслугиОказанные.Договор КАК Договор,
		|	УслугиОказанные.СчетДоходов КАК СчетДоходов,
		|	УслугиОказанные.СубконтоДоходов1 КАК СубконтоДоходов1,
		|	УслугиОказанные.СубконтоДоходов2 КАК СубконтоДоходов2,
		|	УслугиОказанные.СубконтоДоходов3 КАК СубконтоДоходов3,
		|	УслугиОказанные.ВидДеятельностиНУ КАК ВидДеятельностиНУ,
		|	УслугиОказанные.СчетДоходовНУ КАК СчетДоходовНУ,
		|	УслугиОказанные.СтатьяПрочихДоходовНУ КАК СтатьяПрочихДоходовНУ,
		|	УслугиОказанные.ОтразитьВГрафикеИсполненияДоговора КАК ОтразитьВГрафикеИсполненияДоговора,
		|	УслугиОказанные.ВалютаДокумента КАК Валюта,
		|	УслугиОказанные.Количество КАК Количество,
		|	УслугиОказанные.Всего КАК Сумма,
		|	УслугиОказанные.СтавкаНДС КАК СтавкаНДС,
		|	УслугиОказанные.КомиссионнаяТорговля КАК КомиссионнаяТорговля,
		|	УслугиОказанные.Комитент КАК Комитент,
		|	УслугиОказанные.ДоговорКомитента КАК ДоговорКомитента,
		|	УслугиОказанные.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	ТаблицаУслугиОказанные КАК УслугиОказанные
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	ИначеЕсли ЕстьТабЧастьСоставЭтапаРабот Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "СоставЭтапаРабот",
			"НомерСтроки,ИФО,КФО,КПС,КЭК,Подразделение,Контрагент,Договор,ВалютаДокумента,
			|Номенклатура,Содержание,Количество,Сумма,Всего,СтавкаНДС,СуммаНДС,
			|СчетДБП,ВидДеятельностиНУ,СчетДоходовНУ,
			|ОтразитьВГрафикеИсполненияДоговора",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""СоставЭтапаРабот"" КАК ИмяСписка,
		|	""Состав этапа работ"" КАК СинонимСписка,
		|	СоставЭтапаРабот.НомерСтроки КАК НомерСтроки,
		|	СоставЭтапаРабот.ИФО КАК ИФО,
		|	СоставЭтапаРабот.КФО КАК КФО,
		|	СоставЭтапаРабот.КПС КАК КПС,
		|	СоставЭтапаРабот.КЭК КАК КЭК,
		|	СоставЭтапаРабот.Подразделение КАК Подразделение,
		|	СоставЭтапаРабот.Номенклатура КАК Номенклатура,
		|	СоставЭтапаРабот.Содержание КАК Содержание,
		|	СоставЭтапаРабот.Контрагент КАК Контрагент,
		|	СоставЭтапаРабот.Договор КАК Договор,
		|	СоставЭтапаРабот.СчетДБП КАК СчетДБП,
		|	НЕОПРЕДЕЛЕНО КАК СчетДоходов,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДоходов1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДоходов2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДоходов3,
		|	СоставЭтапаРабот.ВидДеятельностиНУ КАК ВидДеятельностиНУ,
		|	СоставЭтапаРабот.СчетДоходовНУ КАК СчетДоходовНУ,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяПрочихДоходовНУ,
		|	СоставЭтапаРабот.ОтразитьВГрафикеИсполненияДоговора КАК ОтразитьВГрафикеИсполненияДоговора,
		|	СоставЭтапаРабот.ВалютаДокумента КАК Валюта,
		|	СоставЭтапаРабот.Количество КАК Количество,
		|	СоставЭтапаРабот.Всего КАК Сумма,
		|	СоставЭтапаРабот.СтавкаНДС КАК СтавкаНДС,
		|	СоставЭтапаРабот.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	ТаблицаСоставЭтапаРабот КАК СоставЭтапаРабот
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	ИначеЕсли ЕстьТабЧастьНачисления Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Начисления",
			"НомерСтроки,ИФО,КФО,КПС,КЭК,Подразделение,Контрагент,ДоговорКонтрагента,ВалютаДокумента,
			|Номенклатура,Количество,Сумма,СтавкаНДС,СуммаНДС,УчитыватьНДС,СуммаВключаетНДС,
			|СчетДоходов,СубконтоДоходов1,СубконтоДоходов2,СубконтоДоходов3,ВидДеятельностиНУ,СчетДоходовНУ,СтатьяПрочихДоходовНУ,
			|ОтразитьВГрафикеИсполненияДоговора",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""Начисления"" КАК ИмяСписка,
		|	""Начисления"" КАК СинонимСписка,
		|	Начисления.НомерСтроки КАК НомерСтроки,
		|	Начисления.ИФО КАК ИФО,
		|	Начисления.КФО КАК КФО,
		|	Начисления.КПС КАК КПС,
		|	Начисления.КЭК КАК КЭК,
		|	Начисления.Подразделение КАК Подразделение,
		|	Начисления.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(Начисления.Номенклатура КАК Справочник.Номенклатура).НаименованиеПолное КАК СТРОКА(254)) КАК Содержание,
		|	Начисления.Контрагент КАК Контрагент,
		|	Начисления.ДоговорКонтрагента КАК Договор,
		|	Начисления.СчетДоходов КАК СчетДоходов,
		|	Начисления.СубконтоДоходов1 КАК СубконтоДоходов1,
		|	Начисления.СубконтоДоходов2 КАК СубконтоДоходов2,
		|	Начисления.СубконтоДоходов3 КАК СубконтоДоходов3,
		|	Начисления.ВидДеятельностиНУ КАК ВидДеятельностиНУ,
		|	Начисления.СчетДоходовНУ КАК СчетДоходовНУ,
		|	Начисления.СтатьяПрочихДоходовНУ КАК СтатьяПрочихДоходовНУ,
		|	Начисления.ОтразитьВГрафикеИсполненияДоговора КАК ОтразитьВГрафикеИсполненияДоговора,
		|	Начисления.ВалютаДокумента КАК Валюта,
		|	Начисления.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА Начисления.УчитыватьНДС
		|				И НЕ Начисления.СуммаВключаетНДС
		|			ТОГДА Начисления.Сумма + Начисления.СуммаНДС
		|		ИНАЧЕ Начисления.Сумма
		|	КОНЕЦ КАК Сумма,
		|	Начисления.СтавкаНДС КАК СтавкаНДС,
		|	Начисления.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	ТаблицаНачисления КАК Начисления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		
	КонецЕсли;
	
	РеализацияУслугРабот = Запрос.Выполнить().Выгрузить();
	
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	// Счет расчетов.
	СчетРасчетов = УчетРасчетов.ОпределитьСчетРасчетовПоПараметрам(Параметры, "Реализация",
		Документ.Дата, Документ.Организация, Документ.ИФО);
	
	Для Каждого Строка Из РеализацияУслугРабот Цикл
		
		НоваяСтрока = ТаблицаДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Не ИспользоватьВалютныйУчет И Не ЗначениеЗаполнено(НоваяСтрока.Валюта) Тогда
			НоваяСтрока.Валюта = ВалютаРегламентированногоУчета;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СчетРасчетов) Тогда
			НоваяСтрока.СчетРасчетов = СчетРасчетов;
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.КЭК) Тогда
			НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(НоваяСтрока.КЭК,
				?(Параметры.Свойство("СчетРасчетов") И ЗначениеЗаполнено(Параметры.СчетРасчетов), Параметры.СчетРасчетов, "205.00"), ,
				Документ.Дата, Документ.Организация, Строка.ИФО);
		Иначе // По умолчанию - 205.31.
			НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("205.31", Документ.Дата, Документ.Организация);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.КЭК) Тогда
			НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(НоваяСтрока.СчетРасчетов);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДокумента;
	
КонецФункции

// Структура таблицы источника данных "Реализация услуг, работ".
//
Функция ПустаяТаблицаРеализацияУслугРабот() Экспорт

	ОписаниеТиповСубконто  = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("КЭК",           Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Номенклатура, содержание оказанных услуг.
	ПустаяТаблица.Колонки.Добавить("Номенклатура",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПустаяТаблица.Колонки.Добавить("Содержание",    ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(254));
	// Покупатель.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	// Аналитика доходов БУ и НУ.
	ПустаяТаблица.Колонки.Добавить("КодЦели",               Новый ОписаниеТипов("СправочникСсылка.ВидыЦелевыхСредств"));
	ПустаяТаблица.Колонки.Добавить("ВидОперацииДБП",        Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийНачисленияДБП"));
	ПустаяТаблица.Колонки.Добавить("СчетДБП",               Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СчетДоходов",           Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СубконтоДоходов1" ,     Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	ПустаяТаблица.Колонки.Добавить("СубконтоДоходов2" ,     Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	ПустаяТаблица.Колонки.Добавить("СубконтоДоходов3" ,     Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	ПустаяТаблица.Колонки.Добавить("ВидДеятельностиНУ",     Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДеятельностиДляНалоговогоУчетаЗатрат"));
	ПустаяТаблица.Колонки.Добавить("СчетДоходовНУ",         Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СтатьяПрочихДоходовНУ", Новый ОписаниеТипов("СправочникСсылка.ПрочиеДоходыИРасходы"));
	// Количественные и суммовые характеристики.
	ПустаяТаблица.Колонки.Добавить("Количество",    ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("СтавкаНДС",     Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ПустаяТаблица.Колонки.Добавить("СуммаВал",      ОписаниеТипаСуммы); // Сумма с НДС в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСВал",   ОписаниеТипаСуммы); // Сумма НДС в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",      ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",   ОписаниеТипаСуммы); // Сумма НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаРубПоКурсуДБП", ОписаниеТипаСуммы); // Сумма в рублях по курсу доходов будущих периодов (401.4х).
	//Комиссионная торговля
	ПустаяТаблица.Колонки.Добавить("КомиссионнаяТорговля", Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("Комитент",             Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("ДоговорКомитента",     Новый ОписаниеТипов("СправочникСсылка.Договоры"));

	// Контроль исполнения договоров.
	ПустаяТаблица.Колонки.Добавить("ОтразитьВГрафикеИсполненияДоговора",
		Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыДокументовКонтрольИсполненияДоговоров"));
	
	Возврат ПустаяТаблица;

КонецФункции

// Формирует таблицу источника данных "Реализация услуг, работ".
//
Функция ТаблицаРеализацияУслугРабот(ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов=Неопределено, Реквизиты, Отказ) Экспорт
	
	ТаблицаРеализация = ПустаяТаблицаРеализацияУслугРабот();
	Если ТаблицаДокумента.Количество() = 0 Тогда
		Возврат ТаблицаРеализация;
	КонецЕсли;
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	УчетРасчетов.РассчитатьСуммыРуб(ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты);
	
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		СтрокаСписание = ТаблицаРеализация.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСписание, СтрокаДокумента);
		
		СтрокаСписание.СуммаВал    = СтрокаДокумента.Сумма;
		СтрокаСписание.СуммаНДСВал = СтрокаДокумента.СуммаНДС;
		
	КонецЦикла;
	
	Возврат ТаблицаРеализация;
	
КонецФункции

#КонецОбласти

#Область ГТДИмпорт

// Структура таблицы источника данных "Таможенные платежи по материальным запасам" (сборы, пошлины, НДС).
//
Функция ПустаяТаблицаТаможенныеПлатежиПоМатериальнымЗапасам() Экспорт

	ОписаниеТиповСубконто  = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета вложений в материальные запасы.
	ПустаяТаблица.Колонки.Добавить("СчетВложений",          Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("КПСВложений",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("ПодразделениеВложений", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ПустаяТаблица.Колонки.Добавить("НоменклатураВложений",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПустаяТаблица.Колонки.Добавить("ВидЗатратВложений",     Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
	ПустаяТаблица.Колонки.Добавить("ПартияВложений",
		Метаданные.Документы.ГТДИмпорт.ТабличныеЧасти.Материалы.Реквизиты.ДокументПартии.Тип);
	
	// Расчеты с таможней.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Учет НДС.
	ПустаяТаблица.Колонки.Добавить("СчетНДС",     Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СтавкаНДС",   Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ПустаяТаблица.Колонки.Добавить("СуммаНДС",    ОписаниеТипаСуммы); // Сумма НДС в валюте.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСВал", ОписаниеТипаСуммы); // Сумма НДС в валюте.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб", ОписаниеТипаСуммы); // Сумма НДС в рублях.
	
	// Суммы таможенных платежей.
	ПустаяТаблица.Колонки.Добавить("Сумма",       ОписаниеТипаСуммы); // Сумма с НДС в валюте.
	ПустаяТаблица.Колонки.Добавить("СуммаВал",    ОписаниеТипаСуммы); // Сумма с НДС в валюте.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",    ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	
	// Дополнительные колонки.
	ПустаяТаблица.Колонки.Добавить("ВидТаможенныхПлатежей", Новый ОписаниеТипов("Строка"));
	ПустаяТаблица.Колонки.Добавить("Содержание",            Новый ОписаниеТипов("Строка"));
	
	Возврат ПустаяТаблица;

КонецФункции

// Структура таблицы источника данных "Таможенные платежи по внеоборотным активам" (сборы, пошлины, НДС).
//
Функция ПустаяТаблицаТаможенныеПлатежиПоВнеоборотнымАктивам() Экспорт

	ОписаниеТиповСубконто  = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета внеоборотных активов.
	ПустаяТаблица.Колонки.Добавить("СчетВложений",          Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("КПСВложений",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("ПодразделениеВложений", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ПустаяТаблица.Колонки.Добавить("ВнеоборотныйАктив",     Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ПустаяТаблица.Колонки.Добавить("ВидЗатрат",             Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
	ПустаяТаблица.Колонки.Добавить("ДокументПартии",
		Метаданные.Документы.ГТДИмпорт.ТабличныеЧасти.ОсновныеСредства.Реквизиты.ДокументПартии.Тип);
	
	// Расчеты с таможней.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Учет НДС.
	ПустаяТаблица.Колонки.Добавить("СчетНДС",     Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("СтавкаНДС",   Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ПустаяТаблица.Колонки.Добавить("СуммаНДС",    ОписаниеТипаСуммы); // Сумма НДС в валюте.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСВал", ОписаниеТипаСуммы); // Сумма НДС в валюте.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб", ОписаниеТипаСуммы); // Сумма НДС в рублях.
	
	// Суммы таможенных платежей.
	ПустаяТаблица.Колонки.Добавить("Сумма",       ОписаниеТипаСуммы); // Сумма с НДС в валюте.
	ПустаяТаблица.Колонки.Добавить("СуммаВал",    ОписаниеТипаСуммы); // Сумма с НДС в валюте.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",    ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	
	// Дополнительные колонки.
	ПустаяТаблица.Колонки.Добавить("ВидТаможенныхПлатежей", Новый ОписаниеТипов("Строка"));
	ПустаяТаблица.Колонки.Добавить("Содержание",            Новый ОписаниеТипов("Строка"));
	
	Возврат ПустаяТаблица;

КонецФункции

// Структура таблицы источника данных "Таможенные штрафы".
//
Функция ПустаяТаблицаТаможенныеШтрафы() Экспорт

	ОписаниеТиповСубконто  = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Расчеты с таможней.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Сумма штрафов.
	ПустаяТаблица.Колонки.Добавить("Сумма",         ОписаниеТипаСуммы); // Сумма с НДС в валюте.
	ПустаяТаблица.Колонки.Добавить("СуммаВал",      ОписаниеТипаСуммы); // Сумма с НДС в валюте.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",      ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	
	// Дополнительные колонки.
	ПустаяТаблица.Колонки.Добавить("Содержание",    Новый ОписаниеТипов("Строка"));
	
	Возврат ПустаяТаблица;

КонецФункции

// Подготавливает таблицу таможенных платежей (сборы, пошлины, НДС), связанных с приобретением материальных запасов,
// по документу "Таможенная декларация по импорту" (ГТДИмпорт).
//
Функция ПодготовитьТаблицуТаможенныеПлатежиПоМатериальнымЗапасамПоДокументу(Документ, Параметры = Неопределено, Отказ) Экспорт
	
	ТаблицаДокумента = УчетРасчетов.ПустаяТаблицаТаможенныеПлатежиПоМатериальнымЗапасам();
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Если Документ.УчитыватьНДС Тогда
		
		Если НЕ ЗначениеЗаполнено(Документ.СчетРасчетовНДС) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru = 'Счет расчетов по НДС'"));
			БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.СчетРасчетовНДС", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Документ.КПССчетРасчетовНДС) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru = 'КПС счета расчетов по НДС'"));
			БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.КПССчетРасчетовНДС", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	НомераТаблиц = Новый Структура;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Разделы",
		"НомерСтроки,СтавкаНДС,НДСВВалюте,ПошлинаВВалюте",
		Документ, Параметры, "НомерСтроки");
	НомераТаблиц.Вставить("ТаблицаРазделы", НомераТаблиц.Количество());
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Материалы",
		"ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,НомерРаздела,
		|НомерСтроки,СчетВложений,НФА,ДокументПартии,ВидЗатрат,ФактурнаяСтоимость,
		|УчитыватьНДС,СчетРасчетовНДС,КПССчетРасчетовНДС,СчетНДС,СуммаНДС,
		|СчетРасчетов,СуммаПошлины",
		Документ, Параметры, "НомерРаздела");
	НомераТаблиц.Вставить("ТаблицаМатериалы", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	""Материалы"" КАК ИмяСписка,
	|	""Материалы"" КАК СинонимСписка,
	|	Материалы.НомерСтроки КАК НомерСтроки,
	|	Материалы.ИФО КАК ИФО,
	|	Материалы.КФО КАК КФО,
	|	Материалы.КПС КАК КПС,
	|	Материалы.Подразделение КАК Подразделение,
	|	Материалы.СчетРасчетов КАК СчетРасчетов,
	|	Материалы.Контрагент КАК Контрагент,
	|	Материалы.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.ПошлинаВВалюте, ЛОЖЬ)
	|			ТОГДА Материалы.ВалютаДокумента
	|		ИНАЧЕ &ВалютаРеглУчета
	|	КОНЕЦ КАК Валюта,
	|	Материалы.СчетВложений КАК СчетВложений,
	|	Материалы.КПС КАК КПСВложений,
	|	Материалы.Подразделение КАК ПодразделениеВложений,
	|	Материалы.НФА КАК НоменклатураВложений,
	|	Материалы.ДокументПартии КАК ПартияВложений,
	|	Материалы.ВидЗатрат КАК ВидЗатратВложений,
	|	ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка) КАК СчетНДС,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	0 КАК СуммаНДСРуб,
	|	Материалы.СуммаПошлины КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.ПошлинаВВалюте, ЛОЖЬ)
	|			ТОГДА Материалы.СуммаПошлины * &КурсДокумента
	|		ИНАЧЕ Материалы.СуммаПошлины
	|	КОНЕЦ КАК СуммаРуб,
	|	""Пошлина"" КАК ВидТаможенныхПлатежей
	|ИЗ
	|	ТаблицаМатериалы КАК Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРазделы КАК Разделы
	|		ПО Материалы.НомерРаздела = Разделы.НомерСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Материалы"",
	|	""Материалы"",
	|	Материалы.НомерСтроки,
	|	Материалы.ИФО,
	|	Материалы.КФО,
	|	Материалы.КПССчетРасчетовНДС,
	|	Материалы.Подразделение,
	|	Материалы.СчетРасчетовНДС,
	|	Материалы.Контрагент,
	|	Материалы.Договор,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.НДСВВалюте, ЛОЖЬ)
	|			ТОГДА Материалы.ВалютаДокумента
	|		ИНАЧЕ &ВалютаРеглУчета
	|	КОНЕЦ,
	|	Материалы.СчетВложений,
	|	Материалы.КПС,
	|	Материалы.Подразделение,
	|	Материалы.НФА,
	|	Материалы.ДокументПартии,
	|	Материалы.ВидЗатрат,
	|	Материалы.СчетНДС,
	|	ЕСТЬNULL(Разделы.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)),
	|	Материалы.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.НДСВВалюте, ЛОЖЬ)
	|			ТОГДА Материалы.СуммаНДС * &КурсДокумента
	|		ИНАЧЕ Материалы.СуммаНДС
	|	КОНЕЦ,
	|	Материалы.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.НДСВВалюте, ЛОЖЬ)
	|			ТОГДА Материалы.СуммаНДС * &КурсДокумента
	|		ИНАЧЕ Материалы.СуммаНДС
	|	КОНЕЦ,
	|	""НДС""
	|ИЗ
	|	ТаблицаМатериалы КАК Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРазделы КАК Разделы
	|		ПО Материалы.НомерРаздела = Разделы.НомерСтроки";
	//|ГДЕ
	//|	Материалы.УчитыватьНДС";
	НомераТаблиц.Вставить("ТаможенныеПошлиныИНДС", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	""Материалы"" КАК ИмяСписка,
	|	""Материалы"" КАК СинонимСписка,
	|	Материалы.НомерСтроки КАК НомерСтроки,
	|	Материалы.ИФО КАК ИФО,
	|	Материалы.КФО КАК КФО,
	|	Материалы.КПС КАК КПС,
	|	Материалы.Подразделение КАК Подразделение,
	|	Материалы.СчетРасчетов КАК СчетРасчетов,
	|	Материалы.Контрагент КАК Контрагент,
	|	Материалы.Договор КАК Договор,
	|	Материалы.СчетВложений КАК СчетВложений,
	|	Материалы.КПС КАК КПСВложений,
	|	Материалы.Подразделение КАК ПодразделениеВложений,
	|	Материалы.НФА КАК НоменклатураВложений,
	|	Материалы.ДокументПартии КАК ПартияВложений,
	|	Материалы.ВидЗатрат КАК ВидЗатратВложений,
	|	Материалы.ФактурнаяСтоимость КАК ФактурнаяСтоимость,
	|	0 КАК ТаможенныйСбор,
	|	0 КАК ТаможенныйСборВал,
	|	""Сбор"" КАК ВидТаможенныхПлатежей
	|ИЗ
	|	ТаблицаМатериалы КАК Материалы";
	НомераТаблиц.Вставить("ТаможенныеСборы", НомераТаблиц.Количество());
	
	ВалютаРегламентированногоУчета = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
	КурсДокумента = Документ.Курс / ?(Документ.Кратность = 0, 1, Документ.Кратность);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("КурсДокумента",   КурсДокумента);
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Добавляем таможенные пошлины и НДС.
	ТаможенныеПошлиныИНДС = Результат[НомераТаблиц.ТаможенныеПошлиныИНДС].Выгрузить();
	Для Каждого Строка Из ТаможенныеПошлиныИНДС Цикл
		
		НоваяСтрока = ТаблицаДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.ВидТаможенныхПлатежей = "Пошлина" Тогда
			
			НоваяСтрока.Содержание = НСтр("ru='Таможенная пошлина'");
			
		ИначеЕсли Строка.ВидТаможенныхПлатежей = "НДС" Тогда
			
			НоваяСтрока.Содержание = НСтр("ru='НДС, уплаченный таможенным органам'");
			
			Если НЕ ЗначениеЗаполнено(Строка.СчетНДС) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Счет НДС'"),
					Строка.НомерСтроки, Строка.СинонимСписка);
				ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].СчетНДС";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Таможенный сбор (в рублях и в валюте) распределим по строкам таблиц "Материалы" и "Основные средства"
	// пропорционально фактурной стоимости.
	ТаможенныеСборы = Результат[НомераТаблиц.ТаможенныеСборы].Выгрузить();
	
	БазаРаспределения = Новый Массив;
	БазаРаспределения.Добавить(Документ.Материалы.Итог("ФактурнаяСтоимость"));
	БазаРаспределения.Добавить(Документ.ОсновныеСредства.Итог("ФактурнаяСтоимость"));
	
	Если Документ.ТаможенныйСбор > 0 Тогда
		
		РаспределениеТаможенныйСбор = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			Документ.ТаможенныйСбор, БазаРаспределения); // Распределяем между материалами и основными средствами.
		
		Если РаспределениеТаможенныйСбор <> Неопределено Тогда
			ТаможенныйСборПоМатериалам = РаспределениеТаможенныйСбор[0];
			ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ТаможенныйСборПоМатериалам,
				ТаможенныеСборы, "ТаможенныйСбор", "ФактурнаяСтоимость"); // Распределяем по фактурной стоимости.
		Иначе
			ТекстСообщения = НСтр("ru='Невозможно распределить таможенный сбор по объектам приобретенных активов.
				|Не указана фактурная стоимость приобретенных материалов, основных средств.'");
			БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.ТаможенныйСбор", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Документ.ТаможенныйСборВал > 0 Тогда
		
		РаспределениеТаможенныйСборВал = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			Документ.ТаможенныйСборВал, БазаРаспределения); // Распределяем между материалами и основными средствами.
		
		Если РаспределениеТаможенныйСборВал <> Неопределено Тогда
			ТаможенныйСборВалПоМатериалам = РаспределениеТаможенныйСборВал[0];
			ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ТаможенныйСборВалПоМатериалам,
				ТаможенныеСборы, "ТаможенныйСборВал", "ФактурнаяСтоимость"); // Распределяем по фактурной стоимости.
		Иначе
			ТекстСообщения = НСтр("ru='Невозможно распределить таможенный сбор (в валюте) по объектам приобретенных активов.
				|Не указана фактурная стоимость приобретенных материалов, основных средств.'");
			БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.ТаможенныйСборВал", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// Добавляем таможенный сбор.
	Для Каждого Строка Из ТаможенныеСборы Цикл
		
		Если Строка.ТаможенныйСбор > 0 Тогда
			
			НоваяСтрока = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			НоваяСтрока.Валюта   = ВалютаРегламентированногоУчета;
			НоваяСтрока.Сумма    = Строка.ТаможенныйСбор;
			НоваяСтрока.СуммаВал = Строка.ТаможенныйСбор;
			НоваяСтрока.СуммаРуб = Строка.ТаможенныйСбор;
			
			НоваяСтрока.Содержание = НСтр("ru='Таможенный сбор'");
			
		КонецЕсли;
		
		Если Строка.ТаможенныйСборВал > 0 Тогда
			
			НоваяСтрока = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			НоваяСтрока.Валюта   = Документ.ВалютаДокумента;
			НоваяСтрока.Сумма    = Строка.ТаможенныйСборВал;
			НоваяСтрока.СуммаВал = Строка.ТаможенныйСборВал;
			НоваяСтрока.СуммаРуб = Строка.ТаможенныйСборВал * КурсДокумента;
			
			НоваяСтрока.Содержание = НСтр("ru='Таможенный сбор (в валюте)'");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДокумента;
	
КонецФункции

// Подготавливает таблицу таможенных платежей (сборы, пошлины, НДС), связанных с приобретением внеоборотных активов,
// по документу "Таможенная декларация по импорту" (ГТДИмпорт).
//
Функция ПодготовитьТаблицуТаможенныеПлатежиПоВнеоборотнымАктивамПоДокументу(Документ, Параметры = Неопределено, Отказ) Экспорт
	
	ТаблицаДокумента = УчетРасчетов.ПустаяТаблицаТаможенныеПлатежиПоВнеоборотнымАктивам();
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Если Документ.УчитыватьНДС Тогда
		
		Если НЕ ЗначениеЗаполнено(Документ.СчетРасчетовНДС) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru = 'Счет расчетов по НДС'"));
			БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.СчетРасчетовНДС", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Документ.КПССчетРасчетовНДС) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru = 'КПС счета расчетов по НДС'"));
			БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.КПССчетРасчетовНДС", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	НомераТаблиц = Новый Структура;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Разделы",
		"НомерСтроки,СтавкаНДС,НДСВВалюте,ПошлинаВВалюте",
		Документ, Параметры, "НомерСтроки");
	НомераТаблиц.Вставить("ТаблицаРазделы", НомераТаблиц.Количество());
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ОсновныеСредства",
		"ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ВалютаДокумента,НомерРаздела,
		|НомерСтроки,СчетВложений,НФА,ДокументПартии,ВидЗатрат,ФактурнаяСтоимость,
		|УчитыватьНДС,СчетРасчетовНДС,КПССчетРасчетовНДС,СчетНДС,СуммаНДС,
		|СчетРасчетов,СуммаПошлины",
		Документ, Параметры, "НомерРаздела");
	НомераТаблиц.Вставить("ТаблицаМатериалы", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	""ОсновныеСредства"" КАК ИмяСписка,
	|	""Основные средства"" КАК СинонимСписка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ИФО КАК ИФО,
	|	ОсновныеСредства.КФО КАК КФО,
	|	ОсновныеСредства.КПС КАК КПС,
	|	ОсновныеСредства.Подразделение КАК Подразделение,
	|	ОсновныеСредства.СчетРасчетов КАК СчетРасчетов,
	|	ОсновныеСредства.Контрагент КАК Контрагент,
	|	ОсновныеСредства.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.ПошлинаВВалюте, ЛОЖЬ)
	|			ТОГДА ОсновныеСредства.ВалютаДокумента
	|		ИНАЧЕ &ВалютаРеглУчета
	|	КОНЕЦ КАК Валюта,
	|	ОсновныеСредства.СчетВложений КАК СчетВложений,
	|	ОсновныеСредства.КПС КАК КПСВложений,
	|	ОсновныеСредства.Подразделение КАК ПодразделениеВложений,
	|	ОсновныеСредства.НФА КАК ВнеоборотныйАктив,
	|	ОсновныеСредства.ДокументПартии КАК ДокументПартии,
	|	ОсновныеСредства.ВидЗатрат КАК ВидЗатрат,
	|	ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка) КАК СчетНДС,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	0 КАК СуммаНДСРуб,
	|	ОсновныеСредства.СуммаПошлины КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.ПошлинаВВалюте, ЛОЖЬ)
	|			ТОГДА ОсновныеСредства.СуммаПошлины * &КурсДокумента
	|		ИНАЧЕ ОсновныеСредства.СуммаПошлины
	|	КОНЕЦ КАК СуммаРуб,
	|	""Пошлина"" КАК ВидТаможенныхПлатежей
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРазделы КАК Разделы
	|		ПО ОсновныеСредства.НомерРаздела = Разделы.НомерСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ОсновныеСредства"",
	|	""Основные средства"",
	|	ОсновныеСредства.НомерСтроки,
	|	ОсновныеСредства.ИФО,
	|	ОсновныеСредства.КФО,
	|	ОсновныеСредства.КПССчетРасчетовНДС,
	|	ОсновныеСредства.Подразделение,
	|	ОсновныеСредства.СчетРасчетовНДС,
	|	ОсновныеСредства.Контрагент,
	|	ОсновныеСредства.Договор,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.НДСВВалюте, ЛОЖЬ)
	|			ТОГДА ОсновныеСредства.ВалютаДокумента
	|		ИНАЧЕ &ВалютаРеглУчета
	|	КОНЕЦ,
	|	ОсновныеСредства.СчетВложений,
	|	ОсновныеСредства.КПС,
	|	ОсновныеСредства.Подразделение,
	|	ОсновныеСредства.НФА,
	|	ОсновныеСредства.ДокументПартии,
	|	ОсновныеСредства.ВидЗатрат,
	|	ОсновныеСредства.СчетНДС,
	|	ЕСТЬNULL(Разделы.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)),
	|	ОсновныеСредства.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.НДСВВалюте, ЛОЖЬ)
	|			ТОГДА ОсновныеСредства.СуммаНДС * &КурсДокумента
	|		ИНАЧЕ ОсновныеСредства.СуммаНДС
	|	КОНЕЦ,
	|	ОсновныеСредства.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Разделы.НДСВВалюте, ЛОЖЬ)
	|			ТОГДА ОсновныеСредства.СуммаНДС * &КурсДокумента
	|		ИНАЧЕ ОсновныеСредства.СуммаНДС
	|	КОНЕЦ,
	|	""НДС""
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРазделы КАК Разделы
	|		ПО ОсновныеСредства.НомерРаздела = Разделы.НомерСтроки";
	//|ГДЕ
	//|	ОсновныеСредства.УчитыватьНДС";
	НомераТаблиц.Вставить("ТаможенныеПошлиныИНДС", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	""ОсновныеСредства"" КАК ИмяСписка,
	|	""Основные средства"" КАК СинонимСписка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ИФО КАК ИФО,
	|	ОсновныеСредства.КФО КАК КФО,
	|	ОсновныеСредства.КПС КАК КПС,
	|	ОсновныеСредства.Подразделение КАК Подразделение,
	|	ОсновныеСредства.СчетРасчетов КАК СчетРасчетов,
	|	ОсновныеСредства.Контрагент КАК Контрагент,
	|	ОсновныеСредства.Договор КАК Договор,
	|	ОсновныеСредства.СчетВложений КАК СчетВложений,
	|	ОсновныеСредства.КПС КАК КПСВложений,
	|	ОсновныеСредства.Подразделение КАК ПодразделениеВложений,
	|	ОсновныеСредства.НФА КАК ВнеоборотныйАктив,
	|	ОсновныеСредства.ДокументПартии КАК ДокументПартии,
	|	ОсновныеСредства.ВидЗатрат КАК ВидЗатрат,
	|	ОсновныеСредства.ФактурнаяСтоимость КАК ФактурнаяСтоимость,
	|	0 КАК ТаможенныйСбор,
	|	0 КАК ТаможенныйСборВал,
	|	""Сбор"" КАК ВидТаможенныхПлатежей
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ОсновныеСредства";
	НомераТаблиц.Вставить("ТаможенныеСборы", НомераТаблиц.Количество());
	
	ВалютаРегламентированногоУчета = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
	КурсДокумента = Документ.Курс / ?(Документ.Кратность = 0, 1, Документ.Кратность);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("КурсДокумента",   КурсДокумента);
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Добавляем таможенные пошлины и НДС.
	ТаможенныеПошлиныИНДС = Результат[НомераТаблиц.ТаможенныеПошлиныИНДС].Выгрузить();
	Для Каждого Строка Из ТаможенныеПошлиныИНДС Цикл
		
		НоваяСтрока = ТаблицаДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.ВидТаможенныхПлатежей = "Пошлина" Тогда
			
			НоваяСтрока.Содержание = НСтр("ru='Таможенная пошлина'");
			
		ИначеЕсли Строка.ВидТаможенныхПлатежей = "НДС" Тогда
			
			НоваяСтрока.Содержание = НСтр("ru='НДС, уплаченный таможенным органам'");
			
			Если НЕ ЗначениеЗаполнено(Строка.СчетНДС) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Счет НДС'"),
					Строка.НомерСтроки, Строка.СинонимСписка);
				ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].СчетНДС";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Таможенный сбор (в рублях и в валюте) распределим по строкам таблиц "Материалы" и "Основные средства"
	// пропорционально фактурной стоимости.
	ТаможенныеСборы = Результат[НомераТаблиц.ТаможенныеСборы].Выгрузить();
	
	БазаРаспределения = Новый Массив;
	БазаРаспределения.Добавить(Документ.ОсновныеСредства.Итог("ФактурнаяСтоимость"));
	БазаРаспределения.Добавить(Документ.Материалы.Итог("ФактурнаяСтоимость"));
	
	Если Документ.ТаможенныйСбор > 0 Тогда
		
		РаспределениеТаможенныйСбор = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			Документ.ТаможенныйСбор, БазаРаспределения); // Распределяем между материалами и основными средствами.
		
		Если РаспределениеТаможенныйСбор <> Неопределено Тогда
			ТаможенныйСборПоОсновнымСредствам = РаспределениеТаможенныйСбор[0];
			ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ТаможенныйСборПоОсновнымСредствам,
				ТаможенныеСборы, "ТаможенныйСбор", "ФактурнаяСтоимость"); // Распределяем по фактурной стоимости.
		Иначе
			ТекстСообщения = НСтр("ru='Невозможно распределить таможенный сбор по объектам приобретенных активов.
				|Не указана фактурная стоимость приобретенных материалов, основных средств.'");
			БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.ТаможенныйСбор", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Документ.ТаможенныйСборВал > 0 Тогда
		
		РаспределениеТаможенныйСборВал = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			Документ.ТаможенныйСборВал, БазаРаспределения); // Распределяем между материалами и основными средствами.
		
		Если РаспределениеТаможенныйСборВал <> Неопределено Тогда
			ТаможенныйСборВалПоОсновнымСредствам = РаспределениеТаможенныйСборВал[0];
			ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ТаможенныйСборВалПоОсновнымСредствам,
				ТаможенныеСборы, "ТаможенныйСборВал", "ФактурнаяСтоимость"); // Распределяем по фактурной стоимости.
		Иначе
			ТекстСообщения = НСтр("ru='Невозможно распределить таможенный сбор (в валюте) по объектам приобретенных активов.
				|Не указана фактурная стоимость приобретенных материалов, основных средств.'");
			БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, "Объект.ТаможенныйСборВал", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// Добавляем таможенный сбор.
	Для Каждого Строка Из ТаможенныеСборы Цикл
		
		Если Строка.ТаможенныйСбор > 0 Тогда
			
			НоваяСтрока = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			НоваяСтрока.Валюта   = ВалютаРегламентированногоУчета;
			НоваяСтрока.Сумма    = Строка.ТаможенныйСбор;
			НоваяСтрока.СуммаВал = Строка.ТаможенныйСбор;
			НоваяСтрока.СуммаРуб = Строка.ТаможенныйСбор;
			
			НоваяСтрока.Содержание = НСтр("ru='Таможенный сбор'");
			
		КонецЕсли;
		
		Если Строка.ТаможенныйСборВал > 0 Тогда
			
			НоваяСтрока = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			НоваяСтрока.Валюта   = Документ.ВалютаДокумента;
			НоваяСтрока.Сумма    = Строка.ТаможенныйСборВал;
			НоваяСтрока.СуммаВал = Строка.ТаможенныйСборВал;
			НоваяСтрока.СуммаРуб = Строка.ТаможенныйСборВал * КурсДокумента;
			
			НоваяСтрока.Содержание = НСтр("ru='Таможенный сбор (в валюте)'");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДокумента;
	
КонецФункции

// Подготавливает таблицу таможенных штрафов, включаемых в расходы организации,
// по документу "Таможенная декларация по импорту" (ГТДИмпорт).
//
Функция ПодготовитьТаблицуТаможенныеШтрафыПоДокументу(Документ, Параметры = Неопределено, Отказ) Экспорт
	
	ТаблицаДокумента = УчетРасчетов.ПустаяТаблицаТаможенныеШтрафы();
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Документ",
		"ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,ВалютаДокумента,
		|ТаможенныйШтраф,ТаможенныйШтрафВал",
		Документ, Параметры);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	ШтрафыРуб.ИФО КАК ИФО,
	|	ШтрафыРуб.КФО КАК КФО,
	|	ШтрафыРуб.КПС КАК КПС,
	|	ШтрафыРуб.Подразделение КАК Подразделение,
	|	ШтрафыРуб.СчетРасчетов КАК СчетРасчетов,
	|	ШтрафыРуб.Контрагент КАК Контрагент,
	|	ШтрафыРуб.Договор КАК Договор,
	|	&ВалютаРеглУчета КАК Валюта,
	|	ШтрафыРуб.ТаможенныйШтраф КАК Сумма,
	|	ШтрафыРуб.ТаможенныйШтраф КАК СуммаРуб
	|ИЗ
	|	Документ КАК ШтрафыРуб
	|ГДЕ
	|	ШтрафыРуб.ТаможенныйШтраф <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШтрафыВал.ИФО,
	|	ШтрафыВал.КФО,
	|	ШтрафыВал.КПС,
	|	ШтрафыВал.Подразделение,
	|	ШтрафыВал.СчетРасчетов,
	|	ШтрафыВал.Контрагент,
	|	ШтрафыВал.Договор,
	|	ШтрафыВал.ВалютаДокумента,
	|	ШтрафыВал.ТаможенныйШтрафВал,
	|	ШтрафыВал.ТаможенныйШтрафВал * &КурсДокумента
	|ИЗ
	|	Документ КАК ШтрафыВал
	|ГДЕ
	|	ШтрафыВал.ТаможенныйШтрафВал <> 0";
	
	ВалютаРегламентированногоУчета = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
	КурсДокумента = Документ.Курс / ?(Документ.Кратность = 0, 1, Документ.Кратность);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("КурсДокумента",   КурсДокумента);
	
	ТаможенныеШтрафы = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из ТаможенныеШтрафы Цикл
		
		НоваяСтрока = ТаблицаДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если НоваяСтрока.Валюта = ВалютаРегламентированногоУчета Тогда
			НоваяСтрока.Содержание = НСтр("ru='Таможенный штраф'");
		Иначе
			НоваяСтрока.Содержание = НСтр("ru='Таможенный штраф (в валюте)'");
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДокумента;
	
КонецФункции

// Подготавливает таблицу таможенных платежей для использования в качестве источника данных.
//
Функция ПодготовитьТаблицуТаможенныхПлатежей(ТаблицаТаможенныеПлатежи, ТаблицаРасчетовСЗачетомАвансов=Неопределено, Реквизиты, Отказ) Экспорт
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	Если ТаблицаРасчетовСЗачетомАвансов <> Неопределено Тогда
		УчетРасчетов.СкорректироватьСуммыРубПоКурсуАвансов(
			ТаблицаТаможенныеПлатежи, ТаблицаРасчетовСЗачетомАвансов, Реквизиты);
	КонецЕсли;
	
	ЕстьНДСВТаблице = (ТаблицаТаможенныеПлатежи.Колонки.Найти("СуммаНДС") <> Неопределено);
	Для Каждого СтрокаДокумента Из ТаблицаТаможенныеПлатежи Цикл
		
		СтрокаДокумента.СуммаВал = СтрокаДокумента.Сумма;
		
		Если ЕстьНДСВТаблице Тогда
			СтрокаДокумента.СуммаНДСВал = СтрокаДокумента.СуммаНДС;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаТаможенныеПлатежи;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция СрокиИсполненияИСуммыОбязательствПоДоговорам(СписокДоговоров, НаДату = Неопределено) Экспорт
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("НаДату", ?(ЗначениеЗаполнено(НаДату), КонецДня(НаДату), НаДату));
	ЗапросПоиск.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	ЗапросПоиск.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.Период КАК Период,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.Регистратор КАК Регистратор,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.Обязательство КАК Договор,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.НачалоДействия КАК НачалоДействия,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ОкончаниеДействия КАК ОкончаниеДействия,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.СрокИсполнения КАК СрокИсполнения,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ВалютаРасчетов КАК ВалютаРасчетов,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.Сумма КАК Сумма,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.СуммаВВалюте КАК СуммаВВалюте,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.АвансПроцентом КАК АвансПроцентом,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.СуммаАванса КАК СуммаАванса,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.КурсРасчетов КАК КурсРасчетов,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.КратностьРасчетов КАК КратностьРасчетов,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ПроцентПоЗайму КАК ПроцентПоЗайму,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.КазначейскоеСопровождение КАК КазначейскоеСопровождение,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ОплатаВРублях КАК ОплатаВРублях,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ВидОбязательства КАК ВидОбязательства,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ИФО КАК ИФО,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.ПервичныйДокумент КАК ПервичныйДокумент,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчета,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.СрокИсполнения КАК ОкончаниеДоговора,
	|	ВЫБОР
	|		КОГДА &НаДату = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ СрокиИсполненияИСуммыОбязательствСрезПоследних.СрокИсполнения <= &НаДату
	|	КОНЕЦ КАК ДоговорПросрочен
	|ИЗ
	|	РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(&НаДату, Обязательство В (&СписокДоговоров)) КАК СрокиИсполненияИСуммыОбязательствСрезПоследних";
	
	Возврат ЗапросПоиск.Выполнить().Выгрузить();
	
КонецФункции

Функция ДатаВозникновенияЗадолженности(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Договор,
	|	Договоры.ДатаДоговора КАК ДатаДоговора
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.Обязательство КАК Договор,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.НачалоДействия КАК НачалоДействия
	|ИЗ
	|	РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(
	|			,
	|			Обязательство = &Договор
	|				И НачалоДействия <> &ПустаяДата) КАК СрокиИсполненияИСуммыОбязательствСрезПоследних";
	
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаДоговоры = Результат[0].Выбрать();
	ВыборкаСрокиИсполненияИСуммыОбязательств = Результат[1].Выбрать();
	Если ВыборкаСрокиИсполненияИСуммыОбязательств.Следующий() Тогда
		// Если срок действия договора установлен документом "Регистрация обязательств и сведений по договорам",
		// дата возникновения задолженности определяется из реквизита "Срок действия - с" (группа реквизитов "Сроки договора (обязательства)").
		Возврат ВыборкаСрокиИсполненияИСуммыОбязательств.НачалоДействия;
	ИначеЕсли ВыборкаДоговоры.Следующий() Тогда
		// В противном случае дата возникновения задолженности соответствует дате договора – реквизит "Вид обязательства - от" справочника "Договоры".
		Возврат ВыборкаДоговоры.ДатаДоговора;
	КонецЕсли;
	
	Возврат Дата(1,1,1);
	
КонецФункции

Функция ДатыВозникновенияЗадолженности(Договоры) Экспорт
	
	ДатыВозникновенияЗадолженности = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Договоры", Договоры);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Договор,
	|	Договоры.ДатаДоговора КАК ДатаДоговора
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка В(&Договоры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.Обязательство КАК Договор,
	|	СрокиИсполненияИСуммыОбязательствСрезПоследних.НачалоДействия КАК НачалоДействия
	|ИЗ
	|	РегистрСведений.СрокиИсполненияИСуммыОбязательств.СрезПоследних(
	|			,
	|			Обязательство В (&Договоры)
	|				И НачалоДействия <> &ПустаяДата) КАК СрокиИсполненияИСуммыОбязательствСрезПоследних";
	
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаДоговоры = Результат[0].Выбрать();
	ВыборкаСрокиИсполненияИСуммыОбязательств = Результат[1].Выбрать();
	
	Пока ВыборкаСрокиИсполненияИСуммыОбязательств.Следующий() Цикл
		// Если срок действия договора установлен документом "Регистрация обязательств и сведений по договорам",
		// дата возникновения задолженности определяется из реквизита "Срок действия - с" (группа реквизитов "Сроки договора (обязательства)").
		ДатыВозникновенияЗадолженности.Вставить(ВыборкаСрокиИсполненияИСуммыОбязательств.Договор,
			ВыборкаСрокиИсполненияИСуммыОбязательств.НачалоДействия);
	КонецЦикла;
	
	Пока ВыборкаДоговоры.Следующий() Цикл
		Если ДатыВозникновенияЗадолженности.Получить(ВыборкаДоговоры.Договор) = Неопределено Тогда
			// В противном случае дата возникновения задолженности соответствует дате договора – реквизит "Вид обязательства - от" справочника "Договоры".
			ДатыВозникновенияЗадолженности.Вставить(ВыборкаДоговоры.Договор,
				ВыборкаДоговоры.ДатаДоговора);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДатыВозникновенияЗадолженности;
	
КонецФункции

Процедура РассчитатьСуммыРуб(ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты) Экспорт
	
	Если ТаблицаДокумента.Количество() = 0 Тогда
		Возврат; // Нечего корректировать.
	КонецЕсли;
	
	Если Реквизиты.Свойство("Курс") И Реквизиты.Свойство("Кратность") Тогда
		КурсДокумента = ?(Реквизиты.Курс = 0, 1, Реквизиты.Курс)
			/ ?(Реквизиты.Кратность = 0, 1, Реквизиты.Кратность);
	Иначе
		КурсДокумента = 1;
	КонецЕсли;
	
	// Рассчитаем рублевые суммы, если они не рассчитаны в исходной таблице документа.
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	// СуммаРуб
	Если ТаблицаДокумента.Колонки.Найти("Сумма") <> Неопределено
		И ТаблицаДокумента.Колонки.Найти("СуммаРуб") = Неопределено Тогда
		
		ТаблицаДокумента.Колонки.Добавить("СуммаРуб", ОписаниеТипаСуммы);
		
		// Откат исправления ошибки 00-00269317. Неправильно брать итог по таблице расчетов
		// при агентском НДС и при отрицательных суммах в акте об оказании услуг.
		//Если ТаблицаРасчетовСЗачетомАвансов = Неопределено Тогда
			ИтогСуммаРуб = Окр(ТаблицаДокумента.Итог("Сумма") * КурсДокумента, 2);
		//Иначе
		//	ИтогСуммаРуб = ТаблицаРасчетовСЗачетомАвансов.Итог("СуммаРуб");
		//КонецЕсли;
		
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ИтогСуммаРуб, ТаблицаДокумента, "СуммаРуб", "Сумма");
		
	КонецЕсли;
	
	// СуммаНДСРуб
	Если ТаблицаДокумента.Колонки.Найти("СуммаНДС") <> Неопределено
		И ТаблицаДокумента.Колонки.Найти("СуммаНДСРуб") = Неопределено Тогда
		
		ТаблицаДокумента.Колонки.Добавить("СуммаНДСРуб", ОписаниеТипаСуммы);
		
		ИтогСуммаНДСРуб = Окр(ТаблицаДокумента.Итог("СуммаНДС") * КурсДокумента, 2);
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ИтогСуммаНДСРуб, ТаблицаДокумента, "СуммаНДСРуб", "СуммаНДС");
		
	КонецЕсли;
	
	УчетРасчетов.СкорректироватьСуммыРубПоКурсуАвансов(ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты);
	
КонецПроцедуры

Процедура СкорректироватьСуммыРубПоКурсуАвансов(ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты) Экспорт
	
	Если ТаблицаДокумента.Количество() = 0 Тогда
		Возврат; // Нечего корректировать.
	КонецЕсли;
	
	Если ТаблицаРасчетовСЗачетомАвансов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ТаблицаДокумента.Колонки.Добавить("КорректировкаДоКурсаАванса",    ОписаниеТипаСуммы);
	ТаблицаДокумента.Колонки.Добавить("КорректировкаДоКурсаАвансаНДС", ОписаниеТипаСуммы);
	
	ЕстьСчетРасчетовВТаблице = (ТаблицаДокумента.Колонки.Найти("СчетРасчетов") <> Неопределено);
	ЕстьКПСРасчетовВТаблице  = (ТаблицаДокумента.Колонки.Найти("КПСРасчетов") <> Неопределено);
	ЕстьКонтрагентВТаблице   = (ТаблицаДокумента.Колонки.Найти("Контрагент") <> Неопределено);
	ЕстьДоговорВТаблице      = (ТаблицаДокумента.Колонки.Найти("Договор") <> Неопределено);
	ЕстьНДСВТаблице          = (ТаблицаДокумента.Колонки.Найти("СуммаНДСРуб") <> Неопределено);
	
	Для Каждого СтрокаРасчетов Из ТаблицаРасчетовСЗачетомАвансов Цикл
		
		Если НЕ СтрокаРасчетов.РасчетыВВалюте Тогда
			Продолжить; // Нет валютных авансов.
		КонецЕсли;
		
		СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасчетов.СчетРасчетов);
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("КФО", СтрокаРасчетов.КФО);
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			ОтборСтрок.Вставить("ИФО", СтрокаРасчетов.ИФО);
		КонецЕсли;
		Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
			ОтборСтрок.Вставить("КПС", СтрокаРасчетов.КПС);
		КонецЕсли;
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
			ОтборСтрок.Вставить("Подразделение", СтрокаРасчетов.Подразделение);
		КонецЕсли;
		Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
			ОтборСтрок.Вставить("Валюта", СтрокаРасчетов.Валюта);
		КонецЕсли;
		Если ЕстьСчетРасчетовВТаблице Тогда
			ОтборСтрок.Вставить("СчетРасчетов", СтрокаРасчетов.СчетРасчетов);
		КонецЕсли;
		Если ЕстьКонтрагентВТаблице Тогда
			ОтборСтрок.Вставить("Контрагент", СтрокаРасчетов.Контрагент);
		КонецЕсли;
		Если ЕстьДоговорВТаблице Тогда
			ОтборСтрок.Вставить("Договор", СтрокаРасчетов.Договор);
		КонецЕсли;
		
		ОбщаяСуммаРасчетов = ТаблицаРасчетовСЗачетомАвансов.Скопировать(ОтборСтрок).Итог("СуммаРасчетов");
		Если ОбщаяСуммаРасчетов = 0
		 ИЛИ СтрокаРасчетов.СуммаРасчетов = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СвойстваСчетаРасчетов.УчетПоКПС И ЕстьКПСРасчетовВТаблице Тогда
			// КПС расчетов в отдельной колонке "КПСРасчетов".
			ОтборСтрок.Удалить("КПС");
			ОтборСтрок.Вставить("КПСРасчетов", СтрокаРасчетов.КПС);
		КонецЕсли;
		
		СтрокиДокумента     = ТаблицаДокумента.НайтиСтроки(ОтборСтрок);
		КопияСтрокДокумента = ТаблицаДокумента.Скопировать(ОтборСтрок);
		
		// Если в документе несколько табличных частей, которые влияют на расчеты с контрагентами,
		// то сумму корректировки нужно распределить по всем этим табличным частям.
		СуммаРасчетовПоСтрокам = ?(СтрокаРасчетов.УчетАгентскогоНДС И ЕстьНДСВТаблице,
			КопияСтрокДокумента.Итог("Сумма") - КопияСтрокДокумента.Итог("СуммаНДС"),
			КопияСтрокДокумента.Итог("Сумма"));
		
		// База распределения - доля расчетов по отобранным строкам документа в общей сумме расчетов.
		БазаРаспределения = Новый Массив;
		БазаРаспределения.Добавить(СуммаРасчетовПоСтрокам);
		БазаРаспределения.Добавить(ОбщаяСуммаРасчетов - СуммаРасчетовПоСтрокам);
		
		// Сумма корректировки, относящаяся к отобранным строкам документа.
		СуммаКорректировки = СтрокаРасчетов.СуммаРубПоКурсуАванса - СтрокаРасчетов.СуммаРуб;
		Если СуммаКорректировки = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		РаспределениеПоСтрокам = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			СуммаКорректировки, БазаРаспределения);
		КорректировкаДоКурсаАванса = РаспределениеПоСтрокам[0];
		
		// Сумма корректировки НДС.
		//НДСПоКурсуАвансов = СтрокаРасчетов.УчетАгентскогоНДС И ЕстьНДСВТаблице;
		НДСПоКурсуАвансов = Ложь; // Сейчас агентский НДС учитывается по курсу поступления.
		Если НДСПоКурсуАвансов Тогда
			
			ДоляНДС = СтрокаРасчетов.СуммаРасчетов / ОбщаяСуммаРасчетов;
			
			СуммаНДСПоКурсуАванса = ДоляНДС * КопияСтрокДокумента.Итог("СуммаНДС")
				* СтрокаРасчетов.СуммаРубПоКурсуАванса / СтрокаРасчетов.СуммаРасчетов;
			
			КорректировкаНДСДоКурсаАванса = СуммаНДСПоКурсуАванса - ДоляНДС * КопияСтрокДокумента.Итог("СуммаНДСРуб");
			
		Иначе
			КорректировкаНДСДоКурсаАванса = 0;
		КонецЕсли;
		
		Если КорректировкаНДСДоКурсаАванса <> 0 Тогда
			
			// Корректировка колонки СуммаНДСРуб  - рассчитаем и сохраним в отдельной колонке.
			ИтогКорректировкаДоКурсаАвансаНДС = КопияСтрокДокумента.Итог("КорректировкаДоКурсаАвансаНДС");
			ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(
				ИтогКорректировкаДоКурсаАвансаНДС + КорректировкаНДСДоКурсаАванса,
				СтрокиДокумента, "КорректировкаДоКурсаАвансаНДС", "СуммаНДС");
			
		КонецЕсли;
		
		Если КорректировкаДоКурсаАванса + КорректировкаНДСДоКурсаАванса <> 0 Тогда
			
			// Корректировка колонки СуммаРуб - рассчитаем и сохраним в отдельной колонке.
			ИтогКорректировкаДоКурсаАванса = КопияСтрокДокумента.Итог("КорректировкаДоКурсаАванса");
			ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(
				ИтогКорректировкаДоКурсаАванса + КорректировкаДоКурсаАванса + КорректировкаНДСДоКурсаАванса,
				СтрокиДокумента, "КорректировкаДоКурсаАванса", "Сумма");
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Корректируем сумму и НДС в рублях до курса аванса (в части зачтенного аванса).
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		СтрокаДокумента.СуммаРуб = СтрокаДокумента.СуммаРуб
			+ СтрокаДокумента.КорректировкаДоКурсаАванса;
		
		Если ЕстьНДСВТаблице Тогда
			СтрокаДокумента.СуммаНДСРуб = СтрокаДокумента.СуммаНДСРуб
				+ СтрокаДокумента.КорректировкаДоКурсаАвансаНДС;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Определяет счет расчетов по переданным параметрам.
//
Функция ОпределитьСчетРасчетовПоПараметрам(Параметры, ВидОперации, Знач НаДату = Неопределено, Знач Организация = Неопределено, Знач ИФО = Неопределено) Экспорт
	
	Если Параметры.Свойство("КЭКРасчетов") И ЗначениеЗаполнено(Параметры.КЭКРасчетов) Тогда // Определяем по КЭК 
		
		// Для КОСГУ 172 счет расчетов определятеся по аналитеческой группе доходов (аналитческой группе КИФ).
		// Чтобы корректно определитьсчет расчетов, необходимо передать КПС.
		Если Параметры.Свойство("КПС") И ЗначениеЗаполнено(Параметры.КПС) Тогда
			КПСРасчетов = Параметры.КПС;
		Иначе
			КПСРасчетов = Неопределено;
		КонецЕсли;	
		
		Если Параметры.Свойство("СчетРасчетов") И ЗначениеЗаполнено(Параметры.СчетРасчетов) Тогда
			Возврат БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
				Параметры.КЭКРасчетов, Параметры.СчетРасчетов, , НаДату, Организация, ИФО, КПСРасчетов);
		ИначеЕсли ВидОперации = "Поступление" Тогда
			Возврат БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
				Параметры.КЭКРасчетов, "302.00", , НаДату, Организация, ИФО, КПСРасчетов);
		ИначеЕсли ВидОперации = "Реализация" Тогда
			Возврат БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
				Параметры.КЭКРасчетов, "205.00", , НаДату, Организация, ИФО, КПСРасчетов);
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("СчетРасчетов") И ЗначениеЗаполнено(Параметры.СчетРасчетов) Тогда
		
		Если ТипЗнч(Параметры.СчетРасчетов) = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
			СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Параметры.СчетРасчетов);
			Если НЕ СвойстваСчетаРасчетов.ЗапретитьИспользоватьВПроводках
			   И НЕ СвойстваСчетаРасчетов.ЭлементГруппа Тогда
				Возврат Параметры.СчетРасчетов; // Явно указан.
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	
КонецФункции

// Определяет счет авансов по счету расчетов.
//
Функция ОпределитьСчетАвансов(СчетРасчетов, Знач НаДату = Неопределено, Знач Организация = Неопределено) Экспорт
	
	СчетАвансов = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	Если НЕ ЗначениеЗаполнено(СчетРасчетов) Тогда
		Возврат СчетАвансов;
	КонецЕсли;
	
	КодСчетаРасчетов = Строка(СчетРасчетов);
	
	Если УчетРасчетов.ВедетсяУчетАвансовПолученных(СчетРасчетов) Тогда // Отдельные субсчета 205.00, 209.00.
		
		// Сначала попытаемся найти забалансовый счет учета авансов полученных "АП".
		Если ЗначениеЗаполнено(НаДату) И ЗначениеЗаполнено(Организация)
			И (НаДату >= ДатаПереходаНаЗабалансовыйСчетАП(Организация)) Тогда
			
			Если БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДоговорам(СчетРасчетов) Тогда
				СчетАвансов = БухгалтерскийУчет.СчетПоКоду("АП", НаДату, Неопределено);
			Иначе
				// Для счетов 205.81, 209.81, 209.82 без субконто "Договоры"
				// учет авансов полученных на счете "АП" не ведется.
				СчетАвансов = СчетРасчетов;
			КонецЕсли;
			
		КонецЕсли;
		
		// Если не нашли забалансовый счет, определим счет учета авансов полученных "по старому".
		Если НЕ ЗначениеЗаполнено(СчетАвансов) Тогда
			// Для счетов 205.хх, 209.хх счета авансов образуются
			// путем добавления буквы "А" в последний разряд кода - 205.хА, 209.хА.
			СчетАвансов = БухгалтерскийУчет.СчетПоКоду(Лев(КодСчетаРасчетов, 5) + "А", Неопределено, Неопределено);
		КонецЕсли;
		
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетРасчетов, "206.00") Тогда
		
		// Это и есть счет авансов выданных.
		СчетАвансов = СчетРасчетов;
		
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетРасчетов, "302.00") Тогда
		
		// Для счетов 302.хх счета авансов имеют вид 206.хх.
		СчетАвансов = БухгалтерскийУчет.СчетПоКоду("206." + Прав(КодСчетаРасчетов, 2), НаДату, Организация);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СчетАвансов) Тогда
		СчетАвансов = СчетРасчетов; // Нет отдельного счета авансов, авансы учитываются на том же счете.
	КонецЕсли;
	
	Возврат СчетАвансов;
	
КонецФункции

// Возвращает соответствующие счета авансов для выбранных счетов расчетов.
//
Функция СоответствиеСчетовАвансовСчетамРасчетов(СчетаРасчетов = "205.00,302.00", Знач НаДату = Неопределено, Знач Организация = Неопределено) Экспорт
	
	СоответствиеСчетовАвансовСчетамРасчетов = Новый Соответствие;
	
	СписокСчетовРасчетов = БухгалтерскийУчет.СписокСчетов(СчетаРасчетов, НаДату, , Организация);
	Для Каждого СчетРасчетов Из СписокСчетовРасчетов Цикл
		СчетАвансов = ОпределитьСчетАвансов(СчетРасчетов, НаДату, Организация);
		СоответствиеСчетовАвансовСчетамРасчетов.Вставить(СчетРасчетов, СчетАвансов);
	КонецЦикла;
	
	Возврат СоответствиеСчетовАвансовСчетамРасчетов;
	
КонецФункции

// Определяет счет расчетов по приобретению внеоборотных активов (ВНА).
//
Функция СчетРасчетовПоПриобретениюВНА(СчетУчетаВНА, СчетРасчетов = "302.00", Знач НаДату = Неопределено, Знач Организация = Неопределено) Экспорт
	
	СчетаВложенийВОС	= "106.11,106.21,106.31,106.41,106.51,106.52,106.КС,107.11,107.21,107.31,107.41";
	СчетаВложенийВНМА	= "106.22,106.32,106.42,106.2D,106.2I,106.2N,106.2R,106.3D,106.3I,106.3N,106.3R,106.54,106.9I";
	СчетаВложенийВНПА	= "106.13,106.43,106.55";
	СчетаВложенийВППНПА	= "106.60";
	
	Если ЗначениеЗаполнено(СчетУчетаВНА) Тогда
		
		Если СчетРасчетов = "208.00" Или БухгалтерскийУчет.СчетВИерархии(СчетРасчетов, "208.00") Тогда
			
			Если БухгалтерскийУчет.СчетВИерархии(СчетУчетаВНА, СчетаВложенийВОС) Тогда
				Возврат БухгалтерскийУчет.СчетПоКоду("208.31", НаДату, Организация);
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетУчетаВНА, СчетаВложенийВНМА) Тогда
				Возврат БухгалтерскийУчет.СчетПоКоду("208.32", НаДату, Организация);
			КонецЕсли;
			
		Иначе // 302.00
			
			Если БухгалтерскийУчет.СчетВИерархии(СчетУчетаВНА, СчетаВложенийВОС) Тогда
				Возврат БухгалтерскийУчет.СчетПоКоду("302.31", НаДату, Организация);
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетУчетаВНА, СчетаВложенийВНМА) Тогда
				Возврат БухгалтерскийУчет.СчетПоКоду("302.32", НаДату, Организация);
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетУчетаВНА, СчетаВложенийВНПА) Тогда
				Возврат БухгалтерскийУчет.СчетПоКоду("302.33", НаДату, Организация);
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетУчетаВНА, СчетаВложенийВППНПА) Тогда
				Возврат БухгалтерскийУчет.СчетПоКоду("302.26", НаДату, Организация);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	
КонецФункции

Функция СчетРасчетовПоАренднойПлате(СчетУчетаПравПользования, Знач НаДату = Неопределено, Знач Организация = Неопределено) Экспорт
	
	Если БухгалтерскийУчет.СчетВИерархии(СчетУчетаПравПользования, "111.49") Тогда
		Возврат БухгалтерскийУчет.СчетПоКоду("302.29", НаДату, Организация);
	Иначе
		Возврат БухгалтерскийУчет.СчетПоКоду("302.24", НаДату, Организация);
	КонецЕсли;
	
КонецФункции

Функция СчетРасчетовПредоставленногоЗайма(Договор, НаДату) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТипыРасчетовПоКредитамСрезПоследних.ТипРасчетов КАК Счет
	|ИЗ
	|	РегистрСведений.ТипыРасчетовПоКредитам.СрезПоследних(&Период, Договор = &Договор) КАК ТипыРасчетовПоКредитамСрезПоследних";
	Запрос.УстановитьПараметр("Период", НаДату);
	Запрос.УстановитьПараметр("Договор", Договор); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Счет;
	Иначе
		Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Процедура ЗачетАвансовВыданныхОбработкаПроверкиЗаполнения(Объект, НепроверяемыеРеквизиты, Отказ) Экспорт

	Если Объект.СпособЗачетаАванса <> Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
		НепроверяемыеРеквизиты.Добавить("ЗачетАвансов");
	КонецЕсли;
	
	ИмяТЧ = "";
	ПредставлениеТЧ = "";
	ИмяРеквизита = "";
	СуммаДокумента = 0;
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеУслугРабот")
			Или ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеУслугРаботПоСчетамУчетаЗатрат") Тогда
		ИмяТЧ = "УслугиИРаботы";
		ПредставлениеТЧ = "Услуги и работы";
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеОС") 
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеОСВПути")
		Или ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеОСИК") Тогда
		ИмяТЧ = "КапВложения";
		ПредставлениеТЧ = "Кап. вложения";
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеМЗ") Тогда
		ИмяРеквизита = "СуммаДокумента";
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеМЗВПути") Тогда
		ИмяРеквизита = "ВсегоПоДокументу";
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ПриходныйОрдерФондовый") Тогда
		ИмяРеквизита = "СуммаДокумента";
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ФормированиеВложенийВФинансовыеАктивы") Тогда
		ИмяРеквизита = "СуммаДокумента";
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ГТДИмпорт") Тогда
		Возврат; // пока не проверяется
	КонецЕсли;
	
	Если ИмяТЧ <> "" Тогда
		СуммаДокумента = Объект[ИмяТЧ].Итог("Всего");
	ИначеЕсли ИмяРеквизита <> "" Тогда
		СуммаДокумента = Объект[ИмяРеквизита];
	КонецЕсли;
	
	ВалютаДокумента = ?(ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("ВалютаДокумента", Объект.Метаданные()),
		Объект.ВалютаДокумента, БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	
	СуммаАванса = Объект.ЗачетАвансов.Итог("СуммаЗачета");
	Если Не СуммаАванса = 0 И СуммаАванса > СуммаДокумента Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сумма зачета аванса (%1) превышает сумму документа (%2).'"),
			ОбщегоНазначенияБГУ.ФорматСумм(СуммаАванса, ВалютаДокумента),
			ОбщегоНазначенияБГУ.ФорматСумм(СуммаДокумента, ВалютаДокумента));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, "ЗачетАвансов[0].СуммаЗачета", "Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция ПериодПолученияОстатков(Документ, ТипВозвращаемогоЗначения = "Граница") Экспорт
	
	ПериодОстатков = ?(ТипВозвращаемогоЗначения = "Дата", Документ.Дата,
		Новый Граница(Документ.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	
	// Если документ проводится другой датой, отличной от даты документа, остатки нужно получать на дату исполнения.
	ДокументыСОтложеннымИсполнением =
		Метаданные.РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.Измерения.ПлатежноРасчетныйДокумент.Тип;
	Если ДокументыСОтложеннымИсполнением.СодержитТип(ТипЗнч(Документ.Ссылка)) Тогда
		ДатаИсполненияДокумента = БухгалтерскиеОперации.ДатаИсполненияДокумента(Документ.Ссылка);
		Если ЗначениеЗаполнено(ДатаИсполненияДокумента) И ДатаИсполненияДокумента > Документ.Дата Тогда
			// Остатки определяем на дату исполнения, только если она больше даты документа.
			ПериодОстатков = ?(ТипВозвращаемогоЗначения = "Дата", ДатаИсполненияДокумента,
				Новый Граница(ДатаИсполненияДокумента, ВидГраницы.Исключая));
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПериодОстатков;
	
КонецФункции

Функция ДатаПереходаНаЗабалансовыйСчетАП(Знач Организация) Экспорт
	
	ДатаПереходаНаРедакцию64н = БухгалтерскийУчетПовтИсп.ДатаПереходаНаРедакциюПС(Организация, Дата('20180101'));
	
	Если ЗначениеЗаполнено(ДатаПереходаНаРедакцию64н) Тогда
		
		// Перевод учета авансов полученных на забалансовый счет АП совпадает с началом применения организацией
		// редакции плана счетов по Приказу Минфина России от 31.03.2018 N 64н.
		Возврат ДатаПереходаНаРедакцию64н;
		
	Иначе
		
		Возврат КонецГода('20180101');
		
	КонецЕсли;
	
КонецФункции

Функция ВедетсяУчетАвансовПолученных(СчетРасчетов) Экспорт
	
	Возврат БухгалтерскийУчет.СчетВИерархии(СчетРасчетов, "205.20,205.30,205.70,205.80,209.70,209.80,210.05");
	
КонецФункции

Функция УчетАгентскогоНДС(Договор) Экспорт
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		
		Возврат Ложь;
		
	ИначеЕсли ТипЗнч(Договор) = Тип("Структура") Тогда
		
		Возврат Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
			И (Договор.ТипДоговораНДС = Перечисления.ТипыДоговоровДляНДС.АгентскийДоговор
			ИЛИ Договор.ТипДоговораНДС = Перечисления.ТипыДоговоровДляНДС.АгентскийДоговорНерезидент);
		
	ИначеЕсли ТипЗнч(Договор) = Тип("СправочникСсылка.Договоры") Тогда
		
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора,ТипДоговораНДС");
		
		Возврат РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
			И (РеквизитыДоговора.ТипДоговораНДС = Перечисления.ТипыДоговоровДляНДС.АгентскийДоговор
			ИЛИ РеквизитыДоговора.ТипДоговораНДС = Перечисления.ТипыДоговоровДляНДС.АгентскийДоговорНерезидент);
		
	КонецЕсли;
	
КонецФункции

// Счет расчетов, доп.субконто расчетов в расшифровке платежа и других документах.

Функция ИспользуетсяНастройкаПогашенияЗадолженности(СчетРасчетов) Экспорт
	
	Возврат БухгалтерскийУчет.СчетВИерархии(СчетРасчетов, "205.00,209.00,206.00,302.00,210.05")
		И НЕ БухгалтерскийУчет.СчетВИерархии(СчетРасчетов, "205.2А,205.3А,205.7А,205.8А,209.7А,209.8А");
	
КонецФункции

Функция ПараметрыДопСубконтоРасчетов(СчетРасчетов) Экспорт
	
	ПараметрыДопСубконто = Новый Структура;
	ПараметрыДопСубконто.Вставить("Использование", Ложь);
	ПараметрыДопСубконто.Вставить("НомерСубконто", 0);
	ПараметрыДопСубконто.Вставить("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконто.ПустаяСсылка());
	ПараметрыДопСубконто.Вставить("Обязательный", Ложь);
	
	Если НЕ ЗначениеЗаполнено(СчетРасчетов) Тогда
		Возврат ПараметрыДопСубконто;
	КонецЕсли;
	
	СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетРасчетов);
	Для НомерСубконто = 1 По СвойстваСчета.КоличествоСубконто Цикл
	
		ВидСубконто = СвойстваСчета["ВидСубконто" + НомерСубконто];
		Если ВидСубконто = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.Контрагенты")
		 ИЛИ ВидСубконто = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.Договоры") Тогда
			Продолжить; // Пропускаем.
		Иначе
			ПараметрыДопСубконто.Использование = Истина;
			ПараметрыДопСубконто.НомерСубконто = НомерСубконто;
			ПараметрыДопСубконто.ВидСубконто   = ВидСубконто;
			ПараметрыДопСубконто.Обязательный  = СвойстваСчета["ВидСубконто" + НомерСубконто + "Обязательный"];
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ПараметрыДопСубконто;
	
КонецФункции

Процедура ЗаполнитьПараметрыСчетаРасчетовВРасшифровкеПлатежа(Расшифровка, Знач КЭК, Знач КорСчет, Знач НаДату, Знач Организация, Знач ИФО, ТолькоДинамическиеКолонки = Ложь) Экспорт
	
	Если Расшифровка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РасшифровкаОбъект = ?(ТипЗнч(Расшифровка) = Тип("ФормаКлиентскогоПриложения"), Расшифровка.Объект, Расшифровка);
	
	Если УчетРасчетов.ИспользуетсяНастройкаПогашенияЗадолженности(КорСчет) Тогда
		
		Если НЕ ТолькоДинамическиеКолонки Тогда // Перезаполняем счет расчетов по КЭК и КорСчету.
			Если КорСчет = БухгалтерскийУчет.СчетПоКоду("205.00", Неопределено, Неопределено)
			 ИЛИ КорСчет = БухгалтерскийУчет.СчетПоКоду("209.00", Неопределено, Неопределено) Тогда
				// В расчетно-платежных документах кор.счета 205.00 и 209.00 в шапке объединены.
				РасшифровкаОбъект.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					КЭК, "205.00,209.00",, НаДату, Организация, ИФО);
			Иначе
				// Для остальных кор.счетов (206.00, 302.00 и пр.) ищем только в рамках кор.счета в шапке документа.
				РасшифровкаОбъект.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					КЭК, КорСчет,, НаДату, Организация, ИФО);
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыДопСубконтоРасчетов = ПараметрыДопСубконтоРасчетов(РасшифровкаОбъект.СчетРасчетов);
		
		Расшифровка.ДопСубконтоРасчетовВид   = ПараметрыДопСубконтоРасчетов.ВидСубконто;
		Расшифровка.ДопСубконтоРасчетовНомер = ПараметрыДопСубконтоРасчетов.НомерСубконто;
		
		Если ПараметрыДопСубконтоРасчетов.Использование = Ложь Тогда
			Расшифровка.ДопСубконтоРасчетовДоступность = 0; // Не показывать.
		ИначеЕсли ПараметрыДопСубконтоРасчетов.Обязательный Тогда
			Расшифровка.ДопСубконтоРасчетовДоступность = 1; // Обязательное субконто.
		Иначе
			Расшифровка.ДопСубконтоРасчетовДоступность = 2; // Необязательное субконто.
		КонецЕсли;
		
		Если НЕ ТолькоДинамическиеКолонки Тогда
			
			Если ПараметрыДопСубконтоРасчетов.Использование = Истина Тогда
				РасшифровкаОбъект.ДопСубконтоРасчетов = Расшифровка.ДопСубконтоРасчетовВид.ТипЗначения.ПривестиЗначение(
					РасшифровкаОбъект.ДопСубконтоРасчетов);
			Иначе
				РасшифровкаОбъект.ДопСубконтоРасчетов = Неопределено;
				РасшифровкаОбъект.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Расшифровка.ДопСубконтоРасчетовВид = ПланыВидовХарактеристик.ВидыСубконто.ПустаяСсылка();
		Расшифровка.ДопСубконтоРасчетовНомер = 0;
		Расшифровка.ДопСубконтоРасчетовДоступность = 0;
		
		Если НЕ ТолькоДинамическиеКолонки Тогда
			
			РасшифровкаОбъект.СчетРасчетов = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			РасшифровкаОбъект.ДопСубконтоРасчетов = Неопределено;
			РасшифровкаОбъект.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеТаблицыРасшифровкаПлатежа(УсловноеОформление, ПрефиксИмени = "РасшифровкаПлатежа", ИмяТаблицы = "РасшифровкаПлатежа") Экспорт
	
	// Счет расчетов.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ПрефиксИмени + "СчетРасчетов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".СчетРасчетов", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<авто>'"));
	
	// Доступность реквизитов "Способ погашения задолженности" и "Доп. аналитика расчетов".
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ПрефиксИмени + "СпособПогашенияЗадолженности");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ПрефиксИмени + "ДопСубконтоРасчетов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".СчетРасчетов", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	// Если "Способ погашения задолженности" не заполнен, значит погашаем автоматически.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ПрефиксИмени + "СпособПогашенияЗадолженности");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".СпособПогашенияЗадолженности", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Автоматически'"));
	
	// Для доп.субконто "Документы расчетов".
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ПрефиксИмени + "ДопСубконтоРасчетов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ДопСубконтоРасчетовВид", ВидСравненияКомпоновкиДанных.Равно,
			ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".СпособПогашенияЗадолженности", ВидСравненияКомпоновкиДанных.НеРавно,
			Перечисления.СпособыПогашенияЗадолженности.ПоДокументу);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Обязательное доп.субконто расчетов.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ПрефиксИмени + "ДопСубконтоРасчетов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ДопСубконтоРасчетовДоступность", ВидСравненияКомпоновкиДанных.Равно, 1);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ДопСубконтоРасчетов", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<...>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	
	// Необязательное доп.субконто расчетов.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ПрефиксИмени + "ДопСубконтоРасчетов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ДопСубконтоРасчетовДоступность", ВидСравненияКомпоновкиДанных.Равно, 2);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ДопСубконтоРасчетов", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<...>");
	
	// Нет доп.субконто расчетов.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ПрефиксИмени + "ДопСубконтоРасчетов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ДопСубконтоРасчетовДоступность", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Автоматически определять дату оплаты по графику платежей.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ПрефиксИмени + "ОплатитьДо");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ОплатитьДо", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<авто>");
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыСчетаИДопСубконтоРасчетов(Начисление, Знач КЭК, Знач КорСчет, Знач НаДату, Знач Организация, Знач ИФО, ТолькоДинамическиеКолонки = Ложь) Экспорт
	
	Если Начисление = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачислениеОбъект = ?(ТипЗнч(Начисление) = Тип("ФормаКлиентскогоПриложения"), Начисление.Объект, Начисление);
	
	Если НЕ ТолькоДинамическиеКолонки Тогда // Перезаполняем счет расчетов по КЭК и КорСчету.
		НачислениеОбъект.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
			КЭК, КорСчет,, НаДату, Организация, ИФО);
	КонецЕсли;
	
	ПараметрыДопСубконтоРасчетов = ПараметрыДопСубконтоРасчетов(НачислениеОбъект.СчетРасчетов);
	
	Начисление.ДопСубконтоРасчетовВид   = ПараметрыДопСубконтоРасчетов.ВидСубконто;
	Начисление.ДопСубконтоРасчетовНомер = ПараметрыДопСубконтоРасчетов.НомерСубконто;
	
	Если ПараметрыДопСубконтоРасчетов.Использование = Ложь Тогда
		Начисление.ДопСубконтоРасчетовДоступность = 0; // Не показывать.
	ИначеЕсли ПараметрыДопСубконтоРасчетов.Обязательный Тогда
		Начисление.ДопСубконтоРасчетовДоступность = 1; // Обязательное субконто.
	Иначе
		Начисление.ДопСубконтоРасчетовДоступность = 2; // Необязательное субконто.
	КонецЕсли;
	
	Если НЕ ТолькоДинамическиеКолонки Тогда
		
		Если ПараметрыДопСубконтоРасчетов.Использование = Истина Тогда
			НачислениеОбъект.ДопСубконтоРасчетов = Начисление.ДопСубконтоРасчетовВид.ТипЗначения.ПривестиЗначение(
				НачислениеОбъект.ДопСубконтоРасчетов);
		Иначе
			НачислениеОбъект.ДопСубконтоРасчетов = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеСчетаИДопСубконтоРасчетов(УсловноеОформление, ИмяТаблицы, АвтоОпределениеСчетаРасчетов = Ложь) Экспорт
	
	// Счет расчетов.
	Если АвтоОпределениеСчетаРасчетов Тогда
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяТаблицы + "СчетРасчетов");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект." + ИмяТаблицы + ".СчетРасчетов", ВидСравненияКомпоновкиДанных.НеЗаполнено);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<авто>'"));
	КонецЕсли;
	
	// Доступность реквизитов "Способ погашения задолженности" и "Доп. аналитика расчетов".
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяТаблицы + "ДопСубконтоРасчетов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".СчетРасчетов", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	// Для доп.субконто "Документы расчетов".
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяТаблицы + "ДопСубконтоРасчетов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ДопСубконтоРасчетовВид", ВидСравненияКомпоновкиДанных.Равно,
			ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Обязательное доп.субконто расчетов.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяТаблицы + "ДопСубконтоРасчетов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ДопСубконтоРасчетовДоступность", ВидСравненияКомпоновкиДанных.Равно, 1);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ДопСубконтоРасчетов", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<...>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	
	// Необязательное доп.субконто расчетов.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяТаблицы + "ДопСубконтоРасчетов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ДопСубконтоРасчетовДоступность", ВидСравненияКомпоновкиДанных.Равно, 2);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ДопСубконтоРасчетов", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<...>");
	
	// Нет доп.субконто расчетов.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, ИмяТаблицы + "ДопСубконтоРасчетов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект." + ИмяТаблицы + ".ДопСубконтоРасчетовДоступность", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

Процедура РассчитатьСуммыРубПоКурсуДокумента(ТаблицаДокумента, Реквизиты) Экспорт
	
	Если Реквизиты.Свойство("Курс") И Реквизиты.Свойство("Кратность") Тогда
		КурсДокумента = ?(Реквизиты.Курс = 0, 1, Реквизиты.Курс)
			/ ?(Реквизиты.Кратность = 0, 1, Реквизиты.Кратность);
	Иначе
		КурсДокумента = 1;
	КонецЕсли;
	
	// Рассчитаем рублевые суммы, если они не рассчитаны в исходной таблице документа.
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	// СуммаРуб
	Если ТаблицаДокумента.Колонки.Найти("Сумма") <> Неопределено
	   И ТаблицаДокумента.Колонки.Найти("СуммаРуб") = Неопределено Тогда
		ТаблицаДокумента.Колонки.Добавить("СуммаРуб", ОписаниеТипаСуммы);
		
		ИтогСуммаРуб = Окр(ТаблицаДокумента.Итог("Сумма") *КурсДокумента, 2);
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ИтогСуммаРуб, ТаблицаДокумента, "СуммаРуб", "Сумма");
		
	КонецЕсли;
	
	// СуммаНДСРуб
	Если ТаблицаДокумента.Колонки.Найти("СуммаНДС") <> Неопределено
	   И ТаблицаДокумента.Колонки.Найти("СуммаНДСРуб") = Неопределено Тогда
		ТаблицаДокумента.Колонки.Добавить("СуммаНДСРуб", ОписаниеТипаСуммы);
		
		ИтогСуммаНДСРуб = Окр(ТаблицаДокумента.Итог("СуммаНДС") * КурсДокумента, 2);
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ИтогСуммаНДСРуб, ТаблицаДокумента, "СуммаНДСРуб", "СуммаНДС");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДобавитьСлужебныеКолонкиРасчетовСКонтрагентами(ТаблицаДокумента, Реквизиты)
	
	Если ТаблицаДокумента = Неопределено Тогда
		Возврат ТаблицаДокумента;
	КонецЕсли;
	
	НетКолонкиСуммаРуб = (ТаблицаДокумента.Колонки.Найти("СуммаРуб") = Неопределено);
	Если НетКолонкиСуммаРуб Тогда
		ТаблицаДокумента.Колонки.Добавить("СуммаРуб", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(18, 2));
	КонецЕсли;
	
	НетКолонкиСчетАвансов = (ТаблицаДокумента.Колонки.Найти("СчетАвансов") = Неопределено);
	Если НетКолонкиСчетАвансов Тогда
		ТаблицаДокумента.Колонки.Добавить("СчетАвансов", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	КонецЕсли;
	
	ТаблицаДокумента.Колонки.Добавить("ВидАванса",         ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(10));
	ТаблицаДокумента.Колонки.Добавить("РасчетыВВалюте",    Новый ОписаниеТипов("Булево"));
	ТаблицаДокумента.Колонки.Добавить("Курс",              ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(10, 4));
	ТаблицаДокумента.Колонки.Добавить("Кратность",         ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(10, 0));
	Если ТаблицаДокумента.Колонки.Найти("ВидДоговора") = Неопределено Тогда
		ТаблицаДокумента.Колонки.Добавить("ВидДоговора",   Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоговоровКонтрагентов"));
	КонецЕсли;
	ТаблицаДокумента.Колонки.Добавить("УчетАгентскогоНДС", Новый ОписаниеТипов("Булево"));
	
	РеквизитыДоговоров = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ТаблицаДокумента.ВыгрузитьКолонку("Договор")),
			"ВидДоговора,ТипДоговораНДС");
	
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
		// Определим счета авансов, если они еще не указаны в таблице.
		Если НетКолонкиСчетАвансов Тогда
			ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
				УчетРасчетов.ПериодПолученияОстатков(Реквизиты, "Дата"));
			СтрокаДокумента.СчетАвансов = УчетРасчетов.ОпределитьСчетАвансов(СтрокаДокумента.СчетРасчетов,
				ПериодОстатков, Реквизиты.Организация);
		КонецЕсли;
		
		// Определим вид аванса: выданный или полученный.
		Если БухгалтерскийУчет.СчетВИерархии(СтрокаДокумента.СчетРасчетов, "205.00") 
			ИЛИ БухгалтерскийУчет.СчетВИерархии(СтрокаДокумента.СчетРасчетов, "210.05")
			ИЛИ БухгалтерскийУчет.СчетВИерархии(СтрокаДокумента.СчетРасчетов, "209.00") Тогда
			СтрокаДокумента.ВидАванса = "Полученный";
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СтрокаДокумента.СчетРасчетов, "206.00") Тогда
			СтрокаДокумента.ВидАванса = "Выданный";
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СтрокаДокумента.СчетРасчетов, "302.00") Тогда
			СтрокаДокумента.ВидАванса = "Выданный";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДокумента.Договор) Тогда
			СтрокаДокумента.ВидДоговора = РеквизитыДоговоров[СтрокаДокумента.Договор].ВидДоговора;
			СтрокаДокумента.УчетАгентскогоНДС = УчетРасчетов.УчетАгентскогоНДС(РеквизитыДоговоров[СтрокаДокумента.Договор]);
		Иначе
			СтрокаДокумента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПустаяСсылка();
			СтрокаДокумента.УчетАгентскогоНДС = Ложь;
		КонецЕсли;
		
		СтрокаДокумента.РасчетыВВалюте = Реквизиты.ИспользоватьВалютныйУчет И
			(СтрокаДокумента.Валюта <> БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
		
		Если СтрокаДокумента.РасчетыВВалюте Тогда
			
			Если НЕ (Реквизиты.Свойство("Курс") И Реквизиты.Свойство("Кратность")) Тогда
				КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтрокаДокумента.Валюта, НачалоДня(Реквизиты.Дата));
				СтрокаДокумента.Курс      = КурсКратность.Курс;
				СтрокаДокумента.Кратность = КурсКратность.Кратность;
			Иначе
				СтрокаДокумента.Курс      = Реквизиты.Курс;
				СтрокаДокумента.Кратность = Реквизиты.Кратность;
			КонецЕсли;
			
			Если НетКолонкиСуммаРуб Тогда
				КурсДокумента = ?(СтрокаДокумента.Кратность = 0, СтрокаДокумента.Курс,
									СтрокаДокумента.Курс / СтрокаДокумента.Кратность);
				СтрокаДокумента.СуммаРуб = Окр(СтрокаДокумента.СуммаРасчетов * КурсДокумента, 2);
			Иначе
				// Колонка "СуммаРуб" уже рассчитана.
			КонецЕсли;
			
		Иначе
			СтрокаДокумента.СуммаРуб  = СтрокаДокумента.СуммаРасчетов;
			СтрокаДокумента.Курс      = 1;
			СтрокаДокумента.Кратность = 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДокумента;
	
КонецФункции

Процедура ПроверитьКорректностьНастройкиСчетовРасчетов(ТаблицаДокумента, Реквизиты)
	
	Если ТаблицаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Реквизиты.ИспользоватьВалютныйУчет Тогда
		
		Отбор = Новый Структура("РасчетыВВалюте", Истина);
		СтрокиРасчетыВВалюте = ТаблицаДокумента.Скопировать(Отбор, "СчетРасчетов,СчетАвансов,Валюта");
		СтрокиРасчетыВВалюте.Свернуть("СчетРасчетов,СчетАвансов,Валюта");
		Для Каждого СтрокаРасчетов Из СтрокиРасчетыВВалюте Цикл
			
			Если БухгалтерскийУчет.СчетВИерархии(СтрокаРасчетов.СчетРасчетов, "302.00")
				И БухгалтерскийУчет.СчетВИерархии(СтрокаРасчетов.СчетАвансов, "206.00") Тогда
				
				// Оба счета - 302.хх и 206.хх - должны быть валютными.
				СвойстваСчетаАвансов  = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасчетов.СчетАвансов);
				СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасчетов.СчетРасчетов);
				Если НЕ СвойстваСчетаРасчетов.Валютный ИЛИ НЕ СвойстваСчетаАвансов.Валютный Тогда
					ТекстОшибки = НСтр("ru='Внимание! Для корректного отражения в учете расчетов в валюте %1 необходимо установить валютный учет на счетах %2 и %3.
						|Установите признак ""Валютный"" в настройках указанных счетов (в разделе ""Учет и отчетность - План счетов (ЕПСБУ)"").'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
						СтрокаРасчетов.Валюта,
						СтрокаРасчетов.СчетРасчетов,
						СтрокаРасчетов.СчетАвансов);
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Реквизиты.Ссылка, , "Объект");
				КонецЕсли;
				
			Иначе
				
				// Счет авансов совпадает со счетом расчетов. Либо счет авансов АП - всегда валютный.
				СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасчетов.СчетРасчетов);
				Если НЕ СвойстваСчетаРасчетов.Валютный Тогда
					ТекстОшибки = НСтр("ru='Внимание! Для корректного отражения в учете расчетов в валюте %1 необходимо установить валютный учет на счете %2.
						|Установите признак ""Валютный"" в настройке указанного счета (в разделе ""Учет и отчетность - План счетов (ЕПСБУ)"").'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
						СтрокаРасчетов.Валюта,
						СтрокаРасчетов.СчетРасчетов);
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Реквизиты.Ссылка, , "Объект");
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнениеДоговораОбязательно(СчетРасчетов)
	
	Если ЗначениеЗаполнено(СчетРасчетов) Тогда
		
		ВидСубконтоДоговоры = СчетРасчетов.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
		Если ЗначениеЗаполнено(ВидСубконтоДоговоры) Тогда
			Возврат ВидСубконтоДоговоры.Обязательный;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
