
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УстановитьПризнак(ПараметрКоманды);
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Изменение'"),,НСтр("ru = 'Признак использования успешно снят.'"),БиблиотекаКартинок.Успешно32);
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.МакетыОтображенияОтчетов"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнак(МакетОтображения)
	
	Справочники.МакетыОтображенияОтчетов.УстановитьИспользованиеПоУмолчанию(МакетОтображения, Ложь);

КонецПроцедуры	
