#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	ИмуществоКазныОСНМАНПА = Неопределено;
	ОсновныеСредстваВыбытие = Неопределено;
	ОсновныеСредстваПоступление = Неопределено;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "БезвозмездныеПередачиОС");
	НастройкиВарианта.Описание = НСтр("ru = 'Выбытия ОС, НМА, НПА, ИК в корреспонденции со счетами 304.04 и 401.10.'");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.ТаксиОсновныеСредства.Подсистемы.Выбытие, "");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.ТаксиИмуществоКазны.Подсистемы.ОСНМАНПА, "");
	Если НЕ ОсновныеСредстваВыбытие = Неопределено Тогда
		НастройкиВарианта.Размещение.Вставить(ОсновныеСредстваВыбытие, "");
	КонецЕсли;
	Если НЕ ИмуществоКазныОСНМАНПА = Неопределено Тогда
		НастройкиВарианта.Размещение.Вставить(ИмуществоКазныОСНМАНПА, "");
	КонецЕсли;
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "БезвозмездныеПоступленияОС");
	НастройкиВарианта.Описание = НСтр("ru = 'Поступления ОС, НМА, НПА, ИК в корреспонденции со счетами 304.04 и 401.10.'");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.ТаксиОсновныеСредства.Подсистемы.Поступление, "");
	НастройкиВарианта.Размещение.Вставить(Метаданные.Подсистемы.ТаксиИмуществоКазны.Подсистемы.ОСНМАНПА, "");
	Если НЕ ОсновныеСредстваПоступление = Неопределено Тогда
		НастройкиВарианта.Размещение.Вставить(ОсновныеСредстваПоступление, "");
	КонецЕсли;
	Если НЕ ИмуществоКазныОСНМАНПА = Неопределено Тогда
		НастройкиВарианта.Размещение.Вставить(ИмуществоКазныОСНМАНПА, "");
	КонецЕсли;
	
КонецПроцедуры

Функция СписокСчетов(КодыСчетов, СКонтрагентом) Экспорт
	
	ВидыСубконтоСКонтрагентом = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыСубконто.Ссылка КАК Ссылка,
	|	ВидыСубконто.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.ВидыСубконто КАК ВидыСубконто";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТипКонтрагент = Тип("СправочникСсылка.Контрагенты");
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипЗначения.СодержитТип(ТипКонтрагент) Тогда
			ВидыСубконтоСКонтрагентом.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСчетов", БухгалтерскийУчет.СписокСчетов(КодыСчетов));
	Запрос.УстановитьПараметр("СписокВидовСубконто", ВидыСубконтоСКонтрагентом);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&СписокСчетов)
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|	И ЕПСБУ.Ссылка В
	|			(ВЫБРАТЬ
	|				ЕПСБУВидыСубконто.Ссылка КАК Ссылка
	|			ИЗ
	|				ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|			ГДЕ
	|				ЕПСБУВидыСубконто.ВидСубконто В (&СписокВидовСубконто))";
	
	Если Не СКонтрагентом Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЕПСБУ.Ссылка", "И НЕ ЕПСБУ.Ссылка");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли