#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
		
	ВычислитьНаименование();
	
КонецПроцедуры

Процедура ВычислитьНаименование()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", ЭтотОбъект.Владелец);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеквизитыСведенийОбИмуществе.Ссылка,
	               |	РеквизитыСведенийОбИмуществе.ИмяДляФормулы
	               |ИЗ
	               |	Справочник.РеквизитыСведенийОбИмуществе КАК РеквизитыСведенийОбИмуществе
	               |ГДЕ
	               |	РеквизитыСведенийОбИмуществе.Владелец = &Владелец
	               |	И НЕ РеквизитыСведенийОбИмуществе.ЭтоГруппа
				   |	И НЕ РеквизитыСведенийОбИмуществе.ПометкаУдаления
	               |	И РеквизитыСведенийОбИмуществе.ВидРеквизита <> ЗНАЧЕНИЕ(Перечисление.ВидыРеквизитовСведенийОбИмуществе.ДекорацияНадпись)";
				   
	Объект = Новый Структура;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаРеквизита = ЭтотОбъект.ЗначенияРеквизитов.Найти(Выборка.Ссылка, "РеквизитСведений");
		Значение = ?(СтрокаРеквизита = Неопределено, "", СтрокаРеквизита.Значение);
		Объект.Вставить(Выборка.ИмяДляФормулы, Значение);
	КонецЦикла;
		
	Представление = "";
	Параметры = Новый Структура;
	Параметры.Вставить("Представление", "");
	Параметры.Вставить("Значение", ЭтотОбъект.Владелец.ФормулаПредставления);
	ОбщегоНазначения.ВыполнитьВБезопасномРежиме("Параметры.Представление = Параметры.Значение", Параметры);
	Представление = Параметры.Представление;
	
	МаксДлина = Метаданные.Справочники.ОбъектыРеестраИмущества.ДлинаНаименования - 3;
	Если СтрДлина(Представление) > МаксДлина Тогда
		Представление = Сред(Представление, 1, МаксДлина) + "...";
	КонецЕсли;
	
	ЭтотОбъект.Наименование = Представление;

КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

