
Функция ЭкранироватьСимволыGS1Штрихкода(Знач Штрихкод) Экспорт
	
	Возврат СтрЗаменить(Штрихкод,
		ОбщегоНазначенияБПОКлиентСервер.РазделительGS1(),
		ОбщегоНазначенияБПОКлиентСервер.ЭкранированныйСимволGS1());
	
КонецФункции

Функция  НачатьПоискНоменклатурыПоШтрихкоду(ПараметрыОбработки) Экспорт
	
	Если ПараметрыОбработки.Штрихкоды.Свойство("Штрихкод") Тогда
		ПараметрыОбработки.Штрихкоды.Штрихкод = ЭкранироватьСимволыGS1Штрихкода(ПараметрыОбработки.Штрихкоды.Штрихкод);
	КонецЕсли;
	
	РезультатПоискаТовара = ШтрихкодированиеБГУВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(ПараметрыОбработки);
	
	Возврат РезультатПоискаТовара;
	
КонецФункции


