//---
// Параметры формы
//---
//
//	<обязательные>
//		СвязиПараметровВыбора	- Структура	- Набор значений, используемых для установки параметров выбора
//											различных элементов этой формы;
//		ЗначенияЗаполнения		- Структура	- Набор значений, присваиваемых реквизитам этой формы;
//		КоличествоСтрок			- Число		- Число строк, выводимое для справки в шапке формы;
//
//	<опциональные>
//		НеиспользуемыеПоля			- Строка или массив	- Имена скрываемых реквизитов;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ЗначенияЗаполнения);
	
	ОпределитьИменаПолей();
	
	НастроитьФормуПриСтарте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьДоступностьРеквизитовАктаСверки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаключениеКомиссииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументОписи", Объект.Ссылка);
	
	Оповещение = Новый ОписаниеОповещения("ЗакрытаФормаВыбораЗаключенияКомиссии", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ЗаключенияКомиссииПоИнвентаризационнымОписям.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаключениеКомиссииОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ЗакрытаФормаРедактированияТекстаЗаключенияКомиссии", ЭтотОбъект);
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, ЗаключениеКомиссии, НСтр("ru='Заключение комиссии по результатам инвентаризации'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ФлажокПодтверждениеАктомСверкиПриИзменении(Элемент)
	
	ОчиститьИныеНастройкиАктаСверки(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеАктомСверкиПриИзменении(Элемент)
	
	Если ПодтверждениеАктомСверки = 0 Тогда
		ДатаАктаСверки = Неопределено;
		НомерАктаСверки = Неопределено;
	КонецЕсли;
	
	НастроитьДоступностьРеквизитовАктаСверки();
	
	ПолеПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсеСуммыПриОтсутствииАктаСверкиПриИзменении(Элемент)
	
	ОчиститьИныеНастройкиАктаСверки(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаОбразованияПояснениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуРедактированияТекстаОтраженияЗадолженности(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаОбразованияДополнительноНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФормуРедактированияТекстаОтраженияЗадолженности(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ПроверитьЗаполнениеИЗакрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьИменаВсехПолей()
	
	Возврат Новый Структура("
		|ЗаключениеКомиссии,
		|СуммаТребуетРеклассификации,
		|ПодтверждениеАктомСверки,
		|ДатаВозникновения,
		|ПричинаОбразованияКод,
		|ПричинаОбразованияПояснение,
		|ПричинаОбразованияДополнительно");
	
КонецФункции

&НаСервере
Процедура НастроитьФормуПриСтарте()
	
	Перем ЗначениеПараметра;
	
	Объект = Новый Структура("Ссылка", Параметры.ОписьСсылка);
	Объект = Новый ФиксированнаяСтруктура(Объект);
	
	// Скрываем неиспользуемые поля
	Для Каждого Элемент Из НеиспользуемыеПоля Цикл
		ИмяЭлементаФормы = Элемент.Ключ;
		
		Элементы[ИмяЭлементаФормы].Видимость = Ложь;
		
		Элементы["Флажок" + ИмяЭлементаФормы].Видимость = Ложь;
	КонецЦикла;
	
	// Категории для русского языка:
	//	Ноль	(-);
	//	Один	(1 шт);
	//	Два		(-);
	//	Немного	(2 шт);
	//	Много	(5 шт);
	//	Другое	(-)
	НадписьКоличествоСтрок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru=';%1 строку;;%1 строки;%1 строк;'"),
		Параметры.КоличествоСтрок);
	
	Элементы["ЗакрытьФорму"].Заголовок = СтрШаблон(
		НСтр("ru='Заполнить %1'"),
		НадписьКоличествоСтрок);
	
	ЗаполнитьСписокВыбораКодаПричиныОбразования();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Для Каждого Элемент Из ИспользуемыеПоля Цикл
		ИмяПоля = Элемент.Ключ;
		
		ИмяПоляФлажок = "Флажок" + ИмяПоля;
		
		//
		// N. Поле при сброшенном флажке
		//
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		НовыйЭлементУО.Представление = "Поле " + ИмяПоля + " при сброшенном флажке";
		
		// Условие
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляФлажок);
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Ложь;
		
		// Оформление
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",				ЦветаСтиля.НедоступныеДанныеЦвет);
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона",				Новый Цвет(250, 250, 250));
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",	Ложь);
		
		// Оформляемые поля
		Если ИмяПоля = "ПодтверждениеАктомСверки" Тогда
			ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПодтверждениеАктомСверки");
			
			ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДатаАктаСверки");
			
			ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НомерАктаСверки");
		Иначе
			ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
		
		//
		// N+1. Поле пустое при установленном флажке
		//
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		НовыйЭлементУО.Представление = "Поле " + ИмяПоля + " пустое при установленном флажке";
		
		// Условие
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		Условие.ПравоеЗначение = Истина;
		
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляФлажок);
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Истина;
		
		// Оформление
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
		
		// Оформляемые поля
		Если ИмяПоля = "ПодтверждениеАктомСверки" Тогда
			ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДатаАктаСверки");
			
			ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НомерАктаСверки");
		Иначе
			ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьИменаПолей()
	
	Перем ПереданноеЗначение;
	
	ИменаВсехПолей = ПолучитьИменаВсехПолей();
	
	ВремИспользуемыеПоля = ИменаВсехПолей;
	
	ВремНеиспользуемыеПоля = Новый Структура();
	
	МассивИмен = СтрРазделить(Параметры.НеиспользуемыеПоля, ", ", Ложь);
	
	Для Каждого ИмяПоля Из МассивИмен Цикл
		Если ИменаВсехПолей.Свойство(ИмяПоля) Тогда
			ВремНеиспользуемыеПоля.Вставить(ИмяПоля);
			ВремИспользуемыеПоля.Удалить(ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
	ИспользуемыеПоля = Новый ФиксированнаяСтруктура(ВремИспользуемыеПоля);
	
	НеиспользуемыеПоля = Новый ФиксированнаяСтруктура(ВремНеиспользуемыеПоля);
	
КонецФункции

&НаКлиенте
Процедура ПолеПриИзменении(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	
	Если ИмяЭлемента = "ДатаАктаСверки" Или ИмяЭлемента = "НомерАктаСверки" Тогда
		ИмяЭлемента = "ПодтверждениеАктомСверки";
	КонецЕсли;
	
	ИмяПоляФлажок = "Флажок" + ИмяЭлемента;
	
	ЭтаФорма[ИмяПоляФлажок] = Истина;
	
	Если ИмяЭлемента = "ПодтверждениеАктомСверки" Тогда
		ОчиститьИныеНастройкиАктаСверки(ИмяЭлемента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеИЗакрыть()
	
	ВозвращаемоеЗначение = ПолучитьВозвращаемоеЗначение();
	
	Этаформа.Закрыть(ВозвращаемоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВозвращаемоеЗначение()
	
	// Возвращаем лишь значения, которые отмечены флажком
	
	ВозвращаемоеЗначение = Новый Структура();
	
	Для Каждого Элемент Из ИспользуемыеПоля Цикл
		ИмяРеквизита = Элемент.Ключ;
		
		Если ЭтаФорма["Флажок" + ИмяРеквизита] Тогда
			Если ИмяРеквизита = "ПодтверждениеАктомСверки" Тогда
				ВозвращаемоеЗначение.Вставить("ПодтверждениеАктомСверки",	ПодтверждениеАктомСверки);
				ВозвращаемоеЗначение.Вставить("ДатаАктаСверки",				ДатаАктаСверки);
				ВозвращаемоеЗначение.Вставить("НомерАктаСверки",			НомерАктаСверки);
				
				Продолжить;
			КонецЕсли;
			
			ЗначениеРеквизита = ЭтаФорма[ИмяРеквизита];
			
			ВозвращаемоеЗначение.Вставить(ИмяРеквизита, ЗначениеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	Если ОчиститьВсеСуммыПриОтсутствииАктаСверки Тогда
		ВозвращаемоеЗначение.Вставить("ОчиститьВсеСуммыПриОтсутствииАктаСверки", Истина);
	КонецЕсли;
	
	Если ВозвращаемоеЗначение.Количество() = 0 Тогда
		ВозвращаемоеЗначение = Неопределено;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытаФормаРедактированияТекстаЗаключенияКомиссии(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаключениеКомиссии = ВыбранноеЗначение;
	
	ПолеПриИзменении(Элементы.ЗаключениеКомиссии);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытаФормаВыбораЗаключенияКомиссии(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗаключения = ИнвентаризацияВызовСервера.ПолучитьТекстЗаключенияКомиссииПоОписи(ВыбранноеЗначение);
	
	ЗаключениеКомиссии = ТекстЗаключения;
	
	ПолеПриИзменении(Элементы.ЗаключениеКомиссии);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьРеквизитовАктаСверки()
	
	НовДоступность = (ПодтверждениеАктомСверки = 1);
	
	Элементы.ДатаАктаСверки.Доступность = НовДоступность;
	Элементы.НомерАктаСверки.Доступность = НовДоступность;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИныеНастройкиАктаСверки(ИмяИзмененногоЭлемента)
	
	Если ИмяИзмененногоЭлемента = "ОчиститьВсеСуммыПриОтсутствииАктаСверки" Тогда
		ФлажокПодтверждениеАктомСверки = Ложь;
		ПодтверждениеАктомСверки = 0;
		ДатаАктаСверки = Неопределено;
		НомерАктаСверки = Неопределено;
		
		НастроитьДоступностьРеквизитовАктаСверки();
		
	ИначеЕсли ИмяИзмененногоЭлемента = "ПодтверждениеАктомСверки"
		Или ИмяИзмененногоЭлемента = "ФлажокПодтверждениеАктомСверки" Тогда
		ОчиститьВсеСуммыПриОтсутствииАктаСверки = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#Область ОтражениеПросроченнойИДолгосрочнойЗадолженности

&НаСервере
Процедура ЗаполнитьСписокВыбораКодаПричиныОбразования()
	
	ПричиныОбразования = БухгалтерскийУчет.ПереченьПричинПросроченнойЗадолженности(Параметры.СвязиПараметровВыбора.ВидЗадолженности);
	
	Элементы.ПричинаОбразованияКод.СписокВыбора.ЗагрузитьЗначения(ПричиныОбразования);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияТекстаОтраженияЗадолженности(Элемент, СтандартнаяОбработка)
	
	ИмяПоля = Элемент.Имя;
	
	Если ИмяПоля = "ПричинаОбразованияПояснение" Тогда
		ЗаголовокПоля = НСтр("ru='Причина возникновения задолженности'");
	ИначеЕсли ИмяПоля = "ПричинаОбразованияДополнительно" Тогда
		ЗаголовокПоля = НСтр("ru='Дополнительное описание причины возникновения задолженности'");
	Иначе
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеПоля = ЭтотОбъект[ИмяПоля];
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяПоля", ИмяПоля);
	
	Оповещение = Новый ОписаниеОповещения("ВведенТекстОтраженияЗадолженности", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, ЗначениеПоля, ЗаголовокПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура ВведенТекстОтраженияЗадолженности(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = ДополнительныеПараметры.ИмяПоля;
	
	ЭтотОбъект[ИмяПоля] = ВыбранноеЗначение;
	
	Модифицированность = Истина;
	
	ПолеПриИзменении(Элементы[ИмяПоля]);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
