#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФорму();
	
	Если Не ЕстьСохраненныеНастройкиФормы() Тогда
		// При отсутствии сохраненных настроек не будет вызван обработчик ПриЗагрузкеДанныхИзНастроекНаСервере.
		ОбновитьДанныеСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьФормуПослеОбновления();
	
	НастроитьФормуНастройкиКомментария();
	
	НастроитьФормуНастройкиОтбораПоКодуФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Игнорируем сохраненные в настройках формы реквизиты,
	// если такое требование установлено в вызывающей процедуре.
	
	ПрименитьЯвноУказанныеЗначенияПараметров();
	
	ОбновитьДанныеСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьОшибкиЦепочкиНажатие(Элемент)
	
	ИнвентаризацияКлиент.ПоказатьОшибкиЦепочки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РешениеПриИзменении(Элемент)
	
	ОбновитьДанныеКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьСтрокиПоСчетам0510466ПриИзменении(Элемент)
	
	УстановитьЗаголовокГруппыОбъединитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьСтрокиПоСчетам0510468ПриИзменении(Элемент)
	
	УстановитьЗаголовокГруппыОбъединитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьСтрокиПоСчетам0510469ПриИзменении(Элемент)
	
	УстановитьЗаголовокГруппыОбъединитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьСтрокиПоСчетам0510471ПриИзменении(Элемент)
	
	УстановитьЗаголовокГруппыОбъединитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьСтрокиПоСчетам0510472ПриИзменении(Элемент)
	
	УстановитьЗаголовокГруппыОбъединитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьСтрокиПоСчетам0510473ПриИзменении(Элемент)
	
	УстановитьЗаголовокГруппыОбъединитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьСтрокиПоСчетам0510474ПриИзменении(Элемент)
	
	УстановитьЗаголовокГруппыОбъединитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьСтрокиПоМестамИнвентаризации0510466ПриИзменении(Элемент)
	
	УстановитьЗаголовокГруппыОбъединитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстанавливатьКомментарийПриИзменении(Элемент)
	
	НастроитьФормуНастройкиКомментария();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонКомментарияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПоказатьТекстовуюСтроку(Элементы.ШаблонКомментария.ТекстРедактирования,
		НСтр("ru='Комментарий документов'"), Истина, "ШаблонКомментария");
	
КонецПроцедуры

// Настройки отбора по коду формы.

&НаКлиенте
Процедура УстановленОтборПоКодуФормыПриИзменении(Элемент)
	
	Если Не УстановленОтборПоКодуФормы Тогда
		УстановитьЗначениеОтбиратьПоКодуФормы61н(Ложь);
		УстановитьЗначениеОтбиратьПоКодуФормы52н(Ложь);
	КонецЕсли;
	
	НастроитьФормуНастройкиОтбораПоКодуФормы();
	
	НастроитьФормуТребуетсяОбновлениеОтборПоКодуФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0510464ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы61н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0510465ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы61н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0510466ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы61н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0510467ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы61н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0510468ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы61н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0510469ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы61н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0510470ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы61н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0510471ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы61н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0510472ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы61н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0510473ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы61н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0510474ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы61н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0504081ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы52н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0504082ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы52н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0504083ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы52н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0504084ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы52н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0504085ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы52н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0504086ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы52н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0504087ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы52н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0504088ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы52н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0504089ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы52н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьПоКодуФормы0504091ПриИзменении(Элемент)
	
	ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы52н();
	
КонецПроцедуры

&НаКлиенте
Процедура ИскатьОписиПоПриказу52нПриИзменении(Элемент)
	
	НастроитьФормуТребуетсяОбновлениеИскатьОписиПоПриказу52();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаРешения

&НаКлиенте
Процедура ТаблицаРешенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТаблицы = ТаблицаРешения.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ИмяПоля = СтрЗаменить(Поле.Имя, "ТаблицаРешения", "");
	
	Если ИмяПоля = "ПредставлениеОписи" Тогда
		Если СтрокаТаблицы.МассивОписанийОписей.Количество() > 1 Тогда
			ПоказатьСписокДокументовОписей(СтрокаТаблицы);
		КонецЕсли;
		
		Если СтрокаТаблицы.МассивОписанийОписей.Количество() = 1 Тогда
			ПоказатьЗначение(, СтрокаТаблицы.МассивОписанийОписей[0].Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоля = "КартинкаИндикатораОписи" Тогда
		Если СтрокаТаблицы.КодИндикатораОписи = СостоянияИндикатораОписи.Ожидается.Код Тогда
			ПоказатьПредупреждение(, НСтр("ru='Необходимо сформировать документ описи.'"));
			
		ИначеЕсли СтрокаТаблицы.КодИндикатораОписи = СостоянияИндикатораОписи.НеПредусмотреноЗаконодательством.Код Тогда
			ПоказатьПредупреждение(, НСтр("ru='Для указанного счета не определен код формы.'"));
			
		ИначеЕсли СтрокаТаблицы.КодИндикатораОписи = СостоянияИндикатораОписи.НеПредусмотреноОбработкой.Код Тогда
			ПоказатьПредупреждение(, НСтр("ru='Для указанного счета групповое формирование описей в программе не предусмотрено.'"));
			
		ИначеЕсли СтрокаТаблицы.КодИндикатораОписи = СостоянияИндикатораОписи.ДокументСозданНеПроведен.Код Тогда
			ПоказатьПредупреждение(, НСтр("ru='Документ описи сформирован, не проведен.'"));
			
		ИначеЕсли СтрокаТаблицы.КодИндикатораОписи = СостоянияИндикатораОписи.ДокументСозданПроведен.Код Тогда
			ПоказатьПредупреждение(, НСтр("ru='Документ описи сформирован, проведен.'"));
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоля = "КартинкаИндикатораОшибки" Тогда
		Если СтрокаТаблицы.КодИндикатораОшибки = СостоянияИндикатораОшибки.НесколькоДокументовОдногоВида.Код Тогда
			ПоказатьПредупреждение(, НСтр("ru='Обнаружено несколько документов описей одного и того же кода формы.'"));
			
		ИначеЕсли СтрокаТаблицы.КодИндикатораОшибки = СостоянияИндикатораОшибки.НеПредусмотреноЗаконодательством.Код Тогда
			ПоказатьПредупреждение(, НСтр("ru='Для указанного счета не определен код формы.'"));
			
		ИначеЕсли СтрокаТаблицы.КодИндикатораОшибки = СостоянияИндикатораОшибки.НеПредусмотреноОбработкой.Код Тогда
			ПоказатьПредупреждение(, НСтр("ru='Для указанного счета групповое формирование описей в программе не предусмотрено.'"));
			
		ИначеЕсли СтрокаТаблицы.КодИндикатораОшибки = СостоянияИндикатораОшибки.НетПрав.Код Тогда
			ПоказатьСообщениеОбОтсутствииПравСозданияОписи(СтрокаТаблицы);
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоля = "КодФормы" Тогда
		ПоказатьВыбранныеКодыФормВСтрокеТаблицы(СтрокаТаблицы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_НесопоставленныеОписи

&НаКлиенте
Процедура ТаблицаНесопоставленныхОписейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТаблицы = ТаблицаНесопоставленныхОписей.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ИмяПоля = СтрЗаменить(Поле.Имя, "ТаблицаНесопоставленныхОписей", "");
	
	Если ИмяПоля = "ПредставлениеОписи" Тогда
		ПоказатьЗначение(, СтрокаТаблицы.ОписьСсылка);
	КонецЕсли;
	
	Если ИмяПоля = "Комментарий" Тогда
		Если ЗначениеЗаполнено(СтрокаТаблицы.Комментарий) Тогда
			ПоказатьТекстовуюСтроку(СтрокаТаблицы.Комментарий, НСтр("ru='Комментарий'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НадписьНесопоставленныеОписи(Команда)
	
	Текст1 = НСтр("ru='Эти документы описей введены на основании указанного Решения, но заполнены так, '");
	Текст2 = НСтр("ru='что не могут быть сопоставлены с какой-либо строкой Решения.'");
	Текст3 = НСтр("ru='Подробнее см. описание в колонке Комментарий.'");
	Текст4 = НСтр("ru='Например, документ Решения был изменен после заполнения документа описи.'");
	
	ПоказатьПредупреждение(, СтрШаблон("%1%2
		|
		|%3
		|
		|%4", Текст1, Текст2, Текст3, Текст4));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметку(Команда)
	
	ПроверитьИУстановитьЗначениеОтметки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	
	ПроверитьИУстановитьЗначениеОтметки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ОбновитьДанныеКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОписи(Команда)
	
	ПроверитьИСформироватьОписи();
	
КонецПроцедуры

#Область МенюПоказать

&НаКлиенте
Процедура ПоказатьОшибки(Команда)
	
	НастроитьОтборСтрокТаблицыРешения("ПоказатьОшибки");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОжидается(Команда)
	
	НастроитьОтборСтрокТаблицыРешения("ПоказатьОжидается");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСозданНеПроведен(Команда)
	
	НастроитьОтборСтрокТаблицыРешения("ПоказатьСозданНеПроведен");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСозданЛюбой(Команда)
	
	НастроитьОтборСтрокТаблицыРешения("ПоказатьСозданЛюбой");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСозданПроведен(Команда)
	
	НастроитьОтборСтрокТаблицыРешения("ПоказатьСозданПроведен");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНеПредусмотреноЗаконодательством(Команда)
	
	НастроитьОтборСтрокТаблицыРешения("ПоказатьНеПредусмотреноЗаконодательством");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНеПредусмотреноОбработкой(Команда)
	
	НастроитьОтборСтрокТаблицыРешения("ПоказатьНеПредусмотреноОбработкой");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСписокВыбораИзмененВручную(Команда)
	
	НастроитьОтборСтрокТаблицыРешения("ПоказатьСписокВыбораИзмененВручную");
	
КонецПроцедуры

#КонецОбласти

#Область ОкноНастроек

&НаКлиенте
Процедура УстановитьОбъединение(Команда)
	
	УстановитьЗначениеНастроекОбъединения(Истина);
	
	УстановитьЗаголовокГруппыОбъединитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОбъединение(Команда)
	
	УстановитьЗначениеНастроекОбъединения(Ложь);
	
	УстановитьЗаголовокГруппыОбъединитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединениеПоУмолчанию(Команда)
	
	УстановитьЗначениеНастроекОбъединения(Неопределено);
	
	УстановитьЗаголовокГруппыОбъединитьСтроки();
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьКомментарийПоУмолчанию(Команда)
	
	ПодтвердитьИУстановитьКомментарийПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДоступныеПараметрыШаблона(Команда)
	
	ПоказатьТекстовуюСтроку(ПодсказкаДоступныеПараметрыШаблона, НСтр("ru='Доступные параметры шаблона'"));
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьОтборПоКодуФормы61н(Команда)
	
	УстановитьЗначениеОтбиратьПоКодуФормы61н(Истина);
	
	УстановитьЗаголовокНастроекОтбораПоКодуФормы61н();
	
	НастроитьФормуТребуетсяОбновлениеОтборПоКодуФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтборПоКодуФормы61н(Команда)
	
	УстановитьЗначениеОтбиратьПоКодуФормы61н(Ложь);
	
	УстановитьЗаголовокНастроекОтбораПоКодуФормы61н();
	
	НастроитьФормуТребуетсяОбновлениеОтборПоКодуФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоКодуФормы52н(Команда)
	
	УстановитьЗначениеОтбиратьПоКодуФормы52н(Истина);
	
	УстановитьЗаголовокНастроекОтбораПоКодуФормы52н();
	
	НастроитьФормуТребуетсяОбновлениеОтборПоКодуФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтборПоКодуФормы52н(Команда)
	
	УстановитьЗначениеОтбиратьПоКодуФормы52н(Ложь);
	
	УстановитьЗаголовокНастроекОтбораПоКодуФормы52н();
	
	НастроитьФормуТребуетсяОбновлениеОтборПоКодуФормы();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Инициализация

&НаСервере
Процедура ИнициализироватьФорму()
	
	ШаблонКомментарияПоУмолчанию = ПолучитьШаблонКомментарияПоУмолчанию();
	ПодсказкаДоступныеПараметрыШаблона = ПолучитьПодсказкуПараметрыШаблонаКомментария();
	
	ШаблонКомментария = ШаблонКомментарияПоУмолчанию; // Значение по умолчанию, сохраняется в настройках формы.
	УстанавливатьКомментарий = Ложь; // Значение по умолчанию, сохраняется в настройках формы.
	
	ЗагрузитьПереданныеПараметры();
	
	УстановитьУсловноеОформление();
	
	КэшироватьНастройкиОбъединенияСтрокПоУмолчанию();
	
	СостоянияИндикатораОписи = Новый ФиксированнаяСтруктура(НовыйСостоянияИндикатораОписи());
	СостоянияИндикатораОшибки = Новый ФиксированнаяСтруктура(НовыйСостоянияИндикатораОшибки());
	
	СброситьНадписиНеобходимоОбновить();
	
	ЦветФонаНедоступнойТаблицы = ПолучитьЦветФонаНедоступнойТаблицы();
	
	Элементы.ГруппаНесопоставленныеОписи.Видимость = Ложь;
	Элементы.ТаблицаРешенияПоказатьСписокВыбораИзмененВручную.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПереданныеПараметры()
	
	ДокументСсылка = Параметры.ДокументСсылка;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РешениеОПроведенииИнвентаризации") Тогда
		Решение = ДокументСсылка;
		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ИзменениеРешенияОПроведенииИнвентаризации") Тогда
		Решение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Решение");
	КонецЕсли;
	
	ЗагрузитьОтборМассивКодовФорм();
	
	ИнициализироватьФлажкиОтбиратьПоКодуФормы();
	
	ВыводитьТолькоФормируемыеКодыФорм = Истина; // Значение по умолчанию, сохраняется в настройках формы.
	ИскатьОписиПоПриказу52н = Ложь; // Значение по умолчанию, сохраняется в настройках формы.
	
	ПрименитьЯвноУказанныеЗначенияПараметров();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОтборМассивКодовФорм()
	
	ПараметрОтборМассивКодовФорм = Параметры.ОтборМассивКодовФорм;
	
	ВремМассив = Новый Массив();
	
	Если ТипЗнч(ПараметрОтборМассивКодовФорм) = Тип("Массив") Тогда
		ВремМассив = ПараметрОтборМассивКодовФорм;
		
	ИначеЕсли ТипЗнч(ПараметрОтборМассивКодовФорм) = Тип("ФиксированныйМассив") Тогда
		ВремМассив = Новый Массив(ПараметрОтборМассивКодовФорм);
		
	ИначеЕсли ТипЗнч(ПараметрОтборМассивКодовФорм) = Тип("Строка") Тогда
		ВремМассив = СтрРазделить(ПараметрОтборМассивКодовФорм, ", ", Ложь);
	КонецЕсли;
	
	ОтборМассивКодовФорм = Новый ФиксированныйМассив(ВремМассив);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФлажкиОтбиратьПоКодуФормы()
	
	УстановленныеФлажки61н = ОбщегоНазначенияИСКлиентСервер.ПересечениеМассивов(
		НовыйКодыФормПредусмотреныНастройкиОтбора61н(), ОтборМассивКодовФорм);
	
	УстановитьЗначениеОтбиратьПоКодуФормы(ЭтотОбъект, Истина, УстановленныеФлажки61н);
	
	УстановленныеФлажки52н = ОбщегоНазначенияИСКлиентСервер.ПересечениеМассивов(
		НовыйКодыФормПредусмотреныНастройкиОтбора52н(), ОтборМассивКодовФорм);
		
	УстановитьЗначениеОтбиратьПоКодуФормы(ЭтотОбъект, Истина, УстановленныеФлажки52н);
	
	УстановленОтборПоКодуФормы = УстановленныеФлажки61н.Количество() > 0
		Или УстановленныеФлажки52н.Количество() > 0;
	
КонецПроцедуры

&НаСервере
Процедура КэшироватьНастройкиОбъединенияСтрокПоУмолчанию()
	
	// Предназначено для быстрой установки реквизитов формы настроек объединения строк.
	// Здесь инициализируются те реквизиты, которые есть на форме.
	
	НастройкиОбъединенияСтрокНаФорме = НовыйНастройкиОбъединенияСтрокНаФорме();
	
	ТаблицаНастроек = ИнвентаризацияСервер.ПолучитьТаблицуНастроекЗаполненияОписейПоРешению();
	
	Поиск = Новый Структура("КодФормы");
	
	ЗначенияРеквизитов = Новый Структура();
	
	Для Каждого КодФормы Из НастройкиОбъединенияСтрокНаФорме.ОбщийСписокКодовФорм Цикл
		Поиск.КодФормы = КодФормы;
		
		МассивСтрок = ТаблицаНастроек.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяДокумента = МассивСтрок[0].ИмяДокумента; // Для описей 61н одному коду формы соответствует ровно один документ.
		
		НастройкиПоУмолчанию = ИнвентаризацияСервер.ПолучитьНастройкиОбъединенияСтрокДляВыбораИзРешения(ИмяДокумента);
		
		ПредусмотренРеквизитФормыПоСчету				= (НастройкиОбъединенияСтрокНаФорме.ПоСчетам.Найти(КодФормы) <> Неопределено);
		ПредусмотренРеквизитФормыПоМестуИнвентаризации	= (НастройкиОбъединенияСтрокНаФорме.ПоМестамИнвентаризации.Найти(КодФормы) <> Неопределено);
		
		Если ПредусмотренРеквизитФормыПоСчету Тогда
			ИмяФлажкаСчет = ПолучитьИмяФлажкаНастройкиОбъединенияПоСчетам(КодФормы);
			
			ЗначенияРеквизитов.Вставить(ИмяФлажкаСчет, НастройкиПоУмолчанию.ПоСчетам);
		КонецЕсли;
		
		Если ПредусмотренРеквизитФормыПоМестуИнвентаризации Тогда
			ИмяФлажкаМестоИнвентаризации = ПолучитьИмяФлажкаНастройкиОбъединенияПоМестамИнвентаризации(КодФормы);
			
			ЗначенияРеквизитов.Вставить(ИмяФлажкаМестоИнвентаризации, НастройкиПоУмолчанию.ПоМестамИнвентаризации);
		КонецЕсли;
	КонецЦикла;
	
	НастройкиОбъединенияСтрокПоУмолчанию = Новый ФиксированнаяСтруктура(ЗначенияРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ДобавитьУсловноеОформление_ДоступностьПоляОтметка();
	
	ДобавитьУсловноеОформление_ПредставлениеКФО0("ТаблицаРешения");
	ДобавитьУсловноеОформление_ПредставлениеКФО0("ТаблицаНесопоставленныхОписей");
	
	ДобавитьУсловноеОформление_ПредставлениеНезаполненногоНомераКомиссии("ТаблицаРешения");
	ДобавитьУсловноеОформление_ПредставлениеНезаполненногоНомераКомиссии("ТаблицаНесопоставленныхОписей");
	
	ДобавитьУсловноеОформление_ПредставлениеНезаполненногоНомераРабочейКомиссии("ТаблицаРешения");
	ДобавитьУсловноеОформление_ПредставлениеНезаполненногоНомераРабочейКомиссии("ТаблицаНесопоставленныхОписей");
	
	ДобавитьУсловноеОформление_СписокВыбораИзмененВручную();
	
	ДобавитьУсловноеОформление_ВыделитьНесопоставленныеПоляОписи();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_ДоступностьПоляОтметка()
	
	НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = НСтр("ru='Доступность поля Отметка'");
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаРешения.ОтметкаДоступна");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаРешенияОтметка");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_ПредставлениеКФО0(ИмяТаблицы)
	
	НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = СтрШаблон(НСтр("ru='Представление КФО 0 в таблице %1'"), ИмяТаблицы);
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".КФО");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "0");
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "КФО");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_ПредставлениеНезаполненногоНомераКомиссии(ИмяТаблицы)
	
	НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = СтрШаблон(НСтр("ru='Представление незаполненной комиссии как ""0"" в таблице %1'"), ИмяТаблицы);
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".НомерКомиссии");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "0");
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "НомерКомиссии");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_ПредставлениеНезаполненногоНомераРабочейКомиссии(ИмяТаблицы)
	
	НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = СтрШаблон(НСтр("ru='Представление незаполненной рабочей комиссии как ""00"" в таблице %1'"), ИмяТаблицы);
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".НомерРабочейКомиссии");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "00");
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "НомерРабочейКомиссии");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_ВыделитьНесопоставленныеПоляОписи()
	
	ШаблонПредставление = НСтр("ru='Выделение несопоставленной колонки %1 в строке несопоставленной описи.'");
	
	ШаблонКолонкиВыделить = "ВыделитьКолонку%1";
	
	ИменаПолей = СтрРазделить("КФО,Счет,Сотрудник,ДатаИнвентаризации,ДатаНачала,ДатаОкончания"
		+ ",НомерКомиссии,НомерРабочейКомиссии,МестоИнвентаризации,КодФормы", ", ", Ложь);
	
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
		НовыйЭлементУО.Представление = СтрШаблон(НСтр("ru='Выделение несопоставленной колонки %1 в строке несопоставленной описи.'"), ИмяПоля);
		
		ИмяКолонкиВыделить = СтрШаблон(ШаблонКолонкиВыделить, ИмяПоля);
		
		// Условие
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("ТаблицаНесопоставленныхОписей.%1", ИмяКолонкиВыделить));
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Истина;
		
		// Оформление
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
		
		// Оформляемые поля
		ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаНесопоставленныхОписей" + ИмяПоля);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление_СписокВыбораИзмененВручную()
	
	ИмяТаблицы = "ТаблицаРешения";
	
	ШрифтЖирный = Новый Шрифт(,, Истина);
	ЧерныйЦвет = Новый Цвет();
	
	// 1.
	НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = НСтр("ru='Вывод фактического списка выбора кода формы, если список выбора изменен вручную.'");
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".СписокВыбораИзмененВручную");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;
	
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".КодФормыСозданиеВыбрано");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".КодФормыСозданиеВыбрано"));
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтЖирный);
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЧерныйЦвет);
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "КодФормы");
	
	
	// 2.
	НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = НСтр("ru='Вывод кода формы при пустом списке выбора.'");
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".СписокВыбораИзмененВручную");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;
	
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяТаблицы + ".КодФормыСозданиеВыбрано");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='(не выбрано)'"));
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтЖирный);
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЧерныйЦвет);
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "КодФормы");
	
КонецПроцедуры

#КонецОбласти

#Область СохраненныеНастройкиФормы

&НаСервере
Функция ЕстьСохраненныеНастройкиФормы()
	
	Отбор = Новый Структура();
	Отбор.Вставить("Пользователь", ПользователиИнформационнойБазы.ТекущийПользователь());
	Отбор.Вставить("КлючОбъекта", ИмяФормы + "/ТекущиеДанные");
	
	Выборка = ХранилищеСистемныхНастроек.Выбрать(Отбор);
	
	Пока Выборка.Следующий() Цикл
	    Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ПрименитьЯвноУказанныеЗначенияПараметров()
	
	// Применяется для параметров с допустимыми значениями Неопределено, Истина, Ложь.
	
	ИменаПараметров = Новый Массив();
	ИменаПараметров.Добавить("ВыводитьТолькоФормируемыеКодыФорм");
	ИменаПараметров.Добавить("ИскатьОписиПоПриказу52н");
	
	Для Каждого ИмяПараметра Из ИменаПараметров Цикл
		ЗначениеУказаноЯвно = Параметры[ИмяПараметра] <> Неопределено;
		
		Если ЗначениеУказаноЯвно Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ИмяПараметра);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОтборСтрокТаблицыРешения

&НаКлиенте
Процедура НастроитьОтборСтрокТаблицыРешения(ИмяКоманды)
	
	ЭлементКнопки = Элементы["ТаблицаРешения" + ИмяКоманды];
	
	ЭлементКнопки.Пометка = Не ЭлементКнопки.Пометка;
	
	НовыйОтборСтрок = Новый Структура(Элементы.ТаблицаРешения.ОтборСтрок);
	
	Если НовыйОтборСтрок = Неопределено Тогда
		НовыйОтборСтрок = Новый Структура();
	КонецЕсли;
	
	Если ИмяКоманды = "ПоказатьОшибки" Тогда
		ИмяСвойства = "ЕстьОшибка";
		
		Если ЭлементКнопки.Пометка Тогда
			НовыйОтборСтрок.Вставить(ИмяСвойства, Истина);
			
		ИначеЕсли НовыйОтборСтрок.Свойство(ИмяСвойства) Тогда
			НовыйОтборСтрок.Удалить(ИмяСвойства);
		КонецЕсли;
		
	ИначеЕсли ИмяКоманды = "ПоказатьСписокВыбораИзмененВручную" Тогда
		ИмяСвойства = "СписокВыбораИзмененВручную";
		
		Если ЭлементКнопки.Пометка Тогда
			НовыйОтборСтрок.Вставить(ИмяСвойства, Истина);
			
		ИначеЕсли НовыйОтборСтрок.Свойство(ИмяСвойства) Тогда
			НовыйОтборСтрок.Удалить(ИмяСвойства);
		КонецЕсли;

	// Эти команды отбора являются взаимоисключающими.
	ИначеЕсли ИмяКоманды = "ПоказатьОжидается"
		Или ИмяКоманды = "ПоказатьСозданПроведен"
		Или ИмяКоманды = "ПоказатьСозданНеПроведен"
		Или ИмяКоманды = "ПоказатьСозданЛюбой"
		Или ИмяКоманды = "ПоказатьНеПредусмотреноЗаконодательством"
		Или ИмяКоманды = "ПоказатьНеПредусмотреноОбработкой" Тогда
		НастроитьОтборСтрокТаблицыРешенияДляВзаимоисключающихКоманд(НовыйОтборСтрок, ИмяКоманды, ЭлементКнопки);
	КонецЕсли;
	
	Если НовыйОтборСтрок.Количество() > 0 Тогда
		НовыйОтборСтрок = Новый ФиксированнаяСтруктура(НовыйОтборСтрок);
	Иначе
		НовыйОтборСтрок = Неопределено;
	КонецЕсли;
	
	Элементы.ТаблицаРешения.ОтборСтрок = НовыйОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборСтрокТаблицыРешенияДляВзаимоисключающихКоманд(НовыйОтборСтрок, ИмяКоманды, ЭлементКнопки)
	
	Если ИмяКоманды = "ПоказатьОжидается"
		Или ИмяКоманды = "ПоказатьСозданПроведен"
		Или ИмяКоманды = "ПоказатьСозданНеПроведен"
		Или ИмяКоманды = "ПоказатьНеПредусмотреноЗаконодательством"
		Или ИмяКоманды = "ПоказатьНеПредусмотреноОбработкой" Тогда
		
		ИмяСвойства = "КодИндикатораОписи";
		
		Если ИмяКоманды = "ПоказатьОжидается" Тогда
			ЗначениеСвойства = СостоянияИндикатораОписи.Ожидается.Код;
			
		ИначеЕсли ИмяКоманды = "ПоказатьСозданПроведен" Тогда
			ЗначениеСвойства = СостоянияИндикатораОписи.ДокументСозданПроведен.Код;
			
		ИначеЕсли ИмяКоманды = "ПоказатьСозданНеПроведен" Тогда
			ЗначениеСвойства = СостоянияИндикатораОписи.ДокументСозданНеПроведен.Код;
			
		ИначеЕсли ИмяКоманды = "ПоказатьНеПредусмотреноЗаконодательством" Тогда
			ЗначениеСвойства = СостоянияИндикатораОписи.НеПредусмотреноЗаконодательством.Код;
			
		ИначеЕсли ИмяКоманды = "ПоказатьНеПредусмотреноОбработкой" Тогда
			ЗначениеСвойства = СостоянияИндикатораОписи.НеПредусмотреноОбработкой.Код;
		КонецЕсли;
		
		ИмяСвойстваКор = "ЕстьСопоставленныеОписи";
		
	ИначеЕсли ИмяКоманды = "ПоказатьСозданЛюбой" Тогда
		
		ИмяСвойства = "ЕстьСопоставленныеОписи";
		ЗначениеСвойства = Истина;
		
		ИмяСвойстваКор = "КодИндикатораОписи";
	КонецЕсли;
	
	Если ЭлементКнопки.Пометка Тогда
		НовыйОтборСтрок.Вставить(ИмяСвойства, ЗначениеСвойства);
		
		СнятьПометкуКнопокОтбораСтрокСостоянияИндикатораОписи(ИмяКоманды);
		
		Если НовыйОтборСтрок.Свойство(ИмяСвойстваКор) Тогда
			НовыйОтборСтрок.Удалить(ИмяСвойстваКор);
		КонецЕсли;
		
	ИначеЕсли НовыйОтборСтрок.Свойство(ИмяСвойства) Тогда
		НовыйОтборСтрок.Удалить(ИмяСвойства);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкуКнопокОтбораСтрокСостоянияИндикатораОписи(ИмяИсключаемойКнопки)
	
	ИменаКнопок = СтрРазделить(
		"ПоказатьОжидается,ПоказатьСозданПроведен,ПоказатьСозданНеПроведен,ПоказатьСозданЛюбой"
		+ ",ПоказатьНеПредусмотреноЗаконодательством,ПоказатьНеПредусмотреноОбработкой",
		", ", Ложь);
	
	Индекс = ИменаКнопок.Найти(ИмяИсключаемойКнопки);
	
	ИменаКнопок.Удалить(Индекс);
	
	Для Каждого ИмяКнопки Из ИменаКнопок Цикл
		Элементы["ТаблицаРешения" + ИмяКнопки].Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыРешения

&НаКлиенте
Процедура ПоказатьСписокДокументовОписей(СтрокаТаблицы)
	
	Список = Новый СписокЗначений();
	
	Для Каждого ОписаниеОписи Из СтрокаТаблицы.МассивОписанийОписей Цикл
		КартинкаОписи = ?(ОписаниеОписи.Проведен, БиблиотекаКартинок.Провести, БиблиотекаКартинок.Документ);
		
		НовыйЭлемент = Список.Добавить(ОписаниеОписи.Ссылка,,, КартинкаОписи);
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбранДокументОписиИзСписка", ЭтотОбъект);
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, Список, Элементы.ТаблицаРешенияПредставлениеОписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранДокументОписиИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ВыбранныйЭлемент.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыбранныеКодыФормВСтрокеТаблицы(СтрокаТаблицы)
	
	Если СтрокаТаблицы.МассивКодовФормСозданиеНеобходимо.Количество() <= 1 Тогда
		// Выбирать тут нечего.
		Возврат;
	КонецЕсли;
	
	КодыФормОписей = ПолучитьКодыФормОписейВСтрокеТаблицы(СтрокаТаблицы);
	
	СписокВыбора = Новый СписокЗначений();
	
	Для Каждого КодФормы Из СтрокаТаблицы.МассивКодовФормСозданиеПредусмотрено Цикл
		КодВыбран = (СтрокаТаблицы.МассивКодовФормСозданиеВыбрано.Найти(КодФормы) <> Неопределено);
		
		НовыйЭлемент = СписокВыбора.Добавить(КодФормы,, КодВыбран);
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("СтрокаТаблицы", СтрокаТаблицы);
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьВыбранныеКодыФормВСтрокеТаблицыВыбор", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("СписокВыбора", СписокВыбора);
	ПараметрыФормы.Вставить("КодыФормОписей", КодыФормОписей);
	ПараметрыФормы.Вставить("КодыФормНетПрав", МассивКодовФормНетПрав);
	ПараметрыФормы.Вставить("ОтборМассивКодовФорм", ОтборМассивКодовФорм);
	
	ОткрытьФорму("ОбщаяФорма.ПометкиКодовФормОписей", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВыбранныеКодыФормВСтрокеТаблицыВыбор(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьДоступныеНеПомеченные	= ВыбранноеЗначение.ЕстьДоступныеНеПомеченные;
	ПомеченныеКодыФорм			= ВыбранноеЗначение.ПомеченныеКодыФорм;
	
	СтрокаТаблицы = ДополнительныеПараметры.СтрокаТаблицы;
	
	СтрокаТаблицы.МассивКодовФормСозданиеВыбрано = Новый ФиксированныйМассив(ПомеченныеКодыФорм);
	СтрокаТаблицы.КодФормыСозданиеВыбрано = СтрСоединить(ПомеченныеКодыФорм, ", ");
	
	КоличествоКодов = ПомеченныеКодыФорм.Количество();
	
	Если КоличествоКодов = 0 Тогда
		СтрокаТаблицы.Отметка = Ложь;
	КонецЕсли;
	
	СтрокаТаблицы.ОтметкаДоступна = (КоличествоКодов > 0);
	
	СтрокаТаблицы.СписокВыбораИзмененВручную = ЕстьДоступныеНеПомеченные;
	
	// Кнопка отбора строк таблицы Решения.
	Если ЕстьДоступныеНеПомеченные Тогда
		Элементы.ТаблицаРешенияПоказатьСписокВыбораИзмененВручную.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКодыФормОписейВСтрокеТаблицы(СтрокаТаблицы)
	
	КодыФормОписей = Новый Массив();
	
	Для Каждого ОписаниеОписи Из СтрокаТаблицы.МассивОписанийОписей Цикл
		КодФормы = ОписаниеОписи.КодФормы;
		
		Если КодыФормОписей.Найти(КодФормы) = Неопределено Тогда
			КодыФормОписей.Добавить(КодФормы);
		КонецЕсли;
	КонецЦикла;
	
	Возврат КодыФормОписей;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСообщениеОбОтсутствииПравСозданияОписи(СтрокаТаблицы)
	
	КодыФормОписей = ПолучитьКодыФормОписейВСтрокеТаблицы(СтрокаТаблицы);
	
	СозданиеНеобходимо = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		СтрокаТаблицы.МассивКодовФормСозданиеПредусмотрено, КодыФормОписей);
	
	Если УстановленОтборПоКодуФормы Тогда
		СозданиеНеобходимо = ОбщегоНазначенияИСКлиентСервер.ПересечениеМассивов(СозданиеНеобходимо, ОтборМассивКодовФорм);
	КонецЕсли;
	
	МассивКодов = ОбщегоНазначенияИСКлиентСервер.ПересечениеМассивов(СозданиеНеобходимо, МассивКодовФормНетПрав);
	
	КоличествоКодов = МассивКодов.Количество();
	
	Если КоличествоКодов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если КоличествоКодов = 1 Тогда
		Шаблон = НСтр("ru='описи %1'");
		
	ИначеЕсли КоличествоКодов > 1 Тогда
		Шаблон = НСтр("ru='описей %1'");
	КонецЕсли;
	
	ТекстКодыФорм = СтрШаблон(Шаблон, СтрСоединить(МассивКодов, ", "));
	
	ТекстСообщения = СтрШаблон(НСтр("ru='Отсутствует право создания %1.'"), ТекстКодыФорм);
	
	ПоказатьПредупреждение(, ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область ОтметкаСтрок

&НаКлиенте
Процедура ПроверитьИУстановитьЗначениеОтметки(ЗначениеОтметки)
	
	ВыделенныеСтроки = Элементы.ТаблицаРешения.ВыделенныеСтроки;
	
	КоличествоВыделенных = ВыделенныеСтроки.Количество();
	
	Если КоличествоВыделенных = 0 Или КоличествоВыделенных = 1 Тогда
		УстановитьЗначениеОтметки(ЗначениеОтметки, Неопределено, Истина);
	Иначе
		УстановитьЗначениеОтметки(ЗначениеОтметки, ВыделенныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеОтметки(ЗначениеОтметки, ВыделенныеСтроки, ОбработатьВсеСтроки = Ложь)
	
	Если ОбработатьВсеСтроки Тогда
		// Некоторые строки могут быть не видны из-за установленной строки поиска или расширенного поиска.
		// Определить этот факт на сервере нельзя, поэтому видимые строки определятся только на клиенте.
		// Да, это может работать медленно.
		
		ЭлементТаблицаРешения = Элементы.ТаблицаРешения;
		
		Для Каждого СтрокаТаблицы Из ТаблицаРешения Цикл
			Если ЭлементТаблицаРешения.ПроверитьСтроку(СтрокаТаблицы.ПолучитьИдентификатор()) <> Истина Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаТаблицы.ОтметкаДоступна Тогда
				СтрокаТаблицы.Отметка = ЗначениеОтметки;
			КонецЕсли;
		КонецЦикла;
		
		Возврат;
	КонецЕсли;	
	
	ОграничениеКлиента = 200;
		
	КоличествоВыделенныхСтрок = ВыделенныеСтроки.Количество();
	
	Если КоличествоВыделенныхСтрок > ОграничениеКлиента Тогда
		УстановитьЗначениеОтметкиСервер(ЗначениеОтметки, ВыделенныеСтроки);
	Иначе
		УстановитьЗначениеОтметкиКлиент(ЗначениеОтметки, ВыделенныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеОтметкиКлиент(ЗначениеОтметки, ВыделенныеСтроки)
	
	УстановитьЗначениеОтметкиКлиентСервер(ЗначениеОтметки, ВыделенныеСтроки, ТаблицаРешения);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеОтметкиСервер(ЗначениеОтметки, Знач ВыделенныеСтроки) // Знач из-за серверного вызова.
	
	УстановитьЗначениеОтметкиКлиентСервер(ЗначениеОтметки, ВыделенныеСтроки, ТаблицаРешения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗначениеОтметкиКлиентСервер(ЗначениеОтметки, ВыделенныеСтроки, ТаблицаРешения)
	
	Для Каждого ИдСтроки Из ВыделенныеСтроки Цикл
		СтрокаТаблицы = ТаблицаРешения.НайтиПоИдентификатору(ИдСтроки);
		
		Если СтрокаТаблицы.ОтметкаДоступна Тогда
			СтрокаТаблицы.Отметка = ЗначениеОтметки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОкноНастроек

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИменаРеквизитовНастроекОбъединенияСтрок()
	
	ИменаРеквизитов = Новый Массив();
	ИменаРеквизитов.Добавить("ОбъединитьСтрокиПоСчетам0510466");
	ИменаРеквизитов.Добавить("ОбъединитьСтрокиПоСчетам0510468");
	ИменаРеквизитов.Добавить("ОбъединитьСтрокиПоСчетам0510469");
	ИменаРеквизитов.Добавить("ОбъединитьСтрокиПоСчетам0510471");
	ИменаРеквизитов.Добавить("ОбъединитьСтрокиПоСчетам0510472");
	ИменаРеквизитов.Добавить("ОбъединитьСтрокиПоСчетам0510473");
	ИменаРеквизитов.Добавить("ОбъединитьСтрокиПоСчетам0510474");
	
	ИменаРеквизитов.Добавить("ОбъединитьСтрокиПоМестамИнвентаризации0510466");
	
	Возврат ИменаРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗаголовокГруппыОбъединитьСтроки()
	
	Если Элементы.ДекорацияНеПредусмотреноОбъединениеСтрок.Видимость Тогда
		ЗаголовокГруппыОбъединитьСтроки = "";
		
		Возврат;
	КонецЕсли;
	
	ИменаРеквизитов = ПолучитьИменаРеквизитовНастроекОбъединенияСтрок();
	
	ЕстьУстановленный = Ложь;
	
	Для Каждого ИмяРеквизита Из ИменаРеквизитов Цикл
		Если ЭтотОбъект[ИмяРеквизита] = Истина Тогда
			ЕстьУстановленный = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЗаголовокГруппыОбъединитьСтроки = ?(ЕстьУстановленный,
		НСтр("ru='установлено'"),
		НСтр("ru='не установлено'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеНастроекОбъединения(УказанноеЗначениеНастройки)
	
	// Устанавливаются значения только видимых (используемых) флажков.
	
	ИменаРеквизитов = ПолучитьИменаРеквизитовНастроекОбъединенияСтрок();
	
	Для Каждого ИмяРеквизита Из ИменаРеквизитов Цикл
		Если Элементы[ИмяРеквизита].Видимость Тогда
			ЗначениеРеквизита = ?(УказанноеЗначениеНастройки = Неопределено,
				НастройкиОбъединенияСтрокПоУмолчанию[ИмяРеквизита],
				УказанноеЗначениеНастройки);
			
			ЭтотОбъект[ИмяРеквизита] = ЗначениеРеквизита;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Комментарий.

&НаКлиенте
Процедура НастроитьФормуНастройкиКомментария()
	
	Элементы.ШаблонКомментария.ТолькоПросмотр = Не УстанавливатьКомментарий;
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("УстановитьКомментарийПоУмолчанию");
	ИменаЭлементов.Добавить("ПоказатьДоступныеПараметрыШаблона");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов,
		"Доступность", УстанавливатьКомментарий);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИУстановитьКомментарийПоУмолчанию()
	
	Оповещение = Новый ОписаниеОповещения("ПодтвердитьИУстановитьКомментарийПоУмолчаниюВыбор", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, НСтр("ru='Установить комментарий документов по умолчанию?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИУстановитьКомментарийПоУмолчаниюВыбор(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = КодВозвратаДиалога.Да Тогда
		ШаблонКомментария = ШаблонКомментарияПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

// Отбор по коду формы.

&НаКлиентеНаСервереБезКонтекста
Функция НовыйКодыФормПредусмотреныНастройкиОтбора61н()
	
	// Соответствует реквизитам формы <ОтбиратьПоКодуФормы0510xxx>.
	
	КодыФорм = Новый Массив();
	КодыФорм.Добавить("0510464");
	КодыФорм.Добавить("0510465");
	КодыФорм.Добавить("0510466");
	КодыФорм.Добавить("0510467");
	КодыФорм.Добавить("0510468");
	КодыФорм.Добавить("0510469");
	КодыФорм.Добавить("0510470");
	КодыФорм.Добавить("0510471");
	КодыФорм.Добавить("0510472");
	КодыФорм.Добавить("0510473");
	КодыФорм.Добавить("0510474");
	
	Возврат КодыФорм;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НовыйКодыФормПредусмотреныНастройкиОтбора52н()
	
	КодыФорм = Новый Массив();
	КодыФорм.Добавить("0504081");
	КодыФорм.Добавить("0504082");
	КодыФорм.Добавить("0504083");
	КодыФорм.Добавить("0504084");
	КодыФорм.Добавить("0504085");
	КодыФорм.Добавить("0504086");
	КодыФорм.Добавить("0504087");
	КодыФорм.Добавить("0504088");
	КодыФорм.Добавить("0504089");
	КодыФорм.Добавить("0504091");
	
	Возврат КодыФорм;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяРеквизитаОтбиратьПоКодуФормы(КодФормы)
	
	Возврат СтрШаблон("ОтбиратьПоКодуФормы%1", КодФормы);
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗначениеОтбиратьПоКодуФормы61н(Значение)
	
	УстановитьЗначениеОтбиратьПоКодуФормы(ЭтотОбъект, Значение, НовыйКодыФормПредусмотреныНастройкиОтбора61н());
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеОтбиратьПоКодуФормы52н(Значение)
	
	УстановитьЗначениеОтбиратьПоКодуФормы(ЭтотОбъект, Значение, НовыйКодыФормПредусмотреныНастройкиОтбора52н());
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗначениеОтбиратьПоКодуФормы(Форма, Значение, КодыФорм)
	
	Для Каждого КодФормы Из КодыФорм Цикл
		ИмяРеквизита = ПолучитьИмяРеквизитаОтбиратьПоКодуФормы(КодФормы);
		
		Форма[ИмяРеквизита] = Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуНастройкиОтбораПоКодуФормы()
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("СнятьОтборПоКодуФормы61н");
	ИменаЭлементов.Добавить("УстановитьОтборПоКодуФормы61н");
	ИменаЭлементов.Добавить("СнятьОтборПоКодуФормы52н");
	ИменаЭлементов.Добавить("УстановитьОтборПоКодуФормы52н");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов,
		"Доступность", УстановленОтборПоКодуФормы);
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("СтраницаОтборПоКодуФормыПриказ61н");
	ИменаЭлементов.Добавить("СтраницаОтборПоКодуФормыПриказ52н");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов,
		"ТолькоПросмотр", Не УстановленОтборПоКодуФормы);
	
	УстановитьЗаголовокНастроекОтбораПоКодуФормы61н();
	УстановитьЗаголовокНастроекОтбораПоКодуФормы52н();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы61н()
	
	УстановитьЗаголовокНастроекОтбораПоКодуФормы61н();
	
	НастроитьФормуТребуетсяОбновлениеОтборПоКодуФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеФлажкаОтбиратьПоКодуФормы52н()
	
	УстановитьЗаголовокНастроекОтбораПоКодуФормы52н();
	
	НастроитьФормуТребуетсяОбновлениеОтборПоКодуФормы();
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьЗаголовокНастроекОтбораПоКодуФормы61н()
	
	ЗаголовокНастроекОтбораПоКодуФормы61н = ?(ЕстьУстановленныйОтборПоКодуФормы61н(),
		НСтр("ru='установлен'"), "");
	
КонецФункции

&НаКлиенте
Функция УстановитьЗаголовокНастроекОтбораПоКодуФормы52н()
	
	ЗаголовокНастроекОтбораПоКодуФормы52н = ?(ЕстьУстановленныйОтборПоКодуФормы52н(),
		НСтр("ru='установлен'"), "");
	
КонецФункции

&НаКлиенте
Функция ЕстьУстановленныйОтборПоКодуФормы61н()
	
	Возврат ЕстьУстановленныйОтборПоКоду(НовыйКодыФормПредусмотреныНастройкиОтбора61н());
	
КонецФункции

&НаКлиенте
Функция ЕстьУстановленныйОтборПоКодуФормы52н()
	
	Возврат ЕстьУстановленныйОтборПоКоду(НовыйКодыФормПредусмотреныНастройкиОтбора52н());
	
КонецФункции

&НаКлиенте
Функция ЕстьУстановленныйОтборПоКоду(КодыФорм)
	
	Для Каждого КодФормы Из КодыФорм Цикл
		ИмяРеквизита = ПолучитьИмяРеквизитаОтбиратьПоКодуФормы(КодФормы);
		
		Если ЭтотОбъект[ИмяРеквизита] Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ПоказатьТекстовуюСтроку(ТекстоваяСтрока, Заголовок, СохранитьИзменения = Ложь, ИмяПоля = "")
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("СохранитьИзменения",	СохранитьИзменения);
	ДополнительныеПараметры.Вставить("ИмяПоля",				ИмяПоля);
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьТекстовуюСтрокуВыбор", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВводСтроки(Оповещение, ТекстоваяСтрока, Заголовок,, Истина);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьТекстовуюСтрокуВыбор(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.СохранитьИзменения Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[ДополнительныеПараметры.ИмяПоля] = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеНастройки

&НаСервере
Функция НовыйНастройкиОбъединенияСтрокНаФорме()
	
	// Все коды форм, для которых предусмотрена та или иная группировка строк.
	ОбщийСписокКодовФорм = СтрРазделить("0510466,0510468,0510469,0510471,0510472,0510473,0510474", ", ", Ложь);
	
	НастройкиОбъединения = Новый Структура();
	НастройкиОбъединения.Вставить("ОбщийСписокКодовФорм", ОбщийСписокКодовФорм);
	НастройкиОбъединения.Вставить("ПоСчетам", ОбщийСписокКодовФорм);
	НастройкиОбъединения.Вставить("ПоМестамИнвентаризации", СтрРазделить("0510466", ", ", Ложь));
	
	Возврат НастройкиОбъединения;
	
КонецФункции

&НаСервере
Функция ПолучитьЦветФонаНедоступнойТаблицы()
	
	Возврат ЦветаСтиля.ИтогиФон;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяФлажкаНастройкиОбъединенияПоСчетам(КодФормы)
	
	Возврат СтрШаблон("ОбъединитьСтрокиПоСчетам%1", КодФормы);
	
КонецФункции

&НаСервере
Функция ПолучитьИмяФлажкаНастройкиОбъединенияПоМестамИнвентаризации(КодФормы)
	
	Возврат СтрШаблон("ОбъединитьСтрокиПоМестамИнвентаризации%1", КодФормы);
	
КонецФункции

&НаСервере
Функция ПолучитьШаблонКомментарияПоУмолчанию()
	
	// Доступные параметры:
	//	[ДатаВремя]
	//	[ОбщийСчетчикДокументов]
	//	[ОбщееКоличествоДокументов]
	//	[СчетчикДокументовКодаФормы]
	//	[КоличествоДокументовКодаФормы]
	
	Возврат НСтр("ru='#Создано групповым формированием описей [ДатаВремя]. Документ [ОбщийСчетчикДокументов] из [ОбщееКоличествоДокументов]'");
	
КонецФункции

&НаСервере
Функция ПолучитьПодсказкуПараметрыШаблонаКомментария()
	
	Возврат НСтр("ru='Поддерживаются следующие параметры, которые можно использовать в шаблоне строки комментария:
		|
		|[ДатаВремя] - дата и время запуска группового формирования документов описей. Значение этого параметра будет одинаковым для всех формируемых документов;
        |
		|[ОбщийСчетчикДокументов] - счетчик текущего документа в общем списке всех сформированных документов, независимо от кода формы;
        |
		|[ОбщееКоличествоДокументов] - общее количество всех сформированных документов, независимо от кода формы;
        |
		|[СчетчикДокументовКодаФормы] - счетчик текущего документа в списке документов текущего кода формы;
        |
		|[КоличествоДокументовКодаФормы] - общее количество сформированных документов текущего кода формы.'");
	
КонецФункции


&НаСервере
Функция НовыйИменаДокументовСозданиеПредусмотрено()
	
	// Важно: Указанные здесь документы должны иметь уникальные коды форм.
	// Дальнейшими алгоритмами предусмотрено, что одному коду формы соответствует
	// один формируемый документ и одна строка таблицы настроек на дату Решения.
	// Далее выполняется проверка корректности настроек, и в случае проблем вызывается исключение.
	
	ИменаДокументов = Новый Массив();
	
	ИменаДокументов.Добавить("ИнвентаризационнаяОписьОстатковНаСчетах"); // 0510464
	ИменаДокументов.Добавить("ИнвентаризационнаяОписьБСО"); // 0510465
	ИменаДокументов.Добавить("ИнвентаризационнаяОписьНФА"); // 0510466
	ИменаДокументов.Добавить("ИнвентаризационнаяОписьНаличныхСредств"); // 0510467
	ИменаДокументов.Добавить("ИнвентаризационнаяОписьРасчетовПоПоступлениям"); // 0510468
	ИменаДокументов.Добавить("ИнвентаризационнаяОписьРасчетовСКонтрагентами"); // 0510469
	ИменаДокументов.Добавить("ИнвентаризационнаяОписьЦенныхБумаг"); // 0510470
	ИменаДокументов.Добавить("ИнвентаризационнаяОписьКредитовИЗаймов"); // 0510471
	ИменаДокументов.Добавить("ИнвентаризационнаяОписьГосДолгаВЦенныхБумагах"); // 0510472
	ИменаДокументов.Добавить("ИнвентаризационнаяОписьГосДолгаПоПривлеченнымКредитам"); // 0510473
	ИменаДокументов.Добавить("ИнвентаризационнаяОписьГосДолгаПоПредоставленнымГарантиям"); // 0510474
	
	Возврат ИменаДокументов;
	
КонецФункции

&НаСервере
Функция НовыйКодыФормСозданиеПредусмотрено(СвойстваКодовФормСозданиеПредусмотрено)
	
	КодыФорм = Новый Массив();
	
	Для Каждого Элемент Из СвойстваКодовФормСозданиеПредусмотрено Цикл
		КодыФорм.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	Возврат КодыФорм;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяКолонкиДляБыстрогоПоиска(КодФормы)
	
	Возврат СтрШаблон("КолонкаБыстрогоПоиска%1", КодФормы);
	
КонецФункции

&НаСервере
Функция НовыйСостоянияИндикатораОписи()
	
	СостоянияИндикатораОписи = Новый Структура();
	
	СостоянияИндикатораОписи.Вставить("Ожидается",
		НовыйОписаниеСостоянияИндикатора(БиблиотекаКартинок.ЗолотойШар, 1));
	
	СостоянияИндикатораОписи.Вставить("НеПредусмотреноЗаконодательством",
		НовыйОписаниеСостоянияИндикатора(БиблиотекаКартинок.СостояниеПоступлениеНеОжидаетсяГосИС, 2));
	
	СостоянияИндикатораОписи.Вставить("НеПредусмотреноОбработкой",
		НовыйОписаниеСостоянияИндикатора(БиблиотекаКартинок.СостояниеПоступлениеНеОжидаетсяГосИС, 3));
		
	СостоянияИндикатораОписи.Вставить("ДокументСозданНеПроведен",
		НовыйОписаниеСостоянияИндикатора(БиблиотекаКартинок.СостояниеПоступилоЧастичноГосИС, 4));
	
	СостоянияИндикатораОписи.Вставить("ДокументСозданПроведен",
		НовыйОписаниеСостоянияИндикатора(БиблиотекаКартинок.СостояниеПоступилоГосИС, 5));
	
	Возврат СостоянияИндикатораОписи;
	
КонецФункции

&НаСервере
Функция НовыйСостоянияИндикатораОшибки()
	
	СостоянияИндикатораОшибки = Новый Структура();
	
	СостоянияИндикатораОшибки.Вставить("НеПредусмотреноЗаконодательством",
		НовыйОписаниеСостоянияИндикатора(БиблиотекаКартинок.ПризнакНаличияКритическойОшибки, 1));
		
	СостоянияИндикатораОшибки.Вставить("НеПредусмотреноОбработкой",
		НовыйОписаниеСостоянияИндикатора(БиблиотекаКартинок.ПризнакНаличияКритическойОшибки, 2));
		
	СостоянияИндикатораОшибки.Вставить("НесколькоДокументовОдногоВида",
		НовыйОписаниеСостоянияИндикатора(БиблиотекаКартинок.ПризнакНаличияКритическойОшибки, 3));
	
	СостоянияИндикатораОшибки.Вставить("НетПрав",
		НовыйОписаниеСостоянияИндикатора(БиблиотекаКартинок.ПризнакНаличияКритическойОшибки, 4));
		
	Возврат СостоянияИндикатораОшибки;
	
КонецФункции

&НаСервере
Функция НовыйОписаниеСостоянияИндикатора(Картинка, Код)
	
	ОписаниеСостоянияИндикатора = Новый Структура();
	ОписаниеСостоянияИндикатора.Вставить("Картинка", Картинка);
	ОписаниеСостоянияИндикатора.Вставить("Код", Код);
	
	Возврат ОписаниеСостоянияИндикатора;
	
КонецФункции

&НаСервере
Функция НовыйОписаниеОписи()
	
	ОписаниеОписи = Новый Структура();
	ОписаниеОписи.Вставить("Ссылка");
	ОписаниеОписи.Вставить("КодФормы", "");
	ОписаниеОписи.Вставить("НомерСистемный", "");
	ОписаниеОписи.Вставить("НомерДляПечати", "");
	ОписаниеОписи.Вставить("Дата", '00010101');
	ОписаниеОписи.Вставить("Проведен", Ложь);
	ОписаниеОписи.Вставить("ПометкаУдаления", Ложь);
	
	Возврат ОписаниеОписи;
	
КонецФункции

#КонецОбласти

#Область Обновить

&НаКлиенте
Процедура ОбновитьДанныеКлиент()
	
	ОбновитьДанныеСервер(Истина);
	
	НастроитьФормуПослеОбновления();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеСервер(ПрименитьФлажкиОтбораПоКодуФормы = Ложь)
	
	Если ПрименитьФлажкиОтбораПоКодуФормы Тогда
		ЗаполнитьОтборМассивКодовФормПоФлажкамНастроекОтбора();
	КонецЕсли;
	
	ПараметрыПоиска = ИнвентаризацияСервер.НовыйПараметрыПоискаДанныхДляГрупповогоФормированияОписей();
	
	ПараметрыПоиска.ИскатьОписиПоПриказу52н = ИскатьОписиПоПриказу52н;
	ПараметрыПоиска.ОтборМассивКодовФорм = ОтборМассивКодовФорм;
	
	ЗаполнитьФормуГрупповогоФормированияОписей(Решение, ПараметрыПоиска);
	
	Элементы.ГруппаНесопоставленныеОписи.Видимость = (ТаблицаНесопоставленныхОписей.Количество() > 0);
	
	ТребуетсяОбновлениеНастроено = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтборМассивКодовФормПоФлажкамНастроекОтбора()
	
	ВремМассив = Новый Массив();
	
	Для Каждого КодФормы Из НовыйКодыФормПредусмотреныНастройкиОтбора52н() Цикл
		ИмяРеквизита = ПолучитьИмяРеквизитаОтбиратьПоКодуФормы(КодФормы);
		
		Если ЭтотОбъект[ИмяРеквизита] Тогда
			ВремМассив.Добавить(КодФормы);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КодФормы Из НовыйКодыФормПредусмотреныНастройкиОтбора61н() Цикл
		ИмяРеквизита = ПолучитьИмяРеквизитаОтбиратьПоКодуФормы(КодФормы);
		
		Если ЭтотОбъект[ИмяРеквизита] Тогда
			ВремМассив.Добавить(КодФормы);
		КонецЕсли;
	КонецЦикла;
	
	ОтборМассивКодовФорм = Новый ФиксированныйМассив(ВремМассив);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуПослеОбновления()
	
	КоличествоСтрокТаблицыРешения = ТаблицаРешения.Количество();
	
	КоличествоСтрокТаблицыНесопоставленныхОписей = ТаблицаНесопоставленныхОписей.Количество();
	
	Если КоличествоСтрокТаблицыНесопоставленныхОписей > 0 Тогда
		Элементы.ГруппаНесопоставленныеОписи.Показать();
	КонецЕсли;
	
	УстановитьЗаголовокГруппыОбъединитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуТребуетсяОбновлениеИскатьОписиПоПриказу52()
	
	НастроитьФормуТребуетсяОбновление(НСтр("ru='Изменены настройки поиска описей'"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуТребуетсяОбновлениеОтборПоКодуФормы()
	
	НастроитьФормуТребуетсяОбновление(НСтр("ru='Изменен отбор по коду формы'"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуТребуетсяОбновление(ТекстНачалаЗаголовка)
	
	Если ТребуетсяОбновлениеНастроено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗаголовка = СтрШаблон(
		НСтр("ru='%1, для заполнения по актуальным настройкам необходимо выполнить команду ""Обновить""'"),
		ТекстНачалаЗаголовка);
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("НадписьНеобходимоОбновитьТаблицаРешения");
	ИменаЭлементов.Добавить("НадписьНеобходимоОбновитьТаблицаНесопоставленныеОписи");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов, "Видимость", Истина);
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов, "Заголовок", ТекстЗаголовка);
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("ТаблицаРешения");
	ИменаЭлементов.Добавить("ТаблицаНесопоставленныхОписей");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов, "ЦветФона", ЦветФонаНедоступнойТаблицы);
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("ТаблицаРешенияОтметка");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов, "ТолькоПросмотр", Истина);
	
	Для Каждого СтрокаТаблицы Из ТаблицаРешения Цикл
		СтрокаТаблицы.Отметка = Ложь;
	КонецЦикла;
	
	ТребуетсяОбновлениеНастроено = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеФормы

&НаСервере
Процедура ЗаполнитьФормуГрупповогоФормированияОписей(РешениеСсылка, ПараметрыПоиска)
	
	Данные = ИнвентаризацияСервер.ПолучитьДанныеДляГрупповогоФормированияОписей(РешениеСсылка, ПараметрыПоиска);
	
	ПризнакиРешения = Данные.ПризнакиРешения;
	
	УстановленОтборПоКодуФормы = (ПараметрыПоиска.ОтборМассивКодовФорм.Количество() > 0);
	
	СвойстваКодовФормСозданиеПредусмотрено = ПолучитьСвойстваКодовФормСозданиеПредусмотрено(
		Данные.ТаблицаНастроек, Данные.ДатаРешения);
	
	ПраваСоздания = ОпределитьПраваСоздания(Данные.РазличныеКодыФорм,
		СвойстваКодовФормСозданиеПредусмотрено, ПараметрыПоиска);
	
	ДопустимоФормироватьОписи = ДопустимоФормироватьОписи(ПризнакиРешения);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("СостоянияИндикатораОписи", НовыйСостоянияИндикатораОписи());
	ДополнительныеПараметры.Вставить("СостоянияИндикатораОшибки", НовыйСостоянияИндикатораОшибки());
	ДополнительныеПараметры.Вставить("СинонимыПолейРешения", ПолучитьСинонимыПолейРешения());
	ДополнительныеПараметры.Вставить("СтатистикаТаблицыВизуализацииРешения", Новый Структура());
	ДополнительныеПараметры.Вставить("ЕстьНастройкиОбъединенияСтрок", Новый Структура());
	ДополнительныеПараметры.Вставить("УстановленОтборПоКодуФормы", УстановленОтборПоКодуФормы);
	ДополнительныеПараметры.Вставить("СоответствиеТипОписиИмяДокумента", ПолучитьСоответствиеТипОписиИмяДокумента(Данные.ТаблицыОписей));
	
	ДополнительныеПараметры.Вставить("СвойстваКодовФормСозданиеПредусмотрено", СвойстваКодовФормСозданиеПредусмотрено);
	ДополнительныеПараметры.Вставить("ПраваСоздания", ПраваСоздания);
	ДополнительныеПараметры.Вставить("ДопустимоФормироватьОписи", ДопустимоФормироватьОписи);
	
	// Таблица Решения.
	
	ТаблицаВизуализацииРешения = СформироватьТаблицуВизуализацииРешения(
		РешениеСсылка, Данные, ДополнительныеПараметры, ПараметрыПоиска);
		
	ЗначениеВРеквизитФормы(ТаблицаВизуализацииРешения, "ТаблицаРешения");
	
	// Несопоставленные описи.
	
	ТаблицаВизуализацииНесопоставленныхОписей = СформироватьТаблицуВизуализацииНесопоставленныхОписей(
		Данные, ДополнительныеПараметры, ПараметрыПоиска);
	
	ЗначениеВРеквизитФормы(ТаблицаВизуализацииНесопоставленныхОписей, "ТаблицаНесопоставленныхОписей");
	
	// Прочие настройки формы.
	
	СброситьНадписиНеобходимоОбновить();
	
	НастроитьСведенияОПоследнемИзменении(ПризнакиРешения);
	
	НастроитьИндикаторыРешения(Данные, ДополнительныеПараметры, ПараметрыПоиска);
	
	НастроитьОбъединениеСтрок(ТаблицаВизуализацииРешения, ДополнительныеПараметры);
	
	НастроитьДоступностьФормированияОписей(ПризнакиРешения, ДополнительныеПараметры);
	
	НастроитьМенюОтбораСтрокТаблицыРешения(ДополнительныеПараметры);
	
	МассивКодовФормНетПрав = Новый ФиксированныйМассив(ДополнительныеПараметры.ПраваСоздания.КодыФормНетПрав);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеТипОписиИмяДокумента(ТаблицыОписей)
	
	СоответствиеТипОписиИмяДокумента = Новый Соответствие();
	
	Для Каждого Элемент из ТаблицыОписей Цикл
		ИмяДокумента = Элемент.Ключ;
		
		ТипДокумента = Тип("ДокументСсылка." + ИмяДокумента);
		
		СоответствиеТипОписиИмяДокумента.Вставить(ТипДокумента, ИмяДокумента);
	КонецЦикла;
	
	Возврат СоответствиеТипОписиИмяДокумента;
	
КонецФункции

&НаСервере
Функция ОпределитьПраваСоздания(РазличныеКодыФорм,
		СвойстваКодовФормСозданиеПредусмотрено, ПараметрыПоиска)
	
	ОтборМассив = ПараметрыПоиска.ОтборМассивКодовФорм;
	
	ИменаДокументовСозданиеПредусмотрено = НовыйИменаДокументовСозданиеПредусмотрено();
	
	КодыФормСозданиеПредусмотрено = НовыйКодыФормСозданиеПредусмотрено(
		СвойстваКодовФормСозданиеПредусмотрено);
	
	ПроверяемыеКодыФорм = ОбщегоНазначенияИСКлиентСервер.ПересечениеМассивов(РазличныеКодыФорм, КодыФормСозданиеПредусмотрено);
	
	Если ОтборМассив.Количество() > 0 Тогда
		ПроверяемыеКодыФорм = ОбщегоНазначенияИСКлиентСервер.ПересечениеМассивов(ОтборМассив, ПроверяемыеКодыФорм);
	КонецЕсли;
	
	СписокНедоступныхДокументов = ПолучитьСписокДокументовНедоступныхДляСоздания(
		ПроверяемыеКодыФорм, СвойстваКодовФормСозданиеПредусмотрено);
	
	КодыФормНетПрав = Новый Массив();
	
	Для Каждого Элемент Из СписокНедоступныхДокументов Цикл
		КодФормы = Элемент.Представление;
		
		Если КодыФормНетПрав.Найти(КодФормы) = Неопределено Тогда
			КодыФормНетПрав.Добавить(КодФормы);
		КонецЕсли;
	КонецЦикла;
	
	ПраваСоздания = Новый Структура();
	ПраваСоздания.Вставить("КодыФормНетПрав", КодыФормНетПрав);
	ПраваСоздания.Вставить("СписокНедоступныхДокументов", СписокНедоступныхДокументов);
	
	Возврат ПраваСоздания;
	
КонецФункции

 #Область ТаблицаРешения

&НаСервере
Функция НовыйТаблицаВизуализацииРешения()
	
	ТипДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипЧисло4 = ОбщегоНазначения.ОписаниеТипаЧисло(4, 0, ДопустимыйЗнак.Неотрицательный);
	ТипЧисло6 = ОбщегоНазначения.ОписаниеТипаЧисло(6, 0, ДопустимыйЗнак.Неотрицательный);
	ТипЧислоИндексКартинки = ОбщегоНазначения.ОписаниеТипаЧисло(2, 0, ДопустимыйЗнак.Любой);
	ТипКартинка = Новый ОписаниеТипов("Картинка");
	ТипЧисло1 = ОбщегоНазначения.ОписаниеТипаЧисло(1, 0, ДопустимыйЗнак.Неотрицательный);
	
	ТаблицаВизуализации = Новый ТаблицаЗначений();
	
	// Сведения табличной части Объекты.
	ТаблицаВизуализации.Колонки.Добавить("НомерСтроки",							ТипЧисло6);
	ТаблицаВизуализации.Колонки.Добавить("КФО",									Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаВизуализации.Колонки.Добавить("Счет",								Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаВизуализации.Колонки.Добавить("Сотрудник",							Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаВизуализации.Колонки.Добавить("ДатаИнвентаризации",					ТипДата);
	ТаблицаВизуализации.Колонки.Добавить("ДатаНачала",							ТипДата);
	ТаблицаВизуализации.Колонки.Добавить("ДатаОкончания",						ТипДата);
	ТаблицаВизуализации.Колонки.Добавить("НомерКомиссии",						ТипЧисло4);
	ТаблицаВизуализации.Колонки.Добавить("НомерРабочейКомиссии",				ТипЧисло4);
	ТаблицаВизуализации.Колонки.Добавить("МестоИнвентаризации",					Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.МестоИнвентаризацииНФА.Тип));
	ТаблицаВизуализации.Колонки.Добавить("Примечание",							ТипСтрока);
	ТаблицаВизуализации.Колонки.Добавить("МассивКодовФорм",						Новый ОписаниеТипов("ФиксированныйМассив"));
	ТаблицаВизуализации.Колонки.Добавить("КодФормы",							ТипСтрока);
	
	// Списки кодов форм.
	ТаблицаВизуализации.Колонки.Добавить("МассивКодовФормСозданиеПредусмотрено",Новый ОписаниеТипов("ФиксированныйМассив"));
	ТаблицаВизуализации.Колонки.Добавить("КодФормыСозданиеПредусмотрено",		ТипСтрока);
	ТаблицаВизуализации.Колонки.Добавить("МассивКодовФормСозданиеНеобходимо",	Новый ОписаниеТипов("ФиксированныйМассив"));
	ТаблицаВизуализации.Колонки.Добавить("КодФормыСозданиеНеобходимо",			ТипСтрока);
	ТаблицаВизуализации.Колонки.Добавить("МассивКодовФормСозданиеВыбрано",		Новый ОписаниеТипов("ФиксированныйМассив"));
	ТаблицаВизуализации.Колонки.Добавить("КодФормыСозданиеВыбрано",				ТипСтрока);
	ТаблицаВизуализации.Колонки.Добавить("СписокВыбораИзмененВручную",			ТипБулево);
	
	ТаблицаВизуализации.Колонки.Добавить("Отметка",								ТипБулево);
	ТаблицаВизуализации.Колонки.Добавить("ОтметкаДоступна",						ТипБулево);
	
	// Блок сведений описи.
	ТаблицаВизуализации.Колонки.Добавить("ПредставлениеОписи",					ТипСтрока);
	ТаблицаВизуализации.Колонки.Добавить("ЕстьСопоставленныеОписи",				ТипБулево);
	ТаблицаВизуализации.Колонки.Добавить("КоличествоСопоставленныхОписей",		ТипЧисло4);
	ТаблицаВизуализации.Колонки.Добавить("МассивОписанийОписей",				Новый ОписаниеТипов("Массив"));
	ТаблицаВизуализации.Колонки.Добавить("ИндексКартинкиОписьПроведена",		ТипЧислоИндексКартинки);
	
	// Индикатор описи.
	ТаблицаВизуализации.Колонки.Добавить("КартинкаИндикатораОписи",				ТипКартинка);
	ТаблицаВизуализации.Колонки.Добавить("КодИндикатораОписи",					ТипЧисло1);
	ТаблицаВизуализации.Колонки.Добавить("КартинкаИндикатораОшибки",			ТипКартинка);
	ТаблицаВизуализации.Колонки.Добавить("КодИндикатораОшибки",					ТипЧисло1);
	ТаблицаВизуализации.Колонки.Добавить("ЕстьОшибка",							ТипБулево);
	
	Возврат ТаблицаВизуализации;
	
КонецФункции

&НаСервере
Функция СформироватьТаблицуВизуализацииРешения(РешениеСсылка,
		Данные, ДополнительныеПараметры, ПараметрыПоиска)
	
	КодыФормНетПрав = ДополнительныеПараметры.ПраваСоздания.КодыФормНетПрав;
	
	ИменаДокументовСозданиеПредусмотрено = НовыйИменаДокументовСозданиеПредусмотрено();
	
	КодыФормСозданиеПредусмотрено = НовыйКодыФормСозданиеПредусмотрено(
		ДополнительныеПараметры.СвойстваКодовФормСозданиеПредусмотрено);
	
	ДопустимоФормироватьОписи = ДополнительныеПараметры.ДопустимоФормироватьОписи;
	
	СостоянияИндикатораОписи = ДополнительныеПараметры.СостоянияИндикатораОписи;
	
	КодОжидается						= СостоянияИндикатораОписи.Ожидается.Код;
	КодДокументСозданПроведен			= СостоянияИндикатораОписи.ДокументСозданПроведен.Код;
	КодДокументСозданНеПроведен			= СостоянияИндикатораОписи.ДокументСозданНеПроведен.Код;
	КодНеПредусмотреноЗаконодательством	= СостоянияИндикатораОписи.НеПредусмотреноЗаконодательством.Код;
	КодНеПредусмотреноОбработкой		= СостоянияИндикатораОписи.НеПредусмотреноОбработкой.Код;
	
	ТаблицаВизуализацииРешения = НовыйТаблицаВизуализацииРешения();
	
	ЕстьОшибка = Ложь;
	ЕстьДоступнаяОтметка = Ложь;
	ЕстьСопоставленныеОписи = Ложь;
	ВсеСформированоПроведеноЛибоНеПредусмотрено = Истина;
	ВсеСформированоНеПроведеноЛибоНеПредусмотрено = Истина;
	
	КодыИндикатораОписи = Новый Соответствие();
	
	КодыФормНеСформированоПолностью = Новый Соответствие();
	
	Для Каждого СтрокаТаблицыОбъекты Из Данные.ТаблицаОбъекты Цикл
		НоваяСтрока = ТаблицаВизуализацииРешения.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыОбъекты);
		
		ЗаполнитьБлокОписиВизуализацииРешения(НоваяСтрока, СтрокаТаблицыОбъекты, Данные, ДополнительныеПараметры);
		
		ЗаполнитьКолонкиКодовФорм(НоваяСтрока, КодыФормСозданиеПредусмотрено,
			ДополнительныеПараметры, КодыФормНетПрав, ПараметрыПоиска);
		
		ЗаполнитьКолонкиИндикатораОписиТаблицыВизуализацииРешения(НоваяСтрока, ДополнительныеПараметры,
			ДопустимоФормироватьОписи, КодыФормНетПрав, ИменаДокументовСозданиеПредусмотрено,
			КодыФормНеСформированоПолностью, ПараметрыПоиска);
		
		НоваяСтрока.ОтметкаДоступна = (НоваяСтрока.КодИндикатораОписи = КодОжидается);
		
		// Статистика таблицы.
		Если НоваяСтрока.ЕстьОшибка Тогда
			ЕстьОшибка = Истина;
		КонецЕсли;
		
		Если НоваяСтрока.ОтметкаДоступна Тогда
			ЕстьДоступнаяОтметка = Истина;
		КонецЕсли;
		
		Если НоваяСтрока.ЕстьСопоставленныеОписи Тогда
			ЕстьСопоставленныеОписи = Истина;
		КонецЕсли;
		
		Если НоваяСтрока.КодИндикатораОписи <> КодНеПредусмотреноЗаконодательством
			И НоваяСтрока.КодИндикатораОписи <> КодДокументСозданПроведен Тогда
			ВсеСформированоПроведеноЛибоНеПредусмотрено = Ложь;
		КонецЕсли;
		
		Если НоваяСтрока.КодИндикатораОписи <> КодНеПредусмотреноЗаконодательством
			И НоваяСтрока.КодИндикатораОписи <> КодДокументСозданНеПроведен Тогда
			ВсеСформированоНеПроведеноЛибоНеПредусмотрено = Ложь;
		КонецЕсли;
		
		КодыИндикатораОписи.Вставить(НоваяСтрока.КодИндикатораОписи, Истина);
	КонецЦикла;
	
	СтатистикаТаблицы = НовыйСтатистикаТаблицыВизуализацииРешения();
	СтатистикаТаблицы.ЕстьОшибка = ЕстьОшибка;
	СтатистикаТаблицы.ЕстьДоступнаяОтметка = ЕстьДоступнаяОтметка;
	СтатистикаТаблицы.ЕстьСопоставленныеОписи = ЕстьСопоставленныеОписи;
	СтатистикаТаблицы.ВсеСформированоПроведеноЛибоНеПредусмотрено = ВсеСформированоПроведеноЛибоНеПредусмотрено;
	СтатистикаТаблицы.ВсеСформированоНеПроведеноЛибоНеПредусмотрено = ВсеСформированоНеПроведеноЛибоНеПредусмотрено;
	СтатистикаТаблицы.КодыИндикатораОписи = КодыИндикатораОписи;
	СтатистикаТаблицы.КодыФормНеСформированоПолностью = КодыФормНеСформированоПолностью;
	
	ДополнительныеПараметры.СтатистикаТаблицыВизуализацииРешения = СтатистикаТаблицы;
	
	Если ВыводитьТолькоФормируемыеКодыФорм Тогда
		МассивЗначений = ТаблицаВизуализацииРешения.ВыгрузитьКолонку("КодФормыСозданиеПредусмотрено");
		
		ТаблицаВизуализацииРешения.ЗагрузитьКолонку(МассивЗначений, "КодФормы");
	КонецЕсли;
	
	Возврат ТаблицаВизуализацииРешения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьБлокОписиВизуализацииРешения(НоваяСтрока, СтрокаТаблицыОбъекты, Данные, ДополнительныеПараметры)
	
	СопоставленныеОписи = СтрокаТаблицыОбъекты.СопоставленныеОписи;
	
	МассивОписанийОписей = Новый Массив();
	МассивТекстов = Новый Массив();
	
	Шаблон = НСтр("ru='%1 от %2'");
	
	КоличествоПроведенных = 0;
	
	Для Каждого СтрокаТаблицы Из СопоставленныеОписи Цикл
		СтрокаШапкиОписи = Данные.ТаблицыОписей[СтрокаТаблицы.ИмяДокумента].Шапки[СтрокаТаблицы.ИндексСтрокиТаблицыШапокОписей];
		
		ОписьСсылка = СтрокаШапкиОписи.Ссылка;
		
		НомерДляПечати = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ОписьСсылка, СтрокаШапкиОписи.Номер);
		
		ОписаниеОписи = НовыйОписаниеОписи();
		
		ЗаполнитьЗначенияСвойств(ОписаниеОписи, СтрокаШапкиОписи, "Ссылка,Дата,Проведен,ПометкаУдаления");
		ОписаниеОписи.НомерСистемный = СтрокаШапкиОписи.Номер;
		ОписаниеОписи.НомерДляПечати = НомерДляПечати;
		ОписаниеОписи.КодФормы = ИнвентаризацияСервер.ПолучитьКодФормыПоИмениДокумента(СтрокаТаблицы.ИмяДокумента, Данные.ТаблицаНастроек);
		
		МассивОписанийОписей.Добавить(ОписаниеОписи);
		
		ПредставлениеОписи = СтрШаблон(Шаблон, НомерДляПечати, Формат(СтрокаШапкиОписи.Дата, "ДФ=dd.MM.yyyy"));
		
		МассивТекстов.Добавить(ПредставлениеОписи);
		
		Если СтрокаШапкиОписи.Проведен Тогда
			КоличествоПроведенных = КоличествоПроведенных + 1;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаТекстов = СтрСоединить(МассивТекстов, "; ");
	
	КоличествоОписей = СопоставленныеОписи.Количество();
	
	Если КоличествоОписей > 1 Тогда
		ПредставлениеОписи = СтрШаблон(НСтр("ru='(%1) %2'"), Формат(КоличествоОписей, "ЧГ=0"), СтрокаТекстов);
	Иначе
		ПредставлениеОписи = СтрокаТекстов;
	КонецЕсли;
	
	НоваяСтрока.ПредставлениеОписи = ПредставлениеОписи;
	НоваяСтрока.МассивОписанийОписей = МассивОписанийОписей;
	//НоваяСтрока.ОтличающиесяПоляШапки = Новый Структура();
	
	КоличествоОписей = МассивОписанийОписей.Количество();
	
	// Индексы картинок коллекции СостояниеДокументаИДвижений.
	Если МассивОписанийОписей.Количество() = 0 Тогда
		ИндексКартинкиОписьПроведена = -1;
		
	ИначеЕсли КоличествоПроведенных = 0 Тогда
		ИндексКартинкиОписьПроведена = 0; // не проведен.
		
	ИначеЕсли КоличествоПроведенных < КоличествоОписей Тогда
		ИндексКартинкиОписьПроведена = 11; // проведен серый.
	Иначе
		ИндексКартинкиОписьПроведена = 1; // проведен зеленый.
	КонецЕсли;
	
	НоваяСтрока.ИндексКартинкиОписьПроведена = ИндексКартинкиОписьПроведена;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКолонкиИндикатораОписиТаблицыВизуализацииРешения(НоваяСтрока, ДополнительныеПараметры,
		ДопустимоФормироватьОписи, КодыФормНетПрав, ИменаДокументовСозданиеПредусмотрено,
		КодыФормНеСформированоПолностью, ПараметрыПоиска)
	
	УстановленОтборПоКодуФормы = ДополнительныеПараметры.УстановленОтборПоКодуФормы;
	
	СостоянияИндикатораОписи	= ДополнительныеПараметры.СостоянияИндикатораОписи;
	СостоянияИндикатораОшибки	= ДополнительныеПараметры.СостоянияИндикатораОшибки;
	
	ПодсчетОписей = ПодсчитатьОписиВТекущейСтроке(НоваяСтрока, ИменаДокументовСозданиеПредусмотрено,
		ДополнительныеПараметры.СоответствиеТипОписиИмяДокумента);
	
	ЕстьДублиОписейПоКодуФормы = (ПодсчетОписей.ДублиПоКодуФормы.Количество() > 0);
	
	ДиагностикаВозможностиСоздания = ДиагностироватьВозможностьСозданияПоПравам(
		НоваяСтрока, КодыФормНетПрав, ПодсчетОписей, УстановленОтборПоКодуФормы, ПараметрыПоиска.ОтборМассивКодовФорм,
		КодыФормНеСформированоПолностью);
	
	ПредусмотреноЗаконодательством = (НоваяСтрока.МассивКодовФорм.Количество() > 0);
	СозданиеПредусмотрено = (НоваяСтрока.МассивКодовФормСозданиеПредусмотрено.Количество() > 0);
	
	// Индикатор "Состояние описи".
	
	СостояниеИндикатораОписи = Неопределено;
	
	Если Не ПредусмотреноЗаконодательством Тогда
		СостояниеИндикатораОписи = СостоянияИндикатораОписи.НеПредусмотреноЗаконодательством;
		
	ИначеЕсли Не СозданиеПредусмотрено Тогда
		СостояниеИндикатораОписи = СостоянияИндикатораОписи.НеПредусмотреноОбработкой;
		
	ИначеЕсли ДиагностикаВозможностиСоздания.ЕстьВозможный И ДопустимоФормироватьОписи Тогда
		СостояниеИндикатораОписи = СостоянияИндикатораОписи.Ожидается;
		
	ИначеЕсли ПодсчетОписей.КоличествоСозданиеПредусмотрено > 0 Тогда
		Если ПодсчетОписей.КоличествоСозданиеПредусмотрено = ПодсчетОписей.КоличествоСозданиеПредусмотреноПроведено Тогда
			СостояниеИндикатораОписи = СостоянияИндикатораОписи.ДокументСозданПроведен;
		Иначе
			СостояниеИндикатораОписи = СостоянияИндикатораОписи.ДокументСозданНеПроведен;
		КонецЕсли;
	КонецЕсли;
	
	Если СостояниеИндикатораОписи <> Неопределено Тогда
		НоваяСтрока.КодИндикатораОписи = СостояниеИндикатораОписи.Код;
		НоваяСтрока.КартинкаИндикатораОписи = СостояниеИндикатораОписи.Картинка;
	КонецЕсли;
	
	// Индикатор "Ошибка".
	
	СостояниеОшибкиИндикатораОписи = Неопределено;
	
	Если ЕстьДублиОписейПоКодуФормы Тогда
		СостояниеОшибкиИндикатораОписи = СостоянияИндикатораОшибки.НесколькоДокументовОдногоВида;
		
	ИначеЕсли Не ПредусмотреноЗаконодательством Тогда
		СостояниеОшибкиИндикатораОписи = СостоянияИндикатораОшибки.НеПредусмотреноЗаконодательством;
		
	ИначеЕсли Не СозданиеПредусмотрено Тогда
		СостояниеОшибкиИндикатораОписи = СостоянияИндикатораОшибки.НеПредусмотреноОбработкой;
		
	ИначеЕсли ДиагностикаВозможностиСоздания.ЕстьНевозможный Тогда
		СостояниеОшибкиИндикатораОписи = СостоянияИндикатораОшибки.НетПрав
	КонецЕсли;
	
	Если СостояниеОшибкиИндикатораОписи <> Неопределено Тогда
		НоваяСтрока.КодИндикатораОшибки = СостояниеОшибкиИндикатораОписи.Код;
		НоваяСтрока.КартинкаИндикатораОшибки = СостояниеОшибкиИндикатораОписи.Картинка;
		
		НоваяСтрока.ЕстьОшибка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НовыйСтатистикаТаблицыВизуализацииРешения()
	
	СтатистикаТаблицы = Новый Структура();
	СтатистикаТаблицы.Вставить("ЕстьОшибка", Ложь);
	СтатистикаТаблицы.Вставить("ЕстьДоступнаяОтметка", Ложь);
	СтатистикаТаблицы.Вставить("ЕстьСопоставленныеОписи", Ложь);
	СтатистикаТаблицы.Вставить("ВсеСформированоПроведеноЛибоНеПредусмотрено", Ложь);
	СтатистикаТаблицы.Вставить("ВсеСформированоНеПроведеноЛибоНеПредусмотрено", Ложь);
	СтатистикаТаблицы.Вставить("КодыИндикатораОписи", Новый Соответствие());
	СтатистикаТаблицы.Вставить("КодыФормНеСформированоПолностью", Новый Соответствие());
	
	Возврат СтатистикаТаблицы;
	
КонецФункции

&НаСервере
Функция ДопустимоФормироватьОписи(ПризнакиРешения)
	
	Возврат ПризнакиРешения.Проведен
		И Не ПризнакиРешения.ЕстьОшибкиПостроенияЦепочки
		И Не ПризнакиРешения.Аннулировано;
		
КонецФункции

&НаСервере
Процедура ЗаполнитьКолонкиКодовФорм(НоваяСтрока, КодыФормСозданиеПредусмотрено,
			ДополнительныеПараметры, КодыФормНетПрав, ПараметрыПоиска)
	
	УстановленОтборПоКодуФормы = ДополнительныеПараметры.УстановленОтборПоКодуФормы;
	
	МассивКодовФормСозданиеПредусмотрено = ОбщегоНазначенияИСКлиентСервер.ПересечениеМассивов(
		НоваяСтрока.МассивКодовФорм, КодыФормСозданиеПредусмотрено);
	
	КодыФормОписей = ПолучитьКодыФормОписей(НоваяСтрока.МассивОписанийОписей);
	
	МассивКодовФормСозданиеНеобходимо = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		МассивКодовФормСозданиеПредусмотрено, КодыФормОписей);
	
	Если УстановленОтборПоКодуФормы Тогда
		МассивКодовФормСозданиеНеобходимо = ОбщегоНазначенияИСКлиентСервер.ПересечениеМассивов(
			МассивКодовФормСозданиеНеобходимо, ПараметрыПоиска.ОтборМассивКодовФорм);
	КонецЕсли;
	
	МассивКодовФормСозданиеВыбрано = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		МассивКодовФормСозданиеНеобходимо, КодыФормНетПрав);
	
	НоваяСтрока.МассивКодовФормСозданиеПредусмотрено= Новый ФиксированныйМассив(МассивКодовФормСозданиеПредусмотрено);
	НоваяСтрока.МассивКодовФормСозданиеНеобходимо	= Новый ФиксированныйМассив(МассивКодовФормСозданиеНеобходимо);
	НоваяСтрока.МассивКодовФормСозданиеВыбрано		= Новый ФиксированныйМассив(МассивКодовФормСозданиеВыбрано);
	
	НоваяСтрока.КодФормыСозданиеПредусмотрено	= СтрСоединить(МассивКодовФормСозданиеПредусмотрено, ", ");
	НоваяСтрока.КодФормыСозданиеНеобходимо		= СтрСоединить(МассивКодовФормСозданиеНеобходимо, ", ");
	НоваяСтрока.КодФормыСозданиеВыбрано			= СтрСоединить(МассивКодовФормСозданиеВыбрано, ", ");
	
КонецПроцедуры

&НаСервере
Функция ПодсчитатьОписиВТекущейСтроке(НоваяСтрока, ИменаДокументовСозданиеПредусмотрено, СоответствиеТипОписиИмяДокумента)

	Количество = НоваяСтрока.МассивОписанийОписей;
	КоличествоСозданиеПредусмотрено = 0;
	КоличествоСозданиеПредусмотреноПроведено = 0;
	
	КодыФорм = Новый Массив();
	
	ДублиПоКодуФормы = Новый Соответствие();
	
	Для Каждого ОписаниеОписи Из НоваяСтрока.МассивОписанийОписей Цикл
		КодФормы = ОписаниеОписи.КодФормы;
		
		Если КодыФорм.Найти(КодФормы) = Неопределено Тогда
			КодыФорм.Добавить(КодФормы);
		Иначе
			ДублиПоКодуФормы.Вставить(КодФормы);
		КонецЕсли;
		
		ИмяДокумента = СоответствиеТипОписиИмяДокумента.Получить(ТипЗнч(ОписаниеОписи.Ссылка));
		
		СозданиеПредусмотрено = (ИменаДокументовСозданиеПредусмотрено.Найти(ИмяДокумента) <> Неопределено);
		
		Если СозданиеПредусмотрено Тогда
			КоличествоСозданиеПредусмотрено = КоличествоСозданиеПредусмотрено + 1;
			
			Если ОписаниеОписи.Проведен Тогда
				КоличествоСозданиеПредусмотреноПроведено = КоличествоСозданиеПредусмотреноПроведено + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПодсчетОписей = Новый Структура();
	ПодсчетОписей.Вставить("Количество", Количество);
	ПодсчетОписей.Вставить("КоличествоСозданиеПредусмотрено", КоличествоСозданиеПредусмотрено);
	ПодсчетОписей.Вставить("КоличествоСозданиеПредусмотреноПроведено", КоличествоСозданиеПредусмотреноПроведено);
	ПодсчетОписей.Вставить("КодыФорм", КодыФорм);
	ПодсчетОписей.Вставить("ДублиПоКодуФормы", ДублиПоКодуФормы);
	
	Возврат ПодсчетОписей;
	
КонецФункции

&НаСервере
Функция ПолучитьКодыФормОписей(МассивОписанийОписей)
	
	КодыФормОписей = Новый Массив();
	
	Для Каждого ОписаниеОписи Из МассивОписанийОписей Цикл
		КодФормы = ОписаниеОписи.КодФормы;
		
		Если КодыФормОписей.Найти(КодФормы) = Неопределено Тогда
			КодыФормОписей.Добавить(КодФормы);
		КонецЕсли;
	КонецЦикла;
	
	Возврат КодыФормОписей;
	
КонецФункции

&НаСервере
Функция ДиагностироватьВозможностьСозданияПоПравам(
	Знач НоваяСтрока, Знач КодыФормНетПрав, Знач ПодсчетОписей, Знач УстановленОтборПоКодуФормы, Знач ОтборМассивКодовФорм,
	КодыФормНеСформированоПолностью)
	
	// Не сформированные полностью по Решению в целом.
	Для Каждого КодФормы Из НоваяСтрока.МассивКодовФормСозданиеНеобходимо Цикл
		КодыФормНеСформированоПолностью.Вставить(КодФормы, Истина);
	КонецЦикла;
	
	СозданиеНеобходимоИВозможно = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		НоваяСтрока.МассивКодовФормСозданиеНеобходимо, КодыФормНетПрав);
	
	ЕстьСозданиеНеобходимоИВозможно = (СозданиеНеобходимоИВозможно.Количество() > 0);
	
	// Необходимые к созданию, но без прав создания.
	// Цель: исключить диагностику ошибки "Нет прав" если для такого кода формы уже создана опись.
	// Ведь новую опись формировать в таком случае уже не нужно,
	// и сообщение об отсутствии прав не принесет пользы и будет лишним.
	ОстатокНетПрав = ОбщегоНазначенияКлиентСервер.РазностьМассивов(КодыФормНетПрав, ПодсчетОписей.КодыФорм);
	
	СозданиеНеобходимоИНевозможно = ОбщегоНазначенияИСКлиентСервер.ПересечениеМассивов(
	 	НоваяСтрока.МассивКодовФормСозданиеНеобходимо, КодыФормНетПрав);
	
	ЕстьСозданиеНеобходимоИНевозможно = (СозданиеНеобходимоИНевозможно.Количество() > 0);
	
	РезультатДиагностики = Новый Структура();
	РезультатДиагностики.Вставить("ЕстьВозможный", ЕстьСозданиеНеобходимоИВозможно);
	РезультатДиагностики.Вставить("ЕстьНевозможный", ЕстьСозданиеНеобходимоИНевозможно);
	
	Возврат РезультатДиагностики;
	
КонецФункции

#КонецОбласти

#Область НесопоставленныеОписи

&НаСервере
Функция НовыйТаблицаВизуализацииНесопоставленныхОписей()
	
	ТипДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипЧисло4 = ОбщегоНазначения.ОписаниеТипаЧисло(4, 0, ДопустимыйЗнак.Неотрицательный);
	ТипЧисло6 = ОбщегоНазначения.ОписаниеТипаЧисло(6, 0, ДопустимыйЗнак.Неотрицательный);
	ТипЧислоИндексКартинки = ОбщегоНазначения.ОписаниеТипаЧисло(2, 0, ДопустимыйЗнак.Любой);
	ТипКартинка = Новый ОписаниеТипов("Картинка");
	ТипЧисло1 = ОбщегоНазначения.ОписаниеТипаЧисло(1, 0, ДопустимыйЗнак.Неотрицательный);
	
	ТаблицаВизуализации = Новый ТаблицаЗначений();
	
	МассивТиповКФО = Новый Массив();
	МассивТиповКФО.Добавить(Тип("ПеречислениеСсылка.КВД"));
	МассивТиповКФО.Добавить(Тип("Строка"));
	
	МассивТиповСчет = Новый Массив();
	МассивТиповСчет.Добавить(Тип("ПланСчетовСсылка.ЕПСБУ"));
	МассивТиповСчет.Добавить(Тип("Строка"));
	
	// Сведения табличной части Объекты.
	ТаблицаВизуализации.Колонки.Добавить("НомерСтроки",							ТипЧисло6);
	ТаблицаВизуализации.Колонки.Добавить("КФО",									Новый ОписаниеТипов(МассивТиповКФО));
	ТаблицаВизуализации.Колонки.Добавить("Счет",								Новый ОписаниеТипов(МассивТиповСчет));
	ТаблицаВизуализации.Колонки.Добавить("Сотрудник",							Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ТаблицаВизуализации.Колонки.Добавить("ДатаИнвентаризации",					ТипДата);
	ТаблицаВизуализации.Колонки.Добавить("ДатаНачала",							ТипДата);
	ТаблицаВизуализации.Колонки.Добавить("ДатаОкончания",						ТипДата);
	ТаблицаВизуализации.Колонки.Добавить("НомерКомиссии",						ТипЧисло4);
	ТаблицаВизуализации.Колонки.Добавить("НомерРабочейКомиссии",				ТипЧисло4);
	ТаблицаВизуализации.Колонки.Добавить("МестоИнвентаризации",					Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.МестоИнвентаризацииНФА.Тип));
	ТаблицаВизуализации.Колонки.Добавить("КодФормы",							ТипСтрока);
	ТаблицаВизуализации.Колонки.Добавить("МассивКодовФорм",						Новый ОписаниеТипов("ФиксированныйМассив"));
	ТаблицаВизуализации.Колонки.Добавить("Комментарий",							ТипСтрока);
	
	// Блок сведений описи.
	ТаблицаВизуализации.Колонки.Добавить("ПредставлениеОписи",					ТипСтрока);
	ТаблицаВизуализации.Колонки.Добавить("ОписьСсылка");
	ТаблицаВизуализации.Колонки.Добавить("ИндексКартинкиОписьПроведена",		ТипЧислоИндексКартинки);
	
	ТаблицаВизуализации.Колонки.Добавить("НеСопоставленныеПоляШапки",			Новый ОписаниеТипов("Соответствие"));
	ТаблицаВизуализации.Колонки.Добавить("НеСопоставленныеЗначенияИзТаблиц",	Новый ОписаниеТипов("Структура"));
	
	ТаблицаВизуализации.Колонки.Добавить("ВыделитьКолонкуКФО",					ТипБулево);
	ТаблицаВизуализации.Колонки.Добавить("ВыделитьКолонкуСчет",					ТипБулево);
	ТаблицаВизуализации.Колонки.Добавить("ВыделитьКолонкуСотрудник",			ТипБулево);
	ТаблицаВизуализации.Колонки.Добавить("ВыделитьКолонкуДатаИнвентаризации",	ТипБулево);
	ТаблицаВизуализации.Колонки.Добавить("ВыделитьКолонкуДатаНачала",			ТипБулево);
	ТаблицаВизуализации.Колонки.Добавить("ВыделитьКолонкуДатаОкончания",		ТипБулево);
	ТаблицаВизуализации.Колонки.Добавить("ВыделитьКолонкуНомерКомиссии",		ТипБулево);
	ТаблицаВизуализации.Колонки.Добавить("ВыделитьКолонкуНомерРабочейКомиссии",	ТипБулево);
	ТаблицаВизуализации.Колонки.Добавить("ВыделитьКолонкуМестоИнвентаризации",	ТипБулево);
	ТаблицаВизуализации.Колонки.Добавить("ВыделитьКолонкуКодФормы",				ТипБулево);
	
	Возврат ТаблицаВизуализации;
	
КонецФункции

&НаСервере
Функция СформироватьТаблицуВизуализацииНесопоставленныхОписей(Данные, ДополнительныеПараметры, ПараметрыЗаполнения)
	
	УстановленОтборПоКодуФормы = ДополнительныеПараметры.УстановленОтборПоКодуФормы;
	
	ТаблицаВизуализации = НовыйТаблицаВизуализацииНесопоставленныхОписей();
	
	Поиск = Новый Структура("ЕстьСопоставленныеСтрокиТаблицыОбъекты", Ложь);
	
	НомерСтроки = 0;
	
	Для Каждого Элемент Из Данные.ТаблицыОписей Цикл
		ИмяДокумента = Элемент.Ключ;
		ТаблицыВидаОписей = Элемент.Значение;
		
		СтрокаТаблицыНастроек = Данные.ТаблицаНастроек.Найти(ИмяДокумента, "ИмяДокумента");
		
		МассивСтрок = ТаблицыВидаОписей.Шапки.НайтиСтроки(Поиск);
		
		Для Каждого СтрокаШапкиОписи Из МассивСтрок Цикл
			КодФормы = ИнвентаризацияСервер.ПолучитьКодФормыПоИмениДокумента(ИмяДокумента, Данные.ТаблицаНастроек);
			
			Если УстановленОтборПоКодуФормы
				И ПараметрыЗаполнения.ОтборМассивКодовФорм.Найти(КодФормы) = Неопределено Тогда
				// Код формы такого документа описи не соответствует установленному отбору.
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаВизуализации.Добавить();
			
			НомерСтроки = НомерСтроки + 1;
			
			НоваяСтрока.НомерСтроки = НомерСтроки;
			
			ИменаПолей = ?(СтрокаТаблицыНастроек.Приказ52н,
				ИнвентаризацияСервер.ПолучитьСтандартныйНаборПолейРешенияДляСопоставленияСШапкамиОписей52н(),
				ИнвентаризацияСервер.ПолучитьСтандартныйНаборПолейРешенияДляСопоставленияСШапкамиОписей61н());
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШапкиОписи, ИменаПолей);
			
			ЗаполнитьПредставленияПолейАналитикиВСтрокеНесопоставленныхОписей(НоваяСтрока,
				ИмяДокумента, СтрокаШапкиОписи, ТаблицыВидаОписей, Данные.ТаблицаНастроек);
			
			ВремМассив = Новый Массив();
			ВремМассив.Добавить(КодФормы);
			
			НоваяСтрока.МассивКодовФорм = Новый ФиксированныйМассив(ВремМассив);
			НоваяСтрока.КодФормы = КодФормы;
			
			ЗаполнитьБлокОписиСтрокиНесопоставленныхОписей(НоваяСтрока,
				ИмяДокумента, СтрокаШапкиОписи, ТаблицыВидаОписей, Данные);
				
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШапкиОписи, "НеСопоставленныеПоляШапки,НеСопоставленныеЗначенияИзТаблиц");
			
			ЗаполнитьКомментарийСтрокиНесопоставленныхОписей(
				НоваяСтрока, СтрокаШапкиОписи, Данные, ДополнительныеПараметры);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаВизуализации;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКомментарийСтрокиНесопоставленныхОписей(НоваяСтрока, СтрокаШапкиОписи,
		Данные, ДополнительныеПараметры)
	
	Перем СписокСчетов, МестаИнвентаризации;
	
	ШаблонРеквизитыШапки = НСтр("ru='%1 %2 шапки описи %3 в строках Решения.'");
	ШаблонСтрокиТаблицы = НСтр("ru='%1 %2 описи %3 в строках Решения.'");
	
	ШаблонИмяКолонкиВыделить = "ВыделитьКолонку%1";
	
	// Код формы.
	Если Данные.РазличныеКодыФорм.Найти(НоваяСтрока.КодФормы) = Неопределено Тогда
		НоваяСтрока[СтрШаблон(ШаблонИмяКолонкиВыделить, "КодФормы")] = Истина;
		
		НоваяСтрока.Комментарий = СтрШаблон(НСтр("ru='Код формы %1 отсутствует в строках Решения.'"), НоваяСтрока.КодФормы);
		
		Возврат;
	КонецЕсли;
	
	МассивТекстов = Новый Массив();
	
	// Поля шапки.
	ИменаПолейШапки = Новый Массив();
	
	СинонимыПолейРешения = ДополнительныеПараметры.СинонимыПолейРешения;
	
	Для Каждого Элемент Из СтрокаШапкиОписи.НеСопоставленныеПоляШапки Цикл
		ИмяПоля = Элемент.Ключ;
		
		СинонимПоля = СинонимыПолейРешения.Получить(ИмяПоля);
		
		Если СинонимПоля = Неопределено Тогда
			СинонимПоля = ИмяПоля;
		КонецЕсли;
		
		ИменаПолейШапки.Добавить(СинонимПоля);
		
		НоваяСтрока[СтрШаблон(ШаблонИмяКолонкиВыделить, ИмяПоля)] = Истина;
	КонецЦикла;
	
	Количество = ИменаПолейШапки.Количество();
	
	Если Количество > 0 Тогда
		ТекстРеквизиты = ?(Количество = 1, НСтр("ru='Значение реквизита'"), НСтр("ru='Значения реквизитов'"));
		ТекстНеНайдены = ?(Количество = 1, НСтр("ru='не найдено'"), НСтр("ru='не найдены'"));
		
		Текст = СтрШаблон(ШаблонРеквизитыШапки,
			ТекстРеквизиты,
			СтрСоединить(ИменаПолейШапки, ", "),
			ТекстНеНайдены);
			
		МассивТекстов.Добавить(Текст);
	КонецЕсли;
	
	// Строки таблицы СписокСчетов.
	Если СтрокаШапкиОписи.НеСопоставленныеЗначенияИзТаблиц <> Неопределено
		И СтрокаШапкиОписи.НеСопоставленныеЗначенияИзТаблиц.Свойство("СписокСчетов", СписокСчетов) Тогда
		
		МассивПредставлений = Новый Массив();
		
		Для Каждого СтруктураСтроки Из СписокСчетов Цикл
			КФО = ?(ЗначениеЗаполнено(СтруктураСтроки.КФО), Строка(СтруктураСтроки.КФО), "0");
			Счет = Строка(СтруктураСтроки.Счет);
			
			МассивПредставлений.Добавить(СтрШаблон("%1.%2", КФО, Счет));
		КонецЦикла;
		
		Количество = СписокСчетов.Количество();
		
		ТекстСчета = ?(Количество = 1, НСтр("ru='Счет'"), НСтр("ru='Счета'"));
		ТекстНеНайдены = ?(Количество = 1, НСтр("ru='не найден'"), НСтр("ru='не найдены'"));
		
		Текст = СтрШаблон(ШаблонСтрокиТаблицы,
			ТекстСчета,
			СтрСоединить(МассивПредставлений, ", "),
			ТекстНеНайдены);
			
		МассивТекстов.Добавить(Текст);
		
		НоваяСтрока[СтрШаблон(ШаблонИмяКолонкиВыделить, "КФО")] = Истина;
		НоваяСтрока[СтрШаблон(ШаблонИмяКолонкиВыделить, "Счет")] = Истина;
	КонецЕсли;
	
	// Строки таблицы МестаИнвентаризации.
	Если СтрокаШапкиОписи.НеСопоставленныеЗначенияИзТаблиц <> Неопределено
		И СтрокаШапкиОписи.НеСопоставленныеЗначенияИзТаблиц.Свойство("МестаИнвентаризации", МестаИнвентаризации) Тогда
		
		МассивПредставлений = Новый Массив();
		
		Для Каждого МестоИнвентаризации Из МестаИнвентаризации Цикл
			МассивПредставлений.Добавить(Строка(МестоИнвентаризации));
		КонецЦикла;
		
		Количество = МестаИнвентаризации.Количество();
		
		ТекстМестаИнвентаризации = ?(Количество = 1, НСтр("ru='Место инвентаризации'"), НСтр("ru='Места инвентаризации'"));
		ТекстНеНайдены = ?(Количество = 1, НСтр("ru='не найдено'"), НСтр("ru='не найдены'"));
		
		Текст = СтрШаблон(ШаблонСтрокиТаблицы,
			ТекстМестаИнвентаризации,
			СтрСоединить(МассивПредставлений, ", "),
			ТекстНеНайдены);
			
		МассивТекстов.Добавить(Текст);
		
		НоваяСтрока[СтрШаблон(ШаблонИмяКолонкиВыделить, "МестоИнвентаризации")] = Истина;
	КонецЕсли;
	
	Если МассивТекстов.Количество() > 0 Тогда
		Комментарий = СтрСоединить(МассивТекстов, Символы.ПС + Символы.ПС);
	Иначе
		Комментарий = НСтр("ru='Сочетание значений реквизитов шапки описи не найдено в строках Решения'");
	КонецЕсли;
	
	НоваяСтрока.Комментарий = Комментарий;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСинонимыПолейРешения()
	
	СинонимыПолейРешения = Новый Соответствие();
	СинонимыПолейРешения.Вставить("ДатаИнвентаризации",		НСтр("ru='Дата инвентаризации'"));
	СинонимыПолейРешения.Вставить("ДатаНачала",				НСтр("ru='Дата начала инвентаризации'"));
	СинонимыПолейРешения.Вставить("ДатаОкончания",			НСтр("ru='Дата окончания инвентаризации'"));
	СинонимыПолейРешения.Вставить("МестоИнвентаризации",	НСтр("ru='Место инвентаризации'"));
	СинонимыПолейРешения.Вставить("НомерКомиссии",			НСтр("ru='Номер комиссии'"));
	СинонимыПолейРешения.Вставить("НомерРабочейКомиссии",	НСтр("ru='Номер рабочей комиссии'"));
	
	Возврат СинонимыПолейРешения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПредставленияПолейАналитикиВСтрокеНесопоставленныхОписей(НоваяСтрока,
		ИмяДокумента, СтрокаШапкиОписи, ТаблицыВидаОписей, ТаблицаНастроек)
	
	Поиск = Новый Структура("ИмяДокумента", ИмяДокумента);
	
	СтрокаТаблицыНастроек = ТаблицаНастроек.НайтиСтроки(Поиск)[0];
	
	РасположениеРеквизитов = ИнвентаризацияСервер.ПолучитьОписаниеРасположенияРеквизитовОписи(СтрокаТаблицыНастроек);
	
	ОписьСсылка = СтрокаШапкиОписи.Ссылка;
	
	// КФО.
	РасположениеРеквизита = РасположениеРеквизитов.КФО;
	Если РасположениеРеквизита.РасположенВШапке Тогда
		ПредставлениеКФО = Строка(СтрокаШапкиОписи[РасположениеРеквизита.ИмяПоля]);
	ИначеЕсли РасположениеРеквизита.РасположенВТабличнойЧасти Тогда
		ПредставлениеКФО = СформироватьПредставлениеКолонкиТабличнойЧасти(
			РасположениеРеквизита, ОписьСсылка, ТаблицыВидаОписей);
	КонецЕсли;
	
	// Счет.
	РасположениеРеквизита = РасположениеРеквизитов.Счет;
	Если РасположениеРеквизита.РасположенВШапке Тогда
		ПредставлениеСчета = Строка(СтрокаШапкиОписи[РасположениеРеквизита.ИмяПоля]);
	ИначеЕсли РасположениеРеквизита.РасположенВТабличнойЧасти Тогда
		ПредставлениеСчета = СформироватьПредставлениеКолонкиТабличнойЧасти(
			РасположениеРеквизита, ОписьСсылка, ТаблицыВидаОписей);
	КонецЕсли;
	
	// Сотрудник.
	РасположениеРеквизита = РасположениеРеквизитов.Сотрудник;
	Если РасположениеРеквизита.Отсутствует Тогда
		Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
	Иначе
		Сотрудник = СтрокаШапкиОписи[РасположениеРеквизита.ИмяПоля];
	КонецЕсли;
	
	// МестоИнвентаризации.
	РасположениеРеквизита = РасположениеРеквизитов.МестоИнвентаризации;
	Если РасположениеРеквизита.РасположенВШапке Тогда
		ПредставлениеМестаИнвентаризации = Строка(СтрокаШапкиОписи[РасположениеРеквизита.ИмяПоля]);
	ИначеЕсли РасположениеРеквизита.РасположенВТабличнойЧасти Тогда
		ПредставлениеМестаИнвентаризации = СформироватьПредставлениеКолонкиТабличнойЧасти(
			РасположениеРеквизита, ОписьСсылка, ТаблицыВидаОписей);
	КонецЕсли;
	
	НоваяСтрока.КФО = ПредставлениеКФО;
	НоваяСтрока.Счет = ПредставлениеСчета;
	НоваяСтрока.Сотрудник = Сотрудник;
	НоваяСтрока.МестоИнвентаризации = ПредставлениеМестаИнвентаризации;
	
КонецПроцедуры

&НаСервере
Функция СформироватьПредставлениеКолонкиТабличнойЧасти(РасположениеРеквизита, ОписьСсылка, ТаблицыВидаОписей)
	
	Таблица = ТаблицыВидаОписей[РасположениеРеквизита.ИмяТабличнойЧасти];
	
	ИмяКолонки = РасположениеРеквизита.ИмяКолонки;
	
	Поиск = Новый Структура("Ссылка", ОписьСсылка);
	
	ВремТаблица = Таблица.Скопировать(Поиск, ИмяКолонки);
	ВремТаблица.Свернуть(ИмяКолонки);
	
	// Представление КФО0.
	Если ИмяКолонки = "КФО" Тогда
		Поиск = Новый Структура("КФО", Перечисления.КВД.ПустаяСсылка());
		
		МассивСтрок = ВремТаблица.НайтиСтроки(Поиск);
		
		Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
			СтрокаТаблицы.КФО = "0";
		КонецЦикла;
	КонецЕсли;
	
	МассивЗначений = ВремТаблица.ВыгрузитьКолонку(ИмяКолонки);
	
	Возврат СтрСоединить(МассивЗначений, ", ");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьБлокОписиСтрокиНесопоставленныхОписей(НоваяСтрока,
		ИмяДокумента, СтрокаШапкиОписи, ТаблицыВидаОписей, Данные)
	
	Шаблон = НСтр("ru='%1 от %2'");
	
	ОписьСсылка = СтрокаШапкиОписи.Ссылка;
	
	НомерДляПечати = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ОписьСсылка, СтрокаШапкиОписи.Номер);
	
	ПредставлениеОписи = СтрШаблон(Шаблон, НомерДляПечати, Формат(СтрокаШапкиОписи.Дата, "ДФ=dd.MM.yyyy"));
	
	НоваяСтрока.ПредставлениеОписи = ПредставлениеОписи;
	НоваяСтрока.ОписьСсылка = ОписьСсылка;
	
	// Индексы картинок коллекции СостояниеДокументаИДвижений.
	Если СтрокаШапкиОписи.Проведен Тогда
		ИндексКартинкиОписьПроведена = 1; // проведен зеленый.
	Иначе
		ИндексКартинкиОписьПроведена = 0; // не проведен.
	КонецЕсли;
	
	НоваяСтрока.ИндексКартинкиОписьПроведена = ИндексКартинкиОписьПроведена;
	
КонецПроцедуры

#КонецОбласти


#Область НастройкаФормыПослеЗаполнения

&НаСервере
Процедура СброситьНадписиНеобходимоОбновить()
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("НадписьНеобходимоОбновитьТаблицаРешения");
	ИменаЭлементов.Добавить("НадписьНеобходимоОбновитьТаблицаНесопоставленныеОписи");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов, "Видимость", Ложь);
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("ТаблицаРешения");
	ИменаЭлементов.Добавить("ТаблицаНесопоставленныхОписей");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов, "ЦветФона", Новый Цвет());
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСведенияОПоследнемИзменении(ПризнакиРешения)
	
	КоличествоИзменений = ПризнакиРешения.КоличествоИзменений;
	
	ТекстНомерИзменения = Формат(КоличествоИзменений, "ЧГ=0;ЧН=0");
	
	ТекстТипИзменения = ?(ПризнакиРешения.Аннулировано,
		НСтр("ru='аннулирующее'"),
		НСтр("ru='корректирующее'"));
	
	ПредставлениеНомераИзменения = СтрШаблон(НСтр("ru='%1, %2'"), ТекстНомерИзменения, ТекстТипИзменения);
	
	ПоследнееИзменение			= ПризнакиРешения.ПоследнееИзменение;
	ПредставлениеНомераИзменения	= ПредставлениеНомераИзменения;
	
	Элементы.ПредставлениеНомераИзменения.Видимость = (КоличествоИзменений > 0);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОбъединениеСтрок(ТаблицаВизуализацииРешения, ДополнительныеПараметры)
	
	НастройкиОбъединенияСтрокНаФорме = НовыйНастройкиОбъединенияСтрокНаФорме();
	
	КодыФормСДоступнойОтметкой = ПолучитьКодыФормСДоступнойОтметкой(ТаблицаВизуализацииРешения);
	
	НастроитьВидимостьНастроекОбъединенияСтрок(НастройкиОбъединенияСтрокНаФорме,
		КодыФормСДоступнойОтметкой, ДополнительныеПараметры);
	
	УстановитьЗначенияНастроекОбъединенияСтрок(НастройкиОбъединенияСтрокНаФорме,
		КодыФормСДоступнойОтметкой);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКодыФормСДоступнойОтметкой(ТаблицаВизуализацииРешения)
	
	УникальныеЗначения = Новый Соответствие();
	
	Для Каждого СтрокаТаблицы Из ТаблицаВизуализацииРешения Цикл
		Для Каждого КодФормы Из СтрокаТаблицы.МассивКодовФорм Цикл
			Если СтрокаТаблицы.ОтметкаДоступна Тогда
				УникальныеЗначения.Вставить(КодФормы, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ВремСписок = Новый СписокЗначений();
	
	Для Каждого Элемент Из УникальныеЗначения Цикл
		ВремСписок.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	ВремСписок.СортироватьПоЗначению();
	
	Возврат ВремСписок.ВыгрузитьЗначения();
	
КонецФункции

&НаСервере
Процедура НастроитьВидимостьНастроекОбъединенияСтрок(НастройкиОбъединенияСтрокНаФорме,
		КодыФормСДоступнойОтметкой, ДополнительныеПараметры)
	
	// Если некоторый код формы отсутствует в строках Решения, то скрываем его настройки объединения строк.
	
	КоличествоСкрытыхНастроекСчет = 0;
	КоличествоСкрытыхНастроекМестоИнвентаризации = 0;
	
	Для Каждого КодФормы Из НастройкиОбъединенияСтрокНаФорме.ОбщийСписокКодовФорм Цикл
		ИмяФлажкаСчет = ПолучитьИмяФлажкаНастройкиОбъединенияПоСчетам(КодФормы);
		ИмяФлажкаМестоИнвентаризации = ПолучитьИмяФлажкаНастройкиОбъединенияПоМестамИнвентаризации(КодФормы);
		
		ИменаЭлементов = Новый Массив();
		ИменаЭлементов.Добавить(СтрШаблон("ДекорацияОбъединитьСтроки%1", КодФормы));
		ИменаЭлементов.Добавить(ИмяФлажкаСчет);
		ИменаЭлементов.Добавить(ИмяФлажкаМестоИнвентаризации);
		
		ОписьДоступнаКОтметкеВРешении = (КодыФормСДоступнойОтметкой.Найти(КодФормы) <> Неопределено);
		
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов,
			"Видимость", ОписьДоступнаКОтметкеВРешении);
		
		Если Не ОписьДоступнаКОтметкеВРешении И НастройкиОбъединенияСтрокНаФорме.ПоСчетам.Найти(КодФормы) <> Неопределено Тогда
			КоличествоСкрытыхНастроекСчет = КоличествоСкрытыхНастроекСчет + 1;
		КонецЕсли;
		
		Если Не ОписьДоступнаКОтметкеВРешении И НастройкиОбъединенияСтрокНаФорме.ПоМестамИнвентаризации.Найти(КодФормы) <> Неопределено Тогда
			КоличествоСкрытыхНастроекМестоИнвентаризации = КоличествоСкрытыхНастроекМестоИнвентаризации + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Видимость настроек в целом.
	ЕстьНастройкиПоСчетам =
		(НастройкиОбъединенияСтрокНаФорме.ПоСчетам.Количество() > КоличествоСкрытыхНастроекСчет);
	
	ЕстьНастройкиПоМестамИнвентаризации =
		(НастройкиОбъединенияСтрокНаФорме.ПоМестамИнвентаризации.Количество() > КоличествоСкрытыхНастроекМестоИнвентаризации);
	
	ЕстьНастройкиОбъединенияСтрок = ЕстьНастройкиПоСчетам Или ЕстьНастройкиПоМестамИнвентаризации;
	
	ДополнительныеПараметры.ЕстьНастройкиОбъединенияСтрок = ЕстьНастройкиОбъединенияСтрок;
	
	Элементы.ДекорацияНеПредусмотреноОбъединениеСтрок.Видимость = Не ЕстьНастройкиОбъединенияСтрок;
	
	Элементы.ГруппаОбъединитьСтрокиКоманднаяПанель.Видимость = ЕстьНастройкиОбъединенияСтрок;
	Элементы.ГруппаОбъединитьСтрокиКолонкаНадписи.Видимость = ЕстьНастройкиОбъединенияСтрок;
	
	Элементы.ГруппаОбъединитьСтрокиКолонкаСчета.Видимость = ЕстьНастройкиПоСчетам;
	Элементы.ГруппаОбъединитьСтрокиКолонкаМестаИнвентаризации.Видимость = ЕстьНастройкиПоМестамИнвентаризации;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияНастроекОбъединенияСтрок(НастройкиОбъединенияСтрокНаФорме,
		КодыФормСДоступнойОтметкой)
	
	// Если некоторый код формы есть в строках Решения, то устанавливаем его флажки значениями по умолчанию.
	// Если некоторый код формы отсутствует в строках Решения, то сбрасываем все его флажки.
	
	НастройкиОбъединенияСтрокПоУмолчанию = НастройкиОбъединенияСтрокПоУмолчанию;
	
	ЗначенияРеквизитов = Новый Структура();
	
	Для Каждого КодФормы Из НастройкиОбъединенияСтрокНаФорме.ОбщийСписокКодовФорм Цикл
		ОписьДоступнаКОтметкеВРешении = (КодыФормСДоступнойОтметкой.Найти(КодФормы) <> Неопределено);
		
		ИмяФлажкаСчет = ПолучитьИмяФлажкаНастройкиОбъединенияПоСчетам(КодФормы);
		ИмяФлажкаМестоИнвентаризации = ПолучитьИмяФлажкаНастройкиОбъединенияПоМестамИнвентаризации(КодФормы);
		
		ЕстьФлажокСчет = НастройкиОбъединенияСтрокПоУмолчанию.Свойство(ИмяФлажкаСчет);
		ЕстьФлажокМестоИнвентаризации = НастройкиОбъединенияСтрокПоУмолчанию.Свойство(ИмяФлажкаМестоИнвентаризации);
		
		Если ЕстьФлажокСчет Тогда
			ЗначениеФлажка = ОписьДоступнаКОтметкеВРешении И НастройкиОбъединенияСтрокПоУмолчанию[ИмяФлажкаСчет];
			
			ЗначенияРеквизитов.Вставить(ИмяФлажкаСчет,ЗначениеФлажка);
		КонецЕсли;
		
		Если ЕстьФлажокМестоИнвентаризации Тогда
			ЗначениеФлажка = ОписьДоступнаКОтметкеВРешении И НастройкиОбъединенияСтрокПоУмолчанию[ИмяФлажкаМестоИнвентаризации];
			
			ЗначенияРеквизитов.Вставить(ИмяФлажкаМестоИнвентаризации, ЗначениеФлажка);
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьФормированияОписей(ПризнакиРешения, ДополнительныеПараметры)
	
	ДопустимоФормироватьОписи = ДопустимоФормироватьОписи(ПризнакиРешения);
	
	Элементы.ТаблицаРешенияОтметка.ТолькоПросмотр = Не ДопустимоФормироватьОписи;
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("ТаблицаРешенияГруппаНастроитьОтметки");
	ИменаЭлементов.Добавить("СформироватьОписи");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов,
		"Доступность", ДопустимоФормироватьОписи);
	
	Элементы.ТаблицаРешения.ЦветФона = ?(ДопустимоФормироватьОписи,
		Новый Цвет(),
		ПолучитьЦветФонаНедоступнойТаблицы());
		
	ТекстНадписиНеопределено = "";
	
	ВидимостьНадписиНеопределено = Ложь;
	
	Если ПризнакиРешения.ЕстьОшибкиПостроенияЦепочки Тогда
		ВидимостьНадписиНеопределено = Истина;
		ТекстНадписиНеопределено = НСтр("ru='Содержимое Решения не может быть определено при наличии ошибок построения цепочки документов'");

	ИначеЕсли ПризнакиРешения.ПометкаУдаления Тогда
		ВидимостьНадписиНеопределено = Истина;
		ТекстНадписиНеопределено = НСтр("ru='Содержимое Решения не может быть определено для помеченного на удаление документа'");
	КонецЕсли;
	
	ЭлементНадписи = Элементы.НадписьСодержимоеРешенияНеопределено;
	
	ЭлементНадписи.Видимость = ВидимостьНадписиНеопределено;
	ЭлементНадписи.Заголовок = ТекстНадписиНеопределено;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьМенюОтбораСтрокТаблицыРешения(ДополнительныеПараметры)
	
	СтатистикаТаблицыВизуализацииРешения = ДополнительныеПараметры.СтатистикаТаблицыВизуализацииРешения;
	
	КодыИндикатораОписи		= СтатистикаТаблицыВизуализацииРешения.КодыИндикатораОписи;
	ЕстьОшибка				= СтатистикаТаблицыВизуализацииРешения.ЕстьОшибка;
	ЕстьСопоставленныеОписи	= СтатистикаТаблицыВизуализацииРешения.ЕстьСопоставленныеОписи;
	
	СостоянияИндикатораОписи = ДополнительныеПараметры.СостоянияИндикатораОписи;
	
	КодОжидается						= СостоянияИндикатораОписи.Ожидается.Код;
	КодДокументСозданПроведен			= СостоянияИндикатораОписи.ДокументСозданПроведен.Код;
	КодДокументСозданНеПроведен			= СостоянияИндикатораОписи.ДокументСозданНеПроведен.Код;
	КодНеПредусмотреноЗаконодательством	= СостоянияИндикатораОписи.НеПредусмотреноЗаконодательством.Код;
	КодНеПредусмотреноОбработкой		= СостоянияИндикатораОписи.НеПредусмотреноОбработкой.Код;
	
	ВидимостьКнопок = Новый Структура();
	ВидимостьКнопок.Вставить("ПоказатьОшибки", Ложь);
	ВидимостьКнопок.Вставить("ПоказатьОжидается", Ложь);
	ВидимостьКнопок.Вставить("ПоказатьСозданПроведен", Ложь);
	ВидимостьКнопок.Вставить("ПоказатьСозданНеПроведен", Ложь);
	ВидимостьКнопок.Вставить("ПоказатьСозданЛюбой", Ложь);
	ВидимостьКнопок.Вставить("ПоказатьНеПредусмотреноЗаконодательством", Ложь);
	ВидимостьКнопок.Вставить("ПоказатьНеПредусмотреноОбработкой", Ложь);
	
	КоличествоВидимых = 0;
	
	Если ЕстьСопоставленныеОписи Тогда
		ВидимостьКнопок.ПоказатьСозданЛюбой = Истина;
		КоличествоВидимых = КоличествоВидимых + 1;
	КонецЕсли;
	
	Для Каждого Элемент Из КодыИндикатораОписи Цикл
		КодИндикатора = Элемент.Ключ;
		
		Если КодИндикатора = КодОжидается Тогда
			ВидимостьКнопок.ПоказатьОжидается = Истина;
			КоличествоВидимых = КоличествоВидимых + 1;
			
		ИначеЕсли КодИндикатора = КодДокументСозданПроведен Тогда
			ВидимостьКнопок.ПоказатьСозданПроведен = Истина;
			КоличествоВидимых = КоличествоВидимых + 1;
			
		ИначеЕсли КодИндикатора = КодДокументСозданНеПроведен Тогда
			ВидимостьКнопок.ПоказатьСозданНеПроведен = Истина;
			КоличествоВидимых = КоличествоВидимых + 1;
			
		ИначеЕсли КодИндикатора = КодНеПредусмотреноЗаконодательством Тогда
			ВидимостьКнопок.ПоказатьНеПредусмотреноЗаконодательством = Истина;
			КоличествоВидимых = КоличествоВидимых + 1;
			
		ИначеЕсли КодИндикатора = КодНеПредусмотреноОбработкой Тогда
			ВидимостьКнопок.ПоказатьНеПредусмотреноОбработкой = Истина;
			КоличествоВидимых = КоличествоВидимых + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьОшибка Тогда
		ВидимостьКнопок.ПоказатьОшибки = Истина;
		КоличествоВидимых = КоличествоВидимых + 1;
	КонецЕсли;
	
	Для Каждого Элемент Из ВидимостьКнопок Цикл
		ИмяКнопки = Элемент.Ключ;
		ВидимостьКнопки = Элемент.Значение;
		
		ЭлементКнопки = Элементы["ТаблицаРешения" + ИмяКнопки];
		
		ЭлементКнопки.Видимость = ВидимостьКнопки;
		ЭлементКнопки.Пометка = Ложь;
	КонецЦикла;
	
	Элементы.ТаблицаРешения.ОтборСтрок = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьИндикаторыРешения(Данные, ДополнительныеПараметры, ПараметрыПоиска)
	
	ВидимостьИндикаторов = Новый Структура();
	ВидимостьИндикаторов.Вставить("ОшибкиЦепочки", Ложь);
	ВидимостьИндикаторов.Вставить("Предупреждение", Ложь);
	ВидимостьИндикаторов.Вставить("НетПрав", Ложь);
	ВидимостьИндикаторов.Вставить("Отбор", Ложь);
	ВидимостьИндикаторов.Вставить("ОписиСформированы", Ложь);
	
	// Индикатор "Ошибки цепочки".
	НастроитьИндикаторОшибкиЦепочки(Данные, ДополнительныеПараметры, ВидимостьИндикаторов);
	
	// Индикатор "Предупреждение".
	НастроитьИндикаторПредупреждение(Данные, ДополнительныеПараметры, ВидимостьИндикаторов);
		
	// Индикатор "Нет прав".
	НастроитьИндикаторНетПрав(Данные, ДополнительныеПараметры, ВидимостьИндикаторов);
	
	// Индикатор "Отбор".
	НастроитьИндикаторОтбор(Данные, ДополнительныеПараметры, ПараметрыПоиска, ВидимостьИндикаторов);
	
	// Индикатор "Описи сформированы".
	НастроитьИндикаторОписиСформированы(Данные, ДополнительныеПараметры, ВидимостьИндикаторов);
		
КонецПроцедуры

&НаСервере
Процедура НастроитьИндикаторОшибкиЦепочки(Знач Данные, Знач ДополнительныеПараметры, ВидимостьИндикаторов)
	
	ПризнакиРешения	= Данные.ПризнакиРешения;
	
	ВидимостьИндикатора = ПризнакиРешения.ЕстьОшибкиПостроенияЦепочки;
	
	АдресХранилищаОшибкиЦепочки = "";
	
	Если ВидимостьИндикатора Тогда
		ГруппироватьПоРешению = Ложь;
		
		ТабДокумент = ИнвентаризацияСервер.ЗаполнитьТабличныйДокументСпискаОшибок(ПризнакиРешения.ТаблицаОшибок, ГруппироватьПоРешению);
		
		АдресХранилищаОшибкиЦепочки = ПоместитьВоВременноеХранилище(ТабДокумент, УникальныйИдентификатор);
	КонецЕсли;
	
	ПризнакиРешения.ТаблицаОшибок = Неопределено; // Это значение более не требуется, и к том же не может быть передано на форму документа.
	
	Элементы.ГруппаИндикаторОшибкиЦепочки.Видимость = ВидимостьИндикатора;
	
	ВидимостьИндикаторов.ОшибкиЦепочки = ВидимостьИндикатора;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьИндикаторПредупреждение(Знач Данные, Знач ДополнительныеПараметры, ВидимостьИндикаторов)
	
	ПризнакиРешения = Данные.ПризнакиРешения;
	
	ВидимостьИндикатора = Ложь;
	ТекстПредупреждения = "";
	
	Если Не ВидимостьИндикаторов.ОшибкиЦепочки Тогда
		Если ПризнакиРешения.ПометкаУдаления Тогда
			ВидимостьИндикатора = Истина;
			ТекстПредупреждения = НСтр("ru='Документ помечен на удаление и не участвует в построении цепочки документов'");
			
		ИначеЕсли ПризнакиРешения.Аннулировано Тогда
			ВидимостьИндикатора = Истина;
			ТекстПредупреждения = НСтр("ru='Решение аннулировано'");
			
		ИначеЕсли Не ПризнакиРешения.Проведен Тогда
			ВидимостьИндикатора = Истина;
			ТекстПредупреждения = НСтр("ru='Решение не проведено'");
		КонецЕсли;
	КонецЕсли;
	
	Элементы.НадписьИндикаторПредупреждениеКомментарий.Заголовок = ТекстПредупреждения;
	
	Элементы.ГруппаИндикаторПредупреждение.Видимость = ВидимостьИндикатора;
	
	ВидимостьИндикаторов.Предупреждение = ВидимостьИндикатора;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьИндикаторНетПрав(Знач Данные, Знач ДополнительныеПараметры, ВидимостьИндикаторов)
	
	КодыФормНетПравИНеСформированоПолностью = ПолучитьКодыФормНетПравИНеСформированоПолностью(
		ДополнительныеПараметры.ПраваСоздания, ДополнительныеПараметры.СтатистикаТаблицыВизуализацииРешения.КодыФормНеСформированоПолностью);
	
	ВидимостьИндикатора = (КодыФормНетПравИНеСформированоПолностью.Количество() > 0)
		И Не ВидимостьИндикаторов.ОшибкиЦепочки
		И Не ВидимостьИндикаторов.Предупреждение;
	
	ТекстКомментария = "";
	ТекстРасширеннойПодсказки = "";
	
	Если ВидимостьИндикатора Тогда
		ТекстыИндикатора = ПолучитьТекстыИндикатораНетПрав(
			ДополнительныеПараметры.ПраваСоздания, КодыФормНетПравИНеСформированоПолностью);
		
		ТекстКомментария = ТекстыИндикатора.ТекстКомментария;
		ТекстРасширеннойПодсказки = ТекстыИндикатора.ТекстРасширеннойПодсказки;
	КонецЕсли;
	
	ЭлементНадписи = Элементы.НадписьИндикаторНетПравКомментарий;
	
	ЭлементНадписи.Заголовок = ТекстКомментария;
	ЭлементНадписи.РасширеннаяПодсказка.Заголовок = ТекстРасширеннойПодсказки;
	
	Элементы.ГруппаИндикаторНетПрав.Видимость = ВидимостьИндикатора;
	
	ВидимостьИндикаторов.НетПрав = ВидимостьИндикатора;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьИндикаторОтбор(Знач Данные, Знач ДополнительныеПараметры,
		Знач ПараметрыПоиска, ВидимостьИндикаторов)
	
	ВидимостьИндикатора = (ПараметрыПоиска.ОтборМассивКодовФорм.Количество() > 0);
	
	ТекстНадписи = ПолучитьТекстИндикатораОтбор(ПараметрыПоиска);
	
	Элементы.НадписьИндикаторОтбор.Заголовок = ТекстНадписи;
	
	Элементы.ГруппаИндикаторОтбор.Видимость = ВидимостьИндикатора;
	
	ВидимостьИндикаторов.Отбор = ВидимостьИндикатора;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьИндикаторОписиСформированы(Знач Данные, Знач ДополнительныеПараметры, ВидимостьИндикаторов)
	
	СостоянияИндикатораОписи				= ДополнительныеПараметры.СостоянияИндикатораОписи;
	СтатистикаТаблицыВизуализацииРешения	= ДополнительныеПараметры.СтатистикаТаблицыВизуализацииРешения;
	
	ТекстНадписи = "";
	Картинка = Новый Картинка();
	
	ВидимостьИндикатора = Не ВидимостьИндикаторов.ОшибкиЦепочки
		И Не ВидимостьИндикаторов.Предупреждение
		И СтатистикаТаблицыВизуализацииРешения.ЕстьСопоставленныеОписи
		И (СтатистикаТаблицыВизуализацииРешения.ВсеСформированоПроведеноЛибоНеПредусмотрено
			Или СтатистикаТаблицыВизуализацииРешения.ВсеСформированоНеПроведеноЛибоНеПредусмотрено);
			
	Если ВидимостьИндикатора Тогда
		Если СтатистикаТаблицыВизуализацииРешения.ВсеСформированоПроведеноЛибоНеПредусмотрено Тогда
			ТекстНадписи = НСтр("ru='Все документы описей сформированы и проведены'");
			Картинка = СостоянияИндикатораОписи.ДокументСозданПроведен.Картинка;
			
		ИначеЕсли СтатистикаТаблицыВизуализацииРешения.ВсеСформированоНеПроведеноЛибоНеПредусмотрено Тогда
			ТекстНадписи = НСтр("ru='Все документы описей сформированы'");
			Картинка = СостоянияИндикатораОписи.ДокументСозданНеПроведен.Картинка;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.НадписьИндикаторОписиСформированы.Заголовок = ТекстНадписи;
	Элементы.КартинкаИндикаторОписиСформированы.Картинка = Картинка;
	
	Элементы.ГруппаИндикаторОписиСформированы.Видимость = ВидимостьИндикатора;
	
	ВидимостьИндикаторов.ОписиСформированы = ВидимостьИндикатора;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКодыФормНетПравИНеСформированоПолностью(ПраваСоздания, КодыФормНеСформированоПолностью)
	
	// Цель: исключить вывод индикатора "Нет прав" для кодов форм, по которым
	// полностью сформированы описи (по всем соответствующим строкам Решения).
	// Описи таких кодов форм создавать не нужно, они уже созданы,
	// поэтому сообщение о недостатке прав создания документа не требуется.
	
	КодыФормНетПрав = ПраваСоздания.КодыФормНетПрав;
	
	КодыФорм = Новый Массив();
	
	Для Каждого КодФормы Из КодыФормНетПрав Цикл
		Если КодыФормНеСформированоПолностью.Получить(КодФормы) <> Неопределено Тогда
			КодыФорм.Добавить(КодФормы);
		КонецЕсли;
	КонецЦикла;
	
	Возврат КодыФорм;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстыИндикатораНетПрав(ПраваСоздания,
		КодыФормНетПравИНеСформированоПолностью)
	
	СписокНедоступныхДокументов = ПраваСоздания.СписокНедоступныхДокументов;
	
	КоличествоНедоступных = КодыФормНетПравИНеСформированоПолностью.Количество();
	
	Если КоличествоНедоступных = 1 Тогда
		ШаблонКодыФорм = НСтр("ru='описи %1'");
	ИначеЕсли КоличествоНедоступных > 1 Тогда
		ШаблонКодыФорм = НСтр("ru='описей %1'");
	КонецЕсли;
	
	ШрифтЖирный = Новый Шрифт(,, Истина);
	
	МассивТекстов = Новый Массив();
	
	ТекстКодыФорм = СтрШаблон(ШаблонКодыФорм, СтрСоединить(КодыФормНетПравИНеСформированоПолностью, ", "));
	
	ТекстКомментария = СтрШаблон(НСтр("ru='Отсутствует право создания %1'"), ТекстКодыФорм);
	
	Для Каждого КодФормы Из КодыФормНетПравИНеСформированоПолностью Цикл
		ЭтоПервыйДокумент = Истина;
		
		Для Каждого Элемент Из СписокНедоступныхДокументов Цикл
			КодФормыЭлемента = Элемент.Представление;
			ИмяДокумента = Элемент.Значение;
			
			Если КодФормыЭлемента <> КодФормы Тогда
				Продолжить;
			КонецЕсли;
			
			СинонимДокумента = Метаданные.Документы.Найти(ИмяДокумента).Синоним;
			
			Если МассивТекстов.Количество() > 0 Тогда
				МассивТекстов.Добавить(Символы.ПС);
			КонецЕсли;
			
			Если ЭтоПервыйДокумент Тогда
				МассивТекстов.Добавить(Новый ФорматированнаяСтрока(КодФормы, ШрифтЖирный));
				МассивТекстов.Добавить(СтрШаблон(" - %1", СинонимДокумента));
			Иначе
				МассивТекстов.Добавить(СтрШаблон("   %1", СинонимДокумента));
			КонецЕсли;
			
			ЭтоПервыйДокумент = Ложь;
		КонецЦикла;
	КонецЦикла;
	
	ТекстыИндикатора = Новый Структура();
	ТекстыИндикатора.Вставить("ТекстКомментария", ТекстКомментария);
	ТекстыИндикатора.Вставить("ТекстРасширеннойПодсказки", Новый ФорматированнаяСтрока(МассивТекстов));
	
	Возврат ТекстыИндикатора;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстИндикатораОтбор(ПараметрыПоиска)
	
	МассивКодов = ПараметрыПоиска.ОтборМассивКодовФорм;
	
	ТекстНадписи = "";
	
	КоличествоЭлементов = МассивКодов.Количество();
	
	Если КоличествоЭлементов > 0 Тогда
		Если КоличествоЭлементов = 1 Тогда
			Шаблон = НСтр("ru='коду формы %1'");
		ИначеЕсли КоличествоЭлементов > 1 Тогда
			Шаблон = НСтр("ru='кодам форм %1'");
		КонецЕсли;
		
		ТекстКодыФорм = СтрШаблон(Шаблон, СтрСоединить(МассивКодов, ", "));
		
		ТекстНадписи = СтрШаблон(НСтр("ru='Установлен отбор по %1'"), ТекстКодыФорм);
	КонецЕсли;
	
	Возврат ТекстНадписи;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокДокументовНедоступныхДляСоздания(КодыФорм, СвойстваКодовФормСозданиеПредусмотрено)
	
	// Проверяем право создания только тех документов, которые может создавать обработка группового формирования описей.
	
	СписокДокументов = Новый СписокЗначений();
	
	Для Каждого КодФормы Из КодыФорм Цикл
		ИмяДокумента = СвойстваКодовФормСозданиеПредусмотрено.Получить(КодФормы).ИмяДокумента;
		
		Если Не ПравоДоступа("Добавление", Метаданные.Документы.Найти(ИмяДокумента)) Тогда
			СписокДокументов.Добавить(ИмяДокумента, КодФормы);
		КонецЕсли;
	КонецЦикла;
	
	СписокДокументов.СортироватьПоПредставлению();
	
	Возврат СписокДокументов;
	
КонецФункции

#КонецОбласти



#КонецОбласти

#Область РасчетДокументов

&НаСервере
Функция НовыйПараметрыРасчетаИндексовСтрокТаблицыРешения()
	
	ПараметрыРасчета = Новый Структура();
	ПараметрыРасчета.Вставить("РешениеСсылка");
	ПараметрыРасчета.Вставить("НастройкиОбъединенияСтрок");
	ПараметрыРасчета.Вставить("ОтмеченныеСтрокиТаблицыРешения");
	
	Возврат ПараметрыРасчета;
	
КонецФункции

&НаСервере
Функция РассчитатьИндексыСтрокТаблицыРешения(АдресХранилища)
	
	// См. НовыйПараметрыРасчетаИндексовСтрокТаблицыРешения().
	ПараметрыРасчета = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	РешениеСсылка					= ПараметрыРасчета.РешениеСсылка;
	НастройкиОбъединенияСтрок		= ПараметрыРасчета.НастройкиОбъединенияСтрок;
	ОтмеченныеСтрокиТаблицыРешения	= ПараметрыРасчета.ОтмеченныеСтрокиТаблицыРешения;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РешениеСсылка, "Дата,Организация");
	
	Организация = ЗначенияРеквизитов.Организация;
	ДатаРешения = ЗначенияРеквизитов.Дата;
	
	ТаблицаНастроек = ИнвентаризацияСервер.ПолучитьТаблицуНастроекЗаполненияОписейПоРешению(, Истина, Организация);
	
	МассивКодовФормКСозданию = Неопределено;
	
	СоздатьКолонкиБыстрогоПоиска(ОтмеченныеСтрокиТаблицыРешения, МассивКодовФормКСозданию);
	
	СвойстваКодовФормСозданиеПредусмотрено = ПолучитьСвойстваКодовФормСозданиеПредусмотрено(
		ТаблицаНастроек, ДатаРешения);
	
	ВсеИндексыСтрок = Новый Соответствие();
	
	Для Каждого КодФормы Из МассивКодовФормКСозданию Цикл
		СвойстваКодаФормы = СвойстваКодовФормСозданиеПредусмотрено.Получить(КодФормы);
		
		ИндексыСтрокДокументов = РассчитатьИндексыСтрокДокументов(ОтмеченныеСтрокиТаблицыРешения,
			КодФормы, СвойстваКодаФормы, НастройкиОбъединенияСтрок);
		
		ВсеИндексыСтрок.Вставить(КодФормы, ИндексыСтрокДокументов);
	КонецЦикла;
	
	РезультатРасчета = ИнвентаризацияСервер.НовыйРезультатРасчетаИндексовСтрокТаблицыРешенияДляГрупповогоФормированияОписей();
	РезультатРасчета.ПараметрыРасчета = ПараметрыРасчета;
	РезультатРасчета.СвойстваКодовФормСозданиеПредусмотрено = СвойстваКодовФормСозданиеПредусмотрено;
	РезультатРасчета.ВсеИндексыСтрок = ВсеИндексыСтрок;
	РезультатРасчета.МассивКодовФормКСозданию = МассивКодовФормКСозданию;
	
	ПоместитьВоВременноеХранилище(РезультатРасчета, АдресХранилища);
	
	РезультатПроверки = ПроверитьРезультатРасчетаДокументовОписей(РезультатРасчета);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Функция РассчитатьИндексыСтрокДокументов(ТаблицаРешения,
		КодФормы, СвойстваКодаФормы, НастройкиОбъединенияСтрок)
	
	ИмяКолонки = ПолучитьИмяКолонкиДляБыстрогоПоиска(КодФормы);
	
	ПоискВОбщейТаблице = Новый Структура(ИмяКолонки, Истина);
	
	СвернутаяТаблицаРешения = ТаблицаРешения.Скопировать(ПоискВОбщейТаблице);
	
	КолонкиГруппировок = СтрРазделить("ДатаИнвентаризации,ДатаНачала,ДатаОкончания,НомерКомиссии,НомерРабочейКомиссии,Сотрудник", ", ", Ложь);
	
	Если СвойстваКодаФормы.РасположениеРеквизитов.Счет.РасположенВШапке
		Или СвойстваКодаФормы.РасположениеРеквизитов.Счет.Отсутствует Тогда
		КолонкиГруппировок.Добавить("КФО");
		КолонкиГруппировок.Добавить("Счет");
		
	ИначеЕсли СвойстваКодаФормы.РасположениеРеквизитов.Счет.РасположенВТабличнойЧасти Тогда
		ИмяФлажкаСчет = ПолучитьИмяФлажкаНастройкиОбъединенияПоСчетам(КодФормы);
		
		ОбъединитьСтроки = НастройкиОбъединенияСтрок[ИмяФлажкаСчет];
		
		Если Не ОбъединитьСтроки Тогда
			КолонкиГруппировок.Добавить("КФО");
			КолонкиГруппировок.Добавить("Счет");
		КонецЕсли;
	КонецЕсли;
	
	Если СвойстваКодаФормы.РасположениеРеквизитов.МестоИнвентаризации.РасположенВШапке Тогда
		КолонкиГруппировок.Добавить("МестоИнвентаризации");
		
	ИначеЕсли СвойстваКодаФормы.РасположениеРеквизитов.МестоИнвентаризации.РасположенВТабличнойЧасти Тогда
		ИмяФлажкаМестоИнвентаризации = ПолучитьИмяФлажкаНастройкиОбъединенияПоМестамИнвентаризации(КодФормы);
		
		ОбъединитьСтроки = НастройкиОбъединенияСтрок[ИмяФлажкаМестоИнвентаризации];
		Если Не ОбъединитьСтроки Тогда
			КолонкиГруппировок.Добавить("МестоИнвентаризации");
		КонецЕсли;
	КонецЕсли;
	
	КолонкиГруппировокСтрокой = СтрСоединить(КолонкиГруппировок, ",");
	
	СвернутаяТаблицаРешения.Свернуть(КолонкиГруппировокСтрокой);
	
	ПоискВОбщейТаблице = Новый Структура(КолонкиГруппировокСтрокой);
	ПоискВОбщейТаблице.Вставить(ИмяКолонки, Истина);
	
	ИндексыСтрокДокументов = Новый Массив();
	
	Для Каждого СтрокаСвернутойТаблицыРешения Из СвернутаяТаблицаРешения Цикл
		ИндексыСтрокДокумента = Новый Массив();
		
		ЗаполнитьЗначенияСвойств(ПоискВОбщейТаблице, СтрокаСвернутойТаблицыРешения);
		
		МассивСтрок = ТаблицаРешения.НайтиСтроки(ПоискВОбщейТаблице);
		
		Для Каждого СтрокаТаблицыРешения Из МассивСтрок Цикл
			ИндексыСтрокДокумента.Добавить(ТаблицаРешения.Индекс(СтрокаТаблицыРешения));
		КонецЦикла;
		
		ИндексыСтрокДокументов.Добавить(ИндексыСтрокДокумента);
	КонецЦикла;
	
	Возврат ИндексыСтрокДокументов;
	
КонецФункции

&НаСервере
Функция НовыйРезультатПроверкиРасчетаИндексовСтрокТаблицыРешения()
	
	РезультатПроверки = Новый Структура();
	РезультатПроверки.Вставить("ТекстСообщения", "");
	РезультатПроверки.Вставить("КоличествоДокументов", 0);
	РезультатПроверки.Вставить("Отказ", Ложь);
	
	Возврат РезультатПроверки;
	
КонецФункции

// РезультатРасчета - Структура - См. ИнвентаризацияСервер.НовыйРезультатРасчетаИндексовСтрокТаблицыРешенияДляГрупповогоФормированияОписей().
&НаСервере
Функция ПроверитьРезультатРасчетаДокументовОписей(РезультатРасчета)
	
	СвойстваКодовФормСозданиеПредусмотрено	= РезультатРасчета.СвойстваКодовФормСозданиеПредусмотрено;
	ВсеИндексыСтрок							= РезультатРасчета.ВсеИндексыСтрок;
	МассивКодовФормКСозданию				= РезультатРасчета.МассивКодовФормКСозданию;
	
	ИменаДокументовСозданиеПредусмотрено = НовыйИменаДокументовСозданиеПредусмотрено();
	
	СписокНедоступныхДокументов = ПолучитьСписокДокументовНедоступныхДляСоздания(
		МассивКодовФормКСозданию, СвойстваКодовФормСозданиеПредусмотрено);
	
	ИменаДокументовНетПрав = СписокНедоступныхДокументов.ВыгрузитьЗначения();
	
	Отказ = Ложь;
	
	ОбщийСчетчикДокументов = 0;
	
	КоличествоНедоступныхДокументов = ИменаДокументовНетПрав.Количество();
	
	Если КоличествоНедоступныхДокументов > 0 Тогда
		// Нет прав доступа на планируемые к созданию документы.
		Отказ = Истина;
		
		Если КоличествоНедоступныхДокументов > 1 Тогда
			Шаблон = НСтр("ru='документов:
				|%1'");
			
			МассивТекстов = Новый Массив();
			
			Для Каждого ИмяДокумента Из ИменаДокументовНетПрав Цикл
				СинонимДокумента = Метаданные.Документы[ИмяДокумента].Синоним;
				
				МассивТекстов.Добавить(СтрШаблон(" - %1", СинонимДокумента));
			КонецЦикла;
			
			ТекстИменаДокументов = СтрШаблон(Шаблон, СтрСоединить(МассивТекстов, Символы.ПС));
		Иначе
			Шаблон = НСтр("ru='документа %1.'");
			
			ИмяДокумента = ИменаДокументовНетПрав[0];
			
			СинонимДокумента = Метаданные.Документы[ИмяДокумента].Синоним;
			
			ТекстИменаДокументов = СтрШаблон(Шаблон, СинонимДокумента);
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(НСтр("ru='Формирование документов описей не выполнено.
			|У текущего пользователя отсутствует право добавления %1'"),
			ТекстИменаДокументов);
	Иначе
		// Выводим информационное сообщение о количестве формируемых документов.
		Если ВсеИндексыСтрок.Количество() > 0 Тогда
			СчетчикиДокументов = Новый Соответствие();
			
			Для Каждого Элемент Из ВсеИндексыСтрок Цикл
				КодФормы = Элемент.Ключ;
				ИндексыСтрок = Элемент.Значение;
				
				КоличествоДокументов = ИндексыСтрок.Количество();
				
				СчетчикиДокументов.Вставить(КодФормы, КоличествоДокументов);
				
				ОбщийСчетчикДокументов = ОбщийСчетчикДокументов + КоличествоДокументов;
			КонецЦикла;
			
			ТекстПоКодамФорм = ИнвентаризацияСервер.ПолучитьТекстСообщенияКоличествоДокументовПоКодамФорм(СчетчикиДокументов);
			
			// 0, 1, 2, немного, 5, другое
			ТекстКоличествоДокументов = СтрокаСЧислом(";Будет создан %1 документ описи;;Будут созданы %1 документа описей;Будут созданы %1 документов описей;Будут созданы %1 документов описей",
				ОбщийСчетчикДокументов,
				ВидЧисловогоЗначения.Количественное);
			
			ТекстСообщения = СтрШаблон(НСтр("ru='%1
				|из них:
				|%2'"),
				ТекстКоличествоДокументов,
				ТекстПоКодамФорм);
		Иначе
			Отказ = Истина;
			
			ТекстСообщения = НСтр("ru='Формирование документов описей не выполнено.
				|В отмеченных строках таблицы не выбраны коды форм.'");
		КонецЕсли;
	КонецЕсли;
	
	РезультатПроверки = НовыйРезультатПроверкиРасчетаИндексовСтрокТаблицыРешения();
	РезультатПроверки.ТекстСообщения = ТекстСообщения;
	РезультатПроверки.Отказ = Отказ;
	РезультатПроверки.КоличествоДокументов = ОбщийСчетчикДокументов;
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Функция ПолучитьСвойстваКодовФормСозданиеПредусмотрено(ТаблицаНастроек, ДатаРешения)
	
	// Заполняем свойства только тех кодов форм, формирование которых предусмотрено обработкой.
	// Предполагается, что одному коду формы соответствует один документ и одна строка таблицы настроек.
	
	ИменаДокументовСозданиеПредусмотрено = НовыйИменаДокументовСозданиеПредусмотрено();
	
	ПредставлениеДаты = Формат(ДатаРешения, "ДФ=dd.MM.yyyy");
	
	СвойстваКодовФорм = Новый Соответствие();
	
	Для Каждого ИмяДокумента Из ИменаДокументовСозданиеПредусмотрено Цикл
		МассивСтрок = ПолучитьСтрокиТаблицыНастроекПоИмениДокумента(ИмяДокумента, ТаблицаНастроек, ДатаРешения);
		
		Если МассивСтрок.Количество() = 0 Тогда
			Продолжить;
			
		ИначеЕсли МассивСтрок.Количество() > 1 Тогда
			ТекстСообщения = СтрШаблон(
				НСтр("ru='Для документа описи %1 найдено более одной действующей строки таблицы настроек на дату %2'"),
				ИмяДокумента, ПредставлениеДаты);
			
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		
		СтрокаТаблицыНастроек = МассивСтрок[0];
		
		КодФормы = СтрокаТаблицыНастроек.КодФормы;
		
		Проверка = СвойстваКодовФорм.Получить(КодФормы);
		
		Если Проверка <> Неопределено Тогда
			ИменаДокументов = Проверка.ИмяДокумента + ", " + ИмяДокумента;
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru='Для кода формы %1 в таблице настроек на дату %2 указано более одного документа описи (%3), для которых предусмотрено групповое формирование описей'"),
				КодФормы, ПредставлениеДаты, ИменаДокументов);
			
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		
		СвойстваКодаФормы = Новый Структура();
		СвойстваКодаФормы.Вставить("ИмяДокумента", СтрокаТаблицыНастроек.ИмяДокумента);
		СвойстваКодаФормы.Вставить("РасположениеРеквизитов", ИнвентаризацияСервер.ПолучитьОписаниеРасположенияРеквизитовОписи(СтрокаТаблицыНастроек));
		
		СвойстваКодовФорм.Вставить(КодФормы, СвойстваКодаФормы);
	КонецЦикла;
	
	Возврат СвойстваКодовФорм;
	
КонецФункции

&НаСервере
Функция ПолучитьСтрокиТаблицыНастроекПоИмениДокумента(ИмяДокумента, ТаблицаНастроек, ДатаРешения)
	
	СтрокиТаблицы = Новый Массив();
	
	Поиск = Новый Структура("ИмяДокумента", ИмяДокумента);
	
	МассивСтрок = ТаблицаНастроек.НайтиСтроки(Поиск);
	
	Для Каждого СтрокаТаблицыНастроек Из МассивСтрок Цикл
		ДатаНачалаПрименения			= СтрокаТаблицыНастроек.ДатаНачалаПрименения;
		ДатаОкончанияПримененияВключая	= СтрокаТаблицыНастроек.ДатаОкончанияПримененияВключая;
		
		Если ЗначениеЗаполнено(ДатаНачалаПрименения) И ЗначениеЗаполнено(ДатаОкончанияПримененияВключая)
			И (ДатаРешения < ДатаНачалаПрименения Или ДатаРешения > ДатаОкончанияПримененияВключая) Тогда
			Продолжить;
			
		ИначеЕсли ЗначениеЗаполнено(ДатаНачалаПрименения) И ДатаРешения < ДатаНачалаПрименения Тогда
			Продолжить;
			
		ИначеЕсли ЗначениеЗаполнено(ДатаОкончанияПримененияВключая) И ДатаРешения > ДатаОкончанияПримененияВключая Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиТаблицы.Добавить(СтрокаТаблицыНастроек);
	КонецЦикла;
	
	Возврат СтрокиТаблицы;
	
КонецФункции

&НаСервере
Процедура СоздатьКолонкиБыстрогоПоиска(ТаблицаРешения, МассивКодовФормКСозданию)
	
	// Создаем колонки поиска только для тех кодов форм, которые отмечены к созданию.
	// Создавать колонки для всех теоретически возможных кодов форм не имеет смысла,
	// т.к. часть из них может не использоваться.
	// В СозданиеВыбрано уже учтено возможное наличие описей.
	
	МассивКодовФормКСозданию = Новый Массив();
	
	Для Каждого СтрокаТаблицыРешения Из ТаблицаРешения Цикл
		КодыФормКСозданию = Новый Соответствие();
		
		Для Каждого КодФормы Из СтрокаТаблицыРешения.МассивКодовФормСозданиеВыбрано Цикл
			КодыФормКСозданию.Вставить(КодФормы, Истина);
		КонецЦикла;
		
		Для Каждого Элемент Из КодыФормКСозданию Цикл
			КодФормы = Элемент.Ключ;
			
			ИмяКолонки = ПолучитьИмяКолонкиДляБыстрогоПоиска(КодФормы);
			
			Если МассивКодовФормКСозданию.Найти(КодФормы) = Неопределено Тогда
				МассивКодовФормКСозданию.Добавить(КодФормы);
				
				ТаблицаРешения.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("Булево"));
			КонецЕсли;
			
			СтрокаТаблицыРешения[ИмяКолонки] = Истина;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеДокументов

&НаКлиенте
Процедура ПроверитьИСформироватьОписи()
	
	Отказ = Ложь;
	
	ПроверитьТаблицуРешенияПередФормированиемОписей(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПодтвердитьИСформироватьОписи();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьТаблицуРешенияПередФормированиемОписей(Отказ)
	
	Поиск = Новый Структура("Отметка", Истина);
	
	МассивСтрок = ТаблицаРешения.НайтиСтроки(Поиск);
	
	Если МассивСтрок.Количество() = 0 Тогда
		Поиск = Новый Структура("ОтметкаДоступна", Истина);
		
		МассивСтрок = ТаблицаРешения.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='В таблице Решения отсутствуют строки, по которым необходимо сформировать описи.'");
		Иначе
			ТекстСообщения = НСтр("ru='Отметьте строки Решения, по которым необходимо сформировать описи.'");
		КонецЕсли;
		
		ПоказатьПредупреждение(, ТекстСообщения);
		
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИСформироватьОписи()
	
	РезультатПроверки = РассчитатьДокументыОписейСервер();
	
	Если РезультатПроверки.Отказ Тогда
		ПоказатьПредупреждение(, РезультатПроверки.ТекстСообщения);
		
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон(НСтр("ru='%1
		|
		|Продолжить?'"),
		РезультатПроверки.ТекстСообщения);
	
	Оповещение = Новый ОписаниеОповещения("ПодтвердитьИСформироватьОписиВыбор", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаСервере
Функция РассчитатьДокументыОписейСервер()
	
	ИменаРеквизитов = ПолучитьИменаРеквизитовНастроекОбъединенияСтрок();
	
	НастройкиОбъединенияСтрок = Новый Структура();
	
	Для Каждого ИмяРеквизита Из ИменаРеквизитов Цикл
		НастройкиОбъединенияСтрок.Вставить(ИмяРеквизита, ЭтотОбъект[ИмяРеквизита]);
	КонецЦикла;
	
	Поиск = Новый Структура("Отметка", Истина);
	
	ОтмеченныеСтрокиТаблицыРешения = ТаблицаРешения.Выгрузить(Поиск);
	
	ПараметрыРасчета = НовыйПараметрыРасчетаИндексовСтрокТаблицыРешения();
	ПараметрыРасчета.РешениеСсылка = Решение;
	ПараметрыРасчета.НастройкиОбъединенияСтрок = НастройкиОбъединенияСтрок;
	ПараметрыРасчета.ОтмеченныеСтрокиТаблицыРешения = ОтмеченныеСтрокиТаблицыРешения;
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасчета, УникальныйИдентификатор);
	
	РезультатПроверки = РассчитатьИндексыСтрокТаблицыРешения(АдресХранилища);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Процедура ПодтвердитьИСформироватьОписиВыбор(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		СформироватьОписиКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОписиКлиент()
	
	РезультатЗадания = СформироватьОписиСервер();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ФормированиеОписейЗавершеноКлиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция СформироватьОписиСервер()
	
	РезультатРасчета = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	ПараметрыФормирования = ИнвентаризацияСервер.НовыйПараметрыФормированияДокументовОписейДляГрупповогоФормированияОписей();
	ПараметрыФормирования.УстанавливатьКомментарий = УстанавливатьКомментарий;
	ПараметрыФормирования.ШаблонКомментария = ШаблонКомментария;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Формирование документов описей по Решению'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ИнвентаризацияСервер.СформироватьДокументыОписейДляГрупповогоФормированияОписей",
		РезультатРасчета,
		ПризнакиРешения,
		ПараметрыФормирования);
	
КонецФункции

&НаКлиенте
Процедура ФормированиеОписейЗавершеноКлиент(Результат, ДополнительныеПараметры) Экспорт
	
	Перем РезультатФормирования;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	ФормированиеОписейЗавершеноСервер(Результат.АдресРезультата, РезультатФормирования);
	
	НастроитьФормуПослеОбновления();
	
	ПоказатьПредупреждение(, РезультатФормирования.ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ФормированиеОписейЗавершеноСервер(Знач АдресРезультата, РезультатФормирования)
	
	РезультатФормирования = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	ОбновитьДанныеСервер();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
