#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(ТипУчастника) Тогда
		ТипУчастника = Перечисления.ТипыУчастниковГИСГМП.АН;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	//участник, чье начисление квитируем, или отменяем квитирование
	Если ТипЗнч(Начисление) = Тип("ДокументСсылка.НачислениеОтПодведомственного") Тогда
		Участник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Начисление,"Получатель");
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПлатежноРасчетныеДокументы.ПриЗаписиНаСервереУстановкаСтатуса(Отказ, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#КонецЕсли