&НаКлиенте
Перем ПеренестиВДокумент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	ДатаСведений = Параметры.ДатаСведений;
	ИсходящееИзвещение = Параметры.ИсходящееИзвещение;
	ВидИзвещения = Параметры.ВидИзвещения;
	ВозможностьРедактированияСведений = Истина;
	ЗаполнениеПоЭД = Ложь;
	
	СтруктураДанных = Документы.ИзвещениеИсходящее.ПодготовитьДанныеДляЭД(ИсходящееИзвещение);
	ПередаваемыеПроводки = СтруктураДанных.ПередаваемыеПроводки;
	
	СтруктураДанных.Шапка.Следующий();
	ЭтоИсправлениеОшибок = Ложь;
	Если СтруктураДанных.Шапка.ИсправлениеОшибок = Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.ОшибкаПрошлогоГода
			Или СтруктураДанных.Шапка.ИсправлениеОшибок = Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.ОшибкаРанееПрошлогоГода Тогда
		ЭтоИсправлениеОшибок = Истина;
	КонецЕсли;
	
	Если ЭтоИсправлениеОшибок Тогда
		ПередаваемыеПроводки = СтруктураДанных.ПроводкиДокументаУчета;
	КонецЕсли;	
	
	ПроводкиПоДокументам = Ложь;
	Если (ПередаваемыеПроводки = Неопределено) Тогда
		ПроводкиПоДокументам = Истина;
	Иначе
		Если ПередаваемыеПроводки.Количество() = 0 Тогда
			ПроводкиПоДокументам = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ПроводкиПоДокументам Тогда
		ПередаваемыеПроводки = ЭлектронныеДокументыБГУ.ПроводкиПоДокументамПередачи(ИсходящееИзвещение.ДокументыПередачи, ИсходящееИзвещение);
	КонецЕсли;	
	Для Каждого ТекСтрока Из ПередаваемыеПроводки Цикл
		НоваяСтрока = ПроводкиОтправителя.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		НомерПроводки = ТекСтрока.НомерСтроки; 	
		НоваяСтрока.НомерПроводки = Число(НомерПроводки);
		
		Содержание = ТекСтрока.Содержание;
		НоваяСтрока.Содержание = Содержание;
		НоваяСтрока.Сумма = ТекСтрока.Сумма;
		
		Проводка = ЭлектронныеДокументыБГУ.ПредставлениеПроводкиИзвещенияДляСтроки(ТекСтрока);		
				
		НоваяСтрока.Проводка = Проводка;
		
		ПараметрыОтбораДляПоиска = Новый Структура;
		ПараметрыОтбораДляПоиска.Вставить("СчетДт", ТекСтрока.СчетДт);
		ПараметрыОтбораДляПоиска.Вставить("КЭКДт", ТекСтрока.КЭКДт);
		ПараметрыОтбораДляПоиска.Вставить("СчетКт", ТекСтрока.СчетКт);
		ПараметрыОтбораДляПоиска.Вставить("КЭККт", ТекСтрока.КЭККт);
		НайденныеСтроки = ПроводкиОтправителяДляПоискаШаблона.НайтиСтроки(ПараметрыОтбораДляПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяПроводкаДляПоиска = ПроводкиОтправителяДляПоискаШаблона.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяПроводкаДляПоиска, ТекСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеЭДОтправленногоИзвещения = ЭлектронныеДокументыБГУ.СведенияЭДИзвещенияПоДокументу(ИсходящееИзвещение);
	Если НЕ ДанныеЭДОтправленногоИзвещения = Неопределено Тогда
		ВозможностьРедактированияСведений = Ложь;
		ЗаполнениеПоЭД = Истина;
	КонецЕсли;	
	
	Если ЗаполнениеПоЭД Тогда
		ЗаполнитьРекомендуемыеПроводкиПоЭлектронномуДокументу(ДанныеЭДОтправленногоИзвещения);
	Иначе
		ЗагрузитьСписокРекомендуемыхПроводокИзДокумента(Параметры.АдресТаблицыРекомендуемыхПроводок);
	
		Если (ПроводкиПолучателя.Количество() = 0) И ВозможностьРедактированияСведений Тогда
			ДанныеШаблоновПроводок = РекомендуемыеПроводки(ВидИзвещения, ПроводкиОтправителяДляПоискаШаблона.Выгрузить());
			ЗаполнитьРекомендуемыеПроводкиПоШаблонам(ДанныеШаблоновПроводок);
		КонецЕсли;	
	КонецЕсли;
	
	НастройкаВидимостиЭлементовНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ПеренестиВДокумент = Истина Тогда
		АдресРекомендованныхПроводокВХранилище = ПоместитьРекомендацииПроводокВХранилище();
		
		Структура = Новый Структура("АдресРекомендованныхПроводокВХранилище", АдресРекомендованныхПроводокВХранилище);
		ПеренестиВДокумент = Истина;
		ОповеститьОВыборе(Структура);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВДокумент <> Истина И Модифицированность Тогда
	
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр("ru = 'Рекомендуемые получателю проводки изменены, но не перенесены в документ.
			|
			|Перенести?'"), РежимДиалогаВопрос.ДаНетОтмена);
			
		Отказ = Истина;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.ИзвещениеИсходящее.Форма.ФормаРедактированияРекомендуемойПроводки" Тогда
		ЗаписатьРекомендуемуюПроводку(ВыбранноеЗначение);
		Модифицированность = Истина;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПроводкиПолучателя

&НаКлиенте
Процедура ПроводкиПолучателяПроводкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ВозможностьРедактированияСведений Тогда
		ОткрытьПроводкуДляРедактирования(Элемент);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроводкиПолучателяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ПроводкиПолучателяПроводка Тогда
		Если ВозможностьРедактированияСведений Тогда
			ОткрытьПроводкуДляРедактирования(Элемент, ВыбраннаяСтрока);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВДокумент(Команда)
    РезультатПроверки = ПроверкаКорректностиРекомендуемыхПроводок();
	
	Если ТипЗнч(РезультатПроверки) = Тип("Структура") Тогда
		Если РезультатПроверки.ЕстьЗамечания Тогда
			ПоказатьПредупреждение(Неопределено, РезультатПроверки.ТекстПредупреждения);
		
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРекомендацииПоШаблонам(Команда)
	ЗаполнитьРекомендацииПоШаблонамНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПроводкиПолучателя(Команда)
	
	ПроводкиПолучателя.Очистить();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПроводкиПолучателя(Команда)
	
	ОткрытьПроводкуДляРедактирования(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьШаблоныРекомендуемыхПроводок(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидИзвещения", ВидИзвещения);
	
	ОткрытьФорму("Справочник.ПроводкиРекомендуемыеПолучателямЭлектронныхИзвещений.ФормаСписка", ПараметрыФормы, ЭтотОбъект,,,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШаблонРекомендуемыхПроводок(Команда)
	
	ДобавитьШаблонРекомендуемыхПроводокПоКоду(1);

КонецПроцедуры


&НаКлиенте
Процедура ДобавитьШаблонРекомендуемыхПроводокКПС(Команда)
	
	ДобавитьШаблонРекомендуемыхПроводокПоКоду(2);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШаблонРекомендуемыхПроводокКФО(Команда)
	
	ДобавитьШаблонРекомендуемыхПроводокПоКоду(3);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШаблонРекомендуемыхПроводокКПСКФО(Команда)
	
	ДобавитьШаблонРекомендуемыхПроводокПоКоду(4);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокумент = Истина;
		Модифицированность = Истина;
		Закрыть();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРекомендуемыеПроводкиПоШаблонам(ДанныеШаблоновПроводок)
	НомерПроводкиПоПорядку = 0;
	
	Если ДанныеШаблоновПроводок.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;	
	
	Для Каждого ТекСтрока Из ПроводкиОтправителя Цикл
		НомерПроводкиПоПорядку = НомерПроводкиПоПорядку + 1;
		
		НоваяСтрока = ПроводкиПолучателя.Добавить();
		НоваяСтрока.НомерПроводкиПоПорядку = НомерПроводкиПоПорядку;
		НоваяСтрока.НомерПроводки = НомерПроводкиПоПорядку;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ОтправителяКФО", ТекСтрока.КФО);
		ПараметрыОтбора.Вставить("ОтправителяСчетДт", ТекСтрока.СчетДт);
		ПараметрыОтбора.Вставить("ОтправителяКПСДт", ТекСтрока.КПСДт);
		ПараметрыОтбора.Вставить("ОтправителяКЭКДт", ТекСтрока.КЭКДт);
		ПараметрыОтбора.Вставить("ОтправителяСчетКт", ТекСтрока.СчетКт);
		ПараметрыОтбора.Вставить("ОтправителяКПСКт", ТекСтрока.КПСКт);
		ПараметрыОтбора.Вставить("ОтправителяКЭККт", ТекСтрока.КЭККт);
		НайденныеСтроки = ДанныеШаблоновПроводок.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаШаблона = НайденныеСтроки[0];
			НоваяСтрока.СчетДт = СтрокаШаблона.ПолучателяСчетДт;
			НоваяСтрока.КЭКДт = СтрокаШаблона.ПолучателяКЭКДт;
			НоваяСтрока.СчетКт = СтрокаШаблона.ПолучателяСчетКт;
			НоваяСтрока.КЭККт = СтрокаШаблона.ПолучателяКЭККт;
			НоваяСтрока.КФО = СтрокаШаблона.ПолучателяКФО;
			НоваяСтрока.КПСДт = СтрокаШаблона.КПСДт;
			НоваяСтрока.КПСКт = СтрокаШаблона.КПСКт;
			НоваяСтрока.Содержание = СтрокаШаблона.ПолучателяСодержание;
			НоваяСтрока.Сумма = ТекСтрока.Сумма;
		Иначе	
			ПараметрыОтбора.Очистить();
			ПараметрыОтбора.Вставить("ОтправителяКФО", ТекСтрока.КФО);
			ПараметрыОтбора.Вставить("ОтправителяСчетДт", ТекСтрока.СчетДт);
			ПараметрыОтбора.Вставить("ОтправителяКЭКДт", ТекСтрока.КЭКДт);
			ПараметрыОтбора.Вставить("ОтправителяСчетКт", ТекСтрока.СчетКт);
			ПараметрыОтбора.Вставить("ОтправителяКЭККт", ТекСтрока.КЭККт);
			НайденныеСтроки = ДанныеШаблоновПроводок.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаШаблона = НайденныеСтроки[0];
				НоваяСтрока.СчетДт = СтрокаШаблона.ПолучателяСчетДт;
				НоваяСтрока.КЭКДт = СтрокаШаблона.ПолучателяКЭКДт;
				НоваяСтрока.СчетКт = СтрокаШаблона.ПолучателяСчетКт;
				НоваяСтрока.КЭККт = СтрокаШаблона.ПолучателяКЭККт;
				НоваяСтрока.КФО = СтрокаШаблона.ПолучателяКФО;
				НоваяСтрока.КПСДт = ТекСтрока.КПСДт;
				НоваяСтрока.КПСКт = ТекСтрока.КПСКт;
				НоваяСтрока.Содержание = СтрокаШаблона.ПолучателяСодержание;
				НоваяСтрока.Сумма = ТекСтрока.Сумма;
			Иначе
				ПараметрыОтбора.Очистить();
				ПараметрыОтбора.Вставить("ОтправителяСчетДт", ТекСтрока.СчетДт);
				ПараметрыОтбора.Вставить("ОтправителяКЭКДт", ТекСтрока.КЭКДт);
				ПараметрыОтбора.Вставить("ОтправителяКПСДт", ТекСтрока.КПСДт);
				ПараметрыОтбора.Вставить("ОтправителяСчетКт", ТекСтрока.СчетКт);
				ПараметрыОтбора.Вставить("ОтправителяКПСКт", ТекСтрока.КПСКт);
				ПараметрыОтбора.Вставить("ОтправителяКЭККт", ТекСтрока.КЭККт);
				НайденныеСтроки = ДанныеШаблоновПроводок.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					СтрокаШаблона = НайденныеСтроки[0];
					НоваяСтрока.СчетДт = СтрокаШаблона.ПолучателяСчетДт;
					НоваяСтрока.КЭКДт = СтрокаШаблона.ПолучателяКЭКДт;
					НоваяСтрока.СчетКт = СтрокаШаблона.ПолучателяСчетКт;
					НоваяСтрока.КЭККт = СтрокаШаблона.ПолучателяКЭККт;
					НоваяСтрока.КПСДт = СтрокаШаблона.ПолучателяКПСДт;
					НоваяСтрока.КПСКт = СтрокаШаблона.ПолучателяКПСКт;
					НоваяСтрока.КФО = ТекСтрока.КФО;
					НоваяСтрока.Содержание = СтрокаШаблона.ПолучателяСодержание;
					НоваяСтрока.Сумма = ТекСтрока.Сумма;
				Иначе
					ПараметрыОтбора.Очистить();
					ПараметрыОтбора.Вставить("ОтправителяСчетДт", ТекСтрока.СчетДт);
					ПараметрыОтбора.Вставить("ОтправителяКЭКДт", ТекСтрока.КЭКДт);
					ПараметрыОтбора.Вставить("ОтправителяСчетКт", ТекСтрока.СчетКт);
					ПараметрыОтбора.Вставить("ОтправителяКЭККт", ТекСтрока.КЭККт);
					НайденныеСтроки = ДанныеШаблоновПроводок.НайтиСтроки(ПараметрыОтбора);
					Если НайденныеСтроки.Количество() > 0 Тогда
						СтрокаШаблона = НайденныеСтроки[0];
						НоваяСтрока.СчетДт = СтрокаШаблона.ПолучателяСчетДт;
						НоваяСтрока.КЭКДт = СтрокаШаблона.ПолучателяКЭКДт;
						НоваяСтрока.СчетКт = СтрокаШаблона.ПолучателяСчетКт;
						НоваяСтрока.КЭККт = СтрокаШаблона.ПолучателяКЭККт;
						НоваяСтрока.КПСДт = ТекСтрока.КПСДт;
						НоваяСтрока.КПСКт = ТекСтрока.КПСКт;
						НоваяСтрока.КФО = ТекСтрока.КФО;
						НоваяСтрока.Содержание = СтрокаШаблона.ПолучателяСодержание;
						НоваяСтрока.Сумма = ТекСтрока.Сумма;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Проводка = ЭлектронныеДокументыБГУ.ПредставлениеПроводкиИзвещенияДляСтроки(НоваяСтрока);		
			
			НоваяСтрока.Проводка = Проводка;
				
		КонецЕсли;	
	КонецЦикла;		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРекомендуемыеПроводкиПоЭлектронномуДокументу(ДанныеЭД)
	НомерПроводкиПоПорядку = 0;
	Для Каждого ТекСтрока Из ДанныеЭД.ТаблицаРекомендуемыхПроводок Цикл
		НомерПроводкиПоПорядку = НомерПроводкиПоПорядку + 1;
		
		НоваяСтрока = ПроводкиПолучателя.Добавить();
		НоваяСтрока.НомерПроводкиПоПорядку = НомерПроводкиПоПорядку;
		НоваяСтрока.НомерПроводки = ТекСтрока.пНомерПроводки;
		
		Если ЗначениеЗаполнено(ТекСтрока.пСуммаОтправитель) Тогда
			Проводка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Дт %1 - Кт %2'"),
					ТекСтрока.пДебетСчетОтправитель, ТекСтрока.пКредитСчетОтправитель);
			Сумма = ТекСтрока.пСуммаОтправитель;		
		Иначе
			Проводка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Дт %1 - Кт %2'"),
					ТекСтрока.пДебетСчетПолучатель, ТекСтрока.пКредитСчетПолучатель);			
			Сумма = ТекСтрока.пСуммаПолучатель;		
		КонецЕсли;	
		Содержание = ТекСтрока.пСодержаниеБезНомера;		
		
		НоваяСтрока.Проводка = Проводка;
		НоваяСтрока.Содержание = Содержание;
		НоваяСтрока.Сумма = Сумма;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РекомендуемыеПроводки(ВидИзвещенияОтправителя, ДанныеПроводокОтправителя)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.СчетДт КАК СчетДт,
	               |	Таб.КЭКДт КАК КЭКДт,
	               |	Таб.СчетКт КАК СчетКт,
	               |	Таб.КЭККт КАК КЭККт
	               |ПОМЕСТИТЬ ВТДанныеПроводокОтправителя
	               |ИЗ
	               |	&ДанныеПроводокОтправителя КАК Таб
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПРЕДСТАВЛЕНИЕ(Проводки.ОтправителяКФО) КАК ОтправителяКФО,
	               |	Проводки.ОтправителяСчетДт КАК ОтправителяСчетДт,
	               |	Проводки.ОтправителяКПСДт КАК ОтправителяКПСДт,
	               |	Проводки.ОтправителяКЭКДт КАК ОтправителяКЭКДт,
	               |	Проводки.ОтправителяСчетКт КАК ОтправителяСчетКт,
	               |	Проводки.ОтправителяКПСКт КАК ОтправителяКПСКт,
	               |	Проводки.ОтправителяКЭККт КАК ОтправителяКЭККт,
	               |	Проводки.ОтправителяСодержание КАК ОтправителяСодержание,
	               |	Проводки.Примечание КАК Примечание,
	               |	ПРЕДСТАВЛЕНИЕ(Проводки.ПолучателяКФО) КАК ПолучателяКФО,
	               |	ВЫРАЗИТЬ(Проводки.ПолучателяСчетДт КАК ПланСчетов.ЕПСБУ).Код КАК ПолучателяСчетДт,
	               |	Проводки.ПолучателяКПСДт КАК ПолучателяКПСДт,
	               |	ВЫРАЗИТЬ(Проводки.ПолучателяКЭКДт КАК Справочник.КОСГУ).Код КАК ПолучателяКЭКДт,
	               |	ВЫРАЗИТЬ(Проводки.ПолучателяСчетКт КАК ПланСчетов.ЕПСБУ).Код КАК ПолучателяСчетКт,
	               |	Проводки.ПолучателяКПСКт КАК ПолучателяКПСКт,
	               |	ВЫРАЗИТЬ(Проводки.ПолучателяКЭККт КАК Справочник.КОСГУ).Код КАК ПолучателяКЭККт,
	               |	Проводки.ПолучателяСодержание КАК ПолучателяСодержание,
	               |	ВЫБОР
	               |		КОГДА Проводки.ОтправителяКФО = ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)
	               |				И Проводки.ОтправителяКПСДт = ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)
	               |			ТОГДА 4
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА Проводки.ОтправителяКПСДт = ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)
	               |					ТОГДА 3
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА Проводки.ОтправителяКФО = ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)
	               |							ТОГДА 2
	               |						ИНАЧЕ 1
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Приоритет
	               |ПОМЕСТИТЬ ДанныеШаблоновПроводок
	               |ИЗ
	               |	Справочник.ПроводкиРекомендуемыеПолучателямЭлектронныхИзвещений.ПроводкиОтправителяИПолучателя КАК Проводки
	               |ГДЕ
	               |	Проводки.Ссылка.ВидИзвещения = &ВидИзвещения
	               |	И Проводки.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И НЕ Проводки.ОтправителяСчетДт = &ПустойСчетУчета
	               |	И НЕ Проводки.ОтправителяСчетКт = &ПустойСчетУчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеШаблоновПроводок.ОтправителяКФО КАК ОтправителяКФО,
	               |	ДанныеШаблоновПроводок.ОтправителяСчетДт КАК ОтправителяСчетДт,
	               |	ДанныеШаблоновПроводок.ОтправителяКПСДт КАК ОтправителяКПСДт,
	               |	ДанныеШаблоновПроводок.ОтправителяКЭКДт КАК ОтправителяКЭКДт,
	               |	ДанныеШаблоновПроводок.ОтправителяСчетКт КАК ОтправителяСчетКт,
	               |	ДанныеШаблоновПроводок.ОтправителяКПСКт КАК ОтправителяКПСКт,
	               |	ДанныеШаблоновПроводок.ОтправителяКЭККт КАК ОтправителяКЭККт,
	               |	ДанныеШаблоновПроводок.ОтправителяСодержание КАК ОтправителяСодержание,
	               |	ДанныеШаблоновПроводок.Примечание КАК Примечание,
	               |	ДанныеШаблоновПроводок.ПолучателяКФО КАК ПолучателяКФО,
	               |	ДанныеШаблоновПроводок.ПолучателяСчетДт КАК ПолучателяСчетДт,
	               |	ДанныеШаблоновПроводок.ПолучателяКПСДт КАК ПолучателяКПСДт,
	               |	ДанныеШаблоновПроводок.ПолучателяКЭКДт КАК ПолучателяКЭКДт,
	               |	ДанныеШаблоновПроводок.ПолучателяСчетКт КАК ПолучателяСчетКт,
	               |	ДанныеШаблоновПроводок.ПолучателяКПСКт КАК ПолучателяКПСКт,
	               |	ДанныеШаблоновПроводок.ПолучателяКЭККт КАК ПолучателяКЭККт,
	               |	ДанныеШаблоновПроводок.ПолучателяСодержание КАК ПолучателяСодержание,
	               |	ДанныеШаблоновПроводок.Приоритет КАК Приоритет
	               |ИЗ
	               |	ВТДанныеПроводокОтправителя КАК ВТДанныеПроводокОтправителя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеШаблоновПроводок КАК ДанныеШаблоновПроводок
	               |		ПО (ДанныеШаблоновПроводок.ОтправителяСчетДт = ВТДанныеПроводокОтправителя.СчетДт)
	               |			И (ДанныеШаблоновПроводок.ОтправителяКЭКДт = ВТДанныеПроводокОтправителя.КЭКДт)
	               |			И (ДанныеШаблоновПроводок.ОтправителяСчетКт = ВТДанныеПроводокОтправителя.СчетКт)
	               |			И (ДанныеШаблоновПроводок.ОтправителяКЭККт = ВТДанныеПроводокОтправителя.КЭККт)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	
	Запрос.УстановитьПараметр("ВидИзвещения", ВидИзвещенияОтправителя);
	Запрос.УстановитьПараметр("ДанныеПроводокОтправителя", ДанныеПроводокОтправителя);
	Запрос.УстановитьПараметр("ПустойСчетУчета", ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	
	ДанныеШаблоновПроводок = Запрос.Выполнить().Выгрузить();
	
	Возврат ДанныеШаблоновПроводок;
КонецФункции	

&НаКлиенте
Процедура РедактированиеРекомендуемойПроводкиЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьПроводкуДляРедактирования(Элемент, ВыбраннаяСтрока = 0)
	
	ТекущиеДанные = Элементы.ПроводкиПолучателя.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДатаСведений", ДатаСведений);
	ПараметрыФормы.Вставить("КФО", ТекущиеДанные.КФО);
	ПараметрыФормы.Вставить("СчетДт", ТекущиеДанные.СчетДт);
	ПараметрыФормы.Вставить("КПСДт", ТекущиеДанные.КПСДт);
	ПараметрыФормы.Вставить("КЭКДт", ТекущиеДанные.КЭКДт);
	ПараметрыФормы.Вставить("СчетКт", ТекущиеДанные.СчетКт);
	ПараметрыФормы.Вставить("КПСКт", ТекущиеДанные.КПСКт);
	ПараметрыФормы.Вставить("КЭККт", ТекущиеДанные.КЭККт);
	ПараметрыФормы.Вставить("Содержание", ТекущиеДанные.Содержание);
	ПараметрыФормы.Вставить("НомерПроводки", ТекущиеДанные.НомерПроводки);
	ПараметрыФормы.Вставить("НомерПроводкиПоПорядку", ТекущиеДанные.НомерПроводкиПоПорядку);
	ПараметрыФормы.Вставить("КоличествоПроводокОтправителя", ПроводкиОтправителя.Количество());
	
	ТекСтрока = ПроводкиОтправителя[ТекущиеДанные.НомерПроводкиПоПорядку-1];
	
	ПроводкаОтправителя = ЭлектронныеДокументыБГУКлиент.ПредставлениеПроводкиИзвещения(
		ТекСтрока.КФО, ТекСтрока.КПСДт, ТекСтрока.СчетДт, ТекСтрока.КЭКДт, ТекСтрока.КПСКт, ТекСтрока.СчетКт, ТекСтрока.КЭККт);
	
	ПараметрыФормы.Вставить("ПроводкаОтправителя", ПроводкаОтправителя);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеРекомендуемойПроводкиЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.ИзвещениеИсходящее.Форма.ФормаРедактированияРекомендуемойПроводки", ПараметрыФормы, ЭтотОбъект,,,,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРекомендуемуюПроводку(ДанныеПроводки)
	
	ДанныеПроводкиПолучателя = ПолучитьИзВременногоХранилища(ДанныеПроводки.АдресДанныхПроводкиВХранилище);
	
	Если ДанныеПроводкиПолучателя.НомерПроводкиПоПорядку > 0 Тогда
		ПроводкаПолучателя = ПроводкиПолучателя[ДанныеПроводкиПолучателя.НомерПроводкиПоПорядку-1];
		ЗаполнитьЗначенияСвойств(ПроводкаПолучателя, ДанныеПроводкиПолучателя);
	КонецЕсли;
КонецПроцедуры
	
&НаСервере
Функция РекомендацииПроводокДляДокумента()
	
	Результат = ПроводкиПолучателя.Выгрузить();
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПоместитьРекомендацииПроводокВХранилище()
	РекомендацииПроводокДляДокумента = РекомендацииПроводокДляДокумента();
	
	Результат = ПоместитьВоВременноеХранилище(РекомендацииПроводокДляДокумента, УникальныйИдентификатор);

	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверкаКорректностиРекомендуемыхПроводок()
	РекомендацииПроводокДляДокумента = РекомендацииПроводокДляДокумента();
	
	СтруктураСведенийОбОшибке = Новый Структура;
	КонтрольПройден = Истина;
	
	КонтрольКорректностиРекомендованныхПроводокПройден(РекомендацииПроводокДляДокумента, СтруктураСведенийОбОшибке, КонтрольПройден);
	Если НЕ КонтрольПройден Тогда
		СтруктураСведенийОбОшибке.Вставить("ЕстьЗамечания", Истина); 
		Возврат СтруктураСведенийОбОшибке;
	КонецЕсли;	
	
	СтруктураСведенийОбОшибке.Вставить("ЕстьЗамечания", Ложь); 
	Возврат СтруктураСведенийОбОшибке;
	
КонецФункции

&НаСервере
Процедура КонтрольКорректностиРекомендованныхПроводокПройден(РекомендацииПроводокДляДокумента, СтруктураСведенийОбОшибке, РезультатКонтроля)
	Для Каждого ТекСтрока Из ПроводкиПолучателя Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.КФО) Тогда
	        Сообщить(СтрШаблон(НСтр("ru='Для строки %1 не заполнен реквизит ""КФО"".'"), ТекСтрока.НомерПроводки));

			РезультатКонтроля = Ложь;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ТекСтрока.СчетДт) Тогда
	        Сообщить(СтрШаблон(НСтр("ru='Для строки %1 не заполнен реквизит ""Счет Дт"".'"), ТекСтрока.НомерПроводки));

			РезультатКонтроля = Ложь;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ТекСтрока.СчетКт) Тогда
	        Сообщить(СтрШаблон(НСтр("ru='Для строки %1 не заполнен реквизит ""Счет Кт"".'"), ТекСтрока.НомерПроводки));

			РезультатКонтроля = Ложь;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ТекСтрока.КПСДт) Тогда
	        Сообщить(СтрШаблон(НСтр("ru='Для строки %1 не заполнен реквизит ""КПС Дт"".'"), ТекСтрока.НомерПроводки));

			РезультатКонтроля = Ложь;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ТекСтрока.КПСКт) Тогда
	        Сообщить(СтрШаблон(НСтр("ru='Для строки %1 не заполнен реквизит ""КПС Кт"".'"), ТекСтрока.НомерПроводки));

			РезультатКонтроля = Ложь;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ТекСтрока.КЭКДт) Тогда
	        Сообщить(СтрШаблон(НСтр("ru='Для строки %1 не заполнен реквизит ""КЭК Дт"".'"), ТекСтрока.НомерПроводки));

			РезультатКонтроля = Ложь;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ТекСтрока.КЭККт) Тогда
	        Сообщить(СтрШаблон(НСтр("ru='Для строки %1 не заполнен реквизит ""КЭК Кт"".'"), ТекСтрока.НомерПроводки));

			РезультатКонтроля = Ложь;
		КонецЕсли;	
	КонецЦикла;
	
	ТекстПредупреждения = НСтр("ru = 'Контроль корректности рекомендуемых проводок не пройден.
	|Требуется скорректировать данные рекомендуемых проводок и повторить операцию.'");
	
	СтруктураСведенийОбОшибке.Вставить("ТекстПредупреждения", ТекстПредупреждения);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокРекомендуемыхПроводокИзДокумента(АдресОбъектовВХранилище)
	Если ЭтоАдресВременногоХранилища(АдресОбъектовВХранилище) Тогда
		РекомендацииПроводокИзДокумента = ПолучитьИзВременногоХранилища(АдресОбъектовВХранилище);
		
		НомерПроводкиПоПорядку = 0;
		Для Каждого ТекСтрока Из РекомендацииПроводокИзДокумента Цикл
			НомерПроводкиПоПорядку = НомерПроводкиПоПорядку + 1;
			
			НоваяСтрока = ПроводкиПолучателя.Добавить();
			НоваяСтрока.НомерПроводкиПоПорядку = НомерПроводкиПоПорядку;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			Если ЗначениеЗаполнено(ТекСтрока.НомераПроводокОтправителя) Тогда
				НоваяСтрока.НомерПроводки = Число(ТекСтрока.НомераПроводокОтправителя);
			КонецЕсли;
			
			Проводка = ЭлектронныеДокументыБГУ.ПредставлениеПроводкиИзвещенияДляСтроки(ТекСтрока);
			
			НоваяСтрока.Проводка = Проводка;
				
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРекомендацииПоШаблонамНаСервере()
	ПроводкиПолучателя.Очистить();
	ДанныеШаблоновПроводок = РекомендуемыеПроводки(ВидИзвещения, ПроводкиОтправителяДляПоискаШаблона.Выгрузить());
	ЗаполнитьРекомендуемыеПроводкиПоШаблонам(ДанныеШаблоновПроводок);
КонецПроцедуры

&НаСервере
Процедура НастройкаВидимостиЭлементовНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаполнитьРекомендацииПоШаблонам",
		"Доступность", ВозможностьРедактированияСведений);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДобавитьВДокумент",
		"Видимость", ВозможностьРедактированияСведений);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроводкиПолучателяРедактироватьПроводкиПолучателя",
		"Видимость", ВозможностьРедактированияСведений);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроводкиПолучателяОчиститьПроводкиПолучателя",
		"Видимость", ВозможностьРедактированияСведений);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроводкиОтправителя",
		"ТолькоПросмотр", НЕ ВозможностьРедактированияСведений);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроводкиПолучателя",
		"ТолькоПросмотр", НЕ ВозможностьРедактированияСведений);
	
	ВидимостьШаблоновПроводок = ВидимостьШаблоновПроводок();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроводкиОтправителяГруппаДобавитьШаблон",
		"Доступность", ВидимостьШаблоновПроводок);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроводкиОтправителяОткрытьШаблоныРекомендуемыхПроводок",
		"Доступность", ВидимостьШаблоновПроводок);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуПроводокОтправителяВХранилище(КодВидаШаблона)
	ТаблицаРекомендуемыеПроводки = Новый ТаблицаЗначений;
	ВсеПроводкиОтправителя = ПроводкиОтправителя.Выгрузить();
	
	Если КодВидаШаблона = 1 Тогда
		ВсеПроводкиОтправителя.Свернуть("СчетДт, КЭКДт, СчетКт, КЭККт");
	ИначеЕсли КодВидаШаблона = 2 Тогда
		ВсеПроводкиОтправителя.Свернуть("СчетДт, КЭКДт, СчетКт, КЭККт, КПСДт, КПСКт");
	ИначеЕсли КодВидаШаблона = 3 Тогда
		ВсеПроводкиОтправителя.Свернуть("СчетДт, КЭКДт, СчетКт, КЭККт, КФО");
	ИначеЕсли КодВидаШаблона = 4 Тогда
		ВсеПроводкиОтправителя.Свернуть("СчетДт, КЭКДт, СчетКт, КЭККт, КПСДт, КПСКт, КФО");
	КонецЕсли;
	ТаблицаРекомендуемыеПроводки = ВсеПроводкиОтправителя;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаРекомендуемыеПроводки);
	
КонецФункции	

&НаКлиенте
Процедура ДобавитьШаблонРекомендуемыхПроводокПоКоду(КодВидаШаблона)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ДатаСведений", ДатаСведений);
	ПараметрыФормы.Вставить("ВидИзвещения", ВидИзвещения);
	ПараметрыФормы.Вставить("КодВидаШаблона", КодВидаШаблона);
	
	АдресТаблицыПроводокОтправителя = ПоместитьТаблицуПроводокОтправителяВХранилище(КодВидаШаблона);
	
	ПараметрыФормы.Вставить("АдресТаблицыПроводокОтправителя", АдресТаблицыПроводокОтправителя);
	
	ОткрытьФорму("Справочник.ПроводкиРекомендуемыеПолучателямЭлектронныхИзвещений.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Функция ВидимостьШаблоновПроводок() Экспорт
	Результат = ПравоДоступа("Изменение", Метаданные.Справочники.ПроводкиРекомендуемыеПолучателямЭлектронныхИзвещений);
	
	Возврат Результат;
КонецФункции

#КонецОбласти
