#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента", "Акт о приемке материалов");
	Запрос.УстановитьПараметр("НомерДокумента", ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДокументСсылка.Ссылка,ДокументСсылка.Номер));
	
	НомераТаблиц = Новый Структура;
	
	ИнициализироватьЗапросыПоОстаткамТоваров(Запрос, НомераТаблиц);
	
	#Область УчетДрагМатериалов
	ИнициализироватьЗапросыДМ(Запрос, НомераТаблиц);
	#КонецОбласти
	
	ИнициализироватьЗапросыПоОтражениюЭДВУчете(Запрос, НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыДМ(Запрос, НомераТаблиц)

	НомераТаблиц.Вставить("НаличиеДрагМатериаловВОбъектахНФА", НомераТаблиц.Количество()+1);
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	 "ВЫБРАТЬ
	 |	АктПриемкиМ7ДрагоценныеМатериалы.Ссылка.Дата КАК Период,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.Ссылка КАК Регистратор,
	 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.НомерСтроки КАК НомерСтроки,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.Ссылка.Организация,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.ОбъектНФА,
	 |	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК ИнвНомер,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.ВидДрагМатериала,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.МассаДМ КАК МассаДМ,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.КоличествоДМ КАК КоличествоДМ,
	 |	&ИмяДокумента КАК Основание,
	 |	&НомерДокумента КАК НомерОснования,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.Ссылка.Дата КАК ДатаОснования,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.ЕдИзм,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.Ссылка.АналитикаОперацииСДрагМатериалами КАК АналитикаОперации
	 |ИЗ
	 |	Документ.АктПриемкиМ7.ДрагоценныеМатериалы КАК АктПриемкиМ7ДрагоценныеМатериалы
	 |ГДЕ
	 |	АктПриемкиМ7ДрагоценныеМатериалы.Ссылка = &Ссылка
	 |	И АктПриемкиМ7ДрагоценныеМатериалы.МассаДМ > 0
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	НомерСтроки";
	 
	НомераТаблиц.Вставить("НаличиеДрагМатериаловВЛомеИОтходах", НомераТаблиц.Количество()+1);
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	 "ВЫБРАТЬ
	 |	АктПриемкиМ7ДрагоценныеМатериалы.Ссылка.Дата КАК Период,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.Ссылка КАК Регистратор,
	 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.НомерСтроки КАК НомерСтроки,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.Ссылка.Организация,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.ОбъектНФА,
	 |	ЗНАЧЕНИЕ(Перечисление.ВидыОбъектовСодержащихДрагМатериалы.ЛомДМ) КАК ВидОбъекта,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.ВидДрагМатериала,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.ЧистаяМасса,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.ЛигатурнаяМасса,
	 |	&ИмяДокумента КАК Основание,
	 |	&НомерДокумента КАК НомерОснования,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.Ссылка.Дата КАК ДатаОснования,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.ЕдИзм,
	 |	АктПриемкиМ7ДрагоценныеМатериалы.Ссылка.АналитикаОперацииСДрагМатериалами КАК АналитикаОперации
	 |ИЗ
	 |	Документ.АктПриемкиМ7.ДрагоценныеМатериалы КАК АктПриемкиМ7ДрагоценныеМатериалы
	 |ГДЕ
	 |	АктПриемкиМ7ДрагоценныеМатериалы.Ссылка = &Ссылка
	 |	И АктПриемкиМ7ДрагоценныеМатериалы.ЛигатурнаяМасса + АктПриемкиМ7ДрагоценныеМатериалы.ЧистаяМасса > 0
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	НомерСтроки";
	 
КонецПроцедуры	

Процедура ИнициализироватьЗапросыПоОстаткамТоваров(Запрос, НомераТаблиц)

	НомераТаблиц.Вставить("ТоварыВТорговыхТочках", НомераТаблиц.Количество()+1);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.Дата КАК Период,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка КАК Регистратор,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.Организация КАК Организация,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.ЦМО КАК ЦМО,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ИзмененияОстатковТоваровВТорговойТочкеТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ДвиженияТоваров
	|ИЗ
	|	Документ.АктПриемкиМ7.Материалы КАК ИзмененияОстатковТоваровВТорговойТочкеТовары
	|ГДЕ
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка = &Ссылка
	|	И ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.ПоступлениеТоваровНаСкладТорговойТочки = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Номенклатура,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.ЦМО,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.Организация,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ДвиженияТоваров.Период КАК Период,
	|	ДвиженияТоваров.Регистратор КАК Регистратор,
	|	ДвиженияТоваров.Организация КАК Организация,
	|	ДвиженияТоваров.ЦМО КАК ЦМО,
	|	ДвиженияТоваров.Номенклатура КАК Номенклатура,
	|	ДвиженияТоваров.Количество КАК Количество
	|ИЗ
	|	ДвиженияТоваров КАК ДвиженияТоваров";
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыПоОтражениюЭДВУчете(Запрос, НомераТаблиц)
	
	НомераТаблиц.Вставить("ОтражениеЭДВУчете", НомераТаблиц.Количество()+1);
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ОтражениеЭДВУчете.Ссылка КАК Регистратор,
	|	ОтражениеЭДВУчете.Дата КАК Период,
	|	ОтражениеЭДВУчете.Организация КАК Организация,
	|	ОтражениеЭДВУчете.ДокументОснование КАК ДокументЭД,
	|	ОтражениеЭДВУчете.Ссылка КАК ДокументОтраженияВУчете,
	|	ОтражениеЭДВУчете.СуммаДокумента КАК Сумма
	|ИЗ
	|	Документ.АктПриемкиМ7 КАК ОтражениеЭДВУчете
	|ГДЕ
	|	ОтражениеЭДВУчете.Ссылка = &Ссылка
	|	И ОтражениеЭДВУчете.ДокументОснование ССЫЛКА Документ.ЭлектронныйДокументПоставщика
	|	И(НЕ ОтражениеЭДВУчете.ДокументОснование = ЗНАЧЕНИЕ(Документ.ЭлектронныйДокументПоставщика.ПустаяСсылка))";
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.АктПриемкиМ7";
	КомандаПечати.Идентификатор		= "АктПриемки0504220_103н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о приемке материалов'"), "0504220", "52н", "103н");
	КомандаПечати.Порядок			= 1;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.АктПриемкиМ7";
	КомандаПечати.Идентификатор		= "АктПриемки0504220_52н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о приемке материалов'"), "0504220", "52н");
	КомандаПечати.Порядок			= 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.АктПриемкиМ7";
	КомандаПечати.Идентификатор		= "АктПриемкиМ7";
	КомандаПечати.Представление		= НСтр("ru = 'Акт о приемке материалов (М-7)'");
	КомандаПечати.Порядок			= 99;

	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "СправкаОСодержанииДрагМатериалов", 5);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПриемкиМ7") Тогда
		//ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
		ПерваяТаблица 		= Неопределено;
		ВтораяТаблица 		= Неопределено;
		ТретьяТаблица 		= Неопределено;
		ЧетвертаяТаблица	= Неопределено;
		ПечатьАктаПриемкиМ7(МассивОбъектов, ОбъектыПечати, ПерваяТаблица, ВтораяТаблица, ТретьяТаблица, ЧетвертаяТаблица);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"АктПриемкиМ7","Акт приемки М-7",ПерваяТаблица);
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"АктПриемкиМ7_2","Акт приемки М-7 (стр. 2)",ВтораяТаблица);
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"АктПриемкиМ7_3","Акт приемки М-7 (стр. 3)",ТретьяТаблица);
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"АктПриемкиМ7_4","Акт приемки М-7 (стр. 4)",ЧетвертаяТаблица);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПриемки0504220_103н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"АктПриемки0504220_103н",
			УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о приемке материалов'"), "0504220", "52н", "103н"),
			ПечатьАктаПриемки0504220(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктПриемки0504220_103н"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПриемки0504220_52н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"АктПриемки0504220_52н",
			УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о приемке материалов'"), "0504220", "52н"),
			ПечатьАктаПриемки0504220(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктПриемки0504220"));
		
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"СправкаОСодержанииДрагМатериалов") Тогда
	
		ТабличныйДокумент = УчетДрагМатериалов.ПечатьСправкиОСодержанииДрагМатериалов(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"СправкаОСодержанииДрагМатериалов","Справка о содержании драг. материалов", ТабличныйДокумент);
			
	КонецЕсли;
	
КонецПроцедуры // Печать

Функция ПечатьАктаПриемки0504220(МассивОбъектов, ОбъектыПечати, ИмяМакета)	
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ИмяПараметровПечати = "ПараметрыПечати__АктПриемки0504220";  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	АктПриемкиМ7.Ссылка КАК Ссылка,
	               |	АктПриемкиМ7.Номер КАК Номер,
	               |	АктПриемкиМ7.Дата КАК Дата,
	               |	АктПриемкиМ7.Организация КАК Организация,
	               |	ВЫБОР
	               |		КОГДА АктПриемкиМ7.Организация.НаименованиеПолное = """"
	               |			ТОГДА АктПриемкиМ7.Организация.Наименование
	               |		ИНАЧЕ АктПриемкиМ7.Организация.НаименованиеПолное
	               |	КОНЕЦ КАК НаименованиеОрганизация,
	               |	АктПриемкиМ7.Организация.КодОКПО КАК КодОКПО,
	               |	ЕСТЬNULL(АктПриемкиМ7.Организация.ИНН, """") КАК ИНН,
	               |	ВЫБОР
	               |		КОГДА АктПриемкиМ7.Подразделение.НаименованиеПолное = """"
	               |			ТОГДА ПРЕДСТАВЛЕНИЕ(АктПриемкиМ7.Подразделение)
	               |		ИНАЧЕ АктПриемкиМ7.Подразделение.НаименованиеПолное
	               |	КОНЕЦ КАК Подразделение,
	               |	ВЫБОР
	               |		КОГДА АктПриемкиМ7.Подразделение.ОбособленноеПодразделение
	               |			ТОГДА АктПриемкиМ7.Подразделение.РегистрацияВНалоговомОргане.КПП
	               |		ИНАЧЕ АктПриемкиМ7.Организация.КПП
	               |	КОНЕЦ КАК КПП,
	               |	АктПриемкиМ7.МестоСоставления КАК МестоСоставления,
	               |	АктПриемкиМ7.НомерСертификатаКачества КАК НомерСертификатаКачества,
	               |	АктПриемкиМ7.Станция КАК Станция,
	               |	АктПриемкиМ7.ВидСопроводительногоТД КАК ВидСопроводительногоТД,
	               |	АктПриемкиМ7.НомерСопроводительногоТД КАК НомерСопроводительногоТД,
	               |	АктПриемкиМ7.ДатаСопроводительногоТД КАК ДатаСопроводительногоТД,
	               |	АктПриемкиМ7.НомераВагонов КАК НомераВагонов,
	               |	АктПриемкиМ7.Контрагент КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА АктПриемкиМ7.Контрагент.ВидКонтрагента ЕСТЬ NULL
	               |			ТОГДА """"
	               |		КОГДА АктПриемкиМ7.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА ВЫРАЗИТЬ(АктПриемкиМ7.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).НаименованиеПолное
	               |		ИНАЧЕ ВЫРАЗИТЬ(АктПриемкиМ7.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ФизическиеЛица).Наименование
	               |	КОНЕЦ КАК КонтрагентНаименованиеПолное,
	               |	ЕСТЬNULL(АктПриемкиМ7.Контрагент.НаименованиеСокращенное, """") КАК КонтрагентНаименованиеСокращенное,
	               |	ЕСТЬNULL(АктПриемкиМ7.Контрагент.ВидКонтрагента, ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ПустаяСсылка)) КАК КонтрагентВидКонтрагента,
	               |	АктПриемкиМ7.Контрагент.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо,
	               |	ЕСТЬNULL(АктПриемкиМ7.Контрагент.ЮридическоеФизическоеЛицо.КодОКПО, """") КАК КодОКПОКонтрагент,
	               |	ЕСТЬNULL(АктПриемкиМ7.Контрагент.ИНН, """") КАК ИННКонтрагент,
	               |	ЕСТЬNULL(АктПриемкиМ7.Контрагент.КПП, """") КАК КППКонтрагент,
	               |	АктПриемкиМ7.Договор КАК Договор,
	               |	АктПриемкиМ7.Грузоотправитель КАК Грузоотправитель,
	               |	ВЫБОР
	               |		КОГДА АктПриемкиМ7.Грузоотправитель.ВидКонтрагента ЕСТЬ NULL
	               |			ТОГДА """"
	               |		КОГДА АктПриемкиМ7.Грузоотправитель.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА ВЫРАЗИТЬ(АктПриемкиМ7.Грузоотправитель.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).НаименованиеПолное
	               |		ИНАЧЕ ВЫРАЗИТЬ(АктПриемкиМ7.Грузоотправитель.ЮридическоеФизическоеЛицо КАК Справочник.ФизическиеЛица).Наименование
	               |	КОНЕЦ КАК ГрузоотправительНаименованиеПолное,
	               |	ЕСТЬNULL(АктПриемкиМ7.Грузоотправитель.НаименованиеСокращенное, """") КАК ГрузоотправительНаименованиеСокращенное,
	               |	ЕСТЬNULL(АктПриемкиМ7.Грузоотправитель.ВидКонтрагента, ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ПустаяСсылка)) КАК ГрузоотправительВидКонтрагента,
	               |	АктПриемкиМ7.Грузоотправитель.ЮридическоеФизическоеЛицо КАК ГрузоотправительЮридическоеФизическоеЛицо,
	               |	ЕСТЬNULL(АктПриемкиМ7.Грузоотправитель.ЮридическоеФизическоеЛицо.КодОКПО, """") КАК КодОКПОГрузоотправитель,
	               |	ЕСТЬNULL(АктПриемкиМ7.Грузоотправитель.ИНН, """") КАК ИННГрузоотправитель,
	               |	ЕСТЬNULL(АктПриемкиМ7.Грузоотправитель.КПП, """") КАК КППГрузоотправитель,
	               |	АктПриемкиМ7.Грузополучатель КАК Грузополучатель,
	               |	АктПриемкиМ7.СтраховаяКомпания КАК СтраховаяКомпания,
	               |	ВЫБОР
	               |		КОГДА АктПриемкиМ7.СтраховаяКомпания.ВидКонтрагента ЕСТЬ NULL
	               |			ТОГДА """"
	               |		КОГДА АктПриемкиМ7.СтраховаяКомпания.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	               |			ТОГДА ВЫРАЗИТЬ(АктПриемкиМ7.СтраховаяКомпания.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).НаименованиеПолное
	               |		ИНАЧЕ ВЫРАЗИТЬ(АктПриемкиМ7.СтраховаяКомпания.ЮридическоеФизическоеЛицо КАК Справочник.ФизическиеЛица).Наименование
	               |	КОНЕЦ КАК СтраховаяКомпанияНаименованиеПолное,
	               |	ЕСТЬNULL(АктПриемкиМ7.СтраховаяКомпания.НаименованиеСокращенное, """") КАК СтраховаяКомпанияНаименованиеСокращенное,
	               |	ЕСТЬNULL(АктПриемкиМ7.СтраховаяКомпания.ВидКонтрагента, ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ПустаяСсылка)) КАК СтраховаяКомпанияВидКонтрагента,
	               |	АктПриемкиМ7.СтраховаяКомпания.ЮридическоеФизическоеЛицо КАК СтраховаяКомпанияЮридическоеФизическоеЛицо,
	               |	ЕСТЬNULL(АктПриемкиМ7.СтраховаяКомпания.ЮридическоеФизическоеЛицо.КодОКПО, """") КАК КодОКПОСтраховаяКомпания,
	               |	ЕСТЬNULL(АктПриемкиМ7.СтраховаяКомпания.ИНН, """") КАК ИННСтраховаяКомпания,
	               |	ЕСТЬNULL(АктПриемкиМ7.СтраховаяКомпания.КПП, """") КАК КППСтраховаяКомпания,
	               |	ЕСТЬNULL(АктПриемкиМ7.Договор.НомерДоговора, """") КАК НомерДоговора,
	               |	ЕСТЬNULL(АктПриемкиМ7.Договор.ДатаДоговора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоговора,
	               |	АктПриемкиМ7.УсловияХранения КАК УсловияХранения,
	               |	АктПриемкиМ7.СостояниеТары КАК СостояниеТары,
	               |	АктПриемкиМ7.МетодОпределенияНедостачи КАК МетодОпределенияНедостачи,
	               |	АктПриемкиМ7.ДругиеДанные КАК ДругиеДанные,
	               |	АктПриемкиМ7.ЦМО КАК ЦМО,
	               |	ЕСТЬNULL(АктПриемкиМ7.ЦМО.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МОЛ,
	               |	ЕСТЬNULL(АктПриемкиМ7.ЦМО.МестоХранения, ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)) КАК СкладПредставление,
	               |	ЕСТЬNULL(АктПриемкиМ7.Контрагент.Код, """") КАК КодПоставщика,
	               |	АктПриемкиМ7.ЗаключениеКомиссии КАК ЗаключениеКомиссии,
	               |	АктПриемкиМ7.ДатаОприходования КАК ДатаОприходования,
	               |	АктПриемкиМ7.НомерКоммерческогоАкта КАК НомерКоммерческогоАкта,
	               |	АктПриемкиМ7.ДатаКоммерческогоАкта КАК ДатаКоммерческогоАкта,
	               |	АктПриемкиМ7.ДатаПриказаКомиссии КАК ДатаПриказа,
	               |	АктПриемкиМ7.Ответственный,
	               |	АктПриемкиМ7.СоставКонтейнеров.(
	               |		ОтметкаОпломбирования КАК ОтметкаОпломбирования,
	               |		КоличествоМест КАК КоличествоМест,
	               |		ВидУпаковки КАК ВидУпаковки,
	               |		НомераКонтейнеров КАК НомераКонтейнеров,
	               |		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |		ЕдиницаИзмерения.Код КАК КодЕдиницы,
	               |		ЕдиницаИзмерения.Представление КАК НаименованиеЕдиницы,
	               |		МассаГрузаОтправитель КАК МассаГрузаОтправитель,
	               |		МассаГрузаДороги КАК МассаГрузаДороги,
	               |		ОсобыеОтметки КАК ОсобыеОтметки
	               |	) КАК СоставКонтейнеров,
	               |	АктПриемкиМ7.СоставКомиссии.(
	               |		ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	               |		ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	               |		ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	               |		ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии,
	               |		Председатель КАК Председатель
	               |	) КАК СоставКомиссии,
	               |	АктПриемкиМ7.СоставПриложения.(
	               |		ВидПриложения КАК ВидПриложения,
	               |		НомерДокумента КАК НомерДокумента,
	               |		ДатаДокумента КАК ДатаДокумента
	               |	) КАК СоставПриложения,
	               |	АктПриемкиМ7.Материалы.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		ВЫБОР
	               |			КОГДА АктПриемкиМ7.Материалы.Номенклатура.НаименованиеПолное <> """"
	               |				ТОГДА АктПриемкиМ7.Материалы.Номенклатура.НаименованиеПолное
	               |			ИНАЧЕ АктПриемкиМ7.Материалы.Номенклатура.Наименование
	               |		КОНЕЦ КАК Номенклатура,
	               |		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |		КоличествоПоДокументам КАК КоличествоПоДокументам,
	               |		ЦенаПоДокументам КАК ЦенаПоДокументам,
	               |		СуммаПоДокументам КАК СуммаПоДокументам,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма,
	               |		КоличествоБой КАК КоличествоБой,
	               |		КоличествоНедостачи КАК КоличествоНедостачи,
	               |		КоличествоИзлишки КАК КоличествоИзлишки,
	               |		НомерПаспорта КАК НомерПаспорта,
	               |		ВЫБОР
	               |			КОГДА АктПриемкиМ7.Материалы.Номенклатура.НоменклатурныйНомер = """"
	               |				ТОГДА АктПриемкиМ7.Материалы.Номенклатура.Код
	               |			ИНАЧЕ АктПриемкиМ7.Материалы.Номенклатура.НоменклатурныйНомер
	               |		КОНЕЦ КАК НоменклатурныйНомер,
	               |		ЕдиницаИзмерения.Код КАК КодЕдиницы,
	               |		ЕдиницаИзмерения.Представление КАК НаименованиеЕдиницы,
	               |		АктПриемкиМ7.Материалы.КоличествоБой * АктПриемкиМ7.Материалы.Цена КАК СуммаБой,
	               |		АктПриемкиМ7.Материалы.КоличествоНедостачи * АктПриемкиМ7.Материалы.Цена КАК СуммаНедостачи,
	               |		АктПриемкиМ7.Материалы.КоличествоИзлишки * АктПриемкиМ7.Материалы.Цена КАК СуммаИзлишки
	               |	) КАК Материалы,
	               |	АктПриемкиМ7.ОсновныеСредства.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		ВЫБОР
	               |			КОГДА АктПриемкиМ7.ОсновныеСредства.ОсновноеСредство.НаименованиеПолное <> """"
	               |				ТОГДА АктПриемкиМ7.ОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	               |			ИНАЧЕ АктПриемкиМ7.ОсновныеСредства.ОсновноеСредство.Наименование
	               |		КОНЕЦ КАК Номенклатура,
	               |		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |		КоличествоПоДокументам КАК КоличествоПоДокументам,
	               |		ЦенаПоДокументам КАК ЦенаПоДокументам,
	               |		СуммаПоДокументам КАК СуммаПоДокументам,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма,
	               |		КоличествоБой КАК КоличествоБой,
	               |		КоличествоНедостачи КАК КоличествоНедостачи,
	               |		КоличествоИзлишки КАК КоличествоИзлишки,
	               |		НомерПаспорта КАК НомерПаспорта,
	               |		ОсновноеСредство.Код КАК НоменклатурныйНомер,
	               |		ЕдиницаИзмерения.Код КАК КодЕдиницы,
	               |		ЕдиницаИзмерения.Представление КАК НаименованиеЕдиницы,
	               |		АктПриемкиМ7.ОсновныеСредства.КоличествоБой * АктПриемкиМ7.ОсновныеСредства.Цена КАК СуммаБой,
	               |		АктПриемкиМ7.ОсновныеСредства.КоличествоНедостачи * АктПриемкиМ7.ОсновныеСредства.Цена КАК СуммаНедостачи,
	               |		АктПриемкиМ7.ОсновныеСредства.КоличествоИзлишки * АктПриемкиМ7.ОсновныеСредства.Цена КАК СуммаИзлишки
	               |	) КАК ОсновныеСредства
	               |ИЗ
	               |	Документ.АктПриемкиМ7 КАК АктПриемкиМ7
	               |ГДЕ
	               |	АктПриемкиМ7.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	Номер";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);				   
					   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АктПриемкиМ7." + ИмяМакета);
		
	ОбластьМакетаЗаголовок     = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакетаШапка1        = Макет.ПолучитьОбласть("Шапка1");
	ОбластьМакетаСтрока1       = Макет.ПолучитьОбласть("Строка1");
	ОбластьМакетаСтрока1Пустая = Макет.ПолучитьОбласть("Строка1Пустая");
	
	ОбластьМакетаТаблица1      = Макет.ПолучитьОбласть("Таблица1");
	ОбластьМакетаСтраница2     = Макет.ПолучитьОбласть("Страница2");
	ОбластьМакетаСтраница2_1   = Макет.ПолучитьОбласть("Страница2");
	ОбластьМакетаСтраница2_1_1 = Макет.ПолучитьОбласть("Страница2_1_1");
	ОбластьМакетаСтраница2_1_2 = Макет.ПолучитьОбласть("Страница2_1_2");
	ОбластьМакетаСтраница2_1_3 = Макет.ПолучитьОбласть("Страница2_1_3");
	ОбластьМакетаСтраница2_2   = Макет.ПолучитьОбласть("Страница2_2");
	ОбластьМакетаСтраница2_2_1 = Макет.ПолучитьОбласть("Страница2_2_1");
	ОбластьМакетаСтраница2_2_2 = Макет.ПолучитьОбласть("Страница2_2_2");
	ОбластьМакетаСтраница2_3   = Макет.ПолучитьОбласть("Страница2_3");
	ОбластьМакетаСтраница2_4   = Макет.ПолучитьОбласть("Страница2_4");
	ОбластьМакетаСтраница2_4_1 = Макет.ПолучитьОбласть("Страница2_4_1");
	ОбластьМакетаСтраница2_4_2 = Макет.ПолучитьОбласть("Страница2_4_2");
	
	ОбластьМакетаТаблица2      	= Макет.ПолучитьОбласть("Таблица2");
	ОбластьМакетаШапка2        	= Макет.ПолучитьОбласть("Шапка2");
	
	ОбластьМакетаСтраница4     = Макет.ПолучитьОбласть("Страница4");
	ОбластьМакетаКомиссия      = Макет.ПолучитьОбласть("Комиссия");
	ОбластьМакетаСтраница41    = Макет.ПолучитьОбласть("Страница41");
	
	ОбластиДляСтроки = Новый Структура("ОбластьМакетаСтрока2, ОбластьМакетаИтог9, ОбластьМакетаЗаголовок3, ОбластьМакетаШапка9, ОбластьМакетаСтрока2Пустая");
	ОбластиДляСтроки.ОбластьМакетаСтрока2       = Макет.ПолучитьОбласть("Строка2");
	ОбластиДляСтроки.ОбластьМакетаИтог9         = Макет.ПолучитьОбласть("ИтогТаблицы9");
	ОбластиДляСтроки.ОбластьМакетаЗаголовок3    = Макет.ПолучитьОбласть("Страница3Заголовок");
	ОбластиДляСтроки.ОбластьМакетаШапка9        = Макет.ПолучитьОбласть("ШапкаТаблицы9");
	ОбластиДляСтроки.ОбластьМакетаСтрока2Пустая = Макет.ПолучитьОбласть("Строка2Пустая");
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
    	НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			
		// вывод первой страницы документа
		
		ПараметрыЗаголовка = Новый Структура();
		
		ОбластьМакетаЗаголовок.Параметры.Заполнить(Выборка);
		
		ПараметрыЗаголовка = Новый Структура("НаименованиеГрузоотправитель, АдресГрузоотправитель, НаименованиеКонтрагент,"
			+ "АдресКонтрагент, НаименованиеСтраховаяКомпания, АдресСтраховаяКомпания, АдресОрганизация");
		ПараметрыЗаголовка.АдресГрузоотправитель = ПочтовыйАдресКонтрагента(
			Выборка.ГрузоотправительЮридическоеФизическоеЛицо, Выборка.ГрузоотправительВидКонтрагента);
		ПараметрыЗаголовка.АдресКонтрагент = ЮридическийАдресКонтрагента(
			Выборка.КонтрагентЮридическоеФизическоеЛицо, Выборка.КонтрагентВидКонтрагента);
		ПараметрыЗаголовка.АдресСтраховаяКомпания = ЮридическийАдресКонтрагента(
			Выборка.СтраховаяКомпанияЮридическоеФизическоеЛицо, Выборка.СтраховаяКомпанияВидКонтрагента);
		ПараметрыЗаголовка.НаименованиеГрузоотправитель = НаименованиеКонтрагента(Выборка.ГрузоотправительНаименованиеСокращенное,
			Выборка.ГрузоотправительНаименованиеПолное, Выборка.ГрузоотправительВидКонтрагента);
		ПараметрыЗаголовка.НаименованиеКонтрагент = НаименованиеКонтрагента(Выборка.КонтрагентНаименованиеСокращенное,
			Выборка.КонтрагентНаименованиеПолное, Выборка.КонтрагентВидКонтрагента);
		ПараметрыЗаголовка.НаименованиеСтраховаяКомпания = НаименованиеКонтрагента(Выборка.СтраховаяКомпанияНаименованиеСокращенное,
			Выборка.СтраховаяКомпанияНаименованиеПолное, Выборка.СтраховаяКомпанияВидКонтрагента);
		ПараметрыЗаголовка.АдресОрганизация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Выборка.Организация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
		ОбластьМакетаЗаголовок.Параметры.Заполнить(ПараметрыЗаголовка);
		
		ОтветственныеЛица = Справочники.Организации.ПолучитьОтветственныхЛицОрганизации(Выборка.Организация, Выборка.Дата);
		СтрРуководитель = ОтветственныеЛица.Найти(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, "ИсполняемаяФункцияСсылка");
		
		СтруктураЗаголовок = Новый Структура("ФИОРуководитель, ДолжностьРуководитель, Номер, ДатаЗаголовка, НомерДатаСопроводительногоДокумента");
		Если СтрРуководитель <> Неопределено Тогда
			СтруктураЗаголовок.ФИОРуководитель       = Справочники.Сотрудники.ФамилияИО(СтрРуководитель.ОтветственноеЛицоСсылка, Истина, Выборка.Дата);
			СтруктураЗаголовок.ДолжностьРуководитель = СтрРуководитель.ДолжностьПредставление;
		КонецЕсли;
		СтруктураЗаголовок.Номер = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(Выборка.Ссылка, Выборка.Номер);
		СтруктураЗаголовок.ДатаЗаголовка = Формат(Выборка.Дата, "ДЛФ=DD");
		СтруктураЗаголовок.НомерДатаСопроводительногоДокумента = СтрШаблон(НСтр("ru = '%1 от %2 №%3'"),
			СокрЛП(Выборка.ВидСопроводительногоТД),
			Формат(Выборка.ДатаСопроводительногоТД, "ДЛФ=DD"),
			СокрЛП(Выборка.НомерСопроводительногоТД));
		
		ОбластьМакетаЗаголовок.Параметры.Заполнить(СтруктураЗаголовок);
		
		ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
		ТабДокумент.Вывести(ОбластьМакетаШапка1);
		
		ВыборкаСоставКонтейнеров = Выборка.СоставКонтейнеров.Выбрать();
		
		Пока ВыборкаСоставКонтейнеров.Следующий() Цикл
			ОбластьМакетаСтрока1.Параметры.Заполнить(ВыборкаСоставКонтейнеров);
			ТабДокумент.Вывести(ОбластьМакетаСтрока1);
		КонецЦикла;	
		
		Области = Новый Массив;
		Области.Добавить(ОбластьМакетаСтрока1Пустая);
		Области.Добавить(ОбластьМакетаСтрока1Пустая);
		
		Попытка
			Пока ТабДокумент.ПроверитьВывод(Области) Цикл
				ТабДокумент.Вывести(ОбластьМакетаСтрока1Пустая);
			КонецЦикла;
		Исключение
		КонецПопытки;
		
		// вывод второй страницы документа
	
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
		ТабДокумент.Вывести(ОбластьМакетаТаблица1);
				
		Если ПустаяСтрока(Выборка.УсловияХранения)
			И ПустаяСтрока(Выборка.СостояниеТары)
			И ПустаяСтрока(Выборка.ДругиеДанные) Тогда
			ОбластьМакетаСтраница2.Параметры.Заполнить(Выборка);
			ТабДокумент.Вывести(ОбластьМакетаСтраница2);
		Иначе
			Если ПустаяСтрока(Выборка.УсловияХранения) Тогда
				ТабДокумент.Вывести(ОбластьМакетаСтраница2_1);
			Иначе
				ОбластьМакетаСтраница2_1_2.Параметры.Заполнить(Выборка);
				ТабДокумент.Вывести(ОбластьМакетаСтраница2_1_1);
				ТабДокумент.Вывести(ОбластьМакетаСтраница2_1_2);
				ТабДокумент.Вывести(ОбластьМакетаСтраница2_1_3);
			КонецЕсли;
			
			Если ПустаяСтрока(Выборка.СостояниеТары) Тогда
				ТабДокумент.Вывести(ОбластьМакетаСтраница2_2);
			Иначе
				ОбластьМакетаСтраница2_2_2.Параметры.Заполнить(Выборка);
				ТабДокумент.Вывести(ОбластьМакетаСтраница2_2_1);
				ТабДокумент.Вывести(ОбластьМакетаСтраница2_2_2);
				ТабДокумент.Вывести(ОбластьМакетаСтраница2_1_3);
			КонецЕсли;
			
			ОбластьМакетаСтраница2_3.Параметры.Заполнить(Выборка);
			ТабДокумент.Вывести(ОбластьМакетаСтраница2_3);
			
			Если ПустаяСтрока(Выборка.ДругиеДанные) Тогда
				ТабДокумент.Вывести(ОбластьМакетаСтраница2_4);
			Иначе
				ОбластьМакетаСтраница2_4_2.Параметры.Заполнить(Выборка);
				ТабДокумент.Вывести(ОбластьМакетаСтраница2_4_1);
				ТабДокумент.Вывести(ОбластьМакетаСтраница2_4_2);
				ТабДокумент.Вывести(ОбластьМакетаСтраница2_1_3);	
			КонецЕсли;
		КонецЕсли;
		
		// вывод третьей страницы документа
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ОбластьМакетаТаблица2.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(ОбластьМакетаТаблица2);
		ТабДокумент.Вывести(ОбластьМакетаШапка2);
		
		Итоги9 = ИтогиТаблицы9();
		
		ВывестиСоставТаблицыМЦ(Выборка.Материалы.Выбрать(), ТабДокумент, ОбластиДляСтроки, Итоги9);
		ВывестиСоставТаблицыМЦ(Выборка.ОсновныеСредства.Выбрать(), ТабДокумент, ОбластиДляСтроки, Итоги9);
		
		ВывестиПустыеСтрокиДоКонцаСтраницыИСтрокуИтога(ТабДокумент, ОбластиДляСтроки);
		
		// вывод четвертой страницы документа
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ПереченьДокументов = Новый Массив;
		ВыборкаСоставПриложения = Выборка.СоставПриложения.Выбрать();
		Пока ВыборкаСоставПриложения.Следующий() Цикл
			ПереченьДокументов.Добавить(СтрШаблон(НСтр("ru = '%1 от %2 №%3'"),
				ВыборкаСоставПриложения.ВидПриложения,
				Формат(ВыборкаСоставПриложения.ДатаДокумента, "ДЛФ=D"),
				ВыборкаСоставПриложения.НомерДокумента));
		КонецЦикла;
		
		ОбластьМакетаСтраница4.Параметры.Заполнить(Выборка);
		ОбластьМакетаСтраница4.Параметры.Заполнить(Новый Структура("ПереченьДокументов", СтрСоединить(ПереченьДокументов, НСтр("ru = ', '"))));
		ТабДокумент.Вывести(ОбластьМакетаСтраница4);
		
		ВыборкаКомиссии = Выборка.СоставКомиссии.Выгрузить();
		
		Отбор = Новый Структура("Председатель", Истина);
		СтрПредседатель = ВыборкаКомиссии.НайтиСтроки(Отбор);
		СтатусЧленаКомиссии = НСтр("ru = 'Председатель комиссии'");
		Если СтрПредседатель.Количество() > 0 Тогда
			ВывестиЧленаКомиссии(ТабДокумент, ОбластьМакетаКомиссия, СтрПредседатель[0], СтатусЧленаКомиссии);
		Иначе
			ВывестиЧленаКомиссии(ТабДокумент, ОбластьМакетаКомиссия, Неопределено, СтатусЧленаКомиссии);
		КонецЕсли;
				
		Отбор = Новый Структура("Председатель", Ложь);
		СтрокиКомиссия = ВыборкаКомиссии.НайтиСтроки(Отбор);
		СтатусЧленаКомиссии =  НСтр("ru = 'Члены комиссии'");
		Для Каждого ВыборкаКомиссии Из СтрокиКомиссия Цикл
			ВывестиЧленаКомиссии(ТабДокумент, ОбластьМакетаКомиссия, ВыборкаКомиссии, СтатусЧленаКомиссии);
			СтатусЧленаКомиссии = "";
		КонецЦикла;
		
		Для Счетчик = СтрокиКомиссия.Количество() По 2 Цикл
		
			ВывестиЧленаКомиссии(ТабДокумент, ОбластьМакетаКомиссия, Неопределено, СтатусЧленаКомиссии);
			СтатусЧленаКомиссии = "";
		
		КонецЦикла; 
		
		ОбластьМакетаСтраница41.Параметры.Заполнить(Выборка);
		Если ЗначениеЗаполнено(Выборка.МОЛ) Тогда
			ОбластьМакетаСтраница41.Параметры.Заполнить(Новый Структура("ФИОМОЛ", Корреспонденты.ФИОПоОбъекту(Выборка.МОЛ, Истина)));
		КонецЕсли;	
		ПараметрыОбластиОтветственного = Новый Структура("ДолжностьОтвИсполнитель, ФИООтвИсполнитель, ТелефонОтвИсполнитель, ЭлАдресОтвИсполнитель");
		Если ЗначениеЗаполнено(Выборка.Ответственный) Тогда
			ДанныеОтветственного = УправлениеПечатьюБГУ.СведенияИсполнителяПоОтветственному(Выборка.Ответственный,
				Выборка.Организация, 
				Выборка.Дата,
				Истина);
			ПараметрыОбластиОтветственного.ДолжностьОтвИсполнитель = ДанныеОтветственного.ДолжностьНаименование;
			ПараметрыОбластиОтветственного.ФИООтвИсполнитель       = ДанныеОтветственного.ФИО;
			ПараметрыОбластиОтветственного.ТелефонОтвИсполнитель   = ДанныеОтветственного.НомерТелефона;
			ПараметрыОбластиОтветственного.ЭлАдресОтвИсполнитель   = ДанныеОтветственного.ЭлектроннаяПочта;
		КонецЕсли;
		ОбластьМакетаСтраница41.Параметры.Заполнить(ПараметрыОбластиОтветственного);
		ТабДокумент.Вывести(ОбластьМакетаСтраница41);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ЮридическийАдресКонтрагента(Контрагент, ВидКонтрагента)

	Если ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда 
		
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Контрагент, Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты);
		
	Иначе
		
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Контрагент, Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица);
		
	КонецЕсли;

КонецФункции

Функция ПочтовыйАдресКонтрагента(Контрагент, ВидКонтрагента)

	Если ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда 
		
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Контрагент, Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагенты);
		
	Иначе
		
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Контрагент, Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица);
		
	КонецЕсли;

КонецФункции

Функция НаименованиеКонтрагента(Краткое, Полное, ВидКонтрагента)

	Если ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		
		Возврат Краткое;
		
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(Полное), Полное, Краткое);

КонецФункции

Процедура ДобавитьВИтоги(Итоги9, СтрокаСоставаМЦ)

	Итоги9.ИтогоКоличествоПоДокументам = Итоги9.ИтогоКоличествоПоДокументам + СтрокаСоставаМЦ.КоличествоПоДокументам;
	Итоги9.ИтогоСуммаПоДокументам      = Итоги9.ИтогоСуммаПоДокументам      + СтрокаСоставаМЦ.СуммаПоДокументам;
	Итоги9.ИтогоКоличество             = Итоги9.ИтогоКоличество             + СтрокаСоставаМЦ.Количество;
	Итоги9.ИтогоСумма                  = Итоги9.ИтогоСумма                  + СтрокаСоставаМЦ.Сумма;
	Итоги9.ИтогоКоличествоИзлишки      = Итоги9.ИтогоКоличествоИзлишки      + СтрокаСоставаМЦ.КоличествоИзлишки;
	Итоги9.ИтогоСуммаИзлишки           = Итоги9.ИтогоСуммаИзлишки           + СтрокаСоставаМЦ.СуммаИзлишки;
	Итоги9.ИтогоКоличествоБой          = Итоги9.ИтогоКоличествоБой          + СтрокаСоставаМЦ.КоличествоБой;
	Итоги9.ИтогоСуммаБой               = Итоги9.ИтогоСуммаБой               + СтрокаСоставаМЦ.СуммаБой;
	Итоги9.ИтогоКоличествоНедостачи    = Итоги9.ИтогоКоличествоНедостачи    + СтрокаСоставаМЦ.КоличествоНедостачи;
	Итоги9.ИтогоСуммаНедостачи         = Итоги9.ИтогоСуммаНедостачи         + СтрокаСоставаМЦ.СуммаНедостачи;

КонецПроцедуры

Процедура ВывестиСоставТаблицыМЦ(ВыборкаСоставМЦ, ТабДокумент, Области, Итоги9)

	ОбластьМакетаСтрока2    = Области.ОбластьМакетаСтрока2;
	ОбластьМакетаИтог9      = Области.ОбластьМакетаИтог9;
	ОбластьМакетаЗаголовок3 = Области.ОбластьМакетаЗаголовок3;
	ОбластьМакетаШапка9     = Области.ОбластьМакетаШапка9;
	
	Пока ВыборкаСоставМЦ.Следующий() Цикл
		
		ОбластьМакетаСтрока2.Параметры.Заполнить(ВыборкаСоставМЦ);
		
		ДобавитьВИтоги(Итоги9, ВыборкаСоставМЦ);
		
		ОбластьМакетаИтог9.Параметры.Заполнить(Итоги9);
		
		ОбластиДляПроверки = Новый Массив;
		ОбластиДляПроверки.Добавить(ОбластьМакетаСтрока2);
		ОбластиДляПроверки.Добавить(ОбластьМакетаИтог9);
		
		Если НЕ ТабДокумент.ПроверитьВывод(ОбластиДляПроверки) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьМакетаЗаголовок3);
			ТабДокумент.Вывести(ОбластьМакетаШапка9);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакетаСтрока2);
		
	КонецЦикла;

КонецПроцедуры

Процедура ВывестиПустыеСтрокиДоКонцаСтраницыИСтрокуИтога(ТабДокумент, Области)

	ОбластиДляПроверки = Новый Массив;
	ОбластиДляПроверки.Добавить(Области.ОбластьМакетаСтрока2Пустая);
	ОбластиДляПроверки.Добавить(Области.ОбластьМакетаИтог9);
	
	Пока ТабДокумент.ПроверитьВывод(ОбластиДляПроверки) Цикл
		ТабДокумент.Вывести(Области.ОбластьМакетаСтрока2Пустая);
	КонецЦикла;
	
	ТабДокумент.Вывести(Области.ОбластьМакетаИтог9);

КонецПроцедуры
 
Процедура ВывестиЧленаКомиссии(ТабДокумент, Область, ДанныеЧленаКомиссии, СтатусЧленаКомиссии)

	ПараметрыСтроки = Новый Структура("СтатусЧленаКомиссии, ДолжностьЧленаКомиссии, ФИОЧленаКомиссии",
		СтатусЧленаКомиссии);
	Если ДанныеЧленаКомиссии <> Неопределено Тогда
		СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество",
			ДанныеЧленаКомиссии.ФамилияЧленаКомиссии,
			ДанныеЧленаКомиссии.ИмяЧленаКомиссии,
			ДанныеЧленаКомиссии.ОтчествоЧленаКомиссии);
		ПараметрыСтроки.ФИОЧленаКомиссии       = КорреспондентыКлиентСервер.ФИО(СтруктураФИО, Истина);
		ПараметрыСтроки.ДолжностьЧленаКомиссии = ДанныеЧленаКомиссии.ДолжностьЧленаКомиссии;
	КонецЕсли;
	Область.Параметры.Заполнить(ПараметрыСтроки);
	ТабДокумент.Вывести(Область);

КонецПроцедуры

Функция ИтогиТаблицы9()

	Итоги9 = Новый Структура("ИтогоКоличествоПоДокументам, ИтогоСуммаПоДокументам, ИтогоКоличество, ИтогоСумма,"
		+ "ИтогоКоличествоИзлишки, ИтогоСуммаИзлишки, ИтогоКоличествоБой, ИтогоСуммаБой, ИтогоКоличествоНедостачи, ИтогоСуммаНедостачи");
	Для каждого ЗаписьСтруктуры Из Итоги9 Цикл
	
		Итоги9[ЗаписьСтруктуры.Ключ] = 0;
	
	КонецЦикла;
	
	Возврат Итоги9;

КонецФункции

Процедура ПечатьАктаПриемкиМ7(МассивОбъектов, ОбъектыПечати, ПерваяТаблица, ВтораяТаблица, ТретьяТаблица, ЧетвертаяТаблица)	
	
	ТабДокумент1 = Новый ТабличныйДокумент;
	ТабДокумент2 = Новый ТабличныйДокумент;
	ТабДокумент3 = Новый ТабличныйДокумент;
	ТабДокумент4 = Новый ТабличныйДокумент;
	
	ТабДокумент1.ИмяПараметровПечати = "Шапка_АктПриемкиМ7";
	ТабДокумент2.ИмяПараметровПечати = "Шапка_АктПриемкиМ7";
	ТабДокумент3.ИмяПараметровПечати = "Таблица_АктПриемкиМ7";
	ТабДокумент4.ИмяПараметровПечати = "Шапка_АктПриемкиМ7";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АктПриемкиМ7.Контрагент
	               |ПОМЕСТИТЬ Контрагенты
	               |ИЗ
	               |	Документ.АктПриемкиМ7 КАК АктПриемкиМ7
	               |ГДЕ
	               |	АктПриемкиМ7.Ссылка В(&МассивОбъектов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АктПриемкиМ7.Грузоотправитель
	               |ИЗ
	               |	Документ.АктПриемкиМ7 КАК АктПриемкиМ7
	               |ГДЕ
	               |	АктПриемкиМ7.Ссылка В(&МассивОбъектов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АктПриемкиМ7.Грузополучатель
	               |ИЗ
	               |	Документ.АктПриемкиМ7 КАК АктПриемкиМ7
	               |ГДЕ
	               |	АктПриемкиМ7.Ссылка В(&МассивОбъектов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АктПриемкиМ7.СтраховаяКомпания
	               |ИЗ
	               |	Документ.АктПриемкиМ7 КАК АктПриемкиМ7
	               |ГДЕ
	               |	АктПриемкиМ7.Ссылка В(&МассивОбъектов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Контрагенты.Ссылка,
	               |	МАКСИМУМ(ПОДСТРОКА(ВЫБОР
	               |				КОГДА ТИПЗНАЧЕНИЯ(Контрагенты.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ПОДСТРОКА(Контрагенты.ЮридическоеФизическоеЛицо.НаименованиеПолное, 1, 1000) = """"
	               |								ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.Наименование
	               |							ИНАЧЕ ПОДСТРОКА(Контрагенты.ЮридическоеФизическоеЛицо.НаименованиеПолное, 1, 1000)
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ТИПЗНАЧЕНИЯ(Контрагенты.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ФизическиеЛица)
	               |							ТОГДА Контрагенты.ЮридическоеФизическоеЛицо.Наименование
	               |						ИНАЧЕ """"
	               |					КОНЕЦ
	               |			КОНЕЦ, 1, 1000)) КАК ПолноеНаименование,
	               |	МАКСИМУМ(ПОДСТРОКА(ВЫБОР
	               |				КОГДА ТИПЗНАЧЕНИЯ(Контрагенты.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ЮридическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	               |									И ЮридическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактическийАдресКонтрагенты)
	               |								ТОГДА ЮридическиеЛицаКонтактнаяИнформация.Представление
	               |							ИНАЧЕ """"
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	               |								И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица)
	               |							ТОГДА ФизическиеЛицаКонтактнаяИнформация.Представление
	               |						ИНАЧЕ """"
	               |					КОНЕЦ
	               |			КОНЕЦ, 1, 1000)) КАК ФактАдрес,
	               |	МАКСИМУМ(ПОДСТРОКА(ВЫБОР
	               |				КОГДА ТИПЗНАЧЕНИЯ(Контрагенты.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ЮридическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	               |									И ЮридическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты)
	               |								ТОГДА ЮридическиеЛицаКонтактнаяИнформация.Представление
	               |							ИНАЧЕ """"
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	               |								И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица)
	               |							ТОГДА ФизическиеЛицаКонтактнаяИнформация.Представление
	               |						ИНАЧЕ """"
	               |					КОНЕЦ
	               |			КОНЕЦ, 1, 1000)) КАК ЮрАдрес,
	               |	МАКСИМУМ(ПОДСТРОКА(ВЫБОР
	               |				КОГДА ТИПЗНАЧЕНИЯ(Контрагенты.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ЮридическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |									И ЮридическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагенты)
	               |								ТОГДА ЮридическиеЛицаКонтактнаяИнформация.Представление
	               |							ИНАЧЕ """"
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |								И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица)
	               |							ТОГДА ФизическиеЛицаКонтактнаяИнформация.Представление
	               |						ИНАЧЕ """"
	               |					КОНЕЦ
	               |			КОНЕЦ, 1, 1000)) КАК Телефон
	               |ПОМЕСТИТЬ ДанныеКонтрагентов
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица.КонтактнаяИнформация КАК ЮридическиеЛицаКонтактнаяИнформация
	               |		ПО Контрагенты.ЮридическоеФизическоеЛицо = ЮридическиеЛицаКонтактнаяИнформация.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	               |		ПО Контрагенты.ЮридическоеФизическоеЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	               |ГДЕ
	               |	Контрагенты.Ссылка В
	               |			(ВЫБРАТЬ
	               |				контрагенты.Контрагент
	               |			ИЗ
	               |				контрагенты КАК контрагенты)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Контрагенты.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АктПриемкиМ7.Ссылка,
	               |	АктПриемкиМ7.Номер КАК Номер,
	               |	АктПриемкиМ7.Дата КАК Дата,
	               |	АктПриемкиМ7.Организация,
	               |	АктПриемкиМ7.Организация.НаименованиеПолное КАК НаименованиеОрганизация,
	               |	АктПриемкиМ7.Организация.КодОКПО КАК КодОКПО,
	               |	АктПриемкиМ7.МестоСоставления,
	               |	АктПриемкиМ7.НомерСертификатаКачества,
	               |	АктПриемкиМ7.Станция,
	               |	АктПриемкиМ7.НомерСопроводительногоТД,
	               |	АктПриемкиМ7.ДатаСопроводительногоТД,
	               |	АктПриемкиМ7.НомераВагонов,
	               |	АктПриемкиМ7.Контрагент,
	               |	АктПриемкиМ7.Договор,
	               |	АктПриемкиМ7.Грузоотправитель,
	               |	АктПриемкиМ7.Грузополучатель,
	               |	АктПриемкиМ7.СтраховаяКомпания,
	               |	АктПриемкиМ7.Договор.НомерДоговора КАК НомерДоговора,
	               |	АктПриемкиМ7.Договор.ДатаДоговора КАК ДатаДоговора,
	               |	АктПриемкиМ7.УсловияХранения,
	               |	АктПриемкиМ7.СостояниеТары,
	               |	АктПриемкиМ7.МетодОпределенияНедостачи,
	               |	АктПриемкиМ7.ДругиеДанные,
	               |	АктПриемкиМ7.ЦМО,
	               |	АктПриемкиМ7.ЦМО.Сотрудник КАК МОЛ,
	               |	АктПриемкиМ7.Подразделение.Представление КАК ПодразделениеПредставление,
	               |	АктПриемкиМ7.Контрагент.Код КАК КодПоставщика,
	               |	АктПриемкиМ7.ЗаключениеКомиссии,
	               |	АктПриемкиМ7.ДатаОприходования,
	               |	АктПриемкиМ7.НомерКоммерческогоАкта,
	               |	АктПриемкиМ7.ДатаКоммерческогоАкта,
	               |	АктПриемкиМ7.СоставКонтейнеров.(
	               |		ОтметкаОпломбирования,
	               |		КоличествоМест,
	               |		ВидУпаковки,
	               |		НомераКонтейнеров,
	               |		ЕдиницаИзмерения,
	               |		МассаГрузаОтправитель,
	               |		МассаГрузаДороги,
	               |		ОсобыеОтметки
	               |	),
	               |	АктПриемкиМ7.СоставКомиссии.(
	               |		ДолжностьЧленаКомиссии,
	               |		ФамилияЧленаКомиссии,
	               |		ИмяЧленаКомиссии,
	               |		ОтчествоЧленаКомиссии
	               |	),
	               |	АктПриемкиМ7.СоставПриложения.(
	               |		ВидПриложения,
	               |		НомерДокумента,
	               |		ДатаДокумента
	               |	),
	               |	АктПриемкиМ7.Материалы.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Номенклатура,
	               |		ЕдиницаИзмерения,
	               |		КоличествоПоДокументам,
	               |		ЦенаПоДокументам,
	               |		СуммаПоДокументам,
	               |		Количество,
	               |		Цена,
	               |		Сумма,
	               |		КоличествоБой,
	               |		КоличествоНедостачи,
	               |		КоличествоИзлишки,
	               |		НомерПаспорта,
	               |		ВЫБОР
	               |			КОГДА АктПриемкиМ7.Материалы.Номенклатура.НоменклатурныйНомер = """"
	               |				ТОГДА АктПриемкиМ7.Материалы.Номенклатура.Код
	               |			ИНАЧЕ АктПриемкиМ7.Материалы.Номенклатура.НоменклатурныйНомер
	               |		КОНЕЦ КАК НоменклатурныйНомер,
	               |		ЕдиницаИзмерения.Код КАК КодЕдиницы,
	               |		ЕдиницаИзмерения.Представление КАК НаименованиеЕдиницы
	               |	),
	               |	АктПриемкиМ7.ОсновныеСредства.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		ОсновноеСредство,
	               |		ЕдиницаИзмерения,
	               |		КоличествоПоДокументам,
	               |		ЦенаПоДокументам,
	               |		СуммаПоДокументам,
	               |		Количество,
	               |		Цена,
	               |		Сумма,
	               |		КоличествоБой,
	               |		КоличествоНедостачи,
	               |		КоличествоИзлишки,
	               |		НомерПаспорта,
	               |		АктПриемкиМ7.ОсновныеСредства.ОсновноеСредство.Код КАК НоменклатурныйНомер,
	               |		ЕдиницаИзмерения.Код КАК КодЕдиницы,
	               |		ЕдиницаИзмерения.Представление КАК НаименованиеЕдиницы
	               |	),
	               |	ДанныеКонтрагентов.ПолноеНаименование + "", адрес: "" + ДанныеКонтрагентов.ФактАдрес + "", тел.: "" + ДанныеКонтрагентов.Телефон КАК НаименованиеГрузоотправитель,
	               |	ДанныеКонтрагентов2.ПолноеНаименование + "", адрес: "" + ДанныеКонтрагентов2.ЮрАдрес + "", тел.: "" + ДанныеКонтрагентов2.Телефон КАК НаименованиеКонтрагент,
	               |	ДанныеКонтрагентов1.ПолноеНаименование + "", адрес: "" + ДанныеКонтрагентов1.ФактАдрес + "", тел.: "" + ДанныеКонтрагентов1.Телефон КАК НаименованиеГрузополучатель,
	               |	ДанныеКонтрагентов3.ПолноеНаименование + "", адрес: "" + ДанныеКонтрагентов3.ЮрАдрес + "", тел.: "" + ДанныеКонтрагентов3.Телефон КАК НаименованиеСтраховаяКомпания,
	               |	АктПриемкиМ7.ЦМО.МестоХранения КАК СкладПредставление
	               |ИЗ
	               |	Документ.АктПриемкиМ7 КАК АктПриемкиМ7
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКонтрагентов КАК ДанныеКонтрагентов
	               |		ПО АктПриемкиМ7.Грузоотправитель = ДанныеКонтрагентов.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКонтрагентов КАК ДанныеКонтрагентов2
	               |		ПО АктПриемкиМ7.Контрагент = ДанныеКонтрагентов2.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКонтрагентов КАК ДанныеКонтрагентов1
	               |		ПО АктПриемкиМ7.Грузополучатель = ДанныеКонтрагентов1.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеКонтрагентов КАК ДанныеКонтрагентов3
	               |		ПО АктПриемкиМ7.СтраховаяКомпания = ДанныеКонтрагентов3.Ссылка
	               |ГДЕ
	               |	АктПриемкиМ7.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	Номер";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);				   
					   
	Выборка = Запрос.Выполнить().Выбрать();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АктПриемкиМ7.ПФ_MXL_АктПриемкиМ7");
	ОбластьМакетаЗаголовок     = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакетаШапка1        = Макет.ПолучитьОбласть("Шапка1");
	ОбластьМакетаСтрока1       = Макет.ПолучитьОбласть("Строка1");
	ОбластьМакетаСтрока1Пустая = Макет.ПолучитьОбласть("Строка1Пустая");
	ОбластьМакетаКонцевик1     = Макет.ПолучитьОбласть("Концевик1");
	ОбластьМакетаТаблица1      = Макет.ПолучитьОбласть("Таблица1");
	ОбластьМакетаСтраница2     = Макет.ПолучитьОбласть("Страница2");
	ОбластьМакетаСтраница2_1   = Макет.ПолучитьОбласть("Страница2");
	ОбластьМакетаСтраница2_1_1 = Макет.ПолучитьОбласть("Страница2_1_1");
	ОбластьМакетаСтраница2_1_2 = Макет.ПолучитьОбласть("Страница2_1_2");
	ОбластьМакетаСтраница2_1_3 = Макет.ПолучитьОбласть("Страница2_1_3");
	ОбластьМакетаСтраница2_2   = Макет.ПолучитьОбласть("Страница2_2");
	ОбластьМакетаСтраница2_2_1 = Макет.ПолучитьОбласть("Страница2_2_1");
	ОбластьМакетаСтраница2_2_2 = Макет.ПолучитьОбласть("Страница2_2_2");
	ОбластьМакетаСтраница2_3   = Макет.ПолучитьОбласть("Страница2_3");
	ОбластьМакетаСтраница2_4   = Макет.ПолучитьОбласть("Страница2_4");
	ОбластьМакетаСтраница2_4_1 = Макет.ПолучитьОбласть("Страница2_4_1");
	ОбластьМакетаСтраница2_4_2 = Макет.ПолучитьОбласть("Страница2_4_2");
	ОбластьМакетаТаблица2      = Макет.ПолучитьОбласть("Таблица2");
	ОбластьМакетаШапка2        = Макет.ПолучитьОбласть("Шапка2");
	ОбластьМакетаСтрока2       = Макет.ПолучитьОбласть("Строка2");
	ОбластьМакетаСтрока2Пустая = Макет.ПолучитьОбласть("Строка2Пустая");
	ОбластьМакетаКонцевик      = Макет.ПолучитьОбласть("Концевик");
	ОбластьМакетаСтраница4     = Макет.ПолучитьОбласть("Страница4");
	ОбластьМакетаКомиссия      = Макет.ПолучитьОбласть("Комиссия");
	ОбластьМакетаСтраница41    = Макет.ПолучитьОбласть("Страница41");
	
	ТабДокумент1.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент1.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент2 = Новый ТабличныйДокумент;
			ТабДокумент3 = Новый ТабличныйДокумент;
			ТабДокумент4 = Новый ТабличныйДокумент;
			
			ТабДокумент2.ИмяПараметровПечати = "Шапка_АктПриемкиМ7";
			ТабДокумент3.ИмяПараметровПечати = "Таблица_АктПриемкиМ7";
			ТабДокумент4.ИмяПараметровПечати = "Шапка_АктПриемкиМ7";
			//ТабДокумент2.ВывестиГоризонтальныйРазделительСтраниц();
			//ТабДокумент3.ВывестиГоризонтальныйРазделительСтраниц();
			//ТабДокумент4.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
    	НомерСтрокиНачало1 = ТабДокумент1.ВысотаТаблицы + 1;
		//НомерСтрокиНачало2 = ТабДокумент2.ВысотаТаблицы + 1;
		//НомерСтрокиНачало3 = ТабДокумент3.ВысотаТаблицы + 1;
		//НомерСтрокиНачало4 = ТабДокумент4.ВысотаТаблицы + 1;
	
		
		ТабДокумент2.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДокумент3.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДокумент4.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
		// вывод первой страницы документа
		ОбластьМакетаЗаголовок.Параметры.Заполнить(Выборка);
		ОтветственныеЛица = Справочники.Организации.ПолучитьОтветственныхЛицОрганизации(Выборка.Организация, Выборка.Дата);
		СтрРуководитель = ОтветственныеЛица.Найти(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель,
												  "ИсполняемаяФункцияСсылка");
		СтруктураЗаголовок = Новый Структура;										  
		Если СтрРуководитель <> Неопределено Тогда
			СтруктураЗаголовок.Вставить("ФИОРуководитель",Справочники.Сотрудники.ФамилияИО(СтрРуководитель.ОтветственноеЛицоСсылка, Истина, Выборка.Дата));
			СтруктураЗаголовок.Вставить("ДолжностьРуководитель",СтрРуководитель.ДолжностьПредставление);
		КонецЕсли;
		СтруктураЗаголовок.Вставить("Номер",ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(Выборка.Ссылка,Выборка.Номер));
		ОбластьМакетаЗаголовок.Параметры.Заполнить(СтруктураЗаголовок);
		
		ТабДокумент1.Вывести(ОбластьМакетаЗаголовок);
		ТабДокумент1.Вывести(ОбластьМакетаШапка1);
		
		ВыборкаСоставКонтейнеров = Выборка.СоставКонтейнеров.Выбрать();
		к = 0;
		Пока ВыборкаСоставКонтейнеров.Следующий() Цикл
			ОбластьМакетаСтрока1.Параметры.Заполнить(ВыборкаСоставКонтейнеров);
			ТабДокумент1.Вывести(ОбластьМакетаСтрока1);
			к = к + 1;
		КонецЦикла;	
		Для п = к + 1 по 9 Цикл
			ТабДокумент1.Вывести(ОбластьМакетаСтрока1Пустая);
		КонецЦикла;	
		ТабДокумент1.Вывести(ОбластьМакетаКонцевик1);
		ТабДокумент1.Вывести(ОбластьМакетаТаблица1);
		
		// вывод второй страницы документа
		Если ПустаяСтрока(Выборка.УсловияХранения)
			И ПустаяСтрока(Выборка.СостояниеТары)
			И ПустаяСтрока(Выборка.ДругиеДанные) Тогда
			ОбластьМакетаСтраница2.Параметры.Заполнить(Выборка);
			ТабДокумент2.Вывести(ОбластьМакетаСтраница2);
		Иначе
			Если ПустаяСтрока(Выборка.УсловияХранения) Тогда
				ТабДокумент2.Вывести(ОбластьМакетаСтраница2_1);
			Иначе
				ОбластьМакетаСтраница2_1_2.Параметры.Заполнить(Выборка);
				ТабДокумент2.Вывести(ОбластьМакетаСтраница2_1_1);
				ТабДокумент2.Вывести(ОбластьМакетаСтраница2_1_2);
				ТабДокумент2.Вывести(ОбластьМакетаСтраница2_1_3);	
			КонецЕсли;
			
			Если ПустаяСтрока(Выборка.СостояниеТары) Тогда
				ТабДокумент2.Вывести(ОбластьМакетаСтраница2_2);
			Иначе
				ОбластьМакетаСтраница2_2_2.Параметры.Заполнить(Выборка);
				ТабДокумент2.Вывести(ОбластьМакетаСтраница2_2_1);
				ТабДокумент2.Вывести(ОбластьМакетаСтраница2_2_2);
				ТабДокумент2.Вывести(ОбластьМакетаСтраница2_1_3);	
			КонецЕсли;
			
			ОбластьМакетаСтраница2_3.Параметры.Заполнить(Выборка);
			ТабДокумент2.Вывести(ОбластьМакетаСтраница2_3);
			
			Если ПустаяСтрока(Выборка.ДругиеДанные) Тогда
				ТабДокумент2.Вывести(ОбластьМакетаСтраница2_4);
			Иначе
				ОбластьМакетаСтраница2_4_2.Параметры.Заполнить(Выборка);
				ТабДокумент2.Вывести(ОбластьМакетаСтраница2_4_1);
				ТабДокумент2.Вывести(ОбластьМакетаСтраница2_4_2);
				ТабДокумент2.Вывести(ОбластьМакетаСтраница2_1_3);	
			КонецЕсли;
		КонецЕсли;
		
		// вывод третьей страницы документа
		
		ОбластьМакетаТаблица2.Параметры.Заполнить(Выборка);
		ТабДокумент3.Вывести(ОбластьМакетаТаблица2);
		ТабДокумент3.Вывести(ОбластьМакетаШапка2);
		
		ВыборкаСоставМЦ = Выборка.Материалы.Выбрать();
		к = 0;
		Пока ВыборкаСоставМЦ.Следующий() Цикл
			ОбластьМакетаСтрока2.Параметры.Заполнить(ВыборкаСоставМЦ);
			СтруктураОбластьМакетаСтрока2 = Новый Структура("СуммаБой,СуммаНедостачи,СуммаИзлишки",ВыборкаСоставМЦ.КоличествоБой * ВыборкаСоставМЦ.Цена,ВыборкаСоставМЦ.КоличествоНедостачи * ВыборкаСоставМЦ.Цена,ВыборкаСоставМЦ.КоличествоИзлишки * ВыборкаСоставМЦ.Цена);
			ОбластьМакетаСтрока2.Параметры.Заполнить(СтруктураОбластьМакетаСтрока2);
			
			ТабДокумент3.Вывести(ОбластьМакетаСтрока2);
			к = к + 1;
		КонецЦикла;	
		ВыборкаСоставМЦ = Выборка.ОсновныеСредства.Выбрать();
		Пока ВыборкаСоставМЦ.Следующий() Цикл
			ОбластьМакетаСтрока2.Параметры.Заполнить(ВыборкаСоставМЦ);
			СтруктураОбластьМакетаСтрока2 = Новый Структура("Номенклатура",ВыборкаСоставМЦ.ОсновноеСредство);
			СтруктураОбластьМакетаСтрока2.Вставить("СуммаБой",ВыборкаСоставМЦ.КоличествоБой * ВыборкаСоставМЦ.Цена);
			СтруктураОбластьМакетаСтрока2.Вставить("СуммаНедостачи",ВыборкаСоставМЦ.КоличествоНедостачи * ВыборкаСоставМЦ.Цена);
			СтруктураОбластьМакетаСтрока2.Вставить("СуммаИзлишки",ВыборкаСоставМЦ.КоличествоИзлишки * ВыборкаСоставМЦ.Цена);
			
			ОбластьМакетаСтрока2.Параметры.Заполнить(СтруктураОбластьМакетаСтрока2);
			
			ТабДокумент3.Вывести(ОбластьМакетаСтрока2);
			к = к + 1;
		КонецЦикла;	
		Для п = к + 1 по 19 Цикл
			ТабДокумент3.Вывести(ОбластьМакетаСтрока2Пустая);
		КонецЦикла;	
		ТабДокумент3.Вывести(ОбластьМакетаКонцевик);
		
		// вывод четвертой страницы документа
		
		ПереченьДокументов = "";
		ВыборкаСоставПриложения = Выборка.СоставПриложения.Выбрать();
		Пока ВыборкаСоставПриложения.Следующий() Цикл
			ПереченьДокументов = ПереченьДокументов 
							   + ВыборкаСоставПриложения.ВидПриложения + " № " 
							   + ВыборкаСоставПриложения.НомерДокумента + " от " 
							   + Формат(ВыборкаСоставПриложения.ДатаДокумента, "ДФ=dd.MM.yyyy") + ", ";
		КонецЦикла;	
		
		ОбластьМакетаСтраница4.Параметры.Заполнить(Выборка);
		ОбластьМакетаСтраница4.Параметры.Заполнить(Новый Структура("ПереченьДокументов", ПереченьДокументов));
		ТабДокумент4.Вывести(ОбластьМакетаСтраница4);
		
		ВыборкаКомиссии = Выборка.СоставКомиссии.Выбрать();
		Пока ВыборкаКомиссии.Следующий() Цикл
			ОбластьМакетаКомиссия.Параметры.Заполнить(ВыборкаКомиссии);
			СтруктураФИО = Новый Структура("Фамилия,Имя,Отчество", ВыборкаКомиссии.ФамилияЧленаКомиссии, ВыборкаКомиссии.ИмяЧленаКомиссии, ВыборкаКомиссии.ОтчествоЧленаКомиссии);
			ОбластьМакетаКомиссия.Параметры.Заполнить(Новый Структура("ФИОЧленаКомиссии", КорреспондентыКлиентСервер.ФИО(СтруктураФИО, Истина)));
			ТабДокумент4.Вывести(ОбластьМакетаКомиссия);
		КонецЦикла;	
		
		ОбластьМакетаСтраница41.Параметры.Заполнить(Выборка);
		Если ЗначениеЗаполнено(Выборка.МОЛ) Тогда
			ОбластьМакетаСтраница41.Параметры.Заполнить(Новый Структура("ФИОМОЛ", Корреспонденты.ФИОПоОбъекту(Выборка.МОЛ, Истина)));
		КонецЕсли;	
		ТабДокумент4.Вывести(ОбластьМакетаСтраница41);
		
		ТабДокумент1.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокумент1.Вывести(ТабДокумент2);
		ТабДокумент1.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокумент1.Вывести(ТабДокумент3);
		ТабДокумент1.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДокумент1.Вывести(ТабДокумент4);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент1, 
		                                               НомерСтрокиНачало1, ОбъектыПечати, Выборка.Ссылка);
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент2, 
		//											   НомерСтрокиНачало2, ОбъектыПечати, Выборка.Ссылка);
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент3, 
		//											   НомерСтрокиНачало3, ОбъектыПечати, Выборка.Ссылка);
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент4, 
		//											   НомерСтрокиНачало4, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
	
	ПерваяТаблица 		= ТабДокумент1;
	ВтораяТаблица 		= ТабДокумент2;
	ТретьяТаблица 		= ТабДокумент3;
	ЧетвертаяТаблица 	= ТабДокумент4;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
