
#Область ОписаниеПеременных
	
// Используется при изменении ЦМО, для проверки необходимости очистки таблицы
&НаКлиенте
Перем ЦМООтправительДоИзменения; // СправочникСсылка.ЦМО

// Используется при изменении КФО, для проверки необходимости очистки таблицы
&НаКлиенте
Перем КФОДоИзменения; // ПеречислениеСсылка.КВД

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеСпискаМатериалов(ЭтотОбъект, , Истина, Истина);
	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеКолонкиСуммаСписанияНУ(ЭтотОбъект);
	ПрослеживаемостьФормыБГУ.УстановитьУсловноеОформление(ЭтотОбъект);
	УправлениеМатериальнымиЗапасамиФормы.ДокументПриСозданииНаСервере(ЭтотОбъект);
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(Элементы, Объект,
		"МатериалыПодбор, ДекорацияВыбратьКомиссию");
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.УстановитьДоступностьРедактированияСтрокВДокументахНФА(ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		УстановитьРуководителя(Объект.Организация, Объект.ПодразделениеОтправитель, Объект.Дата, Объект.Руководитель);
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	ПервичныеДокументыБГУ.ПриСозданииНаСервере(ЭтотОбъект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Тогда
		ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.НомераГТД.Форма.ФормаПодбораРНПТ" Тогда
		ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ДоступностьСвязанныхЭлементов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	Оповестить("ДокументыПоУчетуМатериальныхЗапасовИзменение");

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ПодготовитьФормуНаСервере();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтотОбъект.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);	

КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперации()
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере()
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		
		УстановитьРуководителя(Объект.Организация, Объект.ПодразделениеОтправитель, Объект.Дата, Объект.Руководитель);
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		ОбновитьДанныеСчетовВФорме();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ДоступностьСвязанныхЭлементов();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	ОбновитьДанныеСчетовВФорме();
	УстановитьРуководителя(Объект.Организация, Объект.ПодразделениеОтправитель, Объект.Дата, Объект.Руководитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОтправительПриИзменении(Элемент)
	УстановитьРуководителя(Объект.Организация, Объект.ПодразделениеОтправитель, Объект.Дата, Объект.Руководитель);
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДействиеПриИзменении = Новый ОписаниеОповещения("ПриИзмененииСчетаУчета", ЭтотОбъект);
	УправлениеМатериальнымиЗапасамиКлиент.НачатьОбработкуВыбораСчетаУчета(ВыбранноеЗначение, СтандартнаяОбработка, ЭтотОбъект, ДействиеПриИзменении);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСчетаУчета(Результат, Параметры) Экспорт
	ПриИзмененииСчетаУчетаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВыбратьКомиссиюНажатие(Элемент)
	
	ИменаРеквизитов = ОбщегоНазначенияБГУКлиент.СтруктураИменРеквизитовВыбораПредседателяКомиссии(
		"ДолжностьПредседательКомиссии", "ФамилияПредседательКомиссии", "ИмяПредседательКомиссии",
		"ОтчествоПредседательКомиссии");
	ОбщегоНазначенияБГУКлиент.НачатьВыборПостоянноДействующейКомиссии(ЭтотОбъект, ИменаРеквизитов, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьВЛичноеПользованиеПриИзменении(Элемент)
	ВыдатьВЛичноеПользованиеПриИзмененииСервер();
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
КонецПроцедуры

&НаКлиенте
Процедура ЦМООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЦМООтправительДоИзменения = Объект.ЦМООтправитель;
КонецПроцедуры

&НаКлиенте
Процедура ЦМОПриИзменении(Элемент)
	ПараметрыИзмененияЦМО = УправлениеНФАКлиент.ПараметрыИзмененияРеквизитаСОчисткойТЧ();
	ПараметрыИзмененияЦМО.ЗначениеДоИзменения = ЦМООтправительДоИзменения;
	ПараметрыИзмененияЦМО.ИмяРеквизита = "ЦМООтправитель";
	ПараметрыИзмененияЦМО.СинонимРеквизита = НСтр("ru = 'МОЛ/Место хранения'");
	ПараметрыИзмененияЦМО.ИменаТабличныхЧастей = "Материалы, СведенияПрослеживаемости";
	
	УправлениеНФАКлиент.ПриИзмененииРеквизитаСОчисткойТЧ(Объект, ПараметрыИзмененияЦМО);
КонецПроцедуры

&НаКлиенте
Процедура КФООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	КФОДоИзменения = Объект.КФО;
КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзменении(Элемент) 
	
	ПараметрыИзмененияКФО = УправлениеНФАКлиент.ПараметрыИзмененияРеквизитаСОчисткойТЧ();
	ПараметрыИзмененияКФО.ЗначениеДоИзменения = КФОДоИзменения;
	ПараметрыИзмененияКФО.ИмяРеквизита = "КФО";
	ПараметрыИзмененияКФО.СинонимРеквизита = НСтр("ru = 'КФО'");
	ПараметрыИзмененияКФО.ИменаТабличныхЧастей = "Материалы, СведенияПрослеживаемости";
	
	УправлениеНФАКлиент.ПриИзмененииРеквизитаСОчисткойТЧ(Объект, ПараметрыИзмененияКФО);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтражатьВПрослеживаемостиПриИзменении(Элемент)
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПереключательРезервированиеПриИзменении(Элемент)
	УправлениеМатериальнымиЗапасамиФормыКлиент.ПриИзмененииПереключателяРезервирования(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура АннулированПриИзменении(Элемент)
	РезервированиеНФАКлиент.ПриИзмененииФлажкаАннулирован(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйДокументПриИзменении(Элемент)
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КФОВТабличнойЧастиПриИзменении(Элемент)

	ПараметрыОбработкиИзменения = Новый Структура;
	ПараметрыОбработкиИзменения.Вставить("Форма", ЭтотОбъект);
	ПараметрыОбработкиИзменения.Вставить("ОбработчикЗаполненияКФО", Новый ОписаниеОповещения("ЗаполнитьКФОВТабличнойЧасти", ЭтотОбъект));
	ПараметрыОбработкиИзменения.Вставить("ОбработчикПроверкиКФО", Новый ОписаниеОповещения("ПолучитьЗначенияКФОВТабличнойЧасти", ЭтотОбъект));

	УправлениеМатериальнымиЗапасамиКлиент.ПриИзмененииНастройкиИспользованияКФО(ПараметрыОбработкиИзменения);
	
	УстановитьДоступностьКФО(ЭтотОбъект);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекНомерСтроки = ТекущиеДанные.НомерСтроки;
		Если ТекНомерСтроки >1 Тогда
			ТекущиеДанные.ПричинаСписания = Объект.Материалы[ТекНомерСтроки-2].ПричинаСписания;
		КонецЕсли;
		
	КонецЕсли;
	Если НоваяСтрока Тогда
		ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	Если Копирование И ЗначениеЗаполнено(ТекущиеДанные.ВариантКомплектаПТ) Тогда
		ТекущиеДанные.ВариантКомплектаПТ = ПредопределенноеЗначение("Справочник.ВариантыКомплектовМЗПТ.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.НаправленияРасходаМПЗ") Тогда
		МассивСтрок = Элементы.Материалы.ВыделенныеСтроки;
		Для Каждого ЭлМас Из МассивСтрок Цикл
			ТекСтр = Объект.Материалы.НайтиПоИдентификатору(ЭлМас);
			Если ТекСтр <> Неопределено Тогда
				ТекСтр.ПричинаСписания = ВыбранноеЗначение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Материалы.ТекущиеДанные;
	ТекДанные.КоличествоНорма = ТекДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПричинаСписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.НаправленияРасходаМПЗ.Форма.ФормаВыбора",,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.АвтоПодборСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,, Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОкончаниеВводаТекстаСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыВидимыеДефектыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗаголовокФормыВвода = НСтр("ru = 'Видимые особенности объекта - Дефекты'");
	НачатьВводДлинногоТекста("ВидимыеДефекты", ЗаголовокФормыВвода);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыОсобыеОтметкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗаголовокФормыВвода = НСтр("ru = 'Видимые особенности объекта - Особые отметки'");
	НачатьВводДлинногоТекста("ОсобыеОтметки", ЗаголовокФормыВвода);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПрослеживаемостьФормыБГУКлиент.МатериалыВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка, Ложь, "Материалы");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	Если ВедетсяУчетПрослеживаемыхТоваров Тогда
		ПодключитьОбработчикОжидания("Подключаемый_УправлениеПрослеживаемостью", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Если ОбщегоНазначенияБГУКлиентСервер.ЗапрещеноДобавлениеСтрокВДокументыНФА(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыРНПТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПрослеживаемостьФормыБГУКлиент.ОткрытьФормуПодбораРНПТ(ЭтотОбъект, "Материалы");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыРНПТОчистка(Элемент, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если СтрокаТабличнойЧасти.ПрослеживаемыйТовар Тогда
		УдалитьСтрокиРНПТ(СтрокаТабличнойЧасти.ИдентификаторСтроки);
	Иначе
		СтрокаТабличнойЧасти.НомерГТД = Неопределено;
	КонецЕсли;
	
	ПрослеживаемостьФормыБГУКлиентСервер.ОчиститьПредставлениеРНПТ(ЭтотОбъект, СтрокаТабличнойЧасти);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ОбработатьПодборКомиссии(ЭтотОбъект, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	ПараметрыПодбора = УправлениеМатериальнымиЗапасамиФормыКлиент.ПараметрыОткрытияПодбора();
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить(НСтр("ru = 'Организация'"));
	Если Не СчетУчета27(ЭтотОбъект) Тогда
		ПроверяемыеРеквизиты.Добавить(НСтр("ru = 'ЦМООтправитель, МОЛ/Место хранения'"));
	КонецЕсли;
	ПроверяемыеРеквизиты.Добавить(НСтр("ru = 'СчетУчета, Счет учета'"));
	Если Не Объект.КФОВТабличнойЧасти Тогда
		ПроверяемыеРеквизиты.Добавить(НСтр("ru = 'КФО'"));
	КонецЕсли;
	ПараметрыПодбора.ПроверяемыеРеквизиты = СтрСоединить(ПроверяемыеРеквизиты, ";");
	ПараметрыПодбора.ПараметрыОтбора = ДополнитьСтруктуруПодбора();
	Если Объект.Материалы.Количество() Тогда
		ПоместитьМатериалыВХранилищеНаСервере(ПараметрыПодбора);
	КонецЕсли;
	УправлениеМатериальнымиЗапасамиФормыКлиент.ОткрытьПодборМатериалов(ЭтотОбъект, Объект, ПараметрыПодбора);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНормуСотрудника(Команда)
	УправлениеНФАКлиент.ОткрытьОбеспечениеСотрудникаИмуществом(Объект.ПолучательИмущества);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаправлениеРасхода(Команда)
	ОткрытьФорму("Справочник.НаправленияРасходаМПЗ.Форма.ФормаВыбора",,Элементы.Материалы);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьКПСНоменклатура(Команда)
	ЗаполнитьКПСнаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	
	ИменаРеквизитов = ОбщегоНазначенияБГУКлиент.СтруктураИменРеквизитовВыбораПредседателяКомиссии(
		"ДолжностьПредседательКомиссии", "ФамилияПредседательКомиссии", "ИмяПредседательКомиссии",
		"ОтчествоПредседательКомиссии");
		
	ОбщегоНазначенияБГУКлиент.НачатьВыборПредседателяКомиссии(ЭтотОбъект, ИменаРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	ОбщегоНазначенияБГУКлиент.ОткрытьПодборКомиссии(Элементы.СоставКомиссии, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидимостьРеквизитовКомиссии(Форма)
	Возврат Не ПервичныеДокументыБГУКлиентСервер.ВыбранУказанныйПервичныйДокумент(
		Форма.Объект.ПервичныйДокумент, "Акт0510434");
КонецФункции

// Обработчик выбора строки постоянно действующией комиссии. см.ОбщегоНазначенияБГУКлиент.НачатьВыборПостоянноДействующейКомиссии.
// "Объект" передается явно, без этого данные объекта не заполняются в web-клиенте.
&НаКлиенте
Процедура УстановитьКомиссиюВДокумент(Результат, ДопПараметры) Экспорт
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Результат, ДопПараметры, Объект)	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводДлинногоТекста(ИмяПоля, ЗаголовокФормыВвода)

	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ИмяПоля", ИмяПоля);
	ОбработчикИзменения = Новый ОписаниеОповещения("ЗавершитьВводДлинногоТекста", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(ОбработчикИзменения, ТекущиеДанные[ИмяПоля], ЗаголовокФормыВвода); 

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводДлинногоТекста(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = ДополнительныеПараметры.ИмяПоля; 
	ТекущиеДанные[ИмяПоля] = Результат;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	// Выдача в личное пользование
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыдатьВЛичноеПользование",
		"Видимость", СчетУчета105(Форма));
	ЭлементыПередачиИмущества = Новый Массив;
	ЭлементыПередачиИмущества.Добавить("ПолучательИмущества");
	ЭлементыПередачиИмущества.Добавить("ОткрытьНормуСотрудника");
	ЭлементыПередачиИмущества.Добавить("МатериалыВидимыеДефекты");
	ЭлементыПередачиИмущества.Добавить("МатериалыОсобыеОтметки");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыПередачиИмущества,
		"Видимость", Объект.ВыдатьВЛичноеПользование);

	// Кроме выдачи в личное пользование
	ЭлементыНеВыдачиВЛичноеПользование = Новый Массив;
	ЭлементыНеВыдачиВЛичноеПользование.Добавить("ГруппаКомиссия");
	ЭлементыНеВыдачиВЛичноеПользование.Добавить("ГруппаЗаключениеКомиссии");
	ЭлементыНеВыдачиВЛичноеПользование.Добавить("ДокументОснование");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыНеВыдачиВЛичноеПользование,
		"Видимость", ВидимостьРеквизитовКомиссии(Форма));
		
	// Прослеживаемость
	ВидимостьЭлементовПрослеживаемости = Форма.ВедетсяУчетПрослеживаемыхТоваров И Форма.ЕстьПрослеживаемыеТовары;
	
	ИменаЭлементовПрослеживаемости = Новый Массив;
	ИменаЭлементовПрослеживаемости.Добавить("ОтражатьВПрослеживаемости");
	ИменаЭлементовПрослеживаемости.Добавить("МатериалыПрослеживаемыйТовар");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовПрослеживаемости,
		"Видимость", ВидимостьЭлементовПрослеживаемости);
	
	ИменаЭлементовДвиженияПрослеживаемости = Новый Массив;
	ИменаЭлементовДвиженияПрослеживаемости.Добавить("МатериалыСтранаПроисхождения");
	ИменаЭлементовДвиженияПрослеживаемости.Добавить("МатериалыРНПТ");
	ИменаЭлементовДвиженияПрослеживаемости.Добавить("КодОперацииПрослеживаемости");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовДвиженияПрослеживаемости,
		"Видимость", ВидимостьЭлементовПрослеживаемости И Объект.ОтражатьВПрослеживаемости);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "МатериалыКФО", "Видимость",
		Форма.Объект.КФОВТабличнойЧасти);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"МатериалыДополнительноеСубконтоСчета",
		"Видимость", Форма.ЕстьДополнительноеСубконто3 ИЛИ ЗначениеЗаполнено(Форма.ДополнительноеСубконто27ВидСубконто));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКФО(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"КФО", "Доступность", Не Форма.Объект.КФОВТабличнойЧасти);
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеСчетовВФорме()
	ЗаполнитьДанныеСчетовВФорме();
	Если Элементы.СчетУчета.СписокВыбора.НайтиПоЗначению(Объект.СчетУчета) = Неопределено Тогда
		Объект.СчетУчета = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСчетовВФорме()

	Элементы.СчетУчета.СписокВыбора.Очистить();

	УправлениеМатериальнымиЗапасами.ЗаполнитьСчетаУчетаМЗ105(ЭтотОбъект);
	ОтключитьВидимостьКолонкиДопСубконто();
	Счет10500 = БухгалтерскийУчет.СчетПоКоду("105.00", Объект.Дата, Объект.Организация);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет105", Счет10500);
	Элементы.СчетУчета.СписокВыбора.Добавить(Счет10500);
	
	Счета27 = ПолучитьСчета27();
	СчетУчетаИмуществаВПользовании = Новый Массив;
	Для Каждого ТекСчет27 Из Счета27 Цикл
		Элементы.СчетУчета.СписокВыбора.Добавить(ТекСчет27.Значение, ТекСчет27.Представление);
		СчетУчетаИмуществаВПользовании.Добавить(ТекСчет27.Значение);
	КонецЦикла;
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счета27", Новый ФиксированныйМассив(СчетУчетаИмуществаВПользовании));
	
	ВидыДопСубконто = УправлениеМатериальнымиЗапасамиПовтИсп.ПолучитьВидыДополнительногоСубконтоУчетаМЗ();
	Для Каждого НастройкаСчета Из ВидыДопСубконто Цикл
		СчетаДопСубконто3.Добавить(НастройкаСчета.Ключ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСчета27()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.Код КАК Код
	|ИЗ
	|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|		ПО ЕПСБУВидыСубконто.Ссылка = ЕПСБУ.Ссылка
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&Счета27)
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|	И ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код УБЫВ";
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаСчетов = Объект.Дата;
	Иначе
		ДатаСчетов = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	Счета27 = БухгалтерскийУчет.СписокСчетов("27", ДатаСчетов, , Объект.Организация);
	Запрос.УстановитьПараметр("Счета27", Счета27);
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка, Выборка.Код);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СчетУчета105(Форма)

	Возврат Форма.Объект.СчетУчета = Форма.КэшПараметров.Локальные.Счет105;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СчетУчета27(Форма)

	Возврат Форма.КэшПараметров.Локальные.Счета27.Найти(Форма.Объект.СчетУчета) <> Неопределено;

КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ВедетсяУчетПрослеживаемыхТоваров = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);
	РассчитатьПрослеживаемыеТовары();
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТВоВсехСтроках(ЭтотОбъект);
	ЗаполнитьДанныеСчетовВФорме();
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьВидимостьЭлементовЗагруженногоДокумента(ЭтотОбъект);
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеДинамическихКолонокТаблицыМатериалы(ЭтотОбъект, Объект);
	
	УправлениеМатериальнымиЗапасами.УстановитьВидДопСубконтоЛичногоПользования(
	ЭтотОбъект,
	Объект.ВыдатьВЛичноеПользование,
	?(ЭтотОбъект.КэшПараметров.Локальные.Счета27.Количество(), ЭтотОбъект.КэшПараметров.Локальные.Счета27[0], ПланыСчетов.ЕПСБУ.ПустаяСсылка()),
	"МатериалыДополнительноеСубконтоСчета",
	"Материалы");
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьПризнакФормыДополнительноеСубконто3(ЭтотОбъект);

	УстановитьВидимостьЭлементов(ЭтотОбъект);
	УправлениеМатериальнымиЗапасамиФормыКлиентСервер.УстановитьПереключательРезервирование(ЭтотОбъект);
	УстановитьДоступностьКФО(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВидимостьКолонкиДопСубконто()

	Если ВсеСчета105.НайтиПоЗначению(Объект.СчетУчета) = Неопределено Тогда
		УправлениеМатериальнымиЗапасами.ОтключитьВидимостьКолонкиДопСубконто(Элементы.МатериалыДополнительнаяАналитикаСчета, Объект.СчетУчета);
	Иначе
		УправлениеМатериальнымиЗапасами.ОтключитьВидимостьКолонкиДопСубконто(Элементы.МатериалыДополнительнаяАналитикаСчета, ВсеСчета105);
	КонецЕсли;

КонецПроцедуры // ОтключитьВидимостьКолонкиДопСубконто()

&НаКлиенте
Функция ДополнитьСтруктуруПодбора()
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("СчетУчета",				Объект.СчетУчета);
	ПараметрыПодбора.Вставить("КФО",					Объект.КФО);
	ПараметрыПодбора.Вставить("ЦМО", 					Объект.ЦМООтправитель);
	ПараметрыПодбора.Вставить("Подразделение",			Объект.ПодразделениеОтправитель);
	ПараметрыПодбора.Вставить("ПоказыватьОстатки",		Истина);
	ПараметрыПодбора.Вставить("ПоказыватьСчетУчета",	Истина);
	ТипыНоменклатуры = Новый СписокЗначений;
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МягкийИнвентарь"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Посуда"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ"));
	ПараметрыПодбора.Вставить("ТипыНоменклатуры",		ТипыНоменклатуры);
	ПараметрыПодбора.Вставить("ИмяТаблицы",				"Материалы");

	Если СчетУчета27(ЭтотОбъект) Тогда
		ПараметрыПодбора.Вставить("ПодборОстатковВПользовании", Истина);
		ПараметрыПодбора.Вставить("СчетОстатковВПользовании", Объект.СчетУчета);
	КонецЕсли;
	
	Если Объект.ВыдатьВЛичноеПользование Тогда
		ПараметрыПодбора.Вставить("ВладелецНормыВыдачи", Объект.ПолучательИмущества);
	КонецЕсли;
	
	ДополнительноеСубконтоСчета = УправлениеМатериальнымиЗапасамиКлиентСервер.ДополнительнаяАналитикаСчетаУчетаМатериалов(Объект.СчетУчета, Объект.Организация);
	Если ЗначениеЗаполнено(ДополнительноеСубконтоСчета) Тогда
		ПараметрыПодбора.Вставить("ВидСубконтоДополнительнойАналитикиСчета", ДополнительноеСубконтоСчета);
	КонецЕсли;
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаКлиенте
Процедура ДоступностьСвязанныхЭлементов()

	Элементы.ЦМООтправитель.Доступность				= ЗначениеЗаполнено(Объект.Организация);
	Элементы.ПодразделениеОтправитель.Доступность	= ЗначениеЗаполнено(Объект.Организация);

КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	
	ТаблицаПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	
	Если ТаблицаПодбора.Количество() Тогда
		ВтМатериалы = Объект.Материалы.Выгрузить();
		УправлениеМатериальнымиЗапасами.ЗаполнитьТаблицуИзПодбораМатериалов(ВтМатериалы, ТаблицаПодбора);
		
		Для Каждого СтрокаМатериалы Из ВтМатериалы Цикл
			Если СтрокаМатериалы.НоваяСтрока Тогда
				СтрокаМатериалы.КоличествоНорма = СтрокаМатериалы.Количество;
				ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, СтрокаМатериалы, Ложь, Истина);
				СтрокаМатериалы.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			Иначе
				СтрокаМатериалыОбъект = Объект.Материалы[СтрокаМатериалы.НомерСтрокиДокумента-1];
				КпересчетаНормы = ?(СтрокаМатериалыОбъект.Количество > 0, СтрокаМатериалыОбъект.КоличествоНорма / СтрокаМатериалыОбъект.Количество, 1);
				СтрокаМатериалы.КоличествоНорма = СтрокаМатериалы.Количество*КпересчетаНормы;
			КонецЕсли;
		КонецЦикла;
		
		Объект.Материалы.Загрузить(ВтМатериалы);
		
		РассчитатьПрослеживаемыеТовары();
		УстановитьВидимостьЭлементов(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДанныеСчетаВСтроке(Форма, Строка, ЗаполнятьСчет, ЭтоПодбор = Ложь)
	
	ПараметрыОбработки = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(Форма, Строка);
	ПараметрыОбработки.Вставить("ЗаполнятьСчет", ЗаполнятьСчет);
	ПараметрыОбработки.Вставить("ДтКт",          "Кт");
	
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеСчетаУчетаВСтроке(Строка, ПараметрыОбработки);
	
	Если Не ЭтоПодбор Тогда
		РеквизитыНоменклатуры = УправлениеМатериальнымиЗапасамиВызовСервера.ПолучитьСвойстваНоменклатуры(Строка.Номенклатура, Форма.Объект.Дата);
		ЗаполнитьЗначенияСвойств(Строка, РеквизитыНоменклатуры,
			"ПрослеживаемыйТовар, КомплектСПрослеживаемымиТоварами, СтранаПроисхождения");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.ДополнительноеСубконто27ВидСубконто) Тогда
		Строка.ДополнительноеСубконтоВидСубконто = Форма.ДополнительноеСубконто27ВидСубконто;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКПСнаСервере()

	УправлениеМатериальнымиЗапасами.ЗаполнитьКПСвТабличнойЧастиДокументаМЗ(Объект.Материалы, Объект);	

КонецПроцедуры // ЗаполнитьКПСнаСервере()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРуководителя(Знач Организация, Знач Подразделение, Знач Дата, Руководитель)

	НовыйРуководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации("Руководитель", Организация, Дата, Подразделение);
	
	Если ЗначениеЗаполнено(НовыйРуководитель.ОтветственноеЛицоСсылка) 
		И Руководитель <> НовыйРуководитель.ОтветственноеЛицоСсылка Тогда
		Руководитель = НовыйРуководитель.ОтветственноеЛицоСсылка;
		#Если НаКлиенте Тогда
		ПоказатьОповещениеПользователя(,,НСтр("ru = 'Установлено новое значение поля ""Руководитель"" на закладке ""Заключение комиссии""'"));
		#КонецЕсли
	КонецЕсли;

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура УдалитьСтрокиРНПТ(Знач ИдентификаторСтроки)
	СтрокиСРНПТ = Объект.СведенияПрослеживаемости.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	
	Для Каждого СтрокаСРНПТ Из СтрокиСРНПТ Цикл
		Объект.СведенияПрослеживаемости.Удалить(СтрокаСРНПТ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьРНПТВХранилище(Адрес, ДополнительныеПараметры) Экспорт
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ПоместитьРНПТВХранилищеНаСервере(Адрес, ДополнительныеПараметры.ИдентификаторСтроки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоместитьРНПТВХранилищеНаСервере(Адрес, ИдентификаторСтроки)

	ТаблицаРНПТ = Объект.СведенияПрослеживаемости.Выгрузить(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	ПоместитьВоВременноеХранилище(ТаблицаРНПТ, Адрес);

КонецПроцедуры

&НаСервере
Процедура ПоместитьМатериалыВХранилищеНаСервере(ПараметрыПодбора)
	
	ПараметрыПодбора.ПараметрыТчДокумента = Новый Структура("АдресТчВХранилище");
	КолонкиРеквизитов = УправлениеМатериальнымиЗапасами.КолонкиПодбораДляВыгрузкиТабличнойЧасти(ЭтотОбъект.ПолучитьРеквизиты("Объект.Материалы"));
	ТаблицаМатериалы = Объект.Материалы.Выгрузить(,КолонкиРеквизитов);
	ПараметрыПодбора.ПараметрыТчДокумента.АдресТчВХранилище = ПоместитьВоВременноеХранилище(ТаблицаМатериалы, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
		СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	Если ЗначениеЗаполнено(ВыбранноеЗначение.ВариантКомплектаПТ) Тогда
		СтрокаТабличнойЧасти.ВариантКомплектаПТ = ВыбранноеЗначение.ВариантКомплектаПТ;
	КонецЕсли;
	ОбработкаВыбораРНПТННаСервере(СтрокаТабличнойЧасти.ИдентификаторСтроки, ВыбранноеЗначение, СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораРНПТННаСервере(Знач ИдентификаторСтроки, Знач ВыбранноеЗначение, Знач ИдентификаторСтрокиВнутр)
	
	СтрокаТабличнойЧасти = Объект.Материалы.НайтиПоИдентификатору(ИдентификаторСтрокиВнутр);
	ПрослеживаемостьФормыБГУ.ОбработкаВыбораРНПТН(ЭтотОбъект, ИдентификаторСтроки, ВыбранноеЗначение);
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТ(ЭтотОбъект, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеПрослеживаемостью()

	РассчитатьПрослеживаемыеТовары();
	УстановитьВидимостьЭлементов(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура РассчитатьПрослеживаемыеТовары()

	ПрослеживаемыеТовары     = Объект.Материалы.НайтиСтроки(Новый Структура("ПрослеживаемыйТовар", Истина));
	ЕстьПрослеживаемыеТовары = ПрослеживаемыеТовары.Количество() > 0;

КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

 #КонецОбласти

#Область ОбработчикиИзмененияНастройкиКФО

&НаКлиенте
Процедура ЗаполнитьКФОВТабличнойЧасти(Результат, ДополнительныеПараметры) Экспорт
	ЗаполнитьКФОВТабличнойЧастиСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКФОВтабличнойЧастиСервер()
	УправлениеМатериальнымиЗапасами.ЗаполнитьЗначениеРеквизитаВТабличнойЧасти(
	Объект.Материалы,
	"КФО",
	Объект.КФО);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗначенияКФОВТабличнойЧасти(Результат, ДополнительныеПараметры) Экспорт
	УправлениеМатериальнымиЗапасамиКлиент.ЗаполнитьКФОШапкиПриИзмененииНастройкиИспользования(ЭтотОбъект, ЗначенияКФОВТабличнойЧасти());
КонецПроцедуры

&НаСервере
Функция ЗначенияКФОВТабличнойЧасти();
	Возврат УправлениеМатериальнымиЗапасами.МассивРазличныхЗначенийКФОВТабличнойЧасти(Объект.Материалы, "КФО");
КонецФункции

#КонецОбласти

&НаСервере
Процедура ВыдатьВЛичноеПользованиеПриИзмененииСервер()
	
	УправлениеМатериальнымиЗапасами.УстановитьВидДопСубконтоЛичногоПользования(
	ЭтотОбъект,
	Объект.ВыдатьВЛичноеПользование,
	?(ЭтотОбъект.КэшПараметров.Локальные.Счета27.Количество(), ЭтотОбъект.КэшПараметров.Локальные.Счета27[0], ПланыСчетов.ЕПСБУ.ПустаяСсылка()),
	"МатериалыДополнительноеСубконтоСчета",
	"Материалы");
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСчетаУчетаНаСервере()
	
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьПризнакФормыДополнительноеСубконто3(ЭтотОбъект);
	ОтключитьВидимостьКолонкиДопСубконто();
	Если НЕ СчетУчета105(ЭтотОбъект) Тогда
		Объект.ВыдатьВЛичноеПользование = Ложь;
		УправлениеМатериальнымиЗапасамиКлиентСервер.ОчиститьВидДопСубконтоЛичногоПользования(ЭтотОбъект, "МатериалыДополнительноеСубконтоСчета");
	КонецЕсли;
	УстановитьВидимостьЭлементов(ЭтотОбъект);

КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
