
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииСервер.УстановитьОтборСпискаИзНастроекКомпоновки(Список, Параметры);
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
		ОтборОрганизация = Параметры.Отбор.Владелец;
		Параметры.Отбор.Удалить("Владелец");
	ИначеЕсли Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Организация") Тогда
		ОтборОрганизация = Параметры.Отбор.Организация;
	ИначеЕсли Параметры.Свойство("Организация") Тогда
		ОтборОрганизация = Параметры.Организация;
	ИначеЕсли Параметры.Свойство("Владелец") Тогда
		ОтборОрганизация = Параметры.Владелец;
	КонецЕсли;
	
	ОтборОрганизация = Справочники.Организации.ПереопределитьОтборПоОрганизации(ОтборОрганизация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", ОтборОрганизация, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборОрганизация));
	Элементы.Владелец.Видимость = НЕ ЗначениеЗаполнено(ОтборОрганизация);

	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		Элементы.ОтборОрганизация.Вид = ВидПоляФормы.ПолеНадписи;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборВладелецПриИзменении(Элемент)
	
	ОтборОрганизация = ПереопределитьОтборПоОрганизации(ОтборОрганизация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", ОтборОрганизация, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Элементы.Владелец.Видимость = Не ЗначениеЗаполнено(ОтборОрганизация);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПереопределитьОтборПоОрганизации(ИсходнаяОрганизация)
	
	Возврат Справочники.Организации.ПереопределитьОтборПоОрганизации(ИсходнаяОрганизация);
	
КонецФункции

#КонецОбласти

