&НаКлиенте
Перем ТекстЗаголовкаСообщений;

&НаКлиенте
Перем СчетПрежнееЗначение;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ИнициализацияФормы();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.Подвал);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Инициализация:
	ТекстЗаголовкаСообщений = НСтр("ru='Инвентаризация имущества казны'");
	СчетПрежнееЗначение = Объект["Счет"];
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	//
	// Количество документов, введенных на основании данного документа
	//
	ЗаписанДокументНаОсновании = (ИмяСобытия = "ДокументыПоУчетуИКИзменение");
	Если ЗаписанДокументНаОсновании Тогда
		ОпределитьКоличествоДокументовВведенныхНаОсновании();
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦМОПриИзменении(Элемент)
	
	Если НастройкиДляРаботы["ЕстьСубконтоЦМО"] Тогда
		ВыполненВыборТипа = (НЕ ЗначениеЗаполнено(Объект["ЦМО"]) И НЕ Объект["ЦМО"] = Неопределено);
		
		УстановитьТекстПодсказкиМОЛ(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	ПроверитьСчетПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	//---
	// Флажок <без ограничения>
	//---
	ОбщегоНазначенияБГУКлиентСервер.ФлажокБезОграничения_РеквизитСсылка_ПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура ИФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//---
	// Поддержка работы поля ИФО с состояниями <пустое значение> и <без ограничения>.
	//---
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ТекущаяСтрока", Объект.ИФО);
	ОткрытьФорму("Справочник.ИсточникиФинансовогоОбеспечения.ФормаВыбора", ПараметрыФормы, Элемент);
	//---
	
КонецПроцедуры
&НаКлиенте
Процедура ИФООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//---
	// Поддержка работы поля ИФО с состояниями <пустое значение> и <без ограничения>.
	//---
	Элементы.ИФО.РежимВыбораИзСписка = Ложь;
	
КонецПроцедуры
&НаКлиенте
Процедура БезУчетаИФОПриИзменении(Элемент)
	
	//---
	// Флажок <без ограничения>
	//---
	ОбщегоНазначенияБГУКлиентСервер.ФлажокБезОграничения_РеквизитФлажок_ПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьВсегоДокументовНажатие(Элемент)
	
	Если НастройкиДляРаботы["УказанСчетОС"] Тогда
		ДополнительныйПараметр = "ОС";
	ИначеЕсли НастройкиДляРаботы["УказанСчетМЗ"] Тогда
		ДополнительныйПараметр = "МЗ";
	Иначе
		ДополнительныйПараметр = Неопределено;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументОснованиеСсылка",	Объект["Ссылка"]);
	ПараметрыФормы.Вставить("ДополнительныйПараметр",	ДополнительныйПараметр);
	
	ОткрытьФорму("ОбщаяФорма.СписокДокументовВведенныхНаОсновании", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ВариантФормированияОписиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущееЗначениеВарианта = Объект["ВариантФормированияОписи"];
	
	НовоеЗначениеВарианта = ВыбранноеЗначение;
	
	БудутОчищеныКолонки = ИнвентаризацияКлиент.Редактирование0504087_БудутОчищеныКолонкиПриИзмененииВариантаФормированияОписи(
		ТекущееЗначениеВарианта,
		НовоеЗначениеВарианта);
	
	Если БудутОчищеныКолонки И Объект.Инвентаризация.Количество() > 0 Тогда
		
		ПараметрыОповещения = Новый Структура();
		ПараметрыОповещения.Вставить("НовоеЗначениеВарианта", НовоеЗначениеВарианта);
		
		ТекстСообщения = НСтр("ru='Изменение варианта формирования описи вызовет очистку
			|некоторых колонок таблицы.
			|
			|Продолжить и сменить вариант формирования описи?'");
		ОписаниеОповещенияОтвет = Новый ОписаниеОповещения("ВариантФормированияОписиОбработкаВыбора_Ответ", ЭтотОбъект, ПараметрыОповещения);
		ПоказатьВопрос(ОписаниеОповещенияОтвет, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ВариантФормированияОписи0504087_ИзменитьВариант(НовоеЗначениеВарианта);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантФормированияОписиОбработкаВыбора_Ответ(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		НовоеЗначениеВарианта = ПараметрыОповещения["НовоеЗначениеВарианта"];
		
		ВариантФормированияОписи0504087_ИзменитьВариант(НовоеЗначениеВарианта);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИнвентаризацииПриИзменении(Элемент)
	
	Если ИнвентаризацияКлиент.СчетДействуетНаДату(КэшСвойстваСчетаУчета, Объект.ДатаИнвентаризации) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Счет = Неопределено;
	
	КэшироватьСвойстваСчетаУчетаСервер();
	
КонецПроцедуры

// РешениеОПроведенииИнвентаризации
&НаКлиенте
Процедура РешениеОПроведенииИнвентаризацииПриИзменении(Элемент)
	
	ИнвентаризацияКлиент.ВыбраноРешениеОПроведенииИнвентаризации(ЭтаФорма);
	
КонецПроцедуры
// Конец РешениеОПроведенииИнвентаризации

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Инвентаризация

&НаКлиенте
Процедура ИнвентаризацияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьНедостачуИзлишек(Элементы["Инвентаризация"].ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацияОсновноеСредствоПриИзменении(Элемент)
	
	УстановитьПоВозможностиИнвентарныйНомер(Элементы["Инвентаризация"].ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацияЦенаПриИзменении(Элемент)
	
	РассчитатьЦенуСумму(Элементы["Инвентаризация"].ТекущиеДанные, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацияКоличествоФактПриИзменении(Элемент)
	
	ОбработатьНовоеЗначениеКоличества("Инвентаризация", "КоличествоФакт");
	
	РассчитатьЦенуСумму(Элементы["Инвентаризация"].ТекущиеДанные, Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура ИнвентаризацияСуммаФактПриИзменении(Элемент)
	
	РассчитатьЦенуСумму(Элементы["Инвентаризация"].ТекущиеДанные, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацияКоличествоУчетПриИзменении(Элемент)
	
	ОбработатьНовоеЗначениеКоличества("Инвентаризация", "КоличествоУчет");
	
	РассчитатьЦенуСумму(Элементы["Инвентаризация"].ТекущиеДанные, Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура ИнвентаризацияСуммаУчетПриИзменении(Элемент)
	
	РассчитатьЦенуСумму(Элементы["Инвентаризация"].ТекущиеДанные, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацияСтатусОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.ВыбратьИУстановитьСтатусОбъектаДляИнвентаризации(ЭтаФорма, Элементы.Инвентаризация.ТекущиеДанные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризацияЦелеваяФункцияАктиваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("Справочник.ЦелевыеФункцииАктивовДляИнвентаризации.ФормаВыбора",,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Недостачи

&НаКлиенте
Процедура НедостачиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекДанные = Элементы["Недостачи"].ТекущиеДанные;
		ТекДанные["ВидДокумента"] = ВидДокументаПоУмолчаниюНедостачи;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НедостачиОсновноеСредствоПриИзменении(Элемент)
	
	УстановитьПоВозможностиИнвентарныйНомер(Элементы["Недостачи"].ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура НедостачиЦенаПриИзменении(Элемент)
	
	РассчитатьСуммыВСтрокеТаблицыНедостачи(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НедостачиКоличествоПриИзменении(Элемент)
	
	ОбработатьНовоеЗначениеКоличества("Недостачи", "Количество");
	
	РассчитатьСуммыВСтрокеТаблицыНедостачи(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НедостачиСуммаПриИзменении(Элемент)
	
	РассчитатьСуммыВСтрокеТаблицыНедостачи(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Излишки

&НаКлиенте
Процедура ИзлишкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекДанные = Элементы["Излишки"].ТекущиеДанные;
		ТекДанные["ВидДокумента"] = ВидДокументаПоУмолчаниюИзлишки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзлишкиОсновноеСредствоПриИзменении(Элемент)
	
	УстановитьПоВозможностиИнвентарныйНомер(Элементы["Излишки"].ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзлишкиЦенаПриИзменении(Элемент)
	
	РассчитатьСуммыВСтрокеТаблицыИзлишки(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзлишкиКоличествоПриИзменении(Элемент)
	
	ОбработатьНовоеЗначениеКоличества("Излишки", "Количество");
	
	РассчитатьСуммыВСтрокеТаблицыИзлишки(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзлишкиСуммаПриИзменении(Элемент)
	
	РассчитатьСуммыВСтрокеТаблицыИзлишки(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПорядокСписания

&НаКлиенте
Процедура ПорядокСписанияПриИзменении(Элемент)
	
	ИзмененПорядокСписанияНедостач = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСписанияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСписанияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставКомиссии

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ОбработатьПодборКомиссии(ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры
																
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьКомиссию(Команда)
	
	ИнвентаризацияКлиент.ОткрытьВыборКомиссии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	
	ИнвентаризацияКлиент.ОткрытьВыборПредседателяКомиссии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода",				Объект["ДатаНачала"]);
	СтруктураПараметров.Вставить("КонецПериода",				Объект["ДатаОкончания"]);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Объект["ДатаНачала"]	= РезультатВыбора["НачалоПериода"];
		Объект["ДатаОкончания"]	= РезультатВыбора["КонецПериода"];
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	ИнвентаризацияКлиент.ОткрытьПодборКомиссии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымУчета(Команда)
	
	ПроверитьИЗаполнитьПоДаннымУчета();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьФактическоеНаличие(Команда)
	
	ПроверитьИЗаполнитьФактическоеНаличие();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНедостачи(Команда)
	
	ПроверитьИЗаполнитьНедостачи();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзлишки(Команда)
	
	ПроверитьИЗаполнитьИзлишки();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеПоУчету(Команда)
	
	РазрешитьРедактированиеПоУчету = НЕ РазрешитьРедактированиеПоУчету;
	
	Элементы["ФормаРазрешитьРедактированиеПоУчету"].Пометка = РазрешитьРедактированиеПоУчету;
	
КонецПроцедуры


&НаКлиенте
Процедура ГрупповоеЗаполнениеНФА(Команда)
	
	ИнвентаризацияКлиент.ОткрытьФормуГрупповогоЗаполненияСтрок(ЭтаФорма, "Инвентаризация");
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеЗаполнениеИзлишки(Команда)
	
	ИнвентаризацияКлиент.ОткрытьФормуГрупповогоЗаполненияСтрок(ЭтаФорма, "Излишки");
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеЗаполнениеНедостачи(Команда)
	
	ИнвентаризацияКлиент.ОткрытьФормуГрупповогоЗаполненияСтрок(ЭтаФорма, "Недостачи");
	
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьИзТСД(Команда)
	
	ПроверитьИЗагрузитьИзТСД();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВТСД(Команда)
	
	ПроверитьИВыгрузитьВТСД();
	
КонецПроцедуры


&НаКлиенте
Процедура РазбитьСтроку(Команда)
	
	ПараметрыФормы = ИнвентаризацияКлиент.ПараметрыФормыРазбивкиСтрокиИнвентаризацииНфа();
	
	ПараметрыФормы.ИмяТабличнойЧасти = "Инвентаризация";
	ПараметрыФормы.ТочностьКоличества = ?(НастройкиДляРаботы.УказанСчетМЗ, 3, 0);
	ПараметрыФормы.ТочностьЦены = 5;
	
	ПараметрыФормы.СоответствиеИмен.КоличествоФакт	= "КоличествоФакт";
	ПараметрыФормы.СоответствиеИмен.СуммаФакт		= "СуммаФакт";
	ПараметрыФормы.СоответствиеИмен.КоличествоУчет	= "КоличествоУчет";
	ПараметрыФормы.СоответствиеИмен.СуммаУчет		= "СуммаУчет";
	
	ИнвентаризацияКлиент.ОткрытьФормуРазбивкиСтрокиИнвентаризацииНфа(ЭтаФорма, Элементы.Инвентаризация.ТекущиеДанные, ПараметрыФормы);
	
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик выбора строки постоянно действующией комиссии. см.ОбщегоНазначенияБГУКлиент.НачатьВыборПостоянноДействующейКомиссии.
// "Объект" передается явно, без этого данные объекта не заполняются в web-клиенте.
&НаКлиенте
Процедура УстановитьКомиссиюВДокумент(Результат, ДопПараметры) Экспорт
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Результат, ДопПараметры, Объект)	
КонецПроцедуры

// РешениеОПроведенииИнвентаризации
&НаКлиенте
Процедура ЗакрытаФормаВыбораДанныхИзРешенияОПроведенииИнвентаризации(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОписьПоРешениюОПроведенииИнвентаризацииСервер(РезультатВыбора);
	
	ПослеЗаполненияОписиПоРешениюОПроведенииИнвентаризацииКлиент(РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписьПоРешениюОПроведенииИнвентаризацииСервер(РезультатВыбора)
	
	ИнвентаризацияСервер.ЗаполнитьОписьПоРешениюИзФормыОписи(ЭтаФорма, РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполненияОписиПоРешениюОПроведенииИнвентаризацииКлиент(РезультатВыбора)
	
	СчетПриИзмененииКлиент();
	
	ИнвентаризацияКлиент.СообщитьОЗаполненииНаОснованииРешенияОПроведенииИнвентаризации();
	
КонецПроцедуры
// Конец РешениеОПроведенииИнвентаризации

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормы()
	
	ИнвентаризацияСервер.ВариантФормированияОписи0504087_ИнициализироватьФорму(ЭтаФорма);
	
	НастроитьФормуСервер_ПоСчету();
	
	//---
	// Флажок <без ограничения>
	//---
	НастройкиМеханизма = Документы.ИнвентаризацияИК.ФлажокБезОграничения_ПолучитьНастройкиМеханизма();
	ОбщегоНазначенияБГУ.ФлажокБезОграничения_ИнициализироватьФорму(ЭтаФорма, НастройкиМеханизма);
	
	ОпределитьКоличествоДокументовВведенныхНаОсновании();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//---
	// 1. Таблица "Инвентаризация" - запрет редактирования колонок "По учету"
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Инвентаризация"" - запрет редактирования колонок ""По учету""'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РазрешитьРедактированиеПоУчету");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ИнвентаризацияКоличествоУчет");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ИнвентаризацияСуммаУчет");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Инвентаризация194нКоличествоУчет");

	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Инвентаризация194нСуммаУчет");

	
	//---
	// 2. Таблица "Инвентаризация" - текст "кол-во" для надписи
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Инвентаризация"" - текст ""кол-во"" для надписи'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Ложь;
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "кол-во");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ИнвентаризацияНадписьКоличество");


	//---
	// 3. Таблица "Инвентаризация" - текст "сумма" для надписи
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Таблица ""Инвентаризация"" - текст ""сумма"" для надписи'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Ложь;
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "сумма");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ИнвентаризацияНадписьСумма");

	
	ТаблицаВидыДокументов = Документы.ИнвентаризацияИК.ПолучитьТаблицуВидыДокументов();
	
	Для Каждого СтрокаТаблицы Из ТаблицаВидыДокументов	Цикл
		//---
		// Таблица "Недостачи"
		//---
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		НовыйЭлементУО.Представление = "Таблица ""Недостачи"" - представление колонки ВидДокумента при значении " + СтрокаТаблицы["Наименование"];
		// Условие:
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Недостачи.ВидДокумента");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = СтрокаТаблицы["Наименование"];
		// Оформление:
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", СтрокаТаблицы["Синоним"]);
		// Оформляемые поля:
		ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НедостачиВидДокумента");
		
		//---
		// Таблица "Излишки"
		//---
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		НовыйЭлементУО.Представление = "Таблица ""Излишки"" - представление колонки ВидДокумента при значении " + СтрокаТаблицы["Наименование"];
		// Условие:
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Излишки.ВидДокумента");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = СтрокаТаблицы["Наименование"];
		// Оформление:
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", СтрокаТаблицы["Синоним"]);
		// Оформляемые поля:
		ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ИзлишкиВидДокумента");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьТекстОтборЦМО(ЦМО, ЕстьСубконтоЦМО)
	
	Если ЕстьСубконтоЦМО И ЗначениеЗаполнено(ЦМО) Тогда
		Если ТипЗнч(ЦМО) = Тип("СправочникСсылка.Сотрудники") Тогда
			Результат = НСтр("ru='отбор по Сотруднику'");
		ИначеЕсли ТипЗнч(ЦМО) = Тип("СправочникСсылка.ЦМО") Тогда
			Результат = НСтр("ru='отбор по ЦМО'");
		КонецЕсли;
	Иначе
		Результат = НСтр("ru='без отбора'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыОС(Знач Организация, Знач ОсновноеСредство, Знач ЦМО, Знач ДатаДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета КАК СчетУчета
	|ИЗ
	|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство
	|				И СчетУчета В (&Счет)) КАК УчетныеДанныеОбъектаОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство
	|				И ЦМО = &ЦМО
	|				И ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)) КАК СтоимостьОбъектовОСОстатки";
	
	Если ЦМО = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЦМО = &ЦМО", "ИСТИНА");
	ИначеЕсли ТипЗнч(ЦМО) = Тип("СправочникСсылка.Сотрудники") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЦМО = &ЦМО", "ЦМО.Сотрудник = &ЦМО");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период"				, ДатаДок);
	Запрос.УстановитьПараметр("Организация"			, Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство"	, ОсновноеСредство);
	Запрос.УстановитьПараметр("ЦМО"					, ЦМО);
	Запрос.УстановитьПараметр("Счет"				, БухгалтерскийУчет.СписокСчетов("108.00"));
	
	Результат = Новый Структура("Счет,ИнвентарныйНомер");
	
	Данные = Запрос.ВыполнитьПакет();
	
	Выборка = Данные[0].Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Счет = Выборка.СчетУчета;
	КонецЕсли;
	
	Выборка = Данные[1].Выбрать();
	Если Выборка.Количество() = 1 И Выборка.Следующий() Тогда
		Результат.ИнвентарныйНомер = Выборка.ИнвентарныйНомер;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьСчетПриИзменении()
	
	Если НЕ Объект["Счет"] = СчетПрежнееЗначение Тогда
		// Счет был изменен
		
		Если (Объект["Инвентаризация"].Количество() > 0
			ИЛИ	Объект["Недостачи"].Количество() > 0
			ИЛИ	Объект["Излишки"].Количество() > 0) Тогда
			// Уточним желание сменить счет
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Изменение счета учета вызовет очистку таблиц
					|""%1"", ""Недостачи"" и ""Излишки""
					|
					|Продолжить и сменить счет учета?'"),
				ЗаголовокСтраницыИнвентаризация);
			
			ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьСчетПриИзменении_Выбор", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
		Иначе
			СчетПриИзмененииКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьСчетПриИзменении_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		СчетПриИзмененииКлиент();
		
	ИначеЕсли РезультатВыбора = КодВозвратаДиалога.Нет Тогда
		// Восстанавливаем прежнее значение счета
		Объект["Счет"] = СчетПрежнееЗначение;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СчетПриИзмененииКлиент()
	
	Объект["Инвентаризация"].Очистить();
	Объект["Недостачи"].Очистить();
	Объект["Излишки"].Очистить();
	Объект["Остатки"].Очистить();
	Объект["ПорядокСписания"].Очистить();
	
	НастроитьФормуСервер_ПоСчету();
	
	СчетПрежнееЗначение = Объект["Счет"];
	
КонецПроцедуры
&НаСервере
Процедура НастроитьФормуСервер_ПоСчету()
	
	// Кэшируем применяемые настройки
	НастройкиДляРаботы = Новый ФиксированнаяСтруктура(Документы.ИнвентаризацияИК.ПолучитьНастройкиДляРаботы(Объект));
	
	КэшироватьСвойстваСчетаУчетаСервер();
	
	УказанСчетОС = НастройкиДляРаботы["УказанСчетОС"];
	УказанСчетМЗ = НастройкиДляРаботы["УказанСчетМЗ"];
	
	Если УказанСчетОС Тогда
		ЗаголовокСтраницыИнвентаризация = НСтр("ru='Основные средства'");
		ФорматПолейКоличество = "ЧДЦ=0;";
		
		ПоискВидовДокументов = Новый Структура("УказанСчетОС", Истина);
	Иначе
		ЗаголовокСтраницыИнвентаризация = НСтр("ru='Материалы'");
		ФорматПолейКоличество = "ЧДЦ=3;";
		
		ПоискВидовДокументов = Новый Структура("УказанСчетМЗ", Истина);
	КонецЕсли;
	
	// Списки видов документов
	ВидыДокументов = Документы.ИнвентаризацияИК.ПолучитьСпискиВидыДокументов(Объект);
	ВидыДокументовНедостачи				= ВидыДокументов["Недостачи"];
	ВидыДокументовИзлишки				= ВидыДокументов["Излишки"];
	ВидДокументаПоУмолчаниюНедостачи	= ВидыДокументов["ВидДокументаПоУмолчаниюНедостачи"];
	ВидДокументаПоУмолчаниюИзлишки		= ВидыДокументов["ВидДокументаПоУмолчаниюИзлишки"];
	Элементы["НедостачиВидДокумента"].СписокВыбора.Очистить();
	Для Каждого Элем Из ВидыДокументовНедостачи Цикл
		Элементы["НедостачиВидДокумента"].СписокВыбора.Добавить(Элем.Значение, Элем.Представление);
	КонецЦикла;
	Элементы["ИзлишкиВидДокумента"].СписокВыбора.Очистить();
	Для Каждого Элем Из ВидыДокументовИзлишки Цикл
		Элементы["ИзлишкиВидДокумента"].СписокВыбора.Добавить(Элем.Значение, Элем.Представление);
	КонецЦикла;
	
	// Колонки таблиц
	Элементы["ИнвентаризацияКоличествоФакт"].Формат			= ФорматПолейКоличество;
	Элементы["ИнвентаризацияКоличествоУчет"].Формат			= ФорматПолейКоличество;
	Элементы["ИнвентаризацияНедостачаКоличество"].Формат	= ФорматПолейКоличество;
	Элементы["ИнвентаризацияИзлишекКоличество"].Формат		= ФорматПолейКоличество;
	Элементы["НедостачиКоличество"].Формат					= ФорматПолейКоличество;
	Элементы["ИзлишкиКоличество"].Формат					= ФорматПолейКоличество;
	Элементы["ИнвентаризацияОсновноеСредство"].Видимость	= УказанСчетОС;
	Элементы["НедостачиОсновноеСредство"].Видимость			= УказанСчетОС;
	Элементы["ИзлишкиОсновноеСредство"].Видимость			= УказанСчетОС;
	Элементы["ИнвентаризацияПолеГрупповойУчет"].Видимость	= УказанСчетОС;
	Элементы["НедостачиПолеГрупповойУчет"].Видимость		= УказанСчетОС;
	Элементы["ИзлишкиПолеГрупповойУчет"].Видимость			= УказанСчетОС;
	Элементы["ИнвентаризацияИнвентарныйНомер"].Видимость	= УказанСчетОС И НастройкиДляРаботы["УчетПоАналитике"];
	Элементы["НедостачиИнвентарныйНомер"].Видимость			= УказанСчетОС И НастройкиДляРаботы["УчетПоАналитике"];
	Элементы["ИзлишкиИнвентарныйНомер"].Видимость			= УказанСчетОС И НастройкиДляРаботы["УчетПоАналитике"];
	Элементы["ИнвентаризацияНоменклатура"].Видимость		= УказанСчетМЗ;
	Элементы["НедостачиНоменклатура"].Видимость				= УказанСчетМЗ;
	Элементы["ИзлишкиНоменклатура"].Видимость				= УказанСчетМЗ;
	Элементы["ИнвентаризацияЕдИзм"].Видимость				= УказанСчетМЗ;
	Элементы["НедостачиЕдИзм"].Видимость					= УказанСчетМЗ;
	Элементы["ИзлишкиЕдИзм"].Видимость						= УказанСчетМЗ;
	Элементы["НедостачиЦМО"].Видимость						= НастройкиДляРаботы["ЕстьСубконтоЦМО"];
	Элементы["ИзлишкиЦМО"].Видимость						= НастройкиДляРаботы["ЕстьСубконтоЦМО"];
	Элементы["ПорядокСписанияЦМО"].Видимость				= НастройкиДляРаботы["ЕстьСубконтоЦМО"];
	
	НовыйПараметр = Новый ПараметрВыбора("ОграниченияСчета", Объект["Счет"]);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	Элементы["ИнвентаризацияСчет"].ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
	// Кнопки меню
	Элементы["ИзлишкиЗаполнитьИзлишки"].Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='По данным таблицы ""%1""'"),
		ЗаголовокСтраницыИнвентаризация);
	Элементы["НедостачиЗаполнитьНедостачи"].Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='По данным таблицы ""%1"" (с учетом порядка списания)'"),
		ЗаголовокСтраницыИнвентаризация);
	Элементы["ИнвентаризацияВыгрузитьВТСД"].Доступность		= УказанСчетОС;
	Элементы["ИнвентаризацияЗагрузитьИзТСД"].Доступность	= УказанСчетОС;

	// Прочие элементы
	Элементы["СтраницаИнвентаризация"].Заголовок			= ЗаголовокСтраницыИнвентаризация;
	
	УстановитьТекстПодсказкиМОЛ(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекстПодсказкиМОЛ(Форма)
	
	НастройкиДляРаботы		= Форма["НастройкиДляРаботы"];
	Объект					= Форма["Объект"];
	НастраиваемыйЭлемент	= Форма.Элементы["ЦМО"];
	
	ТекстПодсказки = ПолучитьТекстОтборЦМО(Объект["ЦМО"], НастройкиДляРаботы["ЕстьСубконтоЦМО"]);
	
	НастраиваемыйЭлемент.Подсказка = ТекстПодсказки;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьКоличествоДокументовВведенныхНаОсновании()
	
	// Общее количество документов
	КоличествоДокументов	= Документы.ИнвентаризацияИК.ПолучитьКоличествоДокументовВведенныхНаОсновании(Объект);
	КоличествоСписаний		= КоличествоДокументов["КоличествоСписаний"];
	КоличествоПоступлений	= КоличествоДокументов["КоличествоПоступлений"];
	
	// Надпись общее количество документов
	ТекстНадписи= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 шт'"),
		КоличествоПоступлений + КоличествоСписаний);
	Элементы["НадписьВсегоДокументов"].Заголовок = ТекстНадписи;
	
	// Категории для русского языка:
	//	Ноль	(-);
	//	Один	(1 шт);
	//	Два		(-);
	//	Немного	(2 шт);
	//	Много	(5 шт);
	//	Другое	(-)
	
	// Надпись Х списаний
	НадписьСписания = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru=';%1 списание;;%1 списания;%1 списаний;'"),
		КоличествоСписаний);
		
	// Надпись У поступлений
	НадписьПоступления = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru=';%1 поступление;;%1 поступления;%1 поступлений;'"),
		КоличествоПоступлений);
		
	// Надпись количество документов списаний и поступлений
	ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='(%1, %2)'"),
		НадписьСписания,
		НадписьПоступления);
	Элементы["НадписьВсегоДокументовКон"].Заголовок = ТекстНадписи;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка, ВыбранноеЗначение = Неопределено)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
	
	ТекстСообщения = НСтр("ru='Изменение организации вызовет полную очистку
		|табличных частей документа.
		|
		|Продолжить и сменить организацию?'");
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОрганизацияПередИзменениемКлиент_Ответ", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПередИзменениемКлиент_Ответ(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		Объект["Организация"] = ПараметрыОповещения["ВыбранноеЗначение"];
		ЭтаФорма.Модифицированность = Истина;
		ОрганизацияПриИзмененииКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииКлиент()
	
	НастроитьФормуСервер_ПриИзмененииОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСервер_ПриИзмененииОрганизации()
	
	// Очищаем реквизиты документа
	ОчищающаяСтруктура = Новый Структура("
		|ДолжностьПредседателяКомиссии,
		|ФамилияПредседателяКомиссии,
		|ИмяПредседателяКомиссии,
		|ОтчествоПредседателяКомиссии,
		|НомерПриказаКомиссии,
		|ДатаПриказаКомиссии,
		|МестоИнвентаризации");
	ЗаполнитьЗначенияСвойств(Объект, ОчищающаяСтруктура);
	
	// Очищаем все табличные части документа
	Объект["Инвентаризация"].Очистить();
	Объект["Излишки"].Очистить();
	Объект["Недостачи"].Очистить();
	Объект["Остатки"].Очистить();
	Объект["ПорядокСписания"].Очистить();
	Объект["СоставКомиссии"].Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоВозможностиИнвентарныйНомер(ТекДанные)
	
	Если ЗначениеЗаполнено(ТекДанные["ОсновноеСредство"]) Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные, ПолучитьРеквизитыОС(Объект["Организация"],
			ТекДанные["ОсновноеСредство"], Объект["ЦМО"], Объект["Дата"]));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦенуСумму(ТекДанные, Элемент)
	
	ИмяЭлемента	= Элемент.Имя;
	
	Если Объект["ВариантФормированияОписи"] = 0 Тогда
		// 0. Опись до 2018 г. Счет в шапке
		
		РассчитатьЦенуСумму_Инвентаризация_Вариант0(ТекДанные, ИмяЭлемента);
	Иначе
		// 1. Опись с 2018 г. Счет в таблице (26 знаков)
		// 2. Опись с 2018 г. Счет в таблице (5 знаков)
		// 3. Опись с 2018 г. Счет в таблице (5 знаков). Одна строка - один объект
		
		РассчитатьЦенуСумму_Инвентаризация_Вариант123(ТекДанные, ИмяЭлемента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦенуСумму_Инвентаризация_Вариант0(ТекДанные, ИмяЭлемента)
	
	Если ИмяЭлемента = "ИнвентаризацияЦена" Тогда
		ТекДанные["СуммаФакт"] = ТекДанные["КоличествоФакт"] * ТекДанные["Цена"];
		ТекДанные["СуммаУчет"] = ТекДанные["КоличествоУчет"] * ТекДанные["Цена"];
		
	ИначеЕсли ИмяЭлемента = "ИнвентаризацияКоличествоФакт" Тогда
		ТекДанные["СуммаФакт"] = ТекДанные["КоличествоФакт"] * ТекДанные["Цена"];
		
	ИначеЕсли ИмяЭлемента = "ИнвентаризацияКоличествоУчет" Тогда
		ТекДанные["СуммаУчет"] = ТекДанные["КоличествоУчет"] * ТекДанные["Цена"];
		
	ИначеЕсли ИмяЭлемента = "ИнвентаризацияСуммаФакт" Тогда
		// Новое значение цены
		Если ТекДанные["КоличествоФакт"] = 0 Тогда
			ТекДанные["Цена"] = 0;
		Иначе
			ТекДанные["Цена"] = ТекДанные["СуммаФакт"] / ТекДанные["КоличествоФакт"];
		КонецЕсли;
		
		// Пересчет смежной суммы по новой цене
		Если ТекДанные["КоличествоФакт"] = ТекДанные["КоличествоУчет"] Тогда
			ТекДанные["СуммаУчет"] = ТекДанные["СуммаФакт"];
		Иначе
			ТекДанные["СуммаУчет"] = ТекДанные["КоличествоУчет"] * ТекДанные["Цена"];;
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "ИнвентаризацияСуммаУчет" Тогда
		// Новое значение цены
		Если ТекДанные["КоличествоУчет"] = 0 Тогда
			ТекДанные["Цена"] = 0;
		Иначе
			ТекДанные["Цена"] = ТекДанные["СуммаУчет"] / ТекДанные["КоличествоУчет"];
		КонецЕсли;
		
		// Пересчет смежной суммы по новой цене
		Если ТекДанные["КоличествоФакт"] = ТекДанные["КоличествоУчет"] Тогда
			ТекДанные["СуммаФакт"] = ТекДанные["СуммаУчет"];
		Иначе
			ТекДанные["СуммаФакт"] = ТекДанные["КоличествоФакт"] * ТекДанные["Цена"];
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦенуСумму_Инвентаризация_Вариант123(ТекущиеДанные, ИмяЭлемента)
	
	ИмяИзмененногоПоля = Сред(ИмяЭлемента, 15); // Длина("Инвентаризация")=14
	
	ИнвентаризацияКлиент.Редактирование0504087_РассчитатьФактическиеПоказатели(ЭтаФорма, ТекущиеДанные, ИмяИзмененногоПоля);
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммыВСтрокеТаблицыИзлишки(Элемент)
	
	ИмяЭлемента	= Элемент.Имя;
	ТекДанные	= Элементы["Излишки"].ТекущиеДанные;
	
	Если ИмяЭлемента = "ИзлишкиЦена" Тогда
		ТекДанные["Сумма"] = ТекДанные["Количество"] * ТекДанные["Цена"];
		
	ИначеЕсли ИмяЭлемента = "ИзлишкиКоличество" Тогда
		ТекДанные["Сумма"] = ТекДанные["Количество"] * ТекДанные["Цена"];
		
	ИначеЕсли ИмяЭлемента = "ИзлишкиСумма" Тогда
		// Новое значение цены
		Если ТекДанные["Количество"] = 0 Тогда
			ТекДанные["Цена"] = 0;
		Иначе
			ТекДанные["Цена"] = ТекДанные["Сумма"] / ТекДанные["Количество"];
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура РассчитатьСуммыВСтрокеТаблицыНедостачи(Элемент)
	
	ИмяЭлемента	= Элемент.Имя;
	ТекДанные	= Элементы["Недостачи"].ТекущиеДанные;
	
	Если ИмяЭлемента = "НедостачиЦена" Тогда
		ТекДанные["Сумма"] = ТекДанные["Количество"] * ТекДанные["Цена"];
		
	ИначеЕсли ИмяЭлемента = "НедостачиКоличество" Тогда
		ТекДанные["Сумма"] = ТекДанные["Количество"] * ТекДанные["Цена"];
		
	ИначеЕсли ИмяЭлемента = "НедостачиСумма" Тогда
		// Новое значение цены
		Если ТекДанные["Количество"] = 0 Тогда
			ТекДанные["Цена"] = 0;
		Иначе
			ТекДанные["Цена"] = ТекДанные["Сумма"] / ТекДанные["Количество"];
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНедостачуИзлишекСервер(ТекДанные)
	
	Если Объект["ВариантФормированияОписи"] = 0 Тогда
		// 0. Опись до 2018 г. Счет в шапке
		
		ДельтаКоличество	= ТекДанные["КоличествоУчет"]	- ТекДанные["КоличествоФакт"];
		ДельтаСумма			= ТекДанные["СуммаУчет"]		- ТекДанные["СуммаФакт"];
		
		ТекДанные["НедостачаСумма"]			= ?(ДельтаСумма>0, ДельтаСумма, 0);
		ТекДанные["НедостачаКоличество"]	= ?(ДельтаКоличество>0, ДельтаКоличество, 0);
		ТекДанные["ИзлишекСумма"]			= ?(ДельтаСумма<0, -ДельтаСумма, 0);
		ТекДанные["ИзлишекКоличество"]		= ?(ДельтаКоличество<0, -ДельтаКоличество, 0);
	
	Иначе
		// 1. Опись с 2018 г. Счет в таблице (26 знаков)
		// 2. Опись с 2018 г. Счет в таблице (5 знаков)
		// 3. Опись с 2018 г. Счет в таблице (5 знаков). Одна строка - один объект
		
		ИнвентаризацияСервер.Редактирование0504087_РассчитатьРасхождениеВСтроке(ЭтаФорма, ТекДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьНедостачуИзлишек(ТекДанные)
	
	Если Объект["ВариантФормированияОписи"] = 0 Тогда
		// 0. Опись до 2018 г. Счет в шапке
		
		ДельтаКоличество	= ТекДанные["КоличествоУчет"]	- ТекДанные["КоличествоФакт"];
		ДельтаСумма			= ТекДанные["СуммаУчет"]		- ТекДанные["СуммаФакт"];
		
		ТекДанные["НедостачаСумма"]			= ?(ДельтаСумма>0, ДельтаСумма, 0);
		ТекДанные["НедостачаКоличество"]	= ?(ДельтаКоличество>0, ДельтаКоличество, 0);
		ТекДанные["ИзлишекСумма"]			= ?(ДельтаСумма<0, -ДельтаСумма, 0);
		ТекДанные["ИзлишекКоличество"]		= ?(ДельтаКоличество<0, -ДельтаКоличество, 0);
	
	Иначе
		// 1. Опись с 2018 г. Счет в таблице (26 знаков)
		// 2. Опись с 2018 г. Счет в таблице (5 знаков)
		// 3. Опись с 2018 г. Счет в таблице (5 знаков). Одна строка - один объект
		
		ИнвентаризацияКлиент.Редактирование0504087_РассчитатьРасхождениеВСтроке(ЭтаФорма, ТекДанные);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьНовоеЗначениеКоличества(ИмяТабличнойЧасти, ИмяПоляКоличество)
	
	Если НастройкиДляРаботы["УказанСчетОС"] Тогда
		// Значение должно быть целым числом
		
		ТекДанные = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
		ТекДанные[ИмяПоляКоличество] = Окр(ТекДанные[ИмяПоляКоличество], 0);
	КонецЕсли;
	
КонецПроцедуры

//---
// Заполнение табличных частей

&НаКлиенте
Функция НеобходимыеРеквизитыЗаполнены()
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект["ДатаИнвентаризации"]) Тогда
		Результат = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не указана дата проведения инвентаризации'"),
			Объект["Ссылка"],
			"Объект.ДатаИнвентаризации");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект["Организация"]) Тогда
		Результат = Ложь;
		ТекстСообщения = НСтр("ru='Поле ""Организация"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Объект.Ссылка,
			"Объект.Организация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект["Счет"]) Тогда
		Результат = Ложь;
		ТекстСообщения = НСтр("ru='Поле ""Счет"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Объект.Ссылка,
			"Объект.Счет");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьИЗаполнитьПоДаннымУчета()
	
	Если НеобходимыеРеквизитыЗаполнены() Тогда
		Если Объект["Инвентаризация"].Количество() > 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Перед заполнением по данным учета будет очищена
					|табличная часть ""%1""
					|
					|Продолжить и очистить?'"),
				ЗаголовокСтраницыИнвентаризация);
				
			ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьПоДаннымУчета_Выбор", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
		Иначе
			ЗаполнитьПоДаннымУчетаКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗаполнитьПоДаннымУчета_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДаннымУчетаКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьПоДаннымУчетаКлиент()
	
	ЗаполнитьПоДаннымУчетаСервер();
	
	// Если по данным учета не было добавлено ни одной строки, выведем сообщение:
	Если Объект["Инвентаризация"].Количество() = 0 Тогда
		ТекстВидНФА = ?(НастройкиДляРаботы["УказанСчетОС"],
			НСтр("ru='основных средств'"),
			НСтр("ru='материалов'"));
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Остатки %1, соответствующие условиям поиска, отсутствуют'"), ТекстВидНФА);
		ПоказатьПредупреждение(, ТекстСообщения, 10, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьПоДаннымУчетаСервер()
	
	Документы.ИнвентаризацияИК.ЗаполнитьПоДаннымУчета(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьФактическоеНаличие()
	
	Если Объект["Инвентаризация"].Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='Заполнить колонки ""По факту"" данными из колонок ""По учету""?'");
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьФактическоеНаличие_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗаполнитьФактическоеНаличие_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьФактическоеНаличиеСервер();
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьФактическоеНаличиеСервер()
	
	Документы.ИнвентаризацияИК.ЗаполнитьФактическоеНаличие(Объект);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьНедостачи()
	
	Если Объект["Недостачи"].Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='Перед заполнением недостачами будет очищена
			|табличная часть ""Недостачи""
			|
			|Продолжить и очистить?'");
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьНедостачи_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьНедостачиКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗаполнитьНедостачи_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНедостачиКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьНедостачиКлиент()
	
	Если ЗаполнитьРасхожденияСервер(Истина) Тогда
		ЭтаФорма.Модифицированность = Истина;
		
		Если Объект["Недостачи"].Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='Недостачи отсутствуют'");
			ПоказатьПредупреждение(, ТекстСообщения, 10, ТекстЗаголовкаСообщений);
		КонецЕсли;
	Иначе
		// Заполнение не было выполнено.
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не удалось заполнить недостачи, т.к. таблица ""%1"" заполнена с ошибками'"),
			ЗаголовокСтраницыИнвентаризация);
		ПоказатьПредупреждение(, ТекстСообщения, 20, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьИзлишки()
	
	Если Объект["Излишки"].Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='Перед заполнением излишками будет очищена
			|табличная часть ""Излишки""
			|
			|Продолжить и очистить?'");
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьИзлишки_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьИзлишкиКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗаполнитьИзлишки_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьИзлишкиКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьИзлишкиКлиент()
	
	Если ЗаполнитьРасхожденияСервер(Ложь) Тогда
		ЭтаФорма.Модифицированность = Истина;
		
		Если Объект["Излишки"].Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='Излишки отсутствуют'");
			ПоказатьПредупреждение(, ТекстСообщения, 10, ТекстЗаголовкаСообщений);
		КонецЕсли;
	Иначе
		// Заполнение не было выполнено.
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не удалось заполнить излишки, т.к. таблица ""%1"" заполнена с ошибками'"),
			ЗаголовокСтраницыИнвентаризация);
		ПоказатьПредупреждение(, ТекстСообщения, 20, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРасхожденияСервер(ЭтоНедостача)
	
	Возврат Документы.ИнвентаризацияИК.ЗаполнитьРасхождения(Объект, ЭтоНедостача);
	
КонецФункции

//---
// ТСД

&НаКлиенте
Процедура ПроверитьИВыгрузитьВТСД()
	
	#Если ВебКлиент Тогда
	ТекстСообщения = НСтр("ru='Работа с торговым оборудованием не поддерживается в режиме веб-клиента.
		|Для использования терминала сбора данных запустите программу в режиме тонкого клиента.'");
	ПоказатьПредупреждение(, ТекстСообщения, 15, ТекстЗаголовкаСообщений);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Объекты не выгружены в ТСД'"));
	Возврат;
	#КонецЕсли
	
	ОСБезШтрихкода = Неопределено;
	ТаблицаТСД = ТаблицаОСдляТСД(ОСБезШтрихкода);
	
	Если ОСБезШтрихкода.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Обнаружены объекты без штрихкода.
			|Объекты без штрихкода не будут выгружены в ТСД.
			|
			|Открыть форму формирования штрихкода для данных объектов?'");
		Кнопки = Новый СписокЗначений();									
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Открыть форму формирования штрихкода'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Выгрузить в ТСД объекты со штрихкодом'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИВыгрузитьВТСД_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, Кнопки, 15, , ТекстЗаголовкаСообщений, КодВозвратаДиалога.Отмена);
	Иначе
		ВыгрузитьВТСД_ВыполнитьВыгрузку();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИВыгрузитьВТСД_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		// Открыть форму формирования штрихкода
		
		// после закрытия перезаполнить таблицу ТСД
		ПараметрыФормы = Новый Структура("МассивОбъектов", АдресТаблицыДляСозданияШтрихкодов());
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьВТСД_ВыполнитьВыгрузку", ЭтотОбъект);
		ОткрытьФорму("РегистрСведений.ШтрихКоды.Форма.ФормаСозданияШтрихкодовОС", ПараметрыФормы, ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли РезультатВыбора = КодВозвратаДиалога.Нет Тогда
		// Выгрузить в ТСД объекты со штрихкодом
		
		ВыгрузитьВТСД_ВыполнитьВыгрузку();
	Иначе
		// Отмена
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Объекты не выгружены'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВТСД_ВыполнитьВыгрузку(Результат = Неопределено, ПараметрыОповещения = Неопределено) Экспорт
	
	ТаблицаТСД = ТаблицаОСдляТСД();
	
	Если ТаблицаТСД.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Нет объектов для выгрузки в ТСД'");
		ПоказатьПредупреждение(, ТекстСообщения, 15, ТекстЗаголовкаСообщений);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Объекты не выгружены'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВыгрузитьВТСД_ПослеВыгрузки", ЭтотОбъект);
	ПараметрыОперации = ОборудованиеТерминалыСбораДанныхКлиентСервер.ПараметрыВыгрузкиВТСД();
    ПараметрыОперации.ТаблицаТоваров = ТаблицаТСД;
	ОборудованиеТерминалыСбораДанныхКлиент.НачатьВыгрузкуДанныеВТСД(Оповещение, УникальныйИдентификатор, , ПараметрыОперации);
	
КонецПроцедуры
&НаКлиенте
Процедура ВыгрузитьВТСД_ПослеВыгрузки(Результат, ПараметрыОповещения) Экспорт
	
	ТекстСообщения = НСтр("ru='Данные успешно выгружены в ТСД'");
	ПоказатьПредупреждение(, ТекстСообщения, 15, ТекстЗаголовкаСообщений);
	
КонецПроцедуры
&НаСервере
Функция ТаблицаОСдляТСД(ВозвратМассивОСБезШтрихкода = Неопределено)
	
	ВозвратМассивОСБезШтрихкода = Новый Массив;
	
	ЗапросШтрихкоды = Новый Запрос();
	ЗапросШтрихкоды.УстановитьПараметр("Инвентаризация", Объект["Инвентаризация"].Выгрузить());
	ЗапросШтрихкоды.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ОсновноеСредство	КАК ОсновноеСредство,
	|	Т.ИнвентарныйНомер	КАК ИнвентарныйНомер,
	|	Т.Цена				КАК Цена,
	|	Т.КоличествоУчет	КАК Количество
	|ПОМЕСТИТЬ
	|	Инвентаризация
	|ИЗ
	|	&Инвентаризация	КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Инвентаризация.ОсновноеСредство.Наименование	КАК ОсновноеСредство,
	|	Инвентаризация.ИнвентарныйНомер.Код				КАК ИнвентарныйНомер,
	|	Инвентаризация.Цена								КАК Цена,
	|	Инвентаризация.Количество						КАК Количество,
	|	ЕСТЬNULL(ШтрихКоды.Штрихкод, """")				КАК Штрихкод
	|ИЗ
	|	Инвентаризация	КАК Инвентаризация
	|	ЛЕВОЕ СОЕДИНЕНИЕ	РегистрСведений.ШтрихКоды	КАК ШтрихКоды
	|		ПО	Инвентаризация.ОсновноеСредство = ШтрихКоды.Объект
	|		И	Инвентаризация.ИнвентарныйНомер = ШтрихКоды.ИнвентарныйНомер
	|;";
	
	МассивТСД = Новый Массив();
	Выборка = ЗапросШтрихкоды.Выполнить().Выбрать();
	ИндексСтроки = -1;
	Пока Выборка.Следующий() Цикл
		ИндексСтроки = ИндексСтроки + 1;
		Объект["Инвентаризация"][ИндексСтроки]["Штрихкод"] = Выборка.Штрихкод;
		
		Если ПустаяСтрока(Выборка.Штрихкод) Тогда
			ВозвратМассивОСБезШтрихкода.Добавить(Новый Структура("Объект, ИнвентарныйНомер", 
													Выборка.ОсновноеСредство, 
													Выборка.ИнвентарныйНомер));
		Иначе
			НоваяСтрока = Новый Структура("Штрихкод, Номенклатура, Цена", 
										  Выборка.Штрихкод, 
										  СокрЛП(Выборка.ОсновноеСредство) + 
										  ?(ПустаяСтрока(Выборка.ИнвентарныйНомер), 
										  	"", 
											" инв:" + СокрЛП(Выборка.ИнвентарныйНомер)),
										  Выборка.Цена);
			МассивТСД.Добавить(НоваяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивТСД;

КонецФункции
&НаСервере
Функция АдресТаблицыДляСозданияШтрихкодов()
	
	ЗапросШтрихкоды = Новый Запрос();
	ЗапросШтрихкоды.УстановитьПараметр("ТаблицаОС", Объект["Инвентаризация"].Выгрузить(,"ОсновноеСредство, ИнвентарныйНомер"));
	ЗапросШтрихкоды.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаОС.ОсновноеСредство,
	|	ТаблицаОС.ИнвентарныйНомер
	|ПОМЕСТИТЬ
	|	ТаблицаОС
	|ИЗ
	|	&ТаблицаОС КАК ТаблицаОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаОС.ОсновноеСредство,
	|	ТаблицаОС.ИнвентарныйНомер,
	|	ШтрихКоды.Штрихкод
	|ИЗ
	|	ТаблицаОС	КАК ТаблицаОС
	|	ЛЕВОЕ СОЕДИНЕНИЕ	РегистрСведений.ШтрихКоды	КАК ШтрихКоды
	|		ПО	ТаблицаОС.ОсновноеСредство = ШтрихКоды.Объект
	|		И	ТаблицаОС.ИнвентарныйНомер = ШтрихКоды.ИнвентарныйНомер";
	
	Возврат ПоместитьВоВременноеХранилище(ЗапросШтрихкоды.Выполнить().Выгрузить(), УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьИЗагрузитьИзТСД()
	
	#Если ВебКлиент Тогда
	ТекстСообщения = НСтр("ru='Работа с торговым оборудованием не поддерживается в режиме веб-клиента.
		|Для использования терминала сбора данных запустите программу в режиме тонкого клиента.'");
	ПоказатьПредупреждение(, ТекстСообщения, 15, ТекстЗаголовкаСообщений);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Объекты не загружены из ТСД'"));
	Возврат;
	#КонецЕсли
	
	ТекстСообщения = НСтр("ru='Загрузить данные о фактическом количестве
		|из терминала сбора данных (ТСД)?'");
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗагрузитьИзТСД_Выбор", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗагрузитьИзТСД_Выбор(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗагрузитьИзТСДКлиент();
	КонецЕсли;
	
КонецПроцедуры	
&НаКлиенте
Процедура ЗагрузитьИзТСДКлиент()
	
	ОповещенияПриЗагрузкеИзТСД = Новый ОписаниеОповещения("ЗагрузитьИзТСДКлиент_Завершение", ЭтотОбъект);
	ОборудованиеТерминалыСбораДанныхКлиент.НачатьЗагрузкуДанныеИзТСД(ОповещенияПриЗагрузкеИзТСД, УникальныйИдентификатор);
	
КонецПроцедуры
&НаКлиенте
Процедура ЗагрузитьИзТСДКлиент_Завершение(Результат, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		ЗагрузитьИзТСДСервер(Результат);
	КонецЕсли;
	
КонецПроцедуры	
&НаСервере
Процедура ЗагрузитьИзТСДСервер(Результат)
	
	ТаблицаЗагрузкиИзТСД = Новый ТаблицаЗначений();
	ТаблицаЗагрузкиИзТСД.Колонки.Добавить("Штрихкод",	Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(13)));
	ТаблицаЗагрузкиИзТСД.Колонки.Добавить("Количество",	Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный)));
	
	// Гарантируем отсутствие дублей строк по штрихкоду в данных из ТСД
	Для Каждого СтруктураДанных Из Результат Цикл
		НоваяСтрока = ТаблицаЗагрузкиИзТСД.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураДанных);
	КонецЦикла;
	ТаблицаЗагрузкиИзТСД.Свернуть("Штрихкод", "Количество");
	
	// Гарантируем заполненность колонки Штрихкод
	Поиск = Новый Структура("Штрихкод", "");
	МассивСтрок = Объект["Инвентаризация"].НайтиСтроки(Поиск);
	НезаполненныеШтрихкоды = Объект["Инвентаризация"].Выгрузить(МассивСтрок, "Штрихкод");
	ШтрихкодыНеЗаполнены = (НезаполненныеШтрихкоды.Количество() = Объект["Инвентаризация"].Количество());
	Если ШтрихкодыНеЗаполнены Тогда
		ТаблицаОСдляТСД();
	КонецЕсли;
	
	// Дозаполняем существующие строки
	Поиск = Новый Структура("Штрихкод");
	Для Каждого СтрокаТаблицы Из Объект["Инвентаризация"] Цикл
		ЗаполнитьЗначенияСвойств(Поиск, СтрокаТаблицы);
		МассивСтрок = ТаблицаЗагрузкиИзТСД.НайтиСтроки(Поиск);
		Если МассивСтрок.Количество() = 0 Тогда
			Количество = 0;
		Иначе
			Количество = МассивСтрок[0]["Количество"];
			ТаблицаЗагрузкиИзТСД.Удалить(МассивСтрок[0]);
		КонецЕсли;
		
		СтрокаТаблицы["КоличествоФакт"]	= Количество;
		СтрокаТаблицы["СуммаФакт"]		= СтрокаТаблицы["КоличествоФакт"] * СтрокаТаблицы["Цена"];
		РассчитатьНедостачуИзлишекСервер(СтрокаТаблицы);
	КонецЦикла;
	
	// Добавляем новые строки
	Если ТаблицаЗагрузкиИзТСД.Количество() > 0 Тогда
		// Определяем ОС по штрихкодам
		ЗапросОС = Новый Запрос();
		ЗапросОС.УстановитьПараметр("ТЗ", ТаблицаЗагрузкиИзТСД);
		ЗапросОС.Текст = "
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТЗ.Штрихкод		КАК Штрихкод,
		|	ТЗ.Количество	КАК Количество
		|ПОМЕСТИТЬ
		|	ТаблицаЗагрузкиИзТСД
		|ИЗ
		|	&ТЗ	КАК ТЗ
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ШтрихКоды.Объект,
		|		ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))		КАК ОсновноеСредство,
		|	ЕСТЬNULL(ШтрихКоды.ИнвентарныйНомер,
		|		ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка))	КАК ИнвентарныйНомер,
		|	ТаблицаЗагрузкиИзТСД.Штрихкод								КАК Штрихкод,
		|	ТаблицаЗагрузкиИзТСД.Количество								КАК Количество
		|ИЗ
		|	ТаблицаЗагрузкиИзТСД
		|	ЛЕВОЕ СОЕДИНЕНИЕ	РегистрСведений.ШтрихКоды	КАК ШтрихКоды
		|		ПО	ТаблицаЗагрузкиИзТСД.Штрихкод = ШтрихКоды.Штрихкод
		|;";
		ТаблицаОС = ЗапросОС.Выполнить().Выгрузить();
		
		Для Каждого СтрокаТаблицы Из ТаблицаОС Цикл
			НоваяСтрока = Объект["Инвентаризация"].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			НоваяСтрока["КоличествоФакт"] = СтрокаТаблицы["Количество"];
			РассчитатьНедостачуИзлишекСервер(НоваяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры	


&НаСервере
Процедура ВариантФормированияОписи0504087_ИзменитьВариант(НовоеЗначениеВарианта)
	
	ИнвентаризацияСервер.ВариантФормированияОписи_НастроитьВидимостьРеквизитов_ПриИзмененииВарианта(
		ЭтаФорма,
		НовоеЗначениеВарианта);
		
	ИнвентаризацияСервер.ВариантФормированияОписи0504087_РассчитатьПеременныеРеквизиты_ПриИзмененииВарианта(ЭтаФорма, НовоеЗначениеВарианта);
	
	Объект["ВариантФормированияОписи"] = НовоеЗначениеВарианта;
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаКлиенте
Функция ПолучитьПараметрыФормыГрупповогоЗаполненияСтрок(ИмяТабличнойЧасти, КоличествоСтрок) Экспорт
	
	СвязиПараметровВыбора = Новый Структура("Дата, Организация, ИФО");
	ЗаполнитьЗначенияСвойств(СвязиПараметровВыбора, Объект);
	
	СвязиПараметровВыбора.Вставить("СчетГруппа", Объект["Счет"]);
	
	ЗначенияЗаполнения = Новый Структура();
	
	НеиспользуемыеПоля = Новый Массив();
	
	ПараметрыФормы = Новый Структура();
	
	Если ИмяТабличнойЧасти = "Инвентаризация" Тогда
		
		ЗначенияЗаполнения.Вставить("Счет", Объект["Счет"]);
		
		Если Объект["ВариантФормированияОписи"] = 1 Тогда
			// 1. Опись с 2018 г. Счет в таблице (26 знаков)
			
			ЗначенияЗаполнения.Вставить("КПС", Объект["КПС"]);
		Иначе
			// 2. Опись с 2018 г. Счет в таблице (5 знаков)
			// 3. Опись с 2018 г. Счет в таблице (5 знаков). Одна строка - один объект
			
			НеиспользуемыеПоля.Добавить("КПС");
			НеиспользуемыеПоля.Добавить("КФО");
		КонецЕсли;
		
	ИначеЕсли ИмяТабличнойЧасти = "Излишки" ИЛИ ИмяТабличнойЧасти = "Недостачи" Тогда
		
		ЗначенияЗаполнения.Вставить("ИФО", Объект["ИФО"]);
		ЗначенияЗаполнения.Вставить("КПС", Объект["КПС"]);
		
		Если НастройкиДляРаботы["ЕстьСубконтоЦМО"] Тогда
			ЗначенияЗаполнения.Вставить("ЦМО", Объект["ЦМО"]);
		Иначе
			НеиспользуемыеПоля.Добавить("ЦМО");
		КонецЕсли;
		
		НеиспользуемыеПоля.Добавить("Счет");
		НеиспользуемыеПоля.Добавить("КФО");
		НеиспользуемыеПоля.Добавить("КЭК");
		
		Если ИмяТабличнойЧасти = "Излишки" Тогда
			
			СписокВыбора = ВидыДокументовИзлишки;
			
			ВидДокументаПоУмолчанию = ВидДокументаПоУмолчаниюИзлишки;
			
		ИначеЕсли ИмяТабличнойЧасти = "Недостачи" Тогда
			
			СписокВыбора = ВидыДокументовНедостачи;
			
			ВидДокументаПоУмолчанию = ВидДокументаПоУмолчаниюНедостачи
			
		КонецЕсли;
		
		ЗначенияЗаполнения.Вставить("ВидДокумента", ВидДокументаПоУмолчанию);
		
		ПараметрыФормы.Вставить("СписокВыбораВидДокумента", СписокВыбора);
		
	КонецЕсли;
	
	ПараметрыФормы.Вставить("СвязиПараметровВыбора",	СвязиПараметровВыбора);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",		ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("КоличествоСтрок",			КоличествоСтрок);
	ПараметрыФормы.Вставить("НеиспользуемыеПоля",		НеиспользуемыеПоля);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытаФормаГрупповогоЗаполненияСтрок(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТабличнойЧасти = ПараметрыОповещения["ИмяТабличнойЧасти"];
	
	ВыделенныеСтроки = Элементы[ИмяТабличнойЧасти].ВыделенныеСтроки;
	
	ТабличнаяЧасть = Объект[ИмяТабличнойЧасти];
	
	Если ИмяТабличнойЧасти = "Инвентаризация" Тогда
		
		ИзмененаЦена = РезультатВыбора.Свойство("Цена");
		
		ИзмененоКоличествоНеСоответствует = РезультатВыбора.Свойство("КоличествоНеСоответствует");
		
		ЭлементЦены = Элементы["ИнвентаризацияЦена"];
		
		Для Каждого ИдСтроки Из ВыделенныеСтроки Цикл
			СтрокаТаблицы = ТабличнаяЧасть.НайтиПоИдентификатору(ИдСтроки);
			
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РезультатВыбора);
			
			Если ИзмененаЦена Тогда
				РассчитатьЦенуСумму(СтрокаТаблицы, ЭлементЦены);
			КонецЕсли;
			
			Если ИзмененаЦена ИЛИ ИзмененоКоличествоНеСоответствует Тогда
				РассчитатьНедостачуИзлишек(СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ИмяТабличнойЧасти = "Недостачи" ИЛИ ИмяТабличнойЧасти = "Излишки" Тогда
		
		Для Каждого ИдСтроки Из ВыделенныеСтроки Цикл
			СтрокаТаблицы = ТабличнаяЧасть.НайтиПоИдентификатору(ИдСтроки);
			
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РезультатВыбора);
		КонецЦикла;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура КэшироватьСвойстваСчетаУчетаСервер()
	
	ВремСтруктура = Новый Структура("
		|ДатаНачалаДействия,
		|ДатаОкончанияДействия");
	
	Если ЗначениеЗаполнено(Объект.Счет) Тогда
		
		ВремСтруктура = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Счет, "ДатаНачалаДействия,ДатаОкончанияДействия");
		
	КонецЕсли;
	
	КэшСвойстваСчетаУчета = Новый ФиксированнаяСтруктура(ВремСтруктура);
	
КонецПроцедуры

#Область РазбивкаСтрокиИнвентаризацииНФА

&НаКлиенте
Процедура ПослеРазбивкиСтрокиИнвентаризацииНфа(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.ИнвентаризацияСуммаФакт;
	
	ИндексыСтрок = РезультатВыбора;
	
	Для Каждого ИндексСтроки Из ИндексыСтрок Цикл
		СтрокаТаблицы = Объект.Инвентаризация[ИндексСтроки];
		
		РассчитатьЦенуСумму(СтрокаТаблицы, Элемент);
		
		РассчитатьНедостачуИзлишек(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ПроцедурыПодсистемыИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти
