#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>.
// 
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Заполнение информации обработки.
// Интерфейс

Перем ИндексТекущегоОтчетаГруппы;
Перем ПредыдущееИмяРеквизитаГруппы;
Перем ПорядковыйНомерФайла;
Перем СчетчикСтрокДляФайла;
Перем СчетчикСтрокДопРазряд;
Перем СчетчикиПоГруппам;
Перем ПредыдущийКодСтроки;
Перем ДлинаНомераСтроки;

Перем мМассивПакетовКонфигурации Экспорт; //для обновления формата

Функция ПолучитьВерсиюAPI() Экспорт 
	
	Возврат "3.0";
	
КонецФункции

Функция ВерсияОбработки()
	Возврат "1.8.40.10";
КонецФункции

Процедура ЗаполнитьИнформациюОбработки(ДанныеОбработки) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураДанных = СформироватьСтруктуруДанныхЗаполненияИнформации();
	ИнициализацияЗаполненияИнформации(СтруктураДанных);

	
	ДанныеОбработки.Версия = ВерсияОбработки();
	ДанныеОбработки.Вставить("ИДФормата", "BUS_GOV");
	ДанныеОбработки.Вставить("ПолучательОтчетности", "bus.gov.ru");
	ДанныеОбработки.Вставить("ДатаВступления", Дата(2020,01,01));
	
	ДанныеОбработки.НаименованиеПоУмолчанию = НСтр("ru = 'Формат bus.gov.ru 1.7.8.40'");
	ДанныеОбработки.ИнформацияОбОбработке = НСтр("ru = 'Выгрузка для обеспечения интеграции Официального сайта ГМУ (bus.gov.ru) 
													|со смежными системами в формате 1.7.8.40'");
													
	ДанныеОбработки.Справка = ПолучитьМакет("Справка").ПолучитьТекст();
	
	ДанныеОбработки.СпособыОтправки.Добавить("Каталог");
	ДанныеОбработки.СпособыОтправки.Добавить("FTP");
	ДанныеОбработки.СпособыОтправки.Добавить("ЭлектроннаяПочта");
	
	ДанныеОбработки.ВидыОтчетов = СтруктураДанных.ДО.КартаВидовОтчетов.ВыгрузитьКолонку("КодВидаОтчета");
	
КонецПроцедуры	

// Интерфейс
////////////////////////////////////////////////////////////////////////////////
// Служебные

Функция СформироватьСтруктуруДанныхЗаполненияИнформации()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДО",СформироватьСтруктуруДанныхОбработки());  // ДанныеОбработки
	
	Возврат СтруктураДанных;
	
КонецФункции

Процедура ИнициализацияЗаполненияИнформации(СтруктураДанных)
	
	ИнициализацияПравил(СтруктураДанных);
	ПрочитатьКартуВидовОтчетов(СтруктураДанных);
	ЗаполнитьУИДОбработки(СтруктураДанных);
	
КонецПроцедуры	

// Служебные
// Заполнение информации обработки.
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Заполнение таблицы зависимостей.
// Интерфейс

Процедура ЗаполнитьТаблицуЗависимостей(МассивОтчетов, ТаблицаЗависимостей, ДополнительныеНастройкиФормата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураДанных = СформироватьСтруктуруДанныхЗаполненияЗависимостей();
	ИнициализацияЗаполненияЗависимостей(СтруктураДанных);
	
	
	Для Каждого Отчет Из МассивОтчетов Цикл 
		
		ВидОтчетаКод = Отчет.ВидОтчета.Код;
		
		Правило = СтруктураДанных.ДО.КартаВидовОтчетов.Найти(ВидОтчетаКод,"КодВидаОтчета");
		
		Если Правило = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаЗависимости из Правило.Зависимости Цикл
			
			ВидВыбираемогоОтчета = Справочники.ВидыОтчетов.НайтиПоКоду(СтрокаЗависимости);
			
			НоваяСтрока = ТаблицаЗависимостей.Добавить();
			НоваяСтрока.ИсходныйОтчет = Отчет;
			НоваяСтрока.ОтчетнаяФорма = Правило.ИмяПравилПреобразования;
			НоваяСтрока.ВидВыбираемогоОтчета = ВидВыбираемогоОтчета;
			НоваяСтрока.ДанныеДополнительныхОтборовСтруктура = Новый Структура;

			
		КонецЦикла;	
	КонецЦикла;	
	
	
КонецПроцедуры

// Интерфейс
////////////////////////////////////////////////////////////////////////////////
// Служебные

Функция СформироватьСтруктуруДанныхЗаполненияЗависимостей()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДО",СформироватьСтруктуруДанныхОбработки());  // ДанныеОбработки
	
	Возврат СтруктураДанных;
	
КонецФункции

Процедура ИнициализацияЗаполненияЗависимостей(СтруктураДанных)
	
	ИнициализацияПравил(СтруктураДанных);
	ПрочитатьКартуВидовОтчетов(СтруктураДанных);
	ЗаполнитьУИДОбработки(СтруктураДанных);
	
	
КонецПроцедуры	

// Служебные
// Заполнение таблицы зависимостей.
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// формирование файлов отчетов.
// Интерфейс

Процедура СформироватьФайлыОтчетов(ТаблицаДанных, ТаблицаЗависимостей, ДополнительныеНастройкиФормата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураДанных = СформироватьСтруктуруДанныхФормированияФайлов();
	
	СтруктураДанных.ИсходныеДанные.ТаблицаДанных 		= ТаблицаДанных;
	СтруктураДанных.ИсходныеДанные.ТаблицаЗависимостей 	= ТаблицаЗависимостей;
	СтруктураДанных.ИсходныеДанные.ПараметрыВыгрузки 	= ДополнительныеНастройкиФормата;
	
	ИнициализацияФормированияФайлов(СтруктураДанных);
	
	Для Каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл
		
		СтрокаТаблицыДанных.УИДОбработкиФормата = СтруктураДанных.ДО.УИДОбработкиФормата;
		
		СтруктураДанных.ДанныеТекущегоПакета = СтрокаТаблицыДанных;
		РаспределитьОтчетыПоГруппам(СтруктураДанных);
				
		Для Каждого СтрокаГруппы Из СтруктураДанных.ТаблицаГрупп Цикл 
			СтруктураДанных.ТекущаяГруппа = СтрокаГруппы;
			
			ПодготовитьКаталогГруппы(СтруктураДанных);
			ДополнитьГруппуЗависимостями(СтруктураДанных);
			//ЗаполнитьДопДанныеГруппы(СтруктураДанных);
			
			ВыгрузитьФайлыГруппы(СтруктураДанных);
			
			ЗаписатьДанныеГруппыВПакет(СтруктураДанных);
			
		КонецЦикла;	
		
		Попытка
			УдалитьФайлы(СтруктураДанных.ВременныйКаталог,"*"); // Удаление всех временных файлов.
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(СтруктураДанных.ВременныйКаталог); // Удаление самого временного каталога.
	Исключение
	КонецПопытки;
	
	
КонецПроцедуры	

// Интерфейс
////////////////////////////////////////////////////////////////////////////////
// Служебные
// Подготовка

Функция СформироватьСтруктуруДанныхФормированияФайлов()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДО",СформироватьСтруктуруДанныхОбработки());  // ДанныеОбработки
	
	СтруктураДанных.Вставить("ИсходныеДанные",Новый Структура);
	СтруктураДанных.ИсходныеДанные.Вставить("ТаблицаДанных");
	СтруктураДанных.ИсходныеДанные.Вставить("ТаблицаЗависимостей");
	СтруктураДанных.ИсходныеДанные.Вставить("ПараметрыВыгрузки");
	
	СтруктураДанных.Вставить("Параметры", Новый Структура);
	
	СтруктураДанных.Вставить("ВременныйКаталог");
	СтруктураДанных.Вставить("ДанныеТекущегоПакета");
	СтруктураДанных.Вставить("ТекущаяГруппа");
	СтруктураДанных.Вставить("ДокументDOM");
	СтруктураДанных.Вставить("ЗаписьXML");
	СтруктураДанных.Вставить("ПравилоПреобразования");
	СтруктураДанных.Вставить("ДанныеДляПравил",Новый Структура);
	СтруктураДанных.ДанныеДляПравил.Вставить("ОтчетЗаголовка");
	СтруктураДанных.ДанныеДляПравил.Вставить("ДопРеквизитыГруппы");
	СтруктураДанных.ДанныеДляПравил.Вставить("ОтдельныеПоказатели");
	СтруктураДанных.ДанныеДляПравил.Вставить("ТекИФО");
	
	СтруктураДанных.Вставить("ТаблицаГрупп",Новый ТаблицаЗначений);
	СтруктураДанных.ТаблицаГрупп.Колонки.Добавить("Группа",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));
	СтруктураДанных.ТаблицаГрупп.Колонки.Добавить("ИмяПравилПреобразования",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	СтруктураДанных.ТаблицаГрупп.Колонки.Добавить("Каталог",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	СтруктураДанных.ТаблицаГрупп.Колонки.Добавить("МассивОтчетовГруппы");
		
	Возврат СтруктураДанных;
	
КонецФункции

Процедура ИнициализацияФормированияФайлов(СтруктураДанных)
	
	ИнициализацияПравил(СтруктураДанных);
	ПрочитатьКартуВидовОтчетов(СтруктураДанных);
	ПрочитатьПравилаПреобразования(СтруктураДанных);
	ЗаполнитьУИДОбработки(СтруктураДанных);
	
	ПодготовитьВременныйКаталог(СтруктураДанных);
	
КонецПроцедуры

Процедура ПодготовитьВременныйКаталог(СтруктураДанных)
	
	СтруктураДанных.ВременныйКаталог  = ПолучитьИмяВременногоФайла()+ПолучитьРазделительПути();
	СоздатьКаталог(СтруктураДанных.ВременныйКаталог);
	
КонецПроцедуры

// Подготовка
////////////////////////////////////////////////////////////////////////////////
// Подготовка пакета

Процедура РаспределитьОтчетыПоГруппам(СтруктураДанных)
	СтруктураДанных.ТаблицаГрупп.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Отчеты",СтруктураДанных.ДанныеТекущегоПакета.Отчеты.ВыгрузитьКолонку("Отчет"));
	Запрос.УстановитьПараметр("КартаВидовОтчетов",СтруктураДанных.ДО.КартаВидовОтчетов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.ИмяПравилПреобразования,
	|	Таблица.КодВидаОтчета,
	|	Таблица.Группировать
	|ПОМЕСТИТЬ КартаВидовОтчетов
	|ИЗ
	|	&КартаВидовОтчетов КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УниверсальныйРегламентированныйОтчет.Ссылка КАК Отчет,
	|	КартаВидовОтчетов.ИмяПравилПреобразования КАК ПравилоПреобразования,
	|	КартаВидовОтчетов.Группировать КАК Группировать,
	|	ЛОЖЬ КАК Добавлен
	|ИЗ
	|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ КартаВидовОтчетов КАК КартаВидовОтчетов
	|		ПО УниверсальныйРегламентированныйОтчет.ВидОтчета.Код = КартаВидовОтчетов.КодВидаОтчета
	|ГДЕ
	|	УниверсальныйРегламентированныйОтчет.Ссылка В(&Отчеты)";
	ТаблицаСоответствияОтчетовИПравил = Запрос.Выполнить().Выгрузить();
	

	Счетчик = 0;
	Для Каждого СтрокаТаблицыСоответствий из ТаблицаСоответствияОтчетовИПравил Цикл
		Если СтрокаТаблицыСоответствий.Добавлен Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицыСоответствий.Добавлен = Истина;
		Счетчик = Счетчик + 1;
		
		НоваяСтрока = СтруктураДанных.ТаблицаГрупп.Добавить();
		НоваяСтрока.Группа = Счетчик;
		НоваяСтрока.ИмяПравилПреобразования = СтрокаТаблицыСоответствий.ПравилоПреобразования; 
		НоваяСтрока.МассивОтчетовГруппы = Новый Массив;
		НоваяСтрока.МассивОтчетовГруппы.Добавить(СтрокаТаблицыСоответствий.Отчет);
		
		Если СтрокаТаблицыСоответствий.Группировать Тогда 
			
			ОтчетыГруппы = ТаблицаСоответствияОтчетовИПравил.НайтиСтроки(Новый Структура("ПравилоПреобразования,Добавлен",СтрокаТаблицыСоответствий.ПравилоПреобразования,Ложь));
			Для Каждого СтрокаОтчета из ОтчетыГруппы Цикл 
				
				СтрокаОтчета.Добавлен = Истина;
				НоваяСтрока.МассивОтчетовГруппы.Добавить(СтрокаОтчета.Отчет);
				
			КонецЦикла;	
			
		КонецЕсли;
	КонецЦикла;	
	
	
	Для Каждого СтрокаГруппы Из СтруктураДанных.ТаблицаГрупп Цикл 
		Для Каждого ОтчетГруппы Из СтрокаГруппы.МассивОтчетовГруппы Цикл
			
			ОтчетыТекущейГруппы = СтруктураДанных.ДанныеТекущегоПакета.Отчеты.НайтиСтроки(Новый Структура("Отчет",ОтчетГруппы));
			Для Каждого СтрокаОтчета Из ОтчетыТекущейГруппы Цикл
				СтрокаОтчета.Группа = СтрокаГруппы.Группа;
			КонецЦикла;	
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры	

// Подготовка пакета
////////////////////////////////////////////////////////////////////////////////
// Подготовка группы

Процедура ПодготовитьКаталогГруппы(СтруктураДанных)
	
	КаталогГруппы = СтруктураДанных.ВременныйКаталог + Строка(Новый УникальныйИдентификатор) + ПолучитьРазделительПути();
	СоздатьКаталог(КаталогГруппы);
	
	СтруктураДанных.ТекущаяГруппа.Каталог = КаталогГруппы; 
	
КонецПроцедуры	

Процедура ДополнитьГруппуЗависимостями(СтруктураДанных)
	ДанныеТекущейГруппы = СтруктураДанных.ТекущаяГруппа;
	Зависимости = СтруктураДанных.ИсходныеДанные.ТаблицаЗависимостей;
	
	ОтчетыДляДобавления = Новый Массив;
	
	Для Каждого ОтчетГруппы Из ДанныеТекущейГруппы.МассивОтчетовГруппы Цикл
		
		ЗависимостиОтчета = Зависимости.НайтиСтроки(Новый Структура("ИсходныйОтчет,ОтчетнаяФорма", ОтчетГруппы, ДанныеТекущейГруппы.ИмяПравилПреобразования));
		Для Каждого СтрокаЗависимости Из ЗависимостиОтчета Цикл
			
			ОтчетыДляДобавления.Добавить(СтрокаЗависимости.ВыбранныйОтчет);
			
		КонецЦикла;	
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДанныеТекущейГруппы.МассивОтчетовГруппы, ОтчетыДляДобавления, Истина);
	
	
КонецПроцедуры	

// Подготовка группы
////////////////////////////////////////////////////////////////////////////////
// Выгрузка

Функция ЗаполнитьДопРеквизиты(МассивОтчетовГруппы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УниверсальныйРегламентированныйОтчет.Ссылка КАК ДокументОтчет,
		|	ЕСТЬNULL(ЗначенияДополнительныхРеквизитовОтчета.ВидАналитики.Код, &ПустаяСтрока) КАК ДопРеквизитКод,
		|	ЗначенияДополнительныхРеквизитовОтчета.Значение КАК ДопРеквизитЗначение
		|ИЗ
		|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхРеквизитовОтчета КАК ЗначенияДополнительныхРеквизитовОтчета
		|		ПО (ЗначенияДополнительныхРеквизитовОтчета.ЭкземплярОтчета = УниверсальныйРегламентированныйОтчет.Ссылка)
		|ГДЕ
		|	УниверсальныйРегламентированныйОтчет.Ссылка В(&МассивОтчетов)";
	
	Запрос.УстановитьПараметр("МассивОтчетов", МассивОтчетовГруппы);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	ТаблицаДопРеквизитов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДопРеквизитов;
	
КонецФункции

Функция ЗаполнитьОтдельныеПоказатели(МассивОтчетовГруппы)
	
	ИмяРС = "КоличествоСтрокОтчетов";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОтчетов", МассивОтчетовГруппы);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
	
	Если Метаданные.РегистрыСведений.Найти(ИмяРС) = Неопределено Тогда
		//Без РС, старый вариан
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УниверсальныйРегламентированныйОтчет.Ссылка КАК ДокументОтчет,
		|	ЕСТЬNULL(ЗначенияПоказателейОтчетов.Показатель.Код, &ПустаяСтрока) КАК ПоказательКод,
		|	ЗначенияПоказателейОтчетов.Значение КАК ПоказательЗначение
		|ИЗ
		|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейОтчетов КАК ЗначенияПоказателейОтчетов
		|		ПО (ЗначенияПоказателейОтчетов.ЭкземплярОтчета = УниверсальныйРегламентированныйОтчет.Ссылка)
		|ГДЕ
		|	УниверсальныйРегламентированныйОтчет.Ссылка В(&МассивОтчетов)
		|	И ЗначенияПоказателейОтчетов.Индекс = 0";
	
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УниверсальныйРегламентированныйОтчет.Ссылка КАК ДокументОтчет,
		|	УниверсальныйРегламентированныйОтчет.ВидОтчета КАК ВидОтчета
		|ПОМЕСТИТЬ СписокДокументов
		|ИЗ
		|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
		|ГДЕ
		|	УниверсальныйРегламентированныйОтчет.Ссылка В(&МассивОтчетов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокДокументов.ДокументОтчет КАК ДокументОтчет,
		|	ПоказателиОтчетов.Код КАК ПоказательКод,
		|	ВЫБОР
		|		КОГДА ПоказателиОтчетов.ТипЗначения = ЗНАЧЕНИЕ(Перечисление.ТипыЗначенийПоказателейОтчетов.Число)
		|			ТОГДА 0
		|		КОГДА ПоказателиОтчетов.ТипЗначения = ЗНАЧЕНИЕ(Перечисление.ТипыЗначенийПоказателейОтчетов.Строка)
		|			ТОГДА """"
		|		КОГДА ПоказателиОтчетов.ТипЗначения = ЗНАЧЕНИЕ(Перечисление.ТипыЗначенийПоказателейОтчетов.Дата)
		|			ТОГДА &ПустаяДата
		|		КОГДА ПоказателиОтчетов.ТипЗначения = ЗНАЧЕНИЕ(Перечисление.ТипыЗначенийПоказателейОтчетов.Булево)
		|			ТОГДА ЛОЖЬ
		|	КОНЕЦ КАК ПустоеЗначение,
		|	ПоказателиОтчетов.Ссылка КАК Показатель,
		|	0 КАК Индекс
		|ПОМЕСТИТЬ ТабПоказатели
		|ИЗ
		|	СписокДокументов КАК СписокДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
		|		ПО СписокДокументов.ВидОтчета = ПоказателиОтчетов.Владелец
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументОтчет,
		|	Показатель,
		|	Индекс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабПоказатели.ДокументОтчет КАК ДокументОтчет,
		|	ТабПоказатели.ПоказательКод КАК ПоказательКод,
		|	ЕСТЬNULL(ЗначенияПоказателейОтчетов.Значение, ТабПоказатели.ПустоеЗначение) КАК ПоказательЗначение
		|ИЗ
		|	ТабПоказатели КАК ТабПоказатели
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейОтчетов КАК ЗначенияПоказателейОтчетов
		|		ПО ТабПоказатели.ДокументОтчет = ЗначенияПоказателейОтчетов.ЭкземплярОтчета
		|			И ТабПоказатели.Показатель = ЗначенияПоказателейОтчетов.Показатель
		|			И ТабПоказатели.Индекс = ЗначенияПоказателейОтчетов.Индекс";
		
		
	КонецЕсли;
	
	ТаблицаПоказателей = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаПоказателей;
	
КонецФункции

Функция ЗначениеИФОДляОтчета(ОтчетЗаголовка)
	ЕстьБаланс = ОтчетЗаголовка.Метаданные().Реквизиты.Найти("Баланс") <> Неопределено; 
	ТекИФО = ?(ЕстьБаланс,ОтчетЗаголовка["Баланс"],Неопределено);
	Если ТекИФО = Неопределено Тогда
		
		УстановитьБезопасныйРежим(Истина);
	
		Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
			МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
			МассивРазделителей = МодульРаботаВМоделиСервиса.РазделителиКонфигурации();
		Иначе
			МассивРазделителей = Новый Массив;
		КонецЕсли;
		
		Для Каждого ИмяРазделителя Из МассивРазделителей Цикл
			УстановитьБезопасныйРежимРазделенияДанных(ИмяРазделителя, Истина);
		КонецЦикла;
		
		ЕстьИФО = ОтчетЗаголовка.Метаданные().Реквизиты.Найти("ИФО") <> Неопределено;
		Если ЕстьИФО Тогда
			ТекИФО = ?(ЕстьИФО И Вычислить("ПолучитьФункциональнуюОпцию(""ИспользоватьУчетПоИФО"")"),ОтчетЗаголовка["ИФО"],Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекИФО;
КонецФункции

Процедура ВыгрузитьФайлыГруппы(СтруктураДанных)
	
	ИндексТекущегоОтчетаГруппы = 0;
	ПредыдущееИмяРеквизитаГруппы = "";
	
	ПравилоПреобразования = СтруктураДанных.ДО.ПравилаПреобразования.Найти(СтруктураДанных.ТекущаяГруппа.ИмяПравилПреобразования,"КодПравила");
	Если ПравилоПреобразования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтруктураДанных.ПравилоПреобразования = ПравилоПреобразования;
	
	ОткрытьФайлВыгрузки(СтруктураДанных);
	
	ОтчетЗаголовка = СтруктураДанных.ТекущаяГруппа.МассивОтчетовГруппы[0];
	СтруктураДанных.ДанныеДляПравил.ОтчетЗаголовка = ОтчетЗаголовка;
	СтруктураДанных.ДанныеДляПравил.ДопРеквизитыГруппы = ЗаполнитьДопРеквизиты(СтруктураДанных.ТекущаяГруппа.МассивОтчетовГруппы);
	СтруктураДанных.ДанныеДляПравил.ОтдельныеПоказатели = ЗаполнитьОтдельныеПоказатели(СтруктураДанных.ТекущаяГруппа.МассивОтчетовГруппы);
	СтруктураДанных.ДанныеДляПравил.ТекИФО = ЗначениеИФОДляОтчета(ОтчетЗаголовка);
	
	ЗаписатьСодержимоеОтчета(СтруктураДанных);
	ЗакрытьФайлВыгрузки(СтруктураДанных);
	
КонецПроцедуры

Процедура ОткрытьФайлВыгрузки(СтруктураДанных)
	ПравилоПреобразования = СтруктураДанных.ПравилоПреобразования;
	ДокументDOM = Новый ДокументDOM;
	
	ЗаписьXML = Новый ЗаписьУзловDOM;
	ЗаписьXML.Открыть(ДокументDOM);
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	СтруктураДанных.ДокументDOM = ДокументDOM;
	СтруктураДанных.ЗаписьXML = ЗаписьXML;
	
КонецПроцедуры

Процедура ЗаписатьСодержимоеОтчета(СтруктураДанных)
	ЗаписьXML = СтруктураДанных.ЗаписьXML;
	
	// Получение результатов запроса по наборам записей;
	ПравилаПреобразования = СтруктураДанных.ПравилоПреобразования;
	РезультатыЗапросов    = ПолучитьРезультатыЗапросов(СтруктураДанных);
	
	// Для каждого результата - формирование xml-элементов;
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	ТаблицаЭлементов.Колонки.Добавить("КлючЭлемента");
	ТаблицаЭлементов.Колонки.Добавить("Индекс");
	ТаблицаЭлементов.Колонки.Добавить("ПолноеИмя");
	ТаблицаЭлементов.Колонки.Добавить("ТаблицаПолей");
	ТаблицаЭлементов.Колонки.Добавить("Заполнен",Новый ОписаниеТипов("Булево"));
	ТаблицаЭлементов.Колонки.Добавить("Выведен",Новый ОписаниеТипов("Булево"));
	ТаблицаЭлементов.Колонки.Добавить("ИндексОтчетаГруппы",Новый ОписаниеТипов("Число"));
	ТаблицаЭлементов.Колонки.Добавить("ПодчиненныйЭлемент",Новый ОписаниеТипов("Булево"));
	
	ТаблицаЭлементов.Колонки.Добавить("КодСтроки",Новый ОписаниеТипов("Строка"));
	
	ТаблицаЭлементов.Индексы.Добавить("ПолноеИмя");
	
	ЗаполнитьТаблицуЭлементов(ТаблицаЭлементов, РезультатыЗапросов, ПравилаПреобразования, СтруктураДанных);
	
	// Формирование выходного файла в соответствии со структурой.
	ЗаписатьЭлементСтруктуры(ЗаписьXML, ПравилаПреобразования.СтруктураФайла.Строки[0], ТаблицаЭлементов,,,СтруктураДанных);

КонецПроцедуры

Функция ПолучитьРезультатыЗапросов(СтруктураДанных)

	РезультатыЗапросов = Новый Соответствие; // Ключ - имя набора, значение - результат запроса.
	
	МенеджерВременныхТаблиц = СформироватьВременныеТаблицыПоДаннымОтчетов(СтруктураДанных.ТекущаяГруппа.МассивОтчетовГруппы);
	
	Для Каждого НаборЗаписей Из СтруктураДанных.ПравилоПреобразования.НаборыДанных Цикл
		РезультатыЗапросов.Вставить(НаборЗаписей.ИмяНабора, СформироватьРезультатЗапроса(НаборЗаписей, МенеджерВременныхТаблиц, СтруктураДанных));
	КонецЦикла;
	
	Возврат РезультатыЗапросов;

КонецФункции 

Функция СформироватьВременныеТаблицыПоДаннымОтчетов(ЭкземплярыОтчетов)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ЭкземплярыОтчетов", ЭкземплярыОтчетов);
	
	ТекстЗапросаПоДаннымПоказателей("ДанныеПоказателей", "ЭкземплярОтчета,ГруппаРаскрытия,Индекс",ЭкземплярыОтчетов,Запрос);
	Запрос.Выполнить();
	
	Запрос.Текст = ТекстЗапросаПоАналитикеОтчетов("РеквизитыОтчетов", "ЭкземплярОтчета,ГруппаРаскрытия,Индекс,ВидАналитики");
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;

КонецФункции 

Процедура ТекстЗапросаПоДаннымПоказателей(ИмяВременнойТаблицы = "", ПоляИндекса = "", ЭкземплярыОтчетов, Запрос)
	
	ИмяРС = "КоличествоСтрокОтчетов";
	
	Если Метаданные.РегистрыСведений.Найти(ИмяРС) = Неопределено Тогда
		//Без РС, старый вариант
	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета,
		|	ЗначенияПоказателейОтчетов.Показатель,
		|	ЗначенияПоказателейОтчетов.Индекс,
		|	ВЫБОР КОГДА ЗначенияПоказателейОтчетов.Индекс = 0 ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ИтогПоПоказателю,
		|	ЗначенияПоказателейОтчетов.Значение,
		|	ЗначенияПоказателейОтчетов.ЗначениеЧисло,
		|	ЗначенияПоказателейОтчетов.ЗначениеНеограниченнаяСтрока,
		|	ЗначенияПоказателейОтчетов.ПромежуточныйИтог,
		|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета.Организация КАК Организация,
		|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета.ПериодОтчета КАК ПериодОтчета,
		|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета.ВидОтчета КАК ВидОтчета,
		|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета.ВидОтчета.Код КАК КодВидаОтчета,
		|	ЗначенияПоказателейОтчетов.Показатель.ГруппаРаскрытия КАК ГруппаРаскрытия,
		|	ЗначенияПоказателейОтчетов.Показатель.Строка.Код КАК КодСтроки,
		|	ЗначенияПоказателейОтчетов.Показатель.Строка КАК Строка,
		|	ЗначенияПоказателейОтчетов.Показатель.Колонка.Код КАК КодКолонки,
		|	ЗначенияПоказателейОтчетов.Показатель.ТипЗначения КАК ТипЗначения,
		|	ЗначенияПоказателейОтчетов.Показатель.НеограниченнаяДлина КАК НеограниченнаяДлина,
		|	ЗначенияПоказателейОтчетов.Показатель.Код КАК КодПоказателя
		|%ВыражениеВременнойТаблицы%
		|ИЗ
		|	РегистрСведений.ЗначенияПоказателейОтчетов КАК ЗначенияПоказателейОтчетов
		|ГДЕ
		|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета В(&ЭкземплярыОтчетов)
		|%ВыражениеИндексов%";
		
	Иначе
		МассивДокументов = ЭкземплярыОтчетов;
		
		КоличествоСтрокРаскрытия = БюджетнаяОтчетностьСервер.МаксимальноеКоличествоСтрокВГруппахРаскрытия(МассивДокументов);	
	
		ТаблицаДляПустыхЗначений = БюджетнаяОтчетностьСервер.ПолучитьСформированнуюТаблицуДляЗаданногоКоличестваСтрок(КоличествоСтрокРаскрытия);
		
		Запрос.УстановитьПараметр("СформированнаяТаблица",ТаблицаДляПустыхЗначений);
		Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101'));
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УниверсальныйРегламентированныйОтчет.Ссылка КАК ЭкземплярОтчета,
		|	УниверсальныйРегламентированныйОтчет.ВидОтчета КАК ВидОтчета,
		|	УниверсальныйРегламентированныйОтчет.ПериодОтчета КАК ПериодОтчета,
		|	УниверсальныйРегламентированныйОтчет.Организация КАК Организация,
		|	УниверсальныйРегламентированныйОтчет.ВидОтчета.Код КАК КодВидаОтчета
		|ПОМЕСТИТЬ СписокДокументов
		|ИЗ
		|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
		|ГДЕ
		|	УниверсальныйРегламентированныйОтчет.Ссылка В(&ЭкземплярыОтчетов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СписокДокументов.ЭкземплярОтчета КАК ЭкземплярОтчета,
		|	СписокДокументов.ВидОтчета КАК ВидОтчета,
		|	СписокДокументов.КодВидаОтчета КАК КодВидаОтчета,
		|	СписокДокументов.Организация КАК Организация,
		|	СписокДокументов.ПериодОтчета КАК ПериодОтчета,
		|	ПоказателиОтчетов.Ссылка КАК Показатель,
		|	ПоказателиОтчетов.Строка КАК Строка,
		|	ПоказателиОтчетов.Строка.Код КАК КодСтроки,
		|	ПоказателиОтчетов.ГруппаРаскрытия КАК ГруппаРаскрытия,
		|	ПоказателиОтчетов.Код КАК КодПоказателя,
		|	ПоказателиОтчетов.Колонка.Код КАК КодКолонки,
		|	ПоказателиОтчетов.ТипЗначения КАК ТипЗначения,
		|	ПоказателиОтчетов.НеограниченнаяДлина КАК НеограниченнаяДлина,
		|	ВЫБОР
		|		КОГДА ПоказателиОтчетов.ТипЗначения = ЗНАЧЕНИЕ(Перечисление.ТипыЗначенийПоказателейОтчетов.Число)
		|			ТОГДА 0
		|		КОГДА ПоказателиОтчетов.ТипЗначения = ЗНАЧЕНИЕ(Перечисление.ТипыЗначенийПоказателейОтчетов.Строка)
		|			ТОГДА """"
		|		КОГДА ПоказателиОтчетов.ТипЗначения = ЗНАЧЕНИЕ(Перечисление.ТипыЗначенийПоказателейОтчетов.Дата)
		|			ТОГДА &ПустаяДата
		|		КОГДА ПоказателиОтчетов.ТипЗначения = ЗНАЧЕНИЕ(Перечисление.ТипыЗначенийПоказателейОтчетов.Булево)
		|			ТОГДА ЛОЖЬ
		|	КОНЕЦ КАК ПустоеЗначение
		|ПОМЕСТИТЬ ТабПоказатели
		|ИЗ
		|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДокументов КАК СписокДокументов
		|		ПО ПоказателиОтчетов.Владелец = СписокДокументов.ВидОтчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ПоказателиОтчетов.Колонка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ПубличныйИдентификатор))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета КАК ЭкземплярОтчета,
		|	ЗначенияПоказателейОтчетов.Показатель КАК Показатель,
		|	ЗначенияПоказателейОтчетов.Индекс КАК Индекс,
		|	ЗначенияПоказателейОтчетов.Значение КАК Значение,
		|	ЗначенияПоказателейОтчетов.ЗначениеЧисло КАК ЗначениеЧисло,
		|	ЗначенияПоказателейОтчетов.ЗначениеНеограниченнаяСтрока КАК ЗначениеНеограниченнаяСтрока,
		|	ЗначенияПоказателейОтчетов.ПромежуточныйИтог КАК ПромежуточныйИтог
		|ПОМЕСТИТЬ ТабЗначенияПоказателейОтчетов
		|ИЗ
		|	РегистрСведений.ЗначенияПоказателейОтчетов КАК ЗначенияПоказателейОтчетов
		|ГДЕ
		|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета В
		|			(ВЫБРАТЬ
		|				Док.ЭкземплярОтчета
		|			ИЗ
		|				СписокДокументов КАК Док)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СформированнаяТаблица.Индекс КАК Индекс
		|ПОМЕСТИТЬ СформированнаяТаблица
		|ИЗ
		|	&СформированнаяТаблица КАК СформированнаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабПоказатели.ЭкземплярОтчета КАК ЭкземплярОтчета,
		|	ТабПоказатели.Показатель КАК Показатель,
		|	ТабПоказатели.ПустоеЗначение КАК ПустоеЗначение,
		|	СформированнаяТаблица.Индекс КАК Индекс,
		|	ТабПоказатели.ВидОтчета КАК ВидОтчета,
		|	ТабПоказатели.КодВидаОтчета КАК КодВидаОтчета,
		|	ТабПоказатели.Организация КАК Организация,
		|	ТабПоказатели.ПериодОтчета КАК ПериодОтчета,
		|	ТабПоказатели.Строка КАК Строка,
		|	ТабПоказатели.КодСтроки КАК КодСтроки,
		|	ТабПоказатели.ГруппаРаскрытия КАК ГруппаРаскрытия,
		|	ТабПоказатели.КодПоказателя КАК КодПоказателя,
		|	ТабПоказатели.КодКолонки КАК КодКолонки,
		|	ТабПоказатели.ТипЗначения КАК ТипЗначения,
		|	ТабПоказатели.НеограниченнаяДлина КАК НеограниченнаяДлина
		|ПОМЕСТИТЬ ТабПоказателиРаскрытия
		|ИЗ
		|	РегистрСведений.КоличествоСтрокОтчетов КАК КоличествоСтрокОтчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабПоказатели КАК ТабПоказатели
		|		ПО КоличествоСтрокОтчетов.ЭкземплярОтчета = ТабПоказатели.ЭкземплярОтчета
		|			И КоличествоСтрокОтчетов.ГруппаРаскрытия = ТабПоказатели.ГруппаРаскрытия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СформированнаяТаблица КАК СформированнаяТаблица
		|		ПО КоличествоСтрокОтчетов.Количество >= СформированнаяТаблица.Индекс
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабПодготовленныеДанные.ЭкземплярОтчета КАК ЭкземплярОтчета,
		|	ТабПодготовленныеДанные.Показатель КАК Показатель,
		|	ТабПодготовленныеДанные.Индекс КАК Индекс,
		|	ТабПодготовленныеДанные.ИтогПоПоказателю КАК ИтогПоПоказателю,
		|	ТабПодготовленныеДанные.Значение КАК Значение,
		|	ТабПодготовленныеДанные.ЗначениеЧисло КАК ЗначениеЧисло,
		|	ТабПодготовленныеДанные.ЗначениеНеограниченнаяСтрока КАК ЗначениеНеограниченнаяСтрока,
		|	ТабПодготовленныеДанные.ПромежуточныйИтог КАК ПромежуточныйИтог,
		|	ТабПодготовленныеДанные.Организация КАК Организация,
		|	ТабПодготовленныеДанные.ПериодОтчета КАК ПериодОтчета,
		|	ТабПодготовленныеДанные.ВидОтчета КАК ВидОтчета,
		|	ТабПодготовленныеДанные.КодВидаОтчета КАК КодВидаОтчета,
		|	ТабПодготовленныеДанные.ГруппаРаскрытия КАК ГруппаРаскрытия,
		|	ТабПодготовленныеДанные.КодСтроки КАК КодСтроки,
		|	ТабПодготовленныеДанные.Строка КАК Строка,
		|	ТабПодготовленныеДанные.КодКолонки КАК КодКолонки,
		|	ТабПодготовленныеДанные.ТипЗначения КАК ТипЗначения,
		|	ТабПодготовленныеДанные.НеограниченнаяДлина КАК НеограниченнаяДлина,
		|	ТабПодготовленныеДанные.КодПоказателя КАК КодПоказателя
		|%ВыражениеВременнойТаблицы%
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТабПоказатели.ЭкземплярОтчета КАК ЭкземплярОтчета,
		|		ТабПоказатели.Показатель КАК Показатель,
		|		0 КАК Индекс,
		|		ИСТИНА КАК ИтогПоПоказателю,
		|		ЕСТЬNULL(ТабЗначенияПоказателейОтчетов.Значение, ТабПоказатели.ПустоеЗначение) КАК Значение,
		|		ЕСТЬNULL(ТабЗначенияПоказателейОтчетов.ЗначениеЧисло, 0) КАК ЗначениеЧисло,
		|		ЕСТЬNULL(ТабЗначенияПоказателейОтчетов.ЗначениеНеограниченнаяСтрока, """") КАК ЗначениеНеограниченнаяСтрока,
		|		ЕСТЬNULL(ТабЗначенияПоказателейОтчетов.ПромежуточныйИтог, ЛОЖЬ) КАК ПромежуточныйИтог,
		|		ТабПоказатели.Организация КАК Организация,
		|		ТабПоказатели.ПериодОтчета КАК ПериодОтчета,
		|		ТабПоказатели.ВидОтчета КАК ВидОтчета,
		|		ТабПоказатели.КодВидаОтчета КАК КодВидаОтчета,
		|		ТабПоказатели.ГруппаРаскрытия КАК ГруппаРаскрытия,
		|		ТабПоказатели.КодСтроки КАК КодСтроки,
		|		ТабПоказатели.Строка КАК Строка,
		|		ТабПоказатели.КодКолонки КАК КодКолонки,
		|		ТабПоказатели.ТипЗначения КАК ТипЗначения,
		|		ТабПоказатели.НеограниченнаяДлина КАК НеограниченнаяДлина,
		|		ТабПоказатели.КодПоказателя КАК КодПоказателя
		|	ИЗ
		|		ТабПоказатели КАК ТабПоказатели
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТабЗначенияПоказателейОтчетов КАК ТабЗначенияПоказателейОтчетов
		|			ПО ТабПоказатели.Показатель = ТабЗначенияПоказателейОтчетов.Показатель
		|				И ТабПоказатели.ЭкземплярОтчета = ТабЗначенияПоказателейОтчетов.ЭкземплярОтчета
		|				И (ТабЗначенияПоказателейОтчетов.Индекс = 0)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабПоказателиРаскрытия.ЭкземплярОтчета,
		|		ТабПоказателиРаскрытия.Показатель,
		|		ТабПоказателиРаскрытия.Индекс,
		|		ЛОЖЬ,
		|		ЕСТЬNULL(ТабЗначенияПоказателейОтчетов.Значение, ТабПоказателиРаскрытия.ПустоеЗначение),
		|		ЕСТЬNULL(ТабЗначенияПоказателейОтчетов.ЗначениеЧисло, 0),
		|		ЕСТЬNULL(ТабЗначенияПоказателейОтчетов.ЗначениеНеограниченнаяСтрока, """"),
		|		ЕСТЬNULL(ТабЗначенияПоказателейОтчетов.ПромежуточныйИтог, ЛОЖЬ),
		|		ТабПоказателиРаскрытия.Организация,
		|		ТабПоказателиРаскрытия.ПериодОтчета,
		|		ТабПоказателиРаскрытия.ВидОтчета,
		|		ТабПоказателиРаскрытия.КодВидаОтчета,
		|		ТабПоказателиРаскрытия.ГруппаРаскрытия,
		|		ТабПоказателиРаскрытия.КодСтроки,
		|		ТабПоказателиРаскрытия.Строка,
		|		ТабПоказателиРаскрытия.КодКолонки,
		|		ТабПоказателиРаскрытия.ТипЗначения,
		|		ТабПоказателиРаскрытия.НеограниченнаяДлина,
		|		ТабПоказателиРаскрытия.КодПоказателя
		|	ИЗ
		|		ТабПоказателиРаскрытия КАК ТабПоказателиРаскрытия
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТабЗначенияПоказателейОтчетов КАК ТабЗначенияПоказателейОтчетов
		|			ПО ТабПоказателиРаскрытия.Показатель = ТабЗначенияПоказателейОтчетов.Показатель
		|				И ТабПоказателиРаскрытия.ЭкземплярОтчета = ТабЗначенияПоказателейОтчетов.ЭкземплярОтчета
		|				И ТабПоказателиРаскрытия.Индекс = ТабЗначенияПоказателейОтчетов.Индекс) КАК ТабПодготовленныеДанные
		|%ВыражениеИндексов%";
		
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ВыражениеВременнойТаблицы%",?(ПустаяСтрока(ИмяВременнойТаблицы),"","ПОМЕСТИТЬ " + ИмяВременнойТаблицы));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ВыражениеИндексов%",?(ПустаяСтрока(ПоляИндекса),"","ИНДЕКСИРОВАТЬ ПО " + ПоляИндекса));
	
	Запрос.Текст = ТекстЗапроса;

КонецПроцедуры 

Функция ТекстЗапросаПоАналитикеОтчетов(ИмяВременнойТаблицы = "", ПоляИндекса = "")
	
	ИмяРС = "КоличествоСтрокОтчетов";
	
	Если Метаданные.РегистрыСведений.Найти(ИмяРС) = Неопределено Тогда
		//Без РС, старый вариант	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗначенияДополнительныхРеквизитовОтчета.ЭкземплярОтчета КАК ЭкземплярОтчета,
		|	NULL КАК ГруппаРаскрытия,
		|	NULL КАК Индекс,
		|	ЗначенияДополнительныхРеквизитовОтчета.ВидАналитики КАК ВидАналитики,
		|	ЗначенияДополнительныхРеквизитовОтчета.Значение КАК Значение
		|%ВыражениеВременнойТаблицы%
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхРеквизитовОтчета КАК ЗначенияДополнительныхРеквизитовОтчета
		|ГДЕ
		|	ЗначенияДополнительныхРеквизитовОтчета.ЭкземплярОтчета В(&ЭкземплярыОтчетов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АналитикаПоказателей.ЭкземплярОтчета,
		|	АналитикаПоказателей.ГруппаРаскрытия,
		|	АналитикаПоказателей.Индекс,
		|	АналитикаПоказателей.ВидАналитики,
		|	АналитикаПоказателей.Значение
		|ИЗ
		|	РегистрСведений.АналитикаПоказателей КАК АналитикаПоказателей
		|ГДЕ
		|	АналитикаПоказателей.ЭкземплярОтчета В(&ЭкземплярыОтчетов)
		|%ВыражениеИндексов%";
	Иначе
			
		ТекстЗапроса = 	
			"ВЫБРАТЬ
			|	АналитикаПоказателей.ЭкземплярОтчета КАК ЭкземплярОтчета,
			|	АналитикаПоказателей.ГруппаРаскрытия КАК ГруппаРаскрытия,
			|	АналитикаПоказателей.ВидАналитики КАК ВидАналитики,
			|	АналитикаПоказателей.Индекс КАК Индекс,
			|	АналитикаПоказателей.Значение КАК Значение
			|ПОМЕСТИТЬ ТабАналитика
			|ИЗ
			|	РегистрСведений.АналитикаПоказателей КАК АналитикаПоказателей
			|ГДЕ
			|	АналитикаПоказателей.ЭкземплярОтчета В(&ЭкземплярыОтчетов)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ЭкземплярОтчета,
			|	ГруппаРаскрытия,
			|	ВидАналитики,
			|	Индекс
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КоличествоСтрокОтчетов.ЭкземплярОтчета КАК ЭкземплярОтчета,
			|	КоличествоСтрокОтчетов.ГруппаРаскрытия КАК ГруппаРаскрытия,
			|	КоличествоСтрокОтчетов.Количество КАК Количество
			|ПОМЕСТИТЬ КоличествоСтрок
			|ИЗ
			|	РегистрСведений.КоличествоСтрокОтчетов КАК КоличествоСтрокОтчетов
			|ГДЕ
			|	КоличествоСтрокОтчетов.ЭкземплярОтчета В(&ЭкземплярыОтчетов)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Количество
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КоличествоСтрок.ЭкземплярОтчета КАК ЭкземплярОтчета,
			|	КоличествоСтрок.ГруппаРаскрытия КАК ГруппаРаскрытия,
			|	СформированнаяТаблица.Индекс КАК Индекс
			|ПОМЕСТИТЬ КоличествоСтрокДополненное
			|ИЗ
			|	КоличествоСтрок КАК КоличествоСтрок
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СформированнаяТаблица КАК СформированнаяТаблица
			|		ПО КоличествоСтрок.Количество >= СформированнаяТаблица.Индекс
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ГруппаРаскрытия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КоличествоСтрокДополненное.ЭкземплярОтчета КАК ЭкземплярОтчета,
			|	КоличествоСтрокДополненное.ГруппаРаскрытия КАК ГруппаРаскрытия,
			|	КоличествоСтрокДополненное.Индекс КАК Индекс,
			|	ГруппыРаскрытияАналитика.ВидАналитики КАК ВидАналитики,
			|	ГруппыРаскрытияАналитика.ВидАналитики.ПустоеЗначение КАК ПустоеЗначение
			|ПОМЕСТИТЬ СформированныеДанные
			|ИЗ
			|	КоличествоСтрокДополненное КАК КоличествоСтрокДополненное
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыРаскрытия.Аналитика КАК ГруппыРаскрытияАналитика
			|		ПО КоличествоСтрокДополненное.ГруппаРаскрытия = ГруппыРаскрытияАналитика.Ссылка
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ЭкземплярОтчета,
			|	ГруппаРаскрытия,
			|	ВидАналитики,
			|	Индекс
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗначенияДополнительныхРеквизитовОтчета.ЭкземплярОтчета КАК ЭкземплярОтчета,
			|	NULL КАК ГруппаРаскрытия,
			|	NULL КАК Индекс,
			|	ЗначенияДополнительныхРеквизитовОтчета.ВидАналитики КАК ВидАналитики,
			|	ЗначенияДополнительныхРеквизитовОтчета.Значение КАК Значение
			|%ВыражениеВременнойТаблицы%
			|ИЗ
			|	РегистрСведений.ЗначенияДополнительныхРеквизитовОтчета КАК ЗначенияДополнительныхРеквизитовОтчета
			|ГДЕ
			|	ЗначенияДополнительныхРеквизитовОтчета.ЭкземплярОтчета В(&ЭкземплярыОтчетов)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СформированныеДанные.ЭкземплярОтчета,
			|	СформированныеДанные.ГруппаРаскрытия,
			|	СформированныеДанные.Индекс,
			|	СформированныеДанные.ВидАналитики,
			|	ЕСТЬNULL(ТабАналитика.Значение, СформированныеДанные.ПустоеЗначение)
			|ИЗ
			|	СформированныеДанные КАК СформированныеДанные
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТабАналитика КАК ТабАналитика
			|		ПО СформированныеДанные.ЭкземплярОтчета = ТабАналитика.ЭкземплярОтчета
			|			И СформированныеДанные.ГруппаРаскрытия = ТабАналитика.ГруппаРаскрытия
			|			И СформированныеДанные.ВидАналитики = ТабАналитика.ВидАналитики
			|			И СформированныеДанные.Индекс = ТабАналитика.Индекс
			|%ВыражениеИндексов%";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ВыражениеВременнойТаблицы%",?(ПустаяСтрока(ИмяВременнойТаблицы),"","ПОМЕСТИТЬ " + ИмяВременнойТаблицы));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ВыражениеИндексов%",?(ПустаяСтрока(ПоляИндекса),"","ИНДЕКСИРОВАТЬ ПО " + ПоляИндекса));
	
	Возврат ТекстЗапроса;

КонецФункции 

Функция СформироватьРезультатЗапроса(НаборЗаписей, МенеджерВременныхТаблиц, СтруктураДанных)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		
	ТаблицаАналитики = ТаблицаСвойствАналитики(НаборЗаписей.ПоляАналитики.ВыгрузитьКолонку("ВидАналитики"));
	ТаблицаСвойств   = ТаблицаСвойствНабора(НаборЗаписей.СвойстваСтрок.ВыгрузитьКолонку("Свойство"));
	
	ШаблонПоля       = "ВЫРАЗИТЬ(%3%1.Значение КАК %2)";
	ШаблонСоединения = "ЛЕВОЕ СОЕДИНЕНИЕ РеквизитыОтчетов КАК Таблица%1
						|		ПО ДанныеПоказателей.ЭкземплярОтчета = Таблица%1.ЭкземплярОтчета
						|		И Таблица%1.ВидАналитики = &ВидАналитики%1
						|		И ВЫБОР
						|			КОГДА Таблица%1.ГруппаРаскрытия ЕСТЬ NULL ТОГДА
						|				ИСТИНА
						|			ИНАЧЕ
						|				ДанныеПоказателей.ГруппаРаскрытия = Таблица%1.ГруппаРаскрытия
						|					И ДанныеПоказателей.Индекс = Таблица%1.Индекс
						|		  КОНЕЦ";
						
	ШаблонСвойства   = "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Свойства%1
						|	ПО ДанныеПоказателей.Строка = Свойства%1.Объект
						| 	И Свойства%1.Свойство = &Свойство%1";
						
	Описатель = ОписательДобавляемойТаблицы();
	
	ДопУпорядочивание = "";
	
	Для Каждого ПолеАналитики Из НаборЗаписей.ПоляАналитики Цикл
		
		СтрОписание = ТаблицаАналитики.Найти(ПолеАналитики.ВидАналитики, "Код");
		Если СтрОписание = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеПоля = Описатель.ВыбранныеПоля.Добавить();
		ОписаниеПоля.Выражение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,ПолеАналитики.ВидАналитики,СтрОписание.ИмяТипа, "Таблица");
		ОписаниеПоля.Синоним   = ПолеАналитики.ВидАналитики;
		
		ОписаниеСоединения = Описатель.Соединения.Добавить();
		ОписаниеСоединения.Выражение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСоединения,ПолеАналитики.ВидАналитики);
		
		Запрос.УстановитьПараметр("ВидАналитики"+ПолеАналитики.ВидАналитики, СтрОписание.Ссылка);
		
		ДопУпорядочивание = ДопУпорядочивание + "
		|	Таблица%1.Значение,";
		
		ДопУпорядочивание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ДопУпорядочивание,ПолеАналитики.ВидАналитики);
		
	КонецЦикла;
	
	// .
	Для Каждого ПолеСвойства Из НаборЗаписей.СвойстваСтрок Цикл
		
		СтрОписание = ТаблицаСвойств.Найти(ПолеСвойства.Свойство, "Код");
		Если СтрОписание = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		ОписаниеПоля = Описатель.ВыбранныеПоля.Добавить();
		ОписаниеПоля.Выражение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля,ПолеСвойства.Свойство, СтрОписание.ИмяТипа, "Свойства");
		ОписаниеПоля.Синоним   = ПолеСвойства.Свойство;
		
		ОписаниеСоединения = Описатель.Соединения.Добавить();
		ОписаниеСоединения.Выражение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСвойства,ПолеСвойства.Свойство);
		
		Запрос.УстановитьПараметр("Свойство"+ПолеСвойства.Свойство, СтрОписание.Ссылка);
		
	КонецЦикла;
	
	ВыбранныеПоля    = "";
	СоединенияТаблиц = "";
	
	Для Каждого ОписаниеПоля Из Описатель.ВыбранныеПоля Цикл
		ВыбранныеПоля = ВыбранныеПоля + ",
		|" + ОписаниеПоля.Выражение + " КАК " + ОписаниеПоля.Синоним;
	КонецЦикла;
	
	Для Каждого Соединение Из Описатель.Соединения Цикл
		СоединенияТаблиц = СоединенияТаблиц + "
		|" + Соединение.Выражение;
	КонецЦикла;
	
	// .
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеПоказателей.*
	|" + ВыбранныеПоля + "
	|ИЗ
	|	ДанныеПоказателей КАК ДанныеПоказателей
	|" + СоединенияТаблиц;
	
	// Добавление условий отбора
	Условия           = "";
	СчетчикПараметров = 0;
	Для Каждого ЭлементОтбора Из НаборЗаписей.Отбор Цикл
		
		ПозицияТочки = Найти(ЭлементОтбора.ЛевоеЗначение,".");
		Если ПозицияТочки > 0 Тогда
			НачальноеПоле = Лев(ЭлементОтбора.ЛевоеЗначение,ПозицияТочки-1);
		Иначе
			НачальноеПоле = ЭлементОтбора.ЛевоеЗначение;
		КонецЕсли;
		
		ДобавленноеПоле = Описатель.ВыбранныеПоля.Найти(НачальноеПоле, "Синоним");
		Если ДобавленноеПоле <> Неопределено Тогда
			ПолеУсловия = СтрЗаменить(ЭлементОтбора.ЛевоеЗначение, НачальноеПоле, ДобавленноеПоле.Выражение);
		Иначе
			ПолеУсловия = ЭлементОтбора.ЛевоеЗначение;
		КонецЕсли;
		
		ИмяПараметра = "Параметр" + СчетчикПараметров;
		
		Если ЭлементОтбора.ВидСравнения = ВидСравнения.Равно Тогда
			Выражение = " = &" + ИмяПараметра;
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравнения.ВСписке Тогда
			Выражение = " В(&" + ИмяПараметра + ")";
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравнения.НеРавно Тогда
			Выражение = " <> &" + ИмяПараметра;
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравнения.НеВСписке Тогда
			Выражение = " НЕ В(&" + ИмяПараметра + ")";
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравнения.ВИерархии Или ЭлементОтбора.ВидСравнения = ВидСравнения.ВСпискеПоИерархии Тогда
			Выражение = " В ИЕРАРХИИ(&" + ИмяПараметра + ")";
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравнения.НеВИерархии Или ЭлементОтбора.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
			Выражение = " НЕ В ИЕРАРХИИ(&" + ИмяПараметра + ")";
		Иначе
			Выражение = " ЕСТЬ NULL";
		КонецЕсли;
		
		Условия = Условия + " И 
		|	" + ПолеУсловия + Выражение;
		
		Если ЭлементОтбора.ЭтоОбъектИБ Тогда
			ЗначениеПараметра = ВосстановитьЗначениеОтбора(ЭлементОтбора.ПравоеЗначение, СтруктураДанных);
		Иначе
			ЗначениеПараметра = ЭлементОтбора.ПравоеЗначение;
		КонецЕсли;
		
		Запрос.УстановитьПараметр(ИмяПараметра,ЗначениеПараметра);
		СчетчикПараметров = СчетчикПараметров + 1;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(Условия) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|" + Сред(Условия,3);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДопУпорядочивание) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеПоказателей.ЭкземплярОтчета,";
		ТекстЗапроса = ТекстЗапроса + ДопУпорядочивание+"
		|	ДанныеПоказателей.КодСтроки,
		|	ДанныеПоказателей.Индекс";
		
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеПоказателей.ЭкземплярОтчета,
		|	ДанныеПоказателей.КодСтроки,
		|	ДанныеПоказателей.Индекс";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Возврат Запрос.Выполнить();

КонецФункции 

Функция ТаблицаСвойствАналитики(Коды)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АналитикаОтчетов.Код,
	|	АналитикаОтчетов.Ссылка,
	|	АналитикаОтчетов.ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.АналитикаОтчетов КАК АналитикаОтчетов
	|ГДЕ
	|	Код В (&Коды)";
	
	Запрос.УстановитьПараметр("Коды", Коды);
	
	ТаблицаАналитик = Запрос.Выполнить().Выгрузить();
	ТаблицаАналитик.Колонки.Добавить("ИмяТипа");
	ТаблицаАналитик.Колонки.Добавить("СокрКод");
	
	Для Каждого Стр Из ТаблицаАналитик Цикл
		ТипМетаданных = Метаданные.НайтиПоТипу(Стр.ТипЗначения.Типы()[0]);
		
		Если ТипМетаданных <> Неопределено Тогда
			Стр.ИмяТипа = ТипМетаданных.ПолноеИмя();
		Иначе
			Стр.ИмяТипа = "СТРОКА";
		КонецЕсли;
		
		Стр.СокрКод = СокрП(Стр.Код);
	КонецЦикла;
	
	ТаблицаАналитик.Колонки.Удалить("Код");
	ТаблицаАналитик.Колонки.СокрКод.Имя = "Код";
	
	Возврат ТаблицаАналитик;
	
КонецФункции 

Функция ТаблицаСвойствНабора(Коды)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвойстваОбъектов.Код,
	|	СвойстваОбъектов.Ссылка,
	|	СвойстваОбъектов.ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|ГДЕ
	|	СвойстваОбъектов.Код В(&Коды)
	|	И НЕ СвойстваОбъектов.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Коды", Коды);
	
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	ТаблицаСвойств.Колонки.Добавить("ИмяТипа");
	ТаблицаСвойств.Колонки.Добавить("СокрКод");
	
	Для Каждого Стр Из ТаблицаСвойств Цикл
		ТипПВХ = Стр.ТипЗначения.Типы()[0];
		ТипМетаданных = Метаданные.НайтиПоТипу(ТипПВХ);
		
		Если ТипМетаданных <> Неопределено Тогда
			Стр.ИмяТипа = ТипМетаданных.ПолноеИмя();
		Иначе
			Если ТипПВХ = Тип("Строка") Тогда
				Стр.ИмяТипа = "СТРОКА";
			ИначеЕсли ТипПВХ = Тип("Число") Тогда
				Стр.ИмяТипа = "ЧИСЛО";
			КонецЕсли;
		КонецЕсли;
		
		Стр.СокрКод = СокрП(Стр.Код);
	КонецЦикла;
	
	ТаблицаСвойств.Колонки.Удалить("Код");
	ТаблицаСвойств.Колонки.СокрКод.Имя = "Код";
	
	Возврат ТаблицаСвойств;

КонецФункции 

Функция ОписательДобавляемойТаблицы()

	ТаблицаПолей = Новый ТаблицаЗначений;
	ТаблицаПолей.Колонки.Добавить("Выражение");
	ТаблицаПолей.Колонки.Добавить("Синоним");
	
	ТаблицыСоединения = Новый ТаблицаЗначений;
	ТаблицыСоединения.Колонки.Добавить("Выражение");
	ТаблицыСоединения.Колонки.Добавить("ИмяТаблицы");
	
	Описатель = Новый Структура;
	Описатель.Вставить("ВыбранныеПоля", ТаблицаПолей);
	Описатель.Вставить("Соединения"   , ТаблицыСоединения);
	
	Возврат Описатель;

КонецФункции

Функция ВосстановитьЗначениеОтбора(XMLПредставление, СтруктураДанных)

	Если ТипЗнч(XMLПредставление) = Тип("СписокЗначений") Тогда
		Результат = Новый СписокЗначений;
		Для Каждого ЭлементСписка Из XMLПредставление Цикл
			Результат.Добавить(ВосстановитьЗначениеОтбора(ЭлементСписка.Значение,СтруктураДанных));
		КонецЦикла;
	Иначе
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(XMLПредставление);
		             
		ОбъектXDTO = СтруктураДанных.ДО.Сериализатор.ПолучитьФабрикуXDTO().ПрочитатьXML(ЧтениеXML);
		Результат  = СтруктураДанных.ДО.Сериализатор.ПрочитатьXDTO(ОбъектXDTO);
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТаблицуЭлементов(ТаблицаЭлементов, РезультатыЗапросов, ПравилаПреобразования, СтруктураДанных)

	Для Каждого НаборЗаписей Из ПравилаПреобразования.НаборыДанных Цикл
		
		РезультатЗапроса = РезультатыЗапросов[НаборЗаписей.ИмяНабора];
		
		Выборка = РезультатЗапроса.Выбрать();
		
		ОбойтиВыборкуИЗаполнитьШаблоныЭлементов(Выборка, НаборЗаписей, ПравилаПреобразования.КартаСтрок, ТаблицаЭлементов,, СтруктураДанных);
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбойтиВыборкуИЗаполнитьШаблоныЭлементов(Знач Выборка, Знач НаборЗаписей, Знач КартаСтрок, Знач ТаблицаЭлементов, Знач СвернутаяТаблица = Неопределено, СтруктураДанных)
 
	УсловияПоиска = Новый Структура;
	УсловияПоиска.Вставить("ИмяНабораДанных", НаборЗаписей.ИмяНабора);
	
	Если СвернутаяТаблица = Неопределено Тогда
		ЗаданаСверткаПоказателей = НаборЗаписей.ПоляСвертки.Количество() > 0;
		РежимСвернутойТаблицы = Ложь;
	Иначе
		РежимСвернутойТаблицы    = Истина;
		ЗаданаСверткаПоказателей = Не РежимСвернутойТаблицы; // Реальное заполнение таблицы элементов.
	КонецЕсли;
	
	Если РежимСвернутойТаблицы Тогда
		ТаблицаДанных = СвернутаяТаблица.СкопироватьКолонки();
	Иначе
		ТаблицаДанных         = РазвернутаяТаблицаДанных(НаборЗаписей);
		ДобавленныеПоказатели = ",";
	КонецЕсли;
	
	Если РежимСвернутойТаблицы И СвернутаяТаблица.Колонки.Найти("НовыйКодСтроки") <> Неопределено Тогда
		ПолеПривязки = "НовыйКодСтроки";
		РежимПолейГруппировки = Истина;
	Иначе
		ПолеПривязки = "КодСтроки";
		РежимПолейГруппировки = Ложь;
	КонецЕсли;
	
	Пока Выборка.СледующийПоЗначениюПоля("ЭкземплярОтчета") Цикл
		Пока Выборка.СледующийПоЗначениюПоля(ПолеПривязки) Цикл
			
			УсловияПоиска.Вставить("КодСтроки", Выборка.КодСтроки);
			УсловияПоиска.Вставить("КодВидаОтчета", Выборка.КодВидаОтчета);
			
			ЗаполняемыеЭлементы = КартаСтрок.НайтиСтроки(УсловияПоиска);
			
			Если ЗаполняемыеЭлементы.Количество() Тогда
				
				СчетчикЭлементов = 0;
				
				Пока Выборка.СледующийПоЗначениюПоля("Индекс") Цикл // Цикл по строкам раскрытия
					
					ВыполненаПодменаСтроки = Ложь;
					ОригинальнаяСтрока = "";
					Если РежимПолейГруппировки И Выборка.КодСтроки <> УсловияПоиска.КодСтроки Тогда
						ОригинальнаяСтрока = УсловияПоиска.КодСтроки;
						УсловияПоиска.КодСтроки = Выборка.КодСтроки;
						ЗаполняемыеЭлементы = КартаСтрок.НайтиСтроки(УсловияПоиска);
						Если Не ЗаполняемыеЭлементы.Количество() Тогда
							Продолжить;
						КонецЕсли;
						СчетчикЭлементов = 0;
						ВыполненаПодменаСтроки = Истина;
					КонецЕсли;
					
					СтрокаДанных = ТаблицаДанных.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДанных, Выборка);
					
					Если РежимСвернутойТаблицы = Ложь Тогда
						Пока Выборка.Следующий() Цикл // Цикл по показателям
							
							Если Найти(ДобавленныеПоказатели,","+Выборка.КодКолонки+",") = 0 Тогда
								ТаблицаДанных.Колонки.Добавить(Выборка.КодКолонки);
								ДобавленныеПоказатели = ДобавленныеПоказатели + Выборка.КодКолонки + ",";
							КонецЕсли;
							
							Если Выборка.ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Число Тогда
								СтрокаДанных[Выборка.КодКолонки] = Выборка.ЗначениеЧисло;
							ИначеЕсли Выборка.НеограниченнаяДлина Тогда
								СтрокаДанных[Выборка.КодКолонки] = Выборка.ЗначениеНеограниченнаяСтрока;
							Иначе
								СтрокаДанных[Выборка.КодКолонки] = Выборка.Значение;
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
					
					Если Не ЗаданаСверткаПоказателей Тогда
						НовыеСтроки = ЗаполнитьЭлементыСтруктуры(ТаблицаЭлементов, ЗаполняемыеЭлементы, СтрокаДанных, СчетчикЭлементов, СтруктураДанных);
						СчетчикЭлементов = СчетчикЭлементов + 1;
						
						Если ВыполненаПодменаСтроки Тогда
							Копия = ТаблицаЭлементов.Скопировать(НовыеСтроки);
							Для Каждого Стр Из НовыеСтроки Цикл
								ТаблицаЭлементов.Удалить(Стр);
							КонецЦикла;
							
							Для Каждого Стр Из Копия Цикл
								СтрМакс = СтрокаСМаксимальнымЗначением(
									ТаблицаЭлементов.НайтиСтроки(Новый Структура("ПолноеИмя",Стр.ПолноеИмя)),
									"КлючЭлемента");
								Если СтрМакс <> Неопределено Тогда
									ЗаполнитьЗначенияСвойств(СтрМакс, Стр,,"КлючЭлемента");
								КонецЕсли;
									
							КонецЦикла;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Если ЗаданаСверткаПоказателей Тогда
		
		УстановитьБезопасныйРежим(Истина);
	
		Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
			МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
			МассивРазделителей = МодульРаботаВМоделиСервиса.РазделителиКонфигурации();
		Иначе
			МассивРазделителей = Новый Массив;
		КонецЕсли;
		
		Для Каждого ИмяРазделителя Из МассивРазделителей Цикл
			УстановитьБезопасныйРежимРазделенияДанных(ИмяРазделителя, Истина);
		КонецЦикла;
		
		Для Каждого СтрТЧ Из НаборЗаписей.ДополнительныеПоля Цикл
			ТаблицаДанных.Колонки.Добавить(СтрТЧ.ПолеДокумента);
			Для Каждого СтрокаРезультата Из ТаблицаДанных Цикл
				СтрокаРезультата[СтрТЧ.ПолеДокумента] = Вычислить(СтрТЧ.Выражение);
			КонецЦикла;
		КонецЦикла;
		
		// Свернуть таблицу данных
		СвернутьТаблицуДанных(ТаблицаДанных, НаборЗаписей, Сред(ДобавленныеПоказатели,2));
		
		// Перезапустить обход выборки уже по свернутой таблице.
		ИсточникДанныхПостроителя = Новый ОписаниеИсточникаДанных(ТаблицаДанных);
		Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = ИсточникДанныхПостроителя;
		Построитель.Выполнить();
		ВыборкаТЗ = Построитель.Результат.Выбрать();
		
		ОбойтиВыборкуИЗаполнитьШаблоныЭлементов(ВыборкаТЗ, НаборЗаписей, КартаСтрок, ТаблицаЭлементов, ТаблицаДанных, СтруктураДанных);
	
	КонецЕсли;
	
КонецПроцедуры

Функция РазвернутаяТаблицаДанных(Знач НаборДанных)

	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("ЭкземплярОтчета");
	ТаблицаДанных.Колонки.Добавить("Организация");
	ТаблицаДанных.Колонки.Добавить("ПериодОтчета");
	ТаблицаДанных.Колонки.Добавить("КодВидаОтчета");
	ТаблицаДанных.Колонки.Добавить("КодСтроки");
	ТаблицаДанных.Колонки.Добавить("Индекс");
	
	// Поля аналитики
	Для Каждого ПолеАналитики Из НаборДанных.ПоляАналитики Цикл
		ТаблицаДанных.Колонки.Добавить(ПолеАналитики.ВидАналитики);
	КонецЦикла;
	
	// Поля свойств
	Для Каждого ПолеСвойств Из НаборДанных.СвойстваСтрок Цикл
		ТаблицаДанных.Колонки.Добавить(ПолеСвойств.Свойство);
	КонецЦикла;

	Возврат ТаблицаДанных;
	
КонецФункции

Функция СтрокаСМаксимальнымЗначением(Знач Таблица, Знач Графа)

	Если Таблица.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МаксСтрока   = Таблица[0];
	ЗначениеМакс = МаксСтрока[Графа];
	Для Каждого Стр Из Таблица Цикл
		Если Стр[Графа] > ЗначениеМакс Тогда
			МаксСтрока = Стр;
			ЗначениеМакс = Стр[Графа];
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксСтрока;

КонецФункции 

Процедура СвернутьТаблицуДанных(ТаблицаДанных, Знач НаборДанных, Знач ПоляПоказателей)
 
	ОбязательныеПоля = "ЭкземплярОтчета,КодВидаОтчета,КодСтроки";
	ПоляСвертки      = "";
	
	Если Не ПустаяСтрока(НаборДанных.ПоляГруппировки) Тогда
		ПодменитьКодыСтрокВТаблицеДанных(ТаблицаДанных, НаборДанных);
		ОбязательныеПоля = ОбязательныеПоля + ",НовыйКодСтроки";
	КонецЕсли;
	
	Для Каждого ПолеСвертки Из НаборДанных.ПоляСвертки Цикл
		ПоляСвертки = ПоляСвертки + "," + ПолеСвертки.ИмяПоля;
	КонецЦикла;
	
	ТаблицаДанных.Свернуть(ОбязательныеПоля+ПоляСвертки,ПоляПоказателей);
	
	// Восстановление типового состава колонок.
	ЭталоннаяТаблица = РазвернутаяТаблицаДанных(НаборДанных);
	Для Каждого Колонка Из ЭталоннаяТаблица.Колонки Цикл
		ОбеспечитьКолонкуВКоллекции(ТаблицаДанных, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	ТаблицаДанных.Колонки.Добавить("Ключ");
	Для Каждого Стр Из ТаблицаДанных Цикл
		Стр.Ключ = ТаблицаДанных.Индекс(Стр);
	КонецЦикла;
	
	ТаблицаДанных.Индексы.Добавить("Ключ");
	
	// Перенумерация строк
	
	Если ПустаяСтрока(НаборДанных.ПоляГруппировки) Тогда
		ПолеПривязки = "КодСтроки";
	Иначе
		ПолеПривязки = "НовыйКодСтроки";
	КонецЕсли;
	
	ТаблицаДанных.Сортировать("ЭкземплярОтчета,"+ПолеПривязки);
	
	ИсточникДанныхПостроителя = Новый ОписаниеИсточникаДанных(ТаблицаДанных);
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = ИсточникДанныхПостроителя;
	Построитель.Выполнить();
	Выборка = Построитель.Результат.Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("ЭкземплярОтчета") Цикл
		Пока Выборка.СледующийПоЗначениюПоля(ПолеПривязки) Цикл
			Индекс = 0;
			Пока Выборка.Следующий() Цикл
				
				СтрТаблицы = ТаблицаДанных.Найти(Выборка.Ключ,"Ключ");
				СтрТаблицы.Индекс = Индекс;
				
				Индекс = Индекс + 1;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаДанных.Колонки.Удалить("Ключ");
	
КонецПроцедуры

Процедура ПодменитьКодыСтрокВТаблицеДанных(Знач ТаблицаДанных, Знач НаборДанных)

	МассивПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НаборДанных.ПоляГруппировки);
	НовыеКлючиСтрок = Новый ТаблицаЗначений;
	НовыеКлючиСтрок.Колонки.Добавить("ЭкземплярОтчета");
	НовыеКлючиСтрок.Колонки.Добавить("ЧисловойКодСтроки", Новый ОписаниеТипов("Число"));
	
	УсловияПоиска = Новый Структура("ЭкземплярОтчета");
	
	НужноОчиститьКодСтроки = Ложь;
	Для Каждого Поле Из МассивПолей Цикл
		Если Поле = "ОчиститьКодСтроки" Тогда
			НужноОчиститьКодСтроки = Истина;
			Продолжить;
		КонецЕсли;
		
		НовыеКлючиСтрок.Колонки.Добавить(Поле);
		УсловияПоиска.Вставить(Поле);
	КонецЦикла;
	
	ТаблицаДанных.Колонки.Добавить("НовыйКодСтроки");
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		Если НужноОчиститьКодСтроки Тогда
			СтрокаДанных.КодСтроки = "_стр_ХХХ_";
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(УсловияПоиска, СтрокаДанных);
		СтрокиКлючей = НовыеКлючиСтрок.НайтиСтроки(УсловияПоиска);
		
		Если СтрокиКлючей.Количество() Тогда
			СтрокаДанных.НовыйКодСтроки = СтрокиКлючей[0].ЧисловойКодСтроки;
		Иначе
			Стр = НовыеКлючиСтрок.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, УсловияПоиска);
			Стр.ЧисловойКодСтроки = НовыеКлючиСтрок.Количество();
			СтрокаДанных.НовыйКодСтроки = Стр.ЧисловойКодСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбеспечитьКолонкуВКоллекции(Знач Коллекция, Знач ИмяКолонки, Знач ОписаниеТипов = Неопределено) Экспорт

	Если Коллекция.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
		Коллекция.Колонки.Добавить(ИмяКолонки, ОписаниеТипов);
	КонецЕсли;

КонецПроцедуры

Функция ЗаписатьЭлементСтруктуры(Знач ЗаписьXML, Знач ЭлементСтруктуры, Знач ТаблицаЭлементов, Знач ТекущийПуть = "", Знач Режим = -1, СтруктураДанных)

	ЭлементСодержитЗначимыеДанные = Ложь; // Результат функции
	
	Если ПустаяСтрока(ТекущийПуть) Тогда
		ПолноеИмя = ЭлементСтруктуры.Имя;
	Иначе
		ПолноеИмя = ТекущийПуть + "/" + ЭлементСтруктуры.Имя;
	КонецЕсли;
	
	УсловияПоискаЭлементов = Новый Структура("ПолноеИмя",ПолноеИмя);
	
	Если Режим <> -1 Тогда
		Если ЭлементСтруктуры.ПодчиненныйЭлемент Тогда
			УсловияПоискаЭлементов.Вставить("КлючЭлемента", Режим);
		КонецЕсли;
		УсловияПоискаЭлементов.Вставить("ИндексОтчетаГруппы", ИндексТекущегоОтчетаГруппы);
	КонецЕсли;
	
	ЭлементыСЗаданнымИменем = ТаблицаЭлементов.НайтиСтроки(УсловияПоискаЭлементов);
	
	Если ЭлементыСЗаданнымИменем.Количество() = 0 Тогда
		// Элемент, для которого не определен шаблон заполнения
		// и который не является обязательным записывается в отдельный
		// фрагмент DOM, т.к. может не содержать данных на нижних "слоях" иерархии.
		Если ЭлементСтруктуры.Обязательный Тогда
			ЭлементСодержитЗначимыеДанные = ЗаписатьЭлементПоШаблону(ЗаписьXML, ЭлементСтруктуры, Неопределено, ТаблицаЭлементов, ПолноеИмя, Режим, СтруктураДанных);
		Иначе
			
			ЗаписьУзловДОМ = Новый ЗаписьУзловDOM;
			ЗаписьУзловДОМ.Открыть(Новый ДокументDOM);
			
			ЭлементСодержитЗначимыеДанные = ЗаписатьЭлементПоШаблону(ЗаписьУзловДОМ, ЭлементСтруктуры, Неопределено, ТаблицаЭлементов, ПолноеИмя, Режим, СтруктураДанных);
			
			Если ЭлементСодержитЗначимыеДанные Тогда
				// Копирование фрагмента DOM в основной XML-поток.
				ЗаписьDOM = Новый ЗаписьDOM;
				ЗаписьDOM.Записать(ЗаписьУзловДОМ.УзелDOM, ЗаписьXML);
				ЗаписьУзловДОМ.Закрыть();
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Для Каждого ЭлементСЗаданнымИменем Из ЭлементыСЗаданнымИменем Цикл
			
			Если ЭлементыСЗаданнымИменем.Количество() = 1 Тогда
				ТекущийРежим = ?(Режим = -1,0,Режим);
			Иначе // повторяемый элемент
				ТекущийРежим = ЭлементСЗаданнымИменем.КлючЭлемента;
			КонецЕсли;
			
			УсловияПоискаЭлементов.Вставить("КлючЭлемента", ТекущийРежим);
			УсловияПоискаЭлементов.Вставить("Выведен", Ложь);
			
			ЭлементыКЗаписи = ТаблицаЭлементов.НайтиСтроки(УсловияПоискаЭлементов);
			
			Для Каждого ШаблонЭлемента Из ЭлементыКЗаписи Цикл
				Если ШаблонЭлемента.Заполнен ИЛИ ЭлементСтруктуры.Обязательный Тогда
					ТекущийЗаписан = ЗаписатьЭлементПоШаблону(ЗаписьXML, ЭлементСтруктуры, ШаблонЭлемента, ТаблицаЭлементов, ПолноеИмя, ТекущийРежим, СтруктураДанных);
					ЭлементСодержитЗначимыеДанные = ЭлементСодержитЗначимыеДанные ИЛИ ТекущийЗаписан;
					ШаблонЭлемента.Выведен = Истина;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЭлементСодержитЗначимыеДанные;
	
КонецФункции

Функция ЗаписатьЭлементПоШаблону(Знач ЗаписьXML, Знач ЭлементСтруктуры, Знач ШаблонЭлемента, Знач ТаблицаЭлементов, Знач ПолноеИмя, Знач Режим = -1, СтруктураДанных)

	ЗаписаныЗначимыеДанные = Ложь;
	
	Если Не ЭлементПроходитУсловиеПрименимости(ШаблонЭлемента) Тогда
		Возврат ЗаписаныЗначимыеДанные;
	КонецЕсли;
	
	Если ЭлементСтруктуры.Имя = СтруктураДанных.ПравилоПреобразования.СтруктураФайла.Строки[0].Имя Тогда // Корневой элемент.
		ЗаписьXML.ЗаписатьНачалоЭлемента(ЭлементСтруктуры.Имя); // Записан корневой элемент.
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", СтруктураДанных.ДО.URLПространстваИменПравил);
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("t", СтруктураДанных.ДО.URLПространстваИмен_t);
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("b", СтруктураДанных.ДО.URLПространстваИмен_b);
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("f", СтруктураДанных.ДО.URLПространстваИмен_f);
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("ns3", СтруктураДанных.ДО.URLПространстваИмен_ns3);
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("ns4", СтруктураДанных.ДО.URLПространстваИмен_ns4);
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xs", СтруктураДанных.ДО.URLПространстваИмен_xs);
		ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", СтруктураДанных.ДО.URLПространстваИмен_xsi);
		
		//ЗаписьXML.ЗаписатьАтрибут("schemaLocation", СтруктураДанных.ДО.URLПространстваИмен_xsi, СтруктураДанных.ДО.URLПространстваИмен_schemaLocation);
	Иначе
		ПрефиксПространствоИмен = ?(ПустаяСтрока(ЭлементСтруктуры.ПространствоИмен),"",СокрЛП(ЭлементСтруктуры.ПространствоИмен)+":");
		ЗаписьXML.ЗаписатьНачалоЭлемента(ПрефиксПространствоИмен+ЭлементСтруктуры.Имя); // Записан сам элемент
	КонецЕсли;	
	
	Атрибуты = ЭлементСтруктуры.Строки.НайтиСтроки(Новый Структура("ЭтоАтрибут",Истина));
	Для Каждого Атрибут Из Атрибуты Цикл
		Значение = Неопределено;
		ИспользованоПредопределенное = Ложь;
		
		Если ШаблонЭлемента <> Неопределено И ШаблонЭлемента.ТаблицаПолей.Колонки.Найти("ПолеДокумента") <> Неопределено Тогда
			СтрФормула = ШаблонЭлемента.ТаблицаПолей.Найти(Атрибут.Имя,"ПолеДокумента"); // формула атрибута
		Иначе
			СтрФормула = Неопределено;
		КонецЕсли;
		
		Если СтрФормула = Неопределено Или СтрФормула.Результат = Неопределено Тогда // формулы для атрибута нет
			Если ЗначениеЗаполнено(Атрибут.ЗначениеПоУмолчанию) Тогда
				
				Значение = ВычислитьЗначениеПоУмолчанию(Атрибут.ЗначениеПоУмолчанию, ИспользованоПредопределенное, СтруктураДанных);
				
			КонецЕсли;
		ИначеЕсли Не СтрФормула.Результат = Неопределено Тогда
			Значение = СтрФормула.Результат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Значение) Или Атрибут.Обязательный Тогда
			
			Если ЗначениеЗаполнено(Значение) И Не ИспользованоПредопределенное Тогда
				ЗаписаныЗначимыеДанные = Истина;
			Иначе
				// Это обязательный, незаполненный атрибут.
				// Если значение не заполнено, но определено, то запишем само значение.
				Если Значение = Неопределено Или Значение = "" Тогда
					Если СтрФормула <> Неопределено И СокрЛП(СтрФормула.Формула) = "[грНаименПоказ]" Тогда
						Значение = "";
						Если Атрибут.Обязательный Тогда
							ЗаписаныЗначимыеДанные = Истина;
						КонецЕсли;							
					ИначеЕсли СтрФормула <> Неопределено И Лев(СтрФормула.Формула,3) = "[гр" Тогда
						Значение = "0";
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ТипЗнч(Значение) = Тип("Число") Тогда
				Если Цел(Значение) = Значение Тогда
					ФорматнаяСтрока = "ЧЦ=20; ЧДЦ=0; ЧГ=0";
				Иначе	
					ФорматнаяСтрока = "ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0";
				КонецЕсли;
				ЗначениеДляЗаписи = Формат(Значение,ФорматнаяСтрока);
			Иначе
				ЗначениеДляЗаписи = СокрЛП(Значение);
			КонецЕсли;

			//ЗаписьXML.ЗаписатьАтрибут(Атрибут.Имя, XMLСтрока(Значение));
			Если ЗаписаныЗначимыеДанные Тогда
				// Проверка корректрости заполнения значений.
				ПроверкаОбязательногоПоля(ЗначениеДляЗаписи, Атрибут);
				
				ПрефиксПространствоИмен = ?(ПустаяСтрока(Атрибут.ПространствоИмен),"",СокрЛП(Атрибут.ПространствоИмен)+":");
				ЗаписьXML.ЗаписатьНачалоЭлемента(ПрефиксПространствоИмен+Атрибут.Имя); // Записан атрибут
				
				ЗаписьXML.ЗаписатьТекст(ЗначениеДляЗаписи);
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Запись текста
	Если ШаблонЭлемента <> Неопределено И ШаблонЭлемента.ТаблицаПолей.Колонки.Найти("ПолеДокумента") <> Неопределено Тогда
		ФормулаТекст = ШаблонЭлемента.ТаблицаПолей.Найти("#text","ПолеДокумента");
		Если Не ФормулаТекст = Неопределено И ФормулаТекст.Результат <> Неопределено Тогда
			ЗаписьXML.ЗаписатьТекст(СокрЛП(ФормулаТекст.Результат));
			ЗаписаныЗначимыеДанные = Истина;
		ИначеЕсли ЗначениеЗаполнено(ЭлементСтруктуры.ЗначениеПоУмолчанию) Тогда
			ЗаписьXML.ЗаписатьТекст(СокрЛП(ЭлементСтруктуры.ЗначениеПоУмолчанию));
			ЗаписаныЗначимыеДанные = Истина;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ЭлементСтруктуры.ЗначениеПоУмолчанию) Тогда
		// Для элементов, которые содержат значения по умолчанию непосредственно, без соответствия данных.
		ИспользованоПредопределенное = Ложь;
		ВыражениеДляРасчета = ЭлементСтруктуры.ЗначениеПоУмолчанию;
		
		ВычислятьПоКаждомуОтчетуГруппы = Ложь;
		Если Лев(ЭлементСтруктуры.ЗначениеПоУмолчанию,16) = "#ПоКаждомуОтчету" Тогда
			ВыражениеДляРасчета = СокрЛП(Сред(ВыражениеДляРасчета,17));
			Если ПустаяСтрока(ПредыдущееИмяРеквизитаГруппы) Тогда
				ПредыдущееИмяРеквизитаГруппы = ЭлементСтруктуры.Имя;
			ИначеЕсли ПредыдущееИмяРеквизитаГруппы = ЭлементСтруктуры.Имя Тогда
				ИндексТекущегоОтчетаГруппы = ИндексТекущегоОтчетаГруппы+1;	
			КонецЕсли;			
			ВычислятьПоКаждомуОтчетуГруппы = Истина;
		КонецЕсли;
		
		Значение = ВычислитьЗначениеПоУмолчанию(ВыражениеДляРасчета, ИспользованоПредопределенное, СтруктураДанных, ВычислятьПоКаждомуОтчетуГруппы);
		Если ЭлементСтруктуры.Обязательный 
			ИЛИ (НЕ ЭлементСтруктуры.Обязательный И ЗначениеЗаполнено(Значение)) Тогда
			ПроверкаОбязательногоПоля(Значение, ЭлементСтруктуры);
			ЗаписьXML.ЗаписатьТекст(СокрЛП(Значение));
			ЗаписаныЗначимыеДанные = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	// Разбор компонентов элемента.
	Для Каждого ДочернийЭлемент Из ЭлементСтруктуры.Строки.НайтиСтроки(Новый Структура("ЭтоАтрибут",Ложь)) Цикл
		
		ЗаписанТекущий = ЗаписатьЭлементСтруктуры(ЗаписьXML, ДочернийЭлемент, ТаблицаЭлементов, ПолноеИмя, Режим, СтруктураДанных);
		ЗаписаныЗначимыеДанные = ЗаписаныЗначимыеДанные Или ЗаписанТекущий;
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписаныЗначимыеДанные;

КонецФункции

Процедура СформироватьПолноеИмяРекурсивно(Знач ЭлементСтруктуры, ИмяПоля)
	
	Если НЕ ЭлементСтруктуры.Родитель = Неопределено Тогда
		ЭлементРодитель = ЭлементСтруктуры.Родитель;
		ИмяПоля = ""+ЭлементРодитель.Имя+"\"+ИмяПоля;
		СформироватьПолноеИмяРекурсивно(ЭлементРодитель, ИмяПоля);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПроверкаОбязательногоПоля(Знач ЗначениеДляЗаписи, Знач ЭлементСтруктуры)
	ПолеОбязательное = ЭлементСтруктуры.Обязательный;
	Если ПолеОбязательное И ПустаяСтрока(ЗначениеДляЗаписи) Тогда
		
		СпособПолучения = ЭлементСтруктуры.ЗначениеПоУмолчанию;
		ИмяПоля = ЭлементСтруктуры.Имя;
		СформироватьПолноеИмяРекурсивно(ЭлементСтруктуры, ИмяПоля);
		
		СообщениеОбОшибке = НСтр("ru='Значение обязательного элемента %ИмяПоля% не заполнено.
							|Способ получения: %СпособПолучения%'"); 
		СообщениеОбОшибке = СтрЗаменить(СообщениеОбОшибке, "%ИмяПоля%", ИмяПоля); 
		СообщениеОбОшибке = СтрЗаменить(СообщениеОбОшибке, "%СпособПолучения%", СпособПолучения); 
		
		Сообщить(СообщениеОбОшибке,СтатусСообщения.Внимание);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭлементПроходитУсловиеПрименимости(ШаблонЭлемента)

	Если ШаблонЭлемента = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	СтрУсловия = ШаблонЭлемента.ТаблицаПолей.Найти("<УсловиеПрименимости>", "ПолеДокумента");
	Если СтрУсловия <> Неопределено И ТипЗнч(СтрУсловия.Результат) = Тип("Булево") Тогда
		Возврат СтрУсловия.Результат;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция ЗаполнитьЭлементыСтруктуры(ТаблицаЭлементов, ЗаполняемыеЭлементы, СтрокаДанных, Ключ, СтруктураДанных)

	ДобавленныеСтроки = Новый Массив;
	ВыгрузкаГруппыОтчетов = СтруктураДанных.ТекущаяГруппа.МассивОтчетовГруппы.Количество() > 1;
	
	ТекущийКодВидаОтчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанных.ЭкземплярОтчета.ВидОтчета,"Код");
	
	УстановитьБезопасныйРежим(Истина);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		МассивРазделителей = МодульРаботаВМоделиСервиса.РазделителиКонфигурации();
	Иначе
		МассивРазделителей = Новый Массив;
	КонецЕсли;
	
	Для Каждого ИмяРазделителя Из МассивРазделителей Цикл
		УстановитьБезопасныйРежимРазделенияДанных(ИмяРазделителя, Истина);
	КонецЦикла;
	
	Для Каждого ШаблонЭлемента Из ЗаполняемыеЭлементы Цикл
		
		ЭлементЗаполнен = Ложь;
		
		Если ШаблонЭлемента.ТаблицаФормул.Колонки.Найти("ИспользуемыеКоды") = Неопределено Тогда
			ШаблонЭлемента.ТаблицаФормул.Колонки.Добавить("ИспользуемыеКоды");
		КонецЕсли;
		
		ТаблицаРасчета = ШаблонЭлемента.ТаблицаФормул.Скопировать();
		ТаблицаРасчета.Колонки.Добавить("Результат");
		ТаблицаРасчета.Колонки.Удалить("ИспользуемыеКоды");
		
		Для Каждого СтрФормула Из ТаблицаРасчета Цикл
			
			Если ПустаяСтрока(СтрФормула.Формула) Тогда
				Продолжить;
			КонецЕсли;
			
			Формула = СтрФормула.Формула;
			
			Индекс     = ТаблицаРасчета.Индекс(СтрФормула);
			СтрШаблона = ШаблонЭлемента.ТаблицаФормул[Индекс];
			
			Если СтрШаблона.ИспользуемыеКоды = Неопределено Тогда
				ИспользуемыеКоды = БюджетнаяОтчетность.РазобратьОперанды(Формула);
				СтрШаблона.ИспользуемыеКоды = ИспользуемыеКоды;
			Иначе
				ИспользуемыеКоды = СтрШаблона.ИспользуемыеКоды
			КонецЕсли;
			
			Для Каждого Колонка Из ИспользуемыеКоды Цикл
				Код = СокрЛП(Колонка);
				Если СтрокаДанных.Владелец().Колонки.Найти(Код) <> Неопределено Тогда
					Формула = СтрЗаменить(Формула,"["+Код+"]","СтрокаДанных." + Код);
				Иначе
					Формула = СтрЗаменить(Формула,"["+Код+"]","""""");
				КонецЕсли;
			КонецЦикла;
			
			Если Лев(Формула,7) = "#Строка" Тогда
				Формула = СтрЗаменить(Формула,"#Строка","");
				Значение = Вычислить("СокрЛП(Формула)");
				
			ИначеЕсли Лев(Формула,24) = "#СчетчикСтрокГруппыКОСГУ" Тогда
				//#СчетчикСтрокГруппыКОСГУ120 030
				
				ШаблонКОСГУ = Сред(Формула, 25, 3);
				ШаблонСтрокиГруппы = Сред(Формула, 29, 3);
				
				//analyticCode,120
				Если ШаблонКОСГУ <> Лев(СтрокаДанных.СтрКОСГУ,2) + "0" Тогда
					Продолжить;
				КонецЕсли;
				
				ЗначениеСчетчика = СчетчикиПоГруппам.Получить(ШаблонКОСГУ);
				Если ЗначениеСчетчика = Неопределено Тогда
					ЗначениеСчетчика = Число(ШаблонСтрокиГруппы);
				КонецЕсли;
				
				// Если счетчик равен к примеру 039, то номер не повышаем.
				// В остальных случаях увеличиваем номер.
				ЗначениеСчетчика = ?(Прав(ЗначениеСчетчика,1) = 9, ЗначениеСчетчика, ЗначениеСчетчика+1);
				СчетчикиПоГруппам.Вставить(ШаблонКОСГУ, ЗначениеСчетчика);
				
				Значение = Формат(ЗначениеСчетчика, "ЧЦ="+Стрдлина(ШаблонСтрокиГруппы)+"; ЧВН=; ЧГ=0");
				
			ИначеЕсли Лев(Формула,21) = "#СчетчикСтрокДляФайла" Тогда
				Если НЕ ПредыдущийКодСтроки = СтрокаДанных.КодСтроки Тогда
					СчетчикСтрокДляФайла = 0;
				КонецЕсли;
				
				Если СчетчикСтрокДляФайла = 0 Тогда
					ШаблонНомера = СокрЛП(Сред(Формула,22));
					ДлинаНомераСтроки = Стрдлина(ШаблонНомера);
					
					СчетчикСтрокДляФайла = Число(ШаблонНомера)+1;
				Иначе
					СчетчикСтрокДляФайла = СчетчикСтрокДляФайла+1;
				КонецЕсли;	
				
				Значение = Формат(СчетчикСтрокДляФайла, "ЧЦ="+ДлинаНомераСтроки+"; ЧВН=; ЧГ=0");
				ПредыдущийКодСтроки = СтрокаДанных.КодСтроки;
				
			ИначеЕсли Лев(Формула,22) = "#СчетчикСтрокДопРазряд" Тогда
				Если НЕ ПредыдущийКодСтроки = СтрокаДанных.КодСтроки Тогда
					СчетчикСтрокДляФайла = 0;
					СчетчикСтрокДопРазряд = 0;
				КонецЕсли;
				
				Если СчетчикСтрокДляФайла = 0 И СчетчикСтрокДопРазряд = 0 Тогда
					ШаблонНомера = СокрЛП(Сред(Формула,23));
					ДлинаНомераСтроки = Стрдлина(ШаблонНомера);
					
					СчетчикСтрокДляФайла = Число(ШаблонНомера)+1;
					СчетчикСтрокДопРазряд = СчетчикСтрокДопРазряд+1;
				ИначеЕсли СчетчикСтрокДопРазряд = 99 Тогда	
					СчетчикСтрокДляФайла = СчетчикСтрокДляФайла+1;
					СчетчикСтрокДопРазряд = 1;
				Иначе
					СчетчикСтрокДопРазряд = СчетчикСтрокДопРазряд+1;
				КонецЕсли;	
				
				Значение = Формат(СчетчикСтрокДляФайла, "ЧЦ="+ДлинаНомераСтроки+"; ЧВН=; ЧГ=0")+"."+Формат(СчетчикСтрокДопРазряд, "ЧЦ=2; ЧГ=0");
				ПредыдущийКодСтроки = СтрокаДанных.КодСтроки;			
				
			Иначе	
				Попытка
					Значение = Вычислить(Формула);
				Исключение
					Значение = "";
					
					Сообщение = НСтр("ru = 'Ошибка расчета формулы для элемента %1:
	                                 |%2'");
					Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение,ШаблонЭлемента.ЭлементФайла,ОписаниеОшибки()), СтатусСообщения.Внимание);
					
				КонецПопытки;
			КонецЕсли;	
			
			//В формате 1.7.8.32 стало недопустимым использования кириллицы в КОСГУ вида 43х.
			Если СтрФормула.Формула = "[СтрКОСГУ]" Тогда
				Значение = СтрЗаменить(Значение, "Х", "X");
				Значение = СтрЗаменить(Значение, "х", "x");
			КонецЕсли;
			
			СтрФормула.Результат = Значение;
			ЭлементЗаполнен      = ЭлементЗаполнен ИЛИ ЗначениеЗаполнено(Значение);
			
		КонецЦикла;
		
		ИндексОтчетаГруппы = 0;
		Если ВыгрузкаГруппыОтчетов Тогда
			ИндексОтчетаГруппы = СтруктураДанных.ТекущаяГруппа.МассивОтчетовГруппы.Найти(СтрокаДанных.ЭкземплярОтчета);
			Для Каждого ОтчетГруппы Из СтруктураДанных.ТекущаяГруппа.МассивОтчетовГруппы Цикл
				Если ОтчетГруппы.ВидОтчета <> СтрокаДанных.ЭкземплярОтчета.ВидОтчета Тогда
					ИндексОтчетаГруппы = 0;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
			Если ИндексОтчетаГруппы = Неопределено Тогда
				ИндексОтчетаГруппы = 0;
			КонецЕсли;
		КонецЕсли;	
		
		УсловиеГруппировки = Новый Структура;
		УсловиеГруппировки.Вставить("ПолноеИмя", ШаблонЭлемента.ЭлементФайла);
		Если ТекущийКодВидаОтчета = "ПФХД_2019" ИЛИ 
			ТекущийКодВидаОтчета = "ПФХД_2020_04" ИЛИ
			ТекущийКодВидаОтчета = "ПФХД_2021" Тогда
			// Для структуры плана фхд отбор по индексу не нужен
		Иначе
			УсловиеГруппировки.Вставить("Индекс",Ключ);
		КонецЕсли;
		УсловиеГруппировки.Вставить("ИндексОтчетаГруппы",ИндексОтчетаГруппы);
		
		КоличествоСозданныхЭлементов = ТаблицаЭлементов.НайтиСтроки(УсловиеГруппировки).Количество();
		
		СтрЗаполнения = ТаблицаЭлементов.Добавить();
		СтрЗаполнения.КодСтроки = ШаблонЭлемента.КодСтроки;
		
		Если ЗначениеЗаполнено(ШаблонЭлемента.КодСтрокиРодитель) Тогда
			
			СтрЗаполнения.КлючЭлемента = ТаблицаЭлементов[ТаблицаЭлементов.Количество()-2].КлючЭлемента;
			СтрЗаполнения.ПодчиненныйЭлемент = Истина;
			
		ИначеЕсли ЗначениеЗаполнено(ШаблонЭлемента.ПоляПоиска) Тогда
			
			МассивЗначенийОтбора = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ШаблонЭлемента.ЗначенияПоиска,",");
			МассивЗначенийОтбора.Вставить(0,ШаблонЭлемента.ПоляПоиска);
			СтруктураПоиска = Новый (Тип("Структура"),МассивЗначенийОтбора);
			СтруктураПоиска.Вставить("ИндексОтчетаГруппы",ИндексОтчетаГруппы);
			
			НайденныеСтроки = ТаблицаЭлементов.НайтиСтроки(СтруктураПоиска);
			
			Если ЗначениеЗаполнено(ШаблонЭлемента.ПоляПоискаТаблицы) Тогда
				
				МассивЗначенийОтбора = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ШаблонЭлемента.ЗначенияПоискаТаблицы,",");
				МассивЗначенийОтбора.Вставить(0,ШаблонЭлемента.ПоляПоискаТаблицы);
				СтруктураПоискаТаблицы = Новый (Тип("Структура"),МассивЗначенийОтбора);
				
				Для Каждого ТекНайденнаяСтрока Из НайденныеСтроки Цикл
					
					Если ТекНайденнаяСтрока.ТаблицаПолей.НайтиСтроки(Новый Структура("ПолеДокумента,Результат","<УсловиеПрименимости>",Истина)).Количество() Тогда
					
						МассивНайденных = ТекНайденнаяСтрока.ТаблицаПолей.НайтиСтроки(СтруктураПоискаТаблицы);
						Если МассивНайденных.Количество() Тогда
							СтрЗаполнения.КлючЭлемента = ТекНайденнаяСтрока.КлючЭлемента;
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Если НайденныеСтроки.Количество() Тогда
					СтрЗаполнения.КлючЭлемента = НайденныеСтроки[0].КлючЭлемента;
				КонецЕсли;
			КонецЕсли;	
			
			СтрЗаполнения.ПодчиненныйЭлемент = Истина;
		Иначе
			СтрЗаполнения.КлючЭлемента = (КоличествоСозданныхЭлементов*1000);
		КонецЕсли;
		
		СтрЗаполнения.Выведен	   = Ложь;
		СтрЗаполнения.Индекс       = Ключ;
		СтрЗаполнения.ИндексОтчетаГруппы = ИндексОтчетаГруппы;
		
		СтрЗаполнения.ПолноеИмя    = ШаблонЭлемента.ЭлементФайла;
		СтрЗаполнения.ТаблицаПолей = ТаблицаРасчета;
		СтрЗаполнения.Заполнен     = ЭлементЗаполнен;
		
		ДобавленныеСтроки.Добавить(СтрЗаполнения);
		
	КонецЦикла;

	Возврат ДобавленныеСтроки;
	
КонецФункции

Функция ВычислитьЗначениеПоУмолчанию(ВыражениеАтрибута, ЭтоПростоеЗначение, СтруктураДанных, Знач ВычислятьПоКаждомуОтчетуГруппы = Ложь)
	
	// Определение переменных, обращение к которым происходит в конструкторе.
	Если ВычислятьПоКаждомуОтчетуГруппы Тогда
		ДокументОтчет = СтруктураДанных.ТекущаяГруппа.МассивОтчетовГруппы[ИндексТекущегоОтчетаГруппы];
		ТекИФО = ЗначениеИФОДляОтчета(ДокументОтчет);
	Иначе
		ДокументОтчет = СтруктураДанных.ДанныеДляПравил.ОтчетЗаголовка;
		ТекИФО = СтруктураДанных.ДанныеДляПравил.ТекИФО;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("ДокументОтчет", ДокументОтчет); 
	СтрокиДопРеквизиты = СтруктураДанных.ДанныеДляПравил.ДопРеквизитыГруппы.НайтиСтроки(ПараметрыОтбора);
	
	ДопРеквизиты = Новый Структура();
	Для Каждого ДопРеквизитОтчета Из СтрокиДопРеквизиты Цикл
		ДопРеквизитКод = ДопРеквизитОтчета.ДопРеквизитКод;
		Если НЕ ПустаяСтрока(ДопРеквизитКод) Тогда
			ДопРеквизиты.Вставить(ДопРеквизитОтчета.ДопРеквизитКод,ДопРеквизитОтчета.ДопРеквизитЗначение);
		КонецЕсли;	
	КонецЦикла;
	
	СтрокиОтдельныеПоказатели = СтруктураДанных.ДанныеДляПравил.ОтдельныеПоказатели.НайтиСтроки(ПараметрыОтбора);
	ОтдельныеПоказатели = Новый Структура();
	Для Каждого ОтдельныйПоказательОтчета Из СтрокиОтдельныеПоказатели Цикл
		ПоказательКод = ОтдельныйПоказательОтчета.ПоказательКод;
		Если НЕ ПустаяСтрока(ПоказательКод) Тогда
			ОтдельныеПоказатели.Вставить(ОтдельныйПоказательОтчета.ПоказательКод,ОтдельныйПоказательОтчета.ПоказательЗначение);
		КонецЕсли;	
	КонецЦикла;
	
	Если Лев(ВыражениеАтрибута,1) = "=" Тогда
		
		УстановитьБезопасныйРежим(Истина);
	
		Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
			МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
			МассивРазделителей = МодульРаботаВМоделиСервиса.РазделителиКонфигурации();
		Иначе
			МассивРазделителей = Новый Массив;
		КонецЕсли;
		
		Для Каждого ИмяРазделителя Из МассивРазделителей Цикл
			УстановитьБезопасныйРежимРазделенияДанных(ИмяРазделителя, Истина);
		КонецЦикла;
		
		Формула = Сред(ВыражениеАтрибута,2);
		Попытка
			Значение = Вычислить(Формула);
			ЭтоПростоеЗначение = Ложь;
		Исключение
			Значение = "";
			
			Сообщение = НСтр("ru = 'Ошибка расчета формулы для значения по умолчанию %1:
			|%2'");
			Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение,ВыражениеАтрибута,ОписаниеОшибки()), СтатусСообщения.Внимание);
			ЭтоПростоеЗначение = Истина;
		КонецПопытки;
		Возврат Значение;
		
	ИначеЕсли Лев(ВыражениеАтрибута,2) = "\=" Тогда // Это esc для знака равенства.
		ЭтоПростоеЗначение = Истина;
		Возврат Сред(ВыражениеАтрибута,2);
	Иначе
		ЭтоПростоеЗначение = Истина;
		Возврат ВыражениеАтрибута;
	КонецЕсли;
	
КонецФункции

Функция ЗакрытьФайлВыгрузки(СтруктураДанных)
	ЗаписьXML = СтруктураДанных.ЗаписьXML;
	
	ПорядковыйНомерПредставление = Формат(ПорядковыйНомерФайла, "ЧЦ=3; ЧН=000; ЧВН=; ЧГ=0");
	
	КодОтчета = СтруктураДанных.ДанныеДляПравил.ОтчетЗаголовка.ВидОтчета.Код;
	ПериодОтчета = Формат(КонецДня(СтруктураДанных.ДанныеДляПравил.ОтчетЗаголовка.ПериодОтчета.ДатаОкончания) + 1,"ДФ=yyyyMMdd");
	ИмяФайла = КодОтчета+"_"+ПериодОтчета+"_"+ПорядковыйНомерПредставление+".xml";
	
	ПорядковыйНомерФайла = ПорядковыйНомерФайла+1;
	ПолноеИмяФайла = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(СтруктураДанных.ТекущаяГруппа.Каталог) + ИмяФайла;
	
	Если ТипЗнч(ЗаписьXML) = Тип("ЗаписьУзловDOM") Тогда
		
		СтруктураДанных.ДокументDOM.ДобавитьДочерний(ЗаписьXML.УзелDOM);
		
		ЗаписьXML.Закрыть();
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ПолноеИмяФайла, "UTF-8");
		
		ЗаписьDOM = Новый ЗаписьDOM;
		ЗаписьDOM.Записать(СтруктураДанных.ДокументDOM, ЗаписьXML);
		ЗаписьXML.Закрыть();
		
	Иначе
		ЗаписьXML.Закрыть();
	КонецЕсли;
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

// Выгрузка
////////////////////////////////////////////////////////////////////////////////
// Сохранение в архивы

Процедура ЗаписатьДанныеГруппыВПакет(СтруктураДанных)
	
	ИмяАрхива = ПолучитьИмяВременногоФайла("ZIP");
	
	Архив = Новый ЗаписьZipФайла(ИмяАрхива); 
	Архив.Добавить(СтруктураДанных.ТекущаяГруппа.Каталог + "*",РежимСохраненияПутейZIP.НеСохранятьПути);
	Архив.Записать();
	
	НоваяСтрока = СтруктураДанных.ДанныеТекущегоПакета.ФайлыОтчетов.Добавить();
	НоваяСтрока.Группа = СтруктураДанных.ТекущаяГруппа.Группа;
	НоваяСтрока.ДанныеФайлов = Новый ДвоичныеДанные(ИмяАрхива);
	
	УдалитьФайлы(ИмяАрхива);
	
КонецПроцедуры	

// Прочее
// формирование файлов отчетов 
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общие
// Инициализация

Функция СформироватьСтруктуруДанныхОбработки()
	
	ДанныеОбработки = Новый Структура;
	ДанныеОбработки.Вставить("УИДОбработкиФормата");
	ДанныеОбработки.Вставить("ТекстМоделиДанных");
	ДанныеОбработки.Вставить("ТекстОписанияФормата");
	ДанныеОбработки.Вставить("URLПространстваИменПравил");
	ДанныеОбработки.Вставить("URLПространстваИмен_t");
	ДанныеОбработки.Вставить("URLПространстваИмен_b");
	ДанныеОбработки.Вставить("URLПространстваИмен_f");
	ДанныеОбработки.Вставить("URLПространстваИмен_ns3");
	ДанныеОбработки.Вставить("URLПространстваИмен_ns4");
	ДанныеОбработки.Вставить("URLПространстваИмен_xs");
	ДанныеОбработки.Вставить("URLПространстваИмен_xsi");
	ДанныеОбработки.Вставить("URLПространстваИмен_schemaLocation");
	
	ДанныеОбработки.Вставить("ФабрикаОбъектов");
	ДанныеОбработки.Вставить("Сериализатор");
	ДанныеОбработки.Вставить("XDTOОписаниеПравил");
	ДанныеОбработки.Вставить("XDTOКартаВидовОтчетов");
	
	ДанныеОбработки.Вставить("КартаВидовОтчетов", Новый ТаблицаЗначений);
	ДанныеОбработки.КартаВидовОтчетов.Колонки.Добавить("ИмяПравилПреобразования", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ДанныеОбработки.КартаВидовОтчетов.Колонки.Добавить("КодВидаОтчета", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ДанныеОбработки.КартаВидовОтчетов.Колонки.Добавить("Группировать",Новый ОписаниеТипов("Булево"));
	ДанныеОбработки.КартаВидовОтчетов.Колонки.Добавить("Зависимости",Новый ОписаниеТипов("Массив"));
	
	ДанныеОбработки.Вставить("ПравилаПреобразования", Новый ТаблицаЗначений);
	ДанныеОбработки.ПравилаПреобразования.Колонки.Добавить("КодПравила");
	ДанныеОбработки.ПравилаПреобразования.Колонки.Добавить("НаборыДанных",Новый ОписаниеТипов("ТаблицаЗначений"));
	ДанныеОбработки.ПравилаПреобразования.Колонки.Добавить("КартаСтрок",Новый ОписаниеТипов("ТаблицаЗначений"));
	ДанныеОбработки.ПравилаПреобразования.Колонки.Добавить("СтруктураФайла",Новый ОписаниеТипов("ДеревоЗначений"));
	
	
	ДанныеОбработки.Вставить("ШаблонТаблицыНаборыДанных",Новый ТаблицаЗначений);
	ДанныеОбработки.ШаблонТаблицыНаборыДанных.Колонки.Добавить("ИмяНабора");
	ДанныеОбработки.ШаблонТаблицыНаборыДанных.Колонки.Добавить("Отбор",Новый ОписаниеТипов("ТаблицаЗначений"));
	ДанныеОбработки.ШаблонТаблицыНаборыДанных.Колонки.Добавить("ПоляАналитики",Новый ОписаниеТипов("ТаблицаЗначений"));
	ДанныеОбработки.ШаблонТаблицыНаборыДанных.Колонки.Добавить("ПоляСвертки",Новый ОписаниеТипов("ТаблицаЗначений"));
	ДанныеОбработки.ШаблонТаблицыНаборыДанных.Колонки.Добавить("ПоляГруппировки");
	ДанныеОбработки.ШаблонТаблицыНаборыДанных.Колонки.Добавить("СвойстваСтрок",Новый ОписаниеТипов("ТаблицаЗначений"));
	ДанныеОбработки.ШаблонТаблицыНаборыДанных.Колонки.Добавить("Порядок",Новый ОписаниеТипов("ТаблицаЗначений"));
	ДанныеОбработки.ШаблонТаблицыНаборыДанных.Колонки.Добавить("ДополнительныеПоля",Новый ОписаниеТипов("ТаблицаЗначений"));
	
	ДанныеОбработки.Вставить("ШаблонТаблицыОтбор", Новый ТаблицаЗначений);
	ДанныеОбработки.ШаблонТаблицыОтбор.Колонки.Добавить("ЛевоеЗначение");
	ДанныеОбработки.ШаблонТаблицыОтбор.Колонки.Добавить("ВидСравнения");
	ДанныеОбработки.ШаблонТаблицыОтбор.Колонки.Добавить("ПравоеЗначение");
	ДанныеОбработки.ШаблонТаблицыОтбор.Колонки.Добавить("ЭтоОбъектИБ", Новый ОписаниеТипов("Булево"));
	
	ДанныеОбработки.Вставить("ШаблонТаблицыПоляАналитики", Новый ТаблицаЗначений);
	ДанныеОбработки.ШаблонТаблицыПоляАналитики.Колонки.Добавить("ВидАналитики");
	
	ДанныеОбработки.Вставить("ШаблонТаблицыПоляСвертки", Новый ТаблицаЗначений);
	ДанныеОбработки.ШаблонТаблицыПоляСвертки.Колонки.Добавить("ИмяПоля");
	
	ДанныеОбработки.Вставить("ШаблонТаблицыСвойстваСтрок", Новый ТаблицаЗначений);
	ДанныеОбработки.ШаблонТаблицыСвойстваСтрок.Колонки.Добавить("Свойство");
	
	ДанныеОбработки.Вставить("ШаблонТаблицыПорядок",Новый ТаблицаЗначений);
	ДанныеОбработки.ШаблонТаблицыПорядок.Колонки.Добавить("Направление");
	ДанныеОбработки.ШаблонТаблицыПорядок.Колонки.Добавить("Поле");
	
	ДанныеОбработки.Вставить("ШаблонТаблицыКартаСтрок", Новый ТаблицаЗначений);
	ДанныеОбработки.ШаблонТаблицыКартаСтрок.Колонки.Добавить("ИмяНабораДанных");
	ДанныеОбработки.ШаблонТаблицыКартаСтрок.Колонки.Добавить("КодВидаОтчета");
	ДанныеОбработки.ШаблонТаблицыКартаСтрок.Колонки.Добавить("КодСтроки");
	ДанныеОбработки.ШаблонТаблицыКартаСтрок.Колонки.Добавить("ПоляПоиска");
	ДанныеОбработки.ШаблонТаблицыКартаСтрок.Колонки.Добавить("ЗначенияПоиска");
	ДанныеОбработки.ШаблонТаблицыКартаСтрок.Колонки.Добавить("ПоляПоискаТаблицы");
	ДанныеОбработки.ШаблонТаблицыКартаСтрок.Колонки.Добавить("ЗначенияПоискаТаблицы");
	ДанныеОбработки.ШаблонТаблицыКартаСтрок.Колонки.Добавить("КодСтрокиРодитель");
	ДанныеОбработки.ШаблонТаблицыКартаСтрок.Колонки.Добавить("ЭлементФайла");
	ДанныеОбработки.ШаблонТаблицыКартаСтрок.Колонки.Добавить("ТаблицаФормул");
	
	ДанныеОбработки.Вставить("ШаблонТаблицыТаблицаФормул", Новый ТаблицаЗначений);
	ДанныеОбработки.ШаблонТаблицыТаблицаФормул.Колонки.Добавить("ПолеДокумента");
	ДанныеОбработки.ШаблонТаблицыТаблицаФормул.Колонки.Добавить("Формула");
	
	ДанныеОбработки.Вставить("ШаблонСтруктураФайла", Новый ДеревоЗначений);
	ДанныеОбработки.ШаблонСтруктураФайла.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	ДанныеОбработки.ШаблонСтруктураФайла.Колонки.Добавить("ЗначениеПоУмолчанию", Новый ОписаниеТипов("Строка"));
	ДанныеОбработки.ШаблонСтруктураФайла.Колонки.Добавить("ЭтоАтрибут"  , Новый ОписаниеТипов("Булево"));
	ДанныеОбработки.ШаблонСтруктураФайла.Колонки.Добавить("Обязательный", Новый ОписаниеТипов("Булево"));
	ДанныеОбработки.ШаблонСтруктураФайла.Колонки.Добавить("ПространствоИмен", Новый ОписаниеТипов("Строка"));
	ДанныеОбработки.ШаблонСтруктураФайла.Колонки.Добавить("ПодчиненныйЭлемент", Новый ОписаниеТипов("Булево"));

	ДанныеОбработки.Вставить("ШаблонТаблицыДополнительныеПоля",Новый ТаблицаЗначений);
	ДанныеОбработки.ШаблонТаблицыДополнительныеПоля.Колонки.Добавить("ПолеДокумента");
	ДанныеОбработки.ШаблонТаблицыДополнительныеПоля.Колонки.Добавить("Выражение");
	
	Возврат ДанныеОбработки;  
КонецФункции

Процедура ИнициализацияПравил(СтруктураДанных)
	
	СтруктураДанных.ДО.ТекстМоделиДанных = ПолучитьМакет("СхемаДанных").ПолучитьТекст();
	СтруктураДанных.ДО.ТекстОписанияФормата = ПолучитьМакет("ОписаниеФормата").ПолучитьТекст();
	СтруктураДанных.ДО.URLПространстваИменПравил = "http://bus.gov.ru/external/1";
	СтруктураДанных.ДО.URLПространстваИмен_t	 = "http://bus.gov.ru/types/1";
	СтруктураДанных.ДО.URLПространстваИмен_b	 = "http://bus.gov.ru/types/2";
	СтруктураДанных.ДО.URLПространстваИмен_f     = "http://bus.gov.ru/types/3";
	СтруктураДанных.ДО.URLПространстваИмен_ns3	 = "http://bus.gov.ru/fk/1";
	СтруктураДанных.ДО.URLПространстваИмен_ns4	 = "http://bus.gov.ru/nsi/1";
	СтруктураДанных.ДО.URLПространстваИмен_xs	 = "http://www.w3.org/2001/XMLSchema";
	СтруктураДанных.ДО.URLПространстваИмен_xsi	 = "http://www.w3.org/2001/XMLSchema-instance";
	СтруктураДанных.ДО.URLПространстваИмен_schemaLocation = "http://bus.gov.ru/public/schema/TFF-1.7.8/External.xsd";
	
	СоздатьФабрикуОбъектов(СтруктураДанных);
	ИнициализацияСериализатора(СтруктураДанных);
	ПрочитатьXMLОписаниеПравил(СтруктураДанных);
	
КонецПроцедуры	

Процедура СоздатьФабрикуОбъектов(СтруктураДанных)
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(СтруктураДанных.ДО.ТекстМоделиДанных);
	
	МодельXDTO = ФабрикаXDTO.ПрочитатьXML(Чтение, ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/xdto","Model"));
	
	Если мМассивПакетовКонфигурации = Неопределено Тогда
		ИменаПакетов = Новый Массив;
		ИменаПакетов.Добавить("http://v8.1c.ru/8.1/data/enterprise/current-config");
		
		Для Каждого Пакет Из ФабрикаXDTO.Пакеты Цикл
			ИменаПакетов.Добавить(Пакет.URIПространстваИмен);
		КонецЦикла;
			
		МодельКонфигурации = ФабрикаXDTO.ЭкспортМоделиXDTO(ИменаПакетов);
		
		МассивПакетовКонфигурации = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(МодельКонфигурации.package);
	Иначе
		МассивПакетовКонфигурации = мМассивПакетовКонфигурации;
	КонецЕсли;
	
	Для Каждого ПакетКонфигурации Из МассивПакетовКонфигурации Цикл 
		
		МодельXDTO.package.Добавить(ПакетКонфигурации);
		
	КонецЦикла;
	
	СтруктураДанных.ДО.ФабрикаОбъектов = Новый ФабрикаXDTO(МодельXDTO, ФабрикаXDTO.Пакеты);
	
КонецПроцедуры

Процедура ИнициализацияСериализатора(СтруктураДанных)
	
	ДиспетчерСериализации = Обработки.ДиспетчерСериализации.Создать();
	ДиспетчерСериализации.Инициализация();
	ДиспетчерСериализации.УстановитьФабрикуXDTO(СтруктураДанных.ДО.ФабрикаОбъектов);
	СтруктураДанных.ДО.Сериализатор = ДиспетчерСериализации;
	
КонецПроцедуры

Процедура ПрочитатьXMLОписаниеПравил(СтруктураДанных)
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(СтруктураДанных.ДО.ТекстОписанияФормата);
	Чтение.ПерейтиКСодержимому();
	Чтение.Прочитать();
	
	XDTOТип = СтруктураДанных.ДО.ФабрикаОбъектов.Тип(СтруктураДанных.ДО.URLПространстваИменПравил,"КартаВидовОтчета"); 
	СтруктураДанных.ДО.XDTOКартаВидовОтчетов = СтруктураДанных.ДО.ФабрикаОбъектов.ПрочитатьXML(Чтение, XDTOТип);
	
	XDTOТип = СтруктураДанных.ДО.ФабрикаОбъектов.Тип(СтруктураДанных.ДО.URLПространстваИменПравил,"ПравилаПреобразования"); 
	СтруктураДанных.ДО.XDTOОписаниеПравил = СтруктураДанных.ДО.ФабрикаОбъектов.ПрочитатьXML(Чтение, XDTOТип);
	
КонецПроцедуры

Процедура ПрочитатьКартуВидовОтчетов(СтруктураДанных)

	Для Каждого СтрокаКарты Из СтруктураДанных.ДО.XDTOКартаВидовОтчетов.Запись Цикл
		СтрокаТаблицы = СтруктураДанных.ДО.КартаВидовОтчетов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаКарты);
		
		Для Каждого СтрокаЗависимости из СтрокаКарты.Зависимости Цикл 
			СтрокаТаблицы.Зависимости.Добавить(СтрокаЗависимости);
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ПрочитатьПравилаПреобразования(СтруктураДанных)

	Для Каждого Правило Из СтруктураДанных.ДО.XDTOОписаниеПравил.Правило Цикл
		
		СтрПравила = СтруктураДанных.ДО.ПравилаПреобразования.Добавить();
		СтрПравила.КодПравила = Правило.КодПравила;
		
		ПрочитатьНаборыДанных(СтрПравила, Правило.НаборДанных, СтруктураДанных);
		ПрочитатьКартуСтрок(СтрПравила, Правило.КартаСтрок, СтруктураДанных);
		ПрочитатьСтруктуруФайла(СтрПравила, Правило.СтруктураФайла, СтруктураДанных);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьНаборыДанных(СтрПравила, НаборыДанных,СтруктураДанных)
	
	СтрПравила.НаборыДанных = СтруктураДанных.ДО.ШаблонТаблицыНаборыДанных.СкопироватьКолонки();
	
	Для Каждого Набор Из НаборыДанных Цикл
		
		СтрНабора = СтрПравила.НаборыДанных.Добавить();
		СтрНабора.ИмяНабора = Набор.ИмяНабора;
		
		СтрНабора.Отбор = СтруктураДанных.ДО.ШаблонТаблицыОтбор.СкопироватьКолонки();
		Для Каждого ЭлементОтбора Из Набор.Отбор Цикл
			СтрОтбор = СтрНабора.Отбор.Добавить();
			СтрОтбор.ЛевоеЗначение = ЭлементОтбора.ЛевоеЗначение;
			СтрОтбор.ВидСравнения  = ЭлементОтбора.ВидСравнения;
			СтрОтбор.ПравоеЗначение = СериализаторXDTO.ПрочитатьXDTO(ЭлементОтбора.ПолучитьXDTO("ПравоеЗначение"));
			СтрОтбор.ЭтоОбъектИБ = ЭлементОтбора.ЭтоОбъектИБ;
		КонецЦикла;
		
		СтрНабора.ПоляАналитики = СтруктураДанных.ДО.ШаблонТаблицыПоляАналитики.СкопироватьКолонки();
		Для Каждого КодВидаАналитики Из Набор.ПолеАналитики Цикл
			СтрАналитика = СтрНабора.ПоляАналитики.Добавить();
			СтрАналитика.ВидАналитики = КодВидаАналитики;
		КонецЦикла;
		
		СтрНабора.ПоляСвертки = СтруктураДанных.ДО.ШаблонТаблицыПоляСвертки.СкопироватьКолонки();
		Для Каждого ПолеСвертки Из Набор.ПолеСвертки Цикл
			СтрПоле = СтрНабора.ПоляСвертки.Добавить();
			СтрПоле.ИмяПоля = ПолеСвертки;
		КонецЦикла;
		
		СтрНабора.СвойстваСтрок = СтруктураДанных.ДО.ШаблонТаблицыСвойстваСтрок.СкопироватьКолонки();
		Для Каждого Свойство Из Набор.СвойствоСтроки Цикл
			СтрСвойство = СтрНабора.СвойстваСтрок.Добавить();
			СтрСвойство.Свойство = Свойство;
		КонецЦикла;
		
		СтрНабора.Порядок = СтруктураДанных.ДО.ШаблонТаблицыПорядок.СкопироватьКолонки();
		Для Каждого ЭлементСортировки Из Набор.Порядок Цикл
			СтрПорядок = СтрНабора.Порядок.Добавить();
			СтрПорядок.Направление = ЭлементСортировки.Направление;
			СтрПорядок.Поле        = ЭлементСортировки.Поле;
		КонецЦикла;
		
		СтрНабора.ПоляГруппировки = Набор.ПоляГруппировки;
		
		СтрНабора.ДополнительныеПоля = СтруктураДанных.ДО.ШаблонТаблицыДополнительныеПоля.СкопироватьКолонки();
		Для Каждого ЭлементСортировки Из Набор.ДополнительныеПоля Цикл
			СтрПорядок = СтрНабора.ДополнительныеПоля.Добавить();
			СтрПорядок.ПолеДокумента = ЭлементСортировки.ПолеДокумента;
			СтрПорядок.Выражение     = ЭлементСортировки.Выражение;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура ПрочитатьКартуСтрок(СтрПравила, КартаСтрок,СтруктураДанных)
	
	СтрПравила.КартаСтрок =  СтруктураДанных.ДО.ШаблонТаблицыКартаСтрок.СкопироватьКолонки();
	
	Для Каждого ЗаписьКарты Из КартаСтрок.Запись Цикл
		
		СтрокаКарты = СтрПравила.КартаСтрок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКарты, ЗаписьКарты);
		СтрокаКарты.ТаблицаФормул = СтруктураДанных.ДО.ШаблонТаблицыТаблицаФормул.СкопироватьКолонки();
		
		Для Каждого ОписаниеФормулы Из ЗаписьКарты.Формула Цикл
			СтрФормула = СтрокаКарты.ТаблицаФормул.Добавить();
			СтрФормула.ПолеДокумента = ОписаниеФормулы.ПолеДокумента;
			СтрФормула.Формула = ОписаниеФормулы.Выражение;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьСтруктуруФайла(СтрПравила, СтруктураФайла,СтруктураДанных)
	
	СтрПравила.СтруктураФайла = СтруктураДанных.ДО.ШаблонСтруктураФайла.Скопировать(); 	
	ЗаполнитьСтрокуСтруктурыФайла(СтрПравила.СтруктураФайла.Строки, СтруктураФайла);

КонецПроцедуры

Процедура ЗаполнитьСтрокуСтруктурыФайла(Строки, СтруктураФайла)
	
	СтрокаДерева = Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, СтруктураФайла);
	
	Для Каждого Элемент Из СтруктураФайла.Элемент Цикл
		ЗаполнитьСтрокуСтруктурыФайла(СтрокаДерева.Строки, Элемент);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьУИДОбработки(СтруктураДанных)
	
	СтруктураДанных.ДО.УИДОбработкиФормата = "611be752-b137-47c3-971d-651e7cf5579d";
	
КонецПроцедуры	

// Инициализация
// Общие
////////////////////////////////////////////////////////////////////////////////
ИндексТекущегоОтчетаГруппы = 0;
ПредыдущееИмяРеквизитаГруппы = "";
ПорядковыйНомерФайла = 0;
СчетчикСтрокДляФайла = 0;
СчетчикСтрокДопРазряд = 0;
ПредыдущийКодСтроки = "";
ДлинаНомераСтроки = 0;
СчетчикиПоГруппам = Новый Соответствие;

#КонецЕсли