
#Область ОписаниеПеременных

&НаКлиенте
Перем ФормаЗакрывается; 

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаАктуальности = Параметры.ДатаАктуальности;
	Бюджет			 = Параметры.Бюджет;
	
	ЗакрыватьПриЗакрытииВладельца = Истина;
	
	ВключитьНадписьПоиска();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	Если Не ФормаЗакрывается = Истина Тогда
		
		ОбработатьПоискКлиент();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьПоиск(Команда)
	
	ОбработатьПоискКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВключитьНадписьПоиска()

	НадписьРезультат  = "Укажите начальные символы кода.";
	Элементы.НадписьРезультат.ЦветТекста = Новый Цвет(0,0,150);

КонецПроцедуры // ВключитьНадписьПоиска()

&НаСервере
Процедура ВключитьНадписьНеНайдено()

	НадписьРезультат  = "Элемент классификатора не найден!";
	Элементы.НадписьРезультат.ЦветТекста = Новый Цвет(225,0,0);

КонецПроцедуры // ВключитьНадписьНеНайдено()

&НаСервере
Функция ВыполнитьПоиск(СтруктураДанных)
	
	РезультатПоиска = Справочники.ВидыДоходовКДБ.НайтиВКлассификации(Код, СтруктураДанных, Бюджет, ДатаАктуальности);
	
	Если Не РезультатПоиска = Неопределено Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ВыполнитьПоиск()


&НаКлиенте
Процедура ОбработатьПоискКлиент()
	
	Результат = ОбработатьПоискСервер();
	
	Если Не Результат = Неопределено Тогда
		ФормаЗакрывается = Истина;
		Оповестить("ПоискКодаКлассификатораДоходовВФорме", Результат, ЭтаФорма);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьПоискСервер()

	ВключитьНадписьПоиска();
	
	// Разбор кода на составляющие.
	Если ПустаяСтрока(Код) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Неопределено;
	
	Если ВыполнитьПоиск(Результат) Тогда
		Возврат Результат;
	Иначе
		ВключитьНадписьНеНайдено();
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // ОбработатьПоиск()

#КонецОбласти