
// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Перем ПроверкаКонтрагентовПараметрыОбработчикаОжидания Экспорт;
&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров") Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='В конфигурации отключены ведение и контроль исполнения графиков по договорам с контрагентами.
			|Для включения необходимо перейти в раздел 
			|""Администрирование"" - ""Настройки параметров учета"" - ""Ведение учета""'"), Объект.Ссылка, , , Отказ);
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата = ТекущаяДатаСеанса();
		КонецЕсли;
		
		ПодготовитьФормуНаСервере();
		
		Если НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
			Объект.ВалютаДокумента = ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереДокумент(ЭтотОбъект, Параметры);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ПриОткрытииДокумент(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереДокумент(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗапомнитьПараметрыГрафиковВКэшеФормы();
	УстановитьВидимостьРеквизитов();
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуПланированиеИКонтроль(ЭтотОбъект, ТекущийОбъект);
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("Запись_РегистрацияГрафиковИсполненияДоговоров", ПараметрыЗаписи, Объект.Ссылка);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.РегистрацияГрафиковИсполненияДоговоров.Форма.КонструкторГрафиковИсполненияДоговоров" Тогда
		СформироватьГрафикиИсполненияПоДоговоруНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
	Если ИмяСобытия = "Запись_РегистрацияГрафиковИсполненияДоговоров" И Объект.Ссылка <> Источник Тогда
		ЗаписанНовыйДокумент();
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентовВДокументе(ЭтотОбъект, Объект.Дата);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьДоговора(ЭтотОбъект);
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьДоступностьДоговора(ЭтотОбъект);
	
	КонтрагентПриИзмененииНаСервере();
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентовВДокументе(ЭтотОбъект, Элемент);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	ЗапомнитьПараметрыГрафиковВКэшеФормы();
	
	Для каждого СтрокаТЧ Из Объект.ГрафикПлатежей Цикл
		СтрокаТЧ.ЗапретИзменения = Ложь;
	КонецЦикла;
	Для каждого СтрокаТЧ Из Объект.ГрафикИсполнения Цикл
		СтрокаТЧ.ЗапретИзменения = Ложь;
	КонецЦикла;
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	ЗапомнитьПараметрыГрафиковВКэшеФормы();
	
	ЗаполнитьГрафикПлатежейНаСервере();
	ЗаполнитьГрафикИсполненияНаСервере();
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ГрафикПлатежей

&НаКлиенте
Процедура ГрафикПлатежейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		
		ТекущаяСтрока = Элементы.ГрафикПлатежей.ТекущиеДанные;
		ТекущаяСтрока.ЗапретИзменения = Ложь;
		
		ТекущаяСтрока.СуммаВВалютеДоИзменений = 0;
		ТекущаяСтрока.СуммаВВалюте = ТекущаяСтрока.СуммаВВалютеПослеИзменений;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ГрафикПлатежей.ТекущиеДанные;
	
	Если ТекущаяСтрока.ЗапретИзменения Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,
			НСтр("ru = 'Строки документа, отмеченные синим замком, недоступны для удаления.
				|
				|Для редактирования графика используйте колонки ""Изменение"" и ""После изменений"".'"),,
					НСтр("ru = 'Регистрация графиков исполнения'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейКПСПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ГрафикПлатежей.ТекущиеДанные;
	БухгалтерскийУчетКлиент.ПроверитьОчиститьКЭК(ТекущиеДанные.КПС, ТекущиеДанные.КЭК); 	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейКЭКПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГрафикПлатежей.ТекущиеДанные;
	ТекущиеДанные.СчетРасчетов = СчетПоКЭК(ТекущиеДанные.КЭК, ЭтотОбъект.КэшПараметров.Локальные.ДопустимыеСчетаПоВидуДоговора,
		Объект.Дата, Объект.Организация, ТекущиеДанные.ИФО);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейСчетРасчетовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГрафикПлатежей.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.КЭК) И ЗначениеЗаполнено(ТекущиеДанные.СчетРасчетов) Тогда
		ТекущиеДанные.КЭК = БухгалтерскийУчетВызовСервераПовтИсп.АналитическийКЭКпоСчету(ТекущиеДанные.СчетРасчетов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейСчетРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ГрафикПлатежей.ТекущиеДанные;
	
	ОбщиеПараметры = Новый Структура("Дата,Организация, ИФО", Объект.Дата, Объект.Организация, ТекущиеДанные.ИФО); 
	ПараметрыОтбора = УчетРасчетовКлиент.ПараметрыОтбораСчетаРасчетов(
		ОбщиеПараметры, ТекущиеДанные.КЭК, ЭтотОбъект.КэшПараметров.Локальные.ДопустимыеСчетаПоВидуДоговора, ТекущиеДанные.СчетРасчетов);
	УчетРасчетовКлиент.РасшифровкаПлатежаСчетРасчетовНачалоВыбора(ПараметрыОтбора,
		Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейСчетРасчетовАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ГрафикПлатежей.ТекущиеДанные;
	
	ОбщиеПараметры = Новый Структура("Дата,Организация, ИФО", Объект.Дата, Объект.Организация, ТекущиеДанные.ИФО); 
	ПараметрыОтбора = УчетРасчетовКлиент.ПараметрыОтбораСчетаРасчетов(
		ОбщиеПараметры, ТекущиеДанные.КЭК, ЭтотОбъект.КэшПараметров.Локальные.ДопустимыеСчетаПоВидуДоговора, ТекущиеДанные.СчетРасчетов);
	УчетРасчетовКлиент.РасшифровкаПлатежаСчетРасчетовАвтоПодбор(ПараметрыОтбора,
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейСчетРасчетовОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ГрафикПлатежей.ТекущиеДанные;
	
	ОбщиеПараметры = Новый Структура("Дата,Организация, ИФО", Объект.Дата, Объект.Организация, ТекущиеДанные.ИФО); 
	ПараметрыОтбора = УчетРасчетовКлиент.ПараметрыОтбораСчетаРасчетов(
		ОбщиеПараметры, ТекущиеДанные.КЭК, ЭтотОбъект.КэшПараметров.Локальные.ДопустимыеСчетаПоВидуДоговора, ТекущиеДанные.СчетРасчетов);
	УчетРасчетовКлиент.РасшифровкаПлатежаСчетРасчетовОкончаниеВводаТекста(ПараметрыОтбора,
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейСуммаВВалютеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГрафикПлатежей.ТекущиеДанные;
	ТекущиеДанные.СуммаВВалютеПослеИзменений = ТекущиеДанные.СуммаВВалютеДоИзменений + ТекущиеДанные.СуммаВВалюте;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПлатежейСуммаВВалютеПослеИзмененийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГрафикПлатежей.ТекущиеДанные;
	ТекущиеДанные.СуммаВВалюте = ТекущиеДанные.СуммаВВалютеПослеИзменений - ТекущиеДанные.СуммаВВалютеДоИзменений;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ГрафикИсполнения

&НаКлиенте
Процедура ГрафикИсполненияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		
		ТекущаяСтрока = Элементы.ГрафикИсполнения.ТекущиеДанные;
		ТекущаяСтрока.ЗапретИзменения = Ложь;
		
		ТекущаяСтрока.СуммаВВалютеДоИзменений = 0;
		ТекущаяСтрока.СуммаВВалюте = ТекущаяСтрока.СуммаВВалютеПослеИзменений;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикИсполненияПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ГрафикИсполнения.ТекущиеДанные;
	
	Если ТекущаяСтрока.ЗапретИзменения Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,
			НСтр("ru = 'Строки документа, отмеченные синим замком, недоступны для удаления.
				|
				|Для редактирования графика используйте колонки ""Изменение"" и ""После изменений"".'"),,
					НСтр("ru = 'Регистрация графиков исполнения'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикИсполненияКПСПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ГрафикИсполнения.ТекущиеДанные;
	БухгалтерскийУчетКлиент.ПроверитьОчиститьКЭК(ТекущиеДанные.КПС, ТекущиеДанные.КЭК); 	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикИсполненияКЭКПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГрафикИсполнения.ТекущиеДанные;
	ТекущиеДанные.СчетРасчетов = СчетПоКЭК(ТекущиеДанные.КЭК, ЭтотОбъект.КэшПараметров.Локальные.ДопустимыеСчетаПоВидуДоговора,
		Объект.Дата, Объект.Организация, ТекущиеДанные.ИФО);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикИсполненияСчетРасчетовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГрафикИсполнения.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.КЭК) И ЗначениеЗаполнено(ТекущиеДанные.СчетРасчетов) Тогда
		ТекущиеДанные.КЭК = БухгалтерскийУчетВызовСервераПовтИсп.АналитическийКЭКпоСчету(ТекущиеДанные.СчетРасчетов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикИсполненияСчетРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ГрафикИсполнения.ТекущиеДанные;
	
	ОбщиеПараметры = Новый Структура("Дата,Организация, ИФО", Объект.Дата, Объект.Организация, ТекущиеДанные.ИФО);
	ПараметрыОтбора = УчетРасчетовКлиент.ПараметрыОтбораСчетаРасчетов(
		ОбщиеПараметры, ТекущиеДанные.КЭК, ЭтотОбъект.КэшПараметров.Локальные.ДопустимыеСчетаПоВидуДоговора, ТекущиеДанные.СчетРасчетов);
	УчетРасчетовКлиент.РасшифровкаПлатежаСчетРасчетовНачалоВыбора(ПараметрыОтбора,
		Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикИсполненияСчетРасчетовАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ГрафикИсполнения.ТекущиеДанные;
	
	ОбщиеПараметры = Новый Структура("Дата,Организация, ИФО", Объект.Дата, Объект.Организация, ТекущиеДанные.ИФО); 
	ПараметрыОтбора = УчетРасчетовКлиент.ПараметрыОтбораСчетаРасчетов(
		ОбщиеПараметры, ТекущиеДанные.КЭК, ЭтотОбъект.КэшПараметров.Локальные.ДопустимыеСчетаПоВидуДоговора, ТекущиеДанные.СчетРасчетов);
	УчетРасчетовКлиент.РасшифровкаПлатежаСчетРасчетовАвтоПодбор(ПараметрыОтбора,
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикИсполненияСчетРасчетовОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ГрафикИсполнения.ТекущиеДанные;
	
	ОбщиеПараметры = Новый Структура("Дата,Организация, ИФО", Объект.Дата, Объект.Организация, ТекущиеДанные.ИФО); 
	ПараметрыОтбора = УчетРасчетовКлиент.ПараметрыОтбораСчетаРасчетов(
		ОбщиеПараметры, ТекущиеДанные.КЭК, ЭтотОбъект.КэшПараметров.Локальные.ДопустимыеСчетаПоВидуДоговора, ТекущиеДанные.СчетРасчетов);
	УчетРасчетовКлиент.РасшифровкаПлатежаСчетРасчетовОкончаниеВводаТекста(ПараметрыОтбора,
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикИсполненияСуммаВВалютеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГрафикИсполнения.ТекущиеДанные;
	ТекущиеДанные.СуммаВВалютеПослеИзменений = ТекущиеДанные.СуммаВВалютеДоИзменений + ТекущиеДанные.СуммаВВалюте;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикИсполненияСуммаВВалютеПослеИзмененийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГрафикИсполнения.ТекущиеДанные;
	ТекущиеДанные.СуммаВВалюте = ТекущиеДанные.СуммаВВалютеПослеИзменений - ТекущиеДанные.СуммаВВалютеДоИзменений;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьГрафикПлатежей(Команда)
	
	ТекстВопроса = "";
	Если ЕстьИзмененияВГрафике("ГрафикПлатежей") Тогда
		Если ЭтотОбъект.КэшПараметров.Локальные.ЕстьСуммыДоИзмененийВГрафикеПлатежей Тогда
			ТекстВопроса = НСтр("ru = 'Изменения графика платежей будут очищены.'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Данные на закладке ""График платежей"" будут очищены.'");
		КонецЕсли;
	КонецЕсли;
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru = 'Проведение документа будет отменено.'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru = 'Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьГрафикПлатежейЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьГрафикПлатежейНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьГрафикПлатежейЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьГрафикПлатежейНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикИсполнения(Команда)
	
	ТекстВопроса = "";
	Если ЕстьИзмененияВГрафике("ГрафикИсполнения") Тогда
		Если ЭтотОбъект.КэшПараметров.Локальные.ЕстьСуммыДоИзмененийВГрафикеИсполнения Тогда
			ТекстВопроса = НСтр("ru = 'Изменения графика закупок, реализации, исполнения будут очищены.'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Данные графика исполнения (закупок, реализации) будут очищены.'");
		КонецЕсли;
	КонецЕсли;
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru = 'Проведение документа будет отменено.'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru = 'Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьГрафикИсполненияЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьГрафикИсполненияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьГрафикИсполненияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьГрафикИсполненияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьГрафикПлатежейАвтоматически(Команда)
	
	ТекстВопроса = "";
	Если ЕстьИзмененияВГрафике("ГрафикПлатежей") Тогда
		ТекстВопроса = НСтр("ru = 'Изменения графика платежей будут очищены. Продолжить?'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросСкорректироватьГрафикПлатежейАвтоматическиЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		СкорректироватьГрафикАвтоматическиНаСервере("ГрафикПлатежей");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСкорректироватьГрафикПлатежейАвтоматическиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СкорректироватьГрафикАвтоматическиНаСервере("ГрафикПлатежей");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьГрафикИсполненияАвтоматически(Команда)
	
	ТекстВопроса = "";
	Если ЕстьИзмененияВГрафике("ГрафикИсполнения") Тогда
		ТекстВопроса = НСтр("ru = 'Изменения плана-графика закупок, реализации, исполнения будут очищены. Продолжить?'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросСкорректироватьГрафикИсполненияАвтоматическиЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		СкорректироватьГрафикАвтоматическиНаСервере("ГрафикИсполнения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСкорректироватьГрафикИсполненияАвтоматическиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СкорректироватьГрафикАвтоматическиНаСервере("ГрафикИсполнения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкторГрафиковИсполненияДоговоров(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	ПараметрыФормы.Вставить("Договор", Объект.Договор);
	ПараметрыФормы.Вставить("Валюта", Объект.ВалютаДокумента);
	ПараметрыФормы.Вставить("ДопустимыеСчета", ЭтотОбъект.КэшПараметров.Локальные.ДопустимыеСчетаПоВидуДоговора);
	ПараметрыФормы.Вставить("ВидДокумента", "РегистрацияГрафиковИсполненияДоговоров");
	
	ГрафикПлатежейИтог = Объект.ГрафикПлатежей.Итог("СуммаВВалюте");
	ГрафикИсполненияИтог = Объект.ГрафикИсполнения.Итог("СуммаВВалюте");
	Если ЭтотОбъект.КэшПараметров.Локальные.ВестиГрафикПлатежей
		И ЭтотОбъект.КэшПараметров.Локальные.ВестиПланГрафикИсполнения Тогда
		СуммаПоДоговору = ?(ГрафикПлатежейИтог = ГрафикИсполненияИтог, ГрафикПлатежейИтог, 0);
	ИначеЕсли ЭтотОбъект.КэшПараметров.Локальные.ВестиГрафикПлатежей Тогда
		СуммаПоДоговору = ГрафикПлатежейИтог;
	ИначеЕсли ЭтотОбъект.КэшПараметров.Локальные.ВестиПланГрафикИсполнения Тогда
		СуммаПоДоговору = ГрафикИсполненияИтог;
	КонецЕсли;
	ПараметрыФормы.Вставить("СуммаПоДоговору", СуммаПоДоговору);
	
	ОткрытьФорму("Документ.РегистрацияГрафиковИсполненияДоговоров.Форма.КонструкторГрафиковИсполненияДоговоров",
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

// КонтрольИсполненияДоговоров
&НаКлиенте
Процедура Подключаемый_КонтрольИсполненияДоговоровИзменитьГрафик(Команда)
	
	ПараметрыВызова = Новый Структура;
	ПараметрыВызова.Вставить("ДокументОснование", Объект.Ссылка);
	ПараметрыВызова.Вставить("Организация", Объект.Организация);
	ПараметрыВызова.Вставить("Контрагент", Объект.Контрагент);
	
	КонтрольИсполненияДоговоровКлиент.ВвестиИзменитьГрафикПоДоговору(Объект.Договор, "",
		ПараметрыВызова, ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтрольИсполненияДоговоровОткрытьГрафик(Команда)
	
	КонтрольИсполненияДоговоровКлиент.ОткрытьГрафикИсполненияДоговора(
		Объект.Договор, , , ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтрольИсполненияДоговоровОбновитьИтоги(Команда)
	
	ОбновитьГруппуПланированиеИКонтрольНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьГруппуПланированиеИКонтрольНаСервере()
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуПланированиеИКонтроль(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры
// Конец КонтрольИсполненияДоговоров

// Информационный центр
&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры
// Конец  Информационный центр

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы(ЭтотОбъект, Объект);
	
	ЗапомнитьПараметрыГрафиковВКэшеФормы();
	УстановитьВидимостьРеквизитов();
	УстановитьДоступностьДоговора(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРеквизитов()
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ВестиГрафикПлатежей = ЭтотОбъект.КэшПараметров.Локальные.ВестиГрафикПлатежей;
		ВестиПланГрафикИсполнения  = ЭтотОбъект.КэшПараметров.Локальные.ВестиПланГрафикИсполнения;
		ВидДоговора = ЭтотОбъект.КэшПараметров.Локальные.ВидДоговора;
	Иначе
		ВестиГрафикПлатежей = Истина;
		ВестиПланГрафикИсполнения = Истина;
		ВидДоговора = Неопределено;
	КонецЕсли;
	
	ЗапомнитьПараметрыГрафиковВКэшеФормы();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГрафикПлатежейСкорректироватьГрафикПлатежейАвтоматически", "Видимость", ЭтотОбъект.КэшПараметров.Локальные.ДоступнаАвтокорректировкаГрафикаПлатежей);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГрафикИсполненияСкорректироватьГрафикИсполненияАвтоматически", "Видимость", ЭтотОбъект.КэшПараметров.Локальные.ДоступнаАвтокорректировкаГрафикаИсполнения);
	
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СтраницаГрафикИсполнения", "Заголовок", НСтр("ru = 'План-график реализации'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДоговорВестиПланГрафикИсполнения", "Заголовок", НСтр("ru = 'План-график реализации'"));
		Элементы.ГрафикИсполнения.РасширеннаяПодсказка.Заголовок =
			НСтр("ru = 'Введите актуальный план-график реализации. Если полный график реализации на данный момент неизвестен, можно ввести данные об известных очередных отгрузках, либо ввести сводные данные об ожидаемых отгрузках (по месяцам, кварталам и т.п.). План-график реализации можно уточнять в течение срока действия договора. Проценты, пени, штрафы планируются только в графике платежей.'");
	ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СтраницаГрафикИсполнения", "Заголовок", НСтр("ru = 'План-график закупок'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДоговорВестиПланГрафикИсполнения", "Заголовок", НСтр("ru = 'План-график закупок'"));
		Элементы.ГрафикИсполнения.РасширеннаяПодсказка.Заголовок =
			НСтр("ru = 'Введите актуальный план-график закупок. Если полный график закупок на данный момент неизвестен, можно ввести данные об известных очередных поставках, либо ввести сводные данные об ожидаемых закупках (по месяцам, кварталам и т.п.). График закупок можно уточнять в течение срока действия договора. Проценты, пени, штрафы планируются только в графике платежей.'");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СтраницаГрафикИсполнения", "Заголовок", НСтр("ru = 'План-график исполнения'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДоговорВестиПланГрафикИсполнения", "Заголовок", НСтр("ru = 'План-график исполнения'"));
		Элементы.ГрафикИсполнения.РасширеннаяПодсказка.Заголовок =
			НСтр("ru = 'Введите актуальный график исполнения договора (реализации, закупок). График исполнения можно уточнять в течение срока действия договора. Проценты, пени, штрафы планируются только в графике платежей.'");
	КонецЕсли;
	
	ВидимостьКонструктораГрафиков = (ВестиГрафикПлатежей ИЛИ ВестиПланГрафикИсполнения)
		И НЕ ЭтотОбъект.КэшПараметров.Локальные.ЕстьСуммыДоИзмененийВГрафикеПлатежей
		И НЕ ЭтотОбъект.КэшПараметров.Локальные.ЕстьСуммыДоИзмененийВГрафикеИсполнения;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КнопкаКонструкторГрафиковИсполненияДоговоров", "Видимость", ВидимостьКонструктораГрафиков);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КнопкаКонструкторГрафиковИсполненияДоговоров", "Доступность", ВидимостьКонструктораГрафиков И Не ТолькоПросмотр);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоговорВестиГрафикПлатежей", "Видимость",
		ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СОтправителемТрансферта
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СоглашениеОСубсидии
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПолученныйКредит
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВыпускЦенныхБумаг);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоговорВестиПланГрафикИсполнения", "Видимость",
		ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СОтправителемТрансферта
		ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СоглашениеОСубсидии);
	
	ЭлементыДоПослеИзменений = Новый Массив;
	ЭлементыДоПослеИзменений.Добавить("ГрафикПлатежейСуммаВВалютеДоИзменений");
	ЭлементыДоПослеИзменений.Добавить("ГрафикПлатежейСуммаВВалютеПослеИзменений");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыДоПослеИзменений, "Видимость", ЭтотОбъект.КэшПараметров.Локальные.ЕстьСуммыДоИзмененийВГрафикеПлатежей);
	
	ЭлементыДоПослеИзменений = Новый Массив;
	ЭлементыДоПослеИзменений.Добавить("ГрафикИсполненияСуммаВВалютеДоИзменений");
	ЭлементыДоПослеИзменений.Добавить("ГрафикИсполненияСуммаВВалютеПослеИзменений");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыДоПослеИзменений, "Видимость", ЭтотОбъект.КэшПараметров.Локальные.ЕстьСуммыДоИзмененийВГрафикеИсполнения);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГрафикПлатежейСуммаВВалюте", "Заголовок",
			?(ЭтотОбъект.КэшПараметров.Локальные.ЕстьСуммыДоИзмененийВГрафикеПлатежей, НСтр("ru = 'Изменение'"), НСтр("ru = 'Сумма'")));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГрафикИсполненияСуммаВВалюте", "Заголовок",
			?(ЭтотОбъект.КэшПараметров.Локальные.ЕстьСуммыДоИзмененийВГрафикеИсполнения, НСтр("ru = 'Изменение'"), НСтр("ru = 'Сумма'")));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВалютаДокумента", "ТолькоПросмотр",
		ЭтотОбъект.КэшПараметров.Локальные.ЕстьСуммыДоИзмененийВГрафикеПлатежей
		ИЛИ ЭтотОбъект.КэшПараметров.Локальные.ЕстьСуммыДоИзмененийВГрафикеИсполнения);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГрафикПлатежейЗаполнитьГрафикПлатежей", "Видимость", ЭтотОбъект.КэшПараметров.Локальные.ЕстьСуммыДоИзмененийВГрафикеПлатежей);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГрафикИсполненияЗаполнитьГрафикИсполнения", "Видимость", ЭтотОбъект.КэшПараметров.Локальные.ЕстьСуммыДоИзмененийВГрафикеИсполнения);
	
	ИспользоватьДетализациюПоКОСГУВГрафиках = КонтрольИсполненияДоговоров.ИспользоватьДетализациюПоКОСГУВГрафикахПоДоговорам(ВидДоговора);
	ЭлементыДопАналитика = Новый Массив;
	ЭлементыДопАналитика.Добавить("ГрафикПлатежейКЭК");
	ЭлементыДопАналитика.Добавить("ГрафикИсполненияКЭК");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыДопАналитика, "Видимость", ИспользоватьДетализациюПоКОСГУВГрафиках);
	
	ИспользоватьДополнительнуюАналитикуВГрафикахПлатежей = КонтрольИсполненияДоговоров.ИспользоватьДополнительнуюАналитикуВГрафикахПлатежей(ВидДоговора);
	ЭлементыДопАналитика = Новый Массив;
	ЭлементыДопАналитика.Добавить("ГрафикПлатежейДопКлассификация");
	ЭлементыДопАналитика.Добавить("ГрафикПлатежейКодМероприятия");
	ЭлементыДопАналитика.Добавить("ГрафикПлатежейКодЦели");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыДопАналитика, "Видимость", ИспользоватьДополнительнуюАналитикуВГрафикахПлатежей);
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуПланированиеИКонтроль(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоговора(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Договор",
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация) И ЗначениеЗаполнено(Форма.Объект.Контрагент));

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Недоступные колонки в строках с флагом ЗапретИзменения.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикПлатежейОплатитьДо");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикПлатежейВидРасчетов");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикПлатежейИФО");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикПлатежейКФО");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикПлатежейКПС");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикПлатежейКЭК");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикПлатежейСчетРасчетов");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикПлатежейДопКлассификация");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикПлатежейКодМероприятия");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикПлатежейКодЦели");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ГрафикПлатежей.ЗапретИзменения", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикИсполненияИсполнитьДо");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикИсполненияИФО");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикИсполненияКФО");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикИсполненияКПС");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикИсполненияКЭК");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ГрафикИсполненияСчетРасчетов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ГрафикИсполнения.ЗапретИзменения", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикПлатежейНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ВводНаОсновании", Истина);
	ПараметрыЗаполнения.Вставить("Контрагент", ДокументОбъект.Контрагент);
	ПараметрыЗаполнения.Вставить("Договор", ДокументОбъект.Договор);
	ПараметрыЗаполнения.Вставить("ВидГрафика", "ГрафикПлатежей");
	ДокументОбъект.Заполнить(ПараметрыЗаполнения);
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикИсполненияНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ВводНаОсновании", Истина);
	ПараметрыЗаполнения.Вставить("Контрагент", ДокументОбъект.Контрагент);
	ПараметрыЗаполнения.Вставить("Договор", ДокументОбъект.Договор);
	ПараметрыЗаполнения.Вставить("ВидГрафика", "ПланГрафикИсполнения");
	ДокументОбъект.Заполнить(ПараметрыЗаполнения);
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьГрафикиИсполненияПоДоговоруНаСервере(ПараметрыГрафиков)
	
	// График платежей.
	Если ЭтотОбъект.КэшПараметров.Локальные.ВестиГрафикПлатежей Тогда
		Документы.РегистрацияГрафиковИсполненияДоговоров.ЗаполнитьГрафикПлатежейПоПараметрам(Объект, ПараметрыГрафиков,
			УчетРасчетовКлиентСервер.ДопустимыеСчетаРасчетовПоВидуДоговора(ЭтотОбъект.КэшПараметров.Локальные.ВидДоговора));
	КонецЕсли;
	
	// График исполнения.
	Если ЭтотОбъект.КэшПараметров.Локальные.ВестиПланГрафикИсполнения Тогда
		Документы.РегистрацияГрафиковИсполненияДоговоров.ЗаполнитьГрафикИсполненияПоПараметрам(Объект, ПараметрыГрафиков,
			УчетРасчетовКлиентСервер.ДопустимыеСчетаРасчетовПоВидуДоговора(ЭтотОбъект.КэшПараметров.Локальные.ВидДоговора));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьИзмененияВГрафике(ИмяТаблицы)
	
	Для Каждого СтрокаГрафика Из Объект[ИмяТаблицы] Цикл
		Если СтрокаГрафика.СуммаВВалюте <> 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОчиститьИзмененияГрафика(ТабличнаяЧастьГрафик, ТолькоСуммыИзменений)
	
	Если ТолькоСуммыИзменений Тогда // Очищаем суммы изменений.
		
		СтрокиКУдалению = Новый Массив;
		Для Каждого СтрокаГрафика Из ТабличнаяЧастьГрафик Цикл
			Если СтрокаГрафика.ЗапретИзменения Тогда
				СтрокаГрафика.СуммаВВалюте = 0;
				СтрокаГрафика.СуммаВВалютеПослеИзменений =
					СтрокаГрафика.СуммаВВалютеДоИзменений + СтрокаГрафика.СуммаВВалюте;
			Иначе
				СтрокиКУдалению.Добавить(СтрокаГрафика);
			КонецЕсли;
		КонецЦикла;
		Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			ТабличнаяЧастьГрафик.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
	Иначе // Очищаем весь график.
		ТабличнаяЧастьГрафик.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкорректироватьГрафикАвтоматическиНаСервере(ИмяТаблицы)
	
	ОчиститьИзмененияГрафика(Объект[ИмяТаблицы], Истина);
	
	КонтрольИсполненияДоговоров.СкорректироватьГрафикАвтоматически(Объект, ИмяТаблицы, ЭтотОбъект.КэшПараметров.Локальные.ВидДоговора);
	
	ИтогоИзменениеСуммаВВалюте = Объект[ИмяТаблицы].Итог("СуммаВВалюте");
	Если ИтогоИзменениеСуммаВВалюте <> 0 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось распределить сумму %1 по датам %2 автоматически!'"),
			ОбщегоНазначенияБГУ.ФорматСумм(ИтогоИзменениеСуммаВВалюте),
			?(ИмяТаблицы = "ГрафикПлатежей", НСтр("ru = 'оплаты'"), НСтр("ru = 'исполнения'")));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект");
		ОчиститьИзмененияГрафика(Объект[ИмяТаблицы], Истина);
	КонецЕсли;
	
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СчетПоКЭК(Знач КЭК, ДопустимыеСчета, Знач НаДату, Знач Организация, Знач ИФО)
	
	Возврат БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(КЭК, ДопустимыеСчета, , НаДату, Организация, ИФО);
	
КонецФункции

&НаСервере
Процедура ЗаписанНовыйДокумент()
	
	ЗапомнитьПараметрыГрафиковВКэшеФормы();
	УстановитьВидимостьРеквизитов();
	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьПараметрыГрафиковВКэшеФормы()
	
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор,
		"Долгосрочный, ВидДоговора, ВестиГрафикПлатежей, ВестиПланГрафикИсполнения");
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВидДоговора", СтруктураРеквизитов.ВидДоговора);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиГрафикПлатежей", СтруктураРеквизитов.ВестиГрафикПлатежей);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиПланГрафикИсполнения", СтруктураРеквизитов.ВестиПланГрафикИсполнения);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ДопустимыеСчетаПоВидуДоговора",
		УчетРасчетовКлиентСервер.ДопустимыеСчетаРасчетовПоВидуДоговора(СтруктураРеквизитов.ВидДоговора));
	
	ДоступнаАвтокорректировкаГрафикаПлатежей = Ложь;
	ЕстьСуммыДоИзмененийВГрафикеПлатежей = Ложь;
	Для Каждого СтрокаГрафика Из Объект.ГрафикПлатежей Цикл
		Если СтрокаГрафика.СуммаВВалютеДоИзменений <> 0 Тогда
			ЕстьСуммыДоИзмененийВГрафикеПлатежей = Истина;
			ДоступнаАвтокорректировкаГрафикаПлатежей = ДоступнаАвтокорректировкаГрафикаПлатежей ИЛИ (СтрокаГрафика.СуммаВВалютеДоИзменений < 0);
		КонецЕсли;
	КонецЦикла;
	ДоступнаАвтокорректировкаГрафикаИсполнения = Ложь;
	ЕстьСуммыДоИзмененийВГрафикеИсполнения = Ложь;
	Для Каждого СтрокаГрафика Из Объект.ГрафикИсполнения Цикл
		Если СтрокаГрафика.СуммаВВалютеДоИзменений <> 0 Тогда
			ЕстьСуммыДоИзмененийВГрафикеИсполнения = Истина;
			ДоступнаАвтокорректировкаГрафикаИсполнения = ДоступнаАвтокорректировкаГрафикаИсполнения ИЛИ (СтрокаГрафика.СуммаВВалютеДоИзменений < 0);
		КонецЕсли;
	КонецЦикла;
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ЕстьСуммыДоИзмененийВГрафикеПлатежей",       ЕстьСуммыДоИзмененийВГрафикеПлатежей);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ЕстьСуммыДоИзмененийВГрафикеИсполнения",     ЕстьСуммыДоИзмененийВГрафикеИсполнения);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ДоступнаАвтокорректировкаГрафикаПлатежей",   ДоступнаАвтокорректировкаГрафикаПлатежей);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ДоступнаАвтокорректировкаГрафикаИсполнения", ДоступнаАвтокорректировкаГрафикаИсполнения);
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда		
		ЭтоДолгосрочныйДоговор 	= СтруктураРеквизитов.Долгосрочный;
		ЭтоСПокупателем 		= (СтруктураРеквизитов.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		ЭтоСПоставщиком 		= (СтруктураРеквизитов.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		ЭтоСоглашениеОСубсидии 	= (СтруктураРеквизитов.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СоглашениеОСубсидии);
		ЭтоПредоставленныйЗаем 	= (СтруктураРеквизитов.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПредоставленныйКредит);
		ЭтоПолученныйКредит 	= (СтруктураРеквизитов.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПолученныйКредит);
		ЭтоВыпускЦенныхБумаг 	= (СтруктураРеквизитов.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВыпускЦенныхБумаг);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#Область СтандартныеПодсистемыРаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Процедура Подключаемый_ПоказатьПредложениеИспользоватьПроверкуКонтрагентов()
	ПроверкаКонтрагентовКлиент.ПредложитьВключитьПроверкуКонтрагентов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Процедура Подключаемый_ОбработатьРезультатПроверкиКонтрагентов()
	ПроверкаКонтрагентовКлиент.ОбработатьРезультатПроверкиКонтрагентовВДокументе(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаСервере
Процедура ОтобразитьРезультатПроверкиКонтрагента() Экспорт
	ПроверкаКонтрагентов.ОтобразитьРезультатПроверкиКонтрагентаВДокументе(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаСервере
Процедура ПроверитьКонтрагентовФоновоеЗадание(ПараметрыФоновогоЗадания) Экспорт	
	ПроверкаКонтрагентов.ПроверитьКонтрагентовВДокументеФоновоеЗадание(ЭтотОбъект, ПараметрыФоновогоЗадания);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#КонецОбласти







