#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента", "Списание групп объектов ИК (Акт списания ОС-4б)");
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка КАК Ссылка,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК Дата,
	|	ТаблицаОсновныеСредства.Ссылка.ДатаСписанияСБухУчета КАК ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ТаблицаОсновныеСредства.ПричинаСписания КАК ПричинаСписания
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.СписаниеГруппОбъектовИК.ОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	НомераТаблиц.Вставить("МестонахождениеОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка) КАК ЦМО,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета) КАК Состояние,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	
	// Движения по регистрам СтоимостьОбъектовОС и АмортизацияОбъектовОС.
	// По объектам ОС, списываемым этим документом, амортизация линейным способом не начисляется.
	ПараметрыСписания = УправлениеОсновнымиСредствами.ПараметрыСписанияОСПоРегистрамНакопления();
	ПараметрыСписания.НачислитьАмортизациюПриСписании = Ложь;
	ПараметрыСписания.ЭтоИмуществоКазны = Истина;	
	УправлениеОсновнымиСредствами.ДобавитьТаблицыСписанияОСПоРегистрамНакопления(Запрос, НомераТаблиц,
		ДокументСсылка, ПараметрыСписания);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.СписаниеГруппОбъектовИК";
	КомандаПечати.Идентификатор		= "ОС4б";
	КомандаПечати.Представление		= НСтр("ru = 'Акт о списании групп объектов ОС (ОС-4б)'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Перем ТабличныйДокумент1, ТабличныйДокумент2, ТабличныйДокумент3, ТабличныйДокумент4;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОС4б") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС4б","ОС-4б", ПодготовитьОС4б(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

Функция ПодготовитьОС4б(МассивОбъектов, ОбъектыПечати)
    ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОС_4б";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеГруппОбъектовИК.Ссылка КАК Ссылка,
	               |	СписаниеГруппОбъектовИК.Номер КАК НомерАкта,
	               |	СписаниеГруппОбъектовИК.Дата КАК пДата,
	               |	СписаниеГруппОбъектовИК.Организация КАК Организация,
	               |	СписаниеГруппОбъектовИК.Организация.НаименованиеПолное КАК ОргНазв,
	               |	СписаниеГруппОбъектовИК.Организация.КодОКПО КАК КодОКПО,
	               |	СписаниеГруппОбъектовИК.ОснованиеДляАкта КАК ОснованиеДляАкта,
	               |	СписаниеГруппОбъектовИК.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	               |	СписаниеГруппОбъектовИК.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	               |	СписаниеГруппОбъектовИК.ДатаСписанияСБухУчета КАК ДатаСписания,
	               |	СписаниеГруппОбъектовИК.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	               |	СписаниеГруппОбъектовИК.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	               |	СписаниеГруппОбъектовИК.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	               |	СписаниеГруппОбъектовИК.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	               |	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК МОЛ,
	               |	СписаниеГруппОбъектовИК.Приложение КАК ТекстПриложения,
	               |	"""" КАК ТабНомМОЛ,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеГруппОбъектовИК.Подразделение) КАК нПодразделение,
	               |	СписаниеГруппОбъектовИКОсновныеСредства.НомерСтроки КАК НомСтроки,
	               |	ВЫБОР
	               |		КОГДА СписаниеГруппОбъектовИКОсновныеСредства.ОсновноеСредство.НаименованиеПолное = """"
	               |			ТОГДА СписаниеГруппОбъектовИКОсновныеСредства.ОсновноеСредство.Наименование
	               |		ИНАЧЕ СписаниеГруппОбъектовИКОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	               |	КОНЕЦ КАК НаимОС,
	               |	ВЫБОР
	               |		КОГДА СписаниеГруппОбъектовИКОсновныеСредства.ОсновноеСредство.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка)
	               |			ТОГДА """"
	               |		ИНАЧЕ СписаниеГруппОбъектовИКОсновныеСредства.ОсновноеСредство.АмортизационнаяГруппа.Порядок + 1
	               |	КОНЕЦ КАК НомерАмортГруппы,
	               |	СписаниеГруппОбъектовИКОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	               |	СписаниеГруппОбъектовИКОсновныеСредства.ИнвентарныйНомер.ЗаводскойНомер КАК пЗавНомер,
	               |	СписаниеГруппОбъектовИКОсновныеСредства.Количество КАК пКоличество,
	               |	ГОД(СписаниеГруппОбъектовИКОсновныеСредства.ИнвентарныйНомер.ДатаВыпуска) КАК ДатаВыпуска,
	               |	СписаниеГруппОбъектовИКОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеГруппОбъектовИК.КФО) КАК КФО,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеГруппОбъектовИК.КПС) КАК КПС,
	               |	ПРЕДСТАВЛЕНИЕ(СписаниеГруппОбъектовИКОсновныеСредства.ОсновноеСредство.Изготовитель) КАК Изготовитель,
	               |	СписаниеГруппОбъектовИКОсновныеСредства.Сумма * СписаниеГруппОбъектовИКОсновныеСредства.Количество КАК НачСтоимость,
	               |	СписаниеГруппОбъектовИКОсновныеСредства.СуммаАмортизации * СписаниеГруппОбъектовИКОсновныеСредства.Количество КАК НачАмортизация,
	               |	(СписаниеГруппОбъектовИКОсновныеСредства.Сумма - СписаниеГруппОбъектовИКОсновныеСредства.СуммаАмортизации) * СписаниеГруппОбъектовИКОсновныеСредства.Количество КАК ОстСтоимость,
	               |	СписаниеГруппОбъектовИКОсновныеСредства.ПричинаСписания КАК ТекстПричинаСписанияС
	               |ИЗ
	               |	Документ.СписаниеГруппОбъектовИК КАК СписаниеГруппОбъектовИК
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеГруппОбъектовИК.ОсновныеСредства КАК СписаниеГруппОбъектовИКОсновныеСредства
	               |		ПО СписаниеГруппОбъектовИК.Ссылка = СписаниеГруппОбъектовИКОсновныеСредства.Ссылка
	               |ГДЕ
	               |	СписаниеГруппОбъектовИК.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	пДата,
	               |	НомерАкта,
	               |	НомСтроки
	               |ИТОГИ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СписаниеГруппОбъектовИКСоставКомиссии.Ссылка КАК Ссылка,
	               |	СписаниеГруппОбъектовИКСоставКомиссии.НомерСтроки КАК НомерСтроки,
	               |	СписаниеГруппОбъектовИКСоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	               |	СписаниеГруппОбъектовИКСоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	               |	СписаниеГруппОбъектовИКСоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	               |	СписаниеГруппОбъектовИКСоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии
	               |ИЗ
	               |	Документ.СписаниеГруппОбъектовИК.СоставКомиссии КАК СписаниеГруппОбъектовИКСоставКомиссии
	               |ГДЕ
	               |	СписаниеГруппОбъектовИКСоставКомиссии.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки
	               |ИТОГИ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА КАК НФА,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Наименование КАК ДрагМеталл,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Код КАК КодДрагМеталла,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ЕдИзм КАК Справочник.КлассификаторЕдиницИзмерения).Наименование КАК НазвЕИ,
	               |	СУММА(ЕСТЬNULL(НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток, 0)) КАК ВесДраг
	               |ИЗ
	               |	Документ.СписаниеГруппОбъектовИК.ОсновныеСредства КАК СписаниеГруппОбъектовИКОсновныеСредства
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВОбъектахНФА.Остатки КАК НаличиеДрагМатериаловВОбъектахНФАОстатки
	               |		ПО СписаниеГруппОбъектовИКОсновныеСредства.ОсновноеСредство = НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА
	               |			И СписаниеГруппОбъектовИКОсновныеСредства.ИнвентарныйНомер = НаличиеДрагМатериаловВОбъектахНФАОстатки.ИнвНомер
	               |ГДЕ
	               |	СписаниеГруппОбъектовИКОсновныеСредства.Ссылка В(&МассивОбъектов)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Наименование,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Код,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ЕдИзм КАК Справочник.КлассификаторЕдиницИзмерения).Наименование
	               |ИТОГИ ПО
	               |	НФА";
				   
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаШапка		= Результат[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКомиссияД	= Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДрагметаллы	= Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ОС_4б");
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 		= Макет.ПолучитьОбласть("Строка");
	ОбластьСтрокаП 		= Макет.ПолучитьОбласть("СтрокаП");
	ОбластьСтрокаИт     = Макет.ПолучитьОбласть("СтрокаИт");
	ОбластьСтр_2_1 		= Макет.ПолучитьОбласть("Стр_2_1");
	ОбластьКомиссия		= Макет.ПолучитьОбласть("Комиссия");
	ОбластьСтр_2_2 		= Макет.ПолучитьОбласть("Стр_2_2");
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
    	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// подготовим нижнюю часть второй страницы. чтобы проверять что она полностью умещается
		МассивСтр2 = Новый Массив;
		
		ОбластьСтр_2_1.Параметры.Заполнить(ВыборкаШапка);
		МассивСтр2.Добавить(ОбластьСтр_2_1);	
		СтруктураОбластьКомиссия = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии");
		СтруктураОбластьКомиссия.пСтатусЧленаКомиссии		= "Председатель комиссии";
		СтруктураОбластьКомиссия.пДолжностьЧленаКомиссии	= ВыборкаШапка.ДолжностьПредседателяКомиссии;
		Если ЗначениеЗаполнено(ВыборкаШапка.ФамилияПредседателяКомиссии) Тогда
			СтруктураОбластьКомиссия.пЧленКомиссии				= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
																											ВыборкаШапка.ФамилияПредседателяКомиссии,
																											ВыборкаШапка.ИмяПредседателяКомиссии,
																											ВыборкаШапка.ОтчествоПредседателяКомиссии));
		Иначе																											
			СтруктураОбластьКомиссия.пЧленКомиссии				= "";
		КонецЕсли;
		ОбластьКомиссия.Параметры.Заполнить(СтруктураОбластьКомиссия);
		МассивСтр2.Добавить(ОбластьКомиссия);	
		пСтатусЧленаКомиссии = "Члены комиссии";
		ВыборкаКомиссияД.Сбросить();
		ВывелиСтрок = 0;
		Если ВыборкаКомиссияД.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка") Тогда
			ВыборкаКомиссия = ВыборкаКомиссияД.Выбрать();
			Пока ВыборкаКомиссия.Следующий() Цикл
				ОбластьКомиссия = Макет.ПолучитьОбласть("Комиссия");
				СтруктураОбластьКомиссия = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии");
				СтруктураОбластьКомиссия.пСтатусЧленаКомиссии		= пСтатусЧленаКомиссии;
				СтруктураОбластьКомиссия.пДолжностьЧленаКомиссии	= ВыборкаКомиссия.ДолжностьЧленаКомиссии;
				СтруктураОбластьКомиссия.пЧленКомиссии				= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
																												ВыборкаКомиссия.ФамилияЧленаКомиссии,
																												ВыборкаКомиссия.ИмяЧленаКомиссии,
																												ВыборкаКомиссия.ОтчествоЧленаКомиссии));
				ОбластьКомиссия.Параметры.Заполнить(СтруктураОбластьКомиссия);
				МассивСтр2.Добавить(ОбластьКомиссия);
				пСтатусЧленаКомиссии = "";
			КонецЦикла;
		КонецЕсли;
		Для Счетчик = ВывелиСтрок По 2 Цикл
			ОбластьКомиссия = Макет.ПолучитьОбласть("Комиссия");
			СтруктураОбластьКомиссия = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии",
														пСтатусЧленаКомиссии,"","");
			ОбластьКомиссия.Параметры.Заполнить(СтруктураОбластьКомиссия);			
			МассивСтр2.Добавить(ОбластьКомиссия);
			пСтатусЧленаКомиссии = "";
		КонецЦикла;
		
		ГлБухгалтер = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(ВыборкаШапка.Организация,
																					Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер,
																					ВыборкаШапка.пДата);
		ГлБухгалтерФИО = Справочники.Сотрудники.ФамилияИО(ГлБухгалтер.ОтветственноеЛицоСсылка, Истина, ВыборкаШапка.пДата);											
		ОбластьСтр_2_2.Параметры.Заполнить(Новый Структура("ОргБухгалтер", ГлБухгалтерФИО));																			
		
		МассивСтр2.Добавить(ОбластьСтр_2_2);	
		
		
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаШапка);
		СтруктураОбластьЗаголовок = Новый Структура("РукДолжн,ОргДиректор,ФИОМОЛ,НомерАкта");
		Руководитель = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(ВыборкаШапка.Организация, 
																					Перечисления.ОтветственныеЛицаОрганизаций.Руководитель,
																					ВыборкаШапка.пДата);
		РуководительФИО = Справочники.Сотрудники.ФамилияИО(Руководитель.ОтветственноеЛицоСсылка, Истина, ВыборкаШапка.пДата);											
		СтруктураОбластьЗаголовок.РукДолжн 	= Руководитель.ДолжностьПредставление;
		СтруктураОбластьЗаголовок.ОргДиректор	= РуководительФИО;
		
		МОЛ = ВыборкаШапка.МОЛ;
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", МОЛ, ВыборкаШапка.пДата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураОбластьЗаголовок.ФИОМОЛ = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника);
		СтруктураОбластьЗаголовок.НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаШапка.Ссылка,ВыборкаШапка.НомерАкта);
		ОбластьЗаголовок.Параметры.Заполнить(СтруктураОбластьЗаголовок);
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ВыборкаСтроки = ВыборкаШапка.Выбрать();
		//ВыборкаСтроки.Сбросить();
		КоличествоСтрок = ВыборкаСтроки.Количество();
		
		ИтогЦенаПродажи		= 0;
		ИтогНачСтоимость	= 0;
		
		ИтогиТ1 = Новый Структура;
		
		ИтогиТ1.Вставить("НачСтоимость", 	0);					
		ИтогиТ1.Вставить("пКоличество", 	0);		
		ИтогиТ1.Вставить("НачАмортизация", 	0);				
		ИтогиТ1.Вставить("ОстСтоимость", 	0);	
		
		Пока ВыборкаСтроки.Следующий() Цикл
			
			ИтогиТ1.НачСтоимость	= ИтогиТ1.НачСтоимость 		+ ВыборкаСтроки.НачСтоимость;					
			ИтогиТ1.пКоличество		= ИтогиТ1.пКоличество 		+ ВыборкаСтроки.пКоличество;		
			ИтогиТ1.НачАмортизация	= ИтогиТ1.НачАмортизация 	+ ВыборкаСтроки.НачАмортизация;				
			ИтогиТ1.ОстСтоимость	= ИтогиТ1.ОстСтоимость 		+ ВыборкаСтроки.ОстСтоимость;
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
			СтруктураОбластьСтрока = Новый Структура("Драгметалл,КодДрагМеталла,НазвЕИ,ВесДраг,СрокЭкспл","","","","");
			
			СтруктураОбластьСтрока.СрокЭкспл = УправлениеОсновнымиСредствами.РассчитатьСрокЭксплуатации(	ВыборкаСтроки.ОсновноеСредство,
																											ВыборкаСтроки.ИнвНомер,
																											ВыборкаШапка.Организация,
																											ВыборкаШапка.пДата).СрокЭкспл;
            ОбластьСтрока.Параметры.Заполнить(СтруктураОбластьСтрока);
			ДокРегистратор		= Неопределено;
			ДатаДокРегистратора	= Дата('00010101');
			УправлениеОсновнымиСредствами.ПолучитьДокументСобытияОС(ВыборкаСтроки.ОсновноеСредство,
																	ВыборкаСтроки.ИнвНомер,
																	ВыборкаШапка.Организация, 
																	Перечисления.ВидыСобытийОС.ВводВЭксплуатацию,
																	ДокРегистратор,
																	ДатаДокРегистратора);
			
			ВыборкаДрагметаллы.Сбросить();																				
			СтруктураПоиска = Новый Структура("НФА", ВыборкаСтроки.ОсновноеСредство);
			Если ВыборкаДрагметаллы.НайтиСледующий(СтруктураПоиска) Тогда
				ВыводитьОС = Истина;
				ВыборкаДрагметаллыС = ВыборкаДрагметаллы.Выбрать();
				Пока ВыборкаДрагметаллыС.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаДрагметаллыС, "Драгметалл, КодДрагМеталла, НазвЕИ, ВесДраг");
					ТабличныйДокумент.Вывести(ОбластьСтрока);													
					Если ВыводитьОС Тогда
						ВыводитьОС = Ложь;
						СтруктураОбластьСтрока = Новый Структура("НомСтроки,НаимОС,ИнвНомер,СрокЭкспл,ТекстПричинаСписанияС,НачАмортизация,НачСтоимость,ОстСтоимость,пКоличество",
																	"","","","","",0,0,0,"");
						ОбластьСтрока.Параметры.Заполнить(СтруктураОбластьСтрока);
					КонецЕсли;
				КонецЦикла;																	
																	
			Иначе																	
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьСтрокаИт.Параметры.Заполнить(ИтогиТ1);
		ТабличныйДокумент.Вывести(ОбластьСтрокаИт);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Для каждого ТекСтрМассива Из МассивСтр2 Цикл
		
			ТабличныйДокумент.Вывести(ТекСтрМассива);	
		
		КонецЦикла; 
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
	КонецЦикла;
		
	Возврат ТабличныйДокумент;				   
	
КонецФункции

#КонецОбласти

#КонецЕсли
