#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда   
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
	
// Регистры учета

Функция ЭтоРегистрУчета() Экспорт
	Возврат Истина;
КонецФункции	

Процедура СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета) Экспорт  
	
	ЭлементыОтбора = ОтчетОбъект.КомпоновщикНастроек.Настройки.Отбор.Элементы;  
	ДополнениеИмени = "";
	Для Инд = 0 По ЭлементыОтбора.Количество() - 1 Цикл  
		Если ЭлементыОтбора[Инд].ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация") Тогда  
			СвойстваРегистраУчета.Вставить("Организация", 	
			ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементыОтбора[Инд].ИдентификаторПользовательскойНастройки).ПравоеЗначение);  
		ИначеЕсли ЭлементыОтбора[Инд].ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") Тогда  
			СвойстваРегистраУчета.Вставить("Подразделение", 	
			ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементыОтбора[Инд].ИдентификаторПользовательскойНастройки).ПравоеЗначение);  
		ИначеЕсли ЭлементыОтбора[Инд].ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦМО") 
			ИЛИ ЭлементыОтбора[Инд].ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СчетБалансовойСтоимости") Тогда  
			ДополнениеИмени = ДополнениеИмени + " " +Строка(ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементыОтбора[Инд].ИдентификаторПользовательскойНастройки).ПравоеЗначение);  
	    КонецЕсли;
	КонецЦикла;	
    СвойстваРегистраУчета.Вставить("ДополнениеИмени", ДополнениеИмени);
	
	ПараметрПериод = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОтчета")); 
	Если НЕ ПараметрПериод = Неопределено Тогда
		Период = ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрПериод.ИдентификаторПользовательскойНастройки);
		Если НЕ Период = Неопределено Тогда 
			Если ТипЗНЧ(Период.Значение.Вариант) = Тип("ВариантСтандартнойДатыНачала") Тогда 
				СвойстваРегистраУчета.Вставить("НачалоПериода", Период.Значение.Дата);
				СвойстваРегистраУчета.Вставить("КонецПериода", 	Период.Значение.Дата);  
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
					
КонецПроцедуры	
// Регистры учета


// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВедомостьОстатковОС");
	// TODO:
	//   - Либо заполнить описание: НастройкиВарианта.Описание = НСтр("ru = ''");
	//   - Либо отключить вариант:  НастройкиВарианта.Включен = Ложь;
КонецПроцедуры

#КонецОбласти  

#КонецОбласти 

#КонецЕсли