#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьДопустимыеРеквизитыАналитики() Экспорт
	
	СоответствиеТиповИРеквизитов = Новый Соответствие;
	
	МассивКодНаименование = Новый Массив;
	МассивКодНаименование.Добавить("Код");
	МассивКодНаименование.Добавить("Наименование");
	
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.Бюджеты"),МассивКодНаименование);	
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.Мероприятия"),МассивКодНаименование);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ВидыЦелевыхСредств"),МассивКодНаименование);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ВидыДоходовКДБ"),МассивКодНаименование);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ГруппыПодвидовКДБ"),МассивКодНаименование);	
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ГруппыПодгруппыКИФ"),МассивКодНаименование);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.СтатьиКИФ"),МассивКодНаименование);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ВидыКИФ"),МассивКодНаименование);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ЦелевыеСтатьиКРБ"),МассивКодНаименование);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ПрограммыЦелевыхСтатейКРБ"),МассивКодНаименование);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ПодпрограммыЦелевыхСтатейКРБ"),МассивКодНаименование);	
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.Субконто"),МассивКодНаименование);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ГруппыПодгруппыКДБ"),МассивКодНаименование);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.СтатьиПодстатьиКДБ"),МассивКодНаименование);	
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ПодвидыКДБ"),МассивКодНаименование);

	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ЛицевыеСчета"),МассивКодНаименование);	

	
	МассивКод = Новый Массив;
	МассивКод.Добавить("Код");
	
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ГлавыПоБюджетнойКлассификации"),МассивКод);	
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.АналитическиеКодыКПС"),МассивКод);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.КОСГУ"),МассивКод);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ТипыКонтрагентов"),МассивКод);

	СоответствиеТиповИРеквизитов.Вставить(Тип("ПланСчетовСсылка.ЕПСБУ"),МассивКод);

	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.РазделыПодразделыКРБ"),МассивКод);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ВидыРасходовКРБ"),МассивКод);
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.ЭлементыБюджета"),МассивКод);
	
	МассивОрганизации = Новый Массив;
	МассивОрганизации.Добавить("ИНН");
	МассивОрганизации.Добавить("КПП");
	МассивОрганизации.Добавить("КодПоРПБС");
	
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.Организации"),МассивОрганизации);
	
	МассивКонтрагент = Новый Массив;
	МассивКонтрагент.Добавить("ИНН");
	МассивКонтрагент.Добавить("КПП");
	
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.Контрагенты"),МассивКонтрагент);
	
	МассивСубъектыРФ = Новый Массив;
	МассивСубъектыРФ.Добавить("Код");
	МассивСубъектыРФ.Добавить("Наименование");
	МассивСубъектыРФ.Добавить("КодОКАТО");
	МассивСубъектыРФ.Добавить("КодДляНалогов");
	
	СоответствиеТиповИРеквизитов.Вставить(Тип("СправочникСсылка.СубъектыРФ"),МассивСубъектыРФ);
	
	Возврат СоответствиеТиповИРеквизитов;
	
КонецФункции


Функция ПолучитьДанныеВидовАналитики() Экспорт
	
	ДопустимыеРеквизитыАналитики = ПолучитьДопустимыеРеквизитыАналитики();
	
	МассивТиповРаскрываемыхПоКоду = ПолучитьМассивТиповРаскрываемыхПоАналитике();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АналитикаОтчетов.Ссылка КАК Ссылка,
		|	АналитикаОтчетов.Код КАК Код,
		|	АналитикаОтчетов.ТипЗначения КАК ТипЗначения,
		|	АналитикаОтчетов.Представление КАК ПредставлениеАналитики,
		|	АналитикаОтчетов.ВидКлассификатораБК КАК ВидКлассификатораБК,
		|	АналитикаОтчетов.СписокЗначений КАК ОбщийКлассификатор
		|ИЗ
		|	ПланВидовХарактеристик.АналитикаОтчетов КАК АналитикаОтчетов
		|ГДЕ
		|	АналитикаОтчетов.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СоответствиеДанныхВидовАналитики = Новый Соответствие;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураДанныхВидовАналитики = Новый Структура;
		СтруктураДанныхВидовАналитики.Вставить("Код",СокрЛП(ВыборкаДетальныеЗаписи.Код));
		СтруктураДанныхВидовАналитики.Вставить("ТипЗначения",ВыборкаДетальныеЗаписи.ТипЗначения);
		СтруктураДанныхВидовАналитики.Вставить("ВидКлассификатораБК",ВыборкаДетальныеЗаписи.ВидКлассификатораБК);
		СтруктураДанныхВидовАналитики.Вставить("ПредставлениеАналитики",ВыборкаДетальныеЗаписи.ПредставлениеАналитики);
		СтруктураДанныхВидовАналитики.Вставить("ОбщийКлассификатор",ВыборкаДетальныеЗаписи.ОбщийКлассификатор);
		
		СтруктураДанныхВидовАналитики.Вставить("АналитикаКод","Аналитика"+СтруктураДанныхВидовАналитики.Код);
		СтруктураДанныхВидовАналитики.Вставить("РазворачиватьПоКоду",Ложь);
		
		ТекТип = ВыборкаДетальныеЗаписи.ТипЗначения.Типы()[0];
		МассивРеквизитов = ДопустимыеРеквизитыАналитики[ТекТип];
		Если МассивРеквизитов = Неопределено Тогда
			СтруктураДанныхВидовАналитики.Вставить("ИмяРеквизитаДетализации","");
		Иначе
			
			СтруктураДанныхВидовАналитики.Вставить("ИмяРеквизитаДетализации",МассивРеквизитов[0]);
			СтруктураДанныхВидовАналитики.Вставить("РазворачиватьПоКоду",МассивТиповРаскрываемыхПоКоду.Найти(ТекТип)<>Неопределено);
			
		КонецЕсли;
		
		СоответствиеДанныхВидовАналитики.Вставить(ВыборкаДетальныеЗаписи.Ссылка,СтруктураДанныхВидовАналитики);
		
	КонецЦикла;
	
	Возврат СоответствиеДанныхВидовАналитики;
	
КонецФункции

Функция ПолучитьМассивТиповРаскрываемыхПоАналитике()
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.ВидыДоходовКДБ"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ГруппыПодвидовКДБ"));	
	МассивТипов.Добавить(Тип("СправочникСсылка.ГруппыПодгруппыКИФ"));
	МассивТипов.Добавить(Тип("СправочникСсылка.СтатьиКИФ"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ВидыКИФ"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ЦелевыеСтатьиКРБ"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ПрограммыЦелевыхСтатейКРБ"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ПодпрограммыЦелевыхСтатейКРБ"));	
	//МассивТипов.Добавить(Тип("СправочникСсылка.Субконто"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ГруппыПодгруппыКДБ"));
	МассивТипов.Добавить(Тип("СправочникСсылка.СтатьиПодстатьиКДБ"));	
	МассивТипов.Добавить(Тип("СправочникСсылка.ПодвидыКДБ"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ГлавыПоБюджетнойКлассификации"));	
	МассивТипов.Добавить(Тип("СправочникСсылка.АналитическиеКодыКПС"));
	МассивТипов.Добавить(Тип("СправочникСсылка.КОСГУ"));
	МассивТипов.Добавить(Тип("СправочникСсылка.РазделыПодразделыКРБ"));
	МассивТипов.Добавить(Тип("СправочникСсылка.ВидыРасходовКРБ"));
	
	Возврат МассивТипов;
КонецФункции


#КонецЕсли

