
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если ЗначениеЗаполнено(Параметры.ВидСправки) Тогда
			Объект.ВидСправки = Параметры.ВидСправки;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ОтчетныйГод) Тогда
			Объект.ОтчетныйГод = НачалоГода(ТекущаяДатаСеанса());
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Объект.ВидСправки) Тогда
			Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетСтудентов") ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьУчетРодительскойПлаты") Тогда
				Объект.ВидСправки = Перечисления.ВидыСправокДляНалоговогоВычета.ОбразовательныеУслуги;
			Иначе
				Объект.ВидСправки = Перечисления.ВидыСправокДляНалоговогоВычета.МедицинскиеУслуги;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.НалоговыйОрган = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "РегистрацияВНалоговомОргане");
		КонецЕсли;
		
		Объект.УИДСправкиВЖурнале = Новый УникальныйИдентификатор;
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	Если Объект.НомерКорректировки = 999 Тогда
		Аннулирующая = Истина;
	КонецЕсли;
	
	Элементы.ВидСправки.Доступность = НЕ ЗначениеЗаполнено(Объект.Основание);
	
	Элементы.ФормаРазрешитьВыгружатьСОшибками.Пометка = Объект.РазрешитьВыгружатьСОшибками;
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВидимостьЭлементовПоВидуСправки();
	УстановитьВидимостьРеквизитовПолучательУслуги();
	
	ОтборОбновитьТекстГиперссылки();
	
	Если Объект.Проведен Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.НастройкаОтбораПоДоговорам" Тогда
		
		ТаблицаОтбораВХранилище(ВыбранноеЗначение);
		Модифицированность = Истина;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Дети") Тогда
		НалогоплательщикЗаполнен = ЗаполнитьФизлицаПоСправочникуДети(ВыбранноеЗначение);
		Если НЕ НалогоплательщикЗаполнен Тогда
			ТекстСообщения = НСтр("ru='Плательщик по выбранному элементу справочника ""Дети"" не найден. 
				|Необходимо заполнить реквизиты физических лиц вручную.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
				Объект.Ссылка,
				"Объект.Налогоплательщик");
				
			ОчиститьРеквизитыПолучателяУслуги();
		КонецЕсли;
		
		УстановитьВидимостьРеквизитовПолучательУслуги();
		ОчиститьЗначенияСумм();
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Студенты") Тогда
		ПлательщикиПоУчащемуся = ЗаполнитьФизлицаПоСправочникуСтуденты(ВыбранноеЗначение);
		
		Если ПлательщикиПоУчащемуся.Количество() > 0 Тогда
			
			ОчиститьРеквизитыНалогоплательщика();
			ВыбратьПлательщикаПоУчащемусяИзСписка(ПлательщикиПоУчащемуся);
		КонецЕсли;
		
		УстановитьВидимостьРеквизитовПолучательУслуги();
		ОчиститьЗначенияСумм();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Объект.Проведен Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтчетныйГодПриИзменении(Элемент)
	
	Объект.ОтчетныйГод = НачалоГода(Объект.ОтчетныйГод);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетныйГодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Направление = 1 Тогда
		Объект.ОтчетныйГод = ДобавитьМесяц(Объект.ОтчетныйГод, 12);
	Иначе
		Объект.ОтчетныйГод = ДобавитьМесяц(Объект.ОтчетныйГод, -12);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.НалоговыйОрган = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "РегистрацияВНалоговомОргане");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСправкиПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовПоВидуСправки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовПоВидуСправки()
	
	Если Объект.ВидСправки = ПредопределенноеЗначение("Перечисление.ВидыСправокДляНалоговогоВычета.ОбразовательныеУслуги") Тогда
		Элементы.СтраницыДанныеПоВыбранномуВидуСправки.ТекущаяСтраница = Элементы.СтраницаОбразовательныеУслуги;
		Элементы.ГруппаЗаполнитьДанныеФизлиц.Видимость = Истина;
	ИначеЕсли  Объект.ВидСправки = ПредопределенноеЗначение("Перечисление.ВидыСправокДляНалоговогоВычета.МедицинскиеУслуги") Тогда
		Элементы.СтраницыДанныеПоВыбранномуВидуСправки.ТекущаяСтраница = Элементы.СтраницаМедицинскиеУслуги;
		Элементы.ГруппаЗаполнитьДанныеФизлиц.Видимость = Ложь;
	Иначе
		Элементы.СтраницыДанныеПоВыбранномуВидуСправки.ТекущаяСтраница = Элементы.СтраницаФизкультурноОздоровительныеУслуги;
		Элементы.ГруппаЗаполнитьДанныеФизлиц.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогоплательщикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборСписка = Новый Структура;
	ОтборСписка.Вставить("ВидКонтрагента", ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ОтборСписка);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Объект.Налогоплательщик);
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогоплательщикПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Налогоплательщик) Тогда
		ЗаполнитьПараметрыФизЛица(Объект.Налогоплательщик, Элемент.Имя);
	Иначе
		ОчиститьРеквизитыНалогоплательщика();
	КонецЕсли;
	
	Объект.Отбор.Очистить();
	ОчиститьЗначенияСумм();
	ОтборОбновитьТекстГиперссылки();
	
КонецПроцедуры

&НаКлиенте
Процедура НалогоплательщикОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработкаВыбораПлательщикаИПолучателя(ВыбранноеЗначение, Объект.Получатель);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогоплательщикИПолучательУслугиОдноЛицоПриИзменении(Элемент)
	
	Если Объект.НалогоплательщикИПолучательУслугиОдноЛицо Тогда
		Если ЗначениеЗаполнено(Объект.Получатель) И НЕ ЗначениеЗаполнено(Объект.Налогоплательщик) Тогда
			Объект.Налогоплательщик = Объект.Получатель;
			ЗаполнитьПараметрыФизЛица(Объект.Налогоплательщик, "Налогоплательщик");
		Иначе
			Объект.Получатель = Объект.Налогоплательщик;
		КонецЕсли;
	Иначе
		Объект.Получатель = Неопределено;
	КонецЕсли;
	
	ОчиститьРеквизитыПолучателяУслуги();
	УстановитьВидимостьРеквизитовПолучательУслуги();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборСписка = Новый Структура;
	ОтборСписка.Вставить("ВидКонтрагента", ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ОтборСписка);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Объект.Получатель);
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Получатель) Тогда
		ЗаполнитьПараметрыФизЛица(Объект.Получатель, Элемент.Имя);
	Иначе
		ОчиститьРеквизитыПолучателяУслуги();
	КонецЕсли;
	
	ОчиститьЗначенияСумм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработкаВыбораПлательщикаИПолучателя(Объект.Налогоплательщик, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогоплательщикДокументВидНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.ВидыДокументовФизическихЛиц.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогоплательщикДокументВидОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КодДокумента = "";
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		КодДокумента = ПолучитьКодВидаДокумента(ВыбранноеЗначение);
	КонецЕсли;
	
	Объект.НалогоплательщикДокументВид = КодДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательДокументВидНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.ВидыДокументовФизическихЛиц.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательДокументВидОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КодДокумента = "";
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		КодДокумента = ПолучитьКодВидаДокумента(ВыбранноеЗначение);
	КонецЕсли;
	
	Объект.ПолучательДокументВид = КодДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерКорректировкиПриИзменении(Элемент)
	
	Если Объект.НомерКорректировки = 999 Тогда
		Аннулирующая = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АннулирующаяПриИзменении(Элемент)
	
	Если Аннулирующая = Истина Тогда
		ИсходныйНомерКорректировки = Объект.НомерКорректировки;
		Объект.НомерКорректировки = 999;
	Иначе
		Объект.НомерКорректировки = ИсходныйНомерКорректировки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Отбор

&НаКлиенте
Процедура НадписьОтборНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Организация", Объект.Организация);
	ПараметрыОтбора.Вставить("Дата", КонецГода(Объект.ОтчетныйГод));
	
	// Для случаев оплаты за услуги дошкольного учреждения, 
	// используется договор по контрагенту справочника "Дети".
	// Этот контрагент указывается в качестве "Получателя" услуги, 
	// для получения списка договоров, следует передать его в форму.
	
	ОтборКонтрагенты = Новый Массив;
	ОтборКонтрагенты.Добавить(Объект.Налогоплательщик);
	Если ЗначениеЗаполнено(Объект.Получатель) Тогда
		ОтборКонтрагенты.Добавить(Объект.Получатель);
	КонецЕсли;
	ПараметрыОтбора.Вставить("Контрагент", ОтборКонтрагенты);
	
	ПараметрыОтбора.Вставить("ИФО", Неопределено);
	ПараметрыОтбора.Вставить("КФО", Неопределено);
	
	ПараметрыФормы = Новый Структура("ПараметрыОтбора, Отбор, ТолькоПросмотр",
		ПараметрыОтбора, ТаблицаОтбораВХранилище(), ТолькоПросмотр);
	ОткрытьФорму("ОбщаяФорма.НастройкаОтбораПоДоговорам", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОтборОбновитьТекстГиперссылки()
	
	Если Объект.Отбор.Количество() = 0 Тогда
		ТекстГиперссылки = НСтр("ru = '<Без отбора>'");
	Иначе
		ТекстГиперссылки = "";
		Для Каждого СтрокаОтбора Из Объект.Отбор Цикл
			ТекстГиперссылки = ТекстГиперссылки + ?(ТекстГиперссылки = "", "", "; ") + СтрокаОтбора.Договор;
		КонецЦикла;
	КонецЕсли;
	
	НадписьОтбор = ТекстГиперссылки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ВыгрузитьСправку(Команда)
	ОчиститьСообщения();
	Если Не Объект.Проведен Или Модифицированность Тогда 
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно провести документ.
			|Выполнить проведение документа и продолжить?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		Если Ждать ВопросАсинх(ТекстВопроса, Кнопки) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		Если Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВыгружаемыеДанные = СформироватьСправкуXMLНаСервере();
	Если ВыгружаемыеДанные <> Неопределено Тогда 
		РегламентированнаяОтчетностьКлиент.ВыгрузитьФайлы(ВыгружаемыеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПроверитьВыгрузку(Команда)
	Если Модифицированность Тогда 
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно сохранить документ.
			|Выполнить сохранение документа и продолжить?'");
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		Если КодВозвратаДиалога.Да <> Ждать ВопросАсинх(ТекстВопроса, Кнопки) Тогда 
			Возврат;
		КонецЕсли;
		Если Не Записать() Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОчиститьСообщения();
	Отказ               = Ложь;
	ЕстьКритичныеОшибки = Ложь;
	ТаблицаОшибок       = Новый СписокЗначений;
	
	ПроверитьНаСервере(Отказ, ЕстьКритичныеОшибки, ТаблицаОшибок, Ложь);
	
	Если ЕстьКритичныеОшибки Тогда 
		ТекстПредупреждения = НСтр("ru = 'Не заполнены обязательные поля.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если Не Отказ И ТаблицаОшибок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибок не обнаружено");
	Иначе
		ОткрытьФорму("Документ.УведомлениеОСпецрежимахНалогообложения.Форма.НавигацияПоОшибкам",
			Новый Структура("ТаблицаОшибок", ТаблицаОшибок),
			ЭтотОбъект,
			Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьВыгружатьСОшибками(Команда)
	Объект.РазрешитьВыгружатьСОшибками = Не Объект.РазрешитьВыгружатьСОшибками;
	Элементы.ФормаРазрешитьВыгружатьСОшибками.Пометка = Объект.РазрешитьВыгружатьСОшибками;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымУчета(Команда)
	
	Если НеобходимыеРеквизитыЗаполнены() Тогда
		ЗаполнитьПоДаннымУчетаНаСервере();
	КонецЕсли;
	
	УстановитьВидимостьРеквизитовПолучательУслуги();
	
КонецПроцедуры

&НаКлиенте
Процедура Расшифровать(Команда)
	
	ОткрытьОтчетОборотыСчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСправочникуДети(Команда)
	
	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("НаДату", НачалоДня(Объект.Дата));

	ОткрытьФорму("Справочник.Дети.ФормаВыбора",ПараметрыФормы,ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСправочникуУчащиеся(Команда)
	
	ПараметрыОтбора = Новый Структура("Организация", Объект.Организация);
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.Студенты.ФормаВыбора",ПараметрыФормы,ЭтотОбъект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ОтборОбновитьТекстГиперссылки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Основание");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Основание", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизитыНалогоплательщика()
	
	Объект.НалогоплательщикФамилия = Неопределено;
	Объект.НалогоплательщикИмя = Неопределено;
	Объект.НалогоплательщикОтчество = Неопределено;
	Объект.НалогоплательщикИНН = Неопределено;
	Объект.НалогоплательщикДатаРождения = Неопределено;
	Объект.НалогоплательщикДокументВид = Неопределено;
	Объект.НалогоплательщикДокументНомер = Неопределено;
	Объект.НалогоплательщикДокументДата = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизитыПолучателяУслуги()
	
	Объект.ПолучательФамилия = Неопределено;
	Объект.ПолучательИмя = Неопределено;
	Объект.ПолучательОтчество = Неопределено;
	Объект.ПолучательИНН = Неопределено;
	Объект.ПолучательДатаРождения = Неопределено;
	Объект.ПолучательДокументВид = Неопределено;
	Объект.ПолучательДокументНомер = Неопределено;
	Объект.ПолучательДокументДата = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Функция НеобходимыеРеквизитыЗаполнены()
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект["ОтчетныйГод"]) Тогда
		Результат = Ложь;
		ТекстСообщения = НСтр("ru='Поле ""Отчетный год"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Объект.Ссылка,
			"Объект.ОтчетныйГод");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект["Организация"]) Тогда
		Результат = Ложь;
		ТекстСообщения = НСтр("ru='Поле ""Организация"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Объект.Ссылка,
			"Объект.Организация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект["ВидСправки"]) Тогда
		Результат = Ложь;
		ТекстСообщения = НСтр("ru='Поле ""Вид справки"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Объект.Ссылка,
			"Объект.ВидСправки");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьРеквизитовПолучательУслуги()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СтраницаПолучательУслуги", "Видимость", НЕ Объект.НалогоплательщикИПолучательУслугиОдноЛицо);
	
	ЗаполненыСуммыРасшифровки = (Объект.НалогоплательщикСумма <> 0 ИЛИ Объект.ПолучательСумма <> 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"НадписьИтогоОплачено", "Видимость", ЗаполненыСуммыРасшифровки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"НалогоплательщикСумма", "Видимость", ЗаполненыСуммыРасшифровки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПолучательСумма", "Видимость", ЗаполненыСуммыРасшифровки И НЕ Объект.НалогоплательщикИПолучательУслугиОдноЛицо);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КнопкаРасшифровать", "Видимость", ЗаполненыСуммыРасшифровки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыФизЛица(Контрагент, ИмяЭлемента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументыФизическихЛиц.Физлицо КАК Физлицо,
		|	ДокументыФизическихЛиц.ВидДокумента.КодФНС КАК ВидДокументаКодФНС,
		|	ДокументыФизическихЛиц.Серия КАК Серия,
		|	ДокументыФизическихЛиц.Номер КАК Номер,
		|	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаВыдачи
		|ПОМЕСТИТЬ ВТДокументыФизическихЛиц
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|ГДЕ
		|	ДокументыФизическихЛиц.Период <= &ДатаСведений
		|	И ДокументыФизическихЛиц.Физлицо = &Физлицо
		|	И ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументыФизическихЛиц.Период УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
		|	ЕСТЬNULL(ФИОФизическихЛицСрезПоследних.Фамилия, """") КАК Фамилия,
		|	ЕСТЬNULL(ФИОФизическихЛицСрезПоследних.Имя, """") КАК Имя,
		|	ЕСТЬNULL(ФИОФизическихЛицСрезПоследних.Отчество, """") КАК Отчество,
		|	ФизическиеЛица.ИНН КАК ИНН,
		|	ФизическиеЛица.ДатаРождения КАК ДатаРождения,
		|	ЕСТЬNULL(ВТДокументыФизическихЛиц.ВидДокументаКодФНС, """") КАК ДокументКодФНС,
		|	ЕСТЬNULL(ВТДокументыФизическихЛиц.Серия, """") КАК ДокументСерия,
		|	ЕСТЬNULL(ВТДокументыФизическихЛиц.Номер, """") КАК ДокументНомер,
		|	ЕСТЬNULL(ВТДокументыФизическихЛиц.ДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДокументДатаВыдачи
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаСведений, ФизическоеЛицо = &ФизЛицо) КАК ФИОФизическихЛицСрезПоследних
		|		ПО (ФИОФизическихЛицСрезПоследних.ФизическоеЛицо = ФизическиеЛица.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыФизическихЛиц КАК ВТДокументыФизическихЛиц
		|		ПО ФизическиеЛица.Ссылка = ВТДокументыФизическихЛиц.Физлицо
		|ГДЕ
		|	ФизическиеЛица.Ссылка = &ФизЛицо";
	
	Запрос.УстановитьПараметр("Физлицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент,
		"ЮридическоеФизическоеЛицо"));
	Запрос.УстановитьПараметр("ДатаСведений", Объект.Дата);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();

	Объект[ИмяЭлемента + "Фамилия"]	= ВыборкаДетальныеЗаписи.Фамилия;
	Объект[ИмяЭлемента + "Имя"]	= ВыборкаДетальныеЗаписи.Имя;
	Объект[ИмяЭлемента + "Отчество"] = ВыборкаДетальныеЗаписи.Отчество;
	Объект[ИмяЭлемента + "ИНН"]	= ВыборкаДетальныеЗаписи.ИНН;
	Объект[ИмяЭлемента + "ДатаРождения"] = ВыборкаДетальныеЗаписи.ДатаРождения;
	Объект[ИмяЭлемента + "ДокументВид"] = ВыборкаДетальныеЗаписи.ДокументКодФНС;
	Объект[ИмяЭлемента + "ДокументДата"] = ВыборкаДетальныеЗаписи.ДокументДатаВыдачи;
	ДокументНомерИСерия = СокрЛП(СтрШаблон(НСтр("ru = '%1 %2'"),
		ВыборкаДетальныеЗаписи.ДокументСерия,
		ВыборкаДетальныеЗаписи.ДокументНомер));
	Объект[ИмяЭлемента + "ДокументНомер"] = ДокументНомерИСерия;

КонецПроцедуры

&НаСервере
Функция ПолучитьКодВидаДокумента(ВидДокументаФизическихЛиц)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидДокументаФизическихЛиц, "КодФНС");
	
КонецФункции

&НаКлиенте
Процедура ОчиститьЗначенияСумм()
	
	Объект.ОбразованиеСуммаРасходов = 0;
	Объект.МедицинаСуммаРасходов1 = 0;
	Объект.ФизкультураСуммаРасходов = 0;
	Объект.НалогоплательщикСумма = 0;
	Объект.ПолучательСумма = 0;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымУчетаНаСервере()
	
	Объект.ОбразованиеСуммаРасходов = 0;
	Объект.МедицинаСуммаРасходов1 = 0;
	Объект.ФизкультураСуммаРасходов = 0;
	Объект.НалогоплательщикСумма = 0;
	Объект.ПолучательСумма = 0;
	
	// Заполнение данных о расчетах выполняется по счету 205.00, с учетом отбора по налогоплательщику и договорам.
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОбороты.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|	ЖурналПроводокЕПСБУОбороты.СуммаОборотКт - ЖурналПроводокЕПСБУОбороты.СуммаОборотДт КАК СуммаПоступлений
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет = &СчетРасчетов,
	|			,
	|			Организация = &Организация
	|				И Субконто1 В (&СписокКонтрагенты)
	|				И &УсловиеДоговор,
	|			КорСчет В ИЕРАРХИИ (&КорСчетаРасчетов),
	|			) КАК ЖурналПроводокЕПСБУОбороты";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Объект.ОтчетныйГод));
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецГода(Объект.ОтчетныйГод), ВидГраницы.Включая));
	
	Запрос.УстановитьПараметр("СчетРасчетов", СчетРасчетов(Объект.Дата, Объект.Организация));
	Запрос.УстановитьПараметр("КорСчетаРасчетов", КорСчетаРасчетов(Объект.Дата, Объект.Организация));
	
	СписокКонтрагенты = Новый Массив;
	СписокКонтрагенты.Добавить(Объект.Налогоплательщик);
	Если НЕ Объект.НалогоплательщикИПолучательУслугиОдноЛицо Тогда
		СписокКонтрагенты.Добавить(Объект.Получатель);
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокКонтрагенты", СписокКонтрагенты);
	
	Если Объект.Отбор.Количество() > 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеДоговор", "Субконто2 В (&УсловиеДоговор)");
		Запрос.УстановитьПараметр("УсловиеДоговор", Объект.Отбор.Выгрузить(,"Договор"));
	Иначе
		Запрос.УстановитьПараметр("УсловиеДоговор", Истина);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Объект.ВидСправки = Перечисления.ВидыСправокДляНалоговогоВычета.ОбразовательныеУслуги Тогда
			Объект.ОбразованиеСуммаРасходов = Объект.ОбразованиеСуммаРасходов + ВыборкаДетальныеЗаписи.СуммаПоступлений;
		ИначеЕсли Объект.ВидСправки = Перечисления.ВидыСправокДляНалоговогоВычета.МедицинскиеУслуги Тогда
			Объект.МедицинаСуммаРасходов1 = Объект.МедицинаСуммаРасходов1 + ВыборкаДетальныеЗаписи.СуммаПоступлений;
		ИначеЕсли Объект.ВидСправки = Перечисления.ВидыСправокДляНалоговогоВычета.ФизкультурноОздоровительныеУслуги Тогда
			Объект.ФизкультураСуммаРасходов = Объект.ФизкультураСуммаРасходов + ВыборкаДетальныеЗаписи.СуммаПоступлений;
		КонецЕсли;
		
		Если НЕ Объект.НалогоплательщикИПолучательУслугиОдноЛицо И ВыборкаДетальныеЗаписи.Контрагент = Объект.Получатель Тогда
			Объект.ПолучательСумма = Объект.ПолучательСумма + ВыборкаДетальныеЗаписи.СуммаПоступлений;
		Иначе
			Объект.НалогоплательщикСумма = Объект.НалогоплательщикСумма + ВыборкаДетальныеЗаписи.СуммаПоступлений;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТаблицаОтбораВХранилище(АдресХранилища = "")
	
	Если ПустаяСтрока(АдресХранилища) Тогда
		Результат = ПоместитьВоВременноеХранилище(Объект.Отбор.Выгрузить(), УникальныйИдентификатор);
	Иначе
		ТаблицаОтбора = ПолучитьИзВременногоХранилища(АдресХранилища); 
		Объект.Отбор.Загрузить(ТаблицаОтбора);
		ОтборОбновитьТекстГиперссылки();
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОткрытьОтчетОборотыСчета()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	
	ПараметрыФормы.Вставить("РежимРасшифровки", Истина);
	ПараметрыФормы.Вставить("ВидРасшифровки", 2);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Организация",   Объект.Организация);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("НачалоПериода", НачалоГода(Объект.ОтчетныйГод));
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КонецПериода",  КонецГода(Объект.ОтчетныйГод));
	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоСубсчетам", Истина);
	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательБУ",              Истина);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательНеУчитываетсяНУ", Ложь);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательЕНВД",            Ложь);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательНДС",             Ложь);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательВалютнаяСумма",   Ложь);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательКоличество",      Ложь);
	
	// Группировки.
	ГруппировкиОтчета = Новый Массив;
	
	// Группировка Контрагент.
	ОписаниеГруппировки = Новый Структура;
	ОписаниеГруппировки.Вставить("Использование",  Истина);
	ОписаниеГруппировки.Вставить("Поле",           "Субконто1");
	ОписаниеГруппировки.Вставить("Представление",  "Контрагенты");
	ОписаниеГруппировки.Вставить("ТипГруппировки", 0);
	ГруппировкиОтчета.Добавить(ОписаниеГруппировки);
	
	// Группировка Договор.
	ОписаниеГруппировки = Новый Структура;
	ОписаниеГруппировки.Вставить("Использование",  Истина);
	ОписаниеГруппировки.Вставить("Поле",           "Субконто2");
	ОписаниеГруппировки.Вставить("Представление",  "Договоры");
	ОписаниеГруппировки.Вставить("ТипГруппировки", 0);
	ГруппировкиОтчета.Добавить(ОписаниеГруппировки);
	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Группировка", ГруппировкиОтчета);
	
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Счет", СчетРасчетов(Объект.Дата, Объект.Организация));
	
	// Отбор.
	Отбор = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
	Отбор.ИдентификаторПользовательскойНастройки = "Отбор";
	
	СписокКорСчетов = новый СписокЗначений;
	СписокКорСчетов.ЗагрузитьЗначения(КорСчетаРасчетов(Объект.Дата, Объект.Организация));
	СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(Отбор, "КорСчет",
		СписокКорСчетов, ВидСравненияКомпоновкиДанных.ВСписке, Истина);
	
	СписокКонтрагенты = Новый СписокЗначений;
	СписокКонтрагенты.Добавить(Объект.Налогоплательщик);
	Если НЕ Объект.НалогоплательщикИПолучательУслугиОдноЛицо Тогда
		СписокКонтрагенты.Добавить(Объект.Получатель);
	КонецЕсли;
	СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(Отбор, "Субконто1",
		СписокКонтрагенты, ВидСравненияКомпоновкиДанных.ВСписке, Истина);
	
	Если Объект.Отбор.Количество() > 0 Тогда
		СписокДоговоры = Новый СписокЗначений;
		Для Каждого СтрокаОтбора Из Объект.Отбор Цикл
			СписокДоговоры.Добавить(СтрокаОтбора.Договор);
		КонецЦикла;
		СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(Отбор, "Субконто2",
			СписокДоговоры, ВидСравненияКомпоновкиДанных.ВСписке, Истина);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	
	ОткрытьФорму("Отчет.ОборотыСчета.Форма", ПараметрыФормы, ЭтотОбъект, Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
Функция СчетРасчетов(Дата, Организация)
	
	Возврат БухгалтерскийУчет.СчетПоКоду("205.31", Дата, Организация);
	
КонецФункции

&НаСервереБезКонтекста
Функция КорСчетаРасчетов(Дата, Организация)
	
	КодыКорСчетов = Новый Структура;
	КодыКорСчетов.Вставить("СчетКазначейство",	"201.11");
	КодыКорСчетов.Вставить("СчетБанкРубли",		"201.21");
	КодыКорСчетов.Вставить("СчетЭквайрингРубли","201.23");
	КодыКорСчетов.Вставить("СчетБанкВалюта",	"201.27");
	КодыКорСчетов.Вставить("СчетКасса",			"201.34");
	КодыКорСчетов.Вставить("СчетКомиссии",		"210.05");
	КодыКорСчетов.Вставить("СчетФинорган",		"210.02");
	
	КорСчета = Новый Массив;
	Для Каждого КорСчетИзСписка Из КодыКорСчетов Цикл
		КорСчета.Добавить(БухгалтерскийУчет.СчетПоКоду(КорСчетИзСписка.Значение, Дата, Организация));
	КонецЦикла;
	
	Возврат КорСчета;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораПлательщикаИПолучателя(Налогоплательщик, Получатель)
	
	Если ЗначениеЗаполнено(Получатель) И Получатель = Налогоплательщик Тогда
		
		Объект.НалогоплательщикИПолучательУслугиОдноЛицо = Истина;
		ОчиститьРеквизитыПолучателяУслуги();
		УстановитьВидимостьРеквизитовПолучательУслуги();
		
		ПоказатьПредупреждение(,НСтр("ru = 'Выбран тот же получатель услуги, что и налогоплательщик. 
								|В этом случае заполнение получателя услуги не требуется.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьФизлицаПоСправочникуДети(СправочникДетиСсылка)
	
	НалогоплательщикЗаполнен = Ложь;
	
	Если ЗначениеЗаполнено(СправочникДетиСсылка) Тогда
		ДанныеРебенка = РодительскаяПлата.ДанныеРебенка(СправочникДетиСсылка, Объект.Организация, Объект.Дата);
		Объект.Отбор.Очистить();
		ОтборОбновитьТекстГиперссылки();
		
		Если ЗначениеЗаполнено(ДанныеРебенка.Плательщик) Тогда
			Объект.Налогоплательщик = ДанныеРебенка.Плательщик.Плательщик;
			Объект.НалогоплательщикИПолучательУслугиОдноЛицо = Ложь;
			ЗаполнитьПараметрыФизЛица(Объект.Налогоплательщик, "Налогоплательщик");
			
			Объект.Получатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СправочникДетиСсылка, "Контрагент");
			ЗаполнитьПараметрыФизЛица(Объект.Получатель, "Получатель");
			
			НалогоплательщикЗаполнен = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НалогоплательщикЗаполнен;
	
КонецФункции

&НаСервере
Функция ЗаполнитьФизлицаПоСправочникуСтуденты(СправочникСтудентыСсылка)
	
	ПлательщикиПоУчащемуся = Новый Массив;
	
	Если ЗначениеЗаполнено(СправочникСтудентыСсылка) Тогда
		
		ДанныеПлательщиков = РаботаСоСтудентами.СписокПлательщиковФизлицПоСтуденту(СправочникСтудентыСсылка,Объект.Дата);
		Объект.Отбор.Очистить();
		ОтборОбновитьТекстГиперссылки();
		
		Если ДанныеПлательщиков.Количество() = 0 Тогда
			// Для учащегося нет плательщиков - физлиц, указывается единственный плательщик, сам учащийся.
			Объект.Налогоплательщик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СправочникСтудентыСсылка, "Контрагент");
			Объект.НалогоплательщикИПолучательУслугиОдноЛицо = Истина;
			ЗаполнитьПараметрыФизЛица(Объект.Налогоплательщик, "Налогоплательщик");
			
		Иначе
			КонтрагентСтудента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СправочникСтудентыСсылка, "Контрагент");
			Если ДанныеПлательщиков.Количество() = 1 Тогда
				Если ДанныеПлательщиков[0].Контрагент = КонтрагентСтудента Тогда
					// Единственный плательщик - сам учащийся.
					Объект.Налогоплательщик = КонтрагентСтудента;
					Объект.НалогоплательщикИПолучательУслугиОдноЛицо = Истина;
					ЗаполнитьПараметрыФизЛица(Объект.Налогоплательщик, "Налогоплательщик");
					
				Иначе
					// Единственный плательщик - другое физическое лицо.
					Объект.Налогоплательщик = ДанныеПлательщиков[0].Контрагент;
					Объект.НалогоплательщикИПолучательУслугиОдноЛицо = Ложь;
					ЗаполнитьПараметрыФизЛица(Объект.Налогоплательщик, "Налогоплательщик");
					
					Объект.Получатель = КонтрагентСтудента;
					ЗаполнитьПараметрыФизЛица(Объект.Получатель, "Получатель");
					
				КонецЕсли;
			Иначе
				Объект.Получатель = КонтрагентСтудента;
				ЗаполнитьПараметрыФизЛица(Объект.Получатель, "Получатель");
				
				Объект.Налогоплательщик = Неопределено;
				Объект.НалогоплательщикИПолучательУслугиОдноЛицо = Ложь;
				
				Для Каждого СтрокаПлательщик Из ДанныеПлательщиков Цикл
					ПлательщикиПоУчащемуся.Добавить(СтрокаПлательщик.Контрагент);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПлательщикиПоУчащемуся;
	
КонецФункции

&НаКлиенте
Асинх Процедура ВыбратьПлательщикаПоУчащемусяИзСписка(ПлательщикиПоУчащемуся)
	
	ПлательщикиСписок = Новый СписокЗначений;
	ПлательщикиСписок.ЗагрузитьЗначения(ПлательщикиПоУчащемуся);
	
	ВыбранныйЭлемент = Ждать ПлательщикиСписок.ВыбратьЭлементАсинх(
		СтрШаблон(НСтр("ru='Выбор плательщика по учащемуся %1'"), Объект.Получатель));
		
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.Налогоплательщик = ВыбранныйЭлемент.Значение;
		ЗаполнитьПараметрыФизЛица(Объект.Налогоплательщик, "Налогоплательщик");
		ОбработкаВыбораПлательщикаИПолучателя(Объект.Налогоплательщик, Объект.Получатель);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ВыборкаСДаннымиУведомления()
	Запрос = Новый Запрос(СправкаОбОплатеУслугВызовСервера.ТекстЗапросаСвязиСправкиИУведомления());
	Запрос.УстановитьПараметр("СправкаОбОплатеУслуг", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка, Неопределено);
КонецФункции

&НаСервере
Процедура ПроверитьНаСервере(Отказ = Ложь, ЕстьКритичныеОшибки = Ложь, ТаблицаОшибок, НеблокирующиеПроверки = Истина)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ПроверитьОбязательныеПоля(ЕстьКритичныеОшибки);
	Если ЕстьКритичныеОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОбъект.ПроверитьДанныеДокумента(Отказ, НеблокирующиеПроверки);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = ВыборкаСДаннымиУведомления();
	Если ТипЗнч(Выборка) = Тип("ВыборкаИзРезультатаЗапроса") Тогда 
		УведомлениеОбъект = Выборка.Уведомление.ПолучитьОбъект();
		ТаблицаОшибок = Отчеты[УведомлениеОбъект.ИмяОтчета].ПроверитьСправкуСВыводомВТаблицу(УведомлениеОбъект, Выборка.УИД);
		Отказ = ТаблицаОшибок.Количество() > 0;
	ИначеЕсли Выборка = Неопределено Тогда
		ТаблицаОшибок = Новый СписокЗначений;
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не найден проведенный журнал справок содержащий данную справку", "Титульная", ""));
		Отказ = Истина;
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПоказатьСДвухмернымШтрихкодомPDF417() Экспорт
	ОчиститьСообщения();
	ДополнительныеПараметры = Новый Структура();
	
	Если Не Объект.Проведен Или Модифицированность Тогда 
		ТекстВопроса = НСтр("ru = 'Для выполнения команды необходимо предварительно провести документ.
			|Выполнить проведение документа и продолжить?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		Если Ждать ВопросАсинх(ТекстВопроса, Кнопки) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		Если Не Объект.Проведен Или Модифицированность Тогда
			Если Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Отказ               = Ложь;
	ЕстьКритичныеОшибки = Ложь;
	ТаблицаОшибок       = Новый СписокЗначений;
	
	ПроверитьНаСервере(Отказ, ЕстьКритичныеОшибки, ТаблицаОшибок);
	ДополнительныеПараметры.Вставить("ТаблицаОшибок", ТаблицаОшибок);
	
	Если ЕстьКритичныеОшибки Тогда 
		ТекстПредупреждения = НСтр("ru = 'Не заполнены обязательные поля.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	Если Не Отказ И ТаблицаОшибок.Количество() = 0 Тогда
		РегламентированнаяОтчетностьКлиент.ВывестиМашиночитаемуюФормуУведомленияОСпецрежимах(ЭтотОбъект);
	Иначе
		ОткрытьФорму("Документ.УведомлениеОСпецрежимахНалогообложения.Форма.НавигацияПоОшибкам",
			Новый Структура("ТаблицаОшибок", ТаблицаОшибок),
			ЭтотОбъект,
			Истина);
	КонецЕсли
КонецПроцедуры

&НаСервере
Функция СформироватьВыгрузкуИПолучитьДанные() Экспорт
	Выборка = ВыборкаСДаннымиУведомления();
	Если ТипЗнч(Выборка) <> Тип("ВыборкаИзРезультатаЗапроса") Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Отбор = Новый Структура("ИмяОтчета, ИмяФормы, ВидУведомления");
	ЗаполнитьЗначенияСвойств(Отбор, Выборка);
	ИнформацияОШаблоне = УведомлениеОСпецрежимахНалогообложения.ИнформацияПоМЧБШаблонуСправки(Отбор);
	Если ИнформацияОШаблоне = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Выгрузка = Отчеты[Выборка.ИмяОтчета].ЭлектронноеПредставлениеСправки(Выборка.Уведомление, Выборка.УИД);
	Если Выгрузка = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	Выгрузка = Выгрузка[0];
	СтруктураВыгрузки = Новый Структура("ТестВыгрузки,КодировкаВыгрузки", 
			Выгрузка.ТестВыгрузки, Выгрузка.КодировкаВыгрузки);
	СтруктураВыгрузки.Вставить("Данные", УведомлениеОСпецрежимахНалогообложения.ПолучитьМакетДвоичныхДанных(Выборка.ИмяОтчета, ИнформацияОШаблоне.ИмяМакета));
	СтруктураВыгрузки.Вставить("ИмяФайла", ИнформацияОШаблоне.ИмяФайла);
	Возврат СтруктураВыгрузки;
КонецФункции

&НаСервере
Функция СформироватьСправкуXMLНаСервере() Экспорт
	Выборка = ВыборкаСДаннымиУведомления();
	Если ТипЗнч(Выборка) = Тип("ВыборкаИзРезультатаЗапроса") Тогда 
		Возврат Отчеты[Выборка.ИмяОтчета].ЭлектронноеПредставлениеСправки(Выборка.Уведомление, Выборка.УИД);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СохранитьНаКлиенте() Экспорт
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры

// Конец ИнтеграцияС1САрхивом

#КонецОбласти






