
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	
	ПолноеИмяРегистра = "РегистрНакопления.ТабельУчетаПосещаемостиДетейСКорректировкой";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТабельУчетаПосещаемостиДетейСКорректировкой.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ТабельУчетаПосещаемостиДетейСКорректировкой КАК ТабельУчетаПосещаемостиДетейСКорректировкой
		|ГДЕ
		|	ТабельУчетаПосещаемостиДетейСКорректировкой.Регистратор ССЫЛКА Документ.ТабельУчетаПосещаемостиДетейСКорректировкой";
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
		

КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяДокумента = "Документ.ТабельУчетаПосещаемостиДетейСКорректировкой";
	ПолноеИмяРегистра  = "РегистрНакопления.ТабельУчетаПосещаемостиДетейСКорректировкой";
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьРегистраторыРегистраДляОбработки(
		Параметры.Очередь, ПолноеИмяДокумента, ПолноеИмяРегистра);
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	Пока Выборка.Следующий() Цикл

		Регистратор = Выборка.Регистратор;
		
		НачатьТранзакцию();

		Попытка
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ТабельУчетаПосещаемостиДетейСКорректировкой.НаборЗаписей");
			ЭлементБлокировкиДанных.УстановитьЗначение("Регистратор", Регистратор);

			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ТабельУчетаПосещаемостиДетейСКорректировкой");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", Регистратор);
			
			БлокировкаДанных.Заблокировать();
			
			СформироватьДвиженияТабельУчетаПосещаемостиДетейСКорректировкой(Регистратор);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось обработать движения документа: %1 по причине:
				|%2'"),
				Регистратор, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыНакопления.ТабельУчетаПосещаемостиДетейСКорректировкой,
				Регистратор,
				ТекстСообщения);

		КонецПопытки;
				
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура СформироватьДвиженияТабельУчетаПосещаемостиДетейСКорректировкой(Регистратор)

	ТаблицыДляДвижений = Новый Структура;
	ДополнительныеСвойства = Новый Структура("ТаблицыДляДвижений", ТаблицыДляДвижений);
	
	Документы.ТабельУчетаПосещаемостиДетейСКорректировкой.ИнициализироватьДанныеДокумента(Регистратор, ДополнительныеСвойства);
	
	НаборЗаписей = РегистрыНакопления.ТабельУчетаПосещаемостиДетейСКорректировкой.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Загрузить(ДополнительныеСвойства.ТаблицыДляДвижений.ТабельУчетаПосещаемостиДетейСКорректировкой);
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
