
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Объект.Организация = Параметры.Организация;
	КонецЕсли;
	
	ТаблицаШтрихкодов.Загрузить(ПолучитьСписокТоваров());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РазрешатьИзменятьСуществующиеШтрихкодыПриИзменении(Элемент)
	Если НЕ РазрешатьИзменятьСуществующиеШтрихкоды Тогда
		СнятьПометкиСоСтрокСШК();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПометки(Команда)
	ИзменитьПометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	ИзменитьПометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьПометки(Команда)
	ИзменитьПометки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиВсемБезШК(Команда)
	ИзменитьПометки(Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьШК(Команда)
	СформироватьШтрихкоды();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСписокТоваров()
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	Прейскурант.Ссылка КАК Номенклатура,
		               |	Прейскурант.Штрихкод
		               |ИЗ
		               |	Справочник.Прейскурант КАК Прейскурант
		               |ГДЕ
		               |	Прейскурант.ЭтоГруппа = ЛОЖЬ
		               |	И Прейскурант.ПометкаУдаления = ЛОЖЬ
		               |	И Прейскурант.Организация = &Организация";
	
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ
		               |	Прейскурант.Ссылка КАК Номенклатура,
		               |	Прейскурант.Штрихкод
		               |ИЗ
		               |	Справочник.Прейскурант КАК Прейскурант
		               |ГДЕ
		               |	Прейскурант.ЭтоГруппа = ЛОЖЬ
		               |	И Прейскурант.ПометкаУдаления = ЛОЖЬ";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;			   
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаТоваров;
	
КонецФункции

&НаСервере
Процедура ИзменитьПометки(Пометка = Неопределено, ТолькоБезШК = Ложь)

	Для каждого ТекСтр Из ТаблицаШтрихкодов Цикл
		
		НовоеЗначениеПометки = ?(Пометка = Неопределено, Не ТекСтр.Пометка, Пометка);
		
		Если НовоеЗначениеПометки = Истина Тогда
			Если (ТолькоБезШК ИЛИ НЕ РазрешатьИзменятьСуществующиеШтрихкоды) И ЗначениеЗаполнено(ТекСтр.Штрихкод) Тогда
				НовоеЗначениеПометки = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		ТекСтр.Пометка = НовоеЗначениеПометки;
	
	КонецЦикла;

КонецПроцедуры // ИзменитьПометки()

&НаСервере
Процедура СнятьПометкиСоСтрокСШК()

	Для каждого ТекСтр Из ТаблицаШтрихкодов Цикл
		
		Если ЗначениеЗаполнено(ТекСтр.Штрихкод) Тогда
			ТекСтр.Пометка = Ложь;
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СформироватьШтрихкоды(ТолькоПустые = Ложь)

	МаксимальныйШтрихкод = Неопределено;
	
	Для каждого ТекСтр Из ТаблицаШтрихкодов Цикл
	
		Если ТекСтр.Пометка И (НЕ ТолькоПустые ИЛИ ПустаяСтрока(ТекСтр.Штрихкод)) Тогда
			
			ОбъектПрейскуранта = ТекСтр.Номенклатура.ПолучитьОбъект();
			ОбъектПрейскуранта.Штрихкод = Справочники.Прейскурант.СформироватьШтрихкодEAN13();
			ОбъектПрейскуранта.Записать();
			
			ТекСтр.Штрихкод = ОбъектПрейскуранта.Штрихкод;
			МаксимальныйШтрихкод = ОбъектПрейскуранта.Штрихкод;
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры // СформироватьШтрихкоды()

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	ТаблицаШтрихкодов.Загрузить(ПолучитьСписокТоваров());
КонецПроцедуры

#КонецОбласти
