#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПоДаннымУчета(ДокументОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаСреза, ) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦенныеБумагиОстатки.Организация КАК Организация,
	|	ЦенныеБумагиОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА ЦенныеБумагиОстатки.ЦеннаяБумага.Валюта ЕСТЬ NULL
	|				ИЛИ ЦенныеБумагиОстатки.ЦеннаяБумага.Валюта = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЦенныеБумагиОстатки.ЦеннаяБумага.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &РегламентнаяВалюта
	|		ИНАЧЕ ЦенныеБумагиОстатки.ЦеннаяБумага.Валюта
	|	КОНЕЦ КАК Валюта,
	|	ЦенныеБумагиОстатки.КоличествоОстаток КАК Количество,
	|	ЦенныеБумагиОстатки.ЦеннаяБумага.НоминальнаяСтоимость КАК НоминальнаяСтоимость,
	|	0 КАК ПервоначальнаяСтоимость,
	|	0 КАК ПервоначальнаяСтоимостьВалютная
	|ПОМЕСТИТЬ ВТЦенныеБумаги
	|ИЗ
	|	РегистрНакопления.ЦенныеБумаги.Остатки(&ДатаЗапроса, Организация = &Организация) КАК ЦенныеБумагиОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.ОбъектыФинансовыхВложений),
	|	ВЫБОР
	|		КОГДА ЕПСБУОстатки.Валюта ЕСТЬ NULL
	|				ИЛИ ЕПСБУОстатки.Валюта = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕПСБУОстатки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &РегламентнаяВалюта
	|		ИНАЧЕ ЕПСБУОстатки.Валюта
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ЕПСБУОстатки.СуммаОстаток,
	|	ЕСТЬNULL(ЕПСБУОстатки.ВалютнаяСуммаОстаток, 0)
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&ДатаЗапроса,
	|			Счет В ИЕРАРХИИ (&СчетаЦенныхБумаг),
	|			&СубконтоЦенныеБумаги,
	|			ВЫБОР
	|					КОГДА &ИспользоватьУчетПоИФО = ИСТИНА
	|							И &БезУчетаИФО = ЛОЖЬ
	|						ТОГДА ИФО = &ИФО
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И Организация = &Организация) КАК ЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЦенныеБумаги.Организация КАК Организация,
	|	ВТЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТЦенныеБумаги.Валюта КАК Валюта,
	|	СУММА(ВТЦенныеБумаги.Количество) КАК Количество,
	|	СУММА(ВТЦенныеБумаги.ПервоначальнаяСтоимость) КАК ПервоначальнаяСтоимость,
	|	СУММА(ВТЦенныеБумаги.ПервоначальнаяСтоимостьВалютная) КАК ПервоначальнаяСтоимостьВалютная
	|ПОМЕСТИТЬ ВТЦенныеБумагиСгруппированная
	|ИЗ
	|	ВТЦенныеБумаги КАК ВТЦенныеБумаги
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЦенныеБумаги.Валюта,
	|	ВТЦенныеБумаги.Организация,
	|	ВТЦенныеБумаги.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЦенныеБумагиСгруппированная.Организация КАК Организация,
	|	ВТЦенныеБумагиСгруппированная.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТЦенныеБумагиСгруппированная.Валюта КАК Валюта,
	|	ВТЦенныеБумагиСгруппированная.Количество КАК КоличествоУчет,
	|	ВТЦенныеБумагиСгруппированная.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ВТЦенныеБумагиСгруппированная.ПервоначальнаяСтоимостьВалютная КАК ПервоначальнаяСтоимостьВалютная,
	|	ВЫБОР
	|		КОГДА ВТЦенныеБумагиСгруппированная.Валюта = &РегламентнаяВалюта
	|			ТОГДА ВЫРАЗИТЬ(ВТЦенныеБумагиСгруппированная.ЦеннаяБумага.НоминальнаяСтоимость * ВТЦенныеБумагиСгруппированная.Количество КАК ЧИСЛО(18, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТЦенныеБумагиСгруппированная.ЦеннаяБумага.НоминальнаяСтоимость * ВТЦенныеБумагиСгруппированная.Количество * ЕСТЬNULL(КурсыВалют.Курс, 1) / ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК НоминальнаяСтоимостьУчет,
	|	ВЫБОР
	|		КОГДА ВТЦенныеБумагиСгруппированная.Валюта = &РегламентнаяВалюта
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТЦенныеБумагиСгруппированная.ЦеннаяБумага.НоминальнаяСтоимость * ВТЦенныеБумагиСгруппированная.Количество КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК НоминальнаяСтоимостьВалютнаяУчет,
	|	ЕСТЬNULL(КурсыВалют.Курс, 1) КАК Курс,
	|	ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК Кратность,
	|	ЕСТЬNULL(КурсыВалют.Курс, 1) КАК КурсНаДатуВалютирования,
	|	ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК КратностьНаДатуВалютирования
	|ИЗ
	|	ВТЦенныеБумагиСгруппированная КАК ВТЦенныеБумагиСгруппированная
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	|		ПО ВТЦенныеБумагиСгруппированная.Валюта = КурсыВалют.Валюта";
	
	Запрос.УстановитьПараметр("ДатаСреза", ИнвентаризацияКлиентСервер.ПолучитьДатуСрезаРегистровСведенийНакопления52н(ДокументОбъект.ДатаИнвентаризации));
	Запрос.УстановитьПараметр("ДатаЗапроса", ИнвентаризацияКлиентСервер.ПолучитьДатуОпределенияОстатков52н(ДокументОбъект.ДатаИнвентаризации));
	Запрос.УстановитьПараметр("Организация", ДокументОбъект["Организация"]);
	Запрос.УстановитьПараметр("ИФО", ДокументОбъект["ИФО"]);
	Запрос.УстановитьПараметр("БезУчетаИФО", ДокументОбъект["БезУчетаИФО"]);
	Запрос.УстановитьПараметр("ИспользоватьУчетПоИФО", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Запрос.УстановитьПараметр("РегламентнаяВалюта", ОбщегоНазначенияБГУПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	Запрос.УстановитьПараметр("СчетаЦенныхБумаг", БухгалтерскийУчет.СписокСчетов("204.20, 204.31"));
	Запрос.УстановитьПараметр("СубконтоЦенныеБумаги", ПланыВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений);
	
	Если ЗначениеЗаполнено(ДокументОбъект["ВидЦеннойБумаги"]) Тогда
		Запрос.УстановитьПараметр("ВидЦеннойБумаги", ДокументОбъект["ВидЦеннойБумаги"]);
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	ВТЦенныеБумагиСгруппированная.ЦеннаяБумага.ВидЦеннойБумаги = &ВидЦеннойБумаги";
	КонецЕсли;
	
	ДокументОбъект["ЦенныеБумаги"].Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// Флажок <без ограничения>
Функция ФлажокБезОграничения_ПолучитьНастройкиМеханизма() Экспорт
	
	НастройкиМеханизма = Новый Структура();
	НастройкиМеханизма.Вставить("ИмяРеквизитаСсылка", "ИФО");
	НастройкиМеханизма.Вставить("ИмяРеквизитаФлажок", "БезУчетаИФО");
	
	Возврат НастройкиМеханизма;
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ИнвентаризацияЦенныхБумаг";
	КомандаПечати.Идентификатор = "Форма0504081";
	КомандаПечати.Представление = НСтр("ru='Инвентаризационная опись (ф. 0504081)'");
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0504081") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Форма0504081",
			"Инвентаризационная опись ценных бумаг (ф. 0504081)",
			ПечатьФормы0504081(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий
#КонецОбласти
//Код процедур и функций

#Область СлужебныеПроцедурыИФункции

Функция ПечатьФормы0504081(МассивСсылок, ОбъектыПечати)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияЦенныхБумаг.ПФ_MXL_Ф0504081");
	КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияЦенныхБумаг_ф0504081";
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати = КлючПараметровПечати;
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьКомиссия = Макет.ПолучитьОбласть("Комиссия");
	ОбластьДатаПодписиКомиссии = Макет.ПолучитьОбласть("ДатаПодписиКомиссии");
	ОбластьШапка1 = Макет.ПолучитьОбласть("Шапка1");
	ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка1");
	ОбластьИтог1 = Макет.ПолучитьОбласть("Итог1");
	ОбластьОбъяснениеПодвал = Макет.ПолучитьОбласть("ОбъяснениеПодвал");
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
	ОбластьИтог2 = Макет.ПолучитьОбласть("Итог2");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнвентаризацияЦенныхБумаг.Ссылка КАК Ссылка,
	|	ИнвентаризацияЦенныхБумаг.Номер КАК Номер,
	|	ИнвентаризацияЦенныхБумаг.ДатаИнвентаризации КАК ДатаОтчета,
	|	ИнвентаризацияЦенныхБумаг.ДатаИнвентаризации КАК ДатаИнвентаризации,
	|	ИнвентаризацияЦенныхБумаг.Организация.КодОКПО КАК КодОКПО,
	|	ИнвентаризацияЦенныхБумаг.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	ИнвентаризацияЦенныхБумаг.НомерПриказаИнвентаризации КАК НомерПриказаИнвентаризации,
	|	ИнвентаризацияЦенныхБумаг.ДатаПриказаИнвентаризации КАК ДатаПриказаИнвентаризации,
	|	ИнвентаризацияЦенныхБумаг.ДатаНачала КАК ДатаНачала,
	|	ИнвентаризацияЦенныхБумаг.ДатаОкончания КАК ДатаОкончания,
	|	ИнвентаризацияЦенныхБумаг.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	|	ИнвентаризацияЦенныхБумаг.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	|	ИнвентаризацияЦенныхБумаг.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	|	ИнвентаризацияЦенныхБумаг.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	|	ИнвентаризацияЦенныхБумаг.МестоИнвентаризации КАК МестоИнвентаризации,
	|	ИнвентаризацияЦенныхБумаг.ЗаключениеКомиссии КАК ЗаключениеКомиссии,
	|	ИнвентаризацияЦенныхБумаг.ДатаПодписиКомиссии КАК ДатаПодписиКомиссии,
	|	ИнвентаризацияЦенныхБумаг.ВидЦеннойБумаги КАК ВидЦеннойБумаги,
	|	ИнвентаризацияЦенныхБумаг.ОбъяснениеПричинРасхождений КАК ОбъяснениеПричинРасхождений,
	|	ИнвентаризацияЦенныхБумаг.МОЛ КАК МОЛ,
	|	ИнвентаризацияЦенныхБумаг.ДатаПодписиМОЛ КАК ДатаПодписиМОЛ
	|ИЗ
	|	Документ.ИнвентаризацияЦенныхБумаг КАК ИнвентаризацияЦенныхБумаг
	|ГДЕ
	|	ИнвентаризацияЦенныхБумаг.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер,
	|	ДатаОтчета,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.Ссылка КАК Ссылка,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.НомерСтроки КАК НомерСтроки,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.ЦеннаяБумага.Наименование КАК Наименование,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.ЦеннаяБумага.РНФИ КАК Код,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.ЦеннаяБумага.Серия КАК Серия,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.ЦеннаяБумага.Номер КАК Номер,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.ЦеннаяБумага.НоминальнаяСтоимость КАК Номинал,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.Валюта.Код КАК КодВалюты,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.КурсНаДатуВалютирования КАК КурсНаДатуВалютирования,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.КоличествоФакт КАК КоличествоФакт,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.НоминальнаяСтоимостьФакт КАК НоминальнаяСтоимостьФакт,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.НоминальнаяСтоимостьВалютнаяФакт КАК НоминальнаяСтоимостьВалютнаяФакт
	|ИЗ
	|	Документ.ИнвентаризацияЦенныхБумаг.ЦенныеБумаги КАК ИнвентаризацияЦенныхБумагЦенныеБумаги
	|ГДЕ
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(КоличествоФакт),
	|	СУММА(НоминальнаяСтоимостьФакт)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.Ссылка КАК Ссылка,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.НомерСтроки КАК НомерСтроки,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.Курс КАК Курс,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.КоличествоУчет КАК КоличествоУчет,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.НоминальнаяСтоимостьУчет КАК НоминальнаяСтоимостьУчет,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.НоминальнаяСтоимостьВалютнаяУчет КАК НоминальнаяСтоимостьВалютнаяУчет,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.КоличествоНедостача КАК КоличествоНедостача,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.НоминальнаяСтоимостьНедостача КАК НоминальнаяСтоимостьНедостача,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.НоминальнаяСтоимостьВалютнаяНедостача КАК НоминальнаяСтоимостьВалютнаяНедостача,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.КоличествоИзлишки КАК КоличествоИзлишки,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.НоминальнаяСтоимостьИзлишки КАК НоминальнаяСтоимостьИзлишки,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.НоминальнаяСтоимостьВалютнаяИзлишки КАК НоминальнаяСтоимостьВалютнаяИзлишки,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.ПервоначальнаяСтоимостьВалютная КАК ПервоначальнаяСтоимостьВалютная
	|ИЗ
	|	Документ.ИнвентаризацияЦенныхБумаг.ЦенныеБумаги КАК ИнвентаризацияЦенныхБумагЦенныеБумаги
	|ГДЕ
	|	ИнвентаризацияЦенныхБумагЦенныеБумаги.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(КоличествоУчет),
	|	СУММА(НоминальнаяСтоимостьУчет),
	|	СУММА(КоличествоНедостача),
	|	СУММА(НоминальнаяСтоимостьНедостача),
	|	СУММА(КоличествоИзлишки),
	|	СУММА(НоминальнаяСтоимостьИзлишки),
	|	СУММА(ПервоначальнаяСтоимость)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнвентаризацияСоставКомиссии.Ссылка КАК Ссылка,
	|	ИнвентаризацияСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	ИнвентаризацияСоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	|	ИнвентаризацияСоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	|	ИнвентаризацияСоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	|	ИнвентаризацияСоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.ИнвентаризацияЦенныхБумаг.СоставКомиссии КАК ИнвентаризацияСоставКомиссии
	|ГДЕ
	|	ИнвентаризацияСоставКомиссии.Ссылка В(&МассивОбъектов)
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивСсылок);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаШапка = МассивРезультатов[0].Выбрать();
	ВыборкаТЧ1 = МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТЧ2 = МассивРезультатов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКомиссия = МассивРезультатов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Выборки по документам:
	ПервыйДокумент = Истина;
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если ПервыйДокумент Тогда
			ПервыйДокумент = Ложь;
		Иначе
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаШапка);
		
		КомпонентыДатыДляПодписи = ИнвентаризацияСервер.ПолучитьКомпонентыДатыДляПодписи(ВыборкаШапка["ДатаПодписиМОЛ"]);
		ОбластьЗаголовок.Параметры.Заполнить(КомпонентыДатыДляПодписи);
		
		// Сведения о МОЛ
		МОЛ = ВыборкаШапка["МОЛ"];
		МОЛДолжность = "";
		МОЛФИО = "";
		Если ЗначениеЗаполнено(МОЛ) Тогда
			ТребуемыеДанные = Новый Структура("СсылкаНаОбъект, Период, Должность",
				МОЛ, ВыборкаШапка["ДатаИнвентаризации"]);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ТребуемыеДанные);
			
			МОЛДолжность = ТребуемыеДанные.Должность;
			МОЛФИО = Корреспонденты.ФИОПоОбъекту(МОЛ, Истина);
		КонецЕсли;
		
		ЗначенияПараметров = Новый Структура;
		ЗначенияПараметров.Вставить("МОЛДолжность", МОЛДолжность);
		ЗначенияПараметров.Вставить("МОЛФИО", МОЛФИО);
		
		ОбластьЗаголовок.Параметры.Заполнить(ЗначенияПараметров);
		
		ТабДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьЗаключениеКомиссии = СформироватьЗаключениеКомиссии(ВыборкаШапка.ЗаключениеКомиссии, Макет);
		ТабДокумент.Вывести(ОбластьЗаключениеКомиссии);
		
		// Продвигаемся в остальных выборках до текущего документа:
		ПоискТекущегоДокумента = Новый Структура("Ссылка", ВыборкаШапка["Ссылка"]);
		
		ВыборкаКомиссия.Сбросить();
		ВыборкаТЧ1.Сбросить();
		ВыборкаТЧ2.Сбросить();
		
		ВыборкаКомиссия.НайтиСледующий(ПоискТекущегоДокумента);
		ВыборкаТЧ1.НайтиСледующий(ПоискТекущегоДокумента);
		ВыборкаТЧ2.НайтиСледующий(ПоискТекущегоДокумента);
		
		ОбластьВсяКомиссия = УправлениеОсновнымиСредствами.СформироватьОбластьКомиссия(
			ВыборкаШапка, ВыборкаКомиссия.Выбрать(), ОбластьКомиссия, 3);
		ТабДокумент.Вывести(ОбластьВсяКомиссия);
		
		КомпонентыДатыДляПодписи = ИнвентаризацияСервер.ПолучитьКомпонентыДатыДляПодписи(ВыборкаШапка["ДатаПодписиКомиссии"]);
		ОбластьДатаПодписиКомиссии.Параметры.Заполнить(КомпонентыДатыДляПодписи);
		
		ТабДокумент.Вывести(ОбластьДатаПодписиКомиссии);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДокумент.Вывести(ОбластьШапка1);
		
		ВыборкаТЧ1Детальная = ВыборкаТЧ1.Выбрать();
		Пока ВыборкаТЧ1Детальная.Следующий() Цикл
			
			ОбластьСтрока1.Параметры.Заполнить(ВыборкаТЧ1Детальная);
			
			МассивВыводимыхОбластей = Новый Массив;
			МассивВыводимыхОбластей.Добавить(ОбластьСтрока1);
			Если ВыборкаТЧ1Детальная.НомерСтроки = ВыборкаТЧ1Детальная.Количество() Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьИтог1);
			КонецЕсли;
			
			Если НЕ ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьШапка1);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьСтрока1);
			
		КонецЦикла;
		
		ОбластьИтог1.Параметры.Заполнить(ВыборкаТЧ1);
		ТабДокумент.Вывести(ОбластьИтог1);
		
		ТабДокумент.Вывести(ОбластьОбъяснениеПричинРасхождений(ВыборкаШапка.ОбъяснениеПричинРасхождений, Макет));
		
		ТабДокумент.Вывести(ОбластьОбъяснениеПодвал);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДокумент.Вывести(ОбластьШапка2);
		
		ВыборкаТЧ2Детальная = ВыборкаТЧ2.Выбрать();
		Пока ВыборкаТЧ2Детальная.Следующий() Цикл
			
			ОбластьСтрока2.Параметры.Заполнить(ВыборкаТЧ2Детальная);
			
			МассивВыводимыхОбластей = Новый Массив;
			МассивВыводимыхОбластей.Добавить(ОбластьСтрока2);
			Если ВыборкаТЧ2Детальная.НомерСтроки = ВыборкаТЧ2Детальная.Количество() Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьИтог2);
			КонецЕсли;
			
			Если НЕ ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьШапка2);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьСтрока2);
			
		КонецЦикла;
		
		ОбластьИтог2.Параметры.Заполнить(ВыборкаТЧ2);
		ТабДокумент.Вывести(ОбластьИтог2);
		
	КонецЦикла;
	
	// Колонтитулы:
	ТабДокумент.ВерхнийКолонтитул.Выводить = Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 2;
	ТабДокумент.ВерхнийКолонтитул.ТекстСправа = НСтр("ru='Форма 0504081 с.[&НомерСтраницы]'");
	
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьЗаключениеКомиссии(Текст, Макет)
	
	БлокиСтрок = Неопределено;
	
	ИнвентаризацияСервер.ДобавитьОписаниеБлокаСтрок(БлокиСтрок, 1, 160, "ЗаключениеКомиссииСтрока1");
	
	ИнвентаризацияСервер.ДобавитьОписаниеБлокаСтрок(БлокиСтрок, , 190, "ЗаключениеКомиссииСтрока2");
	
	МинимальноеКоличествоСтрок = 3;
	
	Возврат ИнвентаризацияСервер.РазбитьТекстНаБлокиСтрокИВывестиВТабличныйДокумент(Текст, БлокиСтрок, Макет, МинимальноеКоличествоСтрок);
	
КонецФункции

Функция ОбластьОбъяснениеПричинРасхождений(Текст, Макет)
	
	БлокиСтрок = Новый Массив;
	
	ИнвентаризацияСервер.ДобавитьОписаниеБлокаСтрок(БлокиСтрок, , 190, "ОбъяснениеСтрока");
	
	МинимальноеКоличествоСтрок = 3;
	
	Возврат ИнвентаризацияСервер.РазбитьТекстНаБлокиСтрокИВывестиВТабличныйДокумент(Текст, БлокиСтрок, Макет, МинимальноеКоличествоСтрок);
	
КонецФункции

#КонецОбласти

#КонецЕсли
