#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСУНИФО") 
		ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюГИСГМП") Тогда
		Отказ = ПроверитьУникальностьУИВ();
		Если Отказ Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не уникален уникальный идентификатор возврата! Измените реквизиты, по которым формируется идентификатор.'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПлатежноРасчетныеДокументы.ПриЗаписиНаСервереУстановкаСтатуса(Отказ, ЭтотОбъект);
	
КонецПроцедуры	

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьУникальностьУИВ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УведомлениеОВозвратеГИСГМП.Ссылка
		|ИЗ
		|	Документ.УведомлениеОВозвратеГИСГМП КАК УведомлениеОВозвратеГИСГМП
		|ГДЕ
		|	УведомлениеОВозвратеГИСГМП.Ссылка <> &Ссылка
		|	И УведомлениеОВозвратеГИСГМП.УИВ = &УИВ";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("УИВ", УИВ);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Возврат(РезультатЗапроса.Количество() > 0);
	
КонецФункции

#КонецОбласти

#КонецЕсли