///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФизЛицо = Неопределено;
	Если Параметры.Свойство("ФизическоеЛицо",ФизЛицо) Тогда
		Если ТипЗнч(ФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
			ФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизЛицо,"ЮридическоеФизическоеЛицо");
		КонецЕсли;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор, "ФизическоеЛицо", ВидСравненияКомпоновкиДанных.Равно, ФизЛицо, "Физическое лицо", Параметры.Свойство("ФизическоеЛицо"));
КонецПроцедуры