
#Область ОписаниеЗначений

// Статус:
// 0 - Совпадают
// 1 - Различаются
// 2 - Только в БГУ
// 3 - Только в ФРМО

// Операция:
// 1 - Выгрузить
// 2 - Загрузить
// 3 - Удалить
// 4 - Пропустить

// Результат:
// 0 - Подготовлен
// 4 - Пауза
// 5 - Успех
// 6 - Ошибка

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	УстановитьУсловноеОформлениеЭлементовСпискаВыбора(Элементы.ОборудованиеОперация);
	
	Организация = Параметры.Организация;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Элементы.ЗагрузитьОборудование.Доступность = Ложь;
		Элементы.СинхронизироватьОборудование.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Оборудование.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если МожноЗакрытьФорму Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Закрыть помощник синхронизации оборудования ФРМО?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, 30, КодВозвратаДиалога.ОК,, КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("ЭтоОперация") Тогда
			УстановитьОперациюВСтроках(ВыбранноеЗначение);
		ИначеЕсли ВыбранноеЗначение.Свойство("ЭтоОтбор") Тогда
			ОтборСтрок = ВыбранноеЗначение.Отбор;
			УстановитьОтборВСтроках();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПакеты

&НаКлиенте
Процедура ПакетыПриАктивизацииСтроки(Элемент)
	
	Элементы.Оборудование.ОтборСтрок = ОтборСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыПередУдалением(Элемент, Отказ)
	
	ПакетыПроверитьНаличиеСодержимого(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		НовыйПакет = Пакеты.НайтиПоИдентификатору(Элемент.ТекущаяСтрока);
		НовыйПакет.Значение = Новый УникальныйИдентификатор();
		Если Не Копирование Тогда
			НовыйПакет.Представление = ПредставлениеНовогоПакета();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПараметрыПеретаскивания.Значение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение[0]) <> Тип("ДанныеФормыЭлементКоллекции") Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиОборудования = ПараметрыПеретаскивания.Значение;
	
	Если Строка = Неопределено Тогда // Новый пакет
		
		ПакетыПеренестиВНовыйНачало(СтрокиОборудования, Ложь);
		
	Иначе
		
		ПакетПриемник = Пакеты.НайтиПоИдентификатору(Строка).Значение;
		ПакетыПеренестиЗавершение(СтрокиОборудования, ПакетПриемник, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыОборудование

&НаКлиенте
Процедура ОборудованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> Элементы.ОборудованиеРезультат.Имя
		И Поле.Имя <> Элементы.ОборудованиеОперация.Имя Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Оборудование.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = Элементы.ОборудованиеОперация.Имя И ТекущиеДанные.Результат <> 0 И ТекущиеДанные.Результат <> 4 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если Поле.Имя = Элементы.ОборудованиеРезультат.Имя И ТекущиеДанные.Результат = 6 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура("ТекстОшибки", ТекущиеДанные.Сообщение);
		ОткрытьФорму("Обработка.ОбменФРМО.Форма.ФормаОшибка", ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеОперацияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Оборудование.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьРезультатПоОперации(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьОборудование(Команда)
	
	Если Оборудование.Количество() > 0 Тогда
		
		ПакетыОборудования = Новый Соответствие;
		Для Каждого СтрокаОборудования Из Оборудование Цикл
			ПакетыОборудования.Вставить(СтрокаОборудования.Пакет);
		КонецЦикла;
		
		ТекстПакеты = "";
		Если ПакетыОборудования.Количество() > 1 Тогда
			ТекстПакеты = "Распределение по пакетам будет потеряно.";
		КонецЕсли;
		
		ТекстПакетыВставка = ?(ПустаяСтрока(ТекстПакеты), Символы.ПС, Символы.ПС + ТекстПакеты + Символы.ПС);
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Таблица с оборудованием не пустая.%1Перезаполнить?'"), ТекстПакетыВставка);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьОборудованиеПродолжение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьОперацию("ЗагрузитьОборудование");
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьОборудование(Команда)
	
	ТекущийПакет = Элементы.Пакеты.ТекущиеДанные;
	Если ТекущийПакет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиОборудования = Новый Массив;
	Ошибки = Новый Массив;
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаОборудование Из Оборудование Цикл
		
		Если СтрокаОборудование.Пакет = ТекущийПакет.Значение Тогда
			
			НомерСтроки = НомерСтроки + 1;
			
			Если СтрокаОборудование.Результат = 0 Тогда
				
				ИндексСтроки = Оборудование.Индекс(СтрокаОборудование);
				
				Если СтрокаОборудование.Операция = 0 Тогда // Не выбрано
					ДобавитьОшибку(Ошибки, ИндексСтроки, НомерСтроки, "Операция", НСтр("ru = 'Не выбрана операция.'"));
				ИначеЕсли СтрокаОборудование.Операция = 1 Тогда // Выгрузить
					Если СтрокаОборудование.ДанныеБГУ = Неопределено Тогда
						ДобавитьОшибку(Ошибки, ИндексСтроки, НомерСтроки, "ОсновноеСредствоБГУ", НСтр("ru = 'Отсутствуют данные для выгрузки.'"));
					КонецЕсли;
				ИначеЕсли СтрокаОборудование.Операция = 2 Тогда // Загрузить
					Если СтрокаОборудование.ДанныеФРМО = Неопределено Тогда
						ДобавитьОшибку(Ошибки, ИндексСтроки, НомерСтроки, "ОсновноеСредствоФРМО", НСтр("ru = 'Отсутствуют данные для загрузки.'"));
					Иначе
						Если Не ЗначениеЗаполнено(СтрокаОборудование.ОсновноеСредствоБГУ) Тогда
							ДобавитьОшибку(Ошибки, ИндексСтроки, НомерСтроки, "ОсновноеСредствоБГУ", НСтр("ru = 'Не заполнено основное средство.'"));
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				СтрокиОборудования.Добавить(СтрокаОборудование);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Ошибки.Количество() = 0 Тогда
		Если СтрокиОборудования.Количество() = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Отсутствуют выбранные данные для синхронизации.'"));
		Иначе
			ПорцииСтрок = ПорцииСтрокОбмена(СтрокиОборудования);
			Для Каждого ПорцияСтрок Из ПорцииСтрок Цикл
				ПараметрыОперации = Новый Структура("СтрокиОборудования", ПорцияСтрок);
				ВыполнитьОперацию("СинхронизироватьОборудование", ПараметрыОперации);
			КонецЦикла;
		КонецЕсли;
	Иначе
		Для Каждого Ошибка Из Ошибки Цикл
			Путь = СтрШаблон("Оборудование[%1].", Ошибка.Индекс);
			Префикс = СтрШаблон(НСтр("ru = '(стр. %1) '"), Ошибка.Номер);
			ОбщегоНазначенияКлиент.СообщитьПользователю(Префикс + Ошибка.Сообщение,, Путь + Ошибка.Поле);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОперацию(Команда)
	
	Строки = ?(Элементы.Оборудование.ВыделенныеСтроки.Количество() > 1, 1, 0);
	ПараметрыФормы = Новый Структура("Строки", Строки);
	ОткрытьФорму("Обработка.ОбменФРМО.Форма.ФормаУстановитьОперацию", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СравнитьДанные(Команда)
	
	ТекущиеДанные = Элементы.Оборудование.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Новый Структура("ОсновноеСредствоБГУ,ИнвентарныйНомерБГУ,ОсновноеСредствоФРМО,ИнвентарныйНомерФРМО,ДанныеБГУ,ДанныеФРМО");
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, ТекущиеДанные);
	ПараметрыФормы = Новый Структура("ДанныеСтроки", ДанныеСтроки);
	ОткрытьФорму("Обработка.ОбменФРМО.Форма.ФормаСравнение", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанные(Команда)
	
	ТекущиеДанные = Элементы.Оборудование.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ДанныеБГУ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлючЗаписи = ИнтеграцияФРМОКлиент.КлючЗаписиМедицинскоеОборудованиеФРМО(
		Организация, ТекущиеДанные.ОсновноеСредствоБГУ, ТекущиеДанные.ИнвентарныйНомерБГУ);
	ПараметрыФормы = Новый Структура("Ключ", КлючЗаписи);
	ОткрытьФорму("РегистрСведений.МедицинскоеОборудованиеФРМО.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор(Команда)
	
	ПараметрыФормы = Новый Структура("Отбор", ОтборСтрок);
	ОткрытьФорму("Обработка.ОбменФРМО.Форма.ФормаУстановитьОтбор", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыПеренестиВСуществующий(Команда)
	
	СтрокиОборудования = Элементы.Оборудование.ВыделенныеСтроки;
	
	Если СтрокиОборудования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СписокПакетов = Новый СписокЗначений;
	ИдТекущийПакет = Элементы.Пакеты.ТекущиеДанные.Значение;
	Для Каждого Пакет Из Пакеты Цикл
		Если Пакет.Значение <> ИдТекущийПакет Тогда
			СписокПакетов.Добавить(Пакет.Значение, Пакет.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокПакетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("СтрокиОборудования", СтрокиОборудования);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПакетыПеренестиВСуществующийПродолжить", ЭтотОбъект, ДопПараметры);
	СписокПакетов.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru = 'Выберите пакет'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыПеренестиВНовый(Команда)
	
	СтрокиОборудования = Элементы.Оборудование.ВыделенныеСтроки;
	
	Если СтрокиОборудования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПакетыПеренестиВНовыйНачало(СтрокиОборудования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыРаспределить(Команда)
	
	Если Оборудование.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПакетыРаспределитьПродолжить", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Выполнить автоматическое распределение строк оборудования по пакетам?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ПоказатьОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// ЦВЕТ ОПЕРАЦИИ
	
	// Различаются
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОборудованиеОперация.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Оборудование.Статус", ВидСравненияКомпоновкиДанных.Равно, 1);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаОшибкиОтправки);
	
	// Только в БГУ
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОборудованиеОперация.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Оборудование.Статус", ВидСравненияКомпоновкиДанных.Равно, 2);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаУдачнойОтправки);
	
	// Только в ФРМО
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОборудованиеОперация.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Оборудование.Статус", ВидСравненияКомпоновкиДанных.Равно, 3);
	//ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаНеначавшейсяОтправки);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ИзмененноеЗначениеРеквизитаФон);
	
	// ДОСТУПНОСТЬ ИЗМЕНЕНИЯ ОПЕРАЦИИ И ОС
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОборудованиеОперация.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОборудованиеОсновноеСредствоБГУ.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОборудованиеИнвентарныйНомерБГУ.Имя);
	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор,, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"Оборудование.Результат", ВидСравненияКомпоновкиДанных.Равно, 5);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"Оборудование.Результат", ВидСравненияКомпоновкиДанных.Равно, 6);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеЭлементовСпискаВыбора(Элемент)
	
	Для Каждого ЭлементСписка Из Элемент.СписокВыбора Цикл
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элемент.Имя);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, Элемент.ПутьКДанным,
			ВидСравненияКомпоновкиДанных.Равно, ЭлементСписка.Значение);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", ЭлементСписка.Представление);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОборудованиеПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Оборудование.Очистить();
		ВыполнитьОперацию("ЗагрузитьОборудование");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРезультатПоОперации(СтрокаОборудование)
	
	СтрокаОборудование.Результат = ?(СтрокаОборудование.Операция = 4, 4, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОперациюВСтроках(Данные)
	
	Если Данные.Строки = 0 Тогда
		ТекущийПакет = Элементы.Пакеты.ТекущиеДанные;
		Если ТекущийПакет = Неопределено Тогда
			СтрокиТаблицы = Новый Массив;
		Иначе
			СтрокиТаблицы = Оборудование.НайтиСтроки(Новый Структура("Пакет", Элементы.Пакеты.ТекущиеДанные.Значение));
		КонецЕсли;
	Иначе
		СтрокиТаблицы = Новый Массив;
		Для Каждого ВыделеннаяСтрока Из Элементы.Оборудование.ВыделенныеСтроки Цикл
			СтрокиТаблицы.Добавить(Оборудование.НайтиПоИдентификатору(ВыделеннаяСтрока));
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		Если Не Данные.ТолькоПустые Или Не ЗначениеЗаполнено(СтрокаТаблицы.Операция) Тогда
			СтрокаТаблицы.Операция = Данные.Операция;
			УстановитьРезультатПоОперации(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборВСтроках()
	
	Элементы.Оборудование.ОтборСтрок = ОтборСтрок();
	Элементы.ОборудованиеУстановитьОтбор.Пометка = (ОтборСтрок <> Неопределено);
	
КонецПроцедуры

&НаКлиенте
Функция ОтборСтрок()
	
	ТекущийПакет = Элементы.Пакеты.ТекущиеДанные;
	
	Если ТекущийПакет = Неопределено Тогда
		Результат = ОтборСтрок;
	Иначе
		Отбор = Новый Структура(ОтборСтрок);
		Отбор.Вставить("Пакет", ТекущийПакет.Значение);
		Результат = Новый ФиксированнаяСтруктура(Отбор);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьОшибку(Ошибки, Индекс, Номер, Поле, Сообщение)
	
	Ошибки.Добавить(Новый Структура("Индекс,Номер,Поле,Сообщение", Индекс, Номер, Поле, Сообщение));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперацию(Операция, ПараметрыОперации = Неопределено)
	
	ПараметрыОповещения = Новый Структура("Операция,ПараметрыОперации", Операция, ПараметрыОперации);
	Оповещение = Новый ОписаниеОповещения("ВыполнитьОперациюЗавершение", ЭтотОбъект, ПараметрыОповещения);
	ИнтеграцияФРМОКлиент.СформироватьТокенНаКлиенте(Оповещение, Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОперациюЗавершение(НастройкаПодключения, Параметры) Экспорт
	
	Если Параметры.Операция = "ЗагрузитьОборудование" Тогда
		ЗагрузитьОборудованиеОперация(НастройкаПодключения);
	ИначеЕсли Параметры.Операция = "СинхронизироватьОборудование" Тогда
		СинхронизироватьОборудованиеОперация(НастройкаПодключения, Параметры.ПараметрыОперации.СтрокиОборудования);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОборудованиеОперация(НастройкаПодключения)
	
	ОбменНаКлиенте = ИнтеграцияФРМОКлиент.ВыполнятьОбменНаКлиенте(НастройкаПодключения.Организация);
	
	СведенияОборудования = Новый Структура("СписокОборудования,СообщениеОбОшибке", Неопределено, "");
	ДопПараметры = Новый Структура("СписокОборудования,НастройкаПодключения", Неопределено, Неопределено);
	
	Если ОбменНаКлиенте Тогда
		
		ДанныеОборудования = ИнтеграцияФРМОКлиентСервер.ЗагрузитьОборудование(НастройкаПодключения);
		
		Если ЗначениеЗаполнено(ДанныеОборудования.СообщениеОбОшибке) Тогда
			СведенияОборудования.СообщениеОбОшибке = ДанныеОборудования.СообщениеОбОшибке;
		ИначеЕсли ДанныеОборудования.СписокОборудования <> Неопределено Тогда
			ДопПараметры.СписокОборудования = ДанныеОборудования.СписокОборудования;
			СведенияОборудования = ЗагрузитьОборудованиеНаСервере(НастройкаПодключения.Организация, ДопПараметры);
		КонецЕсли;
		
	Иначе
		
		ДопПараметры.НастройкаПодключения = НастройкаПодключения;
		СведенияОборудования = ЗагрузитьОборудованиеНаСервере(НастройкаПодключения.Организация, ДопПараметры);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОборудования.СообщениеОбОшибке) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ДанныеОборудования.СообщениеОбОшибке);
	Иначе
		Оборудование.Очистить();
		Для Каждого СтрокаОборудования Из СведенияОборудования.СписокОборудования Цикл
			ЗаполнитьЗначенияСвойств(Оборудование.Добавить(), СтрокаОборудования);
		КонецЦикла;
	КонецЕсли;
	
	// Общий пакет
	Пакеты.Очистить();
	Пакеты.Добавить(ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор(), НСтр("ru = 'Все'"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьОборудованиеНаСервере(Организация, ДопПараметры)
	
	СведенияОборудования = Новый Структура("СписокОборудования,СообщениеОбОшибке", Неопределено, "");
	
	Если ДопПараметры.СписокОборудования = Неопределено Тогда
		ДанныеОборудования = ИнтеграцияФРМОКлиентСервер.ЗагрузитьОборудование(ДопПараметры.НастройкаПодключения);
		
		Если ЗначениеЗаполнено(ДанныеОборудования.СообщениеОбОшибке) Тогда
			СведенияОборудования.СообщениеОбОшибке = ДанныеОборудования.СообщениеОбОшибке;
			Возврат СведенияОборудования;
		КонецЕсли;
		
		СписокОборудования = ДанныеОборудования.СписокОборудования;
	Иначе
		СписокОборудования = ДопПараметры.СписокОборудования;
	КонецЕсли;
	
	СведенияОборудования.СписокОборудования = ИнтеграцияФРМО.ЗагрузитьОборудование(Организация, СписокОборудования);
	
	Возврат СведенияОборудования;
	
КонецФункции

&НаКлиенте
Процедура СинхронизироватьОборудованиеОперация(НастройкаПодключения, СтрокиОборудования)
	
	ОперацииОборудования = Новый Массив;
	Для Каждого СтрокаОборудования Из СтрокиОборудования Цикл
		ОписаниеОперации = ИнтеграцияФРМОКлиентСервер.ОписаниеОперацииОборудования();
		ЗаполнитьЗначенияСвойств(ОписаниеОперации, СтрокаОборудования);
		ОписаниеОперации.ИндентификаторСтроки = СтрокаОборудования.ПолучитьИдентификатор();
		ОперацииОборудования.Добавить(ОписаниеОперации);
	КонецЦикла;
	
	ОбменНаКлиенте = ИнтеграцияФРМОКлиент.ВыполнятьОбменНаКлиенте(НастройкаПодключения.Организация);
	
	Если ОбменНаКлиенте Тогда
		ИнтеграцияФРМОКлиентСервер.СинхронизироватьОборудование(НастройкаПодключения, ОперацииОборудования);
	КонецЕсли;
	
	РезультатОпераций = СинхронизироватьОборудованиеСервер(НастройкаПодключения, ОперацииОборудования, ОбменНаКлиенте);
	
	Для Каждого СостояниеОперации Из РезультатОпераций.СостояниеОпераций Цикл
		СтрокаОборудования = Оборудование.НайтиПоИдентификатору(СостояниеОперации.ИндентификаторСтроки);
		СтрокаОборудования.Сообщение = СостояниеОперации.Сообщение;
		СтрокаОборудования.Результат = ?(ЗначениеЗаполнено(СтрокаОборудования.Сообщение), 6, 5); // Ошибка | Успех
	КонецЦикла;
	
	Если ЗначениеЗаполнено(РезультатОпераций.СообщениеДанныеОтсутствуют) Тогда
		ПараметрыФормы = Новый Структура("ТекстОшибки", РезультатОпераций.СообщениеДанныеОтсутствуют);
		ОткрытьФорму("Обработка.ОбменФРМО.Форма.ФормаОшибка", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СинхронизироватьОборудованиеСервер(НастройкаПодключения, ОперацииОборудования, ОбменНаКлиенте)
	
	Если Не ОбменНаКлиенте Тогда
		ИнтеграцияФРМОКлиентСервер.СинхронизироватьОборудование(НастройкаПодключения, ОперацииОборудования);
	КонецЕсли;
	
	Результат = ИнтеграцияФРМО.СинхронизироватьОборудование(НастройкаПодключения.Организация, ОперацииОборудования);
	
	Если ЗначениеЗаполнено(Результат.СообщениеДанныеОтсутствуют) Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обмен ФРМО'"),
			УровеньЖурналаРегистрации.Предупреждение,,, Результат.СообщениеДанныеОтсутствуют);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область Пакеты

&НаКлиенте
Процедура ПакетыПроверитьНаличиеСодержимого(Отказ)
	
	ИдУдаляемыхПакетов = Новый Массив;
	Для Каждого СтрокаПакета Из Элементы.Пакеты.ВыделенныеСтроки Цикл
		Пакет = Пакеты.НайтиПоИдентификатору(СтрокаПакета);
		ИдУдаляемыхПакетов.Добавить(Пакет.Значение);
	КонецЦикла;
	
	ЕстьСтрокиОборудования = Ложь;
	Для Каждого СтрокаОборудования Из Оборудование Цикл
		Если ИдУдаляемыхПакетов.Найти(СтрокаОборудования.Пакет) <> Неопределено Тогда
			ЕстьСтрокиОборудования = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьСтрокиОборудования Тогда
		Отказ = Истина;
		ДопПараметры = Новый Структура("ИдУдаляемыхПакетов", ИдУдаляемыхПакетов);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПакетыУдалениеПродолжить", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = НСтр("ru = 'Удаляемые пакеты содержат строки оборудования. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыУдалениеПродолжить(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВсегоПакетов = Пакеты.Количество();
	Для Сч = 1 По ВсегоПакетов Цикл
		СтрокаПакета = Пакеты[ВсегоПакетов - Сч];
		Если Параметры.ИдУдаляемыхПакетов.Найти(СтрокаПакета.Значение) <> Неопределено Тогда
			Пакеты.Удалить(СтрокаПакета);
		КонецЕсли;
	КонецЦикла;
	
	ВсегоОборудования = Оборудование.Количество();
	Для Сч = 1 По ВсегоОборудования Цикл
		СтрокаОборудование = Оборудование[ВсегоОборудования - Сч];
		Если Параметры.ИдУдаляемыхПакетов.Найти(СтрокаОборудование.Пакет) <> Неопределено Тогда
			Оборудование.Удалить(СтрокаОборудование);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыПеренестиВСуществующийПродолжить(ВыбранныйЭлемент, Параметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПакетыПеренестиЗавершение(Параметры.СтрокиОборудования, ВыбранныйЭлемент.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыПеренестиВНовыйНачало(СтрокиОборудования, Идентификаторами = Истина)
	
	ДопПараметры = Новый Структура("СтрокиОборудования,Идентификаторами", СтрокиОборудования, Идентификаторами);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПакетыПеренестиВНовыйПродолжить", ЭтотОбъект, ДопПараметры);
	ПоказатьВводСтроки(ОписаниеОповещения, ПредставлениеНовогоПакета(), НСтр("ru = 'Введите название пакета'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыПеренестиВНовыйПродолжить(Строка, Параметры) Экспорт
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПакетыПеренестиВНовыйЗавершение(Строка, Параметры.СтрокиОборудования, Параметры.Идентификаторами)
	
КонецПроцедуры 

&НаКлиенте
Процедура ПакетыПеренестиВНовыйЗавершение(НазваниеПакета, СтрокиОборудования, Идентификаторами)
	
	НовыйПакет = Пакеты.Добавить();
	НовыйПакет.Значение = Новый УникальныйИдентификатор;
	НовыйПакет.Представление = НазваниеПакета;
	
	ПакетыПеренестиЗавершение(СтрокиОборудования, НовыйПакет.Значение, Идентификаторами);
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыПеренестиЗавершение(СтрокиОборудования, Пакет, Идентификаторами = Истина)
	
	Для Каждого СтрокаОборудование Из СтрокиОборудования Цикл
		СтрокаТаблицы = ?(Идентификаторами, Оборудование.НайтиПоИдентификатору(СтрокаОборудование), СтрокаОборудование);
		СтрокаТаблицы.Пакет = Пакет;
	КонецЦикла;
	
	Элементы.Оборудование.ОтборСтрок = ОтборСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПакетыРаспределитьПродолжить(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПакетыРаспределитьЗавершение();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПакетыРаспределитьЗавершение()
	
	ПакетБезИнвНомеров		= Новый Массив;
	ПакетСовпадают			= Новый Массив;
	ПакетФРМОНовые			= Новый Массив;
	ПакетБГУ				= Новый Массив;
	ПакетФРМОНеизвестные	= Новый Массив;
	ПакетРазличаются		= Новый Массив;
	
	Для Каждого СтрокаОборудование Из Оборудование Цикл
		
		Если СтрокаОборудование.Статус = 0 Тогда // Совпадают
			
			ПакетСовпадают.Добавить(СтрокаОборудование);
			
		ИначеЕсли СтрокаОборудование.Статус = 1 Тогда // Различаются
			
			ПакетРазличаются.Добавить(СтрокаОборудование);
			
		ИначеЕсли СтрокаОборудование.Статус = 2 Тогда // Только в БГУ
			
			Если Не ЗначениеЗаполнено(СтрокаОборудование.ИнвентарныйНомерБГУ) Тогда
				
				ПакетБезИнвНомеров.Добавить(СтрокаОборудование);
				
			Иначе
				
				ПакетБГУ.Добавить(СтрокаОборудование);
				
			КонецЕсли;
			
		ИначеЕсли СтрокаОборудование.Статус = 3 Тогда // Только в ФРМО
			
			Если Не ЗначениеЗаполнено(СтрокаОборудование.ИнвентарныйНомерФРМО) Тогда
				
				ПакетБезИнвНомеров.Добавить(СтрокаОборудование);
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаОборудование.ИнвентарныйНомерБГУ) Тогда // Есть ОС
				
				ПакетФРМОНовые.Добавить(СтрокаОборудование);
				
			Иначе
				
				ПакетФРМОНеизвестные.Добавить(СтрокаОборудование);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Пакеты.Очистить();
	
	РаспределитьСтрокиВНовыйПакет(ПакетБезИнвНомеров	, НСтр("ru = 'Без инвентарных номеров'")					, 4				); // Пропустить
	РаспределитьСтрокиВНовыйПакет(ПакетСовпадают		, НСтр("ru = 'Данные совпадают'")							, 4				); // Пропустить
	РаспределитьСтрокиВНовыйПакет(ПакетФРМОНовые		, НСтр("ru = 'Есть только в ФРМО, найдены соответствия'")	, 2				); // Загрузить
	РаспределитьСтрокиВНовыйПакет(ПакетБГУ				, НСтр("ru = 'Есть только в БГУ'")							, 1				); // Выгрузить
	РаспределитьСтрокиВНовыйПакет(ПакетФРМОНеизвестные	, НСтр("ru = 'Есть только в ФРМО, без соответствия'")		, Неопределено	); // Не менять
	РаспределитьСтрокиВНовыйПакет(ПакетРазличаются		, НСтр("ru = 'Данные различаются'")							, Неопределено	); // Не менять
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСтрокиВНовыйПакет(СтрокиОборудования, НазваниеПакета, Операция)
	
	Если СтрокиОборудования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Операция <> Неопределено Тогда
		Для Каждого СтрокаОборудование Из СтрокиОборудования Цикл
			СтрокаОборудование.Операция = Операция;
			УстановитьРезультатПоОперации(СтрокаОборудование);
		КонецЦикла;
	КонецЕсли;
	
	ПакетыПеренестиВНовыйЗавершение(НазваниеПакета, СтрокиОборудования, Ложь);
	
КонецПроцедуры

&НаКлиенте
Функция ПредставлениеНовогоПакета()
	
	ПрефиксПакета = "Пакет";
	
	Возврат ПрефиксПакета + " " + Формат(МаксимальныйНомерПакета(ПрефиксПакета) + 1, "ЧН=0; ЧГ=0");
	
КонецФункции

&НаКлиенте
Функция МаксимальныйНомерПакета(ПрефиксПакета)
	
	Результат = 0;
	
	ДлинаПрефикса = СтрДлина(ПрефиксПакета);
	
	Для Каждого Пакет Из Пакеты Цикл
		Если СтрНачинаетсяС(Пакет.Представление, ПрефиксПакета) Тогда
			ВозможныйНомер = СокрЛП(Сред(Пакет.Представление, ДлинаПрефикса + 1));
			Если ОбщегоНазначенияКлиентСервер.ЭтоЧисло(ВозможныйНомер) Тогда
				Номер = Число(ВозможныйНомер);
				Если Номер > Результат Тогда
					Результат = Номер;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Функция - Порции строк обмена
// 
// Если для обмена используется токен:
// Срок жизни токена - 5 минут. Токен формируется не на каждый обмен, а на порцию.
// Чтобы обмен успел выполниться за время жизни токена, порция должна быть ограничена.
// Сначала формируются порции, которые требуют токен (Выгрузить, Удалить).
// В конце будет одна порция на Загрузку, по ее окончанию формируется сообщение об отсутствующих данных.
// Если токен не используются, то все строки помещаются в одну порцию.
//
// Параметры:
//  СтрокиОборудования	 - 	Массив - строки оборудования для синхронизации
// 
// Возвращаемое значение:
//  Массив - список порций строк оборудования, по которым будет выполнена синронизация
//
&НаКлиенте
Функция ПорцииСтрокОбмена(СтрокиОборудования)
	
	ПрямойОбменИПС = ИнтеграцияФРМОВызовСервера.ПрямойОбменИПС(Организация);
	
	Если Не ПрямойОбменИПС Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокиОборудования);
	КонецЕсли;
	
	Результат			= Новый Массив;
	ПорцияЗагрузки		= Новый Массив;
	РазмерПорции		= 30;
	
	КоличествоВПорции	= 0;
	Порция				= Новый Массив;
	
	Для Каждого СтрокаОборудования Из СтрокиОборудования Цикл
		Если СтрокаОборудования.Операция = 1 Или СтрокаОборудования.Операция = 3 Тогда // Выгрузить, Удалить
			Если КоличествоВПорции < РазмерПорции Тогда
				КоличествоВПорции = КоличествоВПорции + 1;
			Иначе
				Результат.Добавить(Порция);
				Порция = Новый Массив;
			КонецЕсли;
			Порция.Добавить(СтрокаОборудования);
		ИначеЕсли СтрокаОборудования.Операция = 2 Тогда // Загрузить
			ПорцияЗагрузки.Добавить(СтрокаОборудования);
		КонецЕсли;
	КонецЦикла;
	
	Если Порция.Количество() > 0 Тогда
		Результат.Добавить(Порция);
	КонецЕсли;
		
	Если ПорцияЗагрузки.Количество() > 0 Тогда
		Результат.Добавить(ПорцияЗагрузки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		МожноЗакрытьФорму = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПоказатьОтчет()
	
	Коллекция = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Отчет");
	
	Коллекция[0].ТабличныйДокумент = Отчет();
	
	ПараметрыПечатнойФормы = Новый Структура;
	ПараметрыПечатнойФормы.Вставить("КоллекцияПечатныхФорм", Коллекция);
	ПараметрыПечатнойФормы.Вставить("ПараметрКоманды", Новый Массив);
	ПараметрыПечатнойФормы.Вставить("ПараметрыВывода", Новый Структура("ЗаголовокФормы", НСтр("ru = 'Отчет'")));
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыПечатнойФормы, ЭтаФорма);
	
КонецФункции

&НаСервере
Функция Отчет()
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ОбменФРМО.Отчет");
	
	ОбластьШапка	 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСводкаШапка	= Макет.ПолучитьОбласть("СводкаШапка");
	ОбластьСводкаСтрока	= Макет.ПолучитьОбласть("СводкаСтрока");
	ОбластьОшибкиШапка	= Макет.ПолучитьОбласть("ОшибкиШапка");
	ОбластьОшибкиСтрока	= Макет.ПолучитьОбласть("ОшибкиСтрока");
	
	ТабДок						= Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.ТолькоПросмотр		= Истина;
	ТабДок.КлючПараметровПечати	= "ПараметрыПечати_ОбменФРМО_Отчет";

	
	ТекущаяСтрокаПакет = Элементы.Пакеты.ТекущаяСтрока;
	ТекущийПакет = ?(ТекущаяСтрокаПакет = Неопределено, Неопределено, Пакеты.НайтиПоИдентификатору(ТекущаяСтрокаПакет));
	ИмяПакета = ?(ТекущийПакет = Неопределено, НСтр("ru = 'Не выбран'"), ТекущийПакет.Представление);
	
	ОбластьШапка.Параметры.Заполнить(Новый Структура("Пакет", ИмяПакета));
	ТабДок.Вывести(ОбластьШапка);
	
	Если ТекущийПакет = Неопределено Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	СтрокиОборудования = Оборудование.НайтиСтроки(Новый Структура("Пакет", ТекущийПакет.Значение));
	
	Если СтрокиОборудования.Количество() = 0 Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	// Сводка
	
	ТабДок.Вывести(ОбластьСводкаШапка);
	
	Операции = Новый Соответствие;
	Операции.Вставить(1, "Выгрузить");
	Операции.Вставить(2, "Загрузить");
	Операции.Вставить(3, "Удалить");
	Операции.Вставить(4, "Пропустить");
	Операции.Вставить(0, "<не выбрана>");
	
	КоличествоОпераций = Новый Соответствие;
	Для Каждого Операция Из Операции Цикл
		КоличествоОпераций.Вставить(Операция.Ключ, Новый Структура("Всего,Успех,Ошибка", 0, 0, 0));
	КонецЦикла;
	
	Для Каждого СтрокаОборудование Из СтрокиОборудования Цикл
		
		СводкаОперации = КоличествоОпераций[СтрокаОборудование.Операция];
		СводкаОперации.Всего = СводкаОперации.Всего + 1;
		Если СтрокаОборудование.Результат = 5 Тогда
			СводкаОперации.Успех = СводкаОперации.Успех + 1;
		ИначеЕсли СтрокаОборудование.Результат = 6 Тогда
			СводкаОперации.Ошибка = СводкаОперации.Ошибка + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Операция Из КоличествоОпераций Цикл
		Если Операция.Значение.Всего > 0 Тогда
			ОбластьСводкаСтрока.Параметры.Заполнить(Новый Структура("Операция", Операции[Операция.Ключ]));
			ОбластьСводкаСтрока.Параметры.Заполнить(Операция.Значение);
			ТабДок.Вывести(ОбластьСводкаСтрока);
		КонецЕсли;
	КонецЦикла;
	
	// Ошибки
	
	ТабДок.Вывести(ОбластьОшибкиШапка);
	
	НомерСтроки = 1;
	
	Для Каждого СтрокаОборудование Из СтрокиОборудования Цикл
		
		Если СтрокаОборудование.Результат = 6 Тогда // Ошибка
			
			Операция = Операции[СтрокаОборудование.Операция];
			ДопПараметры = Новый Структура("НомерСтроки,Операция", НомерСтроки, Операция);
			
			ОбластьОшибкиСтрока.Параметры.Заполнить(СтрокаОборудование);
			ОбластьОшибкиСтрока.Параметры.Заполнить(ДопПараметры);
			
			ТабДок.Вывести(ОбластьОшибкиСтрока);
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти
