
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрПодразделение = Новый ПараметрКомпоновкиДанных("Подразделение");
	ПараметрЗаголовок = Новый ПараметрКомпоновкиДанных("Заголовок");
	ПараметрКомпоновкиПодразделение = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрПодразделение);
	ПараметрКомпоновкиЗаголовок = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрЗаголовок);
	
	Для Каждого ПараметрКомпоновки Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ПараметрКомпоновки.ИдентификаторПользовательскойНастройки = ПараметрКомпоновкиПодразделение.ИдентификаторПользовательскойНастройки Тогда 
			Если ПараметрКомпоновки.Использование Тогда 
				ПараметрКомпоновкиЗаголовок.Значение = Символы.ПС + Символы.ПС + ПараметрКомпоновки.Значение;
			Иначе
				ПараметрКомпоновкиЗаголовок.Значение = "";
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры
