#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Контрагент");
	Результат.Добавить("Организация");
		
	Возврат Результат;
	
КонецФункции

Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт 

	Результат = Новый Массив;
	Результат.Добавить("Контрагент");
		
	Возврат Результат;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоГруппа ИЛИ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет данные в строки динамического списка. Заполняемые данные определяются параметром ПолучаемыеДанные,
// если ПолучаемыеДанные = Неопределено, то получаются все возможные данные.
// 
// Параметры:
// 	Строки - СтрокиДинамическогоСписка -
// 	НаДату - Дата -
// 	ПолучаемыеДанные - Неопределено, Структура - см. ДанныеСпискаПолучаемыеОтложенно.
Процедура ЗаполнитьДанныеИОформлениеВСтрокахСписка(Строки, НаДату, Знач ПолучаемыеДанные = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(НаДату) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучаемыеДанные = Неопределено Тогда
		ПолучаемыеДанные = ДанныеСпискаПолучаемыеОтложенно();
	КонецЕсли;
	
	ДанныеДетей = ДанныеСвязанныхРегистровДляСписков(Строки, НаДату, ПолучаемыеДанные);
	
	Для каждого Строка Из Строки Цикл
	
		ЗаполнитьЗначенияСвойств(Строка.Значение.Данные, ДанныеДетей.Получить(Строка.Ключ));
		УстановитьОформлениеВСтроке(Строка);
	
	КонецЦикла;
	
КонецПроцедуры


// Устанавливает ограничение полей на использование в отборах, сортировках и группировках.
// Удаляет из настроек сортировки и группировки поля, на которые устновлены ограничения.
// 
// Параметры:
// 	Список - ДинамическийСписок -
// 	ПоляСОтложеннымЗаполнением - Неопределено, Структура - см. ДанныеСпискаПолучаемыеОтложенно.
Процедура УстановитьОграничениеИспользованияПолейСписка(Список, Знач ПоляСОтложеннымЗаполнением = Неопределено) Экспорт

	Если ПоляСОтложеннымЗаполнением = Неопределено Тогда
		ПоляСОтложеннымЗаполнением = ДанныеСпискаПолучаемыеОтложенно();
	КонецЕсли;
	
	ДинамическиПолучаемыеПоля = Новый Массив;
	Если ПоляСОтложеннымЗаполнением.Свойство("СоставГруппДДУ") Тогда
		ДинамическиПолучаемыеПоля.Добавить("Договор");
		ДинамическиПолучаемыеПоля.Добавить("ГруппаДетскогоУчреждения");
		ДинамическиПолучаемыеПоля.Добавить("СтавкаОплаты");
		ДинамическиПолучаемыеПоля.Добавить("Льгота");
	КонецЕсли;
	Если ПоляСОтложеннымЗаполнением.Свойство("СоставГруппДДУДополнительныеУслуги") Тогда
		ДинамическиПолучаемыеПоля.Добавить("КоличествоГруппДопУслуг");
	КонецЕсли;
	Если ПоляСОтложеннымЗаполнением.Свойство("ПараметрыКомпенсацииРодительскойПлатыПоДетям") Тогда
		ДинамическиПолучаемыеПоля.Добавить("ПроцентКомпенсации");
	КонецЕсли;
	Если ПоляСОтложеннымЗаполнением.Свойство("ПлательщикиПоУслугамДДУ") Тогда
		ДинамическиПолучаемыеПоля.Добавить("Плательщик");
		ДинамическиПолучаемыеПоля.Добавить("СчетПлательщика");
	КонецЕсли;
	
	ЗапрещенныеПоляОтбора = Новый Массив;
	ЗапрещенныеПоляОтбора.Добавить("ДетиВыбраннойГруппы");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗапрещенныеПоляОтбора, ДинамическиПолучаемыеПоля);
	
	Список.УстановитьОграниченияИспользованияВОтборе(ЗапрещенныеПоляОтбора);
	Список.УстановитьОграниченияИспользованияВГруппировке(ДинамическиПолучаемыеПоля);
	Список.УстановитьОграниченияИспользованияВПорядке(ДинамическиПолучаемыеПоля);
	
	УдалитьЗапрещенныеПоляИзНастройкиСписка(Список, ДинамическиПолучаемыеПоля);
КонецПроцедуры

// Определяет регистры из которых необходимо получать данные для динамического списка.
// 
// Параметры:
// 	ПлательщикиПоУслугамДДУ - Булево - Получать данные из регистра "ПлательщикиПоУслугамДДУ"
// 	ПараметрыКомпенсацииРодительскойПлатыПоДетям - Булево - Получать данные из регистра "ПараметрыКомпенсацииРодительскойПлатыПоДетям"
// Возвращаемое значение:
// 	Структура - Имена регистров из которых необходимо получить данные:
// * ПараметрыКомпенсацииРодительскойПлатыПоДетям
// * ПлательщикиПоУслугамДДУ 
// * СоставГруппДДУ 
// * СоставГруппДДУДополнительныеУслуги 
Функция ДанныеСпискаПолучаемыеОтложенно(ПлательщикиПоУслугамДДУ = Истина,
	ПараметрыКомпенсацииРодительскойПлатыПоДетям = Истина) Экспорт
	
	ПолучаемыеДанные = Новый Структура("СоставГруппДДУ, СоставГруппДДУДополнительныеУслуги");
	Если ПлательщикиПоУслугамДДУ Тогда
		ПолучаемыеДанные.Вставить("ПлательщикиПоУслугамДДУ");
	КонецЕсли;
	Если ПараметрыКомпенсацииРодительскойПлатыПоДетям Тогда
		ПолучаемыеДанные.Вставить("ПараметрыКомпенсацииРодительскойПлатыПоДетям");
	КонецЕсли;
	
	Возврат ПолучаемыеДанные;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьЗапрещенныеПоляИзНастройкиСписка(Список, ЗапрещенныеПоля)
	НеОсталосьПолейПорядка = Ложь;
	Для Каждого ЭлементНастройки Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ПорядокКомпоновкиДанных") Тогда
			УдалитьЗапрещенныеПоля(ЭлементНастройки.Элементы, ЗапрещенныеПоля);
			НеОсталосьПолейПорядка = ЭлементНастройки.Элементы.Количество() = 0;
		ИначеЕсли ТипЗнч(ЭлементНастройки) = Тип("СтруктураНастроекКомпоновкиДанных") Тогда
			Для Каждого СоставЭлементаНастройки Из ЭлементНастройки.Структура Цикл
				УдалитьЗапрещенныеПоля(СоставЭлементаНастройки.ПоляГруппировки.Элементы, ЗапрещенныеПоля);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Если НеОсталосьПолейПорядка Тогда
		Список.КомпоновщикНастроек.ЗагрузитьНастройки(Список.КомпоновщикНастроек.Настройки);
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьЗапрещенныеПоля(Элементы, ЗапрещенныеПоля)
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого ЭлементНастройки Из Элементы Цикл
		Если ЭлементНастройки.Использование И ЗапрещенныеПоля.Найти(Строка(ЭлементНастройки.Поле)) <> Неопределено Тогда
			УдаляемыеЭлементы.Добавить(ЭлементНастройки);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Элемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
КонецПроцедуры

Функция ДанныеСвязанныхРегистровДляСписков(Строки, НаДату, Регистры)

	Данные = Новый Соответствие;
	Дети = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из Строки Цикл
		НовыеДанныеРебенка = ДанныеРебенка();
		ЗаполнитьЗначенияСвойств(НовыеДанныеРебенка, ТекущаяСтрока.Значение.Данные);
		Данные.Вставить(ТекущаяСтрока.Ключ, НовыеДанныеРебенка);
		Дети.Добавить(ТекущаяСтрока.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Дети",   Дети);
	
	ЗапросыПакета = Новый Массив;
	Если Регистры.Свойство("ПлательщикиПоУслугамДДУ") Тогда
		ЗапросыПакета.Добавить(
		"ВЫБРАТЬ
		|	ПлательщикиПоУслугамДДУСрезПоследних.Ребенок КАК Ребенок,
		|	ПлательщикиПоУслугамДДУСрезПоследних.Плательщик КАК Плательщик,
		|	ПлательщикиПоУслугамДДУСрезПоследних.СчетПлательщика КАК СчетПлательщика
		|ИЗ
		|	РегистрСведений.ПлательщикиПоУслугамДДУ.СрезПоследних(&НаДату, Ребенок В (&Дети)) КАК ПлательщикиПоУслугамДДУСрезПоследних");
	КонецЕсли;
	Если Регистры.Свойство("СоставГруппДДУ") Тогда
		ЗапросыПакета.Добавить(
		"ВЫБРАТЬ
		|	СоставГруппДДУСрезПоследних.Ребенок КАК Ребенок,
		|	СоставГруппДДУСрезПоследних.ГруппаДетскогоУчреждения КАК ГруппаДетскогоУчреждения,
		|	СоставГруппДДУСрезПоследних.Льгота КАК Льгота,
		|	СоставГруппДДУСрезПоследних.СтавкаОплаты КАК СтавкаОплаты,
		|	СоставГруппДДУСрезПоследних.Договор КАК Договор
		|ИЗ
		|	РегистрСведений.СоставГруппДДУ.СрезПоследних(&НаДату, Ребенок В (&Дети)) КАК СоставГруппДДУСрезПоследних");
	КонецЕсли;
	Если Регистры.Свойство("СоставГруппДДУДополнительныеУслуги") Тогда
		ЗапросыПакета.Добавить(
		"ВЫБРАТЬ
		|	СоставГруппДДУДополнительныеУслугиСрезПоследних.Ребенок КАК Ребенок,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоставГруппДДУДополнительныеУслугиСрезПоследних.ГруппаДетскогоУчреждения) КАК КоличествоГруппДопУслуг
		|ИЗ
		|	РегистрСведений.СоставГруппДДУДополнительныеУслуги.СрезПоследних(&НаДату, Ребенок В (&Дети)) КАК СоставГруппДДУДополнительныеУслугиСрезПоследних
		|ГДЕ
		|	СоставГруппДДУДополнительныеУслугиСрезПоследних.Актуальность
		|
		|СГРУППИРОВАТЬ ПО
		|	СоставГруппДДУДополнительныеУслугиСрезПоследних.Ребенок");
	КонецЕсли;
	Если ЗапросыПакета.Количество() > 0 Тогда
	
		Запрос.Текст = СтрСоединить(ЗапросыПакета, ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета());
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Для каждого ЭлементПакета Из РезультатЗапроса Цикл
			ЗаполнитьДанныеДетейИзВыборки(Данные, ЭлементПакета.Выбрать());
		КонецЦикла;
		
	КонецЕсли;
	
	Если Регистры.Свойство("ПараметрыКомпенсацииРодительскойПлатыПоДетям")
		И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПараметрыКомпенсацииРодительскойПлатыПоДетям) Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПараметрыКомпенсацииРодительскойПлатыПоДетям.Ребенок КАК Ребенок,
		|	ПараметрыКомпенсацииРодительскойПлатыПоДетям.Ставка КАК ПроцентКомпенсации
		|ИЗ
		|	РегистрСведений.ПараметрыКомпенсацииРодительскойПлатыПоДетям КАК ПараметрыКомпенсацииРодительскойПлатыПоДетям
		|ГДЕ
		|	ПараметрыКомпенсацииРодительскойПлатыПоДетям.ДатаНачала <= &НаДату
		|	И (ПараметрыКомпенсацииРодительскойПлатыПоДетям.ДатаОкончания >= &НаДату
		|			ИЛИ ПараметрыКомпенсацииРодительскойПлатыПоДетям.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|	И ПараметрыКомпенсацииРодительскойПлатыПоДетям.Ставка <> 0
		|	И ПараметрыКомпенсацииРодительскойПлатыПоДетям.Ребенок В(&Дети)";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеРебенка = Данные.Получить(Выборка.Ребенок);
			Если ДанныеРебенка = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ДанныеРебенка.ПроцентКомпенсации = 0 Тогда
				ДанныеРебенка.ПроцентКомпенсации = Выборка.ПроцентКомпенсации;
			Иначе
				ДанныеРебенка.ПроцентКомпенсации = -1;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат Данные;

КонецФункции

Процедура УстановитьОформлениеВСтроке(Строка)

	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Строка.Значение.Данные, "ПроцентКомпенсации", 0) < 0 Тогда
		УстановитьОформлениеМногоКомпенсаций(Строка.Значение.Оформление);
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Строка.Значение.Данные, "КоличествоГруппДопУслуг", -1) = 0 Тогда
		УстановитьОформлениеНетДопГрупп(Строка.Значение.Оформление);
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьОформлениеМногоКомпенсаций(ОформлениеСтроки)

	Ячейка = ОформлениеСтроки.Получить("ПроцентКомпенсации");
	Ячейка.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Ячейка.УстановитьЗначениеПараметра("Текст",      НСтр("ru = 'несколько компенсаций'"));

КонецПроцедуры

Процедура УстановитьОформлениеНетДопГрупп(ОформлениеСтроки)

	Ячейка = ОформлениеСтроки.Получить("КоличествоГруппДопУслуг");
	Ячейка.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Ячейка.УстановитьЗначениеПараметра("Текст",      НСтр("ru = '-'"));

КонецПроцедуры

Процедура ЗаполнитьДанныеДетейИзВыборки(Данные, Выборка)

	Пока Выборка.Следующий() Цикл
		
		ДанныеРебенка = Данные.Получить(Выборка.Ребенок);
		Если ДанныеРебенка <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ДанныеРебенка, Выборка);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция ДанныеРебенка()

	Данные = Новый Структура("Плательщик, СчетПлательщика, ГруппаДетскогоУчреждения, Договор, СтавкаОплаты, Льгота, КоличествоГруппДопУслуг, ПроцентКомпенсации");
	Данные.Плательщик               = Справочники.Контрагенты.ПустаяСсылка();
	Данные.СчетПлательщика          = Справочники.БанковскиеИКазначейскиеСчета.ПустаяСсылка();
	Данные.ГруппаДетскогоУчреждения = Справочники.ГруппыДетскогоУчреждения.ПустаяСсылка();
	Данные.Договор                  = Справочники.Договоры.ПустаяСсылка();
	Данные.СтавкаОплаты             = Справочники.СтавкиОплатыОбразование.ПустаяСсылка();
	Данные.Льгота                   = Справочники.ЛьготыСтудентов.ПустаяСсылка();
	Данные.КоличествоГруппДопУслуг  = 0;
	Данные.ПроцентКомпенсации       = 0;
	
	Возврат Данные;

КонецФункции

Функция ДанныеОбновленыНаНовуюВерсиюПрограммы(МетаданныеИОтбор) Экспорт

	Если МетаданныеИОтбор.ПолноеИмя = "РегистрСведений.ПлательщикиПоУслугамДДУ"
		ИЛИ МетаданныеИОтбор.ПолноеИмя = "РегистрСведений.ПараметрыКомпенсацииРодительскойПлатыПоДетям" Тогда
		
		Возврат ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы(МетаданныеИОтбор);
		
	ИначеЕсли МетаданныеИОтбор.ПолноеИмя = "Справочник.Дети" Тогда
		
		Возврат РегистрОбновлен("РегистрСведений.ПлательщикиПоУслугамДДУ", МетаданныеИОтбор)
			И РегистрОбновлен("РегистрСведений.ПараметрыКомпенсацииРодительскойПлатыПоДетям", МетаданныеИОтбор);
			
	ИначеЕсли МетаданныеИОтбор.ПолноеИмя = "Документ.НачислениеКомпенсацииРодительскойПлаты"
		ИЛИ МетаданныеИОтбор.ПолноеИмя = "Документ.КомпенсацияРодительскойПлаты" Тогда
		
		Возврат ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, "РегистрСведений.ПлательщикиПоУслугамДДУ")
			И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, "РегистрСведений.ПараметрыКомпенсацииРодительскойПлатыПоДетям");
			
	Иначе
			
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Функция проверки не может использоваться для этого объекта: %1'"),
			МетаданныеИОтбор.ПолноеИмя);
		
	КонецЕсли;

КонецФункции

Функция РегистрОбновлен(ИмяРегистра, МетаданныеИОтбор)
	
	Отбор = Новый Структура("Организация, Ребенок",
		МетаданныеИОтбор.Данные.Организация,
		МетаданныеИОтбор.Данные.Ссылка);
		
	ПроверяемыеМетаданные = Новый Структура;
	ПроверяемыеМетаданные.Вставить("Данные",     МетаданныеИОтбор.Данные);
	ПроверяемыеМетаданные.Вставить("Метаданные", Метаданные.НайтиПоПолномуИмени(ИмяРегистра));
	ПроверяемыеМетаданные.Вставить("ПолноеИмя",  ИмяРегистра);
	ПроверяемыеМетаданные.Вставить("Отбор",      Отбор);
	ПроверяемыеМетаданные.Вставить("ЭтоНовый",   МетаданныеИОтбор.ЭтоНовый);
	
	Возврат ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы(ПроверяемыеМетаданные);
	
КонецФункции

#КонецОбласти

#КонецЕсли