
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НаименованиеПараметра") Тогда
		Заголовок = Параметры.НаименованиеПараметра;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущееЗначение") Тогда
		ТекущееЗначение = Параметры.ТекущееЗначение;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.ДоступныеЗначения) = Тип("Массив") Тогда
		Элементы.ТекущееЗначение.КнопкаВыпадающегоСписка = Истина;
		Для Каждого ЭлМас Из Параметры.ДоступныеЗначения Цикл
			Элементы.ТекущееЗначение.СписокВыбора.Добавить(ЭлМас);
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗначенияПараметровПоДатам") Тогда
		Для Каждого ПереданныйПараметр Из Параметры.ЗначенияПараметровПоДатам Цикл
			НоваяСтрока = ЗначенияПараметров.Добавить();
			НоваяСтрока.ДатаСохранения = ПереданныйПараметр.Ключ;
			НоваяСтрока.ЗначениеПараметра = ПереданныйПараметр.Значение;
		КонецЦикла;
		ЗначенияПараметров.Сортировать("ДатаСохранения УБЫВ");
	КонецЕсли;
	
	Если ЗначенияПараметров.Количество() = 0 Тогда
		Элементы.ЗначенияПараметров.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПараметровВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущееЗначение = Элементы.ЗначенияПараметров.ТекущиеДанные.ЗначениеПараметра; 
	
	ОповеститьОВыбореПоТекущемуЗначению();

КонецПроцедуры

&НаКлиенте
Процедура КнопкаОК(Команда)
	ОповеститьОВыбореПоТекущемуЗначению();
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОВыбореПоТекущемуЗначению()
	
	ОповеститьОВыборе(ТекущееЗначение);
	
КонецПроцедуры