////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контрольные соотношения".
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Асинх Процедура ПроверитьОтчетыКлиентВнутр(ДополнительныеПараметры) Экспорт 
	
	СтрокиОтчетов = ДополнительныеПараметры.СтрокиОтчетов;
	
	Если СтрокиОтчетов.Количество() > 30 Тогда
						
		Шаблон = НСтр(
			"ru = 'Для открытия выбрано довольно большое количество строк: %1. 
			|Вывод протоколов проверки для них может занять несколько минут.
			|Вы действительно хотите продолжить?'");
		Вопрос = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,СтрокиОтчетов.Количество());
		
		Ответ = Ждать ВопросАсинх(Вопрос, РежимДиалогаВопрос.ДаНет);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
				
	КонецЕсли;
	
	РезультатПроверки = КонтрольныеСоотношенияВызовСервера.ПроверитьОтчеты(СтрокиОтчетов, ДополнительныеПараметры.ВидКС, ДополнительныеПараметры.ТолькоОшибочные);
			
	Если ДополнительныеПараметры.СтрокиОтчетов.Количество() = 1 
		И ДополнительныеПараметры.ТолькоОшибочные 
		И РезультатПроверки.ПроверкаВыполненаУспешно
		И РезультатПроверки.БезОшибокРасчета Тогда 
		
		ПоказатьПредупреждение(,НСтр("ru = 'Ошибок не обнаружено!'"));
		Возврат;
		
	Иначе
		
		ОткрытьФорму("Отчет.ПроверкаКонтрольныхСоотношенийГУ.Форма.ПротоколПроверки",РезультатПроверки, ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник, Истина, ДополнительныеПараметры.ПараметрыВыполненияКоманды.Окно, ДополнительныеПараметры.ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	КонецЕсли;
		
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ