
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РазовоеНачисление = Неопределено;
	Если Параметры.Свойство("РазовоеНачисление", РазовоеНачисление) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "РазовоеНачисление", РазовоеНачисление, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;
	
	ОтборСписка = Неопределено;
	Если Параметры.Свойство("ОтборСписка", ОтборСписка) Тогда
		Если ТипЗнч(ОтборСписка) = Тип("Структура") Тогда
			Для Каждого КлючИЗначение Из ОтборСписка Цикл
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, КлючИЗначение.Ключ, КлючИЗначение.Значение, ВидСравненияКомпоновкиДанных.Равно, , Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
