#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;	
	УсловияЗапросаПоОтборам(Запрос, Параметры);
			
	Если ПустаяСтрока(Запрос.Текст) Тогда
		Возврат;
	КонецЕсли;	
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос.УстановитьПараметр("СтрокаПоиска", Строка(Параметры.СтрокаПоиска) + "%");
	
	ТекстЗапроса = "ВЫБРАТЬ " + ?(ЗначениеЗаполнено(Параметры.СтрокаПоиска), "ПЕРВЫЕ 51", "") + "
	               |	ОсновнаяТаблица.Ссылка,
	               |	ОсновнаяТаблица.ПометкаУдаления
	               |ИЗ
	               |	Справочник.ЗначенияРеквизитовСведенийОбИмуществе КАК ОсновнаяТаблица
	               |ГДЕ
	               |	ОсновнаяТаблица.Наименование ПОДОБНО &СтрокаПоиска";
					   
	Запрос.Текст = ТекстЗапроса + Запрос.Текст + " УПОРЯДОЧИТЬ ПО ОсновнаяТаблица.РеквизитДопУпорядочивания";
			
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультата Из ТаблицаРезультата Цикл
		ДанныеВыбора.Добавить(Новый Структура("Значение, ПометкаУдаления", СтрокаРезультата.Ссылка, СтрокаРезультата.ПометкаУдаления));
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Заполняет пустой справочник значениями полей карт реестра имущества.
//
Процедура ЗаполнитьПоУмолчанию(Перезаполнять = Ложь) Экспорт
	
	ВыполнитьЗагрузку = Перезаполнять;
	
	Если Не Перезаполнять Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	ЗначенияРеквизитовСведенийОбИмуществе.Ссылка
		                      |ИЗ
		                      |	Справочник.ЗначенияРеквизитовСведенийОбИмуществе КАК ЗначенияРеквизитовСведенийОбИмуществе");
		
		РезультатЗапроса = Запрос.Выполнить();		
		ВыполнитьЗагрузку = РезультатЗапроса.Пустой();		
		
	КонецЕсли;
	
	Если ВыполнитьЗагрузку Тогда
		ЗагрузитьЗначенияРеквизитов();
	КонецЕсли; 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ВыгрузитьЗначенияРеквизитов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияРеквизитовСведенийОбИмуществе.Код,
	               |	ВЫБОР
	               |		КОГДА ЗначенияРеквизитовСведенийОбИмуществе.ЭтоГруппа
	               |			ТОГДА ЗначенияРеквизитовСведенийОбИмуществе.Наименование
	               |		ИНАЧЕ ЗначенияРеквизитовСведенийОбИмуществе.НаименованиеПолное
	               |	КОНЕЦ КАК Наименование,
	               |	ЗначенияРеквизитовСведенийОбИмуществе.ЭтоГруппа КАК ЭтоСправочник,
	               |	ЕСТЬNULL(ЗначенияРеквизитовСведенийОбИмуществе.Родитель.Код, """") КАК КодСправочника,
	               |	ЗначенияРеквизитовСведенийОбИмуществе.НеИспользуется
	               |ИЗ
	               |	Справочник.ЗначенияРеквизитовСведенийОбИмуществе КАК ЗначенияРеквизитовСведенийОбИмуществе
	               |ГДЕ
	               |	НЕ ЗначенияРеквизитовСведенийОбИмуществе.ПометкаУдаления
	               |	И НЕ ЕСТЬNULL(ЗначенияРеквизитовСведенийОбИмуществе.Родитель.ПометкаУдаления, ЛОЖЬ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоСправочник УБЫВ";
				   
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(Результат);
	
КонецФункции

Процедура ЗагрузитьЗначенияРеквизитов(Данные = "") Экспорт
	
	Если ТипЗнч(Данные) = Тип("ТаблицаЗначений") Тогда
		
		Таблица = Данные;
		
	ИначеЕсли ТипЗнч(Данные) = Тип("Строка") Тогда
		
		Если ПустаяСтрока(Данные) Тогда
			
			Макет = ПолучитьМакет("Значения");
			ТекстМакета = Макет.ПолучитьТекст();
			Если ПустаяСтрока(ТекстМакета) Тогда
				Возврат;
			КонецЕсли;
		Иначе
			ТекстМакета = Данные;
		КонецЕсли;
		
		Таблица = ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстМакета);
		
	Иначе
		Возврат;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	
	// Загрузка самих классификаторов
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица.КодСправочника,
	               |	Таблица.Код,
	               |	ВЫРАЗИТЬ(Таблица.Наименование КАК СТРОКА(1000)) КАК Наименование,
	               |	Таблица.ЭтоСправочник
	               |ПОМЕСТИТЬ ВТ_Загружаемые
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗначенияРеквизитовСведенийОбИмуществе.Ссылка КАК СсылкаЭлемента,
	               |	ВТ_Загружаемые.Код КАК Код,
	               |	ВТ_Загружаемые.Наименование КАК Наименование,
	               |	ЕСТЬNULL(ЗначенияРеквизитовСведенийОбИмуществе.ПометкаУдаления, ИСТИНА) КАК ПометкаУдаления,
	               |	ЕСТЬNULL(ЗначенияРеквизитовСведенийОбИмуществе.Наименование, """") КАК НаименованиеЭлемента,
	               |	ЕСТЬNULL(ЗначенияРеквизитовСведенийОбИмуществе.РеквизитДопУпорядочивания, 0) КАК Порядок
	               |ПОМЕСТИТЬ ВТ_Справочники
	               |ИЗ
	               |	ВТ_Загружаемые КАК ВТ_Загружаемые
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияРеквизитовСведенийОбИмуществе КАК ЗначенияРеквизитовСведенийОбИмуществе
	               |		ПО ВТ_Загружаемые.Код = ЗначенияРеквизитовСведенийОбИмуществе.Код
	               |			И ВТ_Загружаемые.ЭтоСправочник = ЗначенияРеквизитовСведенийОбИмуществе.ЭтоГруппа
	               |ГДЕ
	               |	ВТ_Загружаемые.ЭтоСправочник
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗначенияРеквизитовСведенийОбИмуществе.Ссылка,
	               |	СправочникиЗначений.Код,
	               |	ЕСТЬNULL(ЗначенияРеквизитовСведенийОбИмуществе.Наименование, СправочникиЗначений.Код),
	               |	ЕСТЬNULL(ЗначенияРеквизитовСведенийОбИмуществе.ПометкаУдаления, ИСТИНА),
	               |	ЕСТЬNULL(ЗначенияРеквизитовСведенийОбИмуществе.Наименование, """"),
	               |	ЕСТЬNULL(ЗначенияРеквизитовСведенийОбИмуществе.РеквизитДопУпорядочивания, 0)
	               |ИЗ
	               |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		ВТ_Загружаемые.КодСправочника КАК Код
	               |	ИЗ
	               |		ВТ_Загружаемые КАК ВТ_Загружаемые
	               |	ГДЕ
	               |		НЕ ВТ_Загружаемые.ЭтоСправочник
	               |		И НЕ ВТ_Загружаемые.КодСправочника В
	               |					(ВЫБРАТЬ
	               |						ВТ_Загружаемые.Код
	               |					ИЗ
	               |						ВТ_Загружаемые КАК ВТ_Загружаемые
	               |					ГДЕ
	               |						ВТ_Загружаемые.ЭтоСправочник)) КАК СправочникиЗначений
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияРеквизитовСведенийОбИмуществе КАК ЗначенияРеквизитовСведенийОбИмуществе
	               |		ПО СправочникиЗначений.Код = ЗначенияРеквизитовСведенийОбИмуществе.Код
	               |			И (ЗначенияРеквизитовСведенийОбИмуществе.ЭтоГруппа)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Справочники.СсылкаЭлемента,
	               |	ВТ_Справочники.Код,
	               |	ВТ_Справочники.Наименование,
	               |	ЛОЖЬ КАК ПометкаУдаления
	               |ИЗ
	               |	ВТ_Справочники КАК ВТ_Справочники
	               |ГДЕ
	               |	(ВТ_Справочники.ПометкаУдаления
	               |			ИЛИ ВТ_Справочники.Наименование <> ВТ_Справочники.НаименованиеЭлемента
	               |			ИЛИ ВТ_Справочники.Порядок = 0)";
			   
	Выборка = Запрос.Выполнить().Выбрать();				   
	
	Пока Выборка.Следующий() Цикл
		Объект = ?(ЗначениеЗаполнено(Выборка.СсылкаЭлемента), Выборка.СсылкаЭлемента.ПолучитьОбъект(), Справочники.ЗначенияРеквизитовСведенийОбИмуществе.СоздатьГруппу());	
		ЗаполнитьЗначенияСвойств(Объект, Выборка);
		Объект.Наименование = СокрЛП(Объект.Наименование);
		НастройкаПорядкаЭлементов.ЗаполнитьЗначениеРеквизитаУпорядочивания(Объект, Ложь);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект, Истина);
	КонецЦикла;
	
	// Загрузка значений классификаторов
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица.КодСправочника,
	               |	Таблица.Код,
	               |	Таблица.Наименование,
	               |	Таблица.ЭтоСправочник,
	               |	Таблица.НеИспользуется
	               |ПОМЕСТИТЬ ВТ_Загружаемые
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Значения.Ссылка КАК СсылкаЭлемента,
	               |	ЕСТЬNULL(Справочники.Ссылка, Значения.Родитель) КАК Родитель,
	               |	ЕСТЬNULL(ВТ_Загружаемые.Код, Значения.Код) КАК Код,
	               |	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_Загружаемые.Наименование, Значения.НаименованиеПолное) КАК СТРОКА(1000)) КАК НаименованиеПолное,
	               |	ВЫБОР
	               |		КОГДА ВТ_Загружаемые.Код ЕСТЬ NULL 
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПометкаУдаления,
	               |	ЕСТЬNULL(ВТ_Загружаемые.НеИспользуется, Значения.НеИспользуется) КАК НеИспользуется,
	               |	ВЫРАЗИТЬ(Значения.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеЭлемента,
	               |	ЕСТЬNULL(Значения.ПометкаУдаления, ИСТИНА) КАК ПометкаУдаленияЭлемента,
	               |	ЕСТЬNULL(Значения.НеИспользуется, ЛОЖЬ) КАК НеИспользуетсяЭлемента,
	               |	ЕСТЬNULL(Значения.РеквизитДопУпорядочивания, 0) КАК Порядок
	               |ПОМЕСТИТЬ ВТ_Значения
	               |ИЗ
	               |	ВТ_Загружаемые КАК ВТ_Загружаемые
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ЗначенияРеквизитовСведенийОбИмуществе КАК Значения
	               |		ПО ВТ_Загружаемые.Код = Значения.Код
	               |			И ВТ_Загружаемые.КодСправочника = Значения.Родитель.Код
	               |			И ВТ_Загружаемые.ЭтоСправочник = Значения.ЭтоГруппа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияРеквизитовСведенийОбИмуществе КАК Справочники
	               |		ПО ВТ_Загружаемые.КодСправочника = Справочники.Код
	               |			И (Справочники.ЭтоГруппа)
	               |ГДЕ
	               |	НЕ ЕСТЬNULL(ВТ_Загружаемые.ЭтоСправочник, Значения.ЭтоГруппа)
	               |	И ЕСТЬNULL(ВТ_Загружаемые.КодСправочника, Значения.Родитель.Код) В
	               |			(ВЫБРАТЬ
	               |				Спр.Код
	               |			ИЗ
	               |				ВТ_Загружаемые КАК Спр
	               |			ГДЕ
	               |				Спр.ЭтоСправочник)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Значения.СсылкаЭлемента,
	               |	ВТ_Значения.Родитель,
	               |	ВТ_Значения.Код,
	               |	ВТ_Значения.НаименованиеПолное,
	               |	ВТ_Значения.ПометкаУдаления,
	               |	ВТ_Значения.НеИспользуется
	               |ИЗ
	               |	ВТ_Значения КАК ВТ_Значения
	               |ГДЕ
	               |	(ВТ_Значения.ПометкаУдаления <> ВТ_Значения.ПометкаУдаленияЭлемента
	               |			ИЛИ ВТ_Значения.НаименованиеПолное <> ВТ_Значения.НаименованиеЭлемента
	               |			ИЛИ ВТ_Значения.НеИспользуется <> ВТ_Значения.НеИспользуетсяЭлемента
	               |			ИЛИ ВТ_Значения.Порядок = 0)";

		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект = ?(ЗначениеЗаполнено(Выборка.СсылкаЭлемента), Выборка.СсылкаЭлемента.ПолучитьОбъект(), Справочники.ЗначенияРеквизитовСведенийОбИмуществе.СоздатьЭлемент());	
		ЗаполнитьЗначенияСвойств(Объект, Выборка);
		НастройкаПорядкаЭлементов.ЗаполнитьЗначениеРеквизитаУпорядочивания(Объект, Ложь);
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект, Истина);
	КонецЦикла;
				   		
КонецПроцедуры

Процедура УсловияЗапросаПоОтборам(Запрос, СтруктураОтборов, Знач Префикс = "И") Экспорт
	
	НомерПараметра = 1;	
	
	Если СтруктураОтборов.Свойство("ПредустановленныйОтбор") Тогда
		Условие = РеестрИмуществаСервер.СкопироватьОтборКомпоновкиДанныхВЗапрос(Запрос, СтруктураОтборов.ПредустановленныйОтбор, Префикс, НомерПараметра);
	КонецЕсли;
	
	Если Префикс = "ГДЕ" И Условие <> "" Тогда // Если это первое условие, и в запроса уже добавлен отбор
		Префикс = "И";                         // Из ПредустановленныйОтбор, то отбор из ПредустановленныйОтборЗначений
	КонецЕсли;                                 // будет добавлен через И
	
	Если СтруктураОтборов.Свойство("ПредустановленныйОтборЗначений") Тогда
		
		ТаблицаНастроек = ОбщегоНазначения.ЗначениеИзСтрокиXML(СтруктураОтборов.ПредустановленныйОтборЗначений);
		Условия = Новый Массив;
		
		Для Каждого ЭлементНастройки Из ТаблицаНастроек Цикл
			
			Если Не ПустаяСтрока(ЭлементНастройки.Реквизит) Тогда
				
				Условие = РеестрИмуществаСервер.СкопироватьОтборКомпоновкиДанныхВЗапрос(Запрос, ЭлементНастройки.УсловиеСвязи, "ГДЕ", НомерПараметра, Истина);
				
				Если Условие <> "" Тогда									
					
					УсловиеЗначения = "ОсновнаяТаблица." + ЭлементНастройки.Реквизит + " В (
					|ВЫБРАТЬ
					|	ОсновнаяТаблица.Значение
					|ИЗ
					|	РегистрСведений.СвязиЗначенийРеквизитовСведенийОбИмуществе КАК ОсновнаяТаблица" + Условие + ")"; 
					
					Условия.Добавить(УсловиеЗначения);
					
				КонецЕсли;			
			КонецЕсли;		
		КонецЦикла;
		
		Если Условия.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " " + Префикс + " (" + СтрСоединить(Условия, " И ") + ")";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли