#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции  

// См. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора.
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан) Экспорт
	
	ДвоичныеДанныеXML = ПолучитьИзВременногоХранилища(Адрес);
	ДанныеXML = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеXML);
	РезультатЧтенияXML = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ДанныеXML);  
	
	НачатьТранзакцию();
	Попытка
		// Устанавливаем исключительную блокировку на справочник, чтобы предотвратить
		// параллельный запуск обновления классификатора из другого сеанса.
		БлокировкаДанных = Новый БлокировкаДанных();
		ЭлементБлокировки = БлокировкаДанных.Добавить("Справочник.ОбщероссийскийКлассификаторОрганизационноПравовыхФорм");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ЗаписатьКоллекциюВСправочник(РезультатЧтенияXML.Данные);
		Обработан = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление ОКОПФ'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьКоллекциюВСправочник(Коллекция)  
	
	// Запись новых и измененных элементов
	Для Каждого Элемент Из Коллекция Цикл
		ТекСсылка = Справочники.ОбщероссийскийКлассификаторОсновныхФондов.НайтиПоКоду(Элемент.Код);
		// Создание элемента
		Если ТекСсылка.Пустая() Тогда
			СпрОбъект = Справочники.ОбщероссийскийКлассификаторОрганизационноПравовыхФорм.СоздатьЭлемент();
		Иначе
			СпрОбъект = ТекСсылка.ПолучитьОбъект();
			// Если элемент справочника удалили, пока ссылка на него хранилась в дереве.
			Если СпрОбъект = Неопределено Тогда
				СпрОбъект = Справочники.ОбщероссийскийКлассификаторОрганизационноПравовыхФорм.СоздатьЭлемент();
				СпрОбъект.УстановитьСсылкуНового(ТекСсылка);
			КонецЕсли;
		КонецЕсли;
		СпрОбъект.Код = Элемент.Код;
		СпрОбъект.НаименованиеПолное = Элемент.Наименование;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);
	КонецЦикла;	  
	
	// Деактуализация элементов
	СписокКодов = Коллекция.ВыгрузитьКолонку("Код");
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ОбщероссийскийКлассификаторОрганизационноПравовыхФорм.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОбщероссийскийКлассификаторОрганизационноПравовыхФорм КАК ОбщероссийскийКлассификаторОрганизационноПравовыхФорм
	|ГДЕ
	|	НЕ ОбщероссийскийКлассификаторОрганизационноПравовыхФорм.Код В (&СписокКодов)");
	Запрос.УстановитьПараметр("СписокКодов", СписокКодов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПлучитьОбъект();
		СпрОбъект.Наименование = "Исключен из классификатора";
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);
	КонецЦикла;	
	
КонецПроцедуры	  

#КонецОбласти

#КонецЕсли