#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий  

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеестрВедомостейНаВыплатуЗарплаты") Тогда
		Документы.РСКППеречислениеМир.ЗаполнитьПоРееструВедомостейНаВыплатуЗарплаты(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РазницаШапкиИИтогаТЧ = СуммаДокумента - РасшифровкаПлатежа.Итог("Сумма");
	
	Если РазницаШапкиИИтогаТЧ <> 0 Тогда
		ТекстСообщения = НСтр("ru='Сумма документа не равна сумме расшифровки платежа. Не распределена сумма: '") + Формат((РазницаШапкиИИтогаТЧ), "ЧДЦ=2");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "СуммаДокумента", "Объект",Отказ);
	КонецЕсли;  
	
	НеПроверяемыеРеквизиты = Новый Массив;
	
	Если Не ОбщегоНазначенияБГУПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоИФО") Тогда
		НепроверяемыеРеквизиты.Добавить("ИФО");
		НепроверяемыеРеквизиты.Добавить("ДетализацияПлатежа.ИФО");
	ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда
		НепроверяемыеРеквизиты.Добавить("ИФО");
	Иначе
		НепроверяемыеРеквизиты.Добавить("ДетализацияПлатежа.ИФО");
	КонецЕсли;  
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Внешнее = Ложь;  
	ДатаРСКП = "";
	НомерРСКП = "";      
	ФайлыПриложения.Очистить();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Отказ = ПлатежноРасчетныеДокументы.ВыполнитьДвиженияПлатежноРасчетногоДокумента(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Очистка табличной части ДетализацияПлатежа от строк, не имеющих "родителя" в ТЧ РасшифровкаПлатежа
	// Синхронизация общих реквизитов табличных частей Состав и РасшифровкаПлатежа
	ПоляСостава = Новый Массив;
	Для Каждого РеквизитСостава Из ЭтотОбъект.Метаданные().ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты Цикл
		Если НЕ РеквизитСостава.Имя = "Сумма"
			И НЕ РеквизитСостава.Имя = "ДатаРожденияПолучателя" 
			И НЕ РеквизитСостава.Имя = "НомерПлатежнойКарты" 
           	И НЕ РеквизитСостава.Имя = "КодПрослеживаемости"
			И НЕ РеквизитСостава.Имя = "ВидВыплатНаКартуМИР"
			И НЕ РеквизитСостава.Имя = "КодВидаДохода"
			И НЕ РеквизитСостава.Имя = "Взыскано"  
			И НЕ РеквизитСостава.Имя = "ИнформацияОбОшибке"
			И НЕ РеквизитСостава.Имя = "Отказано"
			И НЕ РеквизитСостава.Имя = "ПлатежнаяКарта"
			Тогда

			ПоляСостава.Добавить(РеквизитСостава.Имя);
		КонецЕсли;
	КонецЦикла;
	СписокСвойств = СтрСоединить(ПоляСостава, ", ");
	
	ЛишниеСтроки = Новый Массив;
	Для Каждого СтрокаРасшифровки Из ДетализацияПлатежа Цикл
		СтрокаСостава = РасшифровкаПлатежа.Найти(СтрокаРасшифровки.ИдентификаторСтроки, "ИдентификаторСтроки");
		Если СтрокаСостава = Неопределено Тогда
			ЛишниеСтроки.Добавить(СтрокаРасшифровки);
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаРасшифровки, СтрокаСостава, СписокСвойств);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЛишняяСтрока Из ЛишниеСтроки Цикл
		ДетализацияПлатежа.Удалить(ЛишняяСтрока);
	КонецЦикла;
	
	// Заполнение ТЧ РасшифровкаКБК
	ТабКБК = РасшифровкаПлатежа.Выгрузить(, "КБКНазначениеПлатежа,Сумма");
	ТабКБК.Свернуть("КБКНазначениеПлатежа", "Сумма"); 
	РасшифровкаКБК.Загрузить(ТабКБК);
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПлатежноРасчетныеДокументы.ПриЗаписиНаСервереУстановкаСтатуса(Отказ, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
