&НаКлиенте
Перем ПеренестиВДокумент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ЗначениеСвойства;
	
	ЭтаФорма.ЗакрыватьПриВыборе = Ложь;
	
	Организация = Параметры.Организация;
	Контрагент = Параметры.Контрагент;
	ВариантВводаДанных = Параметры.ВариантВводаДанныхУПД;
	ЕстьМаркированныеТовары = Истина;//Параметры.ВидимостьЭлементовМаркировки;
	РеализацияДляГосНужд = Параметры.ВидимостьДанныхЭДОПродавцаДляГосНужд;
	ДокументОснование = Параметры.Ссылка;
	
	ЗаполнитьПоДокументуОснованию(Параметры);
	
	УстановитьВидимостьЭлементов(ЭтаФорма);

	УстановитьВидимостьЭлементовОтветственныйЗаПередачуТРУ(ЭтаФорма);
	
	ЗаполнитьСписокАдресов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ПеренестиВДокумент = Истина Тогда
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("РеквизитыЛицевогоСчета", РеквизитыЛицевогоСчета);
		СтруктураДанных.Вставить("РасчетныйСчетКонтрагента", РасчетныйСчетКонтрагента);
		СтруктураДанных.Вставить("Грузоотправитель", Грузоотправитель);
		СтруктураДанных.Вставить("Грузополучатель", Грузополучатель);
		СтруктураДанных.Вставить("РасчетныйСчетГрузоотправителя", РасчетныйСчетГрузоотправителя);
		СтруктураДанных.Вставить("РасчетныйСчетГрузополучателя", РасчетныйСчетГрузополучателя);
		СтруктураДанных.Вставить("КПСПродавца", КПСПродавца);
		СтруктураДанных.Вставить("КодЦелиПродавца", КодЦелиПродавца);
		СтруктураДанных.Вставить("СведенияОВыбытииМаркированныхТоваров", СведенияОВыбытииМаркированныхТоваров);
		
		СтруктураДанных.Вставить("ТРУПереданы", ТРУПереданы);
		СтруктураДанных.Вставить("ДатаПередачиТРУ", ДатаПередачиТРУ);
		СтруктураДанных.Вставить("ОтветственныйПередалТРУ", ОтветственныйПередалТРУ);
		СтруктураДанных.Вставить("ОтветственныйПередалТРУВид", ОтветственныйПередалТРУВид);
		СтруктураДанных.Вставить("ОтветственныйПередалТРУДоверенность", ОтветственныйПередалТРУДоверенность);
		СтруктураДанных.Вставить("ОтветственныйПередалТРУДолжность", ОтветственныйПередалТРУДолжность);
		СтруктураДанных.Вставить("ОтветственныйПередалТРУИныеСведения", ОтветственныйПередалТРУИныеСведения);
		СтруктураДанных.Вставить("ОтветственныйПередалТРУКонтрагент", ОтветственныйПередалТРУКонтрагент);
		СтруктураДанных.Вставить("ОтветственныйПередалТРУОснованиеПолномочий", ОтветственныйПередалТРУОснованиеПолномочий);
		СтруктураДанных.Вставить("ОтветственныйПередалТРУДокументПолномочий", ОтветственныйПередалТРУДокументПолномочий);
		Если ЗначениеЗаполнено(АдресМОДЗначение) Тогда 
			СтруктураДанных.Вставить("ИдентификаторФИАС", АдресМОДЗначение);
		Иначе	
			СтруктураДанных.Вставить("ИдентификаторФИАС", ИдентификаторФИАС);
		КонецЕсли;	
		
		ПеренестиВДокумент = Истина;
		ОповеститьОВыборе(СтруктураДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВДокумент <> Истина И Модифицированность Тогда
	
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр("ru = 'Сведения для электронного УПД не сохранены в документ.
			|
			|Перенести?'"), РежимДиалогаВопрос.ДаНетОтмена);
			
		Отказ = Истина;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТРУПереданыПриИзменении(Элемент)
	ТРУПереданыПриИзмененииСервер(ОбщегоНазначенияКлиент.ДатаСеанса());
	УстановитьТипОтветственныйПередалТРУ();
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПередалТРУДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.Должности.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПередалТРУДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
		ОтветственныйПередалТРУДолжность = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПередалТРУОснованиеПолномочийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПередалТРУОснованиеПолномочийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
		ОтветственныйПередалТРУОснованиеПолномочий = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОтветственногоПередавшегоТРУПриИзменении(Элемент)
	УстановитьТипОтветственныйПередалТРУ();
	УстановитьВидимостьЭлементовОтветственныйЗаПередачуТРУ(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПередалТРУДокументОснованиеПолномочийПриИзменении(Элемент)
	ОтветственныйПередалТРУОснованиеПолномочий = СокрЛП(ОтветственныйПередалТРУДокументПолномочий);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)

	Элементы = Форма.Элементы;
	ВидимостьТолькоУслуг = Ложь;
	ВидимостьМаркировки = Ложь;
	ВидимостьРеализацияДляГосНужд = Ложь;
	
	Если Форма.РеализацияДляГосНужд Тогда
		ВидимостьРеализацияДляГосНужд = Истина;
	КонецЕсли;	
	
	Если Форма.ЕстьМаркированныеТовары Тогда
		ВидимостьМаркировки = Истина;
	КонецЕсли;	
	
	Если Форма.ВариантВводаДанных = 1 Тогда
		Элементы.ГруппаПередачаТРУ.Заголовок = НСтр("ru='Сведения о передаче товаров'");
		Элементы.ТРУПереданы.Заголовок = НСтр("ru='Выполнена передача товаров'");
	ИначеЕсли Форма.ВариантВводаДанных = 2 Тогда
		//работы, услуги
		Элементы.ГруппаПередачаТРУ.Заголовок = НСтр("ru='Сведения о передаче работ, услуг'");
		Элементы.ТРУПереданы.Заголовок = НСтр("ru='Выполнена передача работ, услуг'");
		ВидимостьТолькоУслуг = Истина;
	КонецЕсли;	

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГрузоотправитель",
		"Видимость", НЕ ВидимостьТолькоУслуг);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГрузополучатель",
		"Видимость", НЕ ВидимостьТолькоУслуг);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаМаркировкаТоваров",
		"Видимость", НЕ ВидимостьТолькоУслуг И ВидимостьМаркировки);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРеализацияДляГосНужд",
		"Видимость", ВидимостьРеализацияДляГосНужд);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСведенияДляУПД(Команда)
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументуОснованию(ЗначенияРеквизитов)
	
	РеквизитыЛицевогоСчета = ЗначенияРеквизитов.РеквизитыЛицевогоСчета;
	РасчетныйСчетКонтрагента = ЗначенияРеквизитов.РасчетныйСчетКонтрагента;
	Грузоотправитель = ЗначенияРеквизитов.Грузоотправитель;
	РасчетныйСчетГрузоотправителя = ЗначенияРеквизитов.РасчетныйСчетГрузоотправителя;
	Грузополучатель = ЗначенияРеквизитов.Грузополучатель;
	РасчетныйСчетГрузополучателя = ЗначенияРеквизитов.РасчетныйСчетГрузополучателя;
	КПСПродавца = ЗначенияРеквизитов.КПСПродавца;
	КодЦелиПродавца = ЗначенияРеквизитов.КодЦелиПродавца;
	СведенияОВыбытииМаркированныхТоваров = ЗначенияРеквизитов.СведенияОВыбытииМаркированныхТоваров;

	ТРУПереданы = ЗначенияРеквизитов.ТРУПереданы;
	ДатаПередачиТРУ = ЗначенияРеквизитов.ДатаПередачиТРУ;
	ОтветственныйПередалТРУ = ЗначенияРеквизитов.ОтветственныйПередалТРУ;
	ОтветственныйПередалТРУВид = ЗначенияРеквизитов.ОтветственныйПередалТРУВид;
	ОтветственныйПередалТРУДоверенность = ЗначенияРеквизитов.ОтветственныйПередалТРУДоверенность;
	ОтветственныйПередалТРУДолжность = ЗначенияРеквизитов.ОтветственныйПередалТРУДолжность;
	ОтветственныйПередалТРУИныеСведения = ЗначенияРеквизитов.ОтветственныйПередалТРУИныеСведения;
	ОтветственныйПередалТРУКонтрагент = ЗначенияРеквизитов.ОтветственныйПередалТРУКонтрагент;
	ОтветственныйПередалТРУОснованиеПолномочий = ЗначенияРеквизитов.ОтветственныйПередалТРУОснованиеПолномочий;
	ОтветственныйПередалТРУДокументПолномочий = ЗначенияРеквизитов.ОтветственныйПередалТРУДокументПолномочий;
	
	Если ЗначенияРеквизитов.Свойство("ИдентификаторФИАС") Тогда
		ИдентификаторАдреса = ЗначенияРеквизитов.ИдентификаторФИАС;
		Если СтрДлина(ИдентификаторАдреса) = 36 Тогда 
			ИдентификаторФИАС = ИдентификаторАдреса;
		Иначе
			АдресМОДЗначение = ИдентификаторАдреса;
			АдресМОДПредставление = ИдентификаторАдреса;
			СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(АдресМОДЗначение, Новый Структура("КодыАдреса", Истина));
			Если ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторДома) Тогда 
				ИдентификаторФИАС 	= СведенияОбАдресе.ИдентификаторДома;
			Иначе
				ИдентификаторФИАС 	= СведенияОбАдресе.ИдентификаторАдресногоОбъекта;	
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов, "Отпустил,ОтветственныйИсполнитель,Ответственный");
	
КонецПроцедуры

&НаСервере
Процедура ТРУПереданыПриИзмененииСервер(ДатаСеанса)
	
	Если ТРУПереданы Тогда
		ЭлектронныеДокументыБГУ.УстановитьРеквизитыПередачиТРУПоУмолчанию(ЭтотОбъект, ДатаСеанса);
	Иначе
		ЭлектронныеДокументыБГУ.ОчиститьРеквизитыПередачиТРУ(ЭтотОбъект);
	КонецЕсли;
	
	УстановитьВидимостьЭлементовОтветственныйЗаПередачуТРУ(ЭтотОбъект);
	
КонецПроцедуры

#Область ПередалТРУВЭлектронномУПД

&НаКлиенте
Процедура УстановитьТипОтветственныйПередалТРУ()
	Если ОтветственныйПередалТРУВид = 0 Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		Элементы.ОтветственныйПередалТРУ.ОграничениеТипа = ОписаниеТипа;
	Иначе	
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
		Элементы.ОтветственныйПередалТРУ.ОграничениеТипа = ОписаниеТипа;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовОтветственныйЗаПередачуТРУ(Форма)

	ВидимостьОтветственныйСотрудник = ?(Форма.ОтветственныйПередалТРУВид = 0, Истина, Ложь);
	ВидимостьОтветственныйПредставительКонтрагента = ?(Форма.ОтветственныйПередалТРУВид = 1, Истина, Ложь);
	ВидимостьОтветственныйФизЛицо = ?(Форма.ОтветственныйПередалТРУВид = 2, Истина, Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаИное", "Видимость", Форма.ТРУПереданы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаОтветственныйОрганизация", "Видимость", Форма.ТРУПереданы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаЛицоИОснованиеПередачиТРУ", "Видимость", Форма.ТРУПереданы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаОтветственныйОрганизация", "Видимость", Форма.ТРУПереданы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаИное", "Видимость", Форма.ТРУПереданы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ВидОтветственногоПередавшегоТРУ", "Видимость", Форма.ТРУПереданы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДатаПередачиТРУ", "Видимость", Форма.ТРУПереданы);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаОтветственныйОрганизация", "Видимость", ВидимостьОтветственныйПредставительКонтрагента);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ОтветственныйПередалТРУДоверенность", "Видимость", НЕ ВидимостьОтветственныйСотрудник);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ОтветственныйПередалТРУОснованиеПолномочий", "Видимость", НЕ ВидимостьОтветственныйФизЛицо);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ОтветственныйПередалТРУДокументОснованиеПолномочий", "Видимость", НЕ ВидимостьОтветственныйФизЛицо);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокумент = Истина;
		Закрыть(КодВозвратаДиалога.OK);
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть(КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокАдресов()
	
	Элементы.АдресМОДПредставление.СписокВыбора.Очистить();
	ТаблицаАдресов = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЭтотОбъект.Грузополучатель, Справочники.ВидыКонтактнойИнформации.МестоОсуществленияДеятельностиКонтрагенты,, Ложь);
	Для Каждого Адрес Из ТаблицаАдресов Цикл 
		Элементы.АдресМОДПредставление.СписокВыбора.Добавить(Адрес.Значение, Адрес.Представление);	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	
	ЗаполнитьСписокАдресов();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресМОДПредставлениеПриИзменении(Элемент)
	
	АдресМОДПредставлениеПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура АдресМОДПредставлениеПриИзмененииСервер()
	
	АдресМОДЗначение 	= АдресМОДПредставление;
	
	СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(АдресМОДЗначение, Новый Структура("КодыАдреса", Истина));
	Если ЗначениеЗаполнено(СведенияОбАдресе.ИдентификаторДома) Тогда 
		ИдентификаторФИАС 	= СведенияОбАдресе.ИдентификаторДома;
	Иначе
		ИдентификаторФИАС 	= СведенияОбАдресе.ИдентификаторАдресногоОбъекта;	
	КонецЕсли;	
	
КонецПроцедуры
#КонецОбласти
