#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификационныйКодЗакупки)
		И (СтрДлина(СокрЛП(ИдентификационныйКодЗакупки)) < 36
			ИЛИ НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИдентификационныйКодЗакупки)) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Идентификационный код закупки не корректен: должен быть 36-ти значный цифровой код'"),
			, "Объект.ИдентификационныйКодЗакупки", , Отказ)
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснованиеДата) И ДокументОснованиеДата > НачалоДня(Дата) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата документа-основания не должна быть больше даты заявки'"),
			, "Объект.ДокументОснованиеДата", , Отказ)
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Задолженность.Очистить();
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НеПроверяемыеРеквизиты = Новый Массив;
	
	Если ВидОплаты <> ПредопределенноеЗначение("Перечисление.ВидыОплатыЗакупок.Наличными")
		И ВидОплаты <> ПредопределенноеЗначение("Перечисление.ВидыОплатыЗакупок.ПоКарте") Тогда
		НепроверяемыеРеквизиты.Добавить("ПодотчетноеЛицо");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
