////////////////////////////////////////////////////////////////////////////////
// Методы работы с расшифровкой с помощью стандарртных отчетов из общей формы ФормаОтчета.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возникает после окончания формирования отчета: после завершения фонового задания.
// Позволяет переопределить обработку результата формирования отчета.
//
// Параметры:
//  ФормаОтчета - ФормаКлиентскогоПриложения - форма отчета.
//  ОтчетСформирован - Булево - Истина если отчет был успешно сформирован.
//
Процедура ПослеФормирования(НастройкиОтчета, ТабличныйДокумент, ОтчетСформирован) Экспорт
	
	ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(НастройкиОтчета.ПолноеИмя).ПослеФормирования(НастройкиОтчета, ТабличныйДокумент, ОтчетСформирован);

КонецПроцедуры

Процедура ВывестиПодписьИсполнителя(НастройкиОтчета, ОтчетТабличныйДокумент, ОтчетСформирован, НеВыводитьПодпись) Экспорт
	Если НЕ НеВыводитьПодпись Тогда
		ОтчетыБГУ.ВывестиПодписьИсполнителя(НастройкиОтчета, ОтчетТабличныйДокумент, ОтчетСформирован); 
	КонецЕсли;
	Если НастройкиОтчета.ПолноеИмя = "Отчет.УниверсальныйОтчет" Тогда
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("УниверсальныйОтчет_НеВыводитьПодвал",, НеВыводитьПодпись);
	КонецЕсли;	
КонецПроцедуры	

// Функция определяет возможность расшифровки стандартным отчетом и заполняет параметры расшифровки.
// Возможность расшифровки стандартным отчетом определяется по наличию реквизита отчета
// "ДоступнаРасшифровкаСтандартнымиОтчетами" (тип Булево).
// Так же в отчете может быть задан реквизит "РасшифровкаСтандартнымиОтчетамиВЯчейке" (тип Булево).
// В этом случае расшифровка стандартным отчетом будет выполнена только в ячейках, в которых задано поле
// "ДоступнаРасшифровкаСтандартнымиОтчетами". В остальных ячейках будет выполнена стандартная обработка.
Функция ПараметрыРасшифровкиОтчета(Адрес, ИдентификаторОбъекта, Расшифровка, ДополнительныеПараметры = Неопределено) Экспорт
	Перем РасшифровкаСтандартнымиОтчетамиВЯчейке; // для определения возможности расшифровки для каждой ячейки отчета
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		Если НЕ ДополнитьРеквизитыФормыДляРасшифровкиСтандартнымиОтчетами(
			ДополнительныеПараметры.ПолноеИмяОтчета,
			ДополнительныеПараметры.ОтчетОбъект,
			ДополнительныеПараметры.ОтчетДанныеРасшифровки,
			ДополнительныеПараметры.АдресХранилища,
			Адрес,
			РасшифровкаСтандартнымиОтчетамиВЯчейке) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыРасшифровки = Новый Структура;
	
	НастройкиРасшифровки = Новый Структура;
	
	ОтборДляВариантаОтчета = Новый Соответствие;
	
	ОсновноеМеню = Новый СписокЗначений;
	
	ДанныеОбъекта = ПолучитьИзВременногоХранилища(Адрес);
	
	ОтчетОбъект       = ДанныеОбъекта.Объект;
	ДанныеРасшифровки = ДанныеОбъекта.ДанныеРасшифровки;
	
	// Отчеты на типовой форме
	ОтчетыРасшифровки = Неопределено;
	ЕстьОтчетыРасшифровки = ОтчетОбъект.Свойство("ОтчетыРасшифровки", ОтчетыРасшифровки);
	
	МассивОсновныхДействий = Неопределено;
	ЕстьМассивОсновныхДействий = ОтчетОбъект.Свойство("МассивОсновныхДействий", МассивОсновныхДействий);
	
	ПоказательСчет = Неопределено;
	ЕстьПоказательСчет = ОтчетОбъект.Свойство("ПоказательСчет", ПоказательСчет);
	
	Если ЕстьОтчетыРасшифровки Тогда
		
		ПараметрыРасшифровки.Вставить("ОткрытьЗначение", Ложь);
		
		МассивПолей = СтандартныеОтчеты.ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровки, , Истина);
		
		Если РасшифровкаСтандартнымиОтчетамиВЯчейке = Истина Тогда
			
			// ищем поле "ДоступнаРасшифровкаСтандартнымиОтчетами"
			ЕстьПризнакРасшифровкиВЯчейке = Ложь;
			Для каждого ТекПоле Из МассивПолей Цикл
			
				Если ТипЗнч(ТекПоле) = Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных")
					И ТекПоле.Поле = "ДоступнаРасшифровкаСтандартнымиОтчетами" Тогда
					ЕстьПризнакРасшифровкиВЯчейке = Истина;
					Прервать;
				КонецЕсли;
			
			КонецЦикла;
			Если Не ЕстьПризнакРасшифровкиВЯчейке Тогда
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Счет    = Неопределено;
		КорСчет = Неопределено;
		
		Если ЕстьПоказательСчет Тогда
			
			Для Каждого Элемент Из МассивПолей Цикл
				Если ТипЗнч(Элемент) = Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
					ЭлементМеню = Неопределено;
					
					Если СтрНайти(Элемент.Поле, ".") = 0 И ПоказательСчет.Свойство(Элемент.Поле, ЭлементМеню) Тогда
						
						ИндексПоля = 0;
						Для Каждого Элемент из ЭлементМеню Цикл
							
							Счет 	= Элемент.Значение.Счет;
							КорСчет = Элемент.Значение.КорСчет;
							
							Если НЕ ЗначениеЗаполнено(Счет) Тогда
								Счет = СчетИзМассиваПолей(МассивПолей, Счет);
							КонецЕсли;
							
							ПредставлениеДляОСВПоСчету            = НСтр("ru = 'ОСВ по счету %Счет%'");
							ПредставлениеДляКарточкиСчета         = НСтр("ru = 'Карточка счета %Счет%'");
							ПредставлениеДляАнализаСчета          = НСтр("ru = 'Анализ счета %Счет%%КорСчет%'");
							ПредставлениеДляОборотыСчетаПоМесяцам = НСтр("ru = 'Обороты счета %Счет% по месяцам'");
							ПредставлениеДляОборотыСчетаПоДням    = НСтр("ru = 'Обороты счета %Счет% по дням'");
							ПредставлениеДляКарточкиСубконто      = НСтр("ru = 'Карточка субконто'");
							ПредставлениеДляОтчетаПоПроводкам     = НСтр("ru = 'Отчет по проводкам'");
							ПредставлениеОткрытьЗначение          = НСтр("ru = 'Открыть ""%Значение%""'");
							ПредставлениеДляЖурналаОпераций       = НСтр("ru = 'Журнал операций ф.0504071'");
							
							ПредставлениеДляОСВПоСчету            = СтрЗаменить(ПредставлениеДляОСВПоСчету           , "%Счет%", Счет);
							ПредставлениеДляКарточкиСчета         = СтрЗаменить(ПредставлениеДляКарточкиСчета        , "%Счет%", Счет);
							ПредставлениеДляАнализаСчета          = СтрЗаменить(ПредставлениеДляАнализаСчета         , "%Счет%", Счет);
							ПредставлениеДляОборотыСчетаПоМесяцам = СтрЗаменить(ПредставлениеДляОборотыСчетаПоМесяцам, "%Счет%", Счет);
							ПредставлениеДляОборотыСчетаПоДням    = СтрЗаменить(ПредставлениеДляОборотыСчетаПоДням   , "%Счет%", Счет);
							
							Если ЗначениеЗаполнено(Счет) Тогда
								ОписаниеОсновногоМеню = НСтр("ru = 'Счет %Счет%%КорСчет%'");
								ОписаниеОсновногоМеню = СтрЗаменить(ОписаниеОсновногоМеню, "%Счет%", Счет);
							КонецЕсли;
							
							Если ЗначениеЗаполнено(КорСчет) Тогда
								ПредставлениеДляАнализаСчета = СтрЗаменить(ПредставлениеДляАнализаСчета, "%КорСчет%", " кор. счет "+КорСчет);
								ОписаниеОсновногоМеню = СтрЗаменить(ОписаниеОсновногоМеню, "%КорСчет%", " и кор. счет "+КорСчет);
							Иначе
								ПредставлениеДляАнализаСчета = СтрЗаменить(ПредставлениеДляАнализаСчета, "%КорСчет%", "");
								ОписаниеОсновногоМеню = СтрЗаменить(ОписаниеОсновногоМеню, "%КорСчет%", "");
							КонецЕсли;
							
							СписокПунктовМеню = Новый СписокЗначений;
							
							ИндексПоля = ИндексПоля + 1;
							
							// Отчеты на типовой форме
							Для Каждого ИмяОтчетаРасшифровки Из ОтчетыРасшифровки Цикл
								
								Если ЗначениеЗаполнено(Счет) Тогда
									Если ИмяОтчетаРасшифровки = "ОборотноСальдоваяВедомостьПоСчету" Тогда
										ИмяПунктаМеню = "ОборотноСальдоваяВедомостьПоСчету"+ИндексПоля;
										СписокПунктовМеню.Добавить(ИмяПунктаМеню, ПредставлениеДляОСВПоСчету);
										НастройкиРасшифровки.Вставить(ИмяПунктаМеню,ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("ОборотноСальдоваяВедомостьПоСчету", МассивПолей, ОтчетОбъект, Счет, КорСчет));
									ИначеЕсли ИмяОтчетаРасшифровки = "КарточкаСчета" Тогда
										ИмяПунктаМеню = "КарточкаСчета"+ИндексПоля;
										СписокПунктовМеню.Добавить(ИмяПунктаМеню, ПредставлениеДляКарточкиСчета);
										НастройкиРасшифровки.Вставить(ИмяПунктаМеню,ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("КарточкаСчета", МассивПолей, ОтчетОбъект, Счет, КорСчет));
									ИначеЕсли ИмяОтчетаРасшифровки = "АнализСчета" Тогда
										ИмяПунктаМеню = "АнализСчета"+ИндексПоля;
										СписокПунктовМеню.Добавить(ИмяПунктаМеню, ПредставлениеДляАнализаСчета);
										НастройкиРасшифровки.Вставить(ИмяПунктаМеню,ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("АнализСчета", МассивПолей, ОтчетОбъект, Счет, КорСчет));
									ИначеЕсли ИмяОтчетаРасшифровки = "ОборотыСчета" Тогда
										ИмяПунктаМеню = "ОборотыСчетаПоМесяцам"+ИндексПоля;
										СписокПунктовМеню.Добавить(ИмяПунктаМеню, ПредставлениеДляОборотыСчетаПоМесяцам);
										НастройкиРасшифровки.Вставить(ИмяПунктаМеню,ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("ОборотыСчетаПоМесяцам", МассивПолей, ОтчетОбъект, Счет, КорСчет));
										ИмяПунктаМеню = "ОборотыСчетаПоДням"+ИндексПоля;
										СписокПунктовМеню.Добавить(ИмяПунктаМеню, ПредставлениеДляОборотыСчетаПоДням);
										НастройкиРасшифровки.Вставить(ИмяПунктаМеню,ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("ОборотыСчетаПоДням", МассивПолей, ОтчетОбъект, Счет, КорСчет));
									КонецЕсли;
								КонецЕсли;
								
								Если ИмяОтчетаРасшифровки = "КарточкаСубконто" Тогда
									ИмяПунктаМеню = "КарточкаСубконто"+ИндексПоля;
									СписокПунктовМеню.Добавить(ИмяПунктаМеню, ПредставлениеДляКарточкиСубконто);
									НастройкиРасшифровки.Вставить(ИмяПунктаМеню,ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("КарточкаСубконто", МассивПолей, ОтчетОбъект, Счет, КорСчет));
								КонецЕсли;
								
							КонецЦикла;
							
							Если СписокПунктовМеню.Количество() > 0 Тогда
								ОсновноеМеню.Добавить(СписокПунктовМеню,ОписаниеОсновногоМеню);
							КонецЕсли;
							
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			
			Счет = СчетИзМассиваПолей(МассивПолей, Счет);
			
			ПредставлениеДляОСВПоСчету            = НСтр("ru = 'ОСВ по счету %Счет%'");
			ПредставлениеДляКарточкиСчета         = НСтр("ru = 'Карточка счета %Счет%'");
			ПредставлениеДляАнализаСчета          = НСтр("ru = 'Анализ счета %Счет%%КорСчет%'");
			ПредставлениеДляОборотыСчетаПоМесяцам = НСтр("ru = 'Обороты счета %Счет% по месяцам'");
			ПредставлениеДляОборотыСчетаПоДням    = НСтр("ru = 'Обороты счета %Счет% по дням'");
			ПредставлениеДляКарточкиСубконто      = НСтр("ru = 'Карточка субконто'");
			ПредставлениеДляАнализаСубконто       = НСтр("ru = 'Анализ субконто'");
			ПредставлениеДляОтчетаПоПроводкам     = НСтр("ru = 'Отчет по проводкам'");
			ПредставлениеОткрытьЗначение          = НСтр("ru = 'Открыть ""%Значение%""'");
			ПредставлениеДляЖурналаОпераций       = НСтр("ru = 'Журнал операций ф.0504071'");
			
			ПредставлениеДляОСВПоСчету            = СтрЗаменить(ПредставлениеДляОСВПоСчету           , "%Счет%", Счет);
			ПредставлениеДляКарточкиСчета         = СтрЗаменить(ПредставлениеДляКарточкиСчета        , "%Счет%", Счет);
			ПредставлениеДляАнализаСчета          = СтрЗаменить(ПредставлениеДляАнализаСчета         , "%Счет%", Счет);
			ПредставлениеДляОборотыСчетаПоМесяцам = СтрЗаменить(ПредставлениеДляОборотыСчетаПоМесяцам, "%Счет%", Счет);
			ПредставлениеДляОборотыСчетаПоДням    = СтрЗаменить(ПредставлениеДляОборотыСчетаПоДням   , "%Счет%", Счет);
			
			Если ЗначениеЗаполнено(Счет) Тогда
				ОписаниеОсновногоМеню = НСтр("ru = 'Счет %Счет%%КорСчет%'");
				ОписаниеОсновногоМеню = СтрЗаменить(ОписаниеОсновногоМеню, "%Счет%", Счет);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КорСчет) Тогда
				ПредставлениеДляАнализаСчета = СтрЗаменить(ПредставлениеДляАнализаСчета, "%КорСчет%", " кор. счет "+КорСчет);
				ОписаниеОсновногоМеню = СтрЗаменить(ОписаниеОсновногоМеню, "%КорСчет%", " и кор. счет "+КорСчет);
			Иначе
				ПредставлениеДляАнализаСчета = СтрЗаменить(ПредставлениеДляАнализаСчета, "%КорСчет%", "");
				ОписаниеОсновногоМеню = СтрЗаменить(ОписаниеОсновногоМеню, "%КорСчет%", "");
			КонецЕсли;
			
			СписокПунктовМеню = Новый СписокЗначений;
			
			// Отчеты на типовой форме
			Для Каждого ИмяОтчетаРасшифровки Из ОтчетыРасшифровки Цикл
				
				Если ЗначениеЗаполнено(Счет) Тогда
					Если ИмяОтчетаРасшифровки = "ОборотноСальдоваяВедомостьПоСчету" Тогда
						СписокПунктовМеню.Добавить("ОборотноСальдоваяВедомостьПоСчету", ПредставлениеДляОСВПоСчету);
						НастройкиРасшифровки.Вставить("ОборотноСальдоваяВедомостьПоСчету",ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("ОборотноСальдоваяВедомостьПоСчету", МассивПолей, ОтчетОбъект, Счет, КорСчет));
					ИначеЕсли ИмяОтчетаРасшифровки = "КарточкаСчета" Тогда
						СписокПунктовМеню.Добавить("КарточкаСчета", ПредставлениеДляКарточкиСчета);
						НастройкиРасшифровки.Вставить("КарточкаСчета",ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("КарточкаСчета", МассивПолей, ОтчетОбъект, Счет, КорСчет));
					ИначеЕсли ИмяОтчетаРасшифровки = "АнализСчета" Тогда
						СписокПунктовМеню.Добавить("АнализСчета", ПредставлениеДляАнализаСчета);
						НастройкиРасшифровки.Вставить("АнализСчета",ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("АнализСчета", МассивПолей, ОтчетОбъект, Счет, КорСчет));
					ИначеЕсли ИмяОтчетаРасшифровки = "ОборотыСчета" Тогда
						СписокПунктовМеню.Добавить("ОборотыСчетаПоМесяцам", ПредставлениеДляОборотыСчетаПоМесяцам);
						НастройкиРасшифровки.Вставить("ОборотыСчетаПоМесяцам",ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("ОборотыСчетаПоМесяцам", МассивПолей, ОтчетОбъект, Счет, КорСчет));
						СписокПунктовМеню.Добавить("ОборотыСчетаПоДням", ПредставлениеДляОборотыСчетаПоДням);
						НастройкиРасшифровки.Вставить("ОборотыСчетаПоДням",ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("ОборотыСчетаПоДням", МассивПолей, ОтчетОбъект, Счет, КорСчет));
					КонецЕсли;
				КонецЕсли;
				
				Если ИмяОтчетаРасшифровки = "КарточкаСубконто" Тогда
					СписокПунктовМеню.Добавить("КарточкаСубконто", ПредставлениеДляКарточкиСубконто);
					НастройкиРасшифровки.Вставить("КарточкаСубконто",ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("КарточкаСубконто", МассивПолей, ОтчетОбъект, Счет, КорСчет));
				КонецЕсли;
				
				Если ИмяОтчетаРасшифровки = "АнализСубконто" Тогда
					СписокПунктовМеню.Добавить("АнализСубконто", ПредставлениеДляАнализаСубконто);
					НастройкиРасшифровки.Вставить("АнализСубконто",ОтчетыБГУ.НастройкиДляДополнительнойРасшифровки("АнализСубконто", МассивПолей, ОтчетОбъект, Счет, КорСчет));
				КонецЕсли;
				
			КонецЦикла;
			
			Если СписокПунктовМеню.Количество() > 0 Тогда
				ОсновноеМеню.Добавить(СписокПунктовМеню,ОписаниеОсновногоМеню);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОтчетОбъект.Свойство("ДоступнаРасшифровкаВариантамиОтчета")
			И ДополнительныеПараметры <> Неопределено
			И ДополнительныеПараметры.Свойство("ДобавленныеВарианты") Тогда
			
			СписокПунктовМеню = Новый СписокЗначений;
			
			Для Каждого Вариант Из ДополнительныеПараметры.ДобавленныеВарианты Цикл
				СписокПунктовМеню.Добавить("КлючВарианта"+Вариант.КлючВарианта, Строка(Вариант.Ссылка));
			КонецЦикла;
			
			Если СписокПунктовМеню.Количество() > 0 Тогда
				ОписаниеОсновногоМеню = НСтр("ru = 'С помощью варианта'");
				ОсновноеМеню.Добавить(СписокПунктовМеню, ОписаниеОсновногоМеню);
			КонецЕсли;
			
			Для Каждого Элемент Из МассивПолей Цикл
				Если ТипЗнч(Элемент) = Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных")
					И Элемент.Значение <> NULL Тогда
					ОтборДляВариантаОтчета.Вставить(Элемент.Поле, Элемент.Значение);
				ИначеЕсли ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных")
					И Элемент.Использование
					И Элемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
					ОтборДляВариантаОтчета.Вставить(Строка(Элемент.ЛевоеЗначение), Элемент.ПравоеЗначение);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеОбъекта.Вставить("НастройкиРасшифровки", НастройкиРасшифровки);
	Адрес = ПоместитьВоВременноеХранилище(ДанныеОбъекта, Адрес);
	
	Если ОсновноеМеню <> Неопределено Тогда
		ПараметрыРасшифровки.Вставить("ОсновноеМеню", ОсновноеМеню);
	Иначе
		ПараметрыРасшифровки.Вставить("ОсновноеМеню", Новый СписокЗначений);
	КонецЕсли;
	
	Если НЕ ЕстьМассивОсновныхДействий Тогда
		МассивОсновныхДействий = Новый Массив;
		МассивОсновныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	КонецЕсли;
	
	ПараметрыРасшифровки.Вставить("МассивОсновныхДействий", МассивОсновныхДействий);
	
	ПараметрыРасшифровки.Вставить("ОтборДляВариантаОтчета", ОтборДляВариантаОтчета);
	
	Возврат ПараметрыРасшифровки;
	
КонецФункции

// для отчетов ОтчетПоВерсиямКомплектов и ОтчетПоВерсиямОтчетов
Функция ВозможноОткрытьОписаниеКомплекта(АдресДанныхРасшифровки,Расшифровка) Экспорт 

	ПараметрыРасшифровки = Новый Структура;
	ПараметрыРасшифровки.Вставить("ОткрытьОписание",Ложь);
	ПараметрыРасшифровки.Вставить("ИдКомплекта","");

	ДанныеРасшифровки  = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);
	ЭлементРасшифровки = ДанныеРасшифровки.Элементы[Расшифровка];
	ПоляРасшифровки = ЭлементРасшифровки.ПолучитьПоля();
	
	Для Каждого ПолеРасшифровки из ПоляРасшифровки Цикл 
		Если ПолеРасшифровки.Поле = "ИдентификаторКомплекта" Тогда 
			
			ПараметрыРасшифровки.ОткрытьОписание = Истина;
			ПараметрыРасшифровки.ИдКомплекта = ПолеРасшифровки.Значение;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПараметрыРасшифровки;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДополнитьРеквизитыФормыДляРасшифровкиСтандартнымиОтчетами(Знач ПолноеИмяОтчета, Знач ОтчетОбъект, Знач ОтчетДанныеРасшифровки, Знач АдресХранилища, ДанныеРасшифровки, РасшифровкаСтандартнымиОтчетамиВЯчейке = Ложь)
	
	МетаданныеОтчета = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОтчета);
	Если МетаданныеОтчета = Неопределено ИЛИ МетаданныеОтчета.Реквизиты.Найти("ДоступнаРасшифровкаСтандартнымиОтчетами") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РасшифровкаСтандартнымиОтчетамиВЯчейке = МетаданныеОтчета.Реквизиты.Найти("РасшифровкаСтандартнымиОтчетамиВЯчейке") <> Неопределено;
	
	СвойстваОбъекта = Отчеты[МетаданныеОтчета.Имя].СвойстваОбъектаДляРасшифровкиСтандартнымиОтчетами(ОтчетОбъект);
	
	Если НЕ ТипЗнч(СвойстваОбъекта) = Тип("Структура") Или СвойстваОбъекта.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеРасшифровкиОтчет = ПолучитьИзВременногоХранилища(ОтчетДанныеРасшифровки);
	
	Данные = Новый Структура;
	Данные.Вставить("Объект", СвойстваОбъекта); 
	Данные.Вставить("ДанныеРасшифровки", ДанныеРасшифровкиОтчет);
	
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(Данные, АдресХранилища);
	
	Возврат Истина;
	
КонецФункции

Функция СчетИзМассиваПолей(МассивПолей, Счет)
	
	Для Каждого Поле Из МассивПолей Цикл
		Если ТипЗнч(Поле) <> Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если Поле.Поле = "Счет" Тогда
			Возврат Поле.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат Счет;
	
Конецфункции

#КонецОбласти
