

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НомерУзла = 0;
	ПлатежноРасчетныеДокументы.ИнициализироватьДоступныеПоля(Параметры.ОбъектМетаданных,ДоступныеПоля);
	ЭтоНоваяСтрока = Параметры.новаяСтрока;
	НомерСтроки = Параметры.НомерСтроки;
	Если не Параметры.НоваяСтрока тогда
		ЭтоПутьКДанным 			= Параметры.ЭтоПутьКДанным;
		ПредставлениеПример 	= Параметры.ПредставлениеПример;
		ПутьКДанным				= Параметры.Данные;
		ЭтоПовторяющаясяЧасть 	= Параметры.ЭтоПовторяющаясяЧасть;
		ИмяТаблицы				= Параметры.ИмяТаблицы;
		Формат					= Параметры.Формат;
		КлючУсловнойЧасти		= Параметры.КлючУсловнойЧасти;
		Если ЭтоПутьКДанным тогда
			ТипЗаписи = 1;
		ИначеЕсли Прав(ПредставлениеПример,1) = Символы.ПС тогда
			ТипЗаписи = 2;
		Иначе	
			ТипЗаписи = 0;
		КонецЕсли;			
		НомерУзла = 0;
		ПутьБезСсылки = Сред(ПутьКДанным,8);
		НайтиНужноеПоле(НомерУзла,ПутьБезСсылки,ДоступныеПоля);
		Если Имя = "Сумма НДС" тогда
			Для Сч = 1 По СтрЧислоСтрок(Формат) Цикл
				Часть = СтрПолучитьСтроку(Формат, Сч);
				ПозРавно = Найти(Часть, "=");
				Если ПозРавно > 0 Тогда
					ИмяЧасти = Лев(Часть, ПозРавно - 1);
					Значение = Сред(Часть, ПозРавно + 1);
					
					Если ИмяЧасти = "Текст1" Тогда
						Текст1 = Значение
					ИначеЕсли ИмяЧасти = "Ставка" Тогда
						СтавкаФлажок = Истина
					ИначеЕсли ИмяЧасти = "Текст2" Тогда
						Текст2 = Значение
					ИначеЕсли ИмяЧасти = "Сумма" Тогда
						СуммаФлажок = Истина;
						ФорматСуммыНДС = Значение;
					ИначеЕсли ИмяЧасти = "ТекстБезНДС" Тогда
						ТекстБезНДСФлажок = Истина;
						ТекстБезНДС = Значение;
					КонецЕсли; 
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьСтраниц();
	УстановитьВидимостьПолей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипЗаписиПриИзменении(Элемент)
	ЭтоПовторяющаясяЧасть = Ложь;
	УстановитьВидимостьСтраниц()
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиДоступныеПоля

&НаКлиенте
Процедура ДоступныеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если не Контроль(Элементы.ДоступныеПоля.ТекущиеДанные) тогда
		Возврат;
	КонецЕсли;	
	ПредставлениеПример = "["+Элементы.ДоступныеПоля.ТекущиеДанные.Представление+"]";
	Тип 				= Элементы.ДоступныеПоля.ТекущиеДанные.Тип;
	ИмяТаблицы			= Элементы.ДоступныеПоля.ТекущиеДанные.ИмяТаблицы;
	ЭтоПутьКДанным		= Истина;
	ПутьКДанным			= "Ссылка."+Элементы.ДоступныеПоля.ТекущиеДанные.ПутьКДанным;
	Имя 				= Элементы.ДоступныеПоля.ТекущиеДанные.Имя;
	УстановитьВидимостьПолей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	Ошибка = ЗаписатьРеквизиты();
	ЭтаФорма.Модифицированность = Ложь;
	Если не Ошибка тогда
		ЭтаФорма.Закрыть();
	Конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборФормата(Команда)
	Конструктор = Новый КонструкторФорматнойСтроки;
//	Конструктор.ДоступныеТипы = Новый ОписаниеТипов("Число, Дата");
	Конструктор.ДоступныеТипы	= Тип;
	Если Имя = "Сумма НДС" тогда
	    Конструктор.Текст	= ФорматСуммыНДС;
	Иначе
	    Конструктор.Текст	= Формат;
	КонецЕсли;	
	
	Оповещение = Новый ОписаниеОповещения("ВыборФорматаОповещение", ЭтотОбъект);
	Конструктор.Показать(Оповещение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ВыборФорматаОповещение(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Если Имя = "Сумма НДС" тогда
		    ФорматСуммыНДС = Результат;
		Иначе
		    Формат = Результат;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ПолучитьСтрокуФорматаНДС()
	
	Результат = "";
	Если Текст1 <> "" Тогда
		Результат = Результат + Символы.ПС
			+ "Текст1=" + Текст1;
	КонецЕсли;
	Если СтавкаФлажок Тогда
		Результат = Результат + Символы.ПС
			+ "Ставка=";
	КонецЕсли; 
	Если Текст2 <> "" Тогда
		Результат = Результат + Символы.ПС
			+ "Текст2=" + Текст2;
	КонецЕсли;
	Если СуммаФлажок Тогда
		Результат = Результат + Символы.ПС
			+ "Сумма=" + ФорматСуммыНДС;
	КонецЕсли;
	Если ТекстБезНДСФлажок Тогда
		Результат = Результат + Символы.ПС
			+ "ТекстБезНДС=" + ТекстБезНДС;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьСтрокуФорматаНДС()

&НаКлиенте
Функция ЗаписатьРеквизиты()

	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("НомерСтроки",НомерСтроки);
	Если (ТипЗаписи = 0) или (ТипЗаписи = 2)  тогда
		СтруктураРезультата.Вставить("ЭтоПутьКДанным", Ложь);
		Если ТипЗаписи = 2 тогда
			ПредставлениеПример = Символы.ПС;
		КонецЕсли;	
	Иначе	
		СтруктураРезультата.Вставить("ЭтоПутьКДанным", Истина);
	КонецЕсли;	
	СтруктураРезультата.Вставить("Данные", ПутьКДанным);
	СтруктураРезультата.Вставить("ПредставлениеПример", ПредставлениеПример);
	СтруктураРезультата.Вставить("ЭтоПовторяющаясяЧасть",ЭтоПовторяющаясяЧасть);
	СтруктураРезультата.Вставить("ИмяТаблицы",ИмяТаблицы);
	СтруктураРезультата.Вставить("КлючУсловнойЧасти",КлючУсловнойЧасти);
	Если Имя = "Сумма НДС" тогда
		Формат = ПолучитьСтрокуФорматаНДС();
	КонецЕсли;	

	СтруктураРезультата.Вставить("Формат",Формат);
	СтруктураРезультата.Вставить("ЭтоНоваяСтрока",ЭтоНоваяСтрока);
	Если (ТипЗаписи = 1) и не ЗначениеЗаполнено(Имя) тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не выбран реквизит документа'");
		Сообщение.Сообщить();
		Возврат Истина;
	ИначеЕсли (ТипЗаписи = 0) и не ЗначениеЗаполнено(ПредставлениеПример) тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Пустая строка'");
		Сообщение.Сообщить();
		Возврат Истина;
	Иначе
		Оповестить("ЭлементНазначенияПлатежа", СтруктураРезультата);
	КонецЕсли;	
		
	Возврат Ложь;
КонецФункции // ИзменитьРеквизитыДокумента()

&НаКлиенте
Процедура УстановитьВидимостьСтраниц()
	Если ТипЗаписи = 0 тогда
		Элементы.ВыборПользователя.ТекущаяСтраница = Элементы.ВводТекста;
	ИначеЕсли ТипЗаписи = 1 тогда
		Элементы.ВыборПользователя.ТекущаяСтраница = Элементы.ВыборРеквизита;
	Иначе
		Элементы.ВыборПользователя.ТекущаяСтраница = Элементы.ПереводСтроки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПолей()
	Если Элементы.ДоступныеПоля.ТекущиеДанные <> Неопределено тогда
		Элементы.ФорматированиеЗначения.Видимость 	= Тип.СодержитТип(Тип("Число")) или Тип.СодержитТип(Тип("Дата"));
		Если ВРЕГ(СокрЛП(Сред(ПутьКДанным,8))) = "СУММАНДС" Тогда
			Элементы.ФорматированиеЗначения.ТекущаяСтраница = Элементы.ВыборФорматаСуммыНДС;
		Иначе	
			Элементы.ФорматированиеЗначения.ТекущаяСтраница = Элементы.ЧислоДата;
		КонецЕсли;	
			
	Иначе
		Элементы.ФорматированиеЗначения.Видимость 	= ложь;
	КонецЕсли;	
КонецПРоцедуры

&НаСервере
Процедура НайтиНужноеПоле(НомерУзла,ПутьБезСсылки,ПоискДоступныеПоля)
	Для каждого Узел  из ПоискДоступныеПоля.ПолучитьЭлементы() цикл
		Если Узел.ПутьКДанным = ПутьБезСсылки тогда
			Тип = Узел.Тип;
			Имя = Узел.Имя;
			Элементы.ДоступныеПоля.ТекущаяСтрока = НомерУзла;
			Возврат;
		КонецЕсли;	
		НомерУзла = НомерУзла+1;
		НайтиНужноеПоле(НомерУзла,ПутьБезСсылки,Узел);
	КонецЦикла;	
КонецПРоцедуры	

&НаКлиенте
Функция Контроль(ТекущиеДанные) 
	Если ТекущиеДанные.Таблица и Найти(ТекущиеДанные.ПутьКДанным,".") = 0 тогда
		ТекстОшибки = НСтр("ru = 'Выбран реквизит документа табличная чать'");
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		Возврат Ложь	
	КонецЕсли;
	Возврат Истина;
КонецФункции	

#КонецОбласти


