// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Параметры.ВыбраннаяОперация)
			И Не ЗначениеЗаполнено(Параметры.ВыбранныйВидОперации) Тогда
		ВызватьИсключение(НСтр("ru = 'Форма не предназначена для непосредственного использования'"));
	КонецЕсли;
	
	ВыбраннаяОперация = Параметры.ВыбраннаяОперация;
	ВыбранныйВидОперации = Параметры.ВыбранныйВидОперации;
	Если Не ЗначениеЗаполнено(ВыбранныйВидОперации) Тогда
		ВыбранныйВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбраннаяОперация, "ВидОперации");
	КонецЕсли;
	ЗаполнитьШаблоныПоОперации();
	Если ДоступныеШаблоны.Количество() = 1 Тогда
		Если ЗначениеЗаполнено(ВыбраннаяОперация) Тогда
			ЗаполнитьОперациюПоШаблону(ДоступныеШаблоны[0].ПолучитьИдентификатор());
		Иначе
			РезультатЗаполнения = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ДоступныеШаблоны.Количество() = 0 Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(, НСтр("ru = 'Не найдено подходящих шаблонов'"));
	ИначеЕсли ДоступныеШаблоны.Количество() = 1 Тогда
		Если РезультатЗаполнения Тогда
			Если ЗначениеЗаполнено(ВыбраннаяОперация) Тогда
				ОповеститьОбИзменении(ВыбраннаяОперация);
			Иначе
				ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, ДоступныеШаблоны[0].СериализованнаяНастройка);
			КонецЕсли;
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеШаблоны

&НаКлиенте
Процедура ДоступныеШаблоныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗаполнитьПоШаблонуНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеШаблоныВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ЗаполнитьПоШаблонуНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	ЗаполнитьПоШаблонуНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьПоШаблонуНаКлиенте()
	ТекущиеДанные = Элементы.ДоступныеШаблоны.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбран шаблон для заполнения'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыбраннаяОперация) Тогда
		Закрыть(ТекущиеДанные.СериализованнаяНастройка);
	Иначе
		ЗаполнитьОперациюПоШаблону(ТекущиеДанные.ПолучитьИдентификатор());
		Если РезультатЗаполнения Тогда
			Закрыть(Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОперациюПоШаблону(ИдентификаторСтроки)
	ДанныеЗаполнения = ДоступныеШаблоны.НайтиПоИдентификатору(ИдентификаторСтроки);
	НастройкиОперации = ОбщегоНазначения.ЗначениеИзСтрокиXML(ДанныеЗаполнения.СериализованнаяНастройка);
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ОперацииУчетаВещевогоДовольствия");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыбраннаяОперация);
		Блокировка.Заблокировать();
		
		ОперацияОбъект = ВыбраннаяОперация.ПолучитьОбъект();
		Справочники.ОперацииУчетаВещевогоДовольствия.ЗаполнитьОперациюИзСвойствОперации(ОперацияОбъект,
			НастройкиОперации);
		ОперацияОбъект.Записать();
		
		РезультатЗаполнения = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		РезультатЗаполнения = Ложь;
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблоныПоОперации()
	
	ШаблоныИзНастроек = Справочники.ОперацииУчетаВещевогоДовольствия.ПредопределенныеНастройкиПоВидуОперации(
		ВыбранныйВидОперации);
	Для каждого Шаблон Из ШаблоныИзНастроек Цикл
		НоваяСтрока = ДоступныеШаблоны.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Шаблон);
		НоваяСтрока.СериализованнаяНастройка = ОбщегоНазначения.ЗначениеВСтрокуXML(Шаблон);
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти
