Перем СтрокаСубконто;
Перем СтрокаРегистрБух;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.Заголовок;
	
	Дерево = РеквизитФормыВЗначение("ДеревоПоказателей");
	
	// Субконто
	Субконто = Дерево.Строки.Добавить();
	Субконто.ИмяРеквизита = СтрокаСубконто;
	Субконто.ПредставлениеРеквизита = СтрокаСубконто;
	Выборка = ПланыВидовХарактеристик.ВидыСубконто.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СправочникИлиПеречисление(Выборка.ТипЗначения) Тогда
			Элемент = Субконто.Строки.Добавить();
			Элемент.ИмяРеквизита = Метаданные.НайтиПотипу(Выборка.ТипЗначения.Типы()[0]).Имя;
			Элемент.ТипРеквизита = Выборка.Ссылка;
			Элемент.ПредставлениеРеквизита = Выборка.Наименование + " (" + Элемент.ИмяРеквизита + ")"; 
			ЗаполнитьДерево(Элемент, Выборка.ТипЗначения);
		КонецЕсли
	КонецЦикла;
	
	// Регистр бухгалтерии
	Регистр = Дерево.Строки.Добавить();
	Регистр.ИмяРеквизита = СтрокаРегистрБух;
	Регистр.ПредставлениеРеквизита = СтрокаРегистрБух;
	Для каждого Измерение из Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.Измерения Цикл
		Если СправочникИлиПеречисление(Измерение.Тип) Тогда
			Элемент = Регистр.Строки.Добавить();
			Элемент.ИмяРеквизита = Измерение.Имя;
			Элемент.ТипРеквизита = Измерение.Тип;
			Элемент.ПредставлениеРеквизита = Элемент.ИмяРеквизита;
			ЗаполнитьДерево(Элемент, Измерение.Тип)
		КонецЕсли
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дерево, "ДеревоПоказателей");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ДеревоПоказателей.Развернуть(1);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоПоказателей

&НаКлиенте
Процедура ДеревоПоказателейПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные.ТипРеквизита = Неопределено Тогда
		Элементы.КнопкаВыбрать.Доступность = Ложь;
	ИначеЕсли ТипЗнч(Элемент.ТекущиеДанные.ТипРеквизита) = Тип("ПланВидовХарактеристикСсылка.ВидыСубконто") Тогда
		Элементы.КнопкаВыбрать.Доступность = Истина;
	Иначе
		Элементы.КнопкаВыбрать.Доступность = Элемент.ТекущиеДанные.ТипРеквизита.Типы().Количество();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПоказателейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Закрываемся();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрываемся();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СправочникИлиПеречисление(Тип)
	
	Для каждого Типа из Тип.Типы() Цикл
		ОбъектМ = Метаданные.НайтиПоТипу(Типа);
		Если
			Метаданные.Справочники.Найти(ОбъектМ.Имя) = Неопределено И
			Метаданные.Перечисления.Найти(ОбъектМ.Имя) = Неопределено
		Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Заполняем дерево
Процедура ЗаполнитьДерево(Родитель, Тип)
	
	Для каждого Типа из Тип.Типы() Цикл
		ОбъектМ = Метаданные.НайтиПоТипу(Типа);
		Попытка // Справочник
				// Вставляем владельца
			Для каждого Владелец из  ОбъектМ.Владельцы Цикл
				Элемент = Родитель.Строки.Добавить();
				Элемент.ИмяРеквизита = ОбъектМ.СтандартныеРеквизиты.Владелец.Имя;
				Элемент.ТипРеквизита = ОбъектМ.СтандартныеРеквизиты.Владелец.Тип;
				Элемент.ПредставлениеРеквизита = Элемент.ИмяРеквизита;
				Прервать;
			КонецЦикла;
			Для каждого Реквизит из ОбъектМ.Реквизиты Цикл
				Элемент = Родитель.Строки.Добавить();
				Элемент.ИмяРеквизита = Реквизит.Имя;
				Элемент.ТипРеквизита = Реквизит.Тип;
				Элемент.ПредставлениеРеквизита = Элемент.ИмяРеквизита;
			КонецЦикла;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Закрываемся()
		
	Строка = "";
	Показатель = Неопределено;
	
	Элемент = Элементы.ДеревоПоказателей.ТекущиеДанные;
	Пока Элемент.ПолучитьРодителя() <> Неопределено Цикл
		Если СтрДлина(Строка) Тогда
			Строка = "." + Строка;
		КонецЕсли;
		Строка = Элемент.ИмяРеквизита + Строка;
		Если Элемент.ПолучитьРодителя() <> Неопределено И Элемент.ПолучитьРодителя().ПолучитьРодителя() = Неопределено Тогда
			Показатель = Элемент.ТипРеквизита;
		КонецЕсли;
		Элемент = Элемент.ПолучитьРодителя();
	КонецЦикла;
	
	Результат = Новый Структура("Строка, Показатель", Строка, Показатель); 
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

СтрокаСубконто = "Субконто";
СтрокаРегистрБух = "РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Измерения";
