#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем 	ЭтоБанковскийСчет;  // признак банковского счета
	
#Область ПрограммныйИнтерфейс	

Функция НеЗаполненыОбязательныеРеквизиты() Экспорт
	
	Заголовок = "Запись платежных реквизитов лицевого счета: "+ Наименование + ", код " + Код;
	
	ОтказЗаписи = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не указан лицевой счет.", , Владелец,,ОтказЗаписи);
	КонецЕсли;
	
	Возврат ОтказЗаписи;
    	
КонецФункции	

Функция СформироватьАвтоНаименование() Экспорт
			 
	СтрокаНаименования	= "";
	Если ЗначениеЗаполнено(КассовыйОрган) Тогда
		СтрокаНаименования	= Строка(КассовыйОрган);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЭтоБанковскийСчет", ЭтоБанковскийСчет) Тогда
		Если НЕ ЭтоБанковскийСчет Тогда
			Если НЕ СчетКазначейства.Пустая() Тогда	
				СтрокаНаименования	= СтрокаНаименования + ", " + СчетКазначейства.Код;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
						 
	Возврат Лев(СтрокаНаименования,50);

КонецФункции // СформироватьАвтоНаименование()

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

	Если ПометкаУдаления ИЛИ Ссылка.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;

	Отказ = НеЗаполненыОбязательныеРеквизиты();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Владелец") Тогда
		СтруктураПоиска = Новый Структура("УполномоченныйБанк", "ГосударственныйКонтрактПоГОЗ.УполномоченныйБанк");
		УполномоченныйБанк = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения.Владелец,СтруктураПоиска).УполномоченныйБанк;
		ДанныеЗаполнения.Вставить("КассовыйОрган", УполномоченныйБанк);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
