
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Остаток, Номенклатура, ЕдиницаИзмерения");
	
	Если ЗначениеЗаполнено(Параметры.КатегорииДовольствующихся) Тогда
		
		ТаблицаКатегорий = ПолучитьИзВременногоХранилища(Параметры.КатегорииДовольствующихся);
		ТекущееКоличествоКатегории = Параметры.ТекущаяСтрокаМатериалы;
		
		Для Каждого Категория Из ТаблицаКатегорий Цикл
			НоваяСтрока = ТаблицаРаспределенияКоличества.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Категория);
			Если ТекущееКоличествоКатегории <> Неопределено Тогда
				НоваяСтрока.Количество = ТекущееКоличествоКатегории[Категория.ИмяКолонки];
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.ВсегоОстаток.Заголовок = СтрШаблон("Всего остаток: %1 %2 по ""%3""", Остаток, ЕдиницаИзмерения, Номенклатура);
	Элементы.ТаблицаРаспределенияКоличестваКоличество.ТекстПодвала = ТаблицаРаспределенияКоличества.Итог("Количество");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Завершить(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаРаспределенияКоличества

&НаКлиенте
Процедура ТаблицаРаспределенияКоличестваКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаРаспределенияКоличества.ТекущиеДанные;
	
	ИтогКоличества = ТаблицаРаспределенияКоличества.Итог("Количество");
	Дельта = ИтогКоличества - Остаток;
	Если Дельта > 0 Тогда
		ТекущиеДанные.Количество = ТекущиеДанные.Количество - Дельта;
	КонецЕсли;
	
	Элементы.ТаблицаРаспределенияКоличестваКоличество.ТекстПодвала = ТаблицаРаспределенияКоличества.Итог("Количество");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаспределенияКоличестваПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Завершить(Команда)
	Закрыть(ТаблицаРаспределенияКоличества);
КонецПроцедуры

#КонецОбласти




