Функция ПолучитьКодНаименованиеПредставление(ЗначениеСсылка) Экспорт
	
	// Синоним значения имеет формат вида
	// 1.1	просроченная задолженность
	// <код> <наименование>
	
	Результат = Новый Структура();
	Результат.Вставить("Код",			"");
	Результат.Вставить("Наименование",	"");
	Результат.Вставить("Представление",	"");
	
	Если ЗначениеЗаполнено(ЗначениеСсылка) Тогда
		Представление = Строка(ЗначениеСсылка);
		
		Позиция = СтрНайти(Представление, " ");
		
		Если ЗначениеЗаполнено(Позиция) Тогда
			Результат.Код = Лев(Представление, Позиция - 1);
			Результат.Наименование = Сред(Представление, Позиция + 1);
		КонецЕсли;
		
		Результат.Представление = Представление;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
