
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Константа.ОрганизацияЦентрализованнаяБухгалтерия КАК ОЦБ
	|    ПО ЭтотСписок.Сотрудник.Владелец = ОЦБ.Значение
	|
	|;
	|РазрешитьЧтение
	|ГДЕ
	|  ЗначениеРазрешено(Сотрудник.Владелец)
	|  ИЛИ НЕ ОЦБ.Значение ЕСТЬ NULL
	|
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|    ЗначениеРазрешено(Сотрудник.Владелец)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
