#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ПодключаемыеКоманды

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииСоставаНастроекПодключаемыхОбъектов.
//
// Параметры:
//  Настройки - Структура:
//   * ДобавитьКомандыПечати - Булево
//   * Размещение - Массив
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	Настройки.ДобавитьКомандыПечати = Истина;
	Настройки.Размещение = ОбъектыМетаданныхРазмещенияКоманды();
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Печать

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати									= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати					= "Обработка.ПечатьЛистаГолосованияКомиссии";
	КомандаПечати.Идентификатор						= "ЛистаГолосования";
	КомандаПечати.Представление						= НСтр("ru = 'Лист голосования'");
	КомандаПечати.Порядок							= 50;
	КомандаПечати.ПроверкаПроведенияПередПечатью	= Ложь;
	КомандаПечати.ТипыОбъектовПечати				= СписокТиповДокументовДляПечати();
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ЛистаГолосования") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ЛистаГолосования", "Лист голосования", ПечатьЛистаГолосования(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъектыМетаданныхРазмещенияКоманды()
	Результат = Новый Массив;
	Для Каждого ТипОбъекта Из СписокТиповДокументовДляПечати() Цикл
		Результат.Добавить(Метаданные.НайтиПоТипу(ТипОбъекта));
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция СписокТиповДокументовДляПечати()
	
	Возврат Метаданные.ОпределяемыеТипы.ДокументыСГолосованиемКомиссии.Тип.Типы();
	
КонецФункции

Функция ПечатьЛистаГолосования(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЛистГолосования";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьЛистаГолосованияКомиссии.ПФ_MXL_ЛистГолосования");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьОбъект		= Макет.ПолучитьОбласть("СтрокаОбъекта");
	ОбластьКомиссия		= Макет.ПолучитьОбласть("СтрокаКомиссии");
	ОбластьПредседатель	= Макет.ПолучитьОбласть("Председатель");
	ОбластьСотрудник	= Макет.ПолучитьОбласть("ЧленКомиссии");
	ОбластьИсполнитель	= Макет.ПолучитьОбласть("Исполнитель");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаЛистаГолосования(МассивОбъектов);
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.УстановитьПараметр("РезолюцияКомиссииРешениеОПризнанииОбъектовМЗ",
		УправлениеНФАКлиентСервер.ТекстРезолюцииКомиссииПоУмолчанию("РешениеОПризнанииОбъектовМЗ"));
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаДокумент			= Результат[0].Выбрать();
	ВыборкаОбъекты			= Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКомиссия			= Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	РезультатГолосования	= Результат[4].Выгрузить();
	
	РезультатГолосования.Индексы.Добавить("Ссылка,ИдентификаторСтроки,Сотрудник");
	
	ТаблицаРеквизитовПервичныхДокументов = ПрочитатьРеквизитыПервичныхДокументовИзПроводок(МассивОбъектов);
	
	Поиск = Новый Структура("Ссылка");
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Шапка
		
		ЗаполнитьЗначенияСвойств(Поиск, ВыборкаДокумент);
		
		МассивСтрок = ТаблицаРеквизитовПервичныхДокументов.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() > 0 Тогда
			СтрокаТаблицы = МассивСтрок[0];
			
			НаименованиеДокумента = СтрокаТаблицы.ВидПервичногоДокумента;
			НомерДокумента = СтрокаТаблицы.НомерПервичногоДокумента;
			ДатаДокумента = СтрокаТаблицы.ДатаПервичногоДокумента;
		Иначе
			НаименованиеДокумента = Метаданные.НайтиПоТипу(ТипЗнч(ВыборкаДокумент.Ссылка)).Синоним;
			НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаДокумент.Ссылка, ВыборкаДокумент.НомерДокумента);
			ДатаДокумента = ВыборкаДокумент.ДатаДокумента;
		КонецЕсли;
		
		ПараметрыПервичногоДокумента = Новый Структура("НаименованиеДокумента,НомерДокумента,ДатаДокумента",
			НаименованиеДокумента,
			НомерДокумента,
			ДатаДокумента);
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаДокумент);
		ОбластьШапка.Параметры.Заполнить(ПараметрыПервичногоДокумента);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОтборДок = Новый Структура("Ссылка", ВыборкаДокумент.Ссылка);
		
		// Комиссия документа
		
		Комиссия = Новый ТаблицаЗначений;
		Комиссия.Колонки.Добавить("Сотрудник");
		Комиссия.Колонки.Добавить("Председатель");
		Комиссия.Колонки.Добавить("ФИО");
		Комиссия.Колонки.Добавить("Должность");
		Комиссия.Колонки.Добавить("ДолжностьНаименование");
		Комиссия.Колонки.Добавить("Статус");
		Комиссия.Колонки.Добавить("За");
		Комиссия.Колонки.Добавить("Против");
		
		ВыборкаКомиссия.Сбросить();
		
		Пока ВыборкаКомиссия.НайтиСледующий(ОтборДок) Цикл
			
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект,Период,Фамилия,Имя,Отчество,Должность,ДолжностьНаименование",
			ВыборкаКомиссия.Сотрудник, ВыборкаДокумент.ДатаДокумента);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
			
			Статус = ?(ВыборкаКомиссия.Председатель, НСтр("ru = 'председатель комиссии'"), НСтр("ru = 'член комиссии'"));
			
			СтрокаКомиссии = Комиссия.Добавить();
			СтрокаКомиссии.Сотрудник				= ВыборкаКомиссия.Сотрудник;
			СтрокаКомиссии.Председатель				= ВыборкаКомиссия.Председатель;
			СтрокаКомиссии.ФИО						= КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника);
			СтрокаКомиссии.Должность				= ДанныеСотрудника.Должность;
			СтрокаКомиссии.ДолжностьНаименование	= ДанныеСотрудника.ДолжностьНаименование;
			СтрокаКомиссии.Статус					= Статус;
			
		КонецЦикла;
		
		КоличествоПрисутствующихСотрудников = Комиссия.Количество();
		
		// Таблица
		
		ВыборкаОбъекты.Сбросить();
		
		Пока ВыборкаОбъекты.НайтиСледующий(ОтборДок) Цикл
			
			// Считаем голоса
			
			ВыборкаОбъект = ВыборкаОбъекты.Выбрать();
			
			Пока ВыборкаОбъект.Следующий() Цикл
				
				ОтборОбъект = Новый Структура("Ссылка,ИдентификаторСтроки,Сотрудник", ВыборкаДокумент.Ссылка, ВыборкаОбъект.ИдентификаторСтроки);
				
				КоличествоГолосовЗа = 0;
				КоличествоГолосовПротив = 0;
				
				Для Каждого СтрокаКомиссии Из Комиссия Цикл
					
					ОтборОбъект.Сотрудник = СтрокаКомиссии.Сотрудник;
					Голоса = РезультатГолосования.НайтиСтроки(ОтборОбъект);
					Голос = ?(Голоса.Количество() > 0, Голоса[0].РезультатГолосования, Неопределено);
					
					Если Голос = Перечисления.РезультатыГолосованияЧленовКомиссии.За Тогда
						СтрокаКомиссии.За		= НСтр("ru = 'за'");
						СтрокаКомиссии.Против	= "";
						КоличествоГолосовЗа		= КоличествоГолосовЗа + 1;
					ИначеЕсли Голос = Перечисления.РезультатыГолосованияЧленовКомиссии.Против Тогда
						СтрокаКомиссии.За		= "";
						СтрокаКомиссии.Против	= НСтр("ru = 'против'");
						КоличествоГолосовПротив	= КоличествоГолосовПротив + 1;
					Иначе
						СтрокаКомиссии.За		= "";
						СтрокаКомиссии.Против	= "";
					КонецЕсли;
					
				КонецЦикла;
				
				// Выводим объект
				
				ГолосовЗа = ?(КоличествоПрисутствующихСотрудников = 0, 0, Окр(100 * КоличествоГолосовЗа / КоличествоПрисутствующихСотрудников, 2));
				ГолосовПротив = ?(КоличествоПрисутствующихСотрудников = 0, 0, Окр(100 * КоличествоГолосовПротив / КоличествоПрисутствующихСотрудников, 2));
				ПараметрыОбъекта = Новый Структура("За,Против", ГолосовЗа, ГолосовПротив);
				
				ОбластьОбъект.Параметры.Заполнить(ВыборкаОбъект);
				ОбластьОбъект.Параметры.Заполнить(ПараметрыОбъекта);
				ТабличныйДокумент.Вывести(ОбластьОбъект);
				
				// Выводим голоса по объекту
				
				Для Каждого СтрокаКомиссии Из Комиссия Цикл
					
					ОбластьКомиссия.Параметры.Заполнить(СтрокаКомиссии);
					ТабличныйДокумент.Вывести(ОбластьКомиссия);
					
				КонецЦикла;
				
			КонецЦикла;
			
			НомерПоследнейСтроки = ТабличныйДокумент.ВысотаТаблицы;
			Область = ТабличныйДокумент.Область(НомерПоследнейСтроки, 1, НомерПоследнейСтроки, 6);
			Область.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
			
		КонецЦикла;
		
		// Выводим комиссию
		
		СтрокаПредседателя = Неопределено;
		Для Каждого СтрокаКомиссии Из Комиссия Цикл
			Если СтрокаКомиссии.Председатель Тогда
				СтрокаПредседателя = СтрокаКомиссии;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаПредседателя = Неопределено Тогда
			СтрокаПредседателя = Новый Структура("Должность,ДолжностьНаименование,Сотрудник,ФИО");
		КонецЕсли;
		
		ОбластьПредседатель.Параметры.Заполнить(СтрокаПредседателя);
		ТабличныйДокумент.Вывести(ОбластьПредседатель);
		
		НомерСтроки = 0;
		Для Каждого СтрокаКомиссии Из Комиссия Цикл
			Если Не СтрокаКомиссии.Председатель Тогда
				Статус = Новый Структура("Статус", ?(НомерСтроки = 0, НСтр("ru = 'Члены комиссии:'"), ""));
				ОбластьСотрудник.Параметры.Заполнить(СтрокаКомиссии);
				ОбластьСотрудник.Параметры.Заполнить(Статус);
				ТабличныйДокумент.Вывести(ОбластьСотрудник);
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЦикла;
		
		// Выводим исполнителя
		
		Если ТипЗнч(ВыборкаДокумент.Ответственный) = Тип("СправочникСсылка.Пользователи") Тогда
			СведенияИсполнителя = УправлениеПечатьюБГУ.СведенияИсполнителяПоОтветственному(ВыборкаДокумент.Ответственный,
				ВыборкаДокумент.Организация, ВыборкаДокумент.ДатаДокумента, Истина, Ложь);
		ИначеЕсли ТипЗнч(ВыборкаДокумент.Ответственный) = Тип("СправочникСсылка.Сотрудники") Тогда
			ДанныеСотрудника = Справочники.Сотрудники.ДанныеСотрудника(ВыборкаДокумент.Ответственный,
				"Фамилия, Имя, Отчество, Должность, ДолжностьНаименование",
				ВыборкаДокумент.ДатаДокумента,
				Истина);
			ФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Ложь);
			СведенияИсполнителя = УправлениеПечатьюБГУ.ПустаяСтруктураСведенийИсполнителя();
			СведенияИсполнителя.Исполнитель =           ВыборкаДокумент.Ответственный;
			СведенияИсполнителя.ФИО =                   ФИО;
			СведенияИсполнителя.Должность =             ДанныеСотрудника.Должность;
			СведенияИсполнителя.ДолжностьНаименование = ДанныеСотрудника.ДолжностьНаименование;
			СведенияИсполнителя.НомерТелефона =         ДанныеСотрудника.ТелефонРабочийФизическиеЛица;
			СведенияИсполнителя.ЭлектроннаяПочта =      ДанныеСотрудника.EmailФизическиеЛица;
		Иначе
			СведенияИсполнителя = УправлениеПечатьюБГУ.ПустаяСтруктураСведенийИсполнителя();
		КонецЕсли;
		ОбластьИсполнитель.Параметры.Заполнить(СведенияИсполнителя);
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);
		
		// Выводим подвал
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокумент.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ТекстЗапросаЛистаГолосования(МассивОбъектов) Экспорт
	
	ОбъектыПоТипам = Новый Соответствие;
	Для Каждого Объект Из МассивОбъектов Цикл
		
		ТипОбъекта = ТипЗнч(Объект);
		ОбъектыЭтогоТипа = ОбъектыПоТипам.Получить(ТипОбъекта);
		Если ОбъектыЭтогоТипа = Неопределено Тогда
			ОбъектыЭтогоТипа = Новый Массив;
			ОбъектыПоТипам.Вставить(ТипОбъекта, ОбъектыЭтогоТипа);
		КонецЕсли;
		ОбъектыЭтогоТипа.Добавить(Объект);
		
	КонецЦикла;
	
	ЗапросыДокумент = Новый Массив;
	ЗапросыОбъекты = Новый Массив;
	ЗапросыКомиссия = Новый Массив;
	
	Для Каждого ОбъектыЭтогоТипа Из ОбъектыПоТипам Цикл
		
		ЧастиДобавляемогоЗапроса = ЧастиЗапросаПоТипу(ОбъектыЭтогоТипа.Ключ);
		ЗапросыДокумент.Добавить(ЧастиДобавляемогоЗапроса.Документ);
		ЗапросыОбъекты.Добавить(ЧастиДобавляемогоЗапроса.Объекты);
		ЗапросыКомиссия.Добавить(ЧастиДобавляемогоЗапроса.Комиссия);
		
	КонецЦикла;
	
	ЧастиОсновногоЗапроса = Новый Массив;
	ЧастиОсновногоЗапроса.Добавить(СтрСоединить(ЗапросыДокумент, ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("ВСЕ")));
	ЧастиОсновногоЗапроса.Добавить(СтрСоединить(ЗапросыОбъекты, ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("ВСЕ")));
	ЧастиОсновногоЗапроса.Добавить(СтрСоединить(ЗапросыКомиссия, ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("ВСЕ")));
	
	// В запрос по объектам добавить ИТОГИ
	
	ЧастиОсновногоЗапроса[1] = ЧастиОсновногоЗапроса[1] + "
	|ИТОГИ ПО
	|	Ссылка";
	
	// В запрос комиссии добавить создание временной таблицы
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ЧастиОсновногоЗапроса[2]);
	НомерСтроки = 1;
	Пока НомерСтроки < ТекстовыйДокумент.КоличествоСтрок() Цикл
		Если НРег(СокрЛП(ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки))) = "из" Тогда
			Прервать;
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	ТекстовыйДокумент.ВставитьСтроку(НомерСтроки, "ПОМЕСТИТЬ ВТ_СоставКомиссии");
	ЧастиОсновногоЗапроса[2] = ТекстовыйДокумент.ПолучитьТекст();
	
	ЧастиОсновногоЗапроса.Добавить(
	"ВЫБРАТЬ
	|	ВТ_СоставКомиссии.Ссылка КАК Ссылка,
	|	ВТ_СоставКомиссии.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ПостоянноДействующиеКомиссииСоставКомиссии.СтатусЧленаКомиссии = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленовКомиссии.Председатель), ЛОЖЬ) КАК Председатель
	|ИЗ
	|	ВТ_СоставКомиссии КАК ВТ_СоставКомиссии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПостоянноДействующиеКомиссии.СоставКомиссии КАК ПостоянноДействующиеКомиссииСоставКомиссии
	|		ПО ВТ_СоставКомиссии.Комиссия = ПостоянноДействующиеКомиссииСоставКомиссии.Ссылка
	|			И ВТ_СоставКомиссии.Сотрудник = ПостоянноДействующиеКомиссииСоставКомиссии.Сотрудник
	|ГДЕ
	|	НЕ ВТ_СоставКомиссии.Отсутствует
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_СоставКомиссии.НомерСтроки");
	ЧастиОсновногоЗапроса.Добавить(
	"ВЫБРАТЬ
	|	РезультатыГолосованияКомиссий.ДокументОснование КАК Ссылка,
	|	РезультатыГолосованияКомиссий.Сотрудник КАК Сотрудник,
	|	РезультатыГолосованияКомиссий.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РезультатыГолосованияКомиссий.РезультатГолосования КАК РезультатГолосования
	|ИЗ
	|	РегистрСведений.РезультатыГолосованияКомиссий КАК РезультатыГолосованияКомиссий
	|ГДЕ
	|	РезультатыГолосованияКомиссий.ДокументОснование В(&Ссылка)");
	
	Возврат СтрСоединить(ЧастиОсновногоЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
КонецФункции

// Части запроса по типу.
// 
// Параметры:
//  ТипОбъекта - Произвольный, Тип - Тип объекта
// 
// Возвращаемое значение:
//  см. ЧастиЗапроса
Функция ЧастиЗапросаПоТипу(ТипОбъекта)
	Если ТипОбъекта = Тип("ДокументСсылка.АктКонсервацииРасконсервации") Тогда
		Возврат ТекстЗапросаЛистаГолосования_АктКонсервацииРасконсервации();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.АктОбУтилизацииМЗ") Тогда
		Возврат ТекстЗапросаЛистаГолосования_АктОбУтилизацииМЗ();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.АктОбУтилизацииМЗИК") Тогда
		Возврат ТекстЗапросаЛистаГолосования_АктОбУтилизацииМЗИК();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.АктОбУтилизацииОС") Тогда
		Возврат ТекстЗапросаЛистаГолосования_АктОбУтилизацииОС();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.АктОбУтилизацииОСИК") Тогда
		Возврат ТекстЗапросаЛистаГолосования_АктОбУтилизацииОСИК();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.АктОРезультатахИнвентаризацииНаличныхДС") Тогда
		Возврат ТекстЗапросаЛистаГолосования_АктОРезультатахИнвентаризацииНаличныхДС();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.АктСписанияИК") Тогда
		Возврат ТекстЗапросаЛистаГолосования_АктСписанияИК();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.АктСписанияМЗ") Тогда
		Возврат ТекстЗапросаЛистаГолосования_АктСписанияМЗ();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РешениеОбОценкеИмущества") Тогда
		Возврат ТекстЗапросаЛистаГолосования_РешениеОбОценкеИмущества();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РешениеОбОценкеИмуществаКазны") Тогда
		Возврат ТекстЗапросаЛистаГолосования_РешениеОбОценкеИмуществаКазны();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РешениеОбОценкеИмуществаМЗ") Тогда
		Возврат ТекстЗапросаЛистаГолосования_РешениеОбОценкеИмуществаМЗ();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивом") Тогда
		Возврат ТекстЗапросаЛистаГолосования_РешениеОПрекращенииПризнанияАктивом();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомИК") Тогда
		Возврат ТекстЗапросаЛистаГолосования_РешениеОПрекращенииПризнанияАктивомИК();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомМЗ") Тогда
		Возврат ТекстЗапросаЛистаГолосования_РешениеОПрекращенииПризнанияАктивомМЗ();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомМЗИК") Тогда
		Возврат ТекстЗапросаЛистаГолосования_РешениеОПрекращенииПризнанияАктивомМЗИК();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РешениеОПризнанииОбъектовМЗ") Тогда
		Возврат ТекстЗапросаЛистаГолосования_РешениеОПризнанииОбъектовМЗ();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РешениеОПризнанииОбъектовМЗИК") Тогда
		Возврат ТекстЗапросаЛистаГолосования_РешениеОПризнанииОбъектовМЗИК();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РешениеОПризнанииОбъектовОС") Тогда
		Возврат ТекстЗапросаЛистаГолосования_РешениеОПризнанииОбъектовОС();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.РешениеОПризнанииОбъектовОСИК") Тогда
		Возврат ТекстЗапросаЛистаГолосования_РешениеОПризнанииОбъектовОСИК();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.СписаниеБСО") Тогда
		Возврат ТекстЗапросаЛистаГолосования_СписаниеБСО();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.СписаниеВосстановлениеЗадолженностиПоДоходам") Тогда
		Возврат ТекстЗапросаЛистаГолосования_СписаниеВосстановлениеЗадолженностиПоДоходам();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.СписаниеКредиторскойЗадолженности") Тогда
		Возврат ТекстЗапросаЛистаГолосования_СписаниеКредиторскойЗадолженности();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.СписаниеОбъектовИК") Тогда
		Возврат ТекстЗапросаЛистаГолосования_СписаниеОбъектовИК();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.СписаниеОбъектовОС") Тогда
		Возврат ТекстЗапросаЛистаГолосования_СписаниеОбъектовОС();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.СписаниеТранспорта") Тогда
		Возврат ТекстЗапросаЛистаГолосования_СписаниеТранспорта();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.СписаниеТранспортаИК") Тогда
		Возврат ТекстЗапросаЛистаГолосования_СписаниеТранспортаИК();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ТаксировкаПутевогоЛиста") Тогда
		Возврат ТекстЗапросаЛистаГолосования_ТаксировкаПутевогоЛиста();
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ТаксировкаРабочегоЛистаАгрегата") Тогда
		Возврат ТекстЗапросаЛистаГолосования_ТаксировкаРабочегоЛистаАгрегата();
	КонецЕсли;
КонецФункции

// Части запроса.
// 
// Возвращаемое значение:
//  Структура - Части запроса:
// * Документ - Строка -
// * Объекты - Строка -
// * Комиссия - Строка -
Функция ЧастиЗапроса()
	Результат = Новый Структура;
	Результат.Вставить("Документ", "");
	Результат.Вставить("Объекты", "");
	Результат.Вставить("Комиссия", "");
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_АктКонсервацииРасконсервации()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	АктКонсервацииРасконсервации.Ссылка КАК Ссылка,
	|	АктКонсервацииРасконсервации.Организация КАК Организация,
	|	АктКонсервацииРасконсервации.Дата КАК ДатаДокумента,
	|	АктКонсервацииРасконсервации.Номер КАК НомерДокумента,
	|	АктКонсервацииРасконсервации.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	АктКонсервацииРасконсервации.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.АктКонсервацииРасконсервации КАК АктКонсервацииРасконсервации
	|ГДЕ
	|	АктКонсервацииРасконсервации.Ссылка В (&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	АктКонсервацииРасконсервации.Ссылка КАК Ссылка,
	|	"""" КАК ИдентификаторСтроки,
	|	АктКонсервацииРасконсервации.ОсновноеСредство КАК Объект,
	|	АктКонсервацииРасконсервации.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	АктКонсервацииРасконсервации.ИнвентарныйНомер КАК Идентификатор,
	|	АктКонсервацииРасконсервации.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.АктКонсервацииРасконсервации КАК АктКонсервацииРасконсервации
	|ГДЕ
	|	АктКонсервацииРасконсервации.Ссылка В(&Ссылка)";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	АктКонсервацииРасконсервацииСоставКомиссии.Ссылка КАК Ссылка,
	|	АктКонсервацииРасконсервацииСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	АктКонсервацииРасконсервацииСоставКомиссии.Сотрудник КАК Сотрудник,
	|	АктКонсервацииРасконсервацииСоставКомиссии.Отсутствует КАК Отсутствует,
	|	АктКонсервацииРасконсервацииСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.АктКонсервацииРасконсервации.СоставКомиссии КАК АктКонсервацииРасконсервацииСоставКомиссии
	|ГДЕ
	|	АктКонсервацииРасконсервацииСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_АктОбУтилизацииМЗ()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	АктОбУтилизацииМЗ.Ссылка КАК Ссылка,
	|	АктОбУтилизацииМЗ.Организация КАК Организация,
	|	АктОбУтилизацииМЗ.Дата КАК ДатаДокумента,
	|	АктОбУтилизацииМЗ.Номер КАК НомерДокумента,
	|	АктОбУтилизацииМЗ.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	АктОбУтилизацииМЗ.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.АктОбУтилизацииМЗ КАК АктОбУтилизацииМЗ
	|ГДЕ
	|	АктОбУтилизацииМЗ.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	АктОбУтилизацииМЗМатериалы.НомерСтроки,
	|	АктОбУтилизацииМЗМатериалы.Ссылка КАК Ссылка,
	|	АктОбУтилизацииМЗМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	АктОбУтилизацииМЗМатериалы.Номенклатура КАК Объект,
	|	АктОбУтилизацииМЗМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АктОбУтилизацииМЗМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(АктОбУтилизацииМЗМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ АктОбУтилизацииМЗМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	АктОбУтилизацииМЗМатериалы.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.АктОбУтилизацииМЗ.Материалы КАК АктОбУтилизацииМЗМатериалы
	|ГДЕ
	|	АктОбУтилизацииМЗМатериалы.Ссылка В(&Ссылка)
	|	И НЕ АктОбУтилизацииМЗМатериалы.Ссылка.ГолосованиеЗаПолученныеМатериалы
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктОбУтилизацииМЗПолученныеМатериалы.НомерСтроки,
	|	АктОбУтилизацииМЗПолученныеМатериалы.Ссылка КАК Ссылка,
	|	АктОбУтилизацииМЗПолученныеМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	АктОбУтилизацииМЗПолученныеМатериалы.Номенклатура КАК Объект,
	|	АктОбУтилизацииМЗПолученныеМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АктОбУтилизацииМЗПолученныеМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(АктОбУтилизацииМЗПолученныеМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ АктОбУтилизацииМЗПолученныеМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	АктОбУтилизацииМЗПолученныеМатериалы.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.АктОбУтилизацииМЗ.ПолученныеМатериалы КАК АктОбУтилизацииМЗПолученныеМатериалы
	|ГДЕ
	|	АктОбУтилизацииМЗПолученныеМатериалы.Ссылка В(&Ссылка)
	|	И АктОбУтилизацииМЗПолученныеМатериалы.Ссылка.ГолосованиеЗаПолученныеМатериалы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	АктОбУтилизацииМЗСоставКомиссии.Ссылка КАК Ссылка,
	|	АктОбУтилизацииМЗСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	АктОбУтилизацииМЗСоставКомиссии.Сотрудник КАК Сотрудник,
	|	АктОбУтилизацииМЗСоставКомиссии.Отсутствует КАК Отсутствует,
	|	АктОбУтилизацииМЗСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.АктОбУтилизацииМЗ.СоставКомиссии КАК АктОбУтилизацииМЗСоставКомиссии
	|ГДЕ
	|	АктОбУтилизацииМЗСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_АктОбУтилизацииМЗИК()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	АктОбУтилизацииМЗИК.Ссылка КАК Ссылка,
	|	АктОбУтилизацииМЗИК.Организация КАК Организация,
	|	АктОбУтилизацииМЗИК.Дата КАК ДатаДокумента,
	|	АктОбУтилизацииМЗИК.Номер КАК НомерДокумента,
	|	АктОбУтилизацииМЗИК.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	АктОбУтилизацииМЗИК.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.АктОбУтилизацииМЗИК КАК АктОбУтилизацииМЗИК
	|ГДЕ
	|	АктОбУтилизацииМЗИК.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	АктОбУтилизацииМЗИКМатериалы.НомерСтроки,
	|	АктОбУтилизацииМЗИКМатериалы.Ссылка КАК Ссылка,
	|	АктОбУтилизацииМЗИКМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	АктОбУтилизацииМЗИКМатериалы.Номенклатура КАК Объект,
	|	АктОбУтилизацииМЗИКМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АктОбУтилизацииМЗИКМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(АктОбУтилизацииМЗИКМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ АктОбУтилизацииМЗИКМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	АктОбУтилизацииМЗИКМатериалы.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.АктОбУтилизацииМЗИК.Материалы КАК АктОбУтилизацииМЗИКМатериалы
	|ГДЕ
	|	АктОбУтилизацииМЗИКМатериалы.Ссылка В(&Ссылка)
	|	И НЕ АктОбУтилизацииМЗИКМатериалы.Ссылка.ГолосованиеЗаПолученныеМатериалы
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктОбУтилизацииМЗИКПолученныеМатериалы.НомерСтроки,
	|	АктОбУтилизацииМЗИКПолученныеМатериалы.Ссылка КАК Ссылка,
	|	АктОбУтилизацииМЗИКПолученныеМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	АктОбУтилизацииМЗИКПолученныеМатериалы.Номенклатура КАК Объект,
	|	АктОбУтилизацииМЗИКПолученныеМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АктОбУтилизацииМЗИКПолученныеМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(АктОбУтилизацииМЗИКПолученныеМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ АктОбУтилизацииМЗИКПолученныеМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	АктОбУтилизацииМЗИКПолученныеМатериалы.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.АктОбУтилизацииМЗИК.ПолученныеМатериалы КАК АктОбУтилизацииМЗИКПолученныеМатериалы
	|ГДЕ
	|	АктОбУтилизацииМЗИКПолученныеМатериалы.Ссылка В(&Ссылка)
	|	И АктОбУтилизацииМЗИКПолученныеМатериалы.Ссылка.ГолосованиеЗаПолученныеМатериалы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	АктОбУтилизацииМЗИКСоставКомиссии.Ссылка КАК Ссылка,
	|	АктОбУтилизацииМЗИКСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	АктОбУтилизацииМЗИКСоставКомиссии.Сотрудник КАК Сотрудник,
	|	АктОбУтилизацииМЗИКСоставКомиссии.Отсутствует КАК Отсутствует,
	|	АктОбУтилизацииМЗИКСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.АктОбУтилизацииМЗИК.СоставКомиссии КАК АктОбУтилизацииМЗИКСоставКомиссии
	|ГДЕ
	|	АктОбУтилизацииМЗИКСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_АктОбУтилизацииОС()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	АктОбУтилизацииОС.Ссылка КАК Ссылка,
	|	АктОбУтилизацииОС.Организация КАК Организация,
	|	АктОбУтилизацииОС.Дата КАК ДатаДокумента,
	|	АктОбУтилизацииОС.Номер КАК НомерДокумента,
	|	АктОбУтилизацииОС.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	АктОбУтилизацииОС.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.АктОбУтилизацииОС КАК АктОбУтилизацииОС
	|ГДЕ
	|	АктОбУтилизацииОС.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	АктОбУтилизацииОСОсновныеСредства.НомерСтроки,
	|	АктОбУтилизацииОСОсновныеСредства.Ссылка КАК Ссылка,
	|	АктОбУтилизацииОСОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	АктОбУтилизацииОСОсновныеСредства.ОсновноеСредство КАК Объект,
	|	АктОбУтилизацииОСОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	АктОбУтилизацииОСОсновныеСредства.ИнвентарныйНомер КАК Идентификатор,
	|	АктОбУтилизацииОСОсновныеСредства.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.АктОбУтилизацииОС.ОсновныеСредства КАК АктОбУтилизацииОСОсновныеСредства
	|ГДЕ
	|	АктОбУтилизацииОСОсновныеСредства.Ссылка В(&Ссылка)
	|	И НЕ АктОбУтилизацииОСОсновныеСредства.Ссылка.ГолосованиеЗаПолученныеМатериалы
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктОбУтилизацииОСПолученныеМатериалы.НомерСтроки,
	|	АктОбУтилизацииОСПолученныеМатериалы.Ссылка КАК Ссылка,
	|	АктОбУтилизацииОСПолученныеМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	АктОбУтилизацииОСПолученныеМатериалы.Номенклатура КАК Объект,
	|	АктОбУтилизацииОСПолученныеМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АктОбУтилизацииОСПолученныеМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(АктОбУтилизацииОСПолученныеМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ АктОбУтилизацииОСПолученныеМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	АктОбУтилизацииОСПолученныеМатериалы.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.АктОбУтилизацииОС.ПолученныеМатериалы КАК АктОбУтилизацииОСПолученныеМатериалы
	|ГДЕ
	|	АктОбУтилизацииОСПолученныеМатериалы.Ссылка В(&Ссылка)
	|	И АктОбУтилизацииОСПолученныеМатериалы.Ссылка.ГолосованиеЗаПолученныеМатериалы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	АктОбУтилизацииОССоставКомиссии.Ссылка КАК Ссылка,
	|	АктОбУтилизацииОССоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	АктОбУтилизацииОССоставКомиссии.Сотрудник КАК Сотрудник,
	|	АктОбУтилизацииОССоставКомиссии.Отсутствует КАК Отсутствует,
	|	АктОбУтилизацииОССоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.АктОбУтилизацииОС.СоставКомиссии КАК АктОбУтилизацииОССоставКомиссии
	|ГДЕ
	|	АктОбУтилизацииОССоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_АктОбУтилизацииОСИК()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Дата КАК ДатаДокумента,
	|	Шапка.Номер КАК НомерДокумента,
	|	Шапка.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	Шапка.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.АктОбУтилизацииОСИК КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	ОсновныеСредства.НомерСтроки,
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК Объект,
	|	ОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	ОсновныеСредства.ИнвентарныйНомер КАК Идентификатор,
	|	ОсновныеСредства.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.АктОбУтилизацииОСИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&Ссылка)
	|	И Не ОсновныеСредства.Ссылка.ГолосованиеЗаПолученныеМатериалы
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктОбУтилизацииОСИКПолученныеМатериалы.НомерСтроки,
	|	АктОбУтилизацииОСИКПолученныеМатериалы.Ссылка КАК Ссылка,
	|	АктОбУтилизацииОСИКПолученныеМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	АктОбУтилизацииОСИКПолученныеМатериалы.Номенклатура КАК Объект,
	|	АктОбУтилизацииОСИКПолученныеМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АктОбУтилизацииОСИКПолученныеМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(АктОбУтилизацииОСИКПолученныеМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ АктОбУтилизацииОСИКПолученныеМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	АктОбУтилизацииОСИКПолученныеМатериалы.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.АктОбУтилизацииОСИК.ПолученныеМатериалы КАК АктОбУтилизацииОСИКПолученныеМатериалы
	|ГДЕ
	|	АктОбУтилизацииОСИКПолученныеМатериалы.Ссылка В(&Ссылка)
	|	И АктОбУтилизацииОСИКПолученныеМатериалы.Ссылка.ГолосованиеЗаПолученныеМатериалы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	СоставКомиссии.Ссылка КАК Ссылка,
	|	СоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СоставКомиссии.Сотрудник КАК Сотрудник,
	|	СоставКомиссии.Отсутствует КАК Отсутствует,
	|	СоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.АктОбУтилизацииОСИК.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_АктОРезультатахИнвентаризацииНаличныхДС()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	АктОРезультатахИнвентаризацииНаличныхДС.Ссылка КАК Ссылка,
	|	АктОРезультатахИнвентаризацииНаличныхДС.Организация КАК Организация,
	|	АктОРезультатахИнвентаризацииНаличныхДС.Дата КАК ДатаДокумента,
	|	АктОРезультатахИнвентаризацииНаличныхДС.Номер КАК НомерДокумента,
	|	АктОРезультатахИнвентаризацииНаличныхДС.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	АктОРезультатахИнвентаризацииНаличныхДС.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.АктОРезультатахИнвентаризацииНаличныхДС КАК АктОРезультатахИнвентаризацииНаличныхДС
	|ГДЕ
	|	АктОРезультатахИнвентаризацииНаличныхДС.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	АктОРезультатахИнвентаризацииНаличныхДСНаличныеСредства.Ссылка КАК Ссылка,
	|	АктОРезультатахИнвентаризацииНаличныхДСНаличныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	АктОРезультатахИнвентаризацииНаличныхДСНаличныеСредства.Валюта КАК Объект,
	|	АктОРезультатахИнвентаризацииНаличныхДСНаличныеСредства.Валюта.НаименованиеПолное КАК Наименование,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК Идентификатор,
	|	АктОРезультатахИнвентаризацииНаличныхДСНаличныеСредства.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.АктОРезультатахИнвентаризацииНаличныхДС.НаличныеСредства КАК АктОРезультатахИнвентаризацииНаличныхДСНаличныеСредства
	|ГДЕ
	|	АктОРезультатахИнвентаризацииНаличныхДСНаличныеСредства.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	АктОРезультатахИнвентаризацииНаличныхДСНаличныеСредства.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	АктОРезультатахИнвентаризацииНаличныхДССоставКомиссии.Ссылка КАК Ссылка,
	|	АктОРезультатахИнвентаризацииНаличныхДССоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	АктОРезультатахИнвентаризацииНаличныхДССоставКомиссии.Сотрудник КАК Сотрудник,
	|	АктОРезультатахИнвентаризацииНаличныхДССоставКомиссии.Отсутствует КАК Отсутствует,
	|	АктОРезультатахИнвентаризацииНаличныхДССоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.АктОРезультатахИнвентаризацииНаличныхДС.СоставКомиссии КАК АктОРезультатахИнвентаризацииНаличныхДССоставКомиссии
	|ГДЕ
	|	АктОРезультатахИнвентаризацииНаличныхДССоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_АктСписанияИК()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	АктСписанияИК.Ссылка КАК Ссылка,
	|	АктСписанияИК.Организация КАК Организация,
	|	АктСписанияИК.Дата КАК ДатаДокумента,
	|	АктСписанияИК.Номер КАК НомерДокумента,
	|	АктСписанияИК.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	АктСписанияИК.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.АктСписанияИК КАК АктСписанияИК
	|ГДЕ
	|	АктСписанияИК.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	АктСписанияИКМатериалы.Ссылка КАК Ссылка,
	|	АктСписанияИКМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	АктСписанияИКМатериалы.Номенклатура КАК Объект,
	|	АктСписанияИКМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АктСписанияИКМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(АктСписанияИКМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ АктСписанияИКМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	АктСписанияИКМатериалы.ПричинаСписанияСсылка.Наименование КАК Резолюция
	|ИЗ
	|	Документ.АктСписанияИК.Материалы КАК АктСписанияИКМатериалы
	|ГДЕ
	|	АктСписанияИКМатериалы.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	АктСписанияИКМатериалы.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	АктСписанияИКСоставКомиссии.Ссылка КАК Ссылка,
	|	АктСписанияИКСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	АктСписанияИКСоставКомиссии.Сотрудник КАК Сотрудник,
	|	АктСписанияИКСоставКомиссии.Отсутствует КАК Отсутствует,
	|	АктСписанияИКСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.АктСписанияИК.СоставКомиссии КАК АктСписанияИКСоставКомиссии
	|ГДЕ
	|	АктСписанияИКСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_АктСписанияМЗ()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	АктСписанияМЗ.Ссылка КАК Ссылка,
	|	АктСписанияМЗ.Организация КАК Организация,
	|	АктСписанияМЗ.Дата КАК ДатаДокумента,
	|	АктСписанияМЗ.Номер КАК НомерДокумента,
	|	АктСписанияМЗ.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	АктСписанияМЗ.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.АктСписанияМЗ КАК АктСписанияМЗ
	|ГДЕ
	|	АктСписанияМЗ.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	АктСписанияМЗМатериалы.Ссылка КАК Ссылка,
	|	АктСписанияМЗМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	АктСписанияМЗМатериалы.Номенклатура КАК Объект,
	|	АктСписанияМЗМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АктСписанияМЗМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(АктСписанияМЗМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ АктСписанияМЗМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	АктСписанияМЗМатериалы.ПричинаСписанияСсылка.Наименование КАК Резолюция
	|ИЗ
	|	Документ.АктСписанияМЗ.Материалы КАК АктСписанияМЗМатериалы
	|ГДЕ
	|	АктСписанияМЗМатериалы.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	АктСписанияМЗМатериалы.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	АктСписанияМЗСоставКомиссии.Ссылка КАК Ссылка,
	|	АктСписанияМЗСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	АктСписанияМЗСоставКомиссии.Сотрудник КАК Сотрудник,
	|	АктСписанияМЗСоставКомиссии.Отсутствует КАК Отсутствует,
	|	АктСписанияМЗСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.АктСписанияМЗ.СоставКомиссии КАК АктСписанияМЗСоставКомиссии
	|ГДЕ
	|	АктСписанияМЗСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_РешениеОбОценкеИмущества()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	РешениеОбОценкеИмущества.Ссылка КАК Ссылка,
	|	РешениеОбОценкеИмущества.Организация КАК Организация,
	|	РешениеОбОценкеИмущества.Дата КАК ДатаДокумента,
	|	РешениеОбОценкеИмущества.Номер КАК НомерДокумента,
	|	РешениеОбОценкеИмущества.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	РешениеОбОценкеИмущества.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.РешениеОбОценкеИмущества КАК РешениеОбОценкеИмущества
	|ГДЕ
	|	РешениеОбОценкеИмущества.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	РешениеОбОценкеИмуществаОсновныеСредства.Ссылка КАК Ссылка,
	|	РешениеОбОценкеИмуществаОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РешениеОбОценкеИмуществаОсновныеСредства.ОсновноеСредство КАК Объект,
	|	РешениеОбОценкеИмуществаОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	РешениеОбОценкеИмуществаОсновныеСредства.ИнвентарныйНомер КАК Идентификатор,
	|	РешениеОбОценкеИмуществаОсновныеСредства.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.РешениеОбОценкеИмущества.ОсновныеСредства КАК РешениеОбОценкеИмуществаОсновныеСредства
	|ГДЕ
	|	РешениеОбОценкеИмуществаОсновныеСредства.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РешениеОбОценкеИмуществаОсновныеСредства.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	РешениеОбОценкеИмуществаСоставКомиссии.Ссылка КАК Ссылка,
	|	РешениеОбОценкеИмуществаСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РешениеОбОценкеИмуществаСоставКомиссии.Сотрудник КАК Сотрудник,
	|	РешениеОбОценкеИмуществаСоставКомиссии.Отсутствует КАК Отсутствует,
	|	РешениеОбОценкеИмуществаСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.РешениеОбОценкеИмущества.СоставКомиссии КАК РешениеОбОценкеИмуществаСоставКомиссии
	|ГДЕ
	|	РешениеОбОценкеИмуществаСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_РешениеОбОценкеИмуществаКазны()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	РешениеОбОценкеИмущества.Ссылка КАК Ссылка,
	|	РешениеОбОценкеИмущества.Организация КАК Организация,
	|	РешениеОбОценкеИмущества.Дата КАК ДатаДокумента,
	|	РешениеОбОценкеИмущества.Номер КАК НомерДокумента,
	|	РешениеОбОценкеИмущества.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	РешениеОбОценкеИмущества.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.РешениеОбОценкеИмуществаКазны КАК РешениеОбОценкеИмущества
	|ГДЕ
	|	РешениеОбОценкеИмущества.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	РешениеОбОценкеИмуществаОсновныеСредства.Ссылка КАК Ссылка,
	|	РешениеОбОценкеИмуществаОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РешениеОбОценкеИмуществаОсновныеСредства.ОсновноеСредство КАК Объект,
	|	РешениеОбОценкеИмуществаОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	РешениеОбОценкеИмуществаОсновныеСредства.ИнвентарныйНомер КАК Идентификатор,
	|	РешениеОбОценкеИмуществаОсновныеСредства.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.РешениеОбОценкеИмуществаКазны.ОсновныеСредства КАК РешениеОбОценкеИмуществаОсновныеСредства
	|ГДЕ
	|	РешениеОбОценкеИмуществаОсновныеСредства.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РешениеОбОценкеИмуществаОсновныеСредства.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	РешениеОбОценкеИмуществаСоставКомиссии.Ссылка КАК Ссылка,
	|	РешениеОбОценкеИмуществаСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РешениеОбОценкеИмуществаСоставКомиссии.Сотрудник КАК Сотрудник,
	|	РешениеОбОценкеИмуществаСоставКомиссии.Отсутствует КАК Отсутствует,
	|	РешениеОбОценкеИмуществаСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.РешениеОбОценкеИмуществаКазны.СоставКомиссии КАК РешениеОбОценкеИмуществаСоставКомиссии
	|ГДЕ
	|	РешениеОбОценкеИмуществаСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_РешениеОбОценкеИмуществаМЗ()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	РешениеОбОценкеИмуществаМЗ.Ссылка КАК Ссылка,
	|	РешениеОбОценкеИмуществаМЗ.Организация КАК Организация,
	|	РешениеОбОценкеИмуществаМЗ.Дата КАК ДатаДокумента,
	|	РешениеОбОценкеИмуществаМЗ.Номер КАК НомерДокумента,
	|	РешениеОбОценкеИмуществаМЗ.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	РешениеОбОценкеИмуществаМЗ.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.РешениеОбОценкеИмуществаМЗ КАК РешениеОбОценкеИмуществаМЗ
	|ГДЕ
	|	РешениеОбОценкеИмуществаМЗ.Ссылка В (&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	РешениеОбОценкеИмуществаМатериалы.Ссылка КАК Ссылка,
	|	РешениеОбОценкеИмуществаМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РешениеОбОценкеИмуществаМатериалы.Номенклатура КАК Объект,
	|	РешениеОбОценкеИмуществаМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РешениеОбОценкеИмуществаМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(РешениеОбОценкеИмуществаМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ РешениеОбОценкеИмуществаМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	РешениеОбОценкеИмуществаМатериалы.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.РешениеОбОценкеИмуществаМЗ.Материалы КАК РешениеОбОценкеИмуществаМатериалы
	|ГДЕ
	|	РешениеОбОценкеИмуществаМатериалы.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РешениеОбОценкеИмуществаМатериалы.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	РешениеОбОценкеИмуществаМЗСоставКомиссии.Ссылка КАК Ссылка,
	|	РешениеОбОценкеИмуществаМЗСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РешениеОбОценкеИмуществаМЗСоставКомиссии.Сотрудник КАК Сотрудник,
	|	РешениеОбОценкеИмуществаМЗСоставКомиссии.Отсутствует КАК Отсутствует,
	|	РешениеОбОценкеИмуществаМЗСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.РешениеОбОценкеИмуществаМЗ.СоставКомиссии КАК РешениеОбОценкеИмуществаМЗСоставКомиссии
	|ГДЕ
	|	РешениеОбОценкеИмуществаМЗСоставКомиссии.Ссылка В (&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_РешениеОПрекращенииПризнанияАктивом()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	РешениеОПрекращенииПризнанияАктивом.Ссылка КАК Ссылка,
	|	РешениеОПрекращенииПризнанияАктивом.Организация КАК Организация,
	|	РешениеОПрекращенииПризнанияАктивом.Дата КАК ДатаДокумента,
	|	РешениеОПрекращенииПризнанияАктивом.Номер КАК НомерДокумента,
	|	РешениеОПрекращенииПризнанияАктивом.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	РешениеОПрекращенииПризнанияАктивом.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивом КАК РешениеОПрекращенииПризнанияАктивом
	|ГДЕ
	|	РешениеОПрекращенииПризнанияАктивом.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	РешениеОПрекращенииПризнанияАктивомОсновныеСредства.Ссылка КАК Ссылка,
	|	РешениеОПрекращенииПризнанияАктивомОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РешениеОПрекращенииПризнанияАктивомОсновныеСредства.ОсновноеСредство КАК Объект,
	|	РешениеОПрекращенииПризнанияАктивомОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	РешениеОПрекращенииПризнанияАктивомОсновныеСредства.ИнвентарныйНомер КАК Идентификатор,
	|	РешениеОПрекращенииПризнанияАктивомОсновныеСредства.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивом.ОсновныеСредства КАК РешениеОПрекращенииПризнанияАктивомОсновныеСредства
	|ГДЕ
	|	РешениеОПрекращенииПризнанияАктивомОсновныеСредства.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РешениеОПрекращенииПризнанияАктивомОсновныеСредства.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Ссылка КАК Ссылка,
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Сотрудник КАК Сотрудник,
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Отсутствует КАК Отсутствует,
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивом.СоставКомиссии КАК РешениеОПрекращенииПризнанияАктивомСоставКомиссии
	|ГДЕ
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_РешениеОПрекращенииПризнанияАктивомИК()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	РешениеОПрекращенииПризнанияАктивомИК.Ссылка КАК Ссылка,
	|	РешениеОПрекращенииПризнанияАктивомИК.Организация КАК Организация,
	|	РешениеОПрекращенииПризнанияАктивомИК.Дата КАК ДатаДокумента,
	|	РешениеОПрекращенииПризнанияАктивомИК.Номер КАК НомерДокумента,
	|	РешениеОПрекращенииПризнанияАктивомИК.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	РешениеОПрекращенииПризнанияАктивомИК.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомИК КАК РешениеОПрекращенииПризнанияАктивомИК
	|ГДЕ
	|	РешениеОПрекращенииПризнанияАктивомИК.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	РешениеОПрекращенииПризнанияАктивомИКОсновныеСредства.Ссылка КАК Ссылка,
	|	РешениеОПрекращенииПризнанияАктивомИКОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РешениеОПрекращенииПризнанияАктивомИКОсновныеСредства.ОсновноеСредство КАК Объект,
	|	РешениеОПрекращенииПризнанияАктивомИКОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	РешениеОПрекращенииПризнанияАктивомИКОсновныеСредства.ИнвентарныйНомер КАК Идентификатор,
	|	РешениеОПрекращенииПризнанияАктивомИКОсновныеСредства.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомИК.ОсновныеСредства КАК РешениеОПрекращенииПризнанияАктивомИКОсновныеСредства
	|ГДЕ
	|	РешениеОПрекращенииПризнанияАктивомИКОсновныеСредства.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РешениеОПрекращенииПризнанияАктивомИКОсновныеСредства.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	РешениеОПрекращенииПризнанияАктивомИКСоставКомиссии.Ссылка КАК Ссылка,
	|	РешениеОПрекращенииПризнанияАктивомИКСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РешениеОПрекращенииПризнанияАктивомИКСоставКомиссии.Сотрудник КАК Сотрудник,
	|	РешениеОПрекращенииПризнанияАктивомИКСоставКомиссии.Отсутствует КАК Отсутствует,
	|	РешениеОПрекращенииПризнанияАктивомИКСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомИК.СоставКомиссии КАК РешениеОПрекращенииПризнанияАктивомИКСоставКомиссии
	|ГДЕ
	|	РешениеОПрекращенииПризнанияАктивомИКСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_РешениеОПрекращенииПризнанияАктивомМЗ()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	РешениеОПрекращенииПризнанияАктивомМЗ.Ссылка КАК Ссылка,
	|	РешениеОПрекращенииПризнанияАктивомМЗ.Организация КАК Организация,
	|	РешениеОПрекращенииПризнанияАктивомМЗ.Дата КАК ДатаДокумента,
	|	РешениеОПрекращенииПризнанияАктивомМЗ.Номер КАК НомерДокумента,
	|	РешениеОПрекращенииПризнанияАктивомМЗ.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	РешениеОПрекращенииПризнанияАктивомМЗ.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомМЗ КАК РешениеОПрекращенииПризнанияАктивомМЗ
	|ГДЕ
	|	РешениеОПрекращенииПризнанияАктивомМЗ.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.Ссылка КАК Ссылка,
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.Номенклатура КАК Объект,
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РешениеОПрекращенииПризнанияАктивомМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(РешениеОПрекращенииПризнанияАктивомМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ РешениеОПрекращенииПризнанияАктивомМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомМЗ.Материалы КАК РешениеОПрекращенииПризнанияАктивомМатериалы
	|ГДЕ
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Ссылка КАК Ссылка,
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Сотрудник КАК Сотрудник,
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Отсутствует КАК Отсутствует,
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомМЗ.СоставКомиссии КАК РешениеОПрекращенииПризнанияАктивомСоставКомиссии
	|ГДЕ
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_РешениеОПрекращенииПризнанияАктивомМЗИК()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	РешениеОПрекращенииПризнанияАктивомМЗИК.Ссылка КАК Ссылка,
	|	РешениеОПрекращенииПризнанияАктивомМЗИК.Организация КАК Организация,
	|	РешениеОПрекращенииПризнанияАктивомМЗИК.Дата КАК ДатаДокумента,
	|	РешениеОПрекращенииПризнанияАктивомМЗИК.Номер КАК НомерДокумента,
	|	РешениеОПрекращенииПризнанияАктивомМЗИК.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	РешениеОПрекращенииПризнанияАктивомМЗИК.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомМЗИК КАК РешениеОПрекращенииПризнанияАктивомМЗИК
	|ГДЕ
	|	РешениеОПрекращенииПризнанияАктивомМЗИК.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.Ссылка КАК Ссылка,
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.Номенклатура КАК Объект,
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РешениеОПрекращенииПризнанияАктивомМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(РешениеОПрекращенииПризнанияАктивомМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ РешениеОПрекращенииПризнанияАктивомМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомМЗИК.Материалы КАК РешениеОПрекращенииПризнанияАктивомМатериалы
	|ГДЕ
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РешениеОПрекращенииПризнанияАктивомМатериалы.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Ссылка КАК Ссылка,
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Сотрудник КАК Сотрудник,
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Отсутствует КАК Отсутствует,
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомМЗИК.СоставКомиссии КАК РешениеОПрекращенииПризнанияАктивомСоставКомиссии
	|ГДЕ
	|	РешениеОПрекращенииПризнанияАктивомСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_РешениеОПризнанииОбъектовМЗ()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	РешениеОПризнанииОбъектовМЗ.Ссылка КАК Ссылка,
	|	РешениеОПризнанииОбъектовМЗ.Организация КАК Организация,
	|	РешениеОПризнанииОбъектовМЗ.Дата КАК ДатаДокумента,
	|	РешениеОПризнанииОбъектовМЗ.Номер КАК НомерДокумента,
	|	РешениеОПризнанииОбъектовМЗ.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	РешениеОПризнанииОбъектовМЗ.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовМЗ КАК РешениеОПризнанииОбъектовМЗ
	|ГДЕ
	|	РешениеОПризнанииОбъектовМЗ.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	РешениеОПризнанииОбъектовМатериалы.Ссылка КАК Ссылка,
	|	РешениеОПризнанииОбъектовМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РешениеОПризнанииОбъектовМатериалы.Номенклатура КАК Объект,
	|	РешениеОПризнанииОбъектовМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РешениеОПризнанииОбъектовМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(РешениеОПризнанииОбъектовМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ РешениеОПризнанииОбъектовМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	ВЫБОР
	|		КОГДА ДЛИНАСТРОКИ(РешениеОПризнанииОбъектовМатериалы.РезолюцияКомиссии) = 0
	|			ТОГДА &РезолюцияКомиссииРешениеОПризнанииОбъектовМЗ
	|		ИНАЧЕ РешениеОПризнанииОбъектовМатериалы.РезолюцияКомиссии
	|	КОНЕЦ КАК Резолюция
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовМЗ.Материалы КАК РешениеОПризнанииОбъектовМатериалы
	|ГДЕ
	|	РешениеОПризнанииОбъектовМатериалы.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РешениеОПризнанииОбъектовМатериалы.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	РешениеОПризнанииОбъектовМЗСоставКомиссии.Ссылка КАК Ссылка,
	|	РешениеОПризнанииОбъектовМЗСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РешениеОПризнанииОбъектовМЗСоставКомиссии.Сотрудник КАК Сотрудник,
	|	РешениеОПризнанииОбъектовМЗСоставКомиссии.Отсутствует КАК Отсутствует,
	|	РешениеОПризнанииОбъектовМЗСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовМЗ.СоставКомиссии КАК РешениеОПризнанииОбъектовМЗСоставКомиссии
	|ГДЕ
	|	РешениеОПризнанииОбъектовМЗСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_РешениеОПризнанииОбъектовМЗИК()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	РешениеОПризнанииОбъектовМЗИК.Ссылка КАК Ссылка,
	|	РешениеОПризнанииОбъектовМЗИК.Организация КАК Организация,
	|	РешениеОПризнанииОбъектовМЗИК.Дата КАК ДатаДокумента,
	|	РешениеОПризнанииОбъектовМЗИК.Номер КАК НомерДокумента,
	|	РешениеОПризнанииОбъектовМЗИК.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	РешениеОПризнанииОбъектовМЗИК.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовМЗИК КАК РешениеОПризнанииОбъектовМЗИК
	|ГДЕ
	|	РешениеОПризнанииОбъектовМЗИК.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	РешениеОПризнанииОбъектовМатериалы.Ссылка КАК Ссылка,
	|	РешениеОПризнанииОбъектовМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РешениеОПризнанииОбъектовМатериалы.Номенклатура КАК Объект,
	|	РешениеОПризнанииОбъектовМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РешениеОПризнанииОбъектовМатериалы.Номенклатура.НоменклатурныйНомер, """") = """"
	|			ТОГДА ЕСТЬNULL(РешениеОПризнанииОбъектовМатериалы.Номенклатура.Код, """")
	|		ИНАЧЕ РешениеОПризнанииОбъектовМатериалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК Идентификатор,
	|	ВЫБОР
	|		КОГДА ДЛИНАСТРОКИ(РешениеОПризнанииОбъектовМатериалы.РезолюцияКомиссии) = 0
	|			ТОГДА &РезолюцияКомиссииРешениеОПризнанииОбъектовМЗ
	|		ИНАЧЕ РешениеОПризнанииОбъектовМатериалы.РезолюцияКомиссии
	|	КОНЕЦ КАК Резолюция
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовМЗИК.Материалы КАК РешениеОПризнанииОбъектовМатериалы
	|ГДЕ
	|	РешениеОПризнанииОбъектовМатериалы.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РешениеОПризнанииОбъектовМатериалы.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	РешениеОПризнанииОбъектовМЗИКСоставКомиссии.Ссылка КАК Ссылка,
	|	РешениеОПризнанииОбъектовМЗИКСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РешениеОПризнанииОбъектовМЗИКСоставКомиссии.Сотрудник КАК Сотрудник,
	|	РешениеОПризнанииОбъектовМЗИКСоставКомиссии.Отсутствует КАК Отсутствует,
	|	РешениеОПризнанииОбъектовМЗИКСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовМЗИК.СоставКомиссии КАК РешениеОПризнанииОбъектовМЗИКСоставКомиссии
	|ГДЕ
	|	РешениеОПризнанииОбъектовМЗИКСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_РешениеОПризнанииОбъектовОС()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	РешениеОПризнанииОбъектовОС.Ссылка КАК Ссылка,
	|	РешениеОПризнанииОбъектовОС.Организация КАК Организация,
	|	РешениеОПризнанииОбъектовОС.Дата КАК ДатаДокумента,
	|	РешениеОПризнанииОбъектовОС.Номер КАК НомерДокумента,
	|	РешениеОПризнанииОбъектовОС.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	РешениеОПризнанииОбъектовОС.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОС КАК РешениеОПризнанииОбъектовОС
	|ГДЕ
	|	РешениеОПризнанииОбъектовОС.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.Ссылка КАК Ссылка,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ОсновноеСредство КАК Объект,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ИнвентарныйНомер КАК Идентификатор,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОС.ОсновныеСредства КАК РешениеОПризнанииОбъектовОСОсновныеСредства
	|ГДЕ
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	РешениеОПризнанииОбъектовОССоставКомиссии.Ссылка КАК Ссылка,
	|	РешениеОПризнанииОбъектовОССоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РешениеОПризнанииОбъектовОССоставКомиссии.Сотрудник КАК Сотрудник,
	|	РешениеОПризнанииОбъектовОССоставКомиссии.Отсутствует КАК Отсутствует,
	|	РешениеОПризнанииОбъектовОССоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОС.СоставКомиссии КАК РешениеОПризнанииОбъектовОССоставКомиссии
	|ГДЕ
	|	РешениеОПризнанииОбъектовОССоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_РешениеОПризнанииОбъектовОСИК()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	РешениеОПризнанииОбъектовОС.Ссылка КАК Ссылка,
	|	РешениеОПризнанииОбъектовОС.Организация КАК Организация,
	|	РешениеОПризнанииОбъектовОС.Дата КАК ДатаДокумента,
	|	РешениеОПризнанииОбъектовОС.Номер КАК НомерДокумента,
	|	РешениеОПризнанииОбъектовОС.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	РешениеОПризнанииОбъектовОС.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОСИК КАК РешениеОПризнанииОбъектовОС
	|ГДЕ
	|	РешениеОПризнанииОбъектовОС.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.Ссылка КАК Ссылка,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ОсновноеСредство КАК Объект,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ИнвентарныйНомер КАК Идентификатор,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОСИК.ОсновныеСредства КАК РешениеОПризнанииОбъектовОСОсновныеСредства
	|ГДЕ
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	РешениеОПризнанииОбъектовОССоставКомиссии.Ссылка КАК Ссылка,
	|	РешениеОПризнанииОбъектовОССоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РешениеОПризнанииОбъектовОССоставКомиссии.Сотрудник КАК Сотрудник,
	|	РешениеОПризнанииОбъектовОССоставКомиссии.Отсутствует КАК Отсутствует,
	|	РешениеОПризнанииОбъектовОССоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОСИК.СоставКомиссии КАК РешениеОПризнанииОбъектовОССоставКомиссии
	|ГДЕ
	|	РешениеОПризнанииОбъектовОССоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_СписаниеБСО()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	СписаниеБСО.Ссылка КАК Ссылка,
	|	СписаниеБСО.Организация КАК Организация,
	|	СписаниеБСО.Дата КАК ДатаДокумента,
	|	СписаниеБСО.Номер КАК НомерДокумента,
	|	СписаниеБСО.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	СписаниеБСО.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.СписаниеБСО КАК СписаниеБСО
	|ГДЕ
	|	СписаниеБСО.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	СписаниеБСОСоставБСО.Ссылка КАК Ссылка,
	|	СписаниеБСОСоставБСО.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СписаниеБСОСоставБСО.БСО КАК Объект,
	|	СписаниеБСОСоставБСО.БСО.Наименование + ВЫБОР
	|		КОГДА СписаниеБСОСоставБСО.СерияБСО = ЗНАЧЕНИЕ(Справочник.СерииБСО.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ "" "" + СписаниеБСОСоставБСО.СерияБСО.Наименование
	|	КОНЕЦ + "" "" + СписаниеБСОСоставБСО.НомерНачальный + ""//"" + ВЫБОР
	|		КОГДА СписаниеБСОСоставБСО.Количество = 1
	|			ТОГДА ""-""
	|		ИНАЧЕ СписаниеБСОСоставБСО.НомерКонечный
	|	КОНЕЦ КАК Наименование,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК Идентификатор,
	|	СписаниеБСОСоставБСО.ПричинаСписанияСсылка.Наименование КАК Резолюция
	|ИЗ
	|	Документ.СписаниеБСО.СоставБСО КАК СписаниеБСОСоставБСО
	|ГДЕ
	|	СписаниеБСОСоставБСО.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеБСОСоставБСО.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	СписаниеБСОСоставКомиссии.Ссылка КАК Ссылка,
	|	СписаниеБСОСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СписаниеБСОСоставКомиссии.Сотрудник КАК Сотрудник,
	|	СписаниеБСОСоставКомиссии.Отсутствует КАК Отсутствует,
	|	СписаниеБСОСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.СписаниеБСО.СоставКомиссии КАК СписаниеБСОСоставКомиссии
	|ГДЕ
	|	СписаниеБСОСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_СписаниеВосстановлениеЗадолженностиПоДоходам()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Ссылка КАК Ссылка,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Организация КАК Организация,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Дата КАК ДатаДокумента,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Номер КАК НомерДокумента,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.СписаниеВосстановлениеЗадолженностиПоДоходам КАК СписаниеВосстановлениеЗадолженностиПоДоходам
	|ГДЕ
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	СписаниеВосстановлениеЗадолженностиПоДоходамЗадолженность.Ссылка КАК Ссылка,
	|	СписаниеВосстановлениеЗадолженностиПоДоходамЗадолженность.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	NULL КАК Объект,
	|	СписаниеВосстановлениеЗадолженностиПоДоходамЗадолженность.Контрагент.Наименование + "" ("" + СписаниеВосстановлениеЗадолженностиПоДоходамЗадолженность.Счет.Код + "")"" КАК Наименование,
	|	СписокКонтрагентов.ИдентификаторПлательщика КАК Идентификатор,
	|	СписаниеВосстановлениеЗадолженностиПоДоходамЗадолженность.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.СписаниеВосстановлениеЗадолженностиПоДоходам.Задолженность КАК СписаниеВосстановлениеЗадолженностиПоДоходамЗадолженность
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеВосстановлениеЗадолженностиПоДоходам.СписокКонтрагентов КАК СписокКонтрагентов
	|		ПО СписаниеВосстановлениеЗадолженностиПоДоходамЗадолженность.Ссылка = СписокКонтрагентов.Ссылка
	|			И СписаниеВосстановлениеЗадолженностиПоДоходамЗадолженность.Контрагент = СписокКонтрагентов.Контрагент
	|ГДЕ
	|	СписаниеВосстановлениеЗадолженностиПоДоходамЗадолженность.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеВосстановлениеЗадолженностиПоДоходамЗадолженность.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	СписаниеВосстановлениеЗадолженностиПоДоходамСоставКомиссии.Ссылка КАК Ссылка,
	|	СписаниеВосстановлениеЗадолженностиПоДоходамСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СписаниеВосстановлениеЗадолженностиПоДоходамСоставКомиссии.Сотрудник КАК Сотрудник,
	|	СписаниеВосстановлениеЗадолженностиПоДоходамСоставКомиссии.Отсутствует КАК Отсутствует,
	|	СписаниеВосстановлениеЗадолженностиПоДоходамСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.СписаниеВосстановлениеЗадолженностиПоДоходам.СоставКомиссии КАК СписаниеВосстановлениеЗадолженностиПоДоходамСоставКомиссии
	|ГДЕ
	|	СписаниеВосстановлениеЗадолженностиПоДоходамСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_СписаниеКредиторскойЗадолженности()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	СписаниеКредиторскойЗадолженности.Ссылка КАК Ссылка,
	|	СписаниеКредиторскойЗадолженности.Организация КАК Организация,
	|	СписаниеКредиторскойЗадолженности.Дата КАК ДатаДокумента,
	|	СписаниеКредиторскойЗадолженности.Номер КАК НомерДокумента,
	|	СписаниеКредиторскойЗадолженности.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	СписаниеКредиторскойЗадолженности.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.СписаниеКредиторскойЗадолженности КАК СписаниеКредиторскойЗадолженности
	|ГДЕ
	|	СписаниеКредиторскойЗадолженности.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	СписаниеКредиторскойЗадолженностиЗадолженность.Ссылка КАК Ссылка,
	|	СписаниеКредиторскойЗадолженностиЗадолженность.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	NULL КАК Объект,
	|	СписаниеКредиторскойЗадолженностиЗадолженность.Контрагент.Наименование + "" ("" + СписаниеКредиторскойЗадолженностиЗадолженность.Счет.Код + "")"" КАК Наименование,
	|	СписокКонтрагентов.ИдентификаторПлательщика КАК Идентификатор,
	|	СписаниеКредиторскойЗадолженностиЗадолженность.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.СписаниеКредиторскойЗадолженности.Задолженность КАК СписаниеКредиторскойЗадолженностиЗадолженность
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеКредиторскойЗадолженности.СписокКонтрагентов КАК СписокКонтрагентов
	|		ПО СписаниеКредиторскойЗадолженностиЗадолженность.Ссылка = СписокКонтрагентов.Ссылка
	|			И СписаниеКредиторскойЗадолженностиЗадолженность.Контрагент = СписокКонтрагентов.Контрагент
	|ГДЕ
	|	СписаниеКредиторскойЗадолженностиЗадолженность.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеКредиторскойЗадолженностиЗадолженность.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	СписаниеКредиторскойЗадолженностиСоставКомиссии.Ссылка КАК Ссылка,
	|	СписаниеКредиторскойЗадолженностиСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СписаниеКредиторскойЗадолженностиСоставКомиссии.Сотрудник КАК Сотрудник,
	|	СписаниеКредиторскойЗадолженностиСоставКомиссии.Отсутствует КАК Отсутствует,
	|	СписаниеКредиторскойЗадолженностиСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.СписаниеКредиторскойЗадолженности.СоставКомиссии КАК СписаниеКредиторскойЗадолженностиСоставКомиссии
	|ГДЕ
	|	СписаниеКредиторскойЗадолженностиСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_СписаниеОбъектовИК()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	СписаниеОбъектовИК.Ссылка КАК Ссылка,
	|	СписаниеОбъектовИК.Организация КАК Организация,
	|	СписаниеОбъектовИК.Дата КАК ДатаДокумента,
	|	СписаниеОбъектовИК.Номер КАК НомерДокумента,
	|	СписаниеОбъектовИК.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	СписаниеОбъектовИК.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.СписаниеОбъектовИК КАК СписаниеОбъектовИК
	|ГДЕ
	|	СписаниеОбъектовИК.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	СписаниеОбъектовИКОсновныеСредства.Ссылка КАК Ссылка,
	|	СписаниеОбъектовИКОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СписаниеОбъектовИКОсновныеСредства.ОсновноеСредство КАК Объект,
	|	СписаниеОбъектовИКОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	СписаниеОбъектовИКОсновныеСредства.ИнвентарныйНомер КАК Идентификатор,
	|	СписаниеОбъектовИКОсновныеСредства.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.СписаниеОбъектовИК.ОсновныеСредства КАК СписаниеОбъектовИКОсновныеСредства
	|ГДЕ
	|	СписаниеОбъектовИКОсновныеСредства.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеОбъектовИКОсновныеСредства.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	СписаниеОбъектовИКСоставКомиссии.Ссылка КАК Ссылка,
	|	СписаниеОбъектовИКСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СписаниеОбъектовИКСоставКомиссии.Сотрудник КАК Сотрудник,
	|	СписаниеОбъектовИКСоставКомиссии.Отсутствует КАК Отсутствует,
	|	СписаниеОбъектовИКСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.СписаниеОбъектовИК.СоставКомиссии КАК СписаниеОбъектовИКСоставКомиссии
	|ГДЕ
	|	СписаниеОбъектовИКСоставКомиссии.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеОбъектовИК.Ссылка,
	|	0,
	|	СписаниеОбъектовИК.Председатель,
	|	ЛОЖЬ,
	|	СписаниеОбъектовИК.Комиссия
	|ИЗ
	|	Документ.СписаниеОбъектовИК КАК СписаниеОбъектовИК
	|ГДЕ
	|	СписаниеОбъектовИК.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_СписаниеОбъектовОС()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	СписаниеОбъектовОС.Ссылка КАК Ссылка,
	|	СписаниеОбъектовОС.Организация КАК Организация,
	|	СписаниеОбъектовОС.Дата КАК ДатаДокумента,
	|	СписаниеОбъектовОС.Номер КАК НомерДокумента,
	|	СписаниеОбъектовОС.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	СписаниеОбъектовОС.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.СписаниеОбъектовОС КАК СписаниеОбъектовОС
	|ГДЕ
	|	СписаниеОбъектовОС.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	СписаниеОбъектовОСОсновныеСредства.Ссылка КАК Ссылка,
	|	СписаниеОбъектовОСОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	СписаниеОбъектовОСОсновныеСредства.ОсновноеСредство КАК Объект,
	|	СписаниеОбъектовОСОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	СписаниеОбъектовОСОсновныеСредства.ИнвентарныйНомер КАК Идентификатор,
	|	СписаниеОбъектовОСОсновныеСредства.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.СписаниеОбъектовОС.ОсновныеСредства КАК СписаниеОбъектовОСОсновныеСредства
	|ГДЕ
	|	СписаниеОбъектовОСОсновныеСредства.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеОбъектовОСОсновныеСредства.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	СписаниеОбъектовОССоставКомиссии.Ссылка КАК Ссылка,
	|	СписаниеОбъектовОССоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СписаниеОбъектовОССоставКомиссии.Сотрудник КАК Сотрудник,
	|	СписаниеОбъектовОССоставКомиссии.Отсутствует КАК Отсутствует,
	|	СписаниеОбъектовОССоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.СписаниеОбъектовОС.СоставКомиссии КАК СписаниеОбъектовОССоставКомиссии
	|ГДЕ
	|	СписаниеОбъектовОССоставКомиссии.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеОбъектовОС.Ссылка,
	|	0,
	|	СписаниеОбъектовОС.Председатель,
	|	ЛОЖЬ,
	|	СписаниеОбъектовОС.Комиссия
	|ИЗ
	|	Документ.СписаниеОбъектовОС КАК СписаниеОбъектовОС
	|ГДЕ
	|	СписаниеОбъектовОС.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_СписаниеТранспорта()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	СписаниеТранспорта.Ссылка КАК Ссылка,
	|	СписаниеТранспорта.Организация КАК Организация,
	|	СписаниеТранспорта.Дата КАК ДатаДокумента,
	|	СписаниеТранспорта.Номер КАК НомерДокумента,
	|	СписаниеТранспорта.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	СписаниеТранспорта.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.СписаниеТранспорта КАК СписаниеТранспорта
	|ГДЕ
	|	СписаниеТранспорта.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	СписаниеТранспорта.Ссылка КАК Ссылка,
	|	"""" КАК ИдентификаторСтроки,
	|	СписаниеТранспорта.ОсновноеСредство КАК Объект,
	|	СписаниеТранспорта.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	СписаниеТранспорта.ИнвентарныйНомер КАК Идентификатор,
	|	СписаниеТранспорта.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.СписаниеТранспорта КАК СписаниеТранспорта
	|ГДЕ
	|	СписаниеТранспорта.Ссылка В(&Ссылка)";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	СписаниеТранспортаСоставКомиссии.Ссылка КАК Ссылка,
	|	СписаниеТранспортаСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СписаниеТранспортаСоставКомиссии.Сотрудник КАК Сотрудник,
	|	СписаниеТранспортаСоставКомиссии.Отсутствует КАК Отсутствует,
	|	СписаниеТранспортаСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.СписаниеТранспорта.СоставКомиссии КАК СписаниеТранспортаСоставКомиссии
	|ГДЕ
	|	СписаниеТранспортаСоставКомиссии.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеТранспорта.Ссылка,
	|	0,
	|	СписаниеТранспорта.Председатель,
	|	ЛОЖЬ,
	|	СписаниеТранспорта.Комиссия
	|ИЗ
	|	Документ.СписаниеТранспорта КАК СписаниеТранспорта
	|ГДЕ
	|	СписаниеТранспорта.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_СписаниеТранспортаИК()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	СписаниеТранспортаИК.Ссылка КАК Ссылка,
	|	СписаниеТранспортаИК.Организация КАК Организация,
	|	СписаниеТранспортаИК.Дата КАК ДатаДокумента,
	|	СписаниеТранспортаИК.Номер КАК НомерДокумента,
	|	СписаниеТранспортаИК.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	СписаниеТранспортаИК.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.СписаниеТранспортаИК КАК СписаниеТранспортаИК
	|ГДЕ
	|	СписаниеТранспортаИК.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	СписаниеТранспортаИК.Ссылка КАК Ссылка,
	|	"""" КАК ИдентификаторСтроки,
	|	СписаниеТранспортаИК.ОсновноеСредство КАК Объект,
	|	СписаниеТранспортаИК.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	СписаниеТранспортаИК.ИнвентарныйНомер КАК Идентификатор,
	|	СписаниеТранспортаИК.РезолюцияКомиссии КАК Резолюция
	|ИЗ
	|	Документ.СписаниеТранспортаИК КАК СписаниеТранспортаИК
	|ГДЕ
	|	СписаниеТранспортаИК.Ссылка В(&Ссылка)";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	СписаниеТранспортаИКСоставКомиссии.Ссылка КАК Ссылка,
	|	СписаниеТранспортаИКСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СписаниеТранспортаИКСоставКомиссии.Сотрудник КАК Сотрудник,
	|	СписаниеТранспортаИКСоставКомиссии.Отсутствует КАК Отсутствует,
	|	СписаниеТранспортаИКСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.СписаниеТранспортаИК.СоставКомиссии КАК СписаниеТранспортаИКСоставКомиссии
	|ГДЕ
	|	СписаниеТранспортаИКСоставКомиссии.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеТранспортаИК.Ссылка,
	|	0,
	|	СписаниеТранспортаИК.Председатель,
	|	ЛОЖЬ,
	|	СписаниеТранспортаИК.Комиссия
	|ИЗ
	|	Документ.СписаниеТранспортаИК КАК СписаниеТранспортаИК
	|ГДЕ
	|	СписаниеТранспортаИК.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_ТаксировкаПутевогоЛиста()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	ТаксировкаПутевогоЛиста.Ссылка КАК Ссылка,
	|	ТаксировкаПутевогоЛиста.Организация КАК Организация,
	|	ТаксировкаПутевогоЛиста.Дата КАК ДатаДокумента,
	|	ТаксировкаПутевогоЛиста.Номер КАК НомерДокумента,
	|	ТаксировкаПутевогоЛиста.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	ТаксировкаПутевогоЛиста.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.ТаксировкаПутевогоЛиста КАК ТаксировкаПутевогоЛиста
	|ГДЕ
	|	ТаксировкаПутевогоЛиста.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	ТаксировкаПутевогоЛистаМатериалы.Ссылка КАК Ссылка,
	|	ТаксировкаПутевогоЛистаМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаксировкаПутевогоЛистаМатериалы.Номенклатура КАК Объект,
	|	ТаксировкаПутевогоЛистаМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК Идентификатор,
	|	ТаксировкаПутевогоЛистаМатериалы.ПричинаСписанияСсылка.Наименование КАК Резолюция
	|ИЗ
	|	Документ.ТаксировкаПутевогоЛиста.Материалы КАК ТаксировкаПутевогоЛистаМатериалы
	|ГДЕ
	|	ТаксировкаПутевогоЛистаМатериалы.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаксировкаПутевогоЛистаМатериалы.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	ТаксировкаПутевогоЛистаСоставКомиссии.Ссылка КАК Ссылка,
	|	ТаксировкаПутевогоЛистаСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	ТаксировкаПутевогоЛистаСоставКомиссии.Сотрудник КАК Сотрудник,
	|	ТаксировкаПутевогоЛистаСоставКомиссии.Отсутствует КАК Отсутствует,
	|	ТаксировкаПутевогоЛистаСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.ТаксировкаПутевогоЛиста.СоставКомиссии КАК ТаксировкаПутевогоЛистаСоставКомиссии
	|ГДЕ
	|	ТаксировкаПутевогоЛистаСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаЛистаГолосования_ТаксировкаРабочегоЛистаАгрегата()
	Результат = ЧастиЗапроса();
	Результат.Документ =
	"ВЫБРАТЬ
	|	ТаксировкаРабочегоЛистаАгрегата.Ссылка КАК Ссылка,
	|	ТаксировкаРабочегоЛистаАгрегата.Организация КАК Организация,
	|	ТаксировкаРабочегоЛистаАгрегата.Дата КАК ДатаДокумента,
	|	ТаксировкаРабочегоЛистаАгрегата.Номер КАК НомерДокумента,
	|	ТаксировкаРабочегоЛистаАгрегата.Комиссия.МинимальныйПроцентЗа КАК Кворум,
	|	ТаксировкаРабочегоЛистаАгрегата.ОтветственныйИсполнитель КАК Ответственный
	|ИЗ
	|	Документ.ТаксировкаРабочегоЛистаАгрегата КАК ТаксировкаРабочегоЛистаАгрегата
	|ГДЕ
	|	ТаксировкаРабочегоЛистаАгрегата.Ссылка В(&Ссылка)";
	Результат.Объекты =
	"ВЫБРАТЬ
	|	ТаксировкаРабочегоЛистаАгрегатаМатериалы.Ссылка КАК Ссылка,
	|	ТаксировкаРабочегоЛистаАгрегатаМатериалы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаксировкаРабочегоЛистаАгрегатаМатериалы.Номенклатура КАК Объект,
	|	ТаксировкаРабочегоЛистаАгрегатаМатериалы.Номенклатура.НаименованиеПолное КАК Наименование,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК Идентификатор,
	|	ТаксировкаРабочегоЛистаАгрегатаМатериалы.ПричинаСписанияСсылка.Наименование КАК Резолюция
	|ИЗ
	|	Документ.ТаксировкаРабочегоЛистаАгрегата.Материалы КАК ТаксировкаРабочегоЛистаАгрегатаМатериалы
	|ГДЕ
	|	ТаксировкаРабочегоЛистаАгрегатаМатериалы.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаксировкаРабочегоЛистаАгрегатаМатериалы.НомерСтроки";
	Результат.Комиссия =
	"ВЫБРАТЬ
	|	ТаксировкаРабочегоЛистаАгрегатаСоставКомиссии.Ссылка КАК Ссылка,
	|	ТаксировкаРабочегоЛистаАгрегатаСоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	ТаксировкаРабочегоЛистаАгрегатаСоставКомиссии.Сотрудник КАК Сотрудник,
	|	ТаксировкаРабочегоЛистаАгрегатаСоставКомиссии.Отсутствует КАК Отсутствует,
	|	ТаксировкаРабочегоЛистаАгрегатаСоставКомиссии.Ссылка.Комиссия КАК Комиссия
	|ИЗ
	|	Документ.ТаксировкаРабочегоЛистаАгрегата.СоставКомиссии КАК ТаксировкаРабочегоЛистаАгрегатаСоставКомиссии
	|ГДЕ
	|	ТаксировкаРабочегоЛистаАгрегатаСоставКомиссии.Ссылка В(&Ссылка)";
	Возврат Результат;
КонецФункции

Функция ПрочитатьРеквизитыПервичныхДокументовИзПроводок(СписокДокументов)
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("СписокДокументов", СписокДокументов);
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Регистратор					КАК Ссылка,
	|	ВидПервичногоДокумента		КАК ВидПервичногоДокумента,
	|	ДатаПервичногоДокумента		КАК ДатаПервичногоДокумента,
	|	НомерПервичногоДокумента	КАК НомерПервичногоДокумента
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|		,									// 1
	|		,									// 2
	|		Регистратор В(&СписокДокументов)	// 3
	|		И ВидПервичногоДокумента <> """"
	|		И ДатаПервичногоДокумента <> ДАТАВРЕМЯ(1,1,1)
	|		И НомерПервичногоДокумента <> """"
	|		,
	|		Регистратор							// 4
	|		)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ДатаПервичногоДокумента УБЫВ";
	
	УстановитьПривилегированныйРежим(Истина);
	Таблица = ЗапросПоиск.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Таблица.Индексы.Добавить("Ссылка");
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#КонецЕсли
