
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОповещениеОткрытиеФормыВводаТелефона(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатОткрытияФормы.ВведенноеЧисло) Тогда
			ПреобразоватьТелефонКПользовательскомуВиду(РезультатОткрытияФормы.ВведенноеЧисло, Телефон, ТелефонСтрокой);
			Email 									= "";
			ДанныеSMSИлиEmail 						= ТелефонСтрокой;
			ОтказКлиентаОтСохраненияТелефонаEmail 	= РезультатОткрытияФормы.ОтказКлиентаОтСохраненияТелефона;
			ПроверитьВариантыПлатежаУстановитьВидимостьИДоступностьКлиент();
		Иначе
			Телефон 		= 0;
			ТелефонСтрокой 	= "";
			Email 			= "";
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытиеФормыВводаEmail(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатОткрытияФормы.Email) Тогда
			Email 									= РезультатОткрытияФормы.Email;
			Телефон 								= 0;
			ТелефонСтрокой							= "";
			ДанныеSMSИлиEmail 						= Email;
			ОтказКлиентаОтСохраненияТелефонаEmail 	= РезультатОткрытияФормы.ОтказКлиентаОтСохраненияEmail;
			ПроверитьВариантыПлатежаУстановитьВидимостьИДоступностьКлиент();
		Иначе
			Телефон 		= 0;
			ТелефонСтрокой 	= "";
			Email 			= "";
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	КассаККМ 								= Параметры.КассаККМ;
	ОперацияСДенежнымиСредствами 			= Параметры.ОперацияСДенежнымиСредствами;
	Организация								= Параметры.Организация;
	ПечатьЧека 								= Параметры.ПечатьЧека;
	РежимПродажи							= Параметры.РежимПродажи;
	Если Параметры.Свойство("НомерПлатежнойКарты") Тогда 
		НомерПлатежнойКарты					= Параметры.НомерПлатежнойКарты;
	КонецЕсли;	
	Если Параметры.Свойство("СсылочныйНомер") Тогда 
		СсылочныйНомер						= Параметры.СсылочныйНомер;
	КонецЕсли;
	Если Параметры.Свойство("НомерЧекаЭТ") Тогда 
		НомерЧекаЭТ							= Параметры.НомерЧекаЭТ;
	КонецЕсли;
	Если Параметры.Свойство("ПараметрыДоговораЭквайринга") Тогда
		ПараметрыДоговораЭквайринга				= Параметры.ПараметрыДоговораЭквайринга;
		Если Параметры.Свойство("ВидПлатежнойКарты") Тогда 
			ВидПлатежнойКарты = Параметры.ВидПлатежнойКарты;
		Иначе	
			Отбор = Новый Структура("ОсновнойВид", Истина);
			СтрокаВидКарты = ПараметрыДоговораЭквайринга.ТарифыЗаРасчетноеОбслуживание.НайтиСтроки(Отбор);
			Если ЗначениеЗаполнено(СтрокаВидКарты) Тогда 
				ВидПлатежнойКарты = СтрокаВидКарты[0].ВидПлатежнойКарты;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("ЭквайринговыйТерминал") Тогда 
		ЭквайринговыйТерминал					= Параметры.ЭквайринговыйТерминал;
		ИспользоватьБезПодключенияОборудования 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭквайринговыйТерминал, "ИспользоватьБезПодключенияОборудования");
	КонецЕсли;
	
	КоличествоСимволовПослеЗапятой = 2;
	ПервыйВвод = Истина;
	
	Если Параметры.Свойство("СуммаОплаты") Тогда
		
		СуммаОплаты   			= Параметры.СуммаОплаты;
		СуммаМожетБытьНулевой 	= СуммаОплаты = 0;
		
		ИтогПоЧеку    			= СуммаОплаты;
		СуммаСдачи    			= 0;
		ВводимоеЧисло 			= Формат(СуммаОплаты, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0");
		
	КонецЕсли;
	
	ВозможностьЭлектронногоПлатежа = ВозможностьЭлектронногоПлатежа(КассаККМ.ПодключаемоеОборудование);
	Если ВозможностьЭлектронногоПлатежа Тогда
		ПередачаEmailЧерезПрограмму = КассаККМ.ЭлектронныйЧекEmailПередаютсяПрограммой1С;
		ПередачаSMSЧерезПрограмму  	= КассаККМ.ЭлектронныйЧекSMSПередаютсяПрограммой1С;
	КонецЕсли;
	
	ОтказКлиентаОтСохраненияТелефонаEmail 	= Истина;
	Элементы.КомандаEmail.Видимость 		= ВозможностьЭлектронногоПлатежа;
	Элементы.КомандаSMS.Видимость   		= ВозможностьЭлектронногоПлатежа;
		
	КомандаИзменениеПечатиЧекаСервер(ПечатьЧека);
	
	Если ВозможностьЭлектронногоПлатежа Тогда
		ПроверитьВариантыПлатежаУстановитьВидимостьИДоступностьСервер();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	
	Если Параметры.Свойство("НадписьЗаголовок") Тогда
		НадписьЗаголовок = Параметры.НадписьЗаголовок;
		Если Параметры.Свойство("ЦветТекстаЗаголовка") Тогда
			Элементы.НадписьЗаголовок.ЦветТекстаЗаголовка = Параметры.ЦветТекстаЗаголовка;
		КонецЕсли;
	Иначе
		Элементы.НадписьЗаголовок.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Контрагент") И Параметры.Свойство("Договор") Тогда 
		Контрагент 		= Параметры.Контрагент;
		Договор 		= Параметры.Договор;
	Иначе	
		ДанныеКассыККМ 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассаККМ, "КонтрагентДляРозничныхПродаж, ДоговорДляРозничныхПродаж");
		Контрагент 		= ДанныеКассыККМ.КонтрагентДляРозничныхПродаж;
		Договор 		= ДанныеКассыККМ.ДоговорДляРозничныхПродаж;
	КонецЕсли;	
	
	Если НЕ ОперацияСДенежнымиСредствами Тогда 
		Элементы.Переместить(Элементы.ГруппаРяд8, Элементы.ГруппаПраваяПанель);
		Элементы.Переместить(Элементы.ГруппаРяд4, Элементы.ГруппаПраваяПанель);
		Элементы.ГруппаРяд4.Видимость = Ложь;
		ВводитьНомерПлатежнойКарты = (НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭквайринговыйТерминал, "НеВводитьНомерПлатежнойКарты")) И
							ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭквайринговыйТерминал, "ИспользоватьБезПодключенияОборудования");
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаЛеваяКлавиатура;
	УстановитьВидимостьВЗависимостиОтВидаПлатежа();
	ОбновитьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда0(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда0ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаТочка(Команда)
	
	Если ПервыйВвод Тогда
		ВводимоеЧисло 	= "";
		ПервыйВвод 		= Ложь;
	КонецЕсли;
	
	Если ВводимоеЧисло 	= "" Тогда
		ВводимоеЧисло 	= "0";
	КонецЕсли;
	
	ЧислоВхождений = СтрЧислоВхождений(ВводимоеЧисло, ",");
	
	Если Не ЧислоВхождений > 0 Тогда
		ВводимоеЧисло = ВводимоеЧисло + ",";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтереть(Команда)
	ВводимоеЧисло 										= "";
	ПервыйВвод 											= Ложь;
	
	СуммаОплаты 										= 0;
	СуммаСдачи  										= ИтогПоЧеку;
	Элементы.КомандаEnter.Доступность 					= СуммаМожетБытьНулевой;
	Элементы.КомандаEnterПраваяКлавиатура.Доступность 	= Элементы.КомандаEnter.Доступность;
	
	Элементы.КомандаEmail.Доступность 					= Ложь;
	Элементы.КомандаSMS.Доступность   					= Ложь;
	
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура КомандаEnter(Команда)
	
	ТекстСообщения = "";
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
		ТекстСообщения = ТекстСообщения + "Не заполнено поле ""Контрагент""!" + Символы.ПС;
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Договор) Тогда 
		ТекстСообщения = ТекстСообщения + "Не заполнено поле ""Договор""!";
		Отказ = Истина;
	КонецЕсли;
	
	
	Если Отказ Тогда 
		ТекстСообщения 							= НСтр("ru = '" + ТекстСообщения + "'");
		ПараметрыИнформации 					= ПодключаемоеОборудованиеБГУКлиентСервер.ПолучитьСтруктуруВыводимойВРМКИнформации();
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Невозможно произвести оплату.'");
		ПараметрыИнформации.ТекстИнформации 	= ТекстСообщения;
		РозничныеПродажиБГУКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
		Возврат;
	Иначе 
		Если ОперацияСДенежнымиСредствами Тогда 
			ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.Наличные");
			ЗакрытьФормуОплаты();
		Иначе	
			ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта");
			
			Если ИспользоватьБезПодключенияОборудования Тогда
				ОбработчикОповещения 	= Новый ОписаниеОповещения("ОповещениеОткрытьФормуАвторизации", ЭтотОбъект);
				ТекстЗаголовка 			= НСтр("ru = 'Авторизация операции'");
				ТекстСообщения 			= НСтр("ru = 'Операция оплаты проведена на эквайринговом терминале?'");
				РозничныеПродажиБГУКлиент.ВывестиВопросДляРМКУправляемой(ТекстЗаголовка, ТекстСообщения,,ОбработчикОповещения);
			Иначе
				ПровестиОплатуНаТерминале();
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаSMS(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытиеФормыВводаТелефона", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок" 						, НСтр("ru = 'Введите номер телефона'"));
	ПараметрыФормы.Вставить("ЧислоВвода"						, Телефон);
	ПараметрыФормы.Вставить("Контрагент"						, Контрагент);
	ПараметрыФормы.Вставить("ОтказКлиентаОтСохраненияТелефона"	, ОтказКлиентаОтСохраненияТелефонаEmail);
	
	ПодключаемоеОборудованиеБГУКлиент.ОткрытьФормуВводаТелефонаДляОтправкиЧерезОФД(ОбработчикОповещения, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаEmail(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытиеФормыВводаEmail", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Email"							, Email);
	ПараметрыФормы.Вставить("Заголовок"						, НСтр("ru = 'Введите адрес электронной почты (Email)'"));
	ПараметрыФормы.Вставить("Контрагент"					, Контрагент);
	ПараметрыФормы.Вставить("ОтказКлиентаОтСохраненияEmail"	, ОтказКлиентаОтСохраненияТелефонаEmail);
	
	ПодключаемоеОборудованиеБГУКлиент.ОткрытьФормуВводаEmailОтправкиЧерезОФД(ОбработчикОповещения, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменениеПечатиЧека(Команда)
	
	ПечатьЧека = НЕ ПечатьЧека;
	
	КомандаИзменениеПечатиЧекаКлиент(ПечатьЧека);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьЦифру(ВведеннаяЦифраСтрокой)
	
	Если ПервыйВвод Тогда
		Если ВведеннаяЦифраСтрокой = "0" Тогда
			Возврат;
		КонецЕсли;
		ВводимоеЧисло = "";
		ПервыйВвод = Ложь;
	КонецЕсли;
	
	Запятая = Сред(ВводимоеЧисло, СтрДлина(ВводимоеЧисло) - КоличествоСимволовПослеЗапятой, 1);
	
	Если НЕ Запятая = "," Тогда
		ВводимоеЧисло = ВводимоеЧисло + ВведеннаяЦифраСтрокой;
	КонецЕсли;
	
	СуммаОплаты = ПривестиСтрокуКЧислу(ВводимоеЧисло, Истина);
	
	ОбновитьФорму();
КонецПроцедуры

// Функция выполняет приведение строки к числу.
// Параметры:
//  ЧислоСтрокой           - Строка - Строка приводимая к числу.
//  ВозвращатьНеопределено - Булево - Если Истина и строка содержит некорректное значение, то возвращать Неопределено.
//
// Возвращаемое значение:
//  Число
//
&НаКлиенте
Функция ПривестиСтрокуКЧислу(ЧислоСтрокой, ВозвращатьНеопределено = Ложь)
	
	ОписаниеТипаЧисла 	= Новый ОписаниеТипов("Число");
	ЗначениеЧисла 		= ОписаниеТипаЧисла.ПривестиЗначение(ЧислоСтрокой);
	
	Если ВозвращатьНеопределено И (ЗначениеЧисла = 0) Тогда
		
		Стр = Строка(ЧислоСтрокой);
		Если Стр = "" Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Стр = СтрЗаменить(СокрЛП(Стр), "0", "");
		Если (Стр <> "") И (Стр <> ".") И (Стр <> ",") Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеЧисла;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьФорму()
	
	Если СуммаОплаты >= ИтогПоЧеку Тогда
		СуммаСдачи 											= СуммаОплаты - ИтогПоЧеку;
		Элементы.КомандаEnter.Доступность 					=  СуммаОплаты > 0 ИЛИ СуммаМожетБытьНулевой;
		Элементы.КомандаEnterПраваяКлавиатура.Доступность 	= Элементы.КомандаEnter.Доступность;
		ЦветСдачи   										= Новый Цвет(45, 115, 44);
		ЦветВнесено 										= Новый Цвет();
		ТекущийЭлемент 										= Элементы.КомандаEnter;
	Иначе
		СуммаСдачи 											= 0;
		Элементы.КомандаEnter.Доступность 					= (ОперацияСДенежнымиСредствами) И (СуммаОплаты <> 0 ИЛИ СуммаМожетБытьНулевой);
		Элементы.КомандаEnterПраваяКлавиатура.Доступность 	= Элементы.КомандаEnter.Доступность;
		ЦветСдачи   										= Новый Цвет();
		
		Если ОперацияСДенежнымиСредствами 
			ИЛИ СуммаОплаты = 0 Тогда
			ЦветВнесено =  Новый Цвет();
		Иначе
			ЦветВнесено =  Новый Цвет(190, 32, 80);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.КомандаEmail.Доступность = ВозможностьЭлектронногоПлатежа;
	Элементы.КомандаSMS.Доступность   = ВозможностьЭлектронногоПлатежа;
	
	Элементы.СуммаСдачи.ЦветТекстаЗаголовка = ЦветСдачи;
	Элементы.СуммаСдачи.ЦветТекста          = ЦветСдачи;
	
	Элементы.ПолеВводимоеЧисло.ЦветТекстаЗаголовка = ЦветВнесено;
	Элементы.ПолеВводимоеЧисло.ЦветТекста          = ЦветВнесено;
	
	Если ЗначениеЗаполнено(ДанныеSMSИлиEmail) Тогда
		Если ОтказКлиентаОтСохраненияТелефонаEmail Тогда
			Элементы.ДекорацияОтказКлиентаОтСохраненияТелефонаEmail.Картинка = БиблиотекаКартинок.НеСохранять16;
		Иначе
			Элементы.ДекорацияОтказКлиентаОтСохраненияТелефонаEmail.Картинка = БиблиотекаКартинок.Сохранить16;
		КонецЕсли;
	Иначе
		Элементы.ДекорацияОтказКлиентаОтСохраненияТелефонаEmail.Картинка = БиблиотекаКартинок.Пустая;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаИзменениеПечатиЧекаСервер(ВключитьКартинкуПечати)
	
	Если ВключитьКартинкуПечати Тогда
		Элементы.КомандаИзменениеПечатиЧека.Картинка = БиблиотекаКартинок.ПечатьЧека;
	Иначе
		Элементы.КомандаИзменениеПечатиЧека.Картинка = БиблиотекаКартинок.ОтказОтПечатиЧека;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменениеПечатиЧекаКлиент(ВключитьКартинкуПечати)
	
	Если ВключитьКартинкуПечати Тогда
		Элементы.КомандаИзменениеПечатиЧека.Картинка = БиблиотекаКартинок.ПечатьЧека;
	Иначе
		Элементы.КомандаИзменениеПечатиЧека.Картинка = БиблиотекаКартинок.ОтказОтПечатиЧека;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВариантыПлатежаУстановитьВидимостьИДоступностьСервер()
	
	ВозможностьОтправкиSMS 			= ВозможностьЭлектронногоПлатежа;
	ВозможностьОтправкиEmail 		= ВозможностьЭлектронногоПлатежа;
	ВозможностьОтказаОтПечатиЧека	= Ложь;
	Если (ВозможностьОтправкиSMS И ЗначениеЗаполнено(Телефон) И НЕ ПередачаSMSЧерезПрограмму)
		ИЛИ (ВозможностьОтправкиEmail И ЗначениеЗаполнено(Email) И НЕ ПередачаEmailЧерезПрограмму) Тогда
		
		ВозможностьОтказаОтПечатиЧека = Истина;
		
	КонецЕсли;
	
	Элементы.КомандаEmail.Видимость                 = ВозможностьОтправкиEmail;
	Элементы.КомандаSMS.Видимость                   = ВозможностьОтправкиSMS;
	Элементы.КомандаИзменениеПечатиЧека.Видимость 	= ВозможностьОтказаОтПечатиЧека;
	Элементы.ГруппаДанныеSMSИEmail.Видимость        = ВозможностьЭлектронногоПлатежа;
	
	Если ВозможностьОтказаОтПечатиЧека Тогда
		ПечатьЧека = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВариантыПлатежаУстановитьВидимостьИДоступностьКлиент()
	
	ВозможностьОтправкиSMS 			= ВозможностьЭлектронногоПлатежа;
	ВозможностьОтправкиEmail 		= ВозможностьЭлектронногоПлатежа;
	ВозможностьОтказаОтПечатиЧека 	= Ложь;
	Если (ВозможностьОтправкиSMS И ЗначениеЗаполнено(Телефон) И НЕ ПередачаSMSЧерезПрограмму)
		ИЛИ (ВозможностьОтправкиEmail И ЗначениеЗаполнено(Email) И НЕ ПередачаEmailЧерезПрограмму) Тогда
		
		ВозможностьОтказаОтПечатиЧека = Истина;
		
	КонецЕсли;
	
	Элементы.КомандаEmail.Видимость                 = ВозможностьОтправкиEmail;
	Элементы.КомандаSMS.Видимость                   = ВозможностьОтправкиSMS;
	Элементы.КомандаИзменениеПечатиЧека.Видимость 	= ВозможностьОтказаОтПечатиЧека;
	Элементы.ГруппаДанныеSMSИEmail.Видимость        = ВозможностьЭлектронногоПлатежа;
	
	Если ВозможностьОтказаОтПечатиЧека Тогда
		ПечатьЧека = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВозможностьЭлектронногоПлатежа(ПодключаемоеОборудование)
	
	Если НЕ ЗначениеЗаполнено(ПодключаемоеОборудование) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПодключаемоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь
	
КонецФункции

&НаКлиенте
Процедура ПреобразоватьТелефонКПользовательскомуВиду(ВведенноеЧисло, Телефон, ТелефонСтрокой) Экспорт
	
	ВведенноеЧислоСтрокой = Формат(ВведенноеЧисло, "ЧГ=0");
	ВведенноеЧислоСтрокой = Лев(ВведенноеЧислоСтрокой, 10);
	Телефон = Число(ВведенноеЧислоСтрокой);
	Если СтрДлина(ВведенноеЧислоСтрокой) < 10 Тогда
		ВведенноеЧислоСтрокой = Формат(ВведенноеЧисло, "ЧЦ=10; ЧДЦ=; ЧВН=; ЧГ=0");
	КонецЕсли;
	
	ТелефонСтрокой = "+7(";
	ТелефонСтрокой = ТелефонСтрокой + Сред(ВведенноеЧислоСтрокой, 1, 3);
	ТелефонСтрокой = ТелефонСтрокой + ")";
	ТелефонСтрокой = ТелефонСтрокой + Сред(ВведенноеЧислоСтрокой, 4, 3);
	ТелефонСтрокой = ТелефонСтрокой + "-";
	ТелефонСтрокой = ТелефонСтрокой + Сред(ВведенноеЧислоСтрокой, 7, 2);
	ТелефонСтрокой = ТелефонСтрокой + "-";
	ТелефонСтрокой = ТелефонСтрокой + Сред(ВведенноеЧислоСтрокой, 9, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьВЗависимостиОтВидаПлатежа()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаСтраницаПраваяКлавиатура", "Видимость", ОперацияСДенежнымиСредствами);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаСтраницаЛеваяКлавиатура", "Видимость", ОперацияСДенежнымиСредствами);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СуммаСдачи", "Видимость", ОперацияСДенежнымиСредствами);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПолеВводимоеЧисло", "Видимость", ОперацияСДенежнымиСредствами);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПолеВводаНомерКарты", "Видимость", ВводитьНомерПлатежнойКарты);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ВидПлатежнойКарты", "Видимость", НЕ ОперацияСДенежнымиСредствами);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ЭквайринговыйТерминал", "Видимость", НЕ ОперацияСДенежнымиСредствами);
	
КонецПроцедуры	
#КонецОбласти

&НаКлиенте
Процедура ОповещениеОткрытьФормуАвторизации(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		Если НЕ ВРЕГ(РезультатОткрытияФормы) = "ДА" Тогда
			Возврат;
		Иначе
			ЗакрытьФормуОплаты();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуОплаты(ПараметрыОплатыЭТ = Неопределено)
	
	СуммаОплатыЧисло 	= ПривестиСтрокуКЧислу(ВводимоеЧисло, Ложь);
	СтруктураОтвета 	= Новый Структура;
	СтруктураОтвета.Вставить("Действие"   								, НСтр("ru = 'Закрыть чек'"));
	СтруктураОтвета.Вставить("Сумма"									, ИтогПоЧеку);
	СтруктураОтвета.Вставить("СуммаОплачено"							, СуммаОплатыЧисло);
	СтруктураОтвета.Вставить("ОтказКлиентаОтСохраненияТелефонаEmail"	, ОтказКлиентаОтСохраненияТелефонаEmail);
	СтруктураОтвета.Вставить("Email"  									, Email);
	СтруктураОтвета.Вставить("Телефон"									, Формат(Телефон, "ЧЦ=10; ЧДЦ=; ЧГ=0"));
	СтруктураОтвета.Вставить("СуммаСдачи"  								, СуммаСдачи);
	СтруктураОтвета.Вставить("Контрагент"  								, Контрагент);
	СтруктураОтвета.Вставить("Договор"  								, Договор);
	СтруктураОтвета.Вставить("ТипОплаты"  								, ТипОплаты);
	
	Если Не ОперацияСДенежнымиСредствами Тогда
		ПроцентКомиссии = ПолучитьПроцентКомиссии();
		СтруктураОтвета.Вставить("НомерПлатежнойКарты"			, НомерПлатежнойКарты);
		СтруктураОтвета.Вставить("СсылочныйНомер"  				, СсылочныйНомер);
		СтруктураОтвета.Вставить("НомерЧекаЭТ"  				, НомерЧекаЭТ);
		СтруктураОтвета.Вставить("ЭквайринговыйТерминал"		, ЭквайринговыйТерминал);
		СтруктураОтвета.Вставить("ПараметрыДоговораЭквайринга"	, ПараметрыДоговораЭквайринга);
		СтруктураОтвета.Вставить("ПроцентКомиссии"				, ПроцентКомиссии);
		СтруктураОтвета.Вставить("ВидПлатежнойКарты"			, ВидПлатежнойКарты);
		СтруктураОтвета.Вставить("СуммаКомиссии"				, СуммаОплатыЧисло/100*ПроцентКомиссии);  
		
		ДанныеОВидеКартыИПроценте = ЭквайрингВызовСервера.ПолучитьДанныеВидаКартыДоговораЭквайринга(ПараметрыДоговораЭквайринга, ВидПлатежнойКарты);
		НДССКомиссииСверху = ДанныеОВидеКартыИПроценте.НДССКомиссииСверху;
		СтавкаНДССКомиссии = УчетНДСКлиентСервер.ПолучитьМножительСтавки(ДанныеОВидеКартыИПроценте.СтавкаНДССКомисии, Не НДССКомиссииСверху);
		Если НДССКомиссииСверху Тогда 
			СтруктураОтвета.СуммаКомиссии = СтруктураОтвета.СуммаКомиссии + (СтруктураОтвета.СуммаКомиссии * СтавкаНДССКомиссии);
		КонецЕсли;	
	КонецЕсли;	
	
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиОплатуНаТерминале()
	
	СуммаОплатыЧисло 						= ПривестиСтрокуКЧислу(ВводимоеЧисло, Ложь);
	ПараметрыЭТ		         				= ЭквайрингВызовСервера.ПолучитьПараметрыЭТ(ЭквайринговыйТерминал);
	ИдентификаторУстройства 				= ПараметрыЭТ.ИдентификаторУстройства;
	ИдентификаторУстройстваПечатиСлипЧека 	= ПараметрыЭТ.ИдентификаторУстройстваПечатиСлипЧека;
	
	ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
	Если РежимПродажи = 0 Тогда 
		ПараметрыОперации.ТипТранзакции  = "AuthorizeSales";
		ПараметрыОперации.НомерЧека      = 0;
		ПараметрыОперации.СсылочныйНомер = "";
	Иначе
		ПараметрыОперации.ТипТранзакции  = "AuthorizeVoid";
		ПараметрыОперации.НомерКарты     = НомерПлатежнойКарты;
		ПараметрыОперации.НомерЧека      = НомерЧекаЭТ;
		ПараметрыОперации.СсылочныйНомер = СсылочныйНомер;
	КонецЕсли;
	ПараметрыОперации.СуммаОперации  	= СуммаОплатыЧисло;
	
	Оповещение = Новый ОписаниеОповещения("ОповещениеОткрытьФормуАвторизацииЭТЗавершение", ЭтотОбъект);
	ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(Оповещение, УникальныйИдентификатор, 
	ИдентификаторУстройства, ПараметрыОперации,,ИдентификаторУстройстваПечатиСлипЧека);
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ОповещениеОткрытьФормуАвторизацииЭТЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения 							= НСтр("ru = 'При выполнении операции возникла ошибка:
													|""%ОписаниеОшибки%"".
													|Оплата по карте не была произведена.'");
		ТекстСообщения 							= СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		ПараметрыИнформации 					= ПодключаемоеОборудованиеБГУКлиентСервер.ПолучитьСтруктуруВыводимойВРМКИнформации();
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Ошибка выполнения операции.'");
		ПараметрыИнформации.ТекстИнформации 	= ТекстСообщения;
		РозничныеПродажиБГУКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
	Иначе
		СсылочныйНомер 		= РезультатВыполнения.СсылочныйНомер;
		НомерЧекаЭТ 		= РезультатВыполнения.НомерЧекаЭТ;
		НомерПлатежнойКарты = РезультатВыполнения.НомерКарты;
		
		ЗакрытьФормуОплаты();
	КонецЕсли;

КонецПроцедуры	

&НаКлиенте
Процедура ВидПлатежнойКартыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ОбработчикОповещения 	= Новый ОписаниеОповещения("ОповещениеОткрытьФормуВыбораВидаКарты", ЭтотОбъект);
	Режим 					= РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ПараметрыФормы 			= Новый Структура("Справочник", "ВидыПлатежныхКарт");
	ПараметрыФормы.Вставить("Отбор"											, ПолучитьДоступныеВидыКарт());
	ПараметрыФормы.Вставить("Заголовок"										, "Вид платежной карты");
	ПараметрыФормы.Вставить("ЗаголовокКолонки"								, "Вид платежной карты");
	ОткрытьФорму("Обработка.РМКУправляемыйРежим.Форма.ФормаВыбораЗначения"	, ПараметрыФормы,,,,, ОбработчикОповещения, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВыбораВидаКарты(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы 	= Неопределено Тогда
		ВидПлатежнойКарты 			= РезультатОткрытияФормы;	
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьДоступныеВидыКарт() 
	
	Возврат ПараметрыДоговораЭквайринга.ТарифыЗаРасчетноеОбслуживание.ВыгрузитьКолонку("ВидПлатежнойКарты");
	
КонецФункции

&НаСервере
Функция ПолучитьПроцентКомиссии() 
	
	Если ЗначениеЗаполнено(ВидПлатежнойКарты) Тогда 
		СтрокаТариф = ПараметрыДоговораЭквайринга.ТарифыЗаРасчетноеОбслуживание.Найти(ВидПлатежнойКарты, "ВидПлатежнойКарты");	
		Возврат СтрокаТариф.ПроцентТорговойУступки;
	Иначе 
		Возврат 0;
	КонецЕсли;	
	
КонецФункции


&НаКлиенте
Процедура ЭквайринговыйТерминалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ОбработчикОповещения 	= Новый ОписаниеОповещения("ОповещениеОткрытьФормуВыбораЭквайринговогоТерминала", ЭтотОбъект);
	Режим 					= РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ПараметрыФормы 			= Новый Структура("Справочник", "ЭквайринговыеТерминалы");
	ПараметрыФормы.Вставить("Отбор"											, ПолучитьДоступныеЭквайринговыеТерминалы());
	ПараметрыФормы.Вставить("Заголовок"										, "Эквайринговый терминал");
	ПараметрыФормы.Вставить("ЗаголовокКолонки"								, "Эквайринговый терминал");
	ОткрытьФорму("Обработка.РМКУправляемыйРежим.Форма.ФормаВыбораЗначения"	, ПараметрыФормы,,,,, ОбработчикОповещения, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВыбораЭквайринговогоТерминала(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы 	= Неопределено Тогда
		ЭквайринговыйТерминал 					= РезультатОткрытияФормы;
		ИспользоватьБезПодключенияОборудования 	= ПолучитьТипТерминала(ЭквайринговыйТерминал);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипТерминала(ЭквайринговыйТерминал)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭквайринговыйТерминал, "ИспользоватьБезПодключенияОборудования");	
	
КонецФункции	

&НаСервере
Функция ПолучитьДоступныеЭквайринговыеТерминалы() 
	
	Возврат ПараметрыДоговораЭквайринга.Терминалы.ВыгрузитьКолонку("ЭквайринговыйТерминал");
	
КонецФункции

	
