#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Перем Запрос, ТекстЗапроса;
	Перем Результат, ТаблицыДвижений;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаОплат.Ссылка.Дата КАК Период,
	|	ТаблицаОплат.Ссылка.Факультет КАК Факультет,
	|	ТаблицаОплат.Учащийся КАК Учащийся,
	|	ТаблицаОплат.ДоговорКонтрагента КАК Договор,
	|	ТаблицаОплат.ДатаОплаты КАК ДатаОплаты,
	|	ТаблицаОплат.Ссылка.ВалютаДокумента КАК Валюта,
	|	ТаблицаОплат.Сумма КАК Сумма,
	|	ТаблицаОплат.АвтоРасчет КАК АвтоРасчет,
	|	ТаблицаОплат.НачалоПериода КАК НачалоПериода,
	|	ТаблицаОплат.КонецПериода КАК КонецПериода
	|ИЗ
	|	Документ.ПлановыеПоступленияОплатыОбразование.Учащиеся КАК ТаблицаОплат
	|ГДЕ
	|	ТаблицаОплат.Ссылка = &Ссылка";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ПлановыеДатыОплатыОбразование", Результат[0].Выгрузить());
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	// В документах со строками аннуляции необходимо установить значение договора и контрагента по учащемуся.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПлановыеПоступленияОплатыОбразованиеУчащиеся.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПлановыеПоступленияОплатыОбразование.Учащиеся КАК ПлановыеПоступленияОплатыОбразованиеУчащиеся
	|ГДЕ
	|	ПлановыеПоступленияОплатыОбразованиеУчащиеся.Аннуляция = ИСТИНА
	|	И ПлановыеПоступленияОплатыОбразованиеУчащиеся.ДоговорКонтрагента = ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)";
		
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Документ.ПлановыеПоступленияОплатыОбразование";
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		Элемент = Блокировка.Добавить(ПолноеИмяОбъекта);
		Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		Элемент.Режим = РежимБлокировкиДанных.Исключительный;
		
		Попытка
		
			Блокировка.Заблокировать();
		
		Исключение
			
			// Объект не удается заблокировать - попробуем обработать его на следующей итерации.
			// Отдельно обрабатывать ошибку не требуется, т.к. в худшем случае обработчик зациклится
			// и прервется автоматически.
			ЗафиксироватьТранзакцию();
			Продолжить;
			
		КонецПопытки;
		
		// Проверка существования ссылки
		Если Не ОбщегоНазначения.СсылкаСуществует(Выборка.Ссылка) Тогда
			
			// Вероятно был удален раньше, чем обработчик дошел до него
			ЗафиксироватьТранзакцию();
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			Продолжить;
		
		КонецЕсли;
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Аннуляция", Истина);
		НайденныеСтроки = Объект.Учащиеся.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого СтрокаДокумента Из НайденныеСтроки Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("НаДату", Объект.Дата);
			Если ЗначениеЗаполнено(Объект.Факультет) Тогда
				Отбор.Вставить("Факультет", Объект.Факультет);
			КонецЕсли;
			
			ПараметрыАвтоподстановки = РаботаСоСтудентами.ПараметрыАвтоподстановкиДанныхПоСтуденту(СтрокаДокумента.Учащийся, "", Отбор);
			
			Если ПараметрыАвтоподстановки.Договоры.Количество() = 1 Тогда
				СтрокаДокумента.ДоговорКонтрагента = ПараметрыАвтоподстановки.Договоры[0]; // Единственный доступный вариант.
			КонецЕсли;
			Если ПараметрыАвтоподстановки.Плательщики.Количество() = 1 Тогда
				СтрокаДокумента.Контрагент = ПараметрыАвтоподстановки.Плательщики[0]; // Единственный доступный вариант.
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не Объект.Модифицированность() Тогда
			
			ЗафиксироватьТранзакцию();
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			Продолжить;
			
		КонецЕсли;
		
		
		Попытка
		
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать документ: %Документ% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Документы.НакладнаяНаОтпускИК,
				Выборка.Ссылка,
				ТекстСообщения);
			ВызватьИсключение;
		
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

