
#Область ОписаниеПеременных

&НаКлиенте
Перем ЗакрытьФормуБезусловно;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем ЕстьЗагруженныеФайлы;

&НаКлиенте
Перем ЕстьПроблемныеФорматы;

&НаКлиенте
Перем ОчередьОбновлений;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоставляемыеДанныеБГУ.ПараметрыЗагрузкиФорматовОбменаБанкКазначейство(Отказ, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекущуюСтраницуПомощника(НачальнаяСтраница());
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗакрытьФормуБезусловно = Истина ИЛИ ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	НСтрока = НСтр("ru = 'Закрыть помощник?'");
	
	Отказ = Истина;
	Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, НСтрока, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПоместитьВыбранныйФайл", ЭтотОбъект), АдресВременногоХранилища,, Истина, УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	Если ПустаяСтрока(АдресВременногоХранилища) И ПустаяСтрока(ИмяФайла) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран файл для загрузки'"),,"ИмяФайла");
			
		Возврат;
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресВременногоХранилища) Тогда 
		//значит уже загружен (возможно это веб клиент где загрузка идет сразу при выборе)
		//ДополнительныеПараметры.Этап = "Завершение";
		ПроверитьПомещенныйФайл();
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		
		// Есть только имя файла, надо проверить установку расширения
	
	Оповещение = Новый ОписаниеОповещения("ПоместитьФайлПоИмени", ЭтотОбъект);
    ОбщегоНазначенияКлиент.ПроверитьРасширениеРаботыСФайламиПодключено(Оповещение);
    
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ТекущаяСтраница = Элементы.СтраницыПомощника.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Элементы.СтраницаФайлОбновлений Тогда
		УстановитьТекущуюСтраницуПомощника(Элементы.СтраницаДоступныеОбновления);
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДоступныеОбновления Тогда
		Если Объект.ФайлыФорматов.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ЕстьОтмеченныеФайлы   = Ложь;
		
		Для каждого ФайлФорматов Из Объект.ФайлыФорматов Цикл
		
			Если ФайлФорматов.Загружать Тогда
			
				ЕстьОтмеченныеФайлы = Истина;
			
			КонецЕсли;
			
		КонецЦикла;	
		
		Если НЕ ЕстьОтмеченныеФайлы Тогда      
		
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ни один из файлов поставок в списке не выбран. Необходимо выбрать хотя бы один файл для загрузки форматов!'"),, "Объект.ФайлыФорматов[0].Загружать");	
			Отказ = Истина;
		
		Иначе
			УстановитьТекущуюСтраницуПомощника(Элементы.СтраницаХодЗагрузки);
			СтраницаОжидания_ПриПереходеДалее();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	ТекущаяСтраница = Элементы.СтраницыПомощника.ТекущаяСтраница;
	Если ТекущаяСтраница = Элементы.СтраницаДоступныеОбновления Тогда
		Если НеВыбиратьФайлы Тогда
			Возврат;
		КонецЕсли;	
		УстановитьТекущуюСтраницуПомощника(Элементы.СтраницаФайлОбновлений);
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаФайлОбновлений Тогда
		Возврат;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаХодЗагрузки Тогда
		ОчередьОбновлений = Неопределено;
		УстановитьТекущуюСтраницуПомощника(Элементы.СтраницаДоступныеОбновления);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЗакрытьФормуБезусловно = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиДоступныхОбновлений(Команда)
	Для Каждого СтрОбновления Из Объект.ФайлыФорматов Цикл
		СтрОбновления.Загружать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиДоступныхОбновлений(Команда)
	Для Каждого СтрОбновления Из Объект.ФайлыФорматов Цикл
		СтрОбновления.Загружать = Истина;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоместитьВыбранныйФайл(Результат, Адрес, ИмяВыбранногоФайла, ДополнительныеПараметры) Экспорт
	
	ИмяФайла = ИмяВыбранногоФайла;
	АдресВременногоХранилища =  Адрес;
	
	ПроверитьПомещенныйФайл();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьФайлПоИмени(Результат, ДополнительныеПараметры) Экспорт
	
	ПомещаемыеФайлы = Новый Массив;
	ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайла, АдресВременногоХранилища));
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьПомещениеФайлаПоИмени", ЭтотОбъект);

	НачатьПомещениеФайлов(Оповещение, ПомещаемыеФайлы,, Ложь, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПомещениеФайлаПоИмени(ПомещенныеФайлы, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ПомещенныеФайлы = Неопределено Тогда
		
		ИмяФайла = ПомещенныеФайлы[0].Имя;
		АдресВременногоХранилища =  ПомещенныеФайлы[0].Хранение;
		
	КонецЕсли;
	
	ПроверитьПомещенныйФайл();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПомещенныйФайл()
	
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
        Возврат;
    КонецЕсли;
    
    Попытка
		
		ФорматВерный = ПрочитатьФайлыИзЛокальныхКаталогов(АдресВременногоХранилища);	
        
    Исключение	
        ФорматВерный = Ложь;	
    КонецПопытки;
    
	Если ФорматВерный Тогда
		
		ОшибкаЧтенияФайла = "";
		
		УстановитьТекущуюСтраницуПомощника(Элементы.СтраницаДоступныеОбновления);

	Иначе	
		
		ОшибкаЧтенияФайла = НСтр("ru = 'Не удалось прочитать файл 
		|или файл не содержит доступных обновлений.'")
		
    КонецЕсли;
	
КонецПроцедуры	
	
&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьФормуБезусловно = Истина;
		Закрыть();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ВыполняетсяЗагрузка()
	Возврат ЗначениеЗаполнено(ОчередьОбновлений);
КонецФункции

&НаКлиенте
Процедура ОбновитьДоступностьКнопок()
	
	ТекущаяСтраница = Элементы.СтраницыПомощника.ТекущаяСтраница;
	
	ДоступностьНазад = Истина;
	ДоступностьДалее = Истина;
	
	Если ТекущаяСтраница = Элементы.СтраницаФайлОбновлений Тогда
		ДоступностьНазад = Ложь;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДоступныеОбновления И НеВыбиратьФайлы Тогда
		ДоступностьНазад = Ложь;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаХодЗагрузки Тогда
		ДоступностьНазад = НЕ ВыполняетсяЗагрузка();
		ДоступностьДалее = Ложь;
		Элементы.Закрыть.Доступность = НЕ ВыполняетсяЗагрузка();
	КонецЕсли;
	
	Элементы.Назад.Доступность = ДоступностьНазад;
	Элементы.Далее.Доступность = ДоступностьДалее;
	
КонецПроцедуры

&НаКлиенте
Функция НачальнаяСтраница()
	
	Если НеВыбиратьФайлы Тогда
		Возврат Элементы.СтраницаДоступныеОбновления;
	Иначе
		Возврат Элементы.СтраницаФайлОбновлений;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура УстановитьТекущуюСтраницуПомощника(Знач НоваяСтраница)
	
	Элементы.СтраницыПомощника.ТекущаяСтраница = НоваяСтраница;
	ТекущийЗаголовокСтраницы    = НоваяСтраница.Заголовок;
	//ТекущийПодзаголовокСтраницы = НоваяСтраница.Подсказка;
	
	ОбновитьДоступностьКнопок();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПомещенныеФайлыНаСервере(Знач ПомещенныеФайлы)
	
	ДиспетчерФайлов = РеквизитФормыВЗначение("Объект");
	
	Для каждого ПомещенныйФайл Из ПомещенныеФайлы Цикл
	   	
		Попытка	
	    	ФорматВерный = ДиспетчерФайлов.ПолучитьСвойстваФайлаЗагрузки(ПомещенныйФайл.Хранение);	
		
		Исключение	
			ФорматВерный = Ложь;	
		КонецПопытки;
		
					
		Если Не(ФорматВерный) Тогда
			
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось прочитать файл '") + ИмяФайла);
			
		КонецЕсли;
    		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДиспетчерФайлов, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьЗагрузкуОбновленияИзОчереди()
	
	Если ЗначениеЗаполнено(ОчередьОбновлений) Тогда
		
		ВыполнитьЗагрузку(ОчередьОбновлений[0].АдресФайлаВХранилище, ОчередьОбновлений[0].ИмяФайла);
	Иначе
		ОчередьОбновлений = Неопределено;
		Если ЕстьЗагруженныеФайлы Тогда
			Если ЕстьПроблемныеФорматы Тогда
				Протокол = "Форматы частично импортированы в систему";
			Иначе
				Протокол = "Форматы успешно импортированы в систему";
			КонецЕсли;
			Оповестить("ЗагрузкаФорматовОбменаБанкиКС",,ЭтаФорма);
		Иначе
		    Протокол = "Не удалось импортировать ни одного формата";
		КонецЕсли; 

	КонецЕсли;
	
КонецПРоцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			ЗагрузитьПодготовленныеДанные();
			Если Не(ЗагрузкаУспешна) Тогда			
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось загрузить файл '") + ОчередьОбновлений[0]);		
				ЕстьПроблемныеФорматы = Истина;
			Иначе			
				ЕстьЗагруженныеФайлы  = Истина;			
		    КонецЕсли;
	       
			ОчередьОбновлений.Удалить(0);
			ЗапланироватьЗагрузкуОбновленияИзОчереди();
			
			Возврат;
		КонецЕсли;

	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	ПодключитьОбработчикОжидания(
		"Подключаемый_ПроверитьВыполнениеЗадания", 
		ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
		Истина);
КонецПроцедуры

&НаСервере
Функция ПроизвестиЗагрузкуИзФайла(АдресФайла)
	
	Файл = ПолучитьИзВременногоХранилища(АдресФайла);
	
	ПараметрыОбработки = Новый Структура("ФайлЗагрузки, УникальныйИдентификатор, НеОбновлятьВидОбмена", Файл, УникальныйИдентификатор, НеОбновлятьВидОбмена);
	

	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ЗаданиеВыполнено = Ложь;	
   	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда

		ФоновыеЗаданияОбменСКазначейскимиИБанковскимиСистемами.ПомощникЗагрузкиФорматовОбменаБанкиКСЗагрузитьФайлВОбщемМодуле(ПараметрыОбработки, АдресХранилища);
		ЗагрузитьПодготовленныеДанные();
      	Возврат Истина;	
	
	КонецЕсли;		
		
	НаименованиеЗадания = НСтр("ru = 'Загрузка форматов обмена с банками и казначейскими системами'");
		
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(ПараметрыОбработки);
	ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилища);

		
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
	
	
	Задание = ФоновыеЗадания.Выполнить(
	"ФоновыеЗаданияОбменСКазначейскимиИБанковскимиСистемами.ПомощникЗагрузкиФорматовОбменаБанкиКСЗагрузитьФайлВОбщемМодуле", 
		ПараметрыЭкспортнойПроцедуры, , НаименованиеЗадания);
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение		
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
		
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		ЗаданиеВыполнено = Истина; 
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;	
	Возврат ЗаданиеВыполнено;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗагрузку(Знач АдресФайла,Знач ИмяФайла)
	
	ЗаданиеВыполнено = ПроизвестиЗагрузкуИзФайла(АдресФайла);
	
	Если ЗаданиеВыполнено Тогда
		Если Не(ЗагрузкаУспешна) Тогда			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось загрузить файл '") + ИмяФайла);		
			ЕстьПроблемныеФорматы = Истина;
		Иначе			
			ЕстьЗагруженныеФайлы  = Истина;			
	    КонецЕсли;
        ОчередьОбновлений.Удалить(0);

		ЗапланироватьЗагрузкуОбновленияИзОчереди();
		Возврат;
	КонецЕсли;

	ПараметрыОбработчикаОжидания = Новый Структура(
		"МинимальныйИнтервал,
		|МаксимальныйИнтервал,
		|ТекущийИнтервал,
		|КоэффициентУвеличенияИнтервала", 
		1, 15, 1, 1.4);
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация",
		Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания), ЭтаФорма);
	
КонецПроцедуры
	
&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузкаУспешна = Результат.Результат;
	
КонецПроцедуры

//Длительные операции конец

&НаСервере
Функция ПрочитатьФайлыИзЛокальныхКаталогов(Знач АдресВременногоХранилища)

	ДиспетчерФайлов = РеквизитФормыВЗначение("Объект");	
	Результат  		= ДиспетчерФайлов.ПолучитьСвойстваФайлаЗагрузки(АдресВременногоХранилища);
	ЗначениеВРеквизитФормы(ДиспетчерФайлов, "Объект");
	
	Возврат Результат;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Выделяет имя файла из полного имени
//
Функция ПолучитьИмяИзПолногоИмени(Имя) Экспорт
	
	Результат = Имя;
	ПозицияСлеш = СтрДлина(Результат);
	
	
	Пока ((ПозицияСлеш > 1) И (Сред(Результат, ПозицияСлеш, 1) <> "\") И 
		((Сред(Результат, ПозицияСлеш, 1) <> "/"))) Цикл
		
		ПозицияСлеш = ПозицияСлеш - 1;	
	КонецЦикла;
	
	
	Если (ПозицияСлеш > 1) Тогда
		Результат = Сред(Результат, ПозицияСлеш + 1);
	КонецЕсли;
	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СтраницаОжидания_ПриПереходеДалее()
	
	Если Объект.ФайлыФорматов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьЗагруженныеФайлы  = Ложь;
	ЕстьПроблемныеФорматы = Ложь;
	ОчередьОбновлений = Новый Массив;
	Для каждого ФайлФорматов Из Объект.ФайлыФорматов Цикл
	
		Если НЕ ФайлФорматов.Загружать Тогда
		
			Продолжить;
		
		КонецЕсли; 
		ОчередьОбновлений.Добавить(ФайлФорматов);
	КонецЦикла;
	
	ЗапланироватьЗагрузкуОбновленияИзОчереди();
		
КонецПроцедуры

#КонецОбласти

