#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем УИДЗамера;

// Псевдоконстанты
&НаКлиенте
Функция ДЛИТЕЛЬНОСТЬ_ОЖИДАНИЯ()	Возврат 1; КонецФункции

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартныеОтчеты.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ДобавитьГруппировкуЕПСБУ("КПС", "(1-17) Классификационный признак счета");
	ДобавитьГруппировкуЕПСБУ("КФО", "(18) Код вида финансового обеспечения");
	ДобавитьГруппировкуЕПСБУ("Счет","(19-23) Код синтетического счета");
	ДобавитьГруппировкуЕПСБУ("КЭК", "(24-26) Код экономической классификации");
    СтандартныеОтчеты.ЗаполнитьПодписиПоУмолчанию(Отчет.Подписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
		
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Если НЕ СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая Тогда
			ОбновитьОбработчикОжидания();
		КонецЕсли;
	КонецЕсли;
	
	СтандартныеОтчетыКлиент.ПриОткрытии(ЭтаФорма);
	
	РассчитатьПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = НЕ Отчет.РежимРасшифровки;
	
	ВариантМодифицирован                    = Ложь;
	ПользовательскиеНастройкиМодифицированы = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	СтандартныеОтчеты.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если Не КомпоновщикИнициализирован Тогда
		ПользовательскиеНастройки = ПоместитьВоВременноеХранилище(Настройки, УникальныйИдентификатор);
	КонецЕсли;
	
	СтандартныеОтчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	ЭтаФорма.Элементы.Подразделение.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	СтандартныеОтчеты.ДобавитьОтборПоОрганизации(ЭтаФорма.Отчет);
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ----------------------------------------------------------------------------
&НаКлиенте
Процедура ИзменениеПериода(Элемент)
	
	СтандартныеОтчетыКлиент.УстановитьВидМежотчетногоПериодаПоДате(Отчет);
	
    СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПериодаПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиент.УстановитьДатыПоВидуПериода(Отчет);
	
	Модифицированность = Истина;
	
	ОбновитьТекстЗаголовка(ЭтотОбъект);
		
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);

	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоУказанныйПериодПриИзменении(Элемент)
	
	
	СтандартныеОтчетыКлиент.УстановитьДатыПоВидуПериода(Отчет);
	
	Модифицированность = Истина;
	
	ОбновитьТекстЗаголовка(ЭтотОбъект);
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.ИзменитьОтборПоОрганизации(Отчет);
    СтандартныеОтчетыКлиент.ПриИзмененииОрганизации(Отчет.Организация, Отчет.Подписи);
	ОбновитьТекстЗаголовка(ЭтаФорма);
	ИзменениеКонтроловВлияющееНаРезультат(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.ИзменитьОтборПоПодразделению(Отчет);
    СтандартныеОтчетыКлиент.ПриИзмененииОрганизации(Отчет.Организация, Отчет.Подписи);
	ОбновитьТекстЗаголовка(ЭтаФорма);
	ИзменениеКонтроловВлияющееНаРезультат(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеКонтроловВлияющееНаРезультат(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартныеОтчетыКлиент.ОбработкаРасшифровкиСтандартногоОтчета(ЭтаФорма, Элемент, Расшифровка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	// Не будем обрабатывать нажатие на правую кнопку мыши.
	// Покажем стандартное контекстное меню ячейки табличного документа.
	Расшифровка = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамически", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписиВыводитьПриИзменении(Элемент)

    СтандартныеОтчетыКлиент.ПодписиВыводитьПриИзменении(Элемент.Родитель.ТекущиеДанные, ЭтаФорма.Результат);

КонецПроцедуры

&НаКлиенте
Процедура ПодписиПередНачаломИзменения(Элемент, Отказ)

    Отказ = СтандартныеОтчетыКлиент.ПодписиПередНачаломИзменения(Элемент.ТекущийЭлемент, Элемент.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ПодписиСотрудникПриИзменении(Элемент)

    СтандартныеОтчетыКлиент.ПодписиСотрудникПриИзменении(Элемент.Родитель.ТекущиеДанные, ЭтаФорма.Результат);

КонецПроцедуры

// Оформление

&НаКлиенте
Процедура МакетОформленияПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьПараметрВывода(Отчет.КомпоновщикНастроек.Настройки, "МакетОформления", МакетОформления);
	
	ИзменениеКонтроловВлияющееНаРезультат(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЗаголовокПриИзменении(Элемент)

	ОбластьПоиска = Результат.Области.Найти("Заголовок");
	Если ОбластьПоиска = Неопределено Тогда
		СформироватьОтчет(Ложь);
	Иначе
		ОбластьПоиска.Видимость = ВыводитьЗаголовок;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПодвалПриИзменении(Элемент)
	
	ОбластьПоиска = Результат.Области.Найти("Подписи");
	Если ОбластьПоиска = Неопределено Тогда
		СформироватьОтчет(Ложь);
	Иначе
		ОбластьПоиска.Видимость = ВыводитьПодвал;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ ГРУППИРОВКА ЕПСБУ

&НаКлиенте
Процедура ГруппировкаЕПСБУПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.Группировка = "Счет" Тогда
		Отказ = Истина;
	КонецЕсли
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ ОТБОРЫ

&НаКлиенте
Процедура ОтборыПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
	ИзменениеКонтроловВлияющееНаРезультат(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	СтандартныеОтчетыКлиент.ОтборыПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);

КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломИзменения(Элемент, Отказ)
	
	СтандартныеОтчетыКлиент.ОтборыПередНачаломИзменения(ЭтаФорма, Элемент, Отказ);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
    Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период.ДатаНачала = Отчет.НачалоПериода;
    Диалог.Период.ДатаОкончания = Отчет.КонецПериода;
    Диалог.Показать(Новый ОписаниеОповещения("ЗакончилиУстановитьПериод", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончилиУстановитьПериод(Период, ДополнительныеПараметры) Экспорт
    
    Если Период <> Неопределено Тогда
		
		Отчет.НачалоПериода = Период.ДатаНачала;
        Отчет.КонецПериода  = Период.ДатаОкончания;
		
		Модифицированность = Истина;
		
		СтандартныеОтчетыКлиент.УстановитьВидМежотчетногоПериодаПоДате(Отчет);
		
		ОбновитьТекстЗаголовка(ЭтотОбъект);
		
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);

    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ОчиститьСообщения();
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	
	УИДЗамера = ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Ложь, "ФормированиеОборотноСальдоваяВедомостьПоСчету");
	
	РезультатВыполнения = СформироватьОтчетСервер();
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
		ОбновитьОбработчикОжидания();
	Иначе
		ЗафиксироватьДлительностьКлючевойОперации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)
	
	Элементы.ГруппаПанельНастроек.Видимость = Не Элементы.ГруппаПанельНастроек.Видимость;
	Элементы.ПанельНастроек.Пометка = Элементы.ГруппаПанельНастроек.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаЕПСБУУстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.ГруппировкаЕПСБУ Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
	ИзменениеКонтроловВлияющееНаРезультат(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаЕПСБУСнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.ГруппировкаЕПСБУ Цикл
		Если СтрокаТаблицы.Группировка <> "Счет" Тогда
			СтрокаТаблицы.Использование = Ложь;
		КонецЕсли
	КонецЦикла;
	
	ИзменениеКонтроловВлияющееНаРезультат(0);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ГРУППЫ РЕГИСТРЫ УЧЕТА

&НаКлиенте
Процедура Подключаемый_Команда(Команда)
	
	РегистрыУчетаКлиент.ОбработчикКомандыРаботыСРегистромУчета(ЭтотОбъект, Команда, "Результат");

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики команд расчета показателей.

&НаКлиенте
Процедура РассчитатьСумму(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличество(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСреднее(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМинимум(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМаксимум(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВсеПоказатели(Команда)
	УстановитьВидимостьПоказателей(Не Элементы.РассчитатьВсеПоказатели.Пометка);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПоказатели(Команда)
	УстановитьВидимостьПоказателей(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)
	
	Отчет = Форма.Отчет;
	
	ЗаголовокОтчета = "Оборотный баланс" + СтандартныеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(Отчет.НачалоПериода, Отчет.КонецПериода,, Отчет.ТипПериода, Отчет.ТолькоУказанныйПериод);

	Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
	
	Если Режим = "Выбор" Тогда
		Для Каждого ДоступноеПоле Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если ДоступноеПоле.Ресурс Тогда
				СписокПолей.Добавить(Строка(ДоступноеПоле.Поле));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ФОУчетПоПодразделениям Тогда
		СписокПолей.Добавить("Подразделение");
	КонецЕсли;
	
	Если Не ФОУчетПоИФО Тогда
		СписокПолей.Добавить("ИФО");
	КонецЕсли;
	
	Если Не ФОВалютныйУчет Тогда
		СписокПолей.Добавить("Валюта");
	КонецЕсли;

	Если Режим = "Выбор" Тогда
		СписокПолей.Добавить("СальдоНаНачалоПериода");
		СписокПолей.Добавить("ОборотыЗаПериод");
		СписокПолей.Добавить("СальдоНаКонецПериода");
	ИначеЕсли Режим = "Отбор" Тогда
		СтандартныеОтчетыКлиент.ДобавитьПоляРесурсовВЗапрещенныеПоля(ЭтаФорма, СписокПолей);
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаСервере
Функция ПодготовитьПараметрыОтчета()

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода"                    , Отчет.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода"                     , Отчет.КонецПериода);
	ПараметрыОтчета.Вставить("Организация"                      , Отчет.Организация);
	ПараметрыОтчета.Вставить("Подразделение"					, Отчет.Подразделение);
	ПараметрыОтчета.Вставить("ПоказыватьВидКПС"                 , Отчет.ПоказыватьВидКПС);
	ПараметрыОтчета.Вставить("ПоказательБУ"                     , Отчет.ПоказательБУ);
	ПараметрыОтчета.Вставить("РежимРасшифровки"					, Отчет.РежимРасшифровки);
	ПараметрыОтчета.Вставить("ТипПериода"                 		, Отчет.ТипПериода);
	ПараметрыОтчета.Вставить("ТолькоУказанныйПериод"            , Отчет.ТолькоУказанныйПериод);
	ПараметрыОтчета.Вставить("ГруппировкаЕПСБУ"					, Отчет.ГруппировкаЕПСБУ.Выгрузить());
	ПараметрыОтчета.Вставить("Подписи"							, Отчет.Подписи.Выгрузить());
	ПараметрыОтчета.Вставить("ВыводитьЗаголовок"                , ВыводитьЗаголовок);
	ПараметрыОтчета.Вставить("ВыводитьПодвал"                   , ВыводитьПодвал);
	ПараметрыОтчета.Вставить("ДанныеРасшифровки"                , ДанныеРасшифровки);
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных"            , ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных));
	ПараметрыОтчета.Вставить("ИдентификаторОтчета"              , СтандартныеОтчеты.ИмяОтчетаПоИмениФормы(ЭтаФорма));
	ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных"        , Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрыОтчета.Вставить("НаборПоказателей"                 , Отчеты[ПараметрыОтчета.ИдентификаторОтчета].ПолучитьНаборПоказателей());
	ПараметрыОтчета.Вставить("ВыводитьПолностью"				, Истина);
	ПараметрыОтчета.Вставить("ВысотаШапки"						, 0);
	ПараметрыОтчета.Вставить("ВременныеДанныеОтчета"			, 0);
	ПараметрыОтчета.Вставить("КоличествоГруппировок"			, 0);
	
	Возврат ПараметрыОтчета;

КонецФункции

&НаСервере
Процедура ИнициализацияКомпоновщикаНастроек()
	
	СтандартныеОтчеты.ИнициализацияКомпоновщикаНастроекФ(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетСервер() Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Новый Структура("ЗаданиеВыполнено, ОтказПроверкиЗаполнения", Истина, Истина);
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", ВыводитьЗаголовок);
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал"   , ВыводитьПодвал);
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("УникальныйИдентификатор" , ЭтаФорма.УникальныйИдентификатор);
	
	Если Не	КомпоновщикИнициализирован Тогда
		ИнициализацияКомпоновщикаНастроек();
	КонецЕсли;
	
	ПараметрыОтчета = ПодготовитьПараметрыОтчета();
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	ИБФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	ИдентификаторЗадания = Неопределено;
	Если ИБФайловая Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		СтандартныеОтчеты.ВывестиОтчетФ(ПараметрыОтчета, АдресХранилища);
		РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			"СтандартныеОтчеты.ВывестиОтчетФ",
			ПараметрыОтчета,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выполнение отчета: %1'"), ПараметрыОтчета.ИдентификаторОтчета));
		
		АдресХранилища       = РезультатВыполнения.АдресХранилища;
		ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
	КонецЕсли;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма, Истина);
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Результат = РезультатВыполнения.Результат;
	ДанныеРасшифровки = РезультатВыполнения.ДанныеРасшифровки;

	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	СтандартныеОтчеты.УстановитьКолонтитулыПоУмолчанию(Результат, ОбъектОтчет.Метаданные().Синоним, Строка(ПользователиКлиентСервер.АвторизованныйПользователь()), Отчет.Организация);
	
	ИдентификаторЗадания = Неопределено;

	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОбработчикОжидания()

	ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ДЛИТЕЛЬНОСТЬ_ОЖИДАНИЯ(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()

	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			ЗагрузитьПодготовленныеДанные();
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
			ЗафиксироватьДлительностьКлючевойОперации();
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания",
				ПараметрыОбработчикаОжидания.ТекущийИнтервал,
				Истина);
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьДлительностьКлючевойОперации()
	
	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(УИДЗамера);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки) Экспорт
	
	Если ЗаполняемыеНастройки.Свойство("Показатели") Тогда
		Если ЗаполняемыеНастройки.Показатели Тогда
			// Управление показателями
			Отчет.ПоказательБУ            = Истина;
			Отчет.ПоказательВалютнаяСумма = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьГруппировкуЕПСБУ(ИмяГруппировки, Представление = "", Использование = Истина)
	
	Строка = Отчет.ГруппировкаЕПСБУ.Добавить();
	Строка.Группировка = ИмяГруппировки;
	Строка.Использование = Использование;
	Если Представление = "" Тогда
		Строка.Представление = ИмяГруппировки;
	Иначе
		Строка.Представление = Представление;
	КонецЕсли;
	
КонецПроцедуры

#Область РасчетПоказателейВыделенныхЯчеек

// Выполняет расчет и вывод показателей выделенной области ячеек.
// См. обработчик события ОтчетТабличныйДокументПриАктивизацииОбласти.
//
&НаКлиенте
Процедура РассчитатьПоказателиДинамически()
	Перем ТекущаяКоманда;
	
	КомандыПоказателей = КомандыПоказателей();
	Для Каждого Команда Из КомандыПоказателей Цикл 
		Если Элементы[Команда.Ключ].Пометка Тогда 
			ТекущаяКоманда = Команда.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьПоказатели(ТекущаяКоманда);
КонецПроцедуры

// Выполняет расчет и вывод показателей выделенных областей ячеек табличного документа.
//
// Параметры:
//  ТекущаяКоманда - Строка - имя команды расчета показателя, например, "РассчитатьСумму".
//                      Определяет, какой показатель является основным.
//
&НаКлиенте
Процедура РассчитатьПоказатели(ТекущаяКоманда = "РассчитатьСумму")
	// Расчет показателей.
	ПараметрыРасчета = ОбщегоНазначенияБГУКлиент.ПараметрыРасчетаПоказателейЯчеек(Элементы.Результат);
	Если ПараметрыРасчета.РассчитатьНаСервере Тогда 
		РасчетныеПоказатели = РасчетныеПоказателиСервер(ПараметрыРасчета);
	Иначе
		РасчетныеПоказатели = ОбщегоНазначенияБГУКлиентСервер.РасчетныеПоказателиЯчеек(
			Результат, ПараметрыРасчета.ВыделенныеОбласти);
	КонецЕсли;
	
	// Установка значений показателей.
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РасчетныеПоказатели);
	
	// Переключение и форматирование показателей.
	КомандыПоказателей = КомандыПоказателей();
	Для Каждого Команда Из КомандыПоказателей Цикл 
		Элементы[Команда.Ключ].Пометка = Ложь;
		
		ЗначениеПоказателя = РасчетныеПоказатели[Команда.Значение];
		РазрядностьПоказателя = Мин(СтрДлина(Макс(ЗначениеПоказателя, -ЗначениеПоказателя) % 1) - 2, 4);
		
		Элементы[Команда.Значение].ФорматРедактирования = "ЧДЦ=" + РазрядностьПоказателя + "; ЧРГ=' '; ЧН=0";
	КонецЦикла;
	Элементы[ТекущаяКоманда].Пометка = Истина;
	
	// Вывод основного показателя.
	ТекущийПоказатель = КомандыПоказателей[ТекущаяКоманда];
	Показатель = ЭтотОбъект[ТекущийПоказатель];
	Элементы.Показатель.ФорматРедактирования = Элементы[ТекущийПоказатель].ФорматРедактирования;
	Элементы.ГруппаВидыПоказателей.Картинка = БиблиотекаКартинок[ТекущийПоказатель];
КонецПроцедуры

// Рассчитывает показатели числовых ячеек в табличном документе.
//  см. ОтчетыКлиентСервер.РасчетныеПоказателиЯчеек.
//
&НаСервере
Функция РасчетныеПоказателиСервер(ПараметрыРасчета)
	Возврат ОбщегоНазначенияБГУКлиентСервер.РасчетныеПоказателиЯчеек(Результат, ПараметрыРасчета.ВыделенныеОбласти);
КонецФункции

// Определяет соответствие между командами расчета показателей и показателями.
//
// Возвращаемое значение:
//   Соответствие - Ключ - имя команды, Значение - имя показателя.
//
&НаКлиенте
Функция КомандыПоказателей()
	КомандыПоказателей = Новый Соответствие();
	КомандыПоказателей.Вставить("РассчитатьСумму", "Сумма");
	КомандыПоказателей.Вставить("РассчитатьКоличество", "Количество");
	КомандыПоказателей.Вставить("РассчитатьСреднее", "Среднее");
	КомандыПоказателей.Вставить("РассчитатьМинимум", "Минимум");
	КомандыПоказателей.Вставить("РассчитатьМаксимум", "Максимум");
	
	Возврат КомандыПоказателей;
КонецФункции

// Управляет признаком видимости панели расчетных показателей.
//
// Параметры:
//  Видимость - Булево - Признак включения / выключения видимости панели показателей.
//              См. также Синтакс-помощник: ГруппаФормы.Видимость.
//
&НаКлиенте
Процедура УстановитьВидимостьПоказателей(Видимость)
	Элементы.ОбластьПоказателей.Видимость = Видимость;
	Элементы.РассчитатьВсеПоказатели.Пометка = Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочте(Команда)
	
	ОтправкаПочтовыхСообщенийКлиент.ОтправитьОтчет(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти