
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Учащийся.Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрСведений.ПлановыеДатыОплатыОбразование";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПлановыеДатыОплатыОбразование.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.ПлановыеДатыОплатыОбразование КАК ПлановыеДатыОплатыОбразование
	|ГДЕ
	|	ПлановыеДатыОплатыОбразование.Договор = ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	И ПлановыеДатыОплатыОбразование.Регистратор ССЫЛКА Документ.ПлановыеПоступленияОплатыОбразование";
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);

КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрСведений.ПлановыеДатыОплатыОбразование";
	ПолноеИмяДокумента = "Документ.ПлановыеПоступленияОплатыОбразование";
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьРегистраторыРегистраДляОбработки(
		Параметры.Очередь, ПолноеИмяДокумента, ПолноеИмяРегистра);
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ПредставлениеРегистратора = Строка(Выборка.Регистратор);
			ЗаполнитьДоговорВДвижениях(Выборка.Регистратор);
		
		Исключение
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать движения документа: %1 по причине:
					|%2'"), 
					ПредставлениеРегистратора, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.ПлановыеДатыОплатыОбразование, , ТекстСообщения);
		КонецПопытки;
				
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ЗаполнитьДоговорВДвижениях(Документ)

	НачатьТранзакцию();
	Попытка
	
		// Блокируем объект от изменения другими сеансами.
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПлановыеДатыОплатыОбразование.НаборЗаписей");
		ЭлементБлокировки.УстановитьЗначение("Регистратор", Документ);
		Блокировка.Заблокировать();
		
		ДокументОбъект = Документ.ПолучитьОбъект();
		
		Если ДокументОбъект <> Неопределено И ЕстьНезаполненныеДоговорыВДвижениях(Документ) Тогда
			
			ДокументОбъект.Заблокировать();
			
			ДополнительныеСвойства = Новый Структура;
			ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);
			
			ТипДокумента = ТипЗнч(Документ);
			Если ТипДокумента = Тип("ДокументСсылка.ПлановыеПоступленияОплатыОбразование") Тогда
				Документы.ПлановыеПоступленияОплатыОбразование.ИнициализироватьДанныеДокумента(Документ, ДополнительныеСвойства);
			Иначе
				ВызватьИсключение "Неправильный тип документа " + ТипДокумента;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ПлановыеДатыОплатыОбразование.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Документ);
			НаборЗаписей.Загрузить(ДополнительныеСвойства.ТаблицыДляДвижений.ПлановыеДатыОплатыОбразование);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
		Иначе
			// Документ удален или движения документа не соответствуют ожидаемым
			ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
			ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрСведений.ПлановыеДатыОплатыОбразование";
			ДополнительныеПараметры.ЭтоДвижения = Истина;
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Документ, ДополнительныеПараметры);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Функция ЕстьНезаполненныеДоговорыВДвижениях(Документ)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.ПлановыеДатыОплатыОбразование КАК ПлановыеДатыОплатыОбразование
	|ГДЕ
	|	ПлановыеДатыОплатыОбразование.Регистратор = &Регистратор
	|	И ПлановыеДатыОплатыОбразование.Договор = ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Регистратор", Документ);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли

