
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Формирует тексты запросов для контроля изменений записанных движений регистров.
//
// Параметры:
//  ТекстыЗапроса - СписокЗначений - список текстов запросов и их имен.
//
Процедура ИнициализироватьДанныеКонтроляИзменений(ТекстыЗапроса) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПрослеживаемыеТоварыОстатки.КоличествоОстаток КАК Количество,
	|	ПрослеживаемыеТоварыОстатки.Организация КАК Организация,
	|	ПрослеживаемыеТоварыОстатки.Номенклатура КАК Номенклатура,
	|	ПрослеживаемыеТоварыОстатки.ВариантКомплекта КАК ВариантКомплекта,
	|	ПрослеживаемыеТоварыОстатки.Комплектующее КАК Комплектующее,
	|	ПрослеживаемыеТоварыОстатки.РНПТ КАК РНПТ,
	|	ПрослеживаемыеТоварыОстатки.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	РегистрНакопления.ПрослеживаемыеТовары.Остатки(
	|			&МоментВремени,
	|			(Организация, Номенклатура, ВариантКомплекта, Комплектующее, РНПТ, СтранаПроисхождения) В
	|				(ВЫБРАТЬ
	|					ПрослеживаемыеТоварыИзменения.Организация,
	|					ПрослеживаемыеТоварыИзменения.Номенклатура,
	|					ПрослеживаемыеТоварыИзменения.ВариантКомплекта,
	|					ПрослеживаемыеТоварыИзменения.Комплектующее,
	|					ПрослеживаемыеТоварыИзменения.РНПТ,
	|					ПрослеживаемыеТоварыИзменения.СтранаПроисхождения
	|				ИЗ
	|					ПрослеживаемыеТоварыИзменения КАК ПрослеживаемыеТоварыИзменения)) КАК ПрослеживаемыеТоварыОстатки
	|ГДЕ
	|	ПрослеживаемыеТоварыОстатки.КоличествоОстаток < 0";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ПрослеживаемыеТовары");
	
КонецПроцедуры

// Подготавливает сообщения пользователю при наличии ошибок контроля изменений записанных движений регистров.
//
// Параметры:
//  РезультатыКонтроля - Структура - таблицы с результатами контроля изменений
//  Ошибки - см. ДобавитьОшибкуПользователю.Ошибки
//
Процедура ПодготовитьСообщенияОРезультатахКонтроляИзменений(РезультатыКонтроля, Ошибки) Экспорт
	
	ШаблонСообщения = "Номенклатура: %1, Комплектующее: %2, РНПТ: %3, Страна происхождения: %4 - не хватает количества %5";
	
	Для Каждого СтрокаОшибки Из РезультатыКонтроля Цикл
		
		ТекстСообщения = СтрШаблон(ШаблонСообщения,
		СтрокаОшибки.Номенклатура,
		СтрокаОшибки.Комплектующее,
		СокрЛП(СтрокаОшибки.РНПТ),
		СтрокаОшибки.СтранаПроисхождения,
		СтрокаОшибки.Количество);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,,ТекстСообщения,,,,);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
