
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	УстановитьУсловноеОформление();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Должно указываться в режиме предприятия
	ОбъектДокумент = Справочники.ВидыОбъектовРеестраИмущества.НайтиПоНаименованию("Документы");
	
	Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
		РеквизитФормыВЗначение("Объект").Заполнить(Параметры.ЗначенияЗаполнения);
		//ЗаполнитьНаСервере();
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ВидОтветственногоЛица = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель;
		ОтветственноеЛицо = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(ВидОтветственногоЛица, Объект.Организация, Объект.Дата);
		Объект.Руководитель = ОтветственноеЛицо.ОтветственноеЛицоСсылка;	
	КонецЕсли;
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьЭлементовФормы();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ОбъектыРеестраИмущества.Форма.ФормаВыбора" Тогда
		НоваяСтрока = Объект.ДокументыОснования.Добавить();
		НоваяСтрока.ДокументОснование = ВыбранноеЗначение;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидЗаписиПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Отказ = Ложь;
		
	Если Не ЗначениеЗаполнено(Объект.ДокументИсточник) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Поле ""Текущая версия документа"" не заполнено'"),, "Объект.ДокументИсточник",, Отказ); 
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Поле ""Предыдущая версия документа"" не заполнено'"),, "Объект.ДокументОснование",, Отказ); 
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборДокументов(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, Отбор", Ложь, Новый Структура("Владелец", ОбъектДокумент));
	ОткрытьФорму("Справочник.ОбъектыРеестраИмущества.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление() Экспорт
	
	УсловноеОформление.Элементы.Очистить();
	
	// Раскрас содержания изменений
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СодержаниеИзменений");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ЗаписьОбИсключении");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.СодержаниеИзменений.Доступность = Не Объект.ЗаписьОбИсключении;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	

	Если Не Объект.ЗаписьОбИсключении Тогда
	
		Запрос = Новый Запрос;					   
		Запрос.Текст = "ВЫБРАТЬ
		               |	РеквизитыСведенийОбИмуществе.Ссылка КАК Реквизит
		               |ПОМЕСТИТЬ ВТ_Реквизиты
		               |ИЗ
		               |	Справочник.РеквизитыСведенийОбИмуществе КАК РеквизитыСведенийОбИмуществе
		               |ГДЕ
		               |	РеквизитыСведенийОбИмуществе.Владелец = &ВидКарты
		               |	И НЕ РеквизитыСведенийОбИмуществе.ПометкаУдаления
		               |	И НЕ РеквизитыСведенийОбИмуществе.ЭтоГруппа
		               |	И РеквизитыСведенийОбИмуществе.ВидРеквизита <> ЗНАЧЕНИЕ(Перечисление.ВидыРеквизитовСведенийОбИмуществе.ДекорацияНадпись)
		               |	И НЕ РеквизитыСведенийОбИмуществе.Ссылка В ИЕРАРХИИ
		               |				(ВЫБРАТЬ
		               |					Р.Ссылка
		               |				ИЗ
		               |					Справочник.РеквизитыСведенийОбИмуществе КАК Р
		               |				ГДЕ
		               |					Р.ЭтоГруппа
		               |					И Р.ПометкаУдаления
		               |					И Р.Владелец = &ВидКарты)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РегистрацияСведенийОбИмуществеЗначенияРеквизитов.РеквизитСведений,
		               |	РегистрацияСведенийОбИмуществеЗначенияРеквизитов.Значение
		               |ПОМЕСТИТЬ ВТ_Источник
		               |ИЗ
		               |	Документ.РегистрацияСведенийОбИмуществе.ЗначенияРеквизитов КАК РегистрацияСведенийОбИмуществеЗначенияРеквизитов
		               |ГДЕ
		               |	РегистрацияСведенийОбИмуществеЗначенияРеквизитов.Ссылка = &ДокументИсточник
		               |	И РегистрацияСведенийОбИмуществеЗначенияРеквизитов.РеквизитСведений В
		               |			(ВЫБРАТЬ
		               |				ВТ_Реквизиты.Реквизит
		               |			ИЗ
		               |				ВТ_Реквизиты)
		               |	И РегистрацияСведенийОбИмуществеЗначенияРеквизитов.ИдентификаторСтрокиТабличнойЧасти = """"
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РегистрацияСведенийОбИмуществеЗначенияРеквизитов.РеквизитСведений,
		               |	РегистрацияСведенийОбИмуществеЗначенияРеквизитов.Значение
		               |ПОМЕСТИТЬ ВТ_Основание
		               |ИЗ
		               |	Документ.РегистрацияСведенийОбИмуществе.ЗначенияРеквизитов КАК РегистрацияСведенийОбИмуществеЗначенияРеквизитов
		               |ГДЕ
		               |	РегистрацияСведенийОбИмуществеЗначенияРеквизитов.Ссылка = &ДокументОснование
		               |	И РегистрацияСведенийОбИмуществеЗначенияРеквизитов.РеквизитСведений В
		               |			(ВЫБРАТЬ
		               |				ВТ_Реквизиты.Реквизит
		               |			ИЗ
		               |				ВТ_Реквизиты)
		               |	И РегистрацияСведенийОбИмуществеЗначенияРеквизитов.ИдентификаторСтрокиТабличнойЧасти = """"
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ВТ_Источник.РеквизитСведений, ВТ_Основание.РеквизитСведений) КАК Реквизит,
		               |	ЕСТЬNULL(ВТ_Источник.Значение, НЕОПРЕДЕЛЕНО) КАК ЗначениеИсточник,
		               |	ЕСТЬNULL(ВТ_Основание.Значение, НЕОПРЕДЕЛЕНО) КАК ЗначениеОснование
		               |ПОМЕСТИТЬ ВТ_Результат
		               |ИЗ
		               |	ВТ_Источник КАК ВТ_Источник
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Основание КАК ВТ_Основание
		               |		ПО ВТ_Источник.РеквизитСведений = ВТ_Основание.РеквизитСведений
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Результат.Реквизит.Наименование КАК Реквизит,
		               |	ЕСТЬNULL(ПредставлениеЗначений.Представление, ПРЕДСТАВЛЕНИЕ(ВТ_Результат.ЗначениеИсточник)) КАК Значение
		               |ИЗ
		               |	ВТ_Результат КАК ВТ_Результат
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РеквизитыСведенийОбИмуществе.СписокВыбора КАК ПредставлениеЗначений
		               |		ПО ВТ_Результат.Реквизит = ПредставлениеЗначений.Ссылка
		               |			И ВТ_Результат.ЗначениеИсточник = ПредставлениеЗначений.Значение
		               |ГДЕ
		               |	ВТ_Результат.ЗначениеИсточник <> ВТ_Результат.ЗначениеОснование";	
					   
		Запрос.УстановитьПараметр("ВидКарты", Объект.ДокументИсточник.ОбъектУчетаИмущества.ВидКарты); // Считаем что вид карты в обоих документов один и тот же
		Запрос.УстановитьПараметр("ДокументИсточник", Объект.ДокументИсточник);
		Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);			   
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Изменения = Новый Массив;
						
		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.Значение) Тогда
				Значение = "<Удалено>";
			ИначеЕсли Найти(Выборка.Значение, "<КонтактнаяИнформация") = 1 Тогда  // Это адрес
				Значение = РеестрИмуществаСервер.ПредставлениеАдреса(Выборка.Значение);
			Иначе
				Значение = Выборка.Значение;
			КонецЕсли;
			
			Изменения.Добавить(Выборка.Реквизит + " - " + Значение);
			
		КонецЦикла;
		
		Результат = "";
		Если Изменения.Количество() > 0 Тогда
			Результат = СтрСоединить(Изменения, ";" + Символы.ПС) + "."; 
		КонецЕсли;

		Объект.СодержаниеИзменений = Результат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеквизитыДокументаОснование.Значение КАК Документ
	               |ПОМЕСТИТЬ ДокументыОснования
	               |ИЗ
	               |	Документ.РегистрацияСведенийОбИмуществе.ЗначенияРеквизитов КАК РеквизитыДокументаОснование
	               |ГДЕ
	               |	РеквизитыДокументаОснование.Ссылка = &ДокументОснование
	               |	И ВЫРАЗИТЬ(РеквизитыДокументаОснование.Значение КАК Справочник.ОбъектыРеестраИмущества).Владелец = &Документы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеквизитыДокументаИсточника.Значение КАК ДокументОснование
	               |ИЗ
	               |	Документ.РегистрацияСведенийОбИмуществе.ЗначенияРеквизитов КАК РеквизитыДокументаИсточника
	               |ГДЕ
	               |	РеквизитыДокументаИсточника.Ссылка = &ДокументИсточник
	               |	И ВЫРАЗИТЬ(РеквизитыДокументаИсточника.Значение КАК Справочник.ОбъектыРеестраИмущества).Владелец = &Документы
	               |	И НЕ РеквизитыДокументаИсточника.Значение В
	               |				(ВЫБРАТЬ
	               |					ДокументыОснования.Документ
	               |				ИЗ
	               |					ДокументыОснования КАК ДокументыОснования)";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("ДокументИсточник", Объект.ДокументИсточник);
	Запрос.УстановитьПараметр("Документы", ОбъектДокумент);
	
	Результат = Запрос.Выполнить().Выгрузить();

	Объект.ДокументыОснования.Загрузить(Результат);
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ВидОтветственногоЛица = Перечисления.ОтветственныеЛицаОрганизаций.Руководитель;
	ОтветственноеЛицо = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(ВидОтветственногоЛица, Объект.Организация, Объект.Дата);
	Объект.Руководитель = ОтветственноеЛицо.ОтветственноеЛицоСсылка;
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
