
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ПараметрыНМА, ПараметрыОС, ПараметрыНПА, ПараметрыКапВложения, ПараметрыВидНФА;
	Перем СписокВидовОСВидИмущества;
	Перем СписокВидовОСЖилыеПомещения;
	Перем СписокВидовОСНежилыеПомещения;
	Перем СписокВидовОССооружения;
	Перем СписокВидовОСМашины;
	Перем СписокВидовОСТранспорт;
	Перем СписокВидовОСХозИнвентарь;
	Перем СписокВидовОСБиблиотека;
	Перем СписокВидовОСПрочие;
	Перем СписокВидовОСАренда;
	Перем СписокВидовОСХранение;
	
	ИспользоватьПодключаемоеОборудование = Истина;
	
	УстановитьВидимостьИнвНомера(ЭтаФорма);
	
	БухгалтерскиеОперацииСервер.УстановитьОтборСпискаИзНастроекКомпоновки(Список, Параметры);
	ТекстОтборПоВидуНФА = "";
	Разделитель = "";
	ТекстОтборПоВидамОС = "";
	
	ДатаПроверки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Дата");
	Если Не ЗначениеЗаполнено(ДатаПроверки) Тогда
		ДатаПроверки = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаПроверки", ДатаПроверки);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
	Список,
	"ВедетсяУчетПрослеживаемыхТоваров",
	ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(ДатаПроверки));
	
	Если ЗначениеЗаполнено(Параметры.ПериодУчетныхДанных) Тогда
		Если ТипЗнч(Параметры.ПериодУчетныхДанных) = Новый ОписаниеТипов("Дата") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
				"ПериодУчетныхДанных", Новый Граница(Параметры.ПериодУчетныхДанных, ВидГраницы.Включая), Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
				"ПериодУчетныхДанных", Новый Граница(Параметры.ПериодУчетныхДанных.МоментВремени(), ВидГраницы.Исключая), Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.СтруктураПараметровФормы) = Тип("Структура") Тогда
		Если Параметры.СтруктураПараметровФормы.Свойство("ВидНФА", ПараметрыВидНФА) Тогда
			ПараметрыОС				= ПараметрыВидНФА = Перечисления.ВидыНФА.ОС;
			ПараметрыНМА 			= ПараметрыВидНФА = Перечисления.ВидыНФА.НМА;
			ПараметрыНПА 			= ПараметрыВидНФА = Перечисления.ВидыНФА.НПА;
			ПараметрыКапВложения	= ПараметрыВидНФА = Перечисления.ВидыНФА.КапВложения;
		Иначе
			Если НЕ Параметры.СтруктураПараметровФормы.Свойство("ОС", ПараметрыОС) Тогда
				ПараметрыОС = Ложь;
			КонецЕсли;
			Если НЕ Параметры.СтруктураПараметровФормы.Свойство("НМА", ПараметрыНМА) Тогда
				ПараметрыНМА = Ложь;
			КонецЕсли;
			Если НЕ Параметры.СтруктураПараметровФормы.Свойство("НПА", ПараметрыНПА) Тогда
				ПараметрыНПА = Ложь;
			КонецЕсли;
			Если НЕ Параметры.СтруктураПараметровФормы.Свойство("НФА", ПараметрыКапВложения) Тогда
				ПараметрыКапВложения = Ложь;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Параметры.ВидНФА) Тогда
		ПараметрыОС				= Параметры.ВидНФА = Перечисления.ВидыНФА.ОС;
		ПараметрыНМА 			= Параметры.ВидНФА = Перечисления.ВидыНФА.НМА;
		ПараметрыНПА 			= Параметры.ВидНФА = Перечисления.ВидыНФА.НПА;
		ПараметрыКапВложения	= Параметры.ВидНФА = Перечисления.ВидыНФА.КапВложения;
	Иначе
		ПараметрыОС				= Параметры.ОС;
		ПараметрыНМА 			= Параметры.НМА;
		ПараметрыНПА 			= Параметры.НПА;
		ПараметрыКапВложения	= Параметры.КапВложения;
		ПараметрыКазна			= Параметры.Казна;
	КонецЕсли;
		
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Если ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
			ОтборОрганизация = Параметры.Отбор.Владелец;
			Элементы.ОтборОрганизация.ТолькоПросмотр = Истина;
			Элементы.ОтборОрганизация.КнопкаОткрытия = Ложь;
		КонецЕсли;
	ИначеЕсли Параметры.Отбор.Свойство("Организация") Тогда
		Если ЗначениеЗаполнено(Параметры.Отбор.Организация) Тогда
			ОтборОрганизация = Параметры.Отбор.Организация;
			Элементы.ОтборОрганизация.ТолькоПросмотр = Истина;
			Элементы.ОтборОрганизация.КнопкаОткрытия = Ложь;
		КонецЕсли;
	Иначе
		ЗаполнениеРеквизитовОбъектов.УстановитьОтборОсновнойОрганизации(Список, ОтборОрганизация);
	КонецЕсли;
	Элементы.Организация.Видимость = ЗначениеЗаполнено(ОтборОрганизация);
	
	Если ПараметрыНМА ИЛИ ПараметрыНПА ИЛИ ПараметрыОС ИЛИ ПараметрыКапВложения Тогда
		СписокВидовОС = Параметры.СписокВидовОС;
		ЗаданСписокВидовОС = ТипЗнч(СписокВидовОС) = Тип("Структура");
		ЗаданныйВидИмущества = Неопределено;
		Если ЗаданСписокВидовОС Тогда
			ЗаданВидИмущества = СписокВидовОС.Свойство("ВидИмущества", ЗаданныйВидИмущества) И ЗначениеЗаполнено(ЗаданныйВидИмущества);
		Иначе
			ЗаданВидИмущества = Ложь;
		КонецЕсли;
		
		ТекстОтборПоВидуНФА = НСтр("ru='по виду НФА: '");
		Если ПараметрыКапВложения Тогда
			ВидыНФАДляОтбора.Добавить(Перечисления.ВидыНФА.КапВложения);
			ТекстОтборПоВидуНФА = ТекстОтборПоВидуНФА + НСтр("ru='кап. вложения, '");
			Если ЗаданВидИмущества Тогда
				СписокВидовВложений = УправлениеОсновнымиСредствамиКлиентСервер.СтруктураЗапрашиваемыхСчетов();
				СписокВидовВложений.КапВложения = Истина;
				СписокВидовВложений.ВидИмущества = ЗаданныйВидИмущества;
				СписокСчетовКапВложений.ЗагрузитьЗначения(
					Новый Массив(УправлениеОсновнымиСредствамиПовтИсп.МассивСчетовОС(СписокВидовВложений)));
			КонецЕсли;
		КонецЕсли;
		Если ПараметрыНМА Тогда
			ВидыНФАДляОтбора.Добавить(Перечисления.ВидыНФА.НМА);
			ТекстОтборПоВидуНФА = ТекстОтборПоВидуНФА + НСтр("ru='НМА, '");
			Если ЗаданВидИмущества Тогда
				СписокВидовНМА = УправлениеОсновнымиСредствамиКлиентСервер.СтруктураЗапрашиваемыхСчетов();
				СписокВидовНМА.НМА = Истина;
				СписокВидовНМА.ВидИмущества = ЗаданныйВидИмущества;
				СписокСчетовНМА.ЗагрузитьЗначения(
					Новый Массив(УправлениеОсновнымиСредствамиПовтИсп.МассивСчетовОС(СписокВидовНМА)));
			КонецЕсли;
		КонецЕсли;
		Если ПараметрыНПА Тогда
			ВидыНФАДляОтбора.Добавить(Перечисления.ВидыНФА.НПА);
			ТекстОтборПоВидуНФА = ТекстОтборПоВидуНФА + НСтр("ru='НПА, '");
			Если ЗаданВидИмущества Тогда
				СписокВидовНПА = УправлениеОсновнымиСредствамиКлиентСервер.СтруктураЗапрашиваемыхСчетов();
				СписокВидовНПА.НПА = Истина;
				СписокВидовНПА.ВидИмущества = ЗаданныйВидИмущества;
				СписокСчетовНПА.ЗагрузитьЗначения(
					Новый Массив(УправлениеОсновнымиСредствамиПовтИсп.МассивСчетовОС(СписокВидовНПА)));
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыОС Тогда
			ИспользуетсяОтборПоОС = Истина;
			
			ТекстОтборПоВидуНФА = ТекстОтборПоВидуНФА + НСтр("ru='ОС, '");
			Если ЗаданСписокВидовОС Тогда
				МассивСчетовОС = Новый Массив(УправлениеОсновнымиСредствамиПовтИсп.МассивСчетовОС(СписокВидовОС));
				СписокСчетовОС.ЗагрузитьЗначения(МассивСчетовОС);
				
				Разделитель = "; ";
				ТекстОтборПоВидамОС = НСтр("ru='по счетам ОС: '");
				Если СписокВидовОС.Свойство("ЖилыеПомещения") И СписокВидовОС.ЖилыеПомещения = Истина Тогда
					ТекстОтборПоВидамОС = ТекстОтборПоВидамОС
						+ ПолучитьТекстовоеПредставлениеСчета(ЗаданВидИмущества, ЗаданныйВидИмущества, "101.х1");
				КонецЕсли;
				Если СписокВидовОС.Свойство("НежилыеПомещения") И СписокВидовОС.НежилыеПомещения = Истина Тогда
					ТекстОтборПоВидамОС = ТекстОтборПоВидамОС
						+ ПолучитьТекстовоеПредставлениеСчета(ЗаданВидИмущества, ЗаданныйВидИмущества, "101.х2");
				КонецЕсли;
				Если СписокВидовОС.Свойство("Сооружения") И СписокВидовОС.Сооружения = Истина Тогда
					ТекстОтборПоВидамОС = ТекстОтборПоВидамОС
						+ ПолучитьТекстовоеПредставлениеСчета(ЗаданВидИмущества, ЗаданныйВидИмущества, "101.х3");
				КонецЕсли;
				Если СписокВидовОС.Свойство("Машины") И СписокВидовОС.Машины = Истина Тогда
					ТекстОтборПоВидамОС = ТекстОтборПоВидамОС
						+ ПолучитьТекстовоеПредставлениеСчета(ЗаданВидИмущества, ЗаданныйВидИмущества, "101.х4");
				КонецЕсли;
				Если СписокВидовОС.Свойство("Транспорт") И СписокВидовОС.Транспорт = Истина Тогда
					ТекстОтборПоВидамОС = ТекстОтборПоВидамОС
						+ ПолучитьТекстовоеПредставлениеСчета(ЗаданВидИмущества, ЗаданныйВидИмущества, "101.х5");
				КонецЕсли;
				Если СписокВидовОС.Свойство("ХозИнвентарь") И СписокВидовОС.ХозИнвентарь = Истина Тогда
					ТекстОтборПоВидамОС = ТекстОтборПоВидамОС
						+ ПолучитьТекстовоеПредставлениеСчета(ЗаданВидИмущества, ЗаданныйВидИмущества, "101.х6");
				КонецЕсли;
				Если СписокВидовОС.Свойство("Библиотека") И СписокВидовОС.Библиотека = Истина Тогда
					ТекстОтборПоВидамОС = ТекстОтборПоВидамОС
						+ ПолучитьТекстовоеПредставлениеСчета(ЗаданВидИмущества, ЗаданныйВидИмущества, "101.х7");
				КонецЕсли;
				Если СписокВидовОС.Свойство("Прочие") И СписокВидовОС.Прочие = Истина Тогда
					ТекстОтборПоВидамОС = ТекстОтборПоВидамОС
						+ ПолучитьТекстовоеПредставлениеСчета(ЗаданВидИмущества, ЗаданныйВидИмущества, "101.х8");
				КонецЕсли;
				Если СписокВидовОС.Свойство("Аренда") И СписокВидовОС.Аренда = Истина Тогда
					ТекстОтборПоВидамОС = ТекстОтборПоВидамОС + НСтр("ru='01, '");
				КонецЕсли;
				Если СписокВидовОС.Свойство("Хранение") И СписокВидовОС.Хранение = Истина Тогда
					ТекстОтборПоВидамОС = ТекстОтборПоВидамОС + НСтр("ru='02.1, '");
				КонецЕсли;
				ТекстОтборПоВидамОС = СокрЛП(ТекстОтборПоВидамОС);
				Если Прав(ТекстОтборПоВидамОС, 1) = "," Тогда
					ТекстОтборПоВидамОС = Лев(ТекстОтборПоВидамОС, СтрДлина(ТекстОтборПоВидамОС)-1);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ТекстОтборПоВидуНФА = Лев(ТекстОтборПоВидуНФА, СтрДлина(ТекстОтборПоВидуНФА)-2);
		
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("СчетУчета") И Параметры.Свойство("СчетОСвОперативномУчете") Тогда
		
		СчетУчета = СчетОСпоСчетуВОперативномУчете(Параметры.СчетОСвОперативномУчете);
		Если ЗначениеЗаполнено(СчетУчета) Тогда
			
			Если НЕ ИспользуетсяОтборПоОС Тогда
				ИспользуетсяОтборПоОС = Истина;
				ТекстОтборПоВидуНФА = ТекстОтборПоВидуНФА + НСтр("ru='ОС, '");
			КонецЕсли;
			Если СписокСчетовОС.НайтиПоЗначению(СчетУчета) = Неопределено Тогда
				СписокСчетовОС.Добавить(СчетУчета);
				ТекстОтборПоВидамОС = ТекстОтборПоВидамОС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='%1, '"), СчетУчета);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстОтбора = ТекстОтборПоВидуНФА + Разделитель + ТекстОтборПоВидамОС;
	Если ПустаяСтрока(ТекстОтбора) Тогда
		Элементы.Отбор_Страницы.Видимость = Ложь;
		ОтборВключен = Ложь;
	Иначе
		ОтборВключен = Истина;
		ВключитьВыключитьОтборФормы(ЭтаФорма);
	КонецЕсли;
	
	Если Параметры.РегистрацияТранспортныхСредств Тогда

		ОтборТипНФА = Перечисления.ТипыНФА.Транспорт;
		ИспользоватьОтборПоТипуНФА = Истина;
		Если Параметры.Свойство("ТекущаяСтрока") И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
			ИспользоватьОтборПоТипуНФА = 
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ТекущаяСтрока, "ТипНФА") = ОтборТипНФА;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипНФА",
			ОтборТипНФА, , , ИспользоватьОтборПоТипуНФА, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	КонецЕсли;

	ТребуемыеДанные = Параметры.ТребуемыеДанные;
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект, Элементы.КомандыФормы);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстовоеПредставлениеСчета(Знач ЗаданВидИмущества, Знач ЗаданныйВидИмущества, Знач КодДобавляемогоСчета)
    
    Перем КодДляПроверки, Результат;
    
    Результат = "";
    Если ЗаданВидИмущества Тогда
        КодДляПроверки = "";
        Если ЗаданныйВидИмущества = Перечисления.ВидыИмущества.НедвижимоеИмущество Тогда
            КодДляПроверки = СтрЗаменить(КодДобавляемогоСчета, "х", "1");
        ИначеЕсли ЗаданныйВидИмущества = Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное Тогда
            КодДляПроверки = СтрЗаменить(КодДобавляемогоСчета, "х", "2");
        ИначеЕсли ЗаданныйВидИмущества = Перечисления.ВидыИмущества.ИноеДвижимое Тогда
            КодДляПроверки = СтрЗаменить(КодДобавляемогоСчета, "х", "3");
        ИначеЕсли ЗаданныйВидИмущества = Перечисления.ВидыИмущества.Лизинг Тогда
            КодДляПроверки = СтрЗаменить(КодДобавляемогоСчета, "х", "4");
        КонецЕсли;
        Если КодДляПроверки <> "" И ЗначениеЗаполнено(БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду(КодДляПроверки)) Тогда
            Результат = КодДляПроверки + ", ";
        КонецЕсли;
    Иначе
        Результат = КодДобавляемогоСчета + ", ";
    КонецЕсли;
    Возврат Результат;

КонецФункции

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	УстановитьВидимостьИнвНомера(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, "СканерШтрихкода");
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, 
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("СканерШтрихкода"));
	КонецЕсли;
	// Конец ПодключаемоеОборудование

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование"
		И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Если Параметр[ 1 ] = Неопределено Тогда
				ТекКод = Параметр[ 0 ];
			Иначе
				ТекКод = Параметр[ 1 ][ 1 ];
			КонецЕсли;
			ОС = НайтиОбъектПоШтрихкоду(ТекКод);
			Если ЗначениеЗаполнено(ОС) Тогда
				Элементы.Список.ТекущаяСтрока = ОС;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", ОтборОрганизация,,, ЗначениеЗаполнено(ОтборОрганизация));
	Элементы.Организация.Видимость = ЗначениеЗаполнено(ОтборОрганизация);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если НЕ ПустаяСтрока(ТребуемыеДанные) Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные.ЭтоГруппа Тогда
			Возврат;
		КонецЕслИ;
		СтандартнаяОбработка = Ложь;
		МассивТребуемыхДанных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТребуемыеДанные, ",");
		Результат = Новый Структура("Ссылка", ВыбраннаяСтрока);
		Для каждого ТекТребуемыеДанные Из МассивТребуемыхДанных Цикл
		
			Попытка
			
				Результат.Вставить(ТекТребуемыеДанные, ТекущиеДанные[ТекТребуемыеДанные]);
			
			Исключение
			
			КонецПопытки;
		
		КонецЦикла;
		ОповеститьОвыборе(Результат);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьИнвНомера(Команда)
	ПоказатьИнвНомера = НЕ ПоказатьИнвНомера;
	УстановитьВидимостьИнвНомера(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьОтбор(Команда)
	ИзменитьИспользованиеОтбора();
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтбор(Команда)
	ИзменитьИспользованиеОтбора();
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СчетОСпоСчетуВОперативномУчете(СчетВОперУчете)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СоответствиеСчетовОС.СчетОС
	|ИЗ
	|	РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОС
	|ГДЕ
	|	СоответствиеСчетовОС.ЗабалансовыйСчет = &ЗабалансовыйСчет";
	Запрос.УстановитьПараметр("ЗабалансовыйСчет", СчетВОперУчете);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СчетОС;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // СчетОСпоСчетуВОперативномУчете()

&НаКлиенте
Процедура ИзменитьИспользованиеОтбора()

	ОтборВключен = Не ОтборВключен;
	ВключитьВыключитьОтборФормы(ЭтаФорма);

КонецПроцедуры // ИзменитьИспользованиеОтбора()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьИнвНомера(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ФормаПоказатьИнвНомера", "Пометка", Форма.ПоказатьИнвНомера);
	
	МассивИмен = Новый Массив;
	МассивИмен.Добавить("ЦМО");
	МассивИмен.Добавить("ИнвентарныйНомер");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, МассивИмен, "Видимость", Форма.ПоказатьИнвНомера);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "ПоказатьИнвНомера", Форма.ПоказатьИнвНомера);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВключитьВыключитьОтборФормы(Форма)

	Список = Форма.Список;
	Элементы = Форма.Элементы;
	
	ПредставлениеОтбора = НСтр("ru='Отбор по виду объекта'");
	
	ГруппаУсловий = ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(
		Список.Отбор.Элементы, ПредставлениеОтбора);
	
	Если ГруппаУсловий = Неопределено Тогда
	
		ГруппаУсловий = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы,
			ПредставлениеОтбора, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
			
		Если Форма.СписокСчетовКапВложений.Количество() > 0 Тогда
			ЗначениеВСписке = Форма.ВидыНФАДляОтбора.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.ВидыНФА.КапВложения"));
			Если ЗначениеВСписке <> Неопределено Тогда
				Форма.ВидыНФАДляОтбора.Удалить(ЗначениеВСписке);
			КонецЕсли;
		КонецЕсли;
		Если Форма.СписокСчетовНМА.Количество() > 0 Тогда
			ЗначениеВСписке = Форма.ВидыНФАДляОтбора.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.ВидыНФА.НМА"));
			Если ЗначениеВСписке <> Неопределено Тогда
				Форма.ВидыНФАДляОтбора.Удалить(ЗначениеВСписке);
			КонецЕсли;
		КонецЕсли;
		Если Форма.СписокСчетовНПА.Количество() > 0 Тогда
			ЗначениеВСписке = Форма.ВидыНФАДляОтбора.НайтиПоЗначению(
				ПредопределенноеЗначение("Перечисление.ВидыНФА.НПА"));
			Если ЗначениеВСписке <> Неопределено Тогда
				Форма.ВидыНФАДляОтбора.Удалить(ЗначениеВСписке);
			КонецЕсли;
		КонецЕсли;
		
		Если Форма.ВидыНФАДляОтбора.Количество()>0 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаУсловий,
			"ВидНФА", Форма.ВидыНФАДляОтбора, ВидСравненияКомпоновкиДанных.ВСписке,НСтр("ru = 'Виды НФА'"),Истина);
		КонецЕсли;
		
		Если Форма.ИспользуетсяОтборПоОС Тогда
			ГруппаУсловийОС = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаУсловий.Элементы,
				НСтр("ru = 'Основные средства'"), ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаУсловийОС,
				"ВидНФА", ПредопределенноеЗначение("Перечисление.ВидыНФА.ОС"),
				ВидСравненияКомпоновкиДанных.Равно, НСтр("ru = 'Вид НФА = ОС'"),Истина);
			Если Форма.СписокСчетовОС.Количество() > 0 Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаУсловийОС,
					"СчетУчета", Форма.СписокСчетовОС, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
			КонецЕсли;
		КонецЕсли;
		
		Если Форма.СписокСчетовКапВложений.Количество() > 0 Тогда
			
			ГруппаУсловийКВ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаУсловий.Элементы,
				НСтр("ru = 'Капвложения'"), ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
				
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаУсловийКВ,
				"ВидНФА", ПредопределенноеЗначение("Перечисление.ВидыНФА.КапВложения"),
				ВидСравненияКомпоновкиДанных.Равно,НСтр("ru = 'Вид НФА = Капвложения'"),Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаУсловийКВ,
				"СчетУчета", Форма.СписокСчетовКапВложений, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
			//ЗначениеВСписке = Форма.ВидыНФАДляОтбора.НайтиПоЗначению(
			//	ПредопределенноеЗначение("Перечисление.ВидыНФА.КапВложения"));
			//Если ЗначениеВСписке <> Неопределено Тогда
			//	Форма.ВидыНФАДляОтбора.Удалить(ЗначениеВСписке);
			//КонецЕсли;
				
		КонецЕсли;
		
		Если Форма.СписокСчетовНМА.Количество() > 0 Тогда
			
			ГруппаУсловийНМА = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаУсловий.Элементы,
				НСтр("ru = 'НМА'"), ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
				
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаУсловийНМА,
				"ВидНФА", ПредопределенноеЗначение("Перечисление.ВидыНФА.НМА"),
				ВидСравненияКомпоновкиДанных.Равно,НСтр("ru = 'Вид НФА = НМА'"),Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаУсловийНМА,
				"СчетУчета", Форма.СписокСчетовНМА, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
			//ЗначениеВСписке = Форма.ВидыНФАДляОтбора.НайтиПоЗначению(
			//	ПредопределенноеЗначение("Перечисление.ВидыНФА.НМА"));
			//Если ЗначениеВСписке <> Неопределено Тогда
			//	Форма.ВидыНФАДляОтбора.Удалить(ЗначениеВСписке);
			//КонецЕсли;
				
		КонецЕсли;
		
		Если Форма.СписокСчетовНПА.Количество() > 0 Тогда
			
			ГруппаУсловийНПА = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ГруппаУсловий.Элементы,
				НСтр("ru = 'НПА'"), ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
				
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаУсловийНПА,
				"ВидНФА", ПредопределенноеЗначение("Перечисление.ВидыНФА.НПА"),
				ВидСравненияКомпоновкиДанных.Равно,НСтр("ru = 'Вид НФА = НПА'"),Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаУсловийНПА,
				"СчетУчета", Форма.СписокСчетовНПА, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
			//ЗначениеВСписке = Форма.ВидыНФАДляОтбора.НайтиПоЗначению(
			//	ПредопределенноеЗначение("Перечисление.ВидыНФА.НПА"));
			//Если ЗначениеВСписке <> Неопределено Тогда
			//	Форма.ВидыНФАДляОтбора.Удалить(ЗначениеВСписке);
			//КонецЕсли;
				
		КонецЕсли;
		
		//Если Форма.ВидыНФАДляОтбора.Количество()>0 Тогда
		//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаУсловий,
		//	"ВидНФА", Форма.ВидыНФАДляОтбора, ВидСравненияКомпоновкиДанных.ВСписке,НСтр("ru = 'Виды НФА'"),Истина);
		//КонецЕсли;
		
	КонецЕсли;
	
	ГруппаУсловий.Использование = Форма.ОтборВключен;
	Элементы.Отбор_Страницы.ТекущаяСтраница = ?(Форма.ОтборВключен,
		Элементы.Страница_ОтборИспользуется,
		Элементы.Страница_ОтборНеИспользуется);

КонецПроцедуры // ВключитьВыключитьОтборФормы()

&НаСервереБезКонтекста
Функция НайтиОбъектПоШтрихкоду(Знач Штрихкод)
	
	Возврат РегистрыСведений.Штрихкоды.НайтиОбъектПоШтрихкоду(Штрихкод).ОсновноеСредство;
	
КонецФункции

#КонецОбласти
