// Модуль содержит обработчики для механизма формирования проводок
// Процедуры вызываются из обработки ФормированиеБухгалтерскихПроводок через команду Выполнить, 
// с автоматической подстановкой параметров.
// Все процедуры модуля содержат 3 параметра:
//	ТаблицаПроводок - таблица значений или набор записей регистра бухгалтерии
//	ДокументОбъект - ДокументОбъект.*
//	ДополнительныеРеквизиты - Структура

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСписокОбработчиков(СписокОбработчиков) Экспорт
	
	ДобавитьОбработчикиЭтогоМодуля(СписокОбработчиков);
	
	ШаблонИмяФункции = "Переопределяемый.%1";
	ШаблонПредставлениеФункции = НСтр("ru = '%1 (переопределяемый модуль)'");
	
	// Обработчики переопределяемого модуля
	МаксИндексОбработчика = СписокОбработчиков.Количество() - 1;
	БухгалтерскиеОперацииОбработчикиПереопределяемый.ЗаполнитьСписокОбработчиков(СписокОбработчиков);
	Для Индекс = МаксИндексОбработчика + 1 По СписокОбработчиков.Количество() - 1 Цикл
		
		СписокОбработчиков[Индекс].Значение      = СтрШаблон(ШаблонИмяФункции, СписокОбработчиков[Индекс].Значение);
		СписокОбработчиков[Индекс].Представление = СтрШаблон(ШаблонПредставлениеФункции,
			СписокОбработчиков[Индекс].Значение);
	
	КонецЦикла; 
	
	// Обработчики модулей расширений
	ИменаМодулейОбработчиков = БухгалтерскиеОперацииСервер.ОписанияМодулейРасширений("Обработчики");
	ШаблонИмяФункции = "%1.%2";
	ШаблонПредставлениеФункции = НСтр("ru = '%1 (из расширения)'");
	ОшибкиДопМодулей = Новый Массив;
	
	Для каждого ТекущийМодуль Из ИменаМодулейОбработчиков Цикл
		
		ИмяТекущегоМодуля = ТекущийМодуль.Ключ;
		
		СписокОбработчиковМодуля = Новый СписокЗначений;
		ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяТекущегоМодуля);
		ОбщийМодуль.ЗаполнитьСписокОбработчиков(СписокОбработчиковМодуля);
		ТекстОшибки = "";
		Если НЕ БухгалтерскиеОперацииСервер.ПроверитьИменаПроцедурРасширения(
			СписокОбработчиковМодуля.ВыгрузитьЗначения(), ИмяТекущегоМодуля, ТекстОшибки) Тогда
			
			ОшибкиДопМодулей.Добавить(ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		Для Каждого ОписаниеФункции Из СписокОбработчиковМодуля Цикл
			
			СписокОбработчиков.Добавить(
				СтрШаблон(ШаблонИмяФункции, ИмяТекущегоМодуля, ОписаниеФункции.Значение),
				СтрШаблон(ШаблонПредставлениеФункции, ОписаниеФункции.Представление));
	
		КонецЦикла;
	КонецЦикла;
		
	Если ОшибкиДопМодулей.Количество() > 0 Тогда
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Обнаружены ошибки в объявлениях процедур-обработчиков ""после формирования проводок"".
			|Указанные модули не будут использоваться при настройке типовых операций.
			|%1'"), СтрСоединить(ОшибкиДопМодулей, Символы.ПС + Символы.ПС));
		ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииВычислениеИсточникаДанных(),
			УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
		ВызватьИсключение "Обнаружены ошибки в объявлениях процедур-обработчиков ""после формирования проводок"".
			|Подробную информацию см. в журнале регистрации";
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьОбработчик(ИмяПроцедуры, ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты) Экспорт
	
	// Проверить, что передано имя процедуры-обработчика из этого модуля
	Обработчики = Новый СписокЗначений;
	ДобавитьОбработчикиЭтогоМодуля(Обработчики);
	Если Обработчики.НайтиПоЗначению(ИмяПроцедуры) = Неопределено Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'В процедуру БухгалтерскиеОперацииОбработчики.ВыполнитьОбработчик передано имя несуществующего обработчика
			|%1'"), ИмяПроцедуры);
	КонецЕсли;
	Выполнить(СтрШаблон("%1(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты)", ИмяПроцедуры));
	
КонецПроцедуры

#Область ОбработчикиСобытияПослеФормированияПроводокТиповойОперации

// Корректирует суммы проводок налогового учета (налог на прибыль, УСН) при наличии неучитываемых доходов и расходов,
// или доходов и расходов по видам деятельности с особым порядком налогообложения (ЕНВД и пр.).
//
Процедура СкорректироватьПроводкиОтраженияДоходовРасходов(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты)
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(ДокументОбъект.Организация, ДокументОбъект.Дата);
	
	Если УчетнаяПолитика.ПлательщикНалогаНаПрибыль Тогда
		
		НалоговыйУчет.СкорректироватьПроводкиОтраженияДоходовРасходов(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты);
		
	ИначеЕсли УчетнаяПолитика.ПрименяетсяУСН Тогда
		
		УчетУСН.СкорректироватьПроводкиОтраженияДоходовРасходов(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты);
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует движения по оплате задолженности по регистрам ОплатаПоставщикамКредиторам и ОплатаОтПокупателейДебиторов
// по одноименным источникам данных.
//
Процедура ОтразитьОплатуВГрафикеПлатежей(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты)
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	ТаблицаОплатаПоставщикамКредиторам = ?(ДополнительныеСвойства.Свойство("ТаблицаОплатаПоставщикамКредиторам"),
		ДополнительныеСвойства.ТаблицаОплатаПоставщикамКредиторам, Неопределено);
	ТаблицаОплатаОтПокупателейДебиторов = ?(ДополнительныеСвойства.Свойство("ТаблицаОплатаОтПокупателейДебиторов"),
		ДополнительныеСвойства.ТаблицаОплатаОтПокупателейДебиторов, Неопределено);
	
	КонтрольИсполненияДоговоров.ОтразитьОплату(ДокументОбъект,
		ТаблицаОплатаПоставщикамКредиторам, ТаблицаОплатаОтПокупателейДебиторов);
	
КонецПроцедуры

// Формирует движения по исполнению обязательств по регистрам ИсполнениеОбязательствПоставщиками и ИсполнениеДоговоровСПокупателями
// по одноименным источникам данных.
//
Процедура ОтразитьИсполнениеДоговоровВГрафике(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты)
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	ТаблицаИсполнениеОбязательствПоставщиками = ?(ДополнительныеСвойства.Свойство("ТаблицаИсполнениеОбязательствПоставщиками"),
		ДополнительныеСвойства.ТаблицаИсполнениеОбязательствПоставщиками, Неопределено);
	ТаблицаИсполнениеДоговоровСПокупателями = ?(ДополнительныеСвойства.Свойство("ТаблицаИсполнениеДоговоровСПокупателями"),
		ДополнительныеСвойства.ТаблицаИсполнениеДоговоровСПокупателями, Неопределено);
	
	КонтрольИсполненияДоговоров.ОтразитьИсполнениеДоговоров(ДокументОбъект,
		ТаблицаИсполнениеОбязательствПоставщиками, ТаблицаИсполнениеДоговоровСПокупателями);
	
КонецПроцедуры

// Отражение планируемой оплаты по факту поступления, реализации товаров (работ, услуг)
// в регистрах ОплатаПоставщикамКредиторам и ОплатаОтПокупателейДебиторов.
//
Процедура ЗапланироватьОплатуПоФактуПоступленияРеализации(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты)
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	ТаблицаПланОплатПоФактуПоступленияРеализации = ?(ДополнительныеСвойства.Свойство("ТаблицаПланОплатПоФактуПоступленияРеализации"),
		ДополнительныеСвойства.ТаблицаПланОплатПоФактуПоступленияРеализации, Новый ТаблицаЗначений);
	
	КонтрольИсполненияДоговоров.ЗапланироватьОплатуПоФактуПоступленияРеализации(ДокументОбъект, ТаблицаПланОплатПоФактуПоступленияРеализации);
	
КонецПроцедуры

// Отражение даты исполнения по средствам во временном распоряжении (304.01) в регистре ОплатаПоставщикамКредиторам.
//
Процедура ОтразитьДатуИсполненияПоСредствамВоВременномРаспоряжении(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты)
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	ТаблицаДатаИсполненияПриПоступленииСредствВР = ?(ДополнительныеСвойства.Свойство("ТаблицаДатаИсполненияПриПоступленииСредствВР"),
		ДополнительныеСвойства.ТаблицаДатаИсполненияПриПоступленииСредствВР, Новый ТаблицаЗначений);
	ТаблицаДатаИсполненияПриПеречисленииСредствВР = ?(ДополнительныеСвойства.Свойство("ТаблицаДатаИсполненияПриПеречисленииСредствВР"),
		ДополнительныеСвойства.ТаблицаДатаИсполненияПриПеречисленииСредствВР, Новый ТаблицаЗначений);
		
	КонтрольИсполненияДоговоров.ОтразитьДатуИсполненияПоСредствамВоВременномРаспоряжении(ДокументОбъект,
		ТаблицаДатаИсполненияПриПоступленииСредствВР,
		ТаблицаДатаИсполненияПриПеречисленииСредствВР);
	
КонецПроцедуры

// Формирует движения по регистру "Расход продуктов" по данным из проводок документа "Меню-требование".
//
Процедура ОтразитьРасходПродуктовПитания(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты)
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаСписаниеПродуктовПитания") Тогда
		УправлениеМатериальнымиЗапасами.ОтразитьСписаниеПродуктовПитанияВРегистреРасходПродуктов(
			ДокументОбъект, ДополнительныеСвойства.ТаблицаСписаниеПродуктовПитания);
	ИначеЕсли ДополнительныеСвойства.Свойство("ТаблицаВозвратПродуктовПитания") Тогда
		УправлениеМатериальнымиЗапасами.ОтразитьВозвратПродуктовПитанияВРегистреРасходПродуктов(
			ДокументОбъект, ДополнительныеСвойства.ТаблицаВозвратПродуктовПитания);
	КонецЕсли;
	
КонецПроцедуры

// Устарела. Используется процедура РегистрыСведений.СоответствиеСчетовОС.СкорректироватьСчета()
//
Процедура СкорректироватьСчетАмортизацииИК(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты)
	
КонецПроцедуры

Процедура СформироватьДвиженияПрослеживаемости(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты)

	ПрослеживаемостьБГУ.СформироватьДвиженияПрослеживаемости(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты);

КонецПроцедуры

Процедура СписатьРезервМЗ(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты)
	
	РезервированиеНФА.СписатьРезервМЗПослеФормированияПроводок(ДокументОбъект, ДополнительныеРеквизиты, ТаблицаПроводок);
	
КонецПроцедуры

Процедура СписатьРезервОС(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты)
	
	РезервированиеНФА.СписатьРезервОСПослеФормированияПроводок(ДокументОбъект, ДополнительныеРеквизиты, ТаблицаПроводок);
	
КонецПроцедуры

Процедура ОтразитьВКарточкеКапвложений(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты)

	ТекстОшибки = "";
	Если НЕ ОбслуживаниеКарточекКапвложений.СформироватьДвиженияПоКарточкамКапвложений(
		ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТекстОшибки) Тогда
			
		ВызватьИсключение ТекстОшибки	
	КонецЕсли;		

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОбработчикиЭтогоМодуля(СписокОбработчиков)

	// Налоговый учет, УСН.
	СписокОбработчиков.Добавить("СкорректироватьПроводкиОтраженияДоходовРасходов",
		НСтр("ru = 'Скорректировать проводки отражения доходов и расходов (НУ)'"));
	
	// Контроль исполнения договоров.
	СписокОбработчиков.Добавить("ОтразитьОплатуВГрафикеПлатежей",
		НСтр("ru = 'Отразить оплату в графике платежей'"));
	СписокОбработчиков.Добавить("ОтразитьИсполнениеДоговоровВГрафике",
		НСтр("ru = 'Отразить исполнение в плане-графике закупок, реализации'"));
	СписокОбработчиков.Добавить("ЗапланироватьОплатуПоФактуПоступленияРеализации",
		НСтр("ru = 'Запланировать оплату по факту поступления, реализации товаров (работ, услуг)'"));
	СписокОбработчиков.Добавить("ОтразитьДатуИсполненияПоСредствамВоВременномРаспоряжении",
		НСтр("ru = 'Отразить дату исполнения по средствам во временном распоряжении'"));
	
	// Материальные запасы.
	СписокОбработчиков.Добавить("ОтразитьРасходПродуктовПитания",
		НСтр("ru = 'Отразить расход продуктов питания'"));
		
	СписокОбработчиков.Добавить("СформироватьДвиженияПрослеживаемости",
		НСтр("ru = 'Сформировать движения прослеживаемости'"));
		
	СписокОбработчиков.Добавить("СписатьРезервМЗ",
		НСтр("ru = 'Списание резервов материальных запасов'"));
	
	СписокОбработчиков.Добавить("СписатьРезервОС",
		НСтр("ru = 'Списание резервов основных средств'"));
	
	СписокОбработчиков.Добавить("ОтразитьВКарточкеКапвложений",
		НСтр("ru = 'Отразить в карточке капвложений'"));
	
КонецПроцедуры

#КонецОбласти
