#Область ПрограммныйИнтерфейс 

#Область ТранспортныйНалог

// Создает структуру параметров для расчета транспортного налога.
//
// Возвращаемое значение:
//   Структура:
//     * Организация - СправочникСсылка.Организации
//     * ОтчетныйПериод - Дата
//
Функция ПараметрыРасчетаТранспортногоНалога() Экспорт
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ПараметрыРасчета.Вставить("ОтчетныйПериод", Дата(1, 1, 1));
	Возврат ПараметрыРасчета;
КонецФункции 

// Формирует таблицу с расчетом транспортного налога за период расчета
//
// Параметры:
//  ПараметрыРасчета - см. ПараметрыРасчетаТранспортногоНалога() 
//
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция ТаблицаРасчетаТранспортногоНалога(ПараметрыРасчета) Экспорт
	
	ТаблицаРасчетаТранспортногоНалога = НоваяТаблицаРасчетаТранспортногоНалога();
	ЗаполнитьТаблицуРасчетаТранспортногоНалога(ТаблицаРасчетаТранспортногоНалога, ПараметрыРасчета);
	
	Возврат ТаблицаРасчетаТранспортногоНалога;
	
КонецФункции

#КонецОбласти

#Область ЗемельныйНалог

// Создает структуру параметров для расчета земельного налога.
//
// Возвращаемое значение:
//   Структура:
//     * Организация - СправочникСсылка.Организации
//     * ОтчетныйПериод - Дата
//
Функция ПараметрыРасчетаЗемельногоНалога() Экспорт
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ПараметрыРасчета.Вставить("ОтчетныйПериод", Дата(1, 1, 1));
	Возврат ПараметрыРасчета;
КонецФункции 

// Формирует таблицу с расчетом земельного налога за период расчета
//
// Параметры:
//  ПараметрыРасчета - см. ПараметрыРасчетаЗемельногоНалога() 
//
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция ТаблицаРасчетаЗемельногоНалога(ПараметрыРасчета) Экспорт
	
	ТаблицаРасчетаЗемельногоНалога = НоваяТаблицаРасчетаЗемельногоНалога();
	ЗаполнитьТаблицуРасчетаЗемельногоНалога(ТаблицаРасчетаЗемельногоНалога, ПараметрыРасчета);
	
	Возврат ТаблицаРасчетаЗемельногоНалога;
	
КонецФункции

#КонецОбласти

#Область НалогНаИмущество

// Инициализация структуры для использования в параметрах
//
// Возвращаемое значение:
//   Структура:
//     * Организация - СправочникСсылка.Организации
//     * ОтчетныйПериод - Дата
//
Функция ПараметрыРасчетаНалогаНаИмущество() Экспорт
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ПараметрыРасчета.Вставить("ОтчетныйПериод", Дата(1, 1, 1));
	Возврат ПараметрыРасчета;
КонецФункции 

// Формирует таблицу с расчетом налога на имущество за период расчета
//
// Параметры:
//  ПараметрыРасчета  - Структура - см. РасчетИмущественныхНалогов.ПараметрыРасчетаНалогаНаИмущество() 
//
// Возвращаемое значение:
//   ТаблицаЗначений - см. НоваяТаблицаПоСреднегодовой()
//
Функция ТаблицаРасчетаПоСреднегодовой(ПараметрыРасчета) Экспорт
	
	ТаблицаПоСреднегодовой = НоваяТаблицаПоСреднегодовой();
	ЗаполнитьТаблицуПоСреднегодовой(ТаблицаПоСреднегодовой, ПараметрыРасчета);

	Годовой = КонецДня(ПараметрыРасчета.ОтчетныйПериод) = КонецГода(ПараметрыРасчета.ОтчетныйПериод);
	Если Годовой Тогда
		ЗаполнитьАвансыРасчетПоСреднегодовой(ТаблицаПоСреднегодовой, ПараметрыРасчета);	
	КонецЕсли;
	
	ВыполнитьРасчетНалогаПоСреднегодовойСтоимости(ТаблицаПоСреднегодовой, ПараметрыРасчета);
	
	Возврат ТаблицаПоСреднегодовой;
КонецФункции

// Выполняет расчет налога на имущество согласно порядку заполнения декларации по налогу на имущество.
// Распределяет полученую сумму налога по объектам ОС.
//
// Параметры:
//  ТаблицаПоСреднегодовой  - ТаблицаЗначений - см. РасчетИмущественныхНалогов.НоваяТаблицаПоСреднегодовой()
//  ПараметрыРасчета  - Структура - см. РасчетИмущественныхНалогов.ПараметрыРасчетаНалогаНаИмущество()
//
Процедура ВыполнитьРасчетНалогаПоСреднегодовойСтоимости(ТаблицаПоСреднегодовой, ПараметрыРасчета) Экспорт

	Если ТаблицаПоСреднегодовой.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;

	КолонкиГруппировокПоСтавке = ""
		+ "НалоговыйОрган,"
		+ "КодПоОКТМО,"
		+ "КодВидаИмущества,"
		+ "ДоляСтоимостиЧислитель,"
		+ "ДоляСтоимостиЗнаменатель,"
		+ "НалоговаяСтавка";

	КолонкиГруппировокПоЛьготе = КолонкиГруппировокПоСтавке + ","
		+ "ПорядокНалогообложения,"
		+ "КодНалоговойЛьготыОсвобождениеОтНалогообложения,"
		+ "КодОснованияЛьготы,"
		+ "ПроцентУменьшенияСуммыНалога";
	
	ОтборПоСтавке = Новый Структура(КолонкиГруппировокПоСтавке);
	ОтборСтрок = Новый Структура(КолонкиГруппировокПоЛьготе);

	ТаблицаПоСреднегодовой.Индексы.Добавить(КолонкиГруппировокПоСтавке);
	ТаблицаПоСреднегодовой.Индексы.Добавить(КолонкиГруппировокПоЛьготе);
	
	ИменаКолонокОстаточнаяСтоимость = ИменаКолонокОстаточнаяСтоимость();
	КолонкиСуммирования = СтрСоединить(ИменаКолонокОстаточнаяСтоимость, ",");
	
	ЧислоПериодов = Месяц(ПараметрыРасчета.ОтчетныйПериод) + 1;
	Делитель = ?(КонецДня(ПараметрыРасчета.ОтчетныйПериод) = КонецГода(ПараметрыРасчета.ОтчетныйПериод), 1, 4);
	
	НалогНаИмуществоОбъединятьЛисты = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
		ПараметрыРасчета.Организация, ПараметрыРасчета.ОтчетныйПериод).НалогНаИмуществоОбъединятьЛисты;
	
	РасчетНалогаПоСтавкам = ТаблицаПоСреднегодовой.Скопировать();
	РасчетНалогаПоСтавкам.Свернуть(КолонкиГруппировокПоСтавке, КолонкиСуммирования);
	
	Для Каждого РасчетПоСтавке Из РасчетНалогаПоСтавкам Цикл
	
		ЗаполнитьЗначенияСвойств(ОтборПоСтавке, РасчетПоСтавке);
	
		РасчетНалогаПоЛистам = ТаблицаПоСреднегодовой.Скопировать(ОтборПоСтавке);
		РасчетНалогаПоЛистам.Свернуть(КолонкиГруппировокПоЛьготе, КолонкиСуммирования);
		
		// При объединении листов в декларации результат расчета может отличаться вследствии округления налоговой базы.
		// При установленной опции НалогНаИмуществоОбъединятьЛисты налоговую базу рассчитываем с учетом льготированного имущества.
		// Что бы избежать расхождений вследствии округления налоговой базы.
		// Объединение при наличии не более одной льготы одного типа.

		ЛистыСложения = СложитьРасчетНалогаПоЛистам(РасчетНалогаПоЛистам, НалогНаИмуществоОбъединятьЛисты);
		
		Для каждого СтрокаТаблицы Из РасчетНалогаПоЛистам Цикл
			
			СредняяСтоимость = СредняяСтоимостьЗаПериод(СтрокаТаблицы, 
				ИменаКолонокОстаточнаяСтоимость, ЧислоПериодов, 0);
				
			Если СтрокаТаблицы = ЛистыСложения.Сложение Тогда
				
				СредняяСтоимость = СредняяСтоимость - СредняяСтоимостьЗаПериод(ЛистыСложения.Льготируемое, 
					ИменаКолонокОстаточнаяСтоимость, ЧислоПериодов, 0);
				
			КонецЕсли;
			
			Если СтрокаТаблицы.КодВидаИмущества = "02" Тогда
				ДоляСтоимости = ?(СтрокаТаблицы.ДоляСтоимостиЗнаменатель = 0, 0,
					СтрокаТаблицы.ДоляСтоимостиЧислитель / СтрокаТаблицы.ДоляСтоимостиЗнаменатель);
				НалоговаяБаза = Окр(СредняяСтоимость * ДоляСтоимости);
			Иначе
				НалоговаяБаза = СредняяСтоимость;
			КонецЕсли;
			
			Если СтрокаТаблицы.ПорядокНалогообложения = 
				Перечисления.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения Тогда
					
				СуммаНалога = 0;
				
			Иначе
				СуммаНалога = Окр(НалоговаяБаза * СтрокаТаблицы.НалоговаяСтавка / 100 / Делитель);
			КонецЕсли;

			СнижениеСуммыНаПроцент = СтрокаТаблицы.ПорядокНалогообложения =
				Перечисления.ПорядокНалогообложенияИмущества.СнижениеСуммыНаПроцент;
				
			Если СнижениеСуммыНаПроцент Тогда
				СуммаУменьшенияСуммыНалога = Окр(СуммаНалога * СтрокаТаблицы.ПроцентУменьшенияСуммыНалога / 100);
			Иначе
				СуммаУменьшенияСуммыНалога = 0;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаТаблицы);
			
			СтрокиРасчета = ТаблицаПоСреднегодовой.НайтиСтроки(ОтборСтрок);
			
			КоэффициентыРаспределения = ОбщегоНазначения.ВыгрузитьКолонку(СтрокиРасчета, "СредняяСтоимость");
		   	РаспределениеСуммыНалога  = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
				СуммаНалога, КоэффициентыРаспределения, 0);
		   	РаспределениеСуммыУменьшенияСуммыНалога  = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
				СуммаУменьшенияСуммыНалога, КоэффициентыРаспределения, 0);
				
			Для Индекс = 0 По СтрокиРасчета.ВГраница() Цикл

				СтрокиРасчета[Индекс].СуммаИсчислено = ?(РаспределениеСуммыНалога = Неопределено, 0,
					РаспределениеСуммыНалога[Индекс]);
					
				Если СнижениеСуммыНаПроцент Тогда
					СтрокиРасчета[Индекс].СуммаУменьшенияСуммыНалога = ?(
						РаспределениеСуммыУменьшенияСуммыНалога = Неопределено,
						0,
						РаспределениеСуммыУменьшенияСуммыНалога[Индекс]);
				КонецЕсли;
				
				СуммаНалогаКУплате = СтрокиРасчета[Индекс].СуммаИсчислено 
					- СтрокиРасчета[Индекс].СуммаУменьшенияСуммыНалога;
					
				СуммаНалогаКУплате = Макс(СуммаНалогаКУплате, 0);		
					
				СтрокиРасчета[Индекс].Сумма = СуммаНалогаКУплате 
					- (СтрокиРасчета[Индекс].СуммаАвансовыхПлатежей1Кв
						+ СтрокиРасчета[Индекс].СуммаАвансовыхПлатежей2Кв
						+ СтрокиРасчета[Индекс].СуммаАвансовыхПлатежей3Кв);				
					
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Вычисляет среднюю остаточную стоимость за указанное количество периодов.
//
// Параметры:
//   СтрокаТаблицы - СтрокаТаблицыЗначений: см. НоваяТаблицаПоСреднегодовой() - строка таблицы с данными о стоимости
//   ИменаКолонокОстаточнаяСтоимость - см. ИменаКолонокОстаточнаяСтоимость()
//   ЧислоПериодов - Число - количество периодов для расчета средней стоимости, от 1 до 13
//   ТочностьРасчета - Число - точность округления (количество знаков после запятой)
//
// Возвращаемое значение:
//   Число - средняя остаточная стоимость за период
//
Функция СредняяСтоимостьЗаПериод(СтрокаТаблицы, ИменаКолонокОстаточнаяСтоимость, ЧислоПериодов, ТочностьРасчета) Экспорт

	СредняяСтоимостьЗаПериод = 0;
	Для НомерПериода = 1 По ЧислоПериодов Цикл
		СредняяСтоимостьЗаПериод = СредняяСтоимостьЗаПериод 
			+ Окр(СтрокаТаблицы[ИменаКолонокОстаточнаяСтоимость[НомерПериода - 1]], ТочностьРасчета);
	КонецЦикла;
		
	СредняяСтоимостьЗаПериод = Окр(СредняяСтоимостьЗаПериод / ЧислоПериодов, ТочностьРасчета);
	
	Возврат СредняяСтоимостьЗаПериод;
	
КонецФункции

// Возвращает массив имен колонок для использования в алгоритмах расчета налога на имущество
//
// Возвращаемое значение:
//   Массив из Строка - имена колонок остаточной стоимости
//
Функция ИменаКолонокОстаточнаяСтоимость() Экспорт
	ИменаКолонокОстаточнаяСтоимость = Новый Массив;
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0101");
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0102");
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0103");
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0104");
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0105");
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0106");
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0107");
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0108");
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0109");
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0110");
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0111");
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа0112");
	ИменаКолонокОстаточнаяСтоимость.Добавить("ОстаточнаяСтоимостьНа3112");
    Возврат ИменаКолонокОстаточнаяСтоимость;
КонецФункции

// Инициализация таблицы расчета налога
//
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция НоваяТаблицаПоСреднегодовой() Экспорт

	ТаблицаПоСреднегодовой = Новый ТаблицаЗначений;
	Колонки = ТаблицаПоСреднегодовой.Колонки;
	
	Знак = ДопустимыйЗнак.Неотрицательный;
	
	Колонки.Добавить("ОсновноеСредство", 			Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	Колонки.Добавить("ИнвентарныйНомер", 			Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	Колонки.Добавить("НалоговыйОрган", 				Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	Колонки.Добавить("КодПоОКТМО", 					Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(11)));
	Колонки.Добавить("КодВидаИмущества", 			Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(2)));
	
	Колонки.Добавить("ОстаточнаяСтоимостьНа0101", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ОстаточнаяСтоимостьНа0102", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ОстаточнаяСтоимостьНа0103", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ОстаточнаяСтоимостьНа0104", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ОстаточнаяСтоимостьНа0105", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ОстаточнаяСтоимостьНа0106", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ОстаточнаяСтоимостьНа0107", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ОстаточнаяСтоимостьНа0108", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ОстаточнаяСтоимостьНа0109", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ОстаточнаяСтоимостьНа0110", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ОстаточнаяСтоимостьНа0111", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ОстаточнаяСтоимостьНа0112", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ОстаточнаяСтоимостьНа3112", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("СредняяСтоимость", 			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	
	Колонки.Добавить("ДоляСтоимостиЧислитель", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, Знак)));
	Колонки.Добавить("ДоляСтоимостиЗнаменатель", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, Знак)));
	Колонки.Добавить("НалоговаяСтавка", 			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4, 2, Знак)));
	Колонки.Добавить("ПорядокНалогообложения", 		
										Новый ОписаниеТипов("ПеречислениеСсылка.ПорядокНалогообложенияИмущества"));
	Колонки.Добавить("КодНалоговойЛьготыОсвобождениеОтНалогообложения",
										Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(7)));
	Колонки.Добавить("КодОснованияЛьготы",
										Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(12)));

	Колонки.Добавить("СуммаИсчислено", 				Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	Колонки.Добавить("СуммаАвансовыхПлатежей1Кв", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	Колонки.Добавить("СуммаАвансовыхПлатежей2Кв", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	Колонки.Добавить("СуммаАвансовыхПлатежей3Кв", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	Колонки.Добавить("Сумма", 						Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));

	Колонки.Добавить("ПроцентУменьшенияСуммыНалога", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 4)));
	Колонки.Добавить("СуммаУменьшенияСуммыНалога", 	 Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0, Знак)));
	
	Возврат ТаблицаПоСреднегодовой;

КонецФункции

// Формирует таблицу с расчетом налога на имущество по кадастровой стоимости
//
// Параметры:
//  ПараметрыРасчета  - Структура - см. РасчетИмущественныхНалогов.ПараметрыРасчетаНалогаНаИмущество() 
//
// Возвращаемое значение:
//   ТаблицаЗначений - см. НоваяТаблицаПоКадастровой()
//
Функция ТаблицаРасчетаПоКадастровой(ПараметрыРасчета) Экспорт
	
	ТаблицаПоКадастровой = НоваяТаблицаПоКадастровой();
	ЗаполнитьТаблицуПоКадастровой(ТаблицаПоКадастровой, ПараметрыРасчета);

	Возврат ТаблицаПоКадастровой;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ТаблицаРасчетаЗемельногоНалога", Истина);
	Методы.Вставить("ТаблицаРасчетаПоКадастровой", Истина);
	Методы.Вставить("ТаблицаРасчетаПоСреднегодовой", Истина);
	Методы.Вставить("ТаблицаРасчетаТранспортногоНалога", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РасчетТранспортногоНалога

// Инициализация таблицы расчета налога
//
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция НоваяТаблицаРасчетаТранспортногоНалога()

	ТаблицаРасчетаТранспортногоНалога = Новый ТаблицаЗначений;
	Колонки = ТаблицаРасчетаТранспортногоНалога.Колонки;

	Знак = ДопустимыйЗнак.Неотрицательный;

	Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	Колонки.Добавить("НалоговыйОрган", Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	Колонки.Добавить("КодПоОКТМО", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(11)));

	Колонки.Добавить("НалоговаяБаза", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(17, 2, Знак)));
	Колонки.Добавить("НалоговаяСтавка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(8, 2, Знак)));
	Колонки.Добавить("МесяцевВладения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, Знак)));
	Колонки.Добавить("ПовышающийКоэффициент", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 1, Знак)));
	Колонки.Добавить("ПроцентУменьшения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4, 2, Знак)));
	Колонки.Добавить("СуммаУменьшения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(17, 2, Знак)));

	Колонки.Добавить("СуммаИсчислено", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	Колонки.Добавить("СуммаАванса", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));

	Возврат ТаблицаРасчетаТранспортногоНалога;

КонецФункции

// Параметры:
//   ТаблицаРасчетаТранспортногоНалога - см. НоваяТаблицаРасчетаТранспортногоНалога()
//   ПараметрыРасчета - см. ПараметрыРасчетаТранспортногоНалога()
// 
Процедура ЗаполнитьТаблицуРасчетаТранспортногоНалога(ТаблицаРасчетаТранспортногоНалога, ПараметрыРасчета)
	
	Организация = ПараметрыРасчета.Организация;
	ОтчетныйПериод = ПараметрыРасчета.ОтчетныйПериод;
	ГодовойРасчет = КонецДня(ОтчетныйПериод) = КонецГода(ОтчетныйПериод);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);

	ШаблонЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацияТС.ОсновноеСредство КАК ОсновноеСредство,
	|	РегистрацияТС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА РегистрацияТС.НалоговыйОрган <> ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА РегистрацияТС.НалоговыйОрган
	|		ИНАЧЕ РегистрацияТС.Организация.РегистрацияВНалоговомОргане
	|	КОНЕЦ КАК НалоговыйОрган,
	|	ВЫБОР
	|		КОГДА РегистрацияТС.КодПоОКАТО <> """"
	|			ТОГДА РегистрацияТС.КодПоОКАТО
	|		КОГДА РегистрацияТС.НалоговыйОрган <> ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА РегистрацияТС.НалоговыйОрган.КодПоОКТМО
	|		ИНАЧЕ РегистрацияТС.Организация.КодОКТМО
	|	КОНЕЦ КАК КодПоОКТМО,
	|	РегистрацияТС.НалоговаяБаза КАК НалоговаяБаза,
	|	РегистрацияТС.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
	|	ВЫБОР
	|		КОГДА РегистрацияТС.НалоговаяЛьгота = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоТранспортномуНалогу.СнижениеНалоговойСтавки)
	|			ТОГДА РегистрацияТС.ЛьготнаяСтавка
	|		ИНАЧЕ РегистрацияТС.НалоговаяСтавка
	|	КОНЕЦ КАК НалоговаяСтавка,
	|	ВЫБОР
	|		КОГДА РегистрацияТС.НалоговаяЛьгота = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоТранспортномуНалогу.УменьшениеСуммыНалогаВПроцентах)
	|			ТОГДА РегистрацияТС.ПроцентУменьшения
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентУменьшения,
	|	ВЫБОР
	|		КОГДА РегистрацияТС.НалоговаяЛьгота = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоТранспортномуНалогу.УменьшениеСуммыНалогаНаСумму)
	|			ТОГДА РегистрацияТС.СуммаУменьшения
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУменьшения,
	|	1 КАК МесяцевВладения,
	|	0 КАК СуммаАванса
	|ПОМЕСТИТЬ ВТ_РегистрацияМесяц
	|ИЗ
	|	РегистрСведений.РегистрацияТранспортныхСредств.СрезПоследних(&Период, Организация = &Организация) КАК РегистрацияТС
	|ГДЕ
	|	РегистрацияТС.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.Регистрация)
	|	И РегистрацияТС.НалоговаяЛьгота <> ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоТранспортномуНалогу.ОсвобождениеОтНалогообложения)";
	

	МесяцКонец  = Месяц(ОтчетныйПериод);
	МесяцНачало = ?(ГодовойРасчет, 1, МесяцКонец - 2);
	ОтчетныйГод = Год(ОтчетныйПериод);
	
	ТекстыЗапроса = Новый Массив;
	
	Для НомерМесяца = МесяцНачало По МесяцКонец Цикл
		
		НомерМесяцаСтрокой = Строка(НомерМесяца);
		
		Если ТекстыЗапроса.Количество() > 0 Тогда
			ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "РАЗРЕШЕННЫЕ", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_РегистрацияМесяц", "");
		Иначе
			ТекстЗапроса = ШаблонЗапроса;
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Период", "&Период" + НомерМесяцаСтрокой);
		
		ТекстыЗапроса.Добавить(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("Период" + НомерМесяцаСтрокой, Дата(ОтчетныйГод, НомерМесяца, 15, 23, 59, 59));
		
	КонецЦикла;
	
	Если ГодовойРасчет Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Расчет.ОсновноеСредство КАК ОсновноеСредство,
		|	Расчет.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	Расчет.НалоговыйОрган КАК НалоговыйОрган,
		|	Расчет.КодПоОКТМО КАК КодПоОКТМО,
		|	Расчет.НалоговаяБаза КАК НалоговаяБаза,
		|	Расчет.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
		|	Расчет.НалоговаяСтавка КАК НалоговаяСтавка,
		|	Расчет.ПроцентУменьшения КАК ПроцентУменьшения,
		|	Расчет.СуммаУменьшения КАК СуммаУменьшения,
		|	0 КАК МесяцевВладения,
		|	Расчет.Сумма КАК СуммаАванса
		|ИЗ
		|	Документ.РасчетТранспортногоНалога.ОсновныеСредства КАК Расчет
		|ГДЕ
		|	Расчет.Ссылка.Организация = &Организация
		|	И Расчет.Ссылка.Проведен
		|	И Расчет.Ссылка.ОтчетныйПериод В(&ОтчетныйПериод)";
		
		Периоды = Новый Массив;
		Периоды.Добавить(КонецКвартала(Дата(ОтчетныйГод, 1, 1)));
		Периоды.Добавить(КонецКвартала(Дата(ОтчетныйГод, 4, 1)));
		Периоды.Добавить(КонецКвартала(Дата(ОтчетныйГод, 7, 1)));
		
		Запрос.УстановитьПараметр("ОтчетныйПериод", Периоды);
		
		ТекстыЗапроса.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.ТекстОбъединитьВсе());
	ТекстЗапроса = ТекстЗапроса	+ ОбщегоНазначения.РазделительПакетаЗапросов() +
		"ВЫБРАТЬ
		|	ВТ_РегистрацияМесяц.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТ_РегистрацияМесяц.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТ_РегистрацияМесяц.НалоговыйОрган КАК НалоговыйОрган,
		|	ВТ_РегистрацияМесяц.КодПоОКТМО КАК КодПоОКТМО,
		|	ВТ_РегистрацияМесяц.НалоговаяБаза КАК НалоговаяБаза,
		|	ВТ_РегистрацияМесяц.ПовышающийКоэффициент КАК ПовышающийКоэффициент,
		|	ВТ_РегистрацияМесяц.НалоговаяСтавка КАК НалоговаяСтавка,
		|	ВТ_РегистрацияМесяц.ПроцентУменьшения КАК ПроцентУменьшения,
		|	ВТ_РегистрацияМесяц.СуммаУменьшения КАК СуммаУменьшения,
		|	СУММА(ВТ_РегистрацияМесяц.МесяцевВладения) КАК МесяцевВладения,
		|	СУММА(ВТ_РегистрацияМесяц.СуммаАванса) КАК СуммаАванса,
		|	ОсновныеСредства.Наименование КАК ОСНаименование,
		|	ИнвентарныеНомераОС.Код КАК ИнвНомерКод
		|ИЗ
		|	ВТ_РегистрацияМесяц КАК ВТ_РегистрацияМесяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
		|		ПО ВТ_РегистрацияМесяц.ОсновноеСредство = ОсновныеСредства.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
		|		ПО ВТ_РегистрацияМесяц.ИнвентарныйНомер = ИнвентарныеНомераОС.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РегистрацияМесяц.ОсновноеСредство,
		|	ВТ_РегистрацияМесяц.ИнвентарныйНомер,
		|	ВТ_РегистрацияМесяц.КодПоОКТМО,
		|	ВТ_РегистрацияМесяц.НалоговыйОрган,
		|	ВТ_РегистрацияМесяц.НалоговаяБаза,
		|	ВТ_РегистрацияМесяц.ПовышающийКоэффициент,
		|	ВТ_РегистрацияМесяц.НалоговаяСтавка,
		|	ВТ_РегистрацияМесяц.ПроцентУменьшения,
		|	ВТ_РегистрацияМесяц.СуммаУменьшения,
		|	ОсновныеСредства.Наименование,
		|	ИнвентарныеНомераОС.Код
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОСНаименование,
		|	ИнвНомерКод,
		|	НалоговыйОрган,
		|	КодПоОКТМО";
	
	Запрос.Текст = ТекстЗапроса;

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	ПараметрыРасчетаСуммы = РасчетИмущественныхНалоговКлиентСервер.ПараметрыРасчетаСуммаТранспортногоНалога();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НоваяСтрока = ТаблицаРасчетаТранспортногоНалога.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		ЗаполнитьЗначенияСвойств(ПараметрыРасчетаСуммы, НоваяСтрока);
		
		НоваяСтрока.СуммаИсчислено = РасчетИмущественныхНалоговКлиентСервер.СуммаТранспортногоНалога(
			ПараметрыРасчетаСуммы);
		НоваяСтрока.Сумма = НоваяСтрока.СуммаИсчислено - ?(ГодовойРасчет, НоваяСтрока.СуммаАванса, 0);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область РасчетЗемельногоНалога

// Инициализация таблицы расчета налога
//
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция НоваяТаблицаРасчетаЗемельногоНалога()

	ТаблицаРасчетаЗемельногоНалога = Новый ТаблицаЗначений;
	Колонки = ТаблицаРасчетаЗемельногоНалога.Колонки;

	Знак = ДопустимыйЗнак.Неотрицательный;

	Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	Колонки.Добавить("НалоговыйОрган", Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	Колонки.Добавить("КодПоОКТМО", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(11)));
	Колонки.Добавить("КБК", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));

	Колонки.Добавить("НалоговаяБаза", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(17, 2, Знак)));
	Колонки.Добавить("НалоговаяСтавка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 4, Знак)));
	Колонки.Добавить("ДоляВПравеОбщейСобственностиЧислитель",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, Знак)));
	Колонки.Добавить("ДоляВПравеОбщейСобственностиЗнаменатель",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, Знак)));
	Колонки.Добавить("ДоляНеОблагаемойНалогомПлощадиЧислитель",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, Знак)));
	Колонки.Добавить("ДоляНеОблагаемойНалогомПлощадиЗнаменатель",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, Знак)));
	Колонки.Добавить("НеОблагаемаяНалогомСумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ПроцентУменьшения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 4, Знак)));
	Колонки.Добавить("СуммаУменьшения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("МесяцевВладения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, Знак)));

	Колонки.Добавить("СуммаИсчислено", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	Колонки.Добавить("СуммаАванса", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));

	Возврат ТаблицаРасчетаЗемельногоНалога;

КонецФункции

// Параметры:
//   ТаблицаРасчетаЗемельногоНалога - см. НоваяТаблицаРасчетаЗемельногоНалога()
//   ПараметрыРасчета - см. ПараметрыРасчетаЗемельногоНалога()
// 
Процедура ЗаполнитьТаблицуРасчетаЗемельногоНалога(ТаблицаРасчетаЗемельногоНалога, ПараметрыРасчета)
	
	Организация = ПараметрыРасчета.Организация;
	ОтчетныйПериод = ПараметрыРасчета.ОтчетныйПериод;
	ГодовойРасчет = КонецДня(ОтчетныйПериод) = КонецГода(ОтчетныйПериод);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодНачало", НачалоГода(ОтчетныйПериод));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ШаблонЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацияЗУ.ОсновноеСредство КАК ОсновноеСредство,
	|	РегистрацияЗУ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА РегистрацияЗУ.НалоговыйОрган <> ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА РегистрацияЗУ.НалоговыйОрган
	|		ИНАЧЕ РегистрацияЗУ.Организация.РегистрацияВНалоговомОргане
	|	КОНЕЦ КАК НалоговыйОрган,
	|	ВЫБОР
	|		КОГДА РегистрацияЗУ.КодПоОКАТО <> """"
	|			ТОГДА РегистрацияЗУ.КодПоОКАТО
	|		КОГДА РегистрацияЗУ.НалоговыйОрган <> ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА РегистрацияЗУ.НалоговыйОрган.КодПоОКТМО
	|		ИНАЧЕ РегистрацияЗУ.Организация.КодОКТМО
	|	КОНЕЦ КАК КодПоОКТМО,
	|	РегистрацияЗУ.КБК КАК КБК,
	|	ВЫБОР
	|		КОГДА РегистрацияЗУ.СниженнаяНалоговаяСтавка <> 0
	|			ТОГДА РегистрацияЗУ.СниженнаяНалоговаяСтавка
	|		ИНАЧЕ РегистрацияЗУ.НалоговаяСтавка
	|	КОНЕЦ КАК НалоговаяСтавка,
	|	РегистрацияЗУ.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
	|	РегистрацияЗУ.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
	|	ВЫБОР
	|		КОГДА
	|			РегистрацияЗУ.НалоговаяЛьготаПоНалоговойБазе = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоЗемельномуНалогуПоНалоговойБазе.НеОблагаемаяНалогомПлощадь)
	|			ТОГДА РегистрацияЗУ.ДоляНеОблагаемойНалогомПлощадиЧислитель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоляНеОблагаемойНалогомПлощадиЧислитель,
	|	ВЫБОР
	|		КОГДА
	|			РегистрацияЗУ.НалоговаяЛьготаПоНалоговойБазе = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоЗемельномуНалогуПоНалоговойБазе.НеОблагаемаяНалогомПлощадь)
	|			ТОГДА РегистрацияЗУ.ДоляНеОблагаемойНалогомПлощадиЗнаменатель
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоляНеОблагаемойНалогомПлощадиЗнаменатель,
	|	ВЫБОР
	|		КОГДА
	|			РегистрацияЗУ.НалоговаяЛьготаПоНалоговойБазе = ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоЗемельномуНалогуПоНалоговойБазе.УменьшениеНалоговойБазы)
	|			ТОГДА РегистрацияЗУ.НеОблагаемаяНалогомСумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НеОблагаемаяНалогомСумма,
	|	РегистрацияЗУ.ПроцентУменьшенияСуммыНалога КАК ПроцентУменьшения,
	|	РегистрацияЗУ.СуммаУменьшенияСуммыНалога КАК СуммаУменьшения,
	|	1 КАК МесяцевВладения,
	|	&МесяцРасчета КАК МесяцРасчета
	|ПОМЕСТИТЬ ВТ_РегистрацияМесяц
	|ИЗ
	|	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(&Период, Организация = &Организация) КАК РегистрацияЗУ
	|ГДЕ
	|	РегистрацияЗУ.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.Регистрация)
	|	И
	|		РегистрацияЗУ.НалоговаяЛьготаПоНалоговойБазе <> ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоЗемельномуНалогуПоНалоговойБазе.ОсвобождениеОтНалогообложенияМестное)
	|	И
	|		РегистрацияЗУ.НалоговаяЛьготаПоНалоговойБазе <> ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоЗемельномуНалогуПоНалоговойБазе.ОсвобождениеОтНалогообложенияПоСтатье395)";
	
	
	МесяцКонец  = Месяц(ОтчетныйПериод);
	МесяцНачало = ?(ГодовойРасчет, 1, МесяцКонец - 2);
	ОтчетныйГод = Год(ОтчетныйПериод);
	
	ТекстыЗапроса = Новый Массив;
	
	Для НомерМесяца = МесяцНачало По МесяцКонец Цикл
		
		НомерМесяцаСтрокой = Строка(НомерМесяца);
		
		Если ТекстыЗапроса.Количество() > 0 Тогда
			ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "РАЗРЕШЕННЫЕ", "");
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_РегистрацияМесяц", "");
		Иначе
			ТекстЗапроса = ШаблонЗапроса;
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Период", "&Период" + НомерМесяцаСтрокой);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&МесяцРасчета",
			СтрШаблон("ДАТАВРЕМЯ(%1, %2, 1)", Формат(ОтчетныйГод, "ЧГ=;"), НомерМесяца));
		
		ТекстыЗапроса.Добавить(ТекстЗапроса);
		
		Запрос.УстановитьПараметр("Период" + НомерМесяцаСтрокой, Дата(ОтчетныйГод, НомерМесяца, 15, 23, 59, 59));
		
	КонецЦикла;
	
	Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.ТекстОбъединитьВсе());
	Запрос.Выполнить();

	Если НачалоГода(ОтчетныйПериод) = '20230101' Тогда
		ТекстЗапроса = ТекстЗапросаНалоговаяБазаЗемельногоНалога2023();
		Запрос.УстановитьПараметр("ПериодНачало2022", '20220101');
	Иначе
		ТекстЗапроса = ТекстЗапросаНалоговаяБазаЗемельногоНалога();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_РегистрацияМесяц.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТ_РегистрацияМесяц.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТ_РегистрацияМесяц.НалоговыйОрган КАК НалоговыйОрган,
		|	ВТ_РегистрацияМесяц.КодПоОКТМО КАК КодПоОКТМО,
		|	ВТ_РегистрацияМесяц.КБК КАК КБК,
		|	ВТ_РегистрацияМесяц.НалоговаяСтавка КАК НалоговаяСтавка,
		|	ВТ_РегистрацияМесяц.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
		|	ВТ_РегистрацияМесяц.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
		|	ВТ_РегистрацияМесяц.ДоляНеОблагаемойНалогомПлощадиЧислитель КАК ДоляНеОблагаемойНалогомПлощадиЧислитель,
		|	ВТ_РегистрацияМесяц.ДоляНеОблагаемойНалогомПлощадиЗнаменатель КАК ДоляНеОблагаемойНалогомПлощадиЗнаменатель,
		|	ВТ_РегистрацияМесяц.НеОблагаемаяНалогомСумма КАК НеОблагаемаяНалогомСумма,
		|	ВТ_РегистрацияМесяц.ПроцентУменьшения КАК ПроцентУменьшения,
		|	ВТ_РегистрацияМесяц.СуммаУменьшения КАК СуммаУменьшения,
		|	ВТ_РегистрацияМесяц.МесяцевВладения КАК МесяцевВладения,
		|	ЕСТЬNULL(ВТНалоговаяБазаИнтервалы.КадастроваяСтоимость, 0) КАК НалоговаяБаза,
		|	0 КАК СуммаАванса,
		|	ВТ_РегистрацияМесяц.МесяцРасчета КАК МесяцРасчета
		|ПОМЕСТИТЬ ВТРегистрация
		|ИЗ
		|	ВТ_РегистрацияМесяц КАК ВТ_РегистрацияМесяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНалоговаяБазаИнтервалы КАК ВТНалоговаяБазаИнтервалы
		|		ПО ВТ_РегистрацияМесяц.ОсновноеСредство = ВТНалоговаяБазаИнтервалы.ОсновноеСредство
		|		И ВТ_РегистрацияМесяц.ИнвентарныйНомер = ВТНалоговаяБазаИнтервалы.ИнвентарныйНомер
		|		И ВТ_РегистрацияМесяц.МесяцРасчета >= ВТНалоговаяБазаИнтервалы.НачалоПериода
		|		И ВТ_РегистрацияМесяц.МесяцРасчета <= ВТНалоговаяБазаИнтервалы.КонецПериода";
	
	Если ГодовойРасчет Тогда
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.ТекстОбъединитьВсе() +
			"ВЫБРАТЬ
			|	Расчет.ОсновноеСредство КАК ОсновноеСредство,
			|	Расчет.ИнвентарныйНомер КАК ИнвентарныйНомер,
			|	Расчет.НалоговыйОрган КАК НалоговыйОрган,
			|	Расчет.КодПоОКТМО КАК КодПоОКТМО,
			|	Расчет.КБК КАК КБК,
			|	Расчет.НалоговаяСтавка КАК НалоговаяСтавка,
			|	Расчет.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
			|	Расчет.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
			|	Расчет.ДоляНеОблагаемойНалогомПлощадиЧислитель КАК ДоляНеОблагаемойНалогомПлощадиЧислитель,
			|	Расчет.ДоляНеОблагаемойНалогомПлощадиЗнаменатель КАК ДоляНеОблагаемойНалогомПлощадиЗнаменатель,
			|	Расчет.НеОблагаемаяНалогомСумма КАК НеОблагаемаяНалогомСумма,
			|	Расчет.ПроцентУменьшения КАК ПроцентУменьшения,
			|	Расчет.СуммаУменьшения КАК СуммаУменьшения,
			|	0 КАК МесяцевВладения,
			|	Расчет.НалоговаяБаза КАК НалоговаяБаза,
			|	Расчет.Сумма КАК СуммаАванса,
			|	Расчет.Ссылка.ОтчетныйПериод КАК МесяцРасчета
			|ИЗ
			|	Документ.РасчетЗемельногоНалога.ОсновныеСредства КАК Расчет
			|ГДЕ
			|	Расчет.Ссылка.Организация = &Организация
			|	И Расчет.Ссылка.Проведен
			|	И Расчет.Ссылка.ОтчетныйПериод В (&ОтчетныйПериод)";
		
		Периоды = Новый Массив;
		Периоды.Добавить(КонецКвартала(Дата(ОтчетныйГод, 1, 1)));
		Периоды.Добавить(КонецКвартала(Дата(ОтчетныйГод, 4, 1)));
		Периоды.Добавить(КонецКвартала(Дата(ОтчетныйГод, 7, 1)));
		
		Запрос.УстановитьПараметр("ОтчетныйПериод", Периоды);
		
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() + 
		"ВЫБРАТЬ
		|	ВТРегистрация.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТРегистрация.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТРегистрация.НалоговыйОрган КАК НалоговыйОрган,
		|	ВТРегистрация.КодПоОКТМО КАК КодПоОКТМО,
		|	ВТРегистрация.КБК КАК КБК,
		|	ВТРегистрация.НалоговаяСтавка КАК НалоговаяСтавка,
		|	ВТРегистрация.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
		|	ВТРегистрация.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
		|	ВТРегистрация.ДоляНеОблагаемойНалогомПлощадиЧислитель КАК ДоляНеОблагаемойНалогомПлощадиЧислитель,
		|	ВТРегистрация.ДоляНеОблагаемойНалогомПлощадиЗнаменатель КАК ДоляНеОблагаемойНалогомПлощадиЗнаменатель,
		|	ВТРегистрация.НеОблагаемаяНалогомСумма КАК НеОблагаемаяНалогомСумма,
		|	ВТРегистрация.ПроцентУменьшения КАК ПроцентУменьшения,
		|	ВТРегистрация.СуммаУменьшения КАК СуммаУменьшения,
		|	ВТРегистрация.НалоговаяБаза КАК НалоговаяБаза,
		|	СУММА(ВТРегистрация.МесяцевВладения) КАК МесяцевВладения,
		|	СУММА(ВТРегистрация.СуммаАванса) КАК СуммаАванса,
		|	МИНИМУМ(ВТРегистрация.МесяцРасчета) КАК МесяцРасчета,
		|	ОсновныеСредства.Наименование КАК ОСНаименование,
		|	ИнвентарныеНомераОС.Код КАК ИнвНомерКод
		|ИЗ
		|	ВТРегистрация КАК ВТРегистрация
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
		|		ПО ВТРегистрация.ОсновноеСредство = ОсновныеСредства.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
		|		ПО ВТРегистрация.ИнвентарныйНомер = ИнвентарныеНомераОС.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВТРегистрация.ОсновноеСредство,
		|	ВТРегистрация.ИнвентарныйНомер,
		|	ВТРегистрация.НалоговыйОрган,
		|	ВТРегистрация.КодПоОКТМО,
		|	ВТРегистрация.КБК,
		|	ВТРегистрация.НалоговаяСтавка,
		|	ВТРегистрация.ДоляВПравеОбщейСобственностиЧислитель,
		|	ВТРегистрация.ДоляВПравеОбщейСобственностиЗнаменатель,
		|	ВТРегистрация.ДоляНеОблагаемойНалогомПлощадиЧислитель,
		|	ВТРегистрация.ДоляНеОблагаемойНалогомПлощадиЗнаменатель,
		|	ВТРегистрация.НеОблагаемаяНалогомСумма,
		|	ВТРегистрация.ПроцентУменьшения,
		|	ВТРегистрация.СуммаУменьшения,
		|	ВТРегистрация.НалоговаяБаза,
		|	ОсновныеСредства.Наименование,
		|	ИнвентарныеНомераОС.Код
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОСНаименование,
		|	ИнвНомерКод,
		|	МесяцРасчета";
	

	Запрос.Текст = ТекстЗапроса;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	ПараметрыРасчетаСуммы = РасчетИмущественныхНалоговКлиентСервер.ПараметрыРасчетаСуммаЗемельногоНалога();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НоваяСтрока = ТаблицаРасчетаЗемельногоНалога.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		ЗаполнитьЗначенияСвойств(ПараметрыРасчетаСуммы, НоваяСтрока);
		
		НоваяСтрока.СуммаИсчислено = РасчетИмущественныхНалоговКлиентСервер.СуммаЗемельногоНалога(ПараметрыРасчетаСуммы);
		НоваяСтрока.Сумма = НоваяСтрока.СуммаИсчислено - ?(ГодовойРасчет, НоваяСтрока.СуммаАванса, 0);
		
	КонецЦикла;

КонецПроцедуры

Функция ТекстЗапросаНалоговаяБазаЗемельногоНалога()
	
	Возврат
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СведенияКадастровогоУчетаСрезПоследних.Период КАК Период,
		|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	СведенияКадастровогоУчетаСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	СведенияКадастровогоУчетаСрезПоследних.КадастроваяСтоимость КАК КадастроваяСтоимость,
		|	СведенияКадастровогоУчетаСрезПоследних.ДатаПримененияНовойСтоимостиКРасчетуНалога КАК
		|		ДатаПримененияНовойСтоимостиКРасчетуНалога
		|ПОМЕСТИТЬ ВТСведенияКадастраВсе
		|ИЗ
		|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(&ПериодНачало, Организация = &Организация
		|	И (ОсновноеСредство, ИнвентарныйНомер) В
		|		(ВЫБРАТЬ
		|			ВТ.ОсновноеСредство,
		|			ВТ.ИнвентарныйНомер
		|		ИЗ
		|			ВТ_РегистрацияМесяц КАК ВТ)
		|	И КадастроваяСтоимость <> 0) КАК СведенияКадастровогоУчетаСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияКадастровогоУчета.Период,
		|	СведенияКадастровогоУчета.ОсновноеСредство,
		|	СведенияКадастровогоУчета.ИнвентарныйНомер,
		|	СведенияКадастровогоУчета.КадастроваяСтоимость,
		|	СведенияКадастровогоУчета.ДатаПримененияНовойСтоимостиКРасчетуНалога
		|ИЗ
		|	РегистрСведений.СведенияКадастровогоУчета КАК СведенияКадастровогоУчета
		|ГДЕ
		|	СведенияКадастровогоУчета.Период > &ПериодНачало
		|	И СведенияКадастровогоУчета.Организация = &Организация
		|	И (СведенияКадастровогоУчета.ОсновноеСредство, СведенияКадастровогоУчета.ИнвентарныйНомер) В
		|		(ВЫБРАТЬ
		|			ВТ.ОсновноеСредство,
		|			ВТ.ИнвентарныйНомер
		|		ИЗ
		|			ВТ_РегистрацияМесяц КАК ВТ)
		|	И СведенияКадастровогоУчета.КадастроваяСтоимость <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияКадастраВсе.Период КАК Период,
		|	ВТСведенияКадастраВсе.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТСведенияКадастраВсе.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТСведенияКадастраВсе.КадастроваяСтоимость КАК КадастроваяСтоимость,
		|	ВТСведенияКадастраВсе.ДатаПримененияНовойСтоимостиКРасчетуНалога КАК ДатаПримененияНовойСтоимостиКРасчетуНалога
		|ПОМЕСТИТЬ ВТСведенияКадастраБезДублей1
		|ИЗ
		|	ВТСведенияКадастраВсе КАК ВТСведенияКадастраВсе
		|ГДЕ
		|	НЕ ВТСведенияКадастраВсе.КадастроваяСтоимость В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ВТКадастраДо.КадастроваяСтоимость
		|		ИЗ
		|			ВТСведенияКадастраВсе КАК ВТКадастраДо
		|		ГДЕ
		|			ВТСведенияКадастраВсе.ОсновноеСредство = ВТКадастраДо.ОсновноеСредство
		|			И ВТСведенияКадастраВсе.ИнвентарныйНомер = ВТКадастраДо.ИнвентарныйНомер
		|			И ВТСведенияКадастраВсе.Период > ВТКадастраДо.Период
		|
		|		УПОРЯДОЧИТЬ ПО
		|			ВТКадастраДо.Период УБЫВ)
		|	ИЛИ НЕ ВТСведенияКадастраВсе.КадастроваяСтоимость В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ВТКадастраПосле.КадастроваяСтоимость
		|		ИЗ
		|			ВТСведенияКадастраВсе КАК ВТКадастраПосле
		|		ГДЕ
		|			ВТСведенияКадастраВсе.ОсновноеСредство = ВТКадастраПосле.ОсновноеСредство
		|			И ВТСведенияКадастраВсе.ИнвентарныйНомер = ВТКадастраПосле.ИнвентарныйНомер
		|			И ВТСведенияКадастраВсе.Период < ВТКадастраПосле.Период
		|
		|		УПОРЯДОЧИТЬ ПО
		|			ВТКадастраПосле.Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияКадастраБезДублей1.Период КАК Период,
		|	ВТСведенияКадастраБезДублей1.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТСведенияКадастраБезДублей1.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТ_Предыдущая.КадастроваяСтоимость КАК КадастроваяСтоимость
		|ПОМЕСТИТЬ ВТСведенияКадастраДо
		|ИЗ
		|	ВТСведенияКадастраБезДублей1 КАК ВТСведенияКадастраБезДублей1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСведенияКадастраБезДублей1 КАК ВТ_Предыдущая
		|		ПО ВТСведенияКадастраБезДублей1.ОсновноеСредство = ВТ_Предыдущая.ОсновноеСредство
		|		И ВТСведенияКадастраБезДублей1.ИнвентарныйНомер = ВТ_Предыдущая.ИнвентарныйНомер
		|		И ВТСведенияКадастраБезДублей1.Период > ВТ_Предыдущая.Период
		|ГДЕ
		|	НЕ ИСТИНА В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА
		|		ИЗ
		|			ВТСведенияКадастраБезДублей1 КАК Т
		|		ГДЕ
		|			ВТСведенияКадастраБезДублей1.ОсновноеСредство = Т.ОсновноеСредство
		|			И ВТСведенияКадастраБезДублей1.ИнвентарныйНомер = Т.ИнвентарныйНомер
		|			И ВТСведенияКадастраБезДублей1.Период > Т.Период
		|			И Т.Период > ВТ_Предыдущая.Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияКадастраБезДублей1.Период КАК Период,
		|	ВТСведенияКадастраБезДублей1.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТСведенияКадастраБезДублей1.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТ_Следующая.КадастроваяСтоимость КАК КадастроваяСтоимость,
		|	ВТ_Следующая.ДатаПримененияНовойСтоимостиКРасчетуНалога КАК ДатаПримененияНовойСтоимостиКРасчетуНалога
		|ПОМЕСТИТЬ ВТСведенияКадастраПосле
		|ИЗ
		|	ВТСведенияКадастраБезДублей1 КАК ВТСведенияКадастраБезДублей1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСведенияКадастраБезДублей1 КАК ВТ_Следующая
		|		ПО ВТСведенияКадастраБезДублей1.ОсновноеСредство = ВТ_Следующая.ОсновноеСредство
		|		И ВТСведенияКадастраБезДублей1.ИнвентарныйНомер = ВТ_Следующая.ИнвентарныйНомер
		|		И ВТСведенияКадастраБезДублей1.Период < ВТ_Следующая.Период
		|ГДЕ
		|	НЕ ИСТИНА В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА
		|		ИЗ
		|			ВТСведенияКадастраБезДублей1 КАК Т
		|		ГДЕ
		|			ВТСведенияКадастраБезДублей1.ОсновноеСредство = Т.ОсновноеСредство
		|			И ВТСведенияКадастраБезДублей1.ИнвентарныйНомер = Т.ИнвентарныйНомер
		|			И ВТСведенияКадастраБезДублей1.Период < Т.Период
		|			И Т.Период < ВТ_Следующая.Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСведенияКадастраБезДублей1.Период КАК Период,
		|	ВТСведенияКадастраБезДублей1.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТСведенияКадастраБезДублей1.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТСведенияКадастраБезДублей1.КадастроваяСтоимость КАК КадастроваяСтоимость,
		|	ВЫБОР
		|		КОГДА ВТСведенияКадастраБезДублей1.КадастроваяСтоимость = ЕСТЬNULL(ВТСведенияКадастраПосле.КадастроваяСтоимость, 0)
		|		И ЕСТЬNULL(ВТСведенияКадастраПосле.ДатаПримененияНовойСтоимостиКРасчетуНалога, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1,
		|			1, 1)
		|			ТОГДА ВТСведенияКадастраПосле.ДатаПримененияНовойСтоимостиКРасчетуНалога
		|		КОГДА ВТСведенияКадастраБезДублей1.ДатаПримененияНовойСтоимостиКРасчетуНалога <> ДАТАВРЕМЯ(1, 1, 1)
		|		И ВТСведенияКадастраБезДублей1.КадастроваяСтоимость <> ЕСТЬNULL(ВТСведенияКадастраПосле.КадастроваяСтоимость, 0)
		|			ТОГДА ВТСведенияКадастраБезДублей1.ДатаПримененияНовойСтоимостиКРасчетуНалога
		|		КОГДА ВТСведенияКадастраДо.Период ЕСТЬ NULL
		|			ТОГДА &ПериодНачало
		|		ИНАЧЕ ВЫБОР
		|			КОГДА ВТСведенияКадастраБезДублей1.Период = НАЧАЛОПЕРИОДА(ВТСведенияКадастраБезДублей1.Период, ГОД)
		|				ТОГДА ВТСведенияКадастраБезДублей1.Период
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТСведенияКадастраБезДублей1.Период, МЕСЯЦ, 12), ГОД)
		|		КОНЕЦ
		|	КОНЕЦ КАК ДатаНовойСтоимости
		|ПОМЕСТИТЬ ВТСведенияКадастраБезДублей2
		|ИЗ
		|	ВТСведенияКадастраБезДублей1 КАК ВТСведенияКадастраБезДублей1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияКадастраДо КАК ВТСведенияКадастраДо
		|		ПО ВТСведенияКадастраБезДублей1.ОсновноеСредство = ВТСведенияКадастраДо.ОсновноеСредство
		|		И ВТСведенияКадастраБезДублей1.ИнвентарныйНомер = ВТСведенияКадастраДо.ИнвентарныйНомер
		|		И ВТСведенияКадастраБезДублей1.Период = ВТСведенияКадастраДо.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияКадастраПосле КАК ВТСведенияКадастраПосле
		|		ПО ВТСведенияКадастраБезДублей1.ОсновноеСредство = ВТСведенияКадастраПосле.ОсновноеСредство
		|		И ВТСведенияКадастраБезДублей1.ИнвентарныйНомер = ВТСведенияКадастраПосле.ИнвентарныйНомер
		|		И ВТСведенияКадастраБезДублей1.Период = ВТСведенияКадастраПосле.Период
		|ГДЕ
		|	ВТСведенияКадастраБезДублей1.КадастроваяСтоимость <> ЕСТЬNULL(ВТСведенияКадастраДо.КадастроваяСтоимость, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТСведенияКадастраБезДублей2.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТСведенияКадастраБезДублей2.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТСведенияКадастраБезДублей2.КадастроваяСтоимость КАК КадастроваяСтоимость,
		|	ВТСведенияКадастраБезДублей2.ДатаНовойСтоимости КАК ДатаНовойСтоимости
		|ПОМЕСТИТЬ ВТНалоговаяБаза
		|ИЗ
		|	ВТСведенияКадастраБезДублей2 КАК ВТСведенияКадастраБезДублей2
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияКадастраБезДублей2 КАК ВТСведенияКадастраНовые
		|		ПО ВТСведенияКадастраБезДублей2.ОсновноеСредство = ВТСведенияКадастраНовые.ОсновноеСредство
		|		И ВТСведенияКадастраБезДублей2.ИнвентарныйНомер = ВТСведенияКадастраНовые.ИнвентарныйНомер
		|		И ВТСведенияКадастраБезДублей2.ДатаНовойСтоимости >= ВТСведенияКадастраНовые.ДатаНовойСтоимости
		|		И ВТСведенияКадастраБезДублей2.Период < ВТСведенияКадастраНовые.Период
		|ГДЕ
		|	ВТСведенияКадастраНовые.Период ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНалоговаяБаза.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТНалоговаяБаза.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТНалоговаяБаза.ДатаНовойСтоимости КАК ТекущаяДата,
		|	ВТСледующая.ДатаНовойСтоимости КАК СледующаяДата
		|ПОМЕСТИТЬ ВТСледующиеДатыНалоговойБазы
		|ИЗ
		|	ВТНалоговаяБаза КАК ВТНалоговаяБаза
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНалоговаяБаза КАК ВТСледующая
		|		ПО ВТНалоговаяБаза.ОсновноеСредство = ВТСледующая.ОсновноеСредство
		|		И ВТНалоговаяБаза.ИнвентарныйНомер = ВТСледующая.ИнвентарныйНомер
		|		И ВТНалоговаяБаза.ДатаНовойСтоимости < ВТСледующая.ДатаНовойСтоимости
		|ГДЕ
		|	НЕ ИСТИНА В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА
		|		ИЗ
		|			ВТНалоговаяБаза КАК Т
		|		ГДЕ
		|			ВТНалоговаяБаза.ОсновноеСредство = Т.ОсновноеСредство
		|			И ВТНалоговаяБаза.ИнвентарныйНомер = Т.ИнвентарныйНомер
		|			И ВТНалоговаяБаза.ДатаНовойСтоимости < Т.ДатаНовойСтоимости
		|			И Т.ДатаНовойСтоимости < ВТСледующая.ДатаНовойСтоимости)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНалоговаяБаза.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТНалоговаяБаза.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТНалоговаяБаза.КадастроваяСтоимость КАК КадастроваяСтоимость,
		|	ВЫБОР
		|		КОГДА ДЕНЬ(ВТНалоговаяБаза.ДатаНовойСтоимости) <= 15
		|			ТОГДА НАЧАЛОПЕРИОДА(ВТНалоговаяБаза.ДатаНовойСтоимости, МЕСЯЦ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТНалоговаяБаза.ДатаНовойСтоимости, МЕСЯЦ, 1), МЕСЯЦ)
		|	КОНЕЦ КАК НачалоПериода,
		|	ВЫБОР
		|		КОГДА ВТСледующиеДатыНалоговойБазы.СледующаяДата ЕСТЬ NULL
		|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
		|		КОГДА ДЕНЬ(ВТСледующиеДатыНалоговойБазы.СледующаяДата) <= 15
		|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТСледующиеДатыНалоговойБазы.СледующаяДата, МЕСЯЦ, -1), МЕСЯЦ)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ВТСледующиеДатыНалоговойБазы.СледующаяДата, МЕСЯЦ)
		|	КОНЕЦ КАК КонецПериода
		|ПОМЕСТИТЬ ВТНалоговаяБазаИнтервалы
		|ИЗ
		|	ВТНалоговаяБаза КАК ВТНалоговаяБаза
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСледующиеДатыНалоговойБазы КАК ВТСледующиеДатыНалоговойБазы
		|		ПО ВТНалоговаяБаза.ОсновноеСредство = ВТСледующиеДатыНалоговойБазы.ОсновноеСредство
		|		И ВТНалоговаяБаза.ИнвентарныйНомер = ВТСледующиеДатыНалоговойБазы.ИнвентарныйНомер
		|		И ВТНалоговаяБаза.ДатаНовойСтоимости = ВТСледующиеДатыНалоговойБазы.ТекущаяДата
		|";	

КонецФункции

Функция ТекстЗапросаНалоговаяБазаЗемельногоНалога2023()
	
	Возврат
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(КадастрНаНачалоГода.ОсновноеСредство, КадастрНаНачалоУчета.ОсновноеСредство) КАК ОсновноеСредство,
		|	ЕСТЬNULL(КадастрНаНачалоГода.ИнвентарныйНомер, КадастрНаНачалоУчета.ИнвентарныйНомер) КАК ИнвентарныйНомер,
		|	ЕСТЬNULL(КадастрНаНачалоГода.КадастроваяСтоимость, КадастрНаНачалоУчета.КадастроваяСтоимость) КАК КадастроваяСтоимость
		|ПОМЕСТИТЬ ВТ_Кадастр2023
		|ИЗ
		|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
		|			&ПериодНачало,
		|			Организация = &Организация
		|				И (ОсновноеСредство, ИнвентарныйНомер) В
		|					(ВЫБРАТЬ
		|						ВТ.ОсновноеСредство,
		|						ВТ.ИнвентарныйНомер
		|					ИЗ
		|						ВТ_РегистрацияМесяц КАК ВТ)) КАК КадастрНаНачалоГода
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияКадастровогоУчета.СрезПервых(
		|				&ПериодНачало,
		|				Организация = &Организация
		|					И (ОсновноеСредство, ИнвентарныйНомер) В
		|						(ВЫБРАТЬ
		|							ВТ.ОсновноеСредство,
		|							ВТ.ИнвентарныйНомер
		|						ИЗ
		|							ВТ_РегистрацияМесяц КАК ВТ)) КАК КадастрНаНачалоУчета
		|		ПО КадастрНаНачалоГода.ОсновноеСредство = КадастрНаНачалоУчета.ОсновноеСредство
		|			И КадастрНаНачалоГода.ИнвентарныйНомер = КадастрНаНачалоУчета.ИнвентарныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(КадастрНаНачалоГода.ОсновноеСредство, КадастрНаНачалоУчета.ОсновноеСредство) КАК ОсновноеСредство,
		|	ЕСТЬNULL(КадастрНаНачалоГода.ИнвентарныйНомер, КадастрНаНачалоУчета.ИнвентарныйНомер) КАК ИнвентарныйНомер,
		|	ЕСТЬNULL(КадастрНаНачалоГода.КадастроваяСтоимость, КадастрНаНачалоУчета.КадастроваяСтоимость) КАК КадастроваяСтоимость
		|ПОМЕСТИТЬ ВТ_Кадастр2022
		|ИЗ
		|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
		|			&ПериодНачало2022,
		|			Организация = &Организация
		|				И (ОсновноеСредство, ИнвентарныйНомер) В
		|					(ВЫБРАТЬ
		|						ВТ.ОсновноеСредство,
		|						ВТ.ИнвентарныйНомер
		|					ИЗ
		|						ВТ_РегистрацияМесяц КАК ВТ)) КАК КадастрНаНачалоГода
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияКадастровогоУчета.СрезПервых(
		|				&ПериодНачало,
		|				Организация = &Организация
		|					И (ОсновноеСредство, ИнвентарныйНомер) В
		|						(ВЫБРАТЬ
		|							ВТ.ОсновноеСредство,
		|							ВТ.ИнвентарныйНомер
		|						ИЗ
		|							ВТ_РегистрацияМесяц КАК ВТ)) КАК КадастрНаНачалоУчета
		|		ПО КадастрНаНачалоГода.ОсновноеСредство = КадастрНаНачалоУчета.ОсновноеСредство
		|			И КадастрНаНачалоГода.ИнвентарныйНомер = КадастрНаНачалоУчета.ИнвентарныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Кадастр2023.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТ_Кадастр2023.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВЫБОР
		|		КОГДА ВТ_Кадастр2022.КадастроваяСтоимость ЕСТЬ NULL
		|			ТОГДА ВТ_Кадастр2023.КадастроваяСтоимость
		|		КОГДА ВТ_Кадастр2022.КадастроваяСтоимость < ВТ_Кадастр2023.КадастроваяСтоимость
		|			ТОГДА ВТ_Кадастр2022.КадастроваяСтоимость
		|		ИНАЧЕ ВТ_Кадастр2023.КадастроваяСтоимость
		|	КОНЕЦ КАК КадастроваяСтоимость,
		|	&ПериодНачало КАК НачалоПериода,
		|	ДАТАВРЕМЯ(3999, 1, 1) КАК КонецПериода
		|ПОМЕСТИТЬ ВТНалоговаяБазаИнтервалы
		|ИЗ
		|	ВТ_Кадастр2023 КАК ВТ_Кадастр2023
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Кадастр2022 КАК ВТ_Кадастр2022
		|		ПО ВТ_Кадастр2023.ОсновноеСредство = ВТ_Кадастр2022.ОсновноеСредство
		|			И ВТ_Кадастр2023.ИнвентарныйНомер = ВТ_Кадастр2022.ИнвентарныйНомер";

КонецФункции

#КонецОбласти

#Область РасчетНалогаНаИмуществоПоСреднегодовойСтоимости

// Параметры:
//  ТаблицаПоСреднегодовой  - ТаблицаЗначений - см. РасчетИмущественныхНалогов.НоваяТаблицаПоСреднегодовой()
//  ПараметрыРасчета  - Структура - см. РасчетИмущественныхНалогов.ПараметрыРасчетаНалогаНаИмущество()
//
Процедура ЗаполнитьТаблицуПоСреднегодовой(ТаблицаПоСреднегодовой, ПараметрыРасчета)
	
	РабочиеНастройки = Новый НастройкиКомпоновкиДанных;
	Отбор = РабочиеНастройки.Отбор;
	ОбщийМодульСКД.ДобавитьЭлементОтбораКомпоновкиДанных(Отбор, "Организация", ВидСравненияКомпоновкиДанных.Равно,
		ПараметрыРасчета.Организация);
	ОбщийМодульСКД.ДобавитьЭлементОтбораКомпоновкиДанных(Отбор, "ВидИмущества", ВидСравненияКомпоновкиДанных.Равно,
		Перечисления.ВидыИмущества.НедвижимоеИмущество);
	ОбщийМодульСКД.ДобавитьЭлементОтбораКомпоновкиДанных(Отбор, "НалоговаяБаза", ВидСравненияКомпоновкиДанных.Равно,
		Перечисления.НалоговаяБазаПоНалогуНаИмущество.СреднегодоваяСтоимость);
	ОбщийМодульСКД.ДобавитьЭлементОтбораКомпоновкиДанных(Отбор, "ПорядокНалогообложения",
		ВидСравненияКомпоновкиДанных.НеРавно, Перечисления.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РасчетНалогаНаИмущество", Истина);
	ОсновнойНаборДанных = Отчеты.РасчетСреднегодовойСтоимостиИмущества.ОсновнойНаборДанных(
		НачалоГода(ПараметрыРасчета.ОтчетныйПериод), ПараметрыРасчета.ОтчетныйПериод + 1, РабочиеНастройки, ДопПараметры);
	
	ВнешниеНаборыДанных = Новый Структура("ОсновнойНаборДанных", ОсновнойНаборДанных);
	ВозможностьИспользованияВнешнихФункций = Истина;
	
	СхемаКомпоновкиДанных = Отчеты.РасчетСреднегодовойСтоимостиИмущества.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ВариантНастроек = СхемаКомпоновкиДанных.ВариантыНастроек.ВариантРасчет;
	Настройки = ВариантНастроек.Настройки;
	
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(Настройки, "ПериодОтчета", ПараметрыРасчета.ОтчетныйПериод + 1);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,,
		ВозможностьИспользованияВнешнихФункций);
		
	Результат = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);

	ЧислоПериодов = Месяц(ПараметрыРасчета.ОтчетныйПериод) + 1;
	ИменаКолонокОстаточнаяСтоимость = ИменаКолонокОстаточнаяСтоимость();
	
	Для каждого СтрокаРезультата Из Результат Цикл
		СтрокаТаблицы = ТаблицаПоСреднегодовой.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаРезультата);
		СтрокаТаблицы.КодПоОКТМО 		= СокрЛП(СтрокаРезультата.КодПоОКАТО);
		СтрокаТаблицы.СредняяСтоимость 	= СредняяСтоимостьЗаПериод(СтрокаТаблицы, ИменаКолонокОстаточнаяСтоимость, 
			ЧислоПериодов, 2);
		Если СтрокаТаблицы.ПорядокНалогообложения = Перечисления.ПорядокНалогообложенияИмущества.СнижениеСуммыНаСумму
			И ЧислоПериодов < 13 Тогда
			СтрокаТаблицы.СуммаУменьшенияСуммыНалога = СтрокаТаблицы.СуммаУменьшенияСуммыНалога / 4;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ТаблицаПоСреднегодовой  - ТаблицаЗначений - см. РасчетИмущественныхНалогов.НоваяТаблицаПоСреднегодовой()
//  ПараметрыРасчета  - Структура - см. РасчетИмущественныхНалогов.ПараметрыРасчетаНалогаНаИмущество()
//
Процедура ЗаполнитьАвансыРасчетПоСреднегодовой(ТаблицаПоСреднегодовой, ПараметрыРасчета)
	
	ОтчетныеПериоды = Новый Массив;
	ОтчетныйПериод = НачалоГода(ПараметрыРасчета.ОтчетныйПериод);
	Для Счетчик = 1 По 3 Цикл
		ОтчетныеПериоды.Добавить(КонецКвартала(ОтчетныйПериод));
	    ОтчетныйПериод = ДобавитьМесяц(ОтчетныйПериод, 3);	
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетНалогаНаИмуществоПоСреднегодовой.ОсновноеСредство КАК ОсновноеСредство,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.НалоговыйОрган КАК НалоговыйОрган,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.КодПоОКТМО КАК КодПоОКТМО,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.КодВидаИмущества КАК КодВидаИмущества,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.НалоговаяСтавка КАК НалоговаяСтавка,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.ПорядокНалогообложения КАК ПорядокНалогообложения,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.КодНалоговойЛьготыОсвобождениеОтНалогообложения КАК КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.КодОснованияЛьготы КАК КодОснованияЛьготы,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.ПроцентУменьшенияСуммыНалога КАК ПроцентУменьшенияСуммыНалога,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(РасчетНалогаНаИмущество.ОтчетныйПериод) = 3
		|				ТОГДА РасчетНалогаНаИмуществоПоСреднегодовой.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаАвансовыхПлатежей1Кв,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(РасчетНалогаНаИмущество.ОтчетныйПериод) = 6
		|				ТОГДА РасчетНалогаНаИмуществоПоСреднегодовой.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаАвансовыхПлатежей2Кв,
		|	СУММА(ВЫБОР
		|			КОГДА МЕСЯЦ(РасчетНалогаНаИмущество.ОтчетныйПериод) = 9
		|				ТОГДА РасчетНалогаНаИмуществоПоСреднегодовой.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаАвансовыхПлатежей3Кв
		|ИЗ
		|	Документ.РасчетНалогаНаИмущество.ПоСреднегодовой КАК РасчетНалогаНаИмуществоПоСреднегодовой
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетНалогаНаИмущество КАК РасчетНалогаНаИмущество
		|		ПО РасчетНалогаНаИмуществоПоСреднегодовой.Ссылка = РасчетНалогаНаИмущество.Ссылка
		|ГДЕ
		|	РасчетНалогаНаИмущество.Организация = &Организация
		|	И РасчетНалогаНаИмущество.Проведен
		|	И РасчетНалогаНаИмущество.ОтчетныйПериод В(&ОтчетныеПериоды)
		|	И РасчетНалогаНаИмуществоПоСреднегодовой.Сумма <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетНалогаНаИмуществоПоСреднегодовой.КодПоОКТМО,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.НалоговыйОрган,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.ИнвентарныйНомер,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.КодВидаИмущества,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.ОсновноеСредство,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.ДоляСтоимостиЧислитель,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.ДоляСтоимостиЗнаменатель,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.НалоговаяСтавка,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.ПорядокНалогообложения,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.КодНалоговойЛьготыОсвобождениеОтНалогообложения,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.КодОснованияЛьготы,
		|	РасчетНалогаНаИмуществоПоСреднегодовой.ПроцентУменьшенияСуммыНалога";
	
	Запрос.УстановитьПараметр("Организация", ПараметрыРасчета.Организация);
	Запрос.УстановитьПараметр("ОтчетныеПериоды", ОтчетныеПериоды);
	
	ПоляПоиска = "ОсновноеСредство,ИнвентарныйНомер,НалоговыйОрган,КодПоОКТМО,КодВидаИмущества,"
		+ "ДоляСтоимостиЧислитель,ДоляСтоимостиЗнаменатель,НалоговаяСтавка";
	СокращенныйПоиск = Новый Структура(ПоляПоиска);
	
	ПоляПоиска = ПоляПоиска + ","
		+ "ПорядокНалогообложения,КодНалоговойЛьготыОсвобождениеОтНалогообложения";
	ПолныйПоиск	= Новый Структура(ПоляПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаАвансы = РезультатЗапроса.Выбрать();
	Пока ВыборкаАвансы.Следующий() Цикл
    	ЗаполнитьЗначенияСвойств(ПолныйПоиск, ВыборкаАвансы);
		ПолныйПоиск.КодПоОКТМО = СокрЛП(ВыборкаАвансы.КодПоОКТМО);
		НашлиСтроки = ТаблицаПоСреднегодовой.НайтиСтроки(ПолныйПоиск);
		Если НашлиСтроки.Количество() = 0 Тогда
	    	ЗаполнитьЗначенияСвойств(СокращенныйПоиск, ПолныйПоиск);
			НашлиСтроки = ТаблицаПоСреднегодовой.НайтиСтроки(СокращенныйПоиск);
		КонецЕсли;
		
		Если НашлиСтроки.Количество() > 0 Тогда
			СтрокаРасчета = НашлиСтроки[0];
			СтрокаРасчета.СуммаАвансовыхПлатежей1Кв = СтрокаРасчета.СуммаАвансовыхПлатежей1Кв 
				+ ВыборкаАвансы.СуммаАвансовыхПлатежей1Кв;
			СтрокаРасчета.СуммаАвансовыхПлатежей2Кв = СтрокаРасчета.СуммаАвансовыхПлатежей2Кв 
				+ ВыборкаАвансы.СуммаАвансовыхПлатежей2Кв;
			СтрокаРасчета.СуммаАвансовыхПлатежей3Кв = СтрокаРасчета.СуммаАвансовыхПлатежей3Кв 
				+ ВыборкаАвансы.СуммаАвансовыхПлатежей3Кв;
		Иначе
			СтрокаРасчета = ТаблицаПоСреднегодовой.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРасчета, ВыборкаАвансы);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция СложитьРасчетНалогаПоЛистам(РасчетНалогаПоЛистам, НалогНаИмуществоОбъединятьЛисты) Экспорт
	
	ЛистыСложения = Новый Структура;
	ЛистыСложения.Вставить("Льготируемое", Неопределено);
	ЛистыСложения.Вставить("Сложение", Неопределено);
	
	Если Не НалогНаИмуществоОбъединятьЛисты Тогда
		Возврат ЛистыСложения;
	КонецЕсли;
	
	Льготы160 = РасчетНалогаПоЛистам.НайтиСтроки(
		Новый Структура("ПорядокНалогообложения", Перечисления.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения));
		
	Если Льготы160.Количество() = 1 Тогда
		ЛистыСложения.Льготируемое = Льготы160[0];
	Иначе
		Возврат ЛистыСложения;
	КонецЕсли;
	
	БезЛьгот = РасчетНалогаПоЛистам.НайтиСтроки(
		Новый Структура("ПорядокНалогообложения", Перечисления.ПорядокНалогообложенияИмущества.ОсобыеЛьготыНеУстановлены));
	
	ЕстьБезЛьгот = БезЛьгот.Количество() > 0 
		И (БезЛьгот[0].ОстаточнаяСтоимостьНа0101 > 0
		ИЛИ БезЛьгот[0].ОстаточнаяСтоимостьНа0102 > 0	
		ИЛИ БезЛьгот[0].ОстаточнаяСтоимостьНа0103 > 0	
		ИЛИ БезЛьгот[0].ОстаточнаяСтоимостьНа0104 > 0	
		ИЛИ БезЛьгот[0].ОстаточнаяСтоимостьНа0105 > 0	
		ИЛИ БезЛьгот[0].ОстаточнаяСтоимостьНа0106 > 0	
		ИЛИ БезЛьгот[0].ОстаточнаяСтоимостьНа0107 > 0	
		ИЛИ БезЛьгот[0].ОстаточнаяСтоимостьНа0108 > 0	
		ИЛИ БезЛьгот[0].ОстаточнаяСтоимостьНа0109 > 0	
		ИЛИ БезЛьгот[0].ОстаточнаяСтоимостьНа0110 > 0	
		ИЛИ БезЛьгот[0].ОстаточнаяСтоимостьНа0111 > 0	
		ИЛИ БезЛьгот[0].ОстаточнаяСтоимостьНа0112 > 0	
		ИЛИ БезЛьгот[0].ОстаточнаяСтоимостьНа3112 > 0);
		
	Если ЕстьБезЛьгот Тогда
		ЛистыСложения.Сложение = БезЛьгот[0];
		СложитьДанныеЛистов(ЛистыСложения);
		Возврат ЛистыСложения;
	КонецЕсли;
	
	Льготы200 = РасчетНалогаПоЛистам.НайтиСтроки(
		Новый Структура("ПорядокНалогообложения", Перечисления.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке));		

	Если Льготы200.Количество() = 1 Тогда
		ЛистыСложения.Сложение = Льготы200[0];
		СложитьДанныеЛистов(ЛистыСложения);
		Возврат ЛистыСложения;
	КонецЕсли;
	
	Льготы230 = РасчетНалогаПоЛистам.НайтиСтроки(
		Новый Структура("ПорядокНалогообложения", Перечисления.ПорядокНалогообложенияИмущества.СнижениеСуммыНаПроцент));		
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Льготы230, РасчетНалогаПоЛистам.НайтиСтроки(
		Новый Структура("ПорядокНалогообложения", Перечисления.ПорядокНалогообложенияИмущества.СнижениеСуммыНаСумму)));
	
	Если Льготы230.Количество() = 1 Тогда
		ЛистыСложения.Сложение = Льготы230[0];
		СложитьДанныеЛистов(ЛистыСложения);
		Возврат ЛистыСложения;
	КонецЕсли;
	
	Возврат ЛистыСложения;
	
КонецФункции

Процедура СложитьДанныеЛистов(ЛистыСложения)
	Для каждого ИмяКолонки Из ИменаКолонокОстаточнаяСтоимость() Цикл
		ЛистыСложения.Сложение[ИмяКолонки] = ЛистыСложения.Сложение[ИмяКолонки] + ЛистыСложения.Льготируемое[ИмяКолонки]; 
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область РасчетНалогаНаИмуществоПоКадастровойСтоимости

// Инициализация таблицы расчета налога
//
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция НоваяТаблицаПоКадастровой()

	ТаблицаПоКадастровой = Новый ТаблицаЗначений;
	Колонки = ТаблицаПоКадастровой.Колонки;

	Знак = ДопустимыйЗнак.Неотрицательный;

	Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	Колонки.Добавить("НалоговыйОрган", Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	Колонки.Добавить("КодПоОКТМО", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(11)));
	Колонки.Добавить("КодВидаИмущества", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(2)));

	Колонки.Добавить("НалоговаяСтавка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(4, 2, Знак)));
	Колонки.Добавить("ДоляСтоимостиЧислитель", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, Знак)));
	Колонки.Добавить("ДоляСтоимостиЗнаменатель", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, Знак)));
	
	Колонки.Добавить("ДоляВПравеОбщейСобственностиЧислитель",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, Знак)));
		
	Колонки.Добавить("ДоляВПравеОбщейСобственностиЗнаменатель",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, Знак)));
		
	Колонки.Добавить("КадастроваяСтоимость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	
	Колонки.Добавить("НеоблагаемаяКадастроваяСтоимость",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, Знак)));
	Колонки.Добавить("ПорядокНалогообложения", 		
		Новый ОписаниеТипов("ПеречислениеСсылка.ПорядокНалогообложенияИмущества"));
		
	Колонки.Добавить("МесяцевВладения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2, 0, Знак)));

	Колонки.Добавить("СуммаИсчислено", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	Колонки.Добавить("СуммаАванса", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));

	Возврат ТаблицаПоКадастровой;

КонецФункции

// Параметры:
//   ТаблицаПоКадастровой - см. НоваяТаблицаПоКадастровой()
//   ПараметрыРасчета - см. РасчетИмущественныхНалогов.ПараметрыРасчетаНалогаНаИмущество() 
// 
Процедура ЗаполнитьТаблицуПоКадастровой(ТаблицаПоКадастровой, ПараметрыРасчета)

	Организация = ПараметрыРасчета.Организация;
	ОтчетныйПериод = ПараметрыРасчета.ОтчетныйПериод;
	ГодРасчета = Год(ОтчетныйПериод);
	ГодовойРасчет = Месяц(ОтчетныйПериод) = 12;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаПоКадастровой", ТаблицаПоКадастровой);
	Запрос.УстановитьПараметр("Организация", Организация);

	Запрос.Текст = ТекстЗапросаПустаяТаблицаПоКадастровой();
	Запрос.Выполнить();

	Если ГодовойРасчет Тогда
		ПервыйМесяцРасчета = 1;
	Иначе
		ПервыйМесяцРасчета = Месяц(НачалоКвартала(ОтчетныйПериод));
	КонецЕсли;

	Запрос.Текст = ТекстЗапросаПоКадастровойЗаМесяц();
	
	Для НомерМесяца = ПервыйМесяцРасчета По Месяц(ОтчетныйПериод) Цикл
		
		ПериодПроверкиСтавки = Дата(ГодРасчета, НомерМесяца, 15, 23, 59, 59);
		
		Запрос.УстановитьПараметр("ПериодПроверкиСтавки", ПериодПроверкиСтавки);
		Запрос.УстановитьПараметр("КонецДняНачалоМесяца", КонецДня(НачалоМесяца(ПериодПроверкиСтавки)));
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПериодПроверкиСтавки));
		
		//@skip-check query-in-loop
		Запрос.Выполнить();

	КонецЦикла;
	
	Если ГодовойРасчет Тогда
		Запрос.Текст = ТекстЗапросаДобавитьАванс();
		ОтчетныеПериоды = Новый Массив;
		ПериодАванса = НачалоГода(ОтчетныйПериод);
		Для Счетчик = 1 По 3 Цикл
			ОтчетныеПериоды.Добавить(КонецКвартала(ПериодАванса));
		    ПериодАванса = ДобавитьМесяц(ПериодАванса, 3);	
		КонецЦикла;
		Запрос.УстановитьПараметр("ОтчетныеПериоды", ОтчетныеПериоды);
		Запрос.Выполнить();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаПоКадастровой();
	Запрос.УстановитьПараметр("ПериодОпределенияКадастровойСтоимости", НачалоГода(ОтчетныйПериод));
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	ПараметрыРасчетаСуммы =
		РасчетИмущественныхНалоговКлиентСервер.ПараметрыРасчетаСуммаНалогаНаИмуществоПоКадастровойСтоимости();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НоваяСтрока = ТаблицаПоКадастровой.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		ЗаполнитьЗначенияСвойств(ПараметрыРасчетаСуммы, НоваяСтрока);
		
		НоваяСтрока.СуммаИсчислено =
			РасчетИмущественныхНалоговКлиентСервер.СуммаНалогаНаИмуществоПоКадастровойСтоимости(ПараметрыРасчетаСуммы);
		
		НоваяСтрока.Сумма = НоваяСтрока.СуммаИсчислено - ?(ГодовойРасчет, НоваяСтрока.СуммаАванса, 0);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаПустаяТаблицаПоКадастровой()

	Возврат
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка) КАК ОсновноеСредство,
		|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК ИнвентарныйНомер,
		|	ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка) КАК НалоговыйОрган,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(11)) КАК КодПоОКТМО,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(2)) КАК КодВидаИмущества,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК НеоблагаемаяКадастроваяСтоимость,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(10, 0)) КАК ДоляСтоимостиЧислитель,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(10, 0)) КАК ДоляСтоимостиЗнаменатель,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(10, 0)) КАК ДоляВПравеОбщейСобственностиЧислитель,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(10, 0)) КАК ДоляВПравеОбщейСобственностиЗнаменатель,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(4, 2)) КАК НалоговаяСтавка,
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ПустаяСсылка) КАК ПорядокНалогообложения,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(2, 0)) КАК МесяцевВладения,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 0)) КАК СуммаАванса
		|ПОМЕСТИТЬ ВТПоКадастровойСложение
		|ГДЕ
		|	ЛОЖЬ";

КонецФункции  

Функция ТекстЗапросаПоКадастровойЗаМесяц()

	Возврат
		"ВЫБРАТЬ
		|	СтавкиСрезПоследних.Организация КАК Организация,
		|	СтавкиСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	СтавкиСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	СтавкиСрезПоследних.НалоговыйОрган КАК НалоговыйОрган,
		|	СтавкиСрезПоследних.КодПоОКТМО КАК КодПоОКТМО,
		|	СтавкиСрезПоследних.КодВидаИмущества КАК КодВидаИмущества,
		|	СтавкиСрезПоследних.НеоблагаемаяКадастроваяСтоимость КАК НеоблагаемаяКадастроваяСтоимость,
		|	СтавкиСрезПоследних.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
		|	СтавкиСрезПоследних.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
		|	СтавкиСрезПоследних.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
		|	СтавкиСрезПоследних.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
		|	СтавкиСрезПоследних.НалоговаяСтавка КАК НалоговаяСтавка,
		|	СтавкиСрезПоследних.ПорядокНалогообложения КАК ПорядокНалогообложения,
		|	ВЫБОР
		|		КОГДА СтавкиСрезПоследних.ПорядокНалогообложения В (ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения),
		|																ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке))
		|				И СтавкиСрезПоследних.Период > &КонецДняНачалоМесяца
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РегистрацияЛьготнойСтавкиВТекущемПериоде,
		|	ВЫБОР
		|		КОГДА СтавкиСрезПоследних.ПорядокНалогообложения В (ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения),
		|																ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЛьготнаяСтавка
		|ПОМЕСТИТЬ ВТСтавки
		|ИЗ
		|	РегистрСведений.СтавкиНалогаНаИмуществоПоОсновнымСредствам.СрезПоследних(&ПериодПроверкиСтавки, Организация = &Организация) КАК СтавкиСрезПоследних
		|ГДЕ
		|	СтавкиСрезПоследних.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость)
		|	И СтавкиСрезПоследних.ПорядокНалогообложения В (ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсобыеЛьготыНеУстановлены),
		|													ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения),
		|													ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкиНачалоМесяца.Организация КАК Организация,
		|	СтавкиНачалоМесяца.ОсновноеСредство КАК ОсновноеСредство,
		|	СтавкиНачалоМесяца.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	СтавкиНачалоМесяца.НалоговыйОрган КАК НалоговыйОрган,
		|	СтавкиНачалоМесяца.КодПоОКТМО КАК КодПоОКТМО,
		|	СтавкиНачалоМесяца.НалоговаяСтавка КАК НалоговаяСтавка,
		|	СтавкиНачалоМесяца.ПорядокНалогообложения КАК ПорядокНалогообложения,
		|	ИСТИНА КАК ЕстьСтавка
		|ПОМЕСТИТЬ ВТЛьготыНачалоМесяца
		|ИЗ
		|	РегистрСведений.СтавкиНалогаНаИмуществоПоОсновнымСредствам.СрезПоследних(
		|			&КонецДняНачалоМесяца,
		|			(Организация, ОсновноеСредство, ИнвентарныйНомер, НалоговыйОрган, КодПоОКТМО) В
		|				(ВЫБРАТЬ
		|					ВТСтавки.Организация,
		|					ВТСтавки.ОсновноеСредство,
		|					ВТСтавки.ИнвентарныйНомер,
		|					ВТСтавки.НалоговыйОрган,
		|					ВТСтавки.КодПоОКТМО
		|				ИЗ
		|					ВТСтавки
		|				ГДЕ
		|					ВТСтавки.РегистрацияЛьготнойСтавкиВТекущемПериоде)) КАК СтавкиНачалоМесяца
		|ГДЕ
		|	СтавкиНачалоМесяца.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость)
		|	И СтавкиНачалоМесяца.ПорядокНалогообложения В (ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсобыеЛьготыНеУстановлены),
		|													ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения),
		|													ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкиНалога.Организация КАК Организация,
		|	СтавкиНалога.ОсновноеСредство КАК ОсновноеСредство,
		|	СтавкиНалога.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	СтавкиНалога.НалоговыйОрган КАК НалоговыйОрган,
		|	СтавкиНалога.КодПоОКТМО КАК КодПоОКТМО,
		|	МАКСИМУМ(СтавкиНалога.НалоговаяСтавка) КАК НалоговаяСтавка,
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсобыеЛьготыНеУстановлены) КАК ПорядокНалогообложения,
		|	ИСТИНА КАК ОтменаЛьготы
		|ПОМЕСТИТЬ ВТОтменаЛьготыВТекущемПериоде
		|ИЗ
		|	РегистрСведений.СтавкиНалогаНаИмуществоПоОсновнымСредствам КАК СтавкиНалога
		|ГДЕ
		|	(СтавкиНалога.Организация, СтавкиНалога.ОсновноеСредство, СтавкиНалога.ИнвентарныйНомер, СтавкиНалога.НалоговыйОрган, СтавкиНалога.КодПоОКТМО) В
		|			(ВЫБРАТЬ
		|				ВТСтавки.Организация,
		|				ВТСтавки.ОсновноеСредство,
		|				ВТСтавки.ИнвентарныйНомер,
		|				ВТСтавки.НалоговыйОрган,
		|				ВТСтавки.КодПоОКТМО
		|			ИЗ
		|				ВТСтавки
		|			ГДЕ
		|				ВТСтавки.ЛьготнаяСтавка)
		|	И СтавкиНалога.Период > &ПериодПроверкиСтавки
		|	И СтавкиНалога.Период <= &КонецМесяца
		|	И СтавкиНалога.ПорядокНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсобыеЛьготыНеУстановлены)
		|	И СтавкиНалога.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиНалога.Организация,
		|	СтавкиНалога.ОсновноеСредство,
		|	СтавкиНалога.ИнвентарныйНомер,
		|	СтавкиНалога.НалоговыйОрган,
		|	СтавкиНалога.КодПоОКТМО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСтавки.Организация КАК Организация,
		|	ВТСтавки.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТСтавки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ВТСтавки.НалоговыйОрган КАК НалоговыйОрган,
		|	ВТСтавки.КодПоОКТМО КАК КодПоОКТМО,
		|	ВТСтавки.КодВидаИмущества КАК КодВидаИмущества,
		|	ВТСтавки.НеоблагаемаяКадастроваяСтоимость КАК НеоблагаемаяКадастроваяСтоимость,
		|	ВТСтавки.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
		|	ВТСтавки.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
		|	ВТСтавки.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
		|	ВТСтавки.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
		|	ВЫБОР
		|		КОГДА ВТСтавки.РегистрацияЛьготнойСтавкиВТекущемПериоде
		|				И ЕСТЬNULL(ВТЛьготыНачалоМесяца.ЕстьСтавка, ЛОЖЬ)
		|			ТОГДА ВТЛьготыНачалоМесяца.НалоговаяСтавка
		|		КОГДА ВТСтавки.ЛьготнаяСтавка
		|				И ЕСТЬNULL(ВТОтменаЛьготыВТекущемПериоде.ОтменаЛьготы, ЛОЖЬ)
		|			ТОГДА ВТОтменаЛьготыВТекущемПериоде.НалоговаяСтавка
		|		ИНАЧЕ ВТСтавки.НалоговаяСтавка
		|	КОНЕЦ КАК НалоговаяСтавка,
		|	ВЫБОР
		|		КОГДА ВТСтавки.РегистрацияЛьготнойСтавкиВТекущемПериоде
		|				И ЕСТЬNULL(ВТЛьготыНачалоМесяца.ЕстьСтавка, ЛОЖЬ)
		|			ТОГДА ВТЛьготыНачалоМесяца.ПорядокНалогообложения
		|		КОГДА ВТСтавки.ЛьготнаяСтавка
		|				И ЕСТЬNULL(ВТОтменаЛьготыВТекущемПериоде.ОтменаЛьготы, ЛОЖЬ)
		|			ТОГДА ВТОтменаЛьготыВТекущемПериоде.ПорядокНалогообложения
		|		ИНАЧЕ ВТСтавки.ПорядокНалогообложения
		|	КОНЕЦ КАК ПорядокНалогообложения,
		|	1 КАК МесяцевВладения,
		|	0 КАК СуммаАванса
		|ДОБАВИТЬ ВТПоКадастровойСложение
		|ИЗ
		|	ВТСтавки КАК ВТСтавки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛьготыНачалоМесяца КАК ВТЛьготыНачалоМесяца
		|		ПО ВТСтавки.Организация = ВТЛьготыНачалоМесяца.Организация
		|			И ВТСтавки.ОсновноеСредство = ВТЛьготыНачалоМесяца.ОсновноеСредство
		|			И ВТСтавки.ИнвентарныйНомер = ВТЛьготыНачалоМесяца.ИнвентарныйНомер
		|			И ВТСтавки.НалоговыйОрган = ВТЛьготыНачалоМесяца.НалоговыйОрган
		|			И ВТСтавки.КодПоОКТМО = ВТЛьготыНачалоМесяца.КодПоОКТМО
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтменаЛьготыВТекущемПериоде КАК ВТОтменаЛьготыВТекущемПериоде
		|		ПО ВТСтавки.Организация = ВТОтменаЛьготыВТекущемПериоде.Организация
		|			И ВТСтавки.ОсновноеСредство = ВТОтменаЛьготыВТекущемПериоде.ОсновноеСредство
		|			И ВТСтавки.ИнвентарныйНомер = ВТОтменаЛьготыВТекущемПериоде.ИнвентарныйНомер
		|			И ВТСтавки.НалоговыйОрган = ВТОтменаЛьготыВТекущемПериоде.НалоговыйОрган
		|			И ВТСтавки.КодПоОКТМО = ВТОтменаЛьготыВТекущемПериоде.КодПоОКТМО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСтавки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТЛьготыНачалоМесяца
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОтменаЛьготыВТекущемПериоде";
		
КонецФункции  

Функция ТекстЗапросаДобавитьАванс()

	Возврат
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетНалогаНаИмущество.Организация КАК Организация,
		|	РасчетНалогаНаИмуществоПоКадастровой.ОсновноеСредство КАК ОсновноеСредство,
		|	РасчетНалогаНаИмуществоПоКадастровой.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	РасчетНалогаНаИмуществоПоКадастровой.НалоговыйОрган КАК НалоговыйОрган,
		|	РасчетНалогаНаИмуществоПоКадастровой.КодПоОКТМО КАК КодПоОКТМО,
		|	РасчетНалогаНаИмуществоПоКадастровой.КодВидаИмущества КАК КодВидаИмущества,
		|	РасчетНалогаНаИмуществоПоКадастровой.НеоблагаемаяКадастроваяСтоимость КАК НеоблагаемаяКадастроваяСтоимость,
		|	РасчетНалогаНаИмуществоПоКадастровой.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
		|	РасчетНалогаНаИмуществоПоКадастровой.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
		|	РасчетНалогаНаИмуществоПоКадастровой.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
		|	РасчетНалогаНаИмуществоПоКадастровой.ДоляВПравеОбщейСобственностиЗнаменатель КАК
		|		ДоляВПравеОбщейСобственностиЗнаменатель,
		|	РасчетНалогаНаИмуществоПоКадастровой.НалоговаяСтавка КАК НалоговаяСтавка,
		|	РасчетНалогаНаИмуществоПоКадастровой.ПорядокНалогообложения КАК ПорядокНалогообложения,
		|	0 КАК МесяцевВладения,
		|	РасчетНалогаНаИмуществоПоКадастровой.Сумма КАК СуммаАванса
		|ДОБАВИТЬ ВТПоКадастровойСложение
		|ИЗ
		|	Документ.РасчетНалогаНаИмущество КАК РасчетНалогаНаИмущество
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасчетНалогаНаИмущество.ПоКадастровой КАК РасчетНалогаНаИмуществоПоКадастровой
		|		ПО РасчетНалогаНаИмущество.Ссылка = РасчетНалогаНаИмуществоПоКадастровой.Ссылка
		|ГДЕ
		|	РасчетНалогаНаИмущество.Организация = &Организация
		|	И РасчетНалогаНаИмущество.Проведен
		|	И РасчетНалогаНаИмущество.ОтчетныйПериод В (&ОтчетныеПериоды)
		|	И РасчетНалогаНаИмуществоПоКадастровой.Сумма > 0";

КонецФункции

Функция ТекстЗапросаПоКадастровой()

	Возврат
		"ВЫБРАТЬ
		|	ВТПоКадастровойСложение.Организация КАК Организация,
		|	ВТПоКадастровойСложение.ОсновноеСредство КАК ОсновноеСредство,
		|	ВТПоКадастровойСложение.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ЕСТЬNULL(РегистрацииВНалоговомОргане.Ссылка, Организации.РегистрацияВНалоговомОргане) КАК НалоговыйОрган,
		|	ВЫБОР
		|		КОГДА ВТПоКадастровойСложение.КодПоОКТМО <> """"
		|			ТОГДА ВТПоКадастровойСложение.КодПоОКТМО
		|		КОГДА НЕ РегистрацииВНалоговомОргане.КодПоОКТМО ЕСТЬ NULL
		|			ТОГДА РегистрацииВНалоговомОргане.КодПоОКТМО
		|		ИНАЧЕ Организации.КодОКТМО
		|	КОНЕЦ КАК КодПоОКТМО,
		|	ВТПоКадастровойСложение.КодВидаИмущества КАК КодВидаИмущества,
		|	ВТПоКадастровойСложение.НеоблагаемаяКадастроваяСтоимость КАК НеоблагаемаяКадастроваяСтоимость,
		|	ВТПоКадастровойСложение.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
		|	ВТПоКадастровойСложение.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
		|	ВТПоКадастровойСложение.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
		|	ВТПоКадастровойСложение.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
		|	ВТПоКадастровойСложение.НалоговаяСтавка КАК НалоговаяСтавка,
		|	ВТПоКадастровойСложение.ПорядокНалогообложения КАК ПорядокНалогообложения,
		|	СУММА(ВТПоКадастровойСложение.МесяцевВладения) КАК МесяцевВладения,
		|	СУММА(ВТПоКадастровойСложение.СуммаАванса) КАК СуммаАванса
		|ПОМЕСТИТЬ ВТПоКадастровой
		|ИЗ
		|	ВТПоКадастровойСложение КАК ВТПоКадастровойСложение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО ВТПоКадастровойСложение.НалоговыйОрган = РегистрацииВНалоговомОргане.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ВТПоКадастровойСложение.Организация = Организации.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВТПоКадастровойСложение.Организация,
		|	ВТПоКадастровойСложение.ОсновноеСредство,
		|	ВТПоКадастровойСложение.ИнвентарныйНомер,
		|	ЕСТЬNULL(РегистрацииВНалоговомОргане.Ссылка, Организации.РегистрацияВНалоговомОргане),
		|	ВЫБОР
		|		КОГДА ВТПоКадастровойСложение.КодПоОКТМО <> """"
		|			ТОГДА ВТПоКадастровойСложение.КодПоОКТМО
		|		КОГДА НЕ РегистрацииВНалоговомОргане.КодПоОКТМО ЕСТЬ NULL
		|			ТОГДА РегистрацииВНалоговомОргане.КодПоОКТМО
		|		ИНАЧЕ Организации.КодОКТМО
		|	КОНЕЦ,
		|	ВТПоКадастровойСложение.КодВидаИмущества,
		|	ВТПоКадастровойСложение.НеоблагаемаяКадастроваяСтоимость,
		|	ВТПоКадастровойСложение.ДоляСтоимостиЧислитель,
		|	ВТПоКадастровойСложение.ДоляСтоимостиЗнаменатель,
		|	ВТПоКадастровойСложение.ДоляВПравеОбщейСобственностиЧислитель,
		|	ВТПоКадастровойСложение.ДоляВПравеОбщейСобственностиЗнаменатель,
		|	ВТПоКадастровойСложение.НалоговаяСтавка,
		|	ВТПоКадастровойСложение.ПорядокНалогообложения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияКадастровогоУчетаСрезПоследних.Организация КАК Организация,
		|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
		|	СведенияКадастровогоУчетаСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	СведенияКадастровогоУчетаСрезПоследних.КадастроваяСтоимость КАК КадастроваяСтоимость
		|ПОМЕСТИТЬ ВТКадастроваяСтоимость
		|ИЗ
		|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(&ПериодОпределенияКадастровойСтоимости, (Организация,
		|		ОсновноеСредство, ИнвентарныйНомер) В
		|		(ВЫБРАТЬ
		|			ВТПоКадастровой.Организация,
		|			ВТПоКадастровой.ОсновноеСредство,
		|			ВТПоКадастровой.ИнвентарныйНомер
		|		ИЗ
		|			ВТПоКадастровой КАК ВТПоКадастровой)) КАК СведенияКадастровогоУчетаСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияКадастровогоУчетаСрезПервых.Организация КАК Организация,
		|	СведенияКадастровогоУчетаСрезПервых.ОсновноеСредство КАК ОсновноеСредство,
		|	СведенияКадастровогоУчетаСрезПервых.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	СведенияКадастровогоУчетаСрезПервых.КадастроваяСтоимость КАК КадастроваяСтоимость
		|ПОМЕСТИТЬ ВТКадастроваяСтоимостьТекущийПериод
		|ИЗ
		|	РегистрСведений.СведенияКадастровогоУчета.СрезПервых(&ПериодОпределенияКадастровойСтоимости, (Организация,
		|		ОсновноеСредство, ИнвентарныйНомер) В
		|		(ВЫБРАТЬ
		|			ВТПоКадастровой.Организация,
		|			ВТПоКадастровой.ОсновноеСредство,
		|			ВТПоКадастровой.ИнвентарныйНомер
		|		ИЗ
		|			ВТПоКадастровой КАК ВТПоКадастровой)) КАК СведенияКадастровогоУчетаСрезПервых
		|ГДЕ
		|	СведенияКадастровогоУчетаСрезПервых.Период < &ОтчетныйПериод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПоКадастровой.ОсновноеСредство КАК ОсновноеСредство,
		|	ОсновныеСредства.Наименование КАК ОсновноеСредствоНаименование,
		|	ВТПоКадастровой.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ЕСТЬNULL(РегистрацииВНалоговомОргане.Ссылка, Организации.РегистрацияВНалоговомОргане) КАК НалоговыйОрган,
		|	ВЫБОР
		|		КОГДА ВТПоКадастровой.КодПоОКТМО <> """"
		|			ТОГДА ВТПоКадастровой.КодПоОКТМО
		|		КОГДА НЕ РегистрацииВНалоговомОргане.КодПоОКТМО ЕСТЬ NULL
		|			ТОГДА РегистрацииВНалоговомОргане.КодПоОКТМО
		|		ИНАЧЕ Организации.КодОКТМО
		|	КОНЕЦ КАК КодПоОКТМО,
		|	ВТПоКадастровой.КодВидаИмущества КАК КодВидаИмущества,
		|	ЕСТЬNULL(ВТКадастроваяСтоимость.КадастроваяСтоимость,
		|		ЕСТЬNULL(ВТКадастроваяСтоимостьТекущийПериод.КадастроваяСтоимость, 0)) КАК КадастроваяСтоимость,
		|	ВТПоКадастровой.НеоблагаемаяКадастроваяСтоимость КАК НеоблагаемаяКадастроваяСтоимость,
		|	ВТПоКадастровой.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
		|	ВТПоКадастровой.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
		|	ВТПоКадастровой.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
		|	ВТПоКадастровой.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
		|	ВТПоКадастровой.НалоговаяСтавка КАК НалоговаяСтавка,
		|	ВТПоКадастровой.ПорядокНалогообложения КАК ПорядокНалогообложения,
		|	ВТПоКадастровой.МесяцевВладения КАК МесяцевВладения,
		|	ВТПоКадастровой.СуммаАванса КАК СуммаАванса
		|ИЗ
		|	ВТПоКадастровой КАК ВТПоКадастровой
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
		|		ПО ВТПоКадастровой.ОсновноеСредство = ОсновныеСредства.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО ВТПоКадастровой.НалоговыйОрган = РегистрацииВНалоговомОргане.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО ВТПоКадастровой.Организация = Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадастроваяСтоимость КАК ВТКадастроваяСтоимость
		|		ПО ВТПоКадастровой.Организация = ВТКадастроваяСтоимость.Организация
		|		И ВТПоКадастровой.ОсновноеСредство = ВТКадастроваяСтоимость.ОсновноеСредство
		|		И ВТПоКадастровой.ИнвентарныйНомер = ВТКадастроваяСтоимость.ИнвентарныйНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадастроваяСтоимостьТекущийПериод КАК ВТКадастроваяСтоимостьТекущийПериод
		|		ПО ВТПоКадастровой.Организация = ВТКадастроваяСтоимостьТекущийПериод.Организация
		|		И ВТПоКадастровой.ОсновноеСредство = ВТКадастроваяСтоимостьТекущийПериод.ОсновноеСредство
		|		И ВТПоКадастровой.ИнвентарныйНомер = ВТКадастроваяСтоимостьТекущийПериод.ИнвентарныйНомер
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОсновноеСредствоНаименование";
		
КонецФункции

#КонецОбласти

#КонецОбласти