#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.Ответственный = Пользователи.АвторизованныйПользователь();
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговоровПриИзменении(Элемент)
	
	Если Объект.ВидДоговоров = ПредыдущийВидДоговоров Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьДанныеВДокументе =
		(Объект.ИсполнениеДоговоров.Количество() > 0
		ИЛИ Объект.ОплатаПоДоговорам.Количество() > 0);
	ТекстВопроса = "";
	Если Объект.Проведен И ЕстьДанныеВДокументе Тогда
		ТекстВопроса = НСтр("ru = 'Проведение документа будет отменено, а данные будут очищены. Продолжить?'");
	ИначеЕсли Объект.Проведен Тогда
		ТекстВопроса = НСтр("ru = 'Проведение документа будет отменено. Продолжить?'");
	ИначеЕсли ЕстьДанныеВДокументе Тогда
		ТекстВопроса = НСтр("ru = 'Данные документа будут очищены. Продолжить?'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		ДополнительныеПараметры = Новый Структура("ОчиститьДокумент", ЕстьДанныеВДокументе);
		Оповещение = Новый ОписаниеОповещения("ВидДоговоровПриИзмененииОбработкаОтвета", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ВидДоговоровПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговоровПриИзмененииОбработкаОтвета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ВидДоговоровПриИзмененииНаСервере(ДополнительныеПараметры.ОчиститьДокумент);
	Иначе
		Объект.ВидДоговоров = ПредыдущийВидДоговоров;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидДоговоровПриИзмененииНаСервере(ОчиститьДокумент = Ложь)
	
	Если ОчиститьДокумент Тогда
		Объект.ИсполнениеДоговоров.Очистить();
		Объект.ОплатаПоДоговорам.Очистить();
	КонецЕсли;
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	ИспользоватьДетализациюПоКОСГУВГрафиках = КонтрольИсполненияДоговоров.ИспользоватьДетализациюПоКОСГУВГрафикахПоДоговорам(Объект.ВидДоговоров);
	ИспользоватьДополнительнуюАналитикуВГрафикахПлатежей = КонтрольИсполненияДоговоров.ИспользоватьДополнительнуюАналитикуВГрафикахПлатежей(Объект.ВидДоговоров);
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
	ПредыдущийВидДоговоров = Объект.ВидДоговоров;
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьГрафикИсполнения(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Организация");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидДоговоров) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Вид договоров'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.ВидДоговоров");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ЗаполнитьГрафикИсполнения", Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнитьГрафикПлатежей", Ложь);
	
	ЕстьДанныеВДокументе = (Объект.ИсполнениеДоговоров.Количество() > 0);
	
	ТекстВопроса = "";
	Если Объект.Проведен И ЕстьДанныеВДокументе Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением проведение документа будет отменено, а табличная часть будет очищена. Заполнить?'");
	ИначеЕсли Объект.Проведен Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением проведение документа будет отменено. Заполнить?'");
	ИначеЕсли ЕстьДанныеВДокументе Тогда
		ТекстВопроса = НСтр("ru = 'Табличная часть документа будет очищена. Заполнить?'");
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьДокументЗавершение", ЭтотОбъект, ПараметрыЗаполнения);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьДокументНаСервере(
			ПараметрыЗаполнения.ЗаполнитьГрафикИсполнения,
			ПараметрыЗаполнения.ЗаполнитьГрафикПлатежей);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикПлатежей(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Организация");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВидДоговоров) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Вид договоров'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.ВидДоговоров");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ЗаполнитьГрафикИсполнения", Ложь);
	ПараметрыЗаполнения.Вставить("ЗаполнитьГрафикПлатежей", Истина);
	
	ЕстьДанныеВДокументе = (Объект.ОплатаПоДоговорам.Количество() > 0);
	
	ТекстВопроса = "";
	Если Объект.Проведен И ЕстьДанныеВДокументе Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением проведение документа будет отменено, а табличная часть будет очищена. Заполнить?'");
	ИначеЕсли Объект.Проведен Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением проведение документа будет отменено. Заполнить?'");
	ИначеЕсли ЕстьДанныеВДокументе Тогда
		ТекстВопроса = НСтр("ru = 'Табличная часть документа будет очищена. Заполнить?'");
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьДокументЗавершение", ЭтотОбъект, ПараметрыЗаполнения);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьДокументНаСервере(
			ПараметрыЗаполнения.ЗаполнитьГрафикИсполнения,
			ПараметрыЗаполнения.ЗаполнитьГрафикПлатежей);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьДокументЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДокументНаСервере(
			ДополнительныеПараметры.ЗаполнитьГрафикИсполнения,
			ДополнительныеПараметры.ЗаполнитьГрафикПлатежей);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПериоду(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = Объект.НачалоПериода;
	Диалог.Период.ДатаОкончания = Объект.КонецПериода;
	Диалог.Показать(Новый ОписаниеОповещения("УстановитьОтборПоПериодуЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПериодуЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		
		Объект.НачалоПериода = Период.ДатаНачала;
		Объект.КонецПериода  = Период.ДатаОкончания;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ИспользоватьДетализациюПоКОСГУВГрафиках = КонтрольИсполненияДоговоров.ИспользоватьДетализациюПоКОСГУВГрафикахПоДоговорам(Объект.ВидДоговоров);
	ИспользоватьДополнительнуюАналитикуВГрафикахПлатежей = КонтрольИсполненияДоговоров.ИспользоватьДополнительнуюАналитикуВГрафикахПлатежей(Объект.ВидДоговоров);
	
	ПредыдущийВидДоговоров = Объект.ВидДоговоров;
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоСПоставщиком = (Объект.ВидДоговоров = ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком"));
	ЭтоСПокупателем = (Объект.ВидДоговоров = ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.СПокупателем"));
	ЭтоМБТ = (Объект.ВидДоговоров = ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.СОтправителемТрансферта"));
	ЭтоСубсидия = (Объект.ВидДоговоров = ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.СоглашениеОСубсидии"));
	
	// План-график реализации, закупок доступен для договоров "С поставщиком" или "С покупателем".
	КолонкиОстаток = Новый Массив;
	КолонкиОстаток.Добавить("ИсполнениеДоговоров");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		КолонкиОстаток, "Видимость", ЭтоСПоставщиком ИЛИ ЭтоСПокупателем ИЛИ ЭтоМБТ ИЛИ ЭтоСубсидия);
	
	Если ЭтоСПоставщиком Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СтраницаГрафикИсполнения", "Заголовок", НСтр("ru = 'План-график закупок'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсполнениеДоговоровРасширеннаяПодсказка", "Заголовок",
			НСтр("ru = 'Введите информацию о фактическом исполнении плана-графика закупок по операциям поступления ценностей (товаров, работ, услуг), которые не были отражены в графике ранее'"));
	ИначеЕсли ЭтоСПокупателем Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СтраницаГрафикИсполнения", "Заголовок", НСтр("ru = 'План-график реализации'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсполнениеДоговоровРасширеннаяПодсказка", "Заголовок",
			НСтр("ru = 'Введите информацию о фактическом исполнении плана-графика реализации по операциям реализации ценностей (товаров, работ, услуг), которые не были отражены в графике ранее'"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СтраницаГрафикИсполнения", "Заголовок", НСтр("ru = 'План-график исполнения'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсполнениеДоговоровРасширеннаяПодсказка", "Заголовок",
			НСтр("ru = 'Введите информацию о фактическом исполнении плана-графика исполнения по операциям, которые не были отражены в графике ранее'"));
	КонецЕсли;
	
	// Детализация по КЭК.
	ЭлементыДопАналитика = Новый Массив;
	ЭлементыДопАналитика.Добавить("ИсполнениеДоговоровКЭК");
	ЭлементыДопАналитика.Добавить("ОплатаПоДоговорамКЭК");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыДопАналитика, "Видимость", Форма.ИспользоватьДетализациюПоКОСГУВГрафиках);
	
	// Дополнительная аналитика.
	ЭлементыДопАналитика = Новый Массив;
	ЭлементыДопАналитика.Добавить("ОплатаПоДоговорамДопКлассификация");
	ЭлементыДопАналитика.Добавить("ОплатаПоДоговорамКодМероприятия");
	ЭлементыДопАналитика.Добавить("ОплатаПоДоговорамКодЦели");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыДопАналитика, "Видимость", Форма.ИспользоватьДополнительнуюАналитикуВГрафикахПлатежей);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНаСервере(ЗаполнитьГрафикИсполнения = Истина, ЗаполнитьГрафикПлатежей = Истина)
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	Отказ = Документы.РегистрацияИсполненияДоговоров.ЗаполнитьПоДаннымУчета(Объект, ЗаполнитьГрафикИсполнения, ЗаполнитьГрафикПлатежей);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

