#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Обновляет данные типовых операций из поставляемых данных.
// Если включен РИБ, то выполняется только на главном узле.
// Обновляются только типовые операции, находящиеся в макете в обработке "ИмпортЭкспортТиповыхОпераций".
// Типовые операции со снятой поддержкой не обновляются.
//
// Параметры:
//  МассивМакетов	 - Массив из Строка - Массив имен макетов обработки "ИмпортЭкспортТиповыхОпераций", из которых нужно 
// обновлять операции. Если не задан, то обновляются типовые операции из всех макетов.
//
Процедура ЗагрузитьЭлементы(МассивМакетов = Неопределено) Экспорт
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Перед обновлением макетов проверим типы значений ПВХ.ДополнительныеРеквизитыОпераций
	ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.ИнициализироватьПредопределенныеЭлементыПВХ();
	
	Если ТипЗнч(МассивМакетов) <> Тип("Массив") Тогда
		МассивМакетовДляЗагрузки = Новый Массив;
		Для каждого ИмяМакета Из Метаданные.Обработки.ИмпортЭкспортТиповыхОпераций.Макеты Цикл
			МассивМакетовДляЗагрузки.Добавить(ИмяМакета.Имя);
		КонецЦикла;
	Иначе
		МассивМакетовДляЗагрузки = МассивМакетов;
	КонецЕсли;
	
	Обработка = Обработки.ИмпортЭкспортТиповыхОперацийВФормате20.Создать();
	Обработка.УстановитьРежимЗагрузкиПользовательскихОпераций(Истина);
	Обработка.УстановитьРежимОбновленияОпераций(Истина);

	Для каждого ИмяМакета Из МассивМакетовДляЗагрузки Цикл
	
		Обработка.ВыполнитьЗагрузкуДанных(Обработки.ИмпортЭкспортТиповыхОпераций.ПолучитьМакет(ИмяМакета).ПолучитьТекст());
	
	КонецЦикла;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Вызывается из фонового задания обновления типовых обновления в локальной базе.
// Параметры не используются. Нужны только для совместимости с механизмом БСП.
// 
// Параметры:
//  Параметры - Структура - 
//  АдресРезультата - Строка
Процедура ЗагрузитьЭлементыВФоне(Параметры, АдресРезультата) Экспорт

	ТекстСообщения = НСтр("ru = 'Обновляются типовые операции на поддержке по запросу пользователя'");
	ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииОбновлениеТО(),
		УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ТиповыеОперации,,ТекстСообщения);
	
	ВыполнитьОбновлениеТиповыхОперацийПоЗапросу(Ложь);	

КонецПроцедуры

// Вызывается из фонового задания обновления типовых операций в областях данных.
// 
// Параметры:
//  ТолькоИзменившиеся - Булево - Загружать только ТО, у которых дата версии ниже даты версии ПТО
Процедура ОбновлениеТиповыхОперацийВОбластиДанных(ТолькоИзменившиеся) Экспорт
	
	Если ТолькоИзменившиеся Тогда
		ВсеТиповыеОперации = НСтр("ru = 'только изменившиеся'");
	Иначе
		ВсеТиповыеОперации = НСтр("ru = 'все типовые операции'");
	КонецЕсли;
	ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Обновляются типовые операции на поддержке по запросу администратора облака (%1)'"),
		ВсеТиповыеОперации);
	ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииОбновлениеТО(),
		УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ТиповыеОперации,,ТекстСообщения);
		
	ВыполнитьОбновлениеТиповыхОперацийПоЗапросу(ТолькоИзменившиеся);
	
КонецПроцедуры

// Формирует схемы проверки условия типовой операции и заполнения проводок. Полученные схемы возвращает в структуре.
//
// Параметры:
//  ТиповаяОперация	 - СправочникСсылка.ТиповыеОперации - Типовая операция.
// Возвращаемое значение:
// Структруа - содержит следующие ключи:
//		*СхемаФормированияПроводок - СхемаКомпоновкиДанных - схема для формирования проводок,
//		*СхемаПроверкиУсловия - СхемаКомпоновкиДанных - схема проверки условия.
//
Функция СформироватьСхемыДляТиповойОперации(ТиповаяОперация) Экспорт

	ПараметрыТиповойОперации = ПолучитьДанныеТиповойОперации(ТиповаяОперация);
	
	Если ОбщегоНазначения.СсылкаСуществует(ПараметрыТиповойОперации.ДанныеОперации.ИдентификаторДокумента) Тогда
		Если ПараметрыТиповойОперации.ДанныеОперации.ИспользуетсяВнешняяПроцедура Тогда
			СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
		Иначе
			СхемаКомпоновки = БухгалтерскиеОперацииСервер.СформироватьСхемуФормированияПроводок(
				ПараметрыТиповойОперации);
		КонецЕсли;
		СхемаУсловие = БухгалтерскиеОперацииСервер.СформироватьСхемуУсловияТиповойОперации(ПараметрыТиповойОперации);
	Иначе
		СхемаКомпоновки	= Новый СхемаКомпоновкиДанных;
		СхемаУсловие 	= Новый СхемаКомпоновкиДанных;
	КонецЕсли;
	
	Возврат Новый Структура("СхемаФормированияПроводок, СхемаПроверкиУсловия", СхемаКомпоновки, СхемаУсловие);
	
КонецФункции

// Создает и заполняет отбор компоновки данных из строки, содержащей XML-выгрузку отбора. Полученный отбор возвращается
// в виде сериализованном виде. Например, используется при чтении отбора из поставляемого реквизита операции
// в реквизиты типовой операции в конкретной области данных.
//
// Параметры:
//  ТекстОтбора		 - Строка - Текст XML-выгрузки отбора.
//  ИмяКорневогоУзла - Строка - Имя узла XML-выгрузки, содержащего отбор.
// Возвращаемое значение:
// Строка - сериализованный объект типа "НастройкиКомпоновкиДанных"
//
Функция ПолучитьСериализованныйКомпоновщикНастроекИзПоставляемогоОтбора(ТекстОтбора, ИмяКорневогоУзла) Экспорт

	Если ПустаяСтрока(ТекстОтбора) Тогда
		Возврат "";
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстОтбора);
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ЛокальноеИмя = ИмяКорневогоУзла И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
			Отбор = КомпоновщикНастроек.Настройки.Отбор;
			Пока ЧтениеXML.Прочитать() Цикл
				
				Если ЧтениеXML.ЛокальноеИмя = ИмяКорневогоУзла И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					Прервать;
				КонецЕсли;
				ЗагрузитьОтборКомпоновщика(Отбор.Элементы, ЧтениеXML);
				Если ЧтениеXML.ЛокальноеИмя = ИмяКорневогоУзла И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(КомпоновщикНастроек.Настройки);
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат "";

КонецФункции // ПолучитьСериализованныйКомпновщикНастроекИзПоставляемогоОтбора()

// Читает значение по умолчанию из XML-выгрузки. Например, при загрузке из поставляемых данных в область данных.
//
// Параметры:
//  ТекстЗначениеПоУмолчанию - Строка - текст
// Возвращаемое значение:
// Произвольный - Значение по умолчанию.
//
Функция ПолучитьЗначениеПоУмолчаниюИзПоставлемыхДанных(ТекстЗначениеПоУмолчанию) Экспорт

	Если ПустаяСтрока(ТекстЗначениеПоУмолчанию) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстЗначениеПоУмолчанию);
	ЧтениеXML.Прочитать();
	Если ЧтениеXML.ЛокальноеИмя = "ЗначениеПоУмолчанию" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		Если ЧтениеXML.ПолучитьАтрибут("ТипЗнч") = Неопределено Тогда
			ЧтениеXML.Прочитать();
			Если НЕ (ЧтениеXML.ЛокальноеИмя = "ЗначениеПоУмолчанию"
				И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента) Тогда
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		ЗначениеПоУмолчанию = БухгалтерскиеОперацииСервер.ПрочитатьЗначениеРеквизитаИзУзлаФайла(ЧтениеXML);
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции // ПолучитьЗначениеПоУмолчаниюИзПоставлемыхДанных()

// Получает значение ПВХ ДополнительныеРеквизитыОпераций по переданному описанию. Описание представляет собой структуру,
// содержащую данные для идентификации элемента или создания нового.
//
// Параметры:
//  Описание - Строка - содержит сериализованную структуру описания,
//			- Структура - содержит структуру описания.
// Возвращаемое значение:
// ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыОпераций - Найденный или созданный по описанию элемент.
Функция ТипДополнительногоРеквизитаПоОписанию(Описание) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Описание) Тогда
		Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.ПустаяСсылка();
	КонецЕсли;

	Если ТипЗнч(Описание) = Тип("Строка") Тогда
		СтруктураОписания = ОбщегоНазначения.ЗначениеИзСтрокиXML(Описание);
		Если ТипЗнч(СтруктураОписания) <> Тип("Структура") Тогда
			Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ТипЗнч(Описание) = Тип("Структура") Тогда
		СтруктураОписания = Описание;
	Иначе
		Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.ПустаяСсылка();
	КонецЕсли;
	
	РеквизитПроводки = ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.ПолучитьСсылку(
		СтруктураОписания.УникальныйИдентификатор);
	Если НЕ ОбщегоНазначения.СсылкаСуществует(РеквизитПроводки) Тогда
		НовДопРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.СоздатьЭлемент();
		НовДопРеквизит.УстановитьСсылкуНового(РеквизитПроводки);
	Иначе
		НовДопРеквизит = РеквизитПроводки.ПолучитьОбъект();
	КонецЕсли;
	Если НЕ НовДопРеквизит.Предопределенный Тогда
		ТипЗначения = Неопределено;
		Если НЕ СтруктураОписания.Свойство("ТипЗначения", ТипЗначения) Тогда
			СтруктураОписания.Свойство("Тип", ТипЗначения);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТипЗначения) И НовДопРеквизит.ТипЗначения <> ТипЗначения Тогда
			НовДопРеквизит.ТипЗначения = ТипЗначения;
		КонецЕсли;
	КонецЕсли;
	ШиринаЧислом = 0;
	Если СтруктураОписания.Свойство("Ширина") Тогда
		ШиринаЧислом = Число(СтруктураОписания.Ширина);
	ИначеЕсли СтруктураОписания.Свойство("ШиринаПоляВвода") Тогда
		ШиринаЧислом = Число(СтруктураОписания.ШиринаПоляВвода);
	КонецЕсли;
	Если НовДопРеквизит.ШиринаПоляВвода <> ШиринаЧислом Тогда
		НовДопРеквизит.ШиринаПоляВвода = ШиринаЧислом;
	КонецЕсли;
	Если НовДопРеквизит.Модифицированность() Тогда
		НовДопРеквизит.Записать();
	КонецЕсли;
	
	Возврат НовДопРеквизит.Ссылка;

КонецФункции // ТипДополнительногоРеквизитаПоОписанию()

// Возвращает состояние поддержки типовой операции и заполняет поставляемую типовую операцию в параметр
// "ПоставляемаяТиповаяОперация"
//
// Параметры:
//  ТиповаяОперация				 - СправочникСсылка.ТиповыеОперации - типовая операция.
//  ПоставляемаяТиповаяОперация	 - Неопределено, СправочникСсылка.ПоставляемыеТиповыеОперации - возвращаемое значение: Поставляемая типовая операция.
// 
// Возвращаемое значение:
// ПеречислениеСсылка.СостоянияПоддержкиТиповыхОпераций - состояние поддержки типовой операции.
//
Функция СостояниеПоддержкиОперации(ТиповаяОперация, ПоставляемаяТиповаяОперация = Неопределено) Экспорт

	РеквизитыОперации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТиповаяОперация, 
		"ПоставляемаяТиповаяОперация, СостояниеПоддержки");
	
	ПоставляемаяТиповаяОперация = РеквизитыОперации.ПоставляемаяТиповаяОперация;
	Возврат РеквизитыОперации.СостояниеПоддержки;

КонецФункции

// Возвращает Истина, если состояние поддержки типовой операции равно НеРедактируется. Поставляемая типовая операция
// возвращается в параметре "ПоставляемаяТиповаяОперация".
//
// Параметры:
//  ТиповаяОперация				 - СправочникСсылка.ТиповыеОперации - типовая операция.
//  ПоставляемаяТиповаяОперация	 - Неопределено, СправочникСсылка.ПоставляемыеТиповыеОперации - возвращаемое значение: Поставляемая типовая операция.
// 
// Возвращаемое значение:
// Булево - 
//
Функция ТиповаяОперацияНеРедактируется(ТиповаяОперация, ПоставляемаяТиповаяОперация = Неопределено) Экспорт
	Перем ЗначениеПоставляемойОперации;
	
	Если СостояниеПоддержкиОперации(ТиповаяОперация, ЗначениеПоставляемойОперации)
		= Перечисления.СостоянияПоддержкиТиповыхОпераций.НеРедактируется Тогда
		
		ПоставляемаяТиповаяОперация = ЗначениеПоставляемойОперации;
		Возврат Истина;
	Иначе
		
		Возврат Ложь;
	КонецЕсли;

КонецФункции

// Возвращает право редактирования типовой операции для текущего пользователя.
// Право редактирования определеяется в функции "ПраваДоступаКТиповойОперации".
//
// Параметры:
//  ТиповаяОперация	 - СправочникСсылка.ТиповаяОперация - типовая операция для которой определяется право доступа.
// Возвращаемое значение:
// Булево - Значение ключа "Редактирование" из функции ПраваДоступаКТиповойОперации.
//
Функция ПользовательМожетРедактироватьОперацию(ТиповаяОперация) Экспорт
	
	Возврат ПраваДоступаКТиповойОперации(ТиповаяОперация).Редактирование;
	
КонецФункции

// Определяет права пользователя "Просмотр" и "Редактирование" к типовой операции. Право "Просмотр" позволяет
// выбирать типовую операцию в документы. Право "Редактирование" позволяет изменять настройки типовой операции, а так же
// права "Просмотр/Редактирование".
// Типовые операции, для которых не заданы права пользователя, считаются доступными всем пользователям.
// Пользователь, у которого есть право "Редактирование" автоматически имеет право "Просмотр".
// Пользователь, с ролью "Полные права" может редактировать любую типовую операцию и права доступа к ней.
//
// Параметры:
//  ТиповаяОперация	 - СправочникСсылка.ТиповыеОперации - типовая операция
//  Пользователь	 - СправочникСсылка.Пользователи - пользователь. Если не задан, то будет использован текущий пользователь сеанса.
// Возвращаемое значение:
// Структура - Содержит ключи:
//	* Просмотр - Булево - право "Просмотр",
//	* Редактирование - Булево - право "Редактирование".
//
Функция ПраваДоступаКТиповойОперации(ТиповаяОперация, Знач Пользователь = "") Экспорт

	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ИСТИНА В
	|						(ВЫБРАТЬ ПЕРВЫЕ 1
	|							ИСТИНА
	|						ИЗ
	|							Справочник.ТиповыеОперации.РазрешенныеПользователи КАК ТиповыеОперацииРазрешенныеПользователи
	|						ГДЕ
	|							ТиповыеОперацииРазрешенныеПользователи.Ссылка = &ТиповаяОперация)
	|				ИЛИ ИСТИНА В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						ИСТИНА
	|					ИЗ
	|						Справочник.ТиповыеОперации.РазрешенныеПользователи КАК ТиповыеОперацииРазрешенныеПользователи
	|					ГДЕ
	|						ТиповыеОперацииРазрешенныеПользователи.Ссылка = &ТиповаяОперация
	|						И ТиповыеОперацииРазрешенныеПользователи.Пользователь = &Пользователь)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Просмотр,
	|	ВЫБОР
	|		КОГДА &ЭтоПолноправныйПользователь
	|				ИЛИ НЕ ИСТИНА В
	|						(ВЫБРАТЬ ПЕРВЫЕ 1
	|							ИСТИНА
	|						ИЗ
	|							Справочник.ТиповыеОперации.РазрешенныеПользователи КАК ТиповыеОперацииРазрешенныеПользователи
	|						ГДЕ
	|							ТиповыеОперацииРазрешенныеПользователи.Ссылка = &ТиповаяОперация)
	|				ИЛИ ИСТИНА В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						ИСТИНА
	|					ИЗ
	|						Справочник.ТиповыеОперации.РазрешенныеПользователи КАК ТиповыеОперацииРазрешенныеПользователи
	|					ГДЕ
	|						ТиповыеОперацииРазрешенныеПользователи.Ссылка = &ТиповаяОперация
	|						И ТиповыеОперацииРазрешенныеПользователи.Пользователь = &Пользователь
	|						И ТиповыеОперацииРазрешенныеПользователи.ПравоИзменения = ИСТИНА)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Редактирование
	|ИЗ
	|	Справочник.ТиповыеОперации КАК ТиповыеОперации
	|ГДЕ
	|	ТиповыеОперации.Ссылка = &ТиповаяОперация";
	Запрос.УстановитьПараметр("Пользователь", 					Пользователь);
	Запрос.УстановитьПараметр("ТиповаяОперация",				ТиповаяОперация);
	Запрос.УстановитьПараметр("ЭтоПолноправныйПользователь",	Пользователи.ЭтоПолноправныйПользователь(Пользователь));
	
	ПраваПользователя = Новый Структура("Просмотр, Редактирование", Ложь, Ложь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПраваПользователя, Выборка);
	КонецЕсли;
	
	Возврат ПраваПользователя;

КонецФункции // ПраваДоступаКТиповойОперации()

// Определяет имена и типы дополнительных реквизитов типовой операции. Выполняется в привилегированном режиме.
// Возвращает структуру, содержащую в ключах имена для формулы дополнительных реквизитов типовой операции. В параметр
// "ТипыДопРеквизитов" помещается структура, содержащая значения реквизита "РеквизитПроводки" для каждого
// дополнительного реквизита.
//
// Параметры:
//  ТиповаяОперация		 - СправочникСсылка.ТиповыеОперации - Типовая операция,
//  ТипыДопРеквизитов	 - Структура - 
//						- Неопределено - в параметр будет помещена структура, содержащая в ключах "ИмяДляФормулы",
//		дополнительного реквизита, в значениях - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыОпераций,
//  БезВалюты			 - Булево - Если "Истина", то в результат будут добавлены ключи "Курс" и "Кратность".
//		Ключи добавляются и в результат, и в параметр "ТипыДопРеквизитов".
// Возвращаемое значение:
// Структура - в которой каждый ключ - это "ИмяДляФормулы" дополнительного реквизита, значения структуры не заданы.
//
Функция ПустаяСтруктураДопРеквизитовОперации(ТиповаяОперация, ТипыДопРеквизитов = Неопределено, БезВалюты = Ложь) Экспорт
	
	Если ТипыДопРеквизитов = Неопределено ИЛИ ТипЗнч(ТипыДопРеквизитов) <> Тип("Структура") Тогда
		ТипыДопРеквизитов = Новый Структура;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка,
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И НЕ РеквизитыТиповыхОпераций.ПометкаУдаления
	|	И НЕ РеквизитыТиповыхОпераций.ЭтоГруппа";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	ДопПараметры = Новый Структура;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДопПараметры.Вставить(Выборка.ИмяДляФормулы);
		ТипыДопРеквизитов.Вставить(Выборка.ИмяДляФормулы, Выборка.РеквизитПроводки);
	КонецЦикла; 
	Если (НЕ БезВалюты) И ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет") Тогда 
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТиповыеОперации.ИдентификаторДокумента.Имя Как ИмяДокумента
		                      |ИЗ
		                      |	Справочник.ТиповыеОперации КАК ТиповыеОперации
		                      |ГДЕ
		                      |	ТиповыеОперации.Ссылка = &ТиповаяОперация");
		Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			РеквизитыДокумента = БухгалтерскийУчетПовтИсп.ПолучитьСписокРеквизитовОбъекта("Документы",
				Результат.ИмяДокумента);
			Если РеквизитыДокумента.НайтиПоЗначению("ВалютаДокумента") <> Неопределено 
				И РеквизитыДокумента.НайтиПоЗначению("Курс") = Неопределено Тогда
				ДопПараметры.Вставить("Курс");
				ДопПараметры.Вставить("Кратность");
				ТипыДопРеквизитов.Вставить("Курс",		ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.Курс);
				ТипыДопРеквизитов.Вставить("Кратность",	ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций
					.Кратность);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат ДопПараметры;
КонецФункции

// Возвращает массив "Имен Для Формулы" реквизитов типовой операции.
//
// Параметры:
//  ТиповаяОперация	 - СправочникСсыла.ТиповыеОперации - Типовая операция.
//  ВключатьГруппы	 - Булево - признак включения в массив групп реквизитов.
// Возвращаемое значение:
// Массив - значения содержат "ИмяДляФормулы" доп. реквизита/группы доп. реквизитов типовой операции
Функция ИменаДополнительныхРеквизитов(ТиповаяОперация, ВключатьГруппы = Ложь, ПриводитьКВерхнемуРегистру = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И НЕ РеквизитыТиповыхОпераций.ПометкаУдаления";
	Если Не ВключатьГруппы Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И НЕ РеквизитыТиповыхОпераций.ЭтоГруппа";
	КонецЕсли;
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяДляФормулы");
	Если НЕ ПриводитьКВерхнемуРегистру Тогда
		Возврат Результат;
	Иначе
		РезультатВРЕГ = Новый Массив;
		Для каждого ТекЗначение Из Результат Цикл
			РезультатВРЕГ.Добавить(ВРЕГ(ТекЗначение));
		КонецЦикла;
		Возврат РезультатВРЕГ;
	КонецЕсли;
	
КонецФункции

// Возвращает структуру, содержащую ссылку на реквизит типовой операции. Если у типовой операции есть несколько
// реквизитов с одинаковым значением ИмяДляФормулы используется приоритет:
// - если только 1 реквизит используется в регистре ЗначенияДополнительныхРеквизитовОпераций, то используется он.
// - если в регистре используются несколько реквизитов, то возвращается единственных из них не помеченный на удаление.
// - если реквизиты не используются в регистре, то возвращается единственный не помеченный на удаление.
// В остальных случаях возвращается Неопределено (например, все реквизиты помечены на удаление)
// 
// Параметры:
// 	ТиповаяОперация - СправочникСсылка.ТиповыеОперации - владелец дополнительных реквизитов.
// 	ИмяДляФормулы - Строка - одно или несколько значений "ИмяДляФормулы" через запятую.
// Возвращаемое значение:
// 	Структура - структура найденных реквизитов. Если реквизит не найден, то ключ не добавляется. Если реквизитов несколько
// и не удалось определить нужный, то в значении содержится Неопределено. Иначе в значении будет ссылка на реквизит.
Функция УникальныеДополнительныеРеквизитыПоИмени(ТиповаяОперация, ИмяДляФормулы) Экспорт
	
	ИменаРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ИмяДляФормулы);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы,
	|	РеквизитыТиповыхОпераций.Ссылка
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И РеквизитыТиповыхОпераций.ЭтоГруппа = ЛОЖЬ
	|	И РеквизитыТиповыхОпераций.ИмяДляФормулы В (&ИменаРеквизитов)";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	Запрос.УстановитьПараметр("ИменаРеквизитов", ИменаРеквизитов);
	
	ДополнительныеРеквизиты = Запрос.Выполнить().Выгрузить();
	
	Результат = Новый Структура;
	Дубли = Новый Массив;
	
	Для Каждого ДополнительныйРеквизит Из ДополнительныеРеквизиты Цикл
		Если Результат.Свойство(ДополнительныйРеквизит.ИмяДляФормулы) Тогда
			Если ЗначениеЗаполнено(Результат[ДополнительныйРеквизит.ИмяДляФормулы]) Тогда
				Дубли.Добавить(Результат[ДополнительныйРеквизит.ИмяДляФормулы]);
				Результат[ДополнительныйРеквизит.ИмяДляФормулы] = Неопределено;
			КонецЕсли;
			Дубли.Добавить(ДополнительныйРеквизит.Ссылка);
		Иначе
			Результат.Вставить(ДополнительныйРеквизит.ИмяДляФормулы, ДополнительныйРеквизит.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Если Дубли.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка,
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы КАК ИмяДляФормулы,
	|	РеквизитыТиповыхОпераций.ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДополнительныхРеквизитовОпераций
	|			ГДЕ
	|				ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации = РеквизитыТиповыхОпераций.Ссылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Используется
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И РеквизитыТиповыхОпераций.Ссылка В (&ПроверяемыеРеквизиты)
	|ИТОГИ
	|ПО
	|	ИмяДляФормулы";
	Запрос.УстановитьПараметр("ТиповаяОперация",      ТиповаяОперация);
	Запрос.УстановитьПараметр("ПроверяемыеРеквизиты", Дубли);
	
	ВыборкаИмя = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИмя.Следующий() Цикл
		
		ИспользуемыеРеквизиты = Новый Массив;
		НеудаленныеРеквизиты = Новый Массив;
		ИспользуемыеНеудаленные = Новый Массив;
		
		ВыборкаРеквизит = ВыборкаИмя.Выбрать();
		Пока ВыборкаРеквизит.Следующий() Цикл
			
			Если ВыборкаРеквизит.Используется Тогда
				ИспользуемыеРеквизиты.Добавить(ВыборкаРеквизит.Ссылка);
			КонецЕсли;
			
			Если НЕ ВыборкаРеквизит.ПометкаУдаления Тогда
				НеудаленныеРеквизиты.Добавить(ВыборкаРеквизит.Ссылка);
			КонецЕсли;
			
			Если ВыборкаРеквизит.Используется И НЕ ВыборкаРеквизит.ПометкаУдаления Тогда
				ИспользуемыеНеудаленные.Добавить(ВыборкаРеквизит.Ссылка);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ИспользуемыеРеквизиты.Количество() = 1 Тогда
			Результат.Вставить(ВыборкаИмя.ИмяДляФормулы, ИспользуемыеРеквизиты[0]);
			
		ИначеЕсли ИспользуемыеНеудаленные.Количество() = 1 Тогда
			Результат.Вставить(ВыборкаИмя.ИмяДляФормулы, ИспользуемыеНеудаленные[0]);
		
		ИначеЕсли НеудаленныеРеквизиты.Количество() = 1 Тогда
			Результат.Вставить(ВыборкаИмя.ИмяДляФормулы, НеудаленныеРеквизиты[0]);
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает таблицу значений, содержащую сведений о дополнительных реквизитах типовой операции. По умолчанию 
// таблица имеет колонки "ИмяДляФормулы", "РеквизитПроводки", "ТипЗначения", "Ссылка". 
// При необходимости можно добавить колонки в виде строки, содержащей имена реквизитов, разделенных запятой.
// Можно получать только физические реквизиты справочника "РеквизитыТиповыхОпераций".
//
// Параметры:
//  ТиповаяОперация		 - СправочникСсылка.ТиповыеОперации - Типовая операция
//  БезГрупп			 - Булево - признак получения сведений о группах реквизитов.
//  ТребуемыеРеквизиты	 - Строка - строка имен реквизитов справочника "РеквизитыТиповыхОпераций", разеделенных запятой.
// Возвращаемое значение:
// ТаблицаЗначений - содержит базовые + добавленные колонки:
//	* ИмяДляФормулы - Строка - Имя для формулы реквизита,
//	* РеквизитПроводки - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыОпераций - реквизит проводки,
//	* ТипЗначения - ОписаниеТипов - тип значения реквизита,
//	* Ссылка - СправочникСсылка.РеквизитыТиповыхОпераций - Ссылка реквизита типовой операции.
Функция ДополнительныеРеквизитыТиповойОперации(ТиповаяОперация, БезГрупп = Истина, ТребуемыеРеквизитыСтрокой = "") Экспорт
	
	ПостоянныеРеквизиты = Новый Структура("Ссылка, РеквизитПроводки, ТипЗначения, ИмяДляФормулы");
	ПостоянныеРеквизиты.ТипЗначения = "РеквизитПроводки.ТипЗначения";
	СлужебныеРеквизиты = Новый Структура("ПометкаУдаления, ЭтоГруппа");
	ТребуемыеРеквизиты = Новый Структура(ТребуемыеРеквизитыСтрокой);
	
	ВсеПоляЗапроса = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВсеПоляЗапроса, ПостоянныеРеквизиты, Ложь);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВсеПоляЗапроса, СлужебныеРеквизиты, Ложь);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ВсеПоляЗапроса, ТребуемыеРеквизиты, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ";
	
	ПоляЗапроса = Новый Массив;
	ШаблонПоляЗапроса = "РеквизитыТиповыхОпераций.%1 КАК %2";
	Для каждого Реквизит Из ВсеПоляЗапроса Цикл
		
		ПоляЗапроса.Добавить(СтрШаблон(ШаблонПоляЗапроса,
			? (ПустаяСтрока(Реквизит.Значение), Реквизит.Ключ, Реквизит.Значение),
			Реквизит.Ключ));
	
	КонецЦикла;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеквизитыТиповыхОпераций.Ссылка", СтрСоединить(ПоляЗапроса, "," + Символы.ПС));
	
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	СтрокиДерева = Новый Массив;
	
	ДобавитьСтрокиДереваВМассив(Дерево, СтрокиДерева, Неопределено);
	
	ИменаКолонокРезультата = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ИменаКолонокРезультата, ПостоянныеРеквизиты, Ложь);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ИменаКолонокРезультата, ТребуемыеРеквизиты, Ложь);
	ТаблицаРезультат = СкопироватьКолонкиДереваВТаблицу(Дерево, ИменаКолонокРезультата);
	Для каждого ТекСтрока Из СтрокиДерева Цикл
	
		Если БезГрупп И ТекСтрока.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
	
		ЗаполнитьЗначенияСвойств(ТаблицаРезультат.Добавить(), ТекСтрока);
	
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПроводкиТиповойОперации(ТиповаяОперация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроводкиТиповыхОпераций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПроводкиТиповыхОпераций КАК ПроводкиТиповыхОпераций
	|ГДЕ
	|	ПроводкиТиповыхОпераций.Владелец = &ТиповаяОперация";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

// Возвращает таблицу дополнительных реквизитов операции. Структура таблицы соответствует структуре таблицы
// в функции Справочники.ТиповыеОперации.ДополнительныеРеквизитыТиповойОперации()
//
// Параметры:
//  ТиповаяОперация	 - СправочникСсылка.ТиповыеОперации - типовая операция.
//  ИменаРеквизитов	 - Строка - имена требуемых реквизитов типовой операции, разделенные запятой.
// 
// Возвращаемое значение:
// ТаблицаЗначений - таблица дополнительных реквизитов.
//
Функция ДополнительныеРеквизитыТиповойОперацииПоИмени(ТиповаяОперация, ИменаРеквизитов) Экспорт
	
	ИменаРеквизитовВРег = Новый Массив;
	Для каждого ТекИмя Из СтрРазделить(ИменаРеквизитов, ",") Цикл
	
		ИменаРеквизитовВРег.Добавить(ВРег(СокрЛП(ТекИмя)));
	
	КонецЦикла;
	
	РеквизитыОперации = ДополнительныеРеквизитыТиповойОперации(ТиповаяОперация, Ложь);
	
	Результат = РеквизитыОперации.СкопироватьКолонки();
	
	Для каждого ТекСтрока Из РеквизитыОперации Цикл
	
		Если ИменаРеквизитовВРег.Найти(ВРег(ТекСтрока.ИмяДляФормулы)) <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Результат.Добавить(), ТекСтрока);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция копирует типовую операцию ОперацияСсылка, устанавливая в параметр Документ - имя документа
// из типовой операции.
// Параметры
// ОперацияСсылка - СправочникСсылка.ТиповыеОперации - ссылка на копируемую операцию
// Документ - Строка - (не используется)
// ДополнительныеПараметры - Структура - содержит ключи:
//		*АвтоНаименование - Булево - признак автоматического формирования наименования новой операции.
//		*Наименование - Строка - Наименование новой типовой операции, если ключ "АвтоНаименование" содержит ЛОЖЬ.
//		*СвязанаСОперацией - СправочникСсылка.ТиповыеОперации - типовая операция, с которой будет установлена
//							связь у новой операции.
//	- Неопределено - будет использоваться автоматическое формирование наименования новой операции
//					и не будет устанавливаться связь
//
// Возвращаемое значение
// СправочникСсылка.ТиповыеОперации - ссылка на новую типовую операцию
Функция СкопироватьОперацию(ОперацияСсылка, Документ, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(ДополнительныеПараметры) <> Тип("Структура") Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("Автонаименование") Тогда
		Автонаименование = НЕ ДополнительныеПараметры.Автонаименование = ЛОЖЬ;
	Иначе
		Автонаименование = ИСТИНА;
	КонецЕсли;
	
	РеквизитыОперации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОперацияСсылка,
		"Наименование, УстанавливатьБлокировку,ИдентификаторДокумента, ПоставляемаяТиповаяОперация, СостояниеПоддержки");
	
	Если РеквизитыОперации.СостояниеПоддержки = Перечисления.СостоянияПоддержкиТиповыхОпераций.НеРедактируется Тогда
		ДанныеТиповойОперации = Справочники.ПоставляемыеТиповыеОперации.ПолучитьДанныеТиповойОперации(
			РеквизитыОперации.ПоставляемаяТиповаяОперация);
	Иначе
		ДанныеТиповойОперации = ПолучитьДанныеТиповойОперации(ОперацияСсылка, Ложь);
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		ПредставлениеОперации = Строка(ОперацияСсылка);
		
		НоваяОперация = Справочники.ТиповыеОперации.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НоваяОперация, РеквизитыОперации, "УстанавливатьБлокировку, ИдентификаторДокумента");
		Если Автонаименование Тогда
			НоваяОперация.Наименование = ПолучитьНаименованиеНовойТиповойОперации(РеквизитыОперации.ИдентификаторДокумента,
				РеквизитыОперации.Наименование, "Копия");
		Иначе
			НоваяОперация.Наименование = ДополнительныеПараметры.Наименование;
		КонецЕсли;
		НоваяОперация.ДополнительныеСвойства.Вставить("НеФормироватьСхему");
		НоваяОперация.Записать();
		
		ДанныеИсходнойТиповойОперации = ДанныеТиповойОперации.ДанныеОперации;
		ДанныеНовойТиповойОперации = РегистрыСведений.ДанныеТиповыхОпераций.СоздатьМенеджерЗаписи();
		ДанныеНовойТиповойОперации.ТиповаяОперация = НоваяОперация.Ссылка;
		ЗаполнитьЗначенияСвойств(ДанныеНовойТиповойОперации, ДанныеИсходнойТиповойОперации);
		ДанныеНовойТиповойОперации.Записать(Истина);
		
		Проводки = ДанныеТиповойОперации.Проводки;
		Для Каждого Проводка Из Проводки Цикл
		
			НоваяПроводка = Справочники.ПроводкиТиповыхОпераций.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НоваяПроводка, Проводка);
			НоваяПроводка.Владелец             = НоваяОперация.Ссылка;
			НоваяПроводка.СостояниеПоддержки   = Перечисления.СостоянияПоддержкиТиповыхОпераций.ПустаяСсылка();
			НоваяПроводка.ПоставляемаяПроводка = Справочники.ПоставляемыеПроводкиТиповыхОпераций.ПустаяСсылка();
			НоваяПроводка.Записать();
			
			ДанныеПроводки = РегистрыСведений.ДанныеПроводокТиповыхОпераций.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ДанныеПроводки, Проводка);
			ДанныеПроводки.Проводка = НоваяПроводка.Ссылка;
			ДанныеПроводки.Записать(Ложь);
		
		КонецЦикла;
		
		ДополнительныеРеквизиты = ПолучитьДанныеРеквизитовТиповойОперации(ОперацияСсылка);
		ДополнительныеРеквизиты.Колонки.Добавить("Добавлена", Новый ОписаниеТипов("Булево"));
		ДополнительныеРеквизиты.Колонки.Добавить("НовыйДополнительныйРеквизит",
			Новый ОписаниеТипов("СправочникСсылка.РеквизитыТиповыхОпераций"));
		СтруктураОтбора = Новый Структура("Добавлена", Ложь);
		НеОбработанныеРеквизиты = ДополнительныеРеквизиты.НайтиСтроки(СтруктураОтбора);
		Пока НеОбработанныеРеквизиты.Количество() > 0 Цикл
			
			Для каждого ТекущийРеквизит Из НеОбработанныеРеквизиты Цикл
			
				Если ЗначениеЗаполнено(ТекущийРеквизит.Родитель) Тогда
					СтрокаРодителя = ДополнительныеРеквизиты.Найти(ТекущийРеквизит.Родитель, "Ссылка");
					Если СтрокаРодителя = Неопределено ИЛИ Не ЗначениеЗаполнено(СтрокаРодителя.НовыйДополнительныйРеквизит) Тогда
						Продолжить;
					Иначе
						ТекущийРодитель = СтрокаРодителя.НовыйДополнительныйРеквизит;
					КонецЕсли;
				Иначе
					ТекущийРодитель = Справочники.РеквизитыТиповыхОпераций.ПустаяСсылка();
				КонецЕсли;
				
				Если ТекущийРеквизит.ЭтоГруппа Тогда
					НовыйРеквизит = Справочники.РеквизитыТиповыхОпераций.СоздатьГруппу();
					ЗаполнитьЗначенияСвойств(НовыйРеквизит, ТекущийРеквизит, "Наименование, Код, ИмяДляФормулы");
				Иначе
					НовыйРеквизит = Справочники.РеквизитыТиповыхОпераций.СоздатьЭлемент();
					ЗаполнитьЗначенияСвойств(НовыйРеквизит, ТекущийРеквизит,
						"Наименование, Код, ИмяДляФормулы, ОтборЭлементов, РеквизитПроводки, ЗначениеПоУмолчанию");
					
				КонецЕсли;
				НовыйРеквизит.СостояниеПоддержки   = Перечисления.СостоянияПоддержкиТиповыхОпераций.ПустаяСсылка();
				НовыйРеквизит.ПоставляемыйРеквизитТиповойОперации = Справочники.ПоставляемыеРеквизитыТиповыхОпераций.ПустаяСсылка();
				НовыйРеквизит.Владелец = НоваяОперация.Ссылка;
				НовыйРеквизит.Родитель = ТекущийРодитель;
				Если НЕ НовыйРеквизит.ЭтоГруппа Тогда
					НовыйРеквизит.ФункциональныеОпции.Загрузить(ТекущийРеквизит.ФункциональныеОпции);
				КонецЕсли;
				НовыйРеквизит.ДополнительныеСвойства.Вставить("НеПроверять");
				НовыйРеквизит.Записать();
				
				ДанныеРеквизита = РегистрыСведений.ДанныеРеквизитовТиповыхОпераций.СоздатьМенеджерЗаписи();
				ДанныеРеквизита.РеквизитТиповойОперации = НовыйРеквизит.Ссылка;
				Если ТипЗнч(ТекущийРеквизит.УпакованныеНастройки) = Тип("ХранилищеЗначения") Тогда
					СохраненныеУпакованныеНастройки = ТекущийРеквизит.УпакованныеНастройки.Получить();
				Иначе
					СохраненныеУпакованныеНастройки = Неопределено;
				КонецЕсли;
				Если ТипЗнч(СохраненныеУпакованныеНастройки) = Тип("Структура") Тогда
					УпакованныеНастройки = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СохраненныеУпакованныеНастройки);
				Иначе
					УпакованныеНастройки = БухгалтерскиеОперацииСервер.ШаблонСвойствЭлементаФормы(НовыйРеквизит.ЭтоГруппа);
					БухгалтерскиеОперацииСервер.ЗаполнитьСвойстваЭлементаФормыИзСтарогоФорматаНастроек(
						УпакованныеНастройки, ТекущийРеквизит, НовыйРеквизит.ЭтоГруппа);
				КонецЕсли;
				ДанныеРеквизита.УпакованныеНастройки = Новый ХранилищеЗначения(УпакованныеНастройки);
				ДанныеРеквизита.Записать(Ложь);
				
				ТекущийРеквизит.Добавлена 					= Истина;
				ТекущийРеквизит.НовыйДополнительныйРеквизит	= НовыйРеквизит.Ссылка;
				
			КонецЦикла; 
			
			НеОбработанныеРеквизиты = ДополнительныеРеквизиты.НайтиСтроки(СтруктураОтбора);
			
		КонецЦикла;
		
		СкопироватьУсловияИспользования(ОперацияСсылка, НоваяОперация.Ссылка);
		СкопироватьДополнительныеИсточникиДанных(ОперацияСсылка, НоваяОперация.Ссылка);
		
		НоваяОперация.ДополнительныеСвойства.Удалить("НеФормироватьСхему");
		НоваяОперация.Записать();
		
		// Установить связь с другой типовой операцией
		ВедущаяОперация = Неопределено;
		Если ДополнительныеПараметры.Свойство("СвязанаСОперацией", ВедущаяОперация) Тогда
			Если ЗначениеЗаполнено(ВедущаяОперация) Тогда
				РегистрыСведений.СвязанныеТиповыеОперации.ЗаписатьСвязьОпераций(НоваяОперация.Ссылка, ВедущаяОперация);
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось скопировать типовую операцию ""%1"" по причине:
			|%2'"), ПредставлениеОперации, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Копирование типовой операции'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			ОперацияСсылка.Метаданные(),
			ОперацияСсылка,
			ТекстОшибки);
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат НоваяОперация.Ссылка;
	
КонецФункции

// Возвращает структуру данных типовой операции из регистров "ДанныеПоставляемыхТиповыхОпераций"
// или "ДанныеТиповыхОпераций". Если параметр "ТребуемыеДанные" не задан или задан = "*", то будут получены
// все данные из регистра.
//
// Параметры:
//  ТиповаяОперация	 - СправочникСсылка.ПоставляемыеТиповыеОперации - данные получаются из регистра 
//	"ДанныеПоставляемыхТиповыхОпераций",
//   - СправочникСсылка.ТиповыеОперации - если типовая операция на поддержке, то данные получаются из регистра 
//	"ДанныеПоставляемыхТиповыхОпераций", иначе из регистра "ДанныеТиповыхОпераций".
//  ТребуемыеДанные	 - Строка - Строка имен необходимых ресурсов регистра сведений "ДанныеТиповыхОпераций".
// Возвращаемое значение:
// Структура - содержит значения требуемыех ресурсов регистра сведений.
Функция ДанныеТиповойОперации(ТиповаяОперация, ТребуемыеДанные = "*") Экспорт
	Перем ПоставляемаяТиповаяОперация;
	
	СтруктураДанных = Новый Структура;
	Для каждого Ресурс Из Метаданные.РегистрыСведений.ДанныеТиповыхОпераций.Ресурсы Цикл
	
		СтруктураДанных.Вставить(Ресурс.Имя);
	
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ТиповаяОперация) Тогда
		Возврат СтруктураДанных;
	КонецЕсли;
	
	Если ТипЗнч(ТиповаяОперация) = Тип("СправочникСсылка.ПоставляемыеТиповыеОперации") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	" + ТребуемыеДанные + "
		|ИЗ
		|	РегистрСведений.ДанныеПоставляемыхТиповыхОпераций КАК ДанныеТиповыхОпераций
		|ГДЕ
		|	ДанныеТиповыхОпераций.ТиповаяОперация = &ТиповаяОперация";
		Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	
	Иначе
		
		Если Справочники.ТиповыеОперации.ТиповаяОперацияНеРедактируется(ТиповаяОперация, ПоставляемаяТиповаяОперация) Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	" + ТребуемыеДанные + "
			|ИЗ
			|	РегистрСведений.ДанныеПоставляемыхТиповыхОпераций КАК ДанныеТиповыхОпераций
			|ГДЕ
			|	ДанныеТиповыхОпераций.ТиповаяОперация = &ТиповаяОперация";
			Запрос.УстановитьПараметр("ТиповаяОперация", ПоставляемаяТиповаяОперация);
		
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	" + ТребуемыеДанные + "
			|ИЗ
			|	РегистрСведений.ДанныеТиповыхОпераций КАК ДанныеТиповыхОпераций
			|ГДЕ
			|	ДанныеТиповыхОпераций.ТиповаяОперация = &ТиповаяОперация";
			Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
		
	КонецЕсли;
	
	Возврат СтруктураДанных;

КонецФункции // ДанныеТиповойОперации()

// Копирует типовую операцию со всеми настройками и заменяет в документах на вновь созданную.
//
Процедура СкопироватьТиповуюОперациюСЗаменой(ТиповаяОперация, Отказ = Ложь) Экспорт
	
	РеквизитыОперации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТиповаяОперация, "Наименование, ИдентификаторДокумента");
	НаименованиеТиповойОперации = РеквизитыОперации.Наименование;
	ПараметрыКопирования = Новый Структура;
	ПараметрыКопирования.Вставить("Автонаименование", Ложь);
	ПараметрыКопирования.Вставить("Наименование", НаименованиеТиповойОперации + " (автозамена)");
	
	Попытка
	
		НачатьТранзакцию();
		
		КопияТиповойОперации = СкопироватьОперацию(ТиповаяОперация, Неопределено, ПараметрыКопирования);
		ИмяДокумента = РеквизитыОперации.ИдентификаторДокумента.Имя;
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
	               |	РеквизитыТиповыхОпераций.Ссылка КАК ИсходныйРеквизит,
	               |	РеквизитыТиповыхОпераций1.Ссылка КАК НовыйРеквизит
	               |ПОМЕСТИТЬ СоответствиеРеквизитов
	               |ИЗ
	               |	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций1
	               |		ПО РеквизитыТиповыхОпераций.ИмяДляФормулы = РеквизитыТиповыхОпераций1.ИмяДляФормулы
	               |ГДЕ
	               |	РеквизитыТиповыхОпераций.Владелец = &ИсходнаяТиповаяОперация
	               |	И РеквизитыТиповыхОпераций1.Владелец = &НоваяТиповаяОперация
	               |	И РеквизитыТиповыхОпераций1.ЭтоГруппа = ЛОЖЬ
	               |	И РеквизитыТиповыхОпераций.ЭтоГруппа = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ОперацииДокументов.Документ КАК Документ.АвансовыйОтчет) КАК Документ,
	               |	&НоваяТиповаяОперация КАК Операция,
	               |	ОперацииДокументов.Дата,
	               |	ОперацииДокументов.Организация,
	               |	ОперацииДокументов.Курс,
	               |	ОперацииДокументов.Кратность,
	               |	ОперацииДокументов.СуммаОперации,
	               |	ОперацииДокументов.РучнаяКорректировка,
	               |	ОперацииДокументов.Операция КАК ИсходнаяТиповаяОперация
	               |ПОМЕСТИТЬ ТиповыеОперации
	               |ИЗ
	               |	РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	               |ГДЕ
	               |	ОперацииДокументов.Операция = &ИсходнаяТиповаяОперация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТиповыеОперации.Документ,
	               |	ТиповыеОперации.Операция,
	               |	ТиповыеОперации.Дата,
	               |	ТиповыеОперации.Организация,
	               |	ТиповыеОперации.Курс,
	               |	ТиповыеОперации.Кратность,
	               |	ТиповыеОперации.СуммаОперации,
	               |	ТиповыеОперации.РучнаяКорректировка
	               |ИЗ
	               |	ТиповыеОперации КАК ТиповыеОперации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ЗначенияДополнительныхРеквизитовОпераций.Объект КАК Документ.АвансовыйОтчет) КАК Объект,
	               |	СоответствиеРеквизитов.НовыйРеквизит КАК РеквизитОперации,
	               |	ЗначенияДополнительныхРеквизитовОпераций.Значение
	               |ИЗ
	               |	РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДополнительныхРеквизитовОпераций
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТиповыеОперации КАК ТиповыеОперации
	               |		ПО ЗначенияДополнительныхРеквизитовОпераций.Объект = ТиповыеОперации.Документ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеРеквизитов КАК СоответствиеРеквизитов
	               |		ПО ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации = СоответствиеРеквизитов.ИсходныйРеквизит
	               |ГДЕ
	               |	ЗначенияДополнительныхРеквизитовОпераций.Объект ССЫЛКА Документ.АвансовыйОтчет
	               |ИТОГИ ПО
	               |	Объект";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "АвансовыйОтчет", ИмяДокумента);
		Запрос.УстановитьПараметр("ИсходнаяТиповаяОперация", ТиповаяОперация);
		Запрос.УстановитьПараметр("НоваяТиповаяОперация", КопияТиповойОперации);
	
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ОперацииДокументов = РезультатЗапроса[2];
		РеквизитыОпераций = РезультатЗапроса[3];
		
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОперацииДокументов");
		ЭлементБлокировки.ИсточникДанных = ОперацииДокументов;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Документ", "Документ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций");
		ЭлементБлокировки.ИсточникДанных = ОперацииДокументов;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Объект", "Документ");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
		Блокировка.Заблокировать();
	
		ВыборкаОперации = ОперацииДокументов.Выбрать();
		Пока ВыборкаОперации.Следующий() Цикл
			
			ДанныеДляЗаписи = РегистрыСведений.ОперацииДокументов.ПрочитатьОперацию(ВыборкаОперации.Документ);
			ДанныеДляЗаписи.Операция = КопияТиповойОперации;
			РегистрыСведений.ОперацииДокументов.ЗаписатьОперацию(ВыборкаОперации.Документ, ДанныеДляЗаписи);
		
		КонецЦикла;
	
		ВыборкаРеквизиты = РеквизитыОпераций.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРеквизиты.Следующий() Цикл

			НаборЗаписей = РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(ВыборкаРеквизиты.Объект);
			
			ВыборкаДетальная = ВыборкаРеквизиты.Выбрать();
			Пока ВыборкаДетальная.Следующий() Цикл
			
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ВыборкаДетальная);
			
			КонецЦикла; 
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
	
		ЗафиксироватьТранзакцию();
	
	Исключение
		ОтменитьТранзакцию();
		Отказ = Истина;
		ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииЗаменаТиповойОперации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ТиповыеОперации,
			ТиповаяОперация,
			НСтр("ru = 'При копировании с заменой возникла ошибка:'") +Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Устанавливает дополнительные реквизиты в документах из значений по умолчанию для соответствующих реквизитов.
// Не изменяет заполненные значения дополнительных реквизитов. Может вызываться при обновлении и из команды
// элемента справочника "Типовые операции".
// Если вызов происходит при обновлении конфигурации, то не записываются
// таблицы изменений для РИБ.
// При обновлении процедура выполяется только для типовых операций на поддержке.
//
// Параметры:
//  ТиповаяОперация  - СправочникСсылка.ТиповыеОперации - типовая операция
//  ЭтоВызовПриОбновлении  - Булево - признак вызова при обновлении
//
// Пример:
//  Справочники.ТиповыеОперации.УстановитьЗначенияРеквизитовПоУмолчаниюВДокументы(Справочники.ТиповыеОперации.СписаниеАвтотранспортаИК_ВыбытиеВследствиеСтихийныхБедствий,	Истина);
//
// Варианты вызова:
//  Справочники.ТиповыеОперации.УстановитьЗначенияРеквизитовПоУмолчаниюВДокументы(Справочники.ТиповыеОперации.СписаниеАвтотранспортаИК_ВыбытиеВследствиеСтихийныхБедствий,	Истина);
//		- вызов при обновлении конфигурации.
//  Справочники.ТиповыеОперации.УстановитьЗначенияРеквизитовПоУмолчаниюВДокументы(Справочники.ТиповыеОперации.СписаниеАвтотранспортаИК_ВыбытиеВследствиеСтихийныхБедствий); 
//		- вызов в пользовательском режиме работы.
//
Процедура УстановитьЗначенияРеквизитовПоУмолчаниюВДокументы(ТиповаяОперация, ЭтоВызовПриОбновлении = Ложь) Экспорт
	
	Если ЭтоВызовПриОбновлении Тогда
		Если НЕ ТиповаяОперацияНаПоддержке(ТиповаяОперация) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ТаблицаПустыхЗначений = Новый ТаблицаЗначений;
	ТаблицаПустыхЗначений.Колонки.Добавить("Реквизит",			Новый ОписаниеТипов("СправочникСсылка.РеквизитыТиповыхОпераций"));
	ТаблицаПустыхЗначений.Колонки.Добавить("ПустоеЗначение",	Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.Тип);
	
	ТаблицаЗначенийПоУмолчанию = Новый ТаблицаЗначений;
	ТаблицаЗначенийПоУмолчанию.Колонки.Добавить("Реквизит",				Новый ОписаниеТипов("СправочникСсылка.РеквизитыТиповыхОпераций"));
	ТаблицаЗначенийПоУмолчанию.Колонки.Добавить("ЗначениеПоУмолчанию",	Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.Тип);
	
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РеквизитыТиповыхОпераций.Ссылка,
		               |	РеквизитыТиповыхОпераций.ЗначениеПоУмолчанию,
		               |	РеквизитыТиповыхОпераций.РеквизитПроводки,
		               |	РеквизитыТиповыхОпераций.РеквизитПроводки.ТипЗначения КАК ТипЗначения
		               |ИЗ
		               |	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
		               |ГДЕ
		               |	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
		               |	И РеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ
		               |	И РеквизитыТиповыхОпераций.ЭтоГруппа = ЛОЖЬ";
		Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.ЗначениеПоУмолчанию) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаПоУмолчанию = ТаблицаЗначенийПоУмолчанию.Добавить();
			СтрокаПоУмолчанию.Реквизит				= Выборка.Ссылка;
			СтрокаПоУмолчанию.ЗначениеПоУмолчанию	= Выборка.ЗначениеПоУмолчанию;
			
			Для каждого ТипРеквизита Из Выборка.ТипЗначения.Типы() Цикл
			
				СтрокаПустогоЗначения = ТаблицаПустыхЗначений.Добавить();
				СтрокаПустогоЗначения.Реквизит = Выборка.Ссылка;
				СтрокаПустогоЗначения.ПустоеЗначение	= ОбщегоНазначенияБГУКлиентСервер.ПустоеЗначениеТипа(ТипРеквизита);
			
			КонецЦикла; 
			
		КонецЦикла;
		
		Запрос.УстановитьПараметр("ТаблицаПустыхЗначений",		ТаблицаПустыхЗначений);
		Запрос.УстановитьПараметр("ТаблицаЗначенийПоУмолчанию",	ТаблицаЗначенийПоУмолчанию);
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаПустыхЗначений.Реквизит,
		               |	ТаблицаПустыхЗначений.ПустоеЗначение
		               |ПОМЕСТИТЬ ТаблицаПустыхЗначений
		               |ИЗ
		               |	&ТаблицаПустыхЗначений КАК ТаблицаПустыхЗначений
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаЗначенийПоУмолчанию.Реквизит,
		               |	ТаблицаЗначенийПоУмолчанию.ЗначениеПоУмолчанию
		               |ПОМЕСТИТЬ ТаблицаЗначенийПоУмолчанию
		               |ИЗ
		               |	&ТаблицаЗначенийПоУмолчанию КАК ТаблицаЗначенийПоУмолчанию
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ОперацииДокументов.Документ КАК Документ,
		               |	ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации КАК РеквизитОперации
		               |ПОМЕСТИТЬ ТребуемыеДокументы
		               |ИЗ
		               |	РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДополнительныхРеквизитовОпераций
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПустыхЗначений КАК ТаблицаПустыхЗначений
		               |			ПО ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации = ТаблицаПустыхЗначений.Реквизит
		               |				И ЗначенияДополнительныхРеквизитовОпераций.Значение = ТаблицаПустыхЗначений.ПустоеЗначение
		               |		ПО ОперацииДокументов.Документ = ЗначенияДополнительныхРеквизитовОпераций.Объект
		               |ГДЕ
		               |	ОперацииДокументов.Операция = &ТиповаяОперация
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	Т.Документ,
		               |	Т.Реквизит
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		ОперацииДокументов.Документ КАК Документ,
		               |		ТаблицаЗначенийПоУмолчанию.Реквизит КАК Реквизит
		               |	ИЗ
		               |		РегистрСведений.ОперацииДокументов КАК ОперацииДокументов,
		               |		ТаблицаЗначенийПоУмолчанию КАК ТаблицаЗначенийПоУмолчанию
		               |	ГДЕ
		               |		ОперацииДокументов.Операция = &ТиповаяОперация) КАК Т
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДополнительныхРеквизитовОпераций
		               |		ПО Т.Документ = ЗначенияДополнительныхРеквизитовОпераций.Объект
		               |			И Т.Реквизит = ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации
		               |ГДЕ
		               |	ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации ЕСТЬ NULL 
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Документ,
		               |	РеквизитОперации";
					   
		Запрос.Выполнить();
		
		Если НЕ ЭтоВызовПриОбновлении Тогда
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТребуемыеДокументы.Документ КАК Объект
			               |ИЗ
			               |	ТребуемыеДокументы КАК ТребуемыеДокументы";
			РезультатЗапроса = Запрос.Выполнить();
			
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций");
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Объект", "Объект");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();

		КонецЕсли;
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗначенияДополнительныхРеквизитовОпераций.Объект КАК Объект,
		               |	ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации,
		               |	ЗначенияДополнительныхРеквизитовОпераций.Значение
		               |ИЗ
		               |	РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДополнительныхРеквизитовОпераций
		               |ГДЕ
		               |	ЗначенияДополнительныхРеквизитовОпераций.Объект В
		               |			(ВЫБРАТЬ
		               |				ТребуемыеДокументы.Документ
		               |			ИЗ
		               |				ТребуемыеДокументы КАК ТребуемыеДокументы)
		               |	И НЕ ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации В
		               |				(ВЫБРАТЬ
		               |					ТребуемыеДокументы.РеквизитОперации
		               |				ИЗ
		               |					ТребуемыеДокументы КАК ТребуемыеДокументы
		               |				ГДЕ
		               |					ТребуемыеДокументы.Документ = ЗначенияДополнительныхРеквизитовОпераций.Объект)
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТребуемыеДокументы.Документ,
		               |	ТребуемыеДокументы.РеквизитОперации,
		               |	ТаблицаЗначенийПоУмолчанию.ЗначениеПоУмолчанию
		               |ИЗ
		               |	ТребуемыеДокументы КАК ТребуемыеДокументы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЗначенийПоУмолчанию КАК ТаблицаЗначенийПоУмолчанию
		               |		ПО ТребуемыеДокументы.РеквизитОперации = ТаблицаЗначенийПоУмолчанию.Реквизит
		               |ИТОГИ ПО
		               |	Объект";
		
		ВыборкаДокументы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДокументы.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(ВыборкаДокументы.Объект);
			
			ВыборкаДетальная = ВыборкаДокументы.Выбрать();
			Пока ВыборкаДетальная.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ВыборкаДетальная);
				
			КонецЦикла;
			
			Если ЭтоВызовПриОбновлении Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				НаборЗаписей.Записать();
			КонецЕсли;
			
		КонецЦикла;
	
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииУстановкаТиповойОперации(),
			УровеньЖурналаРегистрации.Ошибка,
			ТиповаяОперация.Метаданные(),
			ТиповаяОперация,
			СтрШаблон(НСтр("ru = 'Ошибка при установке значений по-умолчанию реквизитов типовой операции: %1'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
	КонецПопытки;

КонецПроцедуры // УстановитьЗначенияРеквизитовПоУмолчаниюВДокументы()

// Устанавливает значения не заполненных дополнительных реквизитов операции в существующих документах.
// Обработка выполняется порциями по 500 документов.
//
// Параметры:
//  ТаблицаТиповыхОпераций	 - ТаблицаЗначений - Типовые операции, для которых требуется установить значение реквизитов. Содержит колонки:
//		* ТиповаяОперация - СправочникСсылка.ТиповыеОперации - типовая операция.
//		* РеквизитОперации - СправочникСсылка.РеквизитыТиповыхОпераций - реквизит операции.
//		* ЗначениеРеквизита - Произвольный - Значение реквизита операции, которое будет установлено.
//
//  ОбработкаЗавершена		 - Булево - Возвращаемый параметр. Ложь, если после обработки 500 документов остались не обработанные документы.
// 									Или при записи набора возникла ошибка.
//
Процедура УстановитьЗначениеДополнительногоРеквизитаВДокументах(ТаблицаТиповыхОпераций, ОбработкаЗавершена = Истина) Экспорт
	
	ОбработкаЗавершена = Истина;
	ТаблицаДляОбработки = ТаблицаТиповыхОпераций.Скопировать();
	ТаблицаДляОбработки.Колонки.Добавить("Документ", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
	
	ДокументыТиповыхОпераций = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТаблицаДляОбработки.ВыгрузитьКолонку("ТиповаяОперация"), "ИдентификаторДокумента");
	СтрокиСОшибкой = Новый Массив;
	
	Для каждого ТекСтр Из ТаблицаДляОбработки Цикл
		
		ДокументОперации = ДокументыТиповыхОпераций.Получить(ТекСтр.ТиповаяОперация);
		Если ДокументОперации = Неопределено Тогда
			СтрокиСОшибкой.Добавить(ТекСтр);
		Иначе
			ТекСтр.Документ = ДокументОперации;
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого ТекСтр Из СтрокиСОшибкой Цикл
	
		ТаблицаДляОбработки.Удалить(ТекСтр);
	
	КонецЦикла;
	
	ВладельцыОпераций = ТаблицаДляОбработки.Скопировать(, "Документ");
	ВладельцыОпераций.Свернуть("Документ");
	
	Если ВладельцыОпераций.Количество() > 0 Тогда
		
		ТаблицаДляОбработки.Индексы.Добавить("Документ");
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстыЗапросов = Новый Массив;
	ШаблонЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОперацииДокументов.Документ КАК Документ,
	|	ОперацииДокументов.Операция КАК ТиповаяОперация
	|ИЗ
	|	%ТаблицаДокумента% КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ТаблицаДокумента.Ссылка = ОперацииДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДополнительныхРеквизитовОпераций
	|		ПО ТаблицаДокумента.Ссылка = ЗначенияДополнительныхРеквизитовОпераций.Объект
	|			И (ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации = &%РеквизитОперации%)
	|ГДЕ
	|	ОперацииДокументов.Операция = &%ТиповаяОперация%";
	
	Для каждого ТекВладелец Из ВладельцыОпераций Цикл
	
		СтрокиОпераций = ТаблицаДляОбработки.НайтиСтроки(Новый Структура("Документ", ТекВладелец.Документ));
		
		ТаблицаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекВладелец.Документ, "ПолноеИмя");
		
		Для Каждого СтрокаОперации Из СтрокиОпераций Цикл
			
			ИмяПараметраТиповаяОперация = "ТиповаяОперация" + ТекстыЗапросов.Количество();
			ИмяПараметраРеквизитОперации = "РеквизитОперации" + ТекстыЗапросов.Количество();
			
			ТекстыЗапросов.Добавить(
				СтрЗаменить(СтрЗаменить(СтрЗаменить(ШаблонЗапроса,
				"%ТаблицаДокумента%", ТаблицаДокумента),
				"%ТиповаяОперация%",  ИмяПараметраТиповаяОперация),
				"%РеквизитОперации%", ИмяПараметраРеквизитОперации));
			
			Запрос.УстановитьПараметр(ИмяПараметраТиповаяОперация,  СтрокаОперации.ТиповаяОперация);
			Запрос.УстановитьПараметр(ИмяПараметраРеквизитОперации, СтрокаОперации.РеквизитОперации);
			
		КонецЦикла;
	
	КонецЦикла;
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДляОбработки.Индексы.Добавить("ТиповаяОперация");
	
	Счетчик = 0;
	Пока Выборка.Следующий() Цикл
		
		Попытка
		
			ДокументОбъект = Выборка.Документ.ПолучитьОбъект();
		
		Исключение
			
			// документ удален
			Продолжить;
			
		КонецПопытки;
		
		НачатьТранзакцию();
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить(ДокументОбъект.Метаданные().ПолноеИмя());
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДокументОбъект.Ссылка);
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОперацииДокументов");
		ЭлементБлокировки.УстановитьЗначение("Документ", ДокументОбъект.Ссылка);
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций");
		ЭлементБлокировки.УстановитьЗначение("Объект", ДокументОбъект.Ссылка);
		
		Попытка
		
			Блокировка.Заблокировать();
			ДокументОбъект.Заблокировать();
		
		Исключение
			
			// Ошибка блокировки. Возможно документ заблокирован пользователем или другим сеансом.
			ОбработкаЗавершена = Ложь;
			Продолжить;
			
		КонецПопытки;
		
		НаборЗаписей = РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(ДокументОбъект.Ссылка);
		НаборЗаписей.Прочитать();
		
		РеквизитыОперации = ТаблицаДляОбработки.НайтиСтроки(Новый Структура("ТиповаяОперация", Выборка.ТиповаяОперация));
		Для каждого ПроверяемыйРеквизитОперации Из РеквизитыОперации Цикл
			
			РеквизитЕстьВНаборе = Ложь;
			Для каждого Запись Из НаборЗаписей Цикл
			
				Если Запись.РеквизитОперации = ПроверяемыйРеквизитОперации.РеквизитОперации Тогда
					
					РеквизитЕстьВНаборе = Истина;
					Если Не ЗначениеЗаполнено(Запись.Значение) Тогда
						Запись.Значение = ПроверяемыйРеквизитОперации.ЗначениеРеквизита;
					КонецЕсли;
					
				КонецЕсли;
			
			КонецЦикла;
			Если Не РеквизитЕстьВНаборе Тогда
				
				Запись = НаборЗаписей.Добавить();
				Запись.Объект           = ДокументОбъект.Ссылка;
				Запись.РеквизитОперации = ПроверяемыйРеквизитОперации.РеквизитОперации;
				Запись.Значение         = ПроверяемыйРеквизитОперации.ЗначениеРеквизита;
				
			КонецЕсли;
		
		КонецЦикла;
		
		Если НаборЗаписей.Модифицированность() Тогда
		
			Счетчик = Счетчик + 1;
			Если Счетчик > 500 Тогда
				ОбработкаЗавершена = Ложь;
				ЗафиксироватьТранзакцию();
				Возврат;
			КонецЕсли;
			
			Попытка
			
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина, Ложь);
				ЗафиксироватьТранзакцию();
			
			Исключение
				
				ОбработкаЗавершена = Ложь;
				ОтменитьТранзакцию();
				ТекстСообщения = НСтр("ru = 'Не удалось дополнительные реквизиты операций документа: %Документ% по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ДокументОбъект.Ссылка);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Предупреждение,
					ДокументОбъект.Метаданные(),
					ДокументОбъект.Ссылка,
					ТекстСообщения);
				ВызватьИсключение;
			
			КонецПопытки;
			
		Иначе
			
			ЗафиксироватьТранзакцию();
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

// Возвращает наличие хотя бы одной типовой операции для указанного идентификатор документа.
//
// Параметры:
//  ИдентификаторДокумента	 - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Идентификатор документа.
// Возвращаемое значение:
// Булево - Истина - есть хотя бы одна типовая операция для документа в БД (области данных),
// Ложь - нет ни одной типовой операции.
Функция ЕстьТиповаяОперацияВидаДокумента(ИдентификаторДокумента) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	Справочник.ТиповыеОперации КАК ТиповыеОперации
	|ГДЕ
	|	ТиповыеОперации.ИдентификаторДокумента = &ИдентификаторДокумента";
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции // ЕстьТиповаяОперацияВидаДокумента()

// Процедура устанавливает признак "НеИспользуется" равным Истина.
// При возникновении ошибки устанавливает параметр Отказ равным Истина.
// Ошибки пишутся в журнал регистрации.
//
// Параметры:
//  ИмяПредопределенного - Строка - имя предопределенного элемента.
//  Отказ				 - Булево - возвращаемый параметр.
//
Процедура ОтключитьИспользованияОперации(ИмяПредопределенного, Отказ = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТиповыеОперации.Ссылка
	|ИЗ
	|	Справочник.ТиповыеОперации КАК ТиповыеОперации
	|ГДЕ
	|	ТиповыеОперации.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных";
	Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ИмяПредопределенного);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Объект.НеИспользуется = Истина;
		Попытка
			
			// Запись производится с отключением бизнес-логики, т.к.
			// типовые операции не включаются в планы обмена
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
		
		Исключение
			
			Ошибка = ИнформацияОбОшибке();
			
			ЗаписьЖурналаРегистрации("Данные.Изменение",
				УровеньЖурналаРегистрации.Ошибка,,
				Выборка.Ссылка,
				ПодробноеПредставлениеОшибки(Ошибка));
			Отказ = Истина;
			
		КонецПопытки;
	Иначе
		ЗаписьЖурналаРегистрации("Данные.Изменение",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ТиповыеОперации,,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не найден предопределенный элемент с именем ""%1""'", Метаданные.Языки.Русский.КодЯзыка),
				ИмяПредопределенного));
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ОтключитьОтПоддержкиТиповыеОперацииВОбластиДанных() Экспорт

	Если НЕ ОбщегоНазначения.РазделениеВключено()
		ИЛИ Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтключенныеОтПоддержкиПоставляемыеТиповыеОперации.ПоставляемаяТиповаяОперация КАК ПоставляемаяТиповаяОперация,
	|	ТиповыеОперации.Ссылка КАК ТиповаяОперация,
	|	ЕстьNULL(ТиповыеОперации.СостояниеПоддержки, ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.РедактируетсяБезСохраненияПоддержки)) КАК СостояниеПоддержки
	|ИЗ
	|	РегистрСведений.ОтключенныеОтПоддержкиПоставляемыеТиповыеОперации КАК ОтключенныеОтПоддержкиПоставляемыеТиповыеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТиповыеОперации КАК ТиповыеОперации
	|		ПО ТиповыеОперации.ПоставляемаяТиповаяОперация = ОтключенныеОтПоддержкиПоставляемыеТиповыеОперации.ПоставляемаяТиповаяОперация
	|ГДЕ
	|	ОтключенныеОтПоддержкиПоставляемыеТиповыеОперации.ОбластьДанныхВспомогательныеДанные = &ОбластьДанныхВспомогательныеДанные";
	Запрос.УстановитьПараметр("ОбластьДанныхВспомогательныеДанные", РаботаВМоделиСервиса.ЗначениеРазделителяСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если ЗначениеЗаполнено(Выборка.ТиповаяОперация) Тогда
			
			ОтключитьОтПоддержкиТиповуюОперацию(Выборка.ТиповаяОперация, Выборка.СостояниеПоддержки);
			
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.ОтключенныеОтПоддержкиПоставляемыеТиповыеОперации.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбластьДанныхВспомогательныеДанные = РаботаВМоделиСервиса.ЗначениеРазделителяСеанса();
		МенеджерЗаписи.ПоставляемаяТиповаяОперация = Выборка.ПоставляемаяТиповаяОперация;
		МенеджерЗаписи.Прочитать();
		
		Если ЗначениеЗаполнено(МенеджерЗаписи.ПоставляемаяТиповаяОперация) Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

Процедура ОтключитьОтПоддержкиТиповуюОперацию(ТиповаяОперация, Знач СостояниеПоддержки = Неопределено) Экспорт

	Если СостояниеПоддержки = Неопределено Тогда
		СостояниеПоддержки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТиповаяОперация, "СостояниеПоддержки");
	КонецЕсли;
	
	Если СостояниеПоддержки <> Перечисления.СостоянияПоддержкиТиповыхОпераций.РедактируетсяБезСохраненияПоддержки Тогда
		Обработки.УправлениеПоддержкойТиповыхОпераций.УстановитьСостояниеПоддержкиТО(ТиповаяОперация,
			Перечисления.СостоянияПоддержкиТиповыхОпераций.РедактируетсяБезСохраненияПоддержки);
	КонецЕсли;
	
	ОтвязатьТиповуюОперациюОтПоставляемойТиповойОперации(ТиповаяОперация);

КонецПроцедуры

Процедура ЗаписатьСхемыДляТиповойОперации(ТиповаяОперация) Экспорт

	ДанныеТиповойОперации = РегистрыСведений.ДанныеТиповыхОпераций.СоздатьМенеджерЗаписи();
	ДанныеТиповойОперации.ТиповаяОперация = ТиповаяОперация;
	ДанныеТиповойОперации.Прочитать();
	
	СхемыФормирования = СформироватьСхемыДляТиповойОперации(ТиповаяОперация);
	ДанныеТиповойОперации.СхемаФормированияПроводок = Новый ХранилищеЗначения(
		СхемыФормирования.СхемаФормированияПроводок, Новый СжатиеДанных(9));
	ДанныеТиповойОперации.СхемаПроверкиУсловия 		= Новый ХранилищеЗначения(
		СхемыФормирования.СхемаПроверкиУсловия, Новый СжатиеДанных(9));

	ДанныеТиповойОперации.Записать(Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Перем ИдентификаторДокумента;
	Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Количество()>0 Тогда
		
		ИдентификаторДокумента = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
		Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ИдентификаторДокумента") Тогда
			ИдентификаторДокумента = Параметры.Отбор.ИдентификаторДокумента;
		ИначеЕсли Параметры.Свойство("ДокументОснование") Тогда
			ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Параметры.ДокументОснование));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
			СтандартнаяОбработка = Ложь;
			ДанныеВыбора = ПолучитьСписокТиповыхОперацийПоУсловиям(ИдентификаторДокумента, Параметры);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьОбновлениеТиповыхОперацийПоЗапросу(ТолькоИзменившиеся)
		
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Обновление типов дополнительных реквизитов операций'"));
	ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.ИнициализироватьПредопределенныеЭлементыПВХ();
		
	ДлительныеОперации.СообщитьПрогресс(0, НСтр("ru = 'Удаление поддержки неактуальных типовых операций'"));
	УдалитьПоддержкуНеактуальныхПоставляемыхТиповыхОпераций();
	
	// Обновляем все существующие типовые операции, не снятые с поддержки.
	// И все новые, которые есть только в поставляемых типовых операциях.
	ТаблицаОпераций = ТиповыеОперацииНаПоддержкеТребующиеОбновления(ТолькоИзменившиеся);
	
	ВыполнитьОбновлениеТиповыхОпераций(ТаблицаОпераций, Истина);
	
КонецПроцедуры

Функция СкопироватьКолонкиДереваВТаблицу(Дерево, ИменаКолонок)

	Таблица = Новый ТаблицаЗначений;
	Для каждого ТекКолонка Из Дерево.Колонки Цикл
		Если ИменаКолонок.Свойство(ТекКолонка.Имя) Тогда
			Таблица.Колонки.Добавить(ТекКолонка.Имя, ТекКолонка.ТипЗначения);
		КонецЕсли;
	КонецЦикла;
	Возврат Таблица;

КонецФункции

Процедура ДобавитьСтрокиДереваВМассив(Дерево, СтрокиДерева, ЭтотРеквизит)

	Для каждого ТекСтрока Из Дерево.Строки Цикл
		
		Если ТекСтрока.Ссылка = ЭтотРеквизит ИЛИ ТекСтрока.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
	
		СтрокиДерева.Добавить(ТекСтрока);
		ДобавитьСтрокиДереваВМассив(ТекСтрока, СтрокиДерева, ТекСтрока.Ссылка);
	
	КонецЦикла;

КонецПроцедуры

// Получает список типовых операций, которые можно использовать в соответствии с заданными условиям использования
// операций и заданными правами "Просмотр" типовых операций.
// В параметре "Параметры" передаются параметры формы выбора справочника "ТиповыеОперации".
//
// Параметры:
//  ИдентификаторДокумента	 - СправочникСсылка.ИдентификаторыОбъектовМетаданных - идентификатор документа.
//  Параметры				 - Структура - параметры формы выбора справочника "ТиповыеОперации".
//  ВключатьУдаленныеИНеиспользуемые - Булево - в выборку включаются помеченные на удаление и неспользуемые операции
// Возвращаемое значение:
// СписокЗначений из СправочникСсылка.ТиповыеОперации - список разрешенных типовых операций.
Функция ПолучитьСписокТиповыхОперацийПоУсловиям(ИдентификаторДокумента, Параметры, ВключатьУдаленныеИНеиспользуемые = Ложь) Экспорт
	Перем СтрокаПоиска;
	Перем ПараметрыИспользования;

	СхемаКомпоновки = БухгалтерскиеОперацииПовтИспНаВремяСеанса.СхемаКомпоновкиДанныхДляОтбораТиповыхОпераций(
		ИдентификаторДокумента);
	ИсходныйТекстЗапроса = СхемаКомпоновки.НаборыДанных.Запрос.Запрос;
	
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки);
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
	Настройки = КомпоновщикНастроек.Настройки;
	
	ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ТиповаяОперация");
	ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ТиповаяОперация.Наименование");
	ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Поставщик");
	ВыбранноеПоле = КомпоновщикНастроек.Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("КартинкаСостояниеПоддержки");
	ГруппировкаКомпоновкиДанных = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	ГруппаИЛИ = ОбщийМодульСКД.ДобавитьГруппуОтбораКомпоновкиДанных(Настройки.Отбор, "ГруппаИЛИ");
	ОбщийМодульСКД.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаИЛИ,
														 "ЕстьПравоВсеПользователи",
														 ,
														 Истина);
	ОбщийМодульСКД.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаИЛИ,
														 "ЕстьПравоТекущийПользователь",
														 ,
														 Истина);
	
	Если Не ВключатьУдаленныеИНеиспользуемые Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "НеИспользуется", Ложь, , , Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор, "ПометкаУдаления", Ложь, , , Истина);
	КонецЕсли;
														 
	НаборДанныхЗапрос = СхемаКомпоновки.НаборыДанных.Найти("Запрос");
	Если Параметры.Свойство("СтрокаПоиска", СтрокаПоиска) И ЗначениеЗаполнено(СтрокаПоиска) Тогда
		НаборДанныхЗапрос.Запрос = НаборДанныхЗапрос.Запрос + "
		|И ТиповыеОперации.Наименование ПОДОБНО """ + СтрокаПоиска + "%""";
	КонецЕсли;

	Если Параметры.Свойство("ПараметрыИспользования", ПараметрыИспользования) Тогда
		
		Для каждого ЭлементОтбора Из Настройки.ПараметрыДанных.Элементы Цикл
			
			Если ЭлементОтбора.Параметр = Новый ПараметрКомпоновкиДанных("ИдентификаторДокумента") Тогда
				
			ИначеЕсли ЭлементОтбора.Параметр = Новый ПараметрКомпоновкиДанных("ТекущийПользователь") Тогда
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.Значение = Пользователи.ТекущийПользователь();
			Иначе
				ЭлементОтбора.Использование = Истина;
				ПараметрыИспользования.Свойство(ЭлементОтбора.Параметр, ЭлементОтбора.Значение);
			КонецЕсли;
			
		КонецЦикла;
	
		ОсновнаяГруппаИЛИ = ОбщийМодульСКД.ДобавитьГруппуОтбораКомпоновкиДанных(Настройки.Отбор, "ГруппаИЛИ");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТиповыеОперации.Ссылка,
		|	УсловияИспользованияТиповыхОпераций.УсловиеИспользования
		|ИЗ
		|	Справочник.ТиповыеОперации КАК ТиповыеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияИспользованияТиповыхОпераций КАК УсловияИспользованияТиповыхОпераций
		|		ПО ТиповыеОперации.Ссылка = УсловияИспользованияТиповыхОпераций.ТиповаяОперация
		|ГДЕ
		|	ТиповыеОперации.ИдентификаторДокумента = &ИдентификаторДокумента";
		Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
		Выборка = Запрос.Выполнить().Выбрать();
		
		НаДату = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыИспользования, "СлужебныйДляВыбораНаДату");
		Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыИспользования, "СлужебныйДляВыбораОрганизация");
		
		Пока Выборка.Следующий() Цикл
			
			СериализованныйОтбор = СериализованныйОтборУсловияИспользования(Выборка.УсловиеИспользования);
			БухгалтерскиеОперацииСервер.ПроверитьПериодДействияПланаСчетовВОтборе(СериализованныйОтбор, НаДату, Организация);
			
			Если СериализованныйОтбор <> Неопределено Тогда
				ГруппаИ = ОбщийМодульСКД.ДобавитьГруппуОтбораКомпоновкиДанных(ОсновнаяГруппаИЛИ, "ГруппаИ");
				ОбщийМодульСКД.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаИ,
																	 "ТиповаяОперация",
																	 ,
																	 Выборка.Ссылка);
				СкопироватьОтборДляВыбораТиповойОперации(ГруппаИ, СериализованныйОтбор);
			Иначе
				ОбщийМодульСКД.ДобавитьЭлементОтбораКомпоновкиДанных(ОсновнаяГруппаИЛИ,
																	 "ТиповаяОперация",
																	 ,
																	 Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаТиповыхОпераций = Новый ТаблицаЗначений;
	ТаблицаТиповыхОпераций.Колонки.Добавить("ТиповаяОперация", Новый ОписаниеТипов("СправочникСсылка.ТиповыеОперации"));
	ТаблицаТиповыхОпераций.Колонки.Добавить("ТиповаяОперацияНаименование", Новый ОписаниеТипов("Строка"));
	ТаблицаТиповыхОпераций.Колонки.Добавить("Поставщик", Новый ОписаниеТипов("Строка"));
	ТаблицаТиповыхОпераций.Колонки.Добавить("КартинкаСостояниеПоддержки", Новый ОписаниеТипов("Число"));

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
													  КомпоновщикНастроек.Настройки,
													  ,
													  ,
													  Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,,Истина); 
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
		ТаблицаТО = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		Для каждого СтрокаТО Из ТаблицаТО Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаТиповыхОпераций.Добавить(), СтрокаТО);
		КонецЦикла; 
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Типовые операции. Проверка условия использования'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ТиповыеОперации,
			,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Если ВключатьУдаленныеИНеиспользуемые Тогда
			КоличествоСтандартныхЭлементов = 1;
		Иначе
			КоличествоСтандартныхЭлементов = 3;
		КонецЕсли;
		ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
		Если ЭлементыОтбора.Количество() = КоличествоСтандартныхЭлементов + 1 Тогда
			
			// Последний элемент - это доступность операции по условию использования.
			// Исключим операции, у которых условие использования вычисляется с ошибкой. 
			// Таким образом до исправления условия использования запретим использование операции.
			
			УсловияИспользования = ЭлементыОтбора[ЭлементыОтбора.Количество() - 1].Элементы;
			
			МаксИндекс = УсловияИспользования.Количество() - 1;
			ИндексТекОперации = 0;
			
			Пока ИндексТекОперации <= МаксИндекс Цикл
				
				Для ТекИндекс = 0 По МаксИндекс Цикл
					
					УсловияИспользования[ТекИндекс].Использование = ТекИндекс = ИндексТекОперации;
					
				КонецЦикла;
				
				Попытка
					
					МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
																  КомпоновщикНастроек.Настройки,
																  ,
																  ,
																  Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
					ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
					ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,,Истина); 
					ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
					ТекТаблицаТиповыхОпераций=ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
					
					Для каждого РазрешеннаяТиповаяОперация Из ТекТаблицаТиповыхОпераций Цикл
					
						ЗаполнитьЗначенияСвойств(ТаблицаТиповыхОпераций.Добавить(), РазрешеннаяТиповаяОперация);
					
					КонецЦикла;
					
				Исключение
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Типовые операции. Проверка условия использования'",
							ОбщегоНазначения.КодОсновногоЯзыка()),
						УровеньЖурналаРегистрации.Ошибка,
						Метаданные.Справочники.ТиповыеОперации,
						,
						ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
					УсловиеОперации = УсловияИспользования[ИндексТекОперации];
					ОперацияСОшибкой = Неопределено;
					Для каждого ЭлементОтбора Из УсловиеОперации.Элементы Цикл
					
						Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
							Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТиповаяОперация")
								И ЭлементОтбора.Использование Тогда
								ОперацияСОшибкой = ЭлементОтбора.ПравоеЗначение;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					
					КонецЦикла;
					
					Если ОперацияСОшибкой <> Неопределено Тогда
						
						ТекстСообщенияОбОшибке = НСтр("ru = 'В типовой операции ""%1"" ошибка в условии использования типовой операции'");
						ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщенияОбОшибке,
							ОперацияСОшибкой);
						
						ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ОперацияСОшибкой);
						
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Типовые операции. Проверка условия использования'",
								ОбщегоНазначения.КодОсновногоЯзыка()),
							УровеньЖурналаРегистрации.Ошибка,
							Метаданные.Справочники.ТиповыеОперации,
							ОперацияСОшибкой,
							ТекстОшибки);
						
					КонецЕсли;
					
				КонецПопытки;
					
				ИндексТекОперации = ИндексТекОперации + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецПопытки;
	
	Результат = Новый СписокЗначений;
	Для каждого ТекТиповаяОперация Из ТаблицаТиповыхОпераций Цикл
		
		Если ПолучитьФункциональнуюОпцию("ИспользуютсяНесколькоПоставщиковТиповыхОпераций") И ЗначениеЗаполнено(ТекТиповаяОперация.Поставщик) Тогда
			Наименование = СтрШаблон(НСтр("ru = '%1 (%2)'"), ТекТиповаяОперация.ТиповаяОперацияНаименование, ТекТиповаяОперация.Поставщик);
		Иначе
			Наименование = ТекТиповаяОперация.ТиповаяОперацияНаименование;
		КонецЕсли;
		
		Результат.Добавить(ТекТиповаяОперация.ТиповаяОперация, Наименование,,
			?(ТекТиповаяОперация.КартинкаСостояниеПоддержки = 0, БиблиотекаКартинок.СостояниеПоддержкиТиповыхОперацийСЗамком,
			?(ТекТиповаяОперация.КартинкаСостояниеПоддержки = 2, БиблиотекаКартинок.СостояниеПоддержкиТиповыхОперацийСерыйКуб,
			 БиблиотекаКартинок.ПустаяКартинка)));
		
	КонецЦикла;
	
	СхемаКомпоновки.НаборыДанных.Запрос.Запрос = ИсходныйТекстЗапроса;
	Возврат Результат;

КонецФункции

// Пытается десериализовать отбор из строки. Если в метаданных нет объектов, на которые ссылается отбор, то возникнет исключение.
// Поэтому десериализация делается в попытке.
//
// Параметры:
//  УсловиеИспользования - Строка - строка, содержащая сериализованный отбор
// 
// Возвращаемое значение:
//  ОтборКомпоновкиДанных, Неопределено -
//
Функция СериализованныйОтборУсловияИспользования(УсловиеИспользования)
	Если ЗначениеЗаполнено(УсловиеИспользования) Тогда
		Попытка
			СериализованныйОтбор = ОбщегоНазначения.ЗначениеИзСтрокиXML(УсловиеИспользования).Отбор;
		Исключение
			СериализованныйОтбор = Неопределено;
		КонецПопытки;
	Иначе
		СериализованныйОтбор = Неопределено;
	КонецЕсли;
	Возврат СериализованныйОтбор;
КонецФункции

Процедура СкопироватьУсловияИспользования(ОперацияИсточник, ОперацияПриемник)

	УсловияИспользованияИсточник = РегистрыСведений.УсловияИспользованияТиповыхОпераций.СоздатьМенеджерЗаписи();
	УсловияИспользованияИсточник.ТиповаяОперация = ОперацияИсточник;
	УсловияИспользованияИсточник.Прочитать();
	
	Если ЗначениеЗаполнено(УсловияИспользованияИсточник.УсловиеИспользования) Тогда
		
		УсловияИспользованияПриемник = РегистрыСведений.УсловияИспользованияТиповыхОпераций.СоздатьМенеджерЗаписи();
		УсловияИспользованияПриемник.ТиповаяОперация = ОперацияПриемник;
		УсловияИспользованияПриемник.УсловиеИспользования = УсловияИспользованияИсточник.УсловиеИспользования;
		УсловияИспользованияПриемник.Записать(Истина);
		
	КонецЕсли;

КонецПроцедуры

Процедура СкопироватьДополнительныеИсточникиДанных(ОперацияИсточник, ОперацияПриемник)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.Ссылка,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.Наименование,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяТабличнойЧасти,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяИсточника,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.СпособЗаполнения,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяФункции,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.КолонкиИсточника.(
	|		Ссылка,
	|		НомерСтроки,
	|		ИмяКолонки,
	|		Ресурс,
	|		ОписаниеТипаКолонкиСтрокой
	|	),
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ПараметрыФункции.(
	|		Ссылка,
	|		НомерСтроки,
	|		ИмяПараметра,
	|		ФормулаПараметра,
	|		ОписаниеТипаПараметраСтрокой
	|	)
	|ИЗ
	|	Справочник.ДополнительныеИсточникиДанныхДляТиповыхОпераций КАК ДополнительныеИсточникиДанныхДляТиповыхОпераций
	|ГДЕ
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.Владелец = &Владелец
	|	И ДополнительныеИсточникиДанныхДляТиповыхОпераций.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Владелец", ОперацияИсточник);
	ВыборкаИсточники = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИсточники.Следующий() Цикл
		
		НовыйИсточник = Справочники.ДополнительныеИсточникиДанныхДляТиповыхОпераций.СоздатьЭлемент();
		НовыйИсточник.Владелец = ОперацияПриемник;
		ЗаполнитьЗначенияСвойств(НовыйИсточник, ВыборкаИсточники, "Наименование,ИмяТабличнойЧасти,ИмяИсточника,СпособЗаполнения,ИмяФункции");
		
		ВыборкаКолонки = ВыборкаИсточники.КолонкиИсточника.Выбрать();
		Пока ВыборкаКолонки.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(НовыйИсточник.КолонкиИсточника.Добавить(), ВыборкаКолонки);
			
		КонецЦикла;
		
		ВыборкаПараметры = ВыборкаИсточники.ПараметрыФункции.Выбрать();
		Пока ВыборкаПараметры.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(НовыйИсточник.ПараметрыФункции.Добавить(), ВыборкаПараметры);
			
		КонецЦикла;
		НовыйИсточник.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Функция выполняет поиск и, при необходимости, создает новый элемент по УИД и Имени предеопределеного.
// Поиск выполняется по УИД, если не найден, то потом по Имени предопределенного.
// При первой загрузке новой типовой операции на поддержке выполняется инициализиация 
// соответствующего предопределенного элемента.
// Хотя бы один из параметров должен быть задан правильно.
//
// Параметры:
//	УИД - УникальныйИдентификатор - уникальный идентификатор ссылки.
//	ИмяПредопределенного - Строка - имя предопределенного элемента.
//
// Возвращаемое значение:
//	СправочникСсылка.ТиповыеОперации - ссылка найденного или созданного элемента.
//
Функция ПолучитьТиповуюОперацию(УИД, ИмяПредопределенного) Экспорт
	Перем Ссылка;
	
	Если Не ЗначениеЗаполнено(УИД) И Не ЗначениеЗаполнено(ИмяПредопределенного) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СсылкаНайдена = Ложь;
	Если ЗначениеЗаполнено(УИД) Тогда
		Ссылка = Справочники.ТиповыеОперации.ПолучитьСсылку(УИД);
		СсылкаНайдена = ОбщегоНазначения.СсылкаСуществует(Ссылка);
	КонецЕсли;
	
	Если НЕ СсылкаНайдена Тогда
		
		Если ЗначениеЗаполнено(ИмяПредопределенного) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ТиповыеОперации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ТиповыеОперации КАК ТиповыеОперации
			|ГДЕ
			|	ТиповыеОперации.ИмяПредопределеннойОперации = &ИмяПредопределенныхДанных";
			Запрос.УстановитьПараметр("ИмяПредопределенныхДанных", ИмяПредопределенного);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Ссылка = Выборка.Ссылка;
				СсылкаНайдена = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
		
	Если Не СсылкаНайдена Тогда
		Элемент = Справочники.ТиповыеОперации.СоздатьЭлемент();
		Если ЗначениеЗаполнено(УИД) Тогда
			Элемент.УстановитьСсылкуНового(Справочники.ТиповыеОперации.ПолучитьСсылку(УИД));
		КонецЕсли;
		
		Элемент.ДополнительныеСвойства.Вставить("НеФормироватьСхему");
		Элемент.Записать();
		Ссылка = Элемент.Ссылка;
	ИначеЕсли ЗначениеЗаполнено(ИмяПредопределенного) Тогда
		ИмяПредопределенныхДанных = ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ИмяПредопределенныхДанных"));
		
		Если ИмяПредопределенныхДанных <> ИмяПредопределенного Тогда
			Элемент = Ссылка.ПолучитьОбъект();
			Элемент.ИмяПредопределенныхДанных = ИмяПредопределенного;
			Элемент.ДополнительныеСвойства.Вставить("НеФормироватьСхему");
			Элемент.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ссылка;

КонецФункции // ПолучитьТиповуюОперацию()

Процедура ДобавитьИменаПолейИзОтбораВМассивРекурсивно(Отбор, МассивИмен)

	Для каждого ЭлементОтбора Из Отбор.Элементы Цикл
	
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ИмяЭлемента = Строка(ЭлементОтбора.ЛевоеЗначение);
			Если Найти(ИмяЭлемента, ".") > 0 Тогда
				ИмяЭлемента = Лев(ИмяЭлемента, Найти(ИмяЭлемента, ".") - 1);
			КонецЕсли;
			Если МассивИмен.Найти(ИмяЭлемента) = Неопределено Тогда
				МассивИмен.Добавить(ИмяЭлемента);
			КонецЕсли;
		Иначе
			ДобавитьИменаПолейИзОтбораВМассивРекурсивно(ЭлементОтбора, МассивИмен);
		КонецЕсли;
	
	КонецЦикла; 	

КонецПроцедуры

Процедура СкопироватьОтборДляВыбораТиповойОперации(Получатель, Источник)

	Для каждого ЭлементОтбора Из Источник.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			НовыйЭлементОтбора = Получатель.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовыйЭлементОтбора, ЭлементОтбора);
			Если НовыйЭлементОтбора.ВидСравнения <> ВидСравненияКомпоновкиДанных.Заполнено
				И НовыйЭлементОтбора.ВидСравнения <> ВидСравненияКомпоновкиДанных.НеЗаполнено
				И Не ЗначениеЗаполнено(НовыйЭлементОтбора.ПравоеЗначение) Тогда
				
				НовыйЭлементОтбора.Использование = Ложь;
				
			КонецЕсли;
			
		Иначе
			
			Группа = Получатель.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));	
			ЗаполнитьЗначенияСвойств(Группа, ЭлементОтбора);
			СкопироватьОтборДляВыбораТиповойОперации(Группа, ЭлементОтбора);
			
		КонецЕсли;
		
	
	КонецЦикла; 

КонецПроцедуры

Процедура ПроверитьПравильностьЗаполненияСхемОперации(ТиповаяОперация, Отказ=Ложь) Экспорт
	
	ДанныеТиповойОперации = ДанныеТиповойОперации(ТиповаяОперация);
	ДополнительныеРеквизиты = ДополнительныеРеквизитыТиповойОперации(ТиповаяОперация);
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации(Истина);
	КонтекстПроведения.ТиповаяОперация = ТиповаяОперация;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Попытка
		
		НаборСвойств = Новый Структура;
		Для каждого ТекДопРеквизит Из ДополнительныеРеквизиты Цикл
			
			ЗначениеПоУмолчанию = Неопределено;
			ТекущийТип = ТекДопРеквизит.РеквизитПроводки.ТипЗначения.Типы()[0];
			Если ТекущийТип = Тип("Строка") Тогда
				ЗначениеПоУмолчанию = "";
			ИначеЕсли ТекущийТип = Тип("Число") Тогда
				ЗначениеПоУмолчанию = 0;
			ИначеЕсли ТекущийТип = Тип("Дата") Тогда
				ЗначениеПоУмолчанию = Дата(2012,1,1);
			ИначеЕсли ТекущийТип = Тип("Булево") Тогда
				ЗначениеПоУмолчанию = Ложь;
			ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТекущийТип) Тогда
				ЗначениеПоУмолчанию = Перечисления[Метаданные.НайтиПоТипу(ТекущийТип).Имя].ПустаяСсылка();
			ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТекущийТип) Тогда
				ЗначениеПоУмолчанию = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТекущийТип).ПолноеИмя).ПустаяСсылка();
			КонецЕсли;
			
			НаборСвойств.Вставить(ТекДопРеквизит.ИмяДляФормулы, ЗначениеПоУмолчанию);
		
		КонецЦикла; 
		
		МенджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ТиповаяОперация.ИдентификаторДокумента.ПолноеИмя);
		ТестовыйДокумент = СоздатьТестовыйДокумент(МенджерДокумента);
		ПроверяемаяСхема = "Формирование условий";
		ИсточникДанныхДляПроверкиУсловия = БухгалтерскиеОперацииСервер.СоздатьИсточникДанныхИзШапкиОбъекта(ТестовыйДокумент, ТиповаяОперация, НаборСвойств);
		РезультатыПроверкиУсловия = Неопределено;
		БухгалтерскиеОперацииСервер.РассчитатьРеквизитыОперации(ТиповаяОперация, 
																ИсточникДанныхДляПроверкиУсловия,
																РезультатыПроверкиУсловия);
		Если НЕ ДанныеТиповойОперации.ИспользуетсяВнешняяПроцедура Тогда
			ПроверяемаяСхема = "Формирование проводок";
			ИсточникДанныхДляПроверки = БухгалтерскиеОперацииСервер.СоздатьИсточникДанныхИзОбъекта(ТестовыйДокумент);

			ДанныеТиповойОперации = ДанныеТиповойОперации(ТиповаяОперация, "СхемаФормированияПроводок");
			СхемаКомпоновки = ДанныеТиповойОперации.СхемаФормированияПроводок.Получить();
			Если ТипЗнч(СхемаКомпоновки)<>Тип("СхемаКомпоновкиДанных") Тогда
				ВызватьИсключение НСтр("ru='Не задана схема компоновки у типовой операции.'");
			КонецЕсли;
			
			НастройкиСхемы = Неопределено;
			ПараметрыИнициализации = Новый Структура(	"ТиповаяОперация, ДокументОснование, Дата, Организация, НаборСвойств",
														ТиповаяОперация,
														ТестовыйДокумент.Ссылка,
														ТекущаяДатаСеанса(),
														ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию(),
														НаборСвойств);
			БухгалтерскиеОперацииСервер.ИнициализироватьСхемуФормированияПроводок(СхемаКомпоновки, НастройкиСхемы, ПараметрыИнициализации);
			
			КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
			КонтекстПроведения.Вставить("ТестовоеЗаполнение");
			БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
			УстановитьПривилегированныйРежим(Истина);
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
														  НастройкиСхемы.Настройки,
														  ,
														  ,
														  Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ИсточникДанныхДляПроверки,,Истина); 
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
			ТаблицаПроводок=ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);   
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'При проверке настройки типовой операции возникла ошибка.
			|Проверямая схема: %1.
			|Текст ошибки: %2.
			|
			|Подробное описание ошибки записано в журнал регистрации.'");
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка типовой операции'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			ТиповаяОперация.Метаданные(),
			ТиповаяОперация,
			СтрШаблон(ТекстСообщения, ПроверяемаяСхема, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)));
		
		ВызватьИсключение СтрШаблон(ТекстСообщения,
			ПроверяемаяСхема, КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	
	КонецПопытки;
	
КонецПроцедуры

// Функция создает документ для теста формирования схемы проведения типовой операции.
// В документе создается по 1 строке в каждой табличной части
// Параметры:
//	МенеджерДокумента - Мендежер - Метаданные.Документы[ИмяТипДокумента]
//
// Возвращаемое значение:
//	ДокументОбъект
//
Функция СоздатьТестовыйДокумент(МенеджерДокумента)
    
	НовДокумент = МенеджерДокумента.СоздатьДокумент();
	МетаданныеДокумента = НовДокумент.Метаданные();
	Для каждого ТекТЧ Из МетаданныеДокумента.ТабличныеЧасти Цикл
	
		НовДокумент[ТекТЧ.Имя].Добавить();
	
	КонецЦикла; 
	Возврат НовДокумент;

КонецФункции

Процедура ЗагрузитьОтборКомпоновщика(ЭлементыОтбора, ФайлОпераций)
	
	НовЭлемент = "";
	ЭтоСписок = Ложь;
	
	Пока Истина Цикл
		
		Если ФайлОпераций.ЛокальноеИмя = "ГруппаЭлементовОтбора" И ФайлОпераций.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			НоваяГруппа = ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			НоваяГруппа.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных[ФайлОпераций.ПолучитьАтрибут("ТипГруппы")];
			НоваяГруппа.Применение = ТипПримененияОтбораКомпоновкиДанных[ФайлОпераций.ПолучитьАтрибут("Применение")];
			Представление = ФайлОпераций.ПолучитьАтрибут("Представление");
			Если Представление <> Неопределено Тогда
				НоваяГруппа.Представление = Представление;
			КонецЕсли;
			ФайлОпераций.Прочитать();
			ЗагрузитьОтборКомпоновщика(НоваяГруппа.Элементы, ФайлОпераций);
			
		ИначеЕсли ФайлОпераций.ЛокальноеИмя = "ЭлементОтбора" И ФайлОпераций.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			
			НовЭлемент = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовЭлемент.ВидСравнения  	= ВидСравненияКомпоновкиДанных[ФайлОпераций.ПолучитьАтрибут("ВидСравнения")];
			НовЭлемент.Применение    	= ТипПримененияОтбораКомпоновкиДанных[ФайлОпераций.ПолучитьАтрибут("Применение")];
			НовЭлемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			
		ИначеЕсли ФайлОпераций.ЛокальноеИмя = "Использование" И ФайлОпераций.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			ФайлОпераций.Прочитать();
			НовЭлемент.Использование = ПрочитатьXML(ФайлОпераций);
		ИначеЕсли ФайлОпераций.ЛокальноеИмя = "ЛевоеЗначение" И ФайлОпераций.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			ФайлОпераций.Прочитать();
			НовЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПрочитатьXML(ФайлОпераций));
		ИначеЕсли ФайлОпераций.ЛокальноеИмя = "СписокЭлементовОтбора" И ФайлОпераций.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			ЭтоСписок = Истина;
			НовЭлемент.ПравоеЗначение = Новый СписокЗначений;
		ИначеЕсли ФайлОпераций.ЛокальноеИмя = "ЗначениеОтбора" И ФайлОпераций.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			
			ТекЗначение = БухгалтерскиеОперацииСервер.ПрочитатьЗначениеРеквизитаИзУзлаФайла(ФайлОпераций);
			Если ЭтоСписок Тогда
				Если ТипЗнч(НовЭлемент.ПравоеЗначение)<>Тип("СписокЗначений") Тогда
					НовЭлемент.ПравоеЗначение = Новый СписокЗначений;
				КонецЕсли;
				НовЭлемент.ПравоеЗначение.Добавить(ТекЗначение);
			Иначе
				НовЭлемент.ПравоеЗначение = ТекЗначение;
				ФайлОпераций.Прочитать();
			КонецЕсли;
						
		ИначеЕсли ФайлОпераций.ТипУзла = ТипУзлаXML.КонецЭлемента 
			И ФайлОпераций.ЛокальноеИмя <> "СписокЭлементовОтбора"
			И ФайлОпераций.ЛокальноеИмя <> "ЗначениеОтбора"
			И ФайлОпераций.ЛокальноеИмя <> "ЭлементОтбора"
			И ФайлОпераций.ЛокальноеИмя <> "ЗначениеРеквизита" Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ФайлОпераций.Прочитать() Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьДополнительныеИсточникиДанныхПоставляемойТиповойОперации(ПоставляемаяТиповаяОперация, ТиповаяОперация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.Ссылка КАК Ссылка,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ПометкаУдаления КАК ПометкаУдаления,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.Наименование КАК Наименование,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяИсточника КАК ИмяИсточника,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.СпособЗаполнения КАК СпособЗаполнения,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяФункции КАК ИмяФункции,
	|	ЛОЖЬ КАК Обработано
	|ИЗ
	|	Справочник.ДополнительныеИсточникиДанныхДляТиповыхОпераций КАК ДополнительныеИсточникиДанныхДляТиповыхОпераций
	|ГДЕ
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.Владелец = &ТиповаяОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.Ссылка КАК Ссылка,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.Наименование КАК Наименование,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяИсточника КАК ИмяИсточника,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.СпособЗаполнения КАК СпособЗаполнения,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяФункции КАК ИмяФункции
	|ИЗ
	|	Справочник.ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций КАК ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций
	|ГДЕ
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.Владелец = &ПоставляемаяТиповаяОперация
	|	И ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка КАК Ссылка,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка.Владелец КАК Владелец,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.НомерСтроки КАК НомерСтроки,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.ИмяКолонки КАК ИмяКолонки,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ресурс КАК Ресурс,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.ОписаниеТипаКолонкиСтрокой КАК ОписаниеТипаКолонкиСтрокой
	|ИЗ
	|	Справочник.ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.КолонкиИсточника КАК ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника
	|ГДЕ
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка.Владелец = &ПоставляемаяТиповаяОперация
	|	И ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка.СпособЗаполнения = ЗНАЧЕНИЕ(Перечисление.СпособыЗаполненияДополнительныхИсточниковДанныхТО.ДанныеДокумента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийПараметрыФункции.Ссылка КАК Ссылка,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийПараметрыФункции.Ссылка.Владелец КАК Владелец,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийПараметрыФункции.НомерСтроки КАК НомерСтроки,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийПараметрыФункции.ИмяПараметра КАК ИмяПараметра,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийПараметрыФункции.ФормулаПараметра КАК ФормулаПараметра,
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийПараметрыФункции.ОписаниеТипаПараметраСтрокой КАК ОписаниеТипаПараметраСтрокой
	|ИЗ
	|	Справочник.ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.ПараметрыФункции КАК ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийПараметрыФункции
	|ГДЕ
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийПараметрыФункции.Ссылка.Владелец = &ПоставляемаяТиповаяОперация
	|	И ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийПараметрыФункции.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОперацийПараметрыФункции.Ссылка.СпособЗаполнения = ЗНАЧЕНИЕ(Перечисление.СпособыЗаполненияДополнительныхИсточниковДанныхТО.Функция)";
	
	Запрос.УстановитьПараметр("ТиповаяОперация",				ТиповаяОперация);
	Запрос.УстановитьПараметр("ПоставляемаяТиповаяОперация",	ПоставляемаяТиповаяОперация);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаТипОпер = РезультатЗапроса[0].Выгрузить();
	ТаблицаПостТипОпер = РезультатЗапроса[1].Выгрузить();
	ТаблицаКолонокПостТипОпер = РезультатЗапроса[2].Выгрузить();
	ТаблицаПараметровПостТипОпер = РезультатЗапроса[3].Выгрузить();
	
	Для каждого ТекПостТипОпер Из ТаблицаПостТипОпер Цикл
	
		СтрокаТипОпер = ТаблицаТипОпер.Найти(ТекПостТипОпер.ИмяИсточника, "ИмяИсточника");
		Если СтрокаТипОпер = Неопределено Тогда
			ИсточникДанных = Справочники.ДополнительныеИсточникиДанныхДляТиповыхОпераций.СоздатьЭлемент();
			ИсточникДанных.Владелец = ТиповаяОперация;
			ИсточникДанных.ИмяИсточника = ТекПостТипОпер.ИмяИсточника;
		Иначе
			СтрокаТипОпер.Обработано = Истина;
			ИсточникДанных = СтрокаТипОпер.Ссылка.ПолучитьОбъект();
			Если ИсточникДанных.ПометкаУдаления = Истина Тогда
				ИсточникДанных.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		КонецЕсли;
		
		Если ИсточникДанных.Наименование <> ТекПостТипОпер.Наименование Тогда
			ИсточникДанных.Наименование = ТекПостТипОпер.Наименование;
		КонецЕсли;
		Если ИсточникДанных.ИмяТабличнойЧасти <> ТекПостТипОпер.ИмяТабличнойЧасти Тогда
			ИсточникДанных.ИмяТабличнойЧасти = ТекПостТипОпер.ИмяТабличнойЧасти;
		КонецЕсли;
		Если ИсточникДанных.СпособЗаполнения <> ТекПостТипОпер.СпособЗаполнения Тогда
			ИсточникДанных.СпособЗаполнения = ТекПостТипОпер.СпособЗаполнения;
		КонецЕсли;
		Если ИсточникДанных.ИмяФункции <> ТекПостТипОпер.ИмяФункции Тогда
			ИсточникДанных.ИмяФункции = ТекПостТипОпер.ИмяФункции;
		КонецЕсли;
		
		Если ИсточникДанных.СпособЗаполнения = Перечисления.СпособыЗаполненияДополнительныхИсточниковДанныхТО.ДанныеДокумента Тогда
			КолонкиПостТипОпер = ТаблицаКолонокПостТипОпер.НайтиСтроки(Новый Структура("Ссылка", ТекПостТипОпер.Ссылка));
			ЗаполнитьКолонкиИсточникаДанныхИзПоставляемыхДанных(ИсточникДанных.КолонкиИсточника, КолонкиПостТипОпер);
			Если ИсточникДанных.ПараметрыФункции.Количество() > 0 Тогда
				ИсточникДанных.ПараметрыФункции.Очистить();
			КонецЕсли;
		Иначе
			
			Попытка
				ОписанияКолонокИсточника = БухгалтерскиеОперацииИсточникиДанных.ОписаниеПолейИсточникаДанных(
					ИсточникДанных.ИмяФункции);
				ЗаполнитьКолонкиИсточникаДанныхИзФункцииИсточникаДанных(ИсточникДанных.КолонкиИсточника,
					ОписанияКолонокИсточника);
				
				ФормулыПараметров = ФормулыПараметровПоставляемогоИсточника(
					ТаблицаПараметровПостТипОпер.НайтиСтроки(Новый Структура("Ссылка", ТекПостТипОпер.Ссылка)));
				ОписанияПараметровФункции = БухгалтерскиеОперацииИсточникиДанных.ОписаниеПараметровИсточникаДанных(
					ИсточникДанных.ИмяФункции);
				ЗаполнитьПараметрыИсточникаДанныхИзФункцииИсточникаДанных(ИсточникДанных.ПараметрыФункции,
					ОписанияПараметровФункции, ФормулыПараметров);
			Исключение
				ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииОбновлениеТО(),
					УровеньЖурналаРегистрации.Ошибка,
					ПоставляемаяТиповаяОперация.Метаданные(),
					ПоставляемаяТиповаяОперация,
					СтрШаблон(НСтр("ru = 'При получении дополнительного источника данных по функции ""%1"" произошла ошибка:
						|%2'"),
						ИсточникДанных.ИмяФункции, 
						ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			КонецПопытки;
			
		КонецЕсли;
		
		Если ИсточникДанных.Модифицированность() Тогда
			ИсточникДанных.Записать();
		КонецЕсли;
	
	КонецЦикла;
	
	Для Каждого ТекТипОпер Из ТаблицаТипОпер Цикл
		
		Если ТекТипОпер.Обработано = Ложь Тогда
			ИсточникДанных = ТекТипОпер.Ссылка.ПолучитьОбъект();
			Если ИсточникДанных.ПометкаУдаления = Ложь Тогда
				ИсточникДанных.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКолонкиИсточникаДанныхИзПоставляемыхДанных(Колонки, ПоставляемыеКолонки)

	СуществующиеКолонки = Новый Структура;
	Для Каждого Колонка Из Колонки Цикл
		СуществующиеКолонки.Вставить(Колонка.ИмяКолонки, Колонка);
	КонецЦикла;
	
	Для каждого ПоставляемаяКолонка Из ПоставляемыеКолонки Цикл
	
		Если СуществующиеКолонки.Свойство(ПоставляемаяКолонка.ИмяКолонки) Тогда
			СуществующиеКолонки.Удалить(ПоставляемаяКолонка.ИмяКолонки);
		Иначе
			ЗаполнитьЗначенияСвойств(Колонки.Добавить(), ПоставляемаяКолонка);
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого Колонка Из СуществующиеКолонки Цикл
	
		Колонки.Удалить(Колонка.Значение);
	
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьКолонкиИсточникаДанныхИзФункцииИсточникаДанных(Колонки, КолонкиФункции)
	Перем СтрокаКолонки;
	
	СуществующиеКолонки = Новый Структура;
	Для Каждого Колонка Из Колонки Цикл
		СуществующиеКолонки.Вставить(Колонка.ИмяКолонки, Колонка);
	КонецЦикла;
	
	Для каждого КолонкаФункции Из КолонкиФункции Цикл
		
		ОписаниеТипаСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(КолонкаФункции.Тип);
		
		Если СуществующиеКолонки.Свойство(КолонкаФункции.Имя, СтрокаКолонки) Тогда
			УстановитьЗначение(СтрокаКолонки.ОписаниеТипаКолонкиСтрокой, ОписаниеТипаСтрокой);
			СуществующиеКолонки.Удалить(КолонкаФункции.Имя);
		Иначе
			НоваяКолонка = Колонки.Добавить();
			НоваяКолонка.ИмяКолонки = КолонкаФункции.Имя;
			НоваяКолонка.ОписаниеТипаКолонкиСтрокой = ОписаниеТипаСтрокой;
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого Колонка Из СуществующиеКолонки Цикл
	
		Колонки.Удалить(Колонка.Значение);
	
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьПараметрыИсточникаДанныхИзФункцииИсточникаДанных(Параметры, ПараметрыФункции, ФормулыПараметров)
	Перем СтрокаПараметра;
	Перем ЗначениеПараметра;
	
	СуществующиеПараметры = Новый Структура;
	Для Каждого Параметр Из Параметры Цикл
		СуществующиеПараметры.Вставить(Параметр.ИмяПараметра, Параметр);
	КонецЦикла;
	
	Для каждого ПараметрФункции Из ПараметрыФункции Цикл
		
		ОписаниеТипаСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ПараметрФункции.Тип);
		
		Если СуществующиеПараметры.Свойство(ПараметрФункции.Имя, СтрокаПараметра) Тогда
			УстановитьЗначение(СтрокаПараметра.ОписаниеТипаПараметраСтрокой, ОписаниеТипаСтрокой);
			СуществующиеПараметры.Удалить(ПараметрФункции.Имя);
		Иначе
			СтрокаПараметра = Параметры.Добавить();
			СтрокаПараметра.ИмяПараметра = ПараметрФункции.Имя;
			СтрокаПараметра.ОписаниеТипаПараметраСтрокой = ОписаниеТипаСтрокой;
		КонецЕсли;
		
		Если ФормулыПараметров.Свойство(СтрокаПараметра.ИмяПараметра, ЗначениеПараметра) Тогда
			УстановитьЗначение(СтрокаПараметра.ФормулаПараметра, ЗначениеПараметра);
		ИначеЕсли ЗначениеЗаполнено(СтрокаПараметра.ФормулаПараметра) Тогда
			СтрокаПараметра.ФормулаПараметра = "";
		КонецЕсли;
	
	КонецЦикла;
	
	Для каждого Параметр Из СуществующиеПараметры Цикл
	
		Параметры.Удалить(Параметр.Значение);
	
	КонецЦикла;

КонецПроцедуры

Функция ФормулыПараметровПоставляемогоИсточника(Параметры)

	Результат = Новый Структура;
	Для каждого ОписаниеТекПараметра Из Параметры Цикл
	
		Если ЗначениеЗаполнено(ОписаниеТекПараметра.ФормулаПараметра) Тогда
			Результат.Вставить(ОписаниеТекПараметра.ИмяПараметра, ОписаниеТекПараметра.ФормулаПараметра);
		КонецЕсли;
	
	КонецЦикла;
	Возврат Результат;

КонецФункции

Процедура СоздатьРеквизитыТиповойОперацииИзПоставляемыхРеквизитов(ВыборкаСтроки, ТиповаяОперация, ПредыдущийЭлемент,
	Родитель, РеквизитыБезПоддержки)
	
	Для Каждого Выборка Из ВыборкаСтроки Цикл
		
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			Если Выборка.Ссылка = ПредыдущийЭлемент Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйРеквизит = СоздатьРеквизитТиповойОперацииИзПоставляемогоРеквизита(ТиповаяОперация, Выборка,
				Родитель, РеквизитыБезПоддержки);
			
			Если Выборка.ЭтоГруппа Тогда
				СоздатьРеквизитыТиповойОперацииИзПоставляемыхРеквизитов(Выборка.Строки, ТиповаяОперация,
					Выборка.Ссылка, НовыйРеквизит.Ссылка, РеквизитыБезПоддержки);
			КонецЕсли
			
		Иначе
			СоздатьРеквизитыТиповойОперацииИзПоставляемыхРеквизитов(Выборка.Строки, ТиповаяОперация, Выборка.Ссылка,
				Неопределено, РеквизитыБезПоддержки);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьРеквизитТиповойОперацииИзПоставляемогоРеквизита(ТиповаяОперация, ТекущаяСтрока, Родитель, РеквизитыБезПоддержки)

	Источник = ТекущаяСтрока;
	Пока Источник.Строки.Количество() > 0 Цикл
		Для каждого СтрокаИсточника Из Источник.Строки Цикл
		
			Если СтрокаИсточника.Ссылка = ТекущаяСтрока.Ссылка Тогда
				Источник = СтрокаИсточника;
				Прервать;
			КонецЕсли;
		
		КонецЦикла;
	КонецЦикла;
	
	РеквизитТиповойОперации = Источник.РеквизитТиповойОперации;
	Если Не ЗначениеЗаполнено(РеквизитТиповойОперации) Тогда
		// если реквизит не задан, то пробуем найти среди реквизитов без поддержки
		Отбор = Новый Структура("ЭтоГруппа, ИмяДляФормулы", Источник.ЭтоГруппа, ВРег(Источник.ИмяДляФормулы));
		СтрокиРеквизитов = РеквизитыБезПоддержки.НайтиСтроки(Отбор);
		Если СтрокиРеквизитов.Количество() > 0 Тогда
			РеквизитТиповойОперации = СтрокиРеквизитов[0].Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если Источник.ЭтоГруппа Тогда
		Если ЗначениеЗаполнено(РеквизитТиповойОперации) Тогда
			НовыйЭлемент = РеквизитТиповойОперации.ПолучитьОбъект();
			Если НовыйЭлемент.ПометкаУдаления = Ложь Тогда
				НовыйЭлемент.УстановитьПометкуУдаления(Ложь, Ложь);
			КонецЕсли;
		Иначе
			НовыйЭлемент = Справочники.РеквизитыТиповыхОпераций.СоздатьГруппу();
			НовыйЭлемент.Владелец = ТиповаяОперация;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НовыйЭлемент.ПоставляемыйРеквизитТиповойОперации) Тогда
			НовыйЭлемент.ПоставляемыйРеквизитТиповойОперации = Источник.Ссылка;
		КонецЕсли;
		Если НовыйЭлемент.Родитель <> Родитель И (ЗначениеЗаполнено(Родитель) ИЛИ ЗначениеЗаполнено(НовыйЭлемент.Родитель)) Тогда
			НовыйЭлемент.Родитель = Родитель;
		КонецЕсли;
		УстановитьЗначение(НовыйЭлемент.Наименование,  Источник.Наименование);
		УстановитьЗначение(НовыйЭлемент.Код,           Источник.Код);
		УстановитьЗначение(НовыйЭлемент.ИмяДляФормулы, Источник.ИмяДляФормулы);
		Если НовыйЭлемент.Модифицированность() Тогда
			НовыйЭлемент.ДополнительныеСвойства.Вставить("НеПроверять");
			НовыйЭлемент.Записать();
		КонецЕсли;
		Если НовыйЭлемент.ПометкаУдаления Тогда
			НовыйЭлемент.УстановитьПометкуУдаления(Ложь, Ложь);
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(РеквизитТиповойОперации) Тогда
			НовыйЭлемент = РеквизитТиповойОперации.ПолучитьОбъект();
			Если НовыйЭлемент.ПометкаУдаления = Ложь Тогда
				НовыйЭлемент.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
		Иначе
			НовыйЭлемент = Справочники.РеквизитыТиповыхОпераций.СоздатьЭлемент();
			НовыйЭлемент.Владелец = ТиповаяОперация;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НовыйЭлемент.ПоставляемыйРеквизитТиповойОперации) Тогда
			НовыйЭлемент.ПоставляемыйРеквизитТиповойОперации = Источник.Ссылка;
		КонецЕсли;
		Если НовыйЭлемент.Родитель <> Родитель И (ЗначениеЗаполнено(Родитель) ИЛИ ЗначениеЗаполнено(НовыйЭлемент.Родитель)) Тогда
			НовыйЭлемент.Родитель = Родитель;
		КонецЕсли;
		РеквизитПроводки = ТипДополнительногоРеквизитаПоОписанию(Источник.РеквизитПроводки);
		ОтборЭлементов = ПолучитьСериализованныйКомпоновщикНастроекИзПоставляемогоОтбора(Источник.ОтборЭлементов, "ОтборЭлементов");
		ЗначениеПоУмолчанию = ПолучитьЗначениеПоУмолчаниюИзПоставлемыхДанных(Источник.ЗначениеПоУмолчанию);
		
		УстановитьЗначение(НовыйЭлемент.Наименование,        Источник.Наименование);
		УстановитьЗначение(НовыйЭлемент.Код,                 Источник.Код);
		УстановитьЗначение(НовыйЭлемент.ИмяДляФормулы,       Источник.ИмяДляФормулы);
		УстановитьЗначение(НовыйЭлемент.РеквизитПроводки,    РеквизитПроводки);
		УстановитьЗначение(НовыйЭлемент.ОтборЭлементов,      ОтборЭлементов);
		УстановитьЗначение(НовыйЭлемент.ЗначениеПоУмолчанию, ЗначениеПоУмолчанию);
		
		Если НовыйЭлемент.Модифицированность() Тогда
			НовыйЭлемент.ДополнительныеСвойства.Вставить("НеПроверять");
			НовыйЭлемент.Записать();
		КонецЕсли;
		Если НовыйЭлемент.ПометкаУдаления Тогда
			НовыйЭлемент.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция ТекстЗапросаПроводкиТиповойОперации(ПолучатьНастройкуПроводок, ВключатьУдаленные = Ложь, ВключатьНеИспользуемые = Ложь) Экспорт

	ЧастиТекстаЗапроса = Новый Массив;
	ЧастиТекстаЗапроса.Добавить("
	|ВЫБРАТЬ
	|	ПроводкиТиповыхОпераций.Ссылка КАК Ссылка,
	|	ПроводкиТиповыхОпераций.ПометкаУдаления КАК ПометкаУдаления,
	|	ПроводкиТиповыхОпераций.Предопределенный КАК Предопределенный,
	|	ПроводкиТиповыхОпераций.Владелец КАК Владелец,
	|	ПроводкиТиповыхОпераций.Код КАК Код,
	|	ПроводкиТиповыхОпераций.Наименование КАК Наименование,
	|	ПроводкиТиповыхОпераций.НеИспользовать КАК НеИспользовать,
	|	ПроводкиТиповыхОпераций.ВидПланаСчетов КАК ВидПланаСчетов,
	|	ПроводкиТиповыхОпераций.ИмяТабличнойЧастиДокумента КАК ИмяТабличнойЧастиДокумента,
	|	ПроводкиТиповыхОпераций.ПорядковыйНомерГруппы КАК ПорядковыйНомерГруппы,
	|	ПроводкиТиповыхОпераций.ПорядковыйНомерВГруппе КАК ПорядковыйНомерВГруппе,
	|	ПроводкиТиповыхОпераций.СостояниеПоддержки КАК СостояниеПоддержки,
	|	ПроводкиТиповыхОпераций.ПоставляемаяПроводка КАК ПоставляемаяПроводка");
	Если ПолучатьНастройкуПроводок Тогда
		ЧастиТекстаЗапроса.Добавить(",
		|	ДанныеПроводокТиповыхОпераций.Условие КАК Условие,
		|	ДанныеПроводокТиповыхОпераций.КФО КАК КФО,
		|	ДанныеПроводокТиповыхОпераций.ФормулаКФО КАК ФормулаКФО,
		|	ДанныеПроводокТиповыхОпераций.Сумма КАК Сумма,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСумма КАК ФормулаСумма,
		|	ДанныеПроводокТиповыхОпераций.СуммаНеУчитываетсяНУ КАК СуммаНеУчитываетсяНУ,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСуммаНеУчитываетсяНУ КАК ФормулаСуммаНеУчитываетсяНУ,
		|	ДанныеПроводокТиповыхОпераций.СуммаЕНВД КАК СуммаЕНВД,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСуммаЕНВД КАК ФормулаСуммаЕНВД,
		|	ДанныеПроводокТиповыхОпераций.СуммаНДС КАК СуммаНДС,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСуммаНДС КАК ФормулаСуммаНДС,
		|	ДанныеПроводокТиповыхОпераций.СчетДт КАК СчетДт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСчетДт КАК ФормулаСчетДт,
		|	ДанныеПроводокТиповыхОпераций.КПСДт КАК КПСДт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаКПСДт КАК ФормулаКПСДт,
		|	ДанныеПроводокТиповыхОпераций.КЭКДт КАК КЭКДт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаКЭКДт КАК ФормулаКЭКДт,
		|	ДанныеПроводокТиповыхОпераций.ВидСубконтоДт1 КАК ВидСубконтоДт1,
		|	ДанныеПроводокТиповыхОпераций.СубконтоДт1 КАК СубконтоДт1,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСубконтоДт1 КАК ФормулаСубконтоДт1,
		|	ДанныеПроводокТиповыхОпераций.ВидСубконтоДт2 КАК ВидСубконтоДт2,
		|	ДанныеПроводокТиповыхОпераций.СубконтоДт2 КАК СубконтоДт2,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСубконтоДт2 КАК ФормулаСубконтоДт2,
		|	ДанныеПроводокТиповыхОпераций.ВидСубконтоДт3 КАК ВидСубконтоДт3,
		|	ДанныеПроводокТиповыхОпераций.СубконтоДт3 КАК СубконтоДт3,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСубконтоДт3 КАК ФормулаСубконтоДт3,
		|	ДанныеПроводокТиповыхОпераций.ХарактеристикаДвиженияДт КАК ХарактеристикаДвиженияДт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаХарактеристикаДвиженияДт КАК ФормулаХарактеристикаДвиженияДт,
		|	ДанныеПроводокТиповыхОпераций.ПодразделениеДт КАК ПодразделениеДт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаПодразделениеДт КАК ФормулаПодразделениеДт,
		|	ДанныеПроводокТиповыхОпераций.КоличествоДт КАК КоличествоДт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаКоличествоДт КАК ФормулаКоличествоДт,
		|	ДанныеПроводокТиповыхОпераций.ВалютаДт КАК ВалютаДт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаВалютаДт КАК ФормулаВалютаДт,
		|	ДанныеПроводокТиповыхОпераций.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаВалютнаяСуммаДт КАК ФормулаВалютнаяСуммаДт,
		|	ДанныеПроводокТиповыхОпераций.СчетКт КАК СчетКт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСчетКт КАК ФормулаСчетКт,
		|	ДанныеПроводокТиповыхОпераций.КПСКт КАК КПСКт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаКПСКт КАК ФормулаКПСКт,
		|	ДанныеПроводокТиповыхОпераций.КЭККт КАК КЭККт,
		|	ДанныеПроводокТиповыхОпераций.ВидСубконтоКт1 КАК ВидСубконтоКт1,
		|	ДанныеПроводокТиповыхОпераций.ФормулаКЭККт КАК ФормулаКЭККт,
		|	ДанныеПроводокТиповыхОпераций.СубконтоКт1 КАК СубконтоКт1,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСубконтоКт1 КАК ФормулаСубконтоКт1,
		|	ДанныеПроводокТиповыхОпераций.ВидСубконтоКт2 КАК ВидСубконтоКт2,
		|	ДанныеПроводокТиповыхОпераций.СубконтоКт2 КАК СубконтоКт2,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСубконтоКт2 КАК ФормулаСубконтоКт2,
		|	ДанныеПроводокТиповыхОпераций.ВидСубконтоКт3 КАК ВидСубконтоКт3,
		|	ДанныеПроводокТиповыхОпераций.СубконтоКт3 КАК СубконтоКт3,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСубконтоКт3 КАК ФормулаСубконтоКт3,
		|	ДанныеПроводокТиповыхОпераций.ХарактеристикаДвиженияКт КАК ХарактеристикаДвиженияКт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаХарактеристикаДвиженияКт КАК ФормулаХарактеристикаДвиженияКт,
		|	ДанныеПроводокТиповыхОпераций.ПодразделениеКт КАК ПодразделениеКт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаПодразделениеКт КАК ФормулаПодразделениеКт,
		|	ДанныеПроводокТиповыхОпераций.КоличествоКт КАК КоличествоКт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаКоличествоКт КАК ФормулаКоличествоКт,
		|	ДанныеПроводокТиповыхОпераций.ВалютаКт КАК ВалютаКт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаВалютаКт КАК ФормулаВалютаКт,
		|	ДанныеПроводокТиповыхОпераций.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт,
		|	ДанныеПроводокТиповыхОпераций.ФормулаВалютнаяСуммаКт КАК ФормулаВалютнаяСуммаКт,
		|	ДанныеПроводокТиповыхОпераций.ИФО КАК ИФО,
		|	ДанныеПроводокТиповыхОпераций.ФормулаИФО КАК ФормулаИФО,
		|	ДанныеПроводокТиповыхОпераций.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
		|	ДанныеПроводокТиповыхОпераций.ФормулаВидПервичногоДокумента КАК ФормулаВидПервичногоДокумента,
		|	ДанныеПроводокТиповыхОпераций.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
		|	ДанныеПроводокТиповыхОпераций.ФормулаДатаПервичногоДокумента КАК ФормулаДатаПервичногоДокумента,
		|	ДанныеПроводокТиповыхОпераций.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
		|	ДанныеПроводокТиповыхОпераций.ФормулаНомерПервичногоДокумента КАК ФормулаНомерПервичногоДокумента,
		|	ДанныеПроводокТиповыхОпераций.Содержание КАК Содержание,
		|	ДанныеПроводокТиповыхОпераций.ФормулаСодержание КАК ФормулаСодержание,
		|	ДанныеПроводокТиповыхОпераций.НомерЖурнала КАК НомерЖурнала,
		|	ДанныеПроводокТиповыхОпераций.ФормулаНомерЖурнала КАК ФормулаНомерЖурнала,
		|	ДанныеПроводокТиповыхОпераций.ФормулаПериод КАК ФормулаПериод,
		|	ДанныеПроводокТиповыхОпераций.НеПересчитыватьСумму КАК НеПересчитыватьСумму,
		|	ДанныеПроводокТиповыхОпераций.ИспользоватьФормулуПервичногоДокумента КАК ИспользоватьФормулуПервичногоДокумента");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ИЗ
	|	Справочник.ПроводкиТиповыхОпераций КАК ПроводкиТиповыхОпераций");
	Если ПолучатьНастройкуПроводок Тогда
		ЧастиТекстаЗапроса.Добавить("
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПроводокТиповыхОпераций КАК ДанныеПроводокТиповыхОпераций
		|		ПО ПроводкиТиповыхОпераций.Ссылка = ДанныеПроводокТиповыхОпераций.Проводка");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ГДЕ
	|	ПроводкиТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И ПроводкиТиповыхОпераций.СостояниеПоддержки <> ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)");
	Если НЕ ВключатьУдаленные Тогда
		ЧастиТекстаЗапроса.Добавить("
		|	И НЕ ПроводкиТиповыхОпераций.ПометкаУдаления");
	КонецЕсли;
	Если Не ВключатьНеИспользуемые Тогда
		ЧастиТекстаЗапроса.Добавить("
		|	И НЕ ПроводкиТиповыхОпераций.НеИспользовать");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПроводкиТиповыхОпераций.Ссылка,
	|	ПроводкиТиповыхОпераций.ПометкаУдаления,
	|	ПроводкиТиповыхОпераций.Предопределенный,
	|	ПроводкиТиповыхОпераций.Владелец,
	|	ПроводкиТиповыхОпераций.Код,
	|	ПроводкиТиповыхОпераций.Наименование,
	|	ПроводкиТиповыхОпераций.НеИспользовать,
	|	ПроводкиТиповыхОпераций.ВидПланаСчетов,
	|	ПроводкиТиповыхОпераций.ИмяТабличнойЧастиДокумента,
	|	ПроводкиТиповыхОпераций.ПорядковыйНомерГруппы,
	|	ПроводкиТиповыхОпераций.ПорядковыйНомерВГруппе,
	|	ПроводкиТиповыхОпераций.СостояниеПоддержки,
	|	ПроводкиТиповыхОпераций.ПоставляемаяПроводка");
	Если ПолучатьНастройкуПроводок Тогда
		ЧастиТекстаЗапроса.Добавить(",
		|	ПоставляемыеПроводкиТиповыхОпераций.Условие,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКФО,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСумма,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСуммаНеУчитываетсяНУ,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСуммаЕНВД,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСуммаНДС,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСчетДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКПСДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКЭКДт,
		|	NULL,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоДт1,
		|	NULL,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоДт2,
		|	NULL,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоДт3,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаХарактеристикаДвиженияДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаПодразделениеДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКоличествоДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютаДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютнаяСуммаДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСчетКт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКПСКт,
		|	NULL,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКЭККт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоКт1,
		|	NULL,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоКт2,
		|	NULL,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоКт3,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаХарактеристикаДвиженияКт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаПодразделениеКт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКоличествоКт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютаКт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютнаяСуммаКт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаИФО,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВидПервичногоДокумента,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаДатаПервичногоДокумента,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаНомерПервичногоДокумента,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСодержание,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаНомерЖурнала,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаПериод,
		|	ПоставляемыеПроводкиТиповыхОпераций.НеПересчитыватьСумму,
		|	ПоставляемыеПроводкиТиповыхОпераций.ИспользоватьФормулуПервичногоДокумента");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ИЗ
	|	Справочник.ПроводкиТиповыхОпераций КАК ПроводкиТиповыхОпераций");
	Если ПолучатьНастройкуПроводок Тогда
		ЧастиТекстаЗапроса.Добавить("
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПоставляемыеПроводкиТиповыхОпераций КАК ПоставляемыеПроводкиТиповыхОпераций
		|		ПО ПроводкиТиповыхОпераций.ПоставляемаяПроводка = ПоставляемыеПроводкиТиповыхОпераций.Ссылка");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ГДЕ
	|	ПроводкиТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И ПроводкиТиповыхОпераций.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)");
	Если НЕ ВключатьУдаленные Тогда
		ЧастиТекстаЗапроса.Добавить("
		|	И НЕ ПроводкиТиповыхОпераций.ПометкаУдаления");
	КонецЕсли;
	Если НЕ ВключатьНеИспользуемые Тогда
		ЧастиТекстаЗапроса.Добавить("
		|	И НЕ ПроводкиТиповыхОпераций.НеИспользовать");
	КонецЕсли;
	
	ЧастиТекстаЗапроса.Добавить("
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоставляемыеПроводкиТиповыхОпераций.Ссылка,
	|	ПоставляемыеПроводкиТиповыхОпераций.ПометкаУдаления,
	|	ПоставляемыеПроводкиТиповыхОпераций.Предопределенный,
	|	ПоставляемыеПроводкиТиповыхОпераций.Владелец,
	|	ПоставляемыеПроводкиТиповыхОпераций.Код,
	|	ПоставляемыеПроводкиТиповыхОпераций.Наименование,
	|	ПоставляемыеПроводкиТиповыхОпераций.НеИспользовать,
	|	ПоставляемыеПроводкиТиповыхОпераций.ВидПланаСчетов,
	|	ПоставляемыеПроводкиТиповыхОпераций.ИмяТабличнойЧастиДокумента,
	|	ПоставляемыеПроводкиТиповыхОпераций.ПорядковыйНомерГруппы,
	|	ПоставляемыеПроводкиТиповыхОпераций.ПорядковыйНомерВГруппе,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется),
	|	ПоставляемыеПроводкиТиповыхОпераций.Ссылка");
	Если ПолучатьНастройкуПроводок Тогда
		ЧастиТекстаЗапроса.Добавить(",
		|	ПоставляемыеПроводкиТиповыхОпераций.Условие,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКФО,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСумма,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСуммаНеУчитываетсяНУ,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСуммаЕНВД,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСуммаНДС,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСчетДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКПСДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКЭКДт,
		|	NULL,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоДт1,
		|	NULL,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоДт2,
		|	NULL,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоДт3,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаХарактеристикаДвиженияДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаПодразделениеДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКоличествоДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютаДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютнаяСуммаДт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСчетКт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКПСКт,
		|	NULL,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКЭККт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоКт1,
		|	NULL,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоКт2,
		|	NULL,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоКт3,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаХарактеристикаДвиженияКт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаПодразделениеКт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКоличествоКт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютаКт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютнаяСуммаКт,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаИФО,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВидПервичногоДокумента,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаДатаПервичногоДокумента,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаНомерПервичногоДокумента,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСодержание,
		|	NULL,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаНомерЖурнала,
		|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаПериод,
		|	ПоставляемыеПроводкиТиповыхОпераций.НеПересчитыватьСумму,
		|	ПоставляемыеПроводкиТиповыхОпераций.ИспользоватьФормулуПервичногоДокумента");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ИЗ
	|	Справочник.ПоставляемыеПроводкиТиповыхОпераций КАК ПоставляемыеПроводкиТиповыхОпераций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТиповыеОперации КАК ТиповыеОперации
	|		ПО ПоставляемыеПроводкиТиповыхОпераций.Владелец = ТиповыеОперации.ПоставляемаяТиповаяОперация");
	Если ПолучатьНастройкуПроводок Тогда
		ЧастиТекстаЗапроса.Добавить("
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроводкиТиповыхОпераций КАК ПроводкиТиповыхОпераций
		|		ПО ПроводкиТиповыхОпераций.ПоставляемаяПроводка = ПоставляемыеПроводкиТиповыхОпераций.Ссылка");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ГДЕ
	|	ТиповыеОперации.Ссылка = &ТиповаяОперация
	|	И ПроводкиТиповыхОпераций.Ссылка ЕСТЬ NULL");
	Если НЕ ВключатьУдаленные Тогда
		ЧастиТекстаЗапроса.Добавить("
		|	И НЕ ПоставляемыеПроводкиТиповыхОпераций.ПометкаУдаления");
	КонецЕсли;
	Если НЕ ВключатьНеИспользуемые Тогда
		ЧастиТекстаЗапроса.Добавить("
		|	И НЕ ПоставляемыеПроводкиТиповыхОпераций.НеИспользовать");
	КонецЕсли;
	
	Возврат СтрСоединить(ЧастиТекстаЗапроса);

КонецФункции

Функция ТекстЗапросаРеквизитыТиповойОперации(ПолучатьДанныеРеквизитов, ВключатьФО = Ложь, ВключатьГруппы = Ложь, ВключатьУдаленные = Ложь, ВыраженияИтогов = "") Экспорт

	ЧастиТекстаЗапроса = Новый Массив;
	ЧастиТекстаЗапроса.Добавить(
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка КАК Ссылка,
	|	РеквизитыТиповыхОпераций.Владелец КАК Владелец,
	|	РеквизитыТиповыхОпераций.Код КАК Код,
	|	РеквизитыТиповыхОпераций.Наименование КАК Наименование,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки КАК РеквизитПроводки,
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы КАК ИмяДляФормулы,
	|	РеквизитыТиповыхОпераций.ОтборЭлементов КАК ОтборЭлементов,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки.ТипЗначения КАК РеквизитПроводкиТипЗначения,
	|	РеквизитыТиповыхОпераций.Родитель КАК Родитель,
	|	РеквизитыТиповыхОпераций.ЭтоГруппа КАК ЭтоГруппа,
	|	РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации КАК ПоставляемыйРеквизитТиповойОперации,
	|	РеквизитыТиповыхОпераций.СостояниеПоддержки КАК СостояниеПоддержки,
	|	РеквизитыТиповыхОпераций.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию");
	Если ВключатьФО Тогда
		ЧастиТекстаЗапроса.Добавить(",
		|	РеквизитыТиповыхОпераций.ФункциональныеОпции.(
		|		ИмяФункциональнойОпции КАК ИмяФункциональнойОпции
		|	) КАК ФункциональныеОпции");
	КонецЕсли;
	Если ПолучатьДанныеРеквизитов Тогда
		ЧастиТекстаЗапроса.Добавить(",
		|	ДанныеРеквизитовТиповыхОпераций.Обязательный КАК Обязательный,
		|	ДанныеРеквизитовТиповыхОпераций.СвязиПараметровВыбора КАК СвязиПараметровВыбора,
		|	ДанныеРеквизитовТиповыхОпераций.СвязиПоТипу КАК СвязиПоТипу,
		|	ДанныеРеквизитовТиповыхОпераций.ВидЭлемента КАК ВидЭлемента,
		|	ДанныеРеквизитовТиповыхОпераций.ГруппировкаЭлементов КАК ГруппировкаЭлементов,
		|	ДанныеРеквизитовТиповыхОпераций.Отображение КАК Отображение,
		|	ДанныеРеквизитовТиповыхОпераций.ОтображатьЗаголовок КАК ОтображатьЗаголовок,
		|	ДанныеРеквизитовТиповыхОпераций.ШиринаПодчиненныхЭлементов КАК ШиринаПодчиненныхЭлементов,
		|	ДанныеРеквизитовТиповыхОпераций.РастягиватьПоГоризонтали КАК РастягиватьПоГоризонтали,
		|	ДанныеРеквизитовТиповыхОпераций.ПоложениеЗаголовка КАК ПоложениеЗаголовка,
		|	ДанныеРеквизитовТиповыхОпераций.ЗапретитьИзменение КАК ЗапретитьИзменение,
		|	ДанныеРеквизитовТиповыхОпераций.НевидимыйЭлемент КАК НевидимыйЭлемент,
		|	ДанныеРеквизитовТиповыхОпераций.УпакованныеНастройки КАК УпакованныеНастройки");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций");
	Если ПолучатьДанныеРеквизитов Тогда
		ЧастиТекстаЗапроса.Добавить("
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеРеквизитовТиповыхОпераций КАК ДанныеРеквизитовТиповыхОпераций
		|		ПО РеквизитыТиповыхОпераций.Ссылка = ДанныеРеквизитовТиповыхОпераций.РеквизитТиповойОперации");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И РеквизитыТиповыхОпераций.СостояниеПоддержки <> ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)");
	Если НЕ ВключатьГруппы Тогда
		ЧастиТекстаЗапроса.Добавить("
		|	И РеквизитыТиповыхОпераций.ЭтоГруппа = Ложь");
	КонецЕсли;
	Если Не ВключатьУдаленные Тогда
		ЧастиТекстаЗапроса.Добавить("
		|	И РеквизитыТиповыхОпераций.ПометкаУдаления = Ложь");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка,
	|	РеквизитыТиповыхОпераций.Владелец КАК Владелец,
	|	РеквизитыТиповыхОпераций.Код,
	|	РеквизитыТиповыхОпераций.Наименование,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки,
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы,
	|	РеквизитыТиповыхОпераций.ОтборЭлементов,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки.ТипЗначения,
	|	РеквизитыТиповыхОпераций.Родитель,
	|	РеквизитыТиповыхОпераций.ЭтоГруппа,
	|	РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации,
	|	РеквизитыТиповыхОпераций.СостояниеПоддержки,
	|	РеквизитыТиповыхОпераций.ЗначениеПоУмолчанию");
	Если ВключатьФО Тогда
		ЧастиТекстаЗапроса.Добавить(",
		|	ПоставляемыеРеквизитыТиповыхОпераций.ФункциональныеОпции.(
		|		ИмяФункциональнойОпции КАК ИмяФункциональнойОпции
		|	) КАК ФункциональныеОпции");
	КонецЕсли;
	Если ПолучатьДанныеРеквизитов Тогда
		ЧастиТекстаЗапроса.Добавить(",
		|	ПоставляемыеРеквизитыТиповыхОпераций.Обязательный,
		|	ПоставляемыеРеквизитыТиповыхОпераций.СвязиПараметровВыбора,
		|	ПоставляемыеРеквизитыТиповыхОпераций.СвязиПоТипу,
		|	ПоставляемыеРеквизитыТиповыхОпераций.ВидЭлемента,
		|	ПоставляемыеРеквизитыТиповыхОпераций.ГруппировкаЭлементов,
		|	ПоставляемыеРеквизитыТиповыхОпераций.Отображение,
		|	ПоставляемыеРеквизитыТиповыхОпераций.ОтображатьЗаголовок,
		|	ПоставляемыеРеквизитыТиповыхОпераций.ШиринаПодчиненныхЭлементов,
		|	ПоставляемыеРеквизитыТиповыхОпераций.РастягиватьПоГоризонтали,
		|	ПоставляемыеРеквизитыТиповыхОпераций.ПоложениеЗаголовка,
		|	ПоставляемыеРеквизитыТиповыхОпераций.ЗапретитьИзменение,
		|	ПоставляемыеРеквизитыТиповыхОпераций.НевидимыйЭлемент,
		|	ПоставляемыеРеквизитыТиповыхОпераций.УпакованныеНастройки");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций");
	Если ПолучатьДанныеРеквизитов Тогда
		ЧастиТекстаЗапроса.Добавить("
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПоставляемыеРеквизитыТиповыхОпераций КАК ПоставляемыеРеквизитыТиповыхОпераций
		|		ПО РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации = ПоставляемыеРеквизитыТиповыхОпераций.Ссылка");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И РеквизитыТиповыхОпераций.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)");
	Если НЕ ВключатьГруппы Тогда
		ЧастиТекстаЗапроса.Добавить("
		|	И РеквизитыТиповыхОпераций.ЭтоГруппа = Ложь");
	КонецЕсли;
	Если Не ВключатьУдаленные Тогда
		ЧастиТекстаЗапроса.Добавить("
		|	И РеквизитыТиповыхОпераций.ПометкаУдаления = Ложь");
	КонецЕсли;
	Если Не ПустаяСтрока(ВыраженияИтогов) Тогда
		ЧастиТекстаЗапроса.Добавить("
		|ИТОГИ ПО
		|	");
		ЧастиТекстаЗапроса.Добавить(ВыраженияИтогов);
	КонецЕсли;
	
	Возврат СтрСоединить(ЧастиТекстаЗапроса);

КонецФункции

Функция ТекстЗапросаДанныеТиповойОперации(ПолучитьУсловиеИспользования = Ложь) Экспорт

	ЧастиТекстаЗапроса = Новый Массив;
	
	ЧастиТекстаЗапроса.Добавить("
	|ВЫБРАТЬ
	|	ТиповыеОперации.Ссылка КАК Ссылка,
	|	ТиповыеОперации.Наименование КАК Наименование,
	|	ТиповыеОперации.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	ТиповыеОперации.НеИспользуется КАК НеИспользуется,
	|	ТиповыеОперации.ПоставляемаяТиповаяОперация КАК ПоставляемаяТиповаяОперация,
	|	ТиповыеОперации.СостояниеПоддержки КАК СостояниеПоддержки,
	|	ТиповыеОперации.УстанавливатьБлокировку КАК УстанавливатьБлокировку,
	|	ЕСТЬNULL(ДанныеТиповыхОпераций.ФормулаДата, """") КАК ФормулаДата,
	|	ЕСТЬNULL(ДанныеТиповыхОпераций.ФормулаОрганизация, """") КАК ФормулаОрганизация,
	|	ЕСТЬNULL(ДанныеТиповыхОпераций.Условие, """") КАК Условие,
	|	ЕСТЬNULL(ДанныеТиповыхОпераций.ИспользуетсяВнешняяПроцедура, ЛОЖЬ) КАК ИспользуетсяВнешняяПроцедура,
	|	ЕСТЬNULL(ДанныеТиповыхОпераций.ИмяВнешнейПроцедуры, """") КАК ИмяВнешнейПроцедуры,
	|	ЕСТЬNULL(ДанныеТиповыхОпераций.ТекстСообщенияПриОшибке, """") КАК ТекстСообщенияПриОшибке,
	|	ЕСТЬNULL(ДанныеТиповыхОпераций.ОбработчикПослеФормирования, """") КАК ОбработчикПослеФормирования");
	Если ПолучитьУсловиеИспользования Тогда
		ЧастиТекстаЗапроса.Добавить(",
		|	УсловияИспользованияТиповыхОпераций.УсловиеИспользования КАК УсловиеИспользования");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ИЗ
	|	Справочник.ТиповыеОперации КАК ТиповыеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеТиповыхОпераций КАК ДанныеТиповыхОпераций
	|		ПО ТиповыеОперации.Ссылка = ДанныеТиповыхОпераций.ТиповаяОперация");
	Если ПолучитьУсловиеИспользования Тогда
		ЧастиТекстаЗапроса.Добавить("
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияИспользованияТиповыхОпераций КАК УсловияИспользованияТиповыхОпераций
		|		ПО ТиповыеОперации.Ссылка = УсловияИспользованияТиповыхОпераций.ТиповаяОперация");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ГДЕ
	|	ТиповыеОперации.Ссылка = &ТиповаяОперация
	|	И ТиповыеОперации.СостояниеПоддержки <> ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТиповыеОперации.Ссылка КАК Ссылка,
	|	ТиповыеОперации.Наименование,
	|	ТиповыеОперации.ИдентификаторДокумента,
	|	ТиповыеОперации.НеИспользуется,
	|	ТиповыеОперации.ПоставляемаяТиповаяОперация,
	|	ТиповыеОперации.СостояниеПоддержки,
	|	ТиповыеОперации.УстанавливатьБлокировку,
	|	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.ФормулаДата, """"),
	|	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.ФормулаОрганизация, """"),
	|	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.Условие, """"),
	|	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.ИспользуетсяВнешняяПроцедура, ЛОЖЬ),
	|	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.ИмяВнешнейПроцедуры, """"),
	|	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.ТекстСообщенияПриОшибке, """"),
	|	ЕСТЬNULL(ДанныеПоставляемыхТиповыхОпераций.ОбработчикПослеФормирования, """")");
	Если ПолучитьУсловиеИспользования Тогда
		ЧастиТекстаЗапроса.Добавить(",
		|	УсловияИспользованияТиповыхОпераций.УсловиеИспользования КАК УсловиеИспользования");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ИЗ
	|	Справочник.ТиповыеОперации КАК ТиповыеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоставляемыхТиповыхОпераций КАК ДанныеПоставляемыхТиповыхОпераций
	|		ПО ТиповыеОперации.ПоставляемаяТиповаяОперация = ДанныеПоставляемыхТиповыхОпераций.ТиповаяОперация");
	Если ПолучитьУсловиеИспользования Тогда
		ЧастиТекстаЗапроса.Добавить("
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияИспользованияТиповыхОпераций КАК УсловияИспользованияТиповыхОпераций
		|		ПО ТиповыеОперации.Ссылка = УсловияИспользованияТиповыхОпераций.ТиповаяОперация");
	КонецЕсли;
	ЧастиТекстаЗапроса.Добавить("
	|ГДЕ
	|	ТиповыеОперации.Ссылка = &ТиповаяОперация
	|	И ТиповыеОперации.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)");
	
	Возврат СтрСоединить(ЧастиТекстаЗапроса);

КонецФункции

Функция ТекстЗапросаДополнительныеИсточникиДанныхОперации(ВключатьУдаленные = Ложь, ВыраженияИтогов = "") Экспорт

	ЧастиТекстаЗапроса = Новый Массив;
	ЧастиТекстаЗапроса.Добавить("
	|ВЫБРАТЬ
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяИсточника КАК ИмяИсточника,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.ИмяКолонки КАК ИмяКолонки,
	|	ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ресурс КАК Ресурс
	|ИЗ
	|	Справочник.ДополнительныеИсточникиДанныхДляТиповыхОпераций.КолонкиИсточника КАК ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДополнительныеИсточникиДанныхДляТиповыхОпераций КАК ДополнительныеИсточникиДанныхДляТиповыхОпераций
	|		ПО ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка = ДополнительныеИсточникиДанныхДляТиповыхОпераций.Ссылка
	|ГДЕ
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.Владелец = &ТиповаяОперация");
	Если НЕ ВключатьУдаленные Тогда
		ЧастиТекстаЗапроса.Добавить("
		|	И ДополнительныеИсточникиДанныхДляТиповыхОпераций.ПометкаУдаления = ЛОЖЬ");
	КонецЕсли;
	Если Не ПустаяСтрока(ВыраженияИтогов) Тогда
		ЧастиТекстаЗапроса.Добавить("
		|ИТОГИ ПО
		|	");
		ЧастиТекстаЗапроса.Добавить(ВыраженияИтогов);
	КонецЕсли;
	
	Возврат СтрСоединить(ЧастиТекстаЗапроса);

КонецФункции

Функция ПолучитьДанныеТиповойОперации(ТиповаяОперация, БезГруппРеквизитов = Истина) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроводкиТиповойОперации(Истина)
		+ ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаРеквизитыТиповойОперации(Истина,, Не БезГруппРеквизитов)
		+ ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаДанныеТиповойОперации()
		+ ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаДополнительныеИсточникиДанныхОперации(Ложь, "ИмяИсточника");
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДанныеТиповойОперации = Новый Структура("ТиповаяОперация",      ТиповаяОперация);
	ДанныеТиповойОперации.Вставить("Проводки",                      Результат[0].Выгрузить());
	ДанныеТиповойОперации.Вставить("ДополнительныеРеквизиты",       Результат[1].Выгрузить());
	Если НЕ Результат[2].Пустой() Тогда
		ДанныеТиповойОперации.Вставить("ДанныеОперации",                Результат[2].Выгрузить()[0]);
	Иначе
		ДанныеТиповойОперации.Вставить("ДанныеОперации",                Результат[2].Выгрузить().Добавить());
	КонецЕсли;
	ДанныеТиповойОперации.Вставить("ДополнительныеИсточникиДанных", Результат[3].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	
	Возврат ДанныеТиповойОперации;
КонецФункции

// Возвращает данные реквизитов типовой операции. Работает для любого состояния поддержки операции и реквизита
//
// Параметры:
//  ТиповаяОперация	 - СправочникСсылка.ТиповыеОперации - 
//  НаПоддержке		 - Булево - не используется. Оставлен для совместимости.
// 
// Возвращаемое значение:
// ТаблицаЗначений - 
//
Функция ПолучитьДанныеРеквизитовТиповойОперации(ТиповаяОперация, Знач НаПоддержке = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаРеквизитыТиповойОперации(Истина, Истина, Истина);
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьДанныеРеквизитовТиповойОперации()

Функция НеобходмоВыполнитьОсобуюПроцедуруВосстановленияПоддержки(ТиповаяОперация) Экспорт
	
	Возврат Ложь;
	
КонецФункции // НеобходмоВыполнитьОсобуюПроцедуруВосстановленияПоддержки()

Процедура ВыполнитьОсобуюПроцедуруВосстановленияПоддержки(ТиповаяОперация, СкопироватьИсходнуюОперацию) Экспорт
	
	
	
КонецПроцедуры

// запись записей периодических регистров сведений, подчиненных ведущему объекту 
// см. ПрочитатьЗаписьДляРедактированияВФорме
// отличается от аналогичных в других модулях тем, что сохраняет данные регистра типа "ХранилищеЗначений".
Процедура ЗаписатьЗаписьПослеРедактированияВФорме(Форма, ИмяРегистра, ВедущийОбъект, ДанныеМодифицированы = Ложь) Экспорт 
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	ИмяИзмерения = МетаданныеРегистра.Измерения[0].Имя;

	ИменаРеквизитовХранилищеЗначения = "";
	ТипХЗ = Тип("ХранилищеЗначения");
	Если МетаданныеРегистра.ПериодичностьРегистраСведений
		<> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
		ИзменилисьДанные = Форма[ИмяРегистра].Период <> Форма[ИмяРегистра + "Прежняя"].Период;
	Иначе
		ИзменилисьДанные = Ложь;
	КонецЕсли;
	Если НЕ ИзменилисьДанные Тогда
		ИзменилисьДанные = ИзменилисьДанные ИЛИ 
		(ВедущийОбъект <> Форма[ИмяРегистра + "Прежняя"][ИмяИзмерения] И 
		ЗначениеЗаполнено(Форма[ИмяРегистра + "Прежняя"][ИмяИзмерения]));
	КонецЕсли;
	Для Каждого Поле Из МетаданныеРегистра.Ресурсы Цикл
		Если ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(Поле.Тип, ТипХЗ) Тогда
			ИменаРеквизитовХранилищеЗначения = ИменаРеквизитовХранилищеЗначения + "," + Поле.Имя;
		Иначе
			ИзменилисьДанные = ИзменилисьДанные ИЛИ (Форма[ИмяРегистра][Поле.Имя]
			<> Форма[ИмяРегистра + "Прежняя"][Поле.Имя]);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Поле Из МетаданныеРегистра.Реквизиты Цикл
		Если ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(Поле.Тип, ТипХЗ) Тогда
			ИменаРеквизитовХранилищеЗначения = ИменаРеквизитовХранилищеЗначения + "," + Поле.Имя;
		Иначе
			ИзменилисьДанные = ИзменилисьДанные ИЛИ (Форма[ИмяРегистра][Поле.Имя]
			<> Форма[ИмяРегистра + "Прежняя"][Поле.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Если ИзменилисьДанные Тогда
	
		ЗаписьПрежняя = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
		ЗаписьПрежняя[ИмяИзмерения] = ВедущийОбъект;
		ЗаписьПрежняя.Прочитать();
		
		// пишем новое состояние записи
		МенеджерЗаписи = Форма.РеквизитФормыВЗначение(ИмяРегистра);
		МенеджерЗаписи[ИмяИзмерения] = ВедущийОбъект;
		// если нужно сохранить старую запись, то создадим новые менеджер записи
		Если Форма[ИмяРегистра + "НоваяЗапись"] Тогда
			НоваяЗапись = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,  МенеджерЗаписи);
			Если Не ПустаяСтрока(ИменаРеквизитовХранилищеЗначения) Тогда
				ЗаполнитьЗначенияСвойств(НоваяЗапись,  ЗаписьПрежняя, Сред(ИменаРеквизитовХранилищеЗначения, 2));
			КонецЕсли;
			НоваяЗапись.Записать();
		Иначе
			Если Не ПустаяСтрока(ИменаРеквизитовХранилищеЗначения) Тогда
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи,  ЗаписьПрежняя, Сред(ИменаРеквизитовХранилищеЗначения, 2));
			КонецЕсли;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеМодифицированы = ИзменилисьДанные;
КонецПроцедуры

// Возвращает новое имя для типовой операции вида "Копия " + ["(" номер копии ")"] + <Наименование исходной операции>.
// Примечание: делается максимум 1000 попыток нахождения уникального наименования.
//
// Параметры:
//  ИдентификаторДокумента	 - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Идентификатор документа.
//  Наименование			 - Строка - наименование исходной типовой операции.
//  Префикс					 - Строка - префикс наименования.
// Возвращаемое значение:
// Строка - уникальное наименование для новой типовой операции
Функция ПолучитьНаименованиеНовойТиповойОперации(ИдентификаторДокумента, Наименование, Префикс)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТиповыеОперации.Наименование
	|ИЗ
	|	Справочник.ТиповыеОперации КАК ТиповыеОперации
	|ГДЕ
	|	ТиповыеОперации.ИдентификаторДокумента = &ИдентификаторДокумента";
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	Выборка = Запрос.Выполнить().Выбрать();
	ИменаОперацийВРег = Новый Массив;
	Пока Выборка.Следующий() Цикл
	
		ИменаОперацийВРег.Добавить(ВРег(Выборка.Наименование));
	
	КонецЦикла;
	
	Для Итератор = 1 По 1000 Цикл
	
		ИмяОперации = "" + Префикс
			+ ?(Итератор = 1, "", " (" + Итератор +")")
			+ " " + Наименование;
		Если ИменаОперацийВРег.Найти(ВРег(ИмяОперации)) = Неопределено Тогда
		
			Прервать;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ИмяОперации;

КонецФункции // ПолучитьНаименованиеНовойТиповойОперации()

Процедура УстановитьЗначение(Приемник, Источник)

	Если Приемник <> Источник Тогда
		Приемник = Источник;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьБлокировкуТиповойОперации(ТиповаяОперация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", ТиповаяОперация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ТиповыеОперации");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ТиповаяОперация);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ПроводкиТиповыхОпераций");
	ЭлементБлокировки.УстановитьЗначение("Владелец", ТиповаяОперация);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки = Блокировка.Добавить("Справочник.РеквизитыТиповыхОпераций");
	ЭлементБлокировки.УстановитьЗначение("Владелец", ТиповаяОперация);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ДополнительныеИсточникиДанныхДляТиповыхОпераций");
	ЭлементБлокировки.УстановитьЗначение("Владелец", ТиповаяОперация);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДанныеРеквизитовТиповыхОпераций");
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("РеквизитТиповойОперации", "Ссылка");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДанныеТиповыхОпераций");
	ЭлементБлокировки.УстановитьЗначение("ТиповаяОперация", ТиповаяОперация);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИменаРеквизитовДокументовДляВыбораОпераций");
	ЭлементБлокировки.УстановитьЗначение("ТиповаяОперация", ТиповаяОперация);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УсловияИспользованияТиповыхОпераций");
	ЭлементБлокировки.УстановитьЗначение("ТиповаяОперация", ТиповаяОперация);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ВерсииТиповыхОпераций");
	ЭлементБлокировки.УстановитьЗначение("ТиповаяОперация", ТиповаяОперация);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Блокировка.Заблокировать();

КонецПроцедуры

Процедура УстановитьБлокировкуИдентификатораПоддержки(Знач ИдентификаторПоддержки)

	Если ТипЗнч(ИдентификаторПоддержки) = Тип("Строка") Тогда
		
		Попытка
		
			ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержки);
		
		Исключение
			
			ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииОбновлениеТО(),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.ТиповыеОперации,,
				СтрШаблон(НСтр("ru = 'Ошибка получения идентификатора поддержки из строки ""%1"".
				|%2'"), ИдентификаторПоддержки, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ТиповыеОперации");
	ЭлементБлокировки.УстановитьЗначение("ИдентификаторПоддержки", ИдентификаторПоддержки);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Блокировка.Заблокировать();

КонецПроцедуры

Процедура ОтвязатьТиповуюОперациюОтПоставляемойТиповойОперации(ТиповаяОперация)

	Объект = ТиповаяОперация.ПолучитьОбъект();
	Объект.ПоставляемаяТиповаяОперация = Справочники.ПоставляемыеТиповыеОперации.ПустаяСсылка();
	Объект.СостояниеПоддержки = Перечисления.СостоянияПоддержкиТиповыхОпераций.ПустаяСсылка();
	Если ЗначениеЗаполнено(Объект.ИмяПредопределенныхДанных) Тогда
		Объект.ИмяПредопределенныхДанных = "";
	КонецЕсли;
	
	Объект.ДополнительныеСвойства.Вставить("НеФормироватьСхему");
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект, Истина);
	
	// Отвязать ТиповуюОперацию от ПоставлямойТиповойОперации
	ТаблицаРеквизитов = ДополнительныеРеквизитыТиповойОперации(ТиповаяОперация, Ложь, "Ссылка");
	Для каждого РеквизитОперации Из ТаблицаРеквизитов Цикл
	
		Объект = РеквизитОперации.Ссылка.ПолучитьОбъект();
		Объект.ПоставляемыйРеквизитТиповойОперации = Справочники.ПоставляемыеРеквизитыТиповыхОпераций.ПустаяСсылка();
		Объект.СостояниеПоддержки = Перечисления.СостоянияПоддержкиТиповыхОпераций.ПустаяСсылка();
		Объект.ДополнительныеСвойства.Вставить("НеПроверять");
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект, Истина);
	
	КонецЦикла;
	
	Для каждого Проводка Из ПроводкиТиповойОперации(ТиповаяОперация) Цикл
	
		Объект = Проводка.Ссылка.ПолучитьОбъект();
		Объект.ПоставляемаяПроводка = Справочники.ПоставляемыеПроводкиТиповыхОпераций.ПустаяСсылка();
		Объект.СостояниеПоддержки = Перечисления.СостоянияПоддержкиТиповыхОпераций.ПустаяСсылка();
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект, Истина);
	
	КонецЦикла;

КонецПроцедуры

Функция ТиповыеОперацииНаПоддержкеТребующиеОбновления(ТолькоИзменившиеся = Истина)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версии52", БухгалтерскиеОперацииПовтИспНаВремяСеанса.ВерсииМакетовТиповыхОпераций52());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Версии52.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	Версии52.ДатаВерсии КАК ДатаВерсии
	|ПОМЕСТИТЬ Версии52
	|ИЗ
	|	&Версии52 КАК Версии52
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВерсииПоставляемыхТиповыхОпераций.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	ВерсииПоставляемыхТиповыхОпераций.ПоставляемаяТиповаяОперация КАК ПоставляемаяТиповаяОперация,
	|	ВерсииПоставляемыхТиповыхОпераций.ДатаВерсии КАК ДатаВерсии
	|ПОМЕСТИТЬ ВерсииПТО
	|ИЗ
	|	Справочник.ПоставляемыеТиповыеОперации КАК ПоставляемыеТиповыеОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииПоставляемыхТиповыхОпераций КАК ВерсииПоставляемыхТиповыхОпераций
	|		ПО ПоставляемыеТиповыеОперации.Ссылка = ВерсииПоставляемыхТиповыхОпераций.ПоставляемаяТиповаяОперация
	|			И ПоставляемыеТиповыеОперации.ИдентификаторДокумента = ВерсииПоставляемыхТиповыхОпераций.ИдентификаторДокумента
	|ГДЕ
	|	НЕ ПоставляемыеТиповыеОперации.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоставляемыеТиповыеОперации.ИдентификаторДокумента,
	|	ПоставляемыеТиповыеОперации.Ссылка,
	|	Версии52.ДатаВерсии
	|ИЗ
	|	Справочник.ПоставляемыеТиповыеОперации КАК ПоставляемыеТиповыеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииПоставляемыхТиповыхОпераций КАК ВерсииПоставляемыхТиповыхОпераций
	|		ПО ПоставляемыеТиповыеОперации.Ссылка = ВерсииПоставляемыхТиповыхОпераций.ПоставляемаяТиповаяОперация
	|			И ПоставляемыеТиповыеОперации.ИдентификаторДокумента = ВерсииПоставляемыхТиповыхОпераций.ИдентификаторДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Версии52 КАК Версии52
	|		ПО ПоставляемыеТиповыеОперации.ИдентификаторДокумента = Версии52.ИдентификаторДокумента
	|ГДЕ
	|	ВерсииПоставляемыхТиповыхОпераций.ПоставляемаяТиповаяОперация ЕСТЬ NULL
	|	И НЕ ПоставляемыеТиповыеОперации.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВерсииТиповыхОпераций.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	ВерсииТиповыхОпераций.ТиповаяОперация КАК ТиповаяОперация,
	|	ВерсииТиповыхОпераций.ДатаВерсии КАК ДатаВерсии,
	|	ТиповыеОперации.ПоставляемаяТиповаяОперация КАК ПоставляемаяТиповаяОперация,
	|	ТиповыеОперации.СостояниеПоддержки КАК СостояниеПоддержки
	|ПОМЕСТИТЬ ВерсииТО
	|ИЗ
	|	Справочник.ТиповыеОперации КАК ТиповыеОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииТиповыхОпераций КАК ВерсииТиповыхОпераций
	|		ПО ТиповыеОперации.Ссылка = ВерсииТиповыхОпераций.ТиповаяОперация
	|			И ТиповыеОперации.ИдентификаторДокумента = ВерсииТиповыхОпераций.ИдентификаторДокумента
	|ГДЕ
	|	ТиповыеОперации.ПоставляемаяТиповаяОперация <> ЗНАЧЕНИЕ(Справочник.ПоставляемыеТиповыеОперации.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТиповыеОперации.ИдентификаторДокумента,
	|	ТиповыеОперации.Ссылка,
	|	Версии52.ДатаВерсии,
	|	ТиповыеОперации.ПоставляемаяТиповаяОперация,
	|	ТиповыеОперации.СостояниеПоддержки
	|ИЗ
	|	Справочник.ТиповыеОперации КАК ТиповыеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииТиповыхОпераций КАК ВерсииТиповыхОпераций
	|		ПО ТиповыеОперации.Ссылка = ВерсииТиповыхОпераций.ТиповаяОперация
	|			И ТиповыеОперации.ИдентификаторДокумента = ВерсииТиповыхОпераций.ИдентификаторДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Версии52 КАК Версии52
	|		ПО ТиповыеОперации.ИдентификаторДокумента = Версии52.ИдентификаторДокумента
	|ГДЕ
	|	ВерсииТиповыхОпераций.ТиповаяОперация ЕСТЬ NULL
	|	И ТиповыеОперации.ПоставляемаяТиповаяОперация <> ЗНАЧЕНИЕ(Справочник.ПоставляемыеТиповыеОперации.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВерсииПТО.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	ВерсииПТО.ПоставляемаяТиповаяОперация КАК ПоставляемаяТиповаяОперация,
	|	ВерсииПТО.ПоставляемаяТиповаяОперация.Наименование КАК Наименование,
	|	ВерсииПТО.ПоставляемаяТиповаяОперация.ИмяПредопределеннойОперации КАК ИмяПредопределеннойОперации,
	|	ВерсииПТО.ПоставляемаяТиповаяОперация.ИдентификаторПоддержки КАК ИдентификаторПоддержки,
	|	ВерсииПТО.ПоставляемаяТиповаяОперация.Поставщик КАК Поставщик,
	|	ВерсииПТО.ИдентификаторДокумента.Имя КАК Документ,
	|	ВерсииПТО.ДатаВерсии КАК ДатаВерсииПТО,
	|	ВерсииТО.ДатаВерсии КАК ДатаВерсииТО
	|ИЗ
	|	ВерсииПТО КАК ВерсииПТО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВерсииТО КАК ВерсииТО
	|		ПО ВерсииПТО.ПоставляемаяТиповаяОперация = ВерсииТО.ПоставляемаяТиповаяОперация
	|ГДЕ
	|	ВерсииТО.ПоставляемаяТиповаяОперация ЕСТЬ NULL
	|	ИЛИ &УсловиеДата
	|		И ВерсииТО.СостояниеПоддержки В (ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.РедактируетсяССохранениемПоддержки))";
	Если ТолькоИзменившиеся Тогда
		УсловиеДата = "ВерсииТО.ДатаВерсии < ВерсииПТО.ДатаВерсии";
	Иначе
		УсловиеДата = "ИСТИНА";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДата", УсловиеДата);
	ТаблицаОпераций = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаОпераций;

КонецФункции

Процедура ВыполнитьОбновлениеТиповыхОпераций(ТаблицаОпераций, СообщатьПрогресс = Ложь)

	Обработка = Обработки.ИмпортЭкспортТиповыхОперацийВФормате20.Создать();
	Обработка.УстановитьРежимЗагрузкиПользовательскихОпераций(Истина);
	Обработка.УстановитьРежимОбновленияОпераций(Истина);
	
	ИменаПредопределенных = Новый Соответствие;
	Для каждого ИмяПредопределенного Из Метаданные.Справочники.ТиповыеОперации.ПолучитьИменаПредопределенных() Цикл
	
		ИменаПредопределенных.Вставить(ВРЕГ(ИмяПредопределенного), ИмяПредопределенного);
	
	КонецЦикла;
	
	КоличествоОпераций = ТаблицаОпераций.Количество();
	НомерОперации = 0;
	
	Для каждого Операция Из ТаблицаОпераций Цикл
		
		Если ЗначениеЗаполнено(Операция.ИдентификаторПоддержки) Тогда
			Версия = "2.0.1.2";
		Иначе
			Версия = "2.0.1.1";
		КонецЕсли;
		
		ДанныеТиповойОперации = Обработка.СтруктураДанныхТиповойОперации(Версия);
		ЗаполнитьЗначенияСвойств(ДанныеТиповойОперации, Операция);
		ДанныеТиповойОперации.Ссылка = Строка(Операция.ПоставляемаяТиповаяОперация.УникальныйИдентификатор());
		ИмяПредопределенного = ИменаПредопределенных.Получить(Операция.ИмяПредопределеннойОперации);
		Если ИмяПредопределенного <> Неопределено Тогда
			
			ДанныеТиповойОперации.ИмяПредопределенного = ИмяПредопределенного;
			ДанныеТиповойОперации.Предопределенный     = Истина;
			
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			УстановитьБлокировкуИдентификатораПоддержки(ДанныеТиповойОперации.ИдентификаторПоддержки);
			
			ТиповаяОперация = Обработка.ПолучитьТиповуюОперацию(ДанныеТиповойОперации);
		
			Обработка.ОбновитьТиповуюОперацию(ТиповаяОперация);
			
			РегистрыСведений.ВерсииТиповыхОпераций.ЗаписатьВерсиюТиповойОперацииВРегистр(ТиповаяОперация, Операция.ДатаВерсииПТО);
		
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииОбновлениеТО(),
				УровеньЖурналаРегистрации.Ошибка,
				?(ТиповаяОперация <> Неопределено, ТиповаяОперация.Метаданные(), Неопределено),
				?(ТиповаяОперация <> Неопределено, ТиповаяОперация.Ссылка, Неопределено),
				СтрШаблон(НСтр("ru = 'Ошибка при обновлении типовой операции по причине:
					|%1'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		
		КонецПопытки;
		
		НомерОперации = НомерОперации + 1;
		Если СообщатьПрогресс Тогда
			ДлительныеОперации.СообщитьПрогресс(Цел(НомерОперации / КоличествоОпераций * 100));
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗагрузитьЭлементыВФоне", Истина);
	Методы.Вставить("ОбновлениеТиповыхОпераций");
	Методы.Вставить("УдалитьПоддержкуНеактуальныхПоставляемыхТиповыхОпераций");
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

// Обновляет типовые операции на поддержке по поставляемым типовым операциям.
//
// Параметры:
//  ПараметрОбработчика	 - Структура - Параметр обработчика обновления, назначенного на все версии (*).
//
Процедура ОбновлениеТиповыхОпераций(ПараметрОбработчика = Неопределено) Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбновлениеИнформационнойБазы.ВерсияИБ(Метаданные.Имя) = "0.0.0.0"
		И ПараметрОбработчика <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОпераций = ТиповыеОперацииНаПоддержкеТребующиеОбновления();
	
	Если ТаблицаОпераций.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// в режиме запуска, как обработчика обновления (*) выполняем только в монопольном режиме
	Если ПараметрОбработчика <> Неопределено И ПараметрОбработчика.МонопольныйРежим = Ложь Тогда
		// установим признак необходимости монопольного режима
		ПараметрОбработчика.МонопольныйРежим = Истина;
		Возврат;
	КонецЕсли;
	
	// Обновить типы реквизитов типовых операций
	ПланыВидовХарактеристик.ДополнительныеРеквизитыОпераций.ИнициализироватьПредопределенныеЭлементыПВХ();
	
	ТекстСообщения = НСтр("ru = 'Обновляются типовые операции на поддержке:
		|%СписокОпераций%.'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СписокОпераций%",
		СтрСоединить(ТаблицаОпераций.ВыгрузитьКолонку("ПоставляемаяТиповаяОперация"), "," + Символы.ПС));
	ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииОбновлениеТО(),
		УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ТиповыеОперации,,ТекстСообщения);
		
	ВыполнитьОбновлениеТиповыхОпераций(ТаблицаОпераций);
	
	Если ОбщегоНазначения.РазделениеВключено()
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		БухгалтерскиеОперацииСервер.ОстановитьФоновоеОбновлениеТиповыхОперацийВОбластиДанных(
			РаботаВМоделиСервиса.ЗначениеРазделителяСеанса());
			
	КонецЕсли;
	
КонецПроцедуры

// Очищает реквизит "ПоставляемаяТиповаяОперация", если реквизит "ИмяПоставляемойОперации" выбранной поставляемой
// типовой операции содержит не правильное имя предопределенного элемента справочника "Типовые операции".
// Перед очисткой реквизита типовая операция принудительно снимается с поддержки и получает текущую настройку из
// поставляемой типовой операции. Если типовая операция уже снята с поддержки, то обновление настройки не производится.
Процедура УдалитьПоддержкуНеактуальныхПоставляемыхТиповыхОпераций(ПараметрОбработчика = Неопределено) Экспорт

	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТиповыеОперации.Ссылка КАК ТиповаяОперация,
	|	ТиповыеОперации.ПоставляемаяТиповаяОперация КАК ПоставляемаяТиповаяОперация,
	|	ТиповыеОперации.СостояниеПоддержки КАК СостояниеПоддержки,
	|	ПРЕДСТАВЛЕНИЕ(ТиповыеОперации.ИдентификаторДокумента) КАК ИдентификаторДокументаПредставление,
	|	ТиповыеОперации.Наименование КАК Наименование,
	|	ТиповыеОперации.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.ТиповыеОперации КАК ТиповыеОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоставляемыеТиповыеОперации КАК ПоставляемыеТиповыеОперации
	|		ПО ТиповыеОперации.ПоставляемаяТиповаяОперация = ПоставляемыеТиповыеОперации.Ссылка
	|ГДЕ
	|	ПоставляемыеТиповыеОперации.ПометкаУдаления = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// в режиме запуска, как обработчика обновления (*) выполняем только в монопольном режиме
	Если ТипЗнч(ПараметрОбработчика) = Тип("Структура") И ПараметрОбработчика.МонопольныйРежим = Ложь Тогда
		// установим признак необходимости монопольного режима
		ПараметрОбработчика.МонопольныйРежим = Истина;
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекстЗаписи = НСтр("ru = 'Типовая операция удалена из поставки:
				|Идентификатор документа: %Документ%,
				|Наименование: %Наименование%,
				|Имя предопределенного (было): %ИмяПредопределенногоБыло%.'");
		ТекстЗаписи = СтрЗаменить(ТекстЗаписи, "%Документ%",                  Выборка.ИдентификаторДокументаПредставление);
		ТекстЗаписи = СтрЗаменить(ТекстЗаписи, "%Наименование%",              Выборка.Наименование);
		ТекстЗаписи = СтрЗаменить(ТекстЗаписи, "%ИмяПредопределенногоБыло%",  Выборка.ИмяПредопределенныхДанных);
			
		ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииУдалениеИзПоставки(),
			УровеньЖурналаРегистрации.Информация, Выборка.ТиповаяОперация.Метаданные(), Выборка.ТиповаяОперация, ТекстЗаписи);
			
		НачатьТранзакцию();
		
		Попытка
		
			// Перенести настройки типовой операции из ПоставляемойТиповойОперации в ТиповуюОперацию.
			// Если операция была снята с поддержки, то настройки уже перенесены.
			Если Не Выборка.СостояниеПоддержки = Перечисления.СостоянияПоддержкиТиповыхОпераций.РедактируетсяБезСохраненияПоддержки Тогда
				Обработки.УправлениеПоддержкойТиповыхОпераций.УстановитьСостояниеПоддержкиТО(Выборка.ТиповаяОперация,
					Перечисления.СостоянияПоддержкиТиповыхОпераций.РедактируетсяБезСохраненияПоддержки);
			КонецЕсли;
			
			ОтвязатьТиповуюОперациюОтПоставляемойТиповойОперации(Выборка.ТиповаяОперация);
			
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось отключить поддержку типовой операции ""%1"" по причине:
				|%2'"), Выборка.ТиповаяОперация, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииУдалениеИзПоставки(),
				УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ТиповыеОперации, Выборка.ТиповаяОперация,
				ТекстСообщения);
				
			ВызватьИсключение;
		
		КонецПопытки;
	
	КонецЦикла;

КонецПроцедуры

// Добавляет обработчик обновления типовых операций. Обработчик добавляется для версии из метаданных,
// чтобы сдвинуть обработчик максимально в конец очереди обработчиков обновления.
//
Процедура ЗарегистрироватьОбработчикОбновленияТиповыхОпераций(Обработчики) Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() // В модели сервиса обработчик всегда ставится максимально далеко в конец очереди.
		ИЛИ ОбновлениеИнформационнойБазы.ВерсияИБ(Метаданные.Имя) < Метаданные.Версия Тогда
		// Выполняется обновление при изменении версии конфигурации.
		// Обновление типовых операций ставим максимально дальше в конец очереди,
		// чтобы сначала отработали другие обработчики, например, обновление плана счетов.
		
		Версия = Метаданные.Версия;
		
	Иначе
		// Выполняется обновление без изменения версии конфигурации.
		// Например, при запуске с параметром "ЗапуститьОбновлениеИнформационнойБазы".
		// Добавляем обработчик на все версии, чтобы обновились типовые операции.
		
		Версия = "*";
		
	КонецЕсли;

	Обработчик           = Обработчики.Добавить();
	Обработчик.Версия    = Версия;
	Обработчик.Процедура = "Справочники.ТиповыеОперации.ОбновлениеТиповыхОпераций";

КонецПроцедуры

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Для проверки можно использовать функции "Справочники.ТиповыеОперации.СостояниеПоддержкиОперации"
// и "Справочники.ТиповыеОперации.ТиповаяОперацияНеРедактируется".
// Проверяет находится ли типовая операция на поддержке. В параметр "РеквизитыОперации" помещается структура с ключами
// "СнятьСПоддержки" и "ПоставляемаяТиповаяОперация".
//
// Параметры:
//  ТиповаяОперация		 - СправочникСсылка.ТиповыеОперации - типовая операция.
//  РеквизитыОперации	 - Неопределено - ,
//						- Структура - после выполнения содержит структуру с ключами "СнятьСПоддержки" и
//						"ПоставляемаяТиповаяОперация".
// Возвращаемое значение:
// Булево - Истина, если типовая операция создана из поставляемой и не снята с поддержки.
Функция ТиповаяОперацияНаПоддержке(ТиповаяОперация, РеквизитыОперации = Неопределено) Экспорт
	Перем ПоставляемаяТиповаяОперация;
	
	СостояниеПоддержки = СостояниеПоддержкиОперации(ТиповаяОперация, ПоставляемаяТиповаяОперация);
	
	РеквизитыОперации = Новый Структура("СнятьСПоддержки, ПоставляемаяТиповаяОперация");
	РеквизитыОперации.СнятьСПоддержки = СостояниеПоддержки <> Перечисления.СостоянияПоддержкиТиповыхОпераций.НеРедактируется;
	РеквизитыОперации.ПоставляемаяТиповаяОперация = ПоставляемаяТиповаяОперация;
	
	Возврат СостояниеПоддержкиТиповойОперации(РеквизитыОперации.ПоставляемаяТиповаяОперация,
		РеквизитыОперации.СнятьСПоддержки);

КонецФункции // ТиповаяОперацияНаПоддержке()

// Устарела.
Функция СостояниеПоддержкиТиповойОперации(ПоставляемаяТиповаяОперация, ФлагСнятьСПоддержки) Экспорт

	Возврат ЗначениеЗаполнено(ПоставляемаяТиповаяОперация) И НЕ ФлагСнятьСПоддержки;

КонецФункции

// Устарела. Следует использовать "Обработки.УправлениеПоддержкойТиповыхОпераций.УстановитьСостояниеПоддержкиТО"
// Заполняет данные типовой операции по данным поставляемой типовой операции.
//
// Параметры:
//  ТиповаяОперация	 - СправочникСсылка.ТиповыеОперации - Типовая операция.
//
Процедура ЗаполнитьДанныеПоПоставляемойТиповойОперации(ТиповаяОперация) Экспорт
	
	ПоставляемаяТиповаяОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ТиповаяОперация, "ПоставляемаяТиповаяОперация");
	Если НЕ ЗначениеЗаполнено(ПоставляемаяТиповаяОперация) Тогда
		ВызватьИсключение НСтр("ru = 'Типовая операция не находится на поддержке'");
	КонецЕсли;
	
	// удаление сохраненных проводок
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ПроводкиТиповыхОпераций.Ссылка
//	|ИЗ
//	|	Справочник.ПроводкиТиповыхОпераций КАК ПроводкиТиповыхОпераций
//	|ГДЕ
//	|	ПроводкиТиповыхОпераций.Владелец = &ТиповаяОперация";
//	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
//	РезультатЗапроса = Запрос.Выполнить();
//	Если Не РезультатЗапроса.Пустой() Тогда
//		ПроводкиОперации = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
//		УстановитьПривилегированныйРежим(Истина);
//		УдалитьОбъекты(ПроводкиОперации);
//		УстановитьПривилегированныйРежим(Ложь);
//	КонецЕсли;
	
	ДанныеПоставляемойТиповойОперации = Справочники.ПоставляемыеТиповыеОперации.ПолучитьДанныеТиповойОперации(ПоставляемаяТиповаяОперация);
	
	ДанныеТиповойОперации = РегистрыСведений.ДанныеТиповыхОпераций.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ДанныеТиповойОперации, ДанныеПоставляемойТиповойОперации.ДанныеОперации);
	ДанныеТиповойОперации.ТиповаяОперация = ТиповаяОперация;
	ДанныеТиповойОперации.Записать(Истина);
	
	Для каждого ПоставляемаяПроводка Из ДанныеПоставляемойТиповойОперации.Проводки Цикл
	
		Если ЗначениеЗаполнено(ПоставляемаяПроводка.ПроводкаОбластиДанных) Тогда
			Проводка = ПоставляемаяПроводка.ПроводкаОбластиДанных.ПолучитьОбъект();
		Иначе
			Проводка = Справочники.ПроводкиТиповыхОпераций.СоздатьЭлемент();
			Проводка.Владелец = ТиповаяОперация;
			Проводка.ПоставляемаяПроводка = ПоставляемаяПроводка.Ссылка;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Проводка, ПоставляемаяПроводка,,"Ссылка");
		Если ПараметрыСеанса.ВыполняетсяОбновлениеИБ Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Проводка, Истина);
		Иначе
			Проводка.Записать();
		КонецЕсли;
		
		ДанныеПроводки = РегистрыСведений.ДанныеПроводокТиповыхОпераций.СоздатьНаборЗаписей();
		ДанныеПроводки.Отбор.Проводка.Установить(Проводка.Ссылка);
		ЗаписьНабора = ДанныеПроводки.Добавить();
		ЗаписьНабора.Проводка = Проводка.Ссылка;
		ЗаписьНабора.УдалитьИсточникДанных = ПоставляемаяПроводка.ИмяТабличнойЧастиДокумента;
		Если ПараметрыСеанса.ВыполняетсяОбновлениеИБ Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(ДанныеПроводки, Истина, Истина);
		Иначе
			ДанныеПроводки.Записать(Истина);
		КонецЕсли;
	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка КАК Ссылка,
	|	РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации КАК ПоставляемыйРеквизитТиповойОперации,
	|	РеквизитыТиповыхОпераций.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДанныеПоставляемогоРеквизита = ДанныеПоставляемойТиповойОперации.ДополнительныеРеквизиты.Найти(
			Выборка.ПоставляемыйРеквизитТиповойОперации, "Ссылка");
		Если ДанныеПоставляемогоРеквизита <> Неопределено Тогда
			
			ДанныеРеквизита = РегистрыСведений.ДанныеРеквизитовТиповыхОпераций.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(ДанныеРеквизита, ДанныеПоставляемогоРеквизита);
			УпакованныеНастройки = ДанныеПоставляемогоРеквизита.УпакованныеНастройки.Получить();
			Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
				ДанныеРеквизита.УпакованныеНастройки = Новый ХранилищеЗначения(УпакованныеНастройки);
			КонецЕсли;
			ДанныеРеквизита.РеквизитТиповойОперации = Выборка.Ссылка;
			ДанныеРеквизита.Записать(Истина);
			
			Если НЕ Выборка.ЭтоГруппа Тогда
				РеквизитОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ФОПоставляемогоРеквизита = ДанныеПоставляемогоРеквизита.ФункциональныеОпции.ВыгрузитьКолонку("ИмяФункциональнойОпции");
				ФОТекущегоРеквизита = РеквизитОбъект.ФункциональныеОпции.ВыгрузитьКолонку("ИмяФункциональнойОпции");
				
				ФОИзменились = ФОПоставляемогоРеквизита.Количество() <> ФОТекущегоРеквизита.Количество();
				Если НЕ ФОИзменились Тогда
					
					Для каждого ПоставляемаяФО Из ФОПоставляемогоРеквизита Цикл
					
						Если ФОТекущегоРеквизита.Найти(ПоставляемаяФО) = Неопределено Тогда
							ФОИзменились = Истина;
							Прервать;
						КонецЕсли;
					
					КонецЦикла;
					
				КонецЕсли;
				
				Если ФОИзменились Тогда
					
					РеквизитОбъект.ФункциональныеОпции.Очистить();
					Для каждого ПоставляемаяФО Из ФОПоставляемогоРеквизита Цикл
						РеквизитОбъект.ФункциональныеОпции.Добавить().ИмяФункциональнойОпции = ПоставляемаяФО;
					КонецЦикла;
					Если ПараметрыСеанса.ВыполняетсяОбновлениеИБ Тогда
						ОбновлениеИнформационнойБазы.ЗаписатьОбъект(РеквизитОбъект, Истина);
					Иначе
						РеквизитОбъект.Записать();
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;
	
	СхемыФормирования = СформироватьСхемыДляТиповойОперации(ТиповаяОперация);
	ДанныеТиповойОперации.СхемаФормированияПроводок =
		Новый ХранилищеЗначения(СхемыФормирования.СхемаФормированияПроводок, Новый СжатиеДанных(9));
	ДанныеТиповойОперации.СхемаПроверкиУсловия =
		Новый ХранилищеЗначения(СхемыФормирования.СхемаПроверкиУсловия, Новый СжатиеДанных(9));

	ДанныеТиповойОперации.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
