#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьДоговораСервер(Объект, Параметр) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацияОбязательствИСведенийПоДоговорам.Ссылка КАК Ссылка,
	|	РегистрацияОбязательствИСведенийПоДоговорам.Договор КАК Договор
	|ПОМЕСТИТЬ ДокументыПеререгистрации
	|ИЗ
	|	Документ.РегистрацияОбязательствИСведенийПоДоговорам КАК РегистрацияОбязательствИСведенийПоДоговорам
	|ГДЕ
	|	РегистрацияОбязательствИСведенийПоДоговорам.Дата >= &Дата
	|	И (РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательства)
	|			ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ЗаявкаНаПеререгистрациюОбязательстваУчетПредмета)
	|			ИЛИ РегистрацияОбязательствИСведенийПоДоговорам.ВидОбязательства = ЗНАЧЕНИЕ(Перечисление.ВидыПринятыхОбязательств.ПринимаемоеОбязательствоПеререгистрация))
	|	И РегистрацияОбязательствИСведенийПоДоговорам.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПФОСрезПоследних.Обязательство КАК Договор
	|ИЗ
	|	РегистрСведений.ПланФинансированияОбязательств.СрезПоследних(&Период, Обязательство.Организация = &Организация) КАК ПФОСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыПеререгистрации КАК ДокументыПеререгистрации
	|		ПО ПФОСрезПоследних.Обязательство = ДокументыПеререгистрации.Договор
	|ГДЕ
	|	ДокументыПеререгистрации.Ссылка ЕСТЬ NULL
	|	И ПФОСрезПоследних.Сумма <> 0
	|	И ПФОСрезПоследних.КлючАналитики.ПериодПлана.ДатаНачала >= &Период";  
	
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Период", НачалоГода(Объект.ДатаФормированияДокументов) - 1);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Дата", Объект.ДатаФормированияДокументов);
	
	Результат = Запрос.Выполнить();
	
	ПоместитьВоВременноеХранилище(Результат.Выгрузить(), Параметр);
	
КонецПроцедуры 

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьДоговораСервер", Истина);
КонецПроцедуры

#КонецОбласти

#КонецЕсли