
////////////////////////////////////////////////////////////////////////////////
// УправлениеПечатьюБГУ
// Содержит процедуры и функции формирующие печатные формы документов
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ИнтерфейсИнтеграцииСБСП

// Добавляет команды печати бухгалтерских справок
//
Процедура ДобавитьКомандыПечатиБухгалтерскойСправки(КомандыПечати, ИмяФормы = "") Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ) Тогда
		
		ПроверкаПроведенияПередПечатью = Не ЗначениеЗаполнено(ИмяФормы)
			Или Не ФормаПринадлежитОбъекту(ИмяФормы, "ОперацияБух");
		
		// Бухгалтерская справка (развернутая)
		КомандаПечати									= КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати					= "Обработка.ПечатьБухгалтерскойСправки";
		КомандаПечати.Идентификатор						= "Справка0504833";
		КомандаПечати.Представление						= НСтр("ru = 'Справка ф. 0504833 (развернутая)'");
		КомандаПечати.Порядок							= 97;
		КомандаПечати.ПроверкаПроведенияПередПечатью	= ПроверкаПроведенияПередПечатью;
		КомандаПечати.ТипыОбъектовПечати				= ОбщегоНазначенияБГУПовтИсп.СписокДокументовСДвижениямиПоРБ();
		ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати, Ложь);
		
		// Бухгалтерская справка (52н)
		КомандаПечати									= КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати					= "Обработка.ПечатьБухгалтерскойСправки";
		КомандаПечати.Идентификатор						= "Справка0504833_52";
		КомандаПечати.Представление						= НСтр("ru = 'Справка ф. 0504833'");
		КомандаПечати.Порядок							= 98;
		КомандаПечати.ПроверкаПроведенияПередПечатью	= ПроверкаПроведенияПередПечатью;
		КомандаПечати.ТипыОбъектовПечати				= ОбщегоНазначенияБГУПовтИсп.СписокДокументовСДвижениямиПоРБ();
		ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати, Ложь);
		
		// Бухгалтерская справка
		КомандаПечати									= КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати					= "Обработка.ПечатьБухгалтерскойСправки";
		КомандаПечати.Идентификатор						= "Справка0504833_173";
		КомандаПечати.Представление						= НСтр("ru = '(устарел) Справка ф. 0504833 (173н)'");
		КомандаПечати.Порядок							= 200;
		КомандаПечати.ПроверкаПроведенияПередПечатью	= ПроверкаПроведенияПередПечатью;
		КомандаПечати.ТипыОбъектовПечати				= ОбщегоНазначенияБГУПовтИсп.СписокДокументовСДвижениямиПоРБ();
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет команды печати движений документа
//
Процедура ДобавитьКомандыПечатиДвиженийДокумента(КомандыПечати, ИмяФормы = "") Экспорт
	
	ПроверкаПроведенияПередПечатью = Не ЗначениеЗаполнено(ИмяФормы)
		Или Не ФормаПринадлежитОбъекту(ИмяФормы, "ОперацияБух");
	
	// Движения документа
	КомандаПечати									= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати					= "Отчет.ДвиженияДокумента";
	КомандаПечати.Идентификатор						= "ДвиженияДокумента";
	КомандаПечати.Представление						= НСтр("ru = 'Движения документа'");
	КомандаПечати.Порядок							= 99;
	КомандаПечати.ПроверкаПроведенияПередПечатью	= ПроверкаПроведенияПередПечатью;
	КомандаПечати.Обработчик						= "УправлениеПечатьюБГУКлиент.ДвиженияДокумента";
	КомандаПечати.ТипыОбъектовПечати				= ОбщегоНазначенияБГУПовтИсп.СписокДокументовСДвижениямиПоРНРС();
	
КонецПроцедуры

// Переопределяет список команд печати, получаемый функцией
//
Процедура ПередДобавлениемКомандПечати(ИмяФормы, КомандыПечати, СтандартнаяОбработка) Экспорт
	
	// Устаревший отчет, следует использовать отчет БСП
	//ДобавитьКомандыПечатиДвиженийДокумента(КомандыПечати, ИмяФормы);
	
	СоставИмениФормы = СтрРазделить(ИмяФормы, ".");
	
	Если СоставИмениФормы[0] = "ЖурналДокументов" И СоставИмениФормы[1] = "ЖурналОпераций" Тогда
		
		// В целях повышения производительности для Журнала операций оставляем печать только 
		// бухгалтерской справки
		СтандартнаяОбработка = Ложь;
		
		ДобавитьКомандыПечатиБухгалтерскойСправки(КомандыПечати, ИмяФормы);
		
	КонецЕсли;
	
КонецПроцедуры

//Определяет объекты, в которых есть процедура ДобавитьКомандыПечати()
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	ИсключаемыеТипыДокументов = Метаданные.ОпределяемыеТипы.ОбъектыБезПроцедурПечатиВМенеджере.Тип;
	
	Для каждого Документ Из Метаданные.Документы Цикл
		
		Если ИсключаемыеТипыДокументов.СодержитТип(Тип("ДокументСсылка." + Документ.Имя)) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокОбъектов.Добавить(Документы[Документ.Имя]);
		
	КонецЦикла;
	
	СписокОбъектов.Добавить(Справочники.ДоверенностиНалогоплательщика);
	СписокОбъектов.Добавить(Справочники.Договоры);
	СписокОбъектов.Добавить(Справочники.Контрагенты);
	СписокОбъектов.Добавить(Справочники.Организации);
	СписокОбъектов.Добавить(Справочники.ОсновныеСредства);
	СписокОбъектов.Добавить(Справочники.ПечатныеФормыВидовКартСведенийОбИмуществе);
	СписокОбъектов.Добавить(Справочники.Сотрудники);
	СписокОбъектов.Добавить(Справочники.Студенты);
	СписокОбъектов.Добавить(Справочники.ФизическиеЛица);
	СписокОбъектов.Добавить(Справочники.КарточкиКапвложений);
	
	// Интеграция ВЕТИС
	СписокОбъектов.Добавить(Справочники.ВетеринарноСопроводительныйДокументВЕТИС);
	СписокОбъектов.Добавить(Документы.ВходящаяТранспортнаяОперацияВЕТИС);
	СписокОбъектов.Добавить(Документы.ИнвентаризацияПродукцииВЕТИС);
	СписокОбъектов.Добавить(Документы.ИсходящаяТранспортнаяОперацияВЕТИС);
	СписокОбъектов.Добавить(Документы.ЗапросСкладскогоЖурналаВЕТИС);
	СписокОбъектов.Добавить(Документы.ПроизводственнаяОперацияВЕТИС);  
	
	// ИнтеграцияИСМП
	СписокОбъектов.Добавить(Документы.МаркировкаТоваровИСМП);
	СписокОбъектов.Добавить(Документы.ВыводИзОборотаИСМП);
	СписокОбъектов.Добавить(Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ);
	СписокОбъектов.Добавить(Документы.ПеремаркировкаТоваровИСМП);
	СписокОбъектов.Добавить(Документы.СписаниеКодовМаркировкиИСМП);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после завершения вызова процедуры Печать менеджера печати объекта
//
Процедура ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
		МодульПроцессыОбработкиДокументов.ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	
	ВнутреннийЭДО.ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры

// Переопределяет параметры отправки печатных форм при подготовке письма.
// Может использоваться, например, для подготовки текста письма.
//
// Параметры:
//  ПараметрыОтправки - Структура - коллекция параметров:
//   * Получатель - Массив - коллекция имен получателей;
//   * Тема - Строка - тема письма;
//   * Текст - Строка - текст письма;
//   * Вложения - Структура - коллекция вложений:
//    ** АдресВоВременномХранилище - Строка - адрес вложения во временном хранилище;
//    ** Представление - Строка - имя файла вложения.
//  ОбъектыПечати - Массив - коллекция объектов, по которым сформированы печатные формы.
//  ПараметрыВывода - Структура - параметр ПараметрыВывода в вызове процедуры Печать.
//  ПечатныеФормы - ТаблицаЗначений - коллекция табличных документов:
//   * Название - Строка - название печатной формы;
//   * ТабличныйДокумент - ТабличныйДокумент - печатая форма.
//
Процедура ПередОтправкойПоПочте(ПараметрыОтправки, ПараметрыВывода, ОбъектыПечати, ПечатныеФормы) Экспорт
	
	Если ОбъектыПечати.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбъектыПечати.Количество() > 0 Тогда 
		
		ОбщегоНазначенияБГУ.ЗаполнитьАдресаПередОтправкойПоПочте(ПараметрыОтправки.Получатель, ОбъектыПечати[0]);
		
		ПараметрыОтправки.Тема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектыПечати[0], "Представление");
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет набор подписей и печатей для документов.
//
// Параметры:
//  Документы      - Массив    - коллекция ссылок на объекты печати;
//  ПодписиИПечати - Соответствие - коллекция объектов печати и комплектов подписей/печатей к ним:
//   * Ключ     - ЛюбаяСсылка - ссылка на объект печати;
//   * Значение - Структура   - комплект подписей и печатей:
//     ** Ключ     - Строка - идентификатор подписи или печати в макете печатной формы, 
//                            должен начинаться с "Подпись...", "Печать..." или "Факсимиле...",
//                            например, "ПодписьРуководителя", "ПечатьОрганизации";
//     ** Значение - Картинка - изображение подписи или печати.
//
Процедура ПриПолученииПодписейИПечатей(Документы, ПодписиИПечати) Экспорт
	
	ДокументыПоТипам = Новый Соответствие;
	Для Каждого Документ Из Документы Цикл
		ТипДокумента = ТипЗнч(Документ);
		Если ДокументыПоТипам[ТипДокумента] = Неопределено Тогда
			ДокументыПоТипам[ТипДокумента] = Новый Массив;
		КонецЕсли;
		ДокументыПоТипам[ТипДокумента].Добавить(Документ);
	КонецЦикла;
	
	Печати 			= Новый Соответствие;
	Руководители  	= Новый Соответствие;
	ГлБухгалтеры	= Новый Соответствие;
	
	Для Каждого ДокументыПоТипу Из ДокументыПоТипам Цикл
		ТипДокумента = ДокументыПоТипу.Ключ;
		СписокДокументов = ДокументыПоТипу.Значение;
		
		ИмяРеквизитаГлавныйБухгалтер = "";
		ИмяРеквизитаРуководитель = "";
		СтрокаРеквизиты = "";
		
		РеквизитыДокумента = Метаданные.НайтиПоТипу(ТипДокумента).Реквизиты;
		
		Если РеквизитыДокумента.Найти("Организация") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРеквизиты = "Организация";
		
		Если НЕ РеквизитыДокумента.Найти("Руководитель") = Неопределено Тогда
			ИмяРеквизитаРуководитель = "Руководитель";
			СтрокаРеквизиты = СтрокаРеквизиты + ", " + ИмяРеквизитаРуководитель;
		КонецЕсли;
		
		Если НЕ РеквизитыДокумента.Найти("ГлавныйБухгалтер") = Неопределено Тогда
			ИмяРеквизитаГлавныйБухгалтер = "ГлавныйБухгалтер";
			СтрокаРеквизиты = СтрокаРеквизиты + ", " + ИмяРеквизитаГлавныйБухгалтер;
		ИначеЕсли НЕ РеквизитыДокумента.Найти("ГлБухгалтер") = Неопределено Тогда
			ИмяРеквизитаГлавныйБухгалтер = "ГлБухгалтер";
			СтрокаРеквизиты = СтрокаРеквизиты + ", " + ИмяРеквизитаГлавныйБухгалтер;
		КонецЕсли;
		
		ПодписиИПечатиВДокументах = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокДокументов, СтрокаРеквизиты);
		
		Для Каждого ПодписиИПечатьВДокументе Из ПодписиИПечатиВДокументах Цикл
			
			Документ = ПодписиИПечатьВДокументе.Ключ;
			
			Организация 	= ПодписиИПечатьВДокументе.Значение.Организация;
			Если ЗначениеЗаполнено(ИмяРеквизитаРуководитель) Тогда
				Руководитель 	= ПодписиИПечатьВДокументе.Значение[ИмяРеквизитаРуководитель]; 
			КонецЕсли;	
			Если ЗначениеЗаполнено(ИмяРеквизитаГлавныйБухгалтер) Тогда	
				ГлБухгалтер 	= ПодписиИПечатьВДокументе.Значение[ИмяРеквизитаГлавныйБухгалтер];
			КонецЕсли;	
			
			ПодписиДокумента = Новый Структура;
			
			Печать = Печати[Организация];
			Если Печать = Неопределено Тогда
				Печать = ПечатьОрганизации(Организация);
				Печати.Вставить(Организация, Печать);
			КонецЕсли;
			ПодписиДокумента.Вставить("ПечатьОрганизации", Печать); 
			
			Если ЗначениеЗаполнено(ИмяРеквизитаРуководитель) Тогда
				ПодписьРук = Руководители[Руководитель];
				Если ПодписьРук = Неопределено Тогда
					ПодписьРук = ПодписьСотрудника(Руководитель);
					Руководители.Вставить(Руководитель, ПодписьРук);
				КонецЕсли;
				ПодписиДокумента.Вставить("ПодписьРуководителя", ПодписьРук); 
				ПодписиДокумента.Вставить("ФаксимилеРуководитель", ПодписьРук); //для счета-фактуры
			Иначе
				ПодписиДокумента.Вставить("ПодписьРуководителя", Новый Картинка); 
				ПодписиДокумента.Вставить("ФаксимилеРуководитель", Новый Картинка); //для счета-фактуры
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ИмяРеквизитаГлавныйБухгалтер) Тогда
				ПодписьБух = ГлБухгалтеры[ГлБухгалтер];
				Если ПодписьБух = Неопределено Тогда
					ПодписьБух = ПодписьСотрудника(ГлБухгалтер);
					ГлБухгалтеры.Вставить(ГлБухгалтер, ПодписьБух);
				КонецЕсли;
				ПодписиДокумента.Вставить("ПодписьГлавногоБухгалтера", ПодписьБух);
				ПодписиДокумента.Вставить("ФаксимилеГлавныйБухгалтер", ПодписьБух);
			Иначе
				ПодписиДокумента.Вставить("ПодписьГлавногоБухгалтера", Новый Картинка); 
				ПодписиДокумента.Вставить("ФаксимилеГлавныйБухгалтер", Новый Картинка);
			КонецЕсли;
			
			ПодписиДокумента.Вставить("ФаксимилеПредприниматель", Новый Картинка); //для счета-фактуры
			
			ПодписиИПечати.Вставить(Документ, ПодписиДокумента);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// см. УправлениеПечатьюПереопределяемый.ПечатьДокументовПриСозданииНаСервере
Процедура ПечатьДокументовПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ВнутреннийЭДО.ПечатьДокументовПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
	РегистрыУчета.ПечатьДокументовПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СведенияОбУчреждении

// Заполняет параметры для макета заголовка печатных форм документов сведениями об учреждении, подразделении, учредителе и т.п.
//
// Параметры:
//	ЗначенияПараметров	- Структура	- в эту структуру будут добавлены новые значения
//	ДокументСсылка		- Ссылка на печатаемый документ
//	СведенияУчреждений	- Соответствие	- результат функции УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати()
Процедура ЗаполнитьПараметрыСведенийУчреждения(ЗначенияПараметров, Знач ДокументСсылка, Знач СведенияУчреждений) Экспорт
	
	Сведения = СведенияУчреждений.Получить(ДокументСсылка);
	
	ЗначенияПараметров.Вставить("УчреждениеНаименование",					Сведения.НаименованиеОрганизации);
	ЗначенияПараметров.Вставить("УчреждениеКодПоРПБС",						Сведения.КодРПБС);
	ЗначенияПараметров.Вставить("ОбособленноеПодразделениеНаименование",	Сведения.НаименованиеОбособленногоПодразделения);
	ЗначенияПараметров.Вставить("ОбособленноеПодразделениеКодПоРПБС",		Сведения.КодРПБСОбособленногоПодразделения);
	ЗначенияПараметров.Вставить("СтруктурноеПодразделениеНаименование",		Сведения.СтруктурноеПодразделение);
	ЗначенияПараметров.Вставить("ГлаваНаименование",						Сведения.Учредитель);
	ЗначенияПараметров.Вставить("ГлаваКод",									Сведения.ГлаваБК);
	ЗначенияПараметров.Вставить("БюджетНаименование",						Сведения.БюджетНаименование);
	ЗначенияПараметров.Вставить("КодОКТМО",									Сведения.ОКТМО);
	
КонецПроцедуры

// Получает данные для заполнения шапки документов приказа 61н.
// Также получаются данные сотрудника из реквизита ОтветственныйИсполнитель, если он есть в документе.
// Структурное подразделение заполняется из данных сотрудника - ОтветственногоИсполнителя.
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - ДокументСсылка
//  * Значение - см. НовыйОбщиеСведенияДокументовДляПечати
Функция ОбщиеСведенияДокументовДляПечати(МассивОбъектов) Экспорт
	
	ДокументыПоТипам = ОбщегоНазначенияБГУ.ДокументыПоТипам(МассивОбъектов);
	
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДокумент.Ссылка,
	|	ТаблицаДокумент.Дата,
	|	ТаблицаДокумент.Организация,
	|	ТаблицаДокумент.ИФО,
	|	ТаблицаДокумент.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель,
	|	Сотрудники.Контрагент КАК ОтветственныйИсполнительКонтрагент
	|ИЗ
	|	#Документ КАК ТаблицаДокумент
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|	ПО ТаблицаДокумент.ОтветственныйИсполнитель = Сотрудники.Ссылка
	|ГДЕ
	|	ТаблицаДокумент.Ссылка В (&МассивОбъектов)";
	ЧастиЗапроса = Новый Массив;
	Запрос = Новый Запрос;
	Индекс = 1;  
	ЕстУчетИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	Для Каждого КлючЗначение Из ДокументыПоТипам Цикл
		МетаданныеДокумента = Метаданные.НайтиПоТипу(КлючЗначение.Ключ);
		ИмяДокумента = МетаданныеДокумента.ПолноеИмя();
		Часть = СтрЗаменить(ШаблонТекстаЗапроса, "#Документ", ИмяДокумента);
		Часть = СтрЗаменить(Часть, "&МассивОбъектов", "&МассивОбъектов" + Индекс);
		ИмяРеквизитаОтветственногоИсполнителя = ИмяРеквизитаОтветственногоИсполнителя(КлючЗначение.Ключ);
		Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяРеквизитаОтветственногоИсполнителя, МетаданныеДокумента) Тогда
			Часть = СтрЗаменить(Часть, "ТаблицаДокумент.ОтветственныйИсполнитель", "NULL");
		Иначе
			Часть = СтрЗаменить(Часть, "ТаблицаДокумент.ОтветственныйИсполнитель", "ТаблицаДокумент."+ИмяРеквизитаОтветственногоИсполнителя);
		КонецЕсли; 
		Если НЕ ЕстУчетИФО ИЛИ НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("ИФО", МетаданныеДокумента) Тогда
			Часть = СтрЗаменить(Часть, "ТаблицаДокумент.ИФО", "NULL КАК ИФО");
		КонецЕсли;
		Запрос.УстановитьПараметр("МассивОбъектов" + Индекс, КлючЗначение.Значение);
		ЧастиЗапроса.Добавить(Часть);
		Индекс = Индекс + 1;
	КонецЦикла;
	
	ТекстЗапроса = СтрСоединить(ЧастиЗапроса, ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("ВСЕ"));
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПервыйЗапрос = СхемаЗапроса.ПакетЗапросов[0];
	ПервыйЗапрос.ВыбиратьРазрешенные = Истина;
	ПервыйЗапрос.ТаблицаДляПомещения = "ВтОрганизацииДокументов";
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ВтОрганизацииДокументов.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ДанныеСотрудников.Период) КАК Период,
	|	ВтОрганизацииДокументов.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель
	|ПОМЕСТИТЬ ИзмененияДанныхСотрудников
	|ИЗ
	|	ВтОрганизацииДокументов КАК ВтОрганизацииДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО ВтОрганизацииДокументов.ОтветственныйИсполнитель = ДанныеСотрудников.Сотрудник
	|			И ВтОрганизацииДокументов.Дата >= ДанныеСотрудников.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОрганизацииДокументов.Ссылка,
	|	ВтОрганизацииДокументов.ОтветственныйИсполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзмененияДанныхСотрудников.Ссылка КАК Ссылка,
	|	ДанныеСотрудников.Подразделение КАК Подразделение,
	|	ДанныеСотрудников.Должность КАК Должность
	|ПОМЕСТИТЬ ДанныеОтветственных
	|ИЗ
	|	ИзмененияДанныхСотрудников КАК ИзмененияДанныхСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО ИзмененияДанныхСотрудников.Период = ДанныеСотрудников.Период
	|			И ИзмененияДанныхСотрудников.ОтветственныйИсполнитель = ДанныеСотрудников.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтОрганизацииДокументов.ОтветственныйИсполнительКонтрагент КАК ОтветственныйИсполнительКонтрагент,
	|	ВЫРАЗИТЬ(Контрагенты.ЮридическоеФизическоеЛицо КАК Справочник.ФизическиеЛица) КАК ФизическоеЛицо,
	|	ВтОрганизацииДокументов.Ссылка КАК Ссылка,
	|	ВтОрганизацииДокументов.Дата КАК Дата
	|ПОМЕСТИТЬ ФизЛицаОтветственныхЛиц
	|ИЗ
	|	ВтОрганизацииДокументов КАК ВтОрганизацииДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВтОрганизацииДокументов.ОтветственныйИсполнительКонтрагент = Контрагенты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ФИОФизическихЛиц.Период) КАК Период,
	|	ФИОФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ФизЛицаОтветственныхЛиц.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДатыИзмененияФИО
	|ИЗ
	|	ФизЛицаОтветственныхЛиц КАК ФизЛицаОтветственныхЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|		ПО ФизЛицаОтветственныхЛиц.ФизическоеЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|			И ФизЛицаОтветственныхЛиц.Дата >= ФИОФизическихЛиц.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ФизЛицаОтветственныхЛиц.Ссылка,
	|	ФИОФизическихЛиц.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыИзмененияФИО.Ссылка КАК Ссылка,
	|	ФИОФизическихЛиц.Фамилия КАК Фамилия,
	|	ФИОФизическихЛиц.Имя КАК Имя,
	|	ФИОФизическихЛиц.Отчество КАК Отчество
	|ПОМЕСТИТЬ ФИООтветственных
	|ИЗ
	|	ДатыИзмененияФИО КАК ДатыИзмененияФИО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|		ПО ДатыИзмененияФИО.ФизическоеЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|			И ДатыИзмененияФИО.Период = ФИОФизическихЛиц.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВтОрганизацииДокументов.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ВтОрганизацииДокументов.ОтветственныйИсполнитель, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК ОтветственныйИсполнитель,
	|	ЕСТЬNULL(Контрагенты.ЮридическоеФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ОтветственныйИсполнительФизЛицо,
	|	ЕСТЬNULL(ДанныеОтветственных.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК ПодразделениеОтветственного,
	|	ВЫБОР
	|		КОГДА ДанныеОтветственных.Подразделение ЕСТЬ NULL
	|			ТОГДА """"
	|		КОГДА ДанныеОтветственных.Подразделение.НаименованиеПолное = """"
	|			ТОГДА ДанныеОтветственных.Подразделение.Наименование
	|		ИНАЧЕ ДанныеОтветственных.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеСтруктурногоПодразделения,
	|	ЕСТЬNULL(ДанныеОтветственных.Должность.Наименование, """") КАК ДолжностьОтветственногоКратко,
	|	ВЫБОР
	|		КОГДА ДанныеОтветственных.Должность ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ДанныеОтветственных.Должность.НаименованиеПолное
	|	КОНЕЦ КАК ДолжностьОтветственного,
	|	Организации.Ссылка КАК ОрганизацияИсточник,
	|	ВЫБОР
	|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Организации.Ссылка
	|		ИНАЧЕ Организации.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Организации.НаименованиеПолное <> """"
	|						ТОГДА Организации.НаименованиеПолное
	|					ИНАЧЕ Организации.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Организации.ГоловнаяОрганизация.НаименованиеПолное <> """"
	|					ТОГДА Организации.ГоловнаяОрганизация.НаименованиеПолное
	|				ИНАЧЕ Организации.ГоловнаяОрганизация.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ВЫБОР
	|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА Организации.ИНН
	|		ИНАЧЕ Организации.ГоловнаяОрганизация.ИНН
	|	КОНЕЦ КАК ИНН,
	|	ВЫБОР
	|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА Организации.КПП
	|		ИНАЧЕ Организации.ГоловнаяОрганизация.КПП
	|	КОНЕЦ КАК КПП,
	|	ВЫБОР
	|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА Организации.КодПоРПБС
	|		ИНАЧЕ Организации.ГоловнаяОрганизация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБС,
	|	ВЫБОР
	|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|		ИНАЧЕ Организации.Ссылка
	|	КОНЕЦ КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Организации.НаименованиеПолное <> """"
	|					ТОГДА Организации.НаименованиеПолное
	|				ИНАЧЕ Организации.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК НаименованиеОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ Организации.КодПоРПБС
	|	КОНЕЦ КАК КодРПБСОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА НЕ ИстФО.Ссылка ЕСТЬ NULL
	|				И ИстФО.ИспользоватьРеквизитыИФО
	|			ТОГДА ЕСТЬNULL(ИстФО.КодГлавыБК.Код, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.КодПоППП.Код, """")
	|	КОНЕЦ КАК ГлаваБК,
	|	ВЫБОР
	|		КОГДА НЕ ИстФО.Ссылка ЕСТЬ NULL
	|				И ИстФО.ИспользоватьРеквизитыИФО
	|			ТОГДА ЕСТЬNULL(ИстФО.КодГлавыБК.НаименованиеПолное, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.КодПоППП.НаименованиеПолное, """")
	|	КОНЕЦ КАК Учредитель,
	|	ВЫБОР
	|		КОГДА НЕ ИстФО.Ссылка ЕСТЬ NULL
	|				И ИстФО.ИспользоватьРеквизитыИФО
	|			ТОГДА ЕСТЬNULL(ИстФО.Бюджет.НаименованиеПолное, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.Бюджет.НаименованиеПолное, """")
	|	КОНЕЦ КАК БюджетНаименование,
	|	ВЫБОР
	|		КОГДА НЕ ИстФО.Ссылка ЕСТЬ NULL
	|				И ИстФО.ИспользоватьРеквизитыИФО
	|			ТОГДА ЕСТЬNULL(ИстФО.Бюджет.Код, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.Бюджет.Код, """")
	|	КОНЕЦ КАК ОКТМО,
	|	ВЫБОР
	|		КОГДА НЕ ИстФО.Ссылка ЕСТЬ NULL
	|				И ИстФО.ИспользоватьРеквизитыИФО
	|			ТОГДА ЕСТЬNULL(ИстФО.Бюджет.НаименованиеПубличноПравовогоОбразования, """")
	|		ИНАЧЕ ЕСТЬNULL(Организации.Бюджет.НаименованиеПубличноПравовогоОбразования, """")
	|	КОНЕЦ КАК УчредительППО,
	|	ФИООтветственных.Фамилия КАК Фамилия,
	|	ФИООтветственных.Имя КАК Имя,
	|	ФИООтветственных.Отчество КАК Отчество
	|ИЗ
	|	ВтОрганизацииДокументов КАК ВтОрганизацииДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОтветственных КАК ДанныеОтветственных
	|		ПО ВтОрганизацииДокументов.Ссылка = ДанныеОтветственных.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВтОрганизацииДокументов.Организация = Организации.Ссылка 
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИсточникиФинансовогоОбеспечения КАК ИстФО
	|		ПО ВтОрганизацииДокументов.ИФО = ИстФО.Ссылка 
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВтОрганизацииДокументов.ОтветственныйИсполнительКонтрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФИООтветственных КАК ФИООтветственных
	|		ПО ВтОрганизацииДокументов.Ссылка = ФИООтветственных.Ссылка";

	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ВсеОрганизации = ОбщегоНазначения.ВыгрузитьКолонку(РезультатЗапроса, "ОрганизацияИсточник", Истина);
	ВидыКИОрганизаций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	КИОрганизаций = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(ВсеОрганизации, , ВидыКИОрганизаций);
	КИОрганизаций.Индексы.Добавить("Объект");
	ОтборОрганизация = Новый Структура("Объект", Справочники.Организации.ПустаяСсылка());
	
	ВсеФизЛица = ОбщегоНазначения.ВыгрузитьКолонку(РезультатЗапроса, "ОтветственныйИсполнительФизЛицо", Истина);
	ВидыКИФизЛиц = Новый Массив;
	ВидыКИФизЛиц.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица); 
	ВидыКИФизЛиц.Добавить(Справочники.ВидыКонтактнойИнформации.EmailФизическиеЛица); 
	КИФизЛиц = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(ВсеФизЛица, , ВидыКИФизЛиц);
	КИФизЛиц.Индексы.Добавить("Объект, Вид");
	ОтборТелефон = Новый Структура("Объект, Вид",
		Справочники.Организации.ПустаяСсылка(), Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица);
	ОтборПочта = Новый Структура("Объект, Вид",
		Справочники.Организации.ПустаяСсылка(), Справочники.ВидыКонтактнойИнформации.EmailФизическиеЛица);
	
	Результат = Новый Соответствие;
	Для Каждого Выборка Из РезультатЗапроса Цикл
		ДанныеОрганизации = НовыйОбщиеСведенияДокументовДляПечати();
		
		ДанныеОрганизации.Организация = Выборка.Организация;
		ДанныеОрганизации.НаименованиеОрганизации = Выборка.НаименованиеОрганизации;
		ДанныеОрганизации.ИНН = Выборка.ИНН;
		ДанныеОрганизации.КПП = Выборка.КПП;
        ОтборОрганизация.Объект = Выборка.ОрганизацияИсточник;
		СтрокиКИ = КИОрганизаций.НайтиСтроки(ОтборОрганизация);
		Если СтрокиКИ.Количество() > 0 Тогда
			ДанныеОрганизации.ЮридическийАдресОрганизации = СтрокиКИ[0].Представление;
		КонецЕсли;
		ДанныеОрганизации.КодРПБС = Выборка.КодРПБС;
		ДанныеОрганизации.НаименованиеОбособленногоПодразделения = Выборка.НаименованиеОбособленногоПодразделения;
        ДанныеОрганизации.КодРПБСОбособленногоПодразделения = Выборка.КодРПБСОбособленногоПодразделения;
        ДанныеОрганизации.ГлаваБК = Выборка.ГлаваБК;
        ДанныеОрганизации.Учредитель = Выборка.Учредитель;
        ДанныеОрганизации.УчредительППО = Выборка.УчредительППО;
		
        ДанныеОрганизации.БюджетНаименование = Выборка.БюджетНаименование;
        ДанныеОрганизации.ОКТМО = Выборка.ОКТМО;

		ДанныеОрганизации.ОтветственныйИсполнитель = Выборка.ОтветственныйИсполнитель;
		Если ЗначениеЗаполнено(Выборка.ДолжностьОтветственного) Тогда
			ДанныеОрганизации.ОтветственныйДолжность = Выборка.ДолжностьОтветственного; 
		Иначе
			ДанныеОрганизации.ОтветственныйДолжность = Выборка.ДолжностьОтветственногоКратко; 
		КонецЕсли;
		ДанныеОрганизации.ОтветственныйДолжностьКратко = Выборка.ДолжностьОтветственногоКратко;	
		ДанныеОрганизации.ОтветственныйФИО = СтрСоединить(ОбщегоНазначенияБГУ.Массив(Выборка.Фамилия, Выборка.Имя, Выборка.Отчество), " "); 
		ДанныеОрганизации.ОтветственныйФамилияИнициалы = КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество", 
														 Выборка.Фамилия, Выборка.Имя, Выборка.Отчество));					
        ОтборТелефон.Объект = Выборка.ОтветственныйИсполнительФизЛицо;
		СтрокиКИ = КИФизЛиц.НайтиСтроки(ОтборТелефон);
		Если СтрокиКИ.Количество() > 0 Тогда
			ДанныеОрганизации.ОтветственныйТелефон = СтрокиКИ[0].Представление;
		КонецЕсли;
		
		ОтборПочта.Объект = Выборка.ОтветственныйИсполнительФизЛицо;
		СтрокиКИ = КИФизЛиц.НайтиСтроки(ОтборПочта);
		Если СтрокиКИ.Количество() > 0 Тогда
			ДанныеОрганизации.ОтветственныйЭлПочта = СтрокиКИ[0].Представление;
		КонецЕсли;
										
		ДанныеОрганизации.СтруктурноеПодразделение = Выборка.ПодразделениеОтветственного;
		ДанныеОрганизации.НаименованиеСтруктурногоПодразделения = СокрЛП(Выборка.НаименованиеСтруктурногоПодразделения);
				
		Результат.Вставить(Выборка.Ссылка, ДанныеОрганизации);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ИмяРеквизитаОтветственногоИсполнителя(ТипДокумента)
	
	ИмяРеквизита = "ОтветственныйИсполнитель";
	
	Если ТипДокумента = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо") Тогда
		ИмяРеквизита = "ПодотчетноеЛицо";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетОРасходахПодотчетногоЛица") Тогда
		ИмяРеквизита = "Сотрудник";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьБСО")
		Или ТипДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьНаличныхСредств")
		Или ТипДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьНФА")
		Или ТипДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьОстатковНаСчетах")
		Или ТипДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьРасчетовПоПоступлениям")
		Или ТипДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьГосДолгаВЦенныхБумагах")
		Или ТипДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьГосДолгаПоПредоставленнымГарантиям")
		Или ТипДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьГосДолгаПоПривлеченнымКредитам")
		Или ТипДокумента = Тип("ДокументСсылка.ИнвентаризационнаяОписьЦенныхБумаг") Тогда
		ИмяРеквизита = "ОтветственныйИсполнительБухгалтерскойСлужбы";
	КонецЕсли;
	
	Возврат ИмяРеквизита;
	
КонецФункции

#КонецОбласти

#Область ПечатьРезультатовГолосования

Процедура ЗаполнитьПараметрыИтоговГолосованияПриПечати(ЗначенияПараметров, Знач ИдентификаторСтроки, Знач РезультатыГолосования) Экспорт
	
	Перем	ИтогГолосования,
			РезолюцияПоИтогуГолосования;
	
	Поиск = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	
	МассивСтрок = РезультатыГолосования.НайтиСтроки(Поиск);
	
	Если МассивСтрок.Количество() > 0
		И МассивСтрок[0].ГолосованиеПоСтрокеЗавершено Тогда
		
		ПерваяСтрока = МассивСтрок[0];
		
		ИтогГолосования = ПерваяСтрока.ИтогГолосования;
		
		Если ПерваяСтрока.РезолюцияКомиссииОдобрена Тогда
			РезолюцияПоИтогуГолосования = "";
		Иначе
			РезолюцияПоИтогуГолосования = НСтр("ru = 'снято с обсуждения'");
		КонецЕсли;
		
	Иначе
		// Результаты голосования по строке документа не найдены.
		
		ИтогГолосования = 0;
		
		РезолюцияПоИтогуГолосования = "";
		
	КонецЕсли;
	
	ЗначенияПараметров.Вставить("ИтогГолосования",				ИтогГолосования);
	ЗначенияПараметров.Вставить("РезолюцияПоИтогуГолосования",	РезолюцияПоИтогуГолосования);
	
КонецПроцедуры

Процедура ВывестиПриложенияПриПечати(ТабДокумент, Знач ДокументСсылка, Знач ОбластьМакетаПриложение) Экспорт
	
	Файлы = УправлениеПечатьюБГУ.ПолучитьСписокФайловДокумента(ДокументСсылка);
	
	Для Каждого Приложение Из Файлы Цикл
		
		ОбластьМакетаПриложение.Параметры.Заполнить(Приложение);
		
		ТабДокумент.Вывести(ОбластьМакетаПриложение);
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//	ТабДокумент					- ТабличныйДокумент	- заполняемый табличный документ.
//	ДокументСсылка				- ДокументСсылка	- печатаемый документ.
//	ОбластьМакетаЧленКомиссии	- ТабличныйДокумент	- заполняемая область макета для одного члена комиссии.
//	СоставКомиссий				- ТаблицаЗначений	- общая таблица состава комиссий всех печатаемых документов.
//		Результат функции ОбщегоНазначенияБГУ.СоставКомиссийПоДокументам(МассивОбъектов).
//	ПараметрыВывода				- Структура			- результат функции ПараметрыВыводаСоставаКомиссииПриПечати().
Процедура ВывестиСоставКомиссииПриПечати(ТабДокумент, Знач ДокументСсылка, Знач ОбластьМакетаЧленКомиссии, Знач СоставКомиссий, Знач ПараметрыВывода = Неопределено) Экспорт
	
	Если СоставКомиссий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыВывода = Неопределено Тогда
		ПараметрыВывода = ПараметрыВыводаСоставаКомиссииПриПечати();
	КонецЕсли;
	
	// ПРЕДСЕДАТЕЛЬ
	
	ОтборСтрок = Новый Структура("Ссылка,Председатель", ДокументСсылка, Истина);
	
	ВывестиМассивСтрокСоставаКомисииПриПечати(ТабДокумент, СоставКомиссий, ОбластьМакетаЧленКомиссии, ОтборСтрок, ПараметрыВывода.ЗаголовокПредседателя,, ПараметрыВывода);
	
	// УПОЛНОМОЧЕННЫЕ ПРЕДСЕДАТЕЛЕМ ЛИЦА
	
	Если ПараметрыВывода.ПризнакРабочейКомиссии Тогда
		ОтборСтрок = Новый Структура("Ссылка,Председатель,УполномоченноеПредседателемЛицо", ДокументСсылка, Ложь, Истина);
		
		ВывестиМассивСтрокСоставаКомисииПриПечати(ТабДокумент, СоставКомиссий, ОбластьМакетаЧленКомиссии, ОтборСтрок, ПараметрыВывода.ЗаголовокУполномоченногоЛица,, ПараметрыВывода);
	КонецЕсли;
	
	// РЯДОВЫЕ ЧЛЕНЫ КОМИССИИ
	
	Если ПараметрыВывода.ПризнакРабочейКомиссии Тогда
		ОтборСтрок = Новый Структура("Ссылка,Председатель,УполномоченноеПредседателемЛицо", ДокументСсылка, Ложь, Ложь);
	Иначе
		ОтборСтрок = Новый Структура("Ссылка,Председатель", ДокументСсылка, Ложь);
	КонецЕсли;
	
	ВывестиМассивСтрокСоставаКомисииПриПечати(ТабДокумент, СоставКомиссий, ОбластьМакетаЧленКомиссии, ОтборСтрок, ПараметрыВывода.ЗаголовокПервогоРядовогоЧлена, ПараметрыВывода.ЗаголовокПоследующихРядовыхЧленов, ПараметрыВывода);
	
КонецПроцедуры

Функция ПараметрыВыводаСоставаКомиссииПриПечати() Экспорт
	
	ПараметрыВывода = Новый Структура();
	ПараметрыВывода.Вставить("ЗаголовокПредседателя",				НСтр("ru='Председатель комиссии'"));
	ПараметрыВывода.Вставить("ЗаголовокПервогоРядовогоЧлена",		НСтр("ru='Члены комиссии'"));
	ПараметрыВывода.Вставить("ЗаголовокПоследующихРядовыхЧленов",	НСтр("ru=''"));
	ПараметрыВывода.Вставить("ЗаголовокУполномоченногоЛица",		НСтр("ru='Уполномоченное председателем лицо'"));
	ПараметрыВывода.Вставить("ПризнакРабочейКомиссии",				Ложь);
	
	НастройкиДополнительныхСведений = Новый Структура();
	НастройкиДополнительныхСведений.Вставить("ВыводитьПричинуОтсутствия", Ложь);
	НастройкиДополнительныхСведений.Вставить("ВыводитьЗамещающегоСотрудника", Ложь);
	
	ПараметрыВывода.Вставить("ВыводитьДополнительныеСведения",	Ложь);
	ПараметрыВывода.Вставить("НастройкиДополнительныхСведений",	НастройкиДополнительныхСведений);
	
	Возврат ПараметрыВывода;
	
КонецФункции

Процедура ВывестиМассивСтрокСоставаКомисииПриПечати(ТабДокумент, СоставКомиссий, ОбластьМакетаЧленКомиссии, ОтборСтрок, Заголовок1, Заголовок2иДалее = Неопределено, ПараметрыВывода)
	
	МассивСтрок = СоставКомиссий.НайтиСтроки(ОтборСтрок);
	
	ЗначенияПараметров = Новый Структура();
	
	ПерваяСтрока = Истина;
	
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		Заголовок = ?(ПерваяСтрока Или Заголовок2иДалее = Неопределено, Заголовок1, Заголовок2иДалее);
		
		ФИО = КорреспондентыКлиентСервер.ФИО(СтрокаТаблицы, Истина);
		
		ЗначенияПараметров.Вставить("Заголовок",				Заголовок);
		ЗначенияПараметров.Вставить("ДолжностьЧленаКомиссии",	СтрокаТаблицы.Должность);
		ЗначенияПараметров.Вставить("ФИОЧленаКомиссии",			ФИО);
		ЗначенияПараметров.Вставить("ФИО",						ФИО);
		
		Если ПараметрыВывода.ВыводитьДополнительныеСведения Тогда
			ЗаполнитьДополнительныеСведенияВСтрокеЧленаКомиссииПриПечати(ЗначенияПараметров, СтрокаТаблицы, ПараметрыВывода);
		КонецЕсли;
		
		ОбластьМакетаЧленКомиссии.Параметры.Заполнить(СтрокаТаблицы);
		ОбластьМакетаЧленКомиссии.Параметры.Заполнить(ЗначенияПараметров);
		
		Если Не ТабДокумент.ПроверитьВывод(ОбластьМакетаЧленКомиссии) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакетаЧленКомиссии);
		
		ПерваяСтрока = Ложь;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДополнительныеСведенияВСтрокеЧленаКомиссииПриПечати(ЗначенияПараметров, СтрокаТаблицы, ПараметрыВывода)
	
	НастройкиДополнительныхСведений = ПараметрыВывода.НастройкиДополнительныхСведений;
	
	МассивСведений = Новый Массив();
	
	Если СтрокаТаблицы.Отсутствует И НастройкиДополнительныхСведений.ВыводитьПричинуОтсутствия Тогда
		МассивСведений.Добавить(СтрШаблон(НСтр("ru='Отсутствует (%1)'"), СтрокаТаблицы.ПричинаОтсутствия));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.ЗамещающийСотрудник) И НастройкиДополнительныхСведений.ВыводитьЗамещающегоСотрудника Тогда
		ЗамещающийСотрудникФИО = КорреспондентыКлиентСервер.ФИО(СтрокаТаблицы, Истина, "ЗамещающийСотрудник");
		
		МассивСведений.Добавить(СтрШаблон(НСтр("ru='Замещает %1 %2'"), СтрокаТаблицы.ЗамещающийСотрудникДолжность, ЗамещающийСотрудникФИО));
	КонецЕсли;
	
	ЗначенияПараметров.Вставить("ДополнительныеСведения", СтрСоединить(МассивСведений, ", "));
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеТаблицыДанныхПечатиФорм61н

// Таблица файлы для печати (приказ 61н).
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица файлы для печати (приказ 61н):
// * ИмяФайла - Строка -
// * Описание - Строка -
// * Файл - СправочникСсылка.Файлы -
Функция ТаблицаФайлыДляПечатиПриказ61н() Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Файл", Новый ОписаниеТипов("СправочникСсылка.Файлы"));
	Возврат Результат;
	
КонецФункции

// Таблица комиссия для печати (приказ 61н).
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица комиссия для печати приказ 61н:
// * ОсобыеОтметки - Строка -
// * НаименованиеДолжности - Строка -
// * Председатель - Булево -
// * ФайлОсобогоМнения - СправочникСсылка.Файлы -
// * ФИО - Строка -
Функция ТаблицаКомиссияДляПечатиПриказ61н() Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ОсобыеОтметки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеДолжности", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Председатель", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ФайлОсобогоМнения", Новый ОписаниеТипов("СправочникСсылка.Файлы"));
	Результат.Колонки.Добавить("ФИО", Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
КонецФункции 

#КонецОбласти

#Область ОбщиеТекстыЗапросаДляПечатиФорм61н

Функция ТекстЗапросаФайлыДляПечатиПриказ61н() Экспорт
	
	Возврат
	"ВЫБРАТЬ
	|	Файлы.ВладелецФайла КАК Ссылка,
	|	Файлы.Ссылка КАК Файл,
	|	Файлы.Наименование КАК ИмяФайла,
	|	Файлы.Описание КАК Описание
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла В(&МассивОбъектов)
	|	И НЕ Файлы.Служебный
	|	И НЕ Файлы.ПометкаУдаления";

КонецФункции

#КонецОбласти

#Область АктОбУтилизации0510435

// Таблица шапки для печати акта об утилизации0510435.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица шапки для печати акта об утилизации0510435:
// * БюджетНаименование - Строка -
// * ГлаваБК - Строка -
// * ДатаАкта - Дата -
// * ДатаПриказа - Дата -
// * ДолжностьРуководителя - Строка -
// * ИнвентарныеОбъекты - см. ТаблицаИнвентарныеОбъектыДляПечатиАктаОбУтилизации0510435
// * КодРПБС - Строка -
// * КодРПБСПодр - Строка -
// * Комиссия - см. ТаблицаКомиссияДляПечатиАктаОбУтилизации0510435
// * МероприятияПоУтилизации - см. ТаблицаМероприятияПоУтилизацииДляПечатиАктаОбУтилизации0510435
// * Местонахождение - Строка -
// * НаименованиеОбособленногоПодразделения - Строка -
// * НаименованиеОрганизации - Строка -
// * НаименованиеПриказа - Строка -
// * НаименованиеСтруктурногоПодразделения - Строка -
// * НеинвентарныеОбъекты - см. ТаблицаНеинвентарныеОбъектыДляПечатиАктаОбУтилизации0510435
// * НомерАкта - Строка -
// * НомерПриказа - Строка -
// * ОбособленноеПодразделение - СправочникСсылка.Организации -
// * ОКТМО - Строка -
// * Организация - СправочникСсылка.Организации -
// * Ответственный - СправочникСсылка.Пользователи -
// * ОтветственныйДолжность - СправочникСсылка.Должности -
// * ОтветственныйДолжностьНаименование - Строка -
// * ОтветственныйНомерТелефона - Строка -
// * ОтветственныйФИО - Строка -
// * ОтветственныйЭлектроннаяПочта - Строка -
// * ПолученныеДрагматериалы - см. ТаблицаПолученныеДрагматериалыДляПечатиАктаОбУтилизации0510435
// * ПолученныеМЦ - см. ТаблицаПолученныеМЦДляПечатиАктаОбУтилизации0510435
// * Сотрудник - СправочникСсылка.Сотрудники -
// * Ссылка - ДокументСсылка
// * СтруктурноеПодразделение - СправочникСсылка.Подразделения -
// * Учредитель - Строка -
// * Файлы - см. ТаблицаФайлыДляПечатиАктаОбУтилизации0510435
// * ФИОРуководителя - Строка -
// * ЦМО - Строка -
Функция ТаблицаШапкиДляПечатиАктаОбУтилизации0510435() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("БюджетНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ГлаваБК", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДатаАкта", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаПриказа", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДолжностьРуководителя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИнвентарныеОбъекты", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("КодРПБС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодРПБСПодр", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Комиссия", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("МероприятияПоУтилизации", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Местонахождение", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОбособленногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеСтруктурногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НеинвентарныеОбъекты", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("НомерАкта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОбособленноеПодразделение", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Колонки.Добавить("ОКТМО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Колонки.Добавить("Ответственный", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	Результат.Колонки.Добавить("ОтветственныйДолжность", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	Результат.Колонки.Добавить("ОтветственныйДолжностьНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйНомерТелефона", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйЭлектроннаяПочта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПолученныеДрагматериалы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("ПолученныеМЦ", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Результат.Колонки.Добавить("СтруктурноеПодразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	Результат.Колонки.Добавить("Учредитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Файлы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("ФИОРуководителя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЦМО", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
КонецФункции

// Таблица инвентарные объекты для печати акта об утилизации0510435.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица инвентарные объекты для печати акта об утилизации0510435:
// * ДокументДата - Дата -
// * ДокументНаименование - Строка -
// * ДокументНомер - Строка -
// * Драгматериалы - см. ТаблицаДрагматериалыДляПечатиАктаОбУтилизации0510435
// * ИнвентарныйНомер - Строка -
// * ИнвентарныйНомерСсылка - СправочникСсылка.ИнвентарныеНомераОС -
// * КодСтроки - Строка -
// * НаименованиеОС - Строка -
// * ОсновноеСредство - СправочникСсылка.ОсновныеСредства -
// * Стоимость - Число -
Функция ТаблицаИнвентарныеОбъектыДляПечатиАктаОбУтилизации0510435() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ДокументДата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДокументНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДокументНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Драгматериалы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИнвентарныйНомерСсылка", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	Результат.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	Результат.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число"));
	Возврат Результат;
КонецФункции

// Таблица неинвентарные объекты для печати акта об утилизации0510435.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица неинвентарные объекты для печати акта об утилизации0510435:
// * ДокументДата - Дата -
// * ДокументНаименование - Строка -
// * ДокументНомер - Строка -
// * Драгматериалы - см. ТаблицаДрагматериалыДляПечатиАктаОбУтилизации0510435
// * КодЕИМЗ - Строка -
// * КодСтроки - Строка -
// * КоличествоМЗ - Число -
// * НаименованиеЕИМЗ - Строка -
// * НаименованиеМЗ - Строка -
// * Номенклатура - СправочникСсылка.Номенклатура -
// * НоменклатурныйНомер - Строка -
// * Сумма - Число -
Функция ТаблицаНеинвентарныеОбъектыДляПечатиАктаОбУтилизации0510435() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ДокументДата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДокументНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДокументНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Драгматериалы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("КодЕИМЗ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КоличествоМЗ", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НаименованиеЕИМЗ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеМЗ", Новый ОписаниеТипов("Строка"));
	// В эту таблицу собирается не только номенклатура, но и основные средства
	Результат.Колонки.Добавить("Номенклатура", 
		Новый ОписаниеТипов("СправочникСсылка.Номенклатура, СправочникСсылка.ОсновныеСредства"));
	Результат.Колонки.Добавить("НоменклатурныйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Возврат Результат;
КонецФункции

// Таблица драгматериалы для печати акта об утилизации0510435.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица драгматериалы для печати акта об утилизации0510435:
// * Деталь - Строка -
// * Драгметалл - Строка -
// * КодЕИ - Строка -
// * Количество - Число -
// * НаименованиеЕИ - Строка -
Функция ТаблицаДрагматериалыДляПечатиАктаОбУтилизации0510435() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Деталь", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Драгметалл", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодЕИ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НаименованиеЕИ", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
КонецФункции

// Таблица мероприятия по утилизации для печати акта об утилизации0510435.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица мероприятия по утилизации для печати акта об утилизации0510435:
// * Деталь - Строка -
// * КлассОпасности - Строка -
// * КодСтроки - Строка -
// * КонтрагентИД - Строка -
// * КонтрагентНаименование - Строка -
// * Наименование - Строка -
// * ОбъектУчета - СправочникСсылка.Номенклатура, СправочникСсылка.ОсновныеСредства -
// * Работы - Строка -
// * РаботыДата - Дата -
// * РаботыНаименование - Строка -
// * РаботыНомер - Строка -
// * РаботыСодержание - Строка -
// * СпособУтилизации - Строка -
Функция ТаблицаМероприятияПоУтилизацииДляПечатиАктаОбУтилизации0510435() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Деталь", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КлассОпасности", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КонтрагентИД", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КонтрагентНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОбъектУчета", Новый ОписаниеТипов("СправочникСсылка.Номенклатура, СправочникСсылка.ОсновныеСредства"));
	Результат.Колонки.Добавить("Работы", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РаботыДата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("РаботыНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РаботыНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РаботыСодержание", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СпособУтилизации", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
КонецФункции

// Таблица полученные МЦДля печати акта об утилизации0510435.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица полученные МЦДля печати акта об утилизации0510435:
// * ИтогГолосования - Строка -
// * КодЕИМЗ - Строка -
// * КодСтроки - Строка -
// * Количество - Число -
// * Наименование - Строка -
// * НаименованиеЕИМЗ - Строка -
// * НаименованиеМЗ - Строка -
// * ОсобыеОтметки - Строка -
// * РезолюцияКомиссии - Строка -
// * Сумма - Число -
// * Цена - Число -
Функция ТаблицаПолученныеМЦДляПечатиАктаОбУтилизации0510435() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИтогГолосования", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодЕИМЗ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеЕИМЗ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеМЗ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОсобыеОтметки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РезолюцияКомиссии", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	Возврат Результат;
КонецФункции

// Таблица полученные драгматериалы для печати акта об утилизации0510435.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица полученные драгматериалы для печати акта об утилизации0510435:
// * Деталь - Строка -
// * Драгметалл - Строка -
// * КодЕИ - Строка -
// * КодСтроки - Строка -
// * Количество - Число -
// * НаименованиеЕИ - Строка -
// * НаименованиеМЗ - Строка -
Функция ТаблицаПолученныеДрагматериалыДляПечатиАктаОбУтилизации0510435() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Деталь", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Драгметалл", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодЕИ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НаименованиеЕИ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеМЗ", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
КонецФункции

// Формирует текст особой отметки для гр.10 разд.2.2 формы 0510435 "Акт об утилизации"
//
// Параметры:
//   ИдентификаторСтроки - Строка - идентификатор строки, для которой формируется отметка
//   ОдобренныеСтроки - Массив из Строка - массив идентификаторов одобренных строк
//
// Возвращаемое значение:
//   Строка - текст особой отметки ("Одобрено комиссией" или "Не одобрено комиссией")
Функция ОсобаяОтметкаРаздела22АктаОбУтилизации0510435(ИдентификаторСтроки, ОдобренныеСтроки) Экспорт
	Возврат(?(ОдобренныеСтроки.Найти(ИдентификаторСтроки) <> Неопределено,
		Нстр("ru = 'Одобрено комиссией'"), Нстр("ru = 'Не одобрено комиссией'")));
КонецФункции	

#КонецОбласти

#Область АктСписанияМЗ0504230

// Таблица шапки для печати акта списания МЗ 0504230.
// 
// Возвращаемое значение:
//  ТаблицаЗначений -  Таблица шапки для печати акта списания МЗ 0504230:
// * Дата - Дата - 
// * ДатаПриказа - Дата - 
// * Директор - Строка
// * ДиректорСсылка - СправочникСсылка.Контрагенты - 
// * ДолжностьПредседателяКомиссии - Строка - 
// * ЗаключениеКомиссии - Строка - 
// * ИНН - Строка - 
// * ИФО - СправочникСсылка.ИсточникиФинансовогоОбеспечения - 
// * ИмяПредседателяКомиссии - Строка - 
// * КПП - Строка - 
// * КФО - ПеречислениеСсылка.КВД - 
// * КФОВТабличнойЧасти - Булево - 
// * КодОКПО - Строка - 
// * Материалы - см. ТаблицаМатериалыДляПечатиАктаСписанияМЗ0504230
// * МОЛ - Строка 
// * НаименованиеОрганизации - Строка - 
// * Номер - Строка - 
// * НомерПриказа - Строка - 
// * Организация - СправочникСсылка.Организации - 
// * ОтчествоПредседателяКомиссии - Строка - 
// * Подразделение - Строка - 
// * ПодразделениеОтправитель - СправочникСсылка.Подразделения - 
// * ПричинаСписания - Строка
// * СоставКомиссии - см. ТаблицаКомиссияДляПечатиАктаСписанияМЗ0504230 
// * Ссылка - ДокументСсылка - 
// * ФамилияПредседателяКомиссии - Строка - 
// * ФИОГлавныйБухгалтер - Строка -
// * ЦМО - СправочникСсылка.Контрагенты - 
// * ЦМООтправитель - СправочникСсылка.ЦМО - 
Функция ТаблицаШапкиДляПечатиАктаСписанияМЗ0504230() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаПриказа", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("Директор", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДиректорСсылка", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Результат.Колонки.Добавить("ДолжностьПредседателяКомиссии", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЗаключениеКомиссии", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИФО", Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	Результат.Колонки.Добавить("ИмяПредседателяКомиссии", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КПП", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	Результат.Колонки.Добавить("КФОВТабличнойЧасти", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("КодОКПО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Материалы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("МОЛ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Колонки.Добавить("ОтчествоПредседателяКомиссии", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПодразделениеОтправитель", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	Результат.Колонки.Добавить("ПричинаСписания", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СоставКомиссии", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Результат.Колонки.Добавить("ФамилияПредседателяКомиссии", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ФИОГлавныйБухгалтер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЦМО", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Результат.Колонки.Добавить("ЦМООтправитель", Новый ОписаниеТипов("СправочникСсылка.ЦМО"));
	Возврат Результат;
КонецФункции

// Таблица материалы для печати акта списания МЗ 0504230.
// 
// Возвращаемое значение:
//  ТаблицаЗначений -  Таблица материалы для печати акта списания МЗ 0504230:
// * ДополнительнаяАналитикаСчета - Характеристика.ВидыСубконто
// * Единица - Строка - 
// * КПС - СправочникСсылка.КлассификационныеПризнакиСчетов - 
// * КФО - ПеречислениеСсылка.КВД - 
// * КЭК - СправочникСсылка.КОСГУ - 
// * КодНоменклатуры - Строка - 
// * Количество - Число - 
// * НоменклатураНаименование - Строка - 
// * НоменклатураНаименованиеПолное - Строка - 
// * НоменклатураПредставление - Строка - 
// * НоменклатураСсылка - СправочникСсылка.Номенклатура - 
// * НоменклатурныйНомер - Строка - 
// * НоменклатурныйНомерНоменклатуры - Строка - 
// * НомерСтроки - Число - 
// * НормаРасхода - Число - 
// * ПричинаСписания - Строка -
// * Сумма - Число 
// * СчетДебета - Строка -
// * СчетКредита - Строка -
// * СчетУчета - ПланСчетовСсылка.ЕПСБУ -
// * Цена - Число - 
Функция ТаблицаМатериалыДляПечатиАктаСписанияМЗ0504230() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ДополнительнаяАналитикаСчета", Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	Результат.Колонки.Добавить("Единица", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КПС", Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	Результат.Колонки.Добавить("КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	Результат.Колонки.Добавить("КЭК", Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	Результат.Колонки.Добавить("КодНоменклатуры", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НоменклатураНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НоменклатураНаименованиеПолное", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НоменклатураПредставление", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НоменклатураСсылка", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Результат.Колонки.Добавить("НоменклатурныйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НоменклатурныйНомерНоменклатуры", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НормаРасхода", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ПричинаСписания", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СчетДебета", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СчетКредита", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СчетУчета", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	Результат.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	Возврат Результат;
КонецФункции

// Таблица комиссия для печати акта списания МЗ 0504230.
// 
// Возвращаемое значение:
//  ТаблицаЗначений -  Таблица комиссия для печати акта списания МЗ 0504230:
// * ДолжностьЧленаКомиссии - Строка 
// * ИмяЧленаКомиссии - Строка
// * ОтчествоЧленаКомиссии - Строка
// * ФамилияЧленаКомиссии - Строка
Функция ТаблицаКомиссияДляПечатиАктаСписанияМЗ0504230() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ДолжностьЧленаКомиссии", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИмяЧленаКомиссии", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтчествоЧленаКомиссии", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ФамилияЧленаКомиссии", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область РешениеОПрекращенииПризнанияАктивом0510440

// Таблица шапки для печати решение о прекращении признания активом 0510440.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица шапки для печати решение о прекращении признания активом 0510440:
// * ВидЛокальногоАкта - Строка -
// * ДатаАкта - Дата -
// * ДатаЛокальногоАкта - Дата -
// * ДатаПриказа - Дата -
// * ДолжностьРуководителя - Строка -
// * ЗаключениеПоОбъектам - см. ТаблицаЗаключениеПоОбъектамДляПечатиРешениеОПрекращенииПризнанияАктивом0510440
// * ИнвентаризационныеОписи - см. ТаблицаИнвентаризационныеОписиДляПечатиРешениеОПрекращенииПризнанияАктивом0510440
// * НаименованиеПриказа - Строка -
// * НомерАкта - Строка -
// * НомерЛокальногоАкта - Строка -
// * НомерПриказа - Строка -
// * Ответственный - СправочникСсылка.Пользователи -
// * ОтветственныйДолжность - СправочникСсылка.Должности -
// * ОтветственныйДолжностьНаименование - Строка -
// * ОтветственныйНомерТелефона - Строка -
// * ОтветственныйФИО - Строка -
// * ОтветственныйЭлектроннаяПочта - Строка -
// * СведенияОбОбъектах - см. ТаблицаСведенияОбОбъектахДляПечатиРешениеОПрекращенииПризнанияАктивом0510440
// * Ссылка - ДокументСсылка 
// * ФИОРуководителя - Строка -
// * Файлы - см. ТаблицаФайлыДляПечатиПриказ61н
// * ХарактеристикиОбъектов - см. ТаблицаХарактеристикиОбъектовДляПечатиРешениеОПрекращенииПризнанияАктивом0510440
Функция ТаблицаШапкиДляПечатиРешениеОПрекращенииПризнанияАктивом0510440() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВидЛокальногоАкта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДатаАкта", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаЛокальногоАкта", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаПриказа", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДолжностьРуководителя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЗаключениеПоОбъектам", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("ИнвентаризационныеОписи", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("НаименованиеПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерАкта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерЛокальногоАкта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Ответственный", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	Результат.Колонки.Добавить("ОтветственныйДолжность", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	Результат.Колонки.Добавить("ОтветственныйДолжностьНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйНомерТелефона", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйЭлектроннаяПочта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СведенияОбОбъектах", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Результат.Колонки.Добавить("ФИОРуководителя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Файлы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("ХарактеристикиОбъектов", Новый ОписаниеТипов("ТаблицаЗначений"));
	Возврат Результат;
КонецФункции

// Таблица инвентаризационные описи для печати решение о прекращении признания активом 0510440.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица инвентаризационные описи для печати решение о прекращении признания активом 0510440:
// * Дата - Дата -
// * Номер - Строка -
// * Счет - Строка -
Функция ТаблицаИнвентаризационныеОписиДляПечатиРешениеОПрекращенииПризнанияАктивом0510440() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Счет", Новый ОписаниеТипов("Строка"));
	Возврат Результат;	
КонецФункции

// Таблица сведения об объектах для печати решение о прекращении признания активом 0510440.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица сведения об объектах для печати решение о прекращении признания активом 0510440:
// * ДатаВыпуска - Дата -
// * ЗаводскойНомер - Строка -
// * ИнвентарныйНомер - Строка -
// * ИнойНомер - Строка -
// * Количество - Число -
// * НаименованиеОС - Строка -
// * НомерСтроки - Число -
// * ОсновноеСредство - СправочникСсылка
// * РеестровыйНомер - Строка -
// * Сведения - Строка -
// * СрокПолезногоИспользования - Число -
// * СрокЭксплуатации - Число -
// * Сумма - Число -
// * СуммаАмортизации - Число -
// * СуммаОбесценения - Число -
Функция ТаблицаСведенияОбОбъектахДляПечатиРешениеОПрекращенииПризнанияАктивом0510440() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ДатаВыпуска", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ЗаводскойНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИнойНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НаименованиеОС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ОсновноеСредство", Справочники.ТипВсеСсылки());
	Результат.Колонки.Добавить("РеестровыйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Сведения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СрокПолезногоИспользования", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СрокЭксплуатации", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СуммаАмортизации", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СуммаОбесценения", Новый ОписаниеТипов("Число"));
	Возврат Результат;	
КонецФункции
										
// Таблица характеристики объектов для печати решение о прекращении признания активом 0510440.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица характеристики объектов для печати решение о прекращении признания активом 0510440:
// * Деталь - Строка -
// * Драгметалл - Строка -
// * ЗначениеХарактеристики - Строка -
// * КодЕИ - Строка -
// * Количество - Число -
// * НаименованиеЕИ - Строка -
// * НомерОбъекта - Строка -
// * НомерСтроки - Строка -
// * Характеристика - Строка -
Функция ТаблицаХарактеристикиОбъектовДляПечатиРешениеОПрекращенииПризнанияАктивом0510440() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Деталь", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Драгметалл", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЗначениеХарактеристики", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодЕИ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НаименованиеЕИ", Новый ОписаниеТипов("Строка"));

	//Результат.Колонки.Добавить("НомерОбъекта", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НомерОбъекта", Новый ОписаниеТипов("Строка"));
	
	// НомерСтроки формируется по формуле <НомерСтрокиОбъекта> + "." + <НомерСтрокиХарактеристики>.
	// Т.е. это строка
	//Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Строка"));
	
	Результат.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
КонецФункции
										
// Таблица заключение по объектам для печати решение о прекращении признания активом 0510440.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица заключение по объектам для печати решение о прекращении признания активом 0510440:
// * ЕдИзм - Строка -
// * ИнвентарныйНомер - Строка -
// * ИтогГолосования - Строка -
// * КодСчета - Строка -
// * НаименованиеОС - Строка -
// * НеАктивКоличество - Число -
// * НеАктивСумма - Число -
// * НомерСтроки - Число -
// * РезолюцияИтог - Строка -
// * РезолюцияКомиссии - Строка -
// * Статус - Строка -
// * ЦелеваяФункция - Строка -
Функция ТаблицаЗаключениеПоОбъектамДляПечатиРешениеОПрекращенииПризнанияАктивом0510440() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ЕдИзм", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИтогГолосования", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодСчета", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НеАктивКоличество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НеАктивСумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("РезолюцияИтог", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РезолюцияКомиссии", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЦелеваяФункция", Новый ОписаниеТипов("Строка"));
	Возврат Результат;	
КонецФункции										
										
#КонецОбласти

#Область РешениеОбОценкеИмущества0510442

// Таблица шапки для печати решения об оценке имущества 0510442.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица шапки для печати решения об оценке имущества 0510442:
// * БюджетНаименование - Строка -
// * ВидДокументаОСогласовании - Строка
// * ГлаваБК - Строка -
// * Дата - Дата -
// * ДатаДокументаОСогласовании - Дата
// * ДатаПриказа - Дата -
// * КодРПБС - Строка -
// * КодРПБСПодр - Строка -
// * НаименованиеОбособленногоПодразделения - Строка -
// * НаименованиеОрганизации - Строка -
// * НаименованиеПриказа - Строка -
// * НаименованиеСтруктурногоПодразделения - Строка -
// * Номер - Строка -
// * НомерДокументаОСогласовании - Строка
// * НомерПриказа - Строка -
// * ОКТМО - Строка -
// * ОбособленноеПодразделение - СправочникСсылка.Подразделения -
// * Организация - СправочникСсылка.Организации -
// * ОтветственныйДатаПодписи - Дата -
// * ОтветственныйДолжность - Строка -
// * ОтветственныйТелефон - Строка -
// * ОтветственныйФИО - Строка -
// * ОтветственныйЭлПочта - Строка -
// * СоставДокумента - см. ТаблицаСоставДокументаДляПечатиРешенияОбОценкеИмущества0510442
// * СоставКомиссии - см. ТаблицаКомиссияДляПечатиПриказ61н
// * Ссылка - ДокументСсылка -
// * СтруктурноеПодразделение - СправочникСсылка.Подразделения -
// * УполномоченноеЛицоДолжность - Строка -
// * УполномоченноеЛицоФИО - Строка -
// * УчетныйНомерОтправитель - Строка -
// * Учредитель - Строка -
// * Файлы - см. ТаблицаФайлыДляПечатиПриказ61н
Функция ТаблицаШапкиДляПечатиРешенияОбОценкеИмущества0510442() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("БюджетНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ВидДокументаОСогласовании", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ГлаваБК", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаДокументаОСогласовании", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаПриказа", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("КодРПБС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодРПБСПодр", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОбособленногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеСтруктурногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерДокументаОСогласовании", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОКТМО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОбособленноеПодразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	Результат.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Колонки.Добавить("ОтветственныйДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ОтветственныйДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйТелефон", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйЭлПочта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СоставДокумента", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("СоставКомиссии", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Результат.Колонки.Добавить("СтруктурноеПодразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	Результат.Колонки.Добавить("УполномоченноеЛицоДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УполномоченноеЛицоФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УчетныйНомерОтправитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Учредитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Файлы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Возврат Результат;
КонецФункции

// Таблица состав документа для печати решения об оценке имущества0510442.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица состав документа для печати решения об оценке имущества0510442:
// * ДатаВыпуска - Строка -
// * ЗаводскойНомер - Строка -
// * ИнойНомер - Строка -
// * МетодРыночныхЦен - Строка -
// * НаименованиеОС - Строка -
// * НомерСтроки - Число -
// * ОсновноеСредство - СправочникСсылка 
// * ОценкаДата - Дата -
// * ОценкаНомер - Строка -
// * ОценкаСумма - Число -
// * РеестровыйНомер - Строка -
// * СправедливаяСтоимость - Число -
// * СрокЭксплуатации - Строка -
// * Сумма - Число -
// * СуммаАмортизации - Число -
// * СуммаОбесценения - Число -
Функция ТаблицаСоставДокументаДляПечатиРешенияОбОценкеИмущества0510442() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ДатаВыпуска", Новый ОписаниеТипов("Дата"));	
	Результат.Колонки.Добавить("ЗаводскойНомер", Новый ОписаниеТипов("Строка"));	
	Результат.Колонки.Добавить("ИнойНомер", Новый ОписаниеТипов("Строка"));	
	Результат.Колонки.Добавить("МетодРыночныхЦен", Новый ОписаниеТипов("Строка"));	
	Результат.Колонки.Добавить("НаименованиеОС", Новый ОписаниеТипов("Строка"));	
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));	
	Результат.Колонки.Добавить("ОсновноеСредство", Справочники.ТипВсеСсылки());	
	Результат.Колонки.Добавить("ОценкаДата", Новый ОписаниеТипов("Дата"));	
	Результат.Колонки.Добавить("ОценкаНомер", Новый ОписаниеТипов("Строка"));	
	Результат.Колонки.Добавить("ОценкаСумма", Новый ОписаниеТипов("Число"));	
	Результат.Колонки.Добавить("РеестровыйНомер", Новый ОписаниеТипов("Строка"));	
	Результат.Колонки.Добавить("СправедливаяСтоимость", Новый ОписаниеТипов("Число"));	
	Результат.Колонки.Добавить("СрокЭксплуатации", Новый ОписаниеТипов("Число"));	
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));	
	Результат.Колонки.Добавить("СуммаАмортизации", Новый ОписаниеТипов("Число"));	
	Результат.Колонки.Добавить("СуммаОбесценения", Новый ОписаниеТипов("Число"));
	Возврат Результат;	
КонецФункции

#КонецОбласти

#Область АктОПриемеПередачеОбъектовНефинансовыхАктивов0510448

// Таблица шапки акт о приеме передаче объектов нефинансовых активов0510448.
// 
// Возвращаемое значение:
//  ТаблицаЗначений -  Таблица шапки акт о приеме передаче объектов нефинансовых активов0510448:
// * АналитическаяГруппа - Строка - 
// * ВидИмущества - Строка - 
// * ДатаАкта - Дата - 
// * ДатаОснования - Дата - 
// * ДатаПриказа - Дата - 
// * ИндивидуальныеХарактеристики - см. ТаблицаИндивидуальныеХарактеристикиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448
// * Контрагент - СправочникСсылка.Контрагенты - 
// * КонтрагентБюджетНаименование - Строка - 
// * КонтрагентГлаваБК - Строка - 
// * КонтрагентКодРПБС - Строка - 
// * КонтрагентНаименование - Строка - 
// * КонтрагентОКТМО - Строка - 
// * КонтрагентУчредитель - Строка - 
// * НаименованиеОснования - Строка - 
// * НаименованиеПриказа - Строка - 
// * НомерАкта - Строка - 
// * НомерОснования - Строка - 
// * НомерПриказа - Строка - 
// * Отправитель - СправочникСсылка.Сотрудники - 
// * ПередаваемыеОбъекты - см. ТаблицаСведенияОПередаваемыхОбъектахНФААктОПриемеПередачеОбъектовНефинансовыхАктивов0510448
// * Передача - Булево 
// * Получатель - СправочникСсылка.Сотрудники - 
// * Принятие - Булево 
// * ПринятыеОбъектыНФА - см. ТаблицаСведенияОПринятыхОбъектахНФААктОПриемеПередачеОбъектовНефинансовыхАктивов0510448
// * Руководитель - СправочникСсылка.Сотрудники
// * СведенияОбОграничениях - см. ТаблицаСведенияОбОграниченияхАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448 
// * СоставКомиссии - см. ТаблицаКомиссияДляПечатиПриказ61н
// * Сотрудник - СправочникСсылка.Сотрудники
// * Ссылка - ДокументСсылка
// * Файлы - см. ТаблицаФайлыДляПечатиПриказ61н
// * ФИООтправителя - Строка - 
// * ФИОПолучателя - Строка - 
Функция ТаблицаШапкиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("АналитическаяГруппа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ВидИмущества", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДатаАкта", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаОснования", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаПриказа", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ИндивидуальныеХарактеристики", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Результат.Колонки.Добавить("КонтрагентБюджетНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КонтрагентГлаваБК", Новый ОписаниеТипов("Строка"));;
	Результат.Колонки.Добавить("КонтрагентКодРПБС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КонтрагентНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КонтрагентОКТМО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КонтрагентУчредитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОснования", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерАкта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерОснования", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Отправитель", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("ПередаваемыеОбъекты", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Передача", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Получатель", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("Принятие", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ПринятыеОбъектыНФА", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.Сотрудники")); 
	Результат.Колонки.Добавить("СведенияОбОграничениях", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("СоставКомиссии", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники")); 
	Результат.Колонки.Добавить("СотрудникПолучатель", Новый ОписаниеТипов("СправочникСсылка.Сотрудники")); 
	Результат.Колонки.Добавить("СотрудникОтправитель", Новый ОписаниеТипов("СправочникСсылка.Сотрудники")); 
	Результат.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Результат.Колонки.Добавить("Файлы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("ФайлыАктаЭДО", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("ФИООтправителя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ФИОПолучателя", Новый ОписаниеТипов("Строка"));
	
	Результат.Колонки.Добавить("НФАПереданыЭлектроннымАктом", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Колонки.Добавить("НаименованиеОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОбособленноеПодразделение", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Колонки.Добавить("НаименованиеОбособленногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СтруктурноеПодразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	Результат.Колонки.Добавить("НаименованиеСтруктурногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Учредитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОКТМО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("БюджетНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ГлаваБК", Новый ОписаниеТипов("Строка"));;
	Результат.Колонки.Добавить("КодРПБС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодРПБСПодр", Новый ОписаниеТипов("Строка"));

	Результат.Колонки.Добавить("КонтрагентОбособленноеПодразделениеНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КонтрагентОбособленноеПодразделениеКодРПБС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КонтрагентОбособленноеПодразделение", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	Возврат Результат;
	
КонецФункции

// Таблица сведения о передаваемых объекта НФААкт о приеме передаче объектов нефинансовых активов0510448.
// 
// Возвращаемое значение:
//  ТаблицаЗначений -  Таблица сведения о передаваемых объекта НФААкт о приеме передаче объектов нефинансовых активов0510448:
// * АмортизационнаяГруппа - Строка - 
// * ДатаВводаВЭксплуатацию - Дата - 
// * ДатаВыпуска - Дата - 
// * ДатаОкончанияАмортизации - Дата -
// * ЕдИзмКод - Строка
// * ЕдИзмНаименование - Строка 
// * ЗаводскойНомер - Строка - 
// * ИнвентарныйНомер - Строка - 
// * ИнвентарныйНомерСсылка - СправочникСсылка.ИнвентарныеНомераОС - 
// * ИнойНомер - Строка - 
// * КодГруппы - Строка - 
// * КодОбъекта - Строка - 
// * Количество - Число - 
// * НФА - СправочникСсылка 
// * НаименованиеНФА - Строка - 
// * НомерСтроки - Число - 
// * ПорядокНачисления - Строка - 
// * РеестровыйНомер - Строка - 
// * Сведения - Строка - 
// * СрокПолезногоИспользования - Число - 
// * СрокЭксплуатации - Число - 
// * Сумма - Число - 
// * СуммаАмортизации - Число - 
// * СуммаВложений - Число - 
// * СуммаОбесценения - Число - 
// * Цена - Число - 
Функция ТаблицаСведенияОПередаваемыхОбъектахНФААктОПриемеПередачеОбъектовНефинансовыхАктивов0510448() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("АмортизационнаяГруппа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДатаВводаВЭксплуатацию", Новый ОписаниеТипов("Дата"));
//	Результат.Колонки.Добавить("ДатаВыпуска", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаВыпуска"); // При передаче капвложений сюда выводится год начала вложений 
	Результат.Колонки.Добавить("ДатаОкончанияАмортизации", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ЕдИзмКод", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЕдИзмНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЗаводскойНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИнвентарныйНомерСсылка", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	Результат.Колонки.Добавить("ИнойНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодГруппы", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодОбъекта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НФА", Справочники.ТипВсеСсылки());
	Результат.Колонки.Добавить("НаименованиеНФА", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ПорядокНачисления", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РеестровыйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Сведения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СрокПолезногоИспользования", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СрокЭксплуатации", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СуммаАмортизации", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СуммаВложений", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СуммаОбесценения", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	Возврат Результат;
	
КонецФункции

// Таблица индивидуальные характеристики акт о приеме передаче объектов нефинансовых активов0510448.
// 
// Возвращаемое значение:
//  ТаблицаЗначений -  Таблица индивидуальные характеристики акт о приеме передаче объектов нефинансовых активов0510448:
// * Адрес - Строка - 
// * Деталь - Строка - 
// * Драгметалл - Строка - 
// * ЗначениеХарактеристики - Строка - 
// * КодЕИ - Строка - 
// * Количество - Число - 
// * НФА - СправочникСсылка
// * Назначение - Строка - 
// * НаименованиеЕИ - Строка - 
// * НаименованиеНФА - Строка - 
// * НомерСтроки - Число - 
// * Характеристика - Строка - 
Функция ТаблицаИндивидуальныеХарактеристикиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448() Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Деталь", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Драгметалл", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЗначениеХарактеристики", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодЕИ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НФА", Справочники.ТипВсеСсылки());
	Результат.Колонки.Добавить("Назначение", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеЕИ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеНФА", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("Строка"));
	Возврат Результат;

КонецФункции

// Таблица сведения об ограничениях акт о приеме передаче объектов нефинансовых активов 0510448.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица сведения об ограничениях акт о приеме передаче объектов нефинансовых активов 0510448:
// * ВидОбременения - Строка - 
// * НФА 
// * НаименованиеНФА - Строка - 
// * НомерСтроки - Число - 
// * РегистрацияДата - Дата - 
// * РегистрацияНомер - Строка - 
// * ЕдИзмОграничения - Строка - 
// * ЗначениеОграничения - Строка - 
// * ВидОграничения - Строка - 
// * НачалоОграничения - Дата - 
// * ОкончаниеОграничения - Дата - 
// * ПлатаЗаЕдОграничения - Число - 
// * СрокОграничения - Число - 
// * СуммаПлатыЗаОграничение - Число - 
// * СуммаПлатыЗаОграничениеЗаМесяц - Число - 
// * ВидДокументаОграничения - Строка - 
// * НомерДокументаОграничения - Строка - 
// * ДатаДокументаОграничения - Дата - 
// * Контрагент - СправочникСсылка.Контрагенты - 
// * НаименованиеКонтрагентаОграничения - Строка - 
// * ОГРНКонтрагентаОграничения - Строка - 
// * ИННКонтрагентаОграничения - Строка - 
// * КППКонтрагентаОграничения - Строка - 
// * ОКОПФКонтрагентаОграничения - Строка - 
// * КИСЭКонтрагентаОграничения - Строка - 
// * НомерКартыОграничения - Строка - 
Функция ТаблицаСведенияОбОграниченияхАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448() Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВидОбременения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НФА", Справочники.ТипВсеСсылки());
	Результат.Колонки.Добавить("НаименованиеНФА", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("РегистрацияДата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Результат.Колонки.Добавить("РегистрацияНомер", Новый ОписаниеТипов("Строка"));

	Результат.Колонки.Добавить("ЕдИзмОграничения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЗначениеОграничения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ВидОграничения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НачалоОграничения", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Результат.Колонки.Добавить("ОкончаниеОграничения", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Результат.Колонки.Добавить("ПлатаЗаЕдОграничения", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СрокОграничения", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СуммаПлатыЗаОграничение", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СуммаПлатыЗаОграничениеЗаМесяц", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ВидДокументаОграничения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерДокументаОграничения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДатаДокументаОграничения", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Результат.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Результат.Колонки.Добавить("НаименованиеКонтрагентаОграничения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОГРНКонтрагентаОграничения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИННКонтрагентаОграничения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КППКонтрагентаОграничения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОКОПФКонтрагентаОграничения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КИСЭКонтрагентаОграничения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерКартыОграничения", Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
		
КонецФункции

// Таблица сведения о принятых объекта НФААкт о приеме передаче объектов нефинансовых активов0510448.
// 
// Возвращаемое значение:
//  ТаблицаЗначений -  Таблица сведения о принятых объекта НФААкт о приеме передаче объектов нефинансовых активов0510448:
// * АмортизационнаяГруппа - Строка - 
// * АналитическаяГруппа - Строка - 
// * ВидИмущества - Строка - 
// * ДатаОкончанияАмортизации - Дата - 
// * ЕдИзмКод - Строка
// * ЕдИзмНаименование - Строка 
// * Количество - Число - 
// * НФА - СправочникСсылка
// * НаименованиеНФА - Строка - 
// * НомерСтроки - Число - 
// * НормаАмортизации - Число - 
// * ПорядокНачисления - Строка - 
// * СрокПолезногоИспользования - Число - 
// * Сумма - Число - 
// * СуммаВложений - Число - 
Функция ТаблицаСведенияОПринятыхОбъектахНФААктОПриемеПередачеОбъектовНефинансовыхАктивов0510448() Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("АмортизационнаяГруппа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("АналитическаяГруппа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ВидИмущества", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДатаОкончанияАмортизации", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ЕдИзмКод", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЕдИзмНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НФА", Справочники.ТипВсеСсылки());
	Результат.Колонки.Добавить("ИнвентарныйНомерСсылка", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	Результат.Колонки.Добавить("НаименованиеНФА", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НормаАмортизации", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ПорядокНачисления", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("МетодАмортизации", Новый ОписаниеТипов("Строка")); // определяется от "ПорядокНачисления"
	Результат.Колонки.Добавить("СрокПолезногоИспользования", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СуммаВложений", Новый ОписаниеТипов("Число"));
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НакладнаяНаВнутреннееПеремещение0510450

// Таблица шапки для печати накладная на внутреннее перемещение НФА0510450.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица шапки для печати накладная на внутреннее перемещение НФА0510450:
// * ДатаАкта - Дата
// * БюджетНаименование - Строка -
// * ГлаваБК - Строка -
// * Дата - Дата -
// * КодРПБС - Строка -
// * КодРПБСПодр - Строка -
// * НаименованиеОбособленногоПодразделения - Строка -
// * НаименованиеОрганизации - Строка -
// * НаименованиеСтруктурногоПодразделения - Строка -
// * Номер - Строка -
// * ОКТМО - Строка -
// * ОтветственныйДатаПодписи - Дата -
// * ОтветственныйДолжность - Строка -
// * ОтветственныйТелефон - Строка -
// * ОтветственныйФИО - Строка -
// * ОтветственныйЭлПочта - Строка -
// * Ссылка - ДокументСсылка
// * Учредитель - Строка -
// * ГруппыНФА - см. ТаблицаГруппыПередаваемыхОбъектовНакладнаяНаВнутреннееПеремещениеНФА0510450
// * ДолжностьОтправителя - СправочникСсылка.Должности -
// * ДолжностьПолучателя - СправочникСсылка.Должности -
// * НаименованиеДолжностиОтправителя - Строка -
// * НаименованиеДолжностиПолучателя - Строка -
// * НаименованиеПодразделенияОтправителя - Строка -
// * НаименованиеПодразделенияПолучателя - Строка -
// * НомерАкта - Строка
// * Основание - Строка -
// * ОснованиеДата - Дата -
// * ОснованиеНомер - Строка -
// * Отправитель - СправочникСсылка.Сотрудники -
// * ПодразделениеОтправитель - СправочникСсылка.Подразделения -
// * ПодразделениеПолучатель - СправочникСсылка.Подразделения -
// * Получатель - СправочникСсылка.Сотрудники -
// * ТабНомОтправитель - Строка -
// * ТабНомПолучатель - Строка -
// * ФИООтправителя - Строка -
// * ФИООтправителяРасшифровка - Строка -
// * ФИОПолучателя - Строка -
// * ФИОПолучателяРасшифровка - Строка -
Функция ТаблицаШапкиДляПечатиНакладнаяНаВнутреннееПеремещениеНФА0510450() Экспорт
	
	Результат = ТаблицаШапкиДляПечатиОбщиеРеквизиты();
	Результат.Колонки.Добавить("ДатаАкта", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ГруппыНФА", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("ДолжностьОтправителя", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	Результат.Колонки.Добавить("ДолжностьПолучателя", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	Результат.Колонки.Добавить("НаименованиеДолжностиОтправителя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеДолжностиПолучателя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеПодразделенияОтправителя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеПодразделенияПолучателя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерАкта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Основание", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОснованиеДата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ОснованиеНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Отправитель", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("ПодразделениеОтправитель", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	Результат.Колонки.Добавить("ПодразделениеПолучатель", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	Результат.Колонки.Добавить("Получатель", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("ТабНомОтправитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ТабНомПолучатель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ФИООтправителя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ФИООтправителяРасшифровка", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ФИОПолучателя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ФИОПолучателяРасшифровка", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область АктПриемаПередачиИмуществаВЛичномПользовании0510434

// Таблица шапки для печати акт приема передачи имущества в личном пользовании ф. 0510434.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
// * ДатаАкта - Дата -
// * ДатаПриказа - Дата -
// * МатериальныеЗапасы - см. ТаблицаСведенияОбОбъектахМЗДляПечатиАктПриемаПередачиИмуществаВЛичномПользовании0510434
// * МестонахождениеОтправитель - Строка -
// * МестонахождениеПолучатель - Строка -
// * НаименованиеПриказа - Строка -
// * НаименованиеСтруктурногоПодразделенияОтправитель - Строка -
// * НаименованиеСтруктурногоПодразделенияПолучатель - Строка -
// * НомерАкта - Строка -
// * НомерПриказа - Строка -
// * ОбъектыПринялДолжность - СправочникСсылка.Должности -
// * ОбъектыПринялНаименованиеДолжности - Строка -
// * ОбъектыПринялСотрудник - СправочникСсылка.Сотрудники -
// * ОбъектыПринялФИО - Строка -
// * ОбъектыСдалДолжность - СправочникСсылка.Должности -
// * ОбъектыСдалНаименованиеДолжности - Строка -
// * ОбъектыСдалСотрудник - СправочникСсылка.Сотрудники -
// * ОбъектыСдалФИО - Строка -
// * Операция - Число
// * Организация - СправочникСсылка.Организации -
// * ОсновныеСредства - см. ТаблицаСведенияОбОбъектахОСДляПечатиАктПриемаПередачиИмуществаВЛичномПользовании0510434
// * СотрудникОтправитель - СправочникСсылка.Сотрудники -
// * СотрудникПолучатель - СправочникСсылка.Сотрудники -
// * Ссылка - ДокументСсылка -
// * СтруктурноеПодразделениеОтправитель - СправочникСсылка.Подразделения -
// * СтруктурноеПодразделениеПолучатель - СправочникСсылка.Подразделения -
// * ТабельныйНомерОтправитель - Строка -
// * ТабельныйНомерПолучатель - Строка -
// * ФИООтправитель - Строка -
// * ФИОПолучатель - Строка -
Функция ТаблицаШапкиДляПечатиАктПриемаПередачиИмуществаВЛичномПользовании0510434() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ДатаАкта", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаПриказа", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("МатериальныеЗапасы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("МестонахождениеОтправитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("МестонахождениеПолучатель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеСтруктурногоПодразделенияОтправитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеСтруктурногоПодразделенияПолучатель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерАкта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОбъектыПринялДолжность", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	Результат.Колонки.Добавить("ОбъектыПринялНаименованиеДолжности", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОбъектыПринялСотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("ОбъектыПринялФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОбъектыСдалДолжность", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	Результат.Колонки.Добавить("ОбъектыСдалНаименованиеДолжности", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОбъектыСдалСотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("ОбъектыСдалФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Операция", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Колонки.Добавить("ОсновныеСредства", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("СотрудникОтправитель", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("СотрудникПолучатель", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Результат.Колонки.Добавить("СтруктурноеПодразделениеОтправитель", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	Результат.Колонки.Добавить("СтруктурноеПодразделениеПолучатель", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	Результат.Колонки.Добавить("ТабельныйНомерОтправитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ТабельныйНомерПолучатель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ФИООтправитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ФИОПолучатель", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
	
КонецФункции

// Таблица сведения об объектах ОС для печати акт приема передачи имущества в личном пользовании ф. 0510434.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
// * Дефекты - Строка -
// * ЕдиницаИзмеренияСрока - Число -
// * ИнвентарныйНомер - Строка -
// * КодВозврата - Строка -
// * НаименованиеОС - Строка -
// * НормаВыдачи - Строка -
// * ОсновноеСредство - СправочникСсылка.ОсновныеСредства -
// * ОсобыеОтметки - Строка -
// * Приспособления - Строка -
// * Сведения - Строка -
// * СрокПолезногоИспользования - Число -
// * Сумма - Число -
// * Характеристики - Строка -
Функция ТаблицаСведенияОбОбъектахОСДляПечатиАктПриемаПередачиИмуществаВЛичномПользовании0510434() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Дефекты", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЕдиницаИзмеренияСрока", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодВозврата", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НормаВыдачи", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	Результат.Колонки.Добавить("ОсобыеОтметки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Приспособления", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Сведения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СрокПолезногоИспользования", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Характеристики", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
КонецФункции

// Таблица сведения об объектах МЗ для печати акт приема передачи имущества в личном пользовании ф.0510434.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
// * Дефекты - Строка -
// * ЕдиницаИзмеренияСрока - Число -
// * КодВозврата - Строка -
// * КодЕИ - Строка -
// * Количество - Число -
// * НаименованиеЕИ - Строка -
// * НаименованиеМЗ - Строка -
// * Номенклатура - СправочникСсылка.Номенклатура -
// * НоменклатурныйНомер - Строка -
// * НормаВыдачи - Число -
// * ОсобыеОтметки - Строка -
// * Приспособления - Строка -
// * РазмерГоловногоУбора - Число -
// * РазмерИное - Число -
// * РазмерОбуви - Число -
// * РазмерОдежды - Число -
// * СрокПолезногоИспользования - Число -
// * Сумма - Число -
// * Характеристики - Строка -
Функция ТаблицаСведенияОбОбъектахМЗДляПечатиАктПриемаПередачиИмуществаВЛичномПользовании0510434() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Дефекты", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЕдиницаИзмеренияСрока", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("КодВозврата", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодЕИ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НаименованиеЕИ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеМЗ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Результат.Колонки.Добавить("НоменклатурныйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НормаВыдачи", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ОсобыеОтметки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Приспособления", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РазмерГоловногоУбора", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("РазмерИное", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("РазмерОбуви", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("РазмерОдежды", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СрокПолезногоИспользования", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Характеристики", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область АктСписанияОбъектовНФА0510454

// Таблица шапки для печати акта списания объектов НФА0510454.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица шапки для печати акта списания объектов НФА0510454:
// * АналитическаяГруппа - Строка - 
// * ВидИмущества - Строка - 
// * ДатаАкта - Дата - 
// * ДатаОснованияДляАкта - Дата - 
// * ДатаПриказа - Дата - 
// * НаименованиеПриказа - Строка - 
// * Номер - Строка - 
// * НомерОснованияДляАкта - Строка - 
// * НомерПриказа - Строка - 
// * Организация - СправочникСсылка.Организации - 
// * ОснованиеДляАкта - Строка - 
// * Ответственный - СправочникСсылка.Пользователи - 
// * Приложения - см. ТаблицаФайлыДляПечатиАктаСписанияОбъектовНФА0510454 
// * Руководитель - СправочникСсылка.Сотрудники - 
// * СведенияОбОбъектах - см. ТаблицаСведенияОбОбъектахДляПечатиАктаСписанияОбъектовНФА0510454 
// * СоставКомиссии - см. ТаблицаСоставКомиссииДляПечатиАктаСписанияОбъектовНФА0510454
// * Сотрудник - СправочникСсылка.Сотрудники - 
// * Ссылка - ДокументСсылка 
// * СтруктурноеПодразделение - СправочникСсылка.Подразделения - 
// * ТабельныйНомер - Строка - 
Функция ТаблицаШапкиДляПечатиАктаСписанияОбъектовНФА0510454() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("АналитическаяГруппа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ВидИмущества", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДатаАкта", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаОснованияДляАкта", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаПриказа", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("НаименованиеПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерОснованияДляАкта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Колонки.Добавить("ОснованиеДляАкта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Ответственный", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	Результат.Колонки.Добавить("Приложения", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Руководитель", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("СведенияОбОбъектах", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("СоставКомиссии", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Результат.Колонки.Добавить("СтруктурноеПодразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	Результат.Колонки.Добавить("ТабельныйНомер", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
КонецФункции

// Таблица сведения об объектах для печати акта списания объектов НФА 0510454.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица сведения об объектах для печати акта списания объектов НФА 0510454:
// * БалансоваяСтоимость - Число - 
// * ДатаВводаВЭксплуатацию - Дата - 
// * ДатаВыпуска - Дата - 
// * ДатаПринятияКУчету - Дата - 
// * ЗаводскойНомер - Строка - 
// * ИдентификаторСтроки - Строка - 
// * ИнвентарныйНомер - Строка - 
// * ИнвентарныйНомерСсылка - СправочникСсылка.ИнвентарныеНомераОС - 
// * ИнойНомер - Строка - 
// * КодПричинаСписания - Строка - 
// * Количество - Число - 
// * Мероприятия - Строка - 
// * НаименованиеОбъекта - Строка - 
// * НомерСтроки - Строка - 
// * ОбъектСсылка - СправочникСсылка.ОсновныеСредства, СправочникСсылка.Номенклатура - 
// * ОстаточнаяСтоимость - Число - 
// * ПричинаСписания - Строка - 
// * РеестровыйНомер - Строка - 
// * РезолюцияКомиссии - Строка - 
// * СрокЭксплуатации - Число - 
Функция ТаблицаСведенияОбОбъектахДляПечатиАктаСписанияОбъектовНФА0510454() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("БалансоваяСтоимость", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ДатаВводаВЭксплуатацию", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаВыпуска", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаПринятияКУчету", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ЗаводскойНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИнвентарныйНомерСсылка", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	Результат.Колонки.Добавить("ИнойНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодПричинаСписания", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Мероприятия", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОбъекта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОбъектСсылка", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства, СправочникСсылка.Номенклатура"));
	Результат.Колонки.Добавить("ОстаточнаяСтоимость", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ПричинаСписания", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РеестровыйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РезолюцияКомиссии", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СрокЭксплуатации", Новый ОписаниеТипов("Число"));
	Возврат Результат;
КонецФункции

// Таблица состав комиссии для печати акта списания объектов НФА 0510454.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица состав комиссии для печати акта списания объектов НФА 0510454:
// * Имя - Строка - 
// * НаименованиеДолжности - Строка - 
// * НомерСтроки - Строка - 
// * ОсобыеОтметки - Строка - 
// * Отчество - Строка - 
// * Председатель - Булево - 
// * Сотрудник - СправочникСсылка.Сотрудники - 
// * ФайлОсобогоМнения - СправочникСсылка.Файлы - 
// * Фамилия - Строка - 
Функция ТаблицаСоставКомиссииДляПечатиАктаСписанияОбъектовНФА0510454() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеДолжности", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОсобыеОтметки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Отчество", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Председатель", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("ФайлОсобогоМнения", Новый ОписаниеТипов("СправочникСсылка.Файлы"));
	Результат.Колонки.Добавить("Фамилия", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
	
КонецФункции

// Таблица файлы для печати акта списания объектов НФА 0510454.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица файлы для печати акта списания объектов НФА 0510454:
// * ИмяФайла - Строка - 
// * Описание - Строка - 
// * Расширение - Строка - 
// * Файл - СправочникСсылка.Файлы - 
Функция ТаблицаФайлыДляПечатиАктаСписанияОбъектовНФА0510454() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Расширение", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Файл", Новый ОписаниеТипов("СправочникСсылка.Файлы"));
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область НакладнаяНаОтпуск0510458

// Таблица шапки для печати накладной 0510458.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица шапки для печати накладной 0510458:
// * БюджетНаименование - Строка -
// * Валюта - СправочникСсылка.Валюты -
// * Всего - Число -
// * ГлаваБК - Строка -
// * Дата - Дата -
// * Доверенность - Строка -
// * ДоверенностьДата - Дата -
// * ДоверенностьНомер - Строка -
// * ДокументОснование - Строка -
// * ДокументОснованиеДата - Дата -
// * ДокументОснованиеНомер - Строка -
// * ИННОрганизации - Строка -
// * ИННПеревозчик - Строка -
// * ИННПолучатель - Строка -
// * КодРПБС - Строка -
// * КодРПБСПодр - Строка -
// * КодРПБСПолучателя - Строка -
// * КППОрганизации - Строка -
// * КПППеревозчик - Строка -
// * КПППолучатель - Строка -
// * НаименованиеОбособленногоПодразделения - Строка -
// * НаименованиеОрганизации - Строка -
// * НаименованиеПеревозчик - Строка -
// * НаименованиеПолучатель - Строка -
// * НаименованиеСтруктурногоПодразделения - Строка -
// * Номер - Строка -
// * ОКТМО - Строка -
// * ОтветственныйДатаПодписи - Дата -
// * ОтветственныйДолжность - Строка -
// * ОтветственныйТелефон - Строка -
// * ОтветственныйФИО - Строка -
// * ОтветственныйЭлПочта - Строка -
// * ОтпустилДатаПодписи - Дата -
// * ОтпустилДолжность - Строка -
// * ОтпустилФИО - Строка -
// * ПолучилДатаПодписи - Дата -
// * ПолучилДолжность - Строка -
// * ПолучилФИО - Строка -
// * СоставДокумента - Массив из см. ЗаголовокТабличнойЧастиДляПечатиНакладной0510458
// * Ссылка - ДокументСсылка 
// * СуммаПрописью - Строка -
// * УполномоченноеЛицоДатаПодписи - Дата -
// * УполномоченноеЛицоДолжность - Строка -
// * УполномоченноеЛицоФИО - Строка -
// * УчетныйНомерОтправитель - Строка -
// * Учредитель - Строка -
// * ЦМООтправитель - Строка -
Функция ТаблицаШапкиДляПечатиНакладной0510458() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("БюджетНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Результат.Колонки.Добавить("Всего", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ГлаваБК", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("Доверенность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДоверенностьДата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДоверенностьНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДокументОснованиеДата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДокументОснованиеНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИННОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИННПеревозчик", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИННПолучатель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодРПБС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодРПБСПодр", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодРПБСПолучателя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КППОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КПППеревозчик", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КПППолучатель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОбособленногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеПеревозчик", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеПолучатель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеСтруктурногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОКТМО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ОтветственныйДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйТелефон", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйЭлПочта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтпустилДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ОтпустилДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтпустилФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПолучилДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ПолучилДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПолучилФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СоставДокумента", Новый ОписаниеТипов("Массив"));
	Результат.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Результат.Колонки.Добавить("СуммаПрописью", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УполномоченноеЛицоДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("УполномоченноеЛицоДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УполномоченноеЛицоФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УчетныйНомерОтправитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Учредитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЦМООтправитель", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
	
КонецФункции

// Таблица состава табличной части для печати накладной0510458.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица состава табличной части для печати накладной0510458:
// * Всего - Число -
// * ЕдИзмКод - Строка -
// * ЕдИзмНаименование - Строка -
// * КодСтроки - Число -
// * КодТовара - Строка -
// * Количество - Число -
// * НФАНаименование - Строка -
// * НФАХарактеристики - Строка -
// * СтавкаНДС - ПеречислениеСсылка.СтавкиНДС -
// * Сумма - Число -
// * СуммаНДС - Число -
// * Цена - Число -
Функция ТаблицаСоставаТабличнойЧастиДляПечатиНакладной0510458()
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Всего", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ЕдИзмКод", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЕдИзмНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("КодТовара", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НФАНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НФАХарактеристики", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	Возврат Результат;
	
КонецФункции

// Заголовок табличной части для печати накладной0510458.
// 
// Возвращаемое значение:
//  Структура - Заголовок табличной части для печати накладной0510458:
// * ГруппаНФА - Строка 
// * КодГруппыНФА - Строка
// * Состав - см. ТаблицаСоставаТабличнойЧастиДляПечатиНакладной0510458
Функция ЗаголовокТабличнойЧастиДляПечатиНакладной0510458() Экспорт
	ЗаголовокТабличнойЧасти = Новый Структура;
	ЗаголовокТабличнойЧасти.Вставить("ГруппаНФА", "");
	ЗаголовокТабличнойЧасти.Вставить("КодГруппыНФА", "");
	ЗаголовокТабличнойЧасти.Вставить("Состав", ТаблицаСоставаТабличнойЧастиДляПечатиНакладной0510458());
	Возврат ЗаголовокТабличнойЧасти;
КонецФункции
	
#КонецОбласти

#Область АктОсписанииМЗ0510460

// Таблица шапки для печати акта о списании МЗ 0510460.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица шапки для печати акта о списании м з0510460:
// * БюджетНаименование - Строка -
// * ГлаваБК - Строка -
// * ГруппыНФА - Массив из см. ЗаголовокТабличнойЧастиДляПечатиАктаОСписанииМЗ0510460
// * Дата - Дата -
// * ДатаПриказа - Дата -
// * ЕстьРешениеОПрекращенииПризнанияАктивом - Булево
// * КодРПБС - Строка -
// * КодРПБСПодр - Строка -
// * МестонахождениеОбъектов - Строка -
// * НаименованиеОбособленногоПодразделения - Строка -
// * НаименованиеОрганизации - Строка -
// * НаименованиеПриказа - Строка -
// * НаименованиеСтруктурногоПодразделения - Строка -
// * НеобходимостьУничтожения - Булево -
// * Номер - Строка -
// * НомерПриказа - Строка -
// * ОКТМО - Строка -
// * ОтветственныйДатаПодписи - Дата -
// * ОтветственныйДолжность - Строка -
// * ОтветственныйТелефон - Строка -
// * ОтветственныйФИО - Строка -
// * ОтветственныйЭлПочта - Строка -
// * СоставКомиссии - см. ТаблицаКомиссияДляПечатиАктаОСписанииМЗ0510460
// * Ссылка - ДокументСсылка -
// * УполномоченноеЛицоДатаПодписи - Дата -
// * УполномоченноеЛицоДолжность - Строка -
// * УполномоченноеЛицоФИО - Строка -
// * УчетныйНомерОтправитель - Строка -
// * Учредитель - Строка -
// * Файлы - см. ТаблицаФайлыДляПечатиАктаОСписанииМЗ0510460
// * ЦМООтправитель - Строка -
Функция ТаблицаШапкиДляПечатиАктаОСписанииМЗ0510460() Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("БюджетНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ГлаваБК", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ГруппыНФА", Новый ОписаниеТипов("Массив"));
	Результат.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаПриказа", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ЕстьРешениеОПрекращенииПризнанияАктивом", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("КодРПБС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодРПБСПодр", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("МестонахождениеОбъектов", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОбособленногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеСтруктурногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НеобходимостьУничтожения", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОКТМО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ОтветственныйДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйТелефон", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйЭлПочта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СоставКомиссии", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Результат.Колонки.Добавить("УполномоченноеЛицоДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("УполномоченноеЛицоДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УполномоченноеЛицоФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УчетныйНомерОтправитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Учредитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Файлы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("ЦМООтправитель", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
	
КонецФункции

// Таблица материалы для печати акта о списании МЗ 0510460.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица материалы для печати акта о списании МЗ 0510460:
// * ЕдИзмКод - Строка -
// * ЕдИзмНаименование - Строка -
// * ИтогГолосования - Строка -
// * КодСтроки - Число -
// * Количество - Число -
// * НомерИной - Строка -
// * НомерНоменклатурный - Строка -
// * НормаРасхода - Число -
// * НФАДопНаименование - Строка -
// * НФАНаименование - Строка -
// * ПричинаСписанияКод - Строка -
// * ПричинаСписанияНаименование - Строка -
// * РезолюцияКомиссииОдобрена - Булево -
// * ГолосованиеПоСтрокеЗавершено - Булево -
// * СрокВЭксплуатации - Число -
// * Сумма - Число -
// * Цена - Число -
Функция ТаблицаМатериалыДляПечатиАктаОСписанииМЗ0510460()

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ЕдИзмКод", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЕдИзмНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИтогГолосования", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НомерИной", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерНоменклатурный", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НормаРасхода", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НФАДопНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НФАНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПричинаСписанияКод", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПричинаСписанияНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РезолюцияКомиссииОдобрена", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ГолосованиеПоСтрокеЗавершено", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("СрокВЭксплуатации", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));

	Возврат Результат;
	
КонецФункции

// Заголовок табличной части для печати акта о списании МЗ 0510460.
// 
// Возвращаемое значение:
//  Структура - Заголовок табличной части для печати акта о списании МЗ 0510460:
// * ГруппаНФА - Строка 
// * КодГруппыНФА - Строка
// * Состав - см. ТаблицаМатериалыДляПечатиАктаОСписанииМЗ0510460
Функция ЗаголовокТабличнойЧастиДляПечатиАктаОСписанииМЗ0510460() Экспорт
	ЗаголовокТабличнойЧасти = Новый Структура;
	ЗаголовокТабличнойЧасти.Вставить("ГруппаНФА", "");
	ЗаголовокТабличнойЧасти.Вставить("КодГруппыНФА", "");
	ЗаголовокТабличнойЧасти.Вставить("Состав", ТаблицаМатериалыДляПечатиАктаОСписанииМЗ0510460());
	Возврат ЗаголовокТабличнойЧасти;
КонецФункции

// Таблица комиссия для печати акта о списании МЗ 0510460.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица комиссия для печати акта о списании МЗ 0510460:
// * ИмяФайла - Строка -
// * НаименованиеДолжности - Строка -
// * Председатель - Булево -
// * ФИО - Строка -
Функция ТаблицаКомиссияДляПечатиАктаОСписанииМЗ0510460() Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеДолжности", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Председатель", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ФИО", Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
КонецФункции 

// Таблица файлы для печати акта о списании МЗ 0510460.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица файлы для печати акта о списании МЗ 0510460:
// * ИмяФайла - Строка -
// * Описание - Строка -
// * Файл - СправочникСсылка.Файлы -
Функция ТаблицаФайлыДляПечатиАктаОСписанииМЗ0510460() Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Файл", Новый ОписаниеТипов("СправочникСсылка.Файлы"));
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область АктОСписанииБСО0510461

// Таблица шапки для печати акта о списании БСО 0510461.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица шапки для печати акта о списании БСО 0510461:
// * БюджетНаименование - Строка -
// * ГлаваБК - Строка -
// * Дата - Дата -
// * ДатаПриказа - Дата -
// * КодРПБС - Строка -
// * КодРПБСПодр - Строка -
// * Комиссия - см. ТаблицаКомиссияДляПечатиАктаОСписанииБСО0510461
// * МестонахождениеОбъектов - Строка -
// * НаименованиеОбособленногоПодразделения - Строка -
// * НаименованиеОрганизации - Строка -
// * НаименованиеПриказа - Строка -
// * НаименованиеСтруктурногоПодразделения - Строка -
// * НеобходимостьУничтожения - Булево -
// * Номер - Строка -
// * НомерПриказа - Строка -
// * ОКТМО - Строка -
// * ОтветственныйДатаПодписи - Дата -
// * ОтветственныйДолжность - Строка -
// * ОтветственныйТелефон - Строка -
// * ОтветственныйФИО - Строка -
// * ОтветственныйЭлПочта - Строка -
// * СписываемыеБСО - см. ТаблицаБСОДляПечатиАктаОСписанииБСО0510461
// * Ссылка - ДокументСсылка
// * УполномоченноеЛицоДатаПодписи - Дата
// * УполномоченноеЛицоДолжность - Строка
// * УполномоченноеЛицоФИО - Строка
// * УчетныйНомерОтправитель - Строка -
// * Учредитель - Строка -
// * Файлы - см. ТаблицаФайлыДляПечатиАктаОСписанииБСО0510461
// * ЦМООтправитель - Строка -
Функция ТаблицаШапкиДляПечатиАктаОСписанииБСО0510461() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("БюджетНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ГлаваБК", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДатаПриказа", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("КодРПБС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодРПБСПодр", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("МестонахождениеОбъектов", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОбособленногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеСтруктурногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НеобходимостьУничтожения", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерПриказа", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОКТМО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ОтветственныйДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйТелефон", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйЭлПочта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("СоставКомиссии", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("СписываемыеБСО", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Результат.Колонки.Добавить("УполномоченноеЛицоДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("УполномоченноеЛицоДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УполномоченноеЛицоФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УчетныйНомерОтправитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Учредитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Файлы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("ЦМООтправитель", Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
КонецФункции

// Таблица БСОДля печати акта о списании БСО0510461.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица БСОДля печати акта о списании БСО0510461:
// * ЕдИзмКод - Строка -
// * ЕдИзмНаименование - Строка -
// * ИтогГолосования - Строка -
// * КодСтроки - Число -
// * Количество - Число -
// * Номера - Строка -
// * ПричинаСписанияКод - Строка -
// * ПричинаСписанияНаименование - Строка -
// * РезолюцияКомиссииОдобрена - Булево -
// * ГолосованиеПоСтрокеЗавершено - Булево -
// * Серия - Строка -
// * Сумма - Число -
// * Цена - Число -
Функция ТаблицаБСОДляПечатиАктаОСписанииБСО0510461() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("БСОНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЕдИзмКод", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЕдИзмНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИтогГолосования", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Номера", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПричинаСписанияКод", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПричинаСписанияНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("РезолюцияКомиссииОдобрена", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ГолосованиеПоСтрокеЗавершено", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Серия", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	Возврат Результат;	
КонецФункции

// Таблица файлы для печати акта о списании БСО0510461.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица файлы для печати акта о списании БСО0510461:
// * ИмяФайла - Строка -
// * Описание - Строка -
// * Файл - СправочникСсылка.Файлы -
Функция ТаблицаФайлыДляПечатиАктаОСписанииБСО0510461() Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Файл", Новый ОписаниеТипов("СправочникСсылка.Файлы"));
	Возврат Результат;
	
КонецФункции

// Таблица комиссия для печати акта о списании БСО0510461.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица комиссия для печати акта о списании БСО0510461:
// * ИмяФайла - Строка -
// * НаименованиеДолжности - Строка -
// * Председатель - Булево -
// * ФИО - Строка -
Функция ТаблицаКомиссияДляПечатиАктаОСписанииБСО0510461() Экспорт

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеДолжности", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Председатель", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ФИО", Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
КонецФункции 

#КонецОбласти

#Область АктСписанияЛитературы0504144
 
// Таблица шапки для печати акта списания литературы (ф. 0504144).
// 
// Возвращаемое значение:
//  ТаблицаЗначений -  Таблица шапки для печати акта списания литературы (ф. 0504144):
// * Дата - Дата - 
// * ДатаПриказа - Дата - 
// * ДолжностьПредседателяКомиссии - Строка - 
// * ИмяПредседателяКомиссии - Строка - 
// * ИНН - Строка - 
// * КодОКПО - Строка - 
// * КоличествоИтого - Число - 
// * Комиссия - см. ТаблицаКомиссияДляПечатиАктаСписанияЛитературы0504144 
// * КПП - Строка - 
// * Номер - Строка - 
// * НомерПриказа - Строка - 
// * Организация - СправочникСсылка.Организации - 
// * ОргДиректор - Строка - 
// * ОргНазв - Строка - 
// * ОтчествоПредседателяКомиссии - Строка - 
// * Подразделение - Строка - 
// * ПричинаСписания - Строка - 
// * СписокЛитературы - см. ТаблицаСписокДляПечатиАктаСписанияЛитературы0504144 
// * Ссылка - ДокументСсылка 
// * СуммаИтого - Число - 
// * СчетДебета - Строка - 
// * СчетКредита - Строка - 
// * ФамилияПредседателяКомиссии - Строка - 
Функция ТаблицаШапкиДляПечатиАктаСписанияЛитературы0504144() Экспорт
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("ДатаПриказа", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("ДолжностьПредседателяКомиссии", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ИмяПредседателяКомиссии", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("КодОКПО", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("КоличествоИтого", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Комиссия", Новый ОписаниеТипов("ТаблицаЗначений"));
	Таблица.Колонки.Добавить("КПП", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("НомерПриказа", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("ОргДиректор", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ОргНазв", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ОтчествоПредседателяКомиссии", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ПричинаСписания", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("СписокЛитературы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Таблица.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Таблица.Колонки.Добавить("СуммаИтого", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("СчетДебета", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("СчетКредита", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ФамилияПредседателяКомиссии", Новый ОписаниеТипов("Строка"));
	Возврат Таблица;
КонецФункции

// Таблица список для печати акта списания литературы (ф.0504144).
// 
// Возвращаемое значение:
//  ТаблицаЗначений -  Таблица список для печати акта списания литературы (ф. 0504144):
// * ЕдиницаИзмерения - Строка - 
// * ИнвНомер - Строка - 
// * Количество - Число - 
// * Коэффициент - Число - 
// * Название - Строка - 
// * Сумма - Число - 
// * Цена - Число - 
Функция ТаблицаСписокДляПечатиАктаСписанияЛитературы0504144() Экспорт
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ИнвНомер", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Название", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	Возврат Таблица;
КонецФункции

// Таблица комиссия для печати акта списания литературы ф (0504144).
// 
// Возвращаемое значение:
//  ТаблицаЗначений -  Таблица комиссия для печати акта списания литературы (ф. 0504144):
// * ДолжностьЧленаКомиссии - Строка - 
// * ИмяЧленаКомиссии - Строка - 
// * ОтчествоЧленаКомиссии - Строка - 
// * ФамилияЧленаКомиссии - Строка - 
Функция ТаблицаКомиссияДляПечатиАктаСписанияЛитературы0504144() Экспорт
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ДолжностьЧленаКомиссии", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ИмяЧленаКомиссии", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ОтчествоЧленаКомиссии", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ФамилияЧленаКомиссии", Новый ОписаниеТипов("Строка"));
	Возврат Таблица;
КонецФункции

#КонецОбласти

Процедура ДобавитьКомандуПечати(КомандыПечати, Идентификатор, Порядок = 50) Экспорт
	
	Если Идентификатор = "АктПриемаПередачи0504101" Тогда
		
		КомандаПечати					= КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуОбъектовОС";
		КомандаПечати.Идентификатор		= Идентификатор;
		КомандаПечати.Представление		= ПредставлениеКомандыПечати(НСтр("ru = 'Акт о приеме-передаче НФА'"), "0504101", "52н",, Истина);
		КомандаПечати.Порядок			= Порядок;
		ПервичныеДокументыБГУ.ДобавитьУсловиеКомандыПечати(КомандаПечати);
		
	ИначеЕсли Идентификатор = "АктПриемаПередачи0504101_103н" Тогда
		
		КомандаПечати					= КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуОбъектовОС";
		КомандаПечати.Идентификатор		= Идентификатор;
		КомандаПечати.Представление		= ПредставлениеКомандыПечати(НСтр("ru = 'Акт о приеме-передаче НФА'"), "0504101", "52н", "103н", Истина);
		КомандаПечати.Порядок			= Порядок;
		ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
		
	ИначеЕсли Идентификатор = "СправкаОСодержанииДрагМатериалов" Тогда
		
		КомандаПечати					= КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати	= "Документ.ПоступлениеМЗ";
		КомандаПечати.Идентификатор		= Идентификатор;
		КомандаПечати.Представление		= НСтр("ru = 'Справка о содержании драг. материалов'");
		КомандаПечати.Порядок			= Порядок;
		
	ИначеЕсли Идентификатор = "СправкаОбИзмененииСодержанияДрагМатериалов" Тогда
		
		КомандаПечати					= КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати	= "Документ.ИзменениеНаличияДрагМатериалов";
		КомандаПечати.Идентификатор		= Идентификатор;
		КомандаПечати.Представление		= НСтр("ru = 'Справка об изменении содержания драг. материалов в НФА'");
		КомандаПечати.Порядок			= Порядок;
		
	ИначеЕсли Идентификатор = "СправкаОСодержанииДрагМатериаловДляВнутреннегоПеремещения" Тогда

		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати	= "Документ.НакладнаяНаВнутреннееПеремещениеОС2";
		КомандаПечати.Идентификатор		= Идентификатор;
		КомандаПечати.Представление		= НСтр("ru = 'Справка о содержании драг. материалов при передаче НФА между МОЛ'");
		КомандаПечати.Порядок			= Порядок;
		
	ИначеЕсли Идентификатор = "СправкаОСодержанииДрагМатериаловПриСписании" Тогда

		КомандаПечати					= КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати	= "Документ.СписаниеОбъектовОС";
		КомандаПечати.Идентификатор		= Идентификатор;
		КомандаПечати.Представление		= НСтр("ru = 'Справка о содержании драг. материалов при списании НФА'");
		КомандаПечати.Порядок			= Порядок;

	ИначеЕсли Идентификатор = "ТребованиеНакладная0510451_100н" Тогда
		
		КомандаПечати					= КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати	= "Документ.ТребованиеНакладная0315006";
		КомандаПечати.Идентификатор		= "ТребованиеНакладная0510451_100н";
		КомандаПечати.Представление		= ПредставлениеКомандыПечати(НСтр("ru = 'Требование - накладная'"), "0510451", "61н", "100н");
		КомандаПечати.Порядок			= Порядок;
		ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
		
	ИначеЕсли Идентификатор = "РасчетныйДокументБезККТ" Тогда
		
		КомандаПечати					= КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати	= "Документ.ЧекККМ";
		КомандаПечати.Идентификатор		= Идентификатор;
		КомандаПечати.Представление		= НСтр("ru = 'Расчетный документ без применения ККТ (Пост. № 296 от 15.03.2017)'");
		КомандаПечати.Порядок			= Порядок;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует текст команды печати вида "<(устарел)> <Название формы> (ф. <КодФормы>) (<Приказ>, ред. <РедакцияПриказа>)
//
// Параметры:
//  НазваниеФормы	 - Текст
//  НомерФормы		 - Текст
//  Приказ			 - Текст
//  Редакция		 - Текст
//  Устарела		 - Булево
// 
// Возвращаемое значение:
//  Строка
//
Функция ПредставлениеКомандыПечати(НазваниеФормы, НомерФормы = "", Приказ = "", Редакция = "", Устарела = Ложь) Экспорт
	
	ЧастиПредставления = Новый Массив;
	
	Если Устарела Тогда
		ЧастиПредставления.Добавить(НСтр("ru = '(устарел)'"));
	КонецЕсли;
	ЧастиПредставления.Добавить(НазваниеФормы);
	Если ЗначениеЗаполнено(НомерФормы) Тогда
		ЧастиПредставления.Добавить(СтрШаблон(НСтр("ru = '(ф. %1)'"), НомерФормы));
	КонецЕсли;
	Если ЗначениеЗаполнено(Приказ) Тогда
		Если ЗначениеЗаполнено(Редакция) Тогда
			НомерПриказа = СтрШаблон(НСтр("ru = '(%1, ред. %2)'"), Приказ, Редакция);
		Иначе
			НомерПриказа = СтрШаблон(НСтр("ru = '(%1)'"), Приказ);
		КонецЕсли;
		ЧастиПредставления.Добавить(НомерПриказа);
	КонецЕсли;
	
	Возврат СтрСоединить(ЧастиПредставления, " ");
	
КонецФункции


// Формирует табличный документ "требование накладная М-11".
// Пример вызова без запроса к движениям документа см. в документе "ВыпускПродукцииСоСчета106".
// Пример вызова с запросом к движениям документа см. в документе "ТребованиеНакладная0315006".
// Параметры:
//	РезультатЗапроса - Массив - результат выполнения пакета запросов.
//							1 запрос пакета - запрос к основной таблице документа. Без итогов.
//							2 запрос пакета - запрос к таблице документа. С итогом по "Ссылка"
//							3 запрос пакета - запрос к движениям документа. С итогом по "Регистратор". Необязателен.
//	ОбъектыПечати - СписокЗначений - передается дальше, в процедуру УправлениеПечатью.ЗадатьОбластьПечатиДокумента
//
// Возвращаемое значение:
//	Табличный документ
//
Функция ПечатьТребованияНакладнойМ11(РезультатЗапроса, ОбъектыПечати) Экспорт
	Перем ВыборкаВсеДвижения;
	
	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Материал");
	ТаблицаДвижений.Колонки.Добавить("СчетДт");
	ТаблицаДвижений.Колонки.Добавить("КПСДт");
	ТаблицаДвижений.Колонки.Добавить("КЭКДт");
	ТаблицаДвижений.Колонки.Добавить("СчетКт");
	ТаблицаДвижений.Колонки.Добавить("КПСКт");
	ТаблицаДвижений.Колонки.Добавить("КЭККт");
	ТаблицаДвижений.Колонки.Добавить("КФО");
	ТаблицаДвижений.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаДвижений.Колонки.Добавить("КоличествоКт", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаДвижений.Колонки.Добавить("УчтеноКоличество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаДвижений.Колонки.Добавить("УчтеноСумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ТребованиеНакладнаяМ11";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ТребованиеНакладнаяМ11");
	ОбластьПредупреждение	= Макет.ПолучитьОбласть("Предупреждение");
	ОбластьЗаголовок		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьИтог				= Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал			= Макет.ПолучитьОбласть("Подвал");
	ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");

	ПервыйДокумент = Истина;
	ВыборкаДокументов = РезультатЗапроса[0].Выбрать();
	ВыборкаВсеСтроки = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЕстьВыборкаДвижения = РезультатЗапроса.Количество() > 2;
	Если ЕстьВыборкаДвижения Тогда
		ВыборкаВсеДвижения = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ЕстьВыборкаДвижения Тогда
			ТаблицаДвижений.Очистить();
			ВыборкаВсеДвижения.Сбросить();
			Если ВыборкаВсеДвижения.НайтиСледующий(Новый Структура("Регистратор", ВыборкаДокументов.Ссылка)) Тогда
				ВыборкаДвижений = ВыборкаВсеДвижения.Выбрать();
			
				Пока ВыборкаДвижений.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(ТаблицаДвижений.Добавить(), ВыборкаДвижений);
				КонецЦикла;
			КонецЕсли;
			ТаблицаДвижений.Свернуть("Материал, СчетДт, КПСДт, КЭКДт, СчетКт, КПСКт, КЭККт, КФО",
				"Сумма, КоличествоКт, УчтеноКоличество, УчтеноСумма");
			
		КонецЕсли;
		
		// вывод шапки
		
		СтруктураОбластьШапка = Новый Структура;
		СтруктураОбластьШапка.Вставить("пДата",Формат(ВыборкаДокументов.Дата, "ДЛФ=D"));
		СтруктураОбластьШапка.Вставить("пМолПолучатель",
			Справочники.Контрагенты.ФамилияИО(ВыборкаДокументов.МолПолучатель,Истина,ВыборкаДокументов.Дата));
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаДокументов, "ОтпускРазрешил") Тогда
			ОтпускРазрешил = Справочники.Контрагенты.ФамилияИО(ВыборкаДокументов.ОтпускРазрешил,Истина,ВыборкаДокументов.Дата);
		Иначе
			ОтпускРазрешил = "";
		КонецЕсли;
		СтруктураОбластьШапка.Вставить("РазрешилФИО", ОтпускРазрешил);
		СтруктураОбластьШапка.Вставить("пНомер",
			ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаДокументов.Ссылка,ВыборкаДокументов.Номер));
		
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьЗаголовок.Параметры.Заполнить(СтруктураОбластьШапка);

		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// вывод таблицы
		
		ИтогоЗатребовано = 0;
		ИтогоКоличество = 0;
		ИтогоСумма = 0;
		
		ВыборкаВсеСтроки.Сбросить();
		Если ВыборкаВсеСтроки.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокументов.Ссылка)) Тогда
			ВыборкаСтрок = ВыборкаВсеСтроки.Выбрать();
			
			Пока ВыборкаСтрок.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаСтрок);
				
				СтруктураОбластьСтрока = Новый Структура("пСчетМЦ");
				СтруктураОбластьСтрока.Вставить("пКоличество", ВыборкаСтрок.пКоличество);
				СтруктураОбластьСтрока.Вставить("пЗатребовано", ВыборкаСтрок.пЗатребовано);
				
				Если НЕ ЕстьВыборкаДвижения Тогда
					
					ТипКЭКПоУчетнойПолитике = БухгалтерскийУчетПовтИсп.ТипКЭКПоУчетнойПолитике(
						ВыборкаДокументов.Организация, ВыборкаДокументов.ИФО,
						ВыборкаСтрок.КФО, ВыборкаДокументов.Дата);
					
					Если ТипКЭКПоУчетнойПолитике = Перечисления.ТипыАналитическихПризнаков.ПроизвольнаяКлассификация Тогда
						
						ИспользуемыйКЭК = БухгалтерскийУчетПовтИсп.КЭК0();
						
					Иначе
						
						ИспользуемыйКЭК = ВыборкаСтрок.КЭК;
						
					КонецЕсли;
					
					СтруктураОбластьСтрока.пСчетМЦ = ПредставлениеРабочегоСчета(ВыборкаСтрок.КПС,
						ВыборкаСтрок.КФО, ВыборкаСтрок.Счет, ИспользуемыйКЭК);
					СтруктураОбластьСтрока.Вставить("пСумма", ВыборкаСтрок.пСумма);
					СтруктураОбластьСтрока.Вставить("пЦена", ВыборкаСтрок.пЦена);
				Иначе
					
					Отбор = Новый Структура;
					Отбор.Вставить("Материал",	ВыборкаСтрок.Номенклатура);
					Отбор.Вставить("СчетКт",	ВыборкаСтрок.Счет);
					Отбор.Вставить("КПСКт",		ВыборкаСтрок.КПС);
					Отбор.Вставить("КФО",		ВыборкаСтрок.КФО);
					
					Сумма = 0;
					УчтеноКоличество = 0;
					
					СтрокиДвижений = ТаблицаДвижений.НайтиСтроки(Отбор);
					Для каждого ТекСтрокаДвижения Из СтрокиДвижений Цикл
						
						Если ТекСтрокаДвижения.КоличествоКт = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						Если УчтеноКоличество = ВыборкаСтрок.пКоличество Тогда
							Прервать;
						КонецЕсли;
					
						КоличествоПоСтроке = Мин(ВыборкаСтрок.пКоличество,
							ТекСтрокаДвижения.КоличествоКт - ТекСтрокаДвижения.УчтеноКоличество);
						Если КоличествоПоСтроке = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						Если КоличествоПоСтроке = (ТекСтрокаДвижения.КоличествоКт - ТекСтрокаДвижения.УчтеноКоличество) Тогда
							УчтеноСумма = ТекСтрокаДвижения.Сумма - ТекСтрокаДвижения.УчтеноСумма;
						Иначе
							УчтеноСумма = Окр(КоличествоПоСтроке * ТекСтрокаДвижения.Сумма
								/ ТекСтрокаДвижения.КоличествоКт, 2);
						КонецЕсли;
						
						УчтеноКоличество = УчтеноКоличество + КоличествоПоСтроке;
						Сумма = Сумма + УчтеноСумма;
						
						ТекСтрокаДвижения.УчтеноКоличество = ТекСтрокаДвижения.УчтеноКоличество + КоличествоПоСтроке;
						ТекСтрокаДвижения.УчтеноСумма = ТекСтрокаДвижения.УчтеноСумма + Сумма;
						
						СтруктураОбластьСтрока.пСчетМЦ = ПредставлениеРабочегоСчета(ТекСтрокаДвижения.КПСКт,
							ТекСтрокаДвижения.КФО, ТекСтрокаДвижения.СчетКт, ТекСтрокаДвижения.КЭККт);
						
					КонецЦикла;
					
					СтруктураОбластьСтрока.Вставить("пСумма", Сумма);
					СтруктураОбластьСтрока.Вставить("пЦена",
						Окр(Сумма / ?(ВыборкаСтрок.пКоличество = 0, 1, ВыборкаСтрок.пКоличество), 2));
					
				КонецЕсли;

				ОбластьСтрока.Параметры.Заполнить(СтруктураОбластьСтрока);
				
				СтруктураНаименование = Новый Структура("пНоменклатура, НоменклатураНаименование, НоменклатураНаименованиеПолное");
				ЗаполнитьЗначенияСвойств(СтруктураНаименование, ВыборкаСтрок);
				Если ЗначениеЗаполнено(СтруктураНаименование.НоменклатураНаименованиеПолное) Тогда
					СтруктураНаименование.пНоменклатура = СтруктураНаименование.НоменклатураНаименованиеПолное;
				ИначеЕсли ЗначениеЗаполнено(СтруктураНаименование.НоменклатураНаименование) Тогда
					СтруктураНаименование.пНоменклатура = СтруктураНаименование.НоменклатураНаименование;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СтруктураНаименование.НоменклатураНаименованиеПолное) Тогда
					СтруктураНаименование.Удалить("НоменклатураНаименованиеПолное");
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СтруктураНаименование.НоменклатураНаименование) Тогда
					СтруктураНаименование.Удалить("НоменклатураНаименование");
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СтруктураНаименование.пНоменклатура) Тогда
					СтруктураНаименование.Удалить("пНоменклатура");
				КонецЕсли;
				Если ЗначениеЗаполнено(СтруктураНаименование) Тогда
					ОбластьСтрока.Параметры.Заполнить(СтруктураНаименование);
				КонецЕсли;

				ТабличныйДокумент.Вывести(ОбластьСтрока);

				ИтогоЗатребовано = ИтогоЗатребовано + ВыборкаСтрок.пЗатребовано;
				ИтогоКоличество = ИтогоКоличество + ВыборкаСтрок.пКоличество;
				ИтогоСумма = ИтогоСумма + СтруктураОбластьСтрока.пСумма;
				
			КонецЦикла;
			
		КонецЕсли;
		
		СтруктураОбластьИтог = Новый Структура;
		СтруктураОбластьИтог.Вставить("пЗатребованоИтог", ИтогоЗатребовано);
		СтруктураОбластьИтог.Вставить("пКоличествоИтог", ИтогоКоличество);
		СтруктураОбластьИтог.Вставить("пСуммаИтог", ИтогоСумма);
		
		ОбластьИтог.Параметры.Заполнить(СтруктураОбластьИтог);
		
		ТабличныйДокумент.Вывести(ОбластьИтог);
		
		// вывод подвала
		СтруктураОбластьПодвал = Новый Структура;
		СтруктураОбластьПодвал.Вставить("пДолжностьМол", "");
		СтруктураОбластьПодвал.Вставить("пФиоМол", "");
		СтруктураОбластьПодвал.Вставить("пДолжностьМолПолучатель", "");
		СтруктураОбластьПодвал.Вставить("пФиоМолПолучатель", "");
		Если ЗначениеЗаполнено(ВыборкаДокументов.МолОтправитель) Тогда
			ДанныеСотрудника = Новый Структура("Фамилия, Имя, Отчество, Должность");
			ДанныеСотрудника.Вставить("СсылкаНаОбъект",	ВыборкаДокументов.МолОтправитель);
			ДанныеСотрудника.Вставить("Период",			ВыборкаДокументов.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураОбластьПодвал.пДолжностьМол	= ДанныеСотрудника.Должность;
			СтруктураОбластьПодвал.пФиоМол			= КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
			
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокументов.МолПолучатель) Тогда
			ДанныеСотрудника = Новый Структура("Фамилия, Имя, Отчество, Должность");
			ДанныеСотрудника.Вставить("СсылкаНаОбъект",	ВыборкаДокументов.МолПолучатель);
			ДанныеСотрудника.Вставить("Период",			ВыборкаДокументов.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураОбластьПодвал.пДолжностьМолПолучатель	= ДанныеСотрудника.Должность;
			СтруктураОбластьПодвал.пФиоМолПолучатель		= КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
			
		КонецЕсли;
		ОбластьПодвал.Параметры.Заполнить(СтруктураОбластьПодвал);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Формирует табличный документ "Ведомость выдачи МЗ на нужды учреждения"
// Параметры:
//	РезультатЗапроса - Массив - Результат выполнения пакета запросов
//						РезультатЗапроса[0] - Выборка шапки документов. Без итогов.
//						РезультатЗапроса[1] - Сводные проводки документов. Итоги по ссылке.
//						РезультатЗапроса[2] - ЦМО документов. Итоги по ссылке.
//						РезультатЗапроса[3] - номенклатура документов. Итоги по ссылке.
//						РезультатЗапроса[4] - таблица "Номенклатура" документов. Без итогов.
//						РезультатЗапроса[5] - движения, сгруппированные по номенклатуре и счету. Итоги по ссылке.
//	ОбъектыПечати - СписокЗначений - передается дальше, в процедуру УправлениеПечатью.ЗадатьОбластьПечатиДокумента
//
// Возвращаемое значение:
//	Табличный документ
//
Функция ПечатьВедомостиВыдачиНФА_0504210(РезультатЗапроса, ОбъектыПечати, ИмяМакета = "ПФ_MXL_ВедомостьВыдачиНФА_0504210") Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ВедомостьНаВыдачуНаНуждыУчреждения";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет." + ИмяМакета);
	
	ОблПервыйЛист1 	= Макет.ПолучитьОбласть("ПервыйЛист1");
	ОблПервыйЛист2 	= Макет.ПолучитьОбласть("ПервыйЛист2");
	ОблПервыйЛист3 	= Макет.ПолучитьОбласть("ПервыйЛист3");
	ОблПервыйЛистПС	= Макет.ПолучитьОбласть("ПервыйЛистПустаяСтрока");
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	ОблИтого = Макет.ПолучитьОбласть("Итого");
	
	ПервыйДокумент = Истина;
	
	ВыборкаШапка				= РезультатЗапроса[0].Выбрать();
	ВыборкаСводныеПроводки		= РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаЦМОДокументов		= РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаМатериалыДокументов	= РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицыВсехДокументов		= РезультатЗапроса[4].Выгрузить();
	ТаблицыВсехДокументов.Индексы.Добавить("Ссылка");
	ДвиженияМатериалов			= РезультатЗапроса[5].Выгрузить();
	ДвиженияМатериалов.Индексы.Добавить("Ссылка, Номенклатура");
	
	ВыведенныеСуммы = Новый ТаблицаЗначений;
	ВыведенныеСуммы.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВыведенныеСуммы.Колонки.Добавить("Количество",	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ВыведенныеСуммы.Колонки.Добавить("Сумма",		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Первый лист
		
		ПараметрыЗаполнения = Новый Структура(
			"ОрганизацияНаименование, ОрганизацияКодОКПО, ПодразделениеНаименование, Дата");
		ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ВыборкаШапка);
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаШапка, "Руководитель") И ЗначениеЗаполнено(ВыборкаШапка.Руководитель) Тогда
			ДанныеРуководителя = Справочники.Сотрудники.ДанныеСотрудника(ВыборкаШапка.Руководитель,
				"Фамилия,Имя,Отчество,НаименованиеПолное,ДолжностьНаименование",
				ВыборкаШапка.Дата);
			ПараметрыЗаполнения.Вставить("РуководительФИО", 
				КорреспондентыКлиентСервер.ФИО(ДанныеРуководителя, Истина));
		Иначе
			Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
				Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ВыборкаШапка.Организация, ВыборкаШапка.Дата, ВыборкаШапка.Подразделение);
			ПараметрыЗаполнения.Вставить("РуководительФИО", 
				КорреспондентыКлиентСервер.ФИО(Руководитель.ОтветственноеЛицоФИО, Истина));
		КонецЕсли;
		ГлБухгалтер = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
			Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, ВыборкаШапка.Организация, ВыборкаШапка.Дата, ВыборкаШапка.Подразделение);
		ПараметрыЗаполнения.Вставить("ГлБухгалтерФИО", 
			КорреспондентыКлиентСервер.ФИО(ГлБухгалтер.ОтветственноеЛицоФИО, Истина));
		ДанныеСотрудника = Новый Структура(
			"СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность, НаименованиеПолное", 
			ВыборкаШапка.МОЛ, ВыборкаШапка.Дата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		ПараметрыЗаполнения.Вставить("МОЛНаименование",	ДанныеСотрудника.НаименованиеПолное);
		ПараметрыЗаполнения.Вставить("МолДолжность",	ДанныеСотрудника.Должность);
		ПараметрыЗаполнения.Вставить("МОЛФио", 			КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		Если ТипЗнч(ВыборкаШапка.ОтветственныйИсполнитель) = Тип("СправочникСсылка.Сотрудники") Тогда
			
			ДанныеСотрудника = Новый Структура(
				"СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность, НаименованиеПолное",
				ВыборкаШапка.ОтветственныйИсполнитель, ВыборкаШапка.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина, Истина);
			
			ПараметрыЗаполнения.Вставить("ИсполнительНаименование"	, ДанныеСотрудника.НаименованиеПолное);
			ПараметрыЗаполнения.Вставить("ИсполнительДолжность"		, ДанныеСотрудника.Должность);
			ПараметрыЗаполнения.Вставить("ФИОИсполнитель"			, КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
			ПараметрыЗаполнения.Вставить("ТелефонИсполнитель"		, ДанныеСотрудника.ТелефонРабочийФизическиеЛица);
			ПараметрыЗаполнения.Вставить("ЭлАдресИсполнитель"		, ДанныеСотрудника.EmailФизическиеЛица);
			
		ИначеЕсли ТипЗнч(ВыборкаШапка.ОтветственныйИсполнитель) = Тип("СправочникСсылка.Пользователи") Тогда
			
			СведенияИсполнителя = СведенияИсполнителяПоОтветственному(ВыборкаШапка.ОтветственныйИсполнитель,
				ВыборкаШапка.Организация, ВыборкаШапка.Дата, Истина);
			
			ПараметрыЗаполнения.Вставить("ИсполнительНаименование"	, СведенияИсполнителя.Исполнитель);
			ПараметрыЗаполнения.Вставить("ИсполнительДолжность"		, СведенияИсполнителя.ДолжностьНаименование);
			ПараметрыЗаполнения.Вставить("ФИОИсполнитель"			, СведенияИсполнителя.ФИО);
			ПараметрыЗаполнения.Вставить("ТелефонИсполнитель"		, СведенияИсполнителя.НомерТелефона);
			ПараметрыЗаполнения.Вставить("ЭлАдресИсполнитель"		, СведенияИсполнителя.ЭлектроннаяПочта);
			
		КонецЕсли;
		
		ПараметрыЗаполнения.Вставить("ТекстДата",		Формат(ВыборкаШапка.Дата, "ДЛФ=DD"));
		ПараметрыЗаполнения.Вставить("пНомер", 			ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаШапка.Ссылка, ВыборкаШапка.Номер));
		
		ОблПервыйЛист1.Параметры.Заполнить(ПараметрыЗаполнения);
		ТабличныйДокумент.Вывести(ОблПервыйЛист1);
		
		// Вывод сводных проводок на титульный лист
		
		ВыборкаСводныеПроводки.Сбросить();
		Если ВыборкаСводныеПроводки.НайтиСледующий(Новый Структура("Ссылка", ВыборкаШапка.Ссылка)) Тогда
			СводныеПроводкиДокумента = ВыборкаСводныеПроводки.Выбрать();
			Пока СводныеПроводкиДокумента.Следующий() Цикл
				ПараметрыЗаполненияПроводки = Новый Структура;
				ПараметрыЗаполненияПроводки.Вставить("СчетДт", ПредставлениеРабочегоСчета(
					СводныеПроводкиДокумента.КПСДтПредставление,
					СводныеПроводкиДокумента.КФОПредставление,
					СводныеПроводкиДокумента.СчетДтПредставление,
					СводныеПроводкиДокумента.КЭКДтПредставление));
				ПараметрыЗаполненияПроводки.Вставить("СчетКт", ПредставлениеРабочегоСчета(
					СводныеПроводкиДокумента.КПСКтПредставление,
					СводныеПроводкиДокумента.КФОПредставление,
					СводныеПроводкиДокумента.СчетКтПредставление,
					СводныеПроводкиДокумента.КЭККтПредставление));
				ОблПервыйЛист2.Параметры.Заполнить(ПараметрыЗаполненияПроводки);
				ТабличныйДокумент.Вывести(ОблПервыйЛист2);
			КонецЦикла;
		Иначе
			ПараметрыЗаполненияПроводки = Новый Структура("СчетДт, СчетКт");
			ОблПервыйЛист2.Параметры.Заполнить(ПараметрыЗаполненияПроводки);
			Для Счетчик=1 По 4 Цикл
				ТабличныйДокумент.Вывести(ОблПервыйЛист2);
			КонецЦикла;
		КонецЕсли;
		
		// Вывод подписей в низ титульного листа
		
		ОблПервыйЛист3.Параметры.Заполнить(ПараметрыЗаполнения);
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОблПервыйЛистПС);
		МассивОбластейДляПроверки.Добавить(ОблПервыйЛист3);
		Пока ТабличныйДокумент.ПроверитьВывод(МассивОбластейДляПроверки) Цикл
			ТабличныйДокумент.Вывести(ОблПервыйЛистПС);
		КонецЦикла;
		ТабличныйДокумент.Вывести(ОблПервыйЛист3);
		
		// Второй и последующие листы
		
		ВыборкаЦМОДокументов.Сбросить();
		ВыборкаЦМОДокументов.НайтиСледующий(Новый Структура("Ссылка", ВыборкаШапка.Ссылка));
		ВыборкаМатериалыДокументов.Сбросить();
		ВыборкаМатериалыДокументов.НайтиСледующий(Новый Структура("Ссылка", ВыборкаШапка.Ссылка));
		ВыборкаЦМО = ВыборкаЦМОДокументов.Выбрать();
		ВыборкаМатериалы = ВыборкаМатериалыДокументов.Выбрать();
		ТаблицаДокумента = ТаблицыВсехДокументов.Скопировать(Новый Структура("Ссылка", ВыборкаШапка.Ссылка));
		
		МассивЦМО = Новый Массив;
		МассивТМЦ = Новый Массив;
		МассивДанныхТМЦ = Новый Массив;
		МассивДанныхЦМО = Новый Массив;
		МассивКоличествоВсего = Новый Массив(10);
		МассивКоличествНаСтранице = Новый Массив(10);
		Для Индекс = 0 По 9 Цикл
			МассивКоличествоВсего[Индекс] = 0;
			МассивКоличествНаСтранице[Индекс] = 0;
		КонецЦикла; 
		ТаблицаПечати = Новый ТаблицаЗначений;
		Инд=0;
		ИтогиВыведенныхМатериалов = Новый Соответствие;
		Пока ВыборкаМатериалы.Следующий() Цикл
			МассивТМЦ.Добавить(ВыборкаМатериалы.Номенклатура);
			ДанныеТМЦ = Новый Структура;
			ДанныеТМЦ.Вставить("НаименованиеМатериал",	ВыборкаМатериалы.НаименованиеМатериал);
			ДанныеТМЦ.Вставить("КодМатериал",			ВыборкаМатериалы.КодМатериал);
			ДанныеТМЦ.Вставить("НаименованиеЕдИзм",		ВыборкаМатериалы.НаименованиеЕдИзм);
			ДанныеТМЦ.Вставить("КодЕдИзм",				ВыборкаМатериалы.КодЕдИзм);
			МассивДанныхТМЦ.Добавить(ДанныеТМЦ);
			
			ИтогиВыведенныхМатериалов.Вставить(ВыборкаМатериалы.Номенклатура,
				Новый Структура("Количество, Сумма", 0, 0));
			
			ТаблицаПечати.Колонки.Добавить("Инд" + Формат(Инд, "ЧГ=0"), Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
			Инд = Инд + 1;
		КонецЦикла;
		// количество колонок должно быть кратно 10
		ТребуемоеЧислоКолонок = Цел(ТаблицаПечати.Колонки.Количество()/10) * 10 
			+ Окр(ТаблицаПечати.Колонки.Количество()%10 + 4, -1);
		Пока ТаблицаПечати.Колонки.Количество() < ТребуемоеЧислоКолонок Цикл
			ТаблицаПечати.Колонки.Добавить("Инд" + Формат(Инд, "ЧГ=0"), Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
			Инд = Инд + 1;
		КонецЦикла;
		ТаблицаПечати.Колонки.Добавить("ИндексЦМО",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,0)));
		
		ТекИндексЦМО = 0;
		Пока ВыборкаЦМО.Следующий() Цикл
			МассивЦМО.Добавить(ВыборкаЦМО.ЦМОПолучатель);
			ТаблицаПечати.Добавить()["ИндексЦМО"] = ТекИндексЦМО;
			ТекИндексЦМО = ТекИндексЦМО + 1;
			МассивДанныхЦМО.Добавить(
				Справочники.Сотрудники.ФамилияИО(ВыборкаЦМО.Сотрудник, Истина, ВыборкаШапка.Дата));
		КонецЦикла; 
		Для каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		
			ИндексТМЦ = МассивТМЦ.Найти(СтрокаДокумента.Номенклатура);
			ИндексЦМО = МассивЦМО.Найти(СтрокаДокумента.ЦМОПолучатель);
			ТаблицаПечати[ИндексЦМО][ИндексТМЦ] = ТаблицаПечати[ИндексЦМО][ИндексТМЦ] + СтрокаДокумента.Количество;
		
		КонецЦикла;
		
		КоличествоСтраницВШирину = (ТаблицаПечати.Колонки.Количество() - 1) / 10;
		МаксИндексТМЦ = МассивТМЦ.ВГраница();
		
		Для ИндексСтраницы = 1 По КоличествоСтраницВШирину Цикл
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
			Для Индекс = 0 По 9 Цикл
				МассивКоличествНаСтранице[Индекс] = 0;
			КонецЦикла; 
			
			ИндексКолонки = 0;
			ПараметрыШапкиТаблицы = Новый Структура;
			Для Индекс = 1 По 10 Цикл
			
				РеальныйИндексТМЦ = (Индекс - 1) + 10 * (ИндексСтраницы - 1);
				
				Если РеальныйИндексТМЦ > МаксИндексТМЦ Тогда
					ПараметрыШапкиТаблицы.Вставить("НаименованиеМатериал"	+ Индекс, "");
					ПараметрыШапкиТаблицы.Вставить("КодМатериал"			+ Индекс, "");
					ПараметрыШапкиТаблицы.Вставить("НаименованиеЕдИзм"		+ Индекс, "");
					ПараметрыШапкиТаблицы.Вставить("КодЕдИзм"				+ Индекс, "");
				Иначе
					ПараметрыШапкиТаблицы.Вставить("НаименованиеМатериал"	+ Индекс,
						МассивДанныхТМЦ[РеальныйИндексТМЦ].НаименованиеМатериал);
					ПараметрыШапкиТаблицы.Вставить("КодМатериал"			+ Индекс,
						МассивДанныхТМЦ[РеальныйИндексТМЦ].КодМатериал);
					ПараметрыШапкиТаблицы.Вставить("НаименованиеЕдИзм"		+ Индекс,
						МассивДанныхТМЦ[РеальныйИндексТМЦ].НаименованиеЕдИзм);
					ПараметрыШапкиТаблицы.Вставить("КодЕдИзм"				+ Индекс,
						МассивДанныхТМЦ[РеальныйИндексТМЦ].КодЕдИзм);
				КонецЕсли;
			
			КонецЦикла;
			
			ТребуетсяВывестиШапкуСтраницы = Истина;
			Для Каждого СтрокаНаПечать Из ТаблицаПечати Цикл
				
				ПараметрыСтрокиТаблицы = Новый Структура;
				ПараметрыСтрокиТаблицы.Вставить("СотрудникФИО", МассивДанныхЦМО[СтрокаНаПечать.ИндексЦМО]);
				Для Индекс = 1 По 10 Цикл
					
					ТекущееКоличество = СтрокаНаПечать[(Индекс - 1) + (ИндексСтраницы - 1) * 10];
					ПараметрыСтрокиТаблицы.Вставить("КоличествоМатериал" + Индекс, ТекущееКоличество);
				
				КонецЦикла; 
				ОблСтрока.Параметры.Заполнить(ПараметрыСтрокиТаблицы);
				
				ПроверяемыйМассив = Новый Массив;
				ПроверяемыйМассив.Добавить(ОблИтого);
				ПроверяемыйМассив.Добавить(ОблСтрока);
				
				Если НЕ ТабличныйДокумент.ПроверитьВывод(ПроверяемыйМассив) Тогда
					
					ВывестиПодвалВедомостиНаВыдачу(ТабличныйДокумент, ОблИтого, ВыборкаШапка.Ссылка,
						ДвиженияМатериалов, МассивТМЦ, МассивКоличествНаСтранице,ИндексСтраницы);
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТребуетсяВывестиШапкуСтраницы = Истина;
					
				КонецЕсли;
				
				Если ТребуетсяВывестиШапкуСтраницы Тогда
					
					ОблШапка.Параметры.Заполнить(ПараметрыШапкиТаблицы);
					ТабличныйДокумент.Вывести(ОблШапка);
					ТребуетсяВывестиШапкуСтраницы = Ложь;
					
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОблСтрока);
				
				Для Индекс = 1 По 10 Цикл
					
					ТекущееКоличество = СтрокаНаПечать[(Индекс - 1) + (ИндексСтраницы - 1) * 10];
					МассивКоличествНаСтранице[Индекс - 1] = МассивКоличествНаСтранице[Индекс - 1]
															+ ТекущееКоличество;
					МассивКоличествоВсего[Индекс - 1] = МассивКоличествоВсего[Индекс - 1] + ТекущееКоличество;
				
				КонецЦикла; 
				
			КонецЦикла;
			
			ОблСтрока = Макет.ПолучитьОбласть("Строка");
			ПроверяемыйМассив = Новый Массив;
			ПроверяемыйМассив.Добавить(ОблИтого);
			ПроверяемыйМассив.Добавить(ОблСтрока);
			Пока ТабличныйДокумент.ПроверитьВывод(ПроверяемыйМассив) Цикл
				ТабличныйДокумент.Вывести(ОблСтрока);
			КонецЦикла;
			
			ВывестиПодвалВедомостиНаВыдачу(ТабличныйДокумент, ОблИтого, ВыборкаШапка.Ссылка, ДвиженияМатериалов,
				МассивТМЦ, МассивКоличествНаСтранице,ИндексСтраницы);
		
		КонецЦикла; 
			
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
		
КонецФункции // ПечатьВедомостиНаВыдачуНФА()

// Формирует табличный документ "Накладная на отпуск материалов на сторону М-15" (ф. 0315007)
//
// Параметры:
//	РезультатЗапроса - Массив - Результат выполнения пакета запросов
//						РезультатЗапроса[0] - Выборка шапки документов. Без итогов.
//						РезультатЗапроса[1] - Строки документов. Итоги по ссылке.
//	ОбъектыПечати - СписокЗначений - передается дальше, в процедуру УправлениеПечатью.ЗадатьОбластьПечатиДокумента
//
// Возвращаемое значение:
//	Табличный документ
//
// Пример:
// ТабличныйДокумент = УправлениеПечатьюБГУ.ПечатьНакладнойНаОтпускМЗнаСторону0315007(РезультатЗапроса, ОбъектыПечати, Истина)
//
Функция ПечатьНакладнойНаОтпускМЗнаСторону0315007(РезультатЗапроса, ОбъектыПечати, ПоСебестоимости = Ложь) Экспорт
	Перем ТаблицаДвижений;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_НакладнаяМ15";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Накладная0315007");
	
	ОбластьМакетаШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаИтого  = Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент = Истина;
	
	ВыборкаШапка = РезультатЗапроса[0].Выбрать();
	ВыборкаВсеСтроки = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ПоСебестоимости Тогда
		ТаблицаДвижений = РезультатЗапроса[2].Выгрузить();
	КонецЕсли;
	Пока ВыборкаШапка.Следующий() Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ОбластьМакетаШапка.Параметры.Заполнить(ВыборкаШапка);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(ОбластьМакетаШапка,"пНомер",ВыборкаШапка.пНомер,ВыборкаШапка.Ссылка,Неопределено, Истина);
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
		
		КоличествоИтого = 0;
		СуммаБезНДСИтого = 0;
		СуммаНДСИтого = 0;
		ВсегоИтого = 0;
		
		ВыборкаВсеСтроки.Сбросить();
		Если ВыборкаВсеСтроки.НайтиСледующий(Новый Структура("Ссылка", ВыборкаШапка.Ссылка)) Тогда
			ВыборкаСтроки = ВыборкаВсеСтроки.Выбрать();
			Пока ВыборкаСтроки.Следующий() Цикл
		
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтроки);
			пКорСчет = "" + ВыборкаШапка.КФО;
			Если ЗначениеЗаполнено(ВыборкаСтроки.СчетУчетаПредставление) Тогда
				СчетУчетаПредставление = ВыборкаСтроки.СчетУчетаПредставление;
			Иначе
				СчетУчетаПредставление = Строка(БухгалтерскиеОперацииПовтИсп.СчетУчетаСсылкаИзНоменклатуры(ВыборкаСтроки.Номенклатура));
			КонецЕсли;
			пКорСчет = пКорСчет + ?(ПустаяСтрока(пКорСчет), "", ".") + СчетУчетаПредставление;
			ОбластьМакетаСтрока.Параметры.Заполнить(Новый Структура("пСчетКредита", пКорСчет));
			
			СтруктураПараметров = Новый Структура("пКоличество, пСуммаБезНДС, пСуммаНДС, пВсего, пЦена", 0, 0, 0, 0, 0);
			Если ПоСебестоимости Тогда
				
				Отбор = Новый Структура("Ссылка, СчетУчета, Номенклатура, КПС");
				ЗаполнитьЗначенияСвойств(Отбор, ВыборкаСтроки);
				СтрокиДвижений = ТаблицаДвижений.НайтиСтроки(Отбор);
				Если СтрокиДвижений.Количество() > 0 Тогда
					
					СтрокаСебестоимости = СтрокиДвижений[0];
					СтруктураПараметров.пКоличество = ВыборкаСтроки.пКоличество;
					Если ВыборкаСтроки.пКоличество = СтрокаСебестоимости.КоличествоОстаток Тогда
						СтруктураПараметров.пВсего = СтрокаСебестоимости.СуммаОстаток;
						СтруктураПараметров.пЦена = ?(СтруктураПараметров.пКоличество = 0, 0, СтрокаСебестоимости.СуммаОстаток / СтрокаСебестоимости.КоличествоОстаток);
					ИначеЕсли СтрокаСебестоимости.КоличествоОстаток > 0 Тогда
						СтруктураПараметров.пЦена = Окр(СтрокаСебестоимости.СуммаОстаток / СтрокаСебестоимости.КоличествоОстаток, 2);
						СтруктураПараметров.пВсего = СтруктураПараметров.пЦена * СтруктураПараметров.пКоличество;
					КонецЕсли;
					СтруктураПараметров.пСуммаБезНДС = СтруктураПараметров.пВсего;
					СтрокаСебестоимости.КоличествоОстаток = СтрокаСебестоимости.КоличествоОстаток - СтруктураПараметров.пКоличество;
					СтрокаСебестоимости.СуммаОстаток = СтрокаСебестоимости.СуммаОстаток - СтруктураПараметров.пВсего;
						
				КонецЕсли;
				
			Иначе
				ЗаполнитьЗначенияСвойств(СтруктураПараметров, ВыборкаСтроки);
			КонецЕсли;
			
			ОбластьМакетаСтрока.Параметры.Заполнить(СтруктураПараметров);
			
			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
			
			КоличествоИтого		= КоличествоИтого 	+ СтруктураПараметров.пКоличество;
			СуммаБезНДСИтого	= СуммаБезНДСИтого	+ СтруктураПараметров.пСуммаБезНДС;
			СуммаНДСИтого		= СуммаНДСИтого		+ СтруктураПараметров.пСуммаНДС;
			ВсегоИтого			= ВсегоИтого		+ СтруктураПараметров.пВсего;
		
			КонецЦикла;
		КонецЕсли;
		
		СтруктураОбластьМакетаИтого = Новый Структура("пКоличествоИтого,пСуммаБезНДСИтого,пСуммаНДСИтого,пВсегоИтого");
		СтруктураОбластьМакетаИтого.пКоличествоИтого	= КоличествоИтого;
		СтруктураОбластьМакетаИтого.пСуммаБезНДСИтого	= СуммаБезНДСИтого;
		СтруктураОбластьМакетаИтого.пСуммаНДСИтого		= СуммаНДСИтого;
		СтруктураОбластьМакетаИтого.пВсегоИтого		= ВсегоИтого;
		ОбластьМакетаИтого.Параметры.Заполнить(СтруктураОбластьМакетаИтого);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
		
		СтруктураОбластьМакетаПодвал = Новый Структура("пКоличествоНаименованийПрописью,пВсегоИтогоПрописью,пСуммаНалогов,пДолжностьРуководитель,пФИОРуководитель,пФИОБухгалтер");
		Если ВыборкаСтроки <> Неопределено Тогда
			СтруктураОбластьМакетаПодвал.пКоличествоНаименованийПрописью = ЧислоПрописью(
				ВыборкаСтроки.Количество(),,"наименование,наименования,наименований,с,,,,,0");
		КонецЕсли;
		СтруктураОбластьМакетаПодвал.пВсегоИтогоПрописью = ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(ВсегоИтого,Константы.ВалютаРегламентированногоУчета.Получить());
		СтруктураОбластьМакетаПодвал.пСуммаНалогов = "в том числе сумма НДС: " 
														+ ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(СуммаНДСИтого,Константы.ВалютаРегламентированногоУчета.Получить());
		Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации( 
			Перечисления.ОтветственныеЛицаОрганизаций.Руководитель,
			ВыборкаШапка.Организация,
			ВыборкаШапка.пДата);
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", 
											Руководитель.ОтветственноеЛицоСсылка,
											ВыборкаШапка.пДата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
		СтруктураОбластьМакетаПодвал.пДолжностьРуководитель = ДанныеСотрудника.Должность;
		СтруктураОбластьМакетаПодвал.пФИОРуководитель = КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
																										ДанныеСотрудника.Фамилия,
																										ДанныеСотрудника.Имя,
																										ДанныеСотрудника.Отчество));
		ГлБухгалтер	 = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
			Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер,
			ВыборкаШапка.Организация,
			ВыборкаШапка.пДата);
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", 
											ГлБухгалтер.ОтветственноеЛицоСсылка,
											ВыборкаШапка.пДата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
		СтруктураОбластьМакетаПодвал.пФИОБухгалтер	  = КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
																										ДанныеСотрудника.Фамилия,
																										ДанныеСотрудника.Имя,
																										ДанныеСотрудника.Отчество));
		ОбластьМакетаПодвал.Параметры.Заполнить(СтруктураОбластьМакетаПодвал);
		ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции // ПечатьНакладнойНаОтпускМЗнаСторону()

// Формирует табличный документ "Приходный ордер на приемку материальных ценностей (нефинансовых активов)" (ф. 0504207)
//
// Параметры:
//	РезультатЗапроса - Массив - Результат выполнения пакета запросов
//						РезультатЗапроса[0] - Выборка шапки документов. Без итогов.
//						РезультатЗапроса[1] - Строки документов. Итоги по ссылке.
//	ОбъектыПечати - СписокЗначений - передается дальше, в процедуру УправлениеПечатью.ЗадатьОбластьПечатиДокумента
//	ПоляСвязиШапкиИТЧ - Массив ,Неопределено - перечень имен колонок для дополнительной связи между шапками и строками документов.
//						Данные поля должны содержаться в обеих выборках результата запроса
//						По умолчанию связь осуществляется только по колонке "Ссылка"
//
// Возвращаемое значение:
//	Табличный документ
//
// Пример:
// ТабличныйДокумент = УправлениеПечатьюБГУ.ПечатьПриходногоОрдера_0504207(РезультатЗапроса, ОбъектыПечати)
//
Функция ПечатьПриходногоОрдера_0504207(РезультатЗапроса, ОбъектыПечати, ПоляСвязиШапкиИТЧ = Неопределено, ИмяМакета = "ПФ_MXL_ПриходныйОрдер0504207") Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫПЕЧАТИ_ПРИХОДНЫЙОРДЕР_0504207";
	
	ВыборкаШапка = РезультатЗапроса[0].Выбрать();
	ВыборкаСтроки = РезультатЗапроса[1].Выбрать();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет." + ИмяМакета);
	
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
	ОбластьИтог			= Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент = Истина;
	
	ЕстьРеквизитСдал = РезультатЗапроса[0].Колонки.Найти("Сдал") <> Неопределено;
	ЕстьРеквизитОтветственныйИсполнитель = РезультатЗапроса[0].Колонки.Найти("ОтветственныйИсполнитель") <> Неопределено;
	ЕстьРеквизитОтветственныйИсполнительБух = РезультатЗапроса[0].Колонки.Найти("ОтветственныйИсполнительБух") <> Неопределено;
	
	// При печати нескольких ордеров из одного документа, например, из авансового отчета,
	// требуется всем ордерам документа присвоить одно имя области
	МассивСсылок = Новый Массив;
	Пока ВыборкаШапка.Следующий() Цикл
		МассивСсылок.Добавить(ВыборкаШапка.Ссылка);
	КонецЦикла;
	МассивСсылок = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивСсылок);
	
	Для Каждого Ссылка Из МассивСсылок Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВыборкаШапка.Сбросить();
		
		Пока ВыборкаШапка.НайтиСледующий(Новый Структура("Ссылка", Ссылка)) Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			
			ОбластьЗаголовок.Параметры.Заполнить(ВыборкаШапка);
			
			СтруктураОбластьШапка = Новый Структура("Основание, Номер, ДатаЗаголовка");
			
			СтруктураОбластьШапка.Основание 	= ВыборкаШапка.ВидПервичногоДокумента 
			+ ?(ЗначениеЗаполнено(ВыборкаШапка.ДатаПервичногоДокумента),
			" от "+Формат(ВыборкаШапка.ДатаПервичногоДокумента,"ДФ='dd.MM.yyyy'"), "")
			+ ?(ПустаяСтрока(ВыборкаШапка.НомерПервичногоДокумента), "", " № "+ВыборкаШапка.НомерПервичногоДокумента);
			
			СтруктураОбластьШапка.ДатаЗаголовка = Формат(ВыборкаШапка.Дата, "ДФ='dd MMMM yyyy ''г.'''");
			
			СтруктураОбластьШапка.Номер 	= ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
			ВыборкаШапка.Ссылка, ВыборкаШапка.Номер);
			
			Если ЗначениеЗаполнено(ВыборкаШапка.ЮридическоеФизическоеЛицо) Тогда
				Если ТипЗнч(ВыборкаШапка.ЮридическоеФизическоеЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
					ВидКИАдрес = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты;
					ВидКИТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагенты;
				Иначе
					ВидКИАдрес = Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица;
					ВидКИТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица;
				КонецЕсли;
				СтруктураОбластьШапка.Вставить("АдресПоставщик", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				ВыборкаШапка.ЮридическоеФизическоеЛицо, ВидКИАдрес));
				СтруктураОбластьШапка.Вставить("ТелефонПоставщик", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				ВыборкаШапка.ЮридическоеФизическоеЛицо, ВидКИТелефон));
			Иначе
				СтруктураОбластьШапка.Вставить("АдресПоставщик");
				СтруктураОбластьШапка.Вставить("ТелефонПоставщик");
			КонецЕсли;
			
			ОбластьЗаголовок.Параметры.Заполнить(СтруктураОбластьШапка);
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			СтруктураПоиска = Новый Структура("Ссылка", ВыборкаШапка.Ссылка);
			Если НЕ ПоляСвязиШапкиИТЧ = Неопределено Тогда
				Для Каждого ПолеСвязи Из ПоляСвязиШапкиИТЧ Цикл
					СтруктураПоиска.Вставить(ПолеСвязи, ВыборкаШапка[ПолеСвязи]);
				КонецЦикла;
			КонецЕсли;
			ВыборкаСтроки.Сбросить();
			СуммаИтого = 0;
			НомерСтроки = 0;
			Пока ВыборкаСтроки.НайтиСледующий(СтруктураПоиска) Цикл
				
				ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
				
				СчетКт = ПредставлениеРабочегоСчета(ВыборкаСтроки.КПСКт, ВыборкаСтроки.КФО, ВыборкаСтроки.СчетКт,
				ВыборкаСтроки.КЭККт, Истина);
				СчетДт = ПредставлениеРабочегоСчета(ВыборкаСтроки.КПСДт, ВыборкаСтроки.КФО, ВыборкаСтроки.СчетДт,
				ВыборкаСтроки.КЭКДт, Истина);
				Цена = ?(ВыборкаСтроки.Количество = 0, ВыборкаСтроки.Сумма,
				Окр((ВыборкаСтроки.Сумма / ВыборкаСтроки.Количество), 2));
				СуммаИтого = СуммаИтого + ВыборкаСтроки.Сумма;
				
				НомерСтроки = НомерСтроки + 1;
				ОбластьСтрока.Параметры.Заполнить(Новый Структура("Кредит, Дебет, Цена, НомерСтроки", СчетКт, СчетДт, Цена, НомерСтроки));
				
				Области = Новый Массив;
				Области.Добавить(ОбластьСтрока);
				Области.Добавить(ОбластьИтог);
				
				Если НЕ ТабличныйДокумент.ПроверитьВывод(Области) Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьШапка);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
			КонецЦикла;
			
			ОбластьИтог.Параметры.Заполнить(Новый Структура("СуммаИтого", СуммаИтого));
			
			ТабличныйДокумент.Вывести(ОбластьИтог);
			
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
			ВыборкаШапка.Принял, ВыборкаШапка.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			
			СтруктураОбластьПодвал = Новый Структура("ДолжностьСдал, ФИОСдал, ДолжностьИсполнитель, ФИОИсполнитель, ТелефонИсполнитель, ЭлАдресИсполнитель, ДолжностьИсполнительБух, ФИОИсполнительБух");
			СтруктураОбластьПодвал.Вставить("ДолжностьПринял", ДанныеСотрудника.Должность);
			СтруктураОбластьПодвал.Вставить("ФИОПринял", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
			
			Если ЕстьРеквизитСдал Тогда
				ДанныеСотрудникаСдал = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
				ВыборкаШапка.Сдал, ВыборкаШапка.Дата);
				Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудникаСдал, Истина);
				
				СтруктураОбластьПодвал.Вставить("ДолжностьСдал", ДанныеСотрудникаСдал.Должность);
				СтруктураОбластьПодвал.Вставить("ФИОСдал", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудникаСдал, Истина));
			КонецЕсли;
			
			Если ЕстьРеквизитОтветственныйИсполнитель Тогда
				ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
				ВыборкаШапка.ОтветственныйИсполнитель, ВыборкаШапка.Дата);
				Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина, Истина);
				
				СтруктураОбластьПодвал.Вставить("ДолжностьИсполнитель", ДанныеСотрудника.Должность);
				СтруктураОбластьПодвал.Вставить("ФИОИсполнитель", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
				СтруктураОбластьПодвал.Вставить("ТелефонИсполнитель", ДанныеСотрудника.ТелефонРабочийФизическиеЛица);
				СтруктураОбластьПодвал.Вставить("ЭлАдресИсполнитель", ДанныеСотрудника.EmailФизическиеЛица);
			КонецЕсли;
			
			Если ЕстьРеквизитОтветственныйИсполнительБух Тогда
				ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
				ВыборкаШапка.ОтветственныйИсполнительБух, ВыборкаШапка.Дата);
				Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
				
				СтруктураОбластьПодвал.Вставить("ДолжностьИсполнительБух", ДанныеСотрудника.Должность);
				СтруктураОбластьПодвал.Вставить("ФИОИсполнительБух", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
			КонецЕсли;
			
			ОбластьПодвал.Параметры.Заполнить(СтруктураОбластьПодвал);
			
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьПриходногоОрдера_0504207()

// Напечатать акт списания м з0504230.
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
//  ОбъектыПечати - СписокЗначений из ДокументСсылка
//  ИмяМакета - Строка
// 
// Возвращаемое значение:
//  ТабличныйДокумент
Функция НапечататьАктСписанияМЗ0504230(МассивОбъектов, ОбъектыПечати, ИмяМакета) Экспорт
	ДанныеДляПечати = ТаблицаШапкиДляПечатиАктаСписанияМЗ0504230();
	
	ДокументыПоТипам = ОбщегоНазначенияБГУ.ДокументыПоТипам(МассивОбъектов);
	Для Каждого ТипДокумента Из ДокументыПоТипам Цикл
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ТипДокумента.Значение[0]);
		МенеджерДокумента.ДобавитьДанныеДляПечати0504230(ДанныеДляПечати, МассивОбъектов);
	КонецЦикла;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.Автомасштаб = Истина;
	ТабДокумент.ПолеСлева  = 5;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ИмяПараметровПечати = "ПараметрыПечати_АктСписанияМЗ_0504230";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АктСписанияМЗ." + ИмяМакета);
	
	ОбластьМакетаЗаголовок  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакетаШапка      = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаСтрока     = Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаИтого      = Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаПодвал     = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакетаКомиссия   = Макет.ПолучитьОбласть("Комиссия");
	ОбластьМакетаДата       = Макет.ПолучитьОбласть("Дата");
	
	ОбластьМакетаЗаключение1 = Макет.ПолучитьОбласть("Заключение1");
	ОбластьМакетаЗаключение2 = Макет.ПолучитьОбласть("Заключение2");
	
	ЕстьДопОбластиКомиссия = Макет.Области.Найти("Комиссия1") <> Неопределено;
	МассивДопОбластейКомиссия = Новый Массив;
	Если ЕстьДопОбластиКомиссия Тогда
		МассивДопОбластейКомиссия.Добавить(Макет.ПолучитьОбласть("Комиссия1"));
		МассивДопОбластейКомиссия.Добавить(Макет.ПолучитьОбласть("Комиссия2"));
		МассивДопОбластейКомиссия.Добавить(Макет.ПолучитьОбласть("Комиссия3"));
		МассивДопОбластейКомиссия.Добавить(Макет.ПолучитьОбласть("Комиссия4"));
		МассивДопОбластейКомиссия.Добавить(ОбластьМакетаКомиссия);
	Иначе
		МассивДопОбластейКомиссия.Добавить(ОбластьМакетаКомиссия);
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	
	Для Каждого СтрокаДокумента Из ДанныеДляПечати Цикл
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакетаЗаголовок.Параметры.Заполнить(СтрокаДокумента);
		
		ПараметрыОтметкиБухгалтерии = Новый Структура;
		ПараметрыОтметкиБухгалтерии.Вставить("Дата", Формат(СтрокаДокумента.Дата,"ДФ='MMMM yyyy'"));
		ПараметрыОтметкиБухгалтерии.Вставить("ФИОГлавныйБухгалтер", СтрокаДокумента.ФИОГлавныйБухгалтер);
		Для каждого ТекОбластьКомиссия Из МассивДопОбластейКомиссия Цикл
		
			ТекОбластьКомиссия.Параметры.Заполнить(ПараметрыОтметкиБухгалтерии);
		
		КонецЦикла;
		
		СтрокаКомиссия = "";
		ОбластьКомиссия = СформироватьОбластьКомиссияАктСписанияМЗ0504230(
			СтрокаДокумента, СтрокаДокумента.СоставКомиссии, МассивДопОбластейКомиссия, 3, СтрокаКомиссия, Истина);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ДатаПриказа", 	?(ЗначениеЗаполнено(СтрокаДокумента.ДатаПриказа),
														Формат(СтрокаДокумента.ДатаПриказа, "ДЛФ=DD"),
														"_______________"));
		СтруктураПараметров.Вставить("НомерПриказа", 	?(ЗначениеЗаполнено(СтрокаДокумента.НомерПриказа),
														СокрЛП(СтрокаДокумента.НомерПриказа),
														"_______________"));
		СтруктураПараметров.Вставить("Дата", 			Формат(СтрокаДокумента.Дата, "ДЛФ=D"));
		СтруктураПараметров.Вставить("ДатаЗаголовка",	Формат(СтрокаДокумента.Дата, "ДЛФ=DD"));
		СтруктураПараметров.Вставить("ЧленыКомиссии",	СтрокаКомиссия);
		
		ОбластьМакетаЗаголовок.Параметры.Заполнить(СтруктураПараметров);
		ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		ОбластьЗаключение = Новый ТабличныйДокумент;
		ВыведеноСтрокЗаключения = ВывестиДлиннуюСтрокуАктСписанияМЗ0504230(
			СтрокаДокумента.ЗаключениеКомиссии,
			ОбластьЗаключение, 
			ОбластьМакетаЗаключение1,
			ОбластьМакетаЗаключение2,
			"ЗаключениеЯчейка1",
			"ЗаключениеЯчейка2");
		Для Счетчик = ВыведеноСтрокЗаключения + 1 По 3 Цикл
			
			ПустаяОбластьМакетаЗаключение2 = Макет.ПолучитьОбласть("Заключение2");
			ОбластьЗаключение.Вывести(ПустаяОбластьМакетаЗаключение2);
		
		КонецЦикла;
		
		СуммаИтого 		= 0;
		КоличествоИтого	= 0;
		КоличествоСтрок = СтрокаДокумента.Материалы.Количество();
		Для Каждого СтрокаМатериала Из СтрокаДокумента.Материалы Цикл
			
			ОбластьМакетаСтрока.Параметры.Заполнить(СтрокаМатериала);
				
			Если СтрокаМатериала.НомерСтроки <> КоличествоСтрок Тогда
				Если Не ТабДокумент.ПроверитьВывод(ОбластьМакетаСтрока) Тогда
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабДокумент.Вывести(ОбластьМакетаШапка);
				КонецЕсли;
			Иначе
				Области = Новый Массив;
				Области.Добавить(ОбластьМакетаСтрока);
				Области.Добавить(ОбластьМакетаИтого);
				Области.Добавить(ОбластьМакетаПодвал);
				Области.Добавить(ОбластьЗаключение);
				Области.Добавить(ОбластьКомиссия);
				Области.Добавить(ОбластьМакетаДата);
				Если Не ТабДокумент.ПроверитьВывод(Области) Тогда
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабДокумент.Вывести(ОбластьМакетаШапка);
				КонецЕсли;
			КонецЕсли;
			
			СуммаИтого 		= СуммаИтого		+ СтрокаМатериала.Сумма;
			КоличествоИтого	= КоличествоИтого	+ СтрокаМатериала.Количество;
			
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
		
		КонецЦикла;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("КоличествоИтого", КоличествоИтого);
		СтруктураПараметров.Вставить("СуммаИтого", Формат(СуммаИтого, "ЧДЦ=2"));
		СтруктураПараметров.Вставить("СуммаИтогоПрописью",
			ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(СуммаИтого, Неопределено));
		ОбластьМакетаИтого.Параметры.Заполнить(СтруктураПараметров);
		ТабДокумент.Вывести(ОбластьМакетаИтого);
		ОбластьМакетаПодвал.Параметры.Заполнить(СтруктураПараметров);
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
		ТабДокумент.Вывести(ОбластьЗаключение);
		ТабДокумент.Вывести(ОбластьКомиссия);
		ТабДокумент.Вывести(ОбластьМакетаДата);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент,
			НомерСтрокиНачало, ОбъектыПечати, СтрокаДокумента.Ссылка);
		
	КонецЦикла;

	Возврат ТабДокумент;		
КонецФункции

Функция ПечатьВедомостиАмортизации(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.СчетУчета КАК СчетУчета,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОсновныеСредства.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.СуммаАмортизацииНачисленная КАК СуммаАмортизацииНачисленная,
	|	ОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации
	|ПОМЕСТИТЬ ОсновныеСредства
	|ИЗ
	|	Документ.НачислениеАмортизацииОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|	И ОсновныеСредства.СуммаАмортизации <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.НомерСтроки,
	|	ОсновныеСредства.СчетУчета,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный),
	|	ОсновныеСредства.Сумма,
	|	ОсновныеСредства.СуммаАмортизацииНачисленная,
	|	ОсновныеСредства.СуммаАмортизации
	|ИЗ
	|	Документ.НачислениеАмортизацииИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|	И ОсновныеСредства.СуммаАмортизации <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетАмортизацииОС.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ СрокПолезногоИспользованияОС
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			&Период,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ОсновныеСредства КАК ВТ)) КАК РасчетАмортизацииОС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер,
	|	СобытияОССрезПоследних.ДатаСобытия КАК ДатаПринятияКУчету
	|ПОМЕСТИТЬ ДатаПринятияКУчетуОС
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			&Период,
	|			ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ.ОсновноеСредство
	|					ИЗ
	|						ОсновныеСредства КАК ВТ)
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)) КАК СобытияОССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.Ссылка.Дата КАК Дата,
	|	ОсновныеСредства.Ссылка.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.Организация.НаименованиеПолное = """"
	|			ТОГДА ОсновныеСредства.Ссылка.Организация.Наименование
	|		ИНАЧЕ ОсновныеСредства.Ссылка.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Организация,
	|	ОсновныеСредства.СчетУчета КАК СчетУчета,
	|	ОсновныеСредства.СчетУчета.Код + "" "" + ОсновныеСредства.СчетУчета.Наименование КАК НаименованиеСчета,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредствоСсылка,
	|	ОсновныеСредства.ОсновноеСредство.Представление КАК ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОсновныеСредства.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ОсновныеСредства.ОсновноеСредство.АмортизационнаяГруппа.Порядок + 1 КАК АмортизационнаяГруппа,
	|	ОсновныеСредства.Сумма КАК БалансоваяСтоимость,
	|	ОсновныеСредства.СуммаАмортизацииНачисленная КАК АмортизацияНачало,
	|	ОсновныеСредства.СуммаАмортизации КАК АмортизацияНачислено,
	|	ОсновныеСредства.СуммаАмортизацииНачисленная + ОсновныеСредства.СуммаАмортизации КАК АмортизацияКонец,
	|	ОсновныеСредства.Сумма - ОсновныеСредства.СуммаАмортизацииНачисленная - ОсновныеСредства.СуммаАмортизации КАК ОстаточнаяСтоимость,
	|	ДатаПринятияКУчетуОС.ДатаПринятияКУчету КАК ДатаПринятияКУчету,
	|	СрокПолезногоИспользованияОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ИЗ
	|	ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ СрокПолезногоИспользованияОС КАК СрокПолезногоИспользованияОС
	|		ПО ОсновныеСредства.ОсновноеСредство = СрокПолезногоИспользованияОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатаПринятияКУчетуОС КАК ДатаПринятияКУчетуОС
	|		ПО ОсновныеСредства.ОсновноеСредство = ДатаПринятияКУчетуОС.ОсновноеСредство
	|			И ОсновныеСредства.ИнвентарныйНомер = ДатаПринятияКУчетуОС.ИнвентарныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	СчетУчета,
	|	ОсновныеСредства.НомерСтроки
	|ИТОГИ
	|	СУММА(БалансоваяСтоимость),
	|	СУММА(АмортизацияНачало),
	|	СУММА(АмортизацияНачислено),
	|	СУММА(АмортизацияКонец),
	|	СУММА(ОстаточнаяСтоимость)
	|ПО
	|	Ссылка,
	|	СчетУчета";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("Период", ОбщегоНазначенияБГУ.РабочаяДатаПользователя());
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	МетодыНачисления = УправлениеОсновнымиСредствамиПовтИсп.СпособыНачисленияАмортизации_Соответствие();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.ИмяПараметровПечати = "ПараметрыПечати_ВедомостьНачисленияАмортизации";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ВедомостьАмортизации");
	
	Шапка			= Макет.ПолучитьОбласть("Шапка");
	ШапкаТаблицы	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	Счет			= Макет.ПолучитьОбласть("Счет");	
	СтрокаТаблицы	= Макет.ПолучитьОбласть("Строка");
	Подвал			= Макет.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		НомерСтроки = 0;
		
		Параметры = Новый Структура;
		Параметры.Вставить("Номер"			, ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(Выборка.Ссылка, Выборка.Номер)); 
		Параметры.Вставить("Дата"			, Формат(Выборка.Дата, "ДЛФ=D"));
		Параметры.Вставить("Организация"	, Выборка.Организация);
		
		Шапка.Параметры.Заполнить(Параметры);
		ТабДокумент.Вывести(Шапка);
		
		ТабДокумент.Вывести(ШапкаТаблицы);
		ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область("ШапкаТаблицы");
		
		ВыборкаПоСчету = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Пока ВыборкаПоСчету.Следующий() Цикл
			
			Счет.Параметры.Заполнить(ВыборкаПоСчету);
			ТабДокумент.Вывести(Счет);
			
			ВыборкаПоОС = ВыборкаПоСчету.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Пока ВыборкаПоОС.Следующий() Цикл
				
				НомерСтроки		= НомерСтроки + 1;
				СтепеньИзноса	= ?(ВыборкаПоОС.БалансоваяСтоимость = 0, 0, (ВыборкаПоОС.АмортизацияКонец / ВыборкаПоОС.БалансоваяСтоимость)*100);
				Метод			= МетодыНачисления[ВыборкаПоОС.СпособНачисленияАмортизации];
				Параметры = Новый Структура("НомерСтроки,СтепеньИзноса,Метод",НомерСтроки, СтепеньИзноса, Метод); 
				
				СтрокаТаблицы.Параметры.Заполнить(ВыборкаПоОС);
				СтрокаТаблицы.Параметры.Заполнить(Параметры);
				ТабДокумент.Вывести(СтрокаТаблицы);
				
			КонецЦикла;
			
		КонецЦикла;
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(Подвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ВывестиДлиннуюСтроку(СтрокаВывода, ТабДокумент, Область1, Знач Область2 = Неопределено, КоличествоДопСтрок = 0) Экспорт
	
	ЧислоСимволов1 = ПолучитьШиринуОбласти(Область1);

	Если Область2 = Неопределено Тогда
		Область2 = Область1;
		ЧислоСимволов2 = ЧислоСимволов1;
	Иначе
		ЧислоСимволов2 = ПолучитьШиринуОбласти(Область2);
	КонецЕсли;
	
	КолВыведенныхСтрок = 0;

	МассивАбзацев = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаВывода, Символы.ПС, Истина);
	
	Для Каждого Абзац Из МассивАбзацев Цикл
		
		МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Абзац, " ");
		ТекИндекс = 0;
		
		Пока ТекИндекс <= МассивСлов.Количество() - 1 Цикл
			
			ТекущаяОбласть			= ?(КолВыведенныхСтрок = 0, Область1, Область2);
			ТекущееЧислоСимволов	= ?(КолВыведенныхСтрок = 0, ЧислоСимволов1, ЧислоСимволов2);
			
			ТекущаяОбласть.Параметры.Установить(0, СобратьСтрокуИзМассиваДляОбласти(МассивСлов, ТекИндекс, ТекущееЧислоСимволов));
			ТабДокумент.Вывести(ТекущаяОбласть);
			
			КолВыведенныхСтрок = КолВыведенныхСтрок + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Область2.Параметры.Установить(0, "");
	Для к = КолВыведенныхСтрок по КоличествоДопСтрок Цикл			
		ТабДокумент.Вывести(Область2);
	КонецЦикла;
	
	Возврат КолВыведенныхСтрок;
	
КонецФункции

Функция Напечатать0504101(МассивОбъектов, ОбъектыПечати, Редакция = "") Экспорт
	
	ДанныеДокументов = ДанныеДляПечати0504101(МассивОбъектов);
	
	ДанныеДляПечати = Новый Структура;
	ДанныеДляПечати.Вставить("ВыборкаДокументов", ДанныеДокументов[06].Выбрать());
	ДанныеДляПечати.Вставить("ВыборкаОС",         ДанныеДокументов[07].Выбрать());
	ДанныеДляПечати.Вставить("ВыборкаКомиссия",   ДанныеДокументов[08].Выбрать());
	ДанныеДляПечати.Вставить("ВыборкаДвижения",   ДанныеДокументов[09].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	ДополнительныеХарактеристики = Новый Структура;
	ДополнительныеХарактеристики.Вставить("ЕГРН",           ДанныеДокументов[10].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДополнительныеХарактеристики.Вставить("ПТС",            ДанныеДокументов[11].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДополнительныеХарактеристики.Вставить("Характеристики", ДанныеДокументов[12].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДополнительныеХарактеристики.Вставить("Драгметаллы",    ДанныеДокументов[13].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Справочники.ОсновныеСредства.ИнициализироватьПараметрыДопХарактеристик(ДополнительныеХарактеристики);
	
	Возврат Вывести0504101вТабличныйДокумент(ДанныеДляПечати, ОбъектыПечати, ДополнительныеХарактеристики, Редакция);
	
КонецФункции

// Выводит в макет подготовленные данные.
// 
// Параметры:
// 	ДанныеДокументов - Структура - Описание:
// * ВыборкаКомиссия - ВыборкаИзРезультатаЗапроса - описание полей см. ДанныеДляПечати0504101
// * ВыборкаОС - ВыборкаИзРезультатаЗапроса - описание полей см. ДанныеДляПечати0504101
// * ВыборкаДокументов - ВыборкаИзРезультатаЗапроса - описание полей см. ДанныеДляПечати0504101
// * ВыборкаДвижения - ВыборкаИзРезультатаЗапроса - описание полей см. ДанныеДляПечати0504101
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
// 	ДополнительныеХарактеристики - Структура - Описание:
// * ЕГРН - ВыборкаИзРезультатаЗапроса - описание полей см. ДанныеДляПечати0504101
// * ПТС - ВыборкаИзРезультатаЗапроса - описание полей см. ДанныеДляПечати0504101
// * Характеристики - ВыборкаИзРезультатаЗапроса - описание полей см. ДанныеДляПечати0504101
// * Драгметаллы - ВыборкаИзРезультатаЗапроса - описание полей см. ДанныеДляПечати0504101
// * ТаблицаХарактеристики - ТаблицаЗначений - описание колонок см. ДанныеДляПечати0504101
// 	Редакция - Строка - номер редакции для выбора макета
// Возвращаемое значение:
// 	ТабличныйДокумент - Описание
Функция Вывести0504101вТабличныйДокумент(ДанныеДокументов, ОбъектыПечати, ДополнительныеХарактеристики, Редакция) Экспорт

	ВыборкаДокументов		= ДанныеДокументов.ВыборкаДокументов;
	ВыборкаОС				= ДанныеДокументов.ВыборкаОС;
	ВыборкаКомиссия			= ДанныеДокументов.ВыборкаКомиссия;
	ВыборкаДвижения			= ДанныеДокументов.ВыборкаДвижения;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_АктПриемаПередачи0504101";
	
	ИмяМакета = "ОбщийМакет.ПФ_MXL_Акт0504101" + ?(ЗначениеЗаполнено(Редакция), "_", "") + Редакция;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
	
	ТитульныйЛист						= Макет.ПолучитьОбласть("ТитульныйЛист");
	Область_Подвал						= Макет.ПолучитьОбласть("Подвал");
	Область_ПредседательКомиссии		= Макет.ПолучитьОбласть("ПредседательКомиссии");
	Область_ЧленыКомиссии				= Макет.ПолучитьОбласть("ЧленыКомиссии");
	Область_ОтметкиБухгалтерии_Шапка	= Макет.ПолучитьОбласть("ОтметкиБухгалтерии_Шапка");
	Область_ОтметкиБухгалтерии_Строка	= Макет.ПолучитьОбласть("ОтметкиБухгалтерии_Строка");
	Область_Исполнители					= Макет.ПолучитьОбласть("Исполнители");
	Область_НачалоСтраницы				= Макет.ПолучитьОбласть("НачалоСтраницы");
	Раздел3_Шапка						= Макет.ПолучитьОбласть("Раздел3_Шапка");
	Раздел3_Строка						= Макет.ПолучитьОбласть("Раздел3_Строка");
	Раздел3_Валюта						= Макет.ПолучитьОбласть("Раздел3_Валюта");
	
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ПервыйДокумент = Истина;
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		НомерСтраницы = 1;
		
		ТитульныйЛист.Параметры.Заполнить(ВыборкаДокументов);
		
		ПараметрыШапки	= Новый Структура;
		ПараметрыБух	= Новый Структура;
		ПараметрыПодвал	= Новый Структура;
		
		ПараметрыШапки.Вставить("НомерАкта", ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
			ВыборкаДокументов.Ссылка,ВыборкаДокументов.Номер));
		ПараметрыШапки.Вставить("пДата", Формат(ВыборкаДокументов.Дата, "ДФ='''""''дд''""'' ММММ гггг ''г.'''"));
		
		// Данные руководителя
		РуководительЕстьВЗапросе = Ложь;
		Если ВыборкаДокументов.Владелец().Колонки.Найти("Руководитель") <> Неопределено И ЗначениеЗаполнено(ВыборкаДокументов["Руководитель"]) Тогда
			РуководительЕстьВЗапросе = Истина;
		КонецЕсли;
		
		Если РуководительЕстьВЗапросе Тогда                       
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность, Подразделение", 
				ВыборкаДокументов["Руководитель"], ВыборкаДокументов.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина, Истина);
			РуководительФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		Иначе	
			Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
				Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ВыборкаДокументов.Организация,
				ВыборкаДокументов.Дата, ВыборкаДокументов.ОрганизацияПодразделение);
			РуководительФИО = КорреспондентыКлиентСервер.ФИО(Руководитель, Истина, "ОтветственноеЛицо");
		КонецЕсли;	
		
		Бухгалтер = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
			Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, ВыборкаДокументов.Организация,
			ВыборкаДокументов.Дата, ВыборкаДокументов.ОрганизацияПодразделение);
		БухгалтерФИО = КорреспондентыКлиентСервер.ФИО(Бухгалтер, Истина, "ОтветственноеЛицо");
		
		Сотрудник = Новый Структура("СсылкаНаОбъект,Период,Фамилия,Имя,Отчество,Должность,ДолжностьНаименование",
			ВыборкаДокументов.Сотрудник, ВыборкаДокументов.Дата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(Сотрудник);
		СотрудникФИО = КорреспондентыКлиентСервер.ФИО(Сотрудник, Истина);
		
		СведенияИсполнителя = СведенияИсполнителяПоОтветственному(ВыборкаДокументов.Ответственный,
			ВыборкаДокументов.Организация, ВыборкаДокументов.Дата, Истина);
			
		Если ВыборкаДокументов.Принятие Тогда
			ПараметрыШапки.Вставить("РукОтправителя"			, "");
			ПараметрыШапки.Вставить("РукПолучателя"				, РуководительФИО);
			ПараметрыБух.Вставить("ГлБухОтправителя"			, "");
			ПараметрыБух.Вставить("ГлБухПолучателя"				, БухгалтерФИО);
			ПараметрыБух.Вставить("ФИОИсполнительПрием"			, СведенияИсполнителя.ФИО);
			ПараметрыБух.Вставить("ДолжностьИсполнительПрием"	, СведенияИсполнителя.ДолжностьНаименование);
			ПараметрыБух.Вставить("НомерТелефонаПрием"			, СведенияИсполнителя.НомерТелефона);
			ПараметрыБух.Вставить("ЭлектроннаяПочтаПрием"		, СведенияИсполнителя.ЭлектроннаяПочта);
			ПараметрыПодвал.Вставить("ДолжностьМолОтправитель"	, "");
			ПараметрыПодвал.Вставить("ФИОМолОтправитель"		, "");
			ПараметрыПодвал.Вставить("ДолжностьМолПолучатель"	, Сотрудник.ДолжностьНаименование);
			ПараметрыПодвал.Вставить("ФИОМолПолучатель"			, СотрудникФИО);
			Отправитель	= "Контрагент";
			Получатель	= "Организация";
		Иначе
			ПараметрыШапки.Вставить("РукОтправителя"			, РуководительФИО);
			ПараметрыШапки.Вставить("РукПолучателя"				, "");
			ПараметрыБух.Вставить("ГлБухОтправителя"			, БухгалтерФИО);
			ПараметрыБух.Вставить("ГлБухПолучателя"				, "");
			ПараметрыБух.Вставить("ФИОИсполнительПередача"		, СведенияИсполнителя.ФИО);
			ПараметрыБух.Вставить("ДолжностьИсполнительПередача", СведенияИсполнителя.ДолжностьНаименование);
			ПараметрыБух.Вставить("НомерТелефонаПередача"		, СведенияИсполнителя.НомерТелефона);
			ПараметрыБух.Вставить("ЭлектроннаяПочтаПередача"	, СведенияИсполнителя.ЭлектроннаяПочта);
			ПараметрыПодвал.Вставить("ДолжностьМолОтправитель"	, Сотрудник.ДолжностьНаименование);
			ПараметрыПодвал.Вставить("ФИОМолОтправитель"		, СотрудникФИО);
			ПараметрыПодвал.Вставить("ДолжностьМолПолучатель"	, "");
			ПараметрыПодвал.Вставить("ФИОМолПолучатель"			, "");
			Отправитель	= "Организация";
			Получатель	= "Контрагент";
		КонецЕсли;
		
		Если ВыборкаДокументов.Передача Тогда
			
			ПараметрыШапки.Вставить("Отправитель"					, ВыборкаДокументов[Отправитель]);
			ПараметрыШапки.Вставить("ИННОтправителя"				, ВыборкаДокументов[Отправитель + "ИНН"]); 
			ПараметрыШапки.Вставить("КППОтправителя"				, ВыборкаДокументов[Отправитель + "КПП"]);
			ПараметрыШапки.Вставить("КодОКПООтправителя"			, ВыборкаДокументов[Отправитель + "КодОКПО"]);
			ПараметрыШапки.Вставить("НаимОтправителя"				, ВыборкаДокументов[Отправитель + "Наименование"]);
			ПараметрыШапки.Вставить("ПодразделениеОтправителя"		, ВыборкаДокументов[Отправитель + "Подразделение"]);
			ПараметрыШапки.Вставить("НаимПодразделенияОтправителя"	, ВыборкаДокументов[Отправитель + "ПодразделениеНаименование"]);
			
		КонецЕсли;
		
		ПараметрыШапки.Вставить("Получатель"					, ВыборкаДокументов[Получатель]);
		ПараметрыШапки.Вставить("ИННПолучателя"					, ВыборкаДокументов[Получатель + "ИНН"]);
		ПараметрыШапки.Вставить("КПППолучателя"					, ВыборкаДокументов[Получатель + "КПП"]);
		ПараметрыШапки.Вставить("КодОКПОПолучателя"				, ВыборкаДокументов[Получатель + "КодОКПО"]);
		ПараметрыШапки.Вставить("НаимПолучателя"				, ВыборкаДокументов[Получатель + "Наименование"]);
		ПараметрыШапки.Вставить("ПодразделениеПолучателя"		, ВыборкаДокументов[Получатель + "Подразделение"]);
		ПараметрыШапки.Вставить("НаимПодразделенияПолучателя"	, ВыборкаДокументов[Получатель + "ПодразделениеНаименование"]);
		
		ПараметрыШапки.Вставить("ВидИмущества"					, ПредставлениеВидаИмущества(ВыборкаДокументов.ВидИмущества));
		
		ТитульныйЛист.Параметры.Заполнить(ПараметрыШапки);
		
		ТабличныйДокумент.Вывести(ТитульныйЛист);
		
		ВывестиРазделы1и2в0504101(ТабличныйДокумент, Макет, ВыборкаДокументов, ВыборкаОС, ДополнительныеХарактеристики, НомерСтраницы);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		НомерСтраницы = НомерСтраницы + 1;
		
		// Раздел 3
		
		Область_НачалоСтраницы.Параметры.Заполнить(Новый Структура("НомерСтраницы", НомерСтраницы));
		ТабличныйДокумент.Вывести(Область_НачалоСтраницы);
		ТабличныйДокумент.Вывести(Раздел3_Шапка);
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		СуммаВВалюте = 0;
		ВыборкаОС.Сбросить();
		
		ОчиститьПараметрыОбласти(Раздел3_Строка);
		
		Пока ВыборкаОС.НайтиСледующий(СтруктураПоиска) Цикл
			
			Если ВыборкаДокументов.Принятие Тогда
				
				Раздел3_Строка.Параметры.Заполнить(ВыборкаОС);
				
				Если ЗначениеЗаполнено(ВыборкаОС.НомерИнвКарточки) Тогда
					Счет = ПредставлениеРабочегоСчета(ВыборкаОС.КПС, ВыборкаОС.КФО, ВыборкаОС.СчетУчета, ВыборкаОС.КЭК);
				Иначе
					Счет = "";
				КонецЕсли;
				Раздел3_Строка.Параметры.Заполнить(Новый Структура("НомерСчета", Счет));
				
				СуммаВВалюте = СуммаВВалюте + ВыборкаОС.СуммаВВалюте;
				
			Иначе
				
				Раздел3_Строка.Параметры.Заполнить(Новый Структура("НомерСтроки", ВыборкаОС.НомерСтроки));
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(Раздел3_Строка);
			
		КонецЦикла;
		
		ПараметрыВалюты = Новый Структура("СуммаВВалюте,ВалютаПоступленияНаименование,ВалютаПоступленияКод", "", "", "");
		Если ИспользоватьВалютныйУчет И ВыборкаДокументов.ВалютаПоступления <> ВалютаРегламентированногоУчета Тогда
			ПараметрыВалюты.СуммаВВалюте					= СуммаВВалюте;
			ПараметрыВалюты.ВалютаПоступленияНаименование	= ВыборкаДокументов.ВалютаПоступленияНаименование;
			ПараметрыВалюты.ВалютаПоступленияКод			= ВыборкаДокументов.ВалютаПоступленияКод;
		КонецЕсли;
		Раздел3_Валюта.Параметры.Заполнить(ПараметрыВалюты);
		ТабличныйДокумент.Вывести(Раздел3_Валюта);
		
		// Подвал
		
		пДатаПриказа = ?(ЗначениеЗаполнено(ВыборкаДокументов.НомерПриказа),
			Формат(ВыборкаДокументов.ДатаПриказа, "ДФ='''""''дд''""'' ММММ гггг ''г.'''"),
			"""___""____________20___г.");
		ПараметрыПодвал.Вставить("ДатаПриказа", пДатаПриказа);
		
		пНомерПриказа = ?(ЗначениеЗаполнено(ВыборкаДокументов.НомерПриказа),
			ВыборкаДокументов.НомерПриказа, "______________");
		ПараметрыПодвал.Вставить("НомерПриказа", пНомерПриказа);
		
		Область_Подвал.Параметры.Заполнить(ВыборкаДокументов);
		Область_Подвал.Параметры.Заполнить(ПараметрыПодвал);
		ТабличныйДокумент.Вывести(Область_Подвал);
		
		// Выводим комиссию
		
		ПредседательФИО = КорреспондентыКлиентСервер.ФИО(ВыборкаДокументов, Истина, "Председатель");
		ПараметрыКомиссии = Новый Структура("Должность,ФИО", ВыборкаДокументов.ПредседательДолжность, ПредседательФИО);
		Область_ПредседательКомиссии.Параметры.Заполнить(ПараметрыКомиссии);
		ТабличныйДокумент.Вывести(Область_ПредседательКомиссии);
		
		ВыборкаКомиссия.Сбросить();
		ПараметрыКомиссии = Новый Структура("Должность1, ФИО1, Должность2, ФИО2");
		ПараметрыКомиссии.Вставить("пСтатусЧленаКомиссии", "Члены комиссии:");
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		
		ИндексЧленаКомиссии = 0;
		
		Пока ВыборкаКомиссия.НайтиСледующий(СтруктураПоиска) Цикл
			
			ИндексЧленаКомиссии = ИндексЧленаКомиссии + 1;
			ПараметрыКомиссии["Должность" + ИндексЧленаКомиссии] = ВыборкаКомиссия.КомиссияДолжность;
			ПараметрыКомиссии["ФИО" + ИндексЧленаКомиссии] = КорреспондентыКлиентСервер.ФИО(ВыборкаКомиссия, Истина, "Комиссия");
			
			Если ИндексЧленаКомиссии = 2 Тогда
				Область_ЧленыКомиссии.Параметры.Заполнить(ПараметрыКомиссии);
				ТабличныйДокумент.Вывести(Область_ЧленыКомиссии);
				ПараметрыКомиссии.пСтатусЧленаКомиссии = "";
				ИндексЧленаКомиссии = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ИндексЧленаКомиссии = 1 Тогда
			ПараметрыКомиссии["Должность2"]	= "";
			ПараметрыКомиссии["ФИО2"]		= "";
			Область_ЧленыКомиссии.Параметры.Заполнить(ПараметрыКомиссии);
			ТабличныйДокумент.Вывести(Область_ЧленыКомиссии);
		КонецЕсли;
		
		ОчиститьПараметрыОбласти(Область_ЧленыКомиссии);
		Для Сч = Окр(ВыборкаКомиссия.Количество() / 2) По 1 Цикл
			пДанные = Новый Структура("пСтатусЧленаКомиссии", ?(Сч = 0, ПараметрыКомиссии.пСтатусЧленаКомиссии, ""));
			ЗаполнитьЗначенияСвойств(Область_ЧленыКомиссии.Параметры, пДанные);
			ТабличныйДокумент.Вывести(Область_ЧленыКомиссии);
		КонецЦикла;
		
		// Выводим отметку бухгалтерии
		
		МассивОбластей = Новый Массив;
		МассивОбластей.Добавить(Область_ОтметкиБухгалтерии_Шапка);
		МассивОбластей.Добавить(Область_ОтметкиБухгалтерии_Строка);
		МассивОбластей.Добавить(Область_ОтметкиБухгалтерии_Строка);
		Если Не ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			НомерСтраницы = НомерСтраницы + 1;
			Область_НачалоСтраницы.Параметры.Заполнить(Новый Структура("НомерСтраницы", НомерСтраницы));
			ТабличныйДокумент.Вывести(Область_НачалоСтраницы);
		КонецЕсли;
		
		ВыборкаДвижения.Сбросить();
		
		Если ВыборкаДвижения.НайтиСледующий(СтруктураПоиска) Тогда
			
			ДвиженияДокумента = ВыборкаДвижения.Выбрать();
			
			ТабличныйДокумент.Вывести(Область_ОтметкиБухгалтерии_Шапка);
			
			ПараметрыСтроки = Новый Структура("СчетДтПринятие,СчетКтПринятие,СуммаПринятие,
				|СчетДтВыбытие,СчетКтВыбытие,СуммаВыбытие", "","","","","","");
			
			Если ВыборкаДокументов.Принятие Тогда
				П1 = "Принятие";
				П2 = "Выбытие";
			Иначе
				П1 = "Выбытие";
				П2 = "Принятие";
			КонецЕсли;
			
			Пока ДвиженияДокумента.Следующий() Цикл
				
				СчетДт = ПредставлениеСчета(ДвиженияДокумента, "Дт", Истина);
				СчетКт = ПредставлениеСчета(ДвиженияДокумента, "Кт", Истина);
				
				ПараметрыСтроки["СчетДт" + П1] = СчетДт;
				ПараметрыСтроки["СчетКт" + П1] = СчетКт;
				ПараметрыСтроки["Сумма"  + П1] = ДвиженияДокумента.Сумма;
				ПараметрыСтроки["СчетДт" + П2] = "";
				ПараметрыСтроки["СчетКт" + П2] = "";
				ПараметрыСтроки["Сумма"  + П2] = "";
				
				Область_ОтметкиБухгалтерии_Строка.Параметры.Заполнить(ПараметрыСтроки);
				ТабличныйДокумент.Вывести(Область_ОтметкиБухгалтерии_Строка);
				
			КонецЦикла;
			
		Иначе
			
			ПараметрыСтроки = Новый Структура("СчетДтПринятие,СчетКтПринятие,СуммаПринятие,
				|СчетДтВыбытие,СчетКтВыбытие,СуммаВыбытие", "","","","","","");
			Область_ОтметкиБухгалтерии_Строка.Параметры.Заполнить(ПараметрыСтроки);
			
			ТабличныйДокумент.Вывести(Область_ОтметкиБухгалтерии_Шапка);
			ТабличныйДокумент.Вывести(Область_ОтметкиБухгалтерии_Строка);
			ТабличныйДокумент.Вывести(Область_ОтметкиБухгалтерии_Строка);
			
		КонецЕсли;
		
		Область_Исполнители.Параметры.Заполнить(ПараметрыБух);
		ТабличныйДокумент.Вывести(Область_Исполнители);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Напечатать0504102(МассивОбъектов, ОбъектыПечати, Редакция = "") Экспорт
	
	// определим типы документов для печати
	ЕстьВнутреннееПеремещениеОС					= Ложь;
	ЕстьПереводГотовойПродукцииВСоставОС		= Ложь;
	ЕстьТребованиеНакладнаяМЗ					= Ложь;
	ЕстьВнутреннееПеремещениеПравПользования	= Ложь;
	ЕстьВнутреннееПеремещениеИК					= Ложь;
	
	Для Каждого ПечатаемыйОбъект Из МассивОбъектов Цикл
		
		ТипОбъекта = ТипЗнч(ПечатаемыйОбъект);
		
		Если ТипОбъекта = Тип("ДокументСсылка.НакладнаяНаВнутреннееПеремещениеОС2") Тогда
			ЕстьВнутреннееПеремещениеОС = Истина;
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ПереводГотовойПродукцииВСоставОС") Тогда
			ЕстьПереводГотовойПродукцииВСоставОС = Истина;
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ТребованиеНакладная0315006") Тогда
			ЕстьТребованиеНакладнаяМЗ = Истина;
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ВнутреннееПеремещениеОбъектовПравПользованияОС") Тогда
			ЕстьВнутреннееПеремещениеПравПользования = Истина;
		ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ВнутреннееПеремещениеИК") Тогда
			ЕстьВнутреннееПеремещениеИК = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьВнутреннееПеремещениеОС
		И Не ЕстьПереводГотовойПродукцииВСоставОС
		И Не ЕстьТребованиеНакладнаяМЗ
		И Не ЕстьВнутреннееПеремещениеПравПользования
		И Не ЕстьВнутреннееПеремещениеИК Тогда
		
		// нечего печатать
		Возврат Неопределено;
		
	КонецЕсли;
	
	ТаблицыЗапроса = Новый Массив;
	ДокументыЗапроса = Новый Массив;
	
	Если ЕстьТребованиеНакладнаяМЗ Тогда
		// для определения цены требуется предварительное заполнение временной таблицы с движениями
		ТаблицыЗапроса.Добавить(ТекстЗапросаВТДвиженийДляТребованияНакладнойМЗ());
		ТаблицыЗапроса.Добавить(ТекстЗапросаВТСчетаДляТребованияНакладнойМЗ());
		ТаблицыЗапроса.Добавить(ТекстЗапросаВТТребованиеНакладнаяМатериалы());
	КонецЕсли;
	
	Если ЕстьВнутреннееПеремещениеОС Тогда
		ДокументыЗапроса.Добавить(ТекстЗапроса0504102_НакладнаяНаВнутреннееПеремещениеОС());
	КонецЕсли;
	Если ЕстьПереводГотовойПродукцииВСоставОС Тогда
		ДокументыЗапроса.Добавить(ТекстЗапроса0504102_ПереводГотовойПродукцииВСоставОС());
	КонецЕсли;
	Если ЕстьТребованиеНакладнаяМЗ Тогда
		ДокументыЗапроса.Добавить(ТекстЗапроса0504102_ТребованиеНакладная0315006());
	КонецЕсли;
	Если ЕстьВнутреннееПеремещениеПравПользования Тогда
		ДокументыЗапроса.Добавить(ТекстЗапроса0504102_ВнутреннееПеремещениеОбъектовПравПользованияОС());
	КонецЕсли;
	Если ЕстьВнутреннееПеремещениеИК Тогда
		ДокументыЗапроса.Добавить(ТекстЗапроса0504102_НакладнаяНаВнутреннееПеремещениеИК());
	КонецЕсли;
	
	Если ДокументыЗапроса.Количество() > 0 Тогда
		ДокументыЗапроса[0] = СтрЗаменить(ДокументыЗапроса[0], "ВЫБРАТЬ", "ВЫБРАТЬ РАЗРЕШЕННЫЕ");
	КонецЕсли;
	
	ТекстДокументов = СтрСоединить(ДокументыЗапроса, ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все"));
	Если ЗначениеЗаполнено(ТекстДокументов) Тогда
		ТекстДокументов = ТекстДокументов + "
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	НомерСтроки
		|ИТОГИ ПО
		|	Ссылка";
	КонецЕсли;
	ТаблицыЗапроса.Добавить(ТекстДокументов);
	
	ТаблицыЗапроса.Добавить(ТекстЗапроса_ДвиженияДокументов());
	
	ТекстЗапроса = СтрСоединить(ТаблицыЗапроса, ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета());
	КолВоТаблиц = ТаблицыЗапроса.Количество();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_Накладная0504102";
	
	ИмяМакета = "ОбщийМакет.ПФ_MXL_Накладная0504102" + ?(ЗначениеЗаполнено(Редакция), "_", "") + Редакция;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
	
	ОблШапка 				= Макет.ПолучитьОбласть("Шапка");
	ОблТаблицаШапка			= Макет.ПолучитьОбласть("ТаблицаШапка");
	ОблСтрока 				= Макет.ПолучитьОбласть("ТаблицаСтрока");
	ОблСтрокаИтоги 			= Макет.ПолучитьОбласть("ТаблицаИтоги");
	
	ОблПодвал 				= Макет.ПолучитьОбласть("Подписи");
	ОблОтметкаБухгалтерии	= Макет.ПолучитьОбласть("ОтметкаБухгалтерии");
	ОблСтрокаПроводки 		= Макет.ПолучитьОбласть("СтрокаПроводок");
	ОблИсполнитель			= Макет.ПолучитьОбласть("Исполнитель");
	
	ВыборкаШапка = РезультатЗапроса[КолВоТаблиц-2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДвижений = РезультатЗапроса[КолВоТаблиц-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Заполняем и выводим область шапки
		
		ОблШапка.Параметры.Заполнить(ВыборкаШапка);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(
			ОблШапка, "Номер", ВыборкаШапка.Номер, ВыборкаШапка.Ссылка, , Истина);
		
		Основание = СокрЛП(ВыборкаШапка.ВидПервичногоДокумента);
		Если ЗначениеЗаполнено(ВыборкаШапка.ДатаПервичногоДокумента) Тогда
			Основание = Основание + НСтр("ru = ' от '") + Формат(ВыборкаШапка.ДатаПервичногоДокумента, "ДЛФ=D");
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаШапка.НомерПервичногоДокумента) Тогда
			Основание = Основание + НСтр("ru = ' №'") + СокрЛП(ВыборкаШапка.НомерПервичногоДокумента);
		КонецЕсли;
		
		ОблШапка.Параметры.Заполнить(Новый Структура("Основание", Основание));
		
		ТабличныйДокумент.Вывести(ОблШапка);
		
		// Выводим таблицу
		
		ТабличныйДокумент.Вывести(ОблТаблицаШапка);
		
		ИтогоКоличество = 0;
		ИтогоСумма = 0;
		
		ВыборкаСтроки = ВыборкаШапка.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			ОблСтрока.Параметры.Заполнить(ВыборкаСтроки);
			ОблСтрока.Параметры.Заполнить(Новый Структура("ИнвентарныйНомер", СокрП(ВыборкаСтроки.ИнвентарныйНомер)));
			ТабличныйДокумент.Вывести(ОблСтрока);
			ИтогоКоличество = ИтогоКоличество + ВыборкаСтроки.Количество;
			ИтогоСумма = ИтогоСумма + ВыборкаСтроки.Сумма;
		КонецЦикла;
		
		// Выводим область итоги
		ОблСтрокаИтоги.Параметры.КоличествоИтог = ИтогоКоличество;
		ОблСтрокаИтоги.Параметры.СуммаИтог = ИтогоСумма;
		ТабличныйДокумент.Вывести(ОблСтрокаИтоги);
		
		// Выводим область подписи
		
		ПараметрыОблПодвал = Новый Структура;
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
			ВыборкаШапка.МОЛОтправитель, ВыборкаШапка.Дата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
		ПараметрыОблПодвал.Вставить("ОтправительДолжность", ДанныеСотрудника.Должность);
		ПараметрыОблПодвал.Вставить("ФИОМОЛОтправитель", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
		ВыборкаШапка.МОЛПолучатель, ВыборкаШапка.Дата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
		ПараметрыОблПодвал.Вставить("ПолучательДолжность", ДанныеСотрудника.Должность);
		ПараметрыОблПодвал.Вставить("ФИОМОЛПолучатель", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ОблПодвал.Параметры.Заполнить(ПараметрыОблПодвал);
		ТабличныйДокумент.Вывести(ОблПодвал);
		
		Если Макет.Области.Найти("ВПользовании") <> Неопределено Тогда
			
			ВыдачаВЛичноеПользование	= (ВыборкаШапка.ДополнительноеСобытие = Перечисления.ВидыСобытийОС.ПередачаВЛичноеПользование);
			ВозвратИзЛичногоПользования	= (ВыборкаШапка.ДополнительноеСобытие = Перечисления.ВидыСобытийОС.ВозвратИзЛичногоПользования);
			
			Если ВыдачаВЛичноеПользование Или ВозвратИзЛичногоПользования Тогда
				Сотрудник = ВыборкаШапка.СотрудникЛП;
				Если Не ЗначениеЗаполнено(Сотрудник) Тогда
					Сотрудник = ?(ВыдачаВЛичноеПользование, ВыборкаШапка.МОЛПолучатель, ВыборкаШапка.МОЛОтправитель);
				КонецЕсли;
				ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
					Сотрудник, ВыборкаШапка.Дата);
				Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
				ПараметрыОблПодвал = Новый Структура;
				ПараметрыОблПодвал.Вставить("Заголовок", ?(ВыдачаВЛичноеПользование,
					НСтр("ru = 'Получил в личное пользование'"), НСтр("ru = 'Вернул из личного пользования'")));
				ПараметрыОблПодвал.Вставить("СотрудникДолжность", ДанныеСотрудника.Должность);
				ПараметрыОблПодвал.Вставить("ФИОСотрудник", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
				ОблПодвал2 = Макет.ПолучитьОбласть("ВПользовании");
				ОблПодвал2.Параметры.Заполнить(ПараметрыОблПодвал);
				ТабличныйДокумент.Вывести(ОблПодвал2);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Макет.Области.Найти("Подписи2") <> Неопределено Тогда
			ОблПодвал3 = Макет.ПолучитьОбласть("Подписи2");
			ТабличныйДокумент.Вывести(ОблПодвал3);
		КонецЕсли;
		
		// Выводим движения
		
		ТабличныйДокумент.Вывести(ОблОтметкаБухгалтерии);
		
		ВыборкаДвижений.Сбросить();
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаШапка.Ссылка);
		Проводка = Новый Структура("СчетДт,СчетКт,Сумма");
		Если ВыборкаДвижений.НайтиСледующий(СтруктураПоиска) Тогда
			ВыборкаДвижение = ВыборкаДвижений.Выбрать();
			Пока ВыборкаДвижение.Следующий() Цикл
				Проводка.СчетДт	= ПредставлениеРабочегоСчета(ВыборкаДвижение.КПСДт, ВыборкаДвижение.КФО,
					ВыборкаДвижение.СчетДт, ВыборкаДвижение.КЭКДт);
				Проводка.СчетКт	= ПредставлениеРабочегоСчета(ВыборкаДвижение.КПСКт, ВыборкаДвижение.КФО,
					ВыборкаДвижение.СчетКт, ВыборкаДвижение.КЭККт);
				Проводка.Сумма	= ВыборкаДвижение.Сумма;
				ОблСтрокаПроводки.Параметры.Заполнить(Проводка);
				ТабличныйДокумент.Вывести(ОблСтрокаПроводки);
			КонецЦикла;
		Иначе
			ОблСтрокаПроводки.Параметры.Заполнить(Проводка);
			ТабличныйДокумент.Вывести(ОблСтрокаПроводки);
		КонецЕсли;
		
		//Подписи ответственных лиц
		
		СведенияИсполнителя = СведенияИсполнителяПоОтветственному(ВыборкаШапка.Ответственный,
			ВыборкаШапка.ОрганизацияСсылка, ВыборкаШапка.Дата, Истина);
		
		ДанныеИсполнителя = Новый Структура;
		ДанныеИсполнителя.Вставить("ФИОИсполнитель"			, СведенияИсполнителя.ФИО);
		ДанныеИсполнителя.Вставить("ДолжностьИсполнитель"	, СведенияИсполнителя.ДолжностьНаименование);
		ДанныеИсполнителя.Вставить("НомерТелефона"			, СведенияИсполнителя.НомерТелефона);
		ДанныеИсполнителя.Вставить("ЭлектроннаяПочта"		, СведенияИсполнителя.ЭлектроннаяПочта);
		
		ОблИсполнитель.Параметры.Заполнить(ДанныеИсполнителя);
		ТабличныйДокумент.Вывести(ОблИсполнитель);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Напечатать0504104(МассивОбъектов, ОбъектыПечати, Редакция = "") Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_АктСписания0504104";
	
	ИмяМакета = "ОбщийМакет.ПФ_MXL_Акт0504104" + ?(ЗначениеЗаполнено(Редакция), "_", "") + Редакция;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
	
	Область_Шапка = Макет.ПолучитьОбласть("Шапка");
	Область_ТаблицаШапка = Макет.ПолучитьОбласть("ТаблицаШапка");
	Область_ТаблицаСтрока = Макет.ПолучитьОбласть("ТаблицаСтрока");
	Область_Согласование = Макет.ПолучитьОбласть("Согласование");
	Область_Комиссия = Макет.ПолучитьОбласть("Комиссия");
	Область_ЧленКомиссии = Макет.ПолучитьОбласть("ЧленКомиссии");
	Область_ОтметкиБухгалтерии = Макет.ПолучитьОбласть("ОтметкиБухгалтерии");
	Область_ОтметкиБухгалтерии_ЛинияОтрыва = Макет.ПолучитьОбласть("ОтметкиБухгалтерии_ЛинияОтрыва");
	Область_ОтметкиБухгалтерии_Шапка = Макет.ПолучитьОбласть("ОтметкиБухгалтерии_Шапка");
	Область_ОтметкиБухгалтерии_Строка = Макет.ПолучитьОбласть("ОтметкиБухгалтерии_Строка");
	Область_ОтметкиБухгалтерии_Подвал = Макет.ПолучитьОбласть("ОтметкиБухгалтерии_Подвал");
	Область_Подпись = Макет.ПолучитьОбласть("Подпись");
	Область_НачалоСтраницы = Макет.ПолучитьОбласть("НачалоСтраницы");
	
	ДанныеДокументов	= ДанныеДляПечати0504104(МассивОбъектов);
	ВыборкаДокументов	= ДанныеДокументов[4].Выбрать();
	ВыборкаОбъектов		= ДанныеДокументов[5].Выбрать();
	ВыборкаКомиссия		= ДанныеДокументов[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДвижения		= ДанныеДокументов[7].Выгрузить();
	ВыборкаПричиныСписания = ДанныеДокументов[8].Выбрать();
	
	ПервыйДокумент = Истина;
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		НомерСтраницы = 1;
		
		ПараметрыШапки = Новый Структура;
		
		НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер);
		ПараметрыШапки.Вставить("НомерАкта", НомерАкта);
		
		// Данные руководителя
		РуководительЕстьВЗапросе = Ложь;
		Если ВыборкаДокументов.Владелец().Колонки.Найти("Руководитель") <> Неопределено И ЗначениеЗаполнено(ВыборкаДокументов["Руководитель"]) Тогда
			РуководительЕстьВЗапросе = Истина;
		КонецЕсли;
		
		ФИОРуководителя = "";
		Если РуководительЕстьВЗапросе Тогда                       
			РуководительСсылка = ВыборкаДокументов["Руководитель"];
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", 
				РуководительСсылка, ВыборкаДокументов.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина, Истина);
			ФИОРуководителя = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		Иначе	
			Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
				Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ВыборкаДокументов.Организация,
				ВыборкаДокументов.Дата, ВыборкаДокументов.Подразделение);                                                   
			ФИОРуководителя = КорреспондентыКлиентСервер.ФИО(Руководитель, Истина, "ОтветственноеЛицо");
		КонецЕсли;	
		ПараметрыШапки.Вставить("ФИОРуководителя", ФИОРуководителя);
			
		пВидИмущества = ПредставлениеВидаИмущества(ВыборкаДокументов.ВидИмущества);
		ПараметрыШапки.Вставить("ВидИмущества", пВидИмущества);
		
		Если ЗначениеЗаполнено(ВыборкаДокументов.МОЛ) Тогда
			Сотрудник = Новый Структура("СсылкаНаОбъект,Период,Фамилия,Имя,Отчество",
			ВыборкаДокументов.МОЛ, ВыборкаДокументов.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(Сотрудник);
			ПараметрыШапки.Вставить("ФИОМОЛ", КорреспондентыКлиентСервер.ФИО(Сотрудник));
			ПараметрыШапки.Вставить("ФИОМОЛ_Полностью", Сотрудник.Фамилия + " " + Сотрудник.Имя + " " + Сотрудник.Отчество);
		КонецЕсли;
		
		Область_Шапка.Параметры.Заполнить(ВыборкаДокументов);
		Область_Шапка.Параметры.Заполнить(ПараметрыШапки);
		
		ТабличныйДокумент.Вывести(Область_Шапка);
		
		//Подписи
		
		ДанныеИсполнителя = Новый Структура;
		
		// - ответственное лицо
		
		СведенияИсполнителя = СведенияИсполнителяПоОтветственному(ВыборкаДокументов.Ответственный,
			ВыборкаДокументов.Организация, ВыборкаДокументов.Дата, Истина);
		
		ДанныеИсполнителя.Вставить("ФИООтвИсполнитель"				, СведенияИсполнителя.ФИО);
		ДанныеИсполнителя.Вставить("ДолжностьОтвИсполнитель"		, СведенияИсполнителя.ДолжностьНаименование);
		ДанныеИсполнителя.Вставить("НомерТелефонаОтвИсполнитель"	, СведенияИсполнителя.НомерТелефона);
		ДанныеИсполнителя.Вставить("ЭлектроннаяПочтаОтвИсполнитель"	, СведенияИсполнителя.ЭлектроннаяПочта);
		
		// - Исполнитель
		
		ТекПользователь = Пользователи.АвторизованныйПользователь();
		СведенияИсполнителя = СведенияИсполнителяПоОтветственному(ТекПользователь,
			ВыборкаДокументов.Организация, ВыборкаДокументов.Дата, Истина);
		
		ДанныеИсполнителя.Вставить("ФИОИсполнитель"					, СведенияИсполнителя.ФИО);
		ДанныеИсполнителя.Вставить("ДолжностьИсполнитель"			, СведенияИсполнителя.ДолжностьНаименование);
		ДанныеИсполнителя.Вставить("НомерТелефонаИсполнитель"		, СведенияИсполнителя.НомерТелефона);
		ДанныеИсполнителя.Вставить("ЭлектроннаяПочтаИсполнитель"	, СведенияИсполнителя.ЭлектроннаяПочта);
		
		Область_Подпись.Параметры.Заполнить(ДанныеИсполнителя);
		
		// Таблица
		
		ТабличныйДокумент.Вывести(Область_ТаблицаШапка);
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		ВыборкаОбъектов.Сбросить();
		Пока ВыборкаОбъектов.НайтиСледующий(СтруктураПоиска) Цикл
			
			// заполнение движений в строке.
			// учитываются следующие варианты:
			//
			// если ОС без группового учета
			// а1.- амортизация есть, и она списывается на 101. Амортизацию определяем из движений
			// а2.- списывается остаточная стоимость
			// б1.- амортизация есть, и она списывается не на 101. Амортизацию определяем из движений
			// б2.- списывается балансовая стоимость
			// в1.- амортизации в движениях нет, списывается только балансовая стоимость
			//
			// если ОС с групповым учетом. Амортизацию определяем из строки документа
			// а1.- амортизация есть, и она списывается на 101.
			// а2.- остаточная стоимость 0
			// б1.- амортизация есть, и она списывается не на 101
			// б2.- списывается балансовая стоимость
			// в1.- амортизации нет, списывается только балансовая стоимость
			
			ПараметрыСтроки	= Новый Структура("СуммаА, Сумма, СчетДтА, СчетКтА, СчетДт, СчетКт", 0, 0);
			ДанныеСчета		= Неопределено;
			ДанныеСчетаАм	= Неопределено;
			
			СтоимостьСписанаНаАмортизацию = Ложь;
			СтруктураПоискаДвижений = Новый Структура("Регистратор, ОсновноеСредство",
				ВыборкаДокументов.Ссылка, ВыборкаОбъектов.ОсновноеСредство);
			НайденныеДвижения = ВыборкаДвижения.Скопировать(СтруктураПоискаДвижений);
			Для Каждого ТекущееДвижение Из НайденныеДвижения Цикл
				
				
				Если ТекущееДвижение.ВидПроводки = 1 Тогда
					// списание амортизации на стоимость (на счет 101)
					
					Если ВыборкаОбъектов.ГрупповойУчет Тогда
						// амортизация в проводках не начисляется, если амортизации не было в строке,
						// то и теперь не появится
						Если ВыборкаОбъектов.СуммаАмортизации = 0 Тогда
							Продолжить;
						КонецЕсли;	

						// амортизация и стоимость закрываются между собой
						СтоимостьСписанаНаАмортизацию = Истина;
					КонецЕсли;
					
					ПараметрыСтроки.СуммаА = ПараметрыСтроки.СуммаА + ТекущееДвижение.СуммаСписаннойАмортизации;
					ДанныеСчетаАм = ТекущееДвижение;
					ПараметрыСтроки.Сумма = ПараметрыСтроки.Сумма + ТекущееДвижение.СуммаСписаннойАмортизации;
					
				ИначеЕсли ТекущееДвижение.ВидПроводки = 2 Тогда
					// списание амортизации НЕ на стоимость (НЕ на счет 101)
					
					Если ВыборкаОбъектов.ГрупповойУчет Тогда
						// амортизация в проводках не начисляется, если амортизации не было в строке,
						// то и теперь не появится
						Если ВыборкаОбъектов.СуммаАмортизации = 0 Тогда
							Продолжить;
						КонецЕсли;
						
					КонецЕсли;
					
					ПараметрыСтроки.СуммаА = ПараметрыСтроки.СуммаА + ТекущееДвижение.СуммаСписаннойАмортизации;
					ДанныеСчетаАм = ТекущееДвижение;
					
				ИначеЕсли ТекущееДвижение.ВидПроводки = 3 Тогда
					// списание балансовой стоимости
					
					Если ВыборкаОбъектов.ГрупповойУчет Тогда
						Если СтоимостьСписанаНаАмортизацию Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					
					ПараметрыСтроки.Сумма = ПараметрыСтроки.Сумма + ТекущееДвижение.СуммаСписаннойОстСтоимости;
					ДанныеСчета = ТекущееДвижение;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// сумма списания балансовой стоимости и амортизации не может быть больше балансовой суммы в строке документа
			ПараметрыСтроки.СуммаА = Мин(ВыборкаОбъектов.БалансоваяСтоимость, ПараметрыСтроки.СуммаА);

			// В Сумму входят все списания со счета 101, включая списание на счет 104 (амортизация)
			// Сумма списания остаточной стоимости со счета 101 - это общая сумма списания минус сумма амортизации.
			// При таком расчете сумма остаточной стоимости будет правильной, даже если документ формирует проводки 
			// по исправлению ошибок прошлых периодов!!!
			ПараметрыСтроки.Сумма = Мин(ВыборкаОбъектов.БалансоваяСтоимость, ПараметрыСтроки.Сумма);
			ПараметрыСтроки.Сумма = ПараметрыСтроки.Сумма - ПараметрыСтроки.СуммаА;
			
			Если ЗначениеЗаполнено(ПараметрыСтроки.СуммаА) Тогда
				ПараметрыСтроки.СчетДтА = УправлениеПечатьюБГУ.ПредставлениеСчета(ДанныеСчетаАм, "Дт", Истина);
				ПараметрыСтроки.СчетКтА = УправлениеПечатьюБГУ.ПредставлениеСчета(ДанныеСчетаАм, "Кт", Истина);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПараметрыСтроки.Сумма) Тогда
				ПараметрыСтроки.СчетДт = УправлениеПечатьюБГУ.ПредставлениеСчета(ДанныеСчета, "Дт", Истина);
				ПараметрыСтроки.СчетКт = УправлениеПечатьюБГУ.ПредставлениеСчета(ДанныеСчета, "Кт", Истина);
			КонецЕсли;
			
			ПараметрыСтроки.Вставить("НФАПредставление", ?(ПустаяСтрока(ВыборкаОбъектов.НФАНаименованиеПолное),
				ВыборкаОбъектов.НФАНаименование, ВыборкаОбъектов.НФАНаименованиеПолное));
				
			Если ЗначениеЗаполнено(ВыборкаДокументов.ДатаСписания) Тогда
				ДатаРасчетаСрокаЭксплуатации = ВыборкаДокументов.ДатаСписания;
			Иначе
				ДатаРасчетаСрокаЭксплуатации = ВыборкаДокументов.Дата;
			КонецЕсли;
			ФактическийСрокЭксплуатации = УправлениеОсновнымиСредствами.РассчитатьМесяцыЭксплуатации(
				ВыборкаОбъектов.ДатаПринятияКУчету, ВыборкаОбъектов.ДатаВводаВЭксплуатацию, ДатаРасчетаСрокаЭксплуатации);
			
			ПараметрыСтроки.Вставить("СрокЭкспл", ФактическийСрокЭксплуатации);
			
			Область_ТаблицаСтрока.Параметры.Заполнить(ПараметрыСтроки);
			Область_ТаблицаСтрока.Параметры.Заполнить(ВыборкаОбъектов);
			
			Если Не ТабличныйДокумент.ПроверитьВывод(Область_ТаблицаСтрока) Тогда
				ВывестиНачалоНовойСтраницы(ТабличныйДокумент, Область_НачалоСтраницы, НомерСтраницы);
				ТабличныйДокумент.Вывести(Область_ТаблицаШапка);
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(Область_ТаблицаСтрока);
			
		КонецЦикла;
		
		Область_Согласование.Параметры.Заполнить(ВыборкаДокументов);
		Если Не ТабличныйДокумент.ПроверитьВывод(Область_Согласование) Тогда
			ВывестиНачалоНовойСтраницы(ТабличныйДокумент, Область_НачалоСтраницы, НомерСтраницы);
		КонецЕсли;
		ТабличныйДокумент.Вывести(Область_Согласование);
		
		Область_Комиссия.Параметры.Заполнить(ВыборкаДокументов);
		
		ПараметрыКомиссии = Новый Структура;
		Если ЗначениеЗаполнено(ВыборкаДокументов.ДатаПриказа) Тогда
			ПараметрыКомиссии.Вставить("ДатаПриказа", Формат(ВыборкаДокументов.ДатаПриказа,
				"ДФ='''""''дд''""'' ММММ гггг ''г.'''"));
		Иначе
			ПараметрыКомиссии.Вставить("ДатаПриказа", """___""____________20___г.");
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокументов.НомерПриказа) Тогда
			ПараметрыКомиссии.Вставить("НомерПриказа", ВыборкаДокументов.НомерПриказа);
		Иначе
			ПараметрыКомиссии.Вставить("НомерПриказа", "______________");
		КонецЕсли;
		Область_Комиссия.Параметры.Заполнить(ПараметрыКомиссии);
		
		
		ВыборкаКомиссия.Сбросить();
		КомиссияТекущегоДокумента = Неопределено;
		
		Если ВыборкаКомиссия.НайтиСледующий(СтруктураПоиска) Тогда
			КомиссияТекущегоДокумента = ВыборкаКомиссия.Выбрать();
		КонецЕсли;
		Область_ПодписиКомиссии = УправлениеОсновнымиСредствами.СформироватьОбластьКомиссия(
			ВыборкаДокументов, КомиссияТекущегоДокумента, Область_ЧленКомиссии);  
			
		// Заполним строку "Заключение комиссии"                        
		ЗаключениеКомиссии = "";
		Пока ВыборкаПричиныСписания.НайтиСледующий(СтруктураПоиска) Цикл                                   
			СтрокаПричины = "";
			РезолюцияКомиссии = СокрЛП(ВыборкаПричиныСписания.РезолюцияКомиссии);
			ПричинаСписания   = СокрЛП(ВыборкаПричиныСписания.ПричинаСписания);
			Если ЗначениеЗаполнено(РезолюцияКомиссии) Тогда
				СтрокаПричины = СтрокаПричины + РезолюцияКомиссии;
			КонецЕсли;	

			Если ЗначениеЗаполнено(ПричинаСписания) Тогда
				СтрокаПричины = СтрокаПричины + ?(ЗначениеЗаполнено(СтрокаПричины), " (", "(") + ПричинаСписания + ")";
			КонецЕсли;	

			ЗаключениеКомиссии = ЗаключениеКомиссии + ?(ЗначениеЗаполнено(ЗаключениеКомиссии), "; ", "") + СтрокаПричины;
		КонецЦикла;	
		Область_Комиссия.Параметры.ЗаключениеКомиссии = ЗаключениеКомиссии;
			
		МассивОбластей = Новый Массив;
		МассивОбластей.Добавить(Область_Комиссия);
		МассивОбластей.Добавить(Область_ПодписиКомиссии);
		
		Если Не ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
			ВывестиНачалоНовойСтраницы(ТабличныйДокумент, Область_НачалоСтраницы, НомерСтраницы);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область_Комиссия);
		ТабличныйДокумент.Вывести(Область_ПодписиКомиссии);
		
		ТаблицаПроводок = ВыборкаДвижения.Скопировать(Новый Структура("Регистратор", ВыборкаДокументов.Ссылка));
		ТаблицаПроводок.Свернуть("КФО, СчетДт, КПСДт, КЭКДт, СчетКт, КПСКт, КЭККт", "Сумма");
		
		Если ТаблицаПроводок.Количество() = 0 Тогда
		
			МассивОбластей = Новый Массив;
			МассивОбластей.Добавить(Область_ОтметкиБухгалтерии_ЛинияОтрыва);
			МассивОбластей.Добавить(Область_ОтметкиБухгалтерии);
			МассивОбластей.Добавить(Область_Подпись);
			Если Не ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
				ВывестиНачалоНовойСтраницы(ТабличныйДокумент, Область_НачалоСтраницы, НомерСтраницы);
				// начинать новую страницу с линии отрыва не нужно
				МассивОбластей.Удалить(0);
			КонецЕсли;
			
			Для каждого ТекОбласть Из МассивОбластей Цикл
				
				ТабличныйДокумент.Вывести(ТекОбласть);
				
			КонецЦикла;
			
		Иначе
			
			МассивОбластей = Новый Массив;
			МассивОбластей.Добавить(Область_ОтметкиБухгалтерии_ЛинияОтрыва);
			МассивОбластей.Добавить(Область_ОтметкиБухгалтерии_Шапка);
			
			Для каждого СтрокаПроводки Из ТаблицаПроводок Цикл
			
				ПараметрыПроводки = Новый Структура("СуммаПроводки", СтрокаПроводки.Сумма);
				ПараметрыПроводки.Вставить("СчетДтПроводки", УправлениеПечатьюБГУ.ПредставлениеРабочегоСчета(
					СтрокаПроводки.КПСДт, СтрокаПроводки.КФО, СтрокаПроводки.СчетДт, СтрокаПроводки.КЭКДт));
				ПараметрыПроводки.Вставить("СчетКтПроводки", УправлениеПечатьюБГУ.ПредставлениеРабочегоСчета(
					СтрокаПроводки.КПСКт, СтрокаПроводки.КФО, СтрокаПроводки.СчетКт, СтрокаПроводки.КЭККт));
					
				МассивОбластей.Добавить(Макет.ПолучитьОбласть("ОтметкиБухгалтерии_Строка"));
				МассивОбластей[МассивОбластей.ВГраница()].Параметры.Заполнить(ПараметрыПроводки);
			
			КонецЦикла;
			
			МассивОбластей.Добавить(Область_ОтметкиБухгалтерии_Подвал);
			МассивОбластей.Добавить(Область_Подпись);
			
			Если Не ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
				ВывестиНачалоНовойСтраницы(ТабличныйДокумент, Область_НачалоСтраницы, НомерСтраницы);
				// начинать новую страницу с линии отрыва не нужно
				МассивОбластей.Удалить(0);
			КонецЕсли;
			
			Для каждого ТекОбласть Из МассивОбластей Цикл
				
				ТабличныйДокумент.Вывести(ТекОбласть);
				
			КонецЦикла;
			
		КонецЕсли;
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Напечатать0504105(МассивОбъектов, ОбъектыПечати, Редакция = "") Экспорт
	
	ДанныеДокументов	= ДанныеДляПечати0504105(МассивОбъектов);
	Выборка				= ДанныеДокументов[5].Выбрать();
	ВсеПодписи			= ДанныеДокументов[6].Выгрузить();
	ВыборкаДвижений		= ДанныеДокументов[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТабДок						= Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабДок.ТолькоПросмотр		= Истина;
	ТабДок.АвтоМасштаб			= Истина;
	ТабДок.ИмяПараметровПечати	= "ПараметрыПечати_АктСписания0504105";
	
	ИмяМакета = "ОбщийМакет.ПФ_MXL_Акт0504105" + ?(ЗначениеЗаполнено(Редакция), "_", "") + Редакция;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
	
	Шапка				= Макет.ПолучитьОбласть("Шапка");
	Сведения			= Макет.ПолучитьОбласть("Сведения");
	Характеристики		= Макет.ПолучитьОбласть("Характеристики");
	СнятиеСУчета		= Макет.ПолучитьОбласть("СнятиеСУчета");
	Согласование 		= Макет.ПолучитьОбласть("СведенияСогласование");
	Шапка2				= Макет.ПолучитьОбласть("Шапка2");
	Комиссия			= Макет.ПолучитьОбласть("Комиссия");
	БезЗаключения		= Макет.ПолучитьОбласть("ПустыеСтрокиЗаключенияКомиссии");
	СтрокаРазделитель	= Макет.ПолучитьОбласть("СтрокаРазделитель");
	Приложение			= Макет.ПолучитьОбласть("Приложение");
	БезПриложения		= Макет.ПолучитьОбласть("ПустыеСтрокиПриложения");
	ЧленКомиссии		= Макет.ПолучитьОбласть("ЧленКомиссии");
	БухгалтерияШапка1	= Макет.ПолучитьОбласть("БухгалтерияШапка1|Отметка");
	БухгалтерияСтрока1	= Макет.ПолучитьОбласть("БухгалтерияСтрока1|Отметка");
	БухгалтерияПодвал	= Макет.ПолучитьОбласть("БухгалтерияПодвал|Отметка");
	БухгалтерияШапка2	= Макет.ПолучитьОбласть("БухгалтерияШапка2|Результат");
	БухгалтерияСтрока2	= Макет.ПолучитьОбласть("БухгалтерияСтрока2|Результат");
	Подпись				= Макет.ПолучитьОбласть("Подпись");
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		// Шапка
		
		ПараметрыШапки = Новый Структура;
		ПараметрыШапки.Вставить("НомерАкта"		, ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(Выборка.Ссылка, Выборка.Номер));
		ПараметрыШапки.Вставить("ВидИмущества"	, ПредставлениеВидаИмущества(Выборка.ВидИмущества));
		
		// Данные руководителя
		ОргДиректор = "";
		Если Выборка.Владелец().Колонки.Найти("Руководитель") <> Неопределено И ЗначениеЗаполнено(Выборка["Руководитель"]) Тогда
			РуководительСсылка = Выборка["Руководитель"];
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", 
				РуководительСсылка, Выборка.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина, Истина);
			ОргДиректор = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		Иначе	
			Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
				Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, Выборка.Организация, Выборка.Дата);
			ОргДиректор = КорреспондентыКлиентСервер.ФИО(Руководитель, Истина, "ОтветственноеЛицо");
		КонецЕсли;	
		ПараметрыШапки.Вставить("ОргДиректор", ОргДиректор);

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.Заполнить(ПараметрыШапки);
		
		ТабДок.Вывести(Шапка);
		
		// Сведения
		
		Сведения.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Сведения);
		
		// Характеристики
		
		Характеристики.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Характеристики);
		
		// Снятие с учета
		
		СнятиеСУчета.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(СнятиеСУчета);
		
		// ...
		
		ТабДок.Вывести(Согласование);
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДок.Вывести(Шапка2);
		
		// Комиссия
		
		ПараметрыКомиссии = Новый Структура;
		ПараметрыКомиссии.Вставить("ДатаПриказа", Формат(Выборка.ДатаПриказа, "ДФ='''""''дд''""'' ММММ гггг ''г.'''; ДП='""___"" _________ 20___г.'"));
		ПараметрыКомиссии.Вставить("НомерПриказа", ?(ЗначениеЗаполнено(Выборка.НомерПриказа), Выборка.НомерПриказа, "______________"));
		
		Комиссия.Параметры.Заполнить(Выборка);
		Комиссия.Параметры.Заполнить(ПараметрыКомиссии);
		ТабДок.Вывести(Комиссия);
		
		Если НЕ ЗначениеЗаполнено(Выборка.ЗаключениеКомиссии) Тогда
			ТабДок.Вывести(БезЗаключения);
		Иначе
			ТабДок.Вывести(СтрокаРазделитель);
		КонецЕсли;
		
		Приложение.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Приложение);
		
		Если НЕ ЗначениеЗаполнено(Выборка.Приложение) Тогда
			ТабДок.Вывести(БезПриложения);
		Иначе
			ТабДок.Вывести(СтрокаРазделитель);
		КонецЕсли;
		
		// Члены комиссии
		
		ЧленКомиссии.Параметры.Заголовок = "Председатель комиссии:";
		ЧленКомиссии.Параметры.Должность = Выборка.Должность;
		ЧленКомиссии.Параметры.ФИО = КорреспондентыКлиентСервер.ФИО(Выборка);
		ТабДок.Вывести(ЧленКомиссии);
		
		ПодписиДокумента = ВсеПодписи.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка));
		Первый = Истина;
		Для Каждого ПодписьДокумента Из ПодписиДокумента Цикл
			ЧленКомиссии.Параметры.Заголовок = ?(Первый, "Члены комиссии:", "");
			ЧленКомиссии.Параметры.Должность = ПодписьДокумента.Должность;
			ЧленКомиссии.Параметры.ФИО = КорреспондентыКлиентСервер.ФИО(ПодписьДокумента);
			ТабДок.Вывести(ЧленКомиссии);
			Первый = Ложь;
		КонецЦикла;
		
		// Снятие с учета
		
		СнятиеСУчета.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(СнятиеСУчета);
		
		// Бухгалтерия
		
		ТабДокБухгалтерия = Новый ТабличныйДокумент;
		ТабДокБухгалтерия.Вывести(БухгалтерияШапка1);
		
		ВыборкаДвижений.Сбросить();
		НетДвижений = Истина;
		СтруктураПоиска = Новый Структура("Ссылка", Выборка.Ссылка);
		Если ВыборкаДвижений.НайтиСледующий(СтруктураПоиска) Тогда
			ВыборкаДвиженийТекДок = ВыборкаДвижений.Выбрать();
			Пока ВыборкаДвиженийТекДок.Следующий() Цикл
				НетДвижений = Ложь;
				БухгалтерияСтрока1.Параметры.СчетДт = ПредставлениеСчета(ВыборкаДвиженийТекДок, "Дт");
				БухгалтерияСтрока1.Параметры.СчетКт = ПредставлениеСчета(ВыборкаДвиженийТекДок, "Кт");
				БухгалтерияСтрока1.Параметры.Сумма = ВыборкаДвиженийТекДок.Сумма;
				ТабДокБухгалтерия.Вывести(БухгалтерияСтрока1);
			КонецЦикла;
		КонецЕсли;
		
		Если НетДвижений Тогда
			БухгалтерияСтрока1.Параметры.СчетДт = "";
			БухгалтерияСтрока1.Параметры.СчетКт = "";
			БухгалтерияСтрока1.Параметры.Сумма = 0;
			ТабДокБухгалтерия.Вывести(БухгалтерияСтрока1);
			
			БухгалтерияСтрока1.Параметры.СчетДт = "";
			БухгалтерияСтрока1.Параметры.СчетКт = "";
			БухгалтерияСтрока1.Параметры.Сумма = 0;
			ТабДокБухгалтерия.Вывести(БухгалтерияСтрока1);
		КонецЕсли;
		
		ТабДокБухгалтерия.Вывести(БухгалтерияПодвал);
		
		ТабДок.Присоединить(ТабДокБухгалтерия);
		
		ТабДокБухгалтерия = Новый ТабличныйДокумент;
		ТабДокБухгалтерия.Вывести(БухгалтерияШапка2);
		ТабДокБухгалтерия.Вывести(БухгалтерияСтрока2);
		
		ТабДок.Присоединить(ТабДокБухгалтерия);
		
		//Подписи
		
		ДанныеИсполнителя = Новый Структура;
		
		// - ответственное лицо
		
		СведенияИсполнителя = СведенияИсполнителяПоОтветственному(Выборка.Ответственный, Выборка.Организация, Выборка.Дата, Истина);
		
		ДанныеИсполнителя = Новый Структура;
		ДанныеИсполнителя.Вставить("ФИООтвИсполнитель"				, СведенияИсполнителя.ФИО);
		ДанныеИсполнителя.Вставить("ДолжностьОтвИсполнитель"		, СведенияИсполнителя.ДолжностьНаименование);
		ДанныеИсполнителя.Вставить("НомерТелефонаОтвИсполнитель"	, СведенияИсполнителя.НомерТелефона);
		ДанныеИсполнителя.Вставить("ЭлектроннаяПочтаОтвИсполнитель"	, СведенияИсполнителя.ЭлектроннаяПочта);
		
		// - Исполнитель
		
		ТекПользователь = Пользователи.АвторизованныйПользователь();
		СведенияИсполнителя = СведенияИсполнителяПоОтветственному(ТекПользователь, Выборка.Организация, Выборка.Дата, Истина);
		
		ДанныеИсполнителя.Вставить("ФИОИсполнитель"					, СведенияИсполнителя.ФИО);
		ДанныеИсполнителя.Вставить("ДолжностьИсполнитель"			, СведенияИсполнителя.ДолжностьНаименование);
		ДанныеИсполнителя.Вставить("НомерТелефонаИсполнитель"		, СведенияИсполнителя.НомерТелефона);
		ДанныеИсполнителя.Вставить("ЭлектроннаяПочтаИсполнитель"	, СведенияИсполнителя.ЭлектроннаяПочта);
		
		Подпись.Параметры.Заполнить(ДанныеИсполнителя);
		ТабДок.Вывести(Подпись);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок,
			НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Функция Напечатать0504205(Запрос, ОбъектыПечати, ИмяМакета = "ПФ_MXL_Накладная0504205") Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_Накладная0504205";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет." + ИмяМакета);
	
	ОбластьМакетаЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакетаШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаСтрока		= Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаИтого		= Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент = Истина;
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакетаЗаголовок.Параметры.Заполнить(ВыборкаШапка);
		ОбластьМакетаЗаголовок.Параметры.Заполнить(Новый Структура("ДатаЗаголовка", Формат(ВыборкаШапка.Дата, "ДФ='dd MMMM yyyy'") + " г."));
		
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(
			ОбластьМакетаЗаголовок, "Номер", ВыборкаШапка.Номер, ВыборкаШапка.Ссылка, Неопределено, Истина);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
		
		КоличествоИтого 	= 0;
		СуммаБезНДСИтого	= 0;
		СуммаНДСИтого 		= 0;
		ВсегоИтого 			= 0;
		
		СтрокаТаблицы = ВыборкаШапка.Выбрать();
		
		Пока СтрокаТаблицы.Следующий() Цикл
			
			ОбластьМакетаСтрока.Параметры.Заполнить(СтрокаТаблицы);
			
			СчетДт = УправлениеПечатьюБГУ.ПредставлениеСчета(СтрокаТаблицы, "Дт", Истина);
			СчетКт = УправлениеПечатьюБГУ.ПредставлениеСчета(СтрокаТаблицы, "Кт", Истина);
			
			ОбластьМакетаСтрока.Параметры.Заполнить(Новый Структура("Дебет, Кредит", СчетДт, СчетКт));
			
			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
			
			КоличествоИтого		= КоличествоИтого 	+ СтрокаТаблицы.Количество;
			СуммаБезНДСИтого	= СуммаБезНДСИтого	+ СтрокаТаблицы.СуммаБезНДС;
			СуммаНДСИтого		= СуммаНДСИтого		+ СтрокаТаблицы.СуммаНДС;
			ВсегоИтого			= ВсегоИтого		+ СтрокаТаблицы.СуммаВсего;
			
		КонецЦикла;
		
		СтруктураОбластьМакетаИтого = Новый Структура;
		СтруктураОбластьМакетаИтого.Вставить("КоличествоИтого"	, КоличествоИтого);
		СтруктураОбластьМакетаИтого.Вставить("СуммаБезНДСИтого"	, СуммаБезНДСИтого);
		СтруктураОбластьМакетаИтого.Вставить("СуммаНДСИтого"	, СуммаНДСИтого);
		СтруктураОбластьМакетаИтого.Вставить("СуммаВсегоИтого"	, ВсегоИтого);
		
		ОбластьМакетаИтого.Параметры.Заполнить(СтруктураОбластьМакетаИтого);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
		
		СтруктураОбластьМакетаПодвал = Новый Структура;
		
		СтруктураОбластьМакетаПодвал.Вставить("СуммаВсегоИтогоПрописью",
			ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(ВсегоИтого, Неопределено));
		
		ГлБухгалтер = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(ВыборкаШапка.Организация,
			Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, ВыборкаШапка.Дата);
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество",
			ГлБухгалтер.ОтветственноеЛицоСсылка, ВыборкаШапка.Дата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
		
		СтруктураОбластьМакетаПодвал.Вставить("ФИОБухгалтер", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
			ВыборкаШапка.Отпустил, ВыборкаШапка.Дата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
		
		ЦМОФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		ЦМОДолжность = ДанныеСотрудника.Должность;
		
		СтруктураОбластьМакетаПодвал.Вставить("ФИООтпустил"			, ЦМОФИО);
		СтруктураОбластьМакетаПодвал.Вставить("ДолжностьОтпустил"	, ЦМОДолжность);
		СтруктураОбластьМакетаПодвал.Вставить("ФИОПолучил"			, "");
		СтруктураОбластьМакетаПодвал.Вставить("ДолжностьПолучил"	, "");
		
		СтруктураОбластьМакетаПодвал.Вставить("ФИОИсполнитель", "");
		СтруктураОбластьМакетаПодвал.Вставить("ДолжностьИсполнитель", "");
		СтруктураОбластьМакетаПодвал.Вставить("ТелефонИсполнитель", "");
		СтруктураОбластьМакетаПодвал.Вставить("ЭлАдресИсполнитель", "");
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаШапка, "ОтветственныйИсполнитель")
			И ЗначениеЗаполнено(ВыборкаШапка.ОтветственныйИсполнитель) Тогда

			ДанныеОтветственного = Справочники.Сотрудники.ДанныеСотрудника(ВыборкаШапка.ОтветственныйИсполнитель,
				"Фамилия, Имя, Отчество, Должность",
				ВыборкаШапка.Дата,
				Истина);
			СтруктураОбластьМакетаПодвал.ФИОИсполнитель = КорреспондентыКлиентСервер.ФИО(ДанныеОтветственного, Истина);
			СтруктураОбластьМакетаПодвал.ДолжностьИсполнитель = ДанныеОтветственного.Должность;
			СтруктураОбластьМакетаПодвал.ТелефонИсполнитель = ДанныеОтветственного.ТелефонРабочийФизическиеЛица;
			СтруктураОбластьМакетаПодвал.ЭлАдресИсполнитель = ДанныеОтветственного.EmailФизическиеЛица;
			
		Иначе
		
			СведенияИсполнителя = СведенияИсполнителяПоОтветственному(ВыборкаШапка.Ответственный,
				ВыборкаШапка.Организация, ВыборкаШапка.Дата, Истина);
			
			СтруктураОбластьМакетаПодвал.ФИОИсполнитель = СведенияИсполнителя.ФИО;
			СтруктураОбластьМакетаПодвал.ДолжностьИсполнитель = СведенияИсполнителя.Должность;
			СтруктураОбластьМакетаПодвал.ТелефонИсполнитель = СведенияИсполнителя.НомерТелефона;
			СтруктураОбластьМакетаПодвал.ЭлАдресИсполнитель = СведенияИсполнителя.ЭлектроннаяПочта;
		КонецЕсли;
		
		СтруктураОбластьМакетаПодвал.Вставить("ПериодЖурнала", Формат(ВыборкаШапка.Дата, "ДФ='MMMM yyyy'"));
		
		ОбластьМакетаПодвал.Параметры.Заполнить(СтруктураОбластьМакетаПодвал);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Напечатать0510434.
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
//  ОбъектыПечати - 
//  ДанныеДляПечати - см. ТаблицаШапкиДляПечатиАктПриемаПередачиИмуществаВЛичномПользовании0510434
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Напечатать0510434
Функция Напечатать0510434(МассивОбъектов, ОбъектыПечати, ДанныеДляПечати) Экспорт
	
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Акт0510434";
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Акт0510434");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьР1Шапка		= Макет.ПолучитьОбласть("Раздел1_Шапка");
	ОбластьР1Строка		= Макет.ПолучитьОбласть("Раздел1_Строка");
	ОбластьР1Подвал		= Макет.ПолучитьОбласть("Раздел1_Подвал");
	ОбластьР2Шапка		= Макет.ПолучитьОбласть("Раздел2_Шапка");
	ОбластьР2Строка		= Макет.ПолучитьОбласть("Раздел2_Строка");
	ОбластьР2Подвал		= Макет.ПолучитьОбласть("Раздел2_Подвал");
	ОбластьПринял		= Макет.ПолучитьОбласть("Раздел_Принял");
	ОбластьСдал			= Макет.ПолучитьОбласть("Раздел_Сдал");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал_Дата");

	ДанныеПечатиОбщие = ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	
	
	ПервыйДокумент = Истина;
	Для Каждого ВыборкаДокументов Из ДанныеДляПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Шапка
		ДанныеПечатиОбщиеДокумента = ДанныеПечатиОбщие.Получить(ВыборкаДокументов.Ссылка);
		
		ПараметрыОрганизации = Новый Структура;
		ПараметрыОрганизации.Вставить("НаименованиеОрганизации"                , ДанныеПечатиОбщиеДокумента.НаименованиеОрганизации);
		ПараметрыОрганизации.Вставить("Организация"                            , ДанныеПечатиОбщиеДокумента.Организация);
		ПараметрыОрганизации.Вставить("КодРПБС"                                , ДанныеПечатиОбщиеДокумента.КодРПБС);
		ПараметрыОрганизации.Вставить("НаименованиеОбособленногоПодразделения" , ДанныеПечатиОбщиеДокумента.НаименованиеОбособленногоПодразделения);
		ПараметрыОрганизации.Вставить("ОбособленноеПодразделение"              , ДанныеПечатиОбщиеДокумента.ОбособленноеПодразделение);
		ПараметрыОрганизации.Вставить("КодРПБСПодр"                            , ДанныеПечатиОбщиеДокумента.КодРПБСОбособленногоПодразделения);
		ПараметрыОрганизации.Вставить("НаименованиеСтруктурногоПодразделения"  , ДанныеПечатиОбщиеДокумента.СтруктурноеПодразделение);
		ПараметрыОрганизации.Вставить("СтруктурноеПодразделение"               , ДанныеПечатиОбщиеДокумента.СтруктурноеПодразделение);
		ПараметрыОрганизации.Вставить("Учредитель"                             , ДанныеПечатиОбщиеДокумента.Учредитель);
		ПараметрыОрганизации.Вставить("ГлаваБК"                                , ДанныеПечатиОбщиеДокумента.ГлаваБК);
		ПараметрыОрганизации.Вставить("БюджетНаименование"                     , ДанныеПечатиОбщиеДокумента.БюджетНаименование);
		ПараметрыОрганизации.Вставить("ОКТМО"                                  , ДанныеПечатиОбщиеДокумента.ОКТМО);
		
		ПараметрыШапки	= Новый Структура;
		
		Если ВыборкаДокументов.Операция = 1 Тогда
			НаименованиеОперации = НСтр("ru = 'выдача имущества в пользование'");
		Иначе
			НаименованиеОперации = НСтр("ru = 'возврат имущества'");
		КонецЕсли;
		ПараметрыШапки.Вставить("НаименованиеОперации", НаименованиеОперации);
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьШапка.Параметры.Заполнить(ПараметрыОрганизации);
		ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		
		// Основные средства
		ТабличныйДокумент.Вывести(ОбластьР1Шапка);
		
		Если ВыборкаДокументов.ОсновныеСредства.Количество() > 0 Тогда	
			Сумма = 0;
			ПустаяНормаВыдачи = Новый Структура("НормаВыдачи", "");
			Для Каждого ВыборкаОС Из ВыборкаДокументов.ОсновныеСредства Цикл
				ОбластьР1Строка.Параметры.Заполнить(ВыборкаОС);
				ДопПарам = Новый Структура;
				Если ЗначениеЗаполнено(ВыборкаОС.СрокПолезногоИспользования) Тогда
					ДопПарам.Вставить("СрокПолезногоИспользования", Строка(ВыборкаОС.СрокПолезногоИспользования)
						+ " " + ?(ВыборкаОС.ЕдиницаИзмеренияСрока = 1, НСтр("ru = 'д.'"), НСтр("ru = 'м.'")));
				КонецЕсли;
				Если ВыборкаДокументов.Операция <> 1 Тогда
					// При возврате из пользования норма выдачи не заполняется
					ОбластьР2Строка.Параметры.Заполнить(ПустаяНормаВыдачи);
					ОбластьР1Строка.Параметры.Заполнить(ПустаяНормаВыдачи);
				КонецЕсли;
				ОбластьР1Строка.Параметры.Заполнить(ДопПарам);
				ТабличныйДокумент.Вывести(ОбластьР1Строка);
				Сумма = Сумма + ВыборкаОС.Сумма;
			КонецЦикла;
				
			ОбластьР1Подвал.Параметры.Заполнить(Новый Структура("Сумма", Сумма));
			ТабличныйДокумент.Вывести(ОбластьР1Подвал);
			
		КонецЕсли;
		
		// Материальные запасы
		ТабличныйДокумент.Вывести(ОбластьР2Шапка);
		
		Если ВыборкаДокументов.МатериальныеЗапасы.Количество() > 0 Тогда	
			Сумма = 0;
			
			Для Каждого ВыборкаМЗ Из ВыборкаДокументов.МатериальныеЗапасы Цикл
				ОбластьР2Строка.Параметры.Заполнить(ВыборкаМЗ);
				Если ЗначениеЗаполнено(ВыборкаМЗ.СрокПолезногоИспользования) Тогда
					ДопПарам = Новый Структура("СрокПолезногоИспользования", Строка(ВыборкаМЗ.СрокПолезногоИспользования)
						+ " " + ?(ВыборкаМЗ.ЕдиницаИзмеренияСрока = 1, НСтр("ru = 'д.'"), НСтр("ru = 'м.'")));
					ОбластьР2Строка.Параметры.Заполнить(ДопПарам);
				КонецЕсли;
				Если ВыборкаДокументов.Операция <> 1 Тогда
					// При возврате из пользования норма выдачи не заполняется
					ОбластьР2Строка.Параметры.Заполнить(Новый Структура("НормаВыдачи", ""));
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьР2Строка);
				Сумма = Сумма + ВыборкаМЗ.Сумма;
			КонецЦикла;
			
			ОбластьР2Подвал.Параметры.Заполнить(Новый Структура("Сумма", Сумма));
			ТабличныйДокумент.Вывести(ОбластьР2Подвал);
			
		КонецЕсли;
		
		ДанныеОтправителя = Новый Структура("НаименованиеДолжности,Должность,Сотрудник,ФИО",
			ВыборкаДокументов.ОбъектыСдалНаименованиеДолжности,
			ВыборкаДокументов.ОбъектыСдалДолжность,
			ВыборкаДокументов.ОбъектыСдалСотрудник,
			ВыборкаДокументов.ОбъектыСдалФИО);
		ДанныеПолучателя = Новый Структура("НаименованиеДолжности,Должность,Сотрудник,ФИО",
			ВыборкаДокументов.ОбъектыПринялНаименованиеДолжности,
			ВыборкаДокументов.ОбъектыПринялДолжность,
			ВыборкаДокументов.ОбъектыПринялСотрудник,
			ВыборкаДокументов.ОбъектыПринялФИО);
			
		ОбластьПринял.Параметры.Заполнить(ДанныеПолучателя);
		ОбластьСдал.Параметры.Заполнить(ДанныеОтправителя);
		
		ТабличныйДокумент.Вывести(ОбластьПринял);
		ТабличныйДокумент.Вывести(ОбластьСдал);
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Напечатать0510435(МассивОбъектов, ОбъектыПечати, ДанныеДляПечати) Экспорт
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПроверитьДостижениеКворумаПрисутствияПриПечати(МассивОбъектов);
	// Конец ИндикаторКворумаПрисутствия
	
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Акт0510435";
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Акт0510435");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьР11Шапка		= Макет.ПолучитьОбласть("Раздел11_Шапка");
	ОбластьР11Строка	= Макет.ПолучитьОбласть("Раздел11_Строка");
	ОбластьР12Шапка		= Макет.ПолучитьОбласть("Раздел12_Шапка");
	ОбластьР12Строка	= Макет.ПолучитьОбласть("Раздел12_Строка");
	ОбластьР2Шапка		= Макет.ПолучитьОбласть("Раздел2_Шапка");
	ОбластьР21Шапка		= Макет.ПолучитьОбласть("Раздел21_Шапка");
	ОбластьР21Строка	= Макет.ПолучитьОбласть("Раздел21_Строка");
	ОбластьР22Шапка		= Макет.ПолучитьОбласть("Раздел22_Шапка");
	ОбластьР22Строка	= Макет.ПолучитьОбласть("Раздел22_Строка");
	ОбластьСШапка		= Макет.ПолучитьОбласть("Справочно_Шапка");
	ОбластьССтрока		= Макет.ПолучитьОбласть("Справочно_Строка");
	ОбластьПустаяСтрока	= Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПриложение	= Макет.ПолучитьОбласть("Приложение");
	ОбластьЗаголовокКомиссии = Макет.ПолучитьОбласть("ЗаголовокКомиссии");
	ОбластьКомиссияС	= Макет.ПолучитьОбласть("Комиссия_Строка");
	ОбластьИсполнитель	= Макет.ПолучитьОбласть("Исполнитель");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	ДанныеОрганизацийПечати = ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	СоставКомиссий = ОбщегоНазначенияБГУ.СоставКомиссийПоДокументам(МассивОбъектов);
	
	ОбъединяемыеКолонки11 = ОбъединяемыеКолонкиАктаОбУтилизации0510435_11();
	ОбъединяемыеКолонки12 = ОбъединяемыеКолонкиАктаОбУтилизации0510435_12();
	
	ПервыйДокумент = Истина;
	Для Каждого ВыборкаДокументов Из ДанныеДляПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Шапка
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаДокументов);
		ДанныеОрганизации = ДанныеОрганизацийПечати.Получить(ВыборкаДокументов.Ссылка);
		ОбластьШапка.Параметры.Заполнить(ДанныеОрганизации);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// Раздел 11
		
		ТабличныйДокумент.Вывести(ОбластьР11Шапка);
		Для Каждого ВыборкаОС Из ВыборкаДокументов.ИнвентарныеОбъекты Цикл
			ОбластьР11Строка.Параметры.Заполнить(ВыборкаОС);
			Если ВыборкаОС.Драгматериалы.Количество() > 0 Тогда
				ОбластьСтрокаСДМ = Новый ТабличныйДокумент;
				ПустыеКолонки = Новый Структура("НаименованиеОС,ИнвентарныйНомер,КодСтроки,Стоимость,ДокументНаименование,ДокументДата,ДокументНомер");
				Для Каждого ДрагМатериал Из ВыборкаОС.Драгматериалы Цикл 
					ОбластьР11Строка.Параметры.Заполнить(ДрагМатериал);
					ОбластьСтрокаСДМ.Вывести(ОбластьР11Строка);
					ОбластьР11Строка.Параметры.Заполнить(ПустыеКолонки);
				КонецЦикла;
				ВысотаОбласти = ВыборкаОС.Драгматериалы.Количество();
				Для Каждого ОбъединяемыйДиапазон Из ОбъединяемыеКолонки11 Цикл
					ОбластьСтрокаСДМ.Область(1, ОбъединяемыйДиапазон.НачальнаяКолонка, ВысотаОбласти, ОбъединяемыйДиапазон.КонечнаяКолонка).Объединить();
				КонецЦикла;
				Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьСтрокаСДМ) Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьСтрокаСДМ);
			Иначе
				ПустыеДрагматериалы = Новый Структура("Деталь, Драгметалл, НаименованиеЕИ, КодЕИ, Количество");
				ОбластьР11Строка.Параметры.Заполнить(ПустыеДрагМатериалы);
				ТабличныйДокумент.Вывести(ОбластьР11Строка);
			КонецЕсли;
		КонецЦикла;
		
		// Раздел 12
		
		ТабличныйДокумент.Вывести(ОбластьР12Шапка);
		Для Каждого ВыборкаМЗ Из ВыборкаДокументов.НеинвентарныеОбъекты Цикл
			ОбластьР12Строка.Параметры.Заполнить(ВыборкаМЗ);
			Если ВыборкаМЗ.Драгматериалы.Количество() > 0 Тогда
				ОбластьСтрокаСДМ = Новый ТабличныйДокумент;
				ПустыеКолонки = Новый Структура("НаименованиеМЗ,НоменклатурныйНомер,КодСтроки,НаименованиеЕИМЗ,КодЕИМЗ,КоличествоМЗ,Сумма,ДокументНаименование,ДокументДата,ДокументНомер");
				Для Каждого ДрагМатериал Из ВыборкаМЗ.Драгматериалы Цикл 
					ОбластьР12Строка.Параметры.Заполнить(ДрагМатериал);
					ОбластьСтрокаСДМ.Вывести(ОбластьР12Строка);
					ОбластьР12Строка.Параметры.Заполнить(ПустыеКолонки);
				КонецЦикла;
				ВысотаОбласти = ВыборкаМЗ.Драгматериалы.Количество();
				Для Каждого ОбъединяемыйДиапазон Из ОбъединяемыеКолонки12 Цикл
					ОбластьСтрокаСДМ.Область(1, ОбъединяемыйДиапазон.НачальнаяКолонка, ВысотаОбласти, ОбъединяемыйДиапазон.КонечнаяКолонка).Объединить();
				КонецЦикла;
				Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьСтрокаСДМ) Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьСтрокаСДМ);
			Иначе
				ПустыеДрагматериалы = Новый Структура("Деталь, Драгметалл, НаименованиеЕИ, КодЕИ, Количество");
				ОбластьР12Строка.Параметры.Заполнить(ПустыеДрагМатериалы);
				ТабличныйДокумент.Вывести(ОбластьР12Строка);
			КонецЕсли;
			
		КонецЦикла;
		
		// Раздел 2
		
		ТабличныйДокумент.Вывести(ОбластьР2Шапка);
		
		// Раздел 21
		
		ТабличныйДокумент.Вывести(ОбластьР21Шапка);
		
		Для Каждого МероприятиеПоУтилизации Из ВыборкаДокументов.МероприятияПоУтилизации Цикл
			ОбластьР21Строка.Параметры.Заполнить(МероприятиеПоУтилизации);
			ТабличныйДокумент.Вывести(ОбластьР21Строка);
		КонецЦикла;
		
		// Раздел 22
		
		ТабличныйДокумент.Вывести(ОбластьР22Шапка);
		Для Каждого ВыборкаПолученныеМЗ Из ВыборкаДокументов.ПолученныеМЦ Цикл
			ОбластьР22Строка.Параметры.Заполнить(ВыборкаПолученныеМЗ);
			ТабличныйДокумент.Вывести(ОбластьР22Строка);
		КонецЦикла;
		
		// Справочно
		
		ТабличныйДокумент.Вывести(ОбластьСШапка);
		Для Каждого ВыборкаДМПолученныхМЗ Из ВыборкаДокументов.ПолученныеДрагматериалы Цикл
			ОбластьССтрока.Параметры.Заполнить(ВыборкаДМПолученныхМЗ);
			ТабличныйДокумент.Вывести(ОбластьССтрока);
		КонецЦикла;
		
		// Приложения
		
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		ВывестиПриложенияПриПечати(ТабличныйДокумент, ВыборкаДокументов.Ссылка, ОбластьПриложение);
		
		// Комиссия

		ТабличныйДокумент.Вывести(ОбластьЗаголовокКомиссии);
		ВывестиСоставКомиссииПриПечати(ТабличныйДокумент, ВыборкаДокументов.Ссылка, ОбластьКомиссияС, СоставКомиссий);
		
		// Исполнитель
		
		ДанныеОтветственного = Новый Структура;
		ДанныеОтветственного.Вставить("Должность", ДанныеОрганизации.ОтветственныйДолжность);
		ДанныеОтветственного.Вставить("ДолжностьНаименование", Строка(ДанныеОрганизации.ОтветственныйДолжность));
		ДанныеОтветственного.Вставить("ФИО", КорреспондентыКлиентСервер.ФИО(ДанныеОрганизации.ОтветственныйФИО, Истина));
		ДанныеОтветственного.Вставить("Исполнитель", ДанныеОрганизации.ОтветственныйИсполнитель);
		ДанныеОтветственного.Вставить("НомерТелефона", ДанныеОрганизации.ОтветственныйТелефон);
		ДанныеОтветственного.Вставить("ЭлектроннаяПочта", ДанныеОрганизации.ОтветственныйЭлПочта);

		ОбластьИсполнитель.Параметры.Заполнить(ДанныеОтветственного);
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);
		
		// Подвал
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Возвращает табличный документ, содержащий распечатанные Требования-накладные ф.0510451.
// Одновременно в ОбъектыПечати устанавливаются выведенные документы для перехода по табличному документу.
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
// 
// Возвращаемое значение:
//  ТабличныйДокумент
Функция НапечататьТребованияНакладную0510451(МассивОбъектов, ОбъектыПечати) Экспорт

	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_ТребованиеНакладная0510451";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ТребованиеНакладная0510451_100н");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокГруппаНФА = Макет.ПолучитьОбласть("ЗаголовокГруппаНФА");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ДанныеДляПечати = ДанныеДляПечатиТребованияНакладной0510451(МассивОбъектов);
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	ОбластиДляПроверкиИтого = Новый Массив(2);
	// Область "Итого" не меняет высоту. Ее сразу добавляем в проверяемый массив.
	ОбластиДляПроверкиИтого[1] = ОбластьИтого;
	
	ОбластиДляПроверкиИтогоСПодвалом = Новый Массив(3);
	// Область "Итого" не меняет высоту. Ее сразу добавляем в проверяемый массив.
	ОбластиДляПроверкиИтогоСПодвалом[1] = ОбластьИтого;
	
	ПустаяДатаПодписи = """______""________________________20______г.";
	ФорматДатыПодписи = "ДФ='''""''дд''""'' ММММ гггг ''г.'''";
	
	ПервыйДокумент = Истина;
	Для Каждого СтрокаШапки Из ДанныеДляПечати.ДанныеШапки Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьЗаголовок.Параметры.Заполнить(СтрокаШапки);
		ПараметрыЗаголовка = Новый Структура;
		Если ЗначениеЗаполнено(СтрокаШапки.ОтветственныйДатаПодписи) Тогда
			ОтветственныйДатаПодписи = Формат(СтрокаШапки.ОтветственныйДатаПодписи, ФорматДатыПодписи);
		Иначе
			ОтветственныйДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыЗаголовка.Вставить("ОтветственныйДатаПодписи", ОтветственныйДатаПодписи);
		Если ЗначениеЗаполнено(СтрокаШапки.ОтпустилДатаПодписи) Тогда
			ОтпустилДатаПодписи = Формат(СтрокаШапки.ОтпустилДатаПодписи, ФорматДатыПодписи);
		Иначе
			ОтпустилДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыЗаголовка.Вставить("ОтпустилДатаПодписи", ОтпустилДатаПодписи);
		Если ЗначениеЗаполнено(СтрокаШапки.ЗатребовалДатаПодписи) Тогда
			ЗатребовалДатаПодписи = Формат(СтрокаШапки.ЗатребовалДатаПодписи, ФорматДатыПодписи);
		Иначе
			ЗатребовалДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыЗаголовка.Вставить("ЗатребовалДатаПодписи", ЗатребовалДатаПодписи);
		Если ЗначениеЗаполнено(СтрокаШапки.ПолучилДатаПодписи) Тогда
			ПолучилДатаПодписи = Формат(СтрокаШапки.ПолучилДатаПодписи, ФорматДатыПодписи);
		Иначе
			ПолучилДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыЗаголовка.Вставить("ПолучилДатаПодписи", ПолучилДатаПодписи);
		Если ЗначениеЗаполнено(СтрокаШапки.УполномоченноеЛицоДатаПодписи) Тогда
			УполномоченноеЛицоДатаПодписи = Формат(СтрокаШапки.УполномоченноеЛицоДатаПодписи, ФорматДатыПодписи);
		Иначе
			УполномоченноеЛицоДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыЗаголовка.Вставить("УполномоченноеЛицоДатаПодписи", УполномоченноеЛицоДатаПодписи);
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыЗаголовка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		// Заполнить область "Подвал" и добавить ее для проверки вывода
		ОбластьПодвал.Параметры.Заполнить(СтрокаШапки);
		ОбластьПодвал.Параметры.Заполнить(ПараметрыЗаголовка);
		ОбластиДляПроверкиИтогоСПодвалом[2] = ОбластьПодвал;
		
		ТабличнаяЧасть = ДанныеДляПечати.ТабличнаяЧасть.Получить(СтрокаШапки.Ссылка); // Массив из см. ЗаголовокТабличнойЧастиТребованияНакладной0510451
		Если ТабличнаяЧасть <> Неопределено Тогда
			КоличествоГруппНФА = ТабличнаяЧасть.Количество();
			ТекущаяГруппаНФА = 1;
			Для Каждого ГруппаНФА Из ТабличнаяЧасть Цикл
				ОбластьЗаголовокГруппаНФА.Параметры.Заполнить(ГруппаНФА);
				ТабличныйДокумент.Вывести(ОбластьЗаголовокГруппаНФА);
				ТабличныйДокумент.Вывести(ОбластьШапка);
				СуммаИтого = 0;
				КоличествоСтрок = ГруппаНФА.Состав.Количество();
				ТекущаяСтрока = 1;
				Для Каждого СтрокаНФА Из ГруппаНФА.Состав Цикл
					ОбластьСтрока.Параметры.Заполнить(СтрокаНФА);
					Если ТекущаяСтрока = КоличествоСтрок Тогда
						Если ТекущаяГруппаНФА = КоличествоГруппНФА Тогда
							// Проверить, что последняя строка группы вместе с итогом и подвалом умещается на страницу
							ОбластиДляПроверкиИтогоСПодвалом[0] = ОбластьСтрока;
							Если Не ТабличныйДокумент.ПроверитьВывод(ОбластиДляПроверкиИтогоСПодвалом) Тогда
								ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							КонецЕсли;
						Иначе
							// Проверить, что последняя строка группы вместе с итогом умещается на страницу
							ОбластиДляПроверкиИтого[0] = ОбластьСтрока;
							Если Не ТабличныйДокумент.ПроверитьВывод(ОбластиДляПроверкиИтого) Тогда
								ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							КонецЕсли;
						КонецЕсли;
					Иначе
						Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьСтрока) Тогда
							ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;
					КонецЕсли;
					ТабличныйДокумент.Вывести(ОбластьСтрока);
					СуммаИтого = СуммаИтого + ТипЧисло.ПривестиЗначение(СтрокаНФА.Сумма);
					ТекущаяСтрока = ТекущаяСтрока + 1;
				КонецЦикла;
				
				ПараметрыИтого = Новый Структура("СуммаИтого", СуммаИтого);
				ОбластьИтого.Параметры.Заполнить(ПараметрыИтого);
				ТабличныйДокумент.Вывести(ОбластьИтого);
				ТекущаяГруппаНФА = ТекущаяГруппаНФА + 1;
			КонецЦикла;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, СтрокаШапки.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Возвращает табличный документ, содержащий распечатанные Акт приемки товаров, работ услуг ф.0510452.
// Одновременно в ОбъектыПечати устанавливаются выведенные документы для перехода по табличному документу.
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  РедакцияФормы - Строка - 100н или 174н
// 
// Возвращаемое значение:
//  ТабличныйДокумент
Функция НапечататьАктПриемкиТоваровРаботУслуг0510452(МассивОбъектов, ОбъектыПечати, РедакцияФормы = "100н") Экспорт

	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_АктПриемкиТоваровРаботУслуг0510452";
	
	ДанныеДляПечати = Документы.АктПриемкиТоваровРаботУслуг.ДанныеДляПечатиАктаПриемкиТоваровРаботУслуг0510452(МассивОбъектов, РедакцияФормы);

	ТекстВРедакции174н = "(в ред. Приказа Минфина России от 30.10.2023 № 174н)";
	ТекстВРедакции144н = "(в ред. Приказов Минфина России от 30.10.2023 № 174н, от 30.09.2024 № 144н)";
	ТекстПредставительПоставщика174н = "Представитель поставщика
		|(подрядчика)";
	ТекстПредставительПоставщика144н = "Представитель поставщика (подрядчика) или заинтересованной организации";
	ДатаНачалаДействия144н = '20260101';

	Если РедакцияФормы = "174н" Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_АктПриемкиТоваровРаботУслуг_0510452_174н");
	Иначе
		Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_АктПриемкиТоваровРаботУслуг_0510452_100н");
	КонецЕсли;
	ОбластьШапка1 = Макет.ПолучитьОбласть("Шапка1");
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьШапка3 = Макет.ПолучитьОбласть("Шапка3");
	ОбластьРаздел1 = Макет.ПолучитьОбласть("Раздел1");
	ОбластьРаздел2_Шапка = Макет.ПолучитьОбласть("Раздел2_Шапка");
	ОбластьРаздел2_Строка = Макет.ПолучитьОбласть("Раздел2_Строка");
	ОбластьРаздел2_Подвал = Макет.ПолучитьОбласть("Раздел2_Подвал");
	ОбластьРаздел3_Шапка = Макет.ПолучитьОбласть("Раздел3_Шапка");
	ОбластьРаздел3_Строка = Макет.ПолучитьОбласть("Раздел3_Строка");
	ОбластьРаздел3_ПредставительПоставщика = Макет.ПолучитьОбласть("ПредставительПоставщика");
	ОбластьРаздел3_Приемщик = Макет.ПолучитьОбласть("Приемщик");
	ОбластьРаздел4_Шапка = Макет.ПолучитьОбласть("Раздел4_Шапка");
	ОбластьРаздел4_Строка = Макет.ПолучитьОбласть("Раздел4_Строка");
	ОбластьРаздел4_Подвал = Макет.ПолучитьОбласть("Раздел4_Подвал");
	ОбластьРаздел5_Шапка = Макет.ПолучитьОбласть("Раздел5_Шапка");
	ОбластьРаздел5_Строка = Макет.ПолучитьОбласть("Раздел5_Строка");
	ОбластьРаздел5_Подвал = Макет.ПолучитьОбласть("Раздел5_Подвал");
	ОбластьПриложение = Макет.ПолучитьОбласть("Приложение");
	ОбластьЧленКомиссии = Макет.ПолучитьОбласть("ЧленКомиссии");
	ОбластьПодвал_Ответственный = Макет.ПолучитьОбласть("Подвал_Ответственный");
	ОбластьПодвал_ПредставительПоставщика = Макет.ПолучитьОбласть("Подвал_ПредставительПоставщика");
	ОбластьПодвал_ТоварыПриняты = Макет.ПолучитьОбласть("Подвал_ТоварыПриняты");
	Если РедакцияФормы = "174н" Тогда
		ОбластьШапка1 = Макет.ПолучитьОбласть("ШапкаДоПлРасчДок");
		ОбластьПлатежноРасчетныйДокумент = Макет.ПолучитьОбласть("ПлатежноРасчетныйДокумент");
		ОбластьШапкаПослеПлРасчДок = Макет.ПолучитьОбласть("ШапкаПослеПлРасчДок");
		ОбластьРаздел61_Шапка = Макет.ПолучитьОбласть("Раздел61_Шапка");
		ОбластьРаздел61_Строка = Макет.ПолучитьОбласть("Раздел61_Строка");
		ОбластьРаздел61_Подвал = Макет.ПолучитьОбласть("Раздел61_Подвал");
		ОбластьРаздел62_Шапка = Макет.ПолучитьОбласть("Раздел62_Шапка");
		ОбластьРаздел62_Строка = Макет.ПолучитьОбласть("Раздел62_Строка");
		ОбластьРаздел62_Подвал = Макет.ПолучитьОбласть("Раздел62_Подвал");
		ОбластьПодвал_ПредставительЗаказчика = Макет.ПолучитьОбласть("Подвал_ПредставительЗаказчика");
		ОбластьПодвал_ПредставительКонтроль = Макет.ПолучитьОбласть("Подвал_ПредставительКонтроль");
	КонецЕсли;
	
	ПустаяДатаПодписи = """______""________________________20______г.";
	ФорматДатыПодписи = "ДФ='''""''дд''""'' ММММ гггг ''г.'''";
	
	Отбор = Новый Структура("Ссылка", Неопределено);
	ПараметрТекстВРедакции = Новый Структура("ТекстВРедакции", "");
	ПараметрТекстПредставительПоставщика = Новый Структура("ТекстПредставительПоставщика", "");
	ПервыйДокумент = Истина;
	Для Каждого СтрокаШапки Из ДанныеДляПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		Отбор.Ссылка = СтрокаШапки.Ссылка;
		
		// Шапка
		
		Если СтрокаШапки.Дата < ДатаНачалаДействия144н Тогда
			ПараметрТекстВРедакции.ТекстВРедакции = ТекстВРедакции174н;
		Иначе
			ПараметрТекстВРедакции.ТекстВРедакции = ТекстВРедакции144н;
		КонецЕсли;
		ОбластьШапка1.Параметры.Заполнить(ПараметрТекстВРедакции);
		ОбластьШапка1.Параметры.Заполнить(СтрокаШапки);
		ПараметрДО = Новый Структура("СуммаДенежногоОбязательства", "");
		Если ЗначениеЗаполнено(СтрокаШапки.СуммаДенежногоОбязательства) Тогда
			ПараметрДО.СуммаДенежногоОбязательства = СтрШаблон(НСтр("ru = '%1 (%2)'"),
				Формат(СтрокаШапки.СуммаДенежногоОбязательства, "ЧДЦ=2"),
				ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(СтрокаШапки.СуммаДенежногоОбязательства, Неопределено));
		КонецЕсли;
		ОбластьШапка1.Параметры.Заполнить(ПараметрДО);
		ПараметрыЗаголовка = Новый Структура;
		Если ЗначениеЗаполнено(СтрокаШапки.УполномоченноеЛицоДатаПодписи) Тогда
			УполномоченноеЛицоДатаПодписи = Формат(СтрокаШапки.УполномоченноеЛицоДатаПодписи, ФорматДатыПодписи);
		Иначе
			УполномоченноеЛицоДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыЗаголовка.Вставить("УполномоченноеЛицоДатаПодписи", УполномоченноеЛицоДатаПодписи);
		Если ЗначениеЗаполнено(СтрокаШапки.РуководительЗаказчикаДатаПодписи) Тогда
			РуководительЗаказчикаДатаПодписи = Формат(СтрокаШапки.РуководительЗаказчикаДатаПодписи, ФорматДатыПодписи);
		Иначе
			РуководительЗаказчикаДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыЗаголовка.Вставить("РуководительЗаказчикаДатаПодписи", РуководительЗаказчикаДатаПодписи);
		ОбластьШапка1.Параметры.Заполнить(ПараметрыЗаголовка);
		ПараметрНаименованиеПриказа = Новый Структура("НаименованиеПриказа", СтрокаШапки.НаименованиеПриказа);
		Если СтрокаШапки.РешениеОСозданииКомиссииНеПринято Тогда
			Если ЗначениеЗаполнено(СтрокаШапки.ПричинаОтсутствияКомиссии) Тогда
				ПараметрНаименованиеПриказа.НаименованиеПриказа = СтрокаШапки.ПричинаОтсутствияКомиссии;
			Иначе
				ПараметрНаименованиеПриказа.НаименованиеПриказа = "---";
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаШапки.РешениеОСозданииКомиссииНеПринято Тогда
			ОбластьШапка1.Параметры.Заполнить(ПараметрНаименованиеПриказа);
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьШапка1);
		
		Если РедакцияФормы = "174н" Тогда
			Для Каждого ПлатежныйДокумент Из СтрокаШапки.ПлатежныеДокументы Цикл
				ОбластьПлатежноРасчетныйДокумент.Параметры.Заполнить(ПлатежныйДокумент);
				ТабличныйДокумент.Вывести(ОбластьПлатежноРасчетныйДокумент);
			КонецЦикла;
			Если СтрокаШапки.ПлатежныеДокументы.Количество() = 0 Тогда
				ОбластьПлатежноРасчетныйДокумент.Параметры.Заполнить(
					Новый Структура("НаименованиеПД, НомерПД, ДатаПД"));
				ТабличныйДокумент.Вывести(ОбластьПлатежноРасчетныйДокумент);
			КонецЕсли;
			ОбластьШапкаПослеПлРасчДок.Параметры.Заполнить(СтрокаШапки);
			Если СтрокаШапки.РешениеОСозданииКомиссииНеПринято Тогда
				ОбластьШапкаПослеПлРасчДок.Параметры.Заполнить(ПараметрНаименованиеПриказа);
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьШапкаПослеПлРасчДок);
		КонецЕсли;
		
		ПараметрыДокумента = Новый Структура("ТекстДокумент", "Документ об отгрузке");
		НомерДокументаПоставки = 0;
		Для Каждого ДокументПоставки Из СтрокаШапки.ДокументыПоставки Цикл
			НомерДокументаПоставки = НомерДокументаПоставки + 1;
			Если НомерДокументаПоставки = СтрокаШапки.ДокументыПоставки.Количество() Тогда
				ИспользуемаяОбласть = ОбластьШапка3;
			Иначе
				ИспользуемаяОбласть = ОбластьШапка2;
			КонецЕсли;
			ИспользуемаяОбласть.Параметры.Заполнить(ДокументПоставки);
			ИспользуемаяОбласть.Параметры.Заполнить(ПараметрыДокумента);
			Если Не ТабличныйДокумент.ПроверитьВывод(ИспользуемаяОбласть) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабличныйДокумент.Вывести(ИспользуемаяОбласть);
			ПараметрыДокумента.ТекстДокумент = "";
		КонецЦикла;
		
		Если НомерДокументаПоставки = 0 Тогда
			ПараметрыДокумента = Новый Структура("ТекстДокумент, НаименованиеДокумента, НомерДокумента, ДатаДокумента", "Документ об отгрузке");
			ОбластьШапка2.Параметры.Заполнить(ПараметрыДокумента);
			ТабличныйДокумент.Вывести(ОбластьШапка2);
			ПараметрыДокумента.ТекстДокумент = "";
			ОбластьШапка3.Параметры.Заполнить(ПараметрыДокумента);
			ТабличныйДокумент.Вывести(ОбластьШапка3);
		КонецЕсли;
		
		// Раздел 1
		
		ОбластьРаздел1.Параметры.Заполнить(СтрокаШапки);
		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьРаздел1) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьРаздел1);
		
		// Раздел 2
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокумент.Вывести(ОбластьРаздел2_Шапка);
		Для Каждого Транспортировка Из СтрокаШапки.ТранспортировкаИПриемка Цикл
			ОбластьРаздел2_Строка.Параметры.Заполнить(Транспортировка);
			Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьРаздел2_Строка) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьРаздел2_Строка);
		КонецЦикла;
		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьРаздел2_Подвал) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьРаздел2_Подвал);
		
		// Раздел 3
		
		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьРаздел3_Шапка) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьРаздел3_Шапка);
		ПараметрСоставУпаковки = Новый Структура("ТоварыВУпаковке", "");
		Для Каждого Упаковка Из СтрокаШапки.СведенияОбУпаковке Цикл
			ОбластьРаздел3_Строка.Параметры.Заполнить(Упаковка);
			ПараметрСоставУпаковки.ТоварыВУпаковке = СтрСоединить(Упаковка.СоставУпаковки, Символы.ПС);
			ОбластьРаздел3_Строка.Параметры.Заполнить(ПараметрСоставУпаковки);
			Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьРаздел3_Строка) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьРаздел3_Строка);
		КонецЦикла;
		
		Если СтрокаШапки.Дата < ДатаНачалаДействия144н Тогда
			ПараметрТекстПредставительПоставщика.ТекстПредставительПоставщика = ТекстПредставительПоставщика174н;
		Иначе
			ПараметрТекстПредставительПоставщика.ТекстПредставительПоставщика = ТекстПредставительПоставщика144н;
		КонецЕсли;
		ОбластьРаздел3_ПредставительПоставщика.Параметры.Заполнить(ПараметрТекстПредставительПоставщика);
		ЕстьПриемкаНФА = СтрокаШапки.ТранспортировкаИПриемка.Количество() > 0
			Или СтрокаШапки.СведенияОбУпаковке.Количество() > 0;
		ПараметрыПредставителя = Новый Структура("НаименованиеДолжности, ФИО, ДатаПодписи", "", "", ПустаяДатаПодписи);
		ПараметрыПредставителя.НаименованиеДолжности = СтрокаШапки.ПредставительПоставщикаДолжность;
		ПараметрыПредставителя.ФИО = СтрокаШапки.ПредставительПоставщикаФИО;
		Если ЗначениеЗаполнено(СтрокаШапки.ПредставительПоставщикаДатаПодписи) Тогда
			ПараметрыПредставителя.ДатаПодписи = Формат(СтрокаШапки.ПредставительПоставщикаДатаПодписи,
				ФорматДатыПодписи);
		КонецЕсли;
		ПараметрыПредставителяРаздел3 = Новый Структура("НаименованиеДолжности, ФИО, ДатаПодписи", "", "", ПустаяДатаПодписи);
		Если ЕстьПриемкаНФА Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыПредставителяРаздел3, ПараметрыПредставителя);
		КонецЕсли;
		ОбластьРаздел3_ПредставительПоставщика.Параметры.Заполнить(ПараметрыПредставителяРаздел3);
		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьРаздел3_ПредставительПоставщика) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьРаздел3_ПредставительПоставщика);
		
		ПараметрыПриемщика = Новый Структура("НаименованиеДолжности, ФИО, ДатаПодписи", "", "", ПустаяДатаПодписи);
		Если ЕстьПриемкаНФА Тогда
			ПараметрыПриемщика.НаименованиеДолжности = СтрокаШапки.ТоварыПринятыДолжность;
			ПараметрыПриемщика.ФИО = СтрокаШапки.ТоварыПринятыФИО;
			Если ЗначениеЗаполнено(СтрокаШапки.ТоварыПринятыДатаПодписи) Тогда
				ПараметрыПриемщика.ДатаПодписи = Формат(СтрокаШапки.ТоварыПринятыДатаПодписи, ФорматДатыПодписи);
			КонецЕсли;
		КонецЕсли;
		ОбластьРаздел3_Приемщик.Параметры.Заполнить(ПараметрыПриемщика);
		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьРаздел3_Приемщик) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьРаздел3_Приемщик);
		
		// Раздел 4
		
		Если Не РедакцияФормы = "174н" Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьРаздел4_Шапка);
		ПараметрыРНПТ = Новый Структура("НомерТаможеннойДекларации", "");
		ИтогоРаздел4 = Новый Структура;
		ИтогоРаздел4.Вставить("Всего", 0);
		Для Каждого ТоварыРаботыУслуги Из СтрокаШапки.ТоварыРаботыУслуги Цикл
			ОбластьРаздел4_Строка.Параметры.Заполнить(ТоварыРаботыУслуги);
			НомераГТД = Новый Массив;
			Если ЗначениеЗаполнено(ТоварыРаботыУслуги.НомерГТД) Тогда
				НомераГТД.Добавить(СокрЛП(ТоварыРаботыУслуги.НомерГТД));
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НомераГТД, ТоварыРаботыУслуги.СведенияПрослеживаемости);
			Если НомераГТД.Количество() > 0 Тогда
				ПараметрыРНПТ.НомерТаможеннойДекларации = СтрСоединить(НомераГТД, Символы.ПС);
			Иначе
				ПараметрыРНПТ.НомерТаможеннойДекларации = "-";
			КонецЕсли;
			Если ЗначениеЗаполнено(ТоварыРаботыУслуги.Содержание) Тогда
				ОбластьРаздел4_Строка.Параметры.Заполнить(Новый Структура("НаименованиеТовара", ТоварыРаботыУслуги.Содержание));
			КонецЕсли;
			ОбластьРаздел4_Строка.Параметры.Заполнить(ПараметрыРНПТ);
			Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьРаздел4_Строка) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьРаздел4_Строка);
			ИтогоРаздел4.Всего = ИтогоРаздел4.Всего + ТоварыРаботыУслуги.Всего;
		КонецЦикла;
		ОбластьРаздел4_Подвал.Параметры.Заполнить(ИтогоРаздел4);
		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьРаздел4_Подвал) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьРаздел4_Подвал);
		
		// Раздел 5 
		
		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьРаздел5_Шапка) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьРаздел5_Шапка);
		ИтогоРаздел5 = Новый Структура;
		ИтогоРаздел5.Вставить("СуммаОтклонение", 0);
		ИтогоРаздел5.Вставить("СуммаНедостача", 0);
		ИтогоРаздел5.Вставить("СуммаИзлишки", 0);
		ИтогоРаздел5.Вставить("СуммаБрак", 0);
		Для Каждого Расхождение Из СтрокаШапки.Расхождения Цикл
			ОбластьРаздел5_Строка.Параметры.Заполнить(Расхождение);
			ПараметрыРНПТ.НомерТаможеннойДекларации = СтрСоединить(Расхождение.СведенияПрослеживаемости, Символы.ПС);
			ОбластьРаздел5_Строка.Параметры.Заполнить(ПараметрыРНПТ);
			Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьРаздел5_Строка) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьРаздел5_Строка);
			ИтогоРаздел5.СуммаОтклонение = ИтогоРаздел5.СуммаОтклонение + Расхождение.СуммаОтклонение;
			ИтогоРаздел5.СуммаНедостача = ИтогоРаздел5.СуммаНедостача + Расхождение.СуммаНедостача;
			ИтогоРаздел5.СуммаИзлишки = ИтогоРаздел5.СуммаИзлишки + Расхождение.СуммаИзлишки;
			ИтогоРаздел5.СуммаБрак = ИтогоРаздел5.СуммаБрак + Расхождение.СуммаБрак;
		КонецЦикла;
		ОбластьРаздел5_Подвал.Параметры.Заполнить(ИтогоРаздел5);
		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьРаздел5_Подвал) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьРаздел5_Подвал);

		Если РедакцияФормы = "174н" Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			// Раздел 6
			ОбластьРаздел61_Шапка.Параметры.Заполнить(СтрокаШапки);
			ТабличныйДокумент.Вывести(ОбластьРаздел61_Шапка);
			ПараметрыПодвалаСМР = Новый Структура("Количество, Сумма", 0, 0);
			Для Каждого СтрокаСМР Из СтрокаШапки.СМР Цикл
				ОбластьРаздел61_Строка.Параметры.Заполнить(СтрокаСМР);
				ТабличныйДокумент.Вывести(ОбластьРаздел61_Строка);
				ПараметрыПодвалаСМР.Количество = ПараметрыПодвалаСМР.Количество + СтрокаСМР.Количество;
				ПараметрыПодвалаСМР.Сумма = ПараметрыПодвалаСМР.Сумма + СтрокаСМР.Сумма;
			КонецЦикла;
			ОбластьРаздел61_Подвал.Параметры.Заполнить(ПараметрыПодвалаСМР);
			ТабличныйДокумент.Вывести(ОбластьРаздел61_Подвал);
			
			ПараметрыПодвалаСтоимостьСМР = Новый Структура;
			ПараметрыПодвалаСтоимостьСМР.Вставить("Сумма", 0);
			ПараметрыПодвалаСтоимостьСМР.Вставить("СуммаНДС", 0);
			ПараметрыПодвалаСтоимостьСМР.Вставить("Всего", 0);
			ПараметрыПодвалаСтоимостьСМР.Вставить("СуммаСНачалаРабот", 0);
			ПараметрыПодвалаСтоимостьСМР.Вставить("СуммаНДССНачалаРабот", 0);
			ПараметрыПодвалаСтоимостьСМР.Вставить("ВсегоСНачалаРабот", 0);
			ПараметрыПодвалаСтоимостьСМР.Вставить("СуммаСНачалаГода", 0);
			ПараметрыПодвалаСтоимостьСМР.Вставить("СуммаНДССНачалаГода", 0);
			ПараметрыПодвалаСтоимостьСМР.Вставить("ВсегоСНачалаГода", 0);
			ТабличныйДокумент.Вывести(ОбластьРаздел62_Шапка);
			Для Каждого СтрокаСтоимостьСМР Из СтрокаШапки.СтоимостьСМР Цикл
				ПараметрыПодвалаСтоимостьСМР.Сумма = ПараметрыПодвалаСтоимостьСМР.Сумма + СтрокаСтоимостьСМР.Сумма;
				ПараметрыПодвалаСтоимостьСМР.СуммаНДС = ПараметрыПодвалаСтоимостьСМР.СуммаНДС + СтрокаСтоимостьСМР.СуммаНДС;
				ПараметрыПодвалаСтоимостьСМР.Всего = ПараметрыПодвалаСтоимостьСМР.Всего + СтрокаСтоимостьСМР.Всего;
				ПараметрыПодвалаСтоимостьСМР.СуммаСНачалаРабот = ПараметрыПодвалаСтоимостьСМР.СуммаСНачалаРабот + СтрокаСтоимостьСМР.СуммаСНачалаРабот;
				ПараметрыПодвалаСтоимостьСМР.СуммаНДССНачалаРабот = ПараметрыПодвалаСтоимостьСМР.СуммаНДССНачалаРабот + СтрокаСтоимостьСМР.СуммаНДССНачалаРабот;
				ПараметрыПодвалаСтоимостьСМР.ВсегоСНачалаРабот = ПараметрыПодвалаСтоимостьСМР.ВсегоСНачалаРабот + СтрокаСтоимостьСМР.ВсегоСНачалаРабот;
				ПараметрыПодвалаСтоимостьСМР.СуммаСНачалаГода = ПараметрыПодвалаСтоимостьСМР.СуммаСНачалаГода + СтрокаСтоимостьСМР.СуммаСНачалаГода;
				ПараметрыПодвалаСтоимостьСМР.СуммаНДССНачалаГода = ПараметрыПодвалаСтоимостьСМР.СуммаНДССНачалаГода + СтрокаСтоимостьСМР.СуммаНДССНачалаГода;
				ПараметрыПодвалаСтоимостьСМР.ВсегоСНачалаГода = ПараметрыПодвалаСтоимостьСМР.ВсегоСНачалаГода + СтрокаСтоимостьСМР.ВсегоСНачалаГода;
				ОбластьРаздел62_Строка.Параметры.Заполнить(СтрокаСтоимостьСМР);
				ТабличныйДокумент.Вывести(ОбластьРаздел62_Строка);
			КонецЦикла;
			ОбластьРаздел62_Подвал.Параметры.Заполнить(ПараметрыПодвалаСтоимостьСМР);
			ТабличныйДокумент.Вывести(ОбластьРаздел62_Подвал);
		КонецЕсли;
				
		// Приложения
		
		ПараметрыОбласти = Новый Структура("НомерПриложения", 0);
		Для Каждого Приложение Из СтрокаШапки.Файлы Цикл
			ОбластьПриложение.Параметры.Заполнить(Приложение);
			ПараметрыОбласти.НомерПриложения = ПараметрыОбласти.НомерПриложения + 1;
			ОбластьПриложение.Параметры.Заполнить(ПараметрыОбласти);
			Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьПриложение) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьПриложение);
		КонецЦикла;
		
		// Комиссия
		ВыведенаКомиссия = Ложь;
		ПараметрыОбласти = Новый Структура("ТекстЧленКомиссии", "");
		ПервыйЧлен = Истина;
		Для Каждого Комиссия Из СтрокаШапки.СоставКомиссии Цикл
			ВыведенаКомиссия = Истина;
			Если Комиссия.Председатель Тогда
				ПараметрыОбласти.ТекстЧленКомиссии = "Председатель комиссии";
			ИначеЕсли ПервыйЧлен Тогда
				ПараметрыОбласти.ТекстЧленКомиссии = "Члены комиссии:";
				ПервыйЧлен = Ложь;
			Иначе
				ПараметрыОбласти.ТекстЧленКомиссии = "";
			КонецЕсли;
			ОбластьЧленКомиссии.Параметры.Заполнить(Комиссия);
			ОбластьЧленКомиссии.Параметры.Заполнить(ПараметрыОбласти);
			Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьЧленКомиссии) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьЧленКомиссии);
		КонецЦикла;
		Если Не ВыведенаКомиссия Тогда
			ПараметрыОбласти = Новый Структура("ТекстЧленКомиссии, НаименованиеДолжности, ФИО", "", "", "");
			ПервыйЧлен = Истина;
			ВыведенПредседатель = Ложь;
			Для Индекс = 1 По 4 Цикл
				Если Не ВыведенПредседатель Тогда
					ПараметрыОбласти.ТекстЧленКомиссии = "Председатель комиссии";
					ВыведенПредседатель = Истина;
				ИначеЕсли ПервыйЧлен Тогда
					ПараметрыОбласти.ТекстЧленКомиссии = "Члены комиссии:";
					ПервыйЧлен = Ложь;
				Иначе
					ПараметрыОбласти.ТекстЧленКомиссии = "";
				КонецЕсли;
				ОбластьЧленКомиссии.Параметры.Заполнить(ПараметрыОбласти);
				Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьЧленКомиссии) Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьЧленКомиссии);
			КонецЦикла;
		КонецЕсли;
		
		// Подвал
		ПараметрыОтветственного = Новый Структура;
		ПараметрыОтветственного.Вставить("НаименованиеДолжности", СтрокаШапки.ОтветственныйДолжность);
		ПараметрыОтветственного.Вставить("ФИО", СтрокаШапки.ОтветственныйФИО);
		ПараметрыОтветственного.Вставить("НомерТелефона", СтрокаШапки.ОтветственныйТелефон);
		ПараметрыОтветственного.Вставить("ЭлектроннаяПочта", СтрокаШапки.ОтветственныйЭлектроннаяПочта);
		ОбластьПодвал_Ответственный.Параметры.Заполнить(ПараметрыОтветственного);
		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьПодвал_Ответственный) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал_Ответственный);
		
		ОбластьПодвал_ПредставительПоставщика.Параметры.Заполнить(ПараметрыПредставителя);
		Если ЗначениеЗаполнено(СтрокаШапки.ПредставительПоставщикаДатаПодписи) Тогда
			ПредставительПоставщикаДатаПодписи = Формат(СтрокаШапки.ПредставительПоставщикаДатаПодписи, ФорматДатыПодписи);
		Иначе
			ПредставительПоставщикаДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыПредставителя.Вставить("ДатаПодписи", ПредставительПоставщикаДатаПодписи);

		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьПодвал_ПредставительПоставщика) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал_ПредставительПоставщика);
		
		Если Не ЕстьПриемкаНФА Тогда
			ПараметрыПриемщика.НаименованиеДолжности = СтрокаШапки.ТоварыПринятыДолжность;
			ПараметрыПриемщика.ФИО = СтрокаШапки.ТоварыПринятыФИО;
			Если ЗначениеЗаполнено(СтрокаШапки.ТоварыПринятыДатаПодписи) Тогда
				ПараметрыПриемщика.ДатаПодписи = Формат(СтрокаШапки.ТоварыПринятыДатаПодписи, ФорматДатыПодписи);
			КонецЕсли;
		КонецЕсли;
		ОбластьПодвал_ТоварыПриняты.Параметры.Заполнить(ПараметрыПриемщика);
		Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьПодвал_ТоварыПриняты) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал_ТоварыПриняты);
		
		Если РедакцияФормы = "174н" Тогда
			ПараметрыОбласти = Новый Структура;
			ПараметрыОбласти.Вставить("НаименованиеДолжности", СтрокаШапки.ПредставительЗаказчикаДолжность);
			ПараметрыОбласти.Вставить("ФИО", СтрокаШапки.ПредставительЗаказчикаФИО);
			Если ЗначениеЗаполнено(СтрокаШапки.ПредставительЗаказчикаДатаПодписи) Тогда
				ПредставительЗаказчикаДатаПодписи = Формат(СтрокаШапки.ПредставительЗаказчикаДатаПодписи, ФорматДатыПодписи);
			Иначе
				ПредставительЗаказчикаДатаПодписи = ПустаяДатаПодписи;
			КонецЕсли;
			ПараметрыОбласти.Вставить("ДатаПодписи", ПредставительЗаказчикаДатаПодписи);
			ОбластьПодвал_ПредставительЗаказчика.Параметры.Заполнить(ПараметрыОбласти);
			Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьПодвал_ПредставительЗаказчика) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьПодвал_ПредставительЗаказчика);
			
			ПараметрыОбласти.Вставить("НаименованиеДолжности", СтрокаШапки.ПредставительСтроительныйКонтрольДолжность);
			ПараметрыОбласти.Вставить("ФИО", СтрокаШапки.ПредставительСтроительныйКонтрольФИО);
			Если ЗначениеЗаполнено(СтрокаШапки.ПредставительСтроительныйКонтрольДатаПодписи) Тогда
				ПредставительСтроительныйКонтрольДатаПодписи = Формат(СтрокаШапки.ПредставительСтроительныйКонтрольДатаПодписи, ФорматДатыПодписи);
			Иначе
				ПредставительСтроительныйКонтрольДатаПодписи = ПустаяДатаПодписи;
			КонецЕсли;
			ПараметрыОбласти.Вставить("ДатаПодписи", ПредставительСтроительныйКонтрольДатаПодписи);
			ОбластьПодвал_ПредставительКонтроль.Параметры.Заполнить(ПараметрыОбласти);
			Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьПодвал_ПредставительКонтроль) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьПодвал_ПредставительКонтроль);
		КонецЕсли;
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, СтрокаШапки.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Возвращает табличный документ, содержащий распечатанные Накладные на отпуск МЦ на сторону ф.0510458.
// Одновременно в ОбъектыПечати устанавливаются выведенные документы для перехода по табличному документу.
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
// 
// Возвращаемое значение:
//  ТабличныйДокумент
Функция НапечататьНакладнуюНаОтпускМЗ0510458(МассивОбъектов, ОбъектыПечати) Экспорт

	ДанныеДляПечати = ТаблицаШапкиДляПечатиНакладной0510458();
	Для Каждого Документ Из ОбщегоНазначенияБГУ.ДокументыПоТипам(МассивОбъектов) Цикл
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ.Значение[0]);
		МенеджерДокумента.ДобавитьДанныеДляПечатиНакладной0510458(ДанныеДляПечати, Документ.Значение);
	КонецЦикла;

	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_НакладнаяНаОтпуск0510458";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_НакладнаяНаОтпуск0510458_157н");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокГруппаНФА = Макет.ПолучитьОбласть("ЗаголовокГруппаНФА");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	ОбластиДляПроверкиИтого = Новый Массив(2);
	// Область "Итого" не меняет высоту. Ее сразу добавляем в проверяемый массив.
	ОбластиДляПроверкиИтого[1] = ОбластьИтого;
	
	ОбластиДляПроверкиИтогоСПодвалом = Новый Массив(3);
	// Область "Итого" не меняет высоту. Ее сразу добавляем в проверяемый массив.
	ОбластиДляПроверкиИтогоСПодвалом[1] = ОбластьИтого;
	
	ПустаяДатаПодписи = """______""________________________20______г.";
	ФорматДатыПодписи = "ДФ='''""''дд''""'' ММММ гггг ''г.'''";
	
	ПервыйДокумент = Истина;
	Для Каждого СтрокаШапки Из ДанныеДляПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьЗаголовок.Параметры.Заполнить(СтрокаШапки);
		ПараметрыЗаголовка = Новый Структура;
		Если ЗначениеЗаполнено(СтрокаШапки.ОтветственныйДатаПодписи) Тогда
			ОтветственныйДатаПодписи = Формат(СтрокаШапки.ОтветственныйДатаПодписи, ФорматДатыПодписи);
		Иначе
			ОтветственныйДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыЗаголовка.Вставить("ОтветственныйДатаПодписи", ОтветственныйДатаПодписи);
		Если ЗначениеЗаполнено(СтрокаШапки.ОтпустилДатаПодписи) Тогда
			ОтпустилДатаПодписи = Формат(СтрокаШапки.ОтпустилДатаПодписи, ФорматДатыПодписи);
		Иначе
			ОтпустилДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыЗаголовка.Вставить("ОтпустилДатаПодписи", ОтпустилДатаПодписи);
		Если ЗначениеЗаполнено(СтрокаШапки.ОтпустилДатаПодписи) Тогда
			ОтпустилДатаПодписи = Формат(СтрокаШапки.ОтпустилДатаПодписи, ФорматДатыПодписи);
		Иначе
			ОтпустилДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыЗаголовка.Вставить("ОтпустилДатаПодписи", ОтпустилДатаПодписи);
		Если ЗначениеЗаполнено(СтрокаШапки.ПолучилДатаПодписи) Тогда
			ПолучилДатаПодписи = Формат(СтрокаШапки.ПолучилДатаПодписи, ФорматДатыПодписи);
		Иначе
			ПолучилДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыЗаголовка.Вставить("ПолучилДатаПодписи", ПолучилДатаПодписи);
		Если ЗначениеЗаполнено(СтрокаШапки.УполномоченноеЛицоДатаПодписи) Тогда
			УполномоченноеЛицоДатаПодписи = Формат(СтрокаШапки.УполномоченноеЛицоДатаПодписи, ФорматДатыПодписи);
		Иначе
			УполномоченноеЛицоДатаПодписи = ПустаяДатаПодписи;
		КонецЕсли;
		ПараметрыЗаголовка.Вставить("УполномоченноеЛицоДатаПодписи", УполномоченноеЛицоДатаПодписи);
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыЗаголовка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		// Заполнить область "Подвал" и добавить ее для проверки вывода
		ОбластьПодвал.Параметры.Заполнить(СтрокаШапки);
		ОбластьПодвал.Параметры.Заполнить(ПараметрыЗаголовка);
		ПараметрыСуммаПрописью = Новый Структура;
		ПараметрыСуммаПрописью.Вставить("СуммаПрописью", ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(СтрокаШапки.Всего, СтрокаШапки.Валюта));
		ОбластьПодвал.Параметры.Заполнить(ПараметрыСуммаПрописью);
		ОбластиДляПроверкиИтогоСПодвалом[2] = ОбластьПодвал;
		
		ТабличнаяЧасть = СтрокаШапки.СоставДокумента; // Массив из см. ЗаголовокТабличнойЧастиТребованияНакладной0510451
		Если ТабличнаяЧасть <> Неопределено Тогда
			КоличествоГруппНФА = ТабличнаяЧасть.Количество();
			ТекущаяГруппаНФА = 1;
			Для Каждого ГруппаНФА Из ТабличнаяЧасть Цикл
				ОбластьЗаголовокГруппаНФА.Параметры.Заполнить(ГруппаНФА);
				ТабличныйДокумент.Вывести(ОбластьЗаголовокГруппаНФА);
				ТабличныйДокумент.Вывести(ОбластьШапка);
				ПараметрыИтого = Новый Структура("Сумма, СуммаНДС, Всего", 0, 0, 0);
				КоличествоСтрок = ГруппаНФА.Состав.Количество();
				ТекущаяСтрока = 1;
				Для Каждого СтрокаНФА Из ГруппаНФА.Состав Цикл
					ОбластьСтрока.Параметры.Заполнить(СтрокаНФА);
					Если ТекущаяСтрока = КоличествоСтрок Тогда
						Если ТекущаяГруппаНФА = КоличествоГруппНФА Тогда
							// Проверить, что последняя строка группы вместе с итогом и подвалом умещается на страницу
							ОбластиДляПроверкиИтогоСПодвалом[0] = ОбластьСтрока;
							Если Не ТабличныйДокумент.ПроверитьВывод(ОбластиДляПроверкиИтогоСПодвалом) Тогда
								ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							КонецЕсли;
						Иначе
							// Проверить, что последняя строка группы вместе с итогом умещается на страницу
							ОбластиДляПроверкиИтого[0] = ОбластьСтрока;
							Если Не ТабличныйДокумент.ПроверитьВывод(ОбластиДляПроверкиИтого) Тогда
								ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							КонецЕсли;
						КонецЕсли;
					Иначе
						Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьСтрока) Тогда
							ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;
					КонецЕсли;
					ТабличныйДокумент.Вывести(ОбластьСтрока);
					ПараметрыИтого.Сумма = ПараметрыИтого.Сумма + ТипЧисло.ПривестиЗначение(СтрокаНФА.Сумма);
					ПараметрыИтого.СуммаНДС = ПараметрыИтого.СуммаНДС + ТипЧисло.ПривестиЗначение(СтрокаНФА.СуммаНДС);
					ПараметрыИтого.Всего = ПараметрыИтого.Всего + ТипЧисло.ПривестиЗначение(СтрокаНФА.Всего);
					ТекущаяСтрока = ТекущаяСтрока + 1;
				КонецЦикла;
				
				ОбластьИтого.Параметры.Заполнить(ПараметрыИтого);
				ТабличныйДокумент.Вывести(ОбластьИтого);
				ТекущаяГруппаНФА = ТекущаяГруппаНФА + 1;
			КонецЦикла;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, СтрокаШапки.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Напечатать акт о списании МЗ 0510460.
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ДанныеДляПечати - см. ТаблицаШапкиДляПечатиАктаОСписанииМЗ0510460
// 
// Возвращаемое значение:
//  ТабличныйДокумент
Функция НапечататьАктОСписанииМЗ0510460(МассивОбъектов, ОбъектыПечати, ДанныеДляПечати) Экспорт
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_АктОСписанииМЗ0510460";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_АктОСписанииМЗ0510460_157н");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовокГруппаНФА = Макет.ПолучитьОбласть("ЗаголовокГруппаНФА");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьЗаголовокКомиссия = Макет.ПолучитьОбласть("ЗаголовокКомиссия");
	ОбластьЧленКомиссии = Макет.ПолучитьОбласть("ЧленКомиссии");
	ОбластьПриложение = Макет.ПолучитьОбласть("Приложение");

	ПустаяДатаПодписи = """______""________________________20______г.";
	ФорматДатыПодписи = "ДФ='''""''дд''""'' ММММ гггг ''г.'''";
	ПараметрыИтого = Новый Структура("Сумма, Количество", 0, 0);
	ПараметрыНомерПриложения = Новый Структура("Номер", 0);
	ПараметрыНеобходимостьУничтожения = Новый Структура("НеобходимостьУничтожения, НеобходимостьУничтоженияКод", "", "");

	ПервыйДокумент = Истина;
	Для Каждого СтрокаШапки Из ДанныеДляПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ПараметрыЗаголовка = Новый Структура;
		ПараметрыЗаголовка.Вставить("УполномоченноеЛицоДатаПодписи", ПустаяДатаПодписи);
		ПараметрыЗаголовка.Вставить("ОтветственныйДатаПодписи", ПустаяДатаПодписи);
		Если ЗначениеЗаполнено(СтрокаШапки.УполномоченноеЛицоДатаПодписи) Тогда
			ПараметрыЗаголовка.УполномоченноеЛицоДатаПодписи = Формат(СтрокаШапки.УполномоченноеЛицоДатаПодписи, ФорматДатыПодписи);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаШапки.ОтветственныйДатаПодписи) Тогда
			ПараметрыЗаголовка.ОтветственныйДатаПодписи = Формат(СтрокаШапки.ОтветственныйДатаПодписи, ФорматДатыПодписи);
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Заполнить(СтрокаШапки);
		Если СтрокаШапки.НеобходимостьУничтожения Тогда
			ПараметрыНеобходимостьУничтожения.НеобходимостьУничтожения = "да";
			ПараметрыНеобходимостьУничтожения.НеобходимостьУничтоженияКод = "1";
		Иначе
			ПараметрыНеобходимостьУничтожения.НеобходимостьУничтожения = "нет";
			ПараметрыНеобходимостьУничтожения.НеобходимостьУничтоженияКод = "2";
		КонецЕсли;
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыНеобходимостьУничтожения);
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыЗаголовка);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ДанныеОтветственного = Новый Структура;
		ДанныеОтветственного.Вставить("ДолжностьНаименование", СтрокаШапки.ОтветственныйДолжность);
		ДанныеОтветственного.Вставить("ФИО", СтрокаШапки.ОтветственныйФИО);
		ДанныеОтветственного.Вставить("НомерТелефона", СтрокаШапки.ОтветственныйТелефон);
		ДанныеОтветственного.Вставить("ЭлектроннаяПочта", СтрокаШапки.ОтветственныйЭлПочта);
		
		ОбластьПодвал.Параметры.Заполнить(ДанныеОтветственного);
		ОбластьПодвал.Параметры.Заполнить(ПараметрыЗаголовка);
		
		ТекущаяГруппаНФА = 1;
		Для Каждого ГруппаНФА Из СтрокаШапки.ГруппыНФА Цикл
			ОбластьЗаголовокГруппаНФА.Параметры.Заполнить(ГруппаНФА);
			ТабличныйДокумент.Вывести(ОбластьЗаголовокГруппаНФА);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			ПараметрыИтого.Сумма = 0;
			ПараметрыИтого.Количество = 0;
			ТекущаяСтрока = 1;
			КоличествоСтрокГруппы = ГруппаНФА.Состав.Количество();
			Для Каждого СтрокаНФА Из ГруппаНФА.Состав Цикл
				
				ОбластьСтрока.Параметры.Заполнить(СтрокаНФА);
				
				РезультатыГолосования = Новый Структура("РезолюцияИтог,ИтогГолосования", "", "");
				Если СтрокаШапки.ЕстьРешениеОПрекращенииПризнанияАктивом Тогда
					РезультатыГолосования.РезолюцияИтог = НСтр("ru = 'списать'");
				ИначеЕсли СтрокаНФА.ГолосованиеПоСтрокеЗавершено Тогда // Результаты голосования выводим, только если голосование по строке завершено.
					РезультатыГолосования.РезолюцияИтог = ?(СтрокаНФА.РезолюцияКомиссииОдобрена, НСтр("ru = 'списать'"), НСтр("ru = 'отказать'"));
					РезультатыГолосования.ИтогГолосования = СтрокаНФА.ИтогГолосования;
				КонецЕсли;
				ОбластьСтрока.Параметры.Заполнить(РезультатыГолосования);
				
				Если ТекущаяСтрока = КоличествоСтрокГруппы Тогда
					ПроверяемыеОбласти = Новый Массив;
					ПроверяемыеОбласти.Добавить(ОбластьСтрока);
					ПроверяемыеОбласти.Добавить(ОбластьИтого);
					Если Не ТабличныйДокумент.ПроверитьВывод(ПроверяемыеОбласти) Тогда
						ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				ПараметрыИтого.Сумма = ПараметрыИтого.Сумма + СтрокаНФА.Сумма;
				ПараметрыИтого.Количество = ПараметрыИтого.Количество + СтрокаНФА.Количество;
				ТекущаяСтрока = ТекущаяСтрока + 1;
				
			КонецЦикла;
			
			ОбластьИтого.Параметры.Заполнить(ПараметрыИтого);
			ТабличныйДокумент.Вывести(ОбластьИтого);
			ТекущаяГруппаНФА = ТекущаяГруппаНФА + 1;
		КонецЦикла;
		
		ПараметрыНомерПриложения.Номер = 0;
		Для Каждого Приложение Из СтрокаШапки.Файлы Цикл
			ПараметрыНомерПриложения.Номер = ПараметрыНомерПриложения.Номер + 1;
			ОбластьПриложение.Параметры.Заполнить(ПараметрыНомерПриложения);
			ОбластьПриложение.Параметры.Заполнить(Приложение);
			Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьПриложение) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьПриложение);
		КонецЦикла;
		
		ТаблицаКомиссия = Новый ТабличныйДокумент;
		ТаблицаКомиссия.Вывести(ОбластьЗаголовокКомиссия);
		
		ПерваяСтрокаКомиссии = Истина;
		Для Каждого СтрокаКомиссии Из СтрокаШапки.СоставКомиссии Цикл
			ПараметрПредставление = Новый Структура("ПредставлениеЧленаКомиссии", "");
			Если СтрокаКомиссии.Председатель Тогда
				ПараметрПредставление.ПредставлениеЧленаКомиссии = "Председатель комиссии";
			ИначеЕсли ПерваяСтрокаКомиссии Тогда
				ПараметрПредставление.ПредставлениеЧленаКомиссии = "Члены комиссии";
				ПерваяСтрокаКомиссии = Ложь;
			КонецЕсли;
			ОбластьЧленКомиссии.Параметры.Заполнить(ПараметрПредставление);
			ОбластьЧленКомиссии.Параметры.Заполнить(СтрокаКомиссии);
			ТаблицаКомиссия.Вывести(ОбластьЧленКомиссии);
		КонецЦикла;
		
		ТаблицаКомиссия.Вывести(ОбластьПодвал);
		
		Если Не ТабличныйДокумент.ПроверитьВывод(ТаблицаКомиссия) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабличныйДокумент.Вывести(ТаблицаКомиссия);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, СтрокаШапки.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьТекстВыгрузкиПоПравилуОбмена(ОшибкаЗаполнения, ДокСсылка, Дата, Организация, ВидОбмена, ФорматОбмена, ПоказатьСообщения = Истина) Экспорт
	
	//Функция используется в том числе для формирования текста для QR кода в Квитацнии на оплату и в Счете.
	//Для корректной работы формирования текста обработкой по формату требуется роль ДобавлениеИзменениеЗаданийОбменаБанкиКС,
	//и если у пользователя ее нет, будет ошибка.
	//Поэтому устанавливаем привилегированный режим.
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = Новый Структура;
	Задание.Вставить("НастройкаОбмена", ПредопределенноеЗначение("Справочник.НастройкиОбменаБанкиКС.ПустаяСсылка"));
	Задание.Вставить("Организация", Организация);
	Задание.Вставить("ВидОбмена", ВидОбмена);
	Задание.Вставить("Дата", Дата);
	Задание.Вставить("Ссылка", ПредопределенноеЗначение("Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяСсылка"));
	
	Задание.Вставить("КассовыйОрган", "");
	
	ОбъектыОбмена = Новый ТаблицаЗначений;
	ОбъектыОбмена.Колонки.Добавить("ИмяФайлаВыгрузки");	   
	ОбъектыОбмена.Колонки.Добавить("Формат");    
	ОбъектыОбмена.Колонки.Добавить("Объект");   
	ОбъектыОбмена.Колонки.Добавить("ОписаниеОшибки");
	ОбъектыОбмена.Колонки.Добавить("Описание"); 
	ОбъектыОбмена.Колонки.Добавить("ОтветWebСервиса");
	ОбъектыОбмена.Колонки.Добавить("РезультатФормирования");
	
	Стр = ОбъектыОбмена.Добавить();
	Стр.Объект  = ДокСсылка;
	Стр.Формат  = ФорматОбмена;
	
	Задание.Вставить("ОбъектыОбмена", ОбъектыОбмена);
	
	ОбработкаОбмена = Справочники.ТипыОбменаБанкиКС.ПолучитьОбработку(ВидОбмена);
	
	Если ОбработкаОбмена = Неопределено Тогда
		ОшибкаЗаполнения = Истина;
		Возврат "";
	КонецЕсли;	
		
	ОбработкаОбмена.СформироватьФайлы(Задание);
	
	Если ПоказатьСообщения И ЗначениеЗаполнено(Задание.ОбъектыОбмена[0].ОписаниеОшибки) Тогда
		Таб = ЗначениеИзСтрокиВнутр(Задание.ОбъектыОбмена[0].ОписаниеОшибки);
		Для Каждого Стр Из Таб Цикл
			ОбщегоНазначения.СообщитьПользователю(Стр.Ошибка, ДокСсылка);
		КонецЦикла;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Задание.ОбъектыОбмена[0].РезультатФормирования;
	
КонецФункции	

// Возвращает список прикрепленных к документу
// 
// Параметры:
// 	ДокументСсылка - ДокументСсылка, СправочникСсылка - ссылка на объект, для которого надо
//                   определить список файлов 
//  ВключатьФайлыСотрудников - Булево, определяет надо ли включать в список файлы сотрудников,
//                             например, файлы особых мнений членов комиссии, по умолчанию ЛОЖЬ
// Возвращаемое значение:
// Массив из Структура
//   *НомерПриложения - число, порядковый номер прилагаемого файла
//   *НаименованиеДокумента - строка, описание приложенного файла
//   *ИмяФайла - имя файла с расширением
//                   
Функция ПолучитьСписокФайловДокумента(ДокументСсылка, ВключатьФайлыСотрудников = Ложь) Экспорт
	
	СписокФайлов = Новый Массив;
	
	НомерПриложения = 0;
	Файлы = Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ДокументСсылка, Файлы);
	
	Если Файлы.Количество() > 0 Тогда
		
		Если НЕ ВключатьФайлыСотрудников Тогда 
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ФайлыСотрудниковКДокументам.ФайлСотрудника КАК ФайлСотрудника
			|ИЗ
			|	РегистрСведений.ФайлыСотрудниковКДокументам КАК ФайлыСотрудниковКДокументам
			|ГДЕ
			|	ФайлыСотрудниковКДокументам.Документ = &Документ");
			
			Запрос.УстановитьПараметр("Документ", ДокументСсылка);
			ФайлыСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФайлСотрудника");
			Файлы = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Файлы, ФайлыСотрудников);
		КонецЕсли;
		СвойстваФайлов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Файлы, "Наименование,Описание,Служебный,Расширение,ПометкаУдаления");
		
		Для Каждого СвойстваФайла Из СвойстваФайлов Цикл
			
			Если СвойстваФайла.Значение.Служебный ИЛИ СвойстваФайла.Значение.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			
			НомерПриложения = НомерПриложения + 1;
			
			СписокФайлов.Добавить(Новый Структура("НомерПриложения,НаименованиеДокумента,ИмяФайла,Файл",
			НомерПриложения,
			СвойстваФайла.Значение.Описание,
			СвойстваФайла.Значение.Наименование + "." + СвойстваФайла.Значение.Расширение,
			СвойстваФайла.Ключ));
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Инд = НомерПриложения По 1 Цикл
		СписокФайлов.Добавить(Новый Структура("НомерПриложения,НаименованиеДокумента,ИмяФайла,Файл"));
	КонецЦикла;
	
	Возврат СписокФайлов; 
	
КонецФункции

// Напечатать РешениеОПрекращенииПризнанияАктивом 0510440.
// 
// Параметры:
//  МассивОбъектов - Массив - Массив объектов
//  ОбъектыПечати - СписокЗначений - Объекты печати
//  ДанныеДокументов - Структура:
//  * ВыборкаДокументов - ВыборкаИзРезультатаЗапроса
//  * ВыборкаОС - ВыборкаИзРезультатаЗапроса
//  * ВыборкаОпись - ВыборкаИзРезультатаЗапроса
//  * Драгметаллы - ВыборкаИзРезультатаЗапроса
//  * ПТС - ВыборкаИзРезультатаЗапроса
//  * ЕГРН - ВыборкаИзРезультатаЗапроса
//  * Характеристики -
// 
// Возвращаемое значение:
//  ТабличныйДокумент - 
Функция НапечататьРешениеОПрекращенииПризнанияАктивом(МассивОбъектов, ОбъектыПечати, ДанныеДокументов) Экспорт
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПроверитьДостижениеКворумаПрисутствияПриПечати(МассивОбъектов);
	// Конец ИндикаторКворумаПрисутствия
	
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Решение0510440";
	ТабличныйДокумент.ТолькоПросмотр		= Истина;

	ТабличныйДокументКонтрольСтраниц = Новый ТабличныйДокумент;
	ТабличныйДокументКонтрольСтраниц.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокументКонтрольСтраниц.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Решение0510440");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьДокументы	= Макет.ПолучитьОбласть("Документы");
	ОбластьОпись		= Макет.ПолучитьОбласть("Опись");
	ОбластьР1Шапка		= Макет.ПолучитьОбласть("Раздел1_Шапка");
	ОбластьР1Строка		= Макет.ПолучитьОбласть("Раздел1_Строка");
	ОбластьР1Подвал		= Макет.ПолучитьОбласть("Раздел1_Подвал");
	ОбластьР2Шапка		= Макет.ПолучитьОбласть("Раздел2_Шапка");
	ОбластьР2Заголовок  = Макет.ПолучитьОбласть("Раздел2_Заголовок");
	ОбластьР2Строка		= Макет.ПолучитьОбласть("Раздел2_Строка");
	ОбластьР3Шапка		= Макет.ПолучитьОбласть("Раздел3_Шапка");
	ОбластьР3Строка		= Макет.ПолучитьОбласть("Раздел3_Строка");
	ОбластьПустаяСтрока	= Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПриложение	= Макет.ПолучитьОбласть("Приложение");
	ОбластьКомиссияП	= Макет.ПолучитьОбласть("Комиссия_Председатель");
	ОбластьКомиссияС	= Макет.ПолучитьОбласть("Комиссия_Строка");
	ОбластьИсполнитель	= Макет.ПолучитьОбласть("Исполнитель");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	СоставКомиссий = ОбщегоНазначенияБГУ.СоставКомиссийПоДокументам(МассивОбъектов);
	ДанныеОрганизацийПечати = ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	Для Каждого ВыборкаДокументов Из ДанныеДокументов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокументКонтрольСтраниц.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		НомерСтраницы = 1;
		
		// Шапка
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаДокументов);

		ДанныеОрганизации = ДанныеОрганизацийПечати.Получить(ВыборкаДокументов.Ссылка);
		ОбластьШапка.Параметры.Заполнить(ДанныеОрганизации);

		ТабличныйДокумент.Вывести(ОбластьШапка);
		ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьШапка);
		
		ОбластьДокументы.Параметры.Заполнить(ВыборкаДокументов);
		ТабличныйДокумент.Вывести(ОбластьДокументы);
		ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьДокументы);
		
		Для Каждого ВыборкаОпись Из ВыборкаДокументов.ИнвентаризационныеОписи Цикл
			
			ОбластьОпись.Параметры.Заполнить(ВыборкаОпись);
			ТабличныйДокумент.Вывести(ОбластьОпись);
			ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьОпись);
			
		КонецЦикла;
		
		// Раздел 1
		
		ТабличныйДокумент.Вывести(ОбластьР1Шапка);
		ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР1Шапка);
		
		Количество			= 0;
		Сумма				= 0;
		СуммаАмортизации	= 0;
			
			
		Для Каждого ВыборкаОС Из ВыборкаДокументов.СведенияОбОбъектах Цикл
			
			ОбластьР1Строка.Параметры.Заполнить(ВыборкаОС);
			ТабличныйДокумент.Вывести(ОбластьР1Строка);
			ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР1Строка);
			
			Количество			= Количество		+ ВыборкаОС.Количество;
			Сумма				= Сумма				+ ВыборкаОС.Сумма;
			СуммаАмортизации	= СуммаАмортизации	+ ВыборкаОС.СуммаАмортизации;
			
		КонецЦикла;
		
		Если ВыборкаДокументов.СведенияОбОбъектах.Количество() > 0 Тогда
			ОбластьР1Подвал.Параметры.Заполнить(Новый Структура("Количество,Сумма,СуммаАмортизации",Количество,Сумма,СуммаАмортизации));
			ТабличныйДокумент.Вывести(ОбластьР1Подвал);
			ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР1Подвал);
		КонецЕсли;
		
		// Раздел 2
		
		Если ВыборкаДокументов.ХарактеристикиОбъектов.Количество() > 0 Тогда
			ШапкаР2Выведена = Ложь;
			Для Каждого СтрокаХарактеристик Из ВыборкаДокументов.ХарактеристикиОбъектов Цикл
				ОбластьР2Строка.Параметры.Заполнить(СтрокаХарактеристик);
				ОбластиР2 = Новый Массив;
				Если НЕ ШапкаР2Выведена Тогда
					ОбластиР2.Добавить(ОбластьР2Шапка);
					ОбластиР2.Добавить(ОбластьР2Заголовок);
					ОбластиР2.Добавить(ОбластьР2Строка);
				Иначе	
					ОбластиР2.Добавить(ОбластьР2Строка);
				КонецЕсли;	
				
				Если Не ТабличныйДокументКонтрольСтраниц.ПроверитьВывод(ОбластиР2) Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					НомерСтраницы = НомерСтраницы + 1;
					Если НЕ ШапкаР2Выведена Тогда
						ТабличныйДокумент.Вывести(ОбластьР2Шапка);
						ШапкаР2Выведена = Истина;
					КонецЕсли;	
					ТабличныйДокумент.Вывести(ОбластьР2Заголовок);
					
					ТабличныйДокументКонтрольСтраниц.Очистить();
					ТабличныйДокументКонтрольСтраниц.ВывестиГоризонтальныйРазделительСтраниц();
					Если НЕ ШапкаР2Выведена Тогда
						ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР2Шапка);
					КонецЕсли;	
					ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР2Заголовок);
				Иначе	
					Если НЕ ШапкаР2Выведена Тогда
						ТабличныйДокумент.Вывести(ОбластьР2Шапка);
						ТабличныйДокумент.Вывести(ОбластьР2Заголовок);
						ШапкаР2Выведена = Истина;
						ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР2Шапка);
						ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР2Заголовок);
					КонецЕсли;	
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьР2Строка);
				ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР2Строка);
			КонецЦикла;
		Иначе	
			ОбластиР2 = Новый Массив;
			ОбластиР2.Добавить(ОбластьР2Шапка);
			ОбластиР2.Добавить(ОбластьР2Заголовок);
			//ОбластиР2.Добавить(ОбластьР2Строка);
			
			Если Не ТабличныйДокументКонтрольСтраниц.ПроверитьВывод(ОбластиР2) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				НомерСтраницы = НомерСтраницы + 1;
				ТабличныйДокумент.Вывести(ОбластьР2Шапка);
				ТабличныйДокумент.Вывести(ОбластьР2Заголовок);
				
				ТабличныйДокументКонтрольСтраниц.Очистить();
				ТабличныйДокументКонтрольСтраниц.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР2Шапка);
				ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР2Заголовок);
			Иначе	
				ТабличныйДокумент.Вывести(ОбластьР2Шапка);
				ТабличныйДокумент.Вывести(ОбластьР2Заголовок);
				ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР2Шапка);
				ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР2Заголовок);
			КонецЕсли;
			//ТабличныйДокумент.Вывести(ОбластьР2Строка);
			//ТабличныйДокументКонтрольСтраниц.Вывести(ОбластьР2Строка);
		КонецЕсли;	
		
		// Раздел 3
		
		ТабличныйДокумент.Вывести(ОбластьР3Шапка);
		
		Для Каждого ВыборкаОС Из ВыборкаДокументов.ЗаключениеПоОбъектам Цикл
			
			ОбластьР3Строка.Параметры.Заполнить(ВыборкаОС);
			ТабличныйДокумент.Вывести(ОбластьР3Строка);
			
		КонецЦикла;
		
		// Приложения
		
		Сч = 0;
		Для Каждого ВыборкаФайлы Из ВыборкаДокументов.Файлы Цикл
			Если Сч = 0 Тогда
				ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
			КонецЕсли;
			Сч = Сч + 1;
			ОбластьПриложение.Параметры.Заполнить(Новый Структура("Номер", Сч));
			ОбластьПриложение.Параметры.Заполнить(ВыборкаФайлы);
			ТабличныйДокумент.Вывести(ОбластьПриложение);
		КонецЦикла;
		
		// Комиссия
		
		// Председатель
		Отбор = Новый Структура("Ссылка,Председатель", ВыборкаДокументов.Ссылка, Истина);
		СтрокиПредседатель = СоставКомиссий.НайтиСтроки(Отбор);
		ДанныеПредседателя = Новый Структура("Должность,НаименованиеДолжности,Сотрудник,ОсобыеОтметки,ФайлОсобогоМнения,ФИО");
		Для Каждого Председатель Из СтрокиПредседатель Цикл
			ЗаполнитьЗначенияСвойств(ДанныеПредседателя, Председатель);
			ДанныеПредседателя.ФИО = КорреспондентыКлиентСервер.ФИО(Председатель);
			ОбластьКомиссияП.Параметры.Заполнить(ДанныеПредседателя);
		КонецЦикла;
		ТабличныйДокумент.Вывести(ОбластьКомиссияП);
		
		// Члены комиссии
		Отбор = Новый Структура("Ссылка,Председатель", ВыборкаДокументов.Ссылка, Ложь);
		СтрокиЧленыКомиссии = СоставКомиссий.НайтиСтроки(Отбор);
		ПерваяСтрока = Истина;
		ДанныеЧК = Новый Структура("Должность,НаименованиеДолжности,Сотрудник,ОсобыеОтметки,ФайлОсобогоМнения,ФИО,Заголовок");
		Для Каждого ЧленКомиссии Из СтрокиЧленыКомиссии Цикл
			ЗаполнитьЗначенияСвойств(ДанныеЧК, ЧленКомиссии);
			ДанныеЧК.ФИО = КорреспондентыКлиентСервер.ФИО(ЧленКомиссии);
			ДанныеЧК.Заголовок = ?(ПерваяСтрока, НСтр("ru = 'Члены комиссии:'"), "");
			ОбластьКомиссияС.Параметры.Заполнить(ДанныеЧК);
			ТабличныйДокумент.Вывести(ОбластьКомиссияС);
			ПерваяСтрока = Ложь;
		КонецЦикла;
		
		// Исполнитель
		
		ДанныеОтветственного = Новый Структура;
		ДанныеОтветственного.Вставить("Должность", ДанныеОрганизации.ОтветственныйДолжность);
		ДанныеОтветственного.Вставить("ДолжностьНаименование", Строка(ДанныеОрганизации.ОтветственныйДолжность));
		ДанныеОтветственного.Вставить("ФИО", КорреспондентыКлиентСервер.ФИО(ДанныеОрганизации.ОтветственныйФИО, Истина));
		ДанныеОтветственного.Вставить("Исполнитель", ДанныеОрганизации.ОтветственныйИсполнитель);
		ДанныеОтветственного.Вставить("НомерТелефона", ДанныеОрганизации.ОтветственныйТелефон);
		ДанныеОтветственного.Вставить("ЭлектроннаяПочта", ДанныеОрганизации.ОтветственныйЭлПочта);
		ОбластьИсполнитель.Параметры.Заполнить(ДанныеОтветственного);
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);

		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Напечатать решение о признании НФА.
// 
// Параметры:
//  МассивОбъектов - Массив - Массив объектов
//  ОбъектыПечати - СписокЗначений - Объекты печати
//  ДанныеДокументов - Структура:
//  * ВыборкаДокументов - ВыборкаИзРезультатаЗапроса
//  * ВыборкаОС - ВыборкаИзРезультатаЗапроса
//  * ВыборкаРаботы - ВыборкаИзРезультатаЗапроса
//  * Драгметаллы - ВыборкаИзРезультатаЗапроса
//  * ПТС - ВыборкаИзРезультатаЗапроса
//  * ЕГРН - ВыборкаИзРезультатаЗапроса
//  * Характеристики -
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Напечатать решение о признании НФА
Функция НапечататьРешениеОПризнанииНФА(МассивОбъектов, ОбъектыПечати, ДанныеДокументов) Экспорт
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПроверитьДостижениеКворумаПрисутствияПриПечати(МассивОбъектов);
	// Конец ИндикаторКворумаПрисутствия
	
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Решение0510441";
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Решение0510441");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьР1Шапка		= Макет.ПолучитьОбласть("Раздел1_Шапка");
	ОбластьР1Строка		= Макет.ПолучитьОбласть("Раздел1_Строка");
	ОбластьР1Итог		= Макет.ПолучитьОбласть("Раздел1_Итог");
	ОбластьСправочно	= Макет.ПолучитьОбласть("Справочно");
	ОбластьР2Шапка		= Макет.ПолучитьОбласть("Раздел2_Шапка");
	//ОбластьР2ЗаголовокТаблицы = Макет.ПолучитьОбласть("Раздел2_ЗаголовокТаблицы");
	ОбластьР2Строка		= Макет.ПолучитьОбласть("Раздел2_Строка");
	ОбластьР3Шапка		= Макет.ПолучитьОбласть("Раздел3_Шапка");
	ОбластьР3Строка		= Макет.ПолучитьОбласть("Раздел3_Строка");
	ОбластьР4Шапка		= Макет.ПолучитьОбласть("Раздел4_Шапка");
	ОбластьР4Строка		= Макет.ПолучитьОбласть("Раздел4_Строка");
	ОбластьПустаяСтрока	= Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПриложение	= Макет.ПолучитьОбласть("Приложение");
	ОбластьКомиссияП	= Макет.ПолучитьОбласть("Комиссия_Председатель");
	ОбластьКомиссияС	= Макет.ПолучитьОбласть("Комиссия_Строка");
	ОбластьИсполнитель	= Макет.ПолучитьОбласть("Исполнитель");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	ОбластьСтраница2    = Макет.ПолучитьОбласть("Страница2");
	
	ВыборкаДокументов	= ДанныеДокументов.ВыборкаДокументов;
	ВыборкаОС			= ДанныеДокументов.ВыборкаОС;
	ВыборкаРаботы		= ДанныеДокументов.ВыборкаРаботы;
	ВыборкаФайлы		= ДанныеДокументов.ВыборкаФайлы;
	
	Данные = Новый Структура;
	Данные.Вставить("Драгметаллы"		, ДанныеДокументов.Драгметаллы);
	Данные.Вставить("ПТС"				, ДанныеДокументов.ПТС);
	Данные.Вставить("ЕГРН"				, ДанныеДокументов.ЕГРН);
	Данные.Вставить("Характеристики"	, ДанныеДокументов.Характеристики);
	Данные.Вставить("ДатаСписания"		, '00010101');
	
	Справочники.ОсновныеСредства.ИнициализироватьПараметрыДопХарактеристик(Данные);
	
	ТаблицаХарактеристик = Данные.ТаблицаХарактеристики.СкопироватьКолонки();
	ТаблицаХарактеристик.Колонки.Добавить("НомерСтроки");
	ТаблицаХарактеристик.Колонки.Добавить("НаименованиеОС");
	
	РезультатыГолосования = ОбщегоНазначенияБГУ.РезультатыГолосованияКомиссийПоДокументам(МассивОбъектов);
	СоставКомиссий = ОбщегоНазначенияБГУ.СоставКомиссийПоДокументам(МассивОбъектов);
	ДанныеОрганизацийПечати = ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		
		// Шапка
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаДокументов);
		
		ПараметрыШапки = Новый Структура;
		ПараметрыШапки.Вставить("НомерАкта", ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
			ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер));
		
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ВыборкаДокументов.СчетВид) Тогда
			ПараметрыШапки.Вставить("СчетВид", "0" + ВыборкаДокументов.СчетВид);
		КонецЕсли;
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект,Период,Фамилия,Имя,Отчество,ДолжностьНаименование",
			ВыборкаДокументов.Сотрудник, ВыборкаДокументов.ДатаАкта);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
		ЧастиФИО = Новый Массив;
		ЧастиФИО.Добавить(ДанныеСотрудника.Фамилия);
		ЧастиФИО.Добавить(ДанныеСотрудника.Имя);
		ЧастиФИО.Добавить(ДанныеСотрудника.Отчество);
		ЧастиЦМО = Новый Массив;
		ЧастиЦМО.Добавить(СтрСоединить(ЧастиФИО, " "));
		ЧастиЦМО.Добавить(ДанныеСотрудника.ДолжностьНаименование);
		ПараметрыШапки.Вставить("НаименованиеЦМО", СтрСоединить(ЧастиЦМО, ", "));
		
		ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
		ДанныеОрганизации = ДанныеОрганизацийПечати.Получить(ВыборкаДокументов.Ссылка);
		ОбластьШапка.Параметры.Заполнить(ДанныеОрганизации);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		
		// Раздел 1
		
		ТабличныйДокумент.Вывести(ОбластьР1Шапка);
		
		ТаблицаХарактеристик.Очистить();
		
		ВыборкаОС.Сбросить();
		
		ПоляИтог = Новый Структура("Количество,Сумма,СуммаАмортизации,СуммаОбесценения", 0, 0, 0, 0);
		
		Пока ВыборкаОС.НайтиСледующий(СтруктураПоиска) Цикл
			
			ФактическийСрокЭксплуатации = УправлениеОсновнымиСредствами.РассчитатьМесяцыЭксплуатации(,
				ВыборкаОС.ДатаВводаВЭксплуатацию, ВыборкаДокументов.ДатаАкта);
			ПараметрыСтроки = Новый Структура("СрокЭксплуатации", ФактическийСрокЭксплуатации);
			
			ОбластьР1Строка.Параметры.Заполнить(ВыборкаОС);
			ОбластьР1Строка.Параметры.Заполнить(ПараметрыСтроки);
			ТабличныйДокумент.Вывести(ОбластьР1Строка);
			
			Для Каждого ЭлементИтога Из ПоляИтог Цикл
				ИмяПоля = ЭлементИтога.Ключ;
				ПоляИтог[ИмяПоля] = ПоляИтог[ИмяПоля] + ВыборкаОС[ИмяПоля];
			КонецЦикла;
			
			Если ТипЗнч(ВыборкаОС.ОсновноеСредство) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
				Данные.Вставить("МожетСодержатьДрагМатериалы", ВыборкаОС.МожетСодержатьДрагМатериалы);
				СтруктураПоискаОС = Новый Структура("ОсновноеСредство", ВыборкаОС.ОсновноеСредство);
				Справочники.ОсновныеСредства.ЗаполнитьТаблицуДопХарактеристик(Данные, СтруктураПоискаОС,, ВыборкаОС.ИнвентарныйНомер);
				Для НомерСтроки = 1 По Данные.ТаблицаХарактеристики.Количество() Цикл
					СтрокаХар = ТаблицаХарактеристик.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаХар, Данные.ТаблицаХарактеристики[НомерСтроки-1]);
					Если НомерСтроки = 1 Тогда
						СтрокаХар.НаименованиеОС = ВыборкаОС.НаименованиеОС;
						СтрокаХар.НомерСтроки = ВыборкаОС.НомерСтроки;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ТипЗнч(ВыборкаОС.ОсновноеСредство) = Тип("СправочникСсылка.Номенклатура") Тогда
				Данные.Характеристики.Сбросить();
				ЕстьЗаписи = Ложь;
				СтруктураПоискаМЗ = Новый Структура("Ссылка, ОсновноеСредство", ВыборкаДокументов.Ссылка, ВыборкаОС.ОсновноеСредство);
				Выборка = Данные.Характеристики;
				Пока Выборка.НайтиСледующий(СтруктураПоискаМЗ) Цикл
					НоваяСтрока = ТаблицаХарактеристик.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					НоваяСтрока.НаименованиеОС = ВыборкаОС.ОсновноеСредство;
					Если ЕстьЗаписи Тогда
						НоваяСтрока.Характеристика = " - " + НоваяСтрока.Характеристика;
					КонецЕсли;
					Если ЗначениеЗаполнено(Выборка.ТекстоваяСтрока) Тогда
						НоваяСтрока.ЗначениеХарактеристики = Выборка.ТекстоваяСтрока;
					КонецЕсли;
				КонецЦикла;
				Если ВыборкаОС.МожетСодержатьДрагМатериалы Тогда
					Данные.ДрагМеталлы.Сбросить();
					Выборка = Данные.ДрагМеталлы;
					СтрокТаблицы = ТаблицаХарактеристик.Количество();
					НомерСтроки = 1;
					Пока Выборка.НайтиСледующий(СтруктураПоискаМЗ) Цикл
						Если НомерСтроки > СтрокТаблицы Тогда
							СтрокаТаблицы = ТаблицаХарактеристик.Добавить();
						Иначе
							СтрокаТаблицы = ТаблицаХарактеристик[НомерСтроки-1];
							СтрокаТаблицы.НаименованиеОС = ВыборкаОС.ОсновноеСредство;
							НомерСтроки = НомерСтроки + 1;
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		ОбластьР1Итог.Параметры.Заполнить(ПоляИтог);
		ТабличныйДокумент.Вывести(ОбластьР1Итог);
		
		ТабличныйДокумент.Вывести(ОбластьСправочно);
		
		// Раздел 2
		
		Если ТаблицаХарактеристик.Количество() = 0 Тогда
			ТабличныйДокумент.Вывести(ОбластьР2Шапка);
		Иначе	
			СтрокаНачало = 0;
			ЭтоПерваяСтрока = Истина;
			ПредСтрока = 0;
			Для Каждого СтрокаХарактеристик Из ТаблицаХарактеристик Цикл
				ТекСтрока = ?(СтрокаХарактеристик.НомерСтроки = Неопределено, ПредСтрока, СтрокаХарактеристик.НомерСтроки);
				
				ОбластьР2Строка.Параметры.Заполнить(СтрокаХарактеристик);
				Если ЭтоПерваяСтрока Тогда
					МассивОбластей = Новый Массив;
					МассивОбластей.Добавить(ОбластьР2Шапка);
					МассивОбластей.Добавить(ОбластьР2Строка);
					Если Не ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
						ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						ТабличныйДокумент.Вывести(ОбластьР2Шапка);
					Иначе	
						ТабличныйДокумент.Вывести(ОбластьР2Шапка);
					КонецЕсли;
				Иначе	
					Если Не ТабличныйДокумент.ПроверитьВывод(ОбластьР2Строка) Тогда
						ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
				КонецЕсли;	
				
				ТабличныйДокумент.Вывести(ОбластьР2Строка);
				Если ТекСтрока <> ПредСтрока Тогда
					Если ПредСтрока <> 0 Тогда
						СтрокаКонец = ТабличныйДокумент.ВысотаТаблицы - 1;
						Если СтрокаНачало <> СтрокаКонец Тогда
							ТабличныйДокумент.Область(СтрокаНачало, 1, СтрокаКонец, 1).Объединить();
							ТабличныйДокумент.Область(СтрокаНачало, 2, СтрокаКонец, 3).Объединить();
						КонецЕсли;	
					КонецЕсли;	
					
					СтрокаНачало = ТабличныйДокумент.ВысотаТаблицы;
				КонецЕсли;	
				
				ЭтоПерваяСтрока = Ложь;
				ПредСтрока = ТекСтрока
			КонецЦикла;
			СтрокаКонец = ТабличныйДокумент.ВысотаТаблицы;
			Если СтрокаНачало <> СтрокаКонец Тогда
				ТабличныйДокумент.Область(СтрокаНачало, 1, СтрокаКонец, 1).Объединить();
				ТабличныйДокумент.Область(СтрокаНачало, 2, СтрокаКонец, 3).Объединить();
			КонецЕсли;	
		КонецЕсли;	
		
		// Раздел 3
		
		ТабличныйДокумент.Вывести(ОбластьСтраница2);
		ТабличныйДокумент.Вывести(ОбластьР3Шапка);
		
		ВыборкаРаботы.Сбросить();
		
		Пока ВыборкаРаботы.НайтиСледующий(СтруктураПоиска) Цикл
			ОбластьР3Строка.Параметры.Заполнить(ВыборкаРаботы);
			ТабличныйДокумент.Вывести(ОбластьР3Строка);
		КонецЦикла;
		
		// Раздел 4
		
		ТабличныйДокумент.Вывести(ОбластьР4Шапка);
		
		ВыборкаОС.Сбросить();
		ПараметрыГолосования = Новый Структура("ИтогГолосования,РезолюцияИтог");
		
		ЕстьРеквизит_МестонахождениеОС = (ВыборкаОС.Владелец().Колонки.Найти("МестонахождениеОС") <> Неопределено);
		Пока ВыборкаОС.НайтиСледующий(СтруктураПоиска) Цикл
			
			ОбластьР4Строка.Параметры.Заполнить(ВыборкаОС); 
			Если ЕстьРеквизит_МестонахождениеОС Тогда 
				// МестонахождениеОС - значение реквизита "Местонахождение" справочника ОС. 
				// Если реквизит есть и заполнен, добавим к адресу.
				Если ЗначениеЗаполнено(ВыборкаОС.Местонахождение) Тогда
					ОбластьР4Строка.Параметры.Местонахождение = ВыборкаОС.Местонахождение 
						+ ?(ЗначениеЗаполнено(ВыборкаОС.МестонахождениеОС), ", " + ВыборкаОС.МестонахождениеОС, "");
				ИначеЕсли ЗначениеЗаполнено(ВыборкаОС.МестонахождениеОС) Тогда
					ОбластьР4Строка.Параметры.Местонахождение = ВыборкаОС.МестонахождениеОС;
				КонецЕсли;		
			КонецЕсли;	
			
			// Результаты голосования комиссии по строке документа.
			ОтборПоИдентификаторуСтроки = Новый Структура("Документ, ИдентификаторСтроки",
				ВыборкаДокументов.Ссылка, ВыборкаОС.ИдентификаторСтроки);
			РезультатыГолосованияПоСтроке = РезультатыГолосования.НайтиСтроки(ОтборПоИдентификаторуСтроки);
			Если РезультатыГолосованияПоСтроке.Количество() > 0
				И РезультатыГолосованияПоСтроке[0].ГолосованиеПоСтрокеЗавершено Тогда
				ПараметрыГолосования.ИтогГолосования = РезультатыГолосованияПоСтроке[0].ИтогГолосования;
				ПараметрыГолосования.РезолюцияИтог = ?(РезультатыГолосованияПоСтроке[0].РезолюцияКомиссииОдобрена,
					"", НСтр("ru = 'снято с обсуждения'"));
			Иначе // Результаты голосования по строке документа не найдены.
				ПараметрыГолосования.ИтогГолосования = 0;
				ПараметрыГолосования.РезолюцияИтог = "";
			КонецЕсли;
			ОбластьР4Строка.Параметры.Заполнить(ПараметрыГолосования);
			
			ТабличныйДокумент.Вывести(ОбластьР4Строка);
			
		КонецЦикла;
		
		// Приложения
		
		Сч = 0;
		Пока ВыборкаФайлы.НайтиСледующий(СтруктураПоиска) Цикл
			Если Сч = 0 Тогда
				ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
			КонецЕсли;
			Сч = Сч + 1;
			ОбластьПриложение.Параметры.Заполнить(Новый Структура("Номер", Сч));
			ОбластьПриложение.Параметры.Заполнить(ВыборкаФайлы);
			ТабличныйДокумент.Вывести(ОбластьПриложение);
		КонецЦикла;
		
		// Комиссия
		
		// Председатель
		Отбор = Новый Структура("Ссылка,Председатель", ВыборкаДокументов.Ссылка, Истина);
		СтрокиПредседатель = СоставКомиссий.НайтиСтроки(Отбор);
		ДанныеПредседателя = Новый Структура("Должность,НаименованиеДолжности,Сотрудник,ОсобыеОтметки,ФайлОсобогоМнения,ФИО");
		Для Каждого Председатель Из СтрокиПредседатель Цикл
			ЗаполнитьЗначенияСвойств(ДанныеПредседателя, Председатель);
			ДанныеПредседателя.ФИО = КорреспондентыКлиентСервер.ФИО(Председатель, Истина);
			ОбластьКомиссияП.Параметры.Заполнить(ДанныеПредседателя);
		КонецЦикла;
		ТабличныйДокумент.Вывести(ОбластьКомиссияП);
		
		// Члены комиссии
		Отбор = Новый Структура("Ссылка,Председатель", ВыборкаДокументов.Ссылка, Ложь);
		СтрокиЧленыКомиссии = СоставКомиссий.НайтиСтроки(Отбор);
		ПерваяСтрока = Истина;
		ДанныеЧК = Новый Структура("Должность,НаименованиеДолжности,Сотрудник,ОсобыеОтметки,ФайлОсобогоМнения,ФИО,Заголовок");
		Для Каждого ЧленКомиссии Из СтрокиЧленыКомиссии Цикл
			ЗаполнитьЗначенияСвойств(ДанныеЧК, ЧленКомиссии);
			ДанныеЧК.ФИО = КорреспондентыКлиентСервер.ФИО(ЧленКомиссии, Истина);
			ДанныеЧК.Заголовок = ?(ПерваяСтрока, НСтр("ru = 'Члены комиссии:'"), "");
			ОбластьКомиссияС.Параметры.Заполнить(ДанныеЧК);
			ТабличныйДокумент.Вывести(ОбластьКомиссияС);
			ПерваяСтрока = Ложь;
		КонецЦикла;
		
		// Исполнитель
		
		ДанныеОтветственного = Новый Структура;
		ДанныеОтветственного.Вставить("Должность", ДанныеОрганизации.ОтветственныйДолжность);
		ДанныеОтветственного.Вставить("ДолжностьНаименование", Строка(ДанныеОрганизации.ОтветственныйДолжность));
		ДанныеОтветственного.Вставить("ФИО", КорреспондентыКлиентСервер.ФИО(ДанныеОрганизации.ОтветственныйФИО, Истина));
		ДанныеОтветственного.Вставить("Исполнитель", ДанныеОрганизации.ОтветственныйИсполнитель);
		ДанныеОтветственного.Вставить("НомерТелефона", ДанныеОрганизации.ОтветственныйТелефон);
		ДанныеОтветственного.Вставить("ЭлектроннаяПочта", ДанныеОрганизации.ОтветственныйЭлПочта);
		ОбластьИсполнитель.Параметры.Заполнить(ДанныеОтветственного);
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.ВерхнийКолонтитул.ТекстСправа = "Форма 0510441 с.[&НомерСтраницы]";
	ТабличныйДокумент.ВерхнийКолонтитул.Выводить = Истина;
	ТабличныйДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 2;
	
 	Возврат ТабличныйДокумент;
	
КонецФункции

// Напечатать0510448.
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  МЗПоСебестоимости - Булево
// 
// Возвращаемое значение:
//  ТабличныйДокумент -  Напечатать0510448
Функция Напечатать0510448(МассивОбъектов, ОбъектыПечати, МЗПоСебестоимости = Ложь) Экспорт

	ДанныеДляПечати = ТаблицаШапкиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
	Для Каждого Документ Из ОбщегоНазначенияБГУ.ДокументыПоТипам(МассивОбъектов) Цикл
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ.Значение[0]);
		МенеджерДокумента.ДобавитьДанныеДляПечати0510448(ДанныеДляПечати, Документ.Значение, МЗПоСебестоимости);
	КонецЦикла;
	
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Акт0510448";
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Акт0510448");
	
	ОбластьРуководитель	= Макет.ПолучитьОбласть("Руководитель");
	ОбластьШапка1		= Макет.ПолучитьОбласть("Шапка1");
	ОбластьОтправитель	= Макет.ПолучитьОбласть("Отправитель");
	ОбластьПолучатель	= Макет.ПолучитьОбласть("Получатель");
	ОбластьШапка2		= Макет.ПолучитьОбласть("Шапка2");
	ОбластьР1Шапка		= Макет.ПолучитьОбласть("Раздел1_Шапка");
	ОбластьР1Строка		= Макет.ПолучитьОбласть("Раздел1_Строка");
	ОбластьР1Подвал		= Макет.ПолучитьОбласть("Раздел1_Подвал");
	ОбластьР2Шапка		= Макет.ПолучитьОбласть("Раздел2_Шапка");
	ОбластьР2Строка		= Макет.ПолучитьОбласть("Раздел2_Строка");
	ОбластьР3Шапка		= Макет.ПолучитьОбласть("Раздел3_Шапка");
	ОбластьР3Строка		= Макет.ПолучитьОбласть("Раздел3_Строка");
	ОбластьР4Шапка		= Макет.ПолучитьОбласть("Раздел4_Шапка");
	ОбластьР4Строка		= Макет.ПолучитьОбласть("Раздел4_Строка");
	ОбластьПустаяСтрока	= Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПриложение	= Макет.ПолучитьОбласть("Приложение");
	ОбластьЦМО			= Макет.ПолучитьОбласть("ЦМО");
	ОбластьКомиссияП	= Макет.ПолучитьОбласть("Комиссия_Председатель");
	ОбластьКомиссияС	= Макет.ПолучитьОбласть("Комиссия_Строка");
	ОбластьИсполнитель1	= Макет.ПолучитьОбласть("Исполнитель");
	ОбластьИсполнитель2	= Макет.ПолучитьОбласть("Исполнитель");
	
	МетодыНачисления = УправлениеОсновнымиСредствамиПовтИсп.СпособыНачисленияАмортизации_Соответствие();
	
	ДанныеПечатиОбщие = ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	Для Каждого ВыборкаДокументов Из ДанныеДляПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СотрудникиДокумента = Новый Массив; // Массив из СправочникСсылка.Сотрудники
		СотрудникиДокумента.Добавить(ВыборкаДокументов.Руководитель);
		СотрудникиДокумента.Добавить(ВыборкаДокументов.Сотрудник);
		СотрудникиДокумента.Добавить(ВыборкаДокументов.СотрудникПолучатель);
		СотрудникиДокумента.Добавить(ВыборкаДокументов.СотрудникОтправитель);
		ДанныеСотрудниковДокумента = Справочники.Сотрудники.ДанныеСотрудников(СотрудникиДокумента,
			"Фамилия, Имя, Отчество, Должность, ДолжностьНаименование, Подразделение", ВыборкаДокументов.ДатаАкта); 
		РуководительСсылка = ВыборкаДокументов.Руководитель;
		РуководительФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудниковДокумента.Получить(ВыборкаДокументов.Руководитель), Истина);
		Сотрудник = ДанныеСотрудниковДокумента.Получить(ВыборкаДокументов.Сотрудник);
		СотрудникФИО = КорреспондентыКлиентСервер.ФИО(Сотрудник, Истина);
		
		СотрудникПолучатель = ДанныеСотрудниковДокумента.Получить(ВыборкаДокументов.СотрудникПолучатель);
		СотрудникПолучательФИО = КорреспондентыКлиентСервер.ФИО(СотрудникПолучатель, Истина);
		СотрудникОтправитель = ДанныеСотрудниковДокумента.Получить(ВыборкаДокументов.СотрудникОтправитель);
		СотрудникОтправительФИО = КорреспондентыКлиентСервер.ФИО(СотрудникОтправитель, Истина);
		
		ДанныеПечатиОбщиеДокумента = ДанныеПечатиОбщие.Получить(ВыборкаДокументов.Ссылка);

		СведенияИсполнителя = Новый Структура;
		СведенияИсполнителя.Вставить("ДолжностьНаименование", ДанныеПечатиОбщиеДокумента.ОтветственныйДолжность);
		СведенияИсполнителя.Вставить("ФИО", КорреспондентыКлиентСервер.ФИО(ДанныеПечатиОбщиеДокумента.ОтветственныйФИО, Истина));
		СведенияИсполнителя.Вставить("НомерТелефона", ДанныеПечатиОбщиеДокумента.ОтветственныйТелефон);
		СведенияИсполнителя.Вставить("ЭлектроннаяПочта", ДанныеПечатиОбщиеДокумента.ОтветственныйЭлПочта);

		ПараметрыРуководитель	= Новый Структура;
		ПараметрыОтправитель	= Новый Структура;
		ПараметрыПолучатель		= Новый Структура;
		ПараметрыЦМО			= Новый Структура;
		
		ПараметрыОрганизации = Новый Структура;
		ПараметрыОрганизации.Вставить("НаименованиеКонтрагента"	                , ДанныеПечатиОбщиеДокумента.НаименованиеОрганизации);
		ПараметрыОрганизации.Вставить("Контрагент"								, ДанныеПечатиОбщиеДокумента.Организация);
		ПараметрыОрганизации.Вставить("КодРПБС"									, ДанныеПечатиОбщиеДокумента.КодРПБС);
		ПараметрыОрганизации.Вставить("НаименованиеОбособленногоПодразделения"	, ДанныеПечатиОбщиеДокумента.НаименованиеОбособленногоПодразделения);
		ПараметрыОрганизации.Вставить("ОбособленноеПодразделение"				, ДанныеПечатиОбщиеДокумента.ОбособленноеПодразделение);
		ПараметрыОрганизации.Вставить("КодРПБСПодр"								, ДанныеПечатиОбщиеДокумента.КодРПБСОбособленногоПодразделения);
		ПараметрыОрганизации.Вставить("НаименованиеСтруктурногоПодразделения"	, ДанныеПечатиОбщиеДокумента.СтруктурноеПодразделение);
		ПараметрыОрганизации.Вставить("СтруктурноеПодразделение"				, ДанныеПечатиОбщиеДокумента.СтруктурноеПодразделение);
		ПараметрыОрганизации.Вставить("Учредитель"								, ДанныеПечатиОбщиеДокумента.Учредитель);
		ПараметрыОрганизации.Вставить("ГлаваБК"									, ДанныеПечатиОбщиеДокумента.ГлаваБК);
		ПараметрыОрганизации.Вставить("БюджетНаименование"						, ДанныеПечатиОбщиеДокумента.БюджетНаименование);
		ПараметрыОрганизации.Вставить("ОКТМО"									, ДанныеПечатиОбщиеДокумента.ОКТМО);
		
		ПараметрыКонтрагента = Новый Структура(
			"НаименованиеКонтрагента, Контрагент, КодРПБС, НаименованиеОбособленногоПодразделения, ОбособленноеПодразделение,
			|КодРПБСПодр, НаименованиеСтруктурногоПодразделения, СтруктурноеПодразделение, Учредитель, ГлаваБК,
			|БюджетНаименование, ОКТМО");
		Если ТипЗнч(ВыборкаДокументов.Ссылка) = Тип("ДокументСсылка.СписаниеОбъектовОС") Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыКонтрагента, ПараметрыОрганизации);
		Иначе	
			ПараметрыКонтрагента.Вставить("НаименованиеКонтрагента"					, ВыборкаДокументов.КонтрагентНаименование);
			ПараметрыКонтрагента.Вставить("Контрагент"								, ВыборкаДокументов.Контрагент);
			ПараметрыКонтрагента.Вставить("КодРПБС"									, ВыборкаДокументов.КонтрагентКодРПБС);
			ПараметрыКонтрагента.Вставить("НаименованиеОбособленногоПодразделения"  , ВыборкаДокументов.КонтрагентОбособленноеПодразделениеНаименование);
			ПараметрыКонтрагента.Вставить("ОбособленноеПодразделение"               , ВыборкаДокументов.КонтрагентОбособленноеПодразделение);
			ПараметрыКонтрагента.Вставить("КодРПБСПодр"                             , ВыборкаДокументов.КонтрагентОбособленноеПодразделениеКодРПБС);       
			ПараметрыКонтрагента.Вставить("НаименованиеСтруктурногоПодразделения"   , "");
			ПараметрыОрганизации.Вставить("СтруктурноеПодразделение"				, Справочники.Подразделения.ПустаяСсылка());
			ПараметрыКонтрагента.Вставить("Учредитель"								, ВыборкаДокументов.КонтрагентУчредитель);
			ПараметрыКонтрагента.Вставить("ГлаваБК"									, ВыборкаДокументов.КонтрагентГлаваБК);
			ПараметрыКонтрагента.Вставить("БюджетНаименование"						, ВыборкаДокументов.КонтрагентБюджетНаименование);
			ПараметрыКонтрагента.Вставить("ОКТМО"									, ВыборкаДокументов.КонтрагентОКТМО);
		КонецЕсли;	
		
		ПараметрыЦМО.Вставить("НаименованиеДолжностиСдал"	, "");
		ПараметрыЦМО.Вставить("ДолжностьСдал"				, "");
		ПараметрыЦМО.Вставить("ФИОСдал"						, "");
		ПараметрыЦМО.Вставить("Сдал"						, "");
		ПараметрыЦМО.Вставить("НаименованиеДолжностиПринял"	, "");
		ПараметрыЦМО.Вставить("ДолжностьПринял"				, "");
		ПараметрыЦМО.Вставить("ФИОПринял"					, "");
		ПараметрыЦМО.Вставить("Принял"						, "");
		Если ЗначениеЗаполнено(ВыборкаДокументов.СотрудникПолучатель) ИЛИ ЗначениеЗаполнено(ВыборкаДокументов.СотрудникОтправитель) Тогда
			ПараметрыЦМО.Вставить("НаименованиеДолжностиПринял", СотрудникПолучатель.ДолжностьНаименование);
			ПараметрыЦМО.Вставить("ДолжностьПринял"            , СотрудникПолучатель.Должность);
			ПараметрыЦМО.Вставить("ФИОПринял"                  , СотрудникПолучательФИО);
			ПараметрыЦМО.Вставить("Принял"                     , ВыборкаДокументов.СотрудникПолучатель);

			ПараметрыЦМО.Вставить("НаименованиеДолжностиСдал", СотрудникОтправитель.ДолжностьНаименование);
			ПараметрыЦМО.Вставить("ДолжностьСдал"            , СотрудникОтправитель.Должность);
			ПараметрыЦМО.Вставить("ФИОСдал"                  , СотрудникОтправительФИО);
			ПараметрыЦМО.Вставить("Сдал"                     , ВыборкаДокументов.СотрудникОтправитель);
		ИначеЕсли ВыборкаДокументов.Принятие Тогда
			ПараметрыЦМО.Вставить("НаименованиеДолжностиПринял"	, Сотрудник.ДолжностьНаименование);
			ПараметрыЦМО.Вставить("ДолжностьПринял"				, Сотрудник.Должность);
			ПараметрыЦМО.Вставить("ФИОПринял"					, СотрудникФИО);
			ПараметрыЦМО.Вставить("Принял"						, ВыборкаДокументов.Сотрудник);
		Иначе
			ПараметрыЦМО.Вставить("НаименованиеДолжностиСдал"	, Сотрудник.ДолжностьНаименование);
			ПараметрыЦМО.Вставить("ДолжностьСдал"				, Сотрудник.Должность);
			ПараметрыЦМО.Вставить("ФИОСдал"						, СотрудникФИО);
			ПараметрыЦМО.Вставить("Сдал"						, ВыборкаДокументов.Сотрудник);
		КонецЕсли;

		Если ВыборкаДокументов.Принятие Тогда
			
			ПараметрыРуководитель.Вставить("ФИООтправителя"	, "");
			ПараметрыРуководитель.Вставить("Отправитель"	, Неопределено);
			ПараметрыРуководитель.Вставить("ФИОПолучателя"	, РуководительФИО);
			ПараметрыРуководитель.Вставить("Получатель"		, РуководительСсылка);
			
			Если ВыборкаДокументов.Передача Тогда
				ПараметрыОтправитель = ПараметрыКонтрагента;
			КонецЕсли;
			ПараметрыПолучатель = ПараметрыОрганизации;
			
			ОбластьИсполнитель2.Параметры.Заполнить(СведенияИсполнителя);
			
		Иначе
			
			ПараметрыРуководитель.Вставить("ФИООтправителя"	, РуководительФИО);
			ПараметрыРуководитель.Вставить("Отправитель"	, РуководительСсылка);
			ПараметрыРуководитель.Вставить("ФИОПолучателя"	, "");
			ПараметрыРуководитель.Вставить("Получатель"		, Неопределено);
			
			ПараметрыОтправитель = ПараметрыОрганизации;
			ПараметрыПолучатель = ПараметрыКонтрагента;
			
			ОбластьИсполнитель1.Параметры.Заполнить(СведенияИсполнителя);
			
		КонецЕсли;
		
		ОбластьРуководитель.Параметры.Заполнить(ПараметрыРуководитель);
		ТабличныйДокумент.Вывести(ОбластьРуководитель);
		
		// Шапка
		
		ОбластьШапка1.Параметры.Заполнить(ВыборкаДокументов);
		ТабличныйДокумент.Вывести(ОбластьШапка1);
		
		ОбластьОтправитель.Параметры.Заполнить(ПараметрыОтправитель);
		ТабличныйДокумент.Вывести(ОбластьОтправитель);
		ОбластьПолучатель.Параметры.Заполнить(ПараметрыПолучатель);
		ТабличныйДокумент.Вывести(ОбластьПолучатель);
		
		ОбластьШапка2.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьШапка2.Параметры.Заполнить(Новый Структура("НаименованиеПриказа", ВыборкаДокументов.НаименованиеПриказа));
		ТабличныйДокумент.Вывести(ОбластьШапка2);
		
		// Раздел 1
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокумент.Вывести(ОбластьР1Шапка);
		
		Количество       = 0;
		Сумма            = 0;
		СуммаАмортизации = 0;
		СуммаОбесценения = 0;
		СуммаВложений    = 0;
		
		Если Не ВыборкаДокументов.Принятие Тогда
			Для Каждого СтрокаПередаваемыйОбъект Из ВыборкаДокументов.ПередаваемыеОбъекты Цикл
				ОбластьР1Строка.Параметры.Заполнить(СтрокаПередаваемыйОбъект);
				ПараметрыСтроки = Новый Структура;
				
				МетодАмортизации = "";
				Если ЗначениеЗаполнено(СтрокаПередаваемыйОбъект.ПорядокНачисления) Тогда
					МетодАмортизации = МетодыНачисления[СтрокаПередаваемыйОбъект.ПорядокНачисления];
				КонецЕсли;
				
				ПараметрыСтроки.Вставить("МетодАмортизации", МетодАмортизации);
				Если СтрокаПередаваемыйОбъект.НомерСтроки < 1000 Тогда
					ПараметрыСтроки.Вставить("НомерСтроки", Формат(СтрокаПередаваемыйОбъект.НомерСтроки, "ЧЦ=3; ЧВН="));
				Иначе
					ПараметрыСтроки.Вставить("НомерСтроки", Формат(СтрокаПередаваемыйОбъект.НомерСтроки, "ЧГ=0"));
				КонецЕсли;
				ПараметрыСтроки.Вставить("НаименованиеНФА", НаименованиеНФА0510448(СтрокаПередаваемыйОбъект));
				ОбластьР1Строка.Параметры.Заполнить(ПараметрыСтроки);
				ТабличныйДокумент.Вывести(ОбластьР1Строка);
				
				Количество       = Количество + СтрокаПередаваемыйОбъект.Количество;
				Сумма            = Сумма + СтрокаПередаваемыйОбъект.Сумма;
				СуммаАмортизации = СуммаАмортизации	+ СтрокаПередаваемыйОбъект.СуммаАмортизации;
				СуммаОбесценения = СуммаОбесценения	+ СтрокаПередаваемыйОбъект.СуммаОбесценения;
				СуммаВложений    = СуммаВложений + СтрокаПередаваемыйОбъект.СуммаВложений;
			КонецЦикла;
		КонецЕсли;
		
		ОбластьР1Подвал.Параметры.Заполнить(Новый Структура(
			"Количество, Сумма, СуммаАмортизации, СуммаОбесценения, СуммаВложений",
			Количество, Сумма, СуммаАмортизации, СуммаОбесценения, СуммаВложений));
		ТабличныйДокумент.Вывести(ОбластьР1Подвал);
		
		// Раздел 2
		
		ТабличныйДокумент.Вывести(ОбластьР2Шапка);
		СтрокаНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		Для Каждого СтрокаХарактеристик Из ВыборкаДокументов.ИндивидуальныеХарактеристики Цикл
			Если ЗначениеЗаполнено(СтрокаХарактеристик.НФА) Тогда 
				СтрокаКонец = ТабличныйДокумент.ВысотаТаблицы;

				Если СтрокаНачало < СтрокаКонец Тогда
					ТабличныйДокумент.Область(СтрокаНачало, 1, СтрокаКонец, 1).Объединить();
					ТабличныйДокумент.Область(СтрокаНачало, 2, СтрокаКонец, 4).Объединить();
					ТабличныйДокумент.Область(СтрокаНачало, 5, СтрокаКонец, 6).Объединить();
					ТабличныйДокумент.Область(СтрокаНачало, 7, СтрокаКонец, 9).Объединить();
				КонецЕсли;	

				СтрокаНачало = СтрокаКонец + 1;
			КонецЕсли;	
			
			ОбластьР2Строка.Параметры.Заполнить(СтрокаХарактеристик);
			ПараметрыСтроки = Новый Структура;
			Если СтрокаХарактеристик.НомерСтроки < 1000 Тогда
				ПараметрыСтроки.Вставить("НомерСтроки", Формат(СтрокаХарактеристик.НомерСтроки, "ЧЦ=3; ЧВН="));
			Иначе
				ПараметрыСтроки.Вставить("НомерСтроки", Формат(СтрокаХарактеристик.НомерСтроки, "ЧГ=0"));
			КонецЕсли;
			ОбластьР2Строка.Параметры.Заполнить(ПараметрыСтроки);
			ТабличныйДокумент.Вывести(ОбластьР2Строка);
		КонецЦикла;
		СтрокаКонец = ТабличныйДокумент.ВысотаТаблицы;
		Если СтрокаНачало < СтрокаКонец Тогда
			ТабличныйДокумент.Область(СтрокаНачало, 1, СтрокаКонец, 1).Объединить();
			ТабличныйДокумент.Область(СтрокаНачало, 2, СтрокаКонец, 4).Объединить();
			ТабличныйДокумент.Область(СтрокаНачало, 5, СтрокаКонец, 6).Объединить();
			ТабличныйДокумент.Область(СтрокаНачало, 7, СтрокаКонец, 9).Объединить();
		КонецЕсли;	
		
		// Раздел 3
		
		ТабличныйДокумент.Вывести(ОбластьР3Шапка);
		Если Не ВыборкаДокументов.Принятие Тогда
			Для Каждого СтрокаОграничения Из ВыборкаДокументов.СведенияОбОграничениях Цикл
				ОбластьР3Строка.Параметры.Заполнить(СтрокаОграничения);
				ПараметрыСтроки = Новый Структура;
				Если СтрокаОграничения.НомерСтроки < 1000 Тогда
					ПараметрыСтроки.Вставить("НомерСтроки", Формат(СтрокаОграничения.НомерСтроки, "ЧЦ=3; ЧВН="));
				Иначе
					ПараметрыСтроки.Вставить("НомерСтроки", Формат(СтрокаОграничения.НомерСтроки, "ЧГ=0"));
				КонецЕсли;
				ОбластьР3Строка.Параметры.Заполнить(ПараметрыСтроки);
				ТабличныйДокумент.Вывести(ОбластьР3Строка);
			КонецЦикла;
		КонецЕсли;
		
		// Исполнитель
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		ТабличныйДокумент.Вывести(ОбластьИсполнитель1);
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		
		// Раздел 4
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокумент.Вывести(ОбластьР4Шапка);
		
		Если ВыборкаДокументов.Принятие Тогда
			Для Каждого СтрокаПринимаемыйОбъект Из ВыборкаДокументов.ПринятыеОбъектыНФА Цикл
				ОбластьР4Строка.Параметры.Заполнить(СтрокаПринимаемыйОбъект);
				ПараметрыСтроки = Новый Структура;
				Если СтрокаПринимаемыйОбъект.НомерСтроки < 1000 Тогда
					ПараметрыСтроки.Вставить("НомерСтроки", Формат(СтрокаПринимаемыйОбъект.НомерСтроки, "ЧЦ=3; ЧВН="));
				Иначе
					ПараметрыСтроки.Вставить("НомерСтроки", Формат(СтрокаПринимаемыйОбъект.НомерСтроки, "ЧГ=0"));
				КонецЕсли;
				ПараметрыСтроки.Вставить("НаименованиеНФА", НаименованиеНФА0510448(СтрокаПринимаемыйОбъект));
				
				Если НЕ ЗначениеЗаполнено(СтрокаПринимаемыйОбъект.МетодАмортизации) Тогда
					МетодАмортизации = "";
					Если ЗначениеЗаполнено(СтрокаПринимаемыйОбъект.ПорядокНачисления) Тогда
						МетодАмортизации = МетодыНачисления[СтрокаПринимаемыйОбъект.ПорядокНачисления];
					КонецЕсли;
					ПараметрыСтроки.Вставить("МетодАмортизации", МетодАмортизации);
				КонецЕсли;	
				ОбластьР4Строка.Параметры.Заполнить(ПараметрыСтроки);
				
				// Во исполнение требований письма Минфина России от 1 апреля 2024 г. N 02-06-06/29423 
				// "Методические рекомендации по применению отдельных унифицированных форм..."
				Если СтрокаПринимаемыйОбъект.ПорядокНачисления = "2" Тогда // 100% при вводе в эксплуатацию
					ОбластьР4Строка.Параметры.НормаАмортизации = "100%";
					ОбластьР4Строка.Параметры.АмортизационнаяГруппа = "";
					ОбластьР4Строка.Параметры.МетодАмортизации = "Линейный";
					ОбластьР4Строка.Параметры.ДатаОкончанияАмортизации = "";
					ОбластьР4Строка.Параметры.СрокПолезногоИспользования = "";
				КонецЕсли;	
				
				ТабличныйДокумент.Вывести(ОбластьР4Строка);
			КонецЦикла;
		Иначе
			Для Каждого СтрокаПередаваемыйОбъект Из ВыборкаДокументов.ПередаваемыеОбъекты Цикл
				ПараметрыСтроки = Новый Структура;
				Если СтрокаПередаваемыйОбъект.НомерСтроки < 1000 Тогда
					ПараметрыСтроки.Вставить("НомерСтроки", Формат(СтрокаПередаваемыйОбъект.НомерСтроки, "ЧЦ=3; ЧВН="));
				Иначе
					ПараметрыСтроки.Вставить("НомерСтроки", Формат(СтрокаПередаваемыйОбъект.НомерСтроки, "ЧГ=0"));
				КонецЕсли;
				ОбластьР4Строка.Параметры.Заполнить(ПараметрыСтроки);
				ТабличныйДокумент.Вывести(ОбластьР4Строка);	
			КонецЦикла;
		КонецЕсли;
		
		// Приложения
		
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		Сч = 0;
		Если ВыборкаДокументов.ФайлыАктаЭДО.Количество() > 0 Тогда
			Для Каждого ВыборкаФайлыАктаЭДО Из ВыборкаДокументов.ФайлыАктаЭДО Цикл
				Сч = Сч + 1;
				ОбластьПриложение.Параметры.Заполнить(Новый Структура("Номер", Сч));
				ОбластьПриложение.Параметры.Заполнить(ВыборкаФайлыАктаЭДО);
				ТабличныйДокумент.Вывести(ОбластьПриложение);
			КонецЦикла;
		ИначеЕсли ВыборкаДокументов.Файлы.Количество() > 0 Тогда
			Для Каждого ВыборкаФайлы Из ВыборкаДокументов.Файлы Цикл
				Сч = Сч + 1;
				ОбластьПриложение.Параметры.Заполнить(Новый Структура("Номер", Сч));
				ОбластьПриложение.Параметры.Заполнить(ВыборкаФайлы);
				ТабличныйДокумент.Вывести(ОбластьПриложение);
			КонецЦикла;
		Иначе
			ПустаяСтруктура = Новый Структура("Номер, Описание, ИмяФайла", "", "", "");
			ОбластьПриложение.Параметры.Заполнить(ПустаяСтруктура);
			ТабличныйДокумент.Вывести(ОбластьПриложение);
		КонецЕсли;	
		
		// ЦМО
		
		ОбластьЦМО.Параметры.Заполнить(ПараметрыЦМО);
		ТабличныйДокумент.Вывести(ОбластьЦМО);
		
		// Комиссия
		ВывестиСекциюКомиссия(
			ВыборкаДокументов.Ссылка, ВыборкаДокументов.СоставКомиссии, ТабличныйДокумент, ОбластьКомиссияП, ОбластьКомиссияС);
	
		// Исполнитель
		ТабличныйДокумент.Вывести(ОбластьИсполнитель2);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Напечатать0510450(МассивОбъектов, ОбъектыПечати, ВидНФА = "ОС") Экспорт
	
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Накладная0510450";
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Накладная0510450");
	
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	ОбластьЦМО			= Макет.ПолучитьОбласть("ЦМО");
	ОбластьИсполнитель	= Макет.ПолучитьОбласть("Исполнитель");
	
	Если ВидНФА = "ОС" Тогда
		ДанныеДляПечати = ДанныеДляПечати0510450_ОС(МассивОбъектов); // см. ТаблицаШапкиДляПечатиНакладнаяНаВнутреннееПеремещениеНФА0510450
	ИначеЕсли ВидНФА = "МЗ" Тогда
		ДанныеДляПечати = ДанныеДляПечати0510450_МЗ(МассивОбъектов); // см. ТаблицаШапкиДляПечатиНакладнаяНаВнутреннееПеремещениеНФА0510450
	Иначе
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	ДанныеПечатиОбщие = ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	Для Каждого ВыборкаДокументов Из ДанныеДляПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечатиОбщиеДокумента = ДанныеПечатиОбщие.Получить(ВыборкаДокументов.Ссылка);

		// Шапка
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументов);
		
		ПараметрыОрганизации = Новый Структура;
		ПараметрыОрганизации.Вставить("НаименованиеОрганизации"                , ДанныеПечатиОбщиеДокумента.НаименованиеОрганизации);
		ПараметрыОрганизации.Вставить("Организация"                            , ДанныеПечатиОбщиеДокумента.Организация);
		ПараметрыОрганизации.Вставить("КодРПБС"                                , ДанныеПечатиОбщиеДокумента.КодРПБС);
		ПараметрыОрганизации.Вставить("НаименованиеОбособленногоПодразделения" , ДанныеПечатиОбщиеДокумента.НаименованиеОбособленногоПодразделения);
		ПараметрыОрганизации.Вставить("ОбособленноеПодразделение"              , ДанныеПечатиОбщиеДокумента.ОбособленноеПодразделение);
		ПараметрыОрганизации.Вставить("КодРПБСПодр"                            , ДанныеПечатиОбщиеДокумента.КодРПБСОбособленногоПодразделения);
		ПараметрыОрганизации.Вставить("НаименованиеСтруктурногоПодразделения"  , ДанныеПечатиОбщиеДокумента.НаименованиеСтруктурногоПодразделения);
		ПараметрыОрганизации.Вставить("СтруктурноеПодразделение"               , ДанныеПечатиОбщиеДокумента.СтруктурноеПодразделение);
		ПараметрыОрганизации.Вставить("Учредитель"                             , ДанныеПечатиОбщиеДокумента.Учредитель);
		ПараметрыОрганизации.Вставить("ГлаваБК"                                , ДанныеПечатиОбщиеДокумента.ГлаваБК);
		ПараметрыОрганизации.Вставить("БюджетНаименование"                     , ДанныеПечатиОбщиеДокумента.БюджетНаименование);
		ПараметрыОрганизации.Вставить("ОКТМО"                                  , ДанныеПечатиОбщиеДокумента.ОКТМО);
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыОрганизации);

		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		// Таблица
		Для Каждого ВыборкаГруппа Из ВыборкаДокументов.ГруппыНФА Цикл
			ОбластьШапка.Параметры.Заполнить(ВыборкаГруппа);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			ИтогоСумма = 0;
			Для Каждого ВыборкаСтрока Из ВыборкаГруппа.Состав Цикл
				ОбластьСтрока.Параметры.Заполнить(ВыборкаСтрока);
				Если ТипЗнч(ВыборкаСтрока.НФА) = Тип("СправочникСсылка.БСО") Тогда
					НомераБСО = Новый Структура("НомерНачальный, НомерКонечный");
					ЗаполнитьЗначенияСвойств(НомераБСО, ВыборкаСтрока);
					Если ЗначениеЗаполнено(НомераБСО.НомерНачальный) Тогда
						ПараметрИнвНомер = Новый Структура("ИнвентарныйНомер");
						Шаблон = "%1//%2";
						Если Не ЗначениеЗаполнено(НомераБСО.НомерКонечный)
							Или НомераБСО.НомерКонечный = НомераБСО.НомерНачальный Тогда
							НомерКонечный = "-";
						Иначе
							НомерКонечный = НомераБСО.НомерКонечный;
						КонецЕсли;
						ПараметрИнвНомер.ИнвентарныйНомер = СтрШаблон(Шаблон, НомераБСО.НомерНачальный, НомерКонечный);
						ОбластьСтрока.Параметры.Заполнить(ПараметрИнвНомер);
					КонецЕсли;
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				ИтогоСумма = ИтогоСумма + ВыборкаСтрока.Сумма;
			КонецЦикла;
			ОбластьПодвал.Параметры.Заполнить(Новый Структура("Сумма", ИтогоСумма));
			ТабличныйДокумент.Вывести(ОбластьПодвал);
		КонецЦикла;
		
		// ЦМО
		ПараметрыОбласти = Новый Структура;
		ПараметрыОбласти.Вставить("ФИООтправителя" , ВыборкаДокументов.ФИООтправителяРасшифровка);
		ПараметрыОбласти.Вставить("ФИОПолучателя"  , ВыборкаДокументов.ФИОПолучателяРасшифровка);
		
		ОбластьЦМО.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьЦМО.Параметры.Заполнить(ПараметрыОбласти);
		ТабличныйДокумент.Вывести(ОбластьЦМО);
		
		// Ответственный исполнитель
		ПараметрыИсполнитель = Новый Структура;
		ПараметрыИсполнитель.Вставить("ДолжностьНаименование", ДанныеПечатиОбщиеДокумента.ОтветственныйДолжность);
		ПараметрыИсполнитель.Вставить("ФИО", КорреспондентыКлиентСервер.ФИО(ДанныеПечатиОбщиеДокумента.ОтветственныйФИО, Истина));
		ПараметрыИсполнитель.Вставить("НомерТелефона", ДанныеПечатиОбщиеДокумента.ОтветственныйТелефон);
		ПараметрыИсполнитель.Вставить("ЭлектроннаяПочта", ДанныеПечатиОбщиеДокумента.ОтветственныйЭлПочта);
		ОбластьИсполнитель.Параметры.Заполнить(ПараметрыИсполнитель);
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеПечатиИтоговНДС(СуммаНДС, СтавкиНДС, СуммаВключаетНДС, Разделитель = "") Экспорт
	
	Если СуммаВключаетНДС Тогда
		СтрокаШаблона = НСтр("ru='В том числе НДС%1%2:'")
	Иначе
		СтрокаШаблона = НСтр("ru='НДС%1%2:'");
	КонецЕсли; 
	
	Если СуммаНДС <> 0 Тогда
		Если СтавкиНДС.Количество() = 1 Тогда
			СтавкаНДССтрокой = СтрШаблон(" %1%%", УчетНДСКлиентСервер.ЗначениеСтавкиНДС(СтавкиНДС[0]));
			
			Заголовок = СтрШаблон(СтрокаШаблона, СтавкаНДССтрокой, Разделитель);
		Иначе
			Заголовок = СтрШаблон(СтрокаШаблона, "", Разделитель);
		КонецЕсли; 
		
		Сумма = Формат(СуммаНДС, "ЧЦ=15;ЧДЦ=2");
	Иначе
		Если СтавкиНДС.Количество() = 0 Тогда
			Заголовок = СтрШаблон(СтрокаШаблона, "", Разделитель);
		Иначе
			Если СтавкиНДС.Найти(Перечисления.СтавкиНДС.НДС0) <> Неопределено Тогда
				Заголовок = НСтр("ru='НДС 0%:'");
			Иначе
				Заголовок = НСтр("ru='Без налога (НДС):'");
			КонецЕсли; 
		КонецЕсли;
		
		Сумма = НСтр("ru='-'");
	КонецЕсли;
	
	ДанныеПечатиИтогоНДС = Новый Структура();
	ДанныеПечатиИтогоНДС.Вставить("Заголовок",	Заголовок);
	ДанныеПечатиИтогоНДС.Вставить("Сумма",		Сумма);
	
	Возврат ДанныеПечатиИтогоНДС;
	
КонецФункции

Функция Напечатать0510454(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_АктСписания0510454";
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Акт0510454");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьР1Шапка		= Макет.ПолучитьОбласть("Раздел1_Шапка");
	ОбластьР1Строка		= Макет.ПолучитьОбласть("Раздел1_Строка");
	ОбластьР2Заголовок	= Макет.ПолучитьОбласть("Раздел2_Заголовок");
	ОбластьР2Шапка		= Макет.ПолучитьОбласть("Раздел2_Шапка");
	ОбластьР2Строка		= Макет.ПолучитьОбласть("Раздел2_Строка");
	ОбластьПустаяСтрока	= Макет.ПолучитьОбласть("Приложение_ПустаяСтрока");
	ОбластьПриложение	= Макет.ПолучитьОбласть("Приложение");
	ОбластьКомиссияП	= Макет.ПолучитьОбласть("Комиссия_Председатель");
	ОбластьКомиссияС	= Макет.ПолучитьОбласть("Комиссия_Строка");
	ОбластьИсполнитель	= Макет.ПолучитьОбласть("Исполнитель");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	ДанныеДокументов	= ДанныеДляПечати0510454(МассивОбъектов);
	
	РезультатыГолосования = ОбщегоНазначенияБГУ.РезультатыГолосованияКомиссийПоДокументам(МассивОбъектов);
	
	ДанныеПечатиОбщие = ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	Для Каждого ВыборкаДокументов Из ДанныеДокументов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		
		ПараметрыШапки = Новый Структура;
		
		НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер);
		ПараметрыШапки.Вставить("НомерАкта", НомерАкта);
		
		Если ЗначениеЗаполнено(ВыборкаДокументов.Сотрудник) Тогда
			Сотрудник = Новый Структура("СсылкаНаОбъект,Период,Фамилия,Имя,Отчество",
				ВыборкаДокументов.Сотрудник, ВыборкаДокументов.ДатаАкта);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(Сотрудник);
			ПараметрыШапки.Вставить("ЦМО", КорреспондентыКлиентСервер.ФИО(Сотрудник,,,Ложь, Истина));
		КонецЕсли;
		
		ПричиныСписания = Новый Массив;
		КодыПричиныСписания = Новый Массив;
		Для Каждого ВыборкаОбъектов Из ВыборкаДокументов.СведенияОбОбъектах Цикл
			Причина = СокрЛП(ВыборкаОбъектов.ПричинаСписания);
			Если ПричиныСписания.Найти(Причина) = Неопределено Тогда
				ПричиныСписания.Добавить(Причина);
			КонецЕсли;	

			КодПричина = СокрЛП(ВыборкаОбъектов.КодПричинаСписания);
			Если КодыПричиныСписания.Найти(КодПричина) = Неопределено Тогда
				КодыПричиныСписания.Добавить(КодПричина);
			КонецЕсли;	
		КонецЦикла;
		ПараметрыШапки.Вставить("ПричинаСписания", СтрСоединить(ПричиныСписания, " "));
		ПараметрыШапки.Вставить("КодПричинаСписания", СтрСоединить(КодыПричиныСписания, " "));
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаДокументов);

		// Данные руководителя
		РуководительЕстьВЗапросе = Ложь;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаДокументов, "Руководитель")
				И ЗначениеЗаполнено(ВыборкаДокументов["Руководитель"]) Тогда
			РуководительЕстьВЗапросе = Истина;
		КонецЕсли;
		
		Если РуководительЕстьВЗапросе Тогда                       
			РуководительСсылка = ВыборкаДокументов["Руководитель"];
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", 
				РуководительСсылка, ВыборкаДокументов.ДатаАкта);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина, Истина);
			РуководительФИО       = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
			РуководительДолжность = ДанныеСотрудника.Должность;
		Иначе	
			Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
				Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ВыборкаДокументов.Организация,
				ВыборкаДокументов.ДатаАкта, ВыборкаДокументов.СтруктурноеПодразделение);
			РуководительФИО       = КорреспондентыКлиентСервер.ФИО(Руководитель, Истина, "ОтветственноеЛицо");
			РуководительДолжность = Руководитель.ДолжностьПредставление;
		КонецЕсли;	
		ОбластьШапка.Параметры.ДолжностьРуководителя = РуководительДолжность;
		ОбластьШапка.Параметры.ФИОРуководителя       = РуководительФИО;
		
		ДанныеПечатиОбщиеДокумента = ДанныеПечатиОбщие.Получить(ВыборкаДокументов.Ссылка);

		ПараметрыШапки.Вставить("НаименованиеОрганизации"                , ДанныеПечатиОбщиеДокумента.НаименованиеОрганизации);
		ПараметрыШапки.Вставить("Организация"                            , ДанныеПечатиОбщиеДокумента.Организация);
		ПараметрыШапки.Вставить("КодРПБС"                                , ДанныеПечатиОбщиеДокумента.КодРПБС);
		ПараметрыШапки.Вставить("НаименованиеОбособленногоПодразделения" , ДанныеПечатиОбщиеДокумента.НаименованиеОбособленногоПодразделения);
		ПараметрыШапки.Вставить("ОбособленноеПодразделение"              , ДанныеПечатиОбщиеДокумента.ОбособленноеПодразделение);
		ПараметрыШапки.Вставить("КодРПБСПодр"                            , ДанныеПечатиОбщиеДокумента.КодРПБСОбособленногоПодразделения);
		ПараметрыШапки.Вставить("НаименованиеСтруктурногоПодразделения"  , ДанныеПечатиОбщиеДокумента.НаименованиеСтруктурногоПодразделения);
		ПараметрыШапки.Вставить("СтруктурноеПодразделение"               , ДанныеПечатиОбщиеДокумента.СтруктурноеПодразделение);
		ПараметрыШапки.Вставить("Учредитель"                             , ДанныеПечатиОбщиеДокумента.Учредитель);
		ПараметрыШапки.Вставить("ГлаваБК"                                , ДанныеПечатиОбщиеДокумента.ГлаваБК);
		ПараметрыШапки.Вставить("БюджетНаименование"                     , ДанныеПечатиОбщиеДокумента.БюджетНаименование);
		ПараметрыШапки.Вставить("ОКТМО"                                  , ДанныеПечатиОбщиеДокумента.ОКТМО);
		ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
		
		СведенияИсполнителя = Новый Структура;
		СведенияИсполнителя.Вставить("ДолжностьНаименование", ДанныеПечатиОбщиеДокумента.ОтветственныйДолжность);
		СведенияИсполнителя.Вставить("ФИО", ДанныеПечатиОбщиеДокумента.ОтветственныйФИО);
		СведенияИсполнителя.Вставить("НомерТелефона", ДанныеПечатиОбщиеДокумента.ОтветственныйТелефон);
		СведенияИсполнителя.Вставить("ЭлектроннаяПочта", ДанныеПечатиОбщиеДокумента.ОтветственныйЭлПочта);
		ОбластьШапка.Параметры.Заполнить(СведенияИсполнителя);

		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// Раздел 1
		ТабличныйДокумент.Вывести(ОбластьР1Шапка);
		
		Для Каждого ВыборкаОбъектов Из ВыборкаДокументов.СведенияОбОбъектах Цикл
			ОбластьР1Строка.Параметры.Заполнить(ВыборкаОбъектов);
			ТабличныйДокумент.Вывести(ОбластьР1Строка);
		КонецЦикла;
		
		// Раздел 2
		ТабличныйДокумент.Вывести(ОбластьР2Заголовок);
		ТабличныйДокумент.Вывести(ОбластьР2Шапка);
		
		ПараметрыГолосования = Новый Структура("ИтогГолосования,РезолюцияИтог");
		
		Для Каждого ВыборкаОбъектов Из ВыборкаДокументов.СведенияОбОбъектах Цикл
			
			// Результаты голосования комиссии по строке документа.
			ОтборПоИдентификаторуСтроки = Новый Структура("Документ, ИдентификаторСтроки",
				ВыборкаДокументов.Ссылка, ВыборкаОбъектов.ИдентификаторСтроки);
			РезультатыГолосованияПоСтроке = РезультатыГолосования.НайтиСтроки(ОтборПоИдентификаторуСтроки);
			Если РезультатыГолосованияПоСтроке.Количество() > 0
				И РезультатыГолосованияПоСтроке[0].ГолосованиеПоСтрокеЗавершено Тогда
				ПараметрыГолосования.ИтогГолосования = РезультатыГолосованияПоСтроке[0].ИтогГолосования;
				ПараметрыГолосования.РезолюцияИтог = ?(РезультатыГолосованияПоСтроке[0].РезолюцияКомиссииОдобрена,
					"", НСтр("ru = 'снято с обсуждения'"));
			Иначе // Результаты голосования по строке документа не найдены.
				ПараметрыГолосования.ИтогГолосования = "";
				ПараметрыГолосования.РезолюцияИтог = "";
			КонецЕсли;
			
			ОбластьР2Строка.Параметры.Заполнить(ВыборкаОбъектов);
			ОбластьР2Строка.Параметры.Заполнить(ПараметрыГолосования);
			
			ТабличныйДокумент.Вывести(ОбластьР2Строка);
			
		КонецЦикла;
		
		// Приложения

		ВывестиСекциюПриложенияИзТаблицыЗначений(
			ВыборкаДокументов.Приложения, ТабличныйДокумент, ОбластьПриложение, ОбластьПустаяСтрока, 1);		
		
		// Комиссия
		
		ВывестиСекциюКомиссия(
			ВыборкаДокументов.Ссылка, ВыборкаДокументов.СоставКомиссии, ТабличныйДокумент, ОбластьКомиссияП, ОбластьКомиссияС);
		
		// Исполнитель
		СведенияИсполнителя = Новый Структура;
		СведенияИсполнителя.Вставить("ДолжностьНаименование", ДанныеПечатиОбщиеДокумента.ОтветственныйДолжность);
		СведенияИсполнителя.Вставить("ФИО", КорреспондентыКлиентСервер.ФИО(ДанныеПечатиОбщиеДокумента.ОтветственныйФИО, Истина));
		СведенияИсполнителя.Вставить("НомерТелефона", ДанныеПечатиОбщиеДокумента.ОтветственныйТелефон);
		СведенияИсполнителя.Вставить("ЭлектроннаяПочта", ДанныеПечатиОбщиеДокумента.ОтветственныйЭлПочта);
		ОбластьИсполнитель.Параметры.Заполнить(СведенияИсполнителя);
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);
		
		// Подвал
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Напечатать0510456(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_АктСписания0510456";
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Акт0510456");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьР1Шапка		= Макет.ПолучитьОбласть("Раздел1_Шапка");
	ОбластьР1Строка		= Макет.ПолучитьОбласть("Раздел1_Строка");
	ОбластьР2Шапка		= Макет.ПолучитьОбласть("Раздел2_Шапка");
	ОбластьР2Строка		= Макет.ПолучитьОбласть("Раздел2_Строка");
	ОбластьР2_ДатаСнятия = Макет.ПолучитьОбласть("Раздел2_ДатаСнятия");
	ОбластьР3Шапка		= Макет.ПолучитьОбласть("Раздел3_Шапка");
	ОбластьР3Строка		= Макет.ПолучитьОбласть("Раздел3_Строка");
	ОбластьР3Заголовок	= Макет.ПолучитьОбласть("Раздел3_Заголовок");
	ОбластьПустаяСтрока	= Макет.ПолучитьОбласть("Приложение_ПустаяСтрока");
	ОбластьПриложение	= Макет.ПолучитьОбласть("Приложение");
	ОбластьКомиссияП	= Макет.ПолучитьОбласть("Комиссия_Председатель");
	ОбластьКомиссияС	= Макет.ПолучитьОбласть("Комиссия_Строка");
	ОбластьИсполнитель	= Макет.ПолучитьОбласть("Исполнитель");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	ДанныеДокументов	= ДанныеДляПечати0510456(МассивОбъектов);
	ВыборкаДокументов	= ДанныеДокументов[4].Выбрать();
	ВыборкаФайлы		= ДанныеДокументов[6].Выбрать();
	СоставКомиссий		= ДанныеДокументов[5].Выгрузить();
	
	РезультатыГолосования = ОбщегоНазначенияБГУ.РезультатыГолосованияКомиссийПоДокументам(МассивОбъектов);
	
	ПредставленияВидаИмущества = Новый Соответствие;
	ПредставленияВидаИмущества.Вставить(Перечисления.ВидыИмущества.НедвижимоеИмущество	, Новый Структура("Вид,Группа", "недвижимость"			, "10"));
	ПредставленияВидаИмущества.Вставить(Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное	, Новый Структура("Вид,Группа", "особо ценное движимое"	, "20"));
	ПредставленияВидаИмущества.Вставить(Перечисления.ВидыИмущества.ИноеДвижимое			, Новый Структура("Вид,Группа", "иное движимое"			, "30"));
	ПредставленияВидаИмущества.Вставить(Перечисления.ВидыИмущества.Казна				, Новый Структура("Вид,Группа", "казна"					, "50"));
	
	ДанныеПечатиОбщие = ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		
		ПараметрыШапки = Новый Структура;
		
		НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер);
		ПараметрыШапки.Вставить("НомерАкта", НомерАкта);
		
		Если ЗначениеЗаполнено(ВыборкаДокументов.Сотрудник) Тогда
			Сотрудник = Новый Структура("СсылкаНаОбъект,Период,Фамилия,Имя,Отчество",
				ВыборкаДокументов.Сотрудник, ВыборкаДокументов.ДатаАкта);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(Сотрудник);
			ПараметрыШапки.Вставить("ЦМО", КорреспондентыКлиентСервер.ФИО(Сотрудник,,,Ложь, Истина));
		КонецЕсли;
		
		пВидИмущества = ПредставленияВидаИмущества[Перечисления.ВидыИмущества.ПоСчету(ВыборкаДокументов.СчетУчета)];
		Если пВидИмущества <> Неопределено Тогда
			ПараметрыШапки.Вставить("ВидИмущества", пВидИмущества.Вид);
			ПараметрыШапки.Вставить("АналитическаяГруппа", пВидИмущества.Группа);
		КонецЕсли;
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаДокументов);

		ДанныеПечатиОбщиеДокумента = ДанныеПечатиОбщие.Получить(ВыборкаДокументов.Ссылка);

		ПараметрыШапки.Вставить("НаименованиеОрганизации"                , ДанныеПечатиОбщиеДокумента.НаименованиеОрганизации);
		ПараметрыШапки.Вставить("Организация"                            , ДанныеПечатиОбщиеДокумента.Организация);
		ПараметрыШапки.Вставить("КодРПБС"                                , ДанныеПечатиОбщиеДокумента.КодРПБС);
		ПараметрыШапки.Вставить("НаименованиеОбособленногоПодразделения" , ДанныеПечатиОбщиеДокумента.НаименованиеОбособленногоПодразделения);
		ПараметрыШапки.Вставить("ОбособленноеПодразделение"              , ДанныеПечатиОбщиеДокумента.ОбособленноеПодразделение);
		ПараметрыШапки.Вставить("КодРПБСПодр"                            , ДанныеПечатиОбщиеДокумента.КодРПБСОбособленногоПодразделения);
		//ПараметрыШапки.Вставить("НаименованиеСтруктурногоПодразделения"  , ДанныеПечатиОбщиеДокумента.СтруктурноеПодразделение);
		//ПараметрыШапки.Вставить("СтруктурноеПодразделение"               , ДанныеПечатиОбщиеДокумента.СтруктурноеПодразделение);
		ПараметрыШапки.Вставить("Учредитель"                             , ДанныеПечатиОбщиеДокумента.Учредитель);
		ПараметрыШапки.Вставить("ГлаваБК"                                , ДанныеПечатиОбщиеДокумента.ГлаваБК);
		ПараметрыШапки.Вставить("БюджетНаименование"                     , ДанныеПечатиОбщиеДокумента.БюджетНаименование);
		ПараметрыШапки.Вставить("ОКТМО"                                  , ДанныеПечатиОбщиеДокумента.ОКТМО);
		ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
		
		Если ВыборкаДокументов.Владелец().Колонки.Найти("Руководитель") <> Неопределено 
			И ЗначениеЗаполнено(ВыборкаДокументов["Руководитель"]) Тогда
			РуководительСсылка = ВыборкаДокументов["Руководитель"];
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", 
				РуководительСсылка, ВыборкаДокументов.ДатаАкта);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина, Истина);
			ОбластьШапка.Параметры.ДолжностьРуководителя = ДанныеСотрудника.Должность;
			ОбластьШапка.Параметры.ФИОРуководителя       = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		КонецЕсли;	

		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// Раздел 1
		
		ТабличныйДокумент.Вывести(ОбластьР1Шапка);
		
		ОбластьР1Строка.Параметры.Заполнить(ВыборкаДокументов);
		ТабличныйДокумент.Вывести(ОбластьР1Строка);
		
		// Раздел 2
		
		ТабличныйДокумент.Вывести(ОбластьР2Шапка);
		
		ОбластьР2Строка.Параметры.Заполнить(ВыборкаДокументов);
		ТабличныйДокумент.Вывести(ОбластьР2Строка);
		
		ОбластьР2_ДатаСнятия.Параметры.Заполнить(ВыборкаДокументов);
		ТабличныйДокумент.Вывести(ОбластьР2_ДатаСнятия);
		
		// Раздел 3
		
		ТабличныйДокумент.Вывести(ОбластьР3Заголовок);
		ТабличныйДокумент.Вывести(ОбластьР3Шапка);
		
		ПараметрыГолосования = Новый Структура("ИтогГолосования,РезолюцияИтог");
		
		// Результаты голосования комиссии по строке документа.
		Отбор = Новый Структура("Документ", ВыборкаДокументов.Ссылка);
		РезультатыГолосованияПоДокументу = РезультатыГолосования.НайтиСтроки(Отбор);
		Если РезультатыГолосованияПоДокументу.Количество() > 0
			И РезультатыГолосованияПоДокументу[0].ГолосованиеПоСтрокеЗавершено Тогда
			ПараметрыГолосования.ИтогГолосования = РезультатыГолосованияПоДокументу[0].ИтогГолосования;
			ПараметрыГолосования.РезолюцияИтог = ?(РезультатыГолосованияПоДокументу[0].РезолюцияКомиссииОдобрена,
				"", НСтр("ru = 'снято с обсуждения'"));
		Иначе // Результаты голосования по строке документа не найдены.
			ПараметрыГолосования.ИтогГолосования = 0;
			ПараметрыГолосования.РезолюцияИтог = "";
		КонецЕсли;
		
		ОбластьР3Строка.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьР3Строка.Параметры.Заполнить(ПараметрыГолосования);
		
		ТабличныйДокумент.Вывести(ОбластьР3Строка);
		
		// Приложения
		
		ВывестиСекциюПриложения(
			ВыборкаФайлы, СтруктураПоиска, ТабличныйДокумент, ОбластьПриложение, ОбластьПустаяСтрока, 1);		
		
		// Комиссия
		
		ВывестиСекциюКомиссия(
			ВыборкаДокументов.Ссылка, СоставКомиссий, ТабличныйДокумент, ОбластьКомиссияП, ОбластьКомиссияС);
		
		// Исполнитель
		
		СведенияИсполнителя = Новый Структура;
		СведенияИсполнителя.Вставить("ДолжностьНаименование", ДанныеПечатиОбщиеДокумента.ОтветственныйДолжность);
		СведенияИсполнителя.Вставить("ФИО", ДанныеПечатиОбщиеДокумента.ОтветственныйФИО);
		СведенияИсполнителя.Вставить("НомерТелефона", ДанныеПечатиОбщиеДокумента.ОтветственныйТелефон);
		СведенияИсполнителя.Вставить("ЭлектроннаяПочта", ДанныеПечатиОбщиеДокумента.ОтветственныйЭлПочта);
		ОбластьИсполнитель.Параметры.Заполнить(СведенияИсполнителя);
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);
		
		// Подвал
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПредставлениеСчета(ДанныеСчета, Префикс = "", Переносить = Ложь, ДополнитьДо26Знаков = Ложь) Экспорт
	
	Возврат ПредставлениеРабочегоСчета(ДанныеСчета["КПС" + Префикс], ДанныеСчета.КФО,
		ДанныеСчета["Счет" + Префикс], ДанныеСчета["КЭК" + Префикс], Переносить, ДополнитьДо26Знаков);	
	
КонецФункции

// Формирует представление рабочего счета по переданным представлениям составляющих его показателей.
//
Функция ПредставлениеРабочегоСчета(ПредставлениеКПС, ПредставлениеКФО, ПредставлениеСчета, ПредставлениеКЭК, Переносить = Ложь, ДополнитьДо26Знаков = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ПредставлениеСчета) Тогда
		Возврат "";
	КонецЕсли;
	
	ЧастиСчета = Новый Массив;
	
	Если ЗначениеЗаполнено(ПредставлениеКПС) Тогда
		ЧастиСчета.Добавить(ПредставлениеКПС);
	ИначеЕсли ДополнитьДо26Знаков Тогда
		ЧастиСчета.Добавить("00000000000000000");
	КонецЕсли;
	
	ВставитьПеренос = (Переносить И ЧастиСчета.Количество() > 0);
	
	Если ЗначениеЗаполнено(ПредставлениеКФО) Тогда
		ЧастиСчета.Добавить(ПредставлениеКФО);
	ИначеЕсли ДополнитьДо26Знаков Тогда
		ЧастиСчета.Добавить("0");
	КонецЕсли;
	
	Если ТипЗнч(ПредставлениеСчета) = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
		ЧастиСчета.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредставлениеСчета, "Код"));
	Иначе	
		ЧастиСчета.Добавить(ПредставлениеСчета);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ПредставлениеКЭК) Тогда
		ЧастиСчета.Добавить(ПредставлениеКЭК);
	ИначеЕсли ДополнитьДо26Знаков Тогда
		ЧастиСчета.Добавить("000");
	КонецЕсли;
	
	Если ВставитьПеренос И ЧастиСчета.Количество() > 1 Тогда
		ЧастиСчета[1] = Символы.ПС + ЧастиСчета[1];
	КонецЕсли;
	
	Результат = СтрСоединить(ЧастиСчета, ".");
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеВидаИмущества(Источник) Экспорт
	
	Если Источник = Перечисления.ВидыИмущества.НедвижимоеИмущество Тогда
		пВидИмущества = НСтр("ru = 'недвижимое'");
	ИначеЕсли Источник = Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное Тогда
		пВидИмущества = НСтр("ru = 'особо ценное движимое'");
	ИначеЕсли Источник = Перечисления.ВидыИмущества.ИноеДвижимое Тогда
		пВидИмущества = НСтр("ru = 'иное движимое'");
	ИначеЕсли Источник = Перечисления.ВидыИмущества.Казна Тогда
		пВидИмущества = НСтр("ru = 'казна'");
	ИначеЕсли Источник = Перечисления.ВидыИмущества.ПраваПользованияНМА Тогда
		пВидИмущества = НСтр("ru = 'права пользования нематериальными активами'");
	ИначеЕсли Источник = Перечисления.ВидыИмущества.ВКонцессии Тогда
		пВидИмущества = НСтр("ru = 'концессия'");
	Иначе
		пВидИмущества = "";
	КонецЕсли;
	
	Возврат пВидИмущества;
	
КонецФункции

Функция ПечатьОрганизации(Организация) Экспорт
	
	ЧтениеОрганизацииРазрешено = ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Ссылка", Истина));
	Если Не ЧтениеОрганизацииРазрешено Тогда
		Возврат Новый Картинка;
	КонецЕсли;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Печать = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ПечатьОрганизации");
	
	Возврат КартинкаИзФайла(Печать);
		
КонецФункции

Функция ПодписьСотрудника(Сотрудник) Экспорт
	
	ЧтениеРазрешено = ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "Ссылка", Истина));
	Если Не ЧтениеРазрешено Тогда
		Возврат Новый Картинка;
	КонецЕсли;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Подпись = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "Подпись");
	
	Возврат КартинкаИзФайла(Подпись);
		
КонецФункции

// Возвращает сведения сотрудника организации для использования в печатных формах.
// Для успешного поиска необходимо, чтобы в справочнике "Пользователи" было заполнено физ. лицо.
// Если параметр "ПолучатьКИдляПечати" = Истина, то будет получена контактная информация "ТелефонРабочийФизическиеЛица" и "EmailФизическиеЛица",
// возвращаемые в ключах структуры "НомерТелефона" и "ЭлектроннаяПочта" соответственно.  
// 
// Параметры:
// 	Ответственный - СправочникСсылка.Пользователи - "ответственный" из документа.
// 	Организация - СправочникСсылка.Организации - организация для поиска сотрудника по физическому лицу, указанному в справочнике "Пользователи".
// 	Дата - Дата - Дата получения периодических данных.
// 	ПолучатьКИдляПечати - Булево - признак необходимости получать контактную информацию
// Возвращаемое значение:
//  см. ПустаяСтруктураСведенийИсполнителя
Функция СведенияИсполнителяПоОтветственному(Ответственный, Организация, Дата, ПолучатьКИдляПечати = Ложь, ИОПередФамилией = Истина) Экспорт
	
	Результат = ПустаяСтруктураСведенийИсполнителя();
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Исполнитель = ЗаполнениеРеквизитовОбъектов.ПолучитьОтветственногоИсполнителя(Ответственный, Организация);
	
	Если Не ЗначениеЗаполнено(Исполнитель) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Возврат СведенияИсполнителя(Исполнитель, Дата, ПолучатьКИдляПечати, ИОПередФамилией);
КонецФункции

// Возвращает сведения сотрудника организации для использования в печатных формах.
// Если параметр "ПолучатьКИдляПечати" = Истина, то будет получена контактная информация "ТелефонРабочийФизическиеЛица" и "EmailФизическиеЛица",
// возвращаемые в ключах структуры "НомерТелефона" и "ЭлектроннаяПочта" соответственно.  
// 
// Параметры:
// 	Исполнитель - СправочникСсылка.Сотрудники - сотрудник.
// 	Дата - Дата - Дата получения периодических данных.
// 	ПолучатьКИдляПечати - Булево - признак необходимости получать контактную информацию
// 	ИОПередФамилией - Булево - если ИСТИНА имя и отчетство будут стоять перед фамилией, иначе - после.
// 	
// Возвращаемое значение:
//  см. ПустаяСтруктураСведенийИсполнителя
Функция СведенияИсполнителя(Исполнитель, Дата, ПолучатьКИдляПечати = Ложь, ИОПередФамилией = Истина) Экспорт
	
	Результат = ПустаяСтруктураСведенийИсполнителя();
	
	Если Не ЗначениеЗаполнено(Исполнитель) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДанныеСотрудника = Новый Структура(
	"СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность, ДолжностьНаименование, Подразделение, НаименованиеСтруктурногоПодразделения",
	Исполнитель, Дата);
	Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, , ПолучатьКИдляПечати);
	
	ФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, ИОПередФамилией);
	
	Результат["Исполнитель"]           = Исполнитель;
	Результат["ФИО"]                   = ФИО;
	Результат["Должность"]             = ДанныеСотрудника.Должность;
	Результат["ДолжностьНаименование"] = ДанныеСотрудника.ДолжностьНаименование;
	
	Результат["Подразделение"] = ДанныеСотрудника.Подразделение;
	Результат["НаименованиеСтруктурногоПодразделения"] = ДанныеСотрудника.НаименованиеСтруктурногоПодразделения;
	
	Если ПолучатьКИдляПечати Тогда
		Результат["НомерТелефона"]    = ДанныеСотрудника.ТелефонРабочийФизическиеЛица;
		Результат["ЭлектроннаяПочта"] = ДанныеСотрудника.EmailФизическиеЛица;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Пустая структура сведений исполнителя
// 
// Возвращаемое значение:
//  Структура:
// * Исполнитель - СправочникСсылка.Сотрудники -
// * ФИО - Строка -
// * Должность - СправочникСсылка.Должности -
// * ДолжностьНаименование - Строка -
// * Подразделение - СправочникСсылка.Подразделения -
// * НаименованиеСтруктурногоПодразделения - Строка -
// * НомерТелефона - Строка -
// * ЭлектроннаяПочта - Строка -
Функция ПустаяСтруктураСведенийИсполнителя() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Исполнитель"				, Справочники.Сотрудники.ПустаяСсылка());
	Результат.Вставить("ФИО"						, "");
	Результат.Вставить("Должность"					, Справочники.Должности.ПустаяСсылка());
	Результат.Вставить("ДолжностьНаименование"		, "");
	Результат.Вставить("Подразделение"				, Справочники.Подразделения.ПустаяСсылка());
	Результат.Вставить("НаименованиеСтруктурногоПодразделения", "");
	Результат.Вставить("НомерТелефона"			, "");
	Результат.Вставить("ЭлектроннаяПочта"		, "");
	Возврат Результат;

КонецФункции

// Напечатать акт о списании БСО0510461.
// 
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
// 
// Возвращаемое значение:
//  ТабличныйДокумент
Функция НапечататьАктОСписанииБСО0510461(МассивОбъектов, ОбъектыПечати) Экспорт
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_АктОСписанииБСО0510461";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_АктОСписанииБСО0510461_157н");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьЗаголовокКомиссия = Макет.ПолучитьОбласть("ЗаголовокКомиссия");
	ОбластьЧленКомиссии = Макет.ПолучитьОбласть("ЧленКомиссии");
	ОбластьПриложение = Макет.ПолучитьОбласть("Приложение");

	ДанныеДляПечати = ДанныеДляПечатиАктаОСписанииБСО0510461(МассивОбъектов);
	ПустаяДатаПодписи = """______""________________________20______г.";
	ФорматДатыПодписи = "ДФ='''""''дд''""'' ММММ гггг ''г.'''";
	ПараметрыИтого = Новый Структура("Сумма, Количество", 0, 0);
	ПараметрыНомерПриложения = Новый Структура("Номер", 0);

	ПервыйДокумент = Истина;
	Для Каждого СтрокаШапки Из ДанныеДляПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		ПараметрыЗаголовка = Новый Структура;
		ПараметрыЗаголовка.Вставить("УполномоченноеЛицоДатаПодписи", ПустаяДатаПодписи);
		ПараметрыЗаголовка.Вставить("ОтветственныйДатаПодписи", ПустаяДатаПодписи);
		Если ЗначениеЗаполнено(СтрокаШапки.УполномоченноеЛицоДатаПодписи) Тогда
			ПараметрыЗаголовка.УполномоченноеЛицоДатаПодписи = Формат(СтрокаШапки.УполномоченноеЛицоДатаПодписи, ФорматДатыПодписи);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаШапки.ОтветственныйДатаПодписи) Тогда
			ПараметрыЗаголовка.ОтветственныйДатаПодписи = Формат(СтрокаШапки.ОтветственныйДатаПодписи, ФорматДатыПодписи);
		КонецЕсли;

		ПараметрыНеобходимостьУничтожения = Новый Структура("НеобходимостьУничтожения, НеобходимостьУничтоженияКод", "нет", "2");
		Если СтрокаШапки.НеобходимостьУничтожения Тогда
			ПараметрыНеобходимостьУничтожения.НеобходимостьУничтожения = "да";
			ПараметрыНеобходимостьУничтожения.НеобходимостьУничтоженияКод = "1";
		КонецЕсли;
		ОбластьЗаголовок.Параметры.Заполнить(СтрокаШапки);
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыЗаголовка);
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыНеобходимостьУничтожения);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ПараметрыИтого.Количество = 0;
		ПараметрыИтого.Сумма = 0;
		Для Каждого СтрокаБСО Из СтрокаШапки.СписываемыеБСО Цикл
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаБСО);
			
			РезультатыГолосования = Новый Структура("РезолюцияИтог,ИтогГолосования", "", "");
			Если СтрокаБСО.ГолосованиеПоСтрокеЗавершено Тогда // Результаты голосования выводим, только если голосование по строке завершено.
				РезультатыГолосования.ИтогГолосования = СтрокаБСО.ИтогГолосования;
				Если Не СтрокаБСО.РезолюцияКомиссииОдобрена Тогда
					РезультатыГолосования.РезолюцияИтог = НСтр("ru = 'отказать'");
				КонецЕсли;
			КонецЕсли;
			ОбластьСтрока.Параметры.Заполнить(РезультатыГолосования);
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ПараметрыИтого.Количество = ПараметрыИтого.Количество + СтрокаБСО.Количество;
			ПараметрыИтого.Сумма = ПараметрыИтого.Сумма + СтрокаБСО.Сумма;
			
		КонецЦикла;
		ОбластьИтого.Параметры.Заполнить(ПараметрыИтого);
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		ПараметрыНомерПриложения.Номер = 0;
		Для Каждого Приложение Из СтрокаШапки.Файлы Цикл
			ПараметрыНомерПриложения.Номер = ПараметрыНомерПриложения.Номер + 1;
			ОбластьПриложение.Параметры.Заполнить(ПараметрыНомерПриложения);
			ОбластьПриложение.Параметры.Заполнить(Приложение);
			ТабличныйДокумент.Вывести(ОбластьПриложение);
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовокКомиссия);
		
		ПерваяСтрокаКомиссии = Истина;
		Для Каждого СтрокаКомиссии Из СтрокаШапки.СоставКомиссии Цикл
			ПараметрПредставление = Новый Структура("ПредставлениеЧленаКомиссии", "");
			Если СтрокаКомиссии.Председатель Тогда
				ПараметрПредставление.ПредставлениеЧленаКомиссии = "Председатель комиссии";
			ИначеЕсли ПерваяСтрокаКомиссии Тогда
				ПараметрПредставление.ПредставлениеЧленаКомиссии = "Члены комиссии";
				ПерваяСтрокаКомиссии = Ложь;
			КонецЕсли;
			ОбластьЧленКомиссии.Параметры.Заполнить(ПараметрПредставление);
			ОбластьЧленКомиссии.Параметры.Заполнить(СтрокаКомиссии);
			ТабличныйДокумент.Вывести(ОбластьЧленКомиссии);	
		КонецЦикла;
		
		ДанныеОтветственного = Новый Структура;
		ДанныеОтветственного.Вставить("ДолжностьНаименование", СтрокаШапки.ОтветственныйДолжность);
		ДанныеОтветственного.Вставить("ФИО", СтрокаШапки.ОтветственныйФИО);
		ДанныеОтветственного.Вставить("НомерТелефона", СтрокаШапки.ОтветственныйТелефон);
		ДанныеОтветственного.Вставить("ЭлектроннаяПочта", СтрокаШапки.ОтветственныйЭлПочта);
		
		ОбластьПодвал.Параметры.Заполнить(ДанныеОтветственного);
		ОбластьПодвал.Параметры.Заполнить(ПараметрыЗаголовка);
		ТабличныйДокумент.Вывести(ОбластьПодвал);

		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, СтрокаШапки.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Напечатать решение об оценке НФА 0510442.
// 
// Параметры:
//  ДанныеДляПечати - см. ТаблицаШапкиДляПечатиРешенияОбОценкеИмущества0510442
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
// 
// Возвращаемое значение:
//  ТабличныйДокумент
Функция НапечататьРешениеОбОценкеНФА0510442(ДанныеДляПечати, ОбъектыПечати) Экспорт
	
	МассивОбъектов = ДанныеДляПечати.ВыгрузитьКолонку("Ссылка");
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПроверитьДостижениеКворумаПрисутствияПриПечати(МассивОбъектов);
	// Конец ИндикаторКворумаПрисутствия
	
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Решение0510442";
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_РешениеОбОценкеСтоимостиИмущества0510442");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьР1Шапка		= Макет.ПолучитьОбласть("Раздел1_Шапка");
	ОбластьР1Строка		= Макет.ПолучитьОбласть("Раздел1_Строка");
	ОбластьПустаяСтрока	= Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПриложение	= Макет.ПолучитьОбласть("Приложение");
	ОбластьКомиссияЗаголовок = Макет.ПолучитьОбласть("Комиссия_Заголовок");
	ОбластьКомиссияС	= Макет.ПолучитьОбласть("Комиссия_Строка");
	ОбластьИсполнитель	= Макет.ПолучитьОбласть("Исполнитель");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	ПервыйДокумент = Истина;
	Для Каждого ВыборкаДокументов Из ДанныеДляПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Шапка
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаДокументов);
		
		ПараметрыШапки	= Новый Структура;
		ПараметрыШапки.Вставить("ДолжностьРуководителя", ВыборкаДокументов.УполномоченноеЛицоДолжность);
		ПараметрыШапки.Вставить("ФИОРуководителя", ВыборкаДокументов.УполномоченноеЛицоФИО);
		ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);

		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// Раздел 1
		
		ТабличныйДокумент.Вывести(ОбластьР1Шапка);
		
		Для Каждого СтрокаСостава Из ВыборкаДокументов.СоставДокумента Цикл
			
			ОбластьР1Строка.Параметры.Заполнить(СтрокаСостава);
			ТабличныйДокумент.Вывести(ОбластьР1Строка);
			
		КонецЦикла;
		
		// Приложения
		
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		ВывестиФайлыВПечатнуюФормуПриказа61н(ВыборкаДокументов.Файлы, ТабличныйДокумент, ОбластьПриложение);
		
		// Комиссия
		
		ТабличныйДокумент.Вывести(ОбластьКомиссияЗаголовок);
		ВывестиКомиссиюВПечатнуюФормуПриказа61н(ВыборкаДокументов.СоставКомиссии, ТабличныйДокумент, ОбластьКомиссияС);
		
		// Подвал
		
		СведенияИсполнителя = Новый Структура;
		СведенияИсполнителя.Вставить("ДолжностьНаименование", ВыборкаДокументов.ОтветственныйДолжность);
		//СведенияИсполнителя.Вставить("Должность", );
		СведенияИсполнителя.Вставить("ФИО", ВыборкаДокументов.ОтветственныйФИО);
		//СведенияИсполнителя.Вставить("Исполнитель", );
		СведенияИсполнителя.Вставить("НомерТелефона", ВыборкаДокументов.ОтветственныйТелефон);
		СведенияИсполнителя.Вставить("ЭлектроннаяПочта", ВыборкаДокументов.ОтветственныйЭлПочта);
		ОбластьИсполнитель.Параметры.Заполнить(СведенияИсполнителя);
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
	
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
	
КонецФункции

// Напечатать акт списания литературы (ф. 0504144).
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ИмяМакета - Строка -  Имя макета
// 
// Возвращаемое значение:
//  ТабличныйДокумент -  Напечатать акт списания литературы ф. 0504144
Функция НапечататьАктСписанияЛитературы0504144(МассивОбъектов, ОбъектыПечати, ИмяМакета = "ПФ_MXL_АктСписанияЛитературы_0504144") Экспорт
	
	ДанныеДляПечати = ТаблицаШапкиДляПечатиАктаСписанияЛитературы0504144();
	Для Каждого Документ Из ОбщегоНазначенияБГУ.ДокументыПоТипам(МассивОбъектов) Цикл
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ.Значение[0]);
		МенеджерДокумента.ДобавитьДанныеДляПечатиАктаСписанияЛитературы0504144(ДанныеДляПечати, Документ.Значение);
	КонецЦикла;
	
	Макет			= УправлениеПечатью.МакетПечатнойФормы("Документ.СписаниеЛитературы." + ИмяМакета);
	Стр_1			= Макет.ПолучитьОбласть("Стр_1");
	Стр_1_2			= Макет.ПолучитьОбласть("Стр_1_2");
	Заголовок		= Макет.ПолучитьОбласть("Заголовок");
	Шапка			= Макет.ПолучитьОбласть("Шапка");
	Строка_1		= Макет.ПолучитьОбласть("Строка_1");
	Строка_2		= Макет.ПолучитьОбласть("Строка_2");
	Строка_Итого	= Макет.ПолучитьОбласть("Строка_Итого");
	Комиссия		= Макет.ПолучитьОбласть("Комиссия");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеЛитературы";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ВыборкаШапка Из ДанныеДляПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Руководитель = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(ВыборкаШапка.Организация,
			Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ВыборкаШапка.Дата);
		РуководительФИО = Справочники.Сотрудники.ФамилияИО(Руководитель.ОтветственноеЛицоСсылка, Истина, ВыборкаШапка.Дата);
		
		ОбластьКомиссия = УправлениеОсновнымиСредствами.СформироватьОбластьКомиссия(ВыборкаШапка, ВыборкаШапка.Комиссия, Комиссия, 3);
		
		ЧленыКомиссии = Новый Массив;
		Если ЗначениеЗаполнено(ВыборкаШапка.ФамилияПредседателяКомиссии) Тогда
			ЧастиФИО = Новый Структура("Фамилия, Имя, Отчество", ВыборкаШапка.ФамилияПредседателяКомиссии,
				ВыборкаШапка.ИмяПредседателяКомиссии, ВыборкаШапка.ОтчествоПредседателяКомиссии);
			ФИО = КорреспондентыКлиентСервер.ФИО(ЧастиФИО);
			Разделитель = ?(ЗначениеЗаполнено(ВыборкаШапка.ДолжностьПредседателяКомиссии) И ЗначениеЗаполнено(ФИО), " ", "");
			ЧленыКомиссии.Добавить(ВыборкаШапка.ДолжностьПредседателяКомиссии + Разделитель + ФИО);
		КонецЕсли;
		Для Каждого ВыборкаКомиссияТекДок Из ВыборкаШапка.Комиссия Цикл
			ЧастиФИО = Новый Структура("Фамилия, Имя, Отчество", ВыборкаКомиссияТекДок.ФамилияЧленаКомиссии,
				ВыборкаКомиссияТекДок.ИмяЧленаКомиссии, ВыборкаКомиссияТекДок.ОтчествоЧленаКомиссии);
			ФИО = КорреспондентыКлиентСервер.ФИО(ЧастиФИО);
			Разделитель = ?(ЗначениеЗаполнено(ВыборкаКомиссияТекДок.ДолжностьЧленаКомиссии) И ЗначениеЗаполнено(ФИО), " ", "");
			ЧленыКомиссии.Добавить(ВыборкаКомиссияТекДок.ДолжностьЧленаКомиссии + Разделитель + ФИО);
		КонецЦикла;
		
		Стр_1.Параметры.Заполнить(ВыборкаШапка);
		СтуктураСтр_1 = Новый Структура;
		СтуктураСтр_1.Вставить("ОргДиректор", РуководительФИО);
		СтуктураСтр_1.Вставить("ДатаПрописью", "от "+Формат(ВыборкаШапка.Дата,"ДЛФ=ДД"));
		СтуктураСтр_1.Вставить("СоставКомиссии", СтрСоединить(ЧленыКомиссии, ", "));
		Если ЗначениеЗаполнено(ВыборкаШапка.ДатаПриказа) Тогда
			СтуктураСтр_1.Вставить("ДатаПриказа", Формат(ВыборкаШапка.ДатаПриказа, "ДЛФ=ДД"));
		Иначе
			СтуктураСтр_1.Вставить("ДатаПриказа", """___"" _________ 20_____");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВыборкаШапка.НомерПриказа) Тогда
			СтуктураСтр_1.Вставить("НомерПриказа", "_________");
		КонецЕсли;
		
		НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаШапка.Ссылка, ВыборкаШапка.Номер);
		
		СтуктураСтр_1.Вставить("Номер", НомерДокумента);
		СтуктураСтр_1.Вставить("СчетДебета", ВыборкаШапка.СчетДебета);
		СтуктураСтр_1.Вставить("СчетКредита", ВыборкаШапка.СчетКредита);
		СтуктураСтр_1.Вставить("КоличествоИтого", ВыборкаШапка.КоличествоИтого);
		СтуктураСтр_1.Вставить("СуммаИтого", ВыборкаШапка.СуммаИтого);
		СтуктураСтр_1.Вставить("СуммаИтогоПрописью", ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(ВыборкаШапка.СуммаИтого, Константы.ВалютаРегламентированногоУчета));
		
		Стр_1.Параметры.Заполнить(СтуктураСтр_1);
		
		ТабличныйДокумент.Вывести(Стр_1);
		ТабличныйДокумент.Вывести(ОбластьКомиссия);
		ТабличныйДокумент.Вывести(Стр_1_2);
		ТабличныйДокумент.Вывести(ОбластьКомиссия);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		НомерСтраницы = 2;
		СтруктураЗаголовок = Новый Структура("пПриложение,ПричинаСписания,НомерСтраницы");
		СтруктураЗаголовок.пПриложение		= "Приложение к акту № " + НомерДокумента + "  от  " + Формат(ВыборкаШапка.Дата,"ДЛФ=ДД");
		СтруктураЗаголовок.ПричинаСписания	= ВыборкаШапка.ПричинаСписания;
		СтруктураЗаголовок.НомерСтраницы	= НомерСтраницы;
		Заголовок.Параметры.Заполнить(СтруктураЗаголовок);
		
		ТабличныйДокумент.Вывести(Заголовок);
		ТабличныйДокумент.Вывести(Шапка);
		НомерСтроки = Новый Структура("Ном", 0);
		
		СуммаИтог=0;
		КоличИтог=0;
		Для Каждого ВыборкаЛитература Из ВыборкаШапка.СписокЛитературы Цикл
			НомерСтроки.Ном = НомерСтроки.Ном + 1;
			Строка_1.Параметры.Заполнить(ВыборкаЛитература);
			Строка_1.Параметры.Заполнить(НомерСтроки);
			Массив = Новый Массив;
			Массив.Добавить(ОбластьКомиссия);
			Массив.Добавить(Строка_1);
			Если НЕ ТабличныйДокумент.ПроверитьВывод(Массив) Тогда
				ТабличныйДокумент.Вывести(ОбластьКомиссия);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				НомерСтраницы = НомерСтраницы+1;
				Заголовок.Параметры.Заполнить(Новый Структура("НомерСтраницы", НомерСтраницы));
		 		ТабличныйДокумент.Вывести(Заголовок);
				ТабличныйДокумент.Вывести(Шапка);
			КонецЕсли;
			ТабличныйДокумент.Вывести(Строка_1);
			СуммаИтог=СуммаИтог+ВыборкаЛитература.Сумма;
			КоличИтог=КоличИтог+ВыборкаЛитература.Количество;
		КонецЦикла; 
		Массив=Новый Массив;
		Массив.Добавить(ОбластьКомиссия);
		Массив.Добавить(Строка_2);
		Массив.Добавить(Строка_Итого);
		Пока ТабличныйДокумент.ПроверитьВывод(Массив) Цикл
			ТабличныйДокумент.Вывести(Строка_2);
		КонецЦикла;
		СтуктураСтрока_Итого = Новый Структура("СуммаИтог,КоличИтог",СуммаИтог,КоличИтог);
		Строка_Итого.Параметры.Заполнить(СтуктураСтрока_Итого);
		ТабличныйДокумент.Вывести(Строка_Итого);
		ТабличныйДокумент.Вывести(ОбластьКомиссия);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Выводит секцию "Приложения" печатной формы. 
//
// Параметры:
//	ДанныеПриложений - ВыборкаИзРезультатаЗапроса - выборка, содержащая данные для секции "Приложение"
//		Поля выборки:
//		ОсновноеСредство - СправочникСсылка.ОсновныеСредства
//		Файл - СправочникСсылка.<ВидОбъекта>ПрисоединенныеФайлы
//		ИмяФайла - Строка
//		Расширение - Строка - расширение файла
//		Описание - Строка
//	СтруктураПоиска - Структура - для поиска данных приложений в выборке "ДанныеПриложений"
//	ТабДок - ТабличныйДокумент
//	ОблПриложение - ТабличныйДокумент - область "Приложение" табличного документа 
//	ОблПриложениеП - ТабличныйДокумент - пустая область табличного документа, для отступа
//	КолСекций - Число - количество секций Приложение для формы, согласно норматичным документам
Процедура ВывестиСекциюПриложения(
	ДанныеПриложений, СтруктураПоиска, ТабДок, ОблПриложение, ОблПриложениеП, КолСекций = 2) Экспорт
	Сч = 0;
	ТабДок.Вывести(ОблПриложениеП);
	ДанныеПриложений.Сбросить();
	Пока ДанныеПриложений.НайтиСледующий(СтруктураПоиска) Цикл
		Сч = Сч + 1;
		ОблПриложение.Параметры.Заполнить(Новый Структура("Номер", Сч));
		ОблПриложение.Параметры.Заполнить(ДанныеПриложений);
		ОблПриложение.Параметры.ИмяФайлаРасширение = "" + ДанныеПриложений.ИмяФайла + "." + ДанныеПриложений.Расширение;
		ТабДок.Вывести(ОблПриложение);
	КонецЦикла;
	
	ПустаяСтруктура = Новый Структура("Номер, Описание, ИмяФайлаРасширение", "","","");
	Если Сч < 2 Тогда
		Для к = (Сч + 1) по КолСекций Цикл
			ОблПриложение.Параметры.Заполнить(ПустаяСтруктура);
			ТабДок.Вывести(ОблПриложение);
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

// Выводит секцию "Комиссия" печатной формы. 
//
// Параметры:
//	ДокументСсылка - ДокументСсылка - ссылка на документ, к которому относится комиссия
//	СоставКомиссий - ТаблицаЗначений - таблица, содержащая состав комисси
//	ТабличныйДокумент - ТабличныйДокумент
//	ОбластьП - ТабличныйДокумент - область для вывода председателя табличного документа 
//	ОбластьЧК - ТабличныйДокумент - область для вывода члена комиссии табличного документа
//	КолСекций - Число - количество секций "Член комиссии" для формы, согласно норматичным документам 
Процедура ВывестиСекциюКомиссия(
	ДокументСсылка, СоставКомиссий, ТабличныйДокумент, ОбластьП, ОбластьЧК, КолСекций = 3) Экспорт

	ПоляПредседателя = "Должность, НаименованиеДолжности, Сотрудник, ОсобыеОтметки, ФайлОсобогоМнения, ФИО";
	ПоляЧК = ПоляПредседателя + ", Заголовок";

	// Председатель
	Если СоставКомиссий.Колонки.Найти("Ссылка") = Неопределено Тогда
		ОтборПредседателя = Новый Структура("Председатель", Истина);
		ОтборЧлена        = Новый Структура("Председатель", Ложь);
	Иначе	
		ОтборПредседателя = Новый Структура("Ссылка, Председатель", ДокументСсылка, Истина);
		ОтборЧлена        = Новый Структура("Ссылка, Председатель", ДокументСсылка, Ложь);
	КонецЕсли;	
	
	ЕстьФамилия = (СоставКомиссий.Колонки.Найти("Фамилия") <> Неопределено);
	
	СтрокиПредседатель = СоставКомиссий.НайтиСтроки(ОтборПредседателя);
	ДанныеПредседателя = Новый Структура(ПоляПредседателя);
	Для Каждого Председатель Из СтрокиПредседатель Цикл
		ЗаполнитьЗначенияСвойств(ДанныеПредседателя, Председатель);
		Если ЕстьФамилия Тогда
			ДанныеПредседателя.ФИО = КорреспондентыКлиентСервер.ФИО(Председатель, Истина);
		КонецЕсли;	
		ОбластьП.Параметры.Заполнить(ДанныеПредседателя);
	КонецЦикла;
	ТабличныйДокумент.Вывести(ОбластьП);
	
	// Члены комиссии
	ЗаголовокЧленовКомиссии = НСтр("ru = 'Члены комиссии:'");
	СтрокиЧленыКомиссии = СоставКомиссий.НайтиСтроки(ОтборЧлена);
	ПерваяСтрока = Истина;
	ДанныеЧК = Новый Структура(ПоляЧК);
	КоличествоЧКВыведено = 0;
	Для Каждого ЧленКомиссии Из СтрокиЧленыКомиссии Цикл
		ЗаполнитьЗначенияСвойств(ДанныеЧК, ЧленКомиссии);
		Если ЕстьФамилия Тогда
			ДанныеЧК.ФИО = КорреспондентыКлиентСервер.ФИО(ЧленКомиссии, Истина);
		КонецЕсли;	
		ДанныеЧК.Заголовок = ?(ПерваяСтрока, ЗаголовокЧленовКомиссии, "");
		ОбластьЧК.Параметры.Заполнить(ДанныеЧК);
		ТабличныйДокумент.Вывести(ОбластьЧК);
		ПерваяСтрока = Ложь;
		КоличествоЧКВыведено = КоличествоЧКВыведено + 1;
	КонецЦикла;
	
	ПустаяСтруктура = Новый Структура("НаименованиеДолжности, ФИО, ОсобыеОтметки", "", "", "");
	Для к = (КоличествоЧКВыведено + 1) по КолСекций Цикл
		ОбластьЧК.Параметры.Заполнить(ПустаяСтруктура);
		ОбластьЧК.Параметры.Заголовок = ?(к = 1, ЗаголовокЧленовКомиссии, "");
		ТабличныйДокумент.Вывести(ОбластьЧК);
	КонецЦикла;	
КонецПроцедуры	

// Выводит секцию "Приложения" печатной формы. 
//
// Параметры:
//	ДанныеПриложений - см. ТаблицаФайлыДляПечатиПриказ61н
//	ТабДок - ТабличныйДокумент
//	ОблПриложение - ТабличныйДокумент - область "Приложение" табличного документа 
//	ОблПриложениеП - ТабличныйДокумент - пустая область табличного документа, для отступа
//	КолСекций - Число - количество секций Приложение для формы, согласно норматичным документам
Процедура ВывестиСекциюПриложенияИзТаблицыЗначений(
	ДанныеПриложений, ТабДок, ОблПриложение, ОблПриложениеП, КолСекций = 2) Экспорт
	Сч = 0;
	ТабДок.Вывести(ОблПриложениеП);
	Для Каждого СтрокаПриложения Из ДанныеПриложений Цикл
		Сч = Сч + 1;
		ОблПриложение.Параметры.Заполнить(Новый Структура("Номер", Сч));
		ОблПриложение.Параметры.Заполнить(СтрокаПриложения);
		ОблПриложение.Параметры.ИмяФайлаРасширение = СтрокаПриложения.ИмяФайла + "." + СтрокаПриложения.Расширение;
		ТабДок.Вывести(ОблПриложение);
	КонецЦикла;
	
	ПустаяСтруктура = Новый Структура("Номер, Описание, ИмяФайлаРасширение", "","","");
	Если Сч < 2 Тогда
		Для к = (Сч + 1) по КолСекций Цикл
			ОблПриложение.Параметры.Заполнить(ПустаяСтруктура);
			ТабДок.Вывести(ОблПриложение);
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

Функция ПодразделенияСотрудниковМЗ0510434(МассивОбъектов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеМЗ.Дата КАК Дата,
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ПоступлениеМЗ.Организация КАК Организация,
	|	ПоступлениеМЗ.Контрагент КАК Контрагент,
	|	ПоступлениеМЗ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Сотрудники
	|ИЗ
	|	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ПоступлениеМЗ.Организация = Сотрудники.Владелец
	|			И ПоступлениеМЗ.Контрагент = Сотрудники.Контрагент
	|ГДЕ
	|	ПоступлениеМЗ.Ссылка В(&МассивОбъектов)
	|	И ПоступлениеМЗ.ПолучательИмущества = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗ.Дата,
	|	ПоступлениеМЗ.ПолучательИмущества,
	|	ПоступлениеМЗ.Организация,
	|	NULL,
	|	ПоступлениеМЗ.Ссылка
	|ИЗ
	|	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|ГДЕ
	|	ПоступлениеМЗ.Ссылка В(&МассивОбъектов)
	|	И ПоступлениеМЗ.ПолучательИмущества <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	АктСписанияМЗ.Дата,
	|	АктСписанияМЗ.ПолучательИмущества,
	|	АктСписанияМЗ.Организация,
	|	NULL,
	|	АктСписанияМЗ.Ссылка
	|ИЗ
	|	Документ.АктСписанияМЗ КАК АктСписанияМЗ
	|ГДЕ
	|	АктСписанияМЗ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктСписанияМягкогоИХозИнвентаря.Дата,
	|	АктСписанияМягкогоИХозИнвентаря.ПолучательИмущества,
	|	АктСписанияМягкогоИХозИнвентаря.Организация,
	|	NULL,
	|	АктСписанияМягкогоИХозИнвентаря.Ссылка
	|ИЗ
	|	Документ.АктСписанияМягкогоИХозИнвентаря КАК АктСписанияМягкогоИХозИнвентаря
	|ГДЕ
	|	АктСписанияМягкогоИХозИнвентаря.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(ДанныеСотрудников.Период) КАК Период,
	|	Сотрудники.Организация КАК Организация,
	|	Сотрудники.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДатыСотрудников
	|ИЗ
	|	Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО Сотрудники.Сотрудник = ДанныеСотрудников.Сотрудник
	|			И Сотрудники.Организация = ДанныеСотрудников.Организация
	|			И Сотрудники.Дата >= ДанныеСотрудников.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Сотрудник,
	|	Сотрудники.Организация,
	|	Сотрудники.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыСотрудников.Ссылка КАК Документ,
	|	ДанныеСотрудников.Подразделение КАК Подразделение,
	|	ДатыСотрудников.Сотрудник КАК Сотрудник
	|ИЗ
	|	ДатыСотрудников КАК ДатыСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО ДатыСотрудников.Сотрудник = ДанныеСотрудников.Сотрудник
	|			И ДатыСотрудников.Организация = ДанныеСотрудников.Организация
	|			И ДатыСотрудников.Период = ДанныеСотрудников.Период";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.ПоступлениеМЗ, ДокументСсылка.АктСписанияМЗ, ДокументСсылка.АктСписанияМягкогоИХозИнвентаря"));
	Результат.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	Результат.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), Выборка);
	
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция ПредставлениеКлассаОпасности(Класс) Экспорт
	
	Коды = Новый Соответствие;
	Если ТипЗнч(Класс) = Тип("Число") Тогда
		Коды.Вставить(1, "I");
		Коды.Вставить(2, "II");
		Коды.Вставить(3, "III");
		Коды.Вставить(4, "IV");
		Коды.Вставить(5, "V");
	Иначе
		Коды.Вставить(ПредопределенноеЗначение("Перечисление.КлассыОпасностиОтходов.Класс1"), "I");
		Коды.Вставить(ПредопределенноеЗначение("Перечисление.КлассыОпасностиОтходов.Класс2"), "II");
		Коды.Вставить(ПредопределенноеЗначение("Перечисление.КлассыОпасностиОтходов.Класс3"), "III");
		Коды.Вставить(ПредопределенноеЗначение("Перечисление.КлассыОпасностиОтходов.Класс4"), "IV");
		Коды.Вставить(ПредопределенноеЗначение("Перечисление.КлассыОпасностиОтходов.Класс5"), "V");
	КонецЕсли;	
	
	Результат = Коды[Класс];
	
	Возврат ?(Результат = Неопределено, "", Результат);
	
КонецФункции

Функция СформироватьОбластьКомиссияАктСписанияМЗ0504230(ВыборкаШапка, ВыборкаКомиссия, МассивОбластейКомиссия, КоличествоСтрокКомиссии=3, СтрокаКомиссия = "", ВписыватьДолжности = Ложь) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	СоставСтрокиКомиссии = Новый Массив;
	ИндексОбластиКомиссия = 0;
	ШаблонСДолжностью = "%2 %1";
	ШаблонБезДолжности = "%1";
	
	пСтатусЧленаКомиссии	= "Председатель комиссии";
	пДолжностьЧленаКомиссии = ВыборкаШапка.ДолжностьПредседателяКомиссии;
	Если ЗначениеЗаполнено(ВыборкаШапка.ФамилияПредседателяКомиссии) Тогда
		пЧленКомиссии			= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
																	ВыборкаШапка.ФамилияПредседателяКомиссии,
																	ВыборкаШапка.ИмяПредседателяКомиссии,
																	ВыборкаШапка.ОтчествоПредседателяКомиссии), Истина);
		Если ВписыватьДолжности И НЕ ПустаяСтрока(ВыборкаШапка.ДолжностьПредседателяКомиссии) Тогда
			ИспользуемыйШаблон = ШаблонСДолжностью;
		Иначе
			ИспользуемыйШаблон = ШаблонБезДолжности;
		КонецЕсли;
		СоставСтрокиКомиссии.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИспользуемыйШаблон,
			пЧленКомиссии, ПредставлениеДолжностиДляПечатиАктСписанияМЗ0504230(ВыборкаШапка.ДолжностьПредседателяКомиссии)));	
	Иначе
		пЧленКомиссии			= "";
	КонецЕсли;
	СтруктураОбластьКомиссия = Новый Структура("пСтатусЧленаКомиссии, пДолжностьЧленаКомиссии, пЧленКомиссии",
		пСтатусЧленаКомиссии, пДолжностьЧленаКомиссии, пЧленКомиссии);
	
	ОбластьКомиссия = МассивОбластейКомиссия[Мин(ИндексОбластиКомиссия, МассивОбластейКомиссия.ВГраница())];
	ИндексОбластиКомиссия = ИндексОбластиКомиссия + 1;
	ОбластьКомиссия.Параметры.Заполнить(СтруктураОбластьКомиссия);
	ТабличныйДокумент.Вывести(ОбластьКомиссия);
	
	пСтатусЧленаКомиссии = "Члены комиссии:";
	ВывелиСтрок = 1;    // председатель комиссии это была первая выведеная строка
	Для Каждого СтрокаКомиссии Из ВыборкаКомиссия Цикл
		ВывелиСтрок = ВывелиСтрок + 1;
		пДолжностьЧленаКомиссии = СтрокаКомиссии.ДолжностьЧленаКомиссии;
		пЧленКомиссии			= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
																		СтрокаКомиссии.ФамилияЧленаКомиссии,
																		СтрокаКомиссии.ИмяЧленаКомиссии,
																		СтрокаКомиссии.ОтчествоЧленаКомиссии), Истина);
		СтруктураОбластьКомиссия = Новый Структура("пСтатусЧленаКомиссии, пДолжностьЧленаКомиссии, пЧленКомиссии",
			пСтатусЧленаКомиссии, пДолжностьЧленаКомиссии, пЧленКомиссии);

		ОбластьКомиссия = МассивОбластейКомиссия[Мин(ИндексОбластиКомиссия, МассивОбластейКомиссия.ВГраница())];
		ИндексОбластиКомиссия = ИндексОбластиКомиссия + 1;
		ОбластьКомиссия.Параметры.Заполнить(СтруктураОбластьКомиссия);
		
		ТабличныйДокумент.Вывести(ОбластьКомиссия);
		
		пСтатусЧленаКомиссии = "";
		Если ВписыватьДолжности И НЕ ПустаяСтрока(СтрокаКомиссии.ДолжностьЧленаКомиссии) Тогда
			ИспользуемыйШаблон = ШаблонСДолжностью;
		Иначе
			ИспользуемыйШаблон = ШаблонБезДолжности;
		КонецЕсли;
		СоставСтрокиКомиссии.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИспользуемыйШаблон,
			пЧленКомиссии, ПредставлениеДолжностиДляПечатиАктСписанияМЗ0504230(СтрокаКомиссии.ДолжностьЧленаКомиссии)));	
	КонецЦикла;
		
	Для Счетчик = ВывелиСтрок По КоличествоСтрокКомиссии Цикл
		СтруктураОбластьКомиссия = Новый Структура("пСтатусЧленаКомиссии, пДолжностьЧленаКомиссии, пЧленКомиссии",
			пСтатусЧленаКомиссии, "", "");

		ОбластьКомиссия = МассивОбластейКомиссия[Мин(ИндексОбластиКомиссия, МассивОбластейКомиссия.ВГраница())];
		ИндексОбластиКомиссия = ИндексОбластиКомиссия + 1;
		ОбластьКомиссия.Параметры.Заполнить(СтруктураОбластьКомиссия);
		ТабличныйДокумент.Вывести(ОбластьКомиссия);
		
		пСтатусЧленаКомиссии = "";
	КонецЦикла;
	
	СтрокаКомиссия = СтрСоединить(СоставСтрокиКомиссии, ", ");

	Возврат ТабличныйДокумент;
	
КонецФункции
	
// Заполнить данные организации в строке для печати100н.
// 
// Параметры:
//  СтрокаШапки - СтрокаТаблицыЗначений:
//   * Организация - СправочникСсылка.Организации
//   * НаименованиеОрганизации - Строка
//   * НаименованиеОбособленногоПодразделения - Строка
//   * Учредитель - Строка
//   * БюджетНаименование - Строка
//   * КодРПБС - Строка
//   * КодРПБСПодр - Строка
//   * ГлаваБК - Строка
//   * ОКТМО - Строка
//  ДанныеОрганизацийПечати - см. ДанныеОрганизацииДляПечати100н
Процедура ЗаполнитьДанныеОрганизацииВСтрокеДляПечати100н(СтрокаШапки, ДанныеОрганизацийПечати) Экспорт
	ДанныеОрганизации = ДанныеОрганизацийПечати.Получить(СтрокаШапки.Ссылка);
	СтрокаШапки.НаименованиеОрганизации = ДанныеОрганизации.НаименованиеОрганизации;
	СтрокаШапки.НаименованиеОбособленногоПодразделения = ДанныеОрганизации.НаименованиеОбособленногоПодразделения;
	СтрокаШапки.НаименованиеСтруктурногоПодразделения = ДанныеОрганизации.НаименованиеСтруктурногоПодразделения;
	СтрокаШапки.Учредитель = ДанныеОрганизации.Учредитель;
	СтрокаШапки.БюджетНаименование = ДанныеОрганизации.БюджетНаименование;
	СтрокаШапки.КодРПБС = ДанныеОрганизации.КодРПБС;
	СтрокаШапки.КодРПБСПодр = ДанныеОрганизации.КодРПБСОбособленногоПодразделения;
	СтрокаШапки.ГлаваБК = ДанныеОрганизации.ГлаваБК;
	СтрокаШапки.ОКТМО = ДанныеОрганизации.ОКТМО;
	СтрокаШапки.СтруктурноеПодразделение = ДанныеОрганизации.СтруктурноеПодразделение;
	СтрокаШапки.ОтветственныйДолжность = ДанныеОрганизации.ОтветственныйДолжность;
	СтрокаШапки.ОтветственныйФИО = КорреспондентыКлиентСервер.ФИО(ДанныеОрганизации.ОтветственныйФИО, Истина);
	СтрокаШапки.ОтветственныйТелефон = ДанныеОрганизации.ОтветственныйТелефон;
	СтрокаШапки.ОтветственныйЭлПочта = ДанныеОрганизации.ОтветственныйЭлПочта;
КонецПроцедуры

// Заполнить данные ответственного в строке для печати100н.
// 
// Параметры:
//  СтрокаШапки - СтрокаТаблицыЗначений:
//   * Дата - Дата
//   * ОтветственныйДолжность - Строка
//   * ОтветственныйФИО - Строка
//   * ОтветственныйТелефон - Строка
//   * ОтветственныйЭлПочта - Строка
//  ОтветственныйИсполнитель - СправочникСсылка.Сотрудники
//  ЗаполнятьПодразделение - Булево
Процедура ЗаполнитьДанныеОтветственногоВСтрокеДляПечати100н(СтрокаШапки, ОтветственныйИсполнитель, ЗаполнятьПодразделение = Ложь) Экспорт
	ТребуемыеДанные = "Фамилия, Имя, Отчество, Должность";
	Если ЗаполнятьПодразделение Тогда
		ТребуемыеДанные = ТребуемыеДанные + ", Подразделение"
	КонецЕсли;
	ДанныеСотрудника = Справочники.Сотрудники.ДанныеСотрудника(ОтветственныйИсполнитель,
		ТребуемыеДанные,
		СтрокаШапки.Дата,
		Истина);
	СтрокаШапки.ОтветственныйДолжность = ДанныеСотрудника.Должность;
	СтрокаШапки.ОтветственныйФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
	СтрокаШапки.ОтветственныйТелефон = ДанныеСотрудника.ТелефонРабочийФизическиеЛица;
	СтрокаШапки.ОтветственныйЭлПочта = ДанныеСотрудника.EmailФизическиеЛица;
	Если ЗаполнятьПодразделение Тогда
		СтрокаШапки.СтруктурноеПодразделение = ДанныеСотрудника.Подразделение;
	КонецЕсли; 
	
КонецПроцедуры

// Заполнить комиссию для печати100н.
// 
// Параметры:
//  ДанныеКомиссий - см. ТаблицаКомиссияДляПечатиПриказ61н
//  СоставКомиссий - ТаблицаЗначений
//  Документ - ДокументСсылка
Процедура ЗаполнитьКомиссиюДляПечати100н(ДанныеКомиссий, СоставКомиссий, Документ) Экспорт
	// Председатель
	Отбор = Новый Структура("Ссылка,Председатель", Документ, Истина);
	СтрокиПредседатель = СоставКомиссий.НайтиСтроки(Отбор);
	Для Каждого Председатель Из СтрокиПредседатель Цикл
		СтрокаКомиссия = ДанныеКомиссий.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКомиссия, Председатель);
		СтрокаКомиссия.Председатель = Истина;
		СтрокаКомиссия.ФИО = КорреспондентыКлиентСервер.ФИО(Председатель);
	КонецЦикла;

	// Члены комиссии
	Отбор = Новый Структура("Ссылка,Председатель", Документ, Ложь);
	СтрокиЧленыКомиссии = СоставКомиссий.НайтиСтроки(Отбор);
	Для Каждого ЧленКомиссии Из СтрокиЧленыКомиссии Цикл
		СтрокаКомиссия = ДанныеКомиссий.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКомиссия, ЧленКомиссии);
		СтрокаКомиссия.ФИО = КорреспондентыКлиентСервер.ФИО(ЧленКомиссии, Истина);
	КонецЦикла;
КонецПроцедуры

// Заполнить комиссию из старых данных для печати100н.
// 
// Параметры:
//  ДанныеКомиссий - см. ТаблицаКомиссияДляПечатиПриказ61н
//  ВыборкаШапка - ВыборкаИзРезультатаЗапроса
//  ВыборкаКомиссия - ВыборкаИзРезультатаЗапроса
Процедура ЗаполнитьКомиссиюИзСтарыхДанныхДляПечати100н(ДанныеКомиссий, ВыборкаШапка, ВыборкаКомиссия) Экспорт
	// Председатель
	Если ЗначениеЗаполнено(ВыборкаШапка.ФамилияПредседательКомиссии) Тогда
		СтрокаКомиссия = ДанныеКомиссий.Добавить();
		СтрокаКомиссия.Председатель = Истина;
		ФИОПредседателя = Новый Структура;
		ФИОПредседателя.Вставить("Фамилия", ВыборкаШапка.ФамилияПредседательКомиссии);
		ФИОПредседателя.Вставить("Имя", ВыборкаШапка.ИмяПредседательКомиссии);
		ФИОПредседателя.Вставить("Отчество", ВыборкаШапка.ОтчествоПредседательКомиссии);
		СтрокаКомиссия.ФИО = КорреспондентыКлиентСервер.ФИО(ФИОПредседателя);
		СтрокаКомиссия.НаименованиеДолжности = ВыборкаШапка.ДолжностьПредседательКомиссии;
	КонецЕсли;
	// Члены комиссии
	ВыборкаКомиссия.Сбросить();
	Пока ВыборкаКомиссия.НайтиСледующий(Новый Структура("Ссылка", ВыборкаШапка.Ссылка)) Цикл
		СтрокаКомиссия = ДанныеКомиссий.Добавить();
		ФИОЧленаКомиссии = Новый Структура;
		ФИОЧленаКомиссии.Вставить("Фамилия", ВыборкаКомиссия.ФамилияЧленаКомиссии);
		ФИОЧленаКомиссии.Вставить("Имя", ВыборкаКомиссия.ИмяЧленаКомиссии);
		ФИОЧленаКомиссии.Вставить("Отчество", ВыборкаКомиссия.ОтчествоЧленаКомиссии);
		СтрокаКомиссия.ФИО = КорреспондентыКлиентСервер.ФИО(ФИОЧленаКомиссии);
		СтрокаКомиссия.НаименованиеДолжности = ВыборкаКомиссия.ДолжностьЧленаКомиссии;
	КонецЦикла;
КонецПроцедуры

// Структура для передачи параметров в процедуру СопоставитьДвиженияСоСтрокамиТабличнойЧасти
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * ИменаСуммируемыхКолонок - Строка - имена колонок таблицы движений, которые при свертке таблицы нужно складывать. По-умолчанию "Количество,Сумма".
// * СоответствиеКолонокУпрощенное - Структура - соответствие имен колонок поиска в свернутой таблице движений.
// * СоответствиеКолонок - Структура - соответствие имен колонок поиска в полной таблице движений.
// * Организация - СправочникСсылка.Организации - 
// * ИФО - СправочникСсылка.ИсточникиФинансовогоОбеспечения - 
// * КФО - ПеречислениеСсылка.КВД - 
// * Дата - Дата - дата документа
// * ВыборкаМатериалы - ВыборкаИзРезультатаЗапроса - выборка строк документа
// * ТаблицаДвижений - ТаблицаЗначений - движения документа
// * ИмяКолонкиКЭК - Строка - имя колонки таблицы движений.
// * ИмяКолонкиНоменклатура - Строка - имя колонки таблицы движений.
// * КФОВТаблице - Булево - взять КФО из ВыборкаМатериалы, а не из параметров
// * ТипНоменклатурыВТаблице - Булево - тип номенклатуры есть в ВыборкаМатериалы. Не требуется получаеть его из номенклатуры
Функция СопоставитьДвиженияСоСтрокамиТабличнойЧасти_Параметры() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Результат.Вставить("ИФО", Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
	Результат.Вставить("КФО");
	Результат.Вставить("Дата");
	Результат.Вставить("ВыборкаМатериалы");
	Результат.Вставить("ТаблицаДвижений");
	Результат.Вставить("ИмяКолонкиКЭК", "");
	Результат.Вставить("ИмяКолонкиНоменклатура");
	Результат.Вставить("СоответствиеКолонок",           Новый Структура);
	Результат.Вставить("СоответствиеКолонокУпрощенное", Новый Структура);
	Результат.Вставить("ИменаСуммируемыхКолонок",       "Количество,Сумма");
	Результат.Вставить("КФОВТаблице",                   Ложь);
	Результат.Вставить("ТипНоменклатурыВТаблице",       Ложь);
	Возврат Результат;
КонецФункции

// В таблице движений в колонку "НомерСтрокиДокумента" заполняет номер строки. При необходимости,
// добавляет строки в таблицу движений. После сопоставления все несопоставленные движения удаляются из таблицы движений.
// 
// Параметры:
// 	Параметры - Структура - см. СопоставитьДвиженияСоСтрокамиТабличнойЧасти_Параметры
Процедура СопоставитьДвиженияСоСтрокамиТабличнойЧасти(Параметры) Экспорт
	
	НеобработанныеСтроки = Новый Массив;
	СопоставитьДвиженияСоСтрокамиТабличнойЧастиСтрого(Параметры, НеобработанныеСтроки);
	Если НеобработанныеСтроки.Количество() > 0 Тогда
		СопоставитьДвиженияСоСтрокамиТабличнойЧастиБезУчетаДопСубконто(Параметры, НеобработанныеСтроки);
	КонецЕсли;
		
КонецПроцедуры

// Получение реквизита сотрудника
//
// "Наименование"     - ДанныеСотрудника.НаименованиеПолное
// "Должность"        - ДанныеСотрудника.Должность;
// "ФИО"              - КорреспондентыКлиентСервер.ФИО
// "Телефон"          - ДанныеСотрудника.ТелефонРабочийФизическиеЛица;
// "ЭлектроннаяПочта" - ДанныеСотрудника.EmailФизическиеЛица;
Функция ПолучитьРеквизитСотрудника(Реквизит, Исполнитель, НаДату) Экспорт
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		ДанныеСотрудника = Новый Структура(
				"СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность, НаименованиеПолное", 
				Исполнитель, НаДату);
				
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина, Истина);
		
		Если Реквизит = "Наименование" Тогда
			Возврат ДанныеСотрудника.НаименованиеПолное;
		ИначеЕсли Реквизит = "Должность" Тогда
			Возврат ДанныеСотрудника.Должность;
		ИначеЕсли Реквизит = "ФИО" Тогда
			Возврат КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		ИначеЕсли Реквизит = "Телефон" Тогда
			Возврат ДанныеСотрудника.ТелефонРабочийФизическиеЛица;
		ИначеЕсли Реквизит = "ЭлектроннаяПочта" Тогда
			Возврат ДанныеСотрудника.EmailФизическиеЛица;
		КонецЕсли;
	КонецЕсли;
	
	Возврат " ";
	
КонецФункции

// Очищает значения параметров области табличного документа.
// Может использоваться, например, перед выводом пустых строк при печати документа, для гарантированной очистки ранее выведенных параметров
// Параметы:
//	Область - ОбластьТабличногоДокумента - область, в которой будут очищены параметры
//
Процедура ОчиститьПараметрыОбласти(Область) Экспорт

	Для Индекс = 0 По Область.Параметры.Количество() - 1 Цикл
	
		Область.Параметры[Индекс] = "";
	
	КонецЦикла; 

КонецПроцедуры

// Формирует табличный документ "требование накладная ф.0504204".
// Пример вызова без запроса к движениям документа см. в документе "ВыпускПродукцииСоСчета106".
// Пример вызова с запросом к движениям документа см. в документе "ТребованиеНакладная0504204".
// Параметры:
//	РезультатЗапроса - Массив из РезультатЗапроса - результат выполнения пакета запросов.
//							1 запрос пакета - запрос к основной таблице документа. Без итогов.
//							2 запрос пакета - запрос к таблице документа. С итогом по "Ссылка"
//							3 запрос пакета - запрос к движениям документа. С итогом по "Регистратор". Необязателен.
//	ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//	ИмяМакета - Строка
// Возвращаемое значение:
//	ТабличныйДокумент
//
Функция ПечатьТребованияНакладной0504204(РезультатЗапроса, ОбъектыПечати, ИмяМакета = "ПФ_MXL_ТребованиеНакладная0504204") Экспорт
	
	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Материал");
	ТаблицаДвижений.Колонки.Добавить("СчетДт");
	ТаблицаДвижений.Колонки.Добавить("КПСДт");
	ТаблицаДвижений.Колонки.Добавить("КЭКДт");
	ТаблицаДвижений.Колонки.Добавить("СчетКт");
	ТаблицаДвижений.Колонки.Добавить("КПСКт");
	ТаблицаДвижений.Колонки.Добавить("КЭККт");
	ТаблицаДвижений.Колонки.Добавить("КФО");
	ТаблицаДвижений.Колонки.Добавить("КФОДт");
	ТаблицаДвижений.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаДвижений.Колонки.Добавить("КоличествоКт", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаДвижений.Колонки.Добавить("КоличествоДт", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаДвижений.Колонки.Добавить("УчтеноКоличество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаДвижений.Колонки.Добавить("УчтеноСумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаДвижений.Колонки.Добавить("Примечание");
	ТаблицаДвижений.Колонки.Добавить("ДопСубконто");

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ТребованиеНакладная0504204";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет." + ИмяМакета);
	ОбластьЗаголовок		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвалЗаголовка	= Макет.ПолучитьОбласть("ПодвалЗаголовка");
	ОбластьШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьИтог				= Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал			= Макет.ПолучитьОбласть("Подвал");
	ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");

	ПервыйДокумент = Истина;
	ТаблицаВыборкаДокументов = РезультатЗапроса[0].Выгрузить();
	ВыборкаВсеСтроки = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЕстьВыборкаДвижения = РезультатЗапроса.Количество() > 2;
	ЕстьКолонкаДвиженийКФОДт = Ложь;
	ЕстьКолонкаДвиженийДопСубконто = Ложь;
	Если ЕстьВыборкаДвижения Тогда
		ВсеДвиженияДокументов = РезультатЗапроса[2].Выгрузить(); // ТаблицаЗначений
		Если ВсеДвиженияДокументов.Количество() = 0 Тогда
			ЕстьВыборкаДвижения = Ложь;
		Иначе	
			ЕстьКолонкаДвиженийКФОДт = ВсеДвиженияДокументов.Колонки.Найти("КФОДт") <> Неопределено;
			ЕстьКолонкаДвиженийДопСубконто = ВсеДвиженияДокументов.Колонки.Найти("ДопСубконто") <> Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьВыборкаДвижения Тогда
		// Свернуть внутреннее перемещение по забалансу в одну проводку
		// по кредитовым оборотам будем искать дебетовые
		Отбор = Новый Структура("Регистратор, СчетДт, КПСДт, Материал, КоличествоДт, Сумма");
		Если ЕстьКолонкаДвиженийДопСубконто Тогда
			Отбор.Вставить("ДопСубконто");
		КонецЕсли;
		СтрокиКО = ВсеДвиженияДокументов.НайтиСтроки(Новый Структура("СчетДт", ПланыСчетов.ЕПСБУ.ПустаяСсылка()));
		Для Каждого СтрокаДвиженияКО Из СтрокиКО Цикл
			Отбор.Регистратор = СтрокаДвиженияКО.Регистратор;
			Отбор.СчетДт = СтрокаДвиженияКО.СчетКт;
			Отбор.КПСДт = СтрокаДвиженияКО.КПСКт;
			Отбор.Материал = СтрокаДвиженияКО.Материал;
			Если ЕстьКолонкаДвиженийДопСубконто Тогда
				Отбор.ДопСубконто = СтрокаДвиженияКО.ДопСубконто;
			КонецЕсли;
			Отбор.КоличествоДт = СтрокаДвиженияКО.КоличествоКт;
			Отбор.Сумма = СтрокаДвиженияКО.Сумма;
			
			СтрокиДО = ВсеДвиженияДокументов.НайтиСтроки(Отбор);
			Если СтрокиДО.Количество() > 0 Тогда
				СтрокаДвиженияДО = СтрокиДО[0];
				СтрокаДвиженияКО.СчетДт = СтрокаДвиженияДО.СчетДт;
				СтрокаДвиженияКО.КПСДт = СтрокаДвиженияДО.КПСДт;
				СтрокаДвиженияКО.КЭКДт = СтрокаДвиженияДО.КЭКДт;
				СтрокаДвиженияКО.КоличествоДт = СтрокаДвиженияДО.КоличествоДт;
				ВсеДвиженияДокументов.Удалить(СтрокаДвиженияДО);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЕстьПолеЗатребовал = ТаблицаВыборкаДокументов.Колонки.Найти("Затребовал") <> Неопределено;
	ЕстьПолеОтпускРазрешил = ТаблицаВыборкаДокументов.Колонки.Найти("ОтпускРазрешил") <> Неопределено;
	ЕстьПолеОтветственныйИсполнитель = ТаблицаВыборкаДокументов.Колонки.Найти("ОтветственныйИсполнитель") <> Неопределено;
	ЕстьПолеОтветственныйИсполнительБух = ТаблицаВыборкаДокументов.Колонки.Найти("ОтветственныйИсполнительБух") <> Неопределено;
	ЕстьПолеОтветственный = ТаблицаВыборкаДокументов.Колонки.Найти("Ответственный") <> Неопределено;
	
	КэшСубконтоСчета = Новый Соответствие;
	
	Для Каждого ВыборкаДокументов Из ТаблицаВыборкаДокументов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЕстьЖурналОпераций = Ложь;
		Если ЕстьВыборкаДвижения Тогда
			ТаблицаДвижений.Очистить();
			ДвиженияПоРегистратору = ВсеДвиженияДокументов.НайтиСтроки(Новый Структура("Регистратор", ВыборкаДокументов.Ссылка));
			Для Каждого СтрокаДвиженияПоРегистратору Из ДвиженияПоРегистратору Цикл
				Если Не ЕстьЖурналОпераций Тогда
					Если ЗначениеЗаполнено(СтрокаДвиженияПоРегистратору.ЖурналОпераций) Тогда
						ЕстьЖурналОпераций = Истина;
					Иначе
						Если ЗначениеЗаполнено(СтрокаДвиженияПоРегистратору.СчетДт) Тогда
							СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаДвиженияПоРегистратору.СчетДт);
						Иначе
							СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаДвиженияПоРегистратору.СчетКт);
						КонецЕсли;
						Если СвойстваСчета <> Неопределено И СвойстваСчета.Забалансовый Тогда
							ЕстьЖурналОпераций = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(ТаблицаДвижений.Добавить(), СтрокаДвиженияПоРегистратору);
			КонецЦикла;

			СтрокаКолонок = "Материал, СчетДт, КПСДт, КЭКДт, СчетКт, КПСКт, КЭККт, КФО";
			Если ЕстьКолонкаДвиженийКФОДт Тогда
				СтрокаКолонок = СтрокаКолонок + ", КФОДт";
			КонецЕсли;
			Если ЕстьКолонкаДвиженийДопСубконто Тогда
				СтрокаКолонок = СтрокаКолонок + ", ДопСубконто";
			КонецЕсли;
					
			ТаблицаДвижений.Свернуть(СтрокаКолонок,
				"Сумма, КоличествоКт, КоличествоДт, УчтеноКоличество, УчтеноСумма");
			
		КонецЕсли;
		
		// вывод шапки
		
		СтруктураОбластьШапка = Новый Структура;
		СтруктураОбластьШапка.Вставить("пДата",Формат(ВыборкаДокументов.Дата, "ДЛФ=D"));
		СтруктураОбластьШапка.Вставить("пДатаЗаголовка", ВыборкаДокументов.Дата);
		СтруктураОбластьШапка.Вставить("пМолПолучатель",
			Справочники.Контрагенты.ФамилияИО(ВыборкаДокументов.МолПолучатель,Истина,ВыборкаДокументов.Дата));
		СтруктураОбластьШапка.Вставить("пНомер",
			ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаДокументов.Ссылка,ВыборкаДокументов.Номер));
		
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьЗаголовок.Параметры.Заполнить(СтруктураОбластьШапка);

		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ПодвалЗаголовкаПараметры = Новый Структура("пЗатребовалДолжность, пЗатребовалФИО, пРазрешилДолжность, пРазрешилФИО");
		Если ЕстьПолеЗатребовал Тогда
			ДанныеСотрудника = Новый Структура("Фамилия, Имя, Отчество, Должность");
			ДанныеСотрудника.Вставить("СсылкаНаОбъект",	ВыборкаДокументов.Затребовал);
			ДанныеСотрудника.Вставить("Период",			ВыборкаДокументов.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			ПодвалЗаголовкаПараметры.пЗатребовалДолжность	= ДанныеСотрудника.Должность;
			ПодвалЗаголовкаПараметры.пЗатребовалФИО			= КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		КонецЕсли;
		
		Если ЕстьПолеОтпускРазрешил Тогда
			ДанныеСотрудника = Новый Структура("Фамилия, Имя, Отчество, Должность");
			ДанныеСотрудника.Вставить("СсылкаНаОбъект",	ВыборкаДокументов.ОтпускРазрешил);
			ДанныеСотрудника.Вставить("Период",			ВыборкаДокументов.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			ПодвалЗаголовкаПараметры.пРазрешилДолжность	= ДанныеСотрудника.Должность;
			ПодвалЗаголовкаПараметры.пРазрешилФИО		= КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		КонецЕсли;
				
		ОбластьПодвалЗаголовка.Параметры.Заполнить(ПодвалЗаголовкаПараметры);
		
		ТабличныйДокумент.Вывести(ОбластьПодвалЗаголовка);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		// вывод таблицы
		
		ИтогоЗатребовано = 0;
		ИтогоКоличество = 0;
		ИтогоСумма = 0;
		
		ТипСсылки = ТипЗнч(ВыборкаДокументов.Ссылка);
		
		ЭтоПоступлениеМЗ = ТипСсылки = Тип("ДокументСсылка.ПоступлениеМЗ");
		ЭтоВыпускПродукции = ТипСсылки = Тип("ДокументСсылка.ВыпускПродукции")
			ИЛИ ТипСсылки = Тип("ДокументСсылка.ВыпускПродукцииСоСчета106");
		ЭтоТребованиеНакладная0315006 = ТипСсылки = Тип("ДокументСсылка.ТребованиеНакладная0315006");
		ЭтоПеремещениеМеждуНТТ = Ложь;
		ЭтоВозвратИзНТТ = Ложь;
		ЭтоПеремещениеВНТТ = Ложь;
		Если ЭтоТребованиеНакладная0315006 Тогда
			ВидПеремещенияМЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДокументов.Ссылка, "ВидПеремещения");
			ЭтоПеремещениеМеждуНТТ = ВидПеремещенияМЗ = Перечисления.ВидыПеремещенияМЗ.ПеремещениеМеждуНТТ;
			ЭтоВозвратИзНТТ = ВидПеремещенияМЗ = Перечисления.ВидыПеремещенияМЗ.ВозвратИзНТТ;
			ЭтоПеремещениеВНТТ = ВидПеремещенияМЗ = Перечисления.ВидыПеремещенияМЗ.ПеремещениеВНТТ;
		КонецЕслИ;
		
		ВыборкаВсеСтроки.Сбросить();
		Если ВыборкаВсеСтроки.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокументов.Ссылка)) Тогда
			ВыборкаСтрок = ВыборкаВсеСтроки.Выбрать();
			КоличествоСтрок = ВыборкаСтрок.Количество();

			Пока ВыборкаСтрок.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаСтрок);
				
				СтруктураОбластьСтрока = Новый Структура("пСчетМЦ, пКоррСчет",,);
				СтруктураОбластьСтрока.Вставить("пКоличество", ВыборкаСтрок.пКоличество);
				СтруктураОбластьСтрока.Вставить("пЗатребовано", ВыборкаСтрок.пЗатребовано);
				
				//вывод счетов Дт и Кт особых случаев
				ВыводОсобыхСлучаев = Ложь;
				Если ЭтоТребованиеНакладная0315006 И ЕстьВыборкаДвижения Тогда
					//нет субконто Номенклатура для счета 105.Г8 (В рознице) Товары –  иное движимое имущество 
					//учреждения.
					Если ЭтоПеремещениеМеждуНТТ Тогда
						ВыводОсобыхСлучаев = Истина;
						ТаблицаДвиженийТО = РезультатЗапроса[2].Выгрузить();
						СчетУчетаТоварыВРознице = ТаблицаДвиженийТО[1].СчетДт;
						
						КЭК340 = БухгалтерскийУчетПовтИсп.КЭКПоКоду("340");
						
						СтруктураОбластьСтрока.пСчетМЦ = ПредставлениеРабочегоСчета(ВыборкаСтрок.КПС, ВыборкаСтрок.КФО,
							СчетУчетаТоварыВРознице, КЭК340);
							
						КоррСчет = ПредставлениеРабочегоСчета(ВыборкаСтрок.КПС, ВыборкаСтрок.КФО,
							СчетУчетаТоварыВРознице, КЭК340);
							
						СтруктураОбластьСтрока.Вставить("пКоррСчет", КоррСчет);
						СтруктураОбластьСтрока.Вставить("пСумма", ВыборкаСтрок.пСумма);
						СтруктураОбластьСтрока.Вставить("пЦена", ВыборкаСтрок.пЦена);
						СтруктураОбластьСтрока.Вставить("пПримечание", ВыборкаСтрок.Примечание);
					КонецЕсли;
				КонецЕсли;	
						
				Если (НЕ ЕстьВыборкаДвижения)И(НЕ ВыводОсобыхСлучаев) Тогда
					
					//без проводок счета не выводим
					СтруктураОбластьСтрока.пСчетМЦ = "";
					СтруктураОбластьСтрока.пКоррСчет = "";
						
					СтруктураОбластьСтрока.Вставить("пСумма", ВыборкаСтрок.пСумма);
					СтруктураОбластьСтрока.Вставить("пЦена", ВыборкаСтрок.пЦена);
					СтруктураОбластьСтрока.Вставить("пПримечание", ВыборкаСтрок.Примечание);
					
				ИначеЕсли (НЕ ВыводОсобыхСлучаев) Тогда
					ВидСчетаДтКт = "СчетКт";
					ВидКПСДтКт = "КПСКт";
					КонтролироватьКт = Истина;
					УчитыватьКФО = Истина;
					
					Если ЭтоВозвратИзНТТ  Тогда
						ВидСчетаДтКт = "СчетДт";
						ВидКПСДтКт = "КПСДт";
						КонтролироватьКт = Ложь;
					ИначеЕсли ЭтоПоступлениеМЗ Тогда
						ВидСчетаДтКт = "СчетДт";
						ВидКПСДтКт = "КПСДт";
						КонтролироватьКт = Ложь;
						УчитыватьКФО = Ложь;
					ИначеЕсли ЭтоВыпускПродукции Тогда
						ВидСчетаДтКт = "СчетДт";
						ВидКПСДтКт = "КПСДт";
						КонтролироватьКт = Ложь;
					КонецЕсли;
					СчетОтбора = ?(ТипЗнч(ВыборкаСтрок.Счет) = Тип("Строка"),
						БухгалтерскийУчет.СчетПоКоду(ВыборкаСтрок.Счет,  ВыборкаДокументов.Дата,  ВыборкаДокументов.Организация), ВыборкаСтрок.Счет);
					
					Отбор = Новый Структура;
					Отбор.Вставить("Материал",	ВыборкаСтрок.Номенклатура);
					Отбор.Вставить(ВидСчетаДтКт,СчетОтбора);
					Отбор.Вставить(ВидКПСДтКт,	ВыборкаСтрок.КПС);
					Если УчитыватьКФО Тогда
						Отбор.Вставить("КФО",	ВыборкаСтрок.КФО);
					КонецЕсли;
					Если ЕстьКолонкаДвиженийДопСубконто И ЕстьДопСубконтоСчетаУчетаМЗ(СчетОтбора, КэшСубконтоСчета) Тогда
						Отбор.Вставить("ДопСубконто",	ВыборкаСтрок.ДопСубконто);
					КонецЕсли;
					
					Сумма = 0;
					УчтеноКоличество = 0;
					
					СтрокиДвижений = ТаблицаДвижений.НайтиСтроки(Отбор);
					Для каждого ТекСтрокаДвижения Из СтрокиДвижений Цикл
						Если КонтролироватьКт Тогда
							КоличествоДвижения = ТекСтрокаДвижения.КоличествоКт;
						Иначе
							КоличествоДвижения = ТекСтрокаДвижения.КоличествоДт;
						КонецЕсли;
						
						Если КоличествоДвижения = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						Если УчтеноКоличество = ВыборкаСтрок.пКоличество Тогда
							Прервать;
						КонецЕсли;
						
						КоличествоПоСтроке = Мин(ВыборкаСтрок.пКоличество,
							КоличествоДвижения - ТекСтрокаДвижения.УчтеноКоличество);
						Если КоличествоПоСтроке = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						Если КоличествоПоСтроке = (КоличествоДвижения - ТекСтрокаДвижения.УчтеноКоличество) Тогда
							УчтеноСумма = ТекСтрокаДвижения.Сумма - ТекСтрокаДвижения.УчтеноСумма;
						Иначе
							УчтеноСумма = Окр(КоличествоПоСтроке * ТекСтрокаДвижения.Сумма / КоличествоДвижения, 2);
						КонецЕсли;
						
						УчтеноКоличество = УчтеноКоличество + КоличествоПоСтроке;
						Сумма = Сумма + УчтеноСумма;
						
						ТекСтрокаДвижения.УчтеноКоличество = ТекСтрокаДвижения.УчтеноКоличество + КоличествоПоСтроке;
						ТекСтрокаДвижения.УчтеноСумма = ТекСтрокаДвижения.УчтеноСумма + Сумма;
						
						СтруктураОбластьСтрока.пСчетМЦ = ПредставлениеРабочегоСчета(ТекСтрокаДвижения.КПСКт,
							ТекСтрокаДвижения.КФО, ТекСтрокаДвижения.СчетКт, ТекСтрокаДвижения.КЭККт);
							
						Если НЕ ЕстьКолонкаДвиженийКФОДт Тогда
							КоррСчет = ПредставлениеРабочегоСчета(ТекСтрокаДвижения.КПСДт, ТекСтрокаДвижения.КФО,
								ТекСтрокаДвижения.СчетДт, ТекСтрокаДвижения.КЭКДт);
						Иначе
							КоррСчет = ПредставлениеРабочегоСчета(ТекСтрокаДвижения.КПСДт, ТекСтрокаДвижения.КФОДт,
								ТекСтрокаДвижения.СчетДт, ТекСтрокаДвижения.КЭКДт);
						КонецЕсли;
					
						СтруктураОбластьСтрока.Вставить("пКоррСчет", КоррСчет);
					КонецЦикла;
					
					Если ЭтоПеремещениеВНТТ Тогда
						Сумма = ВыборкаСтрок.пСумма;
					КонецЕсли;
					
					СтруктураОбластьСтрока.Вставить("пСумма", Сумма);
					СтруктураОбластьСтрока.Вставить("пЦена",
						Окр(Сумма / ?(ВыборкаСтрок.пКоличество = 0, 1, ВыборкаСтрок.пКоличество), 2));
					СтруктураОбластьСтрока.Вставить("пПримечание", ВыборкаСтрок.Примечание);
					
				КонецЕсли;

				СтруктураОбластьСтрока.Вставить("пНомерПп", ВыборкаСтрок.НомерСтроки);
				
				ОбластьСтрока.Параметры.Заполнить(СтруктураОбластьСтрока);
				
				СтруктураНаименование = Новый Структура("пНоменклатура, НоменклатураНаименование, НоменклатураНаименованиеПолное");
				ЗаполнитьЗначенияСвойств(СтруктураНаименование, ВыборкаСтрок);
				Если ЗначениеЗаполнено(СтруктураНаименование.НоменклатураНаименованиеПолное) Тогда
					СтруктураНаименование.пНоменклатура = СтруктураНаименование.НоменклатураНаименованиеПолное;
				ИначеЕсли ЗначениеЗаполнено(СтруктураНаименование.НоменклатураНаименование) Тогда
					СтруктураНаименование.пНоменклатура = СтруктураНаименование.НоменклатураНаименование;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СтруктураНаименование.НоменклатураНаименованиеПолное) Тогда
					СтруктураНаименование.Удалить("НоменклатураНаименованиеПолное");
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СтруктураНаименование.НоменклатураНаименование) Тогда
					СтруктураНаименование.Удалить("НоменклатураНаименование");
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СтруктураНаименование.пНоменклатура) Тогда
					СтруктураНаименование.Удалить("пНоменклатура");
				КонецЕсли;
				Если ЗначениеЗаполнено(СтруктураНаименование) Тогда
					ОбластьСтрока.Параметры.Заполнить(СтруктураНаименование);
				КонецЕсли;
				
				ПереводСтраницы = Ложь;
				
				Если ВыборкаСтрок.НомерСтроки = КоличествоСтрок Тогда
					Массив = Новый Массив;
					Массив.Добавить(ОбластьСтрока);
					Массив.Добавить(ОбластьИтог);
					Массив.Добавить(ОбластьПодвал);
					Если НЕ ТабличныйДокумент.ПроверитьВывод(Массив) Тогда
						ПереводСтраницы = Истина;
					КонецЕсли;
				ИначеЕсли НЕ ТабличныйДокумент.ПроверитьВывод(ОбластьСтрока) Тогда
					ПереводСтраницы = Истина;
				КонецЕсли;
				
				Если ПереводСтраницы Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;

				ТабличныйДокумент.Вывести(ОбластьСтрока);

				ИтогоЗатребовано = ИтогоЗатребовано + ВыборкаСтрок.пЗатребовано;
				ИтогоКоличество = ИтогоКоличество + ВыборкаСтрок.пКоличество;
				ИтогоСумма = ИтогоСумма + СтруктураОбластьСтрока.пСумма;
				
			КонецЦикла;
			
		КонецЕсли;
		
		СтруктураОбластьИтог = Новый Структура;
		СтруктураОбластьИтог.Вставить("пЗатребованоИтог", ИтогоЗатребовано);
		СтруктураОбластьИтог.Вставить("пКоличествоИтог", ИтогоКоличество);
		СтруктураОбластьИтог.Вставить("пСуммаИтог", ИтогоСумма);
		
		ОбластьИтог.Параметры.Заполнить(СтруктураОбластьИтог);
		
		ТабличныйДокумент.Вывести(ОбластьИтог);
		
		// вывод подвала
		СтруктураОбластьПодвал = Новый Структура;
		СтруктураОбластьПодвал.Вставить("пФиоМолПолучатель"			, "");
		СтруктураОбластьПодвал.Вставить("пДолжностьМол"				, "");
		СтруктураОбластьПодвал.Вставить("пФиоМол"					, "");
		СтруктураОбластьПодвал.Вставить("ПериодЖурнала"				, "");
		СтруктураОбластьПодвал.Вставить("пДолжностьМолПолучатель"	, "");
		СтруктураОбластьПодвал.Вставить("ФИООтвИсполнитель"			, "");
		СтруктураОбластьПодвал.Вставить("ДолжностьОтвИсполнитель"	, "");
		СтруктураОбластьПодвал.Вставить("ДолжностьИсполнитель"		, "");
		СтруктураОбластьПодвал.Вставить("ФИОИсполнитель"			, "");
		СтруктураОбластьПодвал.Вставить("ТелефонОтвИсполнитель"		, "");
		СтруктураОбластьПодвал.Вставить("ЭлАдресОтвИсполнитель"		, "");

		Если ЗначениеЗаполнено(ВыборкаДокументов.МолОтправитель) Тогда
			ДанныеСотрудника = Новый Структура("Фамилия, Имя, Отчество, Должность");
			ДанныеСотрудника.Вставить("СсылкаНаОбъект",	ВыборкаДокументов.МолОтправитель);
			ДанныеСотрудника.Вставить("Период",			ВыборкаДокументов.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураОбластьПодвал.пДолжностьМол	= ДанныеСотрудника.Должность;
			СтруктураОбластьПодвал.пФиоМол			= КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДокументов.МолПолучатель) Тогда
			ДанныеСотрудника = Новый Структура("Фамилия, Имя, Отчество, Должность");
			ДанныеСотрудника.Вставить("СсылкаНаОбъект",	ВыборкаДокументов.МолПолучатель);
			ДанныеСотрудника.Вставить("Период",			ВыборкаДокументов.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураОбластьПодвал.пДолжностьМолПолучатель = ДанныеСотрудника.Должность;
			СтруктураОбластьПодвал.пФиоМолПолучатель = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		КонецЕсли;
		
		Если ЕстьПолеОтветственныйИсполнитель Тогда
			ДанныеСотрудника = Новый Структура("Фамилия, Имя, Отчество, Должность");
			ДанныеСотрудника.Вставить("СсылкаНаОбъект",	ВыборкаДокументов.ОтветственныйИсполнитель);
			ДанныеСотрудника.Вставить("Период",			ВыборкаДокументов.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина, Истина);
			СтруктураОбластьПодвал.ФИООтвИсполнитель = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
			СтруктураОбластьПодвал.ДолжностьОтвИсполнитель = ДанныеСотрудника.Должность;
			СтруктураОбластьПодвал.ТелефонОтвИсполнитель = ДанныеСотрудника.ТелефонРабочийФизическиеЛица;
			СтруктураОбластьПодвал.ЭлАдресОтвИсполнитель = ДанныеСотрудника.EmailФизическиеЛица;
		КонецЕсли;
		
		Если ЕстьЖурналОпераций Тогда
			ПериодЖурнала = Формат(ВыборкаДокументов.Дата, "ДФ='MMMM yyyy'");
			Если ЕстьПолеОтветственныйИсполнительБух И ЗначениеЗаполнено(ВыборкаДокументов.ОтветственныйИсполнительБух) Тогда
				ДанныеСотрудника = Справочники.Сотрудники.ДанныеСотрудника(ВыборкаДокументов.ОтветственныйИсполнительБух, "Фамилия, Имя, Отчество, Должность", ВыборкаДокументов.Дата);
				СтруктураОбластьПодвал.ФИОИсполнитель = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
				СтруктураОбластьПодвал.ДолжностьИсполнитель = ДанныеСотрудника.Должность;
			ИначеЕсли ЕстьПолеОтветственный И ЗначениеЗаполнено(ВыборкаДокументов.Ответственный) Тогда
				Исполнитель = ЗаполнениеРеквизитовОбъектов.ПолучитьОтветственногоИсполнителя(ВыборкаДокументов.Ответственный, ВыборкаДокументов.Организация);
				СтруктураОбластьПодвал.ФИОИсполнитель = Справочники.Сотрудники.ФамилияИО(Исполнитель, Истина, ВыборкаДокументов.Дата);
				СтруктураОбластьПодвал.ДолжностьИсполнитель = Справочники.Сотрудники.ПолучитьСвойствоСотрудника(Исполнитель, "Должность", ВыборкаДокументов.Дата);
			КонецЕсли;	
		Иначе
			ПериодЖурнала = "_____________";
		КонецЕсли;
		
		СтруктураОбластьПодвал.ПериодЖурнала = ПериодЖурнала; 
		
		ОбластьПодвал.Параметры.Заполнить(СтруктураОбластьПодвал);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Представление номеров БСО, описанное в приказе 61н.
// Номера разделяются знаком "//". Если конечный номер равен начальному, то конечный номер заменяется знаком "-".
// 
// Параметры:
//  НачальныйНомер - Строка
//  КонечныйНомер - Строка
// 
// Возвращаемое значение:
//  Строка - Строка вида НачальныйНомерБСО//КонечныйНомерБСО
Функция ПредставлениеНомеровБСОПоПриказу61н(НачальныйНомер, КонечныйНомер) Экспорт
	ПредставлениеНомеров = "";
	Если ЗначениеЗаполнено(НачальныйНомер) Тогда
		Если НачальныйНомер = КонечныйНомер Тогда
			НомерКонечный = "-";
		Иначе
			НомерКонечный = КонечныйНомер;
		КонецЕсли;
		ПредставлениеНомеров = СтрШаблон("%1//%2", НачальныйНомер, НомерКонечный);
	КонецЕсли;
	Возврат ПредставлениеНомеров;
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъединяемыеКолонкиАктаОбУтилизации0510435_11()
	Результат = НовыйОбъединяемыеКолонки();
	
	// Наименование
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 1;
	Строка.КонечнаяКолонка = 7;
	
	// Инвентарный номер
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 8;
	Строка.КонечнаяКолонка = 12;
	
	// Код строки
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 13;
	Строка.КонечнаяКолонка = 14;
	
	// Стоимость
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 15;
	Строка.КонечнаяКолонка = 18;
	
	// Наименование документа
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 19;
	Строка.КонечнаяКолонка = 22;
	
	// Дата документа
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 23;
	Строка.КонечнаяКолонка = 24;
	
	// Номер документа
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 25;
	Строка.КонечнаяКолонка = 27;

	Возврат Результат;	
КонецФункции

Функция ОбъединяемыеКолонкиАктаОбУтилизации0510435_12()
	Результат = НовыйОбъединяемыеКолонки();
	
	// Наименование
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 1;
	Строка.КонечнаяКолонка = 4;
	
	// Номенклатурный номер
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 5;
	Строка.КонечнаяКолонка = 7;
	
	// Код строки
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 8;
	Строка.КонечнаяКолонка = 9;
	
	// Наименование ЕИ
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 10;
	Строка.КонечнаяКолонка = 11;
	
	// Код ЕИ
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 12;
	Строка.КонечнаяКолонка = 13;
	
	// Количество
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 14;
	Строка.КонечнаяКолонка = 15;
	
	// Сумма
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 16;
	Строка.КонечнаяКолонка = 18;
	
	// Наименование документа
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 19;
	Строка.КонечнаяКолонка = 22;
	
	// Дата документа
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 23;
	Строка.КонечнаяКолонка = 24;
	
	// Номер документа
	Строка = Результат.Добавить();
	Строка.НачальнаяКолонка = 25;
	Строка.КонечнаяКолонка = 27;
	
	Возврат Результат;
		
КонецФункции

Функция НовыйОбъединяемыеКолонки()
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НачальнаяКолонка", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("КонечнаяКолонка", Новый ОписаниеТипов("Число"));
	Возврат Результат;
КонецФункции 

// Сопоставить движения со строками табличной части строго.
// 
// Параметры:
//  Параметры - см. СопоставитьДвиженияСоСтрокамиТабличнойЧасти_Параметры
//  НеобработанныеСтроки - Массив из СтрокаТаблицыЗначений - Необработанные строки
Процедура СопоставитьДвиженияСоСтрокамиТабличнойЧастиСтрого(Параметры, НеобработанныеСтроки)
	ВыборкаМатериалы = Параметры.ВыборкаМатериалы;
	ТаблицаДвижений = Параметры.ТаблицаДвижений;
	СтруктураОтбора = ОбщегоНазначения.СкопироватьРекурсивно(Параметры.СоответствиеКолонок);
	СтруктураОтбора.Вставить("НомерСтрокиДокумента", 0);
	Пока ВыборкаМатериалы.Следующий() Цикл
		Если Параметры.Свойство("Ссылка") И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаМатериалы, "Ссылка")
			И Параметры.Ссылка <> ВыборкаМатериалы.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ИменаКолонок Из Параметры.СоответствиеКолонок Цикл
			СтруктураОтбора[ИменаКолонок.Ключ] = ВыборкаМатериалы[ИменаКолонок.Значение];
		КонецЦикла;
		Если ЗначениеЗаполнено(Параметры.ИмяКолонкиКЭК)
			И СтруктураОтбора.Свойство(Параметры.ИмяКолонкиКЭК)
			И НЕ ЗначениеЗаполнено(СтруктураОтбора[Параметры.ИмяКолонкиКЭК]) Тогда
			
			Номенклатура = ВыборкаМатериалы[Параметры.ИмяКолонкиНоменклатура]; // СправочникСсылка.Номенклатура
			Если Параметры.ТипНоменклатурыВТаблице Тогда
				ТипНоменклатуры = ВыборкаМатериалы.ТипНоменклатуры;
			Иначе
				ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ТипНоменклатуры");
			КонецЕсли;
			Если Параметры.КФОВТаблице Тогда
				КФО = ВыборкаМатериалы.КФО;
			Иначе
				КФО = Параметры.КФО;
			КонецЕсли;
			СтруктураОтбора[Параметры.ИмяКолонкиКЭК] =  БухгалтерскийУчет.КЭКНоменклатуры(
				Параметры.Организация,
				Параметры.ИФО,
				КФО,
				Параметры.Дата,
				ВыборкаМатериалы.СчетУчета,
				ТипНоменклатуры,
				"Кт");
		КонецЕсли;
		ТекущиеДвижения = ТаблицаДвижений.НайтиСтроки(СтруктураОтбора);
		Если ТекущиеДвижения.Количество() > 0 И НЕ ЕстьДвиженияБезКоличества(ТаблицаДвижений) Тогда
			ТекущиеДвижения[0].НомерСтрокиДокумента = ВыборкаМатериалы.НомерСтроки;
		Иначе
			НеобработанныеСтроки.Добавить(ВыборкаМатериалы.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьДвиженияБезКоличества(ТаблицаДвижений)
	Для Каждого Строка Из ТаблицаДвижений Цикл
		Если Строка.Количество = 0 И Строка.Сумма <> 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Процедура СопоставитьДвиженияСоСтрокамиТабличнойЧастиБезУчетаДопСубконто(Параметры, НеобработанныеСтроки)
	ВыборкаМатериалы = Параметры.ВыборкаМатериалы;
	ТаблицаДвижений = Параметры.ТаблицаДвижений;
	НесоотнесенныеДвижения = ТаблицаДвижений.НайтиСтроки(Новый Структура("НомерСтрокиДокумента", 0));
	КопияТаблицыДвижений = ТаблицаДвижений.Скопировать(НесоотнесенныеДвижения);

	КолонкиСвертки = Новый Массив;
	СуммируемыеКолонки = Новый Структура(Параметры.ИменаСуммируемыхКолонок);
	КолонкаДопСубконто = Новый Структура("ДопСубконто");
	Для Каждого КолонкаТаблицы Из КопияТаблицыДвижений.Колонки Цикл
		Если Не СуммируемыеКолонки.Свойство(КолонкаТаблицы.Имя)
			И Не КолонкаДопСубконто.Свойство(КолонкаТаблицы.Имя) Тогда
			КолонкиСвертки.Добавить(КолонкаТаблицы.Имя);
		КонецЕсли;
	КонецЦикла;
	
	КопияТаблицыДвижений.Свернуть(СтрСоединить(КолонкиСвертки, ","), Параметры.ИменаСуммируемыхКолонок);

	СтруктураОтбора = ОбщегоНазначения.СкопироватьРекурсивно(Параметры.СоответствиеКолонокУпрощенное);
	СтруктураОтбораДоп = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураОтбора);
	СтруктураОтбораДоп.Вставить("НомерСтрокиДокумента", 0);
	ВыборкаМатериалы.Сбросить();
	Пока ВыборкаМатериалы.Следующий() Цикл
		Если Параметры.Свойство("Ссылка") И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаМатериалы, "Ссылка")
			И Параметры.Ссылка <> ВыборкаМатериалы.Ссылка Тогда
			Продолжить;
		КонецЕсли;
		Если НеобработанныеСтроки.Найти(ВыборкаМатериалы.НомерСтроки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ИменаКолонок Из Параметры.СоответствиеКолонокУпрощенное Цикл
			СтруктураОтбора[ИменаКолонок.Ключ] = ВыборкаМатериалы[ИменаКолонок.Значение];
		КонецЦикла;

		ТекущиеДвижения = КопияТаблицыДвижений.НайтиСтроки(СтруктураОтбора);
		Если ТекущиеДвижения.Количество() > 0 Тогда
			ТекущееДвижение = ТекущиеДвижения[0];
			
			Если ВыборкаМатериалы.Количество = ТекущееДвижение.Количество Тогда
				Сумма = ТекущееДвижение.Сумма;
			ИначеЕсли ВыборкаМатериалы.Количество < ТекущееДвижение.Количество Тогда
				Если ТекущееДвижение.Количество <> 0 Тогда
					Сумма = Окр(ВыборкаМатериалы.Количество * ТекущееДвижение.Сумма / ТекущееДвижение.Количество, 2);
				Иначе
					Сумма = 0;
				КонецЕсли;
			Иначе
				Сумма = 0;
			КонецЕсли;
			
			УчтенноеКоличество = Мин(ТекущееДвижение.Количество, ВыборкаМатериалы.Количество);
			ТекущееДвижение.Количество = ТекущееДвижение.Количество - УчтенноеКоличество;
			ТекущееДвижение.Сумма = ТекущееДвижение.Сумма - Сумма;
			
			НоваяСтрокаДвижения = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДвижения, ТекущееДвижение);
			НоваяСтрокаДвижения.Количество = УчтенноеКоличество;
			НоваяСтрокаДвижения.Сумма = Сумма;
			НоваяСтрокаДвижения.НомерСтрокиДокумента = ВыборкаМатериалы.НомерСтроки;
			
			// В исходной таблице нужно уменьшить остаток на учетнное количество
			
			УдаляемыеСтроки = Новый Массив;
			
			КоличествоВсего = УчтенноеКоличество;
			СуммаВсего = Сумма;
			
			ЗаполнитьЗначенияСвойств(СтруктураОтбораДоп, СтруктураОтбора);
			СтрокиИсходнойТаблицы = ТаблицаДвижений.НайтиСтроки(СтруктураОтбораДоп);
			Для каждого СтрокаИсходной Из СтрокиИсходнойТаблицы Цикл
			
				ВычитаемоеКоличество = Мин(СтрокаИсходной.Количество, УчтенноеКоличество);
				ВычитаемаяСумма = Мин(СтрокаИсходной.Сумма, Сумма);
				
				СтрокаИсходной.Количество = СтрокаИсходной.Количество - ВычитаемоеКоличество;
				СтрокаИсходной.Сумма = СтрокаИсходной.Сумма - ВычитаемаяСумма;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаИсходной, "КоличествоОстаток") Тогда
					СтрокаИсходной.КоличествоОстаток = СтрокаИсходной.КоличествоОстаток - ВычитаемоеКоличество;
					СтрокаИсходной.СуммаОстаток = СтрокаИсходной.СуммаОстаток - ВычитаемаяСумма;
				КонецЕсли;
				
				КоличествоВсего = КоличествоВсего - ВычитаемоеКоличество;
				СуммаВсего = СуммаВсего - ВычитаемаяСумма;
				
				Если СтрокаИсходной.Количество = 0 Тогда
					УдаляемыеСтроки.Добавить(СтрокаИсходной);
				КонецЕсли;
				
			КонецЦикла;
			
			Для каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
				ТаблицаДвижений.Удалить(УдаляемаяСтрока);
			КонецЦикла;
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Функция ФормаПринадлежитОбъекту(ИмяФормы, ИмяОбъекта)

	СоставИмениФормы = СтрРазделить(ИмяФормы, ".");
	Возврат СоставИмениФормы.Количество() > 1
		И СоставИмениФормы[1] = ИмяОбъекта;

КонецФункции

Функция КартинкаИзФайла(Файл)
	
	ДвоичныеДанные = Неопределено;
	
	Если ЗначениеЗаполнено(Файл) Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Файл, Ложь);
	КонецЕсли;
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Новый Картинка;
	КонецЕсли;
	
	Возврат Новый Картинка(ДвоичныеДанные, Истина);
	
КонецФункции
 
// Используется при печати "Ведомости на выдачу МЗ на нужды учреждения". Выводит подвал страницы.
// 
Процедура ВывестиПодвалВедомостиНаВыдачу(ТабличныйДокумент, ОблИтого, Документ, ДвиженияМатериалов,МассивТМЦ,
		МассивКоличествНаСтранице,ИндексСтраницы)
		
	ТипЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(15,3);
	
	ПараметрыПодвала = Новый Структура;
	Для ИндексИтога = 0 По МассивКоличествНаСтранице.ВГраница() Цикл
		
		ТекущийИтог = МассивКоличествНаСтранице[ИндексИтога];
		ПараметрыПодвала.Вставить("ИтогоМатериал" + (ИндексИтога + 1), ТекущийИтог);
		ТекущийИндексТМЦ = (ИндексИтога) + (ИндексСтраницы - 1) * 10;
		Если ТекущийИндексТМЦ <= МассивТМЦ.ВГраница() Тогда
			ТекущийМатериал = МассивТМЦ.Получить(ТекущийИндексТМЦ);
			СтрокиИтогТМЦ = ДвиженияМатериалов.НайтиСтроки(
				Новый Структура("Ссылка, Номенклатура", Документ, ТекущийМатериал));
			Если СтрокиИтогТМЦ.Количество() > 0 Тогда
				
				ИтогоКоличествоТМЦ = ТипЧисло.ПривестиЗначение(СтрокиИтогТМЦ[0].Количество);
				ИтогоСуммаТМЦ = СтрокиИтогТМЦ[0].Сумма;
				Если ИтогоКоличествоТМЦ <> 0 Тогда
					ПараметрыПодвала.Вставить("СуммаМатериал" + (ИндексИтога + 1),
						Окр(ИтогоСуммаТМЦ * ТекущийИтог / ИтогоКоличествоТМЦ, 2));
				КонецЕсли;
				ПараметрыПодвала.Вставить("ЦенаМатериал" + (ИндексИтога + 1),
						СтрокиИтогТМЦ[0].Цена);
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ОчиститьПараметрыОбласти(ОблИтого);
	ОблИтого.Параметры.Заполнить(ПараметрыПодвала);
	ТабличныйДокумент.Вывести(ОблИтого);
	
	Для ИндексИтога = 0 По МассивКоличествНаСтранице.ВГраница() Цикл
		МассивКоличествНаСтранице[ИндексИтога] = 0;
	КонецЦикла;
КонецПроцедуры

Процедура ВывестиРазделы1и2в0504101(ТабличныйДокумент, Макет, ВыборкаДокументов, ВыборкаОС,
	Данные, НомерСтраницы)
	
	Раздел1_Шапка		= Макет.ПолучитьОбласть("Раздел1_Шапка");
	Раздел1_Строка		= Макет.ПолучитьОбласть("Раздел1_Строка");
	Раздел1_Подвал		= Макет.ПолучитьОбласть("Раздел1_Подвал");
	Раздел1_Отступ		= Макет.ПолучитьОбласть("Раздел1_Отступ");
	
	Раздел2_Шапка		= Макет.ПолучитьОбласть("Раздел2_Шапка");
	Раздел2_Строка		= Макет.ПолучитьОбласть("Раздел2_Строка");
	Область_НачалоСтр	= Макет.ПолучитьОбласть("НачалоСтраницы");
	
	ТаблицаХарактеристик = Данные.ТаблицаХарактеристики.СкопироватьКолонки();
	ТаблицаХарактеристик.Колонки.Добавить("НомерСтроки");
	
	ТабличныйДокумент.Вывести(Раздел1_Шапка);
	
	СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
	Количество			= 0;
	Сумма				= 0;
	СуммаАмортизации	= 0;
	
	ВыборкаОС.Сбросить();
	
	Пока ВыборкаОС.НайтиСледующий(СтруктураПоиска) Цикл
		
		Если ВыборкаДокументов.Передача Тогда
			
			ФактическийСрокЭксплуатации = УправлениеОсновнымиСредствами.РассчитатьМесяцыЭксплуатации(,
				ВыборкаОС.ДатаВводаВЭксплуатацию, ?(ВыборкаДокументов.Принятие,
					ВыборкаДокументов.Дата, ВыборкаДокументов.ДатаСписания));
			ПараметрыСтроки = Новый Структура("СрокЭкспл", ФактическийСрокЭксплуатации);
			Если ВыборкаДокументов.Принятие Тогда
				ПараметрыСтроки.Вставить("ИнвентарныйНомер", "");
			КонецЕсли;
			
			Раздел1_Строка.Параметры.Заполнить(ВыборкаОС);
			Раздел1_Строка.Параметры.Заполнить(ПараметрыСтроки);
			ТабличныйДокумент.Вывести(Раздел1_Строка);
			
			Количество			= Количество		+ ВыборкаОС.Количество;
			Сумма				= Сумма				+ ВыборкаОС.Сумма;
			СуммаАмортизации	= СуммаАмортизации	+ ВыборкаОС.СуммаАмортизации;
			
		КонецЕсли;
		
		Данные.Вставить("МожетСодержатьДрагМатериалы", ВыборкаОС.МожетСодержатьДрагМатериалы);
		Данные.Вставить("ДатаСписания", ВыборкаДокументов.ДатаСписания);
		
		СтруктураПоискаОС = Новый Структура("ОсновноеСредство", ВыборкаОС.ОсновноеСредствоСсылка);
		Справочники.ОсновныеСредства.ЗаполнитьТаблицуДопХарактеристик(
			Данные, СтруктураПоискаОС,, ВыборкаОС.ИнвентарныйНомерСсылка);
		Для НомерСтроки = 1 По Данные.ТаблицаХарактеристики.Количество() Цикл
			СтрокаХар = ТаблицаХарактеристик.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаХар, Данные.ТаблицаХарактеристики[НомерСтроки-1]);
			СтрокаХар.НомерСтроки = Строка(ВыборкаОС.НомерСтроки) + "." + Строка(НомерСтроки);
		КонецЦикла;
		
	КонецЦикла;
	
	Раздел1_Подвал.Параметры.Заполнить(Новый Структура("Количество,Сумма,СуммаАмортизации",Количество,Сумма,СуммаАмортизации));
	ТабличныйДокумент.Вывести(Раздел1_Подвал);
	
	// если отступ между разделами 1 и 2, шапка и одна строка раздела 2 не умещаются,
	// то начинать новый лист
	ОбластиДляПроверки = Новый Массив;
	ОбластиДляПроверки.Добавить(Раздел1_Отступ);
	ОбластиДляПроверки.Добавить(Раздел2_Шапка);
	Если ТаблицаХарактеристик.Количество() > 0 Тогда
		Раздел2_Строка.Параметры.Заполнить(ТаблицаХарактеристик[0]);
		ОбластиДляПроверки.Добавить(Раздел2_Строка);
	КонецЕсли;
	Если ТабличныйДокумент.ПроверитьВывод(ОбластиДляПроверки) Тогда
		ТабличныйДокумент.Вывести(Раздел1_Отступ);
		ТабличныйДокумент.Вывести(Раздел2_Шапка);
	Иначе
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		НомерСтраницы = НомерСтраницы + 1;
		Область_НачалоСтр.Параметры.Заполнить(Новый Структура("НомерСтраницы", НомерСтраницы));
		ТабличныйДокумент.Вывести(Область_НачалоСтр);
		ТабличныйДокумент.Вывести(Раздел2_Шапка);
	КонецЕсли;
	
	Для Каждого СтрокаХарактеристик Из ТаблицаХарактеристик Цикл
		
		Раздел2_Строка.Параметры.Заполнить(СтрокаХарактеристик);
		Если Не ТабличныйДокумент.ПроверитьВывод(Раздел2_Строка) Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			НомерСтраницы = НомерСтраницы + 1;
			Область_НачалоСтр.Параметры.Заполнить(Новый Структура("НомерСтраницы", НомерСтраницы));
			ТабличныйДокумент.Вывести(Область_НачалоСтр);
			ТабличныйДокумент.Вывести(Раздел2_Шапка);
		КонецЕсли;
		ТабличныйДокумент.Вывести(Раздел2_Строка);
		
	КонецЦикла;
	
КонецПроцедуры

// Список счетов с группами второго уровня.
// 
// Возвращаемое значение:
//  Соответствие из Структура:
//   * Группа - ПланСчетовСсылка.ЕПСБУ
//   * Порядок - Строка
//   * Код - Строка
//   * Наименование - Строка
//
Функция ГруппыОбъектовНФА() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ОтображаемыеСчета
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&ВсеСчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.Родитель КАК Родитель,
	|	ЕПСБУ.ЭлементГруппа КАК ЭлементГруппа,
	|	ЕПСБУ.Код КАК Код,
	|	ЕПСБУ.Наименование КАК Наименование,
	|	ЕПСБУ.Порядок КАК Порядок
	|ПОМЕСТИТЬ ПроверяемыеСчетаИзБазы
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В ИЕРАРХИИ(&ВсеСчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ДопустимыеСчета.Ссылка ЕСТЬ NULL
	|			ТОГДА ЕПСБУ.Ссылка
	|		ИНАЧЕ ЕПСБУ.Родитель
	|	КОНЕЦ КАК Родитель,
	|	ЕПСБУ.ЭлементГруппа КАК ЭлементГруппа,
	|	ЕПСБУ.Код КАК Код,
	|	ЕПСБУ.Наименование КАК Наименование,
	|	ЕПСБУ.Порядок КАК Порядок
	|ПОМЕСТИТЬ ПроверяемыеСчетаПервогоУровня
	|ИЗ
	|	ПроверяемыеСчетаИзБазы КАК ЕПСБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроверяемыеСчетаИзБазы КАК ДопустимыеСчета
	|		ПО ЕПСБУ.Родитель = ДопустимыеСчета.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроверяемыеСчета.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ПроверяемыеРодители.Родитель, ПроверяемыеСчета.Родитель) КАК Родитель,
	|	ПроверяемыеСчета.ЭлементГруппа КАК ЭлементГруппа,
	|	ПроверяемыеСчета.Код КАК Код,
	|	ПроверяемыеСчета.Наименование КАК Наименование,
	|	ПроверяемыеСчета.Порядок КАК Порядок
	|ПОМЕСТИТЬ ПроверяемыеСчетаВторогоУровня
	|ИЗ
	|	ПроверяемыеСчетаПервогоУровня КАК ПроверяемыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроверяемыеСчетаПервогоУровня КАК ПроверяемыеРодители
	|		ПО ПроверяемыеСчета.Родитель = ПроверяемыеРодители.Ссылка
	|ГДЕ
	|	НЕ ПроверяемыеСчета.ЭлементГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПроверяемыеСчета.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(ПроверяемыеРодители.Родитель, ПроверяемыеСчета.Родитель) КАК Родитель,
	|	ПроверяемыеСчета.ЭлементГруппа КАК ЭлементГруппа,
	|	ПроверяемыеСчета.Код КАК Код,
	|	ПроверяемыеСчета.Наименование КАК Наименование,
	|	ПроверяемыеСчета.Порядок КАК Порядок
	|ПОМЕСТИТЬ ПроверяемыеСчетаТретьегоУровня
	|ИЗ
	|	ПроверяемыеСчетаВторогоУровня КАК ПроверяемыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроверяемыеСчетаПервогоУровня КАК ПроверяемыеРодители
	|		ПО ПроверяемыеСчета.Родитель = ПроверяемыеРодители.Ссылка
	|ГДЕ
	|	НЕ ПроверяемыеСчета.ЭлементГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПроверяемыеРодители.Код, ПроверяемыеСчета.Код) КАК Код,
	|	ЕСТЬNULL(ПроверяемыеРодители.Наименование, ПроверяемыеСчета.Наименование) КАК Наименование,
	|	ПроверяемыеСчета.Ссылка КАК Ссылка,
	|	ПроверяемыеСчета.Родитель КАК Группа,
	|	ЕСТЬNULL(ПроверяемыеРодители.Порядок, ПроверяемыеСчета.Порядок) КАК Порядок
	|ИЗ
	|	ПроверяемыеСчетаТретьегоУровня КАК ПроверяемыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроверяемыеСчетаПервогоУровня КАК ПроверяемыеРодители
	|		ПО ПроверяемыеСчета.Родитель = ПроверяемыеРодители.Ссылка
	|ГДЕ
	|	НЕ ПроверяемыеСчета.ЭлементГруппа";
	
	КодыСчетов =
	"101.10,
	|101.20,
	|101.30,
	|101.90,
	|103.10,
	|103.30,
	|103.90,
	|105.20,
	|105.30,
	|105.40,
	|106.10,
	|106.20,
	|106.30,
	|106.40,
	|106.50,
	|106.60,
	|106.90,
	|108.56,
	|108.57,
	|111.40,
	|111.60,
	|113.20,
	|113.30,
	|02.11,
	|02.21,
	|02.22,
	|02.23,
	|02.3,
	|02.31,
	|02.32,
	|02.4,
	|02.51,
	|02.52,
	|02.53,
	|02.6,
	|03,
	|07,
	|08,
	|09,
	|12,
	|13,
	|22.1,
	|22.2,
	|22.3,
	|23,
	|27.01,
	|02.33,
	|27.02";
	
	СчетаДляЗапроса = БухгалтерскийУчет.СписокСчетов(КодыСчетов, , Истина);
	Запрос.УстановитьПараметр("ВсеСчета", СчетаДляЗапроса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ДанныеГруппы = Новый Структура;
		ДанныеГруппы.Вставить("Группа", Выборка.Группа);
		ДанныеГруппы.Вставить("Порядок", Выборка.Порядок);
		ДанныеГруппы.Вставить("Код", Выборка.Код);
		ДанныеГруппы.Вставить("Наименование", Выборка.Наименование);
		Результат.Вставить(Выборка.Ссылка, ДанныеГруппы);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапросаВТДвиженийДляТребованияНакладнойМЗ()

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БСО)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.БСО)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БСО)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.БСО)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БСО)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.БСО)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1
	|			НЕ В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыЗатрат),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БСО)
	|			)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1, НЕОПРЕДЕЛЕНО)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2
	|			НЕ В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыЗатрат),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БСО)
	|			)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2, НЕОПРЕДЕЛЕНО)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3
	|			НЕ В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыЗатрат),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БСО)
	|			)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДопСубконто,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК Счет,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт) КАК Количество,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТДвиженияДокументов
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор В (&МассивОбъектов)
	|				И СчетКт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)),
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БСО)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.БСО)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БСО)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.БСО)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БСО)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.БСО)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1
	|			НЕ В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыЗатрат),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БСО))
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1, НЕОПРЕДЕЛЕНО)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2
	|			НЕ В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыЗатрат),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БСО))
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2, НЕОПРЕДЕЛЕНО)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3
	|			НЕ В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыЗатрат),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии),
	|				  ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.БСО))
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ";

КонецФункции

Функция ТекстЗапросаВТСчетаДляТребованияНакладнойМЗ()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТребованиеНакладная0315006Материалы.СчетУчета КАК Счет,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕПСБУВидыСубконто.ВидСубконто <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|					И ЕПСБУВидыСубконто.ВидСубконто <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|					И ЕПСБУВидыСубконто.ВидСубконто <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ВидыЗатрат)
	|					И ЕПСБУВидыСубконто.ВидСубконто <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии)
	|				ТОГДА ИСТИНА
	|			КОГДА ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии)
	|					И ЕПСБУВидыСубконто.Обязательный
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьДопСубконто
	|ПОМЕСТИТЬ ВТСчета
	|ИЗ
	|	Документ.ТребованиеНакладная0315006.Материалы КАК ТребованиеНакладная0315006Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО (ТребованиеНакладная0315006Материалы.СчетУчета = ЕПСБУВидыСубконто.Ссылка)
	|ГДЕ
	|	ТребованиеНакладная0315006Материалы.Ссылка В (&МассивОбъектов)
	|СГРУППИРОВАТЬ ПО
	|	ТребованиеНакладная0315006Материалы.СчетУчета
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВнутреннееПеремещениеБСО.СчетУчета,
	|	Ложь
	|ИЗ
	|	Документ.ВнутреннееПеремещениеБСО КАК ВнутреннееПеремещениеБСО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|		ПО (ВнутреннееПеремещениеБСО.СчетУчета = ЕПСБУВидыСубконто.Ссылка)
	|ГДЕ
	|	ВнутреннееПеремещениеБСО.Ссылка В (&МассивОбъектов)";
	
КонецФункции

Функция ТекстЗапросаВТТребованиеНакладнаяМатериалы()
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТребованиеНакладная0315006Материалы.Ссылка КАК Ссылка,
	|	ТребованиеНакладная0315006Материалы.НомерСтроки КАК НомерСтроки,
	|	ТребованиеНакладная0315006Материалы.Номенклатура КАК Номенклатура,
	|	ТребованиеНакладная0315006Материалы.Количество КАК Количество,
	|	ТребованиеНакладная0315006Материалы.ЦенаПередачи КАК ЦенаПередачи,
	|	ТребованиеНакладная0315006Материалы.СуммаПередачи КАК СуммаПередачи,
	|	ТребованиеНакладная0315006Материалы.Примечание КАК Примечание,
	|	ТребованиеНакладная0315006Материалы.СчетУчета КАК СчетУчета,
	|	ТребованиеНакладная0315006Материалы.КПС КАК КПС,
	|	ТребованиеНакладная0315006Материалы.КФО КАК КФО,
	|	ТребованиеНакладная0315006Материалы.ДополнительнаяАналитикаСчета КАК ДополнительнаяАналитикаСчета,
	|	ТребованиеНакладная0315006Материалы.ДвиженияДокументовСумма КАК ДвиженияДокументовСумма,
	|	ТребованиеНакладная0315006Материалы.ДвиженияДокументовКоличество КАК ДвиженияДокументовКоличество,
	|	NULL КАК НомерНачальный,
	|	NULL КАК НомерКонечный,
	|	NULL КАК СерияБСО
	|ПОМЕСТИТЬ ТребованиеНакладная0315006Материалы
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТребованиеНакладная0315006Материалы.Ссылка КАК Ссылка,
	|		ТребованиеНакладная0315006Материалы.НомерСтроки КАК НомерСтроки,
	|		ТребованиеНакладная0315006Материалы.Номенклатура КАК Номенклатура,
	|		ТребованиеНакладная0315006Материалы.Количество КАК Количество,
	|		ТребованиеНакладная0315006Материалы.ЦенаПередачи КАК ЦенаПередачи,
	|		ТребованиеНакладная0315006Материалы.СуммаПередачи КАК СуммаПередачи,
	|		ТребованиеНакладная0315006Материалы.Примечание КАК Примечание,
	|		ТребованиеНакладная0315006Материалы.СчетУчета КАК СчетУчета,
	|		ТребованиеНакладная0315006Материалы.КПС КАК КПС,
	|		ТребованиеНакладная0315006Материалы.КФО КАК КФО,
	|		ТребованиеНакладная0315006Материалы.ДополнительнаяАналитикаСчета КАК ДополнительнаяАналитикаСчета,
	|		ВТДвиженияДокументов.Сумма КАК ДвиженияДокументовСумма,
	|		ВТДвиженияДокументов.Количество КАК ДвиженияДокументовКоличество
	|	ИЗ
	|		Документ.ТребованиеНакладная0315006.Материалы КАК ТребованиеНакладная0315006Материалы
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияДокументов КАК ВТДвиженияДокументов
	|			ПО ТребованиеНакладная0315006Материалы.Ссылка = ВТДвиженияДокументов.Регистратор
	|			И ТребованиеНакладная0315006Материалы.Номенклатура = ВТДвиженияДокументов.Номенклатура
	|			И ТребованиеНакладная0315006Материалы.СчетУчета = ВТДвиженияДокументов.Счет
	|			И ТребованиеНакладная0315006Материалы.КПС = ВТДвиженияДокументов.КПС
	|			И ТребованиеНакладная0315006Материалы.КФО = ВТДвиженияДокументов.КФО
	|			И ТребованиеНакладная0315006Материалы.ДополнительнаяАналитикаСчета = ВТДвиженияДокументов.ДопСубконто
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСчета КАК ВТСчета
	|			ПО ТребованиеНакладная0315006Материалы.СчетУчета = ВТСчета.Счет
	|	ГДЕ
	|		ТребованиеНакладная0315006Материалы.Ссылка В (&МассивОбъектов)
	|		И ВТСчета.ЕстьДопСубконто
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТребованиеНакладная0315006Материалы.Ссылка КАК Ссылка,
	|		ТребованиеНакладная0315006Материалы.НомерСтроки КАК НомерСтроки,
	|		ТребованиеНакладная0315006Материалы.Номенклатура КАК Номенклатура,
	|		ТребованиеНакладная0315006Материалы.Количество КАК Количество,
	|		ТребованиеНакладная0315006Материалы.ЦенаПередачи КАК ЦенаПередачи,
	|		ТребованиеНакладная0315006Материалы.СуммаПередачи КАК СуммаПередачи,
	|		ТребованиеНакладная0315006Материалы.Примечание КАК Примечание,
	|		ТребованиеНакладная0315006Материалы.СчетУчета КАК СчетУчета,
	|		ТребованиеНакладная0315006Материалы.КПС КАК КПС,
	|		ТребованиеНакладная0315006Материалы.КФО КАК КФО,
	|		ТребованиеНакладная0315006Материалы.ДополнительнаяАналитикаСчета КАК ДополнительнаяАналитикаСчета,
	|		ВТДвиженияДокументов.Сумма КАК ДвиженияДокументовСумма,
	|		ВТДвиженияДокументов.Количество КАК ДвиженияДокументовКоличество
	|	ИЗ
	|		Документ.ТребованиеНакладная0315006.Материалы КАК ТребованиеНакладная0315006Материалы
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияДокументов КАК ВТДвиженияДокументов
	|			ПО ТребованиеНакладная0315006Материалы.Ссылка = ВТДвиженияДокументов.Регистратор
	|			И ТребованиеНакладная0315006Материалы.Номенклатура = ВТДвиженияДокументов.Номенклатура
	|			И ТребованиеНакладная0315006Материалы.СчетУчета = ВТДвиженияДокументов.Счет
	|			И ТребованиеНакладная0315006Материалы.КПС = ВТДвиженияДокументов.КПС
	|			И ТребованиеНакладная0315006Материалы.КФО = ВТДвиженияДокументов.КФО
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСчета КАК ВТСчета
	|			ПО ТребованиеНакладная0315006Материалы.СчетУчета = ВТСчета.Счет
	|	ГДЕ
	|		ТребованиеНакладная0315006Материалы.Ссылка В (&МассивОбъектов)
	|		И НЕ ВТСчета.ЕстьДопСубконто) КАК ТребованиеНакладная0315006Материалы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВнутреннееПеремещениеБСОСоставБСО.Ссылка,
	|	ВнутреннееПеремещениеБСОСоставБСО.НомерСтроки,
	|	ВнутреннееПеремещениеБСОСоставБСО.БСО,
	|	ВнутреннееПеремещениеБСОСоставБСО.Количество,
	|	1,
	|	ВнутреннееПеремещениеБСОСоставБСО.Количество,
	|	ВнутреннееПеремещениеБСОСоставБСО.Примечание,
	|	ВнутреннееПеремещениеБСОСоставБСО.Ссылка.СчетУчета,
	|	NULL,
	|	ВнутреннееПеремещениеБСОСоставБСО.Ссылка.КФО,
	|	НЕОПРЕДЕЛЕНО,
	|	ВнутреннееПеремещениеБСОСоставБСО.Количество,
	|	ВнутреннееПеремещениеБСОСоставБСО.Количество,
	|	ВнутреннееПеремещениеБСОСоставБСО.НомерНачальный,
	|	ВнутреннееПеремещениеБСОСоставБСО.НомерКонечный,
	|	ВнутреннееПеремещениеБСОСоставБСО.СерияБСО
	|ИЗ
	|	Документ.ВнутреннееПеремещениеБСО.СоставБСО КАК ВнутреннееПеремещениеБСОСоставБСО
	|ГДЕ
	|	ВнутреннееПеремещениеБСОСоставБСО.Ссылка В (&МассивОбъектов)";
	
КонецФункции

Функция ДанныеДляПечати0504101(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ВидыОперацийПередачиОС = Новый Массив;
	ВидыОперацийПередачиОС.Добавить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСвУправление"));
	ВидыОперацийПередачиОС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСАренда"));
	ВидыОперацийПередачиОС.Добавить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСвПользование"));
	ВидыОперацийПередачиОС.Добавить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСОперУчетВУправление"));
	ВидыОперацийПередачиОС.Добавить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСОперУчетАренда"));
	ВидыОперацийПередачиОС.Добавить(
		ПредопределенноеЗначение("Перечисление.ВидыОперацийПередачиОС.ПередачаОСОперУчетВПользование"));
	Запрос.УстановитьПараметр("ВидыОперацийПередачиОС", ВидыОперацийПередачиОС);
	
	ВидыОперацийИК = Новый Массив;
	ВидыОперацийИК.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ПередачаУправление"));
	ВидыОперацийИК.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ПередачаАренда"));
	ВидыОперацийИК.Добавить(ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ПередачаБезмозмездноеПользование"));
	Запрос.УстановитьПараметр("ВидыОперацийИК", ВидыОперацийИК);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	Документ.Организация КАК Организация,
	|	Документ.Подразделение КАК Подразделение,
	|	Документ.ЦМО КАК ЦМО,
	|	Документ.Контрагент КАК Контрагент,
	|	Документ.ВидИмущества КАК ВидИмущества,
	|	Документ.ОснованиеДляАкта КАК ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	|	Документ.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	|	Документ.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	|	Документ.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	|	Документ.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	|	Документ.НаименованиеПриказа КАК НаименованиеПриказа,
	|	Документ.НомерПриказа КАК НомерПриказа,
	|	Документ.ДатаПриказа КАК ДатаПриказа,
	|	Документ.ВалютаПоступления КАК ВалютаПоступления,
	|	Документ.ЗаключениеКомиссии КАК ЗаключениеКомиссии,
	|	Документ.ИнвКарточкиШтук КАК ИнвКарточкиШтук,
	|	Документ.ИнвКарточкиЛистов КАК ИнвКарточкиЛистов,
	|	Документ.Приложение КАК Приложение,
	|	ИСТИНА КАК Принятие,
	|	ВЫБОР
	|		КОГДА Документ.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение)
	|				ИЛИ Документ.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Передача,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаСписания,
	|	Документ.Ответственный КАК Ответственный,
	|	Документ.Руководитель КАК Руководитель
	|ПОМЕСТИТЬ Документ
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Номер,
	|	Документ.Дата,
	|	Документ.Организация,
	|	Документ.Подразделение,
	|	Документ.ЦМО,
	|	Документ.Контрагент,
	|	Документ.ВидИмущества,
	|	Документ.ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта,
	|	Документ.ДолжностьПредседателяКомиссии,
	|	Документ.ФамилияПредседателяКомиссии,
	|	Документ.ИмяПредседателяКомиссии,
	|	Документ.ОтчествоПредседателяКомиссии,
	|	"""",
	|	Документ.НомерПриказа,
	|	Документ.ДатаПриказа,
	|	Документ.ВалютаПоступления,
	|	Документ.ЗаключениеКомиссии,
	|	Документ.ИнвКарточкиШтук,
	|	Документ.ИнвКарточкиЛистов,
	|	Документ.Приложение,
	|	ИСТИНА,
	|	ВЫБОР
	|		КОГДА Документ.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ПринятиеКУчетуИзготовление)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	Документ.Ответственный,
	|	Документ.Руководитель
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовИК КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ1.Ссылка,
	|	Документ1.Номер,
	|	Документ1.Дата,
	|	Документ1.Организация,
	|	Документ1.Подразделение,
	|	Документ1.ЦМО,
	|	Документ1.Контрагент,
	|	Документ1.ВидИмущества,
	|	Документ1.ОснованиеДляАкта,
	|	Документ1.НомерОснованияДляАкта,
	|	Документ1.ДатаОснованияДляАкта,
	|	Документ1.ДолжностьПредседателяКомиссии,
	|	Документ1.ФамилияПредседателяКомиссии,
	|	Документ1.ИмяПредседателяКомиссии,
	|	Документ1.ОтчествоПредседателяКомиссии,
	|	Документ1.НаименованиеПриказа,
	|	Документ1.НомерПриказа,
	|	Документ1.ДатаПриказа,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	Документ1.ЗаключениеКомиссии,
	|	Документ1.ИнвКарточкиШтук,
	|	Документ1.ИнвКарточкиЛистов,
	|	Документ1.Приложение,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ВЫБОР
	|		КОГДА Документ1.ВидОперации В (&ВидыОперацийПередачиОС)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Документ1.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ,
	|	Документ1.Ответственный,
	|	Документ1.Руководитель
	|ИЗ
	|	Документ.ПередачаОбъектовОС КАК Документ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = Документ1.Ссылка)
	|ГДЕ
	|	Документ1.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ1.Ссылка,
	|	Документ1.Номер,
	|	Документ1.Дата,
	|	Документ1.Организация,
	|	Документ1.Подразделение,
	|	Документ1.ЦМО,
	|	Документ1.Контрагент,
	|	Документ1.ВидИмущества,
	|	Документ1.ОснованиеДляАкта,
	|	Документ1.НомерОснованияДляАкта,
	|	Документ1.ДатаОснованияДляАкта,
	|	Документ1.ДолжностьПредседателяКомиссии,
	|	Документ1.ФамилияПредседателяКомиссии,
	|	Документ1.ИмяПредседателяКомиссии,
	|	Документ1.ОтчествоПредседателяКомиссии,
	|	"""",
	|	Документ1.НомерПриказа,
	|	Документ1.ДатаПриказа,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка),
	|	Документ1.ЗаключениеКомиссии,
	|	Документ1.ИнвКарточкиШтук,
	|	Документ1.ИнвКарточкиЛистов,
	|	Документ1.Приложение,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ВЫБОР
	|		КОГДА Документ1.ВидОперации В (&ВидыОперацийИК)
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Документ1.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ,
	|	Документ1.Ответственный,
	|	Документ1.Руководитель
	|ИЗ
	|	Документ.ПередачаОбъектовИК КАК Документ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = Документ1.Ссылка)
	|ГДЕ
	|	Документ1.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	МИНИМУМ(ОсновныеСредства.НомерСтроки) КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СУММА(ОсновныеСредства.Сумма) КАК Сумма,
	|	СУММА(ОсновныеСредства.Количество) КАК Количество,
	|	СУММА(ОсновныеСредства.СуммаАмортизации) КАК СуммаАмортизации,
	|	ОсновныеСредства.Ссылка.КФО КАК КФО,
	|	ОсновныеСредства.КПС КАК КПС,
	|	ОсновныеСредства.СчетУчетаОС КАК СчетУчета,
	|	ОсновныеСредства.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	СУММА(ОсновныеСредства.СуммаВВалюте) КАК СуммаВВалюте,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.СоздатьИнвентарнуюКарточку
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаИнвКарточки,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.СоздатьИнвентарнуюКарточку
	|			ТОГДА ОсновныеСредства.НомерИнвентарнойКарточки
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерИнвКарточки,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|			ТОГДА ВЫБОР
	|					КОГДА ОсновныеСредства.ОставшийсяСрокПолезногоИспользования = 0
	|						ТОГДА ОсновныеСредства.СрокПолезногоИспользования
	|					ИНАЧЕ ОсновныеСредства.ОставшийсяСрокПолезногоИспользования
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОставшийсяСрокПолезногоИспользования
	|ПОМЕСТИТЬ ОсновныеСредства
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.Ссылка.КФО,
	|	ОсновныеСредства.КПС,
	|	ОсновныеСредства.СчетУчетаОС,
	|	ОсновныеСредства.СрокПолезногоИспользования,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.СоздатьИнвентарнуюКарточку
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.СоздатьИнвентарнуюКарточку
	|			ТОГДА ОсновныеСредства.НомерИнвентарнойКарточки
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|			ТОГДА ВЫБОР
	|					КОГДА ОсновныеСредства.ОставшийсяСрокПолезногоИспользования = 0
	|						ТОГДА ОсновныеСредства.СрокПолезногоИспользования
	|					ИНАЧЕ ОсновныеСредства.ОставшийсяСрокПолезногоИспользования
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	МИНИМУМ(ОсновныеСредства.НомерСтроки),
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	СУММА(ОсновныеСредства.Сумма),
	|	СУММА(ОсновныеСредства.Количество),
	|	СУММА(ОсновныеСредства.СуммаАмортизации),
	|	ОсновныеСредства.Ссылка.КФО,
	|	ОсновныеСредства.КПС,
	|	ОсновныеСредства.СчетУчетаОС,
	|	ОсновныеСредства.СрокПолезногоИспользования,
	|	СУММА(ОсновныеСредства.СуммаВВалюте),
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.СоздатьИнвентарнуюКарточку
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.СоздатьИнвентарнуюКарточку
	|			ТОГДА ОсновныеСредства.НомерИнвентарнойКарточки
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|			ТОГДА ВЫБОР
	|					КОГДА ОсновныеСредства.ОставшийсяСрокПолезногоИспользования = 0
	|						ТОГДА ОсновныеСредства.СрокПолезногоИспользования
	|					ИНАЧЕ ОсновныеСредства.ОставшийсяСрокПолезногоИспользования
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.Ссылка.КФО,
	|	ОсновныеСредства.КПС,
	|	ОсновныеСредства.СчетУчетаОС,
	|	ОсновныеСредства.СрокПолезногоИспользования,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.СоздатьИнвентарнуюКарточку
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.СоздатьИнвентарнуюКарточку
	|			ТОГДА ОсновныеСредства.НомерИнвентарнойКарточки
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|			ТОГДА ВЫБОР
	|					КОГДА ОсновныеСредства.ОставшийсяСрокПолезногоИспользования = 0
	|						ТОГДА ОсновныеСредства.СрокПолезногоИспользования
	|					ИНАЧЕ ОсновныеСредства.ОставшийсяСрокПолезногоИспользования
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	МИНИМУМ(ОсновныеСредства.НомерСтроки),
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	СУММА(ОсновныеСредства.Сумма),
	|	СУММА(ОсновныеСредства.Количество),
	|	СУММА(ОсновныеСредства.СуммаАмортизации + ОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц),
	|	NULL,
	|	NULL,
	|	ОсновныеСредства.СчетУчета,
	|	NULL,
	|	КОЛИЧЕСТВО(0),
	|	NULL,
	|	NULL,
	|	0
	|ИЗ
	|	Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.СчетУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	МИНИМУМ(ОсновныеСредства.НомерСтроки),
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	СУММА(ОсновныеСредства.Сумма),
	|	СУММА(ОсновныеСредства.Количество),
	|	СУММА(ОсновныеСредства.СуммаАмортизации + ОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц),
	|	NULL,
	|	NULL,
	|	ОсновныеСредства.СчетУчета,
	|	NULL,
	|	КОЛИЧЕСТВО(0),
	|	NULL,
	|	NULL,
	|	0
	|ИЗ
	|	Документ.ПередачаОбъектовИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.СчетУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка КАК Ссылка,
	|	СоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии,
	|	СоставКомиссии.Отсутствует КАК Отсутствует
	|ПОМЕСТИТЬ СоставКомиссии
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии,
	|	СоставКомиссии.Отсутствует
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовИК.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии,
	|	СоставКомиссии.Отсутствует
	|ИЗ
	|	Документ.ПередачаОбъектовОС.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии,
	|	СоставКомиссии.Отсутствует
	|ИЗ
	|	Документ.ПередачаОбъектовИК.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОбъектНФА КАК ОсновноеСредство,
	|	ДрагоценныеМатериалы.ИнвНомер КАК ИнвентарныйНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала КАК ВидДрагМатериала,
	|	ДрагоценныеМатериалы.МассаДМ КАК МассаДМ,
	|	ДрагоценныеМатериалы.ЕдИзм КАК ЕдИзм
	|ПОМЕСТИТЬ ДрагоценныеМатериалы
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовОС.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОбъектНФА,
	|	ДрагоценныеМатериалы.ИнвНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала,
	|	ДрагоценныеМатериалы.МассаДМ,
	|	ДрагоценныеМатериалы.ЕдИзм
	|ИЗ
	|	Документ.ПринятиеКУчетуОбъектовИК.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОбъектНФА,
	|	ДрагоценныеМатериалы.ИнвНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала,
	|	ДрагоценныеМатериалы.МассаДМ,
	|	ДрагоценныеМатериалы.ЕдИзм
	|ИЗ
	|	Документ.ПередачаОбъектовОС.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОбъектНФА,
	|	ДрагоценныеМатериалы.ИнвНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала,
	|	ДрагоценныеМатериалы.МассаДМ,
	|	ДрагоценныеМатериалы.ЕдИзм
	|ИЗ
	|	Документ.ПередачаОбъектовИК.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОССрезПоследних.ДатаСобытия КАК ДатаСобытия,
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер
	|ПОМЕСТИТЬ ДатаВводаВЭксплуатацию
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ОсновныеСредства.ОсновноеСредство
	|					ИЗ
	|						ОсновныеСредства КАК ОсновныеСредства)
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)) КАК СобытияОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПаспортаТранспортныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПаспортаТранспортныхСредствСрезПоследних.СерияНомер КАК СерияНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.ИдентификационныйНомер КАК ИдентификационныйНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.Марка КАК Марка,
	|	ПаспортаТранспортныхСредствСрезПоследних.Модель КАК Модель,
	|	ПаспортаТранспортныхСредствСрезПоследних.Тип КАК Тип,
	|	ПаспортаТранспортныхСредствСрезПоследних.ДвигательМодель КАК ДвигательМодель,
	|	ПаспортаТранспортныхСредствСрезПоследних.ДвигательНомер КАК ДвигательНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.НомерШасси КАК НомерШасси,
	|	ПаспортаТранспортныхСредствСрезПоследних.НомерКузова КАК НомерКузова,
	|	ПаспортаТранспортныхСредствСрезПоследних.ЭкологическийКласс КАК ЭкологическийКласс,
	|	ПаспортаТранспортныхСредствСрезПоследних.Масса КАК Масса,
	|	ПаспортаТранспортныхСредствСрезПоследних.ГаражныйНомер КАК ГаражныйНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.Грузоподъемность КАК Грузоподъемность,
	|	ПаспортаТранспортныхСредствСрезПоследних.Колонна КАК Колонна,
	|	ПаспортаТранспортныхСредствСрезПоследних.РегистрационныйЗнак КАК РегистрационныйЗнак,
	|	ПаспортаТранспортныхСредствСрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|	ПаспортаТранспортныхСредствСрезПоследних.ДатаСнятияСУчета КАК ДатаСнятияСУчета
	|ПОМЕСТИТЬ ПаспортаТранспортныхСредств
	|ИЗ
	|	РегистрСведений.ПаспортаТранспортныхСредств.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ОсновныеСредства КАК ВТ)) КАК ПаспортаТранспортныхСредствСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	Документ.Организация КАК Организация,
	|	Документ.Организация.НаименованиеПолное КАК ОрганизацияНаименование,
	|	Документ.Организация.КодОКПО КАК ОрганизацияКодОКПО,
	|	Документ.Организация.ИНН КАК ОрганизацияИНН,
	|	ЕСТЬNULL(Документ.Подразделение.РегистрацияВНалоговомОргане.КПП, Документ.Организация.КПП) КАК ОрганизацияКПП,
	|	Документ.Подразделение КАК ОрганизацияПодразделение,
	|	ВЫБОР
	|		КОГДА Документ.Подразделение.НаименованиеПолное = """"
	|			ТОГДА Документ.Подразделение.Наименование
	|		ИНАЧЕ Документ.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК ОрганизацияПодразделениеНаименование,
	|	Документ.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Документ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА Документ.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).НаименованиеПолное
	|		КОГДА Документ.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ФизическиеЛица).Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	ВЫБОР
	|		КОГДА Документ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА Документ.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентКодОКПО,
	|	ВЫБОР
	|		КОГДА Документ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА Документ.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).ИНН
	|		КОГДА Документ.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ФизическиеЛица).ИНН
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентИНН,
	|	ВЫБОР
	|		КОГДА Документ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА Документ.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КПП
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентКПП,
	|	"""" КАК КонтрагентПодразделение,
	|	"""" КАК КонтрагентПодразделениеНаименование,
	|	Документ.ЦМО.Сотрудник КАК Сотрудник,
	|	Документ.ВидИмущества КАК ВидИмущества,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОсновныеСредства.СчетУчета.Забалансовый, ИСТИНА)
	|			ТОГДА """"
	|		ИНАЧЕ ПОДСТРОКА(ОсновныеСредства.СчетУчета.Код, 5, 1) + ""0""
	|	КОНЕЦ КАК АналитическаяГруппа,
	|	Документ.ОснованиеДляАкта КАК ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	|	Документ.ДолжностьПредседателяКомиссии КАК ПредседательДолжность,
	|	Документ.ФамилияПредседателяКомиссии КАК ПредседательФамилия,
	|	Документ.ИмяПредседателяКомиссии КАК ПредседательИмя,
	|	Документ.ОтчествоПредседателяКомиссии КАК ПредседательОтчество,
	|	Документ.НаименованиеПриказа КАК НаименованиеПриказа,
	|	Документ.НомерПриказа КАК НомерПриказа,
	|	Документ.ДатаПриказа КАК ДатаПриказа,
	|	Документ.ВалютаПоступления КАК ВалютаПоступления,
	|	Документ.ВалютаПоступления.Код КАК ВалютаПоступленияКод,
	|	Документ.ВалютаПоступления.Наименование КАК ВалютаПоступленияНаименование,
	|	Документ.ЗаключениеКомиссии КАК ЗаключениеКомиссии,
	|	Документ.ИнвКарточкиШтук КАК ИнвКарточкиШтук,
	|	Документ.ИнвКарточкиЛистов КАК ИнвКарточкиЛистов,
	|	Документ.Приложение КАК Приложение,
	|	Документ.ДатаСписания КАК ДатаСписания,
	|	Документ.Принятие КАК Принятие,
	|	Документ.Передача КАК Передача,
	|	Документ.Ответственный КАК Ответственный,
	|	Документ.Руководитель КАК Руководитель
	|ИЗ
	|	Документ КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОсновныеСредства КАК ОсновныеСредства
	|		ПО Документ.Ссылка = ОсновныеСредства.Ссылка
	|			И (ОсновныеСредства.НомерСтроки = 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредствоСсылка,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ОсновныеСредства.ОсновноеСредство.Наименование
	|		ИНАЧЕ ОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК ОсновноеСредство,
	|	ОсновныеСредства.ОсновноеСредство.КодОКОФ.Код КАК КодПоОКОФ,
	|	ОсновныеСредства.ОсновноеСредство.МожетСодержатьДрагМатериалы КАК МожетСодержатьДрагМатериалы,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомерСсылка,
	|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредства.ИнвентарныйНомер) КАК ИнвентарныйНомер,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.Количество КАК Количество,
	|	ОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ОсновныеСредства.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ОсновныеСредства.СчетУчета.Код КАК СчетУчета,
	|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредства.КПС) КАК КПС,
	|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредства.КФО) КАК КФО,
	|	ОсновныеСредства.ДатаИнвКарточки КАК ДатаИнвКарточки,
	|	ОсновныеСредства.НомерИнвКарточки КАК НомерИнвКарточки,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ОставшийсяСрокПолезногоИспользования = 0
	|			ТОГДА 0
	|		ИНАЧЕ 100 / ОсновныеСредства.ОставшийсяСрокПолезногоИспользования
	|	КОНЕЦ КАК НормаАмортизации,
	|	ОсновныеСредства.СуммаВВалюте КАК СуммаВВалюте,
	|	ОсновныеСредства.ИнвентарныйНомер.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ОсновныеСредства.ИнвентарныйНомер.РеестровыйНомер КАК РеестровыйНомер,
	|	ОсновныеСредства.ИнвентарныйНомер.ИнойНомер КАК ИнойНомер,
	|	ОсновныеСредства.ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска,
	|	ОсновныеСредства.ОсновноеСредство.Сведения КАК Сведения,
	|	ДатаВводаВЭксплуатацию.ДатаСобытия КАК ДатаВводаВЭксплуатацию,
	|	ЕСТЬNULL(УчетныеДанныеОбъектаОС.КЭК.Код, ""000"") КАК КЭК
	|ИЗ
	|	ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию
	|		ПО ОсновныеСредства.ОсновноеСредство = ДатаВводаВЭксплуатацию.ОсновноеСредство
	|			И ОсновныеСредства.ИнвентарныйНомер = ДатаВводаВЭксплуатацию.ИнвентарныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетныеДанныеОбъектаОС КАК УчетныеДанныеОбъектаОС
	|		ПО ОсновныеСредства.Ссылка = УчетныеДанныеОбъектаОС.Регистратор
	|			И ОсновныеСредства.ОсновноеСредство = УчетныеДанныеОбъектаОС.ОсновноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка КАК Ссылка,
	|	СоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СоставКомиссии.ДолжностьЧленаКомиссии КАК КомиссияДолжность,
	|	СоставКомиссии.ФамилияЧленаКомиссии КАК КомиссияФамилия,
	|	СоставКомиссии.ИмяЧленаКомиссии КАК КомиссияИмя,
	|	СоставКомиссии.ОтчествоЧленаКомиссии КАК КомиссияОтчество
	|ИЗ
	|	СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	НЕ СоставКомиссии.Отсутствует
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Ссылка,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт КАК КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт КАК КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КЭККт,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор В (&МассивОбъектов)
	|				И (ЕСТЬNULL(СчетДт.ТипСчета, ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|					ИЛИ ЕСТЬNULL(СчетКт.ТипСчета, ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияКадастровогоУчетаСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастроваяСтоимость КАК КадастроваяСтоимость,
	|	СведенияКадастровогоУчетаСрезПоследних.ДоляПлощадиЧислитель КАК ДоляПлощадиЧислитель,
	|	СведенияКадастровогоУчетаСрезПоследних.ДоляПлощадиЗнаменатель КАК ДоляПлощадиЗнаменатель,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомерЗдания КАК КадастровыйНомерЗдания,
	|	СведенияКадастровогоУчетаСрезПоследних.УсловныйНомер КАК УсловныйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомерЗемлиНедвижимости КАК КадастровыйНомерЗемлиНедвижимости,
	|	СведенияКадастровогоУчетаСрезПоследних.ВидОбъектаНедвижимости КАК ВидОбъектаНедвижимости,
	|	СведенияКадастровогоУчетаСрезПоследних.ЭтоПомещение КАК ЭтоПомещение,
	|	СведенияКадастровогоУчетаСрезПоследних.КоличествоЭтажей КАК КоличествоЭтажей,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщийОбъем КАК ОбщийОбъем,
	|	СведенияКадастровогоУчетаСрезПоследних.ПодземныйОбъем КАК ПодземныйОбъем
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ОсновныеСредства КАК ВТ)) КАК СведенияКадастровогоУчетаСрезПоследних
	|ИТОГИ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПаспортаТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство,
	|	ПаспортаТранспортныхСредств.СерияНомер КАК СерияНомер,
	|	ПаспортаТранспортныхСредств.ИдентификационныйНомер КАК ИдентификационныйНомер,
	|	ПаспортаТранспортныхСредств.Марка КАК Марка,
	|	ПаспортаТранспортныхСредств.Модель КАК Модель,
	|	ПаспортаТранспортныхСредств.Тип КАК Тип,
	|	ПаспортаТранспортныхСредств.ДвигательМодель КАК ДвигательМодель,
	|	ПаспортаТранспортныхСредств.ДвигательНомер КАК ДвигательНомер,
	|	ПаспортаТранспортныхСредств.НомерШасси КАК НомерШасси,
	|	ПаспортаТранспортныхСредств.НомерКузова КАК НомерКузова,
	|	ПаспортаТранспортныхСредств.ЭкологическийКласс КАК ЭкологическийКласс,
	|	ПаспортаТранспортныхСредств.Масса КАК Масса,
	|	ПаспортаТранспортныхСредств.ГаражныйНомер КАК ГаражныйНомер,
	|	ПаспортаТранспортныхСредств.Грузоподъемность КАК Грузоподъемность,
	|	ПаспортаТранспортныхСредств.Колонна КАК Колонна,
	|	ПаспортаТранспортныхСредств.РегистрационныйЗнак КАК РегистрационныйЗнак,
	|	ПаспортаТранспортныхСредств.ДатаРегистрации КАК ДатаРегистрации,
	|	ПаспортаТранспортныхСредств.ДатаСнятияСУчета КАК ДатаСнятияСУчета
	|ИЗ
	|	ПаспортаТранспортныхСредств КАК ПаспортаТранспортныхСредств
	|ИТОГИ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительныеРеквизиты.Ссылка КАК ОсновноеСредство,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК ИнвентарныйНомер,
	|	ДополнительныеРеквизиты.Свойство.Заголовок КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ДополнительныеРеквизиты.Значение ССЫЛКА Справочник.ЗначенияСвойствОбъектов
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ДополнительныеРеквизиты.Значение.ПолноеНаименование КАК СТРОКА(1))) = """"
	|						ТОГДА ДополнительныеРеквизиты.Значение.Наименование
	|					ИНАЧЕ ВЫРАЗИТЬ(ДополнительныеРеквизиты.Значение.ПолноеНаименование КАК СТРОКА(1000))
	|				КОНЕЦ
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДополнительныеРеквизиты.Значение)
	|	КОНЕЦ КАК ЗначениеХарактеристики,
	|	ДополнительныеРеквизиты.ТекстоваяСтрока КАК ТекстоваяСтрока,
	|	1 КАК НомерТаблицы,
	|	ЕСТЬNULL(СписокДопРеквизиты.НомерСтроки, 0) КАК Порядок
	|ИЗ
	|	Справочник.ОсновныеСредства.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Список.Свойство КАК Свойство,
	|			МИНИМУМ(Список.НомерСтроки) КАК НомерСтроки
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК Список
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Список.Свойство) КАК СписокДопРеквизиты
	|		ПО ДополнительныеРеквизиты.Свойство = СписокДопРеквизиты.Свойство
	|ГДЕ
	|	ДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ.ОсновноеСредство
	|			ИЗ
	|				ОсновныеСредства КАК ВТ)
	|	И ДополнительныеРеквизиты.Свойство <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка)
	|	И ДополнительныеРеквизиты.Значение <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка),
	|	ДополнительныеСведения.Свойство.Заголовок,
	|	ВЫБОР
	|		КОГДА ДополнительныеСведения.Значение ССЫЛКА Справочник.ЗначенияСвойствОбъектов
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ДополнительныеСведения.Значение.ПолноеНаименование КАК СТРОКА(1))) = """"
	|						ТОГДА ДополнительныеСведения.Значение.Наименование
	|					ИНАЧЕ ВЫРАЗИТЬ(ДополнительныеСведения.Значение.ПолноеНаименование КАК СТРОКА(1000))
	|				КОНЕЦ
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДополнительныеСведения.Значение)
	|	КОНЕЦ,
	|	"""",
	|	2,
	|	ЕСТЬNULL(СписокДопСведения.НомерСтроки, 0)
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Список.Свойство КАК Свойство,
	|			МИНИМУМ(Список.НомерСтроки) КАК НомерСтроки
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК Список
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Список.Свойство) КАК СписокДопСведения
	|		ПО ДополнительныеСведения.Свойство = СписокДопСведения.Свойство
	|ГДЕ
	|	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.ОсновныеСредства) В
	|			(ВЫБРАТЬ
	|				ВТ.ОсновноеСредство
	|			ИЗ
	|				ОсновныеСредства КАК ВТ)
	|	И ДополнительныеСведения.Значение <> НЕОПРЕДЕЛЕНО
	|	И ДополнительныеСведения.Свойство <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТаблицы,
	|	Порядок
	|ИТОГИ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОсновноеСредство КАК ОсновноеСредство,
	|	ДрагоценныеМатериалы.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала КАК Драгметалл,
	|	ДрагоценныеМатериалы.ЕдИзм КАК НаименованиеЕИ,
	|	ДрагоценныеМатериалы.ЕдИзм.Код КАК КодЕИ,
	|	ДрагоценныеМатериалы.МассаДМ КАК Количество
	|ИЗ
	|	ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ИТОГИ ПО
	|	ОсновноеСредство";
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

Функция ТекстЗапроса0504102_НакладнаяНаВнутреннееПеремещениеОС()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НакладнаяНаВнутреннееПеремещениеОС2.Ссылка КАК Ссылка,
	|	НакладнаяНаВнутреннееПеремещениеОС2.Дата КАК Дата,
	|	НакладнаяНаВнутреннееПеремещениеОС2.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА НакладнаяНаВнутреннееПеремещениеОС2.Организация.НаименованиеПолное = """"
	|			ТОГДА НакладнаяНаВнутреннееПеремещениеОС2.Организация.Наименование
	|		ИНАЧЕ НакладнаяНаВнутреннееПеремещениеОС2.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Организация,
	|	НакладнаяНаВнутреннееПеремещениеОС2.Организация КАК ОрганизацияСсылка,
	|	НакладнаяНаВнутреннееПеремещениеОС2.Организация.КодОКПО КАК ОКПО,
	|	ВЫБОР
	|		КОГДА НакладнаяНаВнутреннееПеремещениеОС2.ПодразделениеОтправитель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА НакладнаяНаВнутреннееПеремещениеОС2.ПодразделениеОтправитель.ОбособленноеПодразделение
	|						ТОГДА ВЫБОР
	|								КОГДА НакладнаяНаВнутреннееПеремещениеОС2.ПодразделениеОтправитель.НаименованиеПолное = """"
	|									ТОГДА НакладнаяНаВнутреннееПеремещениеОС2.ПодразделениеОтправитель.Наименование
	|								ИНАЧЕ НакладнаяНаВнутреннееПеремещениеОС2.ПодразделениеОтправитель.НаименованиеПолное
	|							КОНЕЦ
	|					ИНАЧЕ НакладнаяНаВнутреннееПеремещениеОС2.ПодразделениеОтправитель.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодразделениеОтправитель,
	|	ВЫБОР
	|		КОГДА НакладнаяНаВнутреннееПеремещениеОС2.ПодразделениеПолучатель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА НакладнаяНаВнутреннееПеремещениеОС2.ПодразделениеПолучатель.ОбособленноеПодразделение
	|						ТОГДА ВЫБОР
	|								КОГДА НакладнаяНаВнутреннееПеремещениеОС2.ПодразделениеПолучатель.НаименованиеПолное = """"
	|									ТОГДА НакладнаяНаВнутреннееПеремещениеОС2.ПодразделениеПолучатель.Наименование
	|								ИНАЧЕ НакладнаяНаВнутреннееПеремещениеОС2.ПодразделениеПолучатель.НаименованиеПолное
	|							КОНЕЦ
	|					ИНАЧЕ НакладнаяНаВнутреннееПеремещениеОС2.ПодразделениеПолучатель.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодразделениеПолучатель,
	|	ЕСТЬNULL(НакладнаяНаВнутреннееПеремещениеОС2.ЦМООтправитель.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МолОтправитель,
	|	ЕСТЬNULL(НакладнаяНаВнутреннееПеремещениеОС2.ЦМОПолучатель.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МОЛПолучатель,
	|	НакладнаяНаВнутреннееПеремещениеОС2.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	НакладнаяНаВнутреннееПеремещениеОС2.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	НакладнаяНаВнутреннееПеремещениеОС2.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	НакладнаяНаВнутреннееПеремещениеОС2.ДополнительноеСобытие КАК ДополнительноеСобытие,
	|	НакладнаяНаВнутреннееПеремещениеОС2.СотрудникЛП КАК СотрудникЛП,
	|	НакладнаяНаВнутреннееПеремещениеОС2ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА НакладнаяНаВнутреннееПеремещениеОС2ОсновныеСредства.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА НакладнаяНаВнутреннееПеремещениеОС2ОсновныеСредства.ОсновноеСредство.Наименование
	|		ИНАЧЕ НакладнаяНаВнутреннееПеремещениеОС2ОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК Наименование,
	|	НакладнаяНаВнутреннееПеремещениеОС2ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	""796"" КАК КодОКЕИ,
	|	""шт"" КАК НаименованиеЕИ,
	|	ЕСТЬNULL(НакладнаяНаВнутреннееПеремещениеОС2ОсновныеСредства.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(НакладнаяНаВнутреннееПеремещениеОС2ОсновныеСредства.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(НакладнаяНаВнутреннееПеремещениеОС2ОсновныеСредства.Сумма, 0) КАК Сумма,
	|	НакладнаяНаВнутреннееПеремещениеОС2ОсновныеСредства.Примечание КАК Примечание,
	|	НакладнаяНаВнутреннееПеремещениеОС2.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.НакладнаяНаВнутреннееПеремещениеОС2 КАК НакладнаяНаВнутреннееПеремещениеОС2
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НакладнаяНаВнутреннееПеремещениеОС2.ОсновныеСредства КАК НакладнаяНаВнутреннееПеремещениеОС2ОсновныеСредства
	|		ПО НакладнаяНаВнутреннееПеремещениеОС2.Ссылка = НакладнаяНаВнутреннееПеремещениеОС2ОсновныеСредства.Ссылка
	|ГДЕ
	|	НакладнаяНаВнутреннееПеремещениеОС2.Ссылка В(&МассивОбъектов)
	|	И НакладнаяНаВнутреннееПеремещениеОС2.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеОС.ПеремещениеОСМеждуСчетами)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса0504102_НакладнаяНаВнутреннееПеремещениеИК()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА Документ.Организация.НаименованиеПолное = """"
	|			ТОГДА Документ.Организация.Наименование
	|		ИНАЧЕ Документ.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Организация,
	|	Документ.Организация КАК ОрганизацияСсылка,
	|	Документ.Организация.КодОКПО КАК ОКПО,
	|	ВЫБОР
	|		КОГДА Документ.ПодразделениеОтправитель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ.ПодразделениеОтправитель.ОбособленноеПодразделение
	|						ТОГДА ВЫБОР
	|								КОГДА Документ.ПодразделениеОтправитель.НаименованиеПолное = """"
	|									ТОГДА Документ.ПодразделениеОтправитель.Наименование
	|								ИНАЧЕ Документ.ПодразделениеОтправитель.НаименованиеПолное
	|							КОНЕЦ
	|					ИНАЧЕ Документ.ПодразделениеОтправитель.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодразделениеОтправитель,
	|	ВЫБОР
	|		КОГДА Документ.ПодразделениеПолучатель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ.ПодразделениеПолучатель.ОбособленноеПодразделение
	|						ТОГДА ВЫБОР
	|								КОГДА Документ.ПодразделениеПолучатель.НаименованиеПолное = """"
	|									ТОГДА Документ.ПодразделениеПолучатель.Наименование
	|								ИНАЧЕ Документ.ПодразделениеПолучатель.НаименованиеПолное
	|							КОНЕЦ
	|					ИНАЧЕ Документ.ПодразделениеПолучатель.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодразделениеПолучатель,
	|	ЕСТЬNULL(Документ.ЦМООтправитель.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МолОтправитель,
	|	ЕСТЬNULL(Документ.ЦМОПолучатель.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МОЛПолучатель,
	|	Документ.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	Документ.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	Документ.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	NULL КАК ДополнительноеСобытие,
	|	NULL КАК СотрудникЛП,
	|	ТЧОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТЧОсновныеСредства.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ТЧОсновныеСредства.ОсновноеСредство.Наименование
	|		ИНАЧЕ ТЧОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК Наименование,
	|	ТЧОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	""796"" КАК КодОКЕИ,
	|	""шт"" КАК НаименованиеЕИ,
	|	ТЧОсновныеСредства.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ТЧОсновныеСредства.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ТЧОсновныеСредства.Сумма / ТЧОсновныеСредства.Количество
	|	КОНЕЦ КАК Цена,
	|	ТЧОсновныеСредства.Сумма КАК Сумма,
	|	ТЧОсновныеСредства.Примечание КАК Примечание,
	|	Документ.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.ВнутреннееПеремещениеИК КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПеремещениеИК.ОсновныеСредства КАК ТЧОсновныеСредства
	|		ПО Документ.Ссылка = ТЧОсновныеСредства.Ссылка
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|	И Документ.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеОС.ПеремещениеОСМеждуСчетами)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса0504102_ПереводГотовойПродукцииВСоставОС()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПереводГотовойПродукцииВСоставОС.Ссылка КАК Ссылка,
	|	ПереводГотовойПродукцииВСоставОС.Дата КАК Дата,
	|	ПереводГотовойПродукцииВСоставОС.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА ПереводГотовойПродукцииВСоставОС.Организация.НаименованиеПолное = """"
	|			ТОГДА ПереводГотовойПродукцииВСоставОС.Организация.Наименование
	|		ИНАЧЕ ПереводГотовойПродукцииВСоставОС.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Организация,
	|	ПереводГотовойПродукцииВСоставОС.Организация КАК ОрганизацияСсылка,
	|	ПереводГотовойПродукцииВСоставОС.Организация.КодОКПО КАК ОКПО,
	|	ВЫБОР
	|		КОГДА ПереводГотовойПродукцииВСоставОС.ПодразделениеОтправитель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ПереводГотовойПродукцииВСоставОС.ПодразделениеОтправитель.ОбособленноеПодразделение
	|						ТОГДА ВЫБОР
	|								КОГДА ПереводГотовойПродукцииВСоставОС.ПодразделениеОтправитель.НаименованиеПолное = """"
	|									ТОГДА ПереводГотовойПродукцииВСоставОС.ПодразделениеОтправитель.Наименование
	|								ИНАЧЕ ПереводГотовойПродукцииВСоставОС.ПодразделениеОтправитель.НаименованиеПолное
	|							КОНЕЦ
	|					ИНАЧЕ ПереводГотовойПродукцииВСоставОС.ПодразделениеОтправитель.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодразделениеОтправитель,
	|	ВЫБОР
	|		КОГДА ПереводГотовойПродукцииВСоставОС.ПодразделениеПолучатель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ПереводГотовойПродукцииВСоставОС.ПодразделениеПолучатель.ОбособленноеПодразделение
	|						ТОГДА ВЫБОР
	|								КОГДА ПереводГотовойПродукцииВСоставОС.ПодразделениеПолучатель.НаименованиеПолное = """"
	|									ТОГДА ПереводГотовойПродукцииВСоставОС.ПодразделениеПолучатель.Наименование
	|								ИНАЧЕ ПереводГотовойПродукцииВСоставОС.ПодразделениеПолучатель.НаименованиеПолное
	|							КОНЕЦ
	|					ИНАЧЕ ПереводГотовойПродукцииВСоставОС.ПодразделениеПолучатель.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодразделениеПолучатель,
	|	ЕСТЬNULL(ПереводГотовойПродукцииВСоставОС.ЦМООтправитель.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МолОтправитель,
	|	ЕСТЬNULL(ПереводГотовойПродукцииВСоставОС.ЦМОПолучатель.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МОЛПолучатель,
	|	"""" КАК ВидПервичногоДокумента,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПервичногоДокумента,
	|	"""" КАК НомерПервичногоДокумента,
	|	NULL КАК ДополнительноеСобытие,
	|	NULL КАК СотрудникЛП,
	|	ПереводГотовойПродукцииВСоставОСОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ПереводГотовойПродукцииВСоставОСОсновныеСредства.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ПереводГотовойПродукцииВСоставОСОсновныеСредства.ОсновноеСредство.Наименование
	|		ИНАЧЕ ПереводГотовойПродукцииВСоставОСОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК Наименование,
	|	ПереводГотовойПродукцииВСоставОСОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	""796"" КАК КодОКЕИ,
	|	""шт"" КАК НаименованиеЕИ,
	|	ПереводГотовойПродукцииВСоставОСОсновныеСредства.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ПереводГотовойПродукцииВСоставОСОсновныеСредства.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ПереводГотовойПродукцииВСоставОСОсновныеСредства.Сумма / ПереводГотовойПродукцииВСоставОСОсновныеСредства.Количество
	|	КОНЕЦ КАК Цена,
	|	ПереводГотовойПродукцииВСоставОСОсновныеСредства.Сумма КАК Сумма,
	|	ПереводГотовойПродукцииВСоставОСОсновныеСредства.Примечание КАК Примечание,
	|	ПереводГотовойПродукцииВСоставОС.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.ПереводГотовойПродукцииВСоставОС КАК ПереводГотовойПродукцииВСоставОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереводГотовойПродукцииВСоставОС.ОсновныеСредства КАК ПереводГотовойПродукцииВСоставОСОсновныеСредства
	|		ПО ПереводГотовойПродукцииВСоставОС.Ссылка = ПереводГотовойПродукцииВСоставОСОсновныеСредства.Ссылка
	|ГДЕ
	|	ПереводГотовойПродукцииВСоставОС.Ссылка В(&МассивОбъектов)
	|	И ПереводГотовойПродукцииВСоставОСОсновныеСредства.Ссылка В(&МассивОбъектов)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса0504102_ТребованиеНакладная0315006()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТребованиеНакладная0315006.Ссылка КАК Ссылка,
	|	ТребованиеНакладная0315006.Дата КАК Дата,
	|	ТребованиеНакладная0315006.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА ТребованиеНакладная0315006.Организация.НаименованиеПолное = """"
	|			ТОГДА ТребованиеНакладная0315006.Организация.Наименование
	|		ИНАЧЕ ТребованиеНакладная0315006.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Организация,
	|	ТребованиеНакладная0315006.Организация КАК ОрганизацияСсылка,
	|	ТребованиеНакладная0315006.Организация.КодОКПО КАК ОКПО,
	|	ВЫБОР
	|		КОГДА ТребованиеНакладная0315006.ПодразделениеОтправитель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ТребованиеНакладная0315006.ПодразделениеОтправитель.ОбособленноеПодразделение
	|						ТОГДА ВЫБОР
	|								КОГДА ТребованиеНакладная0315006.ПодразделениеОтправитель.НаименованиеПолное = """"
	|									ТОГДА ТребованиеНакладная0315006.ПодразделениеОтправитель.Наименование
	|								ИНАЧЕ ТребованиеНакладная0315006.ПодразделениеОтправитель.НаименованиеПолное
	|							КОНЕЦ
	|					ИНАЧЕ ТребованиеНакладная0315006.ПодразделениеОтправитель.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодразделениеОтправитель,
	|	ВЫБОР
	|		КОГДА ТребованиеНакладная0315006.ПодразделениеПолучатель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ТребованиеНакладная0315006.ПодразделениеПолучатель.ОбособленноеПодразделение
	|						ТОГДА ВЫБОР
	|								КОГДА ТребованиеНакладная0315006.ПодразделениеПолучатель.НаименованиеПолное = """"
	|									ТОГДА ТребованиеНакладная0315006.ПодразделениеПолучатель.Наименование
	|								ИНАЧЕ ТребованиеНакладная0315006.ПодразделениеПолучатель.НаименованиеПолное
	|							КОНЕЦ
	|					ИНАЧЕ ТребованиеНакладная0315006.ПодразделениеПолучатель.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодразделениеПолучатель,
	|	ЕСТЬNULL(ТребованиеНакладная0315006.ЦМООтправитель.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МолОтправитель,
	|	ЕСТЬNULL(ТребованиеНакладная0315006.ЦМОПолучатель.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МОЛПолучатель,
	|	ТребованиеНакладная0315006.ДокументОснованиеВид КАК ВидПервичногоДокумента,
	|	ТребованиеНакладная0315006.ДокументОснованиеДата КАК ДатаПервичногоДокумента,
	|	ТребованиеНакладная0315006.ДокументОснованиеНомер КАК НомерПервичногоДокумента,
	|	NULL КАК ДополнительноеСобытие,
	|	NULL КАК СотрудникЛП,
	|	ТребованиеНакладная0315006Материалы.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТребованиеНакладная0315006Материалы.Номенклатура.НаименованиеПолное = """"
	|			ТОГДА ТребованиеНакладная0315006Материалы.Номенклатура.Наименование
	|		ИНАЧЕ ТребованиеНакладная0315006Материалы.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК Наименование,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК ИнвентарныйНомер,
	|	ТребованиеНакладная0315006Материалы.Номенклатура.ЕдиницаИзмерения.Код КАК КодОКЕИ,
	|	ТребованиеНакладная0315006Материалы.Номенклатура.ЕдиницаИзмерения.Наименование КАК НаименованиеЕИ,
	|	ТребованиеНакладная0315006Материалы.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ТребованиеНакладная0315006.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияМЗ.ПеремещениеМеждуНТТ)
	|				ИЛИ ТребованиеНакладная0315006.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияМЗ.ВозвратИзНТТ)
	|			ТОГДА ТребованиеНакладная0315006Материалы.ЦенаПередачи
	|		КОГДА ЕСТЬNULL(ТребованиеНакладная0315006Материалы.ДвиженияДокументовКоличество, 0) = 0
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(18, 2))
	|		ИНАЧЕ ВЫРАЗИТЬ(ТребованиеНакладная0315006Материалы.ДвиженияДокументовСумма / ТребованиеНакладная0315006Материалы.ДвиженияДокументовКоличество КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТребованиеНакладная0315006.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияМЗ.ПеремещениеМеждуНТТ)
	|				ИЛИ ТребованиеНакладная0315006.ВидПеремещения = ЗНАЧЕНИЕ(Перечисление.ВидыПеремещенияМЗ.ВозвратИзНТТ)
	|			ТОГДА ТребованиеНакладная0315006Материалы.СуммаПередачи
	|		КОГДА ЕСТЬNULL(ТребованиеНакладная0315006Материалы.ДвиженияДокументовКоличество, 0) = 0
	|			ТОГДА ВЫРАЗИТЬ(0 КАК ЧИСЛО(18, 2))
	|		КОГДА ТребованиеНакладная0315006Материалы.ДвиженияДокументовКоличество = ТребованиеНакладная0315006Материалы.Количество
	|			ТОГДА ТребованиеНакладная0315006Материалы.ДвиженияДокументовСумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ТребованиеНакладная0315006Материалы.Количество * ТребованиеНакладная0315006Материалы.ДвиженияДокументовСумма / ТребованиеНакладная0315006Материалы.ДвиженияДокументовКоличество КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК Сумма,
	|	ТребованиеНакладная0315006Материалы.Примечание КАК Примечание,
	|	ТребованиеНакладная0315006.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.ТребованиеНакладная0315006 КАК ТребованиеНакладная0315006
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТребованиеНакладная0315006Материалы КАК ТребованиеНакладная0315006Материалы
	|		ПО ТребованиеНакладная0315006.Ссылка = ТребованиеНакладная0315006Материалы.Ссылка
	|ГДЕ
	|	ТребованиеНакладная0315006.Ссылка В(&МассивОбъектов)
	|	И ТребованиеНакладная0315006Материалы.Ссылка В(&МассивОбъектов)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса0504102_ВнутреннееПеремещениеОбъектовПравПользованияОС()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА Документ.Организация.НаименованиеПолное = """"
	|			ТОГДА Документ.Организация.Наименование
	|		ИНАЧЕ Документ.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Организация,
	|	Документ.Организация КАК ОрганизацияСсылка,
	|	Документ.Организация.КодОКПО КАК ОКПО,
	|	ВЫБОР
	|		КОГДА Документ.ПодразделениеОтправитель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ.ПодразделениеОтправитель.ОбособленноеПодразделение
	|						ТОГДА ВЫБОР
	|								КОГДА Документ.ПодразделениеОтправитель.НаименованиеПолное = """"
	|									ТОГДА Документ.ПодразделениеОтправитель.Наименование
	|								ИНАЧЕ Документ.ПодразделениеОтправитель.НаименованиеПолное
	|							КОНЕЦ
	|					ИНАЧЕ Документ.ПодразделениеОтправитель.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодразделениеОтправитель,
	|	ВЫБОР
	|		КОГДА Документ.ПодразделениеПолучатель <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ.ПодразделениеПолучатель.ОбособленноеПодразделение
	|						ТОГДА ВЫБОР
	|								КОГДА Документ.ПодразделениеПолучатель.НаименованиеПолное = """"
	|									ТОГДА Документ.ПодразделениеПолучатель.Наименование
	|								ИНАЧЕ Документ.ПодразделениеПолучатель.НаименованиеПолное
	|							КОНЕЦ
	|					ИНАЧЕ Документ.ПодразделениеПолучатель.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПодразделениеПолучатель,
	|	ЕСТЬNULL(Документ.ЦМООтправитель.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МолОтправитель,
	|	ЕСТЬNULL(Документ.ЦМОПолучатель.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МОЛПолучатель,
	|	Документ.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	Документ.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	Документ.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	NULL КАК ДополнительноеСобытие,
	|	NULL КАК СотрудникЛП,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Таблица.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА Таблица.ОсновноеСредство.Наименование
	|		ИНАЧЕ Таблица.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК Наименование,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК ИнвентарныйНомер,
	|	""796"" КАК КодОКЕИ,
	|	""шт"" КАК НаименованиеЕИ,
	|	1 КАК Количество,
	|	ЕСТЬNULL(Таблица.Сумма, 0) КАК Цена,
	|	ЕСТЬNULL(Таблица.Сумма, 0) КАК Сумма,
	|	"""" КАК Примечание,
	|	Документ.Ответственный КАК Ответственный
	|ИЗ
	|	Документ.ВнутреннееПеремещениеОбъектовПравПользованияОС КАК Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнутреннееПеремещениеОбъектовПравПользованияОС.ОсновныеСредства КАК Таблица
	|		ПО Документ.Ссылка = Таблица.Ссылка
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_ДвиженияДокументов()

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Ссылка,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПСДт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПСКт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭККт,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор В (&МассивОбъектов)
	|				И (СчетДт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|					ИЛИ СчетКт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)),
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)),
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)),
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка))
	|ИТОГИ ПО
	|	Ссылка";

КонецФункции // ТекстЗапроса_ДвиженияДокументов()

Функция ДанныеДляПечати0504104(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов"	, МассивОбъектов);
	Запрос.УстановитьПараметр("СчетаУчета"		, БухгалтерскийУчет.СписокСчетов("101.00,102.00,103.00,106.00,108.51,108.52,108.53,108.54,108.55,108.90,111.00,01,02,21"));
	Запрос.УстановитьПараметр("СчетаАмортизации", БухгалтерскийУчет.СписокСчетов("104.00"));
	Запрос.УстановитьПараметр("СчетаЗатрат"		, БухгалтерскийУчет.СписокСчетов("401.20,109.00"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	Документ.Организация КАК Организация,
	|	Документ.Подразделение КАК Подразделение,
	|	Документ.ЦМО КАК ЦМО,
	|	Документ.ВидИмущества КАК ВидИмущества,
	|	Документ.ОснованиеДляАкта КАК ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	|	Документ.НаименованиеПриказа КАК НаименованиеПриказа,
	|	Документ.НомерПриказа КАК НомерПриказа,
	|	Документ.ДатаПриказа КАК ДатаПриказа,
	|	Документ.ЗаключениеКомиссии КАК ЗаключениеКомиссии,
	|	Документ.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	|	Документ.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	|	Документ.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	|	Документ.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	|	Документ.Приложение КАК Приложение,
	|	Документ.ИнвКарточкиШтук КАК ИнвКарточкиШтук,
	|	Документ.ИнвКарточкиЛистов КАК ИнвКарточкиЛистов,
	|	Документ.СведенияОСогласовании КАК СведенияОСогласовании,
	|	Документ.Ответственный КАК Ответственный,
	|	Документ.Руководитель КАК Руководитель
	|ПОМЕСТИТЬ ВТ_Документ
	|ИЗ
	|	Документ.СписаниеОбъектовОС КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Номер,
	|	Документ.Дата,
	|	Документ.Организация,
	|	Документ.Подразделение,
	|	Документ.ЦМО,
	|	Документ.ВидИмущества,
	|	Документ.ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта,
	|	Документ.НаименованиеПриказа,
	|	Документ.НомерПриказа,
	|	Документ.ДатаПриказа,
	|	Документ.ЗаключениеКомиссии,
	|	Документ.ДолжностьПредседателяКомиссии,
	|	Документ.ФамилияПредседателяКомиссии,
	|	Документ.ИмяПредседателяКомиссии,
	|	Документ.ОтчествоПредседателяКомиссии,
	|	Документ.Приложение,
	|	Документ.ИнвКарточкиШтук,
	|	Документ.ИнвКарточкиЛистов,
	|	Документ.СведенияОСогласовании,
	|	Документ.Ответственный,
	|	Документ.Руководитель
	|ИЗ
	|	Документ.СписаниеОбъектовИК КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОсновныеСредства.Количество КАК Количество,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ОсновныеСредства.СчетУчета КАК СчетУчета,
	|	ОсновныеСредства.КПС КАК КПС,
	|	ОсновныеСредства.РезолюцияКомиссии КАК РезолюцияКомиссии,
	|	ОсновныеСредства.ПричинаСписания КАК ПричинаСписания
	|ПОМЕСТИТЬ ВТ_ОсновныеСредства
	|ИЗ
	|	Документ.СписаниеОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.Количество,
	|	ОсновныеСредства.Сумма,
	|	ОсновныеСредства.СуммаАмортизации,
	|	ОсновныеСредства.СчетУчета,
	|	ОсновныеСредства.КПС,
	|	ОсновныеСредства.РезолюцияКомиссии,
	|	ОсновныеСредства.ПричинаСписания
	|ИЗ
	|	Документ.СписаниеОбъектовИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставКомиссии.Ссылка КАК Ссылка,
	|	СоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СоставКомиссии.Отсутствует КАК Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии
	|ПОМЕСТИТЬ ВТ_Комиссия
	|ИЗ
	|	Документ.СписаниеОбъектовОС.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.СписаниеОбъектовИК.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОС.ИнвНомер КАК ИнвентарныйНомер,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|				ТОГДА СобытияОС.ДатаСобытия
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаПринятияКУчету,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|				ТОГДА СобытияОС.ДатаСобытия
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаВводаВЭксплуатацию
	|ПОМЕСТИТЬ ВТ_События
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ВТ_ОсновныеСредства КАК ВТ)) КАК СобытияОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.ОсновноеСредство,
	|	СобытияОС.ИнвНомер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Документ.Ссылка КАК Ссылка,
	|	ВТ_Документ.Номер КАК Номер,
	|	ВТ_Документ.Дата КАК Дата,
	|	ВТ_Документ.Организация КАК Организация,
	|	ВТ_Документ.Организация.НаименованиеПолное КАК НаимОрганизации,
	|	ВТ_Документ.Организация.КодОКПО КАК КодОКПО,
	|	ВТ_Документ.Подразделение КАК Подразделение,
	|	ВТ_Документ.Организация.ИНН КАК ИНН,
	|	ЕСТЬNULL(ВТ_Документ.Подразделение.РегистрацияВНалоговомОргане.КПП, ВТ_Документ.Организация.КПП) КАК КПП,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА ВТ_Документ.Подразделение.НаименованиеПолное = """"
	|			ТОГДА ВТ_Документ.Подразделение.Наименование
	|		ИНАЧЕ ВТ_Документ.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК НаимПодразделения,
	|	ЕСТЬNULL(ВТ_Документ.ЦМО.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК МОЛ,
	|	ЕСТЬNULL(ВТ_Документ.ЦМО.Сотрудник.Код, """") КАК ТабНомМОЛ,
	|	ВТ_Документ.ОснованиеДляАкта КАК ОснованиеДляАкта,
	|	ВТ_Документ.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	|	ВТ_Документ.НаименованиеПриказа КАК НаименованиеПриказа,
	|	ВТ_Документ.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	|	ВТ_Документ.НомерПриказа КАК НомерПриказа,
	|	ВТ_Документ.ДатаПриказа КАК ДатаПриказа,
	|	ВТ_Документ.ЗаключениеКомиссии КАК ЗаключениеКомиссии,
	|	ВТ_Документ.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	|	ВТ_Документ.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	|	ВТ_Документ.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	|	ВТ_Документ.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	|	ВТ_Документ.Приложение КАК Приложение,
	|	ВТ_Документ.ИнвКарточкиШтук КАК ИнвКарточкиШтук,
	|	ВТ_Документ.ИнвКарточкиЛистов КАК ИнвКарточкиЛистов,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ВТ_Документ.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК ДатаСписания,
	|	ВТ_Документ.СведенияОСогласовании КАК СведенияОСогласовании,
	|	ВТ_Документ.Ответственный КАК Ответственный,
	|	ВТ_Документ.Руководитель КАК Руководитель,
	|	ВТ_Документ.ВидИмущества КАК ВидИмущества,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ОсновныеСредства.СчетУчета.Забалансовый, ИСТИНА)
	|			ТОГДА """"
	|		ИНАЧЕ ПОДСТРОКА(ВТ_ОсновныеСредства.СчетУчета.Код, 5, 1) + ""0""
	|	КОНЕЦ КАК АналитическаяГруппа
	|ИЗ
	|	ВТ_Документ КАК ВТ_Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеСредства КАК ВТ_ОсновныеСредства
	|		ПО ВТ_Документ.Ссылка = ВТ_ОсновныеСредства.Ссылка
	|			И (ВТ_ОсновныеСредства.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ВТ_Документ.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ОсновныеСредства.Ссылка КАК Ссылка,
	|	ВТ_ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ВТ_ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_ОсновныеСредства.ОсновноеСредство.Наименование КАК НФАНаименование,
	|	ВТ_ОсновныеСредства.ОсновноеСредство.НаименованиеПолное КАК НФАНаименованиеПолное,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ОсновныеСредства.ИнвентарныйНомер) КАК ИнвентарныйНомер,
	|	ВТ_ОсновныеСредства.Количество КАК Количество,
	|	ВТ_ОсновныеСредства.Сумма КАК БалансоваяСтоимость,
	|	ВТ_ОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ВТ_ОсновныеСредства.СчетУчета КАК СчетУчета,
	|	ВТ_ОсновныеСредства.КПС КАК КПС,
	|	ВТ_ОсновныеСредства.ИнвентарныйНомер.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ВТ_ОсновныеСредства.ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска,
	|	ВТ_ОсновныеСредства.ИнвентарныйНомер.РеестровыйНомер КАК РеестровыйНомер,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновныеСредства.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СобытияБезИнвНомера.ДатаВводаВЭксплуатацию, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ЕСТЬNULL(СобытияПоИнвНомеру.ДатаВводаВЭксплуатацию, ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаВводаВЭксплуатацию,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновныеСредства.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(СобытияБезИнвНомера.ДатаПринятияКУчету, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ЕСТЬNULL(СобытияПоИнвНомеру.ДатаПринятияКУчету, ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаПринятияКУчету,
	|	ВТ_ОсновныеСредства.ОсновноеСредство.ГрупповойУчет КАК ГрупповойУчет
	|ИЗ
	|	ВТ_ОсновныеСредства КАК ВТ_ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_События КАК СобытияПоИнвНомеру
	|		ПО ВТ_ОсновныеСредства.ОсновноеСредство = СобытияПоИнвНомеру.ОсновноеСредство
	|			И ВТ_ОсновныеСредства.ИнвентарныйНомер = СобытияПоИнвНомеру.ИнвентарныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_События КАК СобытияБезИнвНомера
	|		ПО ВТ_ОсновныеСредства.ОсновноеСредство = СобытияБезИнвНомера.ОсновноеСредство
	|			И (СобытияБезИнвНомера.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Комиссия.Ссылка КАК Ссылка,
	|	ВТ_Комиссия.НомерСтроки КАК НомерСтроки,
	|	ВТ_Комиссия.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	|	ВТ_Комиссия.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	|	ВТ_Комиссия.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	|	ВТ_Комиссия.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии
	|ИЗ
	|	ВТ_Комиссия КАК ВТ_Комиссия
	|ГДЕ
	|	НЕ ВТ_Комиссия.Отсутствует
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Движения.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА Движения.СчетКт В (&СчетаУчета)
	|			ТОГДА ВЫБОР
	|					КОГДА Движения.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|						ТОГДА ВЫРАЗИТЬ(Движения.СубконтоКт1 КАК Справочник.ОсновныеСредства)
	|					КОГДА Движения.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|						ТОГДА ВЫРАЗИТЬ(Движения.СубконтоКт2 КАК Справочник.ОсновныеСредства)
	|					КОГДА Движения.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|						ТОГДА ВЫРАЗИТЬ(Движения.СубконтоКт3 КАК Справочник.ОсновныеСредства)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|				КОНЕЦ
	|		КОГДА Движения.СчетДт В (&СчетаАмортизации)
	|			ТОГДА ВЫРАЗИТЬ(Движения.СубконтоДт1 КАК Справочник.ОсновныеСредства)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Движения.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ТОГДА ВЫРАЗИТЬ(Движения.СубконтоКт1 КАК Справочник.ОсновныеСредства)
	|				КОГДА Движения.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ТОГДА ВЫРАЗИТЬ(Движения.СубконтоКт2 КАК Справочник.ОсновныеСредства)
	|				КОГДА Движения.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ТОГДА ВЫРАЗИТЬ(Движения.СубконтоКт3 КАК Справочник.ОсновныеСредства)
	|				КОГДА Движения.ВидСубконтоДт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ТОГДА ВЫРАЗИТЬ(Движения.СубконтоДт1 КАК Справочник.ОсновныеСредства)
	|				КОГДА Движения.ВидСубконтоДт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ТОГДА ВЫРАЗИТЬ(Движения.СубконтоДт2 КАК Справочник.ОсновныеСредства)
	|				КОГДА Движения.ВидСубконтоДт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ТОГДА ВЫРАЗИТЬ(Движения.СубконтоДт3 КАК Справочник.ОсновныеСредства)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ КАК ОсновноеСредство,
	|	СУММА(Движения.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА Движения.СчетКт В (&СчетаАмортизации)
	|					И Движения.СчетДт В (&СчетаЗатрат)
	|				ТОГДА Движения.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаАмортТекМесяца,
	|	СУММА(ВЫБОР
	|			КОГДА Движения.СчетДт В (&СчетаАмортизации)
	|				ТОГДА Движения.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаСписаннойАмортизации,
	|	СУММА(ВЫБОР
	|			КОГДА Движения.СчетКт В (&СчетаУчета)
	|				ТОГДА Движения.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаСписаннойОстСтоимости,
	|	Движения.КФО КАК КФО,
	|	ВЫБОР
	|		КОГДА Движения.СчетДт.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|		ИНАЧЕ Движения.СчетДт
	|	КОНЕЦ КАК СчетДт,
	|	Движения.КПСДт КАК КПСДт,
	|	Движения.КЭКДт КАК КЭКДт,
	|	ВЫБОР
	|		КОГДА Движения.СчетКт.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|		ИНАЧЕ Движения.СчетКт
	|	КОНЕЦ КАК СчетКт,
	|	Движения.КПСКт КАК КПСКт,
	|	Движения.КЭККт КАК КЭККт,
	|	ВЫБОР
	|		КОГДА Движения.СчетДт В (&СчетаАмортизации)
	|				И Движения.СчетКт В (&СчетаУчета)
	|			ТОГДА 1
	|		КОГДА Движения.СчетДт В (&СчетаАмортизации)
	|			ТОГДА 2
	|		КОГДА Движения.СчетКт В (&СчетаУчета)
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК ВидПроводки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(, , Регистратор В (&МассивОбъектов), , ) КАК Движения
	|ГДЕ
	|	(Движения.СчетДт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|			ИЛИ Движения.СчетКт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский))
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.Регистратор,
	|	ВЫБОР
	|		КОГДА Движения.СчетКт В (&СчетаУчета)
	|			ТОГДА ВЫБОР
	|					КОГДА Движения.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|						ТОГДА ВЫРАЗИТЬ(Движения.СубконтоКт1 КАК Справочник.ОсновныеСредства)
	|					КОГДА Движения.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|						ТОГДА ВЫРАЗИТЬ(Движения.СубконтоКт2 КАК Справочник.ОсновныеСредства)
	|					КОГДА Движения.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|						ТОГДА ВЫРАЗИТЬ(Движения.СубконтоКт3 КАК Справочник.ОсновныеСредства)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|				КОНЕЦ
	|		КОГДА Движения.СчетДт В (&СчетаАмортизации)
	|			ТОГДА ВЫРАЗИТЬ(Движения.СубконтоДт1 КАК Справочник.ОсновныеСредства)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Движения.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ТОГДА ВЫРАЗИТЬ(Движения.СубконтоКт1 КАК Справочник.ОсновныеСредства)
	|				КОГДА Движения.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ТОГДА ВЫРАЗИТЬ(Движения.СубконтоКт2 КАК Справочник.ОсновныеСредства)
	|				КОГДА Движения.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ТОГДА ВЫРАЗИТЬ(Движения.СубконтоКт3 КАК Справочник.ОсновныеСредства)
	|				КОГДА Движения.ВидСубконтоДт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ТОГДА ВЫРАЗИТЬ(Движения.СубконтоДт1 КАК Справочник.ОсновныеСредства)
	|				КОГДА Движения.ВидСубконтоДт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ТОГДА ВЫРАЗИТЬ(Движения.СубконтоДт2 КАК Справочник.ОсновныеСредства)
	|				КОГДА Движения.ВидСубконтоДт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства)
	|					ТОГДА ВЫРАЗИТЬ(Движения.СубконтоДт3 КАК Справочник.ОсновныеСредства)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	Движения.КФО,
	|	Движения.СчетДт,
	|	Движения.КПСДт,
	|	Движения.КЭКДт,
	|	Движения.СчетКт,
	|	Движения.КПСКт,
	|	Движения.КЭККт,
	|	ВЫБОР
	|		КОГДА Движения.СчетДт В (&СчетаАмортизации)
	|			ТОГДА 1
	|		КОГДА Движения.СчетКт В (&СчетаУчета)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Движения.СчетДт.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|		ИНАЧЕ Движения.СчетДт
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Движения.СчетКт.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|		ИНАЧЕ Движения.СчетКт
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	ВидПроводки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеСредства.Ссылка КАК Ссылка,
	|	ВТ_ОсновныеСредства.РезолюцияКомиссии КАК РезолюцияКомиссии,
	|	ВТ_ОсновныеСредства.ПричинаСписания КАК ПричинаСписания
	|ИЗ
	|	ВТ_ОсновныеСредства КАК ВТ_ОсновныеСредства
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОсновныеСредства.РезолюцияКомиссии,
	|	ВТ_ОсновныеСредства.ПричинаСписания,
	|	ВТ_ОсновныеСредства.Ссылка";
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

Функция ДанныеДляПечати0504105(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	Документ.Организация КАК Организация,
	|	Документ.ОсновноеСредство КАК ОсновноеСредство,
	|	Документ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	Документ.Подразделение КАК Подразделение,
	|	Документ.ЦМО КАК ЦМО,
	|	Документ.СчетУчета КАК СчетУчета,
	|	Документ.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	|	Документ.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	|	Документ.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	|	Документ.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	|	Документ.Сумма КАК Сумма,
	|	Документ.СуммаАмортизации КАК СуммаАмортизации,
	|	Документ.СуммаАмортизацииЗаТекущийМесяц КАК СуммаАмортизацииЗаТекущийМесяц,
	|	Документ.СуммаОбесценения КАК СуммаОбесценения,
	|	Документ.ПробегСНачалаЭксплуатации КАК ПробегСНачалаЭксплуатации,
	|	Документ.ПробегПослеКапРемонта КАК ПробегПослеКапРемонта,
	|	Документ.ТехническоеСостояние КАК ТехническоеСостояние,
	|	Документ.НаименованиеПриказа КАК НаименованиеПриказа,
	|	Документ.НомерПриказа КАК НомерПриказа,
	|	Документ.ДатаПриказа КАК ДатаПриказа,
	|	Документ.ЗаключениеКомиссии КАК ЗаключениеКомиссии,
	|	Документ.Приложение КАК Приложение,
	|	Документ.ИнвКарточкиШтук КАК ИнвКарточкиШтук,
	|	Документ.ИнвКарточкиЛистов КАК ИнвКарточкиЛистов,
	|	Документ.Ответственный КАК Ответственный,
	|	Документ.Руководитель КАК Руководитель,
	|	ВЫБОР
	|		КОГДА Документ.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписанияОС.СписаниеСобственныхОС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НаБалансе
	|ПОМЕСТИТЬ ВТ_Документ
	|ИЗ
	|	Документ.СписаниеТранспорта КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.Номер,
	|	Документ.Организация,
	|	Документ.ОсновноеСредство,
	|	Документ.ИнвентарныйНомер,
	|	Документ.Подразделение,
	|	Документ.ЦМО,
	|	Документ.СчетУчета,
	|	Документ.ДолжностьПредседателяКомиссии,
	|	Документ.ФамилияПредседателяКомиссии,
	|	Документ.ИмяПредседателяКомиссии,
	|	Документ.ОтчествоПредседателяКомиссии,
	|	Документ.Сумма,
	|	Документ.СуммаАмортизации,
	|	Документ.СуммаАмортизацииЗаТекущийМесяц,
	|	0,
	|	Документ.ПробегСНачалаЭксплуатации,
	|	Документ.ПробегПослеКапРемонта,
	|	Документ.ТехническоеСостояние,
	|	"""",
	|	Документ.НомерПриказа,
	|	Документ.ДатаПриказа,
	|	Документ.ЗаключениеКомиссии,
	|	Документ.Приложение,
	|	Документ.ИнвКарточкиШтук,
	|	Документ.ИнвКарточкиЛистов,
	|	Документ.Ответственный,
	|	Документ.Руководитель,
	|	ИСТИНА
	|ИЗ
	|	Документ.СписаниеТранспортаИК КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставКомиссии.Ссылка КАК Ссылка,
	|	СоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СоставКомиссии.Отсутствует КАК Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии
	|ПОМЕСТИТЬ ВТ_Комиссия
	|ИЗ
	|	Документ.СписаниеТранспорта.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.Отсутствует,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.СписаниеТранспортаИК.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПаспортаТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство,
	|	ПаспортаТранспортныхСредств.ИдентификационныйНомер КАК ИдентификационныйНомер,
	|	ПаспортаТранспортныхСредств.НомерКузова КАК НомерКузова,
	|	ПаспортаТранспортныхСредств.НомерШасси КАК НомерШасси,
	|	ПаспортаТранспортныхСредств.ДвигательНомер КАК НомерДвигателя,
	|	ПаспортаТранспортныхСредств.Марка КАК Марка,
	|	ПаспортаТранспортныхСредств.Модель КАК Модель,
	|	ПаспортаТранспортныхСредств.РегистрационныйЗнак КАК ГосНомер,
	|	ПаспортаТранспортныхСредств.Тип КАК ТипАвто,
	|	ПаспортаТранспортныхСредств.ДатаСнятияСУчета КАК ДатаСнятияСУчета,
	|	ПаспортаТранспортныхСредств.Грузоподъемность КАК Грузоподъемность,
	|	ПаспортаТранспортныхСредств.СерияНомер КАК НомерПаспорта,
	|	ПаспортаТранспортныхСредств.Масса / 1000 КАК Масса
	|ПОМЕСТИТЬ ВТ_ПТС
	|ИЗ
	|	РегистрСведений.ПаспортаТранспортныхСредств.СрезПоследних(
	|			,
	|			(Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ВТ_Документ КАК ВТ)) КАК ПаспортаТранспортныхСредств
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|				ТОГДА СобытияОС.ДатаСобытия
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаПринятияКУчету,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|				ТОГДА СобытияОС.ДатаСобытия
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаВводаВЭксплуатацию,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(перечисление.ВидыСобытийОС.Списание)
	|				ТОГДА СобытияОС.ДатаСобытия
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаСписания
	|ПОМЕСТИТЬ ВТ_ДатыСобытий
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			,
	|			(Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ВТ_Документ КАК ВТ)) КАК СобытияОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетныеДанныеОбъектаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидИмущества КАК ВидИмущества,
	|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета КАК СчетУчета
	|ПОМЕСТИТЬ ВТ_УчетныеДанные
	|ИЗ
	|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(
	|			,
	|			(Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ВТ_Документ КАК ВТ)) КАК УчетныеДанныеОбъектаОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Списание.Ссылка КАК Ссылка,
	|	ВТ_Списание.Номер КАК Номер,
	|	ВТ_Списание.Дата КАК Дата,
	|	ВТ_Списание.Организация КАК Организация,
	|	ВТ_Списание.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	ВТ_Списание.Организация.КодОКПО КАК КодОКПО,
	|	ВТ_Списание.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_Списание.ОсновноеСредство.НаименованиеПолное КАК Наименование,
	|	ВТ_Списание.ИнвентарныйНомер КАК ИнвентарныйНомерСсылка,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_Списание.ИнвентарныйНомер) КАК ИнвентарныйНомер,
	|	ВТ_Списание.ИнвентарныйНомер.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ВТ_Списание.ИнвентарныйНомер.РеестровыйНомер КАК РеестровыйНомер,
	|	ВТ_Списание.ИнвентарныйНомер.ИнойНомер КАК ИнойНомер,
	|	ВТ_Списание.ИнвентарныйНомер.ДатаВыпуска КАК ГодВыпуска,
	|	ВЫБОР
	|		КОГДА ВТ_Списание.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Списание.Подразделение.ОбособленноеПодразделение
	|						ТОГДА ВТ_Списание.Подразделение.НаименованиеПолное
	|					ИНАЧЕ ВТ_Списание.Подразделение.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Подразделение,
	|	ВТ_Списание.Организация.ИНН КАК ИНН,
	|	ВЫБОР
	|		КОГДА ВТ_Списание.Подразделение.ОбособленноеПодразделение
	|			ТОГДА ВТ_Списание.Подразделение.РегистрацияВНалоговомОргане.КПП
	|		ИНАЧЕ ВТ_Списание.Организация.КПП
	|	КОНЕЦ КАК КПП,
	|	ВТ_Списание.ЦМО.Сотрудник.Наименование КАК МОЛ,
	|	ВТ_Списание.ЦМО.Сотрудник.Код КАК ТабНомМОЛ,
	|	ВТ_Списание.Сумма КАК БалансоваяСтоимость,
	|	ВЫБОР
	|		КОГДА ВТ_Списание.НаБалансе
	|			ТОГДА ВТ_Списание.Сумма - ВТ_Списание.СуммаАмортизации - ВТ_Списание.СуммаАмортизацииЗаТекущийМесяц - ВТ_Списание.СуммаОбесценения
	|		ИНАЧЕ ВТ_Списание.Сумма
	|	КОНЕЦ КАК ОстаточнаяСтоимость,
	|	ВТ_Списание.ДолжностьПредседателяКомиссии КАК Должность,
	|	ВТ_Списание.ФамилияПредседателяКомиссии КАК Фамилия,
	|	ВТ_Списание.ИмяПредседателяКомиссии КАК Имя,
	|	ВТ_Списание.ОтчествоПредседателяКомиссии КАК Отчество,
	|	ВТ_Списание.ПробегСНачалаЭксплуатации КАК ПробегСНачалаЭксплуатации,
	|	ВТ_Списание.ПробегПослеКапРемонта КАК ПробегПослеКапРемонта,
	|	ВТ_Списание.ТехническоеСостояние КАК ТехническоеСостояние,
	|	ВТ_Списание.НаименованиеПриказа КАК НаименованиеПриказа,
	|	ВТ_Списание.НомерПриказа КАК НомерПриказа,
	|	ВТ_Списание.ДатаПриказа КАК ДатаПриказа,
	|	ВТ_Списание.ЗаключениеКомиссии КАК ЗаключениеКомиссии,
	|	ВТ_Списание.Приложение КАК Приложение,
	|	ВТ_Списание.ИнвКарточкиШтук КАК ИнвКарточкиШтук,
	|	ВТ_Списание.ИнвКарточкиЛистов КАК ИнвКарточкиЛистов,
	|	ВТ_Списание.Ответственный КАК Ответственный,
	|	ВТ_Списание.Руководитель КАК Руководитель,
	|	ВТ_УчетныеДанные.ВидИмущества КАК ВидИмущества,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_УчетныеДанные.СчетУчета.Забалансовый, ИСТИНА)
	|			ТОГДА """"
	|		ИНАЧЕ ПОДСТРОКА(ВТ_УчетныеДанные.СчетУчета.Код, 5, 1) + ""0""
	|	КОНЕЦ КАК АналитическаяГруппа,
	|	ВТ_ДатыСобытий.ДатаПринятияКУчету КАК ДатаПринятияКУчету,
	|	ВТ_ДатыСобытий.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ВТ_ДатыСобытий.ДатаСписания КАК ДатаСписания,
	|	ВТ_ПТС.НомерПаспорта КАК НомерПаспорта,
	|	ВТ_ПТС.Марка КАК Марка,
	|	ВТ_ПТС.Модель КАК Модель,
	|	ВТ_ПТС.ТипАвто КАК ТипАвто,
	|	ВТ_ПТС.ГосНомер КАК ГосНомер,
	|	ВТ_ПТС.НомерДвигателя КАК НомерДвигателя,
	|	ВТ_ПТС.НомерШасси КАК НомерШасси,
	|	ВТ_ПТС.ДатаСнятияСУчета КАК ДатаСнятияСУчета,
	|	ВТ_ПТС.Грузоподъемность КАК Грузоподъемность,
	|	ВТ_ПТС.Масса КАК Масса,
	|	ВТ_ПТС.НомерКузова КАК НомерКузова
	|ИЗ
	|	ВТ_Документ КАК ВТ_Списание
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетныеДанные КАК ВТ_УчетныеДанные
	|		ПО ВТ_Списание.ОсновноеСредство = ВТ_УчетныеДанные.ОсновноеСредство
	|			И ВТ_Списание.СчетУчета = ВТ_УчетныеДанные.СчетУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПТС КАК ВТ_ПТС
	|		ПО ВТ_Списание.ОсновноеСредство = ВТ_ПТС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыСобытий КАК ВТ_ДатыСобытий
	|		ПО ВТ_Списание.ОсновноеСредство = ВТ_ДатыСобытий.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Комиссия.Ссылка КАК Ссылка,
	|	ВТ_Комиссия.НомерСтроки КАК НомерСтроки,
	|	ВТ_Комиссия.ДолжностьЧленаКомиссии КАК Должность,
	|	ВТ_Комиссия.ФамилияЧленаКомиссии КАК Фамилия,
	|	ВТ_Комиссия.ИмяЧленаКомиссии КАК Имя,
	|	ВТ_Комиссия.ОтчествоЧленаКомиссии КАК Отчество
	|ИЗ
	|	ВТ_Комиссия КАК ВТ_Комиссия
	|ГДЕ
	|	НЕ ВТ_Комиссия.Отсутствует
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Ссылка,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт КАК КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт КАК КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КЭККт,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(, , Регистратор В (&МассивОбъектов), , ) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|ГДЕ
	|	(ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|			ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт
	|ИТОГИ ПО
	|	Ссылка";
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

Процедура ВывестиНачалоНовойСтраницы(ТабличныйДокумент, ОбластьНачалоСтраницы, НомерСтраницы)

	НомерСтраницы = НомерСтраницы + 1;
	ОбластьНачалоСтраницы.Параметры.Заполнить(Новый Структура("НомерСтраницы", НомерСтраницы));
	
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ТабличныйДокумент.Вывести(ОбластьНачалоСтраницы);

КонецПроцедуры

Функция ПолучитьШиринуОбласти(Область)
	
	Ширина = 0;
	
	Для Сч = 1 По Область.ШиринаТаблицы Цикл
		
		Ячейка = Область.Область(1, Сч, 1, Сч);
		Ширина = Ширина + ?(Ячейка.ШиринаКолонки = 0, 9, Ячейка.ШиринаКолонки);
		
	КонецЦикла;
	
	Коэффициент = 10 / Область.Область().Шрифт.Размер;

	Возврат Цел(Ширина * Коэффициент);
	
КонецФункции

// Формирует строку из массива слов, которая помещается в область шириной "ШиринаВСимволах".
// Выбор слов из массива начинается с индекса "ТекИндекс"
Функция СобратьСтрокуИзМассиваДляОбласти(МассивСлов, ТекИндекс, ШиринаВСимволах)
	
	СловаСтроки = Новый Массив;
	ВсегоСимволов = 0;
	
	Для к = ТекИндекс по МассивСлов.Количество()-1 Цикл
				
		ТекСлово = МассивСлов[к];
		
		//ПозРазд = СтрНайти(ТекСлово, Символы.ПС);
		//Если ПозРазд > 0 Тогда
		//	МассивСлов.Вставить(к+1, Сред(ТекСлово, ПозРазд+1)); 
		//	ТекСлово = Сред(ТекСлово, 1, ПозРазд-1);			
		//КонецЕсли;
		
		ВсегоСимволов = ВсегоСимволов + СтрДлина(" " + ТекСлово);
		
		Если ВсегоСимволов <= ШиринаВСимволах Тогда
			СловаСтроки.Добавить(ТекСлово);
			ТекИндекс = ТекИндекс + 1;
		КонецЕсли;
		
		Если ВсегоСимволов >= ШиринаВСимволах Тогда
			Прервать;
		КонецЕсли;

	КонецЦикла;	
	
	Возврат СтрСоединить(СловаСтроки, " ");
	
КонецФункции

// Выводит длинные строки в многострочные части печатных форм. 
//
// Параметры:
// СтрокаВывода - строка - которую будем выводить
// ТабДокумент - ТабличныйДокумент
// Область1 - ОбластьЯчеекТабличногоДокумента - Укороченная строка, с которой начинается вывод
// Область2 - ОбластьЯчеекТабличногоДокумента - Полная строка, котороя будет множиться
// НаименованиеЯчейкиОбласть1 - Строка - Наименование области Область1
// НаименованиеЯчейкиОбласть2 - Строка - Наименование области Область2
//
// Возвращает количество выведенных строк
Функция ВывестиДлиннуюСтрокуАктСписанияМЗ0504230(СтрокаВывода, ТабДокумент, Область1, Область2, НаименованиеЯчейкиОбласть1,
	НаименованиеЯчейкиОбласть2)
	
	МассивСтрок = СтрРазделить(СтрокаВывода, Символы.ПС, Ложь);
	МассивСлов = Новый Массив;
	Для каждого ТекСтрока Из МассивСтрок Цикл
		
		МассивСловТекущейСтроки =  СтрРазделить(ТекСтрока, " ", Ложь);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСлов, МассивСловТекущейСтроки);
		МассивСлов.Добавить(Символы.ПС);
	
	КонецЦикла;
	
	Если МассивСлов.Количество() > 0 Тогда
		МассивСлов.Удалить(МассивСлов.ВГраница());
	КонецЕсли;
	
	ЯчейкаОбласть1 = Область1.Область(НаименованиеЯчейкиОбласть1);
	ЯчейкаОбласть2 = Область2.Область(НаименованиеЯчейкиОбласть2);
	
	ЧислоСимволов1 = Цел(ЯчейкаОбласть1.ШиринаКолонки * (ЯчейкаОбласть1.Право - ЯчейкаОбласть1.Лево + 1));
	ЧислоСимволов2 = Цел(ЯчейкаОбласть2.ШиринаКолонки * (ЯчейкаОбласть2.Право - ЯчейкаОбласть2.Лево + 1));
	
	ТекИндекс = 0;
	Область1.Параметры.Установить(0, СобратьСтрокуИзМассиваДляОбластиАктСписанияМЗ0504230(МассивСлов, ТекИндекс, ЧислоСимволов1));
	ТабДокумент.Вывести(Область1);
	КолВыведенныхСтрок = 1;
	Пока ТекИндекс <= МассивСлов.Количество() - 1 Цикл
		Область2.Параметры.Установить(0, СобратьСтрокуИзМассиваДляОбластиАктСписанияМЗ0504230(МассивСлов, ТекИндекс, ЧислоСимволов2));
		ТабДокумент.Вывести(Область2);
		КолВыведенныхСтрок = КолВыведенныхСтрок + 1;
	КонецЦикла;
	
	Возврат КолВыведенныхСтрок;
	
КонецФункции

// Формирует строку из массива слов, которая помещается в область шириной "ШиринаВСимволах".
// Выбор слов из массива начинается с индекса "ТекИндекс"
// 
// Параметры:
//  МассивСлов - Массив из Строка -  Массив слов
//  ТекИндекс - Число -  Тек индекс
//  ШиринаВСимволах - Число -  Ширина в символах
// 
// Возвращаемое значение:
//  Произвольный, Строка -  Собрать строку из массива для области
Функция СобратьСтрокуИзМассиваДляОбластиАктСписанияМЗ0504230(МассивСлов, ТекИндекс, ШиринаВСимволах)
	ТекСтрока = "";
	ВсегоСимволов = 0;
	Для к = ТекИндекс по МассивСлов.Количество()-1 Цикл
		ТекСлово = МассивСлов[к];
		Если ТекСлово = Символы.ПС Тогда
			ТекИндекс = ТекИндекс  + 1;
			Прервать;
		КонецЕсли;	
		Если СтрДлина(ТекСлово) > ШиринаВСимволах И ВсегоСимволов = 0 Тогда
			ТекСтрока = ТекСлово;
			ТекИндекс = ТекИндекс  + 1;
			Прервать;
		КонецЕсли;	
		ВсегоСимволов = ВсегоСимволов + СтрДлина(" " + ТекСлово);
		Если ВсегоСимволов < ШиринаВСимволах Тогда
			ТекСтрока = ТекСтрока + " " + ТекСлово;
			ТекИндекс = ТекИндекс  + 1;
		ИначеЕсли ВсегоСимволов = ШиринаВСимволах Тогда
			ТекСтрока = ТекСтрока + " " + ТекСлово;
			ТекИндекс = ТекИндекс  + 1;
			Прервать;
		Иначе
			Прервать
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат ТекСтрока;
КонецФункции

Функция ЕстьДопСубконтоСчетаУчетаМЗ(Счет, Кэш)
	
	СубконтоИзКэша = Кэш.Получить(Счет);
	Если СубконтоИзКэша <> Неопределено Тогда
		Возврат ЗначениеЗаполнено(СубконтоИзКэша);
	КонецЕсли;
	
	ДопСубконто = ПланыВидовХарактеристик.ВидыСубконто.ПустаяСсылка();
	СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Счет);
	Для Индекс = 1 По СвойстваСчета.КоличествоСубконто Цикл
		Субконто = СвойстваСчета["ВидСубконто" + Индекс];
		ЭтоСтандартноеСубконто = Субконто = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура
			ИЛИ Субконто = ПланыВидовХарактеристик.ВидыСубконто.ЦМО
			ИЛИ Субконто = ПланыВидовХарактеристик.ВидыСубконто.Партии И НЕ СвойстваСчета["ВидСубконто" + Индекс + "Обязательный"];
		Если Не ЭтоСтандартноеСубконто Тогда
			ДопСубконто = Субконто;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Кэш.Вставить(Счет, ДопСубконто);
	Возврат ЗначениеЗаполнено(ДопСубконто);
	
КонецФункции

Функция НаименованиеНФА0510448(Строка)
	Если ТипЗнч(Строка.НФА) = Тип("СправочникСсылка.Номенклатура")
			И ЗначениеЗаполнено(Строка.ЕдИзмНаименование) Тогда
		Возврат СокрП(Строка.НаименованиеНФА) + ", " + Строка.ЕдИзмНаименование; 
	КонецЕсли;
	Возврат Строка.НаименованиеНФА;
КонецФункции

// Формирует представление подразделения для ф. 0510450 "Накладная на внутреннее перемещение".
// Состоит из "Наименование подразделения // Адрес места хранения из ЦМО"
//
// Параметры:
//   НаименованиеПодразделения - Строка - Наименование подразделения
//   МестоХранения - СправочникСсылка.МестаХранения - Место хранения из ЦМО
//
// Возвращаемое значение:
//   Строка - Представление подразделения в формате "Наименование // Адрес"
Функция ПредставлениеПодразделенияДля0510450(НаименованиеПодразделения, МестоХранения)
	ПредставлениеПодразделения = ?(ЗначениеЗаполнено(НаименованиеПодразделения), НаименованиеПодразделения, ""); 
	Если ЗначениеЗаполнено(МестоХранения) Тогда
		АдресМХ = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
			МестоХранения, Справочники.ВидыКонтактнойИнформации.АдресМестаХранения);
		Если ЗначениеЗаполнено(АдресМХ) Тогда	
			ПредставлениеПодразделения = ПредставлениеПодразделения + "//" + АдресМХ;
		КонецЕсли;		 
	КонецЕсли;	
	
	Возврат ПредставлениеПодразделения;
КонецФункции	

// Функция - Данные для печати0510450 ОС
//
// Параметры:
//  МассивОбъектов	 - Массив из ДокументСсылка
// 
// Возвращаемое значение:
//  см. ТаблицаШапкиДляПечатиНакладнаяНаВнутреннееПеремещениеНФА0510450
//
Функция ДанныеДляПечати0510450_ОС(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	Документ.Организация КАК Организация,
	|	Документ.ПодразделениеОтправитель КАК ПодразделениеОтправитель,
	|	Документ.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	|	Документ.ЦМООтправитель КАК ЦМООтправитель,
	|	Документ.ЦМОПолучатель КАК ЦМОПолучатель,
	|	Документ.ВидПервичногоДокумента КАК ОснованиеДляАкта,
	|	Документ.ДатаПервичногоДокумента КАК ДатаОснованияДляАкта,
	|	Документ.НомерПервичногоДокумента КАК НомерОснованияДляАкта,
	|	Документ.Ответственный КАК Ответственный,
	|	NULL КАК ОтветственныйИсполнитель
	|ПОМЕСТИТЬ ВТ_Документ
	|ИЗ
	|	Документ.НакладнаяНаВнутреннееПеремещениеОС2 КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|	И Документ.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеОС.ПеремещениеОСМеждуСчетами)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.Номер,
	|	Документ.Организация,
	|	Документ.ПодразделениеОтправитель,
	|	Документ.ПодразделениеПолучатель,
	|	Документ.ЦМООтправитель,
	|	Документ.ЦМОПолучатель,
	|	Документ.ВидПервичногоДокумента,
	|	Документ.ДатаПервичногоДокумента,
	|	Документ.НомерПервичногоДокумента,
	|	Документ.Ответственный,
	|	NULL
	|ИЗ
	|	Документ.ВнутреннееПеремещениеИК КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|	И Документ.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеОС.ПеремещениеОСМеждуСчетами)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.Номер,
	|	Документ.Организация,
	|	Документ.ПодразделениеОтправитель,
	|	Документ.ПодразделениеПолучатель,
	|	Документ.ЦМООтправитель,
	|	Документ.ЦМОПолучатель,
	|	Документ.ВидПервичногоДокумента,
	|	Документ.ДатаПервичногоДокумента,
	|	Документ.НомерПервичногоДокумента,
	|	Документ.Ответственный,
	|	NULL
	|ИЗ
	|	Документ.ВнутреннееПеремещениеОбъектовПравПользованияОС КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.Номер,
	|	Документ.Организация,
	|	Документ.ПодразделениеОтправитель,
	|	Документ.ПодразделениеПолучатель,
	|	Документ.ЦМООтправитель,
	|	Документ.ЦМОПолучатель,
	|	Документ.ДокументОснованиеВид,
	|	Документ.ДокументОснованиеДата,
	|	Документ.ДокументОснованиеНомер,
	|	Документ.Ответственный,
	|	Документ.ОтветственныйИсполнитель
	|ИЗ
	|	Документ.ПереводГотовойПродукцииВСоставОС КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК НФА,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА ОсновныеСредства.ОсновноеСредство.НоменклатурныйНомер
	|		ИНАЧЕ ОсновныеСредства.ИнвентарныйНомер
	|	КОНЕЦ КАК ИнвентарныйНомер,
	|	ОсновныеСредства.СчетУчета.Родитель КАК СчетГруппа,
	|	ОсновныеСредства.КФО КАК КФО,
	|	ОсновныеСредства.Количество КАК Количество,
	|	ОсновныеСредства.Цена КАК Цена,
	|	ОсновныеСредства.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_НФА
	|ИЗ
	|	Документ.НакладнаяНаВнутреннееПеремещениеОС2.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА ОсновныеСредства.ОсновноеСредство.НоменклатурныйНомер
	|		ИНАЧЕ ОсновныеСредства.ИнвентарныйНомер
	|	КОНЕЦ,
	|	ОсновныеСредства.СчетУчета.Родитель,
	|	ОсновныеСредства.КФО,
	|	ОсновныеСредства.Количество,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Количество = 0
	|			ТОГДА ОсновныеСредства.Сумма
	|		ИНАЧЕ ОсновныеСредства.Сумма / ОсновныеСредства.Количество
	|	КОНЕЦ,
	|	ОсновныеСредства.Сумма
	|ИЗ
	|	Документ.ВнутреннееПеремещениеИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка),
	|	ОсновныеСредства.СчетУчета.Родитель,
	|	ОсновныеСредства.КФО,
	|	1,
	|	ОсновныеСредства.Сумма,
	|	ОсновныеСредства.Сумма
	|ИЗ
	|	Документ.ВнутреннееПеремещениеОбъектовПравПользованияОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	ОсновныеСредства.НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА ОсновныеСредства.ОсновноеСредство.НоменклатурныйНомер
	|		ИНАЧЕ ОсновныеСредства.ИнвентарныйНомер
	|	КОНЕЦ,
	|	ОсновныеСредства.Ссылка.СчетОС.Родитель,
	|	ОсновныеСредства.Ссылка.КФО,
	|	ОсновныеСредства.Количество,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Количество = 0
	|			ТОГДА ОсновныеСредства.Сумма
	|		ИНАЧЕ ОсновныеСредства.Сумма / ОсновныеСредства.Количество
	|	КОНЕЦ,
	|	ОсновныеСредства.Сумма
	|ИЗ
	|	Документ.ПереводГотовойПродукцииВСоставОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА Документ.Организация
	|		ИНАЧЕ Документ.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ.Организация.НаименованиеПолное = """"
	|						ТОГДА Документ.Организация.Наименование
	|					ИНАЧЕ Документ.Организация.НаименованиеПолное
	|				КОНЕЦ
	|		ИНАЧЕ Документ.Организация.ГоловнаяОрганизация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ВЫБОР
	|		КОГДА Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА Документ.Организация.КодПоРПБС
	|		ИНАЧЕ Документ.Организация.ГоловнаяОрганизация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБС,
	|	ВЫБОР
	|		КОГДА Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|		ИНАЧЕ Документ.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ Документ.Организация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ Документ.Организация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБСПодр,
	|	Документ.Организация.КодПоППП.НаименованиеПолное КАК Учредитель,
	|	Документ.Организация.КодПоППП.Код КАК ГлаваБК,
	|	Документ.Организация.Бюджет.НаименованиеПолное КАК БюджетНаименование,
	|	Документ.Организация.Бюджет.Код КАК ОКТМО,
	|	Документ.ПодразделениеОтправитель КАК ПодразделениеОтправитель,
	|	ВЫБОР
	|		КОГДА Документ.ПодразделениеОтправитель.НаименованиеПолное = """"
	|			ТОГДА Документ.ПодразделениеОтправитель.Наименование
	|		ИНАЧЕ Документ.ПодразделениеОтправитель.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеПодразделенияОтправителя,
	|	Документ.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	|	ВЫБОР
	|		КОГДА Документ.ПодразделениеПолучатель.НаименованиеПолное = """"
	|			ТОГДА Документ.ПодразделениеПолучатель.Наименование
	|		ИНАЧЕ Документ.ПодразделениеПолучатель.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеПодразделенияПолучателя,
	|	Документ.ЦМООтправитель.Сотрудник КАК Отправитель,
	|	Документ.ЦМООтправитель.Сотрудник.Код КАК ТабНомОтправитель,
	|	Документ.ЦМОПолучатель.Сотрудник КАК Получатель,
	|	Документ.ЦМОПолучатель.Сотрудник.Код КАК ТабНомПолучатель,
	|	Документ.ЦМООтправитель.МестоХранения КАК МестоХраненияОтправитель,
	|	Документ.ЦМОПолучатель.МестоХранения КАК МестоХраненияПолучатель,
	|	Документ.ОснованиеДляАкта КАК Основание,
	|	Документ.ДатаОснованияДляАкта КАК ОснованиеДата,
	|	Документ.НомерОснованияДляАкта КАК ОснованиеНомер,
	|	Документ.Ответственный КАК Ответственный,
	|	Документ.Организация КАК ОрганизацияДокумента,
	|	ЕСТЬNULL(Документ.ОтветственныйИсполнитель, """") КАК ОтветственныйИсполнитель
	|ИЗ
	|	ВТ_Документ КАК Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НФА.Ссылка КАК Ссылка,
	|	ВТ_НФА.НомерСтроки КАК КодСтроки,
	|	ВТ_НФА.НФА КАК НФА,
	|	ВЫБОР
	|		КОГДА ВТ_НФА.НФА.НаименованиеПолное = """"
	|			ТОГДА ВТ_НФА.НФА.Наименование
	|		ИНАЧЕ ВТ_НФА.НФА.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеНФА,
	|	ВТ_НФА.НФА.Код КАК НаименованиеДоп,
	|	ВТ_НФА.ИнвентарныйНомер КАК ИнвентарныйНомерСсылка,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_НФА.ИнвентарныйНомер) КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_НФА.ИнвентарныйНомер ЕСТЬ NULL
	|				И ВТ_НФА.ИнвентарныйНомер ССЫЛКА Справочник.ИнвентарныеНомераОС
	|				И ВТ_НФА.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА ВТ_НФА.ИнвентарныйНомер.НомерПаспорта
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерДоп,
	|	""шт"" КАК НаименованиеЕИ,
	|	""796"" КАК КодЕИ,
	|	ВТ_НФА.Количество КАК Количество,
	|	ВТ_НФА.Цена КАК Цена,
	|	ВТ_НФА.Сумма КАК Сумма,
	|	ВТ_НФА.КФО КАК КФО,
	|	ВТ_НФА.СчетГруппа КАК КодГруппыНФА,
	|	ВТ_НФА.СчетГруппа.Наименование КАК ГруппаНФА
	|ИЗ
	|	ВТ_НФА КАК ВТ_НФА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ВТ_НФА.СчетГруппа.Порядок,
	|	ВТ_НФА.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка,
	|	КФО,
	|	КодГруппыНФА";
	
	Данные = Запрос.ВыполнитьПакет();
	
	ВыборкаДокументов	= Данные[2].Выбрать();
	ВыборкаНФА			= Данные[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Результат = ТаблицаШапкиДляПечатиНакладнаяНаВнутреннееПеремещениеНФА0510450();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		СтрокаДокумента = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, ВыборкаДокументов);
		СтрокаДокумента.ГруппыНФА = ТаблицаГруппыПередаваемыхОбъектовНакладнаяНаВнутреннееПеремещениеНФА0510450();

		// Адреса подразделений получателя и отправителя
		СтрокаДокумента.НаименованиеПодразделенияОтправителя = ПредставлениеПодразделенияДля0510450(
				СтрокаДокумента.НаименованиеПодразделенияОтправителя, ВыборкаДокументов.МестоХраненияОтправитель);
		СтрокаДокумента.НаименованиеПодразделенияПолучателя = ПредставлениеПодразделенияДля0510450(
				СтрокаДокумента.НаименованиеПодразделенияПолучателя, ВыборкаДокументов.МестоХраненияПолучатель);

		// Данные о сотрудниках
		ПоляСотрудника = "СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность, ДолжностьНаименование";
		ДанныеОтправителя = Новый Структура(ПоляСотрудника, ВыборкаДокументов.Отправитель, ВыборкаДокументов.Дата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеОтправителя);
		ДанныеПолучателя = Новый Структура(ПоляСотрудника, ВыборкаДокументов.Получатель, ВыборкаДокументов.Дата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеПолучателя);
		
		СтрокаДокумента.НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
			ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер);
		СтрокаДокумента.ДатаАкта = ВыборкаДокументов.Дата;
		СтрокаДокумента.ФИООтправителя = КорреспондентыКлиентСервер.ФИО(ДанныеОтправителя,,, Ложь, Истина);
		СтрокаДокумента.ФИОПолучателя = КорреспондентыКлиентСервер.ФИО(ДанныеПолучателя ,,, Ложь, Истина);
		
		// Таблица
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		ВыборкаНФА.Сбросить();
		Если ВыборкаНФА.НайтиСледующий(СтруктураПоиска) Тогда
			ВыборкаКФО = ВыборкаНФА.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКФО.Следующий() Цикл
				// Выборка по КФО
				ВыборкаГруппа = ВыборкаКФО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаГруппа.Следующий() Цикл
					// Выборка по Счету-группе
					СтрокаГруппы = СтрокаДокумента.ГруппыНФА.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаГруппы, ВыборкаГруппа);
					СтрокаГруппы.КодГруппыНФА = "" + ВыборкаГруппа.КФО + "." + СтрокаГруппы.КодГруппыНФА; 
					СтрокаГруппы.Состав = ТаблицаСоставПередаваемыхОбъектовНакладнаяНаВнутреннееПеремещениеНФА0510450();
					
					ВыборкаСтрока = ВыборкаГруппа.Выбрать();
					Пока ВыборкаСтрока.Следующий() Цикл
						СтрокаНФА = СтрокаГруппы.Состав.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаНФА, ВыборкаСтрока);
					КонецЦикла;
				
				КонецЦикла;
				
			КонецЦикла;
		Иначе
			СтрокаГруппы = СтрокаДокумента.ГруппыНФА.Добавить();
			СтрокаГруппы.Состав = ТаблицаСоставПередаваемыхОбъектовНакладнаяНаВнутреннееПеремещениеНФА0510450();
		КонецЕсли;
		
		// ЦМО
		СтрокаДокумента.НаименованиеДолжностиОтправителя = ДанныеОтправителя.ДолжностьНаименование;
		СтрокаДокумента.ДолжностьОтправителя = ДанныеОтправителя.Должность;
		СтрокаДокумента.ФИООтправителяРасшифровка = КорреспондентыКлиентСервер.ФИО(ДанныеОтправителя);
		СтрокаДокумента.Отправитель = ВыборкаДокументов.Отправитель;
		СтрокаДокумента.НаименованиеДолжностиПолучателя = ДанныеПолучателя.ДолжностьНаименование;
		СтрокаДокумента.ДолжностьПолучателя = ДанныеПолучателя.Должность;
		СтрокаДокумента.ФИОПолучателяРасшифровка = КорреспондентыКлиентСервер.ФИО(ДанныеПолучателя);
		СтрокаДокумента.Получатель = ВыборкаДокументов.Получатель;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Данные документов по учету МЗ для печати формы Накладная на внутреннее перемещение НФА (0510450).
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
// 
// Возвращаемое значение:
//   см. ТаблицаШапкиДляПечатиНакладнаяНаВнутреннееПеремещениеНФА0510450
Функция ДанныеДляПечати0510450_МЗ(МассивОбъектов)
	ДанныеГруппНФА = ГруппыОбъектовНФА();
	РезультатЗапроса = ЗапросДляПечатиТребованияНакладной0510451(МассивОбъектов);
	ВыборкаДокументов = РезультатЗапроса.ДанныеШапки;

	ДвиженияДокументов = УправлениеМатериальнымиЗапасами.ДвиженияДокументов(МассивОбъектов);
	ДвиженияДокументов.Индексы.Добавить("Ссылка, НомерСтроки");

	Результат = ТаблицаШапкиДляПечатиНакладнаяНаВнутреннееПеремещениеНФА0510450();
	НеобязательныеРеквизиты = Новый Структура;
	НеобязательныеРеквизиты.Вставить("НомерНоменклатурный");
	НеобязательныеРеквизиты.Вставить("НФАДопНаименование");
	НеобязательныеРеквизиты.Вставить("СерияБСО");
	НеобязательныеРеквизиты.Вставить("НомерНачальный");
	НеобязательныеРеквизиты.Вставить("НомерКонечный");
	НеобязательныеРеквизиты.Вставить("ТипНоменклатуры");
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		СтрокаДокумента = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, ВыборкаДокументов);
		СтрокаДокумента.ГруппыНФА = ТаблицаГруппыПередаваемыхОбъектовНакладнаяНаВнутреннееПеремещениеНФА0510450();

		СтрокаДокумента.НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
			ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер);
		СтрокаДокумента.ДатаАкта = ВыборкаДокументов.Дата;

		// Данные о сотрудниках
		ПоляСотрудника = "СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность, ДолжностьНаименование, ДолжностьНаименованиеПолное, Код";
		СотрудникиДокумента = Новый Массив;
		СотрудникиДокумента.Добавить(ВыборкаДокументов.СотрудникОтправитель);
		СотрудникиДокумента.Добавить(ВыборкаДокументов.СотрудникПолучатель);
		ДанныеСотрудников = Справочники.Сотрудники.ДанныеСотрудников(СотрудникиДокумента, ПоляСотрудника, ВыборкаДокументов.Дата);
		ДанныеОтправителя = ДанныеСотрудников.Получить(ВыборкаДокументов.СотрудникОтправитель);
		ДанныеПолучателя = ДанныеСотрудников.Получить(ВыборкаДокументов.СотрудникПолучатель);
		
		СтрокаДокумента.ФИООтправителя = КорреспондентыКлиентСервер.ФИО(ДанныеОтправителя,,, Ложь, Истина);
		СтрокаДокумента.ФИОПолучателя = КорреспондентыКлиентСервер.ФИО(ДанныеПолучателя ,,, Ложь, Истина);
		СтрокаДокумента.ТабНомОтправитель = ДанныеОтправителя.Код;
		СтрокаДокумента.ТабНомПолучатель = ДанныеПолучателя.Код;

		// Адреса подразделений получателя и отправителя
		СтрокаДокумента.НаименованиеПодразделенияОтправителя = ПредставлениеПодразделенияДля0510450(
				ВыборкаДокументов.НаименованиеОтправитель, ВыборкаДокументов.МестоХраненияОтправитель);
		СтрокаДокумента.НаименованиеПодразделенияПолучателя = ПредставлениеПодразделенияДля0510450(
				ВыборкаДокументов.НаименованиеПолучатель, ВыборкаДокументов.МестоХраненияПолучатель);

		Если ЗначениеЗаполнено(ДанныеОтправителя.ДолжностьНаименованиеПолное) Тогда
			СтрокаДокумента.НаименованиеДолжностиОтправителя = ДанныеОтправителя.ДолжностьНаименованиеПолное;
		Иначе
			СтрокаДокумента.НаименованиеДолжностиОтправителя = ДанныеОтправителя.ДолжностьНаименование;
		КонецЕсли;
		СтрокаДокумента.ДолжностьОтправителя = ДанныеОтправителя.Должность;
		СтрокаДокумента.ФИООтправителяРасшифровка = КорреспондентыКлиентСервер.ФИО(ДанныеОтправителя);
		СтрокаДокумента.Отправитель = ВыборкаДокументов.СотрудникОтправитель;
		Если ЗначениеЗаполнено(ДанныеПолучателя.ДолжностьНаименованиеПолное) Тогда
			СтрокаДокумента.НаименованиеДолжностиПолучателя = ДанныеПолучателя.ДолжностьНаименованиеПолное;
		Иначе
			СтрокаДокумента.НаименованиеДолжностиПолучателя = ДанныеПолучателя.ДолжностьНаименование;
		КонецЕсли;
		СтрокаДокумента.ДолжностьПолучателя = ДанныеПолучателя.Должность;
		СтрокаДокумента.ФИОПолучателяРасшифровка = КорреспондентыКлиентСервер.ФИО(ДанныеПолучателя);
		СтрокаДокумента.Получатель = ВыборкаДокументов.СотрудникПолучатель;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаДокументов, "ДокументОснование") Тогда
			СтрокаДокумента.Основание = ВыборкаДокументов.ДокументОснование;
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаДокументов, "ДокументОснованиеНомер") Тогда
			СтрокаДокумента.ОснованиеНомер = ВыборкаДокументов.ДокументОснованиеНомер;
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаДокументов, "ДокументОснованиеДата") Тогда
			СтрокаДокумента.ОснованиеДата = ВыборкаДокументов.ДокументОснованиеДата;
		КонецЕсли;
		
		// Таблица
		ТабличныеЧасти = РезультатЗапроса.ДанныеТабличныхЧастей.Получить(ТипЗнч(ВыборкаДокументов.Ссылка));
		
		ТабличныеЧасти.Сбросить();
		Если ТабличныеЧасти.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокументов.Ссылка)) Тогда
			СтрокиДокумента = ТабличныеЧасти.Выбрать();
		Иначе
			СтрокиДокумента = Неопределено;
		КонецЕсли;
	
		СтрокиНФАПоГруппам = Новый Соответствие;
		ИспользуемыеГруппы = Новый ТаблицаЗначений;
		ИспользуемыеГруппы.Колонки.Добавить("КодГруппы", Новый ОписаниеТипов("Строка"));
		ИспользуемыеГруппы.Колонки.Добавить("ПорядокСчета", Новый ОписаниеТипов("Строка"));
		
		Пока СтрокиДокумента <> Неопределено И СтрокиДокумента.Следующий() Цикл
			
			КодГрупповогоСчета = Строка(СтрокиДокумента.КФО);
			ТекущаяГруппаНФА = ДанныеГруппНФА.Получить(СтрокиДокумента.СчетУчета);
			Если ТекущаяГруппаНФА <> Неопределено Тогда
				КодГрупповогоСчета = КодГрупповогоСчета + "." + ТекущаяГруппаНФА.Код;
			КонецЕсли;
			
			ГруппировочнаяСтрока = СтрокиНФАПоГруппам.Получить(КодГрупповогоСчета);
			Если ГруппировочнаяСтрока = Неопределено Тогда
				ЗаголовокТабличнойЧасти = СтрокаДокумента.ГруппыНФА.Добавить();
				ЗаголовокТабличнойЧасти.Состав = ТаблицаСоставПередаваемыхОбъектовНакладнаяНаВнутреннееПеремещениеНФА0510450();
				СтрокаИспользуемыхГрупп = ИспользуемыеГруппы.Добавить();
				СтрокаИспользуемыхГрупп.КодГруппы = КодГрупповогоСчета;
				Если ТекущаяГруппаНФА <> Неопределено Тогда
					ЗаголовокТабличнойЧасти.КодГруппыНФА = КодГрупповогоСчета;
					ЗаголовокТабличнойЧасти.ГруппаНФА    = ТекущаяГруппаНФА.Наименование;
					СтрокаИспользуемыхГрупп.ПорядокСчета = Строка(СтрокиДокумента.КФО) + ТекущаяГруппаНФА.Порядок;
				КонецЕсли;
				СоставТабличнойЧасти = ЗаголовокТабличнойЧасти.Состав;
				СтрокиНФАПоГруппам.Вставить(КодГрупповогоСчета, ЗаголовокТабличнойЧасти);
			Иначе
				СоставТабличнойЧасти = ГруппировочнаяСтрока.Состав;
			КонецЕсли;
	
			НоваяСтрокаСостава = СоставТабличнойЧасти.Добавить();
			ЗаполнитьЗначенияСвойств(НеобязательныеРеквизиты, СтрокиДокумента);
			Если ЗначениеЗаполнено(НеобязательныеРеквизиты.НомерНоменклатурный) Тогда
				НоваяСтрокаСостава.ИнвентарныйНомер = НеобязательныеРеквизиты.НомерНоменклатурный;
			Иначе		
				НоваяСтрокаСостава.ИнвентарныйНомер = СтрокиДокумента.НФАКод;
			КонецЕсли;
			НоваяСтрокаСостава.КодЕИ = СтрокиДокумента.ЕдИзмКод;
			НоваяСтрокаСостава.КодСтроки = СтрокиДокумента.НомерСтроки;
			НоваяСтрокаСостава.Количество = СтрокиДокумента.Количество;
			НоваяСтрокаСостава.НаименованиеДоп = НеобязательныеРеквизиты.НФАДопНаименование;
			НоваяСтрокаСостава.НаименованиеЕИ = СтрокиДокумента.ЕдИзмНаименование;
			НоваяСтрокаСостава.НаименованиеНФА = СтрокиДокумента.НФАНаименование;
			НоваяСтрокаСостава.НФА = СтрокиДокумента.Номенклатура;
			НоваяСтрокаСостава.Сумма = СтрокиДокумента.Сумма;
	
			Если ВыборкаДокументов.СуммаУказанаВДокументе Тогда
				Если НоваяСтрокаСостава.Цена = 0 И НоваяСтрокаСостава.Количество <> 0 Тогда
					НоваяСтрокаСостава.Цена = НоваяСтрокаСостава.Сумма / НоваяСтрокаСостава.Количество;
				КонецЕсли;
			Иначе
				ОтборСтрокиДокумента = Новый Структура("Ссылка, НомерСтроки", ВыборкаДокументов.Ссылка, СтрокиДокумента.НомерСтроки);
				СтрокиДвижений = ДвиженияДокументов.НайтиСтроки(ОтборСтрокиДокумента);
				Если СтрокиДвижений.Количество() > 0 Тогда
					СтрокаСебестоимости = СтрокиДвижений[0];
					НоваяСтрокаСостава.Сумма = СтрокаСебестоимости.Сумма;
					НоваяСтрокаСостава.Цена = СтрокаСебестоимости.Цена;
				Иначе
					Если НоваяСтрокаСостава.Цена = 0 И НоваяСтрокаСостава.Количество <> 0 Тогда
						НоваяСтрокаСостава.Цена = НоваяСтрокаСостава.Сумма / НоваяСтрокаСостава.Количество;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ТипЗнч(СтрокиДокумента.Номенклатура) = Тип("СправочникСсылка.БСО")
					Или НеобязательныеРеквизиты.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.БСО Тогда
				Если ЗначениеЗаполнено(НеобязательныеРеквизиты.СерияБСО) Тогда
					НоваяСтрокаСостава.НаименованиеНФА = СтрШаблон(НСтр("ru = '%1 (серия %2)'"),
						НоваяСтрокаСостава.НаименованиеНФА, НеобязательныеРеквизиты.СерияБСО);
				КонецЕсли;
				НоваяСтрокаСостава.ИнвентарныйНомер = ПредставлениеНомеровБСОПоПриказу61н(
					НеобязательныеРеквизиты.НомерНачальный, НеобязательныеРеквизиты.НомерКонечный);
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция ДанныеДляПечати0510454(МассивОбъектов)
	ДокументыПоТипам = ОбщегоНазначенияБГУ.ДокументыПоТипам(МассивОбъектов);
	ДокументыМЗ = Новый Массив;
	ДокументыОС = Новый Массив;
	
	Для Каждого КлючИЗначение Из ДокументыПоТипам Цикл
		Если КлючИЗначение.Ключ = Тип("ДокументСсылка.АктСписанияМЗ") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДокументыМЗ, КлючИЗначение.Значение);
		Иначе
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДокументыОС, КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеДляПечати = ТаблицаШапкиДляПечатиАктаСписанияОбъектовНФА0510454();
	
	ДобавитьДанныеДляПечати0510454_ОС(ДанныеДляПечати, ДокументыОС);
	Документы.АктСписанияМЗ.ДобавитьДанныеДляПечатиАктаСписанияНФА0510454(ДанныеДляПечати, ДокументыМЗ);
	
	Возврат ДанныеДляПечати;
КонецФункции

Процедура ДобавитьДанныеДляПечати0510454_ОС(ДанныеДляПечати, МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	Документ.Организация КАК Организация,
	|	Документ.Подразделение КАК Подразделение,
	|	Документ.ЦМО КАК ЦМО,
	|	Документ.ВидИмущества КАК ВидИмущества,
	|	Документ.ОснованиеДляАкта КАК ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	|	Документ.НаименованиеПриказа КАК НаименованиеПриказа,
	|	Документ.НомерПриказа КАК НомерПриказа,
	|	Документ.ДатаПриказа КАК ДатаПриказа,
	|	Документ.Ответственный КАК Ответственный,
	|	Документ.Руководитель КАК Руководитель,
	|	Документ.ВидОперации КАК ВидОперации
	|ПОМЕСТИТЬ ВТ_Документ
	|ИЗ
	|	Документ.СписаниеОбъектовОС КАК Документ
	|ГДЕ
	|	Документ.Ссылка В (&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Номер,
	|	Документ.Дата,
	|	Документ.Организация,
	|	Документ.Подразделение,
	|	Документ.ЦМО,
	|	Документ.ВидИмущества,
	|	Документ.ОснованиеДляАкта,
	|	Документ.НомерОснованияДляАкта,
	|	Документ.ДатаОснованияДляАкта,
	|	Документ.НаименованиеПриказа,
	|	Документ.НомерПриказа,
	|	Документ.ДатаПриказа,
	|	Документ.Ответственный,
	|	Документ.Руководитель,
	|	Документ.ВидОперации
	|ИЗ
	|	Документ.СписаниеОбъектовИК КАК Документ
	|ГДЕ
	|	Документ.Ссылка В (&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|		ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК ДатаСписанияСБухУчета,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОсновныеСредства.Количество КАК Количество,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц КАК СуммаАмортизацииЗаТекущийМесяц,
	|	ОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ОсновныеСредства.ПричинаСписания КАК ПричинаСписания,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПричинаСписанияСсылка <> ЗНАЧЕНИЕ(Справочник.ПричиныСписанияНФА.ПустаяСсылка)
	|			ТОГДА ОсновныеСредства.ПричинаСписанияСсылка.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодПричинаСписания,
	|	ОсновныеСредства.МероприятияПоСписанию КАК МероприятияПоСписанию,
	|	ОсновныеСредства.РезолюцияКомиссии КАК РезолюцияКомиссии,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ОтразитьВКарточкеКапвложений
	|			ТОГДА ОсновныеСредства.КарточкаКапвложений
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КарточкиКапвложений.ПустаяСсылка)
	|	КОНЕЦ КАК КарточкаКапвложений
	|ПОМЕСТИТЬ ВТ_ОсновныеСредства
	|ИЗ
	|	Документ.СписаниеОбъектовОС.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ОсновныеСредства.Ссылка)
	|ГДЕ
	|	ОсновныеСредства.Ссылка В (&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|		ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ,
	|	ОсновныеСредства.НомерСтроки,
	|	ОсновныеСредства.ИдентификаторСтроки,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер,
	|	ОсновныеСредства.Количество,
	|	ОсновныеСредства.Сумма,
	|	ОсновныеСредства.СуммаАмортизации,
	|	ОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц,
	|	ОсновныеСредства.СуммаОбесценения,
	|	ОсновныеСредства.ПричинаСписания,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПричинаСписанияСсылка <> ЗНАЧЕНИЕ(Справочник.ПричиныСписанияНФА.ПустаяСсылка)
	|			ТОГДА ОсновныеСредства.ПричинаСписанияСсылка.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ОсновныеСредства.МероприятияПоСписанию,
	|	ОсновныеСредства.РезолюцияКомиссии,
	|	ЗНАЧЕНИЕ(Справочник.КарточкиКапвложений.ПустаяСсылка)
	|ИЗ
	|	Документ.СписаниеОбъектовИК.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ОсновныеСредства.Ссылка)
	|ГДЕ
	|	ОсновныеСредства.Ссылка В (&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставКомиссии.Ссылка КАК Ссылка,
	|	СоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СоставКомиссии.Сотрудник КАК Сотрудник,
	|	ЛОЖЬ КАК Председатель,
	|	СоставКомиссии.Отсутствует КАК Отсутствует,
	|	СоставКомиссии.ПричинаОтсутствия КАК ПричинаОтсутствия,
	|	СоставКомиссии.ДолжностьЧленаКомиссии КАК НаименованиеДолжности,
	|	СоставКомиссии.ФамилияЧленаКомиссии КАК Фамилия,
	|	СоставКомиссии.ИмяЧленаКомиссии КАК Имя,
	|	СоставКомиссии.ОтчествоЧленаКомиссии КАК Отчество
	|ПОМЕСТИТЬ ВТ_Комиссия
	|ИЗ
	|	Документ.СписаниеОбъектовОС.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В (&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	"""",
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.СписаниеОбъектовОС КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В (&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.Сотрудник,
	|	ЛОЖЬ,
	|	СоставКомиссии.Отсутствует,
	|	СоставКомиссии.ПричинаОтсутствия,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.СписаниеОбъектовИК.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В (&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	"""",
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.СписаниеОбъектовИК КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В (&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОС.ИнвНомер КАК ИнвентарныйНомер,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|			ТОГДА СобытияОС.ДатаСобытия
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ) КАК ДатаПринятияКУчету,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|			ТОГДА СобытияОС.ДатаСобытия
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ) КАК ДатаВводаВЭксплуатацию
	|ПОМЕСТИТЬ ВТ_События
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(, Организация В
	|		(ВЫБРАТЬ
	|			ВТ.Организация
	|		ИЗ
	|			ВТ_Документ КАК ВТ)
	|	И ОсновноеСредство В
	|		(ВЫБРАТЬ
	|			ВТ.ОсновноеСредство
	|		ИЗ
	|			ВТ_ОсновныеСредства КАК ВТ)) КАК СобытияОС
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.ОсновноеСредство,
	|	СобытияОС.ИнвНомер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документ.Ссылка КАК Ссылка,
	|	ВТ_Документ.Номер КАК Номер,
	|	ВТ_Документ.Дата КАК ДатаАкта,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ВТ_Документ.Организация
	|		ИНАЧЕ ВТ_Документ.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ВЫБОР
	|				КОГДА ВТ_Документ.Организация.НаименованиеПолное = """"
	|					ТОГДА ВТ_Документ.Организация.Наименование
	|				ИНАЧЕ ВТ_Документ.Организация.НаименованиеПолное
	|			КОНЕЦ
	|		ИНАЧЕ ВТ_Документ.Организация.ГоловнаяОрганизация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ВТ_Документ.Организация.КодПоРПБС
	|		ИНАЧЕ ВТ_Документ.Организация.ГоловнаяОрганизация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБС,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|		ИНАЧЕ ВТ_Документ.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_Документ.Организация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_Документ.Организация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБСПодр,
	|	ВТ_Документ.Подразделение КАК СтруктурноеПодразделение,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Подразделение.НаименованиеПолное = """"
	|			ТОГДА ВТ_Документ.Подразделение.Наименование
	|		ИНАЧЕ ВТ_Документ.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеСтруктурногоПодразделения,
	|	ВТ_Документ.Организация.КодПоППП.НаименованиеПолное КАК Учредитель,
	|	ВТ_Документ.Организация.КодПоППП.Код КАК ГлаваБК,
	|	ВТ_Документ.Организация.Бюджет.НаименованиеПолное КАК БюджетНаименование,
	|	ВТ_Документ.Организация.Бюджет.Код КАК ОКТМО,
	|	ВТ_Документ.ЦМО.Сотрудник КАК Сотрудник,
	|	ВТ_Документ.ЦМО.Сотрудник.Код КАК ТабельныйНомер,
	|	ВТ_Документ.ВидИмущества КАК ВидИмуществаСсылка,
	|	ВТ_Документ.ОснованиеДляАкта КАК ОснованиеДляАкта,
	|	ВТ_Документ.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	|	ВТ_Документ.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	|	ВТ_Документ.НаименованиеПриказа КАК НаименованиеПриказа,
	|	ВТ_Документ.НомерПриказа КАК НомерПриказа,
	|	ВТ_Документ.ДатаПриказа КАК ДатаПриказа,
	|	ВТ_Документ.Ответственный КАК Ответственный,
	|	ВТ_Документ.Руководитель КАК Руководитель,
	|	ВТ_Документ.ВидОперации КАК ВидОперации
	|ИЗ
	|	ВТ_Документ КАК ВТ_Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Документ.Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ОсновныеСредства.Ссылка КАК Ссылка,
	|	ВТ_ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ВТ_ОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВТ_ОсновныеСредства.ОсновноеСредство КАК ОбъектСсылка,
	|	ВЫБОР
	|		КОГДА ВТ_ОсновныеСредства.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ВТ_ОсновныеСредства.ОсновноеСредство.Наименование
	|		ИНАЧЕ ВТ_ОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОбъекта,
	|	ВТ_ОсновныеСредства.Количество КАК Количество,
	|	ВТ_ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомерСсылка,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_ОсновныеСредства.ИнвентарныйНомер) КАК ИнвентарныйНомер,
	|	ЕСТЬNULL(ВТ_ОсновныеСредства.ИнвентарныйНомер.РеестровыйНомер, """") КАК РеестровыйНомер,
	|	ЕСТЬNULL(ВТ_ОсновныеСредства.ИнвентарныйНомер.ЗаводскойНомер, """") КАК ЗаводскойНомер,
	|	ЕСТЬNULL(ВТ_ОсновныеСредства.ИнвентарныйНомер.ИнойНомер, """") КАК ИнойНомер,
	|	ЕСТЬNULL(ВТ_ОсновныеСредства.ИнвентарныйНомер.ДатаВыпуска, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыпуска,
	|	ВТ_ОсновныеСредства.Сумма КАК БалансоваяСтоимость,
	|	ВТ_ОсновныеСредства.Сумма - ВТ_ОсновныеСредства.СуммаАмортизации - ВТ_ОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц
	|		- ВТ_ОсновныеСредства.СуммаОбесценения КАК ОстаточнаяСтоимость,
	|	ВТ_ОсновныеСредства.ПричинаСписания КАК ПричинаСписания,
	|	ВТ_ОсновныеСредства.КодПричинаСписания КАК КодПричинаСписания,
	|	ВТ_ОсновныеСредства.МероприятияПоСписанию КАК Мероприятия,
	|	ВТ_ОсновныеСредства.РезолюцияКомиссии КАК РезолюцияКомиссии,
	|	ЕСТЬNULL(ВТ_События.ДатаПринятияКУчету, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПринятияКУчету,
	|	ЕСТЬNULL(ВТ_События.ДатаВводаВЭксплуатацию, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВводаВЭксплуатацию,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_События.ДатаВводаВЭксплуатацию, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|		ИЛИ ВТ_События.ДатаВводаВЭксплуатацию > ВТ_ОсновныеСредства.ДатаСписанияСБухУчета
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВТ_События.ДатаВводаВЭксплуатацию, ВТ_ОсновныеСредства.ДатаСписанияСБухУчета, МЕСЯЦ)
	|	КОНЕЦ КАК СрокЭксплуатации,
	|	ВТ_ОсновныеСредства.КарточкаКапвложений КАК КарточкаКапвложений
	|ИЗ
	|	ВТ_ОсновныеСредства КАК ВТ_ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_События КАК ВТ_События
	|		ПО ВТ_ОсновныеСредства.ОсновноеСредство = ВТ_События.ОсновноеСредство
	|		И ВТ_ОсновныеСредства.ИнвентарныйНомер = ВТ_События.ИнвентарныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Комиссия.Ссылка КАК Ссылка,
	|	ВТ_Комиссия.НомерСтроки КАК НомерСтроки,
	|	ВТ_Комиссия.Сотрудник КАК Сотрудник,
	|	ВТ_Комиссия.Председатель КАК Председатель,
	|	ВТ_Комиссия.НаименованиеДолжности КАК НаименованиеДолжности,
	|	ВТ_Комиссия.Фамилия КАК Фамилия,
	|	ВТ_Комиссия.Имя КАК Имя,
	|	ВТ_Комиссия.Отчество КАК Отчество,
	|	ВЫБОР
	|		КОГДА ВТ_Комиссия.Отсутствует
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Файлы.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ФайлыСотрудниковКДокументам.ФайлСотрудника КАК Справочник.Файлы),
	|			ЗНАЧЕНИЕ(Справочник.Файлы.ПустаяСсылка))
	|	КОНЕЦ КАК ФайлОсобогоМнения,
	|	ВЫБОР
	|		КОГДА ВТ_Комиссия.Отсутствует
	|			ТОГДА ВТ_Комиссия.ПричинаОтсутствия
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ФайлыСотрудниковКДокументам.ФайлСотрудника КАК Справочник.Файлы).Наименование, """")
	|	КОНЕЦ КАК ОсобыеОтметки
	|ИЗ
	|	ВТ_Комиссия КАК ВТ_Комиссия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФайлыСотрудниковКДокументам КАК ФайлыСотрудниковКДокументам
	|		ПО ВТ_Комиссия.Ссылка = ФайлыСотрудниковКДокументам.Документ
	|		И ВТ_Комиссия.Сотрудник = ФайлыСотрудниковКДокументам.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Файлы.ВладелецФайла КАК Ссылка,
	|	Файлы.Ссылка КАК Файл,
	|	Файлы.Наименование КАК ИмяФайла,
	|	Файлы.Расширение КАК Расширение,
	|	Файлы.Описание КАК Описание
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла В (&МассивОбъектов)
	|	И НЕ Файлы.Служебный
	|	И НЕ Файлы.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаДокументов = РезультатЗапроса[4].Выбрать();
	ВыборкаОбъектов = РезультатЗапроса[5].Выбрать();
	ВыборкаФайлы = РезультатЗапроса[7].Выбрать();
	СоставКомиссий = РезультатЗапроса[6].Выбрать();

	ПредставленияВидаИмущества = Новый Соответствие;
	ПредставленияВидаИмущества.Вставить(Перечисления.ВидыИмущества.НедвижимоеИмущество	, Новый Структура("Вид,Группа", "недвижимость"			, "10"));
	ПредставленияВидаИмущества.Вставить(Перечисления.ВидыИмущества.ДвижимоеОсобоЦенное	, Новый Структура("Вид,Группа", "особо ценное движимое"	, "20"));
	ПредставленияВидаИмущества.Вставить(Перечисления.ВидыИмущества.ИноеДвижимое			, Новый Структура("Вид,Группа", "иное движимое"			, "30"));
	ПредставленияВидаИмущества.Вставить(Перечисления.ВидыИмущества.Казна				, Новый Структура("Вид,Группа", "казна"					, "50"));
	
	ВОСписаниеКапвложений = Новый Массив;
	ВОСписаниеКапвложений.Добавить(Перечисления.ВидыОперацийСписанияОС.СписаниеКапвложений);
	
	Пока ВыборкаДокументов.Следующий() Цикл
		СтрокаДокумента = ДанныеДляПечати.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, ВыборкаДокументов);

		ВидИмущества = ПредставленияВидаИмущества[ВыборкаДокументов.ВидИмуществаСсылка];
		Если ВидИмущества <> Неопределено Тогда
			СтрокаДокумента.ВидИмущества = ВидИмущества.Вид;
			СтрокаДокумента.АналитическаяГруппа = ВидИмущества.Группа;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		СтрокаДокумента.СведенияОбОбъектах = ТаблицаСведенияОбОбъектахДляПечатиАктаСписанияОбъектовНФА0510454();
		
		ЭтоСписаниеКапвложений = (ВОСписаниеКапвложений.Найти(ВыборкаДокументов.ВидОперации) <> Неопределено);
		Если ЭтоСписаниеКапвложений Тогда
			// Этот документ списыает капвложения. В ф. 0510454, в этом случае, в гр.7, раздела 1 "Иной номер объекта"
			// выводится учетный номер объекта капвложений
			МассивККВ = Новый Массив;
			ВыборкаОбъектов.Сбросить();
			Пока ВыборкаОбъектов.НайтиСледующий(СтруктураПоиска) Цикл
				Если НЕ ЗначениеЗаполнено(ВыборкаОбъектов.КарточкаКапвложений) Тогда
					Продолжить;
				КонецЕсли;	 
				МассивККВ.Добавить(ВыборкаОбъектов.КарточкаКапвложений);
			КонецЦикла;	
			ДанныеККВ = Справочники.КарточкиКапвложений.УчетныеНомераОбъектовКапвложений(МассивККВ);
		КонецЕсли;	
		
		ВыборкаОбъектов.Сбросить();
		Пока ВыборкаОбъектов.НайтиСледующий(СтруктураПоиска) Цикл
			СтрокаСведенияОбОбъектах = СтрокаДокумента.СведенияОбОбъектах.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСведенияОбОбъектах, ВыборкаОбъектов);
			
			Если ЭтоСписаниеКапвложений Тогда
				СтрокаКарточки = ДанныеККВ.Найти(ВыборкаОбъектов.КарточкаКапвложений, "КарточкаКапвложений");
				Если СтрокаКарточки <> Неопределено 
					И ЗначениеЗаполнено(СтрокаКарточки.УчетныйНомерОбъектаКапвложений) Тогда
					СтрокаСведенияОбОбъектах.ИнойНомер = СтрокаКарточки.УчетныйНомерОбъектаКапвложений; 
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;

		СтрокаДокумента.СоставКомиссии = ТаблицаСоставКомиссииДляПечатиАктаСписанияОбъектовНФА0510454();		
		СоставКомиссий.Сбросить();
		Пока СоставКомиссий.НайтиСледующий(СтруктураПоиска) Цикл
			ЗаполнитьЗначенияСвойств(СтрокаДокумента.СоставКомиссии.Добавить(), СоставКомиссий);
		КонецЦикла;

		СтрокаДокумента.Приложения = ТаблицаФайлыДляПечатиАктаСписанияОбъектовНФА0510454();		
		ВыборкаФайлы.Сбросить();
		Пока ВыборкаФайлы.НайтиСледующий(СтруктураПоиска) Цикл
			ЗаполнитьЗначенияСвойств(СтрокаДокумента.Приложения.Добавить(), ВыборкаФайлы);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеДляПечати0510456(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ1.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Документ1.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК ДатаСписанияСБухУчета,
	|	Документ1.Номер КАК Номер,
	|	Документ1.Дата КАК Дата,
	|	Документ1.Организация КАК Организация,
	|	Документ1.Подразделение КАК Подразделение,
	|	Документ1.ЦМО КАК ЦМО,
	|	Документ1.СчетУчета КАК СчетУчета,
	|	Документ1.ОснованиеДляАкта КАК ОснованиеДляАкта,
	|	Документ1.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	|	Документ1.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	|	Документ1.НаименованиеПриказа КАК НаименованиеПриказа,
	|	Документ1.НомерПриказа КАК НомерПриказа,
	|	Документ1.ДатаПриказа КАК ДатаПриказа,
	|	Документ1.Ответственный КАК Ответственный,
	|	Документ1.ПробегСНачалаЭксплуатации КАК ПробегСНачалаЭксплуатации,
	|	Документ1.ПробегПослеКапРемонта КАК ПробегПослеКапРемонта,
	|	Документ1.ТехническоеСостояние КАК ТехническоеСостояние,
	|	Документ1.ОсновноеСредство КАК ОсновноеСредство,
	|	Документ1.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	1 КАК Количество,
	|	Документ1.Сумма КАК Сумма,
	|	Документ1.СуммаАмортизации КАК СуммаАмортизации,
	|	Документ1.СуммаАмортизацииЗаТекущийМесяц КАК СуммаАмортизацииЗаТекущийМесяц,
	|	Документ1.СуммаОбесценения КАК СуммаОбесценения,
	|	Документ1.ПричинаСписания КАК ПричинаСписания,
	|	ВЫБОР
	|		КОГДА Документ1.ПричинаСписанияСсылка <> ЗНАЧЕНИЕ(Справочник.ПричиныСписанияНФА.ПустаяСсылка)
	|			ТОГДА Документ1.ПричинаСписанияСсылка.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодПричинасписания,
	|	Документ1.МероприятияПоСписанию КАК МероприятияПоСписанию,
	|	Документ1.РезолюцияКомиссии КАК РезолюцияКомиссии,
	|	Документ1.Руководитель КАК Руководитель
	|ПОМЕСТИТЬ ВТ_Документ
	|ИЗ
	|	Документ.СписаниеТранспорта КАК Документ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = Документ1.Ссылка)
	|ГДЕ
	|	Документ1.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Документ1.Ссылка,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Документ1.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ,
	|	Документ1.Номер,
	|	Документ1.Дата,
	|	Документ1.Организация,
	|	Документ1.Подразделение,
	|	Документ1.ЦМО,
	|	Документ1.СчетУчета,
	|	Документ1.ОснованиеДляАкта,
	|	Документ1.НомерОснованияДляАкта,
	|	Документ1.ДатаОснованияДляАкта,
	|	Документ1.Комиссия.НаименованиеПриказа,
	|	Документ1.НомерПриказа,
	|	Документ1.ДатаПриказа,
	|	Документ1.Ответственный,
	|	Документ1.ПробегСНачалаЭксплуатации,
	|	Документ1.ПробегПослеКапРемонта,
	|	Документ1.ТехническоеСостояние,
	|	Документ1.ОсновноеСредство,
	|	Документ1.ИнвентарныйНомер,
	|	1,
	|	Документ1.Сумма,
	|	Документ1.СуммаАмортизации,
	|	Документ1.СуммаАмортизацииЗаТекущийМесяц,
	|	Документ1.СуммаОбесценения,
	|	Документ1.ПричинаСписания,
	|	ВЫБОР
	|		КОГДА Документ1.ПричинаСписанияСсылка <> ЗНАЧЕНИЕ(Справочник.ПричиныСписанияНФА.ПустаяСсылка)
	|			ТОГДА Документ1.ПричинаСписанияСсылка.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	Документ1.МероприятияПоСписанию,
	|	Документ1.РезолюцияКомиссии,
	|	Документ1.Руководитель
	|ИЗ
	|	Документ.СписаниеТранспортаИК КАК Документ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = Документ1.Ссылка)
	|ГДЕ
	|	Документ1.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставКомиссии.Ссылка КАК Ссылка,
	|	СоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	СоставКомиссии.Сотрудник КАК Сотрудник,
	|	ЛОЖЬ КАК Председатель,
	|	СоставКомиссии.Отсутствует КАК Отсутствует,
	|	СоставКомиссии.ПричинаОтсутствия КАК ПричинаОтсутствия,
	|	СоставКомиссии.ДолжностьЧленаКомиссии КАК НаименованиеДолжности,
	|	СоставКомиссии.ФамилияЧленаКомиссии КАК Фамилия,
	|	СоставКомиссии.ИмяЧленаКомиссии КАК Имя,
	|	СоставКомиссии.ОтчествоЧленаКомиссии КАК Отчество
	|ПОМЕСТИТЬ ВТ_Комиссия
	|ИЗ
	|	Документ.СписаниеТранспорта.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	"""",
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.СписаниеТранспорта КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставКомиссии.Ссылка,
	|	СоставКомиссии.НомерСтроки,
	|	СоставКомиссии.Сотрудник,
	|	ЛОЖЬ,
	|	СоставКомиссии.Отсутствует,
	|	СоставКомиссии.ПричинаОтсутствия,
	|	СоставКомиссии.ДолжностьЧленаКомиссии,
	|	СоставКомиссии.ФамилияЧленаКомиссии,
	|	СоставКомиссии.ИмяЧленаКомиссии,
	|	СоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.СписаниеТранспортаИК.СоставКомиссии КАК СоставКомиссии
	|ГДЕ
	|	СоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредседательКомиссии.Ссылка,
	|	0,
	|	ПредседательКомиссии.Председатель,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	"""",
	|	ПредседательКомиссии.ДолжностьПредседателяКомиссии,
	|	ПредседательКомиссии.ФамилияПредседателяКомиссии,
	|	ПредседательКомиссии.ИмяПредседателяКомиссии,
	|	ПредседательКомиссии.ОтчествоПредседателяКомиссии
	|ИЗ
	|	Документ.СписаниеТранспортаИК КАК ПредседательКомиссии
	|ГДЕ
	|	ПредседательКомиссии.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОС.ИнвНомер КАК ИнвентарныйНомер,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|				ТОГДА СобытияОС.ДатаСобытия
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаПринятияКУчету,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|				ТОГДА СобытияОС.ДатаСобытия
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаВводаВЭксплуатацию
	|ПОМЕСТИТЬ ВТ_События
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			,
	|			(Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ВТ_Документ КАК ВТ)) КАК СобытияОС
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОС.ОсновноеСредство,
	|	СобытияОС.ИнвНомер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПаспортаТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство,
	|	ПаспортаТранспортныхСредств.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПаспортаТранспортныхСредств.НомерКузова КАК НомерКузова,
	|	ПаспортаТранспортныхСредств.НомерШасси КАК НомерШасси,
	|	ПаспортаТранспортныхСредств.ДвигательНомер КАК НомерДвигателя,
	|	ПаспортаТранспортныхСредств.РегистрационныйЗнак КАК ГосНомер,
	|	ПаспортаТранспортныхСредств.Марка КАК Марка,
	|	ПаспортаТранспортныхСредств.Модель КАК Модель,
	|	ПаспортаТранспортныхСредств.Тип КАК Тип,
	|	ПаспортаТранспортныхСредств.Грузоподъемность КАК Грузоподъемность,
	|	ПаспортаТранспортныхСредств.СерияНомер КАК НомерПаспорта,
	|	ПаспортаТранспортныхСредств.Масса КАК Масса,
	|	ПаспортаТранспортныхСредств.ДатаСнятияСУчета КАК ДатаСнятияСУчета
	|ПОМЕСТИТЬ ВТ_ПТС
	|ИЗ
	|	РегистрСведений.ПаспортаТранспортныхСредств.СрезПоследних(
	|			,
	|			(Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ВТ_Документ КАК ВТ)) КАК ПаспортаТранспортныхСредств
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документ.Ссылка КАК Ссылка,
	|	ВТ_Документ.Номер КАК Номер,
	|	ВТ_Документ.Дата КАК ДатаАкта,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ВТ_Документ.Организация
	|		ИНАЧЕ ВТ_Документ.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Документ.Организация.НаименованиеПолное = """"
	|						ТОГДА ВТ_Документ.Организация.Наименование
	|					ИНАЧЕ ВТ_Документ.Организация.НаименованиеПолное
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_Документ.Организация.ГоловнаяОрганизация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ВТ_Документ.Организация.КодПоРПБС
	|		ИНАЧЕ ВТ_Документ.Организация.ГоловнаяОрганизация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБС,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|		ИНАЧЕ ВТ_Документ.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_Документ.Организация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ ВТ_Документ.Организация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБСПодр,
	|	ВТ_Документ.Подразделение КАК СтруктурноеПодразделение,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.Подразделение.НаименованиеПолное = """"
	|			ТОГДА ВТ_Документ.Подразделение.Наименование
	|		ИНАЧЕ ВТ_Документ.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеСтруктурногоПодразделения,
	|	ВТ_Документ.Организация.КодПоППП.НаименованиеПолное КАК Учредитель,
	|	ВТ_Документ.Организация.КодПоППП.Код КАК ГлаваБК,
	|	ВТ_Документ.Организация.Бюджет.НаименованиеПолное КАК БюджетНаименование,
	|	ВТ_Документ.Организация.Бюджет.Код КАК ОКТМО,
	|	ВТ_Документ.ЦМО.Сотрудник КАК Сотрудник,
	|	ВТ_Документ.ЦМО.Сотрудник.Код КАК ТабельныйНомер,
	|	ВТ_Документ.СчетУчета КАК СчетУчета,
	|	ВТ_Документ.ОснованиеДляАкта КАК ОснованиеДляАкта,
	|	ВТ_Документ.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	|	ВТ_Документ.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	|	ВТ_Документ.НаименованиеПриказа КАК НаименованиеПриказа,
	|	ВТ_Документ.НомерПриказа КАК НомерПриказа,
	|	ВТ_Документ.ДатаПриказа КАК ДатаПриказа,
	|	ВТ_Документ.Ответственный КАК Ответственный,
	|	ВТ_Документ.ПробегСНачалаЭксплуатации КАК ПробегСНачалаЭксплуатации,
	|	ВТ_Документ.ПробегПослеКапРемонта КАК ПробегПослеКапРемонта,
	|	ВТ_Документ.ТехническоеСостояние КАК ТехническоеСостояние,
	|	ВТ_Документ.ОсновноеСредство КАК ОбъектСсылка,
	|	ВЫБОР
	|		КОГДА ВТ_Документ.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ВТ_Документ.ОсновноеСредство.Наименование
	|		ИНАЧЕ ВТ_Документ.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОбъекта,
	|	1 КАК Количество,
	|	ВТ_Документ.ИнвентарныйНомер КАК ИнвентарныйНомерСсылка,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_Документ.ИнвентарныйНомер) КАК ИнвентарныйНомер,
	|	ЕСТЬNULL(ВТ_Документ.ИнвентарныйНомер.РеестровыйНомер, """") КАК РеестровыйНомер,
	|	ЕСТЬNULL(ВТ_Документ.ИнвентарныйНомер.ЗаводскойНомер, """") КАК ЗаводскойНомер,
	|	ЕСТЬNULL(ВТ_Документ.ИнвентарныйНомер.ИнойНомер, """") КАК ИнойНомер,
	|	ЕСТЬNULL(ГОД(ВТ_Документ.ИнвентарныйНомер.ДатаВыпуска), 0) КАК ГодВыпуска,
	|	ВТ_Документ.Сумма КАК БалансоваяСтоимость,
	|	ВТ_Документ.Сумма - ВТ_Документ.СуммаАмортизации - ВТ_Документ.СуммаАмортизацииЗаТекущийМесяц - ВТ_Документ.СуммаОбесценения КАК ОстаточнаяСтоимость,
	|	ВТ_Документ.ПричинаСписания КАК ПричинаСписания,
	|	ВТ_Документ.КодПричинасписания КАК КодПричинаСписания,
	|	ВТ_Документ.МероприятияПоСписанию КАК Мероприятия,
	|	ВТ_Документ.РезолюцияКомиссии КАК РезолюцияКомиссии,
	|	ВТ_Документ.Руководитель КАК Руководитель,
	|	ЕСТЬNULL(ВТ_События.ДатаПринятияКУчету, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПринятияКУчету,
	|	ЕСТЬNULL(ВТ_События.ДатаВводаВЭксплуатацию, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВводаВЭксплуатацию,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_События.ДатаВводаВЭксплуатацию, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ВТ_События.ДатаВводаВЭксплуатацию > ВТ_Документ.ДатаСписанияСБухУчета
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВТ_События.ДатаВводаВЭксплуатацию, ВТ_Документ.ДатаСписанияСБухУчета, МЕСЯЦ)
	|	КОНЕЦ КАК СрокЭксплуатации,
	|	ВТ_ПТС.НомерКузова КАК НомерКузова,
	|	ВТ_ПТС.НомерШасси КАК НомерШасси,
	|	ВТ_ПТС.НомерДвигателя КАК НомерДвигателя,
	|	ВТ_ПТС.ГосНомер КАК ГосНомер,
	|	ВТ_ПТС.Марка КАК Марка,
	|	ВТ_ПТС.Модель КАК Модель,
	|	ВТ_ПТС.Тип КАК Тип,
	|	ВТ_ПТС.Грузоподъемность КАК Грузоподъемность,
	|	ВТ_ПТС.НомерПаспорта КАК НомерПаспорта,
	|	ВТ_ПТС.Масса / 1000 КАК Масса,
	|	ЕСТЬNULL(ВТ_ПТС.ДатаСнятияСУчета, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСнятияСУчета
	|ИЗ
	|	ВТ_Документ КАК ВТ_Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_События КАК ВТ_События
	|		ПО ВТ_Документ.ОсновноеСредство = ВТ_События.ОсновноеСредство
	|			И ВТ_Документ.ИнвентарныйНомер = ВТ_События.ИнвентарныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПТС КАК ВТ_ПТС
	|		ПО ВТ_Документ.ОсновноеСредство = ВТ_ПТС.ОсновноеСредство
	|			И ВТ_Документ.ИнвентарныйНомер = ВТ_ПТС.ИнвентарныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Документ.Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Комиссия.Ссылка КАК Ссылка,
	|	ВТ_Комиссия.НомерСтроки КАК НомерСтроки,
	|	ВТ_Комиссия.Сотрудник КАК Сотрудник,
	|	ВТ_Комиссия.Председатель КАК Председатель,
	|	ВТ_Комиссия.НаименованиеДолжности КАК НаименованиеДолжности,
	|	ВТ_Комиссия.Фамилия КАК Фамилия,
	|	ВТ_Комиссия.Имя КАК Имя,
	|	ВТ_Комиссия.Отчество КАК Отчество,
	|	ВЫБОР
	|		КОГДА ВТ_Комиссия.Отсутствует
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Файлы.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ФайлыСотрудниковКДокументам.ФайлСотрудника КАК Справочник.Файлы), ЗНАЧЕНИЕ(Справочник.Файлы.ПустаяСсылка))
	|	КОНЕЦ КАК ФайлОсобогоМнения,
	|	ВЫБОР
	|		КОГДА ВТ_Комиссия.Отсутствует
	|			ТОГДА ВТ_Комиссия.ПричинаОтсутствия
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ФайлыСотрудниковКДокументам.ФайлСотрудника КАК Справочник.Файлы).Наименование, """")
	|	КОНЕЦ КАК ОсобыеОтметки
	|ИЗ
	|	ВТ_Комиссия КАК ВТ_Комиссия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФайлыСотрудниковКДокументам КАК ФайлыСотрудниковКДокументам
	|		ПО ВТ_Комиссия.Ссылка = ФайлыСотрудниковКДокументам.Документ
	|			И ВТ_Комиссия.Сотрудник = ФайлыСотрудниковКДокументам.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Файлы.ВладелецФайла КАК Ссылка,
	|	Файлы.Ссылка КАК Файл,
	|	Файлы.Наименование КАК ИмяФайла,
	|	Файлы.Расширение КАК Расширение,
	|	Файлы.Описание КАК Описание
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла В(&МассивОбъектов)
	|	И НЕ Файлы.Служебный
	|	И НЕ Файлы.ПометкаУдаления";
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

// Данные для печати акта о списании БСО0510461.
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
// 
// Возвращаемое значение:
//  см. ТаблицаШапкиДляПечатиАктаОСписанииБСО0510461
Функция ДанныеДляПечатиАктаОСписанииБСО0510461(МассивОбъектов)
	
	ДанныеДляПечати = ТаблицаШапкиДляПечатиАктаОСписанииБСО0510461();
	
	Для Каждого Документ Из ОбщегоНазначенияБГУ.ДокументыПоТипам(МассивОбъектов) Цикл
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ.Значение[0]);
		МенеджерДокумента.ДобавитьДанныеДляПечатиАктаОСписанииБСО0510461(ДанныеДляПечати, Документ.Значение);
	КонецЦикла;
	
	// Заполнить данные, которые можно заполнять одинаково для всех видов документов
	ДанныеОрганизацийПечати = ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	
	Для Каждого СтрокаШапки Из ДанныеДляПечати Цикл
		ДанныеОрганизации = ДанныеОрганизацийПечати.Получить(СтрокаШапки.Ссылка);
		СтрокаШапки.НаименованиеОрганизации = ДанныеОрганизации.НаименованиеОрганизации;
		СтрокаШапки.НаименованиеОбособленногоПодразделения = ДанныеОрганизации.НаименованиеОбособленногоПодразделения;
		СтрокаШапки.Учредитель = ДанныеОрганизации.Учредитель;
		СтрокаШапки.БюджетНаименование = ДанныеОрганизации.БюджетНаименование;
		СтрокаШапки.КодРПБС = ДанныеОрганизации.КодРПБС;
		СтрокаШапки.КодРПБСПодр = ДанныеОрганизации.КодРПБСОбособленногоПодразделения;
		СтрокаШапки.ГлаваБК = ДанныеОрганизации.ГлаваБК;
		СтрокаШапки.ОКТМО = ДанныеОрганизации.ОКТМО;
		СтрокаШапки.НаименованиеСтруктурногоПодразделения = ДанныеОрганизации.СтруктурноеПодразделение;

		СтрокаШапки.ОтветственныйДолжность = ДанныеОрганизации.ОтветственныйДолжность;
		СтрокаШапки.ОтветственныйФИО = КорреспондентыКлиентСервер.ФИО(ДанныеОрганизации.ОтветственныйФИО, Истина);
		СтрокаШапки.ОтветственныйТелефон = ДанныеОрганизации.ОтветственныйТелефон;
		СтрокаШапки.ОтветственныйЭлПочта = ДанныеОрганизации.ОтветственныйЭлПочта;
	КонецЦикла;
	
	Возврат ДанныеДляПечати;
	
КонецФункции

// Вывести файлы в печатную форму приказа61н.
// 
// Параметры:
//  ФайлыДокумента - см. ТаблицаФайлыДляПечатиПриказ61н
//  ТабличныйДокумент - ТабличныйДокумент
//  ОбластьПриложение - ТабличныйДокумент
Процедура ВывестиФайлыВПечатнуюФормуПриказа61н(ФайлыДокумента, ТабличныйДокумент, ОбластьПриложение)
	ПараметрыОбласти = Новый Структура("Номер", 0);
	Для Каждого Приложение Из ФайлыДокумента Цикл
		ПараметрыОбласти.Номер = ПараметрыОбласти.Номер + 1;
		ОбластьПриложение.Параметры.Заполнить(ПараметрыОбласти);
		ОбластьПриложение.Параметры.Заполнить(Приложение);
		ТабличныйДокумент.Вывести(ОбластьПриложение);
	КонецЦикла;
КонецПроцедуры

// Вывести комиссию в печатную форму приказа61н.
// 
// Параметры:
//  Комиссия - см. ТаблицаКомиссияДляПечатиПриказ61н
//  ТабличныйДокумент - ТабличныйДокумент
//  ОбластьЧленКомиссии - ТабличныйДокумент
Процедура ВывестиКомиссиюВПечатнуюФормуПриказа61н(Комиссия, ТабличныйДокумент, ОбластьЧленКомиссии)
	ПерваяСтрокаКомиссии = Истина;
	Для Каждого СтрокаКомиссии Из Комиссия Цикл
		ПараметрПредставление = Новый Структура("ПредставлениеЧленаКомиссии", "");
		Если СтрокаКомиссии.Председатель Тогда
			ПараметрПредставление.ПредставлениеЧленаКомиссии = "Председатель комиссии";
		ИначеЕсли ПерваяСтрокаКомиссии Тогда
			ПараметрПредставление.ПредставлениеЧленаКомиссии = "Члены комиссии";
			ПерваяСтрокаКомиссии = Ложь;
		КонецЕсли;
		ОбластьЧленКомиссии.Параметры.Заполнить(ПараметрПредставление);
		ОбластьЧленКомиссии.Параметры.Заполнить(СтрокаКомиссии);
		ТабличныйДокумент.Вывести(ОбластьЧленКомиссии);	
	КонецЦикла;
КонецПроцедуры

Функция ПредставлениеДолжностиДляПечатиАктСписанияМЗ0504230(Знач Должность)

	Должность = СокрЛП(Должность);
	Если СтрДлина(Должность) < 2 Тогда
		Возврат Должность;
	Иначе
		Возврат Нрег(Лев(Должность, 1)) + Сред(Должность, 2);
	КонецЕсли;

КонецФункции

// Новый данные организации.
// 
// Возвращаемое значение:
//  Структура - Новый данные организации:
// * Организация - СправочникСсылка.Организации - с учетом наличия головной организации (либо сама организация, либо головная)
// * НаименованиеОрганизации - Строка -
// * ИНН - Строка -
// * КодРПБС - Строка -
// * БюджетНаименование - Строка -
// * ГлаваБК - Строка -
// * ЮридическийАдресОрганизации - Строка -
// * Учредитель - Строка -
// * ОбособленноеПодразделение - СправочникСсылка.Организации - либо сама организация, либо пустая ссылка
// * НаименованиеОбособленногоПодразделения - Строка -
// * КодРПБСОбособленногоПодразделения - Строка -
// * КПП - Строка -
// * ОКТМО - Строка -
// * ОтветственныйДолжность - Строка -
// * ОтветственныйИсполнитель - СправочникСсылка.Сотрудники -
// * ОтветственныйТелефон - Строка -
// * ОтветственныйФИО - Строка -
// * ОтветственныйЭлПочта - Строка -
// * СтруктурноеПодразделение - СправочникСсылка.Подразделения -
// * НаименованиеСтруктурногоПодразделения - Строка -
Функция НовыйОбщиеСведенияДокументовДляПечати() 
	
	ДанныеОрганизации = Новый Структура;   
	
	ДанныеОрганизации.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ДанныеОрганизации.Вставить("НаименованиеОрганизации", ""); 
	ДанныеОрганизации.Вставить("ИНН", "");
	ДанныеОрганизации.Вставить("КПП", "");
    ДанныеОрганизации.Вставить("ЮридическийАдресОрганизации", "");
    ДанныеОрганизации.Вставить("КодРПБС", "");
    ДанныеОрганизации.Вставить("ОбособленноеПодразделение", Справочники.Организации.ПустаяСсылка());
	ДанныеОрганизации.Вставить("НаименованиеОбособленногоПодразделения", "");
	ДанныеОрганизации.Вставить("КодРПБСОбособленногоПодразделения", "");
    ДанныеОрганизации.Вставить("ГлаваБК", "");
	ДанныеОрганизации.Вставить("Учредитель", "");  // Наименование органа осуществляющего функции и  полномочия учредителя (наименование главы БК)
	ДанныеОрганизации.Вставить("УчредительППО", ""); // Наименование органа исполнительной власти - учредителя государственного (муниципального) учреждения
	
	ДанныеОрганизации.Вставить("БюджетНаименование", "");
	ДанныеОрганизации.Вставить("ОКТМО", ""); // ОКТМО бюджета (публично-правового образования)

	ДанныеОрганизации.Вставить("ОтветственныйИсполнитель", Справочники.Сотрудники.ПустаяСсылка());
	ДанныеОрганизации.Вставить("ОтветственныйДолжность", ""); // Полное наименование должности сотрудника 
	ДанныеОрганизации.Вставить("ОтветственныйДолжностьКратко", ""); // Краткое наименование должности сотрудника 
	ДанныеОрганизации.Вставить("ОтветственныйТелефон", "");
	ДанныеОрганизации.Вставить("ОтветственныйФИО", "");   // Фамилия, имя, отчество полностью
	ДанныеОрганизации.Вставить("ОтветственныйФамилияИнициалы", "");   // Фамилия и инициалы, например Иванов И.И.
	ДанныеОрганизации.Вставить("ОтветственныйЭлПочта", "");
	
	ДанныеОрганизации.Вставить("СтруктурноеПодразделение", Справочники.Подразделения.ПустаяСсылка());
	ДанныеОрганизации.Вставить("НаименованиеСтруктурногоПодразделения", "");  
	
	Возврат ДанныеОрганизации;
	
КонецФункции

 #Область ОбщиеТаблицыДанныхПечатиФорм61н

// Таблица шапки для печати общие реквизиты.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица шапки для печати общие реквизиты:
// * БюджетНаименование - Строка -
// * ГлаваБК - Строка -
// * Дата - Дата -
// * КодРПБС - Строка -
// * КодРПБСПодр - Строка -
// * НаименованиеОбособленногоПодразделения - Строка -
// * НаименованиеОрганизации - Строка -
// * НаименованиеСтруктурногоПодразделения - Строка -
// * Номер - Строка -
// * ОКТМО - Строка -
// * ОтветственныйДатаПодписи - Дата -
// * ОтветственныйДолжность - Строка -
// * ОтветственныйТелефон - Строка -
// * ОтветственныйФИО - Строка -
// * ОтветственныйЭлПочта - Строка -
// * Ссылка - ДокументСсылка
// * Учредитель - Строка -
Функция ТаблицаШапкиДляПечатиОбщиеРеквизиты()
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("БюджетНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ГлаваБК", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("КодРПБС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодРПБСПодр", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОбособленногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеСтруктурногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОКТМО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ОтветственныйДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйТелефон", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйЭлПочта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Результат.Колонки.Добавить("Учредитель", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
КонецФункции

#КонецОбласти

// НЕТ ВЫЗОВОВ ЭТИХ ФУНКЦИЙ
// ПОХОЖЕ В НАСТОЯЩИЙ МОМЕНТ ОНИ НЕ ИСПОЛЬЗУЮТСЯ

// #Область АктОбУтилизации0510435

//// Таблица файлы для печати акта об утилизации0510435.
//// 
//// Возвращаемое значение:
////  ТаблицаЗначений - Таблица файлы для печати акта об утилизации0510435:
//// * ИмяФайла - Строка -
//// * Описание - Строка -
//// * Файл - СправочникСсылка.Файлы -
//Функция ТаблицаФайлыДляПечатиАктаОбУтилизации0510435()

//	Результат = Новый ТаблицаЗначений;
//	Результат.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
//	Результат.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
//	Результат.Колонки.Добавить("Файл", Новый ОписаниеТипов("СправочникСсылка.Файлы"));
//	Возврат Результат;
//	
//КонецФункции

//// Таблица комиссия для печати акта об утилизации0510435.
//// 
//// Возвращаемое значение:
////  ТаблицаЗначений - Таблица комиссия для печати акта об утилизации0510435:
//// * ИмяФайла - Строка -
//// * НаименованиеДолжности - Строка -
//// * Председатель - Булево -
//// * ФИО - Строка -
//Функция ТаблицаКомиссияДляПечатиАктаОбУтилизации0510435()

//	Результат = Новый ТаблицаЗначений;
//	Результат.Колонки.Добавить("ИмяФайла", Новый ОписаниеТипов("Строка"));
//	Результат.Колонки.Добавить("НаименованиеДолжности", Новый ОписаниеТипов("Строка"));
//	Результат.Колонки.Добавить("Председатель", Новый ОписаниеТипов("Булево"));
//	Результат.Колонки.Добавить("ФИО", Новый ОписаниеТипов("Строка"));
//	
//	Возврат Результат;
//КонецФункции 

//#КонецОбласти  

 #Область НакладнаяНаВнутреннееПеремещение0510450

// Таблица группы передаваемых объектов накладная на внутреннее перемещение НФА0510450.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица группы передаваемых объектов накладная на внутреннее перемещение НФА0510450:
// * ГруппаНФА - Строка -
// * КодГруппыНФА - Строка -
// * Состав - см. ТаблицаСоставПередаваемыхОбъектовНакладнаяНаВнутреннееПеремещениеНФА0510450
Функция ТаблицаГруппыПередаваемыхОбъектовНакладнаяНаВнутреннееПеремещениеНФА0510450()
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ГруппаНФА", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодГруппыНФА", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Состав", Новый ОписаниеТипов("ТаблицаЗначений"));
	Возврат Результат;
КонецФункции

// Таблица состав передаваемых объектов накладная на внутреннее перемещение НФА0510450.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица состав передаваемых объектов накладная на внутреннее перемещение НФА0510450:
// * ИнвентарныйНомер - Строка -
// * ИнвентарныйНомерСсылка - СправочникСсылка.ИнвентарныеНомераОС -
// * КодЕИ - Строка -
// * КодСтроки - Число -
// * Количество - Число -
// * НаименованиеДоп - Строка -
// * НаименованиеЕИ - Строка -
// * НаименованиеНФА - Строка -
// * НомерДоп - Строка -
// * НомерНачальный - Строка
// * НомерКонечный - Строка
// * НФА - СправочникСсылка.Номенклатура, СправочникСсылка.ОсновныеСредства -
// * Сумма - Число -
// * Цена - Число -
Функция ТаблицаСоставПередаваемыхОбъектовНакладнаяНаВнутреннееПеремещениеНФА0510450()
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИнвентарныйНомерСсылка", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	Результат.Колонки.Добавить("КодЕИ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НаименованиеДоп", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеЕИ", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеНФА", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерДоп", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерНачальный", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерКонечный", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НФА", Новый ОписаниеТипов("СправочникСсылка.Номенклатура, СправочникСсылка.ОсновныеСредства"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ТребованиеНакладная0510451

Функция ТаблицаШапкиДляПечатиТребованияНакладной0510451()
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("БюджетНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ГлаваБК", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ДокументОснованиеДата", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ДокументОснованиеНомер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЗатребовалДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ЗатребовалДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЗатребовалФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодРПБС", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодРПБСПодр", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОбособленногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОтправитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеПолучатель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеСтруктурногоПодразделения", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОКТМО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ОтветственныйДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйТелефон", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтветственныйЭлПочта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтпустилДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ОтпустилДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтпустилФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПолучилДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ПолучилДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПолучилФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Ссылка", Документы.ТипВсеСсылки());
	Результат.Колонки.Добавить("УполномоченноеЛицоДатаПодписи", Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("УполномоченноеЛицоДолжность", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УполномоченноеЛицоФИО", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УчетныйНомерЗатребовал", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УчетныйНомерОтправитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("УчетныйНомерПолучатель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Учредитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЦМООтправитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЦМОПолучатель", Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
КонецФункции

Функция ТаблицаСоставаТабличнойЧастиДляПечатиТребованияНакладной0510451()
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ЕдИзмКод", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ЕдИзмНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Затребовано", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("НомерНоменклатурный", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НомерПаспорта", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НФАДопНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НФАНаименование", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	
	Возврат Результат;
КонецФункции

Функция ЗаголовокТабличнойЧастиТребованияНакладной0510451()
	ЗаголовокТабличнойЧасти = Новый Структура;
	ЗаголовокТабличнойЧасти.Вставить("ГруппаНФА");
	ЗаголовокТабличнойЧасти.Вставить("КодГруппыНФА");
	ЗаголовокТабличнойЧасти.Вставить("Состав", ТаблицаСоставаТабличнойЧастиДляПечатиТребованияНакладной0510451());
	Возврат ЗаголовокТабличнойЧасти;
КонецФункции

// Формирирует данные для вывода печтных форм требования-накладной 0510451.
// 
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка
// 
// Возвращаемое значение:
//  Структура:
//   * ДанныеШапки - см. ТаблицаШапкиДляПечатиТребованияНакладной0510451
//   * ТабличнаяЧасть - Соответствие Из Массив из см. ЗаголовокТабличнойЧастиТребованияНакладной0510451
//
Функция ДанныеДляПечатиТребованияНакладной0510451(МассивОбъектов)
	
	ДанныеОрганизацийПечати = ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
	ДанныеГруппНФА = ГруппыОбъектовНФА();
	РезультатЗапроса = ЗапросДляПечатиТребованияНакладной0510451(МассивОбъектов);
	ВыборкаШапка = РезультатЗапроса.ДанныеШапки;

	ДвиженияДокументов = УправлениеМатериальнымиЗапасами.ДвиженияДокументов(МассивОбъектов);
	ДвиженияДокументов.Индексы.Добавить("Ссылка, НомерСтроки");
	
	ДанныеТабличныхЧастей = Новый Соответствие;
	ДанныеШапки = ТаблицаШапкиДляПечатиТребованияНакладной0510451();
	Пока ВыборкаШапка.Следующий() Цикл
		СтрокаШапки = ДанныеШапки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаШапки, ВыборкаШапка);
		СтрокаШапки.Номер = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаШапка.Ссылка, ВыборкаШапка.Номер);
		
		ДанныеОрганизации = ДанныеОрганизацийПечати.Получить(ВыборкаШапка.Ссылка);
		СтрокаШапки.НаименованиеОрганизации = ДанныеОрганизации.НаименованиеОрганизации;
		СтрокаШапки.НаименованиеОбособленногоПодразделения = ДанныеОрганизации.НаименованиеОбособленногоПодразделения;
		СтрокаШапки.НаименованиеСтруктурногоПодразделения = ДанныеОрганизации.СтруктурноеПодразделение;
		СтрокаШапки.Учредитель = ДанныеОрганизации.Учредитель;
		СтрокаШапки.БюджетНаименование = ДанныеОрганизации.БюджетНаименование;
		СтрокаШапки.КодРПБС = ДанныеОрганизации.КодРПБС;
		СтрокаШапки.КодРПБСПодр = ДанныеОрганизации.КодРПБСОбособленногоПодразделения;
		СтрокаШапки.ГлаваБК = ДанныеОрганизации.ГлаваБК;
		СтрокаШапки.ОКТМО = ДанныеОрганизации.ОКТМО;

		// Данные о сотрудниках
		ПоляСотрудника = "СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, НаименованиеПолное, Должность, ДолжностьНаименование, ДолжностьНаименованиеПолное, Код";
		СотрудникиДокумента = Новый Массив;
		СотрудникиДокумента.Добавить(ВыборкаШапка.УполномоченноеЛицо);
		СотрудникиДокумента.Добавить(ВыборкаШапка.Затребовал);
		СотрудникиДокумента.Добавить(ВыборкаШапка.СотрудникОтправитель);
		СотрудникиДокумента.Добавить(ВыборкаШапка.СотрудникПолучатель);
		ДанныеСотрудников = Справочники.Сотрудники.ДанныеСотрудников(СотрудникиДокумента, ПоляСотрудника, ВыборкаШапка.Дата);
		
		ДанныеСотрудника = ДанныеСотрудников.Получить(ВыборкаШапка.УполномоченноеЛицо);
		Если ЗначениеЗаполнено(ДанныеСотрудника.ДолжностьНаименованиеПолное) Тогда
			СтрокаШапки.УполномоченноеЛицоДолжность = ДанныеСотрудника.ДолжностьНаименованиеПолное;
		Иначе
			СтрокаШапки.УполномоченноеЛицоДолжность = ДанныеСотрудника.ДолжностьНаименование;
		КонецЕсли;
		СтрокаШапки.УполномоченноеЛицоФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		
		ДанныеСотрудника = ДанныеСотрудников.Получить(ВыборкаШапка.Затребовал);
		Если ЗначениеЗаполнено(ДанныеСотрудника.ДолжностьНаименованиеПолное) Тогда
			СтрокаШапки.ЗатребовалДолжность = ДанныеСотрудника.ДолжностьНаименованиеПолное;
		Иначе
			СтрокаШапки.ЗатребовалДолжность = ДанныеСотрудника.ДолжностьНаименование;
		КонецЕсли;
		СтрокаШапки.ЗатребовалФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		СтрокаШапки.УчетныйНомерЗатребовал = ДанныеСотрудника.Код;
		
		ДанныеСотрудника = ДанныеСотрудников.Получить(ВыборкаШапка.СотрудникОтправитель);
		СтрокаШапки.ЦМООтправитель = ДанныеСотрудника.НаименованиеПолное;
		СтрокаШапки.УчетныйНомерОтправитель = ДанныеСотрудника.Код;
		Если ЗначениеЗаполнено(ДанныеСотрудника.ДолжностьНаименованиеПолное) Тогда
			СтрокаШапки.ОтпустилДолжность = ДанныеСотрудника.ДолжностьНаименованиеПолное;
		Иначе
			СтрокаШапки.ОтпустилДолжность = ДанныеСотрудника.ДолжностьНаименование;
		КонецЕсли;
		СтрокаШапки.ОтпустилФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		
		ДанныеСотрудника = ДанныеСотрудников.Получить(ВыборкаШапка.СотрудникПолучатель);
		СтрокаШапки.ЦМОПолучатель= ДанныеСотрудника.НаименованиеПолное;
		СтрокаШапки.УчетныйНомерПолучатель = ДанныеСотрудника.Код;
		Если ЗначениеЗаполнено(ДанныеСотрудника.ДолжностьНаименованиеПолное) Тогда
			СтрокаШапки.ПолучилДолжность = ДанныеСотрудника.ДолжностьНаименованиеПолное;
		Иначе
			СтрокаШапки.ПолучилДолжность = ДанныеСотрудника.ДолжностьНаименование;
		КонецЕсли;
		СтрокаШапки.ПолучилФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		
		СтрокаШапки.ОтветственныйДолжность = ДанныеОрганизации.ОтветственныйДолжность;
		СтрокаШапки.ОтветственныйФИО = КорреспондентыКлиентСервер.ФИО(ДанныеОрганизации.ОтветственныйФИО, Истина);
		СтрокаШапки.ОтветственныйТелефон = ДанныеОрганизации.ОтветственныйТелефон;
		СтрокаШапки.ОтветственныйЭлПочта = ДанныеОрганизации.ОтветственныйЭлПочта;
		
		ТабличныеЧасти = РезультатЗапроса.ДанныеТабличныхЧастей.Получить(ТипЗнч(ВыборкаШапка.Ссылка));
		
		ТабличныеЧасти.Сбросить();
		Если ТабличныеЧасти.НайтиСледующий(Новый Структура("Ссылка", ВыборкаШапка.Ссылка)) Тогда
			СтрокиДокумента = ТабличныеЧасти.Выбрать();
		Иначе
			СтрокиДокумента = Неопределено;
		КонецЕсли;
	
		СтрокиНФАПоГруппам = Новый Соответствие;
		ИспользуемыеГруппы = Новый ТаблицаЗначений;
		ИспользуемыеГруппы.Колонки.Добавить("КодГруппы", Новый ОписаниеТипов("Строка"));
		ИспользуемыеГруппы.Колонки.Добавить("ПорядокСчета", Новый ОписаниеТипов("Строка"));
		
		ДанныеТабличныхЧастейДокумента = Новый Массив;
		Пока СтрокиДокумента <> Неопределено И СтрокиДокумента.Следующий() Цикл
			
			КодГрупповогоСчета = Строка(СтрокиДокумента.КФО);
			ТекущаяГруппаНФА = ДанныеГруппНФА.Получить(СтрокиДокумента.СчетУчета);
			Если ТекущаяГруппаНФА <> Неопределено Тогда
				КодГрупповогоСчета = КодГрупповогоСчета + "." + ТекущаяГруппаНФА.Код;
			КонецЕсли;
			
			ГруппировочнаяСтрока = СтрокиНФАПоГруппам.Получить(КодГрупповогоСчета);
			Если ГруппировочнаяСтрока = Неопределено Тогда
				ЗаголовокТабличнойЧасти = ЗаголовокТабличнойЧастиТребованияНакладной0510451();
				СтрокаИспользуемыхГрупп = ИспользуемыеГруппы.Добавить();
				СтрокаИспользуемыхГрупп.КодГруппы = КодГрупповогоСчета;
				Если ТекущаяГруппаНФА <> Неопределено Тогда
					ЗаголовокТабличнойЧасти.КодГруппыНФА = КодГрупповогоСчета;
					ЗаголовокТабличнойЧасти.ГруппаНФА    = ТекущаяГруппаНФА.Наименование;
					СтрокаИспользуемыхГрупп.ПорядокСчета = Строка(СтрокиДокумента.КФО) + ТекущаяГруппаНФА.Порядок;
				КонецЕсли;
				СоставТабличнойЧасти = ЗаголовокТабличнойЧасти.Состав;
				СтрокиНФАПоГруппам.Вставить(КодГрупповогоСчета, ЗаголовокТабличнойЧасти);
			Иначе
				СоставТабличнойЧасти = ГруппировочнаяСтрока.Состав;
			КонецЕсли;
	
			НоваяСтрокаСостава = СоставТабличнойЧасти.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСостава, СтрокиДокумента);
			НоваяСтрокаСостава.КодСтроки = СтрокиДокумента.НомерСтроки;
			Если Не ЗначениеЗаполнено(НоваяСтрокаСостава.НомерНоменклатурный) Тогда
				НоваяСтрокаСостава.НомерНоменклатурный = СтрокиДокумента.НФАКод;
			КонецЕсли;
			Если ТипЗнч(ВыборкаШапка.Ссылка) = Тип("ДокументСсылка.ТребованиеНакладнаяИК") Тогда
				УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(
					ВыборкаШапка.Организация, ВыборкаШапка.Дата);
				СуммаУказанаВДокументе = Не УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны;
			Иначе
				СуммаУказанаВДокументе = ВыборкаШапка.СуммаУказанаВДокументе; 
			КонецЕсли;
			Если СуммаУказанаВДокументе Тогда
				Если НоваяСтрокаСостава.Цена = 0 И НоваяСтрокаСостава.Количество <> 0 Тогда
					НоваяСтрокаСостава.Цена = НоваяСтрокаСостава.Сумма / НоваяСтрокаСостава.Количество;
				КонецЕсли;
			Иначе
				ОтборСтрокиДокумента = Новый Структура("Ссылка, НомерСтроки", ВыборкаШапка.Ссылка, СтрокиДокумента.НомерСтроки);
				СтрокиДвижений = ДвиженияДокументов.НайтиСтроки(ОтборСтрокиДокумента);
				Если СтрокиДвижений.Количество() > 0 Тогда
					СтрокаСебестоимости = СтрокиДвижений[0];
					НоваяСтрокаСостава.Сумма = СтрокаСебестоимости.Сумма;
					НоваяСтрокаСостава.Цена = СтрокаСебестоимости.Цена;
				Иначе
					Если НоваяСтрокаСостава.Цена = 0 И НоваяСтрокаСостава.Количество <> 0 Тогда
						НоваяСтрокаСостава.Цена = НоваяСтрокаСостава.Сумма / НоваяСтрокаСостава.Количество;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ДанныеБСО = Новый Структура;
			ДанныеБСО.Вставить("Номенклатура");
			ДанныеБСО.Вставить("СерияБСО");
			ДанныеБСО.Вставить("НомерНачальный");
			ДанныеБСО.Вставить("НомерКонечный");
			ДанныеБСО.Вставить("ТипНоменклатуры");
			ЗаполнитьЗначенияСвойств(ДанныеБСО, СтрокиДокумента);
			Если ТипЗнч(ДанныеБСО.Номенклатура) = Тип("СправочникСсылка.БСО")
					Или ДанныеБСО.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.БСО Тогда
				Если ЗначениеЗаполнено(ДанныеБСО.СерияБСО) Тогда
					НоваяСтрокаСостава.НФАНаименование = СтрШаблон(НСтр("ru = '%1 (серия %2)'"),
						НоваяСтрокаСостава.НФАНаименование, ДанныеБСО.СерияБСО);
				КонецЕсли;
				НоваяСтрокаСостава.НомерНоменклатурный = ПредставлениеНомеровБСОПоПриказу61н(
					ДанныеБСО.НомерНачальный, ДанныеБСО.НомерКонечный);
			КонецЕсли;
		КонецЦикла;
		
		ДанныеТабличныхЧастейДокумента = Новый Массив;
		ИспользуемыеГруппы.Сортировать("ПорядокСчета");
		Для Каждого ИспользуемаяГруппа Из ИспользуемыеГруппы Цикл
			СтрокиГруппы = СтрокиНФАПоГруппам.Получить(ИспользуемаяГруппа.КодГруппы);
			ДанныеТабличныхЧастейДокумента.Добавить(СтрокиГруппы);
		КонецЦикла;
		ДанныеТабличныхЧастей.Вставить(ВыборкаШапка.Ссылка, ДанныеТабличныхЧастейДокумента);
		
	КонецЦикла;
	
	ДанныеДляПечати = Новый Структура;
	ДанныеДляПечати.Вставить("ДанныеШапки", ДанныеШапки);
	ДанныеДляПечати.Вставить("ТабличнаяЧасть", ДанныеТабличныхЧастей);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция ЗапросДляПечатиТребованияНакладной0510451(МассивОбъектов)
	ДокументыПоТипам = ОбщегоНазначенияБГУ.ДокументыПоТипам(МассивОбъектов);
	ЧастиЗапросаШапки = Новый Массив;
	ЧастиОсновногоЗапроса = Новый Массив;
	Запрос = Новый Запрос;
	
	ЧастиОсновногоЗапроса.Добавить("");
	Счетчик = 1;
	Для Каждого ТипДокумента Из ДокументыПоТипам Цикл
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ТипДокумента.Значение[0]);
		ИмяПараметра = "&МассивОбектов" + Счетчик;
		ЧастиЗапросаШапки.Добавить(
			СтрЗаменить(МенеджерДокумента.ТекстЗапросаШапкиДляПечатиТребованияНакладной0510451(),
						"&МассивОбъектов",
						ИмяПараметра));
		ЧастиОсновногоЗапроса.Добавить(
			СтрЗаменить(МенеджерДокумента.ТекстЗапросаТаблицДляПечатиТребованияНакладной0510451(),
						"&МассивОбъектов",
						ИмяПараметра));
		Запрос.УстановитьПараметр(Сред(ИмяПараметра, 2), ТипДокумента.Значение);
	КонецЦикла;
	ЧастиОсновногоЗапроса[0] = СтрСоединить(ЧастиЗапросаШапки, ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("ВСЕ"));

	ТекстЗапроса = СтрСоединить(ЧастиОсновногоЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	// Установить "Разрешенные" во все запросы
	ТекущийНомер = 1;
	Для Каждого ЗапросПакета Из СхемаЗапроса.ПакетЗапросов Цикл
		ЗапросПакета.ВыбиратьРазрешенные = Истина;
		Если ТекущийНомер = 1 Тогда
			ЗапросПакета.Порядок.Добавить("Дата");
			ЗапросПакета.Порядок.Добавить("Номер");
		Иначе
			// Установить упорядочивание и итоги
			ЗапросПакета.Порядок.Добавить("Ссылка");
			ЗапросПакета.Порядок.Добавить("НомерСтроки");
			ЗапросПакета.КонтрольныеТочкиИтогов.Добавить("Ссылка");
		КонецЕсли;
		ТекущийНомер = ТекущийНомер + 1;
	КонецЦикла;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ДатаСчетов106БезПартии = '20210101';
	Запрос.УстановитьПараметр("Счета106хП", БухгалтерскийУчет.СписокСчетов("106.2П,106.3П", ДатаСчетов106БезПартии));
	Запрос.УстановитьПараметр("ЕдИзмШт", Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796"));
	Запрос.УстановитьПараметр("Счет10856", БухгалтерскийУчет.СчетПоКоду("108.56"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("ДанныеШапки", РезультатЗапроса[0].Выбрать());
	ДанныеЗапроса.Вставить("ДанныеТабличныхЧастей", Новый Соответствие);
	НомерЗапроса = 1;
	Для Каждого ТипДокумента Из ДокументыПоТипам Цикл
		ДанныеЗапроса.ДанныеТабличныхЧастей.Вставить(ТипДокумента.Ключ, РезультатЗапроса[НомерЗапроса].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
		НомерЗапроса = НомерЗапроса + 1;
	КонецЦикла;
	Возврат ДанныеЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти 

