#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
	
// Процедура представляет собой «точку входа», позволяющую механизмам подсистемы «Обмен данными» получить доступ ко всем свойствам
// и методам плана обмена, отвечающим за технологическую и прикладную специфику конкретного обмена.
//
// Параметры :
//	Настройки - Структура - настройки обмена заполняются процедурой.
//
Процедура ПриПолученииНастроек(Настройки) Экспорт
	
	Настройки.НазначениеПланаОбмена = "СинхронизацияСДругойПрограммой";		
	Настройки.ПредупреждатьОНесоответствииВерсийПравилОбмена = Ложь;
	Настройки.ЭтоПланОбменаXDTO = Истина;
	Настройки.ИмяКонфигурацииИсточника = "БухгалтерияГосударственногоУчреждения"; 
	Настройки.ФорматОбмена = "http://v8.1c.ru/edi/edi_stnd/StateAccounting";

	ВерсииФормата = Новый Соответствие;
	ВерсииФормата.Вставить("2.0", ФИББГУМенеджерОбмена);
	Настройки.ВерсииФорматаОбмена = ВерсииФормата;

	Настройки.ПланОбменаИспользуетсяВМоделиСервиса = Истина;

	Настройки.ПравилаРегистрацииВМенеджере = Истина; 
	Настройки.ИмяМенеджераРегистрации = "ФИББГУМенеджерРегистрации";
	
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки = Истина;
	Настройки.Алгоритмы.НастроитьИнтерактивнуюВыгрузку = Истина;	
	Настройки.Алгоритмы.ОписаниеОграниченийПередачиДанных = Истина;
	
	ФИББГУМенеджерОбменаПереопределяемый.УзелОбмена_ПриПолученииНастроек(Настройки)

КонецПроцедуры

// Заполнение свойств варианата настройки.
//
// Параметры :
//	ОписаниеВарианта - Структура - содержит перечень доступных свойств варианта настройки.
//	ИдентификаторНастройки - Строка - строковый идентификатор варианта настройки.
//	ПараметрыКонтекста - Структура - контекст выполнения.
// 
Процедура ПриПолученииОписанияВариантаНастройки(Знач ОписаниеВарианта, Знач ИдентификаторНастройки, Знач ПараметрыКонтекста) Экспорт
	Перем Текст;
	
	Текст = НСтр("ru = '""1С:Бюджет муниципального образования 8""'"); 
	Текст = Текст + " / " + НСтр("ru = '""1С:Бухгалтерия государственного учреждения, редакция 2.0""'"); 
	ОписаниеВарианта.ЗаголовокКомандыДляСозданияНовогоОбменаДанными = Текст;
	Текст = НСтр("ru = 'Обмен данными с базой данных конфигурации'") + " " + Текст;
	ОписаниеВарианта.ЗаголовокУзлаПланаОбмена = Текст;
	ОписаниеВарианта.ЗаголовокПомощникаСозданияОбмена = Текст + НСтр("ru = ' (настройка)'");
	ОписаниеВарианта.ИмяФайлаНастроекДляПриемника = "BGU20";
	ОписаниеВарианта.ИспользоватьПомощникСозданияОбменаДанными = Истина;
	ОписаниеВарианта.ИспользуемыеТранспортыСообщенийОбмена = ОбщегоНазначенияБГУ.ИспользуемыеТранспортыСообщенийОбмена();
	Текст = НСтр("ru = 'Позволяет передавать и получать данные между базами данных.'");
	Текст = Текст + Символы.ПС + НСтр("ru = 'При синхронизации между базами данных ""1С:Бухгалтерия государственного учреждения, редакция 2.0""'");
	Текст = Текст + НСтр("ru = 'передается информация только о бюджетной классификации и бухгалтерских проводках.'");
	ОписаниеВарианта.КраткаяИнформацияПоОбмену = Текст; 
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену = "ПланОбмена.ФИБОбменБГУ.Форма.ПодробнаяИнформация";
	ОписаниеВарианта.ИмяКонфигурацииКорреспондента = "";
	ОписаниеВарианта.ПоддерживаетсяСопоставлениеДанных = Ложь;
	ФИББГУМенеджерОбменаПереопределяемый.УзелОбмена_ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста);

КонецПроцедуры
	
// Возвращает строку описания ограничений миграции данных для пользователя.
//
// Параметры:
//  НастройкаОтборовНаУзле - Структура - структура отборов на узле плана обмена.
//  ВерсияКорреспондента - Строка - версия корреспондента.
//	ИдентификаторНастройки - Строка - имя дополнительной настройки обмена.
//
// Возвращаемое значение:
//	Строка - описание ограничений миграции данных для пользователя.
//
Функция ОписаниеОграниченийПередачиДанных(Знач НастройкаОтборовНаУзле, Знач ВерсияКорреспондента, Знач ИдентификаторНастройки) Экспорт
	Перем Знч, Рез;

	Если (ТипЗнч(НастройкаОтборовНаУзле) <> Тип("Структура")) Тогда
		Возврат "";
	КонецЕсли;
	Рез = Новый Массив;
	// Представление режима выгрузки БК.
	Если НастройкаОтборовНаУзле.Свойство("РежимВыгрузкиБК", Знч) Тогда
		Если (Знч = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать) Тогда
			Рез.Добавить(НСтр("ru = 'Не отправлять информацию о бюджетной классификации'"));
		ИначеЕсли (Знч = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости) Тогда
			Рез.Добавить(НСтр("ru = 'Отправлять информацию о бюджетной классификации только используемую в документах'"));
		Иначе
			Рез.Добавить(НСтр("ru = 'Отправлять информацию о бюджетной классификации'"));
		КонецЕсли;
	КонецЕсли;
	// Представление режима выгрузки НПА.
	Если НастройкаОтборовНаУзле.Свойство("РежимВыгрузкиСправочников", Знч) Тогда
		Если (Знч = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать) Тогда
			Рез.Добавить(НСтр("ru = 'Не отправлять нормативно-справочную информацию'"));
		ИначеЕсли (Знч = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости) Тогда
			Рез.Добавить(НСтр("ru = 'Отправлять нормативно-справочную информацию только используемую в документах'"));
		Иначе
			Рез.Добавить(НСтр("ru = 'Отправлять нормативно-справочную информацию'"));
		КонецЕсли;
	КонецЕсли;
	// Представление режима выгрузки ЕПСБУ.
	Если НастройкаОтборовНаУзле.Свойство("РежимВыгрузкиЕПСБУ", Знч) Тогда
		Если (Знч = Перечисления.РежимыВыгрузкиОбъектовОбмена.НеВыгружать) Тогда
			Рез.Добавить(НСтр("ru = 'Не отправлять данные из бухгалтерского регистра'"));
		Иначе
			Если НастройкаОтборовНаУзле.Свойство("ДатаНачалаВыгрузкиЕПСБУ", Знч) Тогда
				Рез.Добавить(СтрШаблон(НСтр("ru = 'Отправлять данные из бухгалтерского регистра, начиная с даты %1'"), Формат(Знч, "ДФ=dd.MM.yyyy")));
			Иначе
				Рез.Добавить(НСтр("ru = 'Отправлять данные из бухгалтерского регистра'"));
			КонецЕсли;
			Если НастройкаОтборовНаУзле.Свойство("Организации", Знч) Тогда
				Рез.Добавить(НСтр("ru = 'Отправлять информацию с ограничениями по организациям:'") + " " + СтрСоединить(Знч.Организация, "; "));
			КонецЕсли;	
			Если (НастройкаОтборовНаУзле.Свойство("ИспользоватьОтборПоСчетам", Знч) И (Знч = Истина)) Тогда
				Если НастройкаОтборовНаУзле.Свойство("Счета", Знч) Тогда
					Рез.Добавить(НСтр("ru = 'Отправлять информацию с ограничениями по бухгалтерским счетам:'") + " " + СтрСоединить(Знч.Счет, "; "));
				КонецЕсли;	
			КонецЕсли;	
			Если (НастройкаОтборовНаУзле.Свойство("ВыгружатьДанныеПоЗабалансовымСчетам", Знч) И (Знч = Истина)) Тогда
				Рез.Добавить(НСтр("ru = 'Отправлять информацию по забалансовым счетам'"));
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	// Представление режима проверки.
	Если НастройкаОтборовНаУзле.Свойство("ПроверятьПолученныеДокументы", Знч) Тогда
		Если (Знч = Истина) Тогда
			Рез.Добавить(НСтр("ru = 'Проверять корректность заполнения бухгалтерских операций, полученных из других программ'"));
		Иначе	
			Рез.Добавить(НСтр("ru = 'Не проверять корректность заполнения бухгалтерских операций, полученных из других программ'"));
		КонецЕсли;
	КонецЕсли;
	Возврат СтрСоединить(Рез, Символы.ПС);

КонецФункции

// Предназначена для настройки вариантов интерактивной настройки выгрузки по сценарию узла.
// Для настройки необходимо установить значения свойств параметров в необходимые значения.
//
// Параметры:
//     Получатель - ПланОбменаСсылка - Узел, для которого производится настройка.
//     Параметры  - Структура        - Параметры для изменения. Содержит поля:
//
//         ВариантБезДополнения - Структура     - настройки типового варианта "Не добавлять".
//                                                Содержит поля:
//             Использование - Булево - флаг разрешения использования варианта. По умолчанию Истина.
//             Порядок       - Число  - порядок размещения варианта на форме помощника, сверху вниз. По умолчанию 1.
//             Заголовок     - Строка - позволяет переопределить название типового варианта.
//             Пояснение     - Строка - позволяет переопределить текст пояснения варианта для пользователя.
//
//         ВариантВсеДокументы - Структура      - настройки типового варианта "Добавить все документы за период".
//                                                Содержит поля:
//             Использование - Булево - флаг разрешения использования варианта. По умолчанию Истина.
//             Порядок       - Число  - порядок размещения варианта на форме помощника, сверху вниз. По умолчанию 2.
//             Заголовок     - Строка - позволяет переопределить название типового варианта.
//             Пояснение     - Строка - позволяет переопределить текст пояснения варианта для пользователя.
//
//         ВариантПроизвольныйОтбор - Структура - настройки типового варианта "Добавить данные с произвольным отбором".
//                                                Содержит поля:
//             Использование - Булево - флаг разрешения использования варианта. По умолчанию Истина.
//             Порядок       - Число  - порядок размещения варианта на форме помощника, сверху вниз. По умолчанию 3.
//             Заголовок     - Строка - позволяет переопределить название типового варианта.
//             Пояснение     - Строка - позволяет переопределить текст пояснения варианта для пользователя.
//
//         ВариантДополнительно - Структура     - настройки дополнительного варианта по сценарию узла.
//                                                Содержит поля:
//             Использование            - Булево            - флаг разрешения использования варианта. По умолчанию Ложь.
//             Порядок                  - Число             - порядок размещения варианта на форме помощника, сверху
//                                                            вниз. По умолчанию 4.
//             Заголовок                - Строка            - название варианта для отображения на форме.
//             ИмяФормыОтбора           - Строка            - Имя формы, вызываемой для редактирования настроек.
//             ЗаголовокКомандыФормы    - Строка            - Заголовок для отрисовки на форме команды открытия формы
//                                                            настроек.
//             ИспользоватьПериодОтбора - Булево            - флаг того, что необходим общий отбор по периоду. По
//                                                            умолчанию Ложь.
//             ПериодОтбора             - СтандартныйПериод - значение периода общего отбора, предлагаемого по
//                                                            умолчанию.
//
//             Отбор                    - ТаблицаЗначений   - содержит строки с описанием подробных отборов по сценарию
//                                                            узла.
//                                                            Содержит колонки:
//                 ПолноеИмяМетаданных - Строка                - полное имя метаданных регистрируемого объекта, отбор
//                                                               которого описывает строка.
//                                                               Например "Документ._ДемоПоступлениеТоваров". Можно
//                                                               использовать специальные  значения "ВсеДокументы" и
//                                                               "ВсеСправочники" для отбора соответственно всех
//                                                               документов и всех справочников, регистрирующихся на
//                                                               узле Получатель.
//                 ВыборПериода        - Булево                - флаг того, что данная строка описывает отбор с общим
//                                                               периодом.
//                 Период              - СтандартныйПериод     - значение периода общего отбора для метаданных строки,
//                                                               предлагаемого по умолчанию.
//                 Отбор               - ОтборКомпоновкиДанных - отбор по умолчанию. Поля отбора формируются в
//                                                               соответствии с общим правилами формирования полей
//                                                               компоновки. Например, для указания отбора по реквизиту
//                                                               документа "Организация", необходимо использовать поле
//                                                               "Ссылка.Организация".
Процедура НастроитьИнтерактивнуюВыгрузку(Знач Получатель, Знач Параметры) Экспорт
	Перем Знч, ВПУ, ВПН, ВВ;

	// По умолчанию отключаем все варианты.
	Параметры.ВариантБезДополнения.Использование     = Ложь;
	Параметры.ВариантВсеДокументы.Использование		 = Ложь;
	Параметры.ВариантПроизвольныйОтбор.Использование = Ложь;
	Параметры.ВариантДополнительно.Использование     = Ложь;
	// Настраиваем варианты, если возможна выгрузка.
	УстановитьПривилегированныйРежим(Истина);
	ВПУ = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПоУсловию;
	ВПН = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
	ВВ = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьВсегда;
	Знч = Новый Структура;
	Знч.Вставить("РежимВыгрузкиСостояний");
	Знч.Вставить("РежимВыгрузкиСведений");
	Знч.Вставить("РежимВыгрузкиСправочников");
	Знч.Вставить("РежимВыгрузкиБК");
	Знч.Вставить("РежимВыгрузкиСсылок");
	Знч.Вставить("РежимВыгрузкиЕПСБУ");
	Знч = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Получатель, Знч);
	Если (Знч.РежимВыгрузкиСостояний <> ВВ) Тогда
		Возврат;
	ИначеЕсли (Знч.РежимВыгрузкиСведений <> ВПУ) Тогда
		Возврат;
	ИначеЕсли ((Знч.РежимВыгрузкиСправочников <> ВПУ) И (Знч.РежимВыгрузкиСправочников <> ВПН)) Тогда
		Возврат;
	ИначеЕсли ((Знч.РежимВыгрузкиБК <> ВПУ) И (Знч.РежимВыгрузкиБК <> ВПН)) Тогда
		Возврат;
	ИначеЕсли (Знч.РежимВыгрузкиСсылок <> ВПН) Тогда
		Возврат;
	ИначеЕсли (Знч.РежимВыгрузкиЕПСБУ <> ВПУ) Тогда
		Возврат;
	КонецЕсли;
	Параметры.ВариантБезДополнения.Использование     = Истина;
	Параметры.ВариантВсеДокументы.Использование		 = Истина;
	Параметры.ВариантПроизвольныйОтбор.Использование = Истина;

КонецПроцедуры

// Процедура выполняет попытку перехода на новый обмен с существующего обмена.
// Вызывается, если в ходе синхронизации данных получено сообщение не соответствующее формату "старого" обмена.
//
// Параметры:
//  НастройкаСинхронизацииДанных - ссылка на узел плана обмена, с которого выполняется переход на новый обмен.
//  ОбменЧерезВнешнееСоединение - Булево - признак того что текущий обмен выполняется через внешнее соединение.
//
Процедура ВыполнитьПереходНаНовыйОбмен(Знач НастройкаСинхронизацииДанных, Знач ОбменЧерезВнешнееСоединение = Ложь) Экспорт
	Перем Стр;

	Стр = НСтр("ru = 'Выполнение перехода на новый обмен не требуется'");
	ВызватьИсключение Стр;

КонецПроцедуры

// Обработчик перехода на синхронизацию данных через внешнее соединение со старого на новый формат.
//
// Параметры :
//	Параметры - Структура - сведения о настройке синхронизации.
//
// Возвращаемое значение :
//	ПланОбменаСсылка.ФИБОбменБГУ, неопределено.
//
Функция ПереходНаСинхронизациюЧерезУниверсальныйФорматВнешнееСоединение(Знач Параметры) Экспорт
	
	Параметры.Ошибка = Истина;
	Параметры.СообщениеОбОшибке = НСтр("ru = 'Синхронизация данных через универсальный формат не используется. Выполнение перехода не требуется.'");
	Возврат Неопределено;
	
КонецФункции

// Обработчик перехода на синхронизацию данных через интернет со старого на новый формат.
//
// Параметры :
//	КодУзлаИнформационнойБазы - Строка - код узла обмена.
//	ОшибкаПерехода - Строка - возвращается текст ошибки перехода.
//
// Возвращаемое значение :
//	ПланОбменаСсылка.ФИБОбменБГУ, неопределено.
//
Функция ПереходНаСинхронизациюЧерезУниверсальныйФорматИнтернет(Знач КодУзлаИнформационнойБазы, ОшибкаПерехода) Экспорт
	
	ОшибкаПерехода = НСтр("ru = 'Синхронизация данных через универсальный формат не используется. Выполнение перехода не требуется.'");
	Возврат Неопределено;
	
КонецФункции

// Функция выполняет переход с существующей настройки синхронизации данных 
// на настройку синхронизации данных через универсальный формат.
//
// Параметры:
//  НастройкаСинхронизацииДанных - ссылка на настройку синхронизации данных, с которой выполняется переход.
// 
// Возвращаемое значение:
//	ПланОбменаСсылка.ФИБОбменБГУ, Неопределено.
//
Функция ВыполнитьПереходНаСинхронизациюДанныхЧерезУниверсальныйФормат(Знач НастройкаСинхронизацииДанных) Экспорт
	Перем Стр;

	Стр = НСтр("ru = 'Синхронизация данных через универсальный формат не используется. Выполнение перехода не требуется.'");
	ВызватьИсключение Стр;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли