#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Возврат Новый Структура(
		"ИспользоватьПередКомпоновкойМакета,
		|ИспользоватьПослеВыводаРезультата,
		|ВыводитьОтладочнуюИнформацию,
		|ИспользоватьДанныеРасшифровки,
		|ИспользоватьПривилегированныйРежим",
		Истина, Истина, Истина, Истина, Истина);
							
КонецФункции

// Задает набор показателей, которые позволяет анализировать отчет.
//
// Возвращаемое значение:
//   Массив      - основные суммовые показатели отчета.
//
Функция ПолучитьНаборПоказателей() Экспорт
	
	НаборПоказателей = Новый Массив;
	НаборПоказателей.Добавить("БУ");
	
	Возврат НаборПоказателей;
	
КонецФункции

Функция ПолучитьТекстЗаголовка(ПараметрыОтчета) Экспорт 
	
	ТекстСубконто = "";
	
	ЗаголовокОтчета = "Шахматная ведомость за "+
		СтандартныеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
			ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода,, ПараметрыОтчета.ТипПериода, ПараметрыОтчета.ТолькоУказанныйПериод);
	
	Возврат ЗаголовокОтчета;
	
КонецФункции

Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.НачалоПериода) Тогда
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода",
			Бухгалтерскийучет.НачалоПериодаСУточнением(
				ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.ТипПериода, ПараметрыОтчета.ТолькоУказанныйПериод));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтчета.КонецПериода) Тогда
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода",
			Бухгалтерскийучет.КонецПериодаСУточнением(
				ПараметрыОтчета.КонецПериода, ПараметрыОтчета.ТипПериода, ПараметрыОтчета.ТолькоУказанныйПериод));
    КонецЕсли;
    
	Если ЗначениеЗаполнено(ПараметрыОтчета.ИФО) Тогда
		СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "ИФО", ПараметрыОтчета.ИФО,,, Истина);
	КонецЕсли;
	
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВыводитьЗабалансовыеСчета", ПараметрыОтчета.ВыводитьЗабалансовыеСчета);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВыводитьБухгалтерскиеСчета", ПараметрыОтчета.ВыводитьБухгалтерскиеСчета);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВыводитьУправленческиеСчета", ПараметрыОтчета.ВыводитьУправленческиеСчета);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВыводитьНалоговыеСчета", ПараметрыОтчета.ВыводитьНалоговыеСчета);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВыводитьВспомогательныеСчета", ПараметрыОтчета.ВыводитьВспомогательныеСчета);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПоСубсчетам", ПараметрыОтчета.ПоСубсчетам);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВыводитьПолныйСчет", ПараметрыОтчета.ВыводитьПолныйСчет);
	
	Таблица = КомпоновщикНастроек.Настройки.Структура[0];
	//Валютный учет может быть отключен, тогда группировки не будет
	Если Таблица.Колонки[0].Структура.Количество() > 0 Тогда
		Таблица.Колонки[0].Структура[0].Использование = ПараметрыОтчета.ПоказательВалютнаяСумма;
	КонецЕсли;
	Если Таблица.Строки[0].Структура.Количество() > 0 Тогда
		Таблица.Строки[0].Структура[0].Использование = ПараметрыОтчета.ПоказательВалютнаяСумма;
	КонецЕсли;	
	
	СтандартныеОтчеты.ДобавитьОтборПоОрганизацииФ(ПараметрыОтчета, КомпоновщикНастроек);
	
КонецПроцедуры

Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	СтандартныеОтчеты.ОбработкаРезультатаОтчетаФ(ПараметрыОтчета.ИдентификаторОтчета, Результат);

	Если Результат.Области.Найти("Заголовок") = Неопределено Тогда
		Результат.ФиксацияСверху = 2;
	Иначе
		Результат.ФиксацияСверху = Результат.Области.Заголовок.Низ + 2;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьОтчетФ(ПараметрыОтчета, АдресХранилища) Экспорт
	
	СтандартныеОтчеты.ВывестиОтчетФ(ПараметрыОтчета, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоРегистрУчета() Экспорт
	
	Возврат Истина;
	
КонецФункции	

Процедура СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета) Экспорт
	
	СтандартныеОтчеты.СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета);
	
КонецПроцедуры	

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ШахматнаяВедомость");
	НастройкиВарианта.Включен = Истина;
	НастройкиВарианта.Описание = НСтр("ru = 'Табличное представление оборотов между счетами за выбранный период'");
КонецПроцедуры

#КонецОбласти

#КонецЕсли