#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура НапечататьЧекиВыполнитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	СтрокаТаблицы = Объект.Документы.НайтиПоИдентификатору(Параметры);
	Если РезультатВыполнения.Результат Тогда
		СтрокаТаблицы.Статус 		= НСтр("ru = 'Напечатан'"); 
		СтрокаТаблицы.ТекстОшибки 	= "";
	Иначе	
		ТекстСообщения 				= НСтр("ru = 'При печати чека произошла ошибка. Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения 				= СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		СтрокаТаблицы.Статус 		= НСтр("ru = 'Ошибка'"); 
		СтрокаТаблицы.ТекстОшибки 	= ТекстСообщения;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресВХранилище") Тогда 
		ЗаполнитьСписокДокументовДаннымиИзХранилища(Параметры.АдресВХранилище)
	КонецЕсли;	
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТЧДокументы

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДокументыСтатус" Тогда 
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Документы.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда 
			Если ТекущиеДанные.Статус = "Ошибка" Или ТекущиеДанные.Статус = "Предупреждение" Тогда 
				ПараметрыОткрытияФормы = Новый Структура;
				ПараметрыОткрытияФормы.Вставить("ТекстОшибки", ТекущиеДанные.ТекстОшибки);
				ОткрытьФорму("Обработка.ПечатьЧековДляГруппыДокументов.Форма.ФормаСообщения", ПараметрыОткрытияФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			ИначеЕсли ТекущиеДанные.Статус = "Напечатан" Тогда 
				ВывестиПредставлениеЧека(ТекущиеДанные);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	ИзменитьПометки(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	ИзменитьПометки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьПометки(Команда)
	
	ИзменитьПометки(Неопределено);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокДокументовДаннымиИзХранилища(АдресВХранилище)
	
	МассивДокументов = ПолучитьИзВременногоХранилища(АдресВХранилище);
	СписокДокументов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивДокументов, "Ссылка, Контрагент, СуммаДокумента, НомерЧекаККМ, КассаККМ");
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ФискальныеОперации.ДокументОснование КАК ДокументОснование
	               |ИЗ
	               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	               |ГДЕ
	               |	ФискальныеОперации.ДокументОснование В(&МассивДокументов)";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Документ Из СписокДокументов Цикл 
		НомерЧекаККМ = РезультатЗапроса.Найти(Документ.Ключ, "ДокументОснование");
		Если Документ.Значение.НомерЧекаККМ = 0 И НомерЧекаККМ = Неопределено Тогда 
			НоваяСтрока 			= Объект.Документы.Добавить();
			НоваяСтрока.Документ 	= Документ.Ключ;
			НоваяСтрока.Контрагент 	= Документ.Значение.Контрагент;
			НоваяСтрока.Сумма 		= Документ.Значение.СуммаДокумента;
			НоваяСтрока.Статус 		= НСтр("ru = 'Не напечатан'");
			НоваяСтрока.Печатать 	= Истина;
			НоваяСтрока.КассаККМ 	= Документ.Значение.КассаККМ;
		КонецЕсли;
	КонецЦикла;	
	Объект.Документы.Сортировать("Документ");
	
КонецПроцедуры	

&НаКлиенте
Процедура НапечататьЧеки(Команда)
	
	ПерезаполнитьРеквизиты();
	Для Каждого СтрокаДокумент Из Объект.Документы Цикл 
		Если СтрокаДокумент.Печатать И СтрокаДокумент.Статус <> "Предупреждение" Тогда  
			ТекстОшибок = ПроверитьВозможностьПечатиЧека(СтрокаДокумент.Документ);
			Если ТекстОшибок <> "" Тогда 
				СтрокаДокумент.Статус 		= НСтр("ru = 'Ошибка'");
				СтрокаДокумент.ТекстОшибки 	= ТекстОшибок;
				СтрокаДокумент.Печатать 	= Ложь;
			КонецЕсли;	
			
			Если СтрокаДокумент.Печатать Тогда 
				ТекстОшибок = ПроверитьКассовыйЧекНаУстаревшиеСтавкиНДС(СтрокаДокумент.Документ);
				Если ТекстОшибок <> "" Тогда 
					СтрокаДокумент.Статус 		= НСтр("ru = 'Предупреждение'");
					СтрокаДокумент.ТекстОшибки 	= ТекстОшибок;
					СтрокаДокумент.Печатать 	= Ложь;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	НапечататьЧекиВыполнить();
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЧекиВыполнить()
	
	Для Каждого СтрокаДокумент Из Объект.Документы Цикл 
		Если СтрокаДокумент.Печатать Тогда 
			ПодключаемоеОборудованиеБГУКлиент.ЗаполнитьНомерДокументаКассыККМ(СтрокаДокумент.КассаККМ); 
			НомерДокументаКассыККМ = ПараметрыПриложения["ПодключаемоеОборудование.НомерДокументаКассыККМ"];
			ПараметрыКассыККМ         						= ПодключаемоеОборудованиеБГУВызовСервера.ПолучитьПараметрыКассыККМ(СтрокаДокумент.КассаККМ);
			ИдентификаторУстройстваФР 						= ПараметрыКассыККМ.ИдентификаторУстройства;
			ИспользоватьКассуККМБезПодключенияОборудования 	= ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
			НомерЧека 										= НомерДокументаКассыККМ[СтрокаДокумент.КассаККМ];
			
			Если ИспользоватьКассуККМБезПодключенияОборудования Тогда
				ИспользоватьБезПримененияККТ = ПараметрыКассыККМ.ИспользоватьБезПримененияККТ;
				Если ИспользоватьБезПримененияККТ Тогда
					ЗаписатьФискальныеДанныеДляРасчетногоДокумента(СтрокаДокумент.Документ, НомерЧека);
					НомерДокументаКассыККМ[СтрокаДокумент.КассаККМ] = НомерЧека +	1;
					СтрокаДокумент.Статус 		= "Напечатан";
					СтрокаДокумент.ТекстОшибки 	= "";
					СтрокаДокумент.Печатать 	= Ложь;
				Иначе
					ТекстСообщения = НСтр("ru = 'Для включения возможности печати расчетных документов следует включить 
					|флажок ""Использовать для печати расчетных документов без применения ККТ"" 
					|у кассы, которая указана в реквизите ""Касса ККМ"".'");
					СтрокаДокумент.Статус 		= "Ошибка";
					СтрокаДокумент.ТекстОшибки 	= ТекстСообщения;
					СтрокаДокумент.Печатать 	= Ложь;
				КонецЕсли;	
			КонецЕсли;
			
			Если СтрокаДокумент.Печатать И ИдентификаторУстройстваФР <> Неопределено Тогда 
				ОбщиеПараметры 			= ПодготовитьДанныеДляПробитияЧека(СтрокаДокумент.Документ, НомерЧека);
				Оповещение 				= Новый ОписаниеОповещения("НапечататьЧекиВыполнитьЗавершение", ЭтотОбъект, СтрокаДокумент.ПолучитьИдентификатор());
				СтрокаДокумент.Печатать	= Ложь;
				ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, 
																										УникальныйИдентификатор, 
																										ИдентификаторУстройстваФР,
																										ОбщиеПараметры);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеДляПробитияЧека(ДокументСсылка ,НомерЧека)
	
	ДокументОбъект 	= ДокументСсылка.ПолучитьОбъект();
	ОбщиеПараметры  = ПодключаемоеОборудованиеБГУ.ПодготовитьДанныеДляПробитияЧека(ДокументОбъект, ДокументСсылка, НомерЧека);
	
	Возврат ОбщиеПараметры;
	
КонецФункции

&НаСервере
Функция ПроверитьВозможностьПечатиЧека(ДокументСсылка)
	
	ТекстСообщения = "";
	
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	
	Если Не ДокументОбъект.Проведен Тогда 
		ТекстСообщения = ДобавитьТекстВСообщение("Операция возможна только после проведения документа!", ТекстСообщения);	
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.КассаККМ) Тогда
		ТекстСообщения = ДобавитьТекстВСообщение("Не заполнен реквизит ""Касса ККМ""!", ТекстСообщения);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Ответственный) Тогда
		ТекстСообщения = ДобавитьТекстВСообщение("Не заполнен реквизит ""Ответственный""!", ТекстСообщения);
	Иначе
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.Ответственный.ФизическоеЛицо) Тогда
			ТекстСообщения = ДобавитьТекстВСообщение("Не заполнен реквизит ""Физическое лицо"" у реквизита ""Ответственный""!", ТекстСообщения);
		Иначе
			КассирККМ = ДокументОбъект.Ответственный.ФизическоеЛицо;
			Если НЕ ДокументОбъект.КассаККМ.НеПроверятьИННКассира Тогда
				Если СтрДлина(КассирККМ.ИНН)<12 Тогда
					ТекстСообщения = ДобавитьТекстВСообщение("Не заполнен ИНН у реквизита ""Физическое лицо"" у реквизита ""Ответственный""!", ТекстСообщения);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДокументОбъект.СистемаНалогообложенияЧекаККМ) Тогда
		ТекстСообщения = ДобавитьТекстВСообщение("Не заполнен реквизит ""Система налогообложения""!", ТекстСообщения);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.ТипРасчета) Тогда
		ТекстСообщения = ДобавитьТекстВСообщение("Не заполнен реквизит ""Тип расчета""!", ТекстСообщения);
	КонецЕсли;
	
	Если ДокументОбъект.ДокументыЧекаККМ.Количество() = 0 Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.СтавкаНДС) Тогда
			ТекстСообщения = ДобавитьТекстВСообщение("Не указана ставка НДС на закладке ""Чек ККМ""!", ТекстСообщения);
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
		ТекстСообщения = ДобавитьТекстВСообщение("Не заполнен реквизит ""Контрагент""!", ТекстСообщения);
		Возврат ТекстСообщения;
	КонецЕсли;
	
	СтавкаДокумента = ПодключаемоеОборудованиеБГУ.ЕдиныеСтавкиВДокументеОснованииЧекаККМ(ДокументСсылка);
	СуммаВсего = СтавкаДокумента.Всего;
	Если СуммаВсего > ДокументОбъект.СуммаДокумента Тогда
		Если НЕ ДокументОбъект.ЭтоПостоплата Тогда
			ТекстСообщения = ДобавитьТекстВСообщение("Сумма документа меньше итоговой суммы списка номенклатуры документов-оснований чека ККМ! 
			|Если часть суммы будет оплачена позднее или нужно зачесть предоплату, то следует включить флажок ""Постоплата и (или) зачет предоплаты"" на закладке ""Чек ККМ"".
			|При необходимости сумма предоплаты вводится в колонке ""Сумма предоплаты"" списка номенклатуры чека на закладке ""Чек ККМ"".", ТекстСообщения);
		Иначе	
			Если НесоответствиеСуммыЧека(СуммаВсего, ДокументОбъект) Тогда
				ТекстСообщения = ДобавитьТекстВСообщение("Сумма оплаты с учетом зачета аванса превышает сумму списка номенклатуры!
				|Следует уточнить сумму предоплаты в списке номенклатуры чека на закладке ""Чек ККМ"" или сформировать отдельный чек на аванс на сумму разницы.", ТекстСообщения);
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли СуммаВсего < ДокументОбъект.СуммаДокумента Тогда
		ТекстСообщения = ДобавитьТекстВСообщение("Сумма документа больше итоговой суммы списка номенклатуры документов-оснований чека ККМ! 
		|Если часть суммы является авансом необходимо сумму документа указать равной сумме номенклатуры и ввести новый документ ""Приходный кассовый ордер"" на сумму аванса.", ТекстСообщения);
	КонецЕсли;

	ТаблицаСпособовРасчета = ДокументОбъект.ДокументыЧекаККМ.Выгрузить();
	ТаблицаСпособовРасчета.Свернуть("ПризнакСпособаРасчета");
	Если ТаблицаСпособовРасчета.Количество() > 1 Тогда
		ТекстСообщения = ДобавитьТекстВСообщение("В списке номенклатуры чека ККМ должны быть документы-основания только с одним признаком способа расчета!", ТекстСообщения);
	КонецЕсли;
	
	ТаблицаНоменклатуры = ПодключаемоеОборудованиеБГУ.ТаблицаНоменклатурыЧекаККМ(ДокументОбъект.Ссылка);
	ЕстьПустыеНаименованияТоваровУслуг = Ложь;
	ЕстьПустыеПредметыРасчетаТоваровУслуг = Ложь;
	НомераСтрокПустыхНаименований = "";
	НомераСтрокПустыхПредметовРасчета = "";
	Для Каждого ТекСтрока Из ТаблицаНоменклатуры Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.Наименование) Тогда
			ЕстьПустыеНаименованияТоваровУслуг = Истина;
			НомераСтрокПустыхНаименований = НомераСтрокПустыхНаименований + СокрЛП(ТекСтрока.НомерСтроки)+", ";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекСтрока.ПризнакПредметаРасчета) Тогда
			ЕстьПустыеПредметыРасчетаТоваровУслуг = Истина;
			НомераСтрокПустыхПредметовРасчета = НомераСтрокПустыхПредметовРасчета + СокрЛП(ТекСтрока.НомерСтроки)+", ";
		КонецЕсли;
	КонецЦикла;	
	Если ЕстьПустыеНаименованияТоваровУслуг Тогда
		НомераСтрокПустыхНаименований = Сред(НомераСтрокПустыхНаименований, 0, СтрДлина(НомераСтрокПустыхНаименований)-2);
		Если НомераСтрокПустыхНаименований = "1" Тогда
			ТекстСообщения = ДобавитьТекстВСообщение("В строке %1 полного списка номенклатуры кассового чека пустое наименование номенклатуры! 
			|Следует в документе-основании заполнить номенклатуру и повторить попытку.", ТекстСообщения);
		Иначе
			ТекстСообщения = ДобавитьТекстВСообщение("В строках %1 полного списка номенклатуры кассового чека пустые наименования номенклатуры!
			|Следует в документах-основаниях для этих строк заполнить номенклатуру и повторить попытку.", ТекстСообщения);
		КонецЕсли;	
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НомераСтрокПустыхНаименований);
	КонецЕсли;
	Если ЕстьПустыеПредметыРасчетаТоваровУслуг Тогда
		НомераСтрокПустыхПредметовРасчета = Сред(НомераСтрокПустыхПредметовРасчета, 0, СтрДлина(НомераСтрокПустыхПредметовРасчета)-2);
		Если НомераСтрокПустыхПредметовРасчета = "1" Тогда
			ТекстСообщения = ДобавитьТекстВСообщение("В строке %1 полного списка номенклатуры кассового чека не заполнен признак предмета расчета! 
			|Следует в документе-основании заполнить у номенклатуры реквизит ""Признак предмета расчета"" и повторить попытку.", ТекстСообщения);
		Иначе
			ТекстСообщения = ДобавитьТекстВСообщение("В строках %1 полного списка номенклатуры кассового чека не заполнен признак предмета расчета!
			|Следует в документах-основаниях для этих строк заполнить у номенклатуры реквизит ""Признак предмета расчета"" и повторить попытку.", ТекстСообщения);
		КонецЕсли;	
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НомераСтрокПустыхПредметовРасчета);
	КонецЕсли;
	
	ПолучательЧекаККМ = ДокументОбъект.Контрагент;
	Если ЗначениеЗаполнено(ПолучательЧекаККМ) Тогда
		ДанныеЮЛиИП = ПодключаемоеОборудованиеБГУ.ЧекККМДляЮЛилиИП(ПолучательЧекаККМ, ДокументОбъект.Дата);
		Если ДанныеЮЛиИП.Заполнить Тогда
			Если НЕ ЗначениеЗаполнено(ДанныеЮЛиИП.Получатель) Тогда
				ТекстСообщения = ДобавитьТекстВСообщение("Контрагент-получатель чека ККМ - юр.лицо или ИП. У контрагента не указано наименование!", ТекстСообщения);
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(ДанныеЮЛиИП.ПолучательИНН) Тогда
				ТекстСообщения = ДобавитьТекстВСообщение("Контрагент-получатель чека ККМ - юр.лицо или ИП. У контрагента не указан ИНН!", ТекстСообщения);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
		
	Возврат ТекстСообщения;
	
КонецФункции

&НаСервере
Функция ДобавитьТекстВСообщение(Текст, ТекстСообщения)
	
	ТекстСообщения = ТекстСообщения + НСтр("ru = '" + Текст + "'") + Символы.ПС + Символы.ПС;
	Возврат ТекстСообщения;
	
КонецФункции	

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДокументыСтатус");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Документы.Статус", ВидСравненияКомпоновкиДанных.Равно, "Не напечатан");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Синий);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДокументыСтатус");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Документы.Статус", ВидСравненияКомпоновкиДанных.Равно, "Ошибка");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДокументыСтатус");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Документы.Статус", ВидСравненияКомпоновкиДанных.Равно, "Напечатан");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Зеленый);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДокументыСтатус");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Документы.Статус", ВидСравненияКомпоновкиДанных.Равно, "Предупреждение");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Оранжевый);
			
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДокументыПечатать");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
	"Объект.Документы.Статус", ВидСравненияКомпоновкиДанных.Равно, "Напечатан");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	
КонецПроцедуры	

&НаСервере
Функция НесоответствиеСуммыЧека(СуммаСпискаНоменклатуры, ДокументОбъект)
	СуммаЗачетаАванса = ДокументОбъект.ДокументыЧекаККМ.Итог("СуммаПредоплаты");
	СуммаПостоплаты = СуммаСпискаНоменклатуры - СуммаЗачетаАванса - ДокументОбъект.СуммаДокумента;
	Если СуммаПостоплаты < 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ВывестиПредставлениеЧека(ТекущиеДанные)
		
	КассаККМЧека 			= ТекущиеДанные.КассаККМ;
	ДанныеЧекаДляДокумента 	= ДанныеЧекаДляДокумента(ТекущиеДанные.Документ);
	НомерКассовогоЧека 		= ДанныеЧекаДляДокумента.НомерЧекаККМ;		
	
	Если (НомерКассовогоЧека = 0) Тогда 
		НомерДокументаКассыККМ = ПараметрыПриложения["ПодключаемоеОборудование.НомерДокументаКассыККМ"];
		НомерДокКассыККМ = ?(НомерДокументаКассыККМ[КассаККМЧека]=Неопределено, 0, НомерДокументаКассыККМ[КассаККМЧека]);
		НомерЧека = НомерДокКассыККМ + 1;
	Иначе
		НомерЧека = НомерКассовогоЧека;	
	КонецЕсли;	
	
	ОбщиеПараметры 				= ПодготовитьДанныеДляПросмотраЧека(ТекущиеДанные.Документ, НомерЧека);
	ОбщиеПараметры.ДатаВремя 	= ДанныеЧекаДляДокумента.ДатаЧекаККМ;
	
	ВерсияФФД = ВерсияФФД(КассаККМЧека);
	
	ТекстЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.СформироватьТекстНефискальногоЧека(ОбщиеПараметры, 34, ВерсияФФД);
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстЧека);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекстовыйДокумент", ТекстовыйДокумент);
	ПараметрыФормы.Вставить("ДокументОснование", ТекущиеДанные.Документ);
	ПараметрыФормы.Вставить("ИдентификаторЗаписи", ДанныеЧекаДляДокумента.ИдентификаторЗаписи);
	
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("ОбщаяФорма.ФормаПросмотраЧекаККМ", ПараметрыФормы, , Объект,,,, Режим);
		
КонецПроцедуры

&НаСервере
Функция ВерсияФФД(КассаККМЧека) 
	Возврат ПодключаемоеОборудованиеБГУ.ВерсияФФД(КассаККМЧека);	
КонецФункции

&НаСервере
Функция ДанныеЧекаДляДокумента(ДокументСсылка)
	
	Результат = Новый Структура;
	Результат.Вставить("НомерЧекаККМ", 0);
	Результат.Вставить("ДатаЧекаККМ", Дата(1,1,1));
	Результат.Вставить("ФискальныйПризнак", "");
	Результат.Вставить("ИдентификаторЗаписи", "");
	
	Если ДокументСсылка.НомерЧекаККМ <>0 Тогда
		Результат.НомерЧекаККМ = ДокументСсылка.НомерЧекаККМ;
		Результат.ДатаЧекаККМ = ДокументСсылка.ДатаЧекаККМ;
		
		Возврат Результат;
	КонецЕсли;	
	
	Возврат ПодключаемоеОборудованиеБГУ.ДанныеЧека(ДокументСсылка);
	
КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеДляПросмотраЧека(ДокументСсылка, НомерЧека)
	
	Результат = Неопределено;
			
	ДанныеЧека = ДанныеЧекаДляДокумента(ДокументСсылка);
	Если ЗначениеЗаполнено(ДанныеЧека.ИдентификаторЗаписи) И ЗначениеЗаполнено(ДанныеЧека.ТекстовыеДанныеXML) Тогда
		Результат = ПодключаемоеОборудованиеБГУВызовСервера.ЗагрузитьДанныеФискализацииИзXML(ДанныеЧека.ТекстовыеДанныеXML);
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПодготовитьДанныеДляПробитияЧека(ДокументСсылка, НомерЧека);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ПроверитьКассовыйЧекНаУстаревшиеСтавкиНДС(ДокументСсылка)
	
	ТекстСообщения = "";
	ЕстьУстаревшиеСтавкиНДС = Ложь;
	ПроверитьКассовыйЧекНаУстаревшиеСтавкиНДСНаСервере(ДокументСсылка, ЕстьУстаревшиеСтавкиНДС);
	Если ЕстьУстаревшиеСтавкиНДС Тогда
		ТекстСообщения = НСтр("ru='При формировании кассового чека используется устаревшая ставка НДС.'");
	КонецЕсли;
	Возврат ТекстСообщения;
	
КонецФункции	

&НаСервере
Процедура ПроверитьКассовыйЧекНаУстаревшиеСтавкиНДСНаСервере(ДокументПечатиЧека, ЕстьУстаревшиеСтавкиНДС)
	
	УстаревшиеСтавкиНДС = ПодключаемоеОборудованиеБГУ.УстаревшиеСтавкиНДС();
	ТаблицаНоменклатуры = ПодключаемоеОборудованиеБГУ.ТаблицаНоменклатурыЧекаККМ(ДокументПечатиЧека);
	ТаблицаНоменклатуры.Свернуть("СтавкаНДС");
	Для Каждого ТекСтрока Из ТаблицаНоменклатуры Цикл
		Если НЕ УстаревшиеСтавкиНДС.Найти(ТекСтрока.СтавкаНДС) = Неопределено Тогда
			ЕстьУстаревшиеСтавкиНДС = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьРеквизиты()
	
	Для Каждого СтрокаТаблицы Из Объект.Документы Цикл 
		РеквизитыДокумента 			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.Документ, "Контрагент, КассаККМ, СуммаДокумента");
		СтрокаТаблицы.Контрагент 	= РеквизитыДокумента.Контрагент;
		СтрокаТаблицы.КассаККМ 		= РеквизитыДокумента.КассаККМ;
		СтрокаТаблицы.Сумма 		= РеквизитыДокумента.СуммаДокумента;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура ИзменитьПометки(Пометка = Неопределено, ТолькоБезШК = Ложь)

	Для каждого ТекСтр Из Объект.Документы Цикл
		НовоеЗначениеПометки = ?(Пометка = Неопределено, Не ТекСтр.Печатать, Пометка);
		Если НовоеЗначениеПометки = Истина Тогда
			Если ТекСтр.Статус = "Напечатан" Тогда
				НовоеЗначениеПометки = Ложь;
			КонецЕсли;
		КонецЕсли;
		ТекСтр.Печатать = НовоеЗначениеПометки;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьФискальныеДанныеДляРасчетногоДокумента(ДокументСсылка, НомерЧека)
	
	ПараметрыФискализации = Новый Структура;
	ПараметрыФискализации.Вставить("ДатаВремяЧека", ТекущаяДата());
	ПараметрыФискализации.Вставить("ДокументОснование", ДокументСсылка);
	ПараметрыФискализации.Вставить("Организация", ДокументСсылка.Организация);
	ПараметрыФискализации.Вставить("ТипРасчета", ДокументСсылка.ТипРасчета);
	ПараметрыФискализации.Вставить("НомерСменыККТ", 1);
	ПараметрыФискализации.Вставить("НомерЧекаККТ", НомерЧека);
	ПараметрыФискализации.Вставить("ФискальныйПризнак", Строка(НомерЧека));
	ПараметрыФискализации.Вставить("ТипДокумента", Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек);
	ПараметрыФискализации.Вставить("АдресСайтаПроверки", "");
	ПараметрыФискализации.Вставить("ЗаводскойНомерФН", "");
	ПараметрыФискализации.Вставить("РегистрационныйНомерККТ", "");
	ПараметрыФискализации.Вставить("ДополнительныйРеквизит", "");
	ПараметрыФискализации.Вставить("ДанныеЧекаXML", Неопределено);
	
	ОбщиеПараметры = ПодготовитьДанныеДляПробитияЧека(ДокументСсылка, НомерЧека);
	
	СуммаЧека = 0;
	ОплатаНаличные = 0;
	ОплатаЭлектронно = 0;
	ОплатаПостоплата = 0;
	ОплатаПредоплата = 0;
	
	Для каждого ТекСтрока Из ОбщиеПараметры.ТаблицаОплат Цикл
		СуммаЧека = СуммаЧека + ТекСтрока.Сумма;
		Если ТекСтрока.ТипОплаты = Перечисления.ТипыОплатыККТ.Наличные Тогда
			ОплатаНаличные = ОплатаНаличные + ТекСтрока.Сумма;
		ИначеЕсли ТекСтрока.ТипОплаты = Перечисления.ТипыОплатыККТ.Электронно Тогда
			ОплатаЭлектронно = ОплатаЭлектронно + ТекСтрока.Сумма;
		ИначеЕсли ТекСтрока.ТипОплаты = Перечисления.ТипыОплатыККТ.Предоплата Тогда
			ОплатаПредоплата = ОплатаПредоплата + ТекСтрока.Сумма;
		ИначеЕсли ТекСтрока.ТипОплаты = Перечисления.ТипыОплатыККТ.Постоплата Тогда
			ОплатаПостоплата = ОплатаПостоплата + ТекСтрока.Сумма;
		КонецЕсли;	
	КонецЦикла;	
	ПараметрыФискализации.Вставить("СуммаЧека", СуммаЧека);
	ПараметрыФискализации.Вставить("ОплатаНаличные", ОплатаНаличные);
	ПараметрыФискализации.Вставить("ОплатаЭлектронно", ОплатаЭлектронно);
	ПараметрыФискализации.Вставить("ОплатаПредоплата", ОплатаПредоплата);
	ПараметрыФискализации.Вставить("ОплатаПостоплата", ОплатаПостоплата);
	
	ПодключаемоеОборудованиеБГУВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);

КонецПроцедуры

#КонецОбласти
