#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма1Т") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_Форма1Т",
			"Товарно-транспортная накладная (форма №1-Т)",
			ПечатьТТН(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Приложение4") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_Приложение4",
			"Транспортная накладная (приложение №4)",
			ПечатьТН(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Приложение8") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_Приложение8",
			"СопроводительнаяВедомость (приложение №8)",
			ПечатьСВ(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
КонецПроцедуры // Печать()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьТТН(МассивОбъектов, ОбъектыПечати, ТранспортныйРаздел)
	Если ТипЗнч(МассивОбъектов) = Тип("Массив") И МассивОбъектов.Количество() > 0 Тогда
		ДокСсылка = МассивОбъектов[0];
	Иначе
		Возврат (Новый ТабличныйДокумент);
	КонецЕсли;
	
	ТабДок 						= Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати 	= "ПАРАМЕТРЫ_ПЕЧАТИ_ТоварноТранспортнаяНакладнаяФорма1Т";
	Макет 						= УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТТН.ПФ_MXL_Форма1Т");
	
	ДанныеДляПечати = ПодготовитьДанныеДляПечати(ДокСсылка, ТранспортныйРаздел);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заполнить(ДанныеДляПечати.Шапка);
	ТабДок.Вывести(Область);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтогПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	ОбластьВсего = Макет.ПолучитьОбласть("Всего");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(ДанныеДляПечати.Подвал);
	
	К = 1;
	КоличествоНаСтранице = 0;
	СуммаСНДСНаСтранице = 0;
	
	МассивДляПроверки = Новый Массив(3);
	МассивДляПроверки[1] = ОбластьВсего;
	МассивДляПроверки[2] = ОбластьПодвал;
	
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = К;
	ТабДок.Вывести(ОбластьЗаголовокТаблицы);
	
	НоваяСтраница = Ложь;
	ИтогВыведен = Ложь;
	
	Для Каждого Запись Из ДанныеДляПечати.Строки Цикл
		ОбластьСтрока.Параметры.Заполнить(Запись);
		
		МассивДляПроверки[0] = ОбластьСтрока;
		ИтогВыведен = Ложь;
		
		Если ТабДок.ПроверитьВывод(МассивДляПроверки) Тогда
			ТабДок.Вывести(ОбластьСтрока);
			КоличествоНаСтранице = КоличествоНаСтранице + Запись.Количество;
			СуммаСНДСНаСтранице = СуммаСНДСНаСтранице + Запись.СуммаСНДС;
			НоваяСтраница = Ложь;
		Иначе
			ОбластьИтогПоСтранице.Параметры.ИтогоКоличествоНаСтранице = КоличествоНаСтранице;
			ОбластьИтогПоСтранице.Параметры.ИтогоСуммаСНДСНаСтранице = СуммаСНДСНаСтранице;
			ТабДок.Вывести(ОбластьИтогПоСтранице);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
			К = К + 1;
			
			ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = К;
			ТабДок.Вывести(ОбластьЗаголовокТаблицы);
			ТабДок.Вывести(ОбластьСтрока);
			
			КоличествоНаСтранице = 0;
			СуммаСНДСНаСтранице = 0;
			ИтогВыведен = Истина;
			НоваяСтраница = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НоваяСтраница Или Не ИтогВыведен Тогда
		Если КоличествоНаСтранице < ДанныеДляПечати.Строки.Итог("Количество") Тогда
			КоличествоНаСтранице = КоличествоНаСтранице + Запись.Количество;
			СуммаСНДСНаСтранице = СуммаСНДСНаСтранице + Запись.СуммаСНДС;
		КонецЕсли;
		ОбластьИтогПоСтранице.Параметры.ИтогоКоличествоНаСтранице = КоличествоНаСтранице;
		ОбластьИтогПоСтранице.Параметры.ИтогоСуммаСНДСНаСтранице = СуммаСНДСНаСтранице;
		ТабДок.Вывести(ОбластьИтогПоСтранице);
	КонецЕсли;
	
	ОбластьВсего.Параметры.ИтогоКоличество = ДанныеДляПечати.Строки.Итог("Количество");
	ОбластьВсего.Параметры.ИтогоСуммаСНДС = ДанныеДляПечати.Строки.Итог("СуммаСНДС");
	ТабДок.Вывести(ОбластьВсего);
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

	Область = Макет.ПолучитьОбласть("ТранспортныйРаздел");
	Область.Параметры.Заполнить(ДанныеДляПечати.ТранспортныйРаздел);
	Если ДанныеДляПечати.ТранспортныйРаздел.Лицензионная_Карточка Тогда
		Область.Области["ЛК_Ограниченная"].Шрифт = Новый Шрифт(Макет.Области["ЛК_Ограниченная"].Шрифт,,,,,,Истина);
	Иначе
		Область.Области["ЛК_Стандартная"].Шрифт = Новый Шрифт(Макет.Области["ЛК_Ограниченная"].Шрифт,,,,,,Истина);
	КонецЕсли;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("СведенияОГрузе");
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ПодвалСведенийОГрузе");
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ПогрузочныеОперации");
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ПрочиеСведения");
	ТабДок.Вывести(Область);
	
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьТН(МассивОбъектов, ОбъектыПечати, СтруктураДляПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Если ЗначениеЗаполнено(МассивОбъектов) Тогда
		Если ТипЗнч(СтруктураДляПечати) = Тип("Структура") И СтруктураДляПечати.Свойство("ТабДок") Тогда
			ТабДок = ПолучитьИзВременногоХранилища(СтруктураДляПечати.ТабДок);
		КонецЕсли;
	КонецЕсли;

	Возврат ТабДок;
КонецФункции

Функция ПечатьСВ(МассивОбъектов, ОбъектыПечати, СтруктураДляПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Если ЗначениеЗаполнено(МассивОбъектов) Тогда
		Если ТипЗнч(СтруктураДляПечати) = Тип("Структура") И СтруктураДляПечати.Свойство("ТабДок") Тогда
			ТабДок = ПолучитьИзВременногоХранилища(СтруктураДляПечати.ТабДок);
		КонецЕсли;
	КонецЕсли;

	Возврат ТабДок;

КонецФункции

// Переопределение ЭлектронныеДокументыБГУ.ПолучитьДанныеЮрФизЛица
Функция ПолучитьДанныеЮрФизЛицаТТН(ЮрФизЛицо) Экспорт
	
	Сведения = Новый Структура;
	
	Если Не ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		Возврат Сведения;
	КонецЕсли;
	
	Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Организации") Тогда
		
		ЮрАдресУчреждения = "";
		ФактАдресУчреждения = "";
		ТелефонОрганизации = "";
		
		ФактАдресУчреждения = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЮрФизЛицо, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
		ЮрАдресУчреждения = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЮрФизЛицо, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	
		ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЮрФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		
		СвойстваОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЮрФизЛицо,
		"НаименованиеСокращенное, НаименованиеПолное, ИНН, КодОКПО, ИспользоватьВПлатежныхДокументахСокращенноеНаименование");
		
		Сведения.Вставить("ВидКонтрагента", Перечисления.ЮрФизЛицо.ЮрЛицо);
		Сведения.Вставить("Телефоны", ТелефонОрганизации);
		Сведения.Вставить("ФактическийАдрес", ФактАдресУчреждения);
		Сведения.Вставить("ЮридическийАдрес", ЮрАдресУчреждения);
		Сведения.Вставить("КодОКПО", СвойстваОрганизации.КодОКПО);
		Сведения.Вставить("Наименование", 
		?(СвойстваОрганизации.ИспользоватьВПлатежныхДокументахСокращенноеНаименование,СвойстваОрганизации.НаименованиеСокращенное,СвойстваОрганизации.НаименованиеПолное));
		Сведения.Вставить("ИНН", СвойстваОрганизации.ИНН);
		
		Иначе Если ТипЗнч(ЮрФизЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			ЮрФизЛицоКИ = ЮрФизЛицо.ЮридическоеФизическоеЛицо;
			
			ВидКонтрагента = ?(ТипЗнч(ЮрФизЛицоКИ) = Тип("СправочникСсылка.ФизическиеЛица"),
			Перечисления.ЮрФизЛицо.ФизЛицо,
			Перечисления.ЮрФизЛицо.ЮрЛицо);
			
			Сведения.Вставить("ВидКонтрагента", ВидКонтрагента);
			
			ТелефонОрганизации = "";
			ТелефонФизЛица = "";
			ФактАдресУчреждения = "";
			ЮрАдресУчреждения = "";
			ЮрАдресФизЛица = "";
			
			ФактАдресУчреждения = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЮрФизЛицо, Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагенты);
			ЮрАдресУчреждения = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЮрФизЛицоКИ, Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты); 
			ЮрАдресФизЛица = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЮрФизЛицоКИ, Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица);
			ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЮрФизЛицоКИ, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагенты);
			ТелефонФизЛица = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЮрФизЛицоКИ, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица);
			Если НЕ ЗначениеЗаполнено(ТелефонФизЛица) Тогда
				ТелефонФизЛица = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЮрФизЛицоКИ, Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
			КонецЕсли;
			
			Если Сведения.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
				Сведения.Вставить("Телефоны", ТелефонОрганизации);
				СтруктураДанныхЛица = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЮрФизЛицоКИ, "КодОКПО, НаименованиеПолное");
				Если СтруктураДанныхЛица.Свойство("КодОКПО") Тогда
					КодОКПО = СтруктураДанныхЛица.КодОКПО;
				Иначе
					КодОКПО = "";
				КонецЕсли;
				
				Если СтруктураДанныхЛица.Свойство("НаименованиеПолное") Тогда
					НаименованиеПолное = СтруктураДанныхЛица.НаименованиеПолное;
				Иначе
					НаименованиеПолное = "";
				КонецЕсли;
				
				Сведения.Вставить("КодОКПО", КодОКПО);
				
				Если ЗначениеЗаполнено(НаименованиеПолное) Тогда
					Сведения.Вставить("Наименование", НаименованиеПолное);
				ИначеЕсли ЗначениеЗаполнено(ЮрФизЛицо.НаименованиеСокращенное) Тогда
					Сведения.Вставить("Наименование", ЮрФизЛицо.НаименованиеСокращенное);
				Иначе
					Сведения.Вставить("Наименование", ЮрФизЛицо.Наименование);
				КонецЕсли;
				
				Сведения.Вставить("ИНН", ЮрФизЛицо.ИНН);
				Сведения.Вставить("ФактическийАдрес", ФактАдресУчреждения);
				Сведения.Вставить("ЮридическийАдрес", ЮрАдресУчреждения);
				
			Иначе
				
				Сведения.Вставить("Телефоны", ТелефонФизЛица);
				Сведения.Вставить("ФактическийАдрес", ЮрАдресФизЛица);
				Сведения.Вставить("ЮридическийАдрес", ЮрАдресФизЛица);
				
				НаименованиеПолное = ЮрФизЛицо.НаименованиеСокращенное;
				Если НЕ ЗначениеЗаполнено(НаименованиеПолное) Тогда
					НаименованиеПолное = ЮрФизЛицо.Наименование;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(НаименованиеПолное) Тогда
					НаименованиеПолное = СокрЛП(ЮрФизЛицо);
				КонецЕсли;
				
				Сведения.Вставить("Наименование", НаименованиеПолное);
				Сведения.Вставить("ИНН", ЮрФизЛицо.ИНН);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Сведения;
	
КонецФункции

Функция ПодготовитьДанныеДляПечати(ДокСсылка, СведенияТТН)
	
	Результат = Новый Структура;
	
	ПолноеИмяОбъекта = СтандартныеПодсистемыВызовСервера.ПолноеИмяОбъектаМетаданных(ТипЗнч(ДокСсылка));
		
	РезультатЗапроса = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта).ДанныеДляТТН(ДокСсылка);
	
	РеквизитыШапки = РезультатЗапроса[0].Выбрать();
	РеквизитыШапки.Следующий();
		
	// Шапка
	Шапка = Новый Структура;
	Шапка.Вставить("Серия", СведенияТТН.СерияТТН);
	Шапка.Вставить("НомерДокумента", СведенияТТН.НомерТТН);
	Шапка.Вставить("ДатаДокумента", СведенияТТН.ДатаТТН);
	
	СведенияОГрузоотправителе = ПолучитьДанныеЮрФизЛицаТТН(РеквизитыШапки.Грузоотправитель);
	СведенияОГрузополучателе  = ПолучитьДанныеЮрФизЛицаТТН(РеквизитыШапки.Грузополучатель);
	
	Шапка.Вставить("ГрузоотправительПредставление", ПолучитьПредставление(РеквизитыШапки.Грузоотправитель,СведенияОГрузоотправителе));
	Шапка.Вставить("ГрузополучательПредставление", ПолучитьПредставление(РеквизитыШапки.Грузополучатель,СведенияОГрузополучателе));
	Шапка.Вставить("ПлательщикПредставление", ПолучитьПредставление(РеквизитыШапки.Грузополучатель, СведенияОГрузополучателе, РеквизитыШапки.РасчетныйСчетГрузополучателя));
					
	ГрузоотправительПоОКПО = "---";
	ГрузополучательПоОКПО  = "---";
	
	СведенияОГрузоотправителе.Свойство("КодОКПО",ГрузоотправительПоОКПО);
	СведенияОГрузополучателе.Свойство("КодОКПО",ГрузополучательПоОКПО);
	
	Шапка.Вставить("ГрузоотправительПоОКПО", ГрузоотправительПоОКПО);
	Шапка.Вставить("ГрузополучательПоОКПО",ГрузополучательПоОКПО);
	Шапка.Вставить("ПлательщикПоОКПО", ГрузополучательПоОКПО);
	
	Результат.Вставить("Шапка", Шапка);
	
	// Строки
	Строки = Новый ТаблицаЗначений;
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3));
	Строки.Колонки.Добавить("Количество", ОписаниеТипаЧисло);
	Строки.Колонки.Добавить("СуммаСНДС",  ОписаниеТипаЧисло);
	
	Если Не РезультатЗапроса[1].Пустой() Тогда
		Строки = РезультатЗапроса[1].Выгрузить();
	КонецЕсли;
		
	Результат.Вставить("Строки", Строки);
	
	// Подвал
	Подвал = Новый Структура;
	Подвал.Вставить("КоличествоЛистовПродолжения", 0);
	Подвал.Вставить("КоличествоПорядковыхНомеровЗаписейПрописью", ЧислоПрописью(Строки.Количество(), "Л=ru_RU;НП=Ложь;НД=Ложь;ДП=Ложь", ",,,,,,,,0"));
	Подвал.Вставить("ВсегоНаименований", ЧислоПрописью(Строки.Количество(), "Л=ru_RU;НП=Ложь;НД=Ложь;ДП=Ложь", ",,,,,,,,0"));
	Подвал.Вставить("ВсегоМестПрописью", ЧислоПрописью(Строки.Итог("Количество"), "Л=ru_RU;НП=Ложь;НД=Ложь;ДП=Ложь", ",,,,,,,,0"));
	Подвал.Вставить("ОтпускПроизвелДолжность", "");
	Подвал.Вставить("ФИООтпускПроизвел", "");
	Подвал.Вставить("НомераБланков", "");
	Подвал.Вставить("МассаГрузаНетто", "");
	Подвал.Вставить("МассаГрузаБрутто", "");
	Подвал.Вставить("НомерДоверенности", "");
	Подвал.Вставить("ДоверенностьВыдана", "");
	Подвал.Вставить("ГрузПринялДолжность", "");
	Подвал.Вставить("ФИОГрузПринял", "");
	Подвал.Вставить("ГрузПолучилДолжность", "");
	Подвал.Вставить("ФИОГрузПолучил", "");
	Подвал.Вставить("ОтпущеноНаСуммуПрописью", ЧислоПрописью(Строки.Итог("СуммаСНДС"), "Л=ru_RU", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2"));
	
	ОтветственныеЛица = ОрганизационнаяСтруктураПовтИсп.ОтветственныеЛицаОрганизацииСоответствием(РеквизитыШапки.Организация, РеквизитыШапки.Дата);
	Руководитель = ОтветственныеЛица.Получить("Руководитель");
	ГлБухгалтер =  ОтветственныеЛица.Получить("Главный бухгалтер");
	
	Подвал.Вставить("ОтпускРазрешилДолжность", Руководитель.ДолжностьПредставление);
	Подвал.Вставить("ФИООтпускРазрешил", КорреспондентыКлиентСервер.ФИО(Руководитель.ОтветственноеЛицоФИО, Истина));
	Подвал.Вставить("ФИОГлавногоБухгалтера", КорреспондентыКлиентСервер.ФИО(ГлБухгалтер.ОтветственноеЛицоФИО, Истина));
	
	Результат.Вставить("Подвал", Подвал);
	
	// Транспортный раздел
	ТранспортныйРаздел = Новый Структура;
	ТранспортныйРаздел.Вставить("СрокДоставки", СведенияТТН.СрокДоставки);
	ТранспортныйРаздел.Вставить("ОрганизацияПеревозчик", СведенияТТН.КонтрагентПеревозчик);
	ТранспортныйРаздел.Вставить("ОрганизацияЗаказчик", СведенияТТН.КонтрагентЗаказчик);
	ТранспортныйРаздел.Вставить("МаркаАвтомобиля", СведенияТТН.МаркаАвтомобиля);
	ТранспортныйРаздел.Вставить("ГосНомерАвтомобиля", СведенияТТН.ГосНомерАвтомобиля);
	ТранспортныйРаздел.Вставить("ФИОВодителя", СведенияТТН.Водитель);
	ТранспортныйРаздел.Вставить("ВодительскоеУдостоверение", СведенияТТН.УдостоверениеВодителя);
	ТранспортныйРаздел.Вставить("Лицензионная_Карточка", СведенияТТН.ЛицензионнаяКарточка);
	ТранспортныйРаздел.Вставить("ВидПеревозки", СведенияТТН.ВидПеревозки);
	ТранспортныйРаздел.Вставить("ПунктПогрузки", СведенияТТН.ПунктПогрузки);
	ТранспортныйРаздел.Вставить("ПунктРазгрузки", СведенияТТН.ПунктРазгрузки);
	ТранспортныйРаздел.Вставить("Прицеп", СведенияТТН.МаркаПрицепа);
	ТранспортныйРаздел.Вставить("ГосНомерПрицепа", СведенияТТН.ГосНомерПрицепа);
	ТранспортныйРаздел.Вставить("Номер", СведенияТТН.НомерТТН);
	
	Результат.Вставить("ТранспортныйРаздел", ТранспортныйРаздел);
	
	Возврат Результат;
КонецФункции

Функция ПолучитьПредставление(СпрСсылка, Сведения, РасчетныйСчет = Неопределено)
	
	Результат = "";
	
	Если Не ЗначениеЗаполнено(СпрСсылка) Тогда
		Возврат Результат;
	КонецЕсли;
		
	Результат = Сведения.Наименование + ", ИНН: " + Сведения.ИНН+ ", "+Сведения.ЮридическийАдрес + ", "+Сведения.Телефоны;
		
	Если ЗначениеЗаполнено(РасчетныйСчет) Тогда
		
		СтруктураПлатежныхРеквизитов = Новый Структура("Бик, Банк, Корреспондент, СчетНомер, КоррСчет",
		"Бик", "Банк", "Корреспондент", "СчетНомер", "КоррСчет");
		ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(РасчетныйСчет,
		РасчетныйСчет,
		СтруктураПлатежныхРеквизитов);
		
		РСчет = "";
		Если ЗначениеЗаполнено(СтруктураПлатежныхРеквизитов.СчетНомер) Тогда
			РСчет = "р/с " + СтруктураПлатежныхРеквизитов.СчетНомер;
			РСчет = РСчет + " в " + СтруктураПлатежныхРеквизитов.Банк;
			Если ЗначениеЗаполнено(СтруктураПлатежныхРеквизитов.КоррСчет) Тогда
				РСчет = РСчет + ", к/с " + СтруктураПлатежныхРеквизитов.КоррСчет;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтруктураПлатежныхРеквизитов.БИК) Тогда
				РСчет = РСчет + ", БИК " + СтруктураПлатежныхРеквизитов.БИК;
			КонецЕсли;
			
			Результат = Результат + ", " + РСчет;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли