#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура СформироватьДокументыКвитированияБезПлатежа(ПараметрыПроцедуры,АдресХранилища,АдресХранилищаДополнительный=Неопределено) Экспорт
	
	ФорматЭкспорта = ПараметрыПроцедуры.ФорматЭкспорта;
	МассивДокументов = ПараметрыПроцедуры.МассивДокументов;
	ТипЗапрашиваемыхДанных = ПараметрыПроцедуры.ТипЗапрашиваемыхДанных;
	НастройкаФорматов = ПараметрыПроцедуры.НастройкаФорматов;
	ВидОбмена = ПараметрыПроцедуры.ВидОбмена;
	НастройкаОбмена = ПараметрыПроцедуры.НастройкаОбмена;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КвитанцияНаОплатуГосуслуг.Ссылка КАК Начисление,
	               |	КвитанцияНаОплатуГосуслуг.Организация КАК Организация,
	               |	КвитанцияНаОплатуГосуслуг.УникальныйИдентификаторНачисления КАК УИН
	               |ИЗ
	               |	Документ.КвитанцияНаОплатуГосуслуг КАК КвитанцияНаОплатуГосуслуг
	               |ГДЕ
	               |	КвитанцияНаОплатуГосуслуг.Ссылка В(&МассивДокументов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НачислениеОтПодведомственного.Ссылка,
	               |	НачислениеОтПодведомственного.Организация,
	               |	НачислениеОтПодведомственного.УникальныйИдентификаторНачисления
	               |ИЗ
	               |	Документ.НачислениеОтПодведомственного КАК НачислениеОтПодведомственного
	               |ГДЕ
	               |	НачислениеОтПодведомственного.Ссылка В(&МассивДокументов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Начисление
	               |ИТОГИ ПО
	               |	Организация";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Результат = Запрос.Выполнить();
	ВыборкаПоОрганизациям = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивЗаданий = Новый Массив;
	
	Пока ВыборкаПоОрганизациям.Следующий() Цикл
		
		ДокументЭкспорта = Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.СоздатьДокумент();
		ДокументЭкспорта.Дата 				= ТекущаяДатаСеанса();
		ДокументЭкспорта.ДатаНач 			= ДокументЭкспорта.Дата;
		ДокументЭкспорта.ДатаКон 			= ДокументЭкспорта.Дата;
		ДокументЭкспорта.ВидОбмена 			= ВидОбмена;
		ДокументЭкспорта.НастройкаОбмена 	= НастройкаОбмена;
		ДокументЭкспорта.НастройкаФорматов 	= НастройкаФорматов;
		ДокументЭкспорта.Организация 		= ВыборкаПоОрганизациям.Организация;
		
		ЗаполнитьКаталогВыгрузкиЗаданияНаЭкспорт(ДокументЭкспорта);
		
		ДокументЗапросСтатусов = Документы.ЗапросУНИФО.СоздатьДокумент();
		ДокументЗапросСтатусов.Дата 					= ТекущаяДатаСеанса();
		ДокументЗапросСтатусов.Организация 				= ВыборкаПоОрганизациям.Организация;
		ДокументЗапросСтатусов.ТипЗапрашиваемыхДанных 	= "CHARGESTATUS";
		ДокументЗапросСтатусов.ТипИдентификатораДанных 	= "УИН";
	
		ВыборкаПоНачислениям = ВыборкаПоОрганизациям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаПоНачислениям.Следующий() Цикл
			НовСтр = ДокументЗапросСтатусов.ЗапрашиваемыеДанные.Добавить();
			НовСтр.Источник = ВыборкаПоНачислениям.Начисление;
			НовСтр.УИД = ВыборкаПоНачислениям.УИН;
					
			ДокументЗапрос = Документы.ЗапросУНИФО.СоздатьДокумент();
			ДокументЗапрос.Дата 					= ТекущаяДатаСеанса();
			ДокументЗапрос.Организация 				= ВыборкаПоОрганизациям.Организация;
			ДокументЗапрос.ТипЗапрашиваемыхДанных 	= ТипЗапрашиваемыхДанных;	
			ДокументЗапрос.Начисление = ВыборкаПоНачислениям.Начисление;
			ДокументЗапрос.КвитированиеБезПлатежа = Истина;
			ДокументЗапрос.Записать(РежимЗаписиДокумента.Запись);
			
			СтруктураРекв = Новый Структура;
			СтруктураРекв.Вставить("ПлатежноРасчетныйДокумент",ДокументЗапрос.Ссылка);
			СтруктураРекв.Вставить("Статус",Перечисления.СтатусыИсполненияДокумента.Подготовлен);
			ПлатежноРасчетныеДокументы.ЗарегестрироватьИсполнениеЗаявки(СтруктураРекв);
			
			СтрокаОбмена = ДокументЭкспорта.ОбъектыОбмена.Добавить();
			СтрокаОбмена.Объект = ДокументЗапрос.Ссылка;
			СтрокаОбмена.Формат = ФорматЭкспорта;
							
		КонецЦикла;	
		
		ДокументЗапросСтатусов.Записать(РежимЗаписиДокумента.Запись);
				
		СтруктураРекв = Новый Структура;
		СтруктураРекв.Вставить("ПлатежноРасчетныйДокумент",ДокументЗапросСтатусов.Ссылка);
		СтруктураРекв.Вставить("Статус",Перечисления.СтатусыИсполненияДокумента.Подготовлен);
		ПлатежноРасчетныеДокументы.ЗарегестрироватьИсполнениеЗаявки(СтруктураРекв);
		
		СтрокаОбмена = ДокументЭкспорта.ОбъектыОбмена.Добавить();
		СтрокаОбмена.Объект = ДокументЗапросСтатусов.Ссылка;
		СтрокаОбмена.Формат = ФорматЭкспорта;
							
		ДокументЭкспорта.Записать(РежимЗаписиДокумента.Запись);
		Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.СформироватьФайлыЭкспорта(ДокументЭкспорта);
		МассивЗаданий.Добавить(ДокументЭкспорта.Ссылка);
	КонецЦикла;
	
	Если ЕстьОшибкиВСписке(МассивЗаданий) Тогда
		ТекстПользовательскогоСообщения = Нстр("ru='При формирования файла запроса произошли ошибки.'");	
	КонецЕсли;
	
	СтруктураРезультата = Новый Структура("ТекстПользовательскогоСообщения,МассивЗаданий",ТекстПользовательскогоСообщения,МассивЗаданий);
	ПоместитьВоВременноеХранилище(СтруктураРезультата,АдресХранилища);

КонецПроцедуры
	
Функция ЕстьОшибкиВСписке(Задания,Простой = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.Ссылка,
		|	ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.ОписаниеОшибки
		|ИЗ
		|	Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.ОбъектыОбмена КАК ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена
		|ГДЕ
		|	ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.Описание = ""Подробно...""
		|	И ЗаданиеНаЭкспортДанныхВБанкиКСОбъектыОбмена.Ссылка В(&Ссылки)";

	Запрос.УстановитьПараметр("Ссылки", Задания);

	Результат = Запрос.Выполнить();
    Если Простой Тогда
		Возврат НЕ Результат.Пустой();	
	Иначе
		РезультатОшибок = Результат.Выгрузить();
		
		Если РезультатОшибок.Количество() >0 Тогда
			ОшибкаЕсть = Ложь;
			Для Каждого СтрТЧ Из РезультатОшибок Цикл
				ТЧОписаниеОшибки = ЗначениеИзСтрокиВнутр(СтрТЧ.ОписаниеОшибки);
				Если ТЧОписаниеОшибки.Количество()>0 Тогда
					Если ТЧОписаниеОшибки.Количество() = 1 Тогда
						Если ВРег(Лев(ТЧОписаниеОшибки[0].Ошибка,12)) = "КОД ОШИБКИ 3" Тогда
                        	//Платеж сквитирован с начислением, это нормально, не вызываем сообщение об ошибке.
						Иначе
							ОшибкаЕсть = Истина;
							Прервать;
						КонецЕсли;
					Иначе
						ОшибкаЕсть = Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Возврат ОшибкаЕсть;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Процедура ЗаполнитьКаталогВыгрузкиЗаданияНаЭкспорт(ДокументЭкспорта)
	Если ЗначениеЗаполнено(ДокументЭкспорта.НастройкаОбмена) Тогда
		РеквизитыНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументЭкспорта.НастройкаОбмена,"СпособОбмена,ПутьВыгрузкиПоУмолчанию");
		Если РеквизитыНастройки.СпособОбмена = Перечисления.СпособыВыгрузкиФайловПередачи.Каталог Тогда
			ДокументЭкспорта.КаталогВыгрузки = РеквизитыНастройки.ПутьВыгрузкиПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли