#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	Если Не Отказ тогда
		Документы.ВыпискаИзЛицевогоСчетаУчреждения.УстановитьСтатусВыписки(ЭтотОбъект.Ссылка, Перечисления.СтатусыИсполненияДокумента.НаИсполнении);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	//ТЗ = ДокументыДвижений.Выгрузить();   //исключаем дубли	
	//ТЗ.Свернуть("ИсполняющийДокумент");	
	//ДокументыДвижений.Загрузить(ТЗ);
	
	ДокументыДвижений.Свернуть("ИсполняющийДокумент, Курс"); //исключаем дубли
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.Организация				= "";
	ЭтотОбъект.ЛицевойСчет				= "";
	ЭтотОбъект.ДатаВыписки				= "";
	ЭтотОбъект.ДатаПредыдущейВыписки	= "";
	ЭтотОбъект.Остатки.Очистить();
	ЭтотОбъект.ДокументыДвижений.Очистить();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиНаЛицевыхСчетах.Записывать = Истина;
	Движения.ОстаткиНаЛицевыхСчетах.Очистить();
	
	// регистр ОстаткиНаЛицевыхСчетах
	Для Каждого ТекСтрокаОстатки Из Остатки Цикл
		Движение = Движения.ОстаткиНаЛицевыхСчетах.Добавить();
		Движение.Период 			= КонецДня(НачалоПериода);
		Движение.ЛицевойСчет 		= ЛицевойСчет;
		Движение.Показатель 		= ТекСтрокаОстатки.Показатель;
		Движение.НаНачалоДня 		= ТекСтрокаОстатки.ОстатокНаНачалоДня;
		Движение.НаКонецДня 		= ТекСтрокаОстатки.ОстатокНаКонецДня;
	КонецЦикла;
	
	Если Не Отказ тогда
		Документы.ВыпискаИзЛицевогоСчетаУчреждения.УстановитьСтатусВыписки(ЭтотОбъект.Ссылка, Перечисления.СтатусыИсполненияДокумента.Исполнен); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли