
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Валюта") И ЗначениеЗаполнено(Параметры.Валюта) Тогда
		Валюта = Параметры.Валюта;
	КонецЕсли;
	Если Параметры.Свойство("Договор") И ЗначениеЗаполнено(Параметры.Договор) Тогда
		Договор = Параметры.Договор;
		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора");
	Иначе
		ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	Если Параметры.Свойство("СуммаВВалюте") И ЗначениеЗаполнено(Параметры.СуммаВВалюте) Тогда
		СуммаВВалюте = Параметры.СуммаВВалюте;
	КонецЕсли;
	Если Параметры.Свойство("СуммаВРублях") И ЗначениеЗаполнено(Параметры.СуммаВРублях) Тогда
		СуммаВРублях = Параметры.СуммаВРублях;
	КонецЕсли;
	
	НачислениеДоходовВалюте = (Валюта <> Константы.ВалютаРегламентированногоУчета.Получить());
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаВВалюте", "Видимость", НачислениеДоходовВалюте);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Валюта", "Видимость", НачислениеДоходовВалюте);
	
	ПериодичностьЗаполнитьСписокВыбора(Элементы.ПериодичностьПлатежей.СписокВыбора, НачалоПериодаПлатежей, КонецПериодаПлатежей);
	ПериодичностьПлатежей = "ПоМесяцам";
	
	ВариантПлатежей = 1; // В начале периода.
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ПеренестиВДокумент Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НачалоПериодаПлатежей) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
			НСтр("ru = 'Начало периода оплаты'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "НачалоПериодаПлатежей", "", Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КонецПериодаПлатежей) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
			НСтр("ru = 'Конец периода оплаты'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "КонецПериодаПлатежей", "", Отказ);
	КонецЕсли;
	
	Если НачалоПериодаПлатежей > КонецПериодаПлатежей Тогда
		ТекстОшибки = НСтр("ru='Дата начала периода оплаты %1 превышает дату окончания %2'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
			Формат(НачалоПериодаПлатежей, "ДЛФ=Д"),
			Формат(КонецПериодаПлатежей, "ДЛФ=Д"));
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Корректность",
			НСтр("ru = 'Начало периода оплаты'"), , , ТекстОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "НачалоПериодаПлатежей", "", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодичностьПлатежейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПериодичностьЗаполнитьСписокВыбора(Элемент.СписокВыбора, НачалоПериодаПлатежей, КонецПериодаПлатежей);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПериодПлатежей(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = ЭтотОбъект.НачалоПериодаПлатежей;
	Диалог.Период.ДатаОкончания = ЭтотОбъект.КонецПериодаПлатежей;
	Диалог.Показать(Новый ОписаниеОповещения("УстановитьПериодПлатежейЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодПлатежейЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		ЭтотОбъект.НачалоПериодаПлатежей = Период.ДатаНачала;
		ЭтотОбъект.КонецПериодаПлатежей  = Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьГрафик(Команда)
	
	СтруктураРезультат = Новый Структура("СуммаВВалюте, СуммаВРублях, СпособРаспределения,
		|НачалоПериодаПлатежей, КонецПериодаПлатежей, ПериодичностьПлатежей, ВариантПлатежей");
	ЗаполнитьЗначенияСвойств(СтруктураРезультат, ЭтотОбъект);
	
	ПеренестиВДокумент = Истина;
	ОповеститьОВыборе(СтруктураРезультат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПериодичностьЗаполнитьСписокВыбора(СписокВыбора, НачалоПериода, КонецПериода)
	
	СписокВыбора.Очистить();
	
	СписокВыбора.Добавить("ПоМесяцам",    НСтр("ru = 'По месяцам'"));
	СписокВыбора.Добавить("ПоКварталам",  НСтр("ru = 'По кварталам'"));
	СписокВыбора.Добавить("ПоПолугодиям", НСтр("ru = 'По полугодиям'"));
	СписокВыбора.Добавить("ПоГодам",      НСтр("ru = 'По годам'"));
	
	// Дополнительные варианты, если дата начала и дата окончания периода
	// не совпадают с началом и окончанием календарного месяца (квартала, года).
	Если Не КонтрольИсполненияДоговоровКлиентСервер.ПериодКратенКалендарномуМесяцу(НачалоПериода, КонецПериода) Тогда
		СписокВыбора.Добавить("РазВ1Месяц", НСтр("ru = 'Раз в месяц'"));
	КонецЕсли;
	Если Не КонтрольИсполненияДоговоровКлиентСервер.ПериодКратенКалендарномуКварталу(НачалоПериода, КонецПериода) Тогда
		СписокВыбора.Добавить("РазВ3Месяца", НСтр("ru = 'Раз в 3 месяца'"));
	КонецЕсли;
	Если Не КонтрольИсполненияДоговоровКлиентСервер.ПериодКратенКалендарномуПолугодию(НачалоПериода, КонецПериода) Тогда
		СписокВыбора.Добавить("РазВ6Месяцев", НСтр("ru = 'Раз в 6 месяцев'"));
	КонецЕсли;
	Если Не КонтрольИсполненияДоговоровКлиентСервер.ПериодКратенКалендарномуГоду(НачалоПериода, КонецПериода) Тогда
		СписокВыбора.Добавить("РазВ12Месяцев", НСтр("ru = 'Раз в 12 месяцев'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

