#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем ПоляБезГруппировкиИтогов;

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ДокументРезультат.УстановитьРастягиваниеПоГоризонтали(ЛОЖЬ);
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	Настройки.События.ПриОпределенииСвойствЭлементовФормыНастроек = Истина; 
	Настройки.РазрешеноИзменятьСтруктуру = Ложь;
	Настройки.Печать.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт; 
	
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = Отчеты.ЖурналОпераций.ЗагрузитьНастройкиПриИзмененииПараметров(); 
	Настройки.РазрешеноВосстанавливатьСтандартнуюСхему = Истина;
		
	Настройки.ПараметрыРасположенияЭлементовУправления = Отчеты.ЖурналОпераций.ПараметрыРасположенияЭлементовУправления();
	
КонецПроцедуры

Процедура ПриОпределенииСвойствЭлементовФормыНастроек(ТипФормы, СвойстваЭлементов, ПользовательскиеНастройки) Экспорт 
	
	СвойстваГруппы = ОтчетыСервер.СвойстваГруппыЭлементовФормы();
	СвойстваГруппы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	СвойстваГруппы.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	СвойстваЭлементов.Группы.Вставить("ФиксированныеПараметры_0", СвойстваГруппы);
	
	ФиксированныеПараметры_0 = "ГруппироватьПоРазделителю, ОтборПоРазделителю"; 
	
	ШиринаПоля = Новый Структура("НомерЖурнала, ГруппировкиПользователя", 5, 30); 
	
	Для Каждого ЭлементНастройки Из ПользовательскиеНастройки Цикл 
		
		ИдентификаторГруппы = Неопределено;
		ИмяПараметра = Неопределено;
		
		Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда 
			Если СтрНайти(ФиксированныеПараметры_0, ЭлементНастройки.Параметр) > 0 Тогда
				ИдентификаторГруппы = "ФиксированныеПараметры_0"; 
			КонецЕсли;
			ИмяПараметра = Строка(ЭлементНастройки.Параметр);
		КонецЕсли; 
		
		Если ТипЗнч(ЭлементНастройки) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
			Если СтрНайти(ФиксированныеПараметры_0, ЭлементНастройки.ИдентификаторПользовательскойНастройки) > 0 Тогда
				ИдентификаторГруппы = "ФиксированныеПараметры_0"; 
			КонецЕсли; 
			ИмяПараметра = Строка(ЭлементНастройки.ИдентификаторПользовательскойНастройки);
		КонецЕсли; 
		
		СвойстваПоля = СвойстваЭлементов.Поля.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки, "ИдентификаторНастройки");
		
		Если СвойстваПоля = Неопределено Тогда 
			Продолжить;
		КонецЕсли;  
		
		Если Не ИдентификаторГруппы = Неопределено Тогда
			СвойстваПоля.ИдентификаторГруппы = ИдентификаторГруппы;
		КонецЕсли;
		
		Если ИмяПараметра = "НомерЖурнала" Тогда 
			СвойстваПоля.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
			СвойстваПоля.Ширина = 5;
			СвойстваПоля.РастягиватьПоГоризонтали = Ложь;
			СвойстваПоля.Представление = "Номер журнала";
		ИначеЕсли ИмяПараметра = "ГруппировкиПользователя" Тогда	
			СвойстваПоля.Ширина = 30;
			СвойстваПоля.РастягиватьПоГоризонтали = Ложь;
			СвойстваПоля.Представление = "Дополнительные группировки";
			СвойстваПоля.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//   Например, если схема отчета зависит от ключа варианта или параметров отчета.
//   Чтобы изменения схемы вступили в силу следует вызывать метод ОтчетыСервер.ПодключитьСхему().
//
// Параметры:
//   Контекст - Произвольный - 
//       Параметры контекста, в котором используется отчет.
//       Используется для передачи в параметрах метода ОтчетыСервер.ПодключитьСхему().
//   КлючСхемы - Строка -
//       Идентификатор текущей схемы компоновщика настроек.
//       По умолчанию не заполнен (это означает что компоновщик инициализирован на основании основной схемы).
//       Используется для оптимизации, чтобы переинициализировать компоновщик как можно реже.
//       Может не использоваться если переинициализация выполняется безусловно.
//   КлючВарианта - Строка
//                - Неопределено -
//       Имя предопределенного или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов для варианта расшифровки или без контекста.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных
//                    - Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено когда настройки варианта не надо загружать (уже загружены ранее).
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных
//                                    - Неопределено -
//       Пользовательские настройки, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено когда пользовательские настройки не надо загружать (уже загружены ранее).
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если НЕ ТипЗнч(НовыеНастройкиКД) = Тип("НастройкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Организация = Неопределено;
	ПараметрОрганизация = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	Если ПараметрОрганизация <> Неопределено Тогда  
		НастройкаОрганизация = Неопределено;
		Если НовыеПользовательскиеНастройкиКД <> Неопределено Тогда
			НастройкаОрганизация = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрОрганизация.ИдентификаторПользовательскойНастройки);
		КонецЕсли;	
		Если НастройкаОрганизация = Неопределено Тогда   
			НастройкаОрганизация = НовыеНастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрОрганизация.Параметр);
		КонецЕсли;
		Если НастройкаОрганизация <> Неопределено Тогда 
			Организация = НастройкаОрганизация.Значение;
		Иначе
			Организация = ПараметрОрганизация.Значение;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда 
		
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ПоВсемОрганизациям", Ложь);
		СтандартныеОтчетыКлиентСервер.УдалитьОтбор(НовыеНастройкиКД, "Организация", Истина);
		
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "НаименованиеУчреждения", Справочники.Организации.ПредставлениеУчреждения(Организация, Ложь));
		СвойстваОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "Бюджет,КодОКПО");
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "КодОКПО", СвойстваОрганизации.КодОКПО);
		РеквизитыБюджета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СвойстваОрганизации.Бюджет, "НаименованиеПубличноПравовогоОбразования,НаименованиеПолное");  
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "Учредитель", РеквизитыБюджета.НаименованиеПубличноПравовогоОбразования);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "Бюджет", РеквизитыБюджета.НаименованиеПолное);
		
		Подразделение = Неопределено;
		Исполнитель = Неопределено;
		
		ДатаЗначений = ТекущаяДатаСеанса();
		ПараметрДата = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаФормирования")); 
		Если ПараметрДата <> Неопределено Тогда 
			НастройкаДата = Неопределено;
			Если НовыеПользовательскиеНастройкиКД <> Неопределено Тогда
				НастройкаДата = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрДата.ИдентификаторПользовательскойНастройки);
			КонецЕсли;
			Если НастройкаДата = Неопределено Тогда
				НастройкаДата = НовыеНастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрДата.Параметр);
			КонецЕсли;
			Если НастройкаДата <> Неопределено Тогда
				Если ТипЗнч(НастройкаДата.Значение) = Тип("Дата") Тогда
					ДатаЗначений = НастройкаДата.Значение;
				Иначе
					ДатаЗначений = НастройкаДата.Значение.Дата;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
		ПараметрИсполнитель = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Исполнитель"));
		Если ПараметрИсполнитель <> Неопределено Тогда  
			НастройкаИсполнитель = Неопределено;
			Если НовыеПользовательскиеНастройкиКД <> Неопределено Тогда
				НастройкаИсполнитель = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрИсполнитель.ИдентификаторПользовательскойНастройки);  
			КонецЕсли;
			Если НастройкаИсполнитель = Неопределено Тогда
				НастройкаИсполнитель = НовыеНастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрИсполнитель.Параметр);
			КонецЕсли;
			Если НастройкаИсполнитель <> Неопределено Тогда
				Если НЕ ЗначениеЗаполнено(НастройкаИсполнитель.Значение) Тогда
					Исполнитель = СтандартныеОтчеты.ОтветственныйИсполнитель(Организация);
					НастройкаИсполнитель.Значение = Исполнитель;
				Иначе
					Исполнитель = НастройкаИсполнитель.Значение	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
			
		ПараметрПодразделение = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Подразделение"));
		Если ПараметрПодразделение <> Неопределено Тогда   
			НастройкаПодразделение = Неопределено;
			Если НовыеПользовательскиеНастройкиКД <> Неопределено Тогда
				НастройкаПодразделение = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрПодразделение.ИдентификаторПользовательскойНастройки); 
			КонецЕсли;
			Если НастройкаПодразделение = Неопределено Тогда
				НастройкаПодразделение = НовыеНастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрПодразделение.Параметр);
			КонецЕсли;
			Если НастройкаПодразделение <> Неопределено Тогда
				Если НЕ ЗначениеЗаполнено(НастройкаПодразделение.Значение) И ЗначениеЗаполнено(Исполнитель) Тогда
					Подразделение = СтандартныеОтчеты.ПодразделениеИсполнителя(Исполнитель, ДатаЗначений);
					НастройкаПодразделение.Значение = Подразделение;
				Иначе
					Подразделение = НастройкаПодразделение.Значение	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ПараметрГлБухгалтер = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ГлБухгалтер"));
		Если ПараметрГлБухгалтер <> Неопределено Тогда    
			НастройкаГлБухгалтер = Неопределено;
			Если НовыеПользовательскиеНастройкиКД <> Неопределено Тогда
				НастройкаГлБухгалтер = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрГлБухгалтер.ИдентификаторПользовательскойНастройки); 
			КонецЕсли;
			Если НастройкаГлБухгалтер = Неопределено Тогда
				НастройкаГлБухгалтер = НовыеНастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрГлБухгалтер.Параметр);
			КонецЕсли;
			Если НастройкаГлБухгалтер <> Неопределено Тогда
				Если НЕ ЗначениеЗаполнено(НастройкаГлБухгалтер.Значение) Тогда
					ГлБухгалтер = СтандартныеОтчеты.ГлавныйБухгалтер(Организация, ДатаЗначений, Подразделение);
					НастройкаГлБухгалтер.Значение = ГлБухгалтер;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		НаименованиеПодразделения = "";
		Если ЗначениеЗаполнено(Подразделение) И ОбщегоНазначения.СсылкаСуществует(Подразделение) Тогда    
			ПараметрыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подразделение, "НаименованиеПолное,Наименование,ОбособленноеПодразделение");
			Если ПараметрыПодразделения.ОбособленноеПодразделение И ЗначениеЗаполнено(ПараметрыПодразделения.НаименованиеПолное) Тогда
				НаименованиеПодразделения =	ПараметрыПодразделения.НаименованиеПолное;
			Иначе
				НаименованиеПодразделения =	ПараметрыПодразделения.Наименование;
			КонецЕсли;
		КонецЕсли;
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "НаименованиеПодразделения", НаименованиеПодразделения);
		
	Иначе
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "НаименованиеУчреждения", "");
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "КодОКПО", "");
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "Учредитель", "");
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "Бюджет", "");
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "НаименованиеПодразделения", "");
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "Исполнитель", "");
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "Подразделение", "");
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ГлБухгалтер", "");
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ПоВсемОрганизациям", ИСТИНА);
	КонецЕсли;	
	
	ЕстьПоказатель = Ложь;
	ЕстьРазделитель = Ложь;
	ПараметрЖурнал = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НомерЖурнала")); 
	НастройкаЖурнал = Неопределено;
	Если НЕ ПараметрЖурнал = Неопределено Тогда
		Если НовыеПользовательскиеНастройкиКД <> Неопределено Тогда
			НастройкаЖурнал = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрЖурнал.ИдентификаторПользовательскойНастройки);
		КонецЕсли; 
		Если НастройкаЖурнал = Неопределено Тогда
			НастройкаЖурнал = НовыеНастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрЖурнал.Параметр);
		КонецЕсли;
	КонецЕсли;
	Если НастройкаЖурнал <> Неопределено Тогда
		
		Журнал = НастройкаЖурнал.Значение;	
		
		МежотчетныйПериод = Журнал.МежотчетныйПериод;
		
		ЕстьПоказатель = ЗначениеЗаполнено(Журнал.ПоказательСтрока);
		ЕстьРазделитель = ЗначениеЗаполнено(Журнал.РазделительСтрока);
		СтруктураПоказателя = Новый Структура("ПоказательСтрока, ЭтоСубконто, ТипПоказателя, ТипРеквизита", Журнал.ПоказательСтрока, Ложь, Журнал.Показатель);
		СтруктураПоказателя = Справочники.Журналы.ЗаполнитьПоказательПоСтроке(СтруктураПоказателя);
		СтруктураРазделителя = Новый Структура("ПоказательСтрока, ЭтоСубконто, ТипПоказателя, ТипРеквизита", Журнал.РазделительСтрока, Ложь, Журнал.РазделительОпераций); 
		СтруктураРазделителя = Справочники.Журналы.ЗаполнитьПоказательПоСтроке(СтруктураРазделителя);
		
		Для Каждого ЭлементНастройки Из СхемаКомпоновкиДанных.НаборыДанных.НачальныеОстатки.Поля Цикл
			Если ЭлементНастройки.Поле = "Показатель" Тогда
				ЭлементНастройки.ТипЗначения = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(СтруктураПоказателя.ТипРеквизита)));
			ИначеЕсли ЭлементНастройки.Поле = "Разделитель" Тогда
				ЭлементНастройки.ТипЗначения = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(СтруктураРазделителя.ТипРеквизита)));
			КонецЕсли;
		КонецЦикла;	 
		ЕстьПоказатель = ЗначениеЗаполнено(Журнал.ПоказательСтрока);
		ЕстьРазделитель = ЗначениеЗаполнено(Журнал.РазделительСтрока);
		
		ГруппироватьПоРазделителю = Ложь;
		РазделительВГруппировке = Ложь;
		
		ПараметрГруппироватьПоРазделителю = НовыеНастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ГруппироватьПоРазделителю"));
		Если НЕ ПараметрГруппироватьПоРазделителю = Неопределено Тогда 
			НастройкаГруппировакаПоРазделителю = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрГруппироватьПоРазделителю.ИдентификаторПользовательскойНастройки);
			Если НастройкаГруппировакаПоРазделителю <> Неопределено Тогда
				ГруппироватьПоРазделителю = НастройкаГруппировакаПоРазделителю.Значение И ЕстьРазделитель; 
			Иначе
				ГруппироватьПоРазделителю = ПараметрГруппироватьПоРазделителю.Значение И ЕстьРазделитель;
			КонецЕсли; 
			Если ГруппироватьПоРазделителю Тогда
				Если НовыеНастройкиКД.Отбор.Элементы.Количество() = 0 
					ИЛИ НЕ НовыеНастройкиКД.Отбор.Элементы.Получить(0).ИдентификаторПользовательскойНастройки = "ОтборПоРазделителю" Тогда
					ОтборРазделитель = НовыеНастройкиКД.Отбор.Элементы.Вставить(0, Тип("ЭлементОтбораКомпоновкиДанных")); 
					ОтборРазделитель.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Разделитель");  
					ОтборРазделитель.Применение = ТипПримененияОтбораКомпоновкиДанных.Элементы; 
					ОтборРазделитель.ИдентификаторПользовательскойНастройки = "ОтборПоРазделителю";
					ОтборРазделитель.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
					ОтборРазделитель.Использование = Ложь;
				КонецЕсли;
			Иначе
				Если НовыеНастройкиКД.Отбор.Элементы.Количество() > 0 Тогда 
					ОтборРазделитель = НовыеНастройкиКД.Отбор.Элементы.Получить(0);
					Если ОтборРазделитель.ИдентификаторПользовательскойНастройки = "ОтборПоРазделителю" Тогда
						НовыеНастройкиКД.Отбор.Элементы.Удалить(ОтборРазделитель);
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			ПараметрГруппироватьПоРазделителю.РежимОтображения = ?(ЕстьРазделитель, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
		
		ПараметрПериод = НовыеНастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
		
		Если ПараметрПериод <> Неопределено И НовыеПользовательскиеНастройкиКД <> Неопределено Тогда
			НастройкаПериод = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрПериод.ИдентификаторПользовательскойНастройки);
			Если НастройкаПериод <> Неопределено Тогда
				ЗначениеПериод = НастройкаПериод.Значение; 
				Если МежотчетныйПериод Тогда
					ЗначениеПериод.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
					ЗначениеПериод.ДатаНачала = КонецГода(ЗначениеПериод.ДатаНачала);
					ЗначениеПериод.ДатаОкончания = КонецГода(ЗначениеПериод.ДатаНачала);
					
					ГраницаНачало = Бухгалтерскийучет.НачалоПериодаСУточнением(
					?(ЗначениеЗаполнено(ЗначениеПериод.ДатаОкончания), ЗначениеПериод.ДатаОкончания, Дата(3999, 12, 31)),  
					ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"), Истина);
					
					ГраницаКонец = Бухгалтерскийучет.КонецПериодаСУточнением(
					?(ЗначениеЗаполнено(ЗначениеПериод.ДатаОкончания), ЗначениеПериод.ДатаОкончания, Дата(3999, 12, 31)),  
					ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"));
				Иначе
					ГраницаНачало 	= ?(ЗначениеЗаполнено(ЗначениеПериод.ДатаНачала), НачалоДня(ЗначениеПериод.ДатаНачала), Дата(1, 1, 1));
					ГраницаКонец 	= ?(ЗначениеЗаполнено(ЗначениеПериод.ДатаОкончания),
					Бухгалтерскийучет.КонецПериодаСУточнением(ЗначениеПериод.ДатаОкончания, ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ЗаключениеСчетов")),
					Дата(3999, 12, 31));
				КонецЕсли;	
				СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "НачалоПериода", ГраницаНачало);
				СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "КонецПериода", ГраницаКонец);
			КонецЕсли;
		КонецЕсли;
		
		СворачиватьОднотипныеПроводки = Ложь;
		ПараметрСворачиватьОднотипныеПроводки = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СворачиватьОднотипныеПроводки"));
		НастройкаСворачиватьОднотипныеПроводки = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрСворачиватьОднотипныеПроводки.ИдентификаторПользовательскойНастройки);
		Если НастройкаСворачиватьОднотипныеПроводки <> Неопределено Тогда
			СворачиватьОднотипныеПроводки = НастройкаСворачиватьОднотипныеПроводки.Значение; 	
		КонецЕсли;
		
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ВидСубконтоПоказатель", СтруктураПоказателя.ТипПоказателя);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ВидСубконтоРазделитель", СтруктураРазделителя.ТипПоказателя);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ОстаткиВРазрезеПоказателя", Журнал.ОстаткиВРазрезеПоказателя);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ВыбиратьСНомеромЖурналаСчета", Журнал.ВыбиратьПроводкиСНомеромЖурналаСчета);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ВыбиратьСНомеромЖурнала", Истина);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "НеВыбиратьИзСпискаЖО", НЕ Журнал.ВыбиратьИзСпискаЖО.Количество());
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "НеВыводитьОстатки", Журнал.НеВыводитьОстатки);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "НеВыводитьОстаткиПоКЭК", Журнал.НеВыводитьОстаткиПоКЭК);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "МежотчетныйПериод", МежотчетныйПериод); 
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ГруппироватьПоРазделителю", ГруппироватьПоРазделителю); 
		
		СписокЖО = Новый СписокЗначений;
		Если Журнал.ВыбиратьИзСпискаЖО.Количество() Тогда
			МассивЖО = Журнал.ВыбиратьИзСпискаЖО.ВыгрузитьКолонку("Журнал");
			Для Каждого ЖО из МассивЖО Цикл
				СписокЖО.Добавить(Справочники.Журналы.НайтиПоКоду(ЖО));
			КонецЦикла;
		КонецЕсли;
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "СписокЖурналовОпераций", СписокЖО);
		
		ЖурОп = "Журнал операций ";
		Жур = "Журнал ";
		ДлинаВырезания = 0;
		Если Найти(Журнал.Наименование, ЖурОп) Тогда
			ДлинаВырезания = СтрДлина(ЖурОп);
		ИначеЕсли Найти(Журнал.Наименование, Жур) Тогда
			ДлинаВырезания = СтрДлина(Жур);
		КонецЕсли;
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ОписаниеЖурнала", Сред(Журнал.Наименование, ДлинаВырезания + 1));
		
		Если НовыеНастройкиКД.Структура[0].Структура[0].Структура.Количество() < 4 Тогда
			// старая СКД  
			ИспользуемыйВариант = ВариантыОтчетов.ВариантОтчета(ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет.ЖурналОпераций"), КлючВарианта);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Настройки варианта отчета ""%1"" не соответсвуют схеме. Возможно некорректное отображение данных. 
			|Рекомендуется внести изменения в настройки варианта отчета.'"),
			ИспользуемыйВариант);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Иначе	
			// Выводить/не_выводить обороты главной книги 
			НовыеНастройкиКД.Структура[0].Структура[0].Структура[1].Использование = Журнал.ВыводитьОборотыГлавнойКниги И НЕ Журнал.ОборотыГлавнойКнигиБезКорреспонденции;
			НовыеНастройкиКД.Структура[0].Структура[0].Структура[2].Использование = Журнал.ВыводитьОборотыГлавнойКниги И Журнал.ОборотыГлавнойКнигиБезКорреспонденции;
			НовыеНастройкиКД.Структура[0].Структура[0].Структура[3].Использование = Журнал.ВыводитьОборотыГлавнойКниги И Журнал.ОборотыГлавнойКнигиБезКорреспонденции;
		КонецЕсли;
		
		ОбщийМодульСКД.ДополнитьОтборНастроекКД(НовыеНастройкиКД.Отбор.Элементы, НовыеПользовательскиеНастройкиКД.Элементы);
		ТекстОтбор = СтандартныеОтчеты.ПолучитьТекстОтбора(НовыеНастройкиКД.Отбор, Неопределено);
		Если ЗначениеЗаполнено(ТекстОтбор) Тогда
			ТекстОтбор = "Примечание. В документе отражены данные, отвечающие условиям: " +  ТекстОтбор;
		КонецЕсли;
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ТекстОтбор", ТекстОтбор);
		
	Иначе
		Возврат;
	КонецЕсли;
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.НачальныеОстатки; //Начало Субконто"
	ТекстЗапроса = НаборДанных.Запрос;
	
	// Группировки..... 
	СписокГруппировок = Новый СписокЗначений;
	ПараметрГруппировка = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ГруппировкиПользователя")); 
	Если ПараметрГруппировка <> Неопределено Тогда
		НастройкаГруппировка = Неопределено;
		Если НовыеПользовательскиеНастройкиКД <> Неопределено Тогда
			НастройкаГруппировка = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрГруппировка.ИдентификаторПользовательскойНастройки); 
		КонецЕсли;
		Если НастройкаГруппировка = Неопределено Тогда
			НастройкаГруппировка = НовыеНастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрГруппировка.Параметр);
		КонецЕсли;
		Если НастройкаГруппировка <> Неопределено Тогда
			Если НастройкаГруппировка.Использование И ЗначениеЗаполнено(НастройкаГруппировка.Значение) Тогда 
				Если ТипЗнч(НастройкаГруппировка.Значение) = Тип("Строка") Тогда
					СписокГруппировок.Добавить(НастройкаГруппировка.Значение);
				Иначе
					СписокГруппировок = НастройкаГруппировка.Значение.Скопировать();	
				КонецЕсли; 
			Иначе
				НастройкаГруппировка.Использование = Ложь;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СписокГруппировок.Количество() > 0 Тогда
		
		НомерГруппировки = 1;
		Структура = НовыеНастройкиКД.Структура[0].Структура[0].Структура[0];
		Структура.Структура.Очистить(); // удаляем 3 группировки
		ГруппировкаБезИтогов = Ложь;
		РазделительВГруппировке = Ложь;
		
		Для каждого ГруппировкаОтчета из СписокГруппировок Цикл
			
			Если ГруппировкаОтчета.Значение = "РазделительДанных" Тогда 
				Если ГруппироватьПоРазделителю Или НЕ ЕстьРазделитель Тогда
					Продолжить;
				Иначе
					РазделительВГруппировке = Истина;
				КонецЕсли;
			КонецЕсли;	
			
			Структура = Структура.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			Структура.Имя = "Группировка" + НомерГруппировки;
			СтандартныеОтчетыКлиентСервер.УстановитьПараметрВывода(Структура, "РасположениеИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
			СтандартныеОтчетыКлиентСервер.УстановитьПараметрВывода(Структура, "ВертикальноеРасположениеОбщихИтогов", РасположениеИтоговКомпоновкиДанных.Нет);
			ПолеГруппировки = Структура.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Использование  = Истина;
			ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ГруппировкаОтчета.Значение);
			
			Если НЕ ПоляБезГруппировкиИтогов.Найти(ГруппировкаОтчета.Значение) = Неопределено Тогда
				
				ГруппировкаБезИтогов = Истина;
				
				ГруппаОтбора = Структура.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
				СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(ГруппаОтбора, "Сумма", 0, ВидСравненияКомпоновкиДанных.НеРавно);
				СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(ГруппаОтбора, "ДвиженияИлиГраницаПериода", 0, ВидСравненияКомпоновкиДанных.Равно);
				
				СтандартныеОтчетыКлиентСервер.УстановитьПараметрВывода(Структура, "ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
				
			КонецЕсли;
			
			Если ГруппировкаОтчета.Значение = "Показатель" ИЛИ ГруппировкаОтчета.Значение = "РазделительДанных" Тогда   
				
				ГруппаОтбора = Структура.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
				СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(ГруппаОтбора, "СуммаНачальныйОстатокДт", 0, ВидСравненияКомпоновкиДанных.НеРавно);
				СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(ГруппаОтбора, "СуммаНачальныйОстатокКт", 0, ВидСравненияКомпоновкиДанных.НеРавно);
				СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(ГруппаОтбора, "СуммаКонечныйОстатокДт", 0, ВидСравненияКомпоновкиДанных.НеРавно);
				СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(ГруппаОтбора, "СуммаКонечныйОстатокКт", 0, ВидСравненияКомпоновкиДанных.НеРавно);
				СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(ГруппаОтбора, "Сумма", 0, ВидСравненияКомпоновкиДанных.НеРавно);
				СтандартныеОтчетыКлиентСервер.УстановитьПараметрВывода(Структура, "ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
			ИначеЕсли Журнал.НеВыводитьОстатки Тогда
				СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(Структура.Отбор, "Сумма", 0, ВидСравненияКомпоновкиДанных.НеРавно);
				СтандартныеОтчетыКлиентСервер.УстановитьПараметрВывода(Структура, "ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
			КонецЕсли;
			
			ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
			
			Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			Структура.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
			// устанавливаем макет для группировки
			Для каждого МакетГруппировки из СхемаКомпоновкиДанных.МакетыГруппировок Цикл
				Если МакетГруппировки.ИмяГруппировки = "Группировка" + НомерГруппировки Тогда
					МакетДляИзменения = СхемаКомпоновкиДанных.Макеты.Найти(МакетГруппировки.Макет);
					МакетДляИзменения.Параметры.ПолеГруппировки.Выражение = "Представление(" + ГруппировкаОтчета.Значение + ")";
					Выр = МакетДляИзменения.Параметры.П2.ВыраженияПолей.Добавить();
					Выр.Выражение = "" + ГруппировкаОтчета.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			НомерГруппировки = НомерГруппировки + 1;
		КонецЦикла;
		
		Если ГруппировкаБезИтогов Тогда
			СтруктураДляГруппировки =  НовыеНастройкиКД.Структура[0].Структура[0].Структура[0].Структура;
			Позиция = 0;
		Иначе
			СтруктураДляГруппировки = Структура.Структура;
			Позиция = Неопределено;
		КонецЕсли;	
		
		// вставляем 3 группировки
		Если НЕ Журнал.НеВыводитьОстатки Тогда
			ВставитьГруппировку(Журнал, СтруктураДляГруппировки, "НачальныеОстатки", -1, "КФО,СчетКт,СчетДт,КПСКт,КПСДт,КЭККт,КЭКДт", Позиция);
		КонецЕсли;
		ВставитьГруппировку(Журнал, Структура.Структура, "Обороты", 0, "Период,УточнениеПериода,Регистратор");
		Если НЕ Журнал.НеВыводитьОстатки Тогда
			ВставитьГруппировку(Журнал, СтруктураДляГруппировки, "КонечныеОстатки", 1, "КФО,СчетКт,СчетДт,КПСКт,КПСДт,КЭККт,КЭКДт");
		КонецЕсли;
		
	Иначе
		// удаляем добавленные группировки и восстанавливаем группировки по умолчанию
		НовыеНастройкиКД.Структура[0].Структура[0].Структура[0].Структура.Очистить();
		//ВставитьГруппировку(Журнал, НовыеНастройкиКД.Структура[0].Структура[0].Структура, "НачальныеОстатки", -1, "КФО,СчетКт,КПСКт,КЭККт,СчетДт,КПСДт,КЭКДт");
		ВставитьГруппировку(Журнал, НовыеНастройкиКД.Структура[0].Структура[0].Структура[0].Структура, "НачальныеОстатки", -1, "КФО,СчетКт,СчетДт,КПСКт,КПСДт,КЭККт,КЭКДт");
		ВставитьГруппировку(Журнал, НовыеНастройкиКД.Структура[0].Структура[0].Структура[0].Структура, "Обороты", 0, "Период,УточнениеПериода,Регистратор");
		//ВставитьГруппировку(Журнал, НовыеНастройкиКД.Структура[0].Структура[0].Структура, "КонечныеОстатки", 1, "КФО,СчетКт,КПСКт,КЭККт,СчетДт,КПСДт,КЭКДт");
		ВставитьГруппировку(Журнал, НовыеНастройкиКД.Структура[0].Структура[0].Структура[0].Структура, "КонечныеОстатки", 1, "КФО,СчетКт,СчетДт,КПСКт,КПСДт,КЭККт,КЭКДт");
		
		НовыеНастройкиКД.Структура[0].Структура[0].Структура[0].Структура[0].Использование = НЕ Журнал.НеВыводитьОстатки;
		Если НовыеНастройкиКД.Структура[0].Структура[0].Структура[0].Структура.Количество() > 2 Тогда
			НовыеНастройкиКД.Структура[0].Структура[0].Структура[0].Структура[2].Использование = НЕ Журнал.НеВыводитьОстатки;
		КонецЕсли;
	КонецЕсли;
	
	//Группировки
	
	// Показатель
	Если СтруктураПоказателя.ЭтоСубконто Тогда
		ТекстСубконтоПоСубконто = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало Показатель Субконто", "//}Конец Показатель Субконто");
		//Если реквизит субконто, то вставляем следующий код
		ТекстВставки =
		"ВЫБОР
		|	КОГДА &ОстаткиВРазрезеПоказателя = ЛОЖЬ
		|		ТОГДА NULL
		|	КОГДА НомераСубконтоПоказателей.НомерСтроки = 1
		|		ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто1 КАК $1)$2
		|	КОГДА НомераСубконтоПоказателей.НомерСтроки = 2
		|		ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто2 КАК $1)$2
		|	КОГДА НомераСубконтоПоказателей.НомерСтроки = 3
		|		ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто3 КАК $1)$2
		|КОНЕЦ
		|";
		
		// Если выбор вместе с реквизитом
		ПозицияТочки = Найти(Журнал.ПоказательСтрока, ".");
		ИмяОбъекта = Журнал.ПоказательСтрока;
		ИмяРеквизит = "";
		Если ПозицияТочки Тогда
			ИмяОбъекта = Лев(Журнал.ПоказательСтрока, ПозицияТочки - 1);
			ИмяРеквизит = Сред(Журнал.ПоказательСтрока, ПозицияТочки);
		КонецЕсли;
		
		Если Метаданные.Справочники.Найти(ИмяОбъекта) <> Неопределено Тогда
			СтрокаЗамены = Метаданные.Справочники.Найти(ИмяОбъекта).ПолноеИмя();
		ИначеЕсли Метаданные.Перечисления.Найти(ИмяОбъекта) <> Неопределено Тогда
			СтрокаЗамены = Метаданные.Перечисления.Найти(ИмяОбъекта).ПолноеИмя();
		КонецЕсли;
		
		ТекстВставки = СтрЗаменить(ТекстВставки, "$1", СтрокаЗамены);  
		ТекстВставки = СтрЗаменить(ТекстВставки, "$2", ИмяРеквизит);  
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстСубконтоПоСубконто, ТекстВставки);    
		
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало Обороты Имя реквизита показателя", "//}Конец Обороты Имя реквизита показателя");
		ТекстРеквизитЗамена = "Обороты.Показатель";
		Если СтрДлина(ИмяРеквизит) Тогда
			ТекстРеквизитЗамена = ТекстРеквизитЗамена + ИмяРеквизит;
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);

		// Показатель обороты
		ПоказательОборотыЗамена = 
		"ВЫБОР
		|	КОГДА &ВыбиратьСНомеромЖурналаСчета И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт.НомерЖурнала = &НомерЖурнала ТОГДА
		|		ВЫБОР
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3
		|		КОНЕЦ
		|	КОГДА  &ВыбиратьСНомеромЖурналаСчета И ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт.НомерЖурнала = &НомерЖурнала ТОГДА
		|		ВЫБОР
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3
		|		КОНЕЦ
		|	ИНАЧЕ
		|		ВЫБОР
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 = &ВидСубконтоПоказатель ТОГДА
		|				ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3
		|		КОНЕЦ
		|КОНЕЦ";
		
		ТекстОбороты = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало Движения Показатель Субконто", "//}Конец Движения Показатель Субконто");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстОбороты, ПоказательОборотыЗамена);
		
	ИначеЕсли НЕ СтруктураПоказателя.ТипПоказателя = Неопределено Тогда
		ТекстСубконтоПоСубконто = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало Показатель Субконто", "//}Конец Показатель Субконто");
		Если СтрДлина(Журнал.ПоказательСтрока) Тогда
			// Значит это измерение или реквизит измерения
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстСубконтоПоСубконто, "ЖурналПроводокЕПСБУОстатки." + Журнал.ПоказательСтрока + "// Показатель");
		Иначе
			// Показатель не задан
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстСубконтоПоСубконто, "NULL" + "// Показатель");
		КонецЕсли;
		// Вставляем/убираем реквизит
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало НО Имя реквизита показателя", "//}Конец НО Имя реквизита показателя");
		ТекстРеквизитЗамена = "НачальныеОстатки.Показатель";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало Обороты Имя реквизита показателя", "//}Конец Обороты Имя реквизита показателя");
		ТекстРеквизитЗамена = "Обороты.Показатель";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало КО Имя реквизита показателя", "//}Конец КО Имя реквизита показателя");
		ТекстРеквизитЗамена = "КонечныеОстатки.Показатель";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		// Обороты показатель
		ОборотыЗамена = "ЖурналПроводокЕПСБУДвиженияССубконто." + Журнал.ПоказательСтрока + "// Показатель";
		Если НЕ СтрДлина(Журнал.ПоказательСтрока) Тогда
			ОборотыЗамена = "NULL" + " // Показатель";
		КонецЕсли;
		
		ПозицияТочки = Найти(Журнал.ПоказательСтрока, ".");
		ИмяОбъекта = Журнал.ПоказательСтрока;
		ИмяРеквизит = "";
		Если ПозицияТочки Тогда
			ИмяОбъекта = Лев(Журнал.ПоказательСтрока, ПозицияТочки - 1);
			ИмяРеквизит = Сред(Журнал.ПоказательСтрока, ПозицияТочки);
		КонецЕсли;
		Если СтрДлина(ИмяОбъекта) И НЕ Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.Измерения.Найти(ИмяОбъекта).Балансовый Тогда
			ОборотыЗамена = "ВЫБОР
			|	КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.$1Кт = NULL ТОГДА
			|		ЖурналПроводокЕПСБУДвиженияССубконто.$1Дт$2
			|	ИНАЧЕ 
			|		ЖурналПроводокЕПСБУДвиженияССубконто.$1Кт$2
			|КОНЕЦ";
			ОборотыЗамена = СтрЗаменить(ОборотыЗамена, "$1", ИмяОбъекта);
			Если ПозицияТочки Тогда
				ОборотыЗамена = СтрЗаменить(ОборотыЗамена, "$2", ИмяРеквизит);
			Иначе
				ОборотыЗамена = СтрЗаменить(ОборотыЗамена, "$2", "");
			КонецЕсли;
		КонецЕсли;
		ТекстОбороты = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало Движения Показатель Субконто", "//}Конец Движения Показатель Субконто");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстОбороты, ОборотыЗамена);
	КонецЕсли;
	
	//Разделитель
	Если СтруктураРазделителя.ЭтоСубконто И (ГруппироватьПоРазделителю ИЛИ РазделительВГруппировке) Тогда
		ТекстСубконтоПоСубконто = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало Разделитель Субконто", "//}Конец Разделитель Субконто");
		//Если реквизит субконто, то вставляем следующий код
		ТекстВставки =
		"ВЫБОР
		|	КОГДА НомераСубконтоРазделителей.НомерСтроки = 1
		|		ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто1 КАК $1)
		|	КОГДА НомераСубконтоРазделителей.НомерСтроки = 2
		|		ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто2 КАК $1)
		|	КОГДА НомераСубконтоРазделителей.НомерСтроки = 3
		|		ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто3 КАК $1)
		|КОНЕЦ
		|";
		
		// Если выбор вместе с реквизитом
		ПозицияТочки = Найти(СтруктураРазделителя.ПоказательСтрока, ".");
		ИмяОбъекта = СтруктураРазделителя.ПоказательСтрока;
		ИмяРеквизит = "";
		Если ПозицияТочки Тогда
			ИмяОбъекта = Лев(СтруктураРазделителя.ПоказательСтрока, ПозицияТочки - 1);
			ИмяРеквизит = Сред(СтруктураРазделителя.ПоказательСтрока, ПозицияТочки);
		КонецЕсли;
		
		Если Метаданные.Справочники.Найти(ИмяОбъекта) <> Неопределено Тогда
			СтрокаЗамены = Метаданные.Справочники.Найти(ИмяОбъекта).ПолноеИмя();
		ИначеЕсли Метаданные.Перечисления.Найти(ИмяОбъекта) <> Неопределено Тогда
			СтрокаЗамены = Метаданные.Перечисления.Найти(ИмяОбъекта).ПолноеИмя();
		КонецЕсли;
		
		ТекстВставки = СтрЗаменить(ТекстВставки, "$1", СтрокаЗамены);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстСубконтоПоСубконто, ТекстВставки);
		
		// Вставляем/убираем реквизит
		ТекстРеквизитЗамена = "НачальныеОстатки.РазделительQQ";
		ТекстРеквизитЗаменаД = """""";
		Если СтрДлина(ИмяРеквизит) Тогда
			ТекстРеквизитЗамена = ТекстРеквизитЗамена + ИмяРеквизит;
		КонецЕсли;
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало НО Имя реквизита разделителя", "//}Конец НО Имя реквизита разделителя");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ?(РазделительВГруппировке, ТекстРеквизитЗаменаД, ТекстРеквизитЗамена));
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Д_Начало НО Имя реквизита разделителя", "//}Д_Конец НО Имя реквизита разделителя");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ?(РазделительВГруппировке, ТекстРеквизитЗамена, ТекстРеквизитЗаменаД));
		
		ТекстРеквизитЗамена = "Обороты.РазделительQQ";
		ТекстРеквизитЗаменаД = """""";
		Если СтрДлина(ИмяРеквизит) Тогда
			ТекстРеквизитЗамена = ТекстРеквизитЗамена + ИмяРеквизит;
		КонецЕсли;
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало Обороты Имя реквизита разделителя", "//}Конец Обороты Имя реквизита разделителя");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ?(РазделительВГруппировке, ТекстРеквизитЗаменаД, ТекстРеквизитЗамена));
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Д_Начало Обороты Имя реквизита разделителя", "//}Д_Конец Обороты Имя реквизита разделителя");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ?(РазделительВГруппировке, ТекстРеквизитЗамена, ТекстРеквизитЗаменаД));
		
		ТекстРеквизитЗамена = "КонечныеОстатки.РазделительQQ";
		ТекстРеквизитЗаменаД = """""";
		Если СтрДлина(ИмяРеквизит) Тогда
			ТекстРеквизитЗамена = ТекстРеквизитЗамена + ИмяРеквизит;
		КонецЕсли;
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало КО Имя реквизита разделителя", "//}Конец КО Имя реквизита разделителя");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ?(РазделительВГруппировке, ТекстРеквизитЗаменаД, ТекстРеквизитЗамена));
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Д_Начало КО Имя реквизита разделителя", "//}Д_Конец КО Имя реквизита разделителя");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ?(РазделительВГруппировке, ТекстРеквизитЗамена, ТекстРеквизитЗаменаД));
		
		// Разделитель обороты
		РазделительОборотыЗамена = 
		"ВЫБОР
		|	КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт.НомерЖурнала = &НомерЖурнала
		|		ТОГДА ВЫБОР
		|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = &ВидСубконтоРазделитель
		|					ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1
		|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = &ВидСубконтоРазделитель
		|					ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2
		|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = &ВидСубконтоРазделитель
		|					ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3
		|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 = &ВидСубконтоРазделитель
		|					ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1
		|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 = &ВидСубконтоРазделитель
		|					ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2
		|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 = &ВидСубконтоРазделитель
		|					ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3
		|			КОНЕЦ
		|	КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт.НомерЖурнала = &НомерЖурнала
		|		ТОГДА ВЫБОР
		|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 = &ВидСубконтоРазделитель
		|					ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1
		|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 = &ВидСубконтоРазделитель
		|					ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2
		|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 = &ВидСубконтоРазделитель
		|					ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3
		|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = &ВидСубконтоРазделитель
		|					ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1
		|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = &ВидСубконтоРазделитель
		|					ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2
		|				КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = &ВидСубконтоРазделитель
		|					ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3
		|				КОНЕЦ
		|	ИНАЧЕ ВЫБОР
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = &ВидСубконтоРазделитель
		|				ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = &ВидСубконтоРазделитель
		|				ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = &ВидСубконтоРазделитель
		|				ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 = &ВидСубконтоРазделитель
		|				ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 = &ВидСубконтоРазделитель
		|				ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2
		|			КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 = &ВидСубконтоРазделитель
		|				ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3
		|		КОНЕЦ
		|КОНЕЦ";
		ТекстОбороты = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало Движения Разделитель Субконто", "//}Конец Движения Разделитель Субконто");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстОбороты, РазделительОборотыЗамена);
		
	Иначе
		ТекстСубконтоПоСубконто = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало Разделитель Субконто", "//}Конец Разделитель Субконто");
		Если ЗначениеЗаполнено(Журнал.РазделительСтрока) И (ГруппироватьПоРазделителю ИЛИ РазделительВГруппировке) Тогда
			// Значит это измерение или реквизит измерения
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстСубконтоПоСубконто, "ЖурналПроводокЕПСБУОстатки." + Журнал.РазделительСтрока + "// Разделитель");
			ПозицияТочки = Найти(Журнал.РазделительСтрока, ".");
			ИмяОбъекта = Журнал.РазделительСтрока;
			ИмяРеквизит = "";
			Если ПозицияТочки Тогда
				ИмяОбъекта = Лев(Журнал.РазделительСтрока, ПозицияТочки - 1);
				ИмяРеквизит = Сред(Журнал.РазделительСтрока, ПозицияТочки);
			КонецЕсли;
		Иначе
			// Показатель не задан
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстСубконтоПоСубконто, "NULL" + "// Разделитель");
			ИмяОбъекта = "";
			ИмяРеквизит = "";
		КонецЕсли;
		
		// Вставляем/убираем реквизит
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало НО Имя реквизита разделителя", "//}Конец НО Имя реквизита разделителя");
		ТекстРеквизитЗамена = "НачальныеОстатки.РазделительQQ";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Д_Начало НО Имя реквизита разделителя", "//}Д_Конец НО Имя реквизита разделителя");
		ТекстРеквизитЗамена = "НачальныеОстатки.РазделительQQ";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало Обороты Имя реквизита разделителя", "//}Конец Обороты Имя реквизита разделителя");
		ТекстРеквизитЗамена = "Обороты.РазделительQQ";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Д_Начало Обороты Имя реквизита разделителя", "//}Д_Конец Обороты Имя реквизита разделителя");
		ТекстРеквизитЗамена = "Обороты.РазделительQQ";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало КО Имя реквизита разделителя", "//}Конец КО Имя реквизита разделителя");
		ТекстРеквизитЗамена = "КонечныеОстатки.РазделительQQ";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		ТекстРеквизит = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Д_Начало КО Имя реквизита разделителя", "//}Д_Конец КО Имя реквизита разделителя");
		ТекстРеквизитЗамена = "КонечныеОстатки.РазделительQQ";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		
		// Обороты показатель
		ОборотыЗамена = "ЖурналПроводокЕПСБУДвиженияССубконто." + Журнал.РазделительСтрока + "// Разделитель";
		Если НЕ ЗначениеЗаполнено(Журнал.РазделительСтрока) ИЛИ НЕ ГруппироватьПоРазделителю ИЛИ НЕ РазделительВГруппировке Тогда
			ОборотыЗамена = "NULL" + " // Разделитель";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяОбъекта) И НЕ Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.Измерения.Найти(ИмяОбъекта).Балансовый Тогда
			ОборотыЗамена = "ВЫБОР
			|	КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.$1Кт = NULL ТОГДА
			|		ЖурналПроводокЕПСБУДвиженияССубконто.$1Дт$2
			|	ИНАЧЕ 
			|		ЖурналПроводокЕПСБУДвиженияССубконто.$1Кт$2
			|КОНЕЦ";
			ОборотыЗамена = СтрЗаменить(ОборотыЗамена, "$1", ИмяОбъекта);
			Если ПозицияТочки Тогда
				ОборотыЗамена = СтрЗаменить(ОборотыЗамена, "$2", ИмяРеквизит);
			Иначе
				ОборотыЗамена = СтрЗаменить(ОборотыЗамена, "$2", "");
			КонецЕсли;
		КонецЕсли;
		ТекстОбороты = СтандартныеОтчеты.ПолучитьТекстПоМаркерам(ТекстЗапроса, "//{Начало Движения Разделитель Субконто", "//}Конец Движения Разделитель Субконто");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстОбороты, ОборотыЗамена);
		
	КонецЕсли;
	
	Если СворачиватьОднотипныеПроводки Тогда
		// Вставляем/убираем реквизит
		ТекстРеквизит = "//{Начало Группировки однотипных проводок"
		+ СтандартныеОтчеты.ПолучитьТекстПоМаркерамСБелымиСимволами(ТекстЗапроса, "//{Начало Группировки однотипных проводок", "//}Конец Группировки однотипных проводок");
		ТекстРеквизитЗамена = 
		"//{Начало Группировки однотипных проводок
		|ВЫБРАТЬ
		|	МАКСИМУМ(Обороты.Счет) КАК Счет,
		|	Обороты.СчетДт,
		|	Обороты.СчетКт,
		|	МАКСИМУМ(Обороты.Субконто1) КАК Субконто1,
		|	МАКСИМУМ(Обороты.Субконто2) КАК Субконто2,
		|	МАКСИМУМ(Обороты.Субконто3) КАК Субконто3,
		|	Обороты.Организация,
		|	Обороты.Показатель,
		|	Обороты.РазделительQQ,
		|	МАКСИМУМ(Обороты.КПС) КАК КПС,
		|	МАКСИМУМ(Обороты.КЭК) КАК КЭК,
		|	МАКСИМУМ(Обороты.ИФО) КАК ИФО,
		|	МАКСИМУМ(Обороты.Валюта) КАК Валюта,
		|	Обороты.Подразделение,
		|	Обороты.КФО,
		|	Обороты.Регистратор,
		|	Обороты.ВидПервичногоДокумента,
		|	Обороты.ДатаПервичногоДокумента,
		|	Обороты.НомерПервичногоДокумента,
		|	МАКСИМУМ(Обороты.СуммаНачальныйОстатокДт) КАК СуммаНачальныйОстатокДт,
		|	МАКСИМУМ(Обороты.СуммаНачальныйОстатокКт) КАК СуммаНачальныйОстатокКт,
		|	СУММА(Обороты.Сумма) КАК Сумма,
		|	МАКСИМУМ(Обороты.СуммаКонечныйОстатокДт) КАК СуммаКонечныйОстатокДт,
		|	МАКСИМУМ(Обороты.СуммаКонечныйОстатокКт) КАК СуммаКонечныйОстатокКт,
		|	МАКСИМУМ(Обороты.ДвиженияИлиГраницаПериода) КАК ДвиженияИлиГраницаПериода,
		|	Обороты.Период,
		|	Обороты.УточнениеПериода,
		|	Обороты.КПСДт,
		|	Обороты.КПСКт,
		|	Обороты.КЭКДт,
		|	Обороты.КЭККт,
		|	МАКСИМУМ(Обороты.ПодразделениеДт) КАК ПодразделениеДт,
		|	МАКСИМУМ(Обороты.ПодразделениеКт) КАК ПодразделениеКт,
		|	МАКСИМУМ(Обороты.ХарактеристикаДвиженияДт) КАК ХарактеристикаДвиженияДт,
		|	МАКСИМУМ(Обороты.ХарактеристикаДвиженияКт) КАК ХарактеристикаДвиженияКт,
		|	СУММА(Обороты.ВалютнаяСуммаДт) КАК ВалютнаяСуммаДт,
		|	СУММА(Обороты.ВалютнаяСуммаКт) КАК ВалютнаяСуммаКт,
		|	МАКСИМУМ(Обороты.ОборотГлавнойКниги) КАК ОборотГлавнойКниги,
		|	ЕСТЬNULL(КорректныеКорреспонденцииСчетовДтХХКтХХ.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДтХХКтХ0.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДтХ0КтХХ.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДтХ0КтХ0.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДтХХКт00.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДт00КтХХ.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДтХ0Кт00.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДт00КтХ0.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДт00Кт00.Комментарий,
		|		"""")))))))))
		|	КАК СодержаниеИзКорректныхПроводок,
		|	СУММА(Обороты.СколькоСвернули) КАК СколькоСвернули,
		|	МИНИМУМ(Обороты.Содержание) КАК Содержание
		|ПОМЕСТИТЬ СгруппированныеОборотыНеВыбраноСодержание
		|ИЗ
		|	Обороты КАК Обороты
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорректныеКорреспонденцииСчетов КАК КорректныеКорреспонденцииСчетовДтХХКтХХ
		|ПО  Обороты.СчетДт = КорректныеКорреспонденцииСчетовДтХХКтХХ.СчетДт И
		|	Обороты.СчетКт = КорректныеКорреспонденцииСчетовДтХХКтХХ.СчетКт
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорректныеКорреспонденцииСчетов КАК КорректныеКорреспонденцииСчетовДтХХКтХ0
		|ПО  Обороты.СчетДт = КорректныеКорреспонденцииСчетовДтХХКтХ0.СчетДт И
		|	Обороты.СчетКт.Родитель = КорректныеКорреспонденцииСчетовДтХХКтХ0.СчетКт
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорректныеКорреспонденцииСчетов КАК КорректныеКорреспонденцииСчетовДтХ0КтХХ
		|ПО 	Обороты.СчетДт.Родитель = КорректныеКорреспонденцииСчетовДтХ0КтХХ.СчетДт И
		|	Обороты.СчетКт = КорректныеКорреспонденцииСчетовДтХ0КтХХ.СчетКт
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорректныеКорреспонденцииСчетов КАК КорректныеКорреспонденцииСчетовДтХ0КтХ0
		|ПО 	Обороты.СчетДт.Родитель = КорректныеКорреспонденцииСчетовДтХ0КтХ0.СчетДт И
		|	Обороты.СчетКт.Родитель = КорректныеКорреспонденцииСчетовДтХ0КтХ0.СчетКт
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорректныеКорреспонденцииСчетов КАК КорректныеКорреспонденцииСчетовДтХХКт00
		|ПО 	Обороты.СчетДт = КорректныеКорреспонденцииСчетовДтХХКт00.СчетДт И
		|	Обороты.СчетКт.Родитель.Родитель = КорректныеКорреспонденцииСчетовДтХХКт00.СчетКт
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорректныеКорреспонденцииСчетов КАК КорректныеКорреспонденцииСчетовДт00КтХХ
		|ПО 	Обороты.СчетДт.Родитель.Родитель = КорректныеКорреспонденцииСчетовДт00КтХХ.СчетДт И
		|	Обороты.СчетКт = КорректныеКорреспонденцииСчетовДт00КтХХ.СчетКт
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорректныеКорреспонденцииСчетов КАК КорректныеКорреспонденцииСчетовДтХ0Кт00
		|ПО 	Обороты.СчетДт.Родитель = КорректныеКорреспонденцииСчетовДтХ0Кт00.СчетДт И
		|	Обороты.СчетКт.Родитель.Родитель = КорректныеКорреспонденцииСчетовДтХ0Кт00.СчетКт
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорректныеКорреспонденцииСчетов КАК КорректныеКорреспонденцииСчетовДт00КтХ0
		|ПО 	Обороты.СчетДт.Родитель.Родитель = КорректныеКорреспонденцииСчетовДт00КтХ0.СчетДт И
		|	Обороты.СчетКт.Родитель = КорректныеКорреспонденцииСчетовДт00КтХ0.СчетКт
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КорректныеКорреспонденцииСчетов КАК КорректныеКорреспонденцииСчетовДт00Кт00
		|ПО 	Обороты.СчетДт.Родитель.Родитель = КорректныеКорреспонденцииСчетовДт00Кт00.СчетДт И
		|	Обороты.СчетКт.Родитель.Родитель = КорректныеКорреспонденцииСчетовДт00КтХ0.СчетКт
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.Организация,
		|	Обороты.Подразделение,
		|	Обороты.Регистратор,
		|	Обороты.ВидПервичногоДокумента,
		|	Обороты.ДатаПервичногоДокумента,
		|	Обороты.НомерПервичногоДокумента,
		|	Обороты.Показатель,
		|	Обороты.РазделительQQ,
		|	Обороты.КПСДт,
		|	Обороты.КПСКт,
		|	Обороты.КФО,
		|	Обороты.СчетДт,
		|	Обороты.СчетКт,
		|	Обороты.Период,
		|	Обороты.УточнениеПериода,
		|	Обороты.КЭКДт,
		|	Обороты.КЭККт,
		|	ЕСТЬNULL(КорректныеКорреспонденцииСчетовДтХХКтХХ.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДтХХКтХ0.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДтХ0КтХХ.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДтХ0КтХ0.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДтХХКт00.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДт00КтХХ.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДтХ0Кт00.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДт00КтХ0.Комментарий,
		|		ЕСТЬNULL(КорректныеКорреспонденцииСчетовДт00Кт00.Комментарий,
		|		"""")))))))))
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СгруппированныеОборотыНеВыбраноСодержание.Счет,
		|	СгруппированныеОборотыНеВыбраноСодержание.СчетДт,
		|	СгруппированныеОборотыНеВыбраноСодержание.СчетКт,
		|	СгруппированныеОборотыНеВыбраноСодержание.Субконто1,
		|	СгруппированныеОборотыНеВыбраноСодержание.Субконто2,
		|	СгруппированныеОборотыНеВыбраноСодержание.Субконто3,
		|	СгруппированныеОборотыНеВыбраноСодержание.Организация,
		|	СгруппированныеОборотыНеВыбраноСодержание.Показатель,
		|	СгруппированныеОборотыНеВыбраноСодержание.РазделительQQ,
		|	СгруппированныеОборотыНеВыбраноСодержание.КПС,
		|	СгруппированныеОборотыНеВыбраноСодержание.КЭК,
		|	СгруппированныеОборотыНеВыбраноСодержание.ИФО,
		|	СгруппированныеОборотыНеВыбраноСодержание.Валюта,
		|	СгруппированныеОборотыНеВыбраноСодержание.Подразделение,
		|	СгруппированныеОборотыНеВыбраноСодержание.КФО,
		|	СгруппированныеОборотыНеВыбраноСодержание.Регистратор,
		|	СгруппированныеОборотыНеВыбраноСодержание.ВидПервичногоДокумента,
		|	СгруппированныеОборотыНеВыбраноСодержание.ДатаПервичногоДокумента,
		|	СгруппированныеОборотыНеВыбраноСодержание.НомерПервичногоДокумента,
		|	СгруппированныеОборотыНеВыбраноСодержание.СуммаНачальныйОстатокДт,
		|	СгруппированныеОборотыНеВыбраноСодержание.СуммаНачальныйОстатокКт,
		|	СгруппированныеОборотыНеВыбраноСодержание.Сумма,
		|	СгруппированныеОборотыНеВыбраноСодержание.СуммаКонечныйОстатокДт,
		|	СгруппированныеОборотыНеВыбраноСодержание.СуммаКонечныйОстатокКт,
		|	СгруппированныеОборотыНеВыбраноСодержание.ДвиженияИлиГраницаПериода,
		|	СгруппированныеОборотыНеВыбраноСодержание.Период,
		|	СгруппированныеОборотыНеВыбраноСодержание.УточнениеПериода,
		|	СгруппированныеОборотыНеВыбраноСодержание.КПСДт,
		|	СгруппированныеОборотыНеВыбраноСодержание.КПСКт,
		|	СгруппированныеОборотыНеВыбраноСодержание.КЭКДт,
		|	СгруппированныеОборотыНеВыбраноСодержание.КЭККт,
		|	СгруппированныеОборотыНеВыбраноСодержание.ПодразделениеДт,
		|	СгруппированныеОборотыНеВыбраноСодержание.ПодразделениеКт,
		|	СгруппированныеОборотыНеВыбраноСодержание.ХарактеристикаДвиженияДт,
		|	СгруппированныеОборотыНеВыбраноСодержание.ХарактеристикаДвиженияКт,
		|	СгруппированныеОборотыНеВыбраноСодержание.ВалютнаяСуммаДт,
		|	СгруппированныеОборотыНеВыбраноСодержание.ВалютнаяСуммаКт,
		|	СгруппированныеОборотыНеВыбраноСодержание.ОборотГлавнойКниги,
		|	ВЫБОР
		|		КОГДА СгруппированныеОборотыНеВыбраноСодержание.СколькоСвернули = 1 ТОГДА
		|			СгруппированныеОборотыНеВыбраноСодержание.Содержание
		|		ИНАЧЕ
		|			СгруппированныеОборотыНеВыбраноСодержание.СодержаниеИзКорректныхПроводок
		|	КОНЕЦ КАК Содержание
		|ПОМЕСТИТЬ СгруппированныеОбороты
		|ИЗ
		|	СгруппированныеОборотыНеВыбраноСодержание КАК СгруппированныеОборотыНеВыбраноСодержание
		|;
		
		|";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		
		ТекстРеквизит = "//{Начало Выбор таблицы однотипных проводок" + СтандартныеОтчеты.ПолучитьТекстПоМаркерамСБелымиСимволами(ТекстЗапроса, "//{Начало Выбор таблицы однотипных проводок", "//}Конец Выбор таблицы однотипных проводок");
		ТекстРеквизитЗамена =
		"//{Начало Выбор таблицы однотипных проводок
		|	СгруппированныеОбороты КАК Обороты";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		
	Иначе
		
		ТекстРеквизит = "//{Начало Группировки однотипных проводок"
		+ СтандартныеОтчеты.ПолучитьТекстПоМаркерамСБелымиСимволами(ТекстЗапроса, "//{Начало Группировки однотипных проводок", "//}Конец Группировки однотипных проводок");
		ТекстРеквизитЗамена = 
		"//{Начало Группировки однотипных проводок
		|";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		
		ТекстРеквизит = "//{Начало Выбор таблицы однотипных проводок"
		+ СтандартныеОтчеты.ПолучитьТекстПоМаркерамСБелымиСимволами(ТекстЗапроса, "//{Начало Выбор таблицы однотипных проводок", "//}Конец Выбор таблицы однотипных проводок");
		ТекстРеквизитЗамена =
		"//{Начало Выбор таблицы однотипных проводок
		|	Обороты КАК Обороты";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
		
	КонецЕсли;
	
	// НеВыводитьОстаткиПоКЭК ---------------------------------------------------
	ТекстЗапроса = СформироватьОстаткиПоКЭК(ТекстЗапроса,
	"//{Начало Группировки начальных остатков",
	"//}Конец Группировки начальных остатков",
	"НачальныеОстатки",
	"//{Начало Выбор таблицы начальных остатков",
	"//}Конец Выбор таблицы начальных остатков");
	
	ТекстЗапроса = СформироватьОстаткиПоКЭК(ТекстЗапроса,
	"//{Начало Группировки конечных остатков",
	"//}Конец Группировки конечных остатков",
	"КонечныеОстатки",
	"//{Начало Выбор таблицы конечных остатков",
	"//}Конец Выбор таблицы конечных остатков");
	
	НаборДанных.Запрос = ТекстЗапроса;
	
	ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Процедура ВставитьГруппировку(НомерЖурнала, Структура, ИмяГруппировки, ЗначениеОтбора, Порядок = "", Позиция = Неопределено)
	
	Если Позиция = Неопределено Тогда
		ГруппировкаКД = Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Иначе
		ГруппировкаКД = Структура.Вставить(Позиция, Тип("ГруппировкаКомпоновкиДанных"));
	КонецЕсли;
	ГруппировкаКД.Имя = ИмяГруппировки;
	ГруппировкаКД.ПоляГруппировки.Элементы.Добавить(Тип("АвтоПолеГруппировкиКомпоновкиДанных"));
	СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(ГруппировкаКД.Отбор, "ДвиженияИлиГраницаПериода", ЗначениеОтбора);
	Если ЗначениеОтбора = -1 ИЛИ ЗначениеОтбора = 1 Тогда //убираем пустые остатки
		ГруппаОтбора = ГруппировкаКД.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(ГруппаОтбора, "СуммаНачальныйОстатокДт", 0, ВидСравненияКомпоновкиДанных.НеРавно);
		СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(ГруппаОтбора, "СуммаНачальныйОстатокКт", 0, ВидСравненияКомпоновкиДанных.НеРавно);
		СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(ГруппаОтбора, "СуммаКонечныйОстатокДт", 0, ВидСравненияКомпоновкиДанных.НеРавно);
		СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(ГруппаОтбора, "СуммаКонечныйОстатокКт", 0, ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЕсли;
	СтандартныеОтчетыКлиентСервер.УстановитьПараметрВывода(ГруппировкаКД, "ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
	ГруппировкаКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Если Порядок = "" Тогда
		ГруппировкаКД.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	Иначе
		// Полей может быть несколько. Тогда они должны быть разделены запятой
		МассивПорядка = СтрРазделить(Порядок, ",");
		Для Каждого ЭлПорядка Из МассивПорядка Цикл
			ЭлементПорядка = ГруппировкаКД.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
			ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных(ЭлПорядка);
			ЭлементПорядка.Использование = Истина;
		КонецЦикла;	
	
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьОстаткиПоКЭК(ТекстЗапроса,
		НачальнаяМеткаГруппировки, //"//{Начало Группировки начальных остатков",
		КонечнаяМеткаГруппировки, //"//}Конец Группировки начальных остатков",
		ИмяТаблицы, //"НачальныеОстатки",
		НачальнаяМеткаТаблицы, //"//{Начало Выбор таблицы начальных остатков",
		КонечнаяМеткаТаблицы //"//{Конец Выбор таблицы начальных остатков");
)
	ТекстРеквизит = НачальнаяМеткаГруппировки +
		СтандартныеОтчеты.ПолучитьТекстПоМаркерамСБелымиСимволами(
			ТекстЗапроса, НачальнаяМеткаГруппировки, КонечнаяМеткаГруппировки);
	
	ТекстРеквизитЗамена = НачальнаяМеткаГруппировки;
	
	ТекстРеквизитЗамена = ТекстРеквизитЗамена + "
		|ВЫБРАТЬ
		|	${Таблица}.Счет КАК Счет,
		|	ВЫБОР 
		|		КОГДА (${Таблица}.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)) И (${Таблица}.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) 
		|			ТОГДА ${Таблица}.СчетКт
		|		КОГДА (${Таблица}.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)) И НЕ (${Таблица}.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) 
		|			ТОГДА ${Таблица}.СчетДт
		|		ИНАЧЕ ${Таблица}.СчетДт
		|	КОНЕЦ КАК СчетДт,
		|	ВЫБОР
		|		КОГДА (${Таблица}.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)) И (${Таблица}.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) 
		|			ТОГДА ${Таблица}.СчетДт
		|		КОГДА (${Таблица}.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)) И НЕ (${Таблица}.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) 
		|			ТОГДА ${Таблица}.СчетКт
		|		ИНАЧЕ ${Таблица}.СчетКт
		|	КОНЕЦ КАК СчетКт,
		|	${Таблица}.Субконто1 КАК Субконто1,
		|	${Таблица}.Субконто2 КАК Субконто2,
		|	${Таблица}.Субконто3 КАК Субконто3,
		|	${Таблица}.Организация,
		|	${Таблица}.Показатель,
		|	${Таблица}.РазделительQQ,
		|	${Таблица}.КПС КАК КПС,
		|	${Таблица}.КЭК КАК КЭК,
		|	${Таблица}.ИФО КАК ИФО,
		|	${Таблица}.Валюта КАК Валюта,
		|	${Таблица}.Подразделение,
		|	${Таблица}.КФО,
		|	${Таблица}.Регистратор,
		|	${Таблица}.ВидПервичногоДокумента,
		|	${Таблица}.ДатаПервичногоДокумента,
		|	${Таблица}.НомерПервичногоДокумента,
		|	СУММА(${Таблица}.СуммаНачальныйОстатокДт)КАК СуммаНачальныйОстатокДт,
		|	СУММА(${Таблица}.СуммаНачальныйОстатокКт)КАК СуммаНачальныйОстатокКт,
		|	СУММА(${Таблица}.Сумма) КАК Сумма,
		|	СУММА(${Таблица}.СуммаКонечныйОстатокДт) КАК СуммаКонечныйОстатокДт,
		|	СУММА(${Таблица}.СуммаКонечныйОстатокКт) КАК СуммаКонечныйОстатокКт,
		|	${Таблица}.ДвиженияИлиГраницаПериода КАК ДвиженияИлиГраницаПериода,
		|	${Таблица}.Период,
		|	${Таблица}.КПСДт,
		|	${Таблица}.КПСКт,
		|	${Таблица}.КЭКДт КАК КЭКДт,
		|	${Таблица}.КЭККт КАК КЭККт,
		|	${Таблица}.ПодразделениеДт КАК ПодразделениеДт,
		|	${Таблица}.ПодразделениеКт КАК ПодразделениеКт,
		|	${Таблица}.Содержание КАК Содержание,
		|	${Таблица}.ХарактеристикаДвиженияДт КАК ХарактеристикаДвиженияДт,
		|	${Таблица}.ХарактеристикаДвиженияКт КАК ХарактеристикаДвиженияКт,
		|	СУММА(${Таблица}.ВалютнаяСуммаДт) КАК ВалютнаяСуммаДт,
		|	СУММА(${Таблица}.ВалютнаяСуммаКт) КАК ВалютнаяСуммаКт,
		|	${Таблица}.ОборотДляГлавнойКниги КАК ОборотДляГлавнойКниги
		|ПОМЕСТИТЬ ДляГруппировкиКЭК";
		ТекстРеквизитЗамена = ТекстРеквизитЗамена + "${Таблица}
		|ИЗ
		|	${Таблица} КАК ${Таблица}
		|СГРУППИРОВАТЬ ПО
		|	${Таблица}.Счет,
		|	ВЫБОР 
		|		КОГДА (${Таблица}.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)) И (${Таблица}.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) 
		|			ТОГДА ${Таблица}.СчетКт
		|		КОГДА (${Таблица}.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)) И НЕ (${Таблица}.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) 
		|			ТОГДА ${Таблица}.СчетДт
		|		ИНАЧЕ ${Таблица}.СчетДт
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА (${Таблица}.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)) И (${Таблица}.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) 
		|			ТОГДА ${Таблица}.СчетДт
		|		КОГДА (${Таблица}.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)) И НЕ (${Таблица}.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) 
		|			ТОГДА ${Таблица}.СчетКт
		|		ИНАЧЕ ${Таблица}.СчетКт
		|	КОНЕЦ,
		|	${Таблица}.Субконто1,
		|	${Таблица}.Субконто2,
		|	${Таблица}.Субконто3,
		|	${Таблица}.Организация,
		|	${Таблица}.Показатель,
		|	${Таблица}.РазделительQQ,
		|	${Таблица}.КПС,
		|	${Таблица}.КЭК,
		|	${Таблица}.ИФО,
		|	${Таблица}.Валюта,
		|	${Таблица}.Подразделение,
		|	${Таблица}.КФО,
		|	${Таблица}.Регистратор,
		|	${Таблица}.ВидПервичногоДокумента,
		|	${Таблица}.ДатаПервичногоДокумента,
		|	${Таблица}.НомерПервичногоДокумента,
		|	${Таблица}.ДвиженияИлиГраницаПериода,
		|	${Таблица}.Период,
		|	${Таблица}.КПСДт,
		|	${Таблица}.КПСКт,
		|	${Таблица}.КЭКДт,
		|	${Таблица}.КЭККт,
		|	${Таблица}.ПодразделениеДт,
		|	${Таблица}.ПодразделениеКт,
		|	${Таблица}.Содержание,
		|	${Таблица}.ХарактеристикаДвиженияДт,
		|	${Таблица}.ХарактеристикаДвиженияКт,
		|	${Таблица}.ОборотДляГлавнойКниги
		|;
		|ВЫБРАТЬ
		|	МАКСИМУМ(${Таблица}.Счет) КАК Счет,
		|	ВЫБОР
		|		КОГДА ${Таблица}.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
		|     		ТОГДА 
		|				ВЫБОР 
		|					КОГДА (${Таблица}.СуммаНачальныйОстатокДт - ${Таблица}.СуммаНачальныйОстатокКт > 0
		|						ИЛИ ${Таблица}.СуммаКонечныйОстатокДт - ${Таблица}.СуммаКонечныйОстатокКт > 0)
		|						ТОГДА ${Таблица}.СчетДт
		|                 ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
		|				КОНЕЦ
		|		ИНАЧЕ ${Таблица}.СчетДт
		|	КОНЕЦ КАК СчетДт,
		|	ВЫБОР
		|		КОГДА ${Таблица}.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
		|     		ТОГДА 
		|				ВЫБОР 
		|					КОГДА (${Таблица}.СуммаНачальныйОстатокДт - ${Таблица}.СуммаНачальныйОстатокКт < 0
		|						ИЛИ ${Таблица}.СуммаКонечныйОстатокДт - ${Таблица}.СуммаКонечныйОстатокКт < 0)
		|				ТОГДА ${Таблица}.СчетКт
		|                 ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
		|				КОНЕЦ
		|		ИНАЧЕ ${Таблица}.СчетКт
		|	КОНЕЦ КАК СчетКт,
		|	МАКСИМУМ(${Таблица}.Субконто1) КАК Субконто1,
		|	МАКСИМУМ(${Таблица}.Субконто2) КАК Субконто2,
		|	МАКСИМУМ(${Таблица}.Субконто3) КАК Субконто3,
		|	${Таблица}.Организация,
		|	${Таблица}.Показатель,
		|	${Таблица}.РазделительQQ,
		|	МАКСИМУМ(${Таблица}.КПС) КАК КПС,
		|	${Таблица}.КЭК КАК КЭК,
		|	${Таблица}.ИФО КАК ИФО,
		|	МАКСИМУМ(${Таблица}.Валюта) КАК Валюта,
		|	${Таблица}.Подразделение,
		|	${Таблица}.КФО,
		|	${Таблица}.Регистратор,
		|	${Таблица}.ВидПервичногоДокумента,
		|	${Таблица}.ДатаПервичногоДокумента,
		|	${Таблица}.НомерПервичногоДокумента,
		|	СУММА(ВЫБОР
		|			КОГДА ${Таблица}.СуммаНачальныйОстатокКт > 0
		|				ТОГДА ВЫБОР
		|						КОГДА ${Таблица}.СуммаНачальныйОстатокДт - ${Таблица}.СуммаНачальныйОстатокКт > 0
		|							ТОГДА ${Таблица}.СуммаНачальныйОстатокДт - ${Таблица}.СуммаНачальныйОстатокКт
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ ${Таблица}.СуммаНачальныйОстатокДт
		|		КОНЕЦ) КАК СуммаНачальныйОстатокДт,
		|	СУММА(ВЫБОР
		|			КОГДА ${Таблица}.СуммаНачальныйОстатокДт > 0
		|				ТОГДА ВЫБОР
		|						КОГДА ${Таблица}.СуммаНачальныйОстатокКт - ${Таблица}.СуммаНачальныйОстатокДт > 0
		|							ТОГДА ${Таблица}.СуммаНачальныйОстатокКт - ${Таблица}.СуммаНачальныйОстатокДт
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ ${Таблица}.СуммаНачальныйОстатокКт
		|		КОНЕЦ) КАК СуммаНачальныйОстатокКт,
		|	СУММА(${Таблица}.Сумма) КАК Сумма,
		|	СУММА(ВЫБОР
		|			КОГДА ${Таблица}.СуммаКонечныйОстатокКт > 0
		|				ТОГДА ВЫБОР
		|						КОГДА ${Таблица}.СуммаКонечныйОстатокДт - ${Таблица}.СуммаКонечныйОстатокКт > 0
		|							ТОГДА ${Таблица}.СуммаКонечныйОстатокДт - ${Таблица}.СуммаКонечныйОстатокКт
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ ${Таблица}.СуммаКонечныйОстатокДт
		|		КОНЕЦ) КАК СуммаКонечныйОстатокДт,
		|	СУММА(ВЫБОР
		|			КОГДА ${Таблица}.СуммаКонечныйОстатокДт > 0
		|				ТОГДА ВЫБОР
		|						КОГДА ${Таблица}.СуммаКонечныйОстатокКт - ${Таблица}.СуммаКонечныйОстатокДт > 0
		|							ТОГДА ${Таблица}.СуммаКонечныйОстатокКт - ${Таблица}.СуммаКонечныйОстатокДт
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ ${Таблица}.СуммаКонечныйОстатокКт
		|		КОНЕЦ) КАК СуммаКонечныйОстатокКт,
		|	МАКСИМУМ(${Таблица}.ДвиженияИлиГраницаПериода) КАК ДвиженияИлиГраницаПериода,
		|	${Таблица}.Период,
		|	${Таблица}.КПСДт,
		|	${Таблица}.КПСКт,
		|	МАКСИМУМ(${Таблица}.КЭКДт) КАК КЭКДт,
		|	МАКСИМУМ(${Таблица}.КЭККт) КАК КЭККт,
		|	МАКСИМУМ(${Таблица}.ПодразделениеДт) КАК ПодразделениеДт,
		|	МАКСИМУМ(${Таблица}.ПодразделениеКт) КАК ПодразделениеКт,
		|	МАКСИМУМ(${Таблица}.Содержание) КАК Содержание,
		|	МАКСИМУМ(${Таблица}.ХарактеристикаДвиженияДт) КАК ХарактеристикаДвиженияДт,
		|	МАКСИМУМ(${Таблица}.ХарактеристикаДвиженияКт) КАК ХарактеристикаДвиженияКт,
		|	СУММА(${Таблица}.ВалютнаяСуммаДт) КАК ВалютнаяСуммаДт,
		|	СУММА(${Таблица}.ВалютнаяСуммаКт) КАК ВалютнаяСуммаКт,
		|	МАКСИМУМ(${Таблица}.ОборотДляГлавнойКниги) КАК ОборотДляГлавнойКниги
		|ПОМЕСТИТЬ Сгруппированные${Таблица}
		|ИЗ
		|	ДляГруппировкиКЭК${Таблица} КАК ${Таблица}
		|
		|СГРУППИРОВАТЬ ПО
		|	${Таблица}.Организация,
		|	${Таблица}.Подразделение,
		|	${Таблица}.Регистратор,
		|	${Таблица}.ВидПервичногоДокумента,
		|	${Таблица}.ДатаПервичногоДокумента,
		|	${Таблица}.НомерПервичногоДокумента,
		|	${Таблица}.Показатель,
		|	${Таблица}.РазделительQQ,
		|	${Таблица}.КПСДт,
		|	${Таблица}.КПСКт,
		|	${Таблица}.КФО,
		|	${Таблица}.ИФО,
		|	ВЫБОР
		|		КОГДА ${Таблица}.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
		|     	ТОГДА 
		|				ВЫБОР 
		|					КОГДА (${Таблица}.СуммаНачальныйОстатокДт - ${Таблица}.СуммаНачальныйОстатокКт > 0
		|						ИЛИ ${Таблица}.СуммаКонечныйОстатокДт - ${Таблица}.СуммаКонечныйОстатокКт > 0)
		|						ТОГДА ${Таблица}.СчетДт
		|                 ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
		|				КОНЕЦ
		|		ИНАЧЕ ${Таблица}.СчетДт
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ${Таблица}.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
		|     	ТОГДА 
		|				ВЫБОР 
		|					КОГДА (${Таблица}.СуммаНачальныйОстатокДт - ${Таблица}.СуммаНачальныйОстатокКт < 0
		|						ИЛИ ${Таблица}.СуммаКонечныйОстатокДт - ${Таблица}.СуммаКонечныйОстатокКт < 0)
		|				ТОГДА ${Таблица}.СчетКт
		|                 ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
		|				КОНЕЦ
		|		ИНАЧЕ ${Таблица}.СчетКт
		|	КОНЕЦ,
		|	${Таблица}.Период,
		|	${Таблица}.КЭК
		|;
		|";
	ТекстРеквизитЗамена = СтрЗаменить(ТекстРеквизитЗамена, "${Таблица}", ИмяТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
	
		// Меняем имя таблицы
	ТекстРеквизит = НачальнаяМеткаТаблицы +
		СтандартныеОтчеты.ПолучитьТекстПоМаркерамСБелымиСимволами(
			ТекстЗапроса, НачальнаяМеткаТаблицы, КонечнаяМеткаТаблицы);
	ТекстРеквизитЗамена = НачальнаяМеткаТаблицы +
		"
		|	";
	ТекстРеквизитЗамена = ТекстРеквизитЗамена + "Сгруппированные";
	ТекстРеквизитЗамена = ТекстРеквизитЗамена + "${Таблица} КАК ${Таблица}";
	ТекстРеквизитЗамена = СтрЗаменить(ТекстРеквизитЗамена, "${Таблица}", ИмяТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстРеквизит, ТекстРеквизитЗамена);
	
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

ПоляБезГруппировкиИтогов = Новый Массив; 
ПоляБезГруппировкиИтогов.Добавить("Регистратор");
ПоляБезГруппировкиИтогов.Добавить("ПоДекадам");
ПоляБезГруппировкиИтогов.Добавить("ПоДням");

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли