#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПутевойЛист412АПК";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма412АПК_390";
	КомандаПечати.Представление		= НСтр("ru = 'Путевой лист трактора (ф. 412-АПК) (пр. № 390 от 28.09.2022)'");
	КомандаПечати.Порядок			= 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПутевойЛист412АПК";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма412АПК_368";
	КомандаПечати.Представление		= НСтр("ru = 'Путевой лист трактора (ф. 412-АПК) (пр. № 368 от 11.09.2020)'");
	КомандаПечати.Порядок			= 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПутевойЛист412АПК";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма412АПК";
	КомандаПечати.Представление		= НСтр("ru = 'Путевой лист трактора (ф. 412-АПК)'");
	КомандаПечати.Порядок			= 3;

КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма412АПК_390") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма412АПК_390", "Путевой лист трактора (ф. 412-АПК) (пр. № 390 от 28.09.2022)", ПечатьПутевогоЛиста390ПриказМинтранса(МассивОбъектов, ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма412АПК_368") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма412АПК_368", "Путевой лист трактора (ф. 412-АПК) (пр. № 368 от 11.09.2020)", ПечатьПутевогоЛиста368ПриказМинтранса(МассивОбъектов, ОбъектыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма412АПК") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма412АПК", "Путевой лист трактора (ф. 412-АПК)", ПечатьПутевогоЛиста(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Функция формирует печатные формы документов
//
// Параметры
//  МассивОбъктов  - Массив - Массив ссылок на объекты которые нужно распечатать
//  ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//
// Возвращаемое значение:
//   ТабличныйДокумент   - Результирующая таблица, содржащая печатный формы документов
//
Функция ПечатьПутевогоЛиста390ПриказМинтранса(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ПутевойЛист412АПК";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист412АПК.ПФ_MXL_Форма412АПК_390");
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ПутевойЛист412АПК.Ссылка КАК Ссылка,
	|	ПутевойЛист412АПК.Номер КАК НомерПутевогоЛиста,
	|	ПутевойЛист412АПК.Дата КАК ДатаПутевогоЛиста,
	|	ПутевойЛист412АПК.СерияПутевогоЛиста КАК СерияПутевогоЛиста,
	|	ПутевойЛист412АПК.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Организация КАК Справочник.Организации).ОГРН КАК ОГРН,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Организация КАК Справочник.Организации).НаименованиеСокращенное КАК СокращенноеНаименованиеОрганизации,
	|	ПутевойЛист412АПК.СрокДействия КАК СрокДействия,
	|	ПутевойЛист412АПК.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ПутевойЛист412АПК.Водитель КАК Тракторист,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Организация КАК Справочник.Организации).КодОКПО КАК КодОКПО,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Организация КАК Справочник.Организации).НаименованиеПолное КАК НаименованиеОрганизации,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Водитель КАК Справочник.Сотрудники).Код КАК ТабельныйНомер,
	|	ПутевойЛист412АПК.ВремяВыездаТС КАК ВремяВыездаТС,
	|	ПутевойЛист412АПК.ВремяВозвращенияТС КАК ВремяВозвращенияТС,
	|	ПутевойЛист412АПК.ВыпускающийТСДиспетчер КАК ВыпускающийТСДиспетчер,
	|	ПутевойЛист412АПК.ЛицоДопускающееВодителяПоСостояниюЗдоровья КАК ЛицоДопускающееВодителяПоСостояниюЗдоровья,
	|	ПутевойЛист412АПК.ОтметкиОрганизации КАК ОтметкиОрганизации,
	|	ПутевойЛист412АПК.ВодительПринялТС КАК ВодительПринялТС,
	|	ПутевойЛист412АПК.ВодительСдалТС КАК ВодительСдалТС,
	|	ПутевойЛист412АПК.ПоказанияСпидометраПриВыезде КАК ПоказанияСпидометраПриВыезде,
	|	ПутевойЛист412АПК.ВыездРазрешилМеханик КАК ВыездРазрешилМеханик,
	|	ПутевойЛист412АПК.ПоказанияСпидометраПриВозвращении КАК ПоказанияСпидометраПриВозвращении,
	|	ПутевойЛист412АПК.ПринялТСМеханик КАК ПринялТСМеханик,
	|	ПутевойЛист412АПК.НулевойПробегПриВыезде КАК НулевойПробегПриВыезде,
	|	ПутевойЛист412АПК.НулевойПробегПриВозвращении КАК НулевойПробегПриВозвращении,
	|	ПутевойЛист412АПК.ВремяВыездаТСФактическое КАК ВремяВыездаТСФактическое,
	|	ПутевойЛист412АПК.ВремяВозвращенияТСФактическое КАК ВремяВозвращенияТСФактическое,
	|	ПутевойЛист412АПК.ПриВозвращенииТСНеисправно КАК ПриВозвращенииТСНеисправно,
	|	ПутевойЛист412АПК.РегистрационныйНомернойЗнак КАК ГосударственныйНомернойЗнак,
	|	ПутевойЛист412АПК.ГаражныйНомер КАК ГаражныйНомер,
	|	ПутевойЛист412АПК.Бригада КАК Бригада,
	|	ПутевойЛист412АПК.СведенияОПеревозке КАК СведенияОПеревозке,
	|	ПутевойЛист412АПК.ВидПеревозки КАК ВидПеревозки,
	|	ПутевойЛист412АПК.ВидСообщения КАК ВидСообщения,
	|	ПутевойЛист412АПК.СведенияОВидахСообщения КАК СведенияОВидахСообщения,
	|	ПутевойЛист412АПК.ЗаполнятьОтметкуОПредрейсовомМедосмотре КАК ЗаполнятьОтметкуОПредрейсовомМедосмотре,
	|	ВЫБОР
	|		КОГДА ПутевойЛист412АПК.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр
	|			ТОГДА ПутевойЛист412АПК.СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья
	|		ИНАЧЕ ПутевойЛист412АПК.ЛицоДопускающееВодителяПоСостояниюЗдоровья
	|	КОНЕЦ КАК ПроведшийПредрейсовыйМедосмотр,
	|	ВЫБОР
	|		КОГДА ПутевойЛист412АПК.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр
	|			ТОГДА ПутевойЛист412АПК.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр
	|		ИНАЧЕ ПутевойЛист412АПК.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр
	|	КОНЕЦ КАК ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр,
	|	ПутевойЛист412АПК.ЗаполнятьОтметкуОПослерейсовомМедосмотре КАК ЗаполнятьОтметкуОПослерейсовомМедосмотре,
	|	ВЫБОР
	|		КОГДА ПутевойЛист412АПК.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр
	|			ТОГДА ПутевойЛист412АПК.СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья
	|		ИНАЧЕ ПутевойЛист412АПК.ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья
	|	КОНЕЦ КАК ПроведшийПослерейсовыйМедосмотр,
	|	ВЫБОР
	|		КОГДА ПутевойЛист412АПК.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр
	|			ТОГДА ПутевойЛист412АПК.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр
	|		ИНАЧЕ ПутевойЛист412АПК.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр
	|	КОНЕЦ КАК ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр,
	|	ПутевойЛист412АПК.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр КАК СторонняяОрганизацияПроводитПредрейсовыйМедосмотр,
	|	ПутевойЛист412АПК.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр КАК СторонняяОрганизацияПроводитПослерейсовыйМедосмотр,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ПутевойЛист412АПК.ОрганизацияПроводящаяПредрейсовыйМедосмотр КАК Справочник.Контрагенты).НаименованиеСокращенное = """"
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ВЫРАЗИТЬ(ПутевойЛист412АПК.ОрганизацияПроводящаяПредрейсовыйМедосмотр КАК Справочник.Контрагенты).ЮридическоеФизическоеЛицо)
	|		ИНАЧЕ ВЫРАЗИТЬ(ПутевойЛист412АПК.ОрганизацияПроводящаяПредрейсовыйМедосмотр КАК Справочник.Контрагенты).НаименованиеСокращенное
	|	КОНЕЦ КАК ОрганизацияПроводящаяПредрейсовыйМедосмотр,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ПутевойЛист412АПК.ОрганизацияПроводящаяПослерейсовыйМедосмотр КАК Справочник.Контрагенты).НаименованиеСокращенное = """"
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ВЫРАЗИТЬ(ПутевойЛист412АПК.ОрганизацияПроводящаяПослерейсовыйМедосмотр КАК Справочник.Контрагенты).ЮридическоеФизическоеЛицо)
	|		ИНАЧЕ ВЫРАЗИТЬ(ПутевойЛист412АПК.ОрганизацияПроводящаяПослерейсовыйМедосмотр КАК Справочник.Контрагенты).НаименованиеСокращенное
	|	КОНЕЦ КАК ОрганизацияПроводящаяПослерейсовыйМедосмотр,
	|	ПутевойЛист412АПК.Прицепы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Прицеп КАК Прицеп,
	|		РегистрационныйНомернойЗнак КАК РегистрационныйНомернойЗнак,
	|		ГаражныйНомер КАК ГаражныйНомер
	|	) КАК Прицепы,
	|	ПутевойЛист412АПК.ЗаданиеВодителю.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		НаименованиеЗаказчика КАК НаименованиеЗаказчика,
	|		АдресПунктаПогрузки КАК АдресПунктаПогрузки,
	|		АдресПунктаРазгрузки КАК АдресПунктаРазгрузки,
	|		НаименованиеГруза КАК НаименованиеГруза,
	|		КоличествоЕздок КАК КоличествоЕздок,
	|		КоличествоМест КАК КоличествоМест,
	|		КлассГруза КАК КлассГруза,
	|		Расстояние КАК Расстояние,
	|		ПеревезтиТонн КАК ПеревезтиТонн
	|	) КАК ЗаданиеВодителю,
	|	ПутевойЛист412АПК.ДвижениеГорючего.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		МаркаГорючего КАК МаркаГорючего,
	|		КодМаркиГорючего КАК КодМаркиГорючего,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ВыданоГорючее КАК ВыданоГорючее,
	|		ОстатокГорючегоПриВыезде КАК ОстатокГорючегоПриВыезде,
	|		ОстатокГорючегоПриВозвращении КАК ОстатокГорючегоПриВозвращении
	|	) КАК ДвижениеГорючего,
	|	ПутевойЛист412АПК.МаршрутДвижения.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ПунктПогрузкиРазгрузкиПерецепки КАК ПунктПогрузкиРазгрузкиПерецепки,
	|		НомераТТД КАК НомераТТД,
	|		КоличествоТТД КАК КоличествоТТД,
	|		НомераПрицеповПрибывших КАК НомераПрицеповПрибывших,
	|		НомераПрицеповУбывших КАК НомераПрицеповУбывших,
	|		ПорожнийПробегПрицепа КАК ПорожнийПробегПрицепа,
	|		НаименованиеГрузоотправителя КАК НаименованиеГрузоотправителя,
	|		АдресОткуда КАК АдресОткуда,
	|		АдресКуда КАК АдресКуда,
	|		НаименованиеГруза КАК НаименованиеГруза,
	|		КлассГруза КАК КлассГруза,
	|		ДатаВремяУбытия КАК ДатаВремяУбытия,
	|		ДатаВремяПрибытия КАК ДатаВремяПрибытия,
	|		БригадаЗаказчик КАК БригадаЗаказчик,
	|		ШифрУчета КАК ШифрУчета,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ОтработаноЧасов КАК ОтработаноЧасов,
	|		ПеревезеноТонн КАК ПеревезеноТонн,
	|		РаботаПоПеревозкеГруза КАК РаботаПоПеревозкеГруза,
	|		НормаВыработки КАК НормаВыработки,
	|		Расценка КАК Расценка,
	|		ОплатаТрудаОсновная КАК ОплатаТрудаОсновная,
	|		ОплатаТрудаДополнительная КАК ОплатаТрудаДополнительная,
	|		ОплатаТрудаСдельная КАК ОплатаТрудаСдельная,
	|		ОплатаТрудаВсего КАК ОплатаТрудаВсего,
	|		ВыполненоНормоСмен КАК ВыполненоНормоСмен,
	|		УсловныеГектары КАК УсловныеГектары,
	|		Пробег КАК Пробег,
	|		ПробегБезГруза КАК ПробегБезГруза,
	|		РасходПоНормеНаЕдиницуРаботы КАК РасходПоНормеНаЕдиницуРаботы,
	|		РасходПоНорме КАК РасходПоНорме,
	|		РасходФактически КАК РасходФактически
	|	) КАК МаршрутДвижения,
	|	ПутевойЛист412АПК.Участок КАК Участок,
	|	ПутевойЛист412АПК.Бригадир КАК Бригадир,
	|	ПутевойЛист412АПК.Прицепщик КАК Прицепщик,
	|	ПутевойЛист412АПК.ВремяНачалаРаботы КАК ВремяНачалаРаботы,
	|	ПутевойЛист412АПК.ВремяКонцаРаботы КАК ВремяКонцаРаботы,
	|	ПутевойЛист412АПК.БригадирПодтвердилНачалоРаботы КАК БригадирПодтвердилНачалоРаботы,
	|	ПутевойЛист412АПК.БригадирПодтвердилКонецРаботы КАК БригадирПодтвердилКонецРаботы,
	|	ПутевойЛист412АПК.ИтогиОтработаноЧасов КАК ИтогиОтработаноЧасов,
	|	ПутевойЛист412АПК.ИтогиОтработаноДней КАК ИтогиОтработаноДней,
	|	ПутевойЛист412АПК.ИтогиОтработаноМашиноДней КАК ИтогиОтработаноМашиноДней,
	|	ПутевойЛист412АПК.ИтогиОтработаноМашиноСмен КАК ИтогиОтработаноМашиноСмен,
	|	МЕСЯЦ(ПутевойЛист412АПК.Дата) КАК МесяцДаты,
	|	ГОД(ПутевойЛист412АПК.Дата) КАК ГодДаты
	|ИЗ
	|	Документ.ПутевойЛист412АПК КАК ПутевойЛист412АПК
	|ГДЕ
	|	ПутевойЛист412АПК.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПутевогоЛиста,
	|	НомерПутевогоЛиста,
	|	СерияПутевогоЛиста";	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДокументов = Результат.Выбрать();

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПФ_MXL_Форма412АПК";
	ТабличныйДокумент.Автомасштаб = Истина;
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураДанных = Новый Структура;
		Для Каждого Колонка ИЗ Результат.Колонки Цикл
			СтруктураДанных.Вставить(Колонка.Имя, ВыборкаДокументов[Колонка.Имя]);	
		КонецЦикла;
		
		//---изменение представления данных в печатной форме----------------
		НаименованиеПутевогоЛиста = "ПУТЕВОЙ ЛИСТ ТРАКТОРА "+?(СтруктураДанных.СерияПутевогоЛиста = "","", СокрЛП(СтруктураДанных.СерияПутевогоЛиста)+" ")+"№ ";
		СтруктураДанных.Вставить("НаименованиеПутевогоЛиста", НаименованиеПутевогоЛиста);	
		
		АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
															
															
		СтруктураДанных.Вставить("НаименованиеОрганизации", СтруктураДанных.НаименованиеОрганизации);
		СтруктураДанных.Вставить("СокращенноеНаименованиеОрганизации", СтруктураДанных.СокращенноеНаименованиеОрганизации);
		СтруктураДанных.Вставить("ОГРН", СтруктураДанных.ОГРН);
		СтруктураДанных.Вставить("АдресОрганизации", АдресОрганизации);
		СтруктураДанных.Вставить("ТелефонОрганизации", ТелефонОрганизации);
	
		СтруктураДанных.Вставить("СрокДействияПутевогоЛиста", 	УчетГСМ.СрокДействияПутевогоЛиста(СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия));
		
		ТипТС = УчетГСМ.ПолучитьТипТС(СтруктураДанных.ТранспортноеСредство);
		Если ЗначениеЗаполнено(ТипТС) Тогда
			СтруктураДанных.Вставить("РеквизитыТС", "Тип, марка, модель машины");
			СтруктураДанных.Вставить("МаркаТрактора", 	УчетГСМ.ПолучитьТипМаркуИМодельТС(СтруктураДанных.ТранспортноеСредство));
		Иначе	
			СтруктураДанных.Вставить("РеквизитыТС", "Марка, модель машины");
			СтруктураДанных.Вставить("МаркаТрактора", 	УчетГСМ.ПолучитьМаркуИМодельТС(СтруктураДанных.ТранспортноеСредство));
		КонецЕсли;
		
		
		СтруктураДанных.Вставить("ИнвентарныйНомер", 	УчетГСМ.ИнвентарныйНомерОбъекта(СтруктураДанных.ТранспортноеСредство));
		СтруктураДанных.Вставить("ВидПеревозки", СтруктураДанных.ВидПеревозки);
		Если ЗначениеЗаполнено(СтруктураДанных.СведенияОВидахСообщения) Тогда
			СтруктураДанных.Вставить("ВидСообщения", СтруктураДанных.СведенияОВидахСообщения);
		Иначе	
			СтруктураДанных.Вставить("ВидСообщения", СтруктураДанных.ВидСообщения);
		КонецЕсли;
		
		РезультатПредрейсовогоМедосмотра = "";
		Если ВыборкаДокументов.ЗаполнятьОтметкуОПредрейсовомМедосмотре Тогда
			РезультатПредрейсовогоМедосмотра = НСтр("ru = 'прошел предрейсовый медицинский осмотр, к исполнению трудовых обязанностей допущен'");
		КонецЕсли;
		СтруктураДанных.Вставить("РезультатПредрейсовогоМедосмотра", РезультатПредрейсовогоМедосмотра);
		 
		ПредрейсовыйРазделитель = ?(ЗначениеЗаполнено(СтруктураДанных.ПроведшийПредрейсовыйМедосмотр),",", "");
		Если ВыборкаДокументов.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр Тогда
			
			РеквизитыПредрейовыхМедРаботников = Новый Структура("Фамилия, Имя, Отчество, Должность");
			ЗначениеПредрейсовыхРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанных.ПроведшийПредрейсовыйМедосмотр,РеквизитыПредрейовыхМедРаботников);
			
			ДанныеСтороннегоСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество",
													СтруктураДанных.ПроведшийПредрейсовыйМедосмотр,
													СтруктураДанных.ДатаПутевогоЛиста,
													ЗначениеПредрейсовыхРеквизитов.Фамилия,
													ЗначениеПредрейсовыхРеквизитов.Имя,
													ЗначениеПредрейсовыхРеквизитов.Отчество);
			СтруктураДанных.Вставить("ФИОПредрейсовогоМедработника", КорреспондентыКлиентСервер.ФИО(ДанныеСтороннегоСотрудника, Истина));
			
			Если ЗначениеЗаполнено(ЗначениеПредрейсовыхРеквизитов.Должность) Тогда 
				СтруктураДанных.Вставить("ДолжностьПредрейсовогоМедработника", ТРег(ЗначениеПредрейсовыхРеквизитов.Должность) + ПредрейсовыйРазделитель);
			КонецЕсли;
			
		Иначе 
			
			ДанныеПредрейсовогоСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
															СтруктураДанных.ПроведшийПредрейсовыйМедосмотр, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеПредрейсовогоСотрудника, Истина);
			СтруктураДанных.Вставить("ФИОПредрейсовогоМедработника", КорреспондентыКлиентСервер.ФИО(ДанныеПредрейсовогоСотрудника, Истина));
			
			Если ЗначениеЗаполнено(ДанныеПредрейсовогоСотрудника.Должность) Тогда
				СтруктураДанных.Вставить("ДолжностьПредрейсовогоМедработника", ТРег(ДанныеПредрейсовогоСотрудника.Должность) + ПредрейсовыйРазделитель);  
			КонецЕсли;
			
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(СтруктураДанных.СокращенноеНаименованиеОрганизации) Тогда				
			НаименованиеОрганизацииДокумента = СтруктураДанных.СокращенноеНаименованиеОрганизации;			
		Иначе
			НаименованиеОрганизацииДокумента = СтруктураДанных.НаименованиеОрганизации;
		КонецЕсли;
		
		ПредрейсоваяОрганизация = "";
		Если ЗначениеЗаполнено(СтруктураДанных.ОрганизацияПроводящаяПредрейсовыйМедосмотр) Тогда
			ПредрейсоваяОрганизация = СтруктураДанных.ОрганизацияПроводящаяПредрейсовыйМедосмотр;
		ИначеЕсли ЗначениеЗаполнено(СтруктураДанных.ПроведшийПредрейсовыйМедосмотр) 
								ИЛИ ЗначениеЗаполнено(СтруктураДанных.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр) Тогда
			ПредрейсоваяОрганизация = НаименованиеОрганизацииДокумента;					
		КонецЕсли;
		СтруктураДанных.Вставить("НаименованиеПредрейсовойМедорганизации", ПредрейсоваяОрганизация);
		
		СтруктураДанных.Вставить("ДанныеМедЛицензииПредрейсовогоМедосмотра", УчетГСМ.ПолучитьПредставлениеЛицензииНаПроведениеМедосмотров(СтруктураДанных.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр)); 
		
		РезультатПослерейсовогоМедосмотра = "";
		Если ВыборкаДокументов.ЗаполнятьОтметкуОПослерейсовомМедосмотре Тогда
			РезультатПослерейсовогоМедосмотра = НСтр("ru = 'прошел послерейсовый медицинский осмотр'");
		КонецЕсли;
		СтруктураДанных.Вставить("РезультатПослерейсовогоМедосмотра", РезультатПослерейсовогоМедосмотра);
		
		ПослерейсовыйРазделитель = ?(ЗначениеЗаполнено(СтруктураДанных.ПроведшийПослерейсовыйМедосмотр),",", "");
		Если ВыборкаДокументов.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр Тогда
			
			РеквизитыПослерейсовыхМедРаботников = Новый Структура("Фамилия, Имя, Отчество, Должность");
			ЗначениеПослерейсовыхРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанных.ПроведшийПослерейсовыйМедосмотр,РеквизитыПослерейсовыхМедРаботников);

			ДанныеСтороннегоСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество",
													СтруктураДанных.ПроведшийПослерейсовыйМедосмотр,
													СтруктураДанных.ДатаПутевогоЛиста,
													ЗначениеПослерейсовыхРеквизитов.Фамилия,
													ЗначениеПослерейсовыхРеквизитов.Имя,
													ЗначениеПослерейсовыхРеквизитов.Отчество);
			СтруктураДанных.Вставить("ФИОПослерейсовогоМедработника", КорреспондентыКлиентСервер.ФИО(ДанныеСтороннегоСотрудника, Истина));
			
			Если ЗначениеЗаполнено(ЗначениеПослерейсовыхРеквизитов.Должность) Тогда
				СтруктураДанных.Вставить("ДолжностьПослерейсовогоМедработника", ТРег(ЗначениеПослерейсовыхРеквизитов.Должность) + ПослерейсовыйРазделитель);
			КонецЕсли;
			
		Иначе

			ДанныеПослерейсовогоСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
															СтруктураДанных.ПроведшийПослерейсовыйМедосмотр, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеПослерейсовогоСотрудника, Истина);
			СтруктураДанных.Вставить("ФИОПослерейсовогоМедработника", КорреспондентыКлиентСервер.ФИО(ДанныеПослерейсовогоСотрудника, Истина));
			
			Если ЗначениеЗаполнено(ДанныеПослерейсовогоСотрудника.Должность) Тогда
				СтруктураДанных.Вставить("ДолжностьПослерейсовогоМедработника", ТРег(ДанныеПослерейсовогоСотрудника.Должность) + ПослерейсовыйРазделитель);
			КонецЕсли;
			
		КонецЕсли;
		
		ПослерейсоваяОрганизация = "";
		Если ЗначениеЗаполнено(СтруктураДанных.ОрганизацияПроводящаяПослерейсовыйМедосмотр) Тогда
			ПослерейсоваяОрганизация = СтруктураДанных.ОрганизацияПроводящаяПослерейсовыйМедосмотр;
		ИначеЕсли ЗначениеЗаполнено(СтруктураДанных.ПроведшийПослерейсовыйМедосмотр)
						ИЛИ ЗначениеЗаполнено(СтруктураДанных.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр) Тогда
			ПослерейсоваяОрганизация = НаименованиеОрганизацииДокумента;	
		КонецЕсли;
		СтруктураДанных.Вставить("НаименованиеПослерейсовойМедорганизации", ПослерейсоваяОрганизация);
		
		СтруктураДанных.Вставить("ДанныеМедЛицензииПослерейсовогоМедосмотра", УчетГСМ.ПолучитьПредставлениеЛицензииНаПроведениеМедосмотров(СтруктураДанных.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр));		
		
		СтруктураДанных.Вставить("ЧислоВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВыездаФактическое", Формат(ВыборкаДокументов.ВремяВыездаТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		СтруктураДанных.Вставить("ЧислоВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВозвращенияФактическое", Формат(ВыборкаДокументов.ВремяВозвращенияТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		Если ЗначениеЗаполнено(СтруктураДанных.Тракторист) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Тракторист, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("ТрактористФИО", ДанныеСотрудника.Фамилия + " "+ДанныеСотрудника.Имя+" "+ДанныеСотрудника.Отчество);
		КонецЕсли;
		
		ДанныеВодителя = УчетГСМ.ПолучитьДанныеВодителя(СтруктураДанных.Тракторист, СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия);
		
		Если ЗначениеЗаполнено(СтруктураДанных.Прицепщик) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Прицепщик, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("ПрицепщикФИО", ДанныеСотрудника.Фамилия + " "+ДанныеСотрудника.Имя+" "+ДанныеСотрудника.Отчество);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтруктураДанных.Бригадир) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Бригадир, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("БригадирФИО", ДанныеСотрудника.Фамилия + " "+ДанныеСотрудника.Имя+" "+ДанныеСотрудника.Отчество);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанных.ВыездРазрешилМеханик) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.ВыездРазрешилМеханик, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("МеханикВыпустилТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Ложь));
		КонецЕсли;
		                   
		//Прицепы
		ВыборкаПрицепы = ВыборкаДокументов.Прицепы.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаПрицепы.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Прицепа", УчетГСМ.ПолучитьМаркуИМодельТС(ВыборкаПрицепы.Прицеп));
			СтруктураДанных.Вставить("ГосНомер"+НомерСтроки+"Прицепа", УчетГСМ.ПолучитьГосударственныйНомернойЗнакТС(ВыборкаПрицепы.Прицеп));
			СтруктураДанных.Вставить("ИнвентарныйНомер"+НомерСтроки+"Прицепа", УчетГСМ.ИнвентарныйНомерОбъекта(ВыборкаПрицепы.Прицеп));
		КонецЦикла;
		
		//Движение горючего
		ВыборкаГорючее = ВыборкаДокументов.ДвижениеГорючего.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаГорючее.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Горючего", ВыборкаГорючее.МаркаГорючего);
			СтруктураДанных.Вставить("КодМарки"+НомерСтроки+"Горючего", ВыборкаГорючее.КодМаркиГорючего);
			СтруктураДанных.Вставить("ЕдИзм"+НомерСтроки+"Горючего", ?(ЗначениеЗаполнено(ВыборкаГорючее.ЕдиницаИзмерения), ВыборкаГорючее.ЕдиницаИзмерения, "кг"));
			СтруктураДанных.Вставить("Выдано"+НомерСтроки+"Горючего", ВыборкаГорючее.ВыданоГорючее);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВыезде", ВыборкаГорючее.ОстатокГорючегоПриВыезде);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВозвращении", ВыборкаГорючее.ОстатокГорючегоПриВозвращении);
		КонецЦикла;
		
		//вывод областей табличного документа
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Заполнить(СтруктураДанных);
		Область.Параметры.Заполнить(ДанныеВодителя);
		
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(Область, "НомерПутевогоЛиста", СтруктураДанных.НомерПутевогоЛиста, СтруктураДанных.Ссылка, Неопределено, Истина);
		
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ЗаданиеТрактористуОсновное");
		
		ВыборкаЗадания = ВыборкаДокументов.ЗаданиеВодителю.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаЗадания.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			
			Если НомерСтроки < 5 Тогда
				СтруктураДанных.Вставить("Заказчик"+НомерСтроки+"Наименование", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика));
				СтруктураДанных.Вставить("Пункт"+НомерСтроки+"Откуда", ВыборкаЗадания.АдресПунктаПогрузки);
				СтруктураДанных.Вставить("Пункт"+НомерСтроки+"Куда", ВыборкаЗадания.АдресПунктаРазгрузки);
				СтруктураДанных.Вставить("Расстояние"+НомерСтроки+"Км", ВыборкаЗадания.Расстояние);
				СтруктураДанных.Вставить("Груз"+НомерСтроки+"Наименование", ВыборкаЗадания.НаименованиеГруза);
				СтруктураДанных.Вставить("Класс"+НомерСтроки+"Груз", СокрЛП(ВыборкаЗадания.КлассГруза));
				СтруктураДанных.Вставить("Ездки"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоЕздок);
				СтруктураДанных.Вставить("Мест"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоМест);
				СтруктураДанных.Вставить("Вес"+НомерСтроки+"Тонн", ВыборкаЗадания.ПеревезтиТонн);
			Иначе
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Если НомерСтроки > 4 Тогда
			ВыборкаЗадания = ВыборкаДокументов.ЗаданиеВодителю.Выбрать();
			
			Пока ВыборкаЗадания.Следующий() Цикл
				НомерСтроки = НомерСтроки + 1;
				Если НомерСтроки > 15 Тогда
					Прервать;
				КонецЕсли;
				
				Если НомерСтроки > 4 Тогда
					Область = Макет.ПолучитьОбласть("ЗаданиеТрактористуСтрока");
					СтруктураДанныхСтроки = Новый Структура;
					СтруктураДанныхСтроки.Вставить("ЗаказчикНаименование", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика));
					СтруктураДанныхСтроки.Вставить("ПунктОткуда", ВыборкаЗадания.АдресПунктаПогрузки);
					СтруктураДанныхСтроки.Вставить("ПунктКуда", ВыборкаЗадания.АдресПунктаРазгрузки);
					СтруктураДанныхСтроки.Вставить("РасстояниеКм", ВыборкаЗадания.Расстояние);
					СтруктураДанныхСтроки.Вставить("ГрузНаименование", ВыборкаЗадания.НаименованиеГруза);
					СтруктураДанныхСтроки.Вставить("КлассГруз", СокрЛП(ВыборкаЗадания.КлассГруза));
					СтруктураДанныхСтроки.Вставить("ЕздкиКоличество", ВыборкаЗадания.КоличествоЕздок);
					СтруктураДанныхСтроки.Вставить("МестКоличество", ВыборкаЗадания.КоличествоМест);
					СтруктураДанныхСтроки.Вставить("ВесТонн", ВыборкаЗадания.ПеревезтиТонн);
					
					Область.Параметры.Заполнить(СтруктураДанныхСтроки);
					ТабличныйДокумент.Вывести(Область);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
		
		Для н = 1 По 15 - НомерСтроки Цикл
			Область = Макет.ПолучитьОбласть("ЗаданиеТрактористуСтрока");
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;
		
		
		Область = Макет.ПолучитьОбласть("Отметки");
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
		
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Оборотная сторона
		
		Область = Макет.ПолучитьОбласть("ЗаголовокОборотнойСтороны");
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ШапкаВыполненияЗадания");
		ТабличныйДокумент.Вывести(Область);
		
		Для н = 1 По 21 Цикл
			Область = Макет.ПолучитьОбласть("СтрокаВыполненияЗадания");
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("ПодвалВыполненияЗадания");
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
КонецФункции	

// Функция формирует печатные формы документов
//
// Параметры
//  МассивОбъктов  - Массив - Массив ссылок на объекты которые нужно распечатать
//  ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//
// Возвращаемое значение:
//   ТабличныйДокумент   - Результирующая таблица, содржащая печатный формы документов
//
Функция ПечатьПутевогоЛиста368ПриказМинтранса(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ПутевойЛист412АПК";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист412АПК.ПФ_MXL_Форма412АПК_368");
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ПутевойЛист412АПК.Ссылка КАК Ссылка,
	|	ПутевойЛист412АПК.Номер КАК НомерПутевогоЛиста,
	|	ПутевойЛист412АПК.Дата КАК ДатаПутевогоЛиста,
	|	ПутевойЛист412АПК.СерияПутевогоЛиста КАК СерияПутевогоЛиста,
	|	ПутевойЛист412АПК.Организация,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Организация КАК Справочник.Организации).ОГРН КАК ОГРН,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Организация КАК Справочник.Организации).НаименованиеСокращенное КАК СокращенноеНаименованиеОрганизации,
	|	ПутевойЛист412АПК.СрокДействия,
	|	ПутевойЛист412АПК.ТранспортноеСредство,
	|	ПутевойЛист412АПК.Водитель КАК Тракторист,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Организация КАК Справочник.Организации).КодОКПО КАК КодОКПО,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Организация КАК Справочник.Организации).НаименованиеПолное КАК НаименованиеОрганизации,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Водитель КАК Справочник.Сотрудники).Код КАК ТабельныйНомер,
	|	ПутевойЛист412АПК.ВремяВыездаТС,
	|	ПутевойЛист412АПК.ВремяВозвращенияТС,
	|	ПутевойЛист412АПК.ВыпускающийТСДиспетчер,
	|	ПутевойЛист412АПК.ЛицоДопускающееВодителяПоСостояниюЗдоровья,
	|	ПутевойЛист412АПК.ОтметкиОрганизации,
	|	ПутевойЛист412АПК.ВодительПринялТС,
	|	ПутевойЛист412АПК.ВодительСдалТС,
	|	ПутевойЛист412АПК.ПоказанияСпидометраПриВыезде,
	|	ПутевойЛист412АПК.ВыездРазрешилМеханик,
	|	ПутевойЛист412АПК.ПоказанияСпидометраПриВозвращении,
	|	ПутевойЛист412АПК.ПринялТСМеханик,
	|	ПутевойЛист412АПК.НулевойПробегПриВыезде,
	|	ПутевойЛист412АПК.НулевойПробегПриВозвращении,
	|	ПутевойЛист412АПК.ВремяВыездаТСФактическое,
	|	ПутевойЛист412АПК.ВремяВозвращенияТСФактическое,
	|	ПутевойЛист412АПК.ПриВозвращенииТСНеисправно,
	|	ПутевойЛист412АПК.РегистрационныйНомернойЗнак КАК ГосударственныйНомернойЗнак,
	|	ПутевойЛист412АПК.ГаражныйНомер,
	|	ПутевойЛист412АПК.Бригада,
	|	ПутевойЛист412АПК.СведенияОПеревозке,
	|	ПутевойЛист412АПК.Прицепы.(
	|		Ссылка,
	|		НомерСтроки,
	|		Прицеп,
	|		РегистрационныйНомернойЗнак,
	|		ГаражныйНомер
	|	),
	|	ПутевойЛист412АПК.ЗаданиеВодителю.(
	|		Ссылка,
	|		НомерСтроки,
	|		НаименованиеЗаказчика,
	|		АдресПунктаПогрузки,
	|		АдресПунктаРазгрузки,
	|		НаименованиеГруза,
	|		КоличествоЕздок,
	|		КоличествоМест,
	|		КлассГруза,
	|		Расстояние,
	|		ПеревезтиТонн
	|	),
	|	ПутевойЛист412АПК.ДвижениеГорючего.(
	|		Ссылка,
	|		НомерСтроки,
	|		МаркаГорючего,
	|		КодМаркиГорючего,
	|		ЕдиницаИзмерения,
	|		ВыданоГорючее,
	|		ОстатокГорючегоПриВыезде,
	|		ОстатокГорючегоПриВозвращении
	|	),
	|	ПутевойЛист412АПК.МаршрутДвижения.(
	|		Ссылка,
	|		НомерСтроки,
	|		ПунктПогрузкиРазгрузкиПерецепки,
	|		НомераТТД,
	|		КоличествоТТД,
	|		НомераПрицеповПрибывших,
	|		НомераПрицеповУбывших,
	|		ПорожнийПробегПрицепа,
	|		НаименованиеГрузоотправителя,
	|		АдресОткуда,
	|		АдресКуда,
	|		НаименованиеГруза,
	|		КлассГруза,
	|		ДатаВремяУбытия,
	|		ДатаВремяПрибытия,
	|		БригадаЗаказчик,
	|		ШифрУчета,
	|		ЕдиницаИзмерения,
	|		ОтработаноЧасов,
	|		ПеревезеноТонн,
	|		РаботаПоПеревозкеГруза,
	|		НормаВыработки,
	|		Расценка,
	|		ОплатаТрудаОсновная,
	|		ОплатаТрудаДополнительная,
	|		ОплатаТрудаСдельная,
	|		ОплатаТрудаВсего,
	|		ВыполненоНормоСмен,
	|		УсловныеГектары,
	|		Пробег,
	|		ПробегБезГруза,
	|		РасходПоНормеНаЕдиницуРаботы,
	|		РасходПоНорме,
	|		РасходФактически
	|	),
	|	ПутевойЛист412АПК.Участок,
	|	ПутевойЛист412АПК.Бригадир,
	|	ПутевойЛист412АПК.Прицепщик,
	|	ПутевойЛист412АПК.ВремяНачалаРаботы,
	|	ПутевойЛист412АПК.ВремяКонцаРаботы,
	|	ПутевойЛист412АПК.БригадирПодтвердилНачалоРаботы,
	|	ПутевойЛист412АПК.БригадирПодтвердилКонецРаботы,
	|	ПутевойЛист412АПК.ИтогиОтработаноЧасов,
	|	ПутевойЛист412АПК.ИтогиОтработаноДней,
	|	ПутевойЛист412АПК.ИтогиОтработаноМашиноДней,
	|	ПутевойЛист412АПК.ИтогиОтработаноМашиноСмен,
	|	МЕСЯЦ(ПутевойЛист412АПК.Дата) КАК МесяцДаты,
	|	ГОД(ПутевойЛист412АПК.Дата) КАК ГодДаты
	|ИЗ
	|	Документ.ПутевойЛист412АПК КАК ПутевойЛист412АПК
	|ГДЕ
	|	ПутевойЛист412АПК.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПутевогоЛиста,
	|	НомерПутевогоЛиста,
	|	СерияПутевогоЛиста";	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДокументов = Результат.Выбрать();

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПФ_MXL_Форма412АПК";
	ТабличныйДокумент.Автомасштаб = Истина;
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураДанных = Новый Структура;
		Для Каждого Колонка ИЗ Результат.Колонки Цикл
			СтруктураДанных.Вставить(Колонка.Имя, ВыборкаДокументов[Колонка.Имя]);	
		КонецЦикла;
		
		//---изменение представления данных в печатной форме----------------
		НаименованиеПутевогоЛиста = "ПУТЕВОЙ ЛИСТ ТРАКТОРА "+?(СтруктураДанных.СерияПутевогоЛиста = "","", СокрЛП(СтруктураДанных.СерияПутевогоЛиста)+" ")+"№ ";
		СтруктураДанных.Вставить("НаименованиеПутевогоЛиста", НаименованиеПутевогоЛиста);	
		
		АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
															
															
		СтруктураДанных.Вставить("НаименованиеОрганизации", СтруктураДанных.НаименованиеОрганизации);
		СтруктураДанных.Вставить("СокращенноеНаименованиеОрганизации", СтруктураДанных.СокращенноеНаименованиеОрганизации);
		СтруктураДанных.Вставить("ОГРН", СтруктураДанных.ОГРН);
		СтруктураДанных.Вставить("АдресОрганизации", АдресОрганизации);
		СтруктураДанных.Вставить("ТелефонОрганизации", ТелефонОрганизации);
	
		СтруктураДанных.Вставить("СрокДействияПутевогоЛиста", 	УчетГСМ.СрокДействияПутевогоЛиста(СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия));
		
		СтруктураДанных.Вставить("МаркаТрактора", 	УчетГСМ.ПолучитьМаркуИМодельТС(СтруктураДанных.ТранспортноеСредство));	
		СтруктураДанных.Вставить("ИнвентарныйНомер", 	УчетГСМ.ИнвентарныйНомерОбъекта(СтруктураДанных.ТранспортноеСредство));
		СтруктураДанных.Вставить("СведенияОПеревозке", СтруктураДанных.СведенияОПеревозке);
		
		СтруктураДанных.Вставить("ЧислоВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВыездаФактическое", Формат(ВыборкаДокументов.ВремяВыездаТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		СтруктураДанных.Вставить("ЧислоВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВозвращенияФактическое", Формат(ВыборкаДокументов.ВремяВозвращенияТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		Если ЗначениеЗаполнено(СтруктураДанных.Тракторист) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Тракторист, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("ТрактористФИО", ДанныеСотрудника.Фамилия + " "+ДанныеСотрудника.Имя+" "+ДанныеСотрудника.Отчество);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанных.Прицепщик) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Прицепщик, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("ПрицепщикФИО", ДанныеСотрудника.Фамилия + " "+ДанныеСотрудника.Имя+" "+ДанныеСотрудника.Отчество);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтруктураДанных.Бригадир) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Бригадир, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("БригадирФИО", ДанныеСотрудника.Фамилия + " "+ДанныеСотрудника.Имя+" "+ДанныеСотрудника.Отчество);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанных.ВыездРазрешилМеханик) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.ВыездРазрешилМеханик, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("МеханикВыпустилТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Ложь));
		КонецЕсли;
		                   
		//Прицепы
		ВыборкаПрицепы = ВыборкаДокументов.Прицепы.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаПрицепы.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Прицепа", УчетГСМ.ПолучитьМаркуИМодельТС(ВыборкаПрицепы.Прицеп));
			СтруктураДанных.Вставить("ГосНомер"+НомерСтроки+"Прицепа", УчетГСМ.ПолучитьГосударственныйНомернойЗнакТС(ВыборкаПрицепы.Прицеп));
			СтруктураДанных.Вставить("ИнвентарныйНомер"+НомерСтроки+"Прицепа", УчетГСМ.ИнвентарныйНомерОбъекта(ВыборкаПрицепы.Прицеп));
		КонецЦикла;
		
		//Движение горючего
		ВыборкаГорючее = ВыборкаДокументов.ДвижениеГорючего.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаГорючее.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Горючего", ВыборкаГорючее.МаркаГорючего);
			СтруктураДанных.Вставить("КодМарки"+НомерСтроки+"Горючего", ВыборкаГорючее.КодМаркиГорючего);
			СтруктураДанных.Вставить("ЕдИзм"+НомерСтроки+"Горючего", ?(ЗначениеЗаполнено(ВыборкаГорючее.ЕдиницаИзмерения), ВыборкаГорючее.ЕдиницаИзмерения, "кг"));
			СтруктураДанных.Вставить("Выдано"+НомерСтроки+"Горючего", ВыборкаГорючее.ВыданоГорючее);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВыезде", ВыборкаГорючее.ОстатокГорючегоПриВыезде);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВозвращении", ВыборкаГорючее.ОстатокГорючегоПриВозвращении);
		КонецЦикла;
		
		//вывод областей табличного документа
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Заполнить(СтруктураДанных);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(Область, "НомерПутевогоЛиста", СтруктураДанных.НомерПутевогоЛиста, СтруктураДанных.Ссылка, Неопределено, Истина);
		
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ЗаданиеТрактористуОсновное");
		
		ВыборкаЗадания = ВыборкаДокументов.ЗаданиеВодителю.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаЗадания.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			
			Если НомерСтроки < 5 Тогда
				СтруктураДанных.Вставить("Заказчик"+НомерСтроки+"Наименование", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика));
				СтруктураДанных.Вставить("Пункт"+НомерСтроки+"Откуда", ВыборкаЗадания.АдресПунктаПогрузки);
				СтруктураДанных.Вставить("Пункт"+НомерСтроки+"Куда", ВыборкаЗадания.АдресПунктаРазгрузки);
				СтруктураДанных.Вставить("Расстояние"+НомерСтроки+"Км", ВыборкаЗадания.Расстояние);
				СтруктураДанных.Вставить("Груз"+НомерСтроки+"Наименование", ВыборкаЗадания.НаименованиеГруза);
				СтруктураДанных.Вставить("Класс"+НомерСтроки+"Груз", СокрЛП(ВыборкаЗадания.КлассГруза));
				СтруктураДанных.Вставить("Ездки"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоЕздок);
				СтруктураДанных.Вставить("Мест"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоМест);
				СтруктураДанных.Вставить("Вес"+НомерСтроки+"Тонн", ВыборкаЗадания.ПеревезтиТонн);
			Иначе
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Если НомерСтроки > 4 Тогда
			ВыборкаЗадания = ВыборкаДокументов.ЗаданиеВодителю.Выбрать();
			
			Пока ВыборкаЗадания.Следующий() Цикл
				НомерСтроки = НомерСтроки + 1;
				Если НомерСтроки > 15 Тогда
					Прервать;
				КонецЕсли;
				
				Если НомерСтроки > 4 Тогда
					Область = Макет.ПолучитьОбласть("ЗаданиеТрактористуСтрока");
					СтруктураДанныхСтроки = Новый Структура;
					СтруктураДанныхСтроки.Вставить("ЗаказчикНаименование", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика));
					СтруктураДанныхСтроки.Вставить("ПунктОткуда", ВыборкаЗадания.АдресПунктаПогрузки);
					СтруктураДанныхСтроки.Вставить("ПунктКуда", ВыборкаЗадания.АдресПунктаРазгрузки);
					СтруктураДанныхСтроки.Вставить("РасстояниеКм", ВыборкаЗадания.Расстояние);
					СтруктураДанныхСтроки.Вставить("ГрузНаименование", ВыборкаЗадания.НаименованиеГруза);
					СтруктураДанныхСтроки.Вставить("КлассГруз", СокрЛП(ВыборкаЗадания.КлассГруза));
					СтруктураДанныхСтроки.Вставить("ЕздкиКоличество", ВыборкаЗадания.КоличествоЕздок);
					СтруктураДанныхСтроки.Вставить("МестКоличество", ВыборкаЗадания.КоличествоМест);
					СтруктураДанныхСтроки.Вставить("ВесТонн", ВыборкаЗадания.ПеревезтиТонн);
					
					Область.Параметры.Заполнить(СтруктураДанныхСтроки);
					ТабличныйДокумент.Вывести(Область);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
		
		Для н = 1 По 15 - НомерСтроки Цикл
			Область = Макет.ПолучитьОбласть("ЗаданиеТрактористуСтрока");
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;
		
		
		Область = Макет.ПолучитьОбласть("Отметки");
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
		
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Оборотная сторона
		
		Область = Макет.ПолучитьОбласть("ЗаголовокОборотнойСтороны");
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ШапкаВыполненияЗадания");
		ТабличныйДокумент.Вывести(Область);
		
		Для н = 1 По 21 Цикл
			Область = Макет.ПолучитьОбласть("СтрокаВыполненияЗадания");
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("ПодвалВыполненияЗадания");
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
КонецФункции	

// Функция формирует печатные формы документов
//
// Параметры
//  МассивОбъктов  - Массив - Массив ссылок на объекты которые нужно распечатать
//  ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//
// Возвращаемое значение:
//   ТабличныйДокумент   - Результирующая таблица, содржащая печатный формы документов
//
Функция ПечатьПутевогоЛиста(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ПутевойЛист412АПК";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПутевойЛист412АПК.ПФ_MXL_Форма412АПК");
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ПутевойЛист412АПК.Ссылка КАК Ссылка,
	|	ПутевойЛист412АПК.Номер КАК НомерПутевогоЛиста,
	|	ПутевойЛист412АПК.Дата КАК ДатаПутевогоЛиста,
	|	ПутевойЛист412АПК.СерияПутевогоЛиста КАК СерияПутевогоЛиста,
	|	ПутевойЛист412АПК.Организация,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Организация КАК Справочник.Организации).ОГРН КАК ОГРН,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Организация КАК Справочник.Организации).НаименованиеСокращенное КАК СокращенноеНаименованиеОрганизации,
	|	ПутевойЛист412АПК.СрокДействия,
	|	ПутевойЛист412АПК.ТранспортноеСредство,
	|	ПутевойЛист412АПК.Водитель КАК Тракторист,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Организация КАК Справочник.Организации).КодОКПО КАК КодОКПО,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Организация КАК Справочник.Организации).НаименованиеПолное КАК НаименованиеОрганизации,
	|	ВЫРАЗИТЬ(ПутевойЛист412АПК.Водитель КАК Справочник.Сотрудники).Код КАК ТабельныйНомер,
	|	ПутевойЛист412АПК.ВремяВыездаТС,
	|	ПутевойЛист412АПК.ВремяВозвращенияТС,
	|	ПутевойЛист412АПК.ВыпускающийТСДиспетчер,
	|	ПутевойЛист412АПК.ЛицоДопускающееВодителяПоСостояниюЗдоровья,
	|	ПутевойЛист412АПК.ОтметкиОрганизации,
	|	ПутевойЛист412АПК.ВодительПринялТС,
	|	ПутевойЛист412АПК.ВодительСдалТС,
	|	ПутевойЛист412АПК.ПоказанияСпидометраПриВыезде,
	|	ПутевойЛист412АПК.ВыездРазрешилМеханик,
	|	ПутевойЛист412АПК.ПоказанияСпидометраПриВозвращении,
	|	ПутевойЛист412АПК.ПринялТСМеханик,
	|	ПутевойЛист412АПК.НулевойПробегПриВыезде,
	|	ПутевойЛист412АПК.НулевойПробегПриВозвращении,
	|	ПутевойЛист412АПК.ВремяВыездаТСФактическое,
	|	ПутевойЛист412АПК.ВремяВозвращенияТСФактическое,
	|	ПутевойЛист412АПК.ПриВозвращенииТСНеисправно,
	|	ПутевойЛист412АПК.РегистрационныйНомернойЗнак КАК ГосударственныйНомернойЗнак,
	|	ПутевойЛист412АПК.ГаражныйНомер,
	|	ПутевойЛист412АПК.Бригада,
	|	ПутевойЛист412АПК.Прицепы.(
	|		Ссылка,
	|		НомерСтроки,
	|		Прицеп,
	|		РегистрационныйНомернойЗнак,
	|		ГаражныйНомер
	|	),
	|	ПутевойЛист412АПК.ЗаданиеВодителю.(
	|		Ссылка,
	|		НомерСтроки,
	|		НаименованиеЗаказчика,
	|		АдресПунктаПогрузки,
	|		АдресПунктаРазгрузки,
	|		НаименованиеГруза,
	|		КоличествоЕздок,
	|		КоличествоМест,
	|		КлассГруза,
	|		Расстояние,
	|		ПеревезтиТонн
	|	),
	|	ПутевойЛист412АПК.ДвижениеГорючего.(
	|		Ссылка,
	|		НомерСтроки,
	|		МаркаГорючего,
	|		КодМаркиГорючего,
	|		ЕдиницаИзмерения,
	|		ВыданоГорючее,
	|		ОстатокГорючегоПриВыезде,
	|		ОстатокГорючегоПриВозвращении
	|	),
	|	ПутевойЛист412АПК.МаршрутДвижения.(
	|		Ссылка,
	|		НомерСтроки,
	|		ПунктПогрузкиРазгрузкиПерецепки,
	|		НомераТТД,
	|		КоличествоТТД,
	|		НомераПрицеповПрибывших,
	|		НомераПрицеповУбывших,
	|		ПорожнийПробегПрицепа,
	|		НаименованиеГрузоотправителя,
	|		АдресОткуда,
	|		АдресКуда,
	|		НаименованиеГруза,
	|		КлассГруза,
	|		ДатаВремяУбытия,
	|		ДатаВремяПрибытия,
	|		БригадаЗаказчик,
	|		ШифрУчета,
	|		ЕдиницаИзмерения,
	|		ОтработаноЧасов,
	|		ПеревезеноТонн,
	|		РаботаПоПеревозкеГруза,
	|		НормаВыработки,
	|		Расценка,
	|		ОплатаТрудаОсновная,
	|		ОплатаТрудаДополнительная,
	|		ОплатаТрудаСдельная,
	|		ОплатаТрудаВсего,
	|		ВыполненоНормоСмен,
	|		УсловныеГектары,
	|		Пробег,
	|		ПробегБезГруза,
	|		РасходПоНормеНаЕдиницуРаботы,
	|		РасходПоНорме,
	|		РасходФактически
	|	),
	|	ПутевойЛист412АПК.Участок,
	|	ПутевойЛист412АПК.Бригадир,
	|	ПутевойЛист412АПК.Прицепщик,
	|	ПутевойЛист412АПК.ВремяНачалаРаботы,
	|	ПутевойЛист412АПК.ВремяКонцаРаботы,
	|	ПутевойЛист412АПК.БригадирПодтвердилНачалоРаботы,
	|	ПутевойЛист412АПК.БригадирПодтвердилКонецРаботы,
	|	ПутевойЛист412АПК.ИтогиОтработаноЧасов,
	|	ПутевойЛист412АПК.ИтогиОтработаноДней,
	|	ПутевойЛист412АПК.ИтогиОтработаноМашиноДней,
	|	ПутевойЛист412АПК.ИтогиОтработаноМашиноСмен,
	|	МЕСЯЦ(ПутевойЛист412АПК.Дата) КАК МесяцДаты,
	|	ГОД(ПутевойЛист412АПК.Дата) КАК ГодДаты
	|ИЗ
	|	Документ.ПутевойЛист412АПК КАК ПутевойЛист412АПК
	|ГДЕ
	|	ПутевойЛист412АПК.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПутевогоЛиста,
	|	НомерПутевогоЛиста,
	|	СерияПутевогоЛиста";	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДокументов = Результат.Выбрать();

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПФ_MXL_Форма412АПК";
	ТабличныйДокумент.Автомасштаб = Истина;
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураДанных = Новый Структура;
		Для Каждого Колонка ИЗ Результат.Колонки Цикл
			СтруктураДанных.Вставить(Колонка.Имя, ВыборкаДокументов[Колонка.Имя]);	
		КонецЦикла;
		
		//---изменение представления данных в печатной форме----------------
		НаименованиеПутевогоЛиста = "ПУТЕВОЙ ЛИСТ ТРАКТОРА "+?(СтруктураДанных.СерияПутевогоЛиста = "","", СокрЛП(СтруктураДанных.СерияПутевогоЛиста)+" ")+"№ ";
		СтруктураДанных.Вставить("НаименованиеПутевогоЛиста", НаименованиеПутевогоЛиста);	
		
		АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
															
															
		СтруктураДанных.Вставить("НаименованиеОрганизации", СтруктураДанных.НаименованиеОрганизации);
		СтруктураДанных.Вставить("СокращенноеНаименованиеОрганизации", СтруктураДанных.СокращенноеНаименованиеОрганизации);
		СтруктураДанных.Вставить("ОГРН", СтруктураДанных.ОГРН);
		СтруктураДанных.Вставить("АдресОрганизации", АдресОрганизации);
		СтруктураДанных.Вставить("ТелефонОрганизации", ТелефонОрганизации);
	
		СтруктураДанных.Вставить("СрокДействияПутевогоЛиста", 	УчетГСМ.СрокДействияПутевогоЛиста(СтруктураДанных.ДатаПутевогоЛиста, СтруктураДанных.СрокДействия));
		
		СтруктураДанных.Вставить("МаркаТрактора", 	УчетГСМ.ПолучитьМаркуТС(СтруктураДанных.ТранспортноеСредство));	
		СтруктураДанных.Вставить("ИнвентарныйНомер", 	УчетГСМ.ИнвентарныйНомерОбъекта(СтруктураДанных.ТранспортноеСредство));	
		
		СтруктураДанных.Вставить("ЧислоВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВыезда", Формат(ВыборкаДокументов.ВремяВыездаТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВыездаФактическое", Формат(ВыборкаДокументов.ВремяВыездаТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		СтруктураДанных.Вставить("ЧислоВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""дд"""));	
		СтруктураДанных.Вставить("МесяцВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ММ"""));	
		СтруктураДанных.Вставить("ЧасВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""ЧЧ"""));	
		СтруктураДанных.Вставить("МинутыВозвращения", Формат(ВыборкаДокументов.ВремяВозвращенияТС,"ДФ=""мм"""));	
		
		СтруктураДанных.Вставить("ВремяВозвращенияФактическое", Формат(ВыборкаДокументов.ВремяВозвращенияТСФактическое,"ДФ=""дд.ММ.гггг ЧЧ:мм"""));	
		
		Если ЗначениеЗаполнено(СтруктураДанных.Тракторист) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Тракторист, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("ТрактористФИО", ДанныеСотрудника.Фамилия + " "+ДанныеСотрудника.Имя+" "+ДанныеСотрудника.Отчество);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанных.Прицепщик) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Прицепщик, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("ПрицепщикФИО", ДанныеСотрудника.Фамилия + " "+ДанныеСотрудника.Имя+" "+ДанныеСотрудника.Отчество);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтруктураДанных.Бригадир) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Бригадир, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("БригадирФИО", ДанныеСотрудника.Фамилия + " "+ДанныеСотрудника.Имя+" "+ДанныеСотрудника.Отчество);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанных.ВыездРазрешилМеханик) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.ВыездРазрешилМеханик, СтруктураДанных.ДатаПутевогоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("МеханикВыпустилТСИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Ложь));
		КонецЕсли;
		                   
		//Прицепы
		ВыборкаПрицепы = ВыборкаДокументов.Прицепы.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаПрицепы.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Прицепа", УчетГСМ.ПолучитьМаркуТС(ВыборкаПрицепы.Прицеп));
			СтруктураДанных.Вставить("ГосНомер"+НомерСтроки+"Прицепа", УчетГСМ.ПолучитьГосударственныйНомернойЗнакТС(ВыборкаПрицепы.Прицеп));
			СтруктураДанных.Вставить("ИнвентарныйНомер"+НомерСтроки+"Прицепа", УчетГСМ.ИнвентарныйНомерОбъекта(ВыборкаПрицепы.Прицеп));
		КонецЦикла;
		
		//Движение горючего
		ВыборкаГорючее = ВыборкаДокументов.ДвижениеГорючего.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаГорючее.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("Марка"+НомерСтроки+"Горючего", ВыборкаГорючее.МаркаГорючего);
			СтруктураДанных.Вставить("КодМарки"+НомерСтроки+"Горючего", ВыборкаГорючее.КодМаркиГорючего);
			СтруктураДанных.Вставить("ЕдИзм"+НомерСтроки+"Горючего", ?(ЗначениеЗаполнено(ВыборкаГорючее.ЕдиницаИзмерения), ВыборкаГорючее.ЕдиницаИзмерения, "кг"));
			СтруктураДанных.Вставить("Выдано"+НомерСтроки+"Горючего", ВыборкаГорючее.ВыданоГорючее);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВыезде", ВыборкаГорючее.ОстатокГорючегоПриВыезде);
			СтруктураДанных.Вставить("Остаток"+НомерСтроки+"ГорючегоПриВозвращении", ВыборкаГорючее.ОстатокГорючегоПриВозвращении);
		КонецЦикла;
		
		//вывод областей табличного документа
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Заполнить(СтруктураДанных);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(Область, "НомерПутевогоЛиста", СтруктураДанных.НомерПутевогоЛиста, СтруктураДанных.Ссылка, Неопределено, Истина);
		
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ЗаданиеТрактористуОсновное");
		
		ВыборкаЗадания = ВыборкаДокументов.ЗаданиеВодителю.Выбрать();
		
		НомерСтроки = 0;
		Пока ВыборкаЗадания.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			
			Если НомерСтроки < 5 Тогда
				СтруктураДанных.Вставить("Заказчик"+НомерСтроки+"Наименование", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика));
				СтруктураДанных.Вставить("Пункт"+НомерСтроки+"Откуда", ВыборкаЗадания.АдресПунктаПогрузки);
				СтруктураДанных.Вставить("Пункт"+НомерСтроки+"Куда", ВыборкаЗадания.АдресПунктаРазгрузки);
				СтруктураДанных.Вставить("Расстояние"+НомерСтроки+"Км", ВыборкаЗадания.Расстояние);
				СтруктураДанных.Вставить("Груз"+НомерСтроки+"Наименование", ВыборкаЗадания.НаименованиеГруза);
				СтруктураДанных.Вставить("Класс"+НомерСтроки+"Груз", СокрЛП(ВыборкаЗадания.КлассГруза));
				СтруктураДанных.Вставить("Ездки"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоЕздок);
				СтруктураДанных.Вставить("Мест"+НомерСтроки+"Количество", ВыборкаЗадания.КоличествоМест);
				СтруктураДанных.Вставить("Вес"+НомерСтроки+"Тонн", ВыборкаЗадания.ПеревезтиТонн);
			Иначе
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		Если НомерСтроки > 4 Тогда
			ВыборкаЗадания = ВыборкаДокументов.ЗаданиеВодителю.Выбрать();
			
			Пока ВыборкаЗадания.Следующий() Цикл
				НомерСтроки = НомерСтроки + 1;
				Если НомерСтроки > 15 Тогда
					Прервать;
				КонецЕсли;
				
				Если НомерСтроки > 4 Тогда
					Область = Макет.ПолучитьОбласть("ЗаданиеТрактористуСтрока");
					СтруктураДанныхСтроки = Новый Структура;
					СтруктураДанныхСтроки.Вставить("ЗаказчикНаименование", СокрЛП(ВыборкаЗадания.НаименованиеЗаказчика));
					СтруктураДанныхСтроки.Вставить("ПунктОткуда", ВыборкаЗадания.АдресПунктаПогрузки);
					СтруктураДанныхСтроки.Вставить("ПунктКуда", ВыборкаЗадания.АдресПунктаРазгрузки);
					СтруктураДанныхСтроки.Вставить("РасстояниеКм", ВыборкаЗадания.Расстояние);
					СтруктураДанныхСтроки.Вставить("ГрузНаименование", ВыборкаЗадания.НаименованиеГруза);
					СтруктураДанныхСтроки.Вставить("КлассГруз", СокрЛП(ВыборкаЗадания.КлассГруза));
					СтруктураДанныхСтроки.Вставить("ЕздкиКоличество", ВыборкаЗадания.КоличествоЕздок);
					СтруктураДанныхСтроки.Вставить("МестКоличество", ВыборкаЗадания.КоличествоМест);
					СтруктураДанныхСтроки.Вставить("ВесТонн", ВыборкаЗадания.ПеревезтиТонн);
					
					Область.Параметры.Заполнить(СтруктураДанныхСтроки);
					ТабличныйДокумент.Вывести(Область);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
		
		Для н = 1 По 15 - НомерСтроки Цикл
			Область = Макет.ПолучитьОбласть("ЗаданиеТрактористуСтрока");
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;
		
		
		Область = Макет.ПолучитьОбласть("Отметки");
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
		
		
		Область = Макет.ПолучитьОбласть("Подвал");
		Область.Параметры.Заполнить(СтруктураДанных);
		
		ТабличныйДокумент.Вывести(Область);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Оборотная сторона
		
		Область = Макет.ПолучитьОбласть("ЗаголовокОборотнойСтороны");
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ШапкаВыполненияЗадания");
		ТабличныйДокумент.Вывести(Область);
		
		Для н = 1 По 21 Цикл
			Область = Макет.ПолучитьОбласть("СтрокаВыполненияЗадания");
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("ПодвалВыполненияЗадания");
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
КонецФункции	

#КонецОбласти

#КонецЕсли
