#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьНастройкуВыгрузкиПоУмолчанию(Знач Организация, Знач ИмяОбъекта, Знач Банк = Неопределено) Экспорт
	
	НастройкаПоУмолчанию = Справочники.НастройкиВыгрузкиКомпенсацииРодительскойПлаты.ПустаяСсылка();
	
	Если Банк = Справочники.Банки.ПустаяСсылка() Тогда
		Банк = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Настройка.Ссылка
	|ИЗ
	|	Справочник.НастройкиВыгрузкиКомпенсацииРодительскойПлаты КАК Настройка
	|ГДЕ
	|	Настройка.Организация = &Организация
	|	И (Настройка.Банк = &Банк
	|			ИЛИ &Банк = НЕОПРЕДЕЛЕНО)
	|");
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Банк",		Банк);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат НастройкаПоУмолчанию;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
	
	КонецЕсли;
	
	// Найдено более 1 счета, посмотрим, какой использовался в документе последний раз.
	
	УсловиеПоБанку = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Док.НастройкаВыгрузки КАК НастройкаВыгрузки
	|ИЗ
	|	" + ИмяОбъекта + " КАК Док
	|ГДЕ
	|	Док.Организация = &Организация
	|	И Док.ПометкаУдаления = ЛОЖЬ" + УсловиеПоБанку + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.Дата УБЫВ"; 
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если Банк <> Неопределено Тогда
		УсловиеПоБанку = "
		|	И Док.КассовыйОрган = &Банк";
		Запрос.УстановитьПараметр("Банк", Банк);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НастройкаПоУмолчанию = Выборка.НастройкаВыгрузки;
		
	КонецЕсли;
	
	Возврат НастройкаПоУмолчанию;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
