#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документ.Дата КАК Период,
	|	Документ.Организация КАК Организация,
	|	Документ.НалоговыйОрган КАК НалоговыйОрган,
	|	Документ.КодПоОКТМО КАК КодПоОКТМО,
	|	Документ.ПорядокНалогообложения КАК ПорядокНалогообложения,
	|	Документ.НалоговаяСтавка КАК НалоговаяСтавка,
	|	Документ.НалоговаяБаза КАК НалоговаяБаза,
	|	Документ.КодВидаИмущества КАК КодВидаИмущества,
	|	Документ.ОсвобождениеОтНалогообложенияКодЛьготы КАК ОсвобождениеОтНалогообложенияКодЛьготы,
	|	Документ.КодОснованияЛьготы КАК КодОснованияЛьготы,
	|	Документ.ПроцентУменьшенияСуммыНалога КАК ПроцентУменьшенияСуммыНалога,
	|	Документ.СуммаУменьшенияСуммыНалога КАК СуммаУменьшенияСуммыНалога,
	|	Документ.НачалоДействия КАК НачалоДействия,
	|	ТЧОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТЧОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТЧОсновныеСредства.НеоблагаемаяКадастроваяСтоимость КАК НеоблагаемаяКадастроваяСтоимость,
	|	ТЧОсновныеСредства.ДоляСтоимостиЧислитель КАК ДоляСтоимостиЧислитель,
	|	ТЧОсновныеСредства.ДоляСтоимостиЗнаменатель КАК ДоляСтоимостиЗнаменатель,
	|	ТЧОсновныеСредства.ДоляВПравеОбщейСобственностиЧислитель КАК ДоляВПравеОбщейСобственностиЧислитель,
	|	ТЧОсновныеСредства.ДоляВПравеОбщейСобственностиЗнаменатель КАК ДоляВПравеОбщейСобственностиЗнаменатель,
	|	ТЧОсновныеСредства.УдалитьДоляПлощадиЧислитель КАК УдалитьДоляПлощадиЧислитель,
	|	ТЧОсновныеСредства.УдалитьДоляПлощадиЗнаменатель КАК УдалитьДоляПлощадиЗнаменатель
	|ИЗ
	|	Документ.РегистрацияСтавкиНалогаНаИмущество.ОсновныеСредства КАК ТЧОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияСтавкиНалогаНаИмущество КАК Документ
	|		ПО ТЧОсновныеСредства.Ссылка = Документ.Ссылка
	|ГДЕ
	|	Документ.Ссылка = &Ссылка
	|	И ТЧОсновныеСредства.Ссылка = &Ссылка";
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить(
		"СтавкиНалогаНаИмуществоПоОсновнымСредствам", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

Функция БазоваяСтавка() Экспорт
	
	Возврат 2.2;
	
КонецФункции

Процедура УстановитьУсловноеОформление(Элементы, УсловноеОформление) Экспорт
		
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(Элемент.Поля, Элементы.НалоговаяСтавка.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"Список.ПорядокНалогообложения", ВидСравненияКомпоновкиДанных.Равно,
		Перечисления.ПорядокНалогообложенияИмущества.ПоОбщейСтавке);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(Элемент.Поля, Элементы.НалоговыйОрган.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"Список.НалоговыйОрган", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<По месту нахождения>");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(Элемент.Поля, Элементы.КодПоОКТМО.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"Список.КодПоОКТМО", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<Код налогового органа>");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);		
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(Элемент.Поля, "НачалоДействия");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор,
		"Список.НачалоДействия", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<С даты документа>");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);		
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
