
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаЗагрузить.Видимость = Пользователи.ЭтоПолноправныйПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузитьНаСервере();
	
	ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Данные регистра загружены'"));
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.СоответствиеОперацийУчетаЗарплаты"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	РегистрыСведений.СоответствиеОперацийУчетаЗарплаты.ЗаполнитьПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти
