
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Ключ.Пустая() Тогда
		Если Объект.Дата <> КонецГода(Объект.Дата) И ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода) Тогда
			Объект.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка");
		КонецЕсли;
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	ПриИзмененииВидаДатыДвижений();
		
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ПодготовитьФормуНаСервере();
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Документ.КорректировкаРегистров.Форма.ФормаНастройки" Тогда
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений")
		   И ВыбранноеЗначение.Количество() <> 0 Тогда
		   
			Модифицированность = Истина;
			ПрименитьНастройкуСоставаРегистров(ВыбранноеЗначение);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.СпособЗаполнения = СпособЗаполненияВручную Тогда
		ТекущийОбъект.ЗаполнениеДвижений.Очистить();
		ТекущийОбъект.СторнируемыйДокумент = Неопределено;
	КонецЕсли;

	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ОтразитьВМежотчетномПериоде И 
		Не ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Вид межотчетного периода'")),,
			"Объект.ВидМежотчетногоПериода",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.Движения.ЖурналПроводокЕПСБУ.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Указанные в проводках расчетные счета, договоры, подразделения, документы будут очищены.
							|Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ОрганизацияПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Иначе
		ТекущаяОрганизация = Объект.Организация;
		ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьСвязанныеРеквизитыВПроводках();
		ТекущаяОрганизация = Объект.Организация;
		ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	Иначе
		Объект.Организация = ТекущаяОрганизация;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Общие проверки условий по датам.
	ТребуетсяВызовСервера = ОбщегоНазначенияБГУКлиент.ТребуетсяВызовСервераПриИзмененииДатыДокумента(Объект.Дата, ТекущаяДатаДокумента);
	
	// Если определили, что изменение даты может повлиять на какие-либо параметры, 
	// то передаем обработку на сервер.
	Если ТребуетсяВызовСервера Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	// Запомним новую дату документа.
	ТекущаяДатаДокумента = Объект.Дата;
	
	Если НЕ Объект.ПроизвольнаяДатаДвижений Тогда
		БухгалтерскийУчетКлиент.ОчиститьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
		БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗаполненияПриИзменении(Элемент)

	ОбновлениеОтображения();

КонецПроцедуры

&НаКлиенте
Процедура ФлажокСписокПриИзменении(Элемент)

	ОбновлениеОтображения();

КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВМежотчетномПериодеПриИзменении(Элемент)
	
	Если ОтразитьВМежотчетномПериоде Тогда
		Объект.Дата = КонецГода(Объект.Дата);
	КонецЕсли;
	
	БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект, Неопределено);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПроводок

&НаКлиенте
Процедура ДвиженияЖурналПроводокСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ДвиженияЖурналПроводокСодержаниеНачалоВыбораЗавершение", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение,
		Элемент.ТекстРедактирования, "Содержание проводки");
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСодержаниеНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.Содержание = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКФОПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборКФО(Объект.Организация,
											   ТекущиеДанные.ИФО,
											   ТекущиеДанные.КФО,
											   Объект.Дата,
											   ТекущиеДанные.КПСДт,
											   ТекущиеДанные.КПСКт);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ,Элемент);
КонецПроцедуры

// ДЕБЕТ

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетДтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	ТекущиеДанные.ЖурналОпераций = БухгалтерскиеОперацииВызовСервера.НомерЖурнала(ТекущиеДанные.СчетДт, ТекущиеДанные.СчетКт);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			ТекущиеДанные.СчетДт, 
																			ТекущиеДанные.КПСДт, 
																			ТекущиеДанные.КФО), 
															Объект.Организация,
															ТекущиеДанные.ИФО,
															,
															ТекущиеДанные.КФО,
															,
															Объект.Дата,
															Новый Структура("КорреспонденцияКт", ТекущиеДанные.СчетКт));
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетДтОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															ТекущиеДанные.КПСДт,
															ТекущиеДанные.КФО,
															ТекущиеДанные.КЭКДт,);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКПСДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;

	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													ТекущиеДанные.КПСДт, 
													Объект.Организация,
													ТекущиеДанные.ИФО,
													ТекущиеДанные.КФО,
													ТекущиеДанные.СчетДт,
													Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКЭКДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
    	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент, 
								СтандартнаяОбработка,
								ТекущиеДанные.КЭКДт,
								Объект.Организация, 
								ТекущиеДанные.ИФО,
								ТекущиеДанные.КФО, 
                                ТекущиеДанные.СчетДт,
								Объект.Дата,
								"Дт");
							КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоДт1);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоДт2);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоДт3);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВалютаДтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВалютнаяСуммаДт) Тогда
		ТекущиеДанные.Сумма = ПересчитатьСуммуВРублях(ТекущиеДанные.ВалютнаяСуммаДт, ТекущиеДанные.ВалютаДт, Объект.Дата);
	Иначе
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВалютнаяСуммаДтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВалютнаяСуммаДт) Тогда
		ТекущиеДанные.Сумма = ПересчитатьСуммуВРублях(ТекущиеДанные.ВалютнаяСуммаДт, ТекущиеДанные.ВалютаДт, Объект.Дата);
	Иначе
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт1ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт2ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт3ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент);
КонецПроцедуры

// КРЕДИТ

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетКтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	ТекущиеДанные.ЖурналОпераций = БухгалтерскиеОперацииВызовСервера.НомерЖурнала(ТекущиеДанные.СчетДт, ТекущиеДанные.СчетКт);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетКтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			ТекущиеДанные.СчетКт, 
																			ТекущиеДанные.КПСКт, 
																			ТекущиеДанные.КФО), 
															Объект.Организация,
															ТекущиеДанные.ИФО,
															,
															ТекущиеДанные.КФО,
															,
															Объект.Дата,
															Новый Структура("КорреспонденцияДт", ТекущиеДанные.СчетДт));
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетКтОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															ТекущиеДанные.КПСКт,
															ТекущиеДанные.КФО,
															,
															ТекущиеДанные.КЭККт);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКПСКтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;

	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													ТекущиеДанные.КПСКт, 
													Объект.Организация,
													ТекущиеДанные.ИФО,
													ТекущиеДанные.КФО,
													ТекущиеДанные.СчетКт,
													Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКЭККтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
    	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент, 
								СтандартнаяОбработка,
								ТекущиеДанные.КЭККт,
								Объект.Организация, 
								ТекущиеДанные.ИФО,
								ТекущиеДанные.КФО, 
                                ТекущиеДанные.СчетКт,
								Объект.Дата,
								"Кт");
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация, 
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоКт1);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоКт2);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоКт3);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВалютаКтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВалютнаяСуммаКт) Тогда
		ТекущиеДанные.Сумма = ПересчитатьСуммуВРублях(ТекущиеДанные.ВалютнаяСуммаКт, ТекущиеДанные.ВалютаКт, Объект.Дата);
	Иначе
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВалютнаяСуммаКтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВалютнаяСуммаКт) Тогда
		ТекущиеДанные.Сумма = ПересчитатьСуммуВРублях(ТекущиеДанные.ВалютнаяСуммаКт, ТекущиеДанные.ВалютаКт, Объект.Дата);
	Иначе
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт1ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт2ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт3ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийСписковРегистров

// Общая процедура для всех регистров. Устанавливает период и организацию в добавляемых строках.
//
&НаКлиенте
Процедура Подключаемый_ТаблицаРегистраПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элемент.ТекущиеДанные.Свойство("Период") Тогда
		Если НЕ Объект.ПроизвольнаяДатаДвижений ИЛИ НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Период) Тогда
			Элемент.ТекущиеДанные.Период = Объект.Дата;
		КонецЕсли;
	КонецЕсли;

	Если НоваяСтрока
			И НЕ Копирование
			И Элемент.ТекущиеДанные.Свойство("Организация")
			И ЗначениеЗаполнено(Объект.Организация) Тогда
		Элемент.ТекущиеДанные.Организация = Объект.Организация;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьСоставРегистров(Команда)

	АдресСпискаРегистров = ПодготовитьСписокРегистровДляЕгоНастройки();
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресСпискаРегистров", АдресСпискаРегистров);
	
	ОткрытьФорму("Документ.КорректировкаРегистров.Форма.ФормаНастройки", СтруктураПараметров, ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьАктивностьПроводок(Команда)

	Если Объект.ПометкаУдаления Тогда
		ПоказатьПредупреждение(Неопределено, НСтр(
		"ru = 'Документ помечен на удаление, 
        |поэтому переключить активность проводок нельзя.
        |Снимите пометку удаления.'"));
		Возврат;
	КонецЕсли;
	
	ПереключитьАктивностьПроводокСервер();

КонецПроцедуры

&НаСервере
Процедура ПереключитьАктивностьПроводокСервер()

	ТекущаяАктивность = Ложь;
	ТекущаяСтраница = СтрЗаменить(Элементы.ПанельРегистров.ТекущаяСтраница.Имя,"Группа","");
	Если Объект.Движения[ТекущаяСтраница].Количество() > 0 Тогда
		ТекущаяАктивность = Объект.Движения[ТекущаяСтраница][0].Активность;
	КонецЕсли;
	
	СтрокиРег = Регистры.НайтиСтроки(Новый Структура("Имя",ТекущаяСтраница));
	Если СтрокиРег.Количество()>0 Тогда
		Если СтрокиРег[0].ТипРегистра = "РегистрСведений" Тогда
			НаборЗаписейРС = ДанныеФормыВЗначение(Объект.Движения[ТекущаяСтраница],Тип("РегистрСведенийНаборЗаписей."+ТекущаяСтраница));
			НаборЗаписейРС.УстановитьАктивность(НЕ ТекущаяАктивность);
			ЗначениеВДанныеФормы(НаборЗаписейРС,Объект.Движения[ТекущаяСтраница]);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для каждого СтрокаДвижения Из Объект.Движения[ТекущаяСтраница] Цикл
		СтрокаДвижения.Активность = (НЕ ТекущаяАктивность);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗаполнить(Команда)

	Если Объект.СпособЗаполнения <> СпособЗаполненияСторно Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьДвижения() Тогда
		ТекстВопроса = НСтр("ru = 'Существующие проводки и движения регистров будут очищены.
			|Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		СформироватьДвиженияСторноСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СформироватьДвиженияСторноСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроводкиНУ(Команда)
	
	НомераПроводокНУ = ПолучитьНомераПроводокНУ();
	
	Если НомераПроводокНУ.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьПроводкиНУЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Существующие проводки налогового учета будут очищены. Заполнить?'"),
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьПроводкиНУНаСервере(НомераПроводокНУ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьПроводкиНУЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПроводкиНУНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроводкиНУНаСервере(НомераПроводокНУ = Неопределено)
	
	Если НомераПроводокНУ = Неопределено Тогда
		НомераПроводокНУ = ПолучитьНомераПроводокНУ();
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	НаборДвижений = ДокументОбъект.Движения.ЖурналПроводокЕПСБУ;
	
	// Удаляем существующие проводки НУ.
	КоличествоПроводокНУ = НомераПроводокНУ.Количество();
	Для Сч=1 По КоличествоПроводокНУ Цикл
		НомерПроводкиНУ = НомераПроводокНУ.Получить(КоличествоПроводокНУ - Сч);
		НаборДвижений.Удалить(НомерПроводкиНУ - 1);
	КонецЦикла;
	
	// Сформируем таблицу проводок БУ.
	// В новых проводках могут быть не заполнены Организация и Период.
	ТаблицаПроводок = НаборДвижений.Выгрузить();
	ТаблицаПроводок.ЗаполнитьЗначения(ДокументОбъект.Организация, "Организация");
	ТаблицаПроводок.ЗаполнитьЗначения(ДокументОбъект.Дата, "Период");
	
	// Сформируем таблицу проводок НУ по таблице проводок БУ.
	ТаблицаПроводокНУ = НалоговыйУчет.СформироватьПроводкиНУпоБУ(ДокументОбъект, ТаблицаПроводок);
	
	// Загрузим проводки БУ и НУ в табличную часть операции.
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПроводокНУ, ТаблицаПроводок);
	НаборДвижений.Загрузить(ТаблицаПроводок);
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Сторнирование

&НаСервере
Процедура СформироватьДвиженияСторноСервер()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаРегистра Из Регистры Цикл
		Если Объект.Движения[СтрокаРегистра.Имя].Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Объект.Движения[СтрокаРегистра.Имя].Очистить();
	КонецЦикла;

	//Формирование движений
	Если ФлажокСписок Тогда
		ВыполнитьСторнированиеДокументов(Объект.ЗаполнениеДвижений);
	Иначе
		ТЗДокументов = новый ТаблицаЗначений;
		ТЗДокументов.Колонки.Добавить("Документ");
		ТЗДокументов.Добавить().Документ = Объект.СторнируемыйДокумент;
		ВыполнитьСторнированиеДокументов(ТЗДокументов);
	КонецЕсли;
	
	ОбновитьФорму();

КонецПроцедуры

&НаСервере
Процедура ВыполнитьСторнированиеДокументов(СторнируемыеДокументы, СторнироватьРегистры = Истина, СторнироватьПроводки = Истина)

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Для каждого СтрокаТЧ Из СторнируемыеДокументы Цикл

		СторнируемыйДокумент = СтрокаТЧ.Документ;
		Если НЕ ЗначениеЗаполнено(СторнируемыйДокумент) Тогда

			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Заполнение",
				"Сторнируемый документ",
				СтрокаТЧ.НомерСтроки,
				"Сторнируемые документы");

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				Объект,
				,
				"Объект");
			Продолжить;
		КонецЕсли;

		МетаданныеДокумент	= СторнируемыйДокумент.Метаданные();

		Для Каждого МетаданныеРегистр Из МетаданныеДокумент.Движения Цикл

			// если документ "Корректировка регистров" не может иметь таких движений,
			// то это не сторнируемый регистр
			Если НЕ Объект.Движения.Свойство(МетаданныеРегистр.Имя) Тогда
				Продолжить;
			КонецЕсли;

			НаборДвижений = ДокументОбъект.Движения[МетаданныеРегистр.Имя];

			ЭтоРегистрБухгалтерии = Ложь;
			Если СторнироватьПроводки И Метаданные.РегистрыБухгалтерии.Содержит(МетаданныеРегистр) Тогда

				СторнируемыйНаборЗаписей = РегистрыБухгалтерии[МетаданныеРегистр.Имя].СоздатьНаборЗаписей();
				ЭтоРегистрБухгалтерии = Истина;

			ИначеЕсли СторнироватьРегистры И Метаданные.РегистрыНакопления.Содержит(МетаданныеРегистр) Тогда

				СторнируемыйНаборЗаписей = РегистрыНакопления[МетаданныеРегистр.Имя].СоздатьНаборЗаписей();

			Иначе
				Продолжить;
			КонецЕсли;

			СторнируемыйНаборЗаписей.Отбор.Регистратор.Значение = СторнируемыйДокумент;
			СторнируемыйНаборЗаписей.Прочитать();

			Для Каждого ДвижениеСторнируемое Из СторнируемыйНаборЗаписей Цикл

				ДвижениеСторно = НаборДвижений.Добавить();

				// реквизиты
				Если ЭтоРегистрБухгалтерии Тогда
					ЗаполнитьДвиженияСторноПоРегиструБухгалтерии(ДвижениеСторно, ДвижениеСторнируемое, МетаданныеРегистр);
				Иначе
					ЗаполнитьДвижениеСторно(ДвижениеСторно, ДвижениеСторнируемое, МетаданныеРегистр);
				КонецЕсли;

				ДвижениеСторно.Период = Объект.Дата;

			КонецЦикла;

		КонецЦикла;

	КонецЦикла;
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);

КонецПроцедуры

// Копирует значения движения в строку сторно нового движения
// для измерений и реквизитов. Ресурсы инвертируются
//
&НаСервере
Процедура ЗаполнитьДвижениеСторно(Движение, Строка, МетаданныеОбъект)

	ЗаполнитьЗначенияСвойств(Движение, Строка,,"Период,Регистратор,ВидДвижения");

	// вид движения
	Если МетаданныеОбъект.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
		Движение.ВидДвижения = Строка.ВидДвижения;
	КонецЕсли;

	// ресурсы
	Для каждого МДОбъект Из МетаданныеОбъект.Ресурсы Цикл
		Если ЗначениеЗаполнено(Строка[МДОбъект.Имя]) Тогда
			Движение[МДОбъект.Имя] = - Строка[МДОбъект.Имя];
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Копирует значения движения по регистру бухгалтерии в строку сторно
// нового движения для измерений и реквизитов. Ресурсы инвертируются
//
&НаСервере
Процедура ЗаполнитьДвиженияСторноПоРегиструБухгалтерии(Движение, Строка, МетаданныеОбъект)

	ЗаполнитьЗначенияСвойств(Движение, Строка,,"Период,Регистратор");

	// субконто
	Если МетаданныеОбъект.Корреспонденция Тогда
		Для каждого Субконто Из Строка.СубконтоДт Цикл
			Движение.СубконтоДт[Субконто.Ключ] = Субконто.Значение;
		КонецЦикла;
		Для каждого Субконто Из Строка.СубконтоКт Цикл
			Движение.СубконтоКт[Субконто.Ключ] = Субконто.Значение;
		КонецЦикла;
	Иначе
		Для каждого Субконто Из Строка.Субконто Цикл
			Движение.Субконто[Субконто.Ключ] = Субконто.Значение;
		КонецЦикла;
	КонецЕсли;

	// ресурсы
	Для каждого МДОбъект Из МетаданныеОбъект.Ресурсы Цикл
		Если МДОбъект.ПризнакУчета = Неопределено Тогда
			Если ЗначениеЗаполнено(Строка[МДОбъект.Имя]) Тогда
				Движение[МДОбъект.Имя] = - Строка[МДОбъект.Имя];
			КонецЕсли;
		Иначе
			Если МДОбъект.Балансовый Тогда
				Если ЗначениеЗаполнено(Строка[МДОбъект.Имя]) Тогда
					Движение[МДОбъект.Имя] = - Строка[МДОбъект.Имя];
				КонецЕсли;	
			Иначе
				Если ЗначениеЗаполнено(Строка[МДОбъект.Имя + "Дт"]) Тогда
					Движение[МДОбъект.Имя + "Дт"] = - Строка[МДОбъект.Имя + "Дт"];
				КонецЕсли;
				Если ЗначениеЗаполнено(Строка[МДОбъект.Имя + "Кт"]) Тогда
					Движение[МДОбъект.Имя + "Кт"] = - Строка[МДОбъект.Имя + "Кт"];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

/////////////////////////////////////
// Заполненение движений

&НаСервере
Процедура ОбновитьСписокДействий()

	Элементы.СпособЗаполнения.СписокВыбора.Очистить();
	Элементы.СпособЗаполнения.СписокВыбора.Добавить(СпособЗаполненияВручную,СпособЗаполненияВручную);
	Элементы.СпособЗаполнения.СписокВыбора.Добавить(СпособЗаполненияСторно,СпособЗаполненияСторно);

	Если НЕ ЗначениеЗаполнено(Объект.СпособЗаполнения) Тогда
		Объект.СпособЗаполнения = Элементы.СпособЗаполнения.СписокВыбора[0].Значение;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЕстьДвижения()

	Для каждого Регистр Из Регистры Цикл
		Если Объект.Движения[Регистр.Имя].Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		Возврат Истина;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

&НаКлиенте
Процедура ОчиститьСвязанныеРеквизитыВПроводках()
	
	Для каждого Проводка Из Объект.Движения.ЖурналПроводокЕПСБУ Цикл

		Для Инд = 1 по 3 Цикл
			ЗначениеСубконто = Проводка["СубконтоДт" + Инд];
			Если ЗначениеЗаполнено(ЗначениеСубконто)
				И ТипыСвязанныеСОрганизацией.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ЗначениеСубконто));
				ОписаниеТипаСубконто = Новый ОписаниеТипов(МассивТипов);
				Проводка["СубконтоДт" + Инд] = ОписаниеТипаСубконто.ПривестиЗначение(Неопределено);
			КонецЕсли;
		КонецЦикла;
		
		Для Инд = 1 по 3 Цикл
			ЗначениеСубконто = Проводка["СубконтоКт" + Инд];
			Если ЗначениеЗаполнено(ЗначениеСубконто)
				И ТипыСвязанныеСОрганизацией.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ТипЗнч(ЗначениеСубконто));
				ОписаниеТипаСубконто = Новый ОписаниеТипов(МассивТипов);
				Проводка["СубконтоКт" + Инд] = ОписаниеТипаСубконто.ПривестиЗначение(Неопределено);
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Проводка.ПодразделениеДт) Тогда
			Проводка.ПодразделениеДт = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Проводка.ПодразделениеКт) Тогда
			Проводка.ПодразделениеДт = Неопределено;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Настройка состава регистров

&НаСервере
Функция ПодготовитьСписокРегистровДляЕгоНастройки()

	// Актуализируем информацию о наличии движений
	Для Каждого Регистр Из Регистры Цикл
		
		Если НЕ Регистр.Отображение Тогда 
			Продолжить;
		КонецЕсли;
		
		Регистр.ЕстьДвижения = (Объект.Движения[Регистр.Имя].Количество() > 0);
		
	КонецЦикла;
	
	// Поместим таблицу Регистры во временное хранилище
	Возврат ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("Регистры"), УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ПрименитьНастройкуСоставаРегистров(РезультатДействийПользователя)
	
	Для Каждого ИзмененныйРегистр Из РезультатДействийПользователя Цикл
		
		ИмяРегистра = ИзмененныйРегистр.Значение;
		
		// Найдем регистр в коллекции Регистры
		Отбор = Новый Структура("Имя", ИмяРегистра);
		РезультатПоиска = Регистры.НайтиСтроки(Отбор);
		Если РезультатПоиска.Количество() = 0 Тогда
			// Имя регистра неизвестно в этой форме
			Продолжить;
		КонецЕсли;
		Регистр = РезультатПоиска[0];
		
		// Изменим отображение регистра
		Регистр.Отображение = ИзмененныйРегистр.Пометка;
		
		// Удалим данные из отключенных наборов записей
		Если НЕ ИзмененныйРегистр.Пометка Тогда
			Если Объект.Движения[ИмяРегистра].Количество() > 0 Тогда
				Объект.Движения[ИмяРегистра].Очистить();
			КонецЕсли;
			Регистр.ЕстьДвижения = Ложь;
		КонецЕсли;
		
		// Обновим данные в табличных частях ТаблицаРегистровСведений и ТаблицаРегистровНакопления
		Если Регистр.ТипРегистра = "РегистрНакопления" Тогда
			ОбновляемаяКоллекция = Объект.ТаблицаРегистровНакопления;
		ИначеЕсли Регистр.ТипРегистра = "РегистрСведений" Тогда
			ОбновляемаяКоллекция = Объект.ТаблицаРегистровСведений;
		Иначе
			ОбновляемаяКоллекция = Неопределено;
		КонецЕсли;
		
		Если ОбновляемаяКоллекция <> Неопределено Тогда
		
			Отбор = Новый Структура("Имя", Регистр.Имя);
			ОбновляемыеЭлементыКоллекции = ОбновляемаяКоллекция.НайтиСтроки(Отбор);
			
			КоличествоЭлементовКоллекции = ОбновляемыеЭлементыКоллекции.Количество();
			Если КоличествоЭлементовКоллекции > 1 Тогда
				// Удалим все, кроме первого
				Для ИндексЭлемента = 1 По КоличествоЭлементовКоллекции - 1 Цикл
					ОбновляемаяКоллекция.Удалить(ОбновляемыеЭлементыКоллекции[ИндексЭлемента]);
				КонецЦикла;
				КоличествоЭлементовКоллекции = 1;
			КонецЕсли;
			
			РегистрЕстьВКоллекции = (КоличествоЭлементовКоллекции <> 0);
			
			Если Регистр.Отображение И НЕ РегистрЕстьВКоллекции Тогда
				// Добавим регистр в коллекцию
				ОбновляемаяКоллекция.Добавить().Имя = Регистр.Имя;
			ИначеЕсли РегистрЕстьВКоллекции И НЕ Регистр.Отображение Тогда
				// Удалим регистр из коллекции
				ОбновляемаяКоллекция.Удалить(ОбновляемыеЭлементыКоллекции[0]);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		
	СоздатьЭлементыФормы();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Отрисовка формы

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ТекущаяДатаДокумента = Объект.Дата;
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	
	СпособЗаполненияВручную = НСтр("ru = 'Вручную'");
	СпособЗаполненияСторно  = НСтр("ru = 'Сторно движений документа'");
	ОбновитьСписокДействий();
	
	ФлажокСписок = Объект.ЗаполнениеДвижений.Количество() > 1;
	
	ОбновитьФорму();
	
	ТекущаяОрганизация = Объект.Организация;
	ТипыСвязанныеСОрганизацией = Документы.КорректировкаРегистров.ТипыСвязанныеСОрганизацией();
	
	// Назначаем общий обработчик
	Элементы.ДвиженияЖурналПроводок.УстановитьДействие("ПриНачалеРедактирования", "Подключаемый_ТаблицаРегистраПриНачалеРедактирования");
	
	БухгалтерскийУчетКлиентСервер.УстановитьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект);
	
	ОбновлениеОтображения();
	
КонецПроцедуры

&НаСервере
Процедура ОбновлениеОтображения()

	Если Объект.СпособЗаполнения = СпособЗаполненияВручную Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаИнформация;
		Элементы.ФлажокСписок.Видимость = Ложь;
		ФлажокСписок = Ложь;
	ИначеЕсли Объект.СпособЗаполнения = СпособЗаполненияСторно Тогда
		Элементы.ГруппаСторнирование.Видимость = Истина;
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаСторнирование;
		Элементы.ГруппаСторнируемыйДокумент.Видимость = НЕ ФлажокСписок;
		Элементы.ГруппаСписокДокументов.Видимость = ФлажокСписок;
		Элементы.ФлажокСписок.Видимость = Истина;
	КонецЕсли;

	Элементы.ГруппаСписокДокументов.Видимость = ФлажокСписок;

	Если Объект.СпособЗаполнения = СпособЗаполненияСторно Тогда
		Если ФлажокСписок И Объект.ЗаполнениеДвижений.Количество() = 0 Тогда
			Объект.ЗаполнениеДвижений.Добавить();
			Элементы.ЗаполнениеДвижений.ТекущаяСтрока = Объект.ЗаполнениеДвижений[0].ПолучитьИдентификатор();
			Объект.ЗаполнениеДвижений[0].Документ = Объект.СторнируемыйДокумент;
		ИначеЕсли НЕ ФлажокСписок И Объект.ЗаполнениеДвижений.Количество() > 0 Тогда
			Объект.СторнируемыйДокумент = Объект.ЗаполнениеДвижений[0].Документ;
			Объект.ЗаполнениеДвижений.Очистить();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыФормы()

	ПоказатьКнигаУчетаДоходовИРасходов = Ложь;
	ПоказатьРасшифровкаКУДиР           = Ложь;
	ПорядковыйНомер                    = 0;
	КоличествоВидимых                  = 0;
	Всего                              = Регистры.Количество();
	
	Если ТипЗнч(ПериодыРегистров) = Тип("ФиксированныйМассив") Тогда
		ЭлементыПериодов = Новый Массив(ПериодыРегистров);
	Иначе
		ЭлементыПериодов = Новый Массив;
	КонецЕсли;
	
	
	Для каждого СтрокаРегистра Из Регистры Цикл

		ПорядковыйНомер = ПорядковыйНомер + 1;
		КоличествоВидимых = КоличествоВидимых + Число(СтрокаРегистра.Отображение);
		
		Если СтрокаРегистра.Имя = "ЖурналПроводокЕПСБУ" Тогда
			
			Продолжить;
		КонецЕсли;
		
		// Создаем страницу для регистра в "правильном" месте между "предопределенными" закладками
		ИмяГруппы = "Группа" + СтрокаРегистра.Имя;
		ТекГруппа = Элементы.Найти(ИмяГруппы);
		Если ТекГруппа = Неопределено И СтрокаРегистра.Отображение Тогда

			//Найдем группу перед которой будем вставлять новую группу
			Для каждого Строка Из Регистры Цикл
				Если Строка.ТипРегистра >= СтрокаРегистра.ТипРегистра
					И Строка.Синоним > СтрокаРегистра.Синоним
					И Строка.Отрисован Тогда

					ВпередиСледующийЭлемент=Элементы["Группа" + Строка.Имя];
					Прервать;

				КонецЕсли;
			КонецЦикла;
			//Если ВпередиСледующийЭлемент = Неопределено Тогда
			//	ВпередиСледующийЭлемент = Элементы["ГруппаЖурналПроводокЕПСБУ"];
			//КонецЕсли;
			ТекГруппа = Элементы.Вставить(
				ИмяГруппы,
				Тип("ГруппаФормы"),
				Элементы.ПанельРегистров,
				ВпередиСледующийЭлемент);

			ТекГруппа.Заголовок = СтрокаРегистра.Синоним;
			СтрокаРегистра.Отрисован = Истина;

			Если СтрокаРегистра.ТипРегистра = "РегистрБухгалтерии" Тогда
				ТекГруппа.Картинка = БиблиотекаКартинок.РегистрБухгалтерии;
				КартинкаАктивности = БиблиотекаКартинок.АктивностьПоРБ;
			ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрНакопления" Тогда
				ТекГруппа.Картинка = БиблиотекаКартинок.РегистрНакопления;			
				КартинкаАктивности = БиблиотекаКартинок.АктивностьПоРН;
			ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрСведений" Тогда
				ТекГруппа.Картинка = БиблиотекаКартинок.РегистрСведений;
				КартинкаАктивности = БиблиотекаКартинок.АктивностьПоРС;
			КонецЕсли;

			// На странице регистра создаем таблицу
			ИмяТаблицы = СтрокаРегистра.Имя;
			ТекТаблица = Элементы.Найти(ИмяТаблицы);
			Если ТекТаблица <> Неопределено Тогда
				Элементы.Удалить(ТекТаблица);
			КонецЕсли;
			ТекТаблица = Элементы.Добавить(ИмяТаблицы, Тип("ТаблицаФормы"), ТекГруппа);
			ТекТаблица.ПутьКДанным = "Объект.Движения." + СтрокаРегистра.Имя;
			// Назначаем общий обработчик
			ТекТаблица.УстановитьДействие("ПриНачалеРедактирования", "Подключаемый_ТаблицаРегистраПриНачалеРедактирования");
			ТекТаблица.КартинкаСтрок = КартинкаАктивности;
			ТекТаблица.ПутьКДаннымКартинкиСтроки = "Объект.Движения." + СтрокаРегистра.Имя+".Активность";

			НоваяКнопка = Элементы.Добавить(ИмяТаблицы+"ПереключитьАктивностьПроводок", Тип("КнопкаФормы"), ТекТаблица.КоманднаяПанель);
			НоваяКнопка.ИмяКоманды = "ПереключитьАктивностьПроводок";

			// Определяем набор колонок для таблицы, соответствующих метаданным регистра
			Если СтрокаРегистра.ТипРегистра = "РегистрНакопления" Тогда
				НаборЗаписей = РегистрыНакопления[СтрокаРегистра.Имя].СоздатьНаборЗаписей();
				МетаданныеРегистра    = Метаданные.РегистрыНакопления[СтрокаРегистра.Имя];
			ИначеЕсли СтрокаРегистра.ТипРегистра = "РегистрСведений" Тогда
				НаборЗаписей = РегистрыСведений[СтрокаРегистра.Имя].СоздатьНаборЗаписей();
				МетаданныеРегистра    = Метаданные.РегистрыСведений[СтрокаРегистра.Имя];
			КонецЕсли;

			РеквизитыНабораЗаписей = НаборЗаписей.ВыгрузитьКолонки();

			// Некоторые колонки не показываем
			РеквизитыНабораЗаписей.Колонки.Удалить("Регистратор");
			РеквизитыНабораЗаписей.Колонки.Удалить("Активность");

			Если РеквизитыНабораЗаписей.Колонки.Найти("МоментВремени") <> Неопределено Тогда
				РеквизитыНабораЗаписей.Колонки.Удалить("МоментВремени");
			КонецЕсли;

			//Если РеквизитыНабораЗаписей.Колонки.Найти("Период") <> Неопределено Тогда
			//	РеквизитыНабораЗаписей.Колонки.Удалить("Период");
			//КонецЕсли;

			Если РеквизитыНабораЗаписей.Колонки.Найти("Организация") <> Неопределено Тогда
				РеквизитыНабораЗаписей.Колонки.Удалить("Организация");
			КонецЕсли;
						
			// Обновление заголовков колонок таблицы по синонимам полей регистра.
			МассивПолейРегистра = Новый Массив;
			МассивПолейРегистра.Добавить("Реквизиты");
			МассивПолейРегистра.Добавить("Измерения");
			МассивПолейРегистра.Добавить("Ресурсы");

			Для каждого ВидПоля Из МассивПолейРегистра Цикл
				Для каждого Поле Из МетаданныеРегистра[ВидПоля] Цикл
					КолонкаТаблицы = РеквизитыНабораЗаписей.Колонки.Найти(Поле.Имя);
					Если КолонкаТаблицы <> Неопределено Тогда
						КолонкаТаблицы.Заголовок = Поле.Синоним;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			// Создаем колонки таблицы
			ЭтоПериод = Ложь;
			Для каждого КолонкаРеквизита Из РеквизитыНабораЗаписей.Колонки Цикл
				Если КолонкаРеквизита.Имя = "Период" Тогда
					ЭтоПериод = Истина;
				Иначе
					ЭтоПериод = Ложь;
				КонецЕсли;
				ИмяКолонки = СтрокаРегистра.Имя + КолонкаРеквизита.Имя;
				ТекКолонка = Элементы.Найти(ИмяКолонки);
				Если ТекКолонка = Неопределено Тогда
					ТекКолонка = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТекТаблица);
				КонецЕсли;
				ТекКолонка.ПутьКДанным = ТекТаблица.ПутьКДанным + "." + КолонкаРеквизита.Имя;
				ТекКолонка.Заголовок   = КолонкаРеквизита.Заголовок;
				ТекКолонка.Вид = ВидПоляФормы.ПолеВвода;
				Если ЭтоПериод Тогда
					ЭлементыПериодов.Добавить(ИмяКолонки);
					Если НЕ Объект.ПроизвольнаяДатаДвижений Тогда
						ТекКолонка.Видимость = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;

		// Делаем страницу регистра невидимой, если она не нужна
		Если ТекГруппа <> Неопределено Тогда
			ТекГруппа.Видимость = СтрокаРегистра.Отображение;
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ГруппаЖурналПроводокЕПСБУ.Видимость = Истина;
	
	//Если движения только по регистру бухгалтерии то прячем заголовок у панели регистров
	Если КоличествоВидимых <= 1 Тогда
		Элементы.ПанельРегистров.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	Иначе
		Элементы.ПанельРегистров.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	КонецЕсли;
	
	ПериодыРегистров = Новый ФиксированныйМассив(ЭлементыПериодов);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму()

	МетаданныеДокумента = Документы.КорректировкаРегистров.ПустаяСсылка().Метаданные();
	ЗаполнитьТаблицуРегистров(МетаданныеДокумента);
	СоздатьЭлементыФормы();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРегистров(МетаданныеДокумента = Неопределено)

	Если МетаданныеДокумента = Неопределено Тогда
		МетаданныеДокумента = Объект.Ссылка.Метаданные();
	КонецЕсли;

	Регистры.Очистить();

	Для Каждого МетаданныеРегистра Из МетаданныеДокумента.Движения Цикл

		Регистр     = Регистры.Добавить();
		Регистр.Имя = МетаданныеРегистра.Имя;
		ПолноеИмя   = МетаданныеРегистра.ПолноеИмя();

		ПозицияТочки = Найти(ПолноеИмя, ".");
		ТипРегистра  = Лев(ПолноеИмя, ПозицияТочки - 1);

		Регистр.ТипРегистра = ТипРегистра;
		Регистр.Синоним     = МетаданныеРегистра.Синоним;

		Если Регистр.ТипРегистра = "РегистрНакопления" Тогда
			Регистр.РегистрОстатков = (МетаданныеРегистра.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки);
		КонецЕсли;

		Регистр.ЕстьДвижения = (Объект.Движения[Регистр.Имя].Количество() > 0);
		
		Если Регистр.ЕстьДвижения Тогда
			
			Регистр.Отображение  = Истина;
			
		ИначеЕсли Регистр.Имя = "ЖурналПроводокЕПСБУ" Тогда
			
			Регистр.Отображение  = Истина; // Этот регистр отображается всегда

		Иначе
			
			// Отображаем те регистры, которые пользователь отметил флагами
			Отбор = Новый Структура("Имя", Регистр.Имя);
			Если Объект.ТаблицаРегистровНакопления.НайтиСтроки(Отбор).Количество() > 0 Тогда
				Регистр.Отображение  = Истина;
			ИначеЕсли Объект.ТаблицаРегистровСведений.НайтиСтроки(Отбор).Количество() > 0 Тогда
				Регистр.Отображение  = Истина;
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;

	// Первым показывается регистр бухгалтерии, затем регистры накопления, затем - сведений
	Регистры.Сортировать("ТипРегистра, Синоним");

КонецПроцедуры

////////////////////////////////////////
// Прочее

&НаСервере
Функция ПолучитьНомераПроводокНУ()
	
	Возврат НалоговыйУчет.ПолучитьНомераПроводокНУ(Объект.Движения.ЖурналПроводокЕПСБУ);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПересчитатьСуммуВРублях(ВалютнаяСумма, Валюта, Дата)
	
	КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, Дата);
	
	Возврат РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
		ВалютнаяСумма, 
		Новый Структура("Валюта, Курс, Кратность", Валюта, КурсВалюты.Курс, КурсВалюты.Кратность),
		Новый Структура("Валюта, Курс, Кратность", Константы.ВалютаРегламентированногоУчета.Получить(), 1, 1));
														   
КонецФункции

&НаКлиенте
Процедура ПроизвольнаяДатаДвиженийПриИзменении(Элемент)
	
	Если Объект.ПроизвольнаяДатаДвижений 
		И ОтразитьВМежотчетномПериоде Тогда
		
		ОтразитьВМежотчетномПериоде = Ложь;
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект, Неопределено);
		
	КонецЕсли;
	
	ПриИзмененииВидаДатыДвижений();
	
	Если НЕ Объект.ПроизвольнаяДатаДвижений Тогда
		БухгалтерскийУчетКлиент.ОчиститьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
		БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидМежотчетногоПериода", "Видимость", ОтразитьВМежотчетномПериоде);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВидаДатыДвижений()
	
	Если Объект.ПроизвольнаяДатаДвижений Тогда
		ОтразитьВМежотчетномПериоде = Ложь;
	КонецЕсли;
	
	Для Каждого ЭлМас Из ПериодыРегистров Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,ЭлМас,"Видимость",Объект.ПроизвольнаяДатаДвижений);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДвиженияЖурналПроводокПериод","Видимость",Объект.ПроизвольнаяДатаДвижений);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ДвиженияЖурналПроводокВидМежотчетногоПериода","Видимость",Объект.ПроизвольнаяДатаДвижений);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ОтразитьВМежотчетномПериоде","ТолькоПросмотр",Объект.ПроизвольнаяДатаДвижений);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ВидМежотчетногоПериода","Видимость",НЕ Объект.ПроизвольнаяДатаДвижений И ОтразитьВМежотчетномПериоде);

КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокПериодПриИзменении(Элемент)
	ТекДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.ВидМежотчетногоПериода) Тогда
		Если КонецГода(ТекДанные.Период) = КонецДня(ТекДанные.Период) Тогда
			ТекДанные.Период = КонецДня(ТекДанные.Период);
		Иначе
			ТекДанные.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВидМежотчетногоПериодаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДанные.ВидМежотчетногоПериода) Тогда
		Если ЗначениеЗаполнено(ТекДанные.Период) Тогда
			ТекДанные.Период = КонецГода(ТекДанные.Период);
		ИначеЕсли ЗначениеЗаполнено(Объект.Дата) Тогда
			ТекДанные.Период = КонецГода(Объект.Дата);
		Иначе
			ТекДанные.Период = КонецГода(ПолучитьРабочуюДату());
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция ПолучитьРабочуюДату()
	Возврат ОбщегоНазначенияБГУ.РабочаяДатаПользователя();	
КонецФункции

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
