#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.НомерЧекаККМ = 0;
	ЭтотОбъект.НомерСменыККМ = 0;
	ЭтотОбъект.СтатусЧекаККМ = "";
	
	Для каждого ТекСтрока Из ЭтотОбъект.Оплата Цикл
		ТекСтрока.ДанныеПереданыВБанк = Ложь;
		ТекСтрока.СсылочныйНомер = "";
		ТекСтрока.НомерЧекаЭТ = "";
		ТекСтрока.НомерПлатежнойКарты = "";
	КонецЦикла;	                                    
	
	Для каждого ТекСтрока Из ЭтотОбъект.ТоварыРаботыУслуги Цикл
		ТекСтрока.ПродажаРазрешена 	= Ложь; 
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	// Нижеперечисленные реквизиты будут проверяться по условиям
	Если ЭтоРозничныйПокупатель Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
		МассивНепроверяемыхРеквизитов.Добавить("Договор");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		ЗаполнитьПоСчетуНаОплату(ДанныеЗаполнения);	
	ИначеЕсли	ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктОбОказанииУслуг") Тогда
		ЗаполнитьПоАктубОказанииУслуг(ДанныеЗаполнения);	
	ИначеЕсли	ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КвитанцияНаОплатуГосуслуг") Тогда
		ЗаполнитьПоКвитанцииНаОплатуГосуслуг(ДанныеЗаполнения);
	ИначеЕсли 	ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12") Тогда
		ЗаполнитьПоНакладнойНареализацию(ДанныеЗаполнения);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.ЧекККМ.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

    // Движения по учету остатков
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "ТоварыВТорговыхТочках");  
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "КодыИСМПБГУ");
	
	// Контроль остатков
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроверитьОстаткиНоменклатуры();
	ПроверитьКодыМаркировки();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоСчетуНаОплату(ДокументОснование)
	
	ЗаполняемыеДанные = "Организация, Контрагент, Договор, ТипЦены, СуммаВключаетНДС";
	ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
	
	ТекстСообщения = "";
	Если НЕ ЗначениеЗаполнено(ДанныеДокументаОснования.Контрагент) Тогда 
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Не заполнено поле ""Заказчик"".'") + Символы.ПС;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ДанныеДокументаОснования.Договор) Тогда 
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Не заполнено поле ""Договор"".'");
	КонецЕсли;
	
	Если ТекстСообщения <> "" Тогда 
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокументаОснования);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("СозданНаОснованииСчета", Истина);

	ЭтотОбъект.ЭтоРозничныйПокупатель = Ложь;
	ЭтотОбъект.ОплатаПоДокументамОснованиям = Истина;
	
	НоваяСтрока = ЭтотОбъект.ДокументыОснования.Добавить();
	НоваяСтрока.ДокументОснованиеЧекаККМ = ДокументОснование.Ссылка;
	
	Если ДокументОснование.Предоплата.Количество() > 0 Тогда 
		РанееВведенныеДокументы = ПолучитьРанееВведенныеДокументы(ДокументОснование);
		Если РанееВведенныеДокументы[0].Выгрузить().Количество() = 0 Тогда 
			ЗаполнитьЧекККМНаПредоплату(ДокументОснование);
		Иначе
			ЗаполнитьЗавершающийЧекККМПоСчету(ДокументОснование, РанееВведенныеДокументы);
		КонецЕсли;	
	Иначе
		РозничныеПродажиБГУ.ЗаполнитьСписокТоваровРаботУслугПоДокументамОснованиям(ЭтотОбъект);		
	КонецЕсли;	

КонецПроцедуры

Процедура ЗаполнитьПоАктубОказанииУслуг(ДокументОснование)
	
	ЗаполняемыеДанные = "Организация, Контрагент, Договор, ТипЦены, СуммаВключаетНДС";
	ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокументаОснования);

	ЭтотОбъект.ЭтоРозничныйПокупатель = Ложь;
	ЭтотОбъект.ОплатаПоДокументамОснованиям = Истина;
	
	НоваяСтрока = ЭтотОбъект.ДокументыОснования.Добавить();
	НоваяСтрока.ДокументОснованиеЧекаККМ = ДокументОснование.Ссылка;
	
	ПервоначальныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ДокументОснование");
	Если (ТипЗнч(ПервоначальныйДокумент) = Тип("ДокументСсылка.СчетНаОплату")) И ПервоначальныйДокумент.Предоплата.Количество() > 0 Тогда 
		РанееВведенныеДокументы = ПолучитьРанееВведенныеДокументы(ПервоначальныйДокумент);
		ЗаполнитьЗавершающийЧекККМ(ДокументОснование, РанееВведенныеДокументы, "Документ.АктОбОказанииУслуг.УслугиОказанные")
	Иначе
		РозничныеПродажиБГУ.ЗаполнитьСписокТоваровРаботУслугПоДокументамОснованиям(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоКвитанцииНаОплатуГосуслуг(ДокументОснование)
	ЗаполняемыеДанные = "Организация, Договор";
	ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокументаОснования);

	Если ЗначениеЗаполнено(ДокументОснование.Учащийся) Тогда
		ЭтотОбъект.Контрагент = ДокументОснование.Учащийся.Контрагент;
	КонецЕсли;
	
	ЭтотОбъект.ЭтоРозничныйПокупатель = Ложь;
	ЭтотОбъект.ОплатаПоДокументамОснованиям = Истина;
	
	НоваяСтрока = ЭтотОбъект.ДокументыОснования.Добавить();
	НоваяСтрока.ДокументОснованиеЧекаККМ = ДокументОснование.Ссылка;
	
	РозничныеПродажиБГУ.ЗаполнитьСписокТоваровРаботУслугПоДокументамОснованиям(ЭтотОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьПоНакладнойНареализацию(ДокументОснование)
	
	ЗаполняемыеДанные = "Организация, Контрагент, Договор, ТипЦены, СуммаВключаетНДС";
	ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокументаОснования);

	ЭтотОбъект.ЭтоРозничныйПокупатель = Ложь;
	ЭтотОбъект.ОплатаПоДокументамОснованиям = Истина;
	
	НоваяСтрока = ЭтотОбъект.ДокументыОснования.Добавить();
	НоваяСтрока.ДокументОснованиеЧекаККМ = ДокументОснование.Ссылка;
	
	ПервоначальныйДокумент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ДокументОснование");
	Если (ТипЗнч(ПервоначальныйДокумент) = Тип("ДокументСсылка.СчетНаОплату")) И ПервоначальныйДокумент.Предоплата.Количество() > 0 Тогда 
		РанееВведенныеДокументы = ПолучитьРанееВведенныеДокументы(ПервоначальныйДокумент);
		ЗаполнитьЗавершающийЧекККМ(ДокументОснование, РанееВведенныеДокументы, "Документ.НакладнаяНаРеализациюТорг12.Номенклатура")
	Иначе
		РозничныеПродажиБГУ.ЗаполнитьСписокТоваровРаботУслугПоДокументамОснованиям(ЭтотОбъект);		
	КонецЕсли;	

КонецПроцедуры	
	
Процедура ПроверитьОстаткиНоменклатуры()
	
	Если РозничныеПродажиБГУ.ВестиКонтрольОстатковТоваров(ЭтотОбъект.КассаККМ) И НЕ ДополнительныеСвойства.Свойство("СозданИзРМК") Тогда 
		
		СписокНоменклатуры = ЭтотОбъект.ТоварыРаботыУслуги.ВыгрузитьКолонку("Номенклатура");
		ЦМО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КассаККМ, "ЦМО");
		ДатаОстатков = Новый Граница(Новый МоментВремени(Дата, Ссылка),ВидГраницы.Включая);
		ОстаткиНоменклатуры = РозничныеПродажиБГУ.ПолучитьОстаткиНоменклатурыИзПрейскуранта(Организация, СписокНоменклатуры, ЦМО, ДатаОстатков);
		
		Для Каждого СтрокаТаблицы Из ЭтотОбъект.ТоварыРаботыУслуги Цикл 
			Остаток = ОстаткиНоменклатуры.Получить(СтрокаТаблицы.Номенклатура);
			Если Остаток <> Неопределено И Остаток < 0 Тогда 
				ТекстОшибки = НСтр("ru='В строке %2 списка ""Товары, работы, услуги"" по номенклатуре ""%1"" превышен текущий остаток на %3 '");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СтрокаТаблицы.Номенклатура, СтрокаТаблицы.НомерСтроки, -Остаток);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ТоварыРаботыУслуги", "Объект");
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПроверитьКодыМаркировки()
	
	РозничнаяРеализацияМаркированныхТоваров = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.КассаККМ, "РозничнаяРеализацияМаркированныхТоваров");
	Если НЕ ДополнительныеСвойства.Свойство("СозданИзРМК") И РозничнаяРеализацияМаркированныхТоваров Тогда 
		Для Каждого СтрокаТаблицы Из ЭтотОбъект.ТоварыРаботыУслуги Цикл 
			Если СтрокаТаблицы.МаркируемыйТовар И НЕ ЗначениеЗаполнено(СтрокаТаблицы.КодМаркировки) Тогда 
				ТекстОшибки = НСтр("ru='В строке %1 списка ""Товары, работы, услуги"" не заполнен код маркировки!'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СтрокаТаблицы.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ТоварыРаботыУслуги", "Объект");
			КонецЕсли;	
			Если СтрокаТаблицы.МаркируемыйТовар И СтрокаТаблицы.Количество > 1 Тогда 
				ТекстОшибки = НСтр("ru='В строке %1 списка ""Товары, работы, услуги"" количество не равно 1!'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СтрокаТаблицы.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ТоварыРаботыУслуги", "Объект");
			КонецЕсли;  
			Если СтрокаТаблицы.МаркируемыйТовар И СтрокаТаблицы.Количество = 0 И СтрокаТаблицы.КоличествоПервичныхУпаковок = 0 Тогда 
				ТекстОшибки = НСтр("ru='В строке %1 списка ""Товары, работы, услуги"" количество должно бытьбольше 0!'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СтрокаТаблицы.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ТоварыРаботыУслуги", "Объект");
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры	

Функция ПолучитьРанееВведенныеДокументы(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМ.Ссылка КАК Ссылка,
	               |	ЧекККМ.СуммаДокумента КАК СуммаДокумента
	               |ИЗ
	               |	Документ.ЧекККМ КАК ЧекККМ
	               |ГДЕ
	               |	ЧекККМ.ДокументыОснования.ДокументОснованиеЧекаККМ = &Основание
	               |	И ЧекККМ.ПометкаУдаления = ЛОЖЬ
	               |	И ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	АктОбОказанииУслуг.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТДокументыСписания
	               |ИЗ
	               |	Документ.АктОбОказанииУслуг КАК АктОбОказанииУслуг
	               |ГДЕ
	               |	АктОбОказанииУслуг.ДокументОснование = &Основание
	               |	И АктОбОказанииУслуг.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НакладнаяНаРеализациюТорг12.Ссылка
	               |ИЗ
	               |	Документ.НакладнаяНаРеализациюТорг12 КАК НакладнаяНаРеализациюТорг12
	               |ГДЕ
	               |	НакладнаяНаРеализациюТорг12.ПометкаУдаления = ЛОЖЬ
	               |	И НакладнаяНаРеализациюТорг12.ДокументОснование = &Основание
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМНаПередачуДокументыЧекаККМ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЧекККМНаПередачу.ДокументыЧекаККМ КАК ЧекККМНаПередачуДокументыЧекаККМ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыСписания КАК ВТДокументыСписания
	               |		ПО ЧекККМНаПередачуДокументыЧекаККМ.ДокументОснованиеЧекаККМ = ВТДокументыСписания.Ссылка
	               |ГДЕ
	               |	ЧекККМНаПередачуДокументыЧекаККМ.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Основание", ДокументОснование);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Возврат РезультатЗапроса	
	
КонецФункции

Процедура ЗаполнитьЧекККМНаПредоплату(ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетНаОплатуПредоплата.Количество КАК Количество,
	               |	СчетНаОплатуПредоплата.СуммаПредоплаты КАК Всего,
	               |	ЕСТЬNULL(Прейскурант.Ссылка, ЗНАЧЕНИЕ(Справочник.Прейскурант.ПустаяСсылка)) КАК Номенклатура,
	               |	СчетНаОплатуПредоплата.СтавкаНДС КАК СтавкаНДС,
	               |	СчетНаОплатуПредоплата.СуммаНДС КАК СуммаНДС
	               |ИЗ
	               |	Документ.СчетНаОплату.Предоплата КАК СчетНаОплатуПредоплата
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Прейскурант КАК Прейскурант
	               |		ПО СчетНаОплатуПредоплата.Номенклатура = Прейскурант.Номенклатура
	               |ГДЕ
	               |	СчетНаОплатуПредоплата.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ПроцентПредоплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ПроцентПредоплаты");
	Если ПроцентПредоплаты = 100 Тогда 
		ЭтотОбъект.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
	Иначе
		ЭтотОбъект.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ПредоплатаЧастичная;
	КонецЕсли;
	
	Для Каждого СтрокаПредоплата Из РезультатЗапроса Цикл 
		НоваяСтрока = ЭтотОбъект.ТоварыРаботыУслуги.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПредоплата);
		Если ЭтотОбъект.СуммаВключаетНДС Тогда 
			СуммаПредоплаты = СтрокаПредоплата.Всего;
		Иначе
			СуммаПредоплаты = СтрокаПредоплата.Всего - СтрокаПредоплата.СуммаНДС;
		КонецЕсли;	
		НоваяСтрока.Цена 			= СуммаПредоплаты/НоваяСтрока.Количество;
		НоваяСтрока.Сумма 			= СуммаПредоплаты;
		НоваяСтрока.ЦенаБезСкидок 	= НоваяСтрока.Цена;
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаполнитьЗавершающийЧекККМ(ДокументОснование, РанееВведенныеДокументы, ТабличнаяЧастьДокумента)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДокументОснованиеЧека.Номенклатура КАК Номенклатура,
	               |	ДокументОснованиеЧека.Цена КАК Цена,
	               |	ДокументОснованиеЧека.СуммаНДС КАК СуммаНДС,
	               |	ДокументОснованиеЧека.Всего КАК Всего,
	               |	ДокументОснованиеЧека.СтавкаНДС КАК СтавкаНДС,
	               |	ДокументОснованиеЧека.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТОснование
	               |ИЗ
	               |	ТабличнаяЧастьДокумента КАК ДокументОснованиеЧека
	               |ГДЕ
	               |	ДокументОснованиеЧека.Ссылка = &ДокументОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура КАК Номенклатура,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.Цена) КАК Цена,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.Всего) КАК Всего,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТВведенныеДокументы
	               |ИЗ
	               |	Документ.ЧекККМ.ТоварыРаботыУслуги КАК ЧекККМТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка В(&СписокДокументов)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТОснование.Всего - ВТВВеденныеДокументы.Всего, 0) КАК Цена,
	               |	ЕСТЬNULL(ВТОснование.СуммаНДС - ВТВВеденныеДокументы.СуммаНДС, 0) КАК СуммаНДС,
	               |	ЕСТЬNULL(ВТОснование.Всего - ВТВВеденныеДокументы.Всего, 0) КАК Всего,
	               |	ВТОснование.СтавкаНДС КАК СтавкаНДС,
	               |	ВТВВеденныеДокументы.Номенклатура КАК Номенклатура,
	               |	ВТОснование.Количество КАК Количество,
	               |	ЕСТЬNULL(ВТОснование.Всего - ВТВВеденныеДокументы.Всего, 0) КАК ЦенаБезСкидок,
	               |	ЕСТЬNULL(ВТОснование.Всего - ВТВВеденныеДокументы.Всего, 0) КАК Сумма
	               |ИЗ
	               |	ВТОснование КАК ВТОснование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТВведенныеДокументы КАК ВТВВеденныеДокументы
	               |		ПО ВТОснование.Номенклатура = ВТВВеденныеДокументы.Номенклатура.Номенклатура";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабличнаяЧастьДокумента", ТабличнаяЧастьДокумента);
	Запрос.УстановитьПараметр("ДокументОснование"	, ДокументОснование);
	Запрос.УстановитьПараметр("СписокДокументов"	, РанееВведенныеДокументы[0].Выгрузить().ВыгрузитьКолонку("Ссылка"));
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РанееВведенныеДокументы[2].Выгрузить().Количество() = 0 Тогда 
		ЭтотОбъект.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		ЭтотОбъект.УчитыватьТолькоОплату = Истина;
	Иначе	
		ЭтотОбъект.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ОплатаКредита;
		ЭтотОбъект.УчитыватьТолькоОплату = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из РезультатЗапроса Цикл 
		НоваяСтрока = ЭтотОбъект.ТоварыРаботыУслуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		Если ЭтотОбъект.СуммаВключаетНДС Тогда 
			СуммаПредоплаты = СтрокаТаблицы.Всего;
		Иначе
			СуммаПредоплаты = СтрокаТаблицы.Всего - СтрокаТаблицы.СуммаНДС;
		КонецЕсли;	
		НоваяСтрока.Цена 			= СуммаПредоплаты/НоваяСтрока.Количество;
		НоваяСтрока.Сумма 			= СуммаПредоплаты;
		НоваяСтрока.ЦенаБезСкидок 	= НоваяСтрока.Цена;
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаполнитьЗавершающийЧекККМПоСчету(ДокументОснование, РанееВведенныеДокументы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДокументОснованиеЧекаТовары.Номенклатура КАК Номенклатура,
	               |	ДокументОснованиеЧекаТовары.Цена КАК Цена,
	               |	ДокументОснованиеЧекаТовары.СуммаНДС КАК СуммаНДС,
	               |	ДокументОснованиеЧекаТовары.Всего КАК Всего,
	               |	ДокументОснованиеЧекаТовары.СтавкаНДС КАК СтавкаНДС,
	               |	ДокументОснованиеЧекаТовары.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТОснование
	               |ИЗ
	               |	Документ.СчетНаОплату.Материалы КАК ДокументОснованиеЧекаТовары
	               |ГДЕ
	               |	ДокументОснованиеЧекаТовары.Ссылка = &ДокументОснование
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДокументОснованиеЧекаУслуги.Номенклатура,
	               |	ДокументОснованиеЧекаУслуги.Цена,
	               |	ДокументОснованиеЧекаУслуги.СуммаНДС,
	               |	ДокументОснованиеЧекаУслуги.Всего,
	               |	ДокументОснованиеЧекаУслуги.СтавкаНДС,
	               |	ДокументОснованиеЧекаУслуги.Количество
	               |ИЗ
	               |	Документ.СчетНаОплату.Услуги КАК ДокументОснованиеЧекаУслуги
	               |ГДЕ
	               |	ДокументОснованиеЧекаУслуги.Ссылка = &ДокументОснование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура КАК Номенклатура,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.Цена) КАК Цена,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.Всего) КАК Всего,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТВведенныеДокументы
	               |ИЗ
	               |	Документ.ЧекККМ.ТоварыРаботыУслуги КАК ЧекККМТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка В(&СписокДокументов)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТОснование.Всего - ВТВВеденныеДокументы.Всего КАК Цена,
	               |	ВТОснование.СуммаНДС - ВТВВеденныеДокументы.СуммаНДС КАК СуммаНДС,
	               |	ВТОснование.Всего - ВТВВеденныеДокументы.Всего КАК Всего,
	               |	ВТОснование.СтавкаНДС КАК СтавкаНДС,
	               |	ВТВВеденныеДокументы.Номенклатура КАК Номенклатура,
	               |	ВТОснование.Количество КАК Количество,
	               |	ВТОснование.Всего - ВТВВеденныеДокументы.Всего КАК ЦенаБезСкидок,
	               |	ВТОснование.Всего - ВТВВеденныеДокументы.Всего КАК Сумма
	               |ИЗ
	               |	ВТОснование КАК ВТОснование
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТВведенныеДокументы КАК ВТВВеденныеДокументы
	               |		ПО ВТОснование.Номенклатура = ВТВВеденныеДокументы.Номенклатура.Номенклатура";
	Запрос.УстановитьПараметр("ДокументОснование"	, ДокументОснование);
	Запрос.УстановитьПараметр("СписокДокументов"	, РанееВведенныеДокументы[0].Выгрузить().ВыгрузитьКолонку("Ссылка"));
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РанееВведенныеДокументы[1].Выгрузить().Количество() = 0 Тогда 
		ЭтотОбъект.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		ЭтотОбъект.УчитыватьТолькоОплату = Ложь;
	Иначе
		Если РанееВведенныеДокументы[2].Выгрузить().Количество() = 0 Тогда 
			ЭтотОбъект.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		Иначе	
			ЭтотОбъект.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ОплатаКредита;
		КонецЕсли;	
		ЭтотОбъект.УчитыватьТолькоОплату = Истина;
	КонецЕсли;	
	
	Для Каждого СтрокаТаблицы Из РезультатЗапроса Цикл 
		НоваяСтрока = ЭтотОбъект.ТоварыРаботыУслуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		Если ЭтотОбъект.СуммаВключаетНДС Тогда 
			СуммаПредоплаты = СтрокаТаблицы.Всего;
		Иначе
			СуммаПредоплаты = СтрокаТаблицы.Всего - СтрокаТаблицы.СуммаНДС;
		КонецЕсли;	
		НоваяСтрока.Цена 			= СуммаПредоплаты/НоваяСтрока.Количество;
		НоваяСтрока.Сумма 			= СуммаПредоплаты;
		НоваяСтрока.ЦенаБезСкидок 	= НоваяСтрока.Цена;
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли