#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект); 
	
	СуммаВознаграждения = СуммаВознагражденияПоДокументу();
	
	СуммаНДСВознаграждения = Номенклатура.Итог("СуммаНДСВознаграждения") + Услуги.Итог("СуммаНДСВознаграждения") - ТоварыВозвращенные.Итог("СуммаНДСВознаграждения");
	
	СуммаДокумента = Номенклатура.Итог("Всего") + Услуги.Итог("Всего") - ТоварыВозвращенные.Итог("Всего");
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	
	НомерВходящегоДокумента = "";
	ДатаВходящегоДокумента  = '00010101';
	
	Для Каждого СтрокаТЧ Из Возвраты Цикл
		
		СтрокаТЧ.ВыставленСФ	= Ложь;
		СтрокаТЧ.ДатаСФ 		= '00010101';
		СтрокаТЧ.НомерСФ 		= "";
		СтрокаТЧ.СчетФактура	= "";
		
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из Покупатели Цикл
		
		СтрокаТЧ.ВыставленСФ = Ложь;
		СтрокаТЧ.СчетФактура = "";
		СтрокаТЧ.ДатаСФ 		= '00010101';
		СтрокаТЧ.НомерСФ 		= "";
		
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из ДенежныеСредства Цикл
		
		СтрокаТЧ.ВыставленСФ = Ложь;
		СтрокаТЧ.СчетФактура = "";
		СтрокаТЧ.ДатаСФ 		= '00010101';
		СтрокаТЧ.НомерСФ 		= "";
		
	КонецЦикла;
	
	// Очищаем (перезаполняем) реквизиты, которые не могут быть скопированы:
	Ответственный = Пользователи.ТекущийПользователь();
	
	ВыписыватьСчетаФактурыСводно = ВыписыватьСчетаФактурыСводно И Дата >= '20150101';
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ); 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если СпособРасчетаКомиссионногоВознаграждения = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.НеРассчитывается Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПроцентКомиссионногоВознаграждения");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СуммаВознагражденияПоДокументу()
	
	Возврат Номенклатура.Итог("СуммаВознаграждения")
			- ТоварыВозвращенные.Итог("СуммаВознаграждения")
			+ Услуги.Итог("СуммаВознаграждения")
			+ ?(СуммаВключаетНДС, 0, Номенклатура.Итог("СуммаНДСВознаграждения")
			- ТоварыВозвращенные.Итог("СуммаНДСВознаграждения")
			+ Услуги.Итог("СуммаНДСВознаграждения"));
			
КонецФункции

// Процедура выполняет заполнение табличной части ТоварыВозвращенные, по документу - основанию возврата.
Процедура ЗаполнитьПоДокументу(Сделка, Покупатель, КлючСтроки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Сделка);
	Запрос.УстановитьПараметр("Счет105", БухгалтерскийУчет.СчетПоКоду("105.00"));
	Запрос.УстановитьПараметр("ДокументРеализации", Сделка);
	Запрос.УстановитьПараметр("Покупатель", 		Покупатель);
	Запрос.УстановитьПараметр("КлючСтроки", 		КлючСтроки);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомиссионераНоменклатура.Номенклатура КАК Номенклатура,
	|	ОтчетКомиссионераНоменклатура.СчетУчета КАК СчетУчета,
	|	ОтчетКомиссионераНоменклатура.КПС КАК КПС
	|ПОМЕСТИТЬ НоменклатураДокумента
	|ИЗ
	|	Документ.ОтчетКомиссионера.Номенклатура КАК ОтчетКомиссионераНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераПокупатели
	|		ПО ОтчетКомиссионераНоменклатура.Ссылка = ОтчетКомиссионераПокупатели.Ссылка
	|			И ОтчетКомиссионераНоменклатура.КлючСтроки = ОтчетКомиссионераПокупатели.КлючСтроки
	|ГДЕ
	|	ОтчетКомиссионераНоменклатура.Ссылка = &ДокументОснование
	|	И ОтчетКомиссионераПокупатели.Покупатель = &Покупатель
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	СчетУчета,
	|	КПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Номенклатура)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3
	|		КОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2
	|		КОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии)
	|						ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1
	|					КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии)
	|						ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2
	|					КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии)
	|						ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК ДополнительнаяАналитикаСчета,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПСКт,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК Сумма,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт) КАК КоличествоКт
	|ПОМЕСТИТЬ ДвиженияДокумента
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор = &ДокументОснование
	|				И СчетКт В
	|					(ВЫБРАТЬ
	|						НоменклатураДокумента.СчетУчета
	|					ИЗ
	|						НоменклатураДокумента КАК НоменклатураДокумента),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)),
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Номенклатура)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3
	|		КОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2
	|		КОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО)
	|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии)
	|						ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1
	|					КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии)
	|						ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2
	|					КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоКт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Партии)
	|						ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетКт,
	|	Номенклатура,
	|	ДополнительнаяАналитикаСчета,
	|	КПСКт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияДокумента.СчетКт КАК Счет,
	|	ДвиженияДокумента.Номенклатура КАК Номенклатура,
	|	ДвиженияДокумента.ДополнительнаяАналитикаСчета КАК ДополнительнаяАналитикаСчета,
	|	ДвиженияДокумента.КПСКт КАК КПС,
	|	ДвиженияДокумента.Сумма КАК Сумма,
	|	ДвиженияДокумента.КоличествоКт КАК Количество
	|ПОМЕСТИТЬ СуммыСписания
	|ИЗ
	|	НоменклатураДокумента КАК НоменклатураДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияДокумента КАК ДвиженияДокумента
	|		ПО НоменклатураДокумента.СчетУчета = ДвиженияДокумента.СчетКт
	|			И НоменклатураДокумента.Номенклатура = ДвиженияДокумента.Номенклатура
	|			И НоменклатураДокумента.КПС = ДвиженияДокумента.КПСКт";
	
	Запрос.Выполнить();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажахТовары.Номенклатура КАК Номенклатура,
	|	ОтчетКомиссионераОПродажахТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ОтчетКомиссионераОПродажахТовары.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СуммыСписания.Количество, 0) <> 0
	|			ТОГДА СуммыСписания.Сумма / СуммыСписания.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаОприходования,
	|	ОтчетКомиссионераОПродажахТовары.Цена КАК Цена,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераОПродажах.СуммаВключаетНДС
	|			ТОГДА ОтчетКомиссионераОПродажахТовары.Сумма
	|		ИНАЧЕ ОтчетКомиссионераОПродажахТовары.Сумма + ОтчетКомиссионераОПродажахТовары.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	ОтчетКомиссионераОПродажахТовары.СтавкаНДС КАК СтавкаНДС,
	|	ОтчетКомиссионераОПродажахТовары.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераОПродажах.СуммаВключаетНДС
	|			ТОГДА ОтчетКомиссионераОПродажахТовары.СуммаВознаграждения
	|		ИНАЧЕ ОтчетКомиссионераОПродажахТовары.СуммаВознаграждения + ОтчетКомиссионераОПродажахТовары.СуммаНДСВознаграждения
	|	КОНЕЦ КАК СуммаВознаграждения,
	|	ОтчетКомиссионераОПродажахТовары.СуммаНДСВознаграждения КАК СуммаНДСВознаграждения,
	|	ОтчетКомиссионераОПродажахТовары.СчетУчета КАК СчетУчета,
	|	ОтчетКомиссионераОПродажах.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	|	ОтчетКомиссионераОПродажахТовары.НомерСтроки КАК НомерСтроки,
	|	ОтчетКомиссионераОПродажах.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	&ДокументРеализации КАК ДокументРеализации,
	|	ОтчетКомиссионераОПродажахТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОтчетКомиссионераОПродажахТовары.Всего КАК Всего,
	|	ОтчетКомиссионераОПродажахТовары.КПС КАК КПС,
	|	ОтчетКомиссионераОПродажахТовары.КЭК КАК КЭК,
	|	ОтчетКомиссионераОПродажахТовары.Партия КАК Партия,
	|	ОтчетКомиссионераОПродажахТовары.ЦенаПередачи КАК ЦенаПередачи
	|ИЗ
	|	Документ.ОтчетКомиссионера.Номенклатура КАК ОтчетКомиссионераОПродажахТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Покупатели КАК ОтчетКомиссионераОПродажахПокупатели
	|		ПО ОтчетКомиссионераОПродажахТовары.Ссылка = ОтчетКомиссионераОПродажахПокупатели.Ссылка
	|			И ОтчетКомиссионераОПродажахТовары.КлючСтроки = ОтчетКомиссионераОПродажахПокупатели.КлючСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера КАК ОтчетКомиссионераОПродажах
	|		ПО ОтчетКомиссионераОПродажахТовары.Ссылка = ОтчетКомиссионераОПродажах.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыСписания КАК СуммыСписания
	|		ПО ОтчетКомиссионераОПродажахТовары.Номенклатура = СуммыСписания.Номенклатура
	|			И ОтчетКомиссионераОПродажахТовары.СчетУчета = СуммыСписания.Счет
	|			И ОтчетКомиссионераОПродажахТовары.КПС = СуммыСписания.КПС
	|ГДЕ
	|	ОтчетКомиссионераОПродажахПокупатели.Покупатель = &Покупатель
	|	И ОтчетКомиссионераОПродажахПокупатели.Ссылка = &ДокументРеализации
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
	
	// удалим ранее заполненные записи с этим ключом
	ЗаполненныеСтрокиПоДокументу = ТоварыВозвращенные.НайтиСтроки(Новый Структура("КлючСтроки", КлючСтроки));
	Для каждого СтрокаТаблицыВозвраты Из ЗаполненныеСтрокиПоДокументу Цикл
		
		СтруктураОтбора = Новый Структура("ИдентификаторСтроки", СтрокаТаблицыВозвраты.ИдентификаторСтроки);
		
		ТоварыВозвращенные.Удалить(СтрокаТаблицыВозвраты);
		
	КонецЦикла;
	
	Для каждого СтрокаТаблицыТоваров Из ТаблицаТоваров Цикл
		
		СтрокаТабличнойЧасти = ТоварыВозвращенные.Добавить();
		
		СтрокаТабличнойЧасти.КлючСтроки = КлючСтроки;
		
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТаблицыТоваров,,"Сумма, СуммаНДС");
		
		СтрокаТабличнойЧасти.Сумма = ПересчитатьЦенуПриИзмененииФлаговНалогов(
		СтрокаТаблицыТоваров.Сумма, Истина, СуммаВключаетНДС, УчетНДСПовтИсп.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		
		ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти);
		РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, СуммаВключаетНДС);
		
		СтрокаТабличнойЧасти.СуммаВознаграждения = ПересчитатьЦенуПриИзмененииФлаговНалогов(
		СтрокаТаблицыТоваров.СуммаВознаграждения, Истина, СуммаВключаетНДС, УчетНДСПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицыТоваров.СтавкаНДСВознаграждения));
		
		СтрокаТабличнойЧасти.СуммаНДСВознаграждения = РассчитатьСуммуНДС(
		СтрокаТабличнойЧасти.СуммаВознаграждения, СуммаВключаетНДС, УчетНДСПовтИсп.ПолучитьСтавкуНДС(СтрокаТаблицыТоваров.СтавкаНДСВознаграждения));
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПересчитатьЦенуПриИзмененииФлаговНалогов(Цена, ЦенаВключаетНДС, СуммаВключаетНДС, СтавкаНДС)

	// Инициализация переменных
	НадоВключитьНДС  = Ложь;
	НадоИсключитьНДС = Ложь;
	НоваяЦена		 = Цена;

	Если СуммаВключаетНДС
		И (НЕ ЦенаВключаетНДС) Тогда
		
		// Надо добавлять НДС       
		НадоВключитьНДС = Истина;
	ИначеЕсли (НЕ СуммаВключаетНДС)
		И ЦенаВключаетНДС  Тогда
		
		// Надо исключать НДС       
		НадоИсключитьНДС = Истина;
	КонецЕсли;
		
	Если НадоИсключитьНДС Тогда
		НоваяЦена = (НоваяЦена * 100) / (100 + СтавкаНДС);
	КонецЕсли;

	Если НадоВключитьНДС Тогда
		НоваяЦена = (НоваяЦена * (100 + СтавкаНДС)) / 100;
	КонецЕсли;

	Возврат НоваяЦена;

КонецФункции

Процедура ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЗначениеПустогоКоличества = 0, СоответствиеРеквизитов = Неопределено)
	
	Если СоответствиеРеквизитов <> Неопределено Тогда
		СтрокаТаблицы = ПолучитьИзСтрокиТаблицыДокумента(СтрокаТабличнойЧасти, СоответствиеРеквизитов);
	Иначе
		СтрокаТаблицы = СтрокаТабличнойЧасти;
	КонецЕсли; 

	РасчетноеКоличество = ?(СтрокаТабличнойЧасти.Количество = 0, ЗначениеПустогоКоличества, СтрокаТабличнойЧасти.Количество);
	Если РасчетноеКоличество = 0 Тогда
		СтрокаТабличнойЧасти.Цена = 0;
	Иначе
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / РасчетноеКоличество;
	КонецЕсли; 
	
	Если СоответствиеРеквизитов <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(
			СтрокаТабличнойЧасти, 
			ВСтрокуТаблицыДокумента(СтрокаТаблицы, СоответствиеРеквизитов));
	КонецЕсли;
		
КонецПроцедуры

Процедура РассчитатьСуммуНДСТабЧасти(СтрокаТаблицы, СуммаВключаетНДС = Ложь,СоответствиеРеквизитов = Неопределено)
	
	Если СоответствиеРеквизитов <> Неопределено Тогда
		СтрокаТабличнойЧасти = ПолучитьИзСтрокиТаблицыДокумента(СтрокаТаблицы, СоответствиеРеквизитов);
	Иначе
		СтрокаТабличнойЧасти = СтрокаТаблицы;
	КонецЕсли; 
	
	Если ТипЗнч(СтрокаТабличнойЧасти)=Тип("Структура") Тогда
		Если СтрокаТабличнойЧасти.Свойство("Сумма") И СтрокаТабличнойЧасти.Свойство("СтавкаНДС") Тогда
			СтрокаТабличнойЧасти.СуммаНДС = РассчитатьСуммуНДС(
												СтрокаТабличнойЧасти.Сумма - ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтрокаТабличнойЧасти,"СуммаСкидки", 0),
												СуммаВключаетНДС,
												УчетНДСПовтИсп.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		КонецЕсли;
	Иначе // Строка табличной части
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
			СтрокаТабличнойЧасти.СуммаНДС = РассчитатьСуммуНДС(
												СтрокаТабличнойЧасти.Сумма,
												СуммаВключаетНДС,
												УчетНДСПовтИсп.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС));
		КонецЕсли;
	КонецЕсли;
	
	Если СоответствиеРеквизитов <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(
			СтрокаТаблицы, 
			ВСтрокуТаблицыДокумента(СтрокаТаблицы, СоответствиеРеквизитов));
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьИзСтрокиТаблицыДокумента(ИсходнаяСтрока, СоответствиеРеквизитов)
	
	Результат = Новый Структура;
	
	Для каждого СоответствиеРеквизита Из СоответствиеРеквизитов Цикл
		Результат.Вставить(СоответствиеРеквизита.Ключ, ИсходнаяСтрока[СоответствиеРеквизита.Значение]);
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция ВСтрокуТаблицыДокумента(ИсходнаяСтрока, СоответствиеРеквизитов)
	
	Результат = Новый Структура;
	
	Для каждого СоответствиеРеквизита Из СоответствиеРеквизитов Цикл
		Результат.Вставить(СоответствиеРеквизита.Значение, ИсходнаяСтрока[СоответствиеРеквизита.Ключ]);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РассчитатьСуммуНДС(Сумма, СуммаВключаетНДС, СтавкаНДС)

	Если СуммаВключаетНДС Тогда
		СуммаБезНДС = 100 * Сумма / (100 + СтавкаНДС);
		СуммаНДС = Сумма - СуммаБезНДС;
	Иначе
		СуммаБезНДС = Сумма;
	КонецЕсли;

	Если НЕ СуммаВключаетНДС Тогда
		СуммаНДС = СуммаБезНДС * СтавкаНДС / 100;
	КонецЕсли;
	
	Возврат СуммаНДС;

КонецФункции

#КонецОбласти

#КонецЕсли