#Область СлужебныйПрограммныйИнтерфейс

// Заполняет соответствие полей документов-оснований и исходящей транспортной операции
// 
// Возвращаемое значение:
//  Соответствие - соответствие со свойствами:
//  * ИмяДокумента — Соответствие — ключом свойства является имя документа, например "РеализацияТоваровУслуг",
//                                  а значением — соответствие со свойствами:
//  ** ГрузоотправительХозяйствующийСубъект — Строка — имя поля документа, которое соответствует контрагенту
//  	                                               хозяйствующего субъекта грузоотправителя
//  ** ГрузоотправительПредприятие — Строка — имя поля документа, которое соответствует предприятию грузоотправителя
//  ** ГрузополучательХозяйствующийСубъект — Строка — имя поля документа, которое соответствует контрагенту
//  	                                              хозяйствующего субъекта грузополучателя
//  ** ГрузополучательПредприятие — Строка — имя поля документа, которое соответствует предприятию грузополучателя
Процедура ЗаполнитьСоответствиеПолейДокументовОснованийИИсходящейТранспортнойОперации(СоответствиеПолей) Экспорт
	
	СоответствиеПолей.Вставить("НакладнаяНаОтпускМ15", Новый Соответствие);
	СоответствиеПолей["НакладнаяНаОтпускМ15"].Вставить("ГрузоотправительХозяйствующийСубъект", "Организация");
	СоответствиеПолей["НакладнаяНаОтпускМ15"].Вставить("ГрузоотправительПредприятие", "ЦМО");
	СоответствиеПолей["НакладнаяНаОтпускМ15"].Вставить("ГрузополучательХозяйствующийСубъект", "Контрагент");
	СоответствиеПолей["НакладнаяНаОтпускМ15"].Вставить("ГрузополучательПредприятие", "");
	
	СоответствиеПолей.Вставить("ТребованиеНакладная0315006", Новый Соответствие);
	СоответствиеПолей["ТребованиеНакладная0315006"].Вставить("ГрузоотправительХозяйствующийСубъект", "Организация");
	СоответствиеПолей["ТребованиеНакладная0315006"].Вставить("ГрузоотправительПредприятие", "ЦМООтправитель");
	СоответствиеПолей["ТребованиеНакладная0315006"].Вставить("ГрузополучательХозяйствующийСубъект", Неопределено);
	СоответствиеПолей["ТребованиеНакладная0315006"].Вставить("ГрузополучательПредприятие", "ЦМОПолучатель");
	
	СоответствиеПолей.Вставить("НакладнаяНаРеализациюТорг12", Новый Соответствие);
	СоответствиеПолей["НакладнаяНаРеализациюТорг12"].Вставить("ГрузоотправительХозяйствующийСубъект", "Организация");
	СоответствиеПолей["НакладнаяНаРеализациюТорг12"].Вставить("ГрузоотправительПредприятие", "ЦМО");
	СоответствиеПолей["НакладнаяНаРеализациюТорг12"].Вставить("ГрузополучательХозяйствующийСубъект", "Контрагент");
	СоответствиеПолей["НакладнаяНаРеализациюТорг12"].Вставить("ГрузополучательПредприятие", "");
	
КонецПроцедуры

// Заполняет соответствие полей документов-оснований и входящей транспортной операции
//
// Возвращаемое значение:
//  Соответствие - соответствие со свойствами:
//  * ИмяДокумента — Соответствие — ключом свойства является имя документа, например "РеализацияТоваровУслуг",
//                                  а значением — соответствие со свойствами:
//  ** ГрузоотправительХозяйствующийСубъект — Строка — имя поля документа, которое соответствует контрагенту
//                                                     хозяйствующего субъекта грузоотправителя
//  ** ГрузоотправительПредприятие — Строка — имя поля документа, которое соответствует предприятию грузоотправителя
//  ** ГрузополучательХозяйствующийСубъект — Строка — имя поля документа, которое соответствует контрагенту
//                                                    хозяйствующего субъекта грузополучателя
//  ** ГрузополучательПредприятие — Строка — имя поля документа, которое соответствует предприятию грузополучателя
Процедура ЗаполнитьСоответствиеПолейДокументовОснованийИВходящейТранспортнойОперации(СоответствиеПолей) Экспорт
	
	СоответствиеПолей.Вставить("ПоступлениеМЗ", Новый Соответствие);
	СоответствиеПолей["ПоступлениеМЗ"].Вставить("ГрузоотправительХозяйствующийСубъект", "Контрагент");
	СоответствиеПолей["ПоступлениеМЗ"].Вставить("ГрузоотправительПредприятие", "");
	СоответствиеПолей["ПоступлениеМЗ"].Вставить("ГрузополучательХозяйствующийСубъект", "Организация");
	СоответствиеПолей["ПоступлениеМЗ"].Вставить("ГрузополучательПредприятие", "ЦМО");
	
	СоответствиеПолей.Вставить("ТребованиеНакладная0315006", Новый Соответствие);
	СоответствиеПолей["ТребованиеНакладная0315006"].Вставить("ГрузоотправительХозяйствующийСубъект", "Организация");
	СоответствиеПолей["ТребованиеНакладная0315006"].Вставить("ГрузоотправительПредприятие", "ЦМООтправитель");
	СоответствиеПолей["ТребованиеНакладная0315006"].Вставить("ГрузополучательХозяйствующийСубъект", Неопределено);
	СоответствиеПолей["ТребованиеНакладная0315006"].Вставить("ГрузополучательПредприятие", "ЦМОПолучатель");
	
КонецПроцедуры

// Заполняет соответствие полей документов-оснований и производственных операций
//
// Параметры:
//  СоответствиеПолей - Соответствие из КлючИЗначение:
//  * ИмяДокумента - Соответствие из КлючИЗначение - ключом свойства является имя документа, например "СборкаТоваров",
//                                  а значением - соответствие со свойствами:
//  ** ХозяйствующийСубъект - Строка - имя поля документа, которое соответствует хозяйствующему субъекту
//  ** Предприятие - Строка - имя поля документа, которое соответствует предприятию хозяйствующего субъекта
Процедура ЗаполнитьСоответствиеПолейДокументовОснованийИПроизводственнойОперации(СоответствиеПолей) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Заполняет соответствие полей документов-оснований и инвентаризации продукции
//
// Возвращаемое значение:
//  Соответствие - соответствие со свойствами:
//  * ИмяДокумента — Соответствие — ключом свойства является имя документа, например "СписаниеНедостачТоваров",
//                                  а значением — соответствие со свойствами:
//  ** ХозяйствующийСубъект — Строка — имя поля документа, которое соответствует хозяйствующему субъекту
//  ** Предприятие — Строка — имя поля документа, которое соответствует предприятию хозяйствующего субъекта
Процедура ЗаполнитьСоответствиеПолейДокументовОснованийИИнвентаризацииПродукции(СоответствиеПолей) Экспорт
	
	СоответствиеПолей.Вставить("ПоступлениеМЗ", Новый Соответствие);
	СоответствиеПолей["ПоступлениеМЗ"].Вставить("ХозяйствующийСубъект", "Организация");
	СоответствиеПолей["ПоступлениеМЗ"].Вставить("Предприятие", "ЦМО");
	
	СоответствиеПолей.Вставить("ВыпускПродукции", Новый Соответствие);
	СоответствиеПолей["ВыпускПродукции"].Вставить("ХозяйствующийСубъект", "Организация");
	СоответствиеПолей["ВыпускПродукции"].Вставить("Предприятие", "ЦМО");
	
	СоответствиеПолей.Вставить("АктСписанияМЗ", Новый Соответствие);
	СоответствиеПолей["АктСписанияМЗ"].Вставить("ХозяйствующийСубъект", "Организация");
	СоответствиеПолей["АктСписанияМЗ"].Вставить("Предприятие", "ЦМООтправитель");
	
	СоответствиеПолей.Вставить("НакладнаяНаОтпускМ15", Новый Соответствие);
	СоответствиеПолей["НакладнаяНаОтпускМ15"].Вставить("ХозяйствующийСубъект", "Организация");
	СоответствиеПолей["НакладнаяНаОтпускМ15"].Вставить("Предприятие", "ЦМО");
	
	СоответствиеПолей.Вставить("НакладнаяНаРеализациюТорг12", Новый Соответствие);
	СоответствиеПолей["НакладнаяНаРеализациюТорг12"].Вставить("ХозяйствующийСубъект", "Организация");
	СоответствиеПолей["НакладнаяНаРеализациюТорг12"].Вставить("Предприятие", "ЦМО");
	
КонецПроцедуры

// Заполняет свойства (например, Видимость, Доступность итп) отдельных элементов формы документа 
// 'ПроизводственнаяОперацияВЕТИС' в зависимости от документа-основания.
//
// Параметры:
//  ДокументОснование - ОпределяемыйТип.ОснованиеПроизводственнаяОперацияВЕТИС - Основание документа.
//  Свойства          - Структура                                              - Свойства элементов.
Процедура ЗаполнитьСвойстваЭлементовПроизводственнойТранзакцииПоДокументуОснованию(Свойства, ДокументОснование) Экспорт
	
	Свойства = Новый Структура("Видимость, Доступность, ТолькоПросмотр", Ложь, Истина, Истина);
	
КонецПроцедуры

// Заполняет признак необходимости заполнения реквизита 'ТорговыйОбъект' документа 'ПроизводственнаяОперацияВЕТИС'.
//
// Параметры:
//  ДокументОснование - ОпределяемыйТип.ОснованиеПроизводственнаяОперацияВЕТИС - Основание документа.
//  Заполнять         - Булево                                                 - Необходимость заполнения.
Процедура ЗаполнятьТорговыйОбъектПоДокументуОснованию(ДокументОснование, Заполнять) Экспорт
	
	Заполнять = Ложь;
	
КонецПроцедуры

// Заполняет структуру, содержащую поля кэшируемых значений.
// 
// Параметры:
//   КэшированныеЗначения - (см. ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения) - результат.
//
Процедура ЗаполнитьСтруктуруКэшируемыеЗначения(КэшированныеЗначения) Экспорт
	
	КэшированныеЗначения = Неопределено;
	
КонецПроцедуры

// Возвращает параметры формы подбора товаров.
//
// Параметры:
// ПараметрыПодбора - Структура - Структура со свойствами:
//  * СкрыватьКнопкуЗапрашиватьКоличество     - Булево - Признак необходимости сокрытия кнопки указания количества.
//  * РежимПодбораБезКоличественныхПараметров - Булево - Признак работы формы подбора товаров с выключенным режимом 
//                                                       использования количественных параметров.
//  * Склад - ОпределяемыйТип.ТорговыйОбъектВЕТИС - Склад, на котором осуществляется подбор товаров.
//  Форма - ФормаКлиентскогоПриложения - Форма, в которой вызывается команда открытия формы подбора товаров.
//  ПараметрыУказанияСерий - Произвольный - См. ИнтеграцияИС.ПараметрыУказанияСерий. 
Процедура ЗаполнитьПараметрыФормыПодбораТоваров(ПараметрыПодбора, Форма, ПараметрыУказанияСерий) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Пересчитывает количество из базовой единицы измерения номенклатуры в единицу измерения ВЕТИС.
//
Процедура ЗаполнитьКоличествоЕдиницВЕТИС(КоличествоВЕТИС, Количество, Номенклатура, ЕдиницаИзмеренияВЕТИС, КэшированныеЗначения, ТекстОшибки) Экспорт
	
	КоличествоВЕТИС = ИнтеграцияВЕТИСБГУКлиентСервер.ПересчитатьКоличествоЕдиницВЕТИС(
		Количество,
		Номенклатура,
		ЕдиницаИзмеренияВЕТИС,
		КэшированныеЗначения,
		ТекстОшибки);
	
КонецПроцедуры

// Пересчитывает количество из единицы измерения ВЕТИС в базовую единицу измерения номенклатуры.
//
Процедура ЗаполнитьКоличествоЕдиницПоВЕТИС(Количество, КоличествоВЕТИС, Номенклатура, ЕдиницаИзмеренияВЕТИС, КэшированныеЗначения, ТекстОшибки = Неопределено) Экспорт
	
	Количество = ИнтеграцияВЕТИСБГУКлиентСервер.ПересчитатьКоличествоЕдиниц(
		КоличествоВЕТИС,
		Номенклатура,
		ЕдиницаИзмеренияВЕТИС,
		КэшированныеЗначения,
		ТекстОшибки);
	
КонецПроцедуры

// Заполняет параметры оформления серии по данным строки (если использование условного оформления не возможно).
//
// Параметры:
//   ПараметрыОформленияСерии - Структура - поля, на основании которых можно оформить элемент формы.
//   ДанныеСтроки - Структура, ДанныеФормыЭлементКоллекции - данные, в которых содержится информация по оформлению серии.
Процедура ЗаполнитьПараметрыОформленияСерииПоДаннымСтроки(ПараметрыОформленияСерии, ДанныеСтроки) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
