#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьОбщиеПараметрыУчетаРасходов() Экспорт
	
	ОбщиеПараметрыУчетаРасходов = Новый Структура(
		"ФинРезультатЕстьУчетПоПодразделениям,
		|ЗатратыЕстьУчетПоПодразделениям,ЗатратыЕстьДопСубконтоБУ,ЗатратыЕстьДопСубконтоНУ,ЗатратыВидДопСубконто");
	
	НомераТаблиц = Новый Структура;
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ВложенныйЗапрос.УчетПоПодразделениям), ЛОЖЬ) КАК ЕстьУчетПоПодразделениям
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕПСБУ.УчетПоПодразделениям КАК УчетПоПодразделениям
	|	ИЗ
	|		ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|	ГДЕ
	|		ЕПСБУ.Ссылка В(&СчетаФинРезультата)) КАК ВложенныйЗапрос";
	НомераТаблиц.Вставить("ФинРезультатУчетПоПодразделениям", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ВложенныйЗапрос.УчетПоПодразделениям), ЛОЖЬ) КАК ЕстьУчетПоПодразделениям
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕПСБУ.УчетПоПодразделениям КАК УчетПоПодразделениям
	|	ИЗ
	|		ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|	ГДЕ
	|		ЕПСБУ.Ссылка В (&СчетаРасходовБУ, &СчетаРасходовНУ)) КАК ВложенныйЗапрос";
	НомераТаблиц.Вставить("РасходыБУУчетПоПодразделениям", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕПСБУВидыСубконто.ВидСубконто КАК ВидДопСубконтоБУ
	|ИЗ
	|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|ГДЕ
	|	ЕПСБУВидыСубконто.Ссылка В(&СчетаРасходовБУ)
	|	И ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.НаправленияДеятельности)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕПСБУВидыСубконто.Ссылка";
	НомераТаблиц.Вставить("РасходыБУДопСубконто", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕПСБУВидыСубконто.ВидСубконто КАК ВидДопСубконтоНУ
	|ИЗ
	|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|ГДЕ
	|	ЕПСБУВидыСубконто.Ссылка В(&СчетаРасходовНУ)
	|	И ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.НаправленияДеятельности)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕПСБУВидыСубконто.Ссылка";
	НомераТаблиц.Вставить("РасходыНУДопСубконто", НомераТаблиц.Количество());
	
	Запрос.УстановитьПараметр("СчетаРасходовБУ",    БухгалтерскийУчет.СписокСчетов("109.00"));
	Запрос.УстановитьПараметр("СчетаРасходовНУ",    БухгалтерскийУчет.СписокСчетов("Н20.11,Н20.21,Н25.11,Н25.21,Н26.11,Н26.12,Н44"));
	Запрос.УстановитьПараметр("СчетаФинРезультата", БухгалтерскийУчет.СписокСчетов("401.10,401.20"));
	
	Результат = Запрос.ВыполнитьПакет();
	
	ИспользоватьУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	
	// Проверим наличие учета по подразделениям на счетах 401.10, 401.20.
	ВыборкаФинРезультат = Результат[НомераТаблиц.ФинРезультатУчетПоПодразделениям].Выбрать();
	Если ВыборкаФинРезультат.Следующий() Тогда
		ОбщиеПараметрыУчетаРасходов.ФинРезультатЕстьУчетПоПодразделениям =
			ИспользоватьУчетПоПодразделениям И ВыборкаФинРезультат.ЕстьУчетПоПодразделениям;
	Иначе
		ОбщиеПараметрыУчетаРасходов.ФинРезультатЕстьУчетПоПодразделениям = Ложь;
	КонецЕсли;
	
	// Проверим наличие учета по подразделениям на счетах расходов 109.ХХ.
	ВыборкаУчетПоПодразделениямБУ = Результат[НомераТаблиц.РасходыБУУчетПоПодразделениям].Выбрать();
	Если ВыборкаУчетПоПодразделениямБУ.Следующий() Тогда
		ОбщиеПараметрыУчетаРасходов.ЗатратыЕстьУчетПоПодразделениям =
			ИспользоватьУчетПоПодразделениям И ВыборкаУчетПоПодразделениямБУ.ЕстьУчетПоПодразделениям;
	Иначе
		ОбщиеПараметрыУчетаРасходов.ЗатратыЕстьУчетПоПодразделениям = Ложь;
	КонецЕсли;
	
	// Проверим наличие доп. субконто в БУ и НУ
	ВыборкаДопАналитикаБУ = Результат[НомераТаблиц.РасходыБУДопСубконто].Выбрать();
	ОбщиеПараметрыУчетаРасходов.ЗатратыЕстьДопСубконтоБУ = ВыборкаДопАналитикаБУ.Следующий();
	
	ВыборкаДопАналитикаНУ = Результат[НомераТаблиц.РасходыНУДопСубконто].Выбрать();
	ОбщиеПараметрыУчетаРасходов.ЗатратыЕстьДопСубконтоНУ = ВыборкаДопАналитикаНУ.Следующий();
	
	// Пока поддерживаем только направления деятельности
	ВидДопСубконто = ПланыВидовХарактеристик.ВидыСубконто.НаправленияДеятельности;
	ОбщиеПараметрыУчетаРасходов.ЗатратыВидДопСубконто = ВидДопСубконто;
	
	Возврат ОбщиеПараметрыУчетаРасходов;
	
КонецФункции

// Возвращает остатки затрат по документам "Списание затрат по услугам" для печати ведомости и контроля остатков.
//
Функция ОстаткиЗатратПоДокументамСписания(ДокументыСписания) Экспорт
	
	Если ТипЗнч(ДокументыСписания) = Тип("Массив") Тогда
		МассивОбъектов = ДокументыСписания;
	ИначеЕсли ТипЗнч(ДокументыСписания) = Тип("ДокументСсылка.ЗакрытиеСчетовБиотрансформации") Тогда
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ДокументыСписания);
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	Запрос = Новый Запрос;
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	
	ОбщиеПараметрыУчетаРасходов = ПолучитьОбщиеПараметрыУчетаРасходов();
	Запрос.УстановитьПараметр("ЗатратыЕстьУчетПоПодразделениям", ОбщиеПараметрыУчетаРасходов.ЗатратыЕстьУчетПоПодразделениям);
	Запрос.УстановитьПараметр("ЗатратыЕстьДопСубконтоБУ",        ОбщиеПараметрыУчетаРасходов.ЗатратыЕстьДопСубконтоБУ);
	Запрос.УстановитьПараметр("ЗатратыЕстьДопСубконтоНУ",        ОбщиеПараметрыУчетаРасходов.ЗатратыЕстьДопСубконтоНУ);
	Запрос.УстановитьПараметр("ЗатратыВидДопСубконто",           ОбщиеПараметрыУчетаРасходов.ЗатратыВидДопСубконто);
	
	Запрос.УстановитьПараметр("ВидСубконтоНоменклатура", ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Запрос.УстановитьПараметр("ВидСубконтоВидыЗатрат",   ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат);
	
	Запрос.Текст = "";
	
	Для Сч=1 По МассивОбъектов.Количество() Цикл
		
		ДокументСписания = МассивОбъектов[Сч-1];
		
		// Остатки затрат будем рассчитывать на конец дня (включительно), поскольку:
		// 1) Заполнение документа производится по остаткам на конец дня.
		// 2) В последнее число месяца в 23:59:59 может попасть регл. операция закрытия счетов производственных затрат,
		//    которая при распределении общих расходов сформирует проводки по Дт 109.ХХ.
		//    Если взять остатки на момент документа, эти движения в ведомости будут отражены как перерасход.
		// Не поддерживается ввод двух и более документов списания одних и тех же затрат в один день, поскольку:
		// 1) Ведомость списания затрат формируется на конкретную дату.
		// 2) Две ведомости списания затрат от одной даты содержали бы разное сальдо по счетам 109.ХХ.
		Запрос.УстановитьПараметр("КонПериода"+Сч, Новый Граница(КонецДня(ДокументСписания.Дата), ВидГраницы.Включая));
		
		Запрос.УстановитьПараметр("Ссылка"+Сч,      ДокументСписания);
		Запрос.УстановитьПараметр("Организация"+Сч, ДокументСписания.Организация);
		Запрос.УстановитьПараметр("КФО"+Сч,         ДокументСписания.КФО);
		Запрос.УстановитьПараметр("ИФО"+Сч,         ДокументСписания.ИФО);
		
		ОтражатьВНалоговомУчете = НалоговыйУчетКлиентСервер.ОтражатьВНалоговомУчете(ДокументСписания.Организация, ДокументСписания.Дата, ДокументСписания.КФО);
		Запрос.УстановитьПараметр("ОтражатьВНалоговомУчете"+Сч, ОтражатьВНалоговомУчете);
		Если ОтражатьВНалоговомУчете Тогда
			Запрос.УстановитьПараметр("СчетаРасходов"+Сч,                        БухгалтерскийУчет.СписокСчетов("110.00,Н20.11,Н20.12,Н25.11,Н25.12,Н26.11,Н26.12,Н44"));
			Запрос.УстановитьПараметр("МассивСчетовСебестоимость"+Сч,            БухгалтерскийУчет.СписокСчетов("110.60,Н20.11,Н20.12"));
			Запрос.УстановитьПараметр("МассивСчетовНакладныеРасходы"+Сч,         БухгалтерскийУчет.СписокСчетов("110.70,Н25.11,Н25.12"));
			Запрос.УстановитьПараметр("МассивСчетовОбщехозяйственныеРасходы"+Сч, БухгалтерскийУчет.СписокСчетов("110.80,Н26.11,Н26.12"));
			Запрос.УстановитьПараметр("МассивСчетовИздержкиОбращения"+Сч,        БухгалтерскийУчет.СписокСчетов("Н44"));
		Иначе
			Запрос.УстановитьПараметр("СчетаРасходов"+Сч,                        БухгалтерскийУчет.СписокСчетов("110.00"));
			Запрос.УстановитьПараметр("МассивСчетовСебестоимость"+Сч,            БухгалтерскийУчет.СписокСчетов("110.60"));
			Запрос.УстановитьПараметр("МассивСчетовНакладныеРасходы"+Сч,         БухгалтерскийУчет.СписокСчетов("110.70"));
			Запрос.УстановитьПараметр("МассивСчетовОбщехозяйственныеРасходы"+Сч, БухгалтерскийУчет.СписокСчетов("110.80"));
			Запрос.УстановитьПараметр("МассивСчетовИздержкиОбращения"+Сч,        Неопределено);
		КонецЕсли;
		
		НомераТаблиц.Вставить("ОстаткиЗатратНаКонецДня"+Сч, НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ
		|	ЕПСБУОстатки.Счет,
		|	ЕСТЬNULL(ЕПСБУОстатки.КПС, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
		|	ЕСТЬNULL(ЕПСБУОстатки.КЭК, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭК,
		|	ВЫБОР
		|		КОГДА &ЗатратыЕстьУчетПоПодразделениям
		|				И ЕПСБУОстатки.Счет.УчетПоПодразделениям
		|			ТОГДА ЕПСБУОстатки.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ВидыСубконто1.ВидСубконто = &ВидСубконтоНоменклатура
		|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.Номенклатура)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	КОНЕЦ КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ВидыСубконто1.ВидСубконто = &ВидСубконтоВидыЗатрат
		|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.ВидыЗатрат)
		|		КОГДА ВидыСубконто2.ВидСубконто = &ВидСубконтоВидыЗатрат
		|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто2 КАК Справочник.ВидыЗатрат)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗатрат.ПустаяСсылка)
		|	КОНЕЦ КАК ВидЗатрат,
		|	ВЫБОР
		|		КОГДА ВидыСубконто2.ВидСубконто = &ЗатратыВидДопСубконто
		|			ТОГДА ЕПСБУОстатки.Субконто2
		|		КОГДА ВидыСубконто3.ВидСубконто = &ЗатратыВидДопСубконто
		|			ТОГДА ЕПСБУОстатки.Субконто3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|	КОНЕЦ КАК ДопСубконто,
		|	ЕПСБУОстатки.СуммаОстатокДт КАК Сумма
		|ПОМЕСТИТЬ ОстаткиЗатратНаКонецДня_N
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
		|			&КонПериода_N,
		|			Счет В (&СчетаРасходов_N),
		|			,
		|			Организация = &Организация_N
		|				И &УсловиеИФО
		|				И КФО = &КФО_N) КАК ЕПСБУОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидыСубконто1
		|		ПО ЕПСБУОстатки.Счет = ВидыСубконто1.Ссылка
		|			И (ВидыСубконто1.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидыСубконто2
		|		ПО ЕПСБУОстатки.Счет = ВидыСубконто2.Ссылка
		|			И (ВидыСубконто2.НомерСтроки = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидыСубконто3
		|		ПО (ВидыСубконто3.НомерСтроки = 3)
		|			И ЕПСБУОстатки.Счет = ВидыСубконто3.Ссылка";
		
		НомераТаблиц.Вставить("СписаноЭтимДокументом"+Сч, НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ЕПСБУДвиженияССубконто.СчетКт КАК Счет,
		|	ЕСТЬNULL(ЕПСБУДвиженияССубконто.КПСКт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
		|	ЕСТЬNULL(ЕПСБУДвиженияССубконто.КЭККт, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭК,
		|	ВЫБОР
		|		КОГДА &ЗатратыЕстьУчетПоПодразделениям
		|				И ЕПСБУДвиженияССубконто.СчетКт.УчетПоПодразделениям
		|			ТОГДА ЕПСБУДвиженияССубконто.ПодразделениеКт
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ЕПСБУДвиженияССубконто.ВидСубконтоКт1 = &ВидСубконтоНоменклатура
		|			ТОГДА ВЫРАЗИТЬ(ЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.Номенклатура)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	КОНЕЦ КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ЕПСБУДвиженияССубконто.ВидСубконтоКт1 = &ВидСубконтоВидыЗатрат
		|			ТОГДА ВЫРАЗИТЬ(ЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.ВидыЗатрат)
		|		КОГДА ЕПСБУДвиженияССубконто.ВидСубконтоКт2 = &ВидСубконтоВидыЗатрат
		|			ТОГДА ВЫРАЗИТЬ(ЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.ВидыЗатрат)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЗатрат.ПустаяСсылка)
		|	КОНЕЦ КАК ВидЗатрат,
		|	ВЫБОР
		|		КОГДА ЕПСБУДвиженияССубконто.ВидСубконтоКт2 = &ЗатратыВидДопСубконто
		|			ТОГДА ЕПСБУДвиженияССубконто.СубконтоКт2
		|		КОГДА ЕПСБУДвиженияССубконто.ВидСубконтоКт3 = &ЗатратыВидДопСубконто
		|			ТОГДА ЕПСБУДвиженияССубконто.СубконтоКт3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|	КОНЕЦ КАК ДопСубконто,
		|	ЕПСБУДвиженияССубконто.Сумма КАК Сумма
		|ПОМЕСТИТЬ СписаноЭтимДокументом_N
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
		|			,
		|			,
		|			Организация = &Организация_N
		|				И &УсловиеИФО
		|				И КФО = &КФО_N
		|				И Регистратор = &Ссылка_N
		|				И СчетКт В (&СчетаРасходов_N),
		|			,
		|			) КАК ЕПСБУДвиженияССубконто";
		
		НомераТаблиц.Вставить("ОстаткиЗатрат"+Сч, НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.Счет В (&МассивСчетовСебестоимость_N)
		|			ТОГДА ""СебестоимостьУслуг""
		|		КОГДА ВложенныйЗапрос.Счет В (&МассивСчетовНакладныеРасходы_N)
		|			ТОГДА ""НакладныеРасходы""
		|		КОГДА ВложенныйЗапрос.Счет В (&МассивСчетовОбщехозяйственныеРасходы_N)
		|			ТОГДА ""ОбщехозяйственныеРасходы""
		|		КОГДА ВложенныйЗапрос.Счет В (&МассивСчетовИздержкиОбращения_N)
		|			ТОГДА ""ИздержкиОбращения""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипЗатрат,
		|	ВложенныйЗапрос.Счет,
		|	ВложенныйЗапрос.КПС,
		|	ВложенныйЗапрос.КЭК,
		|	ВложенныйЗапрос.Подразделение,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ВидЗатрат,
		|	ВложенныйЗапрос.ДопСубконто,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ОстаткиЗатрат_N
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОстаткиЗатратНаКонецДня_N.Счет КАК Счет,
		|		ОстаткиЗатратНаКонецДня_N.КПС КАК КПС,
		|		ОстаткиЗатратНаКонецДня_N.КЭК КАК КЭК,
		|		ОстаткиЗатратНаКонецДня_N.Подразделение КАК Подразделение,
		|		ОстаткиЗатратНаКонецДня_N.Номенклатура КАК Номенклатура,
		|		ОстаткиЗатратНаКонецДня_N.ВидЗатрат КАК ВидЗатрат,
		|		ОстаткиЗатратНаКонецДня_N.ДопСубконто КАК ДопСубконто,
		|		ОстаткиЗатратНаКонецДня_N.Сумма КАК Сумма
		|	ИЗ
		|		ОстаткиЗатратНаКонецДня_N КАК ОстаткиЗатратНаКонецДня_N
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СписаноЭтимДокументом_N.Счет,
		|		СписаноЭтимДокументом_N.КПС,
		|		СписаноЭтимДокументом_N.КЭК,
		|		СписаноЭтимДокументом_N.Подразделение,
		|		СписаноЭтимДокументом_N.Номенклатура,
		|		СписаноЭтимДокументом_N.ВидЗатрат,
		|		СписаноЭтимДокументом_N.ДопСубконто,
		|		СписаноЭтимДокументом_N.Сумма
		|	ИЗ
		|		СписаноЭтимДокументом_N КАК СписаноЭтимДокументом_N) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ВидЗатрат,
		|	ВложенныйЗапрос.КЭК,
		|	ВложенныйЗапрос.ДопСубконто,
		|	ВложенныйЗапрос.Счет,
		|	ВложенныйЗапрос.Подразделение,
		|	ВложенныйЗапрос.КПС";
		
		НомераТаблиц.Вставить("ЗатратыКСписанию"+Сч, НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.ВидУчета,
		|	ВложенныйЗапрос.ТипЗатрат,
		|	ВложенныйЗапрос.УслугаРасход,
		|	ВложенныйЗапрос.СчетКт,
		|	ВложенныйЗапрос.КПСКт,
		|	ВложенныйЗапрос.КЭККт,
		|	ВложенныйЗапрос.ПодразделениеКт,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ВидЗатрат,
		|	ВложенныйЗапрос.ВидЗатрат.Наименование КАК НаименованиеВидаЗатрат,
		|	ВложенныйЗапрос.ВидЗатрат.ВидРасходовНУ КАК ВидРасходовНУ,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоКт2.ВидСубконто = &ЗатратыВидДопСубконто
		|			ТОГДА ВложенныйЗапрос.СубконтоКт2
		|		КОГДА ВидыСубконтоКт3.ВидСубконто = &ЗатратыВидДопСубконто
		|			ТОГДА ВложенныйЗапрос.СубконтоКт3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|	КОНЕЦ КАК ДопСубконто,
		|	ВложенныйЗапрос.СчетДт,
		|	ВложенныйЗапрос.КПСДт,
		|	ВложенныйЗапрос.КЭКДт,
		|	ВложенныйЗапрос.ПодразделениеДт,
		|	ВложенныйЗапрос.СубконтоДт1,
		|	ВложенныйЗапрос.СубконтоДт2,
		|	ВложенныйЗапрос.СубконтоДт3,
		|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
		|	СУММА(ВложенныйЗапрос.СуммаНУ) КАК СуммаНУ
		|ПОМЕСТИТЬ ЗатратыКСписанию_N
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗатратыПрямые.Ссылка КАК Ссылка,
		|		""БУ"" КАК ВидУчета,
		|		""СебестоимостьУслуг"" КАК ТипЗатрат,
		|		ЕСТЬNULL(ЗатратыПрямые.СчетКт.Код, """") + "", "" + (ВЫРАЗИТЬ(ЗатратыПрямые.Номенклатура.Наименование КАК СТРОКА(100))) КАК УслугаРасход,
		|		ЗатратыПрямые.Номенклатура КАК Номенклатура,
		|		ЗатратыПрямые.ВидЗатрат КАК ВидЗатрат,
		|		ЗатратыПрямые.СчетДт КАК СчетДт,
		|		ЗатратыПрямые.КПСДт КАК КПСДт,
		|		ЗатратыПрямые.КЭКДт КАК КЭКДт,
		|		ЗатратыПрямые.ПодразделениеДт КАК ПодразделениеДт,
		|		ЗатратыПрямые.СубконтоДт1 КАК СубконтоДт1,
		|		ЗатратыПрямые.СубконтоДт2 КАК СубконтоДт2,
		|		ЗатратыПрямые.СубконтоДт3 КАК СубконтоДт3,
		|		ЗатратыПрямые.СчетКт КАК СчетКт,
		|		ЗатратыПрямые.КПСКт КАК КПСКт,
		|		ЗатратыПрямые.КЭККт КАК КЭККт,
		|		ЗатратыПрямые.ПодразделениеКт КАК ПодразделениеКт,
		|		НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|		ЗатратыПрямые.СубконтоКт3 КАК СубконтоКт3,
		|		ЗатратыПрямые.Сумма КАК Сумма,
		|		0 КАК СуммаНУ
		|	ИЗ
		|		Документ.ЗакрытиеСчетовБиотрансформации.ЗатратыПрямые КАК ЗатратыПрямые
		|	ГДЕ
		|		ЗатратыПрямые.Ссылка = &Ссылка_N
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗатратыОбщие.Ссылка,
		|		""БУ"",
		|		ВЫБОР
		|			КОГДА ЗатратыОбщие.СчетКт В (&МассивСчетовНакладныеРасходы_N)
		|				ТОГДА ""НакладныеРасходы""
		|			КОГДА ЗатратыОбщие.СчетКт В (&МассивСчетовОбщехозяйственныеРасходы_N)
		|				ТОГДА ""ОбщехозяйственныеРасходы""
		|			КОГДА ЗатратыОбщие.СчетКт В (&МассивСчетовИздержкиОбращения_N)
		|				ТОГДА ""ИздержкиОбращения""
		|			ИНАЧЕ """"
		|		КОНЕЦ,
		|		ЕСТЬNULL(ЗатратыОбщие.СчетКт.Код, """") + ВЫБОР
		|			КОГДА ЗатратыОбщие.СчетКт В (&МассивСчетовНакладныеРасходы_N)
		|				ТОГДА "", Накладные расходы""
		|			КОГДА ЗатратыОбщие.СчетКт В (&МассивСчетовОбщехозяйственныеРасходы_N)
		|				ТОГДА "", Общехозяйственные расходы""
		|			КОГДА ЗатратыОбщие.СчетКт В (&МассивСчетовИздержкиОбращения_N)
		|				ТОГДА "", Издержки обращения""
		|			ИНАЧЕ """"
		|		КОНЕЦ,
		|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		|		ЗатратыОбщие.ВидЗатрат,
		|		ЗатратыОбщие.СчетДт,
		|		ЗатратыОбщие.КПСДт,
		|		ЗатратыОбщие.КЭКДт,
		|		ЗатратыОбщие.ПодразделениеДт,
		|		ЗатратыОбщие.СубконтоДт1,
		|		ЗатратыОбщие.СубконтоДт2,
		|		ЗатратыОбщие.СубконтоДт3,
		|		ЗатратыОбщие.СчетКт,
		|		ЗатратыОбщие.КПСКт,
		|		ЗатратыОбщие.КЭККт,
		|		ЗатратыОбщие.ПодразделениеКт,
		|		ЗатратыОбщие.СубконтоКт2,
		|		ЗатратыОбщие.СубконтоКт3,
		|		ЗатратыОбщие.Сумма,
		|		0
		|	ИЗ
		|		Документ.ЗакрытиеСчетовБиотрансформации.ЗатратыОбщие КАК ЗатратыОбщие
		|	ГДЕ
		|		ЗатратыОбщие.Ссылка = &Ссылка_N
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗатратыНУ.Ссылка,
		|		""НУ"",
		|		ВЫБОР
		|			КОГДА ЗатратыНУ.СчетКт В (&МассивСчетовСебестоимость_N)
		|				ТОГДА ""СебестоимостьУслуг""
		|			КОГДА ЗатратыНУ.СчетКт В (&МассивСчетовНакладныеРасходы_N)
		|				ТОГДА ""НакладныеРасходы""
		|			КОГДА ЗатратыНУ.СчетКт В (&МассивСчетовОбщехозяйственныеРасходы_N)
		|				ТОГДА ""ОбщехозяйственныеРасходы""
		|			КОГДА ЗатратыНУ.СчетКт В (&МассивСчетовИздержкиОбращения_N)
		|				ТОГДА ""ИздержкиОбращения""
		|			ИНАЧЕ """"
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА ЗатратыНУ.СчетКт В (&МассивСчетовСебестоимость_N)
		|				ТОГДА ""Н20, "" + (ВЫРАЗИТЬ(ЗатратыНУ.Номенклатура.Наименование КАК СТРОКА(100)))
		|			КОГДА ЗатратыНУ.СчетКт В (&МассивСчетовНакладныеРасходы_N)
		|				ТОГДА ""Н25, Накладные расходы""
		|			КОГДА ЗатратыНУ.СчетКт В (&МассивСчетовОбщехозяйственныеРасходы_N)
		|				ТОГДА ""Н26, Общехозяйственные расходы""
		|			КОГДА ЗатратыНУ.СчетКт В (&МассивСчетовИздержкиОбращения_N)
		|				ТОГДА ""Н44, Издержки обращения""
		|			ИНАЧЕ """"
		|		КОНЕЦ,
		|		ЗатратыНУ.Номенклатура,
		|		ЗатратыНУ.ВидЗатрат,
		|		ЗатратыНУ.СчетДт,
		|		ЗатратыНУ.КПСДт,
		|		ЗатратыНУ.КЭКДт,
		|		ЗатратыНУ.ПодразделениеДт,
		|		ЗатратыНУ.СубконтоДт1,
		|		ЗатратыНУ.СубконтоДт2,
		|		ЗатратыНУ.СубконтоДт3,
		|		ЗатратыНУ.СчетКт,
		|		ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка),
		|		ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка),
		|		ЗатратыНУ.ПодразделениеКт,
		|		ЗатратыНУ.СубконтоКт2,
		|		ЗатратыНУ.СубконтоКт3,
		|		0,
		|		ЗатратыНУ.Сумма
		|	ИЗ
		|		Документ.ЗакрытиеСчетовБиотрансформации.ЗатратыНУ КАК ЗатратыНУ
		|	ГДЕ
		|		ЗатратыНУ.Ссылка = &Ссылка_N
		|		И &ОтражатьВНалоговомУчете_N) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидыСубконтоКт2
		|		ПО ВложенныйЗапрос.СчетКт = ВидыСубконтоКт2.Ссылка
		|			И (ВидыСубконтоКт2.НомерСтроки = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидыСубконтоКт3
		|		ПО ВложенныйЗапрос.СчетКт = ВидыСубконтоКт3.Ссылка
		|			И (ВидыСубконтоКт3.НомерСтроки = 3)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.ВидУчета,
		|	ВложенныйЗапрос.ТипЗатрат,
		|	ВложенныйЗапрос.УслугаРасход,
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ВидЗатрат,
		|	ВложенныйЗапрос.ВидЗатрат.ВидРасходовНУ,
		|	ВложенныйЗапрос.ВидЗатрат.Наименование,
		|	ВложенныйЗапрос.СчетДт,
		|	ВложенныйЗапрос.КПСДт,
		|	ВложенныйЗапрос.КЭКДт,
		|	ВложенныйЗапрос.ПодразделениеДт,
		|	ВложенныйЗапрос.СубконтоДт1,
		|	ВложенныйЗапрос.СубконтоДт2,
		|	ВложенныйЗапрос.СубконтоДт3,
		|	ВложенныйЗапрос.СчетКт,
		|	ВложенныйЗапрос.КПСКт,
		|	ВложенныйЗапрос.КЭККт,
		|	ВложенныйЗапрос.ПодразделениеКт,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоКт2.ВидСубконто = &ЗатратыВидДопСубконто
		|			ТОГДА ВложенныйЗапрос.СубконтоКт2
		|		КОГДА ВидыСубконтоКт3.ВидСубконто = &ЗатратыВидДопСубконто
		|			ТОГДА ВложенныйЗапрос.СубконтоКт3
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
		|	КОНЕЦ";
		
		НомераТаблиц.Вставить("ЗатратыПоДокументуСписания"+Сч, НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ЗатратыКСписанию_N.Ссылка КАК Ссылка,
		|	ЗатратыКСписанию_N.ВидУчета КАК ВидУчета,
		|	ЗатратыКСписанию_N.ТипЗатрат КАК ТипЗатрат,
		|	ЗатратыКСписанию_N.УслугаРасход КАК УслугаРасход,
		|	ЗатратыКСписанию_N.Номенклатура КАК Номенклатура,
		|	ЗатратыКСписанию_N.ВидЗатрат КАК ВидЗатрат,
		|	ЗатратыКСписанию_N.ДопСубконто КАК ДопСубконто,
		|	ЗатратыКСписанию_N.СчетКт КАК СчетКт,
		|	ЗатратыКСписанию_N.КПСКт КАК КПСКт,
		|	ЗатратыКСписанию_N.КЭККт КАК КЭККт,
		|	ЗатратыКСписанию_N.ПодразделениеКт КАК ПодразделениеКт,
		|	ЗатратыКСписанию_N.СчетДт КАК СчетДт,
		|	ЗатратыКСписанию_N.КПСДт КАК КПСДт,
		|	ЗатратыКСписанию_N.КЭКДт КАК КЭКДт,
		|	ЗатратыКСписанию_N.ПодразделениеДт КАК ПодразделениеДт,
		|	ЗатратыКСписанию_N.СубконтоДт1 КАК СубконтоДт1,
		|	ЗатратыКСписанию_N.СубконтоДт2 КАК СубконтоДт2,
		|	ЗатратыКСписанию_N.СубконтоДт3 КАК СубконтоДт3,
		|	ЗатратыКСписанию_N.Сумма КАК СуммаКСписанию,
		|	ЗатратыКСписанию_N.СуммаНУ КАК СуммаКСписаниюНУ
		|ИЗ
		|	ЗатратыКСписанию_N КАК ЗатратыКСписанию_N
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидУчета,
		|	УслугаРасход,
		|	ЗатратыКСписанию_N.ВидЗатрат.Наименование";
		
		НомераТаблиц.Вставить("ЗатратыПоДаннымУчета"+Сч, НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ЗатратыКСписанию_N.Ссылка КАК Ссылка,
		|	ЗатратыКСписанию_N.ВидУчета КАК ВидУчета,
		|	ЗатратыКСписанию_N.ТипЗатрат КАК ТипЗатрат,
		|	ЗатратыКСписанию_N.УслугаРасход КАК УслугаРасход,
		|	ЗатратыКСписанию_N.Номенклатура КАК Номенклатура,
		|	ЗатратыКСписанию_N.ВидЗатрат КАК ВидЗатрат,
		|	ЗатратыКСписанию_N.ВидРасходовНУ КАК ВидРасходовНУ,
		|	ЗатратыКСписанию_N.ДопСубконто КАК ДопСубконто,
		|	ЗатратыКСписанию_N.СчетКт КАК СчетКт,
		|	ЗатратыКСписанию_N.КПСКт КАК КПСКт,
		|	ЗатратыКСписанию_N.КЭККт КАК КЭККт,
		|	ЗатратыКСписанию_N.ПодразделениеКт КАК ПодразделениеКт,
		|	ЗатратыКСписанию_N.Сумма КАК СуммаКСписанию,
		|	ЗатратыКСписанию_N.СуммаНУ КАК СуммаКСписаниюНУ,
		|	ЕСТЬNULL(ОстаткиЗатрат_N.Сумма, 0) КАК СуммаОстаток
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗатратыКСписанию_N.Ссылка КАК Ссылка,
		|		ЗатратыКСписанию_N.ВидУчета КАК ВидУчета,
		|		ЗатратыКСписанию_N.ТипЗатрат КАК ТипЗатрат,
		|		ЗатратыКСписанию_N.УслугаРасход КАК УслугаРасход,
		|		ЗатратыКСписанию_N.Номенклатура КАК Номенклатура,
		|		ЗатратыКСписанию_N.ВидЗатрат КАК ВидЗатрат,
		|		ЗатратыКСписанию_N.НаименованиеВидаЗатрат КАК НаименованиеВидаЗатрат,
		|		ЗатратыКСписанию_N.ВидРасходовНУ КАК ВидРасходовНУ,
		|		ЗатратыКСписанию_N.ДопСубконто КАК ДопСубконто,
		|		ЗатратыКСписанию_N.СчетКт КАК СчетКт,
		|		ЗатратыКСписанию_N.КПСКт КАК КПСКт,
		|		ЗатратыКСписанию_N.КЭККт КАК КЭККт,
		|		ЗатратыКСписанию_N.ПодразделениеКт КАК ПодразделениеКт,
		|		СУММА(ЗатратыКСписанию_N.Сумма) КАК Сумма,
		|		СУММА(ЗатратыКСписанию_N.СуммаНУ) КАК СуммаНУ
		|	ИЗ
		|		ЗатратыКСписанию_N КАК ЗатратыКСписанию_N
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗатратыКСписанию_N.ДопСубконто,
		|		ЗатратыКСписанию_N.СчетКт,
		|		ЗатратыКСписанию_N.КЭККт,
		|		ЗатратыКСписанию_N.Ссылка,
		|		ЗатратыКСписанию_N.Номенклатура,
		|		ЗатратыКСписанию_N.ВидЗатрат,
		|		ЗатратыКСписанию_N.НаименованиеВидаЗатрат,
		|		ЗатратыКСписанию_N.ВидРасходовНУ,
		|		ЗатратыКСписанию_N.УслугаРасход,
		|		ЗатратыКСписанию_N.ВидУчета,
		|		ЗатратыКСписанию_N.КПСКт,
		|		ЗатратыКСписанию_N.ПодразделениеКт,
		|		ЗатратыКСписанию_N.ТипЗатрат) КАК ЗатратыКСписанию_N
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиЗатрат_N КАК ОстаткиЗатрат_N
		|		ПО ЗатратыКСписанию_N.СчетКт = ОстаткиЗатрат_N.Счет
		|			И ЗатратыКСписанию_N.КПСКт = ОстаткиЗатрат_N.КПС
		|			И ЗатратыКСписанию_N.КЭККт = ОстаткиЗатрат_N.КЭК
		|			И ЗатратыКСписанию_N.ПодразделениеКт = ОстаткиЗатрат_N.Подразделение
		|			И ЗатратыКСписанию_N.Номенклатура = ОстаткиЗатрат_N.Номенклатура
		|			И ЗатратыКСписанию_N.ВидЗатрат = ОстаткиЗатрат_N.ВидЗатрат
		|			И ЗатратыКСписанию_N.ДопСубконто = ОстаткиЗатрат_N.ДопСубконто
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидУчета,
		|	УслугаРасход,
		|	ЗатратыКСписанию_N.НаименованиеВидаЗатрат
		|ИТОГИ
		|	СУММА(СуммаКСписанию),
		|	СУММА(СуммаКСписаниюНУ),
		|	СУММА(СуммаОстаток)
		|ПО
		|	ВидУчета,
		|	ТипЗатрат,
		|	Номенклатура,
		|	УслугаРасход";
		
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета();
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", ?(ИспользоватьУчетПоИФО, "ИФО = &ИФО_N", "ИСТИНА"));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "_N", Строка(Сч)); // проставим номер объекта в тексте запроса
		
	КонецЦикла;
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОстаткиЗатрат = Новый Структура;
	Для Сч=1 По МассивОбъектов.Количество() Цикл
		
		ОстаткиЗатрат.Вставить("ЗатратыПоДокументуСписания"+Сч,
			Результат[НомераТаблиц["ЗатратыПоДокументуСписания"+Сч]] );
		
		ОстаткиЗатрат.Вставить("ЗатратыПоДаннымУчета"+Сч,
			Результат[НомераТаблиц["ЗатратыПоДаннымУчета"+Сч]] );
		
	КонецЦикла;
	
	Возврат ОстаткиЗатрат;
	
КонецФункции

// Возвращает таблицу остатков накопленных расходов на оказание услуг, выполнение работ
//
Функция ОстаткиЗатратНаОказаниеУслуг(Период, Организация, ИФО, КФО, МассивУслуг = Неопределено) Экспорт
	
	НомераТаблиц = Новый Структура;
	
	// Формируем запрос по остаткам затрат
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕПСБУОстатки.Счет КАК Счет,
	|	ЕПСБУОстатки.КПС КАК КПС,
	|	ЕПСБУОстатки.КЭК КАК КЭК,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|				И ЕПСБУОстатки.Счет.УчетПоПодразделениям
	|			ТОГДА ЕПСБУОстатки.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ЕПСБУОстатки.Субконто1 КАК Субконто1,
	|	ЕПСБУОстатки.Субконто2 КАК Субконто2,
	|	ЕПСБУОстатки.Субконто3 КАК Субконто3,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто2 КАК Справочник.ВидыЗатрат) КАК ВидЗатрат,
	|	ПРЕДСТАВЛЕНИЕ(ЕПСБУОстатки.Субконто1) КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ЕПСБУОстатки.Субконто2) КАК ВидЗатратПредставление,
	|	ЕПСБУОстатки.СуммаОстатокДт КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&КонПериода,
	|			Счет В (&СчетаРасходовБУ),
	|			,
	|			Организация = &Организация
	|				И &УсловиеИФО
	|				И КФО = &КФО
	|				И &ОтборУслуг) КАК ЕПСБУОстатки";
	
	НомераТаблиц.Вставить("ТаблицаЗатратБУ", НомераТаблиц.Количество());
	
	ОтражатьВНалоговомУчете = НалоговыйУчетКлиентСервер.ОтражатьВНалоговомУчете(Организация, Период, КФО);
	Если ОтражатьВНалоговомУчете Тогда
		
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ЕПСБУОстатки.Счет КАК Счет,
		|	ЕПСБУОстатки.Субконто1 КАК Субконто1,
		|	ЕПСБУОстатки.Субконто2 КАК Субконто2,
		|	ЕПСБУОстатки.Субконто3 КАК Субконто3,
		|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто2 КАК Справочник.ВидыЗатрат) КАК ВидЗатрат,
		|	ПРЕДСТАВЛЕНИЕ(ЕПСБУОстатки.Субконто1) КАК НоменклатураПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ЕПСБУОстатки.Субконто2) КАК ВидЗатратПредставление,
		|	ЕПСБУОстатки.СуммаОстатокДт КАК Сумма,
		|	ЕПСБУОстатки.СуммаЕНВДОстатокДт КАК СуммаЕНВД,
		|	ЕПСБУОстатки.СуммаНеУчитываетсяНУОстатокДт КАК СуммаНеУчитываетсяНУ
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
		|			&КонПериода,
		|			Счет В (&СчетаРасходовНУ),
		|			,
		|			Организация = &Организация
		|				И &УсловиеИФО
		|				И КФО = &КФО
		|				И &ОтборУслуг) КАК ЕПСБУОстатки";
		
		НомераТаблиц.Вставить("ТаблицаЗатратНУ", НомераТаблиц.Количество());
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КонПериода",           Период);
	Запрос.УстановитьПараметр("Организация",          Организация);
	Запрос.УстановитьПараметр("КФО",                  КФО);
	Запрос.УстановитьПараметр("УчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО",
		?(ИспользоватьУчетПоИФО, "ИФО = &ИФО", "ИСТИНА"));
	Запрос.УстановитьПараметр("ИФО", ИФО);
	
	Если МассивУслуг = Неопределено Тогда
		
		УслугиРаботы = Новый Массив;
		УслугиРаботы.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
		УслугиРаботы.Добавить(Перечисления.ТипыНоменклатуры.Работа);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборУслуг", "ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.Номенклатура).ТипНоменклатуры В (&УслугиРаботы)");
		Запрос.УстановитьПараметр("УслугиРаботы", УслугиРаботы);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборУслуг", "Субконто1 В (&МассивУслуг)");
		Запрос.УстановитьПараметр("МассивУслуг", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(МассивУслуг));
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СчетаРасходовБУ", БухгалтерскийУчет.СписокСчетов("109.60"));
	Запрос.УстановитьПараметр("СчетаРасходовНУ", БухгалтерскийУчет.СписокСчетов("Н20.11,Н20.21"));
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаЗатратБУ = Результат[НомераТаблиц.ТаблицаЗатратБУ].Выгрузить();
	ТаблицаЗатратБУ.Сортировать("Счет,НоменклатураПредставление,ВидЗатратПредставление");
	
	Если ОтражатьВНалоговомУчете Тогда
		ТаблицаЗатратНУ = Результат[НомераТаблиц.ТаблицаЗатратНУ].Выгрузить();
		ТаблицаЗатратНУ.Сортировать("Счет,НоменклатураПредставление,ВидЗатратПредставление");
	Иначе
		ТаблицаЗатратНУ = Новый ТаблицаЗначений;
	КонецЕсли;
	
	ОстаткиЗатрат = Новый Структура("ТаблицаЗатратБУ, ТаблицаЗатратНУ", ТаблицаЗатратБУ, ТаблицаЗатратНУ);
	
	Возврат ОстаткиЗатрат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("РаспределениеОбщихЗатрат", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РаспределениеОбщихЗатрат.Ссылка.Дата КАК ПериодРасчета,
	|	РаспределениеОбщихЗатрат.Ссылка.Организация,
	|	РаспределениеОбщихЗатрат.ИФО,
	|	РаспределениеОбщихЗатрат.КФО,
	|	РаспределениеОбщихЗатрат.Подразделение,
	|	ВЫБОР
	|		КОГДА РаспределениеОбщихЗатрат.СчетУчета В (&СчетаОбщепроизводственныхЗатрат)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбщихЗатратНаПроизводство.ОбщепроизводственныеЗатраты)
	|		КОГДА РаспределениеОбщихЗатрат.СчетУчета В (&СчетаОбщехозяйственныхЗатрат)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОбщихЗатратНаПроизводство.ОбщехозяйственныеЗатраты)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОбщихЗатратНаПроизводство.ПустаяСсылка)
	|	КОНЕЦ КАК ВидОбщихЗатрат,
	|	РаспределениеОбщихЗатрат.ВидЗатрат,
	|	РаспределениеОбщихЗатрат.КЭК,
	|	РаспределениеОбщихЗатрат.СчетУчета,
	|	РаспределениеОбщихЗатрат.КПС,
	|	РаспределениеОбщихЗатрат.НаправлениеДеятельности,
	|	РаспределениеОбщихЗатрат.КорСчет,
	|	РаспределениеОбщихЗатрат.КорКПС,
	|	РаспределениеОбщихЗатрат.КорНоменклатурнаяГруппа,
	|	РаспределениеОбщихЗатрат.КорПодразделение,
	|	РаспределениеОбщихЗатрат.КорНаправлениеДеятельности,
	|	РаспределениеОбщихЗатрат.Сумма,
	|	РаспределениеОбщихЗатрат.СуммаЕНВД,
	|	РаспределениеОбщихЗатрат.СуммаНеУчитываетсяНУ,
	|	РаспределениеОбщихЗатрат.СуммаБазы,
	|	РаспределениеОбщихЗатрат.СуммаБазыЕНВД,
	|	РаспределениеОбщихЗатрат.СуммаБазыНеУчитываетсяНУ,
	|	РаспределениеОбщихЗатрат.БазаРаспределения
	|ИЗ
	|	Документ.ЗакрытиеСчетовБиотрансформации.РаспределениеОбщихЗатрат КАК РаспределениеОбщихЗатрат
	|ГДЕ
	|	РаспределениеОбщихЗатрат.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	РаспределениеОбщихЗатрат.НомерСтроки";
	
	Запрос.УстановитьПараметр("СчетаОбщепроизводственныхЗатрат",
		БухгалтерскийУчет.СписокСчетов("110.70,Н25"));
	Запрос.УстановитьПараметр("СчетаОбщехозяйственныхЗатрат",
		БухгалтерскийУчет.СписокСчетов("110.80,Н26")); 
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаРаспределениеОбщихЗатрат         = Результат[НомераТаблиц["РаспределениеОбщихЗатрат"]].Выгрузить();
	
	ТаблицаРаспределениеОбщихЗатрат.Свернуть("ПериодРасчета,Организация,ИФО,КФО,Подразделение,
		|ВидОбщихЗатрат,ВидЗатрат,КЭК,СчетУчета,КПС,НаправлениеДеятельности,
		|КорСчет,КорКПС,КорНоменклатурнаяГруппа,КорПодразделение,КорНаправлениеДеятельности,БазаРаспределения",
		"Сумма,СуммаЕНВД,СуммаНеУчитываетсяНУ,СуммаБазы,СуммаБазыЕНВД,СуммаБазыНеУчитываетсяНУ");
	
	ТаблицыДляДвижений.Вставить("РасчетРаспределенияОбщихЗатрат", ТаблицаРаспределениеОбщихЗатрат);
	
КонецПроцедуры

// Структура таблицы источника данных "Фактическая стоимость выпущенной продукции".
//
Функция ПустаяТаблицаФактическаяСтоимостьПродукции() Экспорт

	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО", Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	// Счет и аналитика учета себестоимости готовой продукции (затраты).
	ПустаяТаблица.Колонки.Добавить("СчетСебестоимости",          Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("КПССебестоимости",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("ПодразделениеСебестоимости", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ПустаяТаблица.Колонки.Добавить("НоменклатурнаяГруппа",       Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПустаяТаблица.Колонки.Добавить("НаправлениеДеятельности",    Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"));
	ПустаяТаблица.Колонки.Добавить("ВидЗатрат",                  Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
	ПустаяТаблица.Колонки.Добавить("КЭК",                        Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	// Счет и аналитика учета готовой продукции (материальные запасы).
	ПустаяТаблица.Колонки.Добавить("СчетГотовойПродукции",          Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("КПСГотовойПродукции",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("КЭКГотовойПродукции",           Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("ПодразделениеГотовойПродукции", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ПустаяТаблица.Колонки.Добавить("Номенклатура",                  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	// Количество и сумма поступивших единиц.
	ПустаяТаблица.Колонки.Добавить("Количество",           ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("ФактическаяСтоимость", ОписаниеТипаСуммы);
	
	Возврат ПустаяТаблица;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполнить документ - рассчитать все необходимые таблицы.
// 
// Параметры:
//  Документ - ДокументОбъект.ЗакрытиеСчетовБиотрансформации
//           - ДанныеФормыСтруктура
Процедура ЗаполнитьДокумент(Документ) Экспорт
	
	Обработка = Обработки.ЗакрытиеСчетовПроизводственныхЗатрат.ИнициализироватьОбработку(Документ.Дата,
		Документ.Организация, Документ.ИФО, Документ.КФО, Ложь, Истина);
	Обработка.ОтражатьВБухгалтерскомУчете = Документ.ОтражатьВБухгалтерскомУчете;
	Обработка.ОтражатьВНалоговомУчете = Документ.ОтражатьВНалоговомУчете;
	
	// Выполнить полный расчет
	Обработка.ЗаполнитьДокумент();
	
	// Перенести все заполненные данные из обработки в документ
	Обработки.ЗакрытиеСчетовПроизводственныхЗатрат.ПеренестиТабличнуюЧастьИзОбработкиВДокумент(Обработка, Документ, 
		"РаспределениеОбщихЗатрат");
	Обработки.ЗакрытиеСчетовПроизводственныхЗатрат.ПеренестиТабличнуюЧастьИзОбработкиВДокумент(Обработка, Документ, 
		"ЗатратыПрямые");
	Обработки.ЗакрытиеСчетовПроизводственныхЗатрат.ПеренестиТабличнуюЧастьИзОбработкиВДокумент(Обработка, Документ, 
		"ЗатратыОбщие");
	Обработки.ЗакрытиеСчетовПроизводственныхЗатрат.ПеренестиТабличнуюЧастьИзОбработкиВДокумент(Обработка, Документ, 
		"ЗатратыНУ");
	
КонецПроцедуры


// Заполнить распределение общих затрат.
// 
// Параметры:
//  Документ - ДокументОбъект.ЗакрытиеСчетовБиотрансформации
//           - ДанныеФормыСтруктура
Процедура ЗаполнитьРаспределениеОбщихЗатрат(Документ) Экспорт
	
	Обработка = Обработки.ЗакрытиеСчетовПроизводственныхЗатрат.ИнициализироватьОбработку(Документ.Дата,
		Документ.Организация, Документ.ИФО, Документ.КФО, Ложь, Истина);
	Обработка.ОтражатьВБухгалтерскомУчете = Документ.ОтражатьВБухгалтерскомУчете;
	Обработка.ОтражатьВНалоговомУчете = Документ.ОтражатьВНалоговомУчете;
	Обработка.РаспределитьОбщиеЗатраты();
	
	// Перенести результат заполнения в документ
	Документ.РаспределениеОбщихЗатрат.Очистить();
	Для Каждого СтрокаОбработки Из Обработка.РаспределениеОбщихЗатрат Цикл
		ЗаполнитьЗначенияСвойств(Документ.РаспределениеОбщихЗатрат.Добавить(), СтрокаОбработки);
	КонецЦикла;
	
КонецПроцедуры


// Заполняет документ остатками затрат по счетам учета затрат
// 
// Параметры:
//  Документ - ДокументОбъект.ЗакрытиеСчетовБиотрансформации
//           - ДанныеФормыСтруктура
Процедура ЗаполнитьДокументПоОстаткам(Документ) Экспорт

	Обработка = Обработки.ЗакрытиеСчетовПроизводственныхЗатрат.ИнициализироватьОбработку(Документ.Дата,
		Документ.Организация, Документ.ИФО, Документ.КФО, Ложь, Истина);
	Обработка.ОтражатьВБухгалтерскомУчете = Документ.ОтражатьВБухгалтерскомУчете;
	Обработка.ОтражатьВНалоговомУчете = Документ.ОтражатьВНалоговомУчете;
	Обработка.ЗаполнитьОбщиеЗатраты(Документ.РаспределениеОбщихЗатрат);

	МеткаВремениНачалоЗаполнения = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Обработка.ЗаполнитьСписаниеПрямыхЗатрат();
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("ЗаполнениеДокументаЗакрытиеСчетовБиотрансформации", МеткаВремениНачалоЗаполнения);
	
	Документ.ЗатратыПрямые.Загрузить(Обработка.СписаниеПрямыхЗатрат.Выгрузить());
	Документ.ЗатратыОбщие.Загрузить(Обработка.СписаниеОбщихЗатрат.Выгрузить());
	Документ.ЗатратыНУ.Загрузить(Обработка.СписаниеЗатратНУ.Выгрузить());
	
КонецПроцедуры

// Формирует сводную и детальные (отдельно для БУ и НУ) таблицы затрат по табличным частям документа
// 
// Параметры:
// 	Документ - ДанныеФормыСтруктура
// 			 - ДокументОбъект.ЗакрытиеСчетовБиотрансформации
//
Функция ПолучитьСводнуюИДетальныеТаблицыЗатратПоТабЧастям(Документ) Экспорт
	
	ОписаниеТиповСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	
	ЗатратыСводно = Новый ТаблицаЗначений;
	ЗатратыСводно.Колонки.Добавить("КлючСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ЗатратыСводно.Колонки.Добавить("ТипЗатрат",    ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ЗатратыСводно.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ЗатратыСводно.Колонки.Добавить("УслугаРасход", Новый ОписаниеТипов("Строка"));
	Если Документ.РежимОтображения = 1 Тогда // По разделам/подразделам КПС затрат.
		ЗатратыСводно.Колонки.Добавить("КПСКт",    ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(4));
	ИначеЕсли Документ.РежимОтображения = 2 Тогда // По КПС затрат.
		ЗатратыСводно.Колонки.Добавить("КПСКт",    Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	КонецЕсли;
	ЗатратыСводно.Колонки.Добавить("СчетДт",                     Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ЗатратыСводно.Колонки.Добавить("КПСДт",                      Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ЗатратыСводно.Колонки.Добавить("КЭКДт",                      Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ЗатратыСводно.Колонки.Добавить("ПодразделениеДт",            Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ЗатратыСводно.Колонки.Добавить("СубконтоДт1",                ОписаниеТиповСубконто);
	ЗатратыСводно.Колонки.Добавить("СубконтоДт2",                ОписаниеТиповСубконто);
	ЗатратыСводно.Колонки.Добавить("СубконтоДт3",                ОписаниеТиповСубконто);
	ЗатратыСводно.Колонки.Добавить("СубконтоДт1Доступность",     Новый ОписаниеТипов("Булево"));
	ЗатратыСводно.Колонки.Добавить("СубконтоДт2Доступность",     Новый ОписаниеТипов("Булево"));
	ЗатратыСводно.Колонки.Добавить("СубконтоДт3Доступность",     Новый ОписаниеТипов("Булево"));
	ЗатратыСводно.Колонки.Добавить("ПодразделениеДтДоступность", Новый ОписаниеТипов("Булево"));
	ЗатратыСводно.Колонки.Добавить("ПодразделениеДтОбязательно", Новый ОписаниеТипов("Булево"));
	ЗатратыСводно.Колонки.Добавить("СчетДт40120",                Новый ОписаниеТипов("Булево"));
	ЗатратыСводно.Колонки.Добавить("ПодразделениеКтНеЗаполнено", Новый ОписаниеТипов("Булево"));
	ЗатратыСводно.Колонки.Добавить("Сумма",                      ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(15, 3));
	ЗатратыСводно.Колонки.Добавить("СуммаНУ",                    ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(15, 3));
	ЗатратыСводно.Колонки.Добавить("СуммаЕНВД",                  ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(15, 3));
	ЗатратыСводно.Колонки.Добавить("СуммаНеУчитываетсяНУ",       ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(15, 3));
	
	ЗатратыДетально = Новый ТаблицаЗначений;
	ЗатратыДетально.Колонки.Добавить("КлючСтроки",                 ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ЗатратыДетально.Колонки.Добавить("ВидЗатрат",                  Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
	ЗатратыДетально.Колонки.Добавить("ДопСубконто",                ОписаниеТиповСубконто);
	ЗатратыДетально.Колонки.Добавить("ДопСубконтоДоступность",     Новый ОписаниеТипов("Булево"));
	ЗатратыДетально.Колонки.Добавить("СчетКт",                     Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ЗатратыДетально.Колонки.Добавить("КПСКт",                      Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ЗатратыДетально.Колонки.Добавить("КЭККт",                      Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ЗатратыДетально.Колонки.Добавить("ПодразделениеКт",            Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ЗатратыДетально.Колонки.Добавить("ПодразделениеКтДоступность", Новый ОписаниеТипов("Булево"));
	ЗатратыДетально.Колонки.Добавить("Сумма",                      ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(15, 3));
	
	ЗатратыДетальноНУ = Новый ТаблицаЗначений;
	ЗатратыДетальноНУ.Колонки.Добавить("КлючСтроки",                 ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ЗатратыДетальноНУ.Колонки.Добавить("ВидЗатрат",                  Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
	ЗатратыДетальноНУ.Колонки.Добавить("ДопСубконто",                ОписаниеТиповСубконто);
	ЗатратыДетальноНУ.Колонки.Добавить("ДопСубконтоДоступность",     Новый ОписаниеТипов("Булево"));
	ЗатратыДетальноНУ.Колонки.Добавить("СчетКт",                     Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ЗатратыДетальноНУ.Колонки.Добавить("ПодразделениеКт",            Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ЗатратыДетальноНУ.Колонки.Добавить("ПодразделениеКтДоступность", Новый ОписаниеТипов("Булево"));
	ЗатратыДетальноНУ.Колонки.Добавить("Сумма",                      ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(15, 3));
	ЗатратыДетальноНУ.Колонки.Добавить("СуммаЕНВД",                  ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(15, 3));
	ЗатратыДетальноНУ.Колонки.Добавить("СуммаНеУчитываетсяНУ",       ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(15, 3));
	
	МассивСчетовСебестоимость            = БухгалтерскийУчет.СписокСчетов("110.60,Н20", Документ.Дата, Ложь, Документ.Организация);
	МассивСчетовНакладныеРасходы         = БухгалтерскийУчет.СписокСчетов("110.70,Н25", Документ.Дата, Ложь, Документ.Организация);
	МассивСчетовОбщехозяйственныеРасходы = БухгалтерскийУчет.СписокСчетов("110.80,Н26", Документ.Дата, Ложь, Документ.Организация);
	МассивСчетовИздержкиОбращения        = БухгалтерскийУчет.СписокСчетов("109.90,Н44", Документ.Дата, Ложь, Документ.Организация);
	МассивСчетов40120                    = БухгалтерскийУчет.СписокСчетов("401.20", Документ.Дата, Ложь, Документ.Организация);
	
	ШаблонСтроки = "%1, %2";
	ВсеСчета = ОбщегоНазначения.СкопироватьРекурсивно(МассивСчетовСебестоимость);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСчета, МассивСчетовНакладныеРасходы);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСчета, МассивСчетовОбщехозяйственныеРасходы);
	КодыСчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВсеСчета, "Код"); 

	СвойстваСчетов = СвойстваСчетов(Документ);	
	
	ОтражатьВНалоговомУчете = Документ.ОтражатьВНалоговомУчете;
	
	ТабЧастиДляЗаполнения = Новый Массив;
	ТабЧастиДляЗаполнения.Добавить("ЗатратыПрямые");
	ТабЧастиДляЗаполнения.Добавить("ЗатратыОбщие");
	Если ОтражатьВНалоговомУчете Тогда
		ТабЧастиДляЗаполнения.Добавить("ЗатратыНУ");
		ВидыРасходовНУ = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
			Документ.ЗатратыНУ.Выгрузить( ,"ВидЗатрат").ВыгрузитьКолонку("ВидЗатрат"), "ВидРасходовНУ");
	КонецЕсли;
	
	Для Каждого ТабЧасть Из ТабЧастиДляЗаполнения Цикл
		
		Для Каждого СтрокаТабЧасти Из Документ[ТабЧасть] Цикл
		
			Если ТабЧасть <> "ЗатратыНУ" Тогда
				СтрокаДетально = ЗатратыДетально.Добавить();
			Иначе
				СтрокаДетально = ЗатратыДетальноНУ.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаДетально, СтрокаТабЧасти);
			
			СтруктураПоиска = Новый Структура(
				"СчетДт, КПСДт, КЭКДт, ПодразделениеДт,СубконтоДт1, СубконтоДт2, СубконтоДт3");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТабЧасти);
			
			УслугаРасход = "";
			ТипЗатрат    = "";
			Если ТабЧасть <> "ЗатратыОбщие" И МассивСчетовСебестоимость.Найти(СтрокаТабЧасти.СчетКт) <> Неопределено Тогда
				УслугаРасход = СтрШаблон(ШаблонСтроки,
					КодыСчетов.Получить(СтрокаТабЧасти.СчетКт), СтрокаТабЧасти.Номенклатура);
				ТипЗатрат    = УчетПроизводстваКлиентСервер.ТипЗатратСебестоимость();
			ИначеЕсли МассивСчетовНакладныеРасходы.Найти(СтрокаТабЧасти.СчетКт) <> Неопределено Тогда
				УслугаРасход = СтрШаблон(ШаблонСтроки,
					КодыСчетов.Получить(СтрокаТабЧасти.СчетКт), НСтр("ru = 'Накладные расходы'"));
				ТипЗатрат    = УчетПроизводстваКлиентСервер.ТипЗатратНакладныеРасходы();
			ИначеЕсли МассивСчетовОбщехозяйственныеРасходы.Найти(СтрокаТабЧасти.СчетКт) <> Неопределено Тогда
				УслугаРасход = СтрШаблон(ШаблонСтроки,
					КодыСчетов.Получить(СтрокаТабЧасти.СчетКт), НСтр("ru = 'Общехозяйственные расходы'"));
				ТипЗатрат    = УчетПроизводстваКлиентСервер.ТипЗатратОбщехозяйственныеРасходы();
			КонецЕсли;
			
			Если Документ.РежимОтображения <> 0 Тогда
				Если ТабЧасть <> "ЗатратыНУ" Тогда
					Если Документ.РежимОтображения = 1 Тогда // По разделам/подразделам КПС затрат.
						СтруктураПоиска.Вставить("КПСКт", Лев(СтрокаТабЧасти.КПСКт, 4));
					ИначеЕсли Документ.РежимОтображения = 2 Тогда // По КПС затрат.
						СтруктураПоиска.Вставить("КПСКт", СтрокаТабЧасти.КПСКт);
					КонецЕсли;
					УслугаРасход = УслугаРасход + ", " + СтруктураПоиска.КПСКт;
				Иначе
					// В режимах 1 "По разделам, подразделам" и 2 "По КПС затрат" строки НУ в сводной таблице располагаются отдельно.
					// Для них особым образом формируем описание и заполняем счет дебета.
					Если МассивСчетовСебестоимость.Найти(СтрокаТабЧасти.СчетКт) <> Неопределено Тогда
						УслугаРасход = Строка(СтрокаТабЧасти.СчетКт) + ", "+ СтрокаТабЧасти.Номенклатура;
					ИначеЕсли МассивСчетовНакладныеРасходы.Найти(СтрокаТабЧасти.СчетКт) <> Неопределено Тогда
						УслугаРасход = Строка(СтрокаТабЧасти.СчетКт) + ", Накладные расходы (НУ)";
					ИначеЕсли МассивСчетовОбщехозяйственныеРасходы.Найти(СтрокаТабЧасти.СчетКт) <> Неопределено Тогда
						УслугаРасход = Строка(СтрокаТабЧасти.СчетКт) + ", Общехозяйственные расходы (НУ)";
					ИначеЕсли МассивСчетовИздержкиОбращения.Найти(СтрокаТабЧасти.СчетКт) <> Неопределено Тогда
						УслугаРасход = Строка(СтрокаТабЧасти.СчетКт) + ", Издержки обращения (НУ)";
					КонецЕсли;
					СтруктураПоиска.СчетДт = УчетПроизводстваКлиентСервер.СчетСписанияПроизводственныхРасходовНУ(
						СтрокаДетально.СчетКт, ВидыРасходовНУ[СтрокаДетально.ВидЗатрат]);
				КонецЕсли;
			ИначеЕсли ТабЧасть = "ЗатратыНУ" Тогда
				СтруктураПоиска.СчетДт = УчетПроизводстваКлиентСервер.СчетСписанияПроизводственныхРасходовНУ(
					СтрокаДетально.СчетКт, ВидыРасходовНУ[СтрокаДетально.ВидЗатрат]);
			КонецЕсли;
			
			СтруктураПоиска.Вставить("ТипЗатрат",    ТипЗатрат);
			СтруктураПоиска.Вставить("УслугаРасход", УслугаРасход);
			Если ТипЗатрат = УчетПроизводстваКлиентСервер.ТипЗатратСебестоимость() Тогда
				СтруктураПоиска.Вставить("Номенклатура", СтрокаТабЧасти.Номенклатура);
			КонецЕсли;
			
			НайденныеСтроки = ЗатратыСводно.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				// Заполняем строку таблицы ЗатратыСводно
				СтрокаСводно = ЗатратыСводно.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСводно, СтруктураПоиска);
				
				СтрокаСводно.КлючСтроки   = Строка(Новый УникальныйИдентификатор);
				СтрокаСводно.Номенклатура = ?(ТипЗатрат = УчетПроизводстваКлиентСервер.ТипЗатратСебестоимость(),
					СтрокаТабЧасти.Номенклатура,
					Справочники.Номенклатура.ПустаяСсылка());
				
				СвойстваСчетаДт = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаСводно.СчетДт);
				СтрокаСводно.СубконтоДт1Доступность     = СвойстваСчетаДт.КоличествоСубконто>0;
				СтрокаСводно.СубконтоДт2Доступность     = СвойстваСчетаДт.КоличествоСубконто>1;
				СтрокаСводно.СубконтоДт3Доступность     = СвойстваСчетаДт.КоличествоСубконто>2;
				СтрокаСводно.ПодразделениеДтДоступность = СвойстваСчетаДт.УчетПоПодразделениям;
				СтрокаСводно.ПодразделениеДтОбязательно = НЕ СвойстваСчетаДт.РазрешитьНеУказыватьПодразделение;
				СтрокаСводно.СчетДт40120                = (МассивСчетов40120.Найти(СтрокаСводно.СчетДт) <> Неопределено);
				
			Иначе
				СтрокаСводно = НайденныеСтроки[0];
			КонецЕсли;
			
			СтрокаДетально.КлючСтроки = СтрокаСводно.КлючСтроки;
			
			// Заполним значение доп. субконто.
			СвойстваСчетаКт = СвойстваСчетов.Получить(СтрокаДетально.СчетКт);
			Если ТабЧасть = "ЗатратыПрямые" Тогда
				Если СвойстваСчетаКт <> Неопределено
						И СвойстваСчетаКт.ЕстьДопСубконто
						И СвойстваСчетаКт.НомерДопСубконто = 3 Тогда
					СтрокаДетально.ДопСубконто = СтрокаТабЧасти.СубконтоКт3;
					СтрокаДетально.ДопСубконтоДоступность = Истина;
				КонецЕсли;
			Иначе
				Если СвойстваСчетаКт <> Неопределено И СвойстваСчетаКт.ЕстьДопСубконто Тогда
					Если СвойстваСчетаКт.НомерДопСубконто = 2 Тогда
						СтрокаДетально.ДопСубконто = СтрокаТабЧасти.СубконтоКт2;
						СтрокаДетально.ДопСубконтоДоступность = Истина;
					ИначеЕсли СвойстваСчетаКТ.НомерДопСубконто = 3 Тогда
						СтрокаДетально.ДопСубконто = СтрокаТабЧасти.СубконтоКт3;
						СтрокаДетально.ДопСубконтоДоступность = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Подразделение Кт.
			СтрокаДетально.ПодразделениеКтДоступность = СвойстваСчетаКт <> Неопределено
				И СвойстваСчетаКт.ЕстьПодразделение;
			СтрокаСводно.ПодразделениеКтНеЗаполнено = СтрокаСводно.ПодразделениеКтНеЗаполнено
				ИЛИ НЕ ?(СвойстваСчетаКт <> Неопределено И СвойстваСчетаКт.ЕстьПодразделение,
					ЗначениеЗаполнено(СтрокаДетально.ПодразделениеКт), Истина);
			
			Если ТабЧасть <> "ЗатратыНУ" Тогда
				СтрокаСводно.Сумма = СтрокаСводно.Сумма + СтрокаДетально.Сумма;
			Иначе
				СтрокаСводно.СуммаНУ              = СтрокаСводно.СуммаНУ              + СтрокаДетально.Сумма;
				СтрокаСводно.СуммаЕНВД            = СтрокаСводно.СуммаЕНВД            + СтрокаДетально.СуммаЕНВД;
				СтрокаСводно.СуммаНеУчитываетсяНУ = СтрокаСводно.СуммаНеУчитываетсяНУ + СтрокаДетально.СуммаНеУчитываетсяНУ;
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
	ЗатратыСводно.Сортировать("УслугаРасход");
	
	Возврат Новый Структура("ЗатратыСводно,ЗатратыДетально,ЗатратыДетальноНУ",
		ЗатратыСводно, ЗатратыДетально, ЗатратыДетальноНУ);
	
КонецФункции

Функция СвойстваСчетов(Документ)
	Обработка = Обработки.ЗакрытиеСчетовПроизводственныхЗатрат.ИнициализироватьОбработку(Документ.Дата,
		Документ.Организация, Документ.ИФО, Документ.КФО, Ложь, Истина);
	Счета = Новый Соответствие;
	Для Каждого Строка Из Обработка.СчетаПрямыхЗатрат Цикл
		Счета.Вставить(Строка.СчетПрямыхЗатрат,
			Новый Структура("ЕстьПодразделение, ЕстьДопСубконто, ВидДопСубконто, НомерДопСубконто",
				Строка.ЕстьПодразделение, Строка.ЕстьДопСубконто, Строка.ВидДопСубконто, Строка.НомерДопСубконто));
	КонецЦикла;
	Для Каждого Строка Из Обработка.СчетаОбщихЗатрат Цикл
		Счета.Вставить(Строка.СчетОбщихЗатрат,
			Новый Структура("ЕстьПодразделение, ЕстьДопСубконто, ВидДопСубконто, НомерДопСубконто",
				Строка.ЕстьПодразделение, Строка.ЕстьДопСубконто, Строка.ВидДопСубконто, Строка.НомерДопСубконто));
	КонецЦикла;
	Возврат Счета;
КонецФункции

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор		= "ВедомостьСписанияЗатрат";
	КомандаПечати.Представление		= НСтр("ru = 'Ведомость списания затрат'");
	КомандаПечати.Порядок			= 1;

КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ВедомостьСписанияЗатрат") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															 "ВедомостьСписанияЗатрат",
															 "Ведомость списания затрат", 
															 ПодготовитьВедомость(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

Функция ПодготовитьВедомость(МассивОбъектов, ОбъектыПечати)
	
	// Получим данные о затратах из документов списания и со счетов БУ и НУ.
	ОстаткиЗатрат = ОстаткиЗатратПоДокументамСписания(МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗакрытиеСчетовБиотрансформации.ПФ_MXL_ВедомостьСписанияЗатрат");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаНУ   = Макет.ПолучитьОбласть("ШапкаНУ");
	ОбластьУслуга    = Макет.ПолучитьОбласть("Услуга");
	ОбластьСтрока    = Макет.ПолучитьОбласть("Строка");
	ОбластьВсего     = Макет.ПолучитьОбласть("Всего");
	
	Для Сч=1 По МассивОбъектов.Количество() Цикл
		
		ДокументСписания = МассивОбъектов[Сч-1];
		
		ПервыйДокумент = (Сч=1);
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТаблицаДокумента = ОстаткиЗатрат["ЗатратыПоДокументуСписания"+Сч].Выгрузить();
		
		ВыборкаВидУчета = ОстаткиЗатрат["ЗатратыПоДаннымУчета"+Сч].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВидУчета.Следующий() Цикл
			
			ОбластьЗаголовок.Параметры.Заполнить(ДокументСписания);
			СтруктураЗаполнения = Новый Структура();
			Если ВыборкаВидУчета.ВидУчета = "БУ" Тогда
				СтруктураЗаполнения.Вставить("ЗаголовокРаздела", НСтр("ru = 'Ведомость списания затрат в бухгалтерском учете'"));
			Иначе // НУ
				СтруктураЗаполнения.Вставить("ЗаголовокРаздела", НСтр("ru = 'Ведомость списания затрат в налоговом учете'"));
			КонецЕсли;
			СтруктураЗаполнения.Вставить("ДатаДокумента", Формат(ДокументСписания.Дата, "ДЛФ=D"));
			СтруктураЗаполнения.Вставить("НаименованиеОрганизации", ДокументСписания.Организация);
			ОбластьЗаголовок.Параметры.Заполнить(СтруктураЗаполнения);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			Если ВыборкаВидУчета.ВидУчета = "БУ" Тогда
				ТабличныйДокумент.Вывести(ОбластьШапка);
			Иначе // НУ
				ТабличныйДокумент.Вывести(ОбластьШапкаНУ);
			КонецЕсли;
			
			ВыборкаТипЗатрат = ВыборкаВидУчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаТипЗатрат.Следующий() Цикл
			ВыборкаНоменклатура = ВыборкаТипЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНоменклатура.Следующий() Цикл
			ВыборкаУслугаРасход = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаУслугаРасход.Следующий() Цикл
				
				СтруктураЗаполнения = Новый Структура("Номенклатура", ВыборкаУслугаРасход.УслугаРасход);
				
				// Итоги по группировке "Услуга (расход)"
				Если ВыборкаУслугаРасход.ВидУчета = "БУ" Тогда
					СтруктураЗаполнения.Вставить("Сумма",   ВыборкаУслугаРасход.СуммаКСписанию);
					СтруктураЗаполнения.Вставить("Сальдо",  ВыборкаУслугаРасход.СуммаОстаток);
					СтруктураЗаполнения.Вставить("Остаток", ВыборкаУслугаРасход.СуммаОстаток - ВыборкаУслугаРасход.СуммаКСписанию);
				Иначе // НУ
					СтруктураЗаполнения.Вставить("Сумма",   ВыборкаУслугаРасход.СуммаКСписаниюНУ);
					СтруктураЗаполнения.Вставить("Сальдо",  ВыборкаУслугаРасход.СуммаОстаток);
					СтруктураЗаполнения.Вставить("Остаток", ВыборкаУслугаРасход.СуммаОстаток - ВыборкаУслугаРасход.СуммаКСписаниюНУ);
				КонецЕсли;
				ОбластьУслуга.Параметры.Заполнить(СтруктураЗаполнения);
				ТабличныйДокумент.Вывести(ОбластьУслуга);
				
				ТабличныйДокумент.НачатьГруппуСтрок();
				
				Выборка = ВыборкаУслугаРасход.Выбрать();
				Пока Выборка.Следующий() Цикл
					
					СтруктураПоиска = Новый Структура("ВидУчета,ТипЗатрат,УслугаРасход,Номенклатура,ВидЗатрат,ДопСубконто,СчетКт,КПСКт,КЭККт");
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
					СтрокиДокумента = ТаблицаДокумента.НайтиСтроки(СтруктураПоиска);
					
					ЗатратыСписаныНаРазныеСчетаДт = СтрокиДокумента.Количество()>1;
					Если ЗатратыСписаныНаРазныеСчетаДт Тогда
						
						// Выводим отдельно итоги по остаткам
						СтруктураЗаполнения = ЗаполнитьСтрокуВедомости(Выборка, Неопределено, Ложь, Истина, ДокументСписания);
						ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
						ОбластьСтрока.Параметры.Заполнить(СтруктураЗаполнения);
						ТабличныйДокумент.Вывести(ОбластьСтрока);
						
						// Выводим отдельно строки списания из документа
						ТабличныйДокумент.НачатьГруппуСтрок();
						Для Каждого СтрокаДокумента Из СтрокиДокумента Цикл
							СтруктураЗаполнения = ЗаполнитьСтрокуВедомости(Выборка, СтрокаДокумента, Истина, Ложь, ДокументСписания);
							ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаДетализации");
							ОбластьСтрока.Параметры.Заполнить(СтруктураЗаполнения);
							ТабличныйДокумент.Вывести(ОбластьСтрока);
						КонецЦикла;
						ТабличныйДокумент.ЗакончитьГруппуСтрок();
						
					Иначе
						
						// Выводим всю информацию в одной строке
						СтруктураЗаполнения = ЗаполнитьСтрокуВедомости(Выборка, СтрокиДокумента[0], Истина, Истина, ДокументСписания);
						ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
						ОбластьСтрока.Параметры.Заполнить(СтруктураЗаполнения);
						ТабличныйДокумент.Вывести(ОбластьСтрока);
						
					КонецЕсли;
					
				КонецЦикла;
				
				ТабличныйДокумент.ЗакончитьГруппуСтрок();
				
			КонецЦикла;
			КонецЦикла;
			КонецЦикла;
			
			// Общий итог
			Если ВыборкаВидУчета.ВидУчета = "БУ" Тогда
				СтруктураЗаполнения.Вставить("Сумма",   ВыборкаВидУчета.СуммаКСписанию);
				СтруктураЗаполнения.Вставить("Сальдо",  ВыборкаВидУчета.СуммаОстаток);
				СтруктураЗаполнения.Вставить("Остаток", ВыборкаВидУчета.СуммаОстаток - ВыборкаВидУчета.СуммаКСписанию);
			Иначе // НУ
				СтруктураЗаполнения.Вставить("Сумма",   ВыборкаВидУчета.СуммаКСписаниюНУ);
				СтруктураЗаполнения.Вставить("Сальдо",  ВыборкаВидУчета.СуммаОстаток);
				СтруктураЗаполнения.Вставить("Остаток", ВыборкаВидУчета.СуммаОстаток - ВыборкаВидУчета.СуммаКСписаниюНУ);
			КонецЕсли;
			ОбластьВсего.Параметры.Заполнить(СтруктураЗаполнения);
			ТабличныйДокумент.Вывести(ОбластьВсего);
			
		КонецЦикла;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДокументСписания);
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ЗаполнитьСтрокуВедомости(Выборка, СтрокаДокумента, ЗаполнятьДт, ЗаполнятьКт, ДокументСписания)
	
	СтруктураЗаполнения = Новый Структура();

	ИспользуетсяПроизвольныйТипКПС = БухгалтерскиеОперации.ИспользуетсяПроизвольныйТипКПС(
		ДокументСписания.Организация, ДокументСписания.ИФО, ДокументСписания.КФО, ДокументСписания.Дата);
	МассивСчетов40120 = БухгалтерскийУчет.СписокСчетов("401.20");
	
	Если Выборка.ВидУчета = "БУ" Тогда
		
		СтруктураЗаполнения.Вставить("Сумма", ?(СтрокаДокумента=Неопределено, Выборка.СуммаКСписанию, СтрокаДокумента.СуммаКСписанию));
		
		Если ЗаполнятьДт Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаДокумента.КПСДт) И
				(МассивСчетов40120.Найти(СтрокаДокумента.СчетДт) <> Неопределено ИЛИ ИспользуетсяПроизвольныйТипКПС) Тогда
				КПСДт = СтрокаДокумента.КПСКт; // КПС Дт заполняется из Кт
			Иначе
				КПСДт = СтрокаДокумента.КПСДт;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаДокумента.КЭКДт) И
				(МассивСчетов40120.Найти(СтрокаДокумента.СчетДт) <> Неопределено) Тогда
				КЭКДт = СтрокаДокумента.КЭККт; // КЭК Дт заполняется из Кт
			Иначе
				КЭКДт = СтрокаДокумента.КЭКДт;
			КонецЕсли;
			
			СтруктураЗаполнения.Вставить("СчетДебета", Строка(КПСДт)
											+ "." + Строка(ДокументСписания.КФО)
											+ "." + Строка(СтрокаДокумента.СчетДт)
											+ "." + Строка(КЭКДт));
			СтруктураЗаполнения.Вставить("СубконтоСчетДебета",
				?(ЗначениеЗаполнено(СтрокаДокумента.СубконтоДт1), Строка(СтрокаДокумента.СубконтоДт1), "") +
				?(ЗначениеЗаполнено(СтрокаДокумента.СубконтоДт2), ", "+СтрокаДокумента.СубконтоДт2, "") +
				?(ЗначениеЗаполнено(СтрокаДокумента.СубконтоДт3), ", "+СтрокаДокумента.СубконтоДт3, ""));
			
		КонецЕсли;
		
		Если ЗаполнятьКт Тогда
			
			СтруктураЗаполнения.Вставить("ВидЗатрат", Выборка.ВидЗатрат);
			СтруктураЗаполнения.Вставить("СчетЗатрат", Строка(Выборка.КПСКт)
											+ "." + Строка(ДокументСписания.КФО)
											+ "." + Строка(Выборка.СчетКт)
											+ "." + Строка(Выборка.КЭККт));
			СтруктураЗаполнения.Вставить("ДопСубконто", Выборка.ДопСубконто);
			
			СтруктураЗаполнения.Вставить("Сальдо",  Выборка.СуммаОстаток);
			СтруктураЗаполнения.Вставить("Остаток", Выборка.СуммаОстаток - Выборка.СуммаКСписанию);
			
		КонецЕсли;
		
	Иначе // НУ
		
		СтруктураЗаполнения.Вставить("Сумма", ?(СтрокаДокумента=Неопределено, Выборка.СуммаКСписаниюНУ, СтрокаДокумента.СуммаКСписаниюНУ));
		
		Если ЗаполнятьДт Тогда
			
			СтруктураЗаполнения.Вставить("СчетДебета",
				УчетПроизводстваКлиентСервер.СчетСписанияПроизводственныхРасходовНУ(Выборка.СчетКт, Выборка.ВидРасходовНУ));
			СтруктураЗаполнения.Вставить("СубконтоСчетДебета",
				?(ЗначениеЗаполнено(СтрокаДокумента.СубконтоДт1), Строка(СтрокаДокумента.СубконтоДт1), "") +
				?(ЗначениеЗаполнено(СтрокаДокумента.СубконтоДт2), ", "+СтрокаДокумента.СубконтоДт2, "") +
				?(ЗначениеЗаполнено(СтрокаДокумента.СубконтоДт3), ", "+СтрокаДокумента.СубконтоДт3, ""));
			
		КонецЕсли;
		
		Если ЗаполнятьКт Тогда
			
			СтруктураЗаполнения.Вставить("ВидЗатрат", Выборка.ВидЗатрат);
			СтруктураЗаполнения.Вставить("СчетЗатрат", Строка(Выборка.СчетКт));
			СтруктураЗаполнения.Вставить("ДопСубконто", Выборка.ДопСубконто);
			
			СтруктураЗаполнения.Вставить("Сальдо",  Выборка.СуммаОстаток);
			СтруктураЗаполнения.Вставить("Остаток", Выборка.СуммаОстаток - Выборка.СуммаКСписаниюНУ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураЗаполнения;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
