
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если не ЗначениеЗаполнено(Запись.Владелец) Тогда 
		Элементы.Владелец.ТолькоПросмотр = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	Если не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
	ЗначенияЗаполнения = Новый Структура("Владелец,ИмяМакета,ТипМакета");
	ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения,Запись);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",ЗначенияЗаполнения);
	
	ОткрытьФорму("РегистрСведений.ХранимыеМакетыНастроекОтчетов.ФормаЗаписи",ПараметрыФормы,ЭтаФорма.ВладелецФормы,ЭтаФорма.КлючУникальности,ЭтаФорма.Окно,ЭтаФорма.НавигационнаяСсылка,ЭтаФорма.ОписаниеОповещенияОЗакрытии,ЭтаФорма.РежимОткрытияОкна);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


