
#Область ПрограммныйИнтерфейс

// Обработать выбор файла особого мнения сотрудника.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ДокументыСФайламиСотрудников
//  Сотрудник - СправочникСсылка.Сотрудники
//  Файл - ОпределяемыйТип.ПрисоединенныйФайл
Процедура ОбработатьВыборФайлаОсобогоМненияСотрудника(Знач Документ, Знач Сотрудник, Знач Файл) Экспорт
	
	РегистрыСведений.ФайлыСотрудниковКДокументам.ЗаписатьФайлСотрудника(Документ, Сотрудник, Файл);
	
КонецПроцедуры

// Удалить файл особого мнения сотрудника.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ДокументыСФайламиСотрудников
//  Сотрудник - СправочникСсылка.Сотрудники
Процедура УдалитьФайлОсобогоМненияСотрудника(Знач Документ, Знач Сотрудник) Экспорт
	
	РегистрыСведений.ФайлыСотрудниковКДокументам.УдалитьФайлСотрудника(Документ, Сотрудник);
	
КонецПроцедуры

// Получить файл особого мнения сотрудника.
// 
// Параметры:
//  Документ - ОпределяемыйТип.ДокументыСФайламиСотрудников
//  Сотрудник - СправочникСсылка.Сотрудники
// 
// Возвращаемое значение:
//  ОпределяемыйТип.ПрисоединенныйФайл, Неопределено -
Функция ПолучитьФайлОсобогоМненияСотрудника(Знач Документ, Знач Сотрудник) Экспорт
	Возврат РегистрыСведений.ФайлыСотрудниковКДокументам.ФайлСотрудника(Документ, Сотрудник);
КонецФункции

Функция ВернутьСтрокуТипаПоТипу(ТекТип,Режим) Экспорт
	
	Возврат ОбщегоНазначенияБГУ.ВернутьСтрокуТипаПоТипу(ТекТип,Режим);
	
КонецФункции

// см. Справочники.ПостоянноДействующиеКомиссии.ПолучитьДанныеКомиссии
Функция ПолучитьДанныеКомиссии(Результат, ОбъектДата) Экспорт
	
	Возврат Справочники.ПостоянноДействующиеКомиссии.ПолучитьДанныеКомиссии(Результат, ОбъектДата);
	
КонецФункции

// Возвращает представление ссылки счета ЕПСБУ.
// Представление формируется из кода и даты окончания действия счета. Если дата окончания заполнена,
// то к представлению добавляется текст " (до <Следующий день после даты окончания действия>)".
//
// Параметры:
//  Код						 - Строка - код счета.
//  ДатаОкончанияДействия	 - Дата - дата оконачения действия счета.
//  СтандартнаяОбработка     - Булево - признак стандартной обработки получения представления.
// 
// Возвращаемое значение:
//  Строка - представление ссылки.
//
Функция ПредставлениеСчетаЕПСБУ(Знач Код, Знач ДатаОкончанияДействия, СтандартнаяОбработка = Истина) Экспорт
	
	Если ЗначениеЗаполнено(ДатаОкончанияДействия) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат СтрШаблон(НСтр("ru = '%1 (до %2)'"), Код, Формат(ДатаОкончанияДействия + 86400, "ДЛФ=D"));
	Иначе
		Возврат Код;
	КонецЕсли;
	
КонецФункции

Функция СтранаПоSWIFT(СВИФТБИК) Экспорт
	
	Возврат Справочники.Банки.СтранаПоSWIFT(СВИФТБИК);
	
КонецФункции

Процедура АвтоподборНаселенногоПункта(Знач Текст, ДанныеВыбора) Экспорт
	
	Если Метаданные.Обработки.Найти("РасширенныйВводКонтактнойИнформации") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипАдреса = "";
	
	ДополнительныеПараметры = УправлениеКонтактнойИнформациейСлужебный.ПараметрыАвтоподбораАдреса();
	ДополнительныеПараметры.Уровни    = "1,3,31,4,41,5,6,65";
	ДополнительныеПараметры.ТипАдреса = ТипАдреса;
	
	Результат = Обработки["РасширенныйВводКонтактнойИнформации"].СписокАвтоподбораНаселенногоПункта(Текст, ДополнительныеПараметры);
	Если Результат.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеКонтактнойИнформациейСлужебный.ФорматированиеРезультатовАвтоподбора(Результат.Данные, Текст, ПустаяСтрока(ТипАдреса));
	
	ДанныеВыбора = Результат.Данные;
	
КонецПроцедуры

Функция СравнитьДвиженияДокумента(Документ) Экспорт
	
	Возврат Отчеты.ДвиженияДокументаБГУ.СравнитьДвиженияДокумента(Документ);
	
КонецФункции

Функция ЕстьПравоГолосования() Экспорт
	
	Возврат ПравоДоступа("Изменение", Метаданные.РегистрыСведений.РезультатыГолосованияКомиссий);
	
КонецФункции

// см. ОбщегоНазначенияБГУ.ДанныеПрекращенияДоговораСМОЛ
Функция ДанныеПрекращенияДоговораСМОЛ(Знач ДоговорСсылка, Знач Проведен = Ложь) Экспорт

	Возврат ОбщегоНазначенияБГУ.ДанныеПрекращенияДоговораСМОЛ(ДоговорСсылка, Проведен);
	
КонецФункции

#КонецОбласти
