
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МакетРасшифровки = ПолучитьОбщийМакет("РасшифровкаПоказателейРегламентированныхОтчетовПоДрагМатериалам");
	
	ИсходнаяТаблицаРасшифровок = ПолучитьИзВременногоХранилища(Параметры.АдресВременногоХранилищаРасшифровки);
	
	Если ТипЗнч(ИсходнаяТаблицаРасшифровок) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Если ИсходнаяТаблицаРасшифровок.Колонки.Найти("Организация") = Неопределено Тогда
		ИсходнаяТаблицаРасшифровок.Колонки.Добавить("Организация");
	КонецЕсли;
	
	ИсходнаяТаблицаРасшифровок.Индексы.Добавить("ИмяПоказателя");
	
	ЕстьПоказателиИзСписка = Ложь;
	
	Для Каждого ИмяПоказателя Из Параметры.ИДИменПоказателей Цикл
		Если ИсходнаяТаблицаРасшифровок.Найти(ИмяПоказателя, "ИмяПоказателя") <> Неопределено Тогда
			ЕстьПоказателиИзСписка = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ВидОтчета = Параметры.ВидОтчета;
	
	Если ЕстьПоказателиИзСписка Тогда
		Для Каждого ИмяПоказателя Из Параметры.ИДИменПоказателей Цикл
			ВывестиРасшифровкуПоказателя(ВидОтчета, МакетРасшифровки, ИсходнаяТаблицаРасшифровок, ИмяПоказателя);
		КонецЦикла;
		
	Иначе
		ВывестиРасшифровкуПоказателя(ВидОтчета, МакетРасшифровки, ИсходнаяТаблицаРасшифровок, ИмяПоказателя, Истина);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРасшифровкуПоказателя(ВидОтчета, МакетРасшифровки, ТаблицаРасшифровок, ИмяПоказателя, НулеваяРасшифровка = Ложь)
	
	СекцияЗаголовок = МакетРасшифровки.ПолучитьОбласть("Заголовок");
	СекцияИтог      = МакетРасшифровки.ПолучитьОбласть("Итог");
	СекцияПлюс      = МакетРасшифровки.ПолучитьОбласть("Плюс");
	СекцияМинус     = МакетРасшифровки.ПолучитьОбласть("Минус");
	СекцияСлагаемое = МакетРасшифровки.ПолучитьОбласть("Слагаемое");
	
	СекцияНазваниеОрг         = МакетРасшифровки.ПолучитьОбласть("НазваниеОрг");
	СекцияНазваниеОргБезПлюса = МакетРасшифровки.ПолучитьОбласть("НазваниеОргБезПлюса");
	
	Если НулеваяРасшифровка Тогда
		ЭтаФорма.Заголовок =  "Расшифровка содержания драг. материалов в объектах учета";
		СекцияЗаголовок.Области.НаименованиеЗаголовок.Значение = ПолучитьНаименованиеЗаголовка(ВидОтчета, ИмяПоказателя);
		ПолеРасшифровки.Вывести(СекцияЗаголовок);
		
		СекцияИтог.Области.ИтогМасса.Значение = 0;
		ПолеРасшифровки.Вывести(СекцияИтог);
		
		Возврат;
	КонецЕсли;	
	
	СтрокиРасшифровки = ТаблицаРасшифровок.НайтиСтроки(Новый Структура("ИмяПоказателя", ИмяПоказателя));
	Если СтрокиРасшифровки.Количество() > 0 Тогда
		
		НетРасшифровок = Ложь;
		
		Организации = Новый ТаблицаЗначений;
		Организации.Колонки.Добавить("Организация");
		Организации.Колонки.Добавить("Масса");
		
		Для Каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
			Если ЗначениеЗаполнено(СтрокаРасшифровки.Организация) Тогда
				Организация = СтрокаРасшифровки.Организация;
			Иначе
				Организация = "Без указания организации";
				Если ТаблицаРасшифровок.Колонки.Найти("ДополнительныеПараметры") <> Неопределено
				   И ТипЗнч(СтрокаРасшифровки.ДополнительныеПараметры) = Тип("Структура")
				   И СтрокаРасшифровки.ДополнительныеПараметры.Свойство("Организация") Тогда
					Если ЗначениеЗаполнено(СтрокаРасшифровки.ДополнительныеПараметры.Организация) Тогда
						Организация = СтрокаРасшифровки.ДополнительныеПараметры.Организация;
					КонецЕсли;
				КонецЕсли;
				СтрокаРасшифровки.Организация = Организация;
			КонецЕсли;
			
			НайденнаяСтрока = Организации.Найти(Организация, "Организация");
			Если НайденнаяСтрока = Неопределено Тогда
				НоваяСтрока = Организации.Добавить();
				НоваяСтрока.Организация = Организация;
				НоваяСтрока.Масса = СтрокаРасшифровки.Масса;
			Иначе
				НайденнаяСтрока.Масса = НайденнаяСтрока.Масса + СтрокаРасшифровки.Масса;
			КонецЕсли;
		КонецЦикла;
		
		ПоНесколькимОрганизациям = (Организации.Количество() > 1);
		
		ПолеРасшифровки.Вывести(СекцияЗаголовок);
		
		ИтоговаяМасса = 0;
		ПерваяОрганизация = Истина;
		Для Каждого Организация Из Организации Цикл
			
			Если ПерваяОрганизация Тогда
				СекцияОрганизации = СекцияНазваниеОргБезПлюса;
				ПерваяОрганизация = Ложь;
			Иначе
				СекцияОрганизации = СекцияНазваниеОрг;
			КонецЕсли;
			
			Если ПоНесколькимОрганизациям Тогда
				СекцияОрганизации.Параметры.ИтогПоОрганизации = Организация.Масса;
				СекцияОрганизации.Параметры.НазваниеОрганизации = Организация.Организация;
				ПолеРасшифровки.Вывести(СекцияОрганизации);
			КонецЕсли;
			
			ПерваяСтрока = Истина;
			
			ЭтаФорма.Заголовок =  "Расшифровка содержания драг. материалов в объектах учета";
			ПолеРасшифровки.Области.НаименованиеЗаголовок.Значение = ПолучитьНаименованиеЗаголовка(ВидОтчета, СтрокаРасшифровки.ИмяПоказателя);
			
			Для Каждого СтрокаРасшифровки Из СтрокиРасшифровки Цикл
				
				Если СтрокаРасшифровки.Организация <> Организация.Организация Тогда
					Продолжить;
				КонецЕсли;
				
				Если Не ПустаяСтрока(СтрокаРасшифровки.ОбъектНФА) Тогда
					
					Если ЗначениеЗаполнено(СтрокаРасшифровки.ИнвНомер) Тогда
						НаименованиеСтроки = СтрокаРасшифровки.ТипОбъектаНФА + ": "+СтрокаРасшифровки.ОбъектНФА+" (Инв.№ "+Строка(СтрокаРасшифровки.ИнвНомер)+")";
					Иначе
						НаименованиеСтроки = СтрокаРасшифровки.ТипОбъектаНФА + ": "+СтрокаРасшифровки.ОбъектНФА;
					КонецЕсли;	
					НаименованиеСтроки = НаименованиеСтроки + ?(СтрокаРасшифровки.Количество = 0, "", " в количестве "+Строка(СтрокаРасшифровки.Количество)+" "+Строка(СтрокаРасшифровки.ЕдиницаИзмерения));
					НаименованиеСтроки = НаименованиеСтроки + " содержит "+?(ТипЗнч(СтрокаРасшифровки.ДрагМатериал) = Тип("Массив"), "металлы платиновой группы", Нрег(Строка(СтрокаРасшифровки.ДрагМатериал)))+" (г)";
					
					СекцияСлагаемое.Области.СлагаемоеНаименование.Значение = НаименованиеСтроки;
					СекцияСлагаемое.Области.СлагаемоеМасса.Значение = СтрокаРасшифровки.Масса;
					
					ПолеРасшифровки.Вывести(СекцияСлагаемое);
					
					ИтоговаяМасса = ИтоговаяМасса + СтрокаРасшифровки.Масса;
				Иначе
					Если НЕ ПерваяСтрока Тогда
						Если СтрокаРасшифровки.ЗнакОперации = "-" Тогда
							ПолеРасшифровки.Вывести(СекцияМинус);
						ИначеЕсли СтрокаРасшифровки.ЗнакОперации = "+" Тогда
							ПолеРасшифровки.Вывести(СекцияПлюс);
						КонецЕсли;
					Иначе
						ПерваяСтрока = Ложь;
					КонецЕсли;
					
					ПолеРасшифровки.Вывести(СекцияСлагаемое);
					
					ПолеРасшифровки.Области.СлагаемоеНаименование.Значение = ПолучитьПолноеНаименованиеСлагаемого(ВидОтчета, СтрокаРасшифровки.НаименованиеСлагаемого) + ПолучитьНаименованиеДополнительныхПараметров(СтрокаРасшифровки.ДополнительныеПараметры);
					ПолеРасшифровки.Области.СлагаемоеМасса.Значение        = СтрокаРасшифровки.Масса;
					
					Если СтрокаРасшифровки.ДополнительныеПараметры <> Неопределено
					   И ТипЗнч(СтрокаРасшифровки.ДополнительныеПараметры) = Тип("Структура")
					   И СтрокаРасшифровки.ДополнительныеПараметры.Свойство("Отчет") Тогда
						РасшифровкаОбласти = СтрокаРасшифровки.ДополнительныеПараметры.Отчет;
						ПолеРасшифровки.Области.СлагаемоеНаименование.Расшифровка = РасшифровкаОбласти;
						ПолеРасшифровки.Области.СлагаемоеМасса.Расшифровка = РасшифровкаОбласти;
					КонецЕсли;
					
					Если СтрокаРасшифровки.ЗнакОперации = "-" Тогда
						ИтоговаяМасса = ИтоговаяМасса - СтрокаРасшифровки.Масса;
					Иначе
						ИтоговаяМасса = ИтоговаяМасса + СтрокаРасшифровки.Масса;
					КонецЕсли;
					
				КонецЕсли;        
				
			КонецЦикла;
		КонецЦикла;
		
		// Вывод итога.
		ПолеРасшифровки.Вывести(СекцияИтог);
		ПолеРасшифровки.Области.ИтогМасса.Значение = ИтоговаяМасса;
		
	КонецЕсли;
	
КонецПроцедуры


// Функция возвращает полное наименования слагаемого после обработки макросов в имени
//
// Параметры
//     НаименованиеСлагаемого  - Строка - Исходное наименование слагаемого
//                 
// Возвращаемое значение:
//     Строка  - Обработанное наименование слагаемого
//
&НаСервере
Функция ПолучитьПолноеНаименованиеСлагаемого(ВидОтчетаДМ, НаименованиеСлагаемого)
	
	Результат = УчетДрагматериалов.ПолучитьПолноеНаименованиеСлагаемого(ВидОтчетаДМ, НаименованиеСлагаемого);
	
	Возврат Результат;
	
КонецФункции // ПолучитьПолноеНаименованиеСлагаемого()

&НаСервере
Функция ПолучитьНаименованиеЗаголовка(ВидОтчетаДМ, ИмяПоказателя)

	Результат = УчетДрагматериалов.ПолучитьНаименованиеЗаголовка(ВидОтчетаДМ, ИмяПоказателя);
	
	Возврат Результат;
	
КонецФункции // ПолучитьНаименованиеЗаголовка()

&НаСервере
Функция ПолучитьНаименованиеДополнительныхПараметров(ДополнительныеПараметры)
	
	НаименованиеДополнительныхПараметров = "";
	
	Возврат НаименованиеДополнительныхПараметров;
	
КонецФункции

&НаКлиенте
Процедура ПолеРасшифровкиОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") И Расшифровка.Свойство("ИмяОтчета") Тогда
		
		ИмяФормыОтчета = Расшифровка.ИмяОтчета;
		
		ПараметрыФормы = Новый Структура;
		
		Если Расшифровка.Свойство("ПараметрыФормы") Тогда
			Для Каждого ЭлементНастройки Из Расшифровка.ПараметрыФормы Цикл
				ПараметрыФормы.Вставить(ЭлементНастройки.Ключ, ЭлементНастройки.Значение);
			КонецЦикла;
		КонецЕсли;
		
		Если Расшифровка.Свойство("ПользовательскиеНастройки") Тогда
			ПараметрыФормы.Вставить("ПользовательскиеНастройки", Расшифровка.ПользовательскиеНастройки);
		КонецЕсли;
		
		ОткрытьФорму(ИмяФормыОтчета, ПараметрыФормы, , Истина);
		
	КонецЕсли;
	
КонецПроцедуры
